#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	// Евросиб Фролов (04.04.2022 Task №49392
	ТипЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Отбор.Локация.Значение, "Тип");
	Если ТипЛокации <> Справочники.ТипыЛокаций.Терминал Тогда
		ОбщегоНазначения.СообщитьПользователю("Добавление подстоков контейнеров доступно только для терминалов. Тип выбранной локации - " + ТипЛокации);
		Отказ = Истина;
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

#КонецЕсли
