
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЪИмя = "РазрешенныеЕИ";
	Объект[ЪИмя].Очистить();
	Для каждого Стр из РазрешенныеЕИ Цикл
		Объект[ЪИмя].Добавить().Элемент = Стр.Значение;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНеИспользовать) и Объект.НеИспользовать Тогда
		Объект.ДатаНеИспользовать = ТекущаяДата();
	КонецЕсли;
	
	// Евросиб Ситников К.А.(24.06.2025 TASK №112671)	
    Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
	
        ЕстьВСписке = Ложь;        
	       Для Каждого ЕИ Из Объект.РазрешенныеЕИ Цикл
	            Если ЕИ.Элемент = Объект.ЕдиницаИзмерения Тогда
	                ЕстьВСписке = Истина;
	                Прервать;
	            КонецЕсли;
	       КонецЦикла;
        
       Если ЕстьВСписке = Ложь Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Необходимо указать Единицу измерений из разрешённых";
            Сообщение.Поле = "Объект.ЕдиницаИзмерения";
            Сообщение.УстановитьДанные(ЭтотОбъект);
            Сообщение.Сообщить();
            Отказ = Истина;
       КонецЕсли;
	КонецЕсли;
    // Евросиб Ситников К.А.(24.06.2025 TASK №112671)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешенныеЕИ.ЗагрузитьЗначения(Объект.РазрешенныеЕИ.Выгрузить().ВыгрузитьКолонку("Элемент"));
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 ) 
	
	//Евросиб - АСуслов 18.01.2023 11:00:49 #63097
	//(
	СформироватьТаблицуОбязательныхПолейВАкцепте();
	//)
	//Евросиб - АСуслов 18.01.2023 11:00:51 #63097 
	//Евросиб - АСуслов 02.02.2023 9:32:16 #64514
	//(                          
	РаботаСДМРазрешена = Пользователи.РолиДоступны("ПолныеПрава, dc_РаботаСДетскийМир");
	Если РаботаСДМРазрешена Тогда
		КонтрагентДетскийМир = Константы.КонтрагентДетскийМир.Получить();
		РаботаСДМРазрешена = ЗначениеЗаполнено(КонтрагентДетскийМир);
	КонецЕсли;
	Элементы.ГруппаДетскийМир.Видимость = РаботаСДМРазрешена;
	//)
	//Евросиб - АСуслов 02.02.2023 9:32:18 #64514
	
	//Субботин 16.06.23 TASK 70840 начало
	ПолеВвода 				= Элементы.Вставить("НеИспользовать", Тип("ПолеФормы"), Элементы.Группа2,Элементы.ГруппаВидУслуги);
	ПолеВвода.Вид 			= ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным 	= "Объект.НеИспользовать";
	ПолеВвода.Заголовок	 	= "Не использовать"; 
	ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ПолеВвода 				= Элементы.Вставить("ДатаНеИспользовать", Тип("ПолеФормы"), Элементы.Группа2,Элементы.ГруппаВидУслуги);
	ПолеВвода.Вид 			= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 	= "Объект.ДатаНеИспользовать";
	ПолеВвода.Заголовок	 	= "Не используется с"; 
	//Субботин 16.06.23 TASK 70840 конец
	
	//Евросиб Каблов 28.06.2023 ( #64831
	Элементы.РазноситьНаВидТранспортногоСообщения.Доступность = Объект.РазноситьНаПрямые;
	Элементы.СпособРазнесения.Доступность = Объект.РазноситьНаПрямые;
	//Евросиб Каблов 28.06.2023 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



//Евросиб - АСуслов 07.09.2022 13:35:29 #56540
//(
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.КоличествоДнейДоДатыОказанияУслуги.Видимость = Объект.ОграничитьДатуНачалаОказанияУслуги;
	Элементы.КоличествоДнейПослеДатыОказанияУслуги.Видимость = Объект.ОграничитьДатуОкончанияОказанияУслуги;
	//Евросиб - АСуслов 20.01.2023 13:32:49 #63097
	//(
	Элементы.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки.Видимость = Объект.АлгоритмПодбораСделокПоПериоду = 2;
	Элементы.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки.Видимость = Объект.АлгоритмПодбораСделокПоПериоду = 2;
	//)
	//Евросиб - АСуслов 20.01.2023 13:32:56 #63097     
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьДатуНачалаОказанияУслугиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьДатуОкончанияОказанияУслугиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
//)
//Евросиб - АСуслов 07.09.2022 13:35:29 #56540

//Евросиб - АСуслов 18.01.2023 11:42:42 #63097
//(
&НаСервере
Процедура СформироватьТаблицуОбязательныхПолейВАкцепте()
	
	РеквизитыТЧУслугиАкцепты = Метаданные.Документы.Акцепт.ТабличныеЧасти.Услуги.Реквизиты;
	
	//совпадения - это выбранные поля для этой номенклатуры
	МассивВыбораОбязательныхПолейНоменклатурыАкцепта = Документы.Акцепт.ПолучитьМассивСписокВыбораОбязательныхПолейНоменклатурыАкцепта();
	МассивОбязательныхПолейВАкцепте = Документы.Акцепт.ПолучитьМассивСписокОбязательныхПолейВАкцепте(Объект.Ссылка);
	ТаблицаОбязательныеПоляВАкцепте = ОбязательныеПоляВАкцепте.Выгрузить();
	
	Для каждого ЗначениеВыбораОбязательныхПолейНоменклатурыАкцепта Из МассивВыбораОбязательныхПолейНоменклатурыАкцепта Цикл
		Если РеквизитыТЧУслугиАкцепты.Найти(ЗначениеВыбораОбязательныхПолейНоменклатурыАкцепта) = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не найден реквизит %1 в табличной части «услуги» документа «акцепт». Настройка обязательности заполнения этого поля в акцепте пропущена.",
			ЗначениеВыбораОбязательныхПолейНоменклатурыАкцепта));
			Продолжить;
		КонецЕсли;
		СтрокаОбязательноеПоле = ТаблицаОбязательныеПоляВАкцепте.Добавить();
		СтрокаОбязательноеПоле.ИмяРеквизитаТЧУслуги = ЗначениеВыбораОбязательныхПолейНоменклатурыАкцепта;
		СтрокаОбязательноеПоле.ИмяПоля = РеквизитыТЧУслугиАкцепты[ЗначениеВыбораОбязательныхПолейНоменклатурыАкцепта].Представление();

	КонецЦикла;                                                                                                      
	Для каждого ЗначениеОбязательныхПолейВАкцепте Из МассивОбязательныхПолейВАкцепте Цикл
		СтрокаВыбораОбязательногоПоля = ТаблицаОбязательныеПоляВАкцепте.Найти(ЗначениеОбязательныхПолейВАкцепте, "ИмяРеквизитаТЧУслуги");
		Если НЕ СтрокаВыбораОбязательногоПоля = Неопределено Тогда
			СтрокаВыбораОбязательногоПоля.ОбязательноеПоле = Истина;
		КонецЕсли;
	КонецЦикла;  
	ОбязательныеПоляВАкцепте.Загрузить(ТаблицаОбязательныеПоляВАкцепте);
	
КонецПроцедуры
//)
//Евросиб - АСуслов 18.01.2023 11:42:44 #63097

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Евросиб - АСуслов 18.01.2023 11:42:31 #63097
	//(
	ТекущийОбъект.СписокОбязательныхПолейВАкцепте = СтрСоединить(ОбязательныеПоляВАкцепте.Выгрузить(Новый Структура("ОбязательноеПоле", Истина), "ИмяРеквизитаТЧУслуги").ВыгрузитьКолонку("ИмяРеквизитаТЧУслуги"),",");
	//)
	//Евросиб - АСуслов 18.01.2023 11:42:33 #63097
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПодбораСделокПоПериодуПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

//Евросиб - АСуслов 02.02.2023 9:31:52 #64514
//(
&НаКлиенте
Асинх Процедура ИзменитьКодДетскийМир(Команда)
	КодДетскийМир = Ждать ВвестиСтрокуАсинх(КодДетскийМир);
	ЗаписатьДанныеДМНаСервере(КодДетскийМир, НаименованиеДетскийМир, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СтруктураЗаписей = РегистрыСведений.ПротоколОбменов.ПолучитьЗначенияЗаписей(Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.ДМ, ТекущийОбъект.Ссылка, 0);
	КодДетскийМир = СтруктураЗаписей.УИДИсточника;
	НаименованиеДетскийМир = СтруктураЗаписей.ДопИнфо1;
КонецПроцедуры                              

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеДМНаСервере(КодДетскийМир, НаименованиеДетскийМир, Номенклатура)
	РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(КодДетскийМир, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.ДМ, Номенклатура, 0, НаименованиеДетскийМир);		
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьНаименованиеДетскийМир(Команда)
	НаименованиеДетскийМир = Ждать ВвестиСтрокуАсинх(НаименованиеДетскийМир);
	ЗаписатьДанныеДМНаСервере(КодДетскийМир, НаименованиеДетскийМир, Объект.Ссылка);
КонецПроцедуры
//)
//Евросиб - АСуслов 02.02.2023 9:31:54 #64514

//Евросиб Каблов 28.06.2023 #64831
&НаКлиенте
Процедура РазноситьНаПрямыеПриИзменении(Элемент)
	
	Элементы.РазноситьНаВидТранспортногоСообщения.Доступность = Объект.РазноситьНаПрямые;
	Элементы.СпособРазнесения.Доступность = Объект.РазноситьНаПрямые;
	
	Если Объект.РазноситьНаПрямые Тогда
		Объект.РазноситьНаВидТранспортногоСообщения = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСообщений.ЖД");
		Объект.СпособРазнесения = ПредопределенноеЗначение("Перечисление.СпособыРазнесенияРасходов.ДобавитьРасходыПоПеревозкеКлиента");
	Иначе
		Объект.РазноситьНаВидТранспортногоСообщения = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка");
		Объект.СпособРазнесения = ПредопределенноеЗначение("Перечисление.СпособыРазнесенияРасходов.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

// ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 14.09.2023
&НаКлиенте
Процедура ПереводыНаименованийВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ЕстьСтрокиВалюты = Объект.ПереводыНаименований.НайтиСтроки(Новый Структура("Валюта", ВыбранноеЗначение));
		Если ЕстьСтрокиВалюты.Количество() >0 Тогда
			СтандартнаяОбработка = Ложь;
			Сообщить("Нельзя ввести два наименования по одной валюте!");
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

