
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		ОбновитьНазвание();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНазвание()
	
	НаименованиеЭлемента = "";
	
	Для Каждого Страна Из Страны Цикл
		НаименованиеСтраны = Страна.Страна.Наименование;
		НаименованиеЭлемента = НаименованиеЭлемента + НаименованиеСтраны + ", ";

	КонецЦикла;
	НаименованиеЭлемента = Лев(НаименованиеЭлемента, СтрДлина(НаименованиеЭлемента) - 2);
	
	Наименование = НаименованиеЭлемента;
	
КонецПроцедуры

#КонецОбласти