
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГУИД = Параметры.ГУИД;	
	Тз = ПолучитьИзВременногоХранилища(Параметры.АдресХран);
	Клиенты.Загрузить(Тз);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Клиенты.ОтборСтрок = Новый ФиксированнаяСтруктура("ГУИД", ГУИД);
КонецПроцедуры


&НаКлиенте
Процедура КлиентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока ИЛИ Копирование Тогда
		Элемент.ТекущиеДанные.ГУИД = ГУИД;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Сч = 0;
	Отказ = Ложь;
	Для Каждого СтрокаК Из Клиенты Цикл
		Если Не ЗначениеЗаполнено(СтрокаК.Клиент) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен клиент",,"Клиенты[" + Сч + "].Клиент");
			Отказ = Истина;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	АдресХран = ПолучитьАдресТаблицыКлиентов();
	
	Закрыть(АдресХран);
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыКлиентов()
	АдресХран = ПоместитьВоВременноеХранилище(Клиенты.Выгрузить(),ЭтаФорма.УникальныйИдентификатор);
	Возврат АдресХран;
КонецФункции	

&НаКлиенте
Процедура КлиентыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Клиент = Элемент.ТекущиеДанные.Клиент;
	ГУИД = Элемент.ТекущиеДанные.ГУИД;
	
	Если ЗначениеЗаполнено(Клиент) Тогда	
		ПоискС = Новый Структура("Клиент,ГУИД",Клиент,ГУИД);
		
		НайденныеСтроки = Клиенты.НайтиСтроки(ПоискС);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			Сообщить("Выбран дубль клиента");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
