
&НаКлиенте
Процедура ПрочитатьДанныеИсточника(Команда)
	
	Если ПредельноеРасстояниеЗагрузки < 1 ИЛИ ПредельноеРасстояниеЗагрузки > 999 Тогда
		 ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите предельное расстояние в промежутке от 0 до 1000.",, "ПредельноеРасстояниеЗагрузки", "ПредельноеРасстояниеЗагрузки");
		 Возврат;
	 КонецЕсли;
	
	ТЧ.Очистить();
	
	ADOConnection	=	Неопределено;
	ADOCommand		=	Неопределено;
	
	Попытка
		ADOConnection    				= Новый COMОбъект("ADODB.Connection");
		ADOConnection.provider			= "SQLOLEDB";
		ADOConnection.ConnectionString	= "Data Source=ESXDB;Initial Catalog=carinfo;User Id=user1c2;Password=555user1c;";
		ADOConnection.open();
		ADOCommand						= Новый COMObject("ADODB.Command");
		ADOCommand.ActiveConnection 	= ADOConnection;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось установить соединение с сервером:"+ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	SQLQuery = " SELECT t1.[StCode1],t1.[StCode2],t1.[TDist] FROM [CarInfo].[dbo].[distance] as t1 where t1.[TDist] < "+Формат(ПредельноеРасстояниеЗагрузки, "ЧГ=")+" and t1.[TDist] > 0";
	Если ЗначениеЗаполнено(ТолькоДляСтанции) Тогда
		КодВыбрСтанции = Локации_сервер.ПолучитьКодСтанции(ТолькоДляСтанции, 5);
		Если ЗначениеЗаполнено(КодВыбрСтанции) Тогда
			
			SQLQuery = SQLQuery + " and (t1.[StCode1] = '"+КодВыбрСтанции+"' or t1.[StCode2] = '"+КодВыбрСтанции+"')";
			
		КонецЕсли;
	КонецЕсли;
	ADOCommand.CommandText = SQLQuery;
	ADORecordSet = ADOCommand.Execute();
	КоличествоПолей = ADORecordSet.Fields().Count-1;
	
	Пока НЕ ADORecordSet.EOF Цикл
		НоваяСтрока = ТЧ.Добавить();
		Для Инд = 0 По КоличествоПолей Цикл
			ИмяПоля = СтрЗаменить(ADORecordSet.Fields(Инд).Name," ","");
			НоваяСтрока[ИмяПоля] = ADORecordSet.Fields(Инд).Value;
		КонецЦикла;
		ADORECORDSET.MoveNext();
	КонецЦикла;
	
	ADOConnection.Close();
	ADOConnection 	= Неопределено;
	ADOCommand		= Неопределено;
	
	/////////////////////////////////////////////////////
	
	ПрочитатьДанныеИсточника_сервер();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИсточника_сервер()
	
	МассивНеНайденныхКодов = Новый Массив;
	
	СоответствиеПоКоду = Новый Соответствие;
	ДЛя каждого Стр из ТЧ Цикл
		
		// 1
		
		ИскЗн = СоответствиеПоКоду.Получить(Стр.StCode1);
		Если ИскЗн = неопределено Тогда
			ИскЗн = Локации_сервер.НайтиСтанциюПоНеполномуКоду(Стр.StCode1);
			Если ЗначениеЗаполнено(ИскЗн) Тогда
				Стр.Станция1 = ИскЗн;
				СоответствиеПоКоду.Вставить(Стр.StCode1, ИскЗн);
			ИначеЕсли МассивНеНайденныхКодов.Найти(Стр.StCode1) = неопределено Тогда
				Сообщить("Станция по коду не найдена: " + Стр.StCode1);
				МассивНеНайденныхКодов.Добавить(Стр.StCode1);
			КонецЕсли;
		Иначе
			Стр.Станция1 = ИскЗн;
		КонецЕсли;
		
		// 2
		
		ИскЗн = СоответствиеПоКоду.Получить(Стр.StCode2);
		Если ИскЗн = неопределено Тогда
			ИскЗн = Локации_сервер.НайтиСтанциюПоНеполномуКоду(Стр.StCode2);
			Если ЗначениеЗаполнено(ИскЗн) Тогда
				Стр.Станция2 = ИскЗн;
				СоответствиеПоКоду.Вставить(Стр.StCode2, ИскЗн);
			ИначеЕсли МассивНеНайденныхКодов.Найти(Стр.StCode2) = неопределено Тогда
				Сообщить("Станция по коду не найдена: " + Стр.StCode2);
				МассивНеНайденныхКодов.Добавить(Стр.StCode2);
			КонецЕсли;
		Иначе
			Стр.Станция2 = ИскЗн;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРасстоянияВСистему(Команда)
	ЗаписатьРасстоянияВСистемуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРасстоянияВСистемуНаСервере()
	
	Сч = 0;
	НачатьТранзакцию();
	Для каждого Стр из ТЧ Цикл
		Если ЗначениеЗаполнено(Стр.Станция1) И ЗначениеЗаполнено(Стр.Станция2) Тогда
			
			МЗ = РегистрыСведений.РасстоянияМеждуЛокациями.СоздатьМенеджерЗаписи();
			МЗ.Локация1 = Стр.Станция1;
			МЗ.Локация2 = Стр.Станция2;
			МЗ.Период = ТекущаяДата();
			МЗ.РасстояниеКМ = Стр.TDist;
			МЗ.Записать(Истина);
			
			Сч = Сч + 1;
			
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	Сообщить("Записано значений: " + Сч);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредельноеРасстояниеЗагрузки = 100;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

