
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НормативыМаржинальностиПеревозок
	Движения.НормативыМаржинальностиПеревозок.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы Из Нормативы Цикл
		Движение = Движения.НормативыМаржинальностиПеревозок.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ТекСтрокаНормативы.Контрагент;
		Движение.ВидКалькуляции = ТекСтрокаНормативы.ВидКалькуляции;
		Движение.Организация = Организация;
		Движение.МинПроцентСтавки = ТекСтрокаНормативы.МинПроцентСтавки;
		Движение.МаксПроцентСтавки = ТекСтрокаНормативы.МаксПроцентСтавки;
		Движение.МинСуммаРубли = ТекСтрокаНормативы.МинСуммаСтавки;
		Движение.МаксСуммаРубли = ТекСтрокаНормативы.МаксСуммаСтавки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
КонецПроцедуры
