
//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ИсторияНаименованиеНажатие(Элемент)
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	//Евросиб - АСуслов 06.09.2023 12:45:37 #74705
	//(
	ПараметрыФормы.Вставить("ИсторияРеквизитов",            Объект.ИсторияРеквизитов);
	ПараметрыФормы.Вставить("ТекущееКПП",                   Объект.КПП);
	ПараметрыФормы.Вставить("ТекущееФактическийАдрес",      Объект.ФактическийАдрес);
	//)
	//Евросиб - АСуслов 06.09.2023 12:45:42 #74705
	
	ОткрытьФорму("Справочник.Подразделения.Форма.РедактированиеИстории", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения")
		И ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.Подразделения.Форма.РедактированиеИстории") Тогда
		
		//Если ВыбранноеЗначение.Свойство("КПП") Тогда
		//	Объект.КПП = ВыбранноеЗначение.КПП;
		//КонецЕсли;
		УстановитьНаименованиеПослеРедактированияИстории(ВыбранноеЗначение.ИсторияНаименований);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеПослеРедактированияИстории(НаборЗаписей)

	//ОрганизацииФормыКлиентСервер.УстановитьНаименованиеПослеРедактированияИстории(ЭтотОбъект, Объект, НаборЗаписей);
	ЭтаФорма.Модифицированность = Истина;

	НаборЗаписей.Сортировать("Период");
	
	Объект.ИсторияРеквизитов.Очистить();
	Если НаборЗаписей.Количество() > 1 Тогда
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьИстории = Объект.ИсторияРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
		КонецЦикла;
	КонецЕсли;
	
	АктуальнаяЗапись = НаборЗаписей[НаборЗаписей.Количество()-1];
	//Евросиб - АСуслов 06.09.2023 12:50:07 #74705
	//(
	Объект.КПП							= АктуальнаяЗапись.КПП;
	Объект.ФактическийАдрес				= АктуальнаяЗапись.ФактическийАдрес;
	//)
	//Евросиб - АСуслов 06.09.2023 12:50:17 #74705
	
	Наименования = Новый Структура();
	//Евросиб - АСуслов 06.09.2023 12:50:41 #74705
	//(
	Наименования.Вставить("КПП", 						Объект.КПП);
	Наименования.Вставить("ФактическийАдрес",			Объект.ФактическийАдрес);
	//)
	//Евросиб - АСуслов 06.09.2023 12:50:44 #74705
	
КонецПроцедуры

// МальцевАН 75409 03.04.2024
//(
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТЧИсторияРеквизитов = ТекущийОбъект.ИсторияРеквизитов;
	Если ТЧИсторияРеквизитов.Количество() = 0 Тогда
		ЗаписьВТЧ = ТЧИсторияРеквизитов.Добавить();
		ЗаписьВТЧ.КПП = ТекущийОбъект.КПП;
		ЗаписьВТЧ.ФактическийАдрес = ТекущийОбъект.ФактическийАдрес;
		ЗаписьВТЧ.Период = Дата("00010101");
	КонецЕсли;
КонецПроцедуры
//)
// МальцевАН 75409 03.04.2024
