Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Маршрутизировать = Истина;
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ВключитьРассылку = Истина;
	
	ПериодБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	ВключитьРассылку = Истина;
	ПериодБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЗакрытиеНЗППредыдущихПериодов Тогда
			Если НЗППредыдущихПериодов.Количество() = 0 Тогда			
				ТекстСообщения = НСтр("ru = 'Заполните таблицу ""НЗП предыдущих периодов"" или снимите флажок ""Закрытие НЗП предыдущих периодов""'");				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
														ТекстСообщения,
														ЭтотОбъект,
														"ЗакрытиеНЗППредыдущихПериодов",
														,
														Отказ);
			Иначе
				Если Не АкцептыДозаполнены Тогда
					ТекстСообщения = НСтр("ru = 'По указанным в документе ПТУ необходимо создать актуальные акцепты (кнопка ""Создать актуальные акцепты"")'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
														ТекстСообщения,
														ЭтотОбъект,
														"НЗППредыдущихПериодов",
														,
														Отказ);
				КонецЕсли;											
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Маршрутизация документа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ Состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗакрытиеПериодаРасходов(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	// при проведении установить статус Выполнено
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого Стр Из Состояния Цикл
			Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СписаниеПлановыхРасходов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеПлановыхРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеПлановыхРасходов КАК СписаниеПлановыхРасходов
		|ГДЕ
		|	СписаниеПлановыхРасходов.ПериодСписания = &ПериодСписания
		|	И СписаниеПлановыхРасходов.Организация = &Организация
		|	И СписаниеПлановыхРасходов.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыСписанияПлановыхРасходовСрезПоследних.ПериодВозникновенияОстатков КАК ПериодВозникновенияОстатков,
		|	ПараметрыСписанияПлановыхРасходовСрезПоследних.СторноПланаБезФакта КАК СторноПланаБезФакта,
		|	ПараметрыСписанияПлановыхРасходовСрезПоследних.СторноПланаСЧастичнымФактом КАК СторноПланаСЧастичнымФактом,
		|	ПараметрыСписанияПлановыхРасходовСрезПоследних.ВО КАК ВО,
		|	ПараметрыСписанияПлановыхРасходовСрезПоследних.УУ КАК УУ
		|ИЗ
		|	РегистрСведений.ПараметрыСписанияПлановыхРасходов.СрезПоследних(&ПериодСписания, Организация = &Организация) КАК ПараметрыСписанияПлановыхРасходовСрезПоследних";
		
		Запрос.УстановитьПараметр("ПериодСписания", ПериодБлокировки);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		РезультатЗапроса = РезультатыЗапроса[0];
		Если РезультатЗапроса.Пустой() Тогда
			
			ПараметрыСписания = РезультатыЗапроса[1].Выбрать();
			
			Если ПараметрыСписания.Следующий() Тогда
				Если (ПараметрыСписания.ВО Или ПараметрыСписания.УУ) И ЗначениеЗаполнено(ПараметрыСписания.ПериодВозникновенияОстатков) Тогда
					
					СписаниеОбъект = Документы.СписаниеПлановыхРасходов.СоздатьДокумент();
					СписаниеОбъект.Заполнить(Неопределено);
					СписаниеОбъект.Дата = Дата;
					СписаниеОбъект.Организация = Организация;
					СписаниеОбъект.ПериодСписания = ПериодБлокировки;
					
					ЧислоМесяцев = -1 * ПараметрыСписания.ПериодВозникновенияОстатков;
					СписаниеОбъект.НачалоПериодаВозникновенияОстатков = ДобавитьМесяц(СписаниеОбъект.ПериодСписания, ЧислоМесяцев);
					СписаниеОбъект.ОкончаниеПериодаВозникновенияОстатков = КонецМесяца(СписаниеОбъект.НачалоПериодаВозникновенияОстатков);
					ЗаполнитьЗначенияСвойств(СписаниеОбъект, ПараметрыСписания, "СторноПланаБезФакта,СторноПланаСЧастичнымФактом,ВО,УУ");
					
					АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
					УчетДоходовРасходовСервер.ПолучитьТаблицуСписанияПлановыхРасходов(СписаниеОбъект, АдресРезультата);
					ТаблицаСписания = ПолучитьИзВременногоХранилища(АдресРезультата);
					
					Если ЗначениеЗаполнено(ТаблицаСписания) Тогда
						
						ТаблицаСписания.Свернуть("Сделка, Валюта", "СуммаВО, СуммаВОРуб, СуммаУУ, СуммаУУРуб");
						СписаниеОбъект.РасходыКСписанию.Загрузить(ТаблицаСписания);
	
						СписаниеОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗакрытиеПериодаВО Тогда
		
		ОткрытыйПериодДоходов = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
		Если ОткрытыйПериодДоходов <= ПериодБлокировки Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДокументЗакрытиеПериодаДоходов = Документы.ЗакрытиеПериодаДоходов.СоздатьДокумент();
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("ПериодБлокировки", ПериодБлокировки);
			СтруктураЗаполнения.Вставить("ВключитьРассылку", ВключитьРассылку);
			СтруктураЗаполнения.Вставить("Организация", Организация);
			ДокументЗакрытиеПериодаДоходов.Заполнить(СтруктураЗаполнения);
			ДокументЗакрытиеПериодаДоходов.Дата = Дата;
			ДокументЗакрытиеПериодаДоходов.Примечание = СтрШаблон("Введен автоматически на основании документа: %1", Ссылка);
			ДокументЗакрытиеПериодаДоходов.Записать(РежимЗаписиДокумента.Проведение);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	
		Движения.ЗакрытыеПериоды.Записывать = Истина;
		Движение = Движения.ЗакрытыеПериоды.Добавить();
		Движение.Период = ПериодБлокировки;
		Движение.Организация = Организация;
	КонецЕсли;
	
	Если ФиксацияТекущегоПериода Тогда
		УчетДоходовРасходовСервер.ЗП_СформироватьДвиженияФиксацииИзменения(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗакрытиеПериодаБУ И Не Отказ Тогда
		Движения.ЗакрытыеПериодыБУ.Записывать = Истина;	
		Движение = Движения.ЗакрытыеПериодыБУ.Добавить();
		Движение.Период = ПериодБлокировки;
		Движение.Организация = Организация;	
	КонецЕсли;
	
	Если ВключитьРассылку Тогда
		ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Истина, "(расходы)");
	КонецЕсли;	
	
КонецПроцедуры
