
Функция GetInvoice(XMLParams)
	Возврат БитФинансСервер.ПолучитьДанныеКонтрагентаПоНомеруДокумента(XMLParams);	
КонецФункции

Функция GetClaimsByDocnumberOrPeriod(docnumber, periodStart, periodEnd)
	
	Если НЕ ЗначениеЗаполнено(docnumber) и НЕ ЗначениеЗаполнено(periodStart) Тогда
		
		Возврат "<xml><error>EMPTY PARAMETERS!!!</error></xml>";
		
	КонецЕсли;
	
	Результат = ПретензииИНеакцептыСервер.ПредоставитьДанныеНеакцептовПоПериодуИлиНомеруДокумента(docnumber, periodStart, periodEnd);
	
	РезультатXML = "<xml>" + Символы.ПС + "<claims>" + Символы.ПС;
	
	Для каждого Стр из Результат Цикл
		
		РезультатXML = РезультатXML + "<claim pmRfCode=""" + Стр.pmRfCode + """ pmtRFC=""" + 
					Стр.pmtRFC + """ pmtObjDate=""" + Стр.pmtObjDate + """ pmtObjSum=""" + 
					Формат(Стр.pmtObjSum, "ЧН=; ЧГ=") + """ vSymCode=""" + Стр.vSymCode + """ pmtErrCodes=""" + 
					Стр.pmtErrCodes + """ pmtErrText=""" + Стр.pmtErrText + """ pmtObjFulfilment=""" + 
					Стр.pmtObjFulfilment + """ pmtNotes=""" + Стр.pmtNotes + """ pmtIsActual=""" + ?(Строка(Стр.pmtObjFulfilment) = "Рассматривается", 1, 0) + """ />";
		
	КонецЦикла;
	
	Возврат РезультатXML + "</claims>" + Символы.ПС + "</xml>"; // Юля должна уточнить формат данных!
	
КонецФункции

Функция GetCarsInfo(CarsList)
	ТЗИнфоПоВагонам = ЕСОбменСервер.ПолучитьИнформациюПоВагонам(CarsList);
	//Запись = Новый ЗаписьXML;
	//Запись.
	//РезультатXML = "<xml>" + Символы.ПС + "<CarsInfo>" + Символы.ПС;
	//Для каждого Стр из ТЗИнфоПоВагонам Цикл
	//	
	//	РезультатXML = РезультатXML + "<carinfo CarNumber="""		+ Стр.НомерВагона										+ """ 
	//											|FullRun="""		+ Формат(Стр.ПолныйПробег,"ЧН=; ЧГ=")					+ """ 
	//											|LeftRun=""" 		+ Формат(Стр.ОстаточныйПробег,"ЧН=; ЧГ=")				+ """
	//											|YellowLimit=""" 	+ Формат(Стр.ЖелтыйПорог,"ЧН=; ЧГ=")					+ """
	//											|RedLimit=""" 		+ Формат(Стр.КрасныйПорог,"ЧН=; ЧГ=")					+ """
	//											|ExportDeny=""" 	+ Формат(Стр.ОграничениеПогранПерехода,"БЛ=0; БИ=1")	+ """
	//											|Length=""" 		+ Формат(Стр.УсловнаяДлина,"ЧН=; ЧГ=")					+ """
	//									|/>";
	//	
	//КонецЦикла;
	//
	//Возврат РезультатXML + "</CarsInfo>" + Символы.ПС + "</xml>"; 
	Возврат ВыгрузитьТЗ_в_XML(ТЗИнфоПоВагонам);
КонецФункции

&НаСервере
 Функция ВыгрузитьТЗ_в_XML(пТЗ)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("CarsInfo");
	Для А=0 По пТЗ.Количество()-1 Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("CarInfo");
		Для Каждого Колонка Из пТЗ.Колонки Цикл
			ИмяАтрибута=Колонка.Имя;
			ЗначениеАтрибута=пТЗ[А][Колонка.Имя];
			ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута,СтрЗаменить(Строка(ЗначениеАтрибута)," ",""));
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
КонецФункции   

Функция GetTimeTable()
	Возврат ВыгрузитьТабельноеРасписание()
КонецФункции

Функция ВыгрузитьТабельноеРасписание()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.Код КАК Код,
	//Евросиб Каблов 13.04.2021 ( Task 32839
	|	ТабельныеРасписанияРЖДРасписание.Ссылка КАК Ссылка,
	//Евросиб Каблов 13.04.2021 )
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.Наименование КАК Наименование,
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.ПунктОтправления.КодЖДСтанции КАК ПунктОтправленияКодЖДСтанции,
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.ПунктНазначения.КодЖДСтанции КАК ПунктНазначенияКодЖДСтанции,
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.ВсегоВПутиЧ КАК ВсегоВПутиЧ,
	|	ТабельныеРасписанияРЖДРасписание.НомерСтроки КАК НомерСтроки,
	|	ТабельныеРасписанияРЖДРасписание.Станция.КодЖДСтанции КАК СтанцияКодЖДСтанции,
	|	ТабельныеРасписанияРЖДРасписание.ДоСледующейСтанции КАК ВремяВПути,
	|	ТабельныеРасписанияРЖДРасписание.ВремяОтправления КАК ВремяОтправления,
	|	ТабельныеРасписанияРЖДРасписание.ВремяПрибытия КАК ВремяПрибытия,
	|	ТабельныеРасписанияРЖДРасписание.РасстояниеДоСледующейСтанции КАК РасстояниеДоСледующейСтанции,
	//Евросиб Фролов (27.09.2021 Ticket№ 38934
	|	ТабельныеРасписанияРЖДРасписание.Ссылка.ПометкаУдаления КАК Удалена
	// Евросиб Фролов) 
	|ИЗ
	|	Справочник.ТабельныеРасписанияРЖД.Расписание КАК ТабельныеРасписанияРЖДРасписание
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	ОБЩИЕ,
	|	Код";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Евросиб Каблов 13.04.2021 ( Task 32839
	РезультатЗапроса.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	Если РезультатЗапроса.Строки.Количество() > 0 Тогда
		Для каждого СтрокаПоКоду Из РезультатЗапроса.Строки[0].Строки Цикл
			ИдентификаторДляСсылки = "";
			Для Каждого СтрокаРасписания Из СтрокаПоКоду.Строки Цикл
				Если Не ЗначениеЗаполнено(ИдентификаторДляСсылки) Тогда
					Идентификатор = Строка(СтрокаРасписания.Ссылка.УникальныйИдентификатор());
					ИдентификаторДляСсылки = Сред(Идентификатор, 20, 4) + Сред(Идентификатор, 25, 12) + Сред(Идентификатор, 15, 4) + Сред(Идентификатор, 10, 4) + Сред(Идентификатор, 1, 8);
				КонецЕсли;
				СтрокаРасписания.ГУИД = ИдентификаторДляСсылки;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	РезультатЗапроса.Колонки.Удалить(РезультатЗапроса.Колонки.Ссылка);
	//Евросиб Каблов 13.04.2021 )
	Ответ = ЕСОбменСервер.ЗаписатьДеревоВXML(РезультатЗапроса);
	Возврат Ответ;
КонецФункции

Функция GetShippingPlan()
	ТЗПланОтправок = ЕСОбменСервер.ПолучитьПланОтправок();
	РезультатXML = "<xml>" + Символы.ПС + "<shippings>" + Символы.ПС;
	Для каждого Стр из ТЗПланОтправок Цикл
		
		РезультатXML = РезультатXML + "<shipping stDepartureCode="""	+ Стр.КодЖДСтанцииОтправления					+ """ 
												|stDestinationCode=""" 	+ Стр.КодЖДСтанцииНазначения 					+ """
												|DepartureDate=""" 		+ Стр.ДатаОтправления 							+ """
												|ArrivalDate=""" 		+ Стр.ДатаПрибытия								+ """
												|TrainLenght=""" 		+ Формат(Стр.УсловнаяДлинаСостава,"ЧН=; ЧГ=")	+ """
												|TEU=""" 				+ Стр.КоличествоТЕУ								+ """
												|TEUReserved=""" 		+ Стр.ЗарезервированоТЭУ						+ """
												|UnloadingDuration=""" 	+ Стр.ДлительностьВыгрузки						+ """
												|Service="""		 	+ Стр.Сервис									+ """
												|Author="""		  	 	+ Стр.Автор 									+ """
												|UID="""		 		+ Стр.Ссылка.УникальныйИдентификатор()			+ """
												|/>";
		
	КонецЦикла;
	
	Возврат РезультатXML + "</shippings>" + Символы.ПС + "</xml>";
КонецФункции

Функция GetShippingPlanByPeriod(DateBegin, DateEnd)
	ТЗПланОтправок = ЕСОбменСервер.ПолучитьПланОтправок(DateBegin, DateEnd);
	РезультатXML = "<xml>" + Символы.ПС + "<shippings>" + Символы.ПС;
	Для каждого Стр из ТЗПланОтправок Цикл
		
		РезультатXML = РезультатXML + "<shipping stDepartureCode="""	+ Стр.КодЖДСтанцииОтправления					+ """ 
												|stDestinationCode=""" 	+ Стр.КодЖДСтанцииНазначения 					+ """
												|DepartureDate=""" 		+ Стр.ДатаОтправления 							+ """
												|ArrivalDate=""" 		+ Стр.ДатаПрибытия								+ """
												|TrainLenght=""" 		+ Формат(Стр.УсловнаяДлинаСостава,"ЧН=; ЧГ=")	+ """
												|TEU=""" 				+ Стр.КоличествоТЕУ								+ """
												|TEUReserved=""" 		+ Стр.ЗарезервированоТЭУ						+ """
												|UnloadingDuration=""" 	+ Стр.ДлительностьВыгрузки						+ """
												|Service="""		 	+ Стр.Сервис									+ """
												|Author="""		  	 	+ Стр.Автор 									+ """
												|UID="""		 		+ Стр.Ссылка.УникальныйИдентификатор()			+ """
									|/>";
		
	КонецЦикла;
	
	Возврат РезультатXML + "</shippings>" + Символы.ПС + "</xml>";
КонецФункции

Функция GetVSFList(XMLParams)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	Фабрика = Новый ФабрикаXDTO;
	ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
	
	ДатаНачала = '00010101';
	ДатаОкончания = '00010101';
	
	
	НайденноеСвойство = ОбъектXDTO.Свойства().Получить("R");
	Если НайденноеСвойство <> Неопределено Тогда
		Для Каждого Строка Из ОбъектXDTO.R Цикл
			Если Строка.nmParams = "DateBegin" Тогда
				ДатаНачала = XMLЗначение(Тип("Дата"), Строка.valueParams);
			ИначеЕсли Строка.nmParams = "DateEnd" Тогда
				ДатаОкончания = XMLЗначение(Тип("Дата"), Строка.valueParams);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента КАК НомерАкта,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаАкта,
	|	ПоступлениеТоваровУслуг.ПолнаяСуммаВСФ КАК ОбщаяСуммаДокумента,
	|	СУММА(ПоступлениеТоваровУслугУслуги.Всего) КАК СуммаПТУвДК,
	|	СУММА(ПоступлениеТоваровУслугУслуги.СуммаНДС) КАК СуммаНДСпоПТУвДК,
	|	ПоступлениеТоваровУслуг.ПолнаяСуммаВСФ - СУММА(ПоступлениеТоваровУслугУслуги.Всего) КАК СуммаПТУвРитме,
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщика,
	|	ПоступлениеТоваровУслуг.ДатаМодификации КАК ДатаМодификации,
//Евросиб Литвинов ( 15.02.2022 #44592 Ticket#0254477 #44587
	|	ПоступлениеТоваровУслуг.ДатаСФХЖ КАК ДатаСФХЖ,
//Евросиб Литвинов ) 15.02.2022 #44592 Ticket#0254477 #44587       
//Евросиб - АСуслов 17.03.2023 12:30:38 #65868
//(
	|	ПоступлениеТоваровУслуг.ДатаПоступленияДокумента КАК ДатаПоступленияДокумента,
//)
//Евросиб - АСуслов 17.03.2023 12:30:41 #65868
	|	ПоступлениеТоваровУслуг.ДатаРазрешенияВыгрузкиВУПП КАК ДатаРазрешенияВыгрузкиВУПП
	|ПОМЕСТИТЬ ВТПоступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
	|			И (ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.НомерСтроки = 1)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.Контрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|				ТОГДА НЕ ПоступлениеТоваровУслуг.Копия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ПоступлениеТоваровУслуг.Проведен
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента,
//Евросиб - АСуслов 17.03.2023 12:30:38 #65868
//(
	|	ПоступлениеТоваровУслуг.ДатаПоступленияДокумента,
//)
//Евросиб - АСуслов 17.03.2023 12:30:41 #65868
	|	ПоступлениеТоваровУслуг.ПолнаяСуммаВСФ,
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика,
	|	ПоступлениеТоваровУслуг.ДатаМодификации,
	|	ПоступлениеТоваровУслуг.ДатаРазрешенияВыгрузкиВУПП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.НомерВходящегоДокумента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
	|	КорректировкаПоступления.ПолнаяСуммаВСФ,
	|	СУММА(КорректировкаПоступленияУслуги.РазницаВсегоКорректировки),
	|	СУММА(КорректировкаПоступленияУслуги.РазницаСуммаНДСКорректировки),
	|	КорректировкаПоступления.ПолнаяСуммаВСФ - СУММА(КорректировкаПоступленияУслуги.Всего),
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика,
	|	КорректировкаПоступления.ДатаМодификации,
//Евросиб Литвинов ( 15.02.2022 #44592 Ticket#0254477 #44587
	|	КорректировкаПоступления.ДатаСФХЖ КАК ДатаСФХЖ,
//Евросиб Литвинов ) 15.02.2022 #44592 Ticket#0254477 #44587
//Евросиб - АСуслов 17.03.2023 12:30:38 #65868
//(
	|	КорректировкаПоступления.ДатаПоступленияДокумента КАК ДатаПоступленияДокумента,
//)
//Евросиб - АСуслов 17.03.2023 12:30:41 #65868
	|	КорректировкаПоступления.ДатаРазрешенияВыгрузкиВУПП
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ПО КорректировкаПоступления.Ссылка = КорректировкаПоступленияУслуги.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.СвязанныеСчетаПоставщиков КАК КорректировкаПоступленияСвязанныеСчетаПоставщиков
	|		ПО КорректировкаПоступления.Ссылка = КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка
	|			И (КорректировкаПоступленияСвязанныеСчетаПоставщиков.НомерСтроки = 1)
	|ГДЕ
	|	КорректировкаПоступления.ДатаВходящегоДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА КорректировкаПоступления.Контрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|				ТОГДА НЕ КорректировкаПоступления.Копия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И КорректировкаПоступления.Проведен
	|	И КорректировкаПоступления.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.НомерВходящегоДокумента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
//Евросиб - АСуслов 17.03.2023 12:30:38 #65868
//(
	|	КорректировкаПоступления.ДатаПоступленияДокумента,
//)
//Евросиб - АСуслов 17.03.2023 12:30:41 #65868
	|	КорректировкаПоступления.ПолнаяСуммаВСФ,
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика,
	|	КорректировкаПоступления.ДатаМодификации,
	|	КорректировкаПоступления.ДатаРазрешенияВыгрузкиВУПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоступления.Поступление КАК Поступление,
	|	Акцепт.Ссылка КАК Акцепт,
	|	Акцепт.СуммаАкцепта КАК СуммаАкцепта,
	|	Акцепт.СуммаНДСАкцепта КАК СуммаНДСАкцепта,
	|	Акцепт.ДатаМодификации КАК ДатаМодификации
	|ПОМЕСТИТЬ ВТАкцепты
	|ИЗ
	|	ВТПоступления КАК ВТПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт1
	|			ПО Акцепт.Ссылка = Акцепт1.СторнируемыйАкцепт
	|				И (Акцепт1.Проведен)
	|		ПО ВТПоступления.Поступление = Акцепт.Поступление
	|ГДЕ
	|	Акцепт.Проведен
	|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(документ.Акцепт.ПустаяСсылка)
	|	И Акцепт1.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАкцепты.Акцепт КАК Акцепт,
	|	СУММА(ВЫБОР
	|			КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ТОГДА АкцептУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКосвенныеЗатраты,
	|	СУММА(ВЫБОР
	|			КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(перечисление.ВидыЗатрат.ПрямыеЗатраты)
	|				ТОГДА АкцептУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПрямыеЗатраты,
	|	СУММА(ВЫБОР
	|			КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|				ТОГДА АкцептУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНезавершенноеПроизводство,
	|	СУММА(АкцептУслуги.СуммаПретензии) КАК СуммаПретензии,
	|	СУММА(ВЫБОР
	|			КОГДА АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(перечисление.ВидыРасходов.Возмещаемые)
	|				ТОГДА АкцептУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозмещаемыеРасходы,
	|	СУММА(АкцептУслуги.ПоступлениеСумма - АкцептУслуги.Сумма) КАК НеакцептованнаяСумма
	|ПОМЕСТИТЬ ВТСуммыПоАкцептам
	|ИЗ
	|	ВТАкцепты КАК ВТАкцепты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО ВТАкцепты.Акцепт = АкцептУслуги.Ссылка
	|ГДЕ
	|	АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРитм)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАкцепты.Акцепт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоступления.Поступление КАК Поступление,
	|	ВТАкцепты.Акцепт КАК Акцепт,
	|	ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, """") КАК НомерВСФ,
	|	ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, """") КАК ДатаВСФ,
	|	ВТПоступления.НомерАкта КАК НомерАкта,
	|	ВТПоступления.ДатаАкта КАК ДатаАкта,
//Евросиб Литвинов ( 15.02.2022 #44592 Ticket#0254477 #44587
	|	ВТПоступления.ДатаСФХЖ КАК ДатаСФХЖ,
//Евросиб Литвинов ) 15.02.2022 #44592 Ticket#0254477 #44587
//Евросиб - АСуслов 17.03.2023 12:30:38 #65868
//(
	|	ВТПоступления.ДатаПоступленияДокумента КАК ДатаПоступленияДокумента,
//)
//Евросиб - АСуслов 17.03.2023 12:30:41 #65868
	|	ВТПоступления.Поступление.Контрагент.Код КАК КодКонтрагента,
	|	ВТПоступления.Поступление.ДоговорКонтрагента.Код КАК КодДоговора,
	|	ВТПоступления.ОбщаяСуммаДокумента КАК ОбщаяСуммаДокумента,
	|	ВТПоступления.СуммаПТУвДК КАК СуммаПТУвДК,
	|	ВТПоступления.СуммаНДСпоПТУвДК КАК СуммаНДСпоПТУвДК,
	|	ЕСТЬNULL(ОбменПТУсУПП.СуммаВБУ, 0) КАК СуммаПТУвУПП,
	|	ВТПоступления.СуммаПТУвРитме КАК СуммаПТУвРитме,
	|	ЕСТЬNULL(ОбменПТУсУПП.ПроведенВБУ, ЛОЖЬ) КАК ПроведенПТУВУчетеУПП,
	|	ЕСТЬNULL(ВТАкцепты.СуммаАкцепта, 0) КАК СуммаАкцептаВДК,
	|	ЕСТЬNULL(ОбменАкцептСУПП.СуммаВБУ, 0) КАК СуммаАкцептаВУПП,
	|	ЕСТЬNULL(ВТАкцепты.СуммаНДСАкцепта, 0) КАК СуммаНДСАкцептаВДК,
	|	ЕСТЬNULL(ОбменАкцептСУПП.СуммаНДСВБУ, 0) КАК СуммаНДСАкцептаВУПП,
	|	ЕСТЬNULL(ОбменСРитм.УИДИсточника, """") КАК УИДПТУРитм,
	|	ЕСТЬNULL(ОбменАкцептСУПП.ПроведенВБУ, ЛОЖЬ) КАК ПроведенАкцептВУчетеУПП,
	|	ВТАкцепты.Акцепт.Представление КАК АкцептПредставление,
	|	ВТПоступления.Поступление.Представление КАК ПоступлениеПредставление,
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022 
	//|	ЕСТЬNULL(ВТПоступления.Поступление.ДоговорКонтрагента.ОтветственныйЗаУчет.Наименование, """") КАК ОтветственныйЗаУчетНаименование,
	|ВТПоступления.Поступление.ДоговорКонтрагента КАК Договор,
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
	|	ОбменЗаказовсУПП.НомерДатаВБУ КАК НомерДатаЗаказаЗаявкиВБУ,
	|	ОбменПТУсУПП.ДатаОбмена КАК ДатаОбменаПТУсУПП,
	|	ВТПоступления.ДатаМодификации КАК ДатаМодификацииПТУ,
	|	ВТПоступления.ДатаРазрешенияВыгрузкиВУПП КАК ДатаРазрешенияВыгрузкиВУПП,
	|	ВТАкцепты.ДатаМодификации КАК ДатаМодификацииАкцепта,
	|	ОбменАкцептСУПП.ДатаОбмена КАК ДатаОбменаАкцептасУПП,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.СуммаКосвенныеЗатраты, 0) КАК СуммаКосвенныеЗатраты,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.СуммаПрямыеЗатраты, 0) КАК СуммаПрямыеЗатраты,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.СуммаНезавершенноеПроизводство, 0) КАК СуммаНезавершенноеПроизводство,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.СуммаПретензии, 0) КАК СуммаПретензии,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.СуммаВозмещаемыеРасходы, 0) КАК СуммаВозмещаемыеРасходы,
	|	ЕСТЬNULL(ВТСуммыПоАкцептам.НеакцептованнаяСумма, 0) КАК НеакцептованнаяСумма
	|ИЗ
	|	ВТПоступления КАК ВТПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАкцепты КАК ВТАкцепты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ОбменАкцептСУПП
	|			ПО ВТАкцепты.Акцепт = ОбменАкцептСУПП.Объект
	|				И (ОбменАкцептСУПП.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыПоАкцептам КАК ВТСуммыПоАкцептам
	|			ПО ВТАкцепты.Акцепт = ВТСуммыПоАкцептам.Акцепт
	|		ПО ВТПоступления.Поступление = ВТАкцепты.Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ОбменПТУсУПП
	|		ПО ВТПоступления.Поступление = ОбменПТУсУПП.Объект
	|			И (ОбменПТУсУПП.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ОбменСРитм
	|		ПО ВТПоступления.Поступление = ОбменСРитм.Объект
	|			И (ОбменСРитм.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.Ритм))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ВТПоступления.Поступление = СчетФактураПолученныйДокументыОснования.ДокументОснование
	|			И (СчетФактураПолученныйДокументыОснования.Ссылка.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ОбменЗаказовсУПП
	|		ПО ВТПоступления.СчетПоставщика = ОбменЗаказовсУПП.Объект
	|			И (ОбменЗаказовсУПП.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАкцепты.Акцепт КАК Акцепт,
	|	АкцептУслуги.УчДокумент.ПериодВО КАК ПериодВО,
	|	АкцептУслуги.УчДокумент.НомерДляПечати КАК НомерАкта,
	|	АкцептУслуги.УчДокумент.ДатаДокумента КАК ДатаАкта,
	|	АкцептУслуги.Сделка.Номер КАК НомерСделки
	|ИЗ
	|	ВТАкцепты КАК ВТАкцепты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО ВТАкцепты.Акцепт = АкцептУслуги.Ссылка
	|ГДЕ
	|	АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРитм)
	|	И НЕ АкцептУслуги.Сделка.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("windows-1251"); 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("root");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[3].Выбрать();
	ТаблицаАктов = РезультатыЗапроса[4].Выгрузить();
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("Act");
		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "VSFView", Выборка.ПоступлениеПредставление);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptView", Выборка.АкцептПредставление);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "VSFNum", Выборка.НомерВСФ);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "VSFDate", XMLСтрока(Выборка.ДатаВСФ));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActNum", Выборка.НомерАкта);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActDate", XMLСтрока(Выборка.ДатаАкта));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "cRfCode", Выборка.КодКонтрагента);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "dRfCode", Выборка.КодДоговора);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActSumFull", XMLСтрока(Выборка.ОбщаяСуммаДокумента));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActSumInDC", XMLСтрока(Выборка.СуммаПТУвДК));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActSumVATInDC", XMLСтрока(Выборка.СуммаНДСпоПТУвДК));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActSumInUPP", XMLСтрока(Выборка.СуммаПТУвУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActSumInRitm", XMLСтрока(Выборка.СуммаПТУвРитме));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActPostedInUPP", XMLСтрока(Выборка.ПроведенПТУВУчетеУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptSumInDC", XMLСтрока(Выборка.СуммаАкцептаВДК));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptSumInUPP", XMLСтрока(Выборка.СуммаАкцептаВУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptSumVatInDC", XMLСтрока(Выборка.СуммаНДСАкцептаВДК));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptSumVatInUPP", XMLСтрока(Выборка.СуммаНДСАкцептаВУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "AcceptPostedInUPP", XMLСтрока(Выборка.ПроведенАкцептВУчетеУПП)); 
		//Евросиб - АСуслов 17.03.2023 12:33:53 #65868
		//(
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActDocInput", XMLСтрока(Выборка.ДатаПоступленияДокумента)); 
		//)
		//Евросиб - АСуслов 17.03.2023 12:33:54 #65868
		//Евросиб Каблов 29.03.2021 ( Ticket#0227257		 
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "СуммаКосвенныеЗатраты", XMLСтрока(Выборка.СуммаКосвенныеЗатраты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "СуммаПрямыеЗатраты", XMLСтрока(Выборка.СуммаПрямыеЗатраты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "СуммаНезавершенноеПроизводство", XMLСтрока(Выборка.СуммаНезавершенноеПроизводство));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "СуммаПретензии", XMLСтрока(Выборка.СуммаПретензии));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "СуммаВозмещаемыеРасходы", XMLСтрока(Выборка.СуммаВозмещаемыеРасходы));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "НеакцептованнаяСумма", XMLСтрока(Выборка.НеакцептованнаяСумма));
		//Евросиб Каблов 29.03.2021 )
		// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022 // из за переноса ответственных из реквизитов в ТЧ "ответственные"
		// Было
		//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ResponsibleForAccountingInDC", XMLСтрока(Выборка.ОтветственныйЗаУчетНаименование));
		// Стало
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор",				Выборка.Договор);
		СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
		СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
		ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
		
		Если Не ОтветственныйЗаУчет.Пустая() Тогда 
			ОтветственныйЗаУчетНаименование = ОтветственныйЗаУчет.Наименование;
		Иначе 
			ОтветственныйЗаУчетНаименование = "";
		КонецЕсли;
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ResponsibleForAccountingInDC", XMLСтрока(ОтветственныйЗаУчетНаименование));
		// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IDActInRitm", Выборка.УИДПТУРитм);		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IDActInDC", Строка(Выборка.Поступление.УникальныйИдентификатор()));
		Если ЗначениеЗаполнено(Выборка.Акцепт) Тогда
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IDAcceptInDC", Строка(Выборка.Акцепт.УникальныйИдентификатор()));
		Иначе
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IDAcceptInDC", "");
		КонецЕсли;
//Евросиб Гудкова( 09.02.2021 
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "НомерДатаЗаказаЗаявкиВБУ", Выборка.НомерДатаЗаказаЗаявкиВБУ);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаОбменаПТУсУПП", XMLСтрока(Выборка.ДатаОбменаПТУсУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаМодификацииПТУ", XMLСтрока(Выборка.ДатаМодификацииПТУ));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаРазрешенияВыгрузкиВУПП", XMLСтрока(Выборка.ДатаРазрешенияВыгрузкиВУПП));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаМодификацииАкцепта", XMLСтрока(Выборка.ДатаМодификацииАкцепта));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаОбменаАкцептасУПП", XMLСтрока(Выборка.ДатаОбменаАкцептасУПП));
	// Евросиб Гудкова)
//Евросиб Литвинов ( 15.02.2022 #44592 Ticket#0254477 #44587 
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ДатаСФХЖ", XMLСтрока(Выборка.ДатаСФХЖ));
//Евросиб Литвинов ) 15.02.2022 #44592 Ticket#0254477 #44587
	
		Акты = ТаблицаАктов.НайтиСтроки(Новый Структура("Акцепт", Выборка.Акцепт));
		ПериодыВО = Новый Массив;
		НомераАктов = Новый Массив;
		НомераСделок = Новый Массив;
		Для каждого СтрокаТаблицы Из Акты Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПериодВО) Тогда
				ПериодВО = Формат(СтрокаТаблицы.ПериодВО, "ДФ=dd.MM.yyyy");
				Если ПериодыВО.Найти(ПериодВО) = Неопределено Тогда
					ПериодыВО.Добавить(ПериодВО);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.НомерАкта) Тогда
				НомерАкта = СтрШаблон("%1 %2", СокрЛП(СтрокаТаблицы.НомерАкта), Формат(СтрокаТаблицы.ДатаАкта, "ДФ=dd.MM.yyyy"));
				Если НомераАктов.Найти(НомерАкта) = Неопределено Тогда 
					НомераАктов.Добавить(НомерАкта);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.НомерСделки) Тогда
				Если НомераСделок.Найти(СтрокаТаблицы.НомерСделки) = Неопределено Тогда
					НомераСделок.Добавить(СтрокаТаблицы.НомерСделки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПериодыВОСтрокой = СтрСоединить(ПериодыВО, ";");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ПериодыВО", ПериодыВОСтрокой);
		НомераАктовСтрокой = СтрСоединить(НомераАктов, ";");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Акты", НомераАктовСтрокой);
		НомераСделокСтрокой = СтрСоединить(НомераСделок, ";");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Сделки", НомераСделокСтрокой);
		
		Запись.ЗаписатьКонецЭлемента(); //Act
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //root
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция getLocationList(searchString)
	
	//таблицаСоответствующихЛокаций = ВебСервисы_сервер.ПолучитьСтанцииПортыСтокиПоСтрокеПоиска(searchString);
	//
	//возврат ОбщегоНазначения.ЗначениеВСтрокуXML(таблицаСоответствующихЛокаций);
	//Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Параметры = Новый Структура("Наименование", searchString);
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокЛокаций", Параметры, "Наименование");
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокЛокаций");

КонецФункции
// МальцевАН 83034 01.04.2024
//(
Функция GETFederalDistricts()
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокФедеральныеОкруга", Новый Структура);
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
КонецФункции
//)
// МальцевАН 83034 01.04.2024

Функция GetKTK()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК.Префикс КАК КТКСерия,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК.Номер КАК КТКНомер,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК.ТипТЕ КАК КТКТип,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.Наименование КАК СобственникНаименование,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.Код КАК СобственникКод,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.ИНН КАК СобственникИНН,
		|	"""" КАК СобственникГУИД,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ВидСобственности,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаПриемаВПользование КАК ДатаПриемаВПользование,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СрокВозврата КАК СрокВозврата,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СВВ КАК СВВ,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК тек_Собственник,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК.КонтрольноеЧисло КАК КТККонтрольноеЧисло,
		// + ДИТ Кузнецов Е.Е. 53477 28.10.2022
		|	стоки_ТекущиеДанныеСрезПоследних.тек_сток КАК тек_Сток,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ЛокацияСдачи КАК тек_ЛокацияСдачи,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ПунктыОкончСдачи КАК тек_ПунктыОкончСдачи,
		// - ДИТ Кузнецов Е.Е. 53477 28.10.2022
		// Евросиб Фролов (12.04.2022 Task №50207
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК ВЭксплуатации,		
		// Евросиб Фролов)
		//Евросиб Каблов 23.01.2024 ( #79698
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(20)) КАК Ставка,
		|	стоки_ТекущиеДанныеСрезПоследних.комм_Ставка КАК СтавкаЧисло,
		|	стоки_ТекущиеДанныеСрезПоследних.комм_Валюта.Наименование КАК Валюта
		//Евросиб Каблов 23.01.2024 )
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|ИТОГИ ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если РезультатЗапроса.Строки.Количество() > 0 Тогда
		//Евросиб Каблов 23.01.2024 ( #79698
		//Для каждого СтрокаПоКоду Из РезультатЗапроса.Строки[0].Строки Цикл
		Для каждого СтрокаПоКоду Из РезультатЗапроса.Строки Цикл
		//Евросиб Каблов 23.01.2024 )
			Для каждого СтрокаРезультата из СтрокаПоКоду.Строки Цикл
				Если ЗначениеЗаполнено(СтрокаРезультата.тек_Собственник) Тогда
					СтрокаРезультата.СобственникГУИД = Строка(СтрокаРезультата.тек_Собственник.УникальныйИдентификатор());
					//СтрокаРезультата.КТКНомер = Строка(СтрокаРезультата.КТКНомер)+Строка(СтрокаРезультата.КТККонтрольноеЧисло);
				КонецЕсли;
				//Евросиб Каблов 23.01.2024 ( #79698
				СтрокаРезультата.Ставка = Формат(СтрокаРезультата.СтавкаЧисло, "ЧДЦ=2; ЧН=0; ЧГ=0");
				//Евросиб Каблов 23.01.2024 )
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб Каблов 23.01.2024 ( #79698
	РезультатЗапроса.Колонки.Удалить("СтавкаЧисло");
	//Евросиб Каблов 23.01.2024 )
	
	Ответ = ЕСОбменСервер.ЗаписатьДеревоВXML(РезультатЗапроса);
	Возврат Ответ;
	
КонецФункции

Функция CreateDispatch(XMLParams)
	
	Возврат ЕСОбменСервер.СоздатьРейс(XMLParams);
	
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало (закомментировал, перенесено в ЕСОбменСервер)
	//Чтение = Новый ЧтениеXML;
	//Чтение.УстановитьСтроку(XMLParams);
	//
	//Фабрика = Новый ФабрикаXDTO;
	//ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
	//
	//НомерПоезда = 0;
	//ПунктОтправления = Справочники.Локации.ПустаяСсылка();
	//ПунктНазначения = Справочники.Локации.ПустаяСсылка(); 
	//// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 09.07.2024
	//// Было:
	////ДатаОтправления = '00010101';
	////ДатаПрибытия = '00010101'; 
	////Стало:
	//ДатаОтправленияПлан = '00010101'; 
	//ДатаОтправленияФакт = '00010101';
	//ДатаОтправленияЖДН = '00010101';
	//ДатаПрибытияПлан = '00010101'; 
	//ДатаПрибытияФакт = '00010101'; 
	//ДатаПрибытияЖДН = '00010101';
	//// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 09.07.2024
	//
	////ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	////Сервис = Справочники.Продукты.ПустаяСсылка();
	//Сервис = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
	//Примечание = "";
	////Продукт = Справочники.Продукты.ПустаяСсылка();
	//УчетноеНаправление = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
	////ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//УсловнаяДлинаСостава = 0;
	//РейсОтменен = Ложь;
	//Автор = Справочники.Пользователи.ПустаяСсылка();
	//Клиент = Справочники.Контрагенты.ПустаяСсылка();
	//ГУИД_DX = "";
	//
	////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
	//ТаблицаРеестрКонтейнеров = Новый ТаблицаЗначений;
	//ТаблицаФактическийСоставПоезда = Новый ТаблицаЗначений;
	////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
	//
	////ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	//ТаблицаРеестрПродуктов = Новый ТаблицаЗначений;
	//СхемаПеревозки = Справочники.СхемыПеревозки.ПустаяСсылка();
	//ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка();
	//СхемаНаименование = "";
	//СхемаКод = "";
	//ОтрезокСхемыНаименование = "";
	//ОтрезокСхемыКод = "";
	////ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 
	//
	////Субботин 75866 начало 05.10.2023
	//ПунктОтправленияКод = "";
	//ПунктНазначенияКод = "";
	////Субботин 75866 конец  05.10.2023
	//
	////Евросиб Каблов 09.10.2024 ( Ticket#0367291
	//НомерЛота = "";
	////Евросиб Каблов 09.10.2024 )
	//
	////Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
	//КТК_DX = "";
	//ПлановаяВыручка_DX = 0;
	////Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
	//
	////НайденноеСвойство = ОбъектXDTO.Свойства().Получить("Шапка");
	////Если НайденноеСвойство <> Неопределено Тогда
	//	//Для Каждого Строка Из ОбъектXDTO.Шапка Цикл
	//	Для Каждого Строка Из ОбъектXDTO.Свойства() Цикл
	//		Если Строка.Имя = "НомерПоезда" Тогда
	//			//НомерПоезда = XMLЗначение(Тип("Число"), Строка.valueParams);
	//			НомерПоезда = Строка.ОбъектВладелец.НомерПоезда;
	//		ИначеЕсли Строка.Имя = "ПунктОтправления" Тогда
	//			//ПунктОтправления = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			ПунктОтправления = Строка.ОбъектВладелец.ПунктОтправления;
	//		ИначеЕсли Строка.Имя = "ПунктНазначения" Тогда
	//			//ПунктНазначения = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			ПунктНазначения = Строка.ОбъектВладелец.ПунктНазначения;   
	//		// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 08.07.2024
	//		// Было:
	//		//ИначеЕсли Строка.Имя = "ДатаОтправления" Тогда
	//		//	//ДатаОтправления = XMLЗначение(Тип("Дата"), Строка.valueParams);
	//		//	ДатаОтправления = Строка.ОбъектВладелец.ДатаОтправления;
	//		//ИначеЕсли Строка.Имя = "ДатаПрибытия" Тогда
	//		//	//ДатаПрибытия = XMLЗначение(Тип("Дата"), Строка.valueParams);
	//		//	ДатаПрибытия = Строка.ОбъектВладелец.ДатаПрибытия; 
	//		//Стало:
	//		ИначеЕсли Строка.Имя = "ДатаПрибытияПлан" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияПлан) Тогда
	//			ДатаПрибытияПлан = Строка.ОбъектВладелец.ДатаПрибытияПлан;	
	//		ИначеЕсли Строка.Имя = "ДатаПрибытияФакт" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияФакт) Тогда	
	//			ДатаПрибытияФакт = Строка.ОбъектВладелец.ДатаПрибытияФакт;	
	//		ИначеЕсли Строка.Имя = "ДатаПрибытияЖДН" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияЖДН) Тогда	
	//			ДатаПрибытияЖДН = Строка.ОбъектВладелец.ДатаПрибытияЖДН;
	//		ИначеЕсли Строка.Имя = "ДатаОтправленияПлан" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияПлан) Тогда
	//			ДатаОтправленияПлан = Строка.ОбъектВладелец.ДатаОтправленияПлан;
	//		ИначеЕсли Строка.Имя = "ДатаОтправленияФакт" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияФакт) Тогда	
	//			ДатаОтправленияФакт = Строка.ОбъектВладелец.ДатаОтправленияФакт;
	//		ИначеЕсли Строка.Имя = "ДатаОтправленияЖДН" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияЖДН) Тогда	
	//			ДатаОтправленияЖДН = Строка.ОбъектВладелец.ДатаОтправленияЖДН;	
	//		// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 08.07.2024
	//		ИначеЕсли Строка.Имя = "Сервис" Тогда
	//			//Сервис = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			Сервис = Строка.ОбъектВладелец.Сервис;
	//		ИначеЕсли Строка.Имя = "Примечание" Тогда
	//			//Примечание = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			Примечание = Строка.ОбъектВладелец.Примечание;
	//		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
	//		//ИначеЕсли Строка.Имя = "Продукт" Тогда
	//		//	//Продукт = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//		//	Продукт = Строка.ОбъектВладелец.Продукт;
	//		ИначеЕсли Строка.Имя = "УчетноеНаправление" Тогда
	//			//Продукт = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			УчетноеНаправление = Строка.ОбъектВладелец.УчетноеНаправление;
	//		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец
	//		ИначеЕсли Строка.Имя = "УсловнаяДлинаСостава" Тогда
	//			//УсловнаяДлинаСостава = XMLЗначение(Тип("Число"), Строка.valueParams);
	//			УсловнаяДлинаСостава = Строка.ОбъектВладелец.УсловнаяДлинаСостава;
	//		ИначеЕсли Строка.Имя = "РейсОтменен" Тогда
	//			//РейсОтменен = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			РейсОтменен = ?(Строка.ОбъектВладелец.РейсОтменен="0",Ложь,Истина);
	//		ИначеЕсли Строка.Имя = "Автор" Тогда
	//			//Автор = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			Автор = Строка.ОбъектВладелец.Автор;
	//		ИначеЕсли Строка.Имя = "Клиент" Тогда
	//			//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			Клиент = Строка.ОбъектВладелец.Клиент;
	//		ИначеЕсли Строка.Имя = "ГУИД_DX" Тогда
	//			//ГУИД_DX = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			ГУИД_DX = Строка.ОбъектВладелец.ГУИД_DX;
	//		//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
	//		ИначеЕсли Строка.Имя = "ЛотКонтейнеры" Тогда
	//			ЛотКонтейнеры = Строка.ОбъектВладелец.ЛотКонтейнеры;
	//			ЗаполнитьТаблицуРеестрКонтейнеров(ЛотКонтейнеры, ТаблицаРеестрКонтейнеров);
	//		ИначеЕсли Строка.Имя = "ФактВагоны" Тогда
	//			ФактВагоны = Строка.ОбъектВладелец.ФактВагоны;
	//			ЗаполнитьТаблицуФактическийСоставПоезда(ФактВагоны, ТаблицаФактическийСоставПоезда);
	//		//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
	//		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
	//		ИначеЕсли Строка.Имя = "ЛотПродукты" Тогда
	//			ЛотПродукты = Строка.ОбъектВладелец.ЛотПродукты;
	//			ЗаполнитьТаблицуРеестрПродуктов(ЛотПродукты, ТаблицаРеестрПродуктов);
	//		ИначеЕсли Строка.Имя = "CхемаID" Тогда
	//			//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			СхемаКод = Строка.ОбъектВладелец.CхемаID;
	//		ИначеЕсли Строка.Имя = "Cхема" Тогда
	//			//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			СхемаНаименование = Строка.ОбъектВладелец.Cхема;
	//		ИначеЕсли Строка.Имя = "ОтрезокСхемы" Тогда
	//			//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			ОтрезокСхемыНаименование = Строка.ОбъектВладелец.ОтрезокСхемы;
	//		ИначеЕсли Строка.Имя = "ОтрезокСхемыID" Тогда
	//			//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
	//			ОтрезокСхемыКод = Строка.ОбъектВладелец.ОтрезокСхемыID;
	//		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец	
	//		
	//		//Субботин 75866 05.10.2023 начало
	//		ИначеЕсли Строка.Имя = "ПунктОтправленияКод" Тогда
	//			ПунктОтправленияКод = Строка.ОбъектВладелец.ПунктОтправленияКод;
	//		ИначеЕсли Строка.Имя = "ПунктНазначенияКод" Тогда
	//			ПунктНазначенияКод = Строка.ОбъектВладелец.ПунктНазначенияКод;
	//		//Субботин 75866 05.10.2023 конец
	//		
	//		//Евросиб Каблов 09.10.2024 ( Ticket#0367291
	//		ИначеЕсли Строка.Имя = "НомерЛота" Тогда
	//			НомерЛота = Строка.ОбъектВладелец.НомерЛота;
	//		//Евросиб Каблов 09.10.2024 )
	//		
	//		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
	//		ИначеЕсли Строка.Имя = "КТК" Тогда
	//			КТК_DX = Строка.ОбъектВладелец.КТК;
	//		ИначеЕсли Строка.Имя = "ПлановаяВыручка" Тогда
	//			ПлановаяВыручка_DX = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.ОбъектВладелец.ПлановаяВыручка);
	//		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
	//		
	//		КонецЕсли;
	//	КонецЦикла;
	////КонецЕсли;
	////Строка = ОбъектXDTO.Свойства()[0];
	////НомерПоезда = Строка.ОбъектВладелец.НомерПоезда;
	////ПунктОтправления = Строка.ОбъектВладелец.ПунктОтправления;
	////ПунктНазначения = Строка.ОбъектВладелец.ПунктНазначения;
	////ДатаОтправления = Строка.ОбъектВладелец.ДатаОтправления;
	////ДатаПрибытия = Строка.ОбъектВладелец.ДатаПрибытия;
	////Сервис = Строка.ОбъектВладелец.Сервис;
	////Примечание = Строка.ОбъектВладелец.Примечание;
	////Продукт = Строка.ОбъектВладелец.Продукт;
	////УсловнаяДлинаСостава = Строка.ОбъектВладелец.УсловнаяДлинаСостава;
	////РейсОтменен = Строка.ОбъектВладелец.РейсОтменен;
	////Автор = Строка.ОбъектВладелец.Автор;
	////Клиент = Строка.ОбъектВладелец.Клиент;
	////ГУИД_DX = Строка.ОбъектВладелец.ГУИД_DX;
	//
	//СтруктураОтвета = Новый Структура("Сообщение, ГУИД", "", "");

	//Попытка
	//	//Евросиб Каблов 09.10.2024 ( Ticket#0367291		
	//	//Если ЗначениеЗаполнено(ГУИД_DX) Тогда
	//	//	ЗапросРейса = Новый Запрос;
	//	//	ЗапросРейса.Текст = 
	//	//		"ВЫБРАТЬ
	//	//		|	РейсыЖД.Ссылка КАК Ссылка
	//	//		|ИЗ
	//	//		|	Справочник.РейсыЖД КАК РейсыЖД
	//	//		|ГДЕ
	//	//		|	РейсыЖД.ГУИД_DX = &ГУИД_DX";
	//	//	ЗапросРейса.УстановитьПараметр("ГУИД_DX", ГУИД_DX);			
	//	//	РезультатЗапроса = ЗапросРейса.Выполнить().Выбрать();

	//	//	Если РезультатЗапроса.Следующий() Тогда
	//	//		РейсОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//	//	Иначе
	//	//		РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
	//	//		РейсОбъект.КП = Истина;
	//	//		РейсОбъект.ТребуютсяВагоныЕС = Истина;
	//	//	КонецЕсли;
	//	//Иначе
	//	//	РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
	//	//	РейсОбъект.КП = Истина;
	//	//	РейсОбъект.ТребуютсяВагоныЕС = Истина;
	//	//КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ГУИД_DX) Тогда
	//		ТипыДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.РейсыЖД"));
	//		СсылкаПоУИД = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД_DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, ТипыДокументов);
	//	Иначе
	//		СсылкаПоУИД = Неопределено;
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(СсылкаПоУИД) Тогда
	//		РейсОбъект = СсылкаПоУИД.ПолучитьОбъект();
	//		ЭтоНовый = Ложь;
	//	Иначе
	//		РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
	//		РейсОбъект.КП = Истина;
	//		РейсОбъект.ТребуютсяВагоныЕС = Истина;
	//		ЭтоНовый = Истина;
	//	КонецЕсли;
	//	//Евросиб Каблов 09.10.2024 )
	//	
	//	РейсОбъект.НомерПоезда = НомерПоезда; 
	//	//Субботин 75866 05.10.2023 начало
	//	//РейсОбъект.ПунктОтправления = Справочники.Локации.НайтиПоНаименованию((ПунктОтправления);
	//	//РейсОбъект.ПунктНазначения = Справочники.Локации.НайтиПоНаименованию((ПунктНазначения); 
	//	Если ЗначениеЗаполнено(ПунктОтправленияКод) тогда 
	//		РейсОбъект.ПунктОтправления = Справочники.Локации.НайтиПоРеквизиту("КодЖДСтанции", ПунктОтправленияКод);
	//	КонецЕсли; 
	//	Если ЗначениеЗаполнено(ПунктНазначенияКод) тогда
	//		РейсОбъект.ПунктНазначения = Справочники.Локации.НайтиПоРеквизиту("КодЖДСтанции", ПунктНазначенияКод);
	//	КонецЕсли;
	//	//Субботин 75866 05.10.2023 Конец
	//	Попытка
	//		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//		//РейсОбъект.Сервис = Справочники.Продукты.НайтиПоКоду(Продукт).Родитель;
	//		РейсОбъект.Сервис = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление).Родитель;
	//		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//	Исключение
	//	КонецПопытки;
	//	Если НЕ ЗначениеЗаполнено(РейсОбъект.Сервис) Тогда
	//		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//		//РейсОбъект.Сервис = Справочники.Продукты.НайтиПоКоду(Продукт);
	//		РейсОбъект.Сервис = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление);
	//		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//	КонецЕсли;
	//	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023 -начало
	//	//РейсОбъект.Продукт = Справочники.Продукты.НайтиПоКоду(Продукт);
	//	РейсОбъект.Продукт = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление);
	//	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023 -конец
	//	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
	//	Если ТаблицаРеестрПродуктов.Количество() = 1 Тогда
	//		РейсОбъект.ПродуктДКП = Справочники.ПродуктыДКП.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ТаблицаРеестрПродуктов[0].ПродуктID, 9,,));
	//	КонецЕсли;
	//	                                                        
	//	СхемаПеревозки = Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СхемаКод, 9,,));
	//	Если СхемаПеревозки = Справочники.СхемыПеревозки.ПустаяСсылка() И ЗначениеЗаполнено(СхемаКод) Тогда
	//		СхемаПеревозкиОб = СПравочники.СхемыПеревозки.СоздатьЭлемент();
	//		СхемаПеревозкиОб.Наименование = СхемаНаименование;
	//		СхемаПеревозкиОб.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СхемаКод, 9,,);
	//		СхемаПеревозкиОб.Записать();
	//		СхемаПеревозки = СхемаПеревозкиОб.Ссылка;
	//	КонецЕсли;
	//	РейсОбъект.СхемаПеревозки = СхемаПеревозки;
	//	ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОтрезокСхемыКод, 9,,));
	//	Если ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() И ЗначениеЗаполнено(ОтрезокСхемыКод) Тогда
	//		ОтрезокСхемыПеревозкиОб = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
	//		ОтрезокСхемыПеревозкиОб.Наименование = ОтрезокСхемыНаименование;
	//		ОтрезокСхемыПеревозкиОб.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОтрезокСхемыКод, 9,,);
	//		ОтрезокСхемыПеревозкиОб.Схема = РейсОбъект.СхемаПеревозки;
	//		ОтрезокСхемыПеревозкиОб.Записать();
	//		ОтрезокСхемыПеревозки = ОтрезокСхемыПеревозкиОб.Ссылка;
	//	КонецЕсли;
	//	РейсОбъект.ОтрезокСхемыПеревозки = ОтрезокСхемыПеревозки;
	//	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец
	//	
	//	РейсОбъект.Автор = Справочники.Пользователи.НайтиПоНаименованию(Автор); 
	//	// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 08.07.2024
	//	// Было:
	//	//РейсОбъект.ДатаПрибытия = Дата(ДатаПрибытия);
	//	//РейсОбъект.ДатаОтправления = Дата(ДатаОтправления); 
	//	//Стало:
	//	РейсОбъект.ДатаПрибытия = Дата(ДатаПрибытияПлан); 
	//	РейсОбъект.ДатаПрибытияФакт = Дата(ДатаПрибытияФакт);
	//	РейсОбъект.ФактическаяДатаПрибытияПоЖДН = Дата(ДатаПрибытияЖДН);
	//	РейсОбъект.ДатаОтправления = Дата(ДатаОтправленияПлан); 
	//	РейсОбъект.ДатаОтправленияФакт = Дата(ДатаОтправленияФакт);
	//	РейсОбъект.ФактическаяДатаОтправленияПоЖДН = Дата(ДатаОтправленияЖДН);
	//	// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 08.07.2024
	//	РейсОбъект.РейсОтменен = РейсОтменен;
	//	РейсОбъект.Примечание = Примечание;
	//	РейсОбъект.УсловнаяДлинаСостава = УсловнаяДлинаСостава;
	//	//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
	//	РейсОбъект.РеестрКонтейнеров.Очистить();
	//	Для Каждого строкаТаблицыРеестрКонтейнеров Из ТаблицаРеестрКонтейнеров Цикл
	//		новСтрРеестрКонтейнеров = РейсОбъект.РеестрКонтейнеров.Добавить();
	//		ЗаполнитьЗначенияСвойств(новСтрРеестрКонтейнеров,строкаТаблицыРеестрКонтейнеров);
	//		новСтрРеестрКонтейнеров.ЧужойСервис = ?(строкаТаблицыРеестрКонтейнеров.ЧужойСервис = "1", Истина, Ложь);
	//	КонецЦикла;
	//	РейсОбъект.ФактическийСоставПоезда.Очистить();
	//	Для Каждого строкаТаблицыФактическийСоставПоезда Из ТаблицаФактическийСоставПоезда Цикл
	//		новСтрФактическийСоставПоезда = РейсОбъект.ФактическийСоставПоезда.Добавить();
	//		ЗаполнитьЗначенияСвойств(новСтрФактическийСоставПоезда,строкаТаблицыФактическийСоставПоезда);
	//	КонецЦикла;
	//	//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
	//	
	//	//Евросиб Каблов 09.10.2024 ( Ticket#0367291
	//	РейсОбъект.ЛотDX = НомерЛота;
	//	//Евросиб Каблов 09.10.2024 )
	//	
	//	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
	//	РейсОбъект.КТК_DX = КТК_DX;
	//	РейсОбъект.ПлановаяВыручка_DX = ПлановаяВыручка_DX;
	//	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
	//	
	//	РейсОбъект.Записать();
	//	
	//	Ссылка = РейсОбъект.Ссылка;
	//	//Евросиб Каблов 09.10.2024 ( Ticket#0367291
	//	//СтруктураОтвета.ГУИД = Ссылка.УникальныйИдентификатор();		
	//	//
	//	//РейсОбъект.ГУИД_DX = ?(ЗначениеЗаполнено(ГУИД_DX),ГУИД_DX,Ссылка.УникальныйИдентификатор());
	//	//РейсОбъект.Записать();
	//	Если ЭтоНовый Тогда
	//		ГУИД_DX = Строка(Ссылка.УникальныйИдентификатор());		
	//		РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(ГУИД_DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, РейсОбъект.Ссылка);
	//	КонецЕсли;
	//	
	//	СтруктураОтвета.ГУИД = ГУИД_DX;
	//	//Евросиб Каблов 09.10.2024 )

	//	НаборЗаписей = РегистрыСведений.РеестрПримечанийКЖДОтправкам.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Отправка.Установить(Ссылка);
	//	НаборЗаписей.Прочитать();
	//	Если НаборЗаписей.Количество() = 0 Тогда
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.Отправка = Ссылка;
	//		НоваяЗапись.Примечание = "";
	//		//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоНаименованию(Клиент);
	//		НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоКоду(Клиент);
	//	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	//		НоваяЗапись = НаборЗаписей[0];
	//		//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоНаименованию(Клиент);
	//		НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоКоду(Клиент);
	//	КонецЕсли;
	//	НаборЗаписей.Записать();
	//	
	//Исключение
	//	СтруктураОтвета.Сообщение = ОписаниеОшибки();
	//КонецПопытки;
	//
	////Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураОтвета);
	//Возврат "<Property name=""Сообщение"">"+СтруктураОтвета.Сообщение+"</Property><Property name=""ГУИД"">"+СтруктураОтвета.ГУИД+"</Property>";
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец (закомментировал, перенесено в ЕСОбменСервер)
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало (закомментировал, перенесено в ЕСОбменСервер)
////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
//Процедура ЗаполнитьТаблицуФактическийСоставПоезда(ФактВагоны, ТаблицаФактическийСоставПоезда)
//	Если ФактВагоны.Свойства().Получить("Вагон") = Неопределено Тогда
//		Возврат;
//	КонецЕсли; 	
//	ТаблицаФактическийСоставПоезда = Новый ТаблицаЗначений;
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерКонтейнера");
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерНакладной");
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерЗаписиМакета");
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("ТипКонтейнера");
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерВагона");
//	ТаблицаФактическийСоставПоезда.Колонки.Добавить("Статус");
//	
//	Если ТипЗнч(ФактВагоны.Вагон) = Тип("СписокXDTO") Тогда				
//		Для Каждого Элемент Из ФактВагоны.Вагон Цикл
//			стрТаблицыФактическийСоставПоезда = ТаблицаФактическийСоставПоезда.Добавить();	
//			ЗаполнитьЗначенияСвойств(стрТаблицыФактическийСоставПоезда, Элемент);
//		КонецЦикла;
//	ИначеЕсли ТипЗнч(ФактВагоны.Вагон) = Тип("ОбъектXDTO") Тогда
//		стрТаблицыФактическийСоставПоезда = ТаблицаФактическийСоставПоезда.Добавить();	
//		ЗаполнитьЗначенияСвойств(стрТаблицыФактическийСоставПоезда, ФактВагоны.Вагон);
//	КонецЕсли;
//КонецПроцедуры
////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец (закомментировал, перенесено в ЕСОбменСервер)

//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало (закомментировал, перенесено в ЕСОбменСервер)
////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
//Процедура ЗаполнитьТаблицуРеестрКонтейнеров(ЛотКонтейнеры, ТаблицаРеестрКонтейнеров)
//	Если ЛотКонтейнеры.Свойства().Получить("Контейнер") = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	ТаблицаРеестрКонтейнеров = Новый ТаблицаЗначений;
//	ТаблицаРеестрКонтейнеров.Колонки.Добавить("НомерКонтейнера");
//	ТаблицаРеестрКонтейнеров.Колонки.Добавить("ЧужойСервис");
//	
//	Если ТипЗнч(ЛотКонтейнеры.Контейнер) = Тип("СписокXDTO") Тогда				
//		Для Каждого Элемент Из ЛотКонтейнеры.Контейнер Цикл
//			стрТаблицыРеестрКонтейнеров = ТаблицаРеестрКонтейнеров.Добавить();	
//			ЗаполнитьЗначенияСвойств(стрТаблицыРеестрКонтейнеров, Элемент);
//		КонецЦикла;
//	ИначеЕсли ТипЗнч(ЛотКонтейнеры.Контейнер) = Тип("ОбъектXDTO") Тогда
//		стрТаблицыРеестрКонтейнеров = ТаблицаРеестрКонтейнеров.Добавить();	
//		ЗаполнитьЗначенияСвойств(стрТаблицыРеестрКонтейнеров, ЛотКонтейнеры.Контейнер);		
//	КонецЕсли;
//КонецПроцедуры
////ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец (закомментировал, перенесено в ЕСОбменСервер)

//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало (закомментировал, перенесено в ЕСОбменСервер)
//Процедура ЗаполнитьТаблицуРеестрПродуктов(ЛотПродукты, ТаблицаРеестрПродуктов) //ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
//	Если ЛотПродукты.Свойства().Получить("Продукт") = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	ТаблицаРеестрПродуктов = Новый ТаблицаЗначений;
//	ТаблицаРеестрПродуктов.Колонки.Добавить("ПродуктID");
//	ТаблицаРеестрПродуктов.Колонки.Добавить("Продукт");
//	
//	Если ТипЗнч(ЛотПродукты.Продукт) = Тип("СписокXDTO") Тогда				
//		Возврат
//	ИначеЕсли ТипЗнч(ЛотПродукты.Продукт) = Тип("ОбъектXDTO") Тогда
//		ТаблицаРеестрПродуктовСтрока = ТаблицаРеестрПродуктов.Добавить();	
//		ЗаполнитьЗначенияСвойств(ТаблицаРеестрПродуктовСтрока, ЛотПродукты.Продукт);		
//	КонецЕсли;
//КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец (закомментировал, перенесено в ЕСОбменСервер)

Функция PutVehicleData(XMLParams) 
	
	Возврат ЕСОбменСервер.ОбновитьДанныеЗапросаНаАвтоперевозку(XMLParams);
	
КонецФункции

//Евросиб Каблов 12.10.2022 58752
Функция SuppliersTariffs()
	
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(ЕСОбменСервер.ПолучитьТаблицуТарифовПоставщиков());
	
КонецФункции

//Евросиб Каблов 12.10.2022 58752
Функция MandatoryTransportationОperations()
	
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(ЕСОбменСервер.ПолучитьТаблицуОбязательныхОперацийПеревозок());
	
КонецФункции

// + ДИТ Кузнецов Е.Е. 50174 26.10.2022
Функция GetKTKList()

	МоментПолучения = ТекущаяДата();
	Запрос = Новый Запрос;
	//Запрос сбора данных
	//ДИТ Шевченко А.В. 62309 29.12.22 -начало
	//Запрос.Текст = ТекстЗапросаСпискаКТК();
	Запрос.Текст = АРМ_Сервер.СобратьТекстЗапросаТекущийСток();
	Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
	ТаблицаКТК = ПолучитьПустуюТаблицуКТК();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ТаблицаКТК.Добавить();
		НовСтрока.Период 			= Выборка.ДатаВвозаВывоза;
		НовСтрока.Контейнер 		= Выборка.КонтейнерНаименование;
		НовСтрока.Состояние 		= "Порожний";
		Если Выборка.Состояние Тогда
			НовСтрока.Состояние 		= "Груженый";
		КонецЕсли;	
		НовСтрока.Поврежден 		= "Нет";
		Если Выборка.Поврежден Тогда
			НовСтрока.Поврежден 		= "Да";
		КонецЕсли;
		НовСтрока.Терминал 		    = Выборка.ТерминалНаименование;
		НовСтрока.КодСodeco 		= СокрЛП(Выборка.ТерминалПредставлениеВCodeco);
		НовСтрока.КодТерминала  	= СокрЛП(Выборка.ТерминалКод);
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//НовСтрока.ВидСобственности  = Выборка.ВидСобственностиДляВебСервиса;
		//Стало:
		НовСтрока.ВидСобственности  = Выборка.ВидСобственности;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	КонецЦикла;	
	//ДИТ Шевченко А.В. 62309 29.12.22 -конец
	//Сериализация
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(ТаблицаКТК);
	
КонецФункции	

Функция ПолучитьПустуюТаблицуКТК() //ДИТ Шевченко А.В. 62309 29.12.22
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	ТЗ.Колонки.Добавить("Состояние",Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Терминал",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЗ.Колонки.Добавить("Поврежден",Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("КодСodeco",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(30)));
	ТЗ.Колонки.Добавить("КодТерминала",Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ВидСобственности",Новый ОписаниеТипов("Строка"));
	Возврат ТЗ
КонецФункции	

Функция ТекстЗапросаСпискаКТК()
	Возврат "ВЫБРАТЬ
	        |	ИнформацияОтТерминаловСрезПоследних.Период КАК Период,
	        |	ВЫБОР
	        |		КОГДА ИнформацияОтТерминаловСрезПоследних.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	        |			ТОГДА ИнформацияОтТерминаловСрезПоследних.НомерКонтейнера
	        |		ИНАЧЕ ИнформацияОтТерминаловСрезПоследних.Контейнер.Наименование
	        |	КОНЕЦ КАК НомерКТК,
	        |	ВЫБОР
	        |		КОГДА ИнформацияОтТерминаловСрезПоследних.Состояние
	        |			ТОГДА ""Груженый""
	        |		ИНАЧЕ ""Порожний""
	        |	КОНЕЦ КАК Состояние,
	        |	ЕСТЬNULL(ИнформацияОтТерминаловСрезПоследних.Терминал.Наименование, """") КАК Терминал,
	        |	"""" КАК Сток,
	        |	ИнформацияОтТерминаловСрезПоследних.Поврежден КАК Поврежден,
	        |	ИнформацияОтТерминаловСрезПоследних.Статус.Наименование КАК Статус,
	        |	1 КАК Приоритет
	        |ПОМЕСТИТЬ ВТ_ДетальныеЗаписи
	        |ИЗ
	        |	РегистрСведений.ИнформацияОтТерминалов.СрезПоследних КАК ИнформацияОтТерминаловСрезПоследних
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА стоки_ТекущиеДанныеСрезПоследних.тек_ДатаПриемаВСток
	        |		ИНАЧЕ стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока
	        |	КОНЕЦ,
	        |	стоки_ТекущиеДанныеСрезПоследних.КТК.Наименование,
	        |	"""",
	        |	ВЫБОР
	        |		КОГДА стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи.Родитель.Наименование
	        |		ИНАЧЕ стоки_ТекущиеДанныеСрезПоследних.тек_СтокВзятия.Родитель.Наименование
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи.Наименование
	        |		ИНАЧЕ стоки_ТекущиеДанныеСрезПоследних.тек_СтокВзятия.Наименование
	        |	КОНЕЦ,
	        |	стоки_ТекущиеДанныеСрезПоследних.тек_ТребуетсяРемонт,
	        |	стоки_ТекущиеДанныеСрезПоследних.тек_Статус,
	        |	0
	        |ИЗ
	        |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	        |ГДЕ
	        |	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МАКСИМУМ(ВТ_ДетальныеЗаписи.Период) КАК Период,
	        |	ВТ_ДетальныеЗаписи.НомерКТК КАК НомерКТК
	        |ПОМЕСТИТЬ ВТ_МаксимумыПериод
	        |ИЗ
	        |	ВТ_ДетальныеЗаписи КАК ВТ_ДетальныеЗаписи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ДетальныеЗаписи.НомерКТК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_МаксимумыПериод.Период КАК Период,
	        |	ВТ_МаксимумыПериод.НомерКТК КАК НомерКТК,
	        |	МАКСИМУМ(ВТ_ДетальныеЗаписи.Приоритет) КАК Приоритет
	        |ПОМЕСТИТЬ ВТ_МаксимумыПериодПриоритет
	        |ИЗ
	        |	ВТ_МаксимумыПериод КАК ВТ_МаксимумыПериод
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДетальныеЗаписи КАК ВТ_ДетальныеЗаписи
	        |		ПО ВТ_МаксимумыПериод.НомерКТК = ВТ_ДетальныеЗаписи.НомерКТК
	        |			И ВТ_МаксимумыПериод.Период = ВТ_ДетальныеЗаписи.Период
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_МаксимумыПериод.Период,
	        |	ВТ_МаксимумыПериод.НомерКТК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_МаксимумыПериодПриоритет.НомерКТК КАК НомерКТК,
	        |	ВТ_ДетальныеЗаписи.Терминал КАК Терминал,
	        |	ВТ_ДетальныеЗаписи.Сток КАК Сток,
	        |	ВТ_ДетальныеЗаписи.Состояние КАК Состояние,
	        |	ВТ_ДетальныеЗаписи.Период КАК Период,
	        |	ПРЕДСТАВЛЕНИЕ(ВТ_ДетальныеЗаписи.Статус) КАК Статус,
	        |	ВТ_ДетальныеЗаписи.Поврежден КАК Поврежден
	        |ИЗ
	        |	ВТ_МаксимумыПериодПриоритет КАК ВТ_МаксимумыПериодПриоритет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДетальныеЗаписи КАК ВТ_ДетальныеЗаписи
	        |		ПО ВТ_МаксимумыПериодПриоритет.Период = ВТ_ДетальныеЗаписи.Период
	        |			И ВТ_МаксимумыПериодПриоритет.НомерКТК = ВТ_ДетальныеЗаписи.НомерКТК
	        |			И ВТ_МаксимумыПериодПриоритет.Приоритет = ВТ_ДетальныеЗаписи.Приоритет";
КонецФункции
// - ДИТ Кузнецов Е.Е. 50174 26.10.2022 

//Евросиб - АСуслов 10.08.2023 12:54:18 #локации 67502 62583
//(
Функция GetLocationsAnalogues()

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	АналогиЛокаций.Локация.Код КАК ЛокацияКод,
	//|	АналогиЛокаций.Локация.Наименование КАК ЛокацияНаименование,
	//|	АналогиЛокаций.Аналог.Код КАК ЛокацияАналогКод,
	//|	АналогиЛокаций.Аналог.Наименование КАК ЛокацияАналогНаименование
	//|ИЗ
	//|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций";
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(РезультатЗапроса.Выгрузить())
//	Параметры = Новый Структура("Наименование", searchString);
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокАналоговЛокаций", Новый Структура);
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокАналоговЛокаций");
	
	
КонецФункции


Функция GetLocationHorizontalLinks()
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.Код КАК ЖДСтанцияКод,
	//|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.Наименование КАК ЖДСтанцияНаименование,
	//|	ГоризонтальныеСвязиЛокаций.Терминал.Код КАК ТерминалКод,
	//|	ГоризонтальныеСвязиЛокаций.Терминал.Наименование КАК ТерминалНаименование,
	//|	ГоризонтальныеСвязиЛокаций.Порт.Код КАК ПортКод,
	//|	ГоризонтальныеСвязиЛокаций.Порт.Наименование КАК ПортНаименование
	//|ИЗ
	//|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций";
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(РезультатЗапроса.Выгрузить())
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокГоризонтальныеСвязиЛокаций", Новый Структура);
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокГоризонтальныеСвязиЛокаций");
КонецФункции


Функция GetCountries()
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СтраныМира.Код КАК Код,
	//|	СтраныМира.Наименование КАК Наименование,
	//|	СтраныМира.НаименованиеПолное КАК НаименованиеПолное,
	//|	СтраныМира.КодАльфа2 КАК КодАльфа2,
	//|	СтраныМира.КодАльфа3 КАК КодАльфа3,
	//|	СтраныМира.УчастникЕАЭС КАК УчастникЕАЭС,
	//|	СтраныМира.ЗагружатьДорогиИСтанцииИзЭТРАН КАК ЗагружатьДорогиИСтанцииИзЭТРАН
	//|ИЗ
	//|	Справочник.СтраныМира КАК СтраныМира";
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(РезультатЗапроса.Выгрузить())
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокСтраныМира", Новый Структура);
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокСтраныМира");
КонецФункции


Функция GetRailRoads()
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЖелезныеДороги.Код КАК Код,
	//|	ЖелезныеДороги.Наименование КАК Наименование,
	//|	ЖелезныеДороги.Страна.Код КАК СтранаКод
	//|ИЗ
	//|	Справочник.ЖелезныеДороги КАК ЖелезныеДороги";
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(РезультатЗапроса.Выгрузить())
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокЖелезныеДороги", Новый Структура);
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокЖелезныеДороги");
КонецФункции

//)
//Евросиб - АСуслов 10.08.2023 12:55:12 #локации 67502 62583
   
Функция getActiveUsers()
	//ДИТ Шевченко А.В. 25.05.2022 номера заявки нет по письму от Сыскова Юрия -Начало
	ИтогСписокСоединений = Новый ДеревоЗначений;
	ИтогСписокСоединений.Колонки.Добавить("Пользователь");
	ИтогСписокСоединений.Колонки.Добавить("Приложение");
	ИтогСписокСоединений.Колонки.Добавить("НачалоРаботы");
	ИтогСписокСоединений.Колонки.Добавить("Компьютер");
	ИтогСписокСоединений.Колонки.Добавить("Соединение");
	    	
	СоединенияИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	
	Для Каждого Соединение Из СоединенияИнформационнойБазы Цикл
		
		Если СтрНайти(Соединение.ИмяПриложения,"1CV8C") > 0 
			ИЛИ СтрНайти(Соединение.ИмяПриложения,"WebClient") > 0 Тогда
			
			ТЗ=ИтогСписокСоединений.Строки.Добавить();                               		
			ТЗ.Пользователь=Соединение.Пользователь.Имя;                      		
			ТЗ.Приложение=ПредставлениеПриложения(Соединение.ИмяПриложения);  		
			ТЗ.НачалоРаботы=Соединение.НачалоСеанса;                          		
			ТЗ.Компьютер=Соединение.ИмяКомпьютера;                            		
			ТЗ.Соединение=Соединение.НомерСоединения; 
		КонецЕсли;
	КонецЦикла;
	
    Ответ = ЕСОбменСервер.ЗаписатьДеревоВXML(ИтогСписокСоединений);
	Возврат Ответ;
	//ДИТ Шевченко А.В. 25.05.2022 номера заявки нет по письму от Сыскова Юрия -Конец
КонецФункции

//Субботин 74357 27.09.2023 Начало # коносаменты и морские рейсы
Функция  CreateDispatchSea(XMLParams) 
    
	Чтение 				= Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	Фабрика 			= Новый ФабрикаXDTO;
	ОбъектXDTO			= Фабрика.ПрочитатьXML(Чтение); 
	
	МассивОбработанныхДокументов = Новый Массив; 
	МодульРС 		= РегистрыСведений.ПротоколОбменов;
	ЗагрузкаДанных 	= Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
	УзелОбмена 		= Перечисления.УзлыОбмена.DX;
	
	ТипОбъекта = Новый СписокЗначений;
	ТипОбъекта.Добавить(Тип("СправочникСсылка.РейсыМоре"));
	//РегистрыСведений.ПротоколОбменов.УдалитьНеподтвержденныеОбъекты(УзелОбмена, ЗагрузкаДанных, ТипОбъекта); //Евросиб(ДИТ), Беляев СЮ, US 88935/TA 89126, 12-08-2024, закомменировал (перенесено в отдельное задание)
	
	СтруктураПоискаВПротоколах = Новый Структура ;
	СтруктураПоискаВПротоколах.Вставить("МодульРС",МодульРС);
	СтруктураПоискаВПротоколах.Вставить("ЗагрузкаДанных",ЗагрузкаДанных); 
	СтруктураПоискаВПротоколах.Вставить("УзелОбмена",УзелОбмена);
	
	Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) тогда 	
		Для каждого ДанныеРейса из ОбъектXDTO.Шапка цикл

		СтруктураОтвета = Новый Структура("ID_DX, ГУИД_DX, Error");
		СтруктураОтвета.Вставить("ID_DX", ДанныеРейса.ID_DX);
		
		Результат = ЕСОбменСервер.ОбработатьРейс(ДанныеРейса, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипОбъекта) ;
				
		СтруктураОтвета.Вставить("Error", Результат.Error);
		СтруктураОтвета.Вставить("ГУИД_DX", Результат.ГУИД);

		МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
	КонецЦикла;
	
	Иначе		
		 ДанныеРейса = ОбъектXDTO.Шапка;

		СтруктураОтвета = Новый Структура("ID_DX, ГУИД_DX, Error");
		СтруктураОтвета.Вставить("ID_DX", ДанныеРейса.ID_DX);
		Результат = ЕСОбменСервер.ОбработатьРейс(ДанныеРейса, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипОбъекта) ;
			
		СтруктураОтвета.Вставить("Error", Результат.Error);
		СтруктураОтвета.Вставить("ГУИД_DX", Результат.ГУИД);
		МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
		КонецЕсли;
		
	//формирование и выгрузка ответа
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML(); //
	Запись.ЗаписатьНачалоЭлемента("Root"); 	
	
	Для Каждого Док Из МассивОбработанныхДокументов Цикл
		Запись.ЗаписатьНачалоЭлемента("Коносамент");       		
		Запись.ЗаписатьАтрибут("ID_DX",Док.ID_DX);
		Запись.ЗаписатьАтрибут("ГУИД_DX",Строка(Док.ГУИД_DX));
		Запись.ЗаписатьАтрибут("Error",Док.Error);
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	ОтветXml = Запись.Закрыть();

	Возврат ОтветXml	

КонецФункции 

&НаСервере
Функция CreateConsignment(XMLParams) 
	
	Чтение 				= Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	Фабрика 			= Новый ФабрикаXDTO;
	ОбъектXDTO			= Фабрика.ПрочитатьXML(Чтение);  
	
	МассивОбработанныхДокументов = Новый Массив; 
	МодульРС 		= РегистрыСведений.ПротоколОбменов;
	ЗагрузкаДанных 	= Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
	УзелОбмена 		= Перечисления.УзлыОбмена.DX;
	
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ТранспортныйДокумент"));
	//РегистрыСведений.ПротоколОбменов.УдалитьНеподтвержденныеОбъекты(УзелОбмена, ЗагрузкаДанных, ТипыДокументов); //Евросиб(ДИТ), Беляев СЮ, US 88935/TA 89126, 12-08-2024, закомменировал (перенесено в отдельное задание)
	
	СтруктураПоискаВПротоколах = Новый Структура ;
	СтруктураПоискаВПротоколах.Вставить("МодульРС",МодульРС);
	СтруктураПоискаВПротоколах.Вставить("ЗагрузкаДанных",ЗагрузкаДанных); 
	СтруктураПоискаВПротоколах.Вставить("УзелОбмена",УзелОбмена);
	
	Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда 	
		Для каждого ДанныеКоносамента из ОбъектXDTO.Шапка Цикл

		СтруктураОтвета = Новый Структура("ID_DX, ГУИД_DX, Error");
		СтруктураОтвета.Вставить("ID_DX", ДанныеКоносамента.ID_DX);
		
		//Если что-то не заполнено из обязательных реквизитов фиксируем и пропускам документ		
		НеобходимыеРеквизиты = ЕСОбменСервер.ПроверитьНаборОбязательныхРеквизитов(ДанныеКоносамента); 
		Если НеобходимыеРеквизиты = Ложь Тогда
			 СтруктураОтвета.Вставить("Error", "Не заполнена дата документа");
			 МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
			Продолжить;
		КонецЕсли;
		Результат = ЕСОбменСервер.ОбработатьКоносамент(ДанныеКоносамента, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипыДокументов) ;
		СтруктураОтвета.Вставить("ГУИД_DX", Результат.ГУИД);
     	СтруктураОтвета.Вставить("Error", Результат.Error); 
		МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
	КонецЦикла;
	
	Иначе		
		 ДанныеКоносамента = ОбъектXDTO.Шапка;

		СтруктураОтвета = Новый Структура("ID_DX, ГУИД_DX, Error");
		СтруктураОтвета.Вставить("ID_DX", ДанныеКоносамента.ID_DX);
		
		//Если что-то не заполнено из обязательных реквизитов фиксируем и пропускам документ		
		НеобходимыеРеквизиты = ЕСОбменСервер.ПроверитьНаборОбязательныхРеквизитов(ДанныеКоносамента); 
		Если НеобходимыеРеквизиты = Ложь Тогда
			СтруктураОтвета.Вставить("Error", "Не заполнена дата документа");
			МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
		Иначе
			Результат = ЕСОбменСервер.ОбработатьКоносамент(ДанныеКоносамента, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипыДокументов) ;
			СтруктураОтвета.Вставить("ГУИД_DX", Результат.ГУИД);
     		СтруктураОтвета.Вставить("Error", Результат.Error); 
			МассивОбработанныхДокументов.Добавить(СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
		
	//формирование и выгрузка ответа
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML(); //
	Запись.ЗаписатьНачалоЭлемента("Root"); 	
	
	Для Каждого Док Из МассивОбработанныхДокументов Цикл
		Запись.ЗаписатьНачалоЭлемента("Коносамент");       		
		Запись.ЗаписатьАтрибут("ID_DX",Док.ID_DX);
		Запись.ЗаписатьАтрибут("ГУИД_DX",Строка(Док.ГУИД_DX));
		Запись.ЗаписатьАтрибут("Error",Док.Error);
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	ОтветXml = Запись.Закрыть();

	Возврат ОтветXml	
	
КонецФункции
//Субботин 74357 27.09.2023 Конец

Функция GetAddressesInAreas()
	Данные = ЕСОбменСервер.ПолучитьДанныеЧерезМакетСКД("СписокАдресаВНаселенныхПунктах", Новый Структура,,Истина);
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
	Возврат ЕСОбменСервер.ЗаписатьТаблицуВXML(Данные, "СписокЖелезныеДороги");
КонецФункции

//Субботин 74357 03.11.2023  начало
Функция UploadConfirmation(XMLParams)
	Чтение 				= Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	Фабрика 			= Новый ФабрикаXDTO;
	ОбъектXDTO			= Фабрика.ПрочитатьXML(Чтение);
	
	ЗагрузкаДанных 	= Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
	УзелОбмена 		= Перечисления.УзлыОбмена.DX;


	Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
		Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
			ПодтвердитьЗагрузкуОбъектаПоГУИД(Объект.ГУИД_DX, ЗагрузкаДанных, УзелОбмена)
		КонецЦикла	
		
	Иначе		
		Объект = ОбъектXDTO.Шапка;
		ПодтвердитьЗагрузкуОбъектаПоГУИД(Объект.ГУИД_DX, ЗагрузкаДанных, УзелОбмена);
	КонецЕсли;
	Возврат "Подтверждение завершено"

КонецФункции 

Процедура ПодтвердитьЗагрузкуОбъектаПоГУИД(ГУИД, Действие, УзелОбмена) Экспорт
	
	СсылкаНаОбъект = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД, Действие, УзелОбмена);
	Если СсылкаНаОбъект <> Неопределено Тогда 
		Объект = СсылкаНаОбъект.Получитьобъект();
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ПометкаУдаления") тогда
			 				
			ТипЗначения = ТипЗнч(СсылкаНаОбъект);
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
			//Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда// заготовка под справочник
			// что-то
			Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				Попытка
					Объект.Записать(РежимЗаписиДокумента.Проведение); 
				Исключение 
					Объект.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки; 				
			КонецЕсли; 
			
		КонецЕсли;
		
		//УстановитьПривилегированныйРежим(Истина);	
		НаборЗаписей = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДействиеПриОбмене.Установить(Действие);
		НаборЗаписей.Отбор.УзелОбмена.Установить(УзелОбмена);
		НаборЗаписей.Отбор.Объект.Установить(Объект.ссылка);
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			 Запись.ЗагрузкаПодтверждена = Истина; 
		 КонецЦикла;
		 НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

//Субботин 74357 03.11.2023  Конец

// Рыбьяков К.А 14.05.2024 US 81613 Начало
Функция GetProcessedDocuments(DateBegin, DateEnd) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОтработанныеДокументыБухгалтерией.Документ.ПСЦПоставщика
	|			ТОГДА ""Протокол согласования договорной цены (подрядчик)""
	|		ИНАЧЕ ""Протокол согласования договорной цены (клиент)""
	|	КОНЕЦ КАК Документ,
	|	ОтработанныеДокументыБухгалтерией.Документ КАК ДокументСсылка,
	|	ОтработанныеДокументыБухгалтерией.НомерДокумента КАК НомерДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ОтработанныеДокументыБухгалтерией.Организация) КАК Организация,
	|	ОтработанныеДокументыБухгалтерией.ДатаУчетаДокумента КАК ДатаУчетаДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ОтработанныеДокументыБухгалтерией.Контрагент) КАК НаименованиеКонтрагента,
	|	ОтработанныеДокументыБухгалтерией.Контрагент КАК Контрагент,
	|	ОтработанныеДокументыБухгалтерией.Проведен КАК Проведен,
	|	ОтработанныеДокументыБухгалтерией.ДатаУдаленияДокумента КАК ДатаУдаленияДокумента,
	|	ОтработанныеДокументыБухгалтерией.ДатаДокумента КАК ДатаДокумента,
	|	ЕСТЬNULL(ОтработанныеДокументыБухгалтерией.Ответственный.Наименование, """") КАК Ответственный
	|ИЗ
	|	РегистрСведений.ОтработанныеДокументыБухгалтерией КАК ОтработанныеДокументыБухгалтерией
	|ГДЕ
	|	(ОтработанныеДокументыБухгалтерией.ДатаУчетаДокумента МЕЖДУ &НачПериод И &КонПериод
	|			ИЛИ ОтработанныеДокументыБухгалтерией.ДатаУдаленияДокумента МЕЖДУ &НачПериод И &КонПериод
	|				И ОтработанныеДокументыБухгалтерией.ДатаУчетаДокумента <> ДАТАВРЕМЯ(1, 1, 1))";

	Запрос.УстановитьПараметр("КонПериод", DateEnd);
	Запрос.УстановитьПараметр("НачПериод", DateBegin);
		
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("Protocols");
	
	Для Каждого СтрокаПСЦ Из Выгрузка Цикл
		
		Запись.ЗаписатьНачалоЭлемента("Protocol");   
		
		Запись.ЗаписатьНачалоЭлемента("ProtocolName");		
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.Документ));		
		Запись.ЗаписатьКонецЭлемента();
						
		Запись.ЗаписатьНачалоЭлемента("ProtocolID");		
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.ДокументСсылка));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Number");
		Запись.ЗаписатьТекст(СтрокаПСЦ.НомерДокумента);		
		Запись.ЗаписатьКонецЭлемента();
				
		Запись.ЗаписатьНачалоЭлемента("Organization");		
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.Организация));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("AccountingDate");
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.ДатаУчетаДокумента));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("ContragentName");		
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.НаименованиеКонтрагента));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("ContragentID");		
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.Контрагент));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Actual");
		Запись.ЗаписатьТекст(XMLСтрока(?(СтрокаПСЦ.Проведен, 1, 0)));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("DocumentDate");
		Запись.ЗаписатьТекст(XMLСтрока(СтрокаПСЦ.ДатаДокумента));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Manager");
		Если СтрокаПСЦ.Ответственный = "" Тогда
			Запись.ЗаписатьТекст(XMLСтрока(""));	
		Иначе
			Запись.ЗаписатьТекст(XMLСтрока(ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаПСЦ.Ответственный)));
		КонецЕсли;
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("DeleteDate");
		Запись.ЗаписатьТекст(XMLСтрока(?(СтрокаПСЦ.Проведен, Дата("00010101"), СтрокаПСЦ.ДатаУдаленияДокумента)));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	
	ПротоколыXML = Запись.Закрыть();
	
	Возврат ПротоколыXML;	
			
КонецФункции
// Рыбьяков К.А 14.05.2024 US 81613 конец  

// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. 01.08.2024  
// Выгрузка релизов клиента в двух вариантах: за период и измененные по плану обмена 
Функция GetOwnerRelease(RequestingSystem, DateStart, DateEnd) Экспорт  
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало (код перемещен в общий модуль ЕСОбменСервер)
	Возврат ЕСОбменСервер.ПолучитьДанныеРелизов(RequestingSystem, DateStart, DateEnd);
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
	
КонецФункции  

// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. 02.08.2024
Функция DownloadConfirmation(XMLParams, RequestingSystem, DocumentType)  
	
	//Евросиб Каблов 14.11.2024 ( #93051 перенес в модуль ЕСОбменСервер
	#Область Было
	//Если НЕ ЗначениеЗаполнено(RequestingSystem) Тогда
	//	Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	//КонецЕсли;    
	//
	//Если НЕ ЗначениеЗаполнено(DocumentType) Тогда
	//	Возврат "<xml><error>Пустое значение параметра DocumentType!</error></xml>";
	//КонецЕсли;
	//
	//УзелОбмена = Неопределено;
	//Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
	//	Если ЗначПеречисления.Представление() = RequestingSystem Тогда
	//		УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;  
	//
	//УзелПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	//Если УзелОбмена = Неопределено Тогда
	//	Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	//КонецЕсли; 
	//
	//Если Метаданные.НайтиПоПолномуИмени("Документ." + DocumentType) = Неопределено Тогда
	//	Возврат "<xml><error>Не найден документ по типу в параметре DocumentType!</error></xml>";
	//КонецЕсли;

	//Чтение 				= Новый ЧтениеXML;
	//Чтение.УстановитьСтроку(XMLParams);
	//Фабрика 			= Новый ФабрикаXDTO;
	//ОбъектXDTO			= Фабрика.ПрочитатьXML(Чтение);
	//
	//ВсеСвойстваОбъекта = ОбъектXDTO.Свойства();
	//Если ВсеСвойстваОбъекта.Получить("Шапка") = Неопределено Тогда
	//	Возврат "<xml><error>Нет списка ГУИДов к подтверждению!</error></xml>";
	//КонецЕсли;
	//
	//ВыгрузкаДанных 	= Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	//КСнятиюСРегистрации = Новый Массив; 
	//ТекстОшибки = "";
	//
	//Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
	//	Для Каждого Объект Из ОбъектXDTO.Шапка Цикл      
	//		Если DocumentType = "РелизСобственника" и УзелОбмена = Перечисления.УзлыОбмена.DX Тогда   
	//			Попытка
	//				ОбъектСсылка = Документы.РелизСобственника.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД));
	//			Исключение
	//			    Возврат "<xml><error>Не найден документ релиз собственника по ГУИДу " + Объект.ГУИД + "</error></xml>";
	//			КонецПопытки;
	//			
	//			Если не ЗначениеЗаполнено(ОбъектСсылка) Тогда
	//				Возврат "<xml><error>Не найден документ релиз собственника по ГУИДу " + Объект.ГУИД + "</error></xml>";		
	//			КонецЕсли;
	//			ВремяВыгрузки = РегистрыСведений.ПротоколОбменов.ДатаВыгрузкиОбъекта(УзелОбмена,ВыгрузкаДанных,ОбъектСсылка);
	//			ВремяПоследнегоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Изменено");
	//			Если ВремяВыгрузки > ВремяПоследнегоИзменения Тогда
	//				КСнятиюСРегистрации.Добавить(ОбъектСсылка);	
	//			КонецЕсли;
	//		КонецЕсли;
	//		ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(Объект.ГУИД, ВыгрузкаДанных, УзелОбмена); 
	//	КонецЦикла	
	//Иначе		
	//	Объект = ОбъектXDTO.Шапка;   
	//	Если DocumentType = "РелизСобственника" и УзелОбмена = Перечисления.УзлыОбмена.DX Тогда
	//		Попытка
	//			ОбъектСсылка = Документы.РелизСобственника.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД));
	//		Исключение
	//			Возврат "<xml><error>Не найден документ релиз собственника по ГУИДу " + Объект.ГУИД + "</error></xml>";
	//		КонецПопытки; 
	//		ВремяВыгрузки = РегистрыСведений.ПротоколОбменов.ДатаВыгрузкиОбъекта(УзелОбмена,ВыгрузкаДанных,ОбъектСсылка);
	//		ВремяПоследнегоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Изменено");
	//		Если ВремяВыгрузки < ВремяПоследнегоИзменения Тогда
	//			КСнятиюСРегистрации.Добавить(ОбъектСсылка);	
	//		КонецЕсли;
	//	КонецЕсли;
	//	ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(Объект.ГУИД, ВыгрузкаДанных, УзелОбмена);
	//КонецЕсли;    
	//
	//Если КСнятиюСРегистрации.Количество() > 0 и УзелПланаОбмена.Количество() > 0  Тогда
	//	ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, КСнятиюСРегистрации); 
	//КонецЕсли; 
	//
	//Возврат "Подтверждение загрузки завершено";
	#КонецОбласти
	
	Возврат ЕСОбменСервер.ПодтвердитьЗагрузкуДокументовВУзелОбмена(XMLParams, RequestingSystem, DocumentType)
	//Евросиб Каблов 14.11.2024 )
	
КонецФункции  

// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. 08.08.2024
Процедура ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(ГУИД, Действие, УзелОбмена) Экспорт

	СсылкаНаОбъект = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД, Действие, УзелОбмена);
	Если СсылкаНаОбъект <> Неопределено Тогда 
		Объект = СсылкаНаОбъект.Получитьобъект();
		
		НаборЗаписей = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДействиеПриОбмене.Установить(Действие);
		НаборЗаписей.Отбор.УзелОбмена.Установить(УзелОбмена);
		НаборЗаписей.Отбор.Объект.Установить(Объект.ссылка);
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			 Запись.ЗагрузкаПодтверждена = Истина; 
		 КонецЦикла;
		 НаборЗаписей.Записать();
	КонецЕсли;	

КонецПроцедуры

//Евросиб Коханенко Н.А. 19.08.2024 (( #90192 
Функция CreateMiddleMilesRequest(XMLParams)
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//Возврат ОбменДаннымиСредняяМиляСервер.ПолучитьДанныеПоСреднейМиле(XMLParams);
	Возврат ЕСОбменСервер.ПолучитьДанныеТранспортнойАналитики(XMLParams);
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
КонецФункции //Евросиб Коханенко Н.А. 19.08.2024 )) #90192

//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
Функция PutTransportationAnalytics(XMLParams)
	
	Возврат ЕСОбменСервер.ПолучитьДанныеТранспортнойАналитики(XMLParams);
	
КонецФункции
//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217

//Евросиб СубботинВ #90973 19.09.2024 Начало 
Функция GetCalculation(RequestingSystem, DateStart, DateEnd)

 Возврат ЕСОбменСервер.ВыгрузитьКалькуляции(RequestingSystem, DateStart, DateEnd);
 
КонецФункции
//Евросиб СубботинВ #90973 19.09.2024 Конец

//Евросиб Каблов 30.01.2025 #100571
Функция GetTariff(RequestingSystem, DateStart, DateEnd)
	
	Возврат ЕСОбменСервер.ПолучитьТарифы(RequestingSystem, DateStart, DateEnd);
	
КонецФункции

//Евросиб Каблов 03.02.2025 #100569
Функция GetMeasures(RequestingSystem, ChangesOnly)
	
	Возврат ЕСОбменСервер.ПолучитьЕдиницыИзмерения(RequestingSystem, ChangesOnly);
	
КонецФункции

//Евросиб Коханенко Н.А. 21.03.2025 (( #102956 
Функция GetTransportationAnalyticsKeys(RequestingSystem)

	Возврат ЕСОбменСервер.ВыгрузитьКлючиАналитикиПеревозки(RequestingSystem);

КонецФункции //Евросиб Коханенко Н.А. 21.03.2025 )) #102956

// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
Функция GetProtocols(XMLParams)
	
	Возврат ЕСОбменСервер.ВыгрузитьПротоколы(XMLParams);
	
КонецФункции

Функция PutContract(XMLParams)
	
	Возврат ЕСОбменСервер.ЗагрузитьДоговорыИзТЛ(XMLParams);
	
КонецФункции
// Евросиб Рыбьяков К.А. 16.04.2025 ))

//Евросиб СубботинВ #109731 26.05.2025 Начало 
Функция PutMail(XMLParams)
	
	ДанныеВходящихПисем = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	ОбработанныеИдентификаторы = РассылкаУведомленийПользователям.ПринятьДанныеВходящихПисем(ДанныеВходящихПисем);  
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбработанныеИдентификаторы);

КонецФункции 
//Евросиб СубботинВ #109731 26.05.2025 Конец

//Евросиб Коханенко Н.А. 16.07.2025 (( #114766
//получение Реестров Автоперевозчиков из ТЛ
Функция PutRoadCarrierList(XMLParams)
	
	Возврат ЕСобменСервер.ЗагрузитьРеестрыАвтоперевозчикаИзТЛ(XMLParams);

КонецФункции //Евросиб Коханенко Н.А. 16.07.2025 )) #114766 

//Евросиб СубботинВ #131884 02.03.2026 Начало
Функция GetSupplierTariff(DateStart) 
	
	Возврат ЕСОбменСервер.ПолучитьТарифы(Строка(Перечисления.УзлыОбмена.BI), DateStart, Неопределено);
КонецФункции

//Евросиб СубботинВ #131884 02.03.2026 Конец
