
Процедура ПоставитьСвязанныеОбъектыВОчередьИзменения(ИсточникИзменения) Экспорт
	Если ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.Пользователи") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСправочникПользователи(ИсточникИзменения);
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСправочникДоговорыКонтрагентов(ИсточникИзменения);
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументОбъект.Сделка") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуДокументСделка(ИсточникИзменения);
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("РегистрСведенийНаборЗаписей.ИнформацияОтТерминалов") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРегистрСведенийИнформацияОтТерминалов(ИсточникИзменения);
	//Евросиб Каблов 07.06.2023 ( 68187
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументОбъект.РасчетСНП") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСверхнормативы(ИсточникИзменения);
	//Евросиб Каблов 07.06.2023 )
	//Евросиб Коханенко Н.А. 15.02.2024 (( #80981 
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументОбъект.Калькуляция") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКалькуляция(ИсточникИзменения);
	//Евросиб Коханенко Н.А. 15.02.2024 )) #80981
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Начало: 17.04.2024
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("РегистрСведенийМенеджерЗаписи.стоки_ТекущиеДанные") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРегистрСведенийТекущиеДанныеКТК(ИсточникИзменения);
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Конец: 17.04.2024
	// Евросиб BUG 85420 TA 86264 Рыбьяков К.А. 09.07.2024 ((
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРеализацияТоваровУслуг(ИсточникИзменения);
	// Евросиб Рыбьяков К.А. 09.07.2024 )) 
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Начало: 13.11.2024
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.РейсыМоре") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуМорскиеРейсы(ИсточникИзменения);
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Конец: 13.11.2024	
	//Евросиб Каблов 10.06.2025 ( #111512
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.РейсыЖД") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуЖДРейсы(ИсточникИзменения);
	//Евросиб Каблов 10.06.2025 )	
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 15.04.2025 ((
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументОбъект.РасчетДополнительныеРасходы") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуДополнительныеРасходы(ИсточникИзменения);
	// Евросиб Рыбьяков К.А. 15.04.2025 ))
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 25.05.2025 ((
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.КлючиАналитикиНоминацийРелиза") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКлючАналитикиНоминации(ИсточникИзменения);
	// Евросиб Рыбьяков К.А. 25.05.2025 ))    
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("СправочникОбъект.КлючиАналитикиПеревозки") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКлючАналитикиПеревозки(ИсточникИзменения);
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументСсылка.НормативКонтрибуции") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуНормативКонтрибуции(ИсточникИзменения);
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	ИначеЕсли ТипЗнч(ИсточникИзменения) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуТранспортныйДокумент(ИсточникИзменения);
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	КонецЕсли;
КонецПроцедуры                                                       

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуТранспортныйДокумент(ТранспортныйДокумент) //Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦПоставщикаУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
		|ГДЕ
		|	НЕ ПСЦПоставщикаУслуги.Ссылка.ПометкаУдаления
		|	И ПСЦПоставщикаУслуги.Ссылка.ВидУслугПоставщика В(&ВидыУслугПоставщика)
		|	И ПСЦПоставщикаУслуги.Коносамент = &Коносамент";
	
	ВидыУслугПоставщика = Новый Массив;
	ВидыУслугПоставщика.Добавить(Справочники.ВидыУслугПоставщиков.Фрахт);
	ВидыУслугПоставщика.Добавить(Справочники.ВидыУслугПоставщиков.ТЭО);
	
	Запрос.УстановитьПараметр("ВидыУслугПоставщика", ВидыУслугПоставщика);
	Запрос.УстановитьПараметр("Коносамент", ТранспортныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоставитьОбъектВОчередьИзменения(ВыборкаДетальныеЗаписи.Ссылка, ТранспортныйДокумент);
	КонецЦикла;
				
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуНормативКонтрибуции(НормативКонтрибуции) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	ВыборкаПодчиненныхДокументов=КонтрольДоступностиДокументов_сервер.ПолучитьВыборкуПодчиненныхДокументов(НормативКонтрибуции);
	Если ВыборкаПодчиненныхДокументов <> Неопределено Тогда
		Пока ВыборкаПодчиненныхДокументов.Следующий() Цикл
			Если ТипЗнч(ВыборкаПодчиненныхДокументов.Ссылка) = Тип("ДокументСсылка.Калькуляция") Тогда
				ПоставитьОбъектВОчередьИзменения(ВыборкаПодчиненныхДокументов.Ссылка, НормативКонтрибуции);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПоставитьОбъектВОчередьИзменения(ОбрабатываемыйОбъект, ИсточникИзменения) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбрабатываемыйОбъект)
		ИЛИ Не ЗначениеЗаполнено(ИсточникИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
	мз.ИсточникИзменения = ИсточникИзменения;
	мз.ОбрабатываемыйОбъект = ОбрабатываемыйОбъект;
	мз.ДатаЗаписи = ТекущаяДата();
	мз.Пользователь = Пользователи.ТекущийПользователь();
	мз.Записать();
	
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРеализацияТоваровУслуг(РеализацияОбъект)
	
	// Евросиб BUG 85420 TA 86264 Рыбьяков К.А. 09.07.2024 ((
	//Евросиб Каблов 22.05.2025 ( #110248
	//ПрошлаяДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеализацияОбъект.Ссылка, "ДатаДокумента");
	//Если ЗначениеЗаполнено(РеализацияОбъект.Ссылка) И РеализацияОбъект.ДатаДокумента <> ПрошлаяДатаДокумента Тогда
	ПрошлыеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеализацияОбъект.Ссылка, "ДатаДокумента,ПериодВО");
	Если ЗначениеЗаполнено(РеализацияОбъект.Ссылка) И (РеализацияОбъект.ДатаДокумента <> ПрошлыеЗначенияРеквизитов.ДатаДокумента 
		 											Или РеализацияОбъект.ПериодВО <> ПрошлыеЗначенияРеквизитов.ПериодВО) Тогда
	//Евросиб Каблов 22.05.2025 )
		Запрос = Новый Запрос;
		//Евросиб Каблов 28.11.2025 ( #111016
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Сделка КАК Сделка
		//|ИЗ
		//|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		//|ГДЕ
		//|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = &Ссылка 
		//|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугУслуги.Сделка КАК Сделка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
		//Евросиб Каблов 28.11.2025 ) #111016
		
		Запрос.УстановитьПараметр("Ссылка", РеализацияОбъект.Ссылка);
			
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПоставитьОбъектВОчередьИзменения(Выборка.Сделка, РеализацияОбъект.Ссылка);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 09.07.2024 ))
	
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСправочникПользователи(ПользовательОбъект)
	
	//уволенный сотрудник ответственный за договоры
	//найдем все договоры, в которых источник является ответственным за договор и он недействителен
	//и все сделки где ответственный не выполнил свою задачу по выставлению документов
	Если ПользовательОбъект.Недействителен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
		|ГДЕ
		|	ДоговорыКонтрагентовОтветственные.ТипОтветственного = &ТипОтветственного
		|	И ДоговорыКонтрагентовОтветственные.Ответственный = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Состояния КАК СделкаСостояния
		|		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСостояния.Ссылка
		|			И СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению = СделкаСостояния.Состояние
		|			И (СделкаСостояния.Статус = &Статус)
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.ОтветственныйЗаУчет = &Ответственный
		|	И СделкаСостояния.Статус ЕСТЬ NULL
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ 
		|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|       	ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
		|				И СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|       	ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
		|           	И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Состояния КАК СделкаСостояния
		|		ПО СделкаДоходы.Ссылка = СделкаСостояния.Ссылка
		|			И СделкаДоходы.ЗадачаГотовностиКВыставлению = СделкаСостояния.Состояние
		|           И СделкаСостояния.Исполнитель = &Ответственный
		|           И СделкаСостояния.Состояние В ИЕРАРХИИ (&ТипыЗадач)
		|			И (СделкаСостояния.Статус <> &Статус)";
		МассивТиповЗадач = Новый Массив;
		МассивТиповЗадач.Добавить(Справочники.Состояния.ЗадачиСозданияКомплектаДокументов);
		МассивТиповЗадач.Добавить(Справочники.Состояния.ЗадачиТребуетсяПеревыставитьРасходы);
		Запрос.УстановитьПараметр("ТипыЗадач", МассивТиповЗадач);
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		Запрос.УстановитьПараметр("Ответственный", ПользовательОбъект.Ссылка);
		Запрос.УстановитьПараметр("ТипОтветственного", Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтапов.Выполнен);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		ВыборкаДоговоров = РезультатыЗапроса[0].Выбрать();
		Пока ВыборкаДоговоров.Следующий() Цикл
			ПоставитьОбъектВОчередьИзменения(ВыборкаДоговоров.Ссылка, ПользовательОбъект.Ссылка);		
		КонецЦикла;                           
		ВыборкаСделок = РезультатыЗапроса[1].Выбрать();
		Пока ВыборкаСделок.Следующий() Цикл
			ПоставитьОбъектВОчередьИзменения(ВыборкаСделок.Ссылка, ПользовательОбъект.Ссылка);		
		КонецЦикла;                           
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСправочникДоговорыКонтрагентов(ДоговорКонтрагентаОбъект)
	//сделки по ответственным за учет
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ТЧСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	ТЧСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	ТЧСвязьУчетныхЕдиниц.Ссылка.ЦФО КАК ЦФОСделки,
	|	ТЧСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	ТЧСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	|	ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК ТЧСвязьУчетныхЕдиниц
	|ГДЕ
	|	ТЧСвязьУчетныхЕдиниц.Договор = &Договор
	|   И НЕ ТЧСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК ДоговорОтветственныйЗаУчет,
	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК ДоговорОтветственныйЗаУчетНСК
	|ПОМЕСТИТЬ ВТ_Ответственные
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	|ГДЕ
	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	|			ИЗ
	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовОтветственные.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
	|	ДоговорыКонтрагентовОтветственные.Ответственный
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	|ГДЕ
	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	|			ИЗ
	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск)
	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ответственные.Договор КАК Договор,
	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчет) КАК ДоговорОтветственныйЗаУчет,
	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчетНСК) КАК ДоговорОтветственныйЗаУчетНСК
	|ПОМЕСТИТЬ ВТ_ОтветственныеПолноеСоединение
	|ИЗ
	|	ВТ_Ответственные КАК ВТ_Ответственные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Ответственные.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчет КАК ДоговорОтветственныйЗаУчет,
	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчетНСК КАК ДоговорОтветственныйЗаУчетНСК,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТСвязьУчетныхЕдиниц.Заявка.ЦФО, ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	|			ТОГДА ВТСвязьУчетныхЕдиниц.Заявка.ЦФО
	|		ИНАЧЕ ВТСвязьУчетныхЕдиниц.ЦФОСделки
	|	КОНЕЦ КАК ЦФОдляОпределенияОтветственного,
	|	ВТСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ВТСвязьУчетныхЕдиниц.Сделка КАК Сделка,
	|	ВТСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	|ПОМЕСТИТЬ ВТОтветственныеИЦФО
	|ИЗ
	|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеПолноеСоединение КАК ВТ_ОтветственныеПолноеСоединение
	|		ПО ВТСвязьУчетныхЕдиниц.Договор = ВТ_ОтветственныеПолноеСоединение.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтветственныеИЦФО.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	|				ИЛИ ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	|			ТОГДА ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчет
	|		ИНАЧЕ ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчетНСК
	|	КОНЕЦ КАК ОтветственныйЗаУчетПоДоговору,
	|	ВТОтветственныеИЦФО.Сделка КАК Сделка,
	|	ВТОтветственныеИЦФО.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	|	ВТОтветственныеИЦФО.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	|ПОМЕСТИТЬ ВТОтветственныеИГУИДСтрок
	|ИЗ
	|	ВТОтветственныеИЦФО КАК ВТОтветственныеИЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтветственныеИГУИДСтрок.Сделка КАК Сделка,
	|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетПоДоговору КАК ОтветственныйЗаУчетПоДоговору,
	|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	|ИЗ
	|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Состояния КАК СделкаСостояния
	|		ПО ВТОтветственныеИГУИДСтрок.Сделка = СделкаСостояния.Ссылка
	|			И ВТОтветственныеИГУИДСтрок.ЗадачаГотовностиКВыставлению = СделкаСостояния.Состояние
	|			И (СделкаСостояния.Статус = &Статус)
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетПоДоговору.Недействителен, ИСТИНА)
	|	И СделкаСостояния.Состояние ЕСТЬ NULL
	|	И ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетПоДоговору <> ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет";
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагентаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтапов.Выполнен);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоставитьОбъектВОчередьИзменения(Выборка.Сделка, ДоговорКонтрагентаОбъект.Ссылка);
	КонецЦикла;
		
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуДокументСделка(СделкаОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(СделкаОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	//Источник: Сделка
	//1. При записи сделки определять добавленные и удаленные учетные документы доходов и по ним определять строки расходов + отключенные строки расходов, которые необходимо обработать.
	//По тем строчкам расходов, которые необходимо обработать, ищем актуальные акцепты по гуиду расходов и сделке и эти данные записываем в регистр:
	//измерения: 
	//документ обработки = актуальный акцепт
	//источник изменения = сделка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаДоходы.ГУИД КАК ГУИД
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	,СделкаДоходы.КорректировкаДокумента КАК КорректировкаДокумента
	|	,СделкаДоходы.Перевыставляемая КАК Перевыставляемая
	|	,СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|ПОМЕСТИТЬ ВТ_ДоходыПоСсылке
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаДоходы.ГУИД КАК ГУИД
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	,СделкаДоходы.КорректировкаДокумента КАК КорректировкаДокумента
	|	,СделкаДоходы.Перевыставляемая КАК Перевыставляемая
	|	,СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|ПОМЕСТИТЬ ВТ_ДоходыПоОбъекту
	|ИЗ
	|	&СделкаДоходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоходыПоСсылке.УчДокумент КАК УчДокумент,
	|	ВТ_ДоходыПоСсылке.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_ДоходыДляОбработки
	|ИЗ
	|	ВТ_ДоходыПоСсылке КАК ВТ_ДоходыПоСсылке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыПоОбъекту КАК ВТ_ДоходыПоОбъекту
	|		ПО ВТ_ДоходыПоСсылке.ГУИД = ВТ_ДоходыПоОбъекту.ГУИД
	|ГДЕ
	//Евросиб - АСуслов 07.11.2023 13:00:32 #77056
	//(
	|	НЕ ЕСТЬNULL(ВТ_ДоходыПоОбъекту.УчДокумент, НЕОПРЕДЕЛЕНО) = ВТ_ДоходыПоСсылке.УчДокумент
	//)
	//Евросиб - АСуслов 07.11.2023 13:00:38 #77056
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	ИЛИ (ЕСТЬNULL(ВТ_ДоходыПоОбъекту.КорректировкаДокумента, НЕОПРЕДЕЛЕНО) <> ВТ_ДоходыПоСсылке.КорректировкаДокумента 
	|				И ВТ_ДоходыПоОбъекту.Перевыставляемая И ВТ_ДоходыПоОбъекту.ГУИДИсправляемойСтроки <> """")
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДоходыПоОбъекту.УчДокумент,
	|	ВТ_ДоходыПоОбъекту.ГУИД
	|ИЗ
	|	ВТ_ДоходыПоОбъекту КАК ВТ_ДоходыПоОбъекту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыПоСсылке КАК ВТ_ДоходыПоСсылке
	|		ПО (ВТ_ДоходыПоСсылке.ГУИД = ВТ_ДоходыПоОбъекту.ГУИД)
	|ГДЕ
   //Евросиб - АСуслов 07.11.2023 13:00:48 #77056
   //(
	|	НЕ ЕСТЬNULL(ВТ_ДоходыПоСсылке.УчДокумент, НЕОПРЕДЕЛЕНО) = ВТ_ДоходыПоОбъекту.УчДокумент
   //)
   //Евросиб - АСуслов 07.11.2023 13:00:49 #77056
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	ИЛИ (НЕ ЕСТЬNULL(ВТ_ДоходыПоОбъекту.КорректировкаДокумента, НЕОПРЕДЕЛЕНО) <> ВТ_ДоходыПоСсылке.КорректировкаДокумента 
	|				И ВТ_ДоходыПоОбъекту.Перевыставляемая И ВТ_ДоходыПоОбъекту.ГУИДИсправляемойСтроки <> """")
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫРАЗИТЬ(&Ссылка КАК Документ.Сделка) КАК Сделка,
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена,
	//Евросиб - АСуслов 08.11.2023 9:40:09 #77056
	//(
	|	СделкаРасходы.ПричинаОтключенияСтроки КАК ПричинаОтключенияСтроки,
	//)
	//Евросиб - АСуслов 08.11.2023 9:40:13 #77056
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&СделкаРасходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&СделкаСвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходовПоСсылке
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.ГУИД КАК ГУИД,
	//|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена
	//|ПОМЕСТИТЬ ВТ_РасходыКОтключеннымПроизвольнымСтрокамДоходов
	//|ИЗ
	//|	ВТ_Расходы КАК СделкаРасходы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоходыПоОбъекту КАК ВТ_доходы
	//|			ПО ВТ_СвязьДоходовИРасходов.Доходы = ВТ_доходы.ГУИД
	//|				И (ВТ_доходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную))
	//|				И (ВТ_доходы.НеВыставлятьКлиенту)
	//|		ПО СделкаРасходы.ГУИД = ВТ_СвязьДоходовИРасходов.Расходы
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб - АСуслов 07.11.2023 13:01:46 #77056
	//(
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходовИРасходов.Доходы КАК Доходы,
	|	ВТ_СвязьДоходовИРасходов.Расходы КАК Расходы
	|ПОМЕСТИТЬ ВТ_ИзмененныеСвязиДоходовИРасходов
	|ИЗ
	|	ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходовПоСсылке КАК ВТ_СвязьДоходовИРасходовПоСсылке
	|		ПО ВТ_СвязьДоходовИРасходов.Доходы = ВТ_СвязьДоходовИРасходовПоСсылке.Доходы
	|			И ВТ_СвязьДоходовИРасходов.Расходы = ВТ_СвязьДоходовИРасходовПоСсылке.Расходы
	|			
	|ГДЕ
	|	ВТ_СвязьДоходовИРасходовПоСсылке.Доходы ЕСТЬ NULL
	|	И (ВТ_СвязьДоходовИРасходов.Доходы <> """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходовИРасходов.Доходы,
	|	ВТ_СвязьДоходовИРасходов.Расходы
	|ИЗ
	|	ВТ_СвязьДоходовИРасходовПоСсылке КАК ВТ_СвязьДоходовИРасходовПоСсылке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО (ВТ_СвязьДоходовИРасходов.Доходы = ВТ_СвязьДоходовИРасходовПоСсылке.Доходы)
	|			И (ВТ_СвязьДоходовИРасходов.Расходы = ВТ_СвязьДоходовИРасходовПоСсылке.Расходы)
	|			
	|ГДЕ
	|	ВТ_СвязьДоходовИРасходов.Доходы ЕСТЬ NULL
	|	И (ВТ_СвязьДоходовИРасходовПоСсылке.Доходы <> """")	
	|;
	//)
	//Евросиб - АСуслов 07.11.2023 13:01:48 #77056
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцептУслуги.Ссылка КАК Акцепт,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.Сумма КАК Сумма,
	|	АкцептУслуги.СуммаНДС КАК СуммаНДС,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.Ссылка.Поступление КАК Поступление,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента КАК ПоступлениеВалютаДокумента,
	|	АкцептУслуги.Ссылка.Поступление.КурсВзаиморасчетов КАК ПоступлениеКурсВзаиморасчетов,
	|	АкцептУслуги.Ссылка.Поступление.КратностьВзаиморасчетов КАК ПоступлениеКратностьВзаиморасчетов,
	|	АкцептУслуги.Ссылка.Поступление.НДСВключенВСтоимость КАК ПоступлениеНДСВключенВСтоимость,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//Евросиб СубботинВ #91883 19.09.2024 Начало // в момент формирования записей в рег, в акцепте еще нет причины отключения, появлется после очереди.
	//|	АкцептУслуги.ПричинаОтключенияСтрокиВСделке КАК ПричинаОтключенияСтрокиВСделке
	|	СделкаРасходы.ПричинаОтключенияСтроки КАК ПричинаОтключенияСтрокиВСделке
	//Евросиб СубботинВ #91883 19.09.2024 Конец 
	|ПОМЕСТИТЬ ВТ_СтрокиДляОтвязки
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	//Евросиб - АСуслов 12.10.2023 13:28:04 #
	//(
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
	//|			ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
	//|		ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	//|			И (СделкаРасходы.УслугаОтключена)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|				ПО (АктуальныеПривязкиАкцептовВСделки.Акцепт = АкцептУслуги.Ссылка)
	|					И (АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиАкцепта = АкцептУслуги.ГУИД)
	|			ПО СделкаРасходы.Сделка = АктуальныеПривязкиАкцептовВСделки.Сделка
	|				И СделкаРасходы.ГУИД = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке
	|				И (СделкаРасходы.УслугаОтключена)
	//Евросиб - АСуслов 07.11.2023 15:53:43 #77056
	//(
	|  				И НЕ СделкаРасходы.ПричинаОтключенияСтроки = Значение(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки)
	//)
	//Евросиб - АСуслов 07.11.2023 15:53:45 #77056
	//)
	//Евросиб - АСуслов 12.10.2023 13:28:05 #
	//Евросиб - АСуслов 07.11.2023 15:42:21 #77056
	//(
	//два одинаковых запроса зачем-то...
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АкцептУслуги.Ссылка,
	//|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
	//|	АкцептУслуги.Номенклатура,
	//|	АкцептУслуги.Сумма,
	//|	АкцептУслуги.СуммаНДС,
	//|	АкцептУслуги.Сделка,
	//|	АкцептУслуги.ГУИД,
	//|	АкцептУслуги.Ссылка.Поступление,
	//|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента,
	//|	АкцептУслуги.Ссылка.Поступление.КурсВзаиморасчетов,
	//|	АкцептУслуги.Ссылка.Поступление.КратностьВзаиморасчетов,
	//|	АкцептУслуги.Ссылка.Поступление.НДСВключенВСтоимость,
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц,
	//|	АкцептУслуги.ПричинаОтключенияСтрокиВСделке
	//|ИЗ
	//|	ВТ_Расходы КАК СделкаРасходы
	////Евросиб - АСуслов 12.10.2023 13:28:04 #
	////(
	////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	////|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
	////|			ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
	////|		ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	////|			И (СделкаРасходы.УслугаОтключена)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	//|				ПО (АктуальныеПривязкиАкцептовВСделки.Акцепт = АкцептУслуги.Ссылка)
	//|					И (АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиАкцепта = АкцептУслуги.ГУИД)
	//|			ПО СделкаРасходы.Сделка = АктуальныеПривязкиАкцептовВСделки.Сделка
	//|				И СделкаРасходы.ГУИД = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке
	//|				И (СделкаРасходы.УслугаОтключена)
	//)
	//Евросиб - АСуслов 12.10.2023 13:28:05 #
	//)
	//Евросиб - АСуслов 07.11.2023 15:42:23 #77056
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиДляОтвязки.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
	|ИЗ
	|	ВТ_СтрокиДляОтвязки КАК ВТ_СтрокиДляОтвязки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктуальныеПривязкиАкцептовВСделки.Поступление КАК Поступление,1
	|ИЗ
	|	ВТ_ДоходыДляОбработки КАК ВТ_ДоходыДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|				ПО ВТ_Расходы.Сделка = АктуальныеПривязкиАкцептовВСделки.Сделка
	|					И ВТ_Расходы.ГУИД = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке
	|			ПО ВТ_СвязьДоходовИРасходов.Расходы = ВТ_Расходы.ГУИД
	|		ПО ВТ_ДоходыДляОбработки.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СтрокиДляОтвязки.Акцепт.Поступление,2
	|ИЗ
	|	ВТ_СтрокиДляОтвязки КАК ВТ_СтрокиДляОтвязки
	|            
	//Евросиб - АСуслов 07.11.2023 13:04:02 #77056
	//(
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктуальныеПривязкиАкцептовВСделки.Поступление,3
	|ИЗ
	|	ВТ_ИзмененныеСвязиДоходовИРасходов КАК ИзмененныеСвязиДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|				ПО (ВТ_Расходы.Сделка = АктуальныеПривязкиАкцептовВСделки.Сделка)
	|					И (ВТ_Расходы.ГУИД = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке)
	|			ПО (ИзмененныеСвязиДоходовИРасходов.Расходы = ВТ_Расходы.ГУИД)
	//)
	//Евросиб - АСуслов 07.11.2023 13:04:04 #77056
	//Евросиб - АСуслов 21.03.2024 17:23:12 #82669
	//(
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
	|	АктуальныеПривязкиАкцептовВСделки.Поступление,
	|	4
	|ИЗ
	|	ВТ_ДоходыПоОбъекту КАК ВТ_ДоходыПоОбъекту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|			ПО ВТ_СвязьДоходовИРасходов.Расходы = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке
	|		ПО ВТ_ДоходыПоОбъекту.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	|			И (ВТ_ДоходыПоОбъекту.НеВыставлятьКлиенту)
	//)
	//Евросиб - АСуслов 21.03.2024 17:23:15 #82669
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиДляОтвязки.Акцепт КАК Акцепт,
	|	ВТ_СтрокиДляОтвязки.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	ВТ_СтрокиДляОтвязки.Номенклатура КАК Номенклатура,
	|	ВТ_СтрокиДляОтвязки.Сумма КАК Сумма,
	|	ВТ_СтрокиДляОтвязки.СуммаНДС КАК СуммаНДС,
	|	ВТ_СтрокиДляОтвязки.Сделка КАК Сделка,
	|	ВТ_СтрокиДляОтвязки.ГУИД КАК ГУИД,
	|	ВТ_СтрокиДляОтвязки.Поступление КАК Поступление,
	|	ВТ_СтрокиДляОтвязки.ПоступлениеВалютаДокумента КАК ПоступлениеВалютаДокумента,
	|	ВТ_СтрокиДляОтвязки.ПоступлениеКурсВзаиморасчетов КАК ПоступлениеКурсВзаиморасчетов,
	|	ВТ_СтрокиДляОтвязки.ПоступлениеКратностьВзаиморасчетов КАК ПоступлениеКратностьВзаиморасчетов,
	|	ВТ_СтрокиДляОтвязки.ПоступлениеНДСВключенВСтоимость КАК ПоступлениеНДСВключенВСтоимость,
	|	ВТ_СтрокиДляОтвязки.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_СтрокиДляОтвязки.ПричинаОтключенияСтрокиВСделке КАК ПричинаОтключенияСтрокиВСделке
	|ИЗ
	|	ВТ_СтрокиДляОтвязки КАК ВТ_СтрокиДляОтвязки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОтвязыванияПоступлений КАК ИсторияОтвязыванияПоступлений
	|		ПО ВТ_СтрокиДляОтвязки.ИдентификаторСтрокиРасходовВСделке = ИсторияОтвязыванияПоступлений.ИдентификаторСтрокиРасходов
	|			И (ИсторияОтвязыванияПоступлений.ДатаПривязки = ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	ИсторияОтвязыванияПоступлений.ИдентификаторСтрокиАкцепта ЕСТЬ NULL";
	//)
	//Евросиб - АСуслов 28.02.2023 12:18:24 #66368
	Запрос.УстановитьПараметр("Ссылка", СделкаОбъект.Ссылка);
	Запрос.УстановитьПараметр("СделкаДоходы", СделкаОбъект.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("СделкаРасходы", СделкаОбъект.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СделкаСвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить());
	МассивРезультатов = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = МассивРезультатов.Количество();
	ВыборкаДокументовДляОчереди = МассивРезультатов[КоличествоРезультатов-2].Выбрать();
	Пока ВыборкаДокументовДляОчереди.Следующий() Цикл
		//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
		//мз.ИсточникИзменения = СделкаОбъект.Ссылка;
		//мз.ОбрабатываемыйОбъект = ВыборкаДокументовДляОчереди.Поступление;
		//мз.ДатаЗаписи = ТекущаяДата();
		//мз.Пользователь = Пользователи.ТекущийПользователь();
		//мз.Записать();
		ПоставитьОбъектВОчередьИзменения(ВыборкаДокументовДляОчереди.Поступление, СделкаОбъект.Ссылка);
	КонецЦикла;
	ВыборкаСтрокДляИсторииОтвязки = МассивРезультатов[КоличествоРезультатов-1].Выбрать();
	Пока ВыборкаСтрокДляИсторииОтвязки.Следующий() Цикл
		Документы.Акцепт.ЗаписатьИсториюОтвязкиАкцептаОтСделки(ВыборкаСтрокДляИсторииОтвязки, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
	КонецЦикла; 
	ВыборкаДляОтвязки = МассивРезультатов[КоличествоРезультатов - 3].Выбрать();
	Пока ВыборкаДляОтвязки.Следующий() Цикл
		СтрокаРасход = СделкаОбъект.Расходы.Найти(ВыборкаДляОтвязки.ИдентификаторСтрокиРасходовВСделке, "ГУИД");
		Если СтрокаРасход <> Неопределено Тогда
			СтрокаРасход.УчДокумент = Неопределено;
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаРасход Из СделкаОбъект.Расходы.НайтиСтроки(Новый Структура("УслугаОтключена", Истина)) Цикл
		СтрокаРасход.УчДокумент = Неопределено;
	КонецЦикла;
	
	//Евросиб Каблов 17.05.2023 ( 67617
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СделкаСсылка", СделкаОбъект.Ссылка);
	//Евросиб - АСуслов 02.02.2026 16:38:03 #
	//( 
	//исключим пустые заявки
	//МассивЗаявок = СделкаОбъект.СвязьУчетныхЕдиниц.ВыгрузитьКолонку("Заявка");	
	МассивЗаявок = Новый Массив;
	Для каждого СтрокаСП Из СделкаОбъект.СвязьУчетныхЕдиниц Цикл
		Если ЗначениеЗаполнено(СтрокаСП.Заявка) Тогда
			МассивЗаявок.Добавить(СтрокаСП.Заявка);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("Заявки", МассивЗаявок);
	//)
	//Евросиб - АСуслов 02.02.2026 16:38:09 #
	
	//МальцевАН #77303 20.05.2024
	//(
	Запрос.УстановитьПараметр("Организация", СделкаОбъект.Организация);
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкиСделки.Заявка КАК Заявка,
	//|	&Ссылка КАК Сделка
	//|ПОМЕСТИТЬ ВТ_ЗаявкиСделки
	//|ИЗ
	//|	&ЗаявкиСделки КАК ЗаявкиСделки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СчетНаОплатуПокупателю.Ссылка КАК Счет
	//|ИЗ
	//|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателю
	//|ГДЕ
	////|	НЕ СчетНаОплатуПокупателю.Ссылка.ПометкаУдаления
	////|	И СчетНаОплатуПокупателю.Ссылка.АвансовыйСчет
	////ДИТ, Беляев СЮ, Ticket#0335619, 19-12-2023, начало
	//|	СчетНаОплатуПокупателю.Ссылка.Проведен
	////ДИТ, Беляев СЮ, Ticket#0335619, 19-12-2023, конец
	//|	И (СчетНаОплатуПокупателю.Документ, СчетНаОплатуПокупателю.Сделка) В
	//|			(ВЫБРАТЬ
	//|				т.Заявка,
	//|				т.Сделка
	//|			ИЗ
	//|				ВТ_ЗаявкиСделки КАК т)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Ссылка,
	//|	НомерСтроки";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_Привязки
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Документ В(&Заявки)
	//|	И СчетНаОплатуПокупателю.Сделка = &СделкаСсылка
	//Евросиб Каблов 12.12.2025 ( Ticket#0426815	
	//|	И СчетНаОплатуПокупателюДокументыОснования.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
	//Евросиб Каблов 12.12.2025 ) Ticket#0426815
	|	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетНаОплату,
	|	СчетНаОплатуПокупателюДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Заявка,
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_СчетаПоСделке
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(, Организация = &Организация) КАК СчетаПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|		ПО СчетаПокупателейОстатки.СчетПокупателю = СчетНаОплатуПокупателюДокументыОснования.Ссылка
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка = &СделкаСсылка
	|	И СчетаПокупателейОстатки.СуммаОстаток <> 0
	|	И СчетНаОплатуПокупателюДокументыОснования.Документ ССЫЛКА Документ.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_счетапосделке.СчетНаОплату КАК СчетНаОплату,
	|	вт_счетапосделке.НомерСтроки КАК НомерСтроки,
	|	вт_счетапосделке.Заявка КАК Заявка,
	|	вт_счетапосделке.Сделка КАК Сделка,
	|	вт_счетапосделке.СчетНаОплату.Номер КАК НомерСчета,
	|	вт_счетапосделке.СчетНаОплату.Дата КАК ДатаСчета
	|ПОМЕСТИТЬ ВТ_Отвязки
	|ИЗ
	|	ВТ_СчетаПоСделке КАК вт_счетапосделке
	|ГДЕ
	|	НЕ (вт_счетапосделке.Заявка В (&Заявки)
	|			И вт_счетапосделке.Сделка = &СделкаСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Привязки.Счет КАК Счет
	|ИЗ
	|	ВТ_Привязки КАК ВТ_Привязки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Отвязки.СчетНаОплату
	|ИЗ
	|	ВТ_Отвязки КАК ВТ_Отвязки";
	//)
	//МальцевАН #77303 20.05.2024
	Выборка = Запрос.Выполнить().Выбрать();      
	Пока Выборка.СледующийПоЗначениюПоля("Счет") Цикл
		ПоставитьОбъектВОчередьИзменения(Выборка.Счет, СделкаОбъект.Ссылка);
	КонецЦикла;
	//Евросиб Каблов 02.05.2023 )
	
	// Евросиб BUG 54913 TA 88057 Рыбьяков К.А. 08.07.2024 ((
	Служебная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СделкаОбъект.Ссылка, "Служебная");
	Если СделкаОбъект.Служебная <> Служебная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АктуальныеПривязкиАкцептовВСделки.Поступление КАК Поступление,
		|	АктуальныеПривязкиАкцептовВСделки.Сделка КАК Сделка
		|ИЗ
		|	РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
		|ГДЕ
		|	АктуальныеПривязкиАкцептовВСделки.Сделка = &Сделка";

		Запрос.УстановитьПараметр("Сделка", СделкаОбъект.Ссылка);
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПоставитьОбъектВОчередьИзменения(Выборка.Поступление, Выборка.Сделка);
		КонецЦикла;
		
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 08.07.2024 ))
	
//Евросиб СубботинВ #116769 08.09.2025 Начало / убрал
//	
//	// Евросиб Ситников К.А. 23.07.2025 Task 114431
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СделкаДоходы.УчДокумент КАК УчДокумент,
//	|	СделкаДоходы.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ ВТ_ДоходыТекущие
//	|ИЗ
//	|	Документ.Сделка.Доходы КАК СделкаДоходы
//	|ГДЕ
//	|	СделкаДоходы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаДоходы.УчДокумент КАК УчДокумент,
//	|	СделкаДоходы.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ ВТ_ДоходыПоВыгрузке
//	|ИЗ
//	|	&СделкаДоходы КАК СделкаДоходы
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СделкаСвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД,
//	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы
//	|ПОМЕСТИТЬ ВТ_СчетаТекущие
//	|ИЗ
//	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
//	|		ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда.Наименование
//	|ГДЕ
//	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
//	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДРейс.Ссылка ЕСТЬ NULL
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_ДоходыТекущие.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ ВТ_ИзмененныеДоходы
//	|ИЗ
//	|	ВТ_ДоходыТекущие КАК ВТ_ДоходыТекущие
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыПоВыгрузке КАК ВТ_ДоходыПоВыгрузке
//	|		ПО ВТ_ДоходыТекущие.ГУИД = ВТ_ДоходыПоВыгрузке.ГУИД
//	|ГДЕ
//	|	НЕ ВТ_ДоходыПоВыгрузке.УчДокумент ЕСТЬ NULL
//	|	И ВТ_ДоходыТекущие.УчДокумент ЕСТЬ NULL
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_СчетаТекущие.СчетЖД КАК СчетЖД
//	|ИЗ
//	|	ВТ_СчетаТекущие КАК ВТ_СчетаТекущие
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзмененныеДоходы КАК ВТ_ИзмененныеДоходы
//	|		ПО (ВТ_СчетаТекущие.Доходы = ВТ_ИзмененныеДоходы.ГУИД)";
//		
//	Запрос.УстановитьПараметр("Ссылка", СделкаОбъект.Ссылка);
//	Запрос.УстановитьПараметр("СделкаДоходы", СделкаОбъект.Доходы.Выгрузить());	
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		ПоставитьОбъектВОчередьИзменения(Выборка.СчетЖД, СделкаОбъект.Ссылка);
//	КонецЦикла;
//	// Евросиб Ситников К.А. 23.07.2025 Task 114431
	//Евросиб СубботинВ #116769 08.09.2025 Конец 

	
КонецПроцедуры

Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРегистрСведенийИнформацияОтТерминалов(ИнформацияОтТерминаловНаборЗаписей)
	
	//получим все релизы для заполнения контейнерами
	Если НЕ ИнформацияОтТерминаловНаборЗаписей.Отбор.Контейнер.Значение = Справочники.ТЕ.ПустаяСсылка() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизКлиента.Ссылка КАК РелизКлиента
		|ИЗ
		|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента КАК РелизКлиента
		|		ПО ИнформацияОтТерминалов.НомерРелиза = РелизКлиента.НомерРелиза
		|			И (ИнформацияОтТерминалов.Период = &Период)
		|			И (ИнформацияОтТерминалов.Контейнер = &Контейнер)
		|			И (ИнформацияОтТерминалов.НомерКонтейнера = &НомерКонтейнера)
		//|			И (ИнформацияОтТерминалов.КодТерминала = &КодТерминала) //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
		|			И (НЕ ИнформацияОтТерминалов.НомерРелиза = """")";
		Запрос.УстановитьПараметр("Период", ИнформацияОтТерминаловНаборЗаписей.Отбор.Период.Значение);
		Запрос.УстановитьПараметр("Контейнер", ИнформацияОтТерминаловНаборЗаписей.Отбор.Контейнер.Значение);
		Запрос.УстановитьПараметр("НомерКонтейнера", ИнформацияОтТерминаловНаборЗаписей.Отбор.НомерКонтейнера.Значение);
		//Запрос.УстановитьПараметр("КодТерминала", ИнформацияОтТерминаловНаборЗаписей.Отбор.КодТерминала.Значение); //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
		РезультатЗапроса = Запрос.Выполнить(); 
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПоставитьОбъектВОчередьИзменения(Выборка.РелизКлиента, Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийИнформацияОтТерминалов);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

//Евросиб Каблов 07.06.2023 68187
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуСверхнормативы(РасчетСНП)
	
	ПоставитьОбъектВОчередьИзменения(РасчетСНП.Сделка, РасчетСНП.Ссылка);
	
КонецПроцедуры

// Евросиб US 91362 TA 104075 Рыбьяков К.А. 15.04.2025 ((
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуДополнительныеРасходы(РасчетДопРасходы)
	
	ПоставитьОбъектВОчередьИзменения(РасчетДопРасходы.Сделка, РасчетДопРасходы.Ссылка);
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 15.04.2025 ))

// Евросиб US 88683 TA 108959 Рыбьяков К.А. 25.05.2025 ((
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКлючАналитикиНоминации(КлючАналитики)
	
	ПоставитьОбъектВОчередьИзменения(КлючАналитики.Сделка, КлючАналитики.Ссылка);
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 26.05.2025
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКлючАналитикиПеревозки(КлючАналитикиПеревозки)
	
	ДопСвойстваКлюча = КлючАналитикиПеревозки.ДополнительныеСвойства;
	Если ДопСвойстваКлюча.Свойство("ИсточникЗаписи") 
		и ТипЗнч(ДопСвойстваКлюча.ИсточникЗаписи) = Тип("ДокументСсылка.РелизКлиента") Тогда
	    Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизКлиентаКонтейнеры.Ссылка КАК РелизКлиента
		|ИЗ
		|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|ГДЕ
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = &КлючАналитикиПеревозки";
	
	Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозки.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПоставитьОбъектВОчередьИзменения(Выборка.РелизКлиента, КлючАналитикиПеревозки.Ссылка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
// Евросиб Рыбьяков К.А. 15.04.2025 ))

//Евросиб Коханенко Н.А. 21.02.2024 (( #80981 
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКалькуляция(КалькуляцияОбъект) Экспорт
	
	//Евросиб Коханенко Н.А. 25.04.2024 (( #84617 
	//подбор всех заявок, связанных с текущей калькуляцией
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.Ссылка КАК ЗаявкаСсылка
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Калькуляция = &Калькуляция
		|	И НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Калькуляция", КалькуляцияОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();      
	Пока Выборка.Следующий() Цикл
		ПоставитьОбъектВОчередьИзменения(Выборка.ЗаявкаСсылка, КалькуляцияОбъект.Ссылка);
	КонецЦикла;
	//Евросиб Коханенко Н.А. 25.04.2024 )) #84617 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвтоперевозкуСсылка
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
		|			И (НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления)
		|			И (НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления)
		|ГДЕ
		|	ЗаявкаСоставУслуги.Калькуляция = &Калькуляция";
	Запрос.УстановитьПараметр("Калькуляция", КалькуляцияОбъект.Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();      
	Пока Выборка.Следующий() Цикл
		ПоставитьОбъектВОчередьИзменения(Выборка.ЗапросНаАвтоперевозкуСсылка, КалькуляцияОбъект.Ссылка);
	КонецЦикла; 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 21.02.2024 )) #80981  

// ДИТ US 79304 ТА 79312 Сержантова А.С. 18.04.2024  
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуРегистрСведенийТекущиеДанныеКТК(ИсточникИзменения)

	Если ЗначениеЗаполнено(ИсточникИзменения.ГУИДЗаписиПредыдущегоЦикла) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанные.тек_Релиз КАК Релиз
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|ГДЕ
		|	стоки_ТекущиеДанные.ГУИДЗаписи = &ГУИДЗаписи";
		
		Запрос.УстановитьПараметр("ГУИДЗаписи", ИсточникИзменения.ГУИДЗаписиПредыдущегоЦикла);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий(); 
			Если ЗначениеЗаполнено(Выборка.Релиз) Тогда
				ПоставитьОбъектВОчередьИзменения(Выборка.Релиз, 
					Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСтокиТекущиеДанные);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;		

	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стоки_ТекущиеДанные.тек_Релиз КАК Релиз
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО стоки_ТекущиеДанные.тек_Релиз = РелизСобственникаНоминации.Ссылка
	|			И стоки_ТекущиеДанные.КТК = РелизСобственникаНоминации.Контейнер
	|			И стоки_ТекущиеДанные.тек_ДатаСдачиВСток <> РелизСобственникаНоминации.ДатаВозвратаСобственнику
	|ГДЕ
	|	стоки_ТекущиеДанные.ГУИДЗаписи = &ГУИДЗаписи";
	
	Запрос.УстановитьПараметр("ГУИДЗаписи", ИсточникИзменения.ГУИДЗаписи);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПоставитьОбъектВОчередьИзменения(Выборка.Релиз, 
					Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСтокиТекущиеДанные);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
	
КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. 13.11.2024
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуМорскиеРейсы(ИсточникИзменения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Рейс = &Рейс
		|	И не ЗаявкаПереченьРейсов.Ссылка.ПометкаУдаления   
		// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Начало: 14.11.2024
		|	И ЗаявкаПереченьРейсов.Рейс.ПометкаУдаления
		// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Конец: 14.11.2024
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРейсы.Ссылка
		|ИЗ
		|	Документ.Сделка.Рейсы КАК СделкаРейсы
		|ГДЕ
		|	не СделкаРейсы.Ссылка.ПометкаУдаления
		|	И СделкаРейсы.Рейс = &Рейс
		// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Начало: 14.11.2024    
		|	И СделкаРейсы.Рейс.ПометкаУдаления
		|	
		|ОБЪЕДИНИТЬ ВСЕ 
		|
		|ВЫБРАТЬ
		|	Коносамент.Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК Коносамент
		|ГДЕ
		|	не Коносамент.ПометкаУдаления
		|	И Коносамент.МорскойРейс = &Рейс
		|	И не Коносамент.МорскойРейс.ПометкаУдаления";
		// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Конец: 14.11.2024
	
	Запрос.УстановитьПараметр("Рейс", ИсточникИзменения.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ПоставитьОбъектВОчередьИзменения(Выборка.Ссылка, ИсточникИзменения.Ссылка);
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

//Евросиб Каблов 10.06.2025 #111512
Процедура ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуЖДРейсы(ИсточникИзменения)
	
	Если ЗначениеЗаполнено(ИсточникИзменения.Ссылка) Тогда
		ИсточникИзмененияСсылка = ИсточникИзменения.Ссылка;
	Иначе
		ИсточникИзмененияСсылка = ИсточникИзменения.ПолучитьСсылкуНового();
		Если Не ЗначениеЗаполнено(ИсточникИзмененияСсылка) Тогда
			ИсточникИзмененияСсылка = Справочники.РейсыЖД.ПолучитьСсылку();
			ИсточникИзменения.УстановитьСсылкуНового(ИсточникИзмененияСсылка);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсыЖДФактическийСоставПоезда.НомерКонтейнера КАК НомерКонтейнера,
	|	РейсыЖДФактическийСоставПоезда.НомерНакладной КАК НомерНакладной,
	|	ТЕ.Ссылка КАК Контейнер,
	|	ТранспортныйДокумент.Ссылка КАК Накладная
	|ПОМЕСТИТЬ ФактическийСостав
	|ИЗ
	|	Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО РейсыЖДФактическийСоставПоезда.НомерКонтейнера = ТЕ.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО РейсыЖДФактическийСоставПоезда.НомерНакладной = ТранспортныйДокумент.НомерТранспортногоДокумента
	|ГДЕ
	|	РейсыЖДФактическийСоставПоезда.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	|ИЗ
	|	ФактическийСостав КАК ФактическийСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО ФактическийСостав.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	|			И ФактическийСостав.Накладная = СделкаСвязьУчетныхЕдиниц.ЖДН
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Ссылка", ИсточникИзмененияСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоставитьОбъектВОчередьИзменения(Выборка.Ссылка, ИсточникИзмененияСсылка);
	КонецЦикла;
	
КонецПроцедуры

//Субботин 74397 04.09.2023 Начало
Процедура ПоставитьЗаявкуВОчередьИзменения(Заявка, ИсточникИзменения) Экспорт  
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Возврат;
	КонецЕсли;
    ПоставитьОбъектВОчередьИзменения(Заявка, ИсточникИзменения);
КонецПроцедуры 
//Субботин 74397 04.09.2023 Конец

//ниже вызовы, которые переделать
Процедура ПоставитьРефСцепВОчередьИзменения(РефСцеп, ИсточникИзменения) Экспорт  
	Если НЕ ЗначениеЗаполнено(РефСцеп) Тогда
		Возврат;
	КонецЕсли;
	//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
	//мз.ОбрабатываемыйОбъект = РефСцеп; 
	//мз.ИсточникИзменения 	= ИсточникИзменения;
	//мз.ДатаЗаписи 			= ТекущаяДата();
	//мз.Пользователь 		= Пользователи.ТекущийПользователь();
	//мз.Записать();
	ПоставитьОбъектВОчередьИзменения(РефСцеп, ИсточникИзменения);
КонецПроцедуры 

Процедура ПоставитьЗаявкуСделкуПоРефСцепуВОчередьИзменения(ОбрабатываемыйОбъектСсылка, ИсточникИзменения) Экспорт  
	Если НЕ ЗначениеЗаполнено(ОбрабатываемыйОбъектСсылка) Тогда
		Возврат;
	КонецЕсли;
	//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
	//мз.ОбрабатываемыйОбъект = ОбрабатываемыйОбъектСсылка; 
	//мз.ИсточникИзменения 	= ИсточникИзменения;
	//мз.ДатаЗаписи 			= ТекущаяДата();
	//мз.Пользователь 		= Пользователи.ТекущийПользователь();
	//мз.Записать();
	ПоставитьОбъектВОчередьИзменения(ОбрабатываемыйОбъектСсылка, ИсточникИзменения);
КонецПроцедуры 

Процедура ПоставитьСделкуВОчередьИзменения(Сделка, ИсточникИзменения) Экспорт  
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат;
	КонецЕсли;
	//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
	//мз.ОбрабатываемыйОбъект = Сделка; 
	//мз.ИсточникИзменения = ИсточникИзменения;
	//мз.ДатаЗаписи = ТекущаяДата();
	//мз.Пользователь = Пользователи.ТекущийПользователь();
	//мз.Записать();
	ПоставитьОбъектВОчередьИзменения(Сделка, ИсточникИзменения);
КонецПроцедуры 

Процедура ОбработатьОчередьОтложенногоИзменения() Экспорт 
	
	 //Субботин 74397 04.09.2023 Начало
	// Запрос = Новый Запрос;
	//	 Запрос.Текст =
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	//|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения КАК ИсточникИзменения
	//|ИЗ
	//|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	//|ГДЕ
	//|	НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ОбрабатываемыйОбъект,
	//|	ИсточникИзменения";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	МИНИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ДатаЗаписи) КАК ДатаЗаписи,
	|	МАКСИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОшибкаПриОбработке) КАК ОшибкаПриОбработке,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ВТ_БезОшибок
	|ИЗ
	|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|ГДЕ
	|	НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано
	|
	|СГРУППИРОВАТЬ ПО
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОшибкаПриОбработке) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	МИНИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ДатаЗаписи) КАК ДатаЗаписи,
	|	МАКСИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОшибкаПриОбработке) КАК ОшибкаПриОбработке,
	|	2 КАК Порядок
	|ПОМЕСТИТЬ ВТ_СОшибками
	|ИЗ
	|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|ГДЕ
	|	НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано
	|
	|СГРУППИРОВАТЬ ПО
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОшибкаПриОбработке) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БезОшибок.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	ВТ_БезОшибок.Порядок КАК Порядок,
	|	ВТ_БезОшибок.ДатаЗаписи КАК ДатаЗаписи
	|ПОМЕСТИТЬ ВТ_ПорядокОбработки
	|ИЗ
	|	ВТ_БезОшибок КАК ВТ_БезОшибок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СОшибками.ОбрабатываемыйОбъект,
	|	ВТ_СОшибками.Порядок,
	|	ВТ_СОшибками.ДатаЗаписи
	|ИЗ
	|	ВТ_СОшибками КАК ВТ_СОшибками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	|ВЫБРАТЬ
	|	ВременныеИсключенияОчередиОтложенногоИзменения.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект
	|ПОМЕСТИТЬ ВременныеИсключенияПоАкцептам
	|ИЗ
	|	РегистрСведений.ВременныеИсключенияОчередиОтложенногоИзменения КАК ВременныеИсключенияОчередиОтложенногоИзменения
	|ГДЕ
	|	ВременныеИсключенияОчередиОтложенногоИзменения.ДатаЗавершенияИсключения > &ДатаОбработкиОчереди
	|	И ВременныеИсключенияОчередиОтложенногоИзменения.ДатаЗавершенияИсключения <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВременныеИсключенияОчередиОтложенногоИзменения.ОбрабатываемыйОбъект КАК Документ.Акцепт).Поступление
	|ИЗ
	|	РегистрСведений.ВременныеИсключенияОчередиОтложенногоИзменения КАК ВременныеИсключенияОчередиОтложенногоИзменения
	|ГДЕ
	|	ВременныеИсключенияОчередиОтложенногоИзменения.ДатаЗавершенияИсключения > &ДатаОбработкиОчереди
	|	И ВременныеИсключенияОчередиОтложенногоИзменения.ДатаЗавершенияИсключения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВременныеИсключенияОчередиОтложенногоИзменения.ОбрабатываемыйОбъект ССЫЛКА Документ.Акцепт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременныеИсключенияПоАкцептам.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект
	|ПОМЕСТИТЬ ВременныеИсключения
	|ИЗ
	|	ВременныеИсключенияПоАкцептам КАК ВременныеИсключенияПоАкцептам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект
	|ИЗ
	|	ВременныеИсключенияПоАкцептам КАК ВременныеИсключенияПоАкцептам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|		ПО ВременныеИсключенияПоАкцептам.ОбрабатываемыйОбъект = ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения
	|			И (ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано = ЛОЖЬ)
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОбработки.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	ВТ_ПорядокОбработки.Порядок КАК Порядок,
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения КАК ИсточникИзменения,
	|	ВТ_ПорядокОбработки.ДатаЗаписи КАК ДатаЗаписи
	|ИЗ
	|	ВТ_ПорядокОбработки КАК ВТ_ПорядокОбработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|		ПО ВТ_ПорядокОбработки.ОбрабатываемыйОбъект = ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект
	|			И (ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано = ЛОЖЬ) 
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	|ГДЕ
	|	НЕ ВТ_ПорядокОбработки.ОбрабатываемыйОбъект В
	|				(ВЫБРАТЬ
	|					ВременныеИсключения.ОбрабатываемыйОбъект
	|				ИЗ
	|					ВременныеИсключения КАК ВременныеИсключения)
	|	И НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения В
	|				(ВЫБРАТЬ
	|					ВременныеИсключения.ОбрабатываемыйОбъект
	|				ИЗ
	|					ВременныеИсключения КАК ВременныеИсключения)
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ДатаЗаписи,
	|	ОбрабатываемыйОбъект,
	|	ИсточникИзменения"; 
	//Субботин 74397 04.09.2023 Конец
	ДатаНачалаОбработкиОчереди = ТекущаяДата();	
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	Запрос.УстановитьПараметр("ДатаОбработкиОчереди", ДатаНачалаОбработкиОчереди);
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	МассивОбрабатываемыхОбъектов = ПолучитьМассивСтруктурОбработчиковОбрабатываемыхОбъектов(Выборка);
	ТаблицаФиксации = Новый ТаблицаЗначений;
	ТаблицаФиксации.Колонки.Добавить("ОбрабатываемыйОбъект");
	ТаблицаФиксации.Колонки.Добавить("ИсточникИзменения");
	ТаблицаФиксации.Колонки.Добавить("ДатаЗаписи");
	ТаблицаФиксации.Колонки.Добавить("Пользователь");
	ТаблицаФиксации.Колонки.Добавить("Обработано");
	ТаблицаФиксации.Колонки.Добавить("ДатаОбработки");
	ТаблицаФиксации.Колонки.Добавить("ОшибкаПриОбработке");
	ТаблицаФиксации.Колонки.Добавить("ТекстОшибки");
	ТаблицаФиксации.Колонки.Добавить("ДатаНачалаОбработки");
	ТаблицаФиксации.Колонки.Добавить("ДатаНачалаЗаписи");
	ТаблицаФиксации.Колонки.Добавить("ДатаОкончанияЗаписи");
	Для каждого СтруктураОбрабатываемыйОбъект Из МассивОбрабатываемыхОбъектов Цикл
		ТаблицаФиксации.Очистить();
		Ошибка = Ложь;
		МассивЗаписываемыхОбъектов = Новый Массив;
		обДокумент = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект.ПолучитьОбъект();
		Попытка
			обДокумент.Заблокировать();
			Для каждого ОбработчикИзменения Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
				Для каждого ИсточникИзменения Из ОбработчикИзменения.ИсточникиОбработчика Цикл
					//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
					//мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
					//мз.ИсточникИзменения = ИсточникИзменения;
					//мз.Прочитать();
					//Если мз.Выбран() Тогда
					//	мз.ДатаНачалаОбработки = ТекущаяДата();
					//	мз.Записать();
					//КонецЕсли;
					СтруктураПоиска = Новый Структура("ОбрабатываемыйОбъект, ИсточникИзменения", СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект, ИсточникИзменения);
					СтрокиТаблицы = ТаблицаФиксации.НайтиСтроки(СтруктураПоиска);
					Если СтрокиТаблицы.Количество() = 0 Тогда
						СтрокаТаблицы = ТаблицаФиксации.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураПоиска);
					Иначе
						СтрокаТаблицы = СтрокиТаблицы[0];
					КонецЕсли; 
					СтрокаТаблицы.ДатаНачалаОбработки = ТекущаяДата();
				КонецЦикла;
			КонецЦикла;
		Исключение
			ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения", УровеньЖурналаРегистрации.Ошибка, обДокумент.Метаданные(), обДокумент.Ссылка, ОписаниеОшибки()); 
			Продолжить;	
		КонецПопытки;
		Для каждого СтруктураОбработчик Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
			Если СтруктураОбработчик.КоличествоПараметров = 2 Тогда //нужно перебрать источники и передать их в качестве второго параметра
				Для Каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
					Результат = Вычислить(СтрШаблон("%1(%2,%3)",СтруктураОбработчик.ИмяОбработчика, "обДокумент", "ИсточникИзменения"));
				КонецЦикла;
			Иначе //по умолчанию количество параметров = 1, источник не используем
				Результат = Вычислить(СтрШаблон("%1(%2)",СтруктураОбработчик.ИмяОбработчика, "обДокумент"));
			КонецЕсли;
			Если Результат.Ошибка = Истина Тогда
				Ошибка = Истина;
				Прервать;
			КонецЕсли;   
			Если Результат.НеобходимаЗаписьОбъекта Тогда
				МассивЗаписываемыхОбъектов.Добавить(Результат.ЗаписываемыйОбъект);
			КонецЕсли;
		КонецЦикла;      
		Если Ошибка Тогда
			Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
				//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
				//мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
				//мз.ИсточникИзменения = ИсточникИзменения;
				//мз.Прочитать();
				//Если мз.Выбран() Тогда
				//	//мз.Удалить();
				//	мз.ОшибкаПриОбработке = Истина;
				//	мз.ТекстОшибки = Результат.СообщениеРезультатаВыполнения;
				//	мз.ДатаОбработки = ТекущаяДата();
				//	мз.Записать();
				//КонецЕсли;
				СтруктураПоиска = Новый Структура("ОбрабатываемыйОбъект, ИсточникИзменения", СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект, ИсточникИзменения);
				СтрокиТаблицы = ТаблицаФиксации.НайтиСтроки(СтруктураПоиска);
				Если СтрокиТаблицы.Количество() = 0 Тогда
					СтрокаТаблицы = ТаблицаФиксации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураПоиска);
				Иначе
					СтрокаТаблицы = СтрокиТаблицы[0];
				КонецЕсли; 
				СтрокаТаблицы.ОшибкаПриОбработке = Истина;
				СтрокаТаблицы.ТекстОшибки = Результат.СообщениеРезультатаВыполнения;
				СтрокаТаблицы.ДатаОбработки = ТекущаяДата();
				
			КонецЦикла;
			Продолжить;
		КонецЕсли;         
		НачатьТранзакцию();
		Попытка
			// Евросиб BUG 88347 TA 88348 Рыбьяков К.А. 12.07.2024 ((
			МассивЗаписываемыхОбъектов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗаписываемыхОбъектов);
			// Евросиб Рыбьяков К.А. 12.07.2024 ))
			Для каждого ЗаписываемыйОбъект Из МассивЗаписываемыхОбъектов Цикл
				ЗаписываемыйОбъект.УстановитьКомментарийВерсииИсторииДанных("Очередь отложенного изменения");
				МетаданныеЗаписываемогоОбъекта = ЗаписываемыйОбъект.Метаданные();
				Для каждого СтруктураОбработчик Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
					Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
						СтруктураПоиска = Новый Структура("ОбрабатываемыйОбъект, ИсточникИзменения", СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект, ИсточникИзменения);
						СтрокиТаблицы = ТаблицаФиксации.НайтиСтроки(СтруктураПоиска);
						Если СтрокиТаблицы.Количество() = 0 Тогда
							СтрокаТаблицы = ТаблицаФиксации.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураПоиска);
						Иначе
							СтрокаТаблицы = СтрокиТаблицы[0];
						КонецЕсли;                                     
						СтрокаТаблицы.ДатаНачалаЗаписи = ТекущаяДата();
						//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
						//мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
						//мз.ИсточникИзменения = ИсточникИзменения;
						//мз.Прочитать();
						//Если мз.Выбран() Тогда
						//	мз.ДатаНачалаЗаписи = ТекущаяДата();
						//	мз.Записать();
						//КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, начало
				ЗаписываемыйОбъект.ДополнительныеСвойства.Вставить("ЗаписьОчередьюОтложенногоИзменения", Истина);
				//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, конец
				Если ОбщегоНазначения.ЭтоДокумент(МетаданныеЗаписываемогоОбъекта)
					И МетаданныеЗаписываемогоОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
					И (ЗаписываемыйОбъект.Проведен     
					//Евросиб - АСуслов 13.02.2023 14:05:38 #65699
					//(
					ИЛИ НЕ ЗначениеЗаполнено(ЗаписываемыйОбъект.Ссылка)) Тогда
					//)
					//Евросиб - АСуслов 13.02.2023 14:05:40 #65699
					ЗаписываемыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ЗаписываемыйОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
			обДокумент.Разблокировать();
			Для каждого СтруктураОбработчик Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
				Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
					СтруктураПоиска = Новый Структура("ОбрабатываемыйОбъект, ИсточникИзменения", СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект, ИсточникИзменения);
					СтрокиТаблицы = ТаблицаФиксации.НайтиСтроки(СтруктураПоиска);
					Если СтрокиТаблицы.Количество() = 0 Тогда
						СтрокаТаблицы = ТаблицаФиксации.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураПоиска);
					Иначе
						СтрокаТаблицы = СтрокиТаблицы[0];
					КонецЕсли;                                     
					СтрокаТаблицы.Обработано = Истина;
					СтрокаТаблицы.ДатаОбработки = ТекущаяДата();
					СтрокаТаблицы.ОшибкаПриОбработке = Ложь;
					СтрокаТаблицы.ТекстОшибки = "";

					//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
					//мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
					//мз.ИсточникИзменения = ИсточникИзменения;
					//мз.Прочитать();
					//Если мз.Выбран()                                  
					//	//Евросиб - АСуслов 15.04.2024 13:30:22 #83503
					//	//(
					//	// в противном случае появилась новая запись, которая, возможно, не обработана.
					//	И мз.ДатаЗаписи < ДатаНачалаОбработкиОчереди Тогда
					//	//)
					//	//Евросиб - АСуслов 15.04.2024 13:30:25 #83503
					//	мз.Обработано = Истина;
					//	мз.ДатаОбработки = ТекущаяДата();
					//	мз.ОшибкаПриОбработке = Ложь;
					//	мз.ТекстОшибки = "";
					//	мз.Записать();
					//КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
			ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения", УровеньЖурналаРегистрации.Информация, обДокумент.Метаданные(), обДокумент.Ссылка, "Очередь обработана"); 
		Исключение
			обДокумент.Разблокировать();
			ОтменитьТранзакцию();    
			ТекстОшибки = ОписаниеОшибки();
			//Евросиб - АСуслов 03.09.2025 16:33:48 #
			//(
			МассивСообщенийПользователям = ПолучитьСообщенияПользователю(Истина);
			//)
			//Евросиб - АСуслов 03.09.2025 16:33:52 #
			// Евросиб US 83437 TA 83438 Рыбьяков К.А. 05.06.2024 ((
			ОбработатьИсключениеПоОбрабатываемомуОбъекту(обДокумент, СтруктураОбработчик.ИсточникиОбработчика, ТекстОшибки);
			// Евросиб Рыбьяков К.А. 05.06.2024 ))
			Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
				СтруктураПоиска = Новый Структура("ОбрабатываемыйОбъект, ИсточникИзменения", СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект, ИсточникИзменения);
				СтрокиТаблицы = ТаблицаФиксации.НайтиСтроки(СтруктураПоиска);
				Если СтрокиТаблицы.Количество() = 0 Тогда
					СтрокаТаблицы = ТаблицаФиксации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураПоиска);
				Иначе
					СтрокаТаблицы = СтрокиТаблицы[0];
				КонецЕсли;                                     
				СтрокаТаблицы.Обработано = Ложь;
				СтрокаТаблицы.ДатаОбработки = ТекущаяДата();
				СтрокаТаблицы.ОшибкаПриОбработке = Истина;
				МассивТекстовСообщений = Новый Массив;
				Для каждого СообщениеПользователю Из МассивСообщенийПользователям Цикл
					МассивТекстовСообщений.Добавить(СообщениеПользователю.Текст);
				КонецЦикла;                                                      
				МассивТекстовСообщений.Добавить(ТекстОшибки);
				СтрокаТаблицы.ТекстОшибки = СтрСоединить(МассивТекстовСообщений, Символы.ПС);
				//мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
				//мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
				//мз.ИсточникИзменения = ИсточникИзменения;
				//мз.Прочитать();
				//Если мз.Выбран() Тогда
				//	мз.ОшибкаПриОбработке = Истина;
				//	//Евросиб - АСуслов 03.09.2025 16:33:48 #
				//	//(
				//	МассивТекстовСообщений = Новый Массив;
				//	Для каждого СообщениеПользователю Из МассивСообщенийПользователям Цикл
				//		МассивТекстовСообщений.Добавить(СообщениеПользователю.Текст);
				//	КонецЦикла;                                                      
				//	МассивТекстовСообщений.Добавить(ТекстОшибки);
				//	мз.ТекстОшибки = СтрСоединить(МассивТекстовСообщений, Символы.ПС);
				//	//мз.ТекстОшибки = мТекстОшибки;
				//	//)
				//	//Евросиб - АСуслов 03.09.2025 16:33:52 #
				//	мз.ДатаОбработки = ТекущаяДата();
				//	мз.Записать();
				//КонецЕсли;
			КонецЦикла;
			ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения", УровеньЖурналаРегистрации.Ошибка, обДокумент.Метаданные(), обДокумент.Ссылка, ТекстОшибки); 
		КонецПопытки;	
		Для каждого СтрокаТаблицыФиксацииРезультата Из ТаблицаФиксации Цикл
			мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
			мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
			мз.ИсточникИзменения = ИсточникИзменения;
			мз.Прочитать();
			Если мз.Выбран() Тогда
				Для каждого Колонка Из ТаблицаФиксации.Колонки Цикл
					ЗаполнитьЕслиЗаполнено(мз[Колонка.Имя],СтрокаТаблицыФиксацииРезультата[Колонка.Имя]);
				КонецЦикла;
				Если мз.ДатаЗаписи < ДатаНачалаОбработкиОчереди Тогда
					мз.Обработано = СтрокаТаблицыФиксацииРезультата.Обработано;
				КонецЕсли;
				мз.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	

КонецПроцедуры  

Процедура ВыполнитьОбработчикиОтложенногоИзмененияПоОбъекту(ОбрабатываемыйОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения КАК ИсточникИзменения
	|ИЗ
	|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|ГДЕ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект = &ОбрабатываемыйОбъект
	|	И НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбрабатываемыйОбъект,
	|	ИсточникИзменения";
	Запрос.УстановитьПараметр("ОбрабатываемыйОбъект", ОбрабатываемыйОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	МассивОбрабатываемыхОбъектов = ПолучитьМассивСтруктурОбработчиковОбрабатываемыхОбъектов(Выборка);
	Для каждого СтруктураОбрабатываемыйОбъект Из МассивОбрабатываемыхОбъектов Цикл
		Ошибка = Ложь;
		МассивЗаписываемыхДокументов = Новый Массив;
		обДокумент = ОбрабатываемыйОбъект;
		//Попытка
		//	обДокумент.Заблокировать();
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения", УровеньЖурналаРегистрации.Ошибка, обДокумент.Метаданные(), обДокумент.Ссылка, ОписаниеОшибки()); 
		//	Продолжить;	
		//КонецПопытки;
		Для каждого СтруктураОбработчик Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
			// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
				Результат = Вычислить(СтрШаблон("%1(%2,%3)"
					,СтруктураОбработчик.ИмяОбработчика
					, "обДокумент"
					, "СтруктураОбработчик.ИсточникиОбработчика"));
			// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
			// -- Евросиб Дудоров С.В. US 57543 30.01.2023 
				//Результат = Вычислить(СтрШаблон("%1(%2)",СтруктураОбработчик.ИмяОбработчика, "обДокумент"));
			// -- Евросиб Дудоров С.В. US 57543 30.01.2023 
			Если Результат.Ошибка = Истина Тогда
				Ошибка = Истина;
				Прервать;
			КонецЕсли;   
			Если Результат.НеобходимаЗаписьОбъекта Тогда
				МассивЗаписываемыхДокументов.Добавить(Результат.ЗаписываемыйОбъект);
			КонецЕсли;
		КонецЦикла;      
		Если Ошибка Тогда
			Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
				мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
				мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
				мз.ИсточникИзменения = ИсточникИзменения;
				мз.Прочитать();
				Если мз.Выбран() Тогда
					//мз.Удалить();
					мз.ОшибкаПриОбработке = Истина;
					мз.ДатаОбработки = ТекущаяДата();
					мз.Записать();
				КонецЕсли;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		НачатьТранзакцию();
		Попытка
			Для каждого ЗаписываемыйДокумент Из МассивЗаписываемыхДокументов Цикл
				ЗаписываемыйДокумент.УстановитьКомментарийВерсииИсторииДанных("Очередь отложенного изменения");
				Если ЗаписываемыйДокумент.Проведен Тогда
					ЗаписываемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ЗаписываемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЦикла;
			обДокумент.Разблокировать();
			Для каждого СтруктураОбработчик Из СтруктураОбрабатываемыйОбъект.Обработчики Цикл
				Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
					мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
					мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
					мз.ИсточникИзменения = ИсточникИзменения;
					мз.Прочитать();
					Если мз.Выбран() Тогда
						мз.Обработано = Истина;
						мз.ДатаОбработки = ТекущаяДата();
						мз.Записать();
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
			ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения", УровеньЖурналаРегистрации.Информация, обДокумент.Метаданные(), обДокумент.Ссылка, "Очередь обработана"); 
		Исключение         
			обДокумент.Разблокировать();
			ОтменитьТранзакцию();
			Для каждого ИсточникИзменения Из СтруктураОбработчик.ИсточникиОбработчика Цикл
				мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
				мз.ОбрабатываемыйОбъект = СтруктураОбрабатываемыйОбъект.ОбрабатываемыйОбъект;
				мз.ИсточникИзменения = ИсточникИзменения;
				мз.Прочитать();
				Если мз.Выбран() Тогда
					мз.ОшибкаПриОбработке = Истина;
					мз.ДатаОбработки = ТекущаяДата();
					мз.Записать();
				КонецЕсли;
			КонецЦикла;
			ЗаписьЖурналаРегистрации("Обработка очереди отложенного изменения"
				, УровеньЖурналаРегистрации.Ошибка, обДокумент.Метаданные(), обДокумент.Ссылка, ОписаниеОшибки()); 
		КонецПопытки;	
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьМассивСтруктурОбработчиковОбрабатываемыхОбъектов(Выборка)
    МассивОбрабатываемыхОбъектов = Новый Массив;
	Пока Выборка.СледующийПоЗначениюПоля("ОбрабатываемыйОбъект") Цикл
		СтруктураОбработкиОбъекта = Новый Структура("ОбрабатываемыйОбъект, Обработчики");
		СтруктураСписокИсточниковОбработчика = Новый Структура();
		МассивОбработчиковОбрабатываемогоОбъекта = Новый Массив;
		ТаблицаОбработчиковОбрабатываемогоОбъекта = ПолучитьТаблицуОбработчиковОбрабатываемогоОбъекта();
		МассивИсточниковИзменения = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ИсточникИзменения") Цикл
			//ИмяОбработчика = ПолучитьИмяОбработчика(Выборка.ОбрабатываемыйОбъект, Выборка.ИсточникИзменения); 
			СтруктураОбработчика = ПолучитьСтруктуруОбработчика(Выборка.ОбрабатываемыйОбъект, Выборка.ИсточникИзменения); 
			Если НЕ ЗначениеЗаполнено(СтруктураОбработчика.ИмяОбработчика) Тогда
				Продолжить;
			КонецЕсли;
			//Если МассивОбработчиковОбрабатываемогоОбъекта.Найти(СтруктураОбработчика) = Неопределено Тогда
			//	МассивОбработчиковОбрабатываемогоОбъекта.Добавить(СтруктураОбработчика);
			//КонецЕсли;                                                                                    
			Если ТаблицаОбработчиковОбрабатываемогоОбъекта.НайтиСтроки(СтруктураОбработчика).Количество()=0 Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаОбработчиковОбрабатываемогоОбъекта.Добавить(), СтруктураОбработчика);
			КонецЕсли;
			МассивИсточниковОбработчика = Неопределено;
			Если СтруктураСписокИсточниковОбработчика.Свойство(СтруктураОбработчика.ИмяОбработчика, МассивИсточниковОбработчика) Тогда
				МассивИсточниковОбработчика.Добавить(Выборка.ИсточникИзменения);
			Иначе
				МассивИсточниковОбработчика = Новый Массив;
				СтруктураСписокИсточниковОбработчика.Вставить(СтруктураОбработчика.ИмяОбработчика, МассивИсточниковОбработчика);
				МассивИсточниковОбработчика.Добавить(Выборка.ИсточникИзменения);
			КонецЕсли;
		КонецЦикла;
		СтруктураПараметрыОбработки = Новый Структура("ИмяОбработчика, КоличествоПараметров, МассивИсточников");
		//Для каждого ОбработчикОбрабатываемогоОбъекта Из МассивОбработчиковОбрабатываемогоОбъекта Цикл
		//	СтруктураПараметрыОбработки.Вставить(ОбработчикОбрабатываемогоОбъекта, СтруктураСписокИсточниковОбработчика[ОбработчикОбрабатываемогоОбъекта]);
		//КонецЦикла;
		Для каждого ОбработчикОбрабатываемогоОбъекта Из ТаблицаОбработчиковОбрабатываемогоОбъекта Цикл
			СтруктураПараметрыОбработки.ИмяОбработчика = ОбработчикОбрабатываемогоОбъекта.ИмяОбработчика;
			СтруктураПараметрыОбработки.КоличествоПараметров = ОбработчикОбрабатываемогоОбъекта.КоличествоПараметров;
			СтруктураПараметрыОбработки.МассивИсточников = СтруктураСписокИсточниковОбработчика[ОбработчикОбрабатываемогоОбъекта.ИмяОбработчика];
		КонецЦикла;
		СтруктураОбработкиОбъекта.ОбрабатываемыйОбъект = Выборка.ОбрабатываемыйОбъект;
		МассивОбработчиковСПараметрами = Новый Массив;
		Для каждого Обработчик Из ТаблицаОбработчиковОбрабатываемогоОбъекта Цикл
			СтруктураОбработки = Новый Структура("ИмяОбработчика, КоличествоПараметров, ИсточникиОбработчика", Обработчик.ИмяОбработчика, Обработчик.КоличествоПараметров, СтруктураСписокИсточниковОбработчика[Обработчик.ИмяОбработчика]);	
			МассивОбработчиковСПараметрами.Добавить(СтруктураОбработки);
		КонецЦикла;
		СтруктураОбработкиОбъекта.Обработчики = МассивОбработчиковСПараметрами;
		МассивОбрабатываемыхОбъектов.Добавить(СтруктураОбработкиОбъекта);
	КонецЦикла;
	Возврат МассивОбрабатываемыхОбъектов;
КонецФункции   

Функция ПолучитьТаблицуОбработчиковОбрабатываемогоОбъекта()
	
	ТаблицаОбработчиковОбрабатываемогоОбъекта = Новый ТаблицаЗначений;
	ТаблицаОбработчиковОбрабатываемогоОбъекта.Колонки.Добавить("ИмяОбработчика");
	ТаблицаОбработчиковОбрабатываемогоОбъекта.Колонки.Добавить("КоличествоПараметров", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Возврат ТаблицаОбработчиковОбрабатываемогоОбъекта;
	
КонецФункции

Процедура ОбработатьИсключениеПоОбрабатываемомуОбъекту(ОбрабатываемыйОбъект, ИсточникиОбработчика, ТекстОшибки)
	
	// Евросиб US 83437 TA 83438 Рыбьяков К.А. 06.06.2024 ((
	Если ТипЗнч(ОбрабатываемыйОбъект) = Тип("ДокументОбъект.Сделка") Тогда
		Документы.Акцепт.ЗаписатьОшибкуВСтрокуАкцепта(ОбрабатываемыйОбъект, ИсточникиОбработчика, ТекстОшибки);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 06.06.2024 ))
	
КонецПроцедуры

#Область ОбработчикиИзменений 
Функция ПолучитьСтруктуруОбработчика(ОбрабатываемыйОбъект, ИсточникИзменения)
	
	СоответствиеОбработчиковСделки = Новый Соответствие();
	//СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоРТУ_ОК"));
	//СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоРТУ_ОК"));
	//СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.Акцепт"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоАкцепту"));
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоРТУ_ОК"));
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоРТУ_ОК"));
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.Акцепт"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоАкцепту"));
	//Евросиб - АСуслов 25.01.2023 13:27:47 #59259
	//(
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоСчетуНаОплату"));
	//)
	//Евросиб - АСуслов 25.01.2023 13:27:53 #59259
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.ТранспортныйДокумент"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоТД")); //ДИТ Шевченко А.В. 69796 12.05.2023
	//Евросиб - АСуслов 13.04.2023 16:21:16 #67444
	//(
	СоответствиеОбработчиковСделки.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоДоговору"));
	//)
	//Евросиб - АСуслов 13.04.2023 16:21:19 #67444   
	//Евросиб - АСуслов 28.04.2023 12:51:06 #69256
	//(
	СоответствиеОбработчиковСделки.Вставить(Тип("СправочникСсылка.Пользователи"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоПользователю"));
	//)
	//Евросиб - АСуслов 28.04.2023 12:51:15 #69256
	//Евросиб - АСуслов 13.04.2023 16:47:35 #57543
	//(
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.РефСцеп"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РефСцепаЗаявкиСделкиПоРефСцепу"));
	//)
	//Евросиб - АСуслов 13.04.2023 16:47:38 #57543
	
	//Евросиб Каблов 07.06.2023 ( 68187
	//СоответствиеОбработчиковСделки.Вставить(Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСверхнормативы, ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_Сверхнормативы"));
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.РасчетСНП"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_Сверхнормативы"));
	//Евросиб Каблов 07.06.2023 ) 
	
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 15.04.2025 ((
	СоответствиеОбработчиковСделки.Вставить(Тип("ДокументСсылка.РасчетДополнительныеРасходы"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ДополнительныеРасходы"));
	// Евросиб Рыбьяков К.А. 15.04.2025 ))
	
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 13.05.2025 ((
	СоответствиеОбработчиковСделки.Вставить(Тип("СправочникСсылка.КлючиАналитикиНоминацийРелиза"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_СделкаПоКлючуАналитикиНоминаций"));
	// Евросиб Рыбьяков К.А. 13.05.2025 ))  
	
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Начало: 13.11.2024
	СоответствиеОбработчиковСделки.Вставить(Тип("СправочникСсылка.РейсыМоре"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_МорскойРейс"));
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Конец: 13.11.2024
	
	//Евросиб Каблов 10.06.2025 ( #111512
	СоответствиеОбработчиковСделки.Вставить(Тип("СправочникСсылка.РейсыЖД"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ЖДРейс"));
	//Евросиб Каблов 10.06.2025 )
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	СоответствиеОбработчиковРефСцепа = Новый Соответствие();
	СоответствиеОбработчиковРефСцепа.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РефСцепПоДоговору"));
	СоответствиеОбработчиковРефСцепа.Вставить(Тип("ДокументСсылка.Заявка"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_КлиентыРефСцепаПоЗаявке"));
	СоответствиеОбработчиковРефСцепа.Вставить(Тип("ДокументСсылка.РефСцеп"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РефСцепаЗаявкиСделкиПоРефСцепу"));
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023
	
	СоответствиеОбработчиковПоступления = Новый Соответствие();
	СоответствиеОбработчиковПоступления.Вставить(Тип("ДокументСсылка.Сделка"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ПоступлениеПоСделке"));
	
	//Евросиб - АСуслов 13.04.2023 13:29:07 #67444
	//(
	СоответствиеОбработчиковДоговора = Новый Соответствие(); 
	СоответствиеОбработчиковДоговора.Вставить(Тип("СправочникСсылка.Пользователи"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ДоговорПоПользователю"));
	//)
	//Евросиб - АСуслов 13.04.2023 13:29:09 #67444
	//Евросиб - АСуслов 13.04.2023 16:49:51 #57543
	//(
	СоответствиеОбработчиковЗаявки = Новый Соответствие();
	СоответствиеОбработчиковЗаявки.Вставить(Тип("ДокументСсылка.РефСцеп"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РефСцепаЗаявкиСделкиПоРефСцепу"));
	//)
	//Евросиб - АСуслов 13.04.2023 16:49:53 #57543
	
	//Субботин 74397 04.09.2023 Начало
    СоответствиеОбработчиковЗаявки.Вставить(Тип("ДокументСсылка.Сделка"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_КоносаментыЗаявкиПоСделке"));
	//Субботин 74397 04.09.2023 Конец
	
	//Евросиб Коханенко Н.А. 25.04.2024 (( #84617 
    СоответствиеОбработчиковЗаявки.Вставить(Тип("ДокументСсылка.Калькуляция"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ЗаявкаПоКалькуляции"));
	//Евросиб Коханенко Н.А. 25.04.2024 )) #84617  
	
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Начало: 13.11.2024
	СоответствиеОбработчиковЗаявки.Вставить(Тип("СправочникСсылка.РейсыМоре"),ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_МорскойРейс"));
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Конец: 13.11.2024
	
	СоответствиеОбработчиковРелизаКлиента = Новый Соответствие();
	СоответствиеОбработчиковРелизаКлиента.Вставить(Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийИнформацияОтТерминалов, ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РелизКлиентаПоИнформацииОтТерминалов"));
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
	СоответствиеОбработчиковРелизаКлиента.Вставить(Тип("СправочникСсылка.КлючиАналитикиПеревозки"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РелизКлиентаПоКлючуАналатикиПеревозки"));
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
	
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам = Новый Соответствие;
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.Сделка"), СоответствиеОбработчиковСделки);
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"), СоответствиеОбработчиковПоступления);
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.КорректировкаПоступления"), СоответствиеОбработчиковПоступления);
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.РефСцеп"), СоответствиеОбработчиковРефСцепа);
	//Если ТипЗнч(ОбрабатываемыйОбъект) = Тип("ДокументСсылка.Заявка") 
	// 	и ТипЗнч(ИсточникИзменения) = Тип("ДокументСсылка.РефСцеп") Тогда
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.Заявка"), СоответствиеОбработчиковЗаявки);
	//КонецЕсли;	
	//Если ТипЗнч(ОбрабатываемыйОбъект) = Тип("ДокументСсылка.Сделка") 
	//	и ТипЗнч(ИсточникИзменения) = Тип("ДокументСсылка.РефСцеп") Тогда
	//	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.Сделка"), СоответствиеОбработчиковРефСцепа);
	//КонецЕсли;	
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023   
	//Евросиб - АСуслов 13.04.2023 13:32:20 #67444
	//(
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), СоответствиеОбработчиковДоговора);
	//)
	//Евросиб - АСуслов 13.04.2023 13:32:23 #67444                                                                                              
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.РелизКлиента"), СоответствиеОбработчиковРелизаКлиента);
	
	//Евросиб Каблов 17.05.2023 ( 67617
	СоответствиеОбработчиковСчетаНаОплату = Новый Соответствие();
	СоответствиеОбработчиковСчетаНаОплату.Вставить(Тип("ДокументСсылка.Сделка"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_АвансовыеСчетаПоЗаявкамСделки"));
		
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"), СоответствиеОбработчиковСчетаНаОплату);
	//Евросиб Каблов 17.05.2023 )
	
	//Евросиб Коханенко Н.А. 15.02.2024 (( #80981 
	СоответствиеОбработчиковЗапросыНаАвтоперевозку = Новый Соответствие();
	СоответствиеОбработчиковЗапросыНаАвтоперевозку.Вставить(Тип("ДокументСсылка.Калькуляция"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ЗапросНаАвтоперевозку"));

	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.ЗапросНаАвтоперевозку"), СоответствиеОбработчиковЗапросыНаАвтоперевозку);
	//Евросиб Коханенко Н.А. 15.02.2024 )) #80981 
	
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Начало: 18.04.2024
	СоответствиеОбработчиковРелизСобственника = Новый Соответствие();
	СоответствиеОбработчиковРелизСобственника.Вставить(Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСтокиТекущиеДанные,
									ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_РелизСобственника"));

	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.РелизСобственника"), СоответствиеОбработчиковРелизСобственника);
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Конец: 18.04.2024      
	
	// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Начало: 14.11.2024
	СоответствиеОбработчиковТранспортногоДокумента = Новый Соответствие();
	СоответствиеОбработчиковТранспортногоДокумента.Вставить(Тип("СправочникСсылка.РейсыМоре"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_КоносаментПоМорскомуРейсу"));
	
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.ТранспортныйДокумент"), СоответствиеОбработчиковТранспортногоДокумента);
	// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Конец: 14.11.2024 
	
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024
	СоответствиеОбработчиковПСЦ = Новый Соответствие();
	СоответствиеОбработчиковПСЦ.Вставить(Тип("СправочникСсылка.Маршрутизация"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ИзменитьИсполнителейВМаршрутахПСЦ"));
	
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.ПСЦ"), СоответствиеОбработчиковПСЦ);	
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. конец: 27.11.2024
	
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	СоответствиеОбработчиковНормативКонтрибуции = Новый Соответствие();
	СоответствиеОбработчиковНормативКонтрибуции.Вставить(Тип("ДокументСсылка.НормативКонтрибуции"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ПересчетНормативаКонтрибуцииВКалькуляции"));
	
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.Калькуляция"), СоответствиеОбработчиковНормативКонтрибуции);	
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	СоответствиеОбработчиковТранспортныйДокумент = Новый Соответствие();
	СоответствиеОбработчиковТранспортныйДокумент.Вставить(Тип("ДокументСсылка.ТранспортныйДокумент"), ПолучитьСтруктуруОбработчикаПоИмени("ОбработчикИзменения_ЗаполнениеУчетныхЕдиницИПунктовВПСЦПоставщика"));
	
	СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Вставить(Тип("ДокументСсылка.ПСЦПоставщика"), СоответствиеОбработчиковТранспортныйДокумент);
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	
	СоответствиеОбработчиков = СоответствиеТипаОбрабатываемогоОбъектаОбработчикам.Получить(ТипЗнч(ОбрабатываемыйОбъект));
	//Возврат СоответствиеОбработчиков.Получить(ТипЗнч(ИсточникИзменения));
	Возврат СоответствиеОбработчиков.Получить(ПолучитьКлючСоответствияОбработчиковПоИсточникуИзменения(ИсточникИзменения));
	
КонецФункции                                                                             

Функция ПолучитьКлючСоответствияОбработчиковПоИсточникуИзменения(ИсточникИзменения)
	//Евросиб Каблов 07.06.2023 ( 68187
	//Если ИсточникИзменения = Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийИнформацияОтТерминалов Тогда
	Если ТипЗнч(ИсточникИзменения) = Тип("ПеречислениеСсылка.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов") Тогда
	//Евросиб Каблов 07.06.2023 )
		КлючСоответствия = ИсточникИзменения;
	Иначе
		КлючСоответствия = ТипЗнч(ИсточникИзменения);
	КонецЕсли;                                       
	Возврат КлючСоответствия;
КонецФункции


Функция ПолучитьСтруктуруОбработчикаПоИмени(ИмяОбработчика)
	
	СтруктураОбработчика = Новый Структура("ИмяОбработчика, КоличествоПараметров", ИмяОбработчика, 1);
	Если ИмяОбработчика = "ОбработчикИзменения_РефСцепПоДоговору" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_КлиентыРефСцепаПоЗаявке" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_РефСцепаЗаявкиСделкиПоРефСцепу" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;  
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Начало: 13.11.2024
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_МорскойРейс" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2; 
	// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. Конец: 13.11.2024
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Начало: 26.11.2024
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_КоносаментыЗаявкиПоСделке" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2; 
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Конец: 26.11.2024
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_ИзменитьИсполнителейВМаршрутахПСЦ" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;	
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. конец: 27.11.2024
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 25.05.2025 ((
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_СделкаПоКлючуАналитикиНоминаций" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	// Евросиб Рыбьяков К.А. 25.05.2025 ))
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 02.06.2025 ((
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_ДополнительныеРасходы" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	// Евросиб Рыбьяков К.А. 02.06.2025 ))
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_ПересчетНормативаКонтрибуцииВКалькуляции" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305 
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	ИначеЕсли ИмяОбработчика = "ОбработчикИзменения_ЗаполнениеУчетныхЕдиницИПунктовВПСЦПоставщика" Тогда
		СтруктураОбработчика.КоличествоПараметров = 2;
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026	
	Иначе
		СтруктураОбработчика.КоличествоПараметров = 1;
	КонецЕсли;
	Возврат СтруктураОбработчика;
		
КонецФункции

Функция ОбработчикИзменения_СделкаПоРТУ_ОК(обСделка, ИсточникИзменения = Неопределено) 
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка
		Документы.Сделка.ЗаполнитьУчетныеДокументыВДоходах(обСделка);
		ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуДокументСделка(обСделка);
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки(); 
		Ошибка = Истина;
	КонецПопытки;       
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", Истина, обСделка, Ошибка, СообщениеРезультатаВыполнения);
КонецФункции 

//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
Функция ПолучитьТаблицуДоходовКРасходам(СделкаСсылка, МассивГУИДРасходов)
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаРасходы.ГУИД КАК ГУИД,
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаРасходы.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты,
		|	СделкаРасходы.АвтоматическиПривязыватьРасходКДоходу КАК АвтоматическиПривязыватьРасходКДоходу,
		|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
		|	СделкаРасходы.ПеренесеннаяСделкаИсточник КАК ПеренесеннаяСделкаИсточник,
		|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	Документ.Сделка.Расходы КАК СделкаРасходы
		|ГДЕ
		|	СделкаРасходы.Ссылка = &Ссылка
		|	И СделкаРасходы.ГУИД В(&МассивГУИДРасходов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
		|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
		|ИЗ
		|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|ГДЕ
		|	СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	ВЫРАЗИТЬ(СделкаДоходы.КорректировкаДокумента КАК Документ.КорректировкаРеализации) КАК КорректировкаДокумента,
		|	СделкаДоходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
		|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту
		|ПОМЕСТИТЬ ВТ_Доходы
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|ГДЕ
		|	СделкаДоходы.Ссылка = &Ссылка
		|	И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|			ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
		|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
		|	СделкаДоходы.СтрокаКалькуляции КАК СтрокаКалькуляции
		|ПОМЕСТИТЬ ВТ_СвязьДоходыСУЕ
		|ИЗ
		|	ВТ_Доходы КАК СделкаДоходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|			ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
		|		ПО СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
		|			И (СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически))
		|			И (НЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязьДоходыСУЕ.ГУИД КАК Доходы,
		|	ВТ_Расходы.ГУИД КАК Расходы,
		|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	ВТ_СвязьДоходыСУЕ.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
		|	ВТ_Расходы.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ
		|	ВТ_Расходы КАК ВТ_Расходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
		|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
		|			И ВТ_Расходы.Услуга = ВТ_СвязьДоходыСУЕ.Услуга
		|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ИСТИНА)
		|			И (ВЫБОР
		|				КОГДА ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции <> """"
		|					ТОГДА ВТ_Расходы.СтрокаКалькуляции = ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Итоговая.Доходы КАК Доходы,
		|	ВТ_Итоговая.Расходы КАК Расходы,
		|	ВТ_Итоговая.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	ВТ_Итоговая.Услуга КАК Услуга,
		|	ВТ_Итоговая.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
		|	ВТ_Итоговая.Доходы <> ЕСТЬNULL(СделкаСвязьДоходовИРасходов.Доходы, """") КАК ТребуетсяУстановитьСвязь
		|ИЗ
		|	ВТ_Итоговая КАК ВТ_Итоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ПО ВТ_Итоговая.Расходы = СделкаСвязьДоходовИРасходов.Расходы
		|			И ВТ_Итоговая.СвязьУчетныхЕдиниц = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц";
		
		Запрос.УстановитьПараметр("Ссылка", СделкаСсылка);
		Запрос.УстановитьПараметр("МассивГУИДРасходов", МассивГУИДРасходов);
		Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец

Функция ОбработчикИзменения_СделкаПоАкцепту(обСделка, ИсточникИзменения = Неопределено) 
	Ошибка = Ложь;  
	СообщениеРезультатаВыполнения = "";
	//проверим актуальность учетных документов и заменим на актуальные, если они изменились
	Запрос = Новый Запрос;
	//Субботин 69649 24.08.2023 Начало
	Запрос.Текст = ТекстЗапросаПолучениеГуидовСтрок();
	// получение текста запроса вынес в отдельную функцию 
	//Субботин 69649 24.08.2023 Конец --
	Запрос.УстановитьПараметр("Сделка", обСделка.Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = МассивРезультатов.Количество();
	НеобходимаЗаписьОбъекта = Ложь;
	
	//Евросиб Каблов 06.01.2024 ( #78949
	ТаблицаДобавляемыхУслугВнеСтавки = обСделка.СвязьДоходовИРасходов.ВыгрузитьКолонки("СвязьУчетныхЕдиниц, Услуга, Доходы, Расходы");
	//Евросиб Каблов 06.01.2024 )
	
	Если НЕ МассивРезультатов[КоличествоРезультатов-2].Пустой() 
		ИЛИ НЕ МассивРезультатов[КоличествоРезультатов-1].Пустой() Тогда
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
		ТаблицаДоходовДляОбработки = ПолучитьТаблицуДоходовКРасходам(обСделка.Ссылка, МассивРезультатов[КоличествоРезультатов-2].Выгрузить().ВыгрузитьКолонку("ГУИД"));
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
		
		ВыборкаСтрокРасходов = МассивРезультатов[КоличествоРезультатов-2].Выбрать();
		Пока ВыборкаСтрокРасходов.СледующийПоЗначениюПоля("ГУИД") Цикл
			Если ВыборкаСтрокРасходов.ЕстьСовпадение Тогда
				Продолжить;
			Иначе
				СтрокаРасход = обСделка.Расходы.Найти(ВыборкаСтрокРасходов.ГУИД, "ГУИД");
				//Евросиб Каблов 14.08.2023 ( Ticket#0319898
				//СтрокаРасход.УчДокумент = ВыборкаСтрокРасходов.Поступление;
				Если ТипЗнч(ВыборкаСтрокРасходов.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
					СтрокаРасход.УчДокумент = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ВыборкаСтрокРасходов.Поступление, Истина);
				Иначе
					СтрокаРасход.УчДокумент = ВыборкаСтрокРасходов.Поступление;
				КонецЕсли;
				//Евросиб Каблов 14.08.2023 )
				////Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
				//СтрокаРасход.УчДокумент = ВыборкаСтрокРасходов.Поступление;
				////Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
				
				//Евросиб - АСуслов 07.03.2023 16:28:28 #66486
				//(
				СтрокаРасход.УслугаОтключена = Ложь; 
				СтрокаРасход.ПричинаОтключенияСтроки = Неопределено;
				//)
				//Евросиб - АСуслов 07.03.2023 16:28:30 #66486
				
				//Евросиб Каблов 06.10.2023 ( Ticket#0327386
				СтрокиСоставаПоезда = обСделка.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИД", СтрокаРасход.СтрокаСвязьУчетныхЕдиниц));
				Для Каждого СтрокаСП Из СтрокиСоставаПоезда Цикл
					Если СтрокаСП.НеАктивна Тогда
						СтрокаСП.НеАктивна = Ложь;
					КонецЕсли;
					Если СтрокаСП.Удалена Тогда
						СтрокаСП.Удалена = Ложь;
					КонецЕсли;
				КонецЦикла;
				//Евросиб Каблов 06.10.2023 )
				
				//Евросиб Каблов 06.01.2024 ( #78949
				Если ЗначениеЗаполнено(СтрокаРасход.СтрокаСвязьУчетныхЕдиниц) Тогда
					
					//Для добавления новой строки, если она отсутствует
					СтрокаУслугиВнеСтавки = ТаблицаДобавляемыхУслугВнеСтавки.Добавить();
					СтрокаУслугиВнеСтавки.СвязьУчетныхЕдиниц = СтрокаРасход.СтрокаСвязьУчетныхЕдиниц;
					СтрокаУслугиВнеСтавки.Услуга = СтрокаРасход.Услуга;
					СтрокаУслугиВнеСтавки.Расходы = СтрокаРасход.ГУИД;
					
					//Снятие флажка "Не выставлять" у найденной строки дохода
					//ЕстьВыставляемая = Ложь;
					//СтрокиСвязиДоходов = обСделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Услуга", СтрокаРасход.СтрокаСвязьУчетныхЕдиниц, СтрокаРасход.Услуга));
					//Для Каждого СтрокаСвязиДоходов Из СтрокиСвязиДоходов Цикл
					//	Если ЗначениеЗаполнено(СтрокаСвязиДоходов.Доходы) Тогда
					//		СтрокаДоход = обСделка.Доходы.Найти(СтрокаСвязиДоходов.Доходы, "ГУИД");
					//		Если СтрокаДоход <> Неопределено И СтрокаДоход.Услуга = СтрокаРасход.Услуга И СтрокаДоход.НеВыставлятьКлиенту = Ложь Тогда
					//			ЕстьВыставляемая = Истина;
					//			Прервать;
					//		КонецЕсли;
					//	КонецЕсли;
					//КонецЦикла;
					//
					//Если Не ЕстьВыставляемая Тогда
					//	Для Каждого СтрокаСвязиДоходов Из СтрокиСвязиДоходов Цикл
					//		Если ЗначениеЗаполнено(СтрокаСвязиДоходов.Доходы) Тогда
					//			СтрокаДоход = обСделка.Доходы.Найти(СтрокаСвязиДоходов.Доходы, "ГУИД");
					//			Если СтрокаДоход <> Неопределено И СтрокаДоход.Услуга = СтрокаРасход.Услуга И СтрокаДоход.НеВыставлятьКлиенту Тогда
					//				СтрокаДоход.НеВыставлятьКлиенту = Ложь;
					//				СтрокаУслугиВнеСтавки.Доходы = СтрокаДоход.ГУИД;
					//				Прервать;
					//			КонецЕсли;
					//		КонецЕсли;
					//	КонецЦикла;
					//КонецЕсли;
					//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
					СтрокиСопоставленныхДоходов = ТаблицаДоходовДляОбработки.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Услуга, Расходы", СтрокаРасход.СтрокаСвязьУчетныхЕдиниц, СтрокаРасход.Услуга, СтрокаРасход.ГУИД));
					Если СтрокиСопоставленныхДоходов.Количество() > 0 Тогда
						СтрокаСопоставленногоДоходов = СтрокиСопоставленныхДоходов[0];
						СтрокаСопоставленногоДоходов.НеВыставлятьКлиенту = Ложь;
						Если СтрокаСопоставленногоДоходов.ТребуетсяУстановитьСвязь Тогда
							Документы.Сделка.СвязатьДоходыРасходыСУЕ(обСделка, СтрокаСопоставленногоДоходов.Доходы, СтрокаРасход.ГУИД, СтрокаРасход.СтрокаСвязьУчетныхЕдиниц, СтрокаРасход.Услуга);
						КонецЕсли;
					КонецЕсли;
					//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
					
				КонецЕсли;
				//Евросиб Каблов 06.01.2024 )
				
			КонецЕсли;		
		КонецЦикла;
		ВыборкаСтрокРасходов = МассивРезультатов[КоличествоРезультатов-1].Выбрать();
		мСтрокКУдалению = Новый Массив;
		Пока ВыборкаСтрокРасходов.СледующийПоЗначениюПоля("ГУИД") Цикл
			СтрокиРасход = обСделка.Расходы.НайтиСтроки(Новый Структура("ГУИД", ВыборкаСтрокРасходов.ГУИД));
			Для каждого СтрокаРасход Из СтрокиРасход Цикл
				Если СтрокаРасход.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
					//мСтрокКУдалению = Новый Массив;
					мСтрокКУдалению.Добавить(СтрокаРасход);		        
					//Евросиб - АСуслов 07.03.2023 14:59:52 #66486
					//(
					//обСделка.УдалитьСтрокиРасходов(мСтрокКУдалению, Ложь, Истина, Ложь);
					//обСделка.УдалитьСтрокиРасходов(мСтрокКУдалению, Истина, Истина, Ложь, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки);
					//)
					//Евросиб - АСуслов 07.03.2023 15:00:00 #66486
				Иначе
					СтрокаРасход.УчДокумент = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если мСтрокКУдалению.Количество() > 0 Тогда
			обСделка.УдалитьСтрокиРасходов(мСтрокКУдалению, Истина, Истина, Ложь, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки);
		КонецЕсли;
		обСделка.НеЗаполнятьРасходы = Истина;                          
		//Евросиб - АСуслов 25.01.2023 13:18:59 #59259
		//( перенес 
		//ДИТ, Беляев СЮ, Ticket#0298115 / BUG 64444, 20-01-2023, начало
		обСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта", Истина);
		//ДИТ, Беляев СЮ, Ticket#0298115 / BUG 64444, 20-01-2023, конец
		//)
		//Евросиб - АСуслов 25.01.2023 13:19:01 #59259
		
		//Евросиб Каблов 06.01.2024 ( #78949
		Если ЗначениеЗаполнено(ТаблицаДобавляемыхУслугВнеСтавки) Тогда
			
			ДопПараметрыУслугВнеСтавки = Новый Структура;
			ДопПараметрыУслугВнеСтавки.Вставить("НеВыставлятьКлиенту", Ложь);
			ДоходыСделкиСервер.ВключитьВДоходыУслугиНевключенныеВСтавку(обСделка,,, ТаблицаДобавляемыхУслугВнеСтавки, ДопПараметрыУслугВнеСтавки);
			ДоходыСделкиСервер.ЗаполнитьДатыОказанияУслуги(обСделка);
			
			//Если по Доходу не определился Период ВО и плановый расход уже привязан к другой строке доходов - значит период ВО определить не получится,
			//ставим признак НеВыставлятьКлиенту
			Для Каждого СтрокаДобавленныхУслуг Из ТаблицаДобавляемыхУслугВнеСтавки Цикл
				Если ЗначениеЗаполнено(СтрокаДобавленныхУслуг.Доходы) Тогда
					СтрокаДоход = обСделка.Доходы.Найти(СтрокаДобавленныхУслуг.Доходы, "ГУИД");
					Если СтрокаДоход <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаДоход.ПериодВО) Тогда
							СтрокиСвязи = обСделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", СтрокаДобавленныхУслуг.Расходы));
							Для Каждого СтрокаСвязи Из СтрокиСвязи Цикл
								Если ЗначениеЗаполнено(СтрокаСвязи.Доходы) И СтрокаСвязи.Доходы <> СтрокаДобавленныхУслуг.Доходы Тогда
									СтрокаДоход.НеВыставлятьКлиенту = Истина;
								КонецЕсли;
							КонецЦикла;							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		//Евросиб Каблов 06.01.2024 )

		НеобходимаЗаписьОбъекта = Истина;
	КонецЕсли;   
	
	// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 29.09.2023 - добавлена актуализация транспортных документов из акцепта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Евросиб - АСуслов 12.10.2023 14:51:30 #
	//(
	//"ВЫБРАТЬ
	//|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт
	//|ПОМЕСТИТЬ ВТ_АктуальныеАкцепты
	//|ИЗ
	//|	РегистрСведений.АктуальныеАкцепты.СрезПоследних КАК АктуальныеАкцептыСрезПоследних
	//|ГДЕ
	//|	АктуальныеАкцептыСрезПоследних.Акцепт <> ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.Ссылка КАК Ссылка,
	//|	СделкаРасходы.ГУИД КАК ГУИД,
	//|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	//|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокументИстина
	//|ИЗ
	//|	Документ.Сделка.Расходы КАК СделкаРасходы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
	//|			ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
	//|		ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	//|			И (СделкаРасходы.Ссылка = &Ссылка)
	//|			И (НЕ СделкаРасходы.Ссылка.ПометкаУдаления)
	//|			И (АкцептУслуги.ТранспортныйДокумент <> СделкаРасходы.ТранспортныйДокумент)
	//|			И (АкцептУслуги.ТранспортныйДокумент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
	//|			И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономики)
	//|ГДЕ
	//|	СделкаРасходы.Ссылка.ДатаЗакрытияСделки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	"ВЫБРАТЬ
	|	СделкаРасходы.Ссылка КАК Ссылка,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокументИстина
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК ВТ_АктуальныеАкцепты
	|		ПО СделкаРасходы.Ссылка = ВТ_АктуальныеАкцепты.Сделка
	|			И СделкаРасходы.ГУИД = ВТ_АктуальныеАкцепты.ИдентификаторСтрокиРасходовВСделке
	|			И (СделкаРасходы.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО СделкаРасходы.Ссылка = АкцептУслуги.Сделка
	|			И СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	|			И (АкцептУслуги.ТранспортныйДокумент <> СделкаРасходы.ТранспортныйДокумент)
	|			И (АкцептУслуги.ТранспортныйДокумент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
	|			И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономики)";
	//)
	//Евросиб - АСуслов 12.10.2023 14:51:34 #
		
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	Запрос.УстановитьПараметр("Ссылка", обСделка.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРасходов = обСделка.Расходы.Найти(Выборка.ГУИД, "ГУИД");	
            СтрокаРасходов.ТранспортныйДокумент = Выборка.ТранспортныйДокументИстина;
			НеобходимаЗаписьОбъекта = Истина;
		КонецЦикла;
	КонецЕсли;  
	// ДИТ US 61689 TA 73965 Сержантова А.С. Конец: 29.09.2023   
	
	// Евросиб US 83437 TA 83438 Рыбьяков К.А. 03.06.2024 ((
	РезультатПолученияДанных = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.ДанныеДляЗаполненияСделкиИзАкцепта(обСделка.Ссылка);
	Если РезультатПолученияДанных.ОбрабатываемыеСтроки <> Неопределено Тогда
		обСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта", Истина);
		обСделка.ДополнительныеСвойства.Вставить("ДанныеДляЗаполненияСделкиИзАкцепта", РезультатПолученияДанных.ОбрабатываемыеСтроки);
		РаботаСоСделкамиСервер.ДобавитьСтрокиРасходовВСделку(обСделка, РезультатПолученияДанных.ОбрабатываемыеСтроки);
		НеобходимаЗаписьОбъекта = Истина;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 03.06.2024 ))
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, обСделка, Ошибка, СообщениеРезультатаВыполнения);
		
КонецФункции 

 //Субботин 69649 24.08.2023 Начало--
Функция ТекстЗапросаПолучениеГуидовСтрок() Экспорт
	ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	АктуальныеАкцептыСрезПоследних.Поступление КАК Поступление,
	//|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт
	//|ПОМЕСТИТЬ ВТ_АктуальныеАкцепты
	//|ИЗ
	//|	РегистрСведений.АктуальныеАкцепты.СрезПоследних КАК АктуальныеАкцептыСрезПоследних
	//|ГДЕ
	//|	НЕ АктуальныеАкцептыСрезПоследних.Акцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.Ссылка КАК Ссылка,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	|	АктуальныеПривязкиАкцептовВСделки.Поступление КАК Поступление,
	|	СделкаРасходы.УчДокумент = АктуальныеПривязкиАкцептовВСделки.Поступление КАК ЕстьСовпадение
	|ПОМЕСТИТЬ ВТ_ТекущиеПривязкиАкцептов
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	//Евросиб - АСуслов 12.10.2023 14:56:27 #
	//(
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
	//|			ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
	//)

	|   	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	//Евросиб - АСуслов 12.10.2023 14:56:28 #
	
	|		ПО  СделкаРасходы.Ссылка = АктуальныеПривязкиАкцептовВСделки.Сделка
	|  			И СделкаРасходы.ГУИД = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке
	|			И (СделкаРасходы.Ссылка = &Сделка)
	//Евросиб - АСуслов 26.12.2022 17:35:33 #0279218
	//(                 
	//Евросиб - АСуслов 09.03.2023 9:53:30 #66486
	//(
	|           И (НЕ СделкаРасходы.УслугаОтключена ИЛИ СделкаРасходы.ИсточникПоявленияСТрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))
	//)
	//Евросиб - АСуслов 09.03.2023 9:53:36 #66486
	//)
	//Евросиб - АСуслов 26.12.2022 17:35:34 #0279218
	|;
	|////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ТекущиеПривязкиАкцептов.Ссылка КАК Сделка,
	 |	ВТ_ТекущиеПривязкиАкцептов.ГУИД КАК ГУИД,
	 |	ВТ_ТекущиеПривязкиАкцептов.УчДокумент КАК УчДокумент,
	 |	ВТ_ТекущиеПривязкиАкцептов.Поступление КАК Поступление,
	 |	ВТ_ТекущиеПривязкиАкцептов.ЕстьСовпадение КАК ЕстьСовпадение
	 |ИЗ
	 |	ВТ_ТекущиеПривязкиАкцептов КАК ВТ_ТекущиеПривязкиАкцептов
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеПривязкиАкцептов КАК ВТ_ТекущиеПривязкиАкцептов1
	 |		ПО ВТ_ТекущиеПривязкиАкцептов.ГУИД = ВТ_ТекущиеПривязкиАкцептов1.ГУИД
	 |			И (ВТ_ТекущиеПривязкиАкцептов1.ЕстьСовпадение = ИСТИНА)
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ГУИД,
	 |	ЕстьСовпадение УБЫВ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущиеПривязкиАкцептов.Ссылка КАК Сделка,
	|	ВТ_ТекущиеПривязкиАкцептов.ГУИД КАК ГУИД,
	|	ВТ_ТекущиеПривязкиАкцептов.УчДокумент КАК УчДокумент,
	|	ВТ_ТекущиеПривязкиАкцептов.Поступление КАК Поступление,
	|	ВТ_ТекущиеПривязкиАкцептов.ЕстьСовпадение КАК ЕстьСовпадение
	|ИЗ
	|	ВТ_ТекущиеПривязкиАкцептов КАК ВТ_ТекущиеПривязкиАкцептов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеПривязкиАкцептов КАК ВТ_ТекущиеПривязкиАкцептов1
	|		ПО ВТ_ТекущиеПривязкиАкцептов.ГУИД = ВТ_ТекущиеПривязкиАкцептов1.ГУИД
	|			И (ВТ_ТекущиеПривязкиАкцептов1.ЕстьСовпадение = ИСТИНА)
	|ГДЕ
	|	ВТ_ТекущиеПривязкиАкцептов1.ГУИД ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГУИД,
	|	ЕстьСовпадение УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.Ссылка КАК Сделка,
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Сделка
	|	И НЕ СделкаРасходы.ГУИД В
	|				(ВЫБРАТЬ
	|					т.ГУИД
	|				ИЗ
	|					ВТ_ТекущиеПривязкиАкцептов КАК т)
	//ДИТ Шевченко А.В. 55587 29.12.22 -начало
	//|	И НЕ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)";
	//Евросиб - АСуслов 25.01.2023 13:26:21 #59259
	//(
	|	И НЕ СделкаРасходы.УчДокумент.Ссылка Есть NULL";
	//)
	//Евросиб - АСуслов 25.01.2023 13:26:26 #59259
	//ДИТ Шевченко А.В. 55587 29.12.22 -конец
	
    Возврат ТекстЗапроса 
	
КонецФункции	

Функция ОбработчикИзменения_ПоступлениеПоСделке(ПоступлениеОбъект, ИсточникИзменения = Неопределено)
	Поступление = ПоступлениеОбъект.Ссылка;
	СписокПолейСравненияАкцепта = Константы.СписокПолейСравненияАкцепта.Получить();
	Ошибка = Ложь;
	Попытка
		обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
		ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Поступление).АкцептСсылка;                    
		ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.Выгрузить(, СписокПолейСравненияАкцепта), ОбАкцепт.Услуги.Выгрузить(, СписокПолейСравненияАкцепта),СписокПолейСравненияАкцепта,, Истина);		
		Если ИзмененийНет Тогда    
			СообщениеРезультатаВыполнения = "Нет изменений для записи акцепта";  
		КонецЕсли;
	Исключение  
		Ошибка = Истина;
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
	КонецПопытки;
	
	// Евросиб US 83437 TA 83438 Рыбьяков К.А. 09.06.2024 ((
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДляДобавленияСтрокАкцептовВСделку.ГУИД КАК ГУИД,
	|	ДанныеДляДобавленияСтрокАкцептовВСделку.ТекстОшибки КАК ТекстОшибки
	|ИЗ
	|	РегистрСведений.ДанныеДляДобавленияСтрокАкцептовВСделку КАК ДанныеДляДобавленияСтрокАкцептовВСделку
	|ГДЕ
	|	ДанныеДляДобавленияСтрокАкцептовВСделку.ПТУ = &Поступление
	|	И ДанныеДляДобавленияСтрокАкцептовВСделку.ОбработаноСОшибкой = ИСТИНА
	|	И ДанныеДляДобавленияСтрокАкцептовВСделку.Обработано = ЛОЖЬ";

	Запрос.УстановитьПараметр("Поступление", Поступление);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Если Не РезультатЗапроса.Пустой() Тогда
		
		//Евросиб - АСуслов 22.10.2024 17:55:11 #
		//(
		АкцептОбъект = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
		МассивОбработанныхГУИД = Новый Массив;
		//)
		//Евросиб - АСуслов 22.10.2024 17:55:12 #
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			//АкцептОбъект = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
			
			СтрокаАкцепта = АкцептОбъект.Услуги.Выгрузить(Новый Структура("ГУИД", Выборка.ГУИД));
			ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(АкцептОбъект.Услуги, СтрокаАкцепта);
			Для Каждого Стр из АкцептОбъект.Услуги Цикл
				Если Стр.ГУИД = Выборка.ГУИД Тогда
					СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.ГУИД));
					Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], АкцептОбъект, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОшибкаПриДобавленииСтрокРасходовВСделку;
					Стр.НеурегКомментарий = Выборка.ТекстОшибки;
					ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
				КонецЕсли;
			КонецЦикла;
			
			МассивОбработанныхГУИД.Добавить(Выборка.ГУИД);
			//Попытка
			//	АкцептОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Исключение
			//	Ошибка = Истина;
			//	СообщениеРезультатаВыполнения = ОписаниеОшибки();
			//КонецПопытки;
			
			//МенеджерЗаписи = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.ПТУ = Поступление;
			//МенеджерЗаписи.ГУИД = Выборка.ГУИД;
			//МенеджерЗаписи.Прочитать();
			//Если МенеджерЗаписи.Выбран() Тогда
			//	МенеджерЗаписи.Обработано = Истина;
			//	МенеджерЗаписи.Записать();
			//КонецЕсли;	
		КонецЦикла;
//Евросиб - АСуслов 22.10.2024 17:55:34 #
//(
			Попытка
				АкцептОбъект.Записать(РежимЗаписиДокумента.Проведение);
				НаборЗаписей = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ПТУ.Установить(Поступление);
				НаборЗаписей.Прочитать();
				ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
				Для каждого ОбработанныйГУИД Из МассивОбработанныхГУИД Цикл  
					СтрокаНабораЗаписей = ТаблицаНабораЗаписей.Найти(ОбработанныйГУИД, "ГУИД");
					Если СтрокаНабораЗаписей <> Неопределено Тогда
						СтрокаНабораЗаписей.Обработано = Истина;
					КонецЕсли;
				КонецЦикла;
				НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
				НаборЗаписей.Записать();
					//МенеджерЗаписи = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.СоздатьМенеджерЗаписи();
					//МенеджерЗаписи.ПТУ = Поступление;
					//МенеджерЗаписи.ГУИД = Выборка.ГУИД;
					//МенеджерЗаписи.Прочитать();
					//Если МенеджерЗаписи.Выбран() Тогда
					//	МенеджерЗаписи.Обработано = Истина;
					//	МенеджерЗаписи.Записать();
					//КонецЕсли;	
					//КонецЦикла;
			Исключение
				Ошибка = Истина;
				СообщениеРезультатаВыполнения = ОписаниеОшибки();
			КонецПопытки;

//)
//Евросиб - АСуслов 22.10.2024 17:55:35 #
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 09.06.2024 ))
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", ИзмененийНет = Ложь, обАкцепт, Ошибка, СообщениеРезультатаВыполнения);
КонецФункции

Функция ОбработчикИзменения_СделкаПоСчетуНаОплату(СделкаОбъект, ИсточникИзменения = Неопределено)

	НеобходимаЗаписьОбъекта = РаботаСоСделкамиСервер.ЗаполнитьСчетаПокупателю(СделкаОбъект);
	СделкаОбъект.НеЗаполнятьРасходы = Истина;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ложь, "");
	
КонецФункции
//Евросиб - АСуслов 13.04.2023 16:59:54 #67444
//(
Функция ОбработчикИзменения_СделкаПоДоговору(СделкаОбъект, ИсточникИзменения = Неопределено)

	НеобходимаЗаписьОбъекта = Документы.Сделка.ЗаполнитьОтветственногоЗаУчет(СделкаОбъект);;
	СделкаОбъект.НеЗаполнятьРасходы = Истина;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ложь, "");
	
КонецФункции
//)
//Евросиб - АСуслов 13.04.2023 16:59:57 #67444
//Евросиб - АСуслов 28.04.2023 12:52:10 #69256
//(
Функция ОбработчикИзменения_СделкаПоПользователю(СделкаОбъект, ИсточникИзменения = Неопределено)

	НеобходимаЗаписьОбъекта = Документы.Сделка.ЗаполнитьОтветственногоЗаУчет(СделкаОбъект);;
	СделкаОбъект.НеЗаполнятьРасходы = Истина;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ложь, "");
	
КонецФункции
//)
//Евросиб - АСуслов 28.04.2023 12:52:12 #69256

Функция ОбработчикИзменения_СделкаПоТД(обСделка, ИсточникИзменения = Неопределено) //ДИТ Шевченко А.В. 55599 03.02.2023
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка                
		ГоризонтПоискаНакладных = ?(обСделка.ГоризонтПоискаНакладных = 0, 40, обСделка.ГоризонтПоискаНакладных);
		ТаблицаСУЕдоИзменений = обСделка.СвязьУчетныхЕдиниц.Выгрузить();
		РаботаСоСделкамиСервер.ПодобратьНакладныеВСделку(обСделка, ГоризонтПоискаНакладных); 
		//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, начало
		Документы.Сделка.УстановитьГотовоКВыставлению(обСделка);
		//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, конец
		ТаблицаСУЕпослеИзменений = обСделка.СвязьУчетныхЕдиниц.Выгрузить();
		ФлагНаличияИзменений = НЕ ОбщегоНазначения.КоллекцииИдентичны(ТаблицаСУЕдоИзменений, ТаблицаСУЕпослеИзменений,,, Истина);
		
		//Евросиб Каблов 24.03.2025 ( #100520
		Если Не ФлагНаличияИзменений Тогда
			ТаблицаРасходовДоИзменений = обсделка.Расходы.Выгрузить();
			РаботаСоСделкамиСервер.ЗаполнитьРасходы(обСделка);
			ФлагНаличияИзменений = НЕ ОбщегоНазначения.КоллекцииИдентичны(ТаблицаРасходовДоИзменений, обСделка.Расходы,,, Истина);
		КонецЕсли;
		//Евросиб Каблов 24.03.2025 )
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, начало
		Если Не ФлагНаличияИзменений Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПлановыеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
					|	ПлановыеДоходыВО.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки
					|ИЗ
					|	РегистрНакопления.ПлановыеДоходыВО КАК ПлановыеДоходыВО
					|ГДЕ
					|	ПлановыеДоходыВО.Регистратор = &Регистратор";
			Запрос.УстановитьПараметр("Регистратор", обсделка.Ссылка);
			ПлановыеДоходыДоИзменений = Запрос.Выполнить().Выгрузить();
			УчетДоходовРасходовСервер.Сделка_СформироватьДвиженияПлановыеДоходыВО(обСделка);
			ПлановыеДоходыПослеИзменений = обСделка.Движения.ПлановыеДоходыВО.Выгрузить(,"ИдентификаторСУЕ,РасчетнаяДатаЗавершенияПеревозки");
			ФлагНаличияИзменений = НЕ ОбщегоНазначения.КоллекцииИдентичны(ПлановыеДоходыДоИзменений, ПлановыеДоходыПослеИзменений,,, Ложь);
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, конец
		
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки(); 
		Ошибка = Истина;
	КонецПопытки;       
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", ФлагНаличияИзменений, обСделка, Ошибка, СообщениеРезультатаВыполнения);
КонецФункции

//Евросиб - АСуслов 13.04.2023 13:26:01 #67444
//(
Функция ОбработчикИзменения_ДоговорПоПользователю(ДоговорОбъект, ИсточникИзменения = Неопределено)
	НеобходимаЗаписьОбъекта = Ложь;
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	
	//если пользователь ответственный за учет недействительный
	МассивСостоянийЗаполнитьОтветственногоЗаУчет = Новый Массив;
	СостояниеЗаполнитьОтветственногоЗаУчет = Справочники.Состояния.ЗаполнитьОтветственногоЗаУчет;
	СостояниеЗаполнитьОтветственногоЗаУчетНСК = Справочники.Состояния.УказатьОтветственногоЗаСопровождениеИУчетНСК;
	
	МассивСостоянийЗаполнитьОтветственногоЗаУчет.Добавить(СостояниеЗаполнитьОтветственногоЗаУчет);
	МассивСостоянийЗаполнитьОтветственногоЗаУчет.Добавить(СостояниеЗаполнитьОтветственногоЗаУчетНСК);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК Ответственный,
	|	МаршрутизацияСостояния.Исполнитель КАК ИсполнительПоМаршруту
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.Состояния КАК МаршрутизацияСостояния
	|		ПО ДоговорыКонтрагентовОтветственные.Ссылка.ПримененныйМаршрут = МаршрутизацияСостояния.Ссылка
	|			И (МаршрутизацияСостояния.Состояние В (&СостояниеЗаполнитьОтветственногоЗаУчет))
	|ГДЕ
	|	ДоговорыКонтрагентовОтветственные.Ссылка = &Договор
	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = &ТипОтветственного
	|	И ДоговорыКонтрагентовОтветственные.Ответственный.Недействителен
	|	И ДоговорыКонтрагентовОтветственные.Ссылка.Активный";
	Запрос.УстановитьПараметр("Договор", ДоговорОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТипОтветственного", Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);
	Запрос.УстановитьПараметр("СостояниеЗаполнитьОтветственногоЗаУчет", МассивСостоянийЗаполнитьОтветственногоЗаУчет);
	РезультатЗапроса = Запрос.Выполнить();                         
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		//очистим ответственного за учет
		Пока Выборка.Следующий() Цикл
			СтрокиОтветственныйЗаУчет = ДоговорОбъект.Ответственные.НайтиСтроки(Новый Структура("Ответственный", Выборка.Ответственный));
			Для каждого СтрокаОтветственныйЗаУчет Из СтрокиОтветственныйЗаУчет Цикл
				СтрокаОтветственныйЗаУчет.Ответственный = Неопределено;
			КонецЦикла;                  
		КонецЦикла;
		//поставим задачу 
		Для каждого Состояние Из МассивСостоянийЗаполнитьОтветственногоЗаУчет Цикл
			СтрокиСостояния = ДоговорОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние", Состояние));
			Если СтрокиСостояния.Количество() > 0 Тогда
				СтрокаСостояния = СтрокиСостояния[0];
				СтрокаСостояния.ПредыдущиеЭтапы = "999";
				СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				СтрокаСостояния.Исполнитель = Выборка.ИсполнительПоМаршруту;
				НеобходимаЗаписьОбъекта = Истина;                                                                                       
			КонецЕсли;
		КонецЦикла;
		Если НЕ НеобходимаЗаписьОбъекта Тогда
			Ошибка = Истина;
			СообщениеРезультатаВыполнения = "Не найдено состояние для постановки задачи заполнить ответственного за учет"
		КонецЕсли;
	КонецЕсли;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, ДоговорОбъект, Ошибка, СообщениеРезультатаВыполнения);
	
КонецФункции

//)
//Евросиб - АСуслов 13.04.2023 13:26:09 #67444   

Функция ОбработчикИзменения_РелизКлиентаПоИнформацииОтТерминалов(РелизКлиентаОбъект)
	НеобходимаЗаписьОбъекта = РелизКлиентаОбъект.ЗаполнитьКонтейнерыПоИнформацииОтТерминалов();		
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, РелизКлиентаОбъект, Ложь, "");
КонецФункции

                             
// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
Функция ОбработчикИзменения_РефСцепПоДоговору(РефСцепОбъект, Договор)

	НеобходимаЗаписьОбъекта  = Документы.РефСцеп.ИзменитьИсполнителейПоДоговору(РефСцепОбъект, Договор);
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения"
							, НеобходимаЗаписьОбъекта, РефСцепОбъект, Ложь, "");
	
КонецФункции

Функция ОбработчикИзменения_КлиентыРефСцепаПоЗаявке(РефСцепОбъект, Заявка)
	НеобходимаЗаписьОбъекта  = Документы.РефСцеп.ИзменитьРефСцепПоЗаявке(РефСцепОбъект, Заявка);
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения"
							, НеобходимаЗаписьОбъекта, РефСцепОбъект, Ложь, "");
КонецФункции	

Функция ОбработчикИзменения_РефСцепаЗаявкиСделкиПоРефСцепу(ДокументОбъект, РефСцепСсылка)
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
		НеобходимаЗаписьОбъекта  = Документы.Заявка.ИзменитьЗаявкуПоРефСцепу(ДокументОбъект, РефСцепСсылка);
		Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения"
								, НеобходимаЗаписьОбъекта, ДокументОбъект, Ложь, "");
	ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Сделка") Тогда
		НеобходимаЗаписьОбъекта  = Документы.Сделка.ИзменитьСделкуПоРефСцепу(ДокументОбъект, РефСцепСсылка);
		Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения"
								, НеобходимаЗаписьОбъекта, ДокументОбъект, Ложь, "");
	ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.РефСцеп") Тогда
		НеобходимаЗаписьОбъекта  = Документы.РефСцеп.ДобавитьКонтейнерИзДругогоРефСцепа(ДокументОбъект, РефСцепСсылка);
		Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения"
								, НеобходимаЗаписьОбъекта, ДокументОбъект, Ложь, "");
	КонецЕсли;							
КонецФункции
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 

//Евросиб Каблов 17.05.2023 67617
Функция ОбработчикИзменения_АвансовыеСчетаПоЗаявкамСделки(СчетОбъект, ИсточникИзменения = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка
		//МальцевАН #77303 20.05.2024
		//(
		НеобходимаЗапись = Документы.СчетНаОплатуПокупателю.ПерезаполнитьАктуальныеДокументыОснованияПоСчету(СчетОбъект);
		Если НеобходимаЗапись = Ложь Тогда
			//Евросиб Каблов 10.09.2025 ( #
			Если СчетОбъект.Проведен Тогда
			//Евросиб Каблов 10.09.2025 )
				УчетДоходовРасходовСервер.Счет_СформироватьДвиженияПлановыеДоходыПоСчетамНаОплату(СчетОбъект);
				СчетОбъект.Движения.Записать();
			КонецЕсли;
		КонецЕсли;
        //)
		//МальцевАН #77303 20.05.2024
	Исключение  
		Ошибка = Истина;
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
	КонецПопытки;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗапись, СчетОбъект, Ошибка, СообщениеРезультатаВыполнения);
КонецФункции

//Евросиб Каблов 07.06.2023 68187
Функция ОбработчикИзменения_Сверхнормативы(СделкаОбъект, РасчетСНП = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка
		НеобходимаЗаписьОбъекта = Обработки.АРМСверхнормативы.ДобавитьДоходыРасходыВСделку(СделкаОбъект, РасчетСНП);
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
	КонецПопытки;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции

//Субботин 74397 04.09.2023 Начало
Функция ОбработчикИзменения_КоносаментыЗаявкиПоСделке(Заявка,Источник = Неопределено) 

	//	Запрос = Новый Запрос;
	//Запрос.Текст =	
	//"ВЫБРАТЬ
	//|	ВремТЧ.Контейнер КАК Контейнер,
	//|	ВремТЧ.Коносамент КАК Коносамент,
	//|	ВремТЧ.МорскойРейс КАК МорскойРейс,
	//|	ВремТЧ.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	&ВремТЧ КАК ВремТЧ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	//|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
	//|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
	//|	ЗаявкаСоставУслуги.Коносамент КАК Коносамент
	//|ПОМЕСТИТЬ ДанныеЗаявки
	//|ИЗ
	//|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//|ГДЕ
	//|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Контейнер КАК Контейнер,
	//|	ВТ.Коносамент КАК Коносамент,
	//|	ВТ.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерДокумента,
	//|	ВТ.МорскойРейс КАК МорскойРейс,
	//|	ДанныеЗаявки.Заявка КАК Заявка,
	//|	ДанныеЗаявки.ГУИДСтроки КАК ГУИДСтроки
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗаявки КАК ДанныеЗаявки
	//|		ПО ВТ.ГУИДСтрокиЗаявки = ДанныеЗаявки.ГУИДСтроки
	//|			И ВТ.Коносамент <> ДанныеЗаявки.Коносамент";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Заявка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
	|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
	|	ЗаявкаСоставУслуги.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ДанныеЗаявки
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Коносамент КАК Коносамент,
	|	ВТ.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерДокумента,
	|	ВТ.МорскойРейс КАК МорскойРейс,
	|	ДанныеЗаявки.Заявка КАК Заявка,
	|	ДанныеЗаявки.ГУИДСтроки КАК ГУИДСтроки
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗаявки КАК ДанныеЗаявки
	|		ПО ВТ.ГУИДСтрокиЗаявки = ДанныеЗаявки.ГУИДСтроки
	|			И ВТ.Коносамент <> ДанныеЗаявки.Коносамент";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	НадоЗаписать = Ложь;
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Если не РезультатЗапроса.Пустой() тогда
		Выборка = РезультатЗапроса.Выбрать();
		ТекЗаявка = Заявка;
		Пока Выборка.Следующий() Цикл 
			ТЧУслуги = ТекЗаявка.СоставУслуги;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ГУИДСтроки",Выборка.ГУИДСтроки);
			НайденныйКТК = ТЧУслуги.НайтиСтроки(ПараметрыОтбора);
			Если НайденныйКТК.Количество()>0 Тогда
				НайденныйКТК[0].РеестрКлиента = Выборка.КоносаментНомерДокумента;  
				НадоЗаписать = Истина;
			КонецЕсли;
		КонецЦикла;

		КонецЕсли;
	 НеобходимаЗаписьОбъекта = НадоЗаписать;
	 	 
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Начало: 26.11.2024
	НеобходимаЗаписьОбъекта = РаботаСоСделкамиСервер.ПерезаполнениеРейсовВЗаявке(Источник,Заявка,НеобходимаЗаписьОбъекта);
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Конец: 26.11.2024
 
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, Заявка, Ошибка, СообщениеРезультатаВыполнения);

	
КонецФункции
//Субботин 74397 04.09.2023 Конец 

//Евросиб Коханенко Н.А. 21.02.2024 (( #80981
Функция ОбработчикИзменения_ЗапросНаАвтоперевозку(ЗапросНаАвтоОбъект)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка
		НеобходимаЗаписьОбъекта = ЗапросНаАвтоОбъект.ОбновитьСтоимостьВЗапросеНаАвто();
	Исключение
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
	КонецПопытки;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, ЗапросНаАвтоОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции //Евросиб Коханенко Н.А. 21.02.2024 )) #80981 

// ДИТ US 79304 ТА 79312 Сержантова А.С. 18.04.2024
Функция ОбработчикИзменения_РелизСобственника(РелизСобственника) 
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";

	Запрос = Новый Запрос;
	Запрос.Текст =   
	// Евросиб(ДИТ) US 88268 ТА 88269 Сержантова А.С. Начало: 24.07.2024
	// Было:
		//"ВЫБРАТЬ
		//|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
		//|	РелизСобственникаНоминации.Контейнер КАК Контейнер
		//|ПОМЕСТИТЬ ВТ_КонтейнерыРелиза
		//|ИЗ
		//|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		//|ГДЕ
		//|	РелизСобственникаНоминации.Ссылка = &Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_КонтейнерыРелиза.Ссылка КАК Ссылка,
		//|	ВТ_КонтейнерыРелиза.Контейнер КАК Контейнер,
		//|	МАКСИМУМ(стоки_ТекущиеДанные.Период) КАК Период,
		//|	МАКСИМУМ(стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК) КАК ПорядковыйНомерЦиклаАрендыКТК
		//|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоРелизу
		//|ИЗ
		//|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтейнерыРелиза КАК ВТ_КонтейнерыРелиза
		//|		ПО (ВТ_КонтейнерыРелиза.Контейнер = стоки_ТекущиеДанные.КТК)
		//|			И стоки_ТекущиеДанные.тек_Релиз = ВТ_КонтейнерыРелиза.Ссылка
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_КонтейнерыРелиза.Ссылка,
		//|	ВТ_КонтейнерыРелиза.Контейнер
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ПоследняяЗаписьПоРелизу.Ссылка КАК РелизСобственника,
		//|	ВТ_ПоследняяЗаписьПоРелизу.Контейнер КАК Контейнер,
		//|	МИНИМУМ(стоки_ТекущиеДанные.Период) КАК Период,
		//|	МИНИМУМ(стоки_ТекущиеДанные.тек_Пользователь) КАК Пользователь
		//|ИЗ
		//|	ВТ_ПоследняяЗаписьПоРелизу КАК ВТ_ПоследняяЗаписьПоРелизу
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		//|		ПО (стоки_ТекущиеДанные.Период >= ВТ_ПоследняяЗаписьПоРелизу.Период)
		//|			И (стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК = ВТ_ПоследняяЗаписьПоРелизу.ПорядковыйНомерЦиклаАрендыКТК + 1)
		//|			И ВТ_ПоследняяЗаписьПоРелизу.Контейнер = стоки_ТекущиеДанные.КТК
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ПоследняяЗаписьПоРелизу.Ссылка,
		//|	ВТ_ПоследняяЗаписьПоРелизу.Контейнер";  
	//Стало:
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз КАК РелизСобственника,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Начало: 18.10.2024
		// Было:
		//|	МИНИМУМ(стоки_ТекущиеДанные.Период) КАК Период 
		//Стало:
		|	МИНИМУМ(стоки_ТекущиеДанныеСрезПоследних.Период) КАК Период
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Конец: 18.10.2024
		|ПОМЕСТИТЬ ВТ_ПериодСледующегоЦикла
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			,
		|			КТК В
		|					(ВЫБРАТЬ
		|						Т.Контейнер
		|					ИЗ
		|						Документ.РелизСобственника.Номинации КАК Т
		|					ГДЕ
		|						Т.Ссылка = &Ссылка
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Начало: 18.10.2024
		//Было:
		//|				) И тек_Релиз = &Ссылка) КАК стоки_ТекущиеДанныеСрезПоследних
		|                      	и (Т.ПодтверждениеСдачиКТК = Значение(Справочник.Пользователи.ПустаяСсылка) или Т.ДатаЗакрытияЦикла = ДатаВремя(1,1,1,0,0,0)))  
		|               И тек_Статус = Значение(Перечисление.СтатусыКТК.Возвращен)) КАК стоки_ТекущиеДанныеСрезПоследних
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Конец: 18.10.2024
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|		ПО стоки_ТекущиеДанныеСрезПоследних.КТК = стоки_ТекущиеДанные.КТК        
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Начало: 18.10.2024
		// Было:
		//|			И (стоки_ТекущиеДанные.Период >= стоки_ТекущиеДанныеСрезПоследних.Период)
		//|			И (стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК = стоки_ТекущиеДанныеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК + 1) 
		//Стало:
		|			И (стоки_ТекущиеДанныеСрезПоследних.Период >= стоки_ТекущиеДанные.Период)
		|			И (стоки_ТекущиеДанныеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК = стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК + 1)
        |		    И стоки_ТекущиеДанные.тек_Релиз = &Ссылка
		// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Конец: 18.10.2024
		|
		|СГРУППИРОВАТЬ ПО
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
		|ВЫБРАТЬ
		|	МАКСИМУМ(стоки_ТекущиеДанные.Период) КАК Период,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		|	РелизСобственникаНоминации.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|		ПО (РелизСобственникаНоминации.Контейнер = стоки_ТекущиеДанные.КТК)
		|			И (РелизСобственникаНоминации.Ссылка = стоки_ТекущиеДанные.тек_Релиз)
		|			И (РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПУстаяСсылка))
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РелизСобственникаНоминации.ГУИДСтроки,
		|	РелизСобственникаНоминации.Контейнер,
		|	РелизСобственникаНоминации.ДатаВозвратаСобственнику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
		|ВЫБРАТЬ
		|	ВТ_ПериодСледующегоЦикла.РелизСобственника КАК РелизСобственника,
		|	ВТ_ПериодСледующегоЦикла.Контейнер КАК Контейнер,
		|	ВТ_ПериодСледующегоЦикла.Период КАК Период,
		|	стоки_ТекущиеДанные.тек_Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_ПериодСледующегоЦикла КАК ВТ_ПериодСледующегоЦикла
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|		ПО ВТ_ПериодСледующегоЦикла.Контейнер = стоки_ТекущиеДанные.КТК
		|			И (стоки_ТекущиеДанные.Период = ВТ_ПериодСледующегоЦикла.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
		|ВЫБРАТЬ
		|	ВТ.Контейнер КАК Контейнер,
		|	стоки_ТекущиеДанные.тек_ДатаСдачиВСток КАК ДатаВозвратаСобственнику
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|		ПО (ВТ.Период = стоки_ТекущиеДанные.Период
		|				И ВТ.Контейнер = стоки_ТекущиеДанные.КТК
		|				И ВТ.ДатаВозвратаСобственнику <> стоки_ТекущиеДанные.тек_ДатаСдачиВСток)";
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
		
	// Евросиб(ДИТ) US 88268 ТА 88269 Сержантова А.С. Конец: 24.07.2024
	
	Запрос.УстановитьПараметр("Ссылка", РелизСобственника.Ссылка);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	РезультатЗапросаЗакрытияЦикла = РезультатЗапросаПакет[2];
	РезультатЗапросаДатыВозвратаСобственнику = РезультатЗапросаПакет[3];
	Если Не РезультатЗапросаЗакрытияЦикла.Пустой() ИЛИ НЕ РезультатЗапросаДатыВозвратаСобственнику.Пустой() Тогда
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
		Выборка = РезультатЗапросаЗакрытияЦикла.Выбрать();
		НеобходимаЗаписьОбъекта = Ложь;
		Пока Выборка.Следующий() Цикл
			СтрокиКТК = РелизСобственника.Номинации.НайтиСтроки(Новый Структура("Контейнер", Выборка.Контейнер));
			Если СтрокиКТК.Количество() > 0 Тогда
				// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Начало: 18.10.2024
				// Было:
				//СтрокиКТК[0].ПодтверждениеСдачиКТК = Выборка.Пользователь; 
				//СтрокиКТК[0].ДатаЗакрытияЦикла = Выборка.Период; 
				//Стало:
				Если не ЗначениеЗаполнено(СтрокиКТК[0].ПодтверждениеСдачиКТК) и ЗначениеЗаполнено(Выборка.Пользователь) Тогда
					СтрокиКТК[0].ПодтверждениеСдачиКТК = Выборка.Пользователь;
					НеобходимаЗаписьОбъекта = Истина; //Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, взводим флаг при изменении данных
				КонецЕсли; 
				Если не ЗначениеЗаполнено(СтрокиКТК[0].ДатаЗакрытияЦикла) и ЗначениеЗаполнено(Выборка.Период) Тогда
					СтрокиКТК[0].ДатаЗакрытияЦикла = Выборка.Период;
					НеобходимаЗаписьОбъекта = Истина; //Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, взводим флаг при изменении данных
				КонецЕсли;
				// Евросиб(ДИТ) US 93178 ТА 93179 Сержантова А.С. Конец: 18.10.2024
				//НеобходимаЗаписьОбъекта = Истина; //Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, закомметировал
			КонецЕсли;
		КонецЦикла; 
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
		ВыборкаДатыВозвратаСобственнику = РезультатЗапросаДатыВозвратаСобственнику.Выбрать();
		Пока ВыборкаДатыВозвратаСобственнику.Следующий() Цикл
			СтрокиКТК = РелизСобственника.Номинации.НайтиСтроки(Новый Структура("Контейнер", ВыборкаДатыВозвратаСобственнику.Контейнер));
			Если СтрокиКТК.Количество() > 0 Тогда   
				СтрокиКТК[0].ДатаВозвратаСобственнику = ВыборкаДатыВозвратаСобственнику.ДатаВозвратаСобственнику;
				НеобходимаЗаписьОбъекта = Истина;
			КонецЕсли;
		КонецЦикла;
		//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
		
	Иначе
		НеобходимаЗаписьОбъекта = Ложь;
		//Ошибка = Истина;
		//СообщениеРезультатаВыполнения = "Нет данных для обновления полей закрытия цикла! (Подтверждение сдачи КТК, Дата закрытия цикла)";
		// Евросиб(ДИТ) US 88268 ТА 88269 Сержантова А.С. Начало 24.07.2024
		//Если РелизСобственника.Номинации.Количество() = 0 Тогда
			мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
			мз.ОбрабатываемыйОбъект = РелизСобственника.Ссылка;
			мз.ИсточникИзменения = Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСтокиТекущиеДанные;
			мз.Прочитать();
			Если мз.Выбран() Тогда
				МЗ.Обработано = Истина;
				мз.ДатаОбработки = ТекущаяДата();
				мз.Записать();
			КонецЕсли;
		//Иначе
		//	Ошибка = Истина;
		//	СообщениеРезультатаВыполнения = "Нет данных для обновления полей закрытия цикла! (Подтверждение сдачи КТК, Дата закрытия цикла)";
		//КонецЕсли;
		// Евросиб(ДИТ) US 88268 ТА 88269 Сержантова А.С. Конец: 24.07.2024
	КонецЕсли;  
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
			НеобходимаЗаписьОбъекта, РелизСобственника, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции 
		
//Евросиб Коханенко Н.А. 25.04.2024 (( #84617 
Функция ОбработчикИзменения_ЗаявкаПоКалькуляции(ЗаявкаОбъект)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
	               |	ДокументКалькуляция.УчетноеНаправление КАК УчетноеНаправление
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	               |		ПО ЗаявкаСоставУслуги.Калькуляция = ДокументКалькуляция.Ссылка
	               |			И ЗаявкаСоставУслуги.УчетноеНаправление <> ДокументКалькуляция.УчетноеНаправление
	               |			И (НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления)
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.Ссылка = &ЗаявкаСсылка";
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		НеобходимаЗаписьОбъекта = Ложь;
		Пока Выборка.Следующий() Цикл
			СтрокиУслуги = ЗаявкаОбъект.СоставУслуги.НайтиСтроки(Новый Структура("ГУИДСтроки", Выборка.ГУИДСтроки));
			Если СтрокиУслуги.Количество() > 0 Тогда
				СтрокиУслуги[0].УчетноеНаправление = Выборка.УчетноеНаправление; 
				НеобходимаЗаписьОбъекта = Истина;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		НеобходимаЗаписьОбъекта = Ложь;
	КонецЕсли;  
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
			НеобходимаЗаписьОбъекта, ЗаявкаОбъект, Ошибка, СообщениеРезультатаВыполнения);
			
КонецФункции //Евросиб Коханенко Н.А. 25.04.2024 )) #84617

// Евросиб(ДИТ) US 84968 ТА 93711 Сержантова А.С. 13.11.2024
Функция ОбработчикИзменения_МорскойРейс(ДокументОбъект, ИсточникИзменения = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;
	
	Если не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "Состояния") Тогда
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Ложь;
		Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);
	КонецЕсли;	
	
	СостояниеДляЗадачи = Справочники.Состояния.УдаленМорскойРейс;
	ЗадачаОбновленияДобавлена = Ложь;
	Для каждого СтрСостояния Из ДокументОбъект.Состояния Цикл
		Если СтрСостояния.Состояние = СостояниеДляЗадачи Тогда
			СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
			СтрСостояния.НачалоРаботы = ТекущаяДата();  
			СтрСостояния.Комментарий = "Морской рейс " + ?(ИсточникИзменения<>Неопределено, ИсточникИзменения, "") + " удален";
			ЗадачаОбновленияДобавлена = Истина; 
			Прервать;
		КонецЕсли;
	КонецЦикла;  
	Если не ЗадачаОбновленияДобавлена Тогда
		НС = ДокументОбъект.Состояния.Добавить();	
		НС.Состояние = СостояниеДляЗадачи;
		НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе; 
		НС.Исполнитель = ДокументОбъект.Автор;  
		НС.Наблюдатель = ДокументОбъект.Автор;
		НС.ПредыдущиеЭтапы = "1";  
		НС.НачалоРаботы = ТекущаяДата(); 
		//СтрСостояния.Комментарий = "Морской рейс " + ?(ИсточникИзменения<>Неопределено, ИсточникИзменения, "") + " удален";
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0394272, 09-04-2025, начало
		НС.Комментарий = "Морской рейс " + ?(ИсточникИзменения<>Неопределено, ИсточникИзменения, "") + " удален";
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0394272, 09-04-2025, конец
		ЗадачаОбновленияДобавлена = Истина;
	КонецЕсли;   
	
	НеобходимаЗаписьОбъекта = Истина;

	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции 

//Евросиб Каблов 10.06.2025 #111512
Функция ОбработчикИзменения_ЖДРейс(ДокументОбъект, ИсточникИзменения = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;
	
	ПерезаполнениеСделкиСервер.ЗаполнитьРейсыВСоставеПоезда(ДокументОбъект, НеобходимаЗаписьОбъекта);   
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции 

// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. 14.11.2024   
Функция ОбработчикИзменения_КоносаментПоМорскомуРейсу(ДокументОбъект)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;   
	
	Если не ЗначениеЗаполнено(ДокументОбъект.МорскойРейс) Тогда
		Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);
	Иначе
		СтрокаРеквизитов = "ПунктОтправления, ПунктНазначения, МестоПогрузки, МестоРазгрузки, ДатаОтправления, ДатаПрибытия";
		РеквизитыМорскогоРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.МорскойРейс, СтрокаРеквизитов);						 
		ДокументОбъект.СтанцияОтправления	= РеквизитыМорскогоРейса.ПунктОтправления; 
		ДокументОбъект.СтанцияНазначения 	= РеквизитыМорскогоРейса.ПунктНазначения; 
		ДокументОбъект.МестоПолученияГруза 	= РеквизитыМорскогоРейса.МестоПогрузки; 
		ДокументОбъект.МестоПоставкиГруза 	= РеквизитыМорскогоРейса.МестоРазгрузки; 
		ДокументОбъект.ДатаОтправления 		= РеквизитыМорскогоРейса.ДатаОтправления; 
		ДокументОбъект.ДатаПрибытия 		= РеквизитыМорскогоРейса.ДатаПрибытия; 
		НеобходимаЗаписьОбъекта = Истина;
	КонецЕсли;

	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции 

// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024
Функция ОбработчикИзменения_ИзменитьИсполнителейВМаршрутахПСЦ(ДокументОбъект,Источник)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;   
	мСтатус = Новый Массив;
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.Новый);
	
	СтруктураРезультата = МаршрутизацияСервер.НайтиГотовыеКВыставлениюСтрокиВСделкахПоПСЦ(ДокументОбъект.Ссылка);
	Если СтруктураРезультата.МассивСделокВыставленныеДокументы.Количество() = 0 И СтруктураРезультата.МассивСделокГотовоКВыставлению.Количество() = 0 Тогда
		
		//ПараметрыЗапроса = МаршрутизацияСервер.ПолучитьПараметрыМаршрутизации(ДокументОбъект);
		//РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦ(ПараметрыЗапроса, ДокументОбъект.Дата);
		
		РезультатЗапроса = Новый Массив;
		Для каждого Стр из Источник.Состояния Цикл
			Статус = ?(РезультатЗапроса.Количество() = 0, Источник.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
			РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, ОтветственныйМенеджерПСЦ, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, Источник, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.ОтветственныйМенеджерПСЦ, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
		КонецЦикла;
		МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДокументОбъект.Дата, ДокументОбъект.Договор);
		МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДокументОбъект.Дата, ДокументОбъект.ВидПеревозки);
		
		ПроцессСогласования = СогласованиеСервер.ПолучитьПроцессСогласованияОбъекта(ДокументОбъект.Ссылка);
		обПроцессСогласования = Неопределено;
		Если ЗначениеЗаполнено(ПроцессСогласования.Ссылка) Тогда
			обПроцессСогласования = ПроцессСогласования.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаРезультат.Исполнитель) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("Состояние",СтрокаРезультат.Состояние);
			НайденныеСтроки = ДокументОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл	
					Если НайденнаяСтрока.Исполнитель <> СтрокаРезультат.Исполнитель Тогда
						Если мСтатус.Найти(НайденнаяСтрока.Статус) <> Неопределено Тогда
							
							Если ЗначениеЗаполнено(ПроцессСогласования.Ссылка) Тогда
								
								ВремТЧ = обПроцессСогласования.Состояния.Выгрузить();
								ВремТЧ.Сортировать("ШагЦикла УБЫВ, ЗавершениеРаботы УБЫВ");
								ПоследнееЗначениеЦикла = ВремТЧ[0].ШагЦикла;
								ТекущийЦикл = ПоследнееЗначениеЦикла;
								
								пПоиска = Новый Структура("Состояние,Исполнитель,ШагЦикла",СтрокаРезультат.Состояние,НайденнаяСтрока.Исполнитель,ТекущийЦикл);
								НайденныеСтроки = обПроцессСогласования.Состояния.НайтиСтроки(пПоиска);
								
								Для Каждого СтрокаСпр Из НайденныеСтроки Цикл
									СтрокаСпр.Исполнитель = СтрокаРезультат.Исполнитель;
								КонецЦикла;	
								
							КонецЕсли;
							
							НайденнаяСтрока.Исполнитель = СтрокаРезультат.Исполнитель;
							НеобходимаЗаписьОбъекта = Истина;	
							
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если НеобходимаЗаписьОбъекта Тогда
				Если ЗначениеЗаполнено(ПроцессСогласования.Ссылка) Тогда
					обПроцессСогласования.Записать();
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);
	
КонецФункции
// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. конец: 27.11.2024

// Евросиб US 91362 TA 104075 Рыбьяков К.А. 15.04.2025 ((
Функция ОбработчикИзменения_ДополнительныеРасходы(СделкаОбъект, РасчетДопРсходы = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	Попытка
		НеобходимаЗаписьОбъекта = Обработки.АРМДополнительныеРасходы.ДобавитьДоходыРасходыВСделку(СделкаОбъект, РасчетДопРсходы);
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
	КонецПопытки;
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции
// Евросиб Рыбьяков К.А. 15.04.2025 ))

// Евросиб US 88683 TA 108959 Рыбьяков К.А. 15.04.2025 ((
Функция ОбработчикИзменения_СделкаПоКлючуАналитикиНоминаций(СделкаОбъект, Источник = Неопределено)
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = "";
	НеобходимаЗаписьОбъекта = Ложь;
	
	Попытка
		
		НайденныеСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Контейнер, ВидТранспортногоСообщения", Источник.Контейнер, Перечисления.ВидыТранспортныхСообщений.ЖД));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если Источник.Сделка = СделкаОбъект.Ссылка Тогда
				РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.РелизСобственника, "Договор, Контрагент, ПСЦ");
				НайденныеСтроки[0].Доплата_Клиент = РеквизитыРелиза.Контрагент;
				НайденныеСтроки[0].Доплата_Договор = РеквизитыРелиза.Договор;
				НайденныеСтроки[0].Доплата_ПСЦ = РеквизитыРелиза.ПСЦ;
				НайденныеСтроки[0].Доплата_Калькуляция = Источник.Калькуляция;
				НайденныеСтроки[0].Доплата_Доплата = Источник.Ставка;
				НайденныеСтроки[0].Доплата_Валюта = Источник.Валюта;
				НайденныеСтроки[0].Доплата_РелизСобственника = Источник.РелизСобственника;
				НайденныеСтроки[0].Доплата_Пользователь = Источник.Редактор;
			Иначе
				Документы.Сделка.УдалитьДоходнуюСтрокуСвязаннуюСДоплатнымиДанными(СделкаОбъект, Источник.Контейнер);
				НайденныеСтроки[0].Доплата_Клиент = Неопределено;
				НайденныеСтроки[0].Доплата_Договор = Неопределено;
				НайденныеСтроки[0].Доплата_ПСЦ = Неопределено;
				НайденныеСтроки[0].Доплата_Калькуляция = Неопределено;
				НайденныеСтроки[0].Доплата_Доплата = Неопределено;
				НайденныеСтроки[0].Доплата_Валюта = Неопределено;
				НайденныеСтроки[0].Доплата_РелизСобственника = Неопределено;
				НайденныеСтроки[0].Доплата_Пользователь = Неопределено;
			КонецЕсли;
			НеобходимаЗаписьОбъекта = Истина;
		КонецЕсли;
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
	КонецПопытки;
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", НеобходимаЗаписьОбъекта, СделкаОбъект, Ошибка, СообщениеРезультатаВыполнения);

КонецФункции
// Евросиб Рыбьяков К.А. 15.04.2025 ))

//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025  
Функция ОбработчикИзменения_РелизКлиентаПоКлючуАналатикиПеревозки(РелизКлиентаСсылка)

	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", Истина, РелизКлиентаСсылка, "", "");

КонецФункции 

Функция ОбработчикИзменения_ПересчетНормативаКонтрибуцииВКалькуляции(ДокументОбъект,Источник) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;   
	
	Попытка
		
		ГУИДСтрокиНормативаКонтрибуции = ДокументОбъект.ГУИДСтрокиНормативыКонтрибуции;
		НормативнаяКонтрибуция = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьНормативнуюКонтрибуциюПоДокументу(ДокументОбъект.Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНормативовКонтрибуции.НормативнаяСтавка КАК НормативнаяСтавка
		|ИЗ
		|	РегистрСведений.СтавкиНормативовКонтрибуции КАК СтавкиНормативовКонтрибуции
		|ГДЕ
		|	СтавкиНормативовКонтрибуции.Регистратор = &Ссылка
		|	И СтавкиНормативовКонтрибуции.ГУИД = &ГУИД";
		
		Запрос.УстановитьПараметр("ГУИД", ГУИДСтрокиНормативаКонтрибуции);
		Запрос.УстановитьПараметр("Ссылка", Источник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.НормативнаяСтавка <> НормативнаяКонтрибуция Тогда
				РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьНормативнуюКонтрибуциюпоДокументу(ДокументОбъект.Ссылка, ВыборкаДетальныеЗаписи.НормативнаяСтавка);
			КонецЕсли;
		КонецЦикла;		
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
	КонецПопытки;
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
							 НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);
	
КонецФункции
						 
Функция  ОбработчикИзменения_ЗаполнениеУчетныхЕдиницИПунктовВПСЦПоставщика(ДокументОбъект, Источник) //Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	Ошибка = Ложь;
	СообщениеРезультатаВыполнения = ""; 
	НеобходимаЗаписьОбъекта = Ложь;   
	
	Попытка
		
		ВыборкаКоносамент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник,"СтанцияОтправления, СтанцияНазначения, Коносаменты, МестоПолученияГруза, МестоПоставкиГруза");
			
		Если ДокументОбъект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ ДокументОбъект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			
			Для Каждого СтрУслуги из ДокументОбъект.Услуги Цикл
				
				Если СтрУслуги.Коносамент <> Источник Тогда
					Продолжить;
				КонецЕсли;	
				
				Если СтрУслуги.ПунктОтправления <> ВыборкаКоносамент.СтанцияОтправления Тогда
					СтрУслуги.ПунктОтправления = ВыборкаКоносамент.СтанцияОтправления;
					
					СтрУслуги.ПунктОтправленияСтрана = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(СтрУслуги.ПунктОтправления, Перечисления.ТипыИерархииЛокации.Страна);
										
					Если Не ЗначениеЗаполнено(СтрУслуги.ПунктОтправления) Тогда
						ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
						СтрУслуги.ПунктОтправленияГород = ЛокацияПустаяСсылка;
						СтрУслуги.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
					КонецЕсли;
						
					НеобходимаЗаписьОбъекта = Истина;
				КонецЕсли;	
				Если СтрУслуги.ПунктНазначения <> ВыборкаКоносамент.СтанцияНазначения Тогда
					СтрУслуги.ПунктНазначения = ВыборкаКоносамент.СтанцияНазначения;
					
					СтрУслуги.ПунктНазначенияСтрана = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(СтрУслуги.ПунктНазначения, Перечисления.ТипыИерархииЛокации.Страна);
					
					Если Не ЗначениеЗаполнено(СтрУслуги.ПунктНазначения) Тогда
						ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
						СтрУслуги.ПунктНазначенияГород = ЛокацияПустаяСсылка;
						СтрУслуги.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
					КонецЕсли;
					
					НеобходимаЗаписьОбъекта = Истина;
				КонецЕсли;
				
				Если СтрУслуги.ТерминалОтправления <> ВыборкаКоносамент.МестоПолученияГруза Тогда
					СтрУслуги.ТерминалОтправления = ВыборкаКоносамент.МестоПолученияГруза;						
					НеобходимаЗаписьОбъекта = Истина;
				КонецЕсли;	
				Если СтрУслуги.ТерминалНазначения <> ВыборкаКоносамент.МестоПоставкиГруза Тогда
					СтрУслуги.ТерминалНазначения = ВыборкаКоносамент.МестоПоставкиГруза;					
					НеобходимаЗаписьОбъекта = Истина;
				КонецЕсли;
				
				СписокКТК = ВыборкаКоносамент.Коносаменты.Выгрузить().ВыгрузитьКолонку("НомерКТК");
				
				СтрокиДляВыгрузкиУЕ = ДокументОбъект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг",СтрУслуги.ИдентификаторСтрокиУслуг));
				
				СписокУчетныхЕдиниц = ДокументОбъект.УчетныеЕдиницы.Выгрузить(СтрокиДляВыгрузкиУЕ).ВыгрузитьКолонку("УчетнаяЕдиница");
				
				Если НЕ ОбщегоНазначения.КоллекцииИдентичны(СписокКТК, СписокУчетныхЕдиниц,,,Истина) Тогда
					
					НеобходимаЗаписьОбъекта = Истина;
					
					СтрУслуги.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.Построчно;
					
					УчетныеЕдиницы = СписокКТК;
					
					СтрокиКУдалению = Новый Массив;
					СтрокиУчетныхЕдиниц = ДокументОбъект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрУслуги.ИдентификаторСтрокиУслуг));
					Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
						ИндексНайденнойУчетнойЕдиницы =  ДокументОбъект.УчетныеЕдиницы.Найти(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
						Если ИндексНайденнойУчетнойЕдиницы = Неопределено Тогда
							СтрокиКУдалению.Добавить(СтрокаУчетнойЕдиницы);
						Иначе
							ДокументОбъект.УчетныеЕдиницы.Удалить(ИндексНайденнойУчетнойЕдиницы);
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого Стр Из СтрокиКУдалению Цикл
						ДокументОбъект.УчетныеЕдиницы.Удалить(Стр);
					КонецЦикла;
					
					Для Каждого УчетнаяЕдиница Из СписокКТК Цикл
						Если ЗначениеЗаполнено(УчетнаяЕдиница) Тогда
							СтрокаУчетнойЕдиницы = ДокументОбъект.УчетныеЕдиницы.Добавить();
							СтрокаУчетнойЕдиницы.ИдентификаторСтрокиУслуг = СтрУслуги.ИдентификаторСтрокиУслуг;
							СтрокаУчетнойЕдиницы.УчетнаяЕдиница = УчетнаяЕдиница;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НеобходимаЗаписьОбъекта Тогда
				Документы.ПСЦПоставщика.СоздатьСтрокиКритериевУслуг(ДокументОбъект);
			КонецЕсли;	
			
		КонецЕсли;
		
	Исключение
		СообщениеРезультатаВыполнения = ОписаниеОшибки();
		НеобходимаЗаписьОбъекта = Ложь;
		Ошибка = Истина;
	КонецПопытки;
	
	Возврат Новый Структура("НеобходимаЗаписьОбъекта, ЗаписываемыйОбъект, Ошибка, СообщениеРезультатаВыполнения", 
	НеобходимаЗаписьОбъекта, ДокументОбъект, Ошибка, СообщениеРезультатаВыполнения);	
КонецФункции

// Евросиб Рыбьяков К.А. 15.04.2025 ))

#КонецОбласти

Процедура ЗаполнитьЕслиЗаполнено(Приемник, Источник)
	Если ЗначениеЗаполнено(Источник) Тогда
		Приемник = Источник;
	КонецЕсли;
КонецПроцедуры
