
Процедура СозданиеСделок() Экспорт
	
	СозданиеСделокПоПлановомуОтправлениюРейса();
	
КонецПроцедуры

Процедура СозданиеСделокПоПлановомуОтправлениюРейса() Экспорт
	
	// рейсы не должны быть в сделках!
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыЖД.Ссылка КАК Ссылка,
		|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
		|	РейсыЖД.ПунктНазначения КАК ПунктНазначения,
		|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
		|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
		|	ЗаявкаПереченьРейсов.Ссылка КАК Заявка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
		|		ПО ЗаявкаПереченьРейсов.Рейс = РейсыЖД.Ссылка
		|ГДЕ
		|	РейсыЖД.ДатаОтправления МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ РейсыЖД.РейсОтменен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.ПунктОтправления КАК ПунктОтправления,
		|	ВТ.ПунктНазначения КАК ПунктНазначения,
		|	ВТ.ДатаОтправления КАК ДатаОтправления,
		|	ВТ.ДатаПрибытия КАК ДатаПрибытия,
		|	ВТ.Заявка КАК Заявка,
		|	СделкаРейсы.Ссылка КАК Сделка
		|ПОМЕСТИТЬ Итоговая
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
		|		ПО ВТ.Ссылка = СделкаРейсы.Рейс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итоговая.Ссылка КАК Ссылка,
		|	Итоговая.ПунктОтправления КАК ПунктОтправления,
		|	Итоговая.ПунктНазначения КАК ПунктНазначения,
		|	Итоговая.ДатаОтправления КАК ДатаОтправления,
		|	Итоговая.ДатаПрибытия КАК ДатаПрибытия,
		|	Итоговая.Заявка КАК Заявка,
		|	Итоговая.Сделка КАК Сделка
		|ИЗ
		|	Итоговая КАК Итоговая
		|ГДЕ
		|	ЕСТЬNULL(Итоговая.Сделка, 0) = 0
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач",ТекущаяДата()-1*3600*24);
	Запрос.УстановитьПараметр("ДатаКон",ТекущаяДата()+2*3600*24);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл

		///////////// Создать СДЕЛКУ ///////////////////
		НоваяСделка = Документы.Сделка.СоздатьДокумент();
		
		НоваяСделка.Дата = ТекущаяДата();
		НоваяСделка.Автор = Пользователи.ТекущийПользователь();
		//НоваяСделка.ЦФО = НоваяСделка.Автор.ЦФО;
		НоваяСделка.Создано = ТекущаяДата();
		//НоваяСделка.Организация = Константы.ОсновнаяОрганизация.Получить();
		НоваяСделка.Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
		НоваяСделка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
		НоваяСделка.ЖДОтправка = ВыборкаСсылка.Ссылка.ПунктОтправления;
		НоваяСделка.ЖДПрибытие = ВыборкаСсылка.Ссылка.ПунктНазначения;
		НоваяСделка.ПерваяОперация = ВыборкаСсылка.Ссылка.ДатаОтправления;
		НоваяСделка.ПоследняяОперация = ВыборкаСсылка.Ссылка.ДатаПрибытия;
		НоваяСделка.СтанцияОтправления = ВыборкаСсылка.Ссылка.ПунктОтправления;
		НоваяСделка.СтанцияНазначения = ВыборкаСсылка.Ссылка.ПунктНазначения;
		
		// добавить рейс в сделку
		ТЧРейсы = НоваяСделка.Рейсы.Добавить();
		ТЧРейсы.Рейс = ВыборкаСсылка.Ссылка;
		

		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСделка.Организация = ВыборкаДетальныеЗаписи.Заявка.Организация;
			НоваяСделка.Подразделение = ВыборкаДетальныеЗаписи.Заявка.Подразделение;
			//Евросиб - АСуслов 07.01.2021 13:37:59 #0213891 
			//(
			//НоваяСделка.ЦФО = ВыборкаДетальныеЗаписи.Заявка.ЦФО;
			НоваяСделка.ЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;
			//)
			//Евросиб - АСуслов 07.01.2021 13:38:00 #0213891 
			/////////////////////////////////////////////////
			
			// добавляем заявку и калькуляцию
			ТЧЗаявки = НоваяСделка.Заявки.Добавить();
			ТЧЗаявки.Заявка = ВыборкаДетальныеЗаписи.Заявка;
			Если ВыборкаДетальныеЗаписи.Заявка.СоставУслуги.Количество()>0 Тогда
				ТЧЗаявки.Калькуляция = ВыборкаДетальныеЗаписи.Заявка.СоставУслуги[0].Калькуляция;
				НоваяСделка.ТипЗаказа = ТЧЗаявки.Калькуляция.ТипЗаказа;
			Иначе
				НоваяСделка.ТипЗаказа = ?(ВыборкаДетальныеЗаписи.КП,Справочники.ТипыЗаказов.КонтейнерныйПоезд,Справочники.ТипыЗаказов.Прочее);
			КонецЕсли;
			
			// заполнить ТЧ СвязьУчетныхЕдиниц
			Для каждого Стр2 из ВыборкаДетальныеЗаписи.Заявка.СоставУслуги Цикл
				Если ЗначениеЗаполнено(Стр2.НомерКТК) ИЛИ ЗначениеЗаполнено(Стр2.Вагон) Тогда
					НСтр = НоваяСделка.СвязьУчетныхЕдиниц.Добавить();
					НСтр.Заявка = ВыборкаДетальныеЗаписи.Заявка;
					НСтр.Контейнер = Стр2.НомерКТК;
					НСтр.Клиент = ВыборкаДетальныеЗаписи.Заявка.Контрагент;
					НСтр.Договор = ВыборкаДетальныеЗаписи.Заявка.Договор;
					НСтр.Груз = Стр2.Груз;
					НСтр.УсловияПеревозки = Стр2.УсловияПеревозки;
					НСтр.УсловияПеревозкиНазначение = Стр2.УсловияПеревозкиНазначение;
					НСтр.Калькуляция = Стр2.Калькуляция;
					НСтр.РазмерКТК = Стр2.РазмерКТК;
					Если ЗначениеЗаполнено(Стр2.Калькуляция) тогда
						НСтр.Калькуляция = Стр2.Калькуляция;
					КонецЕсли;
					НСтр.Вагон = Стр2.Вагон;
					
					// Евросиб Фролов (26.12.2021 TASK №44663
					НСтр.ГУИДСтрокиЗаявки = Стр2.ГУИДСтроки;
					// Евросиб Фролов)
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		НоваяСделка.ФоновоеСоздание = Истина;
		
		НоваяСделка.Записать(РежимЗаписиДокумента.Запись);
		
		СохраненннаяСделкаОбъект = НоваяСделка.Ссылка.ПолучитьОбъект();
		доходы_ЗаполнитьПоЗаявкам2(СохраненннаяСделкаОбъект);

		Попытка
			СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СозданиеСделокПоРейсам(ТекРейс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыЖД.Ссылка КАК Ссылка,
		|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
		|	РейсыЖД.ПунктНазначения КАК ПунктНазначения,
		|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
		|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
		|	ЗаявкаПереченьРейсов.Ссылка КАК Заявка
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
		|		ПО ЗаявкаПереченьРейсов.Рейс = РейсыЖД.Ссылка
		|ГДЕ
		|	РейсыЖД.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ТекРейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл

		///////////// Создать СДЕЛКУ ///////////////////
		НоваяСделка = Документы.Сделка.СоздатьДокумент();
		
		НоваяСделка.Дата = ТекущаяДата();
		НоваяСделка.Заполнить(Неопределено);
		
		НоваяСделка.ЖДОтправка = ВыборкаСсылка.Ссылка.ПунктОтправления;
		НоваяСделка.ЖДПрибытие = ВыборкаСсылка.Ссылка.ПунктНазначения;
		НоваяСделка.ПерваяОперация = ВыборкаСсылка.Ссылка.ДатаОтправления;
		НоваяСделка.ПоследняяОперация = ВыборкаСсылка.Ссылка.ДатаПрибытия;
		НоваяСделка.СтанцияОтправления = ВыборкаСсылка.Ссылка.ПунктОтправления;
		НоваяСделка.СтанцияНазначения = ВыборкаСсылка.Ссылка.ПунктНазначения;
		
		// добавить рейс в сделку
		ТЧРейсы = НоваяСделка.Рейсы.Добавить();
		ТЧРейсы.Рейс = ВыборкаСсылка.Ссылка;
		

		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСделка.Организация = ВыборкаДетальныеЗаписи.Заявка.Организация;
			НоваяСделка.Подразделение = ВыборкаДетальныеЗаписи.Заявка.Подразделение;
			//Евросиб - АСуслов 07.01.2021 13:37:59 #0213891 
			//(
			//НоваяСделка.ЦФО = ВыборкаДетальныеЗаписи.Заявка.ЦФО;
			НоваяСделка.ЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;
			//)
			//Евросиб - АСуслов 07.01.2021 13:38:00 #0213891 
			/////////////////////////////////////////////////
			
			// добавляем заявку и калькуляцию
			ТЧЗаявки = НоваяСделка.Заявки.Добавить();
			ТЧЗаявки.Заявка = ВыборкаДетальныеЗаписи.Заявка;
			Если ВыборкаДетальныеЗаписи.Заявка.СоставУслуги.Количество()>0 Тогда
				ТЧЗаявки.Калькуляция = ВыборкаДетальныеЗаписи.Заявка.СоставУслуги[0].Калькуляция;
				НоваяСделка.ТипЗаказа = ТЧЗаявки.Калькуляция.ТипЗаказа;
			Иначе
				НоваяСделка.ТипЗаказа = ?(ВыборкаДетальныеЗаписи.КП,Справочники.ТипыЗаказов.КонтейнерныйПоезд,Справочники.ТипыЗаказов.Прочее);
			КонецЕсли;
			
			// заполнить ТЧ СвязьУчетныхЕдиниц
			Для каждого Стр2 из ВыборкаДетальныеЗаписи.Заявка.СоставУслуги Цикл
				Если ЗначениеЗаполнено(Стр2.НомерКТК) ИЛИ ЗначениеЗаполнено(Стр2.Вагон) Тогда
					НСтр = НоваяСделка.СвязьУчетныхЕдиниц.Добавить();
					НСтр.Заявка = ВыборкаДетальныеЗаписи.Заявка;
					НСтр.Контейнер = Стр2.НомерКТК;
					НСтр.Клиент = ВыборкаДетальныеЗаписи.Заявка.Контрагент;
					НСтр.Договор = ВыборкаДетальныеЗаписи.Заявка.Договор;
					НСтр.Груз = Стр2.Груз;
					НСтр.УсловияПеревозки = Стр2.УсловияПеревозки;
					НСтр.УсловияПеревозкиНазначение = Стр2.УсловияПеревозкиНазначение;
					НСтр.Калькуляция = Стр2.Калькуляция;
					НСтр.РазмерКТК = Стр2.РазмерКТК;
					Если ЗначениеЗаполнено(Стр2.Калькуляция) тогда
						НСтр.Калькуляция = Стр2.Калькуляция;
					КонецЕсли;
					НСтр.Вагон = Стр2.Вагон;
					
					// Евросиб Фролов (26.12.2021 TASK №44663
					НСтр.ГУИДСтрокиЗаявки = Стр2.ГУИДСтроки;
					// Евросиб Фролов)
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Попытка
			НоваяСделка.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НоваяСделка.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		СохраненннаяСделкаОбъект = НоваяСделка.Ссылка.ПолучитьОбъект();
		доходы_ЗаполнитьПоЗаявкам2(СохраненннаяСделкаОбъект);

		Попытка
			СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура доходы_ЗаполнитьПоЗаявкам2(НоваяСделка)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НоваяСделка.Организация);
	ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НоваяСделка.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	ВыгрТЧ = НоваяСделка.СвязьУчетныхЕдиниц.Выгрузить();
	ВыгрТЧ.Колонки.Добавить("ПСЦ", Новый ОписаниеТипов("ДокументСсылка.ПСЦ"));
	Для каждого Стр из ВыгрТЧ Цикл
		Стр.ПСЦ = СТр.Заявка.ПСЦ;
	КонецЦикла;
	
	// выборка "особых" контрагентов (у которых фин доки формируются по-особому)
	ЗапросК = Новый Запрос;
	ЗапросК.Текст = "ВЫБРАТЬ
	                |	ФормированиеФинДокументов.Контрагент КАК Контрагент
	                |ИЗ
	                |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	                |ГДЕ
	                |	 НЕ ФормированиеФинДокументов.ПометкаУдаления";
	МассивКонтраг = ЗапросК.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	// вводится группировка по реестру клиента. если заполнение ведется по особым клиентам, то
	// идет детализация до вагона/контейнера. Если обычные клиенты, то номера вагонов/контейнеров не нужны,
	// поэтому это будут пустые строки, чтобы результат запроса "свернуть" по ключевым полям.
	// признаком обычного или нет расчета является заполненность поля реестр клиента и наличие клиента в массиве клиентов.
	// интересуют только те записи, у которых флаг НеАктивна НЕ стоит
	////////// ВНИМАНИЕ!!!!!!!!!!!! Запрос не откроется конструктором, т.к. в отборе присутствуют обращения к полям через точку от калькуляции (например, ВТ.Калькуляция.СтавкаНДС)
	// Чтобы открыть конструктором нужно закомментировать поля вида "ВТ.Калькуляция.СтавкаНДС"
	
	//И ВыгрТЧ.УчастокПеревозки <> ЗНАЧЕНИЕ(Перечисление.УчастокПеревозки.ПодсылКонтейнеров)
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ВыгрТЧ.Калькуляция КАК Калькуляция,
					|	ВыгрТЧ.ПСЦ КАК ПСЦ,
	                |	ВыгрТЧ.Клиент КАК Клиент,
	                |	ВыгрТЧ.Договор КАК Договор,
	                |	ВыгрТЧ.Контейнер КАК Контейнер,
	                |	ВыгрТЧ.Вагон КАК Вагон,
	                |	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
					|	ВыгрТЧ.УчастокПеревозки КАК УчастокПеревозки,
	                |	ВыгрТЧ.Груз КАК Груз
	                |ПОМЕСТИТЬ ВТ
	                |ИЗ
	                |	&ВыгрТЧ КАК ВыгрТЧ
	                |ГДЕ
	                |	НЕ ВыгрТЧ.НеАктивна 
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	                |	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
	                |	СУММА(ВЫБОР КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """" И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент) ТОГДА 1 Иначе 0 КОНЕЦ) КАК ЛишниеДанные
	                |ПОМЕСТИТЬ ТекЗаявка
	                |ИЗ
	                |	Документ.Сделка.Заявки КАК СделкаЗаявки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	                |		ПО СделкаЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	                |ГДЕ
	                |	СделкаЗаявки.Ссылка = &Ссылка
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаявкаСоставУслуги.НомерКТК,
					|	ЗаявкаСоставУслуги.РеестрКлиента
	                |ИМЕЮЩИЕ 
	                |	СУММА(ВЫБОР КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """" И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент) ТОГДА 1 Иначе 0 КОНЕЦ)=0
					|;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ.Калькуляция КАК Калькуляция,
	                |	ВТ.Клиент КАК Клиент,
	                |	ВТ.ПСЦ КАК ПСЦ,
	                |	ВТ.Договор КАК Договор,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Контейнер
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК Контейнер,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ТекЗаявка.РеестрКлиента
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК РеестрКлиента,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Вагон
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК Вагон,
	                |	СУММА(ВЫБОР
	                |			КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |					ИЛИ ВТ.Клиент В (&Клиент)
	                |				ТОГДА 0
	                |			ИНАЧЕ 1
	                |		КОНЕЦ) КАК ОбычныйРасчет,
	                |	ВТ.РазмерКТК КАК РазмерКТК,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоСебестоимость20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСебестоимость КОНЕЦ) КАК Себестоимость,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоВознаграждение20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоВознаграждение КОНЕЦ) КАК Вознаграждение,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоСтавка20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСтавка КОНЕЦ) КАК Ставка,
	                |	ВТ.Калькуляция.СтавкаНДС КАК СтавкаНДС,
	                |	ВТ.Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	                |	ВТ.Калькуляция.Валюта КАК Валюта,
					|	ВТ.УчастокПеревозки,
	                |	ВТ.Груз КАК Груз
	                |	ПОМЕСТИТЬ Итоговая
	                |ИЗ
	                |	ВТ КАК ВТ
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекЗаявка КАК ТекЗаявка
	                |		ПО ВТ.Контейнер = ТекЗаявка.НомерКТК
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ.Калькуляция,
						                |	ВТ.УчастокПеревозки,
	                |	ВТ.Клиент,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Вагон
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ВТ.Договор,
	                |	ВТ.ПСЦ,
	                |	ВТ.Груз,
	                |	ВТ.Калькуляция.СтавкаНДС,
	                |	ВТ.Калькуляция.СуммаВключаетНДС,
	                |	ВТ.Калькуляция.Валюта,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Контейнер
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ВТ.РазмерКТК,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ТекЗаявка.РеестрКлиента
	                |		ИНАЧЕ """"
	                |	КОНЕЦ
					|;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Итоговая.Калькуляция КАК Калькуляция,
	                |	Итоговая.Клиент КАК Клиент,
	                |	Итоговая.Договор КАК Договор,
					|	Итоговая.УчастокПеревозки КАК УчастокПеревозки,
	                |	Итоговая.ПСЦ КАК ПСЦ,
	                |	Итоговая.Контейнер КАК Контейнер,
	                |	Итоговая.РеестрКлиента КАК РеестрКлиента,
	                |	Итоговая.Вагон КАК Вагон,
	                |	Итоговая.ОбычныйРасчет КАК ОбычныйРасчет,
	                |	Итоговая.РазмерКТК КАК РазмерКТК,
	                |	Итоговая.Себестоимость КАК Себестоимость,
	                |	Итоговая.Вознаграждение КАК Вознаграждение,
	                |	Итоговая.Ставка КАК Ставка,
	                |	Итоговая.СтавкаНДС КАК СтавкаНДС,
	                |	Итоговая.СуммаВключаетНДС КАК СуммаВключаетНДС,
	                |	Итоговая.Валюта КАК Валюта,
	                |	Итоговая.Груз КАК Груз
	                |ИЗ
	                |	Итоговая КАК Итоговая
	                |	 
	                |ИТОГИ ПО
	                |	РеестрКлиента";
	
	Запрос2.УстановитьПараметр("Клиент", МассивКонтраг);
	Запрос2.УстановитьПараметр("Ссылка", НоваяСделка.Ссылка);
	Запрос2.УстановитьПараметр("ВыгрТЧ", ВыгрТЧ);
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	ВыборкаРеестрКлиента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРеестрКлиента.Следующий() Цикл
		// если по выборке это НЕ обычный (=0) и номер реестра не заполнен, то данные по доходам/расходам в сделку не вносить.
		// для "особых" клиентов должен быть заполнен номер реестра в заявке, чтобы можно было по нему группировать
		Если ВыборкаРеестрКлиента.ОбычныйРасчет = 0 И
			(ВыборкаРеестрКлиента.РеестрКлиента = "" ИЛИ ВыборкаРеестрКлиента.РеестрКлиента = null) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаРеестрКлиента.Выбрать();
		///////////////////// доходная часть ////////////////////////////
		// Если это расчет для особых клиентов, тогда добавлять строки нужно один раз. 
		// для контроля используем проверку ДанныеДобавлены
		ДанныеДобавлены = Ложь;
		Если НЕ ВыборкаРеестрКлиента.РеестрКлиента = "" Тогда
			СписокКТК = "";
			СписокВагонов = "";
			Колво = 0;
			
			НСтр = НоваяСделка.Доходы.Добавить(); 
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
		КонецЕсли;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаРеестрКлиента.РеестрКлиента = "" Тогда
				СписокКТК = "";
				СписокВагонов = "";
				Колво = 0;
				НСтр = НоваяСделка.Доходы.Добавить(); 
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			КонецЕсли;
			// после первого добавления меняем признак ДанныеДобавлены на Истина, чтобы больше в этот блок не заходить 
			// (для особых клиентов, для обычных - заполняем)
			Если (НЕ ДанныеДобавлены И ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0) ИЛИ
				НЕ ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 Тогда
				ЗаполнитьЗначенияСвойств(НСтр,ВыборкаДетальныеЗаписи);
				// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( 
				НСтр.Услуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Калькуляция, "ОсновнаяУслуга");
				//НСтр.Услуга = ВыборкаДетальныеЗаписи.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
				// Евросиб Рыбьяков К.А. 02.07.2024 ))	
				НСтр.Перевыставляемая = НСтр.Услуга.Перевыставляемая;
				НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
				ДанныеДобавлены = Истина;
			КонецЕсли;
			// для обычного расчета (когда клиенты не входят в справочник ФормированиеФинДокументов) номера вагонов и контейнров
			// возьмем из ТЧ СвязьУчетныхЕдиниц по отбору из основного запроса.
			Если НЕ ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 Тогда
				ПараметрыОтбора = Новый Структура("Клиент, Договор, Груз, Калькуляция, РазмерКТК", ВыборкаДетальныеЗаписи.Клиент, ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Груз, ВыборкаДетальныеЗаписи.Калькуляция, ВыборкаДетальныеЗаписи.РазмерКТК);
				Для каждого СтрСоставПоезда из НоваяСделка.СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыОтбора) Цикл
					//Если СтрСоставПоезда.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров Тогда Продолжить; КонецЕсли;
					СписокКТК = СписокКТК + ?(СписокКТК = "", "", ";") + СтрСоставПоезда.Контейнер.Наименование;
					СписокВагонов = СписокВагонов + ?(СписокВагонов = "", "", ";") + СтрСоставПоезда.Вагон.Наименование;
					
					
					НСтр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(НоваяСделка.ТипЗаказа, СтрСоставПоезда.Вагон);
					НСтр.Количество = НСтр.Количество + 1;
				КонецЦикла;
				// добавляем строки в таблицы ДоходыВагоны и ДоходыКТК
				Если ЗначениеЗаполнено(СписокВагонов) Тогда
					НСтр_Ваг = НоваяСделка.ДоходыВагоны.Добавить();
					НСтр_Ваг.ГУИД = НСтр.ГУИД;
					НСтр_Ваг.Вагон = СписокВагонов;
				КонецЕсли;
				Если ЗначениеЗаполнено(СписокКТК) Тогда
					НСтр_КТК = НоваяСделка.ДоходыКТК.Добавить();
					НСтр_КТК.ГУИД = НСтр.ГУИД;
					НСтр_КТК.КТК = СписокКТК;
				КонецЕсли;
				// для особого расчета данные по КТК и вагонам есть в самом результате запроса
				// Себестоимость и вознаграждение разделить на количество контейнеров
				НСтр.Себестоимость = НСтр.Себестоимость/?(ЗначениеЗаполнено(НСтр.Количество),НСтр.Количество,1);
				НСтр.Вознаграждение = НСтр.Вознаграждение/?(ЗначениеЗаполнено(НСтр.Количество),НСтр.Количество,1);
				НСтр.Ставка = НСтр.Ставка/?(ЗначениеЗаполнено(НСтр.Количество),НСтр.Количество,1);
				НСтр.Подсыл = (ВыборкаДетальныеЗаписи.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров);
			Иначе	
				НСтр.Подсыл = (ВыборкаДетальныеЗаписи.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров);
				
				СписокВагонов = СписокВагонов + ?(СписокВагонов = "", "", ";") + ВыборкаДетальныеЗаписи.Вагон;

				СписокКТК = СписокКТК + ?(СписокКТК = "", "", ";") + ВыборкаДетальныеЗаписи.Контейнер;
				
				НСтр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(НоваяСделка.ТипЗаказа, ВыборкаДетальныеЗаписи.Вагон);
				Колво = Колво + 1;
			КонецЕсли;
			// для особого расчета итого по КТК ндо выдавать за пределами детальных записей, т.к. идет суммирование по результату запроса,
			// а не отбором по таблице СвязьУчетныхЕдиниц как в случае обычного расчета
			Если ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 Тогда
				// добавляем строки в таблицы ДоходыВагоны и ДоходыКТК
				Если ЗначениеЗаполнено(СписокВагонов) Тогда
					НСтр_Ваг = НоваяСделка.ДоходыВагоны.Добавить();
					НСтр_Ваг.ГУИД = НСтр.ГУИД;
					НСтр_Ваг.Вагон = СписокВагонов;
				КонецЕсли;
				Если ЗначениеЗаполнено(СписокКТК) Тогда
					НСтр_КТК = НоваяСделка.ДоходыКТК.Добавить();
					НСтр_КТК.ГУИД = НСтр.ГУИД;
					НСтр_КТК.КТК = СписокКТК;
				КонецЕсли;
				НСтр.Количество = Колво;
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЦикла;
	
	//////////////// ЗАПРОС ДЛЯ РАСХОДОВ ////////////////
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыгрТЧ.Калькуляция КАК Калькуляция,
				   //|	ВыгрТЧ.СписокКТК КАК СписокКТК,
				   //|	ВыгрТЧ.СписокВагонов КАК СписокВагонов,
	               |	ВыгрТЧ.Количество КАК Количество,
	               |	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
	               |	ВыгрТЧ.Подсыл КАК Подсыл,
				   //|	ВыгрТЧ.СписокТД КАК СписокТД,
	               |	ВыгрТЧ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	ВыгрТЧ.Груз КАК Груз,
	               |	ВыгрТЧ.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВыгрТЧ КАК ВыгрТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Поставщик КАК Поставщик,
	               |	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Договор КАК Договор,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Цена20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Цена40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта КАК Валюта,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Контрагент КАК море20_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Себестоимость КАК море20_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Контрагент КАК море40_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Себестоимость КАК море40_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	               |	ВТ.Количество КАК Количество,
				   //|	ВТ.СписокКТК КАК СписокКТК,
				   //|	ВТ.СписокВагонов КАК СписокВагонов,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.Перевыставляемая КАК Перевыставляемая,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40
	               |	КОНЕЦ КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40
	               |	КОНЕЦ * ВТ.Количество КАК ВознаграждениеИтого,
				   //|	ВТ.СписокТД КАК СписокТД,
	               |	ВТ.Груз КАК Груз,
				   |	ВТ.Подсыл КАК Подсыл,
	               |	ВТ.ГУИД КАК ГУИДДоход,
	               |	ВТ.РазмерКТК КАК РазмерКТК
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	               |		ПО ВТ.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	               |ИТОГИ ПО
	               |	ГУИДДоход";
	
	ВыгрТЧДоходы =  НоваяСделка.Доходы.Выгрузить();
	
	
	Запрос.УстановитьПараметр("ВыгрТЧ", ВыгрТЧДоходы);
	РЗ = Запрос.Выполнить();
	ОтветГУИДДоход = РЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// потом расходы 1.3

	Пока ОтветГУИДДоход.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ОтветГУИДДоход.Выбрать();
		
		// чтобы фрахт не добавлялся несколько раз, добавим признак, что он уже добавлен в рамках данного цикла
		ФрахтДобавлен = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НСтр2 = НоваяСделка.Расходы.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр2,ВыборкаДетальныеЗаписи);
			НСтр2.ГУИД = Строка(Новый УникальныйИдентификатор);
			НСтр2.ПериодВО = ГлобальныйОткрытыйПериод;
			НСтр2.Регламентный = Истина;
			НСТр2.НоменклатурнаяГруппа = ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа;
			
			
			НСтр5 = НоваяСделка.СвязьДоходовИРасходов.Добавить();
			НСтр5.Доходы = ВыборкаДетальныеЗаписи.ГУИДДоход;
			НСтр5.Расходы = НСтр2.ГУИД;
			
			// теперь расходы фрахт
			Если ФрахтДобавлен = Ложь И 
							((ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20 
											И ВыборкаДетальныеЗаписи.море20_Себестоимость > 0) 
							ИЛИ (ВыборкаДетальныеЗаписи.РазмерКТК <> Справочники.РазмерыКТК.К20 
											И ВыборкаДетальныеЗаписи.море40_Себестоимость > 0)) Тогда
				
				НСтр3 = НоваяСделка.Расходы.Добавить();
				НСтр3.Регламентный = Истина;
				НСтр3.ГУИД = Строка(Новый УникальныйИдентификатор);
				НСтр3.Поставщик = ?(ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20, ВыборкаДетальныеЗаписи.Калькуляция.море20_Контрагент, ВыборкаДетальныеЗаписи.Калькуляция.море40_Контрагент);
				УслугаФрахта = Константы.УслугаФрахтаДляКалькуляции.Получить();
				НСтр3.Услуга = УслугаФрахта;
				НСтр3.Перевыставляемая = НСтр3.Услуга.Перевыставляемая;
				НСтр3.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
				НСтр3.Себестоимость = ?(ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20, ВыборкаДетальныеЗаписи.Калькуляция.море20_Себестоимость, ВыборкаДетальныеЗаписи.Калькуляция.море40_Себестоимость);
				НСтр3.ВознаграждениеИтого = ВыборкаДетальныеЗаписи.Калькуляция.море20_Вознаграждение * ВыборкаДетальныеЗаписи.Количество;
				НСтр3.Количество = ВыборкаДетальныеЗаписи.Количество;
				НСтр3.Груз = ВыборкаДетальныеЗаписи.Груз;
				НСтр3.СписокКТК = ВыборкаДетальныеЗаписи.СписокКТК;
				НСтр3.ПериодВО = ГлобальныйОткрытыйПериод;
				НСтр3.Валюта = ВыборкаДетальныеЗаписи.ММ_ВалютаФрахтовыхСтавок;
				
				НСтр4 = НоваяСделка.СвязьДоходовИРасходов.Добавить();
				НСтр4.Доходы = ВыборкаДетальныеЗаписи.ГУИДДоход;
				НСтр4.Расходы = НСтр3.ГУИД;
				
				ФрахтДобавлен = Истина;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура СозданиеЗакрытияПериода() Экспорт
	СозданиеЗакрытияПериодаЗаПредыдущийМесяц();	
КонецПроцедуры

Процедура СозданиеЗакрытияПериодаЗаПредыдущийМесяц() Экспорт
	
	// получить данные по производственному календарю
	ПрКалендарь = ПостроительТСх_сервер.ПодобратьПроизводственныйКалендарь(Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	ВЫБОР
	               |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	               |				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РабочийДень,
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
	               |ПОМЕСТИТЬ Вт1
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	               |	И ДанныеПроизводственногоКалендаря.Дата > &ДатаНач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 4
	               |	Вт1.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	Вт1.РабочийДень КАК РабочийДень,
	               |	Вт1.Дата КАК Дата
	               |ИЗ
	               |	Вт1 КАК Вт1
	               |ГДЕ
	               |	Вт1.РабочийДень <> 0
				   |УПОРЯДОЧИТЬ ПО
				   |	Дата";
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь",ПрКалендарь);
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(ТекущаяДата()));

	ТЗ = Запрос.Выполнить().Выгрузить();
	// сортируем в обратном порядке, чтобы получить нужную дату
	ТЗ.Сортировать("Дата УБЫВ");
	Если ТЗ.Количество()>0 Тогда
		ШестойРабочийДень = ТЗ[0].Дата;
		// если дни совпали, создаем заготовку документа ЗакрытиеПериода
		Если НачалоДня(ШестойРабочийДень) = НачалоДня(ТекущаяДата()) Тогда
			НовДок = Документы.ЗакрытиеПериода.СоздатьДокумент();
			НовДок.Дата = ТекущаяДата();
			НовДок.Маршрутизировать = Константы.МаршрутизироватьЗакрытиеПериода.Получить();
			НовДок.Автор = Пользователи.ТекущийПользователь();
			НовДок.ЦФО = НовДок.Автор.ЦФО;
			НовДок.Создано = ТекущаяДата();
			НовДок.Организация = Константы.ОсновнаяОрганизация.Получить();
			
			НСтр = НовДок.РеглОперации.Добавить();
			НСтр.Операция = "Снятие с мониторинга СПАРК контрагентов, по которым не было движений " + Константы.СрокМесяцевСнятияКонтрагентовСМониторинга.Получить() + " мес.";
			НСтр.КодОперации = "01";
			
			НСтр = НовДок.РеглОперации.Добавить();
			НСтр.Операция = "Постановка на мониторинг СПАРК контрагентов, по которым появились движения";
			НСтр.КодОперации = "02";
			
			НСтр = НовДок.РеглОперации.Добавить();
			НСтр.Операция = "Обновление индексов СПАРК по контрагентам на мониторинге";
			НСтр.КодОперации = "03";
			
			НСтр = НовДок.РеглОперации.Добавить();
			НСтр.Операция = "Расчет плановой категории контрагентов";
			НСтр.КодОперации = "05";
			
			НовДок.ПериодБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
			
			ЗаполнитьДвиженияНаСервере(НовДок);
			
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнитьДвиженияНаСервере(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗакрытиеПериодовОстатки.ПланФакт КАК ПланФакт,
	               |	ЗакрытиеПериодовОстатки.ПериодВО КАК ПериодВО,
	               |	ЗакрытиеПериодовОстатки.Корректировка КАК Корректировка,
	               |	ЗакрытиеПериодовОстатки.Сделка КАК Сделка,
	               |	ЗакрытиеПериодовОстатки.Услуга КАК Услуга,
	               |	ЗакрытиеПериодовОстатки.Контрагент КАК Контрагент,
	               |	ЗакрытиеПериодовОстатки.Договор КАК Договор,
	               |	ЗакрытиеПериодовОстатки.ГУИДСтроки КАК ГУИДСтроки,
	               |	ЗакрытиеПериодовОстатки.ГУИДДоходов КАК ГУИДДоходов,
	               |	ЗакрытиеПериодовОстатки.Организация КАК Организация,
	               |	ЗакрытиеПериодовОстатки.СуммаДоходаОстаток КАК СуммаДоходаОстаток,
	               |	ЗакрытиеПериодовОстатки.СуммаРасходаОстаток КАК СуммаРасходаОстаток,
	               |	ЗакрытиеПериодовОстатки.СуммаНДСДоходаОстаток КАК СуммаНДСДоходаОстаток,
	               |	ЗакрытиеПериодовОстатки.СуммаНДСРасходаОстаток КАК СуммаНДСРасходаОстаток,
	               |	ЗакрытиеПериодовОстатки.Перевыставляемая КАК Перевыставляемая
	               |ИЗ
	               |	РегистрНакопления.ЗакрытиеПериодов.Остатки(&Период, Организация = &Организация) КАК ЗакрытиеПериодовОстатки";
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.ПериодБлокировки));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр 					= Объект.ДвиженияПериода.Добавить();
		НСтр.ПланФакт 			= Ответ.ПланФакт;
		НСтр.ПериодВО 			= Ответ.ПериодВО;
		НСтр.Корректировка 		= Ответ.Корректировка;
		НСтр.Сделка 			= Ответ.Сделка;
		НСтр.Услуга 			= Ответ.Услуга;
		НСтр.Контрагент 		= Ответ.Контрагент;
		НСтр.Договор			= Ответ.Договор;
		НСтр.ГУИДСтроки 		= Ответ.ГУИДСтроки;
		НСтр.ГУИДДоходов 		= Ответ.ГУИДДоходов;
		НСтр.СуммаДохода		= Ответ.СуммаДоходаОстаток;
		НСтр.СуммаНДСДохода		= Ответ.СуммаНДСДоходаОстаток;
		НСтр.СуммаРасхода		= Ответ.СуммаРасходаОстаток;
		НСтр.СуммаНДСРасхода	= Ответ.СуммаНДСРасходаОстаток;
		НСтр.Перевыставляемая	= Ответ.Перевыставляемая;
		Объект.ОбщийДоход 		= Объект.ОбщийДоход + Ответ.СуммаДоходаОстаток;
		Объект.ОбщийРасход	 	= Объект.ОбщийРасход + Ответ.СуммаРасходаОстаток;
		Если НЕ НСтр.Перевыставляемая Тогда
			Объект.ОбщийДоходБезВУ 		= Объект.ОбщийДоходБезВУ + Ответ.СуммаДоходаОстаток;
			Объект.ОбщийРасходБезВУ	 	= Объект.ОбщийРасходБезВУ + Ответ.СуммаРасходаОстаток;
		КонецЕсли;
	КонецЦикла;
	Доход = Объект.ОбщийДоход - Объект.ОбщийРасход;
	
	Попытка
		//Объект.Записать(РежимЗаписиДокумента.Проведение);
		Объект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
		

КонецПроцедуры

