
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокОтклонений") Тогда
		СписокРасхождений.Загрузить(Параметры.СписокОтклонений.Выгрузить());		
	КонецЕсли;
	Если Параметры.Свойство("СтатьяРасхождений") Тогда
		СтатьяРасхождений = Параметры.СтатьяРасхождений;		
	КонецЕсли;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СтатьяРасхождений = "Несоблюдение сроков" Тогда
		Элементы.СписокРасхожденийДатыОпераций.Видимость = Истина;
		Элементы.СписокРасхожденийСуммы.Видимость = Ложь;
		Элементы.СписокРасхожденийМаршрут.Видимость = Ложь;
		Элементы.СписокРасхожденийОперации.Видимость = Ложь;
	ИначеЕсли СтатьяРасхождений = "Несоблюдение цены" Тогда
		Элементы.СписокРасхожденийДатыОпераций.Видимость = Ложь;
		Элементы.СписокРасхожденийСуммы.Видимость = Истина;
		Элементы.СписокРасхожденийМаршрут.Видимость = Ложь;
		Элементы.СписокРасхожденийОперации.Видимость = Ложь;
	ИначеЕсли СтатьяРасхождений = "Несоблюдение маршрута" Тогда
		Элементы.СписокРасхожденийДатыОпераций.Видимость = Ложь;
		Элементы.СписокРасхожденийСуммы.Видимость = Ложь;
		Элементы.СписокРасхожденийМаршрут.Видимость = Истина;
		Элементы.СписокРасхожденийОперации.Видимость = Ложь;
	ИначеЕсли СтатьяРасхождений = "Несоблюдение операции" Тогда
		Элементы.СписокРасхожденийДатыОпераций.Видимость = Ложь;
		Элементы.СписокРасхожденийСуммы.Видимость = Ложь;
		Элементы.СписокРасхожденийМаршрут.Видимость = Ложь;
		Элементы.СписокРасхожденийОперации.Видимость = Истина;
	КонецЕсли;
	
	Элементы.СписокРасхождений.ОтборСтрок = Новый ФиксированнаяСтруктура("СтатьяРасхождений", СтатьяРасхождений);
	
КонецПроцедуры
