
&НаКлиенте
Процедура ПрочитатьДанныеMAERSK(Команда)
	ТЧ.Очистить();
	ПрочитатьДанныеMAERSKНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеMAERSKНаСервере()
	
	Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_SCHEDULE(ПунктОтправления.ИдентификаторMAERSK, ПунктНазначения.ИдентификаторMAERSK);
	ЧТДЖ = Новый ЧтениеJSON();
	ЧТДЖ.УстановитьСтроку(Результат);
	РЕЗ = ПрочитатьJSON(ЧТДЖ);
	Для каждого стр из РЕЗ.products Цикл
		Для каждого стр2 из стр.schedules Цикл
			
			НСтр = ТЧ.Добавить();
			НСтр.ПродуктИД = стр.productId;
			НСтр.ДатаОтправления = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(""+стр2.fromLocation.date+стр2.fromLocation.time, 1);
			НСтр.ПунктОтправленияКод = стр2.fromLocation.siteGeoId;
			НСтр.ПунктОтправления = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктОтправленияКод); //Справочники.Локации.НайтиПоРеквизиту("ИдентификаторMAERSK", НСтр.ПунктОтправленияКод);
			
			Для каждого стр3 из стр2.scheduleDetails Цикл
				Если ЗначениеЗаполнено(стр3.transport.voyageNumber) Тогда
					НСтр.НомерРейса = стр3.transport.voyageNumber;
				КонецЕсли;
			КонецЦикла;
			
			НСтр.ДатаПрибытия = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(""+стр2.toLocation.date+стр2.toLocation.time, 1);
			НСтр.ПунктНазначенияКод = стр2.toLocation.siteGeoId;
			НСтр.ПунктНазначения = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктНазначенияКод); //Справочники.Локации.НайтиПоРеквизиту("ИдентификаторMAERSK", НСтр.ПунктОтправленияКод);
			
			НСтр.ТранзитноеВремя = Число(стр2.transitTime);
			
			НСтр.СудноКод = стр2.vessel.code;
			НСтр.Судно = ЗагрузкаВнешнихИсточников_сервер.ПолучитьТСПоИдентификаторуMAERSK(НСтр.СудноКод);
			
			НСтр.Рейс = НайтиРейс(НСтр.ДатаОтправления, НСтр.Судно);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРейс(ДатаОтправления, Судно)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РейсыМоре.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.РейсыМоре КАК РейсыМоре
	                      |ГДЕ
	                      |	РейсыМоре.ДатаОтправления = &ДатаОтправления
	                      |	И РейсыМоре.Судно = &Судно
	                      |	И НЕ РейсыМоре.ПометкаУдаления");
	Запрос.УстановитьПараметр("Судно", Судно);
	Запрос.УстановитьПараметр("ДатаОтправления", ДатаОтправления);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьДанныеРейсов(Команда)
	ЗаписатьДанныеРейсовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеРейсовНаСервере()
	
	Сч = 0;
	
	Для каждого Стр из ТЧ Цикл
		
		РейсОбъект = Справочники.РейсыМоре.СоздатьЭлемент();
		Если ЗначениеЗаполнено(Стр.Рейс) Тогда
			РейсОбъект = Стр.Рейс.ПолучитьОбъект();
		КонецЕсли;
		
		РейсОбъект.Наименование = ?(РейсОбъект.Наименование = "", ""+Формат(Стр.ДатаОтправления, "ДФ=dd.MM.yy")+" "+Стр.ПунктОтправления+" - "+Стр.ПунктНазначения, РейсОбъект.Наименование);
		
		РейсОбъект.ПунктОтправления 	= Стр.ПунктОтправления;
		РейсОбъект.ПунктНазначения		= Стр.ПунктНазначения;
		РейсОбъект.Линия 				= Линия;
		РейсОбъект.Судно 				= Стр.Судно;   
		// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 03.09.2024
		// Было:
		//РейсОбъект.ТранзитноеВремяМин 	= Стр.ТранзитноеВремя; 
		// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 03.09.2024
		РейсОбъект.ДатаОтправления 		= Стр.ДатаОтправления;
		РейсОбъект.ДатаПрибытия 		= Стр.ДатаПрибытия;
		РейсОбъект.НомерРейса			= Стр.НомерРейса;
		
		РейсОбъект.Записать();
		Стр.Рейс = РейсОбъект.Ссылка;
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Сообщить("Обновлено " + Сч + " рейса!");
	
КонецПроцедуры


//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



