
&НаКлиенте
Процедура ЗагрузитьExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВставитьИзEXCELОбработка", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзEXCELОбработка(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если ТипЗнч(Параметр1) <> Тип("Массив") тогда 
		Возврат; 
	КонецЕсли;
	
	ВставитьВагоныДислокацию(Параметр1);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьВагоныДислокацию(СписокВагоновФайл)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОтправления,
	               |	ДислокацияВагоновСрезПоследних.Период КАК ДатаНачала,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(, Вагон В (&Вагоны)) КАК ДислокацияВагоновСрезПоследних";
	Запрос.УстановитьПараметр("Вагоны",СписокВагоновФайл);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Для каждого Стр из СписокВагоновФайл Цикл
		НСтр = СписокВагонов.Добавить();
		НСтр.Вагон = Стр;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Вагон",Стр);
		НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(НСтр,НайденныеСтроки[0]);
		КонецЕсли;
		Если ЗаполнятьПоПервойСтроке И СписокВагонов.Количество()>0 Тогда
			СтрокаСКлиентом = СписокВагонов.Получить(0);
			ВыбранныйКлиент = СтрокаСКлиентом.Клиент;
			ВыбранныйДоговор = СтрокаСКлиентом.Договор;
			ВыбраннаяКалькуляция = СтрокаСКлиентом.Калькуляция;
			НСтр.Клиент = ВыбранныйКлиент;
			НСтр.Договор = ВыбранныйДоговор;
			НСтр.Калькуляция = ВыбраннаяКалькуляция;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоновКлиентПриИзменении(Элемент)
	
	ТекД = Элементы.СписокВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекД.Договор = ПолучитьДанныеПоДоговору(ТекД.Клиент);
	ТекД.Калькуляция = ПолучитьДанныеПоКалькуляции(ТекД.Клиент,ТекД.Договор);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоДоговору(Клиент)
	
	ДоговорКлиента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		ДоговорКлиента = ТЗ[0].Ссылка;
	КонецЕсли;
		
	Возврат ДоговорКлиента;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоКалькуляции(Клиент,Договор)
	
	КалькуляцияКлиента = Документы.Калькуляция.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Калькуляция.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Калькуляция КАК Калькуляция
	               |ГДЕ
	               |	Калькуляция.Контрагент = &Контрагент
	               |	И Калькуляция.Договор = &Договор";
	Запрос.УстановитьПараметр("Контрагент",Клиент);
	Запрос.УстановитьПараметр("Договор",Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		КалькуляцияКлиента = ТЗ[0].Ссылка;
	КонецЕсли;
		
	Возврат КалькуляцияКлиента;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКлиентом(Команда)
	
	ВыбранныйКлиент = "";
	ВыбранныйДоговор = "";
	ВыбраннаяКалькуляция = "";
	
	ТекД = Элементы.СписокВагонов.ВыделенныеСтроки;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// проверить, в выделенной области есть только один клиент или несколько
	Для Каждого Элем Из ТекД Цикл
		ТекСтр = СписокВагонов.НайтиПоИдентификатору(Элем);
		Если ЗначениеЗаполнено(ТекСтр.Клиент) Тогда
			// если в выбранном клиенте уже есть данные и они не совпадают с проверяемой строкой, то выдать сообщение пользователю и прервать выполнение
			Если ЗначениеЗаполнено(ВыбранныйКлиент) И НЕ ВыбранныйКлиент = ТекСтр.Клиент Тогда
				ПоказатьПредупреждение(,"В выбранной области более одного клиента!");
				Возврат;
			ИначеЕсли НЕ ЗначениеЗаполнено(ВыбранныйКлиент) Тогда
				ВыбранныйКлиент = ТекСтр.Клиент;
				ВыбранныйДоговор = ТекСтр.Договор;
				ВыбраннаяКалькуляция = ТекСтр.Калькуляция;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Стр Из ТекД Цикл
		ТекСтр = СписокВагонов.НайтиПоИдентификатору(Стр);
		ТекСтр.Клиент = ВыбранныйКлиент;
		ТекСтр.Договор = ВыбранныйДоговор;
		ТекСтр.Калькуляция = ВыбраннаяКалькуляция;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(СписокВагонов);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокВагонов") Тогда
		ТабВаг = Параметры.СписокВагонов;
		ВставитьВагоныДислокацию(ТабВаг);
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ЗаполнятьПоПервойСтрокеПриИзменении(Элемент)
	
	Если НЕ ЗаполнятьПоПервойСтроке Тогда
		Возврат;
	КонецЕсли;
	Если СписокВагонов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйКлиент = "";
	ВыбранныйДоговор = "";
	ВыбраннаяКалькуляция = "";
	
	СтрокаСКлиентом = СписокВагонов.Получить(0);
	ВыбранныйКлиент = СтрокаСКлиентом.Клиент;
	ВыбранныйДоговор = СтрокаСКлиентом.Договор;
	ВыбраннаяКалькуляция = СтрокаСКлиентом.Калькуляция;
	
	Для Каждого Стр Из СписокВагонов Цикл
		Стр.Клиент = ВыбранныйКлиент;
		Стр.Договор = ВыбранныйДоговор;
		Стр.Калькуляция = ВыбраннаяКалькуляция;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоновПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если СписокВагонов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекД = Элементы.СписокВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НоваяСтрока И ЗаполнятьПоПервойСтроке Тогда
		СтрокаСКлиентом = СписокВагонов.Получить(0);
		ВыбранныйКлиент = СтрокаСКлиентом.Клиент;
		ВыбранныйДоговор = СтрокаСКлиентом.Договор;
		ВыбраннаяКалькуляция = СтрокаСКлиентом.Калькуляция;
		ТекД.Клиент = ВыбранныйКлиент;
		ТекД.Договор = ВыбранныйДоговор;
		ТекД.Калькуляция = ВыбраннаяКалькуляция;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоновПриИзменении(Элемент)
	
	ТекД = Элементы.СписокВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.СписокВагонов.ТекущаяСтрока = 0 И ЗаполнятьПоПервойСтроке Тогда
		ВыбранныйКлиент = ТекД.Клиент;
		ВыбранныйДоговор = ТекД.Договор;
		ВыбраннаяКалькуляция = ТекД.Калькуляция;
		
		Для Каждого Стр Из СписокВагонов Цикл
			Стр.Клиент = ВыбранныйКлиент;
			Стр.Договор = ВыбранныйДоговор;
			Стр.Калькуляция = ВыбраннаяКалькуляция;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоновДоговорПриИзменении(Элемент)
	
	ТекД = Элементы.СписокВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекД.Калькуляция = ПолучитьДанныеПоКалькуляции(ТекД.Клиент,ТекД.Договор);
КонецПроцедуры
