
Функция ВычислитьПоказателиОграничений(ГоризонтПланирования, ФильтрОграничения) Экспорт
	
	// Установим общие отборы и переменные
	Результат = Новый Массив;
	РеальныйФильтрОграничений = ПолучитьОграниченияПоИерархии(ФильтрОграничения);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФильтрОграничений", РеальныйФильтрОграничений);
	Запрос.УстановитьПараметр("ФильтрОграниченийПустой", РеальныйФильтрОграничений.Количество() = 0);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ограничения.Ссылка КАК Ограничение,
	               |	Ограничения.ЕдиницаТарификации,
	               |	Ограничения.ЖелтыйПорог,
	               |	Ограничения.КрасныйПорог,
	               |	Ограничения.НижняяГраница,
	               |	Ограничения.ТипОграничения
	               |ИЗ
	               |	Справочник.Ограничения КАК Ограничения
	               |ГДЕ
	               |	(Ограничения.Ссылка В (&ФильтрОграничений)
	               |			ИЛИ &ФильтрОграниченийПустой)
	               |	И НЕ Ограничения.ПометкаУдаления
	               |	И НЕ Ограничения.ЭтоГруппа
	               |	И (&ВычисляемыйДень >= Ограничения.НачалоДействия
	               |			ИЛИ Ограничения.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1))
	               |	И (Ограничения.ОкончаниеДействия > &ВычисляемыйДень
	               |			ИЛИ Ограничения.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	// Вычисляем значения по дням
	Сч = НачалоДня(ТекущаяДата());
	Конец = НачалоДня(ТекущаяДата())+ ГоризонтПланирования*24*60*60;
	Пока Сч <= Конец Цикл
		Запрос.УстановитьПараметр("ВычисляемыйДень", Сч);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			Если Ответ.ТипОграничения = Перечисления.ТипыОграничений.Остаточные Тогда
				ЧисловойПоказатель = 0;
				ЧисловойПоказательТЧ = ПолучитьОстаточныйПоказатель(Сч, Ответ.Ограничение);
				Для каждого Стр из ЧисловойПоказательТЧ Цикл
					ЧисловойПоказатель = ЧисловойПоказатель + Стр.ИтоговыйРезультат;
				КонецЦикла;
			Иначе
				ЧисловойПоказатель = 0;
				ЧисловойПоказательТЧ = ПолучитьПроцессныйПоказатель(Сч, Ответ.Ограничение);
				Для каждого Стр из ЧисловойПоказательТЧ Цикл
					ЧисловойПоказатель = ЧисловойПоказатель + Стр.ИтоговыйРезультат;
				КонецЦикла;
			КонецЕсли;
			Результат.Добавить(Новый Структура("Ограничение, ЕдиницаТарификации, ЖелтыйПорог, КрасныйПорог, НижняяГраница, День, Значение", Ответ.Ограничение, Ответ.ЕдиницаТарификации, Ответ.ЖелтыйПорог, Ответ.КрасныйПорог, Ответ.НижняяГраница, Сч, ЧисловойПоказатель));
		КонецЦикла;
		Сч = Сч + 24*60*60;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоэффициент(Значение, Ограничение)
	
	Для каждого Стр из Ограничение.Коэффициенты Цикл
		Если Стр.Показатель = Значение Тогда Возврат Стр.Коэффициент; КонецЕсли;
	КонецЦикла;
	Возврат 1;
	
КонецФункции

Функция ПолучитьОстаточныйПоказатель(ВычисляемыйДень, Ограничение)
	
	РезультатМассив = Новый Массив;
	//РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат"));
	//ЧисловойРезультат = 0;
	
	ОтборТипТЕ = Ограничение.ТипыТЕ.Выгрузить().ВыгрузитьКолонку("ТипТЕ");
	ОтборТипТС = Ограничение.ТипыТС.Выгрузить().ВыгрузитьКолонку("ТипТС");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ВычисляемыйДень);
	Запрос.УстановитьПараметр("МЕСТОПОЛОЖЕНИЕВРЕГИОНЕ", Ограничение.ПунктОтправленияВРегионе);
	Запрос.УстановитьПараметр("Местоположение", Ограничение.ПунктОтправления);
	Запрос.УстановитьПараметр("ОрганизацияПустая", НЕ ЗначениеЗаполнено(Ограничение.Организация));
	Запрос.УстановитьПараметр("Организация", Ограничение.Организация);
	Запрос.УстановитьПараметр("ОтборТипТЕ", ОтборТипТЕ);
	Запрос.УстановитьПараметр("ОтборТипТЕПустой", ОтборТипТЕ.Количество() = 0);
	Запрос.УстановитьПараметр("ОтборТипТС", ОтборТипТС);
	Запрос.УстановитьПараметр("ОтборТипТСПустой", ОтборТипТС.Количество() = 0);
	Запрос.УстановитьПараметр("ТарифицируетсяПоКоличеству", Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.КоличествоНоменклатуры);
	Запрос.УстановитьПараметр("ЕИКоличества", Ограничение.ЕдиницаИзмеренияКоличества);
	
	Если 
		Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС ИЛИ 
		Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТЕ 
	Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПозицияВагоновФактОстатки.Локация КАК Местоположение,
		               |	ПозицияВагоновФактОстатки.Вагон КАК ТС,
		               |	ПозицияВагоновФактОстатки.ТипВагона КАК ТипТС,
		               |	ПозицияВагоновФактОстатки.ФактОстаток КАК КоличествоТСОстаток,
		               |	NULL КАК ТЕ,
		               |	NULL КАК ТипТЕ
		               |ИЗ
		               |	РегистрНакопления.ПозицияВагоновФакт.Остатки(
		               |			&Период,
		               |			ВЫБОР
		               |					КОГДА &МЕСТОПОЛОЖЕНИЕВРЕГИОНЕ
		               |						ТОГДА Локация В ИЕРАРХИИ (&Местоположение)
		               |					ИНАЧЕ Локация = &Местоположение
		               |				КОНЕЦ
		               |				И (ТипВагона В (&ОтборТипТС)
		               |					ИЛИ &ОтборТипТСПустой)) КАК ПозицияВагоновФактОстатки
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПозицияКонтейнеровФактОстатки.Локация,
		               |	NULL,
		               |	NULL,
		               |	ПозицияКонтейнеровФактОстатки.ФактОстаток,
		               |	ПозицияКонтейнеровФактОстатки.Контейнер,
		               |	ПозицияКонтейнеровФактОстатки.ТипКТК
		               |ИЗ
		               |	РегистрНакопления.ПозицияКонтейнеровФакт.Остатки(
		               |			&Период,
		               |			ВЫБОР
		               |					КОГДА &МЕСТОПОЛОЖЕНИЕВРЕГИОНЕ
		               |						ТОГДА Локация В ИЕРАРХИИ (&Местоположение)
		               |					ИНАЧЕ Локация = &Местоположение
		               |				КОНЕЦ
		               |				И (ТипКТК В (&ОтборТипТЕ)
		               |					ИЛИ &ОтборТипТЕПустой)) КАК ПозицияКонтейнеровФактОстатки";
	
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			Если Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС И ЗначениеЗаполнено(Ответ.ТипТС) Тогда
				УмножающийКоэффициент = ПолучитьКоэффициент(Ответ.ТипТС, Ограничение);
				//ЧисловойРезультат = ЧисловойРезультат + УмножающийКоэффициент * Ответ.КоличествоТСОстаток;
				РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
									неопределено, Ответ.ТипТС, Ответ.ТС, Ответ.ТипТЕ, Ответ.ТЕ, Ответ.Местоположение, неопределено, неопределено, неопределено, Ответ.КоличествоТСОстаток, УмножающийКоэффициент, Ответ.КоличествоТСОстаток * УмножающийКоэффициент));
			ИначеЕсли Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТЕ И ЗначениеЗаполнено(Ответ.ТипТЕ) Тогда
				УмножающийКоэффициент = ПолучитьКоэффициент(Ответ.ТипТЕ, Ограничение);
				//ЧисловойРезультат = ЧисловойРезультат + УмножающийКоэффициент * Ответ.КоличествоТЕОстаток;
				РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
									неопределено, Ответ.ТипТС, Ответ.ТС, Ответ.ТипТЕ, Ответ.ТЕ, Ответ.Местоположение, неопределено, неопределено, неопределено, Ответ.КоличествоТСОстаток, УмножающийКоэффициент, Ответ.КоличествоТСОстаток * УмножающийКоэффициент));
			КонецЕсли;
		КонецЦикла;
					   
	КонецЕсли;
	
	Возврат РезультатМассив;
	
КонецФункции

Функция ПолучитьПроцессныйПоказатель(ВычисляемыйДень, Ограничение)
	
	РезультатМассив = Новый Массив;
	//РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат"));
	//ЧисловойРезультат = 0;
	ВидыОпераций = Ограничение.ВидыОпераций.Выгрузить().ВыгрузитьКолонку("ВидОперации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктОтправленияВРегионе", Ограничение.ПунктОтправленияВРегионе);
	Запрос.УстановитьПараметр("ПунктОтправления", Ограничение.ПунктОтправления);
	Запрос.УстановитьПараметр("ПунктНазначения", Ограничение.ПунктНазначения);
	Запрос.УстановитьПараметр("ПунктНазначенияВРегионе", Ограничение.ПунктНазначенияВРегионе);
	Запрос.УстановитьПараметр("Поставщик", Ограничение.Поставщик);
	Запрос.УстановитьПараметр("Организация", Ограничение.Организация);
	Запрос.УстановитьПараметр("Контрагент", Ограничение.Контрагент);
	Запрос.УстановитьПараметр("Договор", Ограничение.Договор);
	Запрос.УстановитьПараметр("Валюта", Ограничение.Валюта);
	Запрос.УстановитьПараметр("Регламентный", Ограничение.Регламентный);
	Запрос.УстановитьПараметр("ОтборВид", ВидыОпераций);
	Запрос.УстановитьПараметр("ОтборВидПустой", ВидыОпераций.Количество() = 0);
	Запрос.УстановитьПараметр("Период", ВычисляемыйДень);
	Запрос.УстановитьПараметр("НАЧАЛОПЕРИОДА", НачалоДня(ВычисляемыйДень));
	Запрос.УстановитьПараметр("КОНЕЦПЕРИОДА", КонецДня(ВычисляемыйДень));
	Запрос.УстановитьПараметр("ПериодНачалаОграничения", Ограничение.НачалоДействия);
	Запрос.УстановитьПараметр("ПериодОкончанияОграничения", Ограничение.ОкончаниеДействия);
	Запрос.УстановитьПараметр("РаспределениеВесаОперацииПоДням", Ограничение.РаспределениеВесаОперацииПоДням);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Операция.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Операция КАК Операция
	               |ГДЕ
	               |	Операция.Проведен
	               |	И ВЫБОР
	               |				КОГДА &ПунктОтправленияВРегионе
	               |					ТОГДА Операция.ПунктОтправления В ИЕРАРХИИ (&ПунктОтправления)
	               |				ИНАЧЕ Операция.ПунктОтправления = &ПунктОтправления
	               |						ИЛИ &ПунктОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	               |			КОНЕЦ
	               |			И ВЫБОР
	               |				КОГДА &ПунктНазначенияВРегионе
	               |					ТОГДА Операция.ПунктНазначения В ИЕРАРХИИ (&ПунктНазначения)
	               |				ИНАЧЕ Операция.ПунктНазначения = &ПунктНазначения
	               |						ИЛИ &ПунктНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	               |			КОНЕЦ
	               |			И (Операция.Организация = &Организация
	               |				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	               |			И (Операция.Поставщик = &Контрагент
	               |				ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |			И (Операция.Договор = &Договор
	               |				ИЛИ &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	               |			И (Операция.Валюта = &Валюта
	               |				ИЛИ &Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	               |			И (Операция.Услуга В (&ОтборВид)
	               |				ИЛИ &ОтборВидПустой)";
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если НЕ ОперацияПроходитПоДопОтборам(Ответ.Ссылка, Ограничение) Тогда Продолжить; КонецЕсли;
		
		Если Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.Операция Тогда
			//ЧисловойРезультат = ЧисловойРезультат + 1;
			РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
									Ответ.Ссылка, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, 1, 1, 1));
		ИначеЕсли Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС Тогда
			ТЧРез = ПолучитьТаблицуТСОперации(Ответ.Ссылка);
			Для каждого Стр из ТЧРез Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда Продолжить; КонецЕсли;
				Коэффициент = ПолучитьКоэффициент(Стр.Значение, Ограничение);
				РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
									Ответ.Ссылка, Стр.Значение, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, Стр.Количество, Коэффициент, Коэффициент*Стр.Количество));
				//ЧисловойРезультат = ЧисловойРезультат + Коэффициент*Стр.Количество;
			КонецЦикла;
		ИначеЕсли Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТЕ Тогда
			ТЧРез = ПолучитьТаблицуТЕОперации(Ответ.Ссылка);
			Для каждого Стр из ТЧРез Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда Продолжить; КонецЕсли;
				Коэффициент = ПолучитьКоэффициент(Стр.Значение, Ограничение);
				РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
									Ответ.Ссылка, неопределено, неопределено, Стр.Значение, неопределено, неопределено, неопределено, неопределено, неопределено, Стр.Количество, Коэффициент, Коэффициент*Стр.Количество));
				//ЧисловойРезультат = ЧисловойРезультат + Коэффициент*Стр.Количество;
			КонецЦикла;
		//ИначеЕсли Ограничение.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.Стоимость Тогда
		//	
		//	Стоимость = ?(ЗначениеЗаполнено(Ответ.Ссылка.ФактическаяСтоимость), Ответ.Ссылка.ФактическаяСтоимость, Ответ.Ссылка.ПлановаяСтоимость);
		//	РезультатМассив.Добавить(Новый Структура("Операция, ТипТС, ТС, ТипТЕ, ТЕ, Местоположение, ГП, ТипНоменклатуры, Номенклатура, ЧисловойРезультат, Коэффициент, ИтоговыйРезультат",
		//		Ответ.Ссылка, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, неопределено, Стоимость, 1, Стоимость));
		КонецЕсли;
		
		Если Ограничение.РаспределятьПоДням Тогда
			
			Для каждого Стр из РезультатМассив Цикл
				ДатыОперации = Новый Структура("ФактическаяДатаНачала,ПлановаяДатаНачала,ФактическаяДатаОкончания,ПлановаяДатаОкончания", Стр.Операция.ДатаОтправленияФакт, Стр.Операция.ДатаОтправления, Стр.Операция.ДатаНазначенияФакт, Стр.Операция.ДатаНазначения);
				ДатаНачала = ?(ЗначениеЗаполнено(ДатыОперации.ФактическаяДатаНачала), ДатыОперации.ФактическаяДатаНачала, ДатыОперации.ПлановаяДатаНачала);
				ДатаОкончания = ?(ЗначениеЗаполнено(ДатыОперации.ФактическаяДатаОкончания), ДатыОперации.ФактическаяДатаОкончания, ДатыОперации.ПлановаяДатаОкончания);
				Длительность = (ДатаОкончания - ДатаНачала) / 3600 / 24;
				Длительность = Окр(Длительность, 0, РежимОкругления.Окр15как20);
				Стр.ЧисловойРезультат = Стр.ЧисловойРезультат / Длительность;
				Стр.ИтоговыйРезультат = Стр.ИтоговыйРезультат / Длительность;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатМассив;
	
КонецФункции

Функция ПолучитьТаблицуТСОперации(Операция)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГрузыВОперациях.ТипТС,
	               |	ГрузыВОперациях.ТСГУИД,
	               |	1 КАК Количество
	               |ПОМЕСТИТЬ ТЧ
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ГрузыВОперациях
	               |ГДЕ
	               |	ГрузыВОперациях.Ссылка = &Операция
	               |	И ГрузыВОперациях.ТипТС <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТС.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.ТипТС,
	               |	СУММА(ТЧ.Количество) КАК Количество
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЧ.ТипТС";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Новый Структура("Значение, Количество", Ответ.ТипТС, Ответ.Количество));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуТЕОперации(Операция)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГрузыВОперациях.ТипТЕ,
	               |	ГрузыВОперациях.ТЕГУИД,
	               |	1 КАК Количество
	               |ПОМЕСТИТЬ ТЧ
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ГрузыВОперациях
	               |ГДЕ
	               |	ГрузыВОперациях.Ссылка = &Операция
	               |	И ГрузыВОперациях.ТипТЕ <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.ТипТЕ,
	               |	СУММА(ТЧ.Количество) КАК Количество
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЧ.ТипТЕ";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Новый Структура("Значение, Количество", Ответ.ТипТЕ, Ответ.Количество));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОперацияПроходитПоДопОтборам(Операция, Ограничение)
	
	ОперацияПодходитПоПараметрам = Истина;
	
	//ОтборНоменклатура = Ограничение.Номенклатура.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	//ОтборТипНоменклатуры = ПолучитьТипыНоменклатурыПоНоменклатуре(ОтборНоменклатура);
	ОтборТипТЕ = Ограничение.ТипыТЕ.Выгрузить().ВыгрузитьКолонку("ТипТЕ");
	ОтборТипТС = Ограничение.ТипыТС.Выгрузить().ВыгрузитьКолонку("ТипТС");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияГрузы.ТипТС КАК ТипТС,
	               |	ОперацияГрузы.ТипТЕ КАК ТипТЕ
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Операция";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГрузыВОперациях.ТипТС,
	//               |	ГрузыВОперациях.ТипТЕ,
	//               |	ГрузыВОперациях.Номенклатура,
	//               |	ГрузыВОперациях.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	//               |ИЗ
	//               |	РегистрНакопления.ГрузыВОперациях КАК ГрузыВОперациях
	//               |ГДЕ
	//               |	ГрузыВОперациях.Операция = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если ОтборТипТС.Количество() > 0 И Ответ.ТипТС <> Справочники.ТипыТранспортныхСредств.Неизвестно И ОтборТипТС.Найти(Ответ.ТипТС) = неопределено Тогда ОперацияПодходитПоПараметрам = Ложь; КонецЕсли;
		Если ОтборТипТЕ.Количество() > 0 И Ответ.ТипТЕ <> Справочники.ТипыТранспортныхЕдиниц.Неизвестно И ОтборТипТС.Найти(Ответ.ТипТС) = неопределено Тогда ОперацияПодходитПоПараметрам = Ложь; КонецЕсли;
		//Если ОтборТипНоменклатуры.Количество() > 0 И ОтборТипНоменклатуры.Найти(Ответ.ТипНоменклатуры) = неопределено Тогда ОперацияПодходитПоПараметрам = Ложь; КонецЕсли;
		//Если ОтборНоменклатура.Количество() > 0 И ОтборНоменклатура.Найти(Ответ.Номенклатура) = неопределено Тогда ОперацияПодходитПоПараметрам = Ложь; КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОперацияПодходитПоПараметрам;
	
КонецФункции

Функция ПолучитьОграниченияПоИерархии(СписокОграничений)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ограничения.Ссылка
	               |ИЗ
	               |	Справочник.Ограничения КАК Ограничения
	               |ГДЕ
	               |	НЕ Ограничения.ПометкаУдаления
	               |	И НЕ Ограничения.ЭтоГруппа
	               |	И Ограничения.Ссылка В ИЕРАРХИИ(&Ссылка)";
	
	Результат = Новый Массив;
	Для каждого Стр из СписокОграничений Цикл
		
		Если НЕ Стр.ЭтоГруппа Тогда
			Результат.Добавить(Стр);
		Иначе
			
			Запрос.УстановитьПараметр("Ссылка", Стр);
			Ответ = Запрос.Выполнить().Выбрать();
			Пока Ответ.Следующий() Цикл
				Результат.Добавить(Ответ.Ссылка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВычислитьДетальныеПоказателиОграничения(День, Ограничение) Экспорт
	
	Результат = Новый Массив;
	
	Если Ограничение.ТипОграничения = Перечисления.ТипыОграничений.Остаточные Тогда
		Результат = ПолучитьОстаточныйПоказатель(День, Ограничение);
	Иначе
		Результат = ПолучитьПроцессныйПоказатель(День, Ограничение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокУведомленийПоОграничениям() Экспорт
	
	ОтправлятьПовторныеОграничения = Константы.ПовторноОтправлятьПредупрежденияОграничений.Получить();
	Результат = Новый Массив;
	ПромежуточныйРезультат = Новый Массив;
	
	// 1. Получаем список ограничений, по которым вообще надо что-то рассылать и вычисляем промежуточную таблицу для дальнейшей обработки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ограничения.Ссылка,
	               |	Ограничения.УведомлятьОПревышенииОграниченияВЗаданномГоризонтеДН,
	               |	Ограничения.ТипОграничения,
	               |	Ограничения.ЖелтыйПорог,
	               |	Ограничения.КрасныйПорог,
	               |	Ограничения.НижняяГраница
	               |ИЗ
	               |	Справочник.Ограничения КАК Ограничения
	               |ГДЕ
	               |	НЕ Ограничения.ПометкаУдаления
	               |	И НЕ Ограничения.ЭтоГруппа
	               |	И Ограничения.ОповещатьПоОграничению";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Для Сч = 0 По Ответ.УведомлятьОПревышенииОграниченияВЗаданномГоризонтеДН Цикл
			
			ТДата = НачалоДня(ТекущаяДата()) + Сч*3600*24;
			РЕЗ = ВычислитьДетальныеПоказателиОграничения(ТДата, Ответ.Ссылка);
			ИТОГ = 0;
			Для каждого Стр из РЕЗ Цикл
				ИТОГ = ИТОГ + Стр.ИтоговыйРезультат;
			КонецЦикла;
			
			ЖелтыйПорог = Ложь;
			КрасныйПорог = Ложь;
			
			Если НЕ Ответ.НижняяГраница И ИТОГ >= Ответ.КрасныйПорог Тогда 
				КрасныйПорог = Истина; 
			ИначеЕсли НЕ Ответ.НижняяГраница И ИТОГ >= Ответ.ЖелтыйПорог Тогда
				ЖелтыйПорог = Истина;
			КонецЕсли;
			
			Если Ответ.НижняяГраница И ИТОГ <= Ответ.КрасныйПорог Тогда 
				КрасныйПорог = Истина; 
			ИначеЕсли Ответ.НижняяГраница И ИТОГ <= Ответ.ЖелтыйПорог Тогда
				ЖелтыйПорог = Истина;
			КонецЕсли;
			
			Для каждого Пользователь из Ответ.Ссылка.ОповещенияПользователям Цикл
				Если ЖелтыйПорог И (Пользователь.ПорогУведомлений = Перечисления.ПорогУведомления.Желтый ИЛИ Пользователь.ПорогУведомлений = Перечисления.ПорогУведомления.ЖелтыйИКрасный) Тогда
					ПромежуточныйРезультат.Добавить(Новый Структура("Пользователь, День, Ограничение, ЖелтыйПорог, Значение", Пользователь.Пользователь, ТДата, Ответ.Ссылка, Истина, ИТОГ));
				КонецЕсли;
				Если КрасныйПорог И (Пользователь.ПорогУведомлений = Перечисления.ПорогУведомления.Красный ИЛИ Пользователь.ПорогУведомлений = Перечисления.ПорогУведомления.ЖелтыйИКрасный) Тогда
					ПромежуточныйРезультат.Добавить(Новый Структура("Пользователь, День, Ограничение, ЖелтыйПорог, Значение", Пользователь.Пользователь, ТДата, Ответ.Ссылка, Ложь, ИТОГ));
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 2. Теперь по таблице формируем сообщения для пользователей
	СписокПользователей = Новый Массив;
	Для каждого Стр из ПромежуточныйРезультат Цикл
		Если СписокПользователей.Найти(Стр.Пользователь) = неопределено Тогда
			СписокПользователей.Добавить(Стр.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из СписокПользователей Цикл
		ПочтовыйЯщикПользователя = ""; //ПользователиСервер.ПолучитьПочтовыйЯщикПользователя(Стр);
		Если ПочтовыйЯщикПользователя = неопределено Тогда
			ЗаписьЖурналаРегистрации("Ошибка отправки сообщения пользователю " + Стр + ": не указан почтовый ящик!", УровеньЖурналаРегистрации.Ошибка);
			Продолжить;
		КонецЕсли;
		
		Для каждого Стр2 из ПромежуточныйРезультат Цикл
			Если Стр2.Пользователь <> Стр Тогда Продолжить; КонецЕсли;
			ТемаЪ = "" + ?(Стр2.ЖелтыйПорог, "Желтый", "Красный") + " порог = " + Стр2.Значение + ?(Стр2.Ограничение.НижняяГраница, " < ", " > ") + ?(Стр2.ЖелтыйПорог, Стр2.Ограничение.ЖелтыйПорог, Стр2.Ограничение.КрасныйПорог) + " = " + Стр2.Ограничение + " " + Формат(Стр2.День, "ДФ=dd.MM.yy");
			Если ПроверитьДобавитьЗаписьВЖурналОтправкиОграничений(Стр2.Ограничение, Стр2.Пользователь, Стр2.День, ТемаЪ) И НЕ ОтправлятьПовторныеОграничения Тогда Продолжить; КонецЕсли;
			Текст = "<table border='1'><tr><td>Ограничение</td><td>Дата</td><td>Желтая граница</td><td>Красная граница</td><td>Текущее значение</td></tr>";
			Текст = Текст + "<tr><td>"+Стр2.Ограничение+"</td><td style='text-align:center'>"+Формат(Стр2.День, "ДФ=dd.MM.yy")+"</td><td style='text-align:center'>"+Стр2.Ограничение.ЖелтыйПорог+"</td><td style='text-align:center'>"+Стр2.Ограничение.КрасныйПорог+"</td><td style='text-align:center; background:"+?(Стр2.ЖелтыйПорог, "yellow", "red")+"'>"+Стр2.Значение+"</td></tr>";
			Текст = Текст + "</table>";
			Пользователи = Новый Массив;
			Пользователи.Добавить(ПочтовыйЯщикПользователя);
			Результат.Добавить(Новый Структура("Получатели, Тема, Текст", Пользователи, ТемаЪ, Текст))
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДобавитьЗаписьВЖурналОтправкиОграничений(Ограничение, Пользователь, День, Тема)
	
	СообщениеУжеБыло = Ложь;
	
	НЗ = РегистрыСведений.РанееОтправленныеСообщения.СоздатьНаборЗаписей();
	НЗ.Отбор.Ограничение.Установить(Ограничение);
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.День.Установить(День);
	НЗ.Прочитать();
	Для каждого Стр из НЗ Цикл
		Если Стр.Тема = Тема Тогда СообщениеУжеБыло = Истина; КонецЕсли;
	КонецЦикла;
	НЗ.Очистить();
	НСтр = НЗ.Добавить();
	НСтр.Ограничение = Ограничение;
	НСтр.Период = ТекущаяДата();
	НСтр.Пользователь = Пользователь;
	НСтр.Тема = Тема;
	НСтр.День = День;
	НЗ.Записать(Истина);
	
	Возврат СообщениеУжеБыло;
	
КонецФункции

