
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажиПродуктов Приход
	Движения.ПродажиПродуктов.Записывать = Истина;
	Для Каждого ТекСтрокаПродукты Из Продукты Цикл
		Движение 				= Движения.ПродажиПродуктов.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Продукт 		= ТекСтрокаПродукты.Продукт;
		Движение.Отправка 		= ТекСтрокаПродукты.ДатаНачала;
		Движение.ВсегоСлотов 	= ТекСтрокаПродукты.СвободныхМест;
		Движение.Организация 	= Организация;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор 		= Пользователи.ТекущийПользователь();
	ЦФО 		= Автор.ЦФО;
	Создано 	= ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор 	= Пользователи.ТекущийПользователь();
	Изменено 	= ТекущаяДата();
	
	Описание = "Продуктов: " + Продукты.Количество() + ": ";
	Для каждого Стр из Продукты Цикл
		Описание = Описание + Стр.Продукт + ", ";
	КонецЦикла;
	
КонецПроцедуры
