
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 )
	
	// Евросиб US 88677 TA 88681 Рыбьяков К.А. 31.10.2024 ((
	Если Параметры.Свойство("Ключ") Тогда
		ЗаполнитьТабличнуЧасть(Параметры.Ключ);
	КонецЕсли;
	
	РелизДоплатный = Параметры.РелизДоплатный;
	
	ВозможныеСтокиСдачи = Параметры.ВозможныеСтокиСдачи;
	ЛокацииСдачи = Параметры.ЛокацииСдачи;
	// Евросиб Рыбьяков К.А. 31.10.2024 ))
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Команда)
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 )
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	ПрочитатьДанныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Отказ = Ложь;
	
	Результат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		ИндексСтроки = ТаблицаРезультат.Индекс(Строка);
		Если Не ЗначениеЗаполнено(Строка.Контейнер) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните контейнер.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
				"ТаблицаРезультат[" + ИндексСтроки + "].Контейнер", , Отказ);
			Продолжить;
		КонецЕсли;
		Если КонтейнерыВРелизе.НайтиПоЗначению(Строка.Контейнер) = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Контейнера %1 нет в релизе.'"), Строка.Контейнер);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
				"ТаблицаРезультат[" + ИндексСтроки + "].Контейнер", , Отказ);
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.СтокСдачи) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните сток сдачи.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
				"ТаблицаРезультат[" + ИндексСтроки + "].СтокСдачи", , Отказ);
			Продолжить;
		КонецЕсли;
		Если РелизДоплатный Тогда
			НайденноеЗначение = ВозможныеСтокиСдачи.НайтиПоЗначению(Строка.СтокСдачи);
			Если НайденноеЗначение = Неопределено Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не указана в вариантах ""Возможные стоки сдачи"". 
					|Укажите подходящую локацию или внесите изменения в Релиз сособственника.'"), Строка.СтокСдачи);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
					"ТаблицаРезультат[" + ИндексСтроки + "].СтокСдачи", , Отказ);
			Иначе
				Результат.Добавить(Новый Структура("Контейнер, ДатаВозврата, СтокСдачи", Строка.Контейнер, Строка.ДатаВозврата, Строка.СтокСдачи));
			КонецЕсли;
		Иначе
			Если ВозможныеСтокиСдачи.Количество() > 0 Тогда
				НайденноеЗначение = ВозможныеСтокиСдачи.НайтиПоЗначению(Строка.СтокСдачи);
				Если НайденноеЗначение = Неопределено Тогда
					ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не указана в вариантах ""Возможные стоки сдачи"". 
						|Укажите подходящую локацию или внесите изменения в Релиз сособственника.'"), Строка.СтокСдачи);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
						"ТаблицаРезультат[" + ИндексСтроки + "].СтокСдачи", , Отказ);
				Иначе
					Результат.Добавить(Новый Структура("Контейнер, ДатаВозврата, СтокСдачи", Строка.Контейнер, Строка.ДатаВозврата, Строка.СтокСдачи));
				КонецЕсли;
			ИначеЕсли ЛокацииСдачи.Количество() > 0 Тогда
				НайденноеЗначение = ЛокацииСдачи.НайтиПоЗначению(Строка.СтокСдачи);
				Если НайденноеЗначение = Неопределено Тогда
					ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не указана в вариантах ""Локации сдачи"". 
						|Укажите подходящую локацию или внесите изменения в Релиз сособственника.'"), Строка.СтокСдачи);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
						"ТаблицаРезультат[" + ИндексСтроки + "].СтокСдачи", , Отказ);
				Иначе
					Результат.Добавить(Новый Структура("Контейнер, ДатаВозврата, СтокСдачи", Строка.Контейнер, Строка.ДатаВозврата, Строка.СтокСдачи));
				КонецЕсли;
			Иначе
				Результат.Добавить(Новый Структура("Контейнер, ДатаВозврата, СтокСдачи", Строка.Контейнер, Строка.ДатаВозврата, Строка.СтокСдачи));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныНаСервере()
	
	Счетчик = 2;
	ТаблицаРезультат.Очистить();
	
	ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
	
	Пока ПрочитаннаяСтрока <> "" Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		
		СтрокаКТК = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст);
		Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(СтрокаКТК, Ложь);
		
		Если Контейнер = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Контейнера %1 не найден.'"), СтрокаКТК);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
			"ТаблицаРезультат[" + НоваяСтрока.ПолучитьИдентификатор() + "].Контейнер");
		ИначеЕсли КонтейнерыВРелизе.НайтиПоЗначению(Контейнер) = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Контейнера %1 нет в релизе.'"), Контейнер);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
			"ТаблицаРезультат[" + НоваяСтрока.ПолучитьИдентификатор() + "].Контейнер");
		Иначе
			НоваяСтрока.Контейнер = Контейнер;
		КонецЕсли;
		
		Если ТабличныйДокумент.Область("R" + Счетчик + "C2").Текст <> "" Тогда
			НоваяСтрока.ДатаВозврата = ПреобразованиеВДатуСервер(ТабличныйДокумент.Область("R" + Счетчик + "C2").Текст);
		КонецЕсли;
		
		Если ТабличныйДокумент.Область("R" + Счетчик + "C3").Текст <> "" Тогда
			ЛокацияПодходящегоТипа = НайтиЛокациюПодходящегоТипаПоШаблону(ТабличныйДокумент.Область("R" + Счетчик + "C3").Текст);
			Если ЛокацияПодходящегоТипа.Количество() = 1 Тогда
				ЛокацияПодходящегоТипа.Следующий();
				НоваяСтрока.СтокСдачи = ЛокацияПодходящегоТипа.Ссылка;
				Если ВозможныеСтокиСдачи.Количество() > 0 Тогда
					НайденноеЗначение = ВозможныеСтокиСдачи.НайтиПоЗначению(НоваяСтрока.СтокСдачи);
					Если НайденноеЗначение = Неопределено Тогда
						ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не указана в вариантах ""Возможные стоки сдачи"". 
						|Укажите подходящую локацию или внесите изменения в Релиз сособственника.'"), НоваяСтрока.СтокСдачи);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
						"ТаблицаРезультат[" + НоваяСтрока.ПолучитьИдентификатор() + "].СтокСдачи");
						НоваяСтрока.СтокСдачи = Неопределено;
					КонецЕсли;
				ИначеЕсли ЛокацииСдачи.Количество() > 0 Тогда
					НайденноеЗначение = ЛокацииСдачи.НайтиПоЗначению(НоваяСтрока.СтокСдачи);
					Если НайденноеЗначение = Неопределено Тогда
						ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не указана в вариантах ""Локации сдачи"". 
						|Укажите подходящую локацию или внесите изменения в Релиз сособственника.'"), НоваяСтрока.СтокСдачи);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , 
						"ТаблицаРезультат[" + НоваяСтрока.ПолучитьИдентификатор() + "].СтокСдачи");
						НоваяСтрока.СтокСдачи = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуЧасть(РелизСобственникаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
	|	КлючиАналитикиНоминацийРелиза.СтокВыдачи КАК СтокВыдачи,
	|	КлючиАналитикиНоминацийРелиза.ДатаВозвратаКлиентом КАК ДатаВозвратаКлиентом,
	|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВзятия
	|ПОМЕСТИТЬ ВТ_ДанныеРелиза
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиНоминацийРелиза КАК КлючиАналитикиНоминацийРелиза
	|		ПО (РелизСобственникаНоминации.КлючАналитики = КлючиАналитикиНоминацийРелиза.Ссылка)
	|ГДЕ
	|	РелизСобственникаНоминации.Ссылка = &Ссылка
	|	И РелизСобственникаНоминации.ДатаВзятия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток,
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи КАК тек_СтокСдачи
	|ПОМЕСТИТЬ ВТ_ДатаВозвратаСобственнику
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
	|			,
	|			КТК В (ВЫБРАТЬ
	|						ВТ_ДанныеРелиза.Контейнер
	|					ИЗ
	|						ВТ_ДанныеРелиза)
	|				И тек_Релиз = &Ссылка) КАК стоки_ТекущиеДанныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРелиза.Контейнер КАК Контейнер,
	|	ВТ_ДанныеРелиза.СтокВыдачи КАК СтокВыдачи,
	|	ВТ_ДанныеРелиза.ДатаВозвратаКлиентом КАК ДатаВозвратаКлиентом,
	|	ВТ_ДанныеРелиза.ДатаВзятия КАК ДатаВзятия,
	|	ВТ_ДатаВозвратаСобственнику.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток,
	|	ВТ_ДатаВозвратаСобственнику.тек_СтокСдачи КАК тек_СтокСдачи
	|ИЗ
	|	ВТ_ДанныеРелиза КАК ВТ_ДанныеРелиза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаВозвратаСобственнику КАК ВТ_ДатаВозвратаСобственнику
	|		ПО (ВТ_ДанныеРелиза.Контейнер = ВТ_ДатаВозвратаСобственнику.КТК)
	|ГДЕ
	|	ВТ_ДатаВозвратаСобственнику.тек_ДатаСдачиВСток = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", РелизСобственникаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивКонтейнеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контейнер");
		КонтейнерыВРелизе.ЗагрузитьЗначения(МассивКонтейнеров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразованиеВДатуСервер(ТекДата)
	
	Результат = Неопределено;
	
	ТекДата = СокрЛП(ТекДата);	
	КоличествоСимволов = СтрДлина(ТекДата);
	Год = "";
	Месяц = "";
	День = "";
	Час = "0";
	Минута = "0";
	Секунда = "0";
	ЧастьДаты = 0;
	
	Для Сч = 1 По КоличествоСимволов Цикл
		Код = КодСимвола(Сред(ТекДата, Сч)); 
		Если Код < 48 ИЛИ Код > 57 Тогда 
			ЧастьДаты = ЧастьДаты + 1;
		Иначе
			Если ЧастьДаты = 0 Тогда
				День = Строка(День) + Строка(Сред(ТекДата, Сч, 1));
			ИначеЕсли ЧастьДаты = 1 Тогда
				Месяц = Строка(Месяц) + Строка(Сред(ТекДата, Сч , 1)); 
			ИначеЕсли ЧастьДаты = 2 Тогда
				Год = Строка(Год) + Строка(Сред(ТекДата, Сч, 1));
			ИначеЕсли ЧастьДаты = 3 Тогда
				Час = Строка(Час) + Строка(Сред(ТекДата, Сч, 1));
			ИначеЕсли ЧастьДаты = 4 Тогда
				Минута = Строка(Минута) + Строка(Сред(ТекДата, Сч, 1));
			ИначеЕсли ЧастьДаты = 5 Тогда
				Секунда = Строка(Секунда) + Строка(Сред(ТекДата, Сч, 1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Год) = 2 Тогда
		Год = Строка("20") + Строка(Год);
	КонецЕсли;
	Если СтрДлина(Месяц) = 1 Тогда
		Месяц = Строка("0") + Строка(Месяц);
	КонецЕсли;
	Если СтрДлина(День) = 1 Тогда
		День = Строка("0") + Строка(День);
	КонецЕсли;
	Если СтрДлина(Час) = 1 Тогда
		Час = Строка("0") + Строка(Час);
	КонецЕсли;
	Если СтрДлина(Минута) = 1 Тогда
		Минута = Строка("0") + Строка(Минута);
	КонецЕсли;
	Если СтрДлина(Секунда) = 1 Тогда
		Секунда = Строка("0") + Строка(Секунда);
	КонецЕсли;
	
	Попытка
		Результат = Дата(Год, Месяц, День, Час, Минута, Секунда);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиЛокациюПодходящегоТипаПоШаблону(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	Локации.Тип КАК Тип
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование ПОДОБНО &Шаблон
	|	И Локации.Тип В(&Типы)
	|	И НЕ Локации.ПометкаУдаления";
	
	Если РелизДоплатный Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		Запрос.УстановитьПараметр("Типы", МассивТипов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст , "И Локации.Тип В(&Типы)", "");
	КонецЕсли;

	Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование) + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

