
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь(); 
	СтатусЭтапаВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусЭтапаОтклонен = Перечисления.СтатусыЭтапов.Отклонен;
	СФормироватьСписокЗаявок(); 
	
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок();
	// Евросиб US 106410 TA 106412 Рыбьяков К.А. 05.08.2025 ((
	СтатусыЭДОДокументовПТУ();
	// Евросиб Рыбьяков К.А. 05.08.2025 ))
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	Для Каждого Стр Из СписокЗаявокНаОплату Цикл
		Если не Стр.Статус = ПредопределенноеЗначение("Справочник.СтатусыДокументов.Согласована") 
			и не Стр.СтатусЗадачи = СтатусЭтапаВыполнен и Стр.ПопадаетВОтборы Тогда
			Стр.Выбрать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПодсчитатьИтоги(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Стр Из СписокЗаявокНаОплату Цикл
    	Стр.выбрать = Ложь;
	КонецЦикла;
	
	ПодсчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеДатыРеестраПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПериодОплаты) Тогда
		 ПериодОплаты = Неопределено
	КонецЕсли;	 
	ВыбранныеДатыРеестра.СортироватьПоЗначению(НаправлениеСортировки.Возр);
//	СФормироватьСписокЗаявок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьНесогласованныеПриИзменении(Элемент)

	Если не ЗначениеЗаполнено(ПериодОплаты) и ВыбранныеДатыРеестра.Количество()=0 и ВыводитьСогласованные = Истина тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период оплаты документов");
		Возврат;
	КонецЕсли;
	СписокЗаявокНаОплату.Очистить();
//	СФормироватьСписокЗаявок();

	
КонецПроцедуры  

&НаСервере
Процедура СФормироватьСписокЗаявок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПользователейСостав1.Пользователь КАК Пользователь1,
	|	ГруппыПользователейСостав1.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПользователиГруппыДКПИсполнителя
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав1
	|		ПО ГруппыПользователейСостав.Ссылка = ГруппыПользователейСостав1.Ссылка
	//Евросиб СубботинВ #117172 18.08.2025 Начало
    //  |			И (ГруппыПользователейСостав.Пользователь = &ТекущийПользователь)
	|			И (ГруппыПользователейСостав.Пользователь В (&Пользователи))
	//Евросиб СубботинВ #117172 18.08.2025 Конец
	|			И (ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ (&ДКП));
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовСрезПоследних.Объект КАК ЗаявкаНаОплату,
	|	СтатусыОбъектовСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ ВТ_документы
	|ИЗ
	|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, ) КАК СтатусыОбъектовСрезПоследних
	|ГДЕ
	|	СтатусыОбъектовСрезПоследних.Статус В(&Статус)
	|	И &ДатаНачала
	|	И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период КАК Период,
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_документы.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ВТ_документы.Статус КАК Статус,
	|	ЗаявкаНаОплатуСостояния.Состояние КАК Состояние,
	//Евросиб СубботинВ #125358 25.12.2025 Начало
	|	ЗаявкаНаОплатуСостояния.Ссылка.Контрагент КАК Контрагент,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВалютаОплаты КАК ВалютаОплаты,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоВВалютеОплаты КАК ВсегоВВалютеОплаты,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	//Евросиб СубботинВ #125358 25.12.2025 Конец
	|	ЗаявкаНаОплатуСостояния.Статус КАК СтатусЗадачи,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке КАК ВсегоПоЗаявке,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ПодразделениеДКП КАК ПодразделениеДКП,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
	|	ДоговорыКонтрагентов.УсловиеОплаты КАК УсловиеОплаты,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке * ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_КурсыВалют.Курс / ВТ_КурсыВалют.Кратность
	|	КОНЕЦ КАК ВсегоПоЗаявкеВРублях
	|ИЗ
	|	ВТ_документы КАК ВТ_документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.Состояния КАК ЗаявкаНаОплатуСостояния
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ПО ЗаявкаНаОплатуСостояния.Исполнитель = ГруппыПользователейСостав.Ссылка
	//Евросиб СубботинВ #117172 18.08.2025 Начало
	//|				И (ГруппыПользователейСостав.Пользователь = &ТекущийПользователь)
	|				И (ГруппыПользователейСостав.Пользователь В (&Пользователи))
	//Евросиб СубботинВ #117172 18.08.2025 Конец
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ЗаявкаНаОплатуСостояния.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|			ПО (ДоговорыКонтрагентов.ВалютаВзаиморасчетов = ВТ_КурсыВалют.Валюта)
	|		ПО ВТ_документы.ЗаявкаНаОплату = ЗаявкаНаОплатуСостояния.Ссылка
	|			И (ЗаявкаНаОплатуСостояния.Статус В (&СтатусыЭтапов))
	|
	//Евросиб СубботинВ #103435 27.02.2025 Начало

	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_документы.ЗаявкаНаОплату,
	//|	ВТ_документы.Статус,
	//|	ЗаявкаНаОплатуСостояния.Состояние,
	//|	ЗаявкаНаОплатуСостояния.Статус,
	//|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке,
	//|	ЗаявкаНаОплатуСостояния.Ссылка.ПодразделениеДКП,
	//|	ЗаявкаНаОплатуСостояния.Ссылка.ДатаПланируемойОплаты,
	//|	ДоговорыКонтрагентов.УсловиеОплаты,
	//|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке * ВЫБОР
	//|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаРубль
	//|			ТОГДА 1
	//|		ИНАЧЕ ВТ_КурсыВалют.Курс / ВТ_КурсыВалют.Кратность
	//|	КОНЕЦ
	//|ИЗ
	//|	ВТ_документы КАК ВТ_документы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.Состояния КАК ЗаявкаНаОплатуСостояния
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|			ПО ЗаявкаНаОплатуСостояния.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	//|			ПО (ДоговорыКонтрагентов.ВалютаВзаиморасчетов = ВТ_КурсыВалют.Валюта)
	//|		ПО ВТ_документы.ЗаявкаНаОплату = ЗаявкаНаОплатуСостояния.Ссылка
	//|			И (ЗаявкаНаОплатуСостояния.Статус В (&СтатусыЭтапов))
	//|			И (ЗаявкаНаОплатуСостояния.Исполнитель = &ТекущийПользователь)";
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_документы.ЗаявкаНаОплату,
	|	ВТ_документы.Статус,
	|	ЗаявкаНаОплатуСостояния.Состояние,
		//Евросиб СубботинВ #125358 25.12.2025 Начало
	|	ЗаявкаНаОплатуСостояния.Ссылка.Контрагент,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ДоговорКонтрагента,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВалютаОплаты,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоВВалютеОплаты,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	//Евросиб СубботинВ #125358 25.12.2025 Конец
	|	ЗаявкаНаОплатуСостояния.Статус,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ПодразделениеДКП,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ДатаПланируемойОплаты,
	|	ДоговорыКонтрагентов.УсловиеОплаты,
	|	ЗаявкаНаОплатуСостояния.Ссылка.ВсегоПоЗаявке * ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_КурсыВалют.Курс / ВТ_КурсыВалют.Кратность
	|	КОНЕЦ
	|ИЗ
	|	ВТ_документы КАК ВТ_документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.Состояния КАК ЗаявкаНаОплатуСостояния
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ЗаявкаНаОплатуСостояния.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|			ПО (ДоговорыКонтрагентов.ВалютаВзаиморасчетов = ВТ_КурсыВалют.Валюта)
	|		ПО ВТ_документы.ЗаявкаНаОплату = ЗаявкаНаОплатуСостояния.Ссылка
	|			И (ЗаявкаНаОплатуСостояния.Статус В (&СтатусыЭтапов))
	|			И (ВЫБОР
	|			КОГДА &ВыводитьСогласованные
	|				ТОГДА ЗаявкаНаОплатуСостояния.Исполнитель В
	|						(ВЫБРАТЬ
	|							ВТ_ПользователиГруппыДКПИсполнителя.Пользователь1 КАК Пользователь1
	|						ИЗ
	|							ВТ_ПользователиГруппыДКПИсполнителя КАК ВТ_ПользователиГруппыДКПИсполнителя)
	|			ИНАЧЕ
	//Евросиб СубботинВ #117172 18.08.2025 Начало
    //|		ЗаявкаНаОплатуСостояния.Исполнитель = &ТекущийПользователь
	|		ЗаявкаНаОплатуСостояния.Исполнитель В (&Пользователи) 
	//Евросиб СубботинВ #117172 18.08.2025 Конец
	|		КОНЕЦ)";   
	//Евросиб СубботинВ #103435 27.02.2025 Конец
	
	
	Если ЗначениеЗаполнено(ПериодОплаты.ДатаНачала) Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ПериодОплаты.ДатаНачала);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаНачала", "СтатусыОбъектовСрезПоследних.Объект.ДатаПланируемойОплаты >= &ДатаНачала");
	ИначеЕсли ВыбранныеДатыРеестра.Количество()>0 Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ВыбранныеДатыРеестра);;
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаНачала", "СтатусыОбъектовСрезПоследних.Объект.ДатаПланируемойОплаты В (&ДатаНачала)");
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", Истина);			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодОплаты.ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодОплаты.ДатаОкончания);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаОкончания", "СтатусыОбъектовСрезПоследних.Объект.ДатаПланируемойОплаты <= &ДатаОкончания");
	Иначе 
		Запрос.УстановитьПараметр("ДатаОкончания", Истина);			
	КонецЕсли;
	
	СтатусыЭтапов = Новый Массив ;
	СтатусыЭтапов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	СтатусыЭтапов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	СтатусыЭтапов.Добавить(СтатусЭтапаВыполнен);

    Запрос.УстановитьПараметр("СтатусыЭтапов", СтатусыЭтапов);
	
	//Евросиб СубботинВ #117172 18.08.2025 Начало
	ИсполнителиИЗамещения = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекущийПользователь, ТекущаяДата());
    //Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("Пользователи", ИсполнителиИЗамещения);
	//Евросиб СубботинВ #117172 18.08.2025 Конец

	
	//Евросиб СубботинВ #103435 27.02.2025 Начало
	Запрос.УстановитьПараметр("ДКП", Справочники.ГруппыПользователей.ДирекцияКонтейнерныхПеревозок);
	Запрос.УстановитьПараметр("ВыводитьСогласованные", ВыводитьСогласованные);
	//Евросиб СубботинВ #103435 27.02.2025 Конец
  
	МассивСтатусовДляЗапроса = Новый Массив;
	МассивСтатусовДляЗапроса.Добавить(Справочники.СтатусыДокументов.НаСогласование);
	Если ВыводитьСогласованные Тогда
		МассивСтатусовДляЗапроса.Добавить(Справочники.СтатусыДокументов.Согласована);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Статус", МассивСтатусовДляЗапроса); 
	Запрос.УстановитьПараметр("ВалютаРубль", Константы.ВалютаРегламентированногоУчета.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокЗаявокНаОплату.Загрузить(РезультатЗапроса);
	
	ПодсчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПериодОплатыПриИзменении(Элемент)
	
	Если ВыбранныеДатыРеестра.Количество()>0 Тогда
		ВыбранныеДатыРеестра.Очистить();
	КонецЕсли;
	
//	СФормироватьСписокЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура Согласовано(Команда)
	
	ОбработатьВыбранныеСтроки(СтатусЭтапаВыполнен);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьВыбранныеСтроки(ПроставляемыйСтатус)
	
	СтруктураПоиска = Новый Структура("Выбрать", Истина);
	ВыбранныеСтроки = СписокЗаявокНаОплату.НайтиСтроки(СтруктураПоиска);
	// Евросиб US 106410 TA 106412 Рыбьяков К.А. 10.07.2025 ((
	Если ПроставляемыйСтатус = СтатусЭтапаВыполнен Тогда
		Отказ = ЕстьНеЗавершенныйДокументооборот(ВыбранныеСтроки);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 10.07.2025 ))
	Для Каждого ВыбраннаяСтрока из ВыбранныеСтроки Цикл		
		МассивЗадач = Новый Массив();
		МассивЗадач.Добавить(ВыбраннаяСтрока.Состояние);
		Если ПроставляемыйСтатус = СтатусЭтапаОтклонен Тогда
			//Евросиб СубботинВ #103435 27.02.2025 Начало // если нет причины отклонения, такую строчку пропускаем и информируем пользователя
			Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Комментарий) тогда
				ОбщегоНазначения.СообщитьПользователю("Для отклонения необходимо заполнить комментарий по строке с "+  ВыбраннаяСтрока.ЗаявкаНаОплату);
				Продолжить;	
			КонецЕсли;
			//Евросиб СубботинВ #103435 27.02.2025 Конец			
			ОтметитьВыполнениеЗадачПоСсылке(ВыбраннаяСтрока.ЗаявкаНаОплату, МассивЗадач, ПроставляемыйСтатус, Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний, Истина);
			//Евросиб СубботинВ #103435 27.02.2025 Начало //
			//РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(ВыбраннаяСтрока.ЗаявкаНаОплату, Справочники.СтатусыДокументов.НеСогласована); 
			РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(ВыбраннаяСтрока.ЗаявкаНаОплату, Справочники.СтатусыДокументов.НеСогласована,,,ВыбраннаяСтрока.Комментарий); 
			//Евросиб СубботинВ #103435 27.02.2025 Конец
			//Евросиб СубботинВ #107464 05.06.2025 Начало
			Если Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиВDC.ОтправкаПисемПоСобытию Тогда
				РассылкаУведомленийПользователям.СформироватьЗаписиСобытийИзменений(ВыбраннаяСтрока.ЗаявкаНаОплату,
																				Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиВDC);
			КонецЕсли;																	
			//Евросиб СубботинВ #107464 05.06.2025 Конец			
		ИначеЕсли ПроставляемыйСтатус = СтатусЭтапаВыполнен Тогда
			ОтметитьВыполнениеЗадачПоСсылке(ВыбраннаяСтрока.ЗаявкаНаОплату, МассивЗадач, ПроставляемыйСтатус, Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
			//РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(ВыбраннаяСтрока.ЗаявкаНаОплату, Справочники.СтатусыДокументов.Отклонен); 
			СтатусДокумента = ПроверкаСтатусаЗаявки(ВыбраннаяСтрока.ЗаявкаНаОплату);
			Если НЕ СтатусДокумента = Неопределено Тогда
				РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(ВыбраннаяСтрока.ЗаявкаНаОплату, СтатусДокумента);	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	СФормироватьСписокЗаявок();
	//Евросиб СубботинВ #125358 24.12.2025 Начало // после согласования/не согласования нужно вернуть галки по оставшимся фильтрам, как они были проставлены
	//СформироватьТаблицыДляОтбора(Истина);
	СформироватьТаблицыДляОтбора(, Истина);
	//Евросиб СубботинВ #125358 24.12.2025 Конец
    СформироватьОтборСтрок();
	// Евросиб US 106410 TA 106412 Рыбьяков К.А. 05.08.2025 ((
	СтатусыЭДОДокументовПТУ();
	// Евросиб Рыбьяков К.А. 05.08.2025 ))
КонецПроцедуры 
&НаСервере
Процедура ОтметитьВыполнениеЗадач(Объект, ЗадачиДляОтметкиВыполнения = Неопределено, ПроставляемыйСтатус, СтатусСогласования) Экспорт
	
	ДатаВыполнения = ТекущаяДата();	
	
	Для Каждого СтрокаТЧ Из Объект.Состояния Цикл
		Если ЗадачиДляОтметкиВыполнения.Найти(СтрокаТЧ.Состояние) <> Неопределено И СтрокаТЧ.Статус <> СтатусЭтапаВыполнен И СтрокаТЧ.Статус <> СтатусЭтапаОтклонен Тогда
			СтрокаТЧ.Статус = ПроставляемыйСтатус;
			СтрокаТЧ.ЗавершениеРаботы = ДатаВыполнения;
			СтрокаТЧ.Исполнитель = ТекущийПользователь;
			СтрокаТЧ.СтатусСогласования = СтатусСогласования;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 &НаСервере
Процедура ОтметитьВыполнениеЗадачПоСсылке(Ссылка, ЗадачиДляОтметкиВыполнения = Неопределено, ПроставляемыйСтатус = Истина, СтатусСогласования = Неопределено, ЗадачаНаРедактирование = Ложь) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	ОтметитьВыполнениеЗадач(Объект, ЗадачиДляОтметкиВыполнения, ПроставляемыйСтатус, СтатусСогласования);
	
	//Евросиб СубботинВ #103435 27.02.2025 Начало
	Если ЗадачаНаРедактирование тогда
		ЗаявкиНаОплатуСервер.ОтправитьДокументНаРедактирование(Объект);
	КонецЕсли;
	//Евросиб СубботинВ #103435 27.02.2025 Конец	

	Если Объект.Модифицированность() Тогда
		Объект.ДополнительныеСвойства.Вставить("ЭтоЗакрытиеЗадач");
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеСогласовано(Команда)
	
	ОбработатьВыбранныеСтроки(СтатусЭтапаОтклонен);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокЗаявокПоДатам(Команда)
	
	Если не ЗначениеЗаполнено(ПериодОплаты) и ВыбранныеДатыРеестра.Количество()=0 и ВыводитьСогласованные = Истина тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период оплаты документов");
		Возврат;
	КонецЕсли;

	СФормироватьСписокЗаявок();
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок();
	
КонецПроцедуры


 &НаСервере
Функция ПроверкаСтатусаЗаявки(Заявка)
	
	СтатусДокумента = Неопределено;
	ТаблицаСостояний = Заявка.Состояния.Выгрузить(); 
	Если НЕ ТаблицаСостояний.Количество() = 0 Тогда	
		СтруктураПоиска = Новый Структура("СтатусСогласования", Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
		СтатусыСогласовано = ТаблицаСостояний.НайтиСтроки(СтруктураПоиска);
		//СтруктураПоиска = Новый Структура("СтатусСогласования", Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
		//СтатусыОтклонено = ТаблицаСостояний.НайтиСтроки(СтруктураПоиска);
		Если СтатусыСогласовано.Количество() = ТаблицаСостояний.Количество() Тогда //Документ Согласован
			СтатусДокумента = Справочники.СтатусыДокументов.Согласована;
		//ИначеЕсли СтатусыОтклонено.Количество()>0 Тогда //Документ отклонен
		//		СтатусДокумента = Справочники.СтатусыДокументов.Отклонен;
		//ИначеЕсли (СтатусыСогласовано.Количество()> 0 и СтатусыСогласовано.Количество()< ТаблицаСостояний.Количество())
		//	и СтатусыОтклонено.Количество() = 0 Тогда //процесс согласования в процессеи и "отклонен" еще нет 
		КонецЕсли;		
	КонецЕсли;	
    Возврат СтатусДокумента
	
КонецФункции

&НаСервере
Процедура ПодсчитатьИтоги(ТолькоВыбранные = Ложь)
	
	Если НЕ ТолькоВыбранные Тогда 
		ЗаявленоКОплате = 0;
		СогласованоКОплате = 0;
		
		ЗаявленоКОплате = СписокЗаявокНаОплату.Итог("ВсегоПоЗаявкеВРублях");
		
		ПараметрыОтбора = Новый Структура("СтатусЗадачи", Перечисления.СтатусыЭтапов.Выполнен);
		ОбработанныеСтроки = СписокЗаявокНаОплату.Выгрузить(ПараметрыОтбора);
		СогласованоКОплате = ОбработанныеСтроки.Итог("ВсегоПоЗаявкеВРублях");
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Выбрать", Истина);
	Выбранные = СписокЗаявокНаОплату.Выгрузить(ПараметрыОтбора);
	СуммаПоОтобраннымСтрокам = Выбранные.Итог("ВсегоПоЗаявкеВРублях");
	
КонецПроцедуры	

//установить пометки
&НаКлиенте
Процедура УсловияОплатыВыделитьВсе(Команда)
	УстановитьСнятьПометки("ОтборУсловиеОплаты", Истина)
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыделитьВсе(Команда)
 	УстановитьСнятьПометки("ОтборПодразделение", Истина)
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыВыделитьВсе(Команда)
  	УстановитьСнятьПометки("ОтборДатаОплаты", Истина)
КонецПроцедуры

//снять пометки
&НаКлиенте
Процедура УсловияОплатыСнятьВыделениеСтрок(Команда)
	УстановитьСнятьПометки("ОтборУсловиеОплаты", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияСнятьВыделениеСтрок(Команда)
 	УстановитьСнятьПометки("ОтборПодразделение", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыСнятьВыделениеСтрок(Команда)
  	УстановитьСнятьПометки("ОтборДатаОплаты", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометки(СписокЗначений, ЗначениеПометки)
	
	Для Каждого СтрокаСписка из ЭтаФорма[СписокЗначений] Цикл
		СтрокаСписка.Пометка = ЗначениеПометки;
	КонецЦикла;
	СформироватьОтборСтрок();

КонецПроцедуры

&НаСервере
Процедура СформироватьОтборСтрок()
	
	Для Каждого СтрокаТЧ из СписокЗаявокНаОплату Цикл
		СтрокаТЧ.ПопадаетВОтборы = Ложь;
	КонецЦикла;
	ОтборСтрок = Новый Структура("ПопадаетВОтборы", Истина);
	Элементы.СписокЗаявокНаОплату.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);

	
	ТаблицаЗаявок = СписокЗаявокНаОплату.Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗаявок.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ТаблицаЗаявок.Статус КАК Статус,
	|	ТаблицаЗаявок.Состояние КАК Состояние,
	|	ТаблицаЗаявок.СтатусЗадачи КАК СтатусЗадачи,
	|	ТаблицаЗаявок.ВсегоПоЗаявке КАК ВсегоПоЗаявке,
	|	ТаблицаЗаявок.ПодразделениеДКП КАК ПодразделениеДКП,
	|	ТаблицаЗаявок.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
	|	ТаблицаЗаявок.УсловиеОплаты КАК УсловиеОплаты,
	|	ТаблицаЗаявок.ВсегоПоЗаявкеВРублях КАК ВсегоПоЗаявкеВРублях
    |ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	&ТаблицаЗаявок КАК ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ВТ_Заявки.Статус КАК Статус,
	|	ВТ_Заявки.Состояние КАК Состояние,
	|	ВТ_Заявки.СтатусЗадачи КАК СтатусЗадачи,
	|	ВТ_Заявки.ВсегоПоЗаявке КАК ВсегоПоЗаявке,
	|	ВТ_Заявки.ПодразделениеДКП КАК ПодразделениеДКП,
	|	ВТ_Заявки.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
	|	ВТ_Заявки.УсловиеОплаты КАК УсловиеОплаты,
	|	ВТ_Заявки.ВсегоПоЗаявкеВРублях КАК ВсегоПоЗаявкеВРублях
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|ГДЕ
	|	&ДатаПланируемойОплаты
	|	и &УсловиеОплаты";
	
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	
	// отбор по датам
	МассивЗначенийПоДатам = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборДатаОплаты Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийПоДатам.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	//отборы по подразделениям
	МассивЗначенийПодразделений = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборПодразделение Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийПодразделений.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// отбор условие оплаты
	МассивЗначенийУсловийОплаты = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборУсловиеОплаты Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийУсловийОплаты.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗначенийПоДатам.Количество() = 0 И МассивЗначенийПодразделений.Количество() = 0 И МассивЗначенийУсловийОплаты.Количество() = 0 Тогда 
		Элементы.СписокЗаявокНаОплатуВсегоПоЗаявкеВРублях.ТекстПодвала = 0;
		Возврат
	Иначе 	
		//параметр запроса по дате
		Если МассивЗначенийПоДатам.Количество() Тогда		
			Запрос.УстановитьПараметр("ДатаПланируемойОплаты", МассивЗначенийПоДатам);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПланируемойОплаты", "ВТ_Заявки.ДатаПланируемойОплаты В(&ДатаПланируемойОплаты)");
		Иначе
			Запрос.УстановитьПараметр("ДатаПланируемойОплаты", Истина);
		КонецЕсли;	
		//параметр запроса по подразделению
		Если МассивЗначенийПодразделений.Количество() Тогда
			Запрос.УстановитьПараметр("ОтборГруппаПользователей", МассивЗначенийПодразделений);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_Заявки КАК ВТ_Заявки",
			"ВТ_Заявки КАК ВТ_Заявки
			|	Внутреннее СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
			|	ПО (ГруппыПользователейСостав.Ссылка В (&ОтборГруппаПользователей))
			|	И (НЕ ГруппыПользователейСостав.Пользователь.Недействителен)
			|	И (НЕ ГруппыПользователейСостав.Пользователь.ПометкаУдаления)
			|	И (ВТ_Заявки.ЗаявкаНаОплату.ОтветственныйЗаОплату = ГруппыПользователейСостав.Пользователь)");
		КонецЕсли;
		// параметр запроса по условию оплаты
		Если МассивЗначенийУсловийОплаты.Количество() Тогда
			Запрос.УстановитьПараметр("УсловиеОплаты", МассивЗначенийУсловийОплаты);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОплаты", "ВТ_Заявки.УсловиеОплаты В (&УсловиеОплаты)");
		Иначе 
			Запрос.УстановитьПараметр("УсловиеОплаты", Истина);
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить(); 
		
		Для Каждого СтрокаРезультата из Результат Цикл
			СтруктураПоиска = Новый Структура("ЗаявкаНаОплату", СтрокаРезультата.ЗаявкаНаОплату);
			НайденныеСтроки = СписокЗаявокНаОплату.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаПоЗаявке из НайденныеСтроки Цикл
				СтрокаПоЗаявке.ПопадаетВОтборы = Истина;
			КонецЦикла;			
		КонецЦикла;
		Элементы.СписокЗаявокНаОплатуВсегоПоЗаявкеВРублях.ТекстПодвала = Результат.Итог("ВсегоПоЗаявкеВРублях");
	КонецЕсли;
	

КонецПроцедуры	

Процедура СформироватьТаблицыДляОтбора(ПроставитьПометкиПоДате = Ложь, ВернутьПроставленныеОтборы = Ложь)
	
	//Евросиб СубботинВ #125358 24.12.2025 Начало
	Если ВернутьПроставленныеОтборы Тогда
		МассивТаблиц = Новый Массив;
		КопияОтборДаты = ОтборДатаОплаты.Скопировать();
		КопияОтборПодразделения = ОтборПодразделение.Скопировать();
		КопияОтборУсловиеОплаты = ОтборУсловиеОплаты.Скопировать();
	КонецЕсли;
	//Евросиб СубботинВ #125358 24.12.2025 Конец
	
	ОтборДатаОплаты.Очистить();
	ТЗДаты = СписокЗаявокНаОплату.Выгрузить(,"ДатаПланируемойОплаты");
	ТЗДаты.Свернуть("ДатаПланируемойОплаты");
	ТЗДаты.Сортировать("ДатаПланируемойОплаты Возр");
	Для Каждого ДатаОплаты из ТЗДаты Цикл
		ОтборДатаОплаты.Добавить(ДатаОплаты.ДатаПланируемойОплаты);
	КонецЦикла;
			
	ОтборПодразделение.Очистить();
	ТЗПодразделения = СписокЗаявокНаОплату.Выгрузить(,"ПодразделениеДКП");
	ТЗПодразделения.Свернуть("ПодразделениеДКП");
	Для Каждого ДКП из ТЗПодразделения Цикл
		ОтборПодразделение.Добавить(ДКП.ПодразделениеДКП);
	КонецЦикла;
	
    ОтборУсловиеОплаты.Очистить();
	ТЗДаты = СписокЗаявокНаОплату.Выгрузить(,"УсловиеОплаты");
	ТЗДаты.Свернуть("УсловиеОплаты");
	Для Каждого ДатаОплаты из ТЗДаты Цикл 
		ОтборУсловиеОплаты.Добавить(ДатаОплаты.УсловиеОплаты);
	КонецЦикла;
	
	Если ПроставитьПометкиПоДате Тогда
		 ОтборДатаОплаты.ЗаполнитьПометки(Истина);
	КонецЕсли;
	
	//Евросиб СубботинВ #125358 24.12.2025 Начало
	Если ВернутьПроставленныеОтборы Тогда
		МассивТаблиц.Добавить(Новый Структура("ТаблицаОтбора, КопияТаблицы", ОтборДатаОплаты, КопияОтборДаты));
		МассивТаблиц.Добавить(Новый Структура("ТаблицаОтбора, КопияТаблицы", ОтборПодразделение, КопияОтборПодразделения));
		МассивТаблиц.Добавить(Новый Структура("ТаблицаОтбора, КопияТаблицы", ОтборУсловиеОплаты, КопияОтборУсловиеОплаты));
		УстановитьФильтрыПослеОбновления(МассивТаблиц); 
	КонецЕсли;
	//Евросиб СубботинВ #125358 24.12.2025 Конец
		 
КонецПроцедуры	                    

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	 СформироватьОтборСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОплатыПриИзменении(Элемент)
	 СформироватьОтборСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ОтборУсловиеОплатыПриИзменении(Элемент)
	 СформироватьОтборСтрок();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокНаОплатуВыбратьПриИзменении(Элемент)
	ПодсчитатьИтоги(Истина);
КонецПроцедуры

&НаСервере
Функция СохранитьExcelНаСервере()
	ТабЗнч = СписокЗаявокНаОплату.Выгрузить();
	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабЗнч);
	ТабДок = Новый ТабличныйДокумент;                  
	ПострПечать.Вывести(ТабДок); 
	Возврат ТабЗнч;
КонецФункции

&НаКлиенте
Процедура СохранитьExcel(Команда)
	ТабДок = СохранитьExcelНаСервере();
	ТабДок.Показать();
КонецПроцедуры 

Функция ЕстьНеЗавершенныйДокументооборот(СписокЗаявок)
	// Евросиб US 106410 TA 106412 Рыбьяков К.А. 10.07.2025 ((
	СогласованиеЗапрещено = Ложь;
	МассивЗаявок = Новый Массив;
	
	Для Каждого Строка Из СписокЗаявок Цикл
		Если Строка.Состояние = Справочники.Состояния.Согласование И Строка.ДокументооборотНеЗавершен Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Условия расчетов в договоре «оплата по факту». ПТУ №%1, дата %2 не подписан в ЭДО. Согласование заявки отменено.'"), Строка.НомерПТУ, Строка.ДатаПТУ);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			СогласованиеЗапрещено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СогласованиеЗапрещено;
	
КонецФункции

// Евросиб US 106410 TA 106412 Рыбьяков К.А. 10.07.2025 ((
Процедура СтатусыЭДОДокументовПТУ()
	
	МассивЗаявок = Новый Массив;
	
	Для Каждого Строка Из СписокЗаявокНаОплату Цикл
		МассивЗаявок.Добавить(Строка.ЗаявкаНаОплату);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК ЗаявкаНаОплату
	|ПОМЕСТИТЬ Вт_ОснованияДляПлатежа
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка В(&Документы)
	|	И ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДоговорКонтрагента.УсловиеОплаты = Значение(Перечисление.ВидыУсловийОплаты.ОплатаПоФакту)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка КАК СсылкаПТУ,
	|	ЗаявкаНаОплатуДокументыНаОплату.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|ПОМЕСТИТЬ Вт_ДокументыПоступленияТоваровУслуг
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОснованияДляПлатежа КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа
	|ГДЕ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика В
	|			(ВЫБРАТЬ
	|				Вт_ОснованияДляПлатежа.ОснованиеДляПлатежа
	|			ИЗ
	|				Вт_ОснованияДляПлатежа КАК Вт_ОснованияДляПлатежа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ДокументыПоступленияТоваровУслуг.СсылкаПТУ КАК Документ,
	|	НЕОПРЕДЕЛЕНО КАК СвязаннаяПТУСКорПТУ,
	|	Вт_ДокументыПоступленияТоваровУслуг.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|ПОМЕСТИТЬ ВТ_ДокументыДляПроверки
	|ИЗ
	|	Вт_ДокументыПоступленияТоваровУслуг КАК Вт_ДокументыПоступленияТоваровУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументКорректировкаПоступления.Ссылка,
	|	Вт_ДокументыПоступленияТоваровУслуг.СсылкаПТУ,
	|	Вт_ДокументыПоступленияТоваровУслуг.ЗаявкаНаОплату
	|ИЗ
	|	Вт_ДокументыПоступленияТоваровУслуг КАК Вт_ДокументыПоступленияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК ДокументКорректировкаПоступления
	|		ПО Вт_ДокументыПоступленияТоваровУслуг.СсылкаПТУ = ДокументКорректировкаПоступления.ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_Документы.Документ КАК Документ,
	|	ВТ_ДокументыДляПроверки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	Диадок_Документы.Статус КАК СтатусЭДО,
	|	Диадок_Документы.Документ.Номер КАК Номер,
	|	Диадок_Документы.Документ.Дата КАК Дата
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки
	|		ПО (ВТ_ДокументыДляПроверки.Документ = Диадок_Документы.Документ)
	|ГДЕ
	|	Диадок_Документы.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_ДокументыДляПроверки.Документ
	|			ИЗ
	|				ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки)
	|	И (Диадок_Документы.Статус = ""Не подписан""
	|	ИЛИ Диадок_Документы.Статус = ""Ожидается подпись контрагента""
	|	ИЛИ Диадок_Документы.Статус = ""Требуется подпись"" 
	|	ИЛИ Диадок_Документы.Статус = ""Требуется подписать и отправить"" 
	|	ИЛИ Диадок_Документы.Статус = ""На подписании"" 
	|	ИЛИ Диадок_Документы.Статус = ""Ожидается извещение о получении"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ УБЫВ";
	
	Запрос.УстановитьПараметр("Документы", МассивЗаявок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура("ЗаявкаНаОплату", Выборка.ЗаявкаНаОплату);
		СтрокиТаблицы = СписокЗаявокНаОплату.НайтиСтроки(СтруктураОтбора);
		Для Каждого Строка Из СтрокиТаблицы Цикл
			Строка.ДокументооборотНеЗавершен = Истина;
			Строка.НомерПТУ = Выборка.Номер;
			Строка.ДатаПТУ = Выборка.Дата;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 10.07.2025 )) 


//Евросиб СубботинВ #125358 24.12.2025 Начало
Процедура УстановитьФильтрыПослеОбновления(МассивСтруктурТаблицОтбора)
	
	Для Каждого ПараТаблиц из МассивСтруктурТаблицОтбора Цикл
		Для Каждого СтрокаТаблицыОтбора из ПараТаблиц.ТаблицаОтбора Цикл
			Для Каждого СтрокаКопииТаблицыОтбора из ПараТаблиц.КопияТаблицы Цикл
				Если СтрокаТаблицыОтбора.Значение = СтрокаКопииТаблицыОтбора.Значение Тогда
					СтрокаТаблицыОтбора.Пометка = СтрокаКопииТаблицыОтбора.Пометка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	 
	
КонецПроцедуры	
//Евросиб СубботинВ #125358 24.12.2025 Конец
