
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

&НаКлиенте
Процедура СтраныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьНазвание();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНазвание()
	
	Наименование = "";
	
	Для Каждого Страна Из Объект.Страны Цикл
		НаименованиеСтраны = Страна.Страна.Наименование;
		Наименование = Наименование + НаименованиеСтраны + ", ";

	КонецЦикла;
	Наименование = Лев(Наименование, СтрДлина(Наименование) - 2);
	
	Объект.Наименование = Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраныПослеУдаления(Элемент)
	ОбновитьНазвание();
КонецПроцедуры
