
&НаКлиенте
Процедура КонтрольНепревышенияЧисловогоПоказателяПриИзменении(Элемент)
	
	Если Объект.КонтрольНепревышенияЧисловогоПоказателя Тогда
		
		Объект.КонтрольВхожденияВРегион = Ложь;
		Объект.КонтрольТребованияФлажком = Ложь;
		Объект.КонтрольСоответствияКонтрагенту = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольВхожденияВРегионПриИзменении(Элемент)
	
	Если Объект.КонтрольВхожденияВРегион Тогда
		
		Объект.КонтрольТребованияФлажком = Ложь;
		Объект.КонтрольНепревышенияЧисловогоПоказателя = Ложь;
		Объект.КонтрольСоответствияКонтрагенту = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольТребованияФлажкомПриИзменении(Элемент)
	
	Если Объект.КонтрольТребованияФлажком Тогда
		
		Объект.КонтрольНепревышенияЧисловогоПоказателя = Ложь;
		Объект.КонтрольВхожденияВРегион = Ложь;
		Объект.КонтрольСоответствияКонтрагенту = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольСоответствияКонтрагентуПриИзменении(Элемент)
	
	Если Объект.КонтрольСоответствияКонтрагенту Тогда
		
		Объект.КонтрольНепревышенияЧисловогоПоказателя = Ложь;
		Объект.КонтрольВхожденияВРегион = Ложь;
		Объект.КонтрольТребованияФлажком = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
