
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДатаСеанса();
	
	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = Неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	СогласованиеСогласованСКомментариями = Ложь;
	
	Для Каждого Стр Из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование Тогда
			Продолжить;
		КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато Или Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = Неопределено 
									Или СогласованиеЗавершено) 
									И Стр.СтатусСогласования <> Перечисления.СтатусыСогласования.Планируется 
									И (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен 
									Или Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен);
		СогласованиеОтклонен = СогласованиеОтклонен Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
		СогласованиеСогласованСКомментариями = СогласованиеСогласованСКомментариями Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	КонецЕсли;
	
	Если СогласованиеНачато = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении;
	КонецЕсли;
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда 
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
		
		Если СогласованиеСогласованСКомментариями = Истина Тогда
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями;	
		Иначе
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
		
	КонецЕсли;
	
	СогласованиеСервер.ОбработатьОтменуСогласованияДокументаПередЗаписью(ЭтотОбъект);
	
	РеквизитыРеестраДляСравнения = "Организация, ЦФО, ВидПеревозки, НаправлениеПеревозки";
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект, РеквизитыРеестраДляСравнения); 
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Документы.РеестрСпециальныхСтавок.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРеестрСпециальныхСтавок(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	УстановитьСтатусДокумента();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Автор = Пользователи.ТекущийПользователь();
	Маршрутизировать = Истина;
	
	Если ЗначениеЗаполнено(Автор) Тогда
		РеквизитыАвтора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Автор, "ЦФО, Подразделение");
		ЦФО = РеквизитыАвтора.ЦФО;
		Подразделение = РеквизитыАвтора.Подразделение;
	КонецЕсли;
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Создано = ТекущаяДата();
	Дата = Создано;
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "СтатусДокумента, Наименование, Номер, Автор, Создано, Дата, Комментарий");
		Рейсы.Загрузить(ДанныеЗаполнения.Рейсы.Выгрузить());
		Контрагенты.Загрузить(ДанныеЗаполнения.Контрагенты.Выгрузить());
		ТипыКлиента.Загрузить(ДанныеЗаполнения.ТипыКлиента.Выгрузить());
		ПунктыОтправленияЖД.Загрузить(ДанныеЗаполнения.ПунктыОтправленияЖД.Выгрузить());
		ПунктыНазначенияЖД.Загрузить(ДанныеЗаполнения.ПунктыНазначенияЖД.Выгрузить());
		ПортыОтправленияФрахт.Загрузить(ДанныеЗаполнения.ПортыОтправленияФрахт.Выгрузить());
		ПортыНазначенияФрахт.Загрузить(ДанныеЗаполнения.ПортыНазначенияФрахт.Выгрузить());
		СпециальныеСтавки.Загрузить(ДанныеЗаполнения.СпециальныеСтавки.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ЗаписьИзФормы") Тогда
		ТекущийСтатус = ДополнительныеСвойства.ТекущийСтатус;
		СтатусДокументаПервичный = ДополнительныеСвойства.СтатусДокументаПервичный;
		СостояниеДокументаПервичное = ДополнительныеСвойства.СостояниеДокументаПервичное;
		
		Если НЕ ЭтотОбъект.Состояния.Количество() = 0 
			И СостояниеДокументаПервичное = Справочники.Состояния.НайтиПоКоду("00520") // это временно, если фт не поменяется сделаю предопределеным
			И ЭтотОбъект.ТекущееСостояние = Справочники.Состояния.Согласование 
			И ТекущийСтатус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			//И СтатусДокументаПервичный = Перечисления.СтатусыЭтапов.ВРаботе 
			РаботаСЗадачами.СформироватьЗадачуИПисьмо(ЭтотОбъект);
		Иначе
			Задачи.ЗадачаИсполнителя.УдалитьЗадачиПоОбъекту(Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Истина;
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДатаСеанса();
	Редактор = Неопределено;
	Изменено = Неопределено;
	Наименование = Неопределено;
	Комментарий = "";
	Состояния.Очистить();
		
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	ТекущееСостояние = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗнч(Применяется) <> Тип("ДокументСсылка.ПСЦ") Тогда
		ПроверяемыеРеквизиты.Добавить("ВидПеревозки");
		РеквизитНачалоДействия = ПроверяемыеРеквизиты.Найти("НачалоДействия");
		Если РеквизитНачалоДействия <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитНачалоДействия);
		КонецЕсли;
		РеквизитОкончаниеДействия = ПроверяемыеРеквизиты.Найти("ОкончаниеДействия");
		Если РеквизитОкончаниеДействия <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитОкончаниеДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

Процедура УстановитьСтатусДокумента() Экспорт

	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = Неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	СогласованиеСогласованСКомментариями = Ложь;
	
	ПолучениеПодписанногоНевозможно = Ложь;
	Если СтатусДокумента = Перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно тогда
		ПолучениеПодписанногоНевозможно = Истина
	КонецЕсли;
	
	ИскомыеСостоянияПодписания = Новый Массив;
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПрикрепитьСканКопиюПодписанногоСДвухСторонПротокола);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПереводПротоколаВподписан);
	
	Для Каждого Стр Из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование 
				ИЛИ Стр.Состояние = Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ Тогда 
			Продолжить;
		КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = Неопределено ИЛИ СогласованиеЗавершено) И Стр.СтатусСогласования <> Перечисления.СтатусыСогласования.Планируется И (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Или Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен);		
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
		СогласованиеСогласованСКомментариями = СогласованиеСогласованСКомментариями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	КонецЕсли;
	
	Если СогласованиеНачато = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении;
	КонецЕсли;	
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
		
		Если СогласованиеСогласованСКомментариями = Истина Тогда
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями;	
		Иначе
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры