
&НаСервере
Функция СоздатьСчетФактуру(ВидСчетаФактуры, ДанныеЗаполнения, Партия = Неопределено) Экспорт
	ОбъектСчетФактуры = Документы[ВидСчетаФактуры].СоздатьДокумент();
	//ОбъектСчетФактуры.Дата = ДанныеЗаполнения.Дата;
	//ОбъектСчетФактуры.Записать();
	ОбъектСчетФактуры.Заполнить(ДанныеЗаполнения);
//	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДанныеЗаполнения,ОбъектСчетФактуры, Партия);
	Возврат Истина;// ОбъектСчетФактуры.Ссылка;
КонецФункции

&НаСервере
Функция НайтиПодчиненныйСчетФактуру(Знач ДокументСсылка, ВидСчетаФактуры = "СчетФактураВыданный",Партия = неопределено,Отбор = Неопределено,Покупатель = Неопределено)  Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка.Ссылка) Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СчетФактураВыданный.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			                      |ГДЕ
			                      |	СчетФактураВыданный.ДокументОснование = &ДокументОснование");
			Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НайденныйДокумент = Выборка.Ссылка;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаПоступления")  
			или (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") и ВидСчетаФактуры = "СчетФактураПолученный") тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СчетФактураПолученный.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			                      |ГДЕ
			                      |	СчетФактураПолученный.ДокументОснование = &ДокументОснование");
			Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
			// Шейко О.Е. (25.01.2021) Добавлен отбор помеченных на удаление для Корр ПТУ
			Если Отбор <> Неопределено И ТипЗнч(Отбор) = Тип("Структура") Тогда
				
				Для каждого КлЗн Из Отбор Цикл
				
					Запрос.Текст = Запрос.Текст + " И СчетФактураПолученный."+КлЗн.Ключ + " = &" + КлЗн.Ключ;
					Запрос.УстановитьПараметр(КлЗн.Ключ, КлЗн.Значение);
				
				КонецЦикла; 
				
			КонецЕсли; 
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НайденныйДокумент = Выборка.Ссылка;
			КонецЕсли;
			
		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") и ВидСчетаФактуры = "СчетФактураВыданный" тогда
			
			Если Партия <> Неопределено Тогда
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	СчетФактураВыданный.Ссылка КАК Ссылка
				                      |ИЗ
				                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
				                      |ГДЕ
				                      |	СчетФактураВыданный.ДокументОснование = &ДокументОснование
				                      |	И СчетФактураВыданный.Продавец = &Продавец");
				Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
				Запрос.УстановитьПараметр("Продавец", Партия.Контрагент);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НайденныйДокумент = Выборка.Ссылка;
				КонецЕсли;
				
			Иначе
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	СчетФактураВыданный.Ссылка КАК Ссылка
				                      |ИЗ
				                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
				                      |ГДЕ
				                      |	СчетФактураВыданный.ДокументОснование = &ДокументОснование
				                      |	И СчетФактураВыданный.Продавец = &Продавец");
				Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
				Запрос.УстановитьПараметр("Продавец",Справочники.Контрагенты.ПустаяСсылка());
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НайденныйДокумент = Выборка.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") и ВидСчетаФактуры = "СчетФактураПолученный" тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СчетФактураПолученный.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			                      |ГДЕ
			                      |	СчетФактураПолученный.ДокументОснование = &ДокументОснование");
			Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НайденныйДокумент = Выборка.Ссылка;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") и Покупатель <> Неопределено Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СчетФактураВыданный.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			                      |ГДЕ
			                      |	СчетФактураВыданный.ДокументОснование = &ДокументОснование
			                      |	И СчетФактураВыданный.Контрагент = &Покупатель");
			Запрос.УстановитьПараметр("ДокументОснование",ДокументСсылка);
			Запрос.УстановитьПараметр("Покупатель",Покупатель);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				НайденныйДокумент = Выборка.Ссылка;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			НайденныйДокумент = ДокументСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции

Функция ПолучитьРеквизитыСчетФактуры(Знач ДокументОбъект, ВидСчетаФактуры, Отбор=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) тогда
		
		СчФ = НайтиПодчиненныйСчетФактуру(ДокументОбъект.Ссылка, ВидСчетаФактуры,,Отбор); // Шейко О.Е. (25.01.2021) Не работаем с помеченной на удаление счет фактурой
		Если СчФ <> Неопределено Тогда
			//Евросиб Гудкова( 02.01.2021 Ticket№ 0218691
			//было
			//РеквизитыСФ = Новый Структура;
			//РеквизитыСф.Вставить("Номер",СчФ.Номер);
			//РеквизитыСФ.Вставить("Дата",СчФ.Дата);
			//РеквизитыСф.Вставить("ПометкаУдаления",СчФ.ПометкаУдаления);
			Если ВидСчетаФактуры = "СчетФактураВыданный" Тогда
				СписокРеквизитов = "Номер,Дата,ПометкаУдаления,НомерДляПечати,ДатаДокумента";
			Иначе
				СписокРеквизитов = "Номер,Дата,ПометкаУдаления,НомерВходящегоДокумента,ДатаВходящегоДокумента";
			КонецЕсли; 
			РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчФ, СписокРеквизитов);
			// Евросиб Гудкова) 			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РеквизитыСФ;
	
КонецФункции

// ПерезаполнениеПомеченного - Требуется для очистки и ПРАВИЛЬНОГО заполнения реквизитов счет фактуры, а не обновления
Процедура ЗаполнитьРеквизитыСчФПоОснованию(ДанныеЗаполненияСсылка, СчФСсылка, Партия = Неопределено, Покупатель = Неопределено, ТекСсылка = Неопределено, ПерезаполнениеПомеченного=Ложь, ТолькоШапка = Истина) Экспорт
	
	//Евросиб Каблов 02.04.2021 (
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполненияСсылка.Организация); //Гудкова
	РеквизитПериодВО = ДанныеЗаполненияСсылка.Метаданные().Реквизиты.Найти("ПериодВО");
	Если РеквизитПериодВО <> Неопределено Тогда
		ПериодВО = ДанныеЗаполненияСсылка.ПериодВО;
	Иначе
		//Евросиб Каблов 09.04.2025 ( #105407
		//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполненияСсылка.Организация);
		Если ТипЗнч(СчФСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ДанныеЗаполненияСсылка.Организация);
		Иначе
			ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполненияСсылка.Организация);
		КонецЕсли;
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли;
	//Евросиб Каблов 02.04.2021 )
	Если ТипЗнч(СчФСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") или ТипЗнч(СчФСсылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		СчФСсылка = СчФСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	#Область РеализацияТоваровУслуг_КорректировкаРеализации
	Если ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураВыданный") 
		и (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		или ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда
		
		СчФ = СчФСсылка;
//Евросиб Гудкова( 24.02.2020 
#Область было
	  //ДанныеЗаполнения = ДанныеЗаполненияСсылка.ПолучитьОбъект();
	  //  СчФ.Дата = ДанныеЗаполнения.Дата;
	  //  Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	  //  	СчФ.Номер = ДанныеЗаполнения.Номер;
	  //  	СчФ.НомерДляПечати = ДанныеЗаполнения.НомерДляПечати; //ДанныеЗаполнения.Номер+"/"+?(ДанныеЗаполненияСсылка.СчетНаОплатуПокупателю.Номер<>"",ДанныеЗаполненияСсылка.СчетНаОплатуПокупателю.Номер+"/","")+?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
	  //  Иначе
	  //  	Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	  //  		СчФ.НомерДляПечати = ДанныеЗаполнения.НомерДляПечати;// ДанныеЗаполнения.Номер+"/"+?(ДанныеЗаполненияСсылка.ДокументРеализации.СчетНаОплатуПокупателю.Номер<>"",ДанныеЗаполненияСсылка.ДокументРеализации.СчетНаОплатуПокупателю.Номер+"/","")+?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
	  //  	КонецЕсли;
	  //  КонецЕсли;
		//СформироватьНомерДляПечати
	   
		//СчФ.ДатаДокумента = ДанныеЗаполнения.ДатаДокумента;
		//СчФ.ПериодВО = ДанныеЗаполнения.ПериодВО;
		//СчФ.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//СчФ.ДокументОснование = ДанныеЗаполненияСсылка;
		//СчФ.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		//СчФ.КодСпособаВыставления = ДанныеЗаполнения.ДоговорКонтрагента.КодСпособаВыставления;
		//СчФ.ДоверенностьЗаРуководителя = ДанныеЗаполнения.ДоверенностьЗаРуководителя;
		//СчФ.ДоверенностьЗаГлБухгалтера = ДанныеЗаполнения.ДоверенностьЗаГлБухгалтера;
		//СчФ.Контрагент = ДанныеЗаполнения.Контрагент;
		//СчФ.Организация = ДанныеЗаполнения.Организация;
		//СчФ.Ответственный = ДанныеЗаполнения.Ответственный;
		//СчФ.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	СчФ.ГлавныйБухгалтер = ДанныеЗаполнения.ГлавныйБухгалтер;
		//	СчФ.Руководитель = ДанныеЗаполнения.Руководитель;	
		//ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") и ТипЗнч(ДанныеЗаполненияСсылка.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	СчФ.ГлавныйБухгалтер = ДанныеЗаполненияСсылка.ДокументРеализации.ГлавныйБухгалтер;
		//	СчФ.Руководитель = ДанныеЗаполненияСсылка.ДокументРеализации.Руководитель;	
		//КонецЕсли;
		////СчФ.Выставлен = Истина;
		////СчФ.ДатаВыставления = ТекущаяДата();
		//Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	СчФ.ДокументыОснования.Очистить();
		//	НовСтр = СчФ.ДокументыОснования.Добавить();
		//	НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
		//ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		//	СчФ.ДокументыОснования.Очистить();
		//	НовСтр = СчФ.ДокументыОснования.Добавить();
		//	НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
		//	КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументРеализации,"СчетФактураВыданный");
		//	Если КорректируемыйСчФ <> Неопределено Тогда
		//		НовСтр.НомерИсходногоДокумента = КорректируемыйСчФ.НомерДляПечати;
		//		//НовСтр.ДатаИсходногоДокумента = КорректируемыйСчФ.Дата;
		//		НовСтр.ДатаИсходногоДокумента = КорректируемыйСчФ.ДатаДокумента;
		//		СчФ.НомерИсходногоДокумента = КорректируемыйСчФ.НомерДляПечати;
		//		//СчФ.ДатаИсходногоДокумента = КорректируемыйСчФ.Дата;
		//		СчФ.ДатаИсходногоДокумента = КорректируемыйСчФ.ДатаДокумента;
		//		СуммаНДС = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС")+ ДанныеЗаполнения.АгентскиеУслуги.Итог("СуммаНДС");		
		//		//Сумма = ДанныеЗаполнения.СуммаДокумента;
		//		Сумма = ДанныеЗаполнения.Товары.Итог("Сумма") + ДанныеЗАполнения.Услуги.Итог("Сумма") +ДанныеЗАполнения.АгентскиеУслуги.Итог("Сумма")+СуммаНДС;
		//		СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения")+ДанныеЗАполнения.АгентскиеУслуги.Итог("СуммаНДСДоИзменения");
		//		СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+ДанныеЗАполнения.АгентскиеУслуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;

		//		Если Сумма - СуммаДоИзменения > 0 Тогда
		//			НовСтр.СуммаУвеличение =  Сумма - СуммаДоИзменения;
		//		ИначеЕсли  Сумма - СуммаДоИзменения < 0 Тогда
		//			НовСтр.СуммаУменьшение = СуммаДоИзменения - Сумма;
		//		КонецЕсли;
		//		Если СуммаНДС - СуммаНДСДоИзменения >0 Тогда
		//			НовСтр.СуммаНДСУвеличение = СуммаНДС - СуммаНДСДоИзменения;
		//		ИначеЕсли СуммаНДС - СуммаНДСДоИзменения < 0 Тогда
		//			НовСтр.СуммаНДСУменьшение = СуммаНДСДоИзменения - СуммаНДС;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//СчФ.КодВидаОперации = "01";	
		////Суммы документа
		//Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	СчФ.Сумма = ДанныеЗаполнения.СуммаДокумента;
		//	СчФ.СуммаНДС = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС")+ ДанныеЗаполнения.АгентскиеУслуги.Итог("СуммаНДС");
		//ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		//	СчФ.Сумма = ДанныеЗаполнения.СуммаДокумента;
		//	СчФ.СуммаНДС = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС")+ ДанныеЗаполнения.АгентскиеУслуги.Итог("СуммаНДС");		
		//	СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения")+ ДанныеЗАполнения.АгентскиеУслуги.Итог("СуммаНДСДоИзменения");
		//	СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+ ДанныеЗАполнения.АгентскиеУслуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;

		//	Если СчФ.Сумма - СуммаДоИзменения > 0 Тогда
		//		СчФ.СуммаУвеличение =  СчФ.Сумма - СуммаДоИзменения;
		//	ИначеЕсли  СчФ.Сумма - СуммаДоИзменения < 0 Тогда
		//		СчФ.СуммаУменьшение = СуммаДоИзменения - СчФ.Сумма;
		//	КонецЕсли;
		//	Если СчФ.СуммаНДС - СуммаНДСДоИзменения >0 Тогда
		//		СчФ.СуммаНДСУвеличение = СчФ.СуммаНДС - СуммаНДСДоИзменения;
		//	ИначеЕсли СчФ.СуммаНДС - СуммаНДСДоИзменения < 0 Тогда
		//		СчФ.СуммаНДСУменьшение = СуммаНДСДоИзменения - СчФ.СуммаНДС;
		//	КонецЕсли;
		//КонецЕсли;
		//Если  ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение и СчФ.СуммаУменьшение >0 Тогда
		//	СчФ.КодВидаОперации = "18";	
		//КОнецЕсли;
#КонецОбласти
		Если НЕ ТолькоШапка Тогда
			СчФ.ПодтверждающиеДокументы.Очистить();
			СчФ.МорскойТранспорт.Очистить();
			СчФ.ПлатежноРасчетныеДокументы.Очистить();
			СчФ.Состояния.Очистить();
			СчФ.Авансы.Очистить();
		КонецЕсли; 
		СчФ.ДокументыОснования.Очистить();
		
		//Евросиб Каблов 28.07.2020 (
		//ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполненияСсылка,, "Номер");
		//Евросиб - АСуслов 11.11.2020 19:12:20 #
		//(
		//ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполненияСсылка,, "Номер, Выставлен, ДатаВыставления");
		//ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполненияСсылка,, "Выставлен, ДатаВыставления");
		ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполненияСсылка,, "Выставлен, ДатаВыставления, НомерДляПечати");
		//)
		//Евросиб - АСуслов 11.11.2020 19:12:22 #
		//Евросиб Каблов 28.07.2020 )
		
	    Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда //не стала разбираться, зачем это, просто оставила
	    	СчФ.Номер = ДанныеЗаполненияСсылка.Номер;
		КонецЕсли;
		СчФ.ДокументОснование = ДанныеЗаполненияСсылка;
		СчФ.КодВидаОперации = "01";	
		НовСтр = СчФ.ДокументыОснования.Добавить();
		НовСтр.ДокументОснование =  ДанныеЗаполненияСсылка;
		СчФ.СуммаНДСДокумента = ДанныеЗаполненияСсылка.Товары.Итог("СуммаНДС") + ДанныеЗаполненияСсылка.Услуги.Итог("СуммаНДС");
		Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			//КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументРеализации, "СчетФактураВыданный");
			//Евросиб(ДИТ), Беляев СЮ, BUG 99056 / TA 99163, 27-12-2024, начало
			//Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументРеализации) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, начало
			Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументРеализации) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") И НЕ ДанныеЗаполненияСсылка.ЭтоИзменениеВознаграждения Тогда
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, конец
				Партия = Документы.ОтчетКомитентуОПродажах.ПолучитьПоступление(ДанныеЗаполненияСсылка.ДокументРеализации);
				КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументРеализации, "СчетФактураВыданный", Партия);
			Иначе
				КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументРеализации, "СчетФактураВыданный");
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, BUG 99056 / TA 99163, 27-12-2024, конец
			Если КорректируемыйСчФ <> Неопределено Тогда
				НовСтр.НомерИсходногоДокумента 	= КорректируемыйСчФ.НомерДляПечати;
				НовСтр.ДатаИсходногоДокумента 	= КорректируемыйСчФ.ДатаДокумента;
				СчФ.НомерИсходногоДокумента 	= КорректируемыйСчФ.НомерДляПечати;
				СчФ.ДатаИсходногоДокумента 		= КорректируемыйСчФ.ДатаДокумента;
			КонецЕсли;
			СуммаНДСДоИзменения = ДанныеЗаполненияСсылка.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗаполненияСсылка.Услуги.Итог("СуммаНДСДоИзменения")+ДанныеЗаполненияСсылка.АгентскиеУслуги.Итог("СуммаНДСДоИзменения");
			СуммаДоИзменения = ДанныеЗаполненияСсылка.Товары.Итог("СуммаДоИзменения") + ДанныеЗаполненияСсылка.Услуги.Итог("СуммаДоИзменения")+ДанныеЗаполненияСсылка.АгентскиеУслуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;

			Если СчФ.СуммаДокумента - СуммаДоИзменения > 0 Тогда
				НовСтр.СуммаУвеличение =  СчФ.СуммаДокумента - СуммаДоИзменения;
			Иначе
				НовСтр.СуммаУменьшение = СуммаДоИзменения - СчФ.СуммаДокумента;
				СчФ.КодВидаОперации = "18";	
			КонецЕсли;
			Если СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения >0 Тогда
				НовСтр.СуммаНДСУвеличение = СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения;
			Иначе
				НовСтр.СуммаНДСУменьшение = СуммаНДСДоИзменения - СчФ.СуммаНДСДокумента;
			КонецЕсли;
			//Евросиб Гудкова( 29.10.2019
			//было
			//Если ОткрытыйПериод(ДанныеЗаполнения.Организация) <> Дата('00010101') Тогда
			//	Если ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			//		СчФ.ДатаДокумента = ОткрытыйПериод(ДанныеЗаполнения.Организация);
			//		СчФ.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполнения.Организация);
			//	Иначе
			//		СчФ.ДатаДокумента = КонецМесяца(ОткрытыйПериод(ДанныеЗаполнения.Организация));
			//		СчФ.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполнения.Организация);
			//	КонецЕсли;
			//Иначе
			//	СчФ.ДатаДокумента = ДанныеЗаполнения.ДатаДокумента;
			//	СчФ.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДанныеЗаполнения.Организация);
			//	
			//КонецЕсли;
			СчФ.ПериодВО = ПериодВО;
			//Евросиб Каблов 02.04.2021 (
			//СчФ.ДатаДокумента = ?(ЗначениеЗаполнено(ПериодВО), ПериодВО, ДанныеЗаполненияСсылка.ДатаДокумента);
			//ДатаДокумента = ?(ЗначениеЗаполнено(ПериодВО), ПериодВО, ДанныеЗаполненияСсылка.ДатаДокумента);
			//Если СчФ.Контрагент.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
			//	ДатаДокумента = КонецМесяца(ДатаДокумента);			
			//КонецЕсли;
			//СчФ.ДатаДокумента = ДатаДокумента;
			//Евросиб Каблов 02.04.2021 ) 
			//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
			ДатаДокумента = ?(ЗначениеЗаполнено(ПериодВО), ПериодВО, ДанныеЗаполненияСсылка.ДатаДокумента);
			КонтрагентРезидент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчФ.Контрагент, "СтранаРегистрации") = Справочники.СтраныМира.Россия;
			Если ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
				//Для корректировок с видом «Исправление в первичных документах» дата испр. СФ = по резидентам первое число месяца периода ВО, по нерезидентам последнее число месяца периода ВО, в котором проводим исправление.
				ДатаДокумента = ?(КонтрагентРезидент, НачалоМесяца(ПериодВО), КонецМесяца(ПериодВО));
			ИначеЕсли ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
				//Для корректировок с видом «Корректировка по согласованию сторон» по нерезидентам – дата корр. ИСФ всегда последнее число месяца периода ВО, по резидентам – дата корр. 
				//ИСФ равна дате письма на скидку/дате корректировочного документа от подрядчика. Если эти даты раньше того периода ВО, в котором проводится корректировка, то тогда дата корр. СФ первое число месяца периода ВО.
				Если НЕ КонтрагентРезидент Тогда
					ДатаДокумента = КонецМесяца(ПериодВО);
				Иначе
					ДатаДокумента = Макс(ДанныеЗаполненияСсылка.ДатаДокумента, ПериодВО);
				КонецЕсли;
			КонецЕсли;
			СчФ.ДатаДокумента = ДатаДокумента;
			//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
			
			// Евросиб Гудкова) 			
			//Блок исправления/корректировки
			Если ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
				СчФ.Исправление = Истина;
				СчФ.НомерИсправления = ПолучитьНомерИсправления(ДанныеЗаполненияСсылка,"СчетФактураВыданный", СчФ.Ссылка);
				Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Если ДанныеЗаполненияСсылка.ДокументРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
						КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументРеализации,"СчетФактураВыданный");
						Если КорректируемыйСчФ <> Неопределено Тогда
							СчФ.НомерИсправляемогоКорректировочногоДокумента = КорректируемыйСчФ.НомерДляПечати;
							//СчФ.ДатаИсправляемогоКорректировочногоДокумента = КорректируемыйСчФ.Дата;
							СчФ.ДатаИсправляемогоКорректировочногоДокумента = КорректируемыйСчФ.ДатаДокумента;
							//СчФ.НомерИсходногоДокумента = ДанныеЗаполненияСсылка.ДокументОснование.ДокументыОснования[0].НомерИсходногоДокумента;
							//СчФ.ДатаИсходногоДокумента = ДанныеЗаполненияСсылка.ДокументОснование.ДокументыОснования[0].НомерИсходногоДокумента;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	 
			КонецЕсли;
			
		КонецЕсли;
	// Евросиб Гудкова) 		
		
		//Вид счета-фактуры
		Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			ИЛИ (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") 
			И ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) Тогда
			
			СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию; 
			
		ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") И ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
			Если ДанныеЗаполненияСсылка.АгентскиеУслуги.Количество() >0 Тогда
				СчФ.Продавец = ДанныеЗаполненияСсылка.АгентскиеУслуги[0].Контрагент;
			КонецЕсли;
			//Если ЗначениеЗаполнено(ДанныеЗаполнения.Продавец) Тогда
			//	СчФ.Продавец = ДанныеЗаполнения.Продавец;
			//КонецЕСли;
		КонецЕсли;
			
		//СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДанныеЗаполнения.Дата,"Счет фактура выданный");
		//СчФ.ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		//СчФ.ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;

//Евросиб Гудкова( 24.02.2020 НДС0%
		Если Не ТолькоШапка Тогда
			ЕстьНДС0 = ЗначениеЗаполнено(ДанныеЗаполненияСсылка.Товары.Найти(Перечисления.СтавкиНДС.НДС0, "СтавкаНДС")) Или ЗначениеЗаполнено(ДанныеЗаполненияСсылка.Услуги.Найти(Перечисления.СтавкиНДС.НДС0, "СтавкаНДС"));
			Если ЕстьНДС0 Тогда  
				//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Начало 15.05.2025
				//Было:
				//Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				//	ТЧРасшифровка = ДанныеЗаполненияСсылка.РасшифровкаУслугПоТС;
				//Иначе
				//	// Шейко О.Е. (04.02.2021) Для корректной работы Корректировки на корректировку:
				//	//ТЧРасшифровка = ДанныеЗаполненияСсылка.ДокументРеализации.РасшифровкаУслугПоТС;  // БЫЛО
				//	ТЧРасшифровка = ДанныеЗаполненияСсылка.ИсходныйДокументРеализации.РасшифровкаУслугПоТС; // СТАЛО
				//КонецЕсли;
				//ЗаполнитьТЧНДС0ПоОснованию(СчФ, ТЧРасшифровка);
				//Стало:
				ЗаполнитьТаблицыЧастичногоПодтвержденияНДС0(СчФ, ДанныеЗаполненияСсылка)
				//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Конец 15.05.2025
				КонецЕсли; 
		КонецЕсли; 
// Евросиб Гудкова)
		СчФ.Записать();
#КонецОбласти
#Область ПоступлениеТоваровУслуг_КорректировкаПоступления
	ИначеЕсли ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураПолученный") 
		и (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		или ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления")) Тогда
		//СчФ = СчФСсылка.ПолучитьОбъект();
		СчФ = СчФСсылка;
		ДанныеЗаполнения = ДанныеЗаполненияСсылка;//Гудкова .ПолучитьОбъект();
		СчФ.ДокументОснование = ДанныеЗаполненияСсылка;
//Евросиб Гудкова( 29.10.2019 
//было
		//СчФ.Дата = ДанныеЗаполнения.ДАта;
		//СчФ.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//СчФ.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		//СчФ.Контрагент = ДанныеЗаполнения.Контрагент;
		//СчФ.Организация = ДанныеЗаполнения.Организация;
		//СчФ.Ответственный = ДанныеЗаполнения.Ответственный;
		//СчФ.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//СчФ.ДатаВходящегоДокумента = ДанныеЗаполнения.Дата;
		//СчФ.ДатаПолучения = ТекущаяДата();
		
		// Шейко О.Е. (21.01.21) Исправления для формирования счет фактур для Корр ПТУ:
		
		Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			
			ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполнения,,"Номер, Проведен, НомерВходящегоДокумента, ДатаВходящегоДокумента, НомерИсправления, ДатаИсправления");
			
			СчФ.ДокументыОснования.Очистить();
			НовСтр = СчФ.ДокументыОснования.Добавить();
			НовСтр.ДокументОснование =  ДанныеЗаполненияСсылка;
			СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");		
			
			//СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения");
			//СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;
			//Если СчФ.СуммаДокумента - СуммаДоИзменения > 0 Тогда
			//	НовСтр.СуммаУвеличение =  СчФ.СуммаДокумента - СуммаДоИзменения;
			//ИначеЕсли  СчФ.СуммаДокумента - СуммаДоИзменения < 0 Тогда
			//	НовСтр.СуммаУменьшение = СуммаДоИзменения - СчФ.СуммаДокумента;
			//КонецЕсли;
			//Если СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения >0 Тогда
			//	НовСтр.СуммаНДСУвеличение = СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения;
			//ИначеЕсли СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения < 0 Тогда
			//	НовСтр.СуммаНДСУменьшение = СуммаНДСДоИзменения - СчФ.СуммаНДСДокумента;
			//КонецЕсли;
			
			// Для ситуации перезаполнения:
			Если ПерезаполнениеПомеченного Тогда
			
				СчФ.Исправление = Ложь; // Базовое значение
				СчФ.ДатаВходящегоДокумента = Дата(1,1,1);
				СчФ.НомерВходящегоДокумента = "";
				СчФ.НомерИсправления = "";
				СчФ.ДатаИсправления = Дата(1,1,1);
				СчФ.ПометкаУдаления = Ложь;
				
			КонецЕсли; 
			
			КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументПоступления,"СчетФактураПолученный");
			СчФ.ИсправляемыйСчетФактура = КорректируемыйСчФ;
			Если КорректируемыйСчФ <> Неопределено Тогда
				//НовСтр.НомерИсходногоДокумента = КорректируемыйСчФ.Номер;
				//НовСтр.ДатаИсходногоДокумента = КорректируемыйСчФ.Дата;
				Сумма = ДанныеЗаполнения.СуммаДокумента;
				СуммаНДС = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");			
				СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения");
				СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;
				
				Если Сумма - СуммаДоИзменения > 0 Тогда
					НовСтр.СуммаУвеличение =  Сумма - СуммаДоИзменения;
				ИначеЕсли Сумма - СуммаДоИзменения < 0 Тогда
					НовСтр.СуммаУменьшение = СуммаДоИзменения - Сумма;
				КонецЕсли;
				Если СуммаНДС - СуммаНДСДоИзменения > 0 Тогда
					НовСтр.СуммаНДСУвеличение = СуммаНДС - СуммаНДСДоИзменения;
				ИначеЕсли СуммаНДС - СуммаНДСДоИзменения < 0 Тогда
					НовСтр.СуммаНДСУменьшение = СуммаНДСДоИзменения - СуммаНДС;
				КонецЕсли;
			КонецЕсли;
			
			Если (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) Тогда
				СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление; 
			ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
				СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
				Если ЗначениеЗаполнено(ДанныеЗаполненияСсылка.СчетФактураВыданныйПокупателю) Тогда
					СчФ.СчетФактураВыданныйПокупателю  = ДанныеЗаполненияСсылка.СчетФактураВыданныйПокупателю;
				КонецЕсли;
			КонецЕсли;
			//Блок исправления/корректировки
			Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
				СчФ.Исправление = Истина;
				//Если НЕ ЗначениеЗаполнено(СчФ.НомерИсправления) И ЗначениеЗаполнено(ДанныеЗаполненияСсылка.НомерИсправления) Тогда
				//	СчФ.НомерИсправления = ДанныеЗаполненияСсылка.НомерИсправления;
				//ИначеЕсли НЕ ЗначениеЗаполнено(СчФ.НомерИсправления) Тогда
				//	СчФ.НомерИсправления = ПолучитьНомерИсправления(ДанныеЗаполненияСсылка,"СчетФактураПолученный");
				//КонецЕсли; 
				//СчФ.НомерИсправления = "";
				
				//Если НЕ ЗначениеЗаполнено(СчФ.ДатаИсправления) Тогда
				//	СчФ.ДатаИсправления = ДанныеЗаполненияСсылка.Дата;
				//КонецЕсли;
				Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
					Если ДанныеЗаполненияСсылка.ДокументПоступления.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
						КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументПоступления,"СчетФактураПолученный");
						Если КорректируемыйСчФ <> Неопределено Тогда
							СчФ.ИсправляемыйСчетФактура = КорректируемыйСчФ;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	 
			КонецЕсли;
			//Суммы документа
			
			//СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			//СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");		
			//СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения");
			//СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;
			//Если СчФ.СуммаДокумента - СуммаДоИзменения > 0 Тогда
			//	СчФ.СуммаУвеличение =  СчФ.СуммаДокумента - СуммаДоИзменения;
			//ИначеЕсли  СчФ.СуммаДокумента - СуммаДоИзменения < 0 Тогда
			//	СчФ.СуммаУменьшение = СуммаДоИзменения - СчФ.СуммаДокумента;
			//КонецЕсли;
			//Если СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения >0 Тогда
			//	СчФ.СуммаНДСУвеличение = СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения;
			//ИначеЕсли СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения < 0 Тогда
			//	СчФ.СуммаНДСУменьшение = СуммаНДСДоИзменения - СчФ.СуммаНДСДокумента;
			//КонецЕсли;
			
			// 15.01.2021. Доработка запонения на основании Корр ПТУ:
			
			УвСум = 0; УмСум = 0; УвНДССум = 0; УмНДССум = 0;
			Для каждого Стр Из ДанныеЗаполненияСсылка.Услуги Цикл
				
				Если Стр.РазницаВсегоКорректировки > 0 Тогда
					УвСум = УвСум + Стр.РазницаВсегоКорректировки;
				ИначеЕсли Стр.РазницаВсегоКорректировки < 0 Тогда
					УмСум = УмСум + (-Стр.РазницаВсегоКорректировки);
				КонецЕсли; 
				
				Если Стр.РазницаСуммаНДСКорректировки > 0 Тогда
					УвНДССум = УвНДССум + Стр.РазницаСуммаНДСКорректировки;
				ИначеЕсли Стр.РазницаСуммаНДСКорректировки < 0 Тогда
					УмНДССум = УмНДССум + (-Стр.РазницаСуммаНДСКорректировки);
				КонецЕсли; 
				
			КонецЦикла;
			
			НовСтр.СуммаУвеличение = УвСум;
			НовСтр.СуммаУменьшение = УмСум;
			НовСтр.СуммаНДСУвеличение = УвНДССум;
			НовСтр.СуммаНДСУменьшение = УмНДССум;
			
			СчФ.СуммаУвеличение = УвСум;
			СчФ.СуммаНДСУвеличение = УвНДССум;
			
			СчФ.СуммаУменьшение = УмСум;
			СчФ.СуммаНДСУменьшение = УмНДССум;
			
			Если СчФ.Исправление Тогда
				
				Если Не ЗначениеЗаполнено(СчФ.НомерВходящегоДокумента) Тогда
					СчФ.НомерВходящегоДокумента = СчФ.ИсправляемыйСчетФактура.НомерВходящегоДокумента;
				КонецЕсли; 
				
				Если Не ЗначениеЗаполнено(СчФ.ДатаВходящегоДокумента) Тогда
					СчФ.ДатаВходящегоДокумента = СчФ.ИсправляемыйСчетФактура.ДатаВходящегоДокумента;
				КонецЕсли; 
				
				// Оставляем пустыми
				//СчФ.НомерИсправления= "";
				//СчФ.ДатаИсправления = Дата(1,1,1);
				
				Для каждого СтрИсп Из СчФ.ДокументыОснования Цикл
					
					//Если Не ЗначениеЗаполнено(СтрИсп.НомерИсходногоДокумента) Тогда
					СтрИсп.НомерИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.НомерВходящегоДокумента;
					СчФ.НомерИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.НомерВходящегоДокумента;
					//КонецЕсли;
					
					//Если Не ЗначениеЗаполнено(СтрИсп.ДатаИсходногоДокумента) Тогда
					СтрИсп.ДатаИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.ДатаВходящегоДокумента;
					СчФ.ДатаИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.ДатаВходящегоДокумента;
					//КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрИсп.НомерИсправленияИсходногоДокумента) Тогда
						СтрИсп.НомерИсправленияИсходногоДокумента= СчФ.НомерИсправления;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрИсп.ДатаИсправленияИсходногоДокумента) Тогда
						СтрИсп.ДатаИсправленияИсходногоДокумента = СчФ.ДатаИсправления;
					КонецЕсли;
					
				КонецЦикла; 
				
			Иначе
				// обычная корректировка (не трогаем)
				//СчФ.НомерВходящегоДокумента = "";
				//СчФ.ДатаВходящегоДокумента = "";
				
				Для каждого СтрИсп Из СчФ.ДокументыОснования Цикл
					
					НовСтр.НомерИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.НомерВходящегоДокумента;
					СчФ.НомерИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.НомерВходящегоДокумента;
					НовСтр.ДатаИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.ДатаВходящегоДокумента;
					СчФ.ДатаИсходногоДокумента = СчФ.ИсправляемыйСчетФактура.ДатаВходящегоДокумента;
					
				КонецЦикла; 
				
			КонецЕсли;
		
		Иначе
			
			ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполнения,,"Номер, Проведен, НомерВходящегоДокумента, ДатаВходящегоДокумента");
			Если Не ЗначениеЗаполнено(СчФ.НомерВходящегоДокумента) Тогда
				Счф.НомерВходящегоДокумента = ДанныеЗаполнения.НомерВходящегоДокумента;
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(СчФ.ДатаВходящегоДокумента) Тогда
				Счф.ДатаВходящегоДокумента = ДанныеЗаполнения.ДатаВходящегоДокумента;
			КонецЕсли; 
			// Евросиб Гудкова) 		
			Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				СчФ.ДокументыОснования.Очистить();
				НовСтр = СчФ.ДокументыОснования.Добавить();
				НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
			КонецЕсли;
			СчФ.КодВидаОперации = "01";	
			//Вид счет-фактуры
			Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) Тогда
				СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление; 
			ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
				СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
				Если ЗначениеЗаполнено(ДанныеЗаполненияСсылка.СчетФактураВыданныйПокупателю) Тогда
					СчФ.СчетФактураВыданныйПокупателю  = ДанныеЗаполненияСсылка.СчетФактураВыданныйПокупателю;
				КонецЕсли;
			КонецЕсли;
			//Блок исправления/корректировки
			Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
				СчФ.Исправление = Истина;
				СчФ.НомерИсправления = ПолучитьНомерИсправления(ДанныеЗаполненияСсылка,"СчетФактураПолученный");
				СчФ.ДатаИсправления = ДанныеЗаполненияСсылка.Дата;
				Если ТипЗнч(ДанныеЗаполненияСсылка.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
					Если ДанныеЗаполненияСсылка.ДокументПоступления.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
						КорректируемыйСчФ = НайтиПодчиненныйСчетФактуру(ДанныеЗаполненияСсылка.ДокументПоступления,"СчетФактураПолученный");
						Если КорректируемыйСчФ <> Неопределено Тогда
							СчФ.ИсправляемыйСчетФактура = КорректируемыйСчФ;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	 
			КонецЕсли;
			//Суммы документа
			Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
				СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");
			ИначеЕсли ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
				СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");		
				СуммаНДСДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаНДСДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаНДСДоИзменения");
				СуммаДоИзменения = ДанныеЗаполнения.Товары.Итог("СуммаДоИзменения") + ДанныеЗАполнения.Услуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;
				Если СчФ.СуммаДокумента - СуммаДоИзменения > 0 Тогда
					СчФ.СуммаУвеличение =  СчФ.СуммаДокумента - СуммаДоИзменения;
				ИначеЕсли  СчФ.СуммаДокумента - СуммаДоИзменения < 0 Тогда
					СчФ.СуммаУменьшение = СуммаДоИзменения - СчФ.СуммаДокумента;
				КонецЕсли;
				Если СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения >0 Тогда
					СчФ.СуммаНДСУвеличение = СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения;
				ИначеЕсли СчФ.СуммаНДСДокумента - СуммаНДСДоИзменения < 0 Тогда
					СчФ.СуммаНДСУменьшение = СуммаНДСДоИзменения - СчФ.СуммаНДСДокумента;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
		
		СчФ.Записать();
#КонецОбласти
#Область ОтчетКомитентуОПродажах_СчетФактураВыданный
	ИначеЕсли ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураВыданный") 
		И (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		ИЛИ ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах")) Тогда
		Если Партия <> Неопределено Тогда
			//СчФ = СчФСсылка.ПолучитьОбъект();
			СчФ = СчФСсылка;
			ДокПартии = Партия;//.ПолучитьОбъект();
			//Если  ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			//	ДанныеЗаполнения = ДанныеЗаполненияСсылка.ПолучитьОбъект();
			//Иначе
			ДанныеЗаполнения = ДанныеЗаполненияСсылка;
			//КонецЕСли;
			//СчФ.Дата = ДокПартии.Дата;
//Евросиб Гудкова( 30.09.2021 Ticket№ АД
//			СчФ.Дата = ТекущаяДата();
// Евросиб Гудкова) 			
			Счф.Номер = ДанныеЗаполненияСсылка.Номер;
			СЧФПартии = НайтиПодчиненныйСчетФактуру(Партия,"СчетФактураПолученный");
			
			//Если ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			//	//Евросиб - АСуслов 12.11.2020 12:44:54 #
			//	//(
			//	//Если СЧФПартии <> Неопределено Тогда
			//	//	СчФ.ДатаДокумента = СЧФПартии.Дата;
			//	//Иначе
			//	//	СчФ.ДатаДокумента = ДокПартии.Дата;
			//	//КонецЕсли;
			//	Счф.ДатаДокумента = ДокПартии.ДатаВходящегоДокумента;
			//	//)
			//	//Евросиб - АСуслов 12.11.2020 12:44:55 #
			//Иначе
			//	СчФ.ДатаДокумента = ДанныеЗаполнения.ДатаДокумента;
			//КонецЕсли;
			//Если ДанныеЗаполнения.ДоговорКонтрагента.ДоговорТранспортнойЭкспедиции Тогда
			//	//Счф.Дата = ДанныеЗаполненияСсылка.Дата;
			//	Счф.ДатаДокумента = ДанныеЗаполненияСсылка.ДатаДокумента;			
			//КонецЕсли; 
			//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, начало
			РеквизитыПартии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партия, "Контрагент, ДатаВходящегоДокумента");
			ДатыДокументов = Документы.ОтчетКомитентуОПродажах.ОпределитьДатыДокументов(ДанныеЗаполнения.Организация, 
																						РеквизитыПартии.Контрагент, 
																						ДанныеЗаполнения.Контрагент, 
																						ДанныеЗаполнения.ДоговорКонтрагента, 
																						РеквизитыПартии.ДатаВходящегоДокумента,
																						ДанныеЗаполнения.ДатаДокумента);
			Счф.ДатаДокумента = ДатыДокументов.ДатаИСФнаВР;
			//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, конец
			
			СчФ.ПериодВО = ПериодВО; // Евросиб Гудкова)
			Если Не ЗначениеЗаполнено(СчФ.Номер) Тогда
				СчФ.УстановитьНовыйНомер();
			КонецЕсли;
//Евросиб Гудкова( 30.09.2021 Ticket№ АД
//было
			////СчФ.НомерДляПечати = ?(ДанныеЗаполнения.РезервНомера.НомерДляПечати <> "",ДанныеЗаполнения.НомерДляПечати ,СчФ.Номер +"/"+  ?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
			////Евросиб - АСуслов 19.05.2021 13:23:55 #0232529 
			////(
			//СчФ.НомерДляПечати = СчФ.Номер +"/"+  ?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
			//ЦифровойИндексПодразделения = "";
			//ДлинаИндекса = 0;
			//ПодразделениеОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполненияСсылка, "ПодразделениеОрганизации");
			//Если ЗначениеЗаполнено(ПодразделениеОснования) Тогда
			//	ЦифровойИндексПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеОснования, "ЦифровойИндексОбособленногоПодразделения");
			//	Если ЗначениеЗаполнено(ЦифровойИндексПодразделения) Тогда
			//		ЦифровойИндексПодразделения = "/" + Строка(ЦифровойИндексПодразделения);
			//		ДлинаИндекса = СтрДлина(ЦифровойИндексПодразделения);
			//	КонецЕсли;
			//КонецЕсли;
			//ИндексВНомереДляПечати = Прав(Счф.НомерДляПечати, ДлинаИндекса);	
			//Если ИндексВНомереДляПечати <> ЦифровойИндексПодразделения Тогда // SIV 12-03-21 было ИЛИ, но если номер для печати заполнен, то перезаполнять его не надо
			//	Счф.НомерДляПечати = Счф.НомерДляПечати + ЦифровойИндексПодразделения;
			//КонецЕсли;
			////)
			////Евросиб - АСуслов 19.05.2021 13:24:03 #0232529 
			//СчФ.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
			//СчФ.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			//СчФ.Контрагент = ДанныеЗаполнения.Контрагент;
			//СчФ.Организация = ДанныеЗаполнения.Организация;
			//СчФ.Ответственный = ДанныеЗаполнения.Ответственный;
//стало
			ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполненияСсылка,, "Выставлен, ДатаВыставления, НомерДляПечати, ДатаДокумента");
// Евросиб Гудкова) 			
			
			СчФ.ДокументОснование = ДанныеЗаполненияСсылка;
			СчФ.Продавец = ДокПартии.Контрагент;
			СчФ.КодВидаОперации = "01";	
			СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию; 
			СчФ.ДокументыОснования.Очистить();
			НовСтр = СчФ.ДокументыОснования.Добавить();
		  	НовСтр.ДокументОснование = ДанныеЗаполненияСсылка;
			//СчФ.Сумма = Партия.СуммаДокумента;
			СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС");
			//СчФ.СуммаНДС = Партия.Товары.Итог("СуммаНДС") + Партия.Услуги.Итог("СуммаНДС");
			Счф.ПометкаУдаления = ДанныеЗаполнения.ПометкаУдаления;
			СчФ.Записать();
		Иначе //На вознаграждение
			//СчФ = СчФСсылка.ПолучитьОбъект();
			СчФ = СчФСсылка;
			ДанныеЗаполнения = ДанныеЗаполненияСсылка;//Гудкова .ПолучитьОбъект();
		
//Евросиб Гудкова( 30.09.2021 Ticket№ АД
//было
			//СчФ.ДатаДокумента = ДанныеЗаполнения.ДатаДокумента;
			//СчФ.ПериодВО = ДанныеЗаполнения.ПериодВО;
			//СчФ.Дата = ДанныеЗаполнения.Дата;
			//СчФ.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
			//Счф.Номер = ДанныеЗаполненияСсылка.РезервНомераВознаграждение.Номер;
			////Евросиб - АСуслов 19.05.2021 13:19:38 #0232529 
			////(
			////СчФ.НомерДляПечати = ?(ДанныеЗаполнения.НомерДляПечатиВознаграждение <> "",ДанныеЗаполнения.НомерДляПечатиВознаграждение ,СчФ.Номер +"/"+  ?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
			//СчФ.НомерДляПечати = СчФ.Номер +"/"+  ?(ДанныеЗаполнения.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
			//ПодразделениеОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполненияСсылка, "ПодразделениеОрганизации");
			//Если ЗначениеЗаполнено(ПодразделениеОснования) Тогда
			//	ЦифровойИндексПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеОснования, "ЦифровойИндексОбособленногоПодразделения");
			//	Если ЗначениеЗаполнено(ЦифровойИндексПодразделения) Тогда
			//		ЦифровойИндексПодразделения = "/" + Строка(ЦифровойИндексПодразделения);
			//		ДлинаИндекса = СтрДлина(ЦифровойИндексПодразделения);
			//	КонецЕсли;
			//КонецЕсли;
			//ИндексВНомереДляПечати = Прав(Счф.НомерДляПечати, ДлинаИндекса);	
			//Если ИндексВНомереДляПечати <> ЦифровойИндексПодразделения Тогда // SIV 12-03-21 было ИЛИ, но если номер для печати заполнен, то перезаполнять его не надо
			//	Счф.НомерДляПечати = Счф.НомерДляПечати + ЦифровойИндексПодразделения;
			//КонецЕсли;
			////)
			////Евросиб - АСуслов 19.05.2021 13:19:39 #0232529 
			//СчФ.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			//СчФ.Контрагент = ДанныеЗаполнения.Контрагент;
			//СчФ.Организация = ДанныеЗаполнения.Организация;
			//СчФ.Ответственный = ДанныеЗаполнения.Ответственный;
//стало
			Счф.Номер = ДанныеЗаполненияСсылка.РезервНомераВознаграждение.Номер;
			ЗаполнитьЗначенияСвойств(СчФ, ДанныеЗаполнения, "ДоговорКонтрагента, Контрагент, Организация, Ответственный, ДатаДокумента, ПериодВО, Дата, ВалютаДокумента");
// Евросиб Гудкова) 			
			СчФ.ДокументОснование = ДанныеЗаполненияСсылка;
			СчФ.КодВидаОперации = "01";	
			СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию; 
			СчФ.ДокументыОснования.Очистить();
			НовСтр = СчФ.ДокументыОснования.Добавить();
			НовСтр.ДокументОснование =  ДанныеЗаполненияСсылка;
			// Евросиб US 122278 TA 122482 Рыбьяков К.А. 07.11.2025 ((
			Если ДанныеЗаполнения.СуммаВознагражденияВключаетНДС Тогда
				СчФ.СуммаДокумента = ДанныеЗаполнения.Товары.Итог("СуммаВознаграждения") + ДанныеЗаполнения.Товары.Итог("СуммаНДСВознаграждения");
			Иначе
				СчФ.СуммаДокумента = ДанныеЗаполнения.Товары.Итог("СуммаВознаграждения");
			КонецЕсли;
			//СчФ.СуммаДокумента = ДанныеЗаполнения.СуммаВознаграждения
			// Евросиб Рыбьяков К.А. 07.11.2025 ))
			//СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДСВознаграждения");
			СчФ.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДСВознаграждения");
			//СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДанныеЗаполнения.Дата,"Счет фактура выданный");
			//СчФ.ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
			//СчФ.ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;

			СчФ.Записать();
		КонецЕсли;
#КонецОбласти
#Область ОтчетКомитентуОПродажах_СчетФактураПолученный
	ИначеЕсли ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураПолученный") 
		и (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")) Тогда
		//СчФ = СчФСсылка.ПолучитьОбъект();	
		ДанныеЗаполнения = ДанныеЗаполненияСсылка;//Гудкова .ПолучитьОбъект();
		СчФСсылка.Дата = ДанныеЗаполнения.Дата;
		СчФСсылка.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		СчФСсылка.ДокументОснование = ДанныеЗаполненияСсылка;
		СчФСсылка.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		СчФСсылка.Контрагент = ДанныеЗаполнения.Контрагент;
		СчФСсылка.Организация = ДанныеЗаполнения.Организация;
		СчФСсылка.Ответственный = ДанныеЗаполнения.Ответственный;
		СчФСсылка.КодВидаОперации = "04";	
		СчФСсылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление; 
		СчФСсылка.ДокументыОснования.Очистить();
		НовСтр = СчФСсылка.ДокументыОснования.Добавить();
		НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
		СчФСсылка.СуммаДокумента = ДанныеЗаполнения.Товары.Итог("Сумма") + ?(ДанныеЗаполнения.СуммаВключаетНДС,0,ДанныеЗаполнения.Товары.Итог("СуммаНДС"));
		СчФСсылка.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС");
		СчФСсылка.СчетФактураВыданныйПокупателю = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДанныеЗаполнения.ДокументОснование.Ссылка,"СчетФактураВыданный");
		
#КонецОбласти
#Область ОтчетКомиссионера_СчетФактураВыданный
	ИначеЕсли ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураВыданный") и (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) Тогда
		Если Покупатель <> Неопределено Тогда
			ДанныеЗаполнения = ДанныеЗаполненияСсылка.ПолучитьОбъект();
			СчФСсылка.Дата = ДанныеЗаполнения.Дата;
			СчФСсылка.НомерДляПечати = ДанныеЗаполнения.Номер +"/"+  ?(Покупатель.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
			СчФСсылка.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
			СчФСсылка.ДокументОснование = ДанныеЗаполненияСсылка;
			СчФСсылка.Контрагент = Покупатель;
			СчФСсылка.Организация = ДанныеЗаполнения.Организация;
			СчФСсылка.Ответственный = ДанныеЗаполнения.Ответственный;
			СчФСсылка.КодВидаОперации = "01";	
			СчФСсылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию; 
			СчФСсылка.ДокументыОснования.Очистить();
			НовСтр = СчФСсылка.ДокументыОснования.Добавить();
			НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
			СчФСсылка.Автор = Пользователи.ТекущийПользователь();
			СчФСсылка.Создано = ТекущаяДата();
			//СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДанныеЗаполнения.Дата,"Счет фактура выданный");
			//СчФ.ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
			//СчФ.ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;

			СтрТЧ = ДанныеЗаполнения.Покупатели.Найти(Покупатель,"Покупатель");
			Если СтрТЧ <> Неопределено Тогда
				СчФСсылка.Сумма = СтрТЧ.ВсегоПоСФ;
				СчФСсылка.СуммаНДС = СтрТЧ.НДСПоСФ;
			КонецЕсли;
		КонецЕсли;
#КонецОбласти
#Область ОтчетКомиссионера_СчетФактураПолученный
	ИначеЕсли ТипЗнч(СчФСсылка) = Тип("ДокументОбъект.СчетФактураПолученный") 
		и (ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) Тогда
	    //На вознаграждение
		ДанныеЗаполнения = ДанныеЗаполненияСсылка;//Гудкова .ПолучитьОбъект();
		СчФСсылка.Дата = ДанныеЗаполнения.Дата;
		СчФСсылка.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		СчФСсылка.ДокументОснование = ДанныеЗаполненияСсылка;
		СчФСсылка.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		СчФСсылка.Контрагент = ДанныеЗаполнения.Контрагент;
		СчФСсылка.Организация = ДанныеЗаполнения.Организация;
		СчФСсылка.Ответственный = ДанныеЗаполнения.Ответственный;
		СчФСсылка.КодВидаОперации = "01";	
		СчФСсылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление; 
		СчФСсылка.ДокументыОснования.Очистить();
		НовСтр = СчФСсылка.ДокументыОснования.Добавить();
		НовСтр.ДокументОснование =  ДанныеЗаполнения.Ссылка;
		СчФСсылка.СуммаДокумента = ДанныеЗаполнения.Товары.Итог("СуммаВознаграждения")+ДанныеЗаполнения.Услуги.Итог("СуммаВознаграждения");
		СчФСсылка.СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДСВознаграждения")+ ДанныеЗаполнения.Услуги.Итог("СуммаНДСВознаграждения");
		СчФСсылка.Автор = Пользователи.ТекущийПользователь();
		СчФСсылка.Создано = ТекущаяДата();
		
	КонецЕсли;
#КонецОбласти
		
КонецПроцедуры 

Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат 10;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат 18;
		
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105 Тогда
		Возврат 5;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107 Тогда
		Возврат 7;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024 
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда
		Возврат 22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец

	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьНомерИсправления(СсылкаКорректировки, ВидСчетФактуры, ТекСФ = неопределено)
	НомерТекущегоИсправления = 0;
	НомерПредыдущегоИсправления = 0;
	
	Запрос = Новый Запрос;
	Если ВидСчетФактуры = "СчетФактураВыданный" Тогда
		Запрос.УстановитьПараметр("ТекСФ", ТекСФ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(СчетФактураВыданный.НомерИсправления, 0) КАК НомерИсправления
		               |ИЗ
		               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		               |ГДЕ
		               |	СчетФактураВыданный.ДокументОснование = &Ссылка
		               |	И СчетФактураВыданный.Ссылка <> &ТекСФ";
	ИначеЕсли ВидСчетФактуры = "СчетФактураПолученный" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(СчетФактураПолученный.НомерИсправления, 0) КАК НомерИсправления
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &Ссылка";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаКорректировки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерПредыдущегоИсправления = Выборка.НомерИсправления;
	КонецЕсли;
	
	НомерТекущегоИсправления = НомерПредыдущегоИсправления + 1;
	
	Возврат НомерТекущегоИсправления;
КонецФункции

// Стандартная для данной конфигурации функция форматирования сумм
//
// Параметры:
//  Сумма  - число, которое мы хотим форматировать,
//  Валюта - ссылка на элемент справочника валют, если задан, то к в результирующую строку
//           будет добавлено представление валюты
//  ЧН     - строка, представляющая нулевое значение числа,
//  ЧРГ    - символ-разделитель групп целой части числа.
//
// Возвращаемое значение:
//  Отформатированная должным образом строковое представление суммы.
//
Функция ФорматСумм(Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "") Экспорт
	
	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2"
					+ ?(НЕ ЗначениеЗаполнено(ЧН), "", ";" + "ЧН=" + ЧН)
					+ ?(НЕ ЗначениеЗаполнено(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ);
	
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);
	КонецЕсли;
	
	Возврат РезультирующаяСтрока;
	
КонецФункции

Функция ПолучитьСчетДоговорПоУмолчанию(Контрагент) Экспорт
	ОсновныеДанные = Новый Структура;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Контрагенты.ОсновнойБанковскийСчет КАК ОсновнойБанковскийСчет,
	                      |	Контрагенты.ОсновнойДоговорКонтрагента КАК ОсновнойДоговорКонтрагента
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.Ссылка = &Ссылка
	                      |	И НЕ Контрагенты.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОснДоговор = Выборка.ОсновнойДоговорКонтрагента;
		ОснСчет = Выборка.ОсновнойБанковскийСчет;
	КонецЕсли;
	ОсновныеДанные.Вставить("Договор",ОснДоговор);
	ОсновныеДанные.Вставить("Счет",ОснСчет);
	
	Возврат ОсновныеДанные;
КонецФункции

Функция НайтиДействующиеДоверенностиНаПодпись(Дата, ТипДокумента = "", ЦФО = неопределено) Экспорт
	
	СтруктураПодписантов = Новый Структура ("ДоверенностьЗаРуководителя,ЗаРуководителя, ДолжностьЗаРуководителя, ДоверенностьЗаГБ, ОснованиеНаРук, ЗаГлавБуха, ДолжностьЗаГлавБуха, ОснованиеЗаГБ, ФаксимильЗаРук, ПечатьЗаРук, ФаксимильЗаГБ, ПечатьЗаГБ");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Доверенности.ФИОПодписанта КАК ПодписантРуководитель,
	                      |	Доверенности.ОснованиеДляПодписания КАК ОснованиеЗаРуководителя,
	                      |	Доверенности.Должность КАК ДолжностьЗаРуководителя,
	                      |	Доверенности.Ссылка КАК ДоверенностьЗаРук
	                      |ИЗ
	                      |	Справочник.Доверенности КАК Доверенности
	                      |ГДЕ
	                      |	Доверенности.ДатаНачалаДействия <= &Дата
	                      |	И Доверенности.ДатаОкончанияДейставия >= &Дата
	                      |	И Доверенности.ДоверенностьДляПодписанта = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)
	                      |	И Доверенности.ИспользоватьДляДокументов ПОДОБНО &ТипДокумента
	                      |	И НЕ Доверенности.ПометкаУдаления
	                      |	И (Доверенности.ЦФУ = &ЦФУ
						  //Евросиб - АСуслов 08.10.2020 15:11:14 #
						  //(
	                      //|			ИЛИ &ЦФУ = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
						  
						  //)
						  //Евросиб - АСуслов 08.10.2020 15:11:14 #
						  |   )
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Доверенности.ФИОПодписанта КАК ПодписантГлБух,
	                      |	Доверенности.Должность КАК ОснованиеЗаГлБуха,
	                      |	Доверенности.ОснованиеДляПодписания КАК ДолжностьЗаГлБуха,
	                      |	Доверенности.Ссылка КАК ДоверенностьЗаГБ
	                      |ИЗ
	                      |	Справочник.Доверенности КАК Доверенности
	                      |ГДЕ
	                      |	Доверенности.ДатаНачалаДействия <= &Дата
	                      |	И Доверенности.ДатаОкончанияДейставия >= &Дата
	                      |	И Доверенности.ДоверенностьДляПодписанта = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер)
	                      |	И Доверенности.ИспользоватьДляДокументов ПОДОБНО &ТипДокумента
	                      |	И НЕ Доверенности.ПометкаУдаления
	                      |	И (Доверенности.ЦФУ = &ЦФУ
						  //Евросиб - АСуслов 08.10.2020 15:11:25 #
						  //(
	                      //|			ИЛИ &ЦФУ = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
						  |   )");
						  
						  //)
						  //Евросиб - АСуслов 08.10.2020 15:11:25 #
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЦФУ", ?(ЦФО=Неопределено, Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка(), ЦФО));
	Запрос.УстановитьПараметр("ТипДокумента","%"+ТипДокумента+"%");

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЗаРуководителя = РезультатЗапроса[0].Выбрать();
	ЗаГлБух = РезультатЗапроса[1].Выбрать();
	
	Если ЗаРуководителя.Следующий() Тогда
		СтруктураПодписантов.Вставить("ДоверенностьЗаРуководителя", ЗаРуководителя.ДоверенностьЗаРук);
		СтруктураПодписантов.Вставить("ЗаРуководителя", ЗаРуководителя.ПодписантРуководитель);
		СтруктураПодписантов.Вставить("ДолжностьЗаРуководителя", ЗаРуководителя.ДолжностьЗаРуководителя);
		СтруктураПодписантов.Вставить("ОснованиеНаРук", ЗаРуководителя.ОснованиеЗаРуководителя);
	КонецЕсли;
	
	Если ЗаГлБух.Следующий() Тогда
		СтруктураПодписантов.Вставить("ДоверенностьЗаГБ", ЗаГлБух.ДоверенностьЗаГБ);
		СтруктураПодписантов.Вставить("ЗаГлавБуха", ЗаГлБух.ПодписантГлБух);
		СтруктураПодписантов.Вставить("ДолжностьЗаГлавБуха", ЗаГлБух.ДолжностьЗаГлБуха);
		СтруктураПодписантов.Вставить("ОснованиеЗаГБ", ЗаГлБух.ОснованиеЗаГлБуха);
	КонецЕсли;
	
	Возврат СтруктураПодписантов;
	
КонецФункции

Функция ДопустимыйРазмерКартинки(РазмерКартинки, ПредставлениеКартинки, ВладелецКартинки, ОповеститьПользователя = Ложь) Экспорт
	
	ДопустимыйРазмерКартинки = РазмерКартинки <= 512000;
	
	Если НЕ ДопустимыйРазмерКартинки Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Размер картинки ""%1"" слишком велик.
				|Рекомендуется использовать файл формата *.png размером не более 500 Кб.'"),
				ПредставлениеКартинки);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Организация'"), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.Организации, ВладелецКартинки,
			ТекстОшибки);
			
		Если ОповеститьПользователя Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВладелецКартинки);
		КонецЕсли;
			
		Возврат Ложь;			
	КонецЕсли;
	
	Возврат ДопустимыйРазмерКартинки;
	
КонецФункции

Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС, УчитыватьНДС, СуммаВключаетНДС) Экспорт
		Если (УчитыватьНДС) и (СуммаВключаетНДС) Тогда
			СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
			СуммаНДС = Сумма - СуммаБезНДС;
		Иначе
			СуммаБезНДС = Сумма;
		КонецЕсли;

		Если УчитыватьНДС Тогда 
			Если НЕ СуммаВключаетНДС Тогда
				СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
			КонецЕсли;
		Иначе
			СуммаНДС = 0;
		КонецЕсли;

		Возврат СуммаНДС;

КонецФункции

// Евросиб US 122278 TA 122482 Рыбьяков К.А. 06.11.2025 (( Функция из Бухгалтерия предприятия, редакция 3.0 (3.0.135.16)
// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  СтавкаНДС        - Число - процентная ставка НДС.
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если НЕ СуммаВключаетНДС Тогда
		СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС() // Евросиб Рыбьяков К.А. 06.11.2025 ))

// Форматирует сумму прописью банковского платежного документа
//
// Параметры:
//  Сумма - число - реквизит, который надо представить прописью 
//  Валюта - СправочникСсылка.Валюты - валюта, в которой нужно представить сумму
//  ВыводитьСуммуБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Отформатированная строка
//
Функция ФорматироватьСуммуПрописьюПлатежногоДокумента(Сумма, Валюта, ВыводитьСуммуБезКопеек = Ложь) Экспорт
	
	Результат     = Сумма;
	ЦелаяЧасть    = Цел(Сумма);
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = Валюта.ПараметрыПрописи;
	
	Если Результат = ЦелаяЧасть Тогда
		Если ВыводитьСуммуБезКопеек Тогда
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
			Результат = Лев(Результат, СтрНайти(Результат, "0") - 1);
		Иначе
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСуммуПрописьюПлатежногоДокумента()

//Евросиб Гудкова( 23.12.2019 
Функция ПолучитьСчетДоговорПоставщикаПоУмолчанию(Контрагент) Экспорт
	ОсновныеДанные = Новый Структура("Договор, Счет, Валюта");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	                      |	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	                      |	Контрагенты.Ссылка КАК Контрагент
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО Контрагенты.Ссылка = ДоговорыКонтрагентов.Владелец
	                      |ГДЕ
	                      |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	                      |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровконтрагентов.СПоставщиком)
	                      |	И Контрагенты.Ссылка = &Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	ТЗДоговоров = Запрос.Выполнить().Выгрузить();
	Если ТЗДоговоров.Количество() = 1 Тогда
		ОсновныеДанные.Договор = ТЗДоговоров[0].ДоговорКонтрагента;
		ОсновныеДанные.Валюта = ТЗДоговоров[0].ВалютаВзаиморасчетов;
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка КАК СчетКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ПО Контрагенты.Ссылка = БанковскиеСчета.Владелец
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Контрагент
	               |	И НЕ БанковскиеСчета.ПометкаУдаления";
	Если ЗначениеЗаполнено(ОсновныеДанные.Валюта) Тогда
		Запрос.Текст = Запрос.Текст + " И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств";	
		Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ОсновныеДанные.Валюта);
	КонецЕсли; 
	ТЗСчетов = Запрос.Выполнить().Выгрузить();
	Если ТЗСчетов.Количество() = 1 Тогда
		ОсновныеДанные.Счет = ТЗСчетов[0].СчетКонтрагента;
	КонецЕсли; 
	
	Возврат ОсновныеДанные;
	
КонецФункции

Функция ПолучитьСуммуДокументаСНДС(ДокументОбъект, ИмяТабличнойЧасти = Неопределено, НеУчитыватьТару = Истина) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	СуммаДокумента = 0;
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("Сумма");
		Если МетаданныеДокумента.Реквизиты.Найти("УчитыватьНДС") <> Неопределено 
			И МетаданныеДокумента.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено
			И МетаданныеДокумента.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("СуммаНДС") <> Неопределено
		  	И ДокументОбъект.УчитыватьНДС
		   	И Не ДокументОбъект.СуммаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("СуммаНДС");
		КонецЕсли; 
	Иначе
		Для Каждого ТЧОбъекта Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			Если НеУчитыватьТару и ТЧОбъекта.Имя = "ВозвратнаяТара" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ВыданныеАвансы" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ДенежныеСредства" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ОплатаПлатежнымиКартами" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ОплатаБанковскимиКредитами" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ПродажиПоДисконтнымКартам" Тогда
				Продолжить;
			КонецЕсли;
			Если МетаданныеДокумента.ТабличныеЧасти[ТЧОбъекта.Имя].Реквизиты.Найти("Сумма") <> Неопределено Тогда
				СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("Сумма");
				Если МетаданныеДокумента.Реквизиты.Найти("УчитыватьНДС") <> Неопределено
				   И МетаданныеДокумента.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено
				   И МетаданныеДокумента.ТабличныеЧасти[ТЧОбъекта.Имя].Реквизиты.Найти("СуммаНДС") <> Неопределено
				   И ДокументОбъект.УчитыватьНДС
				   И Не ДокументОбъект.СуммаВключаетНДС Тогда
					СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("СуммаНДС");
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		Если МетаданныеДокумента.Реквизиты.Найти("Сумма") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект.Сумма;
			Если МетаданныеДокумента.Реквизиты.Найти("УчитыватьНДС") <> Неопределено
			   И МетаданныеДокумента.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено
			   И МетаданныеДокумента.Реквизиты.Найти("СуммаНДС") <> Неопределено
			   И ДокументОбъект.УчитыватьНДС
			   И Не ДокументОбъект.СуммаВключаетНДС Тогда
				СуммаДокумента = СуммаДокумента + ДокументОбъект.СуммаНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат СуммаДокумента;

КонецФункции // ПолучитьСуммуДокументаСНДС()

//Евросиб Гудкова( 24.02.2020  
Процедура ЗаполнитьТЧНДС0ПоОснованию(СчФ, ТЧРасшифровка) Экспорт;
	
	Счф.Фрахт = Ложь;
	УслугаФрахт = Константы.УслугаФрахтаДляКалькуляции.Получить();
	Для каждого СтрокаРасшифровки Из ТЧРасшифровка Цикл
		//исключаем дубли
		//ДИТ БеляевСЮ, 0250941, ++  УБРАНА ПРОВЕРКА
		//Если Счф.ПодтверждающиеДокументы.Найти(СтрокаРасшифровки.ЖДН, "ЖДН") <> Неопределено Тогда
		//	Продолжить;	
		//КонецЕсли; 
		//ДИТ БеляевСЮ, 0250941, --  
		//Евросиб - АСуслов 11.01.2023 14:00:47 #61303
		//(
		
		// ДИТ ТА 115494 Дедуник Д.О. Начало: 30.07.2025
		СуммаПоКТК = 0;
		Если ТипЗнч(СтрокаРасшифровки) = Тип("ДокументТабличнаяЧастьСтрока.КорректировкаРеализации.РасшифровкаУслугПоТС") 
			И ТипЗнч(СчФ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") 
			И СчФ.ДокументОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			СуммаПоКТК = СтрокаРасшифровки.Сумма - СтрокаРасшифровки.СуммаДоИзменения;
		КонецЕсли;
		Если СуммаПоКТК = 0
			И ТипЗнч(СтрокаРасшифровки) = Тип("ДокументТабличнаяЧастьСтрока.КорректировкаРеализации.РасшифровкаУслугПоТС")
			И ТипЗнч(СчФ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") 
			И СчФ.ДокументОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда			
			Продолжить;
		КонецЕсли;
		// ДИТ ТА 115494 Дедуник Д.О. Конец: 30.07.2025
		
		СтруктураПоиска = Новый Структура("ЖДН, Вагон, Контейнер");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРасшифровки);
		СтрокиПодтверждающихДокументов = СчФ.ПодтверждающиеДокументы.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПодтверждающихДокументов.Количество() > 0 Тогда    
			СтрокаЖДН = СтрокиПодтверждающихДокументов[0];
			// ДИТ ТА 115494 Дедуник Д.О. Начало: 30.07.2025
			СтрокаЖДН.СуммаПоКТК = СтрокаЖДН.СуммаПоКТК + СуммаПоКТК;
			// ДИТ ТА 115494 Дедуник Д.О. Конец: 30.07.2025
		Иначе
			СтрокаЖДН = СчФ.ПодтверждающиеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЖДН, СтрокаРасшифровки);
			// ДИТ ТА 115494 Дедуник Д.О. Начало: 30.07.2025
			СтрокаЖДН.СуммаПоКТК = СуммаПоКТК;
			// ДИТ ТА 115494 Дедуник Д.О. Конец: 30.07.2025
			КлючСтроки = Новый УникальныйИдентификатор;
			СтрокаЖДН.КлючСтроки = КлючСтроки;
			СчФ.ВидПеревозки = СтрокаРасшифровки.ВидПеревозки;
			СчФ.Фрахт = СчФ.Фрахт ИЛИ СтрокаРасшифровки.Услуга = УслугаФрахт;
			Если СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Транзит Тогда
				СтрокаЖДН.ВходнаяСтанция = ?(ЗначениеЗаполнено(СтрокаЖДН.ЖДН), СтрокаЖДН.ЖДН.СтанцияОтправления, Неопределено);
				СтрокаЖДН.ВыходнаяСтанция = ?(ЗначениеЗаполнено(СтрокаЖДН.ЖДН), СтрокаЖДН.ЖДН.СтанцияНазначения, Неопределено);
			Иначе	
				//СтрокаЖДН.СтанцияНазначения = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияНазначения, Неопределено);
				//СтрокаЖДН.СтанцияОтправления = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияОтправления, Неопределено);
				//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сделка", СчФ.ДокументОснование.Метаданные()) 
										И ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка) 
										И ТипЗнч(СчФ.ДокументОснование.Сделка) = Тип("ДокументСсылка.Сделка") Тогда
					СтрокаЖДН.СтанцияНазначения = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияНазначения, Неопределено);
					СтрокаЖДН.СтанцияОтправления = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияОтправления, Неопределено);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
				СтрокаЖДН.СтранаНазначения = ?(ЗначениеЗаполнено(СтрокаЖДН.СтанцияНазначения), СтрокаЖДН.СтанцияНазначения.Страна, ?(СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Импорт Или СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре, Справочники.СтраныМира.Россия, Неопределено));	
				СтрокаЖДН.СтранаОтправления = ?(ЗначениеЗаполнено(СтрокаЖДН.СтанцияОтправления), СтрокаЖДН.СтанцияОтправления.Страна, ?(СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Экспорт Или СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре, Справочники.СтраныМира.Россия, Неопределено));
			КонецЕсли;
			//++ Зубов 38318 24.09.2021
			Если ТипЗнч(СтрокаЖДН.ЖДН) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
				Если СтрокаЖДН.ЖДН.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная Тогда
					Если СтрокаЖДН.ЖДН.НакладнаяЭТРАН.ГрузыЖД.Количество()>0 Тогда
						СтрокаЖДН.НомерГТД = СтрокаЖДН.ЖДН.НакладнаяЭТРАН.ГрузыЖД[0].НомерГТД;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//-- Зубов 38318 24.09.2021
		КонецЕсли;
		//)
		//Евросиб - АСуслов 11.01.2023 14:00:56 #61303
		
		Если ЗначениеЗаполнено(СтрокаРасшифровки.Коносамент) Тогда 
			//Евросиб - АСуслов 11.01.2023 14:06:24 #61303
			//(
			СтруктураПоиска = Новый Структура("Коносамент, КлючСтроки");
			СтруктураПоиска.Коносамент = СтрокаРасшифровки.Коносамент;
			СтруктураПоиска.КлючСтроки = СтрокаЖДН.КлючСтроки;
			Если Счф.МорскойТранспорт.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 11.01.2023 14:06:28 #61303
			СтрокаЖДН.Транспорт = 1;
			СтрокаМоре = СчФ.МорскойТранспорт.Добавить();
			СтрокаМоре.КлючСтроки = СтрокаЖДН.КлючСтроки;
			СтрокаМоре.Коносамент = СтрокаРасшифровки.Коносамент;
			СтрокаМоре.НомерДокумента = СтрокаРасшифровки.Коносамент.НомерТранспортногоДокумента;
			СтрокаМоре.ДатаДокумента = СтрокаРасшифровки.Коносамент.ДатаТранспортногоДокумента;
			СтрокаМоре.Судно = СтрокаРасшифровки.Коносамент.МорскойРейс.Судно;
			СтрокаМоре.ПортРазгрузки = СтрокаРасшифровки.Коносамент.СтанцияНазначения;
			СтрокаМоре.СтранаРазгрузки = СтрокаРасшифровки.Коносамент.СтанцияНазначения.Страна;
			СтрокаМоре.ПортПогрузки = СтрокаРасшифровки.Коносамент.СтанцияОтправления;
			СтрокаМоре.СтранаПогрузки = СтрокаРасшифровки.Коносамент.СтанцияОтправления.Страна;
			// ДИТ ТА 115494 Дедуник Д.О. Начало: 30.07.2025
			СтрокаМоре.СуммаПоКТК = СуммаПоКТК;
			// ДИТ ТА 115494 Дедуник Д.О. Конец: 30.07.2025
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры
// Евросиб Гудкова) 

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 15.05.2025  //US 90779 ТА 114194 + ИзменятьТипСФ   
Процедура ЗаполнитьТаблицыЧастичногоПодтвержденияНДС0(СчФ, ДанныеЗаполненияСсылка, ИзменятьТипСФ = Истина) Экспорт

	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 17.07.2025  
	//Счф.Фрахт = Ложь;
	Если  ИзменятьТипСФ = Истина Тогда
		Счф.Фрахт = Ложь;
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 17.07.2025
	УслугаФрахт = Константы.УслугаФрахтаДляКалькуляции.Получить();
	
	РаспределяемаяСуммаСФ = СчФ.СуммаДокумента; 
	Если ТипЗнч(ДанныеЗаполненияСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") 
		и ДанныеЗаполненияСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда  
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025
		//РаспределяемаяСуммаСФ = СчФ.СуммаУвеличение - СчФ.СуммаУменьшение;
		Если СчФ.ДокументыОснования.Количество() > 0 Тогда
			РаспределяемаяСуммаСФ = СчФ.ДокументыОснования[0].СуммаУвеличение - СчФ.ДокументыОснования[0].СуммаУменьшение;
		КонецЕсли;	
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
	КонецЕсли; 
	
	КоэффициентыРаспределения = Новый Массив;
	СтрокиРаспределения = Новый Массив; 
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025
	ПодтверждающиеДокументыЗаполнение = СчФ.ПодтверждающиеДокументы.Выгрузить();
	ПодтверждающиеДокументыЗаполнение.Очистить();  
	МорскойТранспортЗаполнение = СчФ.МорскойТранспорт.Выгрузить();
	МорскойТранспортЗаполнение.Очистить();
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
	
	Для каждого СтрокаРасшифровки Из ДанныеЗаполненияСсылка.РасшифровкаУслугПоТС Цикл
	
		Если СтрокаРасшифровки.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		СтруктураПоиска = Новый Структура("ЖДН, Вагон, Контейнер");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРасшифровки);
		СтрокиПодтверждающихДокументов = ПодтверждающиеДокументыЗаполнение.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПодтверждающихДокументов.Количество() > 0 Тогда    
			СтрокаЖДН = СтрокиПодтверждающихДокументов[0];  
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025
			КлючСтроки = СтрокаЖДН.КлючСтроки;
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
		Иначе     
			СтрокаЖДН = ПодтверждающиеДокументыЗаполнение.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЖДН, СтрокаРасшифровки);
			КлючСтроки = Новый УникальныйИдентификатор;
			СтрокаЖДН.КлючСтроки = КлючСтроки;          
			
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 17.07.2025
			//СчФ.ВидПеревозки = СтрокаРасшифровки.ВидПеревозки;
			//СчФ.Фрахт = СчФ.Фрахт ИЛИ СтрокаРасшифровки.Услуга = УслугаФрахт;
			Если  ИзменятьТипСФ = Истина Тогда                        
				СчФ.ВидПеревозки = СтрокаРасшифровки.ВидПеревозки;
				СчФ.Фрахт = СчФ.Фрахт ИЛИ СтрокаРасшифровки.Услуга = УслугаФрахт;
			КонецЕсли;
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 17.07.2025
			
			Если СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Транзит Тогда
				СтрокаЖДН.ВходнаяСтанция = ?(ЗначениеЗаполнено(СтрокаЖДН.ЖДН), СтрокаЖДН.ЖДН.СтанцияОтправления, Неопределено);
				СтрокаЖДН.ВыходнаяСтанция = ?(ЗначениеЗаполнено(СтрокаЖДН.ЖДН), СтрокаЖДН.ЖДН.СтанцияНазначения, Неопределено);
			Иначе	
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сделка", СчФ.ДокументОснование.Метаданные()) 
										И ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка) 
										И ТипЗнч(СчФ.ДокументОснование.Сделка) = Тип("ДокументСсылка.Сделка") Тогда
					СтрокаЖДН.СтанцияНазначения = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияНазначения, Неопределено);
					СтрокаЖДН.СтанцияОтправления = ?(ЗначениеЗаполнено(СчФ.ДокументОснование.Сделка), СчФ.ДокументОснование.Сделка.СтанцияОтправления, Неопределено);
				КонецЕсли;
				СтрокаЖДН.СтранаНазначения = ?(ЗначениеЗаполнено(СтрокаЖДН.СтанцияНазначения), СтрокаЖДН.СтанцияНазначения.Страна, ?(СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Импорт Или СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре, Справочники.СтраныМира.Россия, Неопределено));	
				СтрокаЖДН.СтранаОтправления = ?(ЗначениеЗаполнено(СтрокаЖДН.СтанцияОтправления), СтрокаЖДН.СтанцияОтправления.Страна, ?(СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.Экспорт Или СтрокаРасшифровки.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре, Справочники.СтраныМира.Россия, Неопределено));
			КонецЕсли;
			Если ТипЗнч(СтрокаЖДН.ЖДН) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
				Если СтрокаЖДН.ЖДН.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная Тогда
					Если СтрокаЖДН.ЖДН.НакладнаяЭТРАН.ГрузыЖД.Количество()>0 Тогда
						СтрокаЖДН.НомерГТД = СтрокаЖДН.ЖДН.НакладнаяЭТРАН.ГрузыЖД[0].НомерГТД;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;    
		
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025
		КоэффициентыРаспределения.Добавить(СтрокаРасшифровки.Сумма);
		СтрокиРаспределения.Добавить(Строка(КлючСтроки));
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
		
		Если ЗначениеЗаполнено(СтрокаРасшифровки.Коносамент) Тогда 
			СтруктураПоиска = Новый Структура("Коносамент, КлючСтроки");
			СтруктураПоиска.Коносамент = СтрокаРасшифровки.Коносамент;
			СтруктураПоиска.КлючСтроки = СтрокаЖДН.КлючСтроки;
			Если МорскойТранспортЗаполнение.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;

			СтрокаЖДН.Транспорт = 1;
			СтрокаМоре = МорскойТранспортЗаполнение.Добавить();
			СтрокаМоре.КлючСтроки = СтрокаЖДН.КлючСтроки;
			СтрокаМоре.Коносамент = СтрокаРасшифровки.Коносамент;  
			СтрокаМоре.Контейнер = СтрокаЖДН.Контейнер;
			СтрокаМоре.НомерДокумента = СтрокаРасшифровки.Коносамент.НомерТранспортногоДокумента;
			СтрокаМоре.ДатаДокумента = СтрокаРасшифровки.Коносамент.ДатаТранспортногоДокумента;
			СтрокаМоре.Судно = СтрокаРасшифровки.Коносамент.МорскойРейс.Судно;
			СтрокаМоре.ПортРазгрузки = СтрокаРасшифровки.Коносамент.СтанцияНазначения;
			СтрокаМоре.СтранаРазгрузки = СтрокаРасшифровки.Коносамент.СтанцияНазначения.Страна;
			СтрокаМоре.ПортПогрузки = СтрокаРасшифровки.Коносамент.СтанцияОтправления;
			СтрокаМоре.СтранаПогрузки = СтрокаРасшифровки.Коносамент.СтанцияОтправления.Страна;
		КонецЕсли;
	
	КонецЦикла;
	
	МассивРезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСуммаСФ, КоэффициентыРаспределения);
	Если МассивРезультатРаспределения <> Неопределено Тогда    
		СчетчикСтрок = 0;
		Для каждого КлючСтроки Из СтрокиРаспределения Цикл 
			
			СуммаПоКТК = МассивРезультатРаспределения[СчетчикСтрок];
			
			СтрокаПоКлючу = ПодтверждающиеДокументыЗаполнение.Найти(КлючСтроки, "КлючСтроки");
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194  Начало 22.07.2025
			//СтрокаПоКлючу.СуммаПоКТК = СуммаПоКТК;
			СтрокаПоКлючу.СуммаПоКТК = СтрокаПоКлючу.СуммаПоКТК + СуммаПоКТК;
			//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194  Конец 22.07.2025
			
			СтрокиМорскогоТранспорта = МорскойТранспортЗаполнение.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));  
			КолвоСтрок = СтрокиМорскогоТранспорта.Количество();
			НомерСтроки = 1;
			Для каждого СтрМорскТрансп Из СтрокиМорскогоТранспорта Цикл
				
				Если НомерСтроки = КолвоСтрок Тогда
					СтрМорскТрансп.СуммаПоКТК = СтрокаПоКлючу.СуммаПоКТК - (Окр(СтрокаПоКлючу.СуммаПоКТК / КолвоСтрок, 2))*(КолвоСтрок-1);
				Иначе
					СтрМорскТрансп.СуммаПоКТК = Окр(СтрокаПоКлючу.СуммаПоКТК / КолвоСтрок, 2);
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
			СчетчикСтрок = СчетчикСтрок + 1;
		
		КонецЦикла;	
	КонецЕсли;  
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025
	Для каждого стрГТД Из ПодтверждающиеДокументыЗаполнение Цикл
		НС = СчФ.ПодтверждающиеДокументы.Добавить();	
		ЗаполнитьЗначенияСвойств(НС, стрГТД);
	КонецЦикла; 
	
	Для каждого стрФрахт Из МорскойТранспортЗаполнение Цикл
		НС = СчФ.МорскойТранспорт.Добавить();	
		ЗаполнитьЗначенияСвойств(НС, стрФрахт);
	КонецЦикла;   
	
	Если СчФ.Фрахт и СчФ.МорскойТранспорт.Количество() > 0 
		и СчФ.МорскойТранспорт.Итог("СуммаПоКТК") <> РаспределяемаяСуммаСФ Тогда
		РазницаСумм = РаспределяемаяСуммаСФ - СчФ.МорскойТранспорт.Итог("СуммаПоКТК");  
		СтрокаКорректировки = СчФ.МорскойТранспорт[0];
		СтрокаКорректировки.СуммаПоКТК = СтрокаКорректировки.СуммаПоКТК + РазницаСумм;
	ИначеЕсли не СчФ.Фрахт и не СчФ.Авто и СчФ.ПодтверждающиеДокументы.Количество() > 0 
		и СчФ.ПодтверждающиеДокументы.Итог("СуммаПоКТК") <> РаспределяемаяСуммаСФ Тогда	
		РазницаСумм = РаспределяемаяСуммаСФ - СчФ.ПодтверждающиеДокументы.Итог("СуммаПоКТК");  
		СтрокаКорректировки = СчФ.ПодтверждающиеДокументы[0];
		СтрокаКорректировки.СуммаПоКТК = СтрокаКорректировки.СуммаПоКТК + РазницаСумм;
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
	
КонецПроцедуры

//++ДИТ_Коробов_Task 46790_24.02.22
Процедура ИСФАктуализацияВыгрузкиДляФНС(ДокОбъект = Неопределено, СтатусДействие = "НоваяИСФ", ИСФ = Неопределено) Экспорт
	
	Если ДокОбъект = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если Нрег(СтатусДействие) = Нрег("НоваяИСФ") Тогда 
		ПодчиненнаяИСФ = НайтиПодчиненныйСчетФактуру(ДокОбъект.ДокументРеализации);
		Если НЕ ЗначениеЗаполнено(ПодчиненнаяИСФ) Тогда 
			Возврат;
		КонецЕсли;
		Если ПодчиненнаяИСФ.Фрахт Тогда
			ИСФ.Фрахт = Истина;	
		КонецЕсли;  
		// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
		// Реквизиты перенесены в ТЧ по ГТД, таблицы скопированы ранее
		// Было:
		//Если ПодчиненнаяИСФ.УдалитьВключатьВОтчетДляФНС Тогда 
		//	ИСФ.УдалитьВключатьВОтчетДляФНС = Истина;
		//	ИСФ.УдалитьДатаПолногоПодтвержденияНДС0 = ПодчиненнаяИСФ.УдалитьДатаПолногоПодтвержденияНДС0;
		//	ИСФ.УдалитьДатаОтчетаДляФНС = ПодчиненнаяИСФ.УдалитьДатаОтчетаДляФНС;
		//	Если ДокОбъект.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		//		УправлениеВыгрузкойДляФНС(ПодчиненнаяИСФ, Ложь, Истина);
		//	Иначе
		//		ИСФ.УдалитьДатаПолногоПодтвержденияНДС0 = ТекущаяДата();	
		//	КонецЕсли; 
		//КонецЕсли; 
		//Стало:
		Если ДокОбъект.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			УправлениеВыгрузкойДляФНС(ПодчиненнаяИСФ, Ложь, Истина);
		Иначе   
			Для каждого СтрПодтверждающихДок Из ИСФ.ПодтверждающиеДокументы Цикл
				СтрПодтверждающихДок.ДатаПодтвержденияНДС0 = ТекущаяДата();
			КонецЦикла;
			Для каждого СтрМорскойТранспорт Из ИСФ.МорскойТранспорт Цикл
				СтрМорскойТранспорт.ДатаПодтвержденияНДС0 = ТекущаяДата();
			КонецЦикла;	
		КонецЕсли;
		// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025
		
	ИначеЕсли Нрег(СтатусДействие) = Нрег("УдалитьИСФ") Тогда
		УправлениеВыгрузкойДляФНС(НайтиПодчиненныйСчетФактуру(ДокОбъект.ДокументРеализации), Истина, Ложь);
		УправлениеВыгрузкойДляФНС(НайтиПодчиненныйСчетФактуру(ДокОбъект), Ложь, Ложь);
	ИначеЕсли Нрег(СтатусДействие) = Нрег("ВыключитьОтчетФНСДляВсехИСФ") Тогда
		СписокРТУ = Новый Массив;
		СписокРТУ.Добавить(ДокОбъект);
		ДокРеализации = ДокОбъект;
		Если НЕ ЗначениеЗаполнено(ДокРеализации) Тогда 
			Возврат;	
		КонецЕсли;	 
		Пока Истина Цикл		
			ДокРеализации = ДокРеализации.ДокументРеализации;
			УправлениеВыгрузкойДляФНС(НайтиПодчиненныйСчетФактуру(ДокРеализации), Ложь, Истина);
			ОтключитьОтчетФНСДляВсехПодчиненныхИСФ(ДокРеализации, СписокРТУ);
			Если ТипЗнч(ДокРеализации)<>Тип("ДокументСсылка.КорректировкаРеализации")
				ИЛИ ДокРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;		
КонецПроцедуры

Процедура СкопироватьТЧГТДИзСФ(ДокКорректировки, ИСФ) Экспорт;
	//ПО ФТ 46263, требуют полное копирования таблиц ГТД из предыдущей фактуры.
	ДокОснования = ДокКорректировки.ДокументРеализации;
	ПодчиненнаяИСФ = НайтиПодчиненныйСчетФактуру(ДокОснования);
	Если НЕ ЗначениеЗаполнено(ПодчиненнаяИСФ) Тогда 
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ИСФ, ПодчиненнаяИСФ,"ВидПеревозки"); 
	Для Каждого стр ИЗ ПодчиненнаяИСФ.ПодтверждающиеДокументы.Выгрузить() Цикл
		строкаТЧ = ИСФ.ПодтверждающиеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(строкаТЧ, стр);
	КонецЦикла;
	Для Каждого стр ИЗ ПодчиненнаяИСФ.МорскойТранспорт.Выгрузить() Цикл
		строкаТЧ = ИСФ.МорскойТранспорт.Добавить();
		ЗаполнитьЗначенияСвойств(строкаТЧ, стр);
	КонецЦикла;      
КонецПроцедуры 

Процедура ОтключитьОтчетФНСДляВсехПодчиненныхИСФ(ДокСсылка, СписокПросмотренных)
	ТЗСсылок = КорректировкиРТУСервер.ПолучитьКорректировкуПоОснованию(ДокСсылка.Ссылка);
	Если ТЗСсылок.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	Для каждого стрСсылка из ТЗСсылок Цикл		
		ОтключитьОтчетФНСДляВсехПодчиненныхИСФ(стрСсылка, СписокПросмотренных);
		Если СписокПросмотренных.Найти(стрСсылка) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		СписокПросмотренных.Добавить(стрСсылка);
		УправлениеВыгрузкойДляФНС(НайтиПодчиненныйСчетФактуру(стрСсылка), Ложь, Истина);	
	КонецЦикла;
КонецПроцедуры

Процедура УправлениеВыгрузкойДляФНС(ТекущаяИСФ, Включить = Истина, Оповещение = Ложь)
	Если НЕ ЗначениеЗаполнено(ТекущаяИСФ) Тогда 
		Возврат;
	КонецЕсли;  
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
	// Было:
	//Если ТекущаяИСФ.УдалитьВключатьВОтчетДляФНС = Включить Тогда 
	//	Возврат;
	//КонецЕсли; 
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025
	
	ТекущаяИСФ = ТекущаяИСФ.Получитьобъект();	 
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
	//Реквизит перенесен в ТЧ ПодтверждающиеДокументы и МорскойТранспорт
	// Было:
	//ТекущаяИСФ.УдалитьВключатьВОтчетДляФНС = Включить; 
	//Стало:
	Для каждого СтрПодтверждающихДок Из ТекущаяИСФ.ПодтверждающиеДокументы Цикл
		СтрПодтверждающихДок.ВключатьВОтчетДляФНС = Включить;
	КонецЦикла;
	Для каждого СтрМорскойТранспорт Из ТекущаяИСФ.МорскойТранспорт Цикл
		СтрМорскойТранспорт.ВключатьВОтчетДляФНС = Включить;
	КонецЦикла;	
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025
	
	Попытка
		ТекущаяИСФ.Записать();
		Если Оповещение Тогда
			Если НЕ Включить Тогда 
				сообщ = "исключен из отчета";          
			Иначе     
				сообщ = "включен в отчет";
			КонецЕсли;
			Сообщить("Документ " + ТекущаяИСФ + ", "+сообщ+" для ФНС");
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
//--ДИТ_Коробов_Task 46790_24.02.22