
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПочтоваяОпись";
	КомандаПечати.Представление = "Почтовая опись";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СопроводительноеПисьмо";
	КомандаПечати.Представление = "Сопроводительное письмо";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПочтоваяОпись") Тогда
		СтрокиКоллекции = КоллекцияПечатныхФорм.НайтиСтроки(Новый Структура("ИмяВРЕГ",ВРег("ПочтоваяОпись")));
		Для каждого СтрокаТек Из СтрокиКоллекции Цикл
			СтрокаТек.ЭкземпляровПредустановленное = 2;
		КонецЦикла;
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПочтоваяОпись", "Почтовая опись", ПечатьПочтоваяОпись(ЭлМассива));
		КонецЦикла;
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СопроводительноеПисьмо") Тогда
		СтрокиКоллекции = КоллекцияПечатныхФорм.НайтиСтроки(Новый Структура("ИмяВРЕГ",ВРег("СопроводительноеПисьмо")));
		Для каждого СтрокаТек Из СтрокиКоллекции Цикл
			СтрокаТек.ЭкземпляровПредустановленное = 2;
		КонецЦикла;
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СопроводительноеПисьмо", "Сопроводительное письмо", ПечатьСопроводительноеПисьмо(ЭлМассива));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПечатьПочтоваяОпись(ПакетСсылка) Экспорт
	
	Если ПакетСсылка=Неопределено Тогда
		ПакетСсылка = Справочники.ПакетыДокументов.СоздатьЭлемент();	
	КонецЕсли;
	
	Макет = Справочники.ПакетыДокументов.ПолучитьМакет("ПечатнаяОпись");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьШапка.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	СведенияОбКонтрагенте = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(ПакетСсылка.Контрагент, ?(ПакетСсылка.ПечатныеФормы.Количество()=0,ТекущаяДата(),ПакетСсылка.ПечатныеФормы[0].Документ.Дата));
	Если ЗначениеЗаполнено(СведенияОбКонтрагенте.ФактическийАдрес) Тогда
		ОбластьШапка.Параметры.Куда = СведенияОбКонтрагенте.ФактическийАдрес;	
	Иначе
		ОбластьШапка.Параметры.Куда = СведенияОбКонтрагенте.ЮридическийАдрес;	
	КонецЕсли;
	//ОбластьШапка.Параметры.Кому = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПакетСсылка.Контрагент,"НаименованиеПолное");
	ОбластьШапка.Параметры.Кому = СведенияОбКонтрагенте.НаименованиеДляПечатныхФорм;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//СтруктураИменДокументов = Новый Структура;
	//СтруктураИменДокументов.Вставить("РеализацияТоваровУслуг", "Акт сдачи приемки/УПД"); //Евросиб Литвинов 17.05.2021 #34451
	//СтруктураИменДокументов.Вставить("ОтчетКомитентуОПродажах", "Отчет комитенту о продажах");
	//СтруктураИменДокументов.Вставить("СчетФактураВыданный", "Счет-фактура выданный/УПД"); //Евросиб Литвинов 17.05.2021 #34451
	//НаименованиеДокумента = Неопределено;
	ИтогКоличествоЛистов = 0;

	Для каждого ДокументКлиента Из ПакетСсылка.ПечатныеФормы Цикл
		//Если СтруктураИменДокументов.Свойство(ДокументКлиента.Метаданные().Имя, НаименованиеДокумента) Тогда
		//	ОбластьСтрокаТаблицы.Параметры.НаименованиеДокумента = НаименованиеДокумента;
		//Иначе
		//	ОбластьСтрокаТаблицы.Параметры.НаименованиеДокумента = ДокументКлиента.Метаданные().Синоним;
		//КонецЕсли;
		ОбластьСтрокаТаблицы.Параметры.Номер = ДокументКлиента.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.НаименованиеПредмета = ДокументКлиента.ИмяПФ;
		ОбластьСтрокаТаблицы.Параметры.КоличествоЛистов = ДокументКлиента.КоличествоЛистов;
		ИтогКоличествоЛистов = ИтогКоличествоЛистов+ДокументКлиента.КоличествоЛистов;
		ОбластьСтрокаТаблицы.Параметры.ОбъявленнаяЦенность = "";
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ИтогКоличествоЛистов = ИтогКоличествоЛистов; 
	ОбластьПодвал.Параметры.Отправитель = Пользователи.ТекущийПользователь(); 
	ОбластьПодвал.Параметры.Проверил = Пользователи.ТекущийПользователь(); 
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСопроводительноеПисьмо(ПакетСсылка) Экспорт
	
	Если ПакетСсылка=Неопределено Тогда
		ПакетСсылка = Справочники.ПакетыДокументов.СоздатьЭлемент();	
	КонецЕсли;
	
	Макет = Справочники.ПакетыДокументов.ПолучитьМакет("СопроводительноеПисьмо");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если ПакетСсылка.Организация.ОбособленноеПодразделение и ЗначениеЗаполнено(ПакетСсылка.Организация.ГоловнаяОрганизация) Тогда
		ПакетСсылкаОрганизация = ПакетСсылка.Организация.ГоловнаяОрганизация;
	Иначе	
		ПакетСсылкаОрганизация = ПакетСсылка.Организация;
	КонецЕсли;
	СведенияОбОрганизации = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(ПакетСсылкаОрганизация,ТекущаяДата());
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ФактическийАдрес) Тогда
		ОрганизацияАдрес = СведенияОбОрганизации.ФактическийАдрес;	
	Иначе
		ОрганизацияАдрес = СведенияОбОрганизации.ЮридическийАдрес;	
	КонецЕсли;
	ОрганизацияНаименованиеПолное = СведенияОбОрганизации.ПолноеНаименование;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ОрганизацияНаименованиеПолное = ОрганизацияНаименованиеПолное;	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//СтруктураИменДокументов = Новый Структура;
	//СтруктураИменДокументов.Вставить("РеализацияТоваровУслуг", "Акт сдачи приемки/УПД"); //Евросиб Литвинов 17.05.2021 #34451
	//СтруктураИменДокументов.Вставить("ОтчетКомитентуОПродажах", "Отчет комитенту о продажах");
	//СтруктураИменДокументов.Вставить("СчетФактураВыданный", "Счет-фактура выданный/УПД"); //Евросиб Литвинов 17.05.2021 #34451
	//НаименованиеДокумента = Неопределено;
	ИтогКоличествоЛистов = 0;
    ТекДокумент=Неопределено;
	ТекДоговор=Неопределено;
	МинСрокВозвратаДокументовКонтрагентомДни = 0;
	Для каждого ДокументКлиента Из ПакетСсылка.ПечатныеФормы Цикл
		Если ТекДокумент<>ДокументКлиента.Документ Тогда
			ТекДокумент = ДокументКлиента.Документ;
			ТекДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументКлиента.Документ,"ДоговорКонтрагента");
			ТекСрокВозвратаДокументовКонтрагентомДни = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДоговор,"СрокВозвратаДокументовКонтрагентомДни");
			Если ЗначениеЗаполнено(ТекСрокВозвратаДокументовКонтрагентомДни) и 
				(МинСрокВозвратаДокументовКонтрагентомДни = 0 или ТекСрокВозвратаДокументовКонтрагентомДни<МинСрокВозвратаДокументовКонтрагентомДни) Тогда
			 	ТекСрокВозвратаДокументовКонтрагентомДни = МинСрокВозвратаДокументовКонтрагентомДни;
			КонецЕсли;
		КонецЕсли;
		//Если СтруктураИменДокументов.Свойство(ДокументКлиента.Метаданные().Имя, НаименованиеДокумента) Тогда
		//	ОбластьСтрокаТаблицы.Параметры.НаименованиеДокумента = НаименованиеДокумента;
		//Иначе
		//	ОбластьСтрокаТаблицы.Параметры.НаименованиеДокумента = ДокументКлиента.Метаданные().Синоним;
		//КонецЕсли;
		ОбластьСтрокаТаблицы.Параметры.Номер = ДокументКлиента.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.НаименованиеПредмета = ДокументКлиента.ИмяПФ;
		ОбластьСтрокаТаблицы.Параметры.Договор = ТекДоговор;
		ОбластьСтрокаТаблицы.Параметры.КоличествоЛистов = ДокументКлиента.КоличествоЛистов;
		ОбластьСтрокаТаблицы.Параметры.КоличествоЭкземпляров = ДокументКлиента.КоличествоЭкземпляров;
		ИтогКоличествоЛистов = ИтогКоличествоЛистов+ДокументКлиента.КоличествоЛистов;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ОбластьПодвал.Параметры.ИтогКоличествоЛистов = ИтогКоличествоЛистов; 
	ОбластьПодвал.Параметры.ОрганизацияНаименованиеПолное = ОрганизацияНаименованиеПолное; 
	ОбластьПодвал.Параметры.ОрганизацияАдрес = ОрганизацияАдрес; 
	Если Не ЗначениеЗаполнено(МинСрокВозвратаДокументовКонтрагентомДни) Тогда
		МинСрокВозвратаДокументовКонтрагентомДни = 5;
	КонецЕсли;
	ОбластьПодвал.Параметры.СрокВозвратаДокументовКонтрагентомДни = МинСрокВозвратаДокументовКонтрагентомДни;
	//ФормСтрока = "Л = ru_RU; НП = Ложь; НД = Ложь";
	//ПредметСтрока = "день, дня, дней, м, 0";     
	//"НП=Ложь",",,,,,,,,0"
	ОбластьПодвал.Параметры.ПрописьюСрокВозвратаДокументовКонтрагентомДни = ЧислоПрописью(МинСрокВозвратаДокументовКонтрагентомДни, "НП=Ложь", ",,,,,,,,0");
	
	//ОбластьПодвал.Параметры.Проверил = Пользователи.ТекущийПользователь(); 
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	Возврат ТабличныйДокумент;
	
КонецФункции


