
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

	ШкалаНепрерывна = Истина;
	
	До = 0;
	КоличествоОт0 = 0;
	КоличествоДо0 = 0;
	НомерСтроки = 0;
	Для каждого СтрокаШкалы из ТаблицаШкалы Цикл
		НомерСтроки = НомерСтроки+1;
		Если СтрокаШкалы.От = 0 Тогда КоличествоОт0 = КоличествоОт0+1 КонецЕсли;
		Если СтрокаШкалы.До = 0 Тогда КоличествоДо0 = КоличествоДо0+1 КонецЕсли;
		Если НЕ До = 0 Тогда
			Если НЕ СтрокаШкалы.От = До+1 Тогда
				ШкалаНепрерывна = Ложь;
				Сообщить("Прервана шкала в строке - "+НомерСтроки);
			Иначе
				До = СтрокаШкалы.До;
			КонецЕсли;
		Иначе
			До = СтрокаШкалы.До;	
		КонецЕсли;
	КонецЦикла;
	Если КоличествоОт0>1 Тогда ШкалаНепрерывна=Ложь; Сообщить("Должна быть только одна строка с пустым полем ""От"""); КонецЕсли;
	Если КоличествоДо0>1 Тогда ШкалаНепрерывна=Ложь; Сообщить("Должна быть только одна строка с пустым полем ""До"""); КонецЕсли;
	
	Если ШкалаНепрерывна Тогда
		Закрыть(ТаблицаШкалы);
	Иначе
		Сообщить("Проверьте непрерывность шкалы! Данные не записаны!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если параметры.Свойство("ШкалаСтавок") Тогда		
		Для каждого Стр из Параметры.ШкалаСтавок Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаШкалы.Добавить(), Стр);			
		КонецЦикла;		
	КонецЕсли;

	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	Элементы.ТаблицаШкалы.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	Элементы.Группа1.Видимость = НЕ Параметры.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока = ТаблицаШкалы.Добавить();
	
	Если ТаблицаШкалы.Количество()>1 Тогда
		НоваяСтрока.От = ТаблицаШкалы[ТаблицаШкалы.Количество()-2].До+1;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаШкалыДоПриИзменении(Элемент)
	ТекД = Элементы.ТаблицаШкалы.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		Если ТекД.До < ТекД.От И НЕ ТекД.До = 0 Тогда
			Сообщить("Поля ""До"" должны быть больше полей ""От""!");
			ТекД.До = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

