
////////////////
//4.1.2. Инфообмен «Предложение по заявкам»

Функция СоздатьЗаявку(ОбъектXDTO) Экспорт
	
	ДатаРазмещенияЗаявки = ТекущаяДатаСеанса();
	
	ИдентификаторЗаявки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "RFQ_ID");
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
	RFQ_ID = "";
	НомерЛота = "";
	МассивСтрок = СтрРазделить(ИдентификаторЗаявки,"/");
	Если МассивСтрок.Количество() = 2 Тогда 
		RFQ_ID = МассивСтрок[0];
		НомерЛота = МассивСтрок[1];
	КонецЕсли;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023	
		
	КодСтатусаЗаявки = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.RESP_STATUS_RFQ);
	НаименованиеСтатусаЗаявки = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.RESP_STATUS_RFQ_D);
	СтатусЗаявки = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаЖД, КодСтатусаЗаявки);
	
	Комментарий = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.COMMENT);
	
	КодКонечнойСтанцииНазначенияПриСухопутье = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "EXT_POINT", Тип("Строка"));
	КодПритерминальнойЖДСтанции = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "TERM_LOC", Тип("Строка"));
	КодСтанцииОтправкиГруженого = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "DEST_LOC", Тип("Строка"));
	КодСтанцииНазначенияГруженого = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "DEST_POINT", Тип("Строка"));
	
	ПлановаяДатаОтгрузкиГруженогоСостава = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "ETD_PLANT", Тип("Дата"));
	НеобходимаяДатаПодачиПорожнегоСостава = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "ETA_CONT", Тип("Дата"));	
	
	КодГрузоотправителя = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "SHIPPER_ID");
	Грузоотправитель = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО", КодГрузоотправителя);
	
	НомерДоговора = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "FAG_ID_DESR");
	
	//Поиск среди размещенных заявок
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СибурРазмещенныеЗаявки.RFQ_ID КАК RFQ_ID,
	|	СибурРазмещенныеЗаявки.EXT_RFQ_ID КАК EXT_RFQ_ID,
	|	СибурРазмещенныеЗаявки.Заявка КАК ДокументЗаявка,
	|	СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых
	|ПОМЕСТИТЬ ВТЗаявка
	|ИЗ
	|	РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|ГДЕ
	|	СибурРазмещенныеЗаявки.RFQ_ID В(&ИдентификаторыЗаявок)
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 31.03.2023
	|	ИЛИ СибурРазмещенныеЗаявки.RFQ_ID ПОДОБНО &ИдентификаторыЗаявок2
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 31.03.2023
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СибурСтатусыЗаявокСрезПоследних.Заявка КАК Заявка,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки КАК СтатусЗаявки,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки.Код КАК СтатусЗаявкиКод,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки.Наименование КАК СтатусЗаявкиНаименование
	|ПОМЕСТИТЬ ВТСтатусыЗаявок
	|ИЗ
	|	РегистрСведений.СибурСтатусыЗаявок.СрезПоследних(
	|			,
	|			Заявка В
	|				(ВЫБРАТЬ
	|					ВТЗаявка.ДокументЗаявка КАК ДокументЗаявка
	|				ИЗ
	|					ВТЗаявка КАК ВТЗаявка)) КАК СибурСтатусыЗаявокСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.RFQ_ID КАК RFQ_ID,
	|	ВТЗаявка.EXT_RFQ_ID КАК EXT_RFQ_ID,
	|	ВТЗаявка.ДокументЗаявка КАК ДокументЗаявка,
	|	ВТЗаявка.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых,
	|	ВТСтатусыЗаявок.СтатусЗаявки КАК СтатусЗаявки,
	|	ВТСтатусыЗаявок.СтатусЗаявкиКод КАК СтатусЗаявкиКод,
	|	ВТСтатусыЗаявок.СтатусЗаявкиНаименование КАК СтатусЗаявкиНаименование
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатусыЗаявок КАК ВТСтатусыЗаявок
	|		ПО ВТЗаявка.ДокументЗаявка = ВТСтатусыЗаявок.Заявка";
	Запрос.УстановитьПараметр("ИдентификаторыЗаявок", ОбъектXDTO.RFQ_ID);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 31.03.2023
	Запрос.УстановитьПараметр("ИдентификаторыЗаявок2", "%"+RFQ_ID+"%");
	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 31.03.2023
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НайденнаяЗаявка = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ЗаявкаПорожних = Выборка.ДокументЗаявка;
		ЗаявкаПорожнихОбъект = ЗаявкаПорожних.ПолучитьОбъект();
		ЗаявкаГруженых = Выборка.ЗаявкаНаОтправкуГруженых;
		//ЗаявкаГруженыхОбъект = ЗаявкаГруженых.ПолучитьОбъект();
	Иначе
		ЗаявкаГруженых = Неопределено;
		//ЗаявкаГруженыхОбъект = Документы.Заявка.СоздатьДокумент();
		//Попытка
		//	ЗаявкаГруженыхОбъект.Заполнить(Неопределено);
		//Исключение
		//КонецПопытки;
		//ЗаявкаГруженыхОбъект.Дата = ДатаРазмещенияЗаявки;
		
		ЗаявкаПорожнихОбъект = Документы.Заявка.СоздатьДокумент();
		ЗаявкаПорожнихОбъект.Заполнить(Неопределено);
		ЗаявкаПорожнихОбъект.Дата = ДатаРазмещенияЗаявки;
		
	КонецЕсли;
	
	//Грузоотправитель порожних контейнеров (Евросиб)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ЕСТЬNULL(Организации.ГоловнаяОрганизация.ОКПО, Организации.ОКПО) = Контрагенты.КодПоОКПО)
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	Запрос.УстановитьПараметр("Организация", ЗаявкаПорожнихОбъект.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	ГрузоотправительПорожних = Неопределено;
	Если Выборка.Следующий() Тогда
		ГрузоотправительПорожних = Выборка.Контрагент;
	КонецЕсли;
	
	//Получение станций по кодам
	КодыСтанций = Новый Массив;
	Если ЗначениеЗаполнено(КодСтанцииОтправкиГруженого) Тогда
		КодыСтанций.Добавить(КодСтанцииОтправкиГруженого);
	КонецЕсли;
	Если ЗначениеЗаполнено(КодСтанцииНазначенияГруженого) Тогда
		КодыСтанций.Добавить(КодСтанцииНазначенияГруженого);
	КонецЕсли;
	Если ЗначениеЗаполнено(КодПритерминальнойЖДСтанции) Тогда
		КодыСтанций.Добавить(КодПритерминальнойЖДСтанции);
	КонецЕсли;
	СтанцииПоКодам = Новый Соответствие;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Локации.КодЖДСтанции КАК Код,
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.КодЖДСтанции В(&КодыСтанций)";
	Запрос.УстановитьПараметр("КодыСтанций", КодыСтанций);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтанцииПоКодам.Вставить(Выборка.Код, Выборка.Ссылка);
	КонецЦикла;
	
	СтанцияОтправкиГруженого = СтанцииПоКодам.Получить(КодСтанцииОтправкиГруженого);
	СтанцияНазначенияГруженого = СтанцииПоКодам.Получить(КодСтанцииНазначенияГруженого);
	ПритерминальнаяСтанция = СтанцииПоКодам.Получить(КодПритерминальнойЖДСтанции);
	
	//Типоразмеры ТЕ
	ТипКонтейнераСтрокой = ПолучитьТипКонтейнераСтрокойПоКодуСибур(ОбъектXDTO.CONTAINER_MOT);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипоразмерыТЕ.Наименование КАК Наименование,
	|	ТипоразмерыТЕ.Ссылка КАК Типоразмер,
	|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК
	|ИЗ
	|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|ГДЕ
	|	ТипоразмерыТЕ.Наименование = &НаименованиеТипаКонтейнера
	|	И НЕ ТипоразмерыТЕ.ПометкаУдаления";
	Запрос.УстановитьПараметр("НаименованиеТипаКонтейнера", ТипКонтейнераСтрокой);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		ТипКонтейнера = Выборка.Типоразмер;
		РазмерКонтейнера = Выборка.РазмерКТК;
	Иначе
		
		ТипКонтейнера = Неопределено;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РазмерыКТК.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РазмерыКТК КАК РазмерыКТК
		|ГДЕ
		|	РазмерыКТК.Наименование = &Наименование
		|	И НЕ РазмерыКТК.ПометкаУдаления";
		РазмерКонтейнераСтрокой = Лев(ТипКонтейнераСтрокой, 2);
		Запрос.УстановитьПараметр("Наименование", РазмерКонтейнераСтрокой);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			РазмерКонтейнера = Выборка.Ссылка;
		Иначе
			РазмерКонтейнера = Неопределено;
		КонецЕсли;
		
	КонецЕсли;	
	
	Контрагент = ПолучитьКонтрагентаСибур();
	
	Если ТипЗнч(НомерДоговора) = Тип("Строка") И ЗначениеЗаполнено(НомерДоговора) Тогда
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", НомерДоговора,, Контрагент);
	Иначе
		НомерДоговора = "";
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
			
	ВесПродукции = Число(ОбъектXDTO.WEIGHT);
	КоличествоКонтейнеров = Число(ОбъектXDTO.ALL_CONTAINER_QUANT);
	
	//Заявка на подсыл порожнего
	ЗаявкаПорожнихОбъект.ГруженыйРейс = Ложь;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.ВнешнийНомер) Тогда
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
		// Было:
		//ЗаявкаПорожнихОбъект.ВнешнийНомер = ИдентификаторЗаявки; 
		//Стало:
		ЗаявкаПорожнихОбъект.ВнешнийНомер = RFQ_ID;
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.ВнешняяДата) Тогда
		ЗаявкаПорожнихОбъект.ВнешняяДата = ДатаРазмещенияЗаявки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.Контрагент) Тогда
		ЗаявкаПорожнихОбъект.Контрагент = Контрагент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.Договор) Тогда
		ЗаявкаПорожнихОбъект.Договор = Договор;
	КонецЕсли;
	ЗаявкаПорожнихОбъект.СтатусЗаявкиСибур = СтатусЗаявки;

	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
	МассивСтрок = ЗаявкаПорожнихОбъект.НомераЛотов.НайтиСтроки(Новый Структура("НомерЛота",НомерЛота));  
	Если Не МассивСтрок.Количество() Тогда  
		НоваяСтрока = ЗаявкаПорожнихОбъект.НомераЛотов.Добавить();
		НоваяСтрока.НомерЛота = НомерЛота;
	КонецЕсли;	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
		
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.ПритерминальнаяСтанция) Тогда
		ЗаявкаПорожнихОбъект.ПритерминальнаяСтанция = ПритерминальнаяСтанция;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.Грузоотправитель) Тогда
		ЗаявкаПорожнихОбъект.Грузоотправитель = ГрузоотправительПорожних;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.СтанцияОтправленияГруженого) Тогда
		ЗаявкаПорожнихОбъект.СтанцияОтправленияГруженого = СтанцияОтправкиГруженого;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.СтанцияНазначенияГруженого) Тогда
		ЗаявкаПорожнихОбъект.СтанцияНазначенияГруженого = СтанцияНазначенияГруженого;
	КонецЕсли;
	
	ДанныеПоКалькуляции = ПолучитьКалькуляциюИПротокол(Контрагент, Договор, , СтанцияОтправкиГруженого);
	Калькуляция = ДанныеПоКалькуляции.Калькуляция;
	Протокол = ДанныеПоКалькуляции.Протокол;
	
	Если Не ЗначениеЗаполнено(ЗаявкаПорожнихОбъект.ПСЦ) Тогда
		ЗаявкаПорожнихОбъект.ПСЦ = Протокол;
	КонецЕсли;
	
	ЗаявкаПорожнихОбъект.Прибытие = НеобходимаяДатаПодачиПорожнегоСостава;
	
	Если ЗаявкаПорожнихОбъект.СоставУслуги.Количество() = 0 Тогда
		Для ПорядковыйНомер = 1 По КоличествоКонтейнеров Цикл
			НоваяСтрока = ЗаявкаПорожнихОбъект.СоставУслуги.Добавить();
			НоваяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
			НоваяСтрока.ТипКТК = ТипКонтейнера;
			НоваяСтрока.РазмерКТК = РазмерКонтейнера;
			НоваяСтрока.Калькуляция = ДанныеПоКалькуляции.Калькуляция;
			НоваяСтрока.Грузоотправитель = ГрузоотправительПорожних;
			НоваяСтрока.Грузополучатель = Грузоотправитель; //Грузополучатель порожних это грузоотправитель груженых
			НоваяСтрока.СтанцияОтправления = ПритерминальнаяСтанция;
			НоваяСтрока.СтанцияНазначения = СтанцияОтправкиГруженого;
			НоваяСтрока.Груженый = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	//Установка дополнительных свойств для изменения Состояния заявки
	УстановитьДопСвойстваСостоянияЗаявки(ЗаявкаПорожнихОбъект, СтатусЗаявки, ДатаРазмещенияЗаявки, Комментарий);
	
	//Запись заявки
	Попытка
		ЗаявкаПорожнихОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаявкаПорожнихОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	ЗаявкаПорожних = ЗаявкаПорожнихОбъект.Ссылка;
	НомерЗаявкиПорожних = ЗаявкаПорожнихОбъект.Номер;
	
	//Уведомление ответственного по e-mail об изменении заявки
	ОтборУведомлений = Новый Структура;
	ОтборУведомлений.Вставить("Документ", ЗаявкаПорожних);
	ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
	Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений);	
	
	//Заявка на отправку груженого
	Если ЗначениеЗаполнено(ЗаявкаГруженых) Тогда		
		ЗаявкаГруженыхОбъект = ЗаявкаГруженых.ПолучитьОбъект();
	Иначе		
		ЗаявкаГруженыхОбъект = Документы.Заявка.СоздатьДокумент();
		Попытка
			ЗаявкаГруженыхОбъект.Заполнить(Неопределено);
		Исключение
		КонецПопытки;
		ЗаявкаГруженыхОбъект.Дата = ДатаРазмещенияЗаявки;		
	КонецЕсли;
	
	ЗаявкаГруженыхОбъект.ГруженыйРейс = Истина;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.ВнешнийНомер) Тогда
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
		// Было:
		//ЗаявкаГруженыхОбъект.ВнешнийНомер = ИдентификаторЗаявки; 
		//Стало:
		ЗаявкаГруженыхОбъект.ВнешнийНомер = RFQ_ID;
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.ВнешняяДата) Тогда
		ЗаявкаГруженыхОбъект.ВнешняяДата = ДатаРазмещенияЗаявки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.Контрагент) Тогда
		ЗаявкаГруженыхОбъект.Контрагент = Контрагент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.Договор) Тогда
		ЗаявкаГруженыхОбъект.Договор = Договор;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.СтатусЗаявкиСибур) Тогда
		ЗаявкаГруженыхОбъект.СтатусЗаявкиСибур = СтатусЗаявки;
	КонецЕсли;
	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
	МассивСтрок = ЗаявкаГруженыхОбъект.НомераЛотов.НайтиСтроки(Новый Структура("НомерЛота",НомерЛота));  
	Если МассивСтрок.Количество() = 0 Тогда  
		НоваяСтрока = ЗаявкаГруженыхОбъект.НомераЛотов.Добавить();
		НоваяСтрока.НомерЛота = НомерЛота;
	КонецЕсли;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
		
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.ПритерминальнаяСтанция) Тогда
		ЗаявкаГруженыхОбъект.ПритерминальнаяСтанция = ПритерминальнаяСтанция;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.Грузоотправитель) Тогда
		ЗаявкаГруженыхОбъект.Грузоотправитель = Грузоотправитель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.СтанцияОтправленияГруженого) Тогда
		ЗаявкаГруженыхОбъект.СтанцияОтправленияГруженого = СтанцияОтправкиГруженого;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.СтанцияНазначенияГруженого) Тогда
		ЗаявкаГруженыхОбъект.СтанцияНазначенияГруженого = СтанцияНазначенияГруженого;
	КонецЕсли;
	
	ДанныеПоКалькуляции = ПолучитьКалькуляциюИПротокол(Контрагент, Договор, СтанцияОтправкиГруженого, СтанцияНазначенияГруженого);
	Калькуляция = ДанныеПоКалькуляции.Калькуляция;
	Протокол = ДанныеПоКалькуляции.Протокол;
	
	Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.ПСЦ) Тогда
		ЗаявкаГруженыхОбъект.ПСЦ = Протокол;
	КонецЕсли;
	
	//Евросиб Каблов 02.02.2021 ( Ticket#0220444	
	//Если Не ЗначениеЗаполнено(ЗаявкаГруженыхОбъект.Отправка) Тогда
	//	ЗаявкаГруженыхОбъект.Отправка = ПлановаяДатаОтгрузкиГруженогоСостава;
	//КонецЕсли;
	ЗаявкаГруженыхОбъект.Отправка = ПлановаяДатаОтгрузкиГруженогоСостава;
	//Евросиб Каблов 02.02.2021 ) 
	
	//Данные по нескольким направлениям
	ЗаявкаГруженыхОбъект.НаправленияОтправки.Очистить();
	СвойствоITEM = ОбъектXDTO.Свойства().Получить("ITEM");
	Если СвойствоITEM <> Неопределено Тогда
		
		ЭлементITEM = ОбъектXDTO.ITEM;
		СвойствоRFQuotItem = ЭлементITEM.Свойства().Получить("RFQuotItem");
		Если СвойствоRFQuotItem <> Неопределено Тогда
			
			ДанныеПоНаправлениям = ЭлементITEM.RFQuotItem;
			Если ТипЗнч(ДанныеПоНаправлениям) = Тип("СписокXDTO") Тогда
				Направления = ДанныеПоНаправлениям;
			Иначе
				Направления = Новый Массив;
				Если ТипЗнч(ДанныеПоНаправлениям) = Тип("ОбъектXDTO") Тогда
					Направления.Добавить(ДанныеПоНаправлениям);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Направление Из Направления Цикл
				НоваяСтрока = ЗаявкаГруженыхОбъект.НаправленияОтправки.Добавить();
				НоваяСтрока.КодСтраныНазначения = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Направление, "FIN_LOC");
				НоваяСтрока.НаименованиеСтраныНазначения = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Направление, "FIN_LOC_DESCR");
				НоваяСтрока.КоличествоКонтейнеров = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Направление, "CONTAINER_QUANT");
				НоваяСтрока.ТипУпаковки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Направление, "PACK");
				НоваяСтрока.НаименованиеТипаУпаковки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Направление, "PACK_D");
				НоваяСтрока.СтранаНазначения = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", НоваяСтрока.КодСтраныНазначения);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Данные по грузам
	ЗаявкаГруженыхОбъект.ОтправляемыеГрузы.Очистить();
	СвойствоPRODUCT = ОбъектXDTO.Свойства().Получить("PRODUCT");
	Если СвойствоPRODUCT <> Неопределено Тогда
		
		ЭлементPRODUCT = ОбъектXDTO.PRODUCT;
		СвойствоRFQuotProduct = ЭлементPRODUCT.Свойства().Получить("RFQuotProduct");
		Если СвойствоRFQuotProduct <> Неопределено Тогда
		
			ДанныеПоГрузам = ЭлементPRODUCT.RFQuotProduct;
			Если ТипЗнч(ДанныеПоГрузам) = Тип("СписокXDTO") Тогда
				Грузы = ДанныеПоНаправлениям;
			Иначе
				Грузы = Новый Массив;
				Если ТипЗнч(ДанныеПоГрузам) = Тип("ОбъектXDTO") Тогда
					Грузы.Добавить(ДанныеПоГрузам);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Груз Из Грузы Цикл
				НоваяСтрока = ЗаявкаГруженыхОбъект.ОтправляемыеГрузы.Добавить();
				НоваяСтрока.КодГрузаЕТСНГ = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Груз, "CARGO");
				НоваяСтрока.НаименованиеГрузаЕТСНГ = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Груз, "CARGO_DESCR");
				НоваяСтрока.КодГрузаГНГ = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Груз, "GNG_CODE");
				НоваяСтрока.НаименованиеГрузаГНГ = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Груз, "GNG_DESCR");
				
				Если ЗначениеЗаполнено(НоваяСтрока.КодГрузаЕТСНГ) Тогда
					НоваяСтрока.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", НоваяСтрока.КодГрузаЕТСНГ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоваяСтрока.Груз) И ЗначениеЗаполнено(НоваяСтрока.КодГрузаГНГ) Тогда
					НоваяСтрока.Груз = Справочники.Грузы.НайтиПоРеквизиту("ГНГ", НоваяСтрока.КодГрузаГНГ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;		
	КонецЕсли;
	
	Груз = Неопределено;
	КодЕТСНГ = "";
	Если ЗаявкаГруженыхОбъект.ОтправляемыеГрузы.Количество() = 1 Тогда
		СтрокаТЧ = ЗаявкаГруженыхОбъект.ОтправляемыеГрузы[0];
		Груз = СтрокаТЧ.Груз;
		КодЕТСНГ = СтрокаТЧ.КодГрузаЕТСНГ;
	КонецЕсли;
	
	Если ЗаявкаГруженыхОбъект.СоставУслуги.Количество() = 0 Тогда
		Для ПорядковыйНомер = 1 По КоличествоКонтейнеров Цикл
			НоваяСтрока = ЗаявкаГруженыхОбъект.СоставУслуги.Добавить();
			НоваяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
			НоваяСтрока.ТипКТК = ТипКонтейнера;
			НоваяСтрока.РазмерКТК = РазмерКонтейнера;
			НоваяСтрока.Калькуляция = ДанныеПоКалькуляции.Калькуляция;
			НоваяСтрока.Грузоотправитель = Грузоотправитель;
			НоваяСтрока.СтанцияОтправления = СтанцияОтправкиГруженого;
			НоваяСтрока.СтанцияНазначения = СтанцияНазначенияГруженого;
			НоваяСтрока.Груженый = Истина;
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 31.03.2023
			// Было:
			//НоваяСтрока.Груз = Груз; 
			//Стало:
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
			СтруктураКлючаАналитикиПеревозки.Груз = Груз;
			КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
			НоваяСтрока.КлючАналитикиПеревозки = КлючАналитикиПеревозки;
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 31.03.2023
			НоваяСтрока.КодГруза = КодЕТСНГ;
		КонецЦикла;
	КонецЕсли;
	
	//Запись заявки
	Попытка
		ЗаявкаГруженыхОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаявкаГруженыхОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	ЗаявкаГруженых = ЗаявкаГруженыхОбъект.Ссылка;
		
	ЗаписьРазмещенияЗаявки = РегистрыСведений.СибурРазмещенныеЗаявки.СоздатьМенеджерЗаписи();
	ЗаписьРазмещенияЗаявки.Заявка = ЗаявкаПорожних;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 07.04.2023
	ЗаписьРазмещенияЗаявки.НомерЛота = НомерЛота;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 07.04.2023
	ЗаписьРазмещенияЗаявки.ЗаявкаНаОтправкуГруженых = ЗаявкаГруженых;
	ЗаписьРазмещенияЗаявки.RFQ_ID = ИдентификаторЗаявки;
	ЗаписьРазмещенияЗаявки.EXT_RFQ_ID = НомерЗаявкиПорожних;
	ЗаписьРазмещенияЗаявки.КодОКПОГрузоотправителяПоЖД = КодГрузоотправителя;
	ЗаписьРазмещенияЗаявки.НаименованиеГрузоотправителяПоЖД = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "SHIPPER_DESCR");
	ЗаписьРазмещенияЗаявки.КодКонечнойСтанцииНазначенияПриСухопутье = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.EXT_POINT);
	ЗаписьРазмещенияЗаявки.НазваниеКонечнойСтанцииНазначенияПриСухопутье = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.EXT_POINT_D);
	ЗаписьРазмещенияЗаявки.КодПритерминальнойЖДСтанции = КодПритерминальнойЖДСтанции;
	ЗаписьРазмещенияЗаявки.НазваниеПритерминальнойЖДСтанции = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TERM_LOC_DESCR);
	ЗаписьРазмещенияЗаявки.ДатаКрайнегоСрокаОтветаЭкспедитора = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "EST_END_DATETIME", Тип("Дата"));
	ЗаписьРазмещенияЗаявки.ВидЗакупкиКод = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.RFQ_ITM_TYPE);
	ЗаписьРазмещенияЗаявки.ВидЗакупкиНаименование = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.RFQ_ITM_TYPE_D);
	ЗаписьРазмещенияЗаявки.ВидОтправкиКод = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TRADE_TYPE);
	ЗаписьРазмещенияЗаявки.ВидОтправкиНаименование = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TRADE_TYPE_D);
	ЗаписьРазмещенияЗаявки.НомерДоговора = НомерДоговора;
	ЗаписьРазмещенияЗаявки.НеобходимаяДатаПодачиПорожнегоСостава = НеобходимаяДатаПодачиПорожнегоСостава;
	ЗаписьРазмещенияЗаявки.ПлановаяДатаОтгрузкиГруженогоСостава = ПлановаяДатаОтгрузкиГруженогоСостава;
	ЗаписьРазмещенияЗаявки.КодСтанцииОтправкиГруженого = КодСтанцииОтправкиГруженого;
	ЗаписьРазмещенияЗаявки.НазваниеСтанцииОтправкиГруженого = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.DEST_LOC_DESCR);
	ЗаписьРазмещенияЗаявки.МаршрутСледованияГруженогоПоезда = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.DEST_LOAD);
	ЗаписьРазмещенияЗаявки.КодСтанцииНазначенияГруженого = КодСтанцииНазначенияГруженого;
	ЗаписьРазмещенияЗаявки.НазваниеСтанцииНазначенияГруженого = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.DEST_POINT_D);
	ЗаписьРазмещенияЗаявки.ОбщееКоличествоЗапрашиваемыхКонтейнеров = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.ALL_CONTAINER_QUANT);
	ЗаписьРазмещенияЗаявки.ЕдиницаИзмеренияКоличестваКонтейнеров = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.CONTAINER_QUANT_UOM);
	ЗаписьРазмещенияЗаявки.КодТипаКонтейнеров = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.CONTAINER_MOT);
	ЗаписьРазмещенияЗаявки.ВесПродукции = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.WEIGHT);
	ЗаписьРазмещенияЗаявки.ЕдиницаИзмеренияВесаПродукции = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.WEIGHT_UOM);
	ЗаписьРазмещенияЗаявки.Комментарий = Комментарий;
	ЗаписьРазмещенияЗаявки.ИмяМенеджера = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TEND_MANAGER_DESCR);
	ЗаписьРазмещенияЗаявки.КонтактныйТелефонМенеджера = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TEND_MANAGER_TEL);
	ЗаписьРазмещенияЗаявки.АдресЭлектроннойПочтыМенеджера = ПолучитьЗначениеПоляОбъектаXDTO(ОбъектXDTO.TEND_MANAGER_MAIL);	
	ЗаписьРазмещенияЗаявки.Записать();
	
	ЗаписьСтатусаЗаявки = РегистрыСведений.СибурСтатусыЗаявок.СоздатьМенеджерЗаписи();
	ЗаписьСтатусаЗаявки.Период = ДатаРазмещенияЗаявки;
	ЗаписьСтатусаЗаявки.Заявка = ЗаявкаПорожних; 
	ЗаписьСтатусаЗаявки.СтатусЗаявки = СтатусЗаявки;
	ЗаписьСтатусаЗаявки.Записать();	
	
	//Ответ на запрос
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:RFQ", "RFQuot");
	Ответ.RFQ_ID = ОбъектXDTO.RFQ_ID;
	Ответ.EXT_RFQ_ID = НомерЗаявкиПорожних;
	Ответ.STATUS_DATE = ДатаРазмещенияЗаявки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПредложениеПоЗаявке(ОбъектXDTO) Экспорт
			
	RFQ_ID = ОбъектXDTO.RFQ_ID;	
	
	Выборка = ПолучитьРезультатЗапросаПоЗаявке(RFQ_ID).Выбрать();
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:RFQ", "RFQuotNotif");
	ДатаОтвета = ТекущаяДатаСеанса();	
	Если Выборка.Следующий() Тогда				
		
		//КоличествоКонтейнеров = Выборка.КоличествоКТК20 + Выборка.КоличествоКТК40 * 2;
		КоличествоКонтейнеров = Выборка.КоличествоКонтейнеров20 + Выборка.КоличествоКонтейнеров40 + Выборка.КоличествоКонтейнеров45;
				
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 11.05.2023
		// Было:
		//Ответ.RFQ_ID = Выборка.RFQ_ID; 
		//Стало:
		Ответ.RFQ_ID = RFQ_ID;
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 11.05.2023
		Ответ.EXT_RFQ_ID = Выборка.EXT_RFQ_ID;
		Ответ.RESP_STATUS_RFQ = Выборка.СтатусЗаявкиКод;
		Ответ.RESP_STATUS_RFQ_D = Выборка.СтатусЗаявкиНаименование;
		//Ответ.ETA_CONT = Выборка.НеобходимаяДатаПодачиПорожнегоСостава;
		Ответ.ETA_CONT = Выборка.ДатаПрибытияПорожнихКонтейнеров;
		//Евросиб Каблов 25.10.2021 ( Ticket#0243051
		//Ответ.ETA_SOURCE = Выборка.ПлановаяДатаОтправленияПорожнего;
		Если ЗначениеЗаполнено(Выборка.ФактическаяДатаОтправленияПорожнегоРейса) Тогда
			Ответ.ETA_SOURCE = Выборка.ФактическаяДатаОтправленияПорожнегоРейса;
		Иначе
			Ответ.ETA_SOURCE = Выборка.ПлановаяДатаОтправленияПорожнего;
		КонецЕсли;
		//Евросиб Каблов 25.10.2021 )
		
		//Экспедитор исполнитель
		Ответ.CARRIER_GU_ID = Выборка.ОрганизацияОКПО;	//Код ОКПО экспедитора-исполнителя
//Евросиб ( Литвинов 21.01.2021 #30025
		//Ответ.CARRIER_GU_ID_DESC = Выборка.ОрганизацияНаименование;	//Описание экспедитора-исполнителя
		Ответ.CARRIER_GU_ID_DESC = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		
		//Грузополучатель
		Ответ.CONSIGNEE_ID = Выборка.ГрузополучательОКПО;
		Ответ.CONSIGNEE_DESCR = Выборка.ГрузополучательНаименование;
		
		//Перевозчик по ЖД
		Ответ.RAILROAD_CARRIER_ID = "00083262";
		Ответ.RAILROAD_CARRIER_DESCR = "ОАО «РЖД»";
		
		//Плательщик по ЖД
		Ответ.PAYER_ID = Выборка.ОрганизацияОКПО;
//Евросиб ( Литвинов 21.01.2021 #30025
		//Ответ.PAYER_DESCR = Выборка.ОрганизацияНаименование;
		Ответ.PAYER_DESCR = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	//Ответ.CODE_PL = "1000410228"; //Код плательщика по ЖД 
		Ответ.CODE_PL = "1000082317";
		//Ответ.PODCODE_PL	//Подкод перевозки
		
		//Станция назначения
		Ответ.DEST_POINT = Выборка.КодСтанцииНазначенияГруженого;
		Ответ.DEST_POINT_D = Выборка.НазваниеСтанцииНазначенияГруженого;
		
		//Пункт перевалки.
		Ответ.TERM_LOC = Выборка.ПунктПеревалкиКод;	//Код ОКПО пункта перевалки
		Ответ.TERM_LOC_DESCR = Выборка.ПунктПеревалкиНаименование;	//Описание пункта перевалки 
		
		//Порт отправления.
		Ответ.POL = Выборка.ПортОтправленияКод;	//Код порта отправления
		Ответ.POL_DESCR = Выборка.ПортОтправленияНаименование;	//Описание  порта отправления
		
		//Количество контейнеров
		Ответ.CONTAINER_QUANT = КоличествоКонтейнеров;
		Ответ.CONTAINER_QUANT_UOM = "ШТ";		
		Ответ.CONTAINER_MOT = Выборка.ТипКонтейнера;
		
		ВладельцыКонтейнеров = ПолучитьВладельцевКонтейнеровЗаявки(Выборка.Заявка, Выборка.ДатаПрибытияПорожнихКонтейнеров);
		ВладельцыСтрокой = СтрСоединить(ВладельцыКонтейнеров, ";");
		Ответ.CONTAINER_OWNER_D = ВладельцыСтрокой;	//Принадлежность контейнеров
		
		//Количество платформ. Не заполнять
		//Ответ.PLATE_QUANT = ;
		//Ответ.PLATE_QUANT_UOM = ;
		Ответ.PLATE_MOT	= "80";
		Ответ.PLATE_OWNER_D	= "Evrosib";
		
		Ответ.COMMENT = Выборка.Комментарий;
		Ответ.REASON_V = Выборка.КодПричиныОтклоненияЗаявки;
		
		//Евросиб Каблов 16.12.2020 (
		//Выяснилось, что в этом поле они ожидают свой номер договора (который не передаётся де-факто) и передача нашего номера договора приводит к ошибкам в их системе. 
		//Скорее всего в перспективе разведут на два поля.
		//При ответе по заявке заполнять поле FAG_ID_DESR из таблицы размещенных заявок Сибур. Если они его передадут при размещении заявки, то и в ответе по заявке оно будет возвращено
		//Ответ.FAG_ID_DESR = Выборка.НомерДоговора;	//Регистрационный номер договора с ЛП
		Ответ.FAG_ID_DESR = Выборка.НомерДоговораУЗаказчика;	//Регистрационный номер договора с ЛП
		//Евросиб Каблов 16.12.2020 )
		
		//Конечная станция назначения при сухопутье
		Ответ.EXT_POINT = Выборка.КодКонечнойСтанцииНазначенияПриСухопутье;	//Код конечной станции назначения при сухопутье
		Ответ.EXT_POINT_D = Выборка.НазваниеКонечнойСтанцииНазначенияПриСухопутье;	//Описание конечной станции назначения при сухопутье
		
		//Притерминальная ж/д станция. Сток ктк. 
		Ответ.TERM_STOCK_LOC = Выборка.КодПритерминальнойЖДСтанции;
		Ответ.TERM_STOCK_LOC_D = Выборка.НазваниеПритерминальнойЖДСтанции;
		
		//Контактное лицо перевозчика
		Ответ.EXP_MANAGER_DESCR = Выборка.ИмяМенеджера;
		Ответ.EXP_MANAGER_TEL = Выборка.ТелефонМенеджера;		
		Ответ.EXP_MANAGER_MAIL = Выборка.АдресЭлПочтыМенеджера;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПодтвердитьЗаявку(ОбъектXDTO) Экспорт
	
	ИдентификаторЗаявки = ОбъектXDTO.RFQ_ID;
	КодСтатусаЗаявки = ОбъектXDTO.RESP_STATUS_RFQ;
	//Евросиб Каблов 25.10.2021 ( Ticket#0243051
	НомерПоездаКлиента = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "NUMBER_RW",, "");
	КомментарийКлиента = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, "COMMENT",, "");
	//Евросиб Каблов 25.10.2021 )
	
	Запрос = Новый Запрос;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023
	// Было:
	//Запрос.УстановитьПараметр("RFQ_ID", ИдентификаторЗаявки); 
	//Стало:
	RFQ_ID = "";
	НомерЛота = "";
	МассивСтрок = СтрРазделить(ИдентификаторЗаявки,"/");
	Если МассивСтрок.Количество() = 2 Тогда 
		RFQ_ID = МассивСтрок[0];
		НомерЛота = МассивСтрок[1];
	КонецЕсли;	
	Запрос.УстановитьПараметр("RFQ_ID", RFQ_ID);
	Запрос.УстановитьПараметр("НомерЛота", НомерЛота);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокЗаявка.Ссылка КАК Заявка,
	|	ДокЗаявка.ВнешнийНомер КАК RFQ_ID,
	|	ДокЗаявка.Номер КАК EXT_RFQ_ID,
	|	ЗаявкаПереченьРейсов.Рейс КАК Рейс,
	|	ЗаявкаПереченьРейсов.Рейс.НомерПоездаКлиента КАК РейсНомерПоездаКлиента
	|ПОМЕСТИТЬ ВТРазмещенныеЗаявки
	|ИЗ
	|	Документ.Заявка КАК ДокЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|		ПО ДокЗаявка.Ссылка = СибурРазмещенныеЗаявки.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ПО ДокЗаявка.Ссылка = ЗаявкаПереченьРейсов.Ссылка
	|			И (ЗаявкаПереченьРейсов.Рейс ССЫЛКА Справочник.РейсыЖД)
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.НомераЛотов КАК ЗаявкаНомераЛотов
	|		ПО (ДокЗаявка.Ссылка = ЗаявкаНомераЛотов.Ссылка)	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
	|ГДЕ
	|	ДокЗаявка.ВнешнийНомер = &RFQ_ID 
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023 
	|	И ЗаявкаНомераЛотов.НомерЛота = &НомерЛота
	|	И НЕ ДокЗаявка.ПометкаУдаления
    // ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазмещенныеЗаявки.Заявка КАК Заявка,
	|	ВТРазмещенныеЗаявки.RFQ_ID КАК RFQ_ID,
	|	ВТРазмещенныеЗаявки.EXT_RFQ_ID КАК EXT_RFQ_ID,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки КАК СтатусЗаявки,
	|	СибурСтатусыЗаявокСрезПоследних.Период КАК Период,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки.КодСтатуса КАК СтатусЗаявкиКод,
	|	ВТРазмещенныеЗаявки.Рейс КАК Рейс,
	|	ВТРазмещенныеЗаявки.РейсНомерПоездаКлиента КАК РейсНомерПоездаКлиента
	|ИЗ
	|	ВТРазмещенныеЗаявки КАК ВТРазмещенныеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СибурСтатусыЗаявок.СрезПоследних(
	|				,
	|				Заявка В
	|					(ВЫБРАТЬ
	|						ВТРазмещенныеЗаявки.Заявка КАК Заявка
	|					ИЗ
	|						ВТРазмещенныеЗаявки КАК ВТРазмещенныеЗаявки)) 
	|												КАК СибурСтатусыЗаявокСрезПоследних
	|		ПО ВТРазмещенныеЗаявки.Заявка = СибурСтатусыЗаявокСрезПоследних.Заявка";
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:RFQ", "RFQuotConfirm");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДатаСтатуса = ТекущаяДатаСеанса();
		СтатусЗаявки = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаЖД, КодСтатусаЗаявки);
		
		ЗаявкаОбъект = Выборка.Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.СтатусЗаявкиСибур = СтатусЗаявки; 
		//Евросиб Каблов 25.10.2021 ( Ticket#0243051
		ЗаявкаОбъект.КомментарийКлиента = КомментарийКлиента;		
		//Евросиб Каблов 25.10.2021 )
		//Установка дополнительных свойств для изменения Состояния заявки
		УстановитьДопСвойстваСостоянияЗаявки(ЗаявкаОбъект, СтатусЗаявки, ДатаСтатуса);		
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//Евросиб Каблов 25.10.2021 ( Ticket#0243051
		Если ЗначениеЗаполнено(Выборка.Рейс) И ЗначениеЗаполнено(НомерПоездаКлиента) И Выборка.РейсНомерПоездаКлиента <> НомерПоездаКлиента Тогда
			Рейс = Выборка.Рейс.ПолучитьОбъект();
			Рейс.НомерПоездаКлиента = НомерПоездаКлиента;
			Рейс.Записать();
		КонецЕсли;
		//Евросиб Каблов 25.10.2021 )
		
		//Уведомление ответственного по e-mail об изменении заявки
		ОтборУведомлений = Новый Структура;
		ОтборУведомлений.Вставить("Документ", ЗаявкаОбъект.Ссылка);
		ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
		Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений);
		
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023  аналогичная запись происходит в модуле объекта заявки. исключил дубли
		// Было:
		//Если ЗначениеЗаполнено(КодСтатусаЗаявки) И Выборка.СтатусЗаявкиКод <> КодСтатусаЗаявки Тогда						
		//	
		//	Запись = РегистрыСведений.СибурСтатусыЗаявок.СоздатьМенеджерЗаписи();
		//	Запись.Период = ДатаСтатуса;
		//	Запись.Заявка = Выборка.Заявка;
		//	Запись.СтатусЗаявки = СтатусЗаявки;
		//	Запись.Записать();
		//	
		//КонецЕсли;
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
				
		Ответ.RFQ_ID = Выборка.RFQ_ID;
		Ответ.EXT_RFQ_ID = Выборка.EXT_RFQ_ID;
		Ответ.STATUS_DATE = ДатаСтатуса;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции


Процедура УстановитьСостояниеЗаявкиСИБУР(ЗаявкаОбъект, ПараметрыСтатуса)
	
	//TODO//
	//ЗаявкаОбъект = Документы.Заявка.СоздатьДокумент();
	
	Если ЗаявкаОбъект.ДополнительныеСвойства.Свойство("ДобавляемыеСостояния") Тогда
		ДобавляемыеСостояния = ЗаявкаОбъект.ДополнительныеСвойства.ДобавляемыеСостояния;
	Иначе
		ДобавляемыеСостояния = Новый Массив;
		ЗаявкаОбъект.ДополнительныеСвойства.Вставить("ДобавляемыеСостояния", ДобавляемыеСостояния);
	КонецЕсли;
	
	Состояния = ЗаявкаОбъект.Состояния;
	СостояниеПроверкаИКонтроль = Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента;
	
	Для Каждого СтрокаСостояния Из ДобавляемыеСостояния Цикл
		Если СтрокаСостояния.Состояние = СостояниеПроверкаИКонтроль Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаСостояния = Новый Структура("Состояние, ПримечаниеЗадачаИсполнителю", СостояниеПроверкаИКонтроль, Истина);
	
	Статус = Неопределено;
	ПараметрыСтатуса.Свойство("Статус", Статус);
	Комментарий = Неопределено;
	ПараметрыСтатуса.Свойство("Комментарий", Комментарий);
	ТекстКомментария = СтрШаблон("СИБУР установил статус заявки: %1. Комментарий: %2", Статус, Комментарий);
	СтрокаСостояния.Вставить("Комментарий", ТекстКомментария);
	
	ДатаСтатуса = Неопределено;
	Если ПараметрыСтатуса.Свойство("ДатаСтатуса", ДатаСтатуса) И ЗначениеЗаполнено(ДатаСтатуса) Тогда
		СтрокаСостояния.Вставить("НачалоРаботы", ДатаСтатуса);
	Иначе
		СтрокаСостояния.Вставить("НачалоРаботы", ТекущаяДатаСеанса());
	КонецЕсли;
	ДобавляемыеСостояния.Добавить(СтрокаСостояния);
	
КонецПроцедуры

//4.2.1.	Инфообмен «Перечень контейнеров и платформ»

Функция ПолучитьДислокациюКонтейнеров(XMLRequest) Экспорт
	
	//ФорматДаты = "ДФ=yyyy-MM-ddTHH:mm:ss+03:00";
	ФорматДаты = "ДФ=yyyy-MM-ddTHH:mm:ss";
	//ТаблицаСтатусов = ПолучитьТаблицуДислокационныхСтатусов();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
		
	Если ОбъектXDTO.Свойства().Получить("CREATED_ON_START") <> Неопределено Или ОбъектXDTO.Свойства().Получить("CREATED_ON_END") <> Неопределено Тогда
		ДатаНачала = XMLЗначение(Тип("Дата"), ОбъектXDTO.CREATED_ON_START);
		//ДатаНачала = МестноеВремя(ДатаНачала); //Преобразование выполняется в вызывающем сервисе
		ДатаОкончания = XMLЗначение(Тип("Дата"), ОбъектXDTO.CREATED_ON_END);
		//ДатаОкончания = МестноеВремя(ДатаОкончания); //Преобразование выполняется в вызывающем сервисе
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("CONTAINER_ID") <> Неопределено Тогда
		ИдентификаторКонтейнера = ОбъектXDTO.CONTAINER_ID;
		Если ТипЗнч(ИдентификаторКонтейнера) <> Тип("Строка") Тогда
			ИдентификаторКонтейнера = "";
		КонецЕсли;
	Иначе
		ИдентификаторКонтейнера = "";
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуДислокационныхДанныхПоИдентификаторуКонтейнераЗаПериод(ДатаНачала, ДатаОкончания, ИдентификаторКонтейнера);
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	//Запись.ЗаписатьОбъявлениеXML();
	//
	Запись.ЗаписатьНачалоЭлемента("DislocationContData");
	//
	//ЕСОбменСервер.ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "urn:sibur:po:a:TM:Railway");
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			
			//Запись.ЗаписатьНачалоЭлемента("ROW");
			Запись.ЗаписатьНачалоЭлемента("ContPlat");
		
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "WAYBILL_INV_NUM", Выборка.НомерНакладной);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PARENT_KEY_WBINVNUM", ""); //Номер досылочной накладной, если имеется
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "INDEX_RW", Выборка.ИндексПоезда); //Индекс поезда
			
			НомерПоезда = "";
			Если ЗначениеЗаполнено(Выборка.ИндексПоезда) Тогда
				НомерПоезда = Сред(Выборка.ИндексПоезда, 7, 3);
			КонецЕсли;
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "NUMBER_RW", НомерПоезда);			//Номер поезда
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_ID", Выборка.КонтейнерНаименование);		
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_MOT", Выборка.РазмерКТК + "FT");		
			//ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_VAL", Выборка.МассыВКгТары); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_UOM", "КГ"); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "CAPACITY_MAX", ""); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "CAPACITY_MAX_UOM", ""); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "WEIGHT", ""); //Удалено из формата  //Максимально допустимый вес продукции. При выгрузке из Ритма пусто
			//ДобавитьЭлементВФайл(Запись, "WEIGHT_UOM", ""); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "NET_WEI_VAL", Выборка.МассыВКгНетто); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "NET_WEI_UOM", "КГ"); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "VOLUME", ""); 
			//ДобавитьЭлементВФайл(Запись, "VOLUME_UOM", ""); 
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_ID", Выборка.НомерВагона);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_MOT", Выборка.ВидЖДПлатформы);
			//ДобавитьЭлементВФайл(Запись, "PLATE_WEI_VAL", Выборка.МассаТарыВагона); //Удалено из формата
			//ДобавитьЭлементВФайл(Запись, "PLATE_WEI_UOM", "КГ"); //Удалено из формата
			
			//Евросиб Каблов 15.04.2022 ( Ticket#0268649
			////Евросиб Каблов 06.11.2020 ( Ticket#0213169		
			////ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", Выборка.СобственникКодПоОКПО);
			//БуквенныйКодКонтейнера = Лев(Выборка.КонтейнерНаименование, 4);
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", БуквенныйКодКонтейнера);
			////Евросиб Каблов 06.11.2020 )
			////ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", Выборка.СобственникНаименование); 
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", Выборка.СобственникНаименованиеПолноеАнгл);
			////Евросиб Каблов )
			
			Если ЗначениеЗаполнено(Выборка.КодСобственника) Тогда
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", Выборка.КодСобственника);
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", Выборка.СобственникНаименование);
			Иначе
				БуквенныйКодКонтейнера = Лев(Выборка.КонтейнерНаименование, 4);
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", БуквенныйКодКонтейнера);
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", "");
			КонецЕсли;			
			//Евросиб Каблов 15.04.2022 )
			
			//Евросиб Каблов 06.11.2020 ( Ticket#0213169
			//Если ЗначениеЗаполнено(Выборка.ВагонАрендатор) Тогда
			//	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", Выборка.ВагонАрендаторКодПоОКПО);
			//	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", Выборка.ВагонАрендаторНаименование);
			//Евросиб Каблов 06.11.2020 )
			Если ЗначениеЗаполнено(Выборка.ВагонСобственник) Тогда
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", Выборка.ВагонСобственникКодПоОКПО);
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", Выборка.ВагонСобственникНаименование);
			Иначе
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", "");
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", "");
			КонецЕсли;
			
			
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CARRIER_ID", ); //Удалено из формата
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CARRIER_DESCR", ); //Удалено из формата
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SHIPPER_ID", Выборка.ГрузоотправительКодПоОКПО);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SHIPPER_DESCR", Выборка.ГрузоотправительНаименование);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONSIGNEE_ID", Выборка.ГрузополучательКодПоОКПО);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONSIGNEE_DESCR", Выборка.ГрузополучательНаименование);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SOURCE_LOC", Выборка.СтанцияОтправленияКод);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SOURCE_LOC_DESC", Выборка.НаименованиеСтанцииОтправления);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DEST_LOC", Выборка.СтанцияНазначенияКодЖДСтанции);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DEST_LOC_DESC", Выборка.СтанцияНазначенияНаименование);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CURRENT_LOC", Выборка.СтанцияОперацииКодЖДСтанции);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CURRENT_LOC_DESC", Выборка.СтанцияОперацииНаименование);
			//ДобавитьЭлементВФайл(Запись, "RFQ_ETA", Формат(Выборка.ДатаИВремяПрибытияГруза, ФорматДаты)); //Удалено из формата // новая
			//Евросиб Каблов 11.11.2020 ( Ticket#0213713
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "RFQ_ID", Выборка.ЗаявкаИдентификаторСибур); //новая Идентификатор заявки SAP TM - новая
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "REF_RFQ", Выборка.ЗаявкаВнешнийНомер);  //CHAR 20	Внешний номер заявки
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "RFQ_ID", Выборка.ЗаявкаВнешнийНомер);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "REF_RFQ", Выборка.ЗаявкаНомер);
			//Евросиб Каблов 11.11.2020 )
			//ДобавитьЭлементВФайл(Запись, "NEXT_LOCT", Выборка.СтанцияНазначенияКодЖДСтанции); //Удалено из формата//Станция назначения. Информация по исполнению перевозки в рамках конкретной заявки

			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETD", Формат(Выборка.ДатаИВремяОтправленияГруза, ФорматДаты));
			//Евросиб Каблов 12.11.2020 (
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИВремяРаскредитованияГруза, ФорматДаты));			
			Если ЗначениеЗаполнено(Выборка.ДатаИВремяРаскредитованияГруза) Тогда
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИВремяРаскредитованияГруза, ФорматДаты));
			Иначе
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИстеченияСрокаДоставки, ФорматДаты));
			КонецЕсли;
			//Евросиб Каблов 12.11.2020 )
			
			//Вместо справочника Сибур, используются наши статусы
			//Статус = ПолучитьДислокационныйСтатус(ТаблицаСтатусов, Выборка.ОперацияСВагономКод);		
			//ДобавитьЭлементВФайл(Запись, "STATUS", Статус.STATUS);
			//ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Статус.STATUS_DESC);
			
			//Евросиб Каблов 03.12.2020 ( Ticket#0215903
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS", Выборка.ОперацияСВагономКод);
			КодБезЛидирующихНулей = Строка(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.ОперацияСВагономКод));		
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS", КодБезЛидирующихНулей);
			//Евросиб Каблов 03.12.2020 )
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Выборка.ОперацияСВагономНаименование);
			
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(Выборка.Период, ФорматДаты)); //Фактическая дата наступления события - Новая
			
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SPEC", "");
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SPEC_DESCR", "");
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "COMMENT", "");
			//Евросиб Каблов 07.12.2020 ( Ticket#0216107
			//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(Выборка.Период, ФорматДаты));
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(Выборка.ДатаЗаписиДислокации, ФорматДаты));
			//Евросиб Каблов 07.12.2020 )
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01");
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Успешно");
			
			Запись.ЗаписатьКонецЭлемента(); //ContPlat
			
		КонецЦикла;
		
	Иначе //Нет записей
		
		Дата1900 = '19000101';
		ТекДата = ТекущаяДата();		
		
		Запись.ЗаписатьНачалоЭлемента("ContPlat");
		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "WAYBILL_INV_NUM", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PARENT_KEY_WBINVNUM", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "INDEX_RW", "");		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "NUMBER_RW", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_ID", "");		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_MOT", "");		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_MOT", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SHIPPER_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SHIPPER_DESCR", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONSIGNEE_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CONSIGNEE_DESCR", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SOURCE_LOC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SOURCE_LOC_DESC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DEST_LOC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DEST_LOC_DESC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CURRENT_LOC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CURRENT_LOC_DESC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "RFQ_ID", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "REF_RFQ", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETD", Формат(Дата1900, ФорматДаты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ETA", Формат(Дата1900, ФорматДаты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_DESC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(ТекДата, ФорматДаты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SPEC", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SPEC_DESCR", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "COMMENT", "");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(ТекДата, ФорматДаты));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "02");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Не успешно");
		
		Запись.ЗаписатьКонецЭлемента(); //ContPlat
		
	КонецЕсли;
	
	Запись.ЗаписатьКонецЭлемента(); //DislocationContData
			
	Возврат Запись.Закрыть();
	
КонецФункции

//3. Букинги

Функция БронированиеМестНаСудне(ДанныеПоБукингу) Экспорт
	
	//Заглушка
	//Процедура на стадии тестирования. Может выполняться только на тестовых базах.
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаРазмещения = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.CHANGED_ON, Тип("Дата"));
	ИДБукинга = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.TOR_ID);
	НомерБукинга = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "REF_BOOKING_ID",, "0");
	КодМорскойЛинии = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.CARRIER_ID);
	Комментарий = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "COMMENT",, "");
	
	ПустаяДата = '00010101';
	ПлановаяДатаПрибытияВПортОтправления = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "ETA_TO_POL", Тип("Дата"), ПустаяДата);
	ПлановаяДатаОтправленияНачало = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "ETD_START", Тип("Дата"), ПустаяДата);
	ПлановаяДатаОтправленияОкончание = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "ETD_END", Тип("Дата"), ПустаяДата);
	ПлановаяДатаПрибытияВПортНазначенияНачало = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "ETA_TO_POD_I", Тип("Дата"), ПустаяДата);
	ПлановаяДатаПрибытияВПортНазначенияОкончание = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "ETA_TO_POD_O", Тип("Дата"), ПустаяДата);
	
	КодСтатусаЗаявки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "FB_STATUS",, "");
	СтатусЗаявки = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаБукинг, КодСтатусаЗаявки);
		
	//Получение соответствия локаций кодам портов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.КодПортаUNLOCODE КАК КодПортаUNLOCODE,
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.КодПортаUNLOCODE В(&Коды)";
	
	КодыПортов = Новый Массив;
	
	КодПортаОтправления = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.POL);
	Если ЗначениеЗаполнено(КодПортаОтправления) Тогда
		КодыПортов.Добавить(КодПортаОтправления);
	КонецЕсли;
	
	КодПортаНазначения = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.POD);
	Если ЗначениеЗаполнено(КодПортаНазначения) Тогда
		КодыПортов.Добавить(КодПортаНазначения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Коды", КодыПортов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПортыПоКодам = Новый Соответствие;
	Если Выборка.Следующий() Тогда
		ПортыПоКодам.Вставить(Выборка.КодПортаUNLOCODE, Выборка.Ссылка);
	КонецЕсли;
	
	//Получение рейса
	Линия = Справочники.МорскиеЛинии.НайтиПоРеквизиту("КодСибур", КодМорскойЛинии);
	НазваниеСудна = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "VESSEL_NUM",, "");
	НомерРейса = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "VOYAGE",, "");
	//Евросиб Каблов 30.01.2021 (	
	//Рейс = ПолучитьМорскойРейс(НомерРейса, НазваниеСудна, Линия);
	Судно = ПолучитьСудно(НазваниеСудна);
	Рейс = ПолучитьМорскойРейс(НомерРейса, Судно, Линия);	
	//Евросиб Каблов 30.01.2021 ) 
	
	//Получение букинга
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Букинг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Букинг КАК Букинг
	|ГДЕ
	|	Букинг.ИДБукинга = &ИдентификаторБукинга";	
	Запрос.УстановитьПараметр("ИдентификаторБукинга", ИДБукинга);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		БукингОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		БукингОбъект = Документы.Букинг.СоздатьДокумент();
		БукингОбъект.Заполнить(Неопределено);
		БукингОбъект.ИДБукинга = ИДБукинга;
		БукингОбъект.Дата = ДатаРазмещения;
		БукингОбъект.НомерБукинга = НомерБукинга;
		//++ Зубов 0228547 20.09.2021
		БукингОбъект.Контрагент = Константы.СибурКонтрагент.Получить();
		//-- Зубов 0228547 20.09.2021
	КонецЕсли;
		
	БукингОбъект.СтатусЗаявки = СтатусЗаявки;	
	БукингОбъект.КоличествоЗапрошенныхКонтейнеров = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.QUANT, Тип("Число"));
	БукингОбъект.Линия = Линия;
	БукингОбъект.ПортОтправления = ПортыПоКодам.Получить(КодПортаНазначения);
	БукингОбъект.ПортНазначения = ПортыПоКодам.Получить(КодПортаОтправления);
	БукингОбъект.ПлановаяДатаПрибытияВПортОтправления = ПлановаяДатаПрибытияВПортОтправления;
	БукингОбъект.ПлановаяДатаОтправленияНачало = ПлановаяДатаОтправленияНачало;
	БукингОбъект.ПлановаяДатаОтправленияОкончание = ПлановаяДатаОтправленияОкончание;
	БукингОбъект.ПлановаяДатаПрибытияВПортНазначенияНачало = ПлановаяДатаПрибытияВПортНазначенияНачало;
	БукингОбъект.ПлановаяДатаПрибытияВПортНазначенияОкончание = ПлановаяДатаПрибытияВПортНазначенияОкончание;
	БукингОбъект.Рейс = Рейс;
	БукингОбъект.Грузоотправитель = ПолучитьКонтрагентаСибур();
	БукингОбъект.Комментарий = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.COMMENT);
	
	ТаблицаКонтейнеров = ПолучитьТаблицуКонтейнеровБукинга(ДанныеПоБукингу.ITEM);
	БукингОбъект.Контейнеры.Загрузить(ТаблицаКонтейнеров);
	
	//Установка дополнительных свойств для изменения Состояния заявки
	УстановитьДопСвойстваСостоянияЗаявки(БукингОбъект, СтатусЗаявки, ДатаРазмещения, Комментарий);
	
	БукингОбъект.Записать(РежимЗаписиДокумента.Запись);
	БукингСсылка = БукингОбъект.Ссылка;
	
	//Уведомление ответственного по e-mail об изменении заявки
	ОтборУведомлений = Новый Структура;
	ОтборУведомлений.Вставить("Документ", БукингСсылка);
	ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
	Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений);
	
	ИДБукингаУПеревозчика = Строка(БукингСсылка.УникальныйИдентификатор());
	
	//Запись данных о размещенном букинге
	ЗаписьБукинга = РегистрыСведений.СибурРазмещенныеБукинги.СоздатьМенеджерЗаписи();
	ЗаписьБукинга.Букинг = БукингСсылка;
	ЗаписьБукинга.ИдентификаторБукинга = ИДБукинга;
	//ЗаписьБукинга.ИдентификаторЗаявкиУПеревозчика = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоБукингу.EXT_TOR_ID);
	ЗаписьБукинга.НомерБукинга = НомерБукинга;
	ЗаписьБукинга.КоличествоКонтейнеровПоЗаявкеНаБукинг = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "QUANT", Тип("Число"), 0);
	ЗаписьБукинга.МорскаяЛиния = КодМорскойЛинии;
	ЗаписьБукинга.ОписаниеМорскойЛинии = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "CARRIER_ID_DESC",, "");
	ЗаписьБукинга.ПортОтправления = КодПортаОтправления;
	ЗаписьБукинга.ОписаниеПортаОтправления = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "POL_DESCR",, "");
	ЗаписьБукинга.ПортНазначения = КодПортаНазначения;
	ЗаписьБукинга.ОписаниеПортаНазначения = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "POD_DESCR",, "");
	ЗаписьБукинга.ПлановаяДатаПрибытияВПортОтправления = ПлановаяДатаПрибытияВПортОтправления;
	ЗаписьБукинга.ПлановаяДатаОтправленияНачало = ПлановаяДатаОтправленияНачало;
	ЗаписьБукинга.ПлановаяДатаОтправленияОкончание = ПлановаяДатаОтправленияОкончание;
	ЗаписьБукинга.ПлановаяДатаПрибытияВПортНазначенияНачало = ПлановаяДатаПрибытияВПортНазначенияНачало;
	ЗаписьБукинга.ПлановаяДатаПрибытияВПортНазначенияОкончание = ПлановаяДатаПрибытияВПортНазначенияОкончание;
	ЗаписьБукинга.НазваниеСудна = НазваниеСудна;
	ЗаписьБукинга.НомерРейса = НомерРейса;
	ЗаписьБукинга.НаименованиеГрузоотправителя = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "SHIPPER_DESCR",, "");
	ЗаписьБукинга.КонтактноеЛицо = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "TEND_MANAGER_DESCR",, "");
	ЗаписьБукинга.КонтактныйТелефон = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "TEND_MANAGER_TEL",, "");
	ЗаписьБукинга.ЭлектроннаяПочта = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоБукингу, "TEND_MANAGER_MAIL",, "");
	ЗаписьБукинга.Комментарий = Комментарий;
	ЗаписьБукинга.Записать();
	
	//Запись данных о статусе букинга
	ЗаписьСтатусаБукинга = РегистрыСведений.СибурСтатусыБукингов.СоздатьМенеджерЗаписи();
	ЗаписьСтатусаБукинга.Период = ДатаРазмещения;
	ЗаписьСтатусаБукинга.Букинг = БукингСсылка;
	ЗаписьСтатусаБукинга.СтатусЗаявкиНаБукинг = СтатусЗаявки;
	ЗаписьСтатусаБукинга.Записать();
	
	//Формирование ответа на запрос
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:Bookings", "Booking");
	Ответ.TOR_ID = ИДБукинга;
	Ответ.REF_BOOKING_ID = НомерБукинга;
	Ответ.EXT_TOR_ID = ИДБукингаУПеревозчика;
	Ответ.STATUS_DATE = ДатаРазмещения;
	
	Возврат Ответ;
	
КонецФункции

Функция ПодтверждениеБронированияМестНаСудне(ДанныеЗапроса) Экспорт
	
	//Заглушка
	//Процедура на стадии тестирования. Может выполняться только на тестовых базах.
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаПодтверждения = ТекущаяДатаСеанса();
	
	ИДБукинга = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеЗапроса.TOR_ID);
	НомерБукинга = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "REF_BOOKING_ID",, "");
	ИДБукингаУПеревозчика = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "EXT_TOR_ID",, "");
	КодСтатусаСогласования = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеЗапроса.FB_STATUS);
	ОписаниеСтатусаСогласования = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "FB_STATUS_DESCR",, "");
	СтатусЗаявки = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаБукинг, КодСтатусаСогласования);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументБукинг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Букинг КАК ДокументБукинг
		|ГДЕ
		|	ДокументБукинг.ИДБукинга = &ИДБукинга";	
	Запрос.УстановитьПараметр("ИДБукинга", ИДБукинга);	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		БукингСсылка = Выборка.Ссылка;
		БукингОбъект = БукингСсылка.ПолучитьОбъект();
		БукингОбъект.СтатусЗаявки = СтатусЗаявки;
		
		//Установка дополнительных свойств для изменения Состояния заявки
		УстановитьДопСвойстваСостоянияЗаявки(БукингОбъект, СтатусЗаявки, ДатаПодтверждения);
		
		БукингОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		//Уведомление ответственного по e-mail об изменении заявки
		ОтборУведомлений = Новый Структура;
		ОтборУведомлений.Вставить("Документ", БукингСсылка);
		ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
		Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений);
		
		ЗаписьСтатуса = РегистрыСведений.СибурСтатусыБукингов.СоздатьМенеджерЗаписи();
		ЗаписьСтатуса.Период = ДатаПодтверждения;
		ЗаписьСтатуса.Букинг = Выборка.Ссылка;
		ЗаписьСтатуса.СтатусЗаявкиНаБукинг = СтатусЗаявки;
		ЗаписьСтатуса.Записать();
		
		ИДБукингаУПеревозчика = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		
	КонецЕсли;	
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:Bookings", "BookingConfirm");
	Ответ.TOR_ID = ИДБукинга;
	Ответ.REF_BOOKING_ID = НомерБукинга;
	Ответ.EXT_TOR_ID = ИДБукингаУПеревозчика;
	Ответ.STATUS_DATE = ДатаПодтверждения;
	
	Возврат Ответ;
	
КонецФункции

Функция УведомлениеОБронированииМестНаСудне(ДанныеЗапроса) Экспорт
	
	//Заглушка
	//Процедура на стадии тестирования. Может выполняться только на тестовых базах.
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаУведомления = ТекущаяДатаСеанса();
	
	ИДБукинга = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеЗапроса.TOR_ID);
	НомерБукинга = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "REF_BOOKING_ID",, "");
	ИДБукингаУПеревозчика = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "EXT_TOR_ID",, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Букинг.Ссылка КАК Ссылка,
	|	Букинг.Редактор КАК Редактор,
	|	Букинг.Линия КАК Линия,
	|	ЕСТЬNULL(Букинг.Линия.КодСибур, """") КАК ЛинияКодСибур,
	|	ЕСТЬNULL(Букинг.Линия.Наименование, """") КАК ЛинияНаименование,
	|	Букинг.ДедлайнСогласованияБукингаГрузоотправителем КАК ДедлайнСогласованияБукингаГрузоотправителем,
	|	Букинг.ДатаЗакрытияСудна КАК ДатаЗакрытияСудна,
	|	Букинг.ДатаОтправленияПоРасписанию КАК ДатаОтправленияПоРасписанию,
	|	Букинг.ДатаПрибытияПоРасписанию КАК ДатаПрибытияПоРасписанию,
	|	Букинг.КоличествоПодтвержденныхКонтейнеров КАК КоличествоПодтвержденныхКонтейнеров,
	|	Букинг.НомерБукинга КАК НомерБукинга,
	|	ЕСТЬNULL(Букинг.ПортТрансшипмента.КодПортаUNLOCODE, """") КАК ПортТрансшипментаКод,
	|	ЕСТЬNULL(Букинг.ПортТрансшипмента.Наименование, """") КАК ПортТрансшипментаНаименование,
	|	Букинг.ПлановаяДатаПрибытияВПортТрансшипмента КАК ПлановаяДатаПрибытияВПортТрансшипмента,
	|	Букинг.ПлановаяДатаОтправленияИзПортаТрансшипмента КАК ПлановаяДатаОтправленияИзПортаТрансшипмента
	|ПОМЕСТИТЬ ВТБукинг
	|ИЗ
	|	Документ.Букинг КАК Букинг
	|ГДЕ
	|	Букинг.ИДБукинга = &ИДБукинга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБукинг.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(Пользователи.Наименование, """") КАК ИмяМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК ТелефонМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияАдресЭлПочты.Представление, """") КАК АдресЭлПочтыМенеджера
	|ПОМЕСТИТЬ ВТКонтактыМенеджера
	|ИЗ
	|	ВТБукинг КАК ВТБукинг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|			ПО Пользователи.Ссылка = КонтактнаяИнформацияТелефон.Ссылка
	|				И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЭлПочты
	|			ПО Пользователи.Ссылка = КонтактнаяИнформацияАдресЭлПочты.Ссылка
	|				И (КонтактнаяИнформацияАдресЭлПочты.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ПО ВТБукинг.Редактор = Пользователи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБукинг.Ссылка КАК Букинг,
	|	СибурСтатусыБукинговСрезПоследних.СтатусЗаявкиНаБукинг КАК СтатусЗаявкиНаБукинг,
	|	ЕСТЬNULL(СибурСтатусыБукинговСрезПоследних.СтатусЗаявкиНаБукинг.КодСтатуса, """") КАК СтатусЗаявкиНаБукингКод,
	|	ЕСТЬNULL(СибурСтатусыБукинговСрезПоследних.СтатусЗаявкиНаБукинг.Наименование, """") КАК СтатусЗаявкиНаБукингНаименование,
	|	СибурСтатусыБукинговСрезПоследних.ПричинаОтклоненияЗаявки КАК ПричинаОтклоненияЗаявки,
	|	СибурСтатусыБукинговСрезПоследних.ПричинаОтклоненияЗаявки.Код КАК ПричинаОтклоненияЗаявкиКод,
	|	СибурСтатусыБукинговСрезПоследних.ПричинаОтклоненияЗаявки.Наименование КАК ПричинаОтклоненияЗаявкиНаименование,
	|	ВТБукинг.НомерБукинга КАК НомерБукинга,
	|	ВТБукинг.Линия КАК Линия,
	|	ВТБукинг.ЛинияКодСибур КАК ЛинияКодСибур,
	|	ВТБукинг.ЛинияНаименование КАК ЛинияНаименование,
	|	СибурРазмещенныеБукинги.НазваниеСудна КАК НазваниеСудна,
	|	СибурРазмещенныеБукинги.НомерРейса КАК НомерРейса,
	|	ВТБукинг.ДедлайнСогласованияБукингаГрузоотправителем КАК ДедлайнСогласованияБукингаГрузоотправителем,
	|	ВТБукинг.ДатаЗакрытияСудна КАК ДатаЗакрытияСудна,
	|	ВТБукинг.ДатаОтправленияПоРасписанию КАК ДатаОтправленияПоРасписанию,
	|	ВТБукинг.ДатаПрибытияПоРасписанию КАК ДатаПрибытияПоРасписанию,
	|	ВТБукинг.КоличествоПодтвержденныхКонтейнеров КАК КоличествоПодтвержденныхКонтейнеров,
	|	ВТБукинг.ПортТрансшипментаКод КАК ПортТрансшипментаКод,
	|	ВТБукинг.ПортТрансшипментаНаименование КАК ПортТрансшипментаНаименование,
	|	ВТБукинг.ПлановаяДатаПрибытияВПортТрансшипмента КАК ПлановаяДатаПрибытияВПортТрансшипмента,
	|	ВТБукинг.ПлановаяДатаОтправленияИзПортаТрансшипмента КАК ПлановаяДатаОтправленияИзПортаТрансшипмента,
	|	ВТКонтактыМенеджера.ИмяМенеджера КАК ИмяМенеджера,
	|	ВТКонтактыМенеджера.ТелефонМенеджера КАК ТелефонМенеджера,
	|	ВТКонтактыМенеджера.АдресЭлПочтыМенеджера КАК АдресЭлПочтыМенеджера
	|ИЗ
	|	ВТБукинг КАК ВТБукинг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурСтатусыБукингов.СрезПоследних(
	|				,
	|				Букинг В
	|					(ВЫБРАТЬ
	|						ВТБукинг.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТБукинг КАК ВТБукинг)) КАК СибурСтатусыБукинговСрезПоследних
	|		ПО ВТБукинг.Ссылка = СибурСтатусыБукинговСрезПоследних.Букинг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеБукинги КАК СибурРазмещенныеБукинги
	|		ПО ВТБукинг.Ссылка = СибурРазмещенныеБукинги.Букинг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтактыМенеджера КАК ВТКонтактыМенеджера
	|		ПО ВТБукинг.Ссылка = ВТКонтактыМенеджера.Ссылка";
	Запрос.УстановитьПараметр("ИДБукинга", ИДБукинга);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:Bookings", "BookingNotify");
	
	Если Выборка.Следующий() Тогда
		
		НомерБукинга = Выборка.НомерБукинга;
		ИДБукингаУПеревозчика = Строка(Выборка.Букинг.УникальныйИдентификатор());
		
		Ответ.FB_STATUS = Выборка.СтатусЗаявкиНаБукингКод;
		Ответ.FB_STATUS_DESCR = Выборка.СтатусЗаявкиНаБукингНаименование;
		Ответ.QUANT = Выборка.КоличествоПодтвержденныхКонтейнеров;
		Ответ.CARRIER_ID = Выборка.ЛинияКодСибур;
		Ответ.CARRIER_ID_DESC = Выборка.ЛинияНаименование;
		Ответ.VESSEL_NUM = Выборка.НазваниеСудна;
		Ответ.VOY_NUM = Выборка.НомерРейса;
		Ответ.DEADLINE_BOOK = Выборка.ДедлайнСогласованияБукингаГрузоотправителем;
		Ответ.VESSEL_CUTOFF = Выборка.ДатаЗакрытияСудна;
		Ответ.ETD = Выборка.ДатаОтправленияПоРасписанию;
		Ответ.ETA = Выборка.ДатаПрибытияПоРасписанию;
		
		Ответ.POT = Выборка.ПортТрансшипментаКод;
		Ответ.POT_DESCR = Выборка.ПортТрансшипментаНаименование;
		Ответ.ETA_TR = Выборка.ПлановаяДатаПрибытияВПортТрансшипмента;
		Ответ.ETD_TR = Выборка.ПлановаяДатаОтправленияИзПортаТрансшипмента;
		
		//Контактное лицо перевозчика
		Ответ.EXP_MANAGER_DESCR = Выборка.ИмяМенеджера;
		Ответ.EXP_MANAGER_TEL = Выборка.ТелефонМенеджера;		
		Ответ.EXP_MANAGER_MAIL = Выборка.АдресЭлПочтыМенеджера;
		
	КонецЕсли;
	
	Ответ.TOR_ID = ИДБукинга;
	Ответ.REF_BOOKING_ID = НомерБукинга;
	Ответ.EXT_TOR_ID = ИДБукингаУПеревозчика;
	Ответ.STATUS_DATE = ДатаУведомления;
	
	Возврат Ответ;
	
КонецФункции

//Коносаменты

Функция ЗаписатьИнструкцию(ДанныеЗапроса) Экспорт
	
	//Заглушка
	//Процедура на стадии тестирования. Может выполняться только на тестовых базах.
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаПолученияИнструкции = ТекущаяДатаСеанса();
	
	ДанныеИнструкции = Новый Структура;
	ДанныеИнструкции.Вставить("ДатаОтправкиИнструкции", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "INSTR_DATE", Тип("Дата")));
	ДанныеИнструкции.Вставить("ИдентификаторБукинга", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "TOR_ID"));
	ДанныеИнструкции.Вставить("НомерБукинга", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "REF_BOOKING_ID",, "0"));
	ДанныеИнструкции.Вставить("ИдентификаторУПеревозчика", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "EXT_TOR_ID"));
	ДанныеИнструкции.Вставить("НомерКоносамента", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "BL_NUMBER",, "0"));
	ДанныеИнструкции.Вставить("УсловияПоставки", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "DELIVERY_TERM"));
	ДанныеИнструкции.Вставить("СпособВыпуска", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "TYPE_OF_ISSUE"));
	ДанныеИнструкции.Вставить("НаименованиеМестаФормированияКоносамента", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CREATED_PLACE_DESCR"));
	ДанныеИнструкции.Вставить("КоличествоВыпускаемыхКоносаментов", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NUMBER_BILL_OF_LADING"));
	ДанныеИнструкции.Вставить("КоличествоКопийКоносаментов", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "COUNT_BL"));
	ДанныеИнструкции.Вставить("ОписаниеМестаОтправления", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "POL_DESCR"));
	ДанныеИнструкции.Вставить("МестоПолученияГруза", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "PLACE_OF_RECEIPT"));
	ДанныеИнструкции.Вставить("ОписаниеМестаНазначения", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "POD_DESCR"));
	ДанныеИнструкции.Вставить("МестоПоставкиГруза", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "PLACE_OF_DELIEVERY"));
	ДанныеИнструкции.Вставить("НаименованиеСудна", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "VESSEL_NUM"));
	ДанныеИнструкции.Вставить("НомерРейса", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "VOY_NUM"));
	ДанныеИнструкции.Вставить("МорскаяЛиния", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CARRIER_ID"));
	ДанныеИнструкции.Вставить("ОписаниеМорскойЛинии", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CARRIER_DESCR"));
	ДанныеИнструкции.Вставить("НаименованиеГрузоотправителя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "SHIPPER_DESCR"));
	ДанныеИнструкции.Вставить("НаименованиеГрузополучателя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CONSIGNEE_DESCR"));
	ДанныеИнструкции.Вставить("РегНомерГрузополучателя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CONSIGNEE_REG_NUMBER"));
	ДанныеИнструкции.Вставить("ЭлектроннаяПочтаГрузополучателя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CONSIGNEE_EMAIL"));
	ДанныеИнструкции.Вставить("ТелефонГрузополучателя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CONSIGNEE_TEL"));
	ДанныеИнструкции.Вставить("АдресГрузополучателя", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "CONSIGNEE_ADDRESS"));
	ДанныеИнструкции.Вставить("УведомлениеНаименование", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NOTIFY_DESCR"));
	ДанныеИнструкции.Вставить("УведомлениеРегистрационныйНомер", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NOTIFY_REG"));
	ДанныеИнструкции.Вставить("УведомлениеЭлектроннаяПочта", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NOTIFY_EMAIL"));
	ДанныеИнструкции.Вставить("УведомлениеТелефон", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NOTIFY_PHONE"));
	ДанныеИнструкции.Вставить("УведомлениеАдрес", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "NOTIFY_ADDRESS"));
	ДанныеИнструкции.Вставить("Комментарий", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "COMMENT"));
	ДанныеИнструкции.Вставить("ПрисоединенныйФайл", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "ADD_FILE"));
	ДанныеИнструкции.Вставить("Описание", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "DESCRIPTION"));
	
	ТаблицаКонтейнеров = ПолучитьТаблицуКонтейнеровКоносамента(ДанныеЗапроса.ITEM);
	
	//Поиск Букинга и Коносамента (транспортного документа)
	Запрос = Новый Запрос;
	//Евросиб Каблов 24.11.2020 ( Ticket#0215031 
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ДокБукинг.Ссылка КАК Букинг,
	//|	ТранспортныйДокумент.Ссылка КАК Коносамент
	//|ИЗ
	//|	Документ.Букинг КАК ДокБукинг
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	//|		ПО ДокБукинг.Ссылка = ТранспортныйДокумент.Букинг
	//|ГДЕ
	//|	ДокБукинг.ИДБукинга = &ИдентификаторБукинга";
	//Запрос.УстановитьПараметр("ИдентификаторБукинга", ДанныеИнструкции.ИдентификаторБукинга);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК Коносамент,
	|	ДокБукинг.Ссылка КАК Букинг
	|ИЗ
	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Букинг КАК ДокБукинг
	|		ПО ТранспортныйДокумент.НомерБукинга = ДокБукинг.НомерБукинга
	|ГДЕ
	|	ТранспортныйДокумент.НомерБукинга = &НомерБукинга
	|	И ДокБукинг.НомерБукинга = &НомерБукинга";
	Запрос.УстановитьПараметр("НомерБукинга", ДанныеИнструкции.НомерБукинга);
	//Евросиб Каблов 24.11.2020 )
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Букинг = Выборка.Букинг;
		Коносамент = Выборка.Коносамент;		
	Иначе
		Букинг = Неопределено;
		Коносамент = Неопределено;
	КонецЕсли;
	
	//Заполнение коносамента (транспортного документа)
	Если ЗначениеЗаполнено(Коносамент) Тогда
		КоносаментОбъект = Коносамент.ПолучитьОбъект();
	Иначе
		КоносаментОбъект = Документы.ТранспортныйДокумент.СоздатьДокумент();
		КоносаментОбъект.Заполнить(Неопределено);
		КоносаментОбъект.Контрагент = Константы.СибурКонтрагент.Получить();
		КоносаментОбъект.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент;
		КоносаментОбъект.Дата = ДанныеИнструкции.ДатаОтправкиИнструкции;
		КоносаментОбъект.НомерТранспортногоДокумента = ДанныеИнструкции.НомерКоносамента;		
	КонецЕсли;
	
	КоносаментОбъект.Коносаменты.Загрузить(ТаблицаКонтейнеров);
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.НомерБукинга) Тогда
		КоносаментОбъект.НомерБукинга = ДанныеИнструкции.НомерБукинга;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.Букинг) Тогда
		КоносаментОбъект.Букинг = Букинг;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.УсловияПеревозкиПоПортам) Тогда
		Попытка
			УсловияПеревозкиПоПортам = Перечисления.УсловияПеревозкиПоПортам[ДанныеИнструкции.УсловияПоставки];
		Исключение
			УсловияПеревозкиПоПортам = Неопределено;
		КонецПопытки;
		КоносаментОбъект.УсловияПеревозкиПоПортам = УсловияПеревозкиПоПортам;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.СпособВыпуска) Тогда
		КоносаментОбъект.СпособВыпуска = ДанныеИнструкции.СпособВыпуска;
	КонецЕсли;
	
	//Локации
	Локации = Новый Соответствие;
	НаименованияЛокаций = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.НаименованиеМестаФормированияКоносамента) Тогда
		НаименованияЛокаций.Добавить(ДанныеИнструкции.НаименованиеМестаФормированияКоносамента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.ОписаниеМестаОтправления) Тогда
		НаименованияЛокаций.Добавить(ДанныеИнструкции.ОписаниеМестаОтправления);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.ОписаниеМестаНазначения)Тогда
		НаименованияЛокаций.Добавить(ДанныеИнструкции.ОписаниеМестаНазначения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.МестоПолученияГруза) Тогда
		НаименованияЛокаций.Добавить(ДанныеИнструкции.МестоПолученияГруза);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.МестоПоставкиГруза) Тогда
		НаименованияЛокаций.Добавить(ДанныеИнструкции.МестоПоставкиГруза);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованияЛокаций", НаименованияЛокаций);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Локации.Наименование В (&НаименованияЛокаций)
	|			ТОГДА Локации.Наименование
	|		ИНАЧЕ Локации.НаименованиеАнгл
	|	КОНЕЦ КАК Наименование
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	(Локации.Наименование В (&НаименованияЛокаций)
	|			ИЛИ Локации.НаименованиеАнгл В (&НаименованияЛокаций))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Локации.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.МестоФормированияКоносамента) Тогда
		КоносаментОбъект.МестоФормированияКоносамента = Локации.Получить(ДанныеИнструкции.НаименованиеМестаФормированияКоносамента);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.СтанцияОтправления) Тогда
		КоносаментОбъект.СтанцияОтправления = Локации.Получить(ДанныеИнструкции.ОписаниеМестаОтправления);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.СтанцияНазначения) Тогда
		КоносаментОбъект.СтанцияНазначения = Локации.Получить(ДанныеИнструкции.ОписаниеМестаНазначения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.МестоПолученияГруза) Тогда
		КоносаментОбъект.МестоПолученияГруза = Локации.Получить(ДанныеИнструкции.МестоПолученияГруза);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.МестоПоставкиГруза) Тогда
		КоносаментОбъект.МестоПоставкиГруза = Локации.Получить(ДанныеИнструкции.МестоПоставкиГруза);
	КонецЕсли;
	
	//Поиск Судна
	//Евросиб Каблов 30.01.2021 (
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТС.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.ТС КАК ТС
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	//|		ПО ТС.ТипТС = ТипоразмерыТС.Ссылка
	//|ГДЕ
	//|	ТС.Наименование = &Наименование
	//|	И ТипоразмерыТС.Судно";
	//Запрос.УстановитьПараметр("Наименование", ДанныеИнструкции.НаименованиеСудна);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда	
	//	КоносаментОбъект.Судно = Выборка.Ссылка;
	//КонецЕсли;
	Судно = ПолучитьСудно(ДанныеИнструкции.НаименованиеСудна);
	КоносаментОбъект.Судно = Судно;	
	//Евросиб Каблов 30.01.2021 )
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.МорскойРейс) Тогда
		КоносаментОбъект.МорскойРейс = ПолучитьМорскойРейс(ДанныеИнструкции.НомерРейса, Судно);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.МорскаяЛиния) Тогда
		КоносаментОбъект.МорскаяЛиния = Справочники.МорскиеЛинии.НайтиПоРеквизиту("КодСибур", ДанныеИнструкции.МорскаяЛиния);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоносаментОбъект.Комментарий) Тогда
		КоносаментОбъект.Комментарий = ДанныеИнструкции.Комментарий;
	КонецЕсли;
	
	//Получение статуса коносамента
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СибурСтатусыЗаявок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СибурСтатусыЗаявок КАК СибурСтатусыЗаявок
	|ГДЕ
	|	СибурСтатусыЗаявок.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокСибура.ЗаявкаКоносамент)
	|	И СибурСтатусыЗаявок.КодСтатуса = ""2""";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусКоносамента = Выборка.Ссылка;
	Иначе
		СтатусКоносамента = Неопределено;
	КонецЕсли;
	КоносаментОбъект.СтатусКоносаментаСибур = СтатусКоносамента;
	
	//Установка дополнительных свойств для изменения Состояния заявки
	УстановитьДопСвойстваСостоянияЗаявки(КоносаментОбъект, СтатусКоносамента, ДанныеИнструкции.ДатаОтправкиИнструкции, ДанныеИнструкции.Комментарий);
	
	//Запись заявки
	КоносаментОбъект.Записать();
	Коносамент = КоносаментОбъект.Ссылка;
	ДанныеИнструкции.Вставить("ИдентификаторУПеревозчика", Строка(Коносамент.УникальныйИдентификатор()));
	
	//Уведомление ответственного по e-mail об изменении заявки
	ОтборУведомлений = Новый Структура;
	ОтборУведомлений.Вставить("Документ", Коносамент);
	ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
	Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений);
	
	//Запись в регистр Размещенные коносаменты
	ЗаписьКоносамента = РегистрыСведений.СибурРазмещенныеКоносаменты.СоздатьМенеджерЗаписи();
	ЗаписьКоносамента.ТранспортныйДокумент = Коносамент;
	ЗаполнитьЗначенияСвойств(ЗаписьКоносамента, ДанныеИнструкции);
	ЗаписьКоносамента.Записать();
	
	Если ЗначениеЗаполнено(ДанныеИнструкции.ПрисоединенныйФайл) Тогда
		
		ДвоичныеДанныеФайла = Base64Значение(ДанныеИнструкции.ПрисоединенныйФайл);
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("Автор", ПользователиКлиентСервер.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", Коносамент);
		ПараметрыФайла.Вставить("ИмяБезРасширения", "Инструкция");
		ПараметрыФайла.Вставить("РасширениеБезТочки", "pdf");
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		Файл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресХранилища);
		
		УдалитьИзВременногоХранилища(АдресХранилища);
		
		КоносаментОбъект.ФайлИнструкции = Файл;
		КоносаментОбъект.Записать();
		
	КонецЕсли;
	
	ЗаписьСтатуса = РегистрыСведений.СибурСтатусыКоносаментов.СоздатьМенеджерЗаписи();
	ЗаписьСтатуса.ТранспортныйДокумент = Коносамент;
	ЗаписьСтатуса.Период = ДанныеИнструкции.ДатаОтправкиИнструкции;
	ЗаписьСтатуса.СтатусЗаявки = СтатусКоносамента;
	ЗаписьСтатуса.Комментарий = ДанныеИнструкции.Комментарий;
	ЗаписьСтатуса.Записать();
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:BillOfLading", "BLInstruction");
	Ответ.TOR_ID = ДанныеИнструкции.ИдентификаторБукинга;
	Ответ.REF_BOOKING_ID = ДанныеИнструкции.НомерБукинга;
	Ответ.EXT_TOR_ID = ДанныеИнструкции.ИдентификаторУПеревозчика;
	Ответ.REC_DATE = ДатаПолученияИнструкции;
		
	Возврат Ответ;
	
КонецФункции

Функция ДрафтКоносамента(ДанныеЗапроса) Экспорт
	
	//Заглушка
	//Процедура на стадии тестирования. Может выполняться только на тестовых базах.
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗапросаДрафта =  Новый Структура;
	ДанныеЗапросаДрафта.Вставить("ИдентификаторБукинга", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "TOR_ID"));
	ДанныеЗапросаДрафта.Вставить("НомерБукинга", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "REF_BOOKING_ID",, "0"));
	ДанныеЗапросаДрафта.Вставить("ИдентификаторУПеревозчика", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "EXT_TOR_ID"));
	ДанныеЗапросаДрафта.Вставить("НомерКоносамента", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеЗапроса, "BL_NUMBER",, "0"));
	
	ВидИнфообмена = "Драфт коносамента";
	НовыйСтатус = Неопределено;
	
	СвойстваОбъекта = ДанныеЗапроса.Свойства();
	Если СвойстваОбъекта.Получить("STATUS_BLOCK") <> Неопределено Тогда
		БлокСтатуса = ДанныеЗапроса.STATUS_BLOCK;
		ДанныеЗапросаДрафта.Вставить("КодСтатуса", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(БлокСтатуса, "BL_STATUS",, ""));
		ДанныеЗапросаДрафта.Вставить("ОписаниеСтатуса", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(БлокСтатуса, "BL_STATUS_D",, ""));
		Если ДанныеЗапросаДрафта.КодСтатуса = "6" Тогда
			ВидИнфообмена = "Запрос оригинала";
		КонецЕсли;
	КонецЕсли;
	
	СвойстваОбъекта = ДанныеЗапроса.Свойства();
	Если СвойстваОбъекта.Получить("COMMENT_BLOCK") <> Неопределено Тогда
		БлокКомментария = ДанныеЗапроса.COMMENT_BLOCK;
		ДанныеЗапросаДрафта.Вставить("Комментарий", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(БлокКомментария, "COMMENT"));
		ВидИнфообмена = "Комментарии к драфту";
		НовыйСтатус = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаКоносамент, "4"); // 4 - Комментарий к драфту
	КонецЕсли;
	
	СвойстваОбъекта = ДанныеЗапроса.Свойства();
	Если СвойстваОбъекта.Получить("DATE_BLOCK") <> Неопределено Тогда
		БлокПодтвержденияДрафта = ДанныеЗапроса.DATE_BLOCK;
		ДанныеЗапросаДрафта.Вставить("ДатаСогласования", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(БлокПодтвержденияДрафта, "DATE_DRAFT"));
		ВидИнфообмена = "Подтверждение драфта";
		НовыйСтатус = ПолучитьСтатусЗаявки(Перечисления.ВидыЗаявокСибура.ЗаявкаКоносамент, "5"); // 5 - Драфт подтвержден
	КонецЕсли;
	
	//Получение данных Букинга и Коносамента (транспортного документа)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокБукинг.Ссылка КАК Букинг,
	|	ДокБукинг.НомерБукинга КАК НомерБукинга,
	|	ДокБукинг.ИДБукинга КАК ИДБукинга,
	|	ДокТранспортныйДокумент.Ссылка КАК Коносамент,
	|	ДокТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента,
	|	ДокТранспортныйДокумент.ДатаОтправкиДрафтаКоносамента КАК ДатаОтправкиДрафтаКоносамента,
	|	ДокТранспортныйДокумент.Комментарий КАК Комментарий,
	|	ДокТранспортныйДокумент.Автор КАК Автор,
	|	ДокТранспортныйДокумент.ФайлОригинала КАК ФайлОригинала,
	|	ДокТранспортныйДокумент.ФайлДрафта КАК ФайлДрафта,
	|	СибурРазмещенныеКоносаменты.ОтветственныйМенеджер КАК Менеджер,
	|	СибурРазмещенныеКоносаменты.ОтветственныйМенеджер.Наименование КАК ИмяМенеджера
	|ПОМЕСТИТЬ ВТКоносамент
	|ИЗ
	|	Документ.Букинг КАК ДокБукинг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ДокТранспортныйДокумент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеКоносаменты КАК СибурРазмещенныеКоносаменты
	|			ПО ДокТранспортныйДокумент.Ссылка = СибурРазмещенныеКоносаменты.ТранспортныйДокумент
	|		ПО (ДокБукинг.Ссылка = СибурРазмещенныеКоносаменты.ТранспортныйДокумент.Букинг)
	|ГДЕ
	|	ДокБукинг.ИДБукинга = &ИдентификаторБукинга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКоносамент.Букинг КАК Букинг,
	|	ВТКоносамент.НомерБукинга КАК НомерБукинга,
	|	ВТКоносамент.ИДБукинга КАК ИДБукинга,
	|	ВТКоносамент.Коносамент КАК Коносамент,
	|	ВТКоносамент.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента,
	|	ВТКоносамент.ДатаОтправкиДрафтаКоносамента КАК ДатаОтправкиДрафтаКоносамента,
	|	ВТКоносамент.Комментарий КАК Комментарий,
	|	СибурСтатусыКоносаментовСрезПоследних.СтатусЗаявки КАК СтатусЗаявки,
	|	СибурСтатусыКоносаментовСрезПоследних.СтатусЗаявки.КодСтатуса КАК СтатусЗаявкиКод,
	|	СибурСтатусыКоносаментовСрезПоследних.СтатусЗаявки.Наименование КАК СтатусЗаявкиНаименование,
	|	СибурСтатусыКоносаментовСрезПоследних.Комментарий КАК КомментарийКСтатусу,
	|	ВТКоносамент.ИмяМенеджера КАК ИмяМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК ТелефонМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияАдресЭлПочты.Представление, """") КАК АдресЭлПочтыМенеджера,
	|	ВТКоносамент.ФайлОригинала КАК ФайлОригинала,
	|	ВТКоносамент.ФайлДрафта КАК ФайлДрафта
	|ИЗ
	|	ВТКоносамент КАК ВТКоносамент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СибурСтатусыКоносаментов.СрезПоследних(
	|				,
	|				ТранспортныйДокумент В
	|					(ВЫБРАТЬ
	|						ВТКоносамент.Коносамент КАК Коносамент
	|					ИЗ
	|						ВТКоносамент КАК ВТКоносамент)) КАК СибурСтатусыКоносаментовСрезПоследних
	|		ПО ВТКоносамент.Коносамент = СибурСтатусыКоносаментовСрезПоследних.ТранспортныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО ВТКоносамент.Менеджер = КонтактнаяИнформацияТелефон.Ссылка
	|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЭлПочты
	|		ПО ВТКоносамент.Менеджер = КонтактнаяИнформацияАдресЭлПочты.Ссылка
	|			И (КонтактнаяИнформацияАдресЭлПочты.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))";
	Запрос.УстановитьПараметр("ИдентификаторБукинга", ДанныеЗапросаДрафта.ИдентификаторБукинга);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ответ = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:BillOfLading", "BillOfLading");		
	
	Если Выборка.Следующий() Тогда
		
		Коносамент = Выборка.Коносамент;
		
		Ответ.TOR_ID = Выборка.ИДБукинга;
		Ответ.REF_BOOKING_ID = Выборка.НомерБукинга;
		Ответ.EXT_TOR_ID = Строка(Коносамент.УникальныйИдентификатор());
		Ответ.BL_NUMBER = Выборка.НомерТранспортногоДокумента;
		
		БлокДрафта = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:BillOfLading", "DRAFT_BLOCK");
		БлокДрафта.BL_STATUS = Выборка.СтатусЗаявкиКод;
		БлокДрафта.BL_STATUS_D = Выборка.СтатусЗаявкиНаименование;		
		
		БлокКомментария = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:BillOfLading", "COMMENT_BLOCK");
		БлокДатыПодтверждения = ПолучитьОбъектXDTO("urn:sibur:po:a:LP:BillOfLading", "DATE_BLOCK");
		
		//Запись в регистр Размещенные коносаменты
		ЗаписьКоносамента = РегистрыСведений.СибурРазмещенныеКоносаменты.СоздатьМенеджерЗаписи();
		ЗаписьКоносамента.ТранспортныйДокумент = Коносамент;
		ЗаписьКоносамента.Прочитать();
		Если Не ЗаписьКоносамента.Выбран() Тогда
			ЗаписьКоносамента.ТранспортныйДокумент = Коносамент;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЗаписьКоносамента, ДанныеЗапросаДрафта);
		ЗаписьКоносамента.Записать();
		
		Если ЗначениеЗаполнено(НовыйСтатус) Тогда
			
			КоносаментОбъект = Коносамент.ПолучитьОбъект();
			КоносаментОбъект.СтатусКоносаментаСибур = НовыйСтатус;
			
			//Установка дополнительных свойств для изменения Состояния заявки
			Комментарий = Неопределено;
			Если Не ДанныеЗапросаДрафта.Свойство("Комментарий", Комментарий) Тогда
				Комментарий = "";
			КонецЕсли;
			
			УстановитьДопСвойстваСостоянияЗаявки(КоносаментОбъект, НовыйСтатус, ТекущаяДатаСеанса(), Комментарий);
			
			//Запись заявки
			КоносаментОбъект.Записать();
						
			//Уведомление ответственного по e-mail об изменении заявки
			ОтборУведомлений = Новый Структура;
			ОтборУведомлений.Вставить("Документ", Коносамент);
			ОтборУведомлений.Вставить("Состояние", Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента);	
			Пользователи_sd_сервер.УведомитьПользователяОЕгоЗадачах(ОтборУведомлений)
			
		КонецЕсли;
		
		Если ВидИнфообмена = "Драфт коносамента" Тогда
			
			БлокДрафта.CREATED_ON_DRAFT = Выборка.ДатаОтправкиДрафтаКоносамента;
			//Файл
			ДополнительныеПараметры = Новый Структура("ВызыватьИсключение, ПолучатьСсылкуНаДвоичныеДанные", Ложь, Истина);			
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ФайлДрафта, ДополнительныеПараметры);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			УдалитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			БлокДрафта.PDF_CONTENT = Base64Строка(ДвоичныеДанные);			
			Ответ.DRAFT_BLOCK = БлокДрафта;
			
			БлокКомментария.COMMENT = Выборка.КомментарийКСтатусу;			
			БлокКомментария.EXP_MANAGER_DESCR = Выборка.ИмяМенеджера;
			БлокКомментария.EXP_MANAGER_TEL = Выборка.ТелефонМенеджера;
			БлокКомментария.EXP_MANAGER_MAIL = Выборка.АдресЭлПочтыМенеджера;			
			Ответ.COMMENT_BLOCK = БлокКомментария;
			
		ИначеЕсли ВидИнфообмена = "Комментарии к драфту" Тогда
			
			БлокДрафта.CREATED_ON_DRAFT = Выборка.ДатаОтправкиДрафтаКоносамента;
			//Файл
			ДополнительныеПараметры = Новый Структура("ВызыватьИсключение, ПолучатьСсылкуНаДвоичныеДанные", Ложь, Истина);			
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ФайлДрафта, ДополнительныеПараметры);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			УдалитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			БлокДрафта.PDF_CONTENT = Base64Строка(ДвоичныеДанные);			
			Ответ.DRAFT_BLOCK = БлокДрафта;
			
			БлокКомментария.COMMENT = Выборка.КомментарийКСтатусу;	
			Ответ.COMMENT_BLOCK = БлокКомментария;
			
		ИначеЕсли ВидИнфообмена = "Подтверждение драфта" Тогда
			
			//БлокДатыПодтверждения.REC_DATE = ?;
			
		ИначеЕсли ВидИнфообмена = "Запрос оригинала" Тогда
			
			//Файл
			ДополнительныеПараметры = Новый Структура("ВызыватьИсключение, ПолучатьСсылкуНаДвоичныеДанные", Ложь, Истина);			
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ФайлОригинала, ДополнительныеПараметры);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			УдалитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			БлокДрафта.PDF_CONTENT = Base64Строка(ДвоичныеДанные);			
			Ответ.DRAFT_BLOCK = БлокДрафта;
			//Комментарий
			БлокКомментария.COMMENT = Выборка.КомментарийКСтатусу;	
			Ответ.COMMENT_BLOCK = БлокКомментария;
			
			//CREATED_ON_ORIG???
			//STATUS_PROC???
			//STATUS_PROC_DESC???
			
		КонецЕсли;
		
	Иначе		
		Ответ.TOR_ID = ДанныеЗапросаДрафта.ИдентификаторБукинга;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьТаблицуКонтейнеровКоносамента(ДанныеПоКонтейнерам)
	
	ТаблицаКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаКонтейнеров.Колонки.Добавить("НомерКонтейнера", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11)));
	ТаблицаКонтейнеров.Колонки.Добавить("ТипКонтейнера", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4)));
	ТаблицаКонтейнеров.Колонки.Добавить("ТипКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	ТаблицаКонтейнеров.Колонки.Добавить("НомерКТК", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТаблицаКонтейнеров.Колонки.Добавить("ТипУпаковки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	ТаблицаКонтейнеров.Колонки.Добавить("КоличествоЕдиницУпаковки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаКонтейнеров.Колонки.Добавить("ВесБрутто", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаКонтейнеров.Колонки.Добавить("КодЕдиницыИзмеренияВесаБрутто", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаКонтейнеров.Колонки.Добавить("ЕдиницаИзмеренияВесаБрутто", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаКонтейнеров.Колонки.Добавить("ВесНетто", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаКонтейнеров.Колонки.Добавить("КодЕдиницыИзмеренияВесаНетто", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаКонтейнеров.Колонки.Добавить("ЕдиницаИзмеренияВесаНетто", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаКонтейнеров.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаКонтейнеров.Колонки.Добавить("КодЕдиницыИзмеренияОбъема", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаКонтейнеров.Колонки.Добавить("ЕдиницаИзмеренияОбъема", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаКонтейнеров.Колонки.Добавить("НомерПломбы", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(60)));
	
	Если ДанныеПоКонтейнерам.Свойства().Получить("BLInstructionItem") <> Неопределено Тогда 
		СписокКонтейнеров = ДанныеПоКонтейнерам.BLInstructionItem;
	Иначе
		СписокКонтейнеров = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(СписокКонтейнеров) = Тип("ОбъектXDTO") Тогда
		Контейнеры = Новый Массив;
		Контейнеры.Добавить(СписокКонтейнеров);
	ИначеЕсли ТипЗнч(СписокКонтейнеров) = Тип("СписокXDTO") Тогда
		Контейнеры = СписокКонтейнеров;
	Иначе
		Возврат ТаблицаКонтейнеров;
	КонецЕсли;
	
	Для Каждого ДанныеПоКонтейнеру Из Контейнеры Цикл
		НоваяСтрока = ТаблицаКонтейнеров.Добавить();
		НоваяСтрока.НомерКонтейнера = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "CONTAINER_ID");
		НоваяСтрока.ТипКонтейнера = ПолучитьТипКонтейнераСтрокойПоКодуСибур(ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "CONTAINER_MOT"));
		НоваяСтрока.ТипУпаковки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "PACKAGE");
		НоваяСтрока.КоличествоЕдиницУпаковки = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "PACKAGE_COUNT", Тип("Число"), 0);
		НоваяСтрока.ВесБрутто = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "VGM_GRO_WEI_VAL", Тип("Число"), 0);		
		НоваяСтрока.КодЕдиницыИзмеренияВесаБрутто = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "VGM_GRO_WEI_UNI");
		НоваяСтрока.ВесНетто = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "NET_WEIGHT", Тип("Число"), 0);		
		НоваяСтрока.КодЕдиницыИзмеренияВесаНетто = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "NET_WEIGHT_UOM");
		НоваяСтрока.Объем = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "MEASURMENT", Тип("Число"), 0);		
		НоваяСтрока.КодЕдиницыИзмеренияОбъема = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "MEASURMENT_OUM");		
		НоваяСтрока.НомерПломбы = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ДанныеПоКонтейнеру, "SEAL_NUM");
	КонецЦикла;	
	
	//Поиск контейнеров по номерам
	КонтейнерыПоНомерам = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЕ.Ссылка КАК Ссылка,
	|	ТЕ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	ТЕ.Наименование В(&НомераКонтейнеров)";
	Запрос.УстановитьПараметр("НомераКонтейнеров", ТаблицаКонтейнеров.ВыгрузитьКолонку("НомерКонтейнера"));
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		КонтейнерыПоНомерам.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	//Поиск типоразмеров контейнеров
	ТипоразмерыПоКодам = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипоразмерыТЕ.Ссылка КАК Ссылка,
	|	ТипоразмерыТЕ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|ГДЕ
	|	ТипоразмерыТЕ.Наименование В(&ТипыКонтейнеров)";
	Запрос.УстановитьПараметр("ТипыКонтейнеров", ТаблицаКонтейнеров.ВыгрузитьКолонку("ТипКонтейнера"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТипоразмерыПоКодам.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;	
	
	//Поиск единиц измерения
	ЕдиницыИзмеренияПоКодам = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка,
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Наименование В(&КодыЕдиницИзмерения)";
	КодыЕдиницИзмерения = ТаблицаКонтейнеров.ВыгрузитьКолонку("КодЕдиницыИзмеренияВесаБрутто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыЕдиницИзмерения, ТаблицаКонтейнеров.ВыгрузитьКолонку("КодЕдиницыИзмеренияВесаНетто"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыЕдиницИзмерения, ТаблицаКонтейнеров.ВыгрузитьКолонку("КодЕдиницыИзмеренияОбъема"), Истина);
	Запрос.УстановитьПараметр("КодыЕдиницИзмерения", КодыЕдиницИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЕдиницыИзмеренияПоКодам.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	//Заполнение таблицы найденными ссылками
	Для Каждого СтрокаТаблицы Из ТаблицаКонтейнеров Цикл
		
		СтрокаТаблицы.ТипКТК = ТипоразмерыПоКодам.Получить(СтрокаТаблицы.ТипКонтейнера);		
		
		СтрокаТаблицы.НомерКТК = КонтейнерыПоНомерам.Получить(СтрокаТаблицы.НомерКонтейнера);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерКТК) И СтрДлина(СтрокаТаблицы.НомерКонтейнера) = 11 Тогда
			//НовыйКонтейнер = Справочники.ТЕ.СоздатьЭлемент();
			//НовыйКонтейнер.Наименование = СтрокаТаблицы.НомерКонтейнера;
			//НовыйКонтейнер.Префикс = Сред(СтрокаТаблицы.НомерКонтейнера, 1, 4);
			//НовыйКонтейнер.Номер = Сред(СтрокаТаблицы.НомерКонтейнера, 5, 6);
			//НовыйКонтейнер.КонтрольноеЧисло = Сред(СтрокаТаблицы.НомерКонтейнера, 11, 1);
			//НовыйКонтейнер.ТипТЕ = СтрокаТаблицы.ТипКТК;
			//НовыйКонтейнер.Записать();
			
			НомерКТК = СтрокаТаблицы.НомерКонтейнера;
			ТипТЕ = СтрокаТаблицы.ТипКТК;
			Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК, ТипТЕ);
			СтрокаТаблицы.НомерКТК = Контейнер;
		КонецЕсли;
		
		СтрокаТаблицы.ЕдиницаИзмеренияВесаБрутто = ЕдиницыИзмеренияПоКодам.Получить(СтрокаТаблицы.КодЕдиницыИзмеренияВесаБрутто);
		СтрокаТаблицы.ЕдиницаИзмеренияВесаНетто = ЕдиницыИзмеренияПоКодам.Получить(СтрокаТаблицы.КодЕдиницыИзмеренияВесаНетто);
		СтрокаТаблицы.ЕдиницаИзмеренияОбъема = ЕдиницыИзмеренияПоКодам.Получить(СтрокаТаблицы.КодЕдиницыИзмеренияОбъема);
		
	КонецЦикла;
	
	Возврат ТаблицаКонтейнеров;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДопСвойстваСостоянияЗаявки(ДокОбъект, СтатусЗаявки, ДатаРазмещенияЗаявки, Комментарий = "")
	
	ИзмененияЗаявки = Новый Структура;
	ИзмененияЗаявки.Вставить("Статус", СтатусЗаявки);
	ИзмененияЗаявки.Вставить("ДатаСтатуса", ДатаРазмещенияЗаявки);
	Если ЗначениеЗаполнено(Комментарий) Тогда
		КомментарийДляСтатуса = СтрШаблон("СИБУР установил статус заявки: %1. Комментарий СИБУР: %2", СтатусЗаявки, Комментарий);
	Иначе
		КомментарийДляСтатуса = СтрШаблон("СИБУР установил статус заявки: %1", СтатусЗаявки);
	КонецЕсли;
	ИзмененияЗаявки.Вставить("Комментарий", КомментарийДляСтатуса);
	ДокОбъект.ДополнительныеСвойства.Вставить("СибурИзмененияЗаявки", ИзмененияЗаявки);
	
КонецПроцедуры

Функция ПолучитьМорскойРейс(НомерРейса, Судно, Линия = Неопределено)
	
	Рейс = Неопределено;	
	Если ЗначениеЗаполнено(НомерРейса) Тогда
		
		Запрос = Новый Запрос;
		
		Если ЗначениеЗаполнено(Судно) Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РейсыМоре.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РейсыМоре КАК РейсыМоре
			|ГДЕ
			|	РейсыМоре.НомерРейса = &НомерРейса
			|	И РейсыМоре.Судно = &Судно";	
			Запрос.УстановитьПараметр("Судно", Судно);
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РейсыМоре.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РейсыМоре КАК РейсыМоре
			|ГДЕ
			|	РейсыМоре.НомерРейса = &НомерРейса";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("НомерРейса", НомерРейса);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Рейс = Выборка.Ссылка;
		Иначе
			
			РейсОбъект = Справочники.РейсыМоре.СоздатьЭлемент();
			РейсОбъект.НомерРейса = НомерРейса;
			РейсОбъект.Судно = Судно;
			РейсОбъект.Линия = Линия;
			НазваниеСудна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Судно, "Наименование");
			РейсОбъект.Наименование = СтрШаблон("%1 %2", НазваниеСудна, НомерРейса); 
			РейсОбъект.Записать();
			
			Рейс = РейсОбъект.Ссылка;
		
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рейс;
	
КонецФункции

Функция ПолучитьСудно(НазваниеСудна)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТС КАК ТС
	|ГДЕ
	|	ТС.ТипТС.Судно
	|	И ТС.Наименование = &НазваниеСудна";
	Запрос.УстановитьПараметр("НазваниеСудна", НазваниеСудна);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	    Судно = Выборка.Ссылка;
	Иначе
		СудноОбъект = Справочники.ТС.СоздатьЭлемент();
		СудноОбъект.Наименование = НазваниеСудна;
		СудноОбъект.ТипТС = Справочники.ТипоразмерыТС.НайтиПоРеквизиту("Судно", Истина);;
		СудноОбъект.Записать();
		Судно = СудноОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Судно;
	
КонецФункции

Функция ПолучитьСтатусЗаявки(ВидЗаявки, КодСтатуса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СибурСтатусыЗаявок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СибурСтатусыЗаявок КАК СибурСтатусыЗаявок
	|ГДЕ
	|	СибурСтатусыЗаявок.ВидЗаявки = &ВидЗаявки
	|	И СибурСтатусыЗаявок.КодСтатуса = &КодСтатуса";
	Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаявки);
	Запрос.УстановитьПараметр("КодСтатуса", КодСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусЗаявки = Выборка.Ссылка;
	Иначе
		СтатусЗаявки = Справочники.СибурСтатусыЗаявок.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатусЗаявки;
	
КонецФункции

Функция ПолучитьТаблицуКонтейнеровБукинга(ДанныеПоКонтейнерам)
	
	ТаблицаКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаКонтейнеров.Колонки.Добавить("НомерКонтейнера", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11)));
	ТаблицаКонтейнеров.Колонки.Добавить("ТипКонтейнера", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4)));
	ТаблицаКонтейнеров.Колонки.Добавить("НаименованиеСобственника", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаКонтейнеров.Колонки.Добавить("НаименованиеГруза", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаКонтейнеров.Колонки.Добавить("КодГрузаТНВЭД", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	ТаблицаКонтейнеров.Колонки.Добавить("ПодтверждённыйВесБрутто", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаКонтейнеров.Колонки.Добавить("КодЕдиницыИзмерения", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	
	Если ДанныеПоКонтейнерам.Свойства().Получить("BookingItem") <> Неопределено Тогда 
		СписокКонтейнеров = ДанныеПоКонтейнерам.BookingItem;
	Иначе
		СписокКонтейнеров = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(СписокКонтейнеров) = Тип("ОбъектXDTO") Тогда
		Контейнеры = Новый Массив;
		Контейнеры.Добавить(СписокКонтейнеров);
	ИначеЕсли ТипЗнч(СписокКонтейнеров) = Тип("СписокXDTO") Тогда
		Контейнеры = СписокКонтейнеров;
	Иначе
		Возврат ТаблицаКонтейнеров;
	КонецЕсли;
	
	Для Каждого ДанныеПоКонтейнеру Из Контейнеры Цикл
		НоваяСтрока = ТаблицаКонтейнеров.Добавить();
		НоваяСтрока.НомерКонтейнера = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.CONTAINER_ID);
		НоваяСтрока.ТипКонтейнера = ПолучитьТипКонтейнераСтрокойПоКодуСибур(ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.CONTAINER_MOT));
		НоваяСтрока.НаименованиеСобственника = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.CONTAINER_OWNER_DESCR);
		НоваяСтрока.НаименованиеГруза = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.CARGO_DESC);
		НоваяСтрока.КодГрузаТНВЭД = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.HS_CODE);		
		НоваяСтрока.ПодтверждённыйВесБрутто = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.VGM_GRO_WEI_VAL);
		НоваяСтрока.КодЕдиницыИзмерения = ПолучитьЗначениеПоляОбъектаXDTO(ДанныеПоКонтейнеру.VGM_GRO_WEI_UNI);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКонтейнеров.НомерКонтейнера КАК НомерКонтейнера,
	|	ТаблицаКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ТаблицаКонтейнеров.НаименованиеСобственника КАК НаименованиеСобственника,
	|	ТаблицаКонтейнеров.НаименованиеГруза КАК НаименованиеГруза,
	|	ТаблицаКонтейнеров.КодГрузаТНВЭД КАК КодГрузаТНВЭД,
	|	ТаблицаКонтейнеров.ПодтверждённыйВесБрутто КАК ПодтверждённыйВесБрутто,
	|	ТаблицаКонтейнеров.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения
	|ПОМЕСТИТЬ ВТКонтейнеры
	|ИЗ
	|	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТКонтейнеры.ТипКонтейнера КАК ТипКонтейнера,
	|	ВТКонтейнеры.НаименованиеСобственника КАК НаименованиеСобственника,
	|	ВТКонтейнеры.НаименованиеГруза КАК НаименованиеГруза,
	|	ВТКонтейнеры.КодГрузаТНВЭД КАК КодГрузаТНВЭД,
	|	ВТКонтейнеры.ПодтверждённыйВесБрутто КАК ПодтверждённыйВесБрутто,
	|	ВТКонтейнеры.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения,
	|	ТЕ.Ссылка КАК Контейнер,
	|	КлассификаторЕдиницИзмерения.Ссылка КАК ЕдиницаИзмерения,
	|	Грузы.Ссылка КАК Груз,
	|	Грузы.ТНВЭД КАК КодНайденногоГрузаТНВЭД,
	|	ТипоразмерыТЕ.Ссылка КАК ТипТЕ
	|ИЗ
	|	ВТКонтейнеры КАК ВТКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО ВТКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ВТКонтейнеры.КодЕдиницыИзмерения = КлассификаторЕдиницИзмерения.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
	|		ПО (ВЫБОР
	|				КОГДА ВТКонтейнеры.НаименованиеГруза = Грузы.Наименование
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТКонтейнеры.КодГрузаТНВЭД <> """" И ВТКонтейнеры.КодГрузаТНВЭД = Грузы.ТНВЭД
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|		ПО ВТКонтейнеры.ТипКонтейнера = ТипоразмерыТЕ.Наименование";
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	ТаблицаКонтейнеров = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаКонтейнеров Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контейнер) И СтрДлина(СтрокаТаблицы.НомерКонтейнера) = 11 Тогда
			//НовыйКонтейнер = Справочники.ТЕ.СоздатьЭлемент();
			//НовыйКонтейнер.Наименование = СтрокаТаблицы.НомерКонтейнера;
			//НовыйКонтейнер.Префикс = Сред(СтрокаТаблицы.НомерКонтейнера, 1, 4);
			//НовыйКонтейнер.Номер = Сред(СтрокаТаблицы.НомерКонтейнера, 5, 6);
			//НовыйКонтейнер.КонтрольноеЧисло = Сред(СтрокаТаблицы.НомерКонтейнера, 11, 1);
			//НовыйКонтейнер.ТипТЕ = СтрокаТаблицы.ТипТЕ;
			//НовыйКонтейнер.Записать();
			
			НомерКТК = СтрокаТаблицы.НомерКонтейнера;
			ТипТЕ = СтрокаТаблицы.ТипТЕ;
			Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК, ТипТЕ);
			СтрокаТаблицы.Контейнер = Контейнер;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Груз) И ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеГруза) Тогда
			НовыйЭлемент = Справочники.Грузы.СоздатьЭлемент();
			НовыйЭлемент.Наименование = СтрокаТаблицы.НаименованиеГруза;
			НовыйЭлемент.ТНВЭД = СтрокаТаблицы.КодГрузаТНВЭД;
			НовыйЭлемент.Записать();
			СтрокаТаблицы.Груз = НовыйЭлемент.Ссылка;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Груз) 
				И ЗначениеЗаполнено(СтрокаТаблицы.КодГрузаТНВЭД) 
				И СтрокаТаблицы.КодГрузаТНВЭД <> СтрокаТаблицы.КодНайденногоГрузаТНВЭД Тогда
			ГрузОбъект = СтрокаТаблицы.Груз.ПолучитьОбъект();
			ГрузОбъект.ТНВЭД = СтрокаТаблицы.КодГрузаТНВЭД;
			ГрузОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаКонтейнеров;
	
КонецФункции

Функция ПолучитьКонтейнер(Номер, Вид)
	
	КонтейнерСсылка = Справочники.ТЕ.НайтиПоРеквизиту();
	
КонецФункции

Функция ПолучитьТипКонтейнераСтрокойПоКодуСибур(Код)
	
	Если Код = "40FT" Тогда
		Тип = "40DC";
	Иначе
		Тип = Код;
	КонецЕсли;
	
	Возврат Тип;
	
КонецФункции

Функция ПолучитьЗначениеПоляОбъектаXDTO(ПолеОбъекта, ТипЗначения = Неопределено, ПустоеЗначение = Неопределено)
		
	Если ТипЗнч(ПолеОбъекта) = Тип("ОбъектXDTO") Тогда
		ЗначениеПоля = ПустоеЗначение;
	ИначеЕсли ТипЗначения <> Неопределено Тогда
		Попытка
			ЗначениеПоля = XMLЗначение(ТипЗначения, ПолеОбъекта);
		Исключение
			Если ТипЗначения = Тип("Дата") И ТипЗнч(ПолеОбъекта) = Тип("Строка") Тогда
				Если СтрДлина(ПолеОбъекта) = 17 Тогда
					СтрокаДаты = СтрЗаменить(ПолеОбъекта, " ", "");
					СтрокаДаты = СтрЗаменить(СтрокаДаты, ":", "");
					ОписаниеТипа = Новый ОписаниеТипов("Дата");
					ЗначениеПоля = ОписаниеТипа.ПривестиЗначение(СтрокаДаты);
				КонецЕсли;			
			КонецЕсли;
		КонецПопытки;
	Иначе
		ЗначениеПоля = ПолеОбъекта;
	КонецЕсли;
	
	Возврат ЗначениеПоля;
	
КонецФункции

Функция ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, ИмяПоля, ТипЗначения = Неопределено, ПустоеЗначение = Неопределено)
	
	Если ОбъектXDTO.Свойства().Получить(ИмяПоля) <> Неопределено Тогда
		ПолеОбъекта = ОбъектXDTO[ИмяПоля];
	Иначе
		ПолеОбъекта = ПустоеЗначение;
	КонецЕсли;
		
	Если ТипЗнч(ПолеОбъекта) = Тип("ОбъектXDTO") Тогда
		ЗначениеПоля = ПустоеЗначение;
	ИначеЕсли ТипЗначения <> Неопределено Тогда
		Попытка
			ЗначениеПоля = XMLЗначение(ТипЗначения, ПолеОбъекта);
		Исключение
			Если ТипЗначения = Тип("Дата") И ТипЗнч(ПолеОбъекта) = Тип("Строка") Тогда
				Если СтрДлина(ПолеОбъекта) = 17 Тогда
					СтрокаДаты = СтрЗаменить(ПолеОбъекта, " ", "");
					СтрокаДаты = СтрЗаменить(СтрокаДаты, ":", "");
					ОписаниеТипа = Новый ОписаниеТипов("Дата");
					ЗначениеПоля = ОписаниеТипа.ПривестиЗначение(СтрокаДаты);
				КонецЕсли;			
			КонецЕсли;
		КонецПопытки;
	Иначе
		ЗначениеПоля = ПолеОбъекта;
	КонецЕсли;
	
	Возврат ЗначениеПоля;
	
КонецФункции

Функция УдалитьПолучитьСтатусЗаявкиПоКоду(КодСтатуса, НаименованиеСтатуса)
	
	Если ЗначениеЗаполнено(КодСтатуса) Тогда		
		СтатусЗаявки = Справочники.СибурСтатусыЗаявок.НайтиПоКоду(КодСтатуса);
		Если Не ЗначениеЗаполнено(СтатусЗаявки) Тогда
			НовыйЭлемент = Справочники.СибурСтатусыЗаявок.СоздатьЭлемент();
			НовыйЭлемент.Код = КодСтатуса;
			НовыйЭлемент.Наименование = НаименованиеСтатуса;
			НовыйЭлемент.Записать();
			СтатусЗаявки = НовыйЭлемент.Ссылка;
		КонецЕсли;		
	Иначе
		СтатусЗаявки = Справочники.СибурСтатусыЗаявок.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатусЗаявки;
	
КонецФункции

Функция ПолучитьКалькуляциюИПротокол(Контрагент, Договор, СтанцияОтправления, СтанцияНазначения)
	
	Результат = Новый Структура("Калькуляция, Протокол");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Ссылка,
	|	Калькуляция.Дата КАК Дата
	|ПОМЕСТИТЬ ВТКалькуляции
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.Контрагент = &Контрагент
	|	И Калькуляция.Договор = &Договор
	|	И Калькуляция.Проведен
	|	И Калькуляция.Суша_ПунктОтправления = &СтанцияОтправления
	|	И Калькуляция.Суша_ПунктНазначения = &СтанцияНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКалькуляции.Ссылка КАК Калькуляция
	|ПОМЕСТИТЬ ВТПоследниеКалькуляции
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВТКалькуляции.Дата) КАК Дата
	|	ИЗ
	|		ВТКалькуляции КАК ВТКалькуляции) КАК ДатаПоследнейКалькуляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКалькуляции КАК ВТКалькуляции
	|		ПО ДатаПоследнейКалькуляции.Дата = ВТКалькуляции.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоследниеКалькуляции.Калькуляция КАК Калькуляция,
	|	ПСЦКалькуляции.Ссылка КАК Протокол
	|ИЗ
	|	ВТПоследниеКалькуляции КАК ВТПоследниеКалькуляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|		ПО ВТПоследниеКалькуляции.Калькуляция = ПСЦКалькуляции.Калькуляция";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Если ЗначениеЗаполнено(СтанцияОтправления) Тогда
		Запрос.УстановитьПараметр("СтанцияОтправления", СтанцияОтправления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Калькуляция.Суша_ПунктОтправления = &СтанцияОтправления", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтанцияНазначения) Тогда
		Запрос.УстановитьПараметр("СтанцияНазначения", СтанцияНазначения);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Калькуляция.Суша_ПунктНазначения = &СтанцияНазначения", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
Функция ПолучитьРезультатЗапросаПоЗаявке(ИдентификаторЗаявки)
	
	Запрос = Новый Запрос;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023
	// Было:
	//Запрос.УстановитьПараметр("RFQ_ID", ИдентификаторЗаявки); 
	//Стало:
	RFQ_ID = "";
	НомерЛота = "";
	МассивСтрок = СтрРазделить(ИдентификаторЗаявки,"/");
	Если МассивСтрок.Количество() = 2 Тогда 
		RFQ_ID = МассивСтрок[0];
		НомерЛота = МассивСтрок[1];
	КонецЕсли;	
	Запрос.УстановитьПараметр("RFQ_ID", RFQ_ID);
	Запрос.УстановитьПараметр("НомерЛота", НомерЛота);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СибурРазмещенныеЗаявки.Заявка КАК Заявка,
//Евросиб ( Литвинов 21.01.2021 #30025
	|	СибурРазмещенныеЗаявки.Заявка.Дата КАК Дата,
//Евросиб ) Литвинов 21.01.2021 #30025
	|	ДокЗаявка.ВнешнийНомер КАК RFQ_ID,
	|	ДокЗаявка.Номер КАК EXT_RFQ_ID,
	|	СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых,
	|	СибурРазмещенныеЗаявки.НеобходимаяДатаПодачиПорожнегоСостава КАК НеобходимаяДатаПодачиПорожнегоСостава,
	|	СибурРазмещенныеЗаявки.Заявка.Отправка КАК ПлановаяДатаОтправленияПорожнего,
	//Евросиб Каблов 25.10.2021 ( Ticket#0243051
	|	ЗаявкаПереченьРейсов.Рейс.ДатаОтправления КАК ФактическаяДатаОтправленияПорожнегоРейса,
	//Евросиб Каблов 25.10.2021 )
	|	ЕСТЬNULL(СибурРазмещенныеЗаявки.Заявка.СтанцияНазначенияГруженого.КодЖДСтанции, """") КАК КодСтанцииНазначенияГруженого,
	|	ЕСТЬNULL(СибурРазмещенныеЗаявки.Заявка.СтанцияНазначенияГруженого.Наименование, """") КАК НазваниеСтанцииНазначенияГруженого,
	|	СибурРазмещенныеЗаявки.КодКонечнойСтанцииНазначенияПриСухопутье КАК КодКонечнойСтанцииНазначенияПриСухопутье,
	|	СибурРазмещенныеЗаявки.НазваниеКонечнойСтанцииНазначенияПриСухопутье КАК НазваниеКонечнойСтанцииНазначенияПриСухопутье,
	|	ЕСТЬNULL(СибурРазмещенныеЗаявки.Заявка.ПритерминальнаяСтанция.КодЖДСтанции, """") КАК КодПритерминальнойЖДСтанции,
	|	ЕСТЬNULL(СибурРазмещенныеЗаявки.Заявка.ПритерминальнаяСтанция.Наименование, """") КАК НазваниеПритерминальнойЖДСтанции,
	//Евросиб Каблов 04.08.2021 ( Ticket#0237548
	//|	ЕСТЬNULL(СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых.Грузополучатель.КодПоОКПО, """") КАК ГрузополучательОКПО,
	|	ВЫБОР
	|		КОГДА СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых.Грузополучатель.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых.Грузополучатель.КодПоОКПО, """")
	|		ИНАЧЕ ЕСТЬNULL(СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых.Грузополучатель.ВнешнийКодНерезидента, """")
	|	КОНЕЦ КАК ГрузополучательОКПО,
	//Евросиб Каблов 04.08.2021 )
	|	ЕСТЬNULL(СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых.Грузополучатель.Наименование, """") КАК ГрузополучательНаименование,
	|	СибурРазмещенныеЗаявки.Заявка.Отправка КАК ДатаОтправкиПорожнихКонтейнеров,
	|	СибурРазмещенныеЗаявки.Заявка.Прибытие КАК ДатаПрибытияПорожнихКонтейнеров,
	|	СибурРазмещенныеЗаявки.Комментарий КАК Комментарий,
	|	СибурРазмещенныеЗаявки.НомерДоговора КАК НомерДоговораУЗаказчика
	|ПОМЕСТИТЬ ВТЗаявка
	|ИЗ
	|	Документ.Заявка КАК ДокЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|		ПО ДокЗаявка.Ссылка = СибурРазмещенныеЗаявки.Заявка
	//Евросиб Каблов 25.10.2021 ( Ticket#0243051
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ПО ДокЗаявка.Ссылка = ЗаявкаПереченьРейсов.Ссылка
	|			И (ЗаявкаПереченьРейсов.Рейс ССЫЛКА Справочник.РейсыЖД)
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.НомераЛотов КАК ЗаявкаНомераЛотов
	|		ПО (ДокЗаявка.Ссылка = ЗаявкаНомераЛотов.Ссылка)
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
	//Евросиб Каблов 25.10.2021 )
	|ГДЕ
	|	ДокЗаявка.ВнешнийНомер = &RFQ_ID
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 29.03.2023
	|	И ЗаявкаНомераЛотов.НомерЛота = &НомерЛота
	|	И НЕ ДокЗаявка.ПометкаУдаления
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 29.03.2023
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СибурСтатусыЗаявокСрезПоследних.Период КАК Период,
	|	СибурСтатусыЗаявокСрезПоследних.Заявка КАК Заявка,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки КАК СтатусЗаявки,
	|	СибурСтатусыЗаявокСрезПоследних.ПричинаОтклоненияЗаявки КАК ПричинаОтклоненияЗаявки,
	|	ЕСТЬNULL(СибурСтатусыЗаявокСрезПоследних.ПричинаОтклоненияЗаявки.Код, """") КАК КодПричиныОтклоненияЗаявки
	|ПОМЕСТИТЬ ВТСтатусыЗаявок
	|ИЗ
	|	РегистрСведений.СибурСтатусыЗаявок.СрезПоследних(
	|			,
	|			Заявка В
	|				(ВЫБРАТЬ
	|					ВТЗаявка.Заявка
	|				ИЗ
	|					ВТЗаявка КАК ВТЗаявка)) КАК СибурСтатусыЗаявокСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров20,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров40,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К45)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров45
	|ПОМЕСТИТЬ ВТКоличествоКонтейнеров
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТЗаявка.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И (ЗаявкаСоставУслуги.ПодтвержденоЗаказчику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаявка.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.ТипКТК, ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)) КАК ТипКТК,
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.ТипКТК.Наименование, """") КАК ТипКонтейнера,
	|	КОЛИЧЕСТВО(ЗаявкаСоставУслуги.ТипКТК) КАК КоличествоКонтейнеров
	|ПОМЕСТИТЬ ВТКонтейнеры
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТЗаявка.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И (ЗаявкаСоставУслуги.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка))
	|			И (ЗаявкаСоставУслуги.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаявка.Заявка,
	|	ЗаявкаСоставУслуги.ТипКТК,
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.ТипКТК.Наименование, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Заявка КАК Заявка,
	|	ВТКонтейнеры.ТипКТК КАК ТипКТК,
	|	ВТКонтейнеры.ТипКонтейнера КАК ТипКонтейнера
	|ПОМЕСТИТЬ ВТТипыКонтейнеров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТКонтейнеры.Заявка КАК Заявка,
	|		МАКСИМУМ(ВТКонтейнеры.КоличествоКонтейнеров) КАК КоличествоКонтейнеров
	|	ИЗ
	|		ВТКонтейнеры КАК ВТКонтейнеры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТКонтейнеры.Заявка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтейнеры КАК ВТКонтейнеры
	|		ПО ВложенныйЗапрос.Заявка = ВТКонтейнеры.Заявка
	|			И ВложенныйЗапрос.КоличествоКонтейнеров = ВТКонтейнеры.КоличествоКонтейнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	ЕСТЬNULL(Пользователи.Наименование, """") КАК ИмяМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК ТелефонМенеджера,
	|	ЕСТЬNULL(КонтактнаяИнформацияАдресЭлПочты.Представление, """") КАК АдресЭлПочтыМенеджера
	|ПОМЕСТИТЬ ВТКонтактыМенеджера
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|			ПО Пользователи.Ссылка = КонтактнаяИнформацияТелефон.Ссылка
	|				И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЭлПочты
	|			ПО Пользователи.Ссылка = КонтактнаяИнформацияАдресЭлПочты.Ссылка
	|				И (КонтактнаяИнформацияАдресЭлПочты.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ПО ВТЗаявка.Заявка.ОтветственныйМенеджер = Пользователи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	ВТЗаявка.RFQ_ID КАК RFQ_ID,
	|	ВТЗаявка.EXT_RFQ_ID КАК EXT_RFQ_ID,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров20 КАК КоличествоКонтейнеров20,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров40 КАК КоличествоКонтейнеров40,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров45 КАК КоличествоКонтейнеров45,
	|	ВТСтатусыЗаявок.СтатусЗаявки КАК СтатусЗаявки,
	|	ЕСТЬNULL(ВТСтатусыЗаявок.СтатусЗаявки.Код, """") КАК СтатусЗаявкиКод,
	|	ЕСТЬNULL(ВТСтатусыЗаявок.СтатусЗаявки.Наименование, """") КАК СтатусЗаявкиНаименование,
	|	ВТЗаявка.Комментарий КАК Комментарий,
	|	ВТСтатусыЗаявок.КодПричиныОтклоненияЗаявки КАК КодПричиныОтклоненияЗаявки,
	|	ЕСТЬNULL(ВТЗаявка.Заявка.Договор.Номер, """") КАК НомерДоговора,
	|	ВТЗаявка.НомерДоговораУЗаказчика КАК НомерДоговораУЗаказчика,
	|	ВЫБОР
	|		КОГДА ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВТЗаявка.Заявка.Организация.ОКПО
	|		ИНАЧЕ ЕСТЬNULL(ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация.ОКПО, """")
	|	КОНЕЦ КАК ОрганизацияОКПО,
	|	ВЫБОР
	|		КОГДА ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВТЗаявка.Заявка.Организация.НаименованиеПолное
	|		ИНАЧЕ ЕСТЬNULL(ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация.НаименованиеПолное, """")
	|	КОНЕЦ КАК ОрганизацияНаименование,
//Евросиб ( Литвинов 21.01.2021 #30025
	|	ВЫБОР
	|		КОГДА ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВТЗаявка.Заявка.Организация
	|		ИНАЧЕ ЕСТЬNULL(ВТЗаявка.Заявка.Организация.ГоловнаяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	КОНЕЦ КАК Организация,
	|	ВТЗаявка.Дата КАК Дата,
//Евросиб ) Литвинов 21.01.2021 #30025
	|	ВТТипыКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ВТЗаявка.НеобходимаяДатаПодачиПорожнегоСостава КАК НеобходимаяДатаПодачиПорожнегоСостава,
	|	ВТЗаявка.ПлановаяДатаОтправленияПорожнего КАК ПлановаяДатаОтправленияПорожнего,
	//Евросиб Каблов 25.10.2021 ( Ticket#0243051
	|	ВТЗаявка.ФактическаяДатаОтправленияПорожнегоРейса КАК ФактическаяДатаОтправленияПорожнегоРейса,
	//Евросиб Каблов 25.10.2021 )
	|	ВТЗаявка.КодСтанцииНазначенияГруженого КАК КодСтанцииНазначенияГруженого,
	|	ВТЗаявка.НазваниеСтанцииНазначенияГруженого КАК НазваниеСтанцииНазначенияГруженого,
	|	ВТЗаявка.КодКонечнойСтанцииНазначенияПриСухопутье КАК КодКонечнойСтанцииНазначенияПриСухопутье,
	|	ВТЗаявка.НазваниеКонечнойСтанцииНазначенияПриСухопутье КАК НазваниеКонечнойСтанцииНазначенияПриСухопутье,
	|	ВТЗаявка.КодПритерминальнойЖДСтанции КАК КодПритерминальнойЖДСтанции,
	|	ВТЗаявка.НазваниеПритерминальнойЖДСтанции КАК НазваниеПритерминальнойЖДСтанции,
	|	ВТКонтактыМенеджера.ИмяМенеджера КАК ИмяМенеджера,
	|	ВТКонтактыМенеджера.ТелефонМенеджера КАК ТелефонМенеджера,
	|	ВТКонтактыМенеджера.АдресЭлПочтыМенеджера КАК АдресЭлПочтыМенеджера,
	|	ЕСТЬNULL(ВТЗаявка.Заявка.ПортОтправления.КодПортаUNLOCODE, """") КАК ПортОтправленияКод,
	|	ЕСТЬNULL(ВТЗаявка.Заявка.ПортОтправления.Наименование, """") КАК ПортОтправленияНаименование,
	//Евросиб Каблов 04.08.2021 ( Ticket#0237548
	//|	ЕСТЬNULL(ВТЗаявка.Заявка.ПунктПеревалки.КодПоОКПО, """") КАК ПунктПеревалкиКод,
	|	ВЫБОР
	|		КОГДА ВТЗаявка.Заявка.ПунктПеревалки.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(ВТЗаявка.Заявка.ПунктПеревалки.КодПоОКПО, """")
	|		ИНАЧЕ ЕСТЬNULL(ВТЗаявка.Заявка.ПунктПеревалки.ВнешнийКодНерезидента, """")
	|	КОНЕЦ КАК ПунктПеревалкиКод,
	//Евросиб Каблов 04.08.2021 )
	|	ЕСТЬNULL(ВТЗаявка.Заявка.ПунктПеревалки.НаименованиеПолное, """") КАК ПунктПеревалкиНаименование,
	|	ВТЗаявка.ГрузополучательОКПО КАК ГрузополучательОКПО,
	|	ВТЗаявка.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТЗаявка.ДатаОтправкиПорожнихКонтейнеров КАК ДатаОтправкиПорожнихКонтейнеров,
	|	ВТЗаявка.ДатаПрибытияПорожнихКонтейнеров КАК ДатаПрибытияПорожнихКонтейнеров
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоКонтейнеров КАК ВТКоличествоКонтейнеров
	|		ПО ВТЗаявка.Заявка = ВТКоличествоКонтейнеров.Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатусыЗаявок КАК ВТСтатусыЗаявок
	|		ПО ВТЗаявка.Заявка = ВТСтатусыЗаявок.Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТипыКонтейнеров КАК ВТТипыКонтейнеров
	|		ПО ВТЗаявка.Заявка = ВТТипыКонтейнеров.Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтактыМенеджера КАК ВТКонтактыМенеджера
	|		ПО ВТЗаявка.Заявка = ВТКонтактыМенеджера.Заявка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьВладельцевКонтейнеровЗаявки(Заявка, Период)
	
	Запрос = Новый Запрос;
	//Евросиб Каблов 15.04.2022 ( Ticket#0268649
	Если Константы.ИспользоватьАРМКТК.Получить() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
		|ПОМЕСТИТЬ Контейнеры
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Заявка
		|	И ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК тек_Собственник
		|ПОМЕСТИТЬ Собственники
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			&Период,
		|			КТК В
		|				(ВЫБРАТЬ
		|					Контейнеры.НомерКТК КАК НомерКТК
		|				ИЗ
		|					Контейнеры КАК Контейнеры)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Собственники.тек_Собственник.Наименование КАК Собственник
		|ИЗ
		|	Собственники КАК Собственники";
	Иначе
	//Евросиб Каблов 15.04.2022 )
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Владельцы.ВладелецКТК.Наименование КАК Собственник
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецКТК
		|	ИЗ
		|		Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(&Период, ) КАК ПризнакСобственностиКонтейнераСрезПоследних
		|			ПО ЗаявкаСоставУслуги.НомерКТК = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
		|	ГДЕ
		|		ЗаявкаСоставУслуги.Ссылка = &Заявка
		|		И НЕ ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.Ссылка ЕСТЬ NULL) КАК Владельцы";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("Период", Период);
	
	Владельцы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Собственник");
	
	Возврат Владельцы;
	
КонецФункции

Функция ПолучитьВыборкуДислокационныхДанныхПоИдентификаторуКонтейнераЗаПериод(ДатаНачала, ДатаОкончания, ИдентификаторКонтейнера) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер,
	|	э_НакладнаяКонтейнеры.СобственникНаименование КАК СобственникНаименование,
	|	э_НакладнаяКонтейнеры.СобственникОКПО КАК СобственникОКПО
	|ПОМЕСТИТЬ ВТНакладныеПоЗаказчику
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|ГДЕ
	|	(э_НакладнаяКонтейнеры.Ссылка.Грузоотправитель = &Заказчик
	|			ИЛИ э_НакладнаяКонтейнеры.Ссылка.Грузополучатель = &Заказчик)
	|	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза <= &ДатаОкончанияНакладных
	|	И ВЫБОР
	|			КОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза >= &ДатаНачалаНакладных
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И э_НакладнаяКонтейнеры.НомерКонтейнера = &ИдентификаторКонтейнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	ТранспортныйДокумент.Ссылка КАК ЖДНакладная,
	|	ПоследняяНакладная.НомерКонтейнера КАК НомерКонтейнера,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.Грузоотправитель.ОКПО КАК ГрузоотправительКодПоОКПО,
	|	э_Накладная.Грузоотправитель.Наименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.Грузополучатель.ОКПО КАК ГрузополучательКодПоОКПО,
	|	э_Накладная.Грузополучатель.Наименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	э_Накладная.ДатаИстеченияСрокаДоставки КАК ДатаИстеченияСрокаДоставки,
	|	ПоследняяНакладная.Контейнер КАК Контейнер,
	|	ПоследняяНакладная.Контейнер.ТипТЕ.РазмерКТК.Наименование КАК РазмерКТК,
	|	ПоследняяНакладная.МассыВКгТары КАК МассыВКгТары,
	|	ПоследняяНакладная.МассыВКгНетто КАК МассыВКгНетто,
	|	э_Накладная.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	э_Накладная.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование,
	|	ПоследняяНакладная.СобственникНаименование КАК СобственникНаименование,
	|	ПоследняяНакладная.СобственникОКПО КАК СобственникОКПО,
	|	ТранспортныйДокумент.СтанцияОтправления КАК СтанцияОтправленияТД,
	|	ТранспортныйДокумент.СтанцияНазначения КАК СтанцияНазначенияТД,
	|	ТранспортныйДокумент.ДатаОтправления КАК ДатаОтправленияТД,
	|	ДОБАВИТЬКДАТЕ(ТранспортныйДокумент.ДатаОтправления, ДЕНЬ, -30) КАК НачалоПериодаОтправления,
	|	ДОБАВИТЬКДАТЕ(ТранспортныйДокумент.ДатаОтправления, ДЕНЬ, 30) КАК КонецПериодаОтправления
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТНакладные.Ссылка КАК Ссылка,
	|		ВТНакладные.Контейнер КАК Контейнер,
	|		ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|		ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|		ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|		ВТНакладные.СобственникНаименование КАК СобственникНаименование,
	|		ВТНакладные.СобственникОКПО КАК СобственникОКПО
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(ВТНакладные.ДатаИВремяОтправленияГруза) КАК ДатаИВремяОтправленияГруза,
	|			ВТНакладные.Контейнер КАК Контейнер
	|		ИЗ
	|			ВТНакладныеПоЗаказчику КАК ВТНакладные
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТНакладные.Контейнер) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладныеПоЗаказчику КАК ВТНакладные
	|			ПО ВложенныйЗапрос.ДатаИВремяОтправленияГруза = ВТНакладные.ДатаИВремяОтправленияГруза
	|				И ВложенныйЗапрос.Контейнер = ВТНакладные.Контейнер) КАК ПоследняяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|			ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	|		ПО ПоследняяНакладная.Ссылка = э_Накладная.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК Собственник,
	//Евросиб Каблов 15.04.2022 ( Ticket#0268649
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.Наименование КАК СобственникНаименование,
	//Евросиб Каблов 04.08.2021 ( Ticket#0237548
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.КодПоОКПО КАК СобственникКодПоОКПО,
	|	ВЫБОР
	|		КОГДА стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.КодПоОКПО, """")
	|		ИНАЧЕ ЕСТЬNULL(стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.ВнешнийКодНерезидента, """")
	|	КОНЕЦ КАК КодСобственника,
	//Евросиб Каблов 04.08.2021 )	
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.Наименование КАК СобственникНаименование,
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.КодПоОКПО КАК СобственникКодПоОКПО,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник.НаименованиеПолноеАнгл КАК СобственникНаименованиеПолноеАнгл
	|ПОМЕСТИТЬ ВТСобственникиКонтейнеров
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
	|			,
	|			КТК В
	|				(ВЫБРАТЬ
	|					Накладные.Контейнер
	|				ИЗ
	|					ВТНакладные КАК Накладные)) КАК стоки_ТекущиеДанныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.ЖДНакладная КАК ЖДНакладная,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон КАК Вагон,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.Контейнер.Префикс КАК КонтейнерПрефикс,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	//Евросиб Каблов 22.04.2021 ( Ticket#0223955
	//|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	//|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.СтанцияОперации В
	|				(ВЫБРАТЬ
	|					АналогиЛокаций.Локация
	|				ИЗ
	|					регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|				ГДЕ
	|					АналогиЛокаций.Аналог = ДислокацияКонтейнеров.СтанцияНазначения
	|	
	|				ОБЪЕДИНИТЬ ВСЕ
	|	
	|				ВЫБРАТЬ
	|					АналогиЛокаций.Аналог
	|				ИЗ
	|					регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|				ГДЕ
	|					АналогиЛокаций.Локация = ДислокацияКонтейнеров.СтанцияНазначения)
	|			ТОГДА ДислокацияКонтейнеров.СтанцияНазначения
	|		ИНАЧЕ ДислокацияКонтейнеров.СтанцияОперации
	|	КОНЕЦ КАК СтанцияОперации,
	//Евросиб Каблов 22.04.2021 )
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование,
	|	ДислокацияКонтейнеров.ДатаЗаписи КАК ДатаЗаписи
	|ПОМЕСТИТЬ ВТДислокация
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТНакладные.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|			И ВТНакладные.Контейнер = ДислокацияКонтейнеров.Контейнер
	|ГДЕ
	|	ДислокацияКонтейнеров.ДатаЗаписи МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеДатыЗаписейПаспортов.Контейнер КАК Контейнер,
	|	ПоследниеДатыЗаписейПаспортов.Период КАК Период,
	|	ПоследниеДатыЗаписейПаспортов.Вагон КАК Вагон,
	|	ПаспортаВагонов.Арендатор КАК Арендатор,
	|	ПаспортаВагонов.Арендатор.ОКПО КАК АрендаторОКПО,
	|	ПаспортаВагонов.Арендатор.Наименование КАК АрендаторНаименование,
	|	ПаспортаВагонов.Собственник КАК Собственник,
	|	ПаспортаВагонов.Собственник.ОКПО КАК СобственникОКПО,
	|	ПаспортаВагонов.Собственник.Наименование КАК СобственникНаименование
	|ПОМЕСТИТЬ ВТПаспортаВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТДислокация.Накладная КАК Накладная,
	|		ВТДислокация.Контейнер КАК Контейнер,
	|		ВТДислокация.Период КАК Период,
	|		ВТДислокация.Вагон КАК Вагон,
	|		МАКСИМУМ(ПаспортаВагонов.Период) КАК ПериодПаспорта
	|	ИЗ
	|		ВТДислокация КАК ВТДислокация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|			ПО ВТДислокация.Вагон = ПаспортаВагонов.Вагон
	|				И ВТДислокация.Период >= ПаспортаВагонов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТДислокация.Накладная,
	|		ВТДислокация.Контейнер,
	|		ВТДислокация.Период,
	|		ВТДислокация.Вагон) КАК ПоследниеДатыЗаписейПаспортов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|		ПО ПоследниеДатыЗаписейПаспортов.Вагон = ПаспортаВагонов.Вагон
	|			И ПоследниеДатыЗаписейПаспортов.ПериодПаспорта = ПаспортаВагонов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	СибурРазмещенныеЗаявки.Заявка КАК Заявка
	|ПОМЕСТИТЬ ВТРазмещенныеЗаявки
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|			ПО ЗаявкаСоставУслуги.Ссылка = СибурРазмещенныеЗаявки.Заявка
	|		ПО ВТНакладные.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|			И (ЗаявкаСоставУслуги.СтанцияОтправления = ВТНакладные.СтанцияОтправленияТД
	|				ИЛИ ЗаявкаСоставУслуги.СтанцияОтправления В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = ВТНакладные.СтанцияОтправленияТД
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = ВТНакладные.СтанцияОтправленияТД))
	|			И (ЗаявкаСоставУслуги.СтанцияНазначения = ВТНакладные.СтанцияНазначенияТД
	|				ИЛИ ЗаявкаСоставУслуги.СтанцияНазначения В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = ВТНакладные.СтанцияНазначенияТД
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = ВТНакладные.СтанцияНазначенияТД))
	|			И (ЗаявкаСоставУслуги.Ссылка.Отправка МЕЖДУ ВТНакладные.НачалоПериодаОтправления И ВТНакладные.КонецПериодаОтправления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная,
	|	ВТНакладные.Контейнер,
	|	СибурРазмещенныеЗаявки.Заявка
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|			ПО ЗаявкаСоставУслуги.Ссылка = СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых
	|		ПО ВТНакладные.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|			И (ЗаявкаСоставУслуги.СтанцияОтправления = ВТНакладные.СтанцияОтправленияТД
	|				ИЛИ ЗаявкаСоставУслуги.СтанцияОтправления В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = ВТНакладные.СтанцияОтправленияТД
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = ВТНакладные.СтанцияОтправленияТД))
	|			И (ЗаявкаСоставУслуги.СтанцияНазначения = ВТНакладные.СтанцияНазначенияТД
	|				ИЛИ ЗаявкаСоставУслуги.СтанцияНазначения В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = ВТНакладные.СтанцияНазначенияТД
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = ВТНакладные.СтанцияНазначенияТД))
	|			И (ЗаявкаСоставУслуги.Ссылка.Отправка МЕЖДУ ВТНакладные.НачалоПериодаОтправления И ВТНакладные.КонецПериодаОтправления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазмещенныеЗаявки.Накладная КАК Накладная,
	|	ВТРазмещенныеЗаявки.Контейнер КАК Контейнер,
	|	ВТРазмещенныеЗаявки.Заявка КАК Заявка,
	|	ВТРазмещенныеЗаявки.Заявка.Номер КАК ЗаявкаНомер,
	|	ВТРазмещенныеЗаявки.Заявка.Дата КАК ЗаявкаДата,
	|	ВТРазмещенныеЗаявки.Заявка.ВнешнийНомер КАК ЗаявкаВнешнийНомер,
	|	ВТРазмещенныеЗаявки.Заявка.ВнешняяДата КАК ЗаявкаВнешняяДата,
	//Евросиб Каблов 04.08.2021 ( Ticket#0237548
	//|	ВТРазмещенныеЗаявки.Заявка.Грузоотправитель.КодПоОКПО КАК ГрузоотправительКодПоОКПО,
	|	ВЫБОР
	|		КОГДА ВТРазмещенныеЗаявки.Заявка.Грузоотправитель.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(ВТРазмещенныеЗаявки.Заявка.Грузоотправитель.КодПоОКПО, """")
	|		ИНАЧЕ ЕСТЬNULL(ВТРазмещенныеЗаявки.Заявка.Грузоотправитель.ВнешнийКодНерезидента, """")
	|	КОНЕЦ КАК ГрузоотправительКодПоОКПО,
	//Евросиб Каблов 04.08.2021 )
	|	ВТРазмещенныеЗаявки.Заявка.Грузоотправитель.НаименованиеПолное КАК ГрузоотправительНаименование
	|ПОМЕСТИТЬ ВТЗаявки
	|ИЗ
	|	ВТРазмещенныеЗаявки КАК ВТРазмещенныеЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ВТНакладные.РазмерКТК КАК РазмерКТК,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ЕСТЬNULL(ВТЗаявки.ГрузоотправительКодПоОКПО, """") КАК ГрузоотправительКодПоОКПО,
	|	ЕСТЬNULL(ВТЗаявки.ГрузоотправительНаименование, """") КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательКодПоОКПО КАК ГрузополучательКодПоОКПО,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИстеченияСрокаДоставки КАК ДатаИстеченияСрокаДоставки,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|	ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|	ВТДислокация.Период КАК Период,
	|	ВТДислокация.ДатаЗаписи КАК ДатаЗаписиДислокации,
	|	ВТДислокация.НомерВагона КАК НомерВагона,
	|	ВТДислокация.ДлинаВагона КАК ДлинаВагона,
	|	ВТДислокация.ВидЖДПлатформы КАК ВидЖДПлатформы,
	|	ВТДислокация.ИндексПоезда КАК ИндексПоезда,
	|	ВТДислокация.КонтейнерНаименование КАК КонтейнерНаименование,
	|	ВТДислокация.КонтейнерПрефикс КАК КонтейнерПрефикс,
	|	ВТДислокация.ТипКонтейнера КАК ТипКонтейнера,
	|	ВТДислокация.СтанцияНазначенияКодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ВТДислокация.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование,
	//Евросиб Каблов 22.04.2021 ( Ticket#0223955
	//|	ВТДислокация.СтанцияОперацииКодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	//|	ВТДислокация.СтанцияОперацииНаименование КАК СтанцияОперацииНаименование,
	|	ВТДислокация.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ВТДислокация.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	//Евросиб Каблов 22.04.2021 )
	|	ВТДислокация.ОперацияСВагономКод КАК ОперацияСВагономКод,
	|	ВТДислокация.ОперацияСВагономНаименование КАК ОперацияСВагономНаименование,
	|	ВТНакладные.СтанцияНазначенияКод КАК СтанцияНазначенияНакладнойКод,
	|	ВТНакладные.СтанцияНазначенияНаименование КАК СтанцияНазначенияНакладнойНаименование,
	|	ВТНакладные.СобственникНаименование КАК СобственникНаименованиеВНакладной,
	|	ВТНакладные.СобственникОКПО КАК СобственникОКПОВНакладной,
	|	ЕСТЬNULL(ВТСобственникиКонтейнеров.КодСобственника, """") КАК КодСобственника,
	|	ЕСТЬNULL(ВТСобственникиКонтейнеров.СобственникНаименование, """") КАК СобственникНаименование,
	|	ЕСТЬNULL(ВТСобственникиКонтейнеров.СобственникНаименованиеПолноеАнгл, """") КАК СобственникНаименованиеПолноеАнгл,
	|	ВТПаспортаВагонов.Арендатор КАК ВагонАрендатор,
	|	ВТПаспортаВагонов.АрендаторОКПО КАК ВагонАрендаторКодПоОКПО,
	|	ВТПаспортаВагонов.АрендаторНаименование КАК ВагонАрендаторНаименование,
	|	ВТПаспортаВагонов.Собственник КАК ВагонСобственник,
	|	ВТПаспортаВагонов.СобственникОКПО КАК ВагонСобственникКодПоОКПО,
	|	ВТПаспортаВагонов.СобственникНаименование КАК ВагонСобственникНаименование,
	|	ВТЗаявки.Заявка КАК Заявка,
	|	ЕСТЬNULL(ВТЗаявки.ЗаявкаНомер, """") КАК ЗаявкаНомер,
	|	ЕСТЬNULL(ВТЗаявки.ЗаявкаДата, """") КАК ЗаявкаДата,
	|	ЕСТЬNULL(ВТЗаявки.ЗаявкаВнешнийНомер, """") КАК ЗаявкаВнешнийНомер
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаявки КАК ВТЗаявки
	|		ПО ВТНакладные.Накладная = ВТЗаявки.Накладная
	|			И ВТНакладные.Контейнер = ВТЗаявки.Контейнер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДислокация КАК ВТДислокация
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПаспортаВагонов КАК ВТПаспортаВагонов
	|			ПО ВТДислокация.Контейнер = ВТПаспортаВагонов.Контейнер
	|				И ВТДислокация.Вагон = ВТПаспортаВагонов.Вагон
	|				И ВТДислокация.Период = ВТПаспортаВагонов.Период
	|		ПО ВТНакладные.Накладная = ВТДислокация.Накладная
	|			И ВТНакладные.Контейнер = ВТДислокация.Контейнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСобственникиКонтейнеров КАК ВТСобственникиКонтейнеров
	|		ПО ВТНакладные.Контейнер = ВТСобственникиКонтейнеров.Контейнер";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачалаНакладных", ДобавитьМесяц(ДатаНачала, -1));
	Запрос.УстановитьПараметр("ДатаОкончанияНакладных", ДобавитьМесяц(ДатаОкончания, 1));
	Если ЗначениеЗаполнено(ИдентификаторКонтейнера) Тогда
		Запрос.УстановитьПараметр("ИдентификаторКонтейнера", ИдентификаторКонтейнера);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И э_НакладнаяКонтейнеры.НомерКонтейнера = &ИдентификаторКонтейнера", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Заказчик", Константы.СибурПаспортОрганизации.Получить());
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьСвойстваЗаявки(ОбъектXDTO)
	
	СвойстваЗаявки = Новый Структура;	
	//												Наименование поля	Тип данных	Описание	"Обязательное поле?"
	//Запрос (СИБУР -> ЛП):	Отправка заявки 		
	СвойстваЗаявки.Вставить("RFQ_ID");				//RFQ_ID	CHAR 21	Идентификатор заявки на перевозку из SAP TM  конкретному ЛП	Да
	СвойстваЗаявки.Вставить("EXT_RFQ_ID");			//EXT_RFQ_ID	CHAR 20	Идентификатор внешней заявки в ИС ЛП. 	
	СвойстваЗаявки.Вставить("RESP_STATUS_RFQ");		//RESP_STATUS_RFQ	CHAR 2	Код статуса заявки из справочника RESP_STATUS_RFQ	Да
	СвойстваЗаявки.Вставить("RESP_STATUS_RFQ_D");	//RESP_STATUS_RFQ_D	CHAR 20	Описание статуса заявки из справочника RESP_STATUS_RFQ	
	СвойстваЗаявки.Вставить("EST_END_DATETIME");	//EST_END_DATETIME	DATE(RUS03)	Дата крайнего срока ответа экспедитора 	Да
	СвойстваЗаявки.Вставить("RFQ_ITM_TYPE");		//RFQ_ITM_TYPE	CHAR 5	Вид закупки из справочника RFQ_ITM_TYPE 	Да
	СвойстваЗаявки.Вставить("RFQ_ITM_TYPE_D");		//RFQ_ITM_TYPE_D	CHAR 30	Описание вида закупки	
	СвойстваЗаявки.Вставить("TRADE_TYPE");			//TRADE_TYPE	CHAR 1	Вид отправки из справочника TRADE_TYPE	
	СвойстваЗаявки.Вставить("TRADE_TYPE_D");		//TRADE_TYPE_D	CHAR 15	Описание вида отправки	
	СвойстваЗаявки.Вставить("FAG_ID_DESR");			//FAG_ID_DESR	CHAR 60	Регистрационный номер договора с ЛП	
	СвойстваЗаявки.Вставить("ETA_CONT");			//ETA_CONT	DATE(RUS03)	Дата, к которой необходима подача порожнего состава на завод	Да
	СвойстваЗаявки.Вставить("ETD_PLANT");			//ETD_PLANT	DATE(RUS03)	Плановая дата отгрузки гружёного состава с завода	Да
	СвойстваЗаявки.Вставить("DEST_LOC");			//DEST_LOC	CHAR 20	Код станции назначения порожнего  (она же станция отправления груженого)	Да
	СвойстваЗаявки.Вставить("DEST_LOC_DESCR");		//DEST_LOC_DESCR	CHAR 255	Название станции назначения порожнего/станции отправления груженого	
	СвойстваЗаявки.Вставить("SHIPPER_ID");			//SHIPPER_ID	CHAR 20	Код ОКПО грузоотправителя по ЖД	Да
	СвойстваЗаявки.Вставить("SHIPPER_DESCR");		//SHIPPER_DESCR	CHAR 255	Описание грузоотправителя по ЖД	Да
	СвойстваЗаявки.Вставить("DEST_LOAD");			//DEST_LOAD	CHAR 255	Маршрут следования груженого поезда	Да		
	СвойстваЗаявки.Вставить("DEST_POINT");			//DEST_POINT	CHAR 20	Код станции назначения (конечная станция ж/д перевозки) .	
	СвойстваЗаявки.Вставить("DEST_POINT_D");		//DEST_POINT_D	CHAR 255	Описание станции назначения 	
	СвойстваЗаявки.Вставить("EXT_POINT");			//EXT_POINT	CHAR 20	Код конечной станции назначения при сухопутье	
	СвойстваЗаявки.Вставить("EXT_POINT_D");			//EXT_POINT_D	CHAR 255	Описание конечной станции назначения при сухопутье	
	СвойстваЗаявки.Вставить("TERM_LOC");			//TERM_LOC	CHAR 20	Код притерминальной ж/д станции. Сток ктк. 	
	СвойстваЗаявки.Вставить("TERM_LOC_DESCR");		//TERM_LOC_DESCR	CHAR 255	Название притерминальной ж/д станции. Сток ктк	
	СвойстваЗаявки.Вставить("ALL_CONTAINER_QUANT");	//ALL_CONTAINER_QUANT	QUAN 5	Общее кол-во запрашиваемых контейнеров в рамках одной заявки 	Да
	СвойстваЗаявки.Вставить("CONTAINER_QUANT_UOM");	//CONTAINER_QUANT_UOM	UNIT 6	ЕИ количества контейнеров из справочника QUANT_UOM	Да
	СвойстваЗаявки.Вставить("CONTAINER_MOT");		//CONTAINER_MOT	CHAR 4	Тип контейнеров из справочника CONTAINER_MOT	Да
	СвойстваЗаявки.Вставить("WEIGHT");				//WEIGHT	QUAN 31	Вес продукции (в расчете на один ктк)	Да
	СвойстваЗаявки.Вставить("WEIGHT_UOM");			//WEIGHT_UOM	UNIT 3	ЕИ Вес продукции  из справочника WEIGHT_UOM	Да		
	СвойстваЗаявки.Вставить("COMMENT");				//COMMENT	CHAR 255	Комментарий	
	СвойстваЗаявки.Вставить("TEND_MANAGER_DESCR");	//TEND_MANAGER_DESCR	CHAR 60	Контактное лицо со стороны Сибур	
	СвойстваЗаявки.Вставить("TEND_MANAGER_TEL");	//TEND_MANAGER_TEL	CHAR 20	Контактный телефон (лицо со стороны Сибур)	
	СвойстваЗаявки.Вставить("TEND_MANAGER_MAIL");	//TEND_MANAGER_MAIL	CHAR 50	Электронная почта почта (лицо со стороны Сибур)
	//Массив данных по нескольким направлениям
	СвойстваЗаявки.Вставить("FIN_LOC");				//FIN_LOC	CHAR 10	Страна назначения	
	СвойстваЗаявки.Вставить("FIN_LOC_DESCR");		//FIN_LOC_DESCR	CHAR 255	Описание направления/страна назначения
	СвойстваЗаявки.Вставить("CONTAINER_QUANT");		//CONTAINER_QUANT	QUAN 5	Общее кол-во запрашиваемых контейнеров в рамках одной заявки 	Да
	СвойстваЗаявки.Вставить("PACK");				//PACK	UNIT 2	Тип упаковки продукции из справочника PACK	
	СвойстваЗаявки.Вставить("PACK_D");				//PACK_D	CHAR 70	Описание типа упаковки
	//Массив данных по нескольким продуктам
	СвойстваЗаявки.Вставить("CARGO");				//CARGO	CHAR 20	Код груза (ЕТСНГ)	Да
	СвойстваЗаявки.Вставить("CARGO_DESCR");			//CARGO_DESCR	CHAR 60	Наименование груза (ЕТСНГ)	
	СвойстваЗаявки.Вставить("GNG_CODE");			//GNG_CODE	CHAR 8	Код груза (ГНГ) 	Да
	СвойстваЗаявки.Вставить("GNG_DESCR");			//GNG_DESCR	CHAR 50	Наименование груза (ГНГ)
	
	ЗаполнитьЗначенияСвойств(СвойстваЗаявки, ОбъектXDTO);
	
	Возврат СвойстваЗаявки;
	
КонецФункции

Функция ПолучитьКонтрагентаСибур()
	
	Возврат Константы.СибурКонтрагент.Получить();
	
КонецФункции

Функция ПолучитьОбъектXDTO(ПространствоИмен, ИмяТипаОбъекта) Экспорт
	
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипаОбъекта);
	Возврат ФабрикаXDTO.Создать(Тип);
	
КонецФункции

#КонецОбласти
