
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ПараметрыОТбора = Новый Структура;
	ПараметрыОТбора.Вставить("Отметка",истина);
	НайденныеСтроки = СписокКонтейнеров.НайтиСтроки(ПараметрыОТбора);
	Если НайденныеСтроки.Количество()>0 Тогда
		ОповеститьОВыборе(НайденныеСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Евросиб Каблов 09.04.2025 ( #105407
	ЗаполнитьСписокКонтейнеров();
	//Евросиб Каблов 09.04.2025 )
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
КонецПроцедуры

//Евросиб Каблов 09.04.2025 #105407
&НаСервере
Процедура ЗаполнитьСписокКонтейнеров()
	
	Если ПараметрыСоответствияКТК.Количество() = 0 И Параметры.Свойство("ТаблицаКТКВагонов") Тогда
		ПараметрыСоответствияКТК.Добавить(Параметры.ТаблицаКТКВагонов);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Контейнер КАК Контейнер,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Клиент КАК Клиент,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Договор КАК Договор,
	               |	СУММА(ВЫБОР
	               |			КОГДА СрокиИспользованияКонтейнеровСрезПоследних.ВозвратОтКлиента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту, ДЕНЬ, СрокиИспользованияКонтейнеровСрезПоследних.НормативВозвратаОтКлиента), &ТекущаяДата, ДЕНЬ)
	               |			ИНАЧЕ РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту, ДЕНЬ, СрокиИспользованияКонтейнеровСрезПоследних.НормативВозвратаОтКлиента), СрокиИспользованияКонтейнеровСрезПоследних.ВозвратОтКлиента, ДЕНЬ)
	               |		КОНЕЦ) КАК ДнейПросрочки,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту КАК ВыдачаКлиенту
	               |ИЗ
	               |	РегистрСведений.СрокиИспользованияКонтейнеров.СрезПоследних КАК СрокиИспользованияКонтейнеровСрезПоследних
	               |ГДЕ
	               |	(СрокиИспользованияКонтейнеровСрезПоследних.ДокументСделка ЕСТЬ NULL
	               |			ИЛИ СрокиИспользованияКонтейнеровСрезПоследних.ДокументСделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка))
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоКТК
	               |				ТОГДА СрокиИспользованияКонтейнеровСрезПоследних.Контейнер В (&МассивКТК)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Контейнер,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Клиент,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.Договор,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВЫБОР
	               |			КОГДА СрокиИспользованияКонтейнеровСрезПоследних.ВозвратОтКлиента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту, ДЕНЬ, СрокиИспользованияКонтейнеровСрезПоследних.НормативВозвратаОтКлиента), &ТекущаяДата, ДЕНЬ)
	               |			ИНАЧЕ РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(СрокиИспользованияКонтейнеровСрезПоследних.ВыдачаКлиенту, ДЕНЬ, СрокиИспользованияКонтейнеровСрезПоследних.НормативВозвратаОтКлиента), СрокиИспользованияКонтейнеровСрезПоследних.ВозвратОтКлиента, ДЕНЬ)
	               |		КОНЕЦ) > 0";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ОтборПоКТК", ТолькоКонтейнерыСделки = 0 И ПараметрыСоответствияКТК.Количество() > 0);
	МассивКТК = Новый Массив;
	Если ПараметрыСоответствияКТК.Количество() > 0 Тогда
		Для каждого Стр из ПараметрыСоответствияКТК[0].Значение Цикл
			МассивКТК.Добавить(Стр.Ключ);
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);
	ТЗ = Запрос.Выполнить().Выгрузить();
	СписокКонтейнеров.Загрузить(ТЗ);
	
	Если ПараметрыСоответствияКТК.Количество() > 0 Тогда
		Для каждого Стр из СписокКонтейнеров Цикл
			Стр.Вагон = ПараметрыСоответствияКТК[0].Значение[Стр.Контейнер];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

&НаКлиенте
Процедура ТолькоКонтейнерыСделкиПриИзменении(Элемент)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПриСозданииНаСервере(,);
	ЗаполнитьСписокКонтейнеров();
	//Евросиб Каблов 09.04.2025 )
	
КонецПроцедуры
