Процедура корр_ВвестиКорректировку(ЭтаФорма) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Если ТекД.КорректировкаРазрешена = ЛОЖЬ И ТекД.ИсправлениеРазрешено = ЛОЖЬ Тогда
		ПоказатьПредупреждение(, "Для данной строки не разрешена корректировка или исправление.");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекД.УчДокумент) И НЕ ЗначениеЗаполнено(ТекД.КорректировкаДокумента) Тогда
		ПоказатьПредупреждение(, "Вводить корректировку можно только на строку с реализацией.");
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ЭтаФорма.Объект.Организация);
	ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ЭтаФорма.Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	Если ТекД.ПериодВО >= ПериодБлокировки8 Тогда
		ПоказатьПредупреждение(, "Запрещен ввод корректировки на документы открытого периода!");
		Возврат;
	КонецЕсли;
	
	УжеНайденаСтрока = Ложь;
	НомерСтрокиКорректировки = 0;
	ВидОперацииАннулирование = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование");
	Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
		Если Стр.ГУИДИсправляемойСтроки = ТекД.ГУИД 
			//)
			//Евросиб - АСуслов 24.03.2022 14:40:56 #47182
			И НЕ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Стр.КорректировкаДокумента, "ВидОперации") = ВидОперацииАннулирование Тогда
			//)
			//Евросиб - АСуслов 24.03.2022 14:40:56 #47182
			УжеНайденаСтрока = Истина;
			НомерСтрокиКорректировки = Стр.НомерСтроки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если УжеНайденаСтрока Тогда
		ПоказатьПредупреждение(, "На данную строку уже введена корректировка в строке № " + НомерСтрокиКорректировки);
		Возврат;
	КонецЕсли;
	
	НовД = ЭтаФорма.Объект.Доходы.Вставить(ТекД.НомерСтроки);
	ЗаполнитьЗначенияСвойств(НовД, ТекД,, "УчДокумент, ГУИД, ГУИДСтрокиДохода, ГУИДИсправляемойСтроки, КорректировкаДокумента, КорректировкаВознаграждения");
	НовД.ГУИДИсправляемойСтроки = ТекД.ГУИД;
	НовД.ГУИД = Строка(Новый УникальныйИдентификатор);
	НовД.КорректировкаРазрешена = Ложь;
	НовД.ИсправлениеРазрешено = Ложь;
	НовД.КорректировкаВыполнена = Ложь;
	НовД.ИсправлениеВыполнено = Ложь;
	НовД.АннулированиеРазрешено = Ложь;
	НовД.АннулированиеВыполнено = Ложь;
	НовД.ПериодВО = ПериодБлокировки8;
	
	//Евросиб СубботинВ #122887 14.11.2025 Начало 
	//Евросиб СубботинВ #130097 13.02.2026 Начало
	КурсФрахт = Неопределено;
	Если 
		//ТекД.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.Фрахт")
		ЗначениеЗаполнено(ТекД.УчДокумент)
		и ТипЗнч(ТекД.УчДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг")и не ТекД.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль") Тогда
		КурсФрахт = КорректировкиРТУСервер.ПолучитьДанныеКурсаВалютыФрахтСтрокиРТУПоГуиду(ТекД.УчДокумент, ТекД.ГУИД);		
	КонецЕсли; 
	Если НЕ КурсФрахт = Неопределено Тогда
		НовД.ДатаКурсаВалюты = Неопределено;
		НовД.КурсВалюты = КурсФрахт;
   // Если ТекД.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль") Тогда
	ИначеЕсли ТекД.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль") Тогда 
	//Евросиб СубботинВ #130097 13.02.2026 Конец
		НовД.ДатаКурсаВалюты = Неопределено;
		НовД.КурсВалюты = 1;
		//Евросиб СубботинВ #130097 13.02.2026 Начало
	ИначеЕсли НЕ ТекД.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль")
		и НЕ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекД.Договор, "ВалютаВзаиморасчетов") = ТекД.Валюта Тогда
		НовД.ДатаКурсаВалюты = ?(ЗначениеЗаполнено(ТекД.УчДокумент), ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекД.УчДокумент, "ДатаКурса"), ТекД.ДатаКурсаВалюты);
		НовД.КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ТекД.Валюта, НовД.ДатаКурсаВалюты).Курс;
		//Евросиб СубботинВ #130097 13.02.2026 Конец
	Иначе
		Если ЗначениеЗаполнено(ТекД.УчДокумент) Тогда 
			РеквизитыУчДокумента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекД.УчДокумент,"КурсВзаиморасчетов, ДатаКурса");
			НовД.ДатаКурсаВалюты = РеквизитыУчДокумента.ДатаКурса;
			НовД.КурсВалюты = РеквизитыУчДокумента.КурсВзаиморасчетов;
		Иначе 
			НовД.ДатаКурсаВалюты = ТекД.ДатаКурсаВалюты;
			НовД.КурсВалюты = ТекД.КурсВалюты;
		КонецЕсли;
	КонецЕсли;
	//Евросиб СубботинВ #122887 14.11.2025 Конец
	
	Если ТекД.КорректировкаРазрешена Тогда ТекД.КорректировкаВыполнена = Истина; КонецЕсли;
	Если ТекД.ИсправлениеРазрешено Тогда ТекД.ИсправлениеВыполнено = Истина; КонецЕсли;
	
	Если ТипЗнч(ТекД.УчДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") И ТекД.Перевыставляемая И ЗначениеЗаполнено(ТекД.УчДокумент) Тогда
		
		ПТУ = неопределено;
		ГУИДРасходов = неопределено;
		Для каждого Стр из ЭтаФорма.Объект.СвязьДоходовИРасходов Цикл
			Если ТекД.ГУИД = Стр.Доходы Тогда
				
				Для каждого СтрР из ЭтаФорма.Объект.Расходы Цикл
					
					Если Стр.Расходы = СтрР.ГУИД Тогда
						ПТУ = СтрР.УчДокумент;
						ГУИДРасходов = СтрР.ГУИД;
					КонецЕсли;
						
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПТУ) Тогда
			
			НовыеДанныеПоступления = КорректировкиРТУСервер.ПолучитьНовыеДанныеПоступления(ПТУ, ГУИДРасходов);
			//ЗаполнитьЗначенияСвойств(НовД, НовыеДанныеПоступления);
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
			Если НовыеДанныеПоступления.ЕстьДанныеКоррПТУ Тогда
				ЗаполнитьЗначенияСвойств(НовД, НовыеДанныеПоступления);
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
			
		Иначе
			ПоказатьПредупреждение(, "Не удалось получить данные корректировки ПТУ. Укажите новые значения Поступления вручную или обратитесь в техподдержку.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура корр_ОтменитьКорректировку(ЭтаФорма) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекД.ГУИДИсправляемойСтроки) Тогда
		ПоказатьПредупреждение(, "Для отмены корректировки выберите корректировочную строку.");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаДокумента) ИЛИ ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		ПоказатьПредупреждение(, "Перед удалением корректировочной строки необходимо удалить созданные документы корректировки.");
		Возврат;
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("корр_ОтменитьКорректировку_ОтветДа", КорректировкиРТУКлиент, ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Вы действительно хотите удалить корректировочную строку?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура корр_ОтменитьКорректировку_ОтветДа(П1 = неопределено, ЭтаФорма = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	ГУИДРодителяУдаляемойСтроки = ТекД.ГУИДИсправляемойСтроки;
	
	ЭтаФорма.Объект.Доходы.Удалить(ТекД);
	
	Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
		Если Стр.ГУИД = ГУИДРодителяУдаляемойСтроки Тогда
			Стр.КорректировкаВыполнена = Ложь;
			Стр.ИсправлениеВыполнено = Ложь;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
//ок(
//Процедура корр_СоздатьДокументКорректировки(ЭтаФорма) Экспорт
//ок)
Процедура корр_СоздатьДокументКорректировки(ЭтаФорма, СоздатьCreditNote = Ложь, СоздатьСчет = Истина) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаДокумента) Тогда
		
		ОпОп = Новый ОписаниеОповещения("корр_СоздатьДокументКорректировки_ВопросОткрытияДа", КорректировкиРТУКлиент, ЭтаФорма);
		ПоказатьВопрос(ОпОп, "На выбранную строку уже созданы документы корректировки. Открыть их?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ТрансляцияГУИДовСтрокДоходов = Новый Соответствие;
	РежимДокумента = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
	ИсходныйДокумент = неопределено;     
	//Евросиб Дубская 01.03.2022 ( Ticket#0256935
	Корректировка = Неопределено;    
	ГУИД_Корректировка = "";  
	МассивКорректируемыхСтрок = Новый Массив;
	//Евросиб Дубская 01.03.2022 )
	//Евросиб СубботинВ #122887 14.11.2025 Начало
	Если Не ЗначениеЗаполнено(ТекД.КурсВалюты) и Не ЗначениеЗаполнено(ТекД.ДатаКурсаВалюты) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Введите дату или курс валюты в доходной строке"); 
		Возврат;
    КонецЕсли;
	КурсВалюты = Неопределено;
	ДатаКурса = Неопределено; 
	//Евросиб СубботинВ #122887 14.11.2025 Конец 
	
	
	//Евросиб Дубская 02.03.2022 ( Ticket#0256935
	//Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
	//	Если Стр.ГУИД = ТекД.ГУИДИсправляемойСтроки Тогда
	//		ИсходныйДокумент = Стр.УчДокумент;    
	//		ТрансляцияГУИДовСтрокДоходов.Вставить(ТекД.ГУИДИсправляемойСтроки, ТекД.ГУИД);
	//		РежимДокумента = ?(Стр.КорректировкаРазрешена, 
	//			ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение"),
	//			ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки")
	//			);
	//	КонецЕсли;
	//КонецЦикла;
	ГУИДИсправляемойСтроки = ТекД.ГУИДИсправляемойСтроки;   
	НеНашлиИсходныйДокумент = Истина;
	Пока НеНашлиИсходныйДокумент Цикл
		Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
			Если Стр.ГУИД = ГУИДИсправляемойСтроки Тогда 
				Если ЗначениеЗаполнено(Стр.КорректировкаДокумента) Тогда
					ГУИДИсправляемойСтроки = Стр.ГУИДИсправляемойСтроки; 
					Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
						Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
							ТрансляцияГУИДовСтрокДоходов.Вставить(Стр2.ГУИДИсправляемойСтроки, Стр2.ГУИД);
							//ДИТ Авдеева В.С. 47522 Начало 18.08.2022
							//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,КлючСтроки,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО");
							//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,КлючСтроки,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО,Валюта");
							//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, начало
							НовСтрКорр = ПолучитьСтруктуруПараметровСтрокиКорректировки();
							НовСтрКорр.НДСВклВСтоимость = Стр2.НДСВключенВСтоимость;
							//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, конец
							НовСтрКорр.Валюта = Стр2.Валюта;
							//ДИТ Авдеева В.С. 47522 Конец 18.08.2022
							НовСтрКорр.Номенклатура = Стр2.Услуга;
							НовСтрКорр.ПериодВО = Стр2.ПериодВО;
							НовСтрКорр.Содержание = "";
							НовСтрКорр.Количество = Стр2.Количество;
							НовСтрКорр.Цена = Стр2.Ставка;
							НовСтрКорр.Сумма = Стр2.СтавкаИтого;
							НовСтрКорр.СтавкаНДС = Стр2.СтавкаНДС;
							НовСтрКорр.СуммаНДС = Стр2.СуммаНДС;
							НовСтрКорр.Всего = Стр2.СуммаИтого;
							НовСтрКорр.СписокТС = Стр2.СписокВагонов;
							НовСтрКорр.СписокТЕ = Стр2.СписокКТК;
							НовСтрКорр.СписокТД = Стр2.СписокТД;
							НовСтрКорр.СтрокаДоходовСделки = Стр2.ГУИД;
							НовСтрКорр.ЕстьВДокументеРеализации = Истина; 
							НовСтрКорр.СтрокаДоходовСделкиДоИзменения = Стр.ГУИД;   
							Если ЗначениеЗаполнено(Стр.КорректировкаДокумента) Тогда
								Корректировка = Стр.КорректировкаДокумента;    
								ГУИД_Корректировка = Стр.ГУИД;
							КонецЕсли;
							ДокументОснование = ?(ЗначениеЗаполнено(Стр.УчДокумент), Стр.УчДокумент, Стр.КорректировкаДокумента);
							ДанныеПервичногоДокумента = КорректировкиРТУСервер.ПолучитьДанныеПервичногоДокумента(ДокументОснование, Стр.ГУИД);
							ЗаполнитьЗначенияСвойств(НовСтрКорр, ДанныеПервичногоДокумента,, "СписокТС, СписокТЕ, СписокТД");
							НовСтрКорр.КоличествоДоКорректировки = Стр.Количество;
							НовСтрКорр.ЦенаДоКорректировки = Стр.Ставка;
							НовСтрКорр.СуммаДоКорректировки = Стр.СуммаИтого;
							НовСтрКорр.СуммаНДСДоКорректировки = Стр.СтавкаНДС;
							НовСтрКорр.ВсегоДоКорректировки = Стр.СуммаИтого;
							НовСтрКорр.Содержание = НовСтрКорр.СодержаниеДоИзменения;
							//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
							НовСтрКорр.ДатаОказанияУслуги = Стр2.ДатаОказанияУслуги;
							//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
							//Евросиб СубботинВ #126796 22.12.2025 Начало
							НовСтрКорр.ДатаКурсаВалюты = Стр2.ДатаКурсаВалюты;
							НовСтрКорр.КурсВалюты = Стр2.КурсВалюты;
							//Евросиб СубботинВ #126796 22.12.2025 Конец
							МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
						КонецЕсли;
					КонецЦикла;
				Иначе
					ИсходныйДокумент = Стр.УчДокумент;
					////Евросиб СубботинВ #122887 14.11.2025 Начало
					//КурсВалюты = ТекД.КурсВалюты;
					//ДатаКурса = ТекД.ДатаКурсаВалюты;
					////Евросиб СубботинВ #122887 14.11.2025 Конец 
					ТрансляцияГУИДовСтрокДоходов.Вставить(ТекД.ГУИДИсправляемойСтроки, ТекД.ГУИД);
					РежимДокумента = ?(Стр.КорректировкаРазрешена, 
					ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение"),
					ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки")
					);       
					НеНашлиИсходныйДокумент = Ложь;  
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;                            
	КонецЦикла;
	//Евросиб Дубская 02.03.2022 )
		
	//Евросиб Дубская 03.03.2022 ( Ticket#0256935
	//МассивКорректируемыхСтрок = Новый Массив; 
	//Евросиб Дубская 03.03.2022 )     
	
	Для каждого Стр из ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("УчДокумент", ИсходныйДокумент)) Цикл
		Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
			Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
				//++ДИТ_Коробов_Task 48097_02.03.22
				ТрансляцияГУИДовСтрокДоходов.Вставить(Стр2.ГУИДИсправляемойСтроки, Стр2.ГУИД);
				//--ДИТ_Коробов_Task 48097_02.03.22
				//ДИТ Авдеева В.С. 47522 Начало 18.08.2022
				//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,КлючСтроки,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО");
				//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,КлючСтроки,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО,Валюта");
				//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, начало
				НовСтрКорр = ПолучитьСтруктуруПараметровСтрокиКорректировки();
				НовСтрКорр.НДСВклВСтоимость = Стр2.НДСВключенВСтоимость;
				//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, конец

				НовСтрКорр.Валюта = Стр2.Валюта;
				//ДИТ Авдеева В.С. 47522 Конец 18.08.2022
				
				НовСтрКорр.Номенклатура = Стр2.Услуга;
				
				НовСтрКорр.ПериодВО = Стр2.ПериодВО;
				
				НовСтрКорр.Содержание = "";
				НовСтрКорр.Количество = Стр2.Количество;
				НовСтрКорр.Цена = Стр2.Ставка;
				//++ Зубов Ticket#0249371 09.11.2021
				//НовСтрКорр.Сумма = Стр2.СуммаИтого;
				НовСтрКорр.Сумма = Стр2.СтавкаИтого;
				//-- Зубов Ticket#0249371 09.11.2021
				НовСтрКорр.СтавкаНДС = Стр2.СтавкаНДС;
				НовСтрКорр.СуммаНДС = Стр2.СуммаНДС;
				НовСтрКорр.Всего = Стр2.СуммаИтого;
				
				НовСтрКорр.СписокТС = Стр2.СписокВагонов;
				НовСтрКорр.СписокТЕ = Стр2.СписокКТК;
				НовСтрКорр.СписокТД = Стр2.СписокТД;
				НовСтрКорр.СтрокаДоходовСделки = Стр2.ГУИД;
				НовСтрКорр.ЕстьВДокументеРеализации = Истина; 
				НовСтрКорр.СтрокаДоходовСделкиДоИзменения = НайтиПервичныйГУИД(Стр.ГУИД, ЭтаФорма.Объект.Доходы);   
				//Евросиб Дубская 17.02.2022 ( Ticket#0256935
				Если ЗначениеЗаполнено(Стр.КорректировкаДокумента) Тогда
					Корректировка = Стр.КорректировкаДокумента;    
					ГУИД_Корректировка = Стр.ГУИД;
				КонецЕсли;
				//Евросиб Дубская 17.02.2022 )
				
				ДокументОснование = ?(ЗначениеЗаполнено(Стр.УчДокумент), Стр.УчДокумент, Стр.КорректировкаДокумента);
				ДанныеПервичногоДокумента = КорректировкиРТУСервер.ПолучитьДанныеПервичногоДокумента(ДокументОснование, Стр.ГУИД);
				
				ЗаполнитьЗначенияСвойств(НовСтрКорр, ДанныеПервичногоДокумента,, "СписокТС, СписокТЕ, СписокТД");
				
				НовСтрКорр.КоличествоДоКорректировки = Стр.Количество;
				НовСтрКорр.ЦенаДоКорректировки = Стр.Ставка;
				НовСтрКорр.СуммаДоКорректировки = Стр.СуммаИтого;
				НовСтрКорр.СуммаНДСДоКорректировки = Стр.СтавкаНДС;
				НовСтрКорр.ВсегоДоКорректировки = Стр.СуммаИтого;
				
				НовСтрКорр.Содержание = НовСтрКорр.СодержаниеДоИзменения;
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
				НовСтрКорр.ДатаОказанияУслуги = Стр2.ДатаОказанияУслуги;
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
				//Евросиб СубботинВ #126796 22.12.2025 Начало
				НовСтрКорр.ДатаКурсаВалюты = Стр2.ДатаКурсаВалюты;
				НовСтрКорр.КурсВалюты = Стр2.КурсВалюты;
				//Евросиб СубботинВ #126796 22.12.2025 Конец
				
				МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Шейко О.Е. (16.03.2021) Передаем всю ТЧ Учетных единиц
	МасУчЕдиниц = Новый Массив;
	Для каждого Стр Из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		
		Дан = Новый Структура("Контейнер,Вагон,Калькуляция,НомерЖДН,ЖДН,Коносамент,Груз,СтанцияОтправления,СтанцияНазначения,ГУИД,Ссылка,ВесГрузаНетто,Заявка") ;
		ЗаполнитьЗначенияСвойств(Дан, Стр);
		Дан.СтанцияОтправления 	= ЭтаФорма.Объект.СтанцияОтправления;
		Дан.СтанцияНазначения 	= ЭтаФорма.Объект.СтанцияНазначения;
		Дан.Ссылка				= ЭтаФорма.Объект.Ссылка;
		
		МасУчЕдиниц.Добавить(Дан);
	
	КонецЦикла; 
//Евросиб Дубская 01.03.2022 ( Ticket#0256935	
////ДИТ Давудов М.А. Task32744 03.07.2021 Начало
////ок(
////	НоваяРТУ = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимДокумента, Ложь, ТрансляцияГУИДовСтрокДоходов);
////ок)
//	НоваяРТУ = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимДокумента, Ложь, ТрансляцияГУИДовСтрокДоходов, СоздатьCreditNote, ТекД.ПСЦ, ТекД.Коносамент);
////ДИТ Давудов М.А. Task32744 03.07.2021 Конец
	НоваяРТУ = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимДокумента, Ложь, ТрансляцияГУИДовСтрокДоходов, СоздатьCreditNote, ТекД.ПСЦ, ТекД.Коносамент, Корректировка);
	//Евросиб Дубская 01.03.2022 )	
	//Евросиб - АСуслов 17.03.2022 17:10:24 #
	//(   
	Если НоваяРТУ <> Неопределено И СоздатьСчет Тогда //Евросиб Шевченко А.В. US 112687 TA 123181 25.11.2025
		КорректировкиРТУСервер.СоздатьСчетПоКорректировке(НоваяРТУ);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.03.2022 17:10:25 #
	Для каждого Стр из ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("УчДокумент", ИсходныйДокумент)) Цикл
		Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл   
			//Евросиб Дубская 01.03.2022 ( Ticket#0256935
			Если ЗначениеЗаполнено(Корректировка) Тогда 
				Если Стр2.ГУИДИсправляемойСтроки = ГУИД_Корректировка Тогда
					Стр2.КорректировкаДокумента = НоваяРТУ;
				КонецЕсли;
			Иначе
			//Евросиб Дубская 01.03.2022 )	
			Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
			
				Стр2.КорректировкаДокумента = НоваяРТУ;
				
			КонецЕсли; 
			//Евросиб Дубская 01.03.2022 ( Ticket#0256935
		    КонецЕсли;
		    //Евросиб Дубская 01.03.2022 )	
		КонецЦикла;
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("корр_СоздатьДокументКорректировки_ВопросОткрытияДа", КорректировкиРТУКлиент, ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Созданы документы корректировок. Открыть их?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, начало
Функция ПолучитьСтруктуруПараметровСтрокиКорректировки()
	Результат = Новый Структура();
	Результат.Вставить("СтрокаДоходовСделкиДоИзменения");
	Результат.Вставить("Номенклатура");
	Результат.Вставить("КлючСтроки");
	Результат.Вставить("Содержание");
	Результат.Вставить("Количество");
	Результат.Вставить("Цена");
	Результат.Вставить("Сумма");
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("СодержаниеДоИзменения");
	Результат.Вставить("КоличествоДоИзменения");
	Результат.Вставить("ЦенаДоИзменения");
	Результат.Вставить("СуммаДоИзменения");
	Результат.Вставить("СуммаНДСДоИзменения");
	Результат.Вставить("СтавкаНДСДоИзменения");
	Результат.Вставить("КоличествоДоКорректировки");
	Результат.Вставить("ЦенаДоКорректировки");
	Результат.Вставить("СуммаДоКорректировки");
	Результат.Вставить("СуммаНДСДоКорректировки");
	Результат.Вставить("СписокТС");
	Результат.Вставить("СписокТЕ");
	Результат.Вставить("СписокТД");
	Результат.Вставить("СтрокаДоходовСделки");
	Результат.Вставить("ЕстьВДокументеРеализации");
	Результат.Вставить("ВсегоДоКорректировки");
	Результат.Вставить("ВсегоДоИзменения");
	Результат.Вставить("Всего");
	Результат.Вставить("ПериодВО");
	Результат.Вставить("Валюта");
	Результат.Вставить("НДСВклВСтоимость");
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	Результат.Вставить("ДатаОказанияУслуги");
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
	//Евросиб СубботинВ #126796 22.12.2025 Начало 
	Результат.Вставить("ДатаКурсаВалюты");
	Результат.Вставить("КурсВалюты");
	//Евросиб СубботинВ #126796 22.12.2025 Конец
	
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0324963, 15-09-2023, конец

Процедура корр_СоздатьКорректировкуВознаграждения(ЭтаФорма) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		
		ОпОп = Новый ОписаниеОповещения("корр_СоздатьДокументКорректировки_ВопросОткрытияДа", КорректировкиРТУКлиент, ЭтаФорма);
		ПоказатьВопрос(ОпОп, "На выбранную строку уже созданы документы корректировки. Открыть их?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ТрансляцияГУИДовСтрокДоходов = Новый Соответствие;
	РежимДокумента = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
	ИсходныйДокумент = неопределено;
	Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
		Если Стр.ГУИД = ТекД.ГУИДИсправляемойСтроки Тогда
			ИсходныйДокумент = Стр.УчДокумент;
			ТрансляцияГУИДовСтрокДоходов.Вставить(ТекД.ГУИДИсправляемойСтроки, ТекД.ГУИД);
			РежимДокумента = ?(Стр.КорректировкаРазрешена, 
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение"),
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки")
				);
		КонецЕсли;
	КонецЦикла;
	
	ПредыдущееВознаграждение = Новый Структура("Сумма, СтавкаНДС, СуммаНДС", 0, неопределено, 0);
	Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		ПредыдущееВознаграждение = КорректировкиРТУСервер.ПолучитьПредыдущееВознаграждение(ИсходныйДокумент);
	КонецЕсли;
	
	УсловияВознагражденияОтчета = КорректировкиРТУСервер.ПолучитьУсловияВознагражденияОтчета(ИсходныйДокумент);
	
	Если НЕ ЗначениеЗаполнено(УсловияВознагражденияОтчета.СпособРасчетаКомиссионногоВознаграждения) Тогда
		ПоказатьПредупреждение(, "Не удалось получить настройки Отчета агента. Обратитесь в техподдержку.");
		Возврат;
	КонецЕсли;
	
	МассивКорректируемыхСтрок = Новый массив;
	
	Для каждого Стр из ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("УчДокумент", ИсходныйДокумент)) Цикл
		Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
			Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
				//++ДИТ_Коробов_Task 48097_02.03.22
				ТрансляцияГУИДовСтрокДоходов.Вставить(Стр2.ГУИДИсправляемойСтроки, Стр2.ГУИД);
				//--ДИТ_Коробов_Task 48097_02.03.22
				//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО");
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
				НовСтрКорр = ПолучитьСтруктуруПараметровСтрокиКорректировки();
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
				НовСтрКорр.Номенклатура = УсловияВознагражденияОтчета.УслугаПоВознаграждению;
				
				НовСтрКорр.ПериодВО = Стр2.ПериодВО;
				
				НовСтрКорр.Содержание = УсловияВознагражденияОтчета.ОписаниеУслуги;
				НовСтрКорр.Количество = Стр2.Количество;
				НовСтрКорр.Цена = Стр2.Ставка * УсловияВознагражденияОтчета.ПроцентКомиссионногоВознаграждения / 100;
				НовСтрКорр.Сумма = НовСтрКорр.Количество * НовСтрКорр.Цена;
				НовСтрКорр.СтавкаНДС = УсловияВознагражденияОтчета.СтавкаНДСВознаграждения;
				НовСтрКорр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтрКорр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтрКорр.СтавкаНДС) , Истина, УсловияВознагражденияОтчета.СуммаВознагражденияВключаетНДС);
				НовСтрКорр.Всего = ?(УсловияВознагражденияОтчета.СуммаВознагражденияВключаетНДС, НовСтрКорр.Сумма, НовСтрКорр.Сумма+НовСтрКорр.СуммаНДС);
				
				НовСтрКорр.СписокТС = Стр2.СписокВагонов;
				НовСтрКорр.СписокТЕ = Стр2.СписокКТК;
				НовСтрКорр.СписокТД = Стр2.СписокТД;
				НовСтрКорр.СтрокаДоходовСделки = Стр2.ГУИД;
				НовСтрКорр.ЕстьВДокументеРеализации = Истина;
				НовСтрКорр.СтрокаДоходовСделкиДоИзменения = НайтиПервичныйГУИД(Стр.ГУИД, ЭтаФорма.Объект.Доходы);
				
				ДокументОснование = ?(ЗначениеЗаполнено(Стр.УчДокумент), Стр.УчДокумент, Стр.КорректировкаВознаграждения);
				ДанныеПервичногоДокумента = КорректировкиРТУСервер.ПолучитьДанныеПервичногоДокумента(ДокументОснование, Стр.ГУИД);
				
				//ЗаполнитьЗначенияСвойств(НовСтрКорр, ДанныеПервичногоДокумента);
				
				НовСтрКорр.КоличествоДоИзменения = 1; //Стр.Количество;
				НовСтрКорр.ЦенаДоИзменения = ПредыдущееВознаграждение.Сумма; //Стр.Ставка;
				НовСтрКорр.СуммаДоИзменения = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
				НовСтрКорр.СуммаНДСДоИзменения = ПредыдущееВознаграждение.СуммаНДС; //Стр.СтавкаНДС;
				// Евросиб US 130623 TA 130624 Рыбьяков К.А. 10.02.2026 ((
				НовСтрКорр.ВсегоДоИзменения = ?(УсловияВознагражденияОтчета.СуммаВознагражденияВключаетНДС, 
								ПредыдущееВознаграждение.Сумма, ПредыдущееВознаграждение.Сумма + ПредыдущееВознаграждение.СуммаНДС);
				//НовСтрКорр.ВсегоДоИзменения = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
				// Евросиб Рыбьяков К.А. 10.02.2026 ))
				НовСтрКорр.СтавкаНДСДоИзменения = УсловияВознагражденияОтчета.СтавкаНДСВознаграждения;
				
				НовСтрКорр.КоличествоДоКорректировки = 1; //Стр.Количество;
				НовСтрКорр.ЦенаДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.Ставка;
				НовСтрКорр.СуммаДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
				НовСтрКорр.СуммаНДСДоКорректировки = ПредыдущееВознаграждение.СуммаНДС; //Стр.СтавкаНДС;
				НовСтрКорр.ВсегоДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
				
				//НовСтрКорр.Содержание = НовСтрКорр.СодержаниеДоИзменения;
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
				НовСтрКорр.ДатаОказанияУслуги = Стр2.ДатаОказанияУслуги;
				//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
				МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
				
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Шейко О.Е. (16.03.2021) Передаем всю ТЧ Учетных единиц
	МасУчЕдиниц = Новый Массив;
	Для каждого Стр Из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		
		Дан = Новый Структура("Контейнер,Вагон,Калькуляция,НомерЖДН,ЖДН,Коносамент,Груз,СтанцияОтправления,СтанцияНазначения,ГУИД,Ссылка,ВесГрузаНетто,Заявка") ;
		ЗаполнитьЗначенияСвойств(Дан, Стр);
		Дан.СтанцияОтправления = ЭтаФорма.Объект.СтанцияОтправления;
		Дан.СтанцияНазначения = ЭтаФорма.Объект.СтанцияНазначения;
		
		МасУчЕдиниц.Добавить(Дан);
	
	КонецЦикла; 
	
	НоваяРТУ = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимДокумента, Истина, ТрансляцияГУИДовСтрокДоходов);
	
	Для каждого Стр из ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("УчДокумент", ИсходныйДокумент)) Цикл
		Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
			Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
				
				Стр2.КорректировкаВознаграждения = НоваяРТУ;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Стр из ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("КорректировкаВознаграждения", ИсходныйДокумент)) Цикл
		Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
			Если Стр2.ГУИДИсправляемойСтроки = Стр.ГУИД Тогда
				
				Стр2.КорректировкаВознаграждения = НоваяРТУ;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("корр_СоздатьДокументКорректировки_ВопросОткрытияДа", КорректировкиРТУКлиент, ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Созданы документы корректировок. Открыть их?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Функция НайтиПервичныйГУИД(КоррГУИД, Доходы)
	
	Результат = КоррГУИД;
	НайденБолееРаннийГУИД = Истина;
	БолееРаннийГУИД = "";
	Пока НайденБолееРаннийГУИД = Истина Цикл
		НайденБолееРаннийГУИД = Ложь;
		Для каждого Стр из Доходы Цикл
			Если Стр.ГУИД = Результат И ЗначениеЗаполнено(Стр.ГУИДИсправляемойСтроки) Тогда
				Результат = Стр.ГУИДИсправляемойСтроки;
				НайденБолееРаннийГУИД = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура корр_СоздатьДокументКорректировки_ВопросОткрытияДа(П1 = неопределено, ЭтаФорма = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаДокумента) Тогда
		ПоказатьЗначение(, ТекД.КорректировкаДокумента);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		ПоказатьЗначение(, ТекД.КорректировкаВознаграждения);
	КонецЕсли;
		
КонецПроцедуры

Процедура корр_СоздатьДокументКорректировки_ВопросОткрытияДа2(П1 = неопределено, РТУ = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ПоказатьЗначение(, РТУ);
		
КонецПроцедуры

Процедура корр_УдалитьДокументКорректировки(ЭтаФорма) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаДокумента) ИЛИ ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		
		ОпОп = Новый ОписаниеОповещения("корр_УдалитьДокументКорректировки_ВопросУдаленияДа", КорректировкиРТУКлиент, ЭтаФорма);
		ПоказатьВопрос(ОпОп, "Вы действительно хотите удалить созданные корректировки РТУ?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	Иначе
		
		ПоказатьПредупреждение(, "Нет корректировок РТУ для удаления.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура корр_УдалитьДокументКорректировки_ВопросУдаленияДа(П1 = неопределено, ЭтаФорма = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаДокумента) Тогда
		КорректировкиРТУСервер.УдалитьКорректировкуРТУ(ТекД.КорректировкаДокумента);
		ТекД.КорректировкаДокумента = неопределено;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		КорректировкиРТУСервер.УдалитьКорректировкуРТУ(ТекД.КорректировкаВознаграждения);
		ТекД.КорректировкаВознаграждения = неопределено;		
	КонецЕсли;
	
КонецПроцедуры

Процедура корр_СоздатьАннулированиеРеализации(ЭтаФорма) Экспорт
	
	ТекД = ЭтаФорма.Элементы.Доходы.ТекущиеДанные;
	
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Если ТекД.АннулированиеРазрешено = ЛОЖЬ И НЕ КорректировкиРТУСервер.РольБухгалтераДоступна() И НЕ КорректировкиРТУСервер.РольПолныеПраваДоступна() Тогда
		ПоказатьПредупреждение(, "Для данной строки не разрешено аннулирование.");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекД.УчДокумент) И НЕ ЗначениеЗаполнено(ТекД.КорректировкаДокумента) И НЕ ЗначениеЗаполнено(ТекД.КорректировкаВознаграждения) Тогда
		ПоказатьПредупреждение(, "Нет документов для аннулирования.");
		Возврат;
	КонецЕсли;
	
	УжеНайденаСтрока = Ложь;
	НомерСтрокиКорректировки = 0;
	Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
		Если Стр.ГУИДИсправляемойСтроки = ТекД.ГУИД Тогда
			УжеНайденаСтрока = Истина;
			НомерСтрокиКорректировки = Стр.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	Если УжеНайденаСтрока Тогда
		ПоказатьПредупреждение(, "На данную строку уже введена корректировка в строке № " + НомерСтрокиКорректировки);
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ЭтаФорма.Объект.Организация);
	ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ЭтаФорма.Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	НовД = ЭтаФорма.Объект.Доходы.Вставить(ТекД.НомерСтроки);
	ЗаполнитьЗначенияСвойств(НовД, ТекД,, "УчДокумент,ГУИД,ГУИДСтрокиДохода,ГУИДИсправляемойСтроки,КорректировкаДокумента,КорректировкаВознаграждения,Себестоимость,Вознаграждение,Ставка,Количество,СебестоимостьИтого,ВознаграждениеИтого,СтавкаИтого,Рентабельность,СуммаНДС,СуммаИтого,ЗадачаГотовностиКВыставлению");
	НовД.ГУИДИсправляемойСтроки = ТекД.ГУИД;
	НовД.ГУИД = Строка(Новый УникальныйИдентификатор);
	НовД.КорректировкаРазрешена = Ложь;
	НовД.ИсправлениеРазрешено = Ложь;
	НовД.КорректировкаВыполнена = Ложь;
	НовД.ИсправлениеВыполнено = Ложь;
	НовД.ПериодВО = ПериодБлокировки8;
	Если ТекД.АннулированиеРазрешено Тогда ТекД.АннулированиеВыполнено = Истина; КонецЕсли;
	
	///////////////
	
	МассивКорректируемыхСтрок = Новый массив;
	
	//НовСтрКорр = Новый Структура("СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО");
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	НовСтрКорр = ПолучитьСтруктуруПараметровСтрокиКорректировки();
	НовСтрКорр.ДатаОказанияУслуги = НовД.ДатаОказанияУслуги;
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
	НовСтрКорр.Номенклатура = НовД.Услуга;
	
	НовСтрКорр.ПериодВО = НовД.ПериодВО;
	
	НовСтрКорр.Содержание = "";
	НовСтрКорр.Количество = НовД.Количество;
	НовСтрКорр.Цена = НовД.Ставка;
	НовСтрКорр.Сумма = НовД.СуммаИтого;
	НовСтрКорр.СтавкаНДС = НовД.СтавкаНДС;
	НовСтрКорр.СуммаНДС = НовД.СуммаНДС;
	НовСтрКорр.Всего = НовД.СуммаИтого;
	
	НовСтрКорр.СписокТС = НовД.СписокВагонов;
	НовСтрКорр.СписокТЕ = НовД.СписокКТК;
	НовСтрКорр.СписокТД = НовД.СписокТД;
	НовСтрКорр.СтрокаДоходовСделки = НовД.ГУИД;
	НовСтрКорр.ЕстьВДокументеРеализации = Истина;
	НовСтрКорр.СтрокаДоходовСделкиДоИзменения = НайтиПервичныйГУИД(ТекД.ГУИД, ЭтаФорма.Объект.Доходы);
	
	ДокументОснование = ?(ЗначениеЗаполнено(ТекД.УчДокумент), ТекД.УчДокумент, ТекД.КорректировкаДокумента);
	ДанныеПервичногоДокумента = КорректировкиРТУСервер.ПолучитьДанныеПервичногоДокумента(ДокументОснование, ТекД.ГУИД);
	
	ЗаполнитьЗначенияСвойств(НовСтрКорр, ДанныеПервичногоДокумента);
	
	НовСтрКорр.КоличествоДоКорректировки = ТекД.Количество;
	НовСтрКорр.ЦенаДоКорректировки = ТекД.Ставка;
	НовСтрКорр.СуммаДоКорректировки = ТекД.СуммаИтого;
	НовСтрКорр.СуммаНДСДоКорректировки = ТекД.СтавкаНДС;
	НовСтрКорр.ВсегоДоКорректировки = ТекД.СуммаИтого;
	
	НовСтрКорр.Содержание = НовСтрКорр.СодержаниеДоИзменения;
	
	МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
	
	// Шейко О.Е. (16.03.2021) Передаем всю ТЧ Учетных единиц
	МасУчЕдиниц = Неопределено;
	
	НоваяРТУ = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ДокументОснование, МассивКорректируемыхСтрок, МасУчЕдиниц, ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование"));
	
	НовД.КорректировкаДокумента = НоваяРТУ;
	
	ТекД = НовД;
	
	ОпОп = Новый ОписаниеОповещения("корр_СоздатьДокументКорректировки_ВопросОткрытияДа2", КорректировкиРТУКлиент, НоваяРТУ);
	ПоказатьВопрос(ОпОп, "Создано аннулирование. Открыть его?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

