
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповСписокЗначений = Новый ОписаниеТипов("СписокЗначений");
				
	ВариантФормыЗагрузки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВариантФормы", "ЗагружатьИзExcel");
	
	Если Параметры.Свойство("АдресТаблицыОписанияРеквизитов") Тогда
		
		АдресТаблицыОписанияРеквизитов = Параметры.АдресТаблицыОписанияРеквизитов;
		ОписаниеПолей = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыОписанияРеквизитов);
		ОписаниеПолей.Колонки.Добавить("ПолноеИмяТипа", Новый ОписаниеТипов("Строка"));
		ОписаниеПолей.Колонки.Добавить("КлассОМ", Новый ОписаниеТипов("Строка"));
		ОписаниеПолей.Колонки.Добавить("СсылочныйТип", Новый ОписаниеТипов("Булево"));
		ОписаниеПолей.Колонки.Добавить("МенеджерОбъекта");
		ОписаниеПолей.Колонки.Добавить("ДоступныеТипы", Новый ОписаниеТипов("Массив"));
		
		Для Каждого Поле Из ОписаниеПолей Цикл
			
			Если Поле[ВариантФормыЗагрузки] Тогда
				
				Если ЗначениеЗаполнено(Поле.ОграничениеТипа) Тогда
					Для Каждого СтроковоеПредставлениеТипа Из Поле.ОграничениеТипа Цикл
						
						ОписаниеТипа = Новый Структура("ПолноеИмяТипа, КлассОМ, МенеджерОбъекта, СсылочныйТип, ПоляПоиска, ДоступныеПоля, Иерархический, ВидИерархии");						
						Если СтрНайти(СтроковоеПредставлениеТипа, "Ссылка.") <> 0 Тогда
							
							ОписаниеТипа.ПолноеИмяТипа = СтрЗаменить(СтроковоеПредставлениеТипа, "Ссылка.", ".");
							ОписаниеТипа.КлассОМ = ЕСОбщегоНазначенияКлиентСервер.ПолучитьКлассОбъектаМетаданных(ОписаниеТипа.ПолноеИмяТипа);
							ОписаниеТипа.МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОписаниеТипа.ПолноеИмяТипа);
							ОписаниеТипа.СсылочныйТип = Истина;
							
							Если ОписаниеТипа.КлассОМ = "Справочник" Тогда
								
								ДоступныеПоля = Новый Соответствие;
								МетаданныеПоТипу = Метаданные.НайтиПоПолномуИмени(ОписаниеТипа.ПолноеИмяТипа);
								ОписаниеТипа.Иерархический = МетаданныеПоТипу.Иерархический;
								ОписаниеТипа.ВидИерархии = МетаданныеПоТипу.ВидИерархии;
								Для Каждого Реквизит Из МетаданныеПоТипу.СтандартныеРеквизиты Цикл
									ДоступныеПоля.Вставить(Реквизит.Имя, Реквизит.Тип);
								КонецЦикла;
								Для Каждого Реквизит Из МетаданныеПоТипу.Реквизиты Цикл
									ДоступныеПоля.Вставить(Реквизит.Имя, Реквизит.Тип);
								КонецЦикла;
								ОписаниеТипа.ДоступныеПоля = ДоступныеПоля;
								
								Если ЗначениеЗаполнено(Поле.ПоляПоиска) Тогда
									ОписаниеТипа.ПоляПоиска = Поле.ПоляПоиска;
								Иначе
									ПоляПоиска = Новый Массив;
									ВводПоСтроке = МетаданныеПоТипу.ВводПоСтроке;
									Для Каждого ПолеПоиска Из ВводПоСтроке Цикл
										ПоляПоиска.Добавить(ПолеПоиска.Имя);
									КонецЦикла;
									ОписаниеТипа.ПоляПоиска = ПоляПоиска;
								КонецЕсли;
							КонецЕсли;
								
						Иначе
							ОписаниеТипа.ПолноеИмяТипа = СтроковоеПредставлениеТипа;
							ОписаниеТипа.КлассОМ = "";
							ОписаниеТипа.МенеджерОбъекта = Неопределено;
							ОписаниеТипа.СсылочныйТип = Ложь;
							ОписаниеТипа.Иерархический = Ложь;
							ОписаниеТипа.ВидИерархии = Неопределено;
						КонецЕсли;
						Поле.ДоступныеТипы.Добавить(ОписаниеТипа);
						
					КонецЦикла;
				Иначе
					Типы = Поле.Тип.Типы();
					Если ЗначениеЗаполнено(Типы) Тогда
						Для Каждого ТипПоля Из Типы Цикл
							
							ОписаниеТипа = Новый Структура("ПолноеИмяТипа, КлассОМ, МенеджерОбъекта, СсылочныйТип, ПоляПоиска, ДоступныеПоля, Иерархический, ВидИерархии");
							СтроковоеПредставлениеТипа = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипПоля);
							Если СтрНайти(СтроковоеПредставлениеТипа, "Ссылка.") <> 0 Тогда
								
								ОписаниеТипа.ПолноеИмяТипа = СтрЗаменить(СтроковоеПредставлениеТипа, "Ссылка.", ".");
								ОписаниеТипа.КлассОМ = ЕСОбщегоНазначенияКлиентСервер.ПолучитьКлассОбъектаМетаданных(ОписаниеТипа.ПолноеИмяТипа);
								ОписаниеТипа.МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОписаниеТипа.ПолноеИмяТипа);
								ОписаниеТипа.СсылочныйТип = Истина;
								
								Если ОписаниеТипа.КлассОМ = "Справочник" Тогда
									
									ДоступныеПоля = Новый Соответствие;
									МетаданныеПоТипу = Метаданные.НайтиПоТипу(ТипПоля);
									ОписаниеТипа.Иерархический = МетаданныеПоТипу.Иерархический;
									ОписаниеТипа.ВидИерархии = МетаданныеПоТипу.ВидИерархии;
									Для Каждого Реквизит Из МетаданныеПоТипу.СтандартныеРеквизиты Цикл
										ДоступныеПоля.Вставить(Реквизит.Имя, Реквизит.Тип);
									КонецЦикла;
									Для Каждого Реквизит Из МетаданныеПоТипу.Реквизиты Цикл
										ДоступныеПоля.Вставить(Реквизит.Имя, Реквизит.Тип);
									КонецЦикла;
									ОписаниеТипа.ДоступныеПоля = ДоступныеПоля;
									
									Если ЗначениеЗаполнено(Поле.ПоляПоиска) Тогда
										ОписаниеТипа.ПоляПоиска = Поле.ПоляПоиска;
									Иначе
										ПоляПоиска = Новый Массив;
										ВводПоСтроке = МетаданныеПоТипу.ВводПоСтроке;
										Для Каждого ПолеПоиска Из ВводПоСтроке Цикл
											ПоляПоиска.Добавить(ПолеПоиска.Имя);
										КонецЦикла;
										ОписаниеТипа.ПоляПоиска = ПоляПоиска;
									КонецЕсли;
								КонецЕсли;
								
							Иначе
								
								ОписаниеТипа.ПолноеИмяТипа = СтроковоеПредставлениеТипа;
								ОписаниеТипа.КлассОМ = "";
								ОписаниеТипа.МенеджерОбъекта = Неопределено;
								ОписаниеТипа.СсылочныйТип = Ложь;
								ОписаниеТипа.Иерархический = Ложь;
								ОписаниеТипа.ВидИерархии = Неопределено;
								
							КонецЕсли;
							Поле.ДоступныеТипы.Добавить(ОписаниеТипа);
							
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ПоместитьВоВременноеХранилище(ОписаниеПолей, АдресТаблицыОписанияРеквизитов);
		
		ДобавленныеРеквизиты = Новый Массив;
		Для Каждого ОписаниеПоля Из ОписаниеПолей Цикл
			
			Если ОписаниеПоля.Имя = "ТипоразмерыКТКСтрокой" Или ОписаниеПоля.Имя = "ТипоразмерыКТК" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("ТипоразмерыКТКСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
			ИначеЕсли ОписаниеПоля.Имя = "КлассОпасностиСтрокой" Или ОписаниеПоля.Имя = "КлассыОпасности" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("КлассыОпасностиСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);	
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
			ИначеЕсли ОписаниеПоля.Имя = "ТипоразмерыВагоновСтрокой" Или ОписаниеПоля.Имя = "ТипоразмерыВагонов" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("ТипоразмерыВагоновСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
			ИначеЕсли ОписаниеПоля.Имя = "КонтейнерыВагоны" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("КонтейнерыВагоныСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
			ИначеЕсли ОписаниеПоля.Имя = "ВидыОтправокСтрокой" Или ОписаниеПоля.Имя = "ВидыОтправок" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("ВидыОтправокСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
			// Евросиб US 98207 TA 105661 Рыбьяков К.А. 02.04.2025 ((
			ИначеЕсли ОписаниеПоля.Имя = "Продукт" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("ПродуктыСписок", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
			// Евросиб Рыбьяков К.А. 02.04.2025 ))	
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			ИначеЕсли ОписаниеПоля.Имя = "СостоянияГруженыйПорожнийСтрокой" Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеТиповСтрока, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("СостоянияГруженыйПорожний", ОписаниеТиповСписокЗначений, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			Иначе
				
				НовыйРеквизит = Новый РеквизитФормы(ОписаниеПоля.Имя, ОписаниеПоля.Тип, "ПрочитанныеДанные", ОписаниеПоля.Представление, Истина);      
				ДобавленныеРеквизиты.Добавить(НовыйРеквизит);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИзменитьРеквизиты(ДобавленныеРеквизиты);
		
		Для Каждого ОписаниеПоля Из ОписаниеПолей Цикл
			ИмяЭлемента = "ПрочитанныеДанные" + ОписаниеПоля.Имя;
			Элемент = Элементы.Найти(ИмяЭлемента);
			Если Элемент = Неопределено Тогда
				
				Элемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ПрочитанныеДанные);
				
				Элемент.Вид       = ВидПоляФормы.ПолеВвода;
				Элемент.ПутьКДанным = "ПрочитанныеДанные." + ОписаниеПоля.Имя;
				Элемент.Заголовок = ОписаниеПоля.Представление;
				Элемент.Видимость = ОписаниеПоля[ВариантФормыЗагрузки];
				
				Если ОписаниеПоля.Имя = "ТипоразмерыВагоновСтрокой" Или ОписаниеПоля.Имя = "ТипоразмерыВагонов" Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыВыбораПоля = Новый Массив;
				Если ЗначениеЗаполнено(ОписаниеПоля.ПараметрыВыбора) Тогда
					Для Каждого ПараметрВыбора Из ОписаниеПоля.ПараметрыВыбора Цикл
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.ИмяПараметра, ПараметрВыбора.ЗначениеПараметра);
						ПараметрыВыбораПоля.Добавить(НовыйПараметр);
					КонецЦикла;
				КонецЕсли;
				
				Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоля);
				
				Если ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
					Элемент.СписокВыбора.ЗагрузитьЗначения(ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения());
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	Иначе
		ОписаниеПолей = Неопределено;
	КонецЕсли;
	
	ВывестиТабличныйДокумент(ОписаниеПолей);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТабличныйДокумент(ОписаниеПолей)
	
	ДеревоГрупп = Новый ДеревоЗначений;
	ДеревоГрупп.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ДеревоГрупп.Колонки.Добавить("ЭтоГруппаЭлементов", Новый ОписаниеТипов("Булево"));
	ДеревоГрупп.Колонки.Добавить("ОтображатьВШапке", Новый ОписаниеТипов("Булево"));
	ДеревоГрупп.Колонки.Добавить("Загружать", Новый ОписаниеТипов("Булево"));
	ДеревоГрупп.Колонки.Добавить("ШиринаКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	
	
	КорневыеЭлементы = ДеревоГрупп.Строки;
	МаксимальныйУровень = 0;
	
	Если ЗначениеЗаполнено(ОписаниеПолей) Тогда
		
		ЭлементДерева = КорневыеЭлементы.Добавить();
		ЭлементДерева.Представление = "№ п/п";
		ЭлементДерева.Загружать = Истина;
		ЭлементДерева.ШиринаКолонки = 5;
		
		ГруппыКолонок = Новый Соответствие;
		
		Для Каждого Поле Из ОписаниеПолей Цикл		
			
			Если ЗначениеЗаполнено(Поле.Родитель) Тогда
				ЭлементыТекущейГруппы = ГруппыКолонок.Получить(Поле.Родитель);
			Иначе
				ЭлементыТекущейГруппы = КорневыеЭлементы;
			КонецЕсли;
			
			ЭлементДерева = ЭлементыТекущейГруппы.Добавить();
			Если Поле.ЭтоГруппаЭлементов Тогда
				ГруппыКолонок.Вставить(Поле.Имя, ЭлементДерева.Строки);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЭлементДерева, Поле);
			ЭлементДерева.Загружать = Поле[ВариантФормыЗагрузки];
			
			МаксимальныйУровень = Макс(МаксимальныйУровень, ЭлементДерева.Уровень());
			
		КонецЦикла;
		
	КонецЕсли;
	
	Макет = Документы.ПСЦПоставщика.ПолучитьМакет("МакетКолонкиТабличногоДокумента");
	ОбластьКолонка = Макет.ПолучитьОбласть("R1C1:R1C1");
	ТекущийУровень = 0;
	КоличествоКолонок = 0;
	СформироватьТабДокПоЭлементамДерева(КорневыеЭлементы, ТабДок, ОбластьКолонка, МаксимальныйУровень, ТекущийУровень, КоличествоКолонок);
	
	Если КоличествоКолонок > 0 Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("R2C1:R2C1");
		
		ТабДок.Вывести(ОбластьСтрока);
		Для Сч = 1 По КоличествоКолонок - 1 Цикл
			ТабДок.Присоединить(ОбластьСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДок.ФиксацияСверху = МаксимальныйУровень + 1;
	НомерПервойСчитываемойСтроки = МаксимальныйУровень + 2;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТабДокПоЭлементамДерева(ЭлементыДерева, ТабДокГруппы, ОбластьКолонка, МаксимальныйУровень, ТекущийУровень, КоличествоКолонок)
	
	Для Каждого Эл Из ЭлементыДерева Цикл
		
		Если Эл.ЭтоГруппаЭлементов Тогда			
			
			ТабДокЭлементов = Новый ТабличныйДокумент;
			КоличествоКолонокВГруппе = 0;
			НовыйУровень = ТекущийУровень + ?(Эл.ОтображатьВШапке, 1, 0);
			СформироватьТабДокПоЭлементамДерева(Эл.Строки, ТабДокЭлементов, ОбластьКолонка, МаксимальныйУровень, НовыйУровень, КоличествоКолонокВГруппе);
			
			Если КоличествоКолонокВГруппе > 0 Тогда
				
				КоличествоКолонок = КоличествоКолонок + КоличествоКолонокВГруппе;
				
				Если Эл.ОтображатьВШапке Тогда
					
					ОбластьКолонка.Параметры.ЗаголовокКолонки = Эл.Представление;
					ШапкаГруппы = Новый ТабличныйДокумент;
					ШапкаГруппы.Вывести(ОбластьКолонка);					
					ОбластьШапкаКолонки = ШапкаГруппы.Область(1, 1, 1, КоличествоКолонокВГруппе);
					ОбластьШапкаКолонки.Объединить();
					
					ШапкаГруппы.Вывести(ТабДокЭлементов);
					
				Иначе
					ШапкаГруппы = ТабДокЭлементов;
				КонецЕсли;
				
				ТабДокГруппы.Присоединить(ШапкаГруппы);
				
			КонецЕсли;
				
		Иначе
			Если Эл.Загружать Тогда
				
				ОбластьКолонка.Параметры.ЗаголовокКолонки = Эл.Представление;
				ШапкаКолонки = Новый ТабличныйДокумент;
				ШапкаКолонки.Вывести(ОбластьКолонка);
				
				Разница = МаксимальныйУровень - ТекущийУровень;
				Если Разница > 0 Или Эл.ШиринаКолонки > 0 Тогда
					КоличествоОбъединяемыхСтрок = Разница + 1;
					ОбластьШапкаКолонки = ШапкаКолонки.Область(1, 1, КоличествоОбъединяемыхСтрок, 1);
					ОбластьШапкаКолонки.Объединить();
					Если Эл.ШиринаКолонки > 0 Тогда
						ОбластьШапкаКолонки.ШиринаКолонки = Эл.ШиринаКолонки;
					КонецЕсли;
				КонецЕсли;
				
				ТабДокГруппы.Присоединить(ШапкаКолонки);
				
				КоличествоКолонок = КоличествоКолонок + 1;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура Прочитать(Команда)
	
	ПрочитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	ПрочитанныеДанные.Очистить();
	
	ОписаниеПолей = ПолучитьИзВременногоХранилища(АдресТаблицыОписанияРеквизитов);
	
	ТаблицыПоиска = Новый Структура;
	
	ТипСтрока = Тип("Строка");
	ТипФиксированныйМассив = Тип("ФиксированныйМассив");
	ОписаниеТиповЦелоеЧисло10 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	ИерархияГруппИЭлементов = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
	
	НомерСтроки = НомерПервойСчитываемойСтроки;
	ПредставлениеНомераСтроки = Формат(НомерСтроки, "ЧГ=0");
	НомерСтрокиПрочитанныхДанных = 0;
	ЕстьЗначение = Истина;
	
	Пока ЕстьЗначение Цикл
		
		НомерПоля = 1;
		ЕстьЗначение = Ложь;
		ДанныеСтроки = Новый Структура;
		Для Каждого Поле Из ОписаниеПолей Цикл
			
			Если Не Поле[ВариантФормыЗагрузки] Тогда
				Продолжить;
			КонецЕсли;
			
			НомерПоля = НомерПоля + 1;
			ИмяОбласти = СтрШаблон("R%1C%2", ПредставлениеНомераСтроки, НомерПоля);			
			ПрочитанноеЗначение = СокрЛП(ТабДок.Область(ИмяОбласти).Текст);
			Если ЗначениеЗаполнено(ПрочитанноеЗначение) Тогда
				
				ЕстьЗначение = Истина;
				Значение = Неопределено;
				
				Если Поле.Имя = "ТипоразмерыКТКСтрокой" Или Поле.Имя = "ТипоразмерыКТК" Тогда
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("ИндексСтроки", ОписаниеТиповЦелоеЧисло10);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Значение", ОписаниеТиповСтрока150);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							НСтр = ТаблицаПрочитанныхЗначений.Добавить();
							НСтр.ИндексСтроки = ИндексСтроки;
							НСтр.Значение = ПрочитаннаяПодстрока;
						КонецЕсли;
					КонецЦикла;
					
					КоличествоПрочитанныхЗначений = ТаблицаПрочитанныхЗначений.Количество();
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ТаблицаПрочитанныхЗначений", ТаблицаПрочитанныхЗначений);
					
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаПрочитанныхЗначений.ИндексСтроки КАК ИндексСтроки,
					|	ТаблицаПрочитанныхЗначений.Значение КАК Значение
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	&ТаблицаПрочитанныхЗначений КАК ТаблицаПрочитанныхЗначений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ.ИндексСтроки КАК ИндексСтроки,
					|	ВТ.Значение КАК Значение,
					|	ТипоразмерыТЕ.Ссылка КАК Ссылка,
					|	ТипоразмерыТЕ.Наименование КАК Наименование
					|ИЗ
					|	ВТ КАК ВТ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
					|		ПО ВТ.Значение = ТипоразмерыТЕ.Наименование
					|ГДЕ
					|	НЕ ТипоразмерыТЕ.ПометкаУдаления
					|
					|УПОРЯДОЧИТЬ ПО
					|	ИндексСтроки";
					
					ТаблицаНайденныхЗначений = Запрос.Выполнить().Выгрузить();
					
					КоличествоНайденныхЗначений = ТаблицаНайденныхЗначений.Количество();
					Если КоличествоПрочитанныхЗначений = КоличествоНайденныхЗначений Тогда
						
						НайденныеЗначения = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Ссылка");
						ДанныеСтроки.Вставить("ТипоразмерыКТКСписок", НайденныеЗначения);
						
						Наименования = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Наименование");
						Значение = СтрСоединить(Наименования, ";");
					
					КонецЕсли;
				//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
				ИначеЕсли Поле.Имя = "КлассОпасностиСтрокой" Или Поле.Имя = "КлассыОпасности" Тогда
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					
					СоответстКлассов = Новый Соответствие;
					СоответстКлассов.Вставить("1",Перечисления.КлассОпасностиГруза.Первый);
					СоответстКлассов.Вставить("2",Перечисления.КлассОпасностиГруза.Второй);
					СоответстКлассов.Вставить("3",Перечисления.КлассОпасностиГруза.Третий);
					СоответстКлассов.Вставить("4",Перечисления.КлассОпасностиГруза.Четвертый);
					СоответстКлассов.Вставить("5",Перечисления.КлассОпасностиГруза.Пятый);
					СоответстКлассов.Вставить("6",Перечисления.КлассОпасностиГруза.Шестой);
					СоответстКлассов.Вставить("7",Перечисления.КлассОпасностиГруза.Седьмой);
					СоответстКлассов.Вставить("8",Перечисления.КлассОпасностиГруза.Восьмой);
					СоответстКлассов.Вставить("9",Перечисления.КлассОпасностиГруза.Девятый);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					КоличествоНайденныхЗначений = 0;
					ТаблицаНайденныхЗначений = Новый ТаблицаЗначений;
					ТаблицаНайденныхЗначений.Колонки.Добавить("Перечисление");
					ТаблицаНайденныхЗначений.Колонки.Добавить("Представление");
					
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							
							Если СоответстКлассов.Получить(ПрочитаннаяПодстрока) <> Неопределено Тогда
								НовСтрока = ТаблицаНайденныхЗначений.Добавить();
								НовСтрока.Перечисление = СоответстКлассов.Получить(ПрочитаннаяПодстрока);
								НовСтрока.Представление = ПрочитаннаяПодстрока;
								КоличествоНайденныхЗначений = КоличествоНайденныхЗначений + 1;
							КонецЕсли;	
													
						КонецЕсли;
					КонецЦикла;
					
					КоличествоНайденныхЗначений = ТаблицаНайденныхЗначений.Количество();
					Если КоличествоПрочитанныхЗначений = КоличествоНайденныхЗначений Тогда
						
						НайденныеЗначения = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Перечисление");
						ДанныеСтроки.Вставить("КлассыОпасностиСписок", НайденныеЗначения);
						
						Представление = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Представление");
						Значение = СтрСоединить(Представление, ";");
					
					КонецЕсли;	
				//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
				ИначеЕсли Поле.Имя = "ТипоразмерыВагоновСтрокой" Или Поле.Имя = "ТипоразмерыВагонов" Тогда
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("ИндексСтроки", ОписаниеТиповЦелоеЧисло10);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Значение", ОписаниеТиповСтрока150);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							НСтр = ТаблицаПрочитанныхЗначений.Добавить();
							НСтр.ИндексСтроки = ИндексСтроки;
							НСтр.Значение = ПрочитаннаяПодстрока;
						КонецЕсли;
					КонецЦикла;
					
					КоличествоПрочитанныхЗначений = ТаблицаПрочитанныхЗначений.Количество();
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ТаблицаПрочитанныхЗначений", ТаблицаПрочитанныхЗначений);
					
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаПрочитанныхЗначений.ИндексСтроки КАК ИндексСтроки,
					|	ТаблицаПрочитанныхЗначений.Значение КАК Значение
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	&ТаблицаПрочитанныхЗначений КАК ТаблицаПрочитанныхЗначений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ.ИндексСтроки КАК ИндексСтроки,
					|	ВТ.Значение КАК Значение,
					|	ТипоразмерыТС.Ссылка КАК Ссылка,
					|	ТипоразмерыТС.Код КАК Код
					|ИЗ
					|	ВТ КАК ВТ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
					|		ПО ВТ.Значение = ТипоразмерыТС.Код
					|ГДЕ
					|	НЕ ТипоразмерыТС.ПометкаУдаления
					|
					|УПОРЯДОЧИТЬ ПО
					|	ИндексСтроки";
					
					ТаблицаНайденныхЗначений = Запрос.Выполнить().Выгрузить();
					
					КоличествоНайденныхЗначений = ТаблицаНайденныхЗначений.Количество();
					Если КоличествоПрочитанныхЗначений = КоличествоНайденныхЗначений Тогда
						
						ТаблицаНайденныхЗначений.Свернуть("Ссылка, Код");
						НайденныеЗначения = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Ссылка");
						ДанныеСтроки.Вставить("ТипоразмерыВагоновСписок", НайденныеЗначения);
						
						Если Поле.Имя = "ТипоразмерыВагоновСтрокой" Тогда
							Наименования = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Код");
							Значение = СтрСоединить(Наименования, ";");
						ИначеЕсли Поле.Имя = "ТипоразмерыВагонов" Тогда
							Значение = НайденныеЗначения;							
						КонецЕсли;
					
					КонецЕсли;
					
				ИначеЕсли Поле.Имя = "КонтейнерыВагоны" Тогда
					
					ОписаниеТиповСтрока4 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4));
					ОписаниеТиповСтрока6 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6));
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);					
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("ИндексСтроки", ОписаниеТиповЦелоеЧисло10);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Префикс", ОписаниеТиповСтрока4);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Номер", ОписаниеТиповСтрока6);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						
						НомерКТК = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);						
						Если ЗначениеЗаполнено(НомерКТК) Тогда
							НСтр = ТаблицаПрочитанныхЗначений.Добавить();
							НСтр.ИндексСтроки = ИндексСтроки;
							НСтр.Префикс = Лев(ВРег(НомерКТК), 4);
							НСтр.Номер = Сред(НомерКТК, 5, 6);
						КонецЕсли;
						
					КонецЦикла;
					
					КоличествоПрочитанныхЗначений = ТаблицаПрочитанныхЗначений.Количество();
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ТаблицаПрочитанныхЗначений", ТаблицаПрочитанныхЗначений);
					
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаПрочитанныхЗначений.ИндексСтроки КАК ИндексСтроки,
					|	ТаблицаПрочитанныхЗначений.Префикс КАК Префикс,
					|	ТаблицаПрочитанныхЗначений.Номер КАК Номер
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	&ТаблицаПрочитанныхЗначений КАК ТаблицаПрочитанныхЗначений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ.ИндексСтроки КАК ИндексСтроки,
					|	ТЕ.Ссылка КАК Ссылка,
					|	ТЕ.Наименование КАК Наименование
					|ИЗ
					|	ВТ КАК ВТ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
					|		ПО ВТ.Префикс = ТЕ.Префикс
					|		И ВТ.Номер = ТЕ.Номер
					|ГДЕ
					|	НЕ ТЕ.ПометкаУдаления
					|
					|УПОРЯДОЧИТЬ ПО
					|	ИндексСтроки";
					
					ТаблицаНайденныхЗначений = Запрос.Выполнить().Выгрузить();
					
					КоличествоНайденныхЗначений = ТаблицаНайденныхЗначений.Количество();
					Если КоличествоПрочитанныхЗначений = КоличествоНайденныхЗначений Тогда
						
						НайденныеЗначения = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Ссылка");
						ДанныеСтроки.Вставить("КонтейнерыВагоныСписок", НайденныеЗначения);
						
						Наименования = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Наименование");
						Значение = СтрСоединить(Наименования, ",");
					
					КонецЕсли;
					
				ИначеЕсли Поле.Имя = "ВидыОтправокСтрокой" Или Поле.Имя = "ВидыОтправок" Тогда
					
					Если Не ТаблицыПоиска.Свойство("ВидыОтправок") Тогда
						СоответствиеЗначений = Новый Соответствие;
						Для Каждого ЗначениеПеречисления Из Перечисления.ВидыОтправок Цикл
							ПредставлениеЗначения = НРег(Строка(ЗначениеПеречисления));
							СоответствиеЗначений.Вставить(ПредставлениеЗначения, ЗначениеПеречисления);
						КонецЦикла;
						ТаблицыПоиска.Вставить("ВидыОтправок", СоответствиеЗначений);
					КонецЕсли;
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);					
					ПрочитанныеСтроки = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					НайденныеЗначения = Новый Массив;
					КоличествоЗаполненныхПодстрок = 0;
					КоличествоПрочитанныхСтрок = ПрочитанныеСтроки.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхСтрок - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеСтроки[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							НайденноеЗначение = ТаблицыПоиска.ВидыОтправок.Получить(НРег(ПрочитаннаяПодстрока));
							КоличествоЗаполненныхПодстрок = КоличествоЗаполненныхПодстрок + 1;
							Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
								НайденныеЗначения.Добавить(НайденноеЗначение);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Если КоличествоЗаполненныхПодстрок = НайденныеЗначения.Количество() Тогда
						
						ДанныеСтроки.Вставить("ВидыОтправокСписок", НайденныеЗначения);						
						Значение = СтрСоединить(НайденныеЗначения, ",");
						
					КонецЕсли;
					
				// Евросиб US 98207 TA 100593 Рыбьяков К.А. 01.04.2025 ((
				ИначеЕсли Поле.Имя = "Продукт" Тогда
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("ИндексСтроки", ОписаниеТиповЦелоеЧисло10);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Значение", ОписаниеТиповСтрока150);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							НСтр = ТаблицаПрочитанныхЗначений.Добавить();
							НСтр.ИндексСтроки = ИндексСтроки;
							НСтр.Значение = ПрочитаннаяПодстрока;
						КонецЕсли;
					КонецЦикла;
					
					КоличествоПрочитанныхЗначений = ТаблицаПрочитанныхЗначений.Количество();
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ТаблицаПрочитанныхЗначений", ТаблицаПрочитанныхЗначений);
					
					Запрос.Текст = "ВЫБРАТЬ
					|	ТаблицаПрочитанныхЗначений.ИндексСтроки КАК ИндексСтроки,
					|	ТаблицаПрочитанныхЗначений.Значение КАК Значение
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	&ТаблицаПрочитанныхЗначений КАК ТаблицаПрочитанныхЗначений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВТ.ИндексСтроки КАК ИндексСтроки,
					|	ВТ.Значение КАК Значение,
					|	ПродуктыДКП.Ссылка КАК Ссылка,
					|	ПродуктыДКП.Наименование КАК Наименование
					|ИЗ
					|	Справочник.ПродуктыДКП КАК ПродуктыДКП 
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
					|		ПО (ПродуктыДКП.Наименование ПОДОБНО ВТ.Значение)
					|ГДЕ
					|	НЕ ПродуктыДКП.ПометкаУдаления
					|
					|УПОРЯДОЧИТЬ ПО
					|	ИндексСтроки";
					
					ТаблицаНайденныхЗначений = Запрос.Выполнить().Выгрузить();
					
					КоличествоНайденныхЗначений = ТаблицаНайденныхЗначений.Количество();
					Если КоличествоПрочитанныхЗначений = КоличествоНайденныхЗначений Тогда
						
						ТаблицаНайденныхЗначений.Свернуть("Ссылка, Наименование");
						НайденныеЗначения = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Ссылка");
						ДанныеСтроки.Вставить("ПродуктыСписок", НайденныеЗначения);
						
						Наименования = ТаблицаНайденныхЗначений.ВыгрузитьКолонку("Наименование");
						Значение = СтрСоединить(Наименования, ";");
						
					КонецЕсли;
					// Евросиб Рыбьяков К.А. 01.04.2025 ))
				//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025	
				ИначеЕсли Поле.Имя = "ПринадлежностьТЕ" Тогда
					
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Значение");
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Имя");
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПринадлежностьТЕ.Ссылка КАК Ссылка
					|ИЗ
					|	Перечисление.ПринадлежностьТЕ КАК ПринадлежностьТЕ";
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						НовСтрока = ТаблицаПрочитанныхЗначений.Добавить();
						НовСтрока.Значение = ВыборкаДетальныеЗаписи.Ссылка;
						НовСтрока.Имя	   = Строка(ВыборкаДетальныеЗаписи.Ссылка);	 
					КонецЦикла;
					
					Для Каждого СтрТ Из ТаблицаПрочитанныхЗначений Цикл
						Если СтрНайти(СтрТ.Имя,ПрочитанноеЗначение) > 0 Тогда
							Значение = СтрТ.Значение;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
				ИначеЕсли Поле.Имя = "СостоянияГруженыйПорожнийСтрокой" Тогда
					
					Разделитель = ПолучитьРазделитель(ПрочитанноеЗначение);
					ПрочитанныеЗначения = СтрРазделить(ПрочитанноеЗначение, Разделитель, Ложь);
					ТаблицаПрочитанныхЗначений = Новый ТаблицаЗначений;
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("ИндексСтроки", ОписаниеТиповЦелоеЧисло10);
					ТаблицаПрочитанныхЗначений.Колонки.Добавить("Значение", ОписаниеТиповСтрока150);
					
					КоличествоПрочитанныхЗначений = ПрочитанныеЗначения.Количество();
					Для ИндексСтроки = 0 По КоличествоПрочитанныхЗначений - 1 Цикл
						ПрочитаннаяПодстрока = СокрЛП(ПрочитанныеЗначения[ИндексСтроки]);
						Если ЗначениеЗаполнено(ПрочитаннаяПодстрока) Тогда
							НСтр = ТаблицаПрочитанныхЗначений.Добавить();
							НСтр.ИндексСтроки = ИндексСтроки;
							НСтр.Значение = ПрочитаннаяПодстрока;
						КонецЕсли;
					КонецЦикла;
					
					МассивЗначенийГП = Новый Массив;
					СостоянияГруженыйПорожний = Новый СписокЗначений;
					
					Для Каждого Стр Из ТаблицаПрочитанныхЗначений Цикл
						Если СтрНайти(Стр.Значение,"Груженый") Тогда
							МассивЗначенийГП.Добавить(Стр.Значение);
							СостоянияГруженыйПорожний.Добавить(Перечисления.СостоянияКТК.Груженый);
						КонецЕсли;
						Если СтрНайти(Стр.Значение,"Порожний") Тогда
							МассивЗначенийГП.Добавить(Стр.Значение);
							СостоянияГруженыйПорожний.Добавить(Перечисления.СостоянияКТК.Порожний);
						КонецЕсли;
					КонецЦикла;	
					
					ДанныеСтроки.Вставить("СостоянияГруженыйПорожний", СостоянияГруженыйПорожний);
					
					Значение = СтрСоединить(МассивЗначенийГП, ";");				
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
				//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
				ИначеЕсли Поле.Имя = "КоличествоМестTEU" Тогда
					
					Если ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ПрочитанноеЗначение) Тогда
						
						ЧислоПрочитанноеЗначение = Число(ПрочитанноеЗначение);
						
						Если ЧислоПрочитанноеЗначение > 0 И ЧислоПрочитанноеЗначение <= 4 Тогда
							Значение = ПрочитанноеЗначение;
						Иначе
							Значение = "0";
						КонецЕсли;
					КонецЕсли;
				//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
				Иначе
				
					Для Каждого ОписаниеТипа Из Поле.ДоступныеТипы Цикл
						
						Если ОписаниеТипа.СсылочныйТип Тогда						
							Если ОписаниеТипа.КлассОМ = "Справочник" Тогда
								
								Запрос = Новый Запрос;								
								ИспользоватьЗапрос = Ложь;
								
								Если ОписаниеТипа.ПолноеИмяТипа = "Справочник.Мультилокации" И ЗначениеЗаполнено(Поле.ПараметрыВыбора) Тогда
									
									ИспользоватьЗапрос = Истина;
									ИспользоватьСтандартныйЗапрос = Истина;
										
									ТекстЗапроса = 
									"ВЫБРАТЬ РАЗЛИЧНЫЕ
									|	ТаблицаСправочника.Ссылка КАК Ссылка
									|ПОМЕСТИТЬ ВТ
									|ИЗ
									|	Справочник.Мультилокации КАК ТаблицаСправочника
									|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
									|		ПО ТаблицаСправочника.Ссылка = МультилокацииЛокации.Ссылка
									|ГДЕ
									|	ТаблицаСправочника.Наименование ПОДОБНО &Наименование
									|	И МультилокацииЛокации.Локация.Тип = &Тип
									|;
									|
									|////////////////////////////////////////////////////////////////////////////////
									|ВЫБРАТЬ РАЗЛИЧНЫЕ
									|	ВТ.Ссылка КАК Ссылка
									|ПОМЕСТИТЬ ВТ_ИсключаемыеМультилокации
									|ИЗ
									|	ВТ КАК ВТ
									|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК ИсключаемыеЛокации
									|		ПО ВТ.Ссылка = ИсключаемыеЛокации.Ссылка
									|ГДЕ
									|	НЕ ИсключаемыеЛокации.Локация.Тип = &Тип
									|;
									|
									|////////////////////////////////////////////////////////////////////////////////
									|ВЫБРАТЬ ПЕРВЫЕ 1
									|	ВТ.Ссылка КАК Ссылка
									|ИЗ
									|	ВТ КАК ВТ
									|ГДЕ
									|	НЕ ВТ.Ссылка В
									|				(ВЫБРАТЬ
									|					ВТ_ИсключаемыеМультилокации.Ссылка
									|				ИЗ
									|					ВТ_ИсключаемыеМультилокации КАК ВТ_ИсключаемыеМультилокации)";
									
									Условия = Новый Массив;
									УсловияИсключения = Новый Массив;
																		
									Для Каждого Параметр Из Поле.ПараметрыВыбора Цикл
									
										ИмяПараметра = СтрЗаменить(Параметр.ИмяПараметра, "Отбор.", "");
										ЗначениеПараметра = Параметр.ЗначениеПараметра;
										
										Если ИмяПараметра = "Тип" Или ИмяПараметра = "Погранпереход" Тогда
											
											ИспользоватьСтандартныйЗапрос = Ложь;
											
											Если ТипЗнч(ЗначениеПараметра) = ТипФиксированныйМассив Тогда
												Условия.Добавить(СтрШаблон("МультилокацииЛокации.Локация.%1 В (&%1)", ИмяПараметра));
												УсловияИсключения.Добавить(СтрШаблон("(НЕ ИсключаемыеЛокации.Локация.%1 В (&%1))", ИмяПараметра));												
											Иначе
												Условия.Добавить(СтрШаблон("МультилокацииЛокации.Локация.%1 = &%1", ИмяПараметра));
												УсловияИсключения.Добавить(СтрШаблон("(НЕ ИсключаемыеЛокации.Локация.%1 = &%1)", ИмяПараметра));
											КонецЕсли;
											
											Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
											
										КонецЕсли;
										
										Если ОписаниеТипа.ДоступныеПоля.Получить(ИмяПараметра) = Неопределено Тогда
											Продолжить;
										КонецЕсли;										
										
										Если ТипЗнч(ЗначениеПараметра) = ТипФиксированныйМассив Тогда
											Условия.Добавить(СтрШаблон("Мультилокации.%1 = &%1", ИмяПараметра));
										Иначе
											Условия.Добавить(СтрШаблон("Мультилокации.%1 В (&%1)", ИмяПараметра));
										КонецЕсли;
										
										Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
										
									КонецЦикла;
									
									ТекстУсловийЗапроса = СтрСоединить(Условия, Символы.ПС + "И ");
									ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МультилокацииЛокации.Локация.Тип = &Тип", ТекстУсловийЗапроса);
									
									ТекстУсловийЗапроса = СтрСоединить(УсловияИсключения, Символы.ПС + "И ");
									ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ИсключаемыеЛокации.Локация.Тип = &Тип", ТекстУсловийЗапроса);
										
								ИначеЕсли ОписаниеТипа.ПолноеИмяТипа = "Справочник.ТипоразмерыТЕ" Тогда
									
									ИспользоватьЗапрос = Истина;
									ИспользоватьСтандартныйЗапрос = Ложь;
									
									ТекстЗапроса =
									"ВЫБРАТЬ ПЕРВЫЕ 1
									|	ТаблицаСправочника.Ссылка КАК Ссылка
									|ИЗ
									|	Справочник.ТипоразмерыТЕ КАК ТаблицаСправочника
									|ГДЕ
									|	НЕ ТаблицаСправочника.ПометкаУдаления
									|	И ТаблицаСправочника.Наименование ПОДОБНО &Наименование									
									|
									|УПОРЯДОЧИТЬ ПО
									|	ТаблицаСправочника.ИспользоватьПоУмолчаниюДляКТКУказанногоРазмера УБЫВ,
									|	ТаблицаСправочника.Рефрижераторный";
									
								//ИначеЕсли ЗначениеЗаполнено(Поле.ПараметрыВыбора) Тогда
								//	
								//	ИспользоватьЗапрос = Истина;
								//	ИспользоватьСтандартныйЗапрос = Истина;
								//	
								//ИначеЕсли ОписаниеТипа.Иерархический И ОписаниеТипа.ВидИерархии = ИерархияГруппИЭлементов
								//	И (Поле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы
								//		Или Поле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы) Тогда
								//		
								//	ИспользоватьЗапрос = Истина;
								//	ИспользоватьСтандартныйЗапрос = Истина;
								
								Иначе
								
									ИспользоватьЗапрос = Истина;
									ИспользоватьСтандартныйЗапрос = Истина;
									
								КонецЕсли;
									
								Если ИспользоватьЗапрос Тогда
									
									Если ИспользоватьСтандартныйЗапрос Тогда
										
										ТекстЗапроса =
										"ВЫБРАТЬ
										|	ТаблицаСправочника.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Локации КАК ТаблицаСправочника
										|ГДЕ
										|	НЕ ТаблицаСправочника.ПометкаУдаления
										|	И ТаблицаСправочника.Наименование ПОДОБНО &Наименование";
										
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Локации", ОписаниеТипа.ПолноеИмяТипа);								
																		
										УсловияЗапроса = Новый Массив;
										УсловияЗапроса.Добавить("ТаблицаСправочника.Наименование ПОДОБНО &Наименование");
										ШаблонУсловия = "ТаблицаСправочника.%1 = &%1";
										
										Если ОписаниеТипа.Иерархический И ОписаниеТипа.ВидИерархии = ИерархияГруппИЭлементов Тогда
											Если Поле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
												УсловияЗапроса.Добавить("НЕ ТаблицаСправочника.ЭтоГруппа");
											ИначеЕсли Поле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
												УсловияЗапроса.Добавить("ТаблицаСправочника.ЭтоГруппа");
											КонецЕсли;
										КонецЕсли;
										
										Для Каждого Параметр Из Поле.ПараметрыВыбора Цикл
											
											ИмяПараметра = СтрЗаменить(Параметр.ИмяПараметра, "Отбор.", "");
											Если ОписаниеТипа.ДоступныеПоля.Получить(ИмяПараметра) = Неопределено Тогда
												Продолжить;
											КонецЕсли;
											ЗначениеПараметра = Параметр.ЗначениеПараметра;
											
											Если ТипЗнч(ЗначениеПараметра) = ТипФиксированныйМассив Тогда
												УсловияЗапроса.Добавить(СтрШаблон("ТаблицаСправочника.%1 В (&%1)", ИмяПараметра));
											Иначе
												УсловияЗапроса.Добавить(СтрШаблон("ТаблицаСправочника.%1 = &%1", ИмяПараметра));
											КонецЕсли;
											
											Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
											
										КонецЦикла;
										
										ТекстУсловийЗапроса = СтрСоединить(УсловияЗапроса, Символы.ПС + "И ");
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаСправочника.Наименование ПОДОБНО &Наименование", ТекстУсловийЗапроса);
									
									КонецЕсли;
								
									Для Каждого ПолеПоиска Из ОписаниеТипа.ПоляПоиска Цикл
										
										ТипПоляПоиска = ОписаниеТипа.ДоступныеПоля.Получить(ПолеПоиска);
										Если ТипПоляПоиска = Неопределено Тогда
											Продолжить;
										КонецЕсли;
										
										Если ТипПоляПоиска.СодержитТип(ТипСтрока) Тогда
										
											Если ПолеПоиска = "Наименование" Тогда
												Запрос.Текст = ТекстЗапроса;
												Запрос.УстановитьПараметр(ПолеПоиска,  "%" + ПрочитанноеЗначение + "%");
											ИначеЕсли ТипПоляПоиска.КвалификаторыСтроки.Длина = 0 Тогда
												Условие = СтрШаблон("ТаблицаСправочника.%1 ПОДОБНО &%1", ПолеПоиска);
												Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ТаблицаСправочника.Наименование ПОДОБНО &Наименование", Условие);
												Запрос.УстановитьПараметр(ПолеПоиска, "%" + ПрочитанноеЗначение + "%");
											Иначе
												Условие = СтрШаблон("ТаблицаСправочника.%1 = &%1", ПолеПоиска);
												Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ТаблицаСправочника.Наименование ПОДОБНО &Наименование", Условие);
												Запрос.УстановитьПараметр(ПолеПоиска, ПрочитанноеЗначение);
											КонецЕсли;									
											
											Выборка = Запрос.Выполнить().Выбрать();
											Если Выборка.Следующий() Тогда
												Значение = Выборка.Ссылка;
											КонецЕсли;
										
										КонецЕсли;
										
										Если ЗначениеЗаполнено(Значение) Тогда
											Прервать;
										КонецЕсли;
										
									КонецЦикла;
									
								Иначе
									
									Для Каждого ПолеПоиска Из ОписаниеТипа.ПоляПоиска Цикл								
										
										Если ОписаниеТипа.ДоступныеПоля.Получить(ПолеПоиска) = Неопределено Тогда
											Продолжить;
										КонецЕсли;
										
										Если ПолеПоиска = "Наименование" Тогда									
											Значение = ОписаниеТипа.МенеджерОбъекта.НайтиПоНаименованию(ПрочитанноеЗначение);									
										ИначеЕсли ПолеПоиска = "Код" Тогда
											Значение = ОписаниеТипа.МенеджерОбъекта.НайтиПоКоду(ПрочитанноеЗначение);
										Иначе
											Значение = ОписаниеТипа.МенеджерОбъекта.НайтиПоРеквизиту(ПолеПоиска, ПрочитанноеЗначение);
										КонецЕсли;
										
										Если ЗначениеЗаполнено(Значение) Тогда
											Прервать;
										КонецЕсли;
										
									КонецЦикла;
									
								КонецЕсли;
								
							ИначеЕсли ОписаниеТипа.КлассОМ = "Перечисление" Тогда
								
								Если ОписаниеТипа.ПолноеИмяТипа = "Перечисление.СтавкиНДС" Тогда
									Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПрочитанноеЗначение,, Истина) Тогда
										Значение = Справочники.СтавкиНДС.ПолучитьСтавкуНДСпоСтроковомуЗначению(ПрочитанноеЗначение);
									КонецЕсли;
								КонецЕсли;
								
								Если Не ЗначениеЗаполнено(Значение) Тогда
									Для Каждого ЗначениеПеречисления Из ОписаниеТипа.МенеджерОбъекта Цикл
										Если НРег(ПрочитанноеЗначение) = НРег(Строка(ЗначениеПеречисления)) Тогда
											Значение = ЗначениеПеречисления;
											Прервать;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли ОписаниеТипа.ПолноеИмяТипа = "Дата" Тогда
							Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(ПрочитанноеЗначение);
						ИначеЕсли ОписаниеТипа.ПолноеИмяТипа = "Число" Тогда
							Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПрочитанноеЗначение);
						Иначе
							Значение = ПрочитанноеЗначение;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Значение) Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Значение) Тогда
					ДанныеСтроки.Вставить(Поле.Имя, Значение);
					ТабДок.Область(ИмяОбласти).ЦветФона = WebЦвета.Белый;
				Иначе
					ТабДок.Область(ИмяОбласти).ЦветФона = WebЦвета.Розовый;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьЗначение Тогда
			
			НоваяСтрока = ПрочитанныеДанные.Добавить();
			
			НомерСтрокиПрочитанныхДанных = НомерСтрокиПрочитанныхДанных + 1;
			НоваяСтрока.НомерСтроки = НомерСтрокиПрочитанныхДанных;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
			
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ТипоразмерыКТКСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.ТипоразмерыКТКСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "КлассыОпасностиСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.КлассыОпасностиСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ТипоразмерыВагоновСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.ТипоразмерыВагоновСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "КонтейнерыВагоныСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.КонтейнерыВагоныСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ВидыОтправокСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.ВидыОтправокСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			
			// Евросиб US 98207 TA 105661 Рыбьяков К.А. 02.04.2025 ((
			СписокЭлементов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ПродуктыСписок");
			Если ЗначениеЗаполнено(СписокЭлементов) Тогда
				НоваяСтрока.ПродуктыСписок.ЗагрузитьЗначения(СписокЭлементов);
			КонецЕсли;
			// Евросиб Рыбьяков К.А. 02.04.2025 ))
			
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;
		ПредставлениеНомераСтроки = Формат(НомерСтроки, "ЧГ=0");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРазделитель(Текст)
	
	Если СтрНайти(Текст, ";") > 0 Тогда
		Разделитель = ";";
	ИначеЕсли СтрНайти(Текст, ",") > 0 Тогда
		Разделитель = ",";
	ИначеЕсли СтрНайти(Текст, Символы.ПС) > 0 Тогда
		Разделитель = Символы.ПС;
	Иначе
		Разделитель = ";";
	КонецЕсли;
	
	Возврат Разделитель;
					
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	УдалитьИзВременногоХранилища(АдресТаблицыОписанияРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Адрес = ПоместитьВоВременноеХранилищеПрочитаннуюТаблицу();
	Закрыть(Адрес);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеПрочитаннуюТаблицу()
	
	ПрочитаннаяТаблица = ПрочитанныеДанные.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(ПрочитаннаяТаблица, Новый УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ТабДокПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	НомерСтроки = 0;
	Для ИндексСтроки = НомерПервойСчитываемойСтроки По ТабДок.ВысотаТаблицы Цикл
		НомерСтроки = НомерСтроки + 1;
		ПредставлениеНомераСтроки = Формат(ИндексСтроки, "ЧГ=0");
		ИмяОбласти = СтрШаблон("R%1C1", ПредставлениеНомераСтроки);
		ТабДок.Область(ИмяОбласти).Текст = НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры
