///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возникает после окончания формирования отчета: после завершения фонового задания.
// Позволяет переопределить обработку результата формирования отчета.
//
// Параметры:
//  ФормаОтчета - УправляемаяФорма - форма отчета.
//  ОтчетСформирован - Булево - Истина если отчет был успешно сформирован.
//
Процедура ПослеФормирования(ФормаОтчета, ОтчетСформирован) Экспорт   

КонецПроцедуры

// Обработчик расшифровки табличного документа формы отчета.
// См. "Расширение поля формы для поля табличного документа.ОбработкаРасшифровки" в синтакс-помощнике.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   Элемент     - ПолеФормы        - табличный документ.
//   Расшифровка - Произвольный     - значение расшифровки точки, серии или значения диаграммы.
//   СтандартнаяОбработка - Булево  - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	ПолноеИмяОтчета = ФормаОтчета.НастройкиОтчета.ПолноеИмя;

	//Евросиб Каблов 17.11.2021 ( US 33698
	Если ПолноеИмяОтчета = "Отчет.АнализДеятельности" Тогда
		
		СтруктураРасшифровки = ОтчетыВызовСервера.СформироватьДанныеРасшифровкиОтчетаАнализДеятельности(Расшифровка, ФормаОтчета.ОтчетДанныеРасшифровки);
		Если СтруктураРасшифровки.ВыбранноеПоле = "Заявка.НомерЗаявки" Тогда
			
			Заявка = Неопределено;
			Если СтруктураРасшифровки.Свойство("Заявка", Заявка) И ЗначениеЗаполнено(Заявка) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, Заявка);
			КонецЕсли;
			
		ИначеЕсли СтруктураРасшифровки.ВыбранноеПоле = "Сделка.НомерИГод" Тогда
			
			Сделка = Неопределено;
			Если СтруктураРасшифровки.Свойство("Сделка", Сделка) И ЗначениеЗаполнено(Сделка) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, Сделка);
			КонецЕсли;
			
		ИначеЕсли СтруктураРасшифровки.ВыбранноеПоле = "Поступление.НомерПТУ" Или СтруктураРасшифровки.ВыбранноеПоле = "Поступление.НомерВходящегоДокумента" Тогда
			
			Поступление = Неопределено;
			Если СтруктураРасшифровки.Свойство("Поступление", Поступление) И ЗначениеЗаполнено(Поступление) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, Поступление);
			КонецЕсли;
			
		ИначеЕсли СтруктураРасшифровки.ВыбранноеПоле = "Реализация.НомерРТУ" Тогда
			
			Реализация = Неопределено;
			Если СтруктураРасшифровки.Свойство("Реализация", Реализация) И ЗначениеЗаполнено(Реализация) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, Реализация);
			КонецЕсли;
			
		ИначеЕсли СтруктураРасшифровки.ВыбранноеПоле = "НомерКорректировкиРеализации" Тогда
			
			КорректировкаРеализации = Неопределено;
			Если СтруктураРасшифровки.Свойство("КорректировкаРеализации", КорректировкаРеализации) И ЗначениеЗаполнено(КорректировкаРеализации) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, КорректировкаРеализации);
			КонецЕсли;
			
		КонецЕсли;
		//Евросиб Каблов 17.11.2021 )	
	ИначеЕсли ПолноеИмяОтчета = "Отчет.ОтчетПоОперативнойЗадолженности"
		И ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		МассивДопОтборов = Новый Массив;
		ОтборХ = Новый Структура("Организация, ДатаЗадолженности, Договор, МассивДопОтборов", Расшифровка.Организация, Расшифровка.ДатаЗадолженности, Расшифровка.Договор, МассивДопОтборов);
		ОткрытьФорму("Отчет.ОтчетПоПДЗРасшифровка.Форма.ФормаОтчетаДетализацияПНФ", ОтборХ, , Расшифровка.Договор)
	//Евросиб Каблов 17.11.2021 ( US 33698
	ИначеЕсли ПолноеИмяОтчета = "Отчет.ОтчетПоОперативнойДЗ" Тогда
		
		//СтандартнаяОбработка = Ложь;
		
		СтруктураРасшифровки = ОтчетыВызовСервера.СформироватьДанныеРасшифровкиОтчетаАнализДеятельности(Расшифровка, ФормаОтчета.ОтчетДанныеРасшифровки);
		
		ВыбранноеПоле = "";
		Если СтруктураРасшифровки.Свойство("ВыбранноеПоле", ВыбранноеПоле) Тогда
			
			Если ВыбранноеПоле = "НеоплаченныеСчета" Тогда
				
				СтандартнаяОбработка = Ложь;
				
				ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
				ПараметрыФормы.СформироватьПриОткрытии = Истина;
				ПараметрыФормы.КлючВарианта = "РасшифровкаПоДокументу";
				
				КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
				
				Отбор = Новый Структура;
				
				Контрагент = Неопределено;
				Если СтруктураРасшифровки.Свойство("Контрагент", Контрагент) Тогда
					Отбор.Вставить("Контрагент", Контрагент);
				Иначе
					ПолеКонтрагент = Новый ПолеКомпоновкиДанных("Контрагент");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеКонтрагент Тогда
							Отбор.Вставить("Контрагент", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Договор = Неопределено;
				Если СтруктураРасшифровки.Свойство("Договор", Договор) Тогда
					Отбор.Вставить("Договор", Договор);
				Иначе
					ПолеДоговор = Новый ПолеКомпоновкиДанных("Договор");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеДоговор Тогда
							Отбор.Вставить("Договор", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ЦФО = Неопределено;
				Если СтруктураРасшифровки.Свойство("ЦФО", ЦФО) Тогда
					Отбор.Вставить("ЦФО", ЦФО);
				Иначе
					ПолеЦФО = Новый ПолеКомпоновкиДанных("ЦФО");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеЦФО Тогда
							Отбор.Вставить("ЦФО", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ПараметрыФормы.Отбор = Отбор;
								
				ОткрытьФорму("Отчет.НеоплаченныеСчетаПокупателям.Форма", ПараметрыФормы);
				
			ИначеЕсли ВыбранноеПоле = "ПоступлениеДСФакт" Тогда
				
				СтандартнаяОбработка = Ложь;
				
				ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
				ПараметрыФормы.СформироватьПриОткрытии = Истина;
				ПараметрыФормы.КлючВарианта = "РасшифровкаПоДокументу";
				
				КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
				
				ПараметрПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
				ИдентификаторПараметраПериод = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(ПараметрПериод);
				НастройкаПериод = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПараметраПериод);
				
				Отбор = Новый Структура;
				
				Контрагент = Неопределено;
				Если СтруктураРасшифровки.Свойство("Контрагент", Контрагент) Тогда
					Отбор.Вставить("Контрагент", Контрагент);
				Иначе
					ПолеКонтрагент = Новый ПолеКомпоновкиДанных("Контрагент");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеКонтрагент Тогда
							Отбор.Вставить("Контрагент", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Договор = Неопределено;
				Если СтруктураРасшифровки.Свойство("Договор", Договор) Тогда
					Отбор.Вставить("Договор", Договор);
				Иначе
					ПолеДоговор = Новый ПолеКомпоновкиДанных("Договор");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеДоговор Тогда
							Отбор.Вставить("Договор", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ЦФО = Неопределено;
				Если СтруктураРасшифровки.Свойство("ЦФО", ЦФО) Тогда
					Отбор.Вставить("ЦФО", ЦФО);
				Иначе
					ПолеЦФО = Новый ПолеКомпоновкиДанных("ЦФО");
					Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование И ЭлементНастройки.ЛевоеЗначение = ПолеЦФО Тогда
							Отбор.Вставить("ЦФО", ЭлементНастройки.ПравоеЗначение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				//Отбор.Вставить("ДокументВзаиморасчетов.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя"));
				Отбор.Вставить("ВидЗадолженности", ПредопределенноеЗначение("Перечисление.ВидыЗадолженности.НепривязанныеДеньги"));
				
				Если НастройкаПериод.Использование Тогда
					Отбор.Вставить("ПериодОтчета", НастройкаПериод.Значение);
				КонецЕсли;
				
				ПараметрыФормы.Отбор = Отбор;								
				ОткрытьФорму("Отчет.ВзаиморасчетыСПокупателями.Форма", ПараметрыФормы);
				
			Иначе
				
				ПоляБезРасшифровки = Новый Массив;
				ПоляБезРасшифровки.Добавить("СуммаДЗ");
				ПоляБезРасшифровки.Добавить("СуммаКЗ");
				ПоляБезРасшифровки.Добавить("СальдоВзаиморасчетов");
				ПоляБезРасшифровки.Добавить("СуммаПДЗ");
				ПоляБезРасшифровки.Добавить("ПлановаяДатаОплатыРесурс");
				ПоляБезРасшифровки.Добавить("СальдоПДЗ");
				ПоляБезРасшифровки.Добавить("ДЗ_До30");
				ПоляБезРасшифровки.Добавить("ДЗ_От31До45");
				ПоляБезРасшифровки.Добавить("ДЗ_От46До60");
				ПоляБезРасшифровки.Добавить("ДЗ_От61До180");
				ПоляБезРасшифровки.Добавить("ДЗ_От181До10Месяцев");
				ПоляБезРасшифровки.Добавить("ДЗ_Более10Месяцев");
				ПоляБезРасшифровки.Добавить("КомментарийПДЗ");
				ПоляБезРасшифровки.Добавить("КомментарииМенеджера");
				ПоляБезРасшифровки.Добавить("ИзменениеДЗ");
				ПоляБезРасшифровки.Добавить("ИзменениеПДЗ");
				ПоляБезРасшифровки.Добавить("ПоступлениеДСПлан");
				
				Если ПоляБезРасшифровки.Найти(ВыбранноеПоле) <> Неопределено Тогда
					СтандартнаяОбработка = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
	//Евросиб Каблов 17.11.2021 ( US 33698
	
	//Евросиб СубботинВ #85322 30.05.2024 Начало 
	
	ИначеЕсли ПолноеИмяОтчета = "Отчет.НеоплаченныеСчетаПокупателям" Тогда 
		СтруктураРасшифровки = ОтчетыВызовСервера.СформироватьДанныеРасшифровкиОтчетаАнализДеятельности(Расшифровка, ФормаОтчета.ОтчетДанныеРасшифровки);
		Если СтруктураРасшифровки.ВыбранноеПоле = "НеразнесеннаяСумма" или СтруктураРасшифровки.ВыбранноеПоле = "НеразнесеннаяСуммаРуб" Тогда
			СтандартнаяОбработка = Ложь;			
			ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии, ПользовательскиеНастройки");
			ПараметрыФормы.СформироватьПриОткрытии = Истина;

					
			ПараметрыФормы.КлючВарианта = "ЛинейныйРасшифровка";
			ПараметрыФормы.ПользовательскиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки; 
			ОтборХ = Новый Структура("Контрагент, Договор, Валюта", СтруктураРасшифровки.Контрагент, СтруктураРасшифровки.Договор, СтруктураРасшифровки.Валюта);
			//Настройки = Отчеты.НеоплаченныеСчетаПокупателям.СохранитьВариантНастроек(ФормаОтчета.Отчет.ИдентификаторТипаОтчета,
			//		ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта,ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
			//  
			КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
			
			Для Каждого ПараметрОтчета из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 
			Если  Тип(ПараметрОтчета) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					Если ПараметрОтчета.Использование тогда 
						ОтборХ.Вставить(Строка(ПараметрОтчета.Параметр), ПараметрОтчета.Значение);
					КонецЕсли;
			//	Иначе	
			//		Если ПараметрОтчета.Использование тогда 
			//			ОтборХ.Вставить(Строка(ПараметрОтчета.ЛевоеЗначение), ПараметрОтчета.ПравоеЗначение);
			//		КонецЕсли;
			КонецЕсли;
			//	
			КонецЦикла; 			
			                		
			ПараметрыФормы.Отбор = ОтборХ;
			
			ОткрытьФорму("Отчет.НеоплаченныеСчетаПокупателям.Форма", ПараметрыФормы);
		КонецЕсли;
	
	//Евросиб СубботинВ #85322 30.05.2024 Конец
	КонецЕсли;
	
КонецПроцедуры

// Обработчик дополнительной расшифровки (меню табличного документа формы отчета).
// См. "Расширение поля формы для поля табличного документа.ОбработкаДополнительнойРасшифровки" в синтакс-помощнике.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   Элемент     - ПолеФормы        - табличный документ.
//   Расшифровка - Произвольный     - значение расшифровки точки, серии или значения диаграммы.
//   СтандартнаяОбработка - Булево  - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаДополнительнойРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	Если НЕ СтрНайти(ФормаОтчета.ИмяФормы,"Отчет.ОтчетПоПДЗ") = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Параметры = Новый Структура("Отчет,ОтчетДанныеРасшифровки,Расшифровка", ФормаОтчета.Отчет,ФормаОтчета.ЭтаФорма.ДанныеРасшифровки,Расшифровка);
		ОткрытьФорму("Отчет.ОтчетПоПДЗ.Форма.ФормаРасшифровка",Параметры,ФормаОтчета,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик команд, добавленных динамически и подключенных к обработчику "Подключаемый_Команда".
// Пример добавления команды см. ОтчетыПереопределяемый.ПриСозданииНаСервере().
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   Команда     - КомандаФормы     - команда, которая была вызвана.
//   Результат   - Булево           - Истина, если вызов команды обработан.
//
Процедура ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	ПолноеИмяОтчета = ФормаОтчета.НастройкиОтчета.ПолноеИмя;

	//Евросиб Каблов 17.11.2021 ( US 33698
	Если ПолноеИмяОтчета = "Отчет.АнализДеятельности" Тогда
		Если Команда.Имя = "ВыгрузитьВоВнешнююБазуДанных" Тогда
			ОткрытьФорму("Отчет.АнализДеятельности.Форма.ВыгрузкаОтчетаВоВнешнююБазу");
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 17.11.2021 )
	
	//Евросиб Каблов 24.10.2022 ( US 54532
	Если ПолноеИмяОтчета = "Отчет.ОтчетПоОперативнойДЗ" Тогда
		
		Если Команда.Имя = "ОтображатьЗаголовкиТабличногоДокумента" Тогда
			Кнопка = ФормаОтчета.Элементы.ОтображатьЗаголовкиТабличногоДокумента;
			Пометка = Не Кнопка.Пометка;
			Кнопка.Пометка = Пометка;
        	ФормаОтчета.Элементы.ОтчетТабличныйДокумент.ОтображатьЗаголовки = Пометка;
		КонецЕсли;
		
		Если Команда.Имя = "ВыгрузитьВExcel" Тогда
			
			ДвоичныеДанныеФайла = ОтчетыВызовСервера.ВыгрузитьВExcel(ФормаОтчета.Отчет.КомпоновщикНастроек, ФормаОтчета.НастройкиОтчета.АдресСхемы);
			
			ДопПараметры = Новый Структура("ДвоичныеДанныеФайла", ДвоичныеДанныеФайла);
			ОповещениеОВыбореФайла = Новый ОписаниеОповещения("СохранитьВВыбранныйФайл", ОтчетыКлиентПереопределяемый, ДопПараметры);
			
			ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			ДиалогВыбора.МножественныйВыбор = Ложь;
			ДиалогВыбора.Фильтр = "Microsoft Excel (XLSX)|*.xlsx";			
			ДиалогВыбора.Показать(ОповещениеОВыбореФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 24.10.2022 )
	
КонецПроцедуры

// Обработчик результата выбора подчиненной формы.
// См. "УправляемаяФорма.ОбработкаВыбора" в синтакс-помощнике.
//
// Параметры:
//   ФормаОтчета       - УправляемаяФорма - форма отчета.
//   ВыбранноеЗначение - Произвольный     - результат выбора в подчиненной форме.
//   ИсточникВыбора    - УправляемаяФорма - форма, где осуществлен выбор.
//   Результат         - Булево           - Истина, если результат выбора обработан.
//
Процедура ОбработкаВыбора(ФормаОтчета, ВыбранноеЗначение, ИсточникВыбора, Результат) Экспорт
	
КонецПроцедуры

// Обработчик двойного щелчка мыши, нажатия клавиши Enter или гиперссылки в табличном документе формы отчета.
// См. "Расширение поля формы для поля табличного документа.Выбор" в синтакс-помощнике.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   Элемент     - ПолеФормы        - табличный документ.
//   Область     - ОбластьЯчеекТабличногоДокумента - выбранное значение.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработкаВыбораТабличногоДокумента(ФормаОтчета, Элемент, Область, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик широковещательного оповещения формы отчета.
// См. "УправляемаяФорма.ОбработкаОповещения" в синтакс-помощнике.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   ИмяСобытия  - Строка           - идентификатор события для принимающих форм.
//   Параметр    - Произвольный     - расширенная информация о событии.
//   Источник    - УправляемаяФорма, Произвольный - источник события.
//   ОповещениеОбработано - Булево - признак того, что событие обработано.
//
Процедура ОбработкаОповещения(ФормаОтчета, ИмяСобытия, Параметр, Источник, ОповещениеОбработано) Экспорт
	
КонецПроцедуры

// Обработчик нажатия на кнопку выбора периода в отдельной форме.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - форма отчета.
//   Период - СтандартныйПериод - значение настройки компоновщика, соответствующей выбранному периоду.
//   СтандартнаяОбработка - Булево - если Истина, то будет использован стандартный диалог выбора периода.
//       Если установить в Ложь то стандартный диалог не откроется.
//   ОбработчикРезультата - ОписаниеОповещения - обработчик результата выбора периода.
//       В качестве результата в ОбработчикРезультата могут быть переданы значения типов:
//       Неопределено - пользователь отказался от ввода периода.
//       СтандартныйПериод - выбранный период.
//
//  Если в конфигурации используется собственный диалог выбора периода,
//      тогда параметр СтандартнаяОбработка следует установить в Ложь,
//      а выбранный период следует вернуть в ОбработчикРезультата.
//
Процедура ПриНажатииКнопкиВыбораПериода(ФормаОтчета, Период, СтандартнаяОбработка, ОбработчикРезультата) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Евросиб Каблов 24.10.2022 US 54532
Процедура СохранитьВВыбранныйФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ИмяФайла = ВыбранныеФайлы[0];
		ДанныеФайла = ДополнительныеПараметры.ДвоичныеДанныеФайла;
		ДанныеФайла.Записать(ИмяФайла);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти