
Процедура ПередЗаписью(Отказ)
	
	КритерийУникален = ПроверитьУникальностьКритерия();
	Если Не КритерийУникален Тогда
		ОбщегоНазначения.СообщитьПользователю("Новый Тариф поставщика имеет неуникальные критерии!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
	Наименование = СтрШаблон("%1/%2 - %3", Код, Строка(Поставщик), Строка(Номенклатура));
	
КонецПроцедуры

Функция ПроверитьУникальностьКритерия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УсловияЗапроса = Новый Массив;
	ШаблонУсловия = "Критерий.%1 = &%1";
	Для Каждого Реквизит Из Метаданные.Справочники.КритерииУслугПоставщиков.Реквизиты Цикл
		
		УсловиеЗапроса = СтрШаблон(ШаблонУсловия, Реквизит.Имя);
		УсловияЗапроса.Добавить(УсловиеЗапроса);
		
		Запрос.УстановитьПараметр(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
		
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Критерий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КритерииУслугПоставщиков КАК Критерий
	|ГДЕ
	|	Критерий.Номенклатура = &Номенклатура
	|	И Критерий.Ссылка <> &Ссылка";
	УсловияТекст = СтрСоединить(УсловияЗапроса, Символы.ПС + Символы.Таб + "И ");
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Критерий.Номенклатура = &Номенклатура", УсловияТекст);
	
	РезультатЗапроса = Запрос.Выполнить();	
	КритерийУникален = РезультатЗапроса.Пустой();
	
	Возврат КритерийУникален;
	
КонецФункции
