&НаСервереБезКонтекста
Функция ПолучитьДанныеССервера()
	
	Возврат Новый Структура("Макет, Папка", ПолучитьОбщийМакет("КомпонентыГеосервиса"), ПараметрыСеанса.ПапкаГеосервиса);
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПапкуГеосервиса(Папка)
	ПараметрыСеанса.ПапкаГеосервиса = Папка;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеБегункаМасштаба()
	
	ОтображатьБегунок = ЗначениеЗаполнено(ОтборРегион);
	Элементы.ГруппаБегункаМасштаба.Видимость = ОтображатьБегунок;
	БегунокМасштабаДанные.Очистить();
	Если ОтображатьБегунок Тогда
		Данные = ПолучитьСодержимоеТЧБегункаМасштаба(ОтборРегион);
		Для каждого Стр из Данные Цикл
			ЗаполнитьЗначенияСвойств(БегунокМасштабаДанные.Добавить(), Стр);
		КонецЦикла;
		Элементы.БегунокМасштаба.МаксимальноеЗначение = БегунокМасштабаДанные.Количество();
		БегунокМасштаба = 1;
		БегунокМасштабаТекЗн = ОтборРегион;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСодержимоеТЧБегункаМасштаба(Знач Регион)
	
	Результат = Новый Массив;
	Счетчик = 1;
	Результат.Добавить(Новый Структура("ЧислоСоответствия, Местоположение",  Счетчик, Регион));
	Пока ЗначениеЗаполнено(Регион.Родитель) Цикл
		Регион = Регион.Родитель;
		Счетчик = Счетчик + 1;
		Результат.Добавить(Новый Структура("ЧислоСоответствия, Местоположение",  Счетчик, Регион));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.РежимОтображенияТСТЕ.Доступность = ОтображатьПрогноз;
	Элементы.ГруппаТС.Доступность = НЕ ОтображатьПрогноз ИЛИ (РежимОтображенияТСТЕ = 0);
	Элементы.ГруппаТЕ.Доступность = НЕ ОтображатьПрогноз ИЛИ (РежимОтображенияТСТЕ = 1);
	
	Если ОтображатьПрогноз Тогда 
		Если РежимОтображенияТСТЕ = 0 Тогда
			ТЕ.Очистить();
			ТипТЕ.Очистить();
			ВладелецТЕ.Очистить();
			ОтображатьТЕ = 0;
		Иначе
			ТС.Очистить();
			ТипТС.Очистить();
			ВладелецТС.Очистить();
			ОтображатьТС = 0;
		КонецЕсли;
	КонецЕсли;
	Элементы.ОстаткиНаДату.Доступность = НЕ ОтображатьПрогноз;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОстаткиНаДату = ТекущаяДата();
	Если НЕ ЗначениеЗаполнено(ПрогнозНаДату) Тогда
		ПрогнозНаДату = Дата("20991231");
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Отказ = Истина;
	#Иначе
	ДанныеССервера = ПолучитьДанныеССервера();
	Если НЕ ЗначениеЗаполнено(ДанныеССервера.Папка) Тогда
		КаталогГеосервиса = КаталогВременныхФайлов()+Строка(Новый УникальныйИдентификатор());
		СоздатьКаталог(КаталогГеосервиса);
		ДанныеССервера.Макет.Записать(КаталогГеосервиса+"\data.zip");
		ЗИП = Новый ЧтениеZipФайла(КаталогГеосервиса+"\data.zip");
		Попытка
			ЗИП.ИзвлечьВсе(КаталогГеосервиса, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		Исключение
			ОО = ОписаниеОшибки();
			Сообщить(ОО, СтатусСообщения.ОченьВажное);
			Возврат;
		КонецПопытки;
		ЗИП.Закрыть();
		УстановитьПапкуГеосервиса(КаталогГеосервиса);
	Иначе
		КаталогГеосервиса = ДанныеССервера.Папка;
	КонецЕсли;
	
	Перестроить(неопределено);
	ОбновитьОтображениеБегункаМасштаба();
	ОбновитьВидимостьДоступность();
	ПодключитьОбработчикОжидания("ПроверитьВыборПункта", 1);
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОперациюПоНомеруИГоду(Номер, Год)
	
	Возврат Документы.Операция.НайтиПоНомеру(Номер, Дата(СтрЗаменить(Год, Символы.НПП, "")+"0101"));
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВыборПункта()
	Для каждого Стр из Элементы.ХТМЛ.Документ.all Цикл
		Если Стр.id = "openreport" И Стр.Value <> "none" Тогда
			ОткрытьФорму("Отчет.ПрогнозДвиженияТСТЕ.Форма", Новый Структура("Местоположение, Заказ, ДатаПрогноза", Стр.Value, ?(Заказ.Количество() > 0, Заказ[0].Значение, неопределено), ПрогнозНаДату));
			Стр.Value = "none";
		КонецЕсли;
		Если Стр.id = "openoperation" И Стр.Value <> "none" Тогда
			
			РезМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.Value, "_");
			НайденнаяОперация = НайтиОперациюПоНомеруИГоду(РезМассив[0], РезМассив[1]);
			Если НайденнаяОперация <> ПредопределенноеЗначение("Документ.Операция.ПустаяСсылка") И НайденнаяОперация <> Неопределено Тогда
				ПоказатьЗначение(,НайденнаяОперация);
			КонецЕсли;
			
			Стр.Value = "none";
		КонецЕсли;
		Если Стр.id = "openmismatch" И Стр.Value <> "none" Тогда
			
			ОткрытьФорму("Отчет.АнализНедостоверныхДвижений.Форма", Новый Структура("Местоположение", Стр.Value));
			
			Стр.Value = "none";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Маркеры") ИЛИ НЕ Параметры.Свойство("Линии") Тогда
		Отказ = Истина;
		Возврат;                                      
	КонецЕсли;
	
	Для каждого Стр из Параметры.Маркеры Цикл
		ЗаполнитьЗначенияСвойств(Маркеры.Добавить(), Стр);
	КонецЦикла;
	
	Для каждого Стр из Параметры.Линии Цикл
		ЗаполнитьЗначенияСвойств(Линии.Добавить(), Стр);
	КонецЦикла;
	
	Если Параметры.Свойство("ДатаПрогноза") Тогда
		ПрогнозНаДату = Параметры.ДатаПрогноза;
		ОтображатьПрогноз = ЗначениеЗаполнено(ПрогнозНаДату);
	КонецЕсли;
	
	Если Параметры.Свойство("Регион") Тогда
		ОтборРегион = Параметры.Регион;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипТС") Тогда
		ТипТС.ЗагрузитьЗначения(Параметры.ТипТС);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипТЕ") Тогда
		ТипТЕ.ЗагрузитьЗначения(Параметры.ТипТЕ);
	КонецЕсли;
	
	Если Параметры.Свойство("РежимОтображенияТСТЕ") Тогда
		РежимОтображенияТСТЕ = Параметры.РежимОтображенияТСТЕ;
	КонецЕсли;
	
	Если Параметры.Свойство("Заказ") Тогда
		Заказ.Добавить(Параметры.Заказ);
	КонецЕсли;
	
	ЦветПодсвеченнойКнопки = ЦветаСтиля.ЦветМиганияКнопок;
	КоличествоОтрезков = Константы.КоличествоОтрезковПриПостроенииМаршрутовТС.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура Перестроить(Команда, Широта = "59.900857", Долгота = "30.288649")
	
	МассивМаркеров = Новый Массив;
	Для каждого Стр из Маркеры Цикл
		НСтруктура = Новый Структура("Широта, Долгота, Подсказка");
		ЗаполнитьЗначенияСвойств(НСтруктура, Стр);
		МассивМаркеров.Добавить(НСтруктура);
	КонецЦикла;
	
	МассивЛиний = Новый Массив;
	Для каждого Стр из Линии Цикл
		НСтруктура = Новый Структура("ШиротаНачало, ДолготаНачало, ШиротаКонец, ДолготаКонец, Цвет, Пунктиром");
		ЗаполнитьЗначенияСвойств(НСтруктура, Стр);
		МассивЛиний.Добавить(НСтруктура);
	КонецЦикла;
	
	Если МассивМаркеров.Количество() = 1 Тогда
		Широта = МассивМаркеров[0].Широта;
		Долгота = МассивМаркеров[0].Долгота;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ОстаткиНаДату", ОстаткиНаДату);
	СтруктураПараметров.Вставить("Заказ", Заказ.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ОтборОрганизация", ОтборОрганизация);
	СтруктураПараметров.Вставить("ОтборРегион", ОтборРегион);
	СтруктураПараметров.Вставить("ОтображатьПрогноз", ОтображатьПрогноз);
	СтруктураПараметров.Вставить("ОтображатьТЕ", ОтображатьТЕ);
	СтруктураПараметров.Вставить("ОтображатьТС", ОтображатьТС);
	СтруктураПараметров.Вставить("ПрогнозНаДату", ПрогнозНаДату);
	СтруктураПараметров.Вставить("РежимОтображенияТСТЕ", РежимОтображенияТСТЕ);
	СтруктураПараметров.Вставить("ТЕ", ТЕ.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ТипТЕ", ТипТЕ.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ТипТС", ТипТС.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ТС", ТС.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ВладелецТЕ", ВладелецТЕ.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ВладелецТС", ВладелецТС.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ОтобразитьТрек", ОтобразитьТрекТСПодсветка);
	СтруктураПараметров.Вставить("КоличествоОтрезков", КоличествоОтрезков);
	
	ЕстьПереданныеПараметры = МассивМаркеров.Количество() > 0 ИЛИ МассивЛиний.Количество() > 0;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобразитьОстатки.Видимость = ЕстьПереданныеПараметры;
	
	Если ЕстьПереданныеПараметры Тогда
		ХТМЛ = Геосервис_Сервер.СоздатьХТМЛ(КаталогГеосервиса, Широта, Долгота, , МассивМаркеров, МассивЛиний);
	Иначе
		ХТМЛ = Геосервис_Сервер.СоздатьХТМЛ(КаталогГеосервиса, Широта, Долгота, , , , СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОстатки(Команда)
	
	Линии.Очистить();
	Маркеры.Очистить();
	Перестроить(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиНаДатуПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	
	ТС.Очистить();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	
	ТипТС.Очистить();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТСПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРегионПриИзменении(Элемент)
	
	Перестроить(,,);
	ОбновитьОтображениеБегункаМасштаба();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияТСТЕПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПрогнозПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозНаДатуПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТЕПриИзменении(Элемент)
	
	ТЕ.Очистить();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЕПриИзменении(Элемент)
	
	ТипТЕ.Очистить();
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТЕПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецТСПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецТЕПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДопФильтры(Команда)
	
	Элементы.ОтборОрганизация.Видимость = Истина;
	Элементы.Декорация1.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БегунокМасштабаПриИзменении(Элемент)
	
	Для каждого Стр из БегунокМасштабаДанные Цикл
		Если Стр.ЧислоСоответствия = БегунокМасштаба Тогда
			БегунокМасштабаТекЗн = Стр.Местоположение;
			ОтборРегион = Стр.Местоположение;
			Перестроить(,,);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	Перестроить(,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьТрекТС(Команда)
	
	ОтобразитьТрекТСПодсветка = НЕ ОтобразитьТрекТСПодсветка;
	Элементы.ОтобразитьТрекТС.ЦветФона = ?(ОтобразитьТрекТСПодсветка, ЦветПодсвеченнойКнопки, Элементы.РежимОтображенияТСТЕ.ЦветФона);
	Перестроить(неопределено,,);
	
КонецПроцедуры
