
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(Объект.ДатаНачалаПериодаДействия, Объект.ДатаОкончанияПериодаДействия);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог;
	Если НЕ Период = Неопределено Тогда
		Объект.ДатаНачалаПериодаДействия = Период.ДатаНачала;
		Объект.ДатаОкончанияПериодаДействия = Период.ДатаОкончания; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативыКлиентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораКлиента", ЭтаФорма,);	
	ОткрытьФорму("Документ.НормативКонтрибуции.Форма.ФормаВыбораКонрагента", Новый Структура("ГУИД,АдресХран", Элементы.Нормативы.ТекущиеДанные.ГУИД,ПолучитьАдресТаблицыКлиентов()),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НормативыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		ГуидОснования = Элемент.ТекущиеДанные.ГУИД;
		
		Элемент.ТекущиеДанные.ГУИД = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Копирование Тогда
		
		СкопироватьКлиентов(ГуидОснования,Элемент.ТекущиеДанные.ГУИД);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКлиентов(ГУИДОснования,НовыйГуид)
	
	сОтборСтрок = Новый Структура("ГУИД",ГУИДОснования);
	НайденныеСтроки = Объект.Клиенты.НайтиСтроки(сОтборСтрок);		
	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		НовСтрока = Объект.Клиенты.Добавить();
		НовСтрока.Клиент = СтрокаТЧ.Клиент;
		НовСтрока.ГУИД = НовыйГуид;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораКлиента(Результат,Параметр2) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЗаполнитьТаблицуКлиентов(Результат);

		ГУИД 	= Элементы.Нормативы.ТекущиеДанные.ГУИД;
		
		сОтборСтрок = Новый Структура("ГУИД",ГУИД);
		НайденныеСтроки = Объект.Клиенты.НайтиСтроки(сОтборСтрок);
		
		мКлиенты = Новый Массив;
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			мКлиенты.Добавить(СтрокаТЧ.Клиент);	
		КонецЦикла;
		
		Элементы.Нормативы.ТекущиеДанные.Клиент = СтрСоединить(мКлиенты,";");
		
		Если ЗаполнятьПоПервойСтроке Тогда
			
			МассивГуидов = Новый Массив;
			Для Сч = 0 По Объект.Нормативы.Количество() - 1 Цикл
				
				РезПроверки = Элементы.Нормативы.ПроверитьСтроку(Объект.Нормативы[Сч].ПолучитьИдентификатор());
				Если РезПроверки = Истина Тогда
					
					Если Сч=0 тогда 
						продолжить;
					КонецЕсли;	
					МассивГуидов.Добавить(Объект.Нормативы[Сч].ГУИД);
				КонецЕсли; 
				
			КонецЦикла;
			
			Для Каждого зГуид Из МассивГуидов Цикл
				НайденныеСтрокиПоГуиду = Объект.Клиенты.НайтиСтроки(Новый Структура("ГУИД",зГуид));
				Для Каждого нСтрока Из НайденныеСтрокиПоГуиду Цикл
					Объект.Клиенты.Удалить(нСтрока);
				КонецЦикла;	
			КонецЦикла;
			
			МассивКлиентов = Новый МАссив;
			Для Каждого СтрокаК Из Объект.Клиенты Цикл
				МассивКлиентов.Добавить(СтрокаК.Клиент);	
			КонецЦикла;
			
			Для Каждого зГуид Из МассивГуидов Цикл
				Для Каждого зКлиент Из МассивКлиентов Цикл
					НовСтрока = Объект.Клиенты.Добавить();
					НовСтрока.Клиент = зКлиент;
					НовСтрока.ГУИД = зГуид;
				КонецЦикла;
			КонецЦикла;	
			
			
			Для Каждого СтрокаТЧ Из Объект.Нормативы Цикл
				
				сОтборСтрок = Новый Структура("ГУИД",СтрокаТЧ.ГУИД);
				НайденныеСтроки = Объект.Клиенты.НайтиСтроки(сОтборСтрок);
				
				мКлиенты = Новый Массив;
				
				Для Каждого СтрокаК Из НайденныеСтроки Цикл
					мКлиенты.Добавить(СтрокаК.Клиент);	
				КонецЦикла;
				
				СтрокаТЧ.Клиент = СтрСоединить(мКлиенты,";");
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуКлиентов(Результат)
	
	ТЗКлиенты = ПолучитьИзВременногоХранилища(Результат);
	
	Если ЗаполнятьПоПервойСтроке Тогда
		Объект.Клиенты.Очистить();
	КонецЕсли;	
	
	Объект.Клиенты.Загрузить(ТЗКлиенты);	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьАдресТаблицыКлиентов()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Клиенты.Выгрузить(),ЭтаФОрма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура НормативыПередУдалением(Элемент, Отказ)
	ВыделенныеСтроки = Элементы.Нормативы.ВыделенныеСтроки;
	
	Для Каждого СтрокаТЧ Из ВыделенныеСтроки Цикл
		
		УдалитьСтрокиКлиентов(Объект.Нормативы.НайтиПоИдентификатору(СтрокаТЧ).ГУИД);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиКлиентов(ГУИД)
	
	сОтборСтрок = Новый Структура("ГУИД",ГУИД);
	НайденныеСтроки = Объект.Клиенты.НайтиСтроки(сОтборСтрок);
	
	мКлиенты = Новый Массив;
	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		мКлиенты.Добавить(СтрокаТЧ);	
	КонецЦикла;	
	
	Для Каждого ЗнчМ Из мКлиенты Цикл
		Объект.Клиенты.Удалить(ЗнчМ);
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузкиИзEXCEL(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаЗагрузкиИзEXCEL", ЭтаФорма);	
	ОткрытьФорму("Документ.НормативКонтрибуции.Форма.ФормаВставкиНормативнойКонтрибуцииИзБуфераОбмена",,, ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиИзEXCEL(Результат,Параметр2) Экспорт
	Если Результат <> Неопределено Тогда
		
		Для Каждого сДанныеДляСтроки Из Результат Цикл
			НовСтр = Объект.Нормативы.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовСтр,сДанныеДляСтроки,,"Клиент");
			
			НовСтрКлиент = Объект.Клиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрКлиент,сДанныеДляСтроки);
			
			НовСтр.Клиент = сДанныеДляСтроки.Клиент;
			
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьТипыЛокаций()
		ТипыЛокаций = Новый СписокЗначений;
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.СтанцияЖД);
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.НаселенныйПункт);
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Регион);
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Страна);
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Терминал);
		ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Порт);
		Возврат ТипыЛокаций;
КонецФункции

&НаКлиенте
Процедура НормативыПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТипыЛокаций = ПолучитьТипыЛокаций();
	
	П = Новый Структура("ТипЛокации", ТипыЛокаций);
	ОткрытьФорму("Справочник.Локации.ФормаВыбора",П,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НормативыПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ТипыЛокаций = ПолучитьТипыЛокаций();

	П = Новый Структура("ТипЛокации", ТипыЛокаций);
    ОткрытьФорму("Справочник.Локации.ФормаВыбора",П,Элемент);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеТипыЛокаций = ПолучитьТипыЛокаций();
	
КонецПроцедуры

&НаКлиенте
Процедура НормативыПриИзменении(Элемент)
	ТекД = Элементы.Нормативы.ТекущиеДанные;
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];
		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.Нормативы.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			Если РезПроверки = Истина Тогда
				
				Если Сч=0 тогда 
					продолжить;
				КонецЕсли;
				Элементы.Нормативы.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;	
				
			КонецЕсли; 
			
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

