#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("НаименованиеПолное");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = Данные.НаименованиеПолное;
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

Функция СоставМультилокации(Мультилокация) Экспорт
	// Евросиб Фролов (16.02.2022 Task №46605
	Если Не ЗначениеЗаполнено(Мультилокация) Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	Локации = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Мультилокация, "Локации");
	Возврат Локации.Выгрузить().ВыгрузитьКолонку("Локация");
	// Евросиб Фролов)
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//Евросиб Каблов 01.11.2024 ( #67092
	//РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("Мультилокации", ДанныеВыбора, Параметры, СтандартнаяОбработка);
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьМультилокацииПоПараметрам(Параметры.СтрокаПоиска, Параметры.Отбор, Ложь));
	//Евросиб Каблов 01.11.2024 )
КонецПроцедуры

//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
Функция ПолучитьКлючНабораЛокаций( МассивЛокаций ) Экспорт
	
	ИдентификаторыНаборов = Новый СписокЗначений;
	
	Для каждого ЭлементМассива Из МассивЛокаций Цикл
		Если НЕ ЗначениеЗаполнено(ЭлементМассива) Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторыНаборов.Добавить(Строка(ЭлементМассива.УникальныйИдентификатор()));
	КонецЦикла;
	
	ИдентификаторыНаборов.СортироватьПоЗначению();
	СтрокаИдентификаторов = "";
	
	Для каждого ЭлементСписка Из ИдентификаторыНаборов Цикл
		СтрокаИдентификаторов = СтрокаИдентификаторов + СтрЗаменить(ЭлементСписка.Значение, "-", "");
	КонецЦикла;
	
	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтрокаИдентификаторов);
	
КонецФункции
//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец

//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
Функция ПолучитьМультилокациюСАналогичнымНаборомЛокаций(Ссылка, КлючНабораЛокаций) Экспорт
	Результат = Справочники.Мультилокации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мультилокации.Ссылка КАК Мультилокация
		|ИЗ
		|	Справочник.Мультилокации КАК Мультилокации
		|ГДЕ
		|	Мультилокации.КлючНабораЛокаций = &КлючНабораЛокаций
		// ДИТ US 83045 ТА 85915 Сержантова А.С. Начало: 31.05.2024
		|	И НЕ Мультилокации.ПометкаУдаления
		// ДИТ US 83045 ТА 85915 Сержантова А.С. Конец: 31.05.2024
		|	И Мультилокации.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КлючНабораЛокаций", КлючНабораЛокаций);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Мультилокация;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало

//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
//Функция ПолучитьМассивМультилокацийСодержащиеЛокации( СписокЛокаций ) Экспорт
//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, добавил параметр МассивТиповЛокаций
Функция ПолучитьМассивМультилокацийСодержащиеЛокации( СписокЛокаций, МассивТиповЛокаций = Неопределено ) Экспорт
	
	Запрос = Новый Запрос;    
	// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 07.06.2024
	// Было:
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	МультилокацииЛокации.Ссылка КАК Мультилокация
	//	|ИЗ
	//	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	//	|ГДЕ
	//	|	МультилокацииЛокации.Локация В(&СписокЛокаций)
	//	|	И МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//	|	И НЕ МультилокацииЛокации.Ссылка.ПометкаУдаления";
	//Стало:
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Локации.Ссылка) КАК КоличествоЛокацийОтбора
	|ПОМЕСТИТЬ ВТ_КоличествоЛокацийВОтборе
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Ссылка В(&СписокЛокаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МультилокацииЛокации.Ссылка КАК Мультилокация,
	|	СУММА(ВЫБОР
	|			КОГДА МультилокацииЛокации.Локация В (&СписокЛокаций)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЛокацийИзОтбора
	|ПОМЕСТИТЬ ВТ_ВсеМультилокацииСодержащиеОтбор
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|ГДЕ
	|	МультилокацииЛокации.Локация В(&СписокЛокаций)
	|	И МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И НЕ МультилокацииЛокации.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, начало
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеМультилокацииСодержащиеОтбор.Мультилокация КАК Мультилокация
	|ПОМЕСТИТЬ ВТ_МультилокацииСЛокациямиНеподходящихТипов
	|ИЗ
	|	ВТ_ВсеМультилокацииСодержащиеОтбор КАК ВТ_ВсеМультилокацииСодержащиеОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО (&ВключитьОтборПоТипамЛокаций)
	|			И (МультилокацииЛокации.Ссылка = ВТ_ВсеМультилокацииСодержащиеОтбор.Мультилокация)
	|			И (НЕ МультилокацииЛокации.Локация.Тип В (&МассивТиповЛокаций))
	|			И (МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеМультилокацииСодержащиеОтбор.Мультилокация КАК Мультилокация
	|ИЗ
	|	ВТ_ВсеМультилокацииСодержащиеОтбор КАК ВТ_ВсеМультилокацииСодержащиеОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоЛокацийВОтборе КАК ВТ_КоличествоЛокацийВОтборе
	|		ПО ВТ_ВсеМультилокацииСодержащиеОтбор.КоличествоЛокацийИзОтбора = ВТ_КоличествоЛокацийВОтборе.КоличествоЛокацийОтбора
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, начало
	|ГДЕ
	|	НЕ ВТ_ВсеМультилокацииСодержащиеОтбор.Мультилокация В
	|				(ВЫБРАТЬ
	|					ВТ_МультилокацииСЛокациямиНеподходящихТипов.Мультилокация
	|				ИЗ
	|					ВТ_МультилокацииСЛокациямиНеподходящихТипов КАК ВТ_МультилокацииСЛокациямиНеподходящихТипов
	|				ГДЕ
	|					&ВключитьОтборПоТипамЛокаций)";
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, конец
	// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 07.06.2024
		
	Запрос.УстановитьПараметр("СписокЛокаций", СписокЛокаций);
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, начало
	Если ТипЗнч(МассивТиповЛокаций) = Тип("Массив") И МассивТиповЛокаций.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("МассивТиповЛокаций", МассивТиповЛокаций);
		Запрос.УстановитьПараметр("ВключитьОтборПоТипамЛокаций", Истина);
	Иначе
		Запрос.УстановитьПараметр("МассивТиповЛокаций", Новый Массив);
		Запрос.УстановитьПараметр("ВключитьОтборПоТипамЛокаций", Ложь);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, конец
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Мультилокация");
КонецФункции
//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец

//Евросиб Каблов 01.11.2024 #67092
Функция ПолучитьМультилокацииПоПараметрам(ПараметрПоиска = Неопределено, ПараметрыОтбораЛокаций = Неопределено, ВернутьТаблицу = Ложь) Экспорт
	
	Если ПараметрыОтбораЛокаций = Неопределено Тогда
		ПараметрыОтбораЛокаций = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
		
	ТипПараметраПоиска = ТипЗнч(ПараметрПоиска);
	ТипМассив = Тип("Массив");
	ТипФиксированныйМассив = Тип("ФиксированныйМассив");
	
	Если ТипПараметраПоиска = Тип("Строка") И ЗначениеЗаполнено(ТипПараметраПоиска) Тогда
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + ПараметрПоиска + "%");
		ТекстУсловияПоиска = "И Мультилокации.НаименованиеПолное ПОДОБНО &СтрокаПоиска";
		
	ИначеЕсли (ТипПараметраПоиска = ТипМассив Или ТипПараметраПоиска = ТипМассив) И ЗначениеЗаполнено(ПараметрПоиска) Тогда
		
		СписокЛокаций = ПараметрПоиска;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультилокацииЛокации.Ссылка КАК Мультилокация,
		|	КОЛИЧЕСТВО(МультилокацииЛокации.Локация) КАК КоличествоЛокацийИзОтбора
		|ПОМЕСТИТЬ МультилокацииСоСпискомЛокаций
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|	И НЕ МультилокацииЛокации.Ссылка.ПометкаУдаления
		|	И МультилокацииЛокации.Локация В(&Локации)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультилокацииЛокации.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(МультилокацииЛокации.Локация) = &КоличествоЛокаций";
		
		ТекстЗапроса = ТекстЗапроса +
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстУсловияПоиска =
		"	И Мультилокации.Ссылка В
		|			(ВЫБРАТЬ
		|				МультилокацииСоСпискомЛокаций.Мультилокация КАК Мультилокация
		|			ИЗ
		|				МультилокацииСоСпискомЛокаций КАК МультилокацииСоСпискомЛокаций)";
		
		Запрос.УстановитьПараметр("Локации", СписокЛокаций);
		Запрос.УстановитьПараметр("КоличествоЛокаций", СписокЛокаций.Количество());
		
	Иначе
		ТекстУсловияПоиска = "";		
	КонецЕсли;	
		
	ТипМассив = Тип("Массив");
	ТипФиксированныйМассив = Тип("ФиксированныйМассив");
	
	Если ЗначениеЗаполнено(ПараметрыОтбораЛокаций) Тогда
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	МультилокацииЛокации.Ссылка КАК Мультилокация,
		|	КОЛИЧЕСТВО(МультилокацииЛокации.Локация) КАК КоличествоЛокацийИзОтбора
		|ПОМЕСТИТЬ МультилокацииПоПараметрам
		|ИЗ
		|	Справочник.Мультилокации КАК Мультилокации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|		ПО Мультилокации.Ссылка = МультилокацииЛокации.Ссылка
		|ГДЕ
		|	НЕ Мультилокации.ПометкаУдаления
		|	И МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|	И МультилокацииЛокации.Локация.Тип В(&ТипыЛокаций)
		|	И Мультилокации.Ссылка В(&МультилокацииСоСпискомЛокаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультилокацииЛокации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультилокацииЛокации.Ссылка КАК Мультилокация,
		|	КОЛИЧЕСТВО(МультилокацииЛокации.Локация) КАК ОбщееКоличествоВМультилокации
		|ПОМЕСТИТЬ ВТ_ОбщееКоличество
		|ИЗ
		|	МультилокацииПоПараметрам КАК МультилокацииПоПараметрам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|		ПО МультилокацииПоПараметрам.Мультилокация = МультилокацииЛокации.Ссылка
		|ГДЕ
		|	МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультилокацииЛокации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МультилокацииПоПараметрам.Мультилокация КАК Мультилокация
		|ИЗ
		|	МультилокацииПоПараметрам КАК МультилокацииПоПараметрам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличество КАК ВТ_ОбщееКоличество
		|		ПО МультилокацииПоПараметрам.Мультилокация = ВТ_ОбщееКоличество.Мультилокация
		|			И МультилокацииПоПараметрам.КоличествоЛокацийИзОтбора = ВТ_ОбщееКоличество.ОбщееКоличествоВМультилокации";
		
		ШаблонУсловия = "И МультилокацииЛокации.Локация.%1 = &%2";
		ШаблонУсловияВ = "И МультилокацииЛокации.Локация.%1 В(&%2)";
		УсловияОтбораЛокаций = Новый Массив;
		
		Для Каждого Параметр Из ПараметрыОтбораЛокаций Цикл
			
			ИмяПараметра = "ПараметрЛокации" + Параметр.Ключ;
			ТипПараметра = ТипЗнч(Параметр.Значение);
			Если ТипЗнч(Параметр.Значение) = ТипМассив Или ТипПараметра = ТипФиксированныйМассив Тогда
				ТекстУсловия = СтрШаблон(ШаблонУсловияВ, Параметр.Ключ, ИмяПараметра);
			Иначе
				ТекстУсловия = СтрШаблон(ШаблонУсловия, Параметр.Ключ, ИмяПараметра);
			КонецЕсли;
			УсловияОтбораЛокаций.Добавить(ТекстУсловия);
			
			Запрос.УстановитьПараметр(ИмяПараметра, Параметр.Значение);
			
		КонецЦикла;
		
		ТекстУсловийОтбораЛокаций = СтрСоединить(УсловияОтбораЛокаций, Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И МультилокацииЛокации.Локация.Тип В(&ТипыЛокаций)", ТекстУсловийОтбораЛокаций);
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	Мультилокации.Ссылка КАК Мультилокация
		|ИЗ
		|	Справочник.Мультилокации КАК Мультилокации
		|ГДЕ
		|	НЕ Мультилокации.ПометкаУдаления
		|	И Мультилокации.Ссылка В(&МультилокацииСоСпискомЛокаций)";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Мультилокации.Ссылка В(&МультилокацииСоСпискомЛокаций)", ТекстУсловияПоиска);
	
	Запрос.Текст = ТекстЗапроса;	
	ТаблицаЛокаций = Запрос.Выполнить().Выгрузить();	
	Если ВернутьТаблицу Тогда
		Результат = ТаблицаЛокаций;
	Иначе
		Результат = ТаблицаЛокаций.ВыгрузитьКолонку("Мультилокация");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
Функция ПолучитьМассивЛокаций( Мультилокация ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МультилокацииЛокации.Локация КАК Локация
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Ссылка = &Мультилокация
		|	И МультилокацииЛокации.Локация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Мультилокация", Мультилокация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Локация");
КонецФункции
//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец

//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало  
// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 10.06.2024
// Было:
//Функция ЕстьДокументыПоМультилокации(КлючНабораЛокацийДоИзменения) 
//	Если НЕ ЗначениеЗаполнено(КлючНабораЛокацийДоИзменения) Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если КлючНабораЛокацийДоИзменения = КлючНабораЛокаций Тогда
//		Возврат Ложь;
//	КонецЕсли;
//Стало:
Функция ЕстьДокументыПоМультилокации(Ссылка) Экспорт
// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 10.06.2024
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыПоМультилокации.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.ДокументыПоМультилокации(&Мультилокация) КАК ДокументыПоМультилокации";
	
	Запрос.УстановитьПараметр("Мультилокация", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
#КонецОбласти

#КонецЕсли	