
Процедура ПередЗаписью(Отказ)
	
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
	
	//Евросиб Каблов 04.04.2023 ( Ticket#0265045
	//Наименование  = СтрСоединить(Локации.ВыгрузитьКолонку("Локация"), "; ");
	ПустыеСтроки = Локации.НайтиСтроки(Новый Структура("Локация", Справочники.Локации.ПустаяСсылка()));
	Для Каждого Стр Из ПустыеСтроки Цикл
		Локации.Удалить(Стр);
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//ТаблицаЛокаций = Локации.Выгрузить();
	//Запрос.УстановитьПараметр("ТаблицаЛокаций", ТаблицаЛокаций);
	
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТаблицаЛокаций.НомерСтроки КАК НомерСтроки,
	//|	ТаблицаЛокаций.Локация КАК Локация
	//|ПОМЕСТИТЬ ТаблицаЛокаций
	//|ИЗ
	//|	&ТаблицаЛокаций КАК ТаблицаЛокаций
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаЛокаций.НомерСтроки КАК НомерСтроки,
	//|	Локации.Наименование КАК Наименование
	//|ИЗ
	//|	ТаблицаЛокаций КАК ТаблицаЛокаций
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	//|		ПО ТаблицаЛокаций.Локация = Локации.Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки";
	
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
	МассивЛокаций = Локации.ВыгрузитьКолонку("Локация");
	
	КлючНабораЛокацийДоИзменения = КлючНабораЛокаций;
	КлючНабораЛокаций = Справочники.Мультилокации.ПолучитьКлючНабораЛокаций(МассивЛокаций);
	
	Если НЕ ДополнительныеСвойства.Свойство("ОтключитьПроверкиЗаписи") Тогда
		//В СОСТАВЕ ДОЛЖНО БЫТЬ НЕ МЕНЕЕ ДВУХ ЛОКАЦИЙ
		Если Локации.Количество()<2 Тогда
			Отказ = Истина;
			ВызватьИсключение "Количество локаций не должно быть меньше 2";
		КонецЕсли;
		
		//В СОСТАВЕ НЕ ДОЛЖНО БЫТЬ ОДИНАКОВЫХ ЛОКАЦИЙ
		ТаблицаДляПроверки = Локации.Выгрузить();
		ТаблицаДляПроверки.Свернуть("Локация");
		Если ТаблицаДляПроверки.Количество()<Локации.Количество() Тогда
			Отказ = Истина;
			ВызватьИсключение "В составе Мультилокации не должно быть повторяющихся Локаций";
		КонецЕсли;
		
		//ПРОВЕРКА НА УЖЕ СУЩЕСТВУЮЩУЮ МУЛЬТИЛОКАЦИЮ С АНАЛОГИЧНЫМ СОСТАВОМ
		МультилокациюСАналогичнымНаборомЛокаций = Справочники.Мультилокации.ПолучитьМультилокациюСАналогичнымНаборомЛокаций(Ссылка, КлючНабораЛокаций);
		Если МультилокациюСАналогичнымНаборомЛокаций <> Справочники.Мультилокации.ПустаяСсылка() Тогда
			Отказ = Истина;
			ВызватьИсключение СтрШаблон("Мультилокация с таким набором уже существует. Код %1", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МультилокациюСАналогичнымНаборомЛокаций, "Код"));
		КонецЕсли;
		
		//ЗАПРЕТ ИЗМЕНЕНИЯ СОСТАВА В СЛУЧАЕ ИСПОЛЬЗОВАНЯИ В ДОКУМЕНТАХ
		Если НЕ ЭтоНовый() Тогда 
			// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 10.06.2024 
			// Перенесла процедуру в модуль менеджера для возможности использования из формы
			// Было:
			//Если Справочники.Мультилокации.ЕстьДокументыПоМультилокации(КлючНабораЛокацийДоИзменения) Тогда 
			//Стало:
			Если КлючНабораЛокаций <> КлючНабораЛокацийДоИзменения и ЗначениеЗаполнено(КлючНабораЛокацийДоИзменения)
				и Справочники.Мультилокации.ЕстьДокументыПоМультилокации(Ссылка) Тогда
			// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 10.06.2024
				Отказ = Истина;
				ВызватьИсключение "Мультилокация уже использована в документах. Изменения запрещены";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЛокаций", МассивЛокаций);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Локации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Ссылка В(&МассивЛокаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Локации.Код";
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
	
	ТаблицаЛокаций = Запрос.Выполнить().Выгрузить();
	НаименованияЛокаций = ТаблицаЛокаций.ВыгрузитьКолонку("Наименование");
	//Евросиб Каблов 27.12.2024 ( #99155
	//Наименование = СтрСоединить(НаименованияЛокаций, "; ");
	НаименованиеПолное = СтрСоединить(НаименованияЛокаций, "; ");
	Наименование = НаименованиеПолное;
	//Евросиб Каблов 27.12.2024 )
	
	//Евросиб Каблов 04.04.2023 )
	
КонецПроцедуры


