Функция ПолучитьДанныеБлокировкиДокумента(ДокументСсылка) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколОбменов.Объект КАК Объект
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |ГДЕ
	               |	ПротоколОбменов.Объект = &Документ
	               |	И ВЫБОР
	               |			КОГДА ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(перечисление.узлыобмена.Диадок)
	               |				ТОГДА ПротоколОбменов.ДействиеПриОбмене <> ЗНАЧЕНИЕ(перечисление.ДействияприОбмене.ЗагрузкаДанных)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	ЗапросВыполнить = Запрос.Выполнить();
	КолонкиЗапроса = ЗапросВыполнить.Колонки;
	Ответ = ЗапросВыполнить.Выбрать();
	Если Ответ.Следующий() Тогда
		
		Для каждого Колонка из КолонкиЗапроса Цикл
			
			Результат.Вставить(Колонка.Имя, Ответ[Колонка.Имя]);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументЗаблокирован(ДокументСсылка) Экспорт
	
	Результат = Ложь;
	
	Если Строка(ДокументСсылка) <> "" Тогда
		СтатусДокумента = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеБлокировкиДокумента(ДокументСсылка);
		Если СтатусДокумента.Количество() > 0 Тогда Результат = Истина; КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура КонтрольДоступностиДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Или ПривилегированныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 05.02.2021 ( Проведение непроведенного / отмена проведения проведенного
	ЭтоИСФ = ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
				Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомиссионераОПродажах")
				//Или ТипЗнч(Источник) = Тип("ДокументОбъект.СчетНаОплатуПокупателю") //Евросиб Каблов 23.03.2021 Ticket#0227211 
				Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах")
				Или ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации");
				
	Если ЭтоИСФ Тогда
		
		МетаданныеДокумента = Источник.Метаданные();
		РеквизитыДокумента = МетаданныеДокумента.Реквизиты;
		
		Если РеквизитыДокумента.Найти("ПериодВО") <> Неопределено Тогда
			
			Если (Не Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение
					Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
			
				РазрешеноРедактированиеИСФ = ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ");
				
				Если Не РазрешеноРедактированиеИСФ Тогда
					//Евросиб Каблов 09.04.2025 ( #105407
					//ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Источник.ПериодВО, Источник.Организация);
					ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодДоходов(Источник.ПериодВО, Источник.Организация);
					//Евросиб Каблов 09.04.2025 )
					Если ДокументВЗакрытомПериоде Тогда
						ТекстСообщения = СтрШаблон("Период ВО %1 закрыт! Проведение/отмена проведения документа %2 №%3 от %4 запрещены.", Формат(Источник.ПериодВО, "ДФ='MMMM yyyy'"), МетаданныеДокумента.Синоним, Источник.Номер, Источник.Дата);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если Источник.Проведен Тогда
				ПериодВО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПериодВО");
				//Евросиб Каблов 09.04.2025 ( #105407
				//ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ПериодВО, Источник.Организация);
				ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодДоходов(ПериодВО, Источник.Организация);
				//Евросиб Каблов 09.04.2025 )
				Если ДокументВЗакрытомПериоде И Источник.ПериодВО <> ПериодВО Тогда
					ТекстСообщения = СтрШаблон("Период ВО %1 закрыт! Его изменение в документе %2 №%3 от %4 запрещено.", Формат(ПериодВО, "ДФ='MMMM yyyy'"), МетаданныеДокумента.Синоним, Источник.Номер, Источник.Дата);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
		
	Если Источник.ДополнительныеСвойства.Свойство("ИзмененыТолькоРазрешенныеПоля") Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 05.02.2021 )
	
	ДополнительныеПараметры = Новый Структура;
	
	РеквизитВыставлен = Источник.Метаданные().Реквизиты.Найти("Выставлен");
	Если РеквизитВыставлен <> Неопределено Тогда
		
		ЕстьДоступСниматьПризнак = РольДоступна("dc_РазрешитьРедактированиеИСФ") Или РольДоступна("ПолныеПрава")
			Или РольДоступна("dc_РедактированиеДатыДокумента");// Евросиб US 89967 TA 91565 Рыбьяков К.А. 24.10.2024 (( добавил роль dc_РедактированиеДатыДокумента
		
		РазрешенаЗаписьВыставленного = Неопределено;
		Если Не Источник.ДополнительныеСвойства.Свойство("РазрешенаЗаписьВыставленного", РазрешенаЗаписьВыставленного) Тогда
			РазрешенаЗаписьВыставленного = Ложь;
		КонецЕсли;
		
		//Евросиб Каблов 18.11.2020 (
		//Если Источник.Выставлен И (ЕстьДоступСниматьПризнак Или РазрешенаЗаписьВыставленного) Тогда
		Если ЕстьДоступСниматьПризнак Или РазрешенаЗаписьВыставленного Тогда
		//Евросиб Каблов 18.11.2020 )
			ДополнительныеПараметры.Вставить("РазрешенаЗаписьВыставленного", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("РазрешеноПроведениеВОбходБлокировок") Тогда
		ДополнительныеПараметры.Вставить("РазрешеноПроведениеВОбходБлокировок", Истина);
	КонецЕсли;
	
	ДанныеОБлокировке = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеОБлокировке(Источник.Ссылка, ДополнительныеПараметры);	
	Если ДанныеОБлокировке.Заблокирован Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ДанныеОБлокировке.ОписаниеБлокировки);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 18.09.2020
Процедура ПроверитьДоступностьПолейДляИзменения(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//Евросиб Каблов 02.12.2020 ( Далее есть проверки, которые должны работать и для полных прав (например по Периоду ВО)
	//Если Отказ Или Источник.ЭтоНовый() Или ПривилегированныйРежим() Или РольДоступна("ПолныеПрава") Тогда
	Если Отказ Или Источник.ЭтоНовый() Или ПривилегированныйРежим() Тогда
	//Евросиб Каблов 02.12.2020 )
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ВызванИзЗаписиПС") Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначенияИсточника = ТипЗнч(Источник);
	
	ПрограммноеИзменение = Источник.ДополнительныеСвойства.Свойство("ПрограммноеИзменение");
		
	СтруктураБлокировки = ПолучитьБлокируемыеПоля(Источник.Ссылка, ПрограммноеИзменение);
	ИзмененныеПоля = Новый Массив;
	ПроверитьИзмененияРеквизитовОбъекта(Источник, Отказ, СтруктураБлокировки.БлокироватьВсеПоля, СтруктураБлокировки.ПоляИсключения, ИзмененныеПоля);
	
	Если ИзмененныеПоля.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено изменение полей: " + СтрСоединить(ИзмененныеПоля, ", "));
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459
	Иначе
	    Источник.ДополнительныеСвойства.Вставить("ИзмененыТолькоРазрешенныеПоля", Истина);
		//Евросиб Дубская 27.10.2022 ( Ticket#0287875
		Если СтруктураБлокировки.Свойство("ИзменитьСФ") Тогда
			ИзменитьСФ = СтруктураБлокировки.ИзменитьСФ;
		Иначе
			ИзменитьСФ = Ложь;
		КонецЕсли;
		//Евросиб Дубская 27.10.2022 )
		Если (ТипЗначенияИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")
				Или ТипЗначенияИсточника = Тип("ДокументОбъект.ОтчетКомиссионераОПродажах"))   
				//Евросиб Дубская 27.10.2022 ( Ticket#0287875
				//И СтруктураБлокировки.Заблокирован Тогда	
				И СтруктураБлокировки.Заблокирован 
				И НЕ ИзменитьСФ
				Тогда
				//Евросиб Дубская 27.10.2022 )
			Источник.ДополнительныеСвойства.Вставить("ЗапретитьЗаписыватьСчетФактуру", Истина);
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 02.12.2020
	
//Евросиб Гудкова( 18.10.2020 Ticket№ 0210719
	//Евросиб Каблов 05.07.2021 ( Task 36231
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.Калькуляция") И Не РольДоступна("ПолныеПрава") Тогда 
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Калькуляция") И Не ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеКалькуляций") Тогда
	//Евросиб Каблов 05.07.2021 )
		ПСЦ = Документы.Калькуляция.КалькуляцияНаходитсяВСогласованномПСЦ(Источник.Ссылка);
		Если ПСЦ <> неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная калькуляция зафиксирована ПСЦ " + ПСЦ,,,,Отказ);
		КонецЕсли; 
	КонецЕсли;
// Евросиб Гудкова) 	
			
КонецПроцедуры

//Евросиб Каблов 18.09.2020
Функция ПолучитьБлокируемыеПоля(Ссылка, ПрограммноеИзменение = Ложь, БлокировкаЭлементовФормы = Ложь, Объект = Неопределено) Экспорт
	
	СтруктураБлокировки = Новый Структура("Заблокирован, ОписаниеБлокировки, БлокироватьВсеПоля, ПоляИсключения", Ложь, "", Ложь, Новый Массив);  
	//Евросиб Дубская 03.11.2022 ( Ticket#0287875
	СтруктураБлокировки.Вставить("ИзменитьСФ", Ложь);
	//Евросиб Дубская 03.11.2022 )
	
	//Евросиб Каблов 02.12.2020 ( Далее есть проверки, которые должны работать и для полных прав (например по Периоду ВО)
	
	// SIV 04-12-20 в резултате отключения этой проверки у нас заблокировалось редактирование Состояний в ПСЦ.
	// прошу более внимательно отнестись к доступу для администраторов. сейчас мы не сможем делать свою работу без доступа к данным.
	
	//Евросиб Каблов 04.12.2020 Перенёс проверку ниже, что бы работала именно для ПСЦ, как для калькуляций
	//Если РольДоступна("ПолныеПрава") Тогда
	//	Возврат СтруктураБлокировки;
	//КонецЕсли;
	//Евросиб Каблов 02.12.2020 )
	
	ДействующиеБлокировки = Новый Массив;
	УсловияБлокировки = Новый Структура;   
	
	//ДИТ ДИТ, Беляев СЮ, ТА44280, 27-12-2021, ++
	ДоступностиЭлементовПоВидуКорректировки  = Новый Структура;
	//ДИТ ДИТ, Беляев СЮ, ТА44280, 27-12-2021, --
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	//Если Не РольДоступна("ПолныеПрава") Тогда
	//	УсловиеБлокировки = Новый Структура;
	//	УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
	//	
	//	ПоляИсключения = Новый Массив;
	//	ПоляИсключения.Добавить("Номер");
	//	УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
	//	ДействующиеБлокировки.Добавить(УсловиеБлокировки);
	//КонецЕсли;
	//Евросиб Каблов 07.07.2021 )   
	
	//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, ++      
	ПоляОбязательнойБлокировки = Новый Массив;
	//(1) Запрет редактирования поля документа Номер
	Если Не РольДоступна("ПолныеПрава") Тогда
		ПоляОбязательнойБлокировки.Добавить("Номер");
	КонецЕсли;   
	//(2) Запрет редактирования реквизитов СчетФактураВыданный
	#Область СчетФактураВыданный
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ДоступностиЭлементовПоВидуКорректировки = ПолучитьДоступностьЭлементовПоВидуКорректировкиРеализации(Ссылка);    
		Если ДоступностиЭлементовПоВидуКорректировки.ВыполнитьБлокировкуРеквизитов Тогда   
			ПоляОбязательнойБлокировки.Добавить("ПереченьГТДкИСФ");
			ПоляОбязательнойБлокировки.Добавить("УдалитьВключатьВОтчетДляФНС");
		Иначе   
			//++ДИТ_Коробов_Task 46790_24.02.22
			//Проверить корневую фактуру на аннулирование
			ДокКорректировка = Ссылка.ДокументОснование;
			ВключитьБлокировку = 0;
			Пока Истина Цикл
				Если НЕ ЗначениеЗаполнено(ДокКорректировка) Тогда
					Прервать;
				КонецЕсли;
				Если ТипЗнч(ДокКорректировка)<>Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					ДокИСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокКорректировка);
					Если НЕ ЗначениеЗаполнено(ДокИСФ) Тогда 
						Прервать;
					КонецЕсли;
					Если Ссылка <> ДокИСФ Тогда 
						ПроверитьПоВидуКорректировки = ПолучитьДоступностьЭлементовПоВидуКорректировкиРеализации(ДокИСФ);
						Если (Найти(ПроверитьПоВидуКорректировки.ОписаниеПричиныБлокировкиРеквизитов, "аннулирован") > 0) Тогда
							ВключитьБлокировку = ВключитьБлокировку + 1;
						КонецЕсли;
					КонецЕсли;    
					Прервать;
				Иначе
					Если ДокКорректировка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
						ДокИСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокКорректировка.ДокументРеализации);
						Если ЗначениеЗаполнено(ДокИСФ) Тогда 
							ПроверитьПоВидуКорректировки = ПолучитьДоступностьЭлементовПоВидуКорректировкиРеализации(ДокИСФ);
							Если (Найти(ПроверитьПоВидуКорректировки.ОписаниеПричиныБлокировкиРеквизитов, "аннулирован") > 0) Тогда
								ВключитьБлокировку = ВключитьБлокировку + 1;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
				ДокКорректировка = ДокКорректировка.ДокументРеализации;
			КонецЦикла;					
			Если (ВключитьБлокировку > 0) Тогда
				ДоступностиЭлементовПоВидуКорректировки = ПроверитьПоВидуКорректировки;
				ПоляОбязательнойБлокировки.Добавить("ПереченьГТДкИСФ");
				ПоляОбязательнойБлокировки.Добавить("УдалитьВключатьВОтчетДляФНС");
			КонецЕсли;
			//--ДИТ_Коробов_Task 46790_24.02.22
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	////ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало - блок перенесен вниз
	//Если ПоляОбязательнойБлокировки.Количество()>0 Тогда
	//	УсловиеБлокировки = Новый Структура;
	//	УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);	
	//	УсловиеБлокировки.Вставить("ПоляИсключения", ПоляОбязательнойБлокировки);
	//	ДействующиеБлокировки.Добавить(УсловиеБлокировки);
	//КонецЕсли; 
	//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец - блок перенесен вниз
	//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, --
	#Область РеализацияТоваровУслуг
	//МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке();	
Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		// Евросиб Фролов (29.12.2021 TASK№ 40645
		Если НЕ РольДоступна("dc_РаботаСНДС0")
			И Не РольДоступна("ПолныеПрава") Тогда
			ПоляОбязательнойБлокировки.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляОбязательнойБлокировки.Добавить("РасшифровкаУслугПоТС.Вагон");
		КонецЕсли;
		// Евросиб Фролов)
		//Евросиб Каблов 14.01.2022 (
		ДействующаяБлокировка = Новый Структура;
		ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("ПериодВО");
		ПоляИсключения.Добавить("ОтчПериод");
		//ПоляИсключения.Добавить("ДатаДокумента");
		ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
		ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
		//Евросиб Каблов 14.01.2022 )
		
		//Условие по правам доступа
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		//Евросиб Каблов 11.04.2022 ( Ticket#0268097
		//ПоляИсключения.Добавить("ДатаДокумента");
		//Евросиб Каблов 11.04.2022 )
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("БанковскийСчетОрганизации");
		//Евросиб Гудкова( 22.10.2020 Ticket№
		ПоляИсключения.Добавить("СчетНаОплатуПокупателю");
		ПоляИсключения.Добавить("НомерДляПечати");
		//Евросиб Гудкова( 01.11.2020 Ticket№ 0212467 
		ПоляИсключения.Добавить("Услуги1ПереместитьВниз");
		ПоляИсключения.Добавить("Услуги1ПереместитьВверх");
		// Евросиб Гудкова) 		
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокАннулироватьДокумент");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОткрытьКорректировку");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОтменитьРазрешение");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьИсправление");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьКорректировку");
		
		ПоляИсключения.Добавить("ФормаУстановитьПометкуУдаления");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		ПоляИсключения.Добавить("Услуги.Содержание");
		ПоляИсключения.Добавить("Услуги.НоменклатурнаяГруппа");
		ПоляИсключения.Добавить("Услуги.ЕдиницаИзмерения");
		//Евросиб СубботинВ #113453 03.07.2025 Начало 
		//ПоляИсключения.Добавить("Услуги.СчетНаОплатуПокупателю");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям.СчетНаОплатуПокупателю");
		//Евросиб СубботинВ #113453 03.07.2025 Конец
		//Евросиб СубботинВ #85857 13.06.2024 Начало //
		ПоляИсключения.Добавить("УслугиПрошлыхПериодов");
		//Евросиб СубботинВ #85857 13.06.2024 Начало /
			
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") 
			Или ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда // ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023  
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента"); 
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:45:50 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			//ПоляИсключения.Добавить("ОтчПериод");
			//)
			//Евросиб - АСуслов 13.12.2021 9:45:53 #40568
			//Евросиб Каблов 11.04.2022 ( Ticket#0268097
			ПоляИсключения.Добавить("ДатаДокумента");
			//Евросиб Каблов 11.04.2022 ) 
			//Евросиб Дубская 27.10.2022 ( Ticket#0287875 
			ПоляИсключения.Добавить("ДатаСоставления");
			//Евросиб Дубская 27.10.2022 ) 
			// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			// Евросиб Рыбьяков К.А. 17.10.2024 ))
		КонецЕсли;
		//Евросиб Каблов 22.01.2021 ( Ticket#0217261
		Если БлокировкаЭлементовФормы Тогда			
			ПоляИсключения.Добавить("РасшифровкаУслугПоТСПерезаполнитьОтгрузочнуюИнформацию");
		Иначе
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
		КонецЕсли;
		//Евросиб Каблов 22.01.2021 ) 
		
		// Евросиб Фролов (16.12.2021 TASK№ 40645
		// Для роли dc_РаботаСНДС0 в расшифровках РТУ (в т.ч. и для закрытого периода) разрешить вносить 
		// изменения в колонки "Вагон", "ЖДН".
		// Эта роль идёт отдельно, у нее должны быть права только на внесение изменений в поля "Вагон", "ЖДН" и
		// "НомерЖДН" (оно на форме усановлено в только просмотр и меняется при изменении ЖДН), а у всех остальных нет. И наоборот.
		//Если Пользователи.РолиДоступны("dc_РаботаСНДС0") Тогда
		Если РольДоступна("dc_РаботаСНДС0") Тогда // Евросиб Фролов (29.12.2021 TASK№ 40645
			ПоляИсключения.Очистить();
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.Вагон");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.НомерЖДН");
		КонецЕсли;
		// Евросиб Фролов)
		
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
		Если ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, начало
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, конец
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 17.10.2024 ))
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("НетПолныхПрав", УсловиеБлокировки);
		
		//Условие ЗарегистрированВОбмене
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		//Евросиб Каблов 18.03.2021 (
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			ПоляИсключения.Добавить("СчетНаОплатуПокупателю");
		КонецЕсли;
		//Евросиб Каблов 18.03.2021 )
		
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");		
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");  
			//Евросиб Каблов 03.12.2020 дату документа и период ВО и штраф у выгруженных нельзя редактировать, сначала отменить выгрузку
			//ПоляИсключения.Добавить("ДатаДокумента");
			ПоляИсключения.Добавить("Услуги.Содержание");
			// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			// Евросиб Рыбьяков К.А. 17.10.2024 )
		КонецЕсли;		
		
		// Евросиб Фролов (16.12.2021 TASK№ 40645
		// Для роли dc_РаботаСНДС0 в расшифровках РТУ (в т.ч. и для закрытого периода) разрешить вносить 
		// изменения в колонки "Вагон", "ЖДН".
		// Эта роль идёт отдельно, у нее должны быть права только на внесение изменений в поля "Вагон", "ЖДН" и
		// "НомерЖДН" (оно на форме усановлено в только просмотр и меняется при изменении ЖДН), а у всех остальных нет. И наоборот.
		//Если Пользователи.РолиДоступны("dc_РаботаСНДС0") Тогда
		Если РольДоступна("dc_РаботаСНДС0") Тогда // Евросиб Фролов (29.12.2021 TASK№ 40645
			ПоляИсключения.Очистить();
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.Вагон");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.НомерЖДН");
		КонецЕсли;
		// Евросиб Фролов)
		
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
		Если ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, начало
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, конец
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 17.10.2024 ))
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ЗарегистрированВОбмене", УсловиеБлокировки);
		
		//Условие Выставлен
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		//Евросиб Каблов 18.03.2021 (
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			ПоляИсключения.Добавить("СчетНаОплатуПокупателю");
		КонецЕсли;
		//Евросиб Каблов 18.03.2021 )
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");    
			ПоляИсключения.Добавить("Услуги.Содержание");
			
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:46:40 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:46:42 #40568  
			
			//Евросиб Дубская 27.10.2022 ( Ticket#0287875 
			ПоляИсключения.Добавить("ДатаСоставления");
			//Евросиб Дубская 27.10.2022 ) 
			// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			// Евросиб Рыбьяков К.А. 17.10.2024 )
		КонецЕсли;
		
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
		Если ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, начало
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, конец
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 17.10.2024 ))
		
		// Евросиб Фролов (16.12.2021 TASK№ 40645
		// Для роли dc_РаботаСНДС0 в расшифровках РТУ (в т.ч. и для закрытого периода) разрешить вносить 
		// изменения в колонки "Вагон", "ЖДН".
		// Эта роль идёт отдельно, у нее должны быть права только на внесение изменений в поля "Вагон", "ЖДН" и
		// "НомерЖДН" (оно на форме усановлено в только просмотр и меняется при изменении ЖДН), а у всех остальных нет. И наоборот.
		//Если Пользователи.РолиДоступны("dc_РаботаСНДС0") Тогда
		Если РольДоступна("dc_РаботаСНДС0") Тогда // Евросиб Фролов (29.12.2021 TASK№ 40645
			ПоляИсключения.Очистить();
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.Вагон");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.НомерЖДН");
		КонецЕсли;
		// Евросиб Фролов)
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("Выставлен", УсловиеБлокировки); 
		
		//Евросиб Дубская 27.10.2022 ( Ticket#0287875
		//Условие ЕстьПривязанныеОплаты
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			ПоляИсключения.Добавить("СчетНаОплатуПокупателю");
		КонецЕсли;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");    
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("Штраф");
		КонецЕсли;		
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, начало
		Если ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, конец
		
		Если РольДоступна("dc_РаботаСНДС0") Тогда 
			ПоляИсключения.Очистить();
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.Вагон");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.НомерЖДН");
		КонецЕсли;                 
		ПоляИсключения.Добавить("ДатаДокумента");   
		ПоляИсключения.Добавить("ДатаСоставления");   
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ЕстьПривязанныеОплаты", УсловиеБлокировки);
		//Евросиб Дубская 27.10.2022)
		
		//Условие ВЗакрытомПериоде
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		
		//Евросиб Каблов 18.03.2021 (
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
			ПоляИсключения.Добавить("СчетНаОплатуПокупателю");
		КонецЕсли;
		//Евросиб Каблов 18.03.2021 )
		
		//Евросиб Каблов 14.08.2025 ( #111016
		Если ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
			ПоляИсключения.Добавить("СчетаНаОплатуПокупателям");
		КонецЕсли;
		//Евросиб Каблов 14.08.2025 ) #111016
		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:47:00 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:47:02 #40568 
			
			//Евросиб Дубская 27.10.2022 ( Ticket#0287875 
			ПоляИсключения.Добавить("ДатаСоставления");
			//Евросиб Дубская 27.10.2022 ) 
			// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
			ПоляИсключения.Добавить("ПричинаИзмененияДатыДокумента");
			// Евросиб Рыбьяков К.А. 17.10.2024 )
		КонецЕсли;
		
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");   
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		
		// Евросиб Фролов (16.12.2021 TASK№ 40645
		// Для роли dc_РаботаСНДС0 в расшифровках РТУ (в т.ч. и для закрытого периода) разрешить вносить 
		// изменения в колонки "Вагон", "ЖДН".
		// Эта роль идёт отдельно, у нее должны быть права только на внесение изменений в поля "Вагон", "ЖДН" и
		// "НомерЖДН" (оно на форме усановлено в только просмотр и меняется при изменении ЖДН), а у всех остальных нет. И наоборот.
		//Если Пользователи.РолиДоступны("dc_РаботаСНДС0") Тогда
		Если РольДоступна("dc_РаботаСНДС0") Тогда // Евросиб Фролов (29.12.2021 TASK№ 40645
			ПоляИсключения.Очистить();
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.ЖДН");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.Вагон");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС.НомерЖДН");
		КонецЕсли;
		// Евросиб Фролов)
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ВЗакрытомПериоде", УсловиеБлокировки);
	КонецЕсли;
	#КонецОбласти
	#Область КорректировкаРеализации
	//Евросиб Каблов 31.05.2021 ( Ticket#0223764	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		//Евросиб Каблов 14.01.2022 (
		ДействующаяБлокировка = Новый Структура;
		ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("ПериодВО");
		//ПоляИсключения.Добавить("ДатаДокумента");
		ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
		ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
		//Евросиб Каблов 14.01.2022 )
		//Условие по правам доступа
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("ДатаДокумента");
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("БанковскийСчетОрганизации");		
		ПоляИсключения.Добавить("НомерДляПечати");
		
		ПоляИсключения.Добавить("Услуги1ПереместитьВниз");
		ПоляИсключения.Добавить("Услуги1ПереместитьВверх");
		
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокАннулироватьДокумент");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОткрытьКорректировку");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОтменитьРазрешение");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьИсправление");
		ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьКорректировку");
		
		ПоляИсключения.Добавить("ФормаУстановитьПометкуУдаления");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетНаОплатуПокупателюСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		ПоляИсключения.Добавить("Услуги.Содержание");
		ПоляИсключения.Добавить("Услуги.НоменклатурнаяГруппа");
		ПоляИсключения.Добавить("Услуги.ЕдиницаИзмерения");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") 
			Или ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда // ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023 
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			//Евросиб Каблов 16.08.2021 ( Ticket#0239772
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//Евросиб Каблов 16.08.2021 )
			ПоляИсключения.Добавить("ЗарегистрироватьАннулирование");
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:47:19 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			//ПоляИсключения.Добавить("ОтчПериод");
			//)
			//Евросиб - АСуслов 13.12.2021 9:47:22 #40568
			// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
			ПоляИсключения.Добавить("ДатаСоставления");	
			// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
		КонецЕсли;
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеЦенКоррРТУ") Тогда
			ПоляИсключения.Добавить("Услуги.Цена");
		КонецЕсли;
		
		Если БлокировкаЭлементовФормы Тогда			
			ПоляИсключения.Добавить("РасшифровкаУслугПоТСПерезаполнитьОтгрузочнуюИнформацию");
		Иначе
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
		КонецЕсли;
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("НетПолныхПрав", УсловиеБлокировки);
		
		//Условие ЗарегистрированВОбмене
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
		КонецЕсли;
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");		
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетНаОплатуПокупателюСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			//Евросиб Каблов 16.08.2021 ( Ticket#0239772
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//Евросиб Каблов 16.08.2021 )
			ПоляИсключения.Добавить("ЗарегистрироватьАннулирование");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
			ПоляИсключения.Добавить("Услуги.Содержание");
		КонецЕсли;		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ЗарегистрированВОбмене", УсловиеБлокировки);
		
		//Условие Выставлен
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
		КонецЕсли;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетНаОплатуПокупателюСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			//Евросиб Каблов 16.08.2021 ( Ticket#0239772
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//Евросиб Каблов 16.08.2021 )
			ПоляИсключения.Добавить("ЗарегистрироватьАннулирование");
			ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:47:53 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:47:54 #40568
		КонецЕсли;
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("Выставлен", УсловиеБлокировки);
		
		//Условие ВЗакрытомПериоде
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		
		Если РольДоступна("ПолныеПрава") Тогда
			ПоляИсключения.Добавить("Услуги");
			ПоляИсключения.Добавить("РасшифровкаУслугПоТС");
		КонецЕсли;
		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			//Евросиб Каблов 16.08.2021 ( Ticket#0239772
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//Евросиб Каблов 16.08.2021 )
			ПоляИсключения.Добавить("ЗарегистрироватьАннулирование");
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:48:09 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:48:11 #40568
		КонецЕсли;
		
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ВЗакрытомПериоде", УсловиеБлокировки);
	КонецЕсли;
	//Евросиб Каблов 31.05.2021 ) 
	#КонецОбласти	
	#Область ОтчетКомиссионераОПродажах
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		//Условие ВЗакрытомПериоде
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("Штраф");     
			//Евросиб - АСуслов 13.12.2021 9:48:31 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			//ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:48:33 #40568
		КонецЕсли;
		
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ВЗакрытомПериоде", УсловиеБлокировки);
		
	КонецЕсли;	
	#КонецОбласти
	#Область ОтчетКомитентуОПродажах
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		//Евросиб Каблов 14.01.2022 (39883
		ДействующаяБлокировка = Новый Структура;
		ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("ПериодВО");
		ПоляИсключения.Добавить("ОтчПериод");
		//ПоляИсключения.Добавить("ДатаДокумента");
		ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
		ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
		//Евросиб Каблов 14.01.2022 39883)
		//ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокАннулироватьДокумент");
		//ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОткрытьКорректировку");
		//ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОтменитьРазрешение");
		//ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьИсправление");
		//ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьКорректировку");
		
		//Условие ЗарегистрированВОбмене
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");		
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураПолученныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//Евросиб Каблов 03.12.2020 дату документа и период ВО и штраф у выгруженных нельзя редактировать, сначала отменить выгрузку
			//ПоляИсключения.Добавить("ДатаДокумента");
			//ПоляИсключения.Добавить("Услуги.Содержание");
		КонецЕсли;		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ЗарегистрированВОбмене", УсловиеБлокировки);
		
		//Условие Выставлен
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураПолученныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			//ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
			//ПоляИсключения.Добавить("Услуги.Содержание");
			//ПоляИсключения.Добавить("ДатаДокумента");
			//ПоляИсключения.Добавить("Штраф");
			//ПоляИсключения.Добавить("ПериодВО");
		КонецЕсли;
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("Выставлен", УсловиеБлокировки);
		
		//Условие ВЗакрытомПериоде
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("СчетаНаОплатуПокупателям"); //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") 
			Или ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда // ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023 
			ПоляИсключения.Добавить("Услуги.Содержание");
			ПоляИсключения.Добавить("СнятьПризнакВыставлен");
			ПоляИсключения.Добавить("СнятьПризнакВыгружен");
			ПоляИсключения.Добавить("Штраф");
			//Евросиб - АСуслов 13.12.2021 9:48:53 #40568
			//(
			//ПоляИсключения.Добавить("ПериодВО");
			ПоляИсключения.Добавить("ДатаДокумента");
			//)
			//Евросиб - АСуслов 13.12.2021 9:48:55 #40568 
			// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
			ПоляИсключения.Добавить("ДатаСоставления");
			// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
		КонецЕсли;
		
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		ПоляИсключения.Добавить("СнятьПризнакВыставлен");
		ПоляИсключения.Добавить("РазрешитьРедактированиеВыгруженногоДокумента");
		ПоляИсключения.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументОтчетКомитентуОПродажахСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураВыданныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаДокументСчетФактураПолученныйСоздатьНаОсновании");
		ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ВЗакрытомПериоде", УсловиеБлокировки);
		
	КонецЕсли;
	#КонецОбласти
	#Область СчетФактураВыданный
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		//Условие ВЗакрытомПериоде
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Выставлен");
		ПоляИсключения.Добавить("ДатаВыставления");
		ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
		ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
		ПоляИсключения.Добавить("ФормаЗаписать");
		
		ПоляИсключения.Добавить("ПодменюОтчетыСмТакже_Авто");
		ПоляИсключения.Добавить("ПодменюПечать");
		
		//Евросиб Гудкова( 02.01.2021 Ticket№ 0217692
		//Евросиб Каблов 07.07.2021 ( 
		//Если ПроверитьДоступностьРоли("dc_АРМРаботаСНДС0") Тогда
		Если ПроверитьДоступностьРоли("dc_РаботаСНДС0") Тогда
			//Евросиб Каблов 07.07.2021 ) 
			ПоляИсключения.Добавить("ПодтверждающиеДокументы");
			ПоляИсключения.Добавить("УдалитьВключатьВОтчетДляФНС");
			ПоляИсключения.Добавить("ПериодОтчетаФНС");
			ПоляИсключения.Добавить("УдалитьДатаОтчетаДляФНС");
			ПоляИсключения.Добавить("ПереченьГТДкИСФ");	
			ПоляИсключения.Добавить("НеВключатьВОтчетПоДолгамНДС");
			ПоляИсключения.Добавить("ПричинаИсключенияИзОтчетаПоДолгамНДС0");
			ПоляИсключения.Добавить("УдалитьДатаПолногоПодтвержденияНДС0");
		КонецЕсли;
		// Евросиб Гудкова) 		
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ПоляИсключения.Добавить("ФормаСнятьПризнакВыставлен");					
			ПоляИсключения.Добавить("ПодтверждающиеДокументы");
			ПоляИсключения.Добавить("УдалитьВключатьВОтчетДляФНС");
			ПоляИсключения.Добавить("ПериодОтчетаФНС");
			ПоляИсключения.Добавить("УдалитьДатаОтчетаДляФНС");
			ПоляИсключения.Добавить("ПереченьГТДкИСФ");	
		КонецЕсли;
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("ВЗакрытомПериоде", УсловиеБлокировки);
	КонецЕсли;
	#КонецОбласти	
	#Область ПСЦ
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПСЦ") Тогда
		
		//Евросиб Каблов 04.12.2020 (
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		//Евросиб Каблов 04.12.2020 ) 
		
		//Субботин 75703 04.10.2023 начало //блокируем колонки для редактированиям всем пользователям, кроме админов
		ПоляОбязательнойБлокировки.Добавить("ПСЦПоставщикаУслуга");
		ПоляОбязательнойБлокировки.Добавить("ПСЦПоставщика_контейнерыВРПУслуга");
		ПоляОбязательнойБлокировки.Добавить("ПСЦПоставщика_контейнерыЭкспортУслуга");
		ПоляОбязательнойБлокировки.Добавить("ПСЦПоставщика_автодоставкаУслуга");
		ПоляОбязательнойБлокировки.Добавить("ПСЦПоставщика_ТЭОУслуга");
		//Субботин 75703 04.10.2023 конец
		
		//Евросиб Каблов 09.07.2021 ( Ticket#0237219
		Если ЗначениеЗаполнено(Ссылка) Тогда
			//Евросиб Каблов 09.07.2021 )
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ПСЦ.ТекущееСостояние.Согласование, ЛОЖЬ) КАК ТекущееСостояниеСогласование,
			|	ПСЦ.СтатусДокумента КАК СтатусДокумента,
			//Евросиб Каблов 05.07.2021 ( Task 36231
			|	ПСЦ.ПСЦПоставщика КАК ПСЦПоставщика
			//Евросиб Каблов 05.07.2021 )
			|ИЗ
			|	Документ.ПСЦ КАК ПСЦ
			|ГДЕ
			|	ПСЦ.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			
			// ДИТ Поморцева Т.П. Задача 36404 08.07.21. начало
			
			////Евросиб Каблов 05.07.2021 ( Task 36231
			//Если Не (Выборка.ПСЦПоставщика И ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦПоставщика")) 
			//	И Не (Не Выборка.ПСЦПоставщика И ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦКлиента")) Тогда			
			////Евросиб Каблов 05.07.2021 )
			
			//Евросиб - АСуслов 25.03.2022 14:36:36 #
			//(
			//Если Выборка.ПСЦПоставщика = Неопределено Тогда
			//	ПСЦПоставщика = Ссылка.ПСЦПоставщика;
			//Иначе			
			//	ПСЦПоставщика = Выборка.ПСЦПоставщика;
			//КонецЕсли;  
			ПСЦПоставщика = Выборка.ПСЦПоставщика;
			ПСЦСтатусДокумента = Выборка.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = Выборка.ТекущееСостояниеСогласование;
		Иначе     
			ПСЦПоставщика = Объект.ПСЦПоставщика;
			ПСЦСтатусДокумента = Объект.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование");
			
		КонецЕсли;
		
		Если Не (ПСЦПоставщика И ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦПоставщика")) 
			И Не (Не ПСЦПоставщика И ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦКлиента")) Тогда			
			// ДИТ Поморцева Т.П. Задача 36404 08.07.21. конец
			
			//Для всех
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровести");
			ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");		
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_ОдноязычныйУниверсальныйФаксимиле");
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_одноязычный2");
			ПоляИсключения.Добавить("ФормаОтозватьСогласование");
			ПоляИсключения.Добавить("СостоянияЗапуститьНаСогласование");
			ПоляИсключения.Добавить("ФормаДокументЗаявкаСоздатьНаОсновании");
			ПоляИсключения.Добавить("ФормаДокументЗаявкаСоздатьНаОсновании");
			ПоляИсключения.Добавить("ФормаДокументПСЦСкопироватьПротоколСКалькуляциями");
			ПоляИсключения.Добавить("ОбновитьТарифы");
			ПоляИсключения.Добавить("НомерПСЦ");
			ПоляИсключения.Добавить("КлиентскийНомер");
			//Для Менеджера по сопровождению и Менеджера по продажам
			ПоляИсключения.Добавить("БезДоверенностей");
			ПоляИсключения.Добавить("НаименованиеПодписиИсполнителя");
			ПоляИсключения.Добавить("ДоверенностьЗаРуководителя");
			ПоляИсключения.Добавить("ДоверенностьЗаГлБухгалтера");
			ПоляИсключения.Добавить("НаименованиеПодписиКлиента");
			ПоляИсключения.Добавить("РуководительКонтрагента");
			ПоляИсключения.Добавить("ДобавитьРуководителяКонтрагента");
			//Евросиб Гудкова( 17.02.2021 Ticket№ 0223766
			ПоляИсключения.Добавить("ОтветственныйМенеджер");
			// Евросиб Гудкова)
			// ++ Дудоров С.В. Ticket#61931 29.11.2022
			ПоляИсключения.Добавить("ФормаОбщаяКомандаВернутьЗадачу");
			// -- Дудоров С.В. Ticket#61931 29.11.2022
			//Евросиб Коханенко Н.А. 20.08.2025 (( #117380
			ПоляИсключения.Добавить("НачалоДействияДоверенностиРуководителяКонтрагента");
			ПоляИсключения.Добавить("ИсточникДанныхРуководителяКонтрагента");
			ПоляИсключения.Добавить("ДоверенностьРуководителяКонтрагента");
			//Евросиб Коханенко Н.А. 20.08.2025 )) #117380 
			
			Если РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда 
				ПоляИсключения.Добавить("МаксимальнаяДатаПодписанияСДвухСторон");
				ПоляИсключения.Добавить("ПродлитьПериодПодписания");
				ПоляИсключения.Добавить("ПодписанСДвухСторон");
				//Субботин TASK 71862 11.07.2023 Начало
                ПоляИсключения.Добавить("СтатусДокумента");
				//Субботин TASK 71862 11.07.2023 Начало

			КонецЕсли;
			// Субботин 42333 06.09.2023 начало
			Если РольДоступна("dc_РаботаСПротоколами") Тогда 
				ПоляИсключения.Добавить("Комментарий");
			КонецЕсли;
			// Субботин 42333 06.09.2023 Конец 
			
			// Субботин 79204 26.12.2023 начало 
			Если Не РольДоступна("dc_ИзменениеПризнакаДоплатныхКткПСЦ") Тогда
				ПоляОбязательнойБлокировки.Добавить("ПротоколНаДоплатныеКТК");
			КонецЕсли;
			// Субботин 79204 26.12.2023 Конец 
			
			Если РольДоступна("dc_ПрикреплениеСканов") Тогда 
				ПоляИсключения.Добавить("ДобавитьСсылкуDV");
				ПоляИсключения.Добавить("СсылкаDV");
			КонецЕсли;
			
			// ++ Дудоров С.В. Ticket#61931 29.11.2022
			// Закомментирован для стандартизации кода. 
			//// Евросиб Фролов (04.05.2022 Task №41900
			//КнопкаВозвратаЗадачиДоступна = Документы.ПСЦ.ОпределитьДоступностьКнопкиВозвратаЗадачиПСЦ(Ссылка);
			//Если КнопкаВозвратаЗадачиДоступна Тогда
			//	ПоляИсключения.Добавить("ФормаОбщаяКомандаВернутьЗадачу");
			//КонецЕсли;	
			//// Евросиб Фролов)
			// -- Дудоров С.В. Ticket#61931 29.11.2022
			
			//Евросиб - АСуслов 25.03.2022 14:33:11 #
			//(
			//Если Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.Подписано Тогда
			Если ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.Подписано Тогда
				//)
				//Евросиб - АСуслов 25.03.2022 14:33:12 #
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				//Для Менеджера по сопровождению и Менеджера по продажам
				ПоляИсключения.Добавить("ОкончаниеДействияФакт");
				
				//Евросиб Гудкова( 24.12.2020 Ticket№ 0218150
				//Для Делопроизводителей
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				// Евросиб Гудкова) 			
				
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				Если РольДоступна("dc_РазрешитьРедактированиеТранзитДляКлиентаПСЦ") Тогда
					ПоляИсключения.Добавить("ТранзитДляКлиента");
				КонецЕсли;
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				
				//Евросиб Каблов 23.12.2025 ( #126470
				Если РольДоступна("dc_ДоступРазрешатьПересчетСтавкиУслугиВСчетНДС22") Тогда
					ПоляИсключения.Добавить("РазрешенПересчетСтавкиУслугиВСчетНДС22");
				КонецЕсли;
				//Евросиб Каблов 23.12.2025 ) #126470
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
				//Евросиб - АСуслов 25.03.2022 14:48:41 #
				//(
				//ИначеЕсли Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении
				//		Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			ИначеЕсли ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении
				Или ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
				//)
				//Евросиб - АСуслов 25.03.2022 14:48:41 #
				//Евросиб Гудкова( 07.10.2020 Ticket№ 0209478
				//было
				//Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний
				//Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями
				//Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями
				//Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями 
				// Евросиб Гудкова) 				
				Тогда
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				//Для Бэк офиса
				//Евросиб Каблов 05.03.2021 ( Ticket#0219054
				//ПоляИсключения.Добавить("МаксимальнаяДатаПодписанияСДвухСторон");
				//Евросиб Каблов 05.03.2021 )
				
				//Для Делопроизводителей
				//Евросиб Каблов 05.03.2021 ( Ticket#0219054
				//ПоляИсключения.Добавить("ПодписанСДвухСторон");
				//Евросиб Каблов 05.03.2021 )			
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				Если РольДоступна("dc_РазрешитьРедактированиеТранзитДляКлиентаПСЦ") Тогда
					ПоляИсключения.Добавить("ТранзитДляКлиента");
				КонецЕсли;
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				
				//Евросиб Каблов 23.12.2025 ( #126470
				Если РольДоступна("dc_ДоступРазрешатьПересчетСтавкиУслугиВСчетНДС22") Тогда
					ПоляИсключения.Добавить("РазрешенПересчетСтавкиУслугиВСчетНДС22");
				КонецЕсли;
				//Евросиб Каблов 23.12.2025 ) #126470
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			Иначе
				
				//Евросиб Каблов 05.03.2021 (
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				Если Не РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда
					ПоляИсключения.Добавить("ПодписанСДвухСторон");
					ПоляИсключения.Добавить("МаксимальнаяДатаПодписанияСДвухСторон");
					ПоляИсключения.Добавить("ПродлитьПериодПодписания");  
					//Субботин TASK 71862 11.07.2023 Начало
					ПоляИсключения.Добавить("СтатусДокумента");
					//Субботин TASK 71862 11.07.2023 Конец
				КонецЕсли;
				Если Не РольДоступна("dc_ПрикреплениеСканов") Тогда 
					ПоляИсключения.Добавить("ДобавитьСсылкуDV");
					ПоляИсключения.Добавить("СсылкаDV");
				КонецЕсли;
				//Евросиб - АСуслов 25.03.2022 15:36:43 #
				//(
				ПоляИсключения.Добавить("ДатаСогласования");
				//)
				//Евросиб - АСуслов 25.03.2022 15:36:45 #
				// Евросиб Фролов (04.05.2022 Task №41900
				//ДИТ Авдеева В.С. 0282860 26.08.2022 Начало   
				//Если КнопкаВозвратаЗадачиДоступна Тогда
				// ++ Дудоров С.В. Ticket#61931 29.11.2022
				// Закомментирован для стандартизации кода. 
				//Если Не КнопкаВозвратаЗадачиДоступна Тогда
				////ДИТ Авдеева В.С. 0282860 26.08.2022 Конец
				//ПоляИсключения.Добавить("ФормаОбщаяКомандаВернутьЗадачу");
				//КонецЕсли;	
				// -- Дудоров С.В. Ticket#61931 29.11.2022
				// Евросиб Фролов)
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				//Евросиб Каблов 05.03.2021 ) 
				
			КонецЕсли;
			
			//  
			// ДИТ Поморцева Т.П. Задача 36404 08.07.21. начало
			//Если Выборка.ТекущееСостояниеСогласование Тогда
			//Евросиб - АСуслов 25.03.2022 15:01:39 #
			//(
			//ТекущееСостояниеСогласование = ?(Выборка.ТекущееСостояниеСогласование = Неопределено, Ссылка.ТекущееСостояние.Согласование, Выборка.ТекущееСостояниеСогласование);			
			//)
			//Если ТекущееСостояниеСогласование Тогда
			Если ПСЦТекущееСостояниеСогласование = Истина Тогда
				//Евросиб - АСуслов 25.03.2022 15:01:40 #
				// ДИТ Поморцева Т.П. Задача 36404 08.07.21. конец
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	//Евросиб Каблов 24.06.2024 ( #67092
	#Область ПСЦПоставщика
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ПСЦ.ТекущееСостояние.Согласование, ЛОЖЬ) КАК ТекущееСостояниеСогласование,
			|	ПСЦ.СтатусДокумента КАК СтатусДокумента
			|ИЗ
			|	Документ.ПСЦПоставщика КАК ПСЦ
			|ГДЕ
			|	ПСЦ.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщикаСостояния.Состояние КАК Состояние
			|ИЗ
			|	Документ.ПСЦПоставщика.Состояния КАК ПСЦПоставщикаСостояния
			|ГДЕ
			|	ПСЦПоставщикаСостояния.Ссылка = &Ссылка
			|	И ПСЦПоставщикаСостояния.Статус = &СтатусВыполнен
			|	И ПСЦПоставщикаСостояния.СтатусСогласования <> &ПустойСтатусСогласования
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщикаСостояния.Состояние КАК Состояние,
			|	ПСЦПоставщикаСостояния.Исполнитель КАК Исполнитель
			|ИЗ
			|	Документ.ПСЦПоставщика.Состояния КАК ПСЦПоставщикаСостояния
			|ГДЕ
			|	ПСЦПоставщикаСостояния.Ссылка = &Ссылка
			|	И ПСЦПоставщикаСостояния.Состояние = &СостояниеВводПСЦ";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("СтатусВыполнен", Перечисления.СтатусыЭтапов.Выполнен);
			Запрос.УстановитьПараметр("ПустойСтатусСогласования", Перечисления.СтатусыСогласования.ПустаяСсылка());
			Запрос.УстановитьПараметр("СостояниеВводПСЦ", Справочники.Состояния.ВводПСЦ);
			
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			Выборка.Следующий();			
			ПСЦСтатусДокумента = Выборка.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = Выборка.ТекущееСостояниеСогласование;
			
			Если РезультатыЗапроса[1].Пустой() Тогда
				ЕстьВыполненныеСогласования = Ложь;
			Иначе
				ЕстьВыполненныеСогласования = Истина;
			КонецЕсли;
			
			Выборка = РезультатыЗапроса[2].Выбрать();
			ТекущийПользовательИсполнительВводаПСЦ = Ложь;			
			Если Выборка.Следующий() Тогда
				ИсполнительВводаПСЦ = Выборка.Исполнитель;
				Если ИсполнительВводаПСЦ = Пользователи.ТекущийПользователь() Тогда
					ТекущийПользовательИсполнительВводаПСЦ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе     
			
			ПСЦСтатусДокумента = Объект.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование");
			
			ЕстьВыполненныеСогласования = Ложь;			
			Для Каждого Стр Из Объект.Состояния Цикл
				Если ЗначениеЗаполнено(Стр.СтатусСогласования) И Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
					ЕстьВыполненныеСогласования = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ТекущийПользовательИсполнительВводаПСЦ = Ложь;
			СтрокиВводПСЦ = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ВводПСЦ));
			Если ЗначениеЗаполнено(СтрокиВводПСЦ) Тогда
				ИсполнительВводаПСЦ = СтрокиВводПСЦ[0].Исполнитель;
				Если ИсполнительВводаПСЦ = Пользователи.ТекущийПользователь() Тогда
					ТекущийПользовательИсполнительВводаПСЦ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦПоставщика") Тогда			
			
			//Для всех
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровести");
			ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");		
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_ОдноязычныйУниверсальныйФаксимиле");
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_одноязычный2");
			ПоляИсключения.Добавить("ФормаОтозватьСогласование");
			ПоляИсключения.Добавить("СостоянияЗапуститьНаСогласование");
			
			ПоляИсключения.Добавить("КритерииУслуг");
			// Евросиб US 89887 TA 89889 Рыбьяков К.А. 07.02.2025 ((
			ПоляИсключения.Добавить("РелизСобственника");
			// Евросиб Рыбьяков К.А. 07.02.2025 ))
			
			ПоляИсключения.Добавить("ПередатьПСЦВДО");
			ПоляИсключения.Добавить("УслугиПоказывать");			
			ПоляИсключения.Добавить("ФормаОбщаяКомандаВернутьЗадачу");
			
			ПоляИсключения.Добавить("УслугиДетализацияПоНомерамКТКВагонов");
			ПоляИсключения.Добавить("УслугиДетализацияКомплекснойСтавки");
			ПоляИсключения.Добавить("УслугиПоказыватьНормативы");
			ПоляИсключения.Добавить("УслугиПоказыватьОпасныйГруз");
			ПоляИсключения.Добавить("УслугиПоказыватьОсобыйТемпературныйРежим");
			ПоляИсключения.Добавить("УслугиПоказыватьВсе");
			ПоляИсключения.Добавить("УслугиСкрытьВсе");
			ПоляИсключения.Добавить("ЗаполнятьВниз");
			
			//Евросиб Каблов 28.05.2025 ( #110493
			ПоляИсключения.Добавить("Услуги.Нормативы");
			ПоляИсключения.Добавить("Услуги.НормаЗагрузкиКТК");
			ПоляИсключения.Добавить("Услуги.НормаВремениНаПогрузкуВыгрузку");
			ПоляИсключения.Добавить("Услуги.НормативНахожденияНаПогрузке");
			ПоляИсключения.Добавить("Услуги.НормативНахожденияНаВыгрузке");
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			Если Ссылка.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.ТЭО Тогда
				ПоляИсключения.Добавить("Услуги.НормаПользования");
			КонецЕсли;
			//Евросиб Каблов 28.05.2025 )
			
			Если РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда 
				ПоляИсключения.Добавить("ПодписанСДвухСторон");
                ПоляИсключения.Добавить("СтатусДокумента");
			КонецЕсли;
			
			Если РольДоступна("dc_ПрикреплениеСканов") Тогда 
				ПоляИсключения.Добавить("ДобавитьСсылкуDV");
				ПоляИсключения.Добавить("СсылкаDV");
			КонецЕсли;
			
			Если РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
				ПоляИсключения.Добавить("Состояния");
			КонецЕсли;
			
			Если ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.Подписано Тогда
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				//Для Менеджера по сопровождению и Менеджера по продажам
				ПоляИсключения.Добавить("ОкончаниеДействияФакт");
				
				//Для Делопроизводителей
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
							
			ИначеЕсли ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении
				Или ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Тогда
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				Если РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
					Если Не ЕстьВыполненныеСогласования Тогда
						ПоляИсключения.Добавить("ФормаПСЦПоставщикаЗаменитьИсполнителя");
					КонецЕсли;
				КонецЕсли;
				
				//Для Делопроизводителей
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				
				//Евросиб Каблов 27.02.2025 ( #100116				
				ПоляИсключения.Добавить("НомерПСЦ");
				ПоляИсключения.Добавить("ФорматПротокола");
				ПоляИсключения.Добавить("ВариантОпределенияДатыКурсаВалют");
				ПоляИсключения.Добавить("ВалютаОплаты");
				ПоляИсключения.Добавить("СуммаВключаетНДС");
				ПоляИсключения.Добавить("ОтветственныйМенеджер");
				ПоляИсключения.Добавить("Комментарий");
				
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				ПоляИсключения.Добавить("Услуги.ЭкспортИмпорт");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоПриемуАвто");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоПриемуМоре");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоПриемуСклад");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоПриемуЖД");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоОтправлениюАвто");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоОтправлениюМоре");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоОтправлениюСклад");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоОтправлениюЖД");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоОтправлению");
				ПоляИсключения.Добавить("Услуги.ПеревалкаПоПриему");
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				
				ПоляИсключения.Добавить("ОкончаниеДействия");
				ПоляИсключения.Добавить("ДействуетДоСогласованияНовыхУсловий");
				ПоляИсключения.Добавить("НаименованиеПодписиКонтрагента");
				ПоляИсключения.Добавить("РуководительКонтрагента");
				ПоляИсключения.Добавить("ПодписантКонтрагента");
				ПоляИсключения.Добавить("СрокДействияДоверенностиНаПодписантаКонтрагента");
				ПоляИсключения.Добавить("НачалоДействияДоверенностиНаПодписанта");
				ПоляИсключения.Добавить("ОкончаниеДействияДоверенностиНаПодписанта");
				ПоляИсключения.Добавить("ДоверенностьНаПодписантаКонтрагента");
				ПоляИсключения.Добавить("СканДоверенностиНаПодписантаКонтрагента");
				ПоляИсключения.Добавить("НаименованиеПодписи");
				ПоляИсключения.Добавить("ДоверенностьЗаРуководителя");
				ПоляИсключения.Добавить("ДоверенностьУказываетсяВручную");
				ПоляИсключения.Добавить("ДобавитьРуководителяКонтрагента");
				
				ПоляИсключения.Добавить("Услуги.НаименованиеНоменклатурыПоставщика");
				ПоляИсключения.Добавить("Услуги.НоменклатураПоставщика");
				ПоляИсключения.Добавить("Услуги.БазоваяСтавкаНадбавка");
				ПоляИсключения.Добавить("Услуги.ТребуетсяДетализацияКомплекснойСтавки");
				ПоляИсключения.Добавить("Услуги.ЕдиницаИзмерения");
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				Если Ссылка.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.Порты И Ссылка.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.Фрахт Тогда
					ПоляИсключения.Добавить("Услуги.СтандартОпасностиГруза");
					ПоляИсключения.Добавить("Услуги.КлассОпасностиГруза");                  
				КонецЕсли;
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				
				//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
				Если Ссылка.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт Тогда
					ПоляИсключения.Добавить("Услуги.Линия");
					ПоляИсключения.Добавить("Услуги.КоличествоКТКВПартии");
					ПоляИсключения.Добавить("Услуги.СостоянияГруженыйПорожнийСтрокой");
					ПоляИсключения.Добавить("Услуги.Коносамент");
					ПоляИсключения.Добавить("Услуги.Судно");
					ПоляИсключения.Добавить("Услуги.РейсМоре");
					ПоляИсключения.Добавить("Услуги.Грузоотправитель");
					ПоляИсключения.Добавить("Услуги.СтандартОпасностиГруза");
					ПоляИсключения.Добавить("Услуги.Грузополучатель");
					ПоляИсключения.Добавить("Услуги.ГрузТНВЭД");
					ПоляИсключения.Добавить("Услуги.КодТНВЭД");
					ПоляИсключения.Добавить("Услуги.ВесГруза");
					ПоляИсключения.Добавить("Услуги.ГрузРастаможен");
					ПоляИсключения.Добавить("Услуги.КлассОпасностиГруза");
					ПоляИсключения.Добавить("Услуги.СвободныйПериодХранения");
					ПоляИсключения.Добавить("Услуги.Комментарий");
					ПоляИсключения.Добавить("Услуги.СпособВводаУчетныхЕдиниц");
					ПоляИсключения.Добавить("Услуги.КонтейнерыВагоны");
					ПоляИсключения.Добавить("Услуги.ДляПорожних");
					ПоляИсключения.Добавить("Услуги.ДляГруженых");
					ПоляИсключения.Добавить("Услуги.ВариантОпределенияДатыКурсаВалют");
					ПоляИсключения.Добавить("ШкалаСтавок");
					ПоляИсключения.Добавить("ШкалаСтавок.От");
					ПоляИсключения.Добавить("ШкалаСтавок.До");
					ПоляИсключения.Добавить("ШкалаСтавок.СтоимостьСНДС");
					ПоляИсключения.Добавить("ШкалаСтавок.СтоимостьБезНДС");
				КонецЕсли;	
				//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
				Если Ссылка.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
					ПоляИсключения.Добавить("Услуги.БондоваяЗона");
					ПоляИсключения.Добавить("Услуги.Линия");
					ПоляИсключения.Добавить("Услуги.Коносамент");
					ПоляИсключения.Добавить("Услуги.Судно");
					ПоляИсключения.Добавить("Услуги.РейсМоре");
					ПоляИсключения.Добавить("Услуги.ГрузТНВЭД");
					ПоляИсключения.Добавить("Услуги.КодТНВЭД");
					ПоляИсключения.Добавить("Услуги.СостоянияГруженыйПорожнийСтрокой");
					ПоляИсключения.Добавить("Услуги.ВидыОтправокСтрокой");
					ПоляИсключения.Добавить("Услуги.ТребуетсяДетализацияКомплекснойСтавки");
					ПоляИсключения.Добавить("Услуги.УсловияПеревозкиПоОтправлению");
					ПоляИсключения.Добавить("Услуги.УсловияПеревозкиПоПрибытию");
					ПоляИсключения.Добавить("Услуги.СвободныйПериодХраненияКТК");
					ПоляИсключения.Добавить("Услуги.СвободныйПериодХраненияВаг");
					ПоляИсключения.Добавить("Услуги.ВесГруза");
					ПоляИсключения.Добавить("Услуги.ГрузРастаможен");
					ПоляИсключения.Добавить("Услуги.ДляПорожних");
					ПоляИсключения.Добавить("Услуги.ДляГруженых");
					ПоляИсключения.Добавить("Услуги.ВариантОпределенияДатыКурсаВалют");
					ПоляИсключения.Добавить("Услуги.КоличествоКТКВПартии");
					ПоляИсключения.Добавить("Услуги.СтандартОпасностиГруза");
					ПоляИсключения.Добавить("Услуги.КлассОпасностиГруза");
					ПоляИсключения.Добавить("Услуги.СвободныйПериодХранения");
					ПоляИсключения.Добавить("Услуги.СпособВводаУчетныхЕдиниц");
					ПоляИсключения.Добавить("Услуги.КонтейнерыВагоны");
					ПоляИсключения.Добавить("Услуги.КТКОпределенногоСобственника");
					ПоляИсключения.Добавить("Услуги.ВагонОпределенногоСобственника");
					ПоляИсключения.Добавить("Услуги.ВидСобственности");
					ПоляИсключения.Добавить("ШкалаСтавок");
					ПоляИсключения.Добавить("ШкалаСтавок.От");
					ПоляИсключения.Добавить("ШкалаСтавок.До");
					ПоляИсключения.Добавить("ШкалаСтавок.СтоимостьСНДС");
					ПоляИсключения.Добавить("ШкалаСтавок.СтоимостьБезНДС");
					ПоляИсключения.Добавить("Услуги.ПринадлежностьТЕ");
				КонецЕсли;
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
				//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
				Если Ссылка.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны Тогда
					ПоляИсключения.Добавить("Услуги.КоличествоМестTEU");
				КонецЕсли;
				//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
				//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
				Если Ссылка.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
					ПоляИсключения.Добавить("Услуги.ПунктНазначения");
				КонецЕсли;
				//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
				
				ПоляИсключения.Добавить("Услуги.СпособВводаУчетныхЕдиниц");
				ПоляИсключения.Добавить("Услуги.КонтейнерыВагоны");
				ПоляИсключения.Добавить("Услуги.Комментарий");
				ПоляИсключения.Добавить("Услуги.ГрузЕТСНГ");
				ПоляИсключения.Добавить("Услуги.ЕТСНГ");
				ПоляИсключения.Добавить("Услуги.ГрузГНГ");
				ПоляИсключения.Добавить("Услуги.ГНГ");
				ПоляИсключения.Добавить("Услуги.Критерий");
				
				ПоляИсключения.Добавить("УчетныеЕдиницы");
				ПоляИсключения.Добавить("СписокУчетныхЕдиниц");
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки");
				ПоляИсключения.Добавить("КритерииУслуг");
				//Евросиб Каблов 27.02.2025 )
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			Иначе
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				Если Не РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда
					ПоляИсключения.Добавить("ПодписанСДвухСторон");
					ПоляИсключения.Добавить("МаксимальнаяДатаПодписанияСДвухСторон");
					ПоляИсключения.Добавить("ПродлитьПериодПодписания");  
					ПоляИсключения.Добавить("СтатусДокумента");
				КонецЕсли;
				Если Не РольДоступна("dc_ПрикреплениеСканов") Тогда 
					ПоляИсключения.Добавить("ДобавитьСсылкуDV");
					ПоляИсключения.Добавить("СсылкаDV");
				КонецЕсли;
				Если Не РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
					ПоляИсключения.Добавить("ФормаПСЦПоставщикаЗаменитьИсполнителя");
				КонецЕсли;
				ПоляИсключения.Добавить("ДатаСогласования");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			КонецЕсли;
			
			Если ПСЦТекущееСостояниеСогласование = Истина Тогда
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);			
			КонецЕсли;
			
			Если Не ТекущийПользовательИсполнительВводаПСЦ Тогда
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				ПоляИсключения.Добавить("УслугиГруппаНормативы");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			КонецЕсли;
						
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. 26.03.2025 (( #102319
		//если вид услуг – автоперевозки и тип протокола - ТИПОВОЙ, и в присоединенных файлах есть печатная форма,
		//то блокируем все поля документа
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ДанныеПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидУслугПоставщика, Типовой");
			НаличиеФайлаПФвПрисоединенныхФайлах = ПроверитьНаличиеФайлаПФПСЦПоставщикаАвтоперевозки(Ссылка);
			Если ДанныеПСЦ.Типовой 
					И ДанныеПСЦ.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки")
					И НаличиеФайлаПФвПрисоединенныхФайлах Тогда
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				ПоляИсключения = Новый Массив;
				
				Если РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
					//Евросиб Шевченко А.В. BUG 121800 TA 121801 05.11.2025
					ПоляИсключения.Добавить("ФормаПСЦПоставщикаЗаменитьИсполнителя");
					//Евросиб Шевченко А.В. BUG 121800 TA 121801 05.11.2025
				КонецЕсли;   
				
				ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
				ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
				ПоляИсключения.Добавить("ФормаЗаписать");
				ПоляИсключения.Добавить("ФормаПровести");
				ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");		
				ПоляИсключения.Добавить("ФормаОтозватьСогласование");
				ПоляИсключения.Добавить("СостоянияЗапуститьНаСогласование");
				
				//ТЧ Услуги
				ПоляИсключения.Добавить("Услуги");
				//Евросиб Ситников К.А. 09.07.2025 Task 113813				
				ПоляИсключения.Добавить("Услуги.НоменклатураПоставщика");
                //Евросиб Ситников К.А. 09.07.2025 Task 113813
				ПоляИсключения.Добавить("УслугиДетализацияПоНомерамКТКВагонов");
				ПоляИсключения.Добавить("УслугиДетализацияКомплекснойСтавки");
				
				ПоляИсключения.Добавить("Услуги.ТребуетсяДетализацияКомплекснойСтавки");
				ПоляИсключения.Добавить("Услуги.НаименованиеНоменклатурыПоставщика");
				ПоляИсключения.Добавить("Услуги.ЕдиницаИзмерения");
				ПоляИсключения.Добавить("Услуги.Комментарий");
				ПоляИсключения.Добавить("Услуги.ОпасныйСпецГруз");
				ПоляИсключения.Добавить("Услуги.КлассОпасностиГруза");
				ПоляИсключения.Добавить("Услуги.СтандартОпасностиГруза"); 
				ПоляИсключения.Добавить("Услуги.СпособВводаУчетныхЕдиниц");
				ПоляИсключения.Добавить("Услуги.КонтейнерыВагоны");
				
				//ТЧ СписокУчетныхЕдиниц
				ПоляИсключения.Добавить("СписокУчетныхЕдиниц");
				ПоляИсключения.Добавить("УслугиВставитьСписокКТКИзExcel");
				ПоляИсключения.Добавить("УслугиВставитьСписокВагоновИзExcel");
				ПоляИсключения.Добавить("СписокУчетныхЕдиниц.УчетнаяЕдиницаСсылка");
				ПоляИсключения.Добавить("СписокУчетныхЕдиниц.УчетнаяЕдиница");
				
				//ТЧ ДетализацияКомплекснойСтавки
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки");
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки.НомерСтроки"); 
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки.НоменклатураПоставщика");
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки.ИдентификаторСтрокиУслуг");
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки.Номенклатура");
				ПоляИсключения.Добавить("ДетализацияКомплекснойСтавки.ПроцентОтСтавки");
				
				//Евросиб Ситников К.А. 09.07.2025 Task 113813
				ПоляИсключения.Добавить("КритерииУслуг");
				ПоляИсключения.Добавить("УчетныеЕдиницы");
                //Евросиб Ситников К.А. 09.07.2025 Task 113813				
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения); 
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				СтруктураБлокировки.ОписаниеБлокировки = "Документ заблокирован. Печатная форма сохранена в Присоединенных файлах. Для разблокировки удалите сохраненную печатную форму.";
			КонецЕсли;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 26.03.2025 )) #102319 
		
	КонецЕсли;
	#КонецОбласти
	//Евросиб Каблов 24.06.2024 )
	
	//Евросиб Каблов 18.12.2024 ( #89872
	#Область ПротоколНормативныхСтавокПоУслугамПоставщика
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(Протокол.ТекущееСостояние.Согласование, ЛОЖЬ) КАК ТекущееСостояниеСогласование,
			|	Протокол.СтатусДокумента КАК СтатусДокумента
			|ИЗ
			|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК Протокол
			|ГДЕ
			|	Протокол.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщикаСостояния.Состояние КАК Состояние
			|ИЗ
			|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Состояния КАК ПСЦПоставщикаСостояния
			|ГДЕ
			|	ПСЦПоставщикаСостояния.Ссылка = &Ссылка
			|	И ПСЦПоставщикаСостояния.Статус = &СтатусВыполнен
			|	И ПСЦПоставщикаСостояния.СтатусСогласования <> &ПустойСтатусСогласования
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПротоколСостояния.Состояние КАК Состояние,
			|	ПротоколСостояния.Исполнитель КАК Исполнитель
			|ИЗ
			|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Состояния КАК ПротоколСостояния
			|ГДЕ
			|	ПротоколСостояния.Ссылка = &Ссылка
			|	И ПротоколСостояния.Состояние = &СостояниеВводПСЦ";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("СтатусВыполнен", Перечисления.СтатусыЭтапов.Выполнен);
			Запрос.УстановитьПараметр("ПустойСтатусСогласования", Перечисления.СтатусыСогласования.ПустаяСсылка());
			Запрос.УстановитьПараметр("СостояниеВводПСЦ", Справочники.Состояния.ВводПСЦ);
			
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			Выборка.Следующий();			
			ПСЦСтатусДокумента = Выборка.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = Выборка.ТекущееСостояниеСогласование;
			
			Если РезультатыЗапроса[1].Пустой() Тогда
				ЕстьВыполненныеСогласования = Ложь;
			Иначе
				ЕстьВыполненныеСогласования = Истина;
			КонецЕсли;
			
			Выборка = РезультатыЗапроса[2].Выбрать();
			ТекущийПользовательИсполнительВводаПСЦ = Ложь;			
			Если Выборка.Следующий() Тогда
				ИсполнительВводаПСЦ = Выборка.Исполнитель;
				Если ИсполнительВводаПСЦ = Пользователи.ТекущийПользователь() Тогда
					ТекущийПользовательИсполнительВводаПСЦ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе     
			
			ПСЦСтатусДокумента = Объект.СтатусДокумента;
			ПСЦТекущееСостояниеСогласование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование");
			
			ЕстьВыполненныеСогласования = Ложь;			
			Для Каждого Стр Из Объект.Состояния Цикл
				Если ЗначениеЗаполнено(Стр.СтатусСогласования) И Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
					ЕстьВыполненныеСогласования = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ТекущийПользовательИсполнительВводаПСЦ = Ложь;
			СтрокиВводПСЦ = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ВводПСЦ));
			Если ЗначениеЗаполнено(СтрокиВводПСЦ) Тогда
				ИсполнительВводаПСЦ = СтрокиВводПСЦ[0].Исполнитель;
				Если ИсполнительВводаПСЦ = Пользователи.ТекущийПользователь() Тогда
					ТекущийПользовательИсполнительВводаПСЦ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеПСЦПоставщика") Тогда			
			
			//Для всех
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровести");
			ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");		
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_ОдноязычныйУниверсальныйФаксимиле");
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_ПСЦ_одноязычный2");
			ПоляИсключения.Добавить("ФормаОтозватьСогласование");
			ПоляИсключения.Добавить("СостоянияЗапуститьНаСогласование");
			ПоляИсключения.Добавить("ФормаДокументЗаявкаСоздатьНаОсновании");
			ПоляИсключения.Добавить("ФормаДокументПСЦСкопироватьПротоколСКалькуляциями");
			ПоляИсключения.Добавить("ОбновитьТарифы");
			ПоляИсключения.Добавить("НомерПСЦ");
			ПоляИсключения.Добавить("ФорматПротокола");
			ПоляИсключения.Добавить("ВариантОпределенияДатыКурсаВалют");
			ПоляИсключения.Добавить("ВалютаОплаты");
			ПоляИсключения.Добавить("ФиксКурсВалюты");
			ПоляИсключения.Добавить("СтавкаНДС");
			ПоляИсключения.Добавить("КлиентскийНомер");
			//Для Менеджера по сопровождению и Менеджера по продажам
			ПоляИсключения.Добавить("БезДоверенностей");
			ПоляИсключения.Добавить("НаименованиеПодписиИсполнителя");
			ПоляИсключения.Добавить("ДоверенностьЗаРуководителя");
			ПоляИсключения.Добавить("ДоверенностьЗаГлБухгалтера");
			ПоляИсключения.Добавить("НаименованиеПодписиКлиента");
			//ПоляИсключения.Добавить("РуководительКонтрагента");
			ПоляИсключения.Добавить("ДобавитьРуководителяКонтрагента");
			ПоляИсключения.Добавить("ПередатьПСЦВДО");
			ПоляИсключения.Добавить("УслугиПоказывать");
			
			//ПоляИсключения.Добавить("НачалоДействия");
			ПоляИсключения.Добавить("ДоверенностьУказываетсяВручную");
			ПоляИсключения.Добавить("НаименованиеПодписиКонтрагента");
			ПоляИсключения.Добавить("ДоверенностьНаПодписанта");
			ПоляИсключения.Добавить("ДоверенностьЗаРуководителя");
			
			ПоляИсключения.Добавить("Комментарий");
			ПоляИсключения.Добавить("ОтветственныйМенеджер");
			
			ПоляИсключения.Добавить("ФормаОбщаяКомандаВернутьЗадачу");
			
			Если РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда 
				ПоляИсключения.Добавить("ПодписанСДвухСторон");
                ПоляИсключения.Добавить("СтатусДокумента");
			КонецЕсли;
			
			Если РольДоступна("dc_ПрикреплениеСканов") Тогда 
				ПоляИсключения.Добавить("ДобавитьСсылкуDV");
				ПоляИсключения.Добавить("СсылкаDV");
			КонецЕсли;
			
			Если РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
				ПоляИсключения.Добавить("Состояния");
			КонецЕсли;
			
			Если ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.Подписано Тогда
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				//Для Менеджера по сопровождению и Менеджера по продажам
				ПоляИсключения.Добавить("ОкончаниеДействияФакт");
				
				//Для Делопроизводителей
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				Если РольДоступна("dc_РазрешитьРедактированиеТранзитДляКлиентаПСЦ") Тогда
					ПоляИсключения.Добавить("ТранзитДляКлиента");
				КонецЕсли;
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			ИначеЕсли ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении
				Или ПСЦСтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Тогда
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
				
				Если РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
					Если Не ЕстьВыполненныеСогласования Тогда
						ПоляИсключения.Добавить("ФормаЗаменитьИсполнителяПротокола");
					КонецЕсли;
				КонецЕсли;
				
				//Для Делопроизводителей
				ПоляИсключения.Добавить("ДатаПолученияОригинала");
				
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				Если РольДоступна("dc_РазрешитьРедактированиеТранзитДляКлиентаПСЦ") Тогда
					ПоляИсключения.Добавить("ТранзитДляКлиента");
				КонецЕсли;
				//ДИТ Шевченко А.В. US 102665 TA 102673 13.02.2025
				
				//Не ключевые поля 
				ПоляИсключения.Добавить("Услуги.ВидСобственности");
				ПоляИсключения.Добавить("Услуги.ПериодПредоставления");
				ПоляИсключения.Добавить("Услуги.Комментарий");
				ПоляИсключения.Добавить("Услуги.ТипоразмерВагона");
				ПоляИсключения.Добавить("Услуги.СтанцияОтправления");
				ПоляИсключения.Добавить("Услуги.СтанцияНазначения");
				ПоляИсключения.Добавить("Услуги.НормаПользования");
				ПоляИсключения.Добавить("Услуги.НормативНахожденияНаПогрузке");
				ПоляИсключения.Добавить("Услуги.НормативНахожденияНаВыгрузке");
				ПоляИсключения.Добавить("Услуги.ОсобыйТемпературныйРежим");
				ПоляИсключения.Добавить("Услуги.Груз");
				ПоляИсключения.Добавить("Услуги.СтоимостьБазовойСтавкиНадбавки");
				ПоляИсключения.Добавить("Услуги.СтанцииПогранпереходов");
				
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			Иначе
				
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				Если Не РольДоступна("dc_РазрешитьПродлениеПериодаПодписанияПротокола") Тогда
					ПоляИсключения.Добавить("ПодписанСДвухСторон");
					ПоляИсключения.Добавить("МаксимальнаяДатаПодписанияСДвухСторон");
					ПоляИсключения.Добавить("ПродлитьПериодПодписания");  
					ПоляИсключения.Добавить("СтатусДокумента");
				КонецЕсли;
				Если Не РольДоступна("dc_ПрикреплениеСканов") Тогда 
					ПоляИсключения.Добавить("ДобавитьСсылкуDV");
					ПоляИсключения.Добавить("СсылкаDV");
				КонецЕсли;
				Если Не РольДоступна("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика") Тогда
					ПоляИсключения.Добавить("ФормаЗаменитьИсполнителяПротокола");
				КонецЕсли;
				ПоляИсключения.Добавить("ДатаСогласования");
				ПоляИсключения.Добавить("ДатаПСЦ");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
				
			КонецЕсли;
			
			Если ПСЦТекущееСостояниеСогласование = Истина Тогда
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);			
			КонецЕсли;
			
			Если Не ТекущийПользовательИсполнительВводаПСЦ Тогда
				УсловиеБлокировки = Новый Структура;
				УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
				ПоляИсключения = Новый Массив;
				ПоляИсключения.Добавить("УслугиГруппаНормативы");
				УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
				ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	//Евросиб Каблов 18.12.2024 )
	
	#Область Калькуляция
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Калькуляция") Тогда
		
		//Евросиб Каблов 05.07.2021 ( Task 36231
		//Если РольДоступна("ПолныеПрава") Тогда
		Если ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеКалькуляций") Тогда
			//Евросиб Каблов 05.07.2021 )
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Калькуляция.ТекущееСостояние.Согласование, ЛОЖЬ) КАК ТекущееСостояниеСогласование,
		|	Калькуляция.СтатусДокумента КАК СтатусДокумента
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Если Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении
			//Евросиб Гудкова( 07.10.2020 Ticket№ 0209478
			//было
			//				Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
			Или Выборка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Тогда
			// Евросиб Гудкова) 				
			
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
			
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ФормаОбщаяКомандаЗакрытьТекущуюЗадачу");
			ПоляИсключения.Добавить("ФормаЗаписать");
			//Евросиб Каблов 18.08.2021 ( Ticket#0240818
			ПоляИсключения.Добавить("ФормаПровести");
			ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");
			//Евросиб Каблов 18.08.2021 )
			ПоляИсключения.Добавить("ФормаОтозватьСогласование");
			ПоляИсключения.Добавить("СостоянияЗапуститьНаСогласование");
			ПоляИсключения.Добавить("ФормаДокументПСЦСоздатьНаОсновании");
			ПоляИсключения.Добавить("ПодменюПечатьОбычное_КП");
			ПоляИсключения.Добавить("ФормаОбработкаДиалогиДиалогиКонтекста");
			ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействияЗапланироватьВзаимодействиеПоПредмету");
			ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействияЗапланироватьВстречуПоПредмету");
			ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействияНаписатьSMSПоПредмету");
			ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействияНаписатьЭлектронноеПисьмоПоПредмету");
			ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействияПозвонитьПоПредмету");
			ПоляИсключения.Добавить("ФормаОбщаяКомандаНапомнитьОЗадачахПользователя");
			
			УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			
		КонецЕсли;
		
		//Иначе //Гудкова разделила Если
		//	
		//	Возврат СтруктураБлокировки;
		
	КонецЕсли;
	#КонецОбласти	
	#Область э_Накладная
	//Евросиб Каблов 29.06.2021 (
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.э_Накладная") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
		
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("ДатаИВремяПрибытияГрузаМестная");
		ПоляИсключения.Добавить("ДатаИВремяРаскредитованияГрузаМестная");
		// ДИТ Поморцева Т.П. 0248382 29.10.21. начало
		ПоляИсключения.Добавить("ДатаИВремяПрибытияГруза");
		ПоляИсключения.Добавить("ДатаИВремяРаскредитованияГруза");
		// ДИТ Поморцева Т.П. 0248382 29.10.21. конец
		ПоляИсключения.Добавить("ФормаЗаписать");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);		
		ДействующиеБлокировки.Добавить(УсловиеБлокировки);
		
	КонецЕсли;
	//Евросиб Каблов 29.06.2021 ) 
	#КонецОбласти
	#Область СчетНаОплатуПокупателю
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		ДействующаяБлокировка = Новый Структура;
		ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("НомерДляПечати");
		ПоляИсключения.Добавить("ПравилоФормирования");
		ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
		ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
		
	КонецЕсли;
	#КонецОбласти
	#Область ЗаявкаНаОплату
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		СтатусДокумента = Справочники.СтатусыДокументов.Подготовлена;
		
		ТекущийСтатус = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Ссылка));   
		
		Если ЗначениеЗаполнено(ТекущийСтатус.Статус) Тогда
			СтатусДокумента = ТекущийСтатус.Статус;  
		КонецЕсли;
		Если СтатусДокумента <> Справочники.СтатусыДокументов.Подготовлена Тогда
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("СтатусДокумента");
			ПоляИсключения.Добавить("ПричинаОтклонения");
			//Евросиб СубботинВ #89527 30.10.2024 Начало
            ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ДокументыНаОплату.ДатаОплаты");
			ПоляИсключения.Добавить("ДокументыНаОплатуПерезаполнитьДатуОплатыВДокументахОснования");
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровестиИЗакрыть");
			//Евросиб СубботинВ #118549 05.09.2025 Начало 
			ПоляИсключения.Добавить("ФормаПровести");
			//Евросиб СубботинВ #118549 05.09.2025 Конец
			//Евросиб СубботинВ #114616 20.08.2025 Начало
            ПоляИсключения.Добавить("ФормаЗагрузитьППБитФинанс");
			//Евросиб СубботинВ #114616 20.08.2025 Конец

			//Евросиб СубботинВ #102852 17.02.2025 Начало 
			//Если РольДоступна("dc_РазрешитьВыгрузкуЗаявокНаОплатуВУПП") тогда
			//	ПоляИсключения.Добавить("ФормаВыгрузитьВУПП");
			//КонецЕсли;
			//Евросиб СубботинВ #102852 17.02.2025 Конец
			//Евросиб СубботинВ #89527 30.10.2024 Конец
			УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
			УсловияБлокировки.Вставить("ЗарегистрированВОбмене", УсловиеБлокировки);
			//Евросиб СубботинВ #89527 30.10.2024 Начало /// добавил, т.к блок не отрабатывал 
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			//Евросиб СубботинВ #89527 30.10.2024 Конец

		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Акцепт
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Акцепт") Тогда
		ДокументВЗакрытомПериоде = Ложь;
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Проведен, ПериодВО, ПериодБУ, Организация");
			Если ЗначенияРеквизитов.Проведен Тогда 
				
				ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ЗначенияРеквизитов.ПериодВО, ЗначенияРеквизитов.Организация);
				
				Если Не ДокументВЗакрытомПериоде Тогда
					Если ЗначенияРеквизитов.ПериодБУ < КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ() Тогда
						ДокументВЗакрытомПериоде = Истина;
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли; 
		Если ДокументВЗакрытомПериоде Тогда
			
			ДействующаяБлокировка = Новый Структура;
			ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Истина);
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("Услуги.Выбрать");
			ПоляИсключения.Добавить("УслугиСоздатьЗапросНеурегулированныеРасходы");
			ПоляИсключения.Добавить("РазнесениеОтборыТаблицыРазнесения_ПоказатьВсе");
			ПоляИсключения.Добавить("РазнесениеОтборыТаблицыРазнесения_ТолькоНеразнесенные");
			ПоляИсключения.Добавить("УслугиВыбрать_ВыбратьВсе");
			ПоляИсключения.Добавить("УслугиВыбрать_ОтменитьВыбор");
			ПоляИсключения.Добавить("УслугиКонтекстноеМенюОткрытьСделку");
			ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
			ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
		Иначе	
			//Евросиб - АСуслов 06.01.2023 11:32:43 #63243
			//(
			ЭтоНеактуальныйАкцепт = Ложь;
			СтруктураПоследнегоПроведенногоАкцепта = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Объект.Поступление);
			Если ЗначениеЗаполнено(СтруктураПоследнегоПроведенногоАкцепта.АкцептСсылка)
				И СтруктураПоследнегоПроведенногоАкцепта.АкцептСсылка <> Ссылка Тогда
				ЭтоНеактуальныйАкцепт = Истина;
			КонецЕсли;
			Если ЭтоНеактуальныйАкцепт Тогда
				ПоляОбязательнойБлокировки.Добавить("РазнесениеОчиститьРазнесение");
				ПоляОбязательнойБлокировки.Добавить("УслугиАвторазнесениеПоПараметрам");
				ПоляОбязательнойБлокировки.Добавить("УслугиРазнестиНакопительнуюВедомость");
				ПоляОбязательнойБлокировки.Добавить("Услугин_ДобавитьВозмещаемыеДоходыИРасходы");
				ПоляОбязательнойБлокировки.Добавить("Услугин_ДобавитьДоходыИРасходыДопУслугой");
				ПоляОбязательнойБлокировки.Добавить("Услугин_ДобавитьРасходыПоПеревозкеКлиента");
				ПоляОбязательнойБлокировки.Добавить("Услугин_ДобавитьСобственныеЗатраты");
				ПоляОбязательнойБлокировки.Добавить("УслугиГруппаВынестиВСделку2");
				ПоляОбязательнойБлокировки.Добавить("УслугиОтвязатьСтроки");
				СтруктураБлокировки.ОписаниеБлокировки = "Для возможности разнесения строк акцепта проведите акцепт";
			КонецЕсли;
			//)
			//Евросиб - АСуслов 06.01.2023 11:32:45 #63243
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти  

	#Область ПоступлениеТоваровУслуг
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		//Евросиб Каблов 24.10.2023 ( Ticket#0328577		
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Услуги1ГУИДПТУ");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("НетПолныхПрав", УсловиеБлокировки);
		//Евросиб Каблов 24.10.2023 )
		
	КонецЕсли;
	#КонецОбласти
	
	#Область КорректировкаПоступления
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		//Евросиб Каблов 02.09.2024 ( Ticket#0360646		
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
		ПоляИсключения = Новый Массив;
		ПоляИсключения.Добавить("Услуги1ГУИДПТУ");
		ПоляИсключения.Добавить("Услуги1ГУИДстроки");
		
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		УсловияБлокировки.Вставить("НетПолныхПрав", УсловиеБлокировки);
		//Евросиб Каблов 02.09.2024 )
		
	КонецЕсли;
	#КонецОбласти
	
	//Субботин 75158 13.10.2023 начало
	#Область ТранспортныйДокумент 
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		ПоляИсключения = Новый Массив;	
		ПоляИсключения.Добавить("ВидОперации");
		ПоляИсключения.Добавить("Дата");
		ПоляИсключения.Добавить("Организация");
		ПоляИсключения.Добавить("НомерТранспортногоДокумента");
		ПоляИсключения.Добавить("ДатаТранспортногоДокумента");
		ПоляИсключения.Добавить("ДатаОтправленияПлан");
		ПоляИсключения.Добавить("ДатаПрибытияПлан");
		ПоляИсключения.Добавить("ДатаОтправления");
		ПоляИсключения.Добавить("ДатаПрибытия");
		ПоляИсключения.Добавить("Грузоотправитель");
		ПоляИсключения.Добавить("Грузополучатель");
		ПоляИсключения.Добавить("УведомляемыеСтороны");
		ПоляИсключения.Добавить("ФрахтНадбавки");
		ПоляИсключения.Добавить("Создано");
		ПоляИсключения.Добавить("Изменено");
		ПоляИсключения.Добавить("Автор");
		ПоляИсключения.Добавить("Контрагент");
		ПоляИсключения.Добавить("МорскаяЛиния");
		ПоляИсключения.Добавить("СтанцияОтправления");
		ПоляИсключения.Добавить("СтанцияНазначения");
		ПоляИсключения.Добавить("СпособВыпускаДокумента");
		ПоляИсключения.Добавить("Судно");
		ПоляИсключения.Добавить("МорскойРейс");
		ПоляИсключения.Добавить("Коносаменты");			
		
		УсловиеБлокировки = Новый Структура;
		УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);
		УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
		ДействующиеБлокировки.Добавить(УсловиеБлокировки);
		
	КонецЕсли;
	#КонецОбласти
	//Субботин 75158 13.10.2023 Конец 	
	
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	#Область РасчетСНП
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасчетСНП") Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		Если Ссылка.Счет.Проведен Тогда			
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
			ПоляИсключения = Новый Массив;	
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			ПоляИсключения.Добавить("ФормаЗаписать");
			УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			
			СтруктураБлокировки.Заблокирован = Истина;
			СтруктураБлокировки.ОписаниеБлокировки = "Документ заблокирован, поскольку счет проведен!";
		КонецЕсли;
		
	КонецЕсли;
	 
	#КонецОбласти
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	
	//++Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	#Область РефСцеп
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РефСцеп") Тогда

		Если ПроверитьДоступностьРоли("dc_РаботаСЗаявками") 
			и не ПроверитьДоступностьРоли("dc_УправлениеРефСцепами") Тогда
			
			
			ДействующаяБлокировка = Новый Структура;
			ДействующаяБлокировка.Вставить("БлокироватьВсеПоля", Истина);
			ПоляИсключения = Новый Массив;
			
			ПоляИсключения.Добавить("ФормаСоздатьЗаявку");
			ПоляИсключения.Добавить("ФормаДобавитьВЗаявку"); 
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровести");
			
			ПоляИсключения.Добавить("ВагоныРефСцепа");
			
			ПоляИсключения.Добавить("Контейнеры");
			
			ПоляИсключения.Добавить("ДетализацияПоГрузу");
			
			ДействующаяБлокировка.Вставить("ПоляИсключения", ПоляИсключения);
			ДействующиеБлокировки.Добавить(ДействующаяБлокировка);
			
			
		КонецЕсли;
		
	#КонецОбласти
	
	Иначе
	//--Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  

		//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			ПоляОбязательнойБлокировки.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании");
			ПоляОбязательнойБлокировки.Добавить("ФормаДокументРеализацияТоваровУслугСоздатьНаОсновании");
		КонецЕсли; 
		//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец
		
		//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
		Если ПоляОбязательнойБлокировки.Количество()>0 Тогда
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Ложь);	
			УсловиеБлокировки.Вставить("ПоляИсключения", ПоляОбязательнойБлокировки);
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
		КонецЕсли;    
		//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец
		
	//++Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	КонецЕсли;	
	//--Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	
#Область ФизическиеЛица
	//Евросиб Каблов 29.10.2024 ( #67092
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		СписокКонтрагентов = РегистрыСведений.ДанныеРуководителяКонтрагентов.ПолучитьКонтрагентовРезидентовПоРуководителю(Ссылка);
		Если ЗначениеЗаполнено(СписокКонтрагентов) Тогда
			
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);	
			УсловиеБлокировки.Вставить("ПоляИсключения", Новый Массив);
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
			
			СтруктураБлокировки.Заблокирован = Истина;
			СтруктураБлокировки.ОписаниеБлокировки = "Карточка заблокирована, поскольку физическое лицо является руководителем контрагента резидента. Запись недоступна!";
			
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 29.10.2024 )
#КонецОбласти

    //Евросиб СубботинВ #89527 30.10.2024 Начало 
    	#Область РеестрПлатежей
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеестрПлатежей") Тогда

		Если РольДоступна("ПолныеПрава") Тогда
			Возврат СтруктураБлокировки;
		КонецЕсли;
		
		Если РольДоступна("dc_СогласованиеРеестраПлатежей") 
			или РольДоступна("dc_УтверждениеРеестраПлатежей") Тогда 
			УсловиеБлокировки = Новый Структура;
			УсловиеБлокировки.Вставить("БлокироватьВсеПоля", Истина);
			
			ПоляИсключения = Новый Массив;
			ПоляИсключения.Добавить("ФормаПерейтиКСогласованию");
			ПоляИсключения.Добавить("Комментарий");
			ПоляИсключения.Добавить("ФормаЗаписать");
			ПоляИсключения.Добавить("ФормаПровести");
			ПоляИсключения.Добавить("ТекущийИсполнитель_Статус");
			УсловиеБлокировки.Вставить("ПоляИсключения", ПоляИсключения);		
			ДействующиеБлокировки.Добавить(УсловиеБлокировки);
		КонецЕсли;
    КонецЕсли;
	#КонецОбласти 
	//Евросиб СубботинВ #89527 30.10.2024 Конец 
	
	//Проверка условий блокировки
	Если УсловияБлокировки.Свойство("ЗарегистрированВОбмене") Или УсловияБлокировки.Свойство("Выставлен") Или УсловияБлокировки.Свойство("ВЗакрытомПериоде") Тогда
		ДанныеОБлокировке = ПолучитьДанныеОБлокировке(Ссылка);
		ЗаполнитьЗначенияСвойств(СтруктураБлокировки, ДанныеОБлокировке, "Заблокирован, ОписаниеБлокировки");
		//Евросиб Дубская 03.11.2022 ( Ticket#0287875   
		Если ДанныеОБлокировке.Свойство("ИзменитьСФ") Тогда
			СтруктураБлокировки.ИзменитьСФ = ДанныеОБлокировке.ИзменитьСФ;
		КонецЕсли;
		//Евросиб Дубская 03.11.2022 )
 		Для Каждого ПричинаБлокировки Из ДанныеОБлокировке.ПричиныБлокировки Цикл
			Блокировка = Неопределено;
			Если УсловияБлокировки.Свойство(ПричинаБлокировки, Блокировка) Тогда
				ДействующиеБлокировки.Добавить(Блокировка);
			КонецЕсли;
		КонецЦикла; 
		//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, ++     
		Если ДоступностиЭлементовПоВидуКорректировки.Свойство("ОписаниеПричиныБлокировкиРеквизитов") Тогда
			СтруктураБлокировки.ОписаниеБлокировки = СтруктураБлокировки.ОписаниеБлокировки +" "+ДоступностиЭлементовПоВидуКорректировки.ОписаниеПричиныБлокировкиРеквизитов; 
		КонецЕсли;
		//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, --
	КонецЕсли;
	
	ПричинаБлокировки = "НетПолныхПрав";
	Если УсловияБлокировки.Свойство(ПричинаБлокировки) Тогда
		Если Не РольДоступна("ПолныеПрава") И Не ПрограммноеИзменение Тогда
			Блокировка = Неопределено;
			Если УсловияБлокировки.Свойство(ПричинаБлокировки, Блокировка) Тогда
				ДействующиеБлокировки.Добавить(Блокировка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДействующиеБлокировки.Количество() = 0 Тогда
		Возврат СтруктураБлокировки;
	КонецЕсли;
	
	//Определение списка блокируемых полей
	
	ПоляУсловийБлокировки = Новый Массив;
	Для Каждого Блокировка Из ДействующиеБлокировки Цикл
		Для Каждого Поле Из Блокировка.ПоляИсключения Цикл
			Если ПоляУсловийБлокировки.Найти(Поле) = Неопределено Тогда
				ПоляУсловийБлокировки.Добавить(Поле);
			КонецЕсли;
		КонецЦикла;			
	КонецЦикла;
	
	ТаблицаБлокируемыхПолей = Новый ТаблицаЗначений;
	СоответствиеПолейКолонкам = Новый Соответствие;
	ИменаКолонокТаблицы = Новый Массив;
	ТипЗначенияКолонки = Новый ОписаниеТипов("Число");	
	Для Каждого Поле Из ПоляУсловийБлокировки Цикл
		ИмяКолонки = СтрЗаменить(Поле, ".", "_");
		СоответствиеПолейКолонкам.Вставить(Поле, ИмяКолонки);
		ИменаКолонокТаблицы.Добавить(ИмяКолонки);
		ТаблицаБлокируемыхПолей.Колонки.Добавить(ИмяКолонки, ТипЗначенияКолонки);
	КонецЦикла;
	
	БлокироватьВсеПоля = Ложь;
	Для Каждого Блокировка Из ДействующиеБлокировки Цикл
		
		Если Блокировка.БлокироватьВсеПоля Тогда
			ЗначениеДляВсех = 1;
			ЗначениеДляИсключений = 0;
			БлокироватьВсеПоля = Истина;
		Иначе
			ЗначениеДляВсех = 0;
			ЗначениеДляИсключений = 1;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаБлокируемыхПолей.Добавить();			
		Для Каждого Поле Из ПоляУсловийБлокировки Цикл
			ИмяКолонки = СоответствиеПолейКолонкам.Получить(Поле);
			Если Блокировка.ПоляИсключения.Найти(Поле) = Неопределено Тогда
				СтрокаТаблицы[ИмяКолонки] = ЗначениеДляВсех;
			Иначе
				СтрокаТаблицы[ИмяКолонки] = ЗначениеДляИсключений;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	//Поля, по которым значение > 0, блокируются.
	//Поля, по которым значение = 0, не блокируются.
	КолонкиТаблицы = СтрСоединить(ИменаКолонокТаблицы, ",");
	ТаблицаБлокируемыхПолей.Свернуть(, КолонкиТаблицы);
	СтрокаТаблицы = ТаблицаБлокируемыхПолей[0];
	
	ПоляИсключения = Новый Массив;
	Если БлокироватьВсеПоля Тогда
		Для Каждого Поле Из ПоляУсловийБлокировки Цикл
			ИмяКолонки = СоответствиеПолейКолонкам.Получить(Поле);
 			Значение = СтрокаТаблицы[ИмяКолонки];
			Если Значение = 0 Тогда
				ПоляИсключения.Добавить(Поле);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Поле Из ПоляУсловийБлокировки Цикл
			ИмяКолонки = СоответствиеПолейКолонкам.Получить(Поле);
			Значение = СтрокаТаблицы[ИмяКолонки];
			Если Значение > 0 Тогда
				ПоляИсключения.Добавить(Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураБлокировки.БлокироватьВсеПоля = БлокироватьВсеПоля;
	СтруктураБлокировки.ПоляИсключения = ПоляИсключения;
	
	Возврат СтруктураБлокировки;
	
КонецФункции

Функция ПолучитьОписаниеБлокировки() Экспорт
	
	Возврат "Документ зарегистрирован в обмене с внешней системой и заблокирован от изменения! Вы не сможете изменить этот документ!";
	
КонецФункции

//Евросиб Каблов 11.07.2020 TASK 23506
Функция ПолучитьДанныеОБлокировке(ДокументСсылка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Результат = Новый Структура("Заблокирован, ОписаниеБлокировки, ПричиныБлокировки", Ложь, "", Новый Массив);
	НаименованияПричинБлокировки = Новый Массив;	
	
	СписокТиповНеПроверяемыхОбъектов = Новый Массив; // SIV 20-09-24 (;,;)
	СписокТиповНеПроверяемыхОбъектов.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
	СписокТиповНеПроверяемыхОбъектов.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Если СписокТиповНеПроверяемыхОбъектов.Найти(ТипЗнч(ДокументСсылка)) <> неопределено Тогда Возврат Результат; КонецЕсли;
	ТипДокумента = ТипЗнч(ДокументСсылка);
	Если СписокТиповНеПроверяемыхОбъектов.Найти(ТипДокумента) <> неопределено Тогда Возврат Результат; КонецЕсли;
	//Евросиб Каблов 09.04.2025 )
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПометкаУдаления");
		Если ПометкаУдаления Тогда
			Возврат Результат;
		КонецЕсли;
		
		//Проверка доступности документа по периоду
		Если ТипДокумента <> Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			РеквизитыДокумента = ДокументСсылка.Метаданные().Реквизиты;
			Если РеквизитыДокумента.Найти("ПериодВО") <> Неопределено Тогда			
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Проведен, ПериодВО, Организация");
				Если ЗначенияРеквизитов.Проведен Тогда
					//Евросиб Каблов 09.04.2025 ( #105407
					//ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ЗначенияРеквизитов.ПериодВО, ЗначенияРеквизитов.Организация);
					Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
							Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
							Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
							Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
							Или ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
						ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодДоходов(ЗначенияРеквизитов.ПериодВО, ЗначенияРеквизитов.Организация);
					Иначе
						ДокументВЗакрытомПериоде = ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ЗначенияРеквизитов.ПериодВО, ЗначенияРеквизитов.Организация);
					КонецЕсли;
					//Евросиб Каблов 09.04.2025 )
					Если ДокументВЗакрытомПериоде Тогда
						Результат.ПричиныБлокировки.Добавить("ВЗакрытомПериоде");
						НаименованияПричинБлокировки.Добавить("в закрытом периоде");
					КонецЕсли;
 				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		//Проверка регистрации в обмене с внешней системой
//		Если Не РольДоступна("ПолныеПрава") Тогда
			СтатусДокумента = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеБлокировкиДокумента(ДокументСсылка);
			Если СтатусДокумента.Количество() > 0 Тогда
				Результат.ПричиныБлокировки.Добавить("ЗарегистрированВОбмене");
				НаименованияПричинБлокировки.Добавить("зарегистрирован в обмене с внешней системой");
			КонецЕсли;
//		КонецЕсли;

		//Признак "Выставлен"		
		РазрешенаЗаписьВыставленного = Ложь;
		Если Не ДополнительныеПараметры.Свойство("РазрешенаЗаписьВыставленного", РазрешенаЗаписьВыставленного) Тогда
			РазрешенаЗаписьВыставленного = Ложь;
		КонецЕсли;
		
		Если Не РазрешенаЗаписьВыставленного Тогда
		
			ТипДокумента = ТипЗнч(ДокументСсылка);
			Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
					Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
					Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
//Евросиб Гудкова( 05.11.2020 Ticket№ 0209113 Или ТипДокумента = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
					Или ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
					
				Выставлен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Выставлен");  
				
				//Евросиб Дубская 27.10.2022 ( Ticket#0287875	
				Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")   
					И Документы.РеализацияТоваровУслуг.ЕстьПривязанныеОплаты(ДокументСсылка) Тогда  
					
					Результат.ПричиныБлокировки.Добавить("ЕстьПривязанныеОплаты");
					НаименованияПричинБлокировки.Добавить("имеет привязанные оплаты"); 
					Результат.Вставить("ИзменитьСФ", Истина);
				КонецЕсли;
				//Евросиб Дубская 27.10.2022 )	
				
				Если Выставлен Тогда
					Результат.ПричиныБлокировки.Добавить("Выставлен");
					НаименованияПричинБлокировки.Добавить("выставлен клиенту");
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда
		НаименованияПричинБлокировки.Добавить("не в статусе «Подготовлен»");
	КонецЕсли;
	
	Если НаименованияПричинБлокировки.Количество() > 0 И НЕ ДополнительныеПараметры.Свойство("РазрешеноПроведениеВОбходБлокировок") Тогда
		Результат.Заблокирован = Истина;
		ПричиныБлокировкиТекст = СтрСоединить(НаименованияПричинБлокировки, ", ");
		Результат.ОписаниеБлокировки = СтрШаблон("Документ %1 и заблокирован от изменения! Вы не сможете изменить этот документ!", ПричиныБлокировкиТекст);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДоступностьРоли(ИмяРоли) Экспорт
	
	Результат = Ложь;
	Если РольДоступна(ИмяРоли) Или РольДоступна("ПолныеПрава") Тогда
		Результат = Истина;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ДатаДока, Организация) Экспорт
	
//Евросиб Гудкова( 30.10.2019 
//было
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
	//               |ИЗ
	//               |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних КАК ЗакрытыеПериодыСрезПоследних
	//               |ГДЕ
	//               |	ЗакрытыеПериодыСрезПоследних.Организация = &Организация";
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Ответ = Запрос.Выполнить().Выбрать();
	//Если Ответ.Следующий() Тогда
	//	Возврат (ДатаДока <= Ответ.Период);
	//КонецЕсли;
	//Возврат Ложь;
	
	
	
	Возврат ЗначениеЗаполнено(ДатаДока) И ДатаДока < ПолучитьОткрытыйПериод(Организация);
	
	// SIV 09-07-20 добавил ЗначениеЗаполнено, иначе новые документы сразу блокировались.
	
	
// Евросиб Гудкова) 	
	
КонецФункции

Процедура ЗащитаПериодаВыполненныхОбъемовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//Евросиб Каблов 21.09.2020 (
	Если Отказ Или Источник.ОбменДанными.Загрузка Или ПривилегированныйРежим() Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 21.09.2020 )
	
	ОпределяемаяДата = Источник.Дата;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") ИЛИ
	//	//Евросиб Каблов 21.09.2020 Убрал из этой подписки 
	//	//ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаПоступления") ИЛИ 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") или
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.Акцепт") Или
	//	///
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.СчетНаОплатуПокупателю") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомиссионераОПродажах") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.СчетНаОплатуПоставщика") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный") или
	//	
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаДолга") или 
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.АктСверкиВзаиморасчетов") или
	//	
	//	ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
	//	ОпределяемаяДата = Источник.ПериодВО;
	//КонецЕсли;
	//
	////Евросиб Каблов 03.12.2020 (
	////Если ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ОпределяемаяДата, Источник.Организация) и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//Если (РежимЗаписи = РежимЗаписиДокумента.Проведение Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
	//	И ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ОпределяемаяДата, Источник.Организация)  Тогда
	////Евросиб Каблов 03.12.2020 )
	//	Отказ = Истина;
	//	Сообщить("Документ находится в расчитанном периоде выполненных объемов. Проведение/отмена проведения недоступны.");
	//КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.СчетНаОплатуПокупателю") или		
				ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") или 
				ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") или
				ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомиссионераОПродажах") или
				ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
				
			ОпределяемаяДата = Источник.ПериодВО;
			ДатаПопадаетВЗакрытыйПериод = ДатаПопадаетВЗакрытыйПериодДоходов(ОпределяемаяДата, Источник.Организация);
			
		Иначе
			
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаПоступления") ИЛИ 
					ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") ИЛИ
					ТипЗнч(Источник) = Тип("ДокументОбъект.Акцепт") Или		 
					ТипЗнч(Источник) = Тип("ДокументОбъект.СчетНаОплатуПоставщика") или		
					ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") или 
					ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") или 
					ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаДолга") или 
					ТипЗнч(Источник) = Тип("ДокументОбъект.АктСверкиВзаиморасчетов") или		
					ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
					
				ОпределяемаяДата = Источник.ПериодВО;
			КонецЕсли;
			
			ДатаПопадаетВЗакрытыйПериод = ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(ОпределяемаяДата, Источник.Организация);
			
		КонецЕсли;
	
	    Если ДатаПопадаетВЗакрытыйПериод Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Документ находится в расчитанном периоде выполненных объемов. Проведение/отмена проведения недоступны.");
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 09.04.2025 )
	
КонецПроцедуры

Функция ПолучитьОткрытыйПериод(Организация) Экспорт
//Евросиб Гудкова( 29.10.2019 
	ДатаОткрытогоПериода = ДобавитьМесяц(НачалоМесяца(ТекущаяДатаСеанса()), -1);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДОБАВИТЬКДАТЕ(ЗакрытыеПериодыСрезПоследних.Период, МЕСЯЦ, 1) КАК ДатаОткрытогоПериода
	                      |ИЗ
	                      |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних");
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаОткрытогоПериода = Выборка.ДатаОткрытогоПериода;
	КонецЕсли;
	Возврат ДатаОткрытогоПериода;
//было	
	//ПериодБлокировки = КонецМесяца(ТекущаяДата()-30*24*3600);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
	//               |ИЗ
	//               |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних КАК ЗакрытыеПериодыСрезПоследних";
	//Ответ = Запрос.Выполнить().Выбрать();
	//Если Ответ.Следующий() Тогда
	//	ПериодБлокировки = КонецМесяца(Ответ.Период + 24*3600*15);
	//КонецЕсли;
// Евросиб Гудкова) 	

	//ВОзврат ПериодБлокировки;
	
КонецФункции

//Евросиб Каблов 09.04.2025 #105407
Функция ПолучитьОткрытыйПериодДоходов(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ЗакрытыеПериодыДоходовСрезПоследних.Период, МЕСЯЦ, 1) КАК ДатаОткрытогоПериода
	|ИЗ
	|	РегистрСведений.ЗакрытыеПериодыДоходов.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыДоходовСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаОткрытогоПериода = Выборка.ДатаОткрытогоПериода;
	Иначе
		ДатаОткрытогоПериода = '00010101';
	КонецЕсли;
	
	Возврат ДатаОткрытогоПериода;
	
КонецФункции

//Евросиб Каблов 09.04.2025 #105407
Функция ДатаПопадаетВЗакрытыйПериодДоходов(ДатаДокумента, Организация) Экспорт
	
	Возврат ЗначениеЗаполнено(ДатаДокумента) И ДатаДокумента < ПолучитьОткрытыйПериодДоходов(Организация);
	
КонецФункции

//Евросиб Каблов 09.04.2025 ( #105407
//Функция ПолучитьОткрытыйПериодБУ() Экспорт
Функция ПолучитьОткрытыйПериодБУ(Знач Организация = Неопределено) Экспорт
//Евросиб Каблов 09.04.2025 )

	//Евросиб Каблов 09.04.2025 ( #105407
	//Возврат Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ОсновнаяОрганизация");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ЗакрытыеПериодыБУСрезПоследних.Период, МЕСЯЦ, 1) КАК ДатаОткрытогоПериода
	|ИЗ
	|	РегистрСведений.ЗакрытыеПериодыБУ.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыБУСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаОткрытогоПериода = Выборка.ДатаОткрытогоПериода;
	Иначе
		ДатаОткрытогоПериода = '00010101';
	КонецЕсли;
	
	Возврат ДатаОткрытогоПериода;
	//Евросиб Каблов 09.04.2025 )
	
КонецФункции

//Евросиб Гудкова( 11.11.2019 Ticket№0180052 
Функция ПолучитьТекущиеПараметрыНДС0(Договор, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.Период КАК ДатаНачалаДействия,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.ДокументыНеПредоставляются КАК ДокументыНеПредоставляются,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.СрокПредоставленияДокументов КАК СрокПредоставленияДокументов,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.ШтрафныеСанкции КАК ШтрафныеСанкции,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.ПунктДоговора КАК ПунктДоговора,
	               |	ПараметрыПримененияСтавкиНДС0СрезПоследних.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ПараметрыПримененияСтавкиНДС0.СрезПоследних(
	               |			&ТекДата,
	               |			ВЫБОР
	               |					КОГДА ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ КОНЕЦПЕРИОДА(ДатаОкончанияДействия, ДЕНЬ) >= &ТекДата
	               |				КОНЕЦ
	               |				И ДоговорКонтрагента = &ТекДоговор) КАК ПараметрыПримененияСтавкиНДС0СрезПоследних";
	Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("ТекДоговор", Договор);
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции // ()

//Евросиб Гудкова( 08.01.2020 
Процедура ПередЗаписьюРегистраСведенийПроверкаДоступностиПериода(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Или Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
//регистр ДокументыПодтвержденныеВОтчетеФНС
	Если Источник.Метаданные().Имя = "ДокументыПодтвержденныеВОтчетеФНС" И Источник.Период <= Константы.ДатаПоследнегоСданногоОтчетаНДС0ВФНС.Получить() Тогда
		ОбщегоНазначения.СообщитьПользователю("Редактирование данных этого периода отчета ФНС запрещено. Изменения не могут быть записаны...",,,, Отказ);
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюРегистраСведенийПроверкаДоступностиПериода

// Евросиб Гудкова) 

Процедура УдалитьЗаписиПротоколовОбменов(СписокДоков) Экспорт
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколОбменов.ДействиеПриОбмене КАК ДействиеПриОбмене,
	               |	ПротоколОбменов.УзелОбмена КАК УзелОбмена,
	               |	ПротоколОбменов.Объект КАК Объект,
	               |	ПротоколОбменов.НУИНУ КАК НУИНУ,
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	               |	ПротоколОбменов.Ответственный КАК Ответственный,
	               |	ПротоколОбменов.ДатаОбмена КАК ДатаОбмена,
	               |	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВБУ
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |ГДЕ
	               |	ПротоколОбменов.Объект В(&Объект)";
	Запрос.УстановитьПараметр("Объект", СписокДоков);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока ОТвет.Следующий() Цикл
		МЗ =РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		МЗ.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИзмененияРеквизитовОбъекта(Объект, Отказ, ПроверятьВсе = Ложь, Исключения = Неопределено, ИзмененныеРеквизиты = Неопределено) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Исключения = Неопределено Тогда
		Если Не ПроверятьВсе Тогда
			Возврат;
		КонецЕсли;
		Исключения = Новый Массив;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ИсключенияСтандартныхРеквизитов = Новый Массив;
	ИсключенияСтандартныхРеквизитов.Добавить("Ссылка");
	ИсключенияСтандартныхРеквизитов.Добавить("Проведен");
	ИсключенияСтандартныхРеквизитов.Добавить("ПометкаУдаления");
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеТабличныеЧасти = Новый Массив;
	ПроверяемыеРеквизитыТЧ = Новый Структура;
	ТипХранилищеЗначения = Тип("ХранилищеЗначения");
	Если ПроверятьВсе Тогда
		Исключения.Добавить("ТекущееСостояние");
		Исключения.Добавить("Состояния");
		Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
			Если Исключения.Найти(Реквизит.Имя) = Неопределено И Не Реквизит.Тип.СодержитТип(ТипХранилищеЗначения) Тогда
				ПроверяемыеРеквизиты.Добавить(Реквизит);
			КонецЕсли;			
		КонецЦикла;
		Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Если Исключения.Найти(Реквизит.Имя) = Неопределено
					И ИсключенияСтандартныхРеквизитов.Найти(Реквизит.Имя) = Неопределено Тогда
				ПроверяемыеРеквизиты.Добавить(Реквизит);
			КонецЕсли;			
		КонецЦикла;
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			Если Исключения.Найти(ТабличнаяЧасть.Имя) = Неопределено Тогда
				ПроверяемыеТабличныеЧасти.Добавить(ТабличнаяЧасть);
				//Реквизиты табличной части
				ПроверяемыеРеквизитыТЧ.Вставить(ТабличнаяЧасть.Имя, Новый Массив);
				Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
					Если Не РеквизитТЧ.Тип.СодержитТип(ТипХранилищеЗначения) Тогда
						ПолноеИмяРеквизита = ТабличнаяЧасть.Имя + "." + РеквизитТЧ.Имя;
						Если Исключения.Найти(ПолноеИмяРеквизита) = Неопределено Тогда
							ПроверяемыеРеквизитыТЧ[ТабличнаяЧасть.Имя].Добавить(РеквизитТЧ);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ИмяРеквизита Из Исключения Цикл
			
			Реквизит = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
			Если Реквизит <> Неопределено Тогда
				ПроверяемыеРеквизиты.Добавить(Реквизит);
			Иначе				
				Для Каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
					Если СтандартныйРеквизит.Имя = ИмяРеквизита Тогда
						Реквизит = СтандартныйРеквизит;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
				Если Реквизит <> Неопределено Тогда
					ПроверяемыеРеквизиты.Добавить(Реквизит);
				Иначе
					ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяРеквизита);					
					Если ТабличнаяЧасть <> Неопределено Тогда
						ПроверяемыеТабличныеЧасти.Добавить(ТабличнаяЧасть);
						//Реквизиты табличной части
						ПроверяемыеРеквизитыТЧ.Вставить(ТабличнаяЧасть.Имя, Новый Массив);
						Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
							Если Не РеквизитТЧ.Тип.СодержитТип(ТипХранилищеЗначения) Тогда
								ПолноеИмяРеквизита = ТабличнаяЧасть.Имя + "." + РеквизитТЧ.Имя;
								ПроверяемыеРеквизитыТЧ[ТабличнаяЧасть.Имя].Добавить(РеквизитТЧ);
							КонецЕсли;
						КонецЦикла;
					Иначе					
						//Реквизит табличной части
						Если СтрНайти(ИмяРеквизита, ".") > 0 Тогда
							Строки = СтрРазделить(ИмяРеквизита, ".");
							Если Строки.Количество() = 2 Тогда
								ИмяТЧ = Строки[0];
								ИмяРеквизитаТЧ = Строки[1];
								ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТЧ);
								Если ТабличнаяЧасть <> Неопределено Тогда
									РеквизитТЧ = ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизитаТЧ);
									Если РеквизитТЧ <> Неопределено И Не РеквизитТЧ.Тип.СодержитТип(ТипХранилищеЗначения) Тогда 
										Если Не ПроверяемыеРеквизитыТЧ.Свойство(ИмяТЧ) Тогда
											ПроверяемыеТабличныеЧасти.Добавить(ТабличнаяЧасть);
											ПроверяемыеРеквизитыТЧ.Вставить(ИмяТЧ, Новый Массив);
										КонецЕсли;
										ПроверяемыеРеквизитыТЧ[ИмяТЧ].Добавить(РеквизитТЧ);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Количество() = 0 И ПроверяемыеТабличныеЧасти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыПакетаЗапросов = Новый Массив;
	ШаблонПоляЗапроса = "	Таблица.%1 КАК %1";
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	%2	
	|ИЗ
	|	%1 КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Если ПроверяемыеРеквизиты.Количество() > 0 Тогда
		
		ТекстыПолейЗапроса = Новый Массив;		
		Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл			
			ТекстПоляЗапроса = СтрШаблон(ШаблонПоляЗапроса, Реквизит.Имя);
			ТекстыПолейЗапроса.Добавить(ТекстПоляЗапроса);
		КонецЦикла;
		ТекстПолейЗапроса = СтрСоединить(ТекстыПолейЗапроса, "," + Символы.ПС);
		
		ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, ПолноеИмяОбъекта, ТекстПолейЗапроса);
		ТекстыПакетаЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из ПроверяемыеТабличныеЧасти Цикл
		
		РеквизитыТЧ = ПроверяемыеРеквизитыТЧ[ТабличнаяЧасть.Имя];
		ТекстыПолейЗапроса = Новый Массив;		
		Для Каждого Реквизит Из РеквизитыТЧ Цикл
			ТекстПоляЗапроса = СтрШаблон(ШаблонПоляЗапроса, Реквизит.Имя);
			ТекстыПолейЗапроса.Добавить(ТекстПоляЗапроса);			
		КонецЦикла;
		ТекстПолейЗапроса = СтрСоединить(ТекстыПолейЗапроса, "," + Символы.ПС);
		
		ТаблицаЗапроса = ПолноеИмяОбъекта + "." + ТабличнаяЧасть.Имя;
		ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, ТаблицаЗапроса, ТекстПолейЗапроса);
		ТекстыПакетаЗапросов.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	ТекстПакетаЗапросов = СтрСоединить(ТекстыПакетаЗапросов, Символы.ПС + ";" + Символы.ПС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстПакетаЗапросов;	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексТаблицы = 0;
	Если ПроверяемыеРеквизиты.Количество() > 0 Тогда
		
		Выборка = РезультатыЗапроса[ИндексТаблицы].Выбрать();
		Если Выборка.Следующий() Тогда
			ИзмененныеРеквизиты = Новый Массив;
			Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
				Если Выборка[Реквизит.Имя] <> Объект[Реквизит.Имя] Тогда
					Отказ = Истина;
					Если ЗначениеЗаполнено(Реквизит.Синоним) Тогда
						СинонимРеквизита = Реквизит.Синоним;
					Иначе
						СинонимРеквизита = Реквизит.Имя;
					КонецЕсли;
					ИзмененныеРеквизиты.Добавить(СинонимРеквизита);			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИндексТаблицы = ИндексТаблицы + 1;
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из ПроверяемыеТабличныеЧасти Цикл
		
		ТаблицаЗаписанныхДанных = РезультатыЗапроса[ИндексТаблицы].Выгрузить();
		
		РеквизитыТЧ = ПроверяемыеРеквизитыТЧ[ТабличнаяЧасть.Имя];
		ИменаРеквизитов = Новый Массив;
		Для Каждого РеквизитТЧ Из РеквизитыТЧ Цикл
			ИменаРеквизитов.Добавить(РеквизитТЧ.Имя);
		КонецЦикла;
		СтрокаРеквизитовТЧ = СтрСоединить(ИменаРеквизитов, ",");
		ТаблицаДанныхОбъекта = Объект[ТабличнаяЧасть.Имя].Выгрузить(, СтрокаРеквизитовТЧ);
		
		ТаблицыИдентичны = ОбщегоНазначения.КоллекцииИдентичны(ТаблицаЗаписанныхДанных, ТаблицаДанныхОбъекта);
		Если Не ТаблицыИдентичны Тогда
			Отказ = Истина;
			ИзмененныеРеквизиты.Добавить(ТабличнаяЧасть.Синоним);
		КонецЕсли;
		
		ИндексТаблицы = ИндексТаблицы + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьБлокировкуЭлементовФормы(Ссылка, Элементы, Объект = Неопределено) Экспорт
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	//Если ЗначениеЗаполнено(Ссылка) Тогда
	//Евросиб Каблов 07.07.2021 )
	
		//Евросиб Каблов 22.01.2021 ( Ticket#0217261
		//СтруктураБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьБлокируемыеПоля(Ссылка);
		СтруктураБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьБлокируемыеПоля(Ссылка,, Истина, Объект);
		//Евросиб Каблов 22.01.2021 )
		
		//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
		////Евросиб Каблов 29.06.2021 (
		////Элементы.ПредупреждениеРедактирования.Видимость = СтруктураБлокировки.Заблокирован;
		////Элементы.ПредупреждениеРедактирования.Заголовок = СтруктураБлокировки.ОписаниеБлокировки;
		//Если Элементы.Найти("ПредупреждениеРедактирования") <> Неопределено Тогда
		//	Элементы.ПредупреждениеРедактирования.Видимость = СтруктураБлокировки.Заблокирован;
		//	Элементы.ПредупреждениеРедактирования.Заголовок = СтруктураБлокировки.ОписаниеБлокировки;
		//КонецЕсли;
		////Евросиб Каблов 29.06.2021 )
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Если Элементы.Найти("ПредупреждениеРедактирования") <> Неопределено Тогда     
				//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, ++
				ВидимостьПредупреждениеРедактирования = СтруктураБлокировки.Заблокирован ИЛИ НЕ ПустаяСтрока(СокрЛП(СтруктураБлокировки.ОписаниеБлокировки)); 
				//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, --
				Элементы.ПредупреждениеРедактирования.Видимость = ВидимостьПредупреждениеРедактирования;
				Элементы.ПредупреждениеРедактирования.Заголовок = СтруктураБлокировки.ОписаниеБлокировки;
			КонецЕсли;
			//Евросиб - АСуслов 06.01.2023 10:10:41 #63243
			//(
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Акцепт") Тогда
			ВидимостьПредупреждениеРедактирования = НЕ ПустаяСтрока(СокрЛП(СтруктураБлокировки.ОписаниеБлокировки)); 
			Элементы.ПредупреждениеРедактирования.Видимость = ВидимостьПредупреждениеРедактирования;
			Элементы.ПредупреждениеРедактирования.Заголовок = СтруктураБлокировки.ОписаниеБлокировки;
			//)
			//Евросиб - АСуслов 06.01.2023 10:10:59 #63243
		Иначе
			Если Элементы.Найти("ПредупреждениеРедактирования") <> Неопределено Тогда
				Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 07.07.2021 )
				
		Блокировать = СтруктураБлокировки.БлокироватьВсеПоля;
		
		Если Блокировать Тогда
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаПеречитать");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаСкопировать"); 
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаПоказатьВСписке");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаИсторияИзменений");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаИзменитьФорму");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаСправка");
			СтруктураБлокировки.ПоляИсключения.Добавить("СтруктураПодчиненности");
			//Евросиб Каблов 29.10.2024 ( #67092
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаЖурналДокументовВзаимодействия");
			СтруктураБлокировки.ПоляИсключения.Добавить("ОткрытьОкноСИнструкциями");
			//Евросиб Каблов 29.10.2024 )
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаОбщаяКомандаНапомнить");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаОбщаяКомандаСоздатьЗаметкуПоПредмету");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаЗаменитьИсполнителя");
			//Евросиб Каблов 12.04.2021 ( Ticket#0229073
			СтруктураБлокировки.ПоляИсключения.Добавить("ПодменюОтчетыСмТакже_Авто");
			СтруктураБлокировки.ПоляИсключения.Добавить("ПодменюПечать");
			//Евросиб Каблов 12.04.2021 ) 
			//СтруктураБлокировки.ПоляИсключения.Добавить("ПодписанСДвухСторон"); //Евросиб Каблов 05.03.2021 Ticket#0219054
			
			// SIV 19-02-21 Блин! Добавил в исключения для РТУ в ПолучитьБлокируемыеПоля, а оно там как-то переназначается и все равно блокирует.
			// Слишком сложно, чтобы разобраться )))
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокАннулироватьДокумент");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокАннулироватьВознаграждение");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОткрытьКорректировку");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокОтменитьРазрешение");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьИсправление");
			СтруктураБлокировки.ПоляИсключения.Добавить("ФормаРегистрСведенийРазрешениеВводаКорректировокРазрешитьКорректировку");
			СтруктураБлокировки.ПоляИсключения.Добавить("ГруппаКорректировкиДокумента");
			СтруктураБлокировки.ПоляИсключения.Добавить("КорректировкиДокумента");
			СтруктураБлокировки.ПоляИсключения.Добавить("КалькуляцииОткрытьКалькуляцию");
			СтруктураБлокировки.ПоляИсключения.Добавить("ЗаполнятьПоПервойСтроке");
			
		КонецЕсли;
		
 		Для Каждого Элемент Из Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
				Если Не Элемент.ТолькоПросмотр Тогда
					ИмяРеквизита = СтрЗаменить(Элемент.ПутьКДанным, "Объект.", "");
					ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти(ИмяРеквизита);
					Если ИндексЗначения = Неопределено Тогда
						Элемент.ТолькоПросмотр = Блокировать;
						//Когда поле принадлежит таблице, которая в исключениях 
						НомерТочки = СтрНайти(ИмяРеквизита, ".");
						Если НомерТочки > 0 Тогда						
							ИмяТаблицы = Лев(ИмяРеквизита, НомерТочки - 1);
							ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти(ИмяТаблицы);
							Если ИндексЗначения = Неопределено Тогда
								Элемент.ТолькоПросмотр = Блокировать;
							Иначе
								Элемент.ТолькоПросмотр = Не Блокировать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли; 
					//Субботин 75703 09.10.2023 начало// вторая проверка добавлена для возможности
					//блокировки элементов формы отдельно от реквизита
					Если ИндексЗначения = Неопределено Тогда						
						ИмяРеквизита = Элемент.Имя;
						ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти(ИмяРеквизита);
						Если ИндексЗначения = Неопределено Тогда
							Элемент.ТолькоПросмотр = Блокировать;
							//Когда поле принадлежит таблице, которая в исключениях 
							НомерТочки = СтрНайти(ИмяРеквизита, ".");
							Если НомерТочки > 0 Тогда						
								ИмяТаблицы = Лев(ИмяРеквизита, НомерТочки - 1);
								ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти(ИмяТаблицы);
								Если ИндексЗначения = Неопределено Тогда
									Элемент.ТолькоПросмотр = Блокировать;
								Иначе
									Элемент.ТолькоПросмотр = Не Блокировать;
								КонецЕсли;
							КонецЕсли;
						Иначе 
							Элемент.ТолькоПросмотр = Не Блокировать;
						КонецЕсли;
					Иначе 
						Элемент.ТолькоПросмотр = Не Блокировать;
					КонецЕсли;
					//Субботин 75703 09.10.2023 Конец 
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
				Если Не Элемент.ТолькоПросмотр Тогда
					ИмяРеквизита = СтрЗаменить(Элемент.ПутьКДанным, "Объект.", "");
					ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти(ИмяРеквизита);
					Если ИндексЗначения = Неопределено Тогда
						//Если разрешено редактировать поле табличной части, то блокировать всю таблицу нельзя
						УстановитьЗначениеТолькоПросмотр = Истина;
						Если Блокировать Тогда
							Для Каждого ИмяПоляИсключения Из СтруктураБлокировки.ПоляИсключения Цикл
								Если СтрНайти(ИмяПоляИсключения, ".") > 0 Тогда
									Строки = СтрРазделить(ИмяПоляИсключения, ".");
									Если Строки.Количество() = 2 Тогда
										ИмяТЧ = Строки[0];
										Если ИмяТЧ = ИмяРеквизита Тогда
											УстановитьЗначениеТолькоПросмотр = Ложь;
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если УстановитьЗначениеТолькоПросмотр Тогда
							Элемент.ТолькоПросмотр = Блокировать;
						КонецЕсли;
					Иначе
						Элемент.ТолькоПросмотр = Не Блокировать;
					КонецЕсли; 
				КонецЕсли;
			ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
				Если Элемент.Доступность Тогда
					ИмяЭлемента = Элемент.Имя;
					Если ИмяЭлемента = "ОбновитьДатыДокумента" 
						ИЛИ ИмяЭлемента = "ОбновитьОткрытыйПериод" Тогда
						ИндексЗначения = СтруктураБлокировки.ПоляИсключения.Найти("ПериодВО");
						Если ИндексЗначения = Неопределено Тогда
							Элемент.Доступность = Не Блокировать;
						Иначе
							Элемент.Доступность = Блокировать;
						Конецесли;						
					Иначе
						НайденВИсключениях = Ложь;
						Для Каждого ПолеИсключение Из СтруктураБлокировки.ПоляИсключения Цикл
							ДлинаИмени = СтрДлина(ПолеИсключение);
							Если Лев(ИмяЭлемента, ДлинаИмени) = ПолеИсключение Тогда
								НайденВИсключениях = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если НайденВИсключениях Тогда
							Элемент.Доступность = Блокировать;
						Иначе
							Элемент.Доступность = Не Блокировать;
						Конецесли; 
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы") 
				И НЕ Блокировать Тогда
				НайденВИсключениях = Ложь;
				Для Каждого ПолеИсключение Из СтруктураБлокировки.ПоляИсключения Цикл
					Если Элемент.Имя = ПолеИсключение Тогда
						НайденВИсключениях = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если НайденВИсключениях Тогда
					Элемент.Доступность = Блокировать;
				Конецесли;
			КонецЕсли;
		КонецЦикла; 
		
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер. Разместил этот код выше.	
	//Иначе
	//	//Евросиб Каблов 07.07.2021 (
	//	//Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
	//	Если Элементы.Найти("ПредупреждениеРедактирования") <> Неопределено Тогда
	//		Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
	//	КонецЕсли;
	//	//Евросиб Каблов 07.07.2021 )
	//КонецЕсли;
	//Евросиб Каблов 07.07.2021 )
	
КонецПроцедуры

Функция ПроверкаДоступностиПоПериоду(Ссылка) Экспорт
	Если Не Ссылка.Проведен Тогда
		Возврат Ложь;
	КонецЕсли; 
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Ссылка.ПериодВО, Ссылка.Организация);
КонецФункции

//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, ++
Функция ПолучитьДоступностьЭлементовПоВидуКорректировкиРеализации(Ссылка)    
	РезультатСтруктура = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ТаблицаДокументовОснования
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияКорректировокРеализацийСрезПоследних.Регистратор КАК Регистратор,
		|	ИсторияКорректировокРеализацийСрезПоследних.ВидОперации КАК ВидОперации
		|ИЗ
		|	РегистрСведений.ИсторияКорректировокРеализаций.СрезПоследних(
		|			,
		|			КорректируемыйДокумент В
		|				(ВЫБРАТЬ
		|					ТаблицаДокументовОснования.ДокументОснование
		|				ИЗ
		|					ТаблицаДокументовОснования КАК ТаблицаДокументовОснования)) КАК ИсторияКорректировокРеализацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ФлагВыполнитьБлокировкуРеквизитов = Ложь;  
	СтрокаОписанияПричины = "";            
	СтрокаИнформированияОПеречнеГТДиИСФ = "";
	Если Ссылка.СуммаНДСДокумента = 0 Тогда
		СтрокаИнформированияОПеречнеГТДиИСФ = " Внесение изменений в перечень ГТД и ИСФ заблокировано!";
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			ФлагВыполнитьБлокировкуРеквизитов = Истина;                                                                            
			СтрокаОписанияПричины = "Внесены исправления в первичный документ. "+ВыборкаДетальныеЗаписи.Регистратор+"."+СтрокаИнформированияОПеречнеГТДиИСФ;
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
			ФлагВыполнитьБлокировкуРеквизитов = Истина;  
			СтрокаОписанияПричины = "Документ аннулирован. "+ВыборкаДетальныеЗаписи.Регистратор+"."+СтрокаИнформированияОПеречнеГТДиИСФ;
		КонецЕсли;
	КонецЦикла;                              
	РезультатСтруктура.Вставить("ВыполнитьБлокировкуРеквизитов", ФлагВыполнитьБлокировкуРеквизитов);
	РезультатСтруктура.Вставить("ОписаниеПричиныБлокировкиРеквизитов", СтрокаОписанияПричины);	
	Возврат РезультатСтруктура;	
КонецФункции 
//ДИТ, Беляев СЮ, ТА44280, 27-12-2021, --

// Евросиб Фролов (24.03.2022 US №40767
// Task №48648

Функция ПолучитьСписокРодительскихОбъектов(ТекущийОбъект) Экспорт

	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
			
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			Если МетаданныеРеквизита = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
				
			ЗначениеРеквизита = ТекущийОбъект[Реквизит.Имя];
			Если ЗначениеЗаполнено(ЗначениеРеквизита)
				И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
				И ЗначениеРеквизита <> ТекущийОбъект
				И СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
				
				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеРеквизита);
				
				Если ЯвляетсяДокументом Тогда
					СписокРеквизитов.Добавить(ЗначениеРеквизита,
						Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина), "ДЛФ=DT"));
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

	Для Каждого ТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		ИменаРеквизитов = "";
		СодержимоеТЧ = ТекущийОбъект[ТЧ.Имя].Выгрузить();
		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл

			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
				Продолжить;
			КонецЕсли;
				
			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
				
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				Если МетаданныеРеквизита = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				ИменаРеквизитов = ИменаРеквизитов + ?(ИменаРеквизитов = "", "", ", ") + Реквизит.Имя;
				Прервать;
					
			КонецЦикла;
			
		КонецЦикла;

		СодержимоеТЧ.Свернуть(ИменаРеквизитов);
		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл

			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл

				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				Если ЗначениеРеквизита = ТекущийОбъект
					Или СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеЗначения);
				Если Не ЯвляетсяДокументом Тогда
					Продолжить;
				КонецЕсли;
				
				СписокРеквизитов.Добавить(ЗначениеРеквизита,
						Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина), "ДЛФ=DT"));
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокРеквизитов;
	
КонецФункции	

Функция ПолучитьВыборкуПодчиненныхДокументов(Ссылка) Экспорт	
	Таблица = ОбъектыПоКритериюОтбора(Ссылка);
	Если Таблица = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	КэшПоТипамОбъектов   = Новый Соответствие;
	КэшРеквизитовОбъекта = Новый Соответствие;

	Для Каждого СтрокаТаблицы Из Таблица Цикл
				
		МетаданныеОбъекта = СтрокаТаблицы.Ссылка.Метаданные();
		
		ЯвляетсяДокументом = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
		Если Не ЯвляетсяДокументом Тогда
			Продолжить;
		КонецЕсли;	

		ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ДополнитьКэшМетаданных(МетаданныеОбъекта, ПолноеИмяОбъекта, КэшРеквизитовОбъекта);

		МассивСсылок = КэшПоТипамОбъектов[ПолноеИмяОбъекта];
		Если МассивСсылок = Неопределено Тогда

			МассивСсылок = Новый Массив;
			КэшПоТипамОбъектов.Вставить(ПолноеИмяОбъекта, МассивСсылок);

		КонецЕсли;

		МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);

	КонецЦикла;
	
	Если КэшПоТипамОбъектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеОбъекты УПОРЯДОЧИТЬ ПО ПодчиненныеОбъекты.Дата";

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из КэшПоТипамОбъектов Цикл
		
		МассивИмениОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючИЗначение.Ключ, ".");
		Если МассивИмениОбъекта.Количество() = 2 Тогда
			ИмяОбъекта = МассивИмениОбъекта[1];
		Иначе
			Продолжить;
		КонецЕсли;

		ТекстПоТипуОбъекта = "
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Дата"] + "           КАК Дата,
		|	Ссылка,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Проведен"] + "       КАК Проведен,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["СуммаДокумента"] + " КАК СуммаДокумента,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Валюта"] + "         КАК Валюта,
		|	Представление КАК Представление
		|ИЗ
		|	" + КлючИЗначение.Ключ + "
		|ГДЕ
		|	Ссылка В (&" + ИмяОбъекта + ")
		|	И " + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Проведен"];
		
		// Евросиб Фролов (06.05.2022 Task №51110
		// Исключим из проверки корректировки реализаций с видом операции "Аннулирование",
		// а также авансовые счета
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Сделка") Тогда
			Если ИмяОбъекта = "КорректировкаРеализации" Тогда
				ТекстПоТипуОбъекта = ТекстПоТипуОбъекта + "
							|	И ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)";
			ИначеЕсли ИмяОбъекта = "СчетНаОплатуПокупателю" Тогда
				ТекстПоТипуОбъекта = ТекстПоТипуОбъекта + "
							|	И АвансовыйСчет = ИСТИНА";
				
			КонецЕсли;	
		КонецЕсли;
		// Евросиб Фролов)
		
		Запрос.УстановитьПараметр(ИмяОбъекта, КлючИЗначение.Значение);
				
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", " ВЫБРАТЬ ", " ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ") + ТекстПоТипуОбъекта;

	КонецЦикла;

	Запрос.Текст = ТекстЗапросаНачало + ТекстЗапроса + ТекстЗапросаКонец;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;

КонецФункции

Функция ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)
	
	Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы
	|ГДЕ
	|	ИСТИНА";
	
	Если ТипЗнч(ЗначениеКритерияОтбора) = Тип("ДокументСсылка.Сделка") Тогда
		// Для сделки нужны только актуальные акцепты (добавим ниже).
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "НЕ СвязанныеДокументы.Ссылка ССЫЛКА Документ.Акцепт");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	МассивАктуальныхАкцептов = Новый Массив;
	Если ТипЗнч(ЗначениеКритерияОтбора) = Тип("ДокументСсылка.Сделка") Тогда
		
		// Для сделки дополним таблицу акутальными акцептами.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АкцептУслуги.Ссылка.Поступление КАК Поступление
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
		|	И АкцептУслуги.Ссылка.Проведен
		|	И АкцептУслуги.Сделка = &Сделка
		|	И НЕ АкцептУслуги.Ссылка В
		|				(ВЫБРАТЬ
		|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
		|				ИЗ
		|					Документ.Акцепт КАК Акцепт
		|				ГДЕ
		|					Акцепт.Проведен)";
		
		Запрос.УстановитьПараметр("Сделка", ЗначениеКритерияОтбора);
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			АктуальныйАкцепт = Документы.Акцепт.ПолучитьАктуальныйАкцепт(Выборка.Поступление);
		    МассивАктуальныхАкцептов.Добавить(АктуальныйАкцепт);
		КонецЦикла;
		
		// Из всех актуальных акцептов получим только те, которые связаны со сделкой.
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АкцептУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка В(&МассивАкцептов)
		|	И АкцептУслуги.Сделка = &Сделка
		|
		|УПОРЯДОЧИТЬ ПО
		|	АкцептУслуги.Ссылка.Дата";
		
		ЗапросСвязанныхАкцептов = Новый Запрос;
		ЗапросСвязанныхАкцептов.Текст = ТекстЗапроса;
		ЗапросСвязанныхАкцептов.УстановитьПараметр("МассивАкцептов", МассивАктуальныхАкцептов);
		ЗапросСвязанныхАкцептов.УстановитьПараметр("Сделка", ЗначениеКритерияОтбора);
		
		ВыборкаСвязанныеАкцепты = ЗапросСвязанныхАкцептов.Выполнить().Выбрать();
		Пока ВыборкаСвязанныеАкцепты.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаДокументов.Добавить(), ВыборкаСвязанныеАкцепты);
		КонецЦикла;	
		
	КонецЕсли;
		
	Возврат ТаблицаДокументов;
	
КонецФункции

Процедура ДополнитьКэшМетаданных(МетаданныеОбъекта, ИмяОбъекта, КэшРеквизитовОбъекта)

	РеквизитыДокумента = КэшРеквизитовОбъекта[ИмяОбъекта];
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;
			
		Если МетаданныеОбъекта.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			РеквизитыДокумента.Вставить("СуммаДокумента", "СуммаДокумента");
		ИначеЕсли МетаданныеОбъекта.Реквизиты.Найти("СуммаАкцепта") <> Неопределено Тогда
			РеквизитыДокумента.Вставить("СуммаДокумента", "СуммаАкцепта");
		Иначе
			РеквизитыДокумента.Вставить("СуммаДокумента", "NULL");
		КонецЕсли;
						
		Если МетаданныеОбъекта.Реквизиты.Найти("Валюта") <> Неопределено Тогда
			РеквизитыДокумента.Вставить("Валюта", "Валюта");
		Иначе
			РеквизитыДокумента.Вставить("Валюта", "NULL");
		КонецЕсли;
		
		РеквизитыДокумента.Вставить("Проведен", "Проведен");
		РеквизитыДокумента.Вставить("Дата", "Дата");

		КэшРеквизитовОбъекта.Вставить(ИмяОбъекта, РеквизитыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Фролов)

//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
Процедура ОбработатьБлокировкуЭлементовФормыСписка(Элементы) Экспорт
	Если РольДоступна("ПолныеПрава") Тогда	
		Возврат;
	КонецЕсли;
	МассивБлокируемыхЭлементов = Новый Массив;
	МассивБлокируемыхЭлементов.Добавить("ФормаДокументКорректировкаРеализацииСоздатьНаОсновании"); 
	МассивБлокируемыхЭлементов.Добавить("СписокКонтекстноеМенюДокументКорректировкаРеализацииСоздатьНаОсновании"); 
	МассивБлокируемыхЭлементов.Добавить("ФормаДокументРеализацияТоваровУслугСоздатьНаОсновании"); 
	МассивБлокируемыхЭлементов.Добавить("СписокКонтекстноеМенюДокументРеализацияТоваровУслугСоздатьНаОсновании"); 
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда 
			Если МассивБлокируемыхЭлементов.Найти(Элемент.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Элемент.Доступность Тогда
				Элемент.Доступность = Ложь; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры  
//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец 

//80515 Субботин 16.02.2024 Начало 
&НаСервере
Функция РольДоступнаВызовСервера(Роль) Экспорт 
	
	Возврат Пользователи.РолиДоступны(Роль); 
	
КонецФункции
//80515 Субботин 16.02.2024 Конец 

//80515 Субботин 16.02.2024 Начало 
&НаСервере
Функция ПроверитьВозможностьРаботыСДокументомВызовСервера(Документ) Экспорт
	
	ПроверкаПройдена = Ложь;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Если Документы.СчетФактураВыданный.ПроверитьВозможностьПечатиСФ(Документ.ДокументыОснования) Тогда
			ПроверкаПройдена = Истина
		КонецЕсли;
		Возврат ПроверкаПройдена 	
	КонецЕсли;	
	
КонецФункции
//80515 Субботин 16.02.2024 Конец 

//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, начало
Функция РазрешеноВыбиратьИзменятьТипКалькуляцииДоплатные( Ссылка, ТипКалькуляции ) Экспорт
	РазрешеноВыбиратьМенятьДоплатныеКТК = Истина;
	
	Если Не РольДоступна("dc_ИзменениеПризнакаДоплатныхКткПСЦ") И Не РольДоступна("ПолныеПрава") Тогда
		//При попытке записать/провести документ с выбранным типом «Доплатные КТК» выводить сообщение и отменять запись: «Недостаточно прав. Необходимо обратиться к руководителю Производственной дирекции».
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ТипКалькуляцииДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТипКалькуляции");
			ТипКалькуляцииИзменилсяСДоплатной = (ТипКалькуляцииДоИзменения <> ТипКалькуляции) И ТипКалькуляцииДоИзменения = Перечисления.ТипыКалькуляций.Доплатные;
			ТипКалькуляцииИзменилсяНаДоплатную = (ТипКалькуляцииДоИзменения <> ТипКалькуляции) И ТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные;
			Если ТипКалькуляцииИзменилсяСДоплатной Или ТипКалькуляцииИзменилсяНаДоплатную Тогда
				РазрешеноВыбиратьМенятьДоплатныеКТК = Ложь;
			КонецЕсли;
		ИначеЕсли ТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные Тогда
			РазрешеноВыбиратьМенятьДоплатныеКТК = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РазрешеноВыбиратьМенятьДоплатныеКТК;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, конец     

//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
Функция ПроверитьНаличиеФайлаПФПСЦПоставщикаАвтоперевозки(ВладелецФайлов) Экспорт;
	
	Наименование = "Протокол типовой (автоперевозки)";
	Расширение = "pdf";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайлов
		|	И Файлы.ПометкаУдаления = Ложь
		|	И Файлы.Расширение = &Расширение
		|	И Файлы.Наименование = &Наименование";	
	Запрос.Параметры.Вставить("ВладелецФайлов", ВладелецФайлов);
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Параметры.Вставить("Расширение", Расширение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции //Евросиб Коханенко Н.А. 27.03.2025 )) #102319
//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, конец

//Евросиб СубботинВ #119324 07.10.2025 Начало
Функция ПроверитьВозможностьПечатиРтуПоСпискуНоменклатур(Документ) Экспорт  
	
	НоменклатурыБлокировкиПечатиРТУ = Константы.СписокНоменклатурыБлокировкиПечатиРТУ.Получить().Получить();	
	
	Для Каждого СтрокаУслуг из Документ.Услуги Цикл
		Если НЕ НоменклатурыБлокировкиПечатиРТУ.НайтиПоЗначению(СтрокаУслуг.Номенклатура) = Неопределено Тогда
			ВызватьИсключение("Печать РТУ с номенклатурой: " + СтрокаУслуг.Номенклатура + " Запрещена");
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
 //Евросиб СубботинВ #119324 07.10.2025 Конец


