
&НаКлиенте
Процедура ВставитьИзEXCEL(Команда)
	
	
	Если ЭтаФорма.ТекущийЭлемент.Имя = "ВставитьИзEXCELВагон" Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("Вагоны", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ВставитьИзEXCELКТК" Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("КТК", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ВставитьИзEXCELНакладная" Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("Накладные", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Накладные", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхПозиций(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	Для каждого Стр из параметр1 Цикл
		Если Параметр2.Свойство("Вагоны") Тогда
			ЭтаФорма.НомерВагона.Добавить(Стр);
		ИначеЕсли Параметр2.Свойство("КТК") Тогда
			ЭтаФорма.НомерКонтейнера.Добавить(Стр);
		ИначеЕсли Параметр2.Свойство("Накладные") Тогда
			НайдНакладная = Преобразовать_ТрДок_вЭНакладная(Стр);
			ЭтаФорма.НомерДокумента.Добавить(НайдНакладная);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Преобразовать_ТрДок_вЭНакладная(НомерНакладной)
	
	Возврат РаботаСКонтейнерамиСервер.ПолучитьНакладнуюЭТРАН(НомерНакладной, Истина);
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
		ШаблоныОтборов = ЗанестиДанныеВСправочник(Неопределено,Строка,Параметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗанестиДанныеВСправочник(СпрОбъект,ИмяСпр,СтруктураРеквизитов)

	Если ЗначениеЗаполнено(СпрОбъект) Тогда
		
		ПолучОб = СпрОбъект.ПолучитьОбъект();
		ПолучОб.СписокПолейОтборов.Очистить();
		
	Иначе
		
		ПолучОб = Справочники.ШаблоныОтборовНакладных.СоздатьЭлемент();
		ПолучОб.Наименование = ИмяСпр;
		ПолучОб.Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	Для Каждого Стр Из СтруктураРеквизитов Цикл
		Если Стр.ИмяРеквизита = "ШаблоныОтборов" Тогда
			Продолжить;
		КонецЕсли;
		НовСтр = ПолучОб.СписокПолейОтборов.Добавить();
		НовСтр.НаименованиеПоляВСистеме = Стр.ИмяРеквизита;
		НовСтр.НаименованиеПоля = Стр.ЗаголовокРеквизита;
		НовСтр.СохраненноеЗначение = Новый ХранилищеЗначения(Стр.ЗначениеРеквизита);
	КонецЦикла;
	
	ПолучОб.Записать();
	
	Возврат ПолучОб.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНакладные(МассивНайденныйхСтрок)
	
	ТаблицаВыбранных = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(11);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТаблицаВыбранных.Колонки.Добавить("Документ",Новый ОписаниеТипов("ДокументСсылка.э_Накладная"));
	ТаблицаВыбранных.Колонки.Добавить("Контроль",Новый ОписаниеТипов("ПеречислениеСсылка.КонтрольНакладные"));
	ТаблицаВыбранных.Колонки.Добавить("КонтрольУстановил",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаВыбранных.Колонки.Добавить("КомментарийИзМакета",ОписаниеТиповС);
	ТаблицаВыбранных.Колонки.Добавить("ОтветственныйМенеджер",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Для Каждого Стр Из МассивНайденныйхСтрок Цикл
		НовСтр = ТаблицаВыбранных.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	// делаем запрос по ТЗ для того, чтобы сгруппировать измененные строки накладных и не делать цикл по всем строкам
	// (т.к. детализация идет до контейнера, строк с одной и той же накладной может быть несколько).
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТЧ.Документ КАК Документ,
		|	ВремТЧ.Контроль КАК Контроль,
		|	ВремТЧ.КонтрольУстановил КАК КонтрольУстановил,
		|	ВремТЧ.КомментарийИзМакета КАК КомментарийИзМакета,
		|	ВремТЧ.ОтветственныйМенеджер КАК ОтветственныйМенеджер
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТЧ КАК ВремТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Документ КАК Документ,
		|	ВТ.Контроль КАК Контроль,
		|	ВТ.КонтрольУстановил КАК КонтрольУстановил,
		|	ВТ.КомментарийИзМакета КАК КомментарийИзМакета,
		|	ВТ.ОтветственныйМенеджер КАК ОтветственныйМенеджер
		|ИЗ
		|	ВТ КАК ВТ
		|ИТОГИ ПО
		|	Документ";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТаблицаВыбранных);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНакладная = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНакладная.Следующий() Цикл
		ТекНакладная = ВыборкаНакладная.Документ;
		ПолучОб = ТекНакладная.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаНакладная.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Получоб,ВыборкаДетальныеЗаписи);
			Исполнитель = ВыборкаДетальныеЗаписи.ОтветственныйМенеджер;
		КонецЦикла;
		// должны быть только уникальные состояния
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние",ПредопределенноеЗначение("Справочник.Состояния.ДополнительнаяОбработкаНакладной"));
		НайденныеСтр = ПолучОб.Состояния.НайтиСтроки(ПараметрыОтбора);
		// если нашли такое состояние и исполнитель изменился, то удалить такую строку и 
		// записать новую. если исполнитель тот же, то ничего не делаем
		Если НайденныеСтр.Количество()>0 И 
			НЕ НайденныеСтр[0].Исполнитель = Исполнитель Тогда
			ПолучОб.Состояния.Удалить(НайденныеСтр[0]);
			
			НСтр = ПолучОб.Состояния.Добавить();
			СтатусМенеджера = ПредопределенноеЗначение("Справочник.Состояния.ДополнительнаяОбработкаНакладной");
			НСтр.Состояние = СтатусМенеджера;
			НСтр.Исполнитель = Исполнитель;
			НСтр.Наблюдатель = Исполнитель;
			НСтр.НачалоРаботы = ТекущаяДата();
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			НСтр.НормативИсполненияСМоментаСоздания = 2;
			
		ИначеЕсли НайденныеСтр.Количество() = 0 Тогда
			НСтр = ПолучОб.Состояния.Добавить();
			СтатусМенеджера = ПредопределенноеЗначение("Справочник.Состояния.ДополнительнаяОбработкаНакладной");
			НСтр.Состояние = СтатусМенеджера;
			НСтр.Исполнитель = Исполнитель;
			НСтр.Наблюдатель = Исполнитель;
			НСтр.НачалоРаботы = ТекущаяДата();
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			НСтр.НормативИсполненияСМоментаСоздания = 2;
		КонецЕсли;
		
		ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	
	ТЗНакладные.Очистить();

	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	ВыделенныеСтроки = Элементы.ТЗНакладные.ВыделенныеСтроки;
	ВыделенныеСтроки.Очистить();
    // Евросиб Фролов)
	
	Если ВыбиратьЗаписей = 0 Тогда
		ВыбиратьЗаписей = 1;
	КонецЕсли;
	
	ОбновитьТаблицуНаФорме();
	
	ПодключитьОбработчикОжидания("ДинамическоеОбновлениеПодвалаМакета", 2, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ДинамическоеОбновлениеПодвалаМакета()
	
	КоличествоСтр = 0;
	
	Если ТЗНакладные.Количество() > 200 Тогда
		
		КоличествоСтр = ТЗНакладные.Количество();
		
	Иначе
		
		Для Сч = 0 По ТЗНакладные.Количество()-1 Цикл
			
			Если Элементы.ТЗНакладные.ПроверитьСтроку(ТЗНакладные[Сч].ПолучитьИдентификатор()) Тогда
				
				КоличествоСтр = КоличествоСтр + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//Евросиб Каблов 11.12.2020 ( Ticket#0216886
	//Элементы.ТЗНакладныеСделка.ТекстПодвала = "Количество: " + Формат(КоличествоСтр, "ЧГ=");
	Элементы.ТЗНакладныеСделки.ТекстПодвала = "Количество: " + Формат(КоличествоСтр, "ЧГ=");
	//Евросиб Каблов 11.12.2020 )
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоискНаСервере(МассивСтруктурРеквизитов)
		
	Запрос = Новый Запрос;
	
	ОтборыДорогаОтправления = "";
	ОтборыДорогаНазначения = "";
	ОтборыСтанцияОтправления = "";
	ОтборыСтанцияНазначения = "";
	//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	//ОтборыКонтроль = "";
	//ОтборыМенеджер = "";
	//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	ОтборыПоискКлиент = "";
	ОтборыПоискДоговор = "";
	ОтборыГрузЕТСНГ = "";
	ОтборыНомерВагона = "";			
	ОтборыНомерДокумента = "";
	ОтборыНомерКонтейнера = "";
	ОтборыОКПОГрузоотправитель = "";
	ОтборыОКПОГрузополучателя = "";
	ОтборыПериодПеревозки = "";
	ОтборыИсключитьВагонСданВАренду = "";
	ОтборыТипПлательщика = "";
	//Евросиб Каблов 11.12.2020 ( Ticket#0216886
	//ОтборыРаспределенаВСделки = " ЕСТЬNULL(Итоговая.Сделка,0) = 0";	
	ОтборыРаспределенаВСделки = " Сделки.Документ ЕСТЬ NULL";
	//Евросиб Каблов 11.12.2020 )
	ОтборыГОГПЕвросиб = "";
	ОтборыДлинаПоОсямАвтосцепки = "";
	ОтборыТипРейса = "";
	ОтборыНакладныеРемонт = "";
	ОтборыКонтейнерныйПоезд = "";
	ОтборыНакладнаяДействительна = " НЕ э_Накладная.ПометкаУдаления";
	ОтборыВыбиратьЗаписей = 200; ПарОтборыВыбиратьЗаписей = "";
	
	НаименованиеПлательщика = Справочники.Контрагенты.ПустаяСсылка();
	ТипПлательщика = Перечисления.ТипыПлательщиков.ПустаяСсылка();
	
	// Евросиб Фролов (05.10.2021 
	// Переменная для того, чтобы понять - заданы отборы или нет
	ЗаданыОтборыДляПоиска = Ложь;	
	// Евросиб Фролов)
	
	Для Каждого Элем Из МассивСтруктурРеквизитов Цикл
		Если (ТипЗнч(Элем.ЗначениеРеквизита) = Тип("СписокЗначений") И Элем.ЗначениеРеквизита.Количество()>0) ИЛИ
			(ТипЗнч(Элем.ЗначениеРеквизита) = Тип("Булево") И Элем.ЗначениеРеквизита) ИЛИ
			(НЕ ТипЗнч(Элем.ЗначениеРеквизита) = Тип("СписокЗначений") И НЕ ТипЗнч(Элем.ЗначениеРеквизита) = Тип("Булево") И ЗначениеЗаполнено(Элем.ЗначениеРеквизита)) Тогда
			// параметры в зависимости от установленных отборов на форме
			
			// Евросиб Фролов (05.10.2021 
			// Если заполнено значение хотя бы одного поля или флажка (кроме количества записей),
			// то отборы заданы и поиск будет выполнен.
			Если Элем.ИмяРеквизита <> "ВыбиратьЗаписей"
				И Элем.ИмяРеквизита <> "ТипПлательщика" Тогда
				ЗаданыОтборыДляПоиска = Истина;
			КонецЕсли;	
			// Евросиб Фролов)
			
			Если Элем.ИмяРеквизита = "ВыбиратьЗаписей" Тогда
				ПарОтборыВыбиратьЗаписей = "	ПЕРВЫЕ " + Формат(Элем.ЗначениеРеквизита,"ЧГ=0");
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ДорогаОтправления" Тогда
				ОтборыДорогаОтправления = "	э_Накладная.СтанцияОтправления.Дорога В(&ОтборыДорогаОтправления)";
				Запрос.УстановитьПараметр("ОтборыДорогаОтправления",Элем.ЗначениеРеквизита);
			КонецЕсли;
			
			Если Элем.ИмяРеквизита = "ДорогаНазначения" Тогда
				ОтборыДорогаНазначения = " э_Накладная.СтанцияНазначения.Дорога В(&ОтборыДорогаНазначения)";
				Запрос.УстановитьПараметр("ОтборыДорогаНазначения",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "СтанцияОтправления" Тогда
				ОтборыСтанцияОтправления = " э_Накладная.СтанцияОтправления В(&ОтборыСтанцияОтправления)";
				Запрос.УстановитьПараметр("ОтборыСтанцияОтправления",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "СтанцияНазначения" Тогда
				ОтборыСтанцияНазначения = " э_Накладная.СтанцияНазначения В(&ОтборыСтанцияНазначения)";
				Запрос.УстановитьПараметр("ОтборыСтанцияНазначения",Элем.ЗначениеРеквизита);
			КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
			//Если Элем.ИмяРеквизита = "Контроль" Тогда
			//	ОтборыКонтроль = " э_Накладная.Контроль В(&ОтборыКонтроль)";
			//	Запрос.УстановитьПараметр("ОтборыКонтроль",Элем.ЗначениеРеквизита);
			//КонецЕсли;
			//Если Элем.ИмяРеквизита = "Менеджер" Тогда
			//	ОтборыМенеджер = " э_Накладная.ОтветственныйМенеджер В(&ОтборыМенеджер)";
			//	Запрос.УстановитьПараметр("ОтборыМенеджер",Элем.ЗначениеРеквизита);
			//КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
			Если Элем.ИмяРеквизита = "ПоискКлиент" Тогда
				ОтборыПоискКлиент = " Итоговая.Клиент В(&ОтборыПоискКлиент)";
				Запрос.УстановитьПараметр("ОтборыПоискКлиент",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ПоискДоговор" Тогда
				ОтборыПоискДоговор = " Итоговая.Договор В(&ОтборыПоискДоговор)";
				Запрос.УстановитьПараметр("ОтборыПоискДоговор",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ГрузЕТСНГ" Тогда
				ОтборыГрузЕТСНГ = " э_НакладнаяГрузыЖД.ЕТСНГ В(&ОтборыГрузЕТСНГ)";
				Запрос.УстановитьПараметр("ОтборыГрузЕТСНГ",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "НомерВагона" Тогда
				ОтборыНомерВагона = " э_НакладнаяВагоны.НомерВагона В(&ОтборыНомерВагона)";
				Запрос.УстановитьПараметр("ОтборыНомерВагона",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "НомерДокумента" Тогда
				ОтборыНомерДокумента = " э_Накладная.Ссылка В(&ОтборыНомерДокумента)";
				Запрос.УстановитьПараметр("ОтборыНомерДокумента",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "НомерКонтейнера" Тогда
				ОтборыНомерКонтейнера = " э_НакладнаяКонтейнеры.НомерКонтейнера В(&ОтборыНомерКонтейнера)";
				Запрос.УстановитьПараметр("ОтборыНомерКонтейнера",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ОКПОГрузоотправитель" Тогда
				ОтборыОКПОГрузоотправитель = " э_Накладная.ГрузоотправительОКПО В(&ОтборыОКПОГрузоотправитель)";
				Запрос.УстановитьПараметр("ОтборыОКПОГрузоотправитель",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ОКПОГрузополучателя" Тогда
				ОтборыОКПОГрузополучателя = " э_Накладная.ГрузополучательОКПО В(&ОтборыОКПОГрузополучателя)";
				Запрос.УстановитьПараметр("ОтборыОКПОГрузополучателя",Элем.ЗначениеРеквизита);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ПериодПеревозки" Тогда
				ОтборыПериодПеревозки = " (э_Накладная.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНач И &ДатаКон
													|	ИЛИ э_Накладная.ДатаИВремяПрибытияГруза МЕЖДУ &ДатаНач И &ДатаКон)";
				Запрос.УстановитьПараметр("ДатаНач",Элем.ЗначениеРеквизита.ДатаНачала);
				Запрос.УстановитьПараметр("ДатаКон",Элем.ЗначениеРеквизита.ДатаОкончания);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ИсключитьВагонСданВАренду" Тогда
				ОтборыИсключитьВагонСданВАренду = " ВЫБОР
													|	КОГДА ПОДСТРОКА(Итоговая.ТипСобственности.Наименование,0,5) = ""Аренд""
													|		ТОГДА ИСТИНА
													|	ИНАЧЕ ЛОЖЬ
													|	КОНЕЦ = ЛОЖЬ";
			КонецЕсли;  	               

			Если Элем.ИмяРеквизита = "ТипПлательщика" Тогда
				Если Элем.ЗначениеРеквизита = Перечисления.ТипыПлательщиков.ПлательщикЕвросиб  Тогда
					ОтборыТипПлательщика = " ВЫБОР
							               |		КОГДА Итоговая.Плательщик В
							               |				(ВЫБРАТЬ
							               |					орг.НаименованиеДляНакладной
							               |				ИЗ
							               |					Справочник.Организации КАК орг)
							               |			ТОГДА ИСТИНА
							               |		ИНАЧЕ ЛОЖЬ
							               |	КОНЕЦ = ИСТИНА";
				ИначеЕсли Элем.ЗначениеРеквизита = Перечисления.ТипыПлательщиков.СторонниеПлательщики  Тогда
					ОтборыТипПлательщика = " ВЫБОР
							               |		КОГДА Итоговая.Плательщик В
							               |				(ВЫБРАТЬ
							               |					орг.НаименованиеДляНакладной
							               |				ИЗ
							               |					Справочник.Организации КАК орг)
							               |			ТОГДА ИСТИНА
							               |		ИНАЧЕ ЛОЖЬ
							               |	КОНЕЦ = ЛОЖЬ";
				ИначеЕсли Элем.ЗначениеРеквизита = Перечисления.ТипыПлательщиков.ВыбранныеПлательщики И
					ЗначениеЗаполнено(НаименованиеПлательщика) Тогда
					ОтборыТипПлательщика = " Итоговая.Плательщик В(&ОтборыТипПлательщика)";
					Запрос.УстановитьПараметр("ОтборыТипПлательщика",Строка(НаименованиеПлательщика));
				КонецЕсли;
				ТипПлательщика = Элем.ЗначениеРеквизита;
			КонецЕсли;
			
			Если Элем.ИмяРеквизита = "Плательщик" И
				ТипПлательщика = Перечисления.ТипыПлательщиков.ВыбранныеПлательщики Тогда
				ОтборыТипПлательщика = " Итоговая.Плательщик В(&ОтборыТипПлательщика)";
				Запрос.УстановитьПараметр("ОтборыТипПлательщика",Строка(Элем.ЗначениеРеквизита));
			КонецЕсли;
			
			//Евросиб Каблов 11.12.2020 ( Ticket#0216886 
			//Если Элем.ИмяРеквизита = "РаспределенаВСделки" Тогда
				//ОтборыРаспределенаВСделки = " НЕ ЕСТЬNULL(Итоговая.Сделка,0) = 0";
			Если Элем.ИмяРеквизита = "УчитыватьРаспределенныеВСделки" Тогда
				ОтборыРаспределенаВСделки = "";
			//Евросиб Каблов 11.12.2020 )
			КонецЕсли;
			
			Если Элем.ИмяРеквизита = "ГОГПЕвросиб" Тогда
				ОтборыГОГПЕвросиб = " НЕ ЕСТЬNULL(Итоговая.ГОЕвросиб,0) = 0 ИЛИ
						               |	НЕ ЕСТЬNULL(Организации.Ссылка,0) = 0";
			КонецЕсли;
			
			// Если отбор по футовости, то делать проверку по длине вагона из РС ПаспортаВагонов
			Если Элем.ИмяРеквизита = "ВагоныТЕУ" Тогда
				НачДлина = 0;
				КонДлина = 99999;
				Если Элем.ЗначениеРеквизита = 1 Тогда
					КонДлина = 16000;
				ИначеЕсли Элем.ЗначениеРеквизита = 2 Тогда
					НачДлина = 16001;
					КонДлина = 22000;
				ИначеЕсли Элем.ЗначениеРеквизита = 3 Тогда
					НачДлина = 22001;
				КонецЕсли;
				ОтборыДлинаПоОсямАвтосцепки = " ДлинаПоОсямАвтосцепки МЕЖДУ &НачДлина И &КонДлина";
				Запрос.УстановитьПараметр("НачДлина",НачДлина);
				Запрос.УстановитьПараметр("КонДлина",КонДлина);
			КонецЕсли;
			Если Элем.ИмяРеквизита = "ТипРейса" И Элем.ЗначениеРеквизита = 1 Тогда
				ОтборыТипРейса = " э_НакладнаяКонтейнеры.МассыВКгНетто = 0";
			ИначеЕсли Элем.ИмяРеквизита = "ТипРейса" И Элем.ЗначениеРеквизита = 2 Тогда
				ОтборыТипРейса = " э_НакладнаяКонтейнеры.МассыВКгНетто > 0";
			КонецЕсли;
			Если Элем.ИмяРеквизита = "НакладныеРемонт" И Элем.ЗначениеРеквизита = 1 Тогда
				ОтборыНакладныеРемонт = " э_Накладная.Ремонт = 1224";
			ИначеЕсли Элем.ИмяРеквизита = "НакладныеРемонт" И Элем.ЗначениеРеквизита = 2 Тогда
				ОтборыНакладныеРемонт = " э_Накладная.Ремонт = 1212";
			ИначеЕсли Элем.ИмяРеквизита = "НакладныеРемонт" И Элем.ЗначениеРеквизита = 3 Тогда
				ОтборыНакладныеРемонт = " э_Накладная.Ремонт = 1213";
			КонецЕсли;
			Если Элем.ИмяРеквизита = "КонтейнерныйПоезд" Тогда
				ОтборыКонтейнерныйПоезд = " э_Накладная.КонтейнерныйПоезд";
			КонецЕсли;
			
			Если Элем.ИмяРеквизита = "УдаленныеНеиспользуемые" Тогда
				ОтборыНакладнаяДействительна = "";
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Евросиб Фролов(05.10.2021 Ticket№ 
	// Если отборы для поиска не заданы, то возвращаем Неопределено,
	// чтобы можно было вадвть соответствующее сообщение пользователю.
	Если Не ЗаданыОтборыДляПоиска Тогда
	    Возврат Неопределено;
	КонецЕсли;
	// Евросиб Фролов)
	
	// Было:
	//ОтборыНомерВагона + "
	//|" + ОтборыНомерДокумента + "
	//|" + ОтборыНомерКонтейнера + "
	//|" + ОтборыДорогаОтправления + "
	//|" + ОтборыДорогаНазначения + "
	//|" + ОтборыСтанцияОтправления + "
	//|" + ОтборыСтанцияНазначения + "
	//|" + ОтборыКонтроль + "
	//|" + ОтборыМенеджер + "
	//|" + ОтборыГрузЕТСНГ + "
	//|" + ОтборыОКПОГрузоотправитель + "
	//|" + ОтборыОКПОГрузополучателя + "
	//|" + ОтборыПериодПеревозки + "
	//|" + ОтборыТипРейса + "
	//|" + ОтборыНакладныеРемонт + "
	//|" + ОтборыКонтейнерныйПоезд + "
	//|" + ОтборыНакладнаяДействительна
	
	// Стало:
	//&СписокОтборов - если параметров не, то &СписокОтборов=Истина
	Запрос.УстановитьПараметр("СписокОтборов", Истина);
	СписокОтборов = "";
	Если ОтборыНомерВагона <> "" Тогда  //1
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыНомерВагона;
	КонецЕсли; 
	Если ОтборыНомерДокумента <> "" Тогда  //2
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыНомерДокумента;
	КонецЕсли; 
	Если ОтборыНомерКонтейнера <> "" Тогда //3
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыНомерКонтейнера;
	КонецЕсли;
	Если ОтборыДорогаОтправления <> "" Тогда //4
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыДорогаОтправления;
	КонецЕсли;
	Если ОтборыДорогаНазначения <> "" Тогда //5
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыДорогаНазначения;
	КонецЕсли;
	Если ОтборыСтанцияОтправления <> "" Тогда //6
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыСтанцияОтправления;
	КонецЕсли;
	Если ОтборыСтанцияНазначения <> "" Тогда //7
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыСтанцияНазначения;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	//Если ОтборыКонтроль <> "" Тогда  //8
	//	СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыКонтроль;
	//КонецЕсли;
	//Если ОтборыМенеджер <> "" Тогда  //9
	//	СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыМенеджер;
	//КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	Если ОтборыГрузЕТСНГ <> "" Тогда  //10
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыГрузЕТСНГ;
	КонецЕсли;
	Если ОтборыОКПОГрузоотправитель <> "" Тогда //11
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыОКПОГрузоотправитель;
	КонецЕсли;
	Если ОтборыОКПОГрузополучателя <> "" Тогда  //12
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыОКПОГрузополучателя;
	КонецЕсли;
	Если ОтборыПериодПеревозки <> "" Тогда //13
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыПериодПеревозки;
	КонецЕсли;
	Если ОтборыТипРейса <> "" Тогда  //14
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыТипРейса;
	КонецЕсли;
	Если ОтборыНакладныеРемонт <> "" Тогда //15
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыНакладныеРемонт;
	КонецЕсли;
	Если ОтборыКонтейнерныйПоезд <> "" Тогда //16
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыКонтейнерныйПоезд;
	КонецЕсли;
	Если ОтборыНакладнаяДействительна <> "" Тогда //17
		СписокОтборов = СписокОтборов + ?(СписокОтборов="", "", " И ") + ОтборыНакладнаяДействительна;
	КонецЕсли;
	
	// Было:
	//ОтборыПоискКлиент + "
	//|" + ОтборыПоискДоговор + "
	//|" + ОтборыИсключитьВагонСданВАренду + "
	//|" + ОтборыТипПлательщика + "
	//|" + ОтборыРаспределенаВСделки + "
	//|" + ОтборыГОГПЕвросиб + "
	//|" + ОтборыДлинаПоОсямАвтосцепки
	
	// Стало:
	Запрос.УстановитьПараметр("СписокКонечныхОтборов", Истина);
	СписокКонечныхОтборов = "";
	Если ОтборыПоискКлиент <> "" Тогда //1
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыПоискКлиент;
	КонецЕсли;
	Если ОтборыПоискДоговор <> "" Тогда //2
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыПоискДоговор;
	КонецЕсли;
	Если ОтборыИсключитьВагонСданВАренду <> "" Тогда //3
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыИсключитьВагонСданВАренду;
	КонецЕсли;
	Если ОтборыТипПлательщика <> "" Тогда //4
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыТипПлательщика;
	КонецЕсли;
	Если ОтборыРаспределенаВСделки <> "" Тогда //5
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыРаспределенаВСделки;
	КонецЕсли;
	Если ОтборыГОГПЕвросиб <> "" Тогда //6
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыГОГПЕвросиб;
	КонецЕсли;
	Если ОтборыДлинаПоОсямАвтосцепки <> "" Тогда //7
		СписокКонечныхОтборов = СписокКонечныхОтборов + ?(СписокКонечныхОтборов="", "", " И ") + ОтборыДлинаПоОсямАвтосцепки;
	КонецЕсли;
	
	// условие во второй части запроса "НЕ ВагоныКонтейнеры.Дата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)" нужно для того, чтобы в строках отбора,
	// которые дописываются в запрос в зависимости от заполненых данных, не нужно было писать условие для ключевого слова ГДЕ. только И
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	э_Накладная.Ссылка КАК Накладная,
	               |	э_Накладная.ИсточникНакладной КАК ИсточникНакладной,
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК Контейнер,
	               |	э_Накладная.Номер КАК НомерНакладной,
	               |	э_Накладная.НакладнаяИД КАК НакладнаяИД,
	               |	э_НакладнаяВагоны.НомерВагона КАК Вагон,
	               |	э_Накладная.ТекущееСостояниеНакладной КАК СтатусДокументаЭтран,
	               |	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	               |	э_НакладнаяВагоны.ГрузоподъемностьВТн КАК ГрузоподъемностьВТн,
	               |	э_Накладная.СтанцияОтправления КАК СтанцияОтправления,
	               |	э_Накладная.СтанцияОтправления.Дорога КАК СтанцияОтправленияДорога,
	               |	э_Накладная.СтанцияНазначения КАК СтанцияНазначения,
	               |	э_Накладная.СтанцияНазначения.Дорога КАК СтанцияНазначенияДорога,
	               |	э_НакладнаяГрузыЖД.ЕТСНГ КАК ЕТСНГ,
	               |	э_НакладнаяГрузыЖД.НомерГТД КАК НомерГТД,
	               |	э_Накладная.Дата КАК Дата,
	               |	э_Накладная.ДатаИВремяПринятияГрузаКПеревозке КАК ДатаИВремяПринятияГрузаКПеревозке,
	               |	э_Накладная.ДатаИстеченияСрокаДоставки КАК ДатаИстеченияСрокаДоставки,
	               |	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	               |	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	               |	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	               |	э_Накладная.ДатаПриемаСИнодороги КАК ДатаПриемаСИнодороги,
	               |	э_Накладная.ДатаИВремяСдачиНаИнодорогу КАК ДатаИВремяСдачиНаИнодорогу,
	               |	э_Накладная.ПлательщикКод КАК ПлательщикКод,
	               |	э_Накладная.ПлательщикНаименование КАК ПлательщикНаименование,
	               |	э_Накладная.ОтправкаВид КАК ОтправкаВид,
	               |	э_НакладнаяВагоны.РодВагона КАК РодВагона,
	               |	э_НакладнаяВагоны.ТипСобственности КАК ТипСобственности,
	               |	э_Накладная.ГрузоотправительОКПО КАК ГрузоотправительОКПО,
	               |	э_Накладная.Грузоотправитель КАК ГрузоотправительНаименование,
	               |	э_Накладная.ГрузополучательОКПО КАК ГрузополучательОКПО,
	               |	э_Накладная.Грузополучатель КАК ГрузополучательНаименование,
	               |	э_Накладная.КодИсключительногоТарифа КАК КодИсключительногоТарифа,
	               |	э_Накладная.ЗаявкаГУ12 КАК ЗаявкаГУ12,
	               |	э_Накладная.ПунктОтправленияНаименование КАК ПунктОтправленияНаименование,
	               |	э_Накладная.ПунктНазначенияНаименование КАК ПунктНазначенияНаименование,
	               |	э_Накладная.ПортОтправленияНаименование КАК ПортОтправленияНаименование,
	               |	э_Накладная.СтанцияОтправленияНаименование КАК СтранаОтправления,
	               |	э_Накладная.ПортНазначенияНаименование КАК ПортНазначенияНаименование,
	               |	э_Накладная.СтранаНазначенияНаименование КАК СтранаНазначения,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
				   //|	э_Накладная.Контроль КАК Контроль,
				   //|	э_Накладная.КонтрольУстановил КАК КонтрольУстановил,
				   //|	ВЫРАЗИТЬ(э_Накладная.КомментарийИзМакета КАК СТРОКА(1000)) КАК КомментарийИзМакета,
				   //|	э_Накладная.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	э_Накладная.Проведен КАК Проведен,
	               |	э_Накладная.ПометкаУдаления КАК ПометкаУдаления,
	               |	ТЕ.Ссылка КАК КонтейнерСсылка,
	               |	ТС.Ссылка КАК ВагонСсылка,
	               |	э_НакладнаяКонтейнерыЗПУСтрока.ЗПУ КАК КонтейнерЗПУ,
	               |	э_Накладная.Ремонт КАК Ремонт,
	               |	э_Накладная.КонтейнерныйПоезд КАК КонтейнерныйПоезд,
	               |	э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус КАК НакладнаяДействительна,
	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоОтправлению, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоОтправлению, 0) КАК СуммаПоОтправлению,
	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоРаскредитации, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоРаскредитации, 0) КАК СуммаПоРаскредитации,
	               |	КлассыГрузов.class КАК КлассГруза,
	               |	ТранспортныйДокумент.Ссылка КАК ТД
	               |ПОМЕСТИТЬ ВагоныКонтейнеры
	               |ИЗ
	               |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	               |		ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	               |			И (НЕ ТС.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	               |				И (НЕ ТЕ.ПометкаУдаления)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.КонтейнерыЗПУСтрока КАК э_НакладнаяКонтейнерыЗПУСтрока
	               |			ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяКонтейнерыЗПУСтрока.Ссылка
	               |				И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяКонтейнерыЗПУСтрока.НомерКонтейнера
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаКонтейнер КАК э_НакладнаяСуммаНаКонтейнер
	               |			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяСуммаНаКонтейнер.НомерКонтейнера
	               |				И э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяСуммаНаКонтейнер.Ссылка
	               |		ПО (э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка)
	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	               |				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыГрузов КАК КлассыГрузов
	               |				ПО э_НакладнаяГрузыЖД.КодЕТСНГ = КлассыГрузов.cgCode
	               |			ПО э_Накладная.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |			ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ПО э_НакладнаяВагоны.Ссылка = э_Накладная.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаВагон КАК э_НакладнаяСуммаНаВагон
	               |		ПО э_НакладнаяВагоны.НомерВагона = э_НакладнаяСуммаНаВагон.НомерВагона
	               |			И э_НакладнаяВагоны.Ссылка = э_НакладнаяСуммаНаВагон.Ссылка
	               |ГДЕ
	               |	э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |	И НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	               |	И &СписокОтборов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	э_Накладная.Ссылка,
	               |	э_Накладная.ИсточникНакладной,
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера,
	               |	э_Накладная.Номер,
	               |	э_Накладная.НакладнаяИД,
	               |	э_НакладнаяВагоны.НомерВагона,
	               |	э_Накладная.ТекущееСостояниеНакладной,
	               |	э_НакладнаяКонтейнеры.МассыВКгНетто,
	               |	э_НакладнаяВагоны.ГрузоподъемностьВТн,
	               |	э_Накладная.СтанцияОтправления,
	               |	э_Накладная.СтанцияОтправления.Дорога,
	               |	э_Накладная.СтанцияНазначения,
	               |	э_Накладная.СтанцияНазначения.Дорога,
	               |	э_НакладнаяГрузыЖД.ЕТСНГ,
	               |	э_НакладнаяГрузыЖД.НомерГТД,
	               |	э_Накладная.Дата,
	               |	э_Накладная.ДатаИВремяПринятияГрузаКПеревозке,
	               |	э_Накладная.ДатаИстеченияСрокаДоставки,
	               |	э_Накладная.ДатаИВремяОтправленияГруза,
	               |	э_Накладная.ДатаИВремяПрибытияГруза,
	               |	э_Накладная.ДатаИВремяРаскредитованияГруза,
	               |	э_Накладная.ДатаПриемаСИнодороги,
	               |	э_Накладная.ДатаИВремяСдачиНаИнодорогу,
	               |	э_Накладная.ПлательщикКод,
	               |	э_Накладная.ПлательщикНаименование,
	               |	э_Накладная.ОтправкаВид,
	               |	э_НакладнаяВагоны.РодВагона,
	               |	э_НакладнаяВагоны.ТипСобственности,
	               |	э_Накладная.ГрузоотправительОКПО,
	               |	э_Накладная.Грузоотправитель,
	               |	э_Накладная.ГрузополучательОКПО,
	               |	э_Накладная.Грузополучатель,
	               |	э_Накладная.КодИсключительногоТарифа,
	               |	э_Накладная.ЗаявкаГУ12,
	               |	э_Накладная.ПунктОтправленияНаименование,
	               |	э_Накладная.ПунктНазначенияНаименование,
	               |	э_Накладная.ПортОтправленияНаименование,
	               |	э_Накладная.СтанцияОтправленияНаименование,
	               |	э_Накладная.ПортНазначенияНаименование,
	               |	э_Накладная.СтранаНазначенияНаименование,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	э_Накладная.Контроль,
	               //|	э_Накладная.КонтрольУстановил,
	               //|	ВЫРАЗИТЬ(э_Накладная.КомментарийИзМакета КАК СТРОКА(1000)),
	               //|	э_Накладная.ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	э_Накладная.Проведен,
	               |	э_Накладная.ПометкаУдаления,
	               |	ТЕ.Ссылка,
	               |	ТС.Ссылка,
	               |	э_НакладнаяКонтейнерыЗПУСтрока.ЗПУ,
	               |	э_Накладная.Ремонт,
	               |	э_Накладная.КонтейнерныйПоезд,
	               |	э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус,
	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоОтправлению, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоОтправлению, 0),
	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоРаскредитации, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоРаскредитации, 0),
	               |	КлассыГрузов.class,
	               |	ТранспортныйДокумент.Ссылка
	               |ИЗ
	               |	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	               |			И (НЕ ТЕ.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.КонтейнерыЗПУСтрока КАК э_НакладнаяКонтейнерыЗПУСтрока
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяКонтейнерыЗПУСтрока.Ссылка
	               |			И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяКонтейнерыЗПУСтрока.НомерКонтейнера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаКонтейнер КАК э_НакладнаяСуммаНаКонтейнер
	               |		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяСуммаНаКонтейнер.НомерКонтейнера
	               |			И э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяСуммаНаКонтейнер.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	               |			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	               |				И (НЕ ТС.ПометкаУдаления)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаВагон КАК э_НакладнаяСуммаНаВагон
	               |			ПО э_НакладнаяВагоны.НомерВагона = э_НакладнаяСуммаНаВагон.НомерВагона
	               |				И э_НакладнаяВагоны.Ссылка = э_НакладнаяСуммаНаВагон.Ссылка
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	               |				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыГрузов КАК КлассыГрузов
	               |				ПО э_НакладнаяГрузыЖД.КодЕТСНГ = КлассыГрузов.cgCode
	               |			ПО э_Накладная.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |			ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_Накладная.Ссылка
	               |ГДЕ
	               |	э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |	И НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	               |	И э_НакладнаяКонтейнеры.Ссылка.НакладнаяБезВагонов
	               |	И &СписокОтборов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВагоныКонтейнеры.НакладнаяИД КАК IDДокумента,
	               |	ВагоныКонтейнеры.НомерНакладной КАК НомерНакладной,
	               |	ВагоныКонтейнеры.Накладная КАК Документ,
	               |	ВагоныКонтейнеры.ИсточникНакладной КАК ИсточникНакладной,
	               |	ВагоныКонтейнеры.Вагон КАК Вагон,
	               |	ВагоныКонтейнеры.Контейнер КАК Контейнер,
	               |	ВагоныКонтейнеры.СтатусДокументаЭтран КАК СтатусДокументаЭтран,
	               |	ВагоныКонтейнеры.МассыВКгНетто КАК ВесГруза,
	               |	ВагоныКонтейнеры.ГрузоподъемностьВТн КАК ГПВагона,
	               |	ВагоныКонтейнеры.НомерГТД КАК ТаможеннаяОтметка,
	               |	ВагоныКонтейнеры.СтанцияОтправления КАК СтанцияОтправления,
	               |	ВагоныКонтейнеры.СтанцияОтправленияДорога КАК ДорогаСтанцииОтправления,
	               |	ВагоныКонтейнеры.СтанцияНазначения КАК СтанцияНазначения,
	               |	ВагоныКонтейнеры.СтанцияНазначенияДорога КАК ДорогаСтанцииНазначения,
	               |	ВагоныКонтейнеры.ЕТСНГ КАК ГрузЕТСНГ,
	               |	ВагоныКонтейнеры.Дата КАК ДатаИмпорта,
	               |	ВагоныКонтейнеры.ДатаИВремяПринятияГрузаКПеревозке КАК ДатаДокумента,
	               |	ВагоныКонтейнеры.ДатаИстеченияСрокаДоставки КАК ПлановыйСрокДоставки,
	               |	ВагоныКонтейнеры.ДатаИВремяОтправленияГруза КАК ДатаОтправленияГруза,
	               |	ВагоныКонтейнеры.ДатаИВремяПрибытияГруза КАК ДатаПрибытияГруза,
	               |	ВагоныКонтейнеры.ДатаИВремяРаскредитованияГруза КАК ДатаРаскредитации,
	               |	ВагоныКонтейнеры.ДатаПриемаСИнодороги КАК ДатаПогранПереходаВход,
	               |	ВагоныКонтейнеры.ДатаИВремяСдачиНаИнодорогу КАК ДатаПогранПереходаВыход,
	               |	ВагоныКонтейнеры.ПлательщикКод КАК Соглашение,
	               |	ВагоныКонтейнеры.ПлательщикНаименование КАК Плательщик,
	               |	ВагоныКонтейнеры.ОтправкаВид КАК ВидОтправки,
	               |	ВагоныКонтейнеры.РодВагона КАК РодВагона,
	               |	ВагоныКонтейнеры.ТипСобственности КАК ТипСобственности,
	               |	ВагоныКонтейнеры.ГрузоотправительОКПО КАК ОКПОГрузоотправителя,
	               |	ВагоныКонтейнеры.ГрузоотправительНаименование КАК Грузоотправитель,
	               |	ВагоныКонтейнеры.ГрузополучательОКПО КАК ОКПОГрузополучателя,
	               |	ВагоныКонтейнеры.ГрузополучательНаименование КАК Грузополучатель,
	               |	ВагоныКонтейнеры.КодИсключительногоТарифа КАК КодИсключительногоТарифа,
	               |	ВагоныКонтейнеры.ЗаявкаГУ12 КАК ГУ12,
	               |	ВагоныКонтейнеры.ПунктОтправленияНаименование КАК ПунктОтправления,
	               |	ВагоныКонтейнеры.ПортОтправленияНаименование КАК ПортОтправления,
	               |	ВагоныКонтейнеры.СтранаОтправления КАК СтранаОтправления,
	               |	ВагоныКонтейнеры.ПунктНазначенияНаименование КАК ПунктНазначения,
	               |	ВагоныКонтейнеры.ПортНазначенияНаименование КАК ПортНазначения,
	               |	ВагоныКонтейнеры.СтранаНазначения КАК СтранаНазначения,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	ВагоныКонтейнеры.Контроль КАК Контроль,
	               //|	ВагоныКонтейнеры.КонтрольУстановил КАК КонтрольУстановил,
	               //|	ВагоныКонтейнеры.КомментарийИзМакета КАК КомментарийИзМакета,
	               //|	ВагоныКонтейнеры.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	ВагоныКонтейнеры.КонтейнерСсылка КАК КонтейнерСсылка,
	               |	ВагоныКонтейнеры.Проведен КАК Проведен,
	               |	ВагоныКонтейнеры.ВагонСсылка КАК ВагонСсылка,
	               |	ВагоныКонтейнеры.КонтейнерЗПУ КАК НомерЗПУ,
	               |	ВагоныКонтейнеры.Ремонт КАК Ремонт,
	               |	Организации.Ссылка КАК ГОЕвросиб,
	               |	ВагоныКонтейнеры.КонтейнерныйПоезд КАК КонтейнерныйПоезд,
	               |	ВагоныКонтейнеры.НакладнаяДействительна КАК НакладнаяДействительна,
	               |	ВагоныКонтейнеры.СуммаПоОтправлению КАК СуммаПоОтправлению,
	               |	ВагоныКонтейнеры.СуммаПоРаскредитации КАК СуммаПоРаскредитации,
	               |	ВагоныКонтейнеры.КлассГруза КАК КлассГруза
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	ВагоныКонтейнеры КАК ВагоныКонтейнеры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО ВагоныКонтейнеры.ГрузоотправительОКПО = Организации.ОКПО
	               |			И (НЕ Организации.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВагоныКонтейнеры.Накладная КАК Документ,
	               |	ВЫБОР
	               |		КОГДА ВагоныКонтейнеры.Вагон = """"
	               |				ИЛИ ВагоныКонтейнеры.Вагон ЕСТЬ NULL
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ ВагоныКонтейнеры.Вагон
	               |	КОНЕЦ КАК Вагон,
	               |	ВЫБОР
	               |		КОГДА ВагоныКонтейнеры.Контейнер = """"
	               |				ИЛИ ВагоныКонтейнеры.Контейнер ЕСТЬ NULL
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ ВагоныКонтейнеры.Контейнер
	               |	КОНЕЦ КАК Контейнер,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВагоныКонтейнеры.ЕТСНГ) КАК КолГрузов
	               |ПОМЕСТИТЬ ВыбСборныхГрузов
	               |ИЗ
	               |	ВагоныКонтейнеры КАК ВагоныКонтейнеры
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВагоныКонтейнеры.Накладная,
	               |	ВЫБОР
	               |		КОГДА ВагоныКонтейнеры.Вагон = """"
	               |				ИЛИ ВагоныКонтейнеры.Вагон ЕСТЬ NULL
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ ВагоныКонтейнеры.Вагон
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВагоныКонтейнеры.Контейнер = """"
	               |				ИЛИ ВагоныКонтейнеры.Контейнер ЕСТЬ NULL
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ ВагоныКонтейнеры.Контейнер
	               |	КОНЕЦ
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВагоныКонтейнеры.ЕТСНГ) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итоговая.IDДокумента КАК IDДокумента,
	               |	Итоговая.НомерНакладной КАК НомерНакладной,
	               |	Итоговая.Документ КАК Документ,
	               |	Итоговая.ИсточникНакладной КАК ИсточникНакладной,
	               |	Итоговая.Вагон КАК Вагон,
	               |	Итоговая.Контейнер КАК Контейнер,
	               |	Итоговая.СтатусДокументаЭтран КАК СтатусДокументаЭтран,
	               |	СРЕДНЕЕ(Итоговая.ВесГруза) КАК ВесГруза,
	               |	Итоговая.ГПВагона КАК ГПВагона,
	               |	Итоговая.ТаможеннаяОтметка КАК ТаможеннаяОтметка,
	               |	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	               |	Итоговая.ДорогаСтанцииОтправления КАК ДорогаСтанцииОтправления,
	               |	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	               |	Итоговая.ДорогаСтанцииНазначения КАК ДорогаСтанцииНазначения,
	               |	ВЫБОР
	               |		КОГДА НЕ ВыбСборныхГрузов.КолГрузов ЕСТЬ NULL
	               |			ТОГДА &ГрузСборный
	               |		ИНАЧЕ Итоговая.ГрузЕТСНГ
	               |	КОНЕЦ КАК ГрузЕТСНГ,
	               |	Итоговая.ДатаИмпорта КАК ДатаИмпорта,
	               |	Итоговая.ДатаДокумента КАК ДатаДокумента,
	               |	Итоговая.ПлановыйСрокДоставки КАК ПлановыйСрокДоставки,
	               |	Итоговая.ДатаОтправленияГруза КАК ДатаОтправленияГруза,
	               |	Итоговая.ДатаПрибытияГруза КАК ДатаПрибытияГруза,
	               |	Итоговая.ДатаРаскредитации КАК ДатаРаскредитации,
	               |	Итоговая.ДатаПогранПереходаВход КАК ДатаПогранПереходаВход,
	               |	Итоговая.ДатаПогранПереходаВыход КАК ДатаПогранПереходаВыход,
	               |	Итоговая.Соглашение КАК Соглашение,
	               |	Итоговая.Плательщик КАК Плательщик,
	               |	Итоговая.ВидОтправки КАК ВидОтправки,
	               |	Итоговая.РодВагона КАК РодВагона,
	               |	Итоговая.ТипСобственности КАК ТипСобственности,
	               |	Итоговая.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	               |	Итоговая.Грузоотправитель КАК Грузоотправитель,
	               |	Итоговая.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	               |	Итоговая.Грузополучатель КАК Грузополучатель,
	               |	Итоговая.КодИсключительногоТарифа КАК КодИсключительногоТарифа,
	               |	Итоговая.ГУ12 КАК ГУ12,
	               |	Итоговая.ПунктОтправления КАК ПунктОтправления,
	               |	Итоговая.ПортОтправления КАК ПортОтправления,
	               |	Итоговая.СтранаОтправления КАК СтранаОтправления,
	               |	Итоговая.ПунктНазначения КАК ПунктНазначения,
	               |	Итоговая.ПортНазначения КАК ПортНазначения,
	               |	Итоговая.СтранаНазначения КАК СтранаНазначения,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
				   //|	Итоговая.Контроль КАК Контроль,
				   //|	Итоговая.КонтрольУстановил КАК КонтрольУстановил,
				   //|	Итоговая.КомментарийИзМакета КАК КомментарийИзМакета,
				   //|	Итоговая.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.КонтейнерСсылка КАК КонтейнерСсылка,
	               |	Итоговая.Проведен КАК Проведен,
	               |	Итоговая.ВагонСсылка КАК ВагонСсылка,
	               |	Итоговая.НомерЗПУ КАК НомерЗПУ,
	               |	Итоговая.Ремонт КАК Ремонт,
	               |	Итоговая.ГОЕвросиб КАК ГОЕвросиб,
	               |	Итоговая.КонтейнерныйПоезд КАК КонтейнерныйПоезд,
	               |	Итоговая.НакладнаяДействительна КАК НакладнаяДействительна,
	               |	Итоговая.СуммаПоОтправлению КАК СуммаПоОтправлению,
	               |	Итоговая.СуммаПоРаскредитации КАК СуммаПоРаскредитации,
	               |	Итоговая.КлассГруза КАК КлассГруза
	               |ПОМЕСТИТЬ ИтогСвернСборные
	               |ИЗ
	               |	Итоговая КАК Итоговая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыбСборныхГрузов КАК ВыбСборныхГрузов
	               |		ПО Итоговая.Документ = ВыбСборныхГрузов.Документ
	               |			И (ВЫБОР
	               |				КОГДА Итоговая.Контейнер = НЕОПРЕДЕЛЕНО
	               |						ИЛИ Итоговая.Контейнер = """"
	               |						ИЛИ Итоговая.Контейнер ЕСТЬ NULL
	               |					ТОГДА ВыбСборныхГрузов.Контейнер = """"
	               |							ИЛИ ВыбСборныхГрузов.Контейнер ЕСТЬ NULL
	               |							ИЛИ ВыбСборныхГрузов.Контейнер = НЕОПРЕДЕЛЕНО
	               |				ИНАЧЕ Итоговая.Контейнер = ВыбСборныхГрузов.Контейнер
	               |			КОНЕЦ)
	               |			И (ВЫБОР
	               |				КОГДА Итоговая.Вагон = НЕОПРЕДЕЛЕНО
	               |						ИЛИ Итоговая.Вагон = """"
	               |						ИЛИ Итоговая.Вагон ЕСТЬ NULL
	               |					ТОГДА ВыбСборныхГрузов.Вагон = """"
	               |							ИЛИ ВыбСборныхГрузов.Вагон ЕСТЬ NULL
	               |							ИЛИ ВыбСборныхГрузов.Вагон = НЕОПРЕДЕЛЕНО
	               |				ИНАЧЕ Итоговая.Вагон = ВыбСборныхГрузов.Вагон
	               |			КОНЕЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Итоговая.Плательщик,
	               |	Итоговая.Соглашение,
	               |	Итоговая.ВидОтправки,
	               |	Итоговая.ДатаРаскредитации,
	               |	Итоговая.ДатаПогранПереходаВход,
	               |	Итоговая.ДатаПогранПереходаВыход,
	               |	Итоговая.НомерНакладной,
	               |	Итоговая.Документ,
	               |	Итоговая.СтатусДокументаЭтран,
	               |	Итоговая.ТаможеннаяОтметка,
	               |	Итоговая.ДатаИмпорта,
	               |	Итоговая.ДорогаСтанцииОтправления,
	               |	Итоговая.ДатаДокумента,
	               |	Итоговая.Вагон,
	               |	Итоговая.СтанцияОтправления,
	               |	Итоговая.ДорогаСтанцииНазначения,
	               |	Итоговая.ПлановыйСрокДоставки,
	               |	Итоговая.ИсточникНакладной,
	               |	Итоговая.СтанцияНазначения,
	               |	Итоговая.Контейнер,
	               |	Итоговая.ДатаОтправленияГруза,
	               |	Итоговая.ДатаПрибытияГруза,
	               |	Итоговая.КлассГруза,
	               |	Итоговая.Проведен,
	               |	Итоговая.Грузоотправитель,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	Итоговая.Контроль,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.КонтейнерСсылка,
	               |	Итоговая.НомерЗПУ,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	Итоговая.КонтрольУстановил,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.КонтейнерныйПоезд,
	               |	Итоговая.ОКПОГрузополучателя,
	               |	Итоговая.ГУ12,
	               |	Итоговая.Грузополучатель,
	               |	Итоговая.НакладнаяДействительна,
	               |	Итоговая.ГОЕвросиб,
	               |	Итоговая.РодВагона,
	               |	Итоговая.ОКПОГрузоотправителя,
	               |	Итоговая.ПортНазначения,
	               |	Итоговая.ПунктНазначения,
	               |	Итоговая.ТипСобственности,
	               |	Итоговая.ПортОтправления,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	Итоговая.КомментарийИзМакета,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.СтранаНазначения,
	               |	Итоговая.СтранаОтправления,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	Итоговая.ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.ПунктОтправления,
	               |	Итоговая.ВагонСсылка,
	               |	Итоговая.IDДокумента,
	               |	Итоговая.ГПВагона,
	               |	Итоговая.КодИсключительногоТарифа,
	               |	Итоговая.Ремонт,
	               |	Итоговая.СуммаПоОтправлению,
	               |	Итоговая.СуммаПоРаскредитации,
	               |	ВЫБОР
	               |		КОГДА НЕ ВыбСборныхГрузов.КолГрузов ЕСТЬ NULL
	               |			ТОГДА &ГрузСборный
	               |		ИНАЧЕ Итоговая.ГрузЕТСНГ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка.Автор КАК Исполнитель,
	               |	ВагоныКонтейнеры.НакладнаяИД КАК IDДокумента,
	               |	ВагоныКонтейнеры.НомерНакладной КАК НомерНакладной,
	               |	ВагоныКонтейнеры.Накладная КАК Документ,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ КАК Протокол,
				   // Евросиб Фролов (23.11.2021 Ticket№ 0244435
				   |	СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ
				   // Евросиб Фролов)
	               |ПОМЕСТИТЬ ВТСделки
	               |ИЗ
	               |	ВагоныКонтейнеры КАК ВагоныКонтейнеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО (ВагоныКонтейнеры.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование
	               |				ИЛИ ВагоныКонтейнеры.Вагон = СделкаСвязьУчетныхЕдиниц.Вагон.Наименование)
	               |			И (СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ)
	               |			И (ВагоныКонтейнеры.Накладная.Номер = СделкаСвязьУчетныхЕдиниц.НомерЖДН
	               |				ИЛИ ВагоныКонтейнеры.Накладная.Номер = СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН
	               |				ИЛИ ВагоныКонтейнеры.Накладная.Номер = СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК
	               |				ИЛИ ВагоныКонтейнеры.ТД = СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	               |			ПО РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	               |				И (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления)
	               |		ПО ВагоныКонтейнеры.НомерНакладной = РеализацияТоваровУслугРасшифровкаУслугПоТС.НомерЖДН
	               |			И (ВагоныКонтейнеры.Проведен)
	               |			И (НЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 200
	               |	Итоговая.IDДокумента КАК IDДокумента,
	               |	Итоговая.Документ КАК Документ,
	               |	Итоговая.ИсточникНакладной КАК Источник,
	               |	Итоговая.Вагон КАК Вагон,
	               |	Итоговая.Контейнер КАК Контейнер,
	               |	Итоговая.СтатусДокументаЭтран КАК СтатусДокументаЭтран,
	               |	Итоговая.ВесГруза КАК ВесГруза,
	               |	Итоговая.ГПВагона КАК ГПВагона,
	               |	Итоговая.ТаможеннаяОтметка КАК ТаможеннаяОтметка,
	               |	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	               |	Итоговая.ДорогаСтанцииОтправления КАК ДорогаСтанцииОтправления,
	               |	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	               |	Итоговая.ДорогаСтанцииНазначения КАК ДорогаСтанцииНазначения,
	               |	Итоговая.ГрузЕТСНГ КАК ГрузЕТСНГ,
	               |	Итоговая.ДатаИмпорта КАК ДатаИмпорта,
	               |	Итоговая.ДатаДокумента КАК ДатаДокумента,
	               |	Итоговая.ПлановыйСрокДоставки КАК ПлановыйСрокДоставки,
	               |	Итоговая.ДатаОтправленияГруза КАК ДатаОтправленияГруза,
	               |	Итоговая.ДатаПрибытияГруза КАК ДатаПрибытияГруза,
	               |	Итоговая.ДатаРаскредитации КАК ДатаРаскредитации,
	               |	Итоговая.ДатаПогранПереходаВход КАК ДатаПогранПереходаВход,
	               |	Итоговая.ДатаПогранПереходаВыход КАК ДатаПогранПереходаВыход,
	               |	Итоговая.Соглашение КАК Соглашение,
	               |	Итоговая.Плательщик КАК Плательщик,
	               |	Итоговая.ВидОтправки КАК ВидОтправки,
	               |	Итоговая.РодВагона КАК РодВагона,
	               |	Итоговая.ТипСобственности КАК СобственностьВагона,
	               |	Итоговая.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	               |	Итоговая.Грузоотправитель КАК Грузоотправитель,
	               |	Итоговая.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	               |	Итоговая.Грузополучатель КАК Грузополучатель,
	               |	Итоговая.КодИсключительногоТарифа КАК КодИсключительногоТарифа,
	               |	Итоговая.ГУ12 КАК ГУ12,
	               |	Итоговая.ПунктОтправления КАК ПунктОтправления,
	               |	Итоговая.ПортОтправления КАК ПортОтправления,
	               |	Итоговая.СтранаОтправления КАК СтранаОтправления,
	               |	Итоговая.ПунктНазначения КАК ПунктНазначения,
	               |	Итоговая.ПортНазначения КАК ПортНазначения,
	               |	Итоговая.СтранаНазначения КАК СтранаНазначения,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, начало (реквизиты из документа удалены, комментируем код)
	               //|	Итоговая.Контроль КАК Контроль,
	               //|	Итоговая.КонтрольУстановил КАК КонтрольУстановил,
	               //|	Итоговая.КомментарийИзМакета КАК КомментарийИзМакета,
	               //|	Итоговая.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
				   //ДИТ, Беляев СЮ, Ticket#0296744, 30-12-2022, конец
	               |	Итоговая.КонтейнерСсылка КАК КонтейнерСсылка,
	               |	Итоговая.Проведен КАК Проведен,
	               |	Итоговая.ВагонСсылка КАК ВагонСсылка,
	               |	Итоговая.НомерЗПУ КАК НомерЗПУ,
	               |	Итоговая.НомерНакладной КАК НомерНакладной,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(Итоговая.ТипСобственности.Наименование, 0, 5) = ""Аренд""
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК СданВАренду,
	               |	ВЫБОР
	               |		КОГДА Итоговая.Плательщик В
	               |				(ВЫБРАТЬ
	               |					орг.НаименованиеДляНакладной
	               |				ИЗ
	               |					Справочник.Организации КАК орг)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПлательщикЕвросиб,
	               |	ПаспортаВагоновСрезПоследних.ДлинаПоОсямАвтосцепки КАК ДлинаПоОсямАвтосцепки,
	               |	Итоговая.Ремонт КАК НакладнаяРемонт,
	               |	Организации.Ссылка КАК ГПЕвросиб,
	               |	Итоговая.ГОЕвросиб КАК ГОЕвросиб,
	               |	Итоговая.КонтейнерныйПоезд КАК КонтейнерныйПоезд,
	               |	Итоговая.НакладнаяДействительна КАК НакладнаяДействительна,
	               |	Итоговая.СуммаПоОтправлению КАК СуммаТарифа,
	               |	Итоговая.СуммаПоРаскредитации КАК СуммаПоРаскредитации,
	               |	Итоговая.КлассГруза КАК КлассГруза,
				   // Евросиб Фролов (08.04.2022 Task №48889
				   |	Итоговая.IDДокумента КАК НакладнаяИД
				   // Евросиб Фролов)
	               |ИЗ
	               |	ИтогСвернСборные КАК Итоговая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |		ПО Итоговая.Вагон = ПаспортаВагоновСрезПоследних.Вагон.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО Итоговая.Плательщик = Контрагенты.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО Итоговая.ОКПОГрузополучателя = Организации.ОКПО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ВТСделки.Документ КАК Документ
	               |		ИЗ
	               |			ВТСделки КАК ВТСделки) КАК Сделки
	               |		ПО Итоговая.Документ = Сделки.Документ
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(Итоговая.КонтейнерСсылка.ПометкаУдаления, ЛОЖЬ)
	               |	И НЕ Итоговая.ДатаИмпорта = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И &СписокКонечныхОтборов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Итоговая.IDДокумента УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Сделки.Сделка КАК Сделка,
	               |	Сделки.СчетФактура КАК СчетФактура,
	               |	Сделки.Клиент КАК Клиент,
	               |	Сделки.Договор КАК Договор,
	               |	Сделки.Калькуляция КАК Калькуляция,
	               |	Сделки.Исполнитель КАК Исполнитель,
	               |	Сделки.IDДокумента КАК IDДокумента,
	               |	Сделки.НомерНакладной КАК НомерНакладной,
	               |	Сделки.Документ КАК Документ,
	               |	Сделки.Протокол КАК Протокол,
				   // Евросиб Фролов (23.11.2021 Ticket№ 0244435
				   |	Сделки.Доплата_ПСЦ КАК Доплата_ПСЦ
				   // Евросиб Фролов)
	               |ИЗ
	               |	ВТСделки КАК Сделки";
	Если СписокКонечныхОтборов <> "" Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СписокКонечныхОтборов", СписокКонечныхОтборов);
	
	КонецЕсли; 
	Если СписокОтборов <> "" Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СписокОтборов", СписокОтборов);
	
	КонецЕсли; 
	Если СокрЛП(ПарОтборыВыбиратьЗаписей) = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 200", "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10000");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 200", "ВЫБРАТЬ РАЗЛИЧНЫЕ" + ПарОтборыВыбиратьЗаписей);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ГрузСборный", Константы.ЕТСНГ_СборныйГрузДляСверткиНакладных.Получить() );
	
	МассивОтвета = Новый Массив;
	//Евросиб Каблов 11.12.2020 ( Ticket#0216886
	//ОтветВыполнить = Запрос.Выполнить();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатыЗапроса.Количество() - 1;
	ТаблицаСделок = РезультатыЗапроса[ИндексПоследнегоЗапроса].Выгрузить();
	ТаблицаСделок.Индексы.Добавить("Документ");
	ОтветВыполнить = РезультатыЗапроса[ИндексПоследнегоЗапроса - 1];
	//Евросиб Каблов 11.12.2020 )
	
	ОписаниеПолучившейсяСтруктуры = "";
	Для каждого Колонка из ОтветВыполнить.Колонки Цикл
		ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + Колонка.Имя;
	КонецЦикла;
	
	//Евросиб Каблов 11.12.2020 ( Ticket#0216886
	ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ",Сделки,СчетаФактуры,Клиенты,Договоры,Протоколы,Калькуляции,Исполнители";
	//Евросиб Каблов 11.12.2020 )
	
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ",ДоплатныеПСЦ";
	// Евросиб Фролов)
	
	Ответ = ОтветВыполнить.Выбрать();
	Пока Ответ.Следующий() Цикл
		ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
		ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Ответ);
		//Евросиб Каблов 11.12.2020 ( Ticket#0216886
		Сделки = ТаблицаСделок.НайтиСтроки(Новый Структура("Документ", Ответ.Документ));
		Если Сделки.Количество() > 0 Тогда
			ЭлементСтруктура.Сделки = Новый СписокЗначений;
			ЭлементСтруктура.СчетаФактуры = Новый СписокЗначений;
			ЭлементСтруктура.Клиенты = Новый СписокЗначений;
			ЭлементСтруктура.Договоры = Новый СписокЗначений;
			ЭлементСтруктура.Протоколы = Новый СписокЗначений;
			ЭлементСтруктура.Калькуляции = Новый СписокЗначений;
			ЭлементСтруктура.Исполнители = Новый СписокЗначений;
			// Евросиб Фролов (23.11.2021 Ticket№ 0244435
			ЭлементСтруктура.ДоплатныеПСЦ = Новый СписокЗначений;
			// Евросиб Фролов)
			Для Каждого ДанныеСделки Из Сделки Цикл
				ЭлементСтруктура.Сделки.Добавить(ДанныеСделки.Сделка);
				Если ЗначениеЗаполнено(ДанныеСделки.СчетФактура) Тогда
					//ЭлементСтруктура.СчетаФактуры.Добавить(ДанныеСделки.СчетФактура);
					//ДИТ Шевченко А.В. Ticket#0276731 17.08.2022 -начало
					ТипДок = ?(ТипЗнч(ДанныеСделки.СчетФактура) = Тип("ДокументСсылка.РеализацияТоваровУслуг"),"РТУ № ","СФ № ");
					Представление = ТипДок + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеСделки.СчетФактура.Номер) + " от " + Формат(ДанныеСделки.СчетФактура.Дата,"ДФ=dd.MM.yy");
					ЭлементСтруктура.СчетаФактуры.Добавить(ДанныеСделки.СчетФактура,Представление);
					//ДИТ Шевченко А.В. Ticket#0276731 17.08.2022 -конец
				КонецЕсли;
				Если ЭлементСтруктура.Клиенты.НайтиПоЗначению(ДанныеСделки.Клиент) = Неопределено Тогда
					ЭлементСтруктура.Клиенты.Добавить(ДанныеСделки.Клиент);
				КонецЕсли;
				Если ЭлементСтруктура.Договоры.НайтиПоЗначению(ДанныеСделки.Договор) = Неопределено Тогда
					ЭлементСтруктура.Договоры.Добавить(ДанныеСделки.Договор);
				КонецЕсли;
				Если ЭлементСтруктура.Протоколы.НайтиПоЗначению(ДанныеСделки.Протокол) = Неопределено Тогда
					ЭлементСтруктура.Протоколы.Добавить(ДанныеСделки.Протокол);
				КонецЕсли;
				Если ЭлементСтруктура.Калькуляции.НайтиПоЗначению(ДанныеСделки.Калькуляция) = Неопределено Тогда
					ЭлементСтруктура.Калькуляции.Добавить(ДанныеСделки.Калькуляция);
				КонецЕсли;
				Если ЭлементСтруктура.Исполнители.НайтиПоЗначению(ДанныеСделки.Исполнитель) = Неопределено Тогда
					ЭлементСтруктура.Исполнители.Добавить(ДанныеСделки.Исполнитель);
				КонецЕсли;
				// Евросиб Фролов (23.11.2021 Ticket№ 0244435
				Если ЭлементСтруктура.ДоплатныеПСЦ.НайтиПоЗначению(ДанныеСделки.Доплата_ПСЦ) = Неопределено
					И ЗначениеЗаполнено(ДанныеСделки.Доплата_ПСЦ) Тогда
					//ЭлементСтруктура.ДоплатныеПСЦ.Добавить(ДанныеСделки.Доплата_ПСЦ);
					//ДИТ Шевченко А.В. Ticket#0276731 17.08.2022 -начало
					Представление = "ПСЦ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеСделки.Доплата_ПСЦ.Номер) + " от " + Формат(ДанныеСделки.Доплата_ПСЦ.Дата,"ДФ=dd.MM.yy");
					ЭлементСтруктура.ДоплатныеПСЦ.Добавить(ДанныеСделки.Доплата_ПСЦ,Представление);
					//ДИТ Шевченко А.В. Ticket#0276731 17.08.2022 -конец
				КонецЕсли;
				// Евросиб Фролов)
			КонецЦикла;
		КонецЕсли;
		//Евросиб Каблов 11.12.2020 )
		МассивОтвета.Добавить(ЭлементСтруктура);
	КонецЦикла;

	Возврат МассивОтвета;
	
КонецФункции

&НаКлиенте
Процедура ТЗНакладныеПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДанныхПоНакладной()
	// если было изменено одно из полей ТЗ (контроль, контрольустановил, комментарийизмакета, ответственныйменеджер),
	// необходимо изменить все строки по данной накладной (их может быть несколько)
	ТекД = Элементы.ТЗНакладные.ТекущиеДанные;
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекД.ДанныеИзменены = Истина;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Документ",ТекД.Документ);
	НайденныеНакладные = ТЗНакладные.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из НайденныеНакладные Цикл
		ЗаполнитьЗначенияСвойств(Стр,ТекД,"Контроль,КонтрольУстановил,КомментарийИзМакета,ОтветственныйМенеджер,ДанныеИзменены");
	КонецЦикла;
	
	МассивСтруктур = Новый Массив;
	// проверка изменения данным по накладным
	Если ЗначениеЗаполнено(ТекД.Контроль) И ЗначениеЗаполнено(ТекД.ОтветственныйМенеджер) Тогда
		Для Каждого Стр Из НайденныеНакладные Цикл
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Документ",Стр.Документ);
			СтруктураСтроки.Вставить("Контроль",Стр.Контроль);
			СтруктураСтроки.Вставить("КонтрольУстановил",Стр.КонтрольУстановил);
			СтруктураСтроки.Вставить("КомментарийИзМакета",Стр.КомментарийИзМакета);
			СтруктураСтроки.Вставить("ОтветственныйМенеджер",Стр.ОтветственныйМенеджер);
			
			МассивСтруктур.Добавить(СтруктураСтроки);
		КонецЦикла;
		СохранитьНакладные(МассивСтруктур);
	КонецЕсли;
	
	// если установлена сделка, но в ней не заполнен договор с клиентом, протокол, калькуляция - изменить
	Если ЗначениеЗаполнено(ТекД.Сделка) Тогда
		ПроверкаСделки(ТекД.Сделка,ТекД.Договор,ТекД.Калькуляция,ТекД.Вагон,ТекД.Контейнер);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверкаСделки(ТекСделка,ТекДоговор,ТекКалькуляция,ТекВагон,ТекКонтейнер)
	
	// цикл для каждой выбранной сделки.
	// находим в ней подходящий номер вагона или контейнера и записываем в найденную строку номер накладной
	ПолучОб = ТекСделка.ПолучитьОбъект();
	ТЧ = ПолучОб.СвязьУчетныхЕдиниц;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Вагон",Справочники.ТС.НайтиПоНаименованию(ТекВагон));
	НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ПараметрыОтбора2 = Новый Структура;
		ПараметрыОтбора2.Вставить("Контейнер", РаботаСКонтейнерамиСервер.НайтиКТК(ТекКонтейнер)); //Справочники.ТЕ.НайтиПоНаименованию(ТекКонтейнер));
		НайденныеСтроки2 = ТЧ.НайтиСтроки(ПараметрыОтбора2);
		Если НайденныеСтроки2.Количество()>0 Тогда
			Если НЕ ЗначениеЗаполнено(НайденныеСтроки2[0].Договор) ТОгда
				НайденныеСтроки2[0].Договор = ТекДоговор;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НайденныеСтроки2[0].Калькуляция) ТОгда
				НайденныеСтроки2[0].Калькуляция = ТекКалькуляция;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(НайденныеСтроки[0].Договор) ТОгда
			НайденныеСтроки[0].Договор = ТекДоговор;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НайденныеСтроки[0].Калькуляция) ТОгда
			НайденныеСтроки[0].Калькуляция = ТекКалькуляция;
		КонецЕсли;
	КонецЕсли;

	Попытка
		ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПолучОб.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблон(Команда)
	
	// заполнить ТЗ реквизитов (кроме тч)
	
	СтруктураРеквизитов = новый Массив;
	ЗаполнитьТЗРеквизитовКлиент(Элементы.ГруппаШапка, СтруктураРеквизитов);
	
	Если Команда.Имя = "СохранитьШаблон" Тогда
	
		Если ЗначениеЗаполнено(ШаблоныОтборов) Тогда
			
			ШаблоныОтборов = ЗанестиДанныеВСправочник(ШаблоныОтборов,Неопределено,СтруктураРеквизитов);
			
		Иначе
			Подсказка = "Введите наименование шаблона";
			Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма, СтруктураРеквизитов);
			ПоказатьВводСтроки(Оповещение, "", Подсказка, 150, Ложь);
		КонецЕсли;
	Иначе
		Подсказка = "Введите наименование шаблона";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма, СтруктураРеквизитов);
		ПоказатьВводСтроки(Оповещение, "", Подсказка, 150, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗРеквизитовКлиент(РодительскаяГруппа, СтруктураР)
	
	Для каждого Стр из РодительскаяГруппа.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Стр) = Тип("ГруппаФормы") Тогда
			ЗаполнитьТЗРеквизитовКлиент(Стр, СтруктураР);
		ИначеЕсли ТипЗнч(Стр) = Тип("ПолеФормы") Тогда
			Попытка
				Если ТипЗнч(ЭтаФорма[Стр.Имя]) = Тип("СписокЗначений") Тогда
					ТекЗначРеквизита = ЭтаФорма[Стр.Имя].ВыгрузитьЗначения();
				Иначе
					ТекЗначРеквизита = ЭтаФорма[Стр.Имя];
				КонецЕсли;
				СтруктураР.Добавить(Новый Структура("ИмяРеквизита, ЗаголовокРеквизита, ЗначениеРеквизита", Стр.Имя, Стр.Заголовок, ТекЗначРеквизита));
			Исключение
				Сообщить("Для элемента " + Стр.Имя + " не обнаружено соответствующего реквизита!");
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТипПлательщика) Тогда
		ТипПлательщика = ПредопределенноеЗначение("Перечисление.ТипыПлательщиков.ВсеПлательщики");
	КонецЕсли;
	
	ВагоныТЕУ = Элементы.ВагоныТЕУ.СписокВыбора[0].Значение;
	ТипРейса = Элементы.ТипРейса.СписокВыбора[0].Значение;
	
	ДоступностьВыбораПлательщика();
	
	Если ВыполнитьПоискПриОткрытии Тогда
		Поиск(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьВыбораПлательщика()
	Если ТипПлательщика = ПредопределенноеЗначение("Перечисление.ТипыПлательщиков.ВыбранныеПлательщики") Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Элементы.Плательщик.Доступность = Ложь;
		Плательщик = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипПлательщикаПриИзменении(Элемент)
	ДоступностьВыбораПлательщика();
КонецПроцедуры

&НаКлиенте
Процедура ТЗНакладныеКонтрольПриИзменении(Элемент)
	
	ТекД = Элементы.ТЗНакладные.ТекущиеДанные;
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.Контроль) Тогда
		ТекД.КонтрольУстановил = ПользователиКлиент.ТекущийПользователь();
	Иначе
		ТекД.КонтрольУстановил = "";
	КонецЕсли;
	
	ИзменениеДанныхПоНакладной();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтанцияНазначения.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	
	СтанцияОтправления.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	//Элементы.СтанцияНазначения.ДоступныеТипы = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	//Элементы.СтанцияНазначения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	//Элементы.СтанцияНазначения.РазрешитьСоставнойТип = Ложь;
	//
	//Элементы.СтанцияОтправления.ДоступныеТипы = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	//Элементы.СтанцияОтправления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.э_Станции");
	//Элементы.СтанцияОтправления.РазрешитьСоставнойТип = Ложь;
	
	//Евросиб Каблов 25.09.2020 ( Ticket#0208129
	ЗначениеПараметра = Неопределено;
	Если Параметры.Свойство("ПодборВДокумент", ЗначениеПараметра) И ТипЗнч(ЗначениеПараметра) = Тип("Булево") Тогда
		Элементы.ФормаПеренестиВыбранныеСтрокиВДокумент.Видимость = ЗначениеПараметра;
	КонецЕсли;
	Параметры.Свойство("МаксимальноеКоличествоВыбранныхСтрок", МаксимальноеКоличествоВыбранныхСтрок);
	Параметры.Свойство("ПодборКонтейнеров", ПодборКонтейнеров);
	
	Если Параметры.Свойство("Грузоотправитель", ЗначениеПараметра) Тогда
		Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ОКПОГрузоотправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПараметра, "КодПоОКПО");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Грузополучатель", ЗначениеПараметра) Тогда
		Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ОКПОГрузополучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПараметра, "КодПоОКПО");
		КонецЕсли;
	КонецЕсли;
	
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	Если Параметры.Свойство("ДатаНачала", ДатаНачала) И Параметры.Свойство("ДатаОкончания", ДатаОкончания) Тогда
		ПериодПеревозки.ДатаНачала = ДатаНачала;
		ПериодПеревозки.ДатаОкончания = ДатаОкончания;
	КонецЕсли;	
	//Евросиб Каблов 25.09.2020 )
	
	//Евросиб Каблов 24.10.2020 ( Ticket#0211298
	ЗначениеПараметра = Неопределено;
	Параметры.Свойство("СтанцияОтправления", ЗначениеПараметра);
	Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Локации") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	э_Станции.Ссылка КАК Станция
		|ИЗ
		|	Справочник.Локации КАК Локации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
		|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
		|ГДЕ
		|	Локации.Ссылка = &Локация";
		Запрос.УстановитьПараметр("Локация", ЗначениеПараметра);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтанцияОтправления = Выборка.Станция;
		КонецЕсли;
	Иначе
		СтанцияОтправления = ЗначениеПараметра;
	КонецЕсли;
	
	Параметры.Свойство("СтанцияНазначения", ЗначениеПараметра);
	Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Локации") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	э_Станции.Ссылка КАК Станция
		|ИЗ
		|	Справочник.Локации КАК Локации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
		|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
		|ГДЕ
		|	Локации.Ссылка = &Локация";
		Запрос.УстановитьПараметр("Локация", ЗначениеПараметра);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтанцияНазначения = Выборка.Станция;
		КонецЕсли;
	Иначе
		СтанцияНазначения = ЗначениеПараметра;
	КонецЕсли;
	
	Параметры.Свойство("ВыполнитьПоискПриОткрытии", ВыполнитьПоискПриОткрытии);
	//Евросиб Каблов 24.10.2020 )
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныОтборовНакладных.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШаблоныОтборовНакладных КАК ШаблоныОтборовНакладных
	               |ГДЕ
	               |	ШаблоныОтборовНакладных.Пользователь = &Пользователь
	               |	И ШаблоныОтборовНакладных.СделатьОсновным";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ШаблоныОтборов = Выборка.Ссылка;
		// заполнить все сохраненные фильтры
		ТЧ = ШаблоныОтборов.СписокПолейОтборов;
		Для Каждого Стр Из ТЧ Цикл
			ЭтаФорма[Стр.НаименованиеПоляВСистеме] = Стр.СохраненноеЗначение.Получить();
	    КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбиратьЗаписей) Тогда
		ВыбиратьЗаписей = 200;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныОтборовПриИзменении(Элемент)
	
	СтруктураПолейШаблона = ШаблоныОтборовПриИзмененииНаСервере(ШаблоныОтборов);

	Для Каждого Стр Из СтруктураПолейШаблона Цикл
		Если Стр.НаименованиеПоляВСистеме = "НомерВагона" ИЛИ
			Стр.НаименованиеПоляВСистеме = "НомерДокумента" ИЛИ
			Стр.НаименованиеПоляВСистеме = "НомерКонтейнера" тогда
			СписокЭл = Новый СписокЗначений;
			СписокЭл.ЗагрузитьЗначения(Стр.СохраненноеЗначение);
			ЭтаФорма[Стр.НаименованиеПоляВСистеме] = СписокЭл;
			
			Если Стр.НаименованиеПоляВСистеме = "НомерДокумента" Тогда
				ЭтаФорма[Стр.НаименованиеПоляВСистеме].ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.э_Накладная");
			КонецЕсли;
			//Если Стр.НаименованиеПоляВСистеме = "НомерВагона" Тогда
			//	ЭтаФорма[Стр.НаименованиеПоляВСистеме].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ТС");
			//ИначеЕсли Стр.НаименованиеПоляВСистеме = "НомерДокумента" Тогда
			//	ЭтаФорма[Стр.НаименованиеПоляВСистеме].ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.э_Накладная");
			//ИначеЕсли Стр.НаименованиеПоляВСистеме = "НомерКонтейнера" Тогда
			//	ЭтаФорма[Стр.НаименованиеПоляВСистеме].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ТЕ");
			//КонецЕсли;
			
		Иначе
			ЭтаФорма[Стр.НаименованиеПоляВСистеме] = Стр.СохраненноеЗначение;
		КонецЕсли;
		
    КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблоныОтборовПриИзмененииНаСервере(ВыбранныйШаблон)
	
	МассивОтвета = Новый Массив;
	// заполнить все сохраненные фильтры
	ТЧ = ВыбранныйШаблон.СписокПолейОтборов.Выгрузить();
	Для каждого Колонка из ТЧ.Колонки Цикл
		ОписаниеПолучившейсяСтруктуры = Строка(ОписаниеПолучившейсяСтруктуры) + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + Строка(Колонка.Имя);
	КонецЦикла;
	
	Для Каждого Стр иЗ ТЧ Цикл
		Если Стр.НаименованиеПоляВСистеме = "ШаблоныОтборов" Тогда
			Продолжить;
		КонецЕсли;
		ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
		ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Стр,,"СохраненноеЗначение");
		ЭлементСтруктура.Вставить("СохраненноеЗначение",Стр.СохраненноеЗначение.Получить());
		МассивОтвета.Добавить(ЭлементСтруктура);
	КонецЦикла;
	
	Возврат МассивОтвета;
	
КонецФункции	


&НаКлиенте
Процедура РаспределитьВСделки(Команда)
	
	//Евросиб Каблов 14.09.2020 (
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Отметка",Истина);
	//НайденныеСтроки = ТЗНакладные.НайтиСтроки(ПараметрыОтбора);
	//МассивСтруктур = Новый Массив;
	//Для Каждого Стр Из НайденныеСтроки Цикл
	//	СтруктураСтроки = Новый Структура;
	//	СтруктураСтроки.Вставить("Контейнер",Стр.Контейнер);
	//	СтруктураСтроки.Вставить("Вагон",Стр.Вагон);
	//	СтруктураСтроки.Вставить("СтанцияОтправления",Стр.СтанцияОтправления);
	//	СтруктураСтроки.Вставить("СтанцияНазначения",Стр.СтанцияНазначения);
	//	СтруктураСтроки.Вставить("Документ",Стр.Документ);
	//	СтруктураСтроки.Вставить("ВесГруза",Стр.ВесГруза);
	//	
	//	МассивСтруктур.Добавить(СтруктураСтроки);
	//КонецЦикла;
	//МассивСделок = НайтиПодходящиеСделки(МассивСтруктур);	

	//ПараметрыОтбора2 = Новый Структура;
	//ПараметрыОтбора2.Вставить("МассивСделок",МассивСделок);
	
	//ОпОп = Новый ОписаниеОповещения("ОбработкаРазнесенияНакладных", ЭтаФорма, МассивСтруктур);
	//ОткрытьФорму("Документ.э_Накладная.Форма.ФормаПодбораСделки",ПараметрыОтбора2, , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ДанныеДляРазнесенния = ПодготовитьДанныеДляРазнесенияНакладных();
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("МассивСделок", ДанныеДляРазнесенния.МассивПодходящихСделок);
	
	ОповещениеОВыбореНакладных = Новый ОписаниеОповещения("ОбработкаРазнесенияНакладных", ЭтаФорма, ДанныеДляРазнесенния.АдресТаблицыНакладных);
	ОткрытьФорму("Документ.э_Накладная.Форма.ФормаПодбораСделки", ПараметрыФормыПодбора, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОВыбореНакладных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб Каблов 14.09.2020 )	
	
КонецПроцедуры

//Евросиб Каблов 14.09.2020
&НаСервере
Функция ПодготовитьДанныеДляРазнесенияНакладных()
	
	ДанныеДляРазнесения = Новый Структура;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	ТаблицаВыбранныхНакладных = ТЗНакладные.Выгрузить(ПараметрыОтбора);	
	АдресТаблицыНакладных = ПоместитьВоВременноеХранилище(ТаблицаВыбранныхНакладных, УникальныйИдентификатор);	
	ДанныеДляРазнесения.Вставить("АдресТаблицыНакладных", АдресТаблицыНакладных);
	
	МассивПодходящихСделок = НайтиПодходящиеСделки(ТаблицаВыбранныхНакладных);
	ДанныеДляРазнесения.Вставить("МассивПодходящихСделок", МассивПодходящихСделок);
	
	Возврат ДанныеДляРазнесения;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРазнесенияНакладных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	// Записать данные в сделку
	ЗаписатьНакладнуюВСделку(параметр1,Параметр2);
	
	ТЗНакладные.Очистить();
	
	ОбновитьТаблицуНаФорме();
	
	Сообщить("Разнесение выполнено!");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНакладнуюВСделку(МассивСделок, АдресТаблицыНакладных) 
	
	//Евросиб Каблов 14.09.2020 (
	ВыбранныеНакладные = ПолучитьИзВременногоХранилища(АдресТаблицыНакладных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНакладных", ВыбранныеНакладные);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаНакладных.Контейнер КАК Контейнер,
	               |	ТаблицаНакладных.Вагон КАК Вагон,
	               |	ТаблицаНакладных.Документ КАК Документ,
	               |	ТаблицаНакладных.ВесГруза КАК ВесГруза,
	               |	ТаблицаНакладных.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	               |	ТаблицаНакладных.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	               |	ТаблицаНакладных.ГОЕвросиб КАК ГОЕвросиб,
	               |	ТаблицаНакладных.ГПЕвросиб КАК ГПЕвросиб
	               |ПОМЕСТИТЬ ВТНакладные
	               |ИЗ
	               |	&ТаблицаНакладных КАК ТаблицаНакладных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТНакладные.Контейнер КАК Контейнер,
	               |	ВТНакладные.Вагон КАК Вагон,
	               |	ВТНакладные.Документ КАК Документ,
	               |	ВТНакладные.ВесГруза КАК ВесГруза,
	               |	ВТНакладные.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	               |	ВТНакладные.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	               |	э_Накладная.Номер КАК НомерНакладной,
	               |	СпрКонтейнеры.Ссылка КАК КонтейнерСсылка,
	               |	ТС.Ссылка КАК ВагонСсылка,
	               |	ТранспортныйДокумент.Ссылка КАК ТранспортныйДокументСсылка,
	               |	ЕСТЬNULL(КонтрагентыГрузополучателиЕвросиб.Ссылка, КонтрагентыГрузополучатели.Ссылка) КАК ГрузополучательСсылка,
	               |	ЕСТЬNULL(КонтрагентыГрузоотправителиЕвросиб.Ссылка, КонтрагентыГрузоотправители.Ссылка) КАК ГрузоотправительСсылка,
	               |	СпрКонтейнеры.ТипТЕ КАК ТипКонтейнера,
	               |	СпрКонтейнеры.ТипТЕ.РазмерКТК КАК РазмерКонтейнера
	               |ИЗ
	               |	ВТНакладные КАК ВТНакладные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	               |		ПО ВТНакладные.Документ = э_Накладная.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |		ПО ВТНакладные.Документ = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК СпрКонтейнеры
	               |		ПО ВТНакладные.Контейнер = СпрКонтейнеры.Наименование
	               |			И (НЕ СпрКонтейнеры.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	               |		ПО ВТНакладные.Вагон = ТС.Наименование
	               |			И (НЕ ТС.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузоотправители
	               |		ПО ВТНакладные.ОКПОГрузоотправителя = КонтрагентыГрузоотправители.КодПоОКПО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузополучатели
	               |		ПО ВТНакладные.ОКПОГрузополучателя = КонтрагентыГрузополучатели.КодПоОКПО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииГрузоотправители
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузоотправителиЕвросиб
	               |			ПО ОрганизацииГрузоотправители.ОКПО = КонтрагентыГрузоотправителиЕвросиб.КодПоОКПО
	               |		ПО ВТНакладные.ГОЕвросиб = ОрганизацииГрузоотправители.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииГрузополучатели
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузополучателиЕвросиб
	               |			ПО ОрганизацииГрузополучатели.ОКПО = КонтрагентыГрузополучателиЕвросиб.КодПоОКПО
	               |		ПО ВТНакладные.ГПЕвросиб = ОрганизацииГрузополучатели.Ссылка";
	
	ВыбранныеНакладные = Запрос.Выполнить().Выгрузить();
	//Евросиб Каблов 14.09.2020 )
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)

	// цикл для каждой выбранной сделки.
	// находим в ней подходящий номер вагона или контейнера и записываем в найденную строку номер накладной	
	Для Каждого Элем Из МассивСделок Цикл		
		
		ПолучОб = Элем.ПолучитьОбъект();
		ТЧ = ПолучОб.СвязьУчетныхЕдиниц;
		
		Для Каждого Стр Из ВыбранныеНакладные Цикл
			
			НСтр = ТЧ.Добавить();
			
			Если ЗначениеЗаполнено(Стр.КонтейнерСсылка) Тогда
				
				НСтр.Контейнер = Стр.КонтейнерСсылка;
				НСтр.РазмерКТК = Стр.РазмерКонтейнера;
				
			Иначе
				
				НСтр.Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(Стр.Контейнер, Справочники.ТипоразмерыТЕ.ПустаяСсылка());
				НСтр.РазмерКТК = НСтр.Контейнер.ТипТЕ.РазмерКТК;
				
				Стр.КонтейнерСсылка = НСтр.Контейнер;
				Стр.РазмерКонтейнера = НСтр.РазмерКТК;
				
				// Евросиб Фролов (26.10.2021 Ticket№ 41408
				МассивСозданныхКТК.Добавить(НСтр.Контейнер);
				// Евросиб Фролов)
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.ВагонСсылка) Тогда
				НСтр.Вагон = Стр.ВагонСсылка;
			Иначе
				НСтр.Вагон = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Стр.Вагон, Истина);
			КонецЕсли;
			НСтр.НомерЖДН = Стр.НомерНакладной;
			
			Если ЗначениеЗаполнено(Стр.ТранспортныйДокументСсылка) Тогда
				НСтр.ЖДН = Стр.ТранспортныйДокументСсылка;
			Иначе
				НСтр.ЖДН = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НСтр.НомерЖДН, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
			КонецЕсли;
			
			НСтр.ПравилоГотовностиКВыставлению = Перечисления.ПравилоГотовностиКВыставлению.Вручную;
			НСтр.ВесГрузаНетто = Стр.ВесГруза;
			НСтр.Груженый = (НСтр.ВесГрузаНетто > 0);
			
		КонецЦикла;
		
		////Для Каждого Стр Из ВыбранныеНакладные Цикл
		////	ПараметрыОтбора = Новый Структура;
		////	ПараметрыОтбора.Вставить("Вагон",Справочники.ТС.НайтиПоНаименованию(Стр.Вагон));
		////	НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
		////	Если НайденныеСтроки.Количество() = 0 Тогда
		////		ПараметрыОтбора2 = Новый Структура;
		////		ПараметрыОтбора2.Вставить("Контейнер",Справочники.ТЕ.НайтиПоНаименованию(Стр.Контейнер));
		////		НайденныеСтроки2 = ТЧ.НайтиСтроки(ПараметрыОтбора2);
		////		Если НайденныеСтроки2.Количество()>0 Тогда
		////			НайденныеСтроки2[0].НомерЖДН = Стр.Документ.Номер;
		////			//Стр.Сделка = ПолучОб.Ссылка;
		////			//Стр.Клиент = НайденныеСтроки[0].Клиент;
		////			//Стр.Договор = НайденныеСтроки[0].Договор;
		////			//Стр.Калькуляция = НайденныеСтроки[0].Калькуляция;
		////			//Стр.Исполнитель = ПолучОб.Автор;
		////		КонецЕсли;
		////	Иначе
		////		НайденныеСтроки[0].НомерЖДН = Стр.Документ.Номер;
		////		//Стр.Сделка = ПолучОб.Ссылка;
		////		//Стр.Клиент = НайденныеСтроки[0].Клиент;
		////		//Стр.Договор = НайденныеСтроки[0].Договор;
		////		//Стр.Калькуляция = НайденныеСтроки[0].Калькуляция;
		////		//Стр.Исполнитель = ПолучОб.Автор;
		////	КонецЕсли;
		////КонецЦикла;
		
		
		Попытка
			ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ПолучОб.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		////Евросиб Каблов 14.09.2020 (
		//Запрос.Текст =
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	СделкаЗаявки.Заявка КАК Заявка,
		//|	СделкаЗаявки.Заявка.Грузоотправитель КАК Грузоотправитель
		//|ИЗ
		//|	Документ.Сделка.Заявки КАК СделкаЗаявки
		//|ГДЕ
		//|	СделкаЗаявки.Ссылка В(&Сделки)
		//|	И СделкаЗаявки.Заявка.Контрагент = &СибурКонтрагент";
		//Запрос.УстановитьПараметр("Сделки", МассивСделок);
		//Запрос.УстановитьПараметр("СибурКонтрагент", Константы.СибурКонтрагент.Получить());
		//ЗаявкиСибур = Запрос.Выполнить().Выгрузить();
		//
		//Для Каждого СтрокаПоЗаявке Из ЗаявкиСибур Цикл
		//	
		//	ЗаявкаОбъект = СтрокаПоЗаявке.Заявка.ПолучитьОбъект();
		//	ЗаписатьИзмененияЗаявки = Ложь;
		//	Для Каждого Стр Из ВыбранныеНакладные Цикл
		//		
		//		Если Стр.ГрузоотправительСсылка <> ЗаявкаОбъект.Грузоотправитель Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		
		//		СтрокиПоКонтейнеру = ЗаявкаОбъект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", Стр.КонтейнерСсылка));
		//		Если СтрокиПоКонтейнеру.Количество() > 0 Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		
		//		СтрокиБезКонтейнера = ЗаявкаОбъект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК, Грузополучатель, РазмерКТК", Справочники.ТЕ.ПустаяСсылка(), Стр.ГрузополучательСсылка, НСтр.РазмерКТК));
		//		Если СтрокиБезКонтейнера.Количество() > 0 Тогда
		//			СтрокаЗаявки = СтрокиБезКонтейнера[0];
		//			СтрокаЗаявки.НомерКТК = Стр.КонтейнерСсылка;
		//			СтрокаЗаявки.ТипКТК = Стр.ТипКонтейнера;
		//			ЗаписатьИзмененияЗаявки = Истина;
		//		//ИначеЕсли Стр.Груженый = СтрокаПоЗаявке.ЭтоЗаявкаНаГруженыеКонтейнеры Тогда
		//		//	СтрокаЗаявки = ЗаявкаОбъект.СоставУслуги.Добавить();					
		//		//	СтрокаЗаявки.РазмерКТК = Стр.РазмерКонтейнера;
		//		//	СтрокаЗаявки.НомерКТК = Стр.КонтейнерСсылка;
		//		//	СтрокаЗаявки.ТипКТК = Стр.ТипКонтейнера;
		//		//	//СтрокаЗаявки.ПунктОтправления = ПунктОтправления;
		//		//	//СтрокаЗаявки.ПунктНазначения = ПунктНазначения;
		//		//	СтрокаЗаявки.Груженый = Стр.Груженый;
		//		//	ЗаписатьИзмененияЗаявки = Истина;
		//		КонецЕсли;
		//						
		//	КонецЦикла;
		//	
		//	Если ЗаписатьИзмененияЗаявки Тогда
		//		Если ЗаявкаОбъект.Проведен Тогда
		//			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		//		Иначе
		//			РежимЗаписи = РежимЗаписиДокумента.Запись;
		//		КонецЕсли;
		//		ЗаявкаОбъект.Записать(РежимЗаписи);
		//	КонецЕсли;
		//	
		//КонецЦикла;
		////Евросиб Каблов 14.09.2020 )
	
	КонецЦикла;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, НСтр("ru = 'АРМ ""Накладные""'"));
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуНаФорме()
	
	СтруктураРеквизитов = новый Массив;
	ЗаполнитьТЗРеквизитовКлиент(Элементы.ГруппаШапка, СтруктураРеквизитов);
	МассивСтруктурОтвет = ПоискНаСервере(СтруктураРеквизитов);
	
	// Евросиб Фролов(05.10.2021 
	// Если поиск не выполняли из-за отсутствия отборов, то сообщим пользователю
	Если МассивСтруктурОтвет = Неопределено Тогда
	 	ПоказатьПредупреждение(, "Поиск не выполнен, т.к. не заданы параметры отбора.");
	    Возврат;
	КонецЕсли;
	// Евросиб Фролов)
	
	Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
		ЗаполнитьЗначенияСвойств(ТЗНакладные.Добавить(), ЭлементМассива);
	КонецЦикла;
	
	ТЗНакладные.Индекс("Отметка");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиПодходящиеСделки(ТаблицаВыбранных)
	
	//ТаблицаВыбранных = Новый ТаблицаЗначений;
	//КС = Новый КвалификаторыСтроки(11);
	//Массив = Новый Массив;
	//Массив.Добавить(Тип("Строка"));
	//ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	//ТаблицаВыбранных.Колонки.Добавить("Контейнер",ОписаниеТиповС);
	//ТаблицаВыбранных.Колонки.Добавить("Вагон",ОписаниеТиповС);
	//ТаблицаВыбранных.Колонки.Добавить("СтанцияОтправления",Новый ОписаниеТипов("СправочникСсылка.э_Станции"));
	//ТаблицаВыбранных.Колонки.Добавить("СтанцияНазначения",Новый ОписаниеТипов("СправочникСсылка.э_Станции"));
	//Для Каждого Стр Из МассивНайденныйхСтрок Цикл
	//	НовСтр = ТаблицаВыбранных.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	//КонецЦикла;
	
	МассивСделок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.Контейнер КАК Контейнер,
	               |	ВремТЧ.Вагон КАК Вагон,
	               |	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
	               |	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор КАК СтанцияОтправления,
	               |	Связь_ЭТРАН_DC_Сопоставление1.СпрДатакор КАК СтанцияНазначения,
	               |	ВТ.Контейнер КАК Контейнер,
	               |	ВТ.Вагон КАК Вагон
	               |ПОМЕСТИТЬ СоответствиеСпр
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	               |		ПО ВТ.СтанцияОтправления = Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление1
	               |		ПО ВТ.СтанцияНазначения = Связь_ЭТРАН_DC_Сопоставление1.СпрЭтрана
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ИЗ
	               |	СоответствиеСпр КАК СоответствиеСпр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО (СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления = СоответствиеСпр.СтанцияОтправления)
	               |			И (СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения = СоответствиеСпр.СтанцияНазначения)
	               |			И (СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование = СоответствиеСпр.Контейнер
	               |				ИЛИ СделкаСвязьУчетныхЕдиниц.Вагон.Наименование = СоответствиеСпр.Вагон)
	               |ГДЕ
	               |	НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТаблицаВыбранных);
	МассивСделок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ССылка");
	
	Возврат МассивСделок;
КонецФункции


&НаКлиенте
Процедура ОткрытьНакладную(Команда)
	
	ТекД = Элементы.ТЗНакладные.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекД.Документ) Тогда
			ПоказатьЗначение(, ТекД.Документ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗНакладныеУстановилКонтрольПриИзменении(Элемент)
	
	ИзменениеДанныхПоНакладной();
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗНакладныеКомментарийПриИзменении(Элемент)
	
	ИзменениеДанныхПоНакладной();
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗНакладныеОтветственныйМенеджерПриИзменении(Элемент)
	
	ИзменениеДанныхПоНакладной();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСделку(Команда)
	
	ТекД = Элементы.ТЗНакладные.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		//Евросиб Каблов 11.12.2020 ( Ticket#0216886
		//ПоказатьЗначение(, ТекД.Сделка);
		ОткрытьСделкуТекущейСтроки(ТекД, "Сделки");
		//Евросиб Каблов 11.12.2020 )		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСделкуТекущейСтроки(ТекСтрока, Знач ИмяКолонки)
	
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "ТЗНакладные", "");
	КоличествоСделок = ТекСтрока[ИмяКолонки].Количество();
	Если КоличествоСделок = 1 Тогда
		ПоказатьЗначение(, ТекСтрока[ИмяКолонки][0].Значение);
	ИначеЕсли КоличествоСделок > 1 Тогда
		ОповещениеОВыбореСделки = Новый ОписаниеОповещения("ОбработкаВыбораСделкиИзСписка", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыбореСделки, ТекСтрока[ИмяКолонки]);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 11.12.2020 Ticket#0216886
&НаКлиенте
Процедура ОбработкаВыбораСделкиИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйЭлемент.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	Для Каждого СтрокаТЗ Из ТЗНакладные Цикл
		СтрокаТЗ.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	Для Каждого СтрокаТЗ Из ТЗНакладные Цикл
		СтрокаТЗ.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьВыбранныеСтроки(Команда)
	
	Для каждого Стр из Элементы.ТЗНакладные.ВыделенныеСтроки Цикл
		ТЗНакладные.НайтиПоИдентификатору(Стр).Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьНакладные_ВСуществующуюСделку(Команда)
	
	СписокНакладных = Новый Массив;
	УжеДобавленныеКТК = Новый Массив;
	Для каждого Стр из ТЗНакладные Цикл
		Если Стр.Отметка И УжеДобавленныеКТК.Найти(Стр.Контейнер) = неопределено Тогда СписокНакладных.Добавить(Новый Структура("Вагон, Контейнер, ЖДН, ВесГруза, Груз", Стр.Вагон, Стр.Контейнер, Стр.Документ, Стр.ВесГруза, Стр.ГрузЕТСНГ)); УжеДобавленныеКТК.Добавить(Стр.Контейнер); КонецЕсли;
	КонецЦикла;
	
	Если СписокНакладных.Количество() = 0 Тогда ПоказатьПредупреждение(, "Перед продолжением отметьте накладные!"); Возврат; КонецЕсли;
	
	БезДоходов = СтрЗаканчиваетсяНа(Команда.Имя, "1");
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораСделки", ЭтаФорма, Новый Структура("СписокНакладных, ВключитьВДоходы, ВключитьВРасходы", СписокНакладных, НЕ БезДоходов, Истина));
	ОткрытьФорму("Документ.Сделка.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	РезСделка = ВнестиНакладныеВСделку(П1, П2.СписокНакладных, П2.ВключитьВДоходы, П2.ВключитьВРасходы);
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаОткрытияСделки", ЭтаФорма, РезСделка);
	ПоказатьВопрос(ОпОп, "Данные внесены в сделку. Открыть ее?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОткрытияСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = КодВозвратаДиалога.Да Тогда ПоказатьЗначение(, П2); КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВнестиНакладныеВСделку(Сделка, СписокНакладных, ВключитьВДоходы, ВключитьВРасходы)
	
	Возврат РаботаСоСделкамиСервер.ВнестиДанныеНакладныхВСделку(СписокНакладных, Сделка, ВключитьВДоходы, ВключитьВРасходы);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьНакладные_СоздатьНовуюСделку(Команда)
	
	СписокНакладных = Новый Массив;
	УжеДобавленныеКТК = Новый Массив;
	Для каждого Стр из ТЗНакладные Цикл
		Если Стр.Отметка И УжеДобавленныеКТК.Найти(Стр.Контейнер) = неопределено Тогда СписокНакладных.Добавить(Новый Структура("Вагон, Контейнер, ЖДН, ВесГруза, Груз", Стр.Вагон, Стр.Контейнер, Стр.Документ, Стр.ВесГруза, Стр.ГрузЕТСНГ)); УжеДобавленныеКТК.Добавить(Стр.Контейнер); КонецЕсли;
	КонецЦикла;
	
	Если СписокНакладных.Количество() = 0 Тогда ПоказатьПредупреждение(, "Перед продолжением отметьте накладные!"); Возврат; КонецЕсли;
	
	БезДоходов = СтрЗаканчиваетсяНа(Команда.Имя, "1");
	
	РезСделка = ВнестиНакладныеВСделку(ИСТИНА, СписокНакладных, НЕ БезДоходов, Истина);
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаОткрытияСделки", ЭтаФорма, РезСделка);
	ПоказатьВопрос(ОпОп, "Данные внесены в сделку. Открыть ее?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

//Евросиб Каблов 25.09.2020 Ticket#0208129
&НаКлиенте
Процедура ПеренестиВыбранныеСтрокиВДокумент(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	ВыбранныеСтроки = ТЗНакладные.НайтиСтроки(ПараметрыОтбора);
	КоличествоВыбранныхСтрок = ВыбранныеСтроки.Количество();
	Если КоличествоВыбранныхСтрок = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны строки для переноса в документ!");
		Возврат;
	КонецЕсли;
		
	Если МаксимальноеКоличествоВыбранныхСтрок > 0 Тогда		
		Если КоличествоВыбранныхСтрок > МаксимальноеКоличествоВыбранныхСтрок Тогда
			ТекстПредупреждения = СтрШаблон("Выбрано строк больше, чем доступно! Доступно выбрать %1, выбрано %2", МаксимальноеКоличествоВыбранныхСтрок, КоличествоВыбранныхСтрок);
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Ошибки = Неопределено;
	АдресТаблицы = ПоместитьВоВременноеХранилищеТаблицуВыбранныхСтрок(Ошибки);
	
	Если АдресТаблицы = Неопределено Тогда
		Для Каждого ТекстОшибки Из Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Закрыть(АдресТаблицы);
	
КонецПроцедуры

//Евросиб Каблов 25.09.2020
&НаСервере
Функция ПоместитьВоВременноеХранилищеТаблицуВыбранныхСтрок(Ошибки)
	
	Ошибки = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	ВыбранныеНакладные = ТЗНакладные.Выгрузить(ПараметрыОтбора);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНакладных", ВыбранныеНакладные);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНакладных.Контейнер КАК Контейнер,
	|	ТаблицаНакладных.Вагон КАК Вагон,
	|	ТаблицаНакладных.Документ КАК Документ,
	|	ТаблицаНакладных.ВесГруза КАК ВесГруза,
	|	ТаблицаНакладных.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	|	ТаблицаНакладных.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	|	ТаблицаНакладных.ГОЕвросиб КАК ГОЕвросиб,
	|	ТаблицаНакладных.ГПЕвросиб КАК ГПЕвросиб
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	&ТаблицаНакладных КАК ТаблицаНакладных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ВТНакладные.Вагон КАК Вагон,
	|	ВТНакладные.Документ КАК Документ,
	|	ВТНакладные.ВесГруза КАК ВесГруза,
	|	ВТНакладные.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	|	ВТНакладные.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	СпрКонтейнеры.Ссылка КАК КонтейнерСсылка,
	|	ТС.Ссылка КАК ВагонСсылка,
	|	ТранспортныйДокумент.Ссылка КАК ТранспортныйДокументСсылка,
	|	ЕСТЬNULL(КонтрагентыГрузополучателиЕвросиб.Ссылка, КонтрагентыГрузополучатели.Ссылка) КАК ГрузополучательСсылка,
	|	ЕСТЬNULL(КонтрагентыГрузоотправителиЕвросиб.Ссылка, КонтрагентыГрузоотправители.Ссылка) КАК ГрузоотправительСсылка,
	|	СпрКонтейнеры.ТипТЕ КАК ТипКонтейнера,
	|	СпрКонтейнеры.ТипТЕ.РазмерКТК КАК РазмерКонтейнера,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО ВТНакладные.Документ = э_Накладная.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО ВТНакладные.Документ = ТранспортныйДокумент.НакладнаяЭТРАН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК СпрКонтейнеры
	|		ПО ВТНакладные.Контейнер = СпрКонтейнеры.Наименование
	|			И (НЕ СпрКонтейнеры.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|		ПО ВТНакладные.Вагон = ТС.Наименование
	|			И (НЕ ТС.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузоотправители
	|		ПО ВТНакладные.ОКПОГрузоотправителя = КонтрагентыГрузоотправители.КодПоОКПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузополучатели
	|		ПО ВТНакладные.ОКПОГрузополучателя = КонтрагентыГрузополучатели.КодПоОКПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииГрузоотправители
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузоотправителиЕвросиб
	|			ПО ОрганизацииГрузоотправители.ОКПО = КонтрагентыГрузоотправителиЕвросиб.КодПоОКПО
	|		ПО ВТНакладные.ГОЕвросиб = ОрганизацииГрузоотправители.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииГрузополучатели
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузополучателиЕвросиб
	|			ПО ОрганизацииГрузополучатели.ОКПО = КонтрагентыГрузополучателиЕвросиб.КодПоОКПО
	|		ПО ВТНакладные.ГПЕвросиб = ОрганизацииГрузополучатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
	|				,
	|				Контейнер В
	|					(ВЫБРАТЬ
	|						ВТНакладные.Контейнер КАК Контейнер
	|					ИЗ
	|						ВТНакладные КАК ВТНакладные)) КАК ПризнакСобственностиКонтейнераСрезПоследних
	|		ПО ВТНакладные.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер";
	
	ТаблицаВыбранныхНакладных = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыбранныхНакладных Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контейнер) Тогда
			ТекстОшибки = СтрШаблон("В строке по накладной %1 не указан контейнер!", СтрокаТаблицы.НомерНакладной);
			Ошибки.Добавить(ТекстОшибки);
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.КонтейнерСсылка) Тогда
			ТекстОшибки = СтрШаблон("Не найден контейнер с номером %1!", СтрокаТаблицы.Контейнер);
			Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВыбранныхНакладных, Новый УникальныйИдентификатор());
	
КонецФункции

&НаКлиенте
Процедура СтанцияОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Сделел так, потому что платформенный механизм ограничения типы не работает!
	ПарФормы = Новый Структура("ТипЗначенияСписка, ТекущийСписокЗначений", Новый ОписаниеТипов("СправочникСсылка.э_Станции"), СтанцияОтправления) ;
	ОткрытьФорму("ОбщаяФорма.ПолучитьСписЗначСОграничениемТипа", ПарФормы, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Сделел так, потому что платформенный механизм ограничения типы не работает!
	ПарФормы = Новый Структура("ТипЗначенияСписка, ТекущийСписокЗначений", Новый ОписаниеТипов("СправочникСсылка.э_Станции"), СтанцияНазначения ) ;
	ОткрытьФорму("ОбщаяФорма.ПолучитьСписЗначСОграничениемТипа", ПарФормы, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ТЗНакладныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = ТЗНакладные.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекСтрока <> Неопределено Тогда
		//Евросиб Каблов 11.12.2020 ( Ticket#0216886
		ИменаКолонок = "ТЗНакладныеСделки, ТЗНакладныеСчетаФактуры, ТЗНакладныеКлиенты, ТЗНакладныеДоговоры, ТЗНакладныеПротоколы, ТЗНакладныеКалькуляции, ТЗНакладныеИсполнители";
		
		// Евросиб Фролов (23.11.2021 Ticket№ 0244435
		ИменаКолонок = ИменаКолонок + ", ТЗНакладныеДоплатныеПСЦ";
		// Евросиб Фролов)
		Если СтрНайти(ИменаКолонок, Поле.Имя) > 0 Тогда
			ОткрытьСделкуТекущейСтроки(ТекСтрока, Поле.Имя);
		КонецЕсли;
		//Евросиб Каблов 11.12.2020 )
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСлужебнойЗаписки(Команда)
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	
	МассивКТК = Новый Массив; // массив всех КТК (по всем выделенным строкам) 
	
	// По строковым представлениям получим список КТК для печати служебной записки
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Отметка", Истина);
	ВыделенныеСтроки = ТЗНакладные.НайтиСтроки(ПараметрыПоиска);
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выделены строки в списке услуг для печати служебной записи.");
		Возврат;
	КонецЕсли;	
	
	ПротоколыРазные = Ложь;
	Протокол = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	МассивПредставленийКТК = Новый Массив;	
	
	МассивСтрок = Новый Массив;

	Для Каждого СтрокаДанных Из ВыделенныеСтроки Цикл
		
		МассивПредставленийКТК.Очистить();
		Если МассивПредставленийКТК.Найти(СтрокаДанных.Контейнер) = Неопределено Тогда
			МассивПредставленийКТК.Добавить(СтрокаДанных.Контейнер);
		КонецЕсли;	
		
		Для Каждого ТекущийПротокол Из СтрокаДанных.ДоплатныеПСЦ Цикл
			Если ЗначениеЗаполнено(ТекущийПротокол.Значение)
				И ЗначениеЗаполнено(Протокол)
				И ТекущийПротокол.Значение <> Протокол Тогда
				ПротоколыРазные = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаДанных.ДоплатныеПСЦ.Количество() > 0 Тогда
			Протокол = СтрокаДанных.ДоплатныеПСЦ[0].Значение;
		КонецЕсли;	
		
		КонтейнерыСтроки = ПолучитьМассивКТК(МассивПредставленийКТК);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКТК, КонтейнерыСтроки, Истина);
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Сделки", 				СтрокаДанных.Сделки);
		СтруктураСтроки.Вставить("СчетаФактуры", 		СтрокаДанных.СчетаФактуры);
		СтруктураСтроки.Вставить("Контейнеры", 			КонтейнерыСтроки);
		СтруктураСтроки.Вставить("ДатаРаскредитации", 	СтрокаДанных.ДатаРаскредитации);
		СтруктураСтроки.Вставить("Клиенты", 			СтрокаДанных.Клиенты);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Если ПротоколыРазные Тогда
		ПоказатьПредупреждение(, "В выбранных строках отличаются доплатные протоколы.
								|Проверьте данные.");
		Возврат;
	КонецЕсли;	
	
	//МассивКТК = ПолучитьМассивКТК(МассивПредставленийКТК);
	
	СписокКТК = Новый СписокЗначений;	
	СписокКТК.ЗагрузитьЗначения(МассивКТК);
	
	//ПараметрПечати = ПолучитьТаблицуРТУ(МассивСтрок);
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("СписокКТК", 			СписокКТК);
	ПараметрыФормыПечати.Вставить("Протокол", 			Протокол);
	ПараметрыФормыПечати.Вставить("МассивСтрок", 		МассивСтрок);
	//ПараметрыФормыПечати.Вставить("ТаблицаРТУ", 		ПараметрПечати.ТаблицаДанных);
	//ПараметрыФормыПечати.Вставить("ДатыСозданияИСФ", 	ПараметрПечати.ДатыСозданияИСФ);
	
	ОткрытьФорму("Обработка.ПечатьСлужебныхЗаписокПоДоплатнымКТК.Форма", ПараметрыФормыПечати);
	// Евросиб Фролов)
КонецПроцедуры
	
&НаСервере
Функция ПолучитьМассивКТК(МассивПредставленийКТК)
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЕ.Ссылка КАК КТК
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	ТЕ.Наименование В(&МассивПредставленийКТК)
	|	И НЕ ТЕ.ПометкаУдаления";	

	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивПредставленийКТК", МассивПредставленийКТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивКТК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КТК");
	
	Возврат МассивКТК;
	
	// Евросиб Фролов)
КонецФункции

// Евросиб Фролов (08.04.2022 Task №48889
&НаКлиенте
Процедура ОткрытьПФЖДН(Команда)
	
	ОтмеченныеСтроки = ТЗНакладные.НайтиСтроки(Новый Структура("Отметка", Истина));
	
	Если ОтмеченныеСтроки.Количество() > 0 Тогда
		МассивУникальныхНакладных = Новый Массив;
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			Если МассивУникальныхНакладных.Найти(ОтмеченнаяСтрока.НакладнаяИД) = Неопределено Тогда
				ДополнительныйМодульКлиент.ВыполнитьПолучениеФайлаЖДН(ОтмеченнаяСтрока.НакладнаяИД);
				МассивУникальныхНакладных.Добавить(ОтмеченнаяСтрока.НакладнаяИД);
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		ТекущиеДанные = Элементы.ТЗНакладные.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, "Выделите строку с ЖДН, печатную форму которой необходимо открыть.");
			Возврат;
		КонецЕсли;
		
		ДополнительныйМодульКлиент.ВыполнитьПолучениеФайлаЖДН(ТекущиеДанные.НакладнаяИД);
	КонецЕсли;	
КонецПроцедуры
// Евросиб Фролов)