
&НаКлиенте
Процедура ОбновитьВсе(Команда)
	ОбновитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_Накладная.Ссылка КАК Ссылка,
	               |	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаПрибыл,
	               |	ТранспортныйДокумент.Ссылка КАК ТрДок
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	               |		ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_Накладная.Ссылка
	               |			И (э_Накладная.ДатаИВремяПрибытияГруза <> ДАТАВРЕМЯ(1, 1, 1))
	               |			И (НЕ ТранспортныйДокумент.ПометкаУдаления)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НЗ = РегистрыСведений.ТрДокПрибыл.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
	
		НСтр = НЗ.Добавить();
		НСтр.ТрДок = Выборка.ТрДок;
		НСтр.ДатаПрибыл = Выборка.ДатаПрибыл;
	
	КонецЦикла;
	
	НЗ.Записать();
	
КонецПроцедуры
