
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаправленияФрахт.ПунктНазначения КАК ПунктНазначения,
	               |	НаправленияФрахт.Линия КАК Линия
	               |ИЗ
	               |	Справочник.НаправленияФрахт КАК НаправленияФрахт
	               |ГДЕ
	               |	НаправленияФрахт.Ссылка В(&Ссылка)
	               |	И НЕ НаправленияФрахт.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Параметры.Направления);
	Ответ = запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если Линии.НайтиПоЗначению(Ответ.Линия) = неопределено Тогда Линии.Добавить(Ответ.Линия); КонецЕсли;
		Если ПортыВыгрузки.НайтиПоЗначению(Ответ.ПунктНазначения) = неопределено Тогда ПортыВыгрузки.Добавить(Ответ.ПунктНазначения); КонецЕсли;
		
	КонецЦикла;
	
	ПериодОтображения.ДатаОкончания = ТекущаяДата();
	ПериодОтображения.ДатаНачала = текущаядата() - 3 * 30 * 24 * 3600;
	
	СписокНаправлений.ЗагрузитьЗначения(Параметры.Направления);
	
	ПунктОтправления = Параметры.ПунктОтправления;
	РазмерКТК = Параметры.РазмерКТК;
	Организация = Параметры.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДинамику(Команда)
	ММ_ТаблицаСтавокФрахт.Очистить();
	ТаблицаЛинииУслуги.Очистить();
	ТаблицаСебестоимостей.Очистить();
	ПоказатьДинамикуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьДинамикуНаСервере()
	
	ММ_ТаблицаСтавокФрахт.Очистить();
	ТаблицаЛинииУслуги.Очистить();
	ТаблицаСебестоимостей.Очистить();
	
	// сначала сформируем состав колонок
	
	МассивДобавляемыхРеквизитовФормы = Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НаправленияФрахтСтруктураЗатрат.Услуга КАК Услуга,
	               |	НаправленияФрахтСтруктураЗатрат.Ссылка.Линия КАК Линия
	               |ИЗ
	               |	Справочник.НаправленияФрахт.СтруктураЗатрат КАК НаправленияФрахтСтруктураЗатрат
	               |ГДЕ
	               |	НаправленияФрахтСтруктураЗатрат.Ссылка В(&СписокНаправлений)
	               |	И НЕ НаправленияФрахтСтруктураЗатрат.Ссылка.ПометкаУдаления
	               |	И НаправленияФрахтСтруктураЗатрат.Ссылка.Линия В(&Линия)
	               |ИТОГИ ПО
	               |	Линия";
	
	Запрос.УстановитьПараметр("Линия", Линии.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СписокНаправлений", СписокНаправлений.ВыгрузитьЗначения());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЛиния = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛиния.Следующий() Цикл
		
		// по периодам отображения
		
		ТекПериод = НачалоМесяца(ПериодОтображения.ДатаОкончания)+15*24*3600;
		Пока ТекПериод > ПериодОтображения.ДатаНачала Цикл
			
			// услуги по линии
			ИмяНовогоРеквизита = "ГруппаММФрахт_"+ВыборкаЛиния.Линия.Код+"_"+Формат(ТекПериод, "ДФ=ddMMyyyy");
			НЭлемент = Элементы.Найти(ИмяНовогоРеквизита);
			Если НЭлемент = неопределено Тогда
				ГруппаТаблицыЛиния = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ГруппаФормы"), Элементы.ММ_ТаблицаСтавокФрахт);
				ГруппаТаблицыЛиния.Группировка = ГруппировкаКолонок.Горизонтальная;
				ГруппаТаблицыЛиния.ОтображатьВШапке = Истина;
				ГруппаТаблицыЛиния.Заголовок = ""+ВыборкаЛиния.Линия+" ("+Формат(ТекПериод, "ДФ=dd.MM.yy")+")";
			Иначе
				ГруппаТаблицыЛиния = НЭлемент;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаЛиния.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ТаблицаЛинииУслуги.НайтиСтроки(Новый Структура("Линия, Услуга", ВыборкаДетальныеЗаписи.Линия, ВыборкаДетальныеЗаписи.Услуга)).Количество() = 0 Тогда
					НСтр = ТаблицаЛинииУслуги.Добавить();
					НСтр.Линия = ВыборкаДетальныеЗаписи.Линия;
					НСтр.Услуга = ВыборкаДетальныеЗаписи.Услуга;
				КонецЕсли;
				
				ИмяНовогоРеквизита = "ЛинияУслуга_" + ВыборкаДетальныеЗаписи.Линия.Код + "_" + ВыборкаДетальныеЗаписи.Услуга.Код+"_"+Формат(ТекПериод, "ДФ=ddMMyyyy");
				
				МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10,2,ДопустимыйЗнак.Любой)), "ММ_ТаблицаСтавокФрахт", "", Истина));
				
				НайдЭлемент = Элементы.Найти(ИмяНовогоРеквизита);
				Если НайдЭлемент = неопределено Тогда
					НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
					НКолонка.Вид = ВидПоляФормы.ПолеВвода;
					НКолонка.Заголовок = ВыборкаДетальныеЗаписи.Услуга;
					НКолонка.ТолькоПросмотр = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			// вознаграждение и ставка по линии, условия выгрузки
			
			ИмяНовогоРеквизита = "ЛинияДинамика_" + ВыборкаЛиния.Линия.Код+"_"+Формат(ТекПериод, "ДФ=ddMMyyyy");
			МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10,2,ДопустимыйЗнак.Любой)), "ММ_ТаблицаСтавокФрахт", "", Истина));
			Если НайдЭлемент = неопределено Тогда
				
				НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
				НКолонка.Вид = ВидПоляФормы.ПолеВвода;
				НКолонка.Заголовок = "Динамика";
				НКолонка.ТолькоПросмотр = Истина;
				НКолонка.АвтоМаксимальнаяШирина = Ложь;
				НКолонка.Ширина = 4;
				НКолонка.РастягиватьПоГоризонтали = Ложь;
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ММ_ТаблицаСтавокФрахт."+ИмяНовогоРеквизита);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
				ЭлементОтбора.ПравоеЗначение = 0;
				ЭлементОтбора.Использование = Истина;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяНовогоРеквизита);
				ПолеОформления.Использование = Истина;
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ММ_ТаблицаСтавокФрахт."+ИмяНовогоРеквизита);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 0;
				ЭлементОтбора.Использование = Истина;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяНовогоРеквизита);
				ПолеОформления.Использование = Истина;
				
			КонецЕсли;
			
			ТекПериод = ТекПериод - 31 * 24 * 3600;
			
		КонецЦикла;
		
		МассивУдаляемыхРеквизитовФормы = новый Массив;
		Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("ММ_ТаблицаСтавокФрахт") Цикл
			Если Стр.Имя <> "Порт" тогда МассивУдаляемыхРеквизитовФормы.Добавить(Стр.Путь+"."+Стр.Имя); КонецЕсли;
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитовФормы, МассивУдаляемыхРеквизитовФормы);
		
		Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("ММ_ТаблицаСтавокФрахт") Цикл
			Если Стр.Имя <> "Порт" И Элементы[Стр.Имя].ПутьКДанным <> Стр.Путь+"."+Стр.Имя тогда 
				Попытка
					Элементы[Стр.Имя].ПутьКДанным = Стр.Путь+"."+Стр.Имя; 
				Исключение
					Сообщить("Изменение формы недоступно. При необходимости откройте окно еще раз.");
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	// затем заполним строки таблицы пунктами назначения и ранее введенными ставками / посчитанными услугами
	
	Для каждого Порт из ПортыВыгрузки Цикл
	
		НСтр = ММ_ТаблицаСтавокФрахт.Добавить();
		НСтр.Порт = Порт.Значение;
		
		////////////////////////////////////////
		
		Для каждого Стр из ТаблицаЛинииУслуги Цикл
			
			ТекПериод = НачалоМесяца(ПериодОтображения.ДатаОкончания)+15*24*3600;
			Пока ТекПериод > ПериодОтображения.ДатаНачала Цикл
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("КалькуляцияМорскойСоставляющей", Истина);
				СтруктураПараметров.Вставить("Период", ТекПериод);
				СтруктураПараметров.Вставить("Поставщик", Стр.Линия);
				СтруктураПараметров.Вставить("ПунктОтправления", ПунктОтправления);
				СтруктураПараметров.Вставить("ПунктНазначения", Порт.Значение);
				СтруктураПараметров.Вставить("Услуга", Стр.Услуга);
				
				Если ЗначениеЗаполнено(РазмерКТК) Тогда
					МРазмерКТК = Новый Массив;
					МРазмерКТК.Добавить(РазмерКТК);
					СтруктураПараметров.Вставить("РазмерыКТК", МРазмерКТК);
				КонецЕсли;
				СтруктураПараметров.Вставить("Организация", Организация);
				Если ГруженыеКТК Тогда
					СтруктураПараметров.Вставить("ДляГруженых", Истина);
				Иначе
					СтруктураПараметров.Вставить("ДляПорожних", Истина);
				КонецЕсли;
				
				РЕЗТарифы = Тарификатор_сервер.ПолучитьТарифыПоПараметрам(СтруктураПараметров);
				Если РЕЗТарифы.Количество() > 0 Тогда
					
					ИмяРеквизита = "ЛинияУслуга_" + Стр.Линия.Код + "_" + Стр.Услуга.Код+"_"+Формат(ТекПериод, "ДФ=ddMMyyyy");
					НСтр[ИмяРеквизита] = РЕЗТарифы[0].Себестоимость;
					
					РезН = ТаблицаСебестоимостей.НайтиСтроки(Новый Структура("Линия, Период, Порт", Стр.Линия, ТекПериод, Порт.Значение));
					Если РезН.Количество() = 0 Тогда
						НСтр3 = ТаблицаСебестоимостей.Добавить();
						НСтр3.Линия = Стр.Линия;
						НСтр3.Период = ТекПериод;
						НСтр3.Порт = Порт.Значение;
						НСтр3.Себестоимость = РЕЗТарифы[0].Себестоимость;
					Иначе
						РезН[0].Себестоимость = РезН[0].Себестоимость + РЕЗТарифы[0].Себестоимость;
					КонецЕсли;
					
				КонецЕсли;
				
				ТекПериод = ТекПериод - 31 * 24 * 3600;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Финальный штрих - добавляем ЛинияДинамика_
	Для каждого СтрПорт из ММ_ТаблицаСтавокФрахт Цикл
		
		ПослЛиния = неопределено;
		ПослЗначение = 0;
		Для каждого Стр из ТаблицаСебестоимостей.НайтиСтроки(Новый Структура("Порт", СтрПорт.Порт)) Цикл
			
			Если ПослЛиния = Стр.Линия Тогда
				ИмяНовогоРеквизита = "ЛинияДинамика_" + Стр.Линия.Код+"_"+Формат(Стр.Период, "ДФ=ddMMyyyy");
				СтрПорт[ИмяНовогоРеквизита] = ПослЗначение - Стр.Себестоимость;
			КонецЕсли;
			
			ПослЛиния = Стр.Линия;
			ПослЗначение = Стр.Себестоимость;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


