
&НаКлиенте
Процедура ЗаполнитьДанныеИзИсточниковДляЧистогоСтока(Команда)
	ЗаполнитьДанныеИзИсточниковДляЧистогоСтокаНаСервере(); //Евросиб(ДИТ) US 78754 ТА 98408 Шевченко А.В. Начало: 19.12.2024
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзИсточниковДляЧистогоСтокаНаСервере()
	Документы.ПереносДанныхВЧистыйСток.ЗаполнитьДанныеИзИсточниковДляЧистогоСтокаНаСервере(Объект);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПереносаВЧистыйСток(Команда)
	ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере()	
	Документы.ПереносДанныхВЧистыйСток.ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере_Новая(Объект);	
КонецПроцедуры
