
Процедура ПередЗаписью(Отказ)
	
	////АТК Казбаев С.А. 	
	//Если ЭтоНовый() Тогда
	//	//временно, пока не оставим только код
	//	Если НомерВагона = "" Тогда  		
	//		НомерВагона = Код; 			
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если не ЗначениеЗаполнено(РодВагона) Тогда  		
		РодВагона = Справочники.э_РодаВагоновДляНакладных.НайтиПоРеквизиту("КодРодаВагона",РодВагонаКод); 			
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТипВагона) и ЗначениеЗаполнено(РодВагона) Тогда  		
		ТипВагона = Справочники.э_ТипыВагонов.НайтиПоКоду(РодВагона.КодТипаВагоновДляСправочникаВМТП);			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МодельВагона) Тогда
		МодельВагона = Справочники.э_МоделиВагонов.НайтиПоНаименованию(МодельВагонаНаименование);
	КонецЕсли;
	
	//АТК Казбаев С.А.	
	

	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//АТК Казбаев С.А.	
	МассивНепроверяемыхРеквизитов = Новый Массив;
    МассивНепроверяемыхРеквизитов.Добавить("Наименование");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);	
	//АТК Казбаев С.А.	

	
КонецПроцедуры
