
Процедура ПроверкаДатыРелизаСтоковогоКТК() Экспорт
	// запрос по заявкам, у которых стоит галка "План" (значит они работают со стоками)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.Ссылка КАК Ссылка,
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		|	ЗаявкаСоставУслуги.СтокВыдачи КАК СтокВыдачи,
		|	ЗаявкаСоставУслуги.СрокДействияРелиза КАК СрокДействияРелиза
		|ПОМЕСТИТЬ ЗаявкиЪ
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления
		|	И ЗаявкаСоставУслуги.План
		|	И НЕ ЗаявкаСоставУслуги.НомерРелиза = """"
		|	И НЕ ЗаявкаСоставУслуги.СрокДействияРелиза = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаЗаявки.Ссылка КАК СделкаЪ,
		|	ЗаявкиЪ.НомерКТК КАК НомерКТК,
		|	СделкаЗаявки.Заявка КАК Заявка,
		|	ЗаявкиЪ.СтокВыдачи КАК СтокВыдачи
		|ПОМЕСТИТЬ СделкиСЗаявками
		|ИЗ
		|	ЗаявкиЪ КАК ЗаявкиЪ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
		|		ПО ЗаявкиЪ.Ссылка = СделкаЗаявки.Заявка
		|ГДЕ
		|	НЕ СделкаЗаявки.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкиСЗаявками.Заявка КАК Заявка,
		|	СделкиСЗаявками.НомерКТК КАК НомерКТК,
		|	СделкиСЗаявками.СтокВыдачи КАК СтокВыдачи
		|ИЗ
		|	СделкиСЗаявками КАК СделкиСЗаявками
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ПО СделкиСЗаявками.СделкаЪ = СделкаСвязьУчетныхЕдиниц.Ссылка
		|			И СделкиСЗаявками.НомерКТК = СделкаСвязьУчетныхЕдиниц.Контейнер
		|ИТОГИ ПО
		|	Заявка";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ТекЗаявка = ВыборкаСсылка.Заявка.ПолучитьОбъект();
		ТекТбл = ТекЗаявка.СоставУслуги;
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			Для Каждого Стр Из ТекТбл Цикл
				Если НЕ ЗначениеЗаполнено(Стр.СрокДействияРелиза) ИЛИ
					НЕ ЗначениеЗаполнено(Стр.НомерРелиза) ИЛИ
					НЕ Стр.План Тогда
					Продолжить;
				КонецЕсли;
				ДатаУд = ПолучитьДеньУдаленияКТК(Стр.СрокДействияРелиза);
				Если ДатаУд = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если Стр.НомерКТК = ВыборкаДетальныеЗаписи.НомерКТК И
					Стр.СтокВыдачи = ВыборкаДетальныеЗаписи.СтокВыдачи И
					ТекущаяДата() >= ДатаУд Тогда
					Стр.НомерКТК = Справочники.ТЕ.ПустаяСсылка();
					Стр.СтокВыдачи = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		Попытка
			ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекЗаявка.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДеньУдаленияКТК(СрокДействияРелиза)
	
	ДатаУдаления = Неопределено;
	
	ПрКалендарь = ПостроительТСх_сервер.ПодобратьПроизводственныйКалендарь(Справочники.Номенклатура.ПустаяСсылка(),Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 30
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	ВЫБОР
	               |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	               |				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РабочийДень,
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
	               |ПОМЕСТИТЬ Вт1
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	               |	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаНач
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПроизводственныйКалендарь,
	               |	Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Вт1.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	Вт1.РабочийДень КАК РабочийДень,
	               |	Вт1.Дата КАК Дата
	               |ИЗ
	               |	Вт1 КАК Вт1
	               |ГДЕ
	               |	Вт1.РабочийДень <> 0";
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь",ПрКалендарь);
	Запрос.УстановитьПараметр("ДатаНач",СрокДействияРелиза+3600*24*1);
	Запрос.УстановитьПараметр("ДатаНазад",СрокДействияРелиза-3600*24*30);
	
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		ДатаУдаления = Ответ.Дата;
	КонецЕсли;
	
	Возврат ДатаУдаления;
	
КонецФункции