
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//Обработки.ДД_подключаемыйМодуль.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
	// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 12.09.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправленныеПоПочтеДокументы.ОтправленныйДокумент КАК Документ,
		|	ОтправленныеПоПочтеДокументы.АдресаОтправки КАК АдресаОтправки
		|ИЗ
		|	РегистрСведений.ОтправленныеПоПочтеДокументы КАК ОтправленныеПоПочтеДокументы
		|ГДЕ
		|	ОтправленныеПоПочтеДокументы.ОтправленныйДокумент В(&Объекты)";
	
	Запрос.УстановитьПараметр("Объекты", Строки.ПолучитьКлючи());
	
	ДанныеПоАдресамОтправки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	СтруктураОтбора = Новый Структура("Документ");
	Для каждого СтрокаСписка Из Строки Цикл  
		СтруктураОтбора.Документ = СтрокаСписка.Ключ;
		Если СтрокаСписка.Значение.Данные.Свойство("ОтправленоПоЭлПочтеКлиенту") Тогда
			ВсеАдресаОтправки = Новый Массив;
			Пока ДанныеПоАдресамОтправки.НайтиСледующий(СтруктураОтбора) Цикл 
				МассивАдресов = СтрРазделить(ДанныеПоАдресамОтправки.АдресаОтправки, ";", Ложь);
				Для каждого СтрАдреса Из МассивАдресов Цикл 
					Адрес = СокрЛП(СтрАдреса);
					Если СтрНайти(Адрес, "@eurosib.biz") = 0
						и ВсеАдресаОтправки.Найти(Адрес) = Неопределено Тогда
						ВсеАдресаОтправки.Добавить(Адрес);
					КонецЕсли;	
				КонецЦикла;	
			КонецЦикла;    
			СтрокаСписка.Значение.Данные.ОтправленоПоЭлПочтеКлиенту = СтрСоединить(ВсеАдресаОтправки, "; "); 
		КонецЕсли;  
		ДанныеПоАдресамОтправки.Сбросить();
	КонецЦикла; 
	// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 12.09.2023
	
КонецПроцедуры


&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	
//Евросиб Литвинов 05.02.21 task 28203 (
	//ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	//
	//НетПовторов = ПроверитьОдинаковыеДанные(ВыделенныеСтр);
	НетПовторов = э_ОбщиеСервер.ГрупповаяПечать(Элементы.Список.ВыделенныеСтроки);
//Евросиб Литвинов 05.02.21 task 28203 )
	
	Если ТипЗнч(НетПовторов) = Тип("Структура") Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",НетПовторов, ЭтотОбъект);
	Иначе
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов)
	 
	МассивДокументов = ПечатьКомплектаДокументов.СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов,Истина);
	Возврат МассивДокументов;
	 
КонецФункции

//Евросиб Литвинов 05.02.21 task 28203 (
// Функция ПроверитьОдинаковыеДанные(ВыделенныеСтр) - перенесена в ОМ ПечатьКомплектаДокументов
//Евросиб Литвинов 05.02.21 task 28203 )

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивДокументов = СозданиеТаблицыДокументов(ВыделенныеСтр,ВыбранноеЗначение);
		
	Иначе
		МассивДокументов = СозданиеТаблицыДокументов(ВыделенныеСтр,Неопределено);
		
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	Для Каждого Элем Из ВыделенныеСтр Цикл
		ПараметрКоманды.Добавить(Элем);
	КонецЦикла;
		
	ПечатьКомплектаДокументов.НапечататьКомплект(МассивДокументов,ПараметрКоманды);

КонецПроцедуры


//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормыСписка(Элементы);	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
 
//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец


