
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
//Евросиб Гудкова( 16.01.2020 Ticket№ можно менять в связи с акцептами
	//Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
	//Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();
// Евросиб Гудкова) 
	
	// + начальная инициализация
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборСумма", 	неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("Поставщик", 	неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("Договор", 		неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("Номенклатура", 	неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборКТКОтключен", Истина);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборКТК", 	неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборТСОтключен", Истина);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборТС", 	неопределено);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборТДОтключен", Истина);
	//НеразнесенныеЗатраты.Параметры.УстановитьЗначениеПараметра("ОтборТД", 	неопределено);
	// - начальная инициализация
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
//Евросиб Гудкова( 25.12.2019 
	Если Объект.СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
 		//НомерДатаЗаказаУПП = ОбновитьНомерДатуЗаказаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;	
		//Евросиб - АСуслов 03.03.2023 12:39:18 #65484
		//(
		//НомерДатаЗаказаУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;
		Элементы.НомерДатаЗаказаУПП.Видимость = Ложь;
		//)
		//Евросиб - АСуслов 03.03.2023 12:39:41 #65484
//Евросиб Гудкова( 05.09.2020 Ticket№ 0202979
		НомерДатаЗаявкиУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаявка").НомерДатаВБУ;
// Евросиб Гудкова) 		
	КонецЕсли;
//Евросиб Гудкова( 17.07.2020 
	ВыборкаНомерДатаПТУУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.Ссылка, "УПП");
	НомерДатаПТУУПП = ВыборкаНомерДатаПТУУПП.НомерДатаВБУ;
	ПроведенВБУ = ВыборкаНомерДатаПТУУПП.ПроведенВБУ;
//Евросиб Гудкова( 06.04.2021 Ticket№ 0228634
//ДИТ Давудов М.А. US 64830 15.04.2023 Начало
	Если ПроведенВБУ Тогда
		ДатаПроведенияВУПП = ВыборкаНомерДатаПТУУПП.ДатаОбмена;
	КонецЕсли;
//ДИТ Давудов М.А. US 64830 15.04.2023 Конец
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
// Евросиб Гудкова) 	
		СтатусЭДО = ОбновитьСтатусЭДО(Объект.Ссылка);
//Евросиб Гудкова( 06.04.2021 Ticket№ 0228634
	Иначе
		Элементы.группа5.Видимость = Ложь;	
	КонецЕсли; 
// Евросиб Гудкова) 	

	//Евросиб Гудкова УстановитьПривилегированныйРежим(Истина);
	Элементы.Регламентный.Доступность = (РольДоступна("dc_РаботаСНерегламентнымиДокументами")
										ИЛИ РольДоступна("ПолныеПрава"));//Евросиб Гудкова
	//Евросиб Гудкова УстановитьПривилегированныйРежим(Ложь);
	
	//Евросиб Каблов 09.12.2020 ( Ticket#0216086
	УстановитьДоступностьРазрешенияВыгрузкиВУПП();
	Если Объект.РазрешенаВыгрузкаВУПП Тогда
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = СтрШаблон("Разрешена выгрузка в 1С УПП (%1;%2)", Объект.РазрешилВыгрузкуВУПП, Объект.ДатаРазрешенияВыгрузкиВУПП);
	Иначе
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = "Разрешена выгрузка в 1С УПП";
	КонецЕсли;
	//Евросиб Каблов 09.12.2020 )
	
	Элементы.ДатаПолученияОригинала.Доступность = Не Объект.Копия;
	
	//// SIV 14-07-20 Из актуального акцепта получаем его статус
	//СтатусРазнесения = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан;
	//ПериодВОЪ = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	//АкцептЪ = Документы.Акцепт.ПолучитьАкцептПоПоступлениюИПериоду(Объект.Ссылка, ПериодВОЪ);
	//Если ЗначениеЗаполнено(АкцептЪ) Тогда
	//	СтатусРазнесения = АкцептЪ.СтатусРазнесения;
	//КонецЕсли;
	
	//Евросиб - АСуслов 18.01.2021 10:38:10 #
	//(
	СтруктураРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Объект.Ссылка);
	СтатусРазнесения = СтруктураРазнесения.СтатусРазнесения;
	НеразнесеннаяСумма = СтруктураРазнесения.НеразнесеннаяСумма;
	//)
	//Евросиб - АСуслов 18.01.2021 10:38:11 #
	
	//Евросиб Каблов 03.03.2021 ( Ticket#0223124
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПользовательСПолнымиПравами = РольДоступна("ПолныеПрава");
		Если Не ПользовательСПолнымиПравами Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.Объект = &Объект
			|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)
			|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)";
			Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();		
			//Евросиб - АСуслов 24.05.2021 11:44:44 #
			//(
			ЗагруженИзРИТМ = Не РезультатЗапроса.Пустой();
			ЗаблокироватьУслуги = ЗагруженИзРИТМ;
			//нужно заблокировать определенные поля, поэтому блокируем не всю ТЧ,
			//а используем условное оформление
			//Элементы.Услуги1.ТолькоПросмотр = ЗаблокироватьУслуги;
			Элементы.Услуги1.ИзменятьПорядокСтрок = НЕ ЗаблокироватьУслуги;
			Элементы.Услуги1.ИзменятьСоставСтрок = НЕ ЗаблокироватьУслуги;
			//)
			//Евросиб - АСуслов 24.05.2021 11:44:45 #
			Элементы.Доходыexcel_ВставитьВагоны.Доступность = Не ЗаблокироватьУслуги;
			Элементы.Доходыexcel_ВставитьКонтейнеры.Доступность = Не ЗаблокироватьУслуги;
			Элементы.ДекорацияУслугиЗаблокированы.Видимость = ЗаблокироватьУслуги;
		КонецЕсли;		
		
	КонецЕсли;
	//Евросиб Каблов 03.03.2021 )
	
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ДИТ Поморцева Т.П. Задача 29231 (38715) 21.09.21. начало - отключено временно, код в разработке
// на форме кнопка "Услуги1ПривязатьКПериодуИспользования" отключена
// на форме закладка "ГруппаПериодыИспользованияКТК" отключена
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	//// Шейко О.Е. Привязки КТК к периодам использования
	//Для каждого Стр Из Объект.Услуги Цикл
	//	
	//	ЭтоПТУсАрендой_КТК = Стр.Номенклатура.ЭтоУслугаАрендыКТК;
	//	ЭтоПТУсСНП_КТК = Стр.Номенклатура.ЭтоУслугаСНП_КТК;
	//	
	//	Прервать;
	//	
	//КонецЦикла;
	//
	//Элементы.Услуги1ПривязатьКПериодуИспользования.Видимость = ЭтоПТУсАрендой_КТК;
	//Элементы.ГруппаПериодыИспользованияКТК.Видимость = ЭтоПТУсАрендой_КТК;
	//Элементы.ТаблицаПериодовИспользованияГруппаСНП.Видимость = ЭтоПТУсСНП_КТК;
	//
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	
	//	Если ЭтоПТУсАрендой_КТК Тогда
	//		
	//		// 1. Определим наличие привязок:
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//		               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ КАК ПТУ,
	//		               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК КАК КТК,
	//		               |	ПривязкаПоступленияКПериодуИспользованияКТК.СНП КАК СНП,
	//		               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка КАК КТК_Ссылка
	//		               |ИЗ
	//		               |	РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
	//		               |ГДЕ
	//		               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ = &ПТУ";
	//		
	//		Запрос.УстановитьПараметр("ПТУ", Объект.Ссылка);
	//		//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
	//		Результат = Запрос.Выполнить();
	//		
	//		Если НЕ Результат.Пустой() Тогда
	//			
	//			ПриСозданииНаСервереПривязки();
	//			
	//		КонецЕсли; 
	//	
	//	КонецЕсли; 
	//			
	//КонецЕсли; 
// ----------------------------------------------------------------------------------
// ДИТ Поморцева Т.П. Задача 29231 (38715) 21.09.21. конец

	//++ Зубов 35853 11.08.2021
	Элементы.ТекущийИсполнитель_ПричинаВозврата.Видимость = Ложь;
	Для каждого СтрокаСостояния из Объект.Состояния Цикл
		Если СтрокаСостояния.Исполнитель = ПараметрыСеанса.ТекущийПользователь И НЕ СтрокаСостояния.Комментарий = "" Тогда
			ТекущийИсполнитель_ПричинаВозврата = СтрокаСостояния.Комментарий;
			Элементы.ТекущийИсполнитель_ПричинаВозврата.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	//-- Зубов 35853 11.08.2021
	
	// ++ ДИТ Сгонник, 21-10-26 №27109
	//++ Зубов US 27109 TA 27110 14.12.2021 Так было до
	//РазрешитьРедактированиеСостоянияПТУ = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияПТУ",, Ложь);
	//РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостоянияПТУ);
	// Так стало после
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		РазрешитьРедактированиеСостоянияПТУ = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияПТУ",, Ложь);
		РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостоянияПТУ);
	КонецЕсли;
	//-- Зубов US 27109 TA 27110 14.12.2021
	// -- ДИТ Сгонник, 21-10-26 №27109 
	
	// ДИТ US 81910 ТА 81911 Сержантова А.С. Начало: 24.04.2024
	Элементы.ПричинаОстановкиРаботы.Доступность = Пользователи.РолиДоступны(
			"ПолныеПрава,dc_РазрешитьУстанавливатьПричинуОстановкиРаботыНадДокументом",,Ложь);
	// ДИТ US 81910 ТА 81911 Сержантова А.С. Конец: 24.04.2024
	
	//++ДИТ Гаузер А.В. Ticket#0274990 15.08.2022
	Элементы.ДатаПересчета.Доступность = (РольДоступна("dc_РаботаСАкцептами")
									  ИЛИ РольДоступна("ПолныеПрава"));
	//--ДИТ Гаузер А.В. Ticket#0274990 15.08.2022
	
	//Евросиб Каблов 09.09.2022 ( US49022
	СпозиционироватьсяНаСтроке = Параметры.Свойство("ПерейтиКСтрокеУслуг");
	Если СпозиционироватьсяНаСтроке Тогда
		СтрокиПоИдентификатору = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИДПТУ", Параметры.ПерейтиКСтрокеУслуг));
		Если ЗначениеЗаполнено(СтрокиПоИдентификатору) Тогда
			Элементы.Услуги1.ТекущаяСтрока = СтрокиПоИдентификатору[0].ПолучитьИдентификатор();		
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 09.09.2022 )

	//Евросиб Коханенко Н.А. 09.12.2022 (( #61705
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. 09.12.2022 )) #61705 

	// ++ ДИТ_Агафонов_task 41390
	//У команд проставлены Изменяет данные: 
	//excel_ВставитьВагоны excel_ВставитьВагоныИКТК excel_ВставитьКонтейнеры ОбновитьДетализацию РазнестиАвтоматически
	//ОстатокОплатитьНаОснованииПТУ
	
	////Создана на форме группа ГруппаБлокировкаКорректировка
	//КорректировкаПоступления = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(Объект.Ссылка);
	//Элементы.ГруппаБлокировкаКорректировка.Видимость = ЗначениеЗаполнено(КорректировкаПоступления);	
	
	//Добавлены на форму данные КорректировкиДокумента
	//Добавлены элементы ГруппаКорректировкиДокумента 
	Документы.КорректировкаПоступления.ЗаполнитьСписокКорректировокПоступленияРекурсивно(Объект.Ссылка, КорректировкиДокумента);
	ЕстьКорректировки = КорректировкиДокумента.Количество()>0;
	Элементы.ГруппаКорректировкиДокумента.Видимость = ЕстьКорректировки; 
	Если ЕстьКорректировки Тогда
		Элементы.ПредупреждениеРедактирования.Заголовок = "Работа с документом должна происходить через документ исправления!";			
		Элементы.ПредупреждениеРедактирования.Видимость = Истина;	
		Если не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(КорректировкаПоступления);	
		КонецЕсли;	
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390

	//Евросиб - АСуслов 03.03.2023 12:48:10 #65484
	//(
	ДоступностьФункционалаПривязкиПТУПоСчетам();
	//)
	//Евросиб - АСуслов 03.03.2023 12:48:15 #65484
	//Евросиб - АСуслов 17.03.2023 13:29:00 #65868
	//(       
	Если Не ЗначениеЗаполнено(Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов) Тогда
		ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(Объект.ДатаПоступленияДокумента, Объект.ДоговорКонтрагента, Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	КонецЕсли;
	Элементы.СтатусДокумента.ТолькоПросмотр = Документы.ПоступлениеТоваровУслуг.ДоступностьСтатусаДокументаДляПользователя(Объект);
	Элементы.ДатаПоступленияДокумента.ТолькоПросмотр = Документы.ПоступлениеТоваровУслуг.ДоступностьДатаПоступленияДляПользователя(Объект); 
	//Евросиб - АСуслов 16.03.2023 17:17:18 #65868
	//(                                              
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураДокументЗагруженИзВнешнегоИсточника = ЕСОбменСервер.ДокументЗагруженИзВнешнегоИсточника(Объект.Ссылка);
		Если СтруктураДокументЗагруженИзВнешнегоИсточника.ДокументЗагруженИзВнешнегоИсточника Тогда
			Элементы.ДатаПоступленияДокумента.ТолькоПросмотр = Истина;	
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 16.03.2023 17:17:19 #65868
	//)
	//Евросиб - АСуслов 17.03.2023 13:29:05 #65868    
	//Евросиб - АСуслов 23.11.2023 13:12:32 #77780
	//(
	ОбновитьДетализациюНаСервере();
	//)
	//Евросиб - АСуслов 23.11.2023 13:12:34 #77780
	//Евросиб - АСуслов 10.01.2024 14:37:57 #78327
	//(
	УстановитьВидимость();
	ЗаполнитьТаблицуМультивалютныхДоговоров(НЕ ЗначениеЗаполнено(Объект.Ссылка));
	//КнопкаЗаявкаНаОплатуСоздатьНаОсновании = Элементы.Добавить("ФормаДокументЗаявкаНаОплатуСоздатьНаОсновании", Тип("КнопкаФормы"), Элементы.ФормаСоздатьНаОсновании);
	//КнопкаЗаявкаНаОплатуСоздатьНаОсновании.Заголовок = "Заявка на оплату";
	//КнопкаЗаявкаНаОплатуСоздатьНаОсновании.ИмяКоманды = "СоздатьНаОснованииЗаявкаНаОплату"; 
	//)
	//Евросиб - АСуслов 04.01.2024 13:19:49 #78327
	
	//Евросиб Каблов 13.11.2024 ( Ticket#0375504
	ЗаполнитьСтатусыПротоколовПоставщика();
	//Евросиб Каблов 13.11.2024 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	УстановитьДоступностьРеквизита_Страхование();
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	Если РольДоступна("dc_ДобавлениеИзменениеЗаявкиНаОплату") Тогда
		ПроверитьИСоздатьКомандыСозданияЗаявокНаоплату();
	КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец


КонецПроцедуры 

//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
Процедура УстановитьДоступностьРеквизита_Страхование()
	
	ДоступностьРеквизитаСтрахование = Истина;
	Если Документы.ПоступлениеТоваровУслуг.ПрисутствуетНомеклатураСтрахования(Объект) Тогда
		ДоступностьРеквизитаСтрахование = Ложь;
		Элементы.Страхование.Подсказка = "Установлена автоматически при наличии услуг страхования в ПТУ";
	Иначе
		Элементы.Страхование.Подсказка = "Реквизит доступен отделу учета и контроля входящих документов подрядчиков";
		Если НЕ КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСДокументамиПоставщиков") Тогда
			ДоступностьРеквизитаСтрахование = Ложь;
		КонецЕсли;
	КонецЕсли;
	Элементы.Страхование.Доступность = ДоступностьРеквизитаСтрахование;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец

&НаСервере
Процедура УстановитьВидимость()  
	//Евросиб - АСуслов 24.01.2024 15:29:54 #78327
	//(  
	ДокументПоМультивалютномуДоговору = Ложь;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДокументПоМультивалютномуДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорКонтрагента, "МультивалютныйДоговор");
		Элементы.СвязанныеСчетаПоставщиковГруппаМультивалютныеДоговоры.Видимость = ДокументПоМультивалютномуДоговору;
	КонецЕсли;
	Элементы.ВалютаОплаты.Видимость = ДокументПоМультивалютномуДоговору;
	//)
	//Евросиб - АСуслов 24.01.2024 15:29:56 #78327
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииЗаявкаНаОплату(Команда) Экспорт
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПослеЗаписиМодифицированного", ЭтотОбъект, Новый Структура("Команда", Команда));
		ПоказатьВопрос(ОписаниеОповещения, "Документ изменен. Для продолжения необходимо записать документ. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		//Евросиб СубботинВ #102528 09.04.2025 Начало
		//ПолучитьСуществующуюЗаявкуПоДокументу();
		СоздатьЗаявкиНаОплату(Команда);
		//Евросиб СубботинВ #102528 09.04.2025 Конец
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСуществующуюЗаявкуПоДокументуНаСервере(Документ, Ставка)
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало
    //ДокументЗаявка = Документы.ЗаявкаНаОплату.ПолучитьСуществующуюЗаявкуПоДокументу(Объект.Ссылка);
	ДокументЗаявка = Документы.ЗаявкаНаОплату.ПолучитьСуществующуюЗаявкуПоДокументу(Документ, Ставка);	
	//Евросиб СубботинВ #102528 09.04.2025 Конец

	Возврат ДокументЗаявка;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьПослеЗаписиМодифицированного(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	Записать();
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	//ПолучитьСуществующуюЗаявкуПоДокументу();
	СоздатьЗаявкиНаОплату(ДополнительныеПараметры.Команда);
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	
КонецПроцедуры

//Евросиб СубботинВ #102528 09.04.2025 Начало //убрал за неактуальностью
//&НаКлиенте
//Процедура ПолучитьСуществующуюЗаявкуПоДокументу()
//	Результат = ПолучитьСуществующуюЗаявкуПоДокументуНаСервере();	
//	Если Результат <> Неопределено Тогда
//		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПослеВыбораСуществующейЗаявки", ЭтотОбъект, Результат);
//		Кнопки = Новый СписокЗначений;
//		Кнопки.Добавить("Редактировать", "Редактировать существующую заявку");
//		Кнопки.Добавить("Создать", "Создать новую заявку");
//		Кнопки.Добавить("Отмена", "Отмена");
//		ПоказатьВопрос(ОписаниеОповещения, "По документу найдена созданная заявка. Открыть существующую на редактирование или создать новую заявку?",Кнопки, 60);
//	Иначе
//		ЗаполнитьЗаявку(Результат);
//	КонецЕсли;
//КонецПроцедуры
	//Евросиб СубботинВ #102528 09.04.2025 Конец

&НаКлиенте
Процедура ПродолжитьПослеВыбораСуществующейЗаявки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = "Создать" Тогда
		Результат = ЗаполнитьЗаявку(Неопределено);
	Иначе
		Результат = ЗаполнитьЗаявку(ДополнительныеПараметры);
	КонецЕсли;      
	
КонецПроцедуры 

&НаКлиенте
Функция ЗаполнитьЗаявку(ЗаявкаНаОплатуСсылка)
	
	Если ЗначениеЗаполнено(ЗаявкаНаОплатуСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ЗаявкаНаОплатуСсылка);
	Иначе
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Основание", Объект.Ссылка);	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ОткрытьФорму("Документ.ЗаявкаНаОплату.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецФункции
//)
//Евросиб - АСуслов 04.01.2024 14:13:46 #78327
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураПолученный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.СчФНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
//Евросиб Гудкова( 02.01.2021 Ticket№0218691 
		НомерВСФ = РеквизитыСФ.НомерВходящегоДокумента;
		ДатаВСФ = РеквизитыСФ.ДатаВходящегоДокумента;
// Евросиб Гудкова) 		
	КонецЕсли;
//Евросиб Гудкова( 14.01.2020 нельзя менять объект при открытии формы на чтение
	//Для каждого Стр из Объект.Товары Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
	//КонецЦикла;
	//Для каждого Стр из Объект.Услуги Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
	//КонецЦикла;
//Евросиб Гудкова( 31.07.2020 Ticket№ 0201942
	УстановитьЗаголовокКонтрагента();
// Евросиб Гудкова) 	
	
	РассчитатьСуммыВсегоПоДокументу();
	УстановитьВидимостьКолонокНДС();
//Евросиб Гудкова( 14.01.2020 нельзя менять объект при открытии формы на чтение
// 	ДополнитьДанные(неопределено);
// Евросиб Гудкова)
	//ИзменениеПараметров();
	СтатьяДвиженияДенежныхСредствНачалоВыбора(неопределено, неопределено, Истина);
//Евросиб Гудкова( 23.12.2019 это что???
	// Попытка
	//	Объект.ДатаПересчета = Объект.Дата;
	//Исключение
	//КонецПопытки;
// Евросиб Гудкова)
//	Элементы.ГруппаСопоставляемыеПозиции.Видимость = ЛОЖЬ;
	
	//СвязанныеСчетаПоставщиковПриИзменении(Неопределено);
	ОбновитьТекстОстатокОплатитьНаОснованииПТУ();
	
//Евросиб Гудкова( 23.12.2019
//	Если Объект.Проведен Тогда
//// Евросиб Гудкова) 	
//		//ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
//		//Элементы.ОбновитьПериодВО.Доступность = НЕ ПроверкаДоступнотиПоПериоду();
//	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
		РазнестиАвтоматически(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчитыватьНДС", ОбъектА.УчитыватьНДС);
	ПараметрыФормы.Вставить("СуммаВключаетНДС", ОбъектА.СуммаВключаетНДС);
	ОткрытьФорму("ОбщаяФорма.УчетНДСВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВалютаДокумента", ОбъектА.ВалютаДокумента);
	ПараметрыФормы.Вставить("КурсВзаиморасчетов", ОбъектА.КурсВзаиморасчетов);
	ПараметрыФормы.Вставить("КратностьВзаиморасчетов", ОбъектА.КратностьВзаиморасчетов);
	ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.ДатаПересчета);
	ОткрытьФорму("ОбщаяФорма.КурсВалютыВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.УчетНДСВДокументах" Тогда
		ОбработкаВыбораУчетНДС(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КурсВалютыВДокументах" Тогда
		ОбработкаВыбораКурсыВалют(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчетНДС(Форма, ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		
	КонецЦикла;
	
	Для каждого Стр из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
        //Евросиб Каблов 11.10.2023 ( Ticket#0317657
		Стр.ПолнаяСумма = Стр.Всего;
		Стр.ПолнаяСуммаНДС = Стр.СуммаНДС;
		//Евросиб Каблов 11.10.2023 )
	КонецЦикла;
	РассчитатьСуммыВсегоПоДокументу();
	УстановитьВидимостьКолонокНДС();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВсегоПоДокументу()
	
	ИтогиВсегоНДС = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("СуммаНДС"),0)+?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("СуммаНДС"),0);
	ИтогиВсего = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("Сумма"),0)+ ?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("Сумма"),0)+?(Объект.СуммаВключаетНДС,0,ИтогиВсегоНДС);
//Евросиб Гудкова( 14.01.2020 втф
	//Попытка
	//	Объект.СуммаДокумента = ИтогиВсего;
	//Исключение
	//КонецПопытки;
// Евросиб Гудкова) 	
	Элементы.Валюта.Заголовок = Объект.ВалютаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокНДС()
	Если Не Объект.УчитыватьНДС Тогда
		Элементы.Товары1СтавкаНДС.Видимость = Ложь;
		Элементы.Товары1СуммаНДС.Видимость = Ложь;
		Элементы.Услуги1СтавкаНДС.Видимость = Ложь;
		Элементы.Услуги1СуммаНДС.Видимость = Ложь;
	Иначе
		Элементы.Товары1СтавкаНДС.Видимость = Истина;
		Элементы.Товары1СуммаНДС.Видимость = Истина;
		Элементы.Услуги1СтавкаНДС.Видимость = Истина;
		Элементы.Услуги1СуммаНДС.Видимость = Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурсыВалют(Форма, ВыбранноеЗначение, ИсточникВыбора)
	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;
	
	Объект.ВалютаДокумента = ВыбранноеЗначение.ВалютаДокумента;
	Объект.КратностьВзаиморасчетов = ВыбранноеЗначение.КратностьВзаиморасчетов;
	Объект.КурсВзаиморасчетов = ВыбранноеЗначение.КурсВзаиморасчетов;
	//Гудкова Объект.ДатаПересчета = ВыбранноеЗначение.ДатаДокумента;
	Если СтараяВалюта <> Объект.ВалютаДокумента или СтарыйКурс <> Объект.КурсВзаиморасчетов Тогда
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая, СтруктураНовая);
		РассчитатьСуммыВсегоПоДокументу();
	КОнецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Товары1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры


&НаКлиенте
Процедура Товары1ЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Товары1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры


&НаКлиенте
Процедура Товары1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры


&НаКлиенте
Процедура Услуги1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
// Евросиб Гудкова) 	

	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	СтрТЧ.ПолнаяСумма = СтрТЧ.Всего;
	СтрТЧ.ПолнаяСуммаНДС = СтрТЧ.СуммаНДС;
	//Евросиб Каблов 11.10.2023 )

КонецПроцедуры


&НаКлиенте
Процедура Услуги1ЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Услуги1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
// Евросиб Гудкова) 	

	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	СтрТабЧасти.ПолнаяСумма = СтрТабЧасти.Всего;
	СтрТабЧасти.ПолнаяСуммаНДС = СтрТабЧасти.СуммаНДС;
	//Евросиб Каблов 11.10.2023 )

КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Процедура Услуги1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
// Евросиб Гудкова)

	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	СтрТЧ.ПолнаяСумма = СтрТЧ.Всего;
	СтрТЧ.ПолнаяСуммаНДС = СтрТЧ.СуммаНДС;
	//Евросиб Каблов 11.10.2023 )

КонецПроцедуры


&НаКлиенте
Процедура СчФНадписьНажатие(Элемент)
	
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураПолученный");
	Если РеквизитыСФ <> Неопределено и ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Документ был изменен, будет выполнена запись документа с актуализацией данных подчиненной счет-фактуры. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);	
	КонецЕсли;
	//Если РеквизитыСФ = Неопределено и (ЭтаФорма.Модифицированность Или Не Объект.Проведен) Тогда
	//	ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед созданием счет-фактуры документ необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	//ИначеЕсли
	Если РеквизитыСФ = Неопределено Тогда
		ОбработкаВопросаЗаписи(КодВозвратаДиалога.Да, Истина);
	КонецЕсли;	
	Если РеквизитыСф <> Неопределено и Не ЭтаФорма.Модифицированность Тогда
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаписатьДокументПоступления();
	КонецЕсли;
	
	//Евросиб Каблов 09.12.2020 ( Ticket#0211185
	//БухгалтерскийУчетОбщиеПроцедурыКлиент.ВвестиСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный");
	//РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураПолученный");
	//Если РеквизитыСФ <> Неопределено Тогда
	//	Элементы.СчФНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	//КонецЕсли;
	//БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный");
	//
	//Для каждого СтрТЧ из Объект.Товары Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	//КонецЦикла;
	//Для каждого СтрТЧ из Объект.Услуги Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	//КонецЦикла;
	//РассчитатьСуммыВсегоПоДокументу();	
	ПараметрыФормыСФ = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормыСФ, ЭтаФорма);
	//Евросиб Каблов 09.12.2020 )
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьДокументПоступления()
	СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ЭтотОбъект.Записать(СтруктураЗаписи);	
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступнотиПоПериоду()
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО,Объект.Организация);
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	//Для каждого СтрТЧ из Объект.Товары Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	//КонецЦикла;
	//Для каждого СтрТЧ из Объект.Услуги Цикл
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	//КонецЦикла;
	//Евросиб Каблов 11.10.2023 )
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 14.01.2020 нельзя менять объект после записи
// 	ДополнитьДанные(неопределено);
// Евросиб Гудкова)
	//Евросиб Каблов 02.12.2021 (
	Если ВыполнитьОднократноеРазнесение Тогда
//Евросиб Гудкова( 13.12.2021 Ticket№ 42922
//было
//		ОткрытьФорму("ОбщаяФорма.ФормаАвторазнесения", Новый Структура("Поступление", Объект.Ссылка), Окно,,,,, РежимОткрытияОкнаФормы.Независимый);
//стало
		ОткрытьФорму("ОбщаяФорма.ФормаАвторазнесения", Новый Структура("Поступление, УИДЗамера", Объект.Ссылка, ОценкаПроизводительностиКлиент.ЗамерВремени("АвторазнесениеКлиент")), Окно, Объект.Ссылка,,,, РежимОткрытияОкнаФормы.Независимый);
// Евросиб Гудкова)
	КонецЕсли;
	//Евросиб Каблов 02.12.2021 )
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало 
	Если КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_ДобавлениеИзменениеЗаявкиНаОплату") Тогда
		ПроверитьИСоздатьКомандыСозданияЗаявокНаоплату();
	КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	
	////Евросиб СубботинВ #118799 09.10.2025 Начало
	//РезультатПроверки = ПроверитьВыгрузкуКЗП(); 
	//Если НЕ РезультатПроверки.Количество() = 0 Тогда
	//	ВыгрузитьКЗПвУПП();	
	//КонецЕсли;	
	////Евросиб СубботинВ #118799 09.10.2025 Конец 	
	
КонецПроцедуры 

//&НаСервере
//Процедура ЗапуститьОперацию() 
//	Если РезультатВыполнения <> Неопределено
//		И ЗначениеЗаполнено(РезультатВыполнения.ИдентификаторЗадания) Тогда
//		ДлительныеОперации.ОтменитьВыполнениеЗадания(РезультатВыполнения.ИдентификаторЗадания);
//	КонецЕсли;
//	
//	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
//	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
//	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание актуальных акцептов при закрытии периода БУ'");
//	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
//	
//	МассивСсылок = Новый Массив;
//	МассивСсылок.Добавить(Объект.Ссылка);
//	ПараметрыПроцедуры = Новый Структура;
//	ПараметрыПроцедуры.Вставить(МассивСсылок);
//	
//	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("ПретензииИНеакцептыСервер.РазнестиСписокПТУ", ПараметрыПроцедуры, ПараметрыВыполнения);
//	
//	Если РезультатВыполнения.Статус = "Ошибка" Тогда
//		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
//	КонецЕсли;
//КонецПроцедуры


&НаКлиенте
Процедура Услуги1СписокТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТС", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТС, СоставТС", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТС),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура Услуги1СписокТЕНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТЕ, СоставТЕ", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТЕ),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры


&НаКлиенте
Процедура Услуги1СписокТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТД", Истина));   
	//ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД, ДатаПоискаТранпортныхДокументов", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД, Объект.ДатаВходящегоДокумента),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр2.Свойство("ТС") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТС = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТЕ") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТЕ = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТД") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + ПолучитьКодТД(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТД = ЭТС;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодТД(ТД)
	//Возврат ТД.Номер;                    
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало 
	Результат = "";
	Если ТипЗнч(ТД) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		Результат = ТД.НомерТранспортногоДокумента;
	КонецЕсли;
	Возврат Результат;
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
КонецФункции

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	//Евросиб Гудкова( 23.12.2019 Ticket№ 
	ДоговорКонтрагентаПриИзмененииНаСервере();
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб - АСуслов 17.03.2023 13:41:10 #65868
	//(
	ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(Объект.ДатаПоступленияДокумента, Объект.ДоговорКонтрагента, Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	//)
	//Евросиб - АСуслов 17.03.2023 13:41:12 #65868
	// Евросиб Гудкова) 
	//СтараяВалюта = Объект.ВалютаДокумента;
	//СтарыйКурс = Объект.КурсВзаиморасчетов;
	//СтараяКратность = Объект.КратностьВзаиморасчетов;
	//НадоОчиститьРСчета = Ложь;
	//
	//Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	//	СтрПараметров = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, Объект.ДатаПересчета);//Гудкова Объект.Дата);
	//	НадоОчиститьРСчета = (Объект.ВалютаДокумента <> СтрПараметров.Валюта);
	//	Объект.ВалютаДокумента = СтрПараметров.Валюта;
	//	Объект.КурсВзаиморасчетов = СтрПараметров.Курс;
	//	Объект.КратностьВзаиморасчетов = СтрПараметров.Кратность;
	//КонецЕсли;
	//
	//Если НадоОчиститьРСчета Тогда
	//	Объект.БанковскийСчетКонтрагента = неопределено;
	//	Объект.БанковскийСчетОрганизации = неопределено;
	//КонецЕсли;
	//
	//Если СтараяВалюта <> Объект.ВалютаДокумента  или СтарыйКурс <> Объект.КурсВзаиморасчетов  Тогда
	//	СтруктураТекущая = Новый Структура;
	//	СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
	//	СтруктураТекущая.Вставить("Курс",СтарыйКурс);
	//	СтруктураТекущая.Вставить("Кратность",СтараяКратность);
	//	СтруктураНовая = Новый Структура;
	//	СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
	//	СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
	//	СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
	//	
	//	ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая, СтруктураНовая);
	//	РассчитатьСуммыВсегоПоДокументу();
	//КонецЕсли;
	//Евросиб - АСуслов 04.01.2024 13:28:25 #78327
	//(
	ЗаполнитьТаблицуМультивалютныхДоговоров();
	УстановитьВидимость();
	//)
	//Евросиб - АСуслов 04.01.2024 13:28:30 #78327
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая,СтруктураНовая)
	Для каждого Стр из Объект.Услуги Цикл
		Стр.Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Всего, СтруктураТекущая,СтруктураНовая);
		Стр.Сумма = ?(Объект.СуммаВключаетНДС, Стр.Всего,Стр.Всего/(1+(БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100)));
		Стр.СуммаНДС = ?(Объект.СуммаВключаетНДС,  Стр.Всего*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100,Стр.Всего- Стр.Сумма);
		Стр.Цена = Стр.Сумма/Стр.Количество;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоставщикаПоУмолчанию(Объект.Контрагент);//Гудкова БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
		ДоговорКонтрагентаПриИзмененииНаСервере(); //Гудкова  
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Счет) Тогда
		Объект.БанковскийСчетКонтрагента = ДанныеПоУмолчанию.Счет;
	КонецЕсли;
	
	//Евросиб Каблов 09.12.2020 ( Ticket#0216086
	Объект.РазрешенаВыгрузкаВУПП = Ложь;
	УстановитьДоступностьРазрешенияВыгрузкиВУПП();
	//Евросиб Каблов 09.12.2020 )

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	УстановитьЗаголовокКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьВагоны(Команда)
	
	Если Элементы.Услуги1.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьКонтейнеры(Команда)
	
	Если Элементы.Услуги1.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.Услуги1.ТекущиеДанные;
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		ТекД.СписокТС = СтрСоединить(Параметр1, ";");
		
	ИначеЕсли Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		ТекД.СписокТЕ = СтрСоединить(Параметр1, ";");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1НоменлатураПриИзменении(Элемент)
	
	ТД= Элементы.Услуги1.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТД.Содержание) Тогда
		ТД.Содержание = ПолучитьРеквизитНаСервере(ТД.Номенклатура, "НаименованиеПолное");
	КонецЕсли;
//Евросиб Гудкова( 23.10.2019 Ticket№ 
	//ТД.КатегорияРасходов = ПолучитьРеквизитНаСервере(ТД.Номенклатура, "КатегорияРасходов");
// Евросиб Гудкова) 
	//МассивНоменклатуры = Новый Массив;
	//Для каждого Стр из Объект.Услуги Цикл
	//	МассивНоменклатуры.Добавить(Стр.Номенклатура);
	//КонецЦикла;
	//СписокРазрешенныхСДДС = НоменклатураСервер.ПолучитьСписокРазрешенныхСДДСДляМассиваНоменклатуры(МассивНоменклатуры);
	//Если СписокРазрешенныхСДДС.Найти(Объект.СтатьяДвиженияДенежныхСредств) = неопределено Тогда
	//	Объект.СтатьяДвиженияДенежныхСредств = неопределено;
	//КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитНаСервере(Ссылка, Реквизит)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);
КонецФункции

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//Евросиб - АСуслов 23.11.2023 13:10:34 #77780
	//(
	ОбновитьДетализациюНаСервере();
	//)
	//Евросиб - АСуслов 23.11.2023 13:10:36 #77780
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб - АСуслов 03.03.2023 12:40:13 #65484
	//(
	//Евросиб Гудкова( 15.10.2020 Ticket№ 0210425
	//Если Объект.СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
	//	НомерДатаЗаказаУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;
	//КонецЕсли;
	// Евросиб Гудкова) 	
	//<< Евросиб - Витвицкий 16.07.2019
	//)
	//Евросиб - АСуслов 03.03.2023 12:40:22 #65484
	Если ЗначениеЗаполнено(АдресПрисоединенныхДанных) Тогда
		
		СтруктураДанных = ПолучитьИзВременногоХранилища(АдресПрисоединенныхДанных);
		УдалитьИзВременногоХранилища(АдресПрисоединенныхДанных);
		
		ЕСОбменСервер.ЗаписатьСостояниеДокументаВДиадоке(ТекущийОбъект.Ссылка, СтруктураДанных.СостояниеДокументооборота, ТекущийОбъект.Создано);		
		АдресПрисоединенныхДанных = "";		
	КонецЕсли;
	//>> Евросиб - Витвицкий 16.07.2019	
	//Евросиб - АСуслов 21.11.2022 11:45:51 #58550
	//(
	ВОчередиРазнесения = ПретензииИНеакцептыСервер.ДокументНаходитсяВОчередиАвторазнесения(ТекущийОбъект.Ссылка);
	//)
	//Евросиб - АСуслов 21.11.2022 11:45:53 #58550
	//Евросиб - АСуслов 03.03.2023 14:11:03 #65484
	//(
	ЗаполнитьЗаказыЗаявкиУППНаСервере();
	//)
	//Евросиб - АСуслов 03.03.2023 14:11:06 #65484
	
	//Евросиб Каблов 13.11.2024 ( Ticket#0375504
	ЗаполнитьСтатусыПротоколовПоставщика();
	//Евросиб Каблов 13.11.2024 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	УстановитьДоступностьРеквизита_Страхование();
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0363342, 20-08-2024, начало (проверка на закрытие задачи в непроведенном документе была в модуле, но мешала обновлению статусов ЭДО, перенесена сюда)
	Если НЕ Объект.Проведен И ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
		ПоказатьПредупреждение(,"Запрещено устанавливать статус <Выполнено> в непроведенном документе!");
		ТекущийИсполнитель_Статус = Неопределено;
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0363342, 20-08-2024, конец
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	Модифицированность = Истина;
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
//Евросиб Гудкова( 22.11.2020 Ticket№ 0212786
//		ПараметрыЗапроса = Новый Соответствие;
//		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
////Евросиб Гудкова( 10.08.2020
//		ПараметрыЗапроса.Вставить("Копия", Объект.Копия);
////Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
//		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
//// Евросиб Гудкова)
//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, Объект.Дата);

//		Если РезультатЗапроса.Количество() > 0 Тогда
//			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
//		Иначе
//			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
//		КонецЕсли;

//Евросиб Максимова 17062021 #0216135
		//ПараметрыПТУ = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Штраф, Копия, ЦФО, Автор, Дата, Ссылка");
		ПараметрыПТУ = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Штраф,Претензия,Копия, ЦФО, Автор, Дата, Ссылка");
//Евросиб Максимова 17062021 #0216135
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		ПараметрыПТУ.Вставить("ПолнаяСуммаВСФ");
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		ПараметрыПТУ.Вставить("ВидУслуг");
		//Евросиб Каблов 12.08.2022 )
		
		ЗаполнитьЗначенияСвойств(ПараметрыПТУ, Объект);
		МаршрутизироватьПТУНаСервере(ПараметрыПТУ);
// Евросиб Гудкова) 	
		ОбновитьПанельСостояний();
	КонецЕсли;
	

	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//	ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
	//	//ПараметрыЗапроса.Вставить("РазнесеноПолностью", Объект.РазнесеноПолностью);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

//Евросиб Гудкова( 22.11.2020 Ticket№ 0212786
&НаСервереБезКонтекста
Процедура МаршрутизироватьПТУНаСервере(ПараметрыПТУ)
	
	Документы.ПоступлениеТоваровУслуг.МаршрутизироватьПТУ(ПараметрыПТУ.Ссылка, ПараметрыПТУ);
	
КонецПроцедуры
// Евросиб Гудкова) 	

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗаказВУПП(Команда)
	
	Отказ = Ложь;
	
//ДИТ Давудов М.А. Task 33123 (Ticket#0194926) 16.06.2021 Начало
	ОчиститьСообщения();
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Менеджер по договору!");
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 12.08.2022 )
	
	Если Объект.ДоговорКонтрагента <> ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка")
	   И НЕ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ДоговорКонтрагента, "ПолученОригинал") Тогда 
	   
	   	// ДИТ Поморцева Т.П.  Task 33123 (Ticket#0194926) 22.06.2021 начало
		//ТекстОшибки = НСтр("ru = 'Отсутствует оригинал договора ""%Договор%""'");
		//ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Объект.ДоговорКонтрагента);
		
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		
		//Если Отказ Тогда
		//	Возврат;
		//КонецЕсли;
		
		СтруктураДат = Новый Структура("Дата,СрокПредоставленияОригиналаДней,СрокПредоставленияОригиналаДата");
		ДанныеДоговора = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента,СтруктураДат);
																		
		КолДнейОсталось = Число(НачалоДня(ДанныеДоговора.СрокПредоставленияОригиналаДата) - (НачалоДня(ТекущаяДата()) )) / (60 * 60 * 24);		
		Если КолДнейОсталось > 0 Тогда
			ТекстОшибки = НСтр("ru = 'Отсутствует оригинал договора. Срок предоставления оригинала " + Формат(ДанныеДоговора.СрокПредоставленияОригиналаДата,"ДФ=dd.MM.yyyy") + ". Платежи по договору будут заблокированы через ""%КолДней%"" дней'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КолДней%", КолДнейОсталось);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Объект.ДоговорКонтрагента);
		
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			
		Иначе
			ТекстОшибки = НСтр("ru = 'Платежи по договору ""%Договор%"" заблокированы по причине непредоставления оригинала договора. 
									|Для возобновления платежей необходимо согласование финансового директора на продление периода предоставления оригинала'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КолДней%", КолДнейОсталось);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Объект.ДоговорКонтрагента);
		
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,,, Отказ);

			Если Отказ Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// ДИТ Поморцева Т.П.  Task 33123 (Ticket#0194926) 22.06.2021 конец
	КонецЕсли;
//ДИТ Давудов М.А. Task 33123 (Ticket#0194926) 16.06.2021 Конец

	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;                                        
	СчетЗаказ = Неопределено;
	Если Команда.Имя = "ВыгрузитьЗаказВУПППоСтрокеСвязанныхСчетов" Тогда
		СчетЗаказ = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные.СчетПоставщика;
		СоздатьЗаказПоПТУ = НЕ ЗначениеЗаполнено(СчетЗаказ);
	Иначе
		СоздатьЗаказПоПТУ = Объект.СвязанныеСчетаПоставщиков.НайтиСтроки(Новый Структура("СчетПоставщика", Неопределено)).Количество()>0;
	КонецЕсли;
	//Евросиб - АСуслов 06.02.2024 13:02:07 #78327
	//(
	//Если СоздатьЗаказПоПТУ Тогда
	//	Если Не ЗначениеЗаполнено(Объект.ДатаОплаты) Тогда
	//		//ОбщегоНазначенияКлиент.СообщитьПользователю("Перед созданием заявки на оплату необходимо заполнить Дату оплаты", Объект, "ДатаОплаты", "Объект.ДатаОплаты", Отказ);
	//		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед созданием заявки на оплату необходимо заполнить Дату оплаты", , "ДатаОплаты",, Отказ);
	//	КонецЕсли; 
	//	//Если Не ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) Тогда
	//	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Перед созданием заявки на оплату необходимо заполнить Статью ДДС", Объект, "СтатьяДвиженияДенежныхСредств","Объект.СтатьяДвиженияДенежныхСредств", Отказ);
	//	//КонецЕсли;
	//	Если Отказ Тогда
	//		Возврат;
	//	КонецЕсли; 
	//КонецЕсли;                                                                                                                              
	//)
	//Евросиб - АСуслов 06.02.2024 13:02:09 #78327
	
	ПараметрыОбработки = Новый Структура("НеЗаписан, СчетЗаказ", НеЗаписан, СчетЗаказ);
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаСчет", ЭтаФорма, ПараметрыОбработки);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой заказа ПТУ необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ОбработкаВопросаСчет(КодВозвратаДиалога.Да, ПараметрыОбработки);
	КонецЕсли; 
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаСчет(Ответ = неопределено, Параметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьИВыгрузитьДокументПоступления(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИВыгрузитьДокументПоступления(Параметры)

	Если Параметры.НеЗаписан Тогда
		ЗаписатьДокументПоступления();	
	КонецЕсли; 
	СчетчикВыгруженных = 0;
	СчетчикПовторов = 0;    
	Если Параметры.СчетЗаказ = Неопределено Тогда
		ТаблицаСчетов = Объект.СвязанныеСчетаПоставщиков.Выгрузить(,"СчетПоставщика");
	Иначе                           
		ТаблицаСчетов = Объект.СвязанныеСчетаПоставщиков.Выгрузить(Новый Структура("СчетПоставщика", Параметры.СчетЗаказ),"СчетПоставщика");
	КонецЕсли;
	ВыгрузитьСчетаВУППНаСервере(ТаблицаСчетов, СчетчикВыгруженных, СчетчикПовторов);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По основаниям для заявок выгружено комплектов: " + СчетчикВыгруженных + ". Ранее выгружалось: " + СчетчикПовторов);
	//Евросиб - АСуслов 03.03.2023 12:40:58 #65484
	//(
//Евросиб Гудкова( 25.12.2019 
	//Если Объект.СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
	// 	НомерДатаЗаказаУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;	
	//КонецЕсли;
// Евросиб Гудкова) 	
	ЗаполнитьЗаказыЗаявкиУППНаСервере();
	//)
	//Евросиб - АСуслов 13.03.2023 15:17:55 #65484

КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ВыгрузитьЗаказВУППНаСервере(СсылкаПТУ, СчетчикВыгруженных, СчетчикПовторов)

	Ответ = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(СсылкаПТУ, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	Если ЗначениеЗаполнено(Ответ.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ на основании " + СсылкаПТУ + " уже выгружался в УПП " + Ответ.ДатаОбмена + " пользователем " 
												+ Ответ.Ответственный + ". Повторная выгрузка не требуется.");
		СчетчикПовторов = СчетчикПовторов + 1;
		Возврат;
	КонецЕсли; 
	МассивСсылок = Новый Массив;
	//Евросиб - АСуслов 05.08.2020 15:14:56 #
	//(
	//СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(СсылкаПТУ, "СчетФактураПолученный");
	//Если ЗначениеЗаполнено(СчетФактура) Тогда
	//	Ответ = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(СчетФактура, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	//	Если ЗначениеЗаполнено(Ответ.Ссылка) Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ на основании " + СчетФактура + " уже выгружался в УПП " + Ответ.ДатаОбмена + " пользователем " 
	//												+ Ответ.Ответственный + ". Повторная выгрузка не требуется.");
	//		СчетчикПовторов = СчетчикПовторов + 1;
	//		Возврат;
	//	КонецЕсли; 
	//	МассивСсылок.Добавить(СчетФактура);
	//	ЕСОбменСервер.ПередатьЗаказЗаявкуВУПП(МассивСсылок, "СчетФактураПолученный");
	//Иначе
	//)
	//Евросиб - АСуслов 05.08.2020 15:14:57 #
		МассивСсылок.Добавить(СсылкаПТУ);
		ЕСОбменСервер.ПередатьЗаказЗаявкуВУПП(МассивСсылок, "ПоступлениеТоваровУслуг", 1);
	//КонецЕсли;
	СчетчикВыгруженных = СчетчикВыгруженных + 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьСчетаВУППНаСервере(СсылкиСчетов, СчетчикВыгруженных, СчетчикПовторов)

	МассивСсылок = Новый Массив;
	Для каждого СсылкаСчета Из СсылкиСчетов Цикл
		Отказ = Ложь;
		Ответ = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(СсылкаСчета.СчетПоставщика, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Если ЗначениеЗаполнено(Ответ.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ на основании " + СсылкаСчета.СчетПоставщика + " уже выгружался в УПП " + Ответ.ДатаОбмена + " пользователем " 
													+ Ответ.Ответственный + ". Повторная выгрузка не требуется.",,,,Отказ);
			СчетчикПовторов = СчетчикПовторов + 1;
			Продолжить;
		КонецЕсли; 
		//Евросиб - АСуслов 06.02.2024 13:03:34 #78327
		//(
		//Если Не ЗначениеЗаполнено(СсылкаСчета.СчетПоставщика.ДатаОплаты) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед созданием заявки на оплату в Счете необходимо заполнить Дату оплаты",, СсылкаСчета.СчетПоставщика.ДатаОплаты,, Отказ);
		//КонецЕсли;
		//)
		//Евросиб - АСуслов 06.02.2024 13:03:36 #78327
		//Если Не ЗначениеЗаполнено(СсылкаСчета.СчетПоставщика.СтатьяДвиженияДенежныхСредств) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед созданием заявки на оплату в Счете необходимо заполнить Статью ДДС", СсылкаСчета.СчетПоставщика,,, Отказ);
		//КонецЕсли;
		Если Отказ Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(СсылкаСчета.СчетПоставщика) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			ВыгрузитьЗаказВУППНаСервере(СсылкаСчета.СчетПоставщика, СчетчикВыгруженных, СчетчикПовторов);
		Иначе	
			МассивСсылок.Добавить(СсылкаСчета.СчетПоставщика);
		КонецЕсли; 
	КонецЦикла; 	

	Если МассивСсылок.Количество() > 0 Тогда
		ЕСОбменСервер.ПередатьЗаказЗаявкуВУПП(МассивСсылок, "СчетНаОплатуПоставщика", 1);
	КонецЕсли; 
	СчетчикВыгруженных = СчетчикВыгруженных + МассивСсылок.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	//Объект.ДатаПересчета = Объект.Дата; //ДИТ Гаузер А.В. Ticket#0274990 19.08.2022
	Результат = ПолучитьКурсВалюты();
	Объект.КурсВзаиморасчетов = Результат.Курс;
	Объект.КратностьВзаиморасчетов = Результат.Кратность;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПересчетаПриИзменении(Элемент)
	
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.ДатаПересчета);//Гудкова ПолучитьКурсВалюты();
	Объект.КурсВзаиморасчетов = Результат.Курс;
	Объект.КратностьВзаиморасчетов = Результат.Кратность;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты()
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.ДатаПересчета);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СтатьяДвиженияДенежныхСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//МассивНоменклатуры = Новый Массив;
	//Для каждого Стр из Объект.Услуги Цикл
	//	МассивНоменклатуры.Добавить(Стр.Номенклатура);
	//КонецЦикла;
	//СписокРазрешенныхСДДС = НоменклатураСервер.ПолучитьСписокРазрешенныхСДДСДляМассиваНоменклатуры(МассивНоменклатуры);
	//
	//Элементы.СтатьяДвиженияДенежныхСредств.СписокВыбора.Очистить();
	//Элементы.СтатьяДвиженияДенежныхСредств.СписокВыбора.ЗагрузитьЗначения(СписокРазрешенныхСДДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериодВО(Команда)
	
	Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Сч1 = 0 По Объект.СвязанныеСчетаПоставщиков.Количество()-1 Цикл
		//Евросиб СубботинВ #99021 20.02.2025 Начало
		Если Объект.Претензия и не ЗначениеЗаполнено(Объект.СвязанныеСчетаПоставщиков[Сч1].НомерДатаЗаказаУПП) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("В строке " + (Сч1+1) + " не заполнено поле ""Номер/дата заказа в УПП""");	
			Отказ = Истина;
      	КонецЕсли;
		//Евросиб СубботинВ #99021 20.02.2025 Конец
		
		Для Сч2 = Сч1 + 1 По Объект.СвязанныеСчетаПоставщиков.Количество()-1 Цикл
			
			Если Объект.СвязанныеСчетаПоставщиков[Сч1].СчетПоставщика = Объект.СвязанныеСчетаПоставщиков[Сч2].СчетПоставщика Тогда
				Сообщить("Счет поставщика в строке " + (Сч1+1) + " совпадает со строкой " + (Сч2+1) + ". Исправьте.");
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЦикла;
	
//Евросиб Гудкова( 16.01.2020 включен стандартный механизм проверки
	//Если НЕ ЗначениеЗаполнено(Объект.НомерВходящегоДокумента) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента) Тогда
	//	Сообщить("Требуется заполнить номер и дату входящего документа. Запись невозможна!");
	//	Отказ = Истина;
	//КонецЕсли;
// Евросиб Гудкова) 	
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
//Евросиб Гудкова( 10.08.2020
		ПараметрыЗапроса.Вставить("Копия", Объект.Копия);
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова)

//Евросиб Максимова 17062021 #0216135
		ПараметрыЗапроса.Вставить("Претензия", Объект.Претензия);
//Евросиб Максимова 17062021 #0216135
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		ПараметрыЗапроса.Вставить("ПолнаяСуммаВСФ", Объект.ПолнаяСуммаВСФ / Объект.КратностьВзаиморасчетов * Объект.КурсВзаиморасчетов);
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		ПараметрыЗапроса.Вставить("ВидУслуг", Объект.ВидУслуг);
		//Евросиб Каблов 12.08.2022 )
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;


	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
	//		//ПараметрыЗапроса.Вставить("РазнесеноПолностью", РазнесеноПолностью);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//Евросиб Гудкова( 17.11.2020 Ticket№ 
	
	// Евросиб Гудкова)  
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(Объект);
//	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
//	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
//	Объект.Ссылка.Штраф <> Объект.Штраф ИЛИ 
////Евросиб Максимова 17062021 #0216135
//	Объект.Ссылка.Претензия <> Объект.Претензия ИЛИ 
////Евросиб Максимова 17062021 #0216135
//	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
//	Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	////Евросиб Каблов 28.04.2022 ( Task 50590  
	Документы.ПоступлениеТоваровУслуг.ПроверитьВозможностьВыгрузкиВУПП(ТекущийОбъект, Отказ);
	////Евросиб Каблов 28.04.2022 )
	
	//Евросиб - АСуслов 21.11.2022 10:30:43 #58550
	//(
	//Если ТекущийОбъект.ВОчередиАвторазнесения И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "ВОчередиАвторазнесения") = Ложь Тогда
	//	ВыполнитьОднократноеРазнесение = Истина; 
	//Иначе
	//    ВыполнитьОднократноеРазнесение = Ложь;
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 21.11.2022 10:30:45 #58550
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеСчетаПоставщовСчетПоставщикаПриИзменении(Элемент)
	
	ТекД = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные;
	СуммаТаблицыПривязанныхСчетов = 0;
	Для каждого Стр из Объект.СвязанныеСчетаПоставщиков Цикл
		СуммаТаблицыПривязанныхСчетов = СуммаТаблицыПривязанныхСчетов + Стр.СуммаНаПТУ;
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекД.СчетПоставщика) Тогда
		ПолученнаяСуммаСчета = ПолучитьСуммуСчета(ТекД.СчетПоставщика);
		//СуммаДокументаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(, Объект.ВалютаДокумента, ВалютаРеглУчета, объект.Дата);
		ТекД.СуммаНаПТУ = Макс(Мин(ПолученнаяСуммаСчета, Объект.СуммаДокумента-СуммаТаблицыПривязанныхСчетов+ТекД.СуммаНаПТУ), 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуСчета(СчетПоставщика)
	
	Рез = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПривязанныеСчетаПоставщиковОстатки.СуммаОстаток КАК ОсталосьПривязать
	|ИЗ
	|	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(, СчетПоставщика = &СчетПоставщика) КАК ПривязанныеСчетаПоставщиковОстатки";
	Запрос.УстановитьПараметр("СчетПоставщика", СчетПоставщика);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Рез = Ответ.ОсталосьПривязать;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура СвязанныеСчетаПоставщиковПриИзменении(Элемент)
	
	//Евросиб Коханенко Н.А. 22.09.2023 (( вынесено в отдельную процедуру 
	ИзменениеСтрокиСчетаПоставщиков();
	//Евросиб Коханенко Н.А. 22.09.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 22.09.2023 (( перенесено из Процедуры СвязанныеСчетаПоставщиковПриИзменении  
&НаКлиенте
Процедура ИзменениеСтрокиСчетаПоставщиков()
	
	//Евросиб Каблов 09.10.2020 (
	//Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + (Объект.СуммаДокумента - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ")) + ") оплатить на основании ПТУ";
	ОбновитьТекстОстатокОплатитьНаОснованииПТУ();
	//Евросиб Каблов 09.10.2020 )
//Евросиб Гудкова( 27.10.2020 Ticket№ 0211758
	Объект.СвязьУслугИСчетов.Очистить();
	ОбновитьДетализацию(1);
	РазнестиАвтоматически(неопределено);
	//Евросиб - АСуслов 16.03.2023 11:07:36 #65484
	//(
	ЗаполнитьЗаказыЗаявкиУППНаСервере();
	//)
	//Евросиб - АСуслов 16.03.2023 11:07:39 #65484
// Евросиб Гудкова)                             

КонецПроцедуры
//Евросиб Коханенко Н.А. 22.09.2023 )) 

&НаКлиенте
Процедура ОбновитьТекстОстатокОплатитьНаОснованииПТУ()
	Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + (Объект.ПолнаяСуммаВСФ - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ")) + ") оплатить на основании ПТУ";
КонецПроцедуры
 

&НаКлиенте
Процедура ОстатокОплатитьНаОснованииПТУ(Команда)
	
	СчетаПоставщиковСумма = Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	ОтнесеннаяСуммаОтнесенныхСчетов = 0;
	Для каждого Стр из Объект.СвязанныеСчетаПоставщиков Цикл
		Если ЗначениеЗаполнено(Стр.СчетПоставщика) Тогда ОтнесеннаяСуммаОтнесенныхСчетов = ОтнесеннаяСуммаОтнесенныхСчетов + Стр.СуммаНаПТУ; КонецЕсли;
	КонецЦикла;
	
	//Евросиб Каблов 09.10.2020 (
	//Если (Объект.СуммаДокумента-ОтнесеннаяСуммаОтнесенныхСчетов) = 0 Тогда Возврат; КонецЕсли;
	Если (Объект.ПолнаяСуммаВСФ-ОтнесеннаяСуммаОтнесенныхСчетов) = 0 Тогда Возврат; КонецЕсли;
	//Евросиб Каблов 09.10.2020 )
	
	МассивНС = Объект.СвязанныеСчетаПоставщиков.НайтиСтроки(Новый Структура("СчетПоставщика", ПредопределенноеЗначение("Документ.СчетНаОплатуПоставщика.ПустаяСсылка")));
	Для каждого Стр из МассивНС Цикл
		Объект.СвязанныеСчетаПоставщиков.Удалить(Стр);
	КонецЦикла;
	
	НСтр = Объект.СвязанныеСчетаПоставщиков.Добавить();
	//Евросиб Каблов 09.10.2020 (
	//НСтр.СуммаНаПТУ = Объект.СуммаДокумента-ОтнесеннаяСуммаОтнесенныхСчетов;
	НСтр.СуммаНаПТУ = Объект.ПолнаяСуммаВСФ-ОтнесеннаяСуммаОтнесенныхСчетов;
	//Евросиб Каблов 09.10.2020 )
		
	СвязанныеСчетаПоставщиковПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДетализацию(Команда)
	
//Евросиб Гудкова( 19.01.2020 переделала процедуру, чтобы она не меняла данные формы при открытии формы на чтение или после записи объекта
	Если Команда <> неопределено Тогда //заполнение по кнопке
		Объект.СвязьУслугИСчетов.Очистить();
		Для каждого СтрУслуги из Объект.Услуги Цикл
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
				СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			СтрНайдена = Ложь;
			Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
				Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
					ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание,СписокТС,СписокТЕ,СписокТД");
					СтрНайдена = Истина;
				КонецЕсли;
			КонецЦикла;
			
			//Евросиб Каблов 11.10.2023 ( Ticket#0317657
			//Если НЕ СтрНайдена и СтрУслуги.Всего <> 0 Тогда
			//	НСтр = Объект.СвязьУслугИСчетов.Добавить();
			//	ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Номенклатура,Содержание,СписокТС,СписокТЕ,СписокТД,Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС");
			//КонецЕсли;
			Если НЕ СтрНайдена И (СтрУслуги.Всего <> 0 Или СтрУслуги.ПолнаяСумма <> 0) Тогда			
				НСтр = Объект.СвязьУслугИСчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Номенклатура,Содержание,СписокТС,СписокТЕ,СписокТД,Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС,ПолнаяСумма,ПолнаяСуммаНДС");
			КонецЕсли;
			//Евросиб Каблов 11.10.2023 )
		КонецЦикла;
	Иначе //обновление отображения
		ОбновитьДетализациюНаСервере();
	КонецЕсли;
// Евросиб Гудкова) 	

КонецПроцедуры                         

&НаСервере
Процедура ОбновитьДетализациюНаСервере()

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.НомерСтроки КАК НомерСтроки,
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
		|	ПоступлениеТоваровУслугУслуги.УдПеревыставление КАК УдПеревыставление,
		|	ПоступлениеТоваровУслугУслуги.СписокТС КАК СписокТС,
		|	ПоступлениеТоваровУслугУслуги.СписокТЕ КАК СписокТЕ,
		|	ПоступлениеТоваровУслугУслуги.СписокТД КАК СписокТД,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ПоступлениеТоваровУслугУслуги.ПолнаяСумма КАК ПолнаяСумма,
		|	ПоступлениеТоваровУслугУслуги.ПолнаяСуммаНДС КАК ПолнаяСуммаНДС
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	&ПоступлениеТоваровУслугУслуги КАК ПоступлениеТоваровУслугУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки КАК НомерСтроки,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК СчетПоставщика,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма КАК ОтнесеннаяСумма,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Всего КАК Всего,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма КАК ПолнаяСумма,
		|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС КАК ПолнаяСуммаНДС
		|ПОМЕСТИТЬ ВТ_СвязьУслугИСчетов
		|ИЗ
		|	&ПоступлениеТоваровУслугСвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.НомерСтроки КАК НомерСтроки,
		|	ВТ_Услуги.Номенклатура КАК Номенклатура,
		|	ВТ_Услуги.Содержание КАК Содержание,
		|	ВТ_Услуги.Количество КАК Количество,
		|	ВТ_Услуги.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Услуги.Сумма КАК Сумма,
		|	ВТ_Услуги.СуммаНДС КАК СуммаНДС,
		|	ВТ_Услуги.Цена КАК Цена,
		|	ВТ_Услуги.УдПеревыставление КАК УдПеревыставление,
		|	ВТ_Услуги.СписокТС КАК СписокТС,
		|	ВТ_Услуги.СписокТЕ КАК СписокТЕ,
		|	ВТ_Услуги.СписокТД КАК СписокТД,
		|	ВТ_Услуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ВТ_Услуги.Всего КАК Всего,
		|	ВТ_Услуги.ИДТД КАК ИДТД,
		|	ВТ_Услуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ_Услуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_Услуги.ПолнаяСумма КАК ПолнаяСумма,
		|	ВТ_Услуги.ПолнаяСуммаНДС КАК ПолнаяСуммаНДС
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУслугИСчетов КАК ВТ_СвязьУслугИСчетов
		|		ПО ВТ_Услуги.ГУИДПТУ = ВТ_СвязьУслугИСчетов.ГУИДПТУ";
		Запрос.УстановитьПараметр("ПоступлениеТоваровУслугУслуги",Объект.Услуги.Выгрузить());
		Запрос.УстановитьПараметр("ПоступлениеТоваровУслугСвязьУслугИСчетов", Объект.СвязьУслугИСчетов.Выгрузить());
		//Для каждого СтрУслуги из Объект.Услуги Цикл
		//	Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
		//		Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
		//			ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание,СписокТС,СписокТЕ,СписокТД");
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЦикла;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл                 
			СтрСвязи = Объект.СвязьУслугИСчетов.НайтиСтроки(Новый Структура("ГУИДПТУ", Выборка.ГУИДПТУ));
			Для каждого СтрСвязь Из СтрСвязи Цикл
				ЗаполнитьЗначенияСвойств(СтрСвязь, Выборка, "Номенклатура,Содержание,СписокТС,СписокТЕ,СписокТД");
			КонецЦикла;
		КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура РазнестиАвтоматически(Команда)
	
	РазнестиАвтоматическиНаСервере();
	ОбновитьДетализацию(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура РазнестиАвтоматическиНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РазнестиУслугиАвтоматически();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура Услуги1ПриИзменении(Элемент)
	
	СвязанныеСчетаПоставщиковПриИзменении(неопределено);
	ОбновитьДетализацию(неопределено);
	РассчитатьСуммыВсегоПоДокументу();
	
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	//Если Объект.СуммаВключаетНДС Тогда
	//	Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	//Иначе
	//	Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	//КонецЕсли;
// Евросиб Гудкова) 	
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СуммаНДСПриИзменении(Элемент)
	
	ТекД = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(ТекД,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
// Евросиб Гудкова)
	
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	ТекД.ПолнаяСумма = ТекД.Всего;
	ТекД.ПолнаяСуммаНДС = ТекД.СуммаНДС;
	//Евросиб Каблов 11.10.2023 )
	
КонецПроцедуры

//// Евросиб Фролов (28.10.2021 
//// Кнопка на форме удалена
//&НаКлиенте
//Процедура ЗагрузитьИзExcel(Команда)
//	Об = ПолучитьФорму("Обработка.ЗагрузкаВСФизExcel.Форма",Новый Структура("ОбъектВСФ", Объект));
//	Об.Открыть();
//КонецПроцедуры
//// Евросиб Фролов)

&НаКлиенте
Процедура ОбработкаВыбораСделки(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьВагоныИКТК(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиТаблицыВагоновИКТК", ЭтаФорма);
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаВставкиВагоновИКТК",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Евросиб Гудкова( 23.12.2019 
&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	Объект.ДатаПересчета = Объект.ДатаВходящегоДокумента;
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.ДатаПересчета);
	Объект.КурсВзаиморасчетов = Результат.Курс;
	Объект.КратностьВзаиморасчетов = Результат.Кратность;
	
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаСФХЖ =  Объект.ДатаВходящегоДокумента;
		//++ДИТ Гаузер А.В. Ticket#0274990 15.08.2022
		Объект.ДатаПересчета =  Объект.ДатаВходящегоДокумента;
		//--ДИТ Гаузер А.В. Ticket#0274990 15.08.2022
	КонецЕсли;
	//Евросиб Литвинов) 	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()

	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;
	НадоОчиститьРСчета = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		СтрПараметров = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, Объект.ДатаПересчета);//Гудкова Объект.Дата);
		НадоОчиститьРСчета = (Объект.ВалютаДокумента <> СтрПараметров.Валюта);
		Объект.ВалютаДокумента = СтрПараметров.Валюта;
		Объект.КурсВзаиморасчетов = СтрПараметров.Курс;
		Объект.КратностьВзаиморасчетов = СтрПараметров.Кратность;
	КонецЕсли;
	
	Если НадоОчиститьРСчета Тогда
		Объект.БанковскийСчетКонтрагента = неопределено;
		Объект.БанковскийСчетОрганизации = неопределено;
	КонецЕсли;
	
	Если СтараяВалюта <> Объект.ВалютаДокумента  или СтарыйКурс <> Объект.КурсВзаиморасчетов  Тогда
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая, СтруктураНовая);
	КонецЕсли;
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Объект.Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(Объект.ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
	
КонецПроцедуры
 
//&НаСервереБезКонтекста
//Функция ОбновитьНомерДатуЗаказаУПП(Ссылка, ВидОбмена)

//	НомерИДата = "";
//	Запрос = новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВБУ,
//	               |	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ
//	               |ИЗ
//	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	               |			ПротоколОбменов.Объект КАК Объект,
//	               |			ПротоколОбменов.УзелОбмена КАК УзелОбмена,
//	               |			МАКСИМУМ(ПротоколОбменов.НУИНУ) КАК НУИНУ
//	               |		ИЗ
//	               |			РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
//	               |		ГДЕ
//	               |			ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(перечисление.УзлыОбмена."+ВидОбмена+")
//	               |			И ПротоколОбменов.Объект = &Ссылка
//	               |		
//	               |		СГРУППИРОВАТЬ ПО
//	               |			ПротоколОбменов.УзелОбмена,
//	               |			ПротоколОбменов.Объект) КАК ВложенныйЗапрос
//	               |		ПО ПротоколОбменов.УзелОбмена = ВложенныйЗапрос.УзелОбмена
//	               |			И ПротоколОбменов.Объект = ВложенныйЗапрос.Объект
//	               |			И ПротоколОбменов.НУИНУ = ВложенныйЗапрос.НУИНУ";
//	
//	Запрос.УстановитьПараметр("ссылка", Ссылка);
//	Результат = Запрос.Выполнить().Выбрать();
//	Если Результат.Следующий() Тогда
//		Возврат Результат;
//	Иначе
//		Возврат Новый Структура("НомерДатаВБУ, ПроведенВБУ", "", Ложь);
//	КонецЕсли;
//	

//КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьСтатусЭДО(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_Документы.Документ КАК Документ,
	|	Диадок_Документы.Статус КАК Статус
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ =&Документ";
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе	
		Возврат "";
	КонецЕсли; 	

КонецФункции // ОбновитьСтатусЭДО()
 
&НаКлиенте
Процедура Услуги1ПриАктивизацииСтроки(Элемент)
	
	//ТекД = Элементы.Услуги1.ТекущиеДанные;
	//Если ТекД <> неопределено ТОгда
	//	Элементы.Услуги1Группа7.Доступность = ТекД.Перевыставление;
	//КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКонтрагента()

	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		СтранаКонтрагента = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
		ЭтоРезидент = СтранаКонтрагента = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		Элементы.Контрагент.Заголовок = "Контрагент " + ?(ЭтоРезидент, "резидент", "нерезидент");
	КонецЕсли; 

КонецПроцедуры // УстановитьЗаголовокКонтрагента()

&НаКлиенте
Процедура СвязанныеСчетаПоставщиковСчетПоставщикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    ТекущиеДанные = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные;
	
	ТекущиеДанные.СчетПоставщика = ПредопределенноеЗначение("Документ.СчетНаОплатуПоставщика.ПустаяСсылка");
	
    Если ТекущиеДанные.СчетПоставщика = Неопределено Тогда
        Возврат
    КонецЕсли;
    
    СтандартнаяОбработка = Ложь;
    
    ОткрытьФормуВыбораДокумента(ТекущиеДанные.СчетПоставщика, ТекущиеДанные);    
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуВыбораДокумента(Ссылка, ТекущиеДанные)
	
	ИмяФормыВыбора = ПолучитьИмяФормыВыбораПоСсылке(Ссылка);
	
	ПараметрыОтбора  = Новый Структура;        
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
    	ПараметрыОтбора.Вставить("СписокДоступныхСчетов", ПолучитьСписокСчетов(Объект.Дата,Объект.Контрагент,Объект.ДоговорКонтрагента,Неопределено));
		ПараметрыОтбора.Вставить("Контрагент",Объект.Контрагент);
		ПараметрыОтбора.Вставить("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	КонецЕсли;
    
	ОпОп = новый ОписаниеОповещения("ОбработкаВыбораСчета", ЭтаФорма, ТекущиеДанные);
	ОткрытьФорму(ИмяФормыВыбора,ПараметрыОтбора ,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСчетов(ДатаДок,Контрагент,Договор,СчетПоставщика)
	
	СписокСчетов = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
	   "ВЫБРАТЬ
	   |	ОстаткиПоСчетам.СчетПоставщика КАК Номенклатура,
	   |	ОстаткиПоСчетам.СчетПоставщика КАК Счет,
	   |	ОстаткиПоСчетам.СуммаОстаток КАК СуммаСчетаОстаток
	   |ИЗ
	   |	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
	   //|			&МоментВремени,
	   //|			СчетПоставщика.Контрагент = &Контрагент
	   //|				И СчетПоставщика.ДоговорКонтрагента = &Договор
	   //ДИТ, Беляев СЮ, Ticket#0309546, 16-05-2023, начало
	   |			,
	   |			СчетПоставщика.Контрагент = &Контрагент
	   |				И СчетПоставщика.ДоговорКонтрагента = &Договор
	   //|				И СчетПоставщика.Дата <= &ДатаПоступления //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, закомментировал, согласовано отключение условия по дате
	   //ДИТ, Беляев СЮ, Ticket#0309546, 16-05-2023, конец
   	   |) КАК ОстаткиПоСчетам
	   |ГДЕ
	   |	ОстаткиПоСчетам.СуммаОстаток > 0");
	   
    //ГраницаКонтроля = Новый Граница(ДатаДок, ВидГраницы.Включая);
    //Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
    //ДИТ, Беляев СЮ, Ticket#0309546, 16-05-2023, начало
    //Запрос.УстановитьПараметр("ДатаПоступления", КонецДня(ДатаДок)); //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, закомментировал, согласовано отключение условия по дате
    //ДИТ, Беляев СЮ, Ticket#0309546, 16-05-2023, конец
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Запрос.УстановитьПараметр("Договор", Договор);
 
    РезультатЗапроса = Запрос.Выполнить();
    
    ТЗ = РезультатЗапроса.Выгрузить();
    Для Каждого СТр Из ТЗ Цикл
   	 	Если СчетПоставщика = Неопределено Тогда
			СписокСчетов.Добавить(Стр.Счет);
		Иначе
			СписокСчетов.Добавить(Новый Структура("Счет, СуммаСчетаОстаток", Стр.Счет, Стр.СуммаСчетаОстаток));
		КонецЕсли;
	КонецЦикла;
   
	Возврат СписокСчетов;
	
КонецФункции	
	
&НаСервереБезКонтекста
Функция ПолучитьИмяФормыВыбораПоСсылке(Ссылка)
    Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаВыбора";
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораСчета(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	Параметр2.СчетПоставщика =  Параметр1;
	
	// по умолчанию сумма счета = сумме остатка по оплате ПТУ
	//Евросиб Каблов 09.10.2020 (
	//СуммаТекСчета = Объект.СуммаДокумента - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	СуммаТекСчета = Объект.ПолнаяСуммаВСФ - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	//Евросиб Каблов 09.10.2020 )
	
	//мультивалютка
	СписокСумм = ПолучитьСписокСчетов(Объект.Дата,Объект.Контрагент,Объект.ДоговорКонтрагента,Параметр1);
	//Если СписокСумм.Количество()>0 Тогда
	//	СуммаТекСчета = Мин(СуммаТекСчета,СписокСумм[0].Значение);
	//КонецЕсли;
	Для каждого СтруктураСчета Из СписокСумм Цикл
		Если СтруктураСчета.Значение.Счет = Параметр1 Тогда
			СуммаТекСчета = Мин(СуммаТекСчета,СтруктураСчета.Значение.СуммаСчетаОстаток);
		КонецЕсли;
	КонецЦикла;               
	//мультивалютка
	
	Параметр2.СуммаНаПТУ = СуммаТекСчета;
	//Евросиб Каблов 09.10.2020 (
	//Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + (Объект.СуммаДокумента - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ")) + ") оплатить на основании ПТУ";
	Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + (Объект.ПолнаяСуммаВСФ - Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ")) + ") оплатить на основании ПТУ";
	//Евросиб Каблов 09.10.2020 ) 
	
	//Евросиб Коханенко Н.А. 22.09.2023 (( Ticket#0325508 #75277 
	ИзменениеСтрокиСчетаПоставщиков();
	//Евросиб Коханенко Н.А. 22.09.2023 )) Ticket#0325508 #75277 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуКонтурЭДОНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_Документы.BoxId КАК BoxId,
	|	Диадок_Документы.DocumentId КАК DocumentId,
	|	Диадок_Документы.LetterId КАК LetterId
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		//ШаблонАдрес = "https://diadoc.kontur.ru/%1/Document/Show?letterId=%2&documentId=%3";
		ШаблонАдрес = Константы.ШаблонАдресаДокументаВДиадок.Получить();
		Адрес = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонАдрес,
																		Выборка.BoxId,
																		Выборка.LetterId,
																		Выборка.DocumentId);
																		
	Иначе
		Адрес = Неопределено;																
	КонецЕсли;
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура ОткрытьВКонтурЭДО(Команда)
	АдресСсылки = ПолучитьСсылкуКонтурЭДОНаСервере();
	Если АдресСсылки = Неопределено Тогда
		Сообщить("Не удалось сгенерировать ссылку для открытия документа на сайте Контур.Диадок");
		Возврат;
	КонецЕсли; 
	//ЗапуститьПриложение(АдресСсылки);
	ПерейтиПоНавигационнойСсылке(АдресСсылки);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРазнесения(ИмяКоманды)
	
	ТекД = Элементы.Услуги1.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораСделки", ЭтаФорма);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПТУ",Объект.Ссылка);
	ПараметрыОтбора.Вставить("НомерСтроки",ТекД.НомерСтроки);
	ПараметрыОтбора.Вставить("СуммаКРазнесению",ТекД.Всего);
	Если ИмяКоманды = "РазнестиКакПеревыставляемые" Тогда
		ПараметрыОтбора.Вставить("Перевыставляемые",Истина);
	Иначе
		ПараметрыОтбора.Вставить("Перевыставляемые",Ложь);
	КонецЕсли;
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаРазнесенияНаСделку",ПараметрыОтбора ,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиНаСделку(Команда)
	
	ОткрытьФормуРазнесения(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиКакСобственные(Команда)
	ОткрытьФормуРазнесения(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.ГУИДПТУ = Новый УникальныйИдентификатор();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СуммаПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
//Евросиб Гудкова( 22.10.2020 Ticket№ 0211393
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
// Евросиб Гудкова)

	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	СтрТабЧасти.ПолнаяСумма = СтрТабЧасти.Всего;
	СтрТабЧасти.ПолнаяСуммаНДС = СтрТабЧасти.СуммаНДС;
	//Евросиб Каблов 11.10.2023 )

КонецПроцедуры

&НаКлиенте
Процедура КопияПриИзменении(Элемент)
	
	Если Объект.Копия Тогда
		Объект.ДатаПолученияОригинала = '00010101';
		Элементы.ДатаПолученияОригинала.Доступность = Ложь;
	Иначе
		Объект.ДатаПолученияОригинала = ТекущаяДата();
		Элементы.ДатаПолученияОригинала.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	Для Каждого СтрТЧ Из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
		//Евросиб Каблов 11.10.2023 ( Ticket#0317657
		СтрТЧ.ПолнаяСумма = СтрТЧ.Всего;
		СтрТЧ.ПолнаяСуммаНДС = СтрТЧ.СуммаНДС;
		//Евросиб Каблов 11.10.2023 )
	КонецЦикла;
		
	РассчитатьСуммыВсегоПоДокументу();
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанВСФ" Тогда
		РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект, "СчетФактураПолученный");
		Элементы.СчФНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
//Евросиб Гудкова( 02.01.2021 Ticket№0218691 
		НомерВСФ = РеквизитыСФ.НомерВходящегоДокумента;
		ДатаВСФ = РеквизитыСФ.ДатаВходящегоДокумента;
// Евросиб Гудкова) 		

	// ++ Дудоров С.В. Ticket#61931 29.11.2022
	//// ++ ДИТ Сгонник, 21-10-26 №27109
	//ИначеЕсли ИмяСобытия = "ЗаписьПоступлениеТоваровУслуг" Тогда 
	//	ЭтаФорма.ОбновитьОтображениеДанных();
	//	ЭтаФорма.Прочитать();
	//	ОбновитьПанельТекущегоПользователя();
	//	ОбновитьПанельСостояний();
	//// -- ДИТ Сгонник, 21-10-26 №27109
	// -- Дудоров С.В. Ticket#61931 29.11.2022
		
	КонецЕсли;
КонецПроцедуры

//Евросиб Каблов 09.12.2020 Ticket#0216086
&НаКлиенте
Процедура РазрешенаВыгрузкаВУПППриИзменении(Элемент)
	
	Если Объект.РазрешенаВыгрузкаВУПП Тогда
		Объект.РазрешилВыгрузкуВУПП = ПользователиКлиент.ТекущийПользователь();
		Объект.ДатаРазрешенияВыгрузкиВУПП = ТекущаяДата();
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = СтрШаблон("Разрешена выгрузка в 1С УПП (%1;%2)", Объект.РазрешилВыгрузкуВУПП, Объект.ДатаРазрешенияВыгрузкиВУПП);
	Иначе
		Объект.РазрешилВыгрузкуВУПП = Неопределено;		
		Объект.ДатаРазрешенияВыгрузкиВУПП = '00010101';
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = "Разрешена выгрузка в 1С УПП";
	КонецЕсли;
		
КонецПроцедуры

//Евросиб Каблов 09.12.2020 Ticket#0216086
&НаСервере
Процедура УстановитьДоступностьРазрешенияВыгрузкиВУПП()
	
	ДоступностьФлажка = КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСАкцептами");
	
	Если ДоступностьФлажка Тогда
		ДоступностьФлажка = ПоступлениеДоступноДляВыгрузкиВУПП();
	КонецЕсли;
	
	Элементы.РазрешенаВыгрузкаВУПП.Доступность = ДоступностьФлажка;
	
КонецПроцедуры

//Евросиб Каблов 09.12.2020 Ticket#0216086
&НаСервере
Функция ПоступлениеДоступноДляВыгрузкиВУПП()
	
	Если Не Объект.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтранаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
	ЭтоРезидент = СтранаКонтрагента = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Если ЭтоРезидент Тогда
		ДоступноДляВыгрузки = Не Объект.Копия;
	Иначе
		ДоступноДляВыгрузки = Истина;
	КонецЕсли;
	
	Возврат ДоступноДляВыгрузки;
		
КонецФункции

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ДИТ Поморцева Т.П. Задача 29231 (38715) 21.09.21. начало - отключено временно, код в разработке
// на форме кнопка "Услуги1ПривязатьКПериодуИспользования" отключена
// на форме закладка "ГруппаПериодыИспользованияКТК" отключена
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//&НаКлиенте
//Процедура ПривязатьКТКкПериодуИспользования(Команда)
//	
//	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
//	
//		Сообщить("Предварительно требуется записать документ!");
//		Возврат;
//	
//	КонецЕсли; 
//	
//	ТаблицаСопоставления.Очистить();
//	
//	ПриСозданииНаСервереПривязки();
//	
//	Элементы.ГруппаСтраницыДанных.ТекущаяСтраница = Элементы.ГруппаПериодыИспользованияКТК;
//	
//КонецПроцедуры

//// Процедура перезаполняет таблицу значений "ТаблицаСопоставления"
//&НаСервере
//Процедура ПриСозданииНаСервереПривязки()
//	
//	РасчитанныйПериодПользования.Очистить();
//	
//	// На входе ПТУ + массив строк с номером КТК
//	ПТУ = Объект.Ссылка;
//	
//	//// Расчет цен:
//	СоотЦен = Новый Соответствие; СоотНДС = Новый Соответствие;
//	СписокКТК = Новый Массив;
//	Для каждого Стр Из Объект.Услуги Цикл
//		
//		// Если хоть одна услуга не относится к аренде КТК - это не наш случай, выход
//		
//		МасТЕ = СтрРазделить(Стр.СписокТЕ, ";");
//		
//		Для каждого СтрТЕ Из МасТЕ Цикл
//			
//			ТекКТ = СокрЛП(СтрТЕ);
//			
//			СписокКТК.Добавить(ТекКТ);
//			
//			Если ТекКТ <> "" Тогда
//				
//				ИтогПоиск = СоотЦен.Получить(ТекКТ);
//				
//				Если ИтогПоиск <> Неопределено  Тогда
//					СоотЦен.Вставить(ТекКТ, 0 + Стр.Цена + ИтогПоиск); // Мало ли, КТ окажется в нескольких строках (и ведь оказываются!)
//				Иначе
//					СоотЦен.Вставить(ТекКТ, Стр.Цена); 
//				КонецЕсли; 
//				
//			КонецЕсли; 
//			
//			СоотНДС.Вставить(ТекКТ, Новый Структура("СтавкаНДС, Услуга", Стр.СтавкаНДС, Стр.Номенклатура) ); 
//			
//		КонецЦикла; 
//		
//	КонецЦикла;
//	
//	Если ЭтоПТУсАрендой_КТК = Ложь Тогда
//	
//		Возврат;
//	
//	КонецЕсли; 
//	
//	//////
//	НомСтр = 1;
//	
//	БудТЗ = ТаблицаСопоставления.Выгрузить();
//	БудТЗ.Колонки.Добавить("ПТУ", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг") );
//	БудТЗ.Колонки.Добавить("СНП", Новый ОписаниеТипов("Булево") );
//	БудТЗ.Очистить();
//	Для каждого Стр Из СписокКТК Цикл
//	
//		НовСтр = БудТЗ.Добавить();
//		НовСтр.КТК = Стр;
//		НовСтр.ПТУ = ПТУ;
//		НовСтр.СНП = ЭтоПТУсСНП_КТК;
//	
//	КонецЦикла; 
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	БудТЗ.ПТУ КАК ПТУ,
//	               |	БудТЗ.КТК КАК КТК,
//	               |	БудТЗ.СНП КАК СНП
//	               |ПОМЕСТИТЬ ВхДанНеобработанные
//	               |ИЗ
//	               |	&БудТЗ КАК БудТЗ
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	КТК,
//	               |	ПТУ,
//	               |	СНП
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВхДанНеобработанные.ПТУ КАК ПТУ,
//	               |	ВхДанНеобработанные.КТК КАК КТК,
//	               |	ВхДанНеобработанные.СНП КАК СНП,
//	               |	ТЕ.Ссылка КАК КТК_Ссылка
//	               |ПОМЕСТИТЬ ВхТаб
//	               |ИЗ
//	               |	ВхДанНеобработанные КАК ВхДанНеобработанные
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
//	               |		ПО ВхДанНеобработанные.КТК = ТЕ.Наименование
//	               |			И (НЕ ТЕ.ПометкаУдаления)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВхДанНеобработанные.КТК,
//	               |	ВхДанНеобработанные.ПТУ,
//	               |	ВхДанНеобработанные.СНП,
//	               |	ТЕ.Ссылка
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВхТаб.ПТУ КАК ПТУ,
//	               |	ВхТаб.КТК КАК КТК,
//	               |	ВхТаб.СНП КАК СНП,
//	               |	ВхТаб.КТК_Ссылка КАК КТК_Ссылка
//	               |ИЗ
//	               |	ВхТаб КАК ВхТаб";;
//	
//	Запрос.УстановитьПараметр("БудТЗ", БудТЗ);
//	МасКТ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КТК_Ссылка");
//	
//	// Прочитаем прошлую привязку:
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ВхТаб.ПТУ КАК ПТУ,
//	               |	ВхТаб.КТК КАК КТК,
//	               |	ВхТаб.СНП КАК СНП,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС КАК ПериодС,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо КАК ПериодПо,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СуммаЗаПериод КАК ЦенаЗаПериод,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СрокВозврата КАК СрокВозврата,
//	               |	ВхТаб.КТК_Ссылка КАК КТК_Ссылка,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПорядокПривязки КАК ПорядокПривязки,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КоличествоДнейСНП КАК КоличествоДнейСНП,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.УИД КАК УИД,
//	               |	ВЫБОР
//	               |		КОГДА ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС ЕСТЬ NULL
//	               |			ТОГДА ЛОЖЬ
//	               |		ИНАЧЕ ИСТИНА
//	               |	КОНЕЦ КАК ИмеетсяПривязка
//	               |ПОМЕСТИТЬ ВсеПривязки
//	               |ИЗ
//	               |	ВхТаб КАК ВхТаб
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
//	               |		ПО ВхТаб.ПТУ = ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ
//	               |			И ВхТаб.КТК = ПривязкаПоступленияКПериодуИспользованияКТК.КТК
//	               |			И ВхТаб.СНП = ПривязкаПоступленияКПериодуИспользованияКТК.СНП
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВсеПривязки.ПТУ КАК ПТУ,
//	               |	ВсеПривязки.КТК КАК КТК,
//	               |	ВсеПривязки.СНП КАК СНП,
//	               |	ВсеПривязки.ПериодС КАК ПериодС,
//	               |	ВсеПривязки.ПериодПо КАК ПериодПо,
//	               |	ВсеПривязки.ЦенаЗаПериод КАК ЦенаЗаПериод,
//	               |	ВсеПривязки.СрокВозврата КАК СрокВозврата,
//	               |	ВсеПривязки.КТК_Ссылка КАК КТК_Ссылка,
//	               |	ВсеПривязки.ПорядокПривязки КАК ПорядокПривязки,
//	               |	ВсеПривязки.КоличествоДнейСНП КАК КоличествоДнейСНП,
//	               |	ВсеПривязки.УИД КАК УИД,
//	               |	ВсеПривязки.ИмеетсяПривязка КАК ИмеетсяПривязка
//	               |ИЗ
//	               |	ВсеПривязки КАК ВсеПривязки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РасчитанныйПериодПользованияСНП.НормативныйПериодАрендыС КАК НормативныйПериодАрендыС,
//	               |	РасчитанныйПериодПользованияСНП.НормативныйПериодАрендыПо КАК НормативныйПериодАрендыПо,
//	               |	РасчитанныйПериодПользованияСНП.СрокВозврата КАК СрокВозврата,
//	               |	РасчитанныйПериодПользованияСНП.УИД КАК УИД,
//	               |	РасчитанныйПериодПользованияСНП.ПользованиеС КАК ПользованиеС,
//	               |	РасчитанныйПериодПользованияСНП.ПользованиеПо КАК ПользованиеПо,
//	               |	РасчитанныйПериодПользованияСНП.ПривязаноКоличествоДней КАК ПривязаноКоличествоДней,
//	               |	РасчитанныйПериодПользованияСНП.ЦенаЗаДень КАК ЦенаЗаДень
//	               |ИЗ
//	               |	РегистрСведений.РасчитанныйПериодПользованияСНП КАК РасчитанныйПериодПользованияСНП
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	               |			ВсеПривязки.УИД КАК УИД
//	               |		ИЗ
//	               |			ВсеПривязки КАК ВсеПривязки
//	               |		
//	               |		СГРУППИРОВАТЬ ПО
//	               |			ВсеПривязки.УИД) КАК ВсеУИДы
//	               |		ПО РасчитанныйПериодПользованияСНП.УИД = ВсеУИДы.УИД
//	               |ГДЕ
//	               |	ВсеУИДы.УИД <> """"";
//	
//	Запрос.УстановитьПараметр("ПТУ", ПТУ);
//	Резы = Запрос.ВыполнитьПакет();
//	
//	Выборка = Резы[1].Выбрать();
//	ВыборкаРасчПольз = Резы[2].Выбрать();
//	
//	//Если ЭтоПТУсСНП_КТК Тогда
//	//    // Т.к. СНП могут падать на любые периоды, то пытаться автоматически привязывать не имеет смысла
//	//	СоотПеридов = Новый Соответствие;
//	//
//	//Иначе
//	
//	// Т.к. СНП могут падать на любые периоды, то пытаться автоматически привязывать не имеет смысла (кроме ситуаций когда период один, и имеется стоимость СНП)
//	Если ЭтоПТУсСНП_КТК Тогда

//		СоотПеридов = ОпределитьКолПериодовСНП(МасКТ, ПТУ, ЭтоПТУсСНП_КТК, СоотЦен);
//	
//	Иначе
//	
//		СоотПеридов = ОпределитьКолПериодов(МасКТ, ПТУ, ЭтоПТУсСНП_КТК);
//	
//	КонецЕсли; 
//	
//	//КонецЕсли;
//	
//	МасПерезапись = Новый Массив;
//	МасРаспр = Новый Массив;
//	ТекНомСтр = 1;
//	Пока Выборка.Следующий() Цикл
//		
//		ИскСтр = ТаблицаСопоставления.НайтиСтроки(Новый Структура("КТК", Выборка.КТК) );
//		Если ИскСтр.Количество() = 0 Тогда
//			
//			НовСтр = ТаблицаСопоставления.Добавить();
//			
//		Иначе
//			
//			НовСтр = ИскСтр[0];
//			
//		КонецЕсли;  
//		
//		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
//		НовСтр.НомерСтрокиТ = ТекНомСтр;
//		
//		СуммаЗаПериод = СоотЦен.Получить( Строка(НовСтр.КТК) );
//		СуммаЗаПериод = ?(СуммаЗаПериод=Неопределено, 0, СуммаЗаПериод);
//		НовСтр.СуммаЗаПериод = СуммаЗаПериод;
//		НовСтр.ПорядковыйНомерПТУсСНП 	= Выборка.ПорядокПривязки;
//		НовСтр.РасчетноеКолДнейСНП		= Выборка.КоличествоДнейСНП;
//		НовСтр.ВерноеКоличествоДнейСНП  = Выборка.КоличествоДнейСНП;
//		
//		Рез_Услуга_НДС  = СоотНДС.Получить( Строка(НовСтр.КТК) );
//		НовСтр.СтавкаНДС= Рез_Услуга_НДС.СтавкаНДС;
//		НовСтр.Услуга 	= Рез_Услуга_НДС.Услуга;
//		
//		Если Выборка.ИмеетсяПривязка = Ложь Тогда
//			
//			// Пытаемся найти не задействованный период аренды:
//			РезПоиска = СоотПеридов.Получить(Выборка.КТК_Ссылка);
//			Если РезПоиска <> Неопределено Тогда
//				
//				Если РезПоиска.Свойство("ПериодПользования") Тогда
//				     // это автоматический выбор СНП
//					 СрокАр = РезПоиска.ПериодПользования.СрокАренды;
//					 
//					 НовСтр.ПериодС = РезПоиска.ПериодПользования.ПериодВзятия;
//					 НовСтр.ПериодПо = РезПоиска.ПериодПользования.ПериодВзятия + 24 * 3600 * ?(СрокАр=0 ИЛИ СрокАр=1, 0, СрокАр-1 );
//					 НовСтр.СрокВозврата = РезПоиска.ПериодПользования.СрокАренды;
//					 
//					 НовСтр.ПорядковыйНомерПТУсСНП 	= РезПоиска.ПорядокПривязки;
//					 НовСтр.РасчетноеКолДнейСНП		= РезПоиска.ВсегоПолучДней;
//					 НовСтр.ВерноеКоличествоДнейСНП	= ?(Цел(РезПоиска.ВсегоПолучДней)=РезПоиска.ВсегоПолучДней, РезПоиска.ВсегоПолучДней, Цел(РезПоиска.ВсегоПолучДней)+1);
//					 
//					 СтарыйУИД = НовСтр.УИД;
//					 // Очистка старого УИДа
//					 Если СтарыйУИД <> "" Тогда
//						 
//						 ИскМас_Расч = РасчитанныйПериодПользования.НайтиСтроки(Новый Структура("УИД", СтарыйУИД) );
//						 МасУд = Новый Массив;
//						 Для каждого Стр_ИскМас_Расч Из ИскМас_Расч Цикл
//							 
//							 МасУд.Добавить(РасчитанныйПериодПользования.Индекс(Стр_ИскМас_Расч));
//							 
//						 КонецЦикла; 
//						 
//						 Для СчИнд = 0 По МасУд.Количество()-1 Цикл
//							 
//							 ТекИндМас = МасУд.Количество() - 1 - СчИнд;
//							 
//							 РасчитанныйПериодПользования.Удалить(РасчитанныйПериодПользования[МасУд[ТекИндМас]]);
//							 
//						 КонецЦикла;
//						 
//						 НЗ = РегистрыСведений.РасчитанныйПериодПользованияСНП.СоздатьНаборЗаписей();
//						 НЗ.Отбор.УИД.Установить(СтарыйУИД);
//						 НЗ.Записать();
//						 
//					 КонецЕсли; 
//					 
//					 Для каждого СтрРаспр Из РезПоиска.МасРаспр Цикл
//						 
//						 НовСтр.УИД = СтрРаспр.УИД;
//						 
//						 НовСтрРаспр = РасчитанныйПериодПользования.Добавить();
//						 ЗаполнитьЗначенияСвойств(НовСтрРаспр, СтрРаспр);
//						 
//						 МасРаспр.Добавить( СтрРаспр ); // переносим строку
//						 
//					 КонецЦикла; 
//					 
//					 ОпЗаписи = Новый Структура("КТК, КТК_Ссылка, ПериодС, ПериодПо, СрокВозврата, СуммаЗаПериод, УИД");
//					 ЗаполнитьЗначенияСвойств(ОпЗаписи, НовСтр);
//					 ОпЗаписи.Вставить("КоличествоДнейСНП", НовСтр.РасчетноеКолДнейСНП);
//					 ОпЗаписи.Вставить("ПорядокПривязки", 	НовСтр.ПорядковыйНомерПТУсСНП);
//					 ОпЗаписи.Вставить("СтавкаНДС", 		НовСтр.СтавкаНДС);
//					 ОпЗаписи.Вставить("Услуга", 			НовСтр.Услуга);
//					 
//					 МасПерезапись.Добавить(ОпЗаписи);
//				
//				Иначе
//					
//					НовСтр.ПериодС 		= РезПоиска.ПериодВзятия;
//					НовСтр.ПериодПо 	= РезПоиска.ПериодВзятия + 24 * 3600 * ?(РезПоиска.СрокАренды=0 ИЛи РезПоиска.СрокАренды=1, 0, РезПоиска.СрокАренды-1);
//					НовСтр.СрокВозврата = РезПоиска.СрокАренды;
//					
//					ОпЗаписи = Новый Структура("КТК, КТК_Ссылка, ПериодС, ПериодПо, СрокВозврата, СуммаЗаПериод, СтавкаНДС, Услуга");
//					ЗаполнитьЗначенияСвойств(ОпЗаписи, НовСтр);
//					
//					МасПерезапись.Добавить(ОпЗаписи);
//				
//				КонецЕсли; 
//				
//			КонецЕсли; 
//			
//		КонецЕсли; 
//		
//		ТекНомСтр = ТекНомСтр + 1;
//		
//	КонецЦикла;
//	
//	Пока ВыборкаРасчПольз.Следующий() Цикл
//	
//		НовСтрРасч = РасчитанныйПериодПользования.Добавить();
//		ЗаполнитьЗначенияСвойств(НовСтрРасч, ВыборкаРасчПольз);
//	
//	КонецЦикла; 
//	
//	/// Проверка:
//	ТЗПроверка = Резы[1].Выгрузить();
//	ТЗПроверка.Колонки.Добавить("Кол");
//	ТЗПроверка.ЗаполнитьЗначения(1, "Кол");
//	ТЗПроверка.Свернуть("КТК", "Кол");
//	
//	ОшибкаЕсть = Ложь;
//	
//	Для каждого Стр Из ТЗПроверка Цикл
//		
//		Если ТипЗнч(Стр.Кол) <> Тип("Число") Тогда
//		
//			Сообщить("По КТ " + Стр.КТК + "обнаружена неизвестная ошибка!");
//			ОшибкаЕсть = Истина;
//			Продолжить;
//		
//		КонецЕсли; 
//		
//		Если Стр.Кол > 1 Тогда
//		
//			Сообщить("По КТ " + Стр.КТК + "обнаружено задвоение в справонике ""ТранспортныхЕдиниц"". Исправьте справочник и перезайдите на форму!");
//			ОшибкаЕсть = Истина;
//			Продолжить;
//		
//		КонецЕсли; 
//	
//	КонецЦикла; 
//	
//	ТекХар = Неопределено;
//	
//	Для каждого Стр Из Объект.Услуги Цикл
//		
//		ТекХар = ПолучитьХарУслуги(Стр.Номенклатура);
//		Прервать;
//		
//	КонецЦикла; 
//	
//	Если ТекХар = Неопределено Тогда
//		Сообщить("Не удалось получить получить характеристики Номенклатуры в строке 1 !");
//		Возврат;
//	КонецЕсли; 
//	
//	Если Не ОшибкаЕсть Тогда
//		
//		СтарыйУИД = "";
//		
//		ЗаписатьНаСервереБезКонтекста(Объект.Ссылка, МасПерезапись, МасРаспр, СтарыйУИД, ТекХар);
//		
//		//ЗаписатьНаСервереБезКонтекста(Объект.Ссылка, МасПерезапись, ВыбранноеЗначение.МасРаспр, СтарыйУИД, ТекХар);
//		
//	КонецЕсли; 
//	
//	ВозмОшибка = Ложь; 
//	Для каждого Стр Из ТаблицаСопоставления Цикл
//	
//		Если Стр.РасчетноеКолДнейСНП > 999 Тогда
//		
//			ВозмОшибка = Истина;
//			Прервать;
//		
//		КонецЕсли; 
//	
//	КонецЦикла; 
//	
//	Если ВозмОшибка Тогда
//	
//		Сообщить("Расчетное количество дней СНП превышает 999! Проверьте валюту в ПТУ, СНП и их курс!");
//	
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаСервере
//Функция ОпределитьКолПериодов(МасКТ, ПТУ, СНП)

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	стоки_ТекущиеДанные.КТК КАК КТК,
//	               |	НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ) КАК тек_ДатаПриемаВПользование,
//	               |	стоки_ТекущиеДанные.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	ВЫБОР
//	               |		КОГДА стоки_ТекущиеДанные.тек_СрокВозврата = 0
//	               |				ИЛИ стоки_ТекущиеДанные.тек_СрокВозврата = 1
//	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ), ДЕНЬ, 0)
//	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ), ДЕНЬ, стоки_ТекущиеДанные.тек_СрокВозврата - 1)
//	               |	КОНЕЦ КАК ПериодПо,
//	               |	стоки_ТекущиеДанные.Период КАК Период,
//	               |	стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
//	               |ПОМЕСТИТЬ ИзнВыб1
//	               |ИЗ
//	               |	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
//	               |ГДЕ
//	               |	стоки_ТекущиеДанные.КТК В(&КТК)
//	               |	И стоки_ТекущиеДанные.тек_ДатаПриемаВПользование <> ДАТАВРЕМЯ(1, 1, 1)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
//	               |	ИзнВыб1.КТК КАК КТК,
//	               |	МАКСИМУМ(ИзнВыб1.Период) КАК Период
//	               |ПОМЕСТИТЬ ИзнВыб2
//	               |ИЗ
//	               |	ИзнВыб1 КАК ИзнВыб1
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК,
//	               |	ИзнВыб1.КТК
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ИзнВыб1.КТК КАК КТК,
//	               |	ИзнВыб1.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
//	               |	ИзнВыб1.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	ИзнВыб1.ПериодПо КАК ПериодПо,
//	               |	ИзнВыб1.Период КАК Период,
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
//	               |ПОМЕСТИТЬ ИзнВыб
//	               |ИЗ
//	               |	ИзнВыб1 КАК ИзнВыб1
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзнВыб2 КАК ИзнВыб2
//	               |		ПО ИзнВыб1.КТК = ИзнВыб2.КТК
//	               |			И ИзнВыб1.Период = ИзнВыб2.Период
//	               |			И ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК = ИзнВыб2.ПорядковыйНомерЦиклаАрендыКТК
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ИзнВыб1.КТК,
//	               |	ИзнВыб1.ПериодПо,
//	               |	ИзнВыб1.тек_ДатаПриемаВПользование,
//	               |	ИзнВыб1.Период,
//	               |	ИзнВыб1.тек_СрокВозврата,
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК КАК КТК,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС КАК ПериодС,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо КАК ПериодПо,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СрокВозврата КАК СрокВозврата,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка КАК КТК_Ссылка
//	               |ПОМЕСТИТЬ ИмеющиесяПривязкиБезТекущих
//	               |ИЗ
//	               |	РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
//	               |ГДЕ
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка В(&КТК)
//	               |	И ВЫБОР
//	               |			КОГДА &СНП
//	               |				ТОГДА ЛОЖЬ
//	               |			ИНАЧЕ ПривязкаПоступленияКПериодуИспользованияКТК.СНП = &СНП
//	               |		КОНЕЦ
//	               |	И ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ <> &ПТУ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ИзнВыб.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
//	               |	ИзнВыб.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	ИзнВыб.ПериодПо КАК ПериодПо,
//	               |	ИзнВыб.КТК КАК КТК
//	               |ИЗ
//	               |	ИзнВыб КАК ИзнВыб
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИмеющиесяПривязкиБезТекущих КАК ИмеющиесяПривязкиБезТекущих
//	               |		ПО ИзнВыб.КТК = ИмеющиесяПривязкиБезТекущих.КТК
//	               |			И ИзнВыб.тек_ДатаПриемаВПользование = ИмеющиесяПривязкиБезТекущих.ПериодС
//	               |			И ИзнВыб.ПериодПо = ИмеющиесяПривязкиБезТекущих.ПериодПо
//	               |ГДЕ
//	               |	ИмеющиесяПривязкиБезТекущих.ПериодС ЕСТЬ NULL
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ИзнВыб.тек_ДатаПриемаВПользование,
//	               |	ИзнВыб.тек_СрокВозврата,
//	               |	ИзнВыб.ПериодПо,
//	               |	ИзнВыб.КТК";
//	
//	Запрос.УстановитьПараметр("КТК", МасКТ);
//	Запрос.УстановитьПараметр("ПТУ", ПТУ);
//	Запрос.УстановитьПараметр("СНП", СНП);
//	//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
//	Результат = Запрос.Выполнить();
//	ТЗ_выборка = Результат.Выгрузить();
//	ТЗ_выборка.Индексы.Добавить("КТК");
//	
//	ИтогоКолВариантов = Новый Соответствие;
//	
//	Для каждого Стр Из МасКТ Цикл
//	
//		ИскМас = ТЗ_выборка.НайтиСтроки(Новый Структура("КТК", Стр) );
//		
//		Если ИскМас.Количество() = 1 Тогда
//		    
//			ИтогоКолВариантов.Вставить(Стр, Новый Структура("ПериодВзятия, СрокАренды", ИскМас[0].тек_ДатаПриемаВПользование, ИскМас[0].тек_СрокВозврата ) );
//		
//		КонецЕсли; 
//		
//	КонецЦикла; 

//	Возврат ИтогоКолВариантов;
//	
//КонецФункции // ОпределитьКолПериодов(МасКТ, ПТУ, СНП)

//&НаСервере
//Функция ОпределитьКолПериодовСНП(МасКТ, ПТУ, СНП, СоотЦен)

//	ИтогоКолВариантов = Новый Соответствие;
//	
//	ПериодыПользования = Новый ТаблицаЗначений;
//	ПериодыПользования.Колонки.Добавить("КТК");
//	ПериодыПользования.Колонки.Добавить("ПериодВзятия");
//	ПериодыПользования.Колонки.Добавить("СрокАренды");
//	ПериодыПользования.Колонки.Добавить("ДатаОкончанияАренды");
//	ПериодыПользования.Колонки.Добавить("ЗарегистрированоДнейСНП_ДокументамиРанее");
//	ПериодыПользования.Колонки.Добавить("ВсегоДнейСНП");
//	ПериодыПользования.Колонки.Добавить("Остаток");
//	ПериодыПользования.Колонки.Добавить("ДнейСНП_ПоСуммеДокумента");
//	ПериодыПользования.Колонки.Добавить("УИД");
//	ПериодыПользования.Колонки.Добавить("ПорядокПривязки");
//	ПериодыПользования.Колонки.Добавить("ВерноеКолДнейСНП");
//	
//	ТаблицаРаспределенияЦены = Новый ТаблицаЗначений;
//	ТаблицаРаспределенияЦены.Колонки.Добавить("НормативныйПериодАрендыС");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("НормативныйПериодАрендыПо");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("СрокВозврата");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("УИД");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("С");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("По");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("ЦенаЗаДень");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("ПривязаноКоличествоДней");
//	ТаблицаРаспределенияЦены.Колонки.Добавить("СуммаЗаПериод");
//	
//	КакОкруглить = 0; // Значение по-умолчанию - в большую сторону
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	стоки_ТекущиеДанные.КТК КАК КТК,
//	               |	НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ) КАК тек_ДатаПриемаВПользование,
//	               |	стоки_ТекущиеДанные.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	ВЫБОР
//	               |		КОГДА стоки_ТекущиеДанные.тек_СрокВозврата = 0
//	               |				ИЛИ стоки_ТекущиеДанные.тек_СрокВозврата = 1
//	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ), ДЕНЬ, 0)
//	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ), ДЕНЬ, стоки_ТекущиеДанные.тек_СрокВозврата - 1)
//	               |	КОНЕЦ КАК ПериодПо,
//	               |	стоки_ТекущиеДанные.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток,
//	               |	стоки_ТекущиеДанные.комм_Валюта КАК комм_Валюта,
//	               |	стоки_ТекущиеДанные.ГУИДЗаписи КАК ГУИДЗаписи,
//	               |	стоки_ТекущиеДанные.Период КАК Период,
//	               |	стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
//	               |ПОМЕСТИТЬ ИзнВыб1
//	               |ИЗ
//	               |	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
//	               |ГДЕ
//	               |	стоки_ТекущиеДанные.КТК В(&КТК)
//	               |	И стоки_ТекущиеДанные.тек_ДатаПриемаВПользование <> ДАТАВРЕМЯ(1, 1, 1)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
//	               |	ИзнВыб1.КТК КАК КТК,
//	               |	МАКСИМУМ(ИзнВыб1.Период) КАК Период
//	               |ПОМЕСТИТЬ ИзнВыб2
//	               |ИЗ
//	               |	ИзнВыб1 КАК ИзнВыб1
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК,
//	               |	ИзнВыб1.КТК
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ИзнВыб1.КТК КАК КТК,
//	               |	ИзнВыб1.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
//	               |	ИзнВыб1.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	ИзнВыб1.ПериодПо КАК ПериодПо,
//	               |	ИзнВыб1.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток,
//	               |	ИзнВыб1.Период КАК МаксимальныйПериодЗаписи,
//	               |	ИзнВыб1.комм_Валюта КАК комм_Валюта,
//	               |	ИзнВыб1.ГУИДЗаписи КАК ГУИДЗаписи,
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
//	               |ПОМЕСТИТЬ СгруппПериоды
//	               |ИЗ
//	               |	ИзнВыб1 КАК ИзнВыб1
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзнВыб2 КАК ИзнВыб2
//	               |		ПО ИзнВыб1.КТК = ИзнВыб2.КТК
//	               |			И ИзнВыб1.Период = ИзнВыб2.Период
//	               |			И ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК = ИзнВыб2.ПорядковыйНомерЦиклаАрендыКТК
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ИзнВыб1.КТК,
//	               |	ИзнВыб1.ПериодПо,
//	               |	ИзнВыб1.тек_ДатаПриемаВПользование,
//	               |	ИзнВыб1.Период,
//	               |	ИзнВыб1.тек_СрокВозврата,
//	               |	ИзнВыб1.тек_ДатаСдачиВСток,
//	               |	ИзнВыб1.комм_Валюта,
//	               |	ИзнВыб1.ГУИДЗаписи,
//	               |	ИзнВыб1.ПорядковыйНомерЦиклаАрендыКТК
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	СгруппПериоды.КТК КАК КТК,
//	               |	СгруппПериоды.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
//	               |	СгруппПериоды.тек_СрокВозврата КАК тек_СрокВозврата,
//	               |	СгруппПериоды.ПериодПо КАК ПериодПо,
//	               |	СгруппПериоды.МаксимальныйПериодЗаписи КАК МаксимальныйПериодЗаписи,
//	               |	ВЫБОР
//	               |		КОГДА СгруппПериоды.тек_ДатаСдачиВСток = ДАТАВРЕМЯ(1, 1, 1)
//	               |			ТОГДА 999999
//	               |		КОГДА СгруппПериоды.тек_ДатаСдачиВСток < СгруппПериоды.ПериодПо
//	               |			ТОГДА 0
//	               |		ИНАЧЕ РАЗНОСТЬДАТ(СгруппПериоды.ПериодПо, СгруппПериоды.тек_ДатаСдачиВСток, ДЕНЬ)
//	               |	КОНЕЦ КАК ВсегоДнейСНП,
//	               |	СгруппПериоды.комм_Валюта КАК ВалютаСНПАренды,
//	               |	СгруппПериоды.ГУИДЗаписи КАК ГУИДЗаписи
//	               |ИЗ
//	               |	СгруппПериоды КАК СгруппПериоды
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	МаксимальныйПериодЗаписи
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	СгруппПериоды.КТК КАК КТК,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ КАК ПТУ,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК КАК КТК1,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СНП КАК СНП,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка КАК КТК_Ссылка,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС КАК ПериодС,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо КАК ПериодПо,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СрокВозврата КАК СрокВозврата,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СуммаЗаПериод КАК СуммаЗаПериод,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПорядокПривязки КАК ПорядокПривязки,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КоличествоДнейСНП КАК КоличествоДнейСНП,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.УИД КАК УИД,
//	               |	ВЫБОР
//	               |		КОГДА ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ = &ПТУ
//	               |			ТОГДА ИСТИНА
//	               |		ИНАЧЕ ЛОЖЬ
//	               |	КОНЕЦ КАК ЭтоТекущПТУ
//	               |ИЗ
//	               |	СгруппПериоды КАК СгруппПериоды
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
//	               |		ПО СгруппПериоды.КТК = ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка
//	               |			И СгруппПериоды.тек_ДатаПриемаВПользование = ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС
//	               |			И СгруппПериоды.тек_СрокВозврата = ПривязкаПоступленияКПериодуИспользованияКТК.СрокВозврата
//	               |			И (ПривязкаПоступленияКПериодуИспользованияКТК.СНП)
//	               |ГДЕ
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ <> &ПТУ
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	ПорядокПривязки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	стоки_КлиентскоеОперирование.КТК КАК КТК,
//	               |	стоки_КлиентскоеОперирование.Период КАК Период,
//	               |	стоки_ТекущиеДанные_СНП.От КАК От,
//	               |	стоки_ТекущиеДанные_СНП.До КАК До,
//	               |	стоки_ТекущиеДанные_СНП.Сумма КАК Сумма,
//	               |	стоки_ТекущиеДанные_СНП.ГУИДЗаписи КАК ГУИДЗаписи
//	               |ПОМЕСТИТЬ ПоискСНП1
//	               |ИЗ
//	               |	РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные_СНП КАК стоки_ТекущиеДанные_СНП
//	               |		ПО стоки_КлиентскоеОперирование.ГУИДЗаписи = стоки_ТекущиеДанные_СНП.ГУИДЗаписи
//	               |			И (стоки_КлиентскоеОперирование.КТК В (&КТК))
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПоискСНП1.КТК КАК КТК,
//	               |	МАКСИМУМ(ПоискСНП1.Период) КАК Период
//	               |ПОМЕСТИТЬ ПоискСНП2
//	               |ИЗ
//	               |	ПоискСНП1 КАК ПоискСНП1
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ПоискСНП1.КТК
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПоискСНП1.КТК КАК КТК,
//	               |	ПоискСНП1.Период КАК Период,
//	               |	ПоискСНП1.От КАК От,
//	               |	ПоискСНП1.До КАК До,
//	               |	ПоискСНП1.Сумма КАК Сумма,
//	               |	ПоискСНП1.ГУИДЗаписи КАК ГУИДЗаписи
//	               |ИЗ
//	               |	ПоискСНП1 КАК ПоискСНП1
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоискСНП2 КАК ПоискСНП2
//	               |		ПО ПоискСНП1.КТК = ПоискСНП2.КТК
//	               |			И ПоискСНП1.Период = ПоискСНП2.Период";
//	
//	Запрос.УстановитьПараметр("КТК", МасКТ);
//	Запрос.УстановитьПараметр("ПТУ", ПТУ);
//	//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
//	Резы = Запрос.ВыполнитьПакет();
//	Выборка = Резы[3].Выбрать();
//	
//	ТЗ_ПривязанныеДоки = Резы[4].Выгрузить();
//	ТЗ_ПериодыСНП = Резы[7].Выгрузить();
//	
//	ДанныеОДок = Новый Структура("Валюта, Курс, Период", ПТУ.ВалютаДокумента, ПТУ.КурсВзаиморасчетов, ?(ПТУ.ДатаВходящегоДокумента=Дата(1,1,1), ПТУ.Дата, ПТУ.ДатаВходящегоДокумента) );
//	ДанныеОДок.Курс = ?(ДанныеОДок.Курс=0, 1, ДанныеОДок.Курс);
//	ИнаяВалюта = Неопределено;
//	
//	Пока Выборка.Следующий() Цикл
//		
//		ВалютаСНП = Выборка.ВалютаСНПАренды;
//		
//		Если ВалютаСНП <> ДанныеОДок.Валюта И ЗначениеЗаполнено(ВалютаСНП) Тогда
//			
//			Если ИнаяВалюта = Неопределено Тогда
//			
//				ИнаяВалюта = ПолучитьДанВалюты(ВалютаСНП, ДанныеОДок.Период);
//			
//			КонецЕсли; 
//			
//			КурсКоэф = (ДанныеОДок.Курс) / ИнаяВалюта.Курс;
//			
//		Иначе
//			
//			КурсКоэф = 1;
//			
//		КонецЕсли;
//		
//		РаспределяемаяСумма = СоотЦен.Получить(Строка(Выборка.КТК));
//		
//		РеквПоиска = Новый Структура("КТК_Ссылка, ПериодС, СрокВозврата, ЭтоТекущПТУ", Выборка.КТК, Выборка.тек_ДатаПриемаВПользование, Выборка.тек_СрокВозврата, ЛОЖЬ);
//		
//		ТЗ_ТекПривязок = ТЗ_ПривязанныеДоки.Скопировать(РеквПоиска);
//		
//		ТЗ_ТекПривязок.Сортировать("ПорядокПривязки");
//		
//		КолДоковПривязки = ТЗ_ТекПривязок.Количество();
//		
//		ТЗ_ТекПривязок.Свернуть("КТК_Ссылка", "КоличествоДнейСНП");
//		
//		Если ТЗ_ТекПривязок.Количество() > 0 Тогда
//		
//			ЗарегистрированоДнейСНП_ДокументамиРанее = ТЗ_ТекПривязок[0].КоличествоДнейСНП;
//			ПорядокПривязки = КолДоковПривязки+1; 
//		
//		Иначе
//		
//			ЗарегистрированоДнейСНП_ДокументамиРанее = 0;
//			ПорядокПривязки = 1;
//		
//		КонецЕсли; 
//		
//		ТЗ_СНП_ТекКТ = ТЗ_ПериодыСНП.Скопировать(Новый Структура("КТК", Выборка.КТК) );
//		
//		// РаспределяемаяСумма
//		ЦенаФиксированная = Ложь;
//		
//		Если ТЗ_СНП_ТекКТ.Количество() = 0 Тогда
//			
//			ЦенаФиксированная = Истина;
//			ТекЦенаСНП = 0;
//		
//		ИначеЕсли ТЗ_СНП_ТекКТ.Количество() = 1 Тогда
//			
//			ЦенаФиксированная = Истина;
//			ТекЦенаСНП = ТЗ_СНП_ТекКТ[0].Сумма;
//			
//		ИначеЕсли ТЗ_СНП_ТекКТ.Количество() > 1 Тогда
//			
//			ЦенаФиксированная = Ложь;
//			ТекЦенаСНП = ТЗ_СНП_ТекКТ[0].Сумма;
//		
//		КонецЕсли; 
//		
//		// Цена в зарегистрированной валюте СНП, пересчет между валютами не требуется
//		
//		ТекУИД = "";
//		ДатаОкончанияАренды = Выборка.тек_ДатаПриемаВПользование + ?(Выборка.тек_СрокВозврата=0 ИЛИ Выборка.тек_СрокВозврата=1, 0, 24 * 3600 * (Выборка.тек_СрокВозврата-1)) ;
//		НовСтрРаспр = Неопределено;
//		
//		ТекущийДеньСНП = ЗарегистрированоДнейСНП_ДокументамиРанее + 1;
//		ТекУИД = Строка(Новый УникальныйИдентификатор);
//		
//		МасДобРаспределений = Новый Массив;  // Требуется для корректного переноса сумм за период
//		
//		Если ЦенаФиксированная Тогда
//		
//			Если ТекЦенаСНП = 0 Тогда
//			
//				ДнейСНП_ПоСуммеДокумента = 999999;
//			
//			Иначе
//			
//				ДнейСНП_ПоСуммеДокумента = (РаспределяемаяСумма*КурсКоэф) / ТекЦенаСНП;
//			
//			КонецЕсли; 
//			
//			// Требуется данная запись, чтобы точно определить дни, в которые происходил данный СНП. Это даст корректно определить клиентские периоды использования
//			НовСтрРаспр = ТаблицаРаспределенияЦены.Добавить();
//			НовСтрРаспр.НормативныйПериодАрендыС = Выборка.тек_ДатаПриемаВПользование;
//			НовСтрРаспр.НормативныйПериодАрендыПо= ДатаОкончанияАренды;
//			НовСтрРаспр.СрокВозврата= Выборка.тек_СрокВозврата;
//			НовСтрРаспр.УИД 		= ТекУИД;
//			НовСтрРаспр.С 			= ТекущийДеньСНП;
//			НовСтрРаспр.По 			= ТекущийДеньСНП + ДнейСНП_ПоСуммеДокумента;
//			НовСтрРаспр.ЦенаЗаДень 	= ТекЦенаСНП;
//			НовСтрРаспр.ПривязаноКоличествоДней = ДнейСНП_ПоСуммеДокумента;
//			НовСтрРаспр.СуммаЗаПериод= РаспределяемаяСумма*КурсКоэф;
//			
//			МасДобРаспределений.Добавить(НовСтрРаспр);
//		
//		Иначе
//		
//			ТЗ_СНП_ТекКТ.Сортировать("От");
//			
//			ПрошлоеЗначНасчитано = 0;
//			НасчитаноДней = 0;
//			ЦенаОстаток = РаспределяемаяСумма*КурсКоэф;
//			СуммаЗаПериод = 0;
//			
//			Для каждого СтрТекПериода Из ТЗ_СНП_ТекКТ Цикл
//				
//				СуммаЗаПериод = 0;
//				
//				Если ТекущийДеньСНП >= СтрТекПериода.От И ТекущийДеньСНП <= СтрТекПериода.До Тогда
//				
//					ТекСумма = СтрТекПериода.Сумма;
//					
//				Иначе
//					Продолжить;
//				КонецЕсли; 
//				
//				//// Запоминаем распределение цены, согласно периодам (+):
//				Если НовСтрРаспр = Неопределено Тогда
//				
//					НовСтрРаспр = ТаблицаРаспределенияЦены.Добавить();
//					НовСтрРаспр.НормативныйПериодАрендыС = Выборка.тек_ДатаПриемаВПользование;
//					НовСтрРаспр.НормативныйПериодАрендыПо= ДатаОкончанияАренды;
//					НовСтрРаспр.СрокВозврата= Выборка.тек_СрокВозврата;
//					НовСтрРаспр.УИД 		= ТекУИД;
//					НовСтрРаспр.С 			= ТекущийДеньСНП;
//					НовСтрРаспр.По 			= 0;
//					НовСтрРаспр.ЦенаЗаДень 	= 0;
//					НовСтрРаспр.ПривязаноКоличествоДней = 0;
//					НовСтрРаспр.СуммаЗаПериод = 0;
//					
//					МасДобРаспределений.Добавить(НовСтрРаспр);
//					
//				КонецЕсли; 
//				
//				//// Запоминаем распределение цены, согласно периодам (-)
//				
//				Пока ТекущийДеньСНП >= СтрТекПериода.От И ТекущийДеньСНП <= СтрТекПериода.До Цикл
//				
//					Если (ЦенаОстаток - ТекСумма) >= 0 Тогда
//						
//						НасчитаноДней = НасчитаноДней + 1;
//						ТекущийДеньСНП = ТекущийДеньСНП + 1;
//						ЦенаОстаток = ЦенаОстаток - ТекСумма;
//						СуммаЗаПериод = СуммаЗаПериод + ТекСумма; 
//						
//					Иначе
//						
//						НасчитаноДней = НасчитаноДней + ЦенаОстаток/ТекСумма;
//						ТекущийДеньСНП = ТекущийДеньСНП + ЦенаОстаток/ТекСумма;
//						СуммаЗаПериод = СуммаЗаПериод + ЦенаОстаток;
//						ЦенаОстаток = 0;
//						
//					КонецЕсли; 
//					
//					Если ЦенаОстаток = 0 Тогда
//						
//						НовСтрРаспр.По = ТекущийДеньСНП;
//						НовСтрРаспр.ЦенаЗаДень = ТекСумма;
//						НовСтрРаспр.ПривязаноКоличествоДней = НасчитаноДней - ПрошлоеЗначНасчитано;
//						НовСтрРаспр.СуммаЗаПериод = СуммаЗаПериод;
//						
//						Прервать;
//					
//					КонецЕсли; 
//					
//					Если НЕ (ТекущийДеньСНП >= СтрТекПериода.От И ТекущийДеньСНП <= СтрТекПериода.До) Тогда
//					
//						НовСтрРаспр.По = ТекущийДеньСНП-1;
//						НовСтрРаспр.ЦенаЗаДень = ТекСумма;
//						НовСтрРаспр.ПривязаноКоличествоДней = НасчитаноДней - ПрошлоеЗначНасчитано;
//						НовСтрРаспр.СуммаЗаПериод = СуммаЗаПериод;
//						
//						НовСтрРаспр = ТаблицаРаспределенияЦены.Добавить();
//						НовСтрРаспр.НормативныйПериодАрендыС = Выборка.тек_ДатаПриемаВПользование;
//						НовСтрРаспр.НормативныйПериодАрендыПо= ДатаОкончанияАренды;
//						НовСтрРаспр.СрокВозврата= Выборка.тек_СрокВозврата;
//						НовСтрРаспр.УИД 		= ТекУИД;
//						НовСтрРаспр.С 			= ТекущийДеньСНП;
//						НовСтрРаспр.По 			= 0;
//						НовСтрРаспр.ЦенаЗаДень 	= 0;
//						НовСтрРаспр.ПривязаноКоличествоДней = 0;
//						НовСтрРаспр.СуммаЗаПериод = 0;
//						
//						ПрошлоеЗначНасчитано = НасчитаноДней;
//						
//						МасДобРаспределений.Добавить(НовСтрРаспр);
//						
//					КонецЕсли; 
//					
//				КонецЦикла; 
//				
//				// На выходе: или мы распределили сумму, или Закончились дни в этом периоде
//				Если ЦенаОстаток = 0 Тогда
//				
//					Прервать;
//				
//				КонецЕсли; 
//				
//			КонецЦикла; 
//			
//			ДнейСНП_ПоСуммеДокумента = НасчитаноДней;
//			
//		КонецЕсли; 
//		
//		НовСтр = ПериодыПользования.Добавить();
//		НовСтр.КТК							= Выборка.КТК;
//		НовСтр.ПериодВзятия 				= Выборка.тек_ДатаПриемаВПользование;
//		НовСтр.СрокАренды 					= Выборка.тек_СрокВозврата;
//		НовСтр.ДатаОкончанияАренды 			= ДатаОкончанияАренды;
//		НовСтр.ВсегоДнейСНП					= Выборка.ВсегоДнейСНП;
//		НовСтр.ЗарегистрированоДнейСНП_ДокументамиРанее = ЗарегистрированоДнейСНП_ДокументамиРанее;
//		НовСтр.Остаток						= Выборка.ВсегоДнейСНП - ЗарегистрированоДнейСНП_ДокументамиРанее;
//		
//		НовСтр.ДнейСНП_ПоСуммеДокумента 	= ДнейСНП_ПоСуммеДокумента;
//		
//		БазЗн = НовСтр.ДнейСНП_ПоСуммеДокумента;
//		Если КакОкруглить = 0 Тогда
//		    // В большую сторону
//			НовСтр.ВерноеКолДнейСНП	= ?(Цел(БазЗн)=БазЗн, БазЗн, Цел(БазЗн)+1);
//			
//			// Т.к. Таблица распределения используется либо везде, либо нигде, то:
//			Если НовСтрРаспр <> Неопределено Тогда
//				
//				БазЗн = НовСтрРаспр.ПривязаноКоличествоДней;
//				НовСтрРаспр.ПривязаноКоличествоДней = ?(Цел(БазЗн)=БазЗн, БазЗн, Цел(БазЗн)+1);
//				НовСтрРаспр.По = НовСтрРаспр.С + НовСтрРаспр.ПривязаноКоличествоДней-1;
//				
//				// Округляем только количество дней. Распределенную сумму не меняем!
//				
//			КонецЕсли; 
//		
//		Иначе
//		
//			НовСтр.ВерноеКолДнейСНП	= Цел(БазЗн);
//			
//			Если НовСтрРаспр <> Неопределено Тогда
//			    НовСтрРаспр.ПривязаноКоличествоДней = Цел(НовСтрРаспр.ПривязаноКоличествоДней);
//				
//				Если НовСтрРаспр.ПривязаноКоличествоДней = 0 Тогда
//					
//					// Перед удалением перенесем оставшуюся сумму на прошлую запись
//					Если МасДобРаспределений.Количество() = 1 Тогда
//					    // Ничего не делаем, сумму некуда переносить
//						
//					
//					Иначе
//					
//						ИндПрошлСтр = МасДобРаспределений.Количество()-2;
//						ПрошлСтр = МасДобРаспределений[ИндПрошлСтр];
//						ПрошлСтр.СуммаЗаПериод = ПрошлСтр.СуммаЗаПериод + НовСтрРаспр.СуммаЗаПериод;
//					
//					КонецЕсли; 
//					
//					// Удалим последнюю запись:
//					ТаблицаРаспределенияЦены.Удалить(НовСтрРаспр);
//				
//				Иначе
//				    // Не равно 0, надо скорректировать период "ПользованиеПо"
//					НовСтрРаспр.По = НовСтрРаспр.С + НовСтрРаспр.ПривязаноКоличествоДней-1;
//					
//					// Округляем только количество дней. Распределенную сумму не меняем!
//					
//				КонецЕсли; 
//				
//			КонецЕсли;
//			
//		КонецЕсли; 
//		
//		НовСтр.УИД = ТекУИД;
//		НовСтр.ПорядокПривязки = ПорядокПривязки;
//		
//	КонецЦикла;
//	
//	Для каждого СтрКТ Из МасКТ Цикл
//	
//		МасЗнПериодов = ПериодыПользования.НайтиСтроки(Новый Структура("КТК", СтрКТ) );
//		
//		Если МасЗнПериодов.Количество() = 1 Тогда
//		
//			ТекДан = МасЗнПериодов[0];
//			
//			МасРаспр = Новый Массив;
//			
//			ТекТаблицаРаспределенияЦены = ТаблицаРаспределенияЦены.НайтиСтроки(Новый Структура("УИД", ТекДан.УИД) );
//			
//			Для каждого Стр Из ТекТаблицаРаспределенияЦены Цикл
//				
//				ТекСтрРаспр = Новый Структура("НормативныйПериодАрендыС, НормативныйПериодАрендыПо, СрокВозврата, УИД, ПользованиеС, ПользованиеПо, ПривязаноКоличествоДней, ЦенаЗаДень, СуммаЗаПериод");
//				ЗаполнитьЗначенияСвойств(ТекСтрРаспр, Стр);
//				ТекСтрРаспр.ПользованиеС = Стр.С;
//				ТекСтрРаспр.ПользованиеПо = Стр.По;
//				
//				МасРаспр.Добавить(ТекСтрРаспр);
//				
//			КонецЦикла; 
//			
//			Если ТекДан.ВерноеКолДнейСНП = 999999 Тогда
//				// Выход без обработки
//				Продолжить;
//				
//			КонецЕсли; 
//			
//			Если ТекДан.ВерноеКолДнейСНП = 0 Тогда
//				// Выход без обработки
//				Продолжить;
//				
//			КонецЕсли; 
//			
//			текМасКТ = Новый Массив;
//			текМасКТ.Добавить( СтрКТ );
//			
//			ПериодПользования = Новый Структура("ПериодВзятия, СрокАренды", ТекДан.ПериодВзятия, ТекДан.СрокАренды );
//			ТекРез = Новый Структура("МасКТ, ПериодПользования, МасРаспр, ПорядокПривязки, ВсегоПолучДней", 
//			текМасКТ, ПериодПользования, МасРаспр, ТекДан.ПорядокПривязки, ТекДан.ВерноеКолДнейСНП);
//			
//			ИтогоКолВариантов.Вставить(СтрКТ, ТекРез);
//		
//		КонецЕсли; 
//		
//	КонецЦикла; 
//	
//	Возврат ИтогоКолВариантов;
//	
//КонецФункции // ОпределитьКолПериодов(МасКТ, ПТУ, СНП)

//&НаСервере
//Функция ПолучитьДанВалюты(Валюта, Период)

//	Рез = Новый Структура("Период,Валюта,Курс,Кратность");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	КурсыВалютСрезПоследних.Период КАК Период,
//	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
//	|	КурсыВалютСрезПоследних.Курс КАК Курс,
//	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
//	|ИЗ
//	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
//	
//	Запрос.УстановитьПараметр("Период", Период);
//	Запрос.УстановитьПараметр("Валюта", Валюта);
//	//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	
//		ЗаполнитьЗначенияСвойств(Рез, Выборка);
//	
//	КонецЦикла;
//	
//	Возврат Рез;

//КонецФункции // ()

//&НаКлиенте
//Процедура ЗаполнитьПериод(Команда)
//	
//	СуммаЗаПериод = 0;
//	МасКТ = Новый Массив;
//	Для каждого Стр Из Элементы.ТаблицаСопоставления.ВыделенныеСтроки Цикл
//		
//		ТекСтрДанных = ТаблицаСопоставления.НайтиПоИдентификатору(Стр);
//		
//		МасКТ.Добавить(ТекСтрДанных.КТК_Ссылка);
//		
//		СуммаЗаПериод = ТекСтрДанных.СуммаЗаПериод;
//		
//	КонецЦикла; 
//	
//	Если МасКТ.Количество() = 0 Тогда
//	
//		Возврат;
//	
//	КонецЕсли; 
//	
//	ПараметрыФормы = Новый Структура("МасКТ, ПТУ, СНП, РаспределяемаяСумма", МасКТ, Объект.Ссылка, ЭтоПТУсСНП_КТК, СуммаЗаПериод);
//	
//	Если ЭтоПТУсСНП_КТК Тогда
//	
//		ОткрытьФорму("РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК.Форма.ФормаВыбораПериодаСНП", ПараметрыФормы, Элементы.ТаблицаСопоставления); 
//	
//	Иначе
//	
//		ОткрытьФорму("РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК.Форма.ФормаВыбораПериода", ПараметрыФормы, Элементы.ТаблицаСопоставления); 
//	
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПериодовИспользованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	ЗаполнитьПериод("");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПериодовИспользованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("МасКТ") Тогда
//		
//		ТекХар = Новый Структура("ЭтоУслугаАрендыКТК, ЭтоУслугаСНП_КТК", ЭтоПТУсАрендой_КТК, ЭтоПТУсСНП_КТК) ;
//		
//		МасПерезапись = Новый Массив;
//		СтарыйУИД = "";
//		
//		// Ранее эта штука была расчитана на массив. Сейчас работает с одиночным значением
//		Для каждого Стр Из ВыбранноеЗначение.МасКТ Цикл
//		
//			ИскМас = ТаблицаСопоставления.НайтиСтроки(Новый Структура("КТК_Ссылка", Стр) );
//			
//			Для каждого Стр_ИскМас Из ИскМас Цикл
//				
//				СрокАр = ВыбранноеЗначение.ПериодПользования.СрокАренды;
//				
//				Стр_ИскМас.ПериодС = ВыбранноеЗначение.ПериодПользования.ПериодВзятия;
//				Стр_ИскМас.ПериодПо = ВыбранноеЗначение.ПериодПользования.ПериодВзятия + 24 * 3600 * ?(СрокАр=0 ИЛИ СрокАр=1, 0, СрокАр-1 );
//				Стр_ИскМас.СрокВозврата = ВыбранноеЗначение.ПериодПользования.СрокАренды;
//				
//				Стр_ИскМас.ПорядковыйНомерПТУсСНП 	= ВыбранноеЗначение.ПорядокПривязки;
//				Стр_ИскМас.РасчетноеКолДнейСНП		= ВыбранноеЗначение.ВсегоПолучДней;
//				Стр_ИскМас.ВерноеКоличествоДнейСНП	= ?(Цел(ВыбранноеЗначение.ВсегоПолучДней)=ВыбранноеЗначение.ВсегоПолучДней, ВыбранноеЗначение.ВсегоПолучДней, Цел(ВыбранноеЗначение.ВсегоПолучДней)+1);
//				
//				СтарыйУИД = Стр_ИскМас.УИД;
//				// Очистка старого УИДа
//				Если СтарыйУИД <> "" Тогда
//				
//					ИскМас_Расч = РасчитанныйПериодПользования.НайтиСтроки(Новый Структура("УИД", СтарыйУИД) );
//					МасУд = Новый Массив;
//					Для каждого Стр_ИскМас_Расч Из ИскМас_Расч Цикл
//					
//						МасУд.Добавить(РасчитанныйПериодПользования.Индекс(Стр_ИскМас_Расч));
//					
//					КонецЦикла; 
//					
//					Для СчИнд = 0 По МасУд.Количество()-1 Цикл
//					
//						ТекИндМас = МасУд.Количество() - 1 - СчИнд;
//						
//						РасчитанныйПериодПользования.Удалить(РасчитанныйПериодПользования[МасУд[ТекИндМас]]);
//					
//					КонецЦикла;
//					
//				КонецЕсли; 
//				
//				Для каждого СтрРаспр Из ВыбранноеЗначение.МасРаспр Цикл
//				
//					Стр_ИскМас.УИД = СтрРаспр.УИД;
//					
//					НовСтрРаспр = РасчитанныйПериодПользования.Добавить();
//					ЗаполнитьЗначенияСвойств(НовСтрРаспр, СтрРаспр);
//				
//				КонецЦикла; 
//				
//				ОпЗаписи = Новый Структура("КТК, КТК_Ссылка, ПериодС, ПериодПо, СрокВозврата, СуммаЗаПериод, УИД");
//				ЗаполнитьЗначенияСвойств(ОпЗаписи, Стр_ИскМас);
//				ОпЗаписи.Вставить("КоличествоДнейСНП", Стр_ИскМас.РасчетноеКолДнейСНП);
//				ОпЗаписи.Вставить("ПорядокПривязки", Стр_ИскМас.ПорядковыйНомерПТУсСНП);
//				ОпЗаписи.Вставить("СтавкаНДС", 	Стр_ИскМас.СтавкаНДС);
//				ОпЗаписи.Вставить("Услуга", 	Стр_ИскМас.Услуга);
//				
//				МасПерезапись.Добавить(ОпЗаписи);
//			
//			КонецЦикла; 
//		
//		КонецЦикла; 
//		
//		ЗаписатьНаСервереБезКонтекста(Объект.Ссылка, МасПерезапись, ВыбранноеЗначение.МасРаспр, СтарыйУИД, ТекХар);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьХарУслуги(Ном)

//	Резы = Новый Структура("ЭтоУслугаАрендыКТК, ЭтоУслугаСНП_КТК") ;
//	ЗаполнитьЗначенияСвойств(Резы, Ном);
//	
//	Возврат Резы;

//КонецФункции // ПолучитьХарУслуги(Ном)

//&НаСервереБезКонтекста
//Процедура ЗаписатьНаСервереБезКонтекста(ПТУ, МасПерезапись, МасРаспр, СтарыйУИД=Неопределено, ТекХар)

//	Для каждого Стр Из МасПерезапись Цикл
//	
//		МЗ1 = РегистрыСведений.ПривязкаПоступленияКПериодуИспользованияКТК.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(МЗ1, Стр);
//		МЗ1.ПТУ = ПТУ;
//		МЗ1.СНП = ?(ТипЗнч(ТекХар.ЭтоУслугаСНП_КТК) = Тип("Булево") И ТекХар.ЭтоУслугаСНП_КТК=Истина, Истина, Ложь);
//		МЗ1.Записать();
//		
//		МЗ2 = РегистрыСведений.ПровестиПересчетПериода.СоздатьМенеджерЗаписи();
//		МЗ2.ПТУ = ПТУ;
//		МЗ2.КТК = Стр.КТК_Ссылка;
//		МЗ2.СНП = ?(ТипЗнч(ТекХар.ЭтоУслугаСНП_КТК) = Тип("Булево") И ТекХар.ЭтоУслугаСНП_КТК=Истина, Истина, Ложь);
//		МЗ2.ПересчитатьПериоды = Истина;
//		МЗ2.Записать();
//		
//	КонецЦикла; 

//	Если СтарыйУИД <> Неопределено И СтарыйУИД <> "" Тогда
//	
//		НЗ = РегистрыСведений.РасчитанныйПериодПользованияСНП.СоздатьНаборЗаписей();
//		НЗ.Отбор.УИД.Установить(СтарыйУИД);
//		НЗ.Записать();
//	
//	КонецЕсли; 
//	
//	Если МасРаспр.Количество() > 0 Тогда
//		
//		Для каждого Стр_МасРаспр Из МасРаспр Цикл
//		
//			НЗ = РегистрыСведений.РасчитанныйПериодПользованияСНП.СоздатьНаборЗаписей();
//			НЗ.Отбор.УИД.Установить(Стр_МасРаспр.УИД);
//			
//			//Для каждого Стр Из МасРаспр Цикл
//			
//			НовСтрНЗ = НЗ.Добавить();
//			ЗаполнитьЗначенияСвойств(НовСтрНЗ, Стр_МасРаспр);
//			
//			//КонецЦикла; 
//			
//			НЗ.Записать();
//		
//		КонецЦикла; 
//		
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьВыделенныеСтроки(Команда)
//	
//	МасПТУ_КТК = Новый Массив;
//	
//	МасВыд = Элементы.ТаблицаСопоставления.ВыделенныеСтроки;
//	
//	Для каждого СтрИД Из МасВыд Цикл
//		
//		ТекСтр = ТаблицаСопоставления.НайтиПоИдентификатору(СтрИД);
//		
//		МасПТУ_КТК.Добавить(Новый Структура("ПТУ, КТК, КТК_Ссылка", Объект.Ссылка, ТекСтр.КТК, ТекСтр.КТК_Ссылка) );
//	
//	КонецЦикла; 
//	
//	ОчиститьВыделенныеСтрокиНаСервере(МасПТУ_КТК);
//	
//	Для каждого СтрИД Из МасВыд Цикл
//	
//		ТекСтр = ТаблицаСопоставления.НайтиПоИдентификатору(СтрИД);
//		ТекСтр.ПериодС = "";
//		ТекСтр.ПериодПо = "";
//		ТекСтр.СрокВозврата = "";
//	
//	КонецЦикла; 
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОчиститьВыделенныеСтрокиНаСервере(МасПТУ_КТК)
//	
//	ТЗ_Вход = Новый ТаблицаЗначений;
//	ТЗ_Вход.Колонки.Добавить("ПТУ", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
//	ТЗ_Вход.Колонки.Добавить("КТК", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
//	ТЗ_Вход.Колонки.Добавить("СНП", Новый ОписаниеТипов("Булево") );
//	ТЗ_Вход.Колонки.Добавить("КТК_Ссылка", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
//	
//	Для каждого Стр Из МасПТУ_КТК Цикл
//	
//		НовСтрТЗ = ТЗ_Вход.Добавить();
//		ЗаполнитьЗначенияСвойств(НовСтрТЗ, Стр);
//		НовСтрТЗ.СНП = ЭтоПТУсСНП_КТК;
//	
//	КонецЦикла; 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ТЗ_Вход.ПТУ КАК ПТУ,
//	               |	ТЗ_Вход.КТК КАК КТК,
//	               |	ТЗ_Вход.СНП КАК СНП,
//	               |	ТЗ_Вход.КТК_Ссылка КАК КТК_Ссылка
//	               |ПОМЕСТИТЬ ТабВх
//	               |ИЗ
//	               |	&ТЗ_Вход КАК ТЗ_Вход
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	ПТУ,
//	               |	КТК,
//	               |	КТК_Ссылка
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	УчетПредоставлениеКТК.ПТУ КАК ПТУ,
//	               |	УчетПредоставлениеКТК.КТК КАК КТК,
//	               |	УчетПредоставлениеКТК.НачалоАренды КАК НачалоАренды,
//	               |	УчетПредоставлениеКТК.ОкончаниеАренды КАК ОкончаниеАренды,
//	               |	УчетПредоставлениеКТК.НачалоПериодаИсп КАК НачалоПериодаИсп,
//	               |	УчетПредоставлениеКТК.ОкончаниеПериодаИсп КАК ОкончаниеПериодаИсп,
//	               |	УчетПредоставлениеКТК.СНП КАК СНП,
//	               |	УчетПредоставлениеКТК.СуммаЗаПериод КАК СуммаЗаПериод,
//	               |	УчетПредоставлениеКТК.СтавкаЗаДень КАК СтавкаЗаДень,
//	               |	УчетПредоставлениеКТК.СуммаЗаПериодИсп КАК СуммаЗаПериодИсп,
//	               |	УчетПредоставлениеКТК.КонтрагентСобственникКТК КАК КонтрагентСобственникКТК,
//	               |	УчетПредоставлениеКТК.ДоговорССобственникомКТК КАК ДоговорССобственникомКТК,
//	               |	УчетПредоставлениеКТК.Клиент КАК Клиент,
//	               |	УчетПредоставлениеКТК.ВидЗатрат КАК ВидЗатрат,
//	               |	УчетПредоставлениеКТК.СпособИспользования КАК СпособИспользования
//	               |ИЗ
//	               |	ТабВх КАК ТабВх
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетПредоставлениеКТК КАК УчетПредоставлениеКТК
//	               |		ПО ТабВх.ПТУ = УчетПредоставлениеКТК.ПТУ
//	               |			И ТабВх.КТК_Ссылка = УчетПредоставлениеКТК.КТК
//	               |			И ТабВх.СНП = УчетПредоставлениеКТК.СНП
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПровестиПересчетПериода.ПТУ КАК ПТУ,
//	               |	ПровестиПересчетПериода.КТК КАК КТК,
//	               |	ПровестиПересчетПериода.СНП КАК СНП,
//	               |	ПровестиПересчетПериода.ПересчитатьПериоды КАК ПересчитатьПериоды
//	               |ИЗ
//	               |	ТабВх КАК ТабВх
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПровестиПересчетПериода КАК ПровестиПересчетПериода
//	               |		ПО ТабВх.ПТУ = ПровестиПересчетПериода.ПТУ
//	               |			И ТабВх.КТК_Ссылка = ПровестиПересчетПериода.КТК
//	               |			И ТабВх.СНП = ПровестиПересчетПериода.СНП
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ КАК ПТУ,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК КАК КТК,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СНП КАК СНП,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка КАК КТК_Ссылка,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС КАК ПериодС,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо КАК ПериодПо,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СрокВозврата КАК СрокВозврата,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.СуммаЗаПериод КАК СуммаЗаПериод,
//	               |	ПривязкаПоступленияКПериодуИспользованияКТК.УИД КАК УИД
//	               |ПОМЕСТИТЬ Привязки
//	               |ИЗ
//	               |	ТабВх КАК ТабВх
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
//	               |		ПО ТабВх.ПТУ = ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ
//	               |			И ТабВх.КТК = ПривязкаПоступленияКПериодуИспользованияКТК.КТК
//	               |			И ТабВх.СНП = ПривязкаПоступленияКПериодуИспользованияКТК.СНП
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	Привязки.ПТУ КАК ПТУ,
//	               |	Привязки.КТК КАК КТК,
//	               |	Привязки.СНП КАК СНП,
//	               |	Привязки.КТК_Ссылка КАК КТК_Ссылка,
//	               |	Привязки.ПериодС КАК ПериодС,
//	               |	Привязки.ПериодПо КАК ПериодПо,
//	               |	Привязки.СрокВозврата КАК СрокВозврата,
//	               |	Привязки.СуммаЗаПериод КАК СуммаЗаПериод,
//	               |	Привязки.УИД КАК УИД
//	               |ИЗ
//	               |	Привязки КАК Привязки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РасчитанныйПериодСНП.НормативныйПериодАрендыС КАК НормативныйПериодАрендыС,
//	               |	РасчитанныйПериодСНП.НормативныйПериодАрендыПо КАК НормативныйПериодАрендыПо,
//	               |	РасчитанныйПериодСНП.СрокВозврата КАК СрокВозврата,
//	               |	РасчитанныйПериодСНП.УИД КАК УИД,
//	               |	РасчитанныйПериодСНП.ПользованиеС КАК ПользованиеС,
//	               |	РасчитанныйПериодСНП.ПользованиеПо КАК ПользованиеПо,
//	               |	РасчитанныйПериодСНП.ЦенаЗаДень КАК ЦенаЗаДень
//	               |ИЗ
//	               |	(ВЫБРАТЬ
//	               |		Привязки.УИД КАК УИД
//	               |	ИЗ
//	               |		Привязки КАК Привязки
//	               |	
//	               |	СГРУППИРОВАТЬ ПО
//	               |		Привязки.УИД) КАК УдалитьУИДы
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчитанныйПериодПользованияСНП КАК РасчитанныйПериодСНП
//	               |		ПО УдалитьУИДы.УИД = РасчитанныйПериодСНП.УИД";
//	
//	Запрос.УстановитьПараметр("ТЗ_Вход", ТЗ_Вход);
//	//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
//	Резы = Запрос.ВыполнитьПакет();
//	
//	// УчетПредоставлениеКТК
//	Выборка = Резы[1].Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	
//		МЗ = РегистрыСведений.УчетПредоставлениеКТК.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
//		МЗ.Удалить();
//	
//	КонецЦикла;
//	
//	// ПровестиПересчетПериода
//	Выборка = Резы[2].Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	
//		МЗ = РегистрыСведений.ПровестиПересчетПериода.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
//		МЗ.Удалить();
//	
//	КонецЦикла;
//	
//	// ПривязкаПоступленияКПериодуИспользованияКТК
//	Выборка = Резы[4].Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	
//		МЗ = РегистрыСведений.ПривязкаПоступленияКПериодуИспользованияКТК.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
//		МЗ.Удалить();
//	
//	КонецЦикла; 
//	
//	// ПривязкаПоступленияКПериодуИспользованияКТК
//	Выборка = Резы[5].Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	    // Реквизит ПоЪ ключем не является, а потому не паримся на не совпадение
//		МЗ = РегистрыСведений.РасчитанныйПериодПользованияСНП.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
//		МЗ.Удалить();
//	
//	КонецЦикла; 
//	
//КонецПроцедуры
//
// -------------------------------------------------------------------------------------------------------------------
// ДИТ Поморцева Т.П. Задача 29231 (38715) 21.09.21. конец

&НаКлиенте
Процедура excel_ВставитьИзEXCEL(Команда)
	
	// SIV 21-05-21 Логику данного блока скопировал у Михаила, зачем отменять проведение перед вставкой - не знаю.
	
	//Евросиб Шевченко А.В. US 108445 TA 110185 21.05.2025
	ЕстьАктуальныйАкцепт = НЕ СтатусРазнесения = ПредопределенноеЗначение("Перечисление.СостоянияАвторазнесения.НетАктуальногоАкцепта") И НЕ СтатусРазнесения = ПредопределенноеЗначение("Перечисление.СостоянияАвторазнесения.АкцептНеСоздан");
	//Евросиб Шевченко А.В. US 108445 TA 110185 21.05.2025
	Если Объект.Проведен И ЕстьАктуальныйАкцепт Тогда //Евросиб Шевченко А.В. US 108445 TA 110185 21.05.2025
		ПодтверждениеОтменыПроведенияПередВставкойEXCEL = Новый ОписаниеОповещения("ПодтверждениеОтменыПроведенияПередВставкойEXCEL", ЭтаФорма);
		ПоказатьВопрос(ПодтверждениеОтменыПроведенияПередВставкойEXCEL, "Необходимо отменить проведение акцепта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПодтверждениеОтменыПроведенияПередВставкойEXCEL(КодВозвратаДиалога.Да, Истина);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПодтверждениеОтменыПроведенияПередВставкойEXCEL(П1 = неопределено, НеНадоРаспроводить = Ложь) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если НеНадоРаспроводить <> Истина Тогда
		ПроведениеОтменено = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Если ПроведениеОтменено = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить отмену проведения акцепта. Вставка вагонов и КТК не выполнена.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаВставкиДанныхExcelВПТУ = Новый ОписаниеОповещения("ОбработкаВставкиДанныхExcelВПТУ", ЭтаФорма);
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаВставкиИзEXCEL", Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС),,ЭтаФорма.УникальныйИдентификатор,,,ОбработкаВставкиДанныхExcelВПТУ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиДанныхExcelВПТУ(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если ТипЗнч(П1) <> Тип("Массив") Тогда Возврат; КонецЕсли;
	
	// Евросиб Фролов (02.11.2021 Ticket№ 0247409
	МассивЖДН = Новый Массив;
	Для Каждого СтрокаМассива Из П1 Цикл
		Если ЗначениеЗаполнено(СтрокаМассива.ЖДН) И МассивЖДН.Найти(СтрокаМассива.ЖДН) = Неопределено Тогда
			МассивЖДН.Добавить(СтрокаМассива.ЖДН);	
		КонецЕсли;	
	КонецЦикла;
	НомераТранспортныхДокументов = ПолучитьНомераТранспортныхДокументов(МассивЖДН);
	// Евросиб Фролов)
	
	Для каждого Стр из П1 Цикл
		
		НСтр = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		
		НСтр.ГУИДПТУ = Новый УникальныйИдентификатор();
		
		НСтр.СписокТЕ = Стр.Контейнер;
		НСтр.СписокТС = Стр.Вагон;
		
		// Евросиб Фролов (02.11.2021 Ticket№ 0247409
		//НСтр.СписокТД = ПолучитьКодЖДН(Стр.ЖДН); закомментировал
		НСтр.СписокТД = НомераТранспортныхДокументов.Получить(Стр.ЖДН);
		// Евросиб Фролов)
		
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(НСтр);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(НСтр, Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(НСтр, Объект.СуммаВключаетНДС);
		//Евросиб Каблов 11.10.2023 ( Ticket#0317657
		НСтр.ПолнаяСумма = НСтр.Всего;
		НСтр.ПолнаяСуммаНДС = НСтр.СуммаНДС;
		//Евросиб Каблов 11.10.2023 )
		
	КонецЦикла;
	
	РассчитатьСуммыВсегоПоДокументу();
	Услуги1ПриИзменении(неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодЖДН(ЖДН)	
	Возврат ЖДН.Номер;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомераТранспортныхДокументов(МассивЖДН)
	// Евросиб Фролов (02.11.2021 Ticket№ 0247409
	// Новиков: при вставке ЖДН в форме вставки из Excel в ПТУ система преобразует номер ЖДН в номер ТД.
	// Соответственно при создании Акцепта система не заполняет поле "Накладная", вследствие чего не срабатывает автоакцепт. 
	// Необходимо чтобы из формы вставки переносился номер ЖДн а не номер ТД.
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЖДН, "НомерТранспортногоДокумента", Истина);	
	// Евросиб Фролов)	
КонецФункции

&НаКлиенте
Процедура СсылкаОсновногоДокументаДОНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.СсылкаОсновногоДокументаДО) Тогда 
		ЗапуститьПриложение(Объект.СсылкаОсновногоДокументаДО);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлыДО(Команда)
	
	// ++ ДИТ, Сгонник, US 35086; TA 44816 2022-01-10 реализация открытия сканов из базы 1С:ДО 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлыДО",
					//ПараметрыФормы,
					//ПараметрыВыполненияКоманды.Источник,
					//ПараметрыВыполненияКоманды.Уникальность,
					//ПараметрыВыполненияКоманды.Окно);
					ПараметрыФормы, 
					ЭтаФорма, 
					УникальныйИдентификатор);
				 
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТСПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТС = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТС);
КонецПроцедуры  
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТЕПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТЕ = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТЕ);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТДПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТД = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТД);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//++ Глеков Д.В. Ticket#0247297 27.01.2022 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КорректировкаПоступления.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	//|ГДЕ
	//|	КорректировкаПоступления.Проведен = ИСТИНА
	//|	И КорректировкаПоступления.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	//|	И КорректировкаПоступления.ДокументПоступления = &ДокументПоступления";
	//Запрос.УстановитьПараметр("ДокументПоступления", ТекущийОбъект.Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//
	//	КорректировкаПоступления = Неопределено;
	//	Элементы.ВОчередиАвторазнесения.Доступность = ИСТИНА;
	//
	//Иначе
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	Выборка.Следующий();
	//	КорректировкаПоступления = Выборка.Ссылка;
	//	Элементы.ВОчередиАвторазнесения.Доступность = ЛОЖЬ;
	//
	//КонецЕсли;
	//-- Глеков Д.В. Ticket#0247297 27.01.2022
	//Евросиб - АСуслов 21.11.2022 11:45:51 #58550
	//(
	ВОчередиРазнесения = ПретензииИНеакцептыСервер.ДокументНаходитсяВОчередиАвторазнесения(ТекущийОбъект.Ссылка);
	//)
	//Евросиб - АСуслов 21.11.2022 11:45:53 #58550 
	//Евросиб - АСуслов 03.03.2023 14:11:03 #65484
	//(
	ЗаполнитьЗаказыЗаявкиУППНаСервере();
	//)
	//Евросиб - АСуслов 03.03.2023 14:11:06 #65484
	
	//Евросиб Каблов 13.11.2024 ( Ticket#0375504
	ЗаполнитьСтатусыПротоколовПоставщика();
	//Евросиб Каблов 13.11.2024 )
	
	//Евросиб СубботинВ #118799 09.10.2025 Начало 
	ЗаявкиНаОплатуСервер.ПроверитьКомандыВыгрузкиВУПП(Этаформа, Тип("ДокументСсылка.ПоступлениеТоваровУслуг"), Объект.Ссылка);
	//Евросиб СубботинВ #118799 09.10.2025 Конец 
	
КонецПроцедуры

//Евросиб - АСуслов 03.03.2023 14:13:37 #65484
//(
&НаСервере
Процедура ЗаполнитьЗаказыЗаявкиУППНаСервере()                                                      
	МассивДокументовОснований = Объект.СвязанныеСчетаПоставщиков.Выгрузить().ВыгрузитьКолонку("СчетПоставщика");
	//Евросиб - АСуслов 06.02.2024 12:51:40 #78327
	//(
	//СоответствияОснованиямПлатежа = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектовУПП(МассивДокументовОснований, "УППЗаказ");
	СоответствияОснованиямПлатежаЗаказ = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектовУПП(МассивДокументовОснований, "УППЗаказ");
	СоответствияОснованиямПлатежаЗаявка = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектовУПП(МассивДокументовОснований, "УППЗаявка");
	//)
	//Евросиб - АСуслов 06.02.2024 12:51:43 #78327
	Для каждого ОснованиеПлатежа Из Объект.СвязанныеСчетаПоставщиков Цикл 
		Если НЕ ЗначениеЗаполнено(ОснованиеПлатежа.СчетПоставщика) Тогда
			Продолжить;
		КонецЕсли;
		КлючОснованияПлатежа = СоответствияОснованиямПлатежаЗаказ.Получить(ОснованиеПлатежа.СчетПоставщика);
		Если КлючОснованияПлатежа <> Неопределено Тогда
			ОснованиеПлатежа.НомерДатаЗаказаУПП = КлючОснованияПлатежа.НомерДатаВБУ;
		КонецЕсли;
		КлючОснованияПлатежа = СоответствияОснованиямПлатежаЗаявка.Получить(ОснованиеПлатежа.СчетПоставщика);
		Если КлючОснованияПлатежа <> Неопределено Тогда
			ОснованиеПлатежа.НомерДатаЗаявкиВУПП = КлючОснованияПлатежа.НомерДатаВБУ;
		КонецЕсли;
		//Евросиб - АСуслов 10.01.2024 14:49:59 #78327
		//(
		Если ТипЗнч(ОснованиеПлатежа.СчетПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			ОснованиеПлатежа.ОснованиеЭтоСчет = Истина;
		КонецЕсли;                                    
		ЗаполнитьЗначенияСвойств(ОснованиеПлатежа, ОснованиеПлатежа.СчетПоставщика, "ВалютаОплаты, ДоговорОплаты");
		ОснованиеПлатежа.МультивалютныйДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеПлатежа.СчетПоставщика, "ДоговорКонтрагента");
	КонецЦикла;
	СтруктураРезультата = МультивалютныеДоговорыСервер.ПолучитьТаблицуМультивалютныхДоговоров(Объект.СвязанныеСчетаПоставщиков.Выгрузить().ВыгрузитьКолонку("МультивалютныйДоговор"));
	Если СтруктураРезультата.ТаблицаМультивалютныхДоговоров <> Неопределено Тогда
		ТаблицаМультивалютныхДоговоров.Загрузить(СтруктураРезультата.ТаблицаМультивалютныхДоговоров);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 10.01.2024 14:50:04 #78327
	
	
КонецПроцедуры

//)
//Евросиб - АСуслов 03.03.2023 14:13:38 #65484

//Евросиб Коханенко Н.А. 09.12.2022 (( #61705
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. 09.12.2022 )) #61705
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//Евросиб - АСуслов 03.03.2023 12:48:10 #65484
//(
&НаСервере
Процедура ДоступностьФункционалаПривязкиПТУПоСчетам();
	Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Доступность = НЕ Объект.РазрешенаВыгрузкаВУПП;
	Элементы.СвязанныеСчетаПоставщиков.ИзменятьСоставСтрок = НЕ Объект.РазрешенаВыгрузкаВУПП;
КонецПроцедуры
//)
//Евросиб - АСуслов 03.03.2023 12:48:15 #65484 

//Евросиб - АСуслов 17.03.2023 13:30:58 #65868
//(
&НаКлиенте
Процедура ДатаПоступленияДокументаПриИзменении(Элемент)
	//Евросиб - АСуслов 17.03.2023 13:42:18 #65868
	//(
	ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(Объект.ДатаПоступленияДокумента, Объект.ДоговорКонтрагента, Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	//)
	//Евросиб - АСуслов 17.03.2023 13:42:22 #65868
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
КонецПроцедуры  
//)
//Евросиб - АСуслов 17.03.2023 13:31:00 #65868

//Субботин TASK 70840 20.06.2023 Начало
&НаКлиенте
Процедура Услуги1НоменлатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
	//Субботин 77317 20.11.2023 начало
	НоменклатураСервер.ПроверитьОтнесениеУслугиНаЗатраты(ВыбранноеЗначение,СтандартнаяОбработка);
	//Субботин 77317 20.11.2023 Конец
КонецПроцедуры

&НаКлиенте
Процедура СвязьУслугИСчетовНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
	//Субботин 77317 20.11.2023 начало
	НоменклатураСервер.ПроверитьОтнесениеУслугиНаЗатраты(ВыбранноеЗначение,СтандартнаяОбработка);
	//Субботин 77317 20.11.2023 конец
КонецПроцедуры
//Субботин TASK 70840 20.06.2023 конец

// ДИТ US 64822 Сержантова А.С. Начало: 30.06.2023
&НаКлиенте
Процедура ПротоколПоставщикаПСЦНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	//ОповещениеПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораПротокола", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПСЦПоставщика", Истина);
	ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);  
	ПараметрыФормы.Вставить("Договор", Объект.ДоговорКонтрагента);  
	ПараметрыФормы.Вставить("СписокУслуг", ПолучитьСписокУслугПТУ());
	ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
	//Евросиб Каблов 07.11.2024 ( #67092
	//ОткрытьФорму("Документ.ПСЦ.ФормаВыбора",ПараметрыФормы,ЭтотОбъект,,,,ОповещениеПослеВыбора);
	ОткрытьФорму("Документ.ПСЦПоставщика.Форма.ФормаВыбораПротоколов", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб Каблов 07.11.2024 )
	
КонецПроцедуры   

// ДИТ US 64822 Сержантова А.С. Начало: 30.06.2023
&НаСервере
Функция ПолучитьСписокУслугПТУ()

	Возврат Объект.Услуги.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");	

КонецФункции   

// ДИТ US 64822 Сержантова А.С. Начало: 30.06.2023
&НаКлиенте
Процедура ПротоколПоставщикаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.ПротоколПоставщика.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и не ЗначениеЗаполнено(ТекСтрока.ПСЦ) Тогда
		УдалитьСтрокуТЧ_ПСЦ(ТекСтрока.ПолучитьИдентификатор());	
	КонецЕсли;	
КонецПроцедуры

// ДИТ US 64822 Сержантова А.С. Начало: 30.06.2023
&НаСервере
Процедура УдалитьСтрокуТЧ_ПСЦ(Идентификатор)

	Объект.ПротоколПоставщика.Удалить(Объект.ПротоколПоставщика.НайтиПоИдентификатору(Идентификатор));

КонецПроцедуры

//Евросиб - АСуслов 30.06.2023 14:47:40 #локации
//(
&НаКлиенте
Процедура Услуги1СтанцияОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Услуги1.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияОтправления) Тогда
		ТекДанные.СтанцияОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СтанцияНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Услуги1.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияНазначения) Тогда
		ТекДанные.СтанцияНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//)
//Евросиб - АСуслов 30.06.2023 14:47:43 #локации

//Субботин 75691 18.10.2023 начало
&НаКлиенте
Процедура ШтрафПриИзменении(Элемент)
	Объект.Претензия = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПретензияПриИзменении(Элемент)
	Объект.Штраф = Ложь;
КонецПроцедуры 

&НаКлиенте
Процедура СвязанныеСчетаПоставщиковВалютаОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокЗначенийВалют = Новый СписокЗначений;
	ТекДанные = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные;
	Для каждого СтрокаМультивалютныхДоговоров Из ТаблицаМультивалютныхДоговоров Цикл
		Если ТекДанные.МультивалютныйДоговор = СтрокаМультивалютныхДоговоров.МультивалютныйДоговор Тогда
			СписокЗначенийВалют.Добавить(СтрокаМультивалютныхДоговоров.Валюта);	
		КонецЕсли;
	КонецЦикла;                                                            
	ДанныеВыбора = СписокЗначенийВалют;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеСчетаПоставщиковВалютаОплатыПриИзменении(Элемент)
	ТекДанные = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные;
	Для каждого СтрокаМультивалютныхДоговоров Из ТаблицаМультивалютныхДоговоров Цикл
		Если СтрокаМультивалютныхДоговоров.Валюта = ТекДанные.ВалютаОплаты 
			И ТекДанные.МультивалютныйДоговор = СтрокаМультивалютныхДоговоров.МультивалютныйДоговор Тогда
			ТекДанные.ДоговорОплаты = СтрокаМультивалютныхДоговоров.Договор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//Евросиб - АСуслов 11.04.2024 12:05:44 #78327
//(
&НаКлиенте
Процедура ВалютаОплатыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокЗначенийВалют = Новый СписокЗначений;
	Для каждого СтрокаМультивалютныхДоговоров Из ТаблицаМультивалютныхДоговоров Цикл
		СписокЗначенийВалют.Добавить(СтрокаМультивалютныхДоговоров.Валюта);	
	КонецЦикла;                                                            
	ДанныеВыбора = СписокЗначенийВалют;
КонецПроцедуры                

&НаКлиенте
Процедура ВалютаОплатыПриИзменении(Элемент)
	Для каждого СтрокаМультивалютныхДоговоров Из ТаблицаМультивалютныхДоговоров Цикл
		Если СтрокаМультивалютныхДоговоров.Валюта = Объект.ВалютаОплаты Тогда
			Объект.ДоговорОплаты = СтрокаМультивалютныхДоговоров.Договор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//)
//Евросиб - АСуслов 11.04.2024 12:05:46 #78327
//Субботин 75691 18.10.2023 Конец
//Евросиб - АСуслов 04.01.2024 13:38:39 #78327
//(
&НаСервере
Процедура ЗаполнитьТаблицуМультивалютныхДоговоров(УстановитьДанныеПоУмолчанию = Истина)

	СтруктураРезультата = МультивалютныеДоговорыСервер.ПолучитьТаблицуМультивалютныхДоговоров(Объект.ДоговорКонтрагента);
	Если СтруктураРезультата.ТаблицаМультивалютныхДоговоров <> Неопределено Тогда
		ТаблицаМультивалютныхДоговоров.Загрузить(СтруктураРезультата.ТаблицаМультивалютныхДоговоров);
	Иначе
		Возврат;
	КонецЕсли;
	Если УстановитьДанныеПоУмолчанию
		И СтруктураРезультата.ТаблицаДоговоровПоУмолчанию.Количество() > 0 Тогда
		Объект.ДоговорОплаты = СтруктураРезультата.ТаблицаДоговоровПоУмолчанию[0].Договор;
		Объект.ВалютаОплаты = СтруктураРезультата.ТаблицаДоговоровПоУмолчанию[0].Валюта;
	КонецЕсли;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 04.01.2024 13:38:41 #78327

//Евросиб Каблов 13.11.2024 Ticket#0375504
&НаСервере
Процедура ЗаполнитьСтатусыПротоколовПоставщика()
	
	Если Объект.ПротоколПоставщика.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка,
		|	ПСЦ.СтатусДокумента КАК СтатусДокумента
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|ГДЕ
		|	ПСЦ.Ссылка В(&Протоколы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПСЦПоставщика.Ссылка,
		|	ПСЦПоставщика.СтатусДокумента
		|ИЗ
		|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|ГДЕ
		|	ПСЦПоставщика.Ссылка В(&Протоколы)";
		
		Протоколы = Объект.ПротоколПоставщика.Выгрузить(, "ПСЦ").ВыгрузитьКолонку("ПСЦ");
		Запрос.УстановитьПараметр("Протоколы", Протоколы);
		
		ТаблицаСтатусов = Запрос.Выполнить().Выгрузить();
		Для Каждого Стр Из Объект.ПротоколПоставщика Цикл
			СтрокаСтатуса = ТаблицаСтатусов.Найти(Стр.ПСЦ, "Ссылка");
			Если СтрокаСтатуса <> Неопределено Тогда
				Стр.СтатусДокумента = СтрокаСтатуса.СтатусДокумента;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколПоставщикаПриИзменении(Элемент)
	
	//Евросиб Каблов 13.11.2024 ( Ticket#0375504
	ЗаполнитьСтатусыПротоколовПоставщика();
	//Евросиб Каблов 13.11.2024 )
	
КонецПроцедуры

// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. 10.01.2025
&НаКлиенте
Процедура УчитыватьНДС1ПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитовУчетаНДС();	
КонецПроцедуры 

// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. 10.01.2025   
&НаКлиенте
Процедура ОбработкаИзмененияРеквизитовУчетаНДС()

	Для каждого СтрТЧ Из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;   
	
	Для Каждого СтрТЧ Из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
		СтрТЧ.ПолнаяСумма = СтрТЧ.Всего;
		СтрТЧ.ПолнаяСуммаНДС = СтрТЧ.СуммаНДС;
	КонецЦикла;
		
	РассчитатьСуммыВсегоПоДокументу();
	Если Объект.СуммаВключаетНДС Тогда
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Товары.Итог("Сумма");
	Иначе
		Объект.ПолнаяСуммаВСФ = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаНДС") + Объект.Товары.Итог("Сумма") + Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;
	
КонецПроцедуры 

//Евросиб СубботинВ #99021 20.02.2025 Начало

&НаКлиенте
Процедура СвязанныеСчетаПоставщиковПередУдалением(Элемент, Отказ)
	
	Если Объект.Проведен и Объект.Претензия Тогда
		Для Каждого СтрокаСостояния из Объект.Состояния Цикл
			Если СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Удаление строк заказов в ПТУ, где выполнены этапы маршрута, запрещено",,,,Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
//Евросиб СубботинВ #99021 20.02.2025 Конец

//Евросиб СубботинВ #102528 09.04.2025 Начало
&НаСервере
Процедура ПроверитьИСоздатьКомандыСозданияЗаявокНаоплату()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаявкиНаОплатуСервер.ПроверитьИСоздатьКомандыСозданияЗаявокНаоплату(ЭтаФорма,объект.Ссылка);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеСтавокНДС(Документ)
	
	Возврат	ЗаявкиНаОплатуСервер.ПолучитьСоответствиеСтавокНДС(Документ);
	
КонецФункции

&НаСервере	
Функция СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению)
	
 	Возврат Документы.ЗаявкаНаОплату.СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению);
   
КонецФункции  

&НаКлиенте
Процедура СоздатьЗаявкиНаОплату(Команда, ВопросЗадан = Ложь)
	
	ДокументВыгруженВУПП = ПроверитьДокументВыгруженВУППНаСервере(Объект.Ссылка);
	Если Не ДокументВыгруженВУПП Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("По данному документу не создан Заказ в УПП. Создание заявки на оплату отменено.");
		Возврат;
	КонецЕсли;
	
	
	Ставка = СтрЗаменить(Команда.Имя,"СоздатьНаОснованииЗаявкуНаОплатуПоСтавке","");
	Если Ставка = "БезНДС" Тогда
		Ставка = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		Ставка = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС"+Ставка);
	КонецЕсли;
	
	СтрокиКРазнесению = ПолучитьСоответствиеСтавокНДС(Объект.Ссылка);
	СтрокиПоТекущейСтавке = СтрокиКРазнесению.Получить(Ставка);
	Если СтрокиПоТекущейСтавке <> Неопределено Тогда
		
		//Поиск существующих заявок по ставке 
		Если Не ВопросЗадан Тогда
			ДокументыПоСтавкеДокументов = ДокументыПоСтавкеДокументов(Ставка);
			//СтруктураПоиска = Новый Структура("СтавкаНДС",Ставка);
			////берем все документы из поступления с нашей стаавкой
			//ВсеДокументыПоСтавке = ТаблицаДокументовПоСтавкеДокументов.НайтиСтроки(СтруктураПоиска);
			Если ДокументыПоСтавкеДокументов.Количество()>0 Тогда
				Результат = ПолучитьСуществующуюЗаявкуПоДокументуНаСервере(ДокументыПоСтавкеДокументов, Ставка); 
				СтрокиКРазнесению = Новый Соответствие;
				СтрокиКРазнесению.Вставить(Ставка,СтрокиПоТекущейСтавке);
			Иначе 
				Результат = Неопределено;
			КонецЕсли;
		Иначе Результат = Неопределено;
		КонецЕсли;
		
		Если Результат = Неопределено Тогда			
			НоваяЗаявка = СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению);
			Если НЕ НоваяЗаявка = Неопределено Тогда
				ПоказатьЗначение(,НоваяЗаявка);
			КонецЕсли;
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПослеНайденнойЗаявки", ЭтотОбъект, Новый Структура("СуществующаяЗаявка, Команда", Результат, Команда));
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить("ОткрытьДляРедактирования", "Открыть найденную заявку");
			СписокКнопок.Добавить("СоздатьНовую", "Создать новую заявку");
			СписокКнопок.Добавить("Отмена", "Отмена");
			
			ПоказатьВопрос(ОписаниеОповещения, "Найдена существующая заявка по выбранной ставке НДС.
												|Открыть для редактирования или создать новую?", СписокКнопок, 60);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьПослеНайденнойЗаявки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат
	ИначеЕсли РезультатВопроса = "ОткрытьДляРедактирования" Тогда
		ПоказатьЗначение(,ДополнительныеПараметры.СуществующаяЗаявка);
	ИначеЕсли  РезультатВопроса = "СоздатьНовую" Тогда
		СоздатьЗаявкиНаОплату(ДополнительныеПараметры.Команда, Истина);
	ИначеЕсли РезультатВопроса = "Отмена" Тогда
		Возврат
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДокументыПоСтавкеДокументов(Ставка)
	ТаблицаДокументовПоСтавкеДокументов = Объект.СвязьУслугИСчетов.Выгрузить(,"СчетПоставщика, СтавкаНДС");
	СтруктураПоиска = Новый Структура("СтавкаНДС",Ставка);
	//берем все документы из поступления с нашей ставкой
	ОтобранныеДокументы = ТаблицаДокументовПоСтавкеДокументов.НайтиСтроки(СтруктураПоиска); 
	МассивДокументов = Новый Массив;
	Для каждого СтрокаСДокументом из ОтобранныеДокументы Цикл 
		МассивДокументов.Добавить(Новый Структура("ОснованиеДляПлатежа", СтрокаСДокументом.СчетПоставщика));
		КонецЦикла;
	Возврат МассивДокументов;
	

КонецФункции

&НаСервере
Функция ПроверитьДокументВыгруженВУППНаСервере(Документ)
	//Евросиб СубботинВ #118799 09.10.2025 Начало
	//РезультатПроверки = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Документ, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	//Возврат ЗначениеЗаполнено(РезультатПроверки.ДатаОбмена); 
	РезультатПроверки = ЗаявкиНаОплатуСервер.ПроверитьДокументВыгруженВУППНаСервере(Документ); 
	Возврат ЗначениеЗаполнено(РезультатПроверки);
	//Евросиб СубботинВ #118799 09.10.2025 Конец 
	
КонецФункции

//Евросиб СубботинВ #102528 09.04.2025 Конец 

//Евросиб Пирожкова( 30.07.2025 Ticket№0406736 
&НаКлиенте
Процедура ПроверитьВыгрузкуВУПП(Команда)
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ПараметрыОбработки = Новый Структура("НеЗаписан", НеЗаписан);
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаВыгрузка", ЭтаФорма, ПараметрыОбработки);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Для выполнения проверки документ должен быть проведен. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе		
		ОбработкаВопросаВыгрузка(КодВозвратаДиалога.Да, ПараметрыОбработки); 
		ПроверитьВыгрузкуВУППСервер();
	КонецЕсли;
			
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВопросаВыгрузка(Ответ = неопределено, Параметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.НеЗаписан Тогда
		ЗаписатьДокументПоступления();	
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьВыгрузкуВУППСервер()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьВыгрузкуВУПП();
	
КонецПроцедуры

// Евросиб Пирожкова 30.07.2025) 

//&НаКлиенте
//Процедура ВыгрузитьКЗПвУПП()
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыгрузитьКЗПвУПП", ЭтотОбъект);
//	ПоказатьВопрос(ОписаниеОповещения, "Требуется редактирование Заказа УПП. Создать Корректировку заказа поставщику?",РежимДиалогаВопрос.ДаНет, 60);
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродолжитьВыгрузитьКЗПвУПП(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
//		Возврат;
//	Иначе 
//		ВыгрузитьКЗПСервер();
//	КонецЕсли; 
//КонецПроцедуры 

//Евросиб СубботинВ #118799 09.10.2025 Начало
&НаКлиенте
Процедура ВыгрузитьКЗП(Команда)  
	
	ВыгрузитьКЗПСервер()
	
КонецПроцедуры
&НаСервере
Процедура ВыгрузитьКЗПСервер()  
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
	ЕСОбменСервер.ВыгрузитьКЗПвУПП(МассивДокументов, Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	ЗаявкиНаОплатуСервер.ПроверитьКомандыВыгрузкиВУПП(Этаформа, Тип("ДокументСсылка.ПоступлениеТоваровУслуг"), Объект.Ссылка);

		
КонецПроцедуры

//Функция ПроверитьВыгрузкуКЗП()

//	Возврат ЗаявкиНаОплатуСервер.ПроверитьВыгрузкуКЗП(Объект.Ссылка);
//	
//КонецФункции
//Евросиб СубботинВ #118799 09.10.2025 Конец 