
&НаКлиенте
Процедура НайтиСтанцииПоКодам(Команда)
	
	ТЧ.Очистить();
	
	Сч = 2;
	НазваниеАнгл = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	НазваниеРус = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
	Код = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
	
	Пока НазваниеРус <> "" ИЛИ НазваниеАнгл <> "" Цикл
		
		НСтр = ТЧ.Добавить();
		НСтр.ПортENG = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		НСтр.ПортRUS = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		НСтр.КодПорта = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
		
		Сч = Сч + 1;
		
		НазваниеАнгл = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		НазваниеРус = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		Код = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
		
	КонецЦикла;
	
	НайтиСопоставленияСтанциямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НайтиСопоставленияСтанциямНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипПорт", Справочники.ТипыЛокаций.Порт);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛокацииТаблицаСинонимов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |ГДЕ
	               |	(ЛокацииТаблицаСинонимов.СинонимЛокации = &СинонимЛокации
	               |				И &СинонимЛокации <> """"
	               |			ИЛИ ЛокацииТаблицаСинонимов.Ссылка.Наименование = &Наименование
	               |				И &Наименование <> """"
	               |			ИЛИ ЛокацииТаблицаСинонимов.Ссылка.НаименованиеАнгл = &НаименованиеАнгл
	               |				И &НаименованиеАнгл <> """")
	               |	И НЕ ЛокацииТаблицаСинонимов.Ссылка.ПометкаУдаления
	               |	И ЛокацииТаблицаСинонимов.Ссылка.Тип = &ТипПорт";
	
	Для каждого Стр из ТЧ Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ЛокацияСсылка) Тогда
			
			Запрос.УстановитьПараметр("СинонимЛокации", 	Стр.КодПорта);
			Запрос.УстановитьПараметр("Наименование", 		Стр.ПортRUS);
			Запрос.УстановитьПараметр("НаименованиеАнгл", 	Стр.ПортENG);
			Ответ = Запрос.Выполнить().Выбрать();
			Если Ответ.Следующий() Тогда
				Стр.ЛокацияСсылка = Ответ.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ЛокацияСсылка) Тогда
			
			ПортОбъект = Стр.ЛокацияСсылка.ПолучитьОбъект();
			НадоПерезаписать = Ложь;
			Если НЕ ЗначениеЗаполнено(ПортОбъект.НаименованиеАнгл) И ЗначениеЗаполнено(Стр.ПортENG) Тогда
				НадоПерезаписать = Истина;
				ПортОбъект.НаименованиеАнгл = Стр.ПортENG;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ПортОбъект.Наименование) И ЗначениеЗаполнено(Стр.ПортRUS) Тогда
				НадоПерезаписать = Истина;
				ПортОбъект.Наименование = Стр.ПортRUS;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.КодПорта) Тогда
				Если ПортОбъект.ТаблицаСинонимов.НайтиСтроки(Новый Структура("СинонимЛокации", Стр.КодПорта)) = 0 Тогда
					НадоПерезаписать = Истина;
					НСтр = ПортОбъект.ТаблицаСинонимов.Добавить();
					НСтр.СинонимЛокации = Стр.КодПорта;
				КонецЕсли;
			КонецЕсли;
			Если НадоПерезаписать Тогда
				ПортОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОставитьТолькоЦифры(СтрокаЪ)
	
	Результат = "";
	МЦ = Новый Массив;
	МЦ.Добавить("1"); МЦ.Добавить("2"); МЦ.Добавить("3"); 
	МЦ.Добавить("4"); МЦ.Добавить("5"); МЦ.Добавить("6"); 
	МЦ.Добавить("7"); МЦ.Добавить("8"); МЦ.Добавить("9"); 
	МЦ.Добавить("0"); 
	
	Для Сч = 1 По СтрДлина(СтрокаЪ) Цикл
		
		ОчрСимвол = Сред(СтрокаЪ, Сч, 1);
		Если МЦ.Найти(ОчрСимвол) <> неопределено Тогда
			Результат = Результат + ОчрСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ЗаписатьАналогиСтанций(Команда)
	ЗаписатьАналогиСтанцийНаСервере();
	ПоказатьПредупреждение(, "Все порты записаны!");
КонецПроцедуры


&НаСервере
Процедура ЗаписатьАналогиСтанцийНаСервере()
	
	Для каждого Стр из ТЧ Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ЛокацияСсылка) Тогда
			
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Наименование = Стр.ПортRUS;
			НЭлемент.НаименованиеАнгл = Стр.ПортENG;
			Нэлемент.КодПорта = Стр.КодПорта;
			НЭлемент.Записать();
			Стр.ЛокацияСсылка = НЭлемент.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
