
Функция ПолучитьВопросыХарактеристикиПодрядчика() Экспорт
	
	//Вопросы = Новый Массив;
	//Вопросы.Добавить("Характеристика структуры рынка товаров и услуг");
	//Вопросы.Добавить("Сроки оказания услуги");
	//Вопросы.Добавить("Использование услуги (клиентов укажите в комментариях)");
	//Вопросы.Добавить("Характеристика услуг для нового проекта");
	//Вопросы.Добавить("Клиент, для которого закупается услуга, является стратегическим?");
	//Вопросы.Добавить("Отражаются услугия договора с подрядчиком в договоре с клиентом?");
	//Возврат Вопросы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВопросыАнкетКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыАнкетКонтрагентов КАК ВопросыАнкетКонтрагентов
	|ГДЕ
	|	ВопросыАнкетКонтрагентов.ТипКонтрагента_Подрядчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВопросыАнкетКонтрагентов.Код";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
