

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
//Евросиб Гудкова( 17.02.2020 Ticket№ 0187052
	ДатаСозданияАнкеты = ТекущаяДата();
	Автор = Пользователи.ТекущийПользователь();
// Евросиб Гудкова) 	
	ДатаАнкеты = ТекущаяДатаСеанса();
	
	Вопросы = Справочники.АнкетыПодрядчиков.ПолучитьВопросыХарактеристикиПодрядчика();
	Для Каждого Вопрос Из Вопросы Цикл
		
		НоваяСтрока = ХарактеристикиПодрядчика.Добавить();
		НоваяСтрока.Вопрос = Вопрос;
		
	КонецЦикла;
	
КонецПроцедуры

