
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр из Параметры.ТаблицаСостояний Цикл
		
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		
	КонецЦикла;
	
	Элементы.ОтветИнициатора.РедактированиеТекста = ПроверитьПользователя(Пользователи.ТекущийПользователь(), Параметры.Инициатор);
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ТЧПриАктивизацииСтроки(Элемент)
	
	Комментарий = "";
	ОтветИнициатора = "";
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		Комментарий = ТекД.Комментарий;
		ОтветИнициатора = ТекД.ОтветИнициатора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветИнициатораПриИзменении(Элемент)
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.ОтветИнициатора = ОтветИнициатора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЪ(Команда)
	
	ПараметрЪ = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		ПараметрЪ.Добавить(Новый Структура("Состояние, СтатусСогласования, Исполнитель, Комментарий, ОтветИнициатора", Стр.Состояние, Стр.СтатусСогласования, Стр.Исполнитель, Стр.Комментарий, Стр.ОтветИнициатора));
	КонецЦикла;
	
	Закрыть(ПараметрЪ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПользователя(ТекПольз, ТЧПользователь)
	
	ПользовательЕсть = Ложь;
	Если 
		Пользователи_sd_сервер.ГруппаВключаетПользователя(ТЧПользователь, ТекПольз) ИЛИ 
		Пользователи_sd_сервер.ПодобратьЗамещение(ТЧПользователь, ТекущаяДата()) = ТекПольз ИЛИ
		ПользовательЗамещаетКогоТоИзГруппы(ТЧПользователь, ТекПольз)
		Тогда 
		ПользовательЕсть = Истина;
	КонецЕсли;
	
	Возврат ПользовательЕсть;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПользовательЗамещаетКогоТоИзГруппы(Группа, ТекПольз)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыПользователейСостав.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |ГДЕ
	               |	ГруппыПользователейСостав.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Группа);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если Ответ.Пользователь = ТекПольз ИЛИ Пользователи_sd_сервер.ПодобратьЗамещение(Ответ.Пользователь, ТекущаяДата()) = ТекПольз Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции