
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		//НЗ = РегистрыСведений.ПризнакСобственностиВагона.СоздатьНаборЗаписей();
		//НЗ.Отбор.ДокументРегистратор.Установить(ссылка);
		//НЗ.Записать(Истина);
		//
		//НЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьНаборЗаписей();
		//НЗ.Отбор.ДокументРегистратор.Установить(ссылка);
		//НЗ.Записать(Истина);
		//
		//НЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьНаборЗаписей();
		//НЗ.Отбор.АктПолученияКТК.Установить(ссылка);
		//НЗ.Записать(Истина);
		
		Ответ = РегистрыСведений.ПризнакСобственностиВагона.Выбрать(,,Новый Структура("ДокументРегистратор", Ссылка));
		Пока Ответ.Следующий() Цикл
			МЗ = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		КонецЦикла;
		
		Ответ = РегистрыСведений.ПризнакСобственностиКонтейнера.Выбрать(,,Новый Структура("ДокументРегистратор", Ссылка));
		Пока Ответ.Следующий() Цикл
			МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		КонецЦикла;
		
		//Ответ = РегистрыСведений.СрокиИспользованияКонтейнеров.Выбрать(,,Новый Структура("АктПолученияКТК", Ссылка));
		//Пока Ответ.Следующий() Цикл
		//	МЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьМенеджерЗаписи();
		//	ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		//	МЗ.Удалить();
		//КонецЦикла;
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	*
		               |ИЗ
		               |	РегистрСведений.СрокиИспользованияКонтейнеров КАК СрокиИспользованияКонтейнеров
		               |ГДЕ
		               |	СрокиИспользованияКонтейнеров.АктПолученияКТК = &Ссылка
		               |	И СрокиИспользованияКонтейнеров.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			МЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		КонецЦикла;
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ПризнакСобственностиВагона.Период КАК Период,
		//               |	ПризнакСобственностиВагона.Вагон КАК Вагон,
		//               |	ПризнакСобственностиВагона.ПризнакСобственности КАК ПризнакСобственности,
		//               |	ПризнакСобственностиВагона.ВЭксплуатации КАК ВЭксплуатации,
		//               |	ПризнакСобственностиВагона.ДокументРегистратор КАК ДокументРегистратор
		//               |ИЗ
		//               |	РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
		//               |ГДЕ
		//               |	ПризнакСобственностиВагона.ДокументРегистратор = &ДокументРегистратор";
		//Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
		//Ответ = Запрос.Выполнить().Выбрать();
		//Пока Ответ.Следующий() Цикл
		//	МЗ = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
		//	ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		//	МЗ.Удалить();
		//КонецЦикла;
		//
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ПризнакСобственностиКонтейнера.Период КАК Период,
		//               |	ПризнакСобственностиКонтейнера.Контейнер КАК Контейнер,
		//               |	ПризнакСобственностиКонтейнера.ПризнакСобственности КАК ПризнакСобственности,
		//               |	ПризнакСобственностиКонтейнера.ВЭксплуатации КАК ВЭксплуатации,
		//               |	ПризнакСобственностиКонтейнера.ДокументРегистратор КАК ДокументРегистратор
		//               |ИЗ
		//               |	РегистрСведений.ПризнакСобственностиКонтейнера КАК ПризнакСобственностиКонтейнера
		//               |ГДЕ
		//               |	ПризнакСобственностиКонтейнера.ДокументРегистратор = &ДокументРегистратор";
		//Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
		//Ответ = Запрос.Выполнить().Выбрать();
		//Пока Ответ.Следующий() Цикл
		//	МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
		//	ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		//	МЗ.Удалить();
		//КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Стр из РегистрацияНовыхВагонов Цикл
		Если НЕ ЗначениеЗаполнено(стр.ВагонСсылка) тогда			
			//Евросиб Каблов 27.04.2020 (
			Если ЗначениеЗаполнено(Стр.НомерВагона) Тогда
				Стр.ВагонСсылка = Справочники.ТС.НайтиПоНаименованию(Стр.НомерВагона, Истина);
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(стр.ВагонСсылка) тогда
			//Евросиб Каблов 27.04.2020 )
				НВагон = Справочники.ТС.СоздатьЭлемент();
				НВагон.ВладелецТС = Стр.Владелец;
				НВагон.Наименование = Стр.НомерВагона;
				НВагон.РезервноеТС = Стр.Резервное;
				НВагон.ТипТС = Стр.ТипВагона;
				НВагон.ЗаписьИсторииДанных.КомментарийВерсии = "Создан документом Акт постановки / снятия с учета"; //ДИТ Шевченко US 63491 TA 74038 18.09.2023
				НВагон.Записать();
				Стр.ВагонСсылка = НВагон.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из РегистрацияНовыхКонтейнеров Цикл
		Если НЕ ЗначениеЗаполнено(стр.КонтейнерСсылка) тогда
			стр.КонтейнерСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(Стр.НомерКонтейнера, Стр.ТипКонтейнера); // SIV 01.10.20
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(стр.КонтейнерСсылка) тогда
		//	//Евросиб Каблов 27.04.2020 (
		//	Если ЗначениеЗаполнено(Стр.НомерКонтейнера) Тогда
		//		стр.КонтейнерСсылка = Справочники.ТЕ.НайтиПоНаименованию(Стр.НомерКонтейнера);
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	Если НЕ ЗначениеЗаполнено(стр.КонтейнерСсылка) тогда
		//	//Евросиб Каблов 27.04.2020 )
		//		НВагон = Справочники.ТЕ.СоздатьЭлемент();
		//		//НВагон.ВладелецТЕ = Стр.Владелец;
		//		НВагон.Наименование = Стр.НомерКонтейнера;
		//		НВагон.РезервноеТЕ = Стр.Резервное;
		//		НВагон.ТипТЕ = Стр.ТипКонтейнера;
		//		НВагон.Префикс = Лев(Стр.НомерКонтейнера, 4);
		//		НВагон.Номер = Сред(Стр.НомерКонтейнера, 5, 6);
		//		НВагон.КонтрольноеЧисло = Сред(Стр.НомерКонтейнера, 11, 1);
		//		НВагон.Записать();
		//		Стр.КонтейнерСсылка = НВагон.Ссылка;
		//	КонецЕсли;
		//Иначе
		//	
		//	// закомментировано 06.04.20, т.к. иначе идет дублирование с пустыми датами. см. процедуру "ПриЗаписи()"
		//	//РаботаСКонтейнерамиСервер.ДобавитьЗаписьИспользованияКонтейнера(Стр.ДатаВводаВЭксплуатацию, Стр.КонтейнерСсылка,Новый Соответствие, Истина);
		//	
		//КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из СнятиеСУчетаКонтейнеров Цикл
		Если ЗначениеЗаполнено(стр.КонтейнерСсылка) тогда
			
			РаботаСКонтейнерамиСервер.ДобавитьЗаписьИспользованияКонтейнера(Стр.ДатаВыводаИзЭксплуатации, Стр.КонтейнерСсылка, Новый Соответствие, Истина);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Подразделение = Автор.Подразделение;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктПостановкиСнятияСУчета") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ЦФО = ДанныеЗаполнения.ЦФО;
		Для Каждого ТекСтрокаРегистрацияНовыхВагонов Из ДанныеЗаполнения.РегистрацияНовыхВагонов Цикл
			НоваяСтрока = СнятиеСУчетаВагона.Добавить();
			НоваяСтрока.ВагонСсылка = ТекСтрокаРегистрацияНовыхВагонов.ВагонСсылка;
		КонецЦикла;
		Для Каждого ТекСтрокаРегистрацияНовыхКонтейнеров Из ДанныеЗаполнения.РегистрацияНовыхКонтейнеров Цикл
			НоваяСтрока = СнятиеСУчетаКонтейнеров.Добавить();
			НоваяСтрока.КонтейнерСсылка = ТекСтрокаРегистрацияНовыхКонтейнеров.КонтейнерСсылка;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСобственностьВГНаДату(Вагон, Дата)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	               |ИЗ
	               |	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(&Период, Вагон = &Вагон) КАК ПризнакСобственностиВагонаСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Вагон", Вагон);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.ПризнакСобственности;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСобственностьКТНаДату(Контейнер, Дата)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	               |ИЗ
	               |	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(&Период, Контейнер = &Контейнер) КАК ПризнакСобственностиКонтейнераСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.ПризнакСобственности;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПозицияВагоновФакт.Записывать = Истина;
	Движения.ПозицияКонтейнеровФакт.Записывать = Истина;
	Движения.КонтейнерыВСтоках.Записывать = Истина;
	Движения.СтатусыКТК.Записывать = Истина;
	
	Для каждого Стр из РегистрацияНовыхВагонов Цикл
		
		Движение = Движения.ПозицияВагоновФакт.ДобавитьПриход();
		Движение.Локация = Стр.ЛокацияВыдачи;
		Движение.Вагон = Стр.ВагонСсылка;
		Движение.ТипВагона = Стр.ТипВагона;
		Движение.Период = Стр.ДатаВводаВЭксплуатацию;
		Движение.Факт = 1;
		
		МЗ = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
		Мз.Вагон = Стр.ВагонСсылка;
		МЗ.ВЭксплуатации = Истина;
		МЗ.ДокументРегистратор = Ссылка;
		МЗ.Период = Стр.ДатаВводаВЭксплуатацию;
		МЗ.ПризнакСобственности = Стр.ВидСобственности;
		МЗ.Регистратор = Ссылка;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	Для каждого Стр из СнятиеСУчетаВагона Цикл
		
		ДанныеВагона = ПолучитьЛокациюВагона(Стр.ВагонСсылка, Стр.ДатаВыводаИзЭксплуатации);
		
		Движение = Движения.ПозицияВагоновФакт.ДобавитьРасход();
		Движение.Локация = ДанныеВагона.Локация;
		Движение.Вагон = Стр.ВагонСсылка;
		Движение.ТипВагона = ДанныеВагона.ТипВагона;
		Движение.Период = Стр.ДатаВыводаИзЭксплуатации;
		Движение.Факт = ДанныеВагона.ФактОстаток;
		
		МЗ = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
		Мз.Вагон = Стр.ВагонСсылка;
		МЗ.ВЭксплуатации = Ложь;
		МЗ.ДокументРегистратор = Ссылка;
		МЗ.Период = Стр.ДатаВыводаИзЭксплуатации;
		МЗ.ПризнакСобственности = ПолучитьСобственностьВГНаДату(МЗ.Вагон, МЗ.Период-1);
		МЗ.Регистратор = Ссылка;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
	//Евросиб Каблов 11.04.2022 ( Task 45430
	ИспользоватьАРМКТК = Константы.ИспользоватьАРМКТК.Получить();
	ПустаяДата = '00010101';
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДатаДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
	Иначе
		ДатаДокументаОснования = ПустаяДата;
	КонецЕсли;
	//Евросиб Каблов 11.04.2022 )
	
	Для каждого Стр из РегистрацияНовыхКонтейнеров Цикл
		
		Движение = Движения.ПозицияКонтейнеровФакт.ДобавитьПриход();
		Движение.Локация = Стр.ЛокацияВыдачи;
		Движение.Контейнер = Стр.КонтейнерСсылка;
		Движение.ТипКТК = Стр.ТипКонтейнера;
		Движение.Период = Стр.ДатаВводаВЭксплуатацию;
		Движение.Факт = 1;
		
		//Евросиб Каблов 11.04.2022 ( Task 45430
		//МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
		//Мз.Контейнер = Стр.КонтейнерСсылка;
		//МЗ.ВЭксплуатации = Истина;
		//МЗ.ДокументРегистратор = Ссылка;
		//Если ЗначениеЗаполнено(ДокументОснование) Тогда
		//	Период = ДокументОснование.Дата;
		//Иначе
		//	Период = Стр.ДатаВводаВЭксплуатацию;
		//КонецЕсли;
		//МЗ.Период = Период;
		//МЗ.ПризнакСобственности = Стр.ВидСобственности;
		//МЗ.Регистратор = Ссылка;
		//МЗ.ВладелецКТК = Стр.Владелец;
		//МЗ.Договор = Стр.Договор;
		//МЗ.Записать(Истина);
		Если ЗначениеЗаполнено(ДатаДокументаОснования) Тогда
			Период = ДатаДокументаОснования;
		Иначе
			Период = Стр.ДатаВводаВЭксплуатацию;
		КонецЕсли;
		
		// Евросиб US 80159 Рыбьяков К.А. 02.08.2024 ((
		Если НЕ ИспользоватьАРМКТК Тогда
		//Евросиб Каблов 11.04.2022 )
			МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
			Мз.Контейнер = Стр.КонтейнерСсылка;
			//Евросиб СубботинВ #82679 18.06.2024 Начало			
			Если НЕ ДополнительныеСвойства.Свойство("ПроставлениеВПризнакаЭксплуатацииПриСозданииКТК") Тогда
				МЗ.ВЭксплуатации = Истина;
			КонецЕсли;
			//Евросиб СубботинВ #82679 18.06.2024 Начало

			МЗ.ДокументРегистратор = Ссылка;			
			МЗ.Период = Период;
			МЗ.ПризнакСобственности = Стр.ВидСобственности;
			МЗ.Регистратор = Ссылка;
			МЗ.ВладелецКТК = Стр.Владелец;
			МЗ.Договор = Стр.Договор;
			МЗ.Записать(Истина);
		//Евросиб Каблов 11.04.2022 ( Task 45430
		КонецЕсли;
		//Евросиб Каблов 11.04.2022 )
		#Область СтарыйКод
		//Если ИспользоватьАРМКТК Тогда
		//	Запись = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
		//	Запись.КТК = Стр.КонтейнерСсылка;
		//	Запись.Период = Период;
		//	Запись.тек_ВидСобственности = Стр.ВидСобственности;
		//	//Евросиб СубботинВ #82679 18.06.2024 Начало			
		//	Если НЕ ДополнительныеСвойства.Свойство("ПроставлениеВПризнакаЭксплуатацииПриСозданииКТК") Тогда
		//		Запись.тек_ВЭксплуатации = Истина;
		//	КонецЕсли;
		//	//Евросиб СубботинВ #82679 18.06.2024 Начало

		//	//Запись.тек_НаСлежении = ;
		//	Запись.Записать();
		//Иначе
		////Евросиб Каблов 11.04.2022 )
		//	МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
		//	Мз.Контейнер = Стр.КонтейнерСсылка;
		//	//Евросиб СубботинВ #82679 18.06.2024 Начало			
		//	Если НЕ ДополнительныеСвойства.Свойство("ПроставлениеВПризнакаЭксплуатацииПриСозданииКТК") Тогда
		//		МЗ.ВЭксплуатации = Истина;
		//	КонецЕсли;
		//	//Евросиб СубботинВ #82679 18.06.2024 Начало

		//	МЗ.ДокументРегистратор = Ссылка;			
		//	МЗ.Период = Период;
		//	МЗ.ПризнакСобственности = Стр.ВидСобственности;
		//	МЗ.Регистратор = Ссылка;
		//	МЗ.ВладелецКТК = Стр.Владелец;
		//	МЗ.Договор = Стр.Договор;
		//	МЗ.Записать(Истина);
		////Евросиб Каблов 11.04.2022 ( Task 45430
		//КонецЕсли;
		////Евросиб Каблов 11.04.2022 )	
		#КонецОбласти
		// Евросиб Рыбьяков К.А. 02.08.2024 ))
		
		
		СоответствиеПараметры = Новый Соответствие;
		СоответствиеПараметры.Вставить("ПолучениеКонтейнера", Стр.ДатаВводаВЭксплуатацию);
		СоответствиеПараметры.Вставить("НормативВозвратаВСток", Стр.СрокПользованияДней);
		СоответствиеПараметры.Вставить("ИнструкцииПоСдачеПорожнего", Стр.ИнструкцииПоСдаче);
		СоответствиеПараметры.Вставить("СтокВыдачи", Стр.СтокВыдачи);
		СоответствиеПараметры.Вставить("НаправлениеСдачи", Стр.СтокВозврата);
		СоответствиеПараметры.Вставить("ГородСдачи", Стр.ЛокацияВозврата);
		СоответствиеПараметры.Вставить("АктПолученияКТК", Ссылка);
		
		УправлениеКТКВСтокахСервер.ДобавитьЗаписьИспользованияКонтейнера(Период, Стр.КонтейнерСсылка, СоответствиеПараметры, Ложь);
		
		// ??????? по какой причине введенные ктк в систему сразу идут на слежение? WTF? SIV.
		Запись3 = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
		Запись3.Контейнер = Стр.КонтейнерСсылка;
		Запись3.Период = Период;
		Запись3.НаСлежении = Истина;
		Запись3.Записать(Истина);
		
		// SIV 26.09.2020
		Если РегистрироватьВСтокиКонтейнеры И ЗначениеЗаполнено(Стр.ДатаВводаВЭксплуатацию) Тогда
			
			УправлениеКТКВСтокахСервер.КонтейнерыВСтоках_ДобавитьПриход(Движения, Стр.КонтейнерСсылка, Стр.СтокВыдачи,, Стр.Владелец, Стр.ДатаВводаВЭксплуатацию, Стр.СрокПользованияДней);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Стр из СнятиеСУчетаКонтейнеров Цикл
		
		ДанныеКТК = ПолучитьЛокациюКонтейнера(Стр.КонтейнерСсылка, Стр.ДатаВыводаИзЭксплуатации);
		
		Движение = Движения.ПозицияКонтейнеровФакт.ДобавитьРасход();
		Движение.Локация = ДанныеКТК.Локация;
		Движение.Контейнер = Стр.КонтейнерСсылка;
		Движение.ТипКТК = ДанныеКТК.ТипКТК;
		Движение.Период = Стр.ДатаВыводаИзЭксплуатации;
		Движение.Факт = ДанныеКТК.ФактОстаток;
		
		МЗ = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
		Мз.Контейнер = Стр.КонтейнерСсылка;
		МЗ.ВЭксплуатации = Ложь;
		МЗ.ДокументРегистратор = Ссылка;
		МЗ.Период = Стр.ДатаВыводаИзЭксплуатации;
		МЗ.ПризнакСобственности = ПолучитьСобственностьКТНаДату(МЗ.Контейнер, МЗ.Период-1);
		МЗ.Регистратор = Ссылка;
		МЗ.Записать(Истина);
		
		СоответствиеПараметры = Новый Соответствие;
		СоответствиеПараметры.Вставить("ВозвратВСток", Стр.ДатаВыводаИзЭксплуатации);
		РаботаСКонтейнерамиСервер.ДобавитьЗаписьИспользованияКонтейнера(Стр.ДатаВыводаИзЭксплуатации, Стр.КонтейнерСсылка, СоответствиеПараметры, Ложь);
		
		Запись3 = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
		Запись3.Контейнер = Стр.КонтейнерСсылка;
		Запись3.Период = Период;
		Запись3.НаСлежении = Ложь;
		Запись3.Записать(Истина);
		
		// SIV 26.09.2020
		Если СниматьСУчетаКТКИЗакрыватьСрокПользования И ЗначениеЗаполнено(Стр.ДатаСдачиКТКПоставщику) Тогда
			
			УправлениеКТКВСтокахСервер.КонтейнерыВСтоках_СнятьСУчета(Движения, Стр.КонтейнерСсылка, Стр.ДатаСдачиКТКПоставщику);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЛокациюВагона(ВагонСсылка, ДатаВыводаИзЭксплуатации)
	
	Результат = Новый Структура("Локация, ТипВагона, ФактОстаток");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПозицияВагоновФактОстатки.Локация КАК Локация,
	               |	ПозицияВагоновФактОстатки.Вагон КАК Вагон,
	               |	ПозицияВагоновФактОстатки.ТипВагона КАК ТипВагона,
	               |	ПозицияВагоновФактОстатки.ФактОстаток КАК ФактОстаток
	               |ИЗ
	               |	РегистрНакопления.ПозицияВагоновФакт.Остатки(&Период, Вагон = &Вагон) КАК ПозицияВагоновФактОстатки";
	Запрос.УстановитьПараметр("Период", ДатаВыводаИзЭксплуатации);
	Запрос.УстановитьПараметр("Вагон", ВагонСсылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьЛокациюКонтейнера(КТКСсылка, ДатаВыводаИзЭксплуатации)
	
	Результат = Новый Структура("Локация, ТипКТК, ФактОстаток");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПозицияКонтейнеровФактОстатки.Локация КАК Локация,
	               |	ПозицияКонтейнеровФактОстатки.Контейнер КАК Контейнер,
	               |	ПозицияКонтейнеровФактОстатки.ТипКТК КАК ТипКТК,
	               |	ПозицияКонтейнеровФактОстатки.ФактОстаток КАК ФактОстаток
	               |ИЗ
	               |	РегистрНакопления.ПозицияКонтейнеровФакт.Остатки(&Период, Контейнер = &Контейнер) КАК ПозицияКонтейнеровФактОстатки";
	Запрос.УстановитьПараметр("Период", ДатаВыводаИзЭксплуатации);
	Запрос.УстановитьПараметр("Контейнер", КТКСсылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Евросиб Фролов (08.10.2021 Task №39041
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		МассивКонтейнеров = РегистрацияНовыхКонтейнеров.ВыгрузитьКолонку("КонтейнерСсылка");
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
	КонецЕсли;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)
