
&НаКлиенте
Процедура ОК(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = СписокСделок.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
	
		Сообщить("Не выбраны строки для разнесения!");
		Возврат;
	
	КонецЕсли; 
	
	МассивСделок = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		Если МассивСделок.Найти(Стр.СделкаСсылка) = Неопределено Тогда
			МассивСделок.Добавить(Стр.СделкаСсылка);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(МассивСделок);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивСделок") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сделка.Ссылка КАК СделкаСсылка,
		               |	Сделка.СтанцияОтправления КАК ПунктОтправления,
		               |	Сделка.СтанцияНазначения КАК ПунктНазначения,
		               |	Сделка.ПерваяОперация КАК ДатаПервойОперации,
		               |	Сделка.ПоследняяОперация КАК ДатаПоследнейОперации
		               |ИЗ
		               |	Документ.Сделка КАК Сделка
		               |ГДЕ
		               |	Сделка.Ссылка В(&МассивСделок)";
		Запрос.УстановитьПараметр("МассивСделок",Параметры.МассивСделок);
		СписокСделок.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

