
//Евросиб Каблов 07.10.2022 54532
Процедура ОтчетКомитенту_СформироватьДвиженияВзаиморасчетыСПокупателями(ДокОбъект) Экспорт

	ВзаиморасчетыСПокупателями = ДокОбъект.Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПокупателями.Записывать = Истина;
	
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
	СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( ДокОбъект.Ссылка );
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	
	Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			
			Движение = ВзаиморасчетыСПокупателями.ДобавитьРасход();
			Движение.Период = Макс(ДокОбъект.ДатаДокумента, ДокОбъект.ПериодВО);
			Движение.Организация = ДокОбъект.Организация;
			Движение.Контрагент = ДокОбъект.Контрагент;
			Движение.Договор = ДокОбъект.ДоговорКонтрагента;
			Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
			Движение.ДатаРасчетов = ДокОбъект.ДатаДокумента;
			Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
			Движение.ВидЗадолженности = СтрокаТЧ.ВидЗадолженности;
			
			Движение.СуммаБезНДС = ?(ДокОбъект.СуммаВключаетНДС, СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС, СтрокаТЧ.Сумма);
			Движение.СуммаНДС = СтрокаТЧ.СуммаНДС;
			Движение.СуммаСНДС = ?(ДокОбъект.СуммаВключаетНДС, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС);
			Движение.ЭтоВР = Истина;
			
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = СтавкаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
			
			// Вознагражение
			Если ДокОбъект.СпособРасчетаКомиссионногоВознаграждения <> Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
				
				Движение = ВзаиморасчетыСПокупателями.ДобавитьРасход();
				Движение.Период = Макс(ДокОбъект.ДатаДокумента, ДокОбъект.ПериодВО);
				Движение.Организация = ДокОбъект.Организация;
				Движение.Контрагент = ДокОбъект.Контрагент;
				Движение.Договор = ДокОбъект.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
				Движение.ДатаРасчетов = ДокОбъект.ДатаДокумента;
				Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
				Движение.ВидЗадолженности = СтрокаТЧ.ВидЗадолженности;
				
				Движение.СуммаБезНДС = ?(ДокОбъект.СуммаВознагражденияВключаетНДС, СтрокаТЧ.СуммаВознаграждения - СтрокаТЧ.СуммаНДСВознаграждения, СтрокаТЧ.СуммаВознаграждения);
				Движение.СуммаНДС = СтрокаТЧ.СуммаНДСВознаграждения;
				Движение.СуммаСНДС = ?(ДокОбъект.СуммаВознагражденияВключаетНДС, СтрокаТЧ.СуммаВознаграждения, СтрокаТЧ.СуммаВознаграждения + СтрокаТЧ.СуммаНДСВознаграждения);
				
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = СтавкаНДС;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

//Евросиб Каблов 07.10.2022 54532
Процедура РеализацияТоваровУслуг_СформироватьДвиженияВзаиморасчетыСПокупателями(ДокОбъект) Экспорт
	
	ВзаиморасчетыСПокупателями = ДокОбъект.Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПокупателями.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидЗадолженности КАК ВидЗадолженности,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВложенныйЗапрос.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ВложенныйЗапрос.СуммаБезНДС) КАК СуммаБезНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.ВидЗадолженности КАК ВидЗадолженности,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|		КОНЕЦ КАК СуммаБезНДС,
	|		РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|		РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА РеализацияТоваровУслугТовары.Сумма
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|		КОНЕЦ КАК СуммаСНДС
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугУслуги.ВидЗадолженности,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|		КОНЕЦ,
	|		РеализацияТоваровУслугУслуги.СуммаНДС,
	|		РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугУслуги.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВидЗадолженности";
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
	СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( ДокОбъект.Ссылка );
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	
	Пока Выборка.Следующий() Цикл
			
		Движение = ВзаиморасчетыСПокупателями.ДобавитьРасход();
		Движение.Период = Макс(ДокОбъект.ДатаДокумента, ДокОбъект.ПериодВО);
		Движение.Организация = ДокОбъект.Организация;
		Движение.Контрагент = ДокОбъект.Контрагент;
		Движение.Договор = ДокОбъект.ДоговорКонтрагента;
		Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
		Движение.ДатаРасчетов = ДокОбъект.ДатаДокумента;
		Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
		Движение.СтавкаНДС = СтавкаНДС;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
		
КонецПроцедуры

//Евросиб Каблов 07.10.2022 54532
Процедура ПоступлениеНаРасчетныйСчет_СформироватьДвиженияВзаиморасчетыСПокупателями(ДокОбъект) Экспорт
	
	Движения = ДокОбъект.Движения;
	ВзаиморасчетыСПокупателями = Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПокупателями.Записать();
	ВзаиморасчетыСПокупателями.Записывать = Истина;
	
	КопияТаблицыДвижений = Движения.ВзаиморасчетыСПокупателями.Выгрузить();
	КопияТаблицыДвижений.Очистить(); 
	//ТаблицаОстатковВзаиморасчетов = ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект); //Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, закомментировал, не используется
	
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
	СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( ДокОбъект.Ссылка );
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	
	Для каждого Стр из ДокОбъект.РасшифровкаПлатежа Цикл
		
		Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
			
			Движение = ВзаиморасчетыСПокупателями.ДобавитьПриход();
			Движение.Период = ДокОбъект.ДатаВзаиморасчетов;
			Движение.Организация = ДокОбъект.Организация;
			Движение.Контрагент = ДокОбъект.Контрагент;
			Движение.Договор = ДокОбъект.ДоговорКонтрагента;
			// Субботин TASK 72390 18.07.2023  Начало 
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
				Движение.ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
			Иначе 
				Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
			КонецЕсли;
			// Субботин TASK 72390 18.07.2023  Конец
			
			Движение.ДатаРасчетов = ДокОбъект.Дата;
			Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
			Движение.ВидЗадолженности = Перечисления.ВидыЗадолженности.НепривязанныеДеньги;
			Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаВзаиморасчетов, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
			Движение.СуммаНДС = СуммаНДС;
			Движение.СуммаБезНДС = Стр.СуммаВзаиморасчетов - СуммаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = СтавкаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
		КонецЕсли;
		
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
	//|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	//|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
	//|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ЭтоВР КАК ЭтоВР,
	//|	ВзаиморасчетыСПокупателямиОстатки.ВидЗадолженности КАК ВидЗадолженности,
	//|	ВзаиморасчетыСПокупателямиОстатки.ВидЗадолженности.Порядок КАК ВидЗадолженностиПорядок,
	//|	-ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	//|	-ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	//|	-ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	//|			,
	//|			ДокументВзаиморасчетов В (&ДокументыВзаиморасчетов)
	//|				И Организация = &Организация
	//|				И Контрагент = &Контрагент
	//|				И Договор = &Договор) КАК ВзаиморасчетыСПокупателямиОстатки
	//|ГДЕ
	//|	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток < 0";
	//
	//Запрос.УстановитьПараметр("ДокументыВзаиморасчетов", ДокОбъект.ДокументыОплаты.Выгрузить(, "ДокументРеализации"));
	//Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	//Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
	//Запрос.УстановитьПараметр("Договор", ДокОбъект.ДоговорКонтрагента);
	//	
	//ОстаткиПоДокументамВзаиморасчетов = Запрос.Выполнить().Выгрузить();	
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
	МассивДокументовРеализации = ДокОбъект.ДокументыОплаты.Выгрузить().ВыгрузитьКолонку("ДокументРеализации");
	ТаблицаОстатковПоТабличнойЧастиДокументов = ПолучитьТаблицуОстатковПоТабличнойЧастиДокументов(МассивДокументовРеализации);
	ТаблицаОстатковВзаиморасчетовНаТекущийМомент = ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект, , Истина); //для распределения остаток надо получать на текущий момент за минусом движений этого документа (очистили движения выше)
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
	
	//Для Каждого Стр Из ДокОбъект.ДокументыОплаты Цикл
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
	МассивДокументовРеализации = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивДокументовРеализации, Истина);
	МассивДокументовРеализацииДляСторнирования = Новый Массив;
	//ПЕРВЫМ ПРОХОДОМ БУДУТ ОБРАБОТАНЫ ПОЛОЖИТЕЛЬНЫЕ СУММЫ - РАЗНЕСЕНИЕ ОПЛАТ
	//ВТОРЫМ ПРОХОДОМ ОТРИЦАТЕЛЬНЫЕ СУММЫ - СТОРНО, Т.К. ИХ РАСЧЕТ ЗАВИСИТ ОТ ПОЛОЖИТЕЛЬНЫХ СУММ
	Для Каждого ТекущийДокументРеализации Из МассивДокументовРеализации Цикл
		
		//подготовка таблицы распределения сумм по видам задолженности
		ТаблицаСумм = Новый ТаблицаЗначений;
		ТаблицаСумм = ТаблицаОстатковВзаиморасчетовНаТекущийМомент.Скопировать(Новый Структура("ДокументВзаиморасчетов", ТекущийДокументРеализации), "ДокументВзаиморасчетов, СуммаСНДСОстаток");
		ТаблицаСумм.Свернуть("ДокументВзаиморасчетов", "СуммаСНДСОстаток");
		РаспределениеПоВидамЗадолженностиШаблон = ТаблицаОстатковВзаиморасчетовНаТекущийМомент.Скопировать(Новый Структура("ДокументВзаиморасчетов", ТекущийДокументРеализации), "ВидЗадолженности, ВидЗадолженностиПорядок, СуммаСНДСОстаток");
		ТаблицаСумм.Колонки.Добавить("РаспределениеПоВидамЗадолженности");
		
		Если ТаблицаСумм.Количество() = 0 Тогда //на остатках регистра пусто, берем из табличной части распределение
			ТаблицаСумм = ТаблицаОстатковПоТабличнойЧастиДокументов.Скопировать(Новый Структура("Документ", ТекущийДокументРеализации), "Документ, СуммаСНДСОстаток");
			ТаблицаСумм.Колонки.Документ.Имя = "ДокументВзаиморасчетов";
			ТаблицаСумм.Свернуть("ДокументВзаиморасчетов", "СуммаСНДСОстаток");
			РаспределениеПоВидамЗадолженностиШаблон = ТаблицаОстатковПоТабличнойЧастиДокументов.Скопировать(Новый Структура("Документ", ТекущийДокументРеализации), "ВидЗадолженности, ВидЗадолженностиПорядок, СуммаСНДСОстаток");
			ТаблицаСумм.Колонки.Добавить("РаспределениеПоВидамЗадолженности");
		КонецЕсли;
		
		Если ТаблицаСумм.Количество() > 0 Тогда
			ТаблицаСумм[0].РаспределениеПоВидамЗадолженности = РаспределениеПоВидамЗадолженностиШаблон.Скопировать();
		Иначе
			НовСтрокаСумм = ТаблицаСумм.Добавить(); //нет распределения, все спишем на вид задолженности "Неопределено", чтобы не потерять эту сумму и записать в регистр, в отчет выйдет
			НовСтрокаСумм.СуммаСНДСОстаток = 1000000000000;
			СтрокаРаспределения = РаспределениеПоВидамЗадолженностиШаблон.Добавить();
			СтрокаРаспределения.ВидЗадолженности = Неопределено;
			СтрокаРаспределения.СуммаСНДСОстаток = НовСтрокаСумм.СуммаСНДСОстаток;
			НовСтрокаСумм.РаспределениеПоВидамЗадолженности = РаспределениеПоВидамЗадолженностиШаблон.Скопировать();
		КонецЕсли;
		
		ТаблицаДокументовОплаты = ДокОбъект.ДокументыОплаты.Выгрузить(Новый Структура("ДокументРеализации", ТекущийДокументРеализации));
		ТаблицаДокументовОплаты.Сортировать("ДокументРеализации, ДатаОплаты Возр");
		Для Каждого Стр Из ТаблицаДокументовОплаты Цикл
			Если Стр.СуммаОплаты < 0 Тогда
				Продолжить;
			КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец
			
			//Движение = ВзаиморасчетыСПокупателями.ДобавитьРасход();
			Движение = ВзаиморасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Стр.ДатаОплаты;
			Движение.Организация = ДокОбъект.Организация;
			Движение.Контрагент = ДокОбъект.Контрагент;
			Движение.Договор = ДокОбъект.ДоговорКонтрагента;
			// Субботин TASK 72390 18.07.2023  Начало 
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
				Движение.ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
			Иначе 
				Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
			КонецЕсли;
			// Субботин TASK 72390 18.07.2023  Конец
			Движение.ДатаРасчетов = ДокОбъект.Дата;
			Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
			Движение.ВидЗадолженности = Перечисления.ВидыЗадолженности.НепривязанныеДеньги;
			Движение.СуммаСНДС = Стр.СуммаОплаты;
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
			Движение.СуммаНДС = СуммаНДС;
			Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = СтавкаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
			
			//ОстаткиПоДокументу = ОстаткиПоДокументамВзаиморасчетов.Скопировать(Новый Структура("ДокументВзаиморасчетов", Стр.ДокументРеализации));
			//ОстаткиПоДокументу.Сортировать("ВидЗадолженностиПорядок");
			//
			//ОстатокСуммыОплаты = Стр.СуммаОплаты;
			//
			//Для Каждого СтрокаОстатка Из ОстаткиПоДокументу Цикл
			//	
			//	Если ОстатокСуммыОплаты <= 0 Тогда
			//		Прервать;
			//	КонецЕсли;
			//	
			//	СуммаОплаты = Мин(ОстатокСуммыОплаты, СтрокаОстатка.СуммаСНДСОстаток);
			//	ОстатокСуммыОплаты = ОстатокСуммыОплаты - СуммаОплаты;
			//	
			//Движение = ВзаиморасчетыСПокупателями.ДобавитьПриход();
			Движение = КопияТаблицыДвижений.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
			Движение.Период = Стр.ДатаОплаты;			
			Движение.Организация = ДокОбъект.Организация;
			Движение.Контрагент = ДокОбъект.Контрагент;
			Движение.Договор = ДокОбъект.ДоговорКонтрагента;
			// Субботин TASK 72390 18.07.2023  Начало 
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
				Движение.ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
			Иначе 
				Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
			КонецЕсли;
			// Субботин TASK 72390 18.07.2023  Конец	
			Движение.ДатаРасчетов = Макс(ДокОбъект.ДатаВзаиморасчетов, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ДокументРеализации,"ДатаДокумента"));
			Движение.ДокументВзаиморасчетов = Стр.ДокументРеализации;
			Движение.СуммаСНДС = Стр.СуммаОплаты;
			//СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
			Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Стр.ДокументРеализации );
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Движение.СтавкаНДС), Истина, Истина);
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, конец
			Движение.СуммаНДС = СуммаНДС;
			Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
			Движение.ЭтоВР = Стр.ЭтоВР;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Стр.ДокументРеализации ); //Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, закомментировал (перенес више)
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
			//	
			//КонецЦикла;
			//
			//Если ОстатокСуммыОплаты > 0 Тогда
			//	
			//	СуммаОплаты = ОстатокСуммыОплаты;
			//	
			//	Движение = ВзаиморасчетыСПокупателями.ДобавитьПриход();
			//	Движение.Период = Стр.ДатаОплаты;			
			//	Движение.Организация = ДокОбъект.Организация;
			//	Движение.Контрагент = ДокОбъект.Контрагент;
			//	Движение.Договор = ДокОбъект.ДоговорКонтрагента;
			//	Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
			//	Движение.ДатаРасчетов = Макс(ДокОбъект.ДатаВзаиморасчетов, Стр.ДокументРеализации.ДатаДокумента);
			//	Движение.ДокументВзаиморасчетов = Стр.ДокументРеализации;
			//	//Движение.ВидЗадолженности = СтрокаОстатка.ВидЗадолженности;
			//	Движение.СуммаСНДС = СуммаОплаты;
			//	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
			//	Движение.СуммаНДС = СуммаНДС;
			//	Движение.СуммаБезНДС = СуммаОплаты - СуммаНДС;		
			//	Движение.ЭтоВР = Стр.ЭтоВР;
			//	
			//КонецЕсли; 
			//Если Движение.СуммаСНДС > 0 Тогда
			//	РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект, Стр.ДатаОплаты), ДокОбъект);
			//Иначе
			//	РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ПолучитьТаблицуПоТекущимДвижениям(ВзаиморасчетыСПокупателями, Движение.ДокументВзаиморасчетов), ДокОбъект);
			//КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
			//Если Движение.СуммаСНДС > 0 Тогда
			//	РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетовНаТекущийМомент, ДокОбъект, ТаблицаОстатковПоТабличнойЧастиДокументов);;
			//Иначе
			//	РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ПолучитьТаблицуПоТекущимДвижениям(ВзаиморасчетыСПокупателями, Движение.ДокументВзаиморасчетов), ДокОбъект, ТаблицаОстатковПоТабличнойЧастиДокументов);
			//КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
			
			//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
			МассивДокументовРеализацииДляСторнирования.Добавить(ТекущийДокументРеализации);
			ОстатокСуммыОплаты = Движение.СуммаСНДС;
			Если ОстатокСуммыОплаты < 0  Тогда
				ОстатокСуммыОплаты = -ОстатокСуммыОплаты;
				КоэффициентРасчета = -1;
			Иначе
				КоэффициентРасчета = 1;
			КонецЕсли;
			//Евросиб Пирожкова( 22.10.2025 Ticket№0419685 
			//было:	КонтрольРекурсии = 20;
			//стало:
			КонтрольРекурсии = 200;
			// Евросиб Пирожкова 22.10.2025)
			//РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС(ДокОбъект.Движения, Движение, ТаблицаСумм, РаспределениеПоВидамЗадолженностиШаблон, ОстатокСуммыОплаты, ДокОбъект.СтавкаНДС, КоэффициентРасчета, КонтрольРекурсии);
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
			РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС(ДокОбъект.Движения, Движение, ТаблицаСумм, РаспределениеПоВидамЗадолженностиШаблон, ОстатокСуммыОплаты, Движение.СтавкаНДС, КоэффициентРасчета, КонтрольРекурсии);
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, конец
			//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец
		КонецЦикла;	
	КонецЦикла;
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
	ТаблицаПоВсемТекущимДвижениям = ПолучитьТаблицуПоТекущимДвижениям(ВзаиморасчетыСПокупателями, Неопределено);
	
	Для Каждого Стр Из ДокОбъект.ДокументыОплаты Цикл
		
		Если МассивДокументовРеализацииДляСторнирования.Найти(Стр.ДокументРеализации) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.СуммаОплаты >= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = ВзаиморасчетыСПокупателями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Стр.ДатаОплаты;
		Движение.Организация = ДокОбъект.Организация;
		Движение.Контрагент = ДокОбъект.Контрагент;
		Движение.Договор = ДокОбъект.ДоговорКонтрагента;
		// Субботин TASK 72390 18.07.2023  Начало 
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
			Движение.ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
		Иначе 
			Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
		КонецЕсли;
		// Субботин TASK 72390 18.07.2023  Конец
		Движение.ДатаРасчетов = ДокОбъект.Дата;
		Движение.ДокументВзаиморасчетов = ДокОбъект.Ссылка;
		Движение.ВидЗадолженности = Перечисления.ВидыЗадолженности.НепривязанныеДеньги;
		Движение.СуммаСНДС = Стр.СуммаОплаты;
		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
		Движение.СуммаНДС = СуммаНДС;
		Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
		Движение.СтавкаНДС = СтавкаНДС;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
		
		//-------------------------------------------------------------------------
		Движение = КопияТаблицыДвижений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Период = Стр.ДатаОплаты;			
		Движение.Организация = ДокОбъект.Организация;
		Движение.Контрагент = ДокОбъект.Контрагент;
		Движение.Договор = ДокОбъект.ДоговорКонтрагента;
		// Субботин TASK 72390 18.07.2023  Начало 
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
			Движение.ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
		Иначе 
			Движение.ВалютаРасчетов = ДокОбъект.ВалютаДокумента;
		КонецЕсли;
		// Субботин TASK 72390 18.07.2023  Конец	
		Движение.ДатаРасчетов = Макс(ДокОбъект.ДатаВзаиморасчетов, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ДокументРеализации,"ДатаДокумента"));
		Движение.ДокументВзаиморасчетов = Стр.ДокументРеализации;
		Движение.СуммаСНДС = Стр.СуммаОплаты;
		//СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС), Истина, Истина);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
		Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Стр.ДокументРеализации );
		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Движение.СтавкаНДС), Истина, Истина);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
		Движение.СуммаНДС = СуммаНДС;
		Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
		Движение.ЭтоВР = Стр.ЭтоВР;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
		//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Стр.ДокументРеализации ); //Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, закомментировал (перенес выше)
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
		
		//РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаПоВсемТекущимДвижениям, ДокОбъект, ТаблицаОстатковПоТабличнойЧастиДокументов, Ложь);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
		РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаПоВсемТекущимДвижениям, Движение, ТаблицаОстатковПоТабличнойЧастиДокументов, Ложь);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392686, 03-04-2025, начало
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
Процедура РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС(Движения, ДвижениеВзаиморасчетов, ТаблицаСумм, РаспределениеПоВидамЗадолженностиШаблон, ОстатокСуммыОплаты, СтавкаНДС, КоэффициентРасчета, КонтрольРекурсии)
		
		КонтрольРекурсии = КонтрольРекурсии - 1;
		Если КонтрольРекурсии = 0 Тогда  
			//Евросиб Пирожкова( 22.10.2025 Ticket№0419685 
			//было: ВызватьИсключение "Ошибка рекурсивной процедуре РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС()";
			//стало: 
			ВызватьИсключение "Достигнуто максимальное количество итераций рекурсии в процедуре РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС(), обратитесь в техподдержку";
			// Евросиб Пирожкова 22.10.2025)
		КонецЕсли;
	
		ТекущаяСтрокаТаблицыСумм = ТаблицаСумм[ТаблицаСумм.Количество()-1];
		Для Каждого СтрокаОстатка Из ТекущаяСтрокаТаблицыСумм.РаспределениеПоВидамЗадолженности Цикл
			
			Если ОстатокСуммыОплаты <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаОстатка.СуммаСНДСОстаток <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаОплаты = Мин(ОстатокСуммыОплаты, СтрокаОстатка.СуммаСНДСОстаток);
			ОстатокСуммыОплаты = ОстатокСуммыОплаты - СуммаОплаты;
			
			Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ДвижениеВзаиморасчетов,, "Активность");
			Движение.ВидЗадолженности = СтрокаОстатка.ВидЗадолженности;
			Движение.СуммаСНДС = СуммаОплаты * КоэффициентРасчета;
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДС), Истина, Истина);
			Движение.СуммаНДС = СуммаНДС * КоэффициентРасчета;
			Движение.СуммаБезНДС = (СуммаОплаты - СуммаНДС) * КоэффициентРасчета;
			Движение.СтавкаНДС = ДвижениеВзаиморасчетов.СтавкаНДС;
			СтрокаОстатка.СуммаСНДСОстаток = СтрокаОстатка.СуммаСНДСОстаток - СуммаОплаты;
			
			ТекущаяСтрокаТаблицыСумм.СуммаСНДСОстаток = ТекущаяСтрокаТаблицыСумм.СуммаСНДСОстаток - СуммаОплаты; //уменьшаяем итог
			
		КонецЦикла;
		
		Если ОстатокСуммыОплаты > 0 Тогда
			Если ТекущаяСтрокаТаблицыСумм.СуммаСНДСОстаток = 0 Тогда
				ТекущаяСтрокаТаблицыСумм = ТаблицаСумм.Добавить();
				ТекущаяСтрокаТаблицыСумм.СуммаСНДСОстаток = РаспределениеПоВидамЗадолженностиШаблон.Итог("СуммаСНДСОстаток");
				ТекущаяСтрокаТаблицыСумм.РаспределениеПоВидамЗадолженности = РаспределениеПоВидамЗадолженностиШаблон.Скопировать();
				РаспределитьСуммуПоВидамЗадолженностиПоступлениеНаРС(Движения, ДвижениеВзаиморасчетов, ТаблицаСумм, РаспределениеПоВидамЗадолженностиШаблон, ОстатокСуммыОплаты, СтавкаНДС, КоэффициентРасчета, КонтрольРекурсии);
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец

Процедура КорректировкаРеализации_СформироватьДвиженияВзаиморасчетыСПокупателями(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	
	ВзаиморасчетыСПокупателями = Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПокупателями.Записать();
	ВзаиморасчетыСПокупателями.Записывать = Истина;
	
	ВыборкаПоВидамЗадолженности = ПолучитьТаблицуИтогов(ДокОбъект);
	// регистр ВзаиморасчетыСПокупателями Расход
	ДатаДокумента = ДокОбъект.ДатаДокумента;
	ВалютаДокумента = ДокОбъект.ВалютаДокумента;
	ДокументРеализации = ДокОбъект.ДокументРеализации;
	ПериодВО = ДокОбъект.ПериодВО;
	
	ДатаКурсаВалют = ДатаДокумента;
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ДатаКурсаВалют);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурсаВалют);
	//Евросиб Каблов 18.03.2021 )
	//Евросиб Каблов 09.04.2021 ( Ticket#0228336
	РеализацияСуммаВключаетНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "СуммаВключаетНДС");
	//Евросиб Каблов 09.04.2021 )

	//Евросиб Каблов 24.03.2021 ( Ticket#0225744
	ПериодВзаиморасчетов = Макс(ДатаДокумента, ПериодВО);
	//Евросиб Каблов 24.03.2021 )  
	Организация = ДокОбъект.Организация;
	Контрагент = ДокОбъект.Контрагент;
	ДоговорКонтрагента = ДокОбъект.ДоговорКонтрагента;
	ИсходныйДокументРеализации = ДокОбъект.ИсходныйДокументРеализации;
	Товары = ДокОбъект.Товары; 
	Услуги = ДокОбъект.Услуги;
	СуммаВключаетНДС = ДокОбъект.СуммаВключаетНДС;
	
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
	СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( ИсходныйДокументРеализации );
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	
	Пока ВыборкаПоВидамЗадолженности.Следующий() Цикл

	Движение = ВзаиморасчетыСПокупателями.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
	Движение.ВидЗадолженности = ВыборкаПоВидамЗадолженности.ВидЗадолженности;
	Движение.Период = ПериодВзаиморасчетов;
	Движение.Организация 	= Организация;
	Движение.Контрагент 	= Контрагент;
	Движение.Договор 		= ДоговорКонтрагента;
	Движение.ВалютаРасчетов = ВалютаДокумента;
	Движение.ДатаРасчетов 	= ДатаДокумента; // Шейко О.Е. Должно действовать с даты документа
	Движение.ДокументВзаиморасчетов = ИсходныйДокументРеализации;
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
	Движение.СтавкаНДС = СтавкаНДС;
	//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	
	// Евросиб Фролов (12.01.2022 Task№ 45208
	ЭтоВР = Ложь;
	Если ТипЗнч(ИсходныйДокументРеализации) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		// Для отчета комитенту измерение ЭтоВР в регистре заполняем по первой строке.
		// Если в ней номенклатура указана не "Вознаграждение", то это ВР.
		Если Услуги.Количество() > 0 Тогда
			Номенклатура = Услуги[0].Номенклатура;
			ЭтоВР = Номенклатура <> Справочники.Номенклатура.Вознаграждение;			
		КонецЕсли;
	КонецЕсли;	
	Движение.ЭтоВР = ЭтоВР;
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. 58535 20.10.2022 -начало 
	ДокументРеализации = ДокОбъект.ДокументРеализации;
	ВидОперации = ДокОбъект.ВидОперации;
	Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
		И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации, "ВидОперации").ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение
		И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		//Движение.СуммаНДС 		= ((Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения")) - (Товары.Итог("СуммаНДСДоКорректировки")+Услуги.Итог("СуммаНДСДоКорректировки")));
		////Движение.СуммаБезНДС 	= (((Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения"))+Услуги.Итог("ВсегоДоИзменения")-(Услуги.Итог("СуммаНДСДоИзменения"))) - ((Товары.Итог("СуммаДоКорректировки")-Товары.Итог("СуммаНДСДоКорректировки"))+(Услуги.Итог("ВсегоДоКорректировки")-Услуги.Итог("СуммаНДСДоКорректировки"))));
		//Движение.СуммаБезНДС 	= (Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + ((Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("ВсегоДоКорректировки")) + (Услуги.Итог("СуммаНДСДоКорректировки")-Услуги.Итог("СуммаНДСДоИзменения"))));
		//Движение.СуммаСНДС 		= ((Товары.Итог("СуммаДоИзменения")+Услуги.Итог("ВсегоДоИзменения")) - (Товары.Итог("СуммаДоИзменения")+Услуги.Итог("ВсегоДоКорректировки")));
		Движение.СуммаНДС 		= ((ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения) - (ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоКорректировки+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоКорректировки));
		//Движение.СуммаБезНДС 	= (((Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения"))+Услуги.Итог("ВсегоДоИзменения")-(Услуги.Итог("СуммаНДСДоИзменения"))) - ((Товары.Итог("СуммаДоКорректировки")-Товары.Итог("СуммаНДСДоКорректировки"))+(Услуги.Итог("ВсегоДоКорректировки")-Услуги.Итог("СуммаНДСДоКорректировки"))));
		Движение.СуммаБезНДС 	= (ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСумма + ((Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("ВсегоДоКорректировки")) + (Услуги.Итог("СуммаНДСДоКорректировки")-Услуги.Итог("СуммаНДСДоИзменения"))));
		Движение.СуммаСНДС 		= ((ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения+ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения) - (ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения+ВыборкаПоВидамЗадолженности.УслугиВсегоДоКорректировки));
	ИначеЕсли ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
		И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации, "ВидОперации").ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки
		И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		//Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоКорректировки")+Услуги.Итог("СуммаНДСДоКорректировки"));
		//Движение.СуммаБезНДС 	= -((Товары.Итог("СуммаДоКорректировки")-Товары.Итог("СуммаНДСДоКорректировки"))+(Услуги.Итог("ВсегоДоКорректировки")-Услуги.Итог("СуммаНДСДоКорректировки")));
		//Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоКорректировки")+Услуги.Итог("ВсегоДоКорректировки"));	
		Движение.СуммаНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоКорректировки+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоКорректировки);
		Движение.СуммаБезНДС 	= -((ВыборкаПоВидамЗадолженности.ТоварыСуммаДоКорректировки-ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоКорректировки)+(ВыборкаПоВидамЗадолженности.УслугиВсегоДоКорректировки-ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоКорректировки));
		Движение.СуммаСНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоКорректировки+ВыборкаПоВидамЗадолженности.УслугиВсегоДоКорректировки);	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда		
		//Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения"));
		//Движение.СуммаБезНДС 	= -(Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения") + Услуги.Итог("ВсегоДоИзменения")-Услуги.Итог("СуммаНДСДоИзменения"));
		//Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("ВсегоДоИзменения"));
		Движение.СуммаНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения);
		Движение.СуммаБезНДС 	= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения + ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения-ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения);
		Движение.СуммаСНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения + ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		//Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")-Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДСДоИзменения")-Услуги.Итог("СуммаНДС"));
		//Движение.СуммаБезНДС 	= - (Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + ((Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("Всего")) + (Услуги.Итог("СуммаНДС")-Услуги.Итог("СуммаНДСДоИзменения"))));
		//Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("Всего"));
		Движение.СуммаНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСуммаНДС+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения-ВыборкаПоВидамЗадолженности.УслугиСуммаНДС);
		Движение.СуммаБезНДС 	= - (ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСумма + ((ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения- ВыборкаПоВидамЗадолженности.УслугиВсего) + (ВыборкаПоВидамЗадолженности.УслугиСуммаНДС-ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения)));
		Движение.СуммаСНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСумма + ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения- ВыборкаПоВидамЗадолженности.УслугиВсего);
	Иначе
		//Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения"));
		//Если СуммаВключаетНДС Тогда
		//	Движение.СуммаБезНДС 	= -((Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения")) + (Услуги.Итог("СуммаДоИзменения")-Услуги.Итог("СуммаНДСДоИзменения")));
		//Иначе
		//	Движение.СуммаБезНДС 	= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("СуммаДоИзменения"));
		//КонецЕсли;
		//Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("ВсегоДоИзменения"));
		Движение.СуммаНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения+ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения);
		Если СуммаВключаетНДС Тогда
			Движение.СуммаБезНДС 	= -((ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения-ВыборкаПоВидамЗадолженности.ТоварыСуммаНДСДоИзменения) + (ВыборкаПоВидамЗадолженности.УслугиСуммаДоИзменения-ВыборкаПоВидамЗадолженности.УслугиСуммаНДСДоИзменения));
		Иначе
			Движение.СуммаБезНДС 	= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения + ВыборкаПоВидамЗадолженности.УслугиСуммаДоИзменения);
		КонецЕсли;
		Движение.СуммаСНДС 		= -(ВыборкаПоВидамЗадолженности.ТоварыСуммаДоИзменения + ВыборкаПоВидамЗадолженности.УслугиВсегоДоИзменения);
	КонецЕсли;
		
	Если Не ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование И НЕ ВидОперации=Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		Движение = ВзаиморасчетыСПокупателями.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период = ПериодВзаиморасчетов;
		Движение.Организация	= Организация;
		Движение.Контрагент 	= Контрагент;
		Движение.Договор 		= ДоговорКонтрагента;
		Движение.ВалютаРасчетов = ВалютаДокумента;
		Движение.ДатаРасчетов 	= ДатаДокумента;
		Движение.ДокументВзаиморасчетов = ИсходныйДокументРеализации;
		//Движение.СуммаНДС 		= Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС");
		//Движение.СуммаБезНДС 	= ?(СуммаВключаетНДС,Товары.Итог("Сумма")-Товары.Итог("СуммаНДС")+Услуги.Итог("Сумма")-Услуги.Итог("СуммаНДС"),Товары.Итог("Сумма")+Услуги.Итог("Сумма"));
		//Движение.СуммаСНДС 		= ?(СуммаВключаетНДС,Товары.Итог("Сумма")+Услуги.Итог("Сумма"),Товары.Итог("Сумма")+Услуги.Итог("Сумма") + Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС"));
		Движение.СуммаНДС 		= ВыборкаПоВидамЗадолженности.ТоварыСуммаНДС+ВыборкаПоВидамЗадолженности.УслугиСуммаНДС;
		Движение.СуммаБезНДС 	= ?(СуммаВключаетНДС,ВыборкаПоВидамЗадолженности.ТоварыСумма-ВыборкаПоВидамЗадолженности.ТоварыСуммаНДС+ВыборкаПоВидамЗадолженности.УслугиСумма-ВыборкаПоВидамЗадолженности.УслугиСуммаНДС,ВыборкаПоВидамЗадолженности.ТоварыСумма+ВыборкаПоВидамЗадолженности.УслугиСумма);
		Движение.СуммаСНДС 		= ?(СуммаВключаетНДС,ВыборкаПоВидамЗадолженности.ТоварыСумма+ВыборкаПоВидамЗадолженности.УслугиСумма,ВыборкаПоВидамЗадолженности.ТоварыСумма+ВыборкаПоВидамЗадолженности.УслугиСумма + ВыборкаПоВидамЗадолженности.ТоварыСуммаНДС+ВыборкаПоВидамЗадолженности.УслугиСуммаНДС);
		Движение.ВидЗадолженности = ВыборкаПоВидамЗадолженности.ВидЗадолженности;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
		Движение.СтавкаНДС = СтавкаНДС;
		//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
	КонецЕсли; 
	//ДИТ Шевченко А.В. 58535 20.10.2022 -конец
	КонецЦикла;
КонецПроцедуры

Процедура КорректировкаДолга_СформироватьДвижения(ДокОбъект) Экспорт
	//Евросиб Каблов 18.03.2021 (
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	//Евросиб Каблов 18.03.2021 )

	Движения = ДокОбъект.Движения;
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	Движения.ВзаиморасчетыСПокупателями.Записать();
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
// 	Движения.ВзаиморасчетыСПоставщикамиПланФакт.Записывать = Истина;
// Евросиб Гудкова)
	
	//Евросиб Каблов 19.01.2026 ( #115139
	Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записать();
	//Евросиб Каблов 19.01.2026 )

	Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	Движения.ПривязанныеСчетаПоставщиков.Записывать = Истина;
	
	ВидОперации 				= ДокОбъект.ВидОперации;
	ВидАвансаЗадолженности 		= ДокОбъект.ВидАвансаЗадолженности;
	КредиторскаяЗадолженность 	= ДокОбъект.КредиторскаяЗадолженность;
    ДебиторскаяЗадолженность	= ДокОбъект.ДебиторскаяЗадолженность;
	Дата 						= ДокОбъект.Дата;
	Организация 				= ДокОбъект.Организация;
	КонтрагентДебитор 			= ДокОбъект.КонтрагентДебитор;
	КонтрагентКредитор 			= ДокОбъект.КонтрагентКредитор;
	Ссылка						= ДокОбъект.Ссылка;
	СуммаДтЗадолженности 		= ДокОбъект.СуммаДтЗадолженности;
	СуммаКтЗадолженности 		= ДокОбъект.СуммаКтЗадолженности; 
	КопияТаблицыДвижений = Движения.ВзаиморасчетыСПокупателями.Выгрузить();
	КопияТаблицыДвижений.Очистить(); 
	ТаблицаОстатковВзаиморасчетов = ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект);
	
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		Если ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПокупателями 
				Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
				Движение = КопияТаблицыДвижений.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Период 			= Дата;
				Движение.Организация 		= Организация;
				Движение.Контрагент 		= КонтрагентДебитор;
				Движение.Договор 			= Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов 	= Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 		= Дата;
				//Евросиб Каблов 26.01.2021 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Реализация 						= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
					Движение.ДокументВзаиморасчетов = Реализация;
					Движение.ДокументДвижения 		= Стр.Сделка;
				Иначе
					Движение.ДокументВзаиморасчетов = Стр.Сделка;
				КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				
				//Евросиб Фокеева 28.11.2023 ( Ticket#0332572
				//Евросиб Каблов 26.01.2021 ) 
				//Евросиб Дубская 16.01.2023 ( Ticket#0294896
				//Движение.СуммаСНДС = Стр.Сумма;   
				//Если Движение.ВалютаРасчетов = ВалютаРегл Тогда
				//	Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
				//Иначе
				//	Движение.СуммаСНДС = Стр.Сумма;
				//КонецЕсли;
				//Евросиб Дубская 16.01.2023 )
				Движение.СуммаСНДС = Стр.Сумма; 				
				// Евросиб Фокеева)
				
				Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, Стр);
				
				Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Контрагент = КонтрагентКредитор;
				Движение.Договор = Стр.КорДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов = Дата;
				//Евросиб Каблов 19.11.2020 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если Стр.КорДоговорКонтрагента <> Стр.ДоговорКонтрагента Тогда
					Движение.ДокументВзаиморасчетов = Ссылка;
					Движение.ВидЗадолженности = Перечисления.ВидыЗадолженности.НепривязанныеДеньги;
				Иначе
					//Евросиб Каблов 26.01.2021 (
					//Движение.ДокументВзаиморасчетов = Стр.Сделка;
					Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
						Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
						Движение.ДокументВзаиморасчетов = Реализация;
						Движение.ДокументДвижения = Стр.Сделка;
					Иначе
						Движение.ДокументВзаиморасчетов = Стр.Сделка;
					КонецЕсли;
					//Евросиб Каблов 26.01.2021 )
				КонецЕсли;
				//Евросиб Каблов 19.11.2020 )
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)      
				
				//Евросиб Фокеева 28.11.2023 ( Ticket#0332572 				
				//Евросиб Дубская 16.01.2023 ( Ticket#0294896
				//Движение.СуммаСНДС = Стр.Сумма;   
				//Если Движение.ВалютаРасчетов = ВалютаРегл Тогда
					Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
				//Иначе
				//	Движение.СуммаСНДС = Стр.Сумма;
				//КонецЕсли;
				//Евросиб Дубская 16.01.2023 )				
				// Евросиб Фокеева)
				
				Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
				
				//Евросиб СубботинВ #103438 24.02.2025 Начало
				СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателейПоПереносуЗадолженностиАвансаПокупателя(ДокОбъект);
				//Евросиб СубботинВ #103438 24.02.2025 Конец 
				
			КонецЦикла;
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПокупателями  
				//Евросиб - АСуслов 14.01.2023 17:51:53 #61660
				//(
				Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
				Движение = КопияТаблицыДвижений.Добавить();
				//)
				//Евросиб - АСуслов 14.01.2023 17:51:55 #61660
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Контрагент = КонтрагентДебитор;
				Движение.Договор = Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов = Дата;
				//Евросиб Каблов 26.01.2021 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
					Движение.ДокументВзаиморасчетов = Реализация;
					Движение.ДокументДвижения = Стр.Сделка;
				Иначе
					Движение.ДокументВзаиморасчетов = Стр.Сделка;
				КонецЕсли;
				//Евросиб Каблов 26.01.2021 ) 
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				
				//Евросиб Дубская 16.01.2023 ( Ticket#0294896
				//Движение.СуммаСНДС = Стр.Сумма;   
				Если Движение.ВалютаРасчетов = ВалютаРегл Тогда
					Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
				Иначе
					Движение.СуммаСНДС = Стр.Сумма;
				КонецЕсли;
				//Евросиб Дубская 16.01.2023 )

				Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, Стр);
				
				//Евросиб - АСуслов 14.01.2023 17:51:38 #61660
				//(
				//Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
				Движение = КопияТаблицыДвижений.Добавить();
				//)
				//Евросиб - АСуслов 14.01.2023 17:51:40 #61660
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Контрагент = КонтрагентКредитор;
				Движение.Договор = Стр.КорДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов = Дата;
				//Евросиб Каблов 26.01.2021 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
					Движение.ДокументВзаиморасчетов = Реализация;
					Движение.ДокументДвижения = Стр.Сделка;
				Иначе
					Движение.ДокументВзаиморасчетов = Стр.Сделка;
				КонецЕсли;
				//Евросиб Каблов 26.01.2021 )
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				
				//Евросиб Дубская 16.01.2023 ( Ticket#0294896
				//Движение.СуммаСНДС = Стр.Сумма;   
				Если Движение.ВалютаРасчетов = ВалютаРегл Тогда
					Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
				Иначе
					Движение.СуммаСНДС = Стр.Сумма;
				КонецЕсли;
				//Евросиб Дубская 16.01.2023 )
				Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, Стр);
				
			//Евросиб СубботинВ #103438 24.02.2025 Начало
			 ПараметрыОтбора  = Новый Структура("ГУИДДебиторскаяЗадолженность", Стр.Гуид);
             СтрокиРасшифровки = ДокОбъект.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(ПараметрыОтбора);
			 Если СтрокиРасшифровки.Количество() >0 Тогда 
			 	СформироватьДвиженияПоРазнесениюВходящихПлатежейПоСчетамПокупателей(Движения, Дата, ВидОперации, СтрокиРасшифровки,
				Стр.ДоговорКонтрагента, КонтрагентДебитор, Стр.КорДоговорКонтрагента,КонтрагентКредитор);
			 КонецЕсли;
			 //Евросиб СубботинВ #103438 24.02.2025 Конец 				
				
			КонецЦикла;
					
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПоставщиками  
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= - Стр.Сумма;
				
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 - ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли; 
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.КорДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				//Евросиб Дубская 25.01.2023 ( Ticket#0294896
				//Движение.СуммаСНДС = Стр.Сумма; 
				Если Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов <> ВалютаРегл 
					И Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов <> Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
					
					ПараметрыТекущегоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов, Стр.ДатаВзаиморасчетов);
					ПараметрыНовогоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов, Стр.ДатаВзаиморасчетов);
					Движение.СуммаСНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
				ИначеЕсли Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов = ВалютаРегл Тогда
					Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
				Иначе
					Движение.СуммаСНДС = Стр.Сумма; 
				КонецЕсли;	
				//Евросиб Дубская 16.01.2023 )
				
				
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда 
				//Евросиб Дубская 03.02.2023 ( Ticket#0294896
				//Движение.ДопРегистратор = Стр.Сделка;    
				Движение.ДопРегистратор = ?(Стр.Сделка.ВалютаДокумента = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов, Стр.Сделка, Неопределено);    
				//Евросиб Дубская 16.01.2023 )
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
					
					// Шейко О.Е. Изменения по регистрам для Отчета "ДетализированнаяВедомость" 5
					Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
						
						Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
						Движение.Период 		= Дата;
						Движение.Организация 	= Организация;
						Движение.Контрагент 	= КонтрагентКредитор;
						Движение.Договор 		= Стр.КорДоговорКонтрагента;
						Движение.СчетПоставщика = Стр.Сделка;  
						//Евросиб Дубская 22.05.2023 ( Ticket#0294896 
						//Движение.Сумма 			= Стр.Сумма;   
						ПараметрыТекущегоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов, Стр.ДатаВзаиморасчетов);
						ПараметрыНовогоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов, Стр.ДатаВзаиморасчетов);
						Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
						Движение.Сумма 			= Сумма;
						//Евросиб Дубская 22.05.2023 )
						//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
						Движение.ДопРегистратор = Стр.Сделка;
						Движение.СчетПоставщика = Стр.ДокументРасшифровка;
						//КонецЕсли;  
						
						//Евросиб Дубская 22.05.2023 ( Ticket#0294896 
						Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
						Движение.Период 		= Дата;
						Движение.Организация 	= Организация;
						Движение.Контрагент 	= КонтрагентДебитор;
						Движение.Договор 		= Стр.ДоговорКонтрагента;
						Движение.СчетПоставщика = Стр.Сделка;  
						Движение.Сумма 			= - Стр.Сумма;
						Движение.ДопРегистратор = Стр.Сделка;
						Движение.СчетПоставщика = Стр.ДокументРасшифровка;
						//Евросиб Дубская 22.05.2023 )
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПоставщиками
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= - Стр.Сумма;
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 - ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.КорДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС = Стр.Сумма;   
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
					ИЛИ ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
					
					Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					
						// Шейко О.Е. Изменения по регистрам для Отчета "ДетализированнаяВедомость"
						Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
						Движение.Период 		= Дата;
						Движение.Организация 	= Организация;
						Движение.Контрагент 	= КонтрагентКредитор;
						Движение.Договор 		= Стр.КорДоговорКонтрагента;
						//Движение.СчетПоставщика = Стр.Сделка;
						Движение.Сумма 			= Стр.Сумма;
						//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
						Движение.ДопРегистратор = Стр.Сделка;
						Движение.СчетПоставщика = Стр.ДокументРасшифровка;
						//КонецЕсли;
						
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности Тогда
		
		Если ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				
				Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Стр.ДатаВзаиморасчетов;
				//Евросиб Каблов 26.01.2021 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
					Движение.ДокументВзаиморасчетов = Реализация;
					Движение.ДокументДвижения = Стр.Сделка;
				Иначе
					Движение.ДокументВзаиморасчетов = Стр.Сделка;
				КонецЕсли;
				//Евросиб Каблов 26.01.2021 )
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС-Движение.СуммаНДС;
				
				//Евросиб СубботинВ #103438 24.02.2025 Начало 
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
					Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записывать = Истина;
					Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьПриход();
					Движение.Период = Стр.ДатаВзаиморасчетов;
					Движение.Контрагент = КонтрагентКредитор;
					Движение.Договор = Стр.ДоговорКонтрагента;
					Движение.Поступление = Стр.Сделка;
					Движение.Валюта = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
					Движение.КурсВзаиморасчетов = Стр.КурсВзаиморасчетов;
					//Запись.ДокументРазнесения = ДокОбъект.Ссылка;
					Движение.Сумма = Стр.Сумма;					
				КонецЕсли;	
	            //Евросиб СубботинВ #103438 24.02.2025 Конец
				
			КонецЦикла;
					
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				
				//Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
				Движение = КопияТаблицыДвижений.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Стр.ДатаВзаиморасчетов;
				//Евросиб Каблов 26.01.2021 ( Ticket#0219062
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Сделка, "ДокументРеализации");
					Движение.ДокументВзаиморасчетов = Реализация;
					Движение.ДокументДвижения = Стр.Сделка;
				Иначе
					Движение.ДокументВзаиморасчетов = Стр.Сделка;
				КонецЕсли;
				//Евросиб Каблов 26.01.2021 )
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Евросиб Фролов (12.01.2022 Task№ 45208
				// Для загрузки из РИТМа
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС-Движение.СуммаНДС;
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
					ИЛИ ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ПолучитьТаблицуОстатковПоТабличнойЧастиДокумента(Стр.Сделка), Стр);
				Иначе
					Движение.ВидЗадолженности = Перечисления.ВидыЗадолженности.НепривязанныеДеньги;
					ДвижениеВзаиморасчетов = Движения.ВзаиморасчетыСПокупателями.Добавить();
					ЗаполнитьЗначенияСвойств(ДвижениеВзаиморасчетов, Движение,, "Активность");
				КонецЕсли;
								
			КонецЦикла;
			
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				
				ЭтоДвПоСписанию_с_РС = ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета");
				
				
	//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
//				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
	// Евросиб Гудкова) 			
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Стр.ДатаВзаиморасчетов;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС-Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				
					// Шейко О.Е. Изменения по регистрам для Отчета "ДетализированнаяВедомость" 1
					Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
					Движение.Период 		= Дата;
					Движение.Организация 	= Организация;
					Движение.Контрагент 	= КонтрагентКредитор;
					Движение.Договор 		= Стр.ДоговорКонтрагента;
					//Движение.СчетПоставщика = Стр.Сделка;
					Движение.Сумма 			= Стр.Сумма;
					//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					Движение.ДопРегистратор = Стр.Сделка;
					Движение.СчетПоставщика = Стр.ДокументРасшифровка;
					//КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла;
			
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				
	//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
//				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
	// Евросиб Гудкова) 			
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентКредитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Стр.ДатаВзаиморасчетов;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС-Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					
					// Шейко О.Е. Изменения по регистрам для Отчета "ДетализированнаяВедомость" 2
					Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
					Движение.Период 		= Дата;
					Движение.Организация 	= Организация;
					Движение.Контрагент 	= КонтрагентКредитор;
					Движение.Договор 		= Стр.КорДоговорКонтрагента;
					//Движение.СчетПоставщика = Стр.Сделка;
					Движение.Сумма 			= Стр.Сумма;
					//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					Движение.ДопРегистратор = Стр.Сделка;
					Движение.СчетПоставщика = Стр.ДокументРасшифровка;
					//КонецЕсли;
					
				КонецЕсли; 
				
				
			КонецЦикла;
			
		КонецЕсли;
		
		/////////////////////
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		
		Если ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПокупателями 
				//Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьРасход();
				Движение = КопияТаблицыДвижений.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, Стр);				
			КонецЦикла;
			
			//Евросиб СубботинВ #103438 24.02.2025 Начало			 
			СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателей(ДокОбъект, КредиторскаяЗадолженность);
			//Евросиб СубботинВ #103438 24.02.2025 Конец
			 		   
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПокупателями  
				//Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьПриход();
				Движение = КопияТаблицыДвижений.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= Стр.Сумма;
				Движение.СуммаНДС  		= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				// Евросиб Фролов (12.01.2022 Task№ 45208
				ЗаполнитьИзмерениеЭтоВР(Движение);
				// Евросиб Фролов)
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, Стр); 
				
				//Евросиб СубботинВ #103438 24.02.2025 Начало
				ПараметрыОтбора  = Новый Структура("ГУИДДебиторскаяЗадолженность", Стр.Гуид);
				СтрокиРасшифровки = ДокОбъект.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(ПараметрыОтбора);
				Если СтрокиРасшифровки.Количество() >0 Тогда 
					СформироватьДвиженияПоРазнесениюВходящихПлатежейПоСчетамПокупателей(Движения, Дата, ВидОперации, СтрокиРасшифровки,
					Стр.ДоговорКонтрагента, КонтрагентДебитор);
				КонецЕсли;				
				//Евросиб СубботинВ #103438 24.02.2025 Конец
				
				//Евросиб СубботинВ #103438 24.02.2025 Начало			 
				СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателей(ДокОбъект, ДебиторскаяЗадолженность);
				//Евросиб СубботинВ #103438 24.02.2025 Конец
				
			КонецЦикла;
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			Для каждого Стр из ДебиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПоставщиками 
				
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 	= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 		= - Стр.Сумма;
				Движение.СуммаНДС  		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 - ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				// Шейко О.Е. Изменения по регистрам для Отчета "ДетализированнаяВедомость" 3
				Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
					И ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					
					Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
					Движение.Период 		= Дата;
					Движение.Организация 	= Организация;
					Движение.Контрагент 	= КонтрагентДебитор;
					Движение.Договор 		= Стр.ДоговорКонтрагента;
					//Движение.СчетПоставщика	= Стр.Сделка;
					Движение.Сумма			= - Стр.Сумма;
					//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
					Движение.ДопРегистратор = Стр.Сделка;
					Движение.СчетПоставщика = Стр.ДокументРасшифровка;
					//КонецЕсли; 
				
				КонецЕсли; 
				
			КонецЦикла;
		ИначеЕсли ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			Для каждого Стр из КредиторскаяЗадолженность Цикл
				// регистр ВзаиморасчетыСПоставщиками 
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
				Движение.Период 			= Дата;
				Движение.Организация 		= Организация;
				Движение.Контрагент 		= КонтрагентДебитор;
				Движение.Договор 			= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов 	= Стр.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Движение.ДатаРасчетов 		= Дата;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.СуммаСНДС 			= - Стр.Сумма;
				Движение.СуммаНДС  			= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 - ПолучитьСуммуНДС(Стр.Сумма, Стр.СтавкаНДС, Истина, Стр.НДСВключая);
				Движение.СуммаБезНДС 		= Движение.СуммаСНДС - Движение.СуммаНДС;
				//Если ЗначениеЗаполнено(Стр.ДокументРасшифровка) Тогда
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.ДокументВзаиморасчетов = Стр.ДокументРасшифровка;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				
				Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= КонтрагентДебитор;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				Движение.Сумма 			= -Стр.Сумма;
				Движение.ДопРегистратор = Стр.Сделка;
				Движение.СчетПоставщика = Стр.ДокументРасшифровка;
				//Евросиб Каблов 18.06.2021 )
				
			КонецЦикла;
		КонецЕсли;			
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 17.06.2024
		//Если договоры в разных валютах, то суммы Дт и Кт задолженности могут быть не равны.
		ВалютыДоговоровРазличны = Ложь;
		Если ДебиторскаяЗадолженность.Количество() > 0
			и КредиторскаяЗадолженность.Количество() > 0 Тогда 
			ДоговорДт = ДебиторскаяЗадолженность[0].ДоговорКонтрагента;
			ДоговорКт = КредиторскаяЗадолженность[0].ДоговорКонтрагента;
			МассивДоговоров = Новый Массив;
			МассивДоговоров.Добавить(ДоговорДт);
			МассивДоговоров.Добавить(ДоговорКт);
			ВалютыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДоговоров, "ВалютаВзаиморасчетов");
		    Если ВалютыДоговоров[ДоговорДт].ВалютаВзаиморасчетов <> ВалютыДоговоров[ДоговорКт].ВалютаВзаиморасчетов Тогда
				ВалютыДоговоровРазличны = Истина;
			КонецЕсли;
		КонецЕсли;
		// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 17.06.2024
			
		Если СуммаДтЗадолженности <> СуммаКтЗадолженности   
			// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 17.06.2024
			и не ВалютыДоговоровРазличны Тогда
			// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 17.06.2024
			Отказ = Истина;
			Сообщить("Для взаимозачета суммы дебиторской и кредиторской задолженностей должны быть равны");
		Иначе
			
			Для Каждого СтрД Из ДебиторскаяЗадолженность Цикл
				//ДтПоставщик = ЭтоПоставщик(СтрД.ДоговорКонтрагента.ВидДоговора);
				ДтПоставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрД.ДоговорКонтрагента, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
				Если ДтПоставщик Тогда
					Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход(); //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Контрагент = КонтрагентДебитор;
					Движение.Договор = СтрД.ДоговорКонтрагента;
					Движение.ДатаРасчетов = Дата;
					//Движение.ДокументВзаиморасчетов = СтрД.Сделка;
					Движение.ДопРегистратор = СтрД.Сделка;
					Движение.ДокументВзаиморасчетов = СтрД.ДокументРасшифровка;
					Движение.СуммаСНДС = СтрД.Сумма;
					Движение.СуммаНДС  = 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(СтрД.Сумма, СтрД.СтавкаНДС, Истина, СтрД.НДСВключая);
					Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
					//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
					
					// ДИТ Ticket#0347809 Сержантова А.С. Начало: 17.05.2024
					Если ЗначениеЗаполнено(СтрД.ДокументРасшифровка) Тогда
					// ДИТ Ticket#0347809 Сержантова А.С. Конец: 17.05.2024
					
						Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход(); //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ДобавитьПриход();
						Движение.Период 		= Дата;
						Движение.Организация 	= Организация;
						// Евросиб Дубская 29.12.2022 ( Ticket#0291438
						//Движение.Контрагент 	= КонтрагентКредитор; 
						Движение.Контрагент 	= КонтрагентДебитор; 
						//Евросиб Дубская 29.12.2022 )
						Движение.Договор 		= СтрД.ДоговорКонтрагента;
						Движение.Сумма 			= СтрД.Сумма;
						Движение.ДопРегистратор = СтрД.Сделка;
						Движение.СчетПоставщика = СтрД.ДокументРасшифровка;					
					
					// ДИТ Ticket#0347809 Сержантова А.С. Начало: 17.05.2024
					КонецЕсли;
					// ДИТ Ticket#0347809 Сержантова А.С. Конец: 17.05.2024
					//Евросиб Каблов 18.06.2021 ) 
					
// Евросиб Гудкова)	
				//Евросиб СубботинВ #103438 24.02.2025 Начало //добавил и на прочее общий алгоритм
				ПараметрыОтбора  = Новый Структура("ГУИДДебиторскаяЗадолженность", СтрД.Гуид);
				СтрокиРасшифровки = ДокОбъект.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(ПараметрыОтбора);
				Если СтрокиРасшифровки.Количество() >0 Тогда 
					СформироватьДвиженияПоРазнесениюВходящихПлатежейПоСчетамПокупателей(Движения, Дата, ВидОперации, СтрокиРасшифровки,
					СтрД.ДоговорКонтрагента, КонтрагентДебитор);
				КонецЕсли;
				
				//Евросиб СубботинВ #103438 24.02.2025 Конец		

						
				Иначе
					//Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьПриход();
					Движение = КопияТаблицыДвижений.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Контрагент = КонтрагентДебитор;
					Движение.Договор = СтрД.ДоговорКонтрагента;
					Движение.ВалютаРасчетов = СтрД.ДоговорКонтрагента.ВалютаВзаиморасчетов;
					Движение.ДатаРасчетов = Дата;
					Движение.ДокументВзаиморасчетов = СтрД.Сделка;
					Движение.СуммаСНДС = СтрД.Сумма;
					Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрД.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрД.СтавкаНДС), Истина, СтрД.НДСВключая);
					Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
					Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
					
					// Евросиб Фролов (12.01.2022 Task№ 45208
					ЗаполнитьИзмерениеЭтоВР(Движение);
					// Евросиб Фролов)   
					РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, СтрД);				
				КонецЕсли;
				
				//Евросиб СубботинВ #103438 24.02.2025 Начало //добавил и на прочее общий алгоритм
				ПараметрыОтбора  = Новый Структура("ГУИДДебиторскаяЗадолженность", СтрД.Гуид);
				СтрокиРасшифровки = ДокОбъект.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(ПараметрыОтбора);
				Если СтрокиРасшифровки.Количество() >0 Тогда 
					СформироватьДвиженияПоРазнесениюВходящихПлатежейПоСчетамПокупателей(Движения, Дата, ВидОперации, СтрокиРасшифровки,
					СтрД.ДоговорКонтрагента, КонтрагентДебитор);
				КонецЕсли;
				
				//Евросиб СубботинВ #103438 24.02.2025 Конец				

				
			КонецЦикла;
			
			Для Каждого СтрК Из КредиторскаяЗадолженность Цикл
				//КтПоставщик = ЭтоПоставщик(СтрК.ДоговорКонтрагента.ВидДоговора);
				КтПоставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрК.ДоговорКонтрагента, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
				Если КтПоставщик Тогда
					
					Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход(); //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Контрагент = КонтрагентКредитор;
					Движение.Договор = СтрК.ДоговорКонтрагента;
					Движение.ДатаРасчетов = Дата;
					//Движение.ДокументВзаиморасчетов = СтрК.Сделка;
					Движение.ДопРегистратор = СтрК.Сделка;
					Движение.ДокументВзаиморасчетов = СтрК.ДокументРасшифровка;
					Движение.СуммаСНДС = СтрК.Сумма;
					Движение.СуммаНДС  = 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 ПолучитьСуммуНДС(СтрК.Сумма, СтрК.СтавкаНДС, Истина, СтрК.НДСВключая);
					Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
					//Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов ); //ДИТ, Беляев СЮ, Ticket#0346935, 29-03-2024, закомментировал лишний код
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
					
					Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
					Движение.Период 		= Дата;
					Движение.Организация 	= Организация;     
					// Евросиб Дубская ( 29.12.2022 Ticket#0291438
					//Движение.Контрагент 	= КонтрагентДебитор;
					Движение.Контрагент 	= КонтрагентКредитор;
					// Евросиб Дубская)
					Движение.Договор 		= СтрК.ДоговорКонтрагента;
					Движение.Сумма 			= СтрК.Сумма;
					Движение.ДопРегистратор = СтрК.Сделка;
					Движение.СчетПоставщика = СтрК.ДокументРасшифровка;
					
					//Евросиб Каблов 18.06.2021 )
					
				Иначе
					//Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьРасход();
					Движение = КопияТаблицыДвижений.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Контрагент = КонтрагентКредитор;
					Движение.Договор = СтрК.ДоговорКонтрагента;
					Движение.ВалютаРасчетов = СтрК.ДоговорКонтрагента.ВалютаВзаиморасчетов;
					Движение.ДатаРасчетов = Дата;
					Движение.ДокументВзаиморасчетов = СтрК.Сделка;
					Движение.СуммаСНДС = СтрК.Сумма;
					Движение.СуммаНДС  = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрК.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрК.СтавкаНДС), Истина, СтрК.НДСВключая);;
					Движение.СуммаБезНДС = Движение.СуммаСНДС - Движение.СуммаНДС;
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
					Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
					//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
					
					// Евросиб Фролов (12.01.2022 Task№ 45208
					ЗаполнитьИзмерениеЭтоВР(Движение);
					// Евросиб Фролов)     
					РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, СтрК);
				КонецЕсли;
			КонецЦикла;
			//Евросиб Каблов 31.12.2020 )
			
			//Евросиб Каблов 08.06.2021 ( 35255
			Движения.ЗаказПоставщику_ПП.Записать();
			Движения.ПривязанныеСчетаПоставщиков.Записать();
			Движения.ВзаиморасчетыСПоставщиками.Записать();
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВзаиморасчетыСПоставщиками.НомерСтроки КАК НомерСтроки,
			|	ВзаиморасчетыСПоставщиками.ВидДвижения КАК ВидДвижения,
			|	ВзаиморасчетыСПоставщиками.Организация КАК Организация,
			|	ВзаиморасчетыСПоставщиками.Контрагент КАК Контрагент,
			|	ВзаиморасчетыСПоставщиками.Договор КАК Договор,
			|	ВзаиморасчетыСПоставщиками.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВзаиморасчетыСПоставщиками.СуммаСНДС КАК СуммаСНДС,
			|	ВзаиморасчетыСПоставщиками.ДопРегистратор КАК ДопРегистратор
			|ПОМЕСТИТЬ ВТДвиженияТекущегоДокумента
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
			|ГДЕ
			|	ВзаиморасчетыСПоставщиками.Регистратор = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТДвиженияТекущегоДокумента.Организация КАК Организация,
			|	ВТДвиженияТекущегоДокумента.Контрагент КАК Контрагент,
			|	ВТДвиженияТекущегоДокумента.Договор КАК Договор,
			|	ВТДвиженияТекущегоДокумента.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВТДвиженияТекущегоДокумента.ДопРегистратор КАК ДопРегистратор
			|ПОМЕСТИТЬ ДокументыБезОстатка
			|ИЗ
			|	ВТДвиженияТекущегоДокумента КАК ВТДвиженияТекущегоДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
			|				&МоментДокумента,
			|				(Договор, ДокументВзаиморасчетов, Контрагент, Организация) В
			|					(ВЫБРАТЬ
			|						ТекДвижения.Договор,
			|						ТекДвижения.ДокументВзаиморасчетов,
			|						ТекДвижения.Контрагент,
			|						ТекДвижения.Организация
			|					ИЗ
			|						ВТДвиженияТекущегоДокумента КАК ТекДвижения)) КАК ВзаиморасчетыСПоставщикамиОстатки
			|		ПО ВТДвиженияТекущегоДокумента.Организация = ВзаиморасчетыСПоставщикамиОстатки.Организация
			|			И ВТДвиженияТекущегоДокумента.Контрагент = ВзаиморасчетыСПоставщикамиОстатки.Контрагент
			|			И ВТДвиженияТекущегоДокумента.Договор = ВзаиморасчетыСПоставщикамиОстатки.Договор
			|			И ВТДвиженияТекущегоДокумента.ДокументВзаиморасчетов = ВзаиморасчетыСПоставщикамиОстатки.ДокументВзаиморасчетов
			|ГДЕ
			|	ЕСТЬNULL(ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток, 0) = 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказПоставщику_ППОстатки.Организация КАК Организация,
			|	ЗаказПоставщику_ППОстатки.Контрагент КАК Контрагент,
			|	ЗаказПоставщику_ППОстатки.Договор КАК Договор,
			|	ЗаказПоставщику_ППОстатки.СчетПоставщика КАК СчетПоставщика,
			|	-ЗаказПоставщику_ППОстатки.СуммаОстаток КАК Сумма,
			|	ДокументыБезОстатка.ДопРегистратор КАК ДопРегистратор
			|ИЗ
			|	РегистрНакопления.ЗаказПоставщику_ПП.Остатки(
			|			&МоментДокумента,
			|			(Организация, Контрагент, Договор, СчетПоставщика) В
			|				(ВЫБРАТЬ
			|					ДокументыБезОстатка.Организация КАК Организация,
			|					ДокументыБезОстатка.Контрагент КАК Контрагент,
			|					ДокументыБезОстатка.Договор КАК Договор,
			|					ДокументыБезОстатка.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов
			|				ИЗ
			|					ДокументыБезОстатка КАК ДокументыБезОстатка)) КАК ЗаказПоставщику_ППОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыБезОстатка КАК ДокументыБезОстатка
			|		ПО ЗаказПоставщику_ППОстатки.Организация = ДокументыБезОстатка.Организация
			|			И ЗаказПоставщику_ППОстатки.Контрагент = ДокументыБезОстатка.Контрагент
			|			И ЗаказПоставщику_ППОстатки.Договор = ДокументыБезОстатка.Договор
			|			И ЗаказПоставщику_ППОстатки.СчетПоставщика = ДокументыБезОстатка.ДокументВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПривязанныеСчетаПоставщиковОстатки.Организация КАК Организация,
			|	ПривязанныеСчетаПоставщиковОстатки.Контрагент КАК Контрагент,
			|	ПривязанныеСчетаПоставщиковОстатки.Договор КАК Договор,
			|	ПривязанныеСчетаПоставщиковОстатки.СчетПоставщика КАК СчетПоставщика,
			|	ПривязанныеСчетаПоставщиковОстатки.СуммаОстаток КАК Сумма,
			|	ДокументыБезОстатка.ДопРегистратор КАК ДопРегистратор
			|ИЗ
			|	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
			|			&МоментДокумента,
			|			(Организация, Контрагент, Договор, СчетПоставщика) В
			|				(ВЫБРАТЬ
			|					ДокументыБезОстатка.Организация КАК Организация,
			|					ДокументыБезОстатка.Контрагент КАК Контрагент,
			|					ДокументыБезОстатка.Договор КАК Договор,
			|					ДокументыБезОстатка.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов
			|				ИЗ
			|					ДокументыБезОстатка КАК ДокументыБезОстатка)) КАК ПривязанныеСчетаПоставщиковОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыБезОстатка КАК ДокументыБезОстатка
			|		ПО ПривязанныеСчетаПоставщиковОстатки.Организация = ДокументыБезОстатка.Организация
			|			И ПривязанныеСчетаПоставщиковОстатки.Контрагент = ДокументыБезОстатка.Контрагент
			|			И ПривязанныеСчетаПоставщиковОстатки.Договор = ДокументыБезОстатка.Договор
			|			И ПривязанныеСчетаПоставщиковОстатки.СчетПоставщика = ДокументыБезОстатка.ДокументВзаиморасчетов";
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая));
			
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			
			ВыборкаЗаказПоставщику = РезультатыЗапроса[2].Выбрать();
			Пока ВыборкаЗаказПоставщику.Следующий() Цикл
				Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
				Движение.Период 		= Дата;
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаЗаказПоставщику);
			КонецЦикла;			
			
			ВыборкаПривязанныеСчета = РезультатыЗапроса[3].Выбрать();
			Пока ВыборкаПривязанныеСчета.Следующий() Цикл				
				Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
				Движение.Период 		= Дата;
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаПривязанныеСчета);				
			КонецЦикла;
			//Евросиб Каблов 08.06.2021 ) 
			
		КонецЕсли; 	
		//Евросиб СубботинВ #103438 24.02.2025 Начало
		////Евросиб СубботинВ #83828 08.08.2024 Начало 
		РасшифровкаДебиторскойЗадолженности = ДокОбъект.РасшифровкаДебиторскойЗадолженности;
		//Если РасшифровкаДебиторскойЗадолженности.Количество() > 0 Тогда
		//	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записывать = Истина;
		//	Для Каждого СтрокаРасшифровки из РасшифровкаДебиторскойЗадолженности Цикл 
		//		ДвиженияРазнесенияПлатежей = Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.ДобавитьРасход();
		//		ДвиженияРазнесенияПлатежей.Период = Дата;
		//		ДвиженияРазнесенияПлатежей.Контрагент = КонтрагентДебитор;
		//		ДвиженияРазнесенияПлатежей.Договор = СтрокаРасшифровки.ДоговорКонтрагента;
		//		ДвиженияРазнесенияПлатежей.СчетПокупателю = СтрокаРасшифровки.ДокументРасшифровки;
		//		ДвиженияРазнесенияПлатежей.НеразнесеннаяСумма = СтрокаРасшифровки.Сумма;
		//	КонецЦикла;
		//Евросиб СубботинВ #103438 24.02.2025 Начало	
			//Евросиб СубботинВ #103438 24.02.2025 Начало
			Если РасшифровкаДебиторскойЗадолженности.Количество() > 0 Тогда 
				СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателейПрочиеКорректировкиКЗ(ДокОбъект, РасшифровкаДебиторскойЗадолженности);
			КонецЕсли;
			//Евросиб СубботинВ #103438 24.02.2025 Конец 
		//Евросиб СубботинВ #103438 24.02.2025 Начало	
		//КонецЕсли;
		//Евросиб СубботинВ #103438 24.02.2025 Конец

		//Евросиб СубботинВ #83828 08.08.2024 Конец  
		
		
	КонецЕсли;
		
КонецПроцедуры

//Процедура РаспределитьСуммуПоВидамЗадолженности(ДвижениеВзаиморасчетов, ДокОбъект, ОстаткиПоДокументамВзаиморасчетов, СтрокаДокумента)
//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, добавлен параметр ТаблицауОстатковПоТабличнымЧастямДокументов
//Процедура РаспределитьСуммуПоВидамЗадолженности(ДвижениеВзаиморасчетов, ДокОбъект, ОстаткиПоДокументамВзаиморасчетов, СтрокаДокумента, ТаблицаОстатковПоТабличнымЧастямДокументов = Неопределено)
//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, добавлен параметр УпорядочиватьПоВидуЗадолженности
Процедура РаспределитьСуммуПоВидамЗадолженности(ДвижениеВзаиморасчетов, ДокОбъект, ОстаткиПоДокументамВзаиморасчетов, СтрокаДокумента, ТаблицаОстатковПоТабличнымЧастямДокументов = Неопределено, УпорядочиватьПоВидуЗадолженности = Истина)
	
		//ОстаткиПоДокументу = ОстаткиПоДокументамВзаиморасчетов.Скопировать(Новый Структура("ДокументВзаиморасчетов", ДвижениеВзаиморасчетов.ДокументВзаиморасчетов));
		//ОстаткиПоДокументу.Сортировать("ВидЗадолженностиПорядок");
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
		//ОстаткиПоДокументамВзаиморасчетов.Сортировать("ВидЗадолженностиПорядок");
		//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
		Если УпорядочиватьПоВидуЗадолженности  Тогда
			ОстаткиПоДокументамВзаиморасчетов.Сортировать("ВидЗадолженностиПорядок");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец
		ОстаткиПоДокументу = ОстаткиПоДокументамВзаиморасчетов.НайтиСтроки(Новый Структура("ДокументВзаиморасчетов", ДвижениеВзаиморасчетов.ДокументВзаиморасчетов));
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
		
		ОстатокСуммыОплаты = ДвижениеВзаиморасчетов.СуммаСНДС;
		Если ОстатокСуммыОплаты < 0  Тогда
			ОстатокСуммыОплаты = -ОстатокСуммыОплаты;
			КоэффициентРасчета = -1;      
		Иначе
			КоэффициентРасчета = 1;
		КонецЕсли;
		Движения = ДокОбъект.Движения;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
		Если ОстаткиПоДокументу.Количество() = 0 И ТаблицаОстатковПоТабличнымЧастямДокументов <> Неопределено Тогда
			ОстаткиПоДокументу = ТаблицаОстатковПоТабличнымЧастямДокументов.НайтиСтроки(Новый Структура("Документ", ДвижениеВзаиморасчетов.ДокументВзаиморасчетов));
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
		Если ОстаткиПоДокументу.Количество() = 0  Тогда
			ОстаткиПоДокументу = ПолучитьТаблицуОстатковПоТабличнойЧастиДокумента(ДвижениеВзаиморасчетов.ДокументВзаиморасчетов);
		КонецЕсли;
		
		Для Каждого СтрокаОстатка Из ОстаткиПоДокументу Цикл
			
			Если ОстатокСуммыОплаты <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
			Если СтрокаОстатка.СуммаСНДСОстаток <= 0 Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
			
			СуммаОплаты = Мин(ОстатокСуммыОплаты, СтрокаОстатка.СуммаСНДСОстаток);
			ОстатокСуммыОплаты = ОстатокСуммыОплаты - СуммаОплаты;
			
			Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ДвижениеВзаиморасчетов,, "Активность");
			Движение.ВидЗадолженности = СтрокаОстатка.ВидЗадолженности;
			Движение.СуммаСНДС = СуммаОплаты * КоэффициентРасчета;
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаДокумента.СтавкаНДС), Истина, Истина);
			Движение.СуммаНДС = СуммаНДС * КоэффициентРасчета;
			Движение.СуммаБезНДС = (СуммаОплаты - СуммаНДС) * КоэффициентРасчета;		
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = ДвижениеВзаиморасчетов.СтавкаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
			СтрокаОстатка.СуммаСНДСОстаток = СтрокаОстатка.СуммаСНДСОстаток - СуммаОплаты;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец
		КонецЦикла;
		
		Если ОстатокСуммыОплаты > 0 Тогда
			
			ОстаткиПоДокументу = ПолучитьТаблицуОстатковПоТабличнойЧастиДокумента(ДвижениеВзаиморасчетов.ДокументВзаиморасчетов);
			ВидЗадолженности = Неопределено;
			Если ОстаткиПоДокументу.Количество() > 0 Тогда
				ВидЗадолженности = ОстаткиПоДокументу[0].ВидЗадолженности;
			КонецЕсли;

			СуммаОплаты = ОстатокСуммыОплаты;
			
			Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ДвижениеВзаиморасчетов,, "Активность");
			Движение.ВидЗадолженности = ВидЗадолженности;
			Движение.СуммаСНДС = СуммаОплаты * КоэффициентРасчета;
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаДокумента.СтавкаНДС), Истина, Истина);
			Движение.СуммаНДС = СуммаНДС * КоэффициентРасчета;
			Движение.СуммаБезНДС = (СуммаОплаты - СуммаНДС) * КоэффициентРасчета;		
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = ДвижениеВзаиморасчетов.СтавкаНДС;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
		КонецЕсли;
	
КонецПроцедуры 
	
//Функция ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект, ДатаОплаты = Неопределено)
//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, добавлен параметр "ОстатокНаТекущийМомент"
Функция ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект, ДатаОплаты = Неопределено, ОстатокНаТекущийМомент = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
	//|	ВзаиморасчетыСПокупателямиОстатки.ЭтоВР КАК ЭтоВР,
	|	ВзаиморасчетыСПокупателямиОстатки.ВидЗадолженности КАК ВидЗадолженности,
	|	ЕСТЬNULL(ВзаиморасчетыСПокупателямиОстатки.ВидЗадолженности.Порядок, 99) КАК ВидЗадолженностиПорядок,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток
	|	КОНЕЦ КАК СуммаБезНДСОстаток,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток
	|	КОНЕЦ КАК СуммаНДСОстаток,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток
	|	КОНЕЦ КАК СуммаСНДСОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|			&Период,
	|			ДокументВзаиморасчетов В (&ДокументыВзаиморасчетов)
	|				И Организация В (&Организация)
	|				И Контрагент В (&Контрагент)
	|				И Договор В (&Договор)) КАК ВзаиморасчетыСПокупателямиОстатки
	//Евросиб(ДИТ), Беляев СЮ, BUG 106982 / TA 106985, 18-04-2025, начало (имеются ошибки закрытия ресурсов СуммаБезНДСОстаток, СуммаНДСОстаток при закрытом СуммаСНДСОстаток - сумма которого нам и нужна для распределения)
	|ГДЕ ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток <> 0
	//Евросиб(ДИТ), Беляев СЮ, BUG 106982 / TA 106985, 18-04-2025, конец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидЗадолженностиПорядок";

	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаДолга") Тогда
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ДокОбъект.КонтрагентДебитор);
		МассивКонтрагентов.Добавить(ДокОбъект.КонтрагентКредитор); 
		
		МассивДоговоров = ДокОбъект.ДебиторскаяЗадолженность.ВыгрузитьКолонку("ДоговорКонтрагента");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДоговоров, ДокОбъект.КредиторскаяЗадолженность.ВыгрузитьКолонку("ДоговорКонтрагента"), Истина);
		
		
		МассивДокументовВзаиморасчетов = ДокОбъект.ДебиторскаяЗадолженность.ВыгрузитьКолонку("Сделка");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДокументовВзаиморасчетов, ДокОбъект.КредиторскаяЗадолженность.ВыгрузитьКолонку("Сделка"), Истина);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда	
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ДокОбъект.Контрагент);
		
		МассивДоговоров = ДокОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ДоговорКонтрагента");
		
		МассивДокументовВзаиморасчетов = ДокОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("Сделка"); 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет")  Тогда
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ДокОбъект.Контрагент);
		
		МассивДоговоров = ДокОбъект.ДоговорКонтрагента;
		
		МассивДокументовВзаиморасчетов = ДокОбъект.ДокументыОплаты.ВыгрузитьКолонку("ДокументРеализации"); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументыВзаиморасчетов", МассивДокументовВзаиморасчетов);
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Контрагент", МассивКонтрагентов);
	Запрос.УстановитьПараметр("Договор", МассивДоговоров);
	//Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Период", Новый Граница(?(ДатаОплаты = Неопределено, ДокОбъект.Дата, ДатаОплаты), ВидГраницы.Включая));
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
	Если ОстатокНаТекущийМомент = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период", "");
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
		
	ОстаткиПоДокументамВзаиморасчетов = Запрос.Выполнить().Выгрузить();
	Возврат ОстаткиПоДокументамВзаиморасчетов;
		
КонецФункции

Функция ПолучитьТаблицуОстатковПоТабличнойЧастиДокумента(ДокументВзаиморасчетов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДСОстаток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДСОстаток,
	|	РеализацияТоваровУслугУслуги.Сумма КАК СуммаБезНДСОстаток,
	|	РеализацияТоваровУслугУслуги.Ссылка КАК ДокументВзаиморасчетов,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности КАК ВидЗадолженности,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности.Порядок КАК ВидЗадолженностиПорядок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.Сумма,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДокументРеализации,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности.Порядок
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидЗадолженностиПорядок";
	Запрос.УстановитьПараметр("Ссылка", ДокументВзаиморасчетов);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаРезультата;
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, начало
Функция ПолучитьТаблицуОстатковПоТабличнойЧастиДокументов(МассивДокументов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Документ,
	|	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДСОстаток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДСОстаток,
	|	РеализацияТоваровУслугУслуги.Сумма КАК СуммаБезНДСОстаток,
	|	РеализацияТоваровУслугУслуги.Ссылка КАК ДокументВзаиморасчетов,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности КАК ВидЗадолженности,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности.Порядок КАК ВидЗадолженностиПорядок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.Сумма,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДокументРеализации,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности,
	|	РеализацияТоваровУслугУслуги.ВидЗадолженности.Порядок
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидЗадолженностиПорядок";
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаРезультата;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, Ticket#0382613, 16-01-2025, конец


// Евросиб Фролов (12.01.2022 Task№ 45208
Процедура ЗаполнитьИзмерениеЭтоВР(Движение)
	Если ТипЗнч(Движение.ДокументВзаиморасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЭтоВР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.ДокументВзаиморасчетов, "ЭтоКомиссия");
		Движение.ЭтоВР = ЭтоВР;
	КонецЕсли;
КонецПроцедуры
// Евросиб Фролов)  

Процедура СписаниеСРасчетногоСчета_СформированитьДвиженияВзаиморасчетыСПокупателями(ДокОбъект) Экспорт
	
	Движения = ДокОбъект.Движения;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0372604, 25-10-2024, начало
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	Движения.ВзаиморасчетыСПокупателями.Записать();
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0372604, 25-10-2024, конец
	
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	ДвиженияДС = Движения.ДвиженияДенежныхСредств;
	ДвиженияДС.Записывать = Истина;
	
	ВидОперации 		= ДокОбъект.ВидОперации;
	РасшифровкаПлатежа 	= ДокОбъект.РасшифровкаПлатежа;
	Дата 				= ДокОбъект.Дата;
	Организация 		= ДокОбъект.Организация;
	Контрагент 			= ДокОбъект.Контрагент;
	ДоговорКонтрагента 	= ДокОбъект.ДоговорКонтрагента;
	ВалютаДокумента 	= ДокОбъект.ВалютаДокумента;
	СчетОрганизации 	= ДокОбъект.СчетОрганизации;
	Ссылка 				= ДокОбъект.Ссылка;
	СуммаНДСДокумента	= ДокОбъект.СуммаНДСДокумента;
	СуммаДокумента		= ДокОбъект.СуммаДокумента;
	
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Дата);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);

	КопияТаблицыДвижений = Движения.ВзаиморасчетыСПокупателями.Выгрузить();
	КопияТаблицыДвижений.Очистить(); 
	ТаблицаОстатковВзаиморасчетов = ПолучитьТаблицуОстатковВзаиморасчетов(ДокОбъект);

	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
		Если РасшифровкаПлатежа.Количество() > 0 Тогда
			Для Каждого СтрокаТЧ Из РасшифровкаПлатежа Цикл
				//Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьРасход();
				Движение = КопияТаблицыДвижений.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Контрагент = Контрагент;
				Движение.Договор = ДоговорКонтрагента;
				Движение.ДокументВзаиморасчетов = СтрокаТЧ.Сделка;
				Движение.ВалютаРасчетов = ВалютаДокумента;
				Движение.ДатаРасчетов = Дата;
				Движение.СуммаНДС = СтрокаТЧ.СуммаНДС;
				Движение.СуммаСНДС = СтрокаТЧ.СуммаВзаиморасчетов;
				Движение.СуммаБезНДС = СтрокаТЧ.СуммаВзаиморасчетов - СтрокаТЧ.СуммаНДС;
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
				Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
				//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
				РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, СтрокаТЧ);
				
				//Евросиб Каблов М.Б. 19.11.2019 (
				//Движения денежных средств
				Движение = ДвиженияДС.Добавить();		
				//Измерения
				Движение.Период = Дата;
				Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
				Движение.Организация = Организация;
				Движение.БанковскийСчет = СчетОрганизации;
				Движение.СтатьяДвиженияДенежныхСредств = СтрокаТЧ.СтатьяДвиженияДенежныхСредств;
				Движение.Контрагент = Контрагент;
				Движение.ДоговорКонтрагента = ДоговорКонтрагента;
				Движение.ДокументДвижения = Ссылка;				
				//Ресурсы
				Движение.СуммаВал = СтрокаТЧ.СуммаВзаиморасчетов;
				Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаВзаиморасчетов, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			КонецЦикла;
		Иначе
			Движение = КопияТаблицыДвижений.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Договор = ДоговорКонтрагента;
			Движение.ВалютаРасчетов = ВалютаДокумента;
			Движение.ДатаРасчетов = Дата;
			Движение.СуммаНДС = СуммаНДСДокумента;
			Движение.СуммаСНДС = СуммаДокумента;
			Движение.СуммаБезНДС = СуммаДокумента - СуммаНДСДокумента;
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
			Движение.СтавкаНДС = ПолучитьСтавкуНДСдляДокумента( Движение.ДокументВзаиморасчетов );
			//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец
			РаспределитьСуммуПоВидамЗадолженности(Движение, ДокОбъект, ТаблицаОстатковВзаиморасчетов, ДокОбъект);
			
			//Евросиб Каблов М.Б. 19.11.2019 (
			//Движения денежных средств
			Движение = ДвиженияДС.Добавить();		
			//Измерения
			Движение.Период = Дата;
			Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
			Движение.Организация = Организация;
			Движение.БанковскийСчет = СчетОрганизации;
			Движение.Контрагент = Контрагент;
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.ДокументДвижения = Ссылка;				
			//Ресурсы
			Движение.СуммаВал = СуммаДокумента;
			Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаДокумента, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		КонецЕсли;
		//Евросиб Каблов М.Б. 23.11.2020 
		
	КонецЕсли;

	
КонецПроцедуры

Функция ЗагрузкаИСФИзРИТМа_ПолучитьВидЗадолженности(ИСФ) Экспорт
	Если ИСФ.ЦФО = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
		Возврат Перечисления.ВидыЗадолженности.ОсновнойДолг;
	Иначе
		Возврат Перечисления.ВидыЗадолженности.УслугиВнеСтавки;
	КонецЕсли;
КонецФункции

Функция ПолучитьТаблицуИтогов(ДокОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидЗадолженности КАК ВидЗадолженности,
	|	СУММА(ВложенныйЗапрос.УслугиСумма) КАК УслугиСумма,
	|	СУММА(ВложенныйЗапрос.УслугиСуммаНДС) КАК УслугиСуммаНДС,
	|	СУММА(ВложенныйЗапрос.УслугиСуммаДоИзменения) КАК УслугиСуммаДоИзменения,
	|	СУММА(ВложенныйЗапрос.УслугиСуммаНДСДоИзменения) КАК УслугиСуммаНДСДоИзменения,
	|	СУММА(ВложенныйЗапрос.УслугиСуммаДоКорректировки) КАК УслугиСуммаДоКорректировки,
	|	СУММА(ВложенныйЗапрос.УслугиСуммаНДСДоКорректировки) КАК УслугиСуммаНДСДоКорректировки,
	|	СУММА(ВложенныйЗапрос.УслугиВсегоДоКорректировки) КАК УслугиВсегоДоКорректировки,
	|	СУММА(ВложенныйЗапрос.УслугиВсегоДоИзменения) КАК УслугиВсегоДоИзменения,
	|	СУММА(ВложенныйЗапрос.УслугиВсего) КАК УслугиВсего,
	|	СУММА(ВложенныйЗапрос.ТоварыСумма) КАК ТоварыСумма,
	|	СУММА(ВложенныйЗапрос.ТоварыСуммаНДС) КАК ТоварыСуммаНДС,
	|	СУММА(ВложенныйЗапрос.ТоварыСуммаДоИзменения) КАК ТоварыСуммаДоИзменения,
	|	СУММА(ВложенныйЗапрос.ТоварыСуммаНДСДоИзменения) КАК ТоварыСуммаНДСДоИзменения,
	|	СУММА(ВложенныйЗапрос.ТоварыСуммаДоКорректировки) КАК ТоварыСуммаДоКорректировки,
	|	СУММА(ВложенныйЗапрос.ТоварыСуммаНДСДоКорректировки) КАК ТоварыСуммаНДСДоКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.ВидЗадолженности КАК ВидЗадолженности,
	|		СУММА(КорректировкаРеализацииУслуги.Сумма) КАК УслугиСумма,
	|		СУММА(КорректировкаРеализацииУслуги.СуммаНДС) КАК УслугиСуммаНДС,
	|		СУММА(КорректировкаРеализацииУслуги.СуммаДоИзменения) КАК УслугиСуммаДоИзменения,
	|		СУММА(КорректировкаРеализацииУслуги.СуммаНДСДоИзменения) КАК УслугиСуммаНДСДоИзменения,
	|		СУММА(КорректировкаРеализацииУслуги.СуммаДоКорректировки) КАК УслугиСуммаДоКорректировки,
	|		СУММА(КорректировкаРеализацииУслуги.СуммаНДСДоКорректировки) КАК УслугиСуммаНДСДоКорректировки,
	|		СУММА(КорректировкаРеализацииУслуги.ВсегоДоКорректировки) КАК УслугиВсегоДоКорректировки,
	|		СУММА(КорректировкаРеализацииУслуги.ВсегоДоИзменения) КАК УслугиВсегоДоИзменения,
	|		СУММА(КорректировкаРеализацииУслуги.Всего) КАК УслугиВсего,
	|		0 КАК ТоварыСумма,
	|		0 КАК ТоварыСуммаНДС,
	|		0 КАК ТоварыСуммаДоИзменения,
	|		0 КАК ТоварыСуммаНДСДоИзменения,
	|		0 КАК ТоварыСуммаДоКорректировки,
	|		0 КАК ТоварыСуммаНДСДоКорректировки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КорректировкаРеализацииУслуги.ВидЗадолженности
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ВидыЗадолженности.Ссылка,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СУММА(КорректировкаРеализацииТовары.Сумма),
	|		СУММА(КорректировкаРеализацииТовары.СуммаНДС),
	|		СУММА(КорректировкаРеализацииТовары.СуммаДоИзменения),
	|		СУММА(КорректировкаРеализацииТовары.СуммаНДСДоИзменения),
	|		СУММА(КорректировкаРеализацииТовары.СуммаДоКорректировки),
	|		СУММА(КорректировкаРеализацииТовары.СуммаНДСДоКорректировки)
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ВидыЗадолженности КАК ВидыЗадолженности
	|			ПО (ВидыЗадолженности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг))
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВидыЗадолженности.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВидЗадолженности";
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьТаблицуПоТекущимДвижениям(ДвиженияВзаиморасчетов, ДокументВзаиморасчетов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	Выразить(ВзаиморасчетыСПокупателямиОстатки.ВидЗадолженности КАК Перечисление.ВидыЗадолженности) КАК ВидЗадолженности,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДС < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДС
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДС
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаНДС < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаНДС
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаСНДС < 0
	|			ТОГДА -ВзаиморасчетыСПокупателямиОстатки.СуммаСНДС
	|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстатки.СуммаСНДС
	|	КОНЕЦ КАК СуммаСНДС
	|ПОМЕСТИТЬ ВТ_ТаблицаВзаиморасчетов
	|ИЗ
	|	&ТаблицаДвижений КАК ВзаиморасчетыСПокупателямиОстатки
	|ГДЕ
	|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов = &ДокументВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВзаиморасчетов.Организация КАК Организация,
	|	ВТ_ТаблицаВзаиморасчетов.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаВзаиморасчетов.Договор КАК Договор,
	|	ВТ_ТаблицаВзаиморасчетов.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ВТ_ТаблицаВзаиморасчетов.ВидЗадолженности КАК ВидЗадолженности,
	|	ЕСТЬNULL(ВТ_ТаблицаВзаиморасчетов.ВидЗадолженности.Порядок, 99) КАК ВидЗадолженностиПорядок,
	|	ВТ_ТаблицаВзаиморасчетов.СуммаБезНДС КАК СуммаБезНДСОстаток,
	|	ВТ_ТаблицаВзаиморасчетов.СуммаНДС КАК СуммаНДСОстаток,
	|	ВТ_ТаблицаВзаиморасчетов.СуммаСНДС КАК СуммаСНДСОстаток
	|ИЗ
	|	ВТ_ТаблицаВзаиморасчетов КАК ВТ_ТаблицаВзаиморасчетов";
	Запрос.УстановитьПараметр("ТаблицаДвижений", ДвиженияВзаиморасчетов.Выгрузить());
	Запрос.УстановитьПараметр("ДокументВзаиморасчетов", ДокументВзаиморасчетов);
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, начало
	Если ДокументВзаиморасчетов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов = &ДокументВзаиморасчетов", "ИСТИНА");
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 104683 / TA 104685, 18-03-2025, конец
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

//Евросиб Каблов 29.11.2023 #75365 Перенести в модуль ВзаиморасчетыСервер
Процедура СформироватьДвиженияРазнесениеВходящихПлатежейПоСчетамПокупателей(ДокОбъект) Экспорт
	
	НаборЗаписей = ДокОбъект.Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей;
	НаборЗаписей.Записывать = Истина;
	
	Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
		
		// приход
		Для каждого Стр из ДокОбъект.РасшифровкаПлатежа Цикл
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ДокОбъект.ДатаВзаиморасчетов;
			Запись.Контрагент = ДокОбъект.Контрагент;
			Запись.Договор = Стр.ДоговорКонтрагента;
			Запись.Поступление = ДокОбъект.Ссылка;
			Запись.Валюта = ДокОбъект.ВалютаДокумента;
			Запись.КурсВзаиморасчетов = Стр.КурсВзаиморасчетов;
			//Запись.ДокументРазнесения = ДокОбъект.Ссылка;
			Запись.Сумма = Стр.СуммаВзаиморасчетов;
		КонецЦикла;
		
		// расходы
		Если ЗначениеЗаполнено(ДокОбъект.РасшифровкаПлатежа) Тогда
			КурсВзаиморасчетов = ДокОбъект.РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		Иначе
			КурсВзаиморасчетов = 1;
		КонецЕсли;
		
		Для Каждого СтрокаРазнесения из ДокОбъект.РазнесениеНаСчетаПокупателям Цикл
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ДокОбъект.ДатаВзаиморасчетов;
			Запись.Контрагент = ДокОбъект.Контрагент;
			Запись.Договор = ДокОбъект.ДоговорКонтрагента;
			Запись.Поступление = ДокОбъект.Ссылка;
			Запись.ДокументРазнесения = СтрокаРазнесения.СчетПокупателю;
			Запись.Валюта = ДокОбъект.ВалютаДокумента;
			Запись.КурсВзаиморасчетов = КурсВзаиморасчетов;
			Запись.Сумма = СтрокаРазнесения.РазнесеннаяСумма;
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, начало
Функция ПолучитьСтавкуНДСдляДокумента( Ссылка ) Экспорт
	Результат = Неопределено;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//берем ставку НДС из первой строки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслугУслуги.НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Результат = ВыборкаДетальныеЗаписи.СтавкаНДС;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		//берем ставку НДС из первой строки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КорректировкаРеализацииУслуги.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
		|ГДЕ
		|	КорректировкаРеализацииУслуги.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КорректировкаРеализацииУслуги.НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Результат = ВыборкаДетальныеЗаписи.СтавкаНДС;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		//берем ставку НДС из первой строки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КорректировкаДолгаКредиторскаяЗадолженность.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
		|ГДЕ
		|	КорректировкаДолгаКредиторскаяЗадолженность.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КорректировкаДолгаКредиторскаяЗадолженность.НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Результат = ВыборкаДетальныеЗаписи.СтавкаНДС;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтавкаНДС");
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтавкаНДСВознаграждения");
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтавкаНДС");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//ДИТ, Беляев СЮ, US 80923/TA 81611, 06-03-2024, конец  

//Евросиб СубботинВ #103438 24.02.2025 Начало 
Процедура СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателей(ДокОбъект, ТабличнаяЧастьДокумента);
	
	Движения = ДокОбъект.Движения;
	ТаблицаВзаиморасчетов = ТабличнаяЧастьДокумента.Выгрузить(,"Сделка");
	ТаблицаВзаиморасчетов.Свернуть("Сделка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документы.Сделка КАК Сделка
		|ПОМЕСТИТЬ Вт_Документы
		|ИЗ
		|	&Документы КАК Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Контрагент КАК Контрагент,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Договор КАК Договор,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Поступление КАК Поступление,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Валюта КАК Валюта,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РазнесениеВходящихПлатежейПоСчетамПокупателей.Остатки(
		|			,
		|			Поступление В
		|				(ВЫБРАТЬ
		|					Вт_Документы.Сделка КАК Сделка
		|				ИЗ
		|					Вт_Документы КАК Вт_Документы)) КАК РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки";
		
		Запрос.УстановитьПараметр("Документы", ТаблицаВзаиморасчетов);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат
		Иначе 
			Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записывать = Истина;
			Пока ВыборкаРезультатЗапроса.Следующий() Цикл
				
				СтруктураПоиска = Новый Структура("Сделка", ВыборкаРезультатЗапроса.Поступление);
				СтрокиПоТекущемуСчету = ТабличнаяЧастьДокумента.НайтиСтроки(СтруктураПоиска);
				Если СтрокиПоТекущемуСчету.Количество() <> 0 Тогда				
					Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьРасход();
					Движение.Период = ?(ЗначениеЗаполнено(СтрокиПоТекущемуСчету[0].ДатаВзаиморасчетов), СтрокиПоТекущемуСчету[0].ДатаВзаиморасчетов, ДокОбъект.Дата);
					Движение.Контрагент = ВыборкаРезультатЗапроса.Контрагент;
					Движение.Договор = ВыборкаРезультатЗапроса.Договор;
					Движение.Поступление = ВыборкаРезультатЗапроса.Поступление;
					Движение.Валюта = ВыборкаРезультатЗапроса.Валюта;
					Движение.КурсВзаиморасчетов = ВыборкаРезультатЗапроса.КурсВзаиморасчетов;
					//Запись.ДокументРазнесения = ДокОбъект.Ссылка;
					Движение.Сумма = МИН(СтрокиПоТекущемуСчету[0].Сумма, ВыборкаРезультатЗапроса.СуммаОстаток);					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
КонецПроцедуры	

Процедура СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателейПоПереносуЗадолженностиАвансаПокупателя(ДокОбъект);
	
	Движения = ДокОбъект.Движения;
	ТаблицаДокументов = ДокОбъект.КредиторскаяЗадолженность.Выгрузить(,"Сделка");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Сделка КАК Сделка
	|ПОМЕСТИТЬ Вт_Документы
	|ИЗ
	|	&Документы КАК Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Поступление КАК Поступление,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Валюта КАК Валюта,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.КурсВзаиморасчетов КАК КурсВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.РазнесениеВходящихПлатежейПоСчетамПокупателей.Остатки(
	|			,
	|			Поступление В
	|				(ВЫБРАТЬ
	|					Вт_Документы.Сделка КАК Сделка
	|				ИЗ
	|					Вт_Документы КАК Вт_Документы)) КАК РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки";
	
	Запрос.УстановитьПараметр("Документы", ТаблицаДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выгрузить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 
	Иначе
		Для Каждого Стр из ДокОбъект.КредиторскаяЗадолженность Цикл
			Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда 
				Отбор = Новый Структура("Поступление",Стр.Сделка);
				ОстаткиПоДокументу = ВыборкаРезультатЗапроса.НайтиСтроки(Отбор);
				Если ОстаткиПоДокументу.Количество() > 0 Тогда
					СуммаСписания = МИН(ОстаткиПоДокументу[0].СуммаОстаток, Стр.Сумма);
					ВалютаПрихода = Стр.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
					
					Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записывать = Истина;
					
					ДатаВзаиморасчетов = ?(ЗначениеЗаполнено(Стр.ДатаВзаиморасчетов), Стр.ДатаВзаиморасчетов, НачалоДня(ДокОбъект.Дата));
					ВалютаРасхода = ОстаткиПоДокументу[0].Валюта;
					КурсОстатков = ОстаткиПоДокументу[0].КурсВзаиморасчетов;
					
					Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьРасход();
					Движение.Период = ДатаВзаиморасчетов;
					//Движение.Контрагент = ДокОбъект.КонтрагентКредитор;
					Движение.Контрагент = ДокОбъект.КонтрагентДебитор;
					Движение.Договор = Стр.ДоговорКонтрагента;
					Движение.Поступление = Стр.Сделка;
					Движение.Валюта = ВалютаРасхода;
					Движение.КурсВзаиморасчетов = КурсОстатков;
					//Запись.ДокументРазнесения = ДокОбъект.Ссылка;	
					Движение.Сумма = СуммаСписания;						
					
					СтруктураНовогоКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаПрихода, ДатаВзаиморасчетов);
					
					Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьПриход();
					Движение.Период = ДатаВзаиморасчетов;
					//Движение.Контрагент = ДокОбъект.КонтрагентДебитор;
					Движение.Контрагент = ДокОбъект.КонтрагентКредитор;
					Движение.Договор = Стр.КорДоговорКонтрагента ;
					Движение.Поступление = ДокОбъект.Ссылка;
					Движение.Валюта = ВалютаПрихода;
					Движение.КурсВзаиморасчетов = Стр.КурсВзаиморасчетов;
					//Запись.ДокументРазнесения = ДокОбъект.Ссылка;
					//Движение.Сумма = Стр.Сумма; 
					Движение.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаСписания, ВалютаРасхода,ВалютаПрихода, ДатаВзаиморасчетов); 
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 	
			
КонецПроцедуры	

Процедура СформироватьДвиженияВРегистреРазнесениеВходящихПлатежейПоСчетамПокупателейПрочиеКорректировкиКЗ(ДокОбъект, РасшифровкаДебиторскойЗадолженности);
	
	Движения = ДокОбъект.Движения;
	Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записывать = Истина;
	
	ТЗКЗ = ДокОбъект.КредиторскаяЗадолженность.Выгрузить(,"Сделка");
	ТЗКЗ.Свернуть("Сделка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документы.Сделка КАК Сделка
		|ПОМЕСТИТЬ Вт_Документы
		|ИЗ
		|	&Документы КАК Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Поступление КАК Поступление,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Валюта КАК Валюта,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.Договор КАК ДоговорКонтрагента,
		|	РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки.КурсВзаиморасчетов КАК КурсВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.РазнесениеВходящихПлатежейПоСчетамПокупателей.Остатки(
		|			,
		|			Поступление В
		|				(ВЫБРАТЬ
		|					Вт_Документы.Сделка КАК Сделка
		|				ИЗ
		|					Вт_Документы КАК Вт_Документы)) КАК РазнесениеВходящихПлатежейПоСчетамПокупателейОстатки";
	
	Запрос.УстановитьПараметр("Документы", ТЗКЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	Иначе 
		
		ТаблицаРасшифровки = РасшифровкаДебиторскойЗадолженности.Выгрузить();
		
		Пока ВыборкаРезультатЗапроса.Следующий() Цикл
			
			Если ВыборкаРезультатЗапроса.СуммаОстаток <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаОстаткаДляСписания = ВыборкаРезультатЗапроса.СуммаОстаток;
			Для Каждого СтрокаРасшифровки из ТаблицаРасшифровки Цикл
				
				Если СтрокаРасшифровки.Сумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаРасчетов = ?(ЗначениеЗаполнено(СтрокаРасшифровки.ДатаРасчетов), СтрокаРасшифровки.ДатаРасчетов, НачалоДня(ДокОбъект.Дата));
				
				Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьРасход();
				Движение.Период = ДатаРасчетов;
				Движение.Контрагент = ДокОбъект.КонтрагентКредитор;
				Движение.Договор = ВыборкаРезультатЗапроса.ДоговорКонтрагента;
				Движение.Поступление = ВыборкаРезультатЗапроса.Поступление;
				Движение.Валюта = ВыборкаРезультатЗапроса.Валюта;
				Движение.КурсВзаиморасчетов = ВыборкаРезультатЗапроса.КурсВзаиморасчетов;
				Движение.ДокументРазнесения = СтрокаРасшифровки.ДокументРасшифровки; 
				СуммаДвижения = МИН(СтрокаРасшифровки.Сумма, СуммаОстаткаДляСписания);
				СуммаДляСписания = СуммаОстаткаДляСписания - СуммаДвижения;
				СтрокаРасшифровки.Сумма = СтрокаРасшифровки.Сумма - СуммаДвижения;
				Движение.Сумма = СуммаДвижения;
				Если СуммаДляСписания = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоРазнесениюВходящихПлатежейПоСчетамПокупателей(Движения, Дата, ВидОперации, СтрокиРасшифровки,
		  ДоговорСписания, КонтрагентСписания, ДоговорПереноса = Неопределено, КонтрагентПереноса = Неопределено)
	
	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда		
		
		Для Каждого СтрокаРасшифровки из СтрокиРасшифровки Цикл 
			ДвиженияРазнесенияПлатежейРасход = Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.ДобавитьРасход();
			ДвиженияРазнесенияПлатежейРасход.Период = Дата;
			ДвиженияРазнесенияПлатежейРасход.Контрагент = КонтрагентСписания;
			ДвиженияРазнесенияПлатежейРасход.Договор = СтрокаРасшифровки.ДоговорКонтрагента;
			ДвиженияРазнесенияПлатежейРасход.СчетПокупателю = СтрокаРасшифровки.ДокументРасшифровки;
			ДвиженияРазнесенияПлатежейРасход.НеразнесеннаяСумма = СтрокаРасшифровки.Сумма;
			
			Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
				ДвиженияРазнесенияПлатежейПриход = Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(ДвиженияРазнесенияПлатежейПриход,ДвиженияРазнесенияПлатежейРасход,,"Контрагент, Договор, ВидДвижения");
				ДвиженияРазнесенияПлатежейПриход.Контрагент = КонтрагентПереноса;
				ДвиженияРазнесенияПлатежейПриход.Договор = ДоговорПереноса;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

//Евросиб СубботинВ #103438 24.02.2025 Конец 
