
#Область ОбработчикиСобытийФормы

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные = СправочникОбъект.ХранилищеМакета.Получить();
	
	Если ДвоичныеДанные <> Неопределено Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	
	ОбновитьИнформациюОМакете();
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресВХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ХранилищеМакета = Новый ХранилищеЗначения(ДвоичныеДанные);
		ТекущийОбъект.ХранилищеМакета = ХранилищеМакета;
	Иначе
		ТекущийОбъект.ХранилищеМакета = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

#КонецОбласти

#Область ОбработчикиКомандФормы

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаКлиенте
Процедура КомандаДобавитьМакет(Команда)
	
	Если ЗначениеЗаполнено(АдресВХранилище) Тогда
		ТекстВопроса = НСтр("ru = 'Макет будет перезаписан. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ДобавитьМакетПродолжить", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ДобавитьМакетПродолжить(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаКлиенте
Процедура КомандаОткрытьМакет(Команда)
	
	Если ЗначениеЗаполнено(АдресВХранилище) Тогда
		ТабличныйДокумент = ПрочитатьMXLНаСервере();
		ТабличныйДокумент.Показать("");
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаКлиенте
Процедура КомандаОчиститьМакет(Команда)
	
	Если ЗначениеЗаполнено(АдресВХранилище) Тогда
		ТекстВопроса = НСтр("ru = 'Макет будет очищен. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьМакетПродолжить", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Функция ПрочитатьMXLНаСервере()
	
	ТабДок  = Новый ТабличныйДокумент;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТабДок.Прочитать(
		ДвоичныеДанные.ОткрытьПотокДляЧтения(),
		СпособЧтенияЗначенийТабличногоДокумента.Текст,
		ТипФайлаТабличногоДокумента.MXL);
		
	Возврат ТабДок;
	
КонецФункции // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаКлиенте
Процедура ДобавитьМакетПродолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл макета";
		Диалог.ПолноеИмяФайла = "";
		Фильтр = НСтр("ru = 'Табличный документ(*.mxl*)|*.mxl'");
		Диалог.Фильтр = Фильтр;
		Диалог.МножественныйВыбор = Ложь;
		Если Диалог.Выбрать() Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
			ДобавитьМакетНаСервере(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Процедура ДобавитьМакетНаСервере(ДвоичныеДанные)
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	ОбновитьИнформациюОМакете();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаКлиенте
Процедура ОчиститьМакетПродолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьМакетНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Процедура ОчиститьМакетНаСервере()
	
	АдресВХранилище = "";
	
	ОбновитьИнформациюОМакете();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
&НаСервере
Процедура ОбновитьИнформациюОМакете()
	
	Если Не ЗначениеЗаполнено(АдресВХранилище) Тогда
		ТекстИнформации = НСтр("ru = 'Макет не загружен'");
	Иначе
		ТекстИнформации = НСтр("ru = 'Макет загружен'");
	КонецЕсли;
	
	ИнформацияОМакете = ТекстИнформации;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

#КонецОбласти
