#Область ПрограммныйИнтерфейс

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
       Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//ПараметрыЗапроса.Вставить("Валюта", РеквизитыДоговора.ВалютаВзаиморасчетов);
	ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
	ПараметрыЗапроса.Вставить("ВидУслугПоставщика", Объект.ВидУслугПоставщика);
	ПараметрыЗапроса.Вставить("КатегорияУслуг", Объект.КатегорияУслуг);

	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПолучитьОчереднойНомерДокумента(ДатаПСЦ, ВидУслуг, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Ссылка) КАК ПорядковыйНомер
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков
	|ГДЕ
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Ссылка <> &Ссылка
	|	И ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ДатаПСЦ МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ВидУслугПоставщика = &ВидУслугПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыУслугПоставщиков.ПрефиксПротоколовНормативныхСтавок КАК Префикс
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков КАК ВидыУслугПоставщиков
	|ГДЕ
	|	ВидыУслугПоставщиков.Ссылка = &ВидУслугПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерПСЦ КАК НомерПСЦ
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ДатаПСЦ МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТаблицаДокумента.Ссылка <> &Ссылка
	|	И ТаблицаДокумента.ВидУслугПоставщика = &ВидУслугПоставщика";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ДатаПСЦ));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(ДатаПСЦ));
	Запрос.УстановитьПараметр("ВидУслугПоставщика", ВидУслуг);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[0].Выбрать();
	ВыборкаПоВидуУслуг = Результаты[1].Выбрать();
	ТаблицаЗанятыхНомеров = Результаты[2].Выгрузить();
	
	Если ВыборкаПоВидуУслуг.Следующий() Тогда
		Префикс = ВыборкаПоВидуУслуг.Префикс;
	КонецЕсли;	
	
	Если Выборка.Следующий() Тогда 
		ПорядковыйНомер = Выборка.ПорядковыйНомер + 1;
	Иначе
		ПорядковыйНомер = 1;
	КонецЕсли;
	
	Пока Истина Цикл
		
		Если ПорядковыйНомер <= 99 Тогда
			ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧЦ=2; ЧН=00; ЧВН=");
		Иначе
			ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧГ=0");
		КонецЕсли;
		
		ГодСтрокой = Формат(ДатаПСЦ, "ДФ=yy");
		НовыйНомерДокумента = СтрШаблон("%1%2-%3", Префикс, ГодСтрокой, ПорядковыйНомерСтрокой);
		
		СтрокаЗанятогоНомера = ТаблицаЗанятыхНомеров.Найти(НовыйНомерДокумента, "НомерПСЦ");
		Если СтрокаЗанятогоНомера = Неопределено Тогда
			Прервать;
		Иначе
			ПорядковыйНомер = ПорядковыйНомер + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НовыйНомерДокумента;
	
КонецФункции

Функция ПроверитьУникальностьНомераДокумента(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.НомерПСЦ = &НомерПСЦ
		|	И ТаблицаДокумента.ДатаПСЦ МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаблицаДокумента.Ссылка <> &Ссылка
		|	И ТаблицаДокумента.ВидУслугПоставщика = &ВидУслугПоставщика";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(Объект.ДатаПСЦ));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(Объект.ДатаПСЦ));
	Запрос.УстановитьПараметр("НомерПСЦ", Объект.НомерПСЦ);
	Запрос.УстановитьПараметр("ВидУслугПоставщика", Объект.ВидУслугПоставщика);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		НомерУникален = Истина;
	Иначе
		НомерУникален = Ложь;
	КонецЕсли;
	
	Возврат НомерУникален;
	
КонецФункции

#КонецОбласти

