
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	АдресПустаяСсылка = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
	
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(НомерПСЦ) Тогда
		НомерПСЦ = Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПолучитьОчереднойНомерДокумента(ДатаПСЦ, ВидУслугПоставщика, Ссылка);
	КонецЕсли;
	
	Для Каждого Стр Из Услуги Цикл
		//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
			Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			Стр.ДляГруженых = Ложь;
			Стр.ДляПорожних = Ложь;
			Если Стр.Номенклатура = Справочники.Номенклатура.АвтоперевозкаГруженыйКонтейнер Тогда
				Стр.ДляГруженых = Истина;
			КонецЕсли;
			
			Если Стр.Номенклатура = Справочники.Номенклатура.АвтоперевозкаПорожнийКонтейнер Тогда
				Стр.ДляПорожних = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025	
		//Приоритет локаций при выборе. Возможность выбора мультилокаций после очисти поля.
		Если Не ЗначениеЗаполнено(Стр.ПунктОтправления) Тогда
			Стр.ПунктОтправления = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ПунктНазначения) Тогда
			Стр.ПунктНазначения = ЛокацияПустаяСсылка;
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Стр.ПунктПогрузкиВыгрузки) Тогда
			Стр.ПунктПогрузкиВыгрузки = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ПунктОтправленияГород) Тогда
			Стр.ПунктОтправленияГород = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ПунктНазначенияГород) Тогда
			Стр.ПунктНазначенияГород = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ПунктОтправленияСтрана) Тогда
			Стр.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ПунктНазначенияСтрана) Тогда
			Стр.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.АдресСкладаПогрузкиВыгрузки) Тогда
			Стр.АдресСкладаПогрузкиВыгрузки = АдресПустаяСсылка;
		КонецЕсли;
		
	КонецЦикла;
	
	СоздатьКлючиАналитикиСтрокПротокола(РежимЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		
		СтрокиСНайденнымиКритериями = Неопределено;
		НайтиЗаписатьКритерии(СтрокиСНайденнымиКритериями);
		
		ПроверитьНаличиеДублейСтрок(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокиСНайденнымиКритериями) Тогда
			ПроверитьНаличиеПредыдущихДействующихНормативныхСтавок(СтрокиСНайденнымиКритериями);
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыПСЦДляСравнения = "Организация, ЦФО, ВидУслугПоставщика, КатегорияУслуг";
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект, РеквизитыПСЦДляСравнения);
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПротоколСНормативнымиСтавкамиНаУслугиПоставщиков(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор,, РежимЗаписи);
	
	Если Проведен И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
			Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями) Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СозданПоПСЦ;
	ИначеЕсли Проведен Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ОтмененПоПСЦ;
	Иначе
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СозданПоПСЦ;
	КонецЕсли;
		
	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = Неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	СогласованиеСогласованСКомментариями = Ложь;
	
	ПолучениеПодписанногоНевозможно = Ложь;
	Если СтатусДокумента = Перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно тогда
		ПолучениеПодписанногоНевозможно = Истина
	КонецЕсли;
	
	ИскомыеСостоянияПодписания = Новый Массив;
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПрикрепитьСканКопиюПодписанногоСДвухСторонПротокола);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПереводПротоколаВподписан);	
	
	Для каждого Стр из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование Тогда Продолжить; КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.СтатусСогласования <> Перечисления.СтатусыСогласования.Планируется И (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Или Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен);		
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
		СогласованиеСогласованСКомментариями = СогласованиеСогласованСКомментариями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	КонецЕсли;
		
	Если СогласованиеНачато = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении;
	КонецЕсли;	
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
		
		Если СогласованиеСогласованСКомментариями = Истина Тогда
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями;	
		Иначе
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
			ДатаСогласования = ТекущаяДата();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	
	//Маршрутизировать = Константы.МаршрутизироватьПСЦ.Получить();
	Маршрутизировать = Истина;
	
	Если ЗначениеЗаполнено(Автор) Тогда
		РеквизитыАвтора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Автор, "ЦФО, Подразделение");
		ЦФО = РеквизитыАвтора.ЦФО;
		Подразделение = РеквизитыАвтора.Подразделение;
	КонецЕсли;
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Создано = ТекущаяДата();
	ДатаПСЦ = Создано;
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	
КонецПроцедуры

//Евросиб Каблов 05.02.2025 ( #100571
//Создает новые ключи и записывает существующие, по которым произошли изменения
//Это нужно для регистрации в плане обмена для выгрузки измененных тарифов в DX
Процедура СоздатьКлючиАналитикиСтрокПротокола(РежимЗаписи)
	
	УзелОбмена = Перечисления.УзлыОбмена.DX;	
	КлючПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	ВыгрузкаДанных = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	
	ДобавляемыеВПланОбмена = Новый Массив;
	УдаляемыеИзПланаОбмена = Новый Массив;
	
	Если Не ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Протокол.СтатусДокумента КАК СтатусДокумента,
		|	Протокол.НачалоДействия КАК НачалоДействия,
		|	Протокол.ОкончаниеДействия КАК ОкончаниеДействия,
		|	Протокол.Проведен КАК Проведен
		|ИЗ
		|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК Протокол
		|ГДЕ
		|	Протокол.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КритерииУслуг.Критерий КАК Критерий,
		|	КритерииУслуг.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	КритерииУслуг.СтоимостьСНДС КАК СтоимостьСНДС,
		|	КритерииУслуг.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола
		|ИЗ
		|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК КритерииУслуг
		|ГДЕ
		|	КритерииУслуг.Ссылка = &Ссылка
		|	И КритерииУслуг.КлючАналитикиСтрокиПротокола <> &КлючПустаяСсылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КлючПустаяСсылка", КлючПустаяСсылка);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеШапки = РезультатыЗапроса[0].Выбрать();
		ДанныеШапки.Следующий();
		Если (РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Проведен)
				Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
				Или СтатусДокумента <> ДанныеШапки.СтатусДокумента 
				Или НачалоДействия <> ДанныеШапки.НачалоДействия 
				Или ОкончаниеДействия <> ДанныеШапки.ОкончаниеДействия Тогда				
			Для Каждого Стр Из КритерииУслуг Цикл
				Если ЗначениеЗаполнено(Стр.КлючАналитикиСтрокиПротокола) Тогда
					ДобавляемыеВПланОбмена.Добавить(Стр.КлючАналитикиСтрокиПротокола);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаписатьКлюч = Ложь;
			ПометитьНаУдаление = Ложь;
			
			Ключ = Выборка.КлючАналитикиСтрокиПротокола;
			
			НайденнаяСтрока = КритерииУслуг.Найти(Ключ, "КлючАналитикиСтрокиПротокола");			
			Если НайденнаяСтрока = Неопределено Тогда
				КлючОбъект = Ключ.ПолучитьОбъект();
				КлючОбъект.УстановитьПометкуУдаления(Истина);
				
				ВремяВыгрузки = РегистрыСведений.ПротоколОбменов.ДатаВыгрузкиОбъекта(УзелОбмена, ВыгрузкаДанных, Ключ);
				Если ЗначениеЗаполнено(ВремяВыгрузки) Тогда
					Если ДобавляемыеВПланОбмена.Найти(Ключ) = Неопределено Тогда
						ДобавляемыеВПланОбмена.Добавить(Ключ);
					КонецЕсли;
				Иначе
					УдаляемыеИзПланаОбмена.Добавить(Ключ);
				КонецЕсли;
			Иначе
				Если Выборка.Критерий <> НайденнаяСтрока.Критерий
						Или Выборка.СтоимостьБезНДС <> НайденнаяСтрока.СтоимостьБезНДС 
						Или Выборка.СтоимостьСНДС <> НайденнаяСтрока.СтоимостьСНДС Тогда
						
					Если ДобавляемыеВПланОбмена.Найти(Ключ) = Неопределено Тогда
						ДобавляемыеВПланОбмена.Добавить(Ключ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
					
	КонецЕсли;
			
	СтрокиБезКлюча = КритерииУслуг.НайтиСтроки(Новый Структура("КлючАналитикиСтрокиПротокола", КлючПустаяСсылка));
	Для Каждого Стр Из СтрокиБезКлюча Цикл
		КлючОбъект = Справочники.КлючиАналитикиСтрокПротокола.СоздатьЭлемент();
		КлючОбъект.Записать();
		Стр.КлючАналитикиСтрокиПротокола = КлючОбъект.Ссылка;
		ДобавляемыеВПланОбмена.Добавить(КлючОбъект.Ссылка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(УдаляемыеИзПланаОбмена) Тогда
		ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(УдаляемыеИзПланаОбмена, УзелОбмена);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДобавляемыеВПланОбмена) Тогда
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(ДобавляемыеВПланОбмена, УзелОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиЗаписатьКритерии(СтрокиСНайденнымиКритериями)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КритерииУслугПустаяСсылка = Справочники.КритерииУслугПоставщиков.ПустаяСсылка();
	Для Каждого Стр Из КритерииУслуг Цикл
		Если Стр.СтоимостьБезНДС = 0 И Стр.СтоимостьСНДС = 0 И Стр.СтоимостьЗаСуткиБезНДС = 0 Тогда
			Стр.Критерий = КритерииУслугПустаяСсылка;
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслуг.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	КритерииУслуг.СтоимостьСНДС КАК СтоимостьСНДС,
	|	КритерииУслуг.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК
	|ПОМЕСТИТЬ УслугиСКритериями
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|		ПО Услуги.ИдентификаторСтрокиУслуг = КритерииУслуг.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	(КритерииУслуг.СтоимостьБезНДС <> 0
	|			ИЛИ КритерииУслуг.СтоимостьСНДС <> 0
	|			ИЛИ КритерииУслуг.СтоимостьЗаСуткиБезНДС <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	|	Критерии.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.Критерий КАК Критерий,
	|	СправочникКритерии.Ссылка КАК НайденныйКритерий,
	|	Критерии.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Критерии
	|ИЗ
	|	УслугиСКритериями КАК Критерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК СправочникКритерии
	|		ПО (СправочникКритерии.Организация = &Организация)
	|			И (СправочникКритерии.ВидУслуги = &ВидУслуги)
	|			И (НЕ СправочникКритерии.ПометкаУдаления)
	|			И (СправочникКритерии.НормативныйПоказатель)
	|			И Критерии.Номенклатура = СправочникКритерии.Номенклатура
	|ГДЕ
	|	Критерии.Критерий <> ЕСТЬNULL(СправочникКритерии.Ссылка, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	Критерии.НайденныйКритерий ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	Критерии.НайденныйКритерий ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	|	Критерии.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.НайденныйКритерий КАК НайденныйКритерий,
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	НЕ Критерии.НайденныйКритерий ЕСТЬ NULL";
	
	СтрокаПоляТЧУслуг =
	"Номенклатура,
	|ЕдиницаИзмерения,
	|Валюта,
	|ВидСобственности,
	|СтавкаНДС,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|ДляПорожних,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|НормаПользования,
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|Километраж,
	|ДляГруженых,
	|АдресСкладаПогрузкиВыгрузки";
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	СтрокаПоляТЧКритериев =
	"Продукт,
	|УчетноеНаправление,
	|ТипоразмерКТК,
	|ПунктОтправления,
	|ПунктНазначения,
	|ПунктОтправленияГород,
	|ПунктОтправленияСтрана,
	|ПунктНазначенияГород,
	|ПунктНазначенияСтрана,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|ТипоразмерВагона,
	|ВидОтправки,
	|ЛокацияОказанияУслуги,
	|ВидТранспорта,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|ПунктПогрузкиВыгрузки";
	
	СтрокаПоляКритериев = СтрокаПоляТЧУслуг + 
	",
	|" + СтрокаПоляТЧКритериев;
	
	ИменаПолейТЧУслуг = СтрРазделить(СтрокаПоляТЧУслуг, "," + Символы.ПС, Ложь);
	ИменаПолейТЧКритериев = СтрРазделить(СтрокаПоляТЧКритериев, "," + Символы.ПС, Ложь);
	
	ПоляТЧУслугЗапроса = Новый Массив;
	ПоляТЧКритериевЗапроса = Новый Массив;
	ПоляКритериевЗапроса = Новый Массив;
	ПоляУсловийСвязи = Новый Массив;
	
	ШаблонПоляТЧУслуг = "Услуги.%1 КАК %1";
	ШаблонПоляТЧКритериев = "КритерииУслуг.%1 КАК %1";
	ШаблонПоляКритериев = "Критерии.%1 КАК %1";
	ШаблонУсловияСвязи = "И Критерии.%1 = СправочникКритерии.%1";
	
	Для Каждого ИмяПоля Из ИменаПолейТЧУслуг Цикл
		ПоляТЧУслугЗапроса.Добавить(СтрШаблон(ШаблонПоляТЧУслуг, ИмяПоля));
		ПоляКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляКритериев, ИмяПоля));
		ПоляУсловийСвязи.Добавить(СтрШаблон(ШаблонУсловияСвязи, ИмяПоля));
	КонецЦикла;
	
	Для Каждого ИмяПоля Из ИменаПолейТЧКритериев Цикл
		ПоляТЧКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляТЧКритериев, ИмяПоля));
		ПоляКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляКритериев, ИмяПоля));
		ПоляУсловийСвязи.Добавить(СтрШаблон(ШаблонУсловияСвязи, ИмяПоля));
	КонецЦикла;
	
	СтрокаПоляТЧУслугЗапроса = СтрСоединить(ПоляТЧУслугЗапроса, "," + Символы.ПС);
	СтрокаПоляТЧКритериевЗапроса = СтрСоединить(ПоляТЧКритериевЗапроса, "," + Символы.ПС);
	СтрокаПоляКритериевЗапроса = СтрСоединить(ПоляКритериевЗапроса, "," + Символы.ПС);
	СтрокаУсловияСвязи = СтрСоединить(ПоляУсловийСвязи, Символы.ПС);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Услуги.Номенклатура КАК Номенклатура", СтрокаПоляТЧУслугЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК", СтрокаПоляТЧКритериевЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Критерии.Номенклатура КАК Номенклатура", СтрокаПоляКритериевЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Критерии.Номенклатура = СправочникКритерии.Номенклатура", СтрокаУсловияСвязи);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Услуги", Услуги);
	Запрос.УстановитьПараметр("КритерииУслуг", КритерииУслуг);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУслуги", ВидУслугПоставщика);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	ТаблицаУслугиСКритериями = РезультатыЗапроса[КоличествоРезультатов - 3].Выгрузить();
	ТаблицаНовыхКритериев = РезультатыЗапроса[КоличествоРезультатов - 2].Выгрузить();
	Выборка = РезультатыЗапроса[КоличествоРезультатов - 1].Выбрать();
	
	СтрокиСНайденнымиКритериями = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		ИндексСтроки = Выборка.НомерСтроки - 1;
		СтрокаТЧ = КритерииУслуг[ИндексСтроки];
		
		Если ЗначениеЗаполнено(Выборка.НайденныйКритерий) Тогда
			СтрокаТЧ.Критерий = Выборка.НайденныйКритерий;
			СтрокиСНайденнымиКритериями.Добавить(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого ДанныеКритерия Из ТаблицаНовыхКритериев Цикл
		
		СтруктураПоиска = Новый Структура(СтрокаПоляКритериев);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеКритерия);
		НайденныеСтроки = ТаблицаУслугиСКритериями.НайтиСтроки(СтруктураПоиска);
		
		НовыйКритерий = Справочники.КритерииУслугПоставщиков.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйКритерий, ДанныеКритерия);
		НовыйКритерий.Организация = Организация;
		НовыйКритерий.ВидУслуги = ВидУслугПоставщика;
		НовыйКритерий.НормативныйПоказатель = Истина;
				
		НовыйКритерий.Записать();
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			ИндексСтроки = Стр.НомерСтроки - 1;
			СтрокаТЧ = КритерииУслуг[ИндексСтроки];
			СтрокаТЧ.Критерий = НовыйКритерий.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьНаличиеДублейСтрок(Отказ)
	
	ИспользуемыеКритерии = Новый Соответствие;
	СтрокиУслуг = Новый Массив;
	Для Каждого СтрокаУслуги Из Услуги Цикл
		СтрокиКритериев = КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
		Для Каждого Стр Из СтрокиКритериев Цикл
			Если ЗначениеЗаполнено(Стр.Критерий) Тогда
				ИдентификаторСтрокиУслуг = ИспользуемыеКритерии.Получить(Стр.Критерий);
				Если ИдентификаторСтрокиУслуг = Неопределено Тогда
					ИспользуемыеКритерии.Вставить(Стр.Критерий, Стр.ИдентификаторСтрокиУслуг);
				Иначе
					Если СтрокиУслуг.Найти(Стр.ИдентификаторСтрокиУслуг) = Неопределено Тогда
						ТекущаяСтрокаУслуги = Услуги.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
						НайденнаяСтрокаУслуги = Услуги.Найти(ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
						Если НайденнаяСтрокаУслуги <> Неопределено И ТекущаяСтрокаУслуги <> НайденнаяСтрокаУслуги Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", ТекущаяСтрокаУслуги.НомерСтроки, "НомерСтроки");
							ТекстСообщения = СтрШаблон("Данные строки №%1 дублируют данные строки №%2", Формат(ТекущаяСтрокаУслуги.НомерСтроки, "ЧГ=0"), Формат(НайденнаяСтрокаУслуги.НомерСтроки, "ЧГ=0"));
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
						СтрокиУслуг.Добавить(Стр.ИдентификаторСтрокиУслуг);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПредыдущихДействующихНормативныхСтавок(СтрокиСНайденнымиКритериями)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Услуги", Услуги);
	ТаблицаПроверяемыхКритериев = КритерииУслуг.Выгрузить(СтрокиСНайденнымиКритериями);
	Запрос.УстановитьПараметр("КритерииУслуг", ТаблицаПроверяемыхКритериев);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Период", НачалоДействия - 1);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
	|	ТарифыПоставщиковСрезПоследних.Регистратор.Дата КАК РегистраторДата,
	|	ТарифыПоставщиковСрезПоследних.Критерий.Номенклатура КАК Номенклатура,
	|	ТарифыПоставщиковСрезПоследних.Критерий.Номенклатура.Представление КАК НоменклатураПредставление
	|ИЗ
	|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(
	|			&Период,
	|			Критерий В
	|				(ВЫБРАТЬ
	|					КритерииУслуг.Критерий КАК Критерий
	|				ИЗ
	|					КритерииУслуг КАК КритерииУслуг)) КАК ТарифыПоставщиковСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|			ПО КритерииУслуг.ИдентификаторСтрокиУслуг = Услуги.ИдентификаторСтрокиУслуг
	|		ПО ТарифыПоставщиковСрезПоследних.Критерий = КритерииУслуг.Критерий
	|ГДЕ
	|	(ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата
	|			ИЛИ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия > &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шаблон = "По Номенклатуре %1 в строке №%2 есть действующая ставка на услугу поставщика по Протоколу №%3 от %4. При проведении документа, она перестанет действовать с даты действия текущего документа";
	
	Пока Выборка.Следующий() Цикл				
		ТекстСообщения = СтрШаблон(Шаблон, Выборка.НоменклатураПредставление, Выборка.НомерСтроки, Выборка.РегистраторНомер, Выборка.РегистраторДата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТарифыПоставщиков = Движения.ТарифыПоставщиков;
	ТарифыПоставщиков.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.Ссылка КАК Ссылка,
	|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
	|	ПСЦПоставщикаКритерииУслуг.Критерий КАК Критерий,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаКритерииУслуг.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ПСЦПоставщикаКритерииУслуг.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ПСЦПоставщикаКритерииУслуг.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
	|	ПСЦПоставщикаКритерииУслуг.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола,
	|	ПСЦПоставщикаУслуги.Комментарий КАК Комментарий,
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|	ПСЦПоставщикаКритерииУслуг.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
	|	ПСЦПоставщикаКритерииУслуг.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги КАК ПСЦПоставщикаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.Ссылка = ПСЦПоставщикаКритерииУслуг.Ссылка
	|			И ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	ПСЦПоставщикаУслуги.Ссылка = &Ссылка
	|	И (ПСЦПоставщикаКритерииУслуг.СтоимостьБезНДС <> 0
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|			ИЛИ ПСЦПоставщикаКритерииУслуг.СтоимостьСНДС <> 0 ИЛИ ПСЦПоставщикаКритерииУслуг.СтоимостьЗаСуткиБезНДС <> 0)
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоУчетнымЕдиницам.НомерСтроки КАК НомерСтроки,
	|	УслугиПоУчетнымЕдиницам.Критерий КАК Критерий,
	|	УслугиПоУчетнымЕдиницам.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	УслугиПоУчетнымЕдиницам.СтоимостьСНДС КАК СтоимостьСНДС,
	|	УслугиПоУчетнымЕдиницам.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	УслугиПоУчетнымЕдиницам.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
	|	ТарифыПоставщиков.Регистратор КАК Регистратор,
	|	ТарифыПоставщиков.Регистратор.Представление КАК РегистраторПредставление,
	|	УслугиПоУчетнымЕдиницам.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола,
	|	УслугиПоУчетнымЕдиницам.Комментарий КАК Комментарий,
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|	УслугиПоУчетнымЕдиницам.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
	|	УслугиПоУчетнымЕдиницам.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|ИЗ
	|	Услуги КАК УслугиПоУчетнымЕдиницам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
	|		ПО УслугиПоУчетнымЕдиницам.Критерий = ТарифыПоставщиков.Критерий
	|			И (ТарифыПоставщиков.Период = &НачалоДействия)
	|			И (ТарифыПоставщиков.Регистратор <> &Регистратор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Критерий";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями
			Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
		Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ;
	Иначе
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ;
	КонецЕсли;
	
	Пока Выборка.СледующийПоЗначениюПоля("Критерий") Цикл
		
		Если ЗначениеЗаполнено(Выборка.Регистратор) Тогда
			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Выборка.НомерСтроки, "Критерии");
			ТекстСообщения = СтрШаблон("Данный тариф уже введен с такой же датой начала действия документом %1", Выборка.РегистраторПредставление);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
		КонецЕсли;
		
		Тариф = ТарифыПоставщиков.Добавить();
		ЗаполнитьСтрокуТарифа(Тариф, Выборка, СтатусТарифа);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуТарифа(Тариф, ДанныеТарифа, СтатусТарифа)
	
	Тариф.Период = НачалоДействия;
	
	ЗаполняемыеПоля = "Критерий,СтоимостьБезНДС,СтоимостьСНДС, СтоимостьЗаСуткиБезНДС, КлючАналитикиСтрокиПротокола, Комментарий";
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
		ЗаполняемыеПоля = ЗаполняемыеПоля + ", СтавкаЗаКМ40FutБезНДС";
		ЗаполняемыеПоля = ЗаполняемыеПоля + ", СтавкаЗаКМ20FutБезНДС";
	КонецЕсли;
	 
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	ЗаполнитьЗначенияСвойств(Тариф, ДанныеТарифа, ЗаполняемыеПоля);
	
	Если Не ЗначениеЗаполнено(Тариф.ОкончаниеДействия) Тогда
		Тариф.ОкончаниеДействия = ОкончаниеДействия;
	КонецЕсли;
	
	Тариф.Статус = СтатусТарифа;
				
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ДействуетДоСогласованияНовыхУсловий И Не ЗначениеЗаполнено(ОкончаниеДействия) Тогда
		ТекстСообщения = "Поле ""Окончание действия"" не заполнено";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ОкончаниеДействия", "Объект", Отказ);
	КонецЕсли;
	
	НастройкиВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(ВидУслугПоставщика, "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");
	ПоляТаблицыУслуг = НастройкиВидаУслуг.ПоляТаблицыУслуг;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	НоменклатураРазрешенныеЕИ.Ссылка КАК Номенклатура,
	|	НоменклатураРазрешенныеЕИ.Элемент КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура.РазрешенныеЕИ КАК НоменклатураРазрешенныеЕИ
	|ГДЕ
	|	НоменклатураРазрешенныеЕИ.Ссылка В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураРазрешенныеЕИ.Ссылка";
	
	ТаблицаНоменклатуры = Услуги.Выгрузить(, "Номенклатура");
	ТаблицаНоменклатуры.Свернуть("Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	
	РазрешенныеЕдиницы = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Номенклатура") Цикл
		Единицы = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ЕдиницаИзмерения") Цикл
			Единицы.Добавить(Выборка.ЕдиницаИзмерения);
		КонецЦикла;
		РазрешенныеЕдиницы.Вставить(Выборка.Номенклатура, Единицы);
	КонецЦикла;
	
	РазмерКТК20 = "20";
	РазмерКТК40 = "40";
	
	Для Каждого Стр Из Услуги Цикл
		
		Для Каждого Поле Из ПоляТаблицыУслуг Цикл
			
			Если Поле.Обязательное Тогда				
				//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
				Если Поле.Имя = "ТипоразмерыКТК" Или Поле.Имя = "ТипоразмерыКТКСтрокой" Тогда
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерКТК) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Поле.Имя = "ТипоразмерыВагонов" Или Поле.Имя = "ТипоразмерыВагоновСтрокой" Или Поле.Имя = "ТипоразмерВагона" Тогда							
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерВагона) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли; 
				//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
				ИначеЕсли Поле.Имя = "УчетныеНаправления" Или Поле.Имя = "УчетныеНаправленияСтрокой" Тогда
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.УчетноеНаправление) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Поле.Имя = "Продукт" Или Поле.Имя = "ПродуктыСтрокой" Тогда
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.Продукт) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Поле.Имя = "СтоимостьБезНДС" 
						Или Поле.Имя = "СтоимостьСНДС"
						Или Поле.Имя = "СтоимостьБезНДС_КТК20"
						Или Поле.Имя = "СтоимостьСНДС_КТК20"
						Или Поле.Имя = "СтоимостьБезНДС_КТК40"
						Или Поле.Имя = "СтоимостьСНДС_КТК40" Тогда
						
					Если Поле.Имя = "СтоимостьБезНДС_КТК20" Или Поле.Имя = "СтоимостьСНДС_КТК20" Тогда
						РазмерКТК = РазмерКТК20;
					ИначеЕсли Поле.Имя = "СтоимостьБезНДС_КТК40" Или Поле.Имя = "СтоимостьСНДС_КТК40" Тогда
						РазмерКТК = РазмерКТК40;
					Иначе
						РазмерКТК = "";
					КонецЕсли;
					
					ВывестиОшибку = Ложь;
					СтрокиКритериев = КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг, РазмерКТК", Стр.ИдентификаторСтрокиУслуг, РазмерКТК));
					Если ЗначениеЗаполнено(СтрокиКритериев) Тогда
						
						СтрокаКритерия = СтрокиКритериев[0];
						
						Если СтрНайти(Поле.Имя, "СтоимостьБезНДС") > 0 Тогда
							ИмяПоля = "СтоимостьБезНДС";
						ИначеЕсли СтрНайти(Поле.Имя, "СтоимостьСНДС") > 0 Тогда
							ИмяПоля = "СтоимостьСНДС";
						КонецЕсли;
						
						// Евросиб US 98207 TA 105661 Рыбьяков К.А. 03.04.2025 ((
						ПропуститьПроверку = Ложь;
						Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.НормативыДляКалькуляций 
							И (ЗначениеЗаполнено(СтрокаКритерия.СтоимостьБезНДС) ИЛИ ЗначениеЗаполнено(СтрокаКритерия.СтоимостьСНДС)) Тогда
							ПропуститьПроверку = Истина;
						КонецЕсли;
						// Евросиб Рыбьяков К.А. 03.04.2025 ))
						
						Если ЗначениеЗаполнено(ИмяПоля) И Не ПропуститьПроверку Тогда // Евросиб US ***** TA ***** Рыбьяков К.А. 03.04.2025 (( Добавил "ПропуститьПроверку"
							Если Не ЗначениеЗаполнено(СтрокаКритерия[ИмяПоля]) Тогда
								
								Если ИмяПоля = "СтоимостьБезНДС" Тогда
									Если Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьСНДС)
											И Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьЗаСуткиБезНДС) Тогда
										ВывестиОшибку = Истина;
									КонецЕсли;
								ИначеЕсли ИмяПоля = "СтоимостьСНДС" Тогда
									Если Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьБезНДС)
											И Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьЗаСуткиБезНДС) Тогда
										ВывестиОшибку = Истина;
									КонецЕсли;
								ИначеЕсли ИмяПоля = "СтоимостьЗаСуткиБезНДС" Тогда
									Если Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьБезНДС)
											И Не ЗначениеЗаполнено(СтрокаКритерия.СтоимостьСНДС) Тогда
										ВывестиОшибку = Истина;
									КонецЕсли;
								Иначе
									ВывестиОшибку = Истина;
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						
						ВывестиОшибку = Истина;
						
					КонецЕсли;
					
					Если ВывестиОшибку Тогда
						ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
						ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
					КонецЕсли;
					
				Иначе
					Если Не ЗначениеЗаполнено(Стр[Поле.Имя]) Тогда
						ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
						ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Стр.Номенклатура = Справочники.Номенклатура.АрендаКонтейнеров И Стр.ВидСобственности = Перечисления.ВариантыСобственности.Спот Тогда
			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ВидСобственности");
			ТекстСообщения = СтрШаблон("В строке №%1 ""АрендаКонтейнера"" выбрано недопустимое значение Вида собственности - ""Спот""", Стр.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Единицы = РазрешенныеЕдиницы.Получить(Стр.Номенклатура);
			Если ЗначениеЗаполнено(Единицы) Тогда
				Если Единицы.Найти(Стр.ЕдиницаИзмерения) = Неопределено Тогда
					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ЕдиницаИзмерения");
					ТекстСообщения = СтрШаблон("В строке №%1 единица измерения ""%2"" не соответствует разрешенным единицам измерения номенклатуры %3.", Стр.НомерСтроки, Стр.ЕдиницаИзмерения, Стр.Номенклатура);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Истина;
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
		
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	ТекущееСостояние = Неопределено;
	ДатаСогласования = '00010101';
	НачалоДействия = '00010101';
	ОкончаниеДействия = '00010101';
	ДатаПСЦ = ТекущаяДата();
	НомерПСЦ = "";
	
	КлючПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	Для Каждого Стр Из КритерииУслуг Цикл
		Стр.КлючАналитикиСтрокиПротокола = КлючПустаяСсылка;
	КонецЦикла;
	
КонецПроцедуры

