Процедура ПриОпределенииНастроекВерсионированияОбъектов(параметр1) Экспорт
	// 1с олени
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если СтрДлина(Параметры.СтрокаПоиска) < 4 Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЕ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	НЕ ТЕ.ПометкаУдаления
	               |	И ТЕ.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", "%"+Параметры.СтрокаПоиска +"%");
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		ДанныеВыбора.Добавить(Ответ.Ссылка, Ответ.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСВВ(Контейнер, ДанныеСВВ) Экспорт
	обКонтейнер = Контейнер.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(обКонтейнер, ДанныеСВВ);
	обКонтейнер.Записать();
КонецПроцедуры
