
Процедура ПередЗаписью(Отказ)
	
	Префикс = ВРег(Префикс);
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Префикс + Номер + КонтрольноеЧисло;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		
		КоррМаска = РаботаСКонтейнерамиСервер.КорректнаяМаска(Префикс, Номер);
		Если КоррМаска = Ложь Тогда
//Евросиб Гудкова( 01.03.2021 Ticket№ 0224708
//			Отказ = Истина;
// 			ВызватьИсключение " Не удается распознать номер КТК! Исправьте данные КТК в источнике или свяжитесь с ИТ!";
			ОбщегоНазначения.СообщитьПользователю(Наименование + " Не удается распознать номер КТК! Исправьте номер КТК в источнике.",,,, Отказ);
// Евросиб Гудкова)
		КонецЕсли;
		
		// +++ SIV 25-06-21 Тикет 0232229 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЕ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ТЕ КАК ТЕ
		               |ГДЕ
		               |	ТЕ.ПометкаУдаления = ЛОЖЬ
		               |	И ТЕ.Наименование = &Наименование
		               |	И ТЕ.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначения.СообщитьПользователю(Наименование + " Номер КТК уже зарегистрирован в системе. Операция прервана.",,,, Отказ);
		КонецЕсли;
		// --- SIV 25-06-21 Тикет 0232229 
		
	КонецЕсли;
	
	// ++ ДИТ_Агафонов_task 54348 11.07.2022
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
    // -- ДИТ_Агафонов_task 54348 11.07.2022
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// ++ ДИТ_Агафонов_task 54348 11.07.2022
	Если НЕ ПометкаУдаления и Не Отказ 
		//и ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый 
		Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИнформацияОтТерминалов.Период КАК Период,
		|	ИнформацияОтТерминалов.Контейнер КАК Контейнер,
		|	ИнформацияОтТерминалов.НомерКонтейнера КАК НомерКонтейнера,
		// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
		//|	ИнформацияОтТерминалов.КодТерминала КАК КодТерминала, //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
		// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
		|	ИнформацияОтТерминалов.ТипКТК КАК ТипКТК,
		|	ИнформацияОтТерминалов.РазмерКТК КАК РазмерКТК
		|ИЗ
		|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
		|ГДЕ
		|	ИнформацияОтТерминалов.НомерКонтейнера = &НомерКонтейнера
		|	И ИнформацияОтТерминалов.Контейнер = Значение(Справочник.ТЕ.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("НомерКонтейнера", Наименование);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
			МенеджерЗаписи = РегистрыСведений.ИнформацияОтТерминалов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Выборка.Период; 
			МенеджерЗаписи.Контейнер = Выборка.Контейнер; 
			МенеджерЗаписи.НомерКонтейнера = Выборка.НомерКонтейнера;
			// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
			//МенеджерЗаписи.КодТерминала = Выборка.КодТерминала; //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
			// ДИТ 65310 Давудов М.А. Конец: 16.02.202
		    МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Контейнер = Ссылка;
			МенеджерЗаписи.Ошибка = Ложь;
			
		    МассивСообщений=СтрРазделить(МенеджерЗаписи.КомментарийКОшибке,Символы.ПС,Ложь);
			НовыйМассивСообщений = Новый Массив;
			Для каждого СообщениеМассива Из МассивСообщений Цикл
				Если СтрНайти(СообщениеМассива,"которого нет в справочнике DataCore")>0
					или СтрНайти(СообщениеМассива,"не найден контейнер")>0 Тогда
					СообщениеМассива = "";
				Иначе
					НовыйМассивСообщений.Добавить(СообщениеМассива);	
				КонецЕсли;
			КонецЦикла;
			МенеджерЗаписи.КомментарийКОшибке = СтрСоединить(НовыйМассивСообщений,Символы.ПС);	
			
			РегистрыСведений.ИнформацияОтТерминалов.ПроверитьЗапись(МенеджерЗаписи);
			МенеджерЗаписи.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обновить контейнер в записях регистра: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;	
	КонецЕсли;
	// -- ДИТ_Агафонов_task 54348 11.07.2022
КонецПроцедуры
