
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Операция КАК Операция
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ТехнологическаяСхема.ТСх = ТехнологическаяСхемаТЧ.Ссылка
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &Сделка
	               |	И ТехнологическаяСхема.Вариант = &Вариант";
	Запрос.УстановитьПараметр("Вариант", Параметры.Вариант);
	Запрос.УстановитьПараметр("Сделка", Параметры.Сделка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = Оглавление.Добавить();
		НСтр.Операция = Ответ.Операция;
		
	КонецЦикла;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновлениеИтоговМатрицы", 3, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИтоговМатрицы()
	
	УникальныеКТК = Новый Массив;
	УникальныеВагоны = Новый Массив;
	
	Для Сч = 0 По Содержание.Количество()-1 Цикл
		
		Если Содержание[Сч].ВОперации = Ложь Тогда Продолжить; КонецЕсли;
		
		Если Элементы.Содержание.ПроверитьСтроку(Содержание[Сч].ПолучитьИдентификатор()) Тогда
			
			Если ЗначениеЗаполнено(Содержание[Сч].КТК) И УникальныеКТК.Найти(Содержание[Сч].КТК) = неопределено Тогда УникальныеКТК.Добавить(Содержание[Сч].КТК); КонецЕсли;
			Если ЗначениеЗаполнено(Содержание[Сч].Вагон) И УникальныеВагоны.Найти(Содержание[Сч].Вагон) = неопределено Тогда УникальныеВагоны.Добавить(Содержание[Сч].Вагон); КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИтогоВагонов = УникальныеВагоны.Количество();
	ИтогоКТК = УникальныеКТК.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОглавлениеПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.Оглавление.ТекущиеДанные;
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Содержание.Очистить();
	
	СтруктураДанныхОперации = ПолучитьСтруктуруДанныхОперации(ТекД.Операция);
	
	Для каждого Стр из СтруктураДанныхОперации Цикл
		ЗаполнитьЗначенияСвойств(Содержание.Добавить(), Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхОперации(Операция)
	
	Результат = Новый Массив; 
	
	СписокДобавленныхКТК = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО ОперацияГрузы.ТЕ = СделкаСвязьУчетныхЕдиниц.Контейнер
	               |			И ОперацияГрузы.Ссылка.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		СписокДобавленныхКТК.Добавить(Ответ.Контейнер);
		Результат.Добавить(Новый Структура("ВОперации, КТК, Вагон, Клиент, Калькуляция", Истина, Ответ.Контейнер, Ответ.Вагон, Ответ.Клиент, Ответ.Калькуляция));
		
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.Контейнер В (&Контейнер)";
	Запрос.УстановитьПараметр("Ссылка", Операция.Сделка);
	Запрос.УстановитьПараметр("Контейнер", СписокДобавленныхКТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат.Добавить(Новый Структура("ВОперации, КТК, Вагон, Клиент, Калькуляция, ПричинаОтсутствия", Ложь, Ответ.Контейнер, Ответ.Вагон, Ответ.Клиент, Ответ.Калькуляция, "Операция отсутствует в ТСх калькуляции по этому клиенту. См. закладку Состав поезда для поиска калькуляции."));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
