
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.СрокиПеремещенияМеждуСтанциями КАК СрокиПеремещенияМеждуСтанциями
	               |ГДЕ
	               |	СрокиПеремещенияМеждуСтанциями.ОбъектРегистратор = &ОбъектРегистратор";
	Запрос.УстановитьПараметр("ОбъектРегистратор", Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		МЗ = РегистрыСведений.СрокиПеремещенияМеждуСтанциями.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		МЗ.Удалить();
	КонецЦикла;
	
	Для Сч1 = 0 По Расписание.Количество()-1 Цикл
		Для Сч2 = Сч1 По Расписание.Количество()-1 Цикл
			
			СтОтправления = Расписание[Сч1].Станция;
			СтНазначения = Расписание[Сч2].Станция;
			
			Если СтОтправления = СтНазначения Тогда Продолжить; КонецЕсли;
			
			ВремяПеремещения = 0;
			РасстояниеПеремещения = 0;
			Курсор = Сч1;
			Пока Курсор < Сч2 Цикл
				
				ВремяПеремещения = ВремяПеремещения + Расписание[Курсор].ДоСледующейСтанции;
				РасстояниеПеремещения = РасстояниеПеремещения + Расписание[Курсор].РасстояниеДоСледующейСтанции;
				
				Если ЗначениеЗаполнено(Расписание[Курсор].ВремяПрибытия) И ЗначениеЗаполнено(Расписание[Курсор].ВремяОтправления) И Расписание[Курсор].ВремяПрибытия <> Расписание[Курсор].ВремяОтправления Тогда
					Отпр = Расписание[Курсор].ВремяПрибытия;
					Приб = Расписание[Курсор].ВремяОтправления;
					ВремяПеремещения = ВремяПеремещения + (?(Приб < Отпр, Приб+24*3600, Приб) - Отпр) / 3600;
				КонецЕсли;
				
				Курсор = Курсор + 1;
			КонецЦикла;
			
			МЗ = РегистрыСведений.СрокиПеремещенияМеждуСтанциями.СоздатьМенеджерЗаписи();
			Мз.ВремяПеремещенияЧас = ВремяПеремещения;
			МЗ.ОбъектРегистратор = Ссылка;
			МЗ.Период = ТекущаяДата();
			МЗ.Станция1 = СтОтправления;
			МЗ.Станция2 = СтНазначения;
			МЗ.Записать(Истина);
			
			МЗ = РегистрыСведений.РасстоянияМеждуЛокациями.СоздатьМенеджерЗаписи();
			МЗ.Локация1 = СтОтправления;
			МЗ.Локация2 = СтНазначения;
			МЗ.Период = ТекущаяДата();
			МЗ.РасстояниеКМ = РасстояниеПеремещения;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		Если Расписание.Количество() = 0 Тогда
			ПунктОтправления = неопределено;
			ПунктНазначения = неопределено;
		Иначе
			ПунктОтправления = Расписание[0].Станция;
			ПунктНазначения = Расписание[Расписание.Количество()-1].Станция;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
