
&НаСервере
Процедура ЗаполнитьДокументНаСервере(ПараметрыВыбораСФ = Ложь)
	ЗаполнитьСуммуНаНачало();
//Евросиб Гудкова( 21.11.2020 Ticket№ 0214782 переделала запросы с оборотов на движения
	//СтараяПроцедура();

#Область ТекстКлиента
	ТекстКлиента = "ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация КАК Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор КАК Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов КАК ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период КАК Дата,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ,
	               |	""Оплата"" КАК Представление,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерВходящегоДокумента КАК НомерДокумента,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаВходящегоДокумента КАК ДатаДокумента,
	               |	ВзаиморасчетыСПокупателями.СуммаСНДС КАК Дебет,
	               |	0 КАК Кредит ,
	               |	0 КАК СуммаДокумента 
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.Регистратор = ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Оплата"",
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Номер,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Дата,
	               |	ВзаиморасчетыСПокупателями.СуммаСНДС,
	               |	0,
	               |	0
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.Регистратор = ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
				   //Евросиб Каблов 16.03.2021 ( Ticket#0225077
				   //Евросиб Максимова 01062021 #0233556  
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	ВзаиморасчетыСПокупателями.Организация,
				   //|	ВзаиморасчетыСПокупателями.Контрагент,
				   //|	ВзаиморасчетыСПокупателями.Договор,
				   //|	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
				   //|	ВзаиморасчетыСПокупателями.Период,
				   //|	ВзаиморасчетыСПокупателями.Регистратор,
				   //|	""Оплата"",
				   //|	"""",
				   //|	ВзаиморасчетыСПокупателями.Регистратор.Дата,
				   //|	СУММА(ВзаиморасчетыСПокупателями.СуммаСНДС),
				   //|	0,	               
				   //|	0				   
				   //|ИЗ
				   //|	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
				   //|ГДЕ
				   //|	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
				   //|	И ВзаиморасчетыСПокупателями.Активность
				   //|	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				   ////|	И ВзаиморасчетыСПокупателями.Регистратор = ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов
				   //|	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				   //|	И ВзаиморасчетыСПокупателями.Организация = &Организация
				   //|	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
				   //|	И ВзаиморасчетыСПокупателями.Договор = &Договор
				   //|	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
				   //|	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.Прочее)
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	ВзаиморасчетыСПокупателями.Контрагент,
				   //|	ВзаиморасчетыСПокупателями.Организация,
				   //|	ВзаиморасчетыСПокупателями.Договор,
				   //|	ВзаиморасчетыСПокупателями.Период,
				   //|	ВзаиморасчетыСПокупателями.Регистратор,
				   //|	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
				   //|	ВзаиморасчетыСПокупателями.Регистратор.Дата
				   //|
				   //Евросиб Максимова 01062021 #0233556  
				   //Евросиб Каблов 16.03.2021 ) 
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Перенос оплаты"",
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Номер,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Дата,
	               |	0,
	               |	ВзаиморасчетыСПокупателями.СуммаСНДС ,
				   |    0
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	               |	И ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	ВзаиморасчетыСПокупателями.Период,
//ок)
	               |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
//Евросиб Литвинов 06.02.21 task 27746 (
				   |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
				   //|	ВЫБОР
				   //|		КОГДА &ВыбиратьСФ = Истина
				   //|			ТОГДА ЕСТЬNULL(СчетФактураВыданный.Ссылка, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов)
				   //|		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов
				   //|	КОНЕЦ,
	               |	""Продажа"",
				   //|	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = Истина
//Евросиб Максимова 26.04.2021 #0230271
				   |        ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах)
//Евросиб Максимова 26.04.2021 #0230271
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати)
	               |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати
	               |	КОНЕЦ,
				   //|	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = Истина
	               |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента)
	               |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента
	               |	КОНЕЦ,
//Евросиб Литвинов 06.02.21 task 27746 )
				   //|	0,
				   //|	ВзаиморасчетыСПокупателями.СуммаСНДС,
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, начало
	               |	Сумма(0),
	               |	Сумма(ВзаиморасчетыСПокупателями.СуммаСНДС),
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, конец
				   // Евросиб US 126643 TA 126644 Рыбьяков К.А. 18.12.2025 ((
				   |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах) 
				   |			И СчетФактураВыданный.Продавец = Значение(Справочник.Контрагенты.ПустаяСсылка)
				   |			ТОГДА ВЫБОР 
				   |				КОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.СуммаВознагражденияВключаетНДС
				   |					ТОГДА СчетФактураВыданный.СуммаДокумента
				   |				ИНАЧЕ СчетФактураВыданный.СуммаДокумента + СчетФактураВыданный.СуммаНДСДокумента
				   |			КОНЕЦ
				   |		ИНАЧЕ СчетФактураВыданный.СуммаДокумента
				   |	КОНЕЦ
				   //|    СчетФактураВыданный.СуммаДокумента
				   // Евросиб Рыбьяков К.А. 18.12.2025 ))
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |		ПО ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов = СчетФактураВыданный.ДокументОснование
	               |ГДЕ
	               |	(ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ИЛИ ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.ОтчетКомитентуОПродажах)
	               |	И ВзаиморасчетыСПокупателями.Активность
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
// ок)
	               |	И ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	КОНЕЦ
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
//++ДИТ Гаузер А.В. Ticket#0274696 11.08.2022
				   |	И ТИПЗНАЧЕНИЯ(СчетФактураВыданный.ДокументОснование) = ТИП(Документ.ОтчетКомитентуОПродажах)
				   |	И НЕ СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |	И ВзаиморасчетыСПокупателями.ЭтоВР
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, начало
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	ВзаиморасчетыСПокупателями.Период,
// ок)
	               |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
				   |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Продажа"",
	               |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |        ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах)
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати
				   |	КОНЕЦ,
				   |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента
				   |	КОНЕЦ,
				   // Евросиб US 126643 TA 126644 Рыбьяков К.А. 18.12.2025 ((
				   |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах) 
				   |			И СчетФактураВыданный.Продавец = Значение(Справочник.Контрагенты.ПустаяСсылка)
				   |			ТОГДА ВЫБОР 
				   |				КОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.СуммаВознагражденияВключаетНДС
				   |					ТОГДА СчетФактураВыданный.СуммаДокумента
				   |				ИНАЧЕ СчетФактураВыданный.СуммаДокумента + СчетФактураВыданный.СуммаНДСДокумента
				   |			КОНЕЦ
				   |		ИНАЧЕ СчетФактураВыданный.СуммаДокумента
				   |	КОНЕЦ
				   //|    СчетФактураВыданный.СуммаДокумента
				   // Евросиб Рыбьяков К.А. 18.12.2025 ))
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, конец
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ВзаиморасчетыСПокупателями.Организация,
				   |	ВзаиморасчетыСПокупателями.Контрагент,
				   |	ВзаиморасчетыСПокупателями.Договор,
				   |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
				   //|	ВзаиморасчетыСПокупателями.Период,
// ок)
	               |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
				   |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
				   |	""Продажа"",
				   |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |        ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах)
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати
				   |	КОНЕЦ,
				   |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента
				   |	КОНЕЦ,
				   //|	0,
				   //|	ВзаиморасчетыСПокупателями.СуммаСНДС,
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, начало
				   |	Сумма(0),
				   |	Сумма(ВзаиморасчетыСПокупателями.СуммаСНДС),
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, конец
				   // Евросиб US 126643 TA 126644 Рыбьяков К.А. 18.12.2025 ((
				   |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах) 
				   |			И СчетФактураВыданный.Продавец = Значение(Справочник.Контрагенты.ПустаяСсылка)
				   |			ТОГДА ВЫБОР 
				   |				КОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.СуммаВознагражденияВключаетНДС
				   |					ТОГДА СчетФактураВыданный.СуммаДокумента
				   |				ИНАЧЕ СчетФактураВыданный.СуммаДокумента + СчетФактураВыданный.СуммаНДСДокумента
				   |			КОНЕЦ
				   |		ИНАЧЕ СчетФактураВыданный.СуммаДокумента
				   |	КОНЕЦ
				   //|    СчетФактураВыданный.СуммаДокумента
				   // Евросиб Рыбьяков К.А. 18.12.2025 ))
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
				   |ИЗ
				   |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
				   |		ПО ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов = СчетФактураВыданный.ДокументОснование
				   |ГДЕ
				   |	(ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
				   |			ИЛИ ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.ОтчетКомитентуОПродажах)
				   |	И ВзаиморасчетыСПокупателями.Активность
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
				   //|	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
// ок)
				   |	И ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	КОНЕЦ
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
				   |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				   |	И ВзаиморасчетыСПокупателями.Организация = &Организация
				   |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
				   |	И ВзаиморасчетыСПокупателями.Договор = &Договор
				   |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
				   |	И СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |	И НЕ ВзаиморасчетыСПокупателями.ЭтоВР
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, начало
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	ВзаиморасчетыСПокупателями.Период,
// ок)
	               |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
				   |			И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
				   |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Продажа"",
	               |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |        ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах)
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати
				   |	КОНЕЦ,
				   |	ВЫБОР
				   |		КОГДА &ВыбиратьСФ = Истина
				   |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента)
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента
				   |	КОНЕЦ,
				   // Евросиб US 126643 TA 126644 Рыбьяков К.А. 18.12.2025 ((
				   |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов) = ТИП(Документ.ОтчетКомитентуОПродажах) 
				   |			И СчетФактураВыданный.Продавец = Значение(Справочник.Контрагенты.ПустаяСсылка)
				   |			ТОГДА ВЫБОР 
				   |				КОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.СуммаВознагражденияВключаетНДС
				   |					ТОГДА СчетФактураВыданный.СуммаДокумента
				   |				ИНАЧЕ СчетФактураВыданный.СуммаДокумента + СчетФактураВыданный.СуммаНДСДокумента
				   |			КОНЕЦ
				   |		ИНАЧЕ СчетФактураВыданный.СуммаДокумента
				   |	КОНЕЦ
				   //|    СчетФактураВыданный.СуммаДокумента
				   // Евросиб Рыбьяков К.А. 18.12.2025 ))
				   //ДИТ, Беляев СЮ, Ticket#0301302, 15-02-2023, конец
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
//--ДИТ Гаузер А.В. Ticket#0274696 11.08.2022
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Корректировка продажи"",
				   //Евросиб - АСуслов 18.05.2021 11:43:59 #0232528 
				   //(
	               |	ВЫБОР КОГДА ВзаиморасчетыСПокупателями.Регистратор.ЭтоИзменениеВознаграждения ТОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечатиВознаграждение ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати КОНЕЦ,
				   //)
				   //Евросиб - АСуслов 18.05.2021 11:44:11 #0232528 
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента,
	               |	0,
	               |	ВзаиморасчетыСПокупателями.СуммаСНДС ,
				   |    0
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	ВзаиморасчетыСПокупателями.Период,
// ок)
	               |	ВЫБОР
				   |		КОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
//Евросиб Литвинов 06.02.21 task 27746 (
				   |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
				   //|	ВЫБОР
				   //|		КОГДА &ВыбиратьСФ = Истина
				   //|			ТОГДА ЕСТЬNULL(СчетФактураВыданный.Ссылка, ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов)
				   //|		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов
				   //|	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.СуммаСНДС > 0
	               |			ТОГДА ""Продажа""
	               |		ИНАЧЕ ""Сторно""
	               |	КОНЕЦ,
				   //|	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = Истина
	               |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).НомерДляПечати)
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).НомерДляПечати
	               |	КОНЕЦ,
				   //|	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = Истина
	               |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаДокумента)
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаДокумента
	               |	КОНЕЦ,
//Евросиб Литвинов 06.02.21 task 27746 )
	               |	0,
	               //Евросиб Коханенко Н.А. #64893 27.01.2023 (( 
				   //|	ВзаиморасчетыСПокупателями.СуммаСНДС ,
				   |	СУММА(ВзаиморасчетыСПокупателями.СуммаСНДС),
				   //Евросиб Коханенко Н.А. #64893 27.01.2023 )) 
				   |     СчетФактураВыданный.СуммаДокумента
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |		ПО ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов = СчетФактураВыданный.ДокументОснование
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
// ок)
				   |	И ВЫБОР
				   |		КОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	КОНЕЦ
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности)
	               |	И ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И НЕ ВзаиморасчетыСПокупателями.ДокументДвижения ССЫЛКА Документ.КорректировкаРеализации
				   //Евросиб Коханенко Н.А. #64893 27.01.2023 (( 
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
//ДИТ Давудов М.А. US 74940 16.01.2024 Начало
// ок(
	               //|	ВзаиморасчетыСПокупателями.Период,
// ок)
	               |	ВЫБОР
				   |		КОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления <> ДАТАВРЕМЯ(1,1,1)
				   |				ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаСоставления
				   |		ИНАЧЕ ВзаиморасчетыСПокупателями.Период
				   |	КОНЕЦ,
//ДИТ Давудов М.А. US 74940 16.01.2024 Конец
	               |	СчетФактураВыданный.СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.СуммаСНДС > 0
	               |			ТОГДА ""Продажа""
	               |		ИНАЧЕ ""Сторно""
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = ИСТИНА
	               |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.НомерДляПечати, ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).НомерДляПечати)
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).НомерДляПечати
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА &ВыбиратьСФ = ИСТИНА
	               |			ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаДокумента)
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов КАК Документ.РеализацияТоваровУслуг).ДатаДокумента
	               |	КОНЕЦ
				   //Евросиб Коханенко Н.А. #64893 27.01.2023 )) 
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументДвижения,
	               |	""Корректировка продажи"",
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументДвижения КАК Документ.КорректировкаРеализации).НомерДляПечати,
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.ДокументДвижения КАК Документ.КорректировкаРеализации).ДатаДокумента,
	               |	0,
	               |	ВзаиморасчетыСПокупателями.СуммаСНДС,
	               |	0
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности)
	               |	И ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И ВзаиморасчетыСПокупателями.ДокументДвижения ССЫЛКА Документ.КорректировкаРеализации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Возврат оплаты"",
	               |	ВзаиморасчетыСПокупателями.Регистратор.Номер,
	               |	ВзаиморасчетыСПокупателями.Регистратор.Дата,
	               |	-ВзаиморасчетыСПокупателями.СуммаСНДС,
	               |	0,
				   |	0
                   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.СписаниеСРасчетногоСчета).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателями.Организация,
	               |	ВзаиморасчетыСПокупателями.Контрагент,
	               |	ВзаиморасчетыСПокупателями.Договор,
	               |	ВзаиморасчетыСПокупателями.ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателями.Период,
	               |	ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов,
	               |	""Списание"",
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.НомерДляПечати
	               |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Номер
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.ДатаДокумента
	               |		ИНАЧЕ ВзаиморасчетыСПокупателями.ДокументВзаиморасчетов.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |			ТОГДА -ВзаиморасчетыСПокупателями.СуммаСНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА -ВзаиморасчетыСПокупателями.СуммаСНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ   ,
				   |	0
                   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
				   |	,ВзаиморасчетыСПокупателями.Регистратор КАК ДокументРегистратор
				   //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателями.Регистратор ССЫЛКА Документ.КорректировкаДолга
	               |	И ВзаиморасчетыСПокупателями.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВзаиморасчетыСПокупателями.Активность
	               |	И ВзаиморасчетыСПокупателями.Организация = &Организация
	               |	И ВзаиморасчетыСПокупателями.Контрагент = &Контрагент
	               |	И ВзаиморасчетыСПокупателями.Договор = &Договор
	               |	И ВзаиморасчетыСПокупателями.ВалютаРасчетов = &ВалютаРасчетов
	               |	И ВЫРАЗИТЬ(ВзаиморасчетыСПокупателями.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)";
#КонецОбласти 
#Область ТекстПоставщика
	ТекстПоставщика = "ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация КАК Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент КАК Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор КАК Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов КАК ВалютаРасчетов,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ КАК Дата,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор КАК Документ,
	                  |	""Приход"" КАК Представление,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	                  |	КОНЕЦ КАК НомерДокумента,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ КАК ДатаДокумента,
	                  |	0 КАК Дебет,
					  |	СУММА(ВзаиморасчетыСПоставщиками.СуммаСНДС) КАК Кредит,
					  |	0 КАК СуммаДокумента
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
					  |ИЗ
					  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                  |		ПО ВзаиморасчетыСПоставщиками.Регистратор = СчетФактураПолученный.ДокументОснование
	                  |			И (СчетФактураПолученный.Проведен)
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	""Корректировка прихода"",
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).НомерВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	0,
	                  |	СУММА(ВзаиморасчетыСПоставщиками.СуммаСНДС),
	                  |	0
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |ИЗ
	                  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                  |		ПО ВзаиморасчетыСПоставщиками.ДопРегистратор = СчетФактураПолученный.ДокументОснование
	                  |			И (СчетФактураПолученный.Проведен)
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).НомерВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	                  |	КОНЕЦ,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫБОР
	                  |		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
	                  |			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаПоступления).ДатаВходящегоДокумента
	                  |		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	                  |	КОНЕЦ
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.СписаниеСРасчетногоСчета).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	""Оплата"",
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.СписаниеСРасчетногоСчета).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.СписаниеСРасчетногоСчета).Дата,
	                  |	СУММА(ВзаиморасчетыСПоставщиками.СуммаСНДС),
	                  |	0,
	                  |	0
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |ИЗ
	                  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.СписаниеСРасчетногоСчета).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.СписаниеСРасчетногоСчета).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	""Возврат оплаты"",
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Дата,
	                  |	СУММА(ВзаиморасчетыСПоставщиками.СуммаСНДС),
	                  |	0,
	                  |	0
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |ИЗ
	                  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
	                  |	ВзаиморасчетыСПоставщиками.ДопРегистратор,
	                  |	ВЫБОР
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	                  |			ТОГДА ""Списание""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |			ТОГДА ""Перенос прихода""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                  |			ТОГДА ""Приход""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.АвансыПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |			ТОГДА ""Оплата""
	                  |		ИНАЧЕ ""Перенос оплаты""
	                  |	КОНЕЦ,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
	                  |	СУММА(ВЫБОР
	                  |			КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				ТОГДА 0
	                  |			ИНАЧЕ ВзаиморасчетыСПоставщиками.СуммаСНДС * ВЫБОР
	                  |					КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	                  |						ТОГДА -1
	                  |					ИНАЧЕ 1
	                  |				КОНЕЦ
	                  |		КОНЕЦ),
	                  |	СУММА(ВЫБОР
	                  |			КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				ТОГДА ВзаиморасчетыСПоставщиками.СуммаСНДС * ВЫБОР
	                  |						КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	                  |							ТОГДА -1
	                  |						ИНАЧЕ 1
	                  |					КОНЕЦ
	                  |			ИНАЧЕ 0
	                  |		КОНЕЦ),
	                  |	0
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |ИЗ
	                  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаДолга
	                  |	И (ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	                  |			ИЛИ ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности))
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.ДопРегистратор,
	                  |	ВЫБОР
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	                  |			ТОГДА ""Списание""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |			ТОГДА ""Перенос прихода""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                  |			ТОГДА ""Приход""
	                  |		КОГДА ВзаиморасчетыСПоставщиками.Регистратор.ВидАвансаЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыАвансаЗадолженности.АвансыПоставщику)
	                  |				И ВзаиморасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                  |			ТОГДА ""Оплата""
	                  |		ИНАЧЕ ""Перенос оплаты""
	                  |	КОНЕЦ,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Номер,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
					  |
					  //Евросиб Каблов 16.03.2021 ( Ticket#0225077
					  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	""Перенос оплаты"",
	                  |	"""",
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
					  |	СУММА(ВзаиморасчетыСПоставщиками.СуммаСНДС),
	                  |	0,
	                  |	0
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор КАК ДокументРегистратор
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
	                  |ИЗ
	                  |	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	                  |ГДЕ
	                  |	ВзаиморасчетыСПоставщиками.Организация = &Организация
	                  |	И ВзаиморасчетыСПоставщиками.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ВзаиморасчетыСПоставщиками.Контрагент = &Контрагент
	                  |	И ВзаиморасчетыСПоставщиками.Договор = &Договор
	                  |	И ВзаиморасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаДолга
	                  |	И ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	                  |	И ВзаиморасчетыСПоставщиками.Активность
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВзаиморасчетыСПоставщиками.Организация,
	                  |	ВзаиморасчетыСПоставщиками.Контрагент,
	                  |	ВзаиморасчетыСПоставщиками.Договор,
	                  |	ВзаиморасчетыСПоставщиками.Регистратор,
	                  |	ВЫРАЗИТЬ(ВзаиморасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаДолга).Дата,
	                  |	ВзаиморасчетыСПоставщиками.Договор.ВалютаВзаиморасчетов
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
					  |	,ВзаиморасчетыСПоставщиками.Регистратор";
					  //ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец
					  //Евросиб Каблов 16.03.2021 )
#КонецОбласти 
	Запрос = Новый Запрос;
	Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ТекстКлиента = СтрЗаменить(ТекстКлиента, "И ВзаиморасчетыСПокупателями.Договор = &Договор", "");
		ТекстПоставщика = СтрЗаменить(ТекстПоставщика, "И ВзаиморасчетыСПоставщиками.Договор = &Договор", "");
	КонецЕсли;
	ПараметрыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ТипКонтрагента_Клиент, ТипКонтрагента_Подрядчик"); 
	Если ПараметрыКонтрагента.ТипКонтрагента_Клиент И ПараметрыКонтрагента.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = ТекстКлиента + " ОБЪЕДИНИТЬ " + ТекстПоставщика;
	ИначеЕсли ПараметрыКонтрагента.ТипКонтрагента_Клиент Тогда
		Запрос.Текст = ТекстКлиента;
	ИначеЕсли ПараметрыКонтрагента.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = ТекстПоставщика;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("У контрагента не определен тип (подрядчик/покупатель) в карточке контрагента. Заполнение документа невозможно.");
		Возврат;
	КонецЕсли;
//Евросиб Литвинов 06.02.21 task 27746 (
	ПараметрВыбораСФ = Ложь;
	Если НЕ ПараметрыВыбораСФ = Ложь Тогда
		ПараметрыВыбораСФ.Свойство("КомандаИмя", ПараметрВыбораСФ);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВыбиратьСФ", ПараметрВыбораСФ);
//Евросиб Литвинов 06.02.21 task 27746 )
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ВалютаРасчетов", Объект.ВалютаДокумента);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НовСтр = Объект.ПоДаннымОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Результат);
		Если Результат.СуммаДокумента<>0 и 
			ТипЗнч(НовСтр.Документ)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах")<>0 Тогда
			НовСтр.Кредит=Результат.СуммаДокумента;
		КонецЕсли;
		//Евросиб Каблов 16.03.2021 (
		//НовСтр.Представление = Результат.Представление + "(" + Результат.НомерДокумента + " от " + Формат(Результат.ДатаДокумента,"ДФ=dd.MM.yyyy")+")";
		Если ЗначениеЗаполнено(Результат.НомерДокумента) Тогда
			НовСтр.Представление = Результат.Представление + "(" + Результат.НомерДокумента + " от " + Формат(Результат.ДатаДокумента,"ДФ=dd.MM.yyyy")+")";
		Иначе
			НовСтр.Представление = Результат.Представление + "(" + Формат(Результат.ДатаДокумента, "ДФ=dd.MM.yyyy")+")";
		КонецЕсли;
		//Евросиб Каблов 16.03.2021 ) 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуНаНачало()
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДопУсловие = " и Договор = &Договор ";
		Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Иначе
		ДопУсловие = "";
	КонецЕсли;

	Если Объект.Контрагент.ТипКонтрагента_Клиент Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент"+ДопУсловие+
		               				" И Организация = &Организация) КАК ВзаиморасчетыСПокупателямиОстатки";
	ИначеЕсли Объект.Контрагент.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент"+ДопУсловие+
		               				" И Организация = &Организация) КАК ВзаиморасчетыСПоставщикамиОстатки";
	ИначеЕсли Объект.Контрагент.ТипКонтрагента_Клиент и Объект.Контрагент.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ПОМЕСТИТЬ ОбщиеИтоги
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент"+ДопУсловие+
		              				" И Организация = &Организация) КАК ВзаиморасчетыСПокупателямиОстатки
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент"+ДопУсловие+
		               				" И Организация = &Организация) КАК ВзаиморасчетыСПоставщикамиОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ОбщиеИтоги.СуммаСНДСОстаток) КАК СуммаСНДСОстаток
		               |ИЗ
		               |	ОбщиеИтоги КАК ОбщиеИтоги";
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Если Запрос.Текст = "" Тогда
		Сообщить("У контрагента не определен тип (подрядчик/покупатель) в карточке контрагента. Невозможно получить остаток на начало периода.");
	Иначе	
		Результат= Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Объект.ОстатокНаНачало = Результат.СуммаСНДСОстаток;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
//Евросиб Литвинов 06.02.21 task 27746 (
	допПараметры = Новый Структура("КомандаИмя", Команда.Имя = "ЗаполнитьДокументПоСФ");
//Евросиб Литвинов 06.02.21 task 27746 )
	Если Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьПоДаннымУчетаЗавершение", ЭтотОбъект, допПараметры); //Евросиб Литвинов 06.02.21 task 27746;
		Текст = НСтр("ru='Перед заполнением табличные части будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьДокументНаСервере();
		РассчитатьСуммыИтого();  
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Начало: 02.07.2024 
		Если Команда.Имя = "ЗаполнитьДокументПоСФ" Тогда
			Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизации_СчетФактуры");
		Иначе
		    Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизации_Акты");
		КонецЕсли;
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Конец: 02.07.2024
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПоДаннымУчетаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Начало: 02.07.2024 
		Если ДополнительныеПараметры.КомандаИмя = Истина Тогда
			Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизации_СчетФактуры");
		Иначе
		    Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизации_Акты");
		КонецЕсли;
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Конец: 02.07.2024
		Объект.ПоДаннымОрганизации.Очистить();
		ЗаполнитьДокументНаСервере(ДополнительныеПараметры);  //Евросиб Литвинов 06.02.21 task 27746;
		РассчитатьСуммыИтого();
		Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыИтого()
	ОстатокНаКонец = Объект.ОстатокНаНачало + Объект.ПоДаннымОрганизации.Итог("Дебет") - Объект.ПоДаннымОрганизации.Итог("Кредит");
	ОстатокНаНачалоКонтрагент = - Объект.ОстатокНаНачало;
	ОстатокНаКонецКонтрагент = ОстатокНаНачалоКонтрагент + Объект.ПоДаннымКонтрагента.Итог("Дебет")-Объект.ПоДаннымКонтрагента.Итог("Кредит");
	Объект.Расхождение = ОстатокНаКонец+ОстатокНаКонецКонтрагент;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации()
	Для каждого Стр из Объект.ПоДаннымОрганизации Цикл
		НовСтр = Объект.ПоДаннымКонтрагента.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		Если СтрНайти(НовСтр.Представление,"Приход") <> 0 Тогда
			НовСтр.Представление = СтрЗаменить(НовСтр.Представление,"Приход","Продажа");
		ИначеЕсли СтрНайти(НовСтр.Представление,"Продажа") <> 0 Тогда
			НовСтр.Представление = СтрЗаменить(НовСтр.Представление,"Продажа","Приход");
		ИначеЕсли СтрНайти(НовСтр.Представление,"прихода") <> 0 Тогда
			НовСтр.Представление = СтрЗаменить(НовСтр.Представление,"прихода","продажи");
		ИначеЕсли СтрНайти(НовСтр.Представление,"продажи") <> 0 Тогда
			НовСтр.Представление = СтрЗаменить(НовСтр.Представление,"продажи","прихода");
		КонецЕсли;
		НовСтр.Дебет = Стр.Кредит;
		НовСтр.Кредит = Стр.Дебет;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымОрганизации(Команда)
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьКонтрагентаЗавершение", ЭтотОбъект);
		Текст = НСтр("ru='Перед заполнением табличные части будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Иначе
	
	ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации();
	РассчитатьСуммыИтого();
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОрганизацииИПоКонтрагенту(Команда)
//Евросиб Литвинов 06.02.21 task 27746 (
	допПараметры = Новый Структура("КомандаИмя", Команда.Имя = "ЗаполнитьПоОрганизацииИПоКонтрагентуПоСФ");
//Евросиб Литвинов 06.02.21 task 27746 )
	Если Объект.ПоДаннымОрганизации.Количество() > 0 или Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьПоДаннымУчетаИКонтрагентаЗавершение", ЭтотОбъект, допПараметры); //Евросиб Литвинов 06.02.21 task 27746
		Текст = НСтр("ru='Перед заполнением табличные части будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Иначе
	
		ЗаполнитьДокументНаСервере(допПараметры);
		ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации();
		РассчитатьСуммыИтого();
		Модифицированность = Истина;  
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Начало: 02.07.2024 
		Если Команда.Имя = "ЗаполнитьПоОрганизацииИПоКонтрагентуПоСФ" Тогда
			Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизацииИКонтрагенту_СчетФактуры");
		Иначе
		    Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизацииИКонтрагенту_Акты");
		КонецЕсли;
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Конец: 02.07.2024
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПоДаннымУчетаИКонтрагентаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Начало: 02.07.2024 
		Если ДополнительныеПараметры.КомандаИмя = Истина Тогда
			Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизацииИКонтрагенту_СчетФактуры");
		Иначе
		    Объект.ТипАктаСверки = ПредопределенноеЗначение("Перечисление.ТипыАктовСверок.ПоОрганизацииИКонтрагенту_Акты");
		КонецЕсли;
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Конец: 02.07.2024
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
		ЗаполнитьДокументНаСервере(ДополнительныеПараметры);  //Евросиб Литвинов 06.02.21 task 27746;
		ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации();
		РассчитатьСуммыИтого();
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьКонтрагентаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
			Объект.ПоДаннымКонтрагента.Очистить();
		ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации();
		РассчитатьСуммыИтого();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаПриИзменении(Элемент)
	РассчитатьСуммыИтого();
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымОрганизацииПриИзменении(Элемент)
	РассчитатьСуммыИтого();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьОткрытыйПериод(Команда)
	
	Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//	ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
//	Элементы.ОбновитьОткрытыйПериод.Доступность = НЕ ПроверкаДоступнотиПоПериоду();
	РассчитатьСуммыИтого();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступнотиПоПериоду()
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО,Объект.Организация);
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СтараяПроцедура()

	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДопУсловие = " и Договор = &Договор ";
		Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Иначе
		ДопУсловие = "";
	КонецЕсли;
	Если Объект.Контрагент.ТипКонтрагента_Клиент Тогда
		Запрос.Текст = 		"ВЫБРАТЬ
		               		|	ВзаиморасчетыСПокупателямиОбороты.Организация КАК Организация,
//Евросиб Гудкова( 07.10.2020 Ticket№ 0209251
//							|	ВзаиморасчетыСПокупателямиОбороты.Период КАК Период,
							|	ВзаиморасчетыСПокупателямиОбороты.ДатаРасчетов КАК Период,
// Евросиб Гудкова) 							
		               		|	ВзаиморасчетыСПокупателямиОбороты.Контрагент КАК Контрагент,
		               		|	ВзаиморасчетыСПокупателямиОбороты.Договор КАК Договор,
		               		|	ВзаиморасчетыСПокупателямиОбороты.ВалютаРасчетов КАК ВалютаРасчетов,
		               		|	ВЫБОР
		               		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
		               		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
		               		|		ИНАЧЕ ВзаиморасчетыСПокупателямиОбороты.Регистратор
		               		|	КОНЕЦ КАК Регистратор,
		               		|	ВзаиморасчетыСПокупателямиОбороты.СуммаСНДСОборот КАК СуммаСНДСОборот,
		               		|	ВЫБОР
		               		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
		               		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов.Представление
		               		|		ИНАЧЕ ВзаиморасчетыСПокупателямиОбороты.Регистратор.Представление
		               		|	КОНЕЦ КАК ПредставлениеДокумента
		               		|ИЗ
		               		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Обороты(
		               		|			&НачалоПериода,
		               		|			&КонецПериода,
		               		|			Регистратор,
		               		|			Контрагент = &Контрагент"+ДопУсловие+"
							|				И Организация = &Организация И ВалютаРасчетов = &ВалютаДокумента) КАК ВзаиморасчетыСПокупателямиОбороты
//Евросиб Гудкова( 18.11.2020 Ticket№ 0213919
		               		|			 ГДЕ ВЫБОР КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателямиОбороты.Регистратор КАК Документ.КорректировкаДолга).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее) ИНАЧЕ Истина КОНЕЦ
// Евросиб Гудкова) 							
//Евросиб - АСуслов 20.11.2020 10:02:34 #0212964 
//(
		|И ВЫБОР
		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор = ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
		|                 И ВзаиморасчетыСПокупателямиОбороты.СуммаСНДСОборот > 0 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
//)
//Евросиб - АСуслов 20.11.2020 10:02:35 #0212964 
							|";
	ИначеЕсли Объект.Контрагент.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОбороты.Организация КАК Организация,
		|	ВзаиморасчетыСПоставщикамиОбороты.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПоставщикамиОбороты.Договор КАК Договор,
		|	ВзаиморасчетыСПоставщикамиОбороты.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОбороты.Период КАК Период,
		|	ВзаиморасчетыСПоставщикамиОбороты.СуммаСНДСОборот КАК СуммаСНДСОборот,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПоставщикамиОбороты.ДокументВзаиморасчетов
   		|		ИНАЧЕ ВзаиморасчетыСПоставщикамиОбороты.Регистратор
   		|	КОНЕЦ КАК Регистратор,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПоставщикамиОбороты.ДокументВзаиморасчетов.Представление
   		|		ИНАЧЕ ВзаиморасчетыСПоставщикамиОбороты.Регистратор.Представление
   		|	КОНЕЦ КАК ПредставлениеДокумента
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Контрагент = &Контрагент "+ДопУсловие+
		" И Организация = &Организация И ВалютаРасчетов = &ВалютаДокумента) КАК ВзаиморасчетыСПоставщикамиОбороты
//Евросиб Гудкова( 18.11.2020 Ticket№ 0213919
   		|			 ГДЕ ВЫБОР КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщикамиОбороты.Регистратор КАК Документ.КорректировкаДолга).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее) ИНАЧЕ Истина КОНЕЦ
//Евросиб - АСуслов 20.11.2020 10:02:34 #0212964 
//(
		|И ВЫБОР
		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор = ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
		|                 И ВзаиморасчетыСПоставщикамиОбороты.СуммаСНДСОборот > 0 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
//)
//Евросиб - АСуслов 20.11.2020 10:02:35 #0212964 
// Евросиб Гудкова) 							
		|";	
	ИначеЕсли Объект.Контрагент.ТипКонтрагента_Подрядчик и Объект.Контрагент.ТипКонтрагента_Клиент Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОбороты.Организация КАК Организация,
		|	ВзаиморасчетыСПокупателямиОбороты.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПокупателямиОбороты.Договор КАК Договор,
		|	ВзаиморасчетыСПокупателямиОбороты.ВалютаРасчетов КАК ВалютаРасчетов,
//Евросиб Гудкова( 07.10.2020 Ticket№ 0209251
//							|	ВзаиморасчетыСПокупателямиОбороты.Период КАК Период,
							|	ВзаиморасчетыСПокупателямиОбороты.ДатаРасчетов КАК Период,
// Евросиб Гудкова) 							
		|	ВзаиморасчетыСПокупателямиОбороты.СуммаСНДСОборот КАК СуммаСНДСОборот,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
   		|		ИНАЧЕ ВзаиморасчетыСПокупателямиОбороты.Регистратор
   		|	КОНЕЦ КАК Регистратор,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов.Представление
   		|		ИНАЧЕ ВзаиморасчетыСПокупателямиОбороты.Регистратор.Представление
   		|	КОНЕЦ КАК ПредставлениеДокумента
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Контрагент = &Контрагент"+ДопУсловие+
		" И Организация = &Организация И ВалютаРасчетов = &ВалютаДокумента) КАК ВзаиморасчетыСПокупателямиОбороты
//Евросиб Гудкова( 18.11.2020 Ticket№ 0213919
   		|			 ГДЕ ВЫБОР КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПокупателямиОбороты.Регистратор КАК Документ.КорректировкаДолга).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее) ИНАЧЕ Истина КОНЕЦ
// Евросиб Гудкова) 							
//Евросиб - АСуслов 20.11.2020 10:02:34 #0212964 
//(
		|И ВЫБОР
		|		КОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|			ТОГДА ВзаиморасчетыСПокупателямиОбороты.Регистратор = ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
		|                 И ВзаиморасчетыСПокупателямиОбороты.СуммаСНДСОборот > 0 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
//)
//Евросиб - АСуслов 20.11.2020 10:02:35 #0212964 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОбороты.Организация,
		|	ВзаиморасчетыСПоставщикамиОбороты.Контрагент,
		|	ВзаиморасчетыСПоставщикамиОбороты.Договор,
		|	ВзаиморасчетыСПоставщикамиОбороты.ВалютаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОбороты.Период,
		|	ВзаиморасчетыСПоставщикамиОбороты.СуммаСНДСОборот,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПоставщикамиОбороты.ДокументВзаиморасчетов
   		|		ИНАЧЕ ВзаиморасчетыСПоставщикамиОбороты.Регистратор
   		|	КОНЕЦ КАК Регистратор,
   		|	ВЫБОР
   		|		КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
   		|			ТОГДА ВзаиморасчетыСПоставщикамиОбороты.ДокументВзаиморасчетов.Представление
   		|		ИНАЧЕ ВзаиморасчетыСПоставщикамиОбороты.Регистратор.Представление
   		|	КОНЕЦ КАК ПредставлениеДокумента
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Контрагент = &Контрагент"+ДопУсловие+
		" И Организация = &Организация И ВалютаРасчетов = &ВалютаДокумента) КАК ВзаиморасчетыСПоставщикамиОбороты
//Евросиб Гудкова( 18.11.2020 Ticket№ 0213919
   		|			 ГДЕ ВЫБОР КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСПоставщикамиОбороты.Регистратор КАК Документ.КорректировкаДолга).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее) ИНАЧЕ Истина КОНЕЦ
// Евросиб Гудкова)
//Евросиб - АСуслов 20.11.2020 10:02:34 #0212964 
//(
		|И ВЫБОР
		|		КОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|			ТОГДА ВзаиморасчетыСПоставщикамиОбороты.Регистратор = ВзаиморасчетыСПокупателямиОбороты.ДокументВзаиморасчетов
		|                 И ВзаиморасчетыСПоставщикамиОбороты.СуммаСНДСОборот > 0 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
//)
//Евросиб - АСуслов 20.11.2020 10:02:35 #0212964 
		|";
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ВалютаДокумента", Объект.ВалютаДокумента);
	Если Запрос.Текст = "" Тогда
		Сообщить("У контрагента не определен тип (подрядчик/покупатель) в карточке контрагента. Заполнение документа невозможно.") ;
	Иначе	
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			НовСтр = Объект.ПоДаннымОрганизации.Добавить();
			НовСтр.Договор = Результат.Договор;
			Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
				Или ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
				или ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				НовСтр.Дата = Результат.Регистратор.ДатаВходящегоДокумента;
			Иначе
				НовСтр.Дата = Результат.Период;
			КонецЕсли;
			НовСтр.Документ = Результат.Регистратор;
			ЭтоДебет = Ложь; //Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
			Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") И Результат.Регистратор.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда //Гудкова добавила вид операции
				Представление = "Оплата ("+ Результат.Регистратор.НомерВходящегоДокумента+" от "+Формат(Результат.Регистратор.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy")+")";
				ЭтоДебет = Истина; //Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				Представление = "Приход ("+ Результат.Регистратор.НомерВходящегоДокумента+" от "+Формат(Результат.Регистратор.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy")+")";
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				Представление = "Корректировка прихода ("+ Результат.Регистратор.НомерВходящегоДокумента+" от "+Формат(Результат.Регистратор.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy")+")";
//Евросиб Гудкова( 07.10.2020 Ticket№ 0209251
//было
			//ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			//	Представление = "Продажа ("+ Результат.Регистратор.Номер+" от "+Формат(Результат.Регистратор.Дата,"ДФ=dd.MM.yyyy")+")";
			//ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			//	Представление = "Корректировка продажи ("+ Результат.Регистратор.Номер+" от "+Формат(Результат.Регистратор.Дата,"ДФ=dd.MM.yyyy")+")";
			//ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
			//	Представление = "Оплата ("+ Результат.Регистратор.Номер+" от "+Формат(Результат.Регистратор.Дата,"ДФ=dd.MM.yyyy")+")";
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
//Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
//				Представление = "Продажа ("+ Результат.Регистратор.НомерДляПечати+" от "+Формат(Результат.Регистратор.ДатаДокумента,"ДФ=dd.MM.yyyy")+")";
				Представление = ?(Результат.СуммаСНДСОборот > 0, "Сторно", "Продажа") + " ("+ Результат.Регистратор.НомерДляПечати+" от "+Формат(Результат.Регистратор.ДатаДокумента,"ДФ=dd.MM.yyyy")+")";
// Евросиб Гудкова) 				
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Представление = "Корректировка продажи ("+ Результат.Регистратор.НомерДляПечати+" от "+Формат(Результат.Регистратор.ДатаДокумента,"ДФ=dd.MM.yyyy")+")";
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") И Результат.Регистратор.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика Тогда
				Представление = "Возврат оплаты ("+ Результат.Регистратор.НомерВходящегоДокумента+" от "+Формат(Результат.Регистратор.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy")+")";
				ЭтоДебет = Истина; //Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") И Результат.Регистратор.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
				Представление = "Оплата ("+ Результат.Регистратор.Номер+" от "+Формат(Результат.Регистратор.Дата,"ДФ=dd.MM.yyyy")+")";
				ЭтоДебет = Истина; //Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
			ИначеЕсли ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") И Результат.Регистратор.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
				Представление = "Возврат оплаты ("+ Результат.Регистратор.Номер+" от "+Формат(Результат.Регистратор.Дата,"ДФ=dd.MM.yyyy")+")";
				ЭтоДебет = Истина; //Евросиб Гудкова( 05.11.2020 Ticket№ 0212964
// Евросиб Гудкова) 				
			КонецЕсли;
			
			НовСтр.Представление = Представление;
//Евросиб Гудкова( 05.11.2020 Ticket№ 0212964			
//			Если Результат.СуммаСНДСОборот > 0 Тогда   
			Если ЭтоДебет Тогда   
// Евросиб Гудкова) 				
				НовСтр.Дебет = Результат.СуммаСНДСОборот;
			Иначе
				НовСтр.Кредит = -Результат.СуммаСНДСОборот;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // СтараяПроцедура()
 
