//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 04.02.2025  
Процедура ПроверитьИзменениеИЗаписатьСтатусыКТК(ИсточникЗаписи, ДополнительныеСвойства = Неопределено) Экспорт
	
	ТаблицаИзмененияСтатусов = Новый ТаблицаЗначений;
	ТаблицаИзмененияСтатусов.Колонки.Добавить("КТК", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТаблицаИзмененияСтатусов.Колонки.Добавить("ДатаИзмененияСтатуса",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаИзмененияСтатусов.Колонки.Добавить("Статус", Новый ОписаниеТипов("СправочникСсылка.СтатусыКТК")); 
		
	#Область Источник_Заявка
	Если ТипЗнч(ИсточникЗаписи) = Тип("ДокументСсылка.Заявка") Тогда    
		
		////При проведении заявки с клиентскими контейнерами устанавливать статусы "взят на баланс", "снят с баланса".
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		//|	ЗаявкаСоставУслуги.Ссылка.Проведен КАК Проведен,
		//|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		//|ПОМЕСТИТЬ ВТ_КонтейнерыЗаявки
		//|ИЗ
		//|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		//|ГДЕ
		//|	ЗаявкаСоставУслуги.Ссылка = &Заявка
		////|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = &ПустаяЗаявка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_КонтейнерыЗаявки.НомерКТК КАК КТК,
		//|	ВТ_КонтейнерыЗаявки.Проведен КАК Проведен,
		//|	КлючиАналитикиПеревозки.ДатаНачалаПеревозки КАК ДатаНачалаПеревозки,
		//|	КлючиАналитикиПеревозки.ДатаОкончанияПеревозки КАК ДатаОкончанияПеревозки,
		//|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ВидСобственности,
		//|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК ВЭксплуатации,
		//|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК ДатаВозвратаСобственнику,
		//|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока КАК ДатаВзятия
		//|ИЗ
		//|	ВТ_КонтейнерыЗаявки КАК ВТ_КонтейнерыЗаявки
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		//|				,
		//|				КТК В
		//|					(ВЫБРАТЬ
		//|						Т.НомерКТК
		//|					ИЗ
		//|						ВТ_КонтейнерыЗаявки КАК Т)) КАК стоки_ТекущиеДанныеСрезПоследних
		//|		ПО ВТ_КонтейнерыЗаявки.НомерКТК = стоки_ТекущиеДанныеСрезПоследних.КТК
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		//|		ПО ВТ_КонтейнерыЗаявки.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка";
		//
		////Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.Заявка.ПустаяСсылка());
		//Запрос.УстановитьПараметр("Заявка", ИсточникЗаписи);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Выборка = РезультатЗапроса.Выбрать();
		//
		//ТаблицаИзмененияСтатусовКлиент = ТаблицаИзмененияСтатусов.Скопировать();  
		//ТаблицаИзмененияСтатусовКлиент.Очистить();
		//
		//Пока Выборка.Следующий() Цикл
		//	//Если Заявка проведена и контейнер клиентский - "Взят на баланс"  
		//	Если Выборка.Проведен и Выборка.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский 
		//		и ЗначениеЗаполнено(Выборка.ДатаВзятия) Тогда
		//		НССтатуса = ТаблицаИзмененияСтатусовКлиент.Добавить(); 
		//		ЗаполнитьЗначенияСвойств(НССтатуса, Выборка);
		//		НССтатуса.Статус = Справочники.СтатусыКТК.ВзятНаБаланс;
		//		НССтатуса.ДатаИзмененияСтатуса = Выборка.ДатаВзятия;
		//	КонецЕсли;
		//	
		//	//Если Контейнер не клиентский и не в эксплуатации - "Снят с баланса" 
		//	Если не Выборка.ВЭксплуатации и Выборка.ВидСобственности <> Перечисления.ВариантыСобственности.Клиентский 
		//		и ЗначениеЗаполнено(Выборка.ДатаВозвратаСобственнику) Тогда
		//		НССтатуса = ТаблицаИзмененияСтатусовКлиент.Добавить();
		//		НССтатуса.КТК 					= Выборка.Контейнер;
		//		НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаВозвратаСобственнику;  
		//		НССтатуса.Статус 				= Справочники.СтатусыКТК.СнятСБаланса;
		//	КонецЕсли;
		//	
		//	//Заявка проведена и установлена дата начала перевозки - "Перевозка начата" 
		//	Если Выборка.Проведен и ЗначениеЗаполнено(Выборка.ДатаНачалаПеревозки) Тогда
		//		НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
		//		НССтатуса.КТК 					= Выборка.Контейнер;
		//		НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаНачалаПеревозки;  
		//		НССтатуса.Статус 				= Справочники.СтатусыКТК.СнятСБаланса;
		//	КонецЕсли;
		//	
		//	//Заявка проведена и установлена дата окончания перевозки - "Перевозка завершена" 
		//	Если Выборка.Проведен и ЗначениеЗаполнено(Выборка.ДатаОкончанияПеревозки) Тогда
		//		НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
		//		НССтатуса.КТК 					= Выборка.Контейнер;
		//		НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаОкончанияПеревозки;  
		//		НССтатуса.Статус 				= Справочники.СтатусыКТК.СнятСБаланса;
		//	КонецЕсли; 
		//	
		//КонецЦикла;    
		//
		//Если ТаблицаИзмененияСтатусовКлиент.Количество() Тогда
		//	ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусовКлиент, Истина);
		//КонецЕсли;

		//Если ТаблицаИзмененияСтатусов.Количество() Тогда
		//	ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов,, Истина);
		//КонецЕсли;
		
	#КонецОбласти
	
	#Область Источник_РелизКлиента
	ИначеЕсли ТипЗнч(ИсточникЗаписи) = Тип("ДокументСсылка.РелизКлиента") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК КТК
		|ПОМЕСТИТЬ ВТ_КТКРелиза
		|ИЗ
		|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|ГДЕ
		|	РелизКлиентаКонтейнеры.Ссылка = &РелизКлиента 
		|	И РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозки.ДатаДобавленияВРелиз КАК ДатаДобавленияВРелиз,
		|	КлючиАналитикиПеревозкиМилиПервая.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозки.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	РелизКлиентаКонтейнеры.Ссылка.ДействиеРелизаОкончание КАК ДействиеРелизаОкончание,
		|	РелизКлиентаКонтейнеры.Ссылка.Проведен КАК Проведен
		|ИЗ
		|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ПО КлючиАналитикиПеревозки.Контейнер = ТЕ.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМилиПервая
		|			ПО КлючиАналитикиПеревозки.Ссылка = КлючиАналитикиПеревозкиМилиПервая.Ссылка
		|				И (КлючиАналитикиПеревозкиМилиПервая.ЭтапПеревозки = &ПерваяМиля)
		|		ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ
		|	РелизКлиентаКонтейнеры.Ссылка = &РелизКлиента
		|	И КлючиАналитикиПеревозки.Контейнер В
		|			(ВЫБРАТЬ
		|				т.КТК
		|			ИЗ
		|				ВТ_КТКРелиза КАК т)
		|	И НЕ КлючиАналитикиПеревозки.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПерваяМиля", Перечисления.ЭтапыПеревозки.ПерваяМиля);
		Запрос.УстановитьПараметр("РелизКлиента", ИсточникЗаписи);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  
			
			Если Выборка.Проведен Тогда 
				//Забронирован
				Если ЗначениеЗаполнено(Выборка.ДатаДобавленияВРелиз) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаДобавленияВРелиз; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.ЗабронированКВыдаче;   
				КонецЕсли;
				
				//Доступен к выдаче	
				Если ЗначениеЗаполнено(Выборка.ДатаСдачиКТКНаТерминал) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаСдачиКТКНаТерминал; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.ДоступенКВыдаче; 
				КонецЕсли;     
				
				//Выдан
				Если ЗначениеЗаполнено(Выборка.ДатаВыдачиКТКСТерминала) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаВыдачиКТКСТерминала; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.Выдан;
				КонецЕсли;   
			КонецЕсли; 
			
			//Доступен к выдаче, если релиз просрочен и нет даты выдачи
			Если не ЗначениеЗаполнено(Выборка.ДатаВыдачиКТКСТерминала) и Выборка.ДействиеРелизаОкончание <= ТекущаяДата() Тогда
				НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
				НССтатуса.КТК 					= Выборка.Контейнер;
				НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДействиеРелизаОкончание; 
				НССтатуса.Статус 				= Справочники.СтатусыКТК.ДоступенКВыдаче;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ДополнительныеСвойства <> Неопределено и ДополнительныеСвойства.Свойство("УдаленныеКТК") = Истина Тогда    
			ДатаУдаления = ТекущаяДата();
			Если ДополнительныеСвойства.Свойство("ДатаУдаления") = Истина Тогда
				ДатаУдаления = ДополнительныеСвойства.ДатаУдаления;
			КонецЕсли;
			Для каждого Контейнер Из ДополнительныеСвойства.УдаленныеКТК Цикл
				НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
				НССтатуса.КТК 					= Контейнер;
				НССтатуса.ДатаИзмененияСтатуса 	= ДатаУдаления; 
				НССтатуса.Статус 				= Справочники.СтатусыКТК.ДоступенКВыдаче;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаИзмененияСтатусов.Количество() Тогда
			ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов, Истина);
		КонецЕсли;
    #КонецОбласти 
	
	#Область Источник_РелизСобственника
	ИначеЕсли ТипЗнч(ИсточникЗаписи) = Тип("ДокументСсылка.РелизСобственника") Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизСобственникаНоминации.Ссылка.Проведен КАК ПроведенРелизСобственника,
		|	РелизСобственникаНоминации.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику,
		|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВзятия,
		|	КлючиАналитикиПеревозки.ДатаНачалаПеревозки КАК ДатаНачалаПеревозки,
		|	КлючиАналитикиПеревозки.ДатаОкончанияПеревозки КАК ДатаОкончанияПеревозки,
		|	КлючиАналитикиПеревозки.Заявка.Проведен КАК ЗаявкаПроведена,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО РелизСобственникаНоминации.Контейнер = КлючиАналитикиПеревозки.Контейнер
		|ГДЕ
		|	РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И РелизСобственникаНоминации.Ссылка = &Источник";
		Запрос.УстановитьПараметр("Источник", ИсточникЗаписи);
		Результат = Запрос.Выполнить(); 
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Если Выборка.ПроведенРелизСобственника Тогда
				Если ЗначениеЗаполнено(Выборка.ДатаВзятия) и не ЗначениеЗаполнено(Выборка.ДатаВозвратаСобственнику) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаВзятия; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.ВзятНаБаланс;
				КонецЕсли;   
				Если ЗначениеЗаполнено(Выборка.ДатаВозвратаСобственнику) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаВозвратаСобственнику; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.СнятСБаланса;
				КонецЕсли;
                Если ЗначениеЗаполнено(Выборка.ДатаНачалаПеревозки) и ЗначениеЗаполнено(Выборка.ЗаявкаПроведена) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаНачалаПеревозки; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.ПеревозкаНачата;
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.ДатаОкончанияПеревозки) Тогда
					НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
					НССтатуса.КТК 					= Выборка.Контейнер;
					НССтатуса.ДатаИзмененияСтатуса 	= Выборка.ДатаОкончанияПеревозки; 
					НССтатуса.Статус 				= Справочники.СтатусыКТК.ПеревозкаЗавершена;
				КонецЕсли;
			Иначе	
				ОчиститьЗаписиСтатусовПоИсточнику(ИсточникЗаписи);	
			КонецЕсли;
			
		КонецЦикла;  
		
		Если ДополнительныеСвойства <> Неопределено и ДополнительныеСвойства.Свойство("УдаленныеКТК") = Истина 
			и ДополнительныеСвойства.УдаленныеКТК.Количество() > 0 Тогда    
			ОчиститьЗаписиСтатусовПоИсточнику(ИсточникЗаписи, ДополнительныеСвойства.УдаленныеКТК);
		КонецЕсли;
	
        Если ТаблицаИзмененияСтатусов.Количество() Тогда
			ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов,,Истина);
		КонецЕсли;
	#КонецОбласти
	
	#Область Источник_УстановкаСтатусовКТК
	ИначеЕсли ТипЗнч(ИсточникЗаписи) = Тип("ДокументСсылка.УстановкаСтатусовКТК") Тогда	 
		
		Если ИсточникЗаписи.Проведен Тогда
			Для каждого СтрокаСтатуса Из ИсточникЗаписи.СтатусыКТКЦиклКлиента Цикл
				НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
				ЗаполнитьЗначенияСвойств(НССтатуса, СтрокаСтатуса);
				НССтатуса.ДатаИзмененияСтатуса 	= СтрокаСтатуса.ДатаУстановкиСтатуса;
			КонецЦикла; 
			
			Если ТаблицаИзмененияСтатусов.Количество() Тогда
				ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов,Истина);
			КонецЕсли;

			ТаблицаИзмененияСтатусов.Очистить();
			Для каждого СтрокаСтатуса Из ИсточникЗаписи.СтатусыКТКЦиклСобственника Цикл
				НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
				ЗаполнитьЗначенияСвойств(НССтатуса, СтрокаСтатуса);
				НССтатуса.ДатаИзмененияСтатуса 	= СтрокаСтатуса.ДатаУстановкиСтатуса;
			КонецЦикла; 
			Если ТаблицаИзмененияСтатусов.Количество() Тогда
				ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов,,Истина);
			КонецЕсли;
			
			ТаблицаИзмененияСтатусов.Очистить();
			ТаблицаИзмененияСтатусов.Колонки.Добавить("Поврежден");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("ПросроченСВВ");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("Другое");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("ОписаниеПричиныДругое");  
			ТаблицаИзмененияСтатусов.Колонки.Добавить("СостояниеРемонта");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("АвторУстановкиСтатуса");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("Разблокирован");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("ДатаПоврежден");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("ДатаПросроченСВВ");
			ТаблицаИзмененияСтатусов.Колонки.Добавить("ДатаДругое");
			Для каждого СтрокаСтатуса Из ИсточникЗаписи.СостояниеБлокировкиКТК Цикл
				НССтатуса = ТаблицаИзмененияСтатусов.Добавить();
				ЗаполнитьЗначенияСвойств(НССтатуса, СтрокаСтатуса);
				НССтатуса.ДатаИзмененияСтатуса 	= СтрокаСтатуса.ДатаУстановкиСтатуса;  
				НССтатуса.АвторУстановкиСтатуса = ИсточникЗаписи.Автор; 
			КонецЦикла; 
			Если ТаблицаИзмененияСтатусов.Количество() Тогда
				ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи,ТаблицаИзмененияСтатусов,,,Истина);
			КонецЕсли;
		Иначе
			ОчиститьЗаписиСтатусовПоИсточнику(ИсточникЗаписи);
		КонецЕсли;
		
	#КонецОбласти 
	
	КонецЕсли;   

КонецПроцедуры  
  
// Функция возвращает возможные разрешенные переходы от одного статуса КТК к другому
//
// Возвращаемое значение:
//   Соответствие   - Соответствие вида "Текущий статус КТК" - "массив доступных статусов для перехода"
//
Функция ПолучитьРазрешенныеПереходыСтатусовКТК()
	
	ПереходыСтатусовКТК = Новый Соответствие;      
	
	//Переходы со статуса Доступен к выдаче
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.ЗабронированКВыдаче); 
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Заблокирован);
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.СнятСБаланса);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.ДоступенКВыдаче, МассивДоступныхСтатусовКПереходу);
	
	//Переходы со статуса Забронирован к выдаче
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Выдан); 
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Заблокирован);
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.ДоступенКВыдаче);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.ЗабронированКВыдаче, МассивДоступныхСтатусовКПереходу); 
	
	//Переходы со статуса Выдан
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.ЗабронированКВыдаче); 
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Заблокирован);
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.ДоступенКВыдаче);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.Выдан, МассивДоступныхСтатусовКПереходу); 
	
	//Переходы со статуса Снят с баланса
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.ВзятНаБаланс); 
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Заблокирован);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.СнятСБаланса, МассивДоступныхСтатусовКПереходу);
	
	//Переходы со статуса Залокирован
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.НеЗаблокирован);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.Заблокирован, МассивДоступныхСтатусовКПереходу);

	//Переходы со статуса Не заблокирован
	МассивДоступныхСтатусовКПереходу = Новый Массив;  
	МассивДоступныхСтатусовКПереходу.Добавить(Справочники.СтатусыКТК.Заблокирован);
	ПереходыСтатусовКТК.Вставить(Справочники.СтатусыКТК.НеЗаблокирован, МассивДоступныхСтатусовКПереходу);

	Возврат ПереходыСтатусовКТК;
	
КонецФункции 

// Получение статусов КТК на заданную дату - статуса блокировки, клиентских и собственнических 
//
// Параметры:
//  МассивКТК  - Массив, Справочник.ТЕ - массив содержит элементы типа Справочник.ТЕ или один КТК
//                 
//  Период  - дата - дата, на которую необходимо определить статусы КТК
//
// Возвращаемое значение:
//   Массив   - полученные результаты статусов в массиве в порядке приоритета - 
//				0 - статусы блокировки (наивысший приоритет) - РС СостояниеБлокировкиКТК
// 				1 - клиентские статусы - РС СтатусыКТКЦиклКлиента
//				2 - собственнические статусы - РС СтатусыКТКЦиклСобственника
//
Функция ПолучитьТекущиеСтатусыКТКНаДату(МассивКТК, Период)
	

КонецФункции 

// Осуществляет запись нового статуса по КТК в регистры СтатусыКТКЦиклКлиента, СтатусыКТКЦиклСобственника, СостояниеБлокировкиКТК  
//
// Параметры: 
// 	ИсточникЗаписи				- документ или справочник, источник изменения статуса КТК
//  ТаблицаИзмененияСтатусов	- таблица значений - ТЗ с колонками "КТК", "ДатаИзмененияСтатуса", "Статус"     
//  Клиентский 					- Булево - запись статусов в РС СтатусыКТКЦиклКлиента, значение по умолчанию Ложь
//  Собственнический			- Булево - запись статусов в РС СтатусыКТКЦиклСобственника, значение по умолчанию Ложь  
//  Блокировка 					- Булево - запись статусов в РС СостояниеБлокировкиКТК, значение по умолчанию Ложь 
//
Процедура ДобавитьЗаписьСтатусаКТК(ИсточникЗаписи, ТаблицаИзмененияСтатусов, 
								   Клиентский = Ложь, Собственнический = Ложь, Блокировка = Ложь)
								   
	Если не Блокировка Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаИзмененияСтатусов.КТК КАК КТК,
			|	ТаблицаИзмененияСтатусов.Статус КАК Статус,
			|	ТаблицаИзмененияСтатусов.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса
			|ПОМЕСТИТЬ ВТ_НовыеДанные
			|ИЗ
			|	&ТаблицаИзмененияСтатусов КАК ТаблицаИзмененияСтатусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_НовыеДанные.КТК КАК КТК,
			|	ВТ_НовыеДанные.Статус КАК Статус,
			|	ВТ_НовыеДанные.ДатаИзмененияСтатуса КАК ДатаСтатуса,
			|	&ИсточникИзменения КАК ДокументРегистратор
			|ИЗ
			|	ВТ_НовыеДанные КАК ВТ_НовыеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияУстановкиСтатусовКТК.СрезПоследних(
			|				,
			|				(КТК, Статус) В
			|					(ВЫБРАТЬ
			|						т.КТК,
			|						т.Статус
			|					ИЗ
			|						ВТ_НовыеДанные КАК т)) КАК ИсторияУстановкиСтатусовКТКСрезПоследних
			|		ПО ВТ_НовыеДанные.КТК = ИсторияУстановкиСтатусовКТКСрезПоследних.КТК
			|			И ВТ_НовыеДанные.Статус = ИсторияУстановкиСтатусовКТКСрезПоследних.Статус
			|ГДЕ
			|	(ВТ_НовыеДанные.Статус <> ЕСТЬNULL(ИсторияУстановкиСтатусовКТКСрезПоследних.Статус, НЕОПРЕДЕЛЕНО)
			|			ИЛИ ИсторияУстановкиСтатусовКТКСрезПоследних.ДокументРегистратор <> &ИсточникИзменения
			|			ИЛИ ВТ_НовыеДанные.ДатаИзмененияСтатуса <> ЕСТЬNULL(ИсторияУстановкиСтатусовКТКСрезПоследних.ДатаСтатуса, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)))";
		
		Запрос.УстановитьПараметр("ТаблицаИзмененияСтатусов", ТаблицаИзмененияСтатусов);
		Запрос.УстановитьПараметр("ИсточникИзменения", ИсточникЗаписи);

		Результат = Запрос.Выполнить();
		АктуальныеСтатусыКТК = Результат.Выбрать();    
		
	КонецЕсли;
	
	Если Клиентский Тогда 
		НЗ = РегистрыСведений.СтатусыКТКЦиклКлиента.СоздатьНаборЗаписей();	
	ИначеЕсли Собственнический Тогда	
		НЗ = РегистрыСведений.СтатусыКТКЦиклСобственника.СоздатьНаборЗаписей();
	ИначеЕсли Блокировка Тогда
		НЗ = РегистрыСведений.СостояниеБлокировкиКТК.СоздатьНаборЗаписей();
	КонецЕсли;	
	НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);       
	
	НомерЗаписи = 0;   
	
	Если Блокировка Тогда
		ТаблицаИзмененияСтатусов.Свернуть("КТК,Статус,ОписаниеПричиныДругое,ДатаИзмененияСтатуса, Поврежден, ПросроченСВВ, Другое,Разблокирован,ДатаПоврежден,ДатаПросроченСВВ,ДатаДругое");	
	Иначе
		ТаблицаИзмененияСтатусов.Свернуть("КТК, ДатаИзмененияСтатуса, Статус");
	КонецЕсли;
	
	Для каждого СтрокаСтатуса Из ТаблицаИзмененияСтатусов Цикл 
		
		СделатьЗаписьИсторииИзмененияСтатусов = Ложь;
		
		//Запись в специализированный регистр, делаем всегда
		Если Блокировка Тогда
			ЗаписьСтатуса = НЗ.Добавить();
			Если Блокировка Тогда 
				ЗаписьСтатуса.ДатаПереноса = ИсточникЗаписи.Дата;
			КонецЕсли;
			ЗаписьСтатуса.Регистратор	= ИсточникЗаписи;
			ЗаписьСтатуса.Период       	= СтрокаСтатуса.ДатаИзмененияСтатуса; 
			ЗаписьСтатуса.АвторУстановкиСтатуса = ИсточникЗаписи.Автор;
			ЗаполнитьЗначенияСвойств(ЗаписьСтатуса, СтрокаСтатуса);  
			ЗаписьСтатуса.Статус = Справочники.СтатусыКТК.НеЗаблокирован;
			Если НЕ СтрокаСтатуса.Разблокирован И (ЗаписьСтатуса.Поврежден или ЗаписьСтатуса.ПросроченСВВ или ЗаписьСтатуса.Другое) Тогда
				ЗаписьСтатуса.Статус = Справочники.СтатусыКТК.Заблокирован;
			КонецЕсли;
			СтрокаСтатуса.Статус = ЗаписьСтатуса.Статус;
			
			ТекущийСтатусБлокировки = РегистрыСведений.СостояниеБлокировкиКТК.ПолучитьПоследнее(СтрокаСтатуса.ДатаИзмененияСтатуса, Новый Структура("КТК", СтрокаСтатуса.КТК));
			Если ЗаписьСтатуса.Статус <> ТекущийСтатусБлокировки.Статус Тогда
				СделатьЗаписьИсторииИзмененияСтатусов = Истина;
			КонецЕсли;
		Иначе
			ЗаписьСтатуса = НЗ.Добавить();
			Если Блокировка Тогда 
				ЗаписьСтатуса.ДатаПереноса = ИсточникЗаписи.Дата;
			КонецЕсли;
			ЗаписьСтатуса.Регистратор	= ИсточникЗаписи;
			ЗаписьСтатуса.КТК			= СтрокаСтатуса.КТК;
			ЗаписьСтатуса.Период       	= СтрокаСтатуса.ДатаИзмененияСтатуса; 
			ЗаписьСтатуса.Статус		= СтрокаСтатуса.Статус;      
			
			//Запись в историю установки статусов КТК, делаем если что то изменилось с последней записи
			Если АктуальныеСтатусыКТК.НайтиСледующий(Новый Структура("КТК, Статус", СтрокаСтатуса.КТК, СтрокаСтатуса.Статус)) Тогда
				СделатьЗаписьИсторииИзмененияСтатусов = Истина;	
			КонецЕсли;  
			АктуальныеСтатусыКТК.Сбросить();
		КонецЕсли;      
		
		Если СделатьЗаписьИсторииИзмененияСтатусов = Истина Тогда
			НЗИстории = РегистрыСведений.ИсторияУстановкиСтатусовКТК.СоздатьНаборЗаписей();  
			НЗИстории.Отбор.КТК.Установить(СтрокаСтатуса.КТК);   
			НЗИстории.Отбор.Статус.Установить(СтрокаСтатуса.Статус); 
			НЗИстории.Прочитать();
			
			ЗаписьИсторииСтатуса = НЗИстории.Добавить();
			ЗаписьИсторииСтатуса.Период = ТекущаяДата() + НомерЗаписи;
			ЗаписьИсторииСтатуса.ДатаСтатуса = СтрокаСтатуса.ДатаИзмененияСтатуса; 
			ЗаписьИсторииСтатуса.ДокументРегистратор = ИсточникЗаписи;
			ЗаписьИсторииСтатуса.КТК = СтрокаСтатуса.КТК;
			ЗаписьИсторииСтатуса.Статус = СтрокаСтатуса.Статус;  
			
			НЗИстории.Записать(Истина);
		КонецЕсли;
		
		НомерЗаписи = НомерЗаписи + 1;
	КонецЦикла;    
	
	НЗ.Записать(Истина); 
		
КонецПроцедуры 

Процедура ОчиститьЗаписиСтатусовПоИсточнику(ИсточникЗаписи, УдаленныеКТК = Неопределено)
	
	Если УдаленныеКТК = Неопределено Тогда
		
		НЗ = РегистрыСведений.СтатусыКТКЦиклКлиента.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
		НЗ.Записать();
		
		НЗ = РегистрыСведений.СтатусыКТКЦиклСобственника.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
		НЗ.Записать();  
		
		НЗ = РегистрыСведений.СостояниеБлокировкиКТК.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
		НЗ.Записать(); 
		
	Иначе
		Для каждого КТК Из УдаленныеКТК Цикл
			
			НЗ = РегистрыСведений.СтатусыКТКЦиклКлиента.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
			НЗ.Прочитать();			
			МассивСтрокКУдалению = Новый Массив;  
			НаборИзменен = Ложь;
			Для каждого Запись из НЗ Цикл
				Если Запись.КТК = КТК Тогда
					МассивСтрокКУдалению.Добавить(Запись);
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл
				НЗ.Удалить(СтрокаКУдалению);  
				НаборИзменен = Истина;
			КонецЦикла;  
			Если НаборИзменен Тогда
				НЗ.Записать();
			КонецЕсли;

			НЗ = РегистрыСведений.СтатусыКТКЦиклСобственника.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
			НЗ.Прочитать();			
			МассивСтрокКУдалению = Новый Массив;   
			НаборИзменен = Ложь;
			Для каждого Запись из НЗ Цикл
				Если Запись.КТК = КТК Тогда
					МассивСтрокКУдалению.Добавить(Запись);
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл
				НЗ.Удалить(СтрокаКУдалению); 
				НаборИзменен = Истина;
			КонецЦикла;
			Если НаборИзменен Тогда
				НЗ.Записать();
			КонецЕсли;

			НЗ = РегистрыСведений.СостояниеБлокировкиКТК.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ИсточникЗаписи);
			НЗ.Прочитать();			
			МассивСтрокКУдалению = Новый Массив;  
			НаборИзменен = Ложь;
			Для каждого Запись из НЗ Цикл
				Если Запись.КТК = КТК Тогда
					МассивСтрокКУдалению.Добавить(Запись);
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл
				НЗ.Удалить(СтрокаКУдалению); 
				НаборИзменен = Истина;
			КонецЦикла;
			Если НаборИзменен Тогда
				НЗ.Записать();
			КонецЕсли;

		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

Функция ТекущиеДанныеБлокировкиКонтейнера(КТК,Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеБлокировкиКТКСрезПоследних.КТК КАК КТК,
		|	СостояниеБлокировкиКТКСрезПоследних.Статус КАК Статус,
		|	СостояниеБлокировкиКТКСрезПоследних.Поврежден КАК Поврежден,
		|	СостояниеБлокировкиКТКСрезПоследних.ПросроченСВВ КАК ПросроченСВВ,
		|	СостояниеБлокировкиКТКСрезПоследних.Другое КАК Другое,
		|	СостояниеБлокировкиКТКСрезПоследних.ОписаниеПричиныДругое КАК ОписаниеПричиныДругое,
		|	СостояниеБлокировкиКТКСрезПоследних.СостояниеРемонта КАК СостояниеРемонта,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаПоврежден КАК ДатаПоврежден,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаПросроченСВВ КАК ДатаПросроченСВВ,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаДругое КАК ДатаДругое
		|ИЗ
		|	РегистрСведений.СостояниеБлокировкиКТКАктуальный.СрезПоследних(&Период, КТК = &КТК) КАК СостояниеБлокировкиКТКСрезПоследних";
	
	Запрос.УстановитьПараметр("КТК", КТК);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураОтвета = Новый Структура("КТК,Статус,Поврежден,ПросроченСВВ,Другое,ОписаниеПричиныДругое,СостояниеРемонта,ДатаПоврежден,ДатаПросроченСВВ,ДатаДругое");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СтруктураОтвета;

КонецФункции
#Область РегЗадание_УстановкаИСнятиеСтатусаЗаблокированКТК

//Евросиб(ДИТ) Антонова А.С. US 77172 10.03.2025
Процедура ЗапуститьУстановкуИСнятиеСтатусаЗаблокирован() Экспорт
	
	//Проверка даты СВВ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЕ.Ссылка КАК КТК,
	|	&ТекущаяДата КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.СтатусыКТК.Заблокирован) КАК Статус,
	|	ИСТИНА КАК ПросроченСВВ,
	|	""Автоматическая установка статуса регламентным заданием"" КАК Комментарий
	|ПОМЕСТИТЬ ВТ_КТКВСтатусеЗаблокированПоДатеСВВ
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	НЕ ТЕ.ПометкаУдаления
	|	И ТЕ.СВВ <= &ТекущаяДата
	|	И ТЕ.СВВ <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЕ.Ссылка,
	|	&ТекущаяДата,
	|	ЗНАЧЕНИЕ(Справочник.СтатусыКТК.НеЗаблокирован),
	|	ЛОЖЬ,
	|	""Автоматическая установка статуса регламентным заданием""
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	НЕ ТЕ.ПометкаУдаления
	|	И ТЕ.СВВ > &ТекущаяДата
	|	И ТЕ.СВВ <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.Период КАК ДатаУстановкиСтатуса,
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.КТК КАК КТК,
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.Статус КАК Статус,
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.Комментарий КАК Комментарий,
	|	ЛОЖЬ КАК Разблокирован,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.Другое, ЛОЖЬ) КАК Другое,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.Поврежден, ЛОЖЬ) КАК Поврежден,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.ОписаниеПричиныДругое, """") КАК ОписаниеПричиныДругое,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.СостояниеРемонта, """") КАК СостояниеРемонта,
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.ПросроченСВВ КАК ПросроченСВВ,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.ДатаПоврежден, ДатаВремя(1,1,1)) КАК ДатаПоврежден,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.ДатаПросроченСВВ, ДатаВремя(1,1,1)) КАК ДатаПросроченСВВ,
	|	ЕСТЬNULL(ТекущийСтатусБлокировки.ДатаДругое, ДатаВремя(1,1,1)) КАК ДатаДругое
	|ИЗ
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ КАК ВТ_КТКВСтатусеЗаблокированПоДатеСВВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеБлокировкиКТКАктуальный.СрезПоследних(
	|				&ТекущаяДата,
	|				КТК В
	|					(ВЫБРАТЬ
	|						Т.КТК
	|					ИЗ
	|						ВТ_КТКВСтатусеЗаблокированПоДатеСВВ КАК Т)) КАК ТекущийСтатусБлокировки
	|		ПО ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.КТК = ТекущийСтатусБлокировки.КТК
	//|			И ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.Статус = ТекущийСтатусБлокировки.Статус
	|ГДЕ
	|	ВТ_КТКВСтатусеЗаблокированПоДатеСВВ.ПросроченСВВ <> ЕСТЬNULL(ТекущийСтатусБлокировки.ПросроченСВВ,Ложь)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КТК,
	|	Статус";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();  
		
		ДокБлокировки = Документы.УстановкаСтатусовКТК.СоздатьДокумент();  
		ДокБлокировки.Дата = ТекущаяДата();
		Пока Выборка.Следующий() Цикл
			НС = ДокБлокировки.СостояниеБлокировкиКТК.Добавить();	
			ЗаполнитьЗначенияСвойств(НС, Выборка);
		КонецЦикла;
		ДокБлокировки.Комментарий = "Документ добавлен регламентным заданием ""Установка и снятие статуса заблокирован КТК""";   
		ДокБлокировки.Создано = ТекущаяДата();
		
		НачатьТранзакцию();
		Попытка
			ДокБлокировки.Записать(РежимЗаписиДокумента.Проведение);
		    ЗафиксироватьТранзакцию();
		Исключение
		    ЗаписьЖурналаРегистрации("Ошибки при установке/снятии статуса КТК заблокирован", 
						УровеньЖурналаРегистрации.Ошибка,,,
						"Не удалось записать документ установки статусов КТК по причине: " + ОписаниеОшибки());   
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


