
#Область ПрограммныйИнтерфейс

//Евросиб Каблов 17.11.2021 US 33698
// Вызывается из модуля ОтчетыКлиентПереопределяемый"
//
Функция СформироватьДанныеРасшифровкиОтчетаАнализДеятельности(Расшифровка, АдресРасшифровки) Экспорт
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);			
	СтруктураРасшифровки = Новый Структура;
	СтруктураРасшифровки.Вставить("ВыбранноеПоле");
	
	ПолучитьЗначенияПолей(СтруктураРасшифровки, ДанныеРасшифровки.Элементы, Расшифровка);
	
	ВыбранноеПоле = ДанныеРасшифровки.Элементы[Расшифровка]; 
	Если ТипЗнч(ВыбранноеПоле) <> Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Для Каждого Поле Из ВыбранноеПоле.ПолучитьПоля() Цикл
			Если ТипЗнч(Поле) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
				СтруктураРасшифровки.Вставить(СтрЗаменить(Поле.Поле,".",""), Поле.Значение);
				СтруктураРасшифровки.Вставить("ВыбранноеПоле", Поле.Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

// Получает значения всех вышестоящих группировок
//
// Параметры:
//		СписокПолей - Структура - Ключ имя поля, значение - значение группировочного поля отчета - параметр в который будет помещен список найденных значений
//		КоллекцияЭлементов - ЭлементыРасшифровкиКомпоновкиДанных - коллекция элементов расшифровки отчета (ДанныеРасшифровки.Элементы)
//		Идентификатор - ИдентификаторРасшифровкиКомпоновкиДанных - идентификатор расшифровываемого поля.
//
Процедура ПолучитьЗначенияПолей(СписокПолей, КоллекцияЭлементов, Идентификатор) Экспорт
	
	Для Каждого Родитель Из  КоллекцияЭлементов[Идентификатор].ПолучитьРодителей() Цикл
		ПолучитьЗначенияПолей(СписокПолей, КоллекцияЭлементов, Родитель.Идентификатор);
		ПолучитьЗначениеПоля(СписокПолей, Родитель);
	КонецЦикла;
	
КонецПроцедуры

// Получает значения полей текущего элемента расшифровки
//
// Параметры:
//		СписокПолей - Структура - Ключ имя поля, значение - значение группировочного поля отчета - параметр в который будет помещен список найденных значений
//		ВыбранноеПоле - ЭлементРасшифровкиКомпоновкиДанныхПоля - элемент расшифровки поля которого необходимо получить.
//
Процедура ПолучитьЗначениеПоля(СписокПолей, ВыбранноеПоле) Экспорт
	
	Если ТипЗнч(ВыбранноеПоле) <> Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Для Каждого Поле Из ВыбранноеПоле.ПолучитьПоля() Цикл
			Если ТипЗнч(Поле) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
				СписокПолей.Вставить(СтрЗаменить(Поле.Поле,".",""), Поле.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 24.10.2022 US 54532
Функция ВыгрузитьВExcel(КомпоновщикНастроек, АдресСхемы) Экспорт
	
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	СхемаКД = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	// ДИТ 0293853 Евсенкин М.А. Начало: 10.03.2023   // Фикс под ошибку "Неоднозначное выражение для расчета ресурса"
	ТЗПоляИтога = Новый ТаблицаЗначений;
	ТЗПоляИтога.Колонки.Добавить("ПутьКДанным");
	ТЗПоляИтога.Колонки.Добавить("Количество");
	Для Каждого Стр Из СхемаКД.ПоляИтога Цикл 
		Если Стр.Группировки.Количество() > 0 Тогда 
			НоваяСтрока = ТЗПоляИтога.Добавить();
			НоваяСтрока.ПутьКДанным = Стр.ПутьКДанным;
			НоваяСтрока.Количество = 1;  
		КонецЕсли;
	КонецЦикла;                
	ТЗПоляИтога.Свернуть("ПутьКДанным","Количество"); 
	МассивПолейКУдалению = Новый Массив;
	Для Каждого Стр Из СхемаКД.ПоляИтога Цикл 
		Найдено = ТЗПоляИтога.Найти(Стр.ПутьКДанным);
		Если Найдено <> Неопределено
			И Найдено.Количество > 1 Тогда 
			Если Стр.Выражение = "0"
				Или Стр.Выражение = """""" Тогда 
					МассивПолейКУдалению.Добавить(Стр);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;                                        
	Для Каждого Стр Из МассивПолейКУдалению Цикл 
		СхемаКД.ПоляИтога.Удалить(Стр);	
	КонецЦикла;	
	// ДИТ 0293853 Евсенкин М.А. Конец: 10.03.2023
	
	//Преобразование структуры отчета в плоскую таблицу
	Параметр = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Параметр.Использование = Истина;
	Параметр.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	
	ПоляГруппировок = Новый Массив;
	ВыбранныеПоля = Новый Массив;
	ЕстьАвтоВыбранноеПоле = Ложь;
	ПолучитьПоляСтруктурыНастроек(Настройки.Структура, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
	
	Если ЕстьАвтоВыбранноеПоле Тогда
		Для Каждого ВыбранноеПоле Из Настройки.Выбор.Элементы Цикл
			Если ВыбранноеПоле.Использование Тогда
				
				ДоступноеПоле = Настройки.ДоступныеПоляВыбора.Элементы.Найти(ВыбранноеПоле.Поле);
				Если ДоступноеПоле = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДоступноеПоле.Ресурс Тогда
					Если ВыбранныеПоля.Найти(ВыбранноеПоле.Поле) = Неопределено Тогда
						ВыбранныеПоля.Добавить(ВыбранноеПоле.Поле);
					КонецЕсли;
				КонецЕсли;
				
				ВыбранноеПоле.Использование = Ложь;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из Настройки.Структура Цикл
		ЭлементСтруктуры.Использование = Ложь;
	КонецЦикла;
	
	НовыйЭлемент = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	Для Каждого Поле Из ПоляГруппировок Цикл		
		НовоеПолеГруппировки = НовыйЭлемент.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Использование = Истина;
		НовоеПолеГруппировки.Поле = Поле;		
	КонецЦикла;
	
	Для Каждого Поле Из ВыбранныеПоля Цикл
		НовоеВыбранноеПоле = НовыйЭлемент.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеВыбранноеПоле.Использование = Истина;
		НовоеВыбранноеПоле.Поле = Поле;
	КонецЦикла;
	
	//Формирование табличного документа по настройкам компоновщика
	ВнешниеНаборыДанных = Новый Структура;			
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКД, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанных"));
	                           
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Преобразование в двоичные данные файла Excel
	ПотокФайла = Новый ПотокВПамяти();
	ТабДок.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.XLSX);
	ЧтениеПотока = Новый ЧтениеДанных(ПотокФайла);
	РезультатЧтения = ЧтениеПотока.Прочитать();
	ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

//Евросиб Каблов 24.10.2022 US 54532
Процедура ПолучитьПоляСтруктурыНастроек(Структура, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле)

	ОстальныеЭлементы = Новый Массив;
	Для Каждого ЭлементСтруктуры Из Структура Цикл		
		
		Если Не ЭлементСтруктуры.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			ПолучитьПоляСтруктурыНастроек(ЭлементСтруктуры.Строки, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
			ПолучитьПоляСтруктурыНастроек(ЭлементСтруктуры.Колонки, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
			
		Иначе
		
			Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если ПолеГруппировки.Использование Тогда
					Если ПоляГруппировок.Найти(ПолеГруппировки.Поле) = Неопределено Тогда
						ПоляГруппировок.Добавить(ПолеГруппировки.Поле);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ВыбранноеПоле Из ЭлементСтруктуры.Выбор.Элементы Цикл
				
				Если Не ВыбранноеПоле.Использование Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(ВыбранноеПоле) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
					ЕстьАвтоВыбранноеПоле = Истина;
					Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
						Если ПолеГруппировки.Использование Тогда
							Если ВыбранныеПоля.Найти(ПолеГруппировки.Поле) = Неопределено Тогда
								ВыбранныеПоля.Добавить(ПолеГруппировки.Поле);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
					ПолучитьПоляГруппыВыбранныхПолей(ЭлементСтруктуры, ВыбранноеПоле, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
				Иначе
					Если ВыбранныеПоля.Найти(ВыбранноеПоле.Поле) = Неопределено Тогда
						ВыбранныеПоля.Добавить(ВыбранноеПоле.Поле);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			ПолучитьПоляСтруктурыНастроек(ЭлементСтруктуры.Структура, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьПоляГруппыВыбранныхПолей(ЭлементСтруктуры, ГруппаВыбранныхПолей, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле)
	
	Для Каждого ВыбранноеПоле Из ГруппаВыбранныхПолей.Элементы Цикл
		
		Если Не ВыбранноеПоле.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ВыбранноеПоле) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ЕстьАвтоВыбранноеПоле = Истина;
			Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если ПолеГруппировки.Использование Тогда
					Если ПоляГруппировок.Найти(ПолеГруппировки.Поле) = Неопределено Тогда
						ПоляГруппировок.Добавить(ПолеГруппировки.Поле);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ПолучитьПоляГруппыВыбранныхПолей(ЭлементСтруктуры, ВыбранноеПоле, ПоляГруппировок, ВыбранныеПоля, ЕстьАвтоВыбранноеПоле);
		Иначе
			Если ВыбранныеПоля.Найти(ВыбранноеПоле.Поле) = Неопределено Тогда
				ВыбранныеПоля.Добавить(ВыбранноеПоле.Поле);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти