//Евросиб Шевченко А.В. US 112687 TA 120184 22.10.2025
Процедура ВыполнитьДвиженияПоРегиструСчетаПокупателей(ДокОбъект) Экспорт

	дСчетаПокупателей = ДокОбъект.Движения.СчетаПокупателей;
	дСчетаПокупателей.Записать();
	дСчетаПокупателей.Записывать = Истина;	
	
	Если ДокОбъект.СчетаНаОплатуПокупателям.Количество() Тогда
				
		Для Каждого СтрокаТз Из ДокОбъект.СчетаНаОплатуПокупателям Цикл
			Движение = дСчетаПокупателей.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Организация		= ДокОбъект.Организация;
			Движение.Контрагент 		= ДокОбъект.Контрагент;
			Движение.ДоговорКонтрагента = ДокОбъект.ДоговорКонтрагента;
			Движение.Период             = ДокОбъект.Дата;
			Движение.Номенклатура     	= СтрокаТз.Номенклатура;
			Движение.СчетПокупателю     = СтрокаТз.СчетПокупателю;
			Движение.Сумма 				= СтрокаТз.Сумма;
		КонецЦикла;	
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ       
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&ПериодДвижений КАК Период,
		|	СчетаПокупателейОбороты.Организация КАК Организация,
		|	СчетаПокупателейОбороты.Контрагент КАК Контрагент,
		|	СчетаПокупателейОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетаПокупателейОбороты.СчетПокупателю КАК СчетПокупателю,
		|	СчетаПокупателейОбороты.Номенклатура КАК Номенклатура,
		|	СчетаПокупателейОбороты.СуммаРасход КАК Сумма
		|ИЗ
		|	РегистрНакопления.СчетаПокупателей.Обороты(, , Регистратор, ) КАК СчетаПокупателейОбороты
		|ГДЕ 
		|	СчетаПокупателейОбороты.Регистратор = &Регистратор";
		Запрос.УстановитьПараметр("ПериодДвижений", ДокОбъект.Дата);    
		ИсходныйРТУ = ДокОбъект.ДокументРеализации;
		Пока Истина Цикл
			Если ТипЗнч(ИсходныйРТУ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
				ИсходныйРТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйРТУ, "ДокументРеализации");
			Иначе	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запрос.УстановитьПараметр("Регистратор", ИсходныйРТУ);
		ТаБлицаСчетаИсходная = Запрос.Выполнить().Выгрузить();
		
		Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			
			Для Каждого Стр Из ТаБлицаСчетаИсходная Цикл
				Движение = дСчетаПокупателей.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Организация		= ДокОбъект.Организация;
				Движение.Контрагент 		= ДокОбъект.Контрагент;
				Движение.ДоговорКонтрагента = ДокОбъект.ДоговорКонтрагента;
				Движение.Период             = Стр.Период;
				Движение.СчетПокупателю     = Стр.СчетПокупателю;
				Движение.Сумма 				= -Стр.Сумма;
				
				Движение = дСчетаПокупателей.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Организация		= ДокОбъект.Организация;
				Движение.Контрагент 		= ДокОбъект.Контрагент;
				Движение.ДоговорКонтрагента = ДокОбъект.ДоговорКонтрагента;
				Движение.Период             = Стр.Период;
				Движение.СчетПокупателю     = Стр.СчетПокупателю;
				ОтборПоНоменклатуре = Новый Структура("Номенклатура",Стр.Номенклатура);
				НайденныеСтроки = ДокОбъект.Услуги.НайтиСтроки(ОтборПоНоменклатуре);
				Для Каждого нСтрока Из НайденныеСтроки Цикл
					Движение.Сумма 		= нСтрока.Всего;                     
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			
			Для Каждого Стр Из ТаБлицаСчетаИсходная Цикл
				Движение = дСчетаПокупателей.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Организация		= ДокОбъект.Организация;
				Движение.Контрагент 		= ДокОбъект.Контрагент;
				Движение.ДоговорКонтрагента = ДокОбъект.ДоговорКонтрагента;
				Движение.Период             = Стр.Период;
				Движение.СчетПокупателю     = Стр.СчетПокупателю;
				Движение.Сумма 				= -Стр.Сумма;
				ОтборПоНоменклатуре = Новый Структура("Номенклатура",Стр.Номенклатура);
				НайденныеСтроки = ДокОбъект.Услуги.НайтиСтроки(ОтборПоНоменклатуре);
				Для Каждого нСтрока Из НайденныеСтроки Цикл
					Движение.Сумма 		= нСтрока.Всего - Стр.Сумма;                     
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
			
			дСчетаПокупателей.Загрузить(ПолучитьТаблицуДвиженийСчетаПокупателей(ДокОбъект));  
			
			// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
			ДокОбъект.Движения.СчетаПокупателейПоУчетнымЕдиницам.Записывать = Истина;
			ДокОбъект.Движения.СчетаПокупателейПоУчетнымЕдиницам.Загрузить(РегистрыНакопления.СчетаПокупателейПоУчетнымЕдиницам.ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам(ДокОбъект));   
			// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//Евросиб - АСуслов 17.03.2022 13:28:02 #
//(
Функция ПолучитьТаблицуДвиженийСчетаПокупателей(ДокОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ       
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ПериодДвижений КАК Период,
	|	СчетаПокупателейОбороты.Организация КАК Организация,
	//Евросиб СубботинВ #84453 02.07.2024 Начало // счета покупателей// убрал  сделку
	//|	СчетаПокупателейОбороты.Сделка КАК Сделка,
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	|	СчетаПокупателейОбороты.Контрагент КАК Контрагент,
	|	СчетаПокупателейОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетаПокупателейОбороты.СчетПокупателю КАК СчетПокупателю,
	|	СчетаПокупателейОбороты.Номенклатура КАК Номенклатура,
	|	-СчетаПокупателейОбороты.СуммаРасход КАК Сумма
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Обороты(, , Регистратор, ) КАК СчетаПокупателейОбороты
	|ГДЕ 
	|	СчетаПокупателейОбороты.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("ПериодДвижений", ДокОбъект.Дата);    
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 27.03.2024
	// Было:
	//Запрос.УстановитьПараметр("Регистратор", ДокументРеализации); 
	//Стало:
	ИсходныйРТУ = ДокОбъект.ДокументРеализации;
	Пока Истина Цикл
		Если ТипЗнч(ИсходныйРТУ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			ИсходныйРТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйРТУ, "ДокументРеализации");
		Иначе	
		    Прервать;
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("Регистратор", ИсходныйРТУ);
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 27.03.2024
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции

//)
//Евросиб - АСуслов 17.03.2022 13:28:02 #     

//Евросиб Шевченко А.В. US 112687 TA 120184 22.10.2025