
Процедура ПереносДанныхВЧистыйСток() Экспорт
	Документы.ПереносДанныхВЧистыйСток.СоздатьИЗаполнитьДокументПереносаДанных(Перечисления.ИсточникиДанныхИнформацииОтТерминалов.РучнаяЗагрузка);
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114251 17.07.2025
Процедура АннулированиеНеподтвержденнойИнформацииАвтоподрядчиков() Экспорт

	СрокПодтвержденияИнформации = Константы.СрокПодтвержденияИнформацииОтАвтоподрядчикаВТекущемСтокеЧасов.Получить();  
	
	Если не ЗначениеЗаполнено(СрокПодтвержденияИнформации) Тогда
		ЗаписьЖурналаРегистрации("Чистый сток. Аннулирование неподтвержденных строк автоподрядчиков", УровеньЖурналаРегистрации.Ошибка,,, 
				"Не заполнен срок подтверждения информации от автоподрядчиков! Выполнение аннулирования отменено.");
		Возврат;
	КонецЕсли;      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.ДатаОперации КАК ДатаОперации,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Контейнер КАК Контейнер,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Терминал КАК Терминал,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Состояние КАК Состояние,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_НеподтвержденныеСтроки
		|ИЗ
		|	РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам КАК ИнформацияОтАвтоподрядчиковПоТерминалам
		|ГДЕ
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.ТребуетсяПодтверждениеОперацииАвтоподрядчика
		|	И ДОБАВИТЬКДАТЕ(ИнформацияОтАвтоподрядчиковПоТерминалам.ДатаОперации, ЧАС, &СрокПодтверждения) < &ТекущаяДата
		|	И ИнформацияОтАвтоподрядчиковПоТерминалам.Статус В (ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт), ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта))
		|	И ИнформацияОтАвтоподрядчиковПоТерминалам.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И ИнформацияОтАвтоподрядчиковПоТерминалам.ПеренесенВЧистыйСток
		|	И (ИнформацияОтАвтоподрядчиковПоТерминалам.ОшибкиПриЗагрузкеИнформацииОтТерминалов = ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)
		|			ИЛИ ИнформацияОтАвтоподрядчиковПоТерминалам.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НеподтвержденныеСтроки.Терминал КАК Терминал,
		|	ВТ_НеподтвержденныеСтроки.Контейнер КАК Контейнер,
		|	ИнформацияОтТерминаловCodeco.ДатаОперации КАК ДатаОперации,
		|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов) КАК ИсточникДобавленияДанных,
		|	ВЫБОР
		|		КОГДА ВТ_НеподтвержденныеСтроки.Состояние
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
		|	КОНЕЦ КАК Состояние,
		|	ИнформацияОтТерминаловCodeco.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения
		|ПОМЕСТИТЬ ВТ_ПоискИнформацииТерминалов
		|ИЗ
		|	ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОтТерминаловCodeco КАК ИнформацияОтТерминаловCodeco
		|		ПО (ВТ_НеподтвержденныеСтроки.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ИнформацияОтТерминаловCodeco.ДатаОперации, ЧАС, -1) И ДОБАВИТЬКДАТЕ(ИнформацияОтТерминаловCodeco.ДатаОперации, ЧАС, 1))
		|			И ВТ_НеподтвержденныеСтроки.Контейнер = ИнформацияОтТерминаловCodeco.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = ИнформацияОтТерминаловCodeco.Терминал
		|			И ВТ_НеподтвержденныеСтроки.Состояние = ИнформацияОтТерминаловCodeco.Состояние
		|			И ВТ_НеподтвержденныеСтроки.Статус = ИнформацияОтТерминаловCodeco.Статус
		|			И (ИнформацияОтТерминаловCodeco.ПеренесенВЧистыйСток = ИСТИНА)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДатаОперации,
		|	Состояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеподтвержденныеСтроки.Контейнер КАК Контейнер,
		|	ВТ_НеподтвержденныеСтроки.Терминал КАК Терминал,
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации КАК ДатаОперации,
		|	ВТ_МестонахождениеАктуальное_отТерминалов.ДатаОперации КАК ДатаОперацииОтТерминала,
		|	ВТ_НеподтвержденныеСтроки.Состояние КАК Состояние,
		|	ВТ_НеподтвержденныеСтроки.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_ДанныеПодтверждены
		|ИЗ
		|	ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоискИнформацииТерминалов КАК ВТ_МестонахождениеАктуальное_отТерминалов
		|		ПО ВТ_НеподтвержденныеСтроки.Контейнер = ВТ_МестонахождениеАктуальное_отТерминалов.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = ВТ_МестонахождениеАктуальное_отТерминалов.Терминал
		|			И (ВТ_МестонахождениеАктуальное_отТерминалов.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_НеподтвержденныеСтроки.ДатаОперации, Час, -1) И ДОБАВИТЬКДАТЕ(ВТ_НеподтвержденныеСтроки.ДатаОперации, Час, 1))
		|			И (ВЫБОР
		|				КОГДА ВТ_НеподтвержденныеСтроки.Состояние
		|					ТОГДА ВТ_МестонахождениеАктуальное_отТерминалов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|				ИНАЧЕ ВТ_МестонахождениеАктуальное_отТерминалов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|					ТОГДА ВТ_МестонахождениеАктуальное_отТерминалов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ИНАЧЕ ВТ_МестонахождениеАктуальное_отТерминалов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			КОНЕЦ)
		|ГДЕ
		|	ВТ_МестонахождениеАктуальное_отТерминалов.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтатусыКТКЦиклСобственникаСрезПоследних.Регистратор КАК РелизСобственника,
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации КАК ДатаОперации,
		|	ДОБАВИТЬКДАТЕ(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ, РелизСобственникаНоминации.НормативВозврата) КАК РасчетнаяДатаСдачи,
		|	ДОБАВИТЬКДАТЕ(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ, РелизСобственникаНоминации.НормативВозврата - 5) КАК РасчетнаяДатаСдачиДо5Сут,
		|	ВТ_НеподтвержденныеСтроки.Контейнер КАК Контейнер,
		|	ВТ_НеподтвержденныеСтроки.Терминал КАК Терминал,
		|	РелизСобственникаНоминации.тек_СобственностьКТК КАК ВидСобственности,
		|	РелизСобственникаНоминации.Ссылка.ВозможныеСтокиСдачи КАК ВозможныеСтокиСдачи,
		|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
		|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня,
		|	ВТ_НеподтвержденныеСтроки.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВТ_СтрокиИсключения_1
		|ИЗ
		|	РегистрСведений.СтатусыКТКЦиклСобственника.СрезПоследних(
		|			,
		|			КТК В
		|				(ВЫБРАТЬ
		|					Т.Контейнер
		|				ИЗ
		|					ВТ_НеподтвержденныеСтроки КАК Т)) КАК СтатусыКТКЦиклСобственникаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
		|			ПО ВТ_НеподтвержденныеСтроки.Терминал = ИерархияЛокаций.Локация
		|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|		ПО (ВТ_НеподтвержденныеСтроки.Контейнер = СтатусыКТКЦиклСобственникаСрезПоследних.КТК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ПО СтатусыКТКЦиклСобственникаСрезПоследних.Регистратор = РелизСобственникаНоминации.Ссылка
		|			И (ВТ_НеподтвержденныеСтроки.Контейнер = РелизСобственникаНоминации.Контейнер)
		|ГДЕ
		|	РелизСобственникаНоминации.тек_СобственностьКТК В (ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Спот), ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.СпотДоплатный))
		|	И ВТ_НеподтвержденныеСтроки.Состояние = Ложь
		|	И РелизСобственникаНоминации.Ссылка.Активность <> ЗНАЧЕНИЕ(Перечисление.СтатусАктивностиРелиза.Закрыт)
		|	И ВТ_НеподтвержденныеСтроки.ДатаОперации >= ДОБАВИТЬКДАТЕ(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ, РелизСобственникаНоминации.НормативВозврата - 5) 
		|	И ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиИсключения_1.Контейнер КАК Контейнер,
		|	ВТ_СтрокиИсключения_1.ДатаОперации КАК ДатаОперации,
		|	ВТ_СтрокиИсключения_1.Терминал КАК Терминал,
		|	ВТ_СтрокиИсключения_1.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВТ_СтрокиИсключения
		|ИЗ
		|	ВТ_СтрокиИсключения_1 КАК ВТ_СтрокиИсключения_1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_СтрокиИсключения_1.Контейнер КАК Контейнер,
		|			ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
		|		ИЗ
		|			ВТ_СтрокиИсключения_1 КАК ВТ_СтрокиИсключения_1
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
		|					ПО МультилокацииЛокации.Локация = ИерархияЛокаций.Локация
		|						И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|				ПО ВТ_СтрокиИсключения_1.ВозможныеСтокиСдачи = МультилокацииЛокации.Ссылка
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВТ_СтрокиИсключения_1.Контейнер,
		|			ИерархияЛокаций.ЛокацияВышестоящегоУровня
		|		ИЗ
		|			ВТ_СтрокиИсключения_1 КАК ВТ_СтрокиИсключения_1
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
		|				ПО (ИерархияЛокаций.Локация = ВТ_СтрокиИсключения_1.ВозможныеСтокиСдачи)
		|					И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))) КАК ВложенныйЗапрос
		|		ПО ВТ_СтрокиИсключения_1.Контейнер = ВложенныйЗапрос.Контейнер
		|			И ВТ_СтрокиИсключения_1.ЛокацияВышестоящегоУровня = ВложенныйЗапрос.ЛокацияВышестоящегоУровня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НеподтвержденныеСтроки.Контейнер,
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации,
		|	ВТ_НеподтвержденныеСтроки.Терминал,
		|	ВТ_НеподтвержденныеСтроки.Состояние
		|ИЗ
		|	ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|		ПО ВТ_НеподтвержденныеСтроки.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
		|ГДЕ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Клиентский)
		|	И ВТ_НеподтвержденныеСтроки.Состояние = Ложь
		|	И ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации КАК ДатаОперации,
		|	ВТ_НеподтвержденныеСтроки.Контейнер КАК Контейнер,
		|	ВТ_НеподтвержденныеСтроки.Терминал КАК Терминал,
		|	ВТ_НеподтвержденныеСтроки.Состояние КАК Состояние,
		|	ВТ_НеподтвержденныеСтроки.Статус КАК Статус,
		|	МАКСИМУМ(МестонахождениеЧистыйСтокОстаткиИОбороты.Период) КАК ДатаОперацииПрихода
		|ПОМЕСТИТЬ ВТ_ПоискПредыдущегоПрихода
		|ИЗ
		|	ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.ОстаткиИОбороты(
		|				,
		|				,
		|				Регистратор,
		|				,
		|				(Контейнер, Терминал) В
		|					(ВЫБРАТЬ
		|						Т.Контейнер,
		|						Т.Терминал
		|					ИЗ
		|						ВТ_НеподтвержденныеСтроки КАК Т)) КАК МестонахождениеЧистыйСтокОстаткиИОбороты
		|		ПО ВТ_НеподтвержденныеСтроки.Контейнер = МестонахождениеЧистыйСтокОстаткиИОбороты.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = МестонахождениеЧистыйСтокОстаткиИОбороты.Терминал
		|			И ВТ_НеподтвержденныеСтроки.ДатаОперации > МестонахождениеЧистыйСтокОстаткиИОбороты.Период
		|			И (МестонахождениеЧистыйСтокОстаткиИОбороты.КоличествоПриход > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПодтверждены КАК ВТ_ДанныеПодтверждены
		|		ПО ВТ_НеподтвержденныеСтроки.ДатаОперации = ВТ_ДанныеПодтверждены.ДатаОперации
		|			И ВТ_НеподтвержденныеСтроки.Контейнер = ВТ_ДанныеПодтверждены.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = ВТ_ДанныеПодтверждены.Терминал
		|			И ВТ_НеподтвержденныеСтроки.Состояние = ВТ_ДанныеПодтверждены.Состояние
		|			И ВТ_НеподтвержденныеСтроки.Статус = ВТ_ДанныеПодтверждены.Статус
		|ГДЕ
		|	ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
		|	И МестонахождениеЧистыйСтокОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПереносДанныхВЧистыйСток
		|	И ВТ_ДанныеПодтверждены.Контейнер ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации,
		|	ВТ_НеподтвержденныеСтроки.Контейнер,
		|	ВТ_НеподтвержденныеСтроки.Терминал,
		|	ВТ_НеподтвержденныеСтроки.Состояние,
		|	ВТ_НеподтвержденныеСтроки.Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеподтвержденныеСтроки.ДатаОперации КАК ДатаОперации,
		|	ВТ_НеподтвержденныеСтроки.Контейнер КАК Контейнер,
		|	ВТ_НеподтвержденныеСтроки.Терминал КАК Терминал,
		|	ВТ_НеподтвержденныеСтроки.Состояние КАК Состояние,
		|	ВТ_НеподтвержденныеСтроки.Статус КАК Статус,
		|	1 КАК КоличествоОстаток
		|ИЗ
		|	ВТ_НеподтвержденныеСтроки КАК ВТ_НеподтвержденныеСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиИсключения КАК ВТ_СтрокиИсключения
		|		ПО ВТ_НеподтвержденныеСтроки.ДатаОперации = ВТ_СтрокиИсключения.ДатаОперации
		|			И ВТ_НеподтвержденныеСтроки.Контейнер = ВТ_СтрокиИсключения.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = ВТ_СтрокиИсключения.Терминал
		|			И ВТ_НеподтвержденныеСтроки.Состояние = ВТ_СтрокиИсключения.Состояние
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПодтверждены КАК ВТ_ДанныеПодтверждены
		|		ПО ВТ_НеподтвержденныеСтроки.ДатаОперации = ВТ_ДанныеПодтверждены.ДатаОперации
		|			И ВТ_НеподтвержденныеСтроки.Контейнер = ВТ_ДанныеПодтверждены.Контейнер
		|			И ВТ_НеподтвержденныеСтроки.Терминал = ВТ_ДанныеПодтверждены.Терминал
		|			И ВТ_НеподтвержденныеСтроки.Состояние = ВТ_ДанныеПодтверждены.Состояние
		|ГДЕ
		|	ВТ_СтрокиИсключения.Контейнер ЕСТЬ NULL
		|	И ВТ_НеподтвержденныеСтроки.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|	И ВТ_ДанныеПодтверждены.Контейнер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПодтверждены.Контейнер КАК Контейнер,
		|	ВТ_ДанныеПодтверждены.Терминал КАК Терминал,
		|	ВТ_ДанныеПодтверждены.ДатаОперации КАК ДатаОперации,
		|	ВТ_ДанныеПодтверждены.ДатаОперацииОтТерминала КАК ДатаОперацииОтТерминала,
		|	ВТ_ДанныеПодтверждены.Состояние КАК Состояние,
		|	ВТ_ДанныеПодтверждены.Статус КАК Статус
		|ИЗ
		|	ВТ_ДанныеПодтверждены КАК ВТ_ДанныеПодтверждены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиИсключения.Контейнер КАК Контейнер,
		|	ВТ_СтрокиИсключения.ДатаОперации КАК ДатаОперации,
		|	ВТ_СтрокиИсключения.Терминал КАК Терминал,
		|	ВТ_СтрокиИсключения.Состояние КАК Состояние
		|ИЗ
		|	ВТ_СтрокиИсключения КАК ВТ_СтрокиИсключения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоискПредыдущегоПрихода.ДатаОперации КАК ДатаОперации,
		|	ВТ_ПоискПредыдущегоПрихода.Контейнер КАК Контейнер,
		|	ВТ_ПоискПредыдущегоПрихода.Терминал КАК Терминал,
		|	ВТ_ПоискПредыдущегоПрихода.Состояние КАК Состояние,
		|	ВТ_ПоискПредыдущегоПрихода.Статус КАК Статус,
		|	ВТ_ПоискПредыдущегоПрихода.ДатаОперацииПрихода КАК ДатаОперацииПрихода,
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоОстаток,
		|	ДанныеПоОперациямЧистыйСток.Состояние КАК СостояниеПриход,
		|	ДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ДанныеПоОперациямЧистыйСток.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ДанныеПоОперациямЧистыйСток.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ДанныеПоОперациямЧистыйСток.КомментарийТерминала КАК КомментарийТерминала,
		|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ДанныеПоОперациямЧистыйСток.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ДанныеПоОперациямЧистыйСток.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ДанныеПоОперациямЧистыйСток.ФИОВодителя КАК ФИОВодителя,
		|	ДанныеПоОперациямЧистыйСток.НомерТранспорта КАК НомерТранспорта,
		|	ДанныеПоОперациямЧистыйСток.ВидТранспорта КАК ВидТранспорта,
		|	ДанныеПоОперациямЧистыйСток.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ДанныеПоОперациямЧистыйСток.Станция КАК Станция,
		|	ДанныеПоОперациямЧистыйСток.Контрагент КАК Контрагент,
		|	ДанныеПоОперациямЧистыйСток.Комбинированная КАК Комбинированная
		|ИЗ
		|	ВТ_ПоискПредыдущегоПрихода КАК ВТ_ПоискПредыдущегоПрихода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
		|		ПО (ДанныеПоОперациямЧистыйСток.Контейнер = ВТ_ПоискПредыдущегоПрихода.Контейнер)
		|			И (ДанныеПоОперациямЧистыйСток.ДатаОперации = ВТ_ПоискПредыдущегоПрихода.ДатаОперацииПрихода)
		//|			И (ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.ОстаткиИОбороты(
		|				,
		|				,
		|				Регистратор,
		|				,
		|				(Контейнер, Терминал) В
		|					(ВЫБРАТЬ
		|						Т.Контейнер,
		|						Т.Терминал
		|					ИЗ
		|						ВТ_ПоискПредыдущегоПрихода КАК Т)) КАК МестонахождениеЧистыйСтокОстаткиИОбороты
		|		ПО (МестонахождениеЧистыйСтокОстаткиИОбороты.Контейнер = ВТ_ПоискПредыдущегоПрихода.Контейнер)
		|			И ВТ_ПоискПредыдущегоПрихода.Терминал = МестонахождениеЧистыйСтокОстаткиИОбороты.Терминал
		|			И (МестонахождениеЧистыйСтокОстаткиИОбороты.Период = ВТ_ПоискПредыдущегоПрихода.ДатаОперацииПрихода)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСток
		|		ПО (МестонахождениеЧистыйСток.Контейнер = ВТ_ПоискПредыдущегоПрихода.Контейнер)
		|			И ВТ_ПоискПредыдущегоПрихода.Терминал = МестонахождениеЧистыйСток.Терминал
		|			И (МестонахождениеЧистыйСток.Период = ВТ_ПоискПредыдущегоПрихода.ДатаОперации)
		|			И (МестонахождениеЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись))
		|ГДЕ
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.КоличествоКонечныйОстаток > 0
		|	И МестонахождениеЧистыйСток.ИсточникДобавленияДанных ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СрокПодтверждения", СрокПодтвержденияИнформации);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаНеподтвержденныеЗавоз = РезультатыЗапросов[6].Выбрать(); 
	ВыборкаНеподтвержденныеВывоз = РезультатыЗапросов[9].Выбрать();
	ВыборкаПодтвержденные = РезультатыЗапросов[7].Выбрать(); 
	ВыборкаСтрокиИсключения = РезультатыЗапросов[8].Выбрать(); 
	
	Пока ВыборкаСтрокиИсключения.Следующий() Цикл  
		
		//в РС ИнформацияОтАвтоподрядчиковПоТерминалам делаем пометку, что не требуется подтверждение
		НЗ = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НЗ.Отбор.ДатаОперации.Установить(ВыборкаСтрокиИсключения.ДатаОперации); 
		НЗ.Отбор.Терминал.Установить(ВыборкаСтрокиИсключения.Терминал);
		НЗ.Отбор.Контейнер.Установить(ВыборкаСтрокиИсключения.Контейнер);   
		НЗ.Прочитать();
		Для каждого СтрокаНЗ Из НЗ Цикл
			СтрокаНЗ.ТребуетсяПодтверждениеОперацииАвтоподрядчика = Ложь;
		КонецЦикла;
		НЗ.ОбменДанными.Загрузка = Истина;
		НЗ.Записать();
		
		//информацию по завозу убираем из РС ДанныеПоОперациямЧистыйСтокАктуальный
		НЗ = РегистрыСведений.ДанныеПоОперациямЧистыйСтокАктуальный.СоздатьНаборЗаписей();
		НЗ.Отбор.ДатаОперации.Установить(ВыборкаСтрокиИсключения.ДатаОперации); 
		НЗ.Отбор.Терминал.Установить(ВыборкаСтрокиИсключения.Терминал);
		НЗ.Отбор.Контейнер.Установить(ВыборкаСтрокиИсключения.Контейнер);  
		НЗ.Прочитать(); 
		Если НЗ.Количество() > 0 и НЗ[0].Количество > 1 Тогда
			НЗ[0].Количество = НЗ[0].Количество - 1;
		Иначе
			НЗ.Очистить();	
		КонецЕсли;
		НЗ.Записать();
	КонецЦикла;
	
	Пока ВыборкаПодтвержденные.Следующий() Цикл
		//в РС ИнформацияОтАвтоподрядчиковПоТерминалам делаем пометку, что не требуется подтверждение
		НЗ = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НЗ.Отбор.ДатаОперации.Установить(ВыборкаПодтвержденные.ДатаОперации); 
		НЗ.Отбор.Терминал.Установить(ВыборкаПодтвержденные.Терминал);
		НЗ.Отбор.Контейнер.Установить(ВыборкаПодтвержденные.Контейнер);   
		НЗ.Прочитать();
		Для каждого СтрокаНЗ Из НЗ Цикл
			СтрокаНЗ.ТребуетсяПодтверждениеОперацииАвтоподрядчика = Ложь;
		КонецЦикла;
		НЗ.ОбменДанными.Загрузка = Истина;
		НЗ.Записать(); 
		
		//Убираем ошибку при загрузке информации от терминалов из записей от автоперевозчика
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(ВыборкаПодтвержденные.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(ВыборкаПодтвержденные.ДатаОперации);
		НаборИсточника.Отбор.Терминал.Установить(ВыборкаПодтвержденные.Терминал);
		НаборИсточника.Прочитать();
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда 
				ОбъектОшибки = СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПолучитьОбъект();  
				КоличествоСтрокИсправлено = 0;
				Для каждого СтрОшибки Из ОбъектОшибки.ОшибкиПриЗагрузке Цикл
					Если СтрОшибки.ТипОшибки = Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика Тогда
						СтрОшибки.Комментарий = "Запись подтверждена информацией от терминала";  
						КоличествоСтрокИсправлено = КоличествоСтрокИсправлено + 1;
					КонецЕсли;
				КонецЦикла; 
				Если КоличествоСтрокИсправлено = ОбъектОшибки.ОшибкиПриЗагрузке.Количество() Тогда
					ОбъектОшибки.ВсеОшибкиИсправлены = Истина; 
				КонецЕсли;
				ОбъектОшибки.Записать();
			КонецЕсли;
		КонецЕсли; 

	КонецЦикла;

	Пока ВыборкаНеподтвержденныеЗавоз.Следующий() Цикл 
		
		//Сторнируем местонахождение по завозу
		Параметры = Новый Структура("Контейнер,Терминал,ДатаОперации,КоличествоОстаток,ИсточникДобавленияДанных");  
		ЗаполнитьЗначенияСвойств(Параметры, ВыборкаНеподтвержденныеЗавоз); 
		Параметры.ИсточникДобавленияДанных = Справочники.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись;
		Отказ = Ложь;  
		
		Попытка
			ДокументРедактирования = Документы.РедактированиеДанныхЧистогоСтока.ВвестиДокументСторно(Параметры,Отказ);
		Исключение
			ШаблонОшибки = СтрШаблон("Не удалось сформировать сторно Контейнер:%1 ,Терминал:%2, ДатаОперации:%3, КоличествоОстаток:%4",
			ВыборкаНеподтвержденныеЗавоз.Контейнер,ВыборкаНеподтвержденныеЗавоз.Терминал,
			ВыборкаНеподтвержденныеЗавоз.ДатаОперации,ВыборкаНеподтвержденныеЗавоз.КоличествоОстаток);
			ВызватьИсключение(ШаблонОшибки);
		КонецПопытки;
		
		//Запись ошибки
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(ВыборкаНеподтвержденныеЗавоз.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(ВыборкаНеподтвержденныеЗавоз.ДатаОперации);
		НаборИсточника.Отбор.Терминал.Установить(ВыборкаНеподтвержденныеЗавоз.Терминал);
		НаборИсточника.Прочитать();
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если Не ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда
				СправочникОшибки = Документы.ПереносДанныхВЧистыйСток.СоздатьСправочникОшибки(Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика, Истина);	
				СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов = СправочникОшибки;
				НаборИсточника.ОбменДанными.Загрузка = Истина;
				НаборИсточника.Записать();
			Иначе
				СтрокиОшибок = СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ОшибкиПриЗагрузке; 
				СтрокиОшибокАвтоподрядчиков = СтрокиОшибок.НайтиСтроки(Новый Структура("ТипОшибки", Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика)); 
				Если СтрокиОшибокАвтоподрядчиков.Количество() = 0 Тогда
					Документы.ПереносДанныхВЧистыйСток.ДополнитьСправочникОшибки(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов,
					Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		//убираем из РС ДанныеПоОперациямЧистыйСтокАктуальный
		ПараметрыЗаполненияРегистраАктуальный = Новый Структура("Терминал, Контейнер", 
															ВыборкаНеподтвержденныеЗавоз.Терминал,
															ВыборкаНеподтвержденныеЗавоз.Контейнер);
		Документы.ПереносДанныхВЧистыйСток.ЗаполнитьРегистрАктуальный(Неопределено, ПараметрыЗаполненияРегистраАктуальный);
		
	КонецЦикла;  
	
	Пока ВыборкаНеподтвержденныеВывоз.Следующий() Цикл  
		
		//Сторнируем местонахождение по вывозу
		Параметры = Новый Структура("Контейнер,Терминал,ДатаОперации,КоличествоОстаток,ИсточникДобавленияДанных");  
		ЗаполнитьЗначенияСвойств(Параметры, ВыборкаНеподтвержденныеВывоз); 
		Параметры.ИсточникДобавленияДанных = Справочники.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись;
		Отказ = Ложь;  
		
		Попытка
			ДокументРедактирования = Документы.РедактированиеДанныхЧистогоСтока.ВвестиДокументСторно(Параметры,Отказ);
		Исключение
			ШаблонОшибки = СтрШаблон("Не удалось сформировать сторно Контейнер:%1 ,Терминал:%2, ДатаОперации:%3, КоличествоОстаток:%4",
			ВыборкаНеподтвержденныеВывоз.Контейнер,ВыборкаНеподтвержденныеВывоз.Терминал,
			ВыборкаНеподтвержденныеВывоз.ДатаОперации,ВыборкаНеподтвержденныеВывоз.КоличествоОстаток);
			ВызватьИсключение(ШаблонОшибки);
		КонецПопытки;
		
		//Запись ошибки
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(ВыборкаНеподтвержденныеВывоз.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(ВыборкаНеподтвержденныеВывоз.ДатаОперации);
		НаборИсточника.Отбор.Терминал.Установить(ВыборкаНеподтвержденныеВывоз.Терминал);
		НаборИсточника.Прочитать();
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если Не ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда
				СправочникОшибки = Документы.ПереносДанныхВЧистыйСток.СоздатьСправочникОшибки(Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика, Истина);	
				СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов = СправочникОшибки;
				НаборИсточника.ОбменДанными.Загрузка = Истина;
				НаборИсточника.Записать();
			Иначе
				СтрокиОшибок = СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ОшибкиПриЗагрузке; 
				СтрокиОшибокАвтоподрядчиков = СтрокиОшибок.НайтиСтроки(Новый Структура("ТипОшибки", Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика)); 
				Если СтрокиОшибокАвтоподрядчиков.Количество() = 0 Тогда
					Документы.ПереносДанныхВЧистыйСток.ДополнитьСправочникОшибки(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов,
					Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика, Истина);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;   
		
		//Восстановление наличия в актуальном, если был приход на Терминал до вывоза    
		ПараметрыЗаполненияРегистраАктуальный = Новый Структура("Терминал, Контейнер", 
															ВыборкаНеподтвержденныеВывоз.Терминал,
															ВыборкаНеподтвержденныеВывоз.Контейнер);
		Документы.ПереносДанныхВЧистыйСток.ЗаполнитьРегистрАктуальный(Неопределено, ПараметрыЗаполненияРегистраАктуальный);
		
	КонецЦикла;	
	
КонецПроцедуры
