
&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьПодбор();	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	// Евросиб Фролов (26.12.2021 TASK №44663: добавил в структуру "ГУИДСтрокиЗаявки".
	ТЗХранилище = ТЗКоносаменты.Выгрузить(ПараметрыОтбора,"Коносамент,
														  |Контейнер,
														  |МорскойРейс,
														  |ПортОтправления,
														  |ПортНазначения,
														  |Калькуляция,
														  // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
														//ок(
														//  |СобственностьПеревозимогоКТК,
														//ок)
														  |УдалитьСобственностьПеревозимогоКТК,
														  |ПринадлежностьТЕ,
														// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
														  |ГУИДСтрокиЗаявки,
														  //Евросиб - АСуслов 27.04.2022 11:46:45 #50462
														  //(
														  |ГУИД");
														  //)
														  //Евросиб - АСуслов 27.04.2022 11:46:46 #50462
														  
	ПоместитьВоВременноеХранилище(ТЗХранилище,КТКВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КТКВХранилище = Параметры.КТКВХранилище;
	ДанныеИзСделки = ПолучитьИзВременногоХранилища(КТКВХранилище);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВремТЧ.Коносамент КАК Коносамент,
	//               |	ВремТЧ.Контейнер КАК Контейнер,
	//               |	ВремТЧ.МорскойРейс КАК МорскойРейс
	//               |ПОМЕСТИТЬ ВТ
	//               |ИЗ
	//               |	&ВремТЧ КАК ВремТЧ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ.Контейнер КАК Контейнер,
	//               |	ТранспортныйДокументКоносаменты.Ссылка КАК Коносамент,
	//               |	МАКСИМУМ(ТранспортныйДокументКоносаменты.Ссылка.ДатаТранспортногоДокумента) КАК ДатаТранспортногоДокумента,
	//               |	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс КАК МорскойРейс
	//               |ИЗ
	//               |	ВТ КАК ВТ
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	//               |		ПО ВТ.Контейнер = ТранспортныйДокументКоносаменты.НомерКТК
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВТ.Контейнер,
	//               |	ТранспортныйДокументКоносаменты.Ссылка,
	//               |	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Коносамент УБЫВ";
	//Запрос.УстановитьПараметр("ВремТЧ",ДанныеИзСделки);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Евросиб Каблов 14.12.2022 ( 62718
	////Евросиб - АСуслов 27.04.2022 10:36:42 #50462
	////(
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК,
	//|	МАКСИМУМ(ТранспортныйДокументКоносаменты.Ссылка.ДатаТранспортногоДокумента) КАК ДатаТранспортногоДокумента
	//|ПОМЕСТИТЬ ВТ_КонтейнерыСДатамиТД
	//|ИЗ
	//|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	//|ГДЕ
	//|	ТранспортныйДокументКоносаменты.НомерКТК В(&СписокКТК)
	//|	И НЕ ТранспортныйДокументКоносаменты.Ссылка.ПометкаУдаления
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТранспортныйДокументКоносаменты.НомерКТК
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТранспортныйДокументКоносаменты.Ссылка КАК Коносамент,
	//|	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс КАК МорскойРейс,
	//|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияОтправления КАК ПортОтправления,
	//|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияНазначения КАК ПортНазначения,
	//|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК
	//|ИЗ
	//|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтейнерыСДатамиТД КАК ВТ_КонтейнерыСДатамиТД
	//|		ПО ТранспортныйДокументКоносаменты.НомерКТК = ВТ_КонтейнерыСДатамиТД.НомерКТК
	//|			И ТранспортныйДокументКоносаменты.Ссылка.ДатаТранспортногоДокумента = ВТ_КонтейнерыСДатамиТД.ДатаТранспортногоДокумента
	//|ГДЕ
	//|	ТранспортныйДокументКоносаменты.НомерКТК В(&СписокКТК)
	//|	И НЕ ТранспортныйДокументКоносаменты.Ссылка.ПометкаУдаления";
	
	//ДИТ, Давудов МА, Ticket#0287956, 11-04-2023, начало
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТранспортныйДокументКоносаменты.Ссылка КАК Коносамент,
	//|	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс КАК МорскойРейс,
	//|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияОтправления КАК ПортОтправления,
	//|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияНазначения КАК ПортНазначения,
	//|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК
	//|ИЗ
	//|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	//|ГДЕ
	//|	ТранспортныйДокументКоносаменты.НомерКТК В(&СписокКТК)
	//|	И НЕ ТранспортныйДокументКоносаменты.Ссылка.ПометкаУдаления
	//|	И ТранспортныйДокументКоносаменты.Ссылка.ДатаТранспортногоДокумента >= &ДатаНачалаПоиска";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеИзСделки.Контейнер КАК Контейнер,
	|	ДанныеИзСделки.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ ВТ_ДанныеИзСделки
	|ИЗ
	|	&ДанныеИзСделки КАК ДанныеИзСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзСделки.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзСделки.Калькуляция КАК Калькуляция,
	//|	ВЫБОР
	//|		КОГДА ДокументКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ИмпортМоре,
	//|	ВЫБОР
	//|		КОГДА ДокументКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЭкспортМоре,
	//|	ВЫБОР
	//|		КОГДА ДокументКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)
	//|				ИЛИ ДокументКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК БезОтбораПоПорту,
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, начало
	|	ДокументКалькуляция.ФрахтИмпорт КАК ФрахтИмпорт,
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, конец
	|	ЕСТЬNULL(КалькуляцияНФ_ПортыОтправленияНазначения.Порт, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПортОтправления
	|ПОМЕСТИТЬ ВТ_ДанныеОтбораКоносаметов
	|ИЗ
	|	ВТ_ДанныеИзСделки КАК ВТ_ДанныеИзСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ПортыОтправленияНазначения КАК КалькуляцияНФ_ПортыОтправленияНазначения
	|			ПО ДокументКалькуляция.Ссылка = КалькуляцияНФ_ПортыОтправленияНазначения.Ссылка
	|		ПО ВТ_ДанныеИзСделки.Калькуляция = ДокументКалькуляция.Ссылка 
	//Евросиб - АСуслов 30.08.2023 12:00:18 #73836
	//(
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзСделки.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзСделки.Калькуляция КАК Калькуляция,
	|	Истина,
	|   КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления
	|ИЗ
	|	ВТ_ДанныеИзСделки КАК ВТ_ДанныеИзСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_ДанныеИзСделки.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_ДанныеИзСделки.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|ГДЕ
	|  	КалькуляцияНФ_ВыбранныеСтавки.Ссылка ЕСТЬ NULL
	//)
	//Евросиб - АСуслов 30.08.2023 12:00:33 #73836
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныйДокументКоносаменты.Ссылка КАК Коносамент,
	|	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс КАК МорскойРейс,
	|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияОтправления КАК ПортОтправления,
	|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияНазначения КАК ПортНазначения, 
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024
	|	ТранспортныйДокументКоносаменты.Ссылка.МестоПолученияГруза КАК МорскойТерминалОтправления,
	|	ТранспортныйДокументКоносаменты.Ссылка.МестоПоставкиГруза КАК МорскойТерминалНазначения,
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
	|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК
	|ПОМЕСТИТЬ ВТ_Коносаменты
	|ИЗ
	|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты   
	//// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеМорскихРейсов КАК ДанныеМорскихРейсов
	//|		ПО (ДанныеМорскихРейсов.МорскойРейс = ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс)
	//// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
	|ГДЕ
	|	НЕ ТранспортныйДокументКоносаменты.Ссылка.ПометкаУдаления
	|	И ТранспортныйДокументКоносаменты.Ссылка.Создано >= &ДатаНачалаПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ      
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024
	|	2 КАК Приоритет,
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
	|	ВТ_Коносаменты.Коносамент КАК Коносамент,
	|	ВТ_Коносаменты.МорскойРейс КАК МорскойРейс,
	|	ВТ_Коносаменты.ПортОтправления КАК ПортОтправления,
	|	ВТ_Коносаменты.ПортНазначения КАК ПортНазначения,
	|	ВТ_Коносаменты.НомерКТК КАК НомерКТК
	|ИЗ
	|	ВТ_Коносаменты КАК ВТ_Коносаменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОтбораКоносаметов КАК ВТ_ДанныеОтбораКоносаметов
	|		ПО ВТ_Коносаменты.НомерКТК = ВТ_ДанныеОтбораКоносаметов.Контейнер
	|			И ВТ_Коносаменты.ПортНазначения = ВТ_ДанныеОтбораКоносаметов.ПортОтправления
	//|			И (ВТ_ДанныеОтбораКоносаметов.ИмпортМоре)
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, начало (для Экспорта соединяем по ПортНазначения в Коносаменте
	|			И НЕ (ВТ_ДанныеОтбораКоносаметов.ФрахтИмпорт)
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ   
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024
	|	2 КАК Приоритет,
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
	|	ВТ_Коносаменты.Коносамент,
	|	ВТ_Коносаменты.МорскойРейс,
	|	ВТ_Коносаменты.ПортОтправления,
	|	ВТ_Коносаменты.ПортНазначения,
	|	ВТ_Коносаменты.НомерКТК
	|ИЗ
	|	ВТ_Коносаменты КАК ВТ_Коносаменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОтбораКоносаметов КАК ВТ_ДанныеОтбораКоносаметов
	|		ПО ВТ_Коносаменты.НомерКТК = ВТ_ДанныеОтбораКоносаметов.Контейнер
	|			И ВТ_Коносаменты.ПортОтправления = ВТ_ДанныеОтбораКоносаметов.ПортОтправления
	//|			И (ВТ_ДанныеОтбораКоносаметов.ЭкспортМоре)
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, начало (для Иморта соединяем по ПортОтправления в Коносаменте
	|			И (ВТ_ДанныеОтбораКоносаметов.ФрахтИмпорт)
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, конец
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, закомментировал (
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_Коносаменты.Коносамент,
	//|	ВТ_Коносаменты.МорскойРейс,
	//|	ВТ_Коносаменты.ПортОтправления,
	//|	ВТ_Коносаменты.ПортНазначения,
	//|	ВТ_Коносаменты.НомерКТК
	//|ИЗ
	//|	ВТ_Коносаменты КАК ВТ_Коносаменты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОтбораКоносаметов КАК ВТ_ДанныеОтбораКоносаметов
	//|		ПО ВТ_Коносаменты.НомерКТК = ВТ_ДанныеОтбораКоносаметов.Контейнер
	//|			И (ВТ_ДанныеОтбораКоносаметов.БезОтбораПоПорту)
	//ДИТ, Беляев СЮ, Ticket#0307857, 17-04-2023, закомментировал ) 
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ  
	|	1,
	|	ВТ_Коносаменты.Коносамент,
	|	ВТ_Коносаменты.МорскойРейс,
	|	ВТ_Коносаменты.ПортОтправления,
	|	ВТ_Коносаменты.ПортНазначения,
	|	ВТ_Коносаменты.НомерКТК
	|ИЗ
	|	ВТ_Коносаменты КАК ВТ_Коносаменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОтбораКоносаметов КАК ВТ_ДанныеОтбораКоносаметов
	|		ПО ВТ_Коносаменты.НомерКТК = ВТ_ДанныеОтбораКоносаметов.Контейнер
	|			И ВТ_Коносаменты.МорскойТерминалНазначения = ВТ_ДанныеОтбораКоносаметов.ПортОтправления
	|			И (НЕ ВТ_ДанныеОтбораКоносаметов.ФрахтИмпорт)
	|
	|ОБЪЕДИНИТЬ ВСЕ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	1,
	|	ВТ_Коносаменты.Коносамент,
	|	ВТ_Коносаменты.МорскойРейс,
	|	ВТ_Коносаменты.ПортОтправления,
	|	ВТ_Коносаменты.ПортНазначения,
	|	ВТ_Коносаменты.НомерКТК
	|ИЗ
	|	ВТ_Коносаменты КАК ВТ_Коносаменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОтбораКоносаметов КАК ВТ_ДанныеОтбораКоносаметов
	|		ПО ВТ_Коносаменты.НомерКТК = ВТ_ДанныеОтбораКоносаметов.Контейнер
	|			И ВТ_Коносаменты.МорскойТерминалОтправления = ВТ_ДанныеОтбораКоносаметов.ПортОтправления
	|			И (ВТ_ДанныеОтбораКоносаметов.ФрахтИмпорт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
	|";
	//ДИТ, Давудов МА, Ticket#0287956, 11-04-2023, конец
	
	Запрос.УстановитьПараметр("ДатаНачалаПоиска", ДобавитьМесяц(ТекущаяДата(), -3));
	//Евросиб Каблов 14.12.2022 )
	
	//ДИТ, Давудов МА, Ticket#0287956, 11-04-2023, начало
	//Запрос.УстановитьПараметр("СписокКТК", ДанныеИзСделки.ВыгрузитьКолонку("Контейнер"));
	Запрос.УстановитьПараметр("ДанныеИзСделки", ДанныеИзСделки);
	//ДИТ, Давудов МА, Ticket#0287956, 11-04-2023, конец   
	//Евросиб - АСуслов 30.08.2023 12:48:39 #73836
	//(
	Запрос.УстановитьПараметр("УслугаФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	//)
	//Евросиб - АСуслов 30.08.2023 12:48:41 #73836
    ТаблицаКоносаментов = Запрос.Выполнить().Выгрузить();
	
	//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, начало
	ДанныеИзСделки.Колонки.Добавить("СписокКоносаментов", Новый ОписаниеТипов("СписокЗначений"));
	ДанныеИзСделки.Колонки.Добавить("ПодобранныеКоносаменты", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, конец
	
	Для каждого Стр из ДанныеИзСделки Цикл
		
		//Запрос.УстановитьПараметр("НомерКТК", Стр.Контейнер);
		//Ответ = Запрос.Выполнить().Выбрать();
		//Если Ответ.Следующий() Тогда
		//	
		//	ЗаполнитьЗначенияСвойств(Стр, Ответ);
		//	
		//КонецЕсли;                                   
		
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 01.11.2024 
		//в запросе выбираем коносаменты по приоритетам, в подобранный берем первый, все остальное + первый в список коносаментов
		// Было:
		////Евросиб Каблов 14.12.2022 ( 62718
		////СтрокаКоносамент = ТаблицаКоносаментов.Найти(Стр.Контейнер, "НомерКТК");
		////Если ЗначениеЗаполнено(СтрокаКоносамент) Тогда
		//СтрокиКоносамент = ТаблицаКоносаментов.НайтиСтроки(Новый Структура("НомерКТК", Стр.Контейнер));
		//Если СтрокиКоносамент.Количество() = 1 Тогда
		//	СтрокаКоносамент = СтрокиКоносамент[0];
		////Евросиб Каблов 14.12.2022 )
		//	ЗаполнитьЗначенияСвойств(Стр, СтрокаКоносамент);
		//	//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, начало
		//	Стр.ПодобранныеКоносаменты = Строка(Стр.Коносамент);
		//	//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, конец
		//КонецЕсли;
		//
		////ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, начало
		//Для Каждого СтрокаКоносамент Из СтрокиКоносамент Цикл
		//	Стр.СписокКоносаментов.Добавить(СтрокаКоносамент.Коносамент);
		//КонецЦикла;
		//Если Стр.СписокКоносаментов.Количество( )> 1 Тогда
		//	Стр.ПодобранныеКоносаменты = "Выберите из " + Стр.СписокКоносаментов.Количество();
		//КонецЕсли;
		////ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, конец 
		//Стало:
		СтрокиКоносамент = ТаблицаКоносаментов.НайтиСтроки(Новый Структура("НомерКТК", Стр.Контейнер)); 
		ПервыйПодобран = Ложь;
		Для каждого СтрокаКоносамент Из СтрокиКоносамент Цикл
			Если не ПервыйПодобран Тогда
			    ЗаполнитьЗначенияСвойств(Стр, СтрокаКоносамент);
				Стр.ПодобранныеКоносаменты = Строка(Стр.Коносамент);
				ПервыйПодобран = Истина;	
			КонецЕсли; 
			Если Стр.СписокКоносаментов.НайтиПоЗначению(СтрокаКоносамент.Коносамент) = Неопределено Тогда
				Стр.СписокКоносаментов.Добавить(СтрокаКоносамент.Коносамент);
			КонецЕсли;
		КонецЦикла;
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 01.11.2024
		
	КонецЦикла;

	ТЗКоносаменты.Загрузить(ДанныеИзСделки);
	
	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Стр Из ТЗКоносаменты Цикл
		Если ЗначениеЗаполнено(Стр.Коносамент) Тогда
			Стр.Отметка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого Стр Из ТЗКоносаменты Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЗКоносаментыКоносаментПриИзменении(Элемент)
	ТекД = Элементы.ТЗКоносаменты.ТекущиеДанные;
	РеквизитыКоносамента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекД.Коносамент, "СтанцияОтправления, СтанцияНазначения");
	ТекД.ПортОтправления = РеквизитыКоносамента.СтанцияОтправления;
	ТекД.ПортНазначения = РеквизитыКоносамента.СтанцияНазначения;
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, начало
&НаКлиенте
Процедура ТЗКоносаментыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если  Поле.Имя = "ТЗКоносаментыПодобранныеКоносаменты" Тогда
		СтандартнаяОбработка = Ложь;
		Если СтрНайти(Элемент.ТекущиеДанные.ПодобранныеКоносаменты, "Выберите") > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораКоносаментаИзСписка", ЭтотОбъект);
			Элементы.ТЗКоносаменты.ТекущиеДанные.СписокКоносаментов.ПоказатьВыборЭлемента(Оповещение, "Выберите коносамент");
		ИначеЕсли СтрНайти(Элемент.ТекущиеДанные.ПодобранныеКоносаменты, "Коносамент" ) > 0 Тогда
			КоносаментИзСписка = Элементы.ТЗКоносаменты.ТекущиеДанные.СписокКоносаментов[0].Значение;
			Элементы.ТЗКоносаменты.ТекущиеДанные.Коносамент = КоносаментИзСписка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, конец

//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, начало
&НаКлиенте
Процедура ПослеВыбораКоносаментаИзСписка(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент <> Неопределено Тогда
        Элементы.ТЗКоносаменты.ТекущиеДанные.Коносамент = ВыбранныйЭлемент.Значение;
		ТЗКоносаментыКоносаментПриИзменении(Неопределено);
    КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0304948, 23-03-2023, конец     
