
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОтображения.ДатаНачала = ТекущаяДата()-24*3600;
	ПериодОтображения.ДатаОкончания = ТекущаяДата()+7*24*3600;
	
	МоиДокументыПапки.Параметры.УстановитьЗначениеПараметра("МоиДокументыПапка", ПараметрыСеанса.ТекущийПользователь.КорневойКаталогДокументовВВебе);
	Элементы.ГруппаДокументыПользователя.Видимость = ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.КорневойКаталогДокументовВВебе);
	ПараметрыОтправки = РаботаСФайламиСлужебный.ПодготовитьСтруктуруПараметровОтправки();
	
	ЗаполнениеНачальнымиДанными();
	
	АРМ_Сервер.СозданиеОтчетовДляАРМ(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеНачальнымиДанными()
	
	Клиент = Пользователи.ТекущийПользователь();
	Элементы.ГруппаКлиентИнфо.Заголовок = Клиент;
	
	ЗаполнитьКонтрагента();
	
	ПСЦДоговоры.Параметры.УстановитьЗначениеПараметра("Контрагент",Контрагент);
	ФинДокументы.Параметры.УстановитьЗначениеПараметра("Контрагент",Контрагент);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Контрагент",Контрагент);
	
	Дислокация.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Дислокация.Параметры.УстановитьЗначениеПараметра("Клиент", Контрагент);
	
	СписокАрхив = Новый СписокЗначений;
	СписокАрхив.Добавить(Метаданные.Документы.СчетНаОплатуПоставщика);
	
	УстановитьОтборыДинСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОткрытьФорму("Отчет."+ Элемент.Имя +".Форма");
	
КонецПроцедуры

&НаСервере
Функция ЗонаРискаКонтрагента()
	
	ЗонаРиска = Новый Массив;
	
	// Запрос по красной зоне
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	СтопЛистКонтрагентовСрезПоследних.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.СтопЛистКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтопЛистКонтрагентовСрезПоследних
	               |ГДЕ
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗонаРиска.Добавить("Красная");
		ЗонаРиска.Добавить(Выборка.Комментарий);
	КонецЕсли;
	
	Если ЗонаРиска.Количество()=0 Тогда
		// Запрос по желтой зоне
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор КАК Договор,
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю КАК СчетПокупателю,
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК НеразнесеннаяСуммаОстаток,
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты КАК СрокОплаты,
		               |	РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) КАК ПрошлоВремени,
		               |	ВЫБОР
		               |		КОГДА РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты > РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ)
		               |			ТОГДА 0
		               |		ИНАЧЕ РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) - РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты
		               |	КОНЕЦ КАК ПросрочкаПлатежа,
		               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор.Номер КАК НомерДоговора
		               |ПОМЕСТИТЬ НеоплаченныеСчета
		               |ИЗ
		               |	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки(, Контрагент = &Контрагент) КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НеоплаченныеСчета.Контрагент КАК Контрагент
		               |ИЗ
		               |	НеоплаченныеСчета КАК НеоплаченныеСчета
		               |ГДЕ
		               |	НеоплаченныеСчета.ПросрочкаПлатежа МЕЖДУ 1 И 30";
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			ЗонаРиска.Добавить("Желтый");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗонаРиска;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	Контрагенты.ИНН КАК ИНН
	               |ПОМЕСТИТЬ КонтрагентыСпр
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.Ссылка = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток,
	               |	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ СПокупателями
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	               |			,
	               |			Контрагент В
	               |				(ВЫБРАТЬ
	               |					КонтрагентыСпр.Контрагент
	               |				ИЗ
	               |					КонтрагентыСпр КАК КонтрагентыСпр)) КАК ВзаиморасчетыСПокупателямиОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток,
	               |	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ СПоставщиками
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
	               |			,
	               |			Контрагент В
	               |				(ВЫБРАТЬ
	               |					КонтрагентыСпр.Контрагент
	               |				ИЗ
	               |					КонтрагентыСпр КАК КонтрагентыСпр)) КАК ВзаиморасчетыСПоставщикамиОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(СПокупателями.СуммаСНДСОстаток,0) + ЕСТЬNULL(СПоставщиками.СуммаСНДСОстаток,0)) КАК Баланс,
	               |	КонтрагентыСпр.Контрагент КАК Контрагент,
	               |	КонтрагентыСпр.ИНН КАК ИНН
	               |ИЗ
	               |	КонтрагентыСпр КАК КонтрагентыСпр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СПокупателями КАК СПокупателями
	               |		ПО КонтрагентыСпр.Контрагент = СПокупателями.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СПоставщиками КАК СПоставщиками
	               |		ПО КонтрагентыСпр.Контрагент = СПоставщиками.Контрагент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрагентыСпр.Контрагент,
	               |	КонтрагентыСпр.ИНН";
	
	Запрос.УстановитьПараметр("Контрагент",Клиент.АссоциированныйКонтрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтображенияПриИзменении(Элемент)
	
	УстановитьОтборыДинСписков();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинСписков()
	
	// Заявки
	Заявки.Отбор.Элементы.Очистить();    

	ГруппаОтбора = Заявки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Родитель = ГруппаОтбора;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаНачала;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Родитель = ГруппаОтбора;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаОкончания;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Родитель = ГруппаОтбора;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Контрагент;

	// Запросы
	СписокЗапросы.Отбор.Элементы.Очистить();    

	ГруппаОтбора = СписокЗапросы.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаНачала;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаОкончания;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Контрагент;
	
	// ПСЦ и договоры
	ПСЦДоговоры.Отбор.Элементы.Очистить();    

	ГруппаОтбора = ПСЦДоговоры.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаНачала;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаОкончания;
	
	// Архивные документы
	СписокДокументов.Отбор.Элементы.Очистить();    

	ГруппаОтбора = СписокДокументов.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаНачала;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаОкончания;
	
	// ФинДокументы 
	ФинДокументы.Отбор.Элементы.Очистить();    

	ГруппаОтбора = ФинДокументы.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаНачала;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПериодОтображения.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнениеНачальнымиДанными();
	ОтображениеКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.СписокДокументов.ТекущиеДанные;
	ПоказатьЗначение(,ТекД.Ссылка);
	
	//ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока, Неопределено, УникальныйИдентификатор);
	//
	//РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	//ОткрытьФорму("Обработка.Чат.Форма.Форма");
	
КонецПроцедуры


&НаКлиенте
Процедура ПСЦДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекД = Элементы.ПСЦДоговоры.ТекущиеДанные;
	ПоказатьЗначение(,ТекД.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ФинДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекД = Элементы.ФинДокументы.ТекущиеДанные;
	ПоказатьЗначение(,ТекД.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Диалоги(Команда)
	
	ТекСтр = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	ТекД = Неопределено;
	
	Если ТекСтр.Имя = "ГруппаЗапросы" Тогда
		ТекД = Элементы.СписокЗапросы.ТекущаяСтрока;
	ИначеЕсли ТекСтр.Имя = "ГруппаЗаявки" Тогда
		ТекД = Элементы.Заявки.ТекущаяСтрока;
	ИначеЕсли ТекСтр.Имя = "ГруппаДокументыПользователя" Тогда
		ТекД = Элементы.МоиДокументыФайлы.ТекущаяСтрока;
	ИначеЕсли ТекСтр.Имя = "ГруппаПСЦ" Тогда
		ТекД = Элементы.ПСЦДоговоры.ТекущиеДанные;		
	ИначеЕсли ТекСтр.Имя = "ГруппаФинансовая" Тогда
		ТекД = Элементы.ФинДокументы.ТекущиеДанные;		
	ИначеЕсли ТекСтр.Имя = "ГруппаАрхив" Тогда
		ТекД = Элементы.СписокДокументов.ТекущиеДанные;		
	Иначе
		Возврат;
	КонецЕсли;

	//Если ТекД = Неопределено Тогда
	//	Сообщить("Не выбран документ для создания чата по нему!");
	//	Возврат;
	//КонецЕсли;
	
	Попытка
		КонтекстДляДиалога = ТекД.Ссылка;
	Исключение
		КонтекстДляДиалога = ТекД;
	КонецПопытки;
	
	ПараметрыФормы = Новый Структура("Контекст", КонтекстДляДиалога);
	ОткрытьФорму("Обработка.Диалоги.Форма", ПараметрыФормы, ЭтаФорма, Ложь, Неопределено, "e1cib/command/Обработка.Диалоги.Команда.ДиалогиКонтекста");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеКонтрагента();
	//УстановитьЗаголовокПриложения("Информационная система ГК Евросиб");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеКонтрагента()
	
	ЗонаРиска = ЗонаРискаКонтрагента();
	Элементы.Контрагент.Подсказка = "";
	Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;	
	
	Если ЗонаРиска.Количество()=1 Тогда
		Элементы.Контрагент.ЦветФона = WebЦвета.Желтый;
	ИначеЕсли ЗонаРиска.Количество()=2 Тогда
		Элементы.Контрагент.ЦветФона = WebЦвета.Красный;
		Элементы.Контрагент.Подсказка = ЗонаРиска[1];
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МоиДокументыПапкиПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.МоиДокументыПапки.ТекущиеДанные;
	МоиДокументыФайлы.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ?(ТекД = неопределено, неопределено, ТекД.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	ВыС = Элементы.МоиДокументыФайлы.ВыделенныеСтроки;
	
	ПриОтправкеФайловПочтой(ПараметрыОтправки, ВыС, Элементы.МоиДокументыПапки.ТекущиеДанные.Ссылка , УникальныйИдентификатор);
	
	РаботаСФайламиСлужебныйКлиент.ОтправитьФайлыПоПочте(ВыС, УникальныйИдентификатор, ПараметрыОтправки, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриОтправкеФайловПочтой(ПараметрыОтправки, Знач ФайлыДляОтправки, ВладелецФайлов, УникальныйИдентификатор)
	РаботаСФайламиПереопределяемый.ПриОтправкеФайловПочтой(ПараметрыОтправки, ФайлыДляОтправки, ВладелецФайлов, УникальныйИдентификатор);
КонецПроцедуры