Процедура НастроитьБлокировкуПолей(ДокументОбъект, ТаблицаКлючейАналитики, ИмяФормы, Форма, УсловноеОформление) Экспорт

    // 1. Если нет правила блокировки, то не проверяем дальше
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаБлокировкиПолейКлючаПеревозки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПравилаБлокировкиПолейКлючаПеревозки КАК ПравилаБлокировкиПолейКлючаПеревозки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО ПравилаБлокировкиПолейКлючаПеревозки.ВидОбъекта.ПолноеИмя = ИдентификаторыОбъектовМетаданных.ПолноеИмя
		|ГДЕ
		|	ПравилаБлокировкиПолейКлючаПеревозки.ФормаОбъекта = &ФормаОбъекта
		|	И НЕ ПравилаБлокировкиПолейКлючаПеревозки.ПометкаУдаления
		|	И ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки) = &ТипЗначенияОбъекта";
	
	Запрос.УстановитьПараметр("ТипЗначенияОбъекта", ТипЗнч(ДокументОбъект.Ссылка));   
	ЧастиИмени = СтрРазделить(ИмяФормы, ".");
	Запрос.УстановитьПараметр("ФормаОбъекта", ЧастиИмени[ЧастиИмени.Количество() - 1]);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат; 
	Иначе  
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ПравилоБлокировки = Выборка.Ссылка; 
		КонецЕсли;
	КонецЕсли;   
	
	//Нужно найти в имеющемся оформлении ограничение доступности с отбором по ключу аналитики и удалить его
	ПараметрПросмотр = Новый ПараметрКомпоновкиДанных("ТолькоПросмотр");
	УдаляемыеЭлементыОформления = Новый Массив;
	Для каждого СтрокаОформления Из УсловноеОформление.Элементы Цикл   
		ПараметрПросмотрСтроки = СтрокаОформления.Оформление.НайтиЗначениеПараметра(ПараметрПросмотр);
		Если ПараметрПросмотрСтроки <> Неопределено и ПараметрПросмотрСтроки.Значение = Истина Тогда
			Если СтрокаОформления.Отбор.Элементы.Количество() 
				и ТипЗнч(СтрокаОформления.Отбор.Элементы[0].ПравоеЗначение) = Тип("СправочникСсылка.КлючиАналитикиПеревозки") Тогда
				УдаляемыеЭлементыОформления.Добавить(СтрокаОформления);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для каждого УдаляемоеОформление Из УдаляемыеЭлементыОформления Цикл
		УсловноеОформление.Элементы.Удалить(УдаляемоеОформление);
	КонецЦикла;
	
	// 2. Проверяем пришли ли данные по реквизитам ключа из ТЛ в регистре ДанныеКлючейАналитикиПеревозкиЗагруженные  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаБлокировкиПолейКлючаПеревозкиПравила.РеквизитКлючаАналитикиПеревозки КАК РеквизитКлючаАналитикиПеревозки,
		|	ПравилаБлокировкиПолейКлючаПеревозкиПравила.РеквизитФормы КАК РеквизитФормы
		|ПОМЕСТИТЬ ВТ_БлокируемыеРеквизиты
		|ИЗ
		|	Справочник.ПравилаБлокировкиПолейКлючаПеревозки.Правила КАК ПравилаБлокировкиПолейКлючаПеревозкиПравила
		|ГДЕ
		|	ПравилаБлокировкиПолейКлючаПеревозкиПравила.Ссылка = &ПравилоБлокировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ТаблицаДокумента.ПерваяМиля КАК ВариантПеревозкиПервая,
		|	ТаблицаДокумента.ПоследняяМиля КАК ВариантПеревозкиПоследняя
		|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_БлокируемыеРеквизиты.РеквизитКлючаАналитикиПеревозки КАК РеквизитКлючаАналитикиПеревозки,
		|	ВТ_БлокируемыеРеквизиты.РеквизитФормы КАК РеквизитФормы,
		|	ДанныеКлючейАналитикиПеревозкиЗагруженные.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ДанныеКлючейАналитикиПеревозкиЗагруженные.Значение КАК Значение,
		|	ВТ_ТаблицаДокумента.ВариантПеревозкиПервая КАК ВариантПеревозкиПервая,
		|	ВТ_ТаблицаДокумента.ВариантПеревозкиПоследняя КАК ВариантПеревозкиПоследняя
		|ИЗ
		|	РегистрСведений.ДанныеКлючейАналитикиПеревозкиЗагруженные КАК ДанныеКлючейАналитикиПеревозкиЗагруженные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БлокируемыеРеквизиты КАК ВТ_БлокируемыеРеквизиты
		|		ПО ДанныеКлючейАналитикиПеревозкиЗагруженные.ПутьКСтруктуреХранения = ВТ_БлокируемыеРеквизиты.РеквизитКлючаАналитикиПеревозки
		|			И (ДанныеКлючейАналитикиПеревозкиЗагруженные.КлючАналитикиПеревозки В
		|				(ВЫБРАТЬ
		|					Т.КлючАналитикиПеревозки
		|				ИЗ
		|					ВТ_ТаблицаДокумента КАК Т))
		|			И (ДанныеКлючейАналитикиПеревозкиЗагруженные.Источник = &ИсточникТранспортнаяЛогистика)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|		ПО ДанныеКлючейАналитикиПеревозкиЗагруженные.КлючАналитикиПеревозки = ВТ_ТаблицаДокумента.КлючАналитикиПеревозки
		|ИТОГИ ПО
		|	КлючАналитикиПеревозки";
	
	Запрос.УстановитьПараметр("ИсточникТранспортнаяЛогистика", Перечисления.УзлыОбмена.ТЛ);
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаКлючейАналитики);
	Запрос.УстановитьПараметр("ПравилоБлокировки", ПравилоБлокировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
		
		// Если нет таблицы по блокировке, то добавляем его  
		МассивРеквизитовФормы = Форма.ПолучитьРеквизиты();
		
		МассивИменРеквизитовФормы = Новый Массив;
		Для Каждого ТекРеквизит Из МассивРеквизитовФормы Цикл
			МассивИменРеквизитовФормы.Добавить(ТекРеквизит.Имя);
		КонецЦикла;
		
		Если МассивИменРеквизитовФормы.Найти("ТаблицаБлокировкиПолейКлючаАналитики") <> Неопределено Тогда
			Форма["ТаблицаБлокировкиПолейКлючаАналитики"].Очистить();
		Иначе     
			ДобавляемыеРеквизиты = Новый Массив;
			ТипыРеквизита = Новый Массив;
			ТипыРеквизита.Добавить(Тип("ТаблицаЗначений"));
			ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
			НовыйРеквизит = Новый РеквизитФормы("ТаблицаБлокировкиПолейКлючаАналитики", ОписаниеТиповДляРеквизита); // добавляем поле с именем такого типа "ТабличнаяЧасть_ИмяПоля"
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ДобавляемыеРеквизиты.Очистить();
			
			ТипыРеквизита = Новый Массив;
			ТипыРеквизита.Добавить(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));
			ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
			Колонка1 = Новый РеквизитФормы("КлючАналитикиПеревозки",  ОписаниеТиповДляРеквизита,             
							"ТаблицаБлокировкиПолейКлючаАналитики");  
			ДобавляемыеРеквизиты.Добавить(Колонка1); 
			
			ТипыРеквизита = Новый Массив;
			ТипыРеквизита.Добавить(Тип("Строка"));
			ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
			Колонка2 = Новый РеквизитФормы("НаименованиеПоля",  ОписаниеТиповДляРеквизита,             
							"ТаблицаБлокировкиПолейКлючаАналитики");  
			ДобавляемыеРеквизиты.Добавить(Колонка2);     
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		КонецЕсли;
		
		// и блокируем, если есть значение
		ВыборкаПоКлючу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоКлючу.Следующий() Цикл    
			
			КлючАналитикиПеревозки = ВыборкаПоКлючу.КлючАналитикиПеревозки;
			ВыборкаПолей = ВыборкаПоКлючу.Выбрать(); 
			ПоляБлокируемые = Новый Массив;
			Пока ВыборкаПолей.Следующий() Цикл  
				
				ИмяОформляемогоЭлемента = СтрЗаменить(ВыборкаПолей.РеквизитФормы, ".", ""); 
				ЧастиИмениПоля = СтрРазделить(ВыборкаПолей.РеквизитФормы, ".");
				ИмяПоляТЧ = ЧастиИмениПоля[0] + ".КлючАналитикиПеревозки"; 
				
				ЧастиИмениРеквизитаКлюча = СтрРазделить(ВыборкаПолей.РеквизитКлючаАналитикиПеревозки, ".");
				//Если это реквизит по миле и по соответствующей миле указан вариант автоперевозки не силами Евросиб, то поле должно быть доступно
				Если (ЧастиИмениРеквизитаКлюча[0] = "СтруктураТЧМилиПерваяМиляКлючаАналитики"
					и ВыборкаПолей.ВариантПеревозкиПервая <> Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб)
					или (ЧастиИмениРеквизитаКлюча[0] = "СтруктураТЧМилиПоследняяМиляКлючаАналитики"
					и ВыборкаПолей.ВариантПеревозкиПоследняя <> Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб) Тогда  
				    Продолжить;
				КонецЕсли;
				
				Если Форма.Элементы.Найти(ЧастиИмениПоля[0] + "КлючАналитикиПеревозки") = Неопределено Тогда
					Продолжить;	
				КонецЕсли;
				
				ЭлементУО = УсловноеОформление.Элементы.Добавить();
				ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоЭлемента); 
				
				ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяПоляТЧ);
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = КлючАналитикиПеревозки;
				
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
				
				Если ЧастиИмениПоля.Количество() > 1 Тогда
					ПоляБлокируемые.Добавить(ЧастиИмениПоля[1]);
				Иначе	
				    ПоляБлокируемые.Добавить(ВыборкаПолей.РеквизитФормы);
				КонецЕсли;
			КонецЦикла;  
			
			//Зафиксируем заблокированные поля в реквизите формы "ТаблицаБлокировкиПолейКлючаАналитики"
			Если ПоляБлокируемые.Количество() Тогда    
				НС = Форма["ТаблицаБлокировкиПолейКлючаАналитики"].Добавить();
				НС.КлючАналитикиПеревозки = КлючАналитикиПеревозки;
				НС.НаименованиеПоля = СтрСоединить(ПоляБлокируемые, ",");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;   
	
КонецПроцедуры

// ДИТ US 83041 ТА 83043 Сержантова А.С. 27.04.2024
Процедура ПроверитьСоответствиеКонтейнераФутовостиВКалькуляции(ВходныеДанные, Отказ) Экспорт
	
	Если ТипЗнч(ВходныеДанные) = Тип("Структура") Тогда 
		МассивКлючей = Новый Массив;
		МассивКлючей.Добавить(ВходныеДанные.КлючАналитикиПеревозки); 
		ПроверяемыеДанные = Новый Массив;
		ПроверяемыеДанные.Добавить(ВходныеДанные);
	Иначе	
		МассивКлючей = ВходныеДанные.ВыгрузитьКолонку("КлючАналитикиПеревозки");  
		ПроверяемыеДанные = ВходныеДанные;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка,
		|	КлючиАналитикиПеревозки.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТ_ЗаявкиКлючей
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|ГДЕ
		|	КлючиАналитикиПеревозки.Ссылка В(&МассивКлючей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция,
		|	ВТ_ЗаявкиКлючей.Ссылка КАК КлючАналитикиПеревозки,
		|	ДокументКалькуляция.ММ_ИтогоСтавка > 0 КАК ЕстьСтавка40,
		|	ДокументКалькуляция.ММ_ИтогоСтавка20 > 0 КАК ЕстьСтавка20,
		|	ДокументКалькуляция.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_ЗаявкиКлючей КАК ВТ_ЗаявкиКлючей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
		|			ПО ЗаявкаСоставУслуги.Калькуляция = ДокументКалькуляция.Ссылка
		|		ПО ВТ_ЗаявкиКлючей.Заявка = ЗаявкаСоставУслуги.Ссылка
		|			И ВТ_ЗаявкиКлючей.Ссылка = ЗаявкаСоставУслуги.КлючАналитикиПеревозки";
	
	Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);  
	Если ТипЗнч(ВходныеДанные) = Тип("Структура") и ВходныеДанные.Свойство("Заявка") 
		и ЗначениеЗаполнено(ВходныеДанные.Заявка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КлючиАналитикиПеревозки.Заявка КАК Заявка",
												 "&Заявка КАК Заявка");
		Запрос.УстановитьПараметр("Заявка", ВходныеДанные.Заявка); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаСтавкиКалькуляций = РезультатЗапроса.Выбрать();
	КТКФутность = Новый Соответствие;
	Для каждого СтрокаКлюча Из ПроверяемыеДанные Цикл
		Если не ЗначениеЗаполнено(СтрокаКлюча.Контейнер) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки", СтрокаКлюча.КлючАналитикиПеревозки);
	    Если ВыборкаСтавкиКалькуляций.НайтиСледующий(СтруктураПоиска) Тогда
			
			РазмерКТК =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКлюча.Контейнер, "ТипТЕ"); 
			РазмерКТКНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазмерКТК, "Наименование");
			РазмерКонтейнера40 = (СтрНайти(РазмерКТКНаименование, "40") <> 0 или СтрНайти(РазмерКТКНаименование, "45") <> 0);   
			
			Если ВыборкаСтавкиКалькуляций.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.Вагон
				или не ЗначениеЗаполнено(ВыборкаСтавкиКалькуляций.Калькуляция) Тогда
				ВыборкаСтавкиКалькуляций.Сбросить();	
				Продолжить;				
			КонецЕсли;
			
			ЕстьСтавка20 = ВыборкаСтавкиКалькуляций.ЕстьСтавка20;
			ЕстьСтавка40 = ВыборкаСтавкиКалькуляций.ЕстьСтавка40;
			
			Если РазмерКонтейнера40 Тогда
				Если НЕ ЕстьСтавка40 И ЕстьСтавка20 Тогда 
					МассивКТК = КТКФутность.Получить(ВыборкаСтавкиКалькуляций.Калькуляция);
					Если МассивКТК <> Неопределено Тогда
					    Если МассивКТК.Найти(СтрокаКлюча.Контейнер) = Неопределено Тогда
							МассивКТК.Добавить(СтрокаКлюча.Контейнер);	
						КонецЕсли;
					Иначе
						МассивКТК = Новый Массив;         
						МассивКТК.Добавить(СтрокаКлюча.Контейнер);
						КТКФутность.Вставить(ВыборкаСтавкиКалькуляций.Калькуляция, МассивКТК);	
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если НЕ ЕстьСтавка20 И ЕстьСтавка40 Тогда
					МассивКТК = КТКФутность.Получить(ВыборкаСтавкиКалькуляций.Калькуляция);
					Если МассивКТК <> Неопределено Тогда
					    Если МассивКТК.Найти(СтрокаКлюча.Контейнер) = Неопределено Тогда
							МассивКТК.Добавить(СтрокаКлюча.Контейнер);	
						КонецЕсли;
					Иначе
						МассивКТК = Новый Массив;         
						МассивКТК.Добавить(СтрокаКлюча.Контейнер);
						КТКФутность.Вставить(ВыборкаСтавкиКалькуляций.Калькуляция, МассивКТК);	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
		ВыборкаСтавкиКалькуляций.Сбросить();
	КонецЦикла;      
	
	Для каждого СтрокаОшибки Из КТКФутность Цикл 
		РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОшибки.Ключ, "Номер, Дата");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Данные не записаны! В Калькуляции %1 от %2 не соответствует размер КТК № %3",
				РеквизитыКалькуляции.Номер,РеквизитыКалькуляции.Дата,
				СтрСоединить(СтрокаОшибки.Значение,",")),,,,Отказ);
	КонецЦикла; 

КонецПроцедуры

// ДИТ US 83041 ТА 83043 Сержантова А.С. 13.05.2024
Функция ПроверитьКТКвДругойЗаявке(ВходныеДанные) Экспорт  
	
	Если ТипЗнч(ВходныеДанные) = Тип("Структура") Тогда
		ТаблицаКлючейИКТК = Новый ТаблицаЗначений;
		ТаблицаКлючейИКТК.Колонки.Добавить("КлючАналитикиПеревозки", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПеревозки"));
		ТаблицаКлючейИКТК.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));  
		ТаблицаКлючейИКТК.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
		НС = ТаблицаКлючейИКТК.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВходныеДанные);
	Иначе	
		ТаблицаКлючейИКТК = ВходныеДанные;
	КонецЕсли;

	РезультатПроверки = Новый ТаблицаЗначений;
	РезультатПроверки.Колонки.Добавить("НомерКТК");
	РезультатПроверки.Колонки.Добавить("Заявка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаКлючей.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	ТаблицаКлючей.Контейнер КАК КТК,
	               |	ТаблицаКлючей.Заявка КАК Заявка
	               |ПОМЕСТИТЬ ВТ_ДанныеИзменения
	               |ИЗ
	               |	&ТаблицаКлючей КАК ТаблицаКлючей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеИзменения.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	ВТ_ДанныеИзменения.КТК КАК КТК,
	               |	ВТ_ДанныеИзменения.Заявка КАК Заявка,
	               |	ВЫРАЗИТЬ(ВТ_ДанныеИзменения.Заявка КАК Документ.Заявка).Дата КАК ЗаявкаДата
	               |ПОМЕСТИТЬ ВТ_ИзмененКТК
	               |ИЗ
	               |	ВТ_ДанныеИзменения КАК ВТ_ДанныеИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |		ПО ВТ_ДанныеИзменения.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
	               |ГДЕ
	               |	КлючиАналитикиПеревозки.Контейнер <> ВТ_ДанныеИзменения.КТК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеИзменения.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	               |ИЗ
	               |	ВТ_ДанныеИзменения КАК ВТ_ДанныеИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |		ПО ВТ_ДанныеИзменения.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
	               |ГДЕ
	               |	КлючиАналитикиПеревозки.Контейнер <> ВТ_ДанныеИзменения.КТК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	               |ИЗ
	               |	ВТ_ИзмененКТК КАК ВТ_ИзмененКТК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ПО ВТ_ИзмененКТК.КТК = ЗаявкаСоставУслуги.НомерКТК
	               |			И ВТ_ИзмененКТК.Заявка <> ЗаявкаСоставУслуги.Ссылка
	               |ГДЕ
	               |	НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления
	               |	И ЗаявкаСоставУслуги.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_ИзмененКТК.ЗаявкаДата, ДЕНЬ, -7) И ВТ_ИзмененКТК.ЗаявкаДата
	               |	И ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТаблицаКлючей", ТаблицаКлючейИКТК);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ЕстьИзменениеКТК = РезультатыЗапроса[2];
	Если ЕстьИзменениеКТК.Пустой() Тогда
		Возврат РезультатПроверки;
	КонецЕсли;	
	
	ЕстьДругиеЗаявки = РезультатыЗапроса[3];
	Если не ЕстьДругиеЗаявки.Пустой() Тогда
		ВыборкаДругиеЗаявки = ЕстьДругиеЗаявки.Выбрать();
		Пока ВыборкаДругиеЗаявки.Следующий() Цикл               
			НС = РезультатПроверки.Добавить();      
			ЗаполнитьЗначенияСвойств(НС,ВыборкаДругиеЗаявки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатПроверки;

КонецФункции 

// Евросиб US 88665 TA 97651 Рыбьяков К.А. 16.12.2024 ((
Процедура ЗаполнитьКлючиАналитикиВЗаявке(СделкаОбъект, СделкаСсылка) Экспорт
	
	// Заполним КлючСтрокиСоставаПоезда в КлючАналитикиПеревозки для строк заявки у которых не заполнен КлючСтрокиСоставаПоезда
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиницОбъект
	|ИЗ
	|	&СделкаСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
	|	КлючиАналитикиПеревозки.Ссылка КАК КлючиАналитикиПеревозки,
	|	Ложь КАК СтрокаОбработана
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект КАК ВТ_СделкаСвязьУчетныхЕдиницОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТ_СделкаСвязьУчетныхЕдиницОбъект.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|		ПО (ЗаявкаСоставУслуги.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка)
	|ГДЕ
	|	КлючиАналитикиПеревозки.Ссылка.КлючАналитикиСоставаПоезда = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиСоставаПоезда.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("СделкаСвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить(,"Контейнер,
																								|ГУИДСтрокиЗаявки,
																								|ВидТранспортногоСообщения,
																								|КлючАналитикиСоставаПоезда"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаВыгрузки Из Выгрузка Цикл
		Если СтрокаВыгрузки.СтрокаОбработана = Истина Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаВыгрузки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море Тогда
			НайденныеСтроки = Выгрузка.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки, 
																	|ВидТранспортногоСообщения,
																	|СтрокаОбработана", 
																	СтрокаВыгрузки.ГУИДСтрокиЗаявки, 
																	Перечисления.ВидыТранспортныхСообщений.ЖД,
																	Ложь));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для Каждого Строка Из НайденныеСтроки Цикл
					КлючиАналитикиПеревозкиОбъект = Строка.КлючиАналитикиПеревозки.ПолучитьОбъект();
					КлючиАналитикиПеревозкиОбъект.КлючАналитикиСоставаПоезда = Строка.КлючАналитикиСоставаПоезда;
					КлючиАналитикиПеревозкиОбъект.Записать();
					Строка.СтрокаОбработана = Истина;
				КонецЦикла;
			Иначе
				КлючиАналитикиПеревозкиОбъект = СтрокаВыгрузки.КлючиАналитикиПеревозки.ПолучитьОбъект();
				КлючиАналитикиПеревозкиОбъект.КлючАналитикиСоставаПоезда = СтрокаВыгрузки.КлючАналитикиСоставаПоезда;
				КлючиАналитикиПеревозкиОбъект.Записать();
			КонецЕсли;
			СтрокаВыгрузки.СтрокаОбработана = Истина;
		Иначе
			КлючиАналитикиПеревозкиОбъект = СтрокаВыгрузки.КлючиАналитикиПеревозки.ПолучитьОбъект();
			КлючиАналитикиПеревозкиОбъект.КлючАналитикиСоставаПоезда = СтрокаВыгрузки.КлючАналитикиСоставаПоезда;
			КлючиАналитикиПеревозкиОбъект.Записать();
			СтрокаВыгрузки.СтрокаОбработана = Истина;
			НайденныеСтроки = Выгрузка.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки, 
																	|ВидТранспортногоСообщения,
																	|СтрокаОбработана", 
																	СтрокаВыгрузки.ГУИДСтрокиЗаявки, 
																	Перечисления.ВидыТранспортныхСообщений.Море,
																	Ложь));
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.СтрокаОбработана = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Удалим КлючСтрокиСоставаПоезда из КлючАналитикиПеревозки если удалили строку состава поезда
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда 
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиницОбъект
	|ИЗ
	|	&СделкаСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|ВЫБРАТЬ
	|	1 КАК ИндексУдаленияДобавления,
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
	|	КлючиАналитикиПеревозки.Ссылка
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица 
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиницОбъект КАК ВТ_СделкаСвязьУчетныхЕдиницОбъект
	|    	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТ_СделкаСвязьУчетныхЕдиницОбъект.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|			ПО КлючиАналитикиПеревозки.Ссылка = ЗаявкаСоставУслуги.КлючАналитикиПеревозки 
	|			
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-1,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
	|	КлючиАналитикиПеревозки.Ссылка
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|			ПО КлючиАналитикиПеревозки.Ссылка = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка 
	|;
	|
	|ВЫБРАТЬ
	|	СУММА(ВТ_ИтоговаяТаблица.ИндексУдаленияДобавления), 
	|	ВТ_ИтоговаяТаблица.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	КлючиАналитикиПеревозки.Ссылка КАК КлючиАналитикиПеревозки,
	|	ВТ_ИтоговаяТаблица.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТ_ИтоговаяТаблица.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|			ПО КлючиАналитикиПеревозки.Ссылка = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
	|	
	|ГДЕ
	|	КлючиАналитикиПеревозки.Ссылка.КлючАналитикиСоставаПоезда = ВТ_ИтоговаяТаблица.КлючАналитикиСоставаПоезда
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТаблица.ГУИДСтрокиЗаявки,
	|	КлючиАналитикиПеревозки.Ссылка,
	|	ВТ_ИтоговаяТаблица.КлючАналитикиСоставаПоезда
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ИтоговаяТаблица.ИндексУдаленияДобавления) < 0";

	Запрос.УстановитьПараметр("Ссылка", СделкаСсылка);
	Запрос.УстановитьПараметр("СделкаСвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить(,"Контейнер,
																								|ГУИДСтрокиЗаявки,
																								|ВидТранспортногоСообщения,
																								|КлючАналитикиСоставаПоезда"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаВыгрузки Из Выгрузка Цикл
		КлючиАналитикиПеревозкиОбъект = СтрокаВыгрузки.КлючиАналитикиПеревозки.ПолучитьОбъект();
		КлючиАналитикиПеревозкиОбъект.КлючАналитикиСоставаПоезда = Справочники.КлючиАналитикиСоставаПоезда.ПустаяСсылка();
		КлючиАналитикиПеревозкиОбъект.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 
// Евросиб Рыбьяков К.А. 16.12.2024 ))
