Функция MAERSK_GEOGRAPHY() Экспорт
	
	Респонз = СкачатьСтраничку("location.api.maersk.com", "/v2/countries");
	
	Возврат Респонз;
	
КонецФункции

Функция MAERSK_VESSELS() Экспорт
	
	Респонз = СкачатьСтраничку("api.maerskline.com", "/maeu/schedules/vessel/active");
	
	Возврат Респонз;
	
КонецФункции

Функция MAERSK_VESSEL_DETAILED(VESSEL_CODE) Экспорт
	
	Респонз = СкачатьСтраничку("api.maerskline.com", "/maeu/vessels/details/"+VESSEL_CODE);
	
	Возврат Респонз;
	
КонецФункции

Функция MAERSK_GEOGRAPHY_DETAILED(COUNTRY_CODE) Экспорт
	
	Респонз = СкачатьСтраничку("location.api.maersk.com", "/v2/countries/"+COUNTRY_CODE+"/cities");
	
	Возврат Респонз;
	
КонецФункции

Функция MAERSK_SCHEDULE(L_FROM, L_TO) Экспорт
	
	Респонз = СкачатьСтраничку("api.maerskline.com", "/maeu/products/futureschedules?from="+L_FROM+"&to="+L_TO);
	
	Возврат Респонз;
	
КонецФункции

Функция СкачатьСтраничку(Домен, Подссылка)
	
	Результат = "";
	
	ХТТП = новый HTTPСоединение(Домен,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ИмяФайла = ПолучитьИмяВременногоФайла();
	Попытка
		ОтветСервера = ХТТП.Получить(Подссылка, ИмяФайла, Новый Соответствие);
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Ошибка получения данных по коду " + Подссылка + " : " + ОО);
		Возврат "";
	КонецПопытки;
	Если ОтветСервера.КодСостояния = 200 Тогда
		ЧТ = новый ЧтениеТекста(ИмяФайла);
		Результат = ЧТ.Прочитать();
		ЧТ.Закрыть();
	КонецЕсли;
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЛокациюПоИдентификаторуMAERSK(ИдентификаторMAERSK) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Локации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Локации КАК Локации
	                      |ГДЕ
	                      |	НЕ Локации.ПометкаУдаления
	                      |	И Локации.ИдентификаторMAERSK = &ИдентификаторMAERSK");
	Запрос.УстановитьПараметр("ИдентификаторMAERSK", ИдентификаторMAERSK);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТСПоИдентификаторуMAERSK(ИдентификаторMAERSK) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТС.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ТС КАК ТС
	                      |ГДЕ
	                      |	НЕ ТС.ПометкаУдаления
	                      |	И ТС.ИдентификаторMAERSK = &ИдентификаторMAERSK");
	Запрос.УстановитьПараметр("ИдентификаторMAERSK", ИдентификаторMAERSK);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция MAERSK_CONT_OR_BILL(CONT_OR_BILL) Экспорт
	
	Респонз = СкачатьСтраничку("api.maerskline.com", "/track/"+CONT_OR_BILL);
	
	Возврат Респонз;
	
КонецФункции

Функция ПреобразоватьДатуВ1С(ДатаНеВ1С, РежимПредставленияДаты) Экспорт
	
	Результат = ДатаНеВ1С;
	
	Если Результат = "" тогда Возврат Результат; КонецЕсли;
	
	МассивЗаменСимволов = Новый Массив;
	
	Если РежимПредставленияДаты = 1 Тогда // это вариант, когда год-месяц-день чч:мм:сс
		
		МассивЗаменСимволов.Добавить("-");
		МассивЗаменСимволов.Добавить(":");
		МассивЗаменСимволов.Добавить(" ");
		
	ИначеЕсли РежимПредставленияДаты = 2 Тогда // это вариант, когда 2019-08-03T05:00:00.000
		
		Результат = лев(Результат, 19);
		МассивЗаменСимволов.Добавить("-");
		МассивЗаменСимволов.Добавить(":");
		МассивЗаменСимволов.Добавить("T");
		МассивЗаменСимволов.Добавить(" ");
		
	ИначеЕсли РежимПредставленияДаты = 5 Тогда // это вариант, когда 11.12.2020 12:23
		
		Результат = "" + Сред(Результат, 7, 4) + Сред(Результат, 4, 2) + Лев(результат, 2) + ?(Сред(Результат, 13, 1) = ":", "0", "") +  Сред(Результат, 12);
		МассивЗаменСимволов.Добавить(":");
		
	ИначеЕсли РежимПредставленияДаты = 3 Тогда // это вариант, когда 2019-08-03T05:00:00.000
		
		ВремяКоротко = СтрЗаменить(Сред(Результат, 12), ":", "");
		Если СтрДлина(ВремяКоротко) = 5 Тогда ВремяКоротко = "0" + ВремяКоротко; КонецЕсли;
		
		Результат = "" + Сред(Результат, 7, 4) + Сред(Результат, 4, 2) + Лев(Результат, 2) + ВремяКоротко;
		
	КонецЕсли;
	
	Для каждого Стр из МассивЗаменСимволов Цикл
		Результат = СтрЗаменить(Результат, Стр, "");
	КонецЦикла;
	
	Попытка
		Результат = Дата(Результат);
	Исключение
		Сообщить("Преобразование даты не удалось: " + Результат);
		Возврат неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьДислокациюПоФорматуМонголииExcel(ИмяФайла) Экспорт
	
	РежимЗагрузки = константы.ПоведениеПриОтсутствииКТКИзДислокации.Получить();
	ОперацияВагона = Константы.ОперацияСлеженияИнТерриторий.Получить();
	
	РезультатУспешно = Истина;
	
	ДислокацияВагонов = Новый ТаблицаЗначений;
	ДислокацияВагонов.Колонки.Добавить("Вагон");
	ДислокацияВагонов.Колонки.Добавить("ОперацияСВагоном");
	ДислокацияВагонов.Колонки.Добавить("РабочийПарк");
	ДислокацияВагонов.Колонки.Добавить("ДатаОперации");
	ДислокацияВагонов.Колонки.Добавить("Груженый");
	ДислокацияВагонов.Колонки.Добавить("НомерПоезда");
	ДислокацияВагонов.Колонки.Добавить("ИндексПоезда");
	ДислокацияВагонов.Колонки.Добавить("КодГрузоотправителя");
	ДислокацияВагонов.Колонки.Добавить("КодГрузополучателя");
	ДислокацияВагонов.Колонки.Добавить("Собственник");
	ДислокацияВагонов.Колонки.Добавить("КодГрузаЕТСНГ");
	ДислокацияВагонов.Колонки.Добавить("Груз");
	ДислокацияВагонов.Колонки.Добавить("ВесГруза");
	ДислокацияВагонов.Колонки.Добавить("СтанцияОперации");
	ДислокацияВагонов.Колонки.Добавить("СтанцияНазначения");
	
	
	ДислокацияКонтейнеров = Новый ТаблицаЗначений;
	ДислокацияКонтейнеров.Колонки.Добавить("Контейнер");
	ДислокацияКонтейнеров.Колонки.Добавить("ДатаОперации");
	ДислокацияКонтейнеров.Колонки.Добавить("ОперацияСВагоном");
	ДислокацияКонтейнеров.Колонки.Добавить("ТипКонтейнера");
	ДислокацияКонтейнеров.Колонки.Добавить("Груженый");
	ДислокацияКонтейнеров.Колонки.Добавить("СтранаОтправления");
	ДислокацияКонтейнеров.Колонки.Добавить("СтранаНазначения");
	ДислокацияКонтейнеров.Колонки.Добавить("НомерНакладной");
	ДислокацияКонтейнеров.Колонки.Добавить("Груз");
	ДислокацияКонтейнеров.Колонки.Добавить("КодГрузаЕТСНГ");
	ДислокацияКонтейнеров.Колонки.Добавить("ВесГруза");
	ДислокацияКонтейнеров.Колонки.Добавить("ИндексПоезда");
	ДислокацияКонтейнеров.Колонки.Добавить("Вагон");
	ДислокацияКонтейнеров.Колонки.Добавить("НомерППВ");
	ДислокацияКонтейнеров.Колонки.Добавить("СтанцияПогрузкиКонтейнера");
	ДислокацияКонтейнеров.Колонки.Добавить("СтанцияПогрузкиВагона");
	ДислокацияКонтейнеров.Колонки.Добавить("СтанцияОперации");
	ДислокацияКонтейнеров.Колонки.Добавить("СтанцияНазначения");
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.Прочитать(ИмяФайла);
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)
	
	Сч = 4;
	НазваниеОперации = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	Пока НазваниеОперации <> "" Цикл
		
		Вагон = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C5").Текст;
		ВагонСсылка = Справочники.ТС.НайтиПоНаименованию(Вагон);
		
		Если РежимЗагрузки = 2 И НЕ ЗначениеЗаполнено(ВагонСсылка) Тогда
			
			НВагон = Справочники.ТС.СоздатьЭлемент();
			НВагон.Наименование = Вагон;
			НВагон.ЗаписьИсторииДанных.КомментарийВерсии = "Создан регламентом Разбор иностранной дислокации"; //ДИТ Шевченко US 63491 TA 74038 18.09.2023
			НВагон.Записать();
			ВагонСсылка = НВагон.Ссылка;
			
		КонецЕсли;
		
		Контейнер = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C7").Текст;
		КонтейнерСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(Контейнер); // Справочники.ТЕ.НайтиПоНаименованию(Контейнер);
		
		Если РежимЗагрузки = 2 И НЕ ЗначениеЗаполнено(КонтейнерСсылка) И Контейнер <> "" Тогда
			
			//НКТК = Справочники.ТЕ.СоздатьЭлемент();
			//НКТК.Наименование = Контейнер;
			//НКТК.Записать();
			//КонтейнерСсылка = НКТК.Ссылка;
			КонтейнерСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(Контейнер);
			
			// Евросиб Фролов (26.10.2021 Ticket№ 41408
			МассивСозданныхКТК.Добавить(КонтейнерСсылка);
			// Евросиб Фролов)
			
		КонецЕсли;
		
		Грузополучатель = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C18").Текст;
		ГрузополучательСсылка = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Грузополучатель);
		
		Собственник = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C19").Текст;
		СобственникСсылка = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Собственник);
		
		КодГрузаЕТСНГ = Лев(ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C10").Текст, 5);
		
		//ЕТСНГКорректноПрочитался = Истина;
		//Попытка
		//	ЧислоЕТСНГ = ЧИсло(КодГрузаЕТСНГ);
		//Исключение
		//	ЕТСНГКорректноПрочитался = Ложь;
		//КонецПопытки;
		
		//Если ЕТСНГКорректноПрочитался Тогда
		//	Груз = Сред(ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C10").Текст, 16);
		//	ГрузСсылка = Грузы_сервер.НайтиСоздатьГруз(Груз);
		//Иначе
			Груз = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C10").Текст;
			ГрузСсылка = Грузы_сервер.НайтиСоздатьГруз(Груз);
		//КонецЕсли;
		
		ВесГруза = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C11").Текст;
		ВесГрузаЧисло = 0;
		Попытка
			ВесГрузаЧисло = Число(ВесГруза);
			Если ВесГрузаЧисло < 100 Тогда ВесГрузаЧисло = ВесГрузаЧисло * 1000; КонецЕсли;
		Исключение
			РезультатУспешно = Ложь;
		КонецПопытки;
		
		ДатаОперации = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C17").Текст;
		ДатаОперации1С = ПреобразоватьДатуВ1С(ДатаОперации, 3);
		
		СтанцияОперации = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C15").Текст;
		СтОперацииСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияОперации);
		
		СтанцияНазначения = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
		СтНазначенияСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияНазначения);
		
		СтанцияОтправления = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		СтОтправленияСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияОтправления);
		
		НомерНакладной = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C6").Текст;
		
		Если НЕ ЗначениеЗаполнено(ГрузополучательСсылка) Тогда РезультатУспешно = Ложь; Сообщить("Не найден грузополучатель " + Грузополучатель); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаОперации1С) Тогда РезультатУспешно = Ложь; Сообщить("Ошибка расчета даты операции " + ДатаОперации); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтОтправленияСсылка) Тогда РезультатУспешно = Ложь; Сообщить("Не найдена станция отправления " + СтанцияОтправления); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтНазначенияСсылка) Тогда РезультатУспешно = Ложь; Сообщить("Не найдена станция назначения " + СтанцияНазначения); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтОперацииСсылка) Тогда РезультатУспешно = Ложь; Сообщить("Не найдена станция операции " + СтанцияОперации); КонецЕсли;
		
		Если РежимЗагрузки = 0 И НЕ ЗначениеЗаполнено(ВагонСсылка) Тогда 
			РезультатУспешно = Ложь;
			Сообщить("Не заполнен вагон " + Вагон);
		КонецЕсли; 
		
		Нстр = ДислокацияВагонов.Добавить();
		Нстр.Вагон = ВагонСсылка;
		Нстр.ОперацияСВагоном = ОперацияВагона;
		Нстр.РабочийПарк = ИСТИНА;
		Нстр.ДатаОперации = ДатаОперации1С;
		Нстр.Груженый = ЗначениеЗаполнено(КонтейнерСсылка);
		Нстр.НомерПоезда = "";
		Нстр.ИндексПоезда = "";
		Нстр.КодГрузоотправителя = "";
		Нстр.КодГрузополучателя = "";
		Нстр.Собственник = СобственникСсылка;
		Нстр.КодГрузаЕТСНГ = КодГрузаЕТСНГ;
		Нстр.Груз = ГрузСсылка;
		Нстр.ВесГруза = ВесГрузаЧисло;
		Нстр.СтанцияОперации = СтОперацииСсылка;
		Нстр.СтанцияНазначения = СтНазначенияСсылка;
		
		Нстр = ДислокацияКонтейнеров.Добавить();
		Нстр.Контейнер = КонтейнерСсылка;
		Нстр.ДатаОперации = ДатаОперации1С;
		Нстр.ОперацияСВагоном = ОперацияВагона;
		Нстр.ТипКонтейнера = КонтейнерСсылка.ТипТЕ;
		Нстр.Груженый = ЗначениеЗаполнено(ГрузСсылка);
		Нстр.СтранаОтправления = ?(ЗначениеЗаполнено(СтОтправленияСсылка), СтОтправленияСсылка.Страна, неопределено);
		Нстр.СтранаНазначения = ?(ЗначениеЗаполнено(СтНазначенияСсылка), СтНазначенияСсылка.Страна, неопределено);
		Нстр.НомерНакладной = НомерНакладной;
		Нстр.Груз = ГрузСсылка;
		Нстр.КодГрузаЕТСНГ = КодГрузаЕТСНГ;
		Нстр.ВесГруза = ВесГрузаЧисло;
		Нстр.ИндексПоезда = "";
		Нстр.Вагон = ВагонСсылка;
		Нстр.НомерППВ = "";
		Нстр.СтанцияПогрузкиКонтейнера = СтОтправленияСсылка;
		Нстр.СтанцияПогрузкиВагона = СтОтправленияСсылка;
		Нстр.СтанцияОперации = СтОперацииСсылка;
		Нстр.СтанцияНазначения = СтНазначенияСсылка;
		
		Сч = Сч + 1;
		НазваниеОперации = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		
	КонецЦикла;

	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, "Загрузка дислокаций других государств");
	КонецЕсли;	
	// Евросиб Фролов)
	
	Если РезультатУспешно Тогда
		
		Для каждого Стр из ДислокацияВагонов Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Вагон) Тогда Продолжить; КонецЕсли;
			МЗ = РегистрыСведений.ДислокацияВагонов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Стр);
			МЗ.Период = Стр.ДатаОперации;
			МЗ.Записать(Истина);
		КонецЦикла;
		
		Для каждого Стр из ДислокацияКонтейнеров Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Контейнер) Тогда Продолжить; КонецЕсли;
			МЗ = РегистрыСведений.ДислокацияКонтейнеров.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Стр);
			МЗ.Период = Стр.ДатаОперации;
			МЗ.Записать(Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	
	Возврат РезультатУспешно;
	
КонецФункции

Процедура РазборИностраннойДислокации() Экспорт
	
	ПапкаВх = Константы.КаталогИностраннойДислокации.Получить() + "\in";;
	ПапкаУсп = Константы.КаталогИностраннойДислокации.Получить() + "\success";
	ПапкаНеус = Константы.КаталогИностраннойДислокации.Получить() + "\errors";
	УчЗаписьДислокации = Константы.ПочтовыйПрофильСлеженияИнТерриторий.Получить();
	
	// + получаю почту из профиля ин терр

	Если ЗначениеЗаполнено(УчЗаписьДислокации) Тогда
		Почта_сервер.СкачатьВсеВложенияИСохранитьВПапку(УчЗаписьДислокации, ПапкаВх);
	КонецЕсли;
	
	// -
	
	Если ЗначениеЗаполнено(ПапкаВх) Тогда
		СписокФайлов = НайтиФайлы(ПапкаВх, "*.xlsx", Ложь);
		Для каждого Стр из СписокФайлов Цикл
			
			РезультатЗагрузки = ЗагрузитьДислокациюПоФорматуМонголииExcel(Стр.ПолноеИмя);
			
			Если РезультатЗагрузки = Истина Тогда
				ПереместитьФайл(Стр.ПолноеИмя, ПапкаУсп+"\"+Стр.Имя);
			Иначе
				ПереместитьФайл(Стр.ПолноеИмя, ПапкаНеус+"\"+Стр.Имя);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

