&НаКлиенте
Процедура КомандаОК(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ПеренестиВДокумент = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ПеренестиВДокумент Тогда
		СтруктураРезультат = Новый Структура("ВалютаДокумента,КратностьВзаиморасчетов,КурсВзаиморасчетов,ДатаДокумента");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,ЭтаФорма);
		СтруктураРезультат.Вставить("ДатаДокумента",ЭтаФорма.Дата);
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"ВалютаДокумента,КратностьВзаиморасчетов,КурсВзаиморасчетов");
	Если Параметры.Свойство("АльтернативнаяВалютаДокумента") Тогда
		АльтернативнаяВалютаДокумента = Параметры.АльтернативнаяВалютаДокумента;
	КонецЕсли;
	ЭтаФорма.Дата = Параметры.ДатаДокумента;
КонецПроцедуры

&НаСервере
Функция ВалютаПриИзмененииНаСервере(ВалютаДокумента,Дата)
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Результат = ВалютаПриИзмененииНаСервере(ВалютаДокумента,Дата);
	КурсВзаиморасчетов = Результат.Курс;
	КратностьВзаиморасчетов = Результат.Кратность;
КонецПроцедуры

&НаСервере
Функция ДатаПриИзмененииНаСервере(ВалютаДокумента,Дата)
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Результат = ДатаПриИзмененииНаСервере(?(ЗначениеЗаполнено(АльтернативнаяВалютаДокумента), АльтернативнаяВалютаДокумента, ВалютаДокумента), Дата);
	КурсВзаиморасчетов = Результат.Курс;
	КратностьВзаиморасчетов = Результат.Кратность;
	
КонецПроцедуры
