
&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОчередьНаСервере()
	ФормированиеОтчетовПоЗапросу.ОбработатьОчередь();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОчередь(Команда)
	ОбработатьОчередьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтчет(ТокенПолученияОтчета)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТокенПолученияОтчета", ТокенПолученияОтчета);
	
	Возврат ФормированиеОтчетовПоЗапросу.ПолучитьОтчетПоТокену( ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураДанных));
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОтчет(Команда)
	
	ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран отчет");
		Возврат;
	КонецЕсли;
	
	XMLОтчета = ПолучитьОтчет(ТекущиеДанные.Токен);
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(XMLОтчета);
	Текст.Показать(""+ТекущиеДанные.Токен);
КонецПроцедуры
