
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Наименование = Объект.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиПриИзменении(Элемент)
	
	ОбновитьВсеТаблицы();
	ВидимостьСтраниц();
	
	ПримерСчФ = "";
	Для Каждого Стр Из  Объект.ОписаниеУслугиСчФ Цикл
		Если Стр.Использование Тогда
			ПримерСчФ = ПримерСчФ + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
		КонецЕсли;
	КонецЦикла;
	Элементы.ПримерДляСчФ.Заголовок = ПримерСчФ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьСтраниц();
	

КонецПроцедуры

&НаКлиенте
Процедура ОдинаковыйФорматПриИзменении(Элемент)
	ОбновитьВсеТаблицы();
	ВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСтраниц()
	
	Элементы.Группа3.ОтображатьЗаголовок = НЕ Объект.ОдинаковыйФормат; 
	Элементы.Группа4.Видимость = НЕ Объект.ОдинаковыйФормат;
	Элементы.Группа5.Видимость = НЕ Объект.ОдинаковыйФормат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеТаблицы()
	
	Если Объект.ОдинаковыйФормат Тогда
		Объект.ОписаниеУслугиСчет.Очистить();
		Объект.ОписаниеУслугиАкт.Очистить();
		Для Каждого Стр Из Объект.ОписаниеУслугиСчФ Цикл
			НовСтр1 = Объект.ОписаниеУслугиСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр1,Стр);
			НовСтр2 = Объект.ОписаниеУслугиАкт.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр2,Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиСчетПриИзменении(Элемент)
	ПримерСч = "";
	Для Каждого Стр Из Объект.ОписаниеУслугиСчет Цикл
		Если Стр.Использование Тогда
			ПримерСч = ПримерСч + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
		КонецЕсли;
	КонецЦикла;
	Элементы.ПримерДляСчета.Заголовок = ПримерСч;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиАктПриИзменении(Элемент)
	ПримерА = "";
	Для Каждого Стр Из Объект.ОписаниеУслугиАкт Цикл
		Если Стр.Использование Тогда
			ПримерА = ПримерА + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
		КонецЕсли;
	КонецЦикла;
	Элементы.ПримерДляАкта.Заголовок = ПримерА;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Переменные.Очистить();
	ТаблицаЗамен = ПравилаФормированияКлДокументовРасширенные.ПолучитьАктуальнуюТаблицуЗамен();
	Для каждого Стр из ТаблицаЗамен Цикл
		ЗаполнитьЗначенияСвойств(Переменные.Добавить(), Стр);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппироватьВыставляемыеРеализацииПосуточноПриИзменении(Элемент)
	Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
		Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина;	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ГруппироватьВыставляемыеРеализацииПосуточно1ПриИзменении(Элемент)
	Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
		Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина;	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельноПриИзменении(Элемент)
	Если Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Ложь Тогда
		Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("При выставлении реализаций посуточно отключать режим поконтейнерной экономики нельзя");
			Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура РазделениеКомплСтавкиНаСтрокиТекстУслугиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекД = Элементы.РазделениеКомплСтавкиНаСтроки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("КонецВводаТекстаУслуги", ЭтаФорма);
		ПоказатьВводСтроки(ОпОп, ТекД.ТекстУслуги, "Введите описание услуги", 1000, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецВводаТекстаУслуги(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		Элементы.РазделениеКомплСтавкиНаСтроки.ТекущиеДанные.ТекстУслуги = П1;
	КонецЕсли;
	
КонецПроцедуры
