
&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	
	ОчиститьРеквизитыФормы();
	
	Элементы.ГруппаОперации.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ТС) Тогда
		ПоискДислокации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыФормы()
	
	МассивРеквизитов = ЭтаФорма.ПолучитьРеквизиты();
	Для Каждого Элем Из МассивРеквизитов Цикл
		
		Если Элем.Имя = "ТС" Тогда
			Продолжить;
		КонецЕсли;
		Если Элем.Имя = "Груженый" Тогда
			Груженый = 1;
			Продолжить;
		КонецЕсли;
		
		Попытка 
			ЭтаФорма[Элем.Имя] = "" 
		Исключение 
		КонецПопытки;
		Попытка 
			ЭтаФорма[Элем.Имя] = Неопределено 
		Исключение 
		КонецПопытки;
		Попытка 
			ЭтаФорма[Элем.Имя].Очистить() 
		Исключение 
		КонецПопытки;
		Попытка 
			ЭтаФорма[Элем.Имя].Строки.Очистить() 
		Исключение 
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
	
&НаСервере
Процедура ПоискДислокации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК ТекущееМестоположение,
		|	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК ПунктНазначения,
		|	ДислокацияВагоновСрезПоследних.Период КАК ДатаОперации,
		|	ДислокацияВагоновСрезПоследних.Груз КАК Груз,
		|	ДислокацияВагоновСрезПоследних.Груженый КАК Груженый,
		|	ДислокацияВагоновСрезПоследних.РабочийПарк КАК РабочийПарк,
		|	ДислокацияВагоновСрезПоследних.ВесГруза КАК ВесГруза,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов.СрезПоследних(, Вагон = &НомерТС) КАК ДислокацияВагоновСрезПоследних";
	
	Запрос.УстановитьПараметр("НомерТС", ТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ВыборкаДетальныеЗаписи);
		ПунктОтправления = ВыборкаДетальныеЗаписи.ПунктНазначения;
		
	КонецЕсли;
	
	// Получить контейнеры по вагону из дислокации
	ЗапросКнт = Новый Запрос;
	ЗапросКнт.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДислокацияКонтейнеровСрезПоследних.Контейнер КАК ТЕ,
		|	ДислокацияКонтейнеровСрезПоследних.Груженый КАК Груженый
		|ИЗ
		|	РегистрСведений.ДислокацияКонтейнеров.СрезПоследних(, Вагон = &НомерВагона) КАК ДислокацияКонтейнеровСрезПоследних";
	
	ЗапросКнт.УстановитьПараметр("НомерВагона", ТС);
	
	РезультатЗапросаКнт = ЗапросКнт.Выполнить();
	
	ВыборкаДетальныеЗаписиКнт = РезультатЗапросаКнт.Выбрать();
	
	Пока ВыборкаДетальныеЗаписиКнт.Следующий() Цикл
		НовСтр = ТаблицаТЕ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписиКнт);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Новый Структура("Результат, АдресТаблицыОпераций", Истина, АдресТаблицыОпераций));

КонецПроцедуры

&НаКлиенте
Процедура ПодборСделки(Команда)
	
	ПараметрыОтбора = Новый Структура("СтанцияОтправления,СтанцияНазначения,ДатаОтправления",ПунктОтправления,СтанцияНазначения,ДатаОтправления);
	Оповещение = Новый ОписаниеОповещения("ОкончаниеВыбораСделки", ЭтаФорма);
	ОткрытьФорму("Документ.Операция.Форма.ФормаПодборСделки",ПараметрыОтбора,, ЭтаФорма,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораСделки(Результат = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Сделка = Результат.Сделка;
		РейсЖД = Результат.РейсЖД;
		СлужебнаяСделка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Евросиб Каблов М.Б. 14.11.2019 ( Необходимо создавать отдельные ЖД отправки (операции) на каждый вагон
//Процедура СоздатьОперациюНаСервере()
Процедура Удалить_СоздатьОперациюНаСервере()
//Евросиб Каблов М.Б. 14.11.2019 )
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ТС", Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТЗ.Колонки.Добавить("ТекущееМестоположение", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ.Колонки.Добавить("ДатаОперации", Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты));
	ТЗ.Колонки.Добавить("ДатаОтправления", Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты));
	ТЗ.Колонки.Добавить("ПунктНазначения", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ.Колонки.Добавить("Груженый", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрТЧ Из ТаблицаТС Цикл
		НовСтр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрТЧ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТС.ТС КАК ТС,
		|	ТаблицаТС.ТекущееМестоположение КАК ТекущееМестоположение,
		|	ТаблицаТС.ДатаОперации КАК ДатаОперации,
		|	ТаблицаТС.ДатаОтправления КАК ДатаОтправления,
		|	ТаблицаТС.ПунктНазначения КАК ПунктНазначения,
		|	ТаблицаТС.Груженый КАК Груженый
		|ПОМЕСТИТЬ СписокТС
		|ИЗ
		|	&ТаблицаТС КАК ТаблицаТС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТС.ТС КАК ТС,
		|	СписокТС.ТекущееМестоположение КАК ТекущееМестоположение,
		|	СписокТС.ДатаОперации КАК ДатаОперации,
		|	СписокТС.ДатаОтправления КАК ДатаОтправления,
		|	СписокТС.ПунктНазначения КАК ПунктНазначения,
		|	СписокТС.Груженый КАК Груженый
		|ИЗ
		|	СписокТС КАК СписокТС
		|ИТОГИ
		|	МАКСИМУМ(ТС),
		|	МАКСИМУМ(ДатаОтправления),
		|	МАКСИМУМ(ПунктНазначения),
		|	МАКСИМУМ(Груженый)
		|ПО
		|	ТекущееМестоположение,
		|	ДатаОперации";
	
	Запрос.УстановитьПараметр("ТаблицаТС",ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТекущееМестоположение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТекущееМестоположение.Следующий() Цикл
		ВыборкаДатаОперации = ВыборкаТекущееМестоположение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДатаОперации.Следующий() Цикл
			
			// Новая операция
			НоваяОперация = Документы.Операция.СоздатьДокумент();
			НоваяОперация.Дата = ТекущаяДата();
			
			НоваяОперация.Заполнить(Неопределено);
			
			НоваяОперация.РейсЖД = РейсЖД;
			НоваяОперация.ПланФакт = Перечисления.ПланФактСчет.План;

//Евросиб Каблов М.Б. 13.11.2019 (
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ВидыОпераций.Ссылка КАК Ссылка
			//	|ИЗ
			//	|	Справочник.ВидыОпераций КАК ВидыОпераций
			//	|ГДЕ
			//	|	ВидыОпераций.Наименование = &Наименование";
			//
			//Запрос.УстановитьПараметр("Наименование", "ЖД отправка");
			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			//	УслугаЖД = ВыборкаДетальныеЗаписи.Ссылка;
			//КонецЕсли;
			//
			//НоваяОперация.Услуга = УслугаЖД;
			НоваяОперация.Услуга = Справочники.ВидыОпераций.ЖДОтправка;
//Евросиб Каблов М.Б. 13.11.2019 )
			НоваяОперация.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
			НоваяОперация.ПунктОтправления = ВыборкаДатаОперации.ТекущееМестоположение;
			НоваяОперация.ПунктНазначения = ВыборкаДатаОперации.ПунктНазначения;
			
			НоваяОперация.ДатаОтправления = ВыборкаДатаОперации.ДатаОперации;
			НоваяОперация.ДатаНазначения = ВыборкаДатаОперации.ДатаОтправления;
			НоваяОперация.ТипДлительности = Перечисления.ЕдиницаИзмеренияДлительности.КалендарныйДень;
			
			Выборка = ВыборкаДатаОперации.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				// Заполняем ТЧ Грузы в операции
				НовСтрГрузы = НоваяОперация.Грузы.Добавить();
				ТСГУИД = Строка(Новый УникальныйИдентификатор);
				НовСтрГрузы.ТСГУИД = ТСГУИД;
				НовСтрГрузы.ТС = Выборка.ТС;
				НовСтрГрузы.ТипТС = Выборка.ТС.ТипТС;
				НовСтрГрузы.ГруженоеТС = Выборка.Груженый;
				
				// Связать вагоны и рейс
				МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
				МЗ.Вагон = Выборка.ТС;
				МЗ.Отправка = РейсЖД;
				МЗ.Период = ТекущаяДата();
				МЗ.Записать(Истина);
				
			КонецЦикла;
			
			НоваяОперация.Записать(РежимЗаписиДокумента.Проведение);
			
			СпОпер = СписокОпераций.Добавить();
			СпОпер.Операция = НоваяОперация.Ссылка;
			Сообщить("Создана операция " + НоваяОперация.Ссылка);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов М.Б. 14.11.2019 ( Необходимо создавать отдельные ЖД отправки (операции) на каждый вагон
&НаСервере
Функция ПодготовитьТаблицуОпераций(ЕстьНайденныеОперации = Ложь)
	
	Если ЗначениеЗаполнено(РейсЖД) Тогда
		ИРС_ГрузоотправительВРейсеЖД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РейсЖД, "ИРС_Грузоотправитель");
		Если ИРС_ГрузоотправительВРейсеЖД <> ИРС_Грузополучатель Тогда
			РейсЖДОбъект = РейсЖД.ПолучитьОбъект();
			РейсЖДОбъект.ИРС_Грузоотправитель = ИРС_Грузополучатель;
			РейсЖДОбъект.Записать();
		Конецесли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТС.ТекущееМестоположение КАК ТекущееМестоположение,
	|	ТаблицаТС.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаТС.ДатаОперации КАК ДатаОперации,
	|	ТаблицаТС.ДатаОтправления КАК ДатаОтправления,
	|	ТаблицаТС.ТС КАК ТС,
	|	ТаблицаТС.Грузополучатель КАК Грузополучатель,
	|	ТаблицаТС.НомерГУ КАК НомерГУ,
	|	ТаблицаТС.Груженый КАК Груженый
	|ПОМЕСТИТЬ ТаблицаТС
	|ИЗ
	|	&ТаблицаТС КАК ТаблицаТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТС.ТекущееМестоположение КАК ТекущееМестоположение,
	|	ТаблицаТС.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаТС.ДатаОперации КАК ДатаОперации,
	|	ТаблицаТС.ДатаОтправления КАК ДатаОтправления,
	|	ТаблицаТС.ТС КАК ТС,
	|	ТаблицаТС.Грузополучатель КАК Грузополучатель,
	|	ТаблицаТС.НомерГУ КАК НомерГУ,
	|	ТаблицаТС.Груженый КАК Груженый,
	|	ОперацияГрузы.Ссылка КАК Операция,
	|	СправочникТС.ТипТС КАК ТипТС,
	|	ПротоколОбменов.УИДИсточника КАК КодНазначенияИРС,
	|	ОперацияГрузы.Ссылка.Примечание КАК Примечание,
	|	ЛОЖЬ КАК ВыгруженаВИРС
	|ИЗ
	|	ТаблицаТС КАК ТаблицаТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК СправочникТС
	|			ПО ОперацияГрузы.ТС = СправочникТС.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО ОперацияГрузы.Ссылка = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.ДействиеПриОбмене = НЕОПРЕДЕЛЕНО)
	|				И (ПротоколОбменов.УзелОбмена = НЕОПРЕДЕЛЕНО)
	|		ПО ТаблицаТС.ТС = ОперацияГрузы.ТС
	|			И ТаблицаТС.ДатаОтправления = ОперацияГрузы.Ссылка.ДатаНазначения
	|			И ТаблицаТС.ТекущееМестоположение = ОперацияГрузы.Ссылка.ПунктОтправления
	|			И ТаблицаТС.ПунктНазначения = ОперацияГрузы.Ссылка.ПунктНазначения
	|			И (ОперацияГрузы.Ссылка.Услуга = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЖДОтправка))";
	Запрос.УстановитьПараметр("ТаблицаТС", ТаблицаТС.Выгрузить());
	
	ТаблицаОпераций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОпераций Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Операция) Тогда
			ЕстьНайденныеОперации = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОпераций, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СоздатьИВыгрузитьОперации(АдресТаблицы, ОбрабатыватьТолькоНеНайденные = Ложь, ЕстьОшибки = Ложь)
	
	ТаблицаОпераций = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	ТекДата = ТекущаяДатаСеанса();
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого СтрТаблицы Из ТаблицаОпераций Цикл
		
		Если ЗначениеЗаполнено(СтрТаблицы.Операция) Тогда
			
			ОперацияСсылка = СтрТаблицы.Операция;
			
			Если ОбрабатыватьТолькоНеНайденные Тогда
				СтрокаСозданнойОперации = СписокОпераций.Добавить();
				СтрокаСозданнойОперации.Операция = ОперацияСсылка;
				СтрокаСозданнойОперации.Сообщение = "ЖД отправка уже есть.";
				Продолжить;
			КонецЕсли;
			
			ОперацияОбъект = ОперацияСсылка.ПолучитьОбъект();
			ОперацияОбъект.Примечание = ?(ЗначениеЗаполнено(СтрТаблицы.НомерГУ),СтрТаблицы.НомерГУ,Примечание);
			ОперацияОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Иначе
			ОперацияОбъект = Документы.Операция.СоздатьДокумент();
			ОперацияОбъект.Дата = ТекДата;
			ОперацияОбъект.Заполнить(Неопределено);
			ОперацияОбъект.РейсЖД = РейсЖД;
			ОперацияОбъект.Услуга = Справочники.ВидыОпераций.ЖДОтправка;
			ОперацияОбъект.Валюта = ВалютаРеглУчета;
			
			ОперацияОбъект.ПунктОтправления = СтрТаблицы.ТекущееМестоположение;
			ОперацияОбъект.ПунктНазначения = СтрТаблицы.ПунктНазначения;			
			ОперацияОбъект.ДатаОтправления = СтрТаблицы.ДатаОперации;
			ОперацияОбъект.ДатаНазначения = СтрТаблицы.ДатаОтправления;
			ОперацияОбъект.Примечание = ?(ЗначениеЗаполнено(СтрТаблицы.НомерГУ),СтрТаблицы.НомерГУ,Примечание);
			ОперацияОбъект.ТипДлительности = Перечисления.ЕдиницаИзмеренияДлительности.КалендарныйДень;
					
			НовСтрГрузы = ОперацияОбъект.Грузы.Добавить();
			НовСтрГрузы.ТСГУИД = Строка(Новый УникальныйИдентификатор);
			НовСтрГрузы.ТС = СтрТаблицы.ТС;
			НовСтрГрузы.ТипТС = СтрТаблицы.ТипТС;
			НовСтрГрузы.ГруженоеТС = СтрТаблицы.Груженый;
			НовСтрГрузы.Грузополучатель = СтрТаблицы.Грузополучатель;
			
			ОперацияОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ОперацияСсылка = ОперацияОбъект.Ссылка;
			
		КонецЕсли;		
		
		ТекстСообщения = "";
		Если ПолучитьФункциональнуюОпцию("ОтправлятьНазначенияВИРС") Тогда			
						
			Успешно = Ложь;			
			ЕСОбменСервер.ВыгрузитьНазначениеВИРС(ОперацияСсылка, ?(ЗначениеЗаполнено(СтрТаблицы.Грузополучатель), СтрТаблицы.Грузополучатель, ИРС_Грузополучатель), ТипНазначения, Успешно, ТекстСообщения);
			
			Если Успешно Тогда
				ТекстСообщения = "ЖД отправка создана/перезаписана. " + ТекстСообщения;
				ОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрТаблицы.ВыгруженаВИРС = Истина;
			КонецЕсли;
			
		Иначе
			ТекстСообщения = "ЖД отправка создана.";
			ОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		СтрокаСозданнойОперации = СписокОпераций.Добавить();
		СтрокаСозданнойОперации.Операция = ОперацияСсылка;
		СтрокаСозданнойОперации.Сообщение = ТекстСообщения;		
		
		// Связать вагоны и рейс
		Если ЗначениеЗаполнено(РейсЖД) Тогда
			МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
			МЗ.Вагон = СтрТаблицы.ТС;
			МЗ.Отправка = РейсЖД;
			МЗ.Период = ТекДата;
			МЗ.Записать(Истина);
		КонецЕсли;
				
	КонецЦикла;
	АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаОпераций, Новый УникальныйИдентификатор());
	ЕстьОшибки = ТаблицаОпераций.НайтиСтроки(Новый Структура("ВыгруженаВИРС", Ложь)).Количество() > 0;
КонецПроцедуры
//Евросиб Каблов М.Б. 14.11.2019 )

&НаКлиенте
Процедура СоздатьОперацию(Команда)
	
	СписокОпераций.Очистить();
	
	Если ТаблицаТС.Количество()>0 Тогда
		
//Евросиб Каблов М.Б. 21.11.2019 (
		//Если НЕ ЗначениеЗаполнено(РейсЖД) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать операции! Не указан Рейс ЖД!");
		//	Возврат;			
		//КонецЕсли;
		
		//Если Не ЗначениеЗаполнено(ИРС_Грузополучатель) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать операции! Не указан Грузополучатель (ИРС)!");
		//	Возврат;
		//КонецЕсли;
		Для каждого СтрокаТаблица Из ТаблицаТС Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблица.Грузополучатель) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать операции! Не указан Грузополучатель (ИРС)!");
				Возврат;
			КонецЕсли; 
		КонецЦикла; 

		ЕстьНайденныеОперации = Ложь;
		АдресТаблицыОпераций = ПодготовитьТаблицуОпераций(ЕстьНайденныеОперации);
		
		Если ЕстьНайденныеОперации Тогда
			ОповещениеОВыборе = Новый ОписаниеОповещения("СоздатьОперацииПродолжение", ЭтаФорма, Новый Структура("АдресТаблицыОпераций", АдресТаблицыОпераций));
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Перезаписать", "Перезаписать");
			КнопкаПоУмолчанию = Кнопки.Добавить("ТолькоСоздатьНовые", "Только создать новые");
			Кнопки.Добавить("Отмена");
			ПоказатьВопрос(ОповещениеОВыборе, "Уже есть ЖД отправки по выбранным вагонам. Перезаписать их?", Кнопки,, "ТолькоСоздатьНовые");
		Иначе
			ЕстьОшибки = Ложь;
			СоздатьИВыгрузитьОперации(АдресТаблицыОпераций,,ЕстьОшибки);
			Если ЕстьОшибки = Ложь Тогда
				Закрыть(Новый Структура("Результат, АдресТаблицыОпераций", Истина, АдресТаблицыОпераций));
			КонецЕсли; 
		КонецЕсли;
//Евросиб Каблов М.Б. 21.11.2019 )
		
	Иначе
		СозданиеСделки();		
	КонецЕсли;
	
	Если СписокОпераций.Количество()>0 Тогда
		Элементы.ГруппаОперации.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОперацииПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	ЕстьОшибки = Ложь;
	Если Результат = "Перезаписать" Тогда
		СоздатьИВыгрузитьОперации(ДополнительныеПараметры.АдресТаблицыОпераций,,ЕстьОшибки);
	ИначеЕсли Результат = "ТолькоСоздатьНовые" Тогда
		СоздатьИВыгрузитьОперации(ДополнительныеПараметры.АдресТаблицыОпераций, Истина, ЕстьОшибки);
	КонецЕсли;
	
	Если СписокОпераций.Количество()>0 Тогда
		Элементы.ГруппаОперации.Видимость = Истина;
	КонецЕсли;
	АдресТаблицыОпераций = ДополнительныеПараметры.АдресТаблицыОпераций;
	//Закрыть(Новый Структура("Результат, АдресТаблицыОпераций", Истина, ДополнительныеПараметры.АдресТаблицыОпераций));
КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяСделка(Команда)
	
	Сделка = "";
	
	СозданиеСделки();
	
КонецПроцедуры

&НаСервере
Процедура СозданиеСделки()
	
	// Ищем транспортную схему в регистре
	ЗапросТСх = Новый Запрос;
	ЗапросТСх.Текст = 
		"ВЫБРАТЬ
		|	ТехнологическаяСхема.ТСх КАК ТСх
		|ИЗ
		|	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
		|ГДЕ
		|	ТехнологическаяСхема.ПредметТСх = &ПредметТСх
		|	И ТехнологическаяСхема.Вариант = &Вариант";
	
	ЗапросТСх.УстановитьПараметр("Вариант", "Фактическая");
	ЗапросТСх.УстановитьПараметр("ПредметТСх", Сделка);
	
	РезультатЗапросаТСх = ЗапросТСх.Выполнить();
	
	Если РезультатЗапросаТСх.Пустой() Тогда
		// Если не нашли сделку, то создать новую сделку и технологическую схему
		// Сделка
		НоваяСделка = Документы.Сделка.СоздатьДокумент();
		НоваяСделка.Дата = ТекущаяДата();
		НоваяСделка.Заполнить(Неопределено);
		НоваяСделка.СтанцияОтправления = ПунктОтправления;
		НоваяСделка.СтанцияНазначения = СтанцияНазначения;
		НоваяСделка.ПерваяОперация = ДатаОтправления;
		НоваяСделка.ЖДОтправка = ДатаОтправления;
		
		НоваяСделка.Записать(РежимЗаписиДокумента.Запись);
		Сделка = НоваяСделка.Ссылка;
		
		Сообщить("Создана сделка " + Сделка);
		
		// Технологическая схема
		НоваяТСх = Справочники.ТехнологическаяСхема.СоздатьЭлемент();
		НоваяТСх.Записать();
		
		МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.ПредметТСх = Сделка;
		МЗ.ТСх = НоваяТСх.Ссылка;
		МЗ.Вариант = "Фактическая";
		МЗ.Записать(Истина);
		
	Иначе
		ВыборкаДетальныеЗаписиТСх = РезультатЗапросаТСх.Выбрать();
		Если ВыборкаДетальныеЗаписиТСх.Следующий() Тогда
			НоваяТСх = ВыборкаДетальныеЗаписиТСх.ТСх.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	
	СтрТЧ = НоваяТСх.ТЧ.Добавить();
	
	// Новая операция
	НоваяОперация = Документы.Операция.СоздатьДокумент();
	НоваяОперация.Дата = ТекущаяДата();
	
	НоваяОперация.Заполнить(Неопределено);
	
	НоваяОперация.ПланФакт = Перечисления.ПланФактСчет.План;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОпераций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыОпераций КАК ВидыОпераций
		|ГДЕ
		|	ВидыОпераций.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "ЖД отправка");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		УслугаЖД = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	НоваяОперация.Услуга = УслугаЖД;
	НоваяОперация.Сделка = Сделка;
	НоваяОперация.Валюта = Сделка.Валюта;
	НоваяОперация.ПунктОтправления = ПунктОтправления;
	НоваяОперация.ПунктНазначения = СтанцияНазначения;
	
	НоваяОперация.ДатаОтправления = ДатаОтправления;
	НоваяОперация.ТипДлительности = Перечисления.ЕдиницаИзмеренияДлительности.КалендарныйДень;
	
	// Заполняем ТЧ Грузы в операции
	НовСтрГрузы = НоваяОперация.Грузы.Добавить();
	ТСГУИД = Строка(Новый УникальныйИдентификатор);
	НовСтрГрузы.ТСГУИД = ТСГУИД;
	НовСтрГрузы.ТС = ТС;
	НовСтрГрузы.ТипТС = ТС.ТипТС;
	НовСтрГрузы.ГруженоеТС = Груженый;
	
	// Связать вагоны и рейс
	Если ЗначениеЗаполнено(РейсЖД) Тогда
		МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
		МЗ.Вагон = ТС;
		МЗ.Отправка = РейсЖД;
		МЗ.Период = ТекущаяДата();
		МЗ.Записать(Истина);
	КонецЕсли;
	
	// Если на вагоне есть контейнеры, то заполняем по таблице контейнеров
	Для Каждого Стр Из ТаблицаТЕ Цикл
		НовСтрГрузы = НоваяОперация.Грузы.Добавить();
		НовСтрГрузы.ТСГУИД = ТСГУИД;
		НовСтрГрузы.ТС = ТС;
		НовСтрГрузы.ТипТС = ТС.ТипТС;
		НовСтрГрузы.ГруженоеТС = Груженый;
		
		ТЕГУИД = Строка(Новый УникальныйИдентификатор);
		НовСтрГрузы.ТЕГУИД = ТЕГУИД;
		НовСтрГрузы.ТЕ = Стр.ТЕ;
		НовСтрГрузы.ГруженоеТЕ = Истина;
		
	КонецЦикла;
		
	НоваяОперация.Записать(РежимЗаписиДокумента.Проведение);
	
	СозданнаяОперация = НоваяОперация.Ссылка;
	
	ЕдиничнаяОперация = СозданнаяОперация;
	
	Сообщить("Создана операция " + ЕдиничнаяОперация);
	
	// Заполняем табличную чать ТЧ в технологической схеме
	ЗаполнитьЗначенияСвойств(СтрТЧ,НоваяОперация); 
	СтрТЧ.ГУИД = ТСГУИД;
	СтрТЧ.Операция = СозданнаяОперация;
	
	НоваяТСх.Записать();
	
	//// Редактирование СДЕЛКИ
	ТекСделка = Сделка.ПолучитьОбъект();
	// Добавить в сделке в тч СвязьУчетныхЕдиниц Номер вагона
	Для Каждого Стр Из ТаблицаТЕ Цикл
		ТЧ_Тс_Те = ТекСделка.СвязьУчетныхЕдиниц.Добавить();
		ТЧ_Тс_Те.Вагон = ТС;
		ТЧ_Тс_Те.Контейнер = Стр.ТЕ;
	КонецЦикла;
	
	// Добавить в сделке расходы
	ТЧРасх = ТекСделка.Расходы.Добавить();
	ТЧРасх.Услуга = УслугаЖД;
	ТЧРасх.Груз = Груз;
	ТЧРасх.Операция = СозданнаяОперация;
	ТЧРасх.ГУИД = Строка(Новый УникальныйИдентификатор);
	ТЧРасх.Валюта = СозданнаяОперация.Валюта;
	ТЧРасх.НДСВключенВСтоимость = СозданнаяОперация.ВключаетНДС;
	ТЧРасх.Количество = 1;
	ТЧРасх.Себестоимость = СтоимостьПеревозки;
	//Евросиб СубботинВ #125845 09.12.2025 Начало // Добавить условие по дате?
	ТЧРасх.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	
	ТЧРасх.СебестоимостьИтого	= ТЧРасх.Себестоимость * ТЧРасх.Количество;
	ТЧРасх.СуммаНДС = ПолучитьСуммуНДС(ТЧРасх.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТЧРасх.СтавкаНДС), Истина, ТЧРасх.НДСВключенВСтоимость);
	ТЧРасх.СуммаИтого = ТЧРасх.СебестоимостьИтого + ?(ТЧРасх.НДСВключенВСтоимость, 0, ТЧРасх.СуммаНДС);
	
	ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Сделка.Организация);
	
	ТЧРасх.ПериодВО = ПериодБлокировки8;
	
	Попытка
		ТекСделка.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекСделка.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС, УчитыватьНДС, СуммаВключаетНДС) Экспорт
		Если (УчитыватьНДС) и (СуммаВключаетНДС) Тогда
			СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
			СуммаНДС = Сумма - СуммаБезНДС;
		Иначе
			СуммаБезНДС = Сумма;
		КонецЕсли;

		Если УчитыватьНДС Тогда 
			Если НЕ СуммаВключаетНДС Тогда
				СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
			КонецЕсли;
		Иначе
			СуммаНДС = 0;
		КонецЕсли;

		Возврат СуммаНДС;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//Евросиб Каблов М.Б. 21.11.2019 (
	Параметры.Свойство("СтанцияНазначения", СтанцияНазначения);
	Параметры.Свойство("ДатаОтправления", ДатаОтправления);
	Параметры.Свойство("РейсЖД", РейсЖД);
	
	ИРС_Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РейсЖД, "ИРС_Грузоотправитель");
//Евросиб Каблов М.Б. 21.11.2019 )
	
	Если Параметры.Свойство("СписокВагонов") Тогда
		//Евросиб Каблов М.Б. 08.01.2020 (
		Если Параметры.Свойство("Повагонка") Тогда
			ТаблицаВагонов = Параметры.СписокВагонов.Выгрузить(Новый Структура("Пометка", Истина), 
																		"НомерВагона,
																		|СтанцияНазначения,
																		|СтанцияПодачи,
																		|ДатаПлановогоОтправленияСоСтанцииПодачи,
																		|Грузоотправитель,
																		|НомерГУ");
			ТаблицаВагонов.Колонки.НомерВагона.Имя = "Вагон";
			ТаблицаВагонов.Колонки.СтанцияНазначения.Имя = "ТекЛокация";
			ТаблицаВагонов.Колонки.СтанцияПодачи.Имя = "ЛокацияНазначения";
			ТаблицаВагонов.Колонки.ДатаПлановогоОтправленияСоСтанцииПодачи.Имя = "ДатаОтправления";
			СоздаватьНазначенияВнутриОднойСтанции = Истина;
		Иначе
			ТаблицаВагонов = Параметры.СписокВагонов.Выгрузить(Новый Структура("Пометка", Истина), "Вагон, ТекЛокация, ЛокацияНазначения");
		КонецЕсли; 
		АдресТаблицыВагонов = ПоместитьВоВременноеХранилище(ТаблицаВагонов, УникальныйИдентификатор);
		//Евросиб Каблов М.Б. 08.01.2020 )
		ТаблицаТС.Очистить();
		//Евросиб Каблов М.Б. 08.01.2020 (
		//Для Каждого Стр Из Параметры.СписокВагонов Цикл
		//	Если НЕ Стр.Пометка Тогда
		//		Продолжить;
		//	КонецЕсли;
		Для Каждого Стр Из ТаблицаВагонов Цикл
		//Евросиб Каблов М.Б. 08.01.2020 (
//Евросиб Каблов М.Б. 21.11.2019 (
			//Евросиб Каблов 13.02.2020 ( 
			//Если Стр.ТекЛокация = СтанцияНазначения Тогда
			Если Стр.ТекЛокация = СтанцияНазначения Или Стр.ЛокацияНазначения = СтанцияНазначения Тогда
			//Евросиб Каблов 13.02.2020 )
				Продолжить;
			КонецЕсли;
//Евросиб Каблов М.Б. 21.11.2019 )
			ТекСтр = ТаблицаТС.Добавить();
			ТекСтр.ТС = Стр.Вагон;
			ТекСтр.ТекущееМестоположение = Стр.ТекЛокация;			
//Евросиб Каблов М.Б. 21.11.2019 (
			//ТекСтр.ДатаОперации = Стр.ПрибытиеНаСтанцию;
			//Если Параметры.Свойство("СтанцияНазначения") Тогда
			//	ТекСтр.ПунктНазначения = Параметры.СтанцияНазначения;
			//КонецЕсли;
			//Если Параметры.Свойство("ДатаОтправления") Тогда
			//	ТекСтр.ДатаОтправления = Параметры.ДатаОтправления;
			//КонецЕсли;
			//Если Параметры.Свойство("РейсЖД") Тогда
			//	РейсЖД = Параметры.РейсЖД;
			//КонецЕсли;
			ТекСтр.ДатаОперации = ТекущаяДатаСеанса();
			Если Параметры.Свойство("Повагонка") Тогда
				ТекСтр.ПунктНазначения = Стр.ЛокацияНазначения;
				ТекСтр.ДатаОтправления = Стр.ДатаОтправления;
				//ТекСтр.Грузополучатель = ПолучитьГрузополучателяИРС(Стр.Грузоотправитель);
				ТекСтр.Грузополучатель = Стр.Грузоотправитель;
				ТекСтр.НомерГУ 		   = Стр.НомерГУ;
			Иначе	
				ТекСтр.ПунктНазначения = СтанцияНазначения;
				ТекСтр.ДатаОтправления = ДатаОтправления;
			КонецЕсли; 
//Евросиб Каблов М.Б. 21.11.2019 )
		КонецЦикла;

	//Евросиб Каблов 13.02.2020 ( Перенес из процедуры при открытии
		Элементы.ГруппаОдинВагон.Видимость = Ложь;
		Элементы.ГруппаНесколькоВагонов.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаОдинВагон.Видимость = Истина;
		Элементы.ГруппаНесколькоВагонов.Видимость = Ложь;
	//Евросиб Каблов 13.02.2020 )
	КонецЕсли;
	
	ТипНазначения = 456797; //1.1.Под погрузку из под выгрузки
	Элементы.ТаблицаТССоздаватьНазначенияВнутриОднойСтанции.Пометка	= СоздаватьНазначенияВнутриОднойСтанции;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Функция ПолучитьГрузополучателяИРС(Грузоотправитель)
	ГрузополучательИРС = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	dbo_ES_vConsignors.Ссылка КАК Ссылка
	|ИЗ
	|	ВнешнийИсточникДанных.ИРС.Таблица.dbo_ES_vConsignors КАК dbo_ES_vConsignors
	|ГДЕ
	|	dbo_ES_vConsignors.ОКПО = &КодПоОКПО
	|	И dbo_ES_vConsignors.ИНН <> """"";
	Запрос.УстановитьПараметр("КодПоОКПО", Грузоотправитель.КодПоОКПО);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ГрузополучательИРС = РезультатЗапроса.Выгрузить()[0].Ссылка; 	
	КонецЕсли; 
	Возврат ГрузополучательИРС;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Евросиб Каблов 13.02.2020 ( Перенес в процедуру ПриСозданииНаСервере
	//Если ТаблицаТС.Количество()>0 Тогда
	//	Элементы.ГруппаОдинВагон.Видимость = Ложь;
	//	Элементы.ГруппаНесколькоВагонов.Видимость = Истина;
	//Иначе
	//	Элементы.ГруппаОдинВагон.Видимость = Истина;
	//	Элементы.ГруппаНесколькоВагонов.Видимость = Ложь;
	//КонецЕсли;
	//Евросиб Каблов 13.02.2020 )

	Элементы.ГруппаОперации.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяСделка1ПриИзменении(Элемент)

	Если СлужебнаяСделка Тогда
		Сделка = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИРС_ГрузополучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораГрузополучателяИРС", ЭтаФорма);
	ОткрытьФорму("ВнешнийИсточникДанных.ИРС.Таблица.ирс_Ссылки.Форма.ФормаСпискаГрузоотправителейГрузополучателей", Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГрузополучателяИРС(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ИРС_Грузополучатель = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

//Евросиб Каблов М.Б. 08.01.2020 (
&НаКлиенте
Процедура СоздаватьНазначенияВнутриОднойСтанции(Команда)
	
	СоздаватьНазначенияВнутриОднойСтанции = Не СоздаватьНазначенияВнутриОднойСтанции;
	Элементы.ТаблицаТССоздаватьНазначенияВнутриОднойСтанции.Пометка = СоздаватьНазначенияВнутриОднойСтанции;
	
	ПерезаполнитьТаблицуТС();
	
КонецПроцедуры
//Евросиб Каблов М.Б. 08.01.2020 )

//Евросиб Каблов М.Б. 08.01.2020 (
&НаСервере
Процедура ПерезаполнитьТаблицуТС()
	
	ТаблицаВагонов = ПолучитьИзВременногоХранилища(АдресТаблицыВагонов);
	ТаблицаТС.Очистить();
	Для Каждого Стр Из ТаблицаВагонов Цикл
		//Евросиб Каблов 13.02.2020 (
		//Если Не СоздаватьНазначенияВнутриОднойСтанции И Стр.ТекЛокация = СтанцияНазначения Тогда
		Если Не СоздаватьНазначенияВнутриОднойСтанции И (Стр.ТекЛокация = СтанцияНазначения Или Стр.ЛокацияНазначения = СтанцияНазначения) Тогда
		//Евросиб Каблов 13.02.2020 )
			Продолжить;
		КонецЕсли;
		ТекСтр = ТаблицаТС.Добавить();
		ТекСтр.ТС = Стр.Вагон;
		ТекСтр.ТекущееМестоположение = Стр.ТекЛокация;
		ТекСтр.ДатаОперации = ТекущаяДатаСеанса();
		ТекСтр.ПунктНазначения = СтанцияНазначения;
		ТекСтр.ДатаОтправления = ДатаОтправления;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТСГрузополучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораГрузоотправителяИРС", ЭтаФорма);
	ОткрытьФорму("ВнешнийИсточникДанных.ИРС.Таблица.ирс_Ссылки.Форма.ФормаСпискаГрузоотправителейГрузополучателей", Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГрузоотправителяИРС(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	текД = Элементы.ТаблицаТС.ТекущиеДанные;
	Если ВыбранноеЗначение <> Неопределено Тогда
		текД.Грузополучатель = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

//Евросиб Каблов М.Б. 08.01.2020 )
