//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ОпределитьГруппуДКС( СссылкаНаОбъект, ТипыКалькуляций = Неопределено ) Экспорт
	Результат = Справочники.ГруппыДКС.ПустаяСсылка();
	
	//загрузка из РИТМ
	
	
	//Релиз собственника
	Если ТипЗнч(СссылкаНаОбъект) = Тип("ДокументСсылка.РелизСобственника") Тогда
		Результат = Справочники.ГруппыДКС.ДМС;
	КонецЕсли;
	
	//Заявка
	Если ТипЗнч(СссылкаНаОбъект) = Тип("ДокументСсылка.Заявка") Тогда
		Если ТипЗнч(ТипыКалькуляций) = Тип("Массив") Тогда
			ПроверяемыТипы = ТипыКалькуляцийГруппыДМС();
			Для Каждого ТипКалькуляции Из ПроверяемыТипы  Цикл
				Если ТипыКалькуляций.Найти(ТипКалькуляции) <> Неопределено Тогда
					Результат = Справочники.ГруппыДКС.ДМС;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//Тип калькуляции
	Если ТипЗнч(СссылкаНаОбъект) = Тип("ПеречислениеСсылка.ТипыКалькуляций") Тогда
		ПроверяемыТипы = ТипыКалькуляцийГруппыДМС();
		Если ПроверяемыТипы.Найти(СссылкаНаОбъект) <> Неопределено Тогда
			Результат = Справочники.ГруппыДКС.ДМС;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец


//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ТипыКалькуляцийГруппыДМС() Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Перечисления.ТипыКалькуляций.Субсидии);
	МассивТипов.Добавить(Перечисления.ТипыКалькуляций.Доплатные);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	МассивТипов.Добавить(Перечисления.ТипыКалькуляций.ВыдачаКТКвРынок);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец   
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	МассивТипов.Добавить(Перечисления.ТипыКалькуляций.Премии);	
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	
	Возврат МассивТипов;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ЗапрещеноНезаполненноеЗначениеГруппыДКС(Дата) Экспорт
	
	Результат = Ложь;
	
	ДатаНачалаПроверкиЗаполненияГруппыДКС = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ДатаНачалаПроверкиЗаполненияГруппыДКС");
	
	Если ЗначениеЗаполнено(ДатаНачалаПроверкиЗаполненияГруппыДКС) Тогда
		Результат = Дата >= ДатаНачалаПроверкиЗаполненияГруппыДКС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец