Процедура ЗаписатьРегистрРучнойЗагрузки(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Ссылка КАК ДокументЗагрузки,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.НомерСтрокиЗагрузки КАК НомерСтрокиЗагрузки,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Контрагент КАК Контрагент,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ФедеральныйОкруг КАК ФедеральныйОкруг,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Город КАК Город,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Терминал КАК Терминал,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Станция КАК Станция,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Состояние КАК Состояние,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ДатаОперации КАК ДатаОперации,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ВидТранспорта КАК ВидТранспорта,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.НомерТранспорта КАК НомерТранспорта,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ФИОВодителя КАК ФИОВодителя,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ТипОперации КАК ТипОперации,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ЛинияПодсток КАК ЛинияПодсток,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.КомментарийТерминала КАК КомментарийТерминала,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ТипПодрядчика КАК ТипПодрядчика,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.КТК КАК КТК,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.СправочникОшибок,
		|	ЗагрузкаСтоковИнформацияПоТерминалам.ДатаВыхода
		|ИЗ
		|	Документ.ЗагрузкаСтоков.ИнформацияПоТерминалам КАК ЗагрузкаСтоковИнформацияПоТерминалам
		|ГДЕ
		|	ЗагрузкаСтоковИнформацияПоТерминалам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаЗагрузки Из Результат Цикл
		СтрокаРегистра = РегистрыСведений.РучнаяЗагрузкаСтоков.СоздатьМенеджерЗаписи();
		СтрокаРегистра.Период = Источник.Дата;
		ЗаполнитьЗначенияСвойств(СтрокаРегистра,СтрокаЗагрузки);
		СтрокаРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьРегистрЗагрузкиТерминалов(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗагрузкаСтоковТерминалы.Ссылка КАК ДокументЗагрузки,
		|	ЗагрузкаСтоковТерминалы.Терминал КАК Терминал,
		|	Ложь КАК Обработано,
		|	&ТекущаяДата КАК ДатаЗагрузки
		|ИЗ
		|	Документ.ЗагрузкаСтоков.Терминалы КАК ЗагрузкаСтоковТерминалы
		|ГДЕ
		|	ЗагрузкаСтоковТерминалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаЗагрузки Из Результат Цикл
		СтрокаРегистра = РегистрыСведений.ДатыЗагрузокДанныхПоТерминалам.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(СтрокаРегистра,СтрокаЗагрузки);
		СтрокаРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры