
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Вагоны") Тогда
		РежимРаботы = "Вагоны";
	ИначеЕсли Параметры.Свойство("КТК") Тогда
		РежимРаботы = "КТК";
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
		ТД.Область("R1C1").Текст = "Номер КТК";
//Евросиб Гудкова( 04.01.2020 
	ИначеЕсли Параметры.Свойство("Накладные") Тогда
		РежимРаботы = "Накладные";
		ВозвращатьСтроки = Истина;
// Евросиб Гудкова) 			
	КонецЕсли;
	Если Параметры.Свойство("ПередаватьИсходныеНомера") Тогда
		ВозвращатьСтроки = Истина;
	КонецЕсли;
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
	Сч = 2;
	Если Параметры.Свойство("Контрагент") Тогда
		ОбластьКонтрагент = "C" + Сч;
		ТД.Область("R1" + ОбластьКонтрагент).Текст = "Контрагент";
		ТД.Область("R1" + ОбластьКонтрагент).ШиринаКолонки = 50;
    	ЕстьКонтрагент = Истина;
		Сч = Сч + 1;
		Элементы.ВозвращатьСтроки.Видимость = Ложь;
	КонецЕсли;
// Евросиб Гудкова) 	
	Если Параметры.Свойство("РазмерКТК") Тогда
		ПоказыватьРазмерКТК = Параметры.РазмерКТК;
//Евросиб Гудкова( 17.09.2020 Ticket№ 0204605
		ОбластьРазмерКТК = "C" + Сч;
		ТД.Область("R1" + ОбластьРазмерКТК).Текст = "Размер КТК";
		ТД.Область("R1" + ОбластьРазмерКТК).ШиринаКолонки = 10;
		Сч = Сч + 1;
// Евросиб Гудкова) 		
	КонецЕсли;

	Если Параметры.Свойство("ПоказыватьДатуВзятия") Тогда
		ОбластьДатаВзятия = "C" + Сч;
		ДопСекция = ТД.ПолучитьОбласть("R1" + ОбластьДатаВзятия);//Гудкова "R1C3");
		ТД.Область("R1" + ОбластьДатаВзятия).Текст = "Дата взятия";
		ТД.Область("R1" + ОбластьДатаВзятия).ШиринаКолонки = 20;
    	//ТД.Присоединить(ДопСекция, 1, ТД.ВысотаТаблицы, ТД.ШиринаТаблицы);
		ПоказыватьДатуВзятия = Истина;
		Сч = Сч + 1;
	КонецЕсли;
	
	Если Параметры.Свойство("ПрибытиеНаТерминалОтпр") Тогда
		ОбластьПрибытиеНаТерминалОтпр = "C" + Сч;
		ТД.Область("R1" + ОбластьПрибытиеНаТерминалОтпр).Текст = "Дата приема в пользование";
		ТД.Область("R1" + ОбластьПрибытиеНаТерминалОтпр).ШиринаКолонки = 25;
    	ПоказатьПрибытиеНаТерминалОтпр = Истина;
		Сч = Сч + 1;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаДоставкиГруза") Тогда
		ОбластьДатаДоставкиГруза = "C" + Сч;
		ТД.Область("R1" + ОбластьДатаДоставкиГруза).Текст = "Дата доставки груза";
		ТД.Область("R1" + ОбластьДатаДоставкиГруза).ШиринаКолонки = 25;
    	ПоказатьДатаДоставкиГруза = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДатаПриемаВСток") Тогда
		ОбластьДатаПриемаВСток = "C" + Сч;
		ТД.Область("R1" + ОбластьДатаПриемаВСток).Текст = "Дата приема в сток";
		ТД.Область("R1" + ОбластьДатаПриемаВСток).ШиринаКолонки = 20;
    	ЕстьДатаПриемаВСток = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("НомерТС") Тогда
		ОбластьНомерТС = "C" + Сч;
		ТД.Область("R1" + ОбластьНомерТС).Текст = "Номер ТС";
		ТД.Область("R1" + ОбластьНомерТС).ШиринаКолонки = 15;
    	ЕстьНомерТС = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("ВодительТС") Тогда
		ОбластьВодительТС = "C" + Сч;
		ТД.Область("R1" + ОбластьВодительТС).Текст = "Водитель";
		ТД.Область("R1" + ОбластьВодительТС).ШиринаКолонки = 100;
    	ЕстьВодительТС = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
// Евросиб Гудкова) 	
	Если Параметры.Свойство("Автовставка") Тогда
		Автовставка = Истина;
	Иначе
		Автовставка = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ФорматДаты") Тогда
		ФорматДаты = Параметры.ФорматДаты;
	КонецЕсли;
	//++ Зубов US 33131 TA 38910 29.10.2021
	Если Параметры.Свойство("ВозвращатьСтрокиНедоступно") Тогда
		ВозвращатьСтрокиНедоступно = Параметры.ВозвращатьСтрокиНедоступно;
	КонецЕсли;
	//-- Зубов US 33131 TA 38910 29.10.2021
	//++ Зубов Ticket#0250132 15.11.2021
	Если Параметры.Свойство("СоздаватьКТК") Тогда
		СоздаватьКТК = Параметры.СоздаватьКТК;
	Иначе
		СоздаватьКТК = Ложь;
	КонецЕсли;
	//-- Зубов Ticket#0250132 15.11.2021
	
	//++ Зубов US 45162 TA 45703 21.01.2022
	Если Параметры.Свойство("ПериодДействияРелиза") Тогда
		ПериодДействияРелиза = Параметры.ПериодДействияРелиза;
	Иначе
		ПериодДействияРелиза = Неопределено;
	КонецЕсли;
	//-- Зубов US 45162 TA 45703 21.01.2022
	
	РефрижераторныйКТК = Ложь;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация5.Видимость = ?(РежимРаботы = "КТК",Истина,Ложь);
	Элементы.Декорация6.Видимость = ?(РежимРаботы = "КТК",Истина,Ложь);
	Элементы.РезультатДатаВзятия.Видимость = ?(ПоказыватьДатуВзятия,Истина,Ложь);
	Элементы.РезультатДатаДоставкиГруза.Видимость = ?(ПоказатьДатаДоставкиГруза,Истина,Ложь);
	Элементы.РезультатВремяПрибытияНаТерминал.Видимость = ?(ПоказатьПрибытиеНаТерминалОтпр,Истина,Ложь);
	Элементы.ФорматДаты.Видимость = ?(ПоказыватьДатуВзятия ИЛИ ПоказатьДатаДоставкиГруза,Истина,Ложь);
	Элементы.РезультатДатаПриемаВСток.Видимость = ?(ЕстьДатаПриемаВСток,Истина,Ложь);
	Элементы.РезультатКонтрагент.Видимость = ?(ЕстьКонтрагент,Истина,Ложь);
	Элементы.РезультатСтрокаКонтрагент.Видимость = ?(ЕстьКонтрагент,Истина,Ложь);
	Элементы.РезультатВодительТС.Видимость = ?(ЕстьВодительТС,Истина,Ложь);
	Элементы.РезультатНомерТС.Видимость = ?(ЕстьНомерТС,Истина,Ложь);
	//++ Зубов US 33131 TA 38910 29.10.2021
	Элементы.ВозвращатьСтроки.ТолькоПросмотр = ?(ВозвращатьСтрокиНедоступно,Истина,Ложь);
	//-- Зубов US 33131 TA 38910 29.10.2021
	Если Автовставка Тогда
		// необходимо установить обработчик ожидания для работы механизма копирования/вставки через WScript.Shell
		// в противном случае, скрипт не успевает вставить данные в форму, а 1С уже проверяет их наличие
		ПодключитьОбработчикОжидания("ПроверкаСодержимогоЯчейки", 0.1, Истина);
		
		wsh=Новый COMОбъект("WScript.Shell");    
		ЭтаФорма.ТекущийЭлемент = Элементы.ТД;
		Элементы.ТД.ТекущаяОбласть = ЭтаФорма.ТД.Область("R2C1");
		wsh.SendKeys("^v");
		wsh.SendKeys("^м");
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	ПроверкаСодержимогоЯчейки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСодержимогоЯчейки() 
	
	Сч = 2;
	Результат.Очистить();
	
	ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	
	// блок для проверки копирования/вставки
	Если ПрочСтрока = "" Тогда
		Возврат;
	КонецЕсли;
	ОтключитьОбработчикОжидания("ПроверкаСодержимогоЯчейки");
	///////////////////////
	
	Пока ПрочСтрока <> "" Цикл
		
//Евросиб Гудкова( 17.09.2020 Ticket№ 0204605
//было		СтрокаРазмерКТК = ТД.Область("R"+Сч+"C2").Текст;
		СтрокаРазмерКТК = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьРазмерКТК).Текст);
// Евросиб Гудкова) 			
		Если ПоказыватьДатуВзятия Тогда
			СтрокаДата = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаВзятия).Текст);
		КонецЕсли;
		Если ПоказатьПрибытиеНаТерминалОтпр Тогда
			СтрДатаПрибытия = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьПрибытиеНаТерминалОтпр).Текст);
		КонецЕсли;
		Если ПоказатьДатаДоставкиГруза Тогда
			СтрДатаДоставкиГруза = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаДоставкиГруза).Текст);
		КонецЕсли;
		НСтр = Результат.Добавить();
		НСтр.ПрочитаннаяСтрока = ПрочСтрока;
		Если РежимРаботы = "Вагоны" Тогда
			НСтр.ПрочитаннаяСсылка = Грузы_сервер.НайтиВагон(ПрочСтрока);
		КонецЕсли;
//Евросиб Гудкова( 04.01.2020 
		Если Режимработы = "Накладные" Тогда
			НСтр.ПрочитаннаяСсылка = НайтиНакладную(ПрочСтрока);
		КонецЕсли;
// Евросиб Гудкова) 			
		Если РежимРаботы = "КТК" Тогда
			НСтр.РазмерКТКСтрока = СокрЛП(СтрокаРазмерКТК);
			//ДИТ Шевченко А.В. 60130 23.11.2022 -начало
			//НСтр.РазмерКТК = ?(РефрижераторныйКТК, ПолучитьТипоразмерРефрижераторныйКТК(СокрЛП(СтрокаРазмерКТК)),ПолучитьТипоразмерКТК(СокрЛП(СтрокаРазмерКТК)));
			НСтр.РазмерКТК = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(СокрЛП(СтрокаРазмерКТК),РефрижераторныйКТК,ПрочСтрока);
			//ДИТ Шевченко А.В. 60130 23.11.2022 -конец
			НСтр.ВычисленноеКонтрольноеЧисло = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
			НСтр.КонтрольноеЧислоПользователя = Прав(ПрочСтрока,1);
			Если ПоказыватьДатуВзятия Тогда
				//++ Зубов US 33131 TA 43877 16.12.2021
				//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
				НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока,НСтр.РазмерКТК);
				
				// ++ ДИТ Поморцева Т.П. Задача 45162 01.02.2022.				
				Если СоздаватьКТК И НЕ ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда					
					Если ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
						НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
					Иначе
						Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет создан.");
					КонецЕсли;
				КонецЕсли;
				// -- ДИТ Поморцева Т.П. Задача 45162 01.02.2022.
				
				НСтр.РазмерКТК = ВыбратьНужныйРазмерКТК(НСтр.РазмерКТК,НСтр.ПрочитаннаяСсылка);
				//-- Зубов US 33131 TA 43877 16.12.2021
				
				//++ Зубов US 45162 TA 45703 21.01.2022
				НСтр.ДатаВзятия = ПреобразованиеВДату(СтрокаДата);
				Если (НСтр.ДатаВзятия < ПериодДействияРелиза.ДатаНачала ИЛИ НСтр.ДатаВзятия > ПериодДействияРелиза.ДатаОкончания) И НЕ НСтр.ДатаВзятия = Дата("00010101") Тогда			
					Сообщить("По КТК "+НСтр.ПрочитаннаяСсылка+" дата взятия "+НСтр.ДатаВзятия+" не будет перенесена в документ, так как она не входит в период действия релиза "+ПериодДействияРелиза);
					НСтр.ДатаВзятия = Дата("00010101");
				КонецЕсли;
				//++ Зубов US 45162 TA 45703 21.01.2022
			Иначе
				//++ Зубов Ticket#0250132 15.11.2021
				//++ Зубов US 33131 TA 43877 16.12.2021
				//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока); 
				
				НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока,НСтр.РазмерКТК);
				
				// ++ ДИТ Поморцева Т.П. Задача 45162 01.02.2022. Условие было после заполнения НСтр.РазмерКТК =, перенесено,  так как тогда РазмерКТК не заполнялся
				Если СоздаватьКТК И НЕ ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда
					
					Если ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
						НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
					Иначе
						Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет создан.");
						//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
					КонецЕсли;
					
					НСтр.РазмерКТК = ВыбратьНужныйРазмерКТК(НСтр.РазмерКТК,НСтр.ПрочитаннаяСсылка);
					//-- Зубов US 33131 TA 43877 16.12.2021				
					
					//Иначе
					//Евросиб Каблов 15.10.2021 ( Task 39043
					//НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
					//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
					//Евросиб Каблов 15.10.2021 )
				КонецЕсли;
								
				//Пункт 6.2 
				Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И ВЭксплуатации(НСтр.ПрочитаннаяСсылка) Тогда					
					Результат.Удалить(НСтр);
					НомерТекущейСтроки = Сч-1;
					Сообщить("Контейнер в строке " + Строка(НомерТекущейСтроки) + " имеется в АРМ КТК с открытым циклом пользования");
					Сч = Сч + 1;
					ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
  					Продолжить;
				КонецЕсли;
				
				//Пункт 6.6
				Если ЭтоРефрижераторныйКТК(Лев(ПрочСтрока,4)) Тогда
					НомерТекущейСтроки = Сч-1;					
					Сообщить("Возможно, контейнер  " + Строка(ПрочСтрока) + " (строка " + Строка(НомерТекущейСтроки) + ") является рефрижераторным. Если это так, установите признак «Рефрижераторный КТК» в окне вставки контейнеров из буфера обмена при добавлении этого КТК в заявку.».");		
				КонецЕсли;
				
				//Пункт 6.7
				Если Не ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
					Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет добавлен.");
				КонецЕсли;
				
				
				//Пункт 7.2
				МассивКорректныхТипоразмеров = Новый Массив;
				МассивКорректныхТипоразмеров.Добавить("20RF");
				МассивКорректныхТипоразмеров.Добавить("40RFH");
				МассивКорректныхТипоразмеров.Добавить("45RFH");
				Если РефрижераторныйКТК И СтрДлина(НСтр.РазмерКТКСтрока) > 2 И МассивКорректныхТипоразмеров.Найти(НСтр.РазмерКТКСтрока) = Неопределено Тогда
					НСтр.РазмерКТК = ПолучитьПустуюСсылкуТипоразмерыТЕ();
					НомерТекущейСтроки = Сч-1;					
					Сообщить("Указанный в строке  " + Строка(НомерТекущейСтроки) + " тип не соответствует типу рефрижераторного контейнера. Измените/удалите тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");		
				КонецЕсли;
				
				//Пункт 6.8
				Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда					
					ТипТЕИзКарточкиКонтейнера = ПолучитьТипТЕ(НСтр.ПрочитаннаяСсылка);
					Если ТипТЕИзКарточкиКонтейнера <> Неопределено Тогда
						НСтр.РазмерКТК = ТипТЕИзКарточкиКонтейнера.СсылкаТипТЕ;
						ВведенРазмер = СтрДлина(СтрокаРазмерКТК) = 2;
						ВведенТипоРаземер = СтрДлина(СтрокаРазмерКТК) > 2;					
						Если (ВведенРазмер И СтрокаРазмерКТК <> ТипТЕИзКарточкиКонтейнера.Размер)  ИЛИ (ВведенТипоРаземер И СтрокаРазмерКТК <> ТипТЕИзКарточкиКонтейнера.ТипТЕ) Тогда
							НомерТекущейСтроки = Сч-1;
							Сообщить("Введенные данные о типоразмере контейнера в строке " + Строка(НомерТекущейСтроки) + " не соответствуют имеющимся в карточке контейнера. В область прочитанных данных внесен типоразмер из карточки контейнера.");					
						КонецЕсли;						
					КонецЕсли;					
				КонецЕсли;
										
				//-- Зубов Ticket#0250132 15.11.2021
			КонецЕсли;
			Если ПоказатьПрибытиеНаТерминалОтпр Тогда
				НСтр.ВремяПрибытияНаТерминал = ПреобразованиеВДату(СтрДатаПрибытия);
			КонецЕсли;
			Если ПоказатьДатаДоставкиГруза Тогда
				НСтр.ДатаДоставкиГруза = ПреобразованиеВДату(СтрДатаДоставкиГруза);
			КонецЕсли; 
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
			Если ЕстьВодительТС Тогда
				НСтр.ВодительТС = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьВодительТС).Текст);
			КонецЕсли;
			Если ЕстьДатаПриемаВСток Тогда
				НСтр.ДатаПриемаВСток = ПреобразованиеВДату(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаПриемаВСток).Текст);
			КонецЕсли;
			Если ЕстьКонтрагент Тогда
				СтрКонтрагент = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьКонтрагент).Текст);
				Нстр.Контрагент = ПолучитьКонтрагентаПоСинониму(СтрКонтрагент);
				Нстр.СтрокаКонтрагент = СтрКонтрагент;
			КонецЕсли;
			Если ЕстьНомерТС Тогда
				НСтр.НомерТС = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьНомерТС).Текст);
			КонецЕсли;
// Евросиб Гудкова)
		КонецЕсли;
		
		Сч = Сч + 1;
		ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	КонецЦикла;
	
	// после распознавания, если стоит флаг "Автовставка", вызвать процедуру переноса значений в документ
	Если Автовставка Тогда
		ПеренестиВДокументКлиент();
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьТипоразмерКТК(РазмерКТКСтрока) 
	
	//Евросиб СубботинВ #82679 18.06.2024 Начало //  переделал на использование общего модуля 

	//Рез = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	//
	//Если РазмерКТКСтрока = "20" Или РазмерКТКСтрока = "40" Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ТипоразмерыТЕ.Ссылка КАК Ссылка
	//	               |ИЗ
	//	               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	//	               |ГДЕ
	//	               |	ТипоразмерыТЕ.ИспользоватьПоУмолчаниюДляКТКУказанногоРазмера
	//	               |	И ТипоразмерыТЕ.РазмерКТК.Наименование = &Наименование";
	//	Запрос.УстановитьПараметр("Наименование",РазмерКТКСтрока);
	//	
	//	Ответ = Запрос.Выполнить().Выбрать();
	//	
	//	Если Ответ.Следующий() Тогда
	//		Рез = Ответ.Ссылка;
	//	КонецЕсли;
	//Иначе //Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
	//	Рез = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(РазмерКТКСтрока), Истина);
	//КонецЕсли; 
	//
	//Возврат Рез;
	Возврат РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(РазмерКТКСтрока).Тип;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
КонецФункции
	
&НаСервереБезКонтекста
Функция НайтиКТК(Знач НомерКТК, РазмерКТК) //++ Зубов US 33131 TA 43877 16.12.2021 добавили размер ктк
	
	Результат = Неопределено;
	Если НомерКТК = "" Тогда Возврат Результат; КонецЕсли;
	НомерКТК = СтрЗаменить(НомерКТК, " ", "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.ПС, "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.Таб, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТЕ.Ссылка КАК Ссылка,
	               |	ТЕ.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	ТЕ.Префикс = &Префикс
	               |	И ТЕ.Номер = &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТЕ.ПометкаУдаления";
	Запрос.УстановитьПараметр("Префикс", Лев(ВРег(НомерКТК), 4));
	Запрос.УстановитьПараметр("Номер", Сред(НомерКТК, 5, 6));
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Если Результат <> Неопределено И Результат.ПометкаУдаления = Истина Тогда
		РезОбъект = Результат.ПолучитьОбъект();
		РезОбъект.ПометкаУдаления = Ложь;
		РезОбъект.Записать();
	КонецЕсли;
	
	//++ Зубов US 33131 TA 43877 16.12.2021
	Если Результат <> Неопределено И НЕ ЗначениеЗаполнено(Результат.ТипТЕ) И ЗначениеЗаполнено(РазмерКТК) Тогда
		РезОбъект = Результат.ПолучитьОбъект();
		РезОбъект.ТипТЕ = РазмерКТК;
		РезОбъект.Записать();
	КонецЕсли;
	//-- Зубов US 33131 TA 43877 16.12.2021
	Возврат Результат;
	
КонецФункции

//Евросиб Гудкова( 04.01.2020 
&НаСервереБезКонтекста
Функция НайтиНакладную(НомерНакладной) 
	
	Результат = Неопределено;
	Если НомерНакладной = "" Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	НЕ ТранспортныйДокумент.ПометкаУдаления
	               |	И ТранспортныйДокумент.НомерТранспортногоДокумента = &Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.ДатаТранспортногоДокумента УБЫВ";
	Запрос.УстановитьПараметр("Наименование", НомерНакладной);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Евросиб Гудкова) 
&НаКлиенте
Функция ПреобразованиеВДату(ТекДата)
	
	Если ФорматДаты = 2 Тогда
		
		Возврат ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(ТекДата, 5);
		
	КонецЕсли;
	
	Рез = Неопределено;
	
	ТекДата = СокрЛП(ТекДата);	
 	КоличествоСимволов = СтрДлина(ТекДата);
	Год = "";
	Месяц = "";
	День = "";
	Час = "0";
	Минута = "0";
	Секунда = "0";
	ЧастьДаты = 0;
	
	Для Сч = 1 По КоличествоСимволов Цикл
		Код = КодСимвола(Сред(ТекДата,Сч)); 
		// Цифры: 48 - 57
		Если Код < 48 ИЛИ Код>57 Тогда 
			// нашли разделитель
			ЧастьДаты = ЧастьДаты + 1;
		Иначе
			Если ФорматДаты = 0 Тогда
				// всего есть от 3 до 6 частей даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
				Если ЧастьДаты = 0 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 3 Тогда
					Час = Строка(Час) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 4 Тогда
					Минута = Строка(Минута) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 5 Тогда
					Секунда = Строка(Секунда) + Строка(Сред(ТекДата,Сч,1));
				КонецЕсли;
				// для этого формата всего есть 3 части даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
			ИначеЕсли ФорматДаты = 1 Тогда
				Если ЧастьДаты = 0 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Год) = 2 Тогда
		Год = Строка("20") + Строка(Год);
	КонецЕсли;
	Если СтрДлина(Месяц) = 1 Тогда
		Месяц = Строка("0") + Строка(Месяц);
	КонецЕсли;
	Если СтрДлина(День) = 1 Тогда
		День = Строка("0") + Строка(День);
	КонецЕсли;
	Если СтрДлина(Час) = 1 Тогда
		Час = Строка("0") + Строка(Час);
	КонецЕсли;
	Если СтрДлина(Минута) = 1 Тогда
		Минута = Строка("0") + Строка(Минута);
	КонецЕсли;
	Если СтрДлина(Секунда) = 1 Тогда
		Секунда = Строка("0") + Строка(Секунда);
	КонецЕсли;
	
	Попытка
		Рез = Дата(Год,Месяц,День,Час,Минута,Секунда);
	Исключение
		Рез = Неопределено;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции
	
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокументКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументКлиент()
	
	Результат8 = Новый Массив;
	РезультатДаты = Новый Массив;
	РезДатыПрибытНаТерм = Новый Массив;
	РезультатРазмерКТК = Новый Массив;
	РезультатКонтрагент = Новый Массив;
	РезультатДатаПриемаВСток = Новый Массив;
	РезультатВодительТС = Новый Массив;
	РезультатНомерТС = Новый Массив;
	РезДатыДоставкиГруза = Новый Массив;
	ВсеХорошо = Истина;
	
	Если ВозвращатьСтроки тогда
		
		Для каждого Стр из Результат Цикл
			Если ЗначениеЗаполнено(Стр.ПрочитаннаяСтрока) Тогда
				Результат8.Добавить(Стр.ПрочитаннаяСтрока);
				РезультатДаты.Добавить(Стр.ДатаВзятия);
				РезДатыПрибытНаТерм.Добавить(Стр.ВремяПрибытияНаТерминал);
				РезультатРазмерКТК.Добавить(Стр.РазмерКТКСтрока);
				РезультатКонтрагент.Добавить(Стр.Контрагент);
				РезультатДатаПриемаВСток.Добавить(НачалоДня(Стр.ДатаПриемаВСток));
				РезультатВодительТС.Добавить(Стр.ВодительТС);
				РезультатНомерТС.Добавить(Стр.НомерТС);
				РезДатыДоставкиГруза.Добавить(Стр.ДатаДоставкиГруза);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для каждого Стр из Результат Цикл
			Если ЗначениеЗаполнено(Стр.ПрочитаннаяСсылка) Тогда
				Если ЕстьКонтрагент И НЕ ЗначениеЗаполнено(Стр.Контрагент) Тогда
					ВсеХорошо = Ложь;
					Продолжить;
				КонецЕсли; 
				Результат8.Добавить(Стр.ПрочитаннаяСсылка);
				РезультатДаты.Добавить(Стр.ДатаВзятия);
				РезДатыПрибытНаТерм.Добавить(Стр.ВремяПрибытияНаТерминал);
				РезультатРазмерКТК.Добавить(Стр.РазмерКТК);
				РезультатКонтрагент.Добавить(Стр.Контрагент);
				РезультатДатаПриемаВСток.Добавить(НачалоДня(Стр.ДатаПриемаВСток));
				РезультатВодительТС.Добавить(Стр.ВодительТС);
				РезультатНомерТС.Добавить(Стр.НомерТС);
				РезДатыДоставкиГруза.Добавить(Стр.ДатаДоставкиГруза);
			Иначе
				ВсеХорошо = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураМассивов = Новый Структура;
	СтруктураМассивов.Вставить("КТК",Результат8);
	СтруктураМассивов.Вставить("РазмерКТК",РезультатРазмерКТК);
	СтруктураМассивов.Вставить("ДатыКТК",РезультатДаты);
	СтруктураМассивов.Вставить("ДатыПрибытияНаТерм",РезДатыПрибытНаТерм);
	СтруктураМассивов.Вставить("ДатыДоставкиГруза",РезДатыДоставкиГруза);
	СтруктураМассивов.Вставить("Контрагент",РезультатКонтрагент);
	СтруктураМассивов.Вставить("ДатаПриемаВСток",РезультатДатаПриемаВСток);
	СтруктураМассивов.Вставить("ВодительТС",РезультатВодительТС);
	СтруктураМассивов.Вставить("НомерТС",РезультатНомерТС);
	
	Если ПоказыватьДатуВзятия ИЛИ ПоказатьПрибытиеНаТерминалОтпр ИЛИ ПоказыватьРазмерКТК Или ЕстьКонтрагент ИЛИ ПоказатьДатаДоставкиГруза Тогда
		ЧтоВозвращаем = СтруктураМассивов;
	Иначе
		ЧтоВозвращаем = Результат8;
	КонецЕсли;
	
	Если ВсеХорошо Тогда
		Закрыть(ЧтоВозвращаем);
	Иначе
		
		ОпОп = Новый ОписаниеОповещения("ВопросПереноса", ЭтаФорма, Новый Структура("СписокРезультат", ЧтоВозвращаем));
		ПоказатьВопрос(ОпОп, "Не все строки найдены. При переносе позиции без найденных строк будут пропущены. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПереноса(Параметр1 = неопределено, Параметр2 = неопределено) экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да Тогда
		Закрыть(Параметр2.СписокРезультат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТДПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	// проверять только КТК
	Если не РежимРаботы = "КТК" Тогда
		Возврат;
	КонецЕсли;
	
	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл ЧислаМ.Добавить(Строка(Сч)); КонецЦикла;
	
	Сч = 2;

	СохраненныйБелый = ТД.Область("R1C4").ЦветФона;
	
	ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	
	Пока ПрочСтрока <> "" Цикл
		Если СтрДлина(ПрочСтрока) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
		КонецЕсли;
		Если СтрДлина(ПрочСтрока) <> 11 //////   \/ добавил вот это 
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(ПрочСтрока,1)) = неопределено  
			ИЛИ (СтрДлина(ПрочСтрока) = 11 И НЕ Число(Прав(ПрочСтрока,1)) = КонтрольныйЗнак) Тогда
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = WebЦвета.Розовый;
		Иначе
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		Сч = Сч + 1;
		ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Пауза()
    Для Инд = 0 По 10000 Цикл
        
    КонецЦикла;
КонецПроцедуры    

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоСинониму(Контрагент)

	Возврат КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Контрагент);

КонецФункции // ПолучитьКонтрагентаПоСинониму()

//++ Зубов US 33131 TA 43877 16.12.2021
&НаСервере
Функция ВыбратьНужныйРазмерКТК(Знач РазмерКТК,КТК)
	//Если ЗначениеЗаполнено(КТК) Тогда
	//	Если ЗначениеЗаполнено(КТК.ТипТЕ) Тогда
	//		Если РазмерКТК = КТК.ТипТЕ Тогда
	//			Возврат РазмерКТК;
	//		Иначе
	//			Возврат КТК.ТипТЕ;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;      
	//Евросиб - АСуслов 04.01.2022 13:54:49 #45081
	//(
	Если ЗначениеЗаполнено(КТК) Тогда                                             
		ТипТЕ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КТК, "ТипТЕ");
		Если ЗначениеЗаполнено(ТипТЕ) Тогда
			РазмерКТК = ТипТЕ;
		КонецЕсли;
	КонецЕсли;
	Возврат РазмерКТК;
	//)
	//Евросиб - АСуслов 04.01.2022 13:54:50 #45081
КонецФункции
//-- Зубов US 33131 TA 43877 16.12.2021 

&НаСервереБезКонтекста
Функция ВЭксплуатации(СсылкаНаКонтейнер)

	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК тек_Статус,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_НаСлежении КАК тек_НаСлежении,
		|	стоки_ТекущиеДанныеСрезПоследних.Инвентаризация КАК Инвентаризация
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
	
	Запрос.УстановитьПараметр("КТК", СсылкаНаКонтейнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.тек_ВЭксплуатации; 	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипТЕ(ПрочитаннаяСсылка)
	
	Результат = Новый Структура;	
	Если ЗначениеЗаполнено(ПрочитаннаяСсылка.ТипТЕ) Тогда
		Результат.Вставить("СсылкаТипТЕ", ПрочитаннаяСсылка.ТипТЕ);
		Результат.Вставить("Размер", Лев(ПрочитаннаяСсылка.ТипТЕ.Наименование,2)); 
		Результат.Вставить("ТипТЕ", ПрочитаннаяСсылка.ТипТЕ.Наименование);
		Возврат Результат; 
	Иначе
		Возврат Неопределено; 	
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТипоразмерРефрижераторныйКТК(РазмерКТКСтрока) 
	
	Рез = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	
	Если РазмерКТКСтрока = "20" Или РазмерКТКСтрока = "40" Или РазмерКТКСтрока = "45" Тогда		
		НаименованиеДляПоиска = РазмерКТКСтрока; 	
		Если РазмерКТКСтрока = "20" Тогда 			
			НаименованиеДляПоиска = НаименованиеДляПоиска + "RF";
		ИначеЕсли РазмерКТКСтрока = "40" Или РазмерКТКСтрока = "45" Тогда
			НаименованиеДляПоиска = НаименованиеДляПоиска + "RFH";
		КонецЕсли;	
		Рез = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(НаименованиеДляПоиска), Истина);
	Иначе //Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
		Рез = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(РазмерКТКСтрока), Истина);
	КонецЕсли; 
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Функция ЭтоРефрижераторныйКТК(Префикс) 
	
	МассивПерификсов = Новый Массив;
	
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("KKFU");
	МассивПерификсов.Добавить("AKLU"); 
	МассивПерификсов.Добавить("EISU");
	МассивПерификсов.Добавить("CBMU");
	МассивПерификсов.Добавить("LCLU");
	МассивПерификсов.Добавить("BTCU");
	МассивПерификсов.Добавить("NSRU");
	МассивПерификсов.Добавить("KZEU");
	МассивПерификсов.Добавить("RFUU");
	МассивПерификсов.Добавить("IRSU");
	МассивПерификсов.Добавить("SEBU");
	МассивПерификсов.Добавить("IIIU");
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("MORU");
	МассивПерификсов.Добавить("TTSU");
	МассивПерификсов.Добавить("GCEU");
	МассивПерификсов.Добавить("VEZU");
	МассивПерификсов.Добавить("FRIU");
	МассивПерификсов.Добавить("CRLU");
	МассивПерификсов.Добавить("MWCU");
	МассивПерификсов.Добавить("MSWU");
	МассивПерификсов.Добавить("MMAU");
	МассивПерификсов.Добавить("RSVU");
	МассивПерификсов.Добавить("RRSU");
	МассивПерификсов.Добавить("MNBU");
	МассивПерификсов.Добавить("APRU");
	МассивПерификсов.Добавить("TTUU");
	МассивПерификсов.Добавить("AVGU");
	МассивПерификсов.Добавить("NARU");
	МассивПерификсов.Добавить("SSUU");
	МассивПерификсов.Добавить("SSSU");
	МассивПерификсов.Добавить("MPBU");
	МассивПерификсов.Добавить("MCUU");
	МассивПерификсов.Добавить("MNFU");
	
	Если МассивПерификсов.Найти(Префикс) <> Неопределено Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуТипоразмерыТЕ()
	Возврат Справочники.ТипоразмерыТЕ.ПустаяСсылка();	
КонецФункции
