
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ТекСтрока из ЭтотОбъект Цикл
		// если получили операцию, по которой необходимо информировать пользователя, 
		// занести данные в РС РассылкаПоОперациям
		Если ТекСтрока.ОперацияСВагоном.ИнформироватьПользователей Тогда
			МенеджерЗаписи = РегистрыСведений.РассылкаПоОперациям.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Контейнер = ТекСтрока.Контейнер;
			МенеджерЗаписи.Операция = ТекСтрока.ОперацияСВагоном;
			МенеджерЗаписи.Период = ТекСтрока.Период;
			МенеджерЗаписи.Записать();
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры