
Процедура ИмпортироватьСведенияИзДанныхСтарогоФормата(ДоговорСсылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыТЧ.Ссылка КАК Договор,
	|	ДоговорыТЧ.КомпанияФактор КАК КомпанияФактор,
	|	ДоговорыТЧ.ДатаНачалаФакторинга КАК ДатаНачалаФакторинга,
	|	ДоговорыТЧ.ДатаОкончанияФакторинга КАК ДатаОкончанияФакторинга
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.удалить_Факторинг КАК ДоговорыТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО ДоговорыТЧ.Ссылка = ИсторияФакторинга.Договор
	|			И ДоговорыТЧ.ДатаНачалаФакторинга = ИсторияФакторинга.Период
	|ГДЕ
	|	ДоговорыТЧ.КомпанияФактор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И ДоговорыТЧ.ДатаНачалаФакторинга <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДоговорыТЧ.Ссылка = &Договор
	|	И ИсторияФакторинга.Договор ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ДатаНачалаФакторинга,
	|	ДатаОкончанияФакторинга УБЫВ
	|ИТОГИ ПО
	|	Договор";
	
	Если ЗначениеЗаполнено(ДоговорСсылка) Тогда
		Запрос.УстановитьПараметр("Договор", ДоговорСсылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыТЧ.Ссылка = &Договор", "");
	КонецЕсли;
	
	
	ВыгрузкаДоговор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыгрузкаДоговор.Следующий() Цикл
		
		Набор = РегистрыСведений.ИсторияФакторинга.СоздатьНаборЗаписей();
		Набор.Отбор.Договор.Установить(ВыгрузкаДоговор.Договор);
		
		НачалоФакторинга = Неопределено;
		
		ВыгрузкаНабор = ВыгрузкаДоговор.Выбрать();
		
		Пока ВыгрузкаНабор.Следующий() Цикл
			
			Если ВыгрузкаНабор.ДатаНачалаФакторинга = НачалоФакторинга Тогда
				Продолжить;
			КонецЕсли;
			
			НачалоФакторинга = ВыгрузкаНабор.ДатаНачалаФакторинга;
			
			Запись = Набор.Добавить();
			
			Запись.Активность          = Истина;
			Запись.Период              = НачалоФакторинга;
			Запись.Договор             = ВыгрузкаДоговор.Договор;
			Запись.ДоговорКомпанииФактор      = ВыгрузкаНабор.КомпанияФактор;
			Запись.НачалоФакторинга    = НачалоФакторинга;
			Запись.ОкончаниеФакторинга = ВыгрузкаНабор.ДатаОкончанияФакторинга;
			
		КонецЦикла;
		
		Набор.Записать(Ложь);  // Ложь - не стираем существующие записи
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументПроходитПоФакторингу(ДокСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = Новый Структура("ДоговорКонтрагента, ДатаДокумента");
	ЗаполнитьЗначенияСвойств(Реквизиты, ДокСсылка);
	
	Если Не ЗначениеЗаполнено(Реквизиты.ДоговорКонтрагента) Или Не ЗначениеЗаполнено(Реквизиты.ДатаДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Примечание к запросу: Учтен тот факт, что в регистре "Период" всегда равен ресурсу "НачалоФакторинга"
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Наличие
	|ИЗ
	|	РегистрСведений.ИсторияФакторинга.СрезПоследних(&ДатаДокумента, Договор = &Договор) КАК Срез
	|ГДЕ
	|	Срез.Договор.ИспользуетсяФакторинг
	|	И (Срез.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Срез.ОкончаниеФакторинга >= &ДатаДокумента)";
	
	Запрос.УстановитьПараметр("Договор", Реквизиты.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДатаДокумента", Реквизиты.ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

//Евросиб Каблов 02.06.2021  Ticket#0230677
Функция ПолучитьДанныеПоФакторингу(Ссылка) Экспорт
	
	//Евросиб - АСуслов 13.09.2022 11:22:13 #
	//(
	Результат = Новый Структура("Факторинг, ДополнительнаяИнформацияФакторинг, ДоговорКонтрагента", Ложь, "");
	//)
	//Евросиб - АСуслов 13.09.2022 11:22:14 #
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	|	ВЫБОР
	|		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Факторинг,
	|	ТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО ТаблицаДокумента.ДоговорКонтрагента = ИсторияФакторинга.Договор
	|			И ТаблицаДокумента.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	|			И (ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ТаблицаДокумента.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", ИмяОбъекта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


