
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Рез = КорректировкиРТУСервер.СоздатьАннулированиеВознагражденияИзСписка(ПараметрКоманды);
	ОповеститьОбИзменении(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ОповеститьОбИзменении(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	ОповеститьОбИзменении(Тип("ДокументСсылка.КорректировкаРеализации"));
	Оповестить("ОбновленыПризнакиРазрешенияКорректировокРТУ");
	
	Если ЗначениеЗаполнено(Рез) Тогда
		ПоказатьЗначение(, Рез);
	КонецЕсли;
	
КонецПроцедуры
