
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокОснование = ПолучитьДокОснование(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  ДокОснование);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

&НаСервере
Функция ПолучитьДокОснование(ТекДок)
	
	Док = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроцессСогласования.ДокументСогласования КАК ДокументСогласования
	               |ИЗ
	               |	Справочник.ПроцессСогласования КАК ПроцессСогласования
	               |ГДЕ
	               |	ПроцессСогласования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ТекДок);
	Док = Запрос.Выполнить().Выгрузить()[0].ДокументСогласования;
	
	Возврат Док;
	
КонецФункции