#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = Параметры.Заголовок;
	
	// Евросиб Фролов (28.03.2022 Task №49126
	ВыбранныеПодстоки.ЗагрузитьЗначения(Параметры.ВыбранныеПодстоки);
	СписокЛокаций = Параметры.СписокЛокаций;
	//Если СписокЛокаций.Количество() > 0 Тогда
		ПодстокиКонтейнеров.Параметры.УстановитьЗначениеПараметра("СписокЛокаций", СписокЛокаций);
	//Иначе
	//	// Изменить текст запроса
	//	ПодстокиКонтейнеров.ТекстЗапроса = СтрЗаменить(ПодстокиКонтейнеров.ТекстЗапроса, "ЛокацииПодстокиКонтейнеров.Ссылка В(&СписокЛокаций)", "Истина");
	//
	//КонецЕсли;	
	// Евросиб Фролов)

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура ПодстокиКонтейнеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Евросиб Фролов (28.03.2022 Task №49126
	//ОповеститьОВыборе(Элемент.ТекущиеДанные.НаименованиеПодстока);
	
	Если ВыбранныеПодстоки.НайтиПоЗначению(Элемент.ТекущиеДанные.НаименованиеПодстока) = Неопределено Тогда
		ВыбранныеПодстоки.Добавить(Элемент.ТекущиеДанные.НаименованиеПодстока);
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПодсток(Команда)
	// Евросиб Фролов (28.03.2022 Task №49126
	ТекущиеДанные = Элементы.ПодстокиКонтейнеров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Не указан подсток для выбора");
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеПодстоки.НайтиПоЗначению(ТекущиеДанные.НаименованиеПодстока) = Неопределено Тогда
		ВыбранныеПодстоки.Добавить(ТекущиеДанные.НаименованиеПодстока);
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	// Евросиб Фролов (28.03.2022 Task №49126
	//ТекущиеДанные = Элементы.ПодстокиКонтейнеров.ТекущиеДанные;
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	ПоказатьПредупреждение(, "Не указан подсток для выбора");
	//	Возврат;
	//КонецЕсли;
	
	//ОповеститьОВыборе(ТекущиеДанные.НаименованиеПодстока);
	МассивПодстоков = ВыбранныеПодстоки.ВыгрузитьЗначения();
	ОповеститьОВыборе(МассивПодстоков);
	// Евросиб Фролов)
КонецПроцедуры
  
&НаКлиенте
Процедура Отмена(Команда)
	// Евросиб Фролов (28.03.2022 Task №49126
	Закрыть();
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти