
Процедура СоздатьТранспортныйДокументПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.э_Накладная") Тогда
		
		СуществующаяЖДН = НайтиЖДНПоНомеру(Источник.Ссылка);
		Если СуществующаяЖДН = неопределено Тогда
			НовыйТД = Документы.ТранспортныйДокумент.СоздатьДокумент();
		Иначе
			НовыйТД = СуществующаяЖДН.ПолучитьОбъект();
		КонецЕсли;
		
//Евросиб Гудкова( 03.01.2020
		НовыйТД.Заполнить(Источник);
		НовыйТД.Записать();
		 
		//НовыйТД.Дата = ТекущаяДата();
		//НовыйТД.НакладнаяЭТРАН = Источник.Ссылка;
		//НовыйТД.НомерТранспортногоДокумента = Источник.Номер;
		//НовыйТД.ДатаТранспортногоДокумента = Источник.Дата;
		//НовыйТД.Организация = Константы.ОсновнаяОрганизация.Получить();
		//НовыйТД.Контрагент = Константы.КонтрагентДляЖДН.Получить();
//		НовыйТД.ЖДН = Истина;
		//НовыйТД.Записать(РежимЗаписиДокумента.Запись);
		//Попытка
		//	НовыйТД.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//КонецПопытки;
// Евросиб Гудкова) 		
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЖДНПоНомеру(НакладнаяЭТРАН, ВключаяПомеченныеНаУдаление = ЛОЖЬ) Экспорт
	
	Результат = неопределено;
	
	Если НЕ ЗначениеЗаполнено(НакладнаяЭТРАН) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	ТранспортныйДокумент.НакладнаяЭТРАН = &НакладнаяЭТРАН
				   |    И НЕ ТранспортныйДокумент.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Дата УБЫВ"; 
	Если ВключаяПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ТранспортныйДокумент.ПометкаУдаления", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("НакладнаяЭТРАН", НакладнаяЭТРАН);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 10.08.2020
Функция НайтиТранспортныйДокумент(НомерТД, ДатаНакладной, ВидОперации, ИдентификаторТД = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерТД", НомерТД);
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	//Евросиб - АСуслов 11.12.2021 13:55:12 #
	//(
	Запрос.УстановитьПараметр("ДатаНакладной", ДатаНакладной);
	//Евросиб - АСуслов 29.04.2022 11:11:39 #
	//(был поиск по строке, а в накладной ид - число.
	Запрос.УстановитьПараметр("НакладнаяИД", СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ИдентификаторТД)); 
	//)
	//Евросиб - АСуслов 29.04.2022 11:11:39 #
	
	//ДИТ Шевченко А.В. TASK 54264 06.07.2022 -Начало // Добавил дополнительную выборку поиск накладной по НомерТДТолькоЦифрыБезЛидНулей
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТранспортныйДокумент.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ТранспортныйДокумент.ДатаТранспортногоДокумента, &ДатаНакладной, ДЕНЬ) > 0
	|			ТОГДА РАЗНОСТЬДАТ(ТранспортныйДокумент.ДатаТранспортногоДокумента, &ДатаНакладной, ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаНакладной, ТранспортныйДокумент.ДатаТранспортногоДокумента, ДЕНЬ)
	|	КОНЕЦ КАК ПериодПриближения
	|ИЗ
	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ГДЕ
	|	ТранспортныйДокумент.НомерТранспортногоДокумента = &НомерТД
	|	И НЕ ТранспортныйДокумент.ПометкаУдаления
	|	И ТранспортныйДокумент.ВидОперации = &ВидОперации
	|   И ТранспортныйДокумент.НакладнаяЭТРАН.ТекущееСостояниеНакладнойДействующийСтатус
	//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало
	|	И (НАЧАЛОПЕРИОДА(ТранспортныйДокумент.ДатаТранспортногоДокумента, ГОД) = НАЧАЛОПЕРИОДА(&ДатаНакладной, ГОД)
	|			ИЛИ ТранспортныйДокумент.ДатаТранспортногоДокумента Между НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНакладной, МЕСЯЦ, -1), МЕСЯЦ) И &ДатаНакладной)
	//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодПриближения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТранспортныйДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ГДЕ
	|  ТранспортныйДокумент.НакладнаяЭТРАН.НакладнаяИД <> 0 И
	|	ТранспортныйДокумент.НакладнаяЭТРАН.НакладнаяИД = &НакладнаяИД
	|	И ТранспортныйДокумент.НакладнаяЭТРАН.ТекущееСостояниеНакладнойДействующийСтатус";
	
	Результат = Запрос.ВыполнитьПакет();
	Если НЕ Результат[1].Пустой() Тогда
		Накладная = Результат[1].Выгрузить()[0].Ссылка;
	ИначеЕсли НЕ Результат[0].Пустой() Тогда
		Накладная = Результат[0].Выгрузить()[0].Ссылка;
	Иначе
		//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало (закомментировал область, поиск по номеру ТД (только цифры) неактуален)
		////ДИТ Шевченко А.В. TASK 54264 06.07.2022 -Начало
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ТранспортныйДокумент.Ссылка КАК Ссылка,
		//|	ВЫБОР
		//|		КОГДА РАЗНОСТЬДАТ(ТранспортныйДокумент.ДатаТранспортногоДокумента, &ДатаНакладной, ДЕНЬ) > 0
		//|			ТОГДА РАЗНОСТЬДАТ(ТранспортныйДокумент.ДатаТранспортногоДокумента, &ДатаНакладной, ДЕНЬ)
		//|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаНакладной, ТранспортныйДокумент.ДатаТранспортногоДокумента, ДЕНЬ)
		//|	КОНЕЦ КАК ПериодПриближения
		//|ИЗ
		//|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		//|ГДЕ
		//|	ТранспортныйДокумент.НомерТранспортногоДокумента ПОДОБНО ""%"" + &НомерТДТолькоЦифрыБезЛидНулей
		//|	И НЕ ТранспортныйДокумент.ПометкаУдаления
		//|	И ТранспортныйДокумент.ВидОперации = &ВидОперации
		//|   И ТранспортныйДокумент.НакладнаяЭТРАН.ТекущееСостояниеНакладнойДействующийСтатус
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ПериодПриближения";
		//НомерТДТолькоЦифры 			   = СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(НомерТД,Истина,Ложь,Ложь);
		//НомерТДТолькоЦифрыБезЛидНулей  = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерТДТолькоЦифры, "0");
		//Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		//Запрос.УстановитьПараметр("ДатаНакладной", ДатаНакладной);
		//Запрос.УстановитьПараметр("НомерТДТолькоЦифрыБезЛидНулей", НомерТДТолькоЦифрыБезЛидНулей);
		//Результат = Запрос.Выполнить();
		//Если Результат.Пустой() Тогда
		//	Накладная = Неопределено;
		//КонецЕсли;	
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Накладная = Выборка.Ссылка;			
		//КонецЦикла;
		////ДИТ Шевченко А.В. TASK 54264 06.07.2022 -Конец
		//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
	КонецЕсли;
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Накладная = Выборка.Ссылка;
	//Иначе
	//	Накладная = Неопределено;
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 11.12.2021 13:55:13 #
	
	Возврат Накладная;
	
КонецФункции

Процедура ЗаполнитьТранспортныйДокументПоНакладнойЭтрана(СсылкаТД, СсылкаНакладная) Экспорт

	

КонецПроцедуры

// Евросиб Фролов (21.12.2021 TASK №43345
Функция ПолучитьСписокИСФ_XML_ФНС(НачалоПериода, КонецПериода) Экспорт
	
	//Получение списка СФ, у которых есть XML в формате ФНС
	ТипЧисло10 = ОбщегоНазначения.ОписаниеТипаЧисло(10);
	
	ИмяОперации = "GetEtranInvoicesFNSWithXML";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("date_from",	НачалоПериода);
	СтруктураПараметров.Вставить("date_to",		КонецПериода);
		
	ЗапросXML = ПолучитьТекстЗапросаВебСервису(СтруктураПараметров);
	
	ОтветXML = ВебСервисы_сервер.ЗапроситьРИТМ(ИмяОперации, ЗапросXML);
	Если СтрДлина(ОтветXML) < 48 Тогда
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("НакладнаяИД", ТипЧисло10);
		Возврат ТаблицаДанных;
	КонецЕсли; 
	
	ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветXML, "invoiceID");
	
	// Добавим колонку с числовыми значениями идентификаторов
	ТаблицаДанных.Колонки.Добавить("НакладнаяИД", ТипЧисло10);
	
	// Преобразуем строковые значения идентификаторов в числовые
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		ТекущаяСтрока.НакладнаяИД = ТипЧисло10.ПривестиЗначение(ТекущаяСтрока.invoiceID);
	КонецЦикла;	
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьТекстЗапросаВебСервису(ПараметрыЗапроса = Неопределено) Экспорт
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("windows-1251"); 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("root");
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметр Из ПараметрыЗапроса Цикл
			ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", Параметр.Ключ, Параметр.Значение));
		КонецЦикла;
	КонецЕсли;
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции

Процедура ДобавитьЭлементВФайл(Файл, ИмяЭлемента, Значение, Атрибуты = Неопределено)
	
	Файл.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	
	Если Атрибуты <> Неопределено Тогда
		Для Каждого Атрибут Из Атрибуты Цикл
			ДобавитьАтрибутВФайл(Файл, Атрибут.Ключ, Атрибут.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ДобавитьАтрибутВФайл(Файл, ИмяЭлемента, Значение)
	
	Файл.ЗаписатьНачалоАтрибута(ИмяЭлемента);		
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецАтрибута();
	
КонецПроцедуры
// Евросиб Фролов)    

Процедура ЗаменитьНеВалидныеНакладныеВАкцептах() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АкцептУслуги.Ссылка КАК Акцепт
		|ПОМЕСТИТЬ ВТ_АктуальныеАкцепты
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка.Проведен
		|	И АкцептУслуги.Ссылка.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
		|	И НЕ АкцептУслуги.Ссылка В
		|				(ВЫБРАТЬ
		|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
		|				ИЗ
		|					Документ.Акцепт КАК Акцепт
		|				ГДЕ
		|					Акцепт.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АктуальныеАкцепты.Акцепт КАК Акцепт,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.ТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента,
		|	АкцептУслуги.ТранспортныйДокумент.ДатаТранспортногоДокумента КАК ДатаТранспортногоДокумента
		|ИЗ
		|	ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
		|		ПО ВТ_АктуальныеАкцепты.Акцепт = АкцептУслуги.Ссылка
		|			И (АкцептУслуги.ТранспортныйДокумент.ПометкаУдаления
		|				ИЛИ АкцептУслуги.ТранспортныйДокумент.НакладнаяЭТРАН.ПометкаУдаления
		|				ИЛИ НЕ АкцептУслуги.ТранспортныйДокумент.НакладнаяЭТРАН.ТекущееСостояниеНакладной.ДействующийСтатус)
		|			И (АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка))
//Евросиб Гудкова( 08.09.2022 Ticket№ 54710
//				   |	И АкцептУслуги.ВыгруженаВРИТМ = ЛОЖЬ
				   |	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
// Евросиб Гудкова)
		|ИТОГИ ПО
		|	Акцепт,
		|	ТранспортныйДокумент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАкцепт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАкцепт.Следующий() Цикл
		
		АкцептОб = ВыборкаАкцепт.Акцепт.ПолучитьОбъект();
		
		ВыборкаТранспортныйДокумент = ВыборкаАкцепт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		НеобходимаЗапись = Ложь;
		
		Пока ВыборкаТранспортныйДокумент.Следующий() Цикл
			
			НомерТД = ВыборкаТранспортныйДокумент.НомерТранспортногоДокумента;
			ДатаТД  = ВыборкаТранспортныйДокумент.ДатаТранспортногоДокумента;
			
			КорректныйТД = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НомерТД,ДатаТД, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
			
			Если КорректныйТД = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			ВыборкаДетальныеЗаписи = ВыборкаТранспортныйДокумент.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтруктураПоиска = Новый Структура("ГУИД",ВыборкаДетальныеЗаписи.ГУИД);
				НайденныеСтроки = АкцептОб.Услуги.НайтиСтроки(СтруктураПоиска);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.ТранспортныйДокумент = КорректныйТД;
					НеобходимаЗапись = Истина;
				КонецЦикла;	
			КонецЦикла;
			
		КонецЦикла;
		
		АкцептОб.ОбменДанными.Загрузка = Истина;
		
		Если НеобходимаЗапись Тогда
			Попытка
				АкцептОб.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Регламент замены накладных в акцептах",УровеньЖурналаРегистрации.Ошибка,,АкцептОб.Ссылка,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПустыеПерезаполнитьНевалидныеНакладныеВАкцептах() Экспорт
	
	ТранспортныеДокументы_сервер.ЗаполнитьТранспортныеДокументы(Новый Структура("Режим", "РегламентноеЗаполнениеТранспортныхДокументов"));
	
КонецПроцедуры


Функция ПолучитьЗапросДляЗаполнения(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.Режим = "РегламентноеЗаполнениеТранспортныхДокументов" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктуальныеАкцептыСрезПоследних.Поступление КАК Поступление,
		|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт
		|ПОМЕСТИТЬ ВТ_АктуальныеАкцепты
		|ИЗ
		|	РегистрСведений.АктуальныеАкцепты.СрезПоследних КАК АктуальныеАкцептыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Акцепт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АкцептУслуги.Ссылка КАК АкцептСсылка,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ) КАК ОтработкаВРИТМ,
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка) КАК СделкаЗаполнена,
		|	АкцептУслуги.Ссылка.Поступление КАК Поступление
		|ПОМЕСТИТЬ ВТ_СтрокиАкцептовДляОбработки
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
		|		ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
		|			И (АкцептУслуги.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептУслуги.Ссылка,
		|	АкцептУслуги.Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ),
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	АкцептУслуги.Ссылка.Поступление
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
		|		ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
		|			И (АкцептУслуги.ТранспортныйДокумент.Проведен = ЛОЖЬ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаЗаполнена,
		|	ОтработкаВРИТМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТД, 1, 100) КАК СписокТД,
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление КАК Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура КАК Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД КАК ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = ПоступлениеТоваровУслугУслуги.Ссылка
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 ( Ticket#0294452
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаПоступленияУслуги.ИДТД,
		|	ПОДСТРОКА(КорректировкаПоступленияУслуги.СписокТД, 1, 100),
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = КорректировкаПоступленияУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = КорректировкаПоступленияУслуги.Ссылка
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 )
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокТД,
		|	ИДТД";
	ИначеЕсли ПараметрыЗаполнения.Режим = "ОдиночныйДокумент" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Акцепт КАК АкцептСсылка,
		|   &Поступление КАК Поступление,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Неурег КАК Неурег,
		|	АкцептУслуги.Сделка КАК Сделка
		|ПОМЕСТИТЬ ВТ_АкцептУслуги
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АкцептУслуги.АкцептСсылка КАК АкцептСсылка,
		|   АкцептУслуги.Поступление КАК Поступление,
		|   АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ) КАК ОтработкаВРИТМ,
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка) КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_СтрокиАкцептовДляОбработки
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептУслуги.АкцептСсылка,
		|   АкцептУслуги.Поступление,
		|   АкцептУслуги.Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ),
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.ТранспортныйДокумент.Проведен = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаЗаполнена,
		|	ОтработкаВРИТМ
		|;
		|ВЫБРАТЬ
		|
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТД, 1, 100) КАК СписокТД,
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление КАК Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура КАК Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД КАК ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = ПоступлениеТоваровУслугУслуги.Ссылка
		|
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		|	И ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 ( Ticket#0294452
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаПоступленияУслуги.ИДТД,
		|	ПОДСТРОКА(КорректировкаПоступленияУслуги.СписокТД, 1, 100),
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = КорректировкаПоступленияУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = КорректировкаПоступленияУслуги.Ссылка
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		|	И ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 )
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокТД,
		|	ИДТД
		|;";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
		Запрос.УстановитьПараметр("АкцептУслуги", ПараметрыЗаполнения.АкцептУслуги);
		Запрос.УстановитьПараметр("Акцепт", Документы.Акцепт.ПустаяСсылка());
		Запрос.УстановитьПараметр("Поступление", ПараметрыЗаполнения.Поступление);
	ИначеЕсли ПараметрыЗаполнения.Режим = "ОдиночныйДокументПерезаполнениеПоПТУ" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Акцепт КАК АкцептСсылка,
		|   &Поступление КАК Поступление,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ГУИД,
		|	АкцептУслуги.Неурег КАК Неурег,
		|	АкцептУслуги.Сделка КАК Сделка
		|ПОМЕСТИТЬ ВТ_АкцептУслуги
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АкцептУслуги.АкцептСсылка КАК АкцептСсылка,
		|   АкцептУслуги.Поступление КАК Поступление,
		|   АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ) КАК ОтработкаВРИТМ,
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка) КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_СтрокиАкцептовДляОбработки
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептУслуги.АкцептСсылка,
		|   АкцептУслуги.Поступление,
		|   АкцептУслуги.Номенклатура,
		|	АкцептУслуги.ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.ГУИД,
		|	АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ),
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.ТранспортныйДокумент.Проведен = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаЗаполнена,
		|	ОтработкаВРИТМ
		|;
		|ВЫБРАТЬ
		|
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТД, 1, 100) КАК СписокТД,
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление КАК Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура КАК Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД КАК ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = ПоступлениеТоваровУслугУслуги.Ссылка
		|
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		|	И ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 ( Ticket#0294452
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаПоступленияУслуги.ИДТД,
		|	ПОДСТРОКА(КорректировкаПоступленияУслуги.СписокТД, 1, 100),
		|	ВТ_СтрокиАкцептовДляОбработки.Поступление,
		|	ВТ_СтрокиАкцептовДляОбработки.Номенклатура,
		|	ВТ_СтрокиАкцептовДляОбработки.ТранспортныйДокумент,
		|	ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления,
		|	ВТ_СтрокиАкцептовДляОбработки.ГУИД,
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ,
		|	ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена
		|ИЗ
		|	ВТ_СтрокиАкцептовДляОбработки КАК ВТ_СтрокиАкцептовДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|		ПО ВТ_СтрокиАкцептовДляОбработки.ИдентификаторСтрокиПоступления = КорректировкаПоступленияУслуги.ГУИДПТУ
		|			И ВТ_СтрокиАкцептовДляОбработки.Поступление = КорректировкаПоступленияУслуги.Ссылка
		|ГДЕ
		|	ВТ_СтрокиАкцептовДляОбработки.ОтработкаВРИТМ = ЛОЖЬ
		|	И ВТ_СтрокиАкцептовДляОбработки.СделкаЗаполнена = ЛОЖЬ
		//Евросиб Каблов 09.02.2023 )
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокТД,
		|	ИДТД
		|;";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
		Запрос.УстановитьПараметр("АкцептУслуги", ПараметрыЗаполнения.АкцептУслуги);
		Запрос.УстановитьПараметр("Акцепт", Документы.Акцепт.ПустаяСсылка());
		Запрос.УстановитьПараметр("Поступление", ПараметрыЗаполнения.Поступление);
	ИначеЕсли ПараметрыЗаполнения.Режим = "ПроизвольнаяТаблица" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.НомерТранспортногоДокумента КАК ИДТД,
		|	ТаблицаДанных.НомерТранспортногоДокумента КАК СписокТД,
		|	ТаблицаДанных.Поступление КАК Поступление,
		|	ТаблицаДанных.Номенклатура КАК Номенклатура,
		|	ТаблицаДанных.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	"""" КАК ИдентификаторСтрокиПоступления,
		|	ТаблицаДанных.ИдентификаторСтроки КАК ГУИД,
		|	ЛОЖЬ КАК ОтработкаВРИТМ,
		|	ЛОЖЬ КАК СделкаЗаполнена
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокТД,
		|	ИДТД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.ИДТД КАК ИДТД,
		|	ТаблицаДанных.СписокТД КАК СписокТД,
		|	ТаблицаДанных.Поступление КАК Поступление,
		|	ТаблицаДанных.Номенклатура КАК Номенклатура,
		|	ТаблицаДанных.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ТаблицаДанных.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ТаблицаДанных.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_СтрокиАкцептовДляОбработки
		|ИЗ
		|	ВТ_Данные КАК ТаблицаДанных";
		//Евросиб Каблов 02.08.2023 ( #64831
		//Запрос.УстановитьПараметр("ТаблицаДанных", ПараметрыЗаполнения.ТаблицаДанных.Выгрузить());
		Если ТипЗнч(ПараметрыЗаполнения.ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
			Запрос.УстановитьПараметр("ТаблицаДанных", ПараметрыЗаполнения.ТаблицаДанных);
		Иначе
			Запрос.УстановитьПараметр("ТаблицаДанных", ПараметрыЗаполнения.ТаблицаДанных.Выгрузить());
		КонецЕсли;
		//Евросиб Каблов 02.08.2023 )
	КонецЕсли;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Выполнить();
	Возврат Запрос;	
КонецФункции


Процедура ЗаполнитьТранспортныеДокументы(ПараметрыЗаполнения) Экспорт
	ЗапросДляЗаполнения = ПолучитьЗапросДляЗаполнения(ПараметрыЗаполнения);
	ЗапросДляЗаполнения.Текст =
	//Евросиб Каблов 09.02.2023 ( Ticket#0294452
	//"ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ВТ_Данные.Поступление КАК Документ.ПоступлениеТоваровУслуг) КАК Поступление,
	//|	ВТ_Данные.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	//|	ВТ_Данные.ГУИД КАК ИдентификаторСтрокиАкцепта,
	//|	ВТ_Данные.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
	//|	ВТ_Данные.СделкаЗаполнена КАК СделкаЗаполнена,
	//|	ЕСТЬNULL(ИдентификаторыТранспортныхДокументов.ТранспортныйДокумент, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент,
	//|	ВТ_Данные.СписокТД КАК СписокТД,
	//|	ВТ_Данные.Номенклатура КАК Номенклатура
	//|ПОМЕСТИТЬ ВТ_ТранспортныеДокументыПоИдентификатору
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыТранспортныхДокументов КАК ИдентификаторыТранспортныхДокументов
	//|		ПО ВТ_Данные.ИДТД = ИдентификаторыТранспортныхДокументов.ИдентификаторНакладнойЭтран
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПоступлениеТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)) КАК Поступление,
	|	ВТ_Данные.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	ВТ_Данные.ГУИД КАК ИдентификаторСтрокиАкцепта,
	|	ВТ_Данные.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
	|	ВТ_Данные.СделкаЗаполнена КАК СделкаЗаполнена,
	|	ЕСТЬNULL(ИдентификаторыТранспортныхДокументов.ТранспортныйДокумент, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент,
	|	ВТ_Данные.СписокТД КАК СписокТД,
	|	ВТ_Данные.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТранспортныеДокументыПоИдентификатору
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыТранспортныхДокументов КАК ИдентификаторыТранспортныхДокументов
	|		ПО ВТ_Данные.ИДТД = ИдентификаторыТранспортныхДокументов.ИдентификаторНакладнойЭтран
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВТ_Данные.Поступление = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВТ_Данные.Поступление) = ТИП(Документ.ПоступлениеТоваровУслуг) 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	ВТ_Данные.ИдентификаторСтрокиПоступления,
	|	ВТ_Данные.ГУИД,
	|	ВТ_Данные.ОтработкаВРИТМ,
	|	ВТ_Данные.СделкаЗаполнена,
	|	ЕСТЬNULL(ИдентификаторыТранспортныхДокументов.ТранспортныйДокумент, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)),
	|	ВТ_Данные.СписокТД,
	|	ВТ_Данные.Номенклатура
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыТранспортныхДокументов КАК ИдентификаторыТранспортныхДокументов
	|		ПО ВТ_Данные.ИДТД = ИдентификаторыТранспортныхДокументов.ИдентификаторНакладнойЭтран
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО ВТ_Данные.Поступление = КорректировкаПоступления.Ссылка
	//Евросиб Каблов 09.02.2023 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТранспортныеДокументыПоИдентификатору.Поступление КАК Поступление,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ОтработкаВРИТМ КАК ОтработкаВРИТМ,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.СделкаЗаполнена КАК СделкаЗаполнена,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	0 КАК ПериодПриближения,
	|	1 КАК Приоритет
	|ИЗ
	|	ВТ_ТранспортныеДокументыПоИдентификатору КАК ВТ_ТранспортныеДокументыПоИдентификатору
	|ГДЕ
	|	НЕ ВТ_ТранспортныеДокументыПоИдентификатору.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ТранспортныеДокументыПоИдентификатору.Поступление,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиПоступления,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиАкцепта,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ОтработкаВРИТМ,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.СделкаЗаполнена,
	|	ДанныеТранспортныхДокументов.ТранспортныйДокумент,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ) > 0
	|			ТОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ДЕНЬ)
	|	КОНЕЦ,
	|	2
	|ИЗ
	|	ВТ_ТранспортныеДокументыПоИдентификатору КАК ВТ_ТранспортныеДокументыПоИдентификатору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеТранспортныхДокументов КАК ДанныеТранспортныхДокументов
	|		ПО ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = ДанныеТранспортныхДокументов.НомерТранспортногоДокумента
	|			И (ДанныеТранспортныхДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная))
	|			И (НЕ ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = """")
	|			И (ВТ_ТранспортныеДокументыПоИдентификатору.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
	//Субботин 80323  30.01.2024  начало
	//|			И (НЕ ВТ_ТранспортныеДокументыПоИдентификатору.Номенклатура = &НоменклатураФрахт)
	//Субботин 80323  30.01.2024  конец
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ТранспортныеДокументыПоИдентификатору.Поступление,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиПоступления,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиАкцепта,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ОтработкаВРИТМ,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.СделкаЗаполнена,
	|	ДанныеТранспортныхДокументов.ТранспортныйДокумент,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ) > 0
	|			ТОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ДЕНЬ)
	|	КОНЕЦ,
	|	3
	|ИЗ
	|	ВТ_ТранспортныеДокументыПоИдентификатору КАК ВТ_ТранспортныеДокументыПоИдентификатору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеТранспортныхДокументов КАК ДанныеТранспортныхДокументов
	|		ПО ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = ДанныеТранспортныхДокументов.НомерДляПоиска
	|			И (ДанныеТранспортныхДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная))
	|			И (НЕ ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = """")
	|			И (ВТ_ТранспортныеДокументыПоИдентификатору.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
    //Субботин 80323  30.01.2024 начало
	//|			И (НЕ ВТ_ТранспортныеДокументыПоИдентификатору.Номенклатура = &НоменклатураФрахт)
	//Субботин 80323  30.01.2024 Конец
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ТранспортныеДокументыПоИдентификатору.Поступление,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиПоступления,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ИдентификаторСтрокиАкцепта,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.ОтработкаВРИТМ,
	|	ВТ_ТранспортныеДокументыПоИдентификатору.СделкаЗаполнена,
	|	ДанныеТранспортныхДокументов.ТранспортныйДокумент,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ) > 0
	|			ТОГДА РАЗНОСТЬДАТ(ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ТранспортныеДокументыПоИдентификатору.Поступление.ДатаВходящегоДокумента, ДанныеТранспортныхДокументов.ТранспортныйДокумент.ДатаТранспортногоДокумента, ДЕНЬ)
	|	КОНЕЦ,
	|	1
	|ИЗ
	|	ВТ_ТранспортныеДокументыПоИдентификатору КАК ВТ_ТранспортныеДокументыПоИдентификатору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеТранспортныхДокументов КАК ДанныеТранспортныхДокументов
	|		ПО ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = ДанныеТранспортныхДокументов.НомерТранспортногоДокумента
	|			И (ДанныеТранспортныхДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.Коносамент))
	|			И (НЕ ВТ_ТранспортныеДокументыПоИдентификатору.СписокТД = """")
	|			И (ВТ_ТранспортныеДокументыПоИдентификатору.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
    //Субботин 80323  30.01.2024 Начало
	//|			И (ВТ_ТранспортныеДокументыПоИдентификатору.Номенклатура = &НоменклатураФрахт)
	//Субботин 80323  30.01.2024 Конец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поступление,
	|	ИдентификаторСтрокиАкцепта,
	|	Приоритет,
	|	ПериодПриближения";  
	ЗапросДляЗаполнения.УстановитьПараметр("НоменклатураФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	Пакет = ЗапросДляЗаполнения.ВыполнитьПакет();
    ОбработатьПакетРезультатовЗапроса(Пакет, ПараметрыЗаполнения);
		
КонецПроцедуры

Процедура ОбработатьПакетРезультатовЗапроса(ПакетРезультатов, ПараметрыЗаполнения)  
	
	// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 26.09.2023 - сбор данных для актуализации ТД вСделках
	ТаблицаИзмененныхСтрокАкцептов = Новый ТаблицаЗначений;
	ТаблицаИзмененныхСтрокАкцептов.Колонки.Добавить("Сделка");
	ТаблицаИзмененныхСтрокАкцептов.Колонки.Добавить("ТранспортныйДокумент"); 
	ТаблицаИзмененныхСтрокАкцептов.Колонки.Добавить("ИдентификаторСтрокиРасходовВСделке");
	// ДИТ US 61689 TA 73965 Сержантова А.С. Конец: 26.09.2023	
	
	КоличествоПакетов = ПакетРезультатов.Количество();
	Если ПараметрыЗаполнения.Режим = "ОдиночныйДокумент" Тогда 
		ВыборкаРезультата = ПакетРезультатов [КоличествоПакетов - 1].Выбрать(); 
		Пока ВыборкаРезультата.СледующийПоЗначениюПоля("ИдентификаторСтрокиПоступления") Цикл
			СтрокиАкцепта = ПараметрыЗаполнения.АкцептУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоступления", ВыборкаРезультата.ИдентификаторСтрокиПоступления));
			Для каждого СтрокаАкцепта Из СтрокиАкцепта Цикл
				СтрокаАкцепта.ТранспортныйДокумент = ВыборкаРезультата.ТранспортныйДокумент;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ПараметрыЗаполнения.Режим = "ОдиночныйДокументПерезаполнениеПоПТУ" Тогда 
		ВыборкаРезультата = ПакетРезультатов [КоличествоПакетов - 1].Выбрать(); 
		Пока ВыборкаРезультата.СледующийПоЗначениюПоля("ИдентификаторСтрокиАкцепта") Цикл
			СтрокиАкцепта = ПараметрыЗаполнения.АкцептУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоступления", ВыборкаРезультата.ИдентификаторСтрокиАкцепта));
			Для каждого СтрокаАкцепта Из СтрокиАкцепта Цикл
				СтрокаАкцепта.ТранспортныйДокумент = ВыборкаРезультата.ТранспортныйДокумент;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ПараметрыЗаполнения.Режим = "ПроизвольнаяТаблица" Тогда 
		ВыборкаРезультата = ПакетРезультатов [КоличествоПакетов - 1].Выбрать(); 
		Пока ВыборкаРезультата.СледующийПоЗначениюПоля("ИдентификаторСтрокиАкцепта") Цикл
			СтрокиАкцепта = ПараметрыЗаполнения.ТаблицаДанных.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаРезультата.ИдентификаторСтрокиАкцепта));
			Для каждого СтрокаАкцепта Из СтрокиАкцепта Цикл
				СтрокаАкцепта.ТранспортныйДокумент = ВыборкаРезультата.ТранспортныйДокумент;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ПараметрыЗаполнения.Режим = "РегламентноеЗаполнениеТранспортныхДокументов" Тогда 
		ВыборкаРезультата = ПакетРезультатов [КоличествоПакетов - 1].Выбрать(); 
		Пока ВыборкаРезультата.СледующийПоЗначениюПоля("Поступление") Цикл 
			// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 26.09.2023
			ТаблицаИзмененныхСтрокАкцептов.Очистить();
			// ДИТ US 61689 TA 73965 Сержантова А.С. Конец: 26.09.2023
			АкцептСсылка = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ВыборкаРезультата.Поступление).АкцептСсылка;                    
			ОбАкцепт = АкцептСсылка.ПолучитьОбъект();
			Пока ВыборкаРезультата.СледующийПоЗначениюПоля("ИдентификаторСтрокиАкцепта") Цикл
				СтрокиАкцепта = ОбАкцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", ВыборкаРезультата.ИдентификаторСтрокиАкцепта));
				Для каждого СтрокаАкцепта Из СтрокиАкцепта Цикл
					СтрокаАкцепта.ТранспортныйДокумент = ВыборкаРезультата.ТранспортныйДокумент; 
					// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 26.09.2023
					Стр = ТаблицаИзмененныхСтрокАкцептов.Добавить();
					ЗаполнитьЗначенияСвойств(Стр, СтрокаАкцепта);
					// ДИТ US 61689 TA 73965 Сержантова А.С. Конец: 26.09.2023
				КонецЦикла;
			КонецЦикла;
			ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(АкцептСсылка.Услуги.выгрузить(), ОбАкцепт.Услуги.выгрузить(),"ТранспортныйДокумент",, Истина);		
			Если ИзмененийНет = Ложь Тогда    
				ОбАкцепт.УстановитьКомментарийВерсииИсторииДанных("Перезаполнение транспортных документов (ЗаполнитьТранспортныеДокументы)");
				ОбАкцепт.ОбменДанными.Загрузка = Истина;
				обАкцепт.Записать(РежимЗаписиДокумента.Запись);
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("новый: %1; старый: %2", ОбАкцепт, АкцептСсылка)); 
				// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 26.09.2023
				АктуализироватьТДвСделках(ТаблицаИзмененныхСтрокАкцептов, АкцептСсылка);
				// ДИТ US 61689 TA 73965 Сержантова А.С. Конец: 26.09.2023
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

// ДИТ US 61689 TA 73965 Сержантова А.С. Начало: 26.09.2023
Процедура АктуализироватьТДвСделках(ТаблицаИзмененныхСтрокАкцептов, АкцептСсылка)
	
	Сделки = ТаблицаИзмененныхСтрокАкцептов.ВыгрузитьКолонку("Сделка");
	МассивСделок = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(Сделки);
	Для каждого Сделка Из МассивСделок Цикл  
		РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сделка, "ДатаЗакрытияСделки, ПометкаУдаления, Расходы");  
		Если ЗначениеЗаполнено(РеквизитыСделки.ДатаЗакрытияСделки) или РеквизитыСделки.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		НужнаЗапись = Ложь; 
		ВыборкаРасходовСделки = РеквизитыСделки.Расходы.Выбрать();
		СтрокиАкцепта = ТаблицаИзмененныхСтрокАкцептов.НайтиСтроки(Новый Структура("Сделка", Сделка));
	    Для каждого СтрокаАкцепта Из СтрокиАкцепта Цикл
			Пока ВыборкаРасходовСделки.НайтиСледующий(Новый Структура("ГУИД", СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке)) Цикл  
				Если ВыборкаРасходовСделки.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
					НужнаЗапись = Истина;   
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НужнаЗапись Тогда
				Прервать;
			КонецЕсли;
			ВыборкаРасходовСделки.Сбросить();
		КонецЦикла; 
		Если НужнаЗапись Тогда
			мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
			мз.ИсточникИзменения = АкцептСсылка;
			мз.ОбрабатываемыйОбъект = Сделка;
			мз.ДатаЗаписи = ТекущаяДата();
			мз.Пользователь = Пользователи.ТекущийПользователь();
			мз.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура АктуализацияСсылочныхЗначенийТД() Экспорт //ДИТ Шевченко А.В. 59059 19.12.2022
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТранспортныйДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|			ПО ТранспортныйДокументУчетныеЕдиницы.НомерВагона = ТС.Наименование
		|				И (НЕ ТС.ПометкаУдаления)
		//Евросиб - АСуслов 05.02.2026 17:28:26 #
		//( если вагон с нужным номером подобрали, то менять не надо
		//|				И ТранспортныйДокументУчетныеЕдиницы.Вагон <> ТС.Ссылка
		|				И ТранспортныйДокументУчетныеЕдиницы.Вагон = Значение(Справочник.ТС.ПустаяСсылка)
		//)
		//Евросиб - АСуслов 05.02.2026 17:28:28 #
		|		ПО (ТранспортныйДокументУчетныеЕдиницы.Ссылка = ТранспортныйДокумент.Ссылка)
		|			И (ТранспортныйДокумент.Проведен)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТранспортныйДокумент.Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|			ПО ТранспортныйДокументУчетныеЕдиницы.Вагон = ТС.Ссылка
		|				И ТранспортныйДокументУчетныеЕдиницы.НомерВагона <> ТС.Наименование
		|		ПО (ТранспортныйДокументУчетныеЕдиницы.Ссылка = ТранспортныйДокумент.Ссылка)
		|			И (ТранспортныйДокумент.Проведен)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТранспортныйДокумент.Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ПО ТранспортныйДокументУчетныеЕдиницы.НомерКонтейнера = ТЕ.Наименование
		|				И (НЕ ТЕ.ПометкаУдаления)
		//Евросиб - АСуслов 05.02.2026 17:28:26 #
		//( если контейнер с нужным номером подобрали, то менять не надо
		//|				И ТранспортныйДокументУчетныеЕдиницы.Контейнер <> ТЕ.Ссылка
		|				И ТранспортныйДокументУчетныеЕдиницы.Контейнер = Значение(Справочник.ТЕ.ПустаяСсылка)
		//)
		//Евросиб - АСуслов 05.02.2026 17:28:28 #
		|		ПО (ТранспортныйДокументУчетныеЕдиницы.Ссылка = ТранспортныйДокумент.Ссылка)
		|			И (ТранспортныйДокумент.Проведен)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТранспортныйДокумент.Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ПО ТранспортныйДокументУчетныеЕдиницы.Контейнер = ТЕ.Ссылка
		|				И ТранспортныйДокументУчетныеЕдиницы.НомерКонтейнера <> ТЕ.Наименование
		|		ПО (ТранспортныйДокументУчетныеЕдиницы.Ссылка = ТранспортныйДокумент.Ссылка)
		|			И (ТранспортныйДокумент.Проведен)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбТД = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОбТД.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
КонецПроцедуры	