
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НазваниеМеста") Тогда
		
		ВызывающаяФормаГУИД = Параметры.ЭтаФормаГУИД;
		
		МассивОтвета = Геосервис_Сервер.ПолучитьКоординатыПоНаименованию(Параметры.НазваниеМеста);
		Для каждого Стр из МассивОтвета Цикл
			ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
		КонецЦикла;
		
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура Использовать(Команда)
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Оповестить("ВыбраныКоординаты", Новый Структура("Широта, Долгота, Адрес", ТекД.Широта, ТекД.Долгота, ТекД.Наименование), ВызывающаяФормаГУИД);
	Закрыть();
КонецПроцедуры
