
&НаКлиенте
Процедура НайтиСтанцииПоКодам(Команда)
	
	ТЧ.Очистить();
	
	Сч = 2;
	НаименованиеСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	КодСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
	LON_Станции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
	LAT_Станции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C4").Текст;
	
	Пока НаименованиеСтанции1 <> "" И КодСтанции1 <> "" И LON_Станции1 <> "" И LAT_Станции1 <> "" Цикл
		
		НСтр = ТЧ.Добавить();
		НСтр.Станция1Наименование = НаименованиеСтанции1;
		НСтр.Станция1Код = ОставитьТолькоЦифры(КодСтанции1);
		НСтр.LON = Число(LON_Станции1);
		НСтр.LAT = Число(LAT_Станции1);
		
		Сч = Сч + 1;
		
		НаименованиеСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		КодСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		LON_Станции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C3").Текст;
		LAT_Станции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C4").Текст;
		
	КонецЦикла;
	
	НайтиСопоставленияСтанциямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НайтиСопоставленияСтанциямНаСервере()
	
	Для каждого Стр из ТЧ Цикл
		
		Если ЗначениеЗаполнено(Стр.Станция1Код) Тогда Стр.Станция1 = Локации_сервер.НайтиСтанциюПоНеполномуКоду(Стр.Станция1Код); КонецЕсли;
		Стр.Отметка = ЗначениеЗаполнено(Стр.Станция1) И ЗначениеЗаполнено(Стр.LON) И ЗначениеЗаполнено(Стр.LAT);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОставитьТолькоЦифры(СтрокаЪ)
	
	Результат = "";
	МЦ = Новый Массив;
	МЦ.Добавить("1"); МЦ.Добавить("2"); МЦ.Добавить("3"); 
	МЦ.Добавить("4"); МЦ.Добавить("5"); МЦ.Добавить("6"); 
	МЦ.Добавить("7"); МЦ.Добавить("8"); МЦ.Добавить("9"); 
	МЦ.Добавить("0"); 
	
	Для Сч = 1 По СтрДлина(СтрокаЪ) Цикл
		
		ОчрСимвол = Сред(СтрокаЪ, Сч, 1);
		Если МЦ.Найти(ОчрСимвол) <> неопределено Тогда
			Результат = Результат + ОчрСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ЗаписатьАналогиСтанций(Команда)
	ЗаписатьАналогиСтанцийНаСервере();
	ПоказатьПредупреждение(, "Данные GPS записаны!");
КонецПроцедуры


&НаСервере
Процедура ЗаписатьАналогиСтанцийНаСервере()
	
	Для каждого Стр из ТЧ Цикл
		
		Если Стр.Отметка И ЗначениеЗаполнено(Стр.Станция1) И ЗначениеЗаполнено(Стр.LON) И ЗначениеЗаполнено(Стр.LAT) Тогда
			Локации_сервер.ЗаписатьGPSСтанции(Стр.Станция1, Стр.LON, Стр.LAT);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
