
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	//Евросиб - АСуслов 18.08.2022 13:45:41 #55129
	//(
	Запрос.Текст = ПолучитьТекстЗапросаДиагностикиПривязок();
	//)
	//Евросиб - АСуслов 18.08.2022 13:45:43 #55129
	Запрос.УстановитьПараметр("КТК", Параметры.КТКДляАнализа);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКТК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКТК.Следующий() Цикл
		
		НовыйКорневой = ДЗ.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКорневой, ВыборкаКТК);
	
		ВыборкаДетальныеЗаписи = ВыборкаКТК.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяДеталь = НовыйКорневой.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяДеталь, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;
	КонецЦикла;
	
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
    

//Евросиб - АСуслов 18.08.2022 13:46:02 #55129
//(
&НаСервере
Функция ПолучитьТекстЗапросаДиагностикиПривязок();
	
	ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов");
	Если ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов Тогда
		Возврат ПолучитьТекстЗапросаДиагностикиПривязок_РегистрРазнесениеРасходов();
	Иначе
		Возврат ПолучитьТекстЗапросаДиагностикиПривязок_РегистрРазнесениеЗатратПТУ();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаДиагностикиПривязок_РегистрРазнесениеЗатратПТУ()
	Возврат	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазнесениеЗатратПТУ.КТК КАК КТК,
		|	РазнесениеЗатратПТУ.ДокументПТУ КАК ПТУ,
		|	РазнесениеЗатратПТУ.Сделка КАК Сделка,
		|	РазнесениеЗатратПТУ.Регистратор КАК Акцепт,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	РейсыСделок.Рейс КАК Рейс
		|ИЗ
		|	РегистрНакопления.РазнесениеЗатратПТУ КАК РазнесениеЗатратПТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|		ПО РазнесениеЗатратПТУ.Сделка = СделкаРасходы.Ссылка
		|			И РазнесениеЗатратПТУ.ГУИДРасходов = СделкаРасходы.ГУИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СделкаРейсы.Ссылка КАК Ссылка,
		|			МАКСИМУМ(СделкаРейсы.Рейс) КАК Рейс
		|		ИЗ
		|			Документ.Сделка.Рейсы КАК СделкаРейсы
		|		ГДЕ
		|			ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СделкаРейсы.Ссылка) КАК РейсыСделок
		|		ПО РазнесениеЗатратПТУ.Сделка = РейсыСделок.Ссылка
		|ГДЕ
		|	РазнесениеЗатратПТУ.КТК В(&КТК)
		|	И РазнесениеЗатратПТУ.Регистратор.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
		|	И НЕ РазнесениеЗатратПТУ.Регистратор В
		|				(ВЫБРАТЬ
		|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
		|				ИЗ
		|					Документ.Акцепт КАК Акцепт)
		|ИТОГИ ПО
		|	КТК";

КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаДиагностикиПривязок_РегистрРазнесениеРасходов()
	Возврат	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазнесениеРасходов.Сделка КАК Сделка,
	|	РазнесениеРасходов.Регистратор КАК Акцепт,
	|	ВЫБОР
	|		КОГДА РазнесениеРасходов.Регистратор.Поступление ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА РазнесениеРасходов.Регистратор.Поступление
	|		ИНАЧЕ РазнесениеРасходов.Регистратор.Поступление.ИсходныйДокументПоступления
	|	КОНЕЦ КАК ПТУ,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Контейнер КАК КТК,
	|	РейсыСделок.Рейс КАК Рейс
	|ИЗ
	|	РегистрНакопления.РазнесениеРасходов КАК РазнесениеРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО РазнесениеРасходов.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеРасходов.ГУИДРасходов = СделкаРасходы.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СделкаРейсы.Ссылка КАК Ссылка,
	|			МАКСИМУМ(СделкаРейсы.Рейс) КАК Рейс
	|		ИЗ
	|			Документ.Сделка.Рейсы КАК СделкаРейсы
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СделкаРейсы.Ссылка) КАК РейсыСделок
	|		ПО РазнесениеРасходов.Сделка = РейсыСделок.Ссылка
	|ГДЕ
	|	СделкаРасходы.Контейнер В(&КТК)
	|	И РазнесениеРасходов.Регистратор.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|	И НЕ РазнесениеРасходов.Регистратор В
	|				(ВЫБРАТЬ
	|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	|				ИЗ
	|					Документ.Акцепт КАК Акцепт)
	|ИТОГИ ПО
	|	КТК";

КонецФункции

//)
//Евросиб - АСуслов 18.08.2022 13:46:03 #55129
&НаКлиенте
Процедура ОтвязатьКТКВАкцептеОтСделки(Команда)
	
	ТекД = Элементы.ДЗ.ТекущиеДанные;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.ПТУ) И ЗначениеЗаполнено(ТекД.КТК) Тогда
		ОтвязатьКТКОтПТУ(ТекД.ПТУ, ТекД.КТК);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтвязатьКТКОтПТУ(ПТУ, КТК)
	
	АктАкцО = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУ, Ложь);
	//Субботин 75883 10.10.2023 начало
	ВыбранныеСтроки = АктАкцО.Услуги.Выгрузить(Новый Структура("Контейнер",КТК));
	ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(АктАкцО.Услуги, ВыбранныеСтроки);
	//Субботин 75883 10.10.2023 Конец 
	//АктАкцО = АктАкц.ПолучитьОбъект();
	Для каждого Стр из АктАкцО.Услуги Цикл
		Если Стр.Контейнер = КТК Тогда
			
			//Евросиб Каблов 17.01.2022 ( Task 41630
			//Стр.ИдентификаторСтрокиРасходовВСделке = неопределено;
			//Стр.Сделка = неопределено;
			//Стр.ПолностьюРазнесено = Ложь;
			//Стр.НоменклатурнаяГруппа = Неопределено;
			//Стр.СделкаСумма = 0;
			//Стр.СделкаСтавкаНДС = Неопределено;
			//Стр.СделкаСуммаНДС = 0;
			//Стр.НоменклатураСделки = Неопределено;
			//Стр.ВидРасходов = Неопределено;
			//Стр.Сумма = 0;
			//Стр.СуммаНДС = 0;
			//Стр.ОтчетКомитенту = Неопределено;
			//Стр.Количество = 0;
			//Стр.Цена = 0;
			//Стр.ПривязалПользователь = Неопределено;
			//Субботин 75883 10.10.2023 начало
			СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
			//Было
			//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр, АктАкцО, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка); 
			//Стало 
			Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], АктАкцО, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка);
			ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
			//Субботин 75883 10.10.2023 Конец 
			//Евросиб Каблов 17.01.2022 )
			
		КонецЕсли;
	КонецЦикла;
	АктАкцО.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
