//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция СоздатьЗапросНаОтчет(XMLParams) Экспорт
	
	ТокенПолученияОтчета = "";
	РезультатРегистрацииЗапроса = "";
	ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДля1С();
	
	Если СтрНайти(XMLParams, "ЗапросОтчетаDataCore") > 0 Тогда
		
		ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДляСтороннейСистемы();

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяОтчета", "");
		ПараметрыОтчета = Новый Структура;
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(XMLParams);
		Пока Чтение.Прочитать() Цикл
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "ЗапросОтчетаDataCore" Тогда
				СтруктураПараметров.Вставить("ИмяОтчета", Чтение.ЗначениеАтрибута("ИмяОтчета"));
			КонецЕсли;
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "Параметры" Тогда
				Если Чтение.КоличествоАтрибутов()> 0 Тогда
					Пока Чтение.ПрочитатьАтрибут()Цикл
						ПараметрыОтчета.Вставить(Чтение.Имя, Чтение.Значение);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураПараметров.Вставить("ПараметрыОтчета", ПараметрыОтчета);
	Иначе 
		СтруктураПараметров = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	КонецЕсли;
	

	#Область ПроверкаКорректностиЗапроса
	//проверить корректность запроса
	ЗапросКорректен = Истина;
	МассивОшибок = Новый Массив;
	ПараметрыОтчетаДляРегистрации = Новый Структура;
	
	СтруктураДанныхПоОтчету = Справочники.НастройкиОтчетовПоЗапросу.ПолучитьАктуальныйПоНаименованию(СтруктураПараметров.ИмяОтчета);
	НастройкаОтчетаПоЗапросу = СтруктураДанныхПоОтчету.НастройкаОтчетаПоЗапросу;
	Если НастройкаОтчетаПоЗапросу <> Неопределено Тогда
		
		ПараметрыОтчетаВходящие = СтруктураПараметров.ПараметрыОтчета;
		
		Для Каждого ТекПараметр Из СтруктураДанныхПоОтчету.СоответствиеПараметровОтчета Цикл
			ЗначениеПараметра = Неопределено;
			ПараметрыОтчетаВходящие.Свойство(ТекПараметр.Ключ, ЗначениеПараметра);
			Если ЗначениеПараметра <> Неопределено Тогда
				ИмяПараметра = СтрЗаменить(ТекПараметр.Значение, ".", РазделитьЧастейСтандартногоПериода());
				ПараметрыОтчетаДляРегистрации.Вставить(ИмяПараметра, ЗначениеПараметра);
			Иначе 
				МассивОшибок.Добавить("не указан параметр отчета " + ТекПараметр.Ключ);
				ЗапросКорректен = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		МассивОшибок.Добавить("не найден отчет по имени "+СтруктураПараметров.ИмяОтчета);
		ЗапросКорректен = Ложь;
		
	КонецЕсли;
	
	//контроль максимального периода
	//Если ЗапросКорректен Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
	Если ЗапросКорректен И НЕ СтруктураДанныхПоОтчету.ОтключитьКонтрольМаксимальногоПериода Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
	
		СоответствиеПараметровКонтроляПериода = СтруктураДанныхПоОтчету.СоответствиеПараметровКонтроляПериода;
		ИмяВходногоПараметраНачалаПериода = СоответствиеПараметровКонтроляПериода.Получить(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыНачалаКонтролируемогоПериода());
		ИмяВходногоПараметраОкончанияПериода = СоответствиеПараметровКонтроляПериода.Получить(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыОкончанияКонтролируемогоПериода());
		
		КонтрольныйПериодДатаНачала = Неопределено;
		КонтрольныйПериодДатаОкончания = Неопределено;
		ПараметрыОтчетаВходящие.Свойство(ИмяВходногоПараметраНачалаПериода, КонтрольныйПериодДатаНачала);
		ПараметрыОтчетаВходящие.Свойство(ИмяВходногоПараметраОкончанияПериода, КонтрольныйПериодДатаОкончания);
		ПреобразоватьВДату(КонтрольныйПериодДатаНачала);
		ПреобразоватьВДату(КонтрольныйПериодДатаОкончания);
		РазницаВДнях = (НачалоДня(КонтрольныйПериодДатаОкончания) - НачалоДня(КонтрольныйПериодДатаНачала)) / (60 * 60 * 24);
		Если РазницаВДнях > СтруктураДанныхПоОтчету.МасимальныйЗапрашиваемыйПериодОтчетаВДнях  Тогда
			МассивОшибок.Добавить("превышен максимальный период запроса, указано количество дней более " + СтруктураДанныхПоОтчету.МасимальныйЗапрашиваемыйПериодОтчетаВДнях);
			ЗапросКорректен = Ложь;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	//регистрация запроса
	Если ЗапросКорректен Тогда
		
		ТокенПолученияОтчета = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.ЗафиксироватьЗапросОтчета(НастройкаОтчетаПоЗапросу, ПараметрыОтчетаДляРегистрации, XMLParams);
		РезультатРегистрацииЗапроса = "success";
		
	Иначе
		
		РезультатРегистрацииЗапроса = "error: "+СтрСоединить(МассивОшибок, "; ");
		
	КонецЕсли;
	
	//формирование результата запроса
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТокенПолученияОтчета", ТокенПолученияОтчета);
	СтруктураДанных.Вставить("РезультатРегистрацииЗапроса", РезультатРегистрацииЗапроса);
	
	СтрокаXML = "";
	
	Если ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДля1С() Тогда
		СтрокаXML = ПолучитьСтрокуXMLдляФормата1С(СтруктураДанных);
	ИначеЕсли ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДляСтороннейСистемы() Тогда
		СтрокаXML = ПолучитьСтрокуXMLОтветаНаЗапросДляФорматаСтороннейСистемы(СтруктураДанных);
	КонецЕсли;
	
	Возврат СтрокаXML;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ПреобразоватьВДату(ДатаДляОбработки)
	Если ТипЗнч(ДатаДляОбработки) <> Тип("Дата") Тогда
		ДатаДляОбработки = XMLЗначение(Тип("Дата"), ДатаДляОбработки);
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ПолучитьСтрокуXMLОтветаНаЗапросДляФорматаСтороннейСистемы(СтруктураДанных)

	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ответ");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТокенПолученияОтчета");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтруктураДанных.ТокенПолученияОтчета));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("РезультатРегистрацииЗапроса");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтруктураДанных.РезультатРегистрацииЗапроса));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ОбработатьОчередь() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьФормированияОтчетовПоЗапросу.Токен КАК Токен,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу КАК НастройкаОтчетаПоЗапросу,
		|	ОчередьФормированияОтчетовПоЗапросу.ПараметрыОтчета КАК ПараметрыОтчета,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу.ВариантОтчета КАК ВариантОтчета,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу.ВариантОтчета.Настройки КАК НастройкиВариантаОтчета,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу.ФорматДанныхОбмена КАК ФорматДанныхОбмена
		|ИЗ
		|	РегистрСведений.ОчередьФормированияОтчетовПоЗапросу КАК ОчередьФормированияОтчетовПоЗапросу
		|ГДЕ
		|	НЕ ОчередьФормированияОтчетовПоЗапросу.Сформирован
		|	И НЕ ОчередьФормированияОтчетовПоЗапросу.ОшибкаПриФормировании
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОчередьФормированияОтчетовПоЗапросу.ДатаЗапроса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура("Токен, НастройкаОтчетаПоЗапросу, ПараметрыОтчета, ВариантОтчета, НастройкиВариантаОтчета, ФорматДанныхОбмена");
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);
		
		ТекстОшибки = "";
		
		Попытка
			ОтчетСформирован = СфомироватьОтчетПоЗапросу(СтруктураПараметров);
		Исключение
			ОтчетСформирован = Ложь;
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если НЕ ОтчетСформирован Тогда
			РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.ЗафиксироватьОшибкуФомирования(ВыборкаДетальныеЗаписи.Токен, СтруктураПараметров.НастройкаОтчетаПоЗапросу, ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция СфомироватьОтчетПоЗапросу(СтруктураПараметров)
	
	//формирование отчета
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("СсылкаВарианта",              СтруктураПараметров.ВариантОтчета);
	ПараметрыПодключения.Вставить("ПользовательскиеНастройкиКД", СтруктураПараметров.НастройкиВариантаОтчета);
	Если ТипЗнч(ПараметрыПодключения.ПользовательскиеНастройкиКД) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		ПараметрыПодключения.ПользовательскиеНастройкиКД = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	КонецЕсли;
	Попытка
		Подключение = ВариантыОтчетов.ПодключитьОтчетИЗагрузитьНастройки(ПараметрыПодключения);
	Исключение
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Настройки = Подключение.НастройкиКД;
	ПараметрыОтчетаВходящие = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтруктураПараметров.ПараметрыОтчета);
	
	////ЧЕРЕЗ КомпоновщикМакетаКомпоновкиДанных работают не все отчеты, например, имеющие логику в процедуре ПриКомпоновкеРезультата
	//КомпоновкаДанныхКлиентСервер.УстановитьКоллекциюПараметров(Настройки, ПараметрыОтчетаВходящие);
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(Подключение.Объект.СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ,Истина);
	//
	//ТЗ = Новый ТаблицаЗначений;
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//ПроцессорВывода.УстановитьОбъект(ТЗ);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//
	//СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗ);
	
	ТабДок = Новый ТабличныйДокумент;
	ОтчетОбъект = Подключение.Объект;
	
	//перенос доп свойств в объект отчета
	КомпоновщикНастроекКД = ОтчетОбъект.КомпоновщикНастроек;
	КомпоновкаДанныхКлиентСервер.УстановитьКоллекциюПараметров(КомпоновщикНастроекКД, ПараметрыОтчетаВходящие);
	ДополнительныеСвойства = КомпоновщикНастроекКД.ПользовательскиеНастройки.ДополнительныеСвойства;
	//объединение дат отчета в Период
	ДобавитьПараметрыТипаСтандартныйПериод(КомпоновщикНастроекКД, ПараметрыОтчетаВходящие);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДополнительныеСвойства, Настройки.ДополнительныеСвойства, Ложь);
	//компоновка
	Подключение.Объект.СкомпоноватьРезультат(ТабДок);
	ТабДокЧерезСкомпоноватьРезультат = ТабДок;
	
	//табличный документ в таблицу значений
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());
	Построитель.Выполнить();
	ТЗизТабличногоДокумента = Построитель.Результат.Выгрузить();
	
	Если СтруктураПараметров.ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДля1С() Тогда
		СтрокаXML = ПолучитьСтрокуXMLдляФормата1С(ТЗизТабличногоДокумента);
	ИначеЕсли СтруктураПараметров.ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДляСтороннейСистемы() Тогда
		СтрокаXML = ПолучитьСтрокуXMLТаблицыЗначенийДляФорматаСтороннейСистемы(ТЗизТабличногоДокумента);
	КонецЕсли;
	
	РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.ЗафиксироватьФормированиеОтчета(СтруктураПараметров.Токен, СтруктураПараметров.НастройкаОтчетаПоЗапросу, СтрокаXML);
	
	Возврат Истина;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция РазделитьЧастейСтандартногоПериода()
	Возврат "__";
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ДобавитьПараметрыТипаСтандартныйПериод(КомпоновщикНастроекКД, ПараметрыОтчетаВходящие)
	
	Для Каждого ТекПараметр Из ПараметрыОтчетаВходящие Цикл
		СоставПараметра = СтрРазделить(ТекПараметр.Ключ, РазделитьЧастейСтандартногоПериода(), Ложь);
		Если СоставПараметра.Количество() = 2 Тогда
			
			ИмяПериода = СоставПараметра[0];
			ИмяЗначенияПериода = СоставПараметра[1];
			ДатаВПараметр = ТекПараметр.Значение;
			ЗначениеПараметра = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроекКД, ИмяПериода);
			Если ТипЗнч(ДатаВПараметр) = Тип("Строка") Тогда
				ДатаВПараметр = XMLЗначение(Тип("Дата"), ДатаВПараметр);
			КонецЕсли;
	
			Если ЗначениеПараметра <> Неопределено Тогда
				Если ИмяЗначенияПериода = "ДатаНачала" Тогда
					ЗначениеПараметра.Значение.ДатаНачала = ДатаВПараметр;
				ИначеЕсли ИмяЗначенияПериода = "ДатаОкончания" Тогда
					ЗначениеПараметра.Значение.ДатаОкончания = ДатаВПараметр;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ПолучитьСтрокуXMLдляФормата1С(ТЗизТабличногоДокумента)
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗизТабличногоДокумента);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ПолучитьСтрокуXMLТаблицыЗначенийДляФорматаСтороннейСистемы(ТЗизТабличногоДокумента)

	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблицаДанных");
	
	Для счетчикСтрок = 0 По ТЗизТабличногоДокумента.Количество()-1 Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Строка");
		Для Каждого Колонка Из ТЗизТабличногоДокумента.Колонки Цикл
			ИмяАтрибута = Колонка.Заголовок;
			ЗначениеАтрибута = ТЗизТабличногоДокумента[счетчикСтрок][Колонка.Имя];
			ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута,Строка(ЗначениеАтрибута));
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ПолучитьОтчетПоТокену(XMLParams) Экспорт
	
	Если СтрНайти(XMLParams, "ЗапросОтчетаDataCore") > 0 Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТокенПолученияОтчета", "");
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(XMLParams);
		Пока Чтение.Прочитать() Цикл
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "ТокенПолученияОтчета" Тогда
				Чтение.Прочитать();
				СтруктураПараметров.Вставить("ТокенПолученияОтчета", Чтение.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе 
		
		СтруктураПараметров = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
		
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьФормированияОтчетовПоЗапросу.Токен КАК Токен,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу КАК НастройкаОтчетаПоЗапросу,
		|	ОчередьФормированияОтчетовПоЗапросу.РезультатФормирования КАК РезультатФормирования,
		|	ОчередьФормированияОтчетовПоЗапросу.Сформирован КАК Сформирован
		|ИЗ
		|	РегистрСведений.ОчередьФормированияОтчетовПоЗапросу КАК ОчередьФормированияОтчетовПоЗапросу
		|ГДЕ
		|	ОчередьФормированияОтчетовПоЗапросу.Токен = &Токен";
	
	Запрос.УстановитьПараметр("Токен", СтруктураПараметров.ТокенПолученияОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Сформирован Тогда
			СтрокаXML = Выборка.РезультатФормирования.Получить();
			РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.ЗафиксироватьОтправкуОтчета(Выборка.Токен, Выборка.НастройкаОтчетаПоЗапросу);	
		Иначе
			ОписаниеОшибки = "Отчет не сформирован";
		КонецЕсли;
	Иначе 
		ОписаниеОшибки = "Не найден запрос по токену - "+СтруктураПараметров.ТокенПолученияОтчета;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответ");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ошибка");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ОписаниеОшибки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		СтрокаXML = ЗаписьXML.Закрыть()
	КонецЕсли;
	
	Возврат СтрокаXML;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ОбразецВходящегоЗапросаНаСервере(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросФормированияОтчета","");
	Результат.Вставить("ЗапросОтчетаПоТокену","");
	
	ПараметрыОтчета = Новый Структура;
	ОтчетПоЗапросу = "";
	ФорматДанныхОбмена = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.НаименованиеПараметраВходного КАК НаименованиеПараметраВходного,
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.Ссылка.Наименование КАК Наименование,
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.ПримерЗначения КАК ПримерЗначения,
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.Ссылка.ФорматДанныхОбмена КАК ФорматДанныхОбмена
		|ИЗ
		|	Справочник.НастройкиОтчетовПоЗапросу.ПараметрыОтчета КАК НастройкиОтчетовПоЗапросуПараметрыОтчета
		|ГДЕ
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтчетПоЗапросу = ВыборкаДетальныеЗаписи.Наименование;
		ФорматДанныхОбмена = ВыборкаДетальныеЗаписи.ФорматДанныхОбмена;
		ПараметрыОтчета.Вставить(ВыборкаДетальныеЗаписи.НаименованиеПараметраВходного, ВыборкаДетальныеЗаписи.ПримерЗначения);
	КонецЦикла;
	
	Если ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДля1С() Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИмяОтчета", СокрЛП(ОтчетПоЗапросу));
		СтруктураДанных.Вставить("ПараметрыОтчета", ПараметрыОтчета);
		Результат.ЗапросФормированияОтчета =  ПолучитьСтрокуXMLдляФормата1С(СтруктураДанных);
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ТокенПолученияОтчета", Строка(Новый УникальныйИдентификатор));
		Результат.ЗапросОтчетаПоТокену =  ПолучитьСтрокуXMLдляФормата1С(СтруктураДанных);
		
	ИначеЕсли ФорматДанныхОбмена = Справочники.НастройкиОтчетовПоЗапросу.КодФорматаДанныхДляСтороннейСистемы() Тогда
		
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗапросОтчетаDataCore");
		ЗаписьXML.ЗаписатьАтрибут("ИмяОтчета", ОтчетПоЗапросу);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Параметры");
		Для Каждого Параметр Из ПараметрыОтчета Цикл
			ЗаписьXML.ЗаписатьАтрибут(Параметр.Ключ, XMLСтрока(Параметр.Значение));
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		Результат.ЗапросФормированияОтчета = ЗаписьXML.Закрыть();
		
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗапросОтчетаDataCore");
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТокенПолученияОтчета");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Новый УникальныйИдентификатор));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		Результат.ЗапросОтчетаПоТокену = ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ОчисткаОчередиФормированияОтчетовПоЗапросу() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьФормированияОтчетовПоЗапросу.Токен КАК Токен,
		|	ОчередьФормированияОтчетовПоЗапросу.НастройкаОтчетаПоЗапросу КАК НастройкаОтчетаПоЗапросу
		|ИЗ
		|	РегистрСведений.ОчередьФормированияОтчетовПоЗапросу КАК ОчередьФормированияОтчетовПоЗапросу
		|ГДЕ
		|	ОчередьФормированияОтчетовПоЗапросу.Сформирован
		|	И ОчередьФормированияОтчетовПоЗапросу.ДатаХраненияРезультата <= &ТекущаяДата
		|	И ОчередьФормированияОтчетовПоЗапросу.ДатаХраненияРезультата <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Токен = ВыборкаДетальныеЗаписи.Токен;
		МенеджерЗаписи.НастройкаОтчетаПоЗапросу = ВыборкаДетальныеЗаписи.НастройкаОтчетаПоЗапросу;
		
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.РезультатФормирования = Неопределено;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;

КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец