
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Доступность = Ложь;
		Элементы.НайтиОбъекты.Доступность = Ложь;
		Элементы.УдалитьСссылкиНаДокументыИПометитьНаУдаление.Доступность = Ложь;
	КонецЕсли;
	
	Параметры.Свойство("ОбъектОтбора", Документ);
	НайтиОбъектыНаСервере();
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НайтиОбъекты(Команда)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	НайтиОбъектыНаСервере();
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОбъектов

&НаКлиенте
Процедура УстановитьПометки(Команда)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	ОбработкаПометокСтрок(Истина);
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	ОбработкаПометокСтрок(Ложь);
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	НайтиОбъектыНаСервере();
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиОбъектыНаСервере()
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	ТаблицаОбъектов.Очистить();
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ВТ_СФ
	//	|ИЗ
	//	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	//	|ГДЕ
	//	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &Документ
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	&Документ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Диадок_ПакетыДокументов.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ВТ_Пакеты
	//	|ИЗ
	//	|	Справочник.Диадок_ПакетыДокументов КАК Диадок_ПакетыДокументов
	//	|ГДЕ
	//	|	Диадок_ПакетыДокументов.Документ В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_СФ.Ссылка
	//	|			ИЗ
	//	|				ВТ_СФ КАК ВТ_СФ)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Пакеты.Ссылка КАК Ссылка,
	//	|	ВТ_Пакеты.Ссылка.Документ КАК Документ,
	//	|	ВТ_Пакеты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	//	|	ВТ_Пакеты.Ссылка.Метка КАК Метка,
	//	|	ТИПЗНАЧЕНИЯ(ВТ_Пакеты.Ссылка) КАК Тип,
	//	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, начало
	//	|	"""" КАК Статус,
	//	|	"""" КАК ИмяФайла,
	//	|	"""" КАК РегистрироватьСостояниеВРегистре,
	//	|	"""" КАК ВидДокумента
	//	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, конец
	//	|ИЗ
	//	|	ВТ_Пакеты КАК ВТ_Пакеты
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	Диадок_Документы.Ссылка,
	//	|	Диадок_Документы.Документ,
	//	|	Диадок_Документы.ПометкаУдаления,
	//	|	Диадок_Документы.Метка,
	//	|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Ссылка),
	//	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, начало
	//	|	Диадок_Документы.Статус,
	//	|	Диадок_Документы.ИмяФайла,
	//	|	Диадок_Документы.ВидДокумента.РегистрироватьСостояниеВРегистре,
	//	|	Диадок_Документы.ВидДокумента КАК ВидДокумента
	//	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, конец
	//	|ИЗ
	//	|	Справочник.Диадок_Документы КАК Диадок_Документы
	//	|ГДЕ
	//	|	(Диадок_Документы.Документ В
	//	|				(ВЫБРАТЬ
	//	|					ВТ_СФ.Ссылка
	//	|				ИЗ
	//	|					ВТ_СФ КАК ВТ_СФ)
	//	|			ИЛИ Диадок_Документы.Пакет В
	//	|				(ВЫБРАТЬ
	//	|					ВТ_Пакеты.Ссылка
	//	|				ИЗ
	//	|					ВТ_Пакеты КАК ВТ_Пакеты))";
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, начало
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СФ
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &Документ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураПолученныйДокументыОснования.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование = &Документ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Диадок_Документы.Ссылка КАК Диадок_Документы,
		|	Диадок_Документы.Пакет КАК Пакет
		|ПОМЕСТИТЬ ВТ_ДиадокДокументыПоСФ
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Документ В
		|			(ВЫБРАТЬ
		|				ВТ_СФ.Ссылка
		|			ИЗ
		|				ВТ_СФ КАК ВТ_СФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Диадок_ПакетыДокументов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Пакеты
		|ИЗ
		|	Справочник.Диадок_ПакетыДокументов КАК Диадок_ПакетыДокументов
		|ГДЕ
		|	Диадок_ПакетыДокументов.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ДиадокДокументыПоСФ.Пакет
		|			ИЗ
		|				ВТ_ДиадокДокументыПоСФ КАК ВТ_ДиадокДокументыПоСФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Пакеты.Ссылка КАК Ссылка,
		|	ВТ_Пакеты.Ссылка.Документ КАК Документ,
		|	ВТ_Пакеты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_Пакеты.Ссылка.Метка КАК Метка,
		|	ТИПЗНАЧЕНИЯ(ВТ_Пакеты.Ссылка) КАК Тип,
		|	"""" КАК Статус,
		|	"""" КАК ИмяФайла,
		|	"""" КАК РегистрироватьСостояниеВРегистре,
		|	"""" КАК ВидДокумента
		|ИЗ
		|	ВТ_Пакеты КАК ВТ_Пакеты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.Документ,
		|	Диадок_Документы.ПометкаУдаления,
		|	Диадок_Документы.Метка,
		|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Ссылка),
		|	Диадок_Документы.Статус,
		|	Диадок_Документы.ИмяФайла,
		|	Диадок_Документы.ВидДокумента.РегистрироватьСостояниеВРегистре,
		|	Диадок_Документы.ВидДокумента
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	(Диадок_Документы.Документ В
		|				(ВЫБРАТЬ
		|					ВТ_ДиадокДОкументыПоСФ.Диадок_Документы
		|				ИЗ
		|					ВТ_ДиадокДОкументыПоСФ КАК ВТ_ДиадокДОкументыПоСФ)
		|			ИЛИ Диадок_Документы.Пакет В
		|				(ВЫБРАТЬ
		|					ВТ_Пакеты.Ссылка
		|				ИЗ
		|					ВТ_Пакеты КАК ВТ_Пакеты))";
	//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, конец
	
	Запрос.УстановитьПараметр("Документ", Документ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		Если ВыборкаДетальныеЗаписи.Метка <> "Отправлен" Тогда
			НоваяСтрока.Обрабатывать = Истина;
		КонецЕсли;
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПометокСтрок(Значение)
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	Для Каждого СтрТЗ Из ТаблицаОбъектов  Цикл
		
		СтрТЗ.Обрабатывать = Значение;
		
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСссылкиНаДокументыИПометитьНаУдалениеНаСервере()
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	Для Каждого СтрокаТаблицы ИЗ ТаблицаОбъектов Цикл
		
		Если НЕ СтрокаТаблицы.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектДляОбработки = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		ОбъектДляОбработки.Документ = Неопределено;
		ОбъектДляОбработки.ПометкаУдаления = Истина;
		ОбъектДляОбработки.УстановитьКомментарийВерсииИсторииДанных("Очистка ссылок на документы в справочниках Диадок по "+Документ);
		ОбъектДляОбработки.Записать();
		
	КонецЦикла;
	
	НайтиОбъектыНаСервере();
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСссылкиНаДокументыИПометитьНаУдаление(Команда)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	УдалитьСссылкиНаДокументыИПометитьНаУдалениеНаСервере();
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

#КонецОбласти


