//Евросиб (Гонтаренко 02.03.2021 #28263
Функция ЭтоСобственныйКонтрагент(КонтрагентСсылка) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Единичка
	               |ИЗ
	               |	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	               |ГДЕ
	               |	СобственныеКонтрагенты.Контрагент = &Контрагент";
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции


Функция УстановитьСнятьСобственныйКонтрагент(КонтрагентСсылка, Установка = Истина) Экспорт
	Набор = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
	Набор.Отбор.Контрагент.Установить(КонтрагентСсылка);
	Если Установка Тогда
		Запись = Набор.Добавить();
		Запись.Контрагент = КонтрагентСсылка;
	КонецЕсли;
	Набор.Записать(Истина); // Нам не важно, есть там он или нет.

КонецФункции
//Евросиб )Гонтаренко 02.03.2021 #28263
