
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 08.01.2025 ( #97984
	РецензОбъект = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "РецензОбъект");
	Если ТипЗнч(РецензОбъект) = Тип("СправочникСсылка.ПроцессСогласования") Тогда
		ДокументСогласования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РецензОбъект, "ДокументСогласования");
		Если ЗначениеЗаполнено(ДокументСогласования) Тогда
			РецензОбъекты = Новый Массив;
			РецензОбъекты.Добавить(РецензОбъект);
			РецензОбъекты.Добавить(ДокументСогласования);
			Параметры.Отбор.Вставить("РецензОбъект", Новый ФиксированныйМассив(РецензОбъекты));
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 08.01.2025 )
	
КонецПроцедуры
