
//Евросиб Коханенко Н.А. 17.12.2024 (( #97643 
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыПеревозок.Ссылка КАК ВидыПеревозок
	               |ИЗ
	               |	Справочник.ВидыПеревозок КАК ВидыПеревозок
	               |ГДЕ
	               |	НЕ ВидыПеревозок.ПометкаУдаления
	               |	И (&РазрешитьВРП 
	               |		ИЛИ ВидыПеревозок.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Внутрироссийская)) 
	               |	И ВидыПеревозок.Наименование ПОДОБНО &СтрокаПоиска";
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%"); 
	Если Параметры.Отбор.Свойство("РазрешитьВРП") Тогда
		Запрос.УстановитьПараметр("РазрешитьВРП", Параметры.Отбор.РазрешитьВРП);
	Иначе
		Запрос.УстановитьПараметр("РазрешитьВРП", Истина);
	КонецЕсли;	
	Результат = Запрос.Выполнить();
	ТаблицаРезультатов = Результат.Выгрузить();
	МассивВидыПеревозок = ТаблицаРезультатов.ВыгрузитьКолонку("ВидыПеревозок");
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(МассивВидыПеревозок);
	СтандартнаяОбработка = Ложь; 
		
КонецПроцедуры //Евросиб Коханенко Н.А. 17.12.2024 )) #97643
