// ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 20.09.2023
// Было:
//Функция ПолучитьРуководителя(Контрагент, Дата, ВыбранныйРуководитель = неопределено) Экспорт  
//
//	Результат = Новый Структура("Ссылка, ФИОРус, ФИОРПРус, ДолжностьРус, ДолжностьРП, Основание, ОснованиеРус, ФИОАнгл, ДолжностьАнгл, ОснованиеАнгл");
//Стало:
//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
// Было:
//Функция ПолучитьРуководителя(Контрагент, Дата, ВыбранныйРуководитель = неопределено, Валюта = Неопределено) Экспорт
//Стало:
//Функция ПолучитьРуководителя(Контрагент, Дата, ВыбранныйРуководитель = неопределено, Валюта = Неопределено, ПСЦПоставщика = Истина) Экспорт
Функция ПолучитьРуководителя(Контрагент, Дата, ВыбранныйРуководитель = неопределено, Валюта = Неопределено, ПСЦПоставщика = Истина, ТипОбъекта = Неопределено) Экспорт //Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, добавлен параметр ТипОбъекта
//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 

	//Евросиб Каблов 06.02.2024 ( #67092
	//Результат = Новый Структура("Ссылка, ФИОРус, ФИОРПРус, ДолжностьРус, ДолжностьРП, Основание, ОснованиеРус, ФИОАнгл, ДолжностьАнгл, ОснованиеАнгл, ФИОВал, ДолжностьВал, НаОснованииВал");
	Результат = Новый Структура("Ссылка, ФИОРус, ФИОРПРус, ДолжностьРус, ДолжностьРП, Основание, ОснованиеРус, ФИОАнгл, ДолжностьАнгл, ОснованиеАнгл, ФИОВал, ДолжностьВал, НаОснованииВал, СканДоверенности");
	//Евросиб Каблов 06.02.2024 )
	
// ДИТ US 59973 ТА 74834 Сержантова А.С. Конец: 20.09.2023	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеРуководителяКонтрагентов.Руководитель КАК Ссылка,
	               |	ДанныеРуководителяКонтрагентов.Должность КАК ДолжностьРус,
	               |	ДанныеРуководителяКонтрагентов.Основание КАК Основание,
	               |	ДанныеРуководителяКонтрагентов.НаОсновании КАК ОснованиеРус,
	               |	ВЫБОР
	               |		КОГДА ДанныеРуководителяКонтрагентов.ФИОВРодительномПадеже = """"
	               |			ТОГДА ДанныеРуководителяКонтрагентов.Руководитель.НаименованиеДляПечатиВРП
	               |		ИНАЧЕ ДанныеРуководителяКонтрагентов.ФИОВРодительномПадеже
	               |	КОНЕЦ КАК ФИОРПРус,
	               |	ДанныеРуководителяКонтрагентов.Руководитель.Наименование КАК ФИОРус,
	               |	ДанныеРуководителяКонтрагентов.Руководитель.НаименованиеДляПечатиВРПАнгл КАК ФИОАнгл,
	               |	ДанныеРуководителяКонтрагентов.ДолжностьАнгл КАК ДолжностьАнгл,
	               |	ДанныеРуководителяКонтрагентов.НаОснованииАнгл КАК ОснованиеАнгл,
	               |	ВЫБОР
	               |		КОГДА ДанныеРуководителяКонтрагентов.ДолжностьВРодительномПадеже = """"
	               |			ТОГДА ДанныеРуководителяКонтрагентов.Руководитель.ДолжностьРП
	               |		ИНАЧЕ ДанныеРуководителяКонтрагентов.ДолжностьВРодительномПадеже
	               |	КОНЕЦ КАК ДолжностьРП,
				   
				   //Евросиб Каблов 06.02.2024 ( #67092
				   |	ДанныеРуководителяКонтрагентов.СканДоверенности КАК СканДоверенности,
				   //Евросиб Каблов 06.02.2024 )
				   
				   // ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 20.09.2023
				   |	ЕстьNULL(ФизическиеЛицаПереводыНаименований.ФИО, """") КАК ФИОВал,
				   |	ЕстьNULL(ФизическиеЛицаПереводыНаименований.Должность, """") КАК ДолжностьВал,
				   |	ЕстьNULL(ФизическиеЛицаПереводыНаименований.Основание, """") КАК НаОснованииВал 
				   // ДИТ US 59973 ТА 74834 Сержантова А.С. Конец: 20.09.2023
	               |ИЗ
	               |	РегистрСведений.ДанныеРуководителяКонтрагентов КАК ДанныеРуководителяКонтрагентов
				   // ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 20.09.2023
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ПереводыНаименований КАК ФизическиеЛицаПереводыНаименований
				   |		ПО (ФизическиеЛицаПереводыНаименований.Валюта = &Валюта
				   |			И ДанныеРуководителяКонтрагентов.Руководитель = ФизическиеЛицаПереводыНаименований.Ссылка) 
				   // ДИТ US 59973 ТА 74834 Сержантова А.С. Конец: 20.09.2023
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ВыбранныйРуководитель = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ДанныеРуководителяКонтрагентов.Руководитель = &ВыбранныйРуководитель
	               |		КОНЕЦ
	               |	И ДанныеРуководителяКонтрагентов.Период <= &Период
	               |	И ДанныеРуководителяКонтрагентов.Контрагент = &Контрагент
				   //Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
				   |	И ВЫБОР
				   |			КОГДА ДанныеРуководителяКонтрагентов.ОкончаниеДействия = &ПустаяДата
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ДанныеРуководителяКонтрагентов.ОкончаниеДействия >= &Период
				   |		КОНЕЦ
				   //Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДанныеРуководителяКонтрагентов.Период УБЫВ";				   
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВыбранныйРуководитель", ?(ЗначениеЗаполнено(ВыбранныйРуководитель), ВыбранныйРуководитель, Неопределено));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	// ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 20.09.2023
	Запрос.УстановитьПараметр("Валюта", Валюта);
	// ДИТ US 59973 ТА 74834 Сержантова А.С. Конец: 20.09.2023 
	
	//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
	Запрос.Текст = Запрос.Текст + 
				";
				|ВЫБРАТЬ
				|	ДанныеПодписантовКонтрагентов.Подписант КАК Ссылка,
				|	ДанныеПодписантовКонтрагентов.Должность КАК ДолжностьРус,
				|	ДанныеПодписантовКонтрагентов.ДолжностьАнгл КАК ДолжностьАнгл,
				|	ДанныеПодписантовКонтрагентов.СканДоверенности КАК СканДоверенности,
				|	ДанныеПодписантовКонтрагентов.Подписант.Наименование КАК ФИОРус,
	            |	ДанныеПодписантовКонтрагентов.Подписант.НаименованиеДляПечатиВРПАнгл КАК ФИОАнгл,
				|	ДанныеПодписантовКонтрагентов.Доверенность КАК Основание,
				|	ДанныеПодписантовКонтрагентов.НаОсновании КАК ОснованиеРус,
			    |	ВЫБОР
			    |		КОГДА ДанныеПодписантовКонтрагентов.ФИОВРодительномПадеже = """"
			    |			ТОГДА ДанныеПодписантовКонтрагентов.Подписант.НаименованиеДляПечатиВРП
			    |		ИНАЧЕ ДанныеПодписантовКонтрагентов.ФИОВРодительномПадеже
			    |	КОНЕЦ КАК ФИОРПРус,
			    |	ВЫБОР
			    |		КОГДА ДанныеПодписантовКонтрагентов.ДолжностьВРодительномПадеже = """"
			    |			ТОГДА ДанныеПодписантовКонтрагентов.Подписант.ДолжностьРП
			    |		ИНАЧЕ ДанныеПодписантовКонтрагентов.ДолжностьВРодительномПадеже
			    |	КОНЕЦ КАК ДолжностьРП,
				|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.ФИО, """") КАК ФИОВал,
				|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.Должность, """") КАК ДолжностьВал,
				|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.Основание, """") КАК НаОснованииВал
				|ИЗ
				|	РегистрСведений.ДанныеПодписантовКонтрагентов КАК ДанныеПодписантовКонтрагентов
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ПереводыНаименований КАК ФизическиеЛицаПереводыНаименований
				|		ПО (ФизическиеЛицаПереводыНаименований.Валюта = &Валюта)
				|ГДЕ
				|	ДанныеПодписантовКонтрагентов.Период <= &Период
				|	И ДанныеПодписантовКонтрагентов.Контрагент = &Контрагент
				|	И ДанныеПодписантовКонтрагентов.Подписант = &Подписант
				|	И ВЫБОР
				|			КОГДА ДанныеПодписантовКонтрагентов.ОкончаниеДействия = &ПустаяДата
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ДанныеПодписантовКонтрагентов.ОкончаниеДействия >= &Период
				|		КОНЕЦ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДанныеПодписантовКонтрагентов.Период УБЫВ";
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Если ЗначениеЗаполнено(ВыбранныйРуководитель) Тогда
		Запрос.УстановитьПараметр("Подписант", ВыбранныйРуководитель);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДанныеПодписантовКонтрагентов.Подписант = &Подписант", "");
	КонецЕсли;
	//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 

	//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
	//Ответ = запрос.Выполнить().Выбрать();
	Пакет = Запрос.ВыполнитьПакет(); 
	//Если Пакет[0].Пустой() 
	//		И НЕ ПСЦПоставщика Тогда
	//	Ответ = Пакет[1].Выбрать();
	//Иначе
	//	Ответ = Пакет[0].Выбрать();
	//КонецЕсли;
	//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
	//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
	Если ТипОбъекта = Тип("ДокументСсылка.ПСЦ") Тогда
		Если НЕ Пакет[1].Пустой() И НЕ ПСЦПоставщика Тогда
			Ответ = Пакет[1].Выбрать();
		Иначе
			Ответ = Пакет[0].Выбрать();
		КонецЕсли;
	Иначе
		Если Пакет[0].Пустой() 
			И НЕ ПСЦПоставщика Тогда
			Ответ = Пакет[1].Выбрать();
		Иначе
			Ответ = Пакет[0].Выбрать();
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец

	Если Ответ.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(результат, Ответ);
		
	КонецЕсли; 
	
	Возврат результат;
	
КонецФункции

//Евросиб Каблов 20.05.2024 #67092
Функция ПолучитьПодписанта(Контрагент, Период, Подписант = неопределено, Валюта = Неопределено) Экспорт
	
	//Евросиб Коханенко Н.А. 06.12.2024 (( #89893 
	//Результат = Новый Структура("Подписант, ДолжностьРус, ДолжностьАнгл, НачалоДействия, ОкончаниеДействия, Доверенность, СканДоверенности, ДолжностьВРодительномПадеже, ФИОВРодительномПадеже, ГлавныйБухгалтер, ФИОВал, ДолжностьВал, НаОснованииВал");
	Результат = Новый Структура("Подписант, ДолжностьРус, ДолжностьАнгл, НачалоДействия, ОкончаниеДействия, Доверенность, СканДоверенности, ДолжностьВРодительномПадеже, ФИОВРодительномПадеже, ГлавныйБухгалтер, ФИОВал, ДолжностьВал, НаОснованииВал, НаОсновании");
	//Евросиб Коханенко Н.А. 06.12.2024 )) #89893 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПодписантовКонтрагентов.Подписант КАК Подписант,
	|	ДанныеПодписантовКонтрагентов.Должность КАК ДолжностьРус,
	|	ДанныеПодписантовКонтрагентов.ДолжностьАнгл КАК ДолжностьАнгл,
	|	ДанныеПодписантовКонтрагентов.СканДоверенности КАК СканДоверенности,
	|	ДанныеПодписантовКонтрагентов.Период КАК НачалоДействия,
	|	ДанныеПодписантовКонтрагентов.ОкончаниеДействия КАК ОкончаниеДействия,
	|	ДанныеПодписантовКонтрагентов.ДолжностьВРодительномПадеже КАК ДолжностьВРодительномПадеже,
	|	ДанныеПодписантовКонтрагентов.Фамилия КАК Фамилия,
	//Евросиб Коханенко Н.А. 06.12.2024 (( #89893 
	|	ДанныеПодписантовКонтрагентов.НаОсновании КАК НаОсновании,
	//Евросиб Коханенко Н.А. 06.12.2024 )) #89893 
	|	ДанныеПодписантовКонтрагентов.Имя КАК Имя,
	|	ДанныеПодписантовКонтрагентов.Отчество КАК Отчество,
	|	ДанныеПодписантовКонтрагентов.ФИОВРодительномПадеже КАК ФИОВРодительномПадеже,
	|	ДанныеПодписантовКонтрагентов.Доверенность КАК Доверенность,
	|	ДанныеПодписантовКонтрагентов.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.ФИО, """") КАК ФИОВал,
	|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.Должность, """") КАК ДолжностьВал,
	|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.Основание, """") КАК НаОснованииВал
	|ИЗ
	|	РегистрСведений.ДанныеПодписантовКонтрагентов КАК ДанныеПодписантовКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ПереводыНаименований КАК ФизическиеЛицаПереводыНаименований
	|		ПО (ФизическиеЛицаПереводыНаименований.Валюта = &Валюта)
	|ГДЕ
	|	ДанныеПодписантовКонтрагентов.Период <= &Период
	|	И ДанныеПодписантовКонтрагентов.Контрагент = &Контрагент
	|	И ДанныеПодписантовКонтрагентов.Подписант = &Подписант
	|	И ВЫБОР
	|			КОГДА ДанныеПодписантовКонтрагентов.ОкончаниеДействия = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДанныеПодписантовКонтрагентов.ОкончаниеДействия >= &Период
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеПодписантовКонтрагентов.Период УБЫВ";
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Период", Период);	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Если ЗначениеЗаполнено(Подписант) Тогда
		Запрос.УстановитьПараметр("Подписант", Подписант);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДанныеПодписантовКонтрагентов.Подписант = &Подписант", "");
	КонецЕсли;

	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда		
		ЗаполнитьЗначенияСвойств(результат, Ответ);		
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции

Функция ПолучитьГлБухгалтера(Контрагент, Дата) Экспорт
	
	Результат = Новый Структура("ГлавныйБухгалтер, ГлавныйБухгалтерНаименование, ГлавныйБухгалтерНаименованиеДляПечатиВРП, ДолжностьРус, ОснованиеРус, ГлавныйБухгалтерНаименованиеДляПечатиВРПАнгл, ДолжностьАнгл, ОснованиеАнгл");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеРуководителяКонтрагентовСрезПоследних.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	               |	ДанныеРуководителяКонтрагентовСрезПоследних.ГлавныйБухгалтер.Наименование КАК ГлавныйБухгалтерНаименование,
	               |	ДанныеРуководителяКонтрагентовСрезПоследних.ГлавныйБухгалтер.НаименованиеДляПечатиВРП КАК ГлавныйБухгалтерНаименованиеДляПечатиВРП,
	               |	ДанныеРуководителяКонтрагентовСрезПоследних.ГлавныйБухгалтер.НаименованиеДляПечатиВРПАнгл КАК ГлавныйБухгалтерНаименованиеДляПечатиВРПАнгл 
	               |ИЗ
	               |	РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК ДанныеРуководителяКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.ГлавныйБухгалтер = Ответ.ГлавныйБухгалтер;
		Результат.ГлавныйБухгалтерНаименование = Ответ.ГлавныйБухгалтерНаименование;
		Результат.ГлавныйБухгалтерНаименованиеДляПечатиВРП = Ответ.ГлавныйБухгалтерНаименованиеДляПечатиВРП;
		Результат.ДолжностьРус = "Главный бухгалтер";
		Результат.ОснованиеРус = "";
		Результат.ГлавныйБухгалтерНаименованиеДляПечатиВРПАнгл = Ответ.ГлавныйБухгалтерНаименованиеДляПечатиВРПАнгл;
		Результат.ДолжностьАнгл = "";
		Результат.ОснованиеАнгл = "";  
		
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции