//Евросиб Гонтаренко 17.03.2021 #Task 32081

&НаСервере
Функция response(request, GUID)

	СтруктураОтвет = Новый Структура("response, GUID", "", GUID);
	Результат = Неопределено;
	
	
	ДанныеСобытия = РазобратьВходящиеDATA(request);
	
	Если ДанныеСобытия.ErrorMsg = "" Тогда
		//Попытка         
			СтруктураОтвет.response = ВыполнитьФункциюМодуля(ДанныеСобытия.request, ДанныеСобытия.data);
		//Исключение
		//	СтруктураОтвет.response = Новый Структура("result, data", "-2", ДанныеСобытия.ErrorMsg);;
		//КонецПопытки;
	Иначе
		СтруктураОтвет.response = Новый Структура("result, data", "-2", ДанныеСобытия.ErrorMsg);
	КонецЕсли;
	
	Возврат ПреобразоватьВСтрокуОтвета(СтруктураОтвет);
КонецФункции

Функция ВыполнитьФункциюМодуля(ИмяСобытия, Параметры)
	
	Если ИмяСобытия = "changObjects" Тогда
		
		Возврат changObjects(Параметры);
		
	ИначеЕсли ИмяСобытия = "createUser" Тогда
		
		Возврат createUser(Параметры);
				
	ИначеЕсли ИмяСобытия = "getLocationList" Тогда
		
		Возврат getLocationList(Параметры);
				
	ИначеЕсли ИмяСобытия = "getStokList" Тогда
		
		Возврат getStokList(Параметры);
				
	ИначеЕсли ИмяСобытия = "getStokQuantity" Тогда
		
		Возврат getStokQuantity(Параметры);

	ИначеЕсли ИмяСобытия = "getTrip" Тогда
		
		Возврат getTrip(Параметры);

	ИначеЕсли ИмяСобытия = "getServiceList" Тогда
		
		Возврат getServiceList(Параметры);

	ИначеЕсли ИмяСобытия = "getISOList" Тогда
		
		Возврат getISOList(Параметры);

	ИначеЕсли ИмяСобытия = "getTypeOfCargo" Тогда
		
		Возврат getTypeOfCargo(Параметры);

	ИначеЕсли ИмяСобытия = "postRequest" Тогда
		
		Возврат postRequest(Параметры);

	ИначеЕсли ИмяСобытия = "getRequest" Тогда
		
		Возврат getRequest(Параметры);

	ИначеЕсли ИмяСобытия = "updateRequest" Тогда
		
		Возврат updateRequest(Параметры);

	ИначеЕсли ИмяСобытия = "getInvoce" Тогда
		
		Возврат getInvoce(Параметры);

	//ИначеЕсли ИмяСобытия = "getRailwayInvoice" Тогда
	//	
	//	Возврат getRailwayInvoice(Параметры);

	//ИначеЕсли ИмяСобытия = "getDislocation" Тогда
	//	
	//	Возврат getDislocation(Параметры);

	ИначеЕсли ИмяСобытия = "getReliz" Тогда
		
		Возврат getReliz(Параметры);

	ИначеЕсли ИмяСобытия = "updateReliz" Тогда
		
		Возврат updateReliz(Параметры);
		
	ИначеЕсли ИмяСобытия = "getEventsList" Тогда
		
		Возврат getEventsList(Параметры);
		
	Иначе // -1
		
		СтруктураОтвет = новый Структура("result, data", -1, "Не найден WS-метод");
		Возврат СтруктураОтвет;
		
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция РазобратьВходящиеDATA(Входящее)
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("request", "");
	СтруктураОтвет.Вставить("data", "");
	СтруктураОтвет.Вставить("ErrorMsg", "");
	
    ЧтениеJSON    = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(Входящее);
	Попытка
		РезультатРазбора = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		СтруктураОтвет.ErrorMsg = ""+СокрЛП(Входящее);
		Возврат СтруктураОтвет;
	КонецПопытки;	
	
	Если ТипЗнч(РезультатРазбора) <> Тип("Структура") Тогда
		СтруктураОтвет.ErrorMsg = "Неверный тип параметров";
		Возврат СтруктураОтвет;
	КонецЕсли;

	Если НЕ РезультатРазбора.Свойство("request") ИЛИ НЕ РезультатРазбора.Свойство("data") Тогда
		СтруктураОтвет.ErrorMsg = "Недостаточно параметров";
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураОтвет, РезультатРазбора, "request, data");
	
	Возврат СтруктураОтвет;
КонецФункции

Функция ПреобразоватьВСтрокуОтвета(НаОтправку)
	
	ЗаписьJSON = новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, НаОтправку);
	лОтвет = ЗаписьJSON.Закрыть();
	
	//лОтвет = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(лОтвет));
	
	Возврат лОтвет;
КонецФункции

// Преобразование строки даты формата "2020-09-21T00:00:00" в 1С дату
Функция ПолучитьДату(date_)
	лОтвет = Неопределено;
	
	Попытка
		лОтвет = СтрЗаменить(date_, "-", "");
		лОтвет = СтрЗаменить(лОтвет, "T", "");
		лОтвет = СтрЗаменить(лОтвет, ":", "");
		лОтвет = Дата(лОтвет);
	Исключение
		
	КонецПопытки;
	
	Возврат лОтвет;
КонецФункции

Функция СоздатьЗапросКлиента(СтруктураПараметров)
	
	ЗапросК = Документы.Запрос.СоздатьДокумент();
	ЗапросК.Заполнить(Неопределено);
	//ЗапросК.Груз = груз;
	//ЗапросК.КонтейнерКлиента 		= НЕ КонтейнерЕвросиба;
	//ЗапросК.Резидент = Резидент;
	//Груз = Грузы_сервер.НайтиСоздатьГруз(gruzlist);
	//КонтейнерЕвросиба = ?(Строка(cnt_eurosibowner) = "1", Истина, Ложь);
	ЗапросК.ИсточникЗапроса 		= Перечисления.ИсточникиЗапросов.ЗапросЧерезВебСайтБезАвторизации;
	ЗапросК.КонтактныйТелефон 		= СтруктураПараметров.other_tel;
	ЗапросК.ПериодОтправкиНачало 	= ПолучитьДату(СтруктураПараметров.from_datetime);
	ЗапросК.ПериодПрибытияНачало 	= ПолучитьДату(СтруктураПараметров.to_datetime);;
	ЗапросК.ПунктОтправления 		= Справочники.Локации.НайтиПоКоду(СтруктураПараметров.from_location);
	ЗапросК.ПунктНазначения 		= Справочники.Локации.НайтиПоКоду(СтруктураПараметров.to_location);
	Если ЗначениеЗаполнено(СтруктураПараметров.GUIDPartner) Тогда
		//поиск по уид
		//Запроск.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ФОрмат(ИННКонтрагента, "ЧГ="));
	КонецЕсли;
	
	Для каждого Стр из СтруктураПараметров.containers Цикл
		НСтр = ЗапросК.СоставУслуги.Добавить();
		НСтр.Количество = Стр.count;
		НСтр.ТипТЕ 		= Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(Стр.typeISO, Истина);
	КонецЦикла;
	ЗапросК.ТекстЗапроса 		= СокрЛП(СтруктураПараметров.other_longdescription);
	ЗапросК.ЭлектроннаяПочта 	= СтруктураПараметров.other_email;
	ЗапросК.Примечание 			= СтруктураПараметров.other_fio;
	ЗапросК.Дата 				= ТекущаяДата();
	ЗапросК.Записать(РежимЗаписиДокумента.Запись);
	Попытка
		ЗапросК.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
	Возврат ЗапросК.Ссылка;
	
КонецФункции


// changObjects
// Функция для получения списка измененных объектов с момента последнего запроса.
//Вх - пусто
//Исх -	
//{
//	"result": 0,
//	"data": {
//		"type1":[
//			"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2"
//],
//		"type2":[
//			"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2"
//]
//}}
Функция changObjects(Параметры)
	
	// TBD Выяснить необходимость выгрузки всего объема данных и применения критериев фильтра
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(ПротоколОбменов.Объект) КАК ТипОбъекта,
	|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
	|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ЛК)
	|	И ПротоколОбменов.ДатаОбмена = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТИПЗНАЧЕНИЯ(ПротоколОбменов.Объект),
	|	ПротоколОбменов.УИДИсточника";
	
	результат = Запрос.Выполнить();
	ВыборкаТип = результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипОбъекта");
	//	
	структураПоТипам = Новый Структура();
	Пока ВыборкаТип.Следующий()Цикл		
		массивУИДы = новый Массив;
		выборкаУИД = ВыборкаТип.Выбрать();
		Пока выборкаУИД.Следующий()Цикл
			массивУИДы.Добавить(выборкаУИД.УИДИсточника);
		КонецЦикла;
		структураПоТипам.Вставить(ВыборкаТип.ТипОбъекта, массивУИДы);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data = структураПоТипам;
	СтруктураОтвет.result = 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// createUser 
// Функция создания нового пользователя
//Вх - 
//{
//	"request": "createUser",
//	"data": {
//		"INN": "503502501201",
//		"KPP": "",
//		"OGRN": ""
//}}
//Исх -	
//{
//	"result": 0,
//	"data": {
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2"
//		}}
Функция createUser(Параметры);
	
	СтруктураОтвет = Новый Структура("result, data");
	СтруктураData  = Новый Структура;
	
	//СтрокаСервер = "suggestions.dadata.ru";
	//СтрокаЗапрос = "/suggestions/api/4_1/rs/findById/party";
	//APIKey = "68321c97a4a9ca8a116cb9da799cd962baf1c626";   // не секрет, в общем, бесплатно же ш. Но TBD перенести настройку подключения в константы
	//
	//ssl = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());   
	//Соединение = Новый HTTPСоединение(СтрокаСервер,443,,,,5, ssl);
	//HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапрос); 
	//HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	//HTTPЗапрос.Заголовки.Вставить("Authorization", "Token " + APIKey);
	//HTTPЗапрос.УстановитьТелоИзСтроки("{ ""query"": """ + Параметры.INN + """ } ", КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	//НовоеИмя 		= "Без названия ОПФ";
	//НовоеПолноеИмя 	= "Без названия ОПФ";
	//
	//Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);   
	//СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");

	//Попытка
	//	Если НЕ Ответ.КодСостояния <> 200 И НЕ ПустаяСтрока(СтрокаОтвета) Тогда
	//		ЧтениеJSON    = Новый ЧтениеJSON();
	//	    ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	//	    РезультатDaData = ПрочитатьJSON(ЧтениеJSON);
	//		
	//		НовоеИмя = РезультатDaData.suggestions[0].data.name.short +" "+ РезультатDaData.suggestions[0].data.opf.short;
	//		НовоеПолноеИмя = РезультатDaData.suggestions[0].data.name.full_with_opf;
	//	КонецЕсли; 
	//Исключение
	//	// TBD сделать обработку исключения
	//КонецПопытки;

	//НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();         // TBD Выяснить куда сохранять новые КА
	//
	//НовыйКонтрагент.ИНН 				= Параметры.INN;
	//НовыйКонтрагент.КПП 				= Параметры.KPP;
	//НовыйКонтрагент.ОГРН 				= Параметры.OGRN;
	//НовыйКонтрагент.Наименование 		= НовоеИмя;
	//НовыйКонтрагент.НаименованиеПолное 	= НовоеПолноеИмя;
	//НовыйКонтрагент.ТипКонтрагента_Клиент = Истина;
	//
	//Попытка
	//	НовыйКонтрагент.Записать();
		//СтруктураData.Вставить("GUID", СокрЛП(НовыйКонтрагент.Ссылка.УникальныйИдентификатор()));
		//СтруктураОтвет.result = 0;
	//Исключение
	//	СтруктураData.Вставить("GUID", "");
	//	СтруктураОтвет.result = -4;
	//КонецПопытки;
		
		СтруктураData.Вставить("GUID", "00000000-0000-0000-0000-000000000000");
		СтруктураОтвет.result = 0;
	СтруктураОтвет.data = СтруктураData;
	
	Возврат СтруктураОтвет;
КонецФункции

// getLocationList 
// Функция для обновления справочника ЖД Станций. Возвращает массив данных.
//Вх - 
//{
//	"request": "getLocationList",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"code": "123",
//			"name": "Название",
//			"zdcode": "11000254",
//			"deletionMark": 0
//		},
//		{
//			"code": "123",
//			"name": "Название",
//			"zdcode": "11000254",
//			"deletionMark": 0
//		}]}
Функция getLocationList(Параметры);
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТипЖДСтанция", Справочники.ТипыЛокаций.СтанцияЖД);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка,
	               |	Локации.Код КАК code,
	               |	Локации.Наименование КАК name,
	               |	Локации.КодЖДСтанции КАК zdcode,
	               |	ВЫБОР
	               |		КОГДА Локации.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Тип = &ТипЖДСтанция";
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("code") И Параметры.code.Количество() Тогда      // TBD выяснить фильтр по СТОК или КОДСТАНЦИИ
		Запрос.Текст = Запрос.Текст + " И Локации.Код В(&Стоки)";  
		Запрос.УстановитьПараметр("Стоки", Параметры.code);
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ЛК);
	СтруктураПоиска.Вставить("Объект", Неопределено);
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	СтруктураДанных.Вставить("УИДИсточника", Неопределено);
		
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.code) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.name) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.zdcode) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("code, name, zdcode, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
		
		// зафиксируем протокол обмена   // TBD переделать на запись списка объектов пачкой?
		СтруктураПоиска.Объект 		 = ВыборкаЗапроса.Ссылка;
		СтруктураДанных.УИДИсточника = ВыборкаЗапроса.Ссылка.УникальныйИдентификатор();
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data = МассивData;
	СтруктураОтвет.result = 0;

	Возврат СтруктураОтвет;//СтруктураОтвет;
КонецФункции

// getStokList 
// Функция для обновления справочника Стоки
//Вх - 
//{
//	"request": "getStokList",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"code": "123",
//			"name": "Название",
//			"address": "143245, Москва",
//			"location": ["123123", "123123"],
//			"deletionMark": 0
//		},
//		{
//			"code": "123",
//			"name": "Название",
//			"address": "143245, Москва",
//			"location": ["123123", "123123"],
//			"deletionMark": 0
//		}]}
Функция getStokList(Параметры);
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТипСток", Справочники.ТипыЛокаций.Сток);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Код КАК code,
	               |	Локации.Наименование КАК name,
	               |	Локации.Адрес КАК address,
	               |	Локации.КодЖДСтанции КАК zdcode,
	               |	ВЫБОР
	               |		КОГДА Локации.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Тип = &ТипСток";
	Если Параметры.Свойство("code") И Параметры.code.Количество() Тогда      // TBD выяснить связь по СТОК или КОДСТАНЦИИ
		Запрос.Текст = Запрос.Текст + " И Локации.Код В(&Стоки)";  
		Запрос.УстановитьПараметр("Стоки", Параметры.code);
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ЛК);
	СтруктураПоиска.Вставить("Объект", Неопределено);
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	СтруктураДанных.Вставить("УИДИсточника", Неопределено);
		
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.code) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.name) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.zdcode) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("code, name, zdcode, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
		// зафиксируем протокол обмена   // TBD переделать на запись списка объектов пачкой?
		СтруктураПоиска.Объект 		 = ВыборкаЗапроса.Ссылка;
		СтруктураДанных.УИДИсточника = ВыборкаЗапроса.Ссылка.УникальныйИдентификатор();
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data = МассивData;
	СтруктураОтвет.result = 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// getStokQuantity 
// Функция для получения количество свободных контейнеров по стокам
//Вх - 
//{
//	"request": "getStokQuantity",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"codeStock": "YT007",
//			"codeISO": "22G1",
//			"quantity": 12
//		},
//		{
//			"codeStock": " YT009",
//			"codeISO": "42G1",
//			"quantity": 24
//		}]}
Функция getStokQuantity(Параметры);
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТипЖДСтанция", Справочники.ТипыЛокаций.Сток);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстатки.Сток.Код КАК codeStock,
	               |	КонтейнерыВСтокахОстатки.Контейнер.ТипТЕ.КодISO КАК codeISO,
	               |	СУММА(КонтейнерыВСтокахОстатки.КоличествоОстаток) КАК quantity
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.Остатки КАК КонтейнерыВСтокахОстатки
	               |    &Условие
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыВСтокахОстатки.Сток.Код,
	               |	КонтейнерыВСтокахОстатки.Контейнер.ТипТЕ.КодISO";
	Если Параметры.Свойство("code") И Параметры.code.Количество() Тогда     
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", " ГДЕ КонтейнерыВСтокахОстатки.Сток.Код В(&Стоки)");  
		Запрос.УстановитьПараметр("Стоки", Параметры.code);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "");  
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.codeStock) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.codeISO) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.quantity) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("codeStock, codeISO, quantity");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data = МассивData;
	СтруктураОтвет.result = 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// getTrip 
// Функция для обновления справочника с данными по зарегистрированным Рейсам. Возвращает массив данных
//Вх - 
//{
//	"request": "getTrip",
//	"data": {
//		"date_from": "2020-09-05T00:00:00",
//		"date_to": "2020-09-21T00:00:00"
//		}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"fromCodeLocation": "КодЖД1",
//			"toCodeLocation": "КодЖД2",
//			"isoCodePrice": {
//				"22G1": 12587,
//				"42G1": 45652
//},
//			"date": "2020-09-05T00:00:00",
//			"free": 12
//		}]}
Функция getTrip(Параметры);
	МассивData = Новый Массив;
	
	Если Параметры.Свойство("date_from") И Параметры.Свойство("date_to") Тогда     
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("date_from", ПолучитьДату(Параметры.date_from));
		Запрос.УстановитьПараметр("date_to", ПолучитьДату(Параметры.date_to));
		Запрос.Текст = "ВЫБРАТЬ
		               |	РейсыЖД.Код КАК codeStock,
					   |	РейсыЖД.Ссылка КАК Ссылка,
		               |	РейсыЖД.ДатаОтправления КАК date,
		               |	РейсыЖД.ПунктОтправления.КодЖДСтанции КАК fromCodeLocation,
		               |	РейсыЖД.ПунктНазначения.КодЖДСтанции КАК toCodeLocation,
		               |	РейсыЖД.КоличествоТЕУ КАК free
		               |ИЗ
		               |	Справочник.РейсыЖД КАК РейсыЖД
		               |ГДЕ
		               |	РейсыЖД.РейсОтменен = ЛОЖЬ
		               |	И РейсыЖД.ПометкаУдаления = ЛОЖЬ
		               |	И РейсыЖД.ДатаОтправления МЕЖДУ &date_from И &date_to";
		           
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ЛК);
		СтруктураПоиска.Вставить("Объект", Неопределено);
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
		СтруктураДанных.Вставить("УИДИсточника", Неопределено);
			
		Пока ВыборкаЗапроса.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.fromCodeLocation) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.toCodeLocation) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.date) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.free) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураData = Новый Структура("fromCodeLocation, toCodeLocation, isoCodePrice, date, free");
			ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
			СтруктураData.isoCodePrice = Новый Структура("22G1, 42G1", 0, 0);  // TBD отыскать ставки по типам конт
			МассивData.Добавить(СтруктураData);
			
			// зафиксируем протокол обмена   // TBD переделать на запись списка объектов пачкой?
			СтруктураПоиска.Объект 		 = ВыборкаЗапроса.Ссылка;
			СтруктураДанных.УИДИсточника = ВыборкаЗапроса.Ссылка.УникальныйИдентификатор();
			РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result = 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// getServiceList  
// Функция для обновления справочника с дополнительными услугами. Возвращает массив данных
//Вх - 
//{
//	"request": "getServiceList",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"code": "123",
//			"name": "Название",
//"fullName": "ПолноеНазвание",
//"deletionMark": 0
//		},
//		{
//			"code": "123",
//			"name": "Название",
//"fullName": "ПолноеНазвание",
//"deletionMark": 0
//		}]}
Функция getServiceList(Параметры);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыОпераций.Ссылка КАК Ссылка,
	               |	ВидыОпераций.Код КАК code,
	               |	ВидыОпераций.Наименование КАК name,
	               |	ВидыОпераций.Наименование КАК fullName,
	               |	ВЫБОР
	               |		КОГДА ВидыОпераций.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark
	               |ИЗ
	               |	Справочник.ВидыОпераций КАК ВидыОпераций
	               |ГДЕ
	               |	ВидыОпераций.ЭтоГруппа = ЛОЖЬ";
	Если Параметры.Свойство("code") И Параметры.code.Количество() Тогда  
		Запрос.Текст = Запрос.Текст + " И ВидыОпераций.Код В(&СписокКодов)";  
		Запрос.УстановитьПараметр("СписокКодов", Параметры.code);
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ЛК);
	СтруктураПоиска.Вставить("Объект", Неопределено);
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	СтруктураДанных.Вставить("УИДИсточника", Неопределено);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.code) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.name) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.fullName) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("code, name, fullName, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
		
		// зафиксируем протокол обмена   // TBD переделать на запись списка объектов пачкой?
		СтруктураПоиска.Объект 		 = ВыборкаЗапроса.Ссылка;
		СтруктураДанных.УИДИсточника = ВыборкаЗапроса.Ссылка.УникальныйИдентификатор();
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// getISOList 
// Функция возвращает полный справочник поддерживаемых ISO типов контейнеров в системе, поддерживает запрос с параметром-фильтром. Возвращает массив данных
//Вх - 
//{
//	"request": "getISOList",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"code": "22G1",
//			"name": "Название",
//			" description ": {
//				"Width": 12587,
//				"High": 12587,
//				"Lng": 45652
//},
//			"deletionMark": 0
//		},
//		{
//			"code": "22G1",
//			"name": "Название",
//			" description ": {
//				"Width": 12587,
//				"High": 12587,
//				"Lng": 45652
//},
//			"deletionMark": 0
//		}]}
Функция getISOList(Параметры);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипоразмерыТЕ.Код КАК Код,
	               |	ТипоразмерыТЕ.Наименование КАК name,
	               |	ТипоразмерыТЕ.КодISO КАК code,
	               |	ВЫБОР
	               |		КОГДА ТипоразмерыТЕ.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark,
	               |	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
	               |	ТипоразмерыТЕ.ТЕУ КАК ТЕУ,
	               |	ТипоразмерыТЕ.Длина КАК Lng,
	               |	ТипоразмерыТЕ.Ширина КАК Width,
	               |	ТипоразмерыТЕ.Высота КАК High
	               |ИЗ
	               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ";
	Если Параметры.Свойство("code") И Параметры.code.Количество() Тогда  
		Запрос.Текст = Запрос.Текст + " ГДЕ ТипоразмерыТЕ.КодISO В(&СписокКодов)";  
		Запрос.УстановитьПараметр("СписокКодов", Параметры.code);
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.code) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.name) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("code, name, description, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		СтруктураData.description = Новый Структура("Width, High, Lng", ВыборкаЗапроса.Width, ВыборкаЗапроса.High, ВыборкаЗапроса.Lng);
		МассивData.Добавить(СтруктураData); 
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// getTypeOfCargo 
// Функция возвращает полный справочник типов грузов
//Вх - 
//{
//	"request": "getTypeOfCargo",
//	"data": {
//		"code": [
//			"code1",
//			"code2",
//			"code3"
//		]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"code": "КодПродукции1",
//			"name": "НаименованиеПродукции1",
//			"deletionMark": 0
//		},{
//			"code": "КодПродукции2",
//			"name": "НаименованиеПродукции2",
//			"deletionMark": 0
//}]}
Функция getTypeOfCargo(Параметры);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Грузы.Ссылка КАК Ссылка,
	               |	Грузы.Наименование КАК name,
	               |	Грузы.ГНГ КАК GNG,
	               |	Грузы.ЕТСНГ КАК ETSNG,
	               |	ВЫБОР
	               |		КОГДА Грузы.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark
	               |ИЗ
	               |	Справочник.Грузы КАК Грузы
	               |ГДЕ
	               |	Грузы.ЭтоГруппа = ЛОЖЬ";
	Если Параметры.Свойство("code") И Параметры.code.Количество() Тогда  
		Запрос.Текст = Запрос.Текст + " И Грузы.Код В(&СписокКодов)";  
		Запрос.УстановитьПараметр("СписокКодов", Параметры.code);
	КонецЕсли;
	
	МассивData = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ЛК);
	СтруктураПоиска.Вставить("Объект", Неопределено);
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	СтруктураДанных.Вставить("УИДИсточника", Неопределено);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.code) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.name) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("code, name, GNG, ETSNG, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		СтруктураData.code = СокрЛП(ВыборкаЗапроса.Ссылка.УникальныйИдентификатор());
		МассивData.Добавить(СтруктураData); 
	
		// зафиксируем протокол обмена   // TBD переделать на запись списка объектов пачкой?
		СтруктураПоиска.Объект 		 = ВыборкаЗапроса.Ссылка;
		СтруктураДанных.УИДИсточника = ВыборкаЗапроса.Ссылка.УникальныйИдентификатор();
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= 0;
	
	Возврат СтруктураОтвет;
КонецФункции

// postRequest 
// Функция для формирования заявки в DataCore
//Вх - 
//{
//	"request": "postRequest",
//	"data": {
//"other_fio": "Фамилия Имя Отчество",
//"other_inn": "603654852125",
//"other_tel": "+79261111111",
//"other_email": "email@gmail.com",
//"from_datetime": "2020-09-05T00:00:00",
//"from_location": "1213124",
//"to_location": "5621452",
//"containers": [
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 0
// 	},
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 1
// 	}],
//"other_longdescription": "",
//"driver_fio": "",
//"passport": "",
//"driver_reg": "",
//"avtodovoz": "",
//"avtodovoz_location": "",
//"avtodovoz_date": "",
//"avtovivoz": "",
//"avtovivoz_location": "",
//"avtovivoz_date": ""
//}}
//Исх - 
//{
//	"result": 0,
//	"data": {
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"version": "72fgew324rfq23rf1f33",
//			"DocumentId": "YT00015",
//			"OrderStatus": 2,
//			"OrderРrice": 6452387
//}}
Функция postRequest(Параметры);

	СтруктураData = Новый Структура("GUID, version, DocumentId, OrderStatus, OrderРrice", "00000000-0000-0000-0000-000000000000", "00000000000000000000", "0", 2, 0);
	
	СтруктураОтвет = новый Структура("result, data");
	
	ЗапросСсылка = СоздатьЗапросКлиента(Параметры);
	Если НЕ ЗапросСсылка = Документы.Запрос.ПустаяСсылка() Тогда

		СтруктураData.GUID = СокрЛП(ЗапросСсылка.УникальныйИдентификатор());
		
		СтруктураData.DocumentId = ЗапросСсылка.Номер;
		//СтруктураData.OrderStatus = 2;
		//СтруктураData.OrderРrice = 0;   // TBD как найти Рассчитанная стоимость заявки (счет оферта), руб.

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДокЗапрос.Ссылка КАК Ссылка,
		               |	ДокЗапрос.ВерсияДанных КАК version
		               |ИЗ
		               |	Документ.Запрос КАК ДокЗапрос
		               |ГДЕ
		               |	ДокЗапрос.Ссылка = &Ссыль";
		Запрос.УстановитьПараметр("Ссыль", ЗапросСсылка);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		ВыборкаЗапроса.Следующий();
		СтруктураData.version = ВыборкаЗапроса.version;
		
		СтруктураОтвет.result 	= 0;
	Иначе
		СтруктураОтвет.result 	= -1;
	КонецЕсли;
	
	СтруктураОтвет.data 	= СтруктураData;
	
	Возврат СтруктураОтвет;
КонецФункции

// getRequest 
// Функция получения данных по заявке в DataCore
//Вх - 
//{
//	"request": "getRequest",
//	"data": {
//		"GUID": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"
//]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//		"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"version": "72fgew324rfq23rf1f33",
//"other_fio": "Фамилия Имя Отчество",
//"other_inn": "603654852125",
//"other_tel": "+79261111111",
//"other_email": "email@gmail.com",
//"from_datetime": "2020-09-05T00:00:00",
//"from_location": "1213124",
//"to_location": "5621452",
//"containers": [
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 0
// 	},
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 1
// 	}],
//"other_longdescription": "",
//"driver_fio": "",
//"passport": "",
//"driver_reg": "",
//"avtodovoz": "",
//"avtodovoz_location": "",
//"avtodovoz_date": "",
//"avtovivoz": "",
//"avtovivoz_location": "",
//"avtovivoz_date": ""
//"OrderStatus": 2, 
//"servicesRequired": {
//	"YT0012": 12345,
//"YT0013": 87643
//},
//"servicesAll": {
//	"YT0014": 12345,
//"YT0015": 87643
//},
//"servicesActive": {
//	"YT0014": 12345,
//"YT0015": 87643
//},
//"managerComment": "Доставим в срок!"
//		}]}
Функция getRequest(Параметры);
	МассивData = Новый Массив;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -13);
	
	Возврат СтруктураОтвет;
КонецФункции

// updateRequest 
// Функция получения данных по заявке в DataCore
//Вх - 
//{
//	"request": "updateRequest",    ????????????????????????????????????????????????????????
//	"data": {
//		"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"version": "72fgew324rfq23rf1f33",
//		"avtodovoz": "",
//		"avtodovoz_location": "",
//		"avtodovoz_date": "",
//		"avtovivoz": "",
//		"avtovivoz_location": "",
//		"avtovivoz_date": "",
//		"OrderStatus": 4,
//		"servicesActive": ["код1", "код2", "код3"]
//}}
//Исх - 
//{
//	"result": 0,
//	"data": {
//		"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"version": "72fgew324rfq23rf1f33",
//"other_fio": "Фамилия Имя Отчество",
//"other_inn": "603654852125",
//"other_tel": "+79261111111",
//"other_email": "email@gmail.com",
//"from_datetime": "2020-09-05T00:00:00",
//"from_location": "1213124",
//"to_location": "5621452",
//"containers": [
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 0
// 	},
//{
// 	"typeISO": "22G1",
// 	"count": 2,
// 	"gruzlist":["1234", "5312", "531"],
// 	"cnt_eurosibowner": 1
// 	}],
//"other_longdescription": "",
//"driver_fio": "",
//"passport": "",
//"driver_reg": "",
//"avtodovoz": "",
//"avtodovoz_location": "",
//"avtodovoz_date": "",
//"avtovivoz": "",
//"avtovivoz_location": "",
//"avtovivoz_date": ""
//"OrderStatus": 2, 
//"servicesRequired": {
//	"YT0012": 12345,
//"YT0013": 87643
//},
//"servicesAll": {
//	"YT0014": 12345,
//"YT0015": 87643
//},
//"servicesActive": {
//	"YT0014": 12345,
//"YT0015": 87643
//},
//"managerComment": "Доставим в срок!"
//		}}
Функция updateRequest(Параметры);
	МассивData = Новый Массив;
	
	//Контрагент",			РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтраницаДоговора.PartyID, 
	//											Перечисления.ДействияПриОбмене.ЗагрузкаДанных,
	//											Перечисления.УзлыОбмена.ЛК, Тип("СправочникСсылка.Контрагенты")));	
												
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -14);
	
	Возврат СтруктураОтвет;
КонецФункции

// getInvoce 
// Функция для получения счетов
//Вх - 
//{
//	"request": "getInvoce",  ???????????????????????????????????????????????????????????????
//	"data": {
//		"GUID": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"
//],
//		" GUIDinvoce ": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"GUIDinvoce": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"number": "YT000123",
//			"date": "2020-09-05T00:00:00",
//			"dateOfPayment": "2020-09-09T00:00:00",
//			"paid": 0,
//			"sum": "123521",
//			"document": "//123.jpeg",
//			"closingDocuments": "",
//			"deletionMark": 0
//		}]}
Функция getInvoce(Параметры);
	Запрос = Новый Запрос();
	//Евросиб Каблов 04.08.2025 ( #115153
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДокументСчет.Ссылка КАК Ссылка,
	//               |	МИНИМУМ(ЕСТЬNULL(РеализацияТоваровУслуг.Оплачен, 0)) КАК Оплачен
	//               |ПОМЕСТИТЬ ВТ_Счета
	//               |ИЗ
	//               |	Документ.СчетНаОплатуПокупателю КАК ДокументСчет
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//			   |		ПО ДокументСчет.Ссылка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументСчет.Ссылка КАК Ссылка,
	               |	МИНИМУМ(ЕСТЬNULL(РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Оплачен, 0)) КАК Оплачен
	               |ПОМЕСТИТЬ ВТ_Счета
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК ДокументСчет
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	               |		ПО ДокументСчет.Ссылка = РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю";
				   //Евросиб Каблов 04.08.2025 )
	Запрос.Текст = Запрос.Текст + " 
	               |ГДЕ
	               |	ИСТИНА";
	Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
		Запрос.Текст = Запрос.Текст + " 
	               | И СчетНаОплатуПокупателю.UID В(&UID)";  
		Запрос.УстановитьПараметр("UID", Параметры.GUID);
	ИначеЕсли Параметры.Свойство("User") И ЗначениеЗаполнено(Параметры.User)
		И Параметры.Свойство("dateFrom") И ЗначениеЗаполнено(Параметры.dateFrom)
		И Параметры.Свойство("dateTo") И ЗначениеЗаполнено(Параметры.dateTo)
		Тогда
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.User)));
		Запрос.УстановитьПараметр("ДатаНачала", ПолучитьДату(Параметры.dateFrom));
		Запрос.УстановитьПараметр("ДатаОкончания", ПолучитьДату(Параметры.dateTo));
		Запрос.Текст = Запрос.Текст + "
		//Евросиб Каблов 04.08.2025 ( #115153
				   //| И (СчетНаОплатуПокупателю.Контрагент = &Контрагент
				   //| И СчетНаОплатуПокупателю.Дата >= &ДатаНачала
				   //| И СчетНаОплатуПокупателю.Дата <= &ДатаОкончания)";
				   | И (ДокументСчет.Контрагент = &Контрагент
	               | И ДокументСчет.Дата >= &ДатаНачала
	               | И ДокументСчет.Дата <= &ДатаОкончания)";
		//Евросиб Каблов 04.08.2025 )
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + "
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.UID КАК GUID,
	               |	СделкаЗаявки.Заявка.UID КАК GUIDInvoce,
				   |	СчетНаОплатуПокупателю.Номер КАК number,
	               |	СчетНаОплатуПокупателю.Дата КАК date,
	               |	СчетНаОплатуПокупателю.СуммаДокумента КАК Sum,
	               |	""TBD найти пути к файлам"" КАК document,                         
	               |	""TBD найти пути к файлам"" КАК closingDocuments,
				   |	СчетНаОплатуПокупателю.ДатаОплаты КАК dateOfPayment,
				   |	ВТ_Счета.Оплачен как Paid,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ПометкаУдаления
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК deletionMark
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Счета КАК ВТ_Счета
				   |		ПО СчетНаОплатуПокупателю.Ссылка = ВТ_Счета.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
	               |		ПО СчетНаОплатуПокупателю.УдалитьСделка = СделкаЗаявки.Ссылка
	               |			И СчетНаОплатуПокупателю.ДоговорКонтрагента = СделкаЗаявки.Заявка.Договор";
	Если Параметры.Свойство("GIUDInvoce") И Параметры.GIUDInvoce.Количество() Тогда     
		Запрос.Текст = Запрос.Текст + " И СделкаЗаявки.Заявка.UID В(&GIUDInvoce)";  
		Запрос.УстановитьПараметр("GIUDInvoce", Параметры.GIUDInvoce);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " 
	               |ГДЕ
	               |	ИСТИНА";
	Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
		Запрос.Текст = Запрос.Текст + " И СчетНаОплатуПокупателю.UID В(&UID)";  
		Запрос.УстановитьПараметр("UID", Параметры.GUID);
	КонецЕсли;

	МассивData = Новый Массив;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUID) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUIDInvoce) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.number)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.dateOfPayment)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.sum)
			Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("GUID, GUIDInvoce, number, date, dateOfPayment, paid, sum, document, closingDocuments, deletionMark");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
	КонецЦикла;
	

	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= 0;
	//СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -15);
	
	Возврат СтруктураОтвет;
КонецФункции

// updateInvoce 
// Функция для обновления  счетов
//Вх - 
//{
//	"request": "updateInvoce",
//	"data": {
//		"GUIDinvoce":"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"status":4,
//		"paymentOrder":"//123.jpeg"}
//Исх - 
//{
//	"result": 0,
//	"data": ""}
Функция updateInvoce(Параметры);
	СтруктураОтвет = новый Структура("result, data");
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументСчет.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК ДокументСчет
	               |ГДЕ
	               |	ДокументСчет.Номер В(&GUIDinvoce)";  
	Запрос.УстановитьПараметр("UID", Параметры.GUID);

	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗапроса.Следующий() Тогда
		//ДокЗ = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		//ДокЗ = Документы.Запрос.СоздатьДокумент();
		//ДокЗ.
		
		// TBD - статусы документов в ЛК регить в отдельном регистре
		
		СтруктураОтвет.result 	= 0;
	Иначе
		СтруктураОтвет.result 	= -1;
	КонецЕсли;
	

	СтруктураОтвет.data 	= "";
	
	Возврат СтруктураОтвет;
КонецФункции

// getRailwayInvoice 
// Функция для получения железнодорожных накладных по списку заявок (Возвращается только рас кредитованная железнодорожная накладная)
//Вх - 
//{
//	"request": "getRailwayInvoice",
//	"data": {
//		"user":"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"dateFrom":"2020-09-05T00:00:00",
//		"dateTo":"2020-09-05T00:00:00",
//		"GUID": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"
//],
//"GUIDreilwayInvoce": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"GUIDreilwayInvoce": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"number": "YT000123",
//			"date": "2020-09-05T00:00:00",
//			"containerNumber": "AAAA 000000 0 40 HC",
//			"containerType": "22G1",
//			"containerWeight": 20,
//			"gruzlist": ["234", "4232"],
//			"document": "//123.jpeg",
//			"deletionMark": 0
//		}]}
Функция getRailwayInvoice(Параметры);
	
	// TBD Сделать по факту реализации task 26465

	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДокументСчет.Ссылка КАК Ссылка,
	//               |	МИНИМУМ(ЕСТЬNULL(РеализацияТоваровУслуг.Оплачен, 0)) КАК Оплачен
	//               |ПОМЕСТИТЬ ВТ_Счета
	//               |ИЗ
	//               |	Документ.СчетНаОплатуПокупателю КАК ДокументСчет
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//               |		ПО ДокументСчет.Ссылка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю";
	//Запрос.Текст = Запрос.Текст + " 
	//               |ГДЕ
	//               |	ИСТИНА";
	//Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
	//	Запрос.Текст = Запрос.Текст + " 
	//               | И СчетНаОплатуПокупателю.UID В(&UID)";  
	//	Запрос.УстановитьПараметр("UID", Параметры.GUID);
	//КонецЕсли;
	//
	//Если Параметры.Свойство("User") И ЗначениеЗаполнено(Параметры.User)
	//	И Параметры.Свойство("dateFrom") И ЗначениеЗаполнено(Параметры.dateFrom)
	//	И Параметры.Свойство("dateTo") И ЗначениеЗаполнено(Параметры.dateTo)
	//	Тогда
	//	Запрос.УстановитьПараметр("Контрагент", 	Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.User)));
	//	Запрос.УстановитьПараметр("ДатаНачала", 	ПолучитьДату(Параметры.dateFrom));
	//	Запрос.УстановитьПараметр("ДатаОкончания", 	ПолучитьДату(Параметры.dateTo));
	//	Запрос.Текст = Запрос.Текст + " 
	//               | И (СчетНаОплатуПокупателю.Контрагент = &Контрагент
	//               | И СчетНаОплатуПокупателю.Дата >= &ДатаНачала  
	//               | И СчетНаОплатуПокупателю.Дата <= &ДатаОкончания)";  
	//КонецЕсли;

	//Запрос.Текст = Запрос.Текст + "
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ДокументСчет.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	СчетНаОплатуПокупателю.UID КАК GUID,
	//               |	СделкаЗаявки.Заявка.UID КАК GUIDreilwayInvoce,
	//			   |	СчетНаОплатуПокупателю.Номер КАК number,
	//               |	СчетНаОплатуПокупателю.Дата КАК date,
	//               |	СчетНаОплатуПокупателю.СуммаДокумента КАК Sum,
	//               |	""TBD найти пути к файлам"" КАК containerNumber,                         
	//               |	""TBD найти пути к файлам"" КАК containerType,
	//               |	""TBD найти пути к файлам"" КАК containerWeight,
	//               |	""TBD найти пути к файлам"" КАК gruzlist,
	//               |	""TBD найти пути к файлам"" КАК document,
	//               |	ВЫБОР
	//               |		КОГДА СчетНаОплатуПокупателю.ПометкаУдаления
	//               |			ТОГДА 1
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК deletionMark

	//               |ИЗ
	//               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Счета КАК ВТ_Счета
	//			   |		ПО СчетНаОплатуПокупателю.Ссылка = ВТ_Счета.Ссылка
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
	//               |		ПО СчетНаОплатуПокупателю.Сделка = СделкаЗаявки.Ссылка
	//               |			И СчетНаОплатуПокупателю.ДоговорКонтрагента = СделкаЗаявки.Заявка.Договор";
	//Если Параметры.Свойство("GIUDInvoce") И Параметры.GIUDInvoce.Количество() Тогда     
	//	Запрос.Текст = Запрос.Текст + " И СделкаЗаявки.Заявка.UID В(&GIUDInvoce)";  
	//	Запрос.УстановитьПараметр("GIUDInvoce", Параметры.GIUDInvoce);
	//КонецЕсли;
	//
	//Запрос.Текст = Запрос.Текст + " 
	//               |ГДЕ
	//               |	ИСТИНА";
	//Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
	//	Запрос.Текст = Запрос.Текст + " И СчетНаОплатуПокупателю.UID В(&UID)";  
	//	Запрос.УстановитьПараметр("UID", Параметры.GUID);
	//КонецЕсли;

	МассивData = Новый Массив;
	//
	//ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаЗапроса.Следующий() Цикл
	//	Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUID) 
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUIDreilwayInvoce) 
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.number)
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.dateOfPayment)
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.sum)
	//		Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	СтруктураData = Новый Структура("GUID, GUIDreilwayInvoce, number, date, containerNumber, containerType, containerWeight, gruzlist, document, deletionMark");
	//	ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
	//	МассивData.Добавить(СтруктураData);
	//КонецЦикла;
	//

	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result = 0;
	////СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -16);
	//
	Возврат СтруктураОтвет;
КонецФункции

// getDislocation 
// Функция для получения информации по дислокации контейнеров по заявкам
//Вх - 
//{
//	"request": "getDislocation",
//	"data": {
//		"user":"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"dateFrom":"2020-09-05T00:00:00",
//		"dateTo":"2020-09-05T00:00:00",
//		"GUID": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"
//]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"containerNumber": "AAAA 000000 0 40 HC",
//			"dateLoading": "2020-09-05T00:00:00",
//			"remainingWay": 1345,
//			"stationOperation": "234",
//			"dateApproximate": "2020-09-05T00:00:00"
//		}]}
Функция getDislocation(Параметры);
	
	// убрано из ТЗ
	
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДокументЗаявка.Ссылка КАК Ссылка
	//               |ПОМЕСТИТЬ ВТ_Заявки
	//               |ИЗ
	//               |	Документ.Заявка КАК ДокументЗаявка";
	//Запрос.Текст = Запрос.Текст + " 
	//               |ГДЕ
	//               |	ИСТИНА";
	//Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
	//	Запрос.Текст = Запрос.Текст + " 
	//               | И ДокументЗаявка.UID В (&UID)";  
	//	Запрос.УстановитьПараметр("UID", Параметры.GUID);
	//КонецЕсли;
	//
	//Если Параметры.Свойство("User") И ЗначениеЗаполнено(Параметры.User)
	//	И Параметры.Свойство("dateFrom") И ЗначениеЗаполнено(Параметры.dateFrom)
	//	И Параметры.Свойство("dateTo") И ЗначениеЗаполнено(Параметры.dateTo)
	//	Тогда
	//	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.User)));
	//	Запрос.УстановитьПараметр("ДатаНачала", ПолучитьДату(Параметры.dateFrom));
	//	Запрос.УстановитьПараметр("ДатаОкончания", ПолучитьДату(Параметры.dateTo));
	//	Запрос.Текст = Запрос.Текст + " 
	//               | ИЛИ (ДокументЗаявка.Контрагент = &Контрагент
	//               | И ДокументЗаявка.Дата >= &ДатаНачала
	//               | И ДокументЗаявка.Дата <= &ДатаОкончания)";
	//КонецЕсли;

	//Запрос.Текст = Запрос.Текст + "
	//               |
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Заявка.UID КАК GUID,
	//			   |	Заявка.НомерКТК КАК containerNumber,
	//               |	""TBD найти пути к файлам"" КАК dateLoading,
	//               |	""TBD найти пути к файлам"" КАК remainingWay,
	//               |	""TBD найти пути к файлам"" КАК dateApproximate,
	//               |	""TBD найти пути к файлам"" КАК stationOperation
	//               |ИЗ
	//               |	Документ.Заявка.СоставУслуги КАК Заявка
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	//			   |		ПО Заявка.Ссылка = ВТ_Заявки.Ссылка";
	//// TBD Выяснить о dateApproximate
	
	МассивData = Новый Массив;
	
	//ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаЗапроса.Следующий() Цикл
	//	Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUID) 
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.containerNumber) 
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.dateLoading)
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.remainingWay)
	//		ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.stationOperation)
	//		Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	СтруктураData = Новый Структура("GUID, containerNumber, dateLoading, remainingWay, stationOperation, dateApproximate");
	//	ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
	//	МассивData.Добавить(СтруктураData);
	//КонецЦикла;
	

	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result = 0;
	//СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -17);
	
	Возврат СтруктураОтвет;
КонецФункции

// getReliz 
// Функция для получения информации по релизам для списка заявок
//Вх - 
//{
//	"request": "getRequest",
//	"data": {
//		"user":"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//		"dateFrom":"2020-09-05T00:00:00",
//		"dateTo":"2020-09-05T00:00:00",
//		"GUID": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"],
//"GUIDreliz": [
//"3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f4",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f6",
//"3e0c5cd8-e1aa-405a-b693-383153cf78f7"]}}
//Исх - 
//{
//	"result": 0,
//	"data": [{
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"GUIDreliz": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"containerNumber": "AAAA 000000 0 40 HC",
//			"containerType": "22G1",
//			"gettingStok": "1345",
//			"gettingStokName": "ЕВРОСИБ",
//			"gettingDate": "01 – 05.03.2021",
//			"gettingFIO": "Сидоро Петр Петрович",
//			"gettingPassport": "4611 078871",
//			"gettingAvto": "EK001X77",
//			"returnStok": "1345",
//			"returnStokName": "ЕВРОСИБ",
//			"returnDate": "21 – 25.03.2021"
//		}]}
Функция getReliz(Параметры);
	
	// TBD Выяснить про РЕЛИЗЫ
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументЗаявка.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Счета
	               |ИЗ
	               |	Документ.Заявка КАК ДокументЗаявка";
	Запрос.Текст = Запрос.Текст + " 
	               |ГДЕ
	               |	ИСТИНА";
	Если Параметры.Свойство("GIUD") И Параметры.GUID.Количество() Тогда     
		Запрос.Текст = Запрос.Текст + " 
	               | И ДокументЗаявка.UID В(&UID)";  
		Запрос.УстановитьПараметр("UID", Параметры.GUID);
	КонецЕсли;
	
	Если Параметры.Свойство("User") И ЗначениеЗаполнено(Параметры.User)
		И Параметры.Свойство("dateFrom") И ЗначениеЗаполнено(Параметры.dateFrom)
		И Параметры.Свойство("dateTo") И ЗначениеЗаполнено(Параметры.dateTo)
		Тогда
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.User)));
		Запрос.УстановитьПараметр("ДатаНачала", ПолучитьДату(Параметры.dateFrom));
		Запрос.УстановитьПараметр("ДатаОкончания", ПолучитьДату(Параметры.dateTo));
		Запрос.Текст = Запрос.Текст + " 
	               | ИЛИ (ДокументЗаявка.Контрагент = &Контрагент
	               | И ДокументЗаявка.Дата >= &ДатаНачала
	               | И ДокументЗаявка.Дата <= &ДатаОкончания)";
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + "
	               |
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Заявка.Ссылка.UID КАК GUID,
	               |	""TBD найти пути к файлам"" КАК GUIDreliz,
				   |	Заявка.НомерКТК.Наименование КАК containerNumber,
				   |	Заявка.НомерКТК.ТипТЕ.Наименование КАК containerType,
	               |	""TBD найти пути к файлам"" КАК gettingStok,                         
	               |	""TBD найти пути к файлам"" КАК gettingDate,                         
	               |	Заявка.ФИОВодителя КАК gettingFIO,                         
	               |	""TBD найти пути к файлам"" КАК gettingPassport,                         
	               |	Заявка.НомерАвто КАК gettingAvto,                         
	               |	""TBD найти пути к файлам"" КАК returnStok,                         
	               |	""TBD найти пути к файлам"" КАК returnDate                         
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК Заявка
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Счета КАК ВТ_Счета
				   |		ПО Заявка.Ссылка = ВТ_Счета.Ссылка";

	МассивData = Новый Массив;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUID) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUIDreliz) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.containerNumber)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.containerType)
			Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("GUID, GUIDreliz, containerNumber, containerType, gettingStok, gettingDate, gettingFIO, gettingPassport, gettingAvto, returnStok, returnDate");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		МассивData.Добавить(СтруктураData);
	КонецЦикла;

	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result = 0;
	//СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -18);
	
	Возврат СтруктураОтвет;
КонецФункции

// updateReliz 
// Функция для обновления информации по релизу
//Вх - 
//{
//	"request": "updateReliz",
//	"data": {
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"containerNumber": "AAAA 000000 0 40 HC",
//			"gettingFIO": "Сидоро Петр Петрович",
//			"gettingPassport": "4611 078871",
//			"gettingAvto": "EK001X77",
//}}
//Исх - 
//{
//	"result": 0,
//	"data": {
//			"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//			"containerNumber": "AAAA 000000 0 40 HC",
//			"containerType": "22G1",
//			"gettingStok": "1345",
//			"gettingStokName": "ЕВРОСИБ",
//			"gettingDate": "01 – 05.03.2021",
//			"gettingFIO": "Сидоро Петр Петрович",
//			"gettingPassport": "4611 078871",
//			"gettingAvto": "EK001X77",
//			"returnStok": "1345",
//			"returnStokName": "ЕВРОСИБ",
//			"returnDate": "21 – 25.03.2021"
//		}}
Функция updateReliz(Параметры);
	МассивData = Новый Массив;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data 	= МассивData;
	СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -19);
	
	Возврат СтруктураОтвет;
КонецФункции

// getEventsList 
// Функция для получения списка новых событий
//Вх - 
//{
//	"request": "getEventsList",
//	"data": {
//		"user":"3e0c5cd8-e1aa-405a-b693-383153cf78f2"}}
//Исх - 
//{
//	"request": "getEventsList",
//	"data": [{
//			"User": "450c5cd8-e1aa-405a-b693-383153cf78f2",
//"GUID": "3e0c5cd8-e1aa-405a-b693-383153cf78f2",
//"type": 5,
//"Date": "2020-09-05T00:00:00",
//"Description": "" 
//		}]}
Функция getEventsList(Параметры);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументЗаявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка КАК ДокументЗаявка";
	Запрос.Текст = Запрос.Текст + " 
	               |ГДЕ
	               |	ДокументЗаявка.ПометкаУдаления = ЛОЖЬ";
	Если Параметры.Свойство("User") И ЗначениеЗаполнено(Параметры.User) Тогда     
		Запрос.Текст = Запрос.Текст + " 
	               | И ДокументЗаявка.Контрагент = &Контрагент";  
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.User)));
	КонецЕсли;
// 1	Смена статуса заявки "Получена". Заявка подана получателем, попала в DataCore, но ещё не подтверждена менеджером.
// 2	смена статуса заявки "Подтверждена". Заявка подана пользователем и подтверждена менеджеров
// 3	смена статуса заявки "Отклонена"
// 4	выставлен счёт
// 5	напоминание об оплате счёта (тут надо будет придумать регулярность и счётчик)
// 6	просрочка оплаты
// 7	выдача релиза
// 8	назначение контейнера в поезд
// 9	отправление поезда ("Контейнеры №№ отправлены (дата отправления)")
// 10	прибытие поезда
// 11	контейнеры готовы к выдаче
// 12	загрузка закрывающих документов (АВР и т.д.)
// 13	смена статуса заявки
// 14	выставление счёта
// 15	напоминание об оплате счёта (тут надо будет придумать регулярность и счётчик)
// 16	просрочка оплаты
// 17	выдача релиза
// 18	назначение контейнера в поезд
// 19	отправление поезда ("Контейнеры №№ отправлены (дата отправления)")
// 20	прибытие поезда

// TBD сопоставить наши статусы с новоявленными. А точнее, убрать новоявленные и пользовать только наши

	МассивData = Новый Массив;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.GUID) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.User) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.type)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗапроса.Date)
			Тогда
			Продолжить;
		КонецЕсли;
		СтруктураData = Новый Структура("User, GUID, type, Date, description");
		ЗаполнитьЗначенияСвойств(СтруктураData, ВыборкаЗапроса);
		СтруктураData.User = Параметры.User;
		МассивData.Добавить(СтруктураData);
	КонецЦикла;
	
	СтруктураОтвет = новый Структура("result, data");
	СтруктураОтвет.data   = МассивData;
	СтруктураОтвет.result = 0;
	//СтруктураОтвет.result 	= ?(МассивData.Количество() > 0, 0, -20);
	
	Возврат СтруктураОтвет;
КонецФункции

