#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, ГУИДСтроки, ГУИД_СтрокиРелизКлиента, Контейнер, РелизКлиента, Отказ,
	// ++ ДИТ_Агафонов_task 56709 14.09.2022
	БылУстановленКТКизРелизаКлиента = Ложь
	// -- ДИТ_Агафонов_task 56709 14.09.2022
	) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.РелизСобственника.Установить(РелизСобственника);
	Набор.Отбор.ГУИДСтроки.Установить(ГУИДСтроки);
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.РелизСобственника 	= РелизСобственника;
	НоваяЗапись.ГУИДСтроки 			= ГУИДСтроки;
 	НоваяЗапись.ГУИД_СтрокиРелизКлиента	= ГУИД_СтрокиРелизКлиента;
 	НоваяЗапись.Контейнер 			= Контейнер;
    НоваяЗапись.РелизКлиента 		= РелизКлиента;
	// ++ ДИТ_Агафонов_task 56709 14.09.2022
	НоваяЗапись.БылУстановленКТКизРелизаКлиента	= БылУстановленКТКизРелизаКлиента;
	// -- ДИТ_Агафонов_task 56709 14.09.2022
	Набор.Записать();
	
КонецПроцедуры

// ++ ДИТ_Агафонов_task 53731 20.07.2022
Процедура УдалитьЗапись(РелизСобственника, ГУИДСтроки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.СвязьРелизов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РелизСобственника = РелизСобственника;
	МенеджерЗаписи.ГУИДСтроки = ГУИДСтроки;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;	

КонецПроцедуры
// -- ДИТ_Агафонов_task 53731 20.07.2022

#КонецОбласти

#КонецЕсли
