
#Область ПеренесеноИзМодуля_УдалениеКТКИзСделки_Сервер
Процедура ПостановкаЗадачиВСлучаеИсключенияКТКИзСделкиПриНаличииРТУ_Сделка(ЭтотОбъект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда Возврат; КонецЕсли;
	
	ЕстьХотьОднаУдаленнаяСтрока = Ложь;
	МассивОставшихсяКТК = Новый Массив;
	
	Для каждого Стр из ЭтотОбъект.СвязьУчетныхЕдиниц Цикл
		
		//Евросиб - АСуслов 24.05.2022 12:51:31 #
		//(
		//синхронизация с хранилищем, взял с рабочей
		Если Стр.Удалена = Ложь Тогда 
		//)
		//Евросиб - АСуслов 24.05.2022 12:51:37 #
			МассивОставшихсяКТК.Добавить(Стр.Контейнер);
		Иначе
			ЕстьХотьОднаУдаленнаяСтрока = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьХотьОднаУдаленнаяСтрока Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КлючевыеСобытияСделки.КТК КАК КТК,
	               |	КлючевыеСобытияСделки.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	               |ГДЕ
	               |	КлючевыеСобытияСделки.Сделка = &Сделка
	               |	И ТИПЗНАЧЕНИЯ(КлючевыеСобытияСделки.Документ) = ТИП(Документ.РеализацияТоваровУслуг)
	               |	И НЕ КлючевыеСобытияСделки.КТК В (&КТК)";
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("КТК", МассивОставшихсяКТК);
	МассивУдаленныхКТК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КТК");
	
	Если МассивУдаленныхКТК.Количество() > 0 Тогда
		
		ИскСост = Справочники.Состояния.ТребуетсяИсключитьКонтейнерыИзРТУ;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.ПримечаниеЗадачаИсполнителю = Истина;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;              
		//Евросиб - АСуслов 17.01.2022 18:02:03 #45645
		//(
		СтрокаСписокКТК = СтрСоединить(МассивУдаленныхКТК, ", ");
		НСтр.Комментарий = "Исключить удаленные контейнеры из РТУ: " + СтрокаСписокКТК;
		ТекстСообщения = СтрШаблон("По сделке %1 необходимо исключить удаленные контейнеры из РТУ: %2",
									ЭтотОбъект,
									СтрокаСписокКТК);
		Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
		//)
		//Евросиб - АСуслов 17.01.2022 18:02:03 #45645
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПостановкаЗадачиПриИзмененииКоличестваВыставляемыхКТК_Заявка(ЭтотОбъект) Экспорт
	
	//ДИТ Шевченко А.В. TASK 53486 23.08.2022 -начало
	//Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И (ЭтотОбъект.Ссылка.СоставУслуги.Количество() < ЭтотОбъект.СоставУслуги.Количество() ИЛИ СоставКонтейнеровРазличается(ЭтотОбъект.Ссылка.СоставУслуги.ВыгрузитьКолонку("НомерКТК"), ЭтотОбъект.СоставУслуги.ВыгрузитьКолонку("НомерКТК"))) И ПоЭтойЗаявкеЕстьСделка(ЭтотОбъект.Ссылка) Тогда
	//	
	//	ИскСост = Справочники.Состояния.ОбновитьСоставПоездаСвязанныхСделок;
	//	
	//	НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
	//	
	//	Если НайдСтр <> неопределено Тогда
	//		НСтр = НайдСтр;
	//	Иначе
	//		НСтр = ЭтотОбъект.Состояния.Добавить();
	//	КонецЕсли;
	//	
	//	НСтр.Состояние = ИскСост;
	//	НСтр.Исполнитель = ЭтотОбъект.Автор;
	//	НСтр.Наблюдатель = НСтр.Исполнитель;
	//	НСтр.ПримечаниеЗадачаИсполнителю = Истина;
	//	НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	//	НСтр.Комментарий = "Требуется перезаполнить состав поезда по сделкам: " + СписокСделокПоЗаявке(ЭтотОбъект.Ссылка);
	//	Сообщить(НСтр.Комментарий, СтатусСообщения.ОченьВажное);
	//	
	//КонецЕсли;
	//ДИТ Шевченко А.В. TASK 53486 23.08.2022 -конец
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ЭтотОбъект.Ссылка.СоставУслуги.Количество() < ЭтотОбъект.СоставУслуги.Количество() И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
		
		ИскСост = Справочники.Состояния.НеобходимоВыставитьДопСчет;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
		Сообщить("На эту заявку оформлен авансовый счет. При увеличении количества КТК необходимо довыставить счет клиенту!", СтатусСообщения.ОченьВажное);
		
	//ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ЭтотОбъект.Ссылка.СоставУслуги.Количество() > ЭтотОбъект.СоставУслуги.Количество() И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ИзменениеКоличестваАктивныхСтрок(ЭтотОбъект) < 0 И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
		
		ИскСост = Справочники.Состояния.НеобходимоСогласоватьПереносАванса;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
		Сообщить("На эту заявку оформлен авансовый счет. При уменьшении количества КТК необходимо согласовать перенос аванса или выставить другой счет!", СтатусСообщения.ОченьВажное);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоставКонтейнеровРазличается(СписокКТК1, СписокКТК2)
	
	Результат = Ложь;
	
	Для каждого Стр из СписокКТК1 Цикл
		Если СписокКТК2.Найти(Стр) = неопределено Тогда Результат = Истина; КонецЕсли;
	КонецЦикла;
	Если Результат = Ложь Тогда
		Для каждого Стр из СписокКТК2 Цикл
			Если СписокКТК1.Найти(Стр) = неопределено Тогда Результат = Истина; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоЭтойЗаявкеЕстьСделка(Заявка) Экспорт  //ДИТ Шевченко А.В. TASK 53486 23.08.2022 //доб. экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ПО ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю = СчетНаОплатуПокупателю.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.ДокументыОснования.Документ = &Заявка
	               |	И СчетНаОплатуПокупателю.ПометкаУдаления = ЛОЖЬ
	               |	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюДокументыОснования.Ссылка
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	               |		ПО СчетНаОплатуПокупателюДокументыОснования.Ссылка = ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю
	               |ГДЕ
	               |	СчетНаОплатуПокупателюДокументыОснования.Документ = &Заявка
	               |	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СписокСделокПоЗаявке(Заявка) Экспорт //ДИТ Шевченко А.В. TASK 53486 23.08.2022 //доб. экспорт
	
	//ДИТ Шевченко А.В. TASK 53486 23.08.2022
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Ссылка КАК Ссылка
	               |ИЗ
	               |	Т1 КАК Т1";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция СписокСделокПоЗаявкеИГуид(Заявка,ГУИДСтрокиЗаявки) Экспорт //ДИТ Шевченко А.В. TASK 53486 23.08.2022 //доб. экспорт
	
	//ДИТ Шевченко А.В. TASK 53486 23.08.2022
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = &ГУИДСтрокиЗаявки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Ссылка КАК Ссылка
	               |ИЗ
	               |	Т1 КАК Т1";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ГУИДСтрокиЗаявки", ГУИДСтрокиЗаявки);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПеренестиКТКВДругуюЗаявку(СписокКТК, ПредыдущаяЗаявка, НоваяЗаявка) Экспорт
	
	НЗ = неопределено;
	
	Если НоваяЗаявка = Истина Тогда
		НЗ = ПредыдущаяЗаявка.Скопировать();
		НЗ.СоставУслуги.Очистить();
		НЗ.Маршрутизировать = Истина;
		НЗ.НаМоментЗаписиБылаЗадолженность = Ложь;
		НЗ.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		НЗ = НоваяЗаявка.ПолучитьОбъект();
	КонецЕсли;
	
	ПредыдущаяЗаявкаЪ = ПредыдущаяЗаявка.ПолучитьОбъект();
	
	Для каждого Стр из ПредыдущаяЗаявкаЪ.СоставУслуги Цикл
		
		Если СписокКТК.Найти(Стр.НомерКТК) <> неопределено Тогда
			НСтр = НЗ.СоставУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			Стр.ПеренесенВЗаявку = НЗ.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	ПредыдущаяЗаявкаЪ.Записать(РежимЗаписиДокумента.Проведение);
	НЗ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НЗ.Ссылка;
	
КонецФункции

Функция ИзменениеКоличестваАктивныхСтрок(Заявка)
	
	Изменение = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ЗаявкаУслуги
	|ИЗ
	|	&СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.ПеренесенВЗаявку = Значение(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаявкаПослеЗаписи.НомерСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ЗаявкаПослеЗаписи
	|ИЗ
	|	ВТ_ЗаявкаУслуги КАК ВТ_ЗаявкаПослеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаСоставУслуги.НомерСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ЗаявкаДоЗаписи
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = Значение(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкаПослеЗаписи.КоличествоСтрок - ВТ_ЗаявкаДоЗаписи.КоличествоСтрок КАК Изменение
	|ИЗ
	|	ВТ_ЗаявкаДоЗаписи КАК ВТ_ЗаявкаДоЗаписи,
	|	ВТ_ЗаявкаПослеЗаписи КАК ВТ_ЗаявкаПослеЗаписи";
	Запрос.УстановитьПараметр("СоставУслуги", Заявка.СоставУслуги.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Заявка.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Изменение = РезультатЗапроса.Выгрузить()[0].Изменение; 
	КонецЕсли; 
	Возврат Изменение;
	
КонецФункции
 
Функция ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, Знач ОбъектСделка) Экспорт
	Возврат Документы.Сделка.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ОбъектСделка);		
КонецФункции

// Евросиб Фролов (24.03.2022 US №40767, Task №40768
Функция ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторов, Знач ОбъектСделка) Экспорт
	Возврат Документы.Сделка.ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторов, ОбъектСделка);	
КонецФункции	
// Евросиб Фролов)

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
Функция ПолучитьДанныеПоЗапрещеннымДляПереноса(Знач ОбъектСделка, МассивУникальныхЗаявок) Экспорт

	СтруктураДанныеПоЗапрещеннымДляПересчета = Новый Структура("МассивДобавленоИзАкцепта, МассивОбъединениеПорожнейИГруженойСделок", Новый Массив, Новый Массив);
	Расходы = ОбъектСделка.Расходы.Выгрузить();
	СвязьУчетныхЕдиниц = ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("БезЖДН", Истина));	
	СписокГУИДЗапрещенныхКПерезаполнению = ПерезаполнениеСделкиСервер.ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета, 
																													Расходы, 
																													СвязьУчетныхЕдиниц, 
																													МассивУникальныхЗаявок);

	Возврат СтруктураДанныеПоЗапрещеннымДляПересчета;
КонецФункции
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
&НаСервере
Функция ВыполнитьОтключениеРасходовИзАкцептаИВыполнитьРазъединение(Знач Объект, ДополнительныеПараметры) Экспорт     
	Возврат ПерезаполнениеСделкиСервер.ОтключитьРасходыПоАкцептамИВыполнитьРазъединение(Объект, ДополнительныеПараметры);	
КонецФункции
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец

//Евросиб Каблов 16.04.2024 #68187
Функция ПолучитьНомераКонтейнеровСНезакрытымСНП(МассивСтрокИсключаемыхКТК) Экспорт
	
	ПустаяДата = '00010101';
	
	ТаблицаЗаявок = Новый ТаблицаЗначений;
	ТаблицаЗаявок.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
	ТаблицаЗаявок.Колонки.Добавить("ГУИДСтрокиЗаявки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	
	Для Каждого Стр Из МассивСтрокИсключаемыхКТК Цикл
		НоваяСтрока = ТаблицаЗаявок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "Заявка, ГУИДСтрокиЗаявки");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗаявок.Заявка КАК Заявка,
	|	ТаблицаЗаявок.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	|ПОМЕСТИТЬ СтрокиЗаявки
	|ИЗ
	|	&ТаблицаЗаявок КАК ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетСНП.Ссылка КАК Расчет,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер КАК Контейнер,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер.Наименование КАК НомерКонтейнера
	|ИЗ
	|	СтрокиЗаявки КАК СтрокиЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
	|			ПО ЗаявкаСоставУслуги.КлючАналитикиПеревозки = РасчетСНП.КлючАналитикиПеревозки
	|		ПО СтрокиЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И СтрокиЗаявки.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	|ГДЕ
	|	РасчетСНП.Проведен
	|	И НЕ РасчетСНП.СНПЗакрыто
	|	И РасчетСНП.ФактическаяДатаНачала <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);	
	
	КонтейнерыСНезакрытымСНП = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерКонтейнера");
	
	Возврат КонтейнерыСНезакрытымСНП;
	
КонецФункции
#КонецОбласти

//Евросиб Коханенко Н.А. 22.05.2024 (( #83866 
Функция ПолучитьМассивСделокИКТКПоЗаявкеИКТК(ЗаявкаСсылка, МассивКТК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка.Представление КАК ПредставлениеСделки,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер			
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Контейнер В(&МассивКТК)
		|	И СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
		|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заявка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивСделокИКТК = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выборка); 
	
	Возврат МассивСделокИКТК;
	
КонецФункции //Евросиб Коханенко Н.А. 22.05.2024 )) #83866

//Евросиб Коханенко Н.А. 20.05.2024 (( #83866
&НаСервере
Процедура ПеренестиКТКНаСервере(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ЦелеваяЗаявка = Параметры.ЦелеваяЗаявка;
	ЗаявкаИсточникСсылка = Параметры.ЗаявкаИсточникСсылка;
	МассивГУИДов = Параметры.ЗаявкаИсточникМассивГУИДов;
	
	// Все операции по переносу КТК выполняем в одной транзакции
	// чтобы в случае ошибки отменились все созданные документы.
	НачатьТранзакцию();
	Попытка
		ПереносВыполненУспешно = Истина;
		ЗаявкаПриемникСсылка = ВыполнитьПереносКТКвДругуюЗаявку(ЦелеваяЗаявка, ПереносВыполненУспешно, ЗаявкаИсточникСсылка, МассивГУИДов);
		
		Если ПереносВыполненУспешно Тогда
			ЗафиксироватьТранзакцию();
			СтруктураРезультата = Новый Структура; 
			СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
			СтруктураРезультата.Вставить("ЗаявкаПриемникСсылка", ЗаявкаПриемникСсылка);
			ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации("Перенос КТК в другую заявку",
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.Заявка, 
									ЗаявкаИсточникСсылка, 
									ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстСообщения = СтрШаблон("Не удалось выполнить перенос КТК в другую заявку. Ошибка: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;							
		ПереносВыполненУспешно = Ложь;
	КонецПопытки;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 20.05.2024 )) #83866

//Евросиб Коханенко Н.А. 21.05.2024 (( #83866 
&НаСервере
Функция ВыполнитьПереносКТКвДругуюЗаявку(ЦелеваяЗаявка, ПереносВыполненУспешно, ЗаявкаИсточникСсылка, МассивГУИДов)
	
	ЗапросДляВТ = Новый Запрос;
	ЗапросДляВТ.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	ИСТИНА КАК БезЖДН,
	                    |	ВЫРАЗИТЬ(&ЗаявкаИсточник КАК Документ.Заявка) КАК Заявка,
	                    |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки,
	                    |	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер
	                    |ИЗ
	                    |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	                    |ГДЕ
	                    |	ЗаявкаСоставУслуги.Ссылка = &ЗаявкаИсточник
	                    |	И ЗаявкаСоставУслуги.ГУИДСтроки В(&МассивГУИДов)";
	ЗапросДляВТ.УстановитьПараметр("ЗаявкаИсточник", ЗаявкаИсточникСсылка);
	ЗапросДляВТ.УстановитьПараметр("МассивГУИДов", МассивГУИДов);
	РезультатЗапросаДляВТ = ЗапросДляВТ.Выполнить().Выгрузить();

	Запрос = Новый Запрос; 
	
	// Евросиб Фролов (18.02.2022 Task №46889
	// Для поиска счетов потребуется таблица ВТ.
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	// Евросиб Фролов)

	
	Запрос.Текст = ПолучитьТекстЗапросаДанныхПоЗаявкамРелизам();
	Запрос.УстановитьПараметр("ВремТЧ", РезультатЗапросаДляВТ);
	
	//Субботин 77659 24.11.2023 Начало // переделал на пакеты
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗаявки = РезультатЗапроса[1];
	РезультатРелизы = РезультатЗапроса[2].Выгрузить();
	ВыборкаЗаявка = РезультатЗаявки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Субботин 77659 24.11.2023 Конец
	Пока ВыборкаЗаявка.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаЗаявка.Выбрать();
		
		Если ЦелеваяЗаявка = Истина //перенос в новую заявку
			Или ТипЗнч(ЦелеваяЗаявка) = Тип("ДокументСсылка.Сделка") Тогда
			НоваяЗаявка = ВыборкаЗаявка.Заявка.Скопировать();
			НоваяЗаявка.СоставУслуги.Очистить();
			//Евросиб Каблов 26.12.2022 ( 62514
		    НоваяЗаявка.ЗапросНаКТК = Ложь;
			НоваяЗаявка.ДокументОснование = ВыборкаЗаявка.Заявка;
			//Евросиб Каблов 26.12.2022 )
			//ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, начало
			НоваяСсылка = Документы.Заявка.ПолучитьСсылку();
			НоваяЗаявка.УстановитьСсылкуНового(НоваяСсылка);
			//ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, конец
			//Евросиб Коханенко Н.А. 10.06.2024 (( #83866 
			НоваяЗаявка.УстановитьНовыйНомер();
			НоваяЗаявка.Дата = ТекущаяДата(); //для новой заявки устанавливаем новую дату
			ЭтоНоваяЗаявка = Истина;
			//Евросиб Коханенко Н.А. 10.06.2024 )) #83866 
		Иначе //перенос в существующую заявку
			НоваяЗаявка = ЦелеваяЗаявка.ПолучитьОбъект();
			//ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, начало
			НоваяСсылка = НоваяЗаявка.Ссылка;
			//ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, конец
			//Евросиб Коханенко Н.А. 10.06.2024 (( #83866
			ЭтоНоваяЗаявка = Ложь;
			//получим структуру запросов на авто по первой и последней миле из заявки-приемника, если есть
			СсылкиНаЗапросыНаАвтоЗаявкиПриемника = Документы.Заявка.ПолучитьСсылкиНаЗапросыНаАвтоперевозку(НоваяСсылка);
			//Евросиб Коханенко Н.А. 10.06.2024 )) #83866 
		КонецЕсли;
		
		ИсходнаяЗаявкаОбъект = ВыборкаЗаявка.Заявка.ПолучитьОбъект();
		
		ТЧЗаявка = НоваяЗаявка.СоставУслуги;

		//Евросиб Каблов 26.12.2022 ( 62514
		//// записать,чтобы получить ссылку, но не проводить. провести только после проведения старой заявки
		//НоваяЗаявка.Записать(РежимЗаписиДокумента.Запись);
		//НоваяСсылка = НоваяЗаявка.Ссылка;
		//НоваяСсылка = Документы.Заявка.ПолучитьСсылку(); //ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, закомментировал, перенесено выше
		//НоваяЗаявка.УстановитьСсылкуНового(НоваяСсылка); //ДИТ, Беляев СЮ, Ticket#0308622, 25-04-2023, закомментировал, перенесено выше
		//Евросиб Каблов 26.12.2022 )

		//Евросиб Каблов 16.11.2022 ( 52045
		СоответствиеСтрокЗаявок = Новый Соответствие;
		//Евросиб Каблов 16.11.2022 )  
		
		//Евросиб Коханенко Н.А. 08.07.2024 (( #83866
		СоответствиеКлючейАналитики = Новый Соответствие;
		//Евросиб Коханенко Н.А. 08.07.2024 )) #83866 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НовСтр = ТЧЗаявка.Добавить();
			//ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи); 
			//ДИТ, Беляев СЮ, ТА55631, 10-08-2022, начало (исключить перенос ГУИДСтроки в новую заявку, заполнен ГУИДСтроки будет при записи Заявки)
			
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи,, "ГУИДСтроки");
			
			//Евросиб Коханенко Н.А. 06.06.2024 (( #83866
			//старый ключ аналитики переносим в новую заявку, а в старой заявке создаем копию ключа
			НовыйКлючАналитикиПеревозки = ВыборкаДетальныеЗаписи.КлючАналитикиПеревозки.Скопировать();
			НовыйКлючАналитикиПеревозки.Записать();
			//и сохраняем ссылку скопированного ключа в строке Контейнеры запроса-источника
			СтрокаЗаявкиИсточника = ИсходнаяЗаявкаОбъект.СоставУслуги.Найти(ВыборкаДетальныеЗаписи.ГУИДСтроки, "ГУИДСтроки");
			Если СтрокаЗаявкиИсточника <> Неопределено Тогда
				СтрокаЗаявкиИсточника.КлючАналитикиПеревозки = НовыйКлючАналитикиПеревозки.Ссылка;
				//СтрокаЗаявкиИсточника.Релиз = ПредопределенноеЗначение("Документ.РелизКлиента.ПустаяСсылка");
			КонецЕсли;
			//обновим данные в перенесенном ключе аналитики	
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлючаАналитикиПеревозки.КлючАналитики = ВыборкаДетальныеЗаписи.КлючАналитикиПеревозки;
			СтруктураКлючаАналитикиПеревозки.ЗаявкаИсточник = ВыборкаДетальныеЗаписи.Заявка;
			СтруктураКлючаАналитикиПеревозки.ЗаявкаПриемник = НоваяСсылка;                  
			СтруктураКлючаАналитикиПеревозки.Заявка = НоваяСсылка; 
			Если ЭтоНоваяЗаявка Тогда
				СтруктураКлючаАналитикиПеревозки.НомерЗаявкиПриемника = НоваяЗаявка.Номер;
			КонецЕсли;
			СтруктураОтвета = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки); 
			КлючАналитикиЗаявкиПриемника = СтруктураОтвета.КлючАналитикиПеревозки;  
			//добавим пару ключей в соответствие для последующей подмены в запросе-источнике
			СоответствиеКлючейАналитики.Вставить(КлючАналитикиЗаявкиПриемника, НовыйКлючАналитикиПеревозки.Ссылка);
			//Евросиб Коханенко Н.А. 06.06.2024 )) #83866 
			
			//ДИТ, Беляев СЮ, ТА55631, 10-08-2022, конец
			//Евросиб Каблов 16.11.2022 ( 52045
			НовСтр.ГУИДСтроки = Новый УникальныйИдентификатор;
			СоответствиеСтрокЗаявок.Вставить(ВыборкаДетальныеЗаписи.ГУИДСтроки, НовСтр.ГУИДСтроки);
			//Евросиб Каблов 16.11.2022 )
			
			// в исходной заявке нужно к этим КТК указать ссылку на заявку, куда они перенесены и снять флаг "План"
			// как только этот флаг будет снят, документ отменит движения по этим КТК в РН Контейнеры в стоках.				
			СтрокиИсходнойЗаявки = ИсходнаяЗаявкаОбъект.СоставУслуги.НайтиСтроки(Новый Структура("ГУИДСтроки", ВыборкаДетальныеЗаписи.ГУИДСтроки));

			Для Каждого СтрИсх Из СтрокиИсходнойЗаявки Цикл
				СтрИсх.ПеренесенВЗаявку = НоваяСсылка;
				СтрИсх.План = Ложь;                          
				//Субботин 77659 24.11.2023 Начало				
				Если ИсходнаяЗаявкаОбъект.ЗапросНаКТК Тогда
					ИзменяемыйКТК = СтрИсх.НомерКТК;
					РедактируемаяСтрокаЗапроса = Неопределено;
					СтрокиЗапросаКТК = ИсходнаяЗаявкаОбъект.СписокЗапросНаКТК.Выгрузить();					
					Для Каждого СтрокаЗапроса Из СтрокиЗапросаКТК Цикл
						РедактируемаяСтрокаЗапроса = СтрокаЗапроса;
						МассивКтк = Новый Массив();
						МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаЗапроса.СписокКТК), ";", Ложь);
						Для Каждого ЭлемМассива из МассивТЕ цикл
							Если ТипЗнч(ЭлемМассива) = Тип("Строка") Тогда
								МассивКтк.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(ЭлемМассива)); 
							Иначе
								МассивКтк.Добавить(ЭлемМассива);
							КонецЕсли;
						КонецЦикла;						
						РезПоиска = МассивКтк.Найти(ИзменяемыйКТК);
						Если РезПоиска <> Неопределено тогда
							Прервать
						КонецЕсли;	
					КонецЦикла;					
					Если РедактируемаяСтрокаЗапроса <> Неопределено Тогда
						СтрокаРелиза = РезультатРелизы.Найти(РедактируемаяСтрокаЗапроса.ИдентификаторСтроки, "ИдентификаторСтрокиЗаявки");					
						Если СтрокаРелиза <> Неопределено Тогда
							Если ЗначениеЗаполнено(СтрокаРелиза.РелизКлиента) Тогда
								Продолжить 
							КонецЕсли;	
						КонецЕсли;
						ГуидСтрокиЗапроса = РедактируемаяСтрокаЗапроса.ИдентификаторСтроки; 
						//Евросиб Коханенко Н.А. 14.08.2024 (( #89741 
						//МассивКТК.Удалить(МассивКТК.Найти(ИзменяемыйКТК));
						Индекс = МассивКТК.Найти(ИзменяемыйКТК);
						Если Индекс <> Неопределено Тогда
							МассивКТК.Удалить(Индекс);
						КонецЕсли;
						//Евросиб Коханенко Н.А. 14.08.2024 )) #89741 
						СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ГуидСтрокиЗапроса);
						МеняемыеСтрокаЗапроса = ИсходнаяЗаявкаОбъект.СписокЗапросНаКТК.НайтиСтроки(СтруктураПоиска);
						Для каждого МеняемаяСтрокаЗапроса из МеняемыеСтрокаЗапроса Цикл 
							ЭТС = ""; // Элементы текущей строки
							Для Каждого Стр из МассивКТК Цикл
								ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
							КонецЦикла;				
							МеняемаяСтрокаЗапроса.СписокКТК = ЭТС;
							МеняемаяСтрокаЗапроса.КоличествоКТК = МассивКТК.Количество(); 
						КонецЦикла;
						Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСсылка,"ЗапросНаКТК") тогда
							ОбщегоНазначения.СообщитьПользователю("Необходимо открыть " + НоваяСсылка + " для добавления перенесенного контейнера в запрос на КТК");
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
				//Субботин 77659 24.11.2023 Конец 
			КонецЦикла;
			
		КонецЦикла;
		
		ИсходнаяЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		НоваяЗаявка.ДополнительныеСвойства.Вставить("ОтключитьВыводСообщений");
		НоваяЗаявка.Записать(РежимЗаписиДокумента.Проведение);
	
		//Евросиб Коханенко Н.А. 10.06.2024 (( #83866
		//получим структуру запросов на авто по первой и последней миле из заявки-источника, если есть
		СсылкиНаЗапросыНаАвтоИсхЗаявки = Документы.Заявка.ПолучитьСсылкиНаЗапросыНаАвтоперевозку(ИсходнаяЗаявкаОбъект.Ссылка);
		//получаем список ключей всех исключаемых (перенесенных) ктк по заявке-источнику
		МассивКлючейИсключаемыхКТК = РезультатЗаявки.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
		//этот список нужен для подмены ГУИДов строк услуг в запросах на автоперевозку
		СписокКлючейИГУИДовСтрокЗаявкиПриемника = НоваяЗаявка.СоставУслуги.Выгрузить(, "КлючАналитикиПеревозки, ГУИДСтроки");  
		//для каждого запроса на авто смотрим, все ли ктк из запроса в таблице исключаемых 
		Для Каждого СсылкаНаЗапрос Из СсылкиНаЗапросыНаАвтоИсхЗаявки Цикл
			
			ЗапросИсточникСсылка = СсылкаНаЗапрос.Значение;
			//если запрос на авто существовал, то есть работа
			Если ЗапросИсточникСсылка <> ПредопределенноеЗначение("Документ.ЗапросНаАвтоперевозку.ПустаяСсылка") Тогда
				
				тз_КлючиКТКИзЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗапросИсточникСсылка, "Контейнеры.КлючАналитикиПеревозки").Выгрузить();
				
				//составляем массив переносимых ктк по запросу на авто
				МассивПереносимыхКлючейКТКПоЗапросуНаАвто = Новый Массив;
				Для Каждого КлючАналитикиКТКИзЗапроса Из тз_КлючиКТКИзЗапроса Цикл
					РезультатПоискаВТаблицеИсключаемыхКТК = МассивКлючейИсключаемыхКТК.Найти(КлючАналитикиКТКИзЗапроса.КлючАналитикиПеревозки);
					Если РезультатПоискаВТаблицеИсключаемыхКТК <> Неопределено Тогда
						МассивПереносимыхКлючейКТКПоЗапросуНаАвто.Добавить(КлючАналитикиКТКИзЗапроса.КлючАналитикиПеревозки);
					КонецЕсли;
				КонецЦикла;
				
				Если МассивПереносимыхКлючейКТКПоЗапросуНаАвто.Количество() > 0 Тогда
					
					//получаем ЗапросНаАвто-источник
					ЗапросИсточникОбъект = ЗапросИсточникСсылка.ПолучитьОбъект();
					
					//формируем массив переносимых КТК
					Для Каждого СтрокаКТК из ЗапросИсточникОбъект.Контейнеры Цикл
						НомерКлючаВМассиве = МассивПереносимыхКлючейКТКПоЗапросуНаАвто.Найти(СтрокаКТК.КлючАналитикиПеревозки);
						Если НомерКлючаВМассиве <> Неопределено Тогда
							//если имеется информация о дате и времени вывоза
							//либо о дате завершения операции на складе 
							//в ТЧ "По данным из ИС "Транспортная логистика" - то нельзя переносить такую строку в новый запрос
							Если ЗначениеЗаполнено(СтрокаКТК.ДатаИВремяВывоза) 
								ИЛИ ЗначениеЗаполнено(СтрокаКТК.ДатаЗавершенияОперацииНаСкладеКлиента) Тогда
								//в ключе такого ктк очистим ссылку на запрос на автоперевозку и номер заказа на тс
								СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
								СтруктураКлючаАналитикиПеревозки.КлючАналитики = СоответствиеКлючейАналитики[МассивПереносимыхКлючейКТКПоЗапросуНаАвто[НомерКлючаВМассиве]];
								Если ЗапросИсточникОбъект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда 
									СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();	
									СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.НомерЗаказаНаТС = "";
								Иначе
									СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка(); 	
									СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.НомерЗаказаНаТС = "";
								КонецЕсли;
								Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
								//а сам ключ удалим из МассиваПереносимыхКлючейКТКПоЗапросуНаАвто
								МассивПереносимыхКлючейКТКПоЗапросуНаАвто.Удалить(НомерКлючаВМассиве);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;                                        
						
					ЗапросПриемникОбъект = Неопределено;
					Если НЕ ЭтоНоваяЗаявка Тогда 
						Если ЗапросИсточникОбъект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля
								И ЗначениеЗаполнено(СсылкиНаЗапросыНаАвтоЗаявкиПриемника.ПерваяМиля) Тогда
							ЗапросПриемникОбъект = СсылкиНаЗапросыНаАвтоЗаявкиПриемника.ПерваяМиля.ПолучитьОбъект();
						ИначеЕсли ЗапросИсточникОбъект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля
								И ЗначениеЗаполнено(СсылкиНаЗапросыНаАвтоЗаявкиПриемника.ПоследняяМиля) Тогда
							ЗапросПриемникОбъект = СсылкиНаЗапросыНаАвтоЗаявкиПриемника.ПоследняяМиля.ПолучитьОбъект();
						КонецЕсли;
					КонецЕсли;   
					
  					Если ЗапросПриемникОбъект = Неопределено Тогда
						//если это вновь созданная заявка, или у заявки нет запроса на автоперевозку, то создаем запрос и заполняем копированием 
						ЭтоНовыйЗапрос = Истина;
						ЗапросПриемникОбъект = ЗапросИсточникОбъект.Скопировать();
						ЗапросПриемникОбъект.Дата = ТекущаяДата();
						НоваяСсылка = Документы.ЗапросНаАвтоперевозку.ПолучитьСсылку();
						ЗапросПриемникОбъект.УстановитьСсылкуНового(НоваяСсылка);
						ЗапросПриемникОбъект.Заявка = НоваяЗаявка.Ссылка; 
					Иначе
						//запрос на авто уже существует, поэтому переносим строки в него 
						ЭтоНовыйЗапрос = Ложь;
						Для Каждого КлючАналитикиСтрокиПереноса Из МассивПереносимыхКлючейКТКПоЗапросуНаАвто Цикл
							СтрокаПереноса = ЗапросИсточникОбъект.Контейнеры.Найти(КлючАналитикиСтрокиПереноса, "КлючАналитикиПеревозки");
							Если СтрокаПереноса <> Неопределено Тогда
	  							//копируем строку в запрос-приемник
								НоваяСтрока = ЗапросПриемникОбъект.Контейнеры.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПереноса);
							КонецЕсли;
						КонецЦикла; 
					КонецЕсли;  
					
					//в запросе-источнике меняем статус перенесенных строк на Отменен
					//и меняем ключ аналитики на скопированный ключ-пустышку
					Для Каждого КлючАналитикиСтрокиПереноса Из МассивПереносимыхКлючейКТКПоЗапросуНаАвто Цикл
						СтрокаПереноса = ЗапросИсточникОбъект.Контейнеры.Найти(КлючАналитикиСтрокиПереноса, "КлючАналитикиПеревозки");
						Если СтрокаПереноса <> Неопределено Тогда
							СтрокаПереноса.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
							СтрокаПереноса.КлючАналитикиПеревозки = СоответствиеКлючейАналитики[КлючАналитикиСтрокиПереноса];
						КонецЕсли;
					КонецЦикла; 
					
					КоличествоСтрок = ЗапросПриемникОбъект.Контейнеры.Количество()-1;
    				ИндексСтроки = КоличествоСтрок;
    				Для Счетчик = 0 по КоличествоСтрок Цикл
        				Запись = ЗапросПриемникОбъект.Контейнеры.Получить(ИндексСтроки);
						Если МассивПереносимыхКлючейКТКПоЗапросуНаАвто.Найти(Запись.КлючАналитикиПеревозки) = Неопределено Тогда
							//удалим из скопированного запроса ктк, которые не переносятся
							Если ЭтоНовыйЗапрос Тогда
                				ЗапросПриемникОбъект.Контейнеры.Удалить(Запись);
							КонецЕсли;
						Иначе
							//обновляем  КлючАналитикиПеревозки перенесенного КТК
							СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
							СтруктураКлючаАналитикиПеревозки.КлючАналитики = Запись.КлючАналитикиПеревозки;
							ЗапросПриемникСсылка = ?(ЗначениеЗаполнено(ЗапросПриемникОбъект.Ссылка), ЗапросПриемникОбъект.Ссылка, НоваяСсылка);
							Если ЗапросИсточникОбъект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
								СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ЗапросНаАвто = ЗапросПриемникСсылка;
							Иначе
								СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ЗапросНаАвто = ЗапросПриемникСсылка;
							КонецЕсли;  
							СтруктураОтвета = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки); 
							Запись.КлючАналитикиПеревозки = СтруктураОтвета.КлючАналитикиПеревозки; 
							//обновляем Идентификатор строки услуги (из новой заявки)
							НовыйГУИДСтрокиУслуги = СписокКлючейИГУИДовСтрокЗаявкиПриемника.Найти(Запись.КлючАналитикиПеревозки, "КлючАналитикиПеревозки");
							Если НовыйГУИДСтрокиУслуги <> Неопределено Тогда
								Запись.ИдентификаторСтрокиУслуги = НовыйГУИДСтрокиУслуги.ГУИДСтроки; 
							КонецЕсли; 
							//выставляем чек-бокс "Обновлены исходные данные" перенесенного КТК
							Запись.ОбновленыИсходныеДанные = Истина;
						КонецЕсли;
        				ИндексСтроки = ИндексСтроки - 1;
    				КонецЦикла;					

					ЗапросИсточникОбъект.Записать(); 
					Если ЗапросПриемникОбъект.Контейнеры.Количество() > 0 Тогда
						ЗапросПриемникОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЗаявкаИсточникСсылка);
		
	//Евросиб Коханенко Н.А. 14.08.2024 (( #89741 
	ПривязатьАвансовыеСчетаКНовойЗаявке(Запрос, НоваяЗаявка, Документы.Сделка.ПустаяСсылка(), ЗаявкаИсточникСсылка);
	//Евросиб Коханенко Н.А. 14.08.2024 )) #89741  
	
	КонецЦикла;
	
	Возврат НоваяЗаявка.Ссылка;
	
КонецФункции //Евросиб Коханенко Н.А. 21.05.2024 )) #83866

//Евросиб Коханенко Н.А. 04.07.2024 (( #83866
//перенесено из формы документа Сделка, Процедура ВыполнитьИсключениеКТКИзСделки
Функция ПолучитьТекстЗапросаДанныхПоЗаявкамРелизам() Экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВремТЧ.БезЖДН КАК БезЖДН,
		               |	ВЫРАЗИТЬ(ВремТЧ.Заявка КАК Документ.Заявка) КАК Заявка,
					   |	ВремТЧ.Контейнер КАК Контейнер,
					   // Евросиб Фролов (18.02.2022 Task №46889
					   // Поиск КТК в заявке теперь по ГУИД строки
					   |	ВремТЧ.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
					   // Евросиб Фролов)
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВремТЧ КАК ВремТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.БезЖДН КАК БезЖДН,
					   //Евросиб - АСуслов 13.01.2023 13:33:01 #64069
					   //(
					   //|	ЗаявкаСоставУслуги.Ссылка.ПСЦ КАК ПСЦ,
					   |	ЗаявкаСоставУслуги.ПСЦ КАК ПСЦ,
					   //)
					   //Евросиб - АСуслов 13.01.2023 13:33:16 #64069
		               |	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
					   |	ЗаявкаСоставУслуги.Ссылка.Дата КАК ДатаЗаявки,
		               |	ЗаявкаСоставУслуги.Услуга КАК Услуга,
		               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		               |	ЗаявкаСоставУслуги.ТипКТК КАК ТипКТК,
		               |	ЗаявкаСоставУслуги.Пломбы КАК Пломбы,
		               |	ЗаявкаСоставУслуги.ФИОВодителя КАК ФИОВодителя,
		               |	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
		               |	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
		               |	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
		               |	ЗаявкаСоставУслуги.ПунктОтправления КАК ПунктОтправления,
		               |	ЗаявкаСоставУслуги.ПунктНазначения КАК ПунктНазначения,
		               |	ЗаявкаСоставУслуги.Грузоотправитель КАК Грузоотправитель,
		               |	ЗаявкаСоставУслуги.Грузополучатель КАК Грузополучатель,
		               // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 08.02.2023
					   // Было:
					   //|	ЗаявкаСоставУслуги.Груз КАК Груз, 
					   //Стало:
					   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
					   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
					   // ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 08.02.2023
		               |	ЗаявкаСоставУслуги.КодГруза КАК КодГруза,
		               |	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		               |	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		               |	ЗаявкаСоставУслуги.ТерминальныеУслугиПоПрибытию КАК ТерминальныеУслугиПоПрибытию,
		               |	ЗаявкаСоставУслуги.ОсобыеОтметки КАК ОсобыеОтметки,
		               // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 08.02.2023
					   // Было:
					   //|	ЗаявкаСоставУслуги.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего,
					   //Стало: 
					   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцииПоСдачеПорожнего,
					   // ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 08.02.2023
		               |	ЗаявкаСоставУслуги.УсловияПеревозки КАК УсловияПеревозки,
		               |	ЗаявкаСоставУслуги.ВидСобственности КАК ВидСобственности,
		               |	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		               |	ЗаявкаСоставУслуги.НормативноеИспользование КАК НормативноеИспользование,
		               |	ЗаявкаСоставУслуги.ПодтвержденоЗаказчику КАК ПодтвержденоЗаказчику,
		               |	ЗаявкаСоставУслуги.РазмерКТК КАК РазмерКТК,
		               |	ЗаявкаСоставУслуги.ВладелецКТК КАК ВладелецКТК,
		               |	ЗаявкаСоставУслуги.План КАК План,
		               |	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция,
		               |	ЗаявкаСоставУслуги.ДатаВыдачи КАК ДатаВыдачи,
		               |	ЗаявкаСоставУслуги.ПеренесенВЗаявку КАК ПеренесенВЗаявку,
		               |	ЗаявкаСоставУслуги.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
		               |	ЗаявкаСоставУслуги.ДатаПостановкиВРезерв КАК ДатаПостановкиВРезерв,
		               |	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
		               |	ЗаявкаСоставУслуги.ТипВагона КАК ТипВагона,
		               |	ЗаявкаСоставУслуги.Вагон КАК Вагон,
		               |	ЗаявкаСоставУслуги.СтокВыдачи КАК СтокВыдачи,
		               |	ЗаявкаСоставУслуги.Груженый КАК Груженый,
		               |	ЗаявкаСоставУслуги.СрокОтправкиУведомления КАК СрокОтправкиУведомления,
		               |	ЗаявкаСоставУслуги.ФИОВодителяВыгрузка КАК ФИОВодителяВыгрузка,
		               |	ЗаявкаСоставУслуги.НомерАвтоВыгрузка КАК НомерАвтоВыгрузка,
		               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
		               |	ЗаявкаСоставУслуги.РодУпаковки КАК РодУпаковки,
		               |	ЗаявкаСоставУслуги.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
		               |	ЗаявкаСоставУслуги.Релиз КАК Релиз,
		               |	ЗаявкаСоставУслуги.АдресПогрузки КАК АдресПогрузки,
		               |	ЗаявкаСоставУслуги.АдресВыгрузки КАК АдресВыгрузки,
		               |	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодПогрузку КАК ДатаПодачиАвтоПодПогрузку,
		               |	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
					   // Евросиб Фролов (18.02.2022 Task №46889
					   // Логвинова: коносамент должен переходить в новую заявку
					   |	ЗаявкаСоставУслуги.Коносамент КАК Коносамент
					   // Евросиб Фролов)
					   //ДИТ, Беляев СЮ, Ticket#0288650/TA 59038, 12-10-2022, начало
					   // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
					   //ок(
					   //|	,ЗаявкаСоставУслуги.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК
					   //ок)
					   |	,ЗаявкаСоставУслуги.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК
					   // ДИТ 89973 Давудов М.А. Конец: 21.08.2024
					   |	,ЗаявкаСоставУслуги.ПерваяМиля КАК ПерваяМиля
					   |	,ЗаявкаСоставУслуги.ПоследняяМиля КАК ПоследняяМиля
					   //ДИТ, Беляев СЮ, Ticket#0288650/TA 59038, 12-10-2022, конец
					   //Евросиб Коханенко Н.А. 16.07.2024 (( #83866 
					   //нам нужен ГУИД строки релиза клиента из заявки-источника
					   |	,ЗаявкаСоставУслуги.ИдентификаторСтрокиРелизаКлиента КАК ИдентификаторСтрокиРелизаКлиента 
					   //и учетное направление из заявки-источника
					   |	,ЗаявкаСоставУслуги.УчетноеНаправление КАК УчетноеНаправление, 
					   //Евросиб Коханенко Н.А. 16.07.2024 )) #83866
					   // Евросиб US 99390 TA 108801 Рыбьяков К.А. 06.07.2025 ((
					   |	ЗаявкаСоставУслуги.ПлановаяЛокацияСдачиКТК КАК ПлановаяЛокацияСдачиКТК 
					   // Евросиб Рыбьяков К.А. 06.07.2025 ))
					   |ИЗ
					   |	ВТ КАК ВТ
					   //Евросиб Каблов 11.01.2023 ( 62514
					   //|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
					   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
					   //Евросиб Каблов 11.01.2023 )
					   |		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
					   // Евросиб Фролов (18.02.2022 Task №46889
					   |			И ВТ.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
					   //|			И ВТ.Контейнер = ЗаявкаСоставУслуги.НомерКТК //закомментировал
					   // Евросиб Фролов)								   
					   |ИТОГИ ПО
					   |	Заявка;
					   |////////////////////
						//Субботин 77659 24.11.2023 Начало
					   |ВЫБРАТЬ
					   |	РелизыКлиентовЗапросовНаКТК.Заявка КАК Заявка,
					   |	РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки КАК ИдентификаторСтрокиЗаявки,
					   |	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента
					   |ИЗ
					   |	ВТ КАК ВТ
					   |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
					   |	ПО (ВТ.Заявка = РелизыКлиентовЗапросовНаКТК.Заявка)" ;
						//Субботин 77659 24.11.2023 Конец

	Возврат ТекстЗапроса;

КонецФункции //Евросиб Коханенко Н.А. 04.07.2024 )) #83866 

//Евросиб Коханенко Н.А. 22.08.2024 (( #89741 
//перенесено из формы документа Сделки // Евросиб Фролов (18.02.2022 Task №46889
Процедура ПривязатьАвансовыеСчетаКНовойЗаявке(Запрос, НоваяЗаявка, Сделка, ЗаявкаИсточник) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВТ.Заявка КАК Заявка,
	|	ВТ.Контейнер КАК Контейнер,
	|	ЗаявкаСоставУслуги.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ втЗаявки
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И ВТ.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаявки.Заявка КАК Заявка,
	|	втЗаявки.Контейнер КАК Контейнер,
	|	втЗаявки.Коносамент КАК Коносамент,
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание
	|ПОМЕСТИТЬ втСчета
	|ИЗ
	|	втЗаявки КАК втЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|			ПО СчетНаОплатуПокупателюДокументыОснования.Ссылка = СчетНаОплатуПокупателюТовары.Ссылка
	|		ПО втЗаявки.Заявка = СчетНаОплатуПокупателюДокументыОснования.Документ
	|			И (СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен)
	|			И (СчетНаОплатуПокупателюДокументыОснования.Ссылка.АвансовыйСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчета.Ссылка КАК СчетНаОплату,
	|	втСчета.Коносамент КАК Коносамент
	|ИЗ
	|	втСчета КАК втСчета
	|ГДЕ
	|	втСчета.Содержание ПОДОБНО ""%"" + втСчета.Контейнер.Наименование + ""%""
	|ИТОГИ ПО
	|	СчетНаОплату";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСчетов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСчетов.Следующий() Цикл
		СчетОбъект = ВыборкаСчетов.СчетНаОплату.ПолучитьОбъект();
		
		ЗаписыватьСчет = Ложь;
		
		ВыборкаКоносамент = ВыборкаСчетов.Выбрать();
		Пока ВыборкаКоносамент.Следующий() Цикл
			
			НайденныеСтроки = СчетОбъект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ, Сделка, Коносамент", НоваяЗаявка.Ссылка, Сделка, ВыборкаКоносамент.Коносамент)); 
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОснование = СчетОбъект.ДокументыОснования.Добавить();
			ДокументОснование.Документ = НоваяЗаявка.Ссылка;
			ДокументОснование.Сделка = Сделка;
			ДокументОснование.Коносамент = ВыборкаКоносамент.Коносамент;
			ЗаписыватьСчет = Истина;
		КонецЦикла; 
		
		//получим все неперенесенные КТК из Заявки-источника
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СчетДокументы.Документ КАК Заявка
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетДокументы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетУчетныеЕдиницы
			|			ПО ЗаявкаСоставУслуги.НомерКТК = СчетУчетныеЕдиницы.УчетнаяЕдиница
			|				И (СчетУчетныеЕдиницы.Ссылка = &СчетСсылка)
			|				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
			|				И (ЗаявкаСоставУслуги.Ссылка = &ЗаявкаСсылка)
			|		ПО СчетДокументы.Документ = ЗаявкаСоставУслуги.Ссылка
			|ГДЕ
			|	СчетДокументы.Ссылка = &СчетСсылка
			|	И ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаИсточник);
		Запрос.УстановитьПараметр("СчетСсылка", ВыборкаСчетов.СчетНаОплату);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПараметрыОтбора = Новый Структура("Документ", Выборка.Заявка); 
				НайденныеСтроки = СчетОбъект.ДокументыОснования.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки <> Неопределено Тогда
					Для Каждого	УдаляемаяСтрока Из НайденныеСтроки Цикл
						СчетОбъект.ДокументыОснования.Удалить(УдаляемаяСтрока);
						ЗаписыватьСчет = Истина;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗаписыватьСчет Тогда
			СчетОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.08.2024 )) #89741   

//Евросиб Коханенко Н.А. 22.08.2024 (( #89741 
Функция НайтиСвязаннуюСделку(ЗаявкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СделкаЗаявки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|ГДЕ
		|	СделкаЗаявки.Заявка = &ЗаявкаСсылка
		|	И СделкаЗаявки.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = ?(РезультатЗапроса.Пустой(), Неопределено, РезультатЗапроса.Выгрузить()[0].Ссылка);
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 22.08.2024 )) #89741 
