
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	
	ФоновоеЗадание = Новый Структура("
		|ИмяЗадания,
		|ИдентификаторЗадания,
		|АдресХранилища");
	
	ИспользоватьФоновоеЗадание = Ложь;
	ИДФормы = Строка(УникальныйИдентификатор);	
//	СписокПорученийНаОгрузку.Параметры.УстановитьЗначениеПараметра("ИДФормы", ИДФормы);
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИДФормы", ИДФормы);
	
	ЗапуститьФоновоеЗадание("ОчиститьВспомогательныйРегистр", ПараметрыЗадания);
	
КонецПроцедуры

#Область ФоновыеЗадания

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание(ИмяЗадания, ПараметрыЗадания)
		
	ЗаданиеВыполнено = ЗапуститьФоновоеЗаданиеНаСервере(ИмяЗадания, ПараметрыЗадания);
	
	Если ЗаданиеВыполнено = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ИспользоватьФоновоеЗадание Тогда
		
		Если ЗаданиеВыполнено Тогда
			ОбработатьЗавершениеЗаданияНаКлиенте();
		Иначе
			ОткрытьФормуДлительнойОперации();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеНаСервере(Знач ИмяЗадания, Знач ПараметрыЗадания)
	
	//Если ИмяЗадания = "СформироватьГУ" Тогда
	//	
	//	РезультатЗапускаЗадания = ЗапуститьЗаданиеСформироватьГУ(ПараметрыЗадания);
	//	
	//ИначеЕсли ИмяЗадания = "ОчиститьВспомогательныйРегистр" Тогда
	//	
	//	РезультатЗапускаЗадания = ОчиститьВспомогательныйРегистр(ПараметрыЗадания);
	//	
	//Иначе
	//	
	//	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//						НСтр("ru = 'Неизвестное задание ""%1""'"),
	//						ИмяЗадания);
	//КонецЕсли;
	//
	//Если РезультатЗапускаЗадания = Неопределено Тогда
	//	Возврат Неопределено;	
	//КонецЕсли;
	//
	//ФоновоеЗадание.ИмяЗадания           = ИмяЗадания;
	//ФоновоеЗадание.ИдентификаторЗадания = РезультатЗапускаЗадания.ИдентификаторЗадания;
	//ФоновоеЗадание.АдресХранилища       = РезультатЗапускаЗадания.АдресХранилища;
	//
	//Возврат РезультатЗапускаЗадания.ЗаданиеВыполнено;

КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеЗаданияНаКлиенте()

	Если ФоновоеЗадание.ИмяЗадания = "СформироватьГУ" Тогда
		ЗавершениеЗаданияСформироватьГУ(ФоновоеЗадание.АдресХранилища);
		Элементы.ВыполнениеОпераций.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДлительнойОперации()
	
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	
	ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала = 1.2;
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(
		ЭтаФорма, ФоновоеЗадание.ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ФормаДлительнойОперации.Открыта() Тогда
			
			Если ЗаданиеВыполнено(ФоновоеЗадание.ИдентификаторЗадания) Тогда
				ОбработатьЗавершениеЗаданияНаКлиенте();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

#Область ВыполнениеЗаданий

&НаСервере
Функция ЗапуститьЗаданиеСформироватьГУ(ПараметрыЗадания)
	
	//МассивВыделенныеСтроки = Новый Массив;
	//
	//Для Каждого ВыделеннаяСтрока из Элементы.СписокПорученийНаОгрузку.ВыделенныеСтроки Цикл
	//	СтрокаСтруктура = Новый Структура;
	//	Для Каждого Элемент из СписокПорученийНаОгрузку.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
	//		СтрокаСтруктура.Вставить(Строка(Элемент.Поле));	
	//	КонецЦикла;
	//	ЗаполнитьЗначенияСвойств(СтрокаСтруктура, ВыделеннаяСтрока);
	//	МассивВыделенныеСтроки.Добавить(СтрокаСтруктура);
	//КонецЦикла;
	//
	//ПараметрыЗадания.Вставить("ВыделенныеСтроки", МассивВыделенныеСтроки);

	//ПараметрыЗадания.Вставить("ИДФормы", ИДФормы);
	//
	//НаименованиеЗадания = НСтр("ru = 'Формирование ГУ-12'");
	//
	//Если ИспользоватьФоновоеЗадание Тогда
	//	
	//	РезультатЗапускаЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
	//									УникальныйИдентификатор,
	//									
	//									ПараметрыЗадания,
	//									НаименованиеЗадания);
	//			
	//	Возврат РезультатЗапускаЗадания;
	//	
	//Иначе	
	//	
	//	АдресХранилища = Новый УникальныйИдентификатор;
	//	Документы.э_ЗаявкаНаПеревозку.СоздатьГУ(ПараметрыЗадания, АдресХранилища);
	//	
	//	Результат = Новый Структура;
	//	Результат.Вставить("АдресХранилища",       АдресХранилища);
	//	Результат.Вставить("ЗаданиеВыполнено",     Истина);
	//	Результат.Вставить("ИдентификаторЗадания", Неопределено);

	//	Возврат Результат; 
	//	
	//КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаданияСформироватьГУ(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если Не Результат.ЕстьОшибка Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ИДФормы", ИДФормы);
		
		ЗапуститьФоновоеЗадание("ОчиститьВспомогательныйРегистр", ПараметрыЗадания);
	
	КонецЕсли;	
	//Результат = ЗавершениеЗаданияНаСервере(АдресХранилища);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти




