
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверятьДействующийСтатусГВЦ = Неопределено;
	Если Не Параметры.Свойство("ПроверятьДействующийСтатусГВЦ", ПроверятьДействующийСтатусГВЦ) Тогда
		ПроверятьДействующийСтатусГВЦ = Истина;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ПодборНесколькихЖДННаВагон", ПодборНесколькихЖДННаВагон) Тогда
		ПодборНесколькихЖДННаВагон = Ложь;
	КонецЕсли;
	
	ПериодОтправленияНачало = Неопределено;
	Если Параметры.Свойство("ПериодОтправленияНачало", ПериодОтправленияНачало) Тогда
		ПериодОтправления.ДатаНачала = ПериодОтправленияНачало;
	КонецЕсли;
	
	ПериодОтправленияОкончание = Неопределено;
	Если Параметры.Свойство("ПериодОтправленияОкончание", ПериодОтправленияОкончание) Тогда
		ПериодОтправления.ДатаОкончания = ПериодОтправленияОкончание;
	КонецЕсли;
	
	ЗначениеПараметра = Неопределено;
	Параметры.Свойство("СтанцияОтправления", ЗначениеПараметра);
	//Евросиб Каблов 14.04.2021 ( Ticket#0224665
	//Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Локации") Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	э_Станции.Ссылка КАК Станция
	//	|ИЗ
	//	|	Справочник.Локации КАК Локации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
	//	|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
	//	|ГДЕ
	//	|	Локации.Ссылка = &Локация";
	//	Запрос.УстановитьПараметр("Локация", ЗначениеПараметра);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		СтанцияОтправления = Выборка.Станция;
	//	КонецЕсли;
	//Иначе
	//	СтанцияОтправления = ЗначениеПараметра;
	//КонецЕсли;
	СтанцияОтправления = ЗначениеПараметра;
	//Евросиб Каблов 14.04.2021 )
	
	Параметры.Свойство("СтанцияНазначения", ЗначениеПараметра);
	//Евросиб Каблов 14.04.2021 ( Ticket#0224665
	//Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Локации") Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	э_Станции.Ссылка КАК Станция
	//	|ИЗ
	//	|	Справочник.Локации КАК Локации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
	//	|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
	//	|ГДЕ
	//	|	Локации.Ссылка = &Локация";
	//	Запрос.УстановитьПараметр("Локация", ЗначениеПараметра);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		СтанцияНазначения = Выборка.Станция;
	//	КонецЕсли;
	//Иначе
	//	СтанцияНазначения = ЗначениеПараметра;
	//КонецЕсли;
	СтанцияНазначения = ЗначениеПараметра;
	//Евросиб Каблов 14.04.2021 )
	
	Если Параметры.Свойство("МассивВагоновБезКТК") Тогда
		ТаблицаВагоныНакладные.Очистить();
		Для Каждого Эл Из Параметры.МассивВагоновБезКТК Цикл
			НовСтр = ТаблицаВагоныНакладные.Добавить();
			Если ТипЗнч(Эл) = Тип("Строка") Тогда
				НовСтр.Вагон = Справочники.ТС.НайтиПоНаименованию(Эл);
				НовСтр.ВагонСтрока = Эл;
			Иначе
				НовСтр.Вагон = Эл;
				НовСтр.ВагонСтрока = Эл.Наименование;
			КонецЕсли;
			
		КонецЦикла;
		
		ПодборНакладныхДляВагонов(Параметры.МассивВагоновБезКТК);
		
	ИначеЕсли Параметры.Свойство("ВагоныДляПодбораНакладных") Тогда
		
		Для Каждого СтрокаПоВагону Из Параметры.ВагоныДляПодбораНакладных Цикл
			НоваяСтрока = ТаблицаВагоныНакладные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоВагону);
			Если ЗначениеЗаполнено(НоваяСтрока.Вагон) И Не ЗначениеЗаполнено(НоваяСтрока.ВагонСтрока) Тогда
				НоваяСтрока.ВагонСтрока = НоваяСтрока.Вагон.Наименование;
			ИначеЕсли Не ЗначениеЗаполнено(НоваяСтрока.Вагон) И ЗначениеЗаполнено(НоваяСтрока.ВагонСтрока) Тогда
				НоваяСтрока.Вагон = Справочники.ТС.НайтиПоНаименованию(НоваяСтрока.ВагонСтрока);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ПодборНакладныхДляВагонов(СписокВагонов)
	
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(ПериодОтправления) Тогда
		ДатаОтпрНач = ПериодОтправления.ДатаНачала;
		ДатаОтпрКон = ПериодОтправления.ДатаОкончания;
	Иначе
		ДатаОтпрНач = ТекущаяДата() - 180*3600*24;
		ДатаОтпрКон = ТекущаяДата();
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаОтпрНач",ДатаОтпрНач);
	Запрос.УстановитьПараметр("ДатаОтпрКон",ДатаОтпрКон);
	
	Запрос.УстановитьПараметр("НомерВагона",СписокВагонов);
	
	//Евросиб Каблов 14.04.2021 ( Ticket#0224665
	//Если ЗначениеЗаполнено(ПериодПрибытия) Тогда
	//	ДатаРаскрНач = ПериодПрибытия.ДатаНачала;
	//	ДатаРаскрКон = ПериодПрибытия.ДатаОкончания;
	//	ОтборыПериодПрибытия = "	И э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГрузаМестная МЕЖДУ &ДатаРаскрНач И &ДатаРаскрКон";
	//	Запрос.УстановитьПараметр("ДатаРаскрНач",ДатаРаскрНач);
	//	Запрос.УстановитьПараметр("ДатаРаскрКон",ДатаРаскрКон);
	//Иначе
	//	ОтборыПериодПрибытия = "";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(СтанцияОтправления) Тогда
	//	ОтборыСтанцияОтправления = "	И э_НакладнаяВагоны.Ссылка.СтанцияОтправления = &СтанцияОтправления";
	//	Запрос.УстановитьПараметр("СтанцияОтправления",СтанцияОтправления);
	//Иначе
	//	ОтборыСтанцияОтправления = "";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(СтанцияНазначения) Тогда
	//	ОтборыСтанцияНазначения = "	И э_НакладнаяВагоны.Ссылка.СтанцияНазначения = &СтанцияНазначения";
	//	Запрос.УстановитьПараметр("СтанцияНазначения",СтанцияНазначения);
	//Иначе
	//	ОтборыСтанцияНазначения = "";
	//КонецЕсли;
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	э_НакладнаяВагоны.Ссылка КАК Накладная,
	//               |	э_НакладнаяВагоны.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
	//               |	э_НакладнаяВагоны.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
	//               |	э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаОтправления,
	//               |	э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГрузаМестная КАК ДатаРаскредитации,
	//               |	э_НакладнаяВагоны.Ссылка.ГруженаяНакладная КАК Груженый,
	//               |	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НомерНакладной,
	//               |	э_НакладнаяВагоны.НомерВагона КАК НомерВагона
	//               |ИЗ
	//               |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//               |ГДЕ
	//               |	НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	//               |	И э_НакладнаяВагоны.НомерВагона В(&НомерВагона)
	//               |	И (э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	//               |			ИЛИ э_НакладнаяВагоны.Ссылка.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ))
	//               |	И э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаОтпрНач И &ДатаОтпрКон" + ОтборыПериодПрибытия + "
	//               |    " + ОтборыСтанцияОтправления + "
	//               |    " + ОтборыСтанцияНазначения;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Локации.Локация КАК Локация,
	|	э_Станции.Ссылка КАК Станция
	|ПОМЕСТИТЬ ВТСтанцииНазначения
	|ИЗ
	|	(ВЫБРАТЬ
	|		АналогиЛокаций.Локация КАК Локация,
	|		АналогиЛокаций.Локация.КодЖДСтанции КАК КодЖДСтанции
	|	ИЗ
	|		РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|	ГДЕ
	|		АналогиЛокаций.Аналог = &СтанцияНазначения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналогиЛокаций.Аналог,
	|		АналогиЛокаций.Аналог.КодЖДСтанции
	|	ИЗ
	|		РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|	ГДЕ
	|		АналогиЛокаций.Локация = &СтанцияНазначения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Локации.Ссылка,
	|		Локации.КодЖДСтанции
	|	ИЗ
	|		Справочник.Локации КАК Локации
	|	ГДЕ
	|		Локации.Ссылка = &СтанцияНазначения) КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
	|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Локации.Локация КАК Локация,
	|	э_Станции.Ссылка КАК Станция
	|ПОМЕСТИТЬ ВТСтанцииОтправления
	|ИЗ
	|	(ВЫБРАТЬ
	|		АналогиЛокаций.Локация КАК Локация,
	|		АналогиЛокаций.Локация.КодЖДСтанции КАК КодЖДСтанции
	|	ИЗ
	|		РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|	ГДЕ
	|		АналогиЛокаций.Аналог = &СтанцияОтправления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналогиЛокаций.Аналог,
	|		АналогиЛокаций.Аналог.КодЖДСтанции
	|	ИЗ
	|		РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|	ГДЕ
	|		АналогиЛокаций.Локация = &СтанцияОтправления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Локации.Ссылка,
	|		Локации.КодЖДСтанции
	|	ИЗ
	|		Справочник.Локации КАК Локации
	|	ГДЕ
	|		Локации.Ссылка = &СтанцияОтправления) КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
	|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_НакладнаяВагоны.Ссылка КАК Накладная,
	|	э_НакладнаяВагоны.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
	|	э_НакладнаяВагоны.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
	|	э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаОтправления,
	|	э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза КАК ДатаРаскредитации,
	|	э_НакладнаяВагоны.Ссылка.ГруженаяНакладная КАК Груженый,
	|	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НомерНакладной,
	|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|ГДЕ
	|	НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	|	И э_НакладнаяВагоны.НомерВагона В(&НомерВагона)
	|	И (э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	|			ИЛИ э_НакладнаяВагоны.Ссылка.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ))
	|	И э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаОтпрНач И &ДатаОтпрКон
	|	И э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза МЕЖДУ &ДатаРаскрНач И &ДатаРаскрКон
	|	И э_НакладнаяВагоны.Ссылка.СтанцияНазначения В
	|			(ВЫБРАТЬ
	|				ВТСтанцииНазначения.Станция КАК Станция
	|			ИЗ
	|				ВТСтанцииНазначения КАК ВТСтанцииНазначения)
	|	И э_НакладнаяВагоны.Ссылка.СтанцияОтправления В
	|			(ВЫБРАТЬ
	|				ВТСтанцииОтправления.Станция КАК Станция
	|			ИЗ
	|				ВТСтанцииОтправления КАК ВТСтанцииОтправления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправления УБЫВ";	
	
	Если ЗначениеЗаполнено(ПериодПрибытия) Тогда
		ДатаРаскрНач = ПериодПрибытия.ДатаНачала;
		ДатаРаскрКон = ПериодПрибытия.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаРаскрНач",ДатаРаскрНач);
		Запрос.УстановитьПараметр("ДатаРаскрКон",ДатаРаскрКон);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза МЕЖДУ &ДатаРаскрНач И &ДатаРаскрКон", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтанцияОтправления) Тогда
		Запрос.УстановитьПараметр("СтанцияОтправления",СтанцияОтправления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И э_НакладнаяВагоны.Ссылка.СтанцияОтправления = &СтанцияОтправления", "");
		ТекстУсловия =
		"И э_НакладнаяВагоны.Ссылка.СтанцияОтправления В
		|			(ВЫБРАТЬ
		|				ВТСтанцииОтправления.Станция КАК Станция
		|			ИЗ
		|				ВТСтанцииОтправления КАК ВТСтанцииОтправления)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстУсловия, "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтанцияНазначения) Тогда
		Запрос.УстановитьПараметр("СтанцияНазначения",СтанцияНазначения);
	Иначе
		ТекстУсловия =
		"И э_НакладнаяВагоны.Ссылка.СтанцияНазначения В
		|			(ВЫБРАТЬ
		|				ВТСтанцииНазначения.Станция КАК Станция
		|			ИЗ
		|				ВТСтанцииНазначения КАК ВТСтанцииНазначения)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстУсловия, ""); 
	КонецЕсли;
	//Евросиб Каблов 14.04.2021 ) 
	
	Если ПроверятьДействующийСтатусГВЦ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ э_НакладнаяВагоны.Ссылка.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ)", "");
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	// сортируем тут, чтобы запрос можно было открыть по правой кнопке
	//ТЗ.Сортировать("ДатаОтправления УБЫВ");
	
	ВозможныеНакладные.Загрузить(ТЗ);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтанции(Локации)
	
	СоответствиеСтанций = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_Станции.Ссылка КАК Станция,
	|	Локации.Ссылка КАК Локация
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
	|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
	|ГДЕ
	|	Локации.Ссылка В(&Локации)";
	
	Запрос.УстановитьПараметр("Локации", Локации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСтанций.Вставить(Выборка.Локация, Выборка.Станция);
	КонецЦикла;
	
	Возврат СоответствиеСтанций;
		
КонецФункции

&НаКлиенте
Процедура Поиск(Команда)
	
	ВозможныеНакладные.Очистить();
	
	СписокВагонов = Новый Массив;
	
	Для Каждого Стр Из ТаблицаВагоныНакладные Цикл
		СписокВагонов.Добавить(Стр.ВагонСтрока);
	КонецЦикла;
	
	ПодборНакладныхДляВагонов(СписокВагонов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНакладную(Команда)
	
	ТекД = Элементы.ВозможныеНакладные.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, ТекД.Накладная);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВагоныНакладныеПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.ТаблицаВагоныНакладные.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 14.04.2021 ( Ticket#0224665
	//Локации = Новый Массив();
	//Если ЗначениеЗаполнено(ТекД.СтанцияОтправления) Тогда
	//	Локации.Добавить(ТекД.СтанцияОтправления);
	//КонецЕсли;	
	//Если ЗначениеЗаполнено(ТекД.СтанцияНазначения) Тогда
	//	Локации.Добавить(ТекД.СтанцияНазначения);
	//КонецЕсли;
	//СоответствиеСтанций = ПолучитьСтанции(Локации);
	//
	//Если ЗначениеЗаполнено(ТекД.СтанцияОтправления) Тогда
	//	СтанцияОтправления = СоответствиеСтанций.Получить(ТекД.СтанцияОтправления);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ТекД.СтанцияНазначения) Тогда
	//	СтанцияНазначения = СоответствиеСтанций.Получить(ТекД.СтанцияНазначения);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.СтанцияОтправления) Тогда
		СтанцияОтправления =  ТекД.СтанцияОтправления;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекД.СтанцияНазначения) Тогда
		СтанцияНазначения = ТекД.СтанцияНазначения;
	КонецЕсли;
	//Евросиб Каблов 14.04.2021 )
	
	Если ЗначениеЗаполнено(ТекД.ПериодОтправленияНачало) Тогда
		ПериодОтправления.ДатаНачала = ТекД.ПериодОтправленияНачало;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.ПериодОтправленияОкончание) Тогда
		ПериодОтправления.ДатаОкончания = ТекД.ПериодОтправленияОкончание;
	КонецЕсли;
	
	Элементы.ВозможныеНакладные.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерВагона", ТекД.ВагонСтрока);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	УстановитьСоответствиеВагонЖДН();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствиеВагонЖДН()
	
	ТекД_Приемник = Элементы.ТаблицаВагоныНакладные.ТекущиеДанные;
	Если ТекД_Приемник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекД_Источник = Элементы.ВозможныеНакладные.ТекущиеДанные;
	Если ТекД_Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодборНесколькихЖДННаВагон Тогда
		
		НайденныеСтрокиВагонНакладная = ТаблицаВагоныНакладные.НайтиСтроки(Новый Структура("ВагонСтрока, Накладная", ТекД_Источник.НомерВагона, ТекД_Источник.Накладная));
		Если НайденныеСтрокиВагонНакладная.Количество() = 0 Тогда
			
			НайденныеСтрокиВагон = ТаблицаВагоныНакладные.НайтиСтроки(Новый Структура("ВагонСтрока", ТекД_Источник.НомерВагона));			
			РедактируемаяСтрока = Неопределено;
			
			Для Каждого СтрокаПоВагону Из НайденныеСтрокиВагон Цикл
				Если Не ЗначениеЗаполнено(СтрокаПоВагону.Накладная) Тогда
					РедактируемаяСтрока = СтрокаПоВагону;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если РедактируемаяСтрока = Неопределено Тогда
				ИндексПоследнейВМассиве = НайденныеСтрокиВагон.Количество() - 1;
				ИндексПоследнейСтрокиПоВагону = ТаблицаВагоныНакладные.Индекс(НайденныеСтрокиВагон[ИндексПоследнейВМассиве]);
				Если ИндексПоследнейСтрокиПоВагону >= 0 Тогда
					РедактируемаяСтрока = ТаблицаВагоныНакладные.Вставить(ИндексПоследнейСтрокиПоВагону + 1);
				КонецЕсли;
			КонецЕсли;
			
			Если РедактируемаяСтрока <> Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, НайденныеСтрокиВагон[0]);
				
				РедактируемаяСтрока.Накладная = ТекД_Источник.Накладная;
				РедактируемаяСтрока.НомерНакладной = ТекД_Источник.НомерНакладной;
				РедактируемаяСтрока.ТранспортныйДокумент = ПолучитьТД(ТекД_Источник.Накладная);
				
				МассивКТК = ПолучитьКонтейнерыИзЖДН(РедактируемаяСтрока.Накладная, РедактируемаяСтрока.ВагонСтрока);
				НомераКТК = Новый Массив;
				Для Каждого ДанныеКТК Из МассивКТК Цикл
					НомераКТК.Добавить(ДанныеКТК.НомерКонтейнера);
				КонецЦикла;
				НомераКонтейнеров = СтрСоединить(НомераКТК, ";");
				РедактируемаяСтрока.Контейнеры.Очистить();
				РедактируемаяСтрока.НомераКонтейнеров = НомераКонтейнеров;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе	
		ТекД_Приемник.Накладная = ТекД_Источник.Накладная;
		ТекД_Приемник.НомерНакладной = ТекД_Источник.НомерНакладной;
		ТекД_Приемник.ТранспортныйДокумент = ПолучитьТД(ТекД_Источник.Накладная);
		
		МассивКТК = ПолучитьКонтейнерыИзЖДН(ТекД_Приемник.Накладная,ТекД_Приемник.ВагонСтрока);
		ТекД_Приемник.Контейнеры.Очистить();
		ТекД_Приемник.НомераКонтейнеров.Очистить();
		Для Каждого ДанныеКТК Из МассивКТК Цикл
			ТекД_Приемник.Контейнеры.Добавить(ДанныеКТК.Контейнер, ДанныеКТК.НомерКонтейнера);
			ТекД_Приемник.НомераКонтейнеров.Добавить(ДанныеКТК.НомерКонтейнера);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТД(Накладная)
	
	ТД = Документы.ТранспортныйДокумент.НайтиПоРеквизиту("НакладнаяЭТРАН",Накладная);
	
	Возврат ТД;
	
КонецФункции	
	
&НаКлиенте
Процедура ОчиститьСоответствие(Команда)
	
	ТекД = Элементы.ТаблицаВагоныНакладные.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекД.Накладная = ПредопределенноеЗначение("Документ.э_Накладная.ПустаяСсылка");
	ТекД.ТранспортныйДокумент = ПредопределенноеЗначение("Документ.ТранспортныйДокумент.ПустаяСсылка");
	ТекД.Контейнеры.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтейнерыИзЖДН(Накладная,ВагонСтрока)
	
	МассивКТК = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	               |	ТЕ.Ссылка КАК Контейнер
	               |ИЗ
	               |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	               |		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяКонтейнеры.Ссылка
	               |			И (ВЫБОР
	               |				КОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда <> 0
	               |					ТОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.НомерСтроки
	               |				ИНАЧЕ э_НакладнаяВагоны.НомерСтроки = 1
	               |			КОНЕЦ)
	               |ГДЕ
	               |	э_НакладнаяКонтейнеры.Ссылка = &Ссылка
	               |	И э_НакладнаяВагоны.НомерВагона = &НомерВагона";
	Запрос.УстановитьПараметр("Ссылка",Накладная);
	Запрос.УстановитьПараметр("НомерВагона",ВагонСтрока);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивКТК.Добавить(Новый Структура("НомерКонтейнера, Контейнер", Выборка.НомерКонтейнера, Выборка.Контейнер));
	КонецЦикла;
	
	Возврат МассивКТК;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВСделку(Команда)
	
	МассивСтруктур = Новый Массив;
	
	Для Каждого Стр Из ТаблицаВагоныНакладные Цикл
		
		Если ЗначениеЗаполнено(Стр.Накладная) Тогда
			
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("Вагон",Стр.Вагон);
			СтруктураОтвета.Вставить("Накладная",Стр.НомерНакладной);
			СтруктураОтвета.Вставить("ТранспортныйДокумент",Стр.ТранспортныйДокумент);
			СтруктураОтвета.Вставить("СписокКТК",Стр.Контейнеры);
			СтруктураОтвета.Вставить("НомераКонтейнеров", Стр.НомераКонтейнеров);
			
			МассивСтруктур.Добавить(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(МассивСтруктур);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозможныеНакладныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьСоответствиеВагонЖДН();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВагоныНакладныеПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ТаблицаВагоныНакладные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтрокиВагон = ТаблицаВагоныНакладные.НайтиСтроки(Новый Структура("Вагон", ТекДанные.Вагон));
	Если НайденныеСтрокиВагон.Количество() = 1 Тогда
		
		ТекДанные.Накладная = Неопределено;
		ТекДанные.НомерНакладной = "";
		ТекДанные.ТранспортныйДокумент = Неопределено;		
		ТекДанные.Контейнеры.Очистить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
