
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
	ДанныеИзСП = Ложь;
	Если Параметры.Свойство("ДанныеИзСП",ДанныеИзСП) Тогда 
		АвтоЗаголовок = Ложь;
		Заголовок = "Форма выбора строки состава поезда для связи"; 
		Элементы.ФормаПоказатьБезОтбора.Видимость = Истина;
		МассивСкрываемыхКолонок = СтрРазделить("ТЧУслуга,ТЧКоличество,ТЧСтавкаНДС,ТЧСуммаИтого,ТЧУчДокумент,ТЧЕстьПривязанныйРасход",","); 
		Для Каждого Стр Из МассивСкрываемыхКолонок Цикл 
			Элементы[Стр].Видимость = Ложь;	
		КонецЦикла;
		ФильтрСписокКТК = Параметры.Фильтр.СписокКТК;
		ФильтрСписокВагонов = Параметры.Фильтр.СписокВагонов; 
		// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
		// Было:
		//ФильтрСписокТД = Параметры.Фильтр.СписокТД; 
		//Стало:
		Для каждого СтрТД Из Параметры.Фильтр.СписокТД Цикл
			Если СтрТД.Значение.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
				ФильтрСписокКоносаментов.Добавить(СтрТД.Значение);
			Иначе	
			    ФильтрСписокТД.Добавить(СтрТД.Значение);
			КонецЕсли;
		КонецЦикла;
		// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
		Сделка = Параметры.Сделка;
	Иначе 
		МассивСкрываемыхКолонок = СтрРазделить("ТЧВидТранспортногоСообщения,ТЧТипКалькуляции,ТЧЕстьПривязанныйРасход",","); 
		Для Каждого Стр Из МассивСкрываемыхКолонок Цикл 
			Элементы[Стр].Видимость = Ложь;	
		КонецЦикла;
		Сделка = Параметры.Сделка;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		Если Параметры.Свойство("РежимДобавленияВозмещаемых") И Параметры.РежимДобавленияВозмещаемых = 2 Тогда
			ТолькоСтрокиКорректировок = Истина;
			Элементы.НадписьТолькоКорректировка.Заголовок = "Отображены только строки корректировок";
			Элементы.НадписьТолькоКорректировка.Видимость = Истина;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
	КонецЕсли;
	
	
	Если ФильтрСписокКТК.Количество() = 0 
		И ФильтрСписокВагонов.Количество() = 0 
		И ФильтрСписокТД.Количество() = 0 Тогда 
		ПоказатьБезОтбора = Истина;	
	КонецЕсли;
	Элементы.ФормаПоказатьБезОтбора.Пометка = ПоказатьБезОтбора;
	
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 19.04.2023
	ПриСозданииНаСервереФрагмент();
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 19.04.2023
	
	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 19.04.2023
&НаСервере
Процедура ПриСозданииНаСервереФрагмент()
		
	Запрос = Новый Запрос;	
	Если НЕ ДанныеИзСП Тогда
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаДоходы.Клиент КАК Клиент,
	               |	СделкаДоходы.Договор КАК Договор,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.Калькуляция КАК Калькуляция,
	               |	СделкаДоходы.ПСЦ КАК ПСЦ,
	               |	СделкаДоходы.РазмерКТК КАК РазмерКТК,
	               |	СделкаДоходы.ГУИД КАК ГУИД,
	               |	СделкаДоходы.УчДокумент КАК УчДокумент,
	               |	СделкаДоходы.СуммаИтого КАК СуммаИтого,
	               |	ВЫРАЗИТЬ(СделкаДоходыВагоны.Вагон КАК СТРОКА(1000)) КАК СписокВагонов,
	               |	ВЫРАЗИТЬ(СделкаДоходыКТК.КТК КАК СТРОКА(1000)) КАК СписокКТК,
	               |	ВЫРАЗИТЬ(СделкаДоходыТД.ТД КАК СТРОКА(1000)) КАК СписокТД,
	               |	СделкаДоходы.Количество КАК Количество,
	               |	СделкаДоходы.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыВагоны.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыВагоны.ГУИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыКТК.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыКТК.ГУИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыТД КАК СделкаДоходыТД
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыТД.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыТД.ГУИД
	               |ГДЕ
	               |	СделкаДоходы.Ссылка = &Сделка";
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		Если ТолькоСтрокиКорректировок Тогда
			Запрос.Текст = Запрос.Текст + " И СделкаДоходы.ГУИДИсправляемойСтроки <> """" ";
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ,
		|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК СписокКТК,
		|	СделкаСвязьУчетныхЕдиниц.Вагон КАК СписокВагонов,
		|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК СписокТД,
		|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
		//ДИТ Шевченко А.В. US 68330 ТА 69907 -начало
		|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		//ДИТ Шевченко А.В. US 68330 ТА 69907 -конец 
		// ДИТ ТА 71560 Сержантова А.С. Начало: 19.06.2023
		|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
		// ДИТ ТА 71560 Сержантова А.С. Конец: 19.06.2023
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.02.2023
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	СделкаСвязьУчетныхЕдиниц.Калькуляция.ТипКалькуляции КАК ТипКалькуляции
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.02.2023
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|ГДЕ                                         
		//Евросиб - АСуслов 12.01.2023 14:27:46 #63368
		//(
		|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
		//)
		//Евросиб - АСуслов 12.01.2023 14:27:48 #63368
		|	И  &ПоказатьВсеСтроки
		|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
		|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаСвязьУчетныхЕдиниц.Договор,
		|	СделкаСвязьУчетныхЕдиниц.Клиент,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.Протокол,
		|	СделкаСвязьУчетныхЕдиниц.РазмерКТК,
		//ДИТ Шевченко А.В. US 68330 ТА 69907 -начало
		|	СделкаСвязьУчетныхЕдиниц.ГУИД,
		//ДИТ Шевченко А.В. US 68330 ТА 69907 -конец 
		// ДИТ ТА 71560 Сержантова А.С. Начало: 19.06.2023
		|	СделкаСвязьУчетныхЕдиниц.Коносамент,
		// ДИТ ТА 71560 Сержантова А.С. Конец: 19.06.2023
		|	СделкаСвязьУчетныхЕдиниц.ЖДН,
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	СделкаСвязьУчетныхЕдиниц.Калькуляция,
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.02.2023
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения,
		|	СделкаСвязьУчетныхЕдиниц.Калькуляция.ТипКалькуляции";
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.02.2023
		
		Если ПоказатьБезОтбора Тогда
			Запрос.УстановитьПараметр("ПоказатьВсеСтроки",	Истина);	
		Иначе 
			ТекстУсловия = "";
			Если ФильтрСписокКТК.Количество() > 0 Тогда 
				ТекстУсловия = "СделкаСвязьУчетныхЕдиниц.Контейнер В (&Контейнер)"; 
				Запрос.УстановитьПараметр("Контейнер", ФильтрСписокКТК);
			КонецЕсли;	
			Если ФильтрСписокВагонов.Количество() > 0 Тогда 
				Если ТекстУсловия <> "" Тогда 
					ТекстУсловия = ТекстУсловия + " И ";	
				КонецЕсли; 
				ТекстУсловия = ТекстУсловия + "СделкаСвязьУчетныхЕдиниц.Вагон В (&Вагон)";
				Запрос.УстановитьПараметр("Вагон", ФильтрСписокВагонов);
			КонецЕсли;
			Если ФильтрСписокТД.Количество() > 0 Тогда 
				Если ТекстУсловия <> "" Тогда 
					ТекстУсловия = ТекстУсловия + " И ";	
				КонецЕсли; 
				ТекстУсловия = ТекстУсловия + "СделкаСвязьУчетныхЕдиниц.ЖДН В (&ЖДН)";
				Запрос.УстановитьПараметр("ЖДН", ФильтрСписокТД);
			КонецЕсли; 
			// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
			Если ФильтрСписокКоносаментов.Количество() > 0 Тогда 
				Если ТекстУсловия <> "" Тогда 
					ТекстУсловия = ТекстУсловия + " И ";	
				КонецЕсли; 
				ТекстУсловия = ТекстУсловия + "СделкаСвязьУчетныхЕдиниц.Коносамент В (&Коносаменты)";
				Запрос.УстановитьПараметр("Коносаменты", ФильтрСписокКоносаментов);
			КонецЕсли; 
			// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
			
			Если ТекстУсловия = "" Тогда 
				Запрос.УстановитьПараметр("ПоказатьВсеСтроки",	Истина);
			Иначе 
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПоказатьВсеСтроки", ТекстУсловия); 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022
	
	//Евросиб - АСуслов 12.01.2023 14:12:00 #63368
	//(
	Запрос.УстановитьПараметр("Сделка", Сделка);
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 01.03.2023
	// Было:
	//Ответ = Запрос.Выполнить().Выбрать(); 
	//Стало:
	РезультатЗапроса = Запрос.Выполнить();
	
	Ответ = РезультатЗапроса.Выбрать(); 
	ТЧ.Очистить();
	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 01.03.2023
	НомерСтроки = 0;
	//)
	//Евросиб - АСуслов 12.01.2023 14:12:02 #63368
	Пока Ответ.Следующий() Цикл
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		//Евросиб - АСуслов 12.01.2023 14:10:37 #63368
		//(                            
		НомерСтроки = НомерСтроки + 1;
		нСтр.НомерСтроки = НомерСтроки;
		//)
		//Евросиб - АСуслов 12.01.2023 14:11:13 #63368
	КонецЦикла;

КонецПроцедуры 
// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 19.04.2023

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ТЧВыбраноПриИзменении(Элемент)
	
	Для каждого Стр из ТЧ Цикл Стр.Выбрано = Ложь; КонецЦикла;
	Элементы.ТЧ.ТекущиеДанные.Выбрано = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЪ(Команда)
	
	Результат = неопределено;
	ВыбранныеСтроки = ТЧ.НайтиСтроки(Новый Структура("Выбрано", Истина));
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны строки для переноса");
		Возврат;
	КонецЕсли; 
	Для каждого Стр из ТЧ Цикл
		Если Стр.Выбрано Тогда
			// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 11.04.2023
			// Было:
			//Результат = Новый Структура("Клиент, Договор, Услуга, Калькуляция, ПСЦ, Количество, СписокКТК, СписокВагонов, СписокТД, СтавкаНДС, Себестоимость, СуммаИтого, ГУИДСтрокиДоходов",
			//Стр.Клиент, Стр.Договор, Стр.Услуга, Стр.Калькуляция, Стр.ПСЦ, Стр.Количество, Стр.СписокКТК, Стр.СписокВагонов, Стр.СписокТД, Стр.СтавкаНДС, Стр.СуммаИтого / ?(Стр.Количество = 0, 1, Стр.Количество), Стр.СуммаИтого, Стр.ГУИД
			//);
			//Стало:
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
			//Результат = Новый Структура("Клиент, Договор, Услуга, Калькуляция, ПСЦ, Количество, СписокКТК, СписокВагонов, СписокТД, СтавкаНДС, Себестоимость, СуммаИтого, ГУИДСтрокиДоходов,ВидТранспортногоСообщения,ТипКалькуляции");
			//ЗаполнитьЗначенияСвойств(Результат,Стр);
			//Результат.Вставить("Себестоимость",Стр.СуммаИтого / ?(Стр.Количество = 0, 1, Стр.Количество));
			//Результат.Вставить("ГУИДСтрокиДоходов",Стр.ГУИД);
			
			Результат = Новый Структура("Клиент, Договор, Калькуляция, ПСЦ, СписокКТК, СписокВагонов, СписокТД, ГУИДСтрокиДоходов,ВидТранспортногоСообщения,ТипКалькуляции");
			Если ДанныеИзСП Тогда
				ЗаполнитьЗначенияСвойств(Результат,Стр);
				Результат.Вставить("ГУИДСП",Стр.ГУИД);
			Иначе
				Результат.Вставить("Услуга");
				Результат.Вставить("СтавкаНДС");
				Результат.Вставить("СуммаИтого");
				Результат.Вставить("Количество",Стр.Количество);
				ЗаполнитьЗначенияСвойств(Результат,Стр);
				Результат.Вставить("Себестоимость",Стр.СуммаИтого / ?(Стр.Количество = 0, 1, Стр.Количество));
				Результат.Вставить("ГУИДСтрокиДоходов",Стр.ГУИД);
			КонецЕсли;
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец
			// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 11.04.2023
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 19.04.2023
&НаКлиенте
Процедура ПоказатьБезОтбора(Команда)
	ПоказатьБезОтбора = Не ПоказатьБезОтбора;
	Элементы.ФормаПоказатьБезОтбора.Пометка = ПоказатьБезОтбора;
	ПриСозданииНаСервереФрагмент();
КонецПроцедуры
// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 19.04.2023
