
&НаКлиенте
Процедура Перенести(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЗаполняемаяУслуга) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана «Заполняемая услуга»");
		Возврат;
	КонецЕсли; 
	СсылкаАктПостановки = Неопределено;
	
    //Евросиб СубботинВ #82679 18.06.2024 Начало
	Для Каждого Стр из Таб Цикл
		Если НЕ Стр.РасчитаннаяКонтрольнаяЦифра = Стр.ПользовательскаяКонтрольнаяЦифра Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для контейнера " + СокрЛП(Стр.ПрочитаннаяСтрока) 
			+ " ожидаемое контрольное число " + Стр.РасчитаннаяКонтрольнаяЦифра + ". Перенос отменен."); 
			Возврат
		КонецЕсли;
	КонецЦикла;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
	Результат = Новый Массив;
	Для каждого Стр из Таб Цикл
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ПоступлениеНоменклатура", 			ЗаполняемаяУслуга);
		ДанныеСтроки.Вставить("Содержание", 						Содержание);
		ДанныеСтроки.Вставить("ПоступлениеВагоны", 					Стр.Вагон);
		//Евросиб СубботинВ #82679 18.06.2024 Начало
		//ДанныеСтроки.Вставить("ПоступлениеКТК", 					Стр.КТК);  исходная 
		Если ЗначениеЗаполнено(Стр.КТК) Тогда
			Контейнер = Стр.КТК; 
		// Евросиб TA 89165 Рыбьяков К.А. 05.08.2024 ((
		//Иначе
		ИначеЕсли ЗначениеЗаполнено(Стр.ПрочитаннаяСтрока) Тогда
		// Евросиб Рыбьяков К.А. 05.08.2024 ))
			СозданныйКтк = СоздатьЧерезАктПостановки(Стр.ПрочитаннаяСтрока, СсылкаАктПостановки, Стр.РазмерКТК, Истина);
			Контейнер = СозданныйКтк.КТК;
			СсылкаАктПостановки = СозданныйКтк.АктПостановки;
		КонецЕсли;
		ДанныеСтроки.Вставить("ПоступлениеКТК", 					Контейнер);
		//Евросиб СубботинВ #82679 18.06.2024 Конец
		ДанныеСтроки.Вставить("ПоступлениеКоличество", 				1);
		ДанныеСтроки.Вставить("ПоступлениеЦена", 					Стр.Сумма);
		ДанныеСтроки.Вставить("ПоступлениеСумма", 					Стр.Сумма);
		ДанныеСтроки.Вставить("НачалоРасчета", 						Стр.НачалоРасчета);
		ДанныеСтроки.Вставить("ОкончаниеРасчета", 					Стр.ОкончаниеРасчета);
		ДанныеСтроки.Вставить("НачалоОказанияУслуги", 				Стр.НачалоОказанияУслуги);
		ДанныеСтроки.Вставить("ОкончаниеОказанияУслуги", 			Стр.ОкончаниеОказанияУслуги);
		ДанныеСтроки.Вставить("ПоступлениеСтавкаНДС", 				ПоступлениеСтавкаНДС);
		ДанныеСтроки.Вставить("ИдентификаторСтрокиПоступления",		ИдентификаторСтрокиПоступления);
		ДанныеСтроки.Вставить("СтанцияОтправления", 				Стр.СтанцияОтправления);
		ДанныеСтроки.Вставить("СтанцияНазначения", 					Стр.СтанцияНазначения);
		ДанныеСтроки.Вставить("ТранспортныйДокумент", 				Стр.ТранспортныйДокумент);
		ДанныеСтроки.Вставить("ПоступлениеСуммаПоСтроке", 			ПоступлениеСумма);
		ДанныеСтроки.Вставить("ПоступлениеСуммаНДСПоСтроке", 		ПоступлениеСуммаНДС);
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЪ(Команда)
	
	//Евросиб Каблов 27.06.2023 ( 64831 Перенес в серверную процедуру
	ПрочитатьСервер();
	//Евросиб Каблов 27.06.2023 )
	
КонецПроцедуры

//Евросиб Каблов 27.06.2023 64831
&НаСервере
Процедура ПрочитатьСервер()
	
	Сч = 2;
	Таб.Очистить();
	
	СсылкаАктаПостановки = неопределено;
	//Евросиб СубботинВ #82679 18.06.2024 Начало
	МассивСтрокБезРазмера = Новый Массив;
	МассивНовыхКТК = Новый Массив;
	МассивНовыхКТКБезРазмера = Новый Массив;
	МассивКткСИнформациейИзКарточки = Новый Массив;
	МассивКривыхРефКтк = Новый Массив;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
	
	//Евросиб Каблов 16.12.2024 ( #94192
	Если ПроверятьДоступныеТипыЛокацииНоменклатуры Тогда
		ДоступныеТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ЗаполняемаяУслуга);
		СтрокаДоступныеТипыЛокаций = СтрСоединить(ДоступныеТипыЛокаций, ", ");
		ПроверенныеСтанции = Новый Массив;
	КонецЕсли;
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	//Евросиб Каблов 16.12.2024 )
	
	ПрочСтрока = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	ПрочСтрока2 = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст;
	Пока ПрочСтрока <> "" ИЛИ ПрочСтрока2 <> "" Цикл
		НСтр = Таб.Добавить();
		нСтр.ИдентификаторСтроки = Новый УникальныйИдентификатор;  
		нСтр.Поступление = Поступление;
		нСтр.Номенклатура = ЗаполняемаяУслуга;  
		нСтр.НомерТранспортногоДокумента = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C4").Текст;
		Если ЗначениеЗаполнено(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст) Тогда
			НСтр.Вагон = НайтиВагон(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст) Тогда
			НСтр.КТК = РаботаСКонтейнерамиСервер.НайтиКТК(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст);
			//Евросиб СубботинВ #82679 18.06.2024 Начало
			НСтр.ПрочитаннаяСтрока = СокрЛП(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст);
			УказанныйТипоразмерКТК = СокрЛП(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").Текст);
						
			Если НСтр.КТК = Справочники.ТЕ.ПустаяСсылка() Тогда // ктк НОВЫЙ
				НовыйКтк = Истина;
				Если ЗначениеЗаполнено(УказанныйТипоразмерКТК) Тогда
					МассивНовыхКТК.Добавить(НСтр.ПрочитаннаяСтрока);
				Иначе
					МассивНовыхКТКБезРазмера.Добавить(НСтр.ПрочитаннаяСтрока);
				КонецЕсли;
				//Проверяем контрольные числа
				КонтрольнаяЦифра = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(НСтр.ПрочитаннаяСтрока, 4), Сред(НСтр.ПрочитаннаяСтрока, 5, 6));
				Нстр.РасчитаннаяКонтрольнаяЦифра = КонтрольнаяЦифра;
				Нстр.ПользовательскаяКонтрольнаяЦифра = Прав(НСтр.ПрочитаннаяСтрока, 1);
				Если СтрДлина(СокрЛП(НСтр.ПрочитаннаяСтрока)) <> 11  
					ИЛИ КонтрольнаяЦифра = "Неверно" 
					ИЛИ (СтрДлина(СокрЛП(НСтр.ПрочитаннаяСтрока)) = 11 И НЕ Число(Прав(НСтр.ПрочитаннаяСтрока, 1)) = Нстр.РасчитаннаяКонтрольнаяЦифра) Тогда
						ОбщегоНазначения.СообщитьПользователю("Для контейнера " + СокрЛП(НСтр.ПрочитаннаяСтрока) + " ожидаемое контрольное число " + Нстр.РасчитаннаяКонтрольнаяЦифра);
				   		ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").ЦветФона = WebЦвета.Розовый;
					Иначе
						Если ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").ЦветФона = WebЦвета.Розовый Тогда							
							ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").ЦветФона = WebЦвета.Белый;
						КонецЕсли;
				КонецЕсли;
				//КонецПроверки
			
			ИначеЕсли ЗначениеЗаполнено(НСтр.КТК) Тогда //КТК уже существует
				НовыйКтк = Ложь;
				РазмерКонтейнераИзКарточки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НСтр.КТК, "ТипТЕ");
				Если НЕ Строка(РазмерКонтейнераИзКарточки) = УказанныйТипоразмерКТК Тогда
					МассивКткСИнформациейИзКарточки.Добавить(НСтр.КТК);
				КонецЕсли;				
				НСтр.РазмерКТК = РазмерКонтейнераИзКарточки;
			КонецЕсли;
				
			Если НЕ ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
				Если ЗначениеЗаполнено(УказанныйТипоразмерКТК) Тогда
					Если РефрижераторныйКТК Тогда
						МассивКорректныхТипоразмеров = Новый Массив;
						МассивКорректныхТипоразмеров.Добавить("20");
						МассивКорректныхТипоразмеров.Добавить("40");
						МассивКорректныхТипоразмеров.Добавить("45");						
						МассивКорректныхТипоразмеров.Добавить("20RF");
						МассивКорректныхТипоразмеров.Добавить("40RFH");
						МассивКорректныхТипоразмеров.Добавить("45RFH");
						Если МассивКорректныхТипоразмеров.Найти(УказанныйТипоразмерКТК) = Неопределено Тогда
							НСтр.РазмерКТК = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
							НомерТекущейСтроки = Сч-1;					
							МассивКривыхРефКтк.Добавить(Строка(НомерТекущейСтроки));
							ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").ЦветФона = WebЦвета.Розовый;
							//Сообщить();		
						Иначе	
							НСтр.РазмерКТК = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(УказанныйТипоразмерКТК, РефрижераторныйКТК, НСтр.ПрочитаннаяСтрока).Тип;
							Если ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").ЦветФона = WebЦвета.Розовый Тогда
								ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").ЦветФона = WebЦвета.Белый;
							КонецЕсли;
						КонецЕсли;	
					Иначе
						НСтр.РазмерКТК = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(УказанныйТипоразмерКТК, , НСтр.ПрочитаннаяСтрока).Тип;
					КонецЕсли;
				Иначе
					Если Не НовыйКТК Тогда
						МассивСтрокБезРазмера.Добавить(НСтр.ПрочитаннаяСтрока);	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			            
            //Евросиб СубботинВ #82679 18.06.2024 Конец
			
			
		//Евросиб СубботинВ #82679 18.06.2024 Начало // убрал создание КТК при чтении таблицы
			//Если НЕ ЗначениеЗаполнено(НСтр.КТК) Тогда				
				//СтрКТК = СоздатьЧерезАктПостановки(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст, СсылкаАктаПостановки);  перенес и дополнил функционал на кнопку перенести
			//	СтрКТК = СоздатьЧерезАктПостановки(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст, СсылкаАктаПостановки, Истина); Перенести в доработку
			// 	НСтр.КТК = СтрКТК.КТК;
			//	НСтр.АктПостановки = СтрКТК.АктПостановки;
			//	СсылкаАктаПостановки = СтрКТК.АктПостановки;
			
			//КонецЕсли;
		//Евросиб СубботинВ #82679 18.06.2024 Конец

		КонецЕсли;
		//Евросиб Каблов 03.02.2020 ( Ticket#0185661
		//НСтр.Сумма = Число(ТЧ.Область("R"+Сч+"C8").Текст);
		СуммаСтрокой = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C9").Текст;
		Если ЗначениеЗаполнено(СуммаСтрокой) Тогда
			НСтр.Сумма = Число(СуммаСтрокой);
		КонецЕсли;
		//Евросиб Каблов 03.02.2020 )
		
		//НСтр.ТранспортныйДокумент 		= НайтиЖДНПоНомеру(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").Текст);
		//Евросиб Каблов 27.06.2023 ( 64831
		//НСтр.НачалоРасчета 				= РаспознатьДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C4").Текст);
		//НСтр.ОкончаниеРасчета 			= РаспознатьДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C5").Текст);
		//НСтр.НачалоОказанияУслуги 		= РаспознатьДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C6").Текст);
		//НСтр.ОкончаниеОказанияУслуги 	= РаспознатьДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C7").Текст);
		НСтр.НачалоРасчета 				= СтроковыеФункцииКлиентСервер.СтрокаВДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C5").Текст);
		НСтр.ОкончаниеРасчета 			= СтроковыеФункцииКлиентСервер.СтрокаВДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C6").Текст);
		НСтр.НачалоОказанияУслуги 		= СтроковыеФункцииКлиентСервер.СтрокаВДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C7").Текст);
		НСтр.ОкончаниеОказанияУслуги 	= СтроковыеФункцииКлиентСервер.СтрокаВДату(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C8").Текст);
		//Евросиб - АСуслов 13.12.2020 18:35:31 #
		//(
		СтанцияОтправленияСтрокой = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C10").Текст;
		СтанцияНазначенияСтрокой  = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C11").Текст;
		Если ЗначениеЗаполнено(СтанцияОтправленияСтрокой) Тогда
			НСтр.СтанцияОтправления 		= Локации_сервер.НайтиСтанциюПоНеполномуКоду(СтанцияОтправленияСтрокой);
			
			Если НЕ ЗначениеЗаполнено(НСтр.СтанцияОтправления) Тогда
				НСтр.СтанцияОтправления = Справочники_Локации_НайтиПоНаименованию(СтанцияОтправленияСтрокой); //Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияОтправленияСтрокой, Ложь, Ложь);
			КонецЕсли;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтанцияНазначенияСтрокой) Тогда
			
			НСтр.СтанцияНазначения = Локации_сервер.НайтиСтанциюПоНеполномуКоду(СтанцияНазначенияСтрокой);
			
			Если НЕ ЗначениеЗаполнено(НСтр.СтанцияНазначения) Тогда
				НСтр.СтанцияНазначения = Справочники_Локации_НайтиПоНаименованию(СтанцияНазначенияСтрокой); //Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияНазначенияСтрокой, Ложь, Ложь);
			КонецЕсли;
			
		КонецЕсли; 
		//)
		//Евросиб - АСуслов 13.12.2020 18:35:32 #
		
		//Евросиб Каблов 16.12.2024 ( #94192
		Если ЗначениеЗаполнено(ДоступныеТипыЛокаций) Тогда
			Если ЗначениеЗаполнено(НСтр.СтанцияОтправления) И ПроверенныеСтанции.Найти(НСтр.СтанцияОтправления) = Неопределено Тогда
				Если ДоступныеТипыЛокаций.Найти(НСтр.СтанцияОтправления.Тип) = Неопределено Тогда
					ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %2", НСтр.СтанцияОтправления, СтрокаДоступныеТипыЛокаций);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					НСтр.СтанцияОтправления = ЛокацияПустаяСсылка;
				КонецЕсли;
				ПроверенныеСтанции.Добавить(НСтр.СтанцияОтправления);
			КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.СтанцияНазначения) И ПроверенныеСтанции.Найти(НСтр.СтанцияНазначения) = Неопределено Тогда
				Если ДоступныеТипыЛокаций.Найти(НСтр.СтанцияНазначения.Тип) = Неопределено Тогда
					ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %2", НСтр.СтанцияНазначения, СтрокаДоступныеТипыЛокаций);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					НСтр.СтанцияНазначения = ЛокацияПустаяСсылка;
				КонецЕсли;
				ПроверенныеСтанции.Добавить(НСтр.СтанцияОтправления);
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 16.12.2024 )
		
		//Евросиб Каблов 27.06.2023 ( 64831
		КодРейса = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C12").Текст;
		Если ЗначениеЗаполнено(КодРейса) Тогда
			НСтр.Рейс = Справочники.РейсыЖД.НайтиПоКоду(КодРейса);
		КонецЕсли;
		
		ДатаОтправленияКПСтрокой = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C13").Текст;
		Если ЗначениеЗаполнено(ДатаОтправленияКПСтрокой) Тогда
			НСтр.ДатаОтправленияКП = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаОтправленияКПСтрокой);
		КонецЕсли;		
		//Евросиб Каблов 27.06.2023 )
		
		Сч = Сч + 1;
		ПрочСтрока = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
		ПрочСтрока2 = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст;
	КонецЦикла;
	//Евросиб СубботинВ #82679 18.06.2024 Начало 
	Если МассивСтрокБезРазмера.Количество() > 0 Тогда 
		ОбщегоНазначения.СообщитьПользователю("Отсутствует информация «Размер КТК» для " + СтрСоединить(МассивСтрокБезРазмера, ", ") + "  
											  |При наличии информации о размерности заполните поле «Размер КТК»");
	КонецЕсли;
	Если МассивНовыхКТК.Количество() > 0 Тогда 
		ОбщегоНазначения.СообщитьПользователю("Введены новые КТК " +  СтрСоединить(МассивНовыхКТК, ", "));
	КонецЕсли;
	Если МассивНовыхКТКБезРазмера.Количество() > 0 Тогда 
		ОбщегоНазначения.СообщитьПользователю("Введены новые КТК " +  СтрСоединить(МассивНовыхКТКБезРазмера, ", ") + " При наличии информации о размерности заполните поле «Размер КТК");
	КонецЕсли;
	Если МассивКткСИнформациейИзКарточки.Количество() > 0 Тогда
		Склонение = ПолучитьСклоненияСтрокиПоЧислу("Контейнер", МассивКткСИнформациейИзКарточки.Количество(),,"ЧС=Количественное", "ПД=Родительный",)[0];
	    ОбщегоНазначения.СообщитьПользователю("Введенные данные о типоразмере " 
		+ Склонение + ": " + СтрСоединить(МассивКткСИнформациейИзКарточки, ", ") + " «Размер КТК» не соответствуют имеющимся в карточке контейнера. 
														  |В область прочитанных данных внесен типоразмер из карточки контейнера"); 
	КонецЕсли;
	Если МассивКривыхРефКтк.Количество() > 0 Тогда
		Склонение = ПолучитьСклоненияСтрокиПоЧислу("Контейнер", МассивКткСИнформациейИзКарточки.Количество(),,"ЧС=Количественное", "ПД=Предложный",)[0];
		ОбщегоНазначения.СообщитьПользователю("Указанный в строке  " + СтрСоединить(МассивКривыхРефКтк, ", ") + " тип не соответствует типу рефрижераторного контейнера. Измените тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");
	КонецЕсли;
	      
    //Евросиб СубботинВ #82679 18.06.2024 Конец 
	
	ЗаполнитьТранспортныеДокументыНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТранспортныеДокументыНаСервере()
	ПараметрыЗаполнения = Новый Структура("Режим, ТаблицаДанных", "ПроизвольнаяТаблица", Таб);
	ТранспортныеДокументы_сервер.ЗаполнитьТранспортныеДокументы(ПараметрыЗаполнения);
КонецПроцедуры


&НаСервереБезКонтекста
Функция Справочники_Локации_НайтиПоНаименованию(ПолноеНаименование)
	Возврат справочники.Локации.НайтиПоНаименованию(ПолноеНаименование, Истина);
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВагон(НомерВагона) 
	
	Возврат Справочники.ТС.НайтиПоНаименованию(СокрЛП(НомерВагона));
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиЖДНПоНомеру(НомерЖДН) 
	
	Результат = неопределено;
	Если НЕ ЗначениеЗаполнено(НомерЖДН) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	НЕ ТранспортныйДокумент.ПометкаУдаления
	               |	И ТранспортныйДокумент.НомерТранспортногоДокумента = &НомерТранспортногоДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Дата УБЫВ";
	Запрос.УстановитьПараметр("НомерТранспортногоДокумента", НомерЖДН);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РаспознатьДату(ИсхДата)
	
	Результат = неопределено;
	
	Если СтрДлина(ИсхДата) = 10 Тогда
		
		Результат = Дата(Прав(ИсхДата, 4) + Сред(ИсхДата, 4, 2) + Лев(ИсхДата, 2));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьЧерезАктПостановки(НомерКТК, СсылкаАктаПостановки, ТипоразмерКТК, ДопСвойствоДляПризнакаВЭксплуатации = Ложь) //добавил ТипоразмерКТК и ДопСвойствоДляПризнакаВЭксплуатации (описан в теле процедуры) 
	
	Результат = Новый Структура("КТК, АктПостановки");
	
	//Евросиб СубботинВ #82679 18.06.2024 Начало подправил алгоритм получения объекта и ссылки
	
	//АктПостановки = Документы.АктПостановкиСнятияСУчета.СоздатьДокумент();
	//
	//Если ЗначениеЗаполнено(СсылкаАктаПостановки) Тогда
	//	АктПостановки = СсылкаАктаПостановки.ПолучитьОбъект();
	//Иначе
	//	АктПостановки.Дата = ТекущаяДата();
	//	АктПостановки.Записать(РежимЗаписиДокумента.Запись);
	//	СсылкаАктаПостановки = АктПостановки.Ссылка;
	//КонецЕсли;
		
	Если ЗначениеЗаполнено(СсылкаАктаПостановки) Тогда
    	АктПостановки = СсылкаАктаПостановки.ПолучитьОбъект();
	Иначе
		АктПостановки = Документы.АктПостановкиСнятияСУчета.СоздатьДокумент();
		АктПостановки.Дата = ТекущаяДата();
		СсылкаАктаПостановки = АктПостановки.ПолучитьСсылкуНового();
		АктПостановки.УстановитьСсылкуНового(СсылкаАктаПостановки);
	КонецЕсли;
    
	Результат.АктПостановки = АктПостановки.Ссылка;
	//Евросиб СубботинВ #82679 18.06.2024 Конец

	//Евросиб СубботинВ #82679 18.06.2024 Начало
	Если ДопСвойствоДляПризнакаВЭксплуатации Тогда 
		// при создании ящиков из акцепта не должен проставляться признак эксплуатации
		АктПостановки.ДополнительныеСвойства.Вставить("ПроставлениеВПризнакаЭксплуатацииПриСозданииКТК", ДопСвойствоДляПризнакаВЭксплуатации);
	КонецЕсли;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
	
	КТКНайден = Ложь;
	Для Каждого Стр из АктПостановки.РегистрацияНовыхКонтейнеров Цикл
		Если Стр.НомерКонтейнера = НомерКТК Тогда 
			КТКНайден = Истина; 
			Результат.КТК = Стр.КонтейнерСсылка;
			//Евросиб СубботинВ #82679 18.06.2024 Начало
			Если Не ЗначениеЗаполнено(Стр.ТипКонтейнера) Тогда
				Стр.ТипКонтейнера = ТипоразмерКТК;
			КонецЕсли;
			//Евросиб СубботинВ #82679 18.06.2024 Конец
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	Если НЕ КТКНайден Тогда
		НСтр = АктПостановки.РегистрацияНовыхКонтейнеров.Добавить();
		НСтр.НомерКонтейнера = НомерКТК;
		//Евросиб СубботинВ #82679 18.06.2024 Начало
        НСтр.ТипКонтейнера = ТипоразмерКТК; 
		//Евросиб СубботинВ #82679 18.06.2024 Конец

		НСтр.ДатаВводаВЭксплуатацию = ТекущаяДата();
		АктПостановки.записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Для Каждого Стр из АктПостановки.РегистрацияНовыхКонтейнеров Цикл
		Если Стр.НомерКонтейнера = НомерКТК Тогда 
			Результат.КТК = Стр.КонтейнерСсылка; 
			Прервать; 
		КонецЕсли;
	КонецЦикла;

	Попытка
		АктПостановки.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Ошибка: " + ОО);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыНоменклатуры = Неопределено;
	Если Параметры.Свойство("АдресТаблицыНоменклатуры", АдресТаблицыНоменклатуры) Тогда
		ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(АдресТаблицыНоменклатуры);
		Элементы.ЗаполняемаяУслуга.СписокВыбора.ЗагрузитьЗначения(ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
		Элементы.ЗаполняемаяУслуга.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элементы.ЗаполняемаяУслуга.КнопкаСоздания = Ложь;
	КонецЕсли;
	
	Параметры.Свойство("Поступление", Поступление);
	
	НоменклатураФрахт = Константы.УслугаФрахтаДляКалькуляции.Получить();
	
	//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, начало
	КонтейнерыИВагоны = Новый Структура;
	Если Параметры.Свойство("КонтейнерыИВагоны", КонтейнерыИВагоны) Тогда
		РежимВставкиКомментариевВДиалог = Истина;
		Элементы.Группа3.Видимость = Ложь;
		Элементы.Таб.Видимость = Ложь;
		ЗаполнитьКонтейнерыИВагоныВТЧ(КонтейнерыИВагоны);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, конец

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, начало
	Если РежимВставкиКомментариевВДиалог Тогда
		Команда = ЭтаФорма.Элементы.Добавить("ПеренестиКомментарии", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
		Команда.Заголовок	= "Перенести комментарии";
		Команда.ИмяКоманды  = "ПеренестиКомментарии";
	//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, конец
	Иначе
		//Евросиб СубботинВ #82679 18.06.2024 Начало сделал програмно. чтобы кнопка добавлялась в конец командной панели после инструкций
		Команда = ЭтаФорма.Элементы.Добавить("ПрочитатьЪ", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
		Команда.Заголовок	= "Прочитать";
		Команда.ИмяКоманды  = "ПрочитатьЪ";
		//Евросиб СубботинВ #82679 18.06.2024 Конец
	КонецЕсли;
	
	//Евросиб Каблов 16.12.2024 ( #94192
	ПроверятьДоступныеТипыЛокацииНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПроверятьДоступныеТипыЛокацииНоменклатуры", Ложь);
    //Евросиб Каблов 16.12.2024 )
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, начало
&НаСервере
Процедура ЗаполнитьКонтейнерыИВагоныВТЧ(КонтейнерыИВагоны)
	Для сч = 1 По 13 Цикл
		ТЧ.Область("R1C"+сч).Текст = "";
	КонецЦикла;
	ТЧ.Область("R1C1").Текст = "Вагон";
	ТЧ.Область("R1C2").Текст = "Контейнер";
	ТЧ.Область("R1C3").Текст = "Комментарий";
	СчетчикСтрок = 2;
	Для Каждого ТекВагон Из КонтейнерыИВагоны.Вагоны Цикл
		ТЧ.Область("R"+СчетчикСтрок+"C1").Текст = Строка(ТекВагон);
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;
	Для Каждого ТекКонтейнер Из КонтейнерыИВагоны.Контейнеры Цикл
		ТЧ.Область("R"+СчетчикСтрок+"C2").Текст = Строка(ТекКонтейнер);
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, конец

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ЗаполняемаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Поступление) Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораСтрокиПоступления", ЭтаФорма);
		ОткрытьФорму("Документ.Акцепт.Форма.ФормаВыбораСтрокиУслугиПоступления", Новый Структура("Поступление", Поступление), ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Элемент.СписокВыбора.Количество() > 0 Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Элемент.СписокВыбора;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтрокиПоступления(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат.Свойство("СтавкаНДС", ПоступлениеСтавкаНДС);
		Результат.Свойство("ГУИДПТУ", ИдентификаторСтрокиПоступления);
		Результат.Свойство("Номенклатура", ЗаполняемаяУслуга);
		Результат.Свойство("Содержание", Содержание);
		Результат.Свойство("Всего", ПоступлениеСумма);
		Результат.Свойство("СуммаНДС", ПоступлениеСуммаНДС);
		ЗаполняемаяУслугаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполняемаяУслугаПриИзменении(Элемент)
	Если ЗаполняемаяУслуга = НоменклатураФрахт Тогда
		ТЧ.Область("R1C4").Текст = "Коносамент";
	Иначе
		ТЧ.Область("R1C4").Текст = "Номер ЖДН";
	КонецЕсли;
	
	//Евросиб Каблов 16.12.2024 ( #94192
	Если ПроверятьДоступныеТипыЛокацииНоменклатуры Тогда
		ВыполнитьПроверкуВыбранныхСтанцийПоДоступнымТипомЛокацийНоменклатуры();
	КонецЕсли;
	//Евросиб Каблов 16.12.2024 )
	
КонецПроцедуры

//Евросиб Каблов 16.12.2024 ( #94192
Процедура ВыполнитьПроверкуВыбранныхСтанцийПоДоступнымТипомЛокацийНоменклатуры()
	
	ДоступныеТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ЗаполняемаяУслуга);
	СтрокаДоступныеТипыЛокаций = СтрСоединить(ДоступныеТипыЛокаций, ", ");
	ПроверенныеСтанции = Новый Массив;	
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДоступныеТипыЛокаций) Тогда
		Для Каждого НСтр Из Таб Цикл
			Если ЗначениеЗаполнено(НСтр.СтанцияОтправления) И ПроверенныеСтанции.Найти(НСтр.СтанцияОтправления) = Неопределено Тогда
				Если ДоступныеТипыЛокаций.Найти(НСтр.СтанцияОтправления.Тип) = Неопределено Тогда
					ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %2", НСтр.СтанцияОтправления, СтрокаДоступныеТипыЛокаций);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					НСтр.СтанцияОтправления = ЛокацияПустаяСсылка;
				КонецЕсли;
				ПроверенныеСтанции.Добавить(НСтр.СтанцияОтправления);
			КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.СтанцияНазначения) И ПроверенныеСтанции.Найти(НСтр.СтанцияНазначения) = Неопределено Тогда
				Если ДоступныеТипыЛокаций.Найти(НСтр.СтанцияНазначения.Тип) = Неопределено Тогда
					ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %2", НСтр.СтанцияНазначения, СтрокаДоступныеТипыЛокаций);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					НСтр.СтанцияНазначения = ЛокацияПустаяСсылка;
				КонецЕсли;
				ПроверенныеСтанции.Добавить(НСтр.СтанцияНазначения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб Каблов 16.12.2024 )

//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, начало
&НаКлиенте
Процедура ПеренестиКомментарии(Команда)
	
	СтрокаРезультат = "";
	
	СчетчикСтрок = 2;
	СтрокаВагон = ТЧ.Область("R"+Формат(СчетчикСтрок, "ЧГ=0")+"C1").Текст;
	СтрокаКонтейнер = ТЧ.Область("R"+Формат(СчетчикСтрок, "ЧГ=0")+"C2").Текст;
	
	Пока СтрокаВагон <> "" ИЛИ СтрокаКонтейнер <> "" Цикл
		
		СтрокаКомментарий = ТЧ.Область("R"+Формат(СчетчикСтрок, "ЧГ=0")+"C3").Текст;
		
		Если СтрокаКомментарий <> "" Тогда
			Если СтрокаВагон <> "" Тогда
				СтрокаРезультат = СтрокаРезультат + СтрокаВагон + " - " + СтрокаКомментарий + Символы.ПС;
			КонецЕсли;
			Если СтрокаКонтейнер <> "" Тогда
				СтрокаРезультат = СтрокаРезультат + СтрокаКонтейнер + " - " + СтрокаКомментарий + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
		
		СчетчикСтрок = СчетчикСтрок + 1;
		СтрокаВагон = ТЧ.Область("R"+Формат(СчетчикСтрок, "ЧГ=0")+"C1").Текст;
		СтрокаКонтейнер = ТЧ.Область("R"+Формат(СчетчикСтрок, "ЧГ=0")+"C2").Текст;
	КонецЦикла;
	
	Закрыть(СтрокаРезультат);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 91053 / TA 91139, 05-09-2024, конец

&НаКлиенте
Процедура ТабСтанцияОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	//Евросиб Каблов 16.12.2024 ( #94192
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ПроверятьДоступныеТипыЛокацииНоменклатуры Тогда
		ТекДанные = Элементы.Таб.ТекущиеДанные;
		
		СтрокаДоступныеТипы = Неопределено;
		СтрокаТипЛокации = Неопределено;
		ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Номенклатура, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
		Если ЛокацияСоответствуетУслуге Тогда
			ТекДанные.СтанцияНазначения = ВыбранноеЗначение;
		Иначе
			СтандартнаяОбработка = Ложь;
			ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %3", ВыбранноеЗначение, СтрокаДоступныеТипы);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 16.12.2024 )
	
КонецПроцедуры

&НаКлиенте
Процедура ТабСтанцияНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	//Евросиб Каблов 16.12.2024 ( #94192
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверятьДоступныеТипыЛокацииНоменклатуры Тогда
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		
		СтрокаДоступныеТипы = Неопределено;
		СтрокаТипЛокации = Неопределено;
		ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Номенклатура, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
		Если ЛокацияСоответствуетУслуге Тогда
			ТекДанные.СтанцияНазначения = ВыбранноеЗначение;
		Иначе
			СтандартнаяОбработка = Ложь;
			ТекстСообщения = СтрШаблон("Станция %1 не соответствует доступным типам локаций услуги. Доступные типы локаций: %2", ВыбранноеЗначение, СтрокаДоступныеТипы);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 16.12.2024 )
	
КонецПроцедуры

