
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Код = Параметры.ТекстЗаполнения;
	КонецЕсли;
	
	НовыйЭлементОтбора = История.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код");
	НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение = Объект.Код;

	ГодностьВагона = ПолучитьГодностьВагона();
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ЗагрузитьИзЭТРАН(Команда)
	Если Не ЗначениеЗаполнено(Объект.Код) Тогда 
		ПоказатьПредупреждение(,"Не заполнено поле ""Номер вагона""");
	Иначе
		Если НетЗапущеныхРанееЗаданий("ЗагрузитьИзЭТРАННаСервере") Тогда
			Сообщить("Начало загрузки данных по вагону");
			ЗагрузитьИзЭТРАННаСервере();
			Подключаемый_ПроверитьВыполнениеЗадания();
			ЗаполнитьРодВагона();
		Иначе
			Сообщить("Дождитесь завершения предыдущего вызова");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРодВагона();

	Если не ЗначениеЗаполнено(Объект.РодВагона) Тогда  		
		Объект.РодВагона = Справочники.э_РодаВагоновДляНакладных.НайтиПоРеквизиту("КодРодаВагона",Объект.РодВагонаКод); 			
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ТипВагона) и ЗначениеЗаполнено(Объект.РодВагона) Тогда  		
		Объект.ТипВагона = Справочники.э_ТипыВагонов.НайтиПоКоду(Объект.РодВагона.КодТипаВагоновДляСправочникаВМТП);			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.МодельВагона) Тогда
		Объект.МодельВагона = Справочники.э_МоделиВагонов.НайтиПоНаименованию(Объект.МодельВагонаНаименование);
	КонецЕсли;
	
КонецПроцедуры
	
	
&НаСервере
Функция ЗагрузитьИзЭТРАННаСервере()
	
	СписокРеквизитовОбъекта = Новый Структура;
	Для Каждого Реквизит из Метаданные.Справочники.э_Вагоны.Реквизиты Цикл
		СписокРеквизитовОбъекта.Вставить(Реквизит.Имя);	
	КонецЦикла;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ЗагрузитьДанныеПоВагонуИзЭтран";
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузить данные по вагону из этран.'");
	
	МассивВагонов = Новый Массив;
	МассивВагонов.Добавить(Объект.Код);
	
	ПараметрыПроцедуры = Новый Структура("НомераВагонов, СписокРеквизитовОбъекта", МассивВагонов, СписокРеквизитовОбъекта);
		
	
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.ЗагрузитьДанныеПоВагонуИзЭтран", ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
		
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДополнительныеПараметры = "")
	Попытка
		Если РезультатДлительнойОперации.Статус = "Выполнено" Или ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда
			РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
			Если РезультатВыполнения = Неопределено Тогда 
				Сообщить("Загрузка данных по вагону завершена");
				ПоказатьПредупреждение(,"Данные не были загружены");
			Иначе
				ЗаполнитьЗначенияСвойств(Объект, РезультатВыполнения);
				Объект.Арендатор   = ПолучитьАрендатораСобственника(РезультатВыполнения.АрендаторИД);
				Объект.Собственник = ПолучитьАрендатораСобственника(РезультатВыполнения.СобственникИД); 
				Модифицированность = Истина;
				Сообщить("Загрузка данных по вагону завершена");
			КонецЕсли;
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.Интервал = 1;
			ДлительныеОперацииКлиент.э_ОжидатьЗавершение(РезультатДлительнойОперации, Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект),ПараметрыОжидания);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьАрендатораСобственника(ИдСобственника)
	
	   Возврат Справочники.э_СобственникиАрендаторыВагонов.НайтиПоКоду(ИдСобственника);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
 КонецФункции

&НаСервере
Функция НетЗапущеныхРанееЗаданий(КлючПоискаФоновогоЗадания)
	
	Если КлючПоискаФоновогоЗадания = "ЗагрузитьИзЭТРАННаСервере" Тогда 
		КлючФоновогоЗадания = "ЗагрузитьДанныеПоВагонамИзЭтран";
		Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно)).Количество() > 0 Тогда 
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервере
Функция ПолучитьГодностьВагона()
	
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ВМТП_ДислокацияСрезПоследних.ГодностьВагона КАК ГодностьВагона
	 |ИЗ
	 |	РегистрСведений.ВМТП_Дислокация.СрезПоследних(&ДатаЗапроса, ) КАК ВМТП_ДислокацияСрезПоследних
	 |ГДЕ
	 |	ВМТП_ДислокацияСрезПоследних.НомерВагона = &НомерВагона";
	 
	 Запрос.УстановитьПараметр("НомерВагона",Объект.Код);
	 Запрос.УстановитьПараметр("ДатаЗапроса",ТекущаяДата());

	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	 Возврат Выборка.ГодностьВагона; 
	 
	 КонецЦикла;
	 
	
КонецФункции

