//Евросиб СубботинВ #104841 07.05.2025 начало //	
Процедура УдалитьЗадачиПоОбъекту(СсылкаНаОбъект)Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    ЗадачаИсполнителя.Ссылка
	|ИЗ
	|    Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|    ЗадачаИсполнителя.ОбъектЗадачи = &ОбъектЗадачи";
	
	Запрос.УстановитьПараметр("ОбъектЗадачи", СсылкаНаОбъект);				
	Результат = Запрос.Выполнить();				
	ВыборкаДетальныеЗаписи = Результат.Выбрать();					
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектЗадача = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  
		ОбъектЗадача.Удалить();
	КонецЦикла;
	
КонецПроцедуры
//Евросиб СубботинВ #104841 07.05.2025 Конец //	