
Процедура ОповещениеПользователейОСдвигахСроков() Экспорт
	
	ЕстьВагонВНазн = 0;
	
	// 1. выбираем все отправки, у которых дата прибытия должна была быть ВЧЕРА 
	// (т.к. регламент срабатывает каждый час, нет смысла брать диапазон больше)
	// 2. берем срез последних по этим вагоно по дислокации с максимальным периодом
	// 3. берем из дислокации станцию операции и станцию назначения по данным из п.2
	// 4. нужно взять не только станции из справочника Локации, но и их синонимы. 
	// если ст. операции и ст. назначения совпали, то вагон прибыл.
	// 5. берем максимальное значение по полю "Прибытие" в пределах одной отправик. 
	// Если хотя бы по одному вагону из отправки было прибытие, то остальные вагоны не интересуют, считаем, что отправка прибыла
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВагоныВОтправке.Отправка КАК Отправка,
	               |	ВагоныВОтправке.Вагон КАК Вагон
	               |ПОМЕСТИТЬ СписокВагоновВОтпр
	               |ИЗ
	               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	               |ГДЕ
	               |	ВагоныВОтправке.Отправка.ДатаПрибытия <= НАЧАЛОПЕРИОДА(&ДатаКон,ДЕНЬ)
	               |	И НЕ ВагоныВОтправке.Отправка.РейсОтменен
	               |	И НЕ ВагоныВОтправке.Отправка.ПометкаУдаления
	               |	И ВагоныВОтправке.Отправка.ДатаПрибытия >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаКон, ДЕНЬ, -ВагоныВОтправке.Вагон.ТипТС.КоличествоСутокРазгрузки), ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ПОМЕСТИТЬ МаксПериодДисл
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
	               |			,
	               |			Вагон В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					СписокВагоновВОтпр.Вагон
	               |				ИЗ
	               |					СписокВагоновВОтпр КАК СписокВагоновВОтпр)) КАК ДислокацияВагоновСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагоновСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.Период КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
	               |	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения
	               |ПОМЕСТИТЬ ТекДислокация
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксПериодДисл КАК МаксПериодДисл
	               |		ПО ДислокацияВагоновСрезПоследних.Период = МаксПериодДисл.Период
	               |			И ДислокацияВагоновСрезПоследних.Вагон = МаксПериодДисл.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛокацииТаблицаСинонимов.Ссылка = ЛокацииТаблицаСинонимов1.Ссылка
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Прибытие,
	               |	ТекДислокация.Вагон КАК Вагон,
	               |	ЛокацииТаблицаСинонимов1.Ссылка КАК СтанцияНазначения,
	               |	ЛокацииТаблицаСинонимов.Ссылка КАК СтанцияОперации,
	               |	СписокВагоновВОтпр.Отправка КАК Отправка
	               |ПОМЕСТИТЬ ПрибытиеВагонов
	               |ИЗ
	               |	ТекДислокация КАК ТекДислокация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |		ПО (ТекДислокация.СтанцияОперации = ЛокацииТаблицаСинонимов.Ссылка
	               |				ИЛИ ТекДислокация.СтанцияОперации.Наименование ПОДОБНО ЛокацииТаблицаСинонимов.СинонимЛокации)
	               |			И (ТекДислокация.СтанцияНазначения = ЛокацииТаблицаСинонимов.Ссылка
	               |				ИЛИ ТекДислокация.СтанцияНазначения.Наименование ПОДОБНО ЛокацииТаблицаСинонимов.СинонимЛокации)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокВагоновВОтпр КАК СписокВагоновВОтпр
	               |		ПО ТекДислокация.Вагон = СписокВагоновВОтпр.Вагон,
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ПрибытиеВагонов.Прибытие) КАК Прибытие,
	               |	ПрибытиеВагонов.Отправка КАК Отправка
	               |ИЗ
	               |	ПрибытиеВагонов КАК ПрибытиеВагонов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПрибытиеВагонов.Отправка
	               |
	               |ИМЕЮЩИЕ
	               |	МАКСИМУМ(ПрибытиеВагонов.Прибытие) = 0";
	//Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ТекущаяДата()-3600*24));
	Запрос.УстановитьПараметр("ДатаКон",ТекущаяДата()-3600*24);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// для всех отправок без прибытия
	Для Каждого Стр Из ТЗ Цикл
		
		// у текущих отправок сместить срок прибытия на текущую дату
		ПолучОб = Стр.Отправка.ПолучитьОбъект();
		ПолучОб.ДатаПрибытия = КонецДня(ТекущаяДата());
		ПолучОб.Записать();
		
		// добавить в состояния последующих отправок информацию о возможности сдвигов сроков
		СледОтправки = Отправки_сервер.ПолучитьМассивДочернихОтправок(Стр.Отправка);
		Для каждого СлОтпр из СледОтправки Цикл
			СтатусЛогиста = Справочники.Состояния.ВозможенСдвигСроковПредыдущегоРейса;
			
			СписокОтветственных = ПолучитьОтветственныхПриПереносахРейсов();
			
			ГруппаЛогиста = СписокОтветственных.ОтветственныйЗаПереназначениеВагонов;
			
			ПолучОб = СлОтпр.ПолучитьОбъект();
			
			НСтр = ПолучОб.Состояния.Добавить();
			НСтр.Состояние = СтатусЛогиста;
			НСтр.Исполнитель = ГруппаЛогиста;
			НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НСтр.НормативИсполненияСМоментаСоздания = 2;
			
			ПолучОб.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОтветственныхПриПереносахРейсов()
	
	Возврат Новый Структура("ОтветственныйЗаПереносЗаявокКлиентов, ОтветственныйЗаПереназначениеВагонов", Константы.ОтменаРейсаОтветственныеЗаПереносЗаявокКлиентов.Получить(), Константы.ОтменаРейсаОтветственныеЗаПереназначениеВагонов.Получить());
	
КонецФункции

Процедура ПроверкаПрибытияВагонов() Экспорт
	
	ОповещениеПользователейОСдвигахСроков();
	
КонецПроцедуры

