
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПараметров = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокПараметров", Неопределено);
	Если ЗначениеЗаполнено(СписокПараметров) Тогда
		Для Каждого Параметр Из СписокПараметров Цикл
			Стр = Список.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Параметр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СписокПараметров = Новый Массив;
	Для Каждого Стр Из Список Цикл
		СписокПараметров.Добавить(Новый Структура("ИмяПараметра, ЗначениеПараметра", Стр.ИмяПараметра, Стр.ЗначениеПараметра));
	КонецЦикла;
	
	Закрыть(СписокПараметров);
	
КонецПроцедуры
