Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КП";
	КомандаПечати.Представление = "Коммерческое предложение";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КП") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КП", "Коммерческое предложение", НапечататьКП_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документы.Калькуляция.ПФ_MXL_КоммерческоеПредложение");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КП", "Коммерческое предложение", НапечататьКП_ПоПростомуБезЭтихВашихБСП(ЭлМассива),,"Документы.Калькуляция.ПФ_MXL_КоммерческоеПредложение");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НапечататьКП_ПоПростомуБезЭтихВашихБСП(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;	
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	//////////////////////////////////
	
	//Макет = Документы.Калькуляция.ПолучитьМакет("ПФ_MXL_КоммерческоеПредложение2");
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Калькуляция.ПФ_MXL_КоммерческоеПредложение2", Документ.Контрагент, Документ.Договор);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	НомерВарианта = 1;
	
	Если Документ.кп2_ПоказыватьВремяВПути = Истина И Документ.кп2_ПоказыватьКоличествоКТК = Ложь Тогда
		НомерВарианта = 2;
	ИначеЕсли Документ.кп2_ПоказыватьВремяВПути = Ложь И Документ.кп2_ПоказыватьКоличествоКТК = Истина Тогда
		НомерВарианта = 3;
	ИначеЕсли Документ.кп2_ПоказыватьВремяВПути = Ложь И Документ.кп2_ПоказыватьКоличествоКТК = Ложь Тогда
		НомерВарианта = 4;
	КонецЕсли;
	
	ОбластьШапкаВ = Макет.ПолучитьОбласть("ШапкаВ"+НомерВарианта);
	ОбластьСтрокаВ = Макет.ПолучитьОбласть("СтрокаВ"+НомерВарианта);
	
	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	
	ОбластьДогУслуги = Макет.ПолучитьОбласть("ДогУслуги");
	
	ОбластьПодвал2 = Макет.ПолучитьОбласть("Подвал2");
	
	ОбластьДопУслуги1 = Макет.ПолучитьОбласть("ДопУслуги1");
	ОбластьДопУслуги2 = Макет.ПолучитьОбласть("ДопУслуги2");
	
	ОбластьПодвал3 = Макет.ПолучитьОбласть("Подвал3");
	
	//////////////////////////////////
	
	Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
		ОбластьШапка.Параметры.ПолноеНаименованиеКонтрагента = Документ.Контрагент.НаименованиеПолное;
	КонецЕсли;
	
	ОбластьШапка.Параметры.НачалоДействияКП = Формат(Документ.НачалоДействия, "ДФ=dd.MM.yyyy");
	Если Документ.кп2_УказыватьДатуОкончанияКП Тогда
		ОбластьШапка.Параметры.КонецДействияКП = "до " + Формат(Документ.ОкончаниеДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Документ.ТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд Тогда
		ОбластьШапка.Параметры.ОпциональноеДополнение = "в составе ускоренного контейнерного поезда";
	КонецЕсли;
	
	ОбластьШапка.Параметры.ВидСервиса = ?(Документ.ПС_ВидПеревозки = Справочники.ВидыПеревозок.Внутрироссийская, "внутригосударственном (внутрироссийском)", "международном");
	
//Евросиб ( Литвинов 21.01.2021 #30025
	ОбластьШапка.Параметры.НаименованиеПолное = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Документ.Организация.ГоловнаяОрганизация), Документ.Организация.ГоловнаяОрганизация, Документ.Организация), Документ.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаВ);
	Для каждого Стр из Документ.КП2_СоставУслуг Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаВ.Параметры, Стр);
		ТабличныйДокумент.Вывести(ОбластьСтрокаВ);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал1);
	Для каждого Стр из Документ.КП2_ДоговорнаяЦенаВключает Цикл
		ОбластьДогУслуги.Параметры.УслугаДогЦены = Стр.Составляющая;
		ТабличныйДокумент.Вывести(ОбластьДогУслуги);
	КонецЦикла;
	
	Если Документ.КП2_ДоговорнаяЦенаНЕВключает.Количество() > 0 Тогда
		ОбластьДогУслугиНеВключает = Макет.ПолучитьОбласть("ДогУслугиНеВключает");
		ОбластьПодвалНеВключает = Макет.ПолучитьОбласть("ПодвалНеВключает");
		ТабличныйДокумент.Вывести(ОбластьПодвалНеВключает);
		Для каждого Стр из Документ.КП2_ДоговорнаяЦенаНЕВключает Цикл
			ОбластьДогУслугиНеВключает.Параметры.УслугаДогНеВключает = Стр.Составляющая;
			ТабличныйДокумент.Вывести(ОбластьДогУслугиНеВключает);
		КонецЦикла;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал2);
	Для каждого Стр из Документ.КП2_ДополнительныеУслуги Цикл
		Если Стр.ОтобразитьСТочкой Тогда
			ОбластьДопУслуги1.Параметры.УслугаДопЗаголовок = Стр.Составляющая;
			ТабличныйДокумент.Вывести(ОбластьДопУслуги1);
		Иначе
			ОбластьДопУслуги2.Параметры.УслугаДопТекст = Стр.Составляющая;
			ТабличныйДокумент.Вывести(ОбластьДопУслуги2);
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьПодвал3.Параметры.ПрименениеСтавкиНДС = ?(Документ.кп2_СтавкиНДСВСоответствииСЗаконодательством, "НДС в соответствии с законодательством РФ", "Все ставки указаны с учетом НДС " + Документ.СтавкаНДС);
	
	ОбластьПодвал3.Параметры.Валюта = Документ.Валюта;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал3);
	
	ОбластьГруппаМенеджеров1 = Макет.ПолучитьОбласть("ГруппаМенеджеров1");
	
	ТекСекцияМенеджер = 0;
	
	Для Сч = 0 по Документ.КП2_ГруппаМенеджеров.Количество()-1 Цикл
		
		ТекСекцияМенеджер = Сч % 3 + 1;
		
		ОбластьГруппаМенеджеров1.Параметры["ФИО"+ТекСекцияМенеджер] = Документ.КП2_ГруппаМенеджеров[Сч].ФИО;
		ОбластьГруппаМенеджеров1.Параметры["Должность"+ТекСекцияМенеджер] = Документ.КП2_ГруппаМенеджеров[Сч].Должность;
		ОбластьГруппаМенеджеров1.Параметры["Телефон"+ТекСекцияМенеджер] = Документ.КП2_ГруппаМенеджеров[Сч].Телефон;
		ОбластьГруппаМенеджеров1.Параметры["Моб"+ТекСекцияМенеджер] = Документ.КП2_ГруппаМенеджеров[Сч].Мобильный;
		ОбластьГруппаМенеджеров1.Параметры["Почта"+ТекСекцияМенеджер] = Документ.КП2_ГруппаМенеджеров[Сч].ЭлПочта;
		
		Если ТекСекцияМенеджер = 3 Тогда
			ТабличныйДокумент.Вывести(ОбластьГруппаМенеджеров1);
			ОбластьГруппаМенеджеров1 = Макет.ПолучитьОбласть("ГруппаМенеджеров1");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекСекцияМенеджер > 0 И ТекСекцияМенеджер < 3 Тогда
		ТабличныйДокумент.Вывести(ОбластьГруппаМенеджеров1);
	КонецЕсли;
	
	
	
	
	
	
	
	
	
	////Первый = Истина;
	////Для каждого Документ из МассивОбъектов Цикл	
	////	Если Не Первый Тогда ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
	//	ОбластьМакета = Макет.ПолучитьОбласть("Логотип");
	//	Если ЗначениеЗаполнено(Документ.Организация.ФайлЛоготип) Тогда
	//		ДанныеКартинкиЛоготип = РаботаСФайлами.ДанныеФайла(Документ.Организация.ФайлЛоготип);
	//		ДвоичныеДанныеЛоготип = ПолучитьИзВременногоХранилища(ДанныеКартинкиЛоготип.СсылкаНаДвоичныеДанныеФайла);
	//		Если ЗначениеЗаполнено(ДвоичныеДанныеЛоготип) Тогда
	//			ОбластьМакета.Рисунки.ЛоготипОрганизации.Картинка = Новый Картинка(ДвоичныеДанныеЛоготип);
	//		КонецЕсли;
	//	КонецЕсли;
	//	ТабличныйДокумент.Вывести(ОбластьМакета);

	//	////Область1//////
	//	ОбластьМакета = Макет.ПолучитьОбласть("Область1");
	//	ОбластьМакета.Параметры.ОрганизацияНазвКраткое = Документ.Организация.НаименованиеПолное;
	//	ОбластьМакета.Параметры.ЧислоМесяцГод = Формат(Документ.ДатаОтправкиСервиса,"ДЛФ=DD");
	//	ОбластьМакета.Параметры.ПунктОтправления = Документ.Суша_ПунктОтправления; 
	//	ОбластьМакета.Параметры.ПунктНазначения =  Документ.Суша_ПунктНазначения;
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	////Область2///// Местные условия перевозки
	//	ОбластьМакета = Макет.ПолучитьОбласть("Область2");
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("ЭкспортнаяОтправка", Ложь);
	//	
	//	МассивУсловийМестные = Документ.ОписаниеПеревозки.НайтиСтроки(ПараметрыОтбора);
	//	
	//	Если МассивУсловийМестные.Количество()>0 Тогда
	//		ОбластьМакета.Параметры.СтанцияОтправления = Документ.Суша_ПунктОтправления; 
	//		ОбластьМакета.Параметры.СтанцияНазначения = Документ.Суша_ПунктНазначения;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		/////Область3////
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Область3");
	//		Для каждого ЭлементМассива  из МассивУсловийМестные Цикл
	//			ОбластьМакета.Параметры.УсловияПеревозки = ЭлементМассива.УсловияПеревозки;
	//			ОбластьМакета.Параметры.Ставка1 = ЭлементМассива.Тариф20;
	//			ОбластьМакета.Параметры.Ставка2 = ЭлементМассива.Тариф24;
	//			ОбластьМакета.Параметры.Ставка3 = ЭлементМассива.Тариф40;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		КонецЦикла;
	//	КонецЕсли;	 
	//	
	//	////Область4/////
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Область4");
	//	ОбластьМакета.Параметры.НДССтавка = " с учетом НДС " + Документ.СтавкаНДС;
	//	
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	///// Описание услуг/////
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.Заголовок = "Договорная цена включает:";
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ТекстБлока");
	//	ТекстБлока = "";
	//	МассивУслугТарифа = Документ.СписокУслугТарифа.НайтиСтроки(ПараметрыОтбора);
	//	Если МассивУслугТарифа.Количество()>0 Тогда
	//		Для каждого ЭлементМассива из МассивУслугТарифа Цикл
	//			ТекстБлока = ТекстБлока+"		*"+" "+ЭлементМассива.НаименованиеУслуги + Символы.ПС;
	//		КонецЦикла;
	//	КонецЕсли;
	//	ОбластьМакета.Параметры.ТекстБлока = ТекстБлока;		
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.Заголовок = "Дополнительные услуги по запросу:";
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ТекстБлока");
	//	
	//	МассивДопУслуг = Документ.ДополнительныеУслуги.НайтиСтроки(ПараметрыОтбора);
	//	ТекстБлока = "";
	//	Если МассивДопУслуг.Количество()>0 Тогда
	//		Для Каждого ЭлементМассива из МассивДопУслуг Цикл
	//			ТекстБлока = ТекстБлока+"		*"+" "+ЭлементМассива.НаименованиеУслуги + Символы.ПС;
	//		КонецЦикла;
	//	КонецЕсли;
	//	ОбластьМакета.Параметры.ТекстБлока = ТекстБлока;
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	////Область2///// Экспортные условия перевозки
	//	ОбластьМакета = Макет.ПолучитьОбласть("Область2");
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("ЭкспортнаяОтправка", Истина);
	//	
	//	МассивУсловийМестные = Документ.ОписаниеПеревозки.НайтиСтроки(ПараметрыОтбора);
	//	
	//	Если МассивУсловийМестные.Количество()>0 Тогда
	//		ОбластьМакета.Параметры.СтанцияОтправления = Документ.Суша_ПунктОтправления; 
	//		ОбластьМакета.Параметры.СтанцияНазначения = Документ.Суша_ПунктНазначения;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		/////Область3////
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Область3");
	//		Для каждого ЭлементМассива  из МассивУсловийМестные Цикл
	//			ОбластьМакета.Параметры.УсловияПеревозки = ЭлементМассива.УсловияПеревозки;
	//			ОбластьМакета.Параметры.Ставка1 = ЭлементМассива.Тариф20;
	//			ОбластьМакета.Параметры.Ставка2 = ЭлементМассива.Тариф24;
	//			ОбластьМакета.Параметры.Ставка3 = ЭлементМассива.Тариф40;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		КонецЦикла;
	//	КонецЕсли;	 
	//	
	//	////Область4/////
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Область4");
	//	ОбластьМакета.Параметры.НДССтавка = ", НДС в соответствии с законодательством";
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	///// Описание услуг/////
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.Заголовок = "Договорная цена включает:";
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ТекстБлока");
	//	ТекстБлока = "";
	//	МассивУслугТарифа = Документ.СписокУслугТарифа.НайтиСтроки(ПараметрыОтбора);
	//	Если МассивУслугТарифа.Количество()>0 Тогда
	//		Для каждого ЭлементМассива из МассивУслугТарифа Цикл
	//			ТекстБлока = ТекстБлока+"		*"+" "+ЭлементМассива.НаименованиеУслуги + Символы.ПС;
	//		КонецЦикла;
	//	КонецЕсли;
	//	ОбластьМакета.Параметры.ТекстБлока = ТекстБлока;		
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.Заголовок = "Дополнительные услуги по запросу:";
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ТекстБлока");
	//	
	//	МассивДопУслуг = Документ.ДополнительныеУслуги.НайтиСтроки(ПараметрыОтбора);
	//	ТекстБлока = "";
	//	Если МассивДопУслуг.Количество()>0 Тогда
	//		Для Каждого ЭлементМассива из МассивДопУслуг Цикл
	//			ТекстБлока = ТекстБлока+"		*"+" "+ЭлементМассива.НаименованиеУслуги + Символы.ПС;
	//		КонецЦикла;
	//	КонецЕсли;
	//	ОбластьМакета.Параметры.ТекстБлока = ТекстБлока;
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	/////Подвал  /////
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Коммент3");
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКонтакты");
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьКонтакты");
	//	ОбластьМакета.Параметры.ФИОКонтакт1 = Документ.ОтветственныйМенеджер.НаименованиеДляПечатиВРП;
	//	ОбластьМакета.Параметры.ДолжностьКонтакт1 = Документ.ДолжностьМенеджера;
	//	СтруктураКонтакта = ПолучитьДанныеКонтактногоЛица(Документ.ОтветственныйМенеджер);
	//	ОбластьМакета.Параметры.НомерТелКонтакт1 = СтруктураКонтакта.Телефон;
	//	//ОбластьМакета.Параметры.МобТелКонтакт1
	//	ОбластьМакета.Параметры.ЭлПочтаКонтакт1 = СтруктураКонтакта.Майл;
	//	
	//	ОбластьМакета.Параметры.ФИОКонтакт2 = Документ.ОтветственныйРуководитель.НаименованиеДляПечатиВРП;
	//	ОбластьМакета.Параметры.ДолжностьКонтакт2 = Документ.ДолжностьРуководителя;
	//	СтруктураКонтакта = ПолучитьДанныеКонтактногоЛица(Документ.ОтветственныйРуководитель);
	//	ОбластьМакета.Параметры.НомерТелКонтакт2 = СтруктураКонтакта.Телефон;
	//	// ОбластьМакета.Параметры.МобТелКонтакт2
	//	ОбластьМакета.Параметры.ЭлПочтаКонтакт2 = СтруктураКонтакта.Майл;
	//	
	//			Если ЗначениеЗаполнено(Документ.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
	//				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Документ.ДоверенностьЗаРуководителя.ФайлФаксимиль);
	//				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
	//					ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если ЗначениеЗаполнено(Документ.ДоверенностьЗаРуководителя.ФайлПечать) тогда
	//				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Документ.ДоверенностьЗаРуководителя.ФайлПечать);
	//				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
	//					ОбластьМакета.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
	//				КонецЕсли;
	//			КонецЕсли;
	//	
	//	ТабличныйДОкумент.Вывести(ОбластьМакета);		 
		
//	КонецЦикла;	
	
	//Результат = Новый ТабличныйДокумент;
	
	//Макет = Документы.ПСЦ.ПолучитьМакет("ПФ_MXL_ПротоколОдноязычный");
	//Первый = Истина;
	//Для каждого Док из МассивОбъектов Цикл
	//	
	//	Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ДанныеРуководителяКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	//	               |	ДанныеРуководителяКонтрагентовСрезПоследних.Руководитель КАК Руководитель,
	//	               |	ДанныеРуководителяКонтрагентовСрезПоследних.Должность КАК Должность,
	//	               |	ДанныеРуководителяКонтрагентовСрезПоследних.НаОсновании КАК НаОсновании,
	//	               |	ДанныеРуководителяКонтрагентовСрезПоследних.ФИОВРодительномПадеже КАК ФИОВРодительномПадеже
	//	               |ИЗ
	//	               |	РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК ДанныеРуководителяКонтрагентовСрезПоследних";
	//	Запрос.УстановитьПараметр("Период", );
	//	Запрос.УстановитьПараметр("Контрагент", );
	//	
	//	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	//	ОбластьШапка.Параметры.ПолноеНаименование = Док.Организация.НаименованиеПолное;
	//	ОбластьШапка.Параметры.КраткоеНаименование = Док.Организация.НаименованиеСокращенное;
	//	ОбластьШапка.Параметры.ДолжностьРуководителя = "";
	//	ОбластьШапка.Параметры.ФИОРуководителя = Док.Руководитель.НаименованиеДляПечатиВРП;
	//	ОбластьШапка.Параметры.ОснованиеРуководителя = "";
	//	ОбластьШапка.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
	//	ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование;
	//	ОбластьШапка.Параметры.ДолжностьРукКлиента = "";
	//	ОбластьШапка.Параметры.ФИОРукКлиента = "" ;
	//	ОбластьШапка.Параметры.ОснованиеКлиента = "";
	//	
	//	
	//	Результат.Вывести(ОбластьШапка);
	//	
	//	Первый = Ложь;
	//	
	//КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция ПолучитьДанныеКонтактногоЛица(ФизЛицо)
	СтруктураДанных = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛицаКонтактнаяИнформация.Тип КАК Тип,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	                      |ГДЕ
	                      |	ФизическиеЛицаКонтактнаяИнформация.Ссылка.Ссылка = &ФизЛицо");
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Результат = Запрос.Выполнить().Выгрузить();
	Тел = Результат.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон, "Тип");
	Если Тел <> Неопределено Тогда
		СтруктураДанных.Вставить("Телефон", Тел.Представление);
	Иначе
		СтруктураДанных.Вставить("Телефон", "");
	КонецЕсли;
	Майл = Результат.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
	Если Майл <> Неопределено Тогда
		СтруктураДанных.Вставить("Майл", Майл.Представление);
	Иначе
		СтруктураДанных.Вставить("Майл", "");
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции

Функция ПолучитьПринадлежностьRT(ПринадлежностьПС) Экспорт
	Если ПринадлежностьПС = Перечисления.ПринадлежностьПС.ОбщийПарк Тогда
		ПринадлежностьТС_RT = 1;
	ИначеЕсли ПринадлежностьПС = Перечисления.ПринадлежностьПС.Собственный Тогда 
		ПринадлежностьТС_RT = 2;
	ИначеЕсли ПринадлежностьПС = Перечисления.ПринадлежностьПС.Арендованный Тогда 
		ПринадлежностьТС_RT = 3;
	ИначеЕсли ПринадлежностьПС = Перечисления.ПринадлежностьПС.ПривлеченныйРЖД Тогда 
		ПринадлежностьТС_RT = 7;
	КонецЕсли; 
	Возврат ПринадлежностьТС_RT;
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Суша_ПунктОтправления");
	Поля.Добавить("Суша_ПунктНазначения");	
	Поля.Добавить("Комментарий");	
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = "" + "Калькуляция " + СокрЛП(Данные.Комментарий) + " " + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy") + " (" + Данные.Суша_ПунктОтправления + " - " + Данные.Суша_ПунктНазначения + ")";
	
КонецПроцедуры

Функция КалькуляцияНаходитсяВСогласованномПСЦ(Калькуляция) Экспорт
	
	Результат = неопределено;
	СтатусДокумента = Новый Массив;
	СтатусДокумента.Добавить(Перечисления.СтатусыСогласования.Подписано);
	СтатусДокумента.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
//	СтатусДокумента.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	               |	ПСЦКалькуляции.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	               |ГДЕ
	               |	ПСЦКалькуляции.Калькуляция = &Калькуляция
	               |	И ПСЦКалькуляции.Ссылка.Проведен
	               |	И ПСЦКалькуляции.Ссылка.СтатусДокумента В(&СтатусДокумента)";
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	Запрос.УстановитьПараметр("СтатусДокумента", СтатусДокумента);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМаршрутизацияДействующегоКлиента(Объект) Экспорт
	ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	Если ТипЗнч(Объект.КалькуляцияСозданаНаОсновании) = Тип("ДокументСсылка.Калькуляция") Тогда
		Если Объект.КалькуляцияСозданаНаОсновании.Шаблон Тогда 
			Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
				Если Объект.Контрагент<>Объект.КалькуляцияСозданаНаОсновании.Контрагент Тогда
					//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
					ЭтоМаршрутизацияДействующегоКлиента = Ложь;
				Иначе
					Если ПроверитьИзменениеМодальности(Объект) Тогда
						//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
						ЭтоМаршрутизацияДействующегоКлиента = Ложь;
					ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
						//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
						ЭтоМаршрутизацияДействующегоКлиента = Истина;
					ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
						//СтандартнаяМаршрутизация = "Калькуляция нового клиента"; 
						ЭтоМаршрутизацияДействующегоКлиента = Ложь;
					Иначе
						//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
						ЭтоМаршрутизацияДействующегоКлиента = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
				Если ПроверитьИзменениеМодальности(Объект) Тогда
					//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
					ЭтоМаршрутизацияДействующегоКлиента = Ложь;
				ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
					//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
					ЭтоМаршрутизацияДействующегоКлиента = Истина;
				ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
					//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
					ЭтоМаршрутизацияДействующегоКлиента = Ложь;
				Иначе
					//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
					ЭтоМаршрутизацияДействующегоКлиента = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
			ЭтоМаршрутизацияДействующегоКлиента = Ложь;
		КонецЕсли;
	Иначе
		//СтандартнаяМаршрутизация = "Стандарт";
		ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	КонецЕсли;
	
	Возврат ЭтоМаршрутизацияДействующегоКлиента;
КонецФункции

Функция ПроверитьИзменениеМодальности(Объект)
	ИзмененоБулево = Ложь;
	Если Объект.ММ_КоличествоВагонов <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоВагонов
		ИЛИ Объект.ММ_КоличествоКТК <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоКТК
		ИЛИ Объект.ММ_СтавкаПредоставленияПлатформы <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияПлатформы
		ИЛИ Объект.ММ_КоличествоКТКНаВагон <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоКТКНаВагон
		ИЛИ Объект.ММ_ГруженыйПоСуше <> Объект.КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоСуше
		ИЛИ Объект.ММ_СтавкаПредоставленияКТК20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК20
		ИЛИ Объект.ММ_СтавкаПредоставленияКТК40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК40
		ИЛИ Объект.ЕдиницаИзмерения <> Объект.КалькуляцияСозданаНаОсновании.ЕдиницаИзмерения
		ИЛИ Объект.ЖД_РасчетСебестоимостиДляТипаФГП <> Объект.КалькуляцияСозданаНаОсновании.ЖД_РасчетСебестоимостиДляТипаФГП
		ИЛИ Объект.Груз <> Объект.КалькуляцияСозданаНаОсновании.Груз
		ИЛИ Объект.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.СтавкаНДС
		ИЛИ Объект.СуммаВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.СуммаВключаетНДС
		ИЛИ Объект.веб_ДляКТКЕвросиб <> Объект.КалькуляцияСозданаНаОсновании.веб_ДляКТКЕвросиб
		ИЛИ Объект.веб_ДляКТККлиента <> Объект.КалькуляцияСозданаНаОсновании.веб_ДляКТККлиента
		ИЛИ Объект.СпециальныеУсловия <> Объект.КалькуляцияСозданаНаОсновании.СпециальныеУсловия
		ИЛИ Объект.УсловияПримененияСтавки <> Объект.КалькуляцияСозданаНаОсновании.УсловияПримененияСтавки
		ИЛИ Объект.ТипЗаказа <> Объект.КалькуляцияСозданаНаОсновании.ТипЗаказа
		ИЛИ Объект.Суша_ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.Суша_ПунктОтправления
		ИЛИ Объект.УсловияПеревозки_Отправление <> Объект.КалькуляцияСозданаНаОсновании.УсловияПеревозки_Отправление
		ИЛИ Объект.Суша_ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.Суша_ПунктНазначения
		ИЛИ Объект.УсловияПеревозки_Прибытие <> Объект.КалькуляцияСозданаНаОсновании.УсловияПеревозки_Прибытие
		ИЛИ Объект.ЖД_ПринадлежностьПС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ПринадлежностьПС
		ИЛИ Объект.ПС_ВидПеревозки <> Объект.КалькуляцияСозданаНаОсновании.ПС_ВидПеревозки
		ИЛИ Объект.ТерриторияМаршрута <> Объект.КалькуляцияСозданаНаОсновании.ТерриторияМаршрута
		//ИЛИ ММ_Вознаграждение <> КалькуляцияСозданаНаОсновании.ММ_Вознаграждение
		//ИЛИ ММ_Вознаграждение40 <> КалькуляцияСозданаНаОсновании.ММ_Вознаграждение40
		ИЛИ Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС
		ИЛИ Объект.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС
		ИЛИ Объект.ЖД_СредняяЗагрузкаПлатформ <> Объект.КалькуляцияСозданаНаОсновании.ЖД_СредняяЗагрузкаПлатформ
		ИЛИ Объект.ЖД_СреднийПроцентСороковок <> Объект.КалькуляцияСозданаНаОсновании.ЖД_СреднийПроцентСороковок
		ИЛИ Объект.ММ_ГруженыйПоМорю <> Объект.КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоМорю
		ИЛИ Объект.ММ_ДействиеСтавокНа <> Объект.КалькуляцияСозданаНаОсновании.ММ_ДействиеСтавокНа
		ИЛИ Объект.Море_УсловияПогрузки <> Объект.КалькуляцияСозданаНаОсновании.Море_УсловияПогрузки
		ИЛИ Объект.Море_УсловияВыгрузки <> Объект.КалькуляцияСозданаНаОсновании.Море_УсловияВыгрузки
		// Евросиб US 87896 TA 91708 Рыбьяков К.А. 16.09.2024 ((
		//ИЛИ Объект.ММ_ПортОтправления  <> Объект.КалькуляцияСозданаНаОсновании.ММ_ПортОтправления 
		// Евросиб Рыбьяков К.А. 16.09.2024 ))
		Тогда
		ИзмененоБулево = Истина;
	КонецЕсли;
	
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияЖДСоставляющей Цикл
			Если Строка.Операция <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Операция
				ИЛИ Строка.Пробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Пробег 
				ИЛИ Строка.ДлительностьДней <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ДлительностьДней 
				ИЛИ Строка.СчПробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СчПробег 
				ИЛИ Строка.Стоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Стоимость 
				ИЛИ Строка.НДС <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].НДС 
				ИЛИ Строка.СтоимостьИтого <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтоимостьИтого 
				ИЛИ Строка.СтанцияОтправления <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияОтправления 
				ИЛИ Строка.СтанцияНазначения <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияНазначения 
				ИЛИ Строка.Груз <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Груз 
				ИЛИ Строка.ТипВагона <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ТипВагона 
				ИЛИ Строка.ПринадлежностьВагона <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ПринадлежностьВагона Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияКТКСоставляющей Цикл
			Если Строка.Пробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Пробег
				ИЛИ Строка.ДлительностьДней <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].ДлительностьДней
				ИЛИ Строка.СчПробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].СчПробег
				ИЛИ Строка.Операция <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Операция Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если Строка.Услуга <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Услуга
				ИЛИ Строка.Затраты <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Затраты
				ИЛИ Строка.ВыставляемаяУслуга <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВыставляемаяУслуга
				ИЛИ Строка.Поставщик <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Поставщик
				ИЛИ Строка.Договор <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Договор
				ИЛИ Строка.Тариф20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф20
				ИЛИ Строка.Тариф40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф40
				ИЛИ Строка.ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктОтправления
				ИЛИ Строка.ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктНазначения
				ИЛИ Строка.Цена20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена20
				ИЛИ Строка.Цена40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена40
				ИЛИ Строка.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаНДС
				ИЛИ Строка.НДСВключенВСтоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НДСВключенВСтоимость
				ИЛИ Строка.НормативныйПроцентВознаграждения20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения20
				ИЛИ Строка.НормативныйПроцентВознаграждения40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения40
				ИЛИ Строка.Вознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение20
				ИЛИ Строка.Вознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение40
				ИЛИ Строка.СуммаВознаграждения20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения20
				ИЛИ Строка.СуммаВознаграждения40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения40
				ИЛИ Строка.Итого20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого20
				ИЛИ Строка.Итого40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого40
				ИЛИ Строка.СтавкаМаксимальная20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная20
				ИЛИ Строка.СтавкаМаксимальная40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная40
				ИЛИ Строка.СуммаНДС20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС20
				ИЛИ Строка.СуммаНДС40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС40
				ИЛИ Строка.Валюта <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Валюта
				ИЛИ Строка.ВнутренняяСебестоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВнутренняяСебестоимость
				ИЛИ Строка.Возмещаемая <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Возмещаемая
				ИЛИ Строка.ПодсылПорожних <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПодсылПорожних
				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
				ИЛИ Строка.Примечание20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание20
				ИЛИ Строка.Примечание40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание40
				ИЛИ Строка.ГруппаУслуг <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ГруппаУслуг
				ИЛИ Строка.ОсновнаяУслугаГруппы <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ОсновнаяУслугаГруппы Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.НФ_ПортыОтправленияНазначения Цикл
			Если Строка.Порт <> Объект.КалькуляцияСозданаНаОсновании.НФ_ПортыОтправленияНазначения[Строка.НомерСтроки-1].Порт Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.НФ_Линии Цикл
			Если Строка.Линия <> Объект.КалькуляцияСозданаНаОсновании.НФ_Линии[Строка.НомерСтроки-1].Линия Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзмененоБулево Тогда
		Для каждого Строка из Объект.ЖД_УслугиВнеСтавки Цикл
			Если Строка.Услуга <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Услуга
				ИЛИ Строка.ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктОтправления
				ИЛИ Строка.ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктНазначения
				ИЛИ Строка.ВидРасходов <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВидРасходов
				ИЛИ Строка.Валюта <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Валюта
				ИЛИ Строка.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДС
				ИЛИ Строка.СуммаВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СуммаВключаетНДС
				ИЛИ Строка.СтавкаМаксимальная <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаМаксимальная
				ИЛИ Строка.Тариф20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф20
				ИЛИ Строка.ПроцентВознаграждения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПроцентВознаграждения
				ИЛИ Строка.СтавкаНДСВознаграждения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДСВознаграждения
				ИЛИ Строка.ВознаграждениеВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВознаграждениеВключаетНДС
				ИЛИ Строка.БазаДляРасчетаВР <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].БазаДляРасчетаВР
				ИЛИ Строка.Себестоимость20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость20
				ИЛИ Строка.НормВознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение20
				ИЛИ Строка.Вознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение20
				ИЛИ Строка.Ставка20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка20
				ИЛИ Строка.Себестоимость40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость40
				ИЛИ Строка.НормВознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение40
				ИЛИ Строка.Вознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение40
				ИЛИ Строка.Ставка40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка40
				ИЛИ Строка.Поставщик <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Поставщик
				ИЛИ Строка.Договор <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Договор
				ИЛИ Строка.Тариф40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф40
				ИЛИ Строка.ТипСтавки <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ТипСтавки
				ИЛИ Строка.ВключатьВПФПСЦ <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВключатьВПФПСЦ
				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
				ИЛИ Строка.ОснованиеДляВыставления <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ОснованиеДляВыставления Тогда
				ИзмененоБулево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИзмененоБулево;
КонецФункции
//-- Зубов 03.08.2021 37315
Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	ПроцДоходности = 0;
	Если Объект.ММ_ИтогоРентабельность <> 0 Тогда
		ПроцДоходности = Объект.ММ_ИтогоРентабельность;
	КонецЕсли;
	Если Объект.ММ_ИтогоРентабельность20 <> 0 И Объект.ММ_ИтогоРентабельность20 < Объект.ММ_ИтогоРентабельность Тогда
		ПроцДоходности = Объект.ММ_ИтогоРентабельность20;
	КонецЕсли;
	
	////++ Зубов 03.08.2021 37315
	//Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании) Тогда
	//	НовМаршрутизация = СтандартнаяМаршрутизацияНаСервере();
	//Иначе
	//	НовМаршрутизация = "Стандарт";
	//КонецЕсли;
	//Если НЕ НовМаршрутизация = "Стандарт" Тогда
	//	РезультатЗапроса = ПолучитьНестандартнуюМаршрутизацию(НовМаршрутизация,ПроцДоходности);
	//Иначе
	////-- Зубов 03.08.2021 37315
	//
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("МинимальныйПроцентДоходности", ПроцДоходности);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//	ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ПС_ВидПеревозки);
	//	ПараметрыЗапроса.Вставить("ТипКалькуляции", Объект.ТипКалькуляции);
	//	ПараметрыЗапроса.Вставить("ДействующийКлиент", ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании));
	//
	//РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Объект.Дата);
	////++ Зубов 03.08.2021 37315
	//КонецЕсли;
	////-- Зубов 03.08.2021 37315
	//++ Зубов 03.08.2021 37315
	МаршрутизацияДействующегоКлиента = Ложь;
	Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании) Тогда
		//НовМаршрутизация = СтандартнаяМаршрутизацияНаСервере();
		МаршрутизацияДействующегоКлиента = ЭтоМаршрутизацияДействующегоКлиента(Объект);
		//Иначе
		//	НовМаршрутизация = "Стандарт";
	КонецЕсли;
	//Если НЕ НовМаршрутизация = "Стандарт" Тогда
	//	РезультатЗапроса = ПолучитьНестандартнуюМаршрутизацию(НовМаршрутизация,ПроцДоходности);
	//Иначе
	//-- Зубов 03.08.2021 37315
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	ПараметрыЗапроса.Вставить("МинимальныйПроцентДоходности", ПроцДоходности);
	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ПС_ВидПеревозки);
	ПараметрыЗапроса.Вставить("ТипКалькуляции", Объект.ТипКалькуляции);
	//ПараметрыЗапроса.Вставить("ДействующийКлиент", ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании));
	ПараметрыЗапроса.Вставить("ДействующийКлиент", МаршрутизацияДействующегоКлиента);
	Возврат ПараметрыЗапроса;
КонецФункции

//Евросиб - АСуслов 26.09.2022 14:03:16 #57542
//(
Функция ПроверитьНеобходимостьУстановитьПризнакОтсутствуетПеревозкаПоЖД(Объект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_КалькуляцияМультимодальнойЦепочкиОбъект
	|ИЗ
	|	&ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|;
	|ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_КалькуляцияМультимодальнойЦепочкиСсылка
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = &Калькуляция 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ИЗ
	|	ВТ_КалькуляцияМультимодальнойЦепочкиОбъект КАК ВТ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга.ОтсутствиеПеревозкиПоЖДДляКалькуляции
	|;
	|ВЫБРАТЬ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ИЗ
	|	ВТ_КалькуляцияМультимодальнойЦепочкиСсылка КАК ВТ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга.ОтсутствиеПеревозкиПоЖДДляКалькуляции";
	
	Запрос.УстановитьПараметр("ММ_КалькуляцияМультимодальнойЦепочки", Объект.ММ_КалькуляцияМультимодальнойЦепочки.Выгрузить());
	Запрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	Пакеты = Запрос.ВыполнитьПакет();
	РеквизитыКалькуляцииСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "ТипЗаказа, ОтсутствуетПеревозкаПоЖД");
	НеобходимостьУстановитьПризнакПоОбъекту = Пакеты[2].Пустой() И НЕ Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	//НеобходимостьУстановитьПризнакПоСсылке = Пакеты[3].Пустой() И НЕ Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НеобходимостьУстановитьПризнакПоСсылке = Пакеты[3].Пустой() И НЕ РеквизитыКалькуляцииСсылки.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту = Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НеобходимостьСнятьПризнакПоТипуЗаказаПоСсылке = РеквизитыКалькуляцииСсылки.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	ВКалькуляцииЗапланированыРасходыПоЖДПоОбъекту = НЕ Пакеты[2].Пустой() ИЛИ Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	
	Возврат Новый Структура("НеобходимостьУстановитьПризнакПоОбъекту, НеобходимостьУстановитьПризнакПоСсылке,
							|НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту, НеобходимостьСнятьПризнакПоТипуЗаказаПоСсылке,
							|ВКалькуляцииЗапланированыРасходыПоЖДПоОбъекту,
							|ОтсутствуетПеревозкаПоЖДПоСсылке",
							НеобходимостьУстановитьПризнакПоОбъекту,
							НеобходимостьУстановитьПризнакПоСсылке,
							НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту,
							НеобходимостьСнятьПризнакПоТипуЗаказаПоСсылке, 
							ВКалькуляцииЗапланированыРасходыПоЖДПоОбъекту,
							РеквизитыКалькуляцииСсылки.ОтсутствуетПеревозкаПоЖД);
		
КонецФункции

//)
//Евросиб - АСуслов 26.09.2022 14:03:18 #57542

//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
Функция ПроверитьПравилаЗапретаРасходовПоОхранеВСтавкуСНДС0( КалькуляцияИлиЗаявка ) Экспорт

	Запрос = Новый Запрос;

	Если ТипЗнч(КалькуляцияИлиЗаявка) = Тип("ДанныеФормыСтруктура") Тогда
		МассивКалькуляций = Новый Массив;
		Для Каждого Стр Из КалькуляцияИлиЗаявка.СоставУслуги Цикл
			Если ЗначениеЗаполнено(Стр.Калькуляция) Тогда
				МассивКалькуляций.Добавить(Стр.Калькуляция);
			КонецЕсли;
		КонецЦикла;
		Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКалькуляций);
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Калькуляция.Ссылка КАК Калькуляция
			|ПОМЕСТИТЬ ВТ_КалькуляцииДляПроверки
			|ИЗ
			|	Документ.Калькуляция КАК Калькуляция
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрИсключенийИзЗапретаРасходовПоОхранеВСтавкуСНДС0.СрезПоследних(, ) КАК РеестрИсключений
			|		ПО Калькуляция.Контрагент = РеестрИсключений.Контрагент
			|ГДЕ
			|	Калькуляция.Ссылка В(&МассивКалькуляций)
			|	И НЕ ЕСТЬNULL(РеестрИсключений.ВРеестре, ЛОЖЬ)
			|	И Калькуляция.Контрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция
			|ИЗ
			|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КалькуляцииДляПроверки КАК ВТ_КалькуляцииДляПроверки
			|		ПО КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = ВТ_КалькуляцииДляПроверки.Калькуляция
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = Номенклатура.Ссылка
			|			И (Номенклатура.ТолькоДляЦенногоГруза)
			|ГДЕ
			|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)";
		Запрос.УстановитьПараметр("МассивКалькуляций", МассивКалькуляций);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Запрещена услуга Охраны с НДС0 в ставке %1! Для разрешения требуется внести клиента в <Реестр исключений из запрета включения расходов по охране в ставку на перевозку с НДС0 >" , ВыборкаДетальныеЗаписи.Калькуляция));
		КонецЦикла;
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыРезидентыНеВРеестреИсключения
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрИсключенийИзЗапретаРасходовПоОхранеВСтавкуСНДС0.СрезПоследних(, Контрагент = &Контрагент) КАК РеестрИсключений
		|		ПО (РеестрИсключений.Контрагент = Контрагенты.Ссылка)
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент
		|	И НЕ ЕСТЬNULL(РеестрИсключений.ВРеестре, ЛОЖЬ)
		|	И Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
		|	&СтавкаНДС_ОсновнойУслуги КАК СтавкаНДС_ОсновнойУслуги
		|ПОМЕСТИТЬ ВТ_КалькуляцияМультимодальнойЦепочкиУслуги
		|ИЗ
		|	&ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КалькуляцияМультимодальнойЦепочкиУслуги.Услуга КАК Услуга
		|ИЗ
		|	ВТ_КалькуляцияМультимодальнойЦепочкиУслуги КАК ВТ_КалькуляцияМультимодальнойЦепочкиУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_КалькуляцияМультимодальнойЦепочкиУслуги.Услуга = Номенклатура.Ссылка
		|			И (Номенклатура.ТолькоДляЦенногоГруза)
		|ГДЕ
		|	&Контрагент В
		|			(ВЫБРАТЬ
		|				ВТ_КонтрагентыРезидентыНеВРеестреИсключения.Контрагент
		|			ИЗ
		|				ВТ_КонтрагентыРезидентыНеВРеестреИсключения КАК ВТ_КонтрагентыРезидентыНеВРеестреИсключения)
		|	И ВТ_КалькуляцияМультимодальнойЦепочкиУслуги.СтавкаНДС_ОсновнойУслуги = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)";
		Запрос.УстановитьПараметр("Контрагент", КалькуляцияИлиЗаявка.Контрагент);
		Запрос.УстановитьПараметр("СтавкаНДС_ОсновнойУслуги", КалькуляцияИлиЗаявка.СтавкаНДС);
		Запрос.УстановитьПараметр("ММ_КалькуляцияМультимодальнойЦепочки", КалькуляцияИлиЗаявка.ММ_КалькуляцияМультимодальнойЦепочки.Выгрузить(,"Услуга"));
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("Запрещена услуга Охраны с НДС0 в ставке калькуляции! Для разрешения требуется внести клиента в <Реестр исключений из запрета включения расходов по охране в ставку на перевозку с НДС0>");
		КонецЦикла;
	КонецЕсли;
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец

Процедура ПолучитьНормативнуюКонтрибуцию(Объект,НормативнаяКонтрибуция = 0) Экспорт //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	мПунктыОтправления = Новый Массив;
	мПунктыНазначения  = Новый Массив;
	
	Для Каждого ПунктН Из Объект.СписокСтанцийНазначения Цикл
		
		//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
		Если ТипЗнч(ПунктН) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
			Продолжить;
		КонецЕсли;	
		//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
		Если ЗначениеЗаполнено(ПунктН.Станция) Тогда
			Если мПунктыНазначения.Найти(ПунктН.Станция) = Неопределено Тогда
				мПунктыНазначения.Добавить(ПунктН.Станция);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Объект.Суша_ПунктНазначения) Тогда
		Если мПунктыНазначения.Найти(Объект.Суша_ПунктНазначения) = Неопределено Тогда
			мПунктыНазначения.Добавить(Объект.Суша_ПунктНазначения);
		КонецЕсли;	
	КонецЕсли;
	
	Для Каждого ПунктН Из Объект.СписокСтанцийОтправления Цикл
		//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
		Если ТипЗнч(ПунктН) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
		Если ЗначениеЗаполнено(ПунктН.Станция) Тогда
			Если мПунктыОтправления.Найти(ПунктН.Станция) = Неопределено Тогда
				мПунктыОтправления.Добавить(ПунктН.Станция);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Объект.Суша_ПунктОтправления) Тогда
		Если мПунктыОтправления.Найти(Объект.Суша_ПунктОтправления) = Неопределено Тогда
			мПунктыОтправления.Добавить(Объект.Суша_ПунктОтправления);
		КонецЕсли;	
	КонецЕсли;
	
	сКонтрибуцияСтавка = ВыполнитьПоискДокументаИСтавки(мПунктыОтправления,мПунктыНазначения,Объект);
	
	Если сКонтрибуцияСтавка.Успех Тогда
		Объект.НормативыКонтрибуции 			= сКонтрибуцияСтавка.ДокументСсылка;
		Объект.ГУИДСтрокиНормативыКонтрибуции 	= сКонтрибуцияСтавка.ГУИД;
		НормативнаяКонтрибуция					= сКонтрибуцияСтавка.Ставка;
		Возврат;
	Иначе
		
		мПунктыОтправленияДоп = Новый Массив;
		мПунктыНазначенияДоп  = Новый Массив;
		
		Для Каждого ПунктО Из мПунктыОтправления Цикл
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ТипЗнч(ПунктО) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ПунктО.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктО, Перечисления.ТипыИерархииЛокации.Регион);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыОтправленияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыОтправленияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если ПунктО.Тип = Справочники.ТипыЛокаций.Порт ИЛИ ПунктО.Тип = Справочники.ТипыЛокаций.Сток ИЛИ ПунктО.Тип = Справочники.ТипыЛокаций.Терминал  Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктО, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыОтправленияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыОтправленияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если ПунктО.Тип = Справочники.ТипыЛокаций.Регион Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктО, Перечисления.ТипыИерархииЛокации.Страна);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыОтправленияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыОтправленияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ПунктО Из мПунктыОтправления Цикл
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ТипЗнч(ПунктО) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если мПунктыОтправленияДоп.Найти(ПунктО) = Неопределено Тогда
				мПунктыОтправленияДоп.Добавить(ПунктО);
			КонецЕсли;                       
		КонецЦикла;
		
		Для Каждого ПунктН Из мПунктыНазначения Цикл
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ТипЗнч(ПунктН) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ПунктН.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктН, Перечисления.ТипыИерархииЛокации.Регион);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыНазначенияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыНазначенияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если ПунктН.Тип = Справочники.ТипыЛокаций.Порт ИЛИ ПунктН.Тип = Справочники.ТипыЛокаций.Сток ИЛИ ПунктН.Тип = Справочники.ТипыЛокаций.Терминал  Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктН, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыНазначенияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыНазначенияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если ПунктН.Тип = Справочники.ТипыЛокаций.Регион Тогда
				
				ЛокацияРодитель = Локации_сервер.ПолучитьЛокациюВышестоящегоУровняИТипу(ПунктН, Перечисления.ТипыИерархииЛокации.Страна);					
				Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
					Если мПунктыНазначенияДоп.Найти(ЛокацияРодитель) = Неопределено Тогда
						мПунктыНазначенияДоп.Добавить(ЛокацияРодитель);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ПунктН Из мПунктыНазначения Цикл
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если ТипЗнч(ПунктН) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Шевченко А.В. BUG 124698 TA 127718 19.03.2026
			Если мПунктыНазначенияДоп.Найти(ПунктН) = Неопределено Тогда
				мПунктыНазначенияДоп.Добавить(ПунктН);
			КонецЕсли;                       
		КонецЦикла;
		
		сКонтрибуцияСтавка = ВыполнитьПоискДокументаИСтавки(мПунктыОтправленияДоп,мПунктыНазначенияДоп,Объект);
		
		Если сКонтрибуцияСтавка.Успех Тогда
			Объект.НормативыКонтрибуции 			= сКонтрибуцияСтавка.ДокументСсылка;
			Объект.ГУИДСтрокиНормативыКонтрибуции 	= сКонтрибуцияСтавка.ГУИД;
			НормативнаяКонтрибуция					= сКонтрибуцияСтавка.Ставка;
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Объект.НормативыКонтрибуции 			= Документы.НормативКонтрибуции.ПустаяСсылка();
	Объект.ГУИДСтрокиНормативыКонтрибуции 	= "";
	НормативнаяКонтрибуция					= 0;
	
КонецПроцедуры

Функция ВыполнитьПоискДокументаИСтавки(мПунктыОтправления,мПунктыНазначения,Объект) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	сОтвет = Новый Структура("Успех,ДокументСсылка,ГУИД,Ставка",Ложь,Документы.НормативКонтрибуции.ПустаяСсылка(),"",0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНормативовКонтрибуции.Регистратор КАК Регистратор,
		|	СтавкиНормативовКонтрибуции.НормативнаяСтавка КАК НормативнаяСтавка,
		|	СтавкиНормативовКонтрибуции.Клиент КАК Клиент,
		|	СтавкиНормативовКонтрибуции.ОфисПродаж КАК ОфисПродаж,
		|	СтавкиНормативовКонтрибуции.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	РегистрСведений.СтавкиНормативовКонтрибуции КАК СтавкиНормативовКонтрибуции
		|ГДЕ
		|	СтавкиНормативовКонтрибуции.Продукт = &Продукт
		|	И СтавкиНормативовКонтрибуции.УчетноеНаправление = &УчетноеНаправление
		|	И СтавкиНормативовКонтрибуции.ПунктОтправления В(&ПунктОтправления)
		|	И СтавкиНормативовКонтрибуции.ПунктНазначения В(&ПунктНазначения)
		|	И СтавкиНормативовКонтрибуции.ДатаНачалаПериодаДействия <= &Дата
		|	И СтавкиНормативовКонтрибуции.ДатаОкончанияПериодаДействия >= &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = &Клиент
		|	И ВТ_Итог.ОфисПродаж = &ОфисПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = &Клиент
		|	И ВТ_Итог.ОфисПродаж = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВТ_Итог.ОфисПродаж = &ОфисПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВТ_Итог.ОфисПродаж = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка";
	
	ДатаПериод = Дата(1,1,1);
	
	пЗапрос = Новый Запрос;
	пЗапрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ПСЦКалькуляции.Ссылка КАК Ссылка,
	|	ПСЦКалькуляции.Ссылка.ДатаПСЦ КАК ДатаПСЦ
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Калькуляция = &Калькуляция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПСЦ УБЫВ";
	
	пЗапрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	
	пРезультатЗапроса = пЗапрос.Выполнить();
	
	пВыборкаДетальныеЗаписи = пРезультатЗапроса.Выбрать();
	
	Пока пВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаПериод = пВыборкаДетальныеЗаписи.ДатаПСЦ
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("Дата", ДатаПериод);
	Запрос.УстановитьПараметр("Клиент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ОфисПродаж", "");
	Запрос.УстановитьПараметр("Продукт", Объект.ПродуктДКП);
	Запрос.УстановитьПараметр("ПунктНазначения", мПунктыНазначения);
	Запрос.УстановитьПараметр("ПунктОтправления", мПунктыОтправления);
	Запрос.УстановитьПараметр("УчетноеНаправление", Объект.УчетноеНаправление);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКлиентОфис 				= РезультатЗапроса[1].Выбрать();
	ВыборкаКлиент 					= РезультатЗапроса[2].Выбрать();
	Выборкаофис 					= РезультатЗапроса[3].Выбрать();
	ВыборкаБезофисаБезКлиента 		= РезультатЗапроса[4].Выбрать();
	
	Пока ВыборкаКлиентОфис.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,ВыборкаКлиентОфис);
		Возврат сОтвет;
	КонецЦикла;
	Пока ВыборкаКлиент.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,ВыборкаКлиент);
		Возврат сОтвет;
	КонецЦикла;
	Пока Выборкаофис.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,Выборкаофис);
		Возврат сОтвет;
	КонецЦикла;
	Пока ВыборкаБезофисаБезКлиента.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,Выборкаофис);
		Возврат сОтвет;
	КонецЦикла;
	
	Возврат сОтвет;
	
КонецФункции