Перем ИгнорироватьПроверкуНаПрава Экспорт;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	УслугаФрахта = Константы.УслугаФрахтаДляКалькуляции.Получить();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 18.09.2020 (
	
	
	// SIV 27-11-2020 
	Если НЕ ИгнорироватьПроверкуНаПрава Тогда
		КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	
	//(Евросиб Максимова 25.03.2021 #0222222
	// проверка на несоответствие клиента в калькуляциях и в ПСЦ
	СписокСогласованныхПСЦ=ПолучитьСписокПСЦ();
	Если СписокСогласованныхПСЦ.Количество()>0 Тогда
			Сообщить("Для калькуляции " + Строка(Ссылка) + " существует ПСЦ, отправленный на согласование с другими значениями контрагент или договор. Запись запрещена!");
			Отказ = Истина;
	КонецЕсли;
	//Евросиб Максимова 25.03.2021 #0222222)
	
	// Евросиб Фролов (16.12.2021 TASK №40645
	// Запретить проведение калькуляции, в которой вид перевозки "Внутрироссийская" и ставка НДС = 0%.
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ПС_ВидПеревозки = Справочники.ВидыПеревозок.Внутрироссийская И СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
			Сообщить("Запрещено проведение документа, если вид перевозки ""Внутрироссийская"" и ставка НДС равна 0%");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. 08.09.2022 46657 -начало
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		//Евросиб СубботинВ #125845 09.12.2025 Начало 
		Если ПС_ВидПеревозки = Справочники.ВидыПеревозок.ВнеТерриторииРФ
			И (СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС
			И СтавкаНДС <> Перечисления.СтавкиНДС.НДС20
			// добавил 22%
			И СтавкаНДС <> Перечисления.СтавкиНДС.НДС22)
			Тогда
			//Евросиб СубботинВ #125845 09.12.2025 конец
			Сообщить(СтрШаблон("Для вида перевозки ""Вне территории РФ"" использование ставки НДС %1 запрещено",Строка(СтавкаНДС)));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Шевченко А.В. 08.09.2022 46657 -конец
	
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
	Если Документы.Калькуляция.ПроверитьПравилаЗапретаРасходовПоОхранеВСтавкуСНДС0( ЭтотОбъект ) Тогда
		Отказ = Истина;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, начало
	Если НЕ КонтрольДоступностиДокументов_сервер.РазрешеноВыбиратьИзменятьТипКалькуляцииДоплатные(Ссылка, ТипКалькуляции) Тогда
		ОбщегоНазначения.СообщитьПользователю("Недостаточно прав изменять тип калькуляции <Доплатные КТК>. Необходимо обратиться к руководителю Производственной дирекции",,"ТипКалькуляции", "Объект", Отказ);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, конец
	
	//Евросиб Каблов 18.09.2020 )
//Евросиб Гудкова( 18.10.2020 Ticket№ 0210719 перенесла в общий модуль
////Евросиб Гудкова( 12.10.2020 Ticket№ 0209882 вернула блокировку
//	Если ЗначениеЗаполнено(Ссылка) И Не РольДоступна("ПолныеПрава") Тогда //И Не РольДоступна("dc_РуководительКоммерческойРаботы") Тогда // SIV 20 09 18 блокировка калькуляции, включенной в согласованный ПСЦ
//		ПСЦ = Документы.Калькуляция.КалькуляцияНаходитсяВСогласованномПСЦ(Ссылка);
//		Если ПСЦ <> неопределено Тогда
//			Сообщить("Данная калькуляция зафиксирована ПСЦ " + ПСЦ);
//			Отказ = Истина;
//		КонецЕсли; 
//	КонецЕсли;
// Евросиб Гудкова) 	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;                 
	//Евросиб - АСуслов 07.04.2022 15:59:14 #42899
	//(
	ПроверитьДублиУслуг(Отказ);
	//)
	//Евросиб - АСуслов 07.04.2022 15:59:52 #42899
	
	// SIV 17.05 Ticket#0232251 -->
	МассивУдаляемыхСтрочек = Новый Массив;
	МассивПройденныхПортов = Новый Массив;
	Для каждого Стр из НФ_ПортыОтправленияНазначения Цикл
		Если МассивПройденныхПортов.Найти(Стр.Порт) <> неопределено Тогда
			МассивУдаляемыхСтрочек.Добавить(Стр);
		КонецЕсли;
		МассивПройденныхПортов.Добавить(Стр.Порт);
	КонецЦикла;
	Для каждого Стр из МассивУдаляемыхСтрочек Цикл
		НФ_ПортыОтправленияНазначения.Удалить(Стр);
	КонецЦикла;
	// SIV 17.05 Ticket#0232251 <--
	
	//Евросиб Коханенко Н.А. 28.11.2023 (( #78073
	УдалениеПустыхСтрокТЧЛокаций(СписокСтанцийОтправления);
	УдалениеПустыхСтрокТЧЛокаций(СписокСтанцийНазначения);
	//Евросиб Коханенко Н.А. 28.11.2023 )) #78073
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	СписокПунктовОтправления = СтрСоединить(СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"), "; ");
	СписокПунктовНазначения = СтрСоединить(СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"), "; ");
	
	Если Не БезДоверенностей Тогда
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(Дата,"Калькуляции",ЦФО);
		ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И НЕ КонтрагентыДоговоры_сервер.ДоговорЗарегистрированВБФ(Контрагент) Тогда
		Отказ = истина;
		Сообщить("Нельзя записать калькуляцию по неактивному контрагенту.");
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 26.09.2020 ( Ticket#0205756
	//Скопировано из модуля ПСЦ
	//Синхронизация статуса документа со статусами ТЧ Согласование
	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	
	Для каждого Стр из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование Тогда Продолжить; КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний; //Гудкова
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда СтатусДокумента = Перечисления.СтатусыСогласования.Планируется; КонецЕсли;
		
	Если СогласованиеНачато = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении; КонецЕсли;
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.Планируется; //Гудкова ticket 0207847  СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		ДатаСогласования = ТекущаяДата();
	КонецЕсли;
	//Евросиб Каблов 26.09.2020 )
	
	// + ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022 Добавлена пометка удаления процесса согласования если произошла отмена согласования
	СогласованиеСервер.ОбработатьОтменуСогласованияДокументаПередЗаписью(ЭтотОбъект);
	// - ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022
	
	// !!! Иван 20-10-19
	// Изначально задумывалось, чтобы в доходах по калькуляции могло быть несколько услуг и строки расходов привязывались к ним по указанию Выставляемой услуги в калькуляции
	// Потом решили, что выставляемая услуга всегда одна. Поэтому я делаю спец палку, которая прописывает одну выставляемую услугу во все расходные.
	// Почему сразу не сделать без проверки выст. услуги? Мне кажется, со временем мы придем к тому, чтобы выставлять клиенту несколько разных услуг типа ТЭО + тариф груженый
	
	//++ДИТ_Коробов_Ticket#0267470 08.04.22 - убрали условие из цикла
	Для каждого Стр из ММ_КалькуляцияМультимодальнойЦепочки Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.ВыставляемаяУслуга) тогда
			// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( 
			Стр.ВыставляемаяУслуга = ОсновнаяУслуга;
			//Стр.ВыставляемаяУслуга = ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
			// Евросиб Рыбьяков К.А. 02.07.2024 ))			
	//	КонецЕсли;
	КонецЦикла;
	//--ДИТ_Коробов_Ticket#0267470 08.04.22
	// --
	
	// + Состояния
//Евросиб Гудкова( 01.09.2020 Ticket№ 0205361	КолСостоянийЗавершено = 0; // Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
//Евросиб Гудкова( 01.09.2020 Ticket№ 0205361 
//было
	  //Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда // Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	  //  	КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
	  //  КонецЕсли;
// Евросиб Гудкова)
	КонецЦикла;
	
//Евросиб Гудкова( 10.10.2020 Ticket№ 0209587
	//Если Не ОбменДанными.Загрузка = Истина И ЗначениеЗаполнено(Ссылка) И Не РольДоступна("ПолныеПрава") И Не РольДоступна("dc_РуководительКоммерческойРаботы") Тогда //Евросиб Гудкова( 02.09.2020 Ticket№ 0205361, 0205488  КолСостоянийЗавершено = Состояния.Количество() Тогда  // Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	//	Запрос = Новый запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	               |	КалькуляцияСостояния.Ссылка КАК Ссылка
	//	               |ИЗ
	//	               |	Документ.Калькуляция.Состояния КАК КалькуляцияСостояния
	//	               |ГДЕ
	//	               |	КалькуляцияСостояния.Статус <> &Статус
	//	               |	И КалькуляцияСостояния.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтапов.Выполнен);
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Результат = Запрос.Выполнить();
	//	Если Результат.Пустой() Тогда
	//		Сообщить("Ошибка. Документ полностью утвержден. Запись запрещена.");
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли; 
	//КонецЕсли; 
// Евросиб Гудкова) 	
	
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	
	//Евросиб - АСуслов 15.12.2021 14:15:39 #42234
	//(
	//ДляДанногоОбъектаТребуетсяПеремаршрутизация = //Ссылка.ПС_ВидПеревозки <> ПС_ВидПеревозки;
//	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
//	Ссылка.Организация <> Организация ИЛИ 
//	Ссылка.Контрагент <> Контрагент ИЛИ
//	Ссылка.Договор <> Договор ИЛИ
//	Ссылка.ПС_ВидПеревозки <> ПС_ВидПеревозки ИЛИ
//	Ссылка.ММ_ИтогоРентабельность <> ММ_ИтогоРентабельность ИЛИ
//	Ссылка.ММ_ИтогоРентабельность20 <> ММ_ИтогоРентабельность20 ИЛИ
////Евросиб Гудкова( 15.07.2020 Ticket№ 0200088
//	Ссылка.ЖД_ПринадлежностьПС <> ЖД_ПринадлежностьПС ИЛИ
//// Евросиб Гудкова) 	
//	Ссылка.ТипКалькуляции <> ТипКалькуляции ИЛИ Состояния.Количество() = 0;
	РеквизитыКалькуляцииДляСравнения = "Организация, Контрагент, Договор, ПС_ВидПеревозки, ММ_ИтогоРентабельность, ММ_ИтогоРентабельность20, ЖД_ПринадлежностьПС, ТипКалькуляции";
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект, РеквизитыКалькуляцииДляСравнения);
	//)
	//Евросиб - АСуслов 15.12.2021 14:15:42 #42234
									
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
        ПараметрыЗапроса = Документы.Калькуляция.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Дата);
		//++ Зубов 03.08.2021 37315
		//КонецЕсли;
		//-- Зубов 03.08.2021 37315
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НужноДопСогласование = Ложь;//Евросиб Гудкова( 15.10.2019
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	Для каждого Состояние из Состояния Цикл
		Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
			ТекущееСостояние = Состояние.Состояние;
			Прервать;
//Евросиб Гудкова( 15.10.2019 если ввод документа завершен, то дальше проверим необходимость доп.согласования 
		ИначеЕсли Состояние.Статус = Перечисления.СтатусыЭтапов.Выполнен и Не НужноДопСогласование Тогда
			НужноДопСогласование = Истина;
// Евросиб Гудкова) 
		КонецЕсли;
	КонецЦикла;
		
//Евросиб Гудкова( 14.10.2019 
//при необходимости доп.согласования проверим наличие этого состояния и добавим
	НужноДопСогласование = НужноДопСогласование
		//Евросиб Коханенко Н.А. 13.11.2025 (( #123351
		//доп.согласование для межсервисных расходов не требуется
		И ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы")
		И ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф")
		//Евросиб Коханенко Н.А. 13.11.2025 )) #123351 
				И (Не ЖД_ПринадлежностьПС = Перечисления.ПринадлежностьПС.Собственный) //Евросиб Гудкова( 06.11.2019 Ticket№ 0179728
				//для потомков
				//условие ниже определяет, что по всем строчкам в калькуляции выбраны максимальные ставки по 20 и по 40
				И (ММ_КалькуляцияМультимодальнойЦепочки.Итог("СтавкаМаксимальная20")
					+ММ_КалькуляцияМультимодальнойЦепочки.Итог("СтавкаМаксимальная40"))
				< ММ_КалькуляцияМультимодальнойЦепочки.Количество()*2;
	Если НужноДопСогласование И Состояния.Найти(Справочники.Состояния.ДопСогласованиеРуководителем, "Состояние") = Неопределено Тогда
		ТекущаяСтрока = Состояния.Найти(ТекущееСостояние, "Состояние");
		ПредыдущаяСтрока = состояния[ТекущаяСтрока.номерстроки-2];
		НоваяСтрока = Состояния.Вставить(ПредыдущаяСтрока.НомерСтроки);
		НоваяСтрока.Исполнитель = Справочники.ГруппыПользователей.РуководительОтделаПоРаботеСПодрядчиками;
		НоваяСтрока.Наблюдатель = Пользователи.ТекущийПользователь();
		НоваяСтрока.НормативИсполненияСМоментаСоздания = ПредыдущаяСтрока.НормативИсполненияСМоментаСоздания + 4;
		НоваяСтрока.ПредыдущиеЭтапы = ТекущаяСтрока.ПредыдущиеЭтапы;
		НоваяСтрока.Состояние = Справочники.Состояния.ДопСогласованиеРуководителем;
		НоваяСтрока.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;

		Для Сч = НоваяСтрока.НомерСтроки По Состояния.Количество()-1 Цикл
			СтрокаНаИзменение = Состояния[Сч];
			МассивЭтапов = СтрРазделить(СтрокаНаИзменение.ПредыдущиеЭтапы,",",Ложь);
			Для СчЭ = 0 По МассивЭтапов.Количество() - 1 Цикл
				МассивЭтапов[СчЭ] = Строка(Число(МассивЭтапов[СчЭ]) + 1);
			КонецЦикла; 
			СтрокаНаИзменение.ПредыдущиеЭтапы = СтрСоединить(МассивЭтапов, ",");
			СтрокаНаИзменение.НормативИсполненияСМоментаСоздания = СтрокаНаИзменение.НормативИсполненияСМоментаСоздания + 4;
		КонецЦикла; 
	КонецЕсли;
// Евросиб Гудкова) 	

// - Состояния
	
	/////////////////////////////////////////////////
	ПланПродаж_Доходы.Очистить();
	ПланПродаж_Расходы.Очистить();
	
	//НДСНеВкл20 = 0;
	//НДСНеВкл40 = 0;
	//Для каждого Стр из ММ_КалькуляцияМультимодальнойЦепочки Цикл
	//	Если НЕ Стр.НДСВключенВСтоимость Тогда
	//		НДСНеВкл20 = НДСНеВкл20 + Стр.СуммаНДС20;
	//		НДСНеВкл40 = НДСНеВкл40 + Стр.СуммаНДС40;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//НСтр = ПланПродаж_Доходы.Добавить();
	//НСтр.СуммаОплаты40 = море40_Вознаграждение + 
	//					море40_Себестоимость + 
	//					ММ_КалькуляцияМультимодальнойЦепочки.Итог("Цена40") + НДСНеВкл40 +
	//					ММ_Вознаграждение40;
	//НСтр.СуммаОплаты20 = море20_Вознаграждение + 
	//					 море20_Себестоимость + 
	//					ММ_КалькуляцияМультимодальнойЦепочки.Итог("Цена20") + НДСНеВкл20+
	//					ММ_Вознаграждение;
	
	НСтр = ПланПродаж_Доходы.Добавить();
	НСтр.СуммаОплаты20 = ММ_ИтогоСтавка20;
	НСтр.СуммаОплаты40 = ММ_ИтогоСтавка;
	
	НСтр.СтавкаНДС = СтавкаНДС;
	ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДС);		
	НСтр.СуммаНДС40 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СуммаОплаты40, ПроцентСтавкиНДС, Истина, СуммаВключаетНДС);
	НСтр.СуммаНДС20 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СуммаОплаты20, ПроцентСтавкиНДС, Истина, СуммаВключаетНДС);
	
	НСтр.Валюта = Валюта;
	//Евросиб - АСуслов 12.11.2021 16:32:25 #41825
	//(
	//Попытка					
	//	НСтр.Номенклатура = ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
	//Исключение
	//	Сообщить("Не удалось вычислить номенклатуру выставляемой услуги. Заполните таблицу 1.3 в калькуляции.");
	//КонецПопытки;
	Если ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
		// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( 
		НСтр.Номенклатура = ОсновнаяУслуга;
		//НСтр.Номенклатура = ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
		// Евросиб Рыбьяков К.А. 02.07.2024 ))	
	ИначеЕсли НФ_ВыбранныеСтавки.Количество() > 0 Тогда
		нСтр.Номенклатура = Справочники.Номенклатура.УслугиЕЛС;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 12.11.2021 16:32:53 #41825
	НСтр.ТипСтавки = Перечисления.ТипыСтавокПротокола.Ставка;
	НСтр.ПунктОтправления = Суша_ПунктОтправления;
	НСтр.ПунктНазначения = Суша_ПунктНазначения;
	
	Для каждого Стр из ЖД_УслугиВнеСтавки Цикл
		
		НСтр = ПланПродаж_Доходы.Добавить();
		НСтр.Номенклатура = Стр.Услуга;
		НСтр.ДопУслуга = Истина;
		НСтр.СрокОплаты = Стр.Договор.СрокОплаты;
		
		ЗаполнитьЗначенияСвойств(НСтр, Стр, "ПроцентВознаграждения, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, БазаДляРасчетаВР");
		
		//НДС20 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Ставка20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС);
		//НДС40 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Ставка40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС);
		
		//НДС20Себестоимость = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Себестоимость20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС);
		//НДС40Себестоимость = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Себестоимость40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС);
		
		НСтр.СуммаОплаты40 = Стр.Ставка40;
		НСтр.СуммаОплаты20 = Стр.Ставка20;
		НСтр.Валюта = Стр.Валюта;
		НСтр.ТипСтавки = Стр.ТипСтавки;
		
		НСтр.СтавкаНДС = Стр.СтавкаНДС;
		ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
		//Евросиб Каблов 17.03.2021 ( Ticket#0226454
		//НСтр.СуммаНДС40 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Ставка40, ПроцентСтавкиНДС, Истина, Стр.СуммаВключаетНДС);
		//НСтр.СуммаНДС20 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Ставка20, ПроцентСтавкиНДС, Истина, Стр.СуммаВключаетНДС);
		НСтр.СуммаНДС40 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Себестоимость40, ПроцентСтавкиНДС, Истина, Стр.СуммаВключаетНДС);
		НСтр.СуммаНДС20 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Себестоимость20, ПроцентСтавкиНДС, Истина, Стр.СуммаВключаетНДС);
		//Евросиб Каблов 17.03.2021 )
		
		НСтр.ПунктОтправления = Стр.ПунктОтправления;
		НСтр.ПунктНазначения = Стр.ПунктНазначения;
		
		НСтр = ПланПродаж_Расходы.Добавить();
		НСтр.Номенклатура = Стр.Услуга;
		НСтр.НоменклатурнаяГруппа = Стр.Услуга.УкрупненнаяГруппа;
		НСтр.Поставщик = Стр.Поставщик;
		НСтр.Договор = Стр.Договор;
		Если НЕ ЗначениеЗаполнено(НСтр.Договор) Тогда НСтр.Договор = НСтр.Поставщик.ОсновнойДоговорКонтрагента; КонецЕсли;
		НСтр.СрокОплаты = Стр.Договор.СрокОплаты;
		
		НСтр.СуммаАванса40 = (Стр.Себестоимость40) / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты40 = (Стр.Себестоимость40) - НСтр.СуммаАванса40;
		НСтр.СуммаАванса20 = (Стр.Себестоимость20) / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты20 = (Стр.Себестоимость20) - НСтр.СуммаАванса20;
		
		НСтр.Валюта = Стр.Валюта;
		НСтр.Тариф20 = Стр.Тариф20;
		НСтр.Тариф40 = Стр.Тариф40;
		
	КонецЦикла;
	
	Для каждого Стр из ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		
		НСтр = ПланПродаж_Расходы.Добавить();
		НСтр.Номенклатура = Стр.Услуга;
		НСтр.НоменклатурнаяГруппа = Стр.Услуга.УкрупненнаяГруппа;
		НСтр.СрокОплаты = Стр.Договор.СрокОплаты;
		НСтр.Поставщик = Стр.Поставщик;
		НСтр.Договор = Стр.Договор;
		Если НЕ ЗначениеЗаполнено(НСтр.Договор) Тогда НСтр.Договор = НСтр.Поставщик.ОсновнойДоговорКонтрагента; КонецЕсли;
		
		//НДС20Себестоимость = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Цена20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключенВСтоимость);
		//НДС40Себестоимость = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.Цена40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключенВСтоимость);
				
		НСтр.СуммаАванса40 = (Стр.Цена40+?(Стр.НДСВключенВСтоимость, 0, Стр.СуммаНДС40)) / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты40 = (Стр.Цена40+?(Стр.НДСВключенВСтоимость, 0, Стр.СуммаНДС40)) - НСтр.СуммаАванса40;
		НСтр.СуммаАванса20 = (Стр.Цена20+?(Стр.НДСВключенВСтоимость, 0, Стр.СуммаНДС20)) / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты20 = (Стр.Цена20+?(Стр.НДСВключенВСтоимость, 0, Стр.СуммаНДС20)) - НСтр.СуммаАванса20;
		
		НСтр.Валюта = Стр.Валюта;
		НСтр.Тариф20 = Стр.Тариф20;
		НСтр.Тариф40 = Стр.Тариф40;
		
	КонецЦикла;
	
	Если море40_Себестоимость > 0 ИЛИ море20_Себестоимость > 0 Тогда
		НСтр = ПланПродаж_Расходы.Добавить();
		НСтр.Номенклатура = УслугаФрахта;
		НСтр.НоменклатурнаяГруппа = НСтр.Номенклатура.УкрупненнаяГруппа;
		НСтр.Поставщик = ПротоколСчитаетсяПоСтавкамКонтрагента;
		НСтр.Договор = НСтр.Поставщик.ОсновнойДоговорКонтрагента;
		
		НСтр.СуммаАванса40 = море40_Себестоимость / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты40 = море40_Себестоимость - НСтр.СуммаАванса40;
		НСтр.СуммаАванса20 = море20_Себестоимость / 100 * Стр.Договор.РазмерАванса;
		НСтр.СуммаОплаты20 = море20_Себестоимость - НСтр.СуммаАванса20;
		
		НСтр.Валюта = ММ_ВалютаФрахтовыхСтавок; 
		
	КонецЕсли;  
	
	//Евросиб - АСуслов 28.03.2022 16:15:46 #42890
	//(     
	//Евросиб - АСуслов 26.09.2022 14:08:02 #57542
	//(
	//УстановитьПризнакОтсутствуетПеревозкаПоЖД();
	//)
	//Евросиб - АСуслов 26.09.2022 14:08:04 #57542
	ЗаполнитьИдентификаторыСтрок();
	//)
	//Евросиб - АСуслов 28.03.2022 16:15:46 #42890
	//Евросиб - АСуслов 09.07.2022 15:10:45 #
	//(
	ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияМультимодальнойЦепочки);
	ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияУслугВнеСтавки);
	ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияСтавокПоФрахту);
	//)
	//Евросиб - АСуслов 09.07.2022 15:10:46 #
	//Евросиб - АСуслов 12.12.2022 14:32:07 #62634
	//(
	//проверка изменена
	//проверять на дубли ключей аналитики
	//перенес в конец процедуры после заполнения ключей
	ПроверитьДублиКлючейАналитики(Отказ);
	//)
	//Евросиб - АСуслов 12.12.2022 14:32:23 #62634
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НормативнаяКонтрибуция = 0;
		Документы.Калькуляция.ПолучитьНормативнуюКонтрибуцию(ЭтотОбъект,НормативнаяКонтрибуция); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
		ДополнительныеСвойства.Вставить("НормативнаяКонтрибуция", НормативнаяКонтрибуция);
	КонецЕсли;
	
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	ДополнительныеСвойства.Вставить("РежимЗаписи",РежимЗаписи);
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	
КонецПроцедуры  

Процедура ПроверитьДублиУслуг(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления КАК ПунктОтправления,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВТ_ДублиОсновныхУслуг
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	//|	КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	//|	КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения КАК ПунктНазначения
	//|ПОМЕСТИТЬ ВТ_ДублиДополнительныхУслуг
	//|ИЗ
	//|	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДублиОсновныхУслуг.Услуга КАК Услуга,
	|	ВТ_ДублиОсновныхУслуг.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ДублиОсновныхУслуг.ПунктНазначения КАК ПунктНазначения,
	|	""1.3 Калькуляция себестоимости по суше"" КАК ИмяТаблицы
	|ИЗ
	|	ВТ_ДублиОсновныхУслуг КАК ВТ_ДублиОсновныхУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДублиОсновныхУслуг.Услуга,
	|	ВТ_ДублиОсновныхУслуг.ПунктОтправления,
	|	ВТ_ДублиОсновныхУслуг.ПунктНазначения
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(1) > 1";
	
	
	//ДИТ Шевченко А.В. TASK 53748 29.06.2022 -Начало
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ДублиДополнительныхУслуг.Услуга,
	//|	ВТ_ДублиДополнительныхУслуг.ПунктОтправления,
	//|	ВТ_ДублиДополнительныхУслуг.ПунктНазначения,
	//|	""3. Услуги, не включенные в ставку""
	//|ИЗ
	//|	ВТ_ДублиДополнительныхУслуг КАК ВТ_ДублиДополнительныхУслуг
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДублиДополнительныхУслуг.Услуга,
	//|	ВТ_ДублиДополнительныхУслуг.ПунктОтправления,
	//|	ВТ_ДублиДополнительныхУслуг.ПунктНазначения
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(1) > 1";
	//ДИТ Шевченко А.В. TASK 53748 29.06.2022 -Конец
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки", "&ММ_КалькуляцияМультимодальнойЦепочки");
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Калькуляция.ЖД_УслугиВнеСтавки", "&ЖД_УслугиВнеСтавки");
	Запрос.УстановитьПараметр("ММ_КалькуляцияМультимодальнойЦепочки", ММ_КалькуляцияМультимодальнойЦепочки.Выгрузить());
	//Запрос.УстановитьПараметр("ЖД_УслугиВнеСтавки", ЖД_УслугиВнеСтавки.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В таблице «%1» найдены дубли строк по ключевым полям «Услуга»-«ПунктОтправления»-«Пункт назначения» (%2-%3-%4)",
																	Выборка.ИмяТаблицы,
																	Выборка.Услуга,
																	Выборка.ПунктОтправления,
																	Выборка.ПунктНазначения));
		КонецЦикла;                                                                            
	КонецЕсли;
	
КонецПроцедуры

//Евросиб - АСуслов 12.12.2022 15:53:39 #62634
//(
Процедура ПроверитьДублиКлючейАналитики(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ДублиОсновныхУслуг
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДублиОсновныхУслуг.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	""1.3 Калькуляция себестоимости по суше"" КАК ИмяТаблицы
	|ПОМЕСТИТЬ ВТ_ДублиКлючейАналитики
	|ИЗ
	|	ВТ_ДублиОсновныхУслуг КАК ВТ_ДублиОсновныхУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДублиОсновныхУслуг.КлючАналитикиСтрокиКалькуляции
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДублиОсновныхУслуг.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	ВТ_ДублиОсновныхУслуг.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ДублиКлючейАналитики КАК ВТ_ДублиКлючейАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДублиОсновныхУслуг КАК ВТ_ДублиОсновныхУслуг
	|		ПО ВТ_ДублиКлючейАналитики.КлючАналитикиСтрокиКалькуляции = ВТ_ДублиОсновныхУслуг.КлючАналитикиСтрокиКалькуляции
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючАналитикиСтрокиКалькуляции,
	|	НомерСтроки";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки", "&ММ_КалькуляцияМультимодальнойЦепочки");
	Запрос.УстановитьПараметр("ММ_КалькуляцияМультимодальнойЦепочки", ММ_КалькуляцияМультимодальнойЦепочки.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	Отказ = Истина;
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В таблице «%1» найдены дубли строк по ключевым полям «Услуга»-«ПунктОтправления»-«Пункт назначения» (%2-%3-%4)",
	//																Выборка.ИмяТаблицы,
	//																Выборка.Услуга,
	//																Выборка.ПунктОтправления,
	//																Выборка.ПунктНазначения));
	//	КонецЦикла;                                                                            
	//КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("КлючАналитикиСтрокиКалькуляции") Цикл
		Отказ = Истина;
		МассивНомеровСтрок = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			МассивНомеровСтрок.Добавить(Выборка.НомерСтроки);
		КонецЦикла;                                                     
		НомераСтрокСтрокой = СтрСоединить(МассивНомеровСтрок, ", ");    
		СписокКлючевыхПолейСтрокой = СтрСоединить(Выборка.КлючАналитикиСтрокиКалькуляции.КлючевыеПоля.ВыгрузитьКолонку("ИмяПоля"), ", ");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строках %1 обнаружены дубли значений ключевых параметров (%2).
		|Требованиями системы для корректной работы создания/изменения расходных строк в экономике сделки и работы Автоакцепта запрещено создавать калькуляции со строками с дублирующимися значениями ключевых параметров.", 
													НомераСтрокСтрокой, СписокКлючевыхПолейСтрокой));
	КонецЦикла;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 12.12.2022 15:53:41 #62634


//Евросиб - АСуслов 31.03.2022 14:53:20 #42890
//(                                                                   
Процедура УстановитьПризнакОтсутствуетПеревозкаПоЖД() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_КалькуляцияМультимодальнойЦепочки
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
	|ИЗ
	|	ВТ_КалькуляцияМультимодальнойЦепочки КАК ВТ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	ВТ_КалькуляцияМультимодальнойЦепочки.Услуга.ОтсутствиеПеревозкиПоЖДДляКалькуляции";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки", "&ММ_КалькуляцияМультимодальнойЦепочки");
	
	Запрос.УстановитьПараметр("ММ_КалькуляцияМультимодальнойЦепочки", ММ_КалькуляцияМультимодальнойЦепочки.Выгрузить());
	
	ОтсутствуетПеревозкаПоЖД = Запрос.Выполнить().Пустой();
		
КонецПроцедуры

//)
//Евросиб - АСуслов 31.03.2022 14:53:22 #42890

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Маршрутизировать = Константы.МаршрутизироватьКалькуляцию.Получить();
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	//Евросиб - АСуслов 15.12.2021 13:46:11 #42234
	//(
	//РежимКалькуляции = Перечисления.РежимыКалькуляции.Мультимодальная;
	//Евросиб - АСуслов 23.12.2021 10:12:28 #
	//(доп от Никитина: поле не заполняем
	//ТипКалькуляции = Перечисления.ТипыКалькуляций.Мультимодальная;
	//)
	//Евросиб - АСуслов 23.12.2021 10:12:29 #
	//)
	//Евросиб - АСуслов 15.12.2021 13:46:13 #42234
	ММ_ДействиеСтавокНа = ТекущаяДата();
	ММ_ГруженыйПоМорю = Истина;
	ММ_ГруженыйПоСуше = Истина;
	НачалоДействия = ТекущаяДата();
	ОкончаниеДействия = ТекущаяДата() + 30 * 24 * 3600;
	ТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд;
	СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	НДСФрахт = Перечисления.СтавкиНДС.НДС0;
	УсловияПеревозки_Отправление = Перечисления.УсловияПеревозкиКТК.CY;
	УсловияПеревозки_Прибытие = Перечисления.УсловияПеревозкиКТК.CY;
	ДатаКурса = ТекущаяДата();
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Запрос") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,Контрагент,Договор");
		Если ЗначениеЗаполнено(Контрагент) И НЕ ЗначениеЗаполнено(Договор) Тогда
			СписокДоговоров = КонтрагентыДоговоры_сервер.ПолучитьДействующиеДоговорыКонтрагента(Контрагент);
			Если СписокДоговоров.Количество() = 1 Тогда
				Договор = СписокДоговоров[0];
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Договор) Тогда
			Валюта = Договор.ВалютаВзаиморасчетов;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения;
		Суша_ПунктОтправления = ДанныеЗаполнения.ПунктОтправления;
		Суша_ПунктНазначения = ДанныеЗаполнения.ПунктНазначения;
		// Евросиб US 87896 TA 91708 Рыбьяков К.А. 16.09.2024 ((
		ПунктНазначения = ММ_ПортыОтправленияНазначения.Добавить();
		ПунктНазначения = ДанныеЗаполнения.ПунктНазначения;
		//ММ_ПортОтправления = ДанныеЗаполнения.ПунктНазначения;
		// Евросиб Рыбьяков К.А. 16.09.2024 ))
		Отправка = ДанныеЗаполнения.Отправка;
	КонецЕсли;
	
	ЖД_ПринадлежностьПС = Перечисления.ПринадлежностьПС.Собственный;
	ЖД_ПериодСбораСтатистикиРаспределенияНачало = ТекущаяДата();
	ЖД_ПериодСбораСтатистикиРаспределенияОкончание = ТекущаяДата() - 90*24*3600;
	ЖД_СтатистикаПоКПЗаПоследниеДней = 90;
	ПС_ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон;
	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	Если ТипКалькуляции = Перечисления.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого Тогда
		ПродуктДКП = Справочники.ПродуктыДКП.СдачаВагонаВПользование;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = неопределено;
	Маршрутизировать = Константы.МаршрутизироватьКалькуляцию.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	КалькуляцияСозданаНаОсновании = ОбъектКопирования.Ссылка;
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	ДатаКурса = ТекущаяДата();
	//++ Зубов 03.08.2021 37315
	Шаблон = Ложь;
	//-- Зубов 03.08.2021 37315 
	//Евросиб - АСуслов 23.12.2021 10:13:27 #
	//(доп от Никитина: поле не копируем
	ТипКалькуляции = Неопределено;
	//)
	//Евросиб - АСуслов 23.12.2021 10:13:29 #
	//Евросиб - АСуслов 07.09.2022 10:50:39 #56211
	//(
	УчетноеНаправление = Неопределено;
	//)
	//Евросиб - АСуслов 07.09.2022 10:50:41 #
	
	//Евросиб Коханенко Н.А. 23.12.2024 (( #97643
	ПС_ВидПеревозки = Неопределено;
	//Евросиб Коханенко Н.А. 23.12.2024 )) #97643
	
	// Евросиб Фролов (28.12.2021 TASK №43954
	Для Каждого ТекущаяСтрока Из ММ_КалькуляцияМультимодальнойЦепочки Цикл
		Если ТекущаяСтрока.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала")
			ИЛИ ТекущаяСтрока.ВнутренняяСебестоимость Тогда	
			ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			ТекущаяСтрока.НДСВключенВСтоимость = Ложь;
		КонецЕсли;	
		Если ТекущаяСтрока.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала") Тогда	
			Если ТарифицируемыйРазмерКТК = "20" Тогда
				ТекущаяСтрока.Цена20 = 1500;			
			ИначеЕсли ТарифицируемыйРазмерКТК = "40" Тогда 
				ТекущаяСтрока.Цена40 = 1500;
			ИначеЕсли ТарифицируемыйРазмерКТК = "2040" Тогда
				ТекущаяСтрока.Цена20 = 1500;
				ТекущаяСтрока.Цена40 = 1500;
			КонецЕсли;
			ТекущаяСтрока.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль");
		КонецЕсли;
		// Евросиб US 86792 TA 86795 Рыбьяков К.А. 15.06.2024 ((
		Если ТекущаяСтрока.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ") Тогда
			ТекущаяСтрока.Услуга = Неопределено;	
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 15.06.2024 ))
	КонецЦикла;
	// Евросиб Фролов)
	
	//Евросиб Каблов 05.12.2025 ( Ticket#0422793
	ОчиститьИдентификаторыСтрок();
	//Евросиб Каблов 05.12.2025 ) Ticket#0422793
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Евросиб Фролов (06.04.2022
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	// Евросиб Фролов)
	
	// блок отработки родительского документа
	МассивСостояний = МаршрутизацияСервер.НайтиПолучитьМассивСостоянийДляОтметки(Состояния);
	МассивРодительскихДокументов = Новый Массив;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		МассивРодительскихДокументов.Добавить(ДокументОснование);
	КонецЕсли;
	МаршрутизацияСервер.ОтметитьВыполнениеРодительскогоДокументаАвтоматически(МассивРодительскихДокументов, МассивСостояний, Отказ);
	
	
	//////// Пересчет планов продаж в случае, если он не зафиксирован и калькуляция изменена!!!
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПланПродажПродукты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПланПродаж.Продукты КАК ПланПродажПродукты
	               |ГДЕ
	               |	ПланПродажПродукты.Калькуляция = &Калькуляция
	               |	И НЕ ПланПродажПродукты.Ссылка.ПланПродажЗафиксирован
	               |	И НЕ ПланПродажПродукты.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Калькуляция", Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ПланОбъект = Ответ.Ссылка.ПолучитьОбъект();
		
		Для каждого стр из ПланОбъект.Продукты Цикл
			
			Если Стр.Калькуляция = Ссылка Тогда
				
				Если НЕ СуммаВключаетНДС ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС0 ИЛИ Стр.Калькуляция.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					
					// доходы 20
					Стр.СтавкаЗа20 = ММ_ИтогоСтавка20;
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.СтавкаЗа20 = Стр.СтавкаЗа20 + Стр8.Ставка20;
					КонецЦикла;
					
					// доходы 40
					Стр.СтавкаЗа40 = ММ_ИтогоСтавка;
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.СтавкаЗа40 = Стр.СтавкаЗа40 + Стр8.Ставка40;
					КонецЦикла;
					
					// контрибуция 20
					Стр.КонтрибуцияЗа20 = ММ_ИтогоВознаграждение20;
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.КонтрибуцияЗа20 = Стр.КонтрибуцияЗа20 + Стр8.Вознаграждение20;
					КонецЦикла;
					
					// контрибуция 40
					Стр.КонтрибуцияЗа40 = ММ_ИтогоВознаграждение;
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.КонтрибуцияЗа40 = Стр.КонтрибуцияЗа40 + Стр8.Вознаграждение40;
					КонецЦикла;
					
				Иначе
					
					// доходы 20
					Стр.СтавкаЗа20 = ПолучитьСуммуБезНДС(ММ_ИтогоСтавка20, СтавкаНДС);
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.СтавкаЗа20 = Стр.СтавкаЗа20 + ПолучитьСуммуБезНДС(Стр8.Ставка20, СтавкаНДС);
					КонецЦикла;
					
					// доходы 40
					Стр.СтавкаЗа40 = ПолучитьСуммуБезНДС(ММ_ИтогоСтавка, СтавкаНДС);
					Для каждого Стр8 из ЖД_УслугиВнеСтавки Цикл
						Стр.СтавкаЗа40 = Стр.СтавкаЗа40 + ПолучитьСуммуБезНДС(Стр8.Ставка40, СтавкаНДС);
					КонецЦикла;
					
					// контрибуция 20
					Стр.КонтрибуцияЗа20 = ПолучитьСуммуБезНДС(ММ_ИтогоВознаграждение20, СтавкаНДС);
					Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
						Стр.КонтрибуцияЗа20 = Стр.КонтрибуцияЗа20 + ПолучитьСуммуБезНДС(Стр8.Вознаграждение20, СтавкаНДС);
					КонецЦикла;
					
					// контрибуция 40
					Стр.КонтрибуцияЗа40 = ПолучитьСуммуБезНДС(ММ_ИтогоВознаграждение, СтавкаНДС);
					Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
						Стр.КонтрибуцияЗа40 = Стр.КонтрибуцияЗа40 + ПолучитьСуммуБезНДС(Стр8.Вознаграждение40, СтавкаНДС);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПланОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("План продаж был обновлен: " + ПланОбъект.Ссылка);
		Попытка
			ПланОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОО = ОписаниеОшибки();
			Сообщить("Ошибка проведения: " + ОО);
		КонецПопытки;
		
	КонецЦикла;
	
	// Евросиб Фролов (28.12.2021 TASK№ 42761
	Если Не Отказ И ЭтотОбъект.ДополнительныеСвойства.Свойство("КалькуляцияИзменена") Тогда
		ОбновитьДанныеДляПечатиВПСЦ();
		//Евросиб Коханенко Н.А. 15.02.2024 (( #80981 
		ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзмененияПоИсточникуКалькуляция(ЭтотОбъект.Ссылка);
		//Евросиб Коханенко Н.А. 15.02.2024 )) #80981 
	КонецЕсли;
	// Евросиб Фролов)
	
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(Ссылка, Перечисления.УзлыОбмена.DX);
	ИначеЕсли ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//Евросиб СубботинВ #131884 02.03.2026 Конец		
		//Евросиб Каблов 14.11.2024 ( #93051	
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
		//Евросиб Каблов 14.11.2024 ) 
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	КонецЕсли;
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	
	
	
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 26.05.2025 ((
	Если Не Отказ Тогда
		ПроверитьИзмененияВКлючахАналитикиНоминацийРелиза(Ссылка);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 26.05.2025 ))
	
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	Если ДополнительныеСвойства.Свойство("НормативнаяКонтрибуция") Тогда
		Если ЗначениеЗаполнено(ДополнительныеСвойства.НормативнаяКонтрибуция) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьНормативнуюКонтрибуциюпоДокументу(Ссылка, ДополнительныеСвойства.НормативнаяКонтрибуция);
		Иначе
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(Ссылка, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.НормативнаяКонтрибуция);
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("РасчетнаяКонтрибуция20") Тогда
		Если ЗначениеЗаполнено(ДополнительныеСвойства.РасчетнаяКонтрибуция20) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьРасчетнуюКонтрибуцию20поДокументу(Ссылка, ДополнительныеСвойства.РасчетнаяКонтрибуция20);
		Иначе
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(Ссылка, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция20);
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("РасчетнаяКонтрибуция40") Тогда
		Если ЗначениеЗаполнено(ДополнительныеСвойства.РасчетнаяКонтрибуция40) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьРасчетнуюКонтрибуцию40поДокументу(Ссылка, ДополнительныеСвойства.РасчетнаяКонтрибуция40);
		Иначе
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(Ссылка, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция40);
		КонецЕсли;
	КонецЕсли;
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305 
	
	//Евросиб Коханенко Н.А. 05.08.2025 (( #115687 
	Если ДополнительныеСвойства.Свойство("ВидЗадолженности") Тогда
		Если ЗначениеЗаполнено(ДополнительныеСвойства.ВидЗадолженности) Тогда
			//запишем аналитику для калькуляции 
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(Ссылка, ДополнительныеСвойства.ВидЗадолженности);
			//получим список связанных заявок
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЗаявкаСоставУслуги.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
				|ГДЕ
				|	ЗаявкаСоставУслуги.Калькуляция = &Калькуляция";
			Запрос.УстановитьПараметр("Калькуляция", Ссылка);
			МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
			Для Каждого ДокументСсылка Из МассивДокументов Цикл
				РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(ДокументСсылка, 
																			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности, 
																			ДополнительныеСвойства.ВидЗадолженности);
			КонецЦикла;
		Иначе
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(Ссылка, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
		КонецЕсли;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 05.08.2025 )) #115687 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ДИТ Моисеенко Ю.В. Ticket#0290442 08.11.2022
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочки.Услуга");
	
	Для Каждого СтрокаКалькуляции Из ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Префикс = "ММ_КалькуляцияМультимодальнойЦепочки[" + Формат(СтрокаКалькуляции.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		Если Не ЗначениеЗаполнено(СтрокаКалькуляции.Услуга) Тогда
			ТекстСообщения = СтрШаблон("В таблице 1.3 в строке %1 поле «Услуга» не заполнено", СтрокаКалькуляции.НомерСтроки);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);		
		КонецЕсли;
		
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. 12.03.2025 (( #100979
	АвтозаполнениеПродуктаВКалькуляцииСДаты = Константы.АвтозаполнениеПродуктаВКалькуляцииСДаты.Получить();
	Если Дата < АвтозаполнениеПродуктаВКалькуляцииСДаты Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипКалькуляции");
		МассивНепроверяемыхРеквизитов.Добавить("ТипЗаказа");
		МассивНепроверяемыхРеквизитов.Добавить("УчетноеНаправление");
		МассивНепроверяемыхРеквизитов.Добавить("ПродуктДКП");
	КонецЕсли;
	//Евросиб Коханенко Н.А. 12.03.2025 )) #100979 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	//--ДИТ Моисеенко Ю.В. Ticket#0290442 08.11.2022 
	
	//Евросиб Коханенко Н.А. 25.12.2023 (( #72829 
	Если КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Контрагент) 
		И КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(ТипКалькуляции) Тогда
		//в служебной калькуляции Комментарий не может оставаться не заполненным
		Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле ""Комментарий"" в служебной калькуляции не может оставаться не заполненным",, "Комментарий", "Объект", Отказ);
		КонецЕсли;
        //Евросиб Коханенко Н.А. 25.12.2023 (( #78960 
		//в служебной сделке должно быть выбрано либо одно, либо другое из значений Отнесения Расходов
		Если НЕ (ОтнестиРасходыНаСебестоимостьКлиента ИЛИ ОтнестиРасходыНаСобственныеЗатраты) Тогда
			ОбщегоНазначения.СообщитьПользователю("Калькуляция не может быть проведена, т.к. вы не выбрали условие по отнесению затрат.",,"ОтнестиРасходыНаСебестоимостьКлиента", "Объект", Отказ);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 25.12.2023 )) #78960
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.12.2023 )) #72829 
	
	//Евросиб Коханенко Н.А. 25.12.2023 (( #79188
	ПроверитьЗаполнениеЦенНаОтрицательность(Отказ);
	//Евросиб Коханенко Н.А. 25.12.2023 )) #79188 
	
	//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
	Отказ = ПроверкаСоответствияЗначенийРеквизитовКалькуляцииЗаявкиПСЦ(Отказ);
	//Евросиб Коханенко Н.А. 12.02.2026 )) #93365 

КонецПроцедуры 

//Евросиб Коханенко Н.А. 25.12.2023 (( #79188
Процедура ПроверитьЗаполнениеЦенНаОтрицательность(Отказ);

	Для Каждого СтрокаКалькуляции Из ММ_КалькуляцияМультимодальнойЦепочки Цикл
		СписокПроверяемыхПолейСОтрицательнымиЗначениями = Новый Структура("Цена20, Цена40, Итого20, Итого40", "ставкой", "ставкой", "суммой", "суммой");
		Для Каждого ПроверяемоеПоле Из СписокПроверяемыхПолейСОтрицательнымиЗначениями Цикл
			Если СтрокаКалькуляции[ПроверяемоеПоле.Ключ] < 0 Тогда                                                                                                     
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ММ_КалькуляцияМультимодальнойЦепочки", СтрокаКалькуляции.НомерСтроки, ПроверяемоеПоле.Ключ);
				ТекстСообщения = СтрШаблон("Строка %1: Калькуляция не может быть записана с отрицательной %2 по номенклатуре.", СтрокаКалькуляции.НомерСтроки, ПроверяемоеПоле.Значение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 
//Евросиб Коханенко Н.А. 25.12.2023 )) #79188 

// Евросиб Фролов (28.12.2021 TASK№ 42761
Процедура ОбновитьДанныеДляПечатиВПСЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПСЦКалькуляции.Ссылка КАК ПСЦ
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Калькуляция = &Калькуляция
	|	И НЕ ПСЦКалькуляции.Ссылка.ПСЦПоставщика
	|	И НЕ ПСЦКалькуляции.Ссылка.НетиповойПротокол
	|	И ПСЦКалькуляции.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.СтатусыСогласования.Планируется)";
	
	Запрос.УстановитьПараметр("Калькуляция", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Перезаполнить печатные данные
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.ПСЦ");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ПСЦ);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ПСЦОбъект = Выборка.ПСЦ.ПолучитьОбъект();
		Документы.ПСЦ.ЗаполнитьДанныеДляПечати(ПСЦОбъект);
		ПСЦОбъект.Записать();
	КонецЦикла;
		
КонецПроцедуры
// Евросиб Фролов)

Функция ПолучитьСуммуБезНДС(Сумма, Ставка)
	
	Множитель = 1;
	Если Ставка = Перечисления.СтавкиНДС.НДС10 Тогда
		Множитель = 1.1;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС18 Тогда
		Множитель = 1.18;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС20 Тогда
		Множитель = 1.20; 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС7 Тогда
		Множитель = 1.07;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС5 Тогда
		Множитель = 1.05;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС22 Тогда
		Множитель = 1.22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	КонецЕсли;
	
	Возврат Сумма / Множитель;
	
КонецФункции
Функция ПолучитьСписокПСЦ()
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	              |	ПСЦКалькуляции.Ссылка КАК ПСЦ
	              |ИЗ
	              |	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ.Состояния КАК ПСЦСостояния
	              |		ПО ПСЦКалькуляции.Ссылка = ПСЦСостояния.Ссылка
	              |ГДЕ
	              |	ПСЦСостояния.Состояние.Согласование = ИСТИНА
	              |	И ПСЦСостояния.Статус В(&Статус)
	              |	И ПСЦКалькуляции.Калькуляция = &Калькуляция
	              |	И (ПСЦКалькуляции.Ссылка.Контрагент <> &Контрагент
	              |			ИЛИ ПСЦКалькуляции.Ссылка.Договор <> &Договор)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ПСЦКалькуляции.Ссылка" ;
  Запрос.УстановитьПараметр("Калькуляция",Ссылка);
  МассивСтатус=Новый Массив;
  МассивСтатус.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
  МассивСтатус.Добавить(Перечисления.СтатусыЭтапов.Выполнен);
  Запрос.УстановитьПараметр("Статус",МассивСтатус);
  Запрос.УстановитьПараметр("Контрагент",Контрагент);
  Запрос.УстановитьПараметр("Договор",Договор);
 
  Результат=Запрос.Выполнить().Выгрузить();
  Возврат Результат;
КонецФункции

//++ Зубов 03.08.2021 37315
&НаСервере
Функция ПолучитьНестандартнуюМаршрутизацию(НовМаршрутизация,ПроцДоходности)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Маршрутизация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Маршрутизация КАК Маршрутизация
		|ГДЕ
		|	Маршрутизация.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НовМаршрутизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПодходящаяМаршрутизация = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		Если Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов <> 0 И Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов > ПроцДоходности Тогда
			Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЕсли;
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению));
	КонецЦикла;
	МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, Дата, Договор);
	МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, Дата, ПС_ВидПеревозки);
	Возврат РезультатЗапроса;
КонецФункции

//Евросиб - АСуслов 28.03.2022 16:18:11 #42890
//(
Процедура ЗаполнитьИдентификаторыСтрок() Экспорт
	
	СтрокиДляЗаполнения = ММ_КалькуляцияМультимодальнойЦепочки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ""));
	Для каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;
	
	СтрокиДляЗаполнения = НФ_ВыбранныеСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ""));
	Для каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;  
	
	СтрокиДляЗаполнения = ЖД_УслугиВнеСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ""));
	Для каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;  
КонецПроцедуры
//)
//Евросиб - АСуслов 28.03.2022 16:18:26 #42890
//Евросиб - АСуслов 09.07.2022 15:11:11 #
//(
Процедура ЗаполнитьКлючиАналитикиСтрокКалькуляции(РазделКалькуляции) Экспорт
	
	ТекстЗапросаДляОтладки = "";
	Если РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияМультимодальнойЦепочки Тогда
		ТаблицаКалькуляции = ММ_КалькуляцияМультимодальнойЦепочки;
	ИначеЕсли РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияУслугВнеСтавки Тогда
		ТаблицаКалькуляции = ЖД_УслугиВнеСтавки;
	ИначеЕсли РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияСтавокПоФрахту Тогда
		ТаблицаКалькуляции = НФ_ВыбранныеСтавки;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоля КАК ИмяПоля,
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоляКакВыражениеТекстаЗапроса КАК ИмяПоляКакВыражениеТекстаЗапроса,
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ЗначениеПоляКакВыражениеТекстаЗапроса КАК ЗначениеПоляКакВыражениеТекстаЗапроса
	|ИЗ
	|	Справочник.КлючиАналитикиСтрокКалькуляции.КлючевыеПоля КАК КлючиАналитикиСтрокКалькуляцииКлючевыеПоля
	|ГДЕ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.РазделКалькуляции = &РазделКалькуляции
	|	И КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ИспользуетсяКакШаблон
	|	И НЕ КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("РазделКалькуляции", РазделКалькуляции);
	РезультатЗапроса = Запрос.Выполнить();
	КлючевыеПоля = РезультатЗапроса.Выгрузить();
	ТекстЗапросаПоля = "";                               
	ИндексСтроки = 0;
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СтрокиКалькуляции ИЗ &СтрокиКалькуляции КАК СтрокиКалькуляции";
	Запрос.УстановитьПараметр("СтрокиКалькуляции", ТаблицаКалькуляции.Выгрузить());
	ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст + ";";
	Запрос.Выполнить();
	
	ТекстЗапросаОбщий = "";                                  
	ВсегоЗапросов = 0; 
	Для каждого КлючевоеПоле Из КлючевыеПоля Цикл        
		ВсегоЗапросов = ВсегоЗапросов + 1;
		ШаблонЗапроса = ПолучитьШаблонЗапроса(); 
		Если ЗначениеЗаполнено(КлючевоеПоле.ИмяПоляКакВыражениеТекстаЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяПоляКалькуляции", СтрШаблон("%1", КлючевоеПоле.ИмяПоляКакВыражениеТекстаЗапроса));
		Иначе			
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяПоляКалькуляции", СтрШаблон("""%1""", КлючевоеПоле.ИмяПоля));
		КонецЕсли;
		Если ЗначениеЗаполнено(КлючевоеПоле.ЗначениеПоляКакВыражениеТекстаЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеПоляКалькуляции", СтрШаблон("%1", КлючевоеПоле.ЗначениеПоляКакВыражениеТекстаЗапроса));
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеПоляКалькуляции", СтрШаблон("СтрокиКалькуляции.%1", КлючевоеПоле.ИмяПоля));
		КонецЕсли;
		Если ВсегоЗапросов > 1 Тогда
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_ПоляСтрокКалькуляции", "");
		КонецЕсли;
		ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	КонецЦикла;   
	Запрос.Текст = ТекстЗапросаОбщий;
	ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст;
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка КАК КлючАналитики,
	|   ВЫБОР КОГДА КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка = &ТекущийКлючАналитики Тогда 1 Иначе 0 КОНЕЦ КАК ДополнительнаяСортировка
	|ИЗ
	|	Справочник.КлючиАналитикиСтрокКалькуляции.КлючевыеПоля КАК КлючиАналитикиСтрокКалькуляцииКлючевыеПоля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоляСтрокКалькуляции КАК т
	|		ПО КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоля = т.ИмяПоля
	|			И КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ЗначениеПоля = т.ЗначениеПоля
	|			И (т.ИдентификаторСтроки = &ИдентификаторСтроки)
	|ГДЕ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.РазделКалькуляции = &РазделКалькуляции
	|   И НЕ КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ПометкаУдаления 
	|
	|СГРУППИРОВАТЬ ПО
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка) = &КоличествоАналитик
	|УПОРЯДОЧИТЬ ПО ДополнительнаяСортировка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.ИмяПоля КАК ИмяПоля,
	|	т.ЗначениеПоля КАК ЗначениеПоля
	|ИЗ
	|	ВТ_ПоляСтрокКалькуляции КАК т
	|ГДЕ
	|	т.ИдентификаторСтроки = &ИдентификаторСтроки"; 
	Запрос.УстановитьПараметр("РазделКалькуляции", РазделКалькуляции);
	СтрокиДляЗаполнения = ТаблицаКалькуляции;
	Для каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл  
		ТекстЗапросаДляОтладкиВЦикле = "";
		Запрос.УстановитьПараметр("ИдентификаторСтроки", СтрокаДляЗаполнения.ИдентификаторСтроки);
		Запрос.УстановитьПараметр("КоличествоАналитик", КлючевыеПоля.Количество());
		Запрос.УстановитьПараметр("ТекущийКлючАналитики", СтрокаДляЗаполнения.КлючАналитикиСтрокиКалькуляции);
		ТекстЗапросаДляОтладкиВЦикле = ТекстЗапросаДляОтладки + Запрос.Текст;
		Пакеты = Запрос.ВыполнитьПакет();
		КоличествоПакетов = Пакеты.Количество();
		Если Пакеты[КоличествоПакетов-2].Пустой() Тогда
			Ключ = Справочники.КлючиАналитикиСтрокКалькуляции.СоздатьЭлемент();
			Ключ.РазделКалькуляции = РазделКалькуляции;
			Ключ.КлючевыеПоля.Загрузить(Пакеты[КоличествоПакетов-1].Выгрузить());
			Ключ.Записать();
			КлючАналитики = Ключ.Ссылка;
		Иначе
			КлючАналитики = Пакеты[КоличествоПакетов-2].Выгрузить()[0].КлючАналитики
		КонецЕсли;
		СтрокаДляЗаполнения.КлючАналитикиСтрокиКалькуляции = КлючАналитики;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗапросКлючейАналитикиРазделаКалькуляции(РазделКалькуляции, ТаблицаКалькуляции)

	
КонецФункции

Функция ПолучитьШаблонЗапроса()
	ШаблонЗапроса = 
	"ВЫБРАТЬ     
	|   СтрокиКалькуляции.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	&ИмяПоляКалькуляции КАК ИмяПоля,
	|	ЕСТЬNULL(&ЗначениеПоляКалькуляции, НЕОПРЕДЕЛЕНО) КАК ЗначениеПоля
	|ПОМЕСТИТЬ ВТ_ПоляСтрокКалькуляции
	|ИЗ
	|	ВТ_СтрокиКалькуляции КАК СтрокиКалькуляции";
	Возврат ШаблонЗапроса;
КонецФункции


//)
//Евросиб - АСуслов 09.07.2022 15:11:12 #

//Евросиб Коханенко Н.А. 28.11.2023 (( #78073
Процедура УдалениеПустыхСтрокТЧЛокаций(ТабличнаяЧасть)
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого Стр из ТабличнаяЧасть Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Станция) Тогда
			МассивУдаляемыхСтрок.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	Для каждого Стр из МассивУдаляемыхСтрок Цикл
		ТабличнаяЧасть.Удалить(Стр);
	КонецЦикла;

КонецПроцедуры
//Евросиб Коханенко Н.А. 28.11.2023 )) #78073   

// Евросиб US 88683 TA 108959 Рыбьяков К.А. 26.05.2025 ((
Процедура ПроверитьИзмененияВКлючахАналитикиНоминацийРелиза(КалькуляцияСсылка)
	
	Если ЗначениеЗаполнено(КалькуляцияСсылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КлючиАналитикиНоминацийРелиза.Ссылка КАК КлючАналитикиНоминаций,
		|	КлючиАналитикиНоминацийРелиза.Калькуляция КАК Калькуляция,
		|	КлючиАналитикиНоминацийРелиза.СтавкаНДС КАК СтавкаНДС,
		|	КлючиАналитикиНоминацийРелиза.Валюта КАК Валюта,
		|	КлючиАналитикиНоминацийРелиза.Ставка КАК Ставка,
		|	КлючиАналитикиНоминацийРелиза.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	КлючиАналитикиНоминацийРелиза.Контейнер КАК Контейнер,
		|	КлючиАналитикиНоминацийРелиза.Сделка КАК Сделка,
		|	КлючиАналитикиНоминацийРелиза.Контейнер.ТипТЕ.РазмерКТК.Размер КАК РазмерКТК
		|ПОМЕСТИТЬ ВТ_КлючиСКалькуляцией
		|ИЗ
		|	Справочник.КлючиАналитикиНоминацийРелиза КАК КлючиАналитикиНоминацийРелиза
		|ГДЕ
		|	КлючиАналитикиНоминацийРелиза.Калькуляция = &Калькуляция
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи КАК СтокСдачи
		|ПОМЕСТИТЬ ВТ_СтокиСдачи
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|					&Период,
		|					КТК В
		|						(ВЫБРАТЬ
		|							ВТ_КлючиСКалькуляцией.Контейнер
		|						ИЗ
		|							ВТ_КлючиСКалькуляцией КАК ВТ_КлючиСКалькуляцией)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_КлючиСКалькуляцией.КлючАналитикиНоминаций КАК КлючАналитикиНоминаций,
		|	ВТ_КлючиСКалькуляцией.Калькуляция КАК Калькуляция,
		|	ВТ_КлючиСКалькуляцией.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_КлючиСКалькуляцией.Валюта КАК Валюта,
		|	ВТ_КлючиСКалькуляцией.Ставка КАК Ставка,
		|	ВТ_КлючиСКалькуляцией.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ВТ_КлючиСКалькуляцией.Контейнер КАК Контейнер,
		|	ВТ_КлючиСКалькуляцией.Сделка КАК Сделка,
		|	ВТ_СтокиСдачи.СтокСдачи КАК СтокСдачи,
		|	СТРОКА(ВТ_КлючиСКалькуляцией.РазмерКТК) КАК РазмерКТК
		|ИЗ
		|	ВТ_КлючиСКалькуляцией КАК ВТ_КлючиСКалькуляцией
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтокиСдачи КАК ВТ_СтокиСдачи
		|		ПО ВТ_КлючиСКалькуляцией.Контейнер = ВТ_СтокиСдачи.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалькуляцияСписокСтанцийНазначения.Ссылка КАК Калькуляция,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.СтавкаНДС КАК СтавкаНДС,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.Валюта КАК Валюта,
		|	СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20) + КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение КАК Ставка20,
		|	СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40) + КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение40 КАК Ставка40,
		|	КалькуляцияСписокСтанцийНазначения.Станция КАК Станция,
		|	ВТ_КлючиСКалькуляцией.КлючАналитикиНоминаций КАК КлючАналитикиНоминаций
		|ИЗ
		|	Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|		ПО КалькуляцияСписокСтанцийНазначения.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлючиСКалькуляцией КАК ВТ_КлючиСКалькуляцией
		|		ПО КалькуляцияСписокСтанцийНазначения.Ссылка = ВТ_КлючиСКалькуляцией.Калькуляция
		|ГДЕ
		|	КалькуляцияСписокСтанцийНазначения.Ссылка = &Калькуляция
		|	
		|СГРУППИРОВАТЬ ПО
		|	КалькуляцияСписокСтанцийНазначения.Ссылка,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.СтавкаНДС,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.СуммаВключаетНДС,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.Валюта,
		|	КалькуляцияСписокСтанцийНазначения.Станция,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение,
		|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение40,
		|	ВТ_КлючиСКалькуляцией.КлючАналитикиНоминаций";
		
		Запрос.УстановитьПараметр("Калькуляция", КалькуляцияСсылка);
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеКлюча = РезультатыЗапроса[2].Выбрать();
		
		ДанныеКалькуляции = РезультатыЗапроса[3].Выгрузить();
		
		Пока ДанныеКлюча.Следующий() Цикл
			НайденныеСтроки = ДанныеКалькуляции.НайтиСтроки(Новый Структура("КлючАналитикиНоминаций", ДанныеКлюча.КлючАналитикиНоминаций));
			Для Каждого ПараметрыКалькуляции Из НайденныеСтроки Цикл
				Если (ДанныеКлюча.РазмерКТК = "40" 
					И ПараметрыКалькуляции.ТарифицируемыйРазмерКТК <> "20") 
					И (ДанныеКлюча.Ставка <> ПараметрыКалькуляции.Ставка40
						ИЛИ ДанныеКлюча.СтавкаНДС <> ПараметрыКалькуляции.СтавкаНДС 
						ИЛИ ДанныеКлюча.Валюта <> ПараметрыКалькуляции.Валюта
						ИЛИ ДанныеКлюча.СуммаВключаетНДС <> ПараметрыКалькуляции.СуммаВключаетНДС) Тогда
					Параметры = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ПараметрыКалькуляции);
					Параметры.Вставить("Ставка", Параметры.Ставка40);
					Параметры.Вставить("Сделка", ДанныеКлюча.Сделка);
					КлючАналитикиОбъект = ДанныеКлюча.КлючАналитикиНоминаций.ПолучитьОбъект();
					Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитикиОбъект, Параметры);
				ИначеЕсли (ДанныеКлюча.РазмерКТК = "20" 
					И ПараметрыКалькуляции.ТарифицируемыйРазмерКТК <> "40") 
					И (ДанныеКлюча.Ставка <> ПараметрыКалькуляции.Ставка20
						ИЛИ ДанныеКлюча.СтавкаНДС <> ПараметрыКалькуляции.СтавкаНДС 
						ИЛИ ДанныеКлюча.Валюта <> ПараметрыКалькуляции.Валюта
						ИЛИ ДанныеКлюча.СуммаВключаетНДС <> ПараметрыКалькуляции.СуммаВключаетНДС)Тогда
					Параметры = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ПараметрыКалькуляции);
					Параметры.Вставить("Ставка", Параметры.Ставка20);
					Параметры.Вставить("Сделка", ДанныеКлюча.Сделка);
					КлючАналитикиОбъект = ДанныеКлюча.КлючАналитикиНоминаций.ПолучитьОбъект();
					Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитикиОбъект, Параметры);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // Евросиб Рыбьяков К.А. 26.05.2025 ))

//Евросиб Каблов 05.12.2025 Ticket#0422793
Процедура ОчиститьИдентификаторыСтрок()
	
	Для каждого СтрокаДляЗаполнения Из ММ_КалькуляцияМультимодальнойЦепочки Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = "";
	КонецЦикла;
	
	Для каждого СтрокаДляЗаполнения Из НФ_ВыбранныеСтавки Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = "";
	КонецЦикла;  
	
	Для каждого СтрокаДляЗаполнения Из ЖД_УслугиВнеСтавки Цикл
		СтрокаДляЗаполнения.ИдентификаторСтроки = "";
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов(ДокументСравнения, НомерДокументаСравнения, МассивРеквизитов)

	КоличествоРеквизитовБольшеОдного = МассивРеквизитов.Количество() > 1; 
	КоличествоРеквизитовРавноДва = МассивРеквизитов.Количество() = 2;
	ТекстСообщения = СтрШаблон("В %1 № %2 пол%3 %4 не совпада%5т с аналогичным%6 пол%3м%6 в калькуляции. Необходимо внести изменения.", 
	ДокументСравнения,
	ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерДокументаСравнения),
		?(КоличествоРеквизитовБольшеОдного, "я", "е"),
		СтрСоединить(МассивРеквизитов, ?(КоличествоРеквизитовРавноДва, " и ", ", ")),
		?(КоличествоРеквизитовБольшеОдного, "ю", "е"),
		?(КоличествоРеквизитовБольшеОдного, "и", ""));
	Возврат ТекстСообщения;
	
КонецФункции 

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция ПроверкаСоответствияЗначенийРеквизитовКалькуляцииЗаявкиПСЦ(Отказ);
	
	ОтказРезультат = Отказ;
	
	//для начала найдем все модифицированные реквизиты
	ПроверяемыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Контрагент, Договор, Организация, ЦФО, ТипКалькуляции, Валюта");
	ИзмененныеРеквизиты = Новый Массив;
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если ЭтотОбъект[Реквизит.Ключ] <> Реквизит.Значение Тогда
			Проверять = Истина;
		Иначе
			Проверять = Ложь;
		КонецЕсли;
		ИзмененныеРеквизиты.Добавить(Новый Структура("Проверять, Ключ, Значение", Проверять, Реквизит.Ключ, Реквизит.Значение));
	КонецЦикла;
	
	//если что-то из нашего списка менялось, то сравним с реквизитами в связанных заявках и ПСЦ
	Если ИзмененныеРеквизиты.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Заявка.Ссылка КАК Заявка,
			|	Заявка.Номер КАК Номер,
			|	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция,
			|	Заявка.Контрагент КАК Контрагент,
			|	Заявка.Договор КАК Договор,
			|	ЕСТЬNULL(ЗначенияДополнительныхАналитикДокументовЗаявки.Значение, ЗначенияДополнительныхАналитикДокументовПСЦ.Значение) КАК ТранзитДляКлиента
			|ПОМЕСТИТЬ вт_СвязанныеЗаявки
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументовЗаявки
			|			ПО (ЗначенияДополнительныхАналитикДокументовЗаявки.Документ = Заявка.Ссылка)
			|				И (ЗначенияДополнительныхАналитикДокументовЗаявки.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументовПСЦ
			|			ПО (ЗначенияДополнительныхАналитикДокументовПСЦ.Документ = Заявка.ПСЦ)
			|				И (ЗначенияДополнительныхАналитикДокументовПСЦ.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента))
			|		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
			|			И (Заявка.Проведен)
			|			И (ЗаявкаСоставУслуги.Калькуляция = &Калькуляция)
			|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПСЦ.Ссылка КАК Ссылка,
			|	ПСЦ.Номер КАК Номер,
			|	ПСЦ.Контрагент КАК Контрагент,
			|	ПСЦ.Договор КАК Договор,
			|	ПСЦ.Организация КАК Организация,
			|	ПСЦ.ЦФО КАК ЦФО,
			|	ПСЦ.ВидПеревозки КАК ВидПеревозки,
			|	ПСЦ.ТипКалькуляции КАК ТипКалькуляции,
			|	ПСЦ.Валюта КАК Валюта,
			|	ЗначенияДополнительныхАналитикДокументовПСЦ.Значение КАК ТранзитДляКлиента
			|ПОМЕСТИТЬ вт_СвязанныеПСЦ
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
			|		ПО ПСЦКалькуляции.Ссылка = ПСЦ.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_СвязанныеЗаявки КАК вт_СвязанныеЗаявки
			|		ПО вт_СвязанныеЗаявки.Калькуляция = ПСЦКалькуляции.Калькуляция
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументовПСЦ
			|		ПО (ЗначенияДополнительныхАналитикДокументовПСЦ.Документ = ПСЦ.Ссылка)
			|			И (ЗначенияДополнительныхАналитикДокументовПСЦ.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента))
			|ГДЕ
			|	ПСЦКалькуляции.Калькуляция = &Калькуляция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеПСЦ.Номер КАК Номер,
			|	&ПроверятьКонтрагент И вт_СвязанныеПСЦ.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор И вт_СвязанныеПСЦ.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьОрганизация И вт_СвязанныеПСЦ.Организация <> &Организация КАК ОшибкаОрганизация,			
			|	&ПроверятьЦФО И вт_СвязанныеПСЦ.ЦФО <> &ЦФО КАК ОшибкаЦФО,
			|	&ПроверятьТипКалькуляции И вт_СвязанныеПСЦ.ТипКалькуляции <> &ТипКалькуляции КАК ОшибкаТипКалькуляции,
			|	&ПроверятьВалюта И вт_СвязанныеПСЦ.Валюта <> &Валюта КАК ОшибкаВалюта
			|ИЗ
			|	вт_СвязанныеПСЦ КАК вт_СвязанныеПСЦ
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеПСЦ.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеПСЦ.Договор <> &Договор
			|			ИЛИ &ПроверятьОрганизация
			|				И вт_СвязанныеПСЦ.Организация <> &Организация
			|			ИЛИ &ПроверятьЦФО
			|				И вт_СвязанныеПСЦ.ЦФО <> &ЦФО
			|			ИЛИ &ПроверятьТипКалькуляции
			|				И вт_СвязанныеПСЦ.ТипКалькуляции <> &ТипКалькуляции
			|			ИЛИ &ПроверятьВалюта
			|				И вт_СвязанныеПСЦ.Валюта <> &Валюта)
			|УПОРЯДОЧИТЬ ПО
			|	Номер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеЗаявки.Номер КАК Номер,
			|	&ПроверятьКонтрагент И вт_СвязанныеЗаявки.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор И вт_СвязанныеЗаявки.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьТранзитДляКлиента И вт_СвязанныеЗаявки.ТранзитДляКлиента <> &ТранзитДляКлиента КАК ОшибкаТранзитДляКлиента
			|ИЗ
			|	вт_СвязанныеЗаявки КАК вт_СвязанныеЗаявки
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеЗаявки.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеЗаявки.Договор <> &Договор
			|			ИЛИ &ПроверятьТранзитДляКлиента
			|				И вт_СвязанныеЗаявки.ТранзитДляКлиента <> &ТранзитДляКлиента)
			|УПОРЯДОЧИТЬ ПО
			|	Номер
			|";
		Запрос.УстановитьПараметр("Калькуляция", Ссылка);
		Для Каждого Параметр Из ИзмененныеРеквизиты Цикл
			Запрос.УстановитьПараметр("Проверять" + Параметр.Ключ, Параметр.Проверять);
			Запрос.УстановитьПараметр(Параметр.Ключ, ЭтотОбъект[Параметр.Ключ]);
		КонецЦикла; 
		//пока непонятно, как проверять этот реквизит
		Запрос.УстановитьПараметр("ПроверятьТранзитДляКлиента", Ложь);
		Запрос.УстановитьПараметр("ТранзитДляКлиента", Неопределено);
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаПСЦ = Результат[2].Выбрать();
		Пока ВыборкаПСЦ.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаПСЦ.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаОрганизация Тогда МассивРеквизитов.Добавить("Организация") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаЦФО Тогда МассивРеквизитов.Добавить("ЦФО") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаТипКалькуляции Тогда МассивРеквизитов.Добавить("ТипКалькуляции") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаВалюта Тогда МассивРеквизитов.Добавить("Валюта") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("ПСЦ", ВыборкаПСЦ.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла;   
		ВыборкаЗаявки = Результат[3].Выбрать();
		Пока ВыборкаЗаявки.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаЗаявки.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаЗаявки.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаЗаявки.ОшибкаТранзитДляКлиента Тогда МассивРеквизитов.Добавить("ТранзитДляКлиента") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("Заявке", ВыборкаЗаявки.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат РезультатОтказ;

КонецФункции //Евросиб Коханенко Н.А. 12.02.2026 )) #93365 

//&НаСервере
//Функция СтандартнаяМаршрутизацияНаСервере()
//	Если ТипЗнч(КалькуляцияСозданаНаОсновании) = Тип("ДокументСсылка.Калькуляция") Тогда
//		Если КалькуляцияСозданаНаОсновании.Шаблон Тогда 
//			Если ЗначениеЗаполнено(КалькуляцияСозданаНаОсновании.Контрагент) Тогда
//				Если Контрагент<>КалькуляцияСозданаНаОсновании.Контрагент Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				Иначе
//					Если ПроверитьИзменениеМодальности() Тогда
//						СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//					ИначеЕсли ММ_ИтогоСтавка>=КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ ММ_ИтогоСтавка20>=КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//						СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//					ИначеЕсли ММ_ИтогоСтавка<КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ ММ_ИтогоСтавка20<КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//						СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//					Иначе
//						СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//					КонецЕсли;
//				КонецЕсли;
//			ИначеЕсли НЕ ЗначениеЗаполнено(КалькуляцияСозданаНаОсновании.Контрагент) Тогда
//				Если ПроверитьИзменениеМодальности() Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				ИначеЕсли ММ_ИтогоСтавка>=КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ ММ_ИтогоСтавка20>=КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//					СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//				ИначеЕсли ММ_ИтогоСтавка<КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ ММ_ИтогоСтавка20<КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				Иначе
//					СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//				КонецЕсли;
//			КонецЕсли;
//		Иначе
//			СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//		КонецЕсли;
//	Иначе
//		СтандартнаяМаршрутизация = "Стандарт";
//	КонецЕсли;
//	
//	Возврат СтандартнаяМаршрутизация;
//КонецФункции

//&НаСервере
//Функция ПроверитьИзменениеМодальности()
//	ИзмененоБулево = Ложь;
//	Если ММ_КоличествоВагонов <> КалькуляцияСозданаНаОсновании.ММ_КоличествоВагонов
//		ИЛИ ММ_КоличествоКТК <> КалькуляцияСозданаНаОсновании.ММ_КоличествоКТК
//		ИЛИ ММ_СтавкаПредоставленияПлатформы <> КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияПлатформы
//		ИЛИ ММ_КоличествоКТКНаВагон <> КалькуляцияСозданаНаОсновании.ММ_КоличествоКТКНаВагон
//		ИЛИ ММ_ГруженыйПоСуше <> КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоСуше
//		ИЛИ ММ_СтавкаПредоставленияКТК20 <> КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК20
//		ИЛИ ММ_СтавкаПредоставленияКТК40 <> КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК40
//		ИЛИ ЕдиницаИзмерения <> КалькуляцияСозданаНаОсновании.ЕдиницаИзмерения
//		ИЛИ ЖД_РасчетСебестоимостиДляТипаФГП <> КалькуляцияСозданаНаОсновании.ЖД_РасчетСебестоимостиДляТипаФГП
//		ИЛИ Груз <> КалькуляцияСозданаНаОсновании.Груз
//		ИЛИ СтавкаНДС <> КалькуляцияСозданаНаОсновании.СтавкаНДС
//		ИЛИ СуммаВключаетНДС <> КалькуляцияСозданаНаОсновании.СуммаВключаетНДС
//		ИЛИ веб_ДляКТКЕвросиб <> КалькуляцияСозданаНаОсновании.веб_ДляКТКЕвросиб
//		ИЛИ веб_ДляКТККлиента <> КалькуляцияСозданаНаОсновании.веб_ДляКТККлиента
//		ИЛИ СпециальныеУсловия <> КалькуляцияСозданаНаОсновании.СпециальныеУсловия
//		ИЛИ УсловияПримененияСтавки <> КалькуляцияСозданаНаОсновании.УсловияПримененияСтавки
//		ИЛИ ТипЗаказа <> КалькуляцияСозданаНаОсновании.ТипЗаказа
//		ИЛИ Суша_ПунктОтправления <> КалькуляцияСозданаНаОсновании.Суша_ПунктОтправления
//		ИЛИ УсловияПеревозки_Отправление <> КалькуляцияСозданаНаОсновании.УсловияПеревозки_Отправление
//		ИЛИ Суша_ПунктНазначения <> КалькуляцияСозданаНаОсновании.Суша_ПунктНазначения
//		ИЛИ УсловияПеревозки_Прибытие <> КалькуляцияСозданаНаОсновании.УсловияПеревозки_Прибытие
//		ИЛИ ЖД_ПринадлежностьПС <> КалькуляцияСозданаНаОсновании.ЖД_ПринадлежностьПС
//		ИЛИ ПС_ВидПеревозки <> КалькуляцияСозданаНаОсновании.ПС_ВидПеревозки
//		ИЛИ ТерриторияМаршрута <> КалькуляцияСозданаНаОсновании.ТерриторияМаршрута
//		//ИЛИ ММ_Вознаграждение <> КалькуляцияСозданаНаОсновании.ММ_Вознаграждение
//		//ИЛИ ММ_Вознаграждение40 <> КалькуляцияСозданаНаОсновании.ММ_Вознаграждение40
//		ИЛИ ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС <> КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС
//		ИЛИ ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС <> КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС
//		ИЛИ ЖД_СредняяЗагрузкаПлатформ <> КалькуляцияСозданаНаОсновании.ЖД_СредняяЗагрузкаПлатформ
//		ИЛИ ЖД_СреднийПроцентСороковок <> КалькуляцияСозданаНаОсновании.ЖД_СреднийПроцентСороковок
//		ИЛИ ММ_ГруженыйПоМорю <> КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоМорю
//		ИЛИ ММ_ДействиеСтавокНа <> КалькуляцияСозданаНаОсновании.ММ_ДействиеСтавокНа
//		ИЛИ Море_УсловияПогрузки <> КалькуляцияСозданаНаОсновании.Море_УсловияПогрузки
//		ИЛИ Море_УсловияВыгрузки <> КалькуляцияСозданаНаОсновании.Море_УсловияВыгрузки
//		ИЛИ ММ_ПортОтправления  <> КалькуляцияСозданаНаОсновании.ММ_ПортОтправления Тогда
//		ИзмененоБулево = Истина;
//	КонецЕсли;
//	
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из ММ_КалькуляцияЖДСоставляющей Цикл
//			Если Строка.Операция <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Операция
//				ИЛИ Строка.Пробег <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Пробег 
//				ИЛИ Строка.ДлительностьДней <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ДлительностьДней 
//				ИЛИ Строка.СчПробег <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СчПробег 
//				ИЛИ Строка.Стоимость <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Стоимость 
//				ИЛИ Строка.НДС <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].НДС 
//				ИЛИ Строка.СтоимостьИтого <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтоимостьИтого 
//				ИЛИ Строка.СтанцияОтправления <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияОтправления 
//				ИЛИ Строка.СтанцияНазначения <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияНазначения 
//				ИЛИ Строка.Груз <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Груз 
//				ИЛИ Строка.ТипВагона <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ТипВагона 
//				ИЛИ Строка.ПринадлежностьВагона <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ПринадлежностьВагона Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из ММ_КалькуляцияКТКСоставляющей Цикл
//			Если Строка.Пробег <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Пробег
//				ИЛИ Строка.ДлительностьДней <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].ДлительностьДней
//				ИЛИ Строка.СчПробег <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].СчПробег
//				ИЛИ Строка.Операция <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Операция Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из ММ_КалькуляцияМультимодальнойЦепочки Цикл
//			Если Строка.Услуга <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Услуга
//				ИЛИ Строка.Затраты <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Затраты
//				ИЛИ Строка.ВыставляемаяУслуга <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВыставляемаяУслуга
//				ИЛИ Строка.Поставщик <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Поставщик
//				ИЛИ Строка.Договор <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Договор
//				ИЛИ Строка.Тариф20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф20
//				ИЛИ Строка.Тариф40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф40
//				ИЛИ Строка.ПунктОтправления <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктОтправления
//				ИЛИ Строка.ПунктНазначения <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктНазначения
//				ИЛИ Строка.Цена20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена20
//				ИЛИ Строка.Цена40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена40
//				ИЛИ Строка.СтавкаНДС <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаНДС
//				ИЛИ Строка.НДСВключенВСтоимость <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НДСВключенВСтоимость
//				ИЛИ Строка.НормативныйПроцентВознаграждения20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения20
//				ИЛИ Строка.НормативныйПроцентВознаграждения40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения40
//				ИЛИ Строка.Вознаграждение20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение20
//				ИЛИ Строка.Вознаграждение40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение40
//				ИЛИ Строка.СуммаВознаграждения20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения20
//				ИЛИ Строка.СуммаВознаграждения40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения40
//				ИЛИ Строка.Итого20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого20
//				ИЛИ Строка.Итого40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого40
//				ИЛИ Строка.СтавкаМаксимальная20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная20
//				ИЛИ Строка.СтавкаМаксимальная40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная40
//				ИЛИ Строка.СуммаНДС20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС20
//				ИЛИ Строка.СуммаНДС40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС40
//				ИЛИ Строка.Валюта <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Валюта
//				ИЛИ Строка.ВнутренняяСебестоимость <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВнутренняяСебестоимость
//				ИЛИ Строка.Возмещаемая <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Возмещаемая
//				ИЛИ Строка.ПодсылПорожних <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПодсылПорожних
//				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
//				ИЛИ Строка.Примечание20 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание20
//				ИЛИ Строка.Примечание40 <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание40
//				ИЛИ Строка.ГруппаУслуг <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ГруппаУслуг
//				ИЛИ Строка.ОсновнаяУслугаГруппы <> КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ОсновнаяУслугаГруппы Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из НФ_ПортыОтправленияНазначения Цикл
//			Если Строка.Порт <> КалькуляцияСозданаНаОсновании.НФ_ПортыОтправленияНазначения[Строка.НомерСтроки-1].Порт Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из НФ_Линии Цикл
//			Если Строка.Линия <> КалькуляцияСозданаНаОсновании.НФ_Линии[Строка.НомерСтроки-1].Линия Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Если НЕ ИзмененоБулево Тогда
//		Для каждого Строка из ЖД_УслугиВнеСтавки Цикл
//			Если Строка.Услуга <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Услуга
//				ИЛИ Строка.ПунктОтправления <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктОтправления
//				ИЛИ Строка.ПунктНазначения <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктНазначения
//				ИЛИ Строка.ВидРасходов <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВидРасходов
//				ИЛИ Строка.Валюта <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Валюта
//				ИЛИ Строка.СтавкаНДС <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДС
//				ИЛИ Строка.СуммаВключаетНДС <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СуммаВключаетНДС
//				ИЛИ Строка.СтавкаМаксимальная <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаМаксимальная
//				ИЛИ Строка.Тариф20 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф20
//				ИЛИ Строка.ПроцентВознаграждения <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПроцентВознаграждения
//				ИЛИ Строка.СтавкаНДСВознаграждения <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДСВознаграждения
//				ИЛИ Строка.ВознаграждениеВключаетНДС <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВознаграждениеВключаетНДС
//				ИЛИ Строка.БазаДляРасчетаВР <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].БазаДляРасчетаВР
//				ИЛИ Строка.Себестоимость20 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость20
//				ИЛИ Строка.НормВознаграждение20 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение20
//				ИЛИ Строка.Вознаграждение20 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение20
//				ИЛИ Строка.Ставка20 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка20
//				ИЛИ Строка.Себестоимость40 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость40
//				ИЛИ Строка.НормВознаграждение40 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение40
//				ИЛИ Строка.Вознаграждение40 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение40
//				ИЛИ Строка.Ставка40 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка40
//				ИЛИ Строка.Поставщик <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Поставщик
//				ИЛИ Строка.Договор <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Договор
//				ИЛИ Строка.Тариф40 <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф40
//				ИЛИ Строка.ТипСтавки <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ТипСтавки
//				ИЛИ Строка.ВключатьВПФПСЦ <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВключатьВПФПСЦ
//				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
//				ИЛИ Строка.ОснованиеДляВыставления <> КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ОснованиеДляВыставления Тогда
//				ИзмененоБулево = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//	Возврат ИзмененоБулево;
//КонецФункции
////-- Зубов 03.08.2021 37315


ИгнорироватьПроверкуНаПрава = Ложь; 


