// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
Процедура ДобавитьРазрешение(СтруктураПараметров) Экспорт 
	НаборЗаписей  = РегистрыСведений.РазрешенныйПериодРедактирования.СоздатьНаборЗаписей(); 
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),СтруктураПараметров);
	НаборЗаписей.Записать();	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
Процедура УдалитьРазрешение() Экспорт 
	НаборЗаписей  = РегистрыСведений.РазрешенныйПериодРедактирования.СоздатьНаборЗаписей(); 
	НаборЗаписей.Записать();	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
Функция ПолучитьСтруктуруПараметров() Экспорт 
	
	ПустаяДата = Дата(1,1,1);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачалаПериодаРазрешенияРедактирования",		ПустаяДата);
	СтруктураПараметров.Вставить("ДатаОкончанияПериодаРазрешенияРедактирования",	ПустаяДата);
	СтруктураПараметров.Вставить("ДатаНачалаРазрешенногоПериодаПереноса",			ПустаяДата);
	СтруктураПараметров.Вставить("ДатаОкончанияРазрешенногоПериодаПереноса",		ПустаяДата);
	СтруктураПараметров.Вставить("ПериодыУстановлены",								Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
Функция ПолучитьАктуальныйПериодРедактирования() Экспорт
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РазрешенныйПериодРедактирования.*
		|ИЗ
		|	РегистрСведений.РазрешенныйПериодРедактирования КАК РазрешенныйПериодРедактирования";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураПараметров,ВыборкаДетальныеЗаписи);
		СтруктураПараметров.Вставить("ПериодыУстановлены", Истина); 
	КонецЕсли;
	
	Возврат СтруктураПараметров;

КонецФункции	
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
