
&НаСервере
Процедура СоздатьПеревозкуНаСервере(РеестрМассив)

	
	Для Каждого ГУ12 Из РеестрМассив Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.атк_ГУ12 = &ГУ12
		               |	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ГУ12",ГУ12);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Количество()>0 Тогда
			Пока Выборка.Следующий() Цикл      				
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();  				
			КонецЦикла;
		Иначе       
			ДокОб = Документы.ЗаказПокупателя.СоздатьДокумент();			
		КонецЕсли;
		
				
		ДокОб.Контрагент = ГУ12.Контрагент;
	

		
		//Получим данные по вагонам из регистра
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НакладнаяВагоны.Ссылка КАК Ссылка,
		               |	НакладнаяВагоны.НомерВагона КАК НомерВагона,
		               |	НакладнаяВагоны.СобственникОКПО КАК СобственникОКПО,
		               |	НакладнаяВагоны.СобственникНаименование КАК СобственникНаименование,
		               |	НакладнаяВагоны.РодВагонаНаименование КАК РодВагонаНаименование,
		               |	НакладнаяВагоны.МассыВКгБрутто КАК МассыВКгБрутто,
		               |	НакладнаяВагоны.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		               |	НакладнаяВагоны.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
		               |	НакладнаяВагоны.Ссылка.Грузоотправитель КАК Грузоотправитель,
		               |	НакладнаяВагоны.Ссылка.ЗаявкаГУ12 КАК ЗаявкаГУ12,
		               |	НакладнаяВагоны.Ссылка.Грузополучатель КАК Грузополучатель,
		               |	НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
		               |	НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
		               |	НакладнаяВагоны.Ссылка.ДатаИВремяПринятияГрузаКПеревозке КАК ДатаИВремяПринятияГрузаКПеревозке,
		               |	НакладнаяВагоны.Ссылка.ВидСообщения КАК ВидСообщения,
		               |	НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
		               |	НакладнаяВагоны.Ссылка.ПлательщикКод КАК ПлательщикКод,
		               |	НакладнаяВагоны.Ссылка.ОсновнаяНакладная КАК ОсновнаяНакладная,
		               |	НакладнаяВагоны.Ссылка.ПлательщикНаименование КАК ПлательщикНаименование,
		               |	НакладнаяВагоны.Ссылка.ОтправкаВид КАК ОтправкаВид,
		               |	ВЫБОР
		               |		КОГДА ПлатежиПоОтправлению.СуммаВРублях ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ПлатежиПоОтправлению.СуммаВРублях
		               |	КОНЕЦ КАК СуммаВРубляхОтпр,
		               |	ВЫБОР
		               |		КОГДА ПлатежиПоОтправлению.СуммаНалога ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ПлатежиПоОтправлению.СуммаНалога
		               |	КОНЕЦ КАК СуммаНалогаОтпр,
		               |	ПлатежиПоОтправлению.СтавкаНалога КАК СтавкаНалогаОтпр,
		               |	ПлатежиПоОтправлению.ТипСбора КАК ТипСбораОтпр,
		               |	ВЫБОР
		               |		КОГДА ПлатежиПоПрибытию.СуммаВРублях ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ПлатежиПоПрибытию.СуммаВРублях
		               |	КОНЕЦ КАК СуммаВРубляхПриб,
		               |	ВЫБОР
		               |		КОГДА ПлатежиПоПрибытию.СуммаНалога ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ПлатежиПоПрибытию.СуммаНалога
		               |	КОНЕЦ КАК СуммаНалогаПриб,
		               |	ПлатежиПоПрибытию.СтавкаНалога КАК СтавкаНалогаПриб,
		               |	ПлатежиПоПрибытию.ТипСбораНаименование КАК ТипСбораНаименованиеПриб,
		               |	ПлатежиПоПрибытию.ТипСбора КАК ТипСбораПриб,
		               |	ПлатежиПоОтправлению.СуммаВРублях + ПлатежиПоПрибытию.СуммаВРублях КАК ВсегоСуммаВРублях,
		               |	ПлатежиПоОтправлению.СуммаНалога + ПлатежиПоПрибытию.СуммаНалога КАК ВсегоСуммаНалоговВРублях,
		               |	НакладнаяВагоны.МассыВКгНетто КАК МассыВКгНетто,
		               |	Грузы.ЕТСНГ КАК ЕТСНГ
		               |ИЗ
		               |	Документ.э_Накладная.Вагоны КАК НакладнаяВагоны
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка КАК Ссылка,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона КАК НомерВагона,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях КАК СуммаВРублях,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога КАК СуммаНалога,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога КАК СтавкаНалога,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.ТипСбора КАК ТипСбора
		               |		ИЗ
		               |			Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению) КАК ПлатежиПоОтправлению
		               |		ПО НакладнаяВагоны.Ссылка = ПлатежиПоОтправлению.Ссылка
		               |			И НакладнаяВагоны.НомерВагона = ПлатежиПоОтправлению.НомерВагона
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка КАК Ссылка,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона КАК НомерВагона,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях КАК СуммаВРублях,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога КАК СуммаНалога,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога КАК СтавкаНалога,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.ТипСбораНаименование КАК ТипСбораНаименование,
		               |			э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.ТипСбора КАК ТипСбора
		               |		ИЗ
		               |			Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию) КАК ПлатежиПоПрибытию
		               |		ПО НакладнаяВагоны.Ссылка = ПлатежиПоПрибытию.Ссылка
		               |			И НакладнаяВагоны.НомерВагона = ПлатежиПоПрибытию.НомерВагона
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			э_НакладнаяГрузы.Ссылка КАК Ссылка,
		               |			э_НакладнаяГрузы.ЕТСНГ КАК ЕТСНГ
		               |		ИЗ
		               |			Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузы) КАК Грузы
		               |		ПО НакладнаяВагоны.Ссылка = Грузы.Ссылка
		               |ГДЕ
		               |	НакладнаяВагоны.Ссылка.ЗаявкаГУ12.НомерЗаявки = &ГУ12";
		
		Запрос.УстановитьПараметр("ГУ12",ГУ12.НомерЗаявки);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		
		ДокОб.атк_Этапы.Очистить();	
				
		
		ДокОб.атк_УслугиПоставщиковПоВагонам.Очистить();
		ДокОб.атк_ТранспортныеСредства.Очистить();
		Пока Выборка.Следующий() Цикл  
			
			ПараметрОтбора = Новый Структура;
			
			Если ЗначениеЗаполнено(Выборка.СтанцияОтправления) Тогда
				ПараметрОтбора.Вставить("ПунктОтправления",Выборка.СтанцияОтправления);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтанцияНазначения) Тогда
				ПараметрОтбора.Вставить("ПунктНазначения",Выборка.СтанцияНазначения);
			КонецЕсли;

			Если ЗначениеЗаполнено(Выборка.ЕТСНГ) Тогда
				ПараметрОтбора.Вставить("ГрузПоЕТСНГ",Выборка.ЕТСНГ);
			КонецЕсли;
	
			НС = ДокОб.атк_Этапы.НайтиСтроки(ПараметрОтбора);
			
			Если  НС.Количество() = 0 Тогда
				НовСтрокаЭтапы = ДокОб.атк_Этапы.Добавить();
				НовСтрокаЭтапы.ТипПеревозки = Перечисления.атк_ТипПеревозки.ЖелезнаяДорога;
				ИДСтроки = Новый УникальныйИдентификатор;
				НовСтрокаЭтапы.ИДСтроки = ИДСтроки;
				НовСтрокаЭтапы.ПунктОтправления = Выборка.СтанцияОтправления;
				НовСтрокаЭтапы.ПунктНазначения  = Выборка.СтанцияНазначения; 
				НовСтрокаЭтапы.ГрузПоЕТСНГ     =  Выборка.ЕТСНГ;
			Иначе
				ИДСтроки = НС[0].ИДСтроки;
			КонецЕсли;
			
			
			
			НовСтрока = ДокОб.атк_ТранспортныеСредства.Добавить();
			НовСтрока.Вагон = ПолучитьВагон(Выборка.НомерВагона);
			НовСтрока.НомерНакладной = Выборка.НакладнаяНомер;
			НовСтрока.ПДЦ = ГУ12.ПДЦ;
			НовСтрока.Вес = Выборка.МассыВКгНетто;
			НовСтрока.ИДСтрокиЭтапа = ИДСтроки;
			
			
			НовСтрокаУслуги = ДокОб.атк_УслугиПоставщиковПоВагонам.Добавить();
			НовСтрокаУслуги.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("12.1.1. Услуги и сборы, включаемые в перевозочный документ");
			НовСтрокаУслуги.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("РЖД ОАО");
			НовСтрокаУслуги.Количество = 1;
			НовСтрокаУслуги.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("Вагон");
			НовСтрокаУслуги.Цена = Выборка.СуммаВРубляхОтпр + Выборка.СуммаВРубляхПриб;
			НовСтрокаУслуги.Всего = НовСтрокаУслуги.Цена;
			НовСтрокаУслуги.Сумма = НовСтрокаУслуги.Цена;
			НовСтрокаУслуги.СуммаНДС =  Выборка.СуммаНалогаОтпр+Выборка.СуммаНалогаПриб;
			НовСтрокаУслуги.ИДСтрокиЭтапа = ИДСтроки;
			НовСтрокаУслуги.Вагон = НовСтрока.Вагон;
			НовСтрокаУслуги.НомерЭтапа = НовСтрокаЭтапы.НомерЭтапа;
		КонецЦикла;
		
		
		
		ДокОб.аткПунктОтправления = ГУ12.СтанцияОтправления;
		ДокОб.аткГрузоотправитель = Выборка.Грузоотправитель;
		ДокОб.аткГрузополучатель = Выборка.Грузополучатель;
		ДокОб.аткЕТСНГ = Выборка.ЕТСНГ;
		//ДокОб.аткПунктНазначения = НовСтрокаЭтапы.ПунктНазначения;
		ДокОб.Дата = ГУ12.Дата;
		ДокОб.Контрагент = ГУ12.Контрагент;
		ДокОб.ДатаОтгрузки = ГУ12.Дата;
		ДокОб.атк_ГУ12 = ГУ12;
		
		
		ДокОб.Записать();
		
	КонецЦикла;
	

		
		
		
		
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВагон(Вагон)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	атк_Вагоны.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.атк_Вагоны КАК атк_Вагоны
	|ГДЕ
	|	атк_Вагоны.Код = &НомерВагона";
	
	Запрос.УстановитьПараметр("НомерВагона",Вагон);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка; 
		
	КонецЦикла;
	
	СпрОб = Справочники.атк_Вагоны.СоздатьЭлемент();
	СпрОб.Код = Вагон;
	СпрОб.Наименование = Вагон;
	СпрОб.Записать();
	Возврат СпрОб.Ссылка;
	
КонецФункции
	
&НаКлиенте
Процедура СоздатьПеревозку(Команда)
	
	РеестрМассив = Элементы.Список.ВыделенныеСтроки;
	СоздатьПеревозкуНаСервере(РеестрМассив);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПеревозкуНаСервереПоДаннымПодрядчиков(РеестрМассив)

	
	Для Каждого ГУ12 Из РеестрМассив Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка КАК Ссылка
					   |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.атк_ГУ12 = &ГУ12";
		
		Запрос.УстановитьПараметр("ГУ12",ГУ12);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Количество()>0 Тогда
			Пока Выборка.Следующий() Цикл      				
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();  				
			КонецЦикла;
		Иначе       
			ДокОб = Документы.ЗаказПокупателя.СоздатьДокумент();			
		КонецЕсли;
		
				
		ДокОб.Контрагент = ГУ12.Контрагент;
		
		
		//Получим данные по вагонам из регистра
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	атк_ДанныеПоставщиков.Период КАК Период,
		|	атк_ДанныеПоставщиков.Контрагент КАК Контрагент,
		|	атк_ДанныеПоставщиков.Вагон КАК Вагон,
		|	атк_ДанныеПоставщиков.Номенклатура КАК Номенклатура,
		|	атк_ДанныеПоставщиков.НомерНакладной КАК НомерНакладной,
		|	атк_ДанныеПоставщиков.ЕТСНГ КАК ЕТСНГ,
		|	атк_ДанныеПоставщиков.ТипТС КАК ТипТС,
		|	атк_ДанныеПоставщиков.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
		|	атк_ДанныеПоставщиков.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
		|	атк_ДанныеПоставщиков.СтанцияВходаВРФ КАК СтанцияВходаВРФ,
		|	атк_ДанныеПоставщиков.Грузоотправитель КАК Грузоотправитель,
		|	атк_ДанныеПоставщиков.Грузополучатель КАК Грузополучатель,
		|	атк_ДанныеПоставщиков.НомерГу12 КАК НомерГу12,
		|	атк_ДанныеПоставщиков.ПлательщикНаСтанцииОтправления КАК ПлательщикНаСтанцииОтправления,
		|	атк_ДанныеПоставщиков.ПлательщикНаСтанцииНазначения КАК ПлательщикНаСтанцииНазначения,
		|	атк_ДанныеПоставщиков.МассаНетто КАК МассаНетто,
		|	атк_ДанныеПоставщиков.Тариф КАК Тариф,
		|	атк_ДанныеПоставщиков.СуммаНДСТариф КАК СуммаНДСТариф,
		|	атк_ДанныеПоставщиков.ДополнительныйПлатеж КАК ДополнительныйПлатеж,
		|	атк_ДанныеПоставщиков.НДСДополнительныйПлатеж КАК НДСДополнительныйПлатеж,
		|	атк_ДанныеПоставщиков.Таможня КАК Таможня,
		|	атк_ДанныеПоставщиков.ВидСообщения КАК ВидСообщения
		|ИЗ
		|	РегистрСведений.атк_ДанныеПоставщиков КАК атк_ДанныеПоставщиков
		|ГДЕ
		|	атк_ДанныеПоставщиков.НомерГу12 = &ГУ12Номер";
		
		Запрос.УстановитьПараметр("ГУ12Номер",ГУ12.НомерЗаявки);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		
		ДокОб.атк_Этапы.Очистить();	
		НовСтрокаЭтапы = ДокОб.атк_Этапы.Добавить();
		НовСтрокаЭтапы.ТипПеревозки = Перечисления.атк_ТипПеревозки.ЖелезнаяДорога;
		НовСтрокаЭтапы.ИДСтроки = Новый УникальныйИдентификатор;
		
		ДокОб.атк_УслугиПоставщиковПоВагонам.Очистить();
		ДокОб.атк_ТранспортныеСредства.Очистить();
		Пока Выборка.Следующий() Цикл  			
			НовСтрока = ДокОб.атк_ТранспортныеСредства.Добавить();
			НовСтрока.Вагон = ПолучитьВагон(Выборка.Вагон);
			НовСтрока.НомерНакладной = Выборка.НомерНакладной;
			НовСтрока.Вес = Выборка.МассаНетто;
			НовСтрока.ИДСтрокиЭтапа = НовСтрокаЭтапы.ИДСтроки;
			
			
			НовСтрокаУслуги = ДокОб.атк_УслугиПоставщиковПоВагонам.Добавить();
			НовСтрокаУслуги.ИДСтрокиЭтапа = НовСтрокаЭтапы.ИДСтроки;
			НовСтрокаУслуги.Вагон = НовСтрока.Вагон;
			НовСтрокаУслуги.Сумма = Выборка.Тариф;
			
		КонецЦикла;
		
		НовСтрокаЭтапы.ПунктОтправления = ГУ12.СтанцияОтправления;
		НовСтрокаЭтапы.ПунктНазначения  = Справочники.атк_Станции.НайтиПоКоду(Выборка.СтанцияНазначенияКод);
		
		ДокОб.аткПунктОтправления = ГУ12.СтанцияОтправления;
		ДокОб.аткГрузоотправитель = Выборка.Грузоотправитель;
		ДокОб.аткГрузополучатель = Выборка.Грузополучатель;
		ДокОб.аткЕТСНГ = Справочники.атк_ЕТСНГ.НайтиПоКоду(Выборка.ЕТСНГ);
		ДокОб.аткПунктНазначения = НовСтрокаЭтапы.ПунктНазначения;
		ДокОб.Дата = ГУ12.Дата;
		ДокОб.Контрагент = ГУ12.Контрагент;
		ДокОб.ДатаОтгрузки = ГУ12.Дата;
		ДокОб.атк_ГУ12 = ГУ12;
		
		
		ДокОб.Записать();
		
	КонецЦикла;
	

		
		
		
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьСогласованиеГУ12(Команда)
	
	э_ОбщиеСервер.АвтоматическаяОтработкаГУ12();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрОшибокЗагрузки(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаПросмотраОшибок", Этаформа);
	ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаПросмотраОшибокЭтран",,, ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПросмотраОшибок(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрВсехОшибок(Команда)
	ОткрытьФорму("РегистрСведений.ОшибкиЗагрузкиЭТРАН.Форма.ФормаСписка",,, ЭтаФорма.УникальныйИдентификатор, ,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

