
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Коханенко Н.А. #61705 20.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 20.12.2022 )
	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния            
	
	ЦветТекста_Исходный   = WebЦвета.Черный;
	ЦветТекста_Выделенный = WebЦвета.Красный;
    ЦветТекста_Кнопки     = ЦветаСтиля.ЦветТекстаКнопки; 
	
	//Субботин 71114 начало 06.09.2023 переделал алгоритм
	//ЗаполнитьСписокПолейЗаполнятьВниз();
	//Субботин 71114 Конец 06.09.2023 переделал алгоритм

	Если Параметры.Ключ.Пустая() Тогда
		ОбновитьДанныеФормыПоВагонам();	
	КонецЕсли;	
	
	// Управляем видимостью полей Передислокации
	ВидимостьПередислокаций = РеквизитЗаполненВОднойИзСтрокВагонаИлиВсейТЧ(, 
		"ПотребовалсяПодсылПорожнегоВагона"); 
	
	ОпределитьАктуальныеДатыИСтанции();
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ИндексПоезда = ПолучитьИндексПоезда();
	КонецЕсли;
	ПоследнийЗаполненныйРейс = Объект.Рейс; 
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации()
	//Субботин 78646 13.12.2023 Конец 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ОбновитьВидимостьПредупрежденияБлокировки();
	
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
	УстановитьГруппировкуПоВагонамЦветомТекста();
	
	Элементы.ПредупреждениеРедактирования.Видимость = ПроверитьУсловияРейсЗавершен(); 
	Элементы.ПредупреждениеРедактирования.Заголовок 
		= "Реф.сцеп расформирован. Дальнейшая работа с документом невозможна. При наличии контейнеров перенесите их в другой реф.сцеп.";
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если не Параметры.Ключ.Пустая() Тогда
		ОбновитьДанныеФормыПоВагонам();	
	КонецЕсли;	
	
	ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ();	
	
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
	Если не Объект.ЕстьСделкаЗаявкиПоРефСцепу Тогда
		
		тзЗаявок = РефСцепСервер.ПолучитьЗаявкиПоКлючамАналитикиРефСцепа(ВсеКлючиАналитикиПеревозкиРефСцепа(), Объект.Ссылка).Выгрузить();
		тзЗаявок.Свернуть("Заявка");
		
		Объект.ЕстьСделкаЗаявкиПоРефСцепу 
			= РефСцепСервер.ПроверитьЕстьЛиПроведеннаяСделкаЗаявокПоРефсцепу(тзЗаявок.ВыгрузитьКолонку("Заявка"));
		
	КонецЕсли;
                    
	Объект.ВагоныРефСцепа.Загрузить(РефСцепСервер.ПолучитьТЧВагоныСПодсыламиЖДН(
		ПолучитьтзДанныеДокументаВагоныДляЖДНПодсыла(), Объект.ВагоныРефСцепа.Выгрузить(), Объект.Ссылка)
		.ТаблицаДоИзменений);
		
	ОбновитьДанныеКлючаНаФормеСервер();
	ДетализацияПоГрузуИзКлючей();
	
    ВерсияКлючаТЧ("ВагоныРефСцепа");
    ВерсияКлючаТЧ("Контейнеры");
	
	Если ПроверитьУсловияРейсЗавершен() Тогда
		Объект.РейсЗавершен = Истина;
	КонецЕсли;
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации()
	//Субботин 78646 13.12.2023 Конец 
	
КонецПроцедуры

&НаСервере
Процедура ВерсияКлючаТЧ(ИмяТЧ)
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл 
		Стр.ВерсияКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ВерсияДанных");
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьДанныеФормыПоВагонам();    
	
	ОбновитьПанельТекущегоПользователя();
	
	ОбновитьПанельСостояний();
	
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);
	
	ОбновитьДанныеКлючаНаФормеСервер(); 
	
	//Евросиб Коханенко Н.А. 16.09.2024 (( #90312
	ТаблицаКлючей = РеквизитФормыВЗначение("ТаблицаУдаляемыхКлючей");
	Для каждого Ключ из ТаблицаКлючей Цикл
		УдалитьСсылкуНаРефИзКлючаАналитики(Ключ.КлючАналитикиПеревозки);
	КонецЦикла; 
	//Евросиб Коханенко Н.А. 16.09.2024 )) #90312

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	
	Этаформа.Модифицированность = Ложь;
	
	УстановитьГруппировкуПоВагонамЦветомТекста();
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации();
	//Субботин 78646 13.12.2023 Конец
	
	//Субботин 78028 11.01.2024 Начало	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));
	Оповестить("НеобходимоОбновитьДанныеКлючейАналитикиПеревозки", , ЭтаФорма);
	//Субботин 78028 11.01.2024 Конец

КонецПроцедуры  

#КонецОбласти

//Евросиб Коханенко Н.А. #61705 20.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//Евросиб Коханенко Н.А. #61705 20.12.2022 )

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
		// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект
		, ТекущийИсполнитель_Состояние
		, ТекущийИсполнитель_Статус
		, ТекущийИсполнитель_Исполнитель
		, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры    

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда

		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРефСцеп(ПараметрыЗапроса, Объект.Дата);
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
		
	КонецЕсли;
	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.ШаблонДокумента.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции
// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

// ++ ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") 
				ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
		// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Объект.Состояния.Загрузить(СогласованиеСервер.ПолучитьДанныеПоСостояниямОбъектаИзБазы(Объект.Ссылка));
	
КонецПроцедуры 

// -- ОБЛАСТЬ СОСТОЯНИЯ

// ++ Дудоров С.В. 13.12.2022 №57543
&НаСервере
Функция ПолучитьИндексПоезда()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепВагоныРефСцепа.ИндексПоезда КАК ИндексПоезда
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&ТЧВагоны КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.ЭтоКонтейнерСДГК = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Вагоны.ИндексПоезда КАК ИндексПоезда
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны";
	
	Запрос.УстановитьПараметр("ТЧВагоны",Объект.ВагоныРефСцепа.Выгрузить(,"ЭтоКонтейнерСДГК, ИндексПоезда"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИндексПоезда;
	КонецЦикла;

	Возврат "";	

КонецФункции

&НаКлиенте
Процедура СтанцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РефСцепКлиент.ОткрытьВыборЛокацийСЖДСтанциями(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#Область ФактическиеДаты

&НаСервере
Процедура ОпределитьАктуальныеДатыИСтанции()
	
	Если ЗначениеЗаполнено(Объект.Рейс) Тогда
		ВсеЖДН = РефСцепСервер.ПолучитьЖДНСделкиПоРейсу(Объект.Рейс);
		Объект.ПланируемоеОтправление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рейс, "ДатаОтправления");
		Объект.ПланируемоеПрибытие    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рейс, "ДатаПрибытия");
		Объект.СтанцияОтправления	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рейс, "ПунктОтправления");
		Объект.СтанцияНазначения      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рейс, "ПунктНазначения");
	Иначе	
    	Возврат;
	КонецЕсли;
	
	Выборка = РефСцепСервер.ОпределитьПоздниеФактическиеДатыСпискаЖДН(ВсеЖДН);
	
	Пока Выборка.Следующий() Цикл		
		Объект.Сделка = Выборка.Сделка;
		Объект.ТранспортныйДокумент = Выборка.ТранспортныйДокумент;
		Если не Выборка.ДатаИВремяОтправленияГруза > ТекущаяДата() Тогда
				Объект.ФактическоеОтправление = Выборка.ДатаИВремяОтправленияГруза;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Фактическая дата отправления " 
			+ Формат(Выборка.ДатаИВремяОтправленияГруза,"ДФ=") + " больше текущей даты " +	
			+ Формат(ТекущаяДата(),"ДФ=")); 
		КонецЕсли;
		Если не Выборка.ДатаИВремяПрибытияГрузаМестная>ТекущаяДата() Тогда
			
			Объект.ФактическоеПрибытие = Выборка.ДатаИВремяПрибытияГрузаМестная;
			
			Объект.ФактическоеПрибытиеИзмененоВручную = Ложь;
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Фактическая дата прибытия " 
			+ Формат(Выборка.ДатаИВремяПрибытияГрузаМестная,"ДФ=") + " больше текущей даты " +	
			+ Формат(ТекущаяДата(),"ДФ=")); 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ФактическоеОтправлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ДатыБольшеТекущей(ВыбранноеЗначение, СтандартнаяОбработка, "ФактическоеОтправление") Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФактическоеПрибытиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ДатыБольшеТекущей(ВыбранноеЗначение, СтандартнаяОбработка, "ФактическоеПрибытие") Тогда
		Возврат;
	КонецЕсли;	

	Если Объект.ФактическоеПрибытие <> ВыбранноеЗначение Тогда
		ФактическоеПрибытиеИзмененоВручную = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Функция ДатыБольшеТекущей(ВыбранноеЗначение, СтандартнаяОбработка, ИмяРеквизитаФормы)
	
	Если ВыбранноеЗначение > ТекущаяДата() Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю(
	   		НСтр("ru = 'Вводимая дата не может быть позже текущей!'"), ,
	   		ИмяРеквизитаФормы);

		СтандартнаяОбработка = Ложь;
		
		Возврат Истина;
		
	КонецЕсли;	

	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура РейсПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Рейс) Тогда
       	ОпределитьАктуальныеДатыИСтанции();
		ПоследнийЗаполненныйРейс = Объект.Рейс;
	Иначе	
		
		Если (ПоследнийЗаполненныйРейс <> ПредопределенноеЗначение("Справочник.РейсыЖД.ПустаяСсылка") 
			и Объект.СтанцияОтправления  = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПоследнийЗаполненныйРейс, "ПунктОтправления") 
			и Объект.СтанцияНазначения   = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПоследнийЗаполненныйРейс, "ПунктНазначения"))
			или ПоследнийЗаполненныйРейс = ПредопределенноеЗначение("Справочник.РейсыЖД.ПустаяСсылка") Тогда
			    Объект.СтанцияОтправления = Неопределено;
			    Объект.СтанцияНазначения  = Неопределено;
		КонецЕсли;	  
			  
		Объект.ПланируемоеОтправление  = Дата(1,1,1);	
		Объект.ПланируемоеПрибытие	   = Дата(1,1,1);	
		Объект.ФактическоеОтправление  = Дата(1,1,1);
		Если не Объект.ФактическоеПрибытиеИзмененоВручную Тогда 
			Объект.ФактическоеПрибытие = Дата(1,1,1);
		КонецЕсли;	
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы() 
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере() 
	
	РольДоступнаПОлныеПрава = РольДоступна("ПолныеПрава"); 
	
	ЗапретДоступаПоРолям = РольДоступна("dc_РаботаСЗаявками") 
	и не РольДоступна("dc_УправлениеРефСцепами")
	И не РольДоступнаПОлныеПрава;
	Элементы.ВагоныРефСцепаОбновитьДанныеОВагонахВРефСцепе.Доступность = не ЗапретДоступаПоРолям;
	//
	Элементы.ПланируемоеОтправление.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Рейс) или ЗапретДоступаПоРолям; 
	Элементы.ПланируемоеПрибытие.ТолькоПросмотр    = ЗначениеЗаполнено(Объект.Рейс) или ЗапретДоступаПоРолям;
	Элементы.ФактическоеОтправление.ТолькоПросмотр = Истина;
	Элементы.ФактическоеПрибытие.ТолькоПросмотр    = Объект.ЕстьСделкаЗаявкиПоРефСцепу или ЗапретДоступаПоРолям;
	Элементы.Рейс.ТолькоПросмотр    			   = Объект.ЕстьСделкаЗаявкиПоРефСцепу или ЗапретДоступаПоРолям;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПолейВагонов
// 2.2, 2.3, 2.4
&НаКлиенте
Процедура ОбновитьДанныеОВагонахВРефСцепе(Команда)
	
	Если не Объект.Проведен Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(                          
			"Обновление данных не выполнено т.к. документ не проведен.");
		
		Возврат;
		
	ИначеЕсли Объект.РейсЗавершен Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(                          
			"Обновление данных не выполнено т.к. перевозка завершена.");

		Возврат;
		
	КонецЕсли;	
	
	ОбновитьДанныеОВагонахПоРегиструНаСервере();
	
	ЭтаФорма.Модифицированность = Истина; 
	
	УстановитьГруппировкуПоВагонамЦветомТекста();
	
	ОчиститьПометкиБезОрганичений();
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации()
	//Субботин 78646 13.12.2023 Конец	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОВагонахПоРегиструНаСервере()
	
	// Обновляем данные с учетом регистра ВагоныРефСцепа
	
	ЭтоОбновлениеДанныхИзРегистра = Истина;
	
	Объект.ВагоныРефСцепа.Загрузить(
		РефСцепСервер.ПолучитьДанныеФормыРегистраБазыДокумента
		(Объект.ВагоныРефСцепа.Выгрузить()
		, Объект.РефСцеп
		, Истина
		, Объект.Ссылка)
		);
	// Удаляем контейнеры вагонов, которых нет в регистре Вагоны реф.сцепа
	
	//Если не ЗначениеЗаполнено(Объект.ФактическоеОтправление) Тогда
	
		Для каждого стр из Объект.ВагоныРефСцепа Цикл
			Если Стр.Контейнер = Справочники.ТЕ.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
			Стр.Отметка = не Стр.ЕстьВагонВРегистреНаФорме;
		КонецЦикла;	
		
		ОтвязатьКонтейнерыОтВагоновНаСервере(Истина);

	//КонецЕсли;	
	
    УдалитьВагоныНеВходящиеВРефСцеп();
	
	ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ();
	
	Если ПроверитьУсловияРейсЗавершен() Тогда
		Объект.РейсЗавершен = Истина;
	КонецЕсли;	
	
	ПроверитьДобавитьДГК(); 
	
	ЗакрытьЗадачу(Справочники.Состояния.ОбновитьДанныеОВагонахВРефСцепе);	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДобавитьТанкКонтейнер(ДГК, ДанныеСтрокиСДГК)
	ТанкКонтейнер = РефСцепСервер.ПолучитьТанкКонтейнерНаСервере(ДГК);
	Если ТанкКонтейнер <> Справочники.ТЕ.ПустаяСсылка() Тогда
		мТанкКонтейнера = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Контейнер", ТанкКонтейнер));
		Если мТанкКонтейнера.Количество()= 0 Тогда
			НоваяСтрока = Объект.ВагоныРефСцепа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтрокиСДГК,, "Клиент,  
			|Груз,
			|Клиент,
			|ВесКонтейнераБрутто,
			|Отметка,
			|ВесКонтейнераНетто,
			|ПеренесенВРефСцеп,
			|ЭтоКонтейнерСДГК,
			//|Заявка
			|КлючАналитикиПеревозки"); 
			НоваяСтрока.Контейнер  		 = ТанкКонтейнер;
			НоваяСтрока.ЭтоТанкКонтейнер = Истина; 
			НоваяСтрока.Типоразмер 		 = НоваяСтрока.Контейнер.ТипТЕ; 
			НоваяСтрока.Клиент 	 		 = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
			НоваяСтрока.Ответственный 	 = Объект.Автор;
            //Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
			//ОбновитьДанныеКлючаАналитикиПеревозки(НоваяСтрока, "ВагоныРефСцепа");
			//Субботин 78028 21.12.2023 Конец
			НоваяСтрока.СостояниеКонтейнера = Перечисления.СостоянияКТК.Порожний;
			
		Иначе
			Для Каждого Стр из мТанкКонтейнера Цикл
				Стр.ЭтоТанкКонтейнер = Истина; 
				Если не ЗначениеЗаполнено(Стр.Ответственный) Тогда
					Стр.Клиент 	     = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
					Стр.Ответственный = Объект.Автор;
				КонецЕсли;
				//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
				//ОбновитьДанныеКлючаАналитикиПеревозки(Стр, "ВагоныРефСцепа");
				//Субботин 78028 21.12.2023 конец
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьТанкКонтейнерыБезДГК()
	КонтейнерыБезДГК = РефСцепСервер.ПроверитьТанкКонтейнерыБезДГК(Объект.ВагоныРефСцепа.Выгрузить());
	Для каждого стр из КонтейнерыБезДГК Цикл
		ТанкКонтейнерыБезДГКВТЧВагоны = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Контейнер", стр ));
		Для каждого СтрокаТанкКонтейнерБезДГК_ТЧ из ТанкКонтейнерыБезДГКВТЧВагоны Цикл
			Если ЗначениеЗаполнено(СтрокаТанкКонтейнерБезДГК_ТЧ.Заявка) Тогда
				СтрокаТанкКонтейнерБезДГК_ТЧ.Отметка = Истина;
				Сообщить("Не обнаружен ДГК контейнер у Танк-контейнера №" + СтрокаТанкКонтейнерБезДГК_ТЧ.Контейнер 
					+ ". Он отмечен для отвязки от вагона.");
			Иначе
				Сообщить("Не обнаружен ДГК контейнер у Танк-контейнера №" + СтрокаТанкКонтейнерБезДГК_ТЧ.Контейнер 
					+ ". Танк-контейнер удален.");
				Объект.ВагоныРефСцепа.Удалить(СтрокаТанкКонтейнерБезДГК_ТЧ);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры


&НаСервере
Процедура ПроверитьДобавитьДГК()
	
	ВыборкаКонтейнерДГК = РефСцепСервер.ПолучитьДанныеДГКВагоновРефСцепа
		(РефСцепСервер.ПолучитьДанныеПоВагонамРефСцепаРегистра(Объект.РефСцеп)
		, Объект.РефСцеп);
		
	Если ВыборкаКонтейнерДГК = Неопределено Тогда	
		Возврат;
	КонецЕсли;	
	// Добавление ДГК 	
	КлиентДирекцияЕвросиб = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
	//Субботин 76064 20.10.2023 Начало 
	Если ВыборкаКонтейнерДГК.Следующий() тогда
		КонтейнерДГК = ВыборкаКонтейнерДГК; 
	КОнецЕсли;
	
	//Проверка располжения ДГК: возвращает "Истину" если расположен верно
	// 							 возвращает "Ложь" если ДГК не был найден или был привязан к другому вагону и строка была очищена и нужно привязать
	РасположениеДГКП = ПроверитьРасположениеДГК(КонтейнерДГК);
	Если РасположениеДГКП = ложь тогда
		ПризнакМонтированГДК = 2; // в соответствии с регистром вагоны в реф.сцепах
		//Субботин 76064 20.10.2023 Конец
		//Пока ВыборкаКонтейнерДГК.Следующий() Цикл
		мСтрокДГК = Объект.ВагоныРефСцепа.НайтиСтроки(
		Новый Структура("Вагон, ПризнакВагона"
		, КонтейнерДГК.Вагон, ПризнакМонтированГДК));
		
		Если мСтрокДГК.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(мСтрокДГК[0], КонтейнерДГК,,"Вагон");
			мСтрокДГК[0].Клиент 	              = КлиентДирекцияЕвросиб;
			мСтрокДГК[0].Ответственный            = Объект.Автор;
			мСтрокДГК[0].ПринадлежностьКонтейнера = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
			
			Объект.ИндексПоезда = мСтрокДГК[0].ИндексПоезда;
			ПроверитьДобавитьТанкКонтейнер(мСтрокДГК[0].Контейнер, мСтрокДГК[0]);
		ИначеЕсли мСтрокДГК.Количество() = 0 Тогда
			мСтрокБезДГК = Объект.ВагоныРефСцепа.НайтиСтроки(
			Новый Структура("Вагон"
			, КонтейнерДГК.Вагон)); 
			
			Для каждого стр из мСтрокБезДГК Цикл
				Если не ЗначениеЗаполнено(Стр.Контейнер) Тогда
					ЗаполнитьЗначенияСвойств(стр, КонтейнерДГК,,"Вагон");
					стр.Клиент 	                 = КлиентДирекцияЕвросиб;
					стр.Ответственный            = Объект.Автор;
					стр.ПринадлежностьКонтейнера = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
					ПроверитьДобавитьТанкКонтейнер(стр.Контейнер, стр);
					Объект.ИндексПоезда          = стр.ИндексПоезда;
					Прервать;
				Иначе
					НоваяСтрока = Объект.ВагоныРефСцепа.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стр, "Вагон,  
					|ПорядковыйНомерВСцепе,
					|ПотребовалсяПодсылПорожнегоВагона,
					|СтанцияОтправленияПодсыла,
					|ИндексПоезда,
					|ЖДНакладная"); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, КонтейнерДГК,"Контейнер, ПризнакВагона, ЭтоКонтейнерСДГК"); 
					НоваяСтрока.Клиент 	                 = КлиентДирекцияЕвросиб;
					НоваяСтрока.Ответственный            = Объект.Автор;
					НоваяСтрока.ПринадлежностьКонтейнера = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
					ПроверитьДобавитьТанкКонтейнер(НоваяСтрока.Контейнер, НоваяСтрока);
					Объект.ИндексПоезда = НоваяСтрока.ИндексПоезда;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		//КонецЦикла;
	КонецЕсли;
	ПроверитьТанкКонтейнерыБезДГК();
	Объект.ВагоныРефСцепа.Сортировать("ПорядковыйНомерВСцепе, НомерСтроки");
КонецПроцедуры

//Субботин 76064 20.10.2023 Начало
Функция ПроверитьРасположениеДГК(ДанныеКонтейнераДГК)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_ДанныеДГК.Контейнер КАК Контейнер,
		|	ВТ_ДанныеДГК.Вагон КАК Вагон,
		|	ВТ_ДанныеДГК.ПризнакВагона КАК ПризнакВагона,
		|	ВТ_ДанныеДГК.ЭтоКонтейнерСДГК КАК ЭтоКонтейнерСДГК
		|ПОМЕСТИТЬ ДанныеДГК
		|ИЗ
		|	&ВТ_ДанныеДГК КАК ВТ_ДанныеДГК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРефсцепа.Контейнер КАК Контейнер,
		|	ДанныеРефсцепа.Вагон КАК Вагон,
		|	ДанныеРефсцепа.ПризнакВагона КАК ПризнакВагона,
		|	ДанныеРефсцепа.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ДанныеРефсцепа
		|ИЗ
		|	&ДанныеРефсцепа КАК ДанныеРефсцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРефсцепа.Контейнер КАК Контейнер,
		|	ВЫБОР
		|		КОГДА ДанныеРефсцепа.Вагон = ДанныеДГК.Вагон
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ДанныеРефсцепа.Вагон
		|	КОНЕЦ КАК Вагон
		|ИЗ
		|	ДанныеДГК КАК ДанныеДГК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРефсцепа КАК ДанныеРефсцепа
		|		ПО ДанныеДГК.Контейнер = ДанныеРефсцепа.Контейнер";
	
	Запрос.УстановитьПараметр("ВТ_ДанныеДГК", ДанныеКонтейнераДГК);
	Запрос.УстановитьПараметр("ДанныеРефсцепа", Объект.ВагоныРефСцепа.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	ПравильнаяСтрока = Ложь;
	Если РезультатЗапроса.Пустой() тогда
		Возврат ПравильнаяСтрока;
	Иначе
		СтруктураОбнуления = Новый Структура("Контейнер, ПринадлежностьКонтейнера,СостояниеКонтейнера,  Груз,Ответственный, ВесКонтейнераБрутто,
		| ВесКонтейнераНетто, КоличествоМестКонтейнера, Клиент, Заявка, ПеренесенВРефСцеп, ДопИнформация, Клиент, Ответственный, ПринадлежностьКонтейнера, КлючАналитикиПеревозки, ЭтоКонтейнерСДГК");
   		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() цикл
			Если ВыборкаДетальныеЗаписи.Вагон <> Истина тогда
				СтрокиДляОчистики = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Вагон", ВыборкаДетальныеЗаписи.Вагон));
				Для каждого СтрокаДляОчистики из СтрокиДляОчистики Цикл
					ЗаполнитьЗначенияСвойств(СтрокаДляОчистики, СтруктураОбнуления);
				КонецЦикла;
			Иначе
				ПравильнаяСтрока = Истина;				
			КонецЕсли;
		КонецЦикла;		  
		Возврат ПравильнаяСтрока
	КонецЕсли;
	
КонецФункции
//Субботин 76064 20.10.2023 Конец

&НаСервере
Функция ПроверитьУсловияРейсЗавершен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&тзВагоны КАК РефСцепВагоныРефСцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Вагоны.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны
		|ГДЕ
		|	вт_Вагоны.ЕстьВагонВРегистреНаФорме = Истина";
	
	Запрос.УстановитьПараметр("тзВагоны", Объект.ВагоныРефСцепа.Выгрузить());
	Возврат Запрос.Выполнить().Пустой(); 
КонецФункции
	
&НаСервере
Процедура УдалитьВагоныНеВходящиеВРефСцеп()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&тз_Вагоны КАК тз_Вагоны
		|ГДЕ
		|	НЕ(&ФактическоеОтправление = ДАТАВРЕМЯ(1, 1, 1)
		|				И тз_Вагоны.ЕстьВагонВРегистреНаФорме = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны";
	
	Запрос.УстановитьПараметр("тз_Вагоны", Объект.ВагоныРефСцепа.Выгрузить()); 
	Запрос.УстановитьПараметр("ФактическоеОтправление", Объект.ФактическоеОтправление); 
	Объект.ВагоныРефСцепа.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры	

#КонецОбласти

#Область ДетализацияПоГрузу

&НаКлиенте
Процедура ДетализацияПоГрузуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Элементы.КонтейнерыДетализацияПоГрузу.Пометка Тогда
			Если ЗначениеЗаполнено(Элементы.Контейнеры.ТекущиеДанные.КлючАналитикиПеревозки) Тогда
				Элементы.ДетализацияПоГрузу.ТекущиеДанные.КлючАналитикиПеревозки 
					= Элементы.Контейнеры.ТекущиеДанные.КлючАналитикиПеревозки;
			КонецЕсли;		
		Иначе
			Если ЗначениеЗаполнено(Элементы.ВагоныРефСцепа.ТекущиеДанные.КлючАналитикиПеревозки) Тогда
				Элементы.ДетализацияПоГрузу.ТекущиеДанные.КлючАналитикиПеревозки 
					= Элементы.ВагоныРефСцепа.ТекущиеДанные.КлючАналитикиПеревозки;
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыГрузОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ГрузОбработкаВыбора(ВыбранноеЗначение, СтандартнаяОбработка, "Контейнеры");

КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаГрузОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ГрузОбработкаВыбора(ВыбранноеЗначение, СтандартнаяОбработка, "ВагоныРефСцепа");
КонецПроцедуры

&НаКлиенте
Процедура ГрузОбработкаВыбора(ВыбранноеЗначение, СтандартнаяОбработка, ИмяТЧ)

	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;

	Если ВыбранноеЗначение <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") 
		и ТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") 
		Тогда
		
		Найдено = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекущиеДанные.КлючАналитикиПеревозки));
		Для Каждого СтрНайдено Из Найдено Цикл 
			ДетализацияПоГрузу.Удалить(ДетализацияПоГрузу.Индекс(СтрНайдено));
		КонецЦикла;
	КонецЕсли;
	//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
	//НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, ИмяТЧ);
    //Субботин 78028 21.12.2023 конец
КонецПроцедуры

&НаКлиенте
Функция ЕстьВозможностьДетализацииПоГрузу(ИмяКнопки, ИмяТЧ)
	
	Если (не Элементы[ИмяТЧ].ТекущиеДанные.Груз
			= ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка"))
			и (не Элементы[ИмяТЧ].ТекущиеДанные.Контейнер
				= ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка"))
				Тогда	
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для детализации по грузу в строке значение груза должно быть ""Сборная контейнерная отправка"".");
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
	
&НаКлиенте
Процедура ДетализацияПоГрузу(Команда)
	
	Если не ЕстьВозможностьДетализацииПоГрузу("КонтейнерыДетализацияПоГрузу", "Контейнеры") Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.КонтейнерыДетализацияПоГрузу.Пометка 
		= не Элементы.КонтейнерыДетализацияПоГрузу.Пометка;

	Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка
		= не Элементы.КонтейнерыДетализацияПоГрузу.Пометка 
		и (Элементы.КонтейнерыДетализацияПоГрузу.Пометка = Истина);
		
	Элементы.ДетализацияПоГрузу.Видимость 
		= Элементы.КонтейнерыДетализацияПоГрузу.Пометка
		или Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка;
		
	УстановитьОтборДетализацияПоГрузуПоТЧ("Контейнеры");
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуВагоны(Команда)
	
	Если не ЕстьВозможностьДетализацииПоГрузу("ВагоныРефСцепаДетализацияПоГрузу", "ВагоныРефСцепа") Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка
		= не Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка;	
	
	Элементы.КонтейнерыДетализацияПоГрузу.Пометка 
		= не Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка 
		и (Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка = Истина);	

	Элементы.ДетализацияПоГрузу.Видимость 
		= Элементы.КонтейнерыДетализацияПоГрузу.Пометка
		или Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка;
		
	УстановитьОтборДетализацияПоГрузуПоТЧ("ВагоныРефСцепа");

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПриИзменении(Элемент)
	Если Элементы.КонтейнерыДетализацияПоГрузу.Пометка Тогда
		ОбновитьДанныеПоДетализацииПоГрузу("Контейнеры");
	Иначе
		ОбновитьДанныеПоДетализацииПоГрузу("ВагоныРефСцепа");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоДетализацииПоГрузу(ИмяТЧ)

	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 

	МассивСтрокДетализацииПоГрузу = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки"
		, ТекущиеДанные.КлючАналитикиПеревозки) );
	ВсегоКол = 0; ВсегоВес = 0;
	Для каждого Стр Из МассивСтрокДетализацииПоГрузу Цикл
	
		ВсегоКол = ВсегоКол + Стр.КоличествоМест;
		ВсегоВес = ВсегоВес + Стр.ВесГруза;
		
	КонецЦикла; 
	
	Если ВсегоКол <> 0 Тогда
	
		ТекущиеДанные.КоличествоМестКонтейнера = ВсегоКол;
	
	КонецЕсли; 
	
	Если ВсегоВес <> 0 Тогда
	
		ТекущиеДанные.ВесКонтейнераНетто = ВсегоВес;
	
	КонецЕсли;
	//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
	//НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, ИмяТЧ);
	//Субботин 78028 21.12.2023
	УстановитьОтборДетализацияПоГрузу(ИмяТЧ);	
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтейнерыПриАктивизацииСтроки(Элемент)
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
	ТекСтрока = Элементы.Контейнеры.ТекущиеДанные;
	Если ТекСтрока = Неопределено или не ЗначениеЗаполнено(ТекСтрока.КлючАналитикиПеревозки) Тогда
		Возврат;
	КонецЕсли;
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
	УстановитьОтборДетализацияПоГрузуПоТЧ("Контейнеры");
КонецПроцедуры 

&НаКлиенте
Процедура ВагоныРефСцепаПриАктивизацииСтроки(Элемент)     
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
	ТекСтрока = Элементы.ВагоныРефСцепа.ТекущиеДанные;
	Если ТекСтрока = Неопределено или не ЗначениеЗаполнено(ТекСтрока.КлючАналитикиПеревозки) Тогда
		Возврат;
	КонецЕсли;
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024

	УстановитьОтборДетализацияПоГрузуПоТЧ("ВагоныРефСцепа"); 
	
	Для Каждого стр из Объект.ВагоныРефСцепа Цикл
		стр.ЭтоТекущаяСтрока = Ложь;
	КонецЦикла;
	
	Попытка
		Элементы.ВагоныРефСцепа.ТекущиеДанные.ЭтоТекущаяСтрока = Истина;
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДетализацияПоГрузуПоТЧ(ИмяТЧ)
	
	Если Элементы.КонтейнерыДетализацияПоГрузу.Пометка 
		и ИмяТЧ = "Контейнеры" Тогда
		УстановитьОтборДетализацияПоГрузу(ИмяТЧ);
	ИначеЕсли Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка
		и ИмяТЧ = "ВагоныРефСцепа" Тогда
		УстановитьОтборДетализацияПоГрузу(ИмяТЧ);
	КонецЕсли;	

КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборДетализацияПоГрузу(ИмяТЧ)
	
	Элементы.ДетализацияПоГрузу.ОтборСтрок 
		= Новый ФиксированнаяСтруктура("КлючАналитикиПеревозки"
		, Элементы[ИмяТЧ].ТекущиеДанные.КлючАналитикиПеревозки);

КонецПроцедуры	

&НаКлиенте
Процедура КонтейнерыГрузПриИзменении(Элемент)
	ПриИзмененииГруза("Контейнеры")
КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаГрузПриИзменении(Элемент)
 	ПриИзмененииГруза("ВагоныРефСцепа");
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГруза(ИмяТЧ)
	
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Груз) Тогда
		ТекущиеДанные.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый");
	Иначе
		ТекущиеДанные.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний");
	КонецЕсли;	     
	
	// Детализация по грузу
	Если ТекущиеДанные.Груз <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
		Если ИмяТЧ = "ВагоныРефСцепа" Тогда
			Элементы.ВагоныРефСцепаДетализацияПоГрузу.Пометка = Ложь;	
			Элементы.ДетализацияПоГрузу.Видимость 			  = Ложь;
			//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
			//Субботин 76108 25.10.2023 начало заполняем ключ только в тч ВагоныРефСцепа
			//НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, ИмяТЧ);
			//Субботин 76108 25.10.2023 Конец
			//Субботин 78028 21.12.2023 конец
		Иначе
			Если значениеЗаполнено(ТекущиеДанные.КлючАналитикиПеревозки) тогда
			//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
			//	НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, ИмяТЧ)
			//Субботин 78028 21.12.2023 конец
			КонецЕсли;
			Элементы.КонтейнерыДетализацияПоГрузу.Пометка 	  = Ложь;	
			Элементы.ДетализацияПоГрузу.Видимость 			  = Ложь;
		КонецЕсли;
	КонецЕсли;
	//Субботин 76108 25.10.2023 начало убираем заполнения ключа при изменении груза в ТЧ контейнеры
	//НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, ИмяТЧ);
	//Субботин 76108 25.10.2023 Конец убираем закполнения ключа при изменении Ктк
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПолейВагонов

&НаКлиенте
Процедура УдалитьСтрокиКонтейнеров(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалениеПодтверждено", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите удалить выбранные строки?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура УдалениеПодтверждено(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	УдаляемыеСтроки = Новый Массив;
	
	Для каждого Стр из Объект.Контейнеры Цикл
		Если Стр.Отметка Тогда
			Если ЗначениеЗаполнено(Стр.Заявка) Тогда
				ОбщегоНазначенияКлиент.СообщитьПОльзователю("В строке №" 
					+ Стр.НомерСтроки + " удаление невозможно. Контейнер удаляемой строки входит в заявку " 
					+ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Стр.Заявка, "Номер")
					+". Удалите контейнер из заявки, либо перенесите его в другой Реф. сцеп.");
				Продолжить;
			КонецЕсли;	
			УдаляемыеСтроки.Добавить(Стр);
			//Евросиб Коханенко Н.А. 10.10.2024 (( #90312
			СтрокаКлюча = ТаблицаУдаляемыхКлючей.Добавить();
			СтрокаКлюча.КлючАналитикиПеревозки = Стр.КлючАналитикиПеревозки;
			//Евросиб Коханенко Н.А. 10.10.2024 )) #90312 
		КонецЕсли;	
	КонецЦикла; 
	
	Для каждого Стр2 из УдаляемыеСтроки Цикл
		Объект.Контейнеры.Удалить(Стр2);             
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СвязатьСВагономНаСервере(ВагонДляСвязи)
	
	// Добавляем контейнеры к вагонам
	
	МассивКонтейнеровДляСвязи 	  = Новый Массив;
	
	Для каждого Стр из Объект.Контейнеры Цикл
		Если Стр.Отметка Тогда
			МассивКонтейнеровДляСвязи.Добавить(Стр.Контейнер);
		КонецЕсли;	
	КонецЦикла;

	Если МассивКонтейнеровДляСвязи.Количество() = 0 Тогда 
		
		ОбщегоНазначения.СообщитьПользователю("Отметьте контейнеры для связи с вагонами!",,"Отметка");
		
		Возврат;
		
	КонецЕсли;	
	
	тзКонтейнеры 			  = Объект.Контейнеры.Выгрузить(); 
	тзВагоны	 			  = Объект.ВагоныРефСцепа.Выгрузить(); 
	ИсходнаяСтрокаВагона      = тзВагоны.Найти(ВагонДляСвязи,"Вагон");
	Для каждого Стр из тзКонтейнеры Цикл
		Если Стр.Отметка Тогда
			НоваяСтрока = тзВагоны.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрокаВагона,,"ЭтоКонтейнерСДГК, ЭтоТанкКонтейнер, КлючАналитикиПеревозки");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.Вагон = ВагонДляСвязи;
		КонецЕсли;	
	КонецЦикла;
	
	// Удалим пустую строку без контейнера
	Отбор = Новый Структура("Вагон, Контейнер", ВагонДляСвязи, Справочники.ТЕ.ПустаяСсылка()); 
	ПустыеСтроки = тзВагоны.НайтиСтроки(Отбор);
	Для Каждого Стр из ПустыеСтроки Цикл
		тзВагоны.Удалить(Стр);
	КонецЦикла;	
	
	тзВагоны.Сортировать("ПорядковыйНомерВСцепе, НомерСтроки");
	
	Объект.ВагоныРефСцепа.Загрузить(тзВагоны);

	// Удаляем уже связанные строки из ТЧ Контейнеры
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	&Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	не РефСцепКонтейнеры.Контейнер В(&МассивКонтейнеровДляСвязи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|ИЗ
		|	вт_Контейнеры КАК вт_Контейнеры";
	
	Запрос.УстановитьПараметр("Контейнеры", Объект.Контейнеры.Выгрузить());
	Запрос.УстановитьПараметр("МассивКонтейнеровДляСвязи", МассивКонтейнеровДляСвязи);
	
	Объект.Контейнеры.Загрузить(Запрос.Выполнить().Выгрузить()); 

	ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ();
	
КонецПроцедуры

// 1.6
&НаСервере
Процедура ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ()
	
	тзВагоны = Объект.ВагоныРефСцепа.Выгрузить();
	тзВагоны.ЗаполнитьЗначения(Истина, "НетПревышенияПоТЭУ");
	Объект.ВагоныРефСцепа.Загрузить(тзВагоны);
	
	ВыборкаПревышеныПоТЭУ = РефСцепСервер.ПолучитьДанныеПревышенияПоТЕУ(Объект.ВагоныРефСцепа.Выгрузить());
	
	Пока ВыборкаПревышеныПоТЭУ.Следующий() Цикл
		
		Если ВыборкаПревышеныПоТЭУ.ВагонРазмерВТЕУ = 0 Тогда

			ОбщегоНазначения.СообщитьПользователю("Для вагона " + 
				ВыборкаПревышеныПоТЭУ.ПредставлениеВагона + " не задан или ошибочный типоразмер.
				|Проверка на превышение для вагона в ТЕУ отменена.");
				
			Продолжить;	
			
		КонецЕсли;	
		
		мСтрокПревышенияПоТЭУ = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Вагон", ВыборкаПревышеныПоТЭУ.Вагон));
		
		Для Каждого стр из мСтрокПревышенияПоТЭУ Цикл
			
			Стр.НетПревышенияПоТЭУ = Ложь;
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура СвязатьСВагоном(Команда)

	СписокВагоновРефСцепа = Новый СписокЗначений;
	
	Для Каждого стр из Объект.ВагоныРефСцепа Цикл
		Если СписокВагоновРефСцепа.НайтиПоЗначению(стр.Вагон) = Неопределено
			и Стр.ЕстьВагонВРегистреНаФорме Тогда
			СписокВагоновРефСцепа.Добавить(стр.Вагон);
		КонецЕсли;	
	КонецЦикла;
	
	ОповещениеПослеВыбораЭлемента = Новый ОписаниеОповещения(
	    "СвязатьКонтейнерыСВагономЗавершение", ЭтотОбъект);

	СписокВагоновРефСцепа.ПоказатьВыборЭлемента(
	    ОповещениеПослеВыбораЭлемента,
	    "Выберите вагон для связи с контейнерами");
		
КонецПроцедуры

&НаКлиенте
Процедура СвязатьКонтейнерыСВагономЗавершение(Элемент, Параметры) Экспорт
	
	Если Элемент <> Неопределено Тогда

		ВагонДляСвязи = Элемент.Значение;

		СвязатьСВагономНаСервере(ВагонДляСвязи);
		
		УстановитьГруппировкуПоВагонамЦветомТекста();
		
		ОчиститьПометкиБезОрганичений();
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеФормыПоВагонам()
	//Субботин 71114 08.09.2023 начало
	//ЭтоОбновлениеДанныхИзРегистра = Ложь;
	//Субботин 71114 08.09.2023 начало 
	ЭтоОбновлениеДанныхИзРегистра = Истина;
	//Субботин 77510 21.11.2023 начало// не актуализируем информацию у уже завершенных рейсов
	Если Объект.РейсЗавершен Тогда 
		ЭтоОбновлениеДанныхИзРегистра = Ложь;	
	КонецЕсли;
	//Субботин 77510 21.11.2023 Конец 
	
	Объект.ВагоныРефСцепа.Загрузить(РефСцепСервер
	.ПолучитьДанныеФормыРегистраБазыДокумента(
	Объект.ВагоныРефСцепа.Выгрузить()
	, Объект.РефСцеп
	, ЭтоОбновлениеДанныхИзРегистра
	, Объект.Ссылка));
		
	ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ();

	ЗаполнитьЗаявкиПоРефСцепу();
	
КонецПроцедуры               

&НаСервере
Функция ВсеКлючиАналитикиПеревозкиРефСцепа()
	
	МассивКлючейАаналитикиПеревозки = Объект.ВагоныРефСцепа.Выгрузить(, "КлючАналитикиПеревозки")
		.ВыгрузитьКолонку("КлючАналитикиПеревозки");
		
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКлючейАаналитикиПеревозки
		, Объект.Контейнеры.Выгрузить(, "КлючАналитикиПеревозки").ВыгрузитьКолонку("КлючАналитикиПеревозки") 
		, Истина);
	 
	Возврат МассивКлючейАаналитикиПеревозки; 
		
КонецФункции                     

&НаСервере
Процедура ОтвязатьКонтейнерыОтВагоновНаСервере(Программно = Ложь) 

	тзВагоны	 			  		= Объект.ВагоныРефСцепа.Выгрузить(); 
	МассивКонтейнеровДляОтменыСвязи = Новый Массив;
	Для каждого Стр из Объект.ВагоныРефСцепа Цикл
		Если Стр.Отметка и ЗначениеЗаполнено(Стр.Контейнер) Тогда
			МассивКонтейнеровДляОтменыСвязи.Добавить(Стр.Контейнер);
		КонецЕсли;	
	КонецЦикла;

	Если МассивКонтейнеровДляОтменыСвязи.Количество() = 0 и не Программно Тогда 
		Сообщить("Отметьте контейнеры для отмены связи с вагонами!");
		Возврат;
	КонецЕсли;	
	
	тзКонтейнеры = Объект.Контейнеры.Выгрузить(); 
	Для каждого Стр из тзВагоны Цикл
		Если Стр.Отметка и не (Стр.ЭтоКонтейнерСДГК или Стр.ЭтоТанкКонтейнер) Тогда
			НоваяСтрока = тзКонтейнеры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЕсли;	
	КонецЦикла;
	
	Объект.Контейнеры.Загрузить(тзКонтейнеры);

	// Удаляем уже отвязанные строки из ТЧ Вагоны и контейнеры
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&Вагоны КАК РефСцепВагоны
		|ГДЕ
		|	не РефСцепВагоны.Контейнер В(&МассивКонтейнеровДляОтменыСвязи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны";
		
	тзВагоныПервоначальная = Объект.ВагоныРефСцепа.Выгрузить();
	Запрос.УстановитьПараметр("Вагоны", Объект.ВагоныРефСцепа.Выгрузить());
	Запрос.УстановитьПараметр("МассивКонтейнеровДляОтменыСвязи", МассивКонтейнеровДляОтменыСвязи);
	тзБезОтмеченныхКонтейнеров = Запрос.Выполнить().Выгрузить();

	// при отсутствии контейнеров в вагоне оставляем вагон без контейнера
	
	Для каждого стр из тзВагоныПервоначальная Цикл
		
		Если тзБезОтмеченныхКонтейнеров.НайтиСтроки(Новый Структура("Вагон", Стр.Вагон)).Количество() = 0 Тогда
			
			ЗаполнитьЗначенияСвойств(тзБезОтмеченныхКонтейнеров.Добавить(),
				Стр,,"Контейнер, 
				|ПринадлежностьКонтейнера,
				|СостояниеКонтейнера,
				|Груз,
				|Ответственный,
				|ВесКонтейнераБрутто,
				|ВесКонтейнераНетто,
				|КоличествоМестКонтейнера,
				|Клиент, 
				|Заявка, 
				|ПеренесенВРефСцеп, 
				|ДопИнформация, 
				//Субботин 76108 25.10.2023 начало
				|КлючАналитикиПеревозки");
				//Субботин 76108 25.10.2023 Конец

		КонецЕсли;

	КонецЦикла;
	
	тзБезОтмеченныхКонтейнеров.Сортировать("ПорядковыйНомерВСцепе, НомерСтроки");

	Объект.ВагоныРефСцепа.Загрузить(тзБезОтмеченныхКонтейнеров);
	
	ПроверитьПревышениеКонтейнеровВВагонеПоТЭУ();	

КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьКонтейнерОтВагона(Команда)
		
	ОтвязатьКонтейнерыОтВагоновНаСервере();
	
	УстановитьГруппировкуПоВагонамЦветомТекста();
	
	ЭтаФорма.Модифицированность = Истина;
	
	ОчиститьПометкиБезОрганичений();
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации()
	//Субботин 78646 13.12.2023 Конец	
КонецПроцедуры

#КонецОбласти

#Область ЖДНПодсылаПустыхВагонов

&НаКлиенте
Процедура ВагоныРефСцепаПотребовалсяЛиПодсылПорожнегоВагонаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВагоныРефСцепа.ТекущиеДанные;
	
	ЗаполнитьРеквизитСтрокВагона(ТекущиеДанные.Вагон,
		"ПотребовалсяПодсылПорожнегоВагона", ТекущиеДанные.ПотребовалсяПодсылПорожнегоВагона); 
	
	ВидимостьПередислокаций = РеквизитЗаполненВОднойИзСтрокВагонаИлиВсейТЧ(, 
		"ПотребовалсяПодсылПорожнегоВагона");
	
	ТекущиеДанные.ЭтоРучноеИзменениеПодсылаЖДН = ТекущиеДанные.ПотребовалсяПодсылПорожнегоВагона;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьтзДанныеДокументаВагоныДляЖДНПодсыла()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РефСцепВагоныРефСцепа.Вагон.Наименование КАК НомерВагона,
	               |	РефСцепВагоныРефСцепа.Ссылка.ФактическоеОтправление КАК ФактическоеОтправление,
	               |	РефСцепВагоныРефСцепа.Ссылка.СтанцияОтправления.КодЖДСтанции КАК КодЖДСтанции,
	               |	РефСцепВагоныРефСцепа.Вагон КАК Вагон,
	               |	РефСцепВагоныРефСцепа.Ссылка.ПланируемоеОтправление КАК ПланируемоеОтправление,
	               |	РефСцепВагоныРефСцепа.Ссылка КАК РефСцеп
	               |ИЗ
	               |	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
	               |ГДЕ
	               |	РефСцепВагоныРефСцепа.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОБъект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить(); 

КонецФункции

&НаКлиенте
Процедура ЗаполнитьРеквизитСтрокВагона(Вагон, ИмяРеквизита, ЗначениеРеквизита) 
	мСтрокВагона = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Вагон", Вагон));
	Для Каждого Стр из мСтрокВагона Цикл
		Стр[ИмяРеквизита] = ЗначениеРеквизита;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция РеквизитЗаполненВОднойИзСтрокВагонаИлиВсейТЧ(Вагон = Неопределено, ИмяРеквизита)
	
	Если ЗначениеЗаполнено(Вагон) Тогда
		// С отбором по вагону
		мСтрокВагона = Объект.ВагоныРефСцепа.НайтиСтроки(Новый Структура("Вагон", Вагон));
	Иначе
		мСтрокВагона = Объект.ВагоныРефСцепа;
	КонецЕсли;	
	
	Для Каждого Стр из мСтрокВагона Цикл
		Если ТипЗнч(Стр[ИмяРеквизита]) = Тип("Булево") Тогда
			Если Стр[ИмяРеквизита] Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Стр[ИмяРеквизита]) Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область УправлениеПорядкомКонтейнеровВВагоне 
// п 1.11

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ТекущиеДанные = Элементы.ВагоныРефСцепа.ТекущиеДанные;
	
	НомерСтроки = ТекущиеДанные.НомерСтроки; 
	
	Вагон       = ТекущиеДанные.Вагон;
	
	ПереместитьНаСервере(НомерСтроки, Вагон, Истина); 
	
	УстановитьГруппировкуПоВагонамЦветомТекста();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)

	ТекущиеДанные = Элементы.ВагоныРефСцепа.ТекущиеДанные;
	
	НомерСтроки = ТекущиеДанные.НомерСтроки; 
	
	Вагон       = ТекущиеДанные.Вагон;
	
	ПереместитьНаСервере(НомерСтроки, Вагон, Ложь);
	
	УстановитьГруппировкуПоВагонамЦветомТекста(); 
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьНаСервере(НомерСтроки, Вагон, Вниз)

	Если ЭтоКорректноеПеремещенияСтрок(Вагон, НомерСтроки, Вниз) Тогда
	
		Если Вниз Тогда Шаг = 1 Иначе Шаг = -1 КонецЕсли;
		
		Объект.ВагоныРефСцепа.Сдвинуть(НомерСтроки-1, Шаг); 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЭтоКорректноеПеремещенияСтрок(Вагон, НомерСтроки, Вниз)

	тзВагоны = ОБъект.ВагоныРефСцепа.Выгрузить();
	
	// Не должен выходить за границы массива
	
	Если (((НомерСтроки) >= тзВагоны.Количество()) и Вниз)
		или ((НомерСтроки) <= 1 и не Вниз) Тогда
		
		Возврат Ложь;

	КонецЕсли;

	// Если количество контейнеров в вагоне = 1 нет смысла перемещения
	// так как меняется порядок вагонов, а не контейнеров в вагоне
	
    тзКоличествоКонтейнеровВВагонах = КоличествоКонтейнеровВВагонах(тзВагоны);
	
	Если не тзКоличествоКонтейнеровВВагонах.Найти(Вагон, "Вагон").КоличествоКонтейнеровВВагоне > 1 Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	// Если вниз
	Если Вниз Тогда Шаг = 1; Иначе Шаг = -1 КонецЕсли;
	
	НомерСтрокиПриемника = НомерСтроки + Шаг;
	
	// При перемещении контейнер должен оставаться внутри вагона.
	Если тзВагоны.Найти(НомерСтрокиПриемника, "НомерСтроки").Вагон<>Вагон Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция КоличествоКонтейнеровВВагонах(тзВагоны) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК КоличествоКонтейнеровВВагоне,
		|	РефСцепВагоныРефСцепа.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт_Контейнеры.КоличествоКонтейнеровВВагоне) КАК КоличествоКонтейнеровВВагоне,
		|	вт_Контейнеры.Вагон КАК Вагон
		|ИЗ
		|	вт_Контейнеры КАК вт_Контейнеры
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Контейнеры.Вагон";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ЗаполнитьВниз 
// п 1.12

&НаКлиенте
Процедура ЗаполнитьВниз(Команда)
	
	Элементы.КонтейнерыЗаполнитьВниз.Пометка = не Элементы.КонтейнерыЗаполнитьВниз.Пометка;
	
	Элементы.КонтейнерыЗаполнитьВниз.ЦветТекста 
		= ?(Элементы.КонтейнерыЗаполнитьВниз.Пометка, ЦветТекста_Выделенный, ЦветТекста_Кнопки);

КонецПроцедуры

//Субботин 71114 начало 06.09.2023 переделал алгоритм

//&НаСервере
//Процедура ЗаполнитьСписокПолейЗаполнятьВниз()

//	СписокПолейЗаполнятьВниз.Добавить("ПринадлежностьКонтейнера");
//	СписокПолейЗаполнятьВниз.Добавить("СостояниеКонтейнера");
//	СписокПолейЗаполнятьВниз.Добавить("Груз");
//	СписокПолейЗаполнятьВниз.Добавить("ВесКонтейнераБрутто");
//	СписокПолейЗаполнятьВниз.Добавить("ВесКонтейнераНетто");
//	СписокПолейЗаполнятьВниз.Добавить("КоличествоМестКонтейнера");
//	СписокПолейЗаполнятьВниз.Добавить("Клиент");
//	СписокПолейЗаполнятьВниз.Добавить("Ответственный");
//	СписокПолейЗаполнятьВниз.Добавить("ДопИнформация");

//КонецПроцедуры	
//Субботин 71114 Конец 06.09.2023 переделал алгоритм

&НаКлиенте
Процедура КонтейнерыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	
	//Субботин 71114 начало 06.09.2023 переделал алгоритм
	
	//ИмяТЧ = Элемент.Имя;
	//
	//Для каждого ИндПоля из СписокПолейЗаполнятьВниз Цикл
	//	
	//	ИмяПоля = ИндПоля.Значение; 
	//	НовоеЗначение = ТекущиеДанные[ИмяПоля];
	//	СтрокаПройдена = Ложь;		
	//	
	//	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
	
	//		РезПроверки = Элементы.Контейнеры.ПроверитьСтроку
	//			(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
	//		
	//		СтрокаПройдена = СтрокаПройдена 
	//			ИЛИ Элементы.Контейнеры.ТекущаяСтрока 
	//			= Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
	//		
	//		Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда
	//			Если ИмяПоля = "Груз" Тогда
	//				Если НовоеЗначение <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") 
	//					и ТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") 
	//					Тогда
	//					
	//					Найдено = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекущиеДанные.КлючАналитикиПеревозки));
	//					Для Каждого СтрНайдено Из Найдено Цикл 
	//						ДетализацияПоГрузу.Удалить(ДетализацияПоГрузу.Индекс(СтрНайдено));
	//					КонецЦикла;
	//				КонецЕсли;	
	//				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
	//				НайтиКлючАналитикиПеревозкиКлиент(Объект[ИмяТЧ][Сч], ИмяТЧ);
	//			Иначе	
	//				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
	//			КонецЕсли;
	//		КонецЕсли; 
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;			
	//КонецЕсли;
	
	Если Элементы.КонтейнерыЗаполнитьВниз.Пометка Тогда 
		
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		ТекСтрока = Элементы.Контейнеры.текущиеДанные.НомерСтроки -1;
		
		ЗначениеЗаполнения = Неопределено;
		Для Сч = ТекСтрока По Объект[ИмяТЧ].Количество() - 1 Цикл 
			СтрокаСоответствуетОтбору = Элемент.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			Если Не СтрокаСоответствуетОтбору  Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнения = Неопределено Тогда
				ЗначениеЗаполнения = Объект[ИмяТЧ][Сч][ИмяПоля];
			КонецЕсли;
			Если Сч=0 тогда 
				продолжить;
			КонецЕсли;
			Элементы.Контейнеры.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			Объект[ИмяТЧ][Сч][ИмяПоля] = ЗначениеЗаполнения;
			Попытка
				Выполнить(""+Элемент.ТекущийЭлемент.Имя + "ПриИзменении"+"(Объект[ИмяТЧ][Сч])");
			Исключение
			КонецПопытки;
		КонецЦикла;
		Элементы.Контейнеры.ТекущаяСтрока = ТекСтрока ;
		текД = Элементы.Контейнеры.ТекущиеДанные;
	КонецЕсли;
	//Субботин 71114 Конец 06.09.2023
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПолейЗаполнятьВниз()

	СписокПолейЗаполнятьВниз.Добавить("ПринадлежностьКонтейнера");
	СписокПолейЗаполнятьВниз.Добавить("СостояниеКонтейнера");
	СписокПолейЗаполнятьВниз.Добавить("Груз");
	СписокПолейЗаполнятьВниз.Добавить("ВесКонтейнераБрутто");
	СписокПолейЗаполнятьВниз.Добавить("ВесКонтейнераНетто");
	СписокПолейЗаполнятьВниз.Добавить("КоличествоМестКонтейнера");
	СписокПолейЗаполнятьВниз.Добавить("Клиент");
	СписокПолейЗаполнятьВниз.Добавить("Ответственный");
	СписокПолейЗаполнятьВниз.Добавить("ДопИнформация");

КонецПроцедуры	

#КонецОбласти

#Область Пометка 
// п 1.21

&НаКлиенте
Процедура ОтметитьСнятьВсе(ИмяТЧ, Установить)
	
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		
		Если ЗначениеЗаполнено(Объект[ИмяТЧ][Сч].ПеренесенВРефСцеп) Тогда Продолжить; КонецЕсли;
		
		Если ИмяТЧ <> "Контейнеры" Тогда 
			Если (Объект[ИмяТЧ][Сч].ЭтоКонтейнерСДГК или Объект[ИмяТЧ][Сч].ЭтоТанкКонтейнер) Тогда Продолжить; КонецЕсли;
		КонецЕсли;	
		
		Объект[ИмяТЧ][Сч].Отметка = Элементы[ИмяТЧ].ПроверитьСтроку
			(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор())
			и Установить;
		
	КонецЦикла;
			
КонецПроцедуры	

&НаКлиенте
Процедура ВагоныОтметитьВсе(Команда)
	ОтметитьСнятьВсе("ВагоныРефСцепа", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВагоныСнятьПометку(Команда)
	ОтметитьСнятьВсе("ВагоныРефСцепа", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыОтметитьВсе(Команда)
	ОтметитьСнятьВсе("Контейнеры", Истина);
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСнятьПометку(Команда)
	ОтметитьСнятьВсе("Контейнеры", Ложь);
КонецПроцедуры

&НаКлиенте
Функция ЕстьПометкаКлиент(ИмяТЧ)
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если Объект[ИмяТЧ][Сч].Отметка Тогда
			Возврат Истина
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ВыгоныРефСцепаОтметкаПриИзменении(Элемент)
	Если не ЭтаФорма.Модифицированность Тогда
		МодифицированностьОтОтметки = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыОтметкаПриИзменении(Элемент)
	Если не ЭтаФорма.Модифицированность Тогда
		МодифицированностьОтОтметки = Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура КонтейнерыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если МодифицированностьОтОтметки Тогда
		ЭтаФорма.Модифицированность = не МодифицированностьОтОтметки; 
		МодифицированностьОтОтметки = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВагоныРефСцепаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодифицированностьОтОтметки = Ложь; 
КонецПроцедуры 

&НаКлиенте
Процедура ВагоныРефСцепаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если МодифицированностьОтОтметки Тогда
		ЭтаФорма.Модифицированность = не МодифицированностьОтОтметки; 
		МодифицированностьОтОтметки = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПринадлежность(ИмяТЧ)
	
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.ПринадлежностьКонтейнера) и ЗначениеЗаполнено(ТекущиеДанные.Контейнер) Тогда
	
		ТекущиеДанные.ПринадлежностьКонтейнера = ПолучитьПринадлежностьНаСервере(ТекущиеДанные.Контейнер);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПринадлежностьНаСервере(Контейнер)
	
	Если Константы.ИспользоватьАРМКТК.Получить() = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
		Запрос.УстановитьПараметр("КТК", Контейнер);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			//Субботин 78646 12.12.2023 начало переделал на возврат структуры т.к требуется проставлять блокировку по значению признака "В эксплуатации"
			//+ по фт поменял возврат местами, ктк клиента при клиентском, остальные варианты = евросиб
			Если Ответ.тек_ВидСобственности = Перечисления.ВариантыСобственности.Клиентский Тогда
				Возврат Новый Структура("ПризнакЭксплуатации, Принадлежность", Ответ.тек_ВЭксплуатации, Перечисления.ПринадлежностьТЕ.КТКлиента);
			Иначе	
				Возврат Новый Структура("ПризнакЭксплуатации, Принадлежность", Ответ.тек_ВЭксплуатации, Перечисления.ПринадлежностьТЕ.КТЕвросиба);
			КонецЕсли;
		КонецЕсли;
	Иначе
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Контейнер", Контейнер);
		Запрос.УстановитьПараметр("ПериодСегодня", ТекущаяДата());
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
		               |	ПризнакСобственностиВагонаСрезПоследних.ВЭксплуатации КАК ВЭксплуатации
		               |ИЗ
		               |	РегистрСведений.КонтейнерыНаСлежении.СрезПоследних(&ПериодСегодня, Контейнер = &Контейнер) КАК ВагоныНаСлеженииСрезПоследних
		               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(&ПериодСегодня, Контейнер = &Контейнер) КАК ПризнакСобственностиВагонаСрезПоследних
		               |		ПО ВагоныНаСлеженииСрезПоследних.Контейнер = ПризнакСобственностиВагонаСрезПоследних.Контейнер";

		Ответ = Запрос.Выполнить().Выбрать();

		Если Ответ.Следующий() Тогда
			Если Ответ.ПризнакСобственности = Перечисления.ВариантыСобственности.Собственный Тогда
				Возврат Новый Структура("ПризнакЭксплуатации, Принадлежность", Ответ.тек_ВЭксплуатации, Перечисления.ПринадлежностьТЕ.КТЕвросиба);
			Иначе	
				Возврат Новый Структура("ПризнакЭксплуатации, Принадлежность", Ответ.тек_ВЭксплуатации, Перечисления.ПринадлежностьТЕ.КТКлиента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Возврат Перечисления.ПринадлежностьТЕ.КТКлиента;
	Возврат Новый Структура("ПризнакЭксплуатации, Принадлежность", Ложь, Перечисления.ПринадлежностьТЕ.ПустаяСсылка());
	//Субботин 78646 12.12.2023 Конец
КонецФункции

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	МодифицированностьОтОтметки = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область Клиент

&НаКлиенте
Процедура ВагоныРефСцепаКлиентПриИзменении(Элемент)
	УстановитьОтветственногоПоКлиенту("ВагоныРефСцепа");
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыКлиентПриИзменении(Элемент)
	УстановитьОтветственногоПоКлиенту("Контейнеры");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственногоПоКлиенту(ИмяТЧ)
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	ТекущиеДанные.Ответственный = КонтрагентыДоговоры_Сервер
		.ПолучитьОтветственногоДействующегоДоговораКлиента(ТекущиеДанные.Клиент 
		,ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение"), Объект.ЦФО);
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда) 
	
	ОпОп = новый ОписаниеОповещения("ЗагрузитьИзExcelЗавершение", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("КТК, РазмерКТК, РефрижераторныйКТК ,КлиентскийКТК, ЭтоРефсцеп", Истина, Истина, Истина, Истина, Истина);
	ПараметрыФормы.Вставить("ЗагрузитьИзExcelЗавершенние", Истина);
	
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", ПараметрыФормы, , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelЗавершение(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено Тогда 
			 
		Для Сч = 0 по Параметр1.КТК.Количество()-1 Цикл
			
			Если ЕстьДублиНовыхКонтейнеров("Контейнеры", Параметр1.КТК[Сч]) Тогда Продолжить; КонецЕсли;
			
			НоваяСтрока = Объект.Контейнеры.Добавить();
			
            НоваяСтрока.Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(Параметр1.КТК[Сч]);
			
			// Субботин 79931 19.01.2024 начало 	
			//НоваяСтрока.ПринадлежностьКонтейнера = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента");
			ДанныеПоКТК = ПолучитьПринадлежностьНаСервере(Параметр1.КТК[Сч]);
			НоваяСтрока.ПринадлежностьКонтейнера = ДанныеПоКТК.Принадлежность;
			// Субботин 79931 19.01.2024 Конец 
			
			Если ЗначениеЗаполнено(НоваяСтрока.Груз) Тогда
				НоваяСтрока.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый");
			Иначе
				НоваяСтрока.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний");
			КонецЕсли;	     
			//Субботин 78028 21.12.2023 убираем изменения ключей везде кроме проведения/записи
			//НоваяСтрока.КлючАналитикиПеревозки = РефСцепСервер.НайтиСоздатьКлючАналитикиПеревозки(НоваяСтрока.Контейнер);
			//Субботин 78028 21.12.2023 конец	
		КонецЦикла;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	//Субботин 78646 13.12.2023 Начало	
	ЗаполнитьПризнакЭксплуатации()
	//Субботин 78646 13.12.2023 Конец 	
КонецПроцедуры         

&НаКлиенте
Процедура КонтейнерыКонтейнерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	//Субботин 78646 12.12.2023 Конец 
	//ТекущиеДанные.ПринадлежностьКонтейнера = ПолучитьПринадлежностьНаСервере(ТекущиеДанные.Контейнер);
	ДанныеПоКТК = ПолучитьПринадлежностьНаСервере(ТекущиеДанные.Контейнер);	
	ТекущиеДанные.ПринадлежностьКонтейнера = ДанныеПоКТК.Принадлежность;
	ТекущиеДанные.ПризнакЭксплуатации = ДанныеПоКТК.ПризнакЭксплуатации;
	//Субботин 78646 12.12.2023 Конец
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Груз) Тогда
		ТекущиеДанные.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый");
	Иначе
		ТекущиеДанные.СостояниеКонтейнера = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний");
	КонецЕсли; 
	//Субботин 76108 25.10.2023 
	Если ЗначениеЗаполнено(ТекущиеДанные.КлючАналитикиПеревозки) Тогда
		Если ТекущиеДанные.Контейнер <> ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки,"Контейнер") Тогда  
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 02.07.2024
			Если ЗначениеЗаполнено(ТекущиеДанные.КлючАналитикиПеревозки) Тогда
				ТекущиеСтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиперевозки", ТекущиеДанные.КлючАналитикиПеревозки));
				Для каждого СтрДетализации Из ТекущиеСтрокиДетализации Цикл
					ДетализацияПоГрузу.Удалить(СтрДетализации);	
				КонецЦикла; 
			КонецЕсли;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 02.07.2024
			//Евросиб Коханенко Н.А. 19.09.2024 (( #90312
			УдалитьСсылкуНаРефИзКлючаАналитики(ТекущиеДанные.КлючАналитикиПеревозки);
			//Евросиб Коханенко Н.А. 19.09.2024 )) #90312 
			ТекущиеДанные.КлючАналитикиПеревозки = Неопределено;
			ТекущиеДанные.Груз = Неопределено;  
		//Субботин 78028 21.12.2023 Начало 	
			ТекущиеДанные.ВесКонтейнераНетто = 0;
			ТекущиеДанные.КоличествоМестКонтейнера  = 0;
			ТекущиеДанные.ЗаявкаПодбора = ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка");
			ТекущиеДанные.Заявка = ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка");
			ТекущиеДанные.ВерсияКлюча = "";
		//Субботин 78028 21.12.2023 конец 
		КонецЕсли;
	КонецЕсли;
	//Субботин 76108 25.10.2023 конец
	
	//Субботин 76108 25.10.2023 начало убираем закполнения ключа при изменении Ктк
	//НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные, "Контейнеры");
   //Субботин 76108 25.10.2023 конец
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПринадлежностьТЕКТКлиента()
	Возврат Перечисления.ПринадлежностьТЕ.КТКлиента 	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидСобственностиПрочее()
	Возврат Перечисления.ВариантыСобственности.Прочее 	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДругойРефСцеп(Команда)
	
	ЕстьОтмеченные = Ложь;
	
	Для Сч = 0 По Объект.Контейнеры.Количество() - 1 Цикл
		Если Объект.Контейнеры[Сч].Отметка
			и не ЗначениеЗаполнено(Объект.Контейнеры[Сч].ПеренесенВРефСцеп)
			Тогда 
			
			ЕстьОтмеченные = Истина;	
			
		КонецЕсли;
	КонецЦикла;
	
	Если не ЕстьОтмеченные Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отметьте контейнеры для переноса в другой реф.сцеп!",,"Отметка");
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = Новый НастройкиКомпоновкиДанных;

	Элемент = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Элемент.ПравоеЗначение = Объект.Ссылка;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

	Элемент = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РейсЗавершен");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = Ложь;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

	Элемент = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = Ложь;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
	
	ДополнительныеПараметры = Новый Структура;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПеренестиВДругойРефСцепЗавершение"
		, ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.РефСцеп.ФормаВыбора", ПараметрыФормы,
		,ЭтаФорма.УникальныйИдентификатор,,
		,ОписаниеОповещения
		,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПеренестиВДругойРефСцепЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если не ЗаписанДляОтложенногоПеренесенияВДругойРефСцеп(Результат, ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка записи реф.сцепа для переноса!",,"ПеренесенВРефсцеп");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЗаписанДляОтложенногоПеренесенияВДругойРефСцеп(Результат, ДополнительныеПараметры)
	
	Если ТипЗнч(Результат) <> Тип("ДокументСсылка.РефСцеп") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяТЧ = "Контейнеры";
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если Объект[ИмяТЧ][Сч].Отметка Тогда
			Объект[ИмяТЧ][Сч].ПеренесенВРефсцеп = Результат;
			Объект[ИмяТЧ][Сч].Отметка			= Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#ОБласть Заявки

&НаСервере
Процедура ЗаполнитьЗаявкиСтрокКонтейнеров(ИмяТЧ, Заявка, КлючАналитикиПеревозки) 
	мКлючАналитикиПеревозки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", КлючАналитикиПеревозки));
	Для Каждого Стр из мКлючАналитикиПеревозки Цикл
		Стр.Заявка = Заявка;
		//Субботин 78028 29.01.2024 начало 
		Если ИмяТЧ = "Контейнеры" Тогда
			Стр.ЗаявкаПодбора = Заявка;
		КонецЕсли;
		//Субботин 78028 29.01.2024 Конец
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЗаявкиПоРефСцепу()
	
	ВыборкаПоЗаявкам = РефСцепСервер.ПолучитьЗаявкиПоКлючамАналитикиРефСцепа(ВсеКлючиАналитикиПеревозкиРефСцепа(), объект.Ссылка).Выбрать();
	////Субботин 77659 02.02.2024
	//Пока ВыборкаПоЗаявкам.Следующий() Цикл
	//	ЗаполнитьЗаявкиСтрокКонтейнеров("ВагоныРефСцепа", ВыборкаПоЗаявкам.Заявка, ВыборкаПоЗаявкам.КлючАналитикиПеревозки);
	//	ЗаполнитьЗаявкиСтрокКонтейнеров("Контейнеры"	, ВыборкаПоЗаявкам.Заявка, ВыборкаПоЗаявкам.КлючАналитикиПеревозки);
	//КонецЦикла;
	////Субботин 77659 02.02.2024
	Для каждого Стр из ОБъект.Контейнеры Цикл
		Если Стр.Заявка = Документы.Заявка.ПустаяСсылка() и Стр.ЗаявкаПодбора <> Документы.Заявка.ПустаяСсылка() Тогда
			Стр.Заявка = Стр.ЗаявкаПодбора;
			//Сообщить("В строке №" +Стр.НомерСтроки + " в " + Стр.ЗаявкаПодбора + " контейнер должен появится в течении часа.");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры 

// 5.1
&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	Если не объект.Проведен Тогда 
		ОбщегоНазначенияКлиент.СообщитьПОльзователю("Создание заявки возможно только для проведенного документа.");
		Возврат;
	КонецЕсли;	

	Если ЭтаФорма.Модифицированность Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеЗаявкиПодтверждено", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Для продолжения создания заявки требуется записать данные. Записать данные?"
			, РежимДиалогаВопрос.ДаНет);
	Иначе 
		СозданиеЗаявкиПродолжение();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявкиПодтверждено(ОтветПользователя = неопределено, ДопПараметры = неопределено) Экспорт 
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	//Субботин 76108 25.10.2023 начало// переносим запись дока после создания ключенй аналитики запись   
	//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец
	
	СозданиеЗаявкиПродолжение();

КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявкиПродолжение()
	
	//Субботин 76108 25.10.2023 начало// формируем ключи аналитики  перевозки для ктк при формировании заявки
	 //Субботин 77659 25.01.2024 Начало убрал функционал т.к он автоматизирован при записи
	//Для Каждого Строка Из Объект.Контейнеры цикл
	//	НайтиКлючАналитикиПеревозкиКлиент(Строка, "Контейнеры")
	//КонецЦикла;
	 //Субботин 77659 25.01.2024 Конец
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец
	
	Если ОшибкаПроверкиДанныхПередСозданиемЗаявки() Тогда
		Возврат;
	КонецЕсли;	
	
	МассивКонтейнеров = ПолучитьМассивКонтейнеровДляЗаявки("ВагоныРефСцепа", Новый Массив());
	
	ПараметрыФормы = Новый Структура("Основание, ЭтоСозданиеЗаявкиИзРефСцепа, МассивКонтейнеров"
		, Объект.Ссылка
		, Истина
		, МассивКонтейнеров);
		
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СоздатьЗаявкуЗавершение"
		, ЭтаФорма);
	
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДокумента", ПараметрыФормы,
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьЗаявкиПоРефСцепу();
	
КонецПроцедуры	


&НаКлиенте
Функция ПолучитьМассивКонтейнеровДляЗаявки(ИмяТЧ, МассивКонтейнеров)
	
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если не Объект[ИмяТЧ][Сч].Отметка Тогда Продолжить; КонецЕсли;
		Если ИмяТЧ = "ВагоныРефСцепа" Тогда
			Если (Объект[ИмяТЧ][Сч].ЭтоКонтейнерСДГК или Объект[ИмяТЧ][Сч].ЭтоТанкКонтейнер) Тогда Продолжить; КонецЕсли;		
		КонецЕсли;	
		МассивКонтейнеров.Добавить(Объект[ИмяТЧ][Сч].Контейнер);
	КонецЦикла;
	
	Если ИмяТЧ = "ВагоныРефСцепа" Тогда
		Возврат ПолучитьМассивКонтейнеровДляЗаявки("Контейнеры", МассивКонтейнеров); 
	КонецЕсли;	
	
	Возврат МассивКонтейнеров;
	
КонецФункции

&НаКлиенте
Функция ОшибкаПроверкиДанныхПередСозданиемЗаявки(ЭтоКонтенерСДГК = Ложь)
	
	Если не ЭтоКонтенерСДГК Тогда
		Если не (ЕстьПометкаКлиент("Контейнеры") или ЕстьПометкаКлиент("ВагоныРефСцепа")) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"Перед формированием заявки отметьте строки верхей или нижней таблиц.");
			Возврат Истина;	
		КонецЕсли;	
	КонецЕсли;	

	Возврат ЕстьНезаполненноеПоле("Контейнеры", "Контейнер") или ЕстьНезаполненноеПоле("ВагоныРефСцепа", "Контейнер")
	    или ЕстьНезаполненноеПоле("Контейнеры", "Клиент") или ЕстьНезаполненноеПоле("ВагоныРефСцепа", "Клиент")
		или ЕстьРазныеКлиенты("ВагоныРефСцепа", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"))
		или ЕстьОтмеченныеСЗаявками("Контейнеры") или ЕстьОтмеченныеСЗаявками("ВагоныРефСцепа");
	
КонецФункции

&НаКлиенте
Функция ЕстьНезаполненноеПоле(ИмяТЧ, ИмяПоля)
	ошибка = Ложь;
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если (не ЗначениеЗаполнено(Объект[ИмяТЧ][Сч][ИмяПоля]))
			и Объект[ИмяТЧ][Сч].Отметка Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"В строке №" + Объект[ИмяТЧ][Сч].НомерСтроки + " таблицы " +
				?(ИмяТЧ = "ВагоныРефСцепа","Верхней таблицы", "Нижней таблицы")
				+" не заполнен " + ИмяПоля,,ИмяПоля );
			ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ошибка;
КонецФункции

&НаКлиенте
Функция ЕстьРазныеКлиенты(ИмяТЧ, КонтрольныйКлиент)
	
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		
		Если не Объект[ИмяТЧ][Сч].Отметка Тогда Продолжить; КонецЕсли;
		
		Если КонтрольныйКлиент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
			КонтрольныйКлиент = Объект[ИмяТЧ][Сч].Клиент;
		КонецЕсли;	
		
		Если КонтрольныйКлиент <> ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")
			и КонтрольныйКлиент <> Объект[ИмяТЧ][Сч].Клиент Тогда

			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"В строке №" + Объект[ИмяТЧ][Сч].НомерСтроки + " таблицы " +
				?(ИмяТЧ = "ВагоныРефСцепа","Верхней таблицы", "Нижней таблицы")
				+" не совпадает клиент. В отмеченных строках должно быть не более одного наименования клиента для создания заявки ");
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяТЧ = "ВагоныРефСцепа" Тогда
		Возврат ЕстьРазныеКлиенты("Контейнеры", КонтрольныйКлиент); 
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ЕстьОтмеченныеСЗаявками(ИмяТЧ)
	ошибка = Ложь;
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если (ЗначениеЗаполнено(Объект[ИмяТЧ][Сч].Заявка))
			и Объект[ИмяТЧ][Сч].Отметка Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"В строке №" + Объект[ИмяТЧ][Сч].НомерСтроки + " таблицы " +
				?(ИмяТЧ = "ВагоныРефСцепа","Верхней таблицы", "Нижней таблицы")
				+ " Контейнер " +  Объект[ИмяТЧ][Сч].Контейнер + " уже добавлен в заявку " 
				+ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект[ИмяТЧ][Сч].Заявка,"Номер"));
			ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ошибка;
КонецФункции

&НаКлиенте
Процедура ДобавитьВЗаявку(Команда)

	Если не объект.Проведен Тогда 
		ОбщегоНазначенияКлиент.СообщитьПОльзователю("Добавление в заявку возможно только для проведенного документа.");
		Возврат;
	КонецЕсли;	
	
	Если ЭтаФорма.Модифицированность Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеЗаявкиПодтверждено", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Для продолжения добавления заявки требуется записать данные. Записать данные?"
			, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ДобавлениеЗаявкиПродолжение();
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавлениеЗаявкиПодтверждено(ОтветПользователя = неопределено, ДопПараметры = неопределено) Экспорт 
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;

	//Субботин 76108 25.10.2023 начало// переносим запись дока после создания ключенй аналитики запись 
	//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец

	ДобавлениеЗаявкиПродолжение();

КонецПроцедуры
	
&НаКлиенте
Процедура ДобавлениеЗаявкиПродолжение() 
	
	//Субботин 76108 25.10.2023 начало// формируем ключи аналитики  перевозки для ктк при формировании заявки
	 //Субботин 77659 25.01.2024 Начало убрал т.к выполняется при записи
	//Для каждого строка из Объект.Контейнеры цикл
	//	НайтиКлючАналитикиПеревозкиКлиент(строка, "Контейнеры")
	//КонецЦикла;
	 //Субботин 77659 25.01.2024 Конец
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец
	
	Если ОшибкаПроверкиДанныхПередСозданиемЗаявки() Тогда
		Возврат;
	КонецЕсли;	

	МассивКонтейнеров = ПолучитьМассивКонтейнеровДляЗаявки("ВагоныРефСцепа", Новый Массив());
	
	СтандартнаяОбработка = Ложь;
	
	МассивЗаявокДляДобавления = ПолучитьСписокЗаявокДляДобавленияКонтейнеровНасЕрвере();
	
	Если не МассивЗаявокДляДобавления.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю
			("Нет заявок, соответствующих условиям данного реф.сцепа. Попробуйте создать заявки");
		Возврат;
	КонецЕсли;
	
	СписокЗаявокДляДобавления = Новый СписокЗначений;
	СписокЗаявокДляДобавления.ЗагрузитьЗначения(МассивЗаявокДляДобавления);
	
	Настройки = Новый НастройкиКомпоновкиДанных;

	Элемент = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.Использование     = Истина;
	Элемент.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("Ссылка");
	Элемент.ВидСравнения      = ВидСравненияКомпоновкиДанных.ВСписке;
	Элемент.ПравоеЗначение    = СписокЗаявокДляДобавления;
	Элемент.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
	ПараметрыФормы.Вставить("ЭтоДобавлениеКТКРефСцепаВЗаявку",Истина);
	
	ДополнительныеПараметры = Новый Структура("МассивКонтейнеров", МассивКонтейнеров);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьВЗаявкуПриВыбореЗавершение"
		, ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.Заявка.Форма.ФормаВыбора", ПараметрыФормы,
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗаявокДляДобавленияКонтейнеровНасЕрвере()
	
	Возврат РефСцепСервер.ПолучитьСписокЗаявокДляДобавленияКонтейнеров(
		РефСцепСервер.ПолучитьДанныеРефСцепаДляОтбораЗаявок(Объект)).СписокЗаявок;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВЗаявкуПриВыбореЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("ДокументСсылка.Заявка") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю
			("Не выбрана заявка, соответствущая условиям данного реф.сцепа. Действие завершено.");
		Возврат ; 
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("Ключ,
		| Основание,
		| ЭтоДобавлениеВЗаявкуИзРефСцепа,
		| МассивКонтейнеров"
		, Результат
		, Объект.Ссылка
		, Истина
		, ДополнительныеПараметры.МассивКонтейнеров);

		
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьВЗаявкуЗавершение"
		, ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДокумента", ПараметрыФормы,
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьВЗаявкуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьЗаявкиПоРефСцепу();
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьЗаявкуНаДГК(Команда)
	Если не объект.Проведен Тогда 
		ОбщегоНазначенияКлиент.СообщитьПОльзователю("Создание заявки возможно только для проведенного документа.");
		Возврат;
	КонецЕсли;	
	Если ЭтаФорма.Модифицированность Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеЗаявкиДГКПодтверждено", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Для продолжения создания заявки требуется записать данные. Записать данные?"
			, РежимДиалогаВопрос.ДаНет);
	Иначе 
		СозданиеЗаявкиДГКПродолжение();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявкиДГКПодтверждено(ОтветПользователя = неопределено, ДопПараметры = неопределено) Экспорт 
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;

	//Субботин 76108 25.10.2023 начало// переносим запись дока после создания ключенй аналитики запись 
	//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец

	СозданиеЗаявкиДГКПродолжение();

КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявкиДГКПродолжение()
	
	//Субботин 76108 25.10.2023 начало// формируем ключи аналитики  перевозки для ктк при формировании заявки 
	 //Субботин 77659 25.01.2024 Начало убрал т.к перед записью
	//Для каждого строка из Объект.Контейнеры цикл
	//	НайтиКлючАналитикиПеревозкиКлиент(строка, "Контейнеры")
	//КонецЦикла;
	 //Субботин 77659 25.01.2024 Конец
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Субботин 76108 25.10.2023 Конец
	
	ЭтоКонтейнерСДГК = Истина;
    // Заодно установим снимем отметку
	МассивКонтейнеров = ПолучитьМассивКонтейнеровДляЗаявкиДГК("ВагоныРефСцепа", Новый Массив());
	
	ОчиститьПометкиБезОрганичений();
	
	Если ОшибкаПроверкиДанныхПередСозданиемЗаявки(ЭтоКонтейнерСДГК) Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("Основание, ЭтоСозданиеЗаявкиИзРефСцепа, МассивКонтейнеров, ДГК"
		, Объект.Ссылка
		, Истина
		, МассивКонтейнеров
		, Истина);
		
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьПометкиБезОрганичений()
	Для Сч = 0 По Объект.ВагоныРефСцепа.Количество() - 1 Цикл
		Объект.ВагоныРефСцепа[Сч].Отметка = Ложь;
	КонецЦикла;
	Для Сч = 0 По Объект.Контейнеры.Количество() - 1 Цикл
		Объект.Контейнеры[Сч].Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьМассивКонтейнеровДляЗаявкиДГК(ИмяТЧ, МассивКонтейнеров)
	
	Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
		Если Объект[ИмяТЧ][Сч].ЭтоКонтейнерСДГК или Объект[ИмяТЧ][Сч].ЭтоТанкКонтейнер Тогда 
			МассивКонтейнеров.Добавить(Объект[ИмяТЧ][Сч].Контейнер);
			Объект[ИмяТЧ][Сч].Отметка = Истина;
		Иначе
			Объект[ИмяТЧ][Сч].Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивКонтейнеров;
	
КонецФункции

#КонецОбласти             

#Область КлючиАналитики
&НаКлиенте
Процедура НайтиКлючАналитикиПеревозкиКлиент(ТекСтр, ИмяТЧ) 
	
	//Субботин 79281 10.01.2024 начало // добавил поля	
	//Структура = Новый Структура("КлючАналитикиПеревозки, Контейнер, Груз, ВерсияКлюча");
	Структура = Новый Структура("КлючАналитикиПеревозки, Контейнер, Груз, ВерсияКлюча, ВесКонтейнераНетто, КоличествоМестКонтейнера");
	//Субботин 79281 10.01.2024 конец 

	ЗаполнитьЗначенияСвойств(Структура, ТекСтр);
		
	Если ТекСтр.ВерсияКлюча = "" Или ТекСтр.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекСтр.КлючАналитикиПеревозки,"ВерсияДанных") Тогда 
		КлючАналитикиПеревозки = НайтиКлючАналитикиПеревозки(Структура);
	Иначе 
		КлючАналитикиПеревозки = ОбновитьДанныеКлючаАналитикиПеревозки(Структура, ИмяТЧ);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
	КонецЕсли;	                   
	
	ТекСтр.КлючАналитикиПеревозки = КлючАналитикиПеревозки.КлючАналитикиПеревозки;  
	ТекСтр.ВерсияКлюча 			  = КлючАналитикиПеревозки.ВерсияДанных;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеКлючаАналитикиПеревозки(ТекСтр, ИмяТЧ)
	
	Структура = Новый Структура("КлючАналитикиПеревозки, ВерсияКлюча");	
	НайденоТЧ = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));  
	
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 27.06.2024
	//По коду ниже заменено "ТекСтр.КлючАналитикиПеревозки" на "РеквизитыКлючаАналитики"
	РеквизитыКлючаАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСтр.КлючАналитикиПеревозки,
								"Груз,ВесГруза,КоличествоМест,Заявка,ВерсияДанных,Контейнер,ДетализацияПоГрузу");
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 27.06.2024
	
	Если НайденоТЧ.Количество() Тогда  
		
		Стр 			= НайденоТЧ[0]; 
		Стр.Груз 		= РеквизитыКлючаАналитики.Груз;
		Стр.ВерсияКлюча = РеквизитыКлючаАналитики.ВерсияДанных;
		//Субботин 79281 10.01.2024 начало
		Стр.Контейнер   = РеквизитыКлючаАналитики.Контейнер;
		//Субботин 79281 10.01.2024 Конец 
		
		//Субботин 78028 23.01.2024 Начало
		Стр.ВесКонтейнераНетто   = РеквизитыКлючаАналитики.ВесГруза;
		Стр.КоличествоМестКонтейнера = РеквизитыКлючаАналитики.КоличествоМест;
		//Тестово
		Если ИмяТЧ = "Контейнеры" Тогда
			Стр.ЗаявкаПодбора = РеквизитыКлючаАналитики.Заявка;
		КонецЕсли;		
		//Субботин 78028 23.01.2024 Конец   
		
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 27.06.2024
		ТекущиеСтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиперевозки", ТекСтр.КлючАналитикиПеревозки));
		Для каждого СтрДетализации Из ТекущиеСтрокиДетализации Цикл
			ДетализацияПоГрузу.Удалить(СтрДетализации);	
		КонецЦикла;  
		Если не РеквизитыКлючаАналитики.ДетализацияПоГрузу.Пустой() Тогда
			ВыборкаДетализации = РеквизитыКлючаАналитики.ДетализацияПоГрузу.Выбрать();
			Пока ВыборкаДетализации.Следующий() Цикл
				НС = ДетализацияПоГрузу.Добавить();	
				ЗаполнитьЗначенияСвойств(НС,ВыборкаДетализации); 
				НС.КлючАналитикиПеревозки = ТекСтр.КлючАналитикиПеревозки;
			КонецЦикла;
		КонецЕсли;
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 27.06.2024
		
		Структура 		= Новый Структура("КлючАналитикиПеревозки, ВерсияДанных"
			, Стр.КлючАналитикиПеревозки, Стр.ВерсияКлюча);
		
	КонецЕсли;
	
	мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу", Тип("ТаблицаЗначений"));
	
	НайденоГруз = мДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекСтр.КлючАналитикиПеревозки));
	Для Каждого СтрНайденоГруз Из НайденоГруз Цикл 
		мДетализацияПоГрузу.Удалить(СтрНайденоГруз);	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Справочники.КлючиАналитикиПеревозки.ПолучитьДетализациюПоГрузу(ТекСтр.КлючАналитикиПеревозки),мДетализацияПоГрузу);
	ЗначениеВРеквизитФормы(мДетализацияПоГрузу, "ДетализацияПоГрузу");
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция НайтиКлючАналитикиПеревозки(ТекСтр)
	
	СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	СтруктураКлючаАналитикиПеревозки.КлючАналитики = ТекСтр.КлючАналитикиПеревозки; 
	СтруктураКлючаАналитикиПеревозки.Контейнер 	   = ТекСтр.Контейнер;
	//СтруктураКлючаАналитикиПеревозки.РефСцеп	   = Объект.Ссылка;
	СтруктураКлючаАналитикиПеревозки.Груз 		   = ТекСтр.Груз; 
	//Субботин 79281 10.01.2024 начало
	СтруктураКлючаАналитикиПеревозки.ВесГруза      = ТекСтр.ВесКонтейнераНетто;
	СтруктураКлючаАналитикиПеревозки.КоличествоМест = ТекСтр.КоличествоМестКонтейнера;
	//Субботин 79281 10.01.2024 Конец
	
	мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу",Тип("ТаблицаЗначений"));
   	ТЗДетализацияПоГрузу = мДетализацияПоГрузу.СкопироватьКолонки();
	МассивСтрок = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекСтр.КлючАналитикиПеревозки));
	Для Каждого СтрМассивСтрок Из МассивСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТЗДетализацияПоГрузу.Добавить(), СтрМассивСтрок);
	КонецЦикла;
	СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу = ТЗДетализацияПоГрузу;
	
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 27.06.2024
	СтруктураКлючаАналитикиПеревозки.ИзменятьТЧДетализацияПоГрузу = Истина;
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 27.06.2024
	
	КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	
	Возврат КлючАналитикиПеревозки;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеКлючаНаФормеСервер() 
	ОбновитьДанныеКлючаНаФормеПоТЧСервер("ВагоныРефСцепа"); 
	ОбновитьДанныеКлючаНаФормеПоТЧСервер("Контейнеры"); 
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКлючаНаФормеПоТЧСервер(ИмяТЧ) 
	МассивКлючей = Новый Массив;
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл
		Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда 
			мМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Стр.КлючАналитикиПеревозки);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКлючей, мМассив, Истина); 
		КонецЕсли;
	КонецЦикла;
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. 27.06.2024 + ДетализацияПоГрузу
	Соответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивКлючей,"Груз, Контейнер, КоличествоМест, ВесГруза, Заявка, ВерсияДанных, ДетализацияПоГрузу");
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл 
		Структура = Соответствие.Получить(Стр.КлючАналитикиПеревозки);
		Если Структура <> Неопределено Тогда 
			Стр.Груз = Структура.Груз;
			//Субботин 79281 10.01.2024 начало
			стр.ВерсияКлюча = Структура.ВерсияДанных;
			стр.КоличествоМестКонтейнера = Структура.КоличествоМест;
			стр.Заявка = Структура.Заявка;
			стр.ВесКонтейнераНетто = Структура.ВесГруза;
				//Субботин 78028 23.01.2024 Начало
			стр.Контейнер = Структура.Контейнер;
			Если ИмяТЧ = "Контейнеры" Тогда
				Стр.ЗаявкаПодбора = Структура.Заявка;
			КонецЕсли;
				//Субботин 78028 23.01.2024 Конец
			//Субботин 79281 10.01.2024 Конец
			
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 27.06.2024
			ТекущиеСтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиперевозки", Стр.КлючАналитикиПеревозки));
			Для каждого СтрДетализации Из ТекущиеСтрокиДетализации Цикл
				ДетализацияПоГрузу.Удалить(СтрДетализации);	
			КонецЦикла;  
			Если не Структура.ДетализацияПоГрузу.Пустой() Тогда
				ВыборкаДетализации = Структура.ДетализацияПоГрузу.Выбрать();
				Пока ВыборкаДетализации.Следующий() Цикл
					НС = ДетализацияПоГрузу.Добавить();	
					ЗаполнитьЗначенияСвойств(НС,ВыборкаДетализации); 
					НС.КлючАналитикиПеревозки = стр.КлючАналитикиПеревозки;
				КонецЦикла;
			КонецЕсли;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 27.06.2024
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры 

&НаСервере
Процедура ДетализацияПоГрузуИзКлючей()
	МассивКлючей = Новый Массив;
	ДополнитьМассивКлючей(МассивКлючей, "ВагоныРефСцепа");
	ДополнитьМассивКлючей(МассивКлючей, "Контейнеры");
	ТЗ = Справочники.КлючиАналитикиПеревозки.ПолучитьДетализациюПоГрузу(МассивКлючей); 
	ДетализацияПоГрузу.Загрузить(ТЗ); 
КонецПроцедуры	

&НаСервере
Процедура ДополнитьМассивКлючей(МассивКлючей, ИмяТЧ)

	Для Каждого Стр Из Объект[ИмяТЧ] Цикл
		Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда 
			мМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Стр.КлючАналитикиПеревозки);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКлючей, мМассив, Истина); 
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры	

#КонецОбласти

#Область Задачи

&НаСервере
Процедура ЗакрытьЗадачу(Состояние)
	тзСостояния = Объект.Состояния.Выгрузить();
	
	мСостояния = тзСостояния.НайтиСтроки(Новый Структура("Состояние", Состояние));
	ЕстьИзменения = Ложь;
	Для каждого стр из мСостояния Цикл
		СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
		Если Стр.Статус <> СтатусВыполнен Тогда
			Стр.Статус = СтатусВыполнен;
			Стр.ВыполнениеЗафиксировано = Истина; 
			ЕстьИзменения = Истина;
			Прервать;	
		КонецЕсли;	
	КонецЦикла;      
	Если мСостояния.Количество()>0 Тогда
		// Ставим задачу на первое место, что б выполнение не обнулялось после записи;
		тзСостояния.Сдвинуть(Стр, - тзСостояния.Индекс(Стр));
		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		Объект.Состояния.Загрузить(тзСостояния);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПревдогруппировкаПоВагонам

&НаКлиенте
Процедура УстановитьГруппировкуПоВагонамЦветомТекста()
	
	Вагон = ПредопределенноеЗначение("Справочник.ТС.ПустаяСсылка"); 
	
	Для Сч = 0 По Объект.ВагоныРефСцепа.Количество() - 1 Цикл
		
		ВходитВОтбор = Элементы.ВагоныРефСцепа.ПроверитьСтроку
			(Объект.ВагоныРефСцепа[Сч].ПолучитьИдентификатор());
			
		//Евросиб Коханенко Н.А. 07.10.2024 (( #90312
		//переменная ВходитВОтбор может принимать значение Неопределено
		//Если ВходитВОтбор Тогда
		Если ВходитВОтбор = Истина Тогда
		//Евросиб Коханенко Н.А. 07.10.2024 )) #90312
			Если Объект.ВагоныРефСцепа[Сч].Вагон = Вагон Тогда
				Объект.ВагоныРефСцепа[Сч].НеПерваяСтрокаВагонаДляГруппировки = Истина;
			Иначе
				Объект.ВагоныРефСцепа[Сч].НеПерваяСтрокаВагонаДляГруппировки = Ложь;
			КонецЕсли;
			Вагон = Объект.ВагоныРефСцепа[Сч].Вагон;			
		Иначе 
			Объект.ВагоныРефСцепа[Сч].НеПерваяСтрокаВагонаДляГруппировки = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаПослеУдаления(Элемент)
	УстановитьГруппировкуПоВагонамЦветомТекста();
КонецПроцедуры
#КонецОбласти


#Область Разное

&НаКлиенте
Функция ЕстьДублиНовыхКонтейнеров(ИмяТЧ, контейнер)
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл
		Если Стр.Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(контейнер) Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Контейнер " + Контейнер + " уже есть в строке №" 
			+ Стр.НомерСтроки + " табличной части " + ИмяТЧ + ". Дубль контейнера не добавлен.");
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Процедура КонтейнерыКонтейнерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = Не (ЕстьДублиНовыхКонтейнеров("ВагоныРефСцепа", ВыбранноеЗначение) или ЕстьДублиНовыхКонтейнеров("Контейнеры", ВыбранноеЗначение));
КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаявкиДляКТК(Команда)

	Если не объект.Проведен Тогда 
		ОбщегоНазначенияКлиент.СообщитьПОльзователю("Подбор заявок возможен только для проведенного документа.");
		Возврат;
	КонецЕсли;	
	
	Если ЭтаФорма.Модифицированность или не Объект.Проведен Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодборЗаявокПодтверждено", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Для продолжения подбора заявок требуется записать данные. Записать данные?"
			, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ПодборЗаявокПродолжение();
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПодборЗаявокПодтверждено(П1 = неопределено, П2 = неопределено) Экспорт 
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;

	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	ПодборЗаявокПродолжение();

КонецПроцедуры
	
&НаКлиенте
Процедура ПодборЗаявокПродолжение()
	//Субботин 76108 25.10.2023 начало// поменял алгоритм на поиск по ктк
	//ПодобратьЗаявкиНаСервере();
	  ПодобратьЗаявкиПоКткНаСервере();
	//Субботин 76108 25.10.2023 начало// 
	
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
	УстановитьОтборДетализацияПоГрузуПоТЧ("Контейнеры");
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
КонецПроцедуры

&НаСервере
Процедура ПодобратьЗаявкиНаСервере()
	
	МассивКлючейАналитикиЗаявокРефСцепа 
		= РефСцепСервер.ПолучитьЗаявкиПоКлючамАналитикиРефСцепа(ВсеКлючиАналитикиПеревозкиРефСцепа(), Объект.Ссылка).Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
		
	ДанныеЗаявокДляПобора       = РефСцепСервер.ПолучитьСписокЗаявокДляДобавленияКонтейнеров(РефСцепСервер.ПолучитьДанныеРефСцепаДляОтбораЗаявок(Объект, Истина));
		
	МассивЗаявокДляПодбора 	    = ДанныеЗаявокДляПобора.СписокЗаявок;
	ЗаявкиДляПодбора    	    = ЗаявкиДляПодбора(МассивЗаявокДляПодбора);
	//Субботин 71114 06.09.2023 начало
	МассивКонтейнеровПоЗаявкам  = ДанныеЗаявокДляПобора.СписокЗаявокСКлючамиАналитики;
	
	Для каждого стрЗаявка из ЗаявкиДляПодбора Цикл 
		ПараметрыОтбора = Новый Структура("Ссылка", стрЗаявка.Заявка);
		МассивКТКПоЗаявке = МассивКонтейнеровПоЗаявкам.найтиСТроки(ПараметрыОтбора);
		
		Для каждого СтрКонтейнерРефСцепа из Объект.Контейнеры Цикл
			Для каждого СтрКонтейнер из МассивКТКПоЗаявке цикл
				Если не СтрКонтейнер.Контейнер = СтрКонтейнерРефСцепа.Контейнер Тогда 
					продолжить;
				КонецЕсли;
	//Субботин 71114 06.09.2023 Конец			
				Если Значениезаполнено(СтрКонтейнерРефСцепа.ПеренесенВРефСцеп) Тогда
					Продолжить;
				КонецЕсли;     
				Если МассивКлючейАналитикиЗаявокРефСцепа.Найти(СтрКонтейнерРефСцепа.КлючаналитикиПеревозки) <> Неопределено тОгда
					Продолжить;
				КонецЕсли;     
				Если СтрКонтейнерРефСцепа.Заявка <> Документы.Заявка.ПустаяСсылка() Тогда
					Продолжить;
				КонецЕсли;     
				
				Если СтрКонтейнерРефСцепа.Клиент <> стрЗаявка.Контрагент Тогда
					Продолжить;
				КонецЕсли;     
				
				СтрКонтейнерРефСцепа.ЗаявкаПодбора = стрЗаявка.Заявка;
				
				СтрКонтейнерРефСцепа.Заявка        = стрЗаявка.Заявка;
				
				Сообщить("В подобранном в строку " +СтрКонтейнерРефСцепа.НомерСтроки + " документе " + СтрКонтейнерРефСцепа.ЗаявкаПодбора + " контейнер должен появится в течении часа после проведения документа реф.сцеп.");
				
				МассивКлючейАналитикиЗаявокРефСцепа.Добавить(СтрКонтейнерРефСцепа.КлючАналитикиПеревозки);
				
				ЭтаФорма.Модифицированность = Истина;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Функция ЗаявкиДляПодбора(МассивЗаявокДляДобавления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка,
		|	Заявка.Контрагент КАК Контрагент,
		|	Заявка.Дата КАК Дата
		|ПОМЕСТИТЬ вт_Заявки
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Ссылка В(&МассивЗаявок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Заявки.Контрагент КАК Контрагент,
		|	МАКСИМУМ(вт_Заявки.Дата) КАК Дата
		|ПОМЕСТИТЬ вт_МаксДатыПоКонтрагентам
		|ИЗ
		|	вт_Заявки КАК вт_Заявки
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Заявки.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Заявки.Ссылка КАК Заявка,
		|	вт_Заявки.Контрагент КАК Контрагент
		|ИЗ
		|	вт_Заявки КАК вт_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_МаксДатыПоКонтрагентам КАК вт_МаксДатыПоКонтрагентам
		|		ПО вт_Заявки.Контрагент = вт_МаксДатыПоКонтрагентам.Контрагент
		|			И вт_Заявки.Дата = вт_МаксДатыПоКонтрагентам.Дата";
	
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявокДляДобавления); 
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ПодобратьЗаявкиПоКткНаСервере() 
	
	СписокНайденыхЗаявокКлючей = ПодобратьЗаявкиПоКТК();
	Для Каждого СтрокаКонтейнера Из Объект.Контейнеры Цикл 
		Если Значениезаполнено(СтрокаКонтейнера.ПеренесенВРефСцеп) Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыОтбора = Новый Структура("Контейнер", СтрокаКонтейнера.Контейнер);
		НайденаяЗаявкаПоКтк = СписокНайденыхЗаявокКлючей.НайтиСтроки(ПараметрыОтбора);
		Если НайденаяЗаявкаПоКтк.Количество() >0 Тогда
			СтрокаКонтейнера.Заявка = НайденаяЗаявкаПоКтк[0].Заявка; 
			СтрокаКонтейнера.ЗаявкаПодбора = НайденаяЗаявкаПоКтк[0].Заявка;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 27.06.2024 
			//Было:
			//СтрокаКонтейнера.КлючАналитикиПеревозки = НайденаяЗаявкаПоКтк[0].КлючАналитикиПеревозки;
			//Стало:
			//Если были строки по детализации, то заменим в них старый ключ на новый 
			СтруктураПоискаДетализации = Новый Структура("КлючАналитикиПеревозки", СтрокаКонтейнера.КлючАналитикиПеревозки); 
			СтрокиПоДетализации = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоискаДетализации);
			Для каждого СтрДетализацииГруза Из СтрокиПоДетализации Цикл
				СтрДетализацииГруза.КлючАналитикиПеревозки = НайденаяЗаявкаПоКтк[0].КлючАналитикиПеревозки; 
			КонецЦикла;
			СтрокаКонтейнера.КлючАналитикиПеревозки = НайденаяЗаявкаПоКтк[0].КлючАналитикиПеревозки;
			
			РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденаяЗаявкаПоКтк[0].КлючАналитикиПеревозки,
								"Груз, ВесГруза,КоличествоМест, ДетализацияПоГрузу,ВерсияДанных"); 
			СтрокаКонтейнера.ВерсияКлюча = РеквизитыКлюча.ВерсияДанных;
			Если не ЗначениеЗаполнено(СтрокаКонтейнера.Груз) Тогда
				СтрокаКонтейнера.Груз = РеквизитыКлюча.Груз;
				СтрокаКонтейнера.КодЕТСНГ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКлюча.Груз, "ЕТСНГ"); 
				СтрокаКонтейнера.СостояниеКонтейнера = Перечисления.СостоянияКТК.Груженый;
				ВыборкадетализацияГруза = РеквизитыКлюча.ДетализацияПоГрузу.Выбрать(); 
				Пока ВыборкадетализацияГруза.Следующий() Цикл 
					НС = ДетализацияПоГрузу.Добавить();
					ЗаполнитьЗначенияСвойств(НС, ВыборкадетализацияГруза);  
					НС.КлючАналитикиПеревозки = НайденаяЗаявкаПоКтк[0].КлючАналитикиПеревозки; 
				КонецЦикла;
			КонецЕсли; 
			Если не ЗначениеЗаполнено(СтрокаКонтейнера.ВесКонтейнераНетто) Тогда
				СтрокаКонтейнера.ВесКонтейнераНетто = РеквизитыКлюча.ВесГруза;
			КонецЕсли;
			Если не ЗначениеЗаполнено(СтрокаКонтейнера.КоличествоМестКонтейнера) Тогда
				СтрокаКонтейнера.КоличествоМестКонтейнера = РеквизитыКлюча.КоличествоМест;
			КонецЕсли;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 27.06.2024
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

  //Субботин 76108 25.10.2023 начало//
&НаСервере
 Функция ПодобратьЗаявкиПоКТК()
	  
	СписокКтк = Объект.Контейнеры.Выгрузить(,"Контейнер");
	СписокКонтрагентов = Объект.Контейнеры.Выгрузить(,"Клиент");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_заявкиПоКлиентамРефсцепа
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Контрагент В(&Контрагенты)
		|	И Заявка.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.Ссылка.Дата КАК Дата,
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
		|ПОМЕСТИТЬ ВТ_НайденныеЗаявки
		|ИЗ
		|	ВТ_заявкиПоКлиентамРефсцепа КАК ВТ_заявкиПоКлиентамРефсцепа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТ_заявкиПоКлиентамРефсцепа.Ссылка = ЗаявкаСоставУслуги.Ссылка
		|			И (ЗаявкаСоставУслуги.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка))
		|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
		|			И (ЗаявкаСоставУслуги.НомерКТК В (&СписокКтк))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_НайденныеЗаявки.Дата) КАК Дата,
		|	ВТ_НайденныеЗаявки.НомерКТК КАК НомерКТК
		|ПОМЕСТИТЬ ВТ_максДатыПоКтк
		|ИЗ
		|	ВТ_НайденныеЗаявки КАК ВТ_НайденныеЗаявки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НайденныеЗаявки.НомерКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеЗаявки.Заявка КАК Заявка,
		|	ВТ_НайденныеЗаявки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВТ_НайденныеЗаявки.НомерКТК КАК Контейнер
		|ИЗ
		|	ВТ_НайденныеЗаявки КАК ВТ_НайденныеЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_максДатыПоКтк КАК ВТ_максДатыПоКтк
		|		ПО ВТ_НайденныеЗаявки.Дата = ВТ_максДатыПоКтк.Дата
		|			И ВТ_НайденныеЗаявки.НомерКТК = ВТ_максДатыПоКтк.НомерКТК";
		
	Запрос.УстановитьПараметр("СписокКтк", СписокКтк);
	Запрос.УстановитьПараметр("Контрагенты", СписокКонтрагентов);
	Возврат Запрос.Выполнить().Выгрузить(); 
	
КонецФункции

//Субботин 78646 13.12.2023 Начало
Процедура ЗаполнитьПризнакЭксплуатации()
	
	ТаблицаКТК = Объект.Контейнеры.Выгрузить(,"Контейнер");
	ТаблицаВагонов = Объект.ВагоныРефСцепа.Выгрузить(,"Контейнер"); 
	Для каждого СтрокаКТК из ТаблицаВагонов Цикл
		НовСтрока = ТаблицаКТК.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаКТК);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&ТаблицаКТК)) КАК стоки_ТекущиеДанныеСрезПоследних";
	
	Запрос.УстановитьПараметр("ТаблицаКТК", ТаблицаКТК);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для Каждого ктк из Объект.Контейнеры Цикл 
		НайденнаяСтрока = РезультатЗапроса.Найти(Ктк.Контейнер,"КТК");
		Если НайденнаяСтрока<> Неопределено Тогда
			ктк.ПризнакЭксплуатации = НайденнаяСтрока.тек_ВЭксплуатации;
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого Ктк из Объект.ВагоныРефСцепа Цикл 
		НайденнаяСтрока = РезультатЗапроса.Найти(Ктк.Контейнер,"КТК");
		Если НайденнаяСтрока<> Неопределено Тогда
			Ктк.ПризнакЭксплуатации = НайденнаяСтрока.тек_ВЭксплуатации;
		КонецЕсли;
	КонецЦикла; 


КонецПроцедуры	

&НаКлиенте
Процедура КонтейнерыПринадлежностьКонтейнераОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.Контейнеры.ТекущиеДанные;
	Если ТекДанные.ПризнакЭксплуатации и ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("У контейнера имеется открытый подрядческий цикл и изменение принадлежности в рамках текущего цикла невозможно");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныРефСцепаПринадлежностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		ТекДанные = Элементы.ВагоныРефСцепа.ТекущиеДанные;
	Если ТекДанные.ПризнакЭксплуатации и ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("У контейнера имеется открытый подрядческий цикл и изменение принадлежности в рамках текущего цикла невозможно");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
//Субботин 78646 13.12.2023 Конец

//Субботин 78028 21.12.2023 начало добавил аткуализацию ключей толькко при записи/проведении документа
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 02.05.2024       
	ВыполнитьПроверкиКорректностиДанныхДляКлючаНаСервере(Отказ); 
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;   
	
	Если не ПараметрыЗаписи.Свойство("ВопросВыставленныеСчетаЗадан") Тогда 
		МассивВыставленныхСчетов = ПроверитьВыставленныеПоЗаявкамСчета();  
		Если МассивВыставленныхСчетов.Количество() Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросПродолжениеЗаписиЗавершение", ЭтаФорма, ПараметрыЗаписи);	
			СчетаСтрока = СтрСоединить(МассивВыставленныхСчетов, ", ");
			ТекстВопроса = "Внимание, вы изменяете данные по заявке, на которую имеются выставленные счета: " + СчетаСтрока;
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок,,КодВозвратаДиалога.Да);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 02.05.2024
	
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл 
		Если ЗначениеЗаполнено(СтрокаТЧ.Контейнер) Тогда
			СтруктураПоиска = Новый Структура("Контейнер", СтрокаТЧ.Контейнер);
			Если Объект.Контейнеры.НайтиСтроки(СтруктураПоиска).Количество() + Объект.ВагоныРефСцепа.НайтиСтроки(СтруктураПоиска).Количество() > 1  Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Контейнер "+ СтрокаТЧ.Контейнер + "  добавлен в рефсцеп дважды. Удалите строку или замените ктк.",,,,Отказ);
				Возврат
			КонецЕсли;
		КонецЕсли;
		НайтиКлючАналитикиПеревозкиКлиент(СтрокаТЧ, "Контейнеры");
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ВагоныРефСцепа Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Контейнер) Тогда			
			СтруктураПоиска = Новый Структура("Контейнер", СтрокаТЧ.Контейнер);
			Если Объект.ВагоныРефСцепа.НайтиСтроки(СтруктураПоиска).Количество() + Объект.Контейнеры.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Контейнер "+ СтрокаТЧ.Контейнер + "  добавлен в рефсцеп дважды. Удалите строку или замените ктк.",,,,Отказ);
				Возврат
			КонецЕсли;
		КонецЕсли;
		НайтиКлючАналитикиПеревозкиКлиент(СтрокаТЧ, "ВагоныРефСцепа");
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) 
	
	Если ИмяСобытия = "НеобходимоОбновитьДанныеКлючейАналитикиПеревозки" Тогда	
		Если Источник <> Неопределено и Источник.УникальныйИдентификатор <> ЭтаФорма.УникальныйИдентификатор Тогда
			ПроверитьАктуальностьКлючаАналитики();
			//Евросиб Коханенко Н.А. 09.10.2024 (( #90312
			//при переносе КТК из рефа в другой реф происходило зацикливание записи рефа-источника и рефа-приемника
			//решено пока закомментировать запись
			//ЭтотОбъект.Записать();
			//Евросиб Коханенко Н.А. 09.10.2024 )) #90312 
			Оповестить("НеобходимоОбновитьФормуЗаявкиДляРаботыСЗапросомКТК",, ЭтаФорма);
   		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьКлючаАналитики()   
	НужноОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из Объект.ВагоныРефСцепа Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			НужноОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			НужноОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Если НужноОбновлениеКлюча Тогда  
		ОбновитьДанныеКлючаНаФормеСервер();
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные");
	КонецЕсли; 
КонецПроцедуры
//Субботин 78028 21.12.2023 Конец

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024  
&НаСервере
Процедура ВыполнитьПроверкиКорректностиДанныхДляКлючаНаСервере(Отказ)    
	ТЗдляПроверки = Объект.Контейнеры.Выгрузить().Скопировать(,"Контейнер, КлючАналитикиПеревозки, Заявка");
	КлючиАналитикиПеревозкиСервер.ПроверитьСоответствиеКонтейнераФутовостиВКалькуляции(ТЗдляПроверки, Отказ);
	
	ТЗдляПроверки = Объект.ВагоныРефСцепа.Выгрузить().Скопировать(,"Контейнер, КлючАналитикиПеревозки, Заявка");  
	КлючиАналитикиПеревозкиСервер.ПроверитьСоответствиеКонтейнераФутовостиВКалькуляции(ТЗдляПроверки, Отказ);  
	
	КТКЕстьВДругойЗаявке = КлючиАналитикиПеревозкиСервер.ПроверитьКТКвДругойЗаявке(ТЗдляПроверки);
	Для каждого Ответ Из КТКЕстьВДругойЗаявке Цикл
		Сообщить("!!! КТК № " + Ответ.НомерКТК + " встречается также в заявке " + Ответ.Заявка + ". Проверьте, не ошибка ли это!", СтатусСообщения.Внимание);
	КонецЦикла;
КонецПроцедуры

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024    
&НаСервере
Функция ПроверитьВыставленныеПоЗаявкамСчета()

	МассивСчетов = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВагоныРефСцепа.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВагоныРефСцепа.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_Вагоны
		|ИЗ
		|	&ВагоныРефСцепа КАК ВагоныРефСцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	Контейнеры.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_Контейнеры
		|ИЗ
		|	&Контейнеры КАК Контейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вагоны.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВТ_Вагоны.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ДанныеСФормы
		|ИЗ
		|	ВТ_Вагоны КАК ВТ_Вагоны
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контейнеры.КлючАналитикиПеревозки,
		|	ВТ_Контейнеры.Контейнер
		|ИЗ
		|	ВТ_Контейнеры КАК ВТ_Контейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка,
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозки.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТ_ИзмененныеКонтейнеры
		|ИЗ
		|	ВТ_Вагоны КАК ВТ_ДанныеСФормы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО ВТ_ДанныеСФормы.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ
		|	ВТ_ДанныеСФормы.Контейнер <> КлючиАналитикиПеревозки.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзмененныеКонтейнеры.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ИзмененныеКонтейнеры КАК ВТ_ИзмененныеКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Представление КАК ПредставлениеСчета,
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ИзмененныеКонтейнеры КАК ВТ_ИзмененныеКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|		ПО ВТ_ИзмененныеКонтейнеры.Заявка = СчетНаОплатуПокупателюДокументыОснования.Документ
		|ГДЕ
		|	НЕ СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления
		|	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ВагоныРефСцепа", Объект.ВагоныРефСцепа.Выгрузить(, "Контейнер, КЛючАналитикиПеревозки"));
	запрос.УстановитьПараметр("Контейнеры", Объект.Контейнеры.Выгрузить(, "Контейнер, КЛючАналитикиПеревозки"));
	
	Результат = Запрос.ВыполнитьПакет();   
	РезультатИзменениеКТК = Результат[4];
	Если РезультатИзменениеКТК.Пустой() Тогда
		Возврат МассивСчетов;
	КонецЕсли; 
	
	РезультатЗапроса = Результат[5];
	Если не РезультатЗапроса.Пустой() Тогда
		ВыборкаСчетов = РезультатЗапроса.Выбрать();
		Пока ВыборкаСчетов.Следующий() Цикл
			МассивСчетов.Добавить(ВыборкаСчетов.ПредставлениеСчета);
		КонецЦикла;
	КонецЕсли;

	Возврат МассивСчетов;
КонецФункции 

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024
&НаКлиенте
Процедура ПоказатьВопросПродолжениеЗаписиЗавершение(Результат, ПараметрыЗаписи) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросВыставленныеСчетаЗадан", Истина);
	    Записать(ПараметрыЗаписи);
	КонецЕсли;	

КонецПроцедуры

//Евросиб Коханенко Н.А. 11.09.2024 (( #90312 
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	СсылкаНаРеф = ?(ТекущийОбъект.Ссылка.Пустая(), ТекущийОбъект.ПолучитьСсылкуНового(), ТекущийОбъект.Ссылка);

	Для Каждого Стр Из Объект.ВагоныРефСцепа Цикл
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки; 
		
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
		ИначеЕсли НЕ ЗначениеЗаполнено(Стр.ПеренесенВРефСцеп) 
				И Стр.ЕстьВагонВРегистреНаФорме
				И (Объект.Проведен 
					ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = СсылкаНаРеф;
		Иначе
			СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
		КонецЕсли;
		КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	КонецЦикла;
	
	Для Каждого Стр Из Объект.Контейнеры Цикл
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;  
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
		ИначеЕсли НЕ ЗначениеЗаполнено(Стр.ПеренесенВРефСцеп) 
				И (Объект.Проведен
					ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = СсылкаНаРеф;
		//КТК перенесен в другой реф.сцеп, поэтому ссылку в ключе не трогаем
		//Иначе
		//	СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
		КонецЕсли;
		КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	КонецЦикла;
КонецПроцедуры //Евросиб Коханенко Н.А. 11.09.2024 )) #90312

//Евросиб Коханенко Н.А. 11.09.2024 (( #90312 
&НаСервере
Процедура УдалитьСсылкуНаРефИзКлючаАналитики(КлючСсылка)
	
	Если ЗначениеЗаполнено(КлючСсылка) Тогда
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = КлючСсылка;  
		СтруктураКлючаАналитикиПеревозки.РейсРефСцепа = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
		КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
    КонецЕсли;

КонецПроцедуры //Евросиб Коханенко Н.А. 11.09.2024 )) #90312

#КонецОбласти





