
Процедура ВвестиСчетФактуру(ДокументОбъект, ФормаДокумента, ВидСчетаФактуры = "СчетФактураВыданный", Отбор = Неопределено) Экспорт
	
	Если (Не ДокументОбъект.Проведен) и (Не ДокументОбъект.ПометкаУдаления) Тогда
		
	КонецЕсли;
	
	// Шейко О.Е. (25.01.2021) по идее здесь должен быть отбор только на не помеченные на удаление. Для корректировок ПТУ все именно так:
	СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокументОбъект.Ссылка, ВидСчетаФактуры,,Отбор);
	//////
	
	Если (Не ЗначениеЗаполнено(СчетФактура)) и (Не ДокументОбъект.ПометкаУдаления) Тогда
		
		// Шейко О.Е. (25.01.2021) Здесь делим на варианты Перезаполнения и Создание Новой
		СчетФактураПомеченный = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокументОбъект.Ссылка, ВидСчетаФактуры,,);
		// Нашлась Счет фактура помеченная на удаление:
		Если ЗначениеЗаполнено(СчетФактураПомеченный) Тогда
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДокументОбъект.Ссылка,СчетФактураПомеченный,,,,Истина);
		Иначе
			СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.СоздатьСчетФактуру(ВидСчетаФактуры,ДокументОбъект.Ссылка);
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
		БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДокументОбъект.Ссылка,СчетФактура);
	Иначе
		Сообщить("На основании документов, помеченных на удаление, ввод счетов-фактур не предусмотрен.");
	КонецЕсли;
	//ПараметрыФормы = Новый Структура("Ключ",СчетФактура);
	//ПараметрыФормы.Вставить("ДанныеЗаполнения",ДокументОбъект);
	//Если ВидСчетаФактуры = "СчетФактураВыданный" Тогда
	//	ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаДокумента",ПараметрыФормы);
	//ИначеЕсли ВидСчетаФактуры = "СчетФактураПолученный" Тогда
	//	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокумента",ПараметрыФормы);
	//КонецЕсли;
КонецПроцедуры

Процедура ОткрытьСчетФактуру(ДокументОбъект, ФормаДокумента, ВидСчетаФактуры = "СчетФактураВыданный", Отбор = Неопределено) Экспорт
	
	СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокументОбъект.Ссылка, ВидСчетаФактуры,Отбор);
	
	Если СчетФактура <> Неопределено ТОгда
		ПараметрыФормы = Новый Структура("Ключ",СчетФактура);
		ПараметрыФормы.Вставить("ДанныеЗаполнения",ДокументОбъект);
		Если ВидСчетаФактуры = "СчетФактураВыданный" Тогда
			ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаДокумента",ПараметрыФормы);
		ИначеЕсли ВидСчетаФактуры = "СчетФактураПолученный" Тогда
			ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокумента",ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьНадписьСчФ(РеквизитыСФ) Экспорт
	Надпись = РеквизитыСФ.Номер+" от " +Строка(Формат(РеквизитыСФ.ДАта,"ДФ=dd.MM.yyyy"))+" г.";
	
	Возврат Надпись;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммыНДС(СТрТЧ, УчитыватьНДС, СуммаВключаетНДС) Экспорт
	СТрТЧ.СуммаНДС = ПолучитьСуммуНДС(СТрТЧ.Сумма,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС),УчитыватьНДС,СуммаВключаетНДС);
Конецпроцедуры

Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС, УчитыватьНДС, СуммаВключаетНДС) Экспорт
	
	Если (УчитыватьНДС) и (СуммаВключаетНДС) Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;
	
	Если УчитыватьНДС Тогда 
		Если НЕ СуммаВключаетНДС Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции

Процедура РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ) Экспорт
	 СтрТЧ.Сумма = СтрТЧ.Цена * СтрТЧ.Количество;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьСуммуВсегоПоСтроке(СтрТЧ, СуммаВключаетНДС) Экспорт
	
	Если СтрТЧ.Всего <> (СтрТЧ.Сумма + ?(СуммаВключаетНДС,0,СтрТЧ.СуммаНДС)) Тогда
	
		СтрТЧ.Всего = СтрТЧ.Сумма + ?(СуммаВключаетНДС,0,СтрТЧ.СуммаНДС);
	
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
		Возврат 10;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
		Возврат 18;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105") Тогда
		Возврат 5;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107") Тогда
		Возврат 7;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	
	//Евросиб СубботинВ #125845 09.12.2025 Начало
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") Тогда
		Возврат 22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Евросиб Фролов (15.03.2022 Task №40571
Процедура ПроверитьКоличествоВТабличнойЧасти(Форма, ИмяТабличнойЧасти) Экспорт
	
	Элементы = Форма.Элементы;
	ТекущиеДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения) Тогда
		Возврат;
	КонецЕсли;	
	
	ТолькоЦелоеКоличество = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ЕдиницаИзмерения, "ТолькоЦелое");
	
	Если ТолькоЦелоеКоличество
		И Цел(ТекущиеДанные.Количество) <> ТекущиеДанные.Количество Тогда
		ПоказатьПредупреждение(, СтрШаблон("Для единицы измерения ""%1"" разрешено вводить только целое количество. Необходимо исправить введенное количество на целое число.", ТекущиеДанные. ЕдиницаИзмерения),, "Неверное количество");
	КонецЕсли;	
	
КонецПроцедуры
// Евросиб Фролов)

//Процедура УстановитьОтбор(Форма,ИмяПоля)  Экспорт
//	ЭлементОтбора = Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ЭлементОтбора.ПравоеЗначение = Форма.ОтборКонтрагент;
//	
//	 а=1;
// КонецПроцедуры
// 
//Процедура УдалитьОтбор(Форма,ИмяПоля) Экспорт
//	Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(); 
//КонецПроцедуры