#Область ПрограммныйИнтерфейс

// Функция - Создать/Найти ключ аналитики
//
// Параметры:
//  СтруктураКлючаАналитикиПеревозки - 	 - СтруктураКлючаАналитикиПеревозки() 
// 
// Возвращаемое значение:
//  Структура - СправочникСсылка.КлючиАналитикиПеревозки и Версия данных
//
Функция НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки) Экспорт // ДИТ US 62421 TA 64346 Евсенкин М.А. 
	
	КлючСсылка = Справочники.КлючиАналитикиПеревозки.ПустаяСсылка();
	
	Если СтруктураКлючаАналитикиПеревозки.Свойство("КлючАналитики",КлючСсылка) Тогда  
		Если Не ЗначениеЗаполнено(КлючСсылка) Тогда   
			КлючСсылка = СоздатьНовыйКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		Иначе 
			КлючСсылка = ОбновитьСуществующийКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		КонецЕсли;	
	КонецЕсли;	
	
	ВерсияДанных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КлючСсылка,"ВерсияДанных");
	
	Структура = Новый Структура("КлючАналитикиПеревозки,ВерсияДанных",КлючСсылка,ВерсияДанных);
	
	Возврат Структура;	
	
КонецФункции

// Функция - Ключи аналитики значения полей по этапу перевозки
//
// Параметры:
//  МассивКлючей	 - Массив					 - массив ссылок на ключи
//  ЭтапПеревозки	 - Перечисление.ЭтапыПеревозки	 - 
// 
// Возвращаемое значение:
//  ТЗ - ТаблицаЗначений
//
Функция КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,ЭтапПеревозки) Экспорт //ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки,
		//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
		|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто КАК ЗапросНаАвто,
		|	КлючиАналитикиПеревозкиМили.НомерЗаказаНаТС КАК НомерЗаказаНаТС,
		//Евросиб Коханенко Н.А. 23.07.2024 )) #88706  
		//Евросиб Коханенко Н.А. 18.07.2025 (( #114760 
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеПостановкиФакт КАК ОперацияНаТерминалеПостановкиФакт,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаСкладеКлиентаФакт КАК ОперацияНаСкладеКлиентаФакт,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеСдачиФакт КАК ОперацияНаТерминалеСдачиФакт, 
		|	КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку КАК ДатаИВремяПрибытияНаПогрузкуВыгрузку, 
		|	КлючиАналитикиПеревозкиМили.ЭкспедированиеФакт КАК ЭкспедированиеФакт, 
		|	КлючиАналитикиПеревозкиМили.КомментарийДиспЕвросиб КАК КомментарийДиспЕвросиб,                   
		|	КлючиАналитикиПеревозкиМили.КомментарийПеревозчика КАК КомментарийПеревозчика, 
		|	КлючиАналитикиПеревозкиМили.ПротоколПоставщика КАК ПротоколПоставщика, 
		//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
		//|	КлючиАналитикиПеревозкиМили.ЗаказНаТС КАК ЗаказНаТС,
		|	КлючиАналитикиПеревозкиМили.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		//Евросиб Коханенко Н.А. 18.09.2025 )) #119413
		//Евросиб Коханенко Н.А. 18.07.2025 )) #114760 
		//Евросиб Коханенко Н.А. 05.08.2025 (( #115647 
		|	КлючиАналитикиПеревозкиМили.ВесНеттоФакт КАК ВесНеттоФакт,
		//Евросиб Коханенко Н.А. 05.08.2025 )) #115647
        //Евросиб Коханенко Н.А. 05.03.2026 (( #128357
	    |	КлючиАналитикиПеревозкиМили.ХолостойПрогон КАК ХолостойПрогон,
	    //Евросиб Коханенко Н.А. 05.03.2026 )) #128357				   
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)
		|	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = &ЭтапПеревозки";
	
	Запрос.УстановитьПараметр("Ссылка",МассивКлючей);
	Запрос.УстановитьПараметр("ЭтапПеревозки",ЭтапПеревозки);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Функция - Получить детализацию по грузу
//
// Параметры:
//  МассивКлючей - Массив	 - ссылки на ключи
// 
// Возвращаемое значение:
//  ТЗ - Таблица значений
//
Функция ПолучитьДетализациюПоГрузу(МассивКлючей) Экспорт	// ДИТ US 62421 TA 64346 Евсенкин М.А. 	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДетализацияПоГрузу.Ссылка КАК КлючАналитикиПеревозки,
		|	ДетализацияПоГрузу.Груз КАК Груз,
		|	ДетализацияПоГрузу.ОпасныйГруз КАК ОпасныйГруз,
		|	ДетализацияПоГрузу.КоличествоМест КАК КоличествоМест,
		|	ДетализацияПоГрузу.ВесГруза КАК ВесГруза,
		|	ДетализацияПоГрузу.РодУпаковки КАК РодУпаковки
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК ДетализацияПоГрузу
		|ГДЕ
		|	ДетализацияПоГрузу.Ссылка В(&МассивКлючей)";
	
	Запрос.УстановитьПараметр("МассивКлючей",МассивКлючей);
	
	Результат = Запрос.Выполнить(); 

	Возврат Результат.Выгрузить();
	
КонецФункции

#КонецОбласти

 #Область СлужебныйПрограммныйИнтерфейс
// Функция - Структура шапки ключа аналитики
// 
// Возвращаемое значение:
//  СтруктураКлюча - Структура - 
//
Функция СтруктураКлючаАналитикиПеревозки() Экспорт  // ДИТ US 62421 TA 64346 Евсенкин М.А.
	
	СтруктураКлючаАналитикиПеревозки = Новый Структура;
	
	СтруктураКлючаАналитикиПеревозки.Вставить("КлючАналитики");
	СтруктураКлючаАналитикиПеревозки.Вставить("Заявка");
	СтруктураКлючаАналитикиПеревозки.Вставить("Контейнер");
	СтруктураКлючаАналитикиПеревозки.Вставить("ИнструкцияПоСдаче");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаНачалаПеревозки");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаОкончанияПеревозки");
	СтруктураКлючаАналитикиПеревозки.Вставить("Груз"); 
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
	СтруктураКлючаАналитикиПеревозки.Вставить("КоличествоМест"); 
	СтруктураКлючаАналитикиПеревозки.Вставить("ВесГруза"); 
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	СтруктураКлючаАналитикиПеревозки.Вставить("СтруктураТЧМилиПерваяМиляКлючаАналитики",СтруктураТЧМилиКлючаАналитики());	
	СтруктураКлючаАналитикиПеревозки.Вставить("СтруктураТЧМилиПоследняяМиляКлючаАналитики",СтруктураТЧМилиКлючаАналитики());
	//Евросиб Коханенко Н.А. 12.08.2024 (( #87840 
	СтруктураКлючаАналитикиПеревозки.Вставить("СтруктураТЧМилиСредняяМиляКлючаАналитики",СтруктураТЧМилиКлючаАналитики());
	//Евросиб Коханенко Н.А. 12.08.2024 )) #87840 
	СтруктураКлючаАналитикиПеревозки.Вставить("ИзменятьТЧДетализацияПоГрузу", Ложь);
	СтруктураКлючаАналитикиПеревозки.Вставить("ТЧДетализацияПоГрузу",ТЧДетализацияПоГрузу());
	//Евросиб Коханенко Н.А. 13.05.2024 (( #83866 
	СтруктураКлючаАналитикиПеревозки.Вставить("ЗаявкаИсточник"); 
	СтруктураКлючаАналитикиПеревозки.Вставить("ЗаявкаПриемник"); 
	СтруктураКлючаАналитикиПеревозки.Вставить("РелизКлиента");
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаДобавленияВРелиз");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаСдачиКТКНаТерминал");
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025
	СтруктураКлючаАналитикиПеревозки.Вставить("НомерЗаявкиПриемника");
	//Евросиб Коханенко Н.А. 13.05.2024 )) #83866 
	//Евросиб Коханенко Н.А. 10.09.2024 (( #90312 
	СтруктураКлючаАналитикиПеревозки.Вставить("РейсРефСцепа"); 
	//Евросиб Коханенко Н.А. 10.09.2024 )) #90312 
	//Евросиб(ДИТ), Беляев СЮ, User Story 92704, 14-04-2025, начало
	СтруктураКлючаАналитикиПеревозки.Вставить("Груз_ЕТСНГ");
	СтруктураКлючаАналитикиПеревозки.Вставить("Груз_ГНГ");
	СтруктураКлючаАналитикиПеревозки.Вставить("Груз_ТНВЭД");
	//Евросиб(ДИТ), Беляев СЮ, User Story 92704, 14-04-2025, конец
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217 начало
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаВыдачиПорожнегоПодПогрузку");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаЗавозаГруженогоВPOL");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаВыгрузкиССудна");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаТелексаДатаДТ");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаПрибытияПоезда");
	СтруктураКлючаАналитикиПеревозки.Вставить("ДатаСдачиПорожнегоПослеЖд");
	СтруктураКлючаАналитикиПеревозки.Вставить("ИзменятьТЧЭтапыСНП", Ложь);
	СтруктураКлючаАналитикиПеревозки.Вставить("ТЧЭтапыСНП",ТЧЭтапыСНПКлючаАналитики());
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217 конец  
	
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
	СтруктураКлючаАналитикиПеревозки.Вставить("ИсточникЗаписи");
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
	
	Возврат СтруктураКлючаАналитикиПеревозки;
	
КонецФункции 

// Функция - Структура табличной части Мили
// 
// Возвращаемое значение:
//  СтруктураКлюча - Структура - Этап перевозки обязательн для заполнения. 
//
Функция СтруктураТЧМилиКлючаАналитики() 
	
	СтруктураТЧМилиКлючаАналитики = Новый Структура;
	СтруктураТЧМилиКлючаАналитики.Вставить("ДатаВыдачиКТКСТерминала");
	СтруктураТЧМилиКлючаАналитики.Вставить("ДатаСдачиКТКНаТерминал");
	СтруктураТЧМилиКлючаАналитики.Вставить("ДатаВыездаКТКСоСклада");
	СтруктураТЧМилиКлючаАналитики.Вставить("ФИОВодителя");
	СтруктураТЧМилиКлючаАналитики.Вставить("ПаспортныеДанные");
	СтруктураТЧМилиКлючаАналитики.Вставить("РегНомерТС");
	СтруктураТЧМилиКлючаАналитики.Вставить("Автоперевозчик");
	СтруктураТЧМилиКлючаАналитики.Вставить("ИНН");
	СтруктураТЧМилиКлючаАналитики.Вставить("КПП");
	СтруктураТЧМилиКлючаАналитики.Вставить("АдресКлиента");
	//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
	СтруктураТЧМилиКлючаАналитики.Вставить("ЗапросНаАвто");
	СтруктураТЧМилиКлючаАналитики.Вставить("НомерЗаказаНаТС");
	//Евросиб Коханенко Н.А. 23.07.2024 )) #88706
	//Евросиб Коханенко Н.А. 18.07.2025 (( #114760 
	СтруктураТЧМилиКлючаАналитики.Вставить("ОперацияНаТерминалеПостановкиФакт");
	СтруктураТЧМилиКлючаАналитики.Вставить("ОперацияНаСкладеКлиентаФакт");
	СтруктураТЧМилиКлючаАналитики.Вставить("ОперацияНаТерминалеСдачиФакт"); 
	СтруктураТЧМилиКлючаАналитики.Вставить("ДатаИВремяПрибытияНаПогрузкуВыгрузку"); 
	СтруктураТЧМилиКлючаАналитики.Вставить("ЭкспедированиеФакт"); 
	СтруктураТЧМилиКлючаАналитики.Вставить("КомментарийДиспЕвросиб");                   
	СтруктураТЧМилиКлючаАналитики.Вставить("КомментарийПеревозчика"); 
	СтруктураТЧМилиКлючаАналитики.Вставить("ПротоколПоставщика"); 
	//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
	//СтруктураТЧМилиКлючаАналитики.Вставить("ЗаказНаТС");
	СтруктураТЧМилиКлючаАналитики.Вставить("ИдентификаторСтрокиЗапросаНаАвтоперевозку");
	//Евросиб Коханенко Н.А. 18.09.2025 )) #119413
	//Евросиб Коханенко Н.А. 18.07.2025 )) #114760 
	//Евросиб Коханенко Н.А. 05.08.2025 (( #115647 
	СтруктураТЧМилиКлючаАналитики.Вставить("ВесНеттоФакт");
	//Евросиб Коханенко Н.А. 05.08.2025 )) #115647
	//Евросиб Коханенко Н.А. 05.03.2026 (( #128357
	СтруктураТЧМилиКлючаАналитики.Вставить("ХолостойПрогон");
	//Евросиб Коханенко Н.А. 05.03.2026 )) #128357				   
	
	Возврат СтруктураТЧМилиКлючаАналитики;
	
КонецФункции

Функция ТЧЭтапыСНПКлючаАналитики() //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	
	ТЧЭтапыСНПКлючаАналитики = Новый ТаблицаЗначений;
	
	ТЧЭтапыСНПКлючаАналитики.Колонки.Добавить("ЭтапСНП");
	ТЧЭтапыСНПКлючаАналитики.Колонки.Добавить("НомерСчета");
	ТЧЭтапыСНПКлючаАналитики.Колонки.Добавить("ДатаСчета");
	
	Возврат ТЧЭтапыСНПКлючаАналитики;
	
КонецФункции

// Функция - ТЧДетализация по грузу
// 
// Возвращаемое значение:
//  ТаблицаЗначений - 
//
Функция ТЧДетализацияПоГрузу()
	
	ДетализацияПоГрузу = Новый ТаблицаЗначений;
	
	ДетализацияПоГрузу.Колонки.Добавить("Груз");
	ДетализацияПоГрузу.Колонки.Добавить("ОпасныйГруз");
	ДетализацияПоГрузу.Колонки.Добавить("КоличествоМест");
	ДетализацияПоГрузу.Колонки.Добавить("ВесГруза");
	ДетализацияПоГрузу.Колонки.Добавить("РодУпаковки"); 
	
	Возврат ДетализацияПоГрузу;

КонецФункции	
#КонецОбласти

#Область СозданиеОбновлениеКлюча
// Функция - Создать новый ключ аналитики перевозки
//
// Параметры:
//  СтруктураКлючаАналитикиПеревозки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьНовыйКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки)
	
	КлючОбъект = Справочники.КлючиАналитикиПеревозки.СоздатьЭлемент();
	// Наименование будет сформировано при записи объекта автоматически	
	ЗаполнитьЗначенияСвойств(КлючОбъект,СтруктураКлючаАналитикиПеревозки);
	Если Не СтруктураПустая(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики) Тогда
		НовСтрока = КлючОбъект.Мили.Добавить();
		НовСтрока.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля;
		ЗаполнитьЗначенияСвойств(НовСтрока,СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики);
	КонецЕсли;
	Если Не СтруктураПустая(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики) Тогда
		НовСтрока = КлючОбъект.Мили.Добавить();
		НовСтрока.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля;
		ЗаполнитьЗначенияСвойств(НовСтрока,СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 12.08.2024 (( #87840 
	Если Не СтруктураПустая(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики) Тогда
		НовСтрока = КлючОбъект.Мили.Добавить();
		НовСтрока.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля;
		ЗаполнитьЗначенияСвойств(НовСтрока,СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 12.08.2024 )) #87840
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	Если СтруктураКлючаАналитикиПеревозки.ТЧЭтапыСНП.Количество() Тогда
		НовСтрока = КлючОбъект.ЭтапыСНП.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,СтруктураКлючаАналитикиПеревозки.ТЧЭтапыСНП);
	КонецЕсли;
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	Если СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу.Количество() Тогда
		КлючОбъект.ДетализацияПоГрузу.Загрузить(СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу);
	КонецЕсли;        
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
	КлючОбъект.ДополнительныеСвойства.Вставить("ИсточникЗаписи", СтруктураКлючаАналитикиПеревозки.ИсточникЗаписи);
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
	КлючОбъект.Записать();
	
	Возврат КлючОбъект.Ссылка;
	
КонецФункции

// Функция - Обновить существующий ключ аналитики перевозки
//
// Параметры:
//  СтруктураКлючаАналитикиПеревозки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбновитьСуществующийКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки)
	КлючВыборка = ПолучитьЗначенияКлюча(СтруктураКлючаАналитикиПеревозки.КлючАналитики);
	КлючВыборка.Следующий(); 
	КлючОбъект 							= КлючВыборка.КлючАналитики.ПолучитьОбъект();
	МассивИзмененныхПолей 				= ПроверкаРеквизитовНаИзменение(СтруктураКлючаАналитикиПеревозки,КлючВыборка);
	МассивИзмененныхПолейПерваяМиля 	= ПроверкаРеквизитовНаИзменениеТЧМили(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики,КлючВыборка.Мили,Перечисления.ЭтапыПеревозки.ПерваяМиля);
	МассивИзмененныхПолейПоследняяМиля 	= ПроверкаРеквизитовНаИзменениеТЧМили(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики,КлючВыборка.Мили,Перечисления.ЭтапыПеревозки.ПоследняяМиля);
	//Евросиб Коханенко Н.А. 12.08.2024 (( #87840 
	МассивИзмененныхПолейСредняяМиля 	= ПроверкаРеквизитовНаИзменениеТЧМили(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики,КлючВыборка.Мили,Перечисления.ЭтапыПеревозки.СредняяМиля);
	//Евросиб Коханенко Н.А. 12.08.2024 )) #87840 

	ТЧДетализацияПоГрузуИзменена = Ложь;
	Если СтруктураКлючаАналитикиПеревозки.ИзменятьТЧДетализацияПоГрузу Тогда  
		мДетализацияПоГрузу = КлючВыборка.ДетализацияПоГрузу.Выгрузить();
		мДетализацияПоГрузу.Колонки.Удалить("КлючАналитикиПеревозки");
		ТЧДетализацияПоГрузуИзменена		= Не ТаблицыЗначенийРавны(СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу,мДетализацияПоГрузу)   
						// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 09.01.2024 - если таблицы пустые, то ключ не перезаписываем
						И (не СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу.Количество() = 0 или не мДетализацияПоГрузу.Количество() = 0);
						// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 09.01.2024
	КонецЕсли;
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	ТЧЭтапыСНПИзменена = Ложь;
	Если СтруктураКлючаАналитикиПеревозки.ИзменятьТЧЭтапыСНП Тогда  
		мЭтапыСНП = КлючВыборка.ЭтапыСНП.Выгрузить();
		ТЧЭтапыСНПИзменена		= Не ТаблицыЗначенийРавны(СтруктураКлючаАналитикиПеревозки.ТЧЭтапыСНП,мЭтапыСНП)   
						И (не СтруктураКлючаАналитикиПеревозки.ТЧЭтапыСНП.Количество() = 0 или не мЭтапыСНП.Количество() = 0);
	КонецЕсли;
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	Если МассивИзмененныхПолей.Количество() 
		ИЛИ МассивИзмененныхПолейПерваяМиля.Количество() 
		ИЛИ МассивИзмененныхПолейПоследняяМиля.Количество() 
		//Евросиб Коханенко Н.А. 12.08.2024 (( #87840 
		ИЛИ МассивИзмененныхПолейСредняяМиля.Количество() 
		//Евросиб Коханенко Н.А. 12.08.2024 )) #87840 
		ИЛИ ТЧДетализацияПоГрузуИзменена
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		ИЛИ ТЧЭтапыСНПИзменена Тогда
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		
		// Наименование будет сформировано при записи объекта автоматически
		Для Каждого СтрМассивИзмененныхПолей Из МассивИзмененныхПолей Цикл 
			//Евросиб Коханенко Н.А. 05.07.2024 (( #83866
			Если СтрМассивИзмененныхПолей = "НомерЗаявкиПриемника" Тогда
				КлючОбъект.ДополнительныеСвойства.Вставить("НомерЗаявкиПриемника", СтруктураКлючаАналитикиПеревозки[СтрМассивИзмененныхПолей]);
				Продолжить;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 05.07.2024 )) #83866    
			КлючОбъект[СтрМассивИзмененныхПолей] = СтруктураКлючаАналитикиПеревозки[СтрМассивИзмененныхПолей];
		КонецЦикла;
		Для Каждого СтрМассивИзмененныхПолей Из МассивИзмененныхПолейПерваяМиля Цикл
			СтруктураПоиска = Новый Структура("ЭтапПеревозки",Перечисления.ЭтапыПеревозки.ПерваяМиля);
			МассивСтрок = КлючОбъект.Мили.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() Тогда
				СтрокаТЧ = МассивСтрок[0];
			Иначе
				СтрокаТЧ = КлючОбъект.Мили.Добавить();
				СтрокаТЧ.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля;
			КонецЕсли;
			СтрокаТЧ[СтрМассивИзмененныхПолей] = СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики[СтрМассивИзмененныхПолей];
		КонецЦикла;
		Для Каждого СтрМассивИзмененныхПолей Из МассивИзмененныхПолейПоследняяМиля Цикл 
			СтруктураПоиска = Новый Структура("ЭтапПеревозки",Перечисления.ЭтапыПеревозки.ПоследняяМиля);
			МассивСтрок = КлючОбъект.Мили.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() Тогда
				СтрокаТЧ = МассивСтрок[0];
			Иначе
				СтрокаТЧ = КлючОбъект.Мили.Добавить();
				СтрокаТЧ.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля;
			КонецЕсли;
			СтрокаТЧ[СтрМассивИзмененныхПолей] = СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики[СтрМассивИзмененныхПолей];
		КонецЦикла;
        //Евросиб Коханенко Н.А. 12.08.2024 (( #87840 
		Для Каждого СтрМассивИзмененныхПолей Из МассивИзмененныхПолейСредняяМиля Цикл 
			СтруктураПоиска = Новый Структура("ЭтапПеревозки",Перечисления.ЭтапыПеревозки.СредняяМиля);
			МассивСтрок = КлючОбъект.Мили.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() Тогда
				СтрокаТЧ = МассивСтрок[0];
			Иначе
				СтрокаТЧ = КлючОбъект.Мили.Добавить();
				СтрокаТЧ.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля;
			КонецЕсли;
			СтрокаТЧ[СтрМассивИзмененныхПолей] = СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики[СтрМассивИзмененныхПолей];
		КонецЦикла;
		//Евросиб Коханенко Н.А. 12.08.2024 )) #87840 
		Если ТЧДетализацияПоГрузуИзменена Тогда
			КлючОбъект.ДетализацияПоГрузу.Загрузить(СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу);
		КонецЕсли;
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		Если ТЧЭтапыСНПИзменена Тогда
			КлючОбъект.ЭтапыСНП.Загрузить(СтруктураКлючаАналитикиПеревозки.ТЧЭтапыСНП);
		КонецЕсли;
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
		КлючОбъект.ДополнительныеСвойства.Вставить("ИсточникЗаписи", СтруктураКлючаАналитикиПеревозки.ИсточникЗаписи);
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
		КлючОбъект.Записать();
	КонецЕсли;
	
	Возврат КлючОбъект.Ссылка;	
КонецФункции
#КонецОбласти

#Область Служебное

#Область ПроверкаЗаполненияОбъекта

// Функция - Структура пустая
//
// Параметры:
//  Структура	 - Сруктура	 - 
// 
// Возвращаемое значение:
//  Булево - 
//
Функция СтруктураПустая(Структура)
    Для Каждого Стр Из Структура Цикл
        Если ТипЗнч(Стр) = Тип("Структура") Тогда
            Если НЕ СтруктураПустая(Стр) Тогда
                Возврат Ложь;
            КонецЕсли;
        Иначе
            Если Стр.Значение <> Неопределено Тогда
                Возврат Ложь;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Истина;
КонецФункции

// Функция - Таблицы значений равны
//
// Параметры:
//  ТаблицаЗначений1 - 	 - 
//  ТаблицаЗначений2 - 	 - 
// 
// Возвращаемое значение:
// Булево  - 
//
Функция ТаблицыЗначенийРавны(ТаблицаЗначений1, ТаблицаЗначений2) // ДИТ US 62421 TA 64346 Евсенкин М.А.


    Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
        Возврат Ложь;
    КонецЕсли; 
    
    Если ТаблицаЗначений1.Количество() <> ТаблицаЗначений2.Количество() Тогда
        Возврат Ложь;
    КонецЕсли; 


    Если ТаблицаЗначений1.Колонки.Количество() <> ТаблицаЗначений2.Колонки.Количество() Тогда
        Возврат Ложь;
    КонецЕсли;
    
   // Проверим поля
 
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если ТаблицаЗначений1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений2.Индексы.Добавить(СтрокаИндекса);
    
   // Проверим записи
 
    Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы2 = ТаблицаЗначений2.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы2.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений1.Индексы.Добавить(СтрокаИндекса);
    
    Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы1 = ТаблицаЗначений1.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы1.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
    Возврат Истина;
    
КонецФункции

// Функция - Проверка реквизитов на изменение
//
Функция ПроверкаРеквизитовНаИзменение(СтруктураШапкиКлючаАналитики,ВыборкаДетальныеЗаписи)  // ДИТ US 62421 TA 64346 Евсенкин М.А.
	
	МассивИзмененныхПолей = Новый Массив;
	
	Для Каждого Стр Из СтруктураШапкиКлючаАналитики Цикл	
		Если Стр.Ключ = "ИзменятьТЧДетализацияПоГрузу"  
			//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
			ИЛИ Стр.Ключ = "ИсточникЗаписи"
			//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
			Или ТипЗнч(Стр.Значение) = Тип("Структура") 
			Или ТипЗнч(Стр.Значение) = Тип("ТаблицаЗначений")
			//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
			ИЛИ Стр.Ключ = "ИзменятьТЧЭтапыСНП" Тогда 
			//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
			Продолжить;
		КонецЕсли;	
		Если Не Стр.Значение = Неопределено И НЕ ВыборкаДетальныеЗаписи[Стр.Ключ] = Стр.Значение Тогда 
			МассивИзмененныхПолей.Добавить(Стр.Ключ);		
		КонецЕсли;	
	КонецЦикла;                                      
	
	Возврат МассивИзмененныхПолей; 
	
КонецФункции	

Функция ПроверкаРеквизитовНаИзменениеТЧМили(СтруктураТЧМилиКлючаАналитики,РезультатМили,ЭтапПеревозки)
	
	МассивИзмененныхПолей = Новый Массив;
		
	Если Не СтруктураПустая(СтруктураТЧМилиКлючаАналитики) Тогда 
		ТЗМилиДоИзменения = РезультатМили.Выгрузить();
		СтруктураПоиска = Новый Структура("ЭтапПеревозки",ЭтапПеревозки);
		МассивСтрок = ТЗМилиДоИзменения.НайтиСтроки(СтруктураПоиска);	
		Для Каждого Стр Из СтруктураТЧМилиКлючаАналитики Цикл
			Если МассивСтрок.Количество() Тогда
				Если Стр.Значение <> Неопределено И МассивСтрок[0][Стр.Ключ] <> Стр.Значение Тогда 
					МассивИзмененныхПолей.Добавить(Стр.Ключ);		
				КонецЕсли;
			Иначе
				МассивИзмененныхПолей.Добавить(Стр.Ключ);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат МассивИзмененныхПолей; 
	
КонецФункции

#КонецОбласти

Функция ПолучитьЗначенияКлюча(КлючСсылка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиПеревозки.Ссылка КАК КлючАналитики,
	               |	КлючиАналитикиПеревозки.ВерсияДанных КАК ВерсияДанных,
	               |	КлючиАналитикиПеревозки.Заявка КАК Заявка,
	               |	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
	               |	КлючиАналитикиПеревозки.ДатаНачалаПеревозки КАК ДатаНачалаПеревозки,
	               |	КлючиАналитикиПеревозки.ДатаОкончанияПеревозки КАК ДатаОкончанияПеревозки,
	               |	КлючиАналитикиПеревозки.Груз КАК Груз,
				   // ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
				   |	КлючиАналитикиПеревозки.КоличествоМест КАК КоличествоМест,
				   |	КлючиАналитикиПеревозки.ВесГруза КАК ВесГруза,
				   // ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	               |	КлючиАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцияПоСдаче,
				   //Евросиб Коханенко Н.А. 13.05.2024 (( #83866
	               |	КлючиАналитикиПеревозки.ЗаявкаИсточник КАК ЗаявкаИсточник,
	               |	КлючиАналитикиПеревозки.ЗаявкаПриемник КАК ЗаявкаПриемник,  
	               |	КлючиАналитикиПеревозки.РелизКлиента КАК РелизКлиента, 
				   //Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
				   |	КлючиАналитикиПеревозки.ДатаДобавленияВРелиз КАК ДатаДобавленияВРелиз, 
				   |	КлючиАналитикиПеревозки.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
				   //Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025
	               |	NULL КАК НомерЗаявкиПриемника,  
	               //Евросиб Коханенко Н.А. 13.05.2024 )) #83866
				   //Евросиб Коханенко Н.А. 10.09.2024 (( #90312
	               |	КлючиАналитикиПеревозки.РейсРефСцепа КАК РейсРефСцепа,
	               //Евросиб Коханенко Н.А. 10.09.2024 )) #90312
				   //Евросиб(ДИТ), Беляев СЮ, User Story 92704, 14-04-2025, начало
				   |	КлючиАналитикиПеревозки.Груз_ЕТСНГ КАК Груз_ЕТСНГ,
				   |	КлючиАналитикиПеревозки.Груз_ГНГ КАК Груз_ГНГ,
				   |	КлючиАналитикиПеревозки.Груз_ТНВЭД КАК Груз_ТНВЭД,
				   //Евросиб(ДИТ), Беляев СЮ, User Story 92704, 14-04-2025, конец
				   //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217 начало
				   |	КлючиАналитикиПеревозки.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
				   |	КлючиАналитикиПеревозки.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
				   |	КлючиАналитикиПеревозки.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
				   |	КлючиАналитикиПеревозки.ДатаТелексаДатаДТ КАК ДатаТелексаДатаДТ,
				   |	КлючиАналитикиПеревозки.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
				   |	КлючиАналитикиПеревозки.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд,
				   //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217 конец
	               |	КлючиАналитикиПеревозки.Мили.(
	               |		Ссылка КАК КлючАналитикиПеревозки,
	               |		ЭтапПеревозки КАК ЭтапПеревозки,
	               //Евросиб Коханенко Н.А. 23.07.2024 (( #88706
	               |		ЗапросНаАвто КАК ЗапросНаАвто,
	               |		НомерЗаказаНаТС КАК НомерЗаказаНаТС,
	               //Евросиб Коханенко Н.А. 23.07.2024 )) #88706
				   //Евросиб Коханенко Н.А. 18.07.2025 (( #114760 
				   |		ОперацияНаТерминалеПостановкиФакт КАК ОперацияНаТерминалеПостановкиФакт,
				   |		ОперацияНаСкладеКлиентаФакт КАК ОперацияНаСкладеКлиентаФакт,
				   |		ОперацияНаТерминалеСдачиФакт КАК ОперацияНаТерминалеСдачиФакт, 
				   |		ДатаИВремяПрибытияНаПогрузкуВыгрузку КАК ДатаИВремяПрибытияНаПогрузкуВыгрузку, 
				   |		ЭкспедированиеФакт КАК ЭкспедированиеФакт, 
				   |		КомментарийДиспЕвросиб КАК КомментарийДиспЕвросиб,                   
				   |		КомментарийПеревозчика КАК КомментарийПеревозчика, 
				   |		ПротоколПоставщика КАК ПротоколПоставщика, 
				   //Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
				   //|		ЗаказНаТС КАК ЗаказНаТС,
				   |		ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
				   //Евросиб Коханенко Н.А. 18.09.2025 )) #119413
				   //Евросиб Коханенко Н.А. 18.07.2025 )) #114760 
	               //Евросиб Коханенко Н.А. 05.08.2025 (( #115647
				   |		ВесНеттоФакт КАК ВесНеттоФакт,
				   //Евросиб Коханенко Н.А. 05.08.2025 )) #115647
	               //Евросиб Коханенко Н.А. 05.03.2026 (( #128357
				   |		ХолостойПрогон КАК ХолостойПрогон,
				   //Евросиб Коханенко Н.А. 05.03.2026 )) #128357				   
				   |		ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
	               |		ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
				   |		ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
	               |		ФИОВодителя КАК ФИОВодителя,
	               |		ПаспортныеДанные КАК ПаспортныеДанные,
	               |		РегНомерТС КАК РегНомерТС,
	               |		Автоперевозчик КАК Автоперевозчик,
	               |		ИНН КАК ИНН,
	               |		КПП КАК КПП,
	               |		АдресКлиента КАК АдресКлиента
	               |	) КАК Мили,
	               |	КлючиАналитикиПеревозки.ДетализацияПоГрузу.(
	               |		Ссылка КАК КлючАналитикиПеревозки,
	               |		Груз КАК Груз,
	               |		ОпасныйГруз КАК ОпасныйГруз,
	               |		КоличествоМест КАК КоличествоМест,
	               |		ВесГруза КАК ВесГруза,
	               |		РодУпаковки КАК РодУпаковки
	               |	) КАК ДетализацияПоГрузу,
				   //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217 начало
				   |	КлючиАналитикиПеревозки.ЭтапыСНП.(
	               |		Ссылка КАК КлючАналитикиПеревозки,
	               |		ЭтапСНП КАК ЭтапСНП,
	               |		НомерСчета КАК НомерСчета,
	               |		ДатаСчета КАК ДатаСчета
				   |	) КАК ЭтапыСНП
				   //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217 конец
	               |ИЗ
	               |	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |ГДЕ
	               |	КлючиАналитикиПеревозки.Ссылка = &КлючАналитики";
	
	Запрос.УстановитьПараметр("КлючАналитики", 	КлючСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции	

#КонецОбласти

