
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;    
	
	//Евросиб Коханенко Н.А. 05.07.2024 (( #83866
	//НомерЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка,	"Номер");
	Если ДополнительныеСвойства.Свойство("НомерЗаявкиПриемника") Тогда
		НомерЗаявки = ДополнительныеСвойства.НомерЗаявкиПриемника;
	Иначе
		НомерЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка,	"Номер");
	КонецЕсли;	
	НомерЗаявки = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерЗаявки);
	НаименованиеКонтейнера 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контейнер,	"Наименование");
	Наименование  = СтрШаблон("%1 %2",НомерЗаявки,НаименованиеКонтейнера);
	//Евросиб Коханенко Н.А. 05.07.2024 )) #83866 
		
	//Евросиб Коханенко Н.А. 10.10.2024 (( #90312
	//пометим незаполненный ключ аналитики перевозки на удаление
	ЗапросыНаАвтоНеУказаны = Истина;
	Для Каждого СтрМили Из Мили Цикл
		Если ЗначениеЗаполнено(СтрМили.ЗапросНаАвто) Тогда
			ЗапросыНаАвтоНеУказаны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЗапросыНаАвтоНеУказаны
		И НЕ ЗначениеЗаполнено(Заявка)
		И НЕ ЗначениеЗаполнено(РелизКлиента)
		И НЕ ЗначениеЗаполнено(РейсРефСцепа) Тогда
		ПометкаУдаления = Истина;
	ИначеЕсли ПометкаУдаления = Истина Тогда
		ПометкаУдаления = Ложь;
	КонецЕсли;		
	//Евросиб Коханенко Н.А. 10.10.2024 )) #90312
	
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 25.04.2024 
	Если ДополнительныеСвойства.Свойство("ЗаписьИзФормы")  Тогда
		ТЗдляПроверки = Новый Структура("Контейнер, КлючАналитикиПеревозки, Заявка", Контейнер, Ссылка, Заявка);
		КлючиАналитикиПеревозкиСервер.ПроверитьСоответствиеКонтейнераФутовостиВКалькуляции(ТЗдляПроверки, Отказ);
		
		КТКЕстьВДругойЗаявке = КлючиАналитикиПеревозкиСервер.ПроверитьКТКвДругойЗаявке(ТЗдляПроверки);
		Для каждого Ответ Из КТКЕстьВДругойЗаявке Цикл
			Сообщить("!!! КТК № " + Ответ.НомерКТК + " встречается также в заявке " + Ответ.Заявка + ". Проверьте, не ошибка ли это!", СтатусСообщения.Внимание);
		КонецЦикла;
	КонецЕсли;
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 25.04.2024
	
	// ДИТ US 83871 ТА 85268 Сержантова А.С. Начало: 17.05.2024
	//если по ключу в запросе на авто есть авторейс, то обновим данные в авторейсе
	Если не Отказ и ЗначениеЗаполнено(Ссылка) и ЗначениеЗаполнено(Заявка) Тогда  
		ЕстьИзмененияВМиле = Ложь;
		Для каждого СтрМили Из Мили Цикл
			СтрокиДоИзм = Ссылка.Мили.НайтиСтроки(Новый Структура("ЭтапПеревозки", СтрМили.ЭтапПеревозки));
			Если СтрокиДоИзм.Количество() = 1 и
				(СтрМили.Автоперевозчик <> СтрокиДоИзм[0].Автоперевозчик
				или СтрМили.ДатаВыдачиКТКсТерминала <> СтрокиДоИзм[0].ДатаВыдачиКТКсТерминала
				или СтрМили.ДатаСдачиКТКнаТерминал <> СтрокиДоИзм[0].ДатаСдачиКТКнаТерминал) Тогда                         
                ЕстьИзмененияВМиле = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Ссылка.Контейнер <> Контейнер или ЕстьИзмененияВМиле Тогда
			ДополнительныеСвойства.Вставить("ОбновитьРейсАвто", Истина);
		КонецЕсли;
	КонецЕсли;  
	// ДИТ US 83871 ТА 85268 Сержантова А.С. Конец: 17.05.2024
	
	//Евросиб Шевченко А.В. 14.05.2025 US 94035 TA 104217
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ЭтапыПеревозкиДляПроверки = Новый Массив;
		ЭтапыПеревозкиДляПроверки.Добавить(Перечисления.ЭтапыПеревозки.СредняяМиля);
		//Евросиб Коханенко Н.А. 05.03.2026 (( #117279 
		ЭтапыПеревозкиДляПроверки.Добавить(Перечисления.ЭтапыПеревозки.ПоследняяМиля);
		//Евросиб Коханенко Н.А. 05.03.2026 )) #117279 
		
		ПоляДляПроверкиМили = Новый Массив;
		ПоляДляПроверкиМили.Добавить("ДатаВыдачиКТКСТерминала");
		ПоляДляПроверкиМили.Добавить("ДатаСдачиКТКНаТерминал");
		
		ПоляДляПроверкиЭтапыСНП = Новый Массив;
		ПоляДляПроверкиЭтапыСНП.Добавить("ЭтапСНП");
		ПоляДляПроверкиЭтапыСНП.Добавить("НомерСчета");
		ПоляДляПроверкиЭтапыСНП.Добавить("ДатаСчета");
		
		ПоляДляПроверкиШапка = Новый Массив;
		
		МассивСостояний = Новый Массив;	
		Для Каждого СтрокаДоИзменения Из Ссылка.Мили Цикл			
			Для Каждого Этап Из ЭтапыПеревозкиДляПроверки Цикл				
				СтруктураПоиска = Новый Структура("ЭтапПеревозки",Этап);
				НайденныеСтроки = Мили.НайтиСтроки(СтруктураПоиска);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл					
					Для Каждого ПолеП Из ПоляДляПроверкиМили Цикл						
						Если НайденнаяСтрока[ПолеП] <> СтрокаДоИзменения[ПолеП] Тогда
							ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
						КонецЕсли;
					КонецЦикла;					
				КонецЦикла;				
			КонецЦикла;				
		КонецЦикла;
		
		ТЧЭтапыСНПИзменена		= Не ТаблицыЗначенийРавны(ЭтапыСНП.Выгрузить(),Ссылка.ЭтапыСНП.Выгрузить());
		Если ТЧЭтапыСНПИзменена Тогда
			ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
        КонецЕсли;
		
		Для Каждого ПолеП Из ПоляДляПроверкиШапка Цикл
			Если ЭтотОбъект[ПолеП] <> Ссылка[ПолеП] Тогда
				ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
			КонецЕсли;	
		КонецЦикла;	
		
	Иначе
		
		ЭтапыПеревозкиДляПроверки = Новый Массив;
		ЭтапыПеревозкиДляПроверки.Добавить(Перечисления.ЭтапыПеревозки.СредняяМиля);
		
		
		ПоляДляПроверкиМили = Новый Массив;
		ПоляДляПроверкиМили.Добавить("ДатаВыдачиКТКСТерминала");
		ПоляДляПроверкиМили.Добавить("ДатаСдачиКТКНаТерминал");
		
		ПоляДляПроверкиЭтапыСНП = Новый Массив;
		ПоляДляПроверкиЭтапыСНП.Добавить("ЭтапСНП");
		ПоляДляПроверкиЭтапыСНП.Добавить("НомерСчета");
		ПоляДляПроверкиЭтапыСНП.Добавить("ДатаСчета");
		
		ПоляДляПроверкиШапка = Новый Массив;
		
		Для Каждого СтрокаДоИзменения Из Мили Цикл			
			Для Каждого Этап Из ЭтапыПеревозкиДляПроверки Цикл				
				СтруктураПоиска = Новый Структура("ЭтапПеревозки",Этап);
				НайденныеСтроки = Мили.НайтиСтроки(СтруктураПоиска);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Для Каждого ПолеП Из ПоляДляПроверкиМили Цикл
						Если ЗначениеЗаполнено(НайденнаяСтрока[ПолеП]) Тогда
							ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;				
			КонецЦикла;		
		КонецЦикла;
		
		ТЧЭтапыСНПИзменена		= Не ТаблицыЗначенийРавны(ЭтапыСНП.Выгрузить(),Ссылка.ЭтапыСНП.Выгрузить());
		Если ТЧЭтапыСНПИзменена Тогда
			ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
        КонецЕсли;
		
		Для Каждого ПолеП Из ПоляДляПроверкиШапка Цикл
			Если ЗначениеЗаполнено(ЭтотОбъект[ПолеП]) Тогда
				ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбменуDX", Истина);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	//Евросиб Шевченко А.В. 14.05.2025 US 94035 TA 104217
	
КонецПроцедуры

Функция ТаблицыЗначенийРавны(ТаблицаЗначений1, ТаблицаЗначений2) //Евросиб Шевченко А.В. 14.05.2025 US 94035 TA 104217

    Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
        Возврат Ложь;
    КонецЕсли; 
    
    Если ТаблицаЗначений1.Количество() <> ТаблицаЗначений2.Количество() Тогда
        Возврат Ложь;
    КонецЕсли; 


    Если ТаблицаЗначений1.Колонки.Количество() <> ТаблицаЗначений2.Колонки.Количество() Тогда
        Возврат Ложь;
    КонецЕсли;
    
   // Проверим поля
 
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если ТаблицаЗначений1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений2.Индексы.Добавить(СтрокаИндекса);
    
   // Проверим записи
 
    Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы2 = ТаблицаЗначений2.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы2.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений1.Индексы.Добавить(СтрокаИндекса);
    
    Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы1 = ТаблицаЗначений1.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы1.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
    Возврат Истина;
    
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если Груз <> Справочники.Грузы.СборнаяКонтейнернаяОтправка Тогда
		ДетализацияПоГрузу.Очистить();
	КонецЕсли;	   
	
	// ДИТ US 83871 ТА 85268 Сержантова А.С. Начало: 17.05.2024
	Если ДополнительныеСвойства.Свойство("ОбновитьРейсАвто") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто,
		|	ЗапросНаАвтоперевозку.Заявка КАК Заявка,
		|	ЗапросНаАвтоперевозку.ЭтапПеревозки КАК ЭтапПеревозки
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ЗапросНаАвтоперевозку.Ссылка
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = &КлючАналитикиПеревозки
		|	И ЗапросНаАвтоперевозкуКонтейнеры.РейсАвто <> ЗНАЧЕНИЕ(Справочник.РейсыАвто.ПустаяСсылка)
		|	И ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС <> ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаНаТс.ПустаяСсылка)";
		Запрос.УстановитьПараметр("КлючАналитикиПеревозки", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл   
				КонтейнерыЗапросаНаАвто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ЗапросНаАвто, "Контейнеры");  
				ВыборкаСтрокЗапроса = КонтейнерыЗапросаНаАвто.Выбрать();
				Пока ВыборкаСтрокЗапроса.Следующий() Цикл
					Если ВыборкаСтрокЗапроса.КлючАналитикиПеревозки = Ссылка Тогда
						Справочники.РейсыАвто.ОбновитьДанныеВАвтоРейсеСтрокиЗапросаНаАвто(ВыборкаСтрокЗапроса, Выборка.Заявка, Выборка.ЭтапПеревозки);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	// ДИТ US 83871 ТА 85268 Сержантова А.С. Конец: 17.05.2024
	
	//Евросиб Шевченко А.В. 14.05.2025 US 94035 TA 104217
	Если ДополнительныеСвойства.Свойство("ЗарегистрироватьКОбменуDX") Тогда  
		//Евросиб Коханенко Н.А. 26.12.2025 (( #124559
		//проверим наличие идентификатора DX в ПротоколеОбмена
		//ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИД_Присутствует
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект = &Объект
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX)
		|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
		|	И ПротоколОбменов.УИДИсточника <> """"";
	
		Запрос.УстановитьПараметр("Объект", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 26.12.2025 )) #124559 
	КонецЕсли;
	//Евросиб Шевченко А.В. 14.05.2025 US 94035 TA 104217   
	
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
	Если не Отказ Тогда
	    ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
КонецПроцедуры
