
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.Операция;
		ТипОграничения = Перечисления.ТипыОграничений.Процессные;
		ПериодРасчетаОграничений = Перечисления.ПериодыРасчетаОграничений.День;
		РаспределениеВесаОперацииПоДням = Перечисления.РаспределениеВесаОперацииПоДням.РаспределятьНаПервыйДень;
		ДляГруженыхТСТЕ = Истина;
		ДляПорожнихТСТЕ = Истина;
		УведомлятьОПревышенииОграниченияВЗаданномГоризонтеДН = 7;
		
		Автор = Пользователи.ТекущийПользователь();
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Редактор = Пользователи.ТекущийПользователь();
		ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Валюта = Договор.ВалютаВзаиморасчетов;
		Регламентный = Истина;
	КонецЕсли;
	
	ОповещатьПоОграничению = ОповещенияПользователям.Количество() > 0;
	
КонецПроцедуры
