
&НаСервереБезКонтекста
Процедура ЗагрузитьИзЭТРАННаСервере()
	э_ОбщиеСервер.ЗагрузитьВсеЗаписи("э_ТипыСборовДляНакладной");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭТРАН(Команда)
	ЗагрузитьИзЭТРАННаСервере();
КонецПроцедуры
//&НаКлиенте
//Процедура ЗагрузитьИзЭТРАН(Команда)
//	ВМТП_ЭТРАН_ОбщиеНаСервере.ЗагрузитьВсеЗаписиНаКлиенте("э_ТипыСборовДляНакладной");
//	ЭтаФорма.Элементы.Список.Обновить();
//КонецПроцедуры 

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

