
//Евросиб Коханенко Н.А. 08.12.2022 (( #61705
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Коханенко Н.А. 17.12.2024 (( #97643 
	Если Параметры.Отбор.Свойство("РазрешитьВРП")
			И Параметры.Отбор.РазрешитьВРП = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ИмяПредопределенныхДанных", "Внутрироссийская", ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 17.12.2024 )) #97643 

	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма); 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 08.12.2022 )) #61705

//Евросиб Коханенко Н.А. 08.12.2022 (( #61705
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры //Евросиб Коханенко Н.А. 08.12.2022 )) #61705 

