
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.СписокВходящие);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.СписокВходящие, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокВходящие);
КонецПроцедуры

&НаКлиенте
Процедура НомерВагонаОтборПриИзменении(Элемент)
	СписокСсылок = ПолучитьСписокоДокументовПоВагону();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВходящие.Отбор, "Ссылка", СписокСсылок, ВидСравненияКомпоновкиДанных.ВСписке,, ЗначениеЗаполнено(НомерВагонаОтбор));
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокоДокументовПоВагону()
	Если ЗначениеЗаполнено(НомерВагонаОтбор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	э_НакладнаяВагоны.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|ГДЕ
		|	(э_НакладнаяВагоны.Вагон = &Вагон
		|			ИЛИ э_НакладнаяВагоны.НомерВагона = &НомерВагона)
		|
		|СГРУППИРОВАТЬ ПО
		|	э_НакладнаяВагоны.Ссылка";
		
		Запрос.УстановитьПараметр("Вагон", НомерВагонаОтбор);
		Запрос.УстановитьПараметр("НомерВагона", НомерВагонаОтбор.Код);
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Документы.э_Накладная.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НомерПоездаОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВходящие.Отбор, "НомерПоезда", НомерПоездаОтбор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(НомерПоездаОтбор));
КонецПроцедуры

&НаКлиенте
Процедура НомерРейсаОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВходящие.Отбор, "НомерРейса", НомерРейсаОтбор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(НомерРейсаОтбор));
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоездаОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВходящие.Отбор, "ДатаПоезда", ДатаПоездаОтбор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ДатаПоездаОтбор));
КонецПроцедуры


//Загружаем по номеру накладной

&НаКлиенте
Процедура ЗагрузитьИзЭТРАНПоНомеру(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераНакладной", ЭтотОбъект);	
    ПоказатьВводЗначения(Оповещение,, "Введите номер накладной", "Строка");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераНакладной(НомерНакладной, Параметры) Экспорт	
	Если Не НомерНакладной = Неопределено Тогда
		//Если НетЗапущеныхРанееЗаданий("ЗагрузитьИзЭТРАНПоНомеруНаСервере") Тогда
		//	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
		//	Сообщить("Начало загрузки накладной по номеру " + НомерНакладной);
			ВозвращаемаяСтруктура = ЗагрузитьИзЭТРАНПоНомеруНаСервере(НомерНакладной, РезультатДлительнойОперации);
			Сообщить(ВозвращаемаяСтруктура.Сообщение);
			//Подключаемый_ПроверитьВыполнениеЗадания();
		//Иначе
		//	Сообщить("Дождитесь завершения предыдущего вызова");
		//КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзЭТРАНПоНомеруНаСервере(НомерНакладной, РезультатДлительнойОперации)
	Возврат э_ОбщиеСервер.ЗагрузитьНакладруюИзЭТРАНПоНомеру(НомерНакладной);
	//ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	//ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	//ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ЗагрузкаНакладнойИзЭТРАНПоНомеру";
	//ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка накладной из ЭТРАН по номеру.'");
	//РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.ЗагрузитьНакладруюИзЭТРАНПоНомеру", НомерНакладной, ПараметрыВыполненияВФоне);
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДополнительныеПараметры = "") Экспорт
	Попытка
		Если РезультатДлительнойОперации.Статус = "Выполнено" Или ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда 
			РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
			Если Не РезультатВыполнения = Неопределено Тогда 
				Если РезультатВыполнения.Свойство("МассивРезультатов") Тогда
					Если РезультатВыполнения.МассивРезультатов.Количество() = 0 Тогда 
						Сообщить("По вагону " + Строка(РезультатВыполнения.НомерВагона) + " не найдено накладных");
						Возврат;
					КонецЕсли;
					Для Каждого РезультатИзМассива из РезультатВыполнения.МассивРезультатов Цикл 
						СообщениеПользователю = Новый СообщениеПользователю;
						СообщениеПользователю.КлючДанных = РезультатИзМассива.Ссылка;
						СообщениеПользователю.Текст = РезультатИзМассива.Сообщение;
						СообщениеПользователю.Сообщить();
						Если ЗначениеЗаполнено(РезультатИзМассива.Ссылка) Тогда 
							ПоказатьОповещениеПользователя(РезультатВыполнения.Сообщение, ПолучитьНавигационнуюСсылку(РезультатИзМассива.Ссылка));
						КонецЕсли;
					КонецЦикла;
				Иначе
					СообщениеПользователю = Новый СообщениеПользователю;
					СообщениеПользователю.КлючДанных = РезультатВыполнения.Ссылка;
					СообщениеПользователю.Текст = РезультатВыполнения.Сообщение;
					СообщениеПользователю.Сообщить();
					Если ЗначениеЗаполнено(РезультатВыполнения.Ссылка) Тогда 
						ПоказатьОповещениеПользователя(РезультатВыполнения.Сообщение, ПолучитьНавигационнуюСсылку(РезультатВыполнения.Ссылка));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.Интервал = 3;
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатДлительнойОперации, Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект),ПараметрыОжидания);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
КонецФункции

//Загружаем по вагону
&НаКлиенте
Процедура ЗагрузитьИзЭтранПоВагону(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераВагона", ЭтотОбъект);	
    ПоказатьВводЗначения(Оповещение,, "Введите номер Вагона", "Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераВагона(НомерВагона, Параметры) Экспорт	
	Если Не НомерВагона = Неопределено Тогда
		Если НетЗапущеныхРанееЗаданий("ЗагрузитьИзЭТРАНПоНомеруВагонаНаСервере") Тогда
			ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
			Сообщить("Начало загрузки накладных по номеру вагона " + НомерВагона);
			ЗагрузитьИзЭТРАНПоНомеруВагонаНаСервере(НомерВагона, РезультатДлительнойОперации); 
			Подключаемый_ПроверитьВыполнениеЗадания();	
		Иначе 
			Сообщить("Дождитесь завершения предыдущего вызова");
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзЭТРАНПоНомеруВагонаНаСервере(НомерВагона, РезультатДлительнойОперации)
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ЗагрузкаНакладнойИзЭТРАНПоНомеруВагона";
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка накладной из ЭТРАН по номеру вагона.'");
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.ЗагрузитьНакладнуюПоНомеруВагона", НомерВагона, ПараметрыВыполненияВФоне);
КонецПроцедуры

&НаСервере
Функция НетЗапущеныхРанееЗаданий(КлючПоискаФоновогоЗадания)
	
	Если КлючПоискаФоновогоЗадания = "ЗагрузитьИзЭТРАНПоНомеруНаСервере" Тогда 
		КлючФоновогоЗадания = "ЗагрузкаНакладнойИзЭТРАНПоНомеру";
		Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно)).Количество() > 0 Тогда 
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Если КлючПоискаФоновогоЗадания = "ЗагрузитьИзЭТРАНПоНомеруВагонаНаСервере" Тогда
		КлючФоновогоЗадания = "ЗагрузкаНакладнойИзЭТРАНПоНомеруВагона";
		Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно)).Количество() > 0 Тогда 
			Возврат Ложь;
		КонецЕсли; 	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции


#КонецОбласти


#Область ЭЦП

&НаКлиенте
Процедура ПолучитьДокументыТребующиеЭЦП(Команда)
	
	ПолучитьДокументыТребующиеЭЦПНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ПолучитьДокументыТребующиеЭЦПНаСервере()
	
	Рез = э_ОбщиеСервер.ПолучитьОтветНаЗапрос("<ECPWaitDocStatus><fromDate>"+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")+"</fromDate> </ECPWaitDocStatus>");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Рез);		
	
	СписокНакладныхЭЦП.Очистить();
	СтрокаНов = "";
	ИмяРеквизита = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Имя = ЧтениеXML.Имя;  				
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если  Имя = "#text" и не ИмяРеквизита = "" Тогда
				СтрокаНов[ИмяРеквизита] = ЧтениеXML.Значение;
			КонецЕсли;     			
			
			Если Имя = "DOC_ID" Тогда
				СтрокаНов = СписокНакладныхЭЦП.Добавить();
				ИмяРеквизита = "ИДДокумента";
			ИначеЕсли Имя = "DocDescription" Тогда
				ИмяРеквизита = "Наименование";
			ИначеЕсли Имя = "ECPDocTypeName" Тогда
				ИмяРеквизита = "ОписаниеДокумента";
			ИначеЕсли Имя = "ECPDate" Тогда
				ИмяРеквизита = "ДатаЭЦП";
			ИначеЕсли Имя = "WaitECPDate" Тогда
				ИмяРеквизита = "ДатаЭЦПОжидания";				
			Иначе 
				ИмяРеквизита = "";
			КонецЕсли;
			
		КонецЕсли;  		
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст и не ИмяРеквизита = "" Тогда
			СтрокаНов[ИмяРеквизита] = ЧтениеXML.Значение;
		КонецЕсли;
		
	КонецЦикла; 	
	
	
КонецПроцедуры
&НаКлиенте 
Процедура Подписать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьНакладную",ЭтотОбъект);
	ПоказатьВопрос(Оповещение,"Выбранный документ будет подписан в ЭТРАН!",РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры  
&НаКлиенте
Процедура ПодписатьНакладную(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;	
	
	ТекСтрока = Элементы.СписокНакладныхЭЦП.ТекущиеДанные;
	ИмяВременногоФайлаТекстДанных = Неопределено;
	ИДНакладной = ТекСтрока.ИДДокумента;
	
	Если  ТекСтрока = Неопределено	Тогда
		Сообщить("Не выбран документ!");
		Возврат; 
	Иначе 	
		ИмяВременногоФайлаТекстДанных = ПолучитьДанныеНакладной(ИДНакладной);
	КонецЕсли;
	
	Если ИмяВременногоФайлаТекстДанных = Неопределено Тогда
		Сообщить("Не удалось получить данные документа из ЭТРАН!");
		Возврат;
	КонецЕсли;
	
	//получение временного файла ЭЦП
	ИмяВременногоФайлаЭЦП = ПолучитьИмяВременногоФайла("b64");
	ФайлЗапросаЭЦП = Новый ТекстовыйДокумент;
	ФайлЗапросаЭЦП.УстановитьТекст("");
	ФайлЗапросаЭЦП.Записать(ИмяВременногоФайлаЭЦП);
	//получение временного файла Хеш	
	ИмяВременногоФайлаХеш = ПолучитьИмяВременногоФайла();
	ТДХеш = Новый ТекстовыйДокумент;
	ТДХеш.УстановитьТекст("");
	ТДХеш.Записать(ИмяВременногоФайлаХеш,"windows-1251");
	//получение временного файла Запроса Штампа
	ИмяВременногоФайлаЗапросаШтампа = ПолучитьИмяВременногоФайла("tsq");
	ФайлЗапросаШтамп = Новый ТекстовыйДокумент;
	ФайлЗапросаШтамп.УстановитьТекст("");
	ФайлЗапросаШтамп.Записать(ИмяВременногоФайлаЗапросаШтампа);
	//получение временного файла Штампа	
	ИмяВременногоФайлаШтампа = ПолучитьИмяВременногоФайла("tsr");
	ФайлШтамп = Новый ТекстовыйДокумент;
	ФайлШтамп.УстановитьТекст("");
	ФайлШтамп.Записать(ИмяВременногоФайлаШтампа);  	
	
	//получение ЭЦП
	//Перед подпислью, преобразовываем в текст
	ТекстДляПодписи = Новый ТекстовыйДокумент;
	ТекстДляПодписи.Прочитать(ИмяВременногоФайлаТекстДанных);
	ИнформацияОДокументе = ТекстДляПодписи.ПолучитьТекст();
	
	ЗаписьДанных = Base64Значение(ИнформацияОДокументе);
	ЗаписьДанных.Записать(ИмяВременногоФайлаТекстДанных);

	
	Сртификат = ПолучитьСертификат(); 	
	ДвоичныеДанные = ПодписатьНаКлиенте(Сртификат, ИмяВременногоФайлаТекстДанных);
	ДвоичныеДанные.Записать(ИмяВременногоФайлаЭЦП);
	//Base64
	Base64 = Base64Строка(ДвоичныеДанные); 	
	ФайлЗапросаЭЦП.УстановитьТекст(Base64);
	ФайлЗапросаЭЦП.Записать(ИмяВременногоФайлаЭЦП);
	Base64 = СтрЗаменить(Base64,Символ(182),Символ(13)+Символ(10));	
	
	//получение Хеш
	oHash    = Новый COMОбъект("CAPICOM.HashedData");
	oHash.Algorithm  = "CAPICOM_HASH_ALGORITHM_SHA1";
	oHash.Hash(Base64);		
	ХешДД = ПолучитьДвоичныеДанныеИзHexСтроки(oHash.Value);	
	ХешДД.Записать(ИмяВременногоФайлаХеш);
	
	TSAAddress = ПолучитьАдресаШтампаВремени();
	
	//Получение запроса на штамп
	СтрокаЗапуска = "C:\Program Files (x86)\Crypto Pro\SDK\bin\tsputil.exe mr --f=base64 --alg=1.3.14.3.2.26 --cert-req --input-type=hash  " +  ИмяВременногоФайлаХеш + " " + ИмяВременногоФайлаЗапросаШтампа;
	КОдВозврата = "";
	ЗапуститьПриложение(СтрокаЗапуска,"C:\Program Files (x86)\Crypto Pro\SDK\bin\",Истина,КОдВозврата);
	Если не КОдВозврата = 0 Тогда
		Сообщить("Ошибка создания запроса штампа времени!");
		Сообщить("Код ошибки: " + КОдВозврата);
		Возврат;    
	КонецЕсли;  	
	//Получение штампа
	СтрокаЗапуска = "C:\Program Files (x86)\Crypto Pro\SDK\bin\tsputil.exe sr --format=base64 --url=" +TSAAddress+" " + ИмяВременногоФайлаЗапросаШтампа+" " + ИмяВременногоФайлаШтампа;
	КОдВозврата = ""; 
	ЗапуститьПриложение(СтрокаЗапуска,"C:\Program Files (x86)\Crypto Pro\SDK\bin\",Истина,КОдВозврата);
	Если не КОдВозврата = 0 Тогда
		Сообщить("Ошибка получения штампа времени!");
		Сообщить("Код ошибки: " + КОдВозврата);
		Возврат;
	КонецЕсли;  	
	ФайлШтамп.Прочитать(ИмяВременногоФайлаШтампа);
	//ТекстШтампа
	ТекстШтампа = ФайлШтамп.ПолучитьТекст();
	  	
	//ФайлЗапросаЭЦП.Прочитать(ИмяВременногоФайлаЭЦП);
	//Base64 = ФайлЗапросаЭЦП.ПолучитьТекст();
	
	
	Попытка 		                                                                                                                              //БинарныйТекст
		//Результат = ЗапросПроведенияЭЦПНадДокументомНаСервере(СтрЗаменить(ИДНакладной, Символы.НПП, ""), СтрЗаменить(ИнформацияОДокументе,"""","&quot;"),Base64,ТекстШтампа, Ложь);
		//Результат = ЗапросПроведенияЭЦПНадДокументомНаСервере(СтрЗаменить(ИДНакладной, Символы.НПП, ""),  СтрЗаменить(ИнформацияОДокументе,"  ",Символ(13)+Символ(10)),Base64,ТекстШтампа, Истина);
		Результат = ЗапросПроведенияЭЦПНадДокументомНаСервере(СтрЗаменить(ИДНакладной, Символы.НПП, ""),  ИнформацияОДокументе,Base64,ТекстШтампа, Истина);
	
	Исключение
		Ошибка = ОписаниеОшибки();
		Инфо = ИнформацияОбОшибке();
		Результат = ПодробноеПредставлениеОшибки(Инфо);
		Сообщить("Ошибка запроса на создание ЭЦП в ЭТРАН!"); 
	КонецПопытки;

	
	Если СтрНайти(Результат,"error")>0 Тогда
		Сообщить(Результат);
	Иначе
		Сообщить("Документ подписан, ИД: " + ИДНакладной);
	КонецЕсли;  	

	ПолучитьДокументыТребующиеЭЦПНаСервере(); 
	
	
КонецПроцедуры
&НаКлиенте
Функция ПолучитьДанныеНакладной(ИДНакладной)      	
	
	ИмяВременногоФайлаТекстДанных = Неопределено;
	
	РезультатПолучитьТекстИзЭТРАН = ПолучитьТекстИзЭТРАН(ИдНакладной,Истина,Ложь); 
	Если не РезультатПолучитьТекстИзЭТРАН.ИмяВременногоФайлаТекстДанных = Неопределено Тогда
		ИмяВременногоФайлаТекстДанных = РезультатПолучитьТекстИзЭТРАН.ИмяВременногоФайлаТекстДанных; 
		//ТекДокИнформацияОДокументе = Новый ТекстовыйДокумент;
		//ТекДокИнформацияОДокументе.Прочитать(ИмяВременногоФайлаТекстДанных);
		//ИнформацияОДокументе = ТекДокИнформацияОДокументе.ПолучитьТекст();
		//ИнформацияОДокументе =  СтрЗаменить(ИнформацияОДокументе,"&quot;","""");			
	Иначе
		Сообщить(РезультатПолучитьТекстИзЭТРАН.Ошибка);
	КонецЕсли;  
	
	Возврат ИмяВременногоФайлаТекстДанных;
	
КонецФункции
&НаКлиенте 
Функция ПодписатьНаКлиенте(Сертификат_, АдресФайлаНаКлиенте)
	
	МК = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider", "", 75);
	МК.ПарольДоступаКЗакрытомуКлючу = ПолучитьПарольСертификата(); 	
	ЗначениеПодписи = МК.Подписать(АдресФайлаНаКлиенте,Сертификат_);
	
	Возврат ЗначениеПодписи;
	
КонецФункции
&НаКлиенте
Функция ПолучитьТекстИзЭТРАН(НакладнаяИД,БинарныйТекст,Тест = Ложь)
	
	Ошибка = "";
	
	ИмяВременногоФайлаТекстДанных = ПолучитьИмяВременногоФайла();
	ТекДок = Новый ТекстовыйДокумент;  
	ТекДок.УстановитьТекст("");
	ТекДок.Записать(ИмяВременногоФайлаТекстДанных,"windows-1251");
	
	РезультатЗапросаДанных = ПолучитьИмяВременногоФайлаИнформацияОДокументе(НакладнаяИД,Истина); 	
	
	ИнформацияОДокументе = 	"";
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапросаДанных);
	Пока ЧтениеXML.Прочитать() Цикл  		
		Если ЧтениеXML.Имя = "error" Тогда
			ИнформацияОДокументе = ЧтениеXML.ПолучитьАтрибут("value");
			Ошибка = РезультатЗапросаДанных;
			ИмяВременногоФайлаТекстДанных = Неопределено; 
			прервать;
		КонецЕсли;
		Если  ЧтениеXML.Имя = "textBinary" Тогда
			ИнформацияОДокументе = ЧтениеXML.ПолучитьАтрибут("value"); 				
			прервать;
		КонецЕсли;
	КонецЦикла;  
	
	
	//Для подписания информации текстом
	ИнформацияОДокументе = СтрЗаменить(ИнформацияОДокументе,"  ",""); 
	ИнформацияОДокументе = Base64Строка(Base64Значение(ИнформацияОДокументе));

	ТекДок.УстановитьТекст(ИнформацияОДокументе);
	ТекДок.Записать(ИмяВременногоФайлаТекстДанных,"windows-1251"); 	
		
	
	//ЗаписьДанных = Base64Значение(ИнформацияОДокументе);
	//ЗаписьДанных.Записать(ИмяВременногоФайлаТекстДанных);
	
	//Если ИнформацияОДокументе = "" Тогда
	//Иначе
	//	ИнформацияОДокументе = СтрЗаменить(ИнформацияОДокументе,"  ",Символ(13)+Символ(10));  
	//	ТекДок.УстановитьТекст(ИнформацияОДокументе);
	//	ТекДок.Записать(ИмяВременногоФайлаТекстДанных,"windows-1251"); 
	//КонецЕсли;
			 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяВременногоФайлаТекстДанных",ИмяВременногоФайлаТекстДанных);
	Результат.Вставить("Ошибка",Ошибка); 
	
	Возврат Результат;   	
	
	
КонецФункции
&НаКлиенте
Функция ПолучитьСертификат()
	
	МК = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider", "", 75);
	МК.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.НеВключать;
	Хранилище = МК.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	СертификатыХранилища = Хранилище.ПолучитьВсе(); 
	
	Возврат СертификатыХранилища.Получить(ПолучитьИндексСертификата()); 
	
КонецФункции
&НаСервере
Функция ПолучитьИндексСертификата()  
	
	Возврат э_ОбщиеСервер.ПолучитьНастройкиЭТРАН().СертификатДляЭЦП; 
	
КонецФункции
&НаСервере
Функция ПолучитьПарольСертификата()  
	
	Возврат э_ОбщиеСервер.ПолучитьНастройкиЭТРАН().ПарольКонтейнераСертификата; 
	
КонецФункции
&НаСервере
Функция ПолучитьАдресаШтампаВремени()  
	
	Возврат э_ОбщиеСервер.ПолучитьНастройкиЭТРАН().АдресСлужбыШтампаВремени; 
	
КонецФункции
&НаСервере
Функция ПолучитьИмяВременногоФайлаИнформацияОДокументе(НакладнаяИД,БинарныйТекст)
	
	Возврат э_ОбщиеСервер.ПолучитИнформациюОДокументеЭЦП(НакладнаяИД,БинарныйТекст);
	
КонецФункции
&НаСервере
Функция ЗапросПроведенияЭЦПНадДокументомНаСервере(ИдДокумента,ИнформацияОДокументе,ЭЦПДокумента,ШтампВремени, БинарныйТекст)   	
	
	Возврат э_ОбщиеСервер.ЗапросПроведенияЭЦПНадДокументом(ИдДокумента,ИнформацияОДокументе,ЭЦПДокумента,ШтампВремени, БинарныйТекст);
	
КонецФункции

&НаКлиенте
Процедура ПерепровестиВсе(Команда)
	ПерепровестиВсеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиВсеНаСервере()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_Накладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.э_Накладная КАК э_Накладная
	               |ГДЕ
	               |	НЕ э_Накладная.ПометкаУдаления";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ОтветСсылка = Ответ.Ссылка.ПолучитьОбъект();
		ОтветСсылка.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


