
//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма); 
	//Евросиб - АСуслов 04.07.2023 16:25:15 #локации 67501
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 16:25:24 #локации 67501
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
