
&НаКлиенте
Процедура СправочникСтраныМира(Команда)
	
	ОткрытьФорму("Справочник.СтраныМира.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокСтанцийИзEXCEL(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиСтанций");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокАналоговИзEXCEL(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиАналоговСтанций");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКЛАДР(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ИмпортДанныхФИАС");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьGPSКоординатыПоСтанциям(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиGPSКоординатСтанций");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИдентификаторыMAERSK(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиИдентификаторовМаэрска");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИдентификаторыMAERSKДляГородовСтраны(Команда)
	
	ТекC = Элементы.Список.ТекущаяСтрока;
	Если ТекC <> неопределено Тогда
		Альфа2 = ЭтоСтранаСАльфаДваКодом(ТекC);
		Если Альфа2 <> "" Тогда
			ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиИдентификаторовМаэрска", Новый Структура("КодСтраныЗагружаемыхГородов, ЛокацияРегиона", Альфа2, ТекC));
		Иначе
			ПоказатьПредупреждение(, "Необходимо выбрать страну с заполненным альфа-2 кодом.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСтранаСАльфаДваКодом(Локация)
	
	Возврат Локация.Страна.КодАльфа2;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьРасстоянияМеждуСтанциями(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиДанныхБлижайшихСтанций");
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСвязьСтанцийСДорогами(Команда)
	СтрокИзменено = ВосстановитьСвязьСтанцийСДорогамиНаСервере();
	Сообщить("Обновлено " + СтрокИзменено + " станций.");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВосстановитьСвязьСтанцийСДорогамиНаСервере()
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка,
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана.Дорога.КодДороги КАК СпрЭтранаКодДороги
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	               |		ПО Локации.Ссылка = Связь_ЭТРАН_DC_Сопоставление.СпрДатакор
	               |ГДЕ
	               |	НЕ Локации.ПометкаУдаления
	               |	И Локации.ЖелезнаяДорога = ЗНАЧЕНИЕ(Справочник.ЖелезныеДороги.ПустаяСсылка)";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ЭОбъект = Ответ.Ссылка.ПолучитьОбъект();
		ЭОбъект.ЖелезнаяДорога = Справочники.ЖелезныеДороги.НайтиПоКоду(Ответ.СпрЭтранаКодДороги);
		ЭОбъект.записать();
		
		Результат = Результат + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПортыИзExcel(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ФормаЗагрузкиРеестраПортов");
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
