
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Рез = КорректировкиРТУСервер.СоздатьАннулированиеРТУИзСписка(ПараметрКоманды);
	ОповеститьОбИзменении(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ОповеститьОбИзменении(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	ОповеститьОбИзменении(Тип("ДокументСсылка.КорректировкаРеализации"));
	Оповестить("ОбновленыПризнакиРазрешенияКорректировокРТУ");
	
	Если ЗначениеЗаполнено(Рез) Тогда
		ПоказатьЗначение(, Рез);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") и Рез <> неопределено Тогда
		
		Рез = КорректировкиРТУСервер.СоздатьАннулированиеВознагражденияИзСписка(ПараметрКоманды);
		
		Если ЗначениеЗаполнено(Рез) Тогда
			ПоказатьЗначение(, Рез);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
