
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	РежимПаковочногоЛиста = Перечисления.УпаковкаРазупаковка.Упаковка;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УпаковочныеЛисты.Записывать = Истина;
	Для каждого Стр из Грузы Цикл
		
		Если РежимПаковочногоЛиста = Перечисления.УпаковкаРазупаковка.Упаковка Тогда
			Движение = Движения.УпаковочныеЛисты.ДобавитьПриход();
		Иначе
			Движение = Движения.УпаковочныеЛисты.ДобавитьРасход();
		КонецЕсли;
		Движение.Груз = Стр.Груз;
		Движение.ОборотнаяТара = Тара;
		Движение.Период = Дата;
		Движение.Привязано = 1;
		Движение.Регистратор = Ссылка;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковочныеЛистыОстатки.ОборотнаяТара КАК ОборотнаяТара,
	               |	УпаковочныеЛистыОстатки.Груз КАК Груз,
	               |	УпаковочныеЛистыОстатки.ПривязаноОстаток КАК ПривязаноОстаток
	               |ИЗ
	               |	РегистрНакопления.УпаковочныеЛисты.Остатки КАК УпаковочныеЛистыОстатки
	               |ГДЕ
	               |	УпаковочныеЛистыОстатки.ПривязаноОстаток < 0";
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
