
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого ТекСтрока из ЭтотОбъект Цикл
		
		// если получили операцию, по которой необходимо информировать пользователя, 
		// занести данные в РС РассылкаПоОперациям
		Если ТекСтрока.ОперацияСВагоном.ИнформироватьПользователей Тогда
			МенеджерЗаписи = РегистрыСведений.РассылкаПоОперациям.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Вагон = ТекСтрока.Вагон;
			МенеджерЗаписи.Операция = ТекСтрока.ОперацияСВагоном;
			МенеджерЗаписи.Период = ТекСтрока.Период;
			МенеджерЗаписи.Записать();
		КонецЕсли;		
		
		// если вагон отцеплен, создать для него операцию
		Если ТекСтрока.ОперацияСВагоном.БросаниеВагона = ИСТИНА Тогда
			// 1. Выбираем вагон в отправке
			// 2. Ищем отправку в сделке, у которой последняя дата либо пустая, либо больше текущей
			// 3. по РС ТехнологическаяСхема находим нужную технологическую схему для найденной сделки
			// 4. в ТЧ справочника ТехнологическаяСхема находим операции ЖДОтправка. Если нашли, то взять ее ГУИД,
			// чтобы указать как родительский. Если не нашли, то при создании новой операции установить Родитель1 пустым (корень)
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВагоныВОтправке.Отправка КАК Отправка,
			               |	ВагоныВОтправке.Вагон КАК Вагон
			               |ПОМЕСТИТЬ ВагонОтправка
			               |ИЗ
			               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
			               |ГДЕ
			               |	ВагоныВОтправке.Вагон = &Вагон
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СделкаРейсы.Ссылка КАК Сделка,
			               |	СделкаРейсы.Рейс КАК Рейс,
			               |	ВагонОтправка.Вагон КАК Вагон
			               |ПОМЕСТИТЬ СделкиСОтправками
			               |ИЗ
			               |	Документ.Сделка.Рейсы КАК СделкаРейсы
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагонОтправка КАК ВагонОтправка
			               |		ПО СделкаРейсы.Рейс = ВагонОтправка.Отправка
			               |ГДЕ
			               |	(СделкаРейсы.Ссылка.ПоследняяОперация >= &ТекДата
			               |			ИЛИ СделкаРейсы.Ссылка.ПоследняяОперация = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СделкиСОтправками.Сделка КАК Сделка,
			               |	СделкиСОтправками.Рейс КАК Рейс,
			               |	СделкиСОтправками.Вагон КАК Вагон,
			               |	ТехнологическаяСхема.ТСх КАК ТСх
			               |ПОМЕСТИТЬ ТСхема
			               |ИЗ
			               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СделкиСОтправками КАК СделкиСОтправками
			               |		ПО ТехнологическаяСхема.ПредметТСх = СделкиСОтправками.Сделка
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ТехнологическаяСхемаТЧ.Операция КАК Операция,
			               |	ОперацияГрузы.Ссылка КАК ЖДОперация,
			               |	ТехнологическаяСхемаТЧ.Ссылка КАК ТСхСсылка,
			               |	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД
			               |ИЗ
			               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
			               |		ПО ТехнологическаяСхемаТЧ.Операция = ОперацияГрузы.Ссылка
			               |			И (ОперацияГрузы.ТС В
			               |				(ВЫБРАТЬ
			               |					ВагонОтправка.Вагон
			               |				ИЗ
			               |					ВагонОтправка КАК ВагонОтправка))
			               |			И (ОперацияГрузы.Ссылка.Услуга = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЖДОтправка))
			               |ГДЕ
			               |	ТехнологическаяСхемаТЧ.Ссылка В
			               |			(ВЫБРАТЬ
			               |				ТСхема.ТСх
			               |			ИЗ
			               |				ТСхема КАК ТСхема)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ОперацияГрузы.Ссылка УБЫВ";
			Запрос.УстановитьПараметр("Вагон",ТекСтрока.Вагон);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			ТЗ = Запрос.Выполнить().Выгрузить();
			Если ТЗ.Количество()>0 Тогда
				// создаем операцию
				НоваяОпер = Документы.Операция.СоздатьДокумент();
				НоваяОпер.Заполнить(неопределено);
				НоваяОпер.Дата = ТекущаяДата();
				НоваяОпер.Автор = Пользователи.ТекущийПользователь();
				НоваяОпер.ЦФО = НоваяОпер.Автор.ЦФО;
				НоваяОпер.Создано = ТекущаяДата();
				НоваяОпер.ТребуетсяМаршрутизироватьВОбходВсехПравил = Истина;
				
				ЗаполнитьЗначенияСвойств(НоваяОпер,ТЗ[0].ЖДОперация,"Услуга,ТипДлительности,Срок,Поставщик,Договор,Валюта,СтавкаНДС,ВключаетНДС,Регламентный,Маршрутизировать,ПланФакт,Подразделение,Сделка,РейсЖД,Организация,"); 
				НоваяОпер.ПунктОтправления = ТекСтрока.СтанцияОперации;
				НоваяОпер.ПунктНазначения = ТекСтрока.СтанцияНазначения;
				РасстояниеМеждуСтн = РегистрыСведений.РасстоянияМеждуЛокациями.ПолучитьРасстояние(ТекСтрока.СтанцияОперации,ТекСтрока.СтанцияНазначения);
				ДатаПрибытия = ТекСтрока.Период+(РасстояниеМеждуСтн/350)*3600*24;
				НоваяОпер.ДатаОтправленияФакт = ТекСтрока.Период;
				НоваяОпер.ДатаНазначения = ДатаПрибытия;
				НовСтр = НоваяОпер.Грузы.Добавить();
				НовСтр.ТСГУИД = Новый УникальныйИдентификатор;
				НовСтр.ТС = ТекСтрока.Вагон;
				НовСтр.ДатаПрибытия = ДатаПрибытия;
				НовСтр.ДатаОтправления = ТекСтрока.Период;
				НовСтр.ТипТС = ТекСтрока.Вагон.ТипТС;
				
				НоваяОпер.Записать(РежимЗаписиДокумента.Проведение);
				СсылкаОпер = НоваяОпер.Ссылка;
				
				// записываем операцию в справочник ТехнологическаяСхема
				ТСх = ТЗ[0].ТСхСсылка;
				Родитель1 = ТЗ[0].ГУИД;
				ПолучОб = ТСх.ПолучитьОбъект();
				НовСтр = ПолучОб.ТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СсылкаОпер);
				НовСтр.ГУИД = Новый УникальныйИдентификатор;
				НовСтр.Родитель1 = Родитель1;
				НовСтр.Операция = СсылкаОпер;
				ПолучОб.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
		
		//////////////////// Иван - 14-11-19 - доп условие, что если разрешена запись сроков перемещения между станциями, то записываем в регистр сведений СрокиПеремещенияМеждуСтанциями ////
		
		Если Константы.СохранятьРасстояниеМеждуСтанциямиПриПолученииДислокации.Получить() = Истина Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ДислокацияВагонов.Вагон КАК Вагон,
			               |	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
			               |	ДислокацияВагонов.Период КАК Период,
			               |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации
			               |ИЗ
			               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
			               |ГДЕ
			               |	ДислокацияВагонов.Вагон = &Вагон
			               |	И ДислокацияВагонов.ИндексПоезда = &ИндексПоезда
			               |	И ДислокацияВагонов.Период <> &Период
			               |	И ДислокацияВагонов.СтанцияОперации <> &СтанцияОперации
			               |	И (ДислокацияВагонов.ОперацияСВагоном.ОтправлениеСоСтанции
			               |			ИЛИ ДислокацияВагонов.ОперацияСВагоном.ПрибытиеНаСтанцию)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ДислокацияВагонов.Период УБЫВ";
			Запрос.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
			Запрос.УстановитьПараметр("ИндексПоезда", ТекСтрока.ИндексПоезда);
			Запрос.УстановитьПараметр("Период", ТекСтрока.Период);
			Запрос.УстановитьПараметр("СтанцияОперации", ТекСтрока.СтанцияОперации);
			Ответ = Запрос.Выполнить().Выбрать();
			Если Ответ.Следующий() Тогда
				
				ВремяВПути = (ТекСтрока.Период - Ответ.Период)/60/60;
				СтОтправления = Ответ.СтанцияОперации;
				СтНазначения = ТекСтрока.СтанцияОперации;
				
				МЗ = РегистрыСведений.СрокиПеремещенияМеждуСтанциями.СоздатьМенеджерЗаписи();
				МЗ.ВремяПеремещенияЧас = ВремяВПути;
				МЗ.Период = текущаядата();
				МЗ.Станция1 = СтОтправления;
				МЗ.Станция2 = СтНазначения;
				МЗ.Записать(Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// заполнение регистра ОперацииДляДвиженияПоСлежению только в том случае, если нашли этот вагон
		
		// интересует вагон с операциями, у которых есть признаки ПОГРУЗКА ИЛИ ((ОтправлениеСоСтанции ИЛИ ПрибытиеНаСтанцию) И Порожний)
		Если ТекСтрока.ОперацияСВагоном.Погрузка ИЛИ 
			((ТекСтрока.ОперацияСВагоном.ОтправлениеСоСтанции ИЛИ
			ТекСтрока.ОперацияСВагоном.ПрибытиеНаСтанцию) И
			ТекСтрока.Груженый = Ложь) Тогда
		
			МассивВидовСлежений = Новый Массив;
			МассивВидовСлежений.Добавить(Перечисления.ВидыДвиженийПоОперациямСлежения.Порожний);
			МассивВидовСлежений.Добавить(Перечисления.ВидыДвиженийПоОперациямСлежения.Погрузка);
			МассивВидовСлежений.Добавить(Перечисления.ВидыДвиженийПоОперациямСлежения.Подсыл);
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ОперацииДляДвиженияПоСлежению.Регистратор КАК Регистратор,
			               |	ОперацииДляДвиженияПоСлежению.НомерСтроки КАК НомерСтроки,
			               |	ОперацииДляДвиженияПоСлежению.Активность КАК Активность,
			               |	ОперацииДляДвиженияПоСлежению.Операция КАК Операция,
			               |	ОперацииДляДвиженияПоСлежению.ВидДвиженияПоСлежению КАК ВидДвиженияПоСлежению,
			               |	ОперацииДляДвиженияПоСлежению.ДатаНачала КАК ДатаНачала,
			               |	ОперацииДляДвиженияПоСлежению.ДатаОкончания КАК ДатаОкончания,
			               |	ОперацииДляДвиженияПоСлежению.СписокТС КАК СписокТС,
			               |	ОперацииДляДвиженияПоСлежению.СписокТЕ КАК СписокТЕ,
			               |	ОперацииДляДвиженияПоСлежению.ОперацияНачата КАК ОперацияНачата,
			               |	ОперацииДляДвиженияПоСлежению.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ОперацииДляДвиженияПоСлежению КАК ОперацииДляДвиженияПоСлежению
			               |ГДЕ
			               |	ОперацииДляДвиженияПоСлежению.Вагон = &Вагон
			               |	И ОперацииДляДвиженияПоСлежению.ВидДвиженияПоСлежению В (&ВидДвиженияПоСлежению)";
			Запрос.УстановитьПараметр("Вагон",ТекСтрока.Вагон);
			Запрос.УстановитьПараметр("ВидДвиженияПоСлежению",МассивВидовСлежений);
			Ответ = Запрос.Выполнить().Выбрать();
			Если Ответ.Следующий() Тогда
				
				НаборЗаписей = РегистрыСведений.ОперацииДляДвиженияПоСлежению.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.Регистратор.Установить(Ответ.Регистратор);
				НаборЗаписей.Прочитать();
					  	
				Для каждого МЗ Из НаборЗаписей Цикл
					Если МЗ.Операция = Ответ.Операция И
						МЗ.ВидДвиженияПоСлежению = Ответ.ВидДвиженияПоСлежению И
						МЗ.Вагон = Ответ.Вагон Тогда
						
						// если это Комплексная услуга по терминaльной обработке (Погрузка), то событие одномоментное
						Если Ответ.ВидДвиженияПоСлежению = Перечисления.ВидыДвиженийПоОперациямСлежения.Погрузка И
							ТекСтрока.ОперацияСВагоном.Погрузка Тогда
							МЗ.ДатаНачала = ТекСтрока.Период;
							МЗ.ДатаОкончания = ТекСтрока.Период;
							МЗ.ИзмененоИзСлежения = Истина;
						КонецЕсли;
						
						// если это "Подсыл порожнего вагона" ИЛИ "Перевозка порожних вагонов под погрузку", 
						// то событие растянуто по времени и необходимо слежение по регистру дислокации
						Если Ответ.ВидДвиженияПоСлежению = Перечисления.ВидыДвиженийПоОперациямСлежения.Порожний ИЛИ
							Ответ.ВидДвиженияПоСлежению = Перечисления.ВидыДвиженийПоОперациямСлежения.Подсыл Тогда
							
							// 1. проверить станцию отправления
							Если ТекСтрока.ОперацияСВагоном.ОтправлениеСоСтанции Тогда
								// получить массив локаций из регистра соответствий станций
								МассивЛокаций = ПОлучитьМассивЛокаций(ТекСтрока.СтанцияОперации);
								// если нашли нужную станцию в массиве локаций (пункт отправления операции совпал с одним из элементов массива),
								// то проставляем дату отправления (начала операции) в РС ОперацииДляДвиженияПоСлежению
								Если НЕ МассивЛокаций.Найти(Ответ.Операция.ПунктОтправления) = Неопределено Тогда
									МЗ.ДатаНачала = ТекСтрока.Период;
									МЗ.ИзмененоИзСлежения = Истина;
								КонецЕсли;
							КонецЕсли;
							
							// 2. проверить станцию назначения
							Если ТекСтрока.ОперацияСВагоном.ПрибытиеНаСтанцию Тогда
								// получить массив локаций из регистра соответствий станций
								МассивЛокаций = ПОлучитьМассивЛокаций(ТекСтрока.СтанцияОперации);
								// если нашли нужную станцию в массиве локаций (пункт назначения операции совпал с одним из элементов массива),
								// то проставляем дату назначения (окончания операции) в РС ОперацииДляДвиженияПоСлежению
								Если НЕ МассивЛокаций.Найти(Ответ.Операция.ПунктНазначения) = Неопределено Тогда
									МЗ.ДатаОкончания = ТекСтрока.Период;
									МЗ.ИзмененоИзСлежения = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
					
				НаборЗаписей.Записать();				
	
			КонецЕсли;
		КонецЕсли;
		
//Евросиб Гудкова( 20.09.2020 Ticket№ 0206314 грузим в дислокации
		//// получить из индекса поезда станцию отправления
		//Если ЗначениеЗаполнено(ТекСтрока.ИндексПоезда) Тогда
		//	КодСтанцииОтправления = Сред(ТекСтрока.ИндексПоезда,1,5);
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//	               |	Локации.Ссылка КАК Ссылка
		//	               |ИЗ
		//	               |	Справочник.Локации КАК Локации
		//	               |ГДЕ
		//	               |	ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = &КодЖДСтанции";
		//	Запрос.УстановитьПараметр("КодЖДСтанции",КодСтанцииОтправления);
		//	Ответ = Запрос.Выполнить().Выбрать();
		//	Если Ответ.Следующий() Тогда
		//		ТекСтрока.СтанцияОтправления = Ответ.Ссылка;
		//	КонецЕсли;
		//КонецЕсли;
// Евросиб Гудкова) 		
		
		// проверяем, какая станция операции занесена в предыдущей записи. если
		// она совпадает с текущей, то в текущую запись вносим из предыдущей дату прибытия на станцию
		// и в простой на станции вносим дельту от текущего периода и даты прибытия на станцию.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
		               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
		               |ПОМЕСТИТЬ РСПериод
		               |ИЗ
		               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(&Период, Вагон = &Вагон) КАК ДислокацияВагоновСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДислокацияВагоновСрезПоследних.Вагон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
		               |	ДислокацияВагонов.Вагон КАК Вагон,
		               |	МАКСИМУМ(ДислокацияВагонов.ОперацияСВагоном) КАК ОперацияСВагоном
		               |ПОМЕСТИТЬ ВагоныОперации
		               |ИЗ
		               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РСПериод КАК РСПериод
		               |		ПО ДислокацияВагонов.Период = РСПериод.Период
		               |			И ДислокацияВагонов.Вагон = РСПериод.Вагон
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДислокацияВагонов.Вагон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДислокацияВагонов.Период КАК Период,
		               |	ДислокацияВагонов.Вагон КАК Вагон,
		               |	ДислокацияВагонов.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию
		               |ИЗ
		               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагоныОперации КАК ВагоныОперации
		               |		ПО ДислокацияВагонов.Период = ВагоныОперации.Период
		               |			И ДислокацияВагонов.Вагон = ВагоныОперации.Вагон
		               |			И ДислокацияВагонов.ОперацияСВагоном = ВагоныОперации.ОперацияСВагоном
		               |ГДЕ
		               |	ДислокацияВагонов.СтанцияОперации = &СтанцияОперации
		               |	И НЕ ДислокацияВагонов.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
		Запрос.УстановитьПараметр("Вагон",ТекСтрока.Вагон);
		Запрос.УстановитьПараметр("Период",ТекСтрока.Период-1);
		Запрос.УстановитьПараметр("СтанцияОперации",ТекСтрока.СтанцияОперации);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ТекСтрока.ДатаПрибытияНаСтанцию = Ответ.ДатаПрибытияНаСтанцию;
			ТекСтрока.ПростойНаСтанции = (ТекСтрока.Период - Ответ.ДатаПрибытияНаСтанцию)/3600;
		Иначе
			ТекСтрока.ДатаПрибытияНаСтанцию = ТекСтрока.Период;
			ТекСтрока.ПростойНаСтанции = 0;
		КонецЕсли;
		
		
		// проверяем, какая станция операции занесена в предыдущей записи. если
		// она НЕ совпадает с текущей станцией операции и совпадает с ТЕКУЩЕЙ станцией отправления,
		// то в текущую запись вносим текущую дату операции (период) как дату отправления.
		// если станция отправления не совпадает со станцией операции, то заносим в дату отправления дату из предыдущей записи
		
		// если вагон находится на станции назначения и не отправился с нее, то записывать в качестве даты отправления текущий период
		// и больше ничего не проверять
		
		//Евросиб - АСуслов 02.10.2020 12:27:08 #
		//(
		//перенес в загрузку дислокации
		//)
		//Евросиб - АСуслов 02.10.2020 12:27:09 #
		
		//Если ТекСтрока.СтанцияОперации = ТекСтрока.СтанцияНазначения ИЛИ
		//	ТекСтрока.СтанцияОтправления = ТекСтрока.СтанцияОперации Тогда
		//	ТекСтрока.ДатаОтправленияСоСтанции = ТекСтрока.Период;
		//Иначе
		//
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//	               |	ДислокацияВагоновСрезПоследних.Период КАК Период,
		//	               |	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
		//	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
		//	               |ПОМЕСТИТЬ РСПериод
		//	               |ИЗ
		//	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
		//	               |			&Период,
		//	               |			Вагон = &Вагон
		//	               |				И (Период < &Период
		//	               |					ИЛИ (Период = &Период
		//	               |						И НЕ ОперацияСВагоном = &ОперацияСВагоном))) КАК ДислокацияВагоновСрезПоследних
		//	               |
		//	               |УПОРЯДОЧИТЬ ПО
		//	               |	ДислокацияВагоновСрезПоследних.Период УБЫВ
		//	               |;
		//	               |
		//	               |////////////////////////////////////////////////////////////////////////////////
		//	               |ВЫБРАТЬ
		//	               |	ДислокацияВагонов.Период КАК Период,
		//	               |	ДислокацияВагонов.Вагон КАК Вагон,
		//	               |	ДислокацияВагонов.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
		//	               |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации,
		//	               |	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления
		//	               |ИЗ
		//	               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
		//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РСПериод КАК РСПериод
		//	               |		ПО ДислокацияВагонов.Период = РСПериод.Период
		//	               |			И ДислокацияВагонов.Вагон = РСПериод.Вагон
		//	               |			И ДислокацияВагонов.ОперацияСВагоном = РСПериод.ОперацияСВагоном
		//	               |ГДЕ
		//	               |	ДислокацияВагонов.СтанцияОтправления = &СтанцияОтправления
		//				   |	И НЕ ДислокацияВагонов.СтанцияОперации = &СтанцияОперации";
		//	Запрос.УстановитьПараметр("Вагон",ТекСтрока.Вагон);
		//	Запрос.УстановитьПараметр("ОперацияСВагоном",ТекСтрока.ОперацияСВагоном);
		//	Запрос.УстановитьПараметр("Период",ТекСтрока.Период);
		//	Запрос.УстановитьПараметр("СтанцияОтправления",ТекСтрока.СтанцияОтправления);
		//	Запрос.УстановитьПараметр("СтанцияОперации",ТекСтрока.СтанцияОперации);
		//	Ответ = Запрос.Выполнить().Выбрать();
		//	Если Ответ.Следующий() Тогда
		//		ТекСтрока.ДатаОтправленияСоСтанции = Ответ.ДатаОтправленияСоСтанции;
		//	КонецЕсли;
		//КонецЕсли;
		
		////////////////////////////////////////////////////////////
		// ПОВАГОНКА
		
		// 1. включение в повагонку
		
		// проверяем, прибыл ли вагон на станцию назначения (проверяем станцию операции и станцию назначения по
		// ТаблицаСинонимов), есть ли у станции признаки перевода в повагонку или 
		// у операции есть признак перевода в повагонку.
		
		// ИЛИ проверяем, что вагон вошел в регион отправления, введенный пользователем вручную.
		
		// после включения в повагонку необходимо удалить вагон из регистра ВагоныЗапланированныеКПовагонке
		//ПрибытиеВНазначение = Локации_сервер.ПолучитьСовпадениеСтанций(ТекСтрока.СтанцияОперации,ТекСтрока.СтанцияНазначения);
		ПрибытиеВНазначение = ТекСтрока.СтанцияОперации = ТекСтрока.СтанцияНазначения;
		ПрибытиеВРегионОтправления = РаботаСПовагоннымиОтправками.ПолучитьРегионОтправления(ТекСтрока.СтанцияОперации,ТекСтрока.Вагон);
		// 1.1.
		Если (ТекСтрока.ОперацияСВагоном.ПрибытиеНаСтанцию = Истина И
			ПрибытиеВНазначение И
			((ТекСтрока.СтанцияОперации.ПереводГруженогоВРежимПовагонныхОтправок И ТекСтрока.Груженый) ИЛИ
			(ТекСтрока.СтанцияОперации.ПереводПорожнегоВРежимПовагонныхОтправок И НЕ ТекСтрока.Груженый)) ИЛИ
			ТекСтрока.ОперацияСВагоном.ПереводВРежимПовагонки) 
			
			ИЛИ
			
			(ТекСтрока.ОперацияСВагоном.ПрибытиеНаСтанцию = Истина И ПрибытиеВРегионОтправления)
			
			Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
			               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
			               |			,
			               |			Вагон = &Вагон
						   //Евросиб Каблов 25.02.2021 (
						   //|				И ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1)) КАК ПовагонныеОтправкиСрезПоследних
						   |				) КАК ПовагонныеОтправкиСрезПоследних
			               |ГДЕ
			               |	ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1)";
						   //Евросиб Каблов 25.02.2021 ) 
			               
			
			Запрос.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
			
			РЗ = Запрос.Выполнить();
			Если РЗ.Пустой() Тогда
				ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ТекЗапись,ТекСтрока);
				ТекЗапись.СтанцияВвода = ТекСтрока.СтанцияОперации;
				Если ТекСтрока.ОперацияСВагоном.ПереводВРежимПовагонки Тогда
					ТекЗапись.СобытиеПереводаВПовагонку = Перечисления.СобытияПереводаВПовагонку.ОперацияПереводВРежимПовагонки;
				ИначеЕсли ПрибытиеВРегионОтправления Тогда
					ТекЗапись.СобытиеПереводаВПовагонку = Перечисления.СобытияПереводаВПовагонку.Вручную;
				Иначе
					ТекЗапись.СобытиеПереводаВПовагонку = Перечисления.СобытияПереводаВПовагонку.ПризнакУСтанцииПереводВПовагонку;
				КонецЕсли;
				// если в регистре ВагоныЗапланированныеКПовагонке есть запись по этому вагону,
				// то нужно перенести данные в регистр ПовагонныеОтправки, взяв плановые данные как основу.
				// если в плановом регистре этот вагон числится как вагон в НРП, то не переносить его в повагонные отправки до
				// тех пор, пока у него не появится дата выхода из ремонта
				Запрос2 = Новый Запрос;
				Запрос2.Текст = "ВЫБРАТЬ
				                |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон,
				                |	ВагоныЗапланированныеКПовагонке.Клиент КАК Клиент,
				                |	ВагоныЗапланированныеКПовагонке.Договор КАК Договор,
				                |	ВагоныЗапланированныеКПовагонке.Заявка КАК Заявка,
				                |	ВагоныЗапланированныеКПовагонке.ПСЦ КАК ПСЦ,
				                |	ВагоныЗапланированныеКПовагонке.Комментарий КАК Комментарий,
				                |	ВагоныЗапланированныеКПовагонке.РегионОтправления КАК РегионОтправления,
				                |	ВагоныЗапланированныеКПовагонке.РегионВозврата КАК РегионВозврата,
				                |	ВагоныЗапланированныеКПовагонке.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
				                |	ВагоныЗапланированныеКПовагонке.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
				                |	ВагоныЗапланированныеКПовагонке.НДС КАК НДС,
				                |	ВагоныЗапланированныеКПовагонке.Калькуляция КАК Калькуляция,
				                |	ВагоныЗапланированныеКПовагонке.ПереводВНРП КАК ПереводВНРП,
				                |	ВагоныЗапланированныеКПовагонке.ВыводИзНРП КАК ВыводИзНРП
				                |ИЗ
				                |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
				                |ГДЕ
				                |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
				
				Запрос2.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
				Ответ = Запрос2.Выполнить().Выбрать();
				Если Ответ.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
					ТекЗапись.СтанцияОтправления = ТекСтрока.СтанцияОперации;
					ТекЗапись.ДатаПередачиВПользование = ?(ЗначениеЗаполнено(Ответ.ДатаПередачиВПользование),Ответ.ДатаПередачиВПользование,ТекСтрока.Период);
					// устанавливаем флаг ЗаявкаНеПодходит,для тех заявок, у которых нет рейса
					Если ЗначениеЗаполнено(Ответ.Заявка) И Ответ.Заявка.ПереченьРейсов.Количество() = 0 Тогда
						ТекЗапись.ЗаявкаНеПодходит = Истина;
					КонецЕсли;
					
					// 1.2. Удаление из регистра ВагоныЗапланированныеКПовагонке.
					Запись = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
					Запись.Вагон = ТекСтрока.Вагон;
					Запись.Удалить();
					
				КонецЕсли;
				
				ТекЗапись.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		
		// 2. исключение из повагонки. исключаем автоматически только те вагоны, которые не были в ремонте
		
		Если ТекСтрока.ОперацияСВагоном.ПрибытиеНаСтанцию И ТекСтрока.СтанцияОперации.ПовагонкаВКП Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
			               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
			               |			,
			               |			Вагон = &Вагон
			               |				И ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |				И ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПовагонныеОтправкиСрезПоследних";
			
			Запрос.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				// изменить существующую запись
				ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ТекЗапись,Выборка);
				ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ТекЗапись2, Выборка);
				ТекЗапись.Прочитать();
				
				Если НЕ ТекЗапись.Выбран() Тогда
					ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
				КонецЕсли;
				
				ТекЗапись.СобытиеВыводаИзПовагонки = Перечисления.СобытияВыводаИзПовагонки.ПризнакСтанцииПовагонкаВКП;
				ТекЗапись.ВыводИзПовагонки  = ТекСтрока.Период;
				ТекЗапись.СтанцияВывода  = ТекСтрока.СтанцияОперации;
				ТекЗапись.ДатаПрибытияНаСтанциюНазначения = ТекСтрока.Период;
				ТекЗапись.ДатаОкончанияПользования = ТекСтрока.Период;
				ТекЗапись.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
		// 3. планируются в повагонку по признакам станции. Проверить, что этого вагона нет в повагонке (он из нее не выведен)
		Если ((ТекСтрока.СтанцияНазначения.ПереводГруженогоВРежимПовагонныхОтправок И ТекСтрока.Груженый) ИЛИ
			(ТекСтрока.СтанцияНазначения.ПереводПорожнегоВРежимПовагонныхОтправок И НЕ ТекСтрока.Груженый)) И
			НЕ ПрибытиеВНазначение Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
			               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, Вагон = &Вагон) КАК ПовагонныеОтправкиСрезПоследних
			               |ГДЕ
			               |	ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Запрос.УстановитьПараметр("Вагон",ТекСтрока.Вагон);
			Если Запрос.Выполнить().Пустой() Тогда
			
				ТекЗапись = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ТекЗапись,ТекСтрока);
				ТекЗапись.СобытиеПереводаВПовагонку = Перечисления.СобытияПереводаВПовагонку.ПризнакУСтанцииПереводВПовагонку;
				ТекЗапись.РегионОтправления = ТекСтрока.СтанцияНазначения;
				ТекЗапись.ДатаОперации = ТекСтрока.Период;
				ТекЗапись.РасстояниеДоНазначения = РегистрыСведений.РасстоянияМеждуЛокациями.ПолучитьРасстояние(ТекСтрока.СтанцияОперации,ТекСтрока.СтанцияНазначения);

				ТекЗапись.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		// 4. изменить данные по дислокации у планируемых вагонов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон,
		               |	ВагоныЗапланированныеКПовагонке.СтанцияОперации КАК СтанцияОперации,
		               |	ВагоныЗапланированныеКПовагонке.ОперацияСВагоном КАК ОперацияСВагоном,
		               |	ВагоныЗапланированныеКПовагонке.ДатаОперации КАК ДатаОперации,
		               |	ВагоныЗапланированныеКПовагонке.Груженый КАК Груженый,
		               |	ВагоныЗапланированныеКПовагонке.РасстояниеДоНазначения КАК РасстояниеДоНазначения,
		               |	ВагоныЗапланированныеКПовагонке.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
		               |	ВагоныЗапланированныеКПовагонке.Клиент КАК Клиент,
		               |	ВагоныЗапланированныеКПовагонке.Договор КАК Договор,
		               |	ВагоныЗапланированныеКПовагонке.Заявка КАК Заявка,
		               |	ВагоныЗапланированныеКПовагонке.ПСЦ КАК ПСЦ,
		               |	ВагоныЗапланированныеКПовагонке.Комментарий КАК Комментарий,
		               |	ВагоныЗапланированныеКПовагонке.РегионОтправления КАК РегионОтправления,
		               |	ВагоныЗапланированныеКПовагонке.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки
		               |ИЗ
		               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
		               |ГДЕ
		               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
		
		Запрос.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ТекЗапись = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
			ТекЗапись2 = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
			
			ТекЗапись.Прочитать();
			Если НЕ ТекЗапись.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТекЗапись,ТекСтрока,"СтанцияОперации,ОперацияСВагоном,Груженый");
			ТекЗапись.ОперацияСВагоном = ТекСтрока.ОперацияСВагоном;
			ТекЗапись.ДатаОперации = ТекСтрока.Период;
			ТекЗапись.РасстояниеДоНазначения = Локации_сервер.ПолучитьРасстояниеМеждуСтанциями(ТекСтрока.СтанцияОперации,ТекСтрока.СтанцияНазначения);
			
			ТекЗапись.Записать();
			
		КонецЕсли;
				

		
		/////////////////////////////////////////////////////////////////\\\\\\ ПОВАГОНКА
		
		
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьМассивЛокаций(СтанцияОперации)
	
	МассивЛокаций = новый Массив;
	
	ЗапросЛокаций = Новый Запрос;
	ЗапросЛокаций.Текст = "ВЫБРАТЬ
	                      |	АналогиЛокаций.Локация КАК Локация,
	                      |	АналогиЛокаций.Аналог КАК Аналог
	                      |ИЗ
	                      |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	                      |ГДЕ
	                      |	(АналогиЛокаций.Локация = &Локация
	                      |			ИЛИ АналогиЛокаций.Аналог = &Локация)";
	ЗапросЛокаций.УстановитьПараметр("Локация", СтанцияОперации);
	ОтветЛокаций = ЗапросЛокаций.Выполнить().Выбрать();
	Пока ОтветЛокаций.Следующий() Цикл
		МассивЛокаций.Добавить(ОтветЛокаций.Локация);
		МассивЛокаций.Добавить(ОтветЛокаций.Аналог);
	КонецЦикла;
	МассивЛокаций.Добавить(СтанцияОперации);

	Возврат МассивЛокаций;
	
КонецФункции

Процедура ПриЗаписи(Отказ, Замещение)
	
	// проверяем, есть ли в РС ОперацииДляДвиженияПоСлежению записи, который были изменены из данного регистра.
	// если да, то внести эти изменения в операции. сразу же нельзя вносить, т.к. для получения шапки операции
	// (дата отправления и дата назначения) нужно иметь заполненными все даты операций по вагонам. а т.к. вагоны 
	// из операции могут приходить в разном порядке, чтобы не записывать одну и ту же операцию несколько раз,
	// сгруппируем данные по операции.

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииДляДвиженияПоСлежению.Регистратор КАК Регистратор,
		|	ОперацииДляДвиженияПоСлежению.НомерСтроки КАК НомерСтроки,
		|	ОперацииДляДвиженияПоСлежению.Активность КАК Активность,
		|	ОперацииДляДвиженияПоСлежению.Операция КАК Операция,
		|	ОперацииДляДвиженияПоСлежению.ВидДвиженияПоСлежению КАК ВидДвиженияПоСлежению,
		|	ОперацииДляДвиженияПоСлежению.ДатаНачала КАК ДатаНачала,
		|	ОперацииДляДвиженияПоСлежению.ДатаОкончания КАК ДатаОкончания,
		|	ОперацииДляДвиженияПоСлежению.СписокТС КАК СписокТС,
		|	ОперацииДляДвиженияПоСлежению.СписокТЕ КАК СписокТЕ,
		|	ОперацииДляДвиженияПоСлежению.ОперацияНачата КАК ОперацияНачата,
		|	ОперацииДляДвиженияПоСлежению.Вагон КАК Вагон,
		|	ОперацииДляДвиженияПоСлежению.ИзмененоИзСлежения КАК ИзмененоИзСлежения
		|ИЗ
		|	РегистрСведений.ОперацииДляДвиженияПоСлежению КАК ОперацииДляДвиженияПоСлежению
		|ГДЕ
		|	ОперацииДляДвиженияПоСлежению.ИзмененоИзСлежения
		|ИТОГИ ПО
		|	Операция";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОперация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОперация.Следующий() Цикл
	
		ПолучОб = ВыборкаОперация.Операция.ПолучитьОбъект();
		
		ВыборкаДетальныеЗаписи = ВыборкаОперация.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ТС",ВыборкаДетальныеЗаписи.Вагон);
			НайденныйВаг = ПолучОб.Грузы.НайтиСтроки(ПараметрыОтбора);
			Если НайденныйВаг.Количество()>0 Тогда
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачала) Тогда
					НайденныйВаг[0].ДатаОтправления = ВыборкаДетальныеЗаписи.ДатаНачала;
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончания) Тогда
					НайденныйВаг[0].ДатаПрибытия = ВыборкаДетальныеЗаписи.ДатаОкончания;
				КонецЕсли;
			КонецЕсли;
			
			// изменить данные РС ОперацииДляДвиженияПоСлежению
			НаборЗаписей = РегистрыСведений.ОперацииДляДвиженияПоСлежению.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
			НаборЗаписей.Прочитать();
				  	
			Для каждого МЗ Из НаборЗаписей Цикл
				Если МЗ.Операция = ВыборкаДетальныеЗаписи.Операция И
					МЗ.ВидДвиженияПоСлежению = ВыборкаДетальныеЗаписи.ВидДвиженияПоСлежению И
					МЗ.Вагон = ВыборкаДетальныеЗаписи.Вагон Тогда
					
					МЗ.ИзмененоИзСлежения = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать();				
			
		КонецЦикла;
		
		Попытка
			ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	// SIV 30.08.20 (отметка о фактическом начале рейса для табельного расписания)
	Для каждого Стр из ЭтотОбъект Цикл
		
		Если Стр.ОперацияСВагоном.ОтправлениеСоСтанции И НЕ ИндексПоездаЗарегистрирован(Стр.ИндексПоезда) Тогда
			
			ПодходящийРейс = Слежение_сервер.ПолучитьПодходящийРейс(Стр.СтанцияОтправления, Стр.СтанцияНазначения, Стр.Период, СТр.Вагон);
			Если ПодходящийРейс <> неопределено Тогда
				
				МЗ = РегистрыСведений.ОтметкаФактНачалаРейсов.СоздатьМенеджерЗаписи();
				МЗ.ЗарегистрированоПоВагону = Стр.Вагон;
				МЗ.ИндексПоезда = СТр.ИндексПоезда;
				МЗ.РейсЖД = ПодходящийРейс;
				МЗ.ФактическоеНачало = Стр.Период;
				МЗ.Записать(Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

Функция ИндексПоездаЗарегистрирован(ИндексПоезда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтметкаФактНачалаРейсов.РейсЖД КАК РейсЖД
	               |ИЗ
	               |	РегистрСведений.ОтметкаФактНачалаРейсов КАК ОтметкаФактНачалаРейсов
	               |ГДЕ
	               |	ОтметкаФактНачалаРейсов.ИндексПоезда = &ИндексПоезда";
	Запрос.УстановитьПараметр("ИндексПоезда", ИндексПоезда);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции





