Процедура ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление(ИмяСправочника, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Если НЕ Параметры.Свойство("Рекурсия") Тогда
		
		СтандартныйСписок = Неопределено;
		СтандартнаяОбработка = Ложь;
		Параметры.Вставить("Рекурсия");
		
		//СтруктураОтбора = Новый Структура("ПометкаУдаления", Ложь);
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
		
		Выполнить("СтандартныйСписок = Справочники."+ИмяСправочника+".ПолучитьДанныеВыбора(Параметры)");
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОчиститьЗначенияРеквизитовПомеченныеНаУдалениеПриКопированииПриКопировании(Источник, ОбъектКопирования) Экспорт  
	ПроверитьРеквизитыВыборПомеченныхНаУдаление(Источник, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПроверкаВыбранныхОбъектовПомеченныхНаУдалениеПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	ПроверитьРеквизитыВыборПомеченныхНаУдаление(Источник,,Отказ);
КонецПроцедуры

Процедура ПроверитьРеквизитыВыборПомеченныхНаУдаление(ОбрабатываемыйОбъект, ОбъектКопирования = Неопределено, Отказ = Неопределено)
	
	//ДИТ Шевченко А.В. US 72111 ТА 72114 17.07.2023 -Начало
	Если ОбрабатываемыйОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 72111 ТА 72114 17.07.2023 -Конец
	МассивРеквизитов = Новый Массив;
	Для каждого Реквизит Из ОбрабатываемыйОбъект.Метаданные().Реквизиты Цикл
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбрабатываемыйОбъект[Реквизит.Имя])) 
			ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбрабатываемыйОбъект[Реквизит.Имя])) Тогда
			МассивРеквизитов.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	ТипОбъекта = ?(Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбрабатываемыйОбъект.Ссылка)),"Справочник","Документ");
	СтруктураТабличныхЧастей = Новый Структура();
	ТекстЗапроса = "";
	Для каждого ТабличнаяЧасть Из ОбрабатываемыйОбъект.Метаданные().ТабличныеЧасти Цикл 
		Если ОбрабатываемыйОбъект[ТабличнаяЧасть.Имя].Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		МассивРеквизитовТабличныхЧастей = Новый Массив;
		Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			Для каждого ТипРеквизита Из Реквизит.Тип.Типы() Цикл
				Если Справочники.ТипВсеСсылки().СодержитТип(ТипРеквизита) 
					ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
					МассивРеквизитовТабличныхЧастей.Добавить(Реквизит.Имя);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если МассивРеквизитовТабличныхЧастей.Количество() > 0 Тогда
				СтруктураТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, МассивРеквизитовТабличныхЧастей);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	МассивПолейТекстаЗапроса = Новый Массив;
	МассивПолейТекстаЗапроса.Добавить("Ложь КАК Поле1");//чтобы всегда был запрос к реквизитам
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		ПолеТекстаЗапроса = СтрШаблон("
		|	ВЫБОР
		|		КОГДА ТипОбъекта.%1.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК %1", ИмяРеквизита);
		МассивПолейТекстаЗапроса.Добавить(ПолеТекстаЗапроса);
	КонецЦикла;
	
	ТекстЗапроса = СтрШаблон("
	|ВЫБРАТЬ
	|	%1
	|ИЗ
	|	%3.%2 КАК ТипОбъекта
	|ГДЕ ТипОбъекта.Ссылка = &ИсточникСсылка
	|;
	|", СтрСоединить(МассивПолейТекстаЗапроса, ","), ОбрабатываемыйОбъект.Метаданные().Имя, ТипОбъекта);
	Для каждого ТабличнаяЧасть Из СтруктураТабличныхЧастей Цикл
		МассивПолейТекстаЗапроса = Новый Массив;
		Для каждого ИмяРеквизита Из ТабличнаяЧасть.Значение Цикл
			ПолеТекстаЗапроса = СтрШаблон("
			|  _%1.НомерСтроки,
			|	ВЫБОР
			|		КОГДА _%1.%2.ПометкаУдаления
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК %2", ТабличнаяЧасть.Ключ, ИмяРеквизита);
			МассивПолейТекстаЗапроса.Добавить(ПолеТекстаЗапроса);
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("
		|ВЫБРАТЬ
		|	%1
		|ИЗ
		|	%4.%2.%3 КАК _%3
		|ГДЕ _%3.Ссылка = &ИсточникСсылка
		|;
		|", СтрСоединить(МассивПолейТекстаЗапроса, ","), ОбрабатываемыйОбъект.Метаданные().Имя, ТабличнаяЧасть.Ключ, ТипОбъекта);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;                        
	Если НЕ ОбъектКопирования = Неопределено Тогда
		Запрос.УстановитьПараметр("ИсточникСсылка", ОбъектКопирования.Ссылка);
	Иначе
		Запрос.УстановитьПараметр("ИсточникСсылка", ОбрабатываемыйОбъект.Ссылка);
	КонецЕсли;
	Результаты = Запрос.ВыполнитьПакет();
	//1 пакет это реквизиты
	ЗначенияРеквизитовПомеченныхНаУдаление = Результаты[0].Выгрузить()[0];
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		Если ЗначенияРеквизитовПомеченныхНаУдаление[ИмяРеквизита] Тогда
			Если ОбъектКопирования = Неопределено Тогда
				ОбщегоНазначения.СообщитьПользователю("Реквизит: "+ИмяРеквизита+" выбран объект, помеченный на удаление.
				|Для корректной работы требуется изменить значение в поле на элемент, не помеченный на удаление.", ОбрабатываемыйОбъект, ИмяРеквизита);
			Иначе
				ОбрабатываемыйОбъект[ИмяРеквизита] = Неопределено;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;                                            
	ИндексРезультата = 1;
	Для каждого КлючЗначение Из СтруктураТабличныхЧастей Цикл
		ЗначенияРеквизитовПомеченныхНаУдаление = Результаты[ИндексРезультата].Выгрузить();
		Для каждого СтрокаТабличнойЧасти Из ЗначенияРеквизитовПомеченныхНаУдаление Цикл
			Для каждого ИмяРеквизита Из КлючЗначение.Значение Цикл 
				//Евросиб Коханенко Н.А. 11.02.2026 (( BUG 130030 TA 130694
				//не проверяем Ключи аналитики перевозки на Пометку удаления только в Запросе на автоперевозку
				Если ТипЗнч(ОбрабатываемыйОбъект) = Тип("ДокументОбъект.ЗапросНаАвтоперевозку")
					И КлючЗначение.Ключ = "Контейнеры"
					И ИмяРеквизита = "КлючАналитикиПеревозки" Тогда
					Продолжить;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 11.02.2026 )) BUG 130030 TA 130694 
				Если СтрокаТабличнойЧасти[ИмяРеквизита] Тогда
					Если ОбъектКопирования = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю("В табличной части: "+КлючЗначение.Ключ+"  реквизит: "+ИмяРеквизита+" выбран объект, помеченный на удаление.
						|Для корректной работы требуется изменить значение в поле на элемент, не помеченный на удаление.", ОбрабатываемыйОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(КлючЗначение.Ключ, СтрокаТабличнойЧасти.НомерСтроки, ИмяРеквизита));
					Иначе
						ОбрабатываемыйОбъект[КлючЗначение.Ключ][СтрокаТабличнойЧасти.НомерСтроки-1][ИмяРеквизита] = Неопределено;	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;                                            
		КонецЦикла;
		ИндексРезультата = ИндексРезультата + 1;
	КонецЦикла;
	
КонецПроцедуры
