Функция ПолучитьДанныеДислокацииВагоновРефСцепа(ДанныеПоВагонамРефСцепа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВагоныВРефСцепах.Вагон КАК Вагон,
		|	ВагоныВРефСцепах.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	ВагоныВРефСцепах.ПризнакВагона КАК ПризнакВагона,
		|	ВагоныВРефСцепах.Номер1Контроллера КАК Номер1Контроллера,
		|	ВагоныВРефСцепах.Номер2Контроллера КАК Номер2Контроллера,
		|	ВагоныВРефСцепах.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме,
		|	ВагоныВРефСцепах.ЕстьВагонДокументаВБазе КАК ЕстьВагонДокументаВБазе,
		|	ВагоныВРефСцепах.ПорядковыйНомерВСцепеРегистраНаФорме КАК ПорядковыйНомерВСцепеРегистраНаФорме
		|ПОМЕСТИТЬ вт_ВагоныВРефСцепах
		|ИЗ
		|	&ДанныеПоВагонамРефСцепа КАК ВагоныВРефСцепах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДислокацияВагоновСрезПоследних.Период КАК Период,
		|	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
		|	ДислокацияВагоновСрезПоследних.НомерПоезда КАК НомерПоезда,
		|	ДислокацияВагоновСрезПоследних.ИндексПоезда КАК ИндексПоезда,
		|	ДислокацияВагоновСрезПоследних.Собственник КАК Собственник,
		|	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
		|	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
		|	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
		|	ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
		|	ДислокацияВагоновСрезПоследних.ПростойНаСтанции КАК ПростойНаСтанции,
		|	ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
		|	ДислокацияВагоновСрезПоследних.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном.Код КАК ОперацияСВагономКод
		|ПОМЕСТИТЬ вт_ТекущаяОперация0
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов.СрезПоследних(, Вагон В (&ВагоныРефСцепа)) КАК ДислокацияВагоновСрезПоследних
		|ГДЕ
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном.ИсключитьИзОтображенияПоследнихОпераций = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(вт_ТекущаяОперация0.Период) КАК Период,
		|	вт_ТекущаяОперация0.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ТекущаяОперацияМаксПериод
		|ИЗ
		|	вт_ТекущаяОперация0 КАК вт_ТекущаяОперация0
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТекущаяОперация0.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТекущаяОперация0.Период КАК Период,
		|	вт_ТекущаяОперация0.Вагон КАК Вагон,
		|	вт_ТекущаяОперация0.ОперацияСВагоном КАК ОперацияСВагоном,
		|	вт_ТекущаяОперация0.НомерПоезда КАК НомерПоезда,
		|	вт_ТекущаяОперация0.ИндексПоезда КАК ИндексПоезда,
		|	вт_ТекущаяОперация0.Собственник КАК Собственник,
		|	вт_ТекущаяОперация0.СтанцияОперации КАК СтанцияОперации,
		|	вт_ТекущаяОперация0.СтанцияНазначения КАК СтанцияНазначения,
		|	вт_ТекущаяОперация0.СтанцияОтправления КАК СтанцияОтправления,
		|	вт_ТекущаяОперация0.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
		|	вт_ТекущаяОперация0.ПростойНаСтанции КАК ПростойНаСтанции,
		|	вт_ТекущаяОперация0.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
		|	вт_ТекущаяОперация0.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ,
		|	вт_ТекущаяОперация0.ОперацияСВагономКод КАК ОперацияСВагономКод
		|ПОМЕСТИТЬ вт_ТекущаяОперация0ДоУдаленияДублейОпераций
		|ИЗ
		|	вт_ТекущаяОперация0 КАК вт_ТекущаяОперация0
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТекущаяОперацияМаксПериод КАК вт_ТекущаяОперацияМаксПериод
		|		ПО вт_ТекущаяОперация0.Вагон = вт_ТекущаяОперацияМаксПериод.Вагон
		|			И вт_ТекущаяОперация0.Период = вт_ТекущаяОперацияМаксПериод.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ТекущаяОперация0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ТекущаяОперацияМаксПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Вагон КАК Вагон,
		|	МАКСИМУМ(вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ОперацияСВагоном.Код) КАК ОперацияСВагономКод
		|ПОМЕСТИТЬ вт_ТекущаяОперацияМаксКодОперации
		|ИЗ
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций КАК вт_ТекущаяОперация0ДоУдаленияДублейОпераций
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Период КАК Период,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Вагон КАК Вагон,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ОперацияСВагоном КАК ОперацияСВагоном,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.НомерПоезда КАК НомерПоезда,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ИндексПоезда КАК ИндексПоезда,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Собственник КАК Собственник,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.СтанцияОперации КАК СтанцияОперации,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.СтанцияНазначения КАК СтанцияНазначения,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.СтанцияОтправления КАК СтанцияОтправления,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ПростойНаСтанции КАК ПростойНаСтанции,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ,
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ОперацияСВагономКод КАК ОперацияСВагономКод
		|ПОМЕСТИТЬ вт_ТекущаяОперация
		|ИЗ
		|	вт_ТекущаяОперация0ДоУдаленияДублейОпераций КАК вт_ТекущаяОперация0ДоУдаленияДублейОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТекущаяОперацияМаксКодОперации КАК вт_ТекущаяОперацияМаксКодОперации
		|		ПО вт_ТекущаяОперация0ДоУдаленияДублейОпераций.Вагон = вт_ТекущаяОперацияМаксКодОперации.Вагон
		|			И вт_ТекущаяОперация0ДоУдаленияДублейОпераций.ОперацияСВагоном.Код = вт_ТекущаяОперацияМаксКодОперации.ОперацияСВагономКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ТекущаяОперация0ДоУдаленияДублейОпераций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ТекущаяОперацияМаксКодОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДислокацияВагонов.Период КАК ПериодПредыдущейОперации,
		|	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагономПредыдущая,
		|	ДислокацияВагонов.СтанцияОперации КАК СтанцияПредыдущейОперации,
		|	ДислокацияВагонов.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ПредыдущаяОперация0
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТекущаяОперация КАК вт_ТекущаяОперация
		|		ПО ДислокацияВагонов.Вагон = вт_ТекущаяОперация.Вагон
		|			И (НЕ(ДислокацияВагонов.Вагон = вт_ТекущаяОперация.Вагон
		|					И ДислокацияВагонов.Период = вт_ТекущаяОперация.Период
		|					И ДислокацияВагонов.ОперацияСВагоном.Код = вт_ТекущаяОперация.ОперацияСВагономКод))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(вт_ПредыдущаяОперация0.ПериодПредыдущейОперации) КАК Период,
		|	вт_ПредыдущаяОперация0.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ПредыдущаяОперацияМаксПериод
		|ИЗ
		|	вт_ПредыдущаяОперация0 КАК вт_ПредыдущаяОперация0
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ПредыдущаяОперация0.Вагон
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ПредыдущаяОперация0.ПериодПредыдущейОперации КАК ПериодПредыдущейОперации,
		|	вт_ПредыдущаяОперация0.ОперацияСВагономПредыдущая КАК ОперацияСВагономПредыдущая,
		|	вт_ПредыдущаяОперация0.СтанцияПредыдущейОперации КАК СтанцияПредыдущейОперации,
		|	вт_ПредыдущаяОперация0.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ПредыдущаяОперация0ДоУдаленияДублейОпераций
		|ИЗ
		|	вт_ПредыдущаяОперация0 КАК вт_ПредыдущаяОперация0
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПредыдущаяОперацияМаксПериод КАК вт_ПредыдущаяОперацияМаксПериод
		|		ПО вт_ПредыдущаяОперация0.Вагон = вт_ПредыдущаяОперацияМаксПериод.Вагон
		|			И вт_ПредыдущаяОперация0.ПериодПредыдущейОперации = вт_ПредыдущаяОперацияМаксПериод.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ПредыдущаяОперация0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ вт_ПредыдущаяОперацияМаксПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(вт_ПредыдущаяОперация.ОперацияСВагономПредыдущая.Код) КАК ОперацияСВагономПредыдущаяКод,
		|	вт_ПредыдущаяОперация.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ПредыдущаяОперацияМаксКодОперации
		|ИЗ
		|	вт_ПредыдущаяОперация0ДоУдаленияДублейОпераций КАК вт_ПредыдущаяОперация
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ПредыдущаяОперация.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ПредыдущаяОперация0.ПериодПредыдущейОперации КАК ПериодПредыдущейОперации,
		|	вт_ПредыдущаяОперация0.ОперацияСВагономПредыдущая КАК ОперацияСВагономПредыдущая,
		|	вт_ПредыдущаяОперация0.СтанцияПредыдущейОперации КАК СтанцияПредыдущейОперации,
		|	вт_ПредыдущаяОперация0.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ПредыдущаяОперация
		|ИЗ
		|	вт_ПредыдущаяОперация0ДоУдаленияДублейОпераций КАК вт_ПредыдущаяОперация0
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПредыдущаяОперацияМаксКодОперации КАК вт_ПредыдущаяОперацияМаксКодОперации
		|		ПО вт_ПредыдущаяОперация0.Вагон = вт_ПредыдущаяОперацияМаксКодОперации.Вагон
		|			И вт_ПредыдущаяОперация0.ОперацияСВагономПредыдущая.Код = вт_ПредыдущаяОперацияМаксКодОперации.ОперацияСВагономПредыдущаяКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ВагоныВРефСцепах.Вагон КАК Вагон,
		|	вт_ВагоныВРефСцепах.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	вт_ВагоныВРефСцепах.ПризнакВагона КАК ПризнакВагона,
		|	вт_ВагоныВРефСцепах.Номер1Контроллера КАК Номер1Контроллера,
		|	вт_ВагоныВРефСцепах.Номер2Контроллера КАК Номер2Контроллера,
		|	вт_ВагоныВРефСцепах.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме,
		|	вт_ВагоныВРефСцепах.ЕстьВагонДокументаВБазе КАК ЕстьВагонДокументаВБазе,
		|	вт_ВагоныВРефСцепах.ПорядковыйНомерВСцепеРегистраНаФорме КАК ПорядковыйНомерВСцепеРегистраНаФорме,
		|	вт_ТекущаяОперация.Период КАК ДатаТекущейОперации,
		|	вт_ТекущаяОперация.ОперацияСВагоном КАК ТекущаяОперацияСВагоном,
		|	вт_ТекущаяОперация.ИндексПоезда КАК ИндексПоезда,
		|	вт_ТекущаяОперация.Собственник КАК Собственник,
		|	вт_ТекущаяОперация.СтанцияОперации КАК СтанцияТекущейОперации,
		|	вт_ТекущаяОперация.ПростойНаСтанции КАК ПростойНаСтанции,
		|	вт_ТекущаяОперация.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояние,
		|	вт_ПредыдущаяОперация.ПериодПредыдущейОперации КАК ДатаПредыдущейОперации,
		|	вт_ПредыдущаяОперация.ОперацияСВагономПредыдущая КАК ПредыдущаяОперацияСВагоном,
		|	вт_ПредыдущаяОперация.СтанцияПредыдущейОперации КАК СтанцияПредыдущейОперации,
		|	Локации.ЖелезнаяДорога КАК ДорогаТекущейОперации,
		|	Локации1.ЖелезнаяДорога КАК ДорогаПредыдущейОперации,
		|	РАЗНОСТЬДАТ(вт_ПредыдущаяОперация.ПериодПредыдущейОперации, вт_ТекущаяОперация.Период, ДЕНЬ) КАК ПериодМеждуОперациями,
		|	ВЫБОР
		|		КОГДА вт_ТекущаяОперация.ОперацияСВагоном.Код В (&КодыОперацийСВагономСПризнакомНеисправен)
		|			ТОГДА ""Неисправен""
		|		ИНАЧЕ ""Исправен""
		|	КОНЕЦ КАК ТехСостояниеВагона
		|ИЗ
		|	вт_ВагоныВРефСцепах КАК вт_ВагоныВРефСцепах
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТекущаяОперация КАК вт_ТекущаяОперация
		|		ПО вт_ВагоныВРефСцепах.Вагон = вт_ТекущаяОперация.Вагон
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПредыдущаяОперация КАК вт_ПредыдущаяОперация
		|		ПО вт_ВагоныВРефСцепах.Вагон = вт_ПредыдущаяОперация.Вагон
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
		|		ПО (вт_ТекущаяОперация.СтанцияОперации = Локации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации1
		|		ПО (вт_ПредыдущаяОперация.СтанцияПредыдущейОперации = Локации1.Ссылка)";
	
	Запрос.УстановитьПараметр("ДанныеПоВагонамРефСцепа", ДанныеПоВагонамРефСцепа);
	Запрос.УстановитьПараметр("ВагоныРефСцепа", ДанныеПоВагонамРефСцепа.ВыгрузитьКолонку("Вагон"));
	
	КодыОперацийСВагономСПризнакомНеисправен = СтрРазделить(Константы.КодыОперацийСВагономСПризнакомНеисправен.Получить(), ","); 
	
	Запрос.УстановитьПараметр("КодыОперацийСВагономСПризнакомНеисправен"
			, КодыОперацийСВагономСПризнакомНеисправен);
		
	Возврат Запрос.Выполнить().Выгрузить();    
	
КонецФункции

Функция ПолучитьДанныеДГКВагоновРефСцепа(ДанныеПоВагонамРефСцепа, РефСцеп) Экспорт
	Если ДанныеПоВагонамРефСцепа.Количество() = 0 Тогда
		Возврат неопределено;
	КонецЕсли;
	РефСцепНаименование = ОБщегоНазначения.ЗначениеРеквизитаОбъекта(РефСцеп,"Наименование");
	
	Результат = ПолучитьДГККонтейнер(ДанныеПоВагонамРефСцепа, РефСцеп, РефСцепНаименование);
	тзРезультат = Результат.Выгрузить();
	Для Каждого Выборка из тзРезультат Цикл
		Если Выборка.Вагон = Справочники.ТС.ПустаяСсылка() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		
		Если Выборка.Контейнер <> Справочники.ТЕ.ПустаяСсылка() Тогда
			Возврат Результат.Выбрать();
		Иначе
			НайтиСоздатьДГККонтейнер(ДанныеПоВагонамРефСцепа, РефСцеп, РефСцепНаименование);			
			Возврат ПолучитьДГККонтейнер(ДанныеПоВагонамРефСцепа, РефСцеп, РефСцепНаименование).Выбрать();
		КонецЕсли;
	КонецЦикла;    
    Возврат Неопределено;
КонецФункции 

Функция ПолучитьДГККонтейнер(ДанныеПоВагонамРефСцепа, РефСцеп, РефСцепНаименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВагоныВРефСцепах.Вагон КАК Вагон,
		|	ВагоныВРефСцепах.ПризнакВагона КАК ПризнакВагона,
		|	ИСТИНА КАК ЭтоКонтейнерСДГК
		|ПОМЕСТИТЬ вт_ВагоныВРефСцепах
		|ИЗ
		|	&ДанныеПоВагонамРефСцепа КАК ВагоныВРефСцепах
		|ГДЕ
		|	ВагоныВРефСцепах.ПризнакВагона = 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЕ.Ссылка КАК Контейнер
		|ПОМЕСТИТЬ вт_ДГК
		|ИЗ
		|	Справочник.ТЕ КАК ТЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|		ПО (ТЕ.ТипТЕ = &ТипDG)
		|ГДЕ
		//|	ТЕ.Префикс = &Префикс
		//|	И ПОДСТРОКА(ТЕ.Номер, 3, 4) = &НомерРефСцепа
		|   ТЕ.Наименование = &НаименованиеКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(вт_ДГК.Контейнер, ЗНАЧЕНИЕ(Справочник.ТЕ.Пустаяссылка)) КАК Контейнер,
		|	ЕСТЬNULL(вт_ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.Пустаяссылка)) КАК Вагон,
		|	вт_ВагоныВРефСцепах.ПризнакВагона КАК ПризнакВагона,
		|	вт_ВагоныВРефСцепах.ЭтоКонтейнерСДГК КАК ЭтоКонтейнерСДГК
		|ИЗ
		|	вт_ВагоныВРефСцепах КАК вт_ВагоныВРефСцепах
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДГК КАК вт_ДГК
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ДГК.Контейнер,
		|	вт_ВагоныВРефСцепах.Вагон,
		|	вт_ВагоныВРефСцепах.ПризнакВагона,
		|	вт_ВагоныВРефСцепах.ЭтоКонтейнерСДГК";

	РефСцепНаименование = Рефсцеп.Наименование;	
	Запрос.УстановитьПараметр("ДанныеПоВагонамРефСцепа", ДанныеПоВагонамРефСцепа);
	НаименованиеКТК = "ETSU" + Формат(Число(СокрЛП(РефСцепНаименование)), "ЧЦ=7; ЧВН=; ЧГ=0");
	//Запрос.УстановитьПараметр("НомерРефСцепа", РефСцепНаименование);
	Запрос.УстановитьПараметр("НаименованиеКТК", НаименованиеКТК);
	Запрос.УстановитьПараметр("ТипDG", Справочники.ТипоразмерыТЕ.Тип40DG);
	Запрос.УстановитьПараметр("Префикс", "ETSU"); 
	// Пункт 4.4
	
	Возврат Запрос.Выполнить();

КонецФункции	

Процедура НайтиСоздатьДГККонтейнер(ДанныеПоВагонамРефСцепа, РефСцеп, РефСцепНаименование)
	
	ТипТЕ	 = Справочники.ТипоразмерыТЕ.Тип40DG;
	НомерКТК = "ETSU" + Формат(Число(СокрЛП(РефСцепНаименование)), "ЧЦ=7; ЧВН=; ЧГ=0");
	
	КонтейнерПроверки = Справочники.ТЕ.НайтиПоНаименованию(НомерКТК);
	Если КонтейнерПроверки = Справочники.ТЕ.ПустаяСсылка() Тогда

		НовыйДГККонтейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(ВРег(НомерКТК), ТипТЕ);
		
		ДобавлениеПризнаковКонтейнера(НовыйДГККонтейнер.Ссылка);
		
		ПолучитьДанныеДГКВагоновРефСцепа(ДанныеПоВагонамРефСцепа, РефСцеп);
		
	Иначе
		Если КонтейнерПроверки <> Справочники.ТипоразмерыТЕ.Тип40DG Тогда 
			Попытка
				ОбъектКонтейнерПроверки 	  = КонтейнерПроверки.ПолучитьОбъект();
				ОбъектКонтейнерПроверки.ТипТЕ = Справочники.ТипоразмерыТЕ.Тип40DG;
                ОбъектКонтейнерПроверки.Записать();
			Исключение	
			КонецПопытки;

			РаботаСКонтейнерамиСервер.ПодготовитьЗаписьДляИсточникаСоздания(КонтейнерПроверки.Ссылка);
			
			ДобавлениепризнаковКонтейнера(ОбъектКонтейнерПроверки.Ссылка);						
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьДанныеПоВагонамРефСцепаРегистра(РефСцеп) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВагоныВРефСцепах.Вагон КАК Вагон,
		|	ВагоныВРефСцепах.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	ВагоныВРефСцепах.ПризнакВагона КАК ПризнакВагона,
		|	ВагоныВРефСцепах.Номер1Контроллера КАК Номер1Контроллера,
		|	ВагоныВРефСцепах.Номер2Контроллера КАК Номер2Контроллера,
		|	ВагоныВРефСцепах.EmailОтвтетственного КАК EmailОтвтетственного,
		|	ВагоныВРефСцепах.РефСцеп КАК РефСцеп,
		|	ВЫБОР
		|		КОГДА ВагоныВРефСцепах.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВагонВРегистреНаФорме,
		|	ВЫБОР
		|		КОГДА ВагоныВРефСцепах.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВагонДокументаВБазе,
		|	ВагоныВРефСцепах.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепеРегистраНаФорме
		|ИЗ
		|	РегистрСведений.ВагоныВРефСцепах КАК ВагоныВРефСцепах
		|ГДЕ
		|	ВагоныВРефСцепах.РефСцеп = &РефСцеп
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомерВСцепе";
	Запрос.УстановитьПараметр("РефСцеп", РефСцеп);
	
	Возврат Запрос.Выполнить().Выгрузить();    
	
КонецФункции

Функция ПолучитьДанныеРегистраИДокумента(РефСцеп, тзДанныеТЧВагоныДокументаФормы, ЭтоОбновлениеДанныхИзРегистра, Ссылка) Экспорт
	
	тзДанныеРегистраРефСцеп = ПолучитьДанныеПоВагонамРефСцепаРегистра(РефСцеп);
	
	Для каждого СтрДокумента из тзДанныеТЧВагоныДокументаФормы Цикл
		
		СтрокаРегистраРефСцепа = тзДанныеРегистраРефСцеп.Найти(СтрДокумента.Вагон); 
		Если СтрокаРегистраРефСцепа <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрДокумента, 
				СтрокаРегистраРефСцепа, , "ПорядковыйНомерВСцепе"); 
		КонецЕсли;		
		
	КонецЦикла;
	
	Если тзДанныеРегистраРефСцеп.Количество() = 0 Тогда
		
		тзДанныеТЧВагоныДокументаФормы.ЗаполнитьЗначения(Ложь, "ЕстьВагонВРегистреНаФорме");
		
    КонецЕсли;
	
	// данные по документу в базе
	Если ЭтоОбновлениеДанныхИзРегистра Тогда
		
		Для каждого СтрРегистра из тзДанныеРегистраРефСцеп Цикл
			
			Если тзДанныеТЧВагоныДокументаФормы.Найти(СтрРегистра.Вагон) = неопределено Тогда
				ЗаполнитьЗначенияСвойств(тзДанныеТЧВагоныДокументаФормы.Добавить(), СтрРегистра);  
			КонецЕсли;
			
		КонецЦикла;	
		
		ДанныеПоВагонамВБазе = ПолучитьДанныеДокументаВБазе(Ссылка);
		
		Для каждого стр из тзДанныеРегистраРефСцеп Цикл 
			
			Если ДанныеПоВагонамВБазе.Найти(стр.Вагон, "Вагон") = неопределено Тогда
				
				// Если нет в данных документа в базе, отмечаем
				
				мСтрокДанныеТЧВагоныДокументаФормы = тзДанныеТЧВагоныДокументаФормы
					.НайтиСтроки(Новый Структура("Вагон", стр.Вагон));				
					
				Для каждого СтрТЧВагоны из мСтрокДанныеТЧВагоныДокументаФормы Цикл
					СтрТЧВагоны.ЕстьВагонДокументаВБазе = Ложь;
				КонецЦикла;	
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат тзДанныеТЧВагоныДокументаФормы;    
	
КонецФункции

Функция ПолучитьДанныеДокументаВБазе(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Вагон КАК Вагон,
		|	РефСцепВагоныРефСцепа.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РефСцепВагоныРефСцепа.Вагон,
		|	РефСцепВагоныРефСцепа.ПорядковыйНомерВСцепе
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомерВСцепе";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьДанныеФормыРегистраБазыДокумента
	(тзДанныеРефСцепаДокумента
	,РефСцеп 
	,ЭтоОбновлениеДанныхИзРегистра = Истина
	,Ссылка) Экспорт
	
	тзДанныеРефСцепаДокумента.ЗаполнитьЗначения
		(не ЭтоОбновлениеДанныхИзРегистра, "ЕстьВагонВРегистреНаФорме");
	тзДанныеРефСцепаДокумента.ЗаполнитьЗначения
		(Истина, "ЕстьВагонДокументаВБазе");
	
	тзДанныеРефСцепаДокументаИРегистра = ПолучитьДанныеРегистраИДокумента(РефСцеп
		, тзДанныеРефСцепаДокумента, ЭтоОбновлениеДанныхИзРегистра, Ссылка);
	
	тзДанныеРефСцепаДокументаИРегистраДляДислокации = тзДанныеРефСцепаДокументаИРегистра.Скопировать(,"Вагон,
			|ПорядковыйНомерВСцепе,
			|ПризнакВагона,
			|Номер1Контроллера,
			|Номер2Контроллера,
			|ЕстьВагонВРегистреНаФорме,
			|ЕстьВагонДокументаВБазе,
			|ПорядковыйНомерВСцепеРегистраНаФорме");
	
	тзДанныеРефСцепаДокументаИРегистраДляДислокации.Свернуть("Вагон,
			|ПорядковыйНомерВСцепе,
			|ПризнакВагона,
			|Номер1Контроллера,
			|Номер2Контроллера,
			|ЕстьВагонВРегистреНаФорме,
			|ЕстьВагонДокументаВБазе,
			|ПорядковыйНомерВСцепеРегистраНаФорме");
	
	тзДислокацииВагонов = ПолучитьДанныеДислокацииВагоновРефСцепа(
	 	тзДанныеРефСцепаДокументаИРегистраДляДислокации);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тз_Дислокация.Вагон КАК Вагон,
		|	тз_Дислокация.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	тз_Дислокация.ПризнакВагона КАК ПризнакВагона,
		|	тз_Дислокация.Номер1Контроллера КАК Номер1Контроллера,
		|	тз_Дислокация.Номер2Контроллера КАК Номер2Контроллера,
		|	тз_Дислокация.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме,
		|	тз_Дислокация.ЕстьВагонДокументаВБазе КАК ЕстьВагонДокументаВБазе,
		|	тз_Дислокация.ПорядковыйНомерВСцепеРегистраНаФорме КАК ПорядковыйНомерВСцепеРегистраНаФорме,
		|	тз_Дислокация.ДатаТекущейОперации КАК ДатаТекущейОперации,
		|	тз_Дислокация.ТекущаяОперацияСВагоном КАК ТекущаяОперацияСВагоном,
		|	тз_Дислокация.ИндексПоезда КАК ИндексПоезда,
		|	тз_Дислокация.Собственник КАК Собственник,
		|	тз_Дислокация.СтанцияТекущейОперации КАК СтанцияТекущейОперации,
		|	тз_Дислокация.ПростойНаСтанции КАК ПростойНаСтанции,
		|	тз_Дислокация.ОстаточноеРасстояние КАК ОстаточноеРасстояние,
		|	тз_Дислокация.ДатаПредыдущейОперации КАК ДатаПредыдущейОперации,
		|	тз_Дислокация.ПредыдущаяОперацияСВагоном КАК ПредыдущаяОперацияСВагоном,
		|	тз_Дислокация.СтанцияПредыдущейОперации КАК СтанцияПредыдущейОперации,
		|	тз_Дислокация.ДорогаТекущейОперации КАК ДорогаТекущейОперации,
		|	тз_Дислокация.ДорогаПредыдущейОперации КАК ДорогаПредыдущейОперации,
		|	тз_Дислокация.ПериодМеждуОперациями КАК ПериодМеждуОперациями,
		|	тз_Дислокация.ТехСостояниеВагона КАК ТехСостояниеВагона
		|ПОМЕСТИТЬ вт_Дислокация
		|ИЗ
		|	&тз_Дислокация КАК тз_Дислокация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тз_ВагоныРефСцепаДокумента.Вагон КАК Вагон,
		|	тз_ВагоныРефСцепаДокумента.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	тз_ВагоныРефСцепаДокумента.ПотребовалсяПодсылПорожнегоВагона КАК ПотребовалсяПодсылПорожнегоВагона,
		|	тз_ВагоныРефСцепаДокумента.СтанцияОтправленияПодсыла КАК СтанцияОтправленияПодсыла,
		|	тз_ВагоныРефСцепаДокумента.ЖДНакладная КАК ЖДНакладная,
		|	тз_ВагоныРефСцепаДокумента.Контейнер КАК Контейнер,
		|	тз_ВагоныРефСцепаДокумента.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	тз_ВагоныРефСцепаДокумента.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	тз_ВагоныРефСцепаДокумента.Груз КАК Груз,
		|	тз_ВагоныРефСцепаДокумента.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	тз_ВагоныРефСцепаДокумента.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	тз_ВагоныРефСцепаДокумента.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	тз_ВагоныРефСцепаДокумента.Клиент КАК Клиент,
		|	тз_ВагоныРефСцепаДокумента.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	тз_ВагоныРефСцепаДокумента.ДопИнформация КАК ДопИнформация,
		|	тз_ВагоныРефСцепаДокумента.Ответственный КАК Ответственный,
		|	тз_ВагоныРефСцепаДокумента.ЭтоКонтейнерСДГК КАК ЭтоКонтейнерСДГК,
		|	тз_ВагоныРефСцепаДокумента.ЭтоТанкКонтейнер КАК ЭтоТанкКонтейнер,
		|	тз_ВагоныРефСцепаДокумента.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	тз_ВагоныРефСцепаДокумента.Отметка КАК Отметка
		|ПОМЕСТИТЬ вт_ВагоныРефСцепаДокумента
		|ИЗ
		|	&тзДанныеРефСцепаДокумента КАК тз_ВагоныРефСцепаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(вт_Дислокация.Вагон, вт_ВагоныРефСцепаДокумента.Вагон) КАК Вагон,
		|	вт_ВагоныРефСцепаДокумента.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	вт_ВагоныРефСцепаДокумента.ПотребовалсяПодсылПорожнегоВагона КАК ПотребовалсяПодсылПорожнегоВагона,
		|	вт_ВагоныРефСцепаДокумента.СтанцияОтправленияПодсыла КАК СтанцияОтправленияПодсыла,
		|	вт_ВагоныРефСцепаДокумента.ЖДНакладная КАК ЖДНакладная,
		|	вт_ВагоныРефСцепаДокумента.Контейнер КАК Контейнер,
		|	вт_ВагоныРефСцепаДокумента.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	вт_ВагоныРефСцепаДокумента.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_ВагоныРефСцепаДокумента.Груз КАК Груз,
		|	вт_ВагоныРефСцепаДокумента.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_ВагоныРефСцепаДокумента.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	вт_ВагоныРефСцепаДокумента.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	вт_ВагоныРефСцепаДокумента.Клиент КАК Клиент,
		|	вт_ВагоныРефСцепаДокумента.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	вт_ВагоныРефСцепаДокумента.ДопИнформация КАК ДопИнформация,
		|	вт_ВагоныРефСцепаДокумента.Ответственный КАК Ответственный,
		|	вт_ВагоныРефСцепаДокумента.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_ВагоныРефСцепаДокумента.Отметка КАК Отметка,
		|	ЕСТЬNULL(вт_Дислокация.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК ВагонВРегистре,
		|	ЕСТЬNULL(вт_Дислокация.ПорядковыйНомерВСцепе, 0) КАК ПорядковыйНомерВСцепеВРегистре,
		|	вт_Дислокация.ПризнакВагона КАК ПризнакВагона,
		|	вт_Дислокация.Номер1Контроллера КАК Номер1Контроллера,
		|	вт_Дислокация.Номер2Контроллера КАК Номер2Контроллера,
		|	вт_Дислокация.ЕстьВагонВРегистреНаФорме КАК ЕстьВагонВРегистреНаФорме,
		|	вт_Дислокация.ЕстьВагонДокументаВБазе КАК ЕстьВагонДокументаВБазе,
		|	вт_Дислокация.ПорядковыйНомерВСцепеРегистраНаФорме КАК ПорядковыйНомерВСцепеРегистраНаФорме,
		|	вт_Дислокация.ДатаТекущейОперации КАК ДатаТекущейОперации,
		|	вт_Дислокация.ТекущаяОперацияСВагоном КАК ТекущаяОперацияСВагоном,
		|	вт_Дислокация.ИндексПоезда КАК ИндексПоезда,
		|	вт_Дислокация.Собственник КАК Собственник,
		|	вт_Дислокация.СтанцияТекущейОперации КАК СтанцияТекущейОперации,
		|	вт_Дислокация.ПростойНаСтанции КАК ПростойНаСтанции,
		|	вт_Дислокация.ОстаточноеРасстояние КАК ОстаточноеРасстояние,
		|	вт_Дислокация.ДатаПредыдущейОперации КАК ДатаПредыдущейОперации,
		|	вт_Дислокация.ПредыдущаяОперацияСВагоном КАК ПредыдущаяОперацияСВагоном,
		|	вт_Дислокация.СтанцияПредыдущейОперации КАК СтанцияПредыдущейОперации,
		|	вт_Дислокация.ДорогаТекущейОперации КАК ДорогаТекущейОперации,
		|	вт_Дислокация.ДорогаПредыдущейОперации КАК ДорогаПредыдущейОперации,
		|	вт_Дислокация.ПериодМеждуОперациями КАК ПериодМеждуОперациями,
		|	вт_Дислокация.ТехСостояниеВагона КАК ТехСостояниеВагона,
		|	вт_ВагоныРефСцепаДокумента.ЭтоКонтейнерСДГК КАК ЭтоКонтейнерСДГК,
		|	вт_ВагоныРефСцепаДокумента.ЭтоТанкКонтейнер КАК ЭтоТанкКонтейнер
		|ИЗ
		|	вт_Дислокация КАК вт_Дислокация
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВагоныРефСцепаДокумента КАК вт_ВагоныРефСцепаДокумента
		|		ПО вт_Дислокация.Вагон = вт_ВагоныРефСцепаДокумента.Вагон";
	 
	Запрос.УстановитьПараметр("тз_Дислокация", тзДислокацииВагонов);
	Запрос.УстановитьПараметр("тзДанныеРефСцепаДокумента", тзДанныеРефСцепаДокументаИРегистра);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОпределитьПоздниеФактическиеДатыСпискаЖДН(ВсеЖДН) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ТранспортныйДокумент.ЖДНакладная КАК Документ.ТранспортныйДокумент) КАК ТранспортныйДок,
	               |	ТранспортныйДокумент.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВхЖДН
	               |ИЗ
	               |	&ВсеЖДН КАК ТранспортныйДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВхЖДН.ТранспортныйДок.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	               |	ВхЖДН.ТранспортныйДок КАК ТранспортныйДок,
	               |	ВхЖДН.Сделка КАК Сделка
	               |ПОМЕСТИТЬ вт_ФактОтправление
	               |ИЗ
	               |	ВхЖДН КАК ВхЖДН
	               |ГДЕ
	               |	ВхЖДН.ТранспортныйДок.НакладнаяЭТРАН <> ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИВремяОтправленияГруза УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВхЖДН.ТранспортныйДок.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяПрибытияГрузаМестная,
	               |	ВхЖДН.ТранспортныйДок КАК ТранспортныйДок,
	               |	ВхЖДН.Сделка КАК Сделка
	               |ПОМЕСТИТЬ вт_ФактПрибытие
	               |ИЗ
	               |	ВхЖДН КАК ВхЖДН
	               |ГДЕ
	               |	ВхЖДН.ТранспортныйДок.НакладнаяЭТРАН <> ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИВремяПрибытияГрузаМестная УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_ФактОтправление.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	               |	вт_ФактПрибытие.ДатаИВремяПрибытияГрузаМестная КАК ДатаИВремяПрибытияГрузаМестная,
	               |	вт_ФактОтправление.ТранспортныйДок КАК ТранспортныйДокумент,
	               |	вт_ФактОтправление.Сделка КАК Сделка
	               |ИЗ
	               |	вт_ФактОтправление КАК вт_ФактОтправление
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ФактПрибытие КАК вт_ФактПрибытие
	               |		ПО вт_ФактОтправление.ДатаИВремяОтправленияГруза <> вт_ФактПрибытие.ДатаИВремяПрибытияГрузаМестная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ФактОтправление.ДатаИВремяОтправленияГруза,
	               |	вт_ФактПрибытие.ДатаИВремяПрибытияГрузаМестная,
	               |	вт_ФактОтправление.ТранспортныйДок,
	               |	вт_ФактОтправление.Сделка";
	
	Запрос.УстановитьПараметр("ВсеЖДН", ВсеЖДН);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьЖДНСделкиПоРейсу(Рейс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДНакладная,
		|	СделкаРейсы.Ссылка КАК Сделка
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
		|		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаРейсы.Ссылка
		|			И (СделкаРейсы.Рейс = &Рейс)";
	
	Запрос.УстановитьПараметр("Рейс",Рейс);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьЖДНПодсылаПорожнегоВагона() Экспорт
	
	ПодборЖДНПодсыловВРефСцепы(0,"");	
	
КонецФункции	

Процедура ПодборЖДНПодсыловВРефСцепы(КоличествоСделок = 0, АдресРезультата) Экспорт 
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументРефСцеп.Ссылка КАК РефСцеп,
	|	ДокументРефСцеп.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_РефСцепыДляПодбора_сУчетомРейсов
	|ИЗ
	|	Документ.РефСцеп КАК ДокументРефСцеп
	|ГДЕ
	|	ДокументРефСцеп.РейсЗавершен = ЛОЖЬ
	|	И ДокументРефСцеп.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_РефСцепыДляПодбора_сУчетомРейсов.РефСцеп КАК РефСцеп,
	|	ЕСТЬNULL(ПротоколПодбораЖДНВСделкиСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПодбора,
	|	ВТ_РефСцепыДляПодбора_сУчетомРейсов.Дата КАК Дата
	|ПОМЕСТИТЬ вт_РефСцепыКОбработке
	|ИЗ
	|	ВТ_РефСцепыДляПодбора_сУчетомРейсов КАК ВТ_РефСцепыДляПодбора_сУчетомРейсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколАвтоподбораЖДНПодсыловВРефСцепы.СрезПоследних КАК ПротоколПодбораЖДНВСделкиСрезПоследних
	|		ПО ВТ_РефСцепыДляПодбора_сУчетомРейсов.РефСцеп = ПротоколПодбораЖДНВСделкиСрезПоследних.РефСцеп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_РефСцепыКОбработке.РефСцеп КАК РефСцеп,
	|	вт_РефСцепыКОбработке.ДатаПодбора КАК ДатаПодбора,
	|	вт_РефСцепыКОбработке.Дата КАК Дата
	|ИЗ
	|	вт_РефСцепыКОбработке КАК вт_РефСцепыКОбработке
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт_РефСцепыКОбработке.ДатаПодбора,
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РефСцепВагоныРефСцепа.Вагон.Наименование КАК НомерВагона,
	|	РефСцепВагоныРефСцепа.Ссылка.ФактическоеОтправление КАК ФактическоеОтправление,
	|	вт_РефСцепыКОбработке.РефСцеп КАК РефСцеп,
	|	РефСцепВагоныРефСцепа.Ссылка.СтанцияОтправления.КодЖДСтанции КАК КодЖДСтанции,
	|	РефСцепВагоныРефСцепа.Вагон КАК Вагон,
	|	РефСцепВагоныРефСцепа.Ссылка.ПланируемоеОтправление КАК ПланируемоеОтправление
	|ИЗ
	|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РефСцепыКОбработке КАК вт_РефСцепыКОбработке
	|		ПО РефСцепВагоныРефСцепа.Ссылка = вт_РефСцепыКОбработке.РефСцеп";
	
	
	Если КоличествоСделок = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", СтрШаблон("ПЕРВЫЕ %1", КоличествоСделок));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[2].Пустой() Тогда
		Возврат;
	КонецЕсли;       
	Выборка 						  = РезультатЗапроса[2].Выбрать();
	тзДанныеДокументаВагоны 		  = РезультатЗапроса[3].Выгрузить();
	
	МассивОтработанныхДокументов = Новый Массив;
	ВсегоРефСцепов = Выборка.Количество();     
	Итератор 	   = 0;
	МассивОшибок   = Новый Массив;
	Пока Выборка.Следующий() Цикл           
		Итератор = Итератор + 1;
		Попытка
			ОбъектРефСцеп = Выборка.РефСцеп.ПолучитьОбъект();                
		Исключение
			Продолжить;
		КонецПопытки;	
		ГоризонтПоискаНакладных = 40;
		ТаблицаДоИзменений 		= ОбъектРефСцеп.ВагоныРефСцепа.Выгрузить();
		
		СтруктураТЧВагоныСПодсыламиЖДН = ПолучитьТЧВагоныСПодсыламиЖДН(
			тзДанныеДокументаВагоны, ТаблицаДоИзменений, Выборка.РефСцеп);
			
		// Добавил проведение в попытку, т.к. мог возникать конфликт блокировок.
		// Ошибки собираем в массив, чтобы после выполнения задания отправить их на почту.
		Попытка 
			Если СтруктураТЧВагоныСПодсыламиЖДН.ФлагНаличияИзменений Тогда
				ОбъектРефСцеп.ВагоныРефсцепа.Загрузить(СтруктураТЧВагоныСПодсыламиЖДН.ТаблицаДоИзменений);
				ОбъектРефСцеп.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			МассивОтработанныхДокументов.Добавить(Выборка.РефСцеп);
			РегистрыСведений.ПротоколАвтоподбораЖДНПодсыловВРефСцепы.ДобавитьЗапись(Выборка.РефСцеп);
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ПодборЖДННакладныхВСделки.Проведение сделки",
    												УровеньЖурналаРегистрации.Предупреждение,, Выборка.РефСцеп, ПредставлениеОшибки);
			МассивОшибок.Добавить("" + Выборка.РефСцеп + ": " + ПредставлениеОшибки);
		КонецПопытки;
		ДлительныеОперации.СообщитьПрогресс(Итератор/ВсегоРефСцепов * 100, Выборка.РефСцеп); 
	КонецЦикла;                                           
	ПоместитьВоВременноеХранилище(МассивОтработанныхДокументов, АдресРезультата);
	РаботаСоСделкамиСервер.ОчиститьОчередьОтложенногоИзменения(МассивОтработанныхДокументов); //ДИТ Шевченко А.В. 55599 23.01.2023
	Если МассивОшибок.Количество() > 0 Тогда
		Тема = "Рег. задание: Подбор ЖДН накладных подсыла порожнего вагона в сделки";
		ТекстСообщения = "Во время выполнения рег. задания произошли следующие ошибки:
						|" + СтрСоединить(МассивОшибок, Символы.ПС);
		РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ПодборЖДНПодсыловВРефСцепы);
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьТЧВагоныСПодсыламиЖДН(тзДанныеДокументаВагоны, ТаблицаДоИзменений, РефСцеп) Экспорт
	
    ФлагНаличияИзменений 	= Ложь;
	мДанныеДокументаВагоны = тзДанныеДокументаВагоны.НайтиСтроки(Новый Структура("РефСцеп", РефСцеп));
	Для каждого ДанныеДокументаВагоны из мДанныеДокументаВагоны Цикл
		СтруктураВагоннаяЖДН = РаботаСоСделкамиСервер.НайтиПодсылПорожнегоВагонаПоЭТРАН(
									ДанныеДокументаВагоны.НомерВагона,
									?(ДанныеДокументаВагоны.ФактическоеОтправление = Дата(1,1,1)
										, ДанныеДокументаВагоны.ПланируемоеОтправление 
										, ДанныеДокументаВагоны.ФактическоеОтправление),
									ДанныеДокументаВагоны.КодЖДСтанции,
									40); 
		ПустаяЖДН = Документы.ТранспортныйДокумент.ПустаяСсылка();							
		
		СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка = 
			?(СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка = Неопределено, ПустаяЖДН
			, СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка); 
										
		Если СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка <> ПустаяЖДН Тогда
			
			СтруктураВагоннаяЖДН.Вставить("ТранспортнаяНакладная"
				, ТранспортныеДокументы_сервер.НайтиЖДНПоНомеру(СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка));
			
			мДанныеДокументаВагоныТЧ = ТаблицаДоИзменений.НайтиСтроки(Новый Структура("Вагон"
				, ДанныеДокументаВагоны.Вагон));
			Для каждого ДанныеДокументаВагонаТЧ из мДанныеДокументаВагоныТЧ Цикл
				Если ДанныеДокументаВагонаТЧ.ЖДНакладная <> СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка Тогда
					ДанныеДокументаВагонаТЧ.ЖДНакладная 					   = СтруктураВагоннаяЖДН.ТранспортнаяНакладная;							
					ДанныеДокументаВагонаТЧ.ПотребовалсяПодсылПорожнегоВагона  = Истина;
					ДанныеДокументаВагонаТЧ.СтанцияОтправленияПодсыла		   
						= СтруктураВагоннаяЖДН.ТранспортнаяНакладная.СтанцияОтправления;							
					ФлагНаличияИзменений 									   = Истина;
				КонецЕсли;	
			КонецЦикла;								
		ИначеЕсли  СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка = ПустаяЖДН Тогда
			мДанныеДокументаВагоныТЧ = ТаблицаДоИзменений.НайтиСтроки(Новый Структура("Вагон"
				, ДанныеДокументаВагоны.Вагон));
			Для каждого ДанныеДокументаВагонаТЧ из мДанныеДокументаВагоныТЧ Цикл
				Если ДанныеДокументаВагонаТЧ.ЖДНакладная <> СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка
					и (не ДанныеДокументаВагонаТЧ.ЭтоРучноеИзменениеПодсылаЖДН)  Тогда
					ДанныеДокументаВагонаТЧ.ЖДНакладная 					   = Неопределено;							
					ДанныеДокументаВагонаТЧ.СтанцияОтправленияПодсыла		   = Неопределено;							
					ДанныеДокументаВагонаТЧ.ПотребовалсяПодсылПорожнегоВагона = Ложь;
					ФлагНаличияИзменений 									   = Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаДоИзменений, ФлагНаличияИзменений", ТаблицаДоИзменений, ФлагНаличияИзменений)

КонецФункции

Функция ПолучитьДанныеПревышенияПоТЕУ(тзВагоны) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вт_ВагоныИКонтейнеры.Вагон КАК Вагон,
		|	Вт_ВагоныИКонтейнеры.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ Вт_ВагоныИКонтейнеры1
		|ИЗ
		|	&тзВагоны КАК Вт_ВагоныИКонтейнеры
		|ГДЕ
		|	Вт_ВагоныИКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ВагоныИКонтейнеры.Вагон КАК Вагон,
		|	Вт_ВагоныИКонтейнеры.Контейнер КАК Контейнер,
		|	Контейнеры.ТипТЕ КАК ТипТЕ,
		|	Вагоны.ТипТС КАК ТипТС
		|ПОМЕСТИТЬ Вт_ВагоныИКонтейнеры0
		|ИЗ
		|	Вт_ВагоныИКонтейнеры1 КАК Вт_ВагоныИКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК Контейнеры
		|		ПО Вт_ВагоныИКонтейнеры.Контейнер = Контейнеры.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК Вагоны
		|		ПО Вт_ВагоныИКонтейнеры.Вагон = Вагоны.Ссылка
		|ГДЕ
		|	Вт_ВагоныИКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ВагоныИКонтейнеры.Вагон КАК Вагон,
		|	Вт_ВагоныИКонтейнеры.Контейнер КАК Контейнер,
		|	Вт_ВагоныИКонтейнеры.ТипТЕ КАК ТипТЕ,
		|	Вт_ВагоныИКонтейнеры.ТипТС КАК ТипТС,
		|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
		|	ТипоразмерыТС.ТЕУ КАК ВагонРазмерВТЕУ
		|ПОМЕСТИТЬ Вт_ВагоныИКонтейнеры
		|ИЗ
		|	Вт_ВагоныИКонтейнеры0 КАК Вт_ВагоныИКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|		ПО Вт_ВагоныИКонтейнеры.ТипТЕ = ТипоразмерыТЕ.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
		|		ПО Вт_ВагоныИКонтейнеры.ТипТС = ТипоразмерыТС.Ссылка
		|ГДЕ
		|	Вт_ВагоныИКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ВагоныИКонтейнеры.Вагон КАК Вагон,
		|	ВЫБОР
		|		КОГДА Вт_ВагоныИКонтейнеры.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА 1
		|		КОГДА Вт_ВагоныИКонтейнеры.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|			ТОГДА 2
		|		КОГДА Вт_ВагоныИКонтейнеры.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К45)
		|			ТОГДА 2
		|	КОНЕЦ КАК РазмерКТКвТЭУ,
		|	Вт_ВагоныИКонтейнеры.ВагонРазмерВТЕУ КАК ВагонРазмерВТЕУ
		|ПОМЕСТИТЬ вт_ТипоразмерыКонтейнеров
		|ИЗ
		|	Вт_ВагоныИКонтейнеры КАК Вт_ВагоныИКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТипоразмерыКонтейнеров.Вагон КАК Вагон,
		|	ПРЕДСТАВЛЕНИЕ(вт_ТипоразмерыКонтейнеров.Вагон) КАК ПредставлениеВагона,
		|	СУММА(вт_ТипоразмерыКонтейнеров.РазмерКТКвТЭУ) КАК РазмерКТКвТЭУ,
		|	вт_ТипоразмерыКонтейнеров.ВагонРазмерВТЕУ КАК ВагонРазмерВТЕУ
		|ИЗ
		|	вт_ТипоразмерыКонтейнеров КАК вт_ТипоразмерыКонтейнеров
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТипоразмерыКонтейнеров.Вагон,
		|	вт_ТипоразмерыКонтейнеров.ВагонРазмерВТЕУ
		|
		|ИМЕЮЩИЕ
		|	СУММА(вт_ТипоразмерыКонтейнеров.РазмерКТКвТЭУ) > вт_ТипоразмерыКонтейнеров.ВагонРазмерВТЕУ";
	
	
	Запрос.УстановитьПараметр("тзВагоны", тзВагоны);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции	

Функция ПолучитьДанныеЗаполненияЗаявкиНаОснованииРефСцепаПоКлючам(ДанныеЗаполнения, МассивКлючейАналитикиПеревозки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепВагоныРефСцепа.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепВагоныРефСцепа.Груз КАК Груз,
		|	РефСцепВагоныРефСцепа.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепВагоныРефСцепа.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепВагоныРефСцепа.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепВагоныРефСцепа.Клиент КАК Клиент,
		|	РефСцепВагоныРефСцепа.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепВагоныРефСцепа.ДопИнформация КАК ДопИнформация,
		|	РефСцепВагоныРефСцепа.Ответственный КАК Ответственный,
		|	РефСцепВагоныРефСцепа.Отметка КАК Отметка,
		|	РефСцепВагоныРефСцепа.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА РефСцепВагоныРефСцепа.СостояниеКонтейнера = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Груженый
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&тзВагоны КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.КлючАналитикиПеревозки В(&МассивКлючейАналитикиПеревозки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепКонтейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепКонтейнеры.Груз КАК Груз,
		|	РефСцепКонтейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепКонтейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепКонтейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепКонтейнеры.Клиент КАК Клиент,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепКонтейнеры.ДопИнформация КАК ДопИнформация,
		|	РефСцепКонтейнеры.Ответственный КАК Ответственный,
		|	РефСцепКонтейнеры.Отметка КАК Отметка,
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА РефСцепКонтейнеры.СостояниеКонтейнера = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Груженый
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	&тзКонтейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки В(&МассивКлючейАналитикиПеревозки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Контейнеры.Контейнер КАК Контейнер,
		|	вт_Контейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	вт_Контейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_Контейнеры.Груз КАК Груз,
		|	вт_Контейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_Контейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	вт_Контейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	вт_Контейнеры.Клиент КАК Клиент,
		|	вт_Контейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_Контейнеры.Груженый КАК Груженый
		|ПОМЕСТИТЬ вт_ДанныеКонтейнеровЗагрузки
		|ИЗ
		|	вт_Контейнеры КАК вт_Контейнеры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_Вагоны.Контейнер,
		|	вт_Вагоны.ПринадлежностьКонтейнера,
		|	вт_Вагоны.СостояниеКонтейнера,
		|	вт_Вагоны.Груз,
		|	вт_Вагоны.ВесКонтейнераБрутто,
		|	вт_Вагоны.ВесКонтейнераНетто,
		|	вт_Вагоны.КоличествоМестКонтейнера,
		|	вт_Вагоны.Клиент,
		|	вт_Вагоны.КлючАналитикиПеревозки,
		|	вт_Вагоны.Груженый
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Субботин 77180 22.11.2023 начало
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
		//|	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
		//|ПОМЕСТИТЬ вт_ВидыСобственностиКонтейнеров
		//|ИЗ
		//|	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
		//|			,
		//|			Контейнер В
		//|				(ВЫБРАТЬ
		//|					вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер
		//|				ИЗ
		//|					вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки)) КАК ПризнакСобственностиКонтейнераСрезПоследних
		//|;
		//|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ПризнакСобственности
		|ПОМЕСТИТЬ вт_ВидыСобственностиКонтейнеров
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			,
		|			КТК В
		|				(ВЫБРАТЬ
		|					вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер
		|				ИЗ
		|					вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		|
		//Субботин 77180 22.11.2023 Конец
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РефСцепДокумента.Автор КАК Автор,
		|	РефСцепДокумента.РефСцеп КАК РефСцеп,
		|	РефСцепДокумента.СтанцияОтправления КАК СтанцияОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК СтанцияНазначения,
		|	РефСцепДокумента.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	РефСцепДокумента.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	РефСцепДокумента.Рейс КАК Рейс,
		|	РефСцепДокумента.Рейс.Продукт КАК Продукт,
		|	РефСцепДокумента.СтанцияОтправления КАК ПунктОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК ПунктНазначения
		|ПОМЕСТИТЬ вт_ДокументРефСцеп
		|ИЗ
		|	Документ.РефСцеп КАК РефСцепДокумента
		|ГДЕ
		|	РефСцепДокумента.Ссылка = &ДанныеЗаполненияСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер,
		|	вт_ДанныеКонтейнеровЗагрузки.ПринадлежностьКонтейнера КАК ПринадлежностьТЕ,
		|	вт_ДанныеКонтейнеровЗагрузки.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_ДанныеКонтейнеровЗагрузки.Груз КАК Груз,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераНетто КАК ВесГрузаНетто,
		|	вт_ДанныеКонтейнеровЗагрузки.КоличествоМестКонтейнера КАК КоличествоМест,
		|	вт_ДанныеКонтейнеровЗагрузки.Клиент КАК Клиент,
		|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
		|	ТЕ.ТипТЕ КАК ТипКТК,
		|	вт_ВидыСобственностиКонтейнеров.ПризнакСобственности КАК ВидСобственности,
		|	вт_ДанныеКонтейнеровЗагрузки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	Грузы.ЕТСНГ КАК КодГруза,
		|	вт_ДанныеКонтейнеровЗагрузки.Груженый КАК Груженый,
		|	вт_ДокументРефСцеп.СтанцияОтправления КАК СтанцияОтправления,
		|	вт_ДокументРефСцеп.СтанцияНазначения КАК СтанцияНазначения,
		|	вт_ДокументРефСцеп.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	вт_ДокументРефСцеп.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	вт_ДокументРефСцеп.ПунктОтправления КАК ПунктОтправления,
		|	вт_ДокументРефСцеп.ПунктНазначения КАК ПунктНазначения
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|			ПО ТЕ.ТипТЕ = ТипоразмерыТЕ.Ссылка
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = ТЕ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВидыСобственностиКонтейнеров КАК вт_ВидыСобственностиКонтейнеров
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = вт_ВидыСобственностиКонтейнеров.Контейнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Груз = Грузы.Ссылка
		|		ПОЛНОЕ СОЕДИНЕНИЕ вт_ДокументРефСцеп КАК вт_ДокументРефСцеп
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЕСТЬNULL(вт_ДанныеКонтейнеровЗагрузки.Контейнер, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) <> ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РефСцепДокумента.Автор КАК Автор,
		|	РефСцепДокумента.РефСцеп КАК РефСцеп,
		|	РефСцепДокумента.СтанцияОтправления КАК СтанцияОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК СтанцияНазначения,
		|	РефСцепДокумента.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	РефСцепДокумента.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	РефСцепДокумента.Рейс КАК Рейс,
		|	РефСцепДокумента.Рейс.Продукт КАК Продукт,
		|	РефСцепДокумента.СтанцияОтправления КАК ПунктОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК ПунктНазначения
		|ИЗ
		|	вт_ДокументРефСцеп КАК РефСцепДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеКонтейнеровЗагрузки.Клиент КАК Клиент
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки"; 
	
	
	Запрос.УстановитьПараметр("тзВагоны", ДанныеЗаполнения.ВагоныРефСцепа.Выгрузить());
	Запрос.УстановитьПараметр("тзКонтейнеры", ДанныеЗаполнения.Контейнеры.Выгрузить());
	Запрос.УстановитьПараметр("ДанныеЗаполненияСсылка", ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("МассивКлючейАналитикиПеревозки", МассивКлючейАналитикиПеревозки);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("ДанныеПоКонтейнерам
	|, Шапка
	|, ДанныеКлиента"
	, МассивРезультатов[5].Выбрать()
	, МассивРезультатов[6].Выбрать()
	, МассивРезультатов[7].Выбрать());
	
		
КонецФункции	

Функция ПолучитьДанныеЗаполненияКонтейнеровЗаявкиПодбора(РефСцепСсылка, Заявка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.Ссылка КАК Ссылка,
		|	РефСцепКонтейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепКонтейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепКонтейнеры.Груз КАК Груз,
		|	РефСцепКонтейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепКонтейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепКонтейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепКонтейнеры.Клиент КАК Клиент,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепКонтейнеры.ДопИнформация КАК ДопИнформация,
		|	РефСцепКонтейнеры.Ответственный КАК Ответственный,
		|	РефСцепКонтейнеры.Отметка КАК Отметка,
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА РефСцепКонтейнеры.СостояниеКонтейнера = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Груженый
		|ПОМЕСТИТЬ вт_ДанныеКонтейнеровЗагрузки
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.ЗаявкаПодбора = &Заявка
		|	И РефСцепКонтейнеры.Ссылка = &РефСцепСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
		|	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
		|ПОМЕСТИТЬ вт_ВидыСобственностиКонтейнеров
		|ИЗ
		|	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
		|			,
		|			Контейнер В
		|				(ВЫБРАТЬ
		|					вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер
		|				ИЗ
		|					вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки)) КАК ПризнакСобственностиКонтейнераСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер,
		|	вт_ДанныеКонтейнеровЗагрузки.ПринадлежностьКонтейнера КАК ПринадлежностьТЕ,
		|	вт_ДанныеКонтейнеровЗагрузки.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_ДанныеКонтейнеровЗагрузки.Груз КАК Груз,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераНетто КАК ВесГрузаНетто,
		|	вт_ДанныеКонтейнеровЗагрузки.КоличествоМестКонтейнера КАК КоличествоМест,
		|	вт_ДанныеКонтейнеровЗагрузки.Клиент КАК Клиент,
		|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
		|	ТЕ.ТипТЕ КАК ТипКТК,
		|	вт_ВидыСобственностиКонтейнеров.ПризнакСобственности КАК ВидСобственности,
		|	вт_ДанныеКонтейнеровЗагрузки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	Грузы.ЕТСНГ КАК КодГруза,
		|	вт_ДанныеКонтейнеровЗагрузки.Груженый КАК Груженый,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.СтанцияОтправления КАК ПунктОтправления,
		|	вт_ДанныеКонтейнеровЗагрузки.Ссылка.СтанцияНазначения КАК ПунктНазначения
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|			ПО ТЕ.ТипТЕ = ТипоразмерыТЕ.Ссылка
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = ТЕ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВидыСобственностиКонтейнеров КАК вт_ВидыСобственностиКонтейнеров
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = вт_ВидыСобственностиКонтейнеров.Контейнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Груз = Грузы.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(вт_ДанныеКонтейнеровЗагрузки.Контейнер, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) <> ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("РефСцепСсылка", РефСцепСсылка);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Возврат  Запрос.Выполнить().Выбрать();
	
КонецФункции	

Функция ПолучитьДанныеЗаполненияЗаявкиНаОснованииРефСцепа(ДанныеЗаполнения, МассивКонтейнеров) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепВагоныРефСцепа.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепВагоныРефСцепа.Груз КАК Груз,
		|	РефСцепВагоныРефСцепа.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепВагоныРефСцепа.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепВагоныРефСцепа.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепВагоныРефСцепа.Клиент КАК Клиент,
		|	РефСцепВагоныРефСцепа.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепВагоныРефСцепа.ДопИнформация КАК ДопИнформация,
		|	РефСцепВагоныРефСцепа.Ответственный КАК Ответственный,
		|	РефСцепВагоныРефСцепа.Отметка КАК Отметка,
		|	РефСцепВагоныРефСцепа.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА РефСцепВагоныРефСцепа.СостояниеКонтейнера = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Груженый
		|ПОМЕСТИТЬ вт_Вагоны
		|ИЗ
		|	&тзВагоны КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Контейнер В(&МассивКонтейнеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепКонтейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепКонтейнеры.Груз КАК Груз,
		|	РефСцепКонтейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепКонтейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепКонтейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепКонтейнеры.Клиент КАК Клиент,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепКонтейнеры.ДопИнформация КАК ДопИнформация,
		|	РефСцепКонтейнеры.Ответственный КАК Ответственный,
		|	РефСцепКонтейнеры.Отметка КАК Отметка,
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА РефСцепКонтейнеры.СостояниеКонтейнера = ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Груженый
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	&тзКонтейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Контейнер В(&МассивКонтейнеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Контейнеры.Контейнер КАК Контейнер,
		|	вт_Контейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	вт_Контейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_Контейнеры.Груз КАК Груз,
		|	вт_Контейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_Контейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	вт_Контейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	вт_Контейнеры.Клиент КАК Клиент,
		|	вт_Контейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_Контейнеры.Груженый КАК Груженый
		|ПОМЕСТИТЬ вт_ДанныеКонтейнеровЗагрузки
		|ИЗ
		|	вт_Контейнеры КАК вт_Контейнеры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_Вагоны.Контейнер,
		|	вт_Вагоны.ПринадлежностьКонтейнера,
		|	вт_Вагоны.СостояниеКонтейнера,
		|	вт_Вагоны.Груз,
		|	вт_Вагоны.ВесКонтейнераБрутто,
		|	вт_Вагоны.ВесКонтейнераНетто,
		|	вт_Вагоны.КоличествоМестКонтейнера,
		|	вт_Вагоны.Клиент,
		|	вт_Вагоны.КлючАналитикиПеревозки,
		|	вт_Вагоны.Груженый
		|ИЗ
		|	вт_Вагоны КАК вт_Вагоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Субботин 71114 Начало 07.09.2023
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ПризнакСобственности
		|ПОМЕСТИТЬ вт_ВидыСобственностиКонтейнеров
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			,
		|			КТК В
		|				(ВЫБРАТЬ
		|					вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер
		|				ИЗ
		|					вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		//Субботин 71114 Конец 07.09.2023
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РефСцепДокумента.Автор КАК Автор,
		|	РефСцепДокумента.РефСцеп КАК РефСцеп,
		|	РефСцепДокумента.СтанцияОтправления КАК СтанцияОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК СтанцияНазначения,
		|	РефСцепДокумента.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	РефСцепДокумента.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	РефСцепДокумента.Рейс КАК Рейс,
		|	РефСцепДокумента.Рейс.Продукт КАК Продукт,
		|	РефСцепДокумента.СтанцияОтправления КАК ПунктОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК ПунктНазначения
		|ПОМЕСТИТЬ вт_ДокументРефСцеп
		|ИЗ
		|	Документ.РефСцеп КАК РефСцепДокумента
		|ГДЕ
		|	РефСцепДокумента.Ссылка = &ДанныеЗаполненияСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеКонтейнеровЗагрузки.Контейнер КАК Контейнер,
		|	вт_ДанныеКонтейнеровЗагрузки.ПринадлежностьКонтейнера КАК ПринадлежностьТЕ,
		|	вт_ДанныеКонтейнеровЗагрузки.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	вт_ДанныеКонтейнеровЗагрузки.Груз КАК Груз,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	вт_ДанныеКонтейнеровЗагрузки.ВесКонтейнераНетто КАК ВесГрузаНетто,
		|	вт_ДанныеКонтейнеровЗагрузки.КоличествоМестКонтейнера КАК КоличествоМест,
		|	вт_ДанныеКонтейнеровЗагрузки.Клиент КАК Клиент,
		|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
		|	ТЕ.ТипТЕ КАК ТипКТК,
		|	вт_ВидыСобственностиКонтейнеров.ПризнакСобственности КАК ВидСобственности,
		|	вт_ДанныеКонтейнеровЗагрузки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	Грузы.ЕТСНГ КАК КодГруза,
		|	вт_ДанныеКонтейнеровЗагрузки.Груженый КАК Груженый,
		|	вт_ДокументРефСцеп.СтанцияОтправления КАК СтанцияОтправления,
		|	вт_ДокументРефСцеп.СтанцияНазначения КАК СтанцияНазначения,
		|	вт_ДокументРефСцеп.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	вт_ДокументРефСцеп.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	вт_ДокументРефСцеп.ПунктОтправления КАК ПунктОтправления,
		|	вт_ДокументРефСцеп.ПунктНазначения КАК ПунктНазначения
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|			ПО ТЕ.ТипТЕ = ТипоразмерыТЕ.Ссылка
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = ТЕ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВидыСобственностиКонтейнеров КАК вт_ВидыСобственностиКонтейнеров
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Контейнер = вт_ВидыСобственностиКонтейнеров.Контейнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
		|		ПО вт_ДанныеКонтейнеровЗагрузки.Груз = Грузы.Ссылка
		|		ПОЛНОЕ СОЕДИНЕНИЕ вт_ДокументРефСцеп КАК вт_ДокументРефСцеп
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЕСТЬNULL(вт_ДанныеКонтейнеровЗагрузки.Контейнер, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) <> ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РефСцепДокумента.Автор КАК Автор,
		|	РефСцепДокумента.РефСцеп КАК РефСцеп,
		|	РефСцепДокумента.СтанцияОтправления КАК СтанцияОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК СтанцияНазначения,
		|	РефСцепДокумента.ПланируемоеОтправление КАК ПланируемоеОтправление,
		|	РефСцепДокумента.ПланируемоеПрибытие КАК ПланируемоеПрибытие,
		|	РефСцепДокумента.Рейс КАК Рейс,
		|	РефСцепДокумента.Рейс.Продукт КАК Продукт,
		|	РефСцепДокумента.СтанцияОтправления КАК ПунктОтправления,
		|	РефСцепДокумента.СтанцияНазначения КАК ПунктНазначения
		|ИЗ
		|	вт_ДокументРефСцеп КАК РефСцепДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеКонтейнеровЗагрузки.Клиент КАК Клиент
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
		|;
        |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДанныеКонтейнеровЗагрузки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз КАК Груз,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.КоличествоМест КАК КоличествоМест,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.ВесГруза КАК ВесГруза
		|ИЗ
		|	вт_ДанныеКонтейнеровЗагрузки КАК вт_ДанныеКонтейнеровЗагрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК КлючиАналитикиПеревозкиДетализацияПоГрузу
		|		ПО (вт_ДанныеКонтейнеровЗагрузки.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка)";
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
	
	
	Запрос.УстановитьПараметр("тзВагоны", ДанныеЗаполнения.ВагоныРефСцепа.Выгрузить());
	Запрос.УстановитьПараметр("тзКонтейнеры", ДанныеЗаполнения.Контейнеры.Выгрузить());
	Запрос.УстановитьПараметр("ДанныеЗаполненияСсылка", ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("МассивКонтейнеров", МассивКонтейнеров);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. 01.07.2024 - добавлена таблица детализации по грузу
	Возврат Новый Структура("ДанныеПоКонтейнерам
	|, Шапка
	|, ДанныеКлиента
	|, ДетализацияПоГрузу"
	, МассивРезультатов[5].Выбрать()
	, МассивРезультатов[6].Выбрать()
	, МассивРезультатов[7].Выбрать()
	, МассивРезультатов[8].Выбрать());
	
		
КонецФункции	

Функция ПолучитьДанныеРефСцепаДляОтбораЗаявок(Объект, ЭтоПодборЗаявок = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.Клиент КАК Клиент,
		|	РефСцепВагоныРефСцепа.Отметка КАК Отметка
		|ПОМЕСТИТЬ вт_РефСцепВагоныРефСцепа
		|ИЗ
		|	&тзВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.Клиент КАК Клиент,
		|	РефСцепКонтейнеры.Отметка КАК Отметка
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	&тзКонтейнеры КАК РефСцепКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.Клиент КАК Клиент,
		|	РефСцепВагоныРефСцепа.Отметка КАК Отметка
		|ПОМЕСТИТЬ вт_ОбеТЧРефСцепа
		|ИЗ
		|	вт_РефСцепВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепКонтейнеры.Контейнер,
		|	РефСцепКонтейнеры.Клиент,
		|	РефСцепКонтейнеры.Отметка
		|ИЗ
		|	вт_Контейнеры КАК РефСцепКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ОбеТЧРефСцепа.Контейнер КАК Контейнер
		|ИЗ
		|	вт_ОбеТЧРефСцепа КАК вт_ОбеТЧРефСцепа
		|ГДЕ
		|	вт_ОбеТЧРефСцепа.Контейнер <> ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ОбеТЧРефСцепа.Клиент КАК Клиент
		|ИЗ
		|	вт_ОбеТЧРефСцепа КАК вт_ОбеТЧРефСцепа
		|ГДЕ вт_ОбеТЧРефСцепа.Отметка = ИСТИНА";
	
	тзВагоныРефСцепа = Объект.ВагоныРефСцепа.Выгрузить();
	
	Если ЭтоПодборЗаявок  Тогда
		тзВагоныРефСцепа.Очистить();
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ вт_ОбеТЧРефСцепа.Отметка = ИСТИНА","");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("тзВагоныРефСцепа", тзВагоныРефСцепа);
	Запрос.УстановитьПараметр("тзКонтейнеры", Объект.Контейнеры.Выгрузить());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("МассивКонтейнеров
		|, МассивКлиентов
		|, РефСцеп"
		, МассивРезультатов[3].Выгрузить().ВыгрузитьКолонку("Контейнер")
		, МассивРезультатов[4].Выгрузить().ВыгрузитьКолонку("Клиент")
		, Объект.Ссылка);

КонецФункции

Функция ПолучитьСписокЗаявокДляДобавленияКонтейнеров(СтруктураДанных) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка,
		|	Заявка.Отправка КАК Отправка,
		|	ВЫРАЗИТЬ(ЗаявкаПереченьРейсов.Рейс КАК Справочник.РейсыЖД) КАК РейсЗаявки
		|ПОМЕСТИТЬ вт_ЗаявкаСсылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
		|ГДЕ
		|	Заявка.Ссылка.Контрагент В(&МассивКлиентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументРефСцеп.Ссылка КАК Ссылка,
		|	ДокументРефСцеп.Рейс КАК РейсРефСцепа,
		|	ДокументРефСцеп.ПланируемоеОтправление КАК ПланируемоеОтправление
		|ПОМЕСТИТЬ вт_РефСцеп
		|ИЗ
		|	Документ.РефСцеп КАК ДокументРефСцеп
		|ГДЕ
		|	ДокументРефСцеп.Ссылка = &РефСцеп
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаявкаСсылка.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_ПроверкаПоРейсуИлиПланируемойДате
		|ИЗ
		|	вт_ЗаявкаСсылка КАК вт_ЗаявкаСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РефСцеп КАК вт_РефСцеп
		|		ПО (ВЫБОР
		|				КОГДА ЕСТЬNULL(вт_РефСцеп.РейсРефСцепа, ЗНАЧЕНИЕ(Справочник.РейсыЖД.ПустаяСсылка)) <> ЗНАЧЕНИЕ(СПравочник.РейсыЖД.ПустаяСсылка)
		|					ТОГДА вт_РефСцеп.РейсРефСцепа = вт_ЗаявкаСсылка.РейсЗаявки
		|				ИНАЧЕ ЕСТЬNULL(вт_РефСцеп.ПланируемоеОтправление, ДАТАВРЕМЯ(1, 1, 1)) = вт_ЗаявкаСсылка.Отправка
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ вт_КонтейнерыВРефСцепах
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепВагоныРефСцепа.Ссылка.Проведен = ИСТИНА
		|	И РефСцепВагоныРефСцепа.Ссылка <> &РефСцеп
		|	И РефСцепВагоныРефСцепа.ПеренесенВРефСцеп = ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|	И РефСцепВагоныРефСцепа.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И НЕ РефСцепВагоныРефСцепа.Контейнер В (&МассивКонтейнеров)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепКонтейнеры.Контейнер
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепКонтейнеры.Ссылка.Проведен = ИСТИНА
		|	И РефСцепКонтейнеры.Ссылка <> &РефСцеп
		|	И РефСцепКонтейнеры.ПеренесенВРефСцеп = ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|	И РефСцепКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И НЕ РефСцепКонтейнеры.Контейнер В (&МассивКонтейнеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ПроверкаПоРейсуИлиПланируемойДате.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ЗаявкаСоставУслуги.НомерКТК, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) КАК НомерКТК
		|ПОМЕСТИТЬ вт_КонтейнерыЗаявок
		|ИЗ
		|	вт_ПроверкаПоРейсуИлиПланируемойДате КАК вт_ПроверкаПоРейсуИлиПланируемойДате
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО вт_ПроверкаПоРейсуИлиПланируемойДате.Ссылка = ЗаявкаСоставУслуги.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КонтейнерыЗаявок.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вт_КонтейнерыВРефСцепах.Контейнер, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) = ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоКонтейнеровВДругихРефСцепах,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вт_КонтейнерыЗаявок.НомерКТК, ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)) = ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоКонтейнеровВЗаявке
		|ПОМЕСТИТЬ вт_Заявки
		|ИЗ
		|	вт_КонтейнерыЗаявок КАК вт_КонтейнерыЗаявок
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_КонтейнерыВРефСцепах КАК вт_КонтейнерыВРефСцепах
		|		ПО вт_КонтейнерыЗаявок.НомерКТК = вт_КонтейнерыВРефСцепах.Контейнер
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_КонтейнерыЗаявок.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Заявки.Ссылка КАК Ссылка
		|ИЗ
		|	вт_Заявки КАК вт_Заявки
		|ГДЕ
		|	вт_Заявки.КоличествоКонтейнеровВДругихРефСцепах = 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Заявки.Ссылка
		|ИЗ
		|	вт_Заявки КАК вт_Заявки
		|ГДЕ
		|	вт_Заявки.КоличествоКонтейнеровВЗаявке = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_Заявки.Ссылка КАК Ссылка,
		|	ЗаявкаСоставУслуги.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	вт_Заявки КАК вт_Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО вт_Заявки.Ссылка = ЗаявкаСоставУслуги.Ссылка";
	//
	Запрос.УстановитьПараметр("РефСцеп", СтруктураДанных.РефСцеп);
	Запрос.УстановитьПараметр("МассивКлиентов", СтруктураДанных.МассивКлиентов);
	Запрос.УстановитьПараметр("МассивКонтейнеров", СтруктураДанных.МассивКонтейнеров);
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.ВыполнитьПакет();
	Возврат Новый Структура("СписокЗаявок, СписокЗаявокСКлючамиАналитики"
		, Результат[6].Выгрузить().ВыгрузитьКолонку("Ссылка")
		, Результат[7].Выгрузить());
	
КонецФункции

Функция	ПроверитьЕстьЛиПроведеннаяСделкаЗаявокПоРефсцепу(Заявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаЗаявки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|ГДЕ
		|	СделкаЗаявки.Заявка В(&Заявки)
		|	И СделкаЗаявки.Ссылка.Проведен = Истина";
	
	Запрос.УстановитьПараметр("Заявки", Заявки);
	
	 Возврат не Запрос.Выполнить().Пустой();
	
 КонецФункции
 
Функция ПолучитьТанкКонтейнерНаСервере(ДГК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиДГКиТанкКонтейнеровСрезПоследних.ТанкКонтейнер КАК ТанкКонтейнер
		|ИЗ
		|	РегистрСведений.СвязиДГКиТанкКонтейнеров.СрезПоследних(, ДГК = &КТКСсылка) КАК СвязиДГКиТанкКонтейнеровСрезПоследних";
	
	Запрос.УстановитьПараметр("КТКСсылка", ДГК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТанкКонтейнер;
	КонецЦикла;
	
	Возврат Справочники.ТЕ.ПустаяСсылка();
	
КонецФункции

 
Функция ПроверитьТанкКонтейнерыБезДГК(тзВагоныРефСцепа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.ЭтоТанкКонтейнер КАК ЭтоТанкКонтейнер
		|ПОМЕСТИТЬ вт_ВагоныРефСцепа
		|ИЗ
		|	&тзВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ВагоныРефСцепа.Контейнер КАК Контейнер,
		|	СвязиДГКиТанкКонтейнеровСрезПоследних.ДГК КАК ДГК
		|ПОМЕСТИТЬ вт_КонтейнерыСДГК
		|ИЗ
		|	вт_ВагоныРефСцепа КАК вт_ВагоныРефСцепа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДГКиТанкКонтейнеров.СрезПоследних(, ) КАК СвязиДГКиТанкКонтейнеровСрезПоследних
		|		ПО вт_ВагоныРефСцепа.Контейнер = СвязиДГКиТанкКонтейнеровСрезПоследних.ТанкКонтейнер
		|			И (вт_ВагоныРефСцепа.ЭтоТанкКонтейнер = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ВагоныРефСцепа.Контейнер КАК Контейнер,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вт_КонтейнерыСДГК.ДГК, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК ПризнакНаличияДГК
		|ИЗ
		|	вт_ВагоныРефСцепа КАК вт_ВагоныРефСцепа
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_КонтейнерыСДГК КАК вт_КонтейнерыСДГК
		|		ПО вт_ВагоныРефСцепа.Контейнер = вт_КонтейнерыСДГК.Контейнер
		|ГДЕ
		|	вт_ВагоныРефСцепа.ЭтоТанкКонтейнер = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ВагоныРефСцепа.Контейнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вт_КонтейнерыСДГК.ДГК, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) = 0";
	
	Запрос.УстановитьПараметр("тзВагоныРефСцепа", тзВагоныРефСцепа); 
	Возврат  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контейнер");
КонецФункции

Функция ДанныеКонтейнеровИсходногоРефСцепа(РефСцепИсходныйСсылка, РефСцепПриемникСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепКонтейнеры.Ссылка КАК Ссылка,
		|	РефСцепКонтейнеры.НомерСтроки КАК НомерСтроки,
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.ПринадлежностьКонтейнера КАК ПринадлежностьКонтейнера,
		|	РефСцепКонтейнеры.СостояниеКонтейнера КАК СостояниеКонтейнера,
		|	РефСцепКонтейнеры.Груз КАК Груз,
		|	РефСцепКонтейнеры.ВесКонтейнераБрутто КАК ВесКонтейнераБрутто,
		|	РефСцепКонтейнеры.ВесКонтейнераНетто КАК ВесКонтейнераНетто,
		|	РефСцепКонтейнеры.КоличествоМестКонтейнера КАК КоличествоМестКонтейнера,
		|	РефСцепКонтейнеры.Клиент КАК Клиент,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепКонтейнеры.ДопИнформация КАК ДопИнформация,
		|	РефСцепКонтейнеры.Отметка КАК Отметка,
		|	РефСцепКонтейнеры.Ответственный КАК Ответственный,
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Ссылка = &ИсходныйРефСцеп
		|	И РефСцепКонтейнеры.ПеренесенВРефСцеп = &РефСцепПриемникСсылка";
	
	Запрос.УстановитьПараметр("ИсходныйРефСцеп", РефСцепИсходныйСсылка);
	Запрос.УстановитьПараметр("РефСцепПриемникСсылка", РефСцепПриемникСсылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции	

Функция ОчередноеСостояниеОдинаковых(мСостояния, ОсновноеИмяПредопределенного, Количество = 9) Экспорт
	
	Для Сч = 0 по Количество Цикл		
		
		Состояние = Справочники.Состояния[ОсновноеИмяПредопределенного+Сч];	
		Если мСостояния.Найти(Состояние) = неопределено Тогда
			Возврат Состояние;
		КонецЕсли;
		
	КонецЦикла;

КонецФункции   

Функция МассивОднотипныхСостояний(ОсновноеИмяПредопределенного, Количество = 9) Экспорт
	
	мОднотипныеСостояния = Новый Массив;
	
	Для Сч = 0 по Количество Цикл		
		
		мОднотипныеСостояния.Добавить(Справочники.Состояния[ОсновноеИмяПредопределенного+Сч]);	
		
	КонецЦикла;
    Возврат мОднотипныеСостояния;
КонецФункции   


#Область ОбщегоНазначения

Функция ПолучитьДанныеЧерезМакетСКД(МакетСКД, Параметры, СписокОтборов="") Экспорт

	МассивСписокОтборов   = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокОтборов);
	СхемаКомпоновкиДанных = МакетСКД;
	Настройки 			  = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновкаДанныхКлиентСервер.УстановитьКоллекциюПараметров(Настройки, Параметры);
	МакетКомпоновкиДанных = КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(СхемаКомпоновкиДанных, Настройки);

	Возврат  КомпоновкаДанныхСервер.ВыгрузитьРезультатСКД(СхемаКомпоновкиДанных, Настройки);
	
КонецФункции

#КонецОбласти   

Функция НайтиСоздатьКлючАналитикиПеревозки(Контейнер) Экспорт
	
	СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	СтруктураКлючаАналитикиПеревозки.Контейнер = Контейнер;
	
	
	Возврат Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки).КлючАналитикиПеревозки;
	
КонецФункции

Процедура ДобавлениепризнаковКонтейнера(КТК)
	МассивИзмЗначений = Новый Соответствие;
	МассивИзмЗначений.Вставить("тек_ВЭксплуатации", Истина);
	МассивИзмЗначений.Вставить("тек_ВидСобственности", Перечисления.ВариантыСобственности.Собственный);
	МассивИзмЗначений.Вставить("ИсточникЗаписи", "Добавлено при создании Документа Реф.сцеп" + ТекущаяДата());
	ДобавитьЗаписьстоки_ТекущиеДанные(КТК, МассивИзмЗначений);
КонецПроцедуры

Процедура ДобавитьЗаписьстоки_ТекущиеДанные(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина, ВыводитьСообщения = Истина, ТипИсточникаЗаписи = Неопределено) Экспорт

	Период = ТекущаяДата();
	МЗ = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
	
	// восстанавливаем данные предыдущией записи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);  
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Начало: 22.01.2025
	//если делается первая запись по КТК и нет в изменяемых полях статуса, то ставим статус Свободен
	ИначеЕсли НаборИзмененныхПолей.Получить("тек_Статус") = Неопределено 
		или НаборИзмененныхПолей.Получить("тек_Статус") = Перечисления.СтатусыКТК.ПустаяСсылка() Тогда 
		МЗ.тек_Статус = Перечисления.СтатусыКТК.Свободен;
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Конец: 22.01.2025
	КонецЕсли;
	
	МЗ.Период = Период;
	МЗ.ГУИДЗаписи = Строка(Новый УникальныйИдентификатор);
	МЗ.КТК = КТК;
	Если НЕ ЗначениеЗаполнено(МЗ.ПорядковыйНомерЦиклаАрендыКТК) Тогда 
		МЗ.ПорядковыйНомерЦиклаАрендыКТК = 1; 
	КонецЕсли;
	
	ИсточникЗаписи = НаборИзмененныхПолей.Получить("ИсточникЗаписи");
	
	Для каждого Поле из НаборИзмененныхПолей Цикл
		
		МЗ[Поле.Ключ] = Поле.Значение;
	КонецЦикла;
		
	
	// Проверка заполненности строки записи
	МассивПроверяемыхПолей = Новый Массив;
	МассивПроверяемыхПолей.Добавить("тек_ДатаПриемаВПользование");
	МассивПроверяемыхПолей.Добавить("тек_СледНазначения");
	МассивПроверяемыхПолей.Добавить("след_СледующаяЛокация");
	МассивПроверяемыхПолей.Добавить("тек_ПунктыОкончСдачи");
	МассивПроверяемыхПолей.Добавить("тек_Собственник");
	МассивПроверяемыхПолей.Добавить("тек_СрокВозврата");
	МассивПроверяемыхПолей.Добавить("тек_СтокСдачи");
	МассивПроверяемыхПолей.Добавить("тек_ИнструкцияПоСдаче");
	МассивПроверяемыхПолей.Добавить("комм_Ставка");
	ВсеПоляЗаполнены = Истина;
	Для каждого Стр2 из МассивПроверяемыхПолей Цикл
		ВсеПоляЗаполнены = ВсеПоляЗаполнены И ЗначениеЗаполнено(МЗ[Стр2]);
	КонецЦикла;
	МЗ.Недозаполнено = НЕ ВсеПоляЗаполнены;
	
	РегистрыСведений.стоки_ТекущиеДанные.ИзменитьПериодСтроки(КТК, МЗ.Период); // Евросиб Фролов (08.11.2021 TASK №41220
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ИзменениеРефСцепаПоЗаявке(Заявка
				, РефСцепСсылка
				, КонтрагентНаФорме
				) Экспорт
				
	ОтложенноеИзменениеСервер.ПоставитьРефСцепВОчередьИзменения(РефСцепСсылка, Заявка);
				
КонецПроцедуры	

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  

#Область РефСцепПроверкаАктуальности
Процедура ПроверкаАктуальностиДокументовРефСцеп() Экспорт
	
	// 2.1 (А)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Вагон КАК Вагон,
		|	РефСцепВагоныРефСцепа.ПорядковыйНомерВСцепе КАК ПорядковыйНомерВСцепе,
		|	РефСцепВагоныРефСцепа.Ссылка.РефСцеп КАК РефСцеп,
		|	РефСцепВагоныРефСцепа.Ссылка КАК ДокументРефСцеп,
		|	РефСцепВагоныРефСцепа.ПризнакВагона КАК ПризнакВагона
		|ПОМЕСТИТЬ вт_АктуальныеДокументыРефСцеп
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка.РейсЗавершен <> ИСТИНА
		|	И РефСцепВагоныРефСцепа.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РефСцепВагоныРефСцепа.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ВагоныВРефСцепах.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка))
		|	КОНЕЦ КАК РефСцеп,
		|	ЕСТЬNULL(ВагоныВРефСцепах.ПорядковыйНомерВСцепе, 0) КАК ПорядковыйНомерВСцепеРегистра,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЕстьВагонРегистра,
		|	ЕСТЬNULL(ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК ВагонРегистра,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЕстьВагонДокумента,
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК ВагонДокумента,
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПорядковыйНомерВСцепе, 0) КАК ПорядковыйНомерВСцепеДокумента,
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ДокументРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)) КАК ДокументРефСцеп,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВагоныВРефСцепах.ПорядковыйНомерВСцепе, 100) <> ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПорядковыйНомерВСцепе, 1000)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьРазличиеВНомере,
		|	ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(ВагоныВРефСцепах.ПризнакВагона, 0) = ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПризнакВагона, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьРазличиеВПризнакеВагона
		|ПОМЕСТИТЬ вт_АктуальныеДанныеРегистраИДокумента
		|ИЗ
		|	вт_АктуальныеДокументыРефСцеп КАК вт_АктуальныеДокументыРефСцеп
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ВагоныВРефСцепах КАК ВагоныВРефСцепах
		|		ПО (ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(СПравочник.Рефсцепы.ПустаяСсылка)) = ЕСТЬNULL(ВагоныВРефСцепах.РефСцеп, ЗНАЧЕНИЕ(СПравочник.Рефсцепы.ПустаяСсылка)))
		|			И (ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.Вагон, ЗНАЧЕНИЕ(СПравочник.ТС.ПустаяСсылка)) = ЕСТЬNULL(ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(СПравочник.ТС.ПустаяСсылка)))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ Различные
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ВагоныВРефСцепах.РефСцеп, ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка))
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВагоныВРефСцепах.ПорядковыйНомерВСцепе, 0),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВагоныВРефСцепах.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)),
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПорядковыйНомерВСцепе, 0),
		|	ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ДокументРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВагоныВРефСцепах.ПорядковыйНомерВСцепе, 100) <> ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПорядковыйНомерВСцепе, 1000)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(ВагоныВРефСцепах.ПризнакВагона, 0) = ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.ПризнакВагона, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ВагоныВРефСцепах КАК ВагоныВРефСцепах
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_АктуальныеДокументыРефСцеп КАК вт_АктуальныеДокументыРефСцеп
		|		ПО (ЕСТЬNULL(ВагоныВРефСцепах.РефСцеп, ЗНАЧЕНИЕ(СПравочник.Рефсцепы.ПустаяСсылка)) = ЕСТЬNULL(вт_АктуальныеДокументыРефСцеп.РефСцеп, ЗНАЧЕНИЕ(СПравочник.Рефсцепы.ПустаяСсылка)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп КАК РефСцеп,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонРегистра) КАК КоличествоВагоновРегистраВДокументе,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонДокумента) КАК КоличествоВагоновДокументаВРегистре,
		|	ЕСТЬNULL(вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)) КАК ДокументРефСцеп,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВНомере) КАК ЕстьРазличиеВНомере,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВПризнакеВагона) КАК ЕстьРазличиеВПризнакеВагона
		|ИЗ
		|	вт_АктуальныеДанныеРегистраИДокумента КАК вт_АктуальныеДанныеРегистраИДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп,
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп
		|
		|ИМЕЮЩИЕ
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВНомере) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонРегистра),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонДокумента),
		|	ЕСТЬNULL(вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВНомере),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВПризнакеВагона)
		|ИЗ
		|	вт_АктуальныеДанныеРегистраИДокумента КАК вт_АктуальныеДанныеРегистраИДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп,
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп
		|
		|ИМЕЮЩИЕ
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВПризнакеВагона) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп,
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонРегистра),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонДокумента),
		|	ЕСТЬNULL(вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВНомере),
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьРазличиеВПризнакеВагона)
		|ИЗ
		|	вт_АктуальныеДанныеРегистраИДокумента КАК вт_АктуальныеДанныеРегистраИДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_АктуальныеДанныеРегистраИДокумента.ДокументРефСцеп,
		|	вт_АктуальныеДанныеРегистраИДокумента.РефСцеп
		|
		|ИМЕЮЩИЕ
		|	СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонРегистра) <> СУММА(вт_АктуальныеДанныеРегистраИДокумента.ЕстьВагонДокумента)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоВагоновДокументаВРегистре = 0 Тогда
			
			Если Выборка.РефСцеп <> Справочники.РефСцепы.ПустаяСсылка() Тогда
				
				//НоваяЗадачаОбновитьДанныеПоРефСцепу(Выборка);
				
			КонецЕсли;	
			
		ИначеЕсли  Выборка.КоличествоВагоновРегистраВДокументе = 0 Тогда
			
			Если Выборка.РефСцеп <> Документы.РефСцеп.ПустаяСсылка() Тогда			
				
				//УстановитьРейсЗавершенДокументаПустыхРефСцепов(Выборка);
				
				НоваяЗадачаОбновитьДанныеПоРефСцепу(Выборка);
				
			КонецЕсли;	
			
		Иначе
			
			НоваяЗадачаОбновитьДанныеПоРефСцепу(Выборка);
			
		КонецЕсли;	
			
	КонецЦикла;                               

КонецПроцедуры                                

Процедура НоваяЗадачаСоздатьДокументПоРефСцепу(Выборка)
	// Функционал пока не требуется
	
КонецПроцедуры

Процедура УстановитьРейсЗавершенДокументаПустыхРефСцепов(Выборка)
	
	ДокументРефСцепОбъект = ПолучитьОбъектРефСцеп(Выборка).РефСцепОбъект;
	Если ДокументРефСцепОбъект = Неопределено Тогда Возврат; КонецЕсли;	
	
	ДокументРефСцепОбъект.РейсЗавершен = Истина;
	
	Попытка
		ДокументРефСцепОбъект.Записать();               
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура НоваяЗадачаОбновитьДанныеПоРефСцепу(Выборка)
	
	ДокументРефСцепОбъект = ПолучитьОбъектРефСцеп(Выборка).РефСцепОбъект;
	Если ДокументРефСцепОбъект = Неопределено Тогда Возврат; КонецЕсли;	
	
	тзСостояния = ДокументРефСцепОбъект.Состояния.Выгрузить();
	
	НайденноеСостояние = тзСостояния.НайтиСтроки(Новый Структура
		("Состояние", Справочники.Состояния.ОбновитьДанныеОВагонахВРефСцепе));
		
	ТребуетсяЗаписьДокумента = Ложь;
	Если НайденноеСостояние.Количество() = 0 Тогда
		Исполнитель = ДокументРефСцепОбъект.Автор;
		СтрокаСостояния = ДокументРефСцепОбъект.Состояния.Добавить();
		СтрокаСостояния.Исполнитель = Исполнитель;
		СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
		СтрокаСостояния.Комментарий = "";																										  
		СтрокаСостояния.Состояние   = Справочники.Состояния.ОбновитьДанныеОВагонахВРефСцепе;
		СтрокаСостояния.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		СтрокаСостояния.Статус 		= Перечисления.СтатусыЭтапов.НаВыполнение;
		ТребуетсяЗаписьДокумента 	= Истина;

	Иначе
		
		Если НайденноеСостояние[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			НайденноеСостояние[0].Статус  = Перечисления.СтатусыЭтапов.НаВыполнение;
			ТребуетсяЗаписьДокумента 	  = Истина;
			
			 // Ставим задачу на последнее место, что б выполнение не обнулялось после записи;
			тзСостояния.Сдвинуть(НайденноеСостояние[0], тзСостояния.Количество() - (тзСостояния.Индекс(НайденноеСостояние[0])+1));
				
			ДокументРефСцепОбъект.Состояния.Загрузить(тзСостояния);

		КонецЕсли;	
		
	КонецЕсли;
	
	Если не ТребуетсяЗаписьДокумента Тогда Возврат; КонецЕсли;
	Попытка
		ДокументРефСцепОбъект.Записать();               
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОбъектРефСцеп(Выборка)
	
	Если ТипЗнч(Выборка.ДокументРефСцеп) = Тип("ДокументСсылка.РефСцеп")  
		и Выборка.ДокументРефСцеп <> ПредопределенноеЗначение("Документ.РефСцеп.ПустаяСсылка") Тогда
		Попытка
			Возврат Новый Структура("РефСцепОбъект", Выборка.ДокументРефСцеп.ПолучитьОбъект());
		Исключение
			Возврат Новый Структура("РефСцепОбъект", Неопределено);
		КонецПопытки;	
	КонецЕсли;

	Возврат Новый Структура("РефСцепОбъект", Неопределено);
	
КонецФункции

// -- Евросиб Дудоров С.В. US 57543 30.01.2023  

#КонецОбласти

Функция ПолучитьЗаявкиПоКлючамАналитикиРефСцепа(КлючиАналитикиПеревозкиРефСцепа, ДокументРефСцепСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки В(&КлючиАналитикиПеревозки)
		|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|	И ЗаявкаСоставУслуги.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)
		|	И ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
		|";
	
	Запрос.УстановитьПараметр("КлючиАналитикиПеревозки", КлючиАналитикиПеревозкиРефСцепа);
	Запрос.УстановитьПараметр("ДокументРефСцеп", ДокументРефСцепСсылка);
	
	Возврат Запрос.Выполнить();
КонецФункции	


