//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	Если Не ПометкаУдаления И Основной Тогда
		СообщениеДляПользователя = ПроверитьНаличиеОсновногоСчетаПоВалюте();
		Если НЕ ПустаяСтрока(СообщениеДляПользователя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеДляПользователя);
	    КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец

//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
Функция ПроверитьНаличиеОсновногоСчетаПоВалюте() Экспорт 
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
	|	И БанковскиеСчета.Основной
	|	И НЕ БанковскиеСчета.Ссылка = &Ссылка
	|	И НЕ БанковскиеСчета.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Основной = Ложь;                  
		Результат = СтрШаблон("Существует уже <Основной> счет у «%1» с валютой «%2»", Владелец, ВалютаДенежныхСредств);
	КонецЕсли;
	Возврат Результат
КонецФункции  
//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
