Процедура ЗафиксироватьОшибку(ДокументСсылка, УзелОбмена, ТекстОшибки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ОшибкиПриОбменах.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ДокументСсылка);  
	НаборЗаписей.Отбор.Узел.Установить(УзелОбмена);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	Иначе
		НоваяЗапись = НаборЗаписей[0];
	КонецЕсли;  
	
	НоваяЗапись.Объект = ДокументСсылка;
	НоваяЗапись.Узел = УзелОбмена;
	НоваяЗапись.ДатаОбмена = ТекущаяДата();
	НоваяЗапись.ТекстОшибки = ТекстОшибки;
	НаборЗаписей.Записать(Истина); 
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры   

Процедура УдалитьСообщенияОбОшибках(ДокументСсылка, УзелОбмена) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ОшибкиПриОбменах.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ДокументСсылка);  
	НаборЗаписей.Отбор.Узел.Установить(УзелОбмена);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;  
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

