#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Если СогласованиеСервер.ЕстьДублиСостояний(Состояния.Выгрузить()) Тогда
		Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
		//ВыполнитьПроверкуПередПроведением(Отказ);				
		//Евросиб Трундуков С.А 21.08.2025 (( #116931
		Если НЕ ЗначениеЗаполнено(Автор) ИЛИ Автор = Справочники.Пользователи.НайтиПоНаименованию("Call") Тогда
			Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		//Евросиб Трундуков С.А 21.08.2025 )) #116931
	КонецЕсли;   
	
	//Евросиб Трундуков С.А 21.08.2025 (( #116931
	Если НЕ ЗначениеЗаполнено(Создано) Тогда
		Создано = ТекущаяДатаСеанса();
	КонецЕсли;
	//Евросиб Трундуков С.А 21.08.2025 )) #116931

	// Маршрутизация заявки
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект); 
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Документы.ШаблонДокумента.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРефСцеп(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
		
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Подразделение = Автор.Подразделение;
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Создано = ТекущаяДата();
	ЗаполнитьОсновнуюСтавку();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не задан Период.'"),,"ПериодРеестра",,Отказ);
	КонецЕсли;
	
	Если СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно, т.к. в ТЧ разные ставки НДС",,"СтавкаНДС",,Отказ);
	КонецЕсли;
                        
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОсновнуюСтавку()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЧРеестра.КлючАналитики КАК Справочник.КлючиАналитикиПеревозки) КАК КлючАналитики,
		|	ТЧРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТЧРеестра.ДатаВремяПодачиКТКПлан КАК ДатаВремяПодачиКТКПлан,
		|	ТЧРеестра.ПСЦПоставщика КАК ПСЦСсылка,
		|	ТЧРеестра.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка
		|ПОМЕСТИТЬ ГуидЗаказаНаТС
		|ИЗ
		|	&ТаблицаРеестра КАК ТЧРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитики,
		|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто КАК ЗапросНаАвто,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер.ТипТЕ КАК ТипКТК,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК НомерКТК,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачиФакт КАК ТерминалПостановки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачиФакт КАК ТерминалСдачи,
		|	ЕСТЬNULL(АдресаВНаселенныхПунктах.Ссылка, ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)) КАК АдресПогрузкиВыгрузкиСсылка,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеПостановкиФакт КАК ТипОперацииНаТерминалеПостановки,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеСдачиФакт КАК ТипОперацииНаТерминалеСдачи,
		|	КлючиАналитикиПеревозкиМили.ПротоколПоставщика КАК СсылкиПСЦ,
		|	ГуидЗаказаНаТС.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка
		|ПОМЕСТИТЬ СсылкиСтрок
		|ИЗ
		|	ГуидЗаказаНаТС КАК ГуидЗаказаНаТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО (ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = ГуидЗаказаНаТС.КлючАналитики)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ГуидЗаказаНаТС.ЗапросНаАвто)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО ГуидЗаказаНаТС.КлючАналитики = КлючиАналитикиПеревозкиМили.Ссылка
		|			И ГуидЗаказаНаТС.ЗапросНаАвто = КлючиАналитикиПеревозкиМили.ЗапросНаАвто
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
		|		ПО (ЗапросНаАвтоперевозкуКонтейнеры.АдресСкладаФакт = АдресаВНаселенныхПунктах.Адрес)
		|			И (АдресаВНаселенныхПунктах.ПометкаУдаления = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПоставщиков.НомерСтроки КАК НомерСтроки,
		|	СсылкиСтрок.КлючАналитики КАК КлючАналитики,
		|	СсылкиСтрок.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТарифыПоставщиков.Критерий КАК Критерий,
		|	ПСЦПоставщика.НомерПСЦ КАК НомерПСЦ,
		|	ПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ПСЦПоставщика.СтавкаНДС КАК СтавкаНДС,
		|	СсылкиСтрок.ТипКТК КАК ТипКТК,
		|	СсылкиСтрок.СсылкиПСЦ КАК СсылкиПСЦ,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщика.СуммаВключаетНДС
		|			ТОГДА ТарифыПоставщиков.СтоимостьСНДС
		|		ИНАЧЕ ТарифыПоставщиков.СтоимостьБезНДС
		|	КОНЕЦ КАК Стоимость,
		|	ЛокацииПостановки.Тип КАК ТерминалПостановкиТип,
		|	ЛокацииСдачи.Тип КАК ТерминалСдачиТип,
		|	СсылкиСтрок.ТерминалПостановки КАК ТерминалПостановки,
		|	СсылкиСтрок.ТерминалСдачи КАК ТерминалСдачи,
		|	СсылкиСтрок.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СсылкиСтрок.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СсылкиСтрок.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СсылкиСтрок.НомерКТК КАК НомерКТК,
		|	СсылкиСтрок.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТаблицаТарифов
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|		ПО ТарифыПоставщиков.Регистратор = ПСЦПоставщика.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СсылкиСтрок КАК СсылкиСтрок
		|		ПО ТарифыПоставщиков.Регистратор = СсылкиСтрок.СсылкиПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииПостановки
		|		ПО (СсылкиСтрок.ТерминалПостановки = ЛокацииПостановки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииСдачи
		|		ПО (СсылкиСтрок.ТерминалСдачи = ЛокацииСдачи.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТарифов.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТарифов.КлючАналитики КАК КлючАналитики,
		|	ТаблицаТарифов.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТаблицаТарифов.Критерий КАК Критерий,
		|	ТаблицаТарифов.НомерПСЦ КАК НомерПСЦ,
		|	ТаблицаТарифов.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТаблицаТарифов.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТарифов.Стоимость КАК Стоимость,
		|	КритерииУслугПоставщиков.Номенклатура КАК Номенклатура,
		|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	КритерииУслугПоставщиков.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	КритерииУслугПоставщиков.АдресСкладаПогрузкиВыгрузки КАК АдресСкладаПогрузкиВыгрузки,
		|	КритерииУслугПоставщиков.ПунктОтправления КАК ПунктОтправления,
		|	КритерииУслугПоставщиков.ПунктНазначения КАК ПунктНазначения,
		|	ТаблицаТарифов.ТерминалПостановкиТип КАК ТерминалПостановкиТип,
		|	ТаблицаТарифов.ТерминалСдачиТип КАК ТерминалСдачиТип,
		|	ТаблицаТарифов.ТерминалПостановки КАК ТерминалПостановки,
		|	ТаблицаТарифов.ТерминалСдачи КАК ТерминалСдачи,
		|	КритерииУслугПоставщиков.ПунктОтправления.Тип КАК ПунктОтправленияТип,
		|	КритерииУслугПоставщиков.ПунктНазначения.Тип КАК ПунктНазначенияТип,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТаблицаТарифов.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТаблицаТарифов.НомерКТК КАК НомерКТК,
		|	ТаблицаТарифов.ТипКТК КАК ТипКТК,
		|	ТаблицаТарифов.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ СобранныеТарифы
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТаблицаТарифов.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И ТаблицаТарифов.ТипКТК = КритерииУслугПоставщиков.ТипоразмерКТК
		|			И (КритерииУслугПоставщиков.Номенклатура В (ЗНАЧЕНИЕ(Справочник.Номенклатура.СНПавтотранспорта), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера), ЗНАЧЕНИЕ(Справочник.Номенклатура.ЭкспедированиеАвтотранспорт), ЗНАЧЕНИЕ(Справочник.Номенклатура.ДопАдрес), ЗНАЧЕНИЕ(Справочник.Номенклатура.БазоваяСтавкаАвто), ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер), ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаПорожнийКонтейнер)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТарифов.НомерСтроки,
		|	ТаблицаТарифов.КлючАналитики,
		|	ТаблицаТарифов.ЗапросНаАвто,
		|	ТаблицаТарифов.Критерий,
		|	ТаблицаТарифов.НомерПСЦ,
		|	ТаблицаТарифов.СуммаВключаетНДС,
		|	ТаблицаТарифов.СтавкаНДС,
		|	ТаблицаТарифов.Стоимость,
		|	КритерииУслугПоставщиков.Номенклатура,
		|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке,
		|	КритерииУслугПоставщиков.НормаЗагрузкиКТК,
		|	КритерииУслугПоставщиков.АдресСкладаПогрузкиВыгрузки,
		|	КритерииУслугПоставщиков.ПунктОтправления,
		|	КритерииУслугПоставщиков.ПунктНазначения,
		|	ТаблицаТарифов.ТерминалПостановки.Тип,
		|	ТаблицаТарифов.ТерминалСдачи.Тип,
		|	ТаблицаТарифов.ТерминалПостановки,
		|	ТаблицаТарифов.ТерминалСдачи,
		|	КритерииУслугПоставщиков.ПунктОтправления.Тип,
		|	КритерииУслугПоставщиков.ПунктНазначения.Тип,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеПостановки,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеСдачи,
		|	ТаблицаТарифов.БазоваяСтавкаНадбавка,
		|	ТаблицаТарифов.НомерКТК,
		|	ТаблицаТарифов.ТипКТК,
		|	ТаблицаТарифов.АдресПогрузкиВыгрузкиСсылка
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТаблицаТарифов.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И (КритерииУслугПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобранныеТарифы.НомерСтроки КАК НомерСтроки,
		|	СобранныеТарифы.КлючАналитики КАК КлючАналитики,
		|	СобранныеТарифы.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СобранныеТарифы.Критерий КАК Критерий,
		|	СобранныеТарифы.НомерПСЦ КАК НомерПСЦ,
		|	СобранныеТарифы.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СобранныеТарифы.СтавкаНДС КАК СтавкаНДС,
		|	СобранныеТарифы.Стоимость КАК Стоимость,
		|	СобранныеТарифы.Номенклатура КАК Номенклатура,
		|	СобранныеТарифы.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	СобранныеТарифы.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ВЫБОР
		|		КОГДА МультиадресаАдресаАдреса.Адрес ЕСТЬ NULL
		|			ТОГДА СобранныеТарифы.АдресСкладаПогрузкиВыгрузки
		|		ИНАЧЕ МультиадресаАдресаАдреса.Адрес
		|	КОНЕЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктОтправленияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктОтправленияТип <> СобранныеТарифы.ТерминалПостановкиТип
		|			ТОГДА СобранныеТарифы.ПунктОтправления.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктОтправления
		|	КОНЕЦ КАК ПунктОтправления,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктНазначенияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктНазначенияТип <> СобранныеТарифы.ТерминалСдачиТип
		|			ТОГДА СобранныеТарифы.ПунктНазначения.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктНазначения
		|	КОНЕЦ КАК ПунктНазначения,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалПостановки <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалПостановки.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалПостановкиТип <> СобранныеТарифы.ПунктОтправленияТип
		|			ТОГДА СобранныеТарифы.ТерминалПостановки.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалПостановки
		|	КОНЕЦ КАК ТерминалПостановки,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалСдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалСдачиТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалСдачиТип <> СобранныеТарифы.ПунктНазначенияТип
		|			ТОГДА СобранныеТарифы.ТерминалСдачи.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалСдачи
		|	КОНЕЦ КАК ТерминалСдачи,
		|	СобранныеТарифы.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СобранныеТарифы.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СобранныеТарифы.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СобранныеТарифы.НомерКТК КАК НомерКТК,
		|	СобранныеТарифы.ТипКТК КАК ТипКТК,
		|	СобранныеТарифы.АдресПогрузкиВыгрузки КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТарифыСАдресами
		|ИЗ
		|	СобранныеТарифы КАК СобранныеТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдресаАдреса
		|		ПО СобранныеТарифы.АдресСкладаПогрузкиВыгрузки = МультиадресаАдресаАдреса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦ
		|ИЗ
		|	НижнийУровеньАдресаВПСЦНомер КАК НижнийУровеньАдресаВПСЦНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВПСЦНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестреНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестре
		|ИЗ
		|	НижнийУровеньАдресаВРеестреНомер КАК НижнийУровеньАдресаВРеестреНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВРеестреНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.НомерСтроки КАК НомерСтроки,
		|	ТарифыСАдресами.КлючАналитики КАК КлючАналитики,
		|	ТарифыСАдресами.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТарифыСАдресами.Критерий КАК Критерий,
		|	ТарифыСАдресами.НомерПСЦ КАК НомерПСЦ,
		|	ТарифыСАдресами.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТарифыСАдресами.СтавкаНДС КАК СтавкаНДС,
		|	ТарифыСАдресами.Стоимость КАК Стоимость,
		|	ТарифыСАдресами.Номенклатура КАК Номенклатура,
		|	ТарифыСАдресами.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	ТарифыСАдресами.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ТарифыСАдресами.ПунктОтправления = ТарифыСАдресами.ТерминалПостановки КАК СовпадениеПунктОтправления,
		|	ТарифыСАдресами.ПунктНазначения = ТарифыСАдресами.ТерминалСдачи КАК СовпадениеПунктНазначения,
		|	ТарифыСАдресами.ПунктОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.ПунктНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка) КАК ПустаяСсылкаМаршрута,
		|	ВЫБОР
		|		КОГДА НижнийУровеньАдресаВРеестре.ВидНайденногоТопонима = ""locality""
		|				ИЛИ НижнийУровеньАдресаВПСЦ.ВидНайденногоТопонима = ""locality""
		|			ТОГДА ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ.Владелец = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка.Владелец
		|		ИНАЧЕ ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|	КОНЕЦ КАК СовпаденииеАдресов,
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТарифыСАдресами.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТарифыСАдресами.НомерКТК КАК НомерКТК,
		|	ТарифыСАдресами.ТипКТК КАК ТипКТК,
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ СборнаяТаблица
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВРеестре КАК НижнийУровеньАдресаВРеестре
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = НижнийУровеньАдресаВРеестре.АдресСкладаПогрузкиВыгрузкиРеестра
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВПСЦ КАК НижнийУровеньАдресаВПСЦ
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = НижнийУровеньАдресаВПСЦ.АдресСкладаПогрузкиВыгрузкиВПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СборнаяТаблица.КлючАналитики КАК КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость КАК Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов КАК ПолноеСовпадениеМаршрута,
		|	СборнаяТаблица.Номенклатура КАК Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК = ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаПорожнийКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ЛОЖЬ
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ЛОЖЬ
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ЛОЖЬ
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ЛОЖЬ
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТаблицаРеестра", Заказы.Выгрузить());
	
	ТаблицаОсновныхСтавок = Запрос.Выполнить().Выгрузить();

	Ошибки = Неопределено;
	
	Для Каждого СтрокаЗаказа ИЗ Заказы Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("КлючАналитики", СтрокаЗаказа.КлючАналитики);
		СтруктураПоиска.Вставить("ЗапросНаАвто", СтрокаЗаказа.ЗапросНаАвто);

		СтрокиОсновнойСтавки = ТаблицаОсновныхСтавок.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиОсновнойСтавки.Количество() = 0 Тогда
			СтрокаЗаказа.ОсновнаяСтавка = 0;
		ИначеЕсли СтрокиОсновнойСтавки.Количество() > 1 Тогда
			СтруктураПоиска.Вставить("ПолноеСовпадениеМаршрута",Истина);
			СтрокиОсновнойСтавки = ТаблицаОсновныхСтавок.НайтиСтроки(СтруктураПоиска);
			Если СтрокиОсновнойСтавки.Количество() = 1 Тогда
				СтрокаЗаказа.ОсновнаяСтавка = СтрокиОсновнойСтавки[0].Стоимость;
			Иначе
				СтрокаЗаказа.ОсновнаяСтавка = 0;
			КонецЕсли;
            СтруктураПоиска.Удалить("ПолноеСовпадениеМаршрута");
		Иначе
			СтрокаЗаказа.ОсновнаяСтавка = СтрокиОсновнойСтавки[0].Стоимость;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти