#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)= Тип("ДокументСсылка.Заявка") Тогда
		//ДИТ Шевченко А.В. 59982 12.12.2022 -начало
		ДоговорДействует = Истина;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Отправка,Дата(1,1,1),Истина);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Прибытие,Дата(1,1,1),Истина);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Отправка,ДанныеЗаполнения.Прибытие);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Дата,Дата(1,1,1),Истина);
		КонецЕсли;
		
		Если НЕ ДоговорДействует Тогда
			Автопролонгация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Договор,"Автопролонгация");
			Если Автопролонгация Тогда
				СообщениеТекст = "Документ не может быть создан. Договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
			Иначе
				СообщениеТекст = "Документ не может быть создан. Срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
			КонецЕсли;
			ВызватьИсключение СообщениеТекст;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Заявка")  Тогда
		ЗаполнитьПоЗаявке(ДанныеЗаполнения);		
	КонецЕсли;
	
	Организация	= Константы.ОсновнаяОрганизация.Получить();
	Создано 	= ТекущаяДатаСеанса();
	Автор 		= Пользователи.ТекущийПользователь();	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	НепроверяемыеРеквизиты = Новый Массив;
	
	РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияВыдачи, "Тип,Страна");
	//ДИТ Шевченко А.В. 11.01.23 63921 -начало
	//Если РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Субъект И РеквизитыЛокации.Страна = Справочники.СтраныМира.КИТАЙ Тогда
	//Евросиб - АСуслов 05.05.2023 11:40:02 #67492
	//(
	//Если РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Субъект И НЕ РеквизитыЛокации.Страна = Справочники.СтраныМира.Россия Тогда
	Если РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.НаселенныйПункт И НЕ РеквизитыЛокации.Страна = Справочники.СтраныМира.Россия Тогда
	//)
	//Евросиб - АСуслов 05.05.2023 11:40:08 #67492
	//ДИТ Шевченко А.В. 11.01.23 63921 -конец	
		НепроверяемыеРеквизиты.Добавить("ТерминалВыдачи");
		НепроверяемыеРеквизиты.Добавить("Автоперевозка");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОчиститьПодстокиКонтейнеров();											
	
	// Если это отмена проведения или установлена пометка удаления, то проверим, что КТК не добавлены в заявку.
	// Если добавлены, то запрещаем действие.
	
	//ДИТ Шевченко А.В. 51340 17.10.2022 -начало
	Если Проведен И ПометкаУдаления Тогда	
		ТекстОшибки = "Перед пометкой на удаление необходимо отменить проведение документа!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
															ТекстОшибки,
															ЭтотОбъект,
															,
															,
															Отказ);
	КонецЕсли;
	//ДИТ Шевченко А.В. 51340 17.10.2022 -конец
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И ПометкаУдаления Тогда 
		ШаблонСообщения = "Контейнер %1 добавлен в заявку %2.
					|Необходимо удалить контейнер из заявки перед отменой проведения документа";
		МассивИдентификаторов = Контейнеры.Выгрузить().ВыгрузитьКолонку("ИдентификаторСтроки");
		ЗаявкиСтрок = Документы.РелизКлиента.ПолучитьЗаявки(МассивИдентификаторов);
		Для Каждого ТекущийКТК Из Контейнеры Цикл
			ЗаявкаТекущегоКТК = ЗаявкиСтрок.Получить(ТекущийКТК.ИдентификаторСтроки);
			Если ЗаявкаТекущегоКТК <> Неопределено Тогда
				//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
				//ТекстОшибки = СтрШаблон(ШаблонСообщения, ТекущийКТК.КонтейнерУдалить, ЗаявкаТекущегоКТК);
				ТекстОшибки = СтрШаблон(ШаблонСообщения, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийКТК.КлючАналитикиПеревозки,"Контейнер"), ЗаявкаТекущегоКТК);
				//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
															ТекстОшибки,
															ЭтотОбъект,
															ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущийКТК.НомерСтроки, "Контейнер"),
															,
															Отказ);
			КонецЕсли;	
		КонецЦикла;  
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		// Task №45185. При отмене проведения документа Релиз клиента у которого имеются контейнеры в 
		// ТЧ – по таким контейнерам необходимо устанавливать статус "Свободен" в АРМ КТК Текущие данные.
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
		ТаблицаКонтейнеров = ПолучитьТаблицуКТКИзКлючейАналитикиТЧ();
		//ПроставитьСтатусКТК(Контейнеры.ВыгрузитьКолонку("Контейнер"),  Перечисления.СтатусыКТК.Свободен);
		ПроставитьСтатусКТК(ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер"),  Перечисления.СтатусыКТК.Свободен);
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец       
		
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Начало 07.02.2025
		УдаленныеКТК = ОбщегоНазначенияКлиентСервер.СвернутьМассив( ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер"));
		ДополнительныеСвойства.Вставить("УдаленныеКТК", УдаленныеКТК);
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Конец 07.02.2025
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023 - если были изменения на форме, то берем данные ключей собранные перед записью на форме
		Если не ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда 
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
		
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало 
		//РаботаСТабличнымиЧастями.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "Контейнеры", Новый Структура("Контейнер"), Отказ);
		МассивСообщений = ПроверитьОтсутствиеДублейКТКВКлючахАналитики(Отказ);
		
		Для Каждого СообщениеДуль Из МассивСообщений Цикл
			ОбщегоНазначения.СообщитьПользователю(СообщениеДуль);
		КонецЦикла;
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец  
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023
		КонецЕсли;
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
		
		// Евросиб Фролов (16.02.2022 Task №46605
		// Если локация сдачи (мультилокация) содержит сток, то сообщим об этом пользователю. 
		Если ЛокацияПодходит(ЛокацияСдачи, Истина) Тогда
			ОбщегоНазначения.СообщитьПользователю("Локация сдачи содержит сток. Сохранение документа невозможно.",
													ЭтотОбъект,
													"ЛокацияСдачи",
													,
													Отказ);
		КонецЕсли;
		// Если сток сдачи (мультилокация) содержит типы локации отличные от стока, то сообщим об этом пользователю. 
		Если ЛокацияПодходит(СтокСдачи, Ложь) Тогда
			ОбщегоНазначения.СообщитьПользователю("Сток сдачи содержит типы локаций отличные от стока. Сохранение документа невозможно.",
													ЭтотОбъект,
													"СтокСдачи",
													,
													Отказ);
		КонецЕсли;										
		// Евросиб Фролов)
		
		// ++ ДИТ_Агафонов_task 50388 01.07.2022
		//Убираем
		//Если ВыдачаОтСобственника И НомернаяВыдача Тогда
		//	ОбщегоНазначения.СообщитьПользователю("Запрещена одновременная установка признаков ""Выдача от собственника"" и ""Номерная выдача""",
		//										ЭтотОбъект,
		//										"ВыдачаОтСобственника",
		//										,
		//										Отказ);
		//КонецЕсли;
		// -- ДИТ_Агафонов_task 50388 01.07.2022
		
		//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
		РеквизитыЛокации 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияВыдачи, "Тип,Страна");
		//ДИТ Шевченко А.В. 11.01.23 63921 -начало
		//ЭтоЛокацияКитай 	= (РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Субъект И РеквизитыЛокации.Страна = Справочники.СтраныМира.КИТАЙ);
		//Евросиб - АСуслов 05.05.2023 11:39:21 #67492
		//(
		//ЭтоЛокацияНеРоссия 	= (РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Субъект И НЕ РеквизитыЛокации.Страна = Справочники.СтраныМира.Россия);
		ЭтоЛокацияНеРоссия 	= (РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.НаселенныйПункт И НЕ РеквизитыЛокации.Страна = Справочники.СтраныМира.Россия);
		//)
		//Евросиб - АСуслов 05.05.2023 11:39:23 #67492
		НеВыполнятьПроверкиЛокацииНеРоссия = ЭтоЛокацияНеРоссия И РежимЗаписи = РежимЗаписиДокумента.Проведение;
		//ДИТ Шевченко А.В. 11.01.23 63921 -конец
		//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	
		Если ВыдачаОтСобственника Тогда
			Если Не ЗначениеЗаполнено(РелизСобственника) Тогда
		
				ОбщегоНазначения.СообщитьПользователю("Не заполнен релиз собственника",
												ЭтотОбъект,
												"РелизСобственника",
												,
												Отказ);
			КонецЕсли;										
		
			Если Не ЗначениеЗаполнено(СобственникКТК) Тогда
		
				ОбщегоНазначения.СообщитьПользователю("Не заполнен собственник КТК",
												ЭтотОбъект,
												"СобственникКТК",
												,
												Отказ);
			КонецЕсли;
		Иначе
			
			//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
			//Если Не ЗначениеЗаполнено(СтокВыдачи) Тогда
			Если Не НеВыполнятьПроверкиЛокацииНеРоссия И Не ЗначениеЗаполнено(СтокВыдачи) Тогда
			//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
			
				ОбщегоНазначения.СообщитьПользователю("Не заполнен сток выдачи",
												ЭтотОбъект,
												"СтокВыдачи",
												,
												Отказ);
			КонецЕсли;	
			
		КонецЕсли; 
		
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023 
		//проверку по ключам аналитики проводим, если нет изменений данных ключей на форме  
		Если не ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)
		|	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|	;
		|	ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)
		|	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля)";
		
		Запрос.УстановитьПараметр("Ссылка", Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ТЗПерваяМиляКлючиАналитики = РезультатЗапроса[0].Выгрузить();
		ТЗПоследняяМиляКлючиАналитики = РезультатЗапроса[1].Выгрузить();
		
		//ТЗПерваяМиляКлючиАналитики 	  = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"),Перечисления.ЭтапыПеревозки.ПерваяМиля);
		//ТЗПоследняяМиляКлючиАналитики = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"),Перечисления.ЭтапыПеревозки.ПоследняяМиля);
		
		Для Каждого ТекущаяСтрока Из Контейнеры Цикл
			
			ДатаВозвратаКлиентомП = Дата(1,1,1);
			ДатаВывозаП = Дата(1,1,1);	
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.КлючАналитикиПеревозки) Тогда
				НайденнаяСтрокаТЗПерваяМиля 	= ТЗПерваяМиляКлючиАналитики.Найти(ТекущаяСтрока.КлючАналитикиПеревозки);
				Если НайденнаяСтрокаТЗПерваяМиля <> Неопределено Тогда
					ДатаВывозаП = НайденнаяСтрокаТЗПерваяМиля.ДатаВыдачиКТКСТерминала;
				КонецЕсли;
				НайденнаяСтрокаТЗПоследняяМиля 	= ТЗПоследняяМиляКлючиАналитики.Найти(ТекущаяСтрока.КлючАналитикиПеревозки);
				Если НайденнаяСтрокаТЗПоследняяМиля <> Неопределено Тогда
					ДатаВозвратаКлиентомП = НайденнаяСтрокаТЗПоследняяМиля.ДатаСдачиКТКНаТерминал;
				КонецЕсли;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ДатаВозвратаКлиентомП) Тогда	
				
				// Если заполнена дата возврата контейнера и не заполнена дата вывоза, то ошибка
				Если Не ЗначениеЗаполнено(ДатаВывозаП) Тогда
					ОбщегоНазначения.СообщитьПользователю(
												"Не указана дата вывоза контейнера при заполненной дате возврата для него",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущаяСтрока.НомерСтроки, "ДатаВывоза"),
												,
												Отказ);
				КонецЕсли;
			
			КонецЕсли;
			
			//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
			//Если Не ЗначениеЗаполнено(ТекущаяСтрока.КонтейнерУдалить) Тогда
			Если Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"Контейнер")) Тогда
			//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец	
				
				Если Не ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтрокиТС)
					ИЛИ Не ПустаяСтрока(ТекущаяСтрока.СдачаКонтейнераФИОВодителяУдалить)
					ИЛИ Не ПустаяСтрока(ТекущаяСтрока.СдачаКонтейнераРегНомерТСУдалить)
					ИЛИ (ЗначениеЗаполнено(ДатаВывозаП) И Не ВыдачаОтСобственника)
					ИЛИ ЗначениеЗаполнено(ДатаВозвратаКлиентомП)
					ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтрокиПеревозчика) Тогда
					ОбщегоНазначения.СообщитьПользователю(
												"Поле ""Контейнер"" не заполнено",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущаяСтрока.НомерСтроки, "Контейнер"),
												,
												Отказ);
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЦикла;	
		
		Если Не НомернаяВыдача
			Или НомернаяВыдача И СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.Согласован Тогда
			ПроверитьКоличествоТранспортныхСредств(Отказ);
		КонецЕсли;
											
		Если НомернаяВыдача Тогда
			
			Если СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.Согласован Тогда // по новому ФТ, было без проверки статуса согласования				
				// Проверим, что количество строк с заполненными КТК совпадает с общим количеством КТК
				//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
				//СтрокиБезКТК = Контейнеры.НайтиСтроки(Новый Структура("Контейнер", Справочники.те.ПустаяСсылка()));
					
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЗ.КлючАналитикиПеревозки КАК Ключ
				|ПОМЕСТИТЬ ВТ_Ключи
				|ИЗ
				|	&ТЗ КАК ТЗ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_Ключи.Ключ КАК Ключ
				|ИЗ
				|	ВТ_Ключи КАК ВТ_Ключи
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
				|		ПО ВТ_Ключи.Ключ = КлючиАналитикиПеревозки.Ссылка
				|ГДЕ
				|	КлючиАналитикиПеревозки.Контейнер = &Контейнер";
				
				Запрос.УстановитьПараметр("ТЗ", Контейнеры.Выгрузить(,"КлючАналитикиПеревозки"));
				Запрос.УстановитьПараметр("Контейнер", Справочники.ТЕ.ПустаяСсылка());
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				СтрокиБезКТК = РезультатЗапроса.Количество();

				//КоличествоСтрокСКТК = Контейнеры.Количество() - СтрокиБезКТК.Количество();
				КоличествоСтрокСКТК = Контейнеры.Количество() - СтрокиБезКТК;
				//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
				Если КоличествоСтрокСКТК <> ОбщееКоличествоКТКВРелизе Тогда
					//ОбщегоНазначения.СообщитьПользователю("Заполненное количество контейнеров не совпадает с общим количество контейнеров в релизе",
					ОбщегоНазначения.СообщитьПользователю("Количество контейнеров не соответствует указанному в поле ""Общее количество КТК в релизе"". Проведение невозможно",
												ЭтотОбъект,
												"ОбщееКоличествоКТКВРелизе",
												,
												Отказ);
				КонецЕсли;			
			Иначе
				// Если номерная выдача и статус согласования КТК "Не согласовано", то в АРМ КТК будет добвлен статус "Предварительный резерв".
				// Зафиксируем в документе дату простановки этого статуса, чтобы потом ориентироваться на нее при отправке уведомлений по почте.
				
				//КТКБезДатыВывоза = Контейнеры.НайтиСтроки(Новый Структура("ДатаВывоза", Дата(1, 1, 1)));
				//ДатаРезерва = ТекущаяДата();	
				//Для Каждого ТекКТКБезДатыВывоза Из КТКБезДатыВывоза Цикл
				//	ТекКТКБезДатыВывоза.ДатаПредварительногоРезерва = ДатаРезерва;
				//КонецЦикла;
				
				ДатаРезерва = ТекущаяДата();
				МассивКлючей = Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки");
				
				ТаблицаПолейКлючей = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,Перечисления.ЭтапыПеревозки.ПерваяМиля);
				
				Для Каждого СтрокаК Из Контейнеры Цикл
					СтрокаЭтапаПеревозки = ТаблицаПолейКлючей.Найти(СтрокаК.КлючАналитикиПеревозки,"КлючАналитикиПеревозки");
					Если СтрокаЭтапаПеревозки = Неопределено ИЛИ СтрокаЭтапаПеревозки.ДатаВыдачиКТКСТерминала = Дата(1,1,1) Тогда
						СтрокаК.ДатаПредварительногоРезерва = ДатаРезерва;
					КонецЕсли;	
				КонецЦикла;	
				
			КонецЕсли;
			
			// По удаленным КТК проставим статус "Свободен"
			ПроверитьУдаленныеКТК(ДополнительныеСвойства);
		КонецЕсли;	 
		
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023
		КонецЕсли;
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Если НЕ ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Ссылка,"Проведен") //ДИТ Шевченко А.В. 51340 12.10.2022	
				И Не СтатусОтправкиПолученияОтветаТерминала = Справочники.СибурСтатусыЗаявок.НеОтправлен Тогда // ДИТ US 57149 TA 66036 Евсенкин М.А. 28.02.2023
				ИзмененыКлючевыеПоля = Истина;
				СтатусОтправкиПолученияОтветаТерминала = Справочники.СибурСтатусыЗаявок.ВерсияОтправкиУстарела;
				ПисьмоНаЗапрос = Документы.ЭлектронноеПисьмоИсходящее.ПустаяСсылка();			
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	

	// Заполним редактора и дату изменения
	Если Не ЭтоНовый() Тогда
   		Изменено = ТекущаяДатаСеанса();
		Редактор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Заполним номер релиза
	Если Не ЗначениеЗаполнено(НомерРелиза) Тогда
		// Евросиб Фролов (29.04.2022 Ticket №0270765
		//НомерРелиза = Документы.РелизКлиента.ПолучитьНомерРелиза(ЭтотОбъект, ВыдачаОтСобственника, РелизСобственника, Номер);
		НомерРелиза = Документы.РелизКлиента.ПолучитьНомерРелиза(ЭтотОбъект, ВыдачаОтСобственника, РелизСобственника);
		// Евросиб Фролов)
		
		// Проверим, что номер релиза заполнился
		Если Не ЗначениеЗаполнено(НомерРелиза) 
			// Евросиб Фролов (30.05.2022 Task №49741
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			// Евросиб Фролов)
			ОбщегоНазначения.СообщитьПользователю("Не заполнен номер релиза",
												ЭтотОбъект,
												"НомерРелиза",
												,
												Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ВыдачаОтСобственника Тогда
		РелизСобственника = Документы.РелизСобственника.ПустаяСсылка();
	КонецЕсли;	

	Если Не НомернаяВыдача Тогда
		СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.ПустаяСсылка();
	Иначе
		Если Не ЗначениеЗаполнено(СтатусСогласованияСпискаКТК) Тогда
			СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.НеСогласован;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаОтправкиЗапросаТерминалу) Тогда
		ИзмененыКлючевыеПоля = Ложь;
	КонецЕсли;	     
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023 ПроверкаИЗаписьДанныхКлючейАналитикиПеревозки
	//Убрали из формы интерактивную запись ключей аналитики при изменении реквизитов ТЧ. 
	//Теперь все изменения в форме фиксируются в доп свойствах "ДанныеДляОбновленияКлючейАналитики"
	//Здесь сначала проверим корректность заполнения данных для ключей, потом запишем их.
	#Область ПроверкаИЗаписьДанныхКлючейАналитикиПеревозки  
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда
		
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики; 
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда   
			МассивСообщений = ПроверитьОтсутствиеДублейКТКВКлючахАналитики(Отказ, ДанныеДляОбновленияКлючейАналитики);
			Для Каждого СообщениеДубль Из МассивСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(СообщениеДубль);
			КонецЦикла;	
			
			Для Каждого ТекущаяСтрока Из ДанныеДляОбновленияКлючейАналитики Цикл
				
				ДатаВозвратаКлиентомП = Дата(1,1,1);
				ДатаВывозаП = Дата(1,1,1);	
				
				СтрокаТЗПерваяМиля = ТекущаяСтрока.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики;
				ДатаВывозаП = СтрокаТЗПерваяМиля.ДатаВыдачиКТКСТерминала;
				
				СтрокаТЗПоследняяМиля 	= ТекущаяСтрока.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики;
				ДатаВозвратаКлиентомП = СтрокаТЗПоследняяМиля.ДатаСдачиКТКНаТерминал;
				
				Если ЗначениеЗаполнено(ДатаВозвратаКлиентомП) Тогда	
					
					// Если заполнена дата возврата контейнера и не заполнена дата вывоза, то ошибка
					Если Не ЗначениеЗаполнено(ДатаВывозаП) Тогда
						ОбщегоНазначения.СообщитьПользователю(
						"Не указана дата вывоза контейнера при заполненной дате возврата для него в строке " + ТекущаяСтрока.НомерСтроки,,,, Отказ);
					КонецЕсли;
					
				КонецЕсли;  
				
				ТекущаяСтрокаТЧ = Контейнеры.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");
				
				Если Не ЗначениеЗаполнено(ТекущаяСтрока.Контейнер) Тогда
					
					Если Не ПустаяСтрока(ТекущаяСтрокаТЧ.ИдентификаторСтрокиТС)
						ИЛИ Не ПустаяСтрока(ТекущаяСтрокаТЧ.СдачаКонтейнераФИОВодителяУдалить)
						ИЛИ Не ПустаяСтрока(ТекущаяСтрокаТЧ.СдачаКонтейнераРегНомерТСУдалить)
						ИЛИ (ЗначениеЗаполнено(ДатаВывозаП) И Не ВыдачаОтСобственника)
						ИЛИ ЗначениеЗаполнено(ДатаВозвратаКлиентомП)
						ИЛИ ЗначениеЗаполнено(ТекущаяСтрокаТЧ.ИдентификаторСтрокиПеревозчика) Тогда
						ОбщегоНазначения.СообщитьПользователю(
						"Поле ""Контейнер"" не заполнено в строке " + ТекущаяСтрока.НомерСтроки,,,,Отказ);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
						
			Если НомернаяВыдача Тогда
				
				Если СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.Согласован Тогда // по новому ФТ, было без проверки статуса согласования				
					// Проверим, что количество строк с заполненными КТК совпадает с общим количеством КТК
					
					СтрокиСПустымКТК = ДанныеДляОбновленияКлючейАналитики.НайтиСтроки(Новый Структура("Контейнер", Справочники.ТЕ.ПустаяСсылка()));
					СтрокиБезКТК = СтрокиСПустымКТК.Количество(); 
					
					КоличествоСтрокСКТК = Контейнеры.Количество() - СтрокиБезКТК;
					Если КоличествоСтрокСКТК <> ОбщееКоличествоКТКВРелизе Тогда
						ОбщегоНазначения.СообщитьПользователю("Количество контейнеров не соответствует указанному в поле ""Общее количество КТК в релизе"". Проведение невозможно",
						ЭтотОбъект,
						"ОбщееКоличествоКТКВРелизе",
						,
						Отказ);
					КонецЕсли;			
				Иначе
					// Если номерная выдача и статус согласования КТК "Не согласовано", то в АРМ КТК будет добвлен статус "Предварительный резерв".
					// Зафиксируем в документе дату простановки этого статуса, чтобы потом ориентироваться на нее при отправке уведомлений по почте.
					
					ДатаРезерва = ТекущаяДата();   
					
					Для каждого ТекущаяСтрока Из Контейнеры Цикл
						СтрокаДанныхКлюча = ДанныеДляОбновленияКлючейАналитики.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");	
						СтрокаДанныхПерваяМиля = СтрокаДанныхКлюча.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики;
					    Если СтрокаДанныхПерваяМиля.ДатаВыдачиКТКСТерминала = Дата(1,1,1) Тогда
							ТекущаяСтрока.ДатаПредварительногоРезерва = ДатаРезерва;
						КонецЕсли;	
					КонецЦикла;
					
				КонецЕсли;
				
				// По удаленным КТК проставим статус "Свободен"
				ПроверитьУдаленныеКТК(ДополнительныеСвойства);
			КонецЕсли;	 	
			
		КонецЕсли;  
		
		// все проверки пройдены, записываем ключи
		Если не Отказ и (РежимЗаписи = РежимЗаписиДокумента.Запись
			или РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда  
			//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Начало 07.02.2025
			КонтейнерыДоЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Ссылка.Контейнеры.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки"), "Контейнер");
			//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Конец 07.02.2025
			Для каждого ТекущаяСтрока Из Контейнеры Цикл  
				СтрокаДляОбновления = ДанныеДляОбновленияКлючейАналитики.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");   
				ВерсияКлючаДоОбновления = СтрокаДляОбновления.КлючАналитикиПеревозки.ВерсияДанных; 
				ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтрокаДляОбновления.ДанныеКлюча); 
				ТекущаяСтрока.КлючАналитикиПеревозки = ОбновленныйКлюч.КлючАналитикиПеревозки;   
			КонецЦикла; 
			
			//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Начало 07.02.2025 
			КонтейнерыПослеЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Контейнеры.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки"), "Контейнер");
			УдаленныеКТК = Новый Массив;
			Если КонтейнерыПослеЗаписи.Количество() < КонтейнерыДоЗаписи.Количество() Тогда   
				Для каждого КлючИКТК Из КонтейнерыДоЗаписи Цикл
					Если ЗначениеЗаполнено(КлючИКТК.Значение) и КонтейнерыПослеЗаписи.Получить(КлючИКТК.Ключ) = Неопределено Тогда
						УдаленныеКТК.Добавить(КлючИКТК.Значение);	
					КонецЕсли;
				КонецЦикла;		
			КонецЕсли;
			Если УдаленныеКТК.Количество() > 0 Тогда
				Если ДополнительныеСвойства.Свойство("УдаленныеКТК") = Истина Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.УдаленныеКТК, УдаленныеКТК, Истина);
				Иначе
					ДополнительныеСвойства.Вставить("УдаленныеКТК", УдаленныеКТК);
				КонецЕсли;
			КонецЕсли;
			//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 101741 Конец 07.02.2025
		КонецЕсли;  
		
	КонецЕсли;
	#КонецОбласти   
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
	
	// Если водители или перевозчики были удалены из табличных частей,
	// то нужно удалить их привязку с КТК.
	//Для Каждого ТекущийКТК Из Контейнеры Цикл
	//	Если ТранспортныеСредстваУдалить.Найти(ТекущийКТК.ИдентификаторСтрокиТС, "ИдентификаторСтроки") = Неопределено Тогда
	//		ТекущийКТК.ИдентификаторСтрокиТС = "";
	//	КонецЕсли;
	//КонецЦикла;
	
	// Евросиб Фролов (14.02.2022 Ticket№ 46606
	// При отмене проведения уведомляем терминал.
	// Уведомляем если отмена выполнена успешно.
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
	//	И Не Отказ
	//	И ЗапросОтправленТерминалу Тогда
	//	УведомитьТерминалОбОтмене();
	//КонецЕсли;
	// Евросиб Фролов)
	
	Для Каждого ТекКТК Из Контейнеры Цикл
		Если Не ЗначениеЗаполнено(ТекКТК.ИдентификаторСтроки) Тогда
			ТекКТК.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;	
	КонецЦикла;    
	
	Документы.РелизКлиента.ОбновитьИтоги(ЭтотОбъект);	

	// Евросиб Фролов (28.02.2022 Task №46354	
	ДополнительныеСвойства.Вставить("ОбъектДоЗаписи", ПодсвечиваниеПолейОбъектов.ПолучитьСтруктуруРеквизитовОбъекта(Ссылка));
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	//ОчищатьЗаписиРегистраПодсветки = ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан
	//								И ВнутреннийСтатусЗапроса <> Ссылка.ВнутреннийСтатусЗапроса;
	//ДополнительныеСвойства.Вставить("ОчищатьЗаписиРегистраПодсветки", ОчищатьЗаписиРегистраПодсветки);
	// Евросиб Фролов)

	// ++ ДИТ_Агафонов_task 57613 19.10.2022
	//Остальное в обработке проведения
	Если Не Отказ и РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьУдалитьСвязьРелизов(Истина);    
	КонецЕсли;
	// -- ДИТ_Агафонов_task 57613 19.10.2022
	
	//ДИТ Шевченко А.В. US 62489 ТА 68009 02.05.2023 -Начало
	Если НЕ Отказ И ЗначениеЗаполнено(Ссылка) Тогда
		Если СтатусОтправкиПолученияОтветаТерминала <> Ссылка.СтатусОтправкиПолученияОтветаТерминала Тогда
			ОбновитьСтатусОтправкиВСвязанныхЗапросахНаАвтоперевозку();
		КонецЕсли;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62489 ТА 68009 02.05.2023 -Конец  
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 27.02.2024
	Если не Отказ и (не ЗначениеЗаполнено(Ссылка) или Ссылка.ТерминалВыдачи <> ТерминалВыдачи или Ссылка.СтокСдачи <> СтокСдачи) Тогда
		ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление();
	КонецЕсли;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 27.02.2024
КонецПроцедуры

Процедура ПриЗаписи(Отказ, РежимЗаписи)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторСтрокиЗаявки = "";
	ДополнительныеСвойства.Свойство("ИдентификаторСтрокиЗаявки", ИдентификаторСтрокиЗаявки);
	
	Если Не Отказ
		И ЗначениеЗаполнено(Заявка)
		И ТипЗнч(ИдентификаторСтрокиЗаявки) = Тип("Строка")
		И Не ПустаяСтрока(ИдентификаторСтрокиЗаявки) Тогда
		РегистрыСведений.РелизыКлиентовЗапросовНаКТК.ПривязатьРелизКЗапросу(Заявка, ИдентификаторСтрокиЗаявки, Ссылка, Отказ);
		//Евросиб Коханенко Н.А. 02.04.2024 (( #80513 			
		//ЗаполнитьРегистрСвязанныеОбъектыПоРелизуКлиента(); // Рыбьяков К.А. Перенес в общий модуль СвязанныеДокументыСервер
		//Евросиб Коханенко Н.А. 02.04.2024 )) #80513 
	КонецЕсли;        
	
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 06.02.2025 
	Если не Отказ и ДополнительныеСвойства.Свойство("УдаленныеКТК") и ДополнительныеСвойства.УдаленныеКТК.Количество() Тогда
		СтатусыКТКСервер.ПроверитьИзменениеИЗаписатьСтатусыКТК(Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 06.02.2025
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерРелиза = "";
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
	//МассивКонтейнеров = Контейнеры.ВыгрузитьКолонку("Контейнер");
	ТаблицаКонтейнеров = ПолучитьТаблицуКТКИзКлючейАналитикиТЧ();
	МассивКонтейнеров = ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер");
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
	
	ТаблицаСведенийТекущиеДанные = СведенияПоКТКИзАРМ(МассивКонтейнеров);
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)
		|	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|	И КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)
		|	;
		|	ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)
		|	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
		|	И КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗПерваяМиляКлючиАналитики = РезультатЗапроса[0].Выгрузить();
    ТЗПоследняяМиляКлючиАналитики = РезультатЗапроса[1].Выгрузить();
	
	//ТЗПерваяМиляКлючиАналитики 	  = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"),Перечисления.ЭтапыПеревозки.ПерваяМиля);
	//ТЗПоследняяМиляКлючиАналитики = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки"),Перечисления.ЭтапыПеревозки.ПоследняяМиля);
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
	ВыполнитьЗаписьВКлиентскоеОперирование(МассивКонтейнеров, Отказ);
	
	Для Каждого ТекущийКТК Из Контейнеры Цикл
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало	
		ВыполнитьЗаписьВТекущиеДанные(ТекущийКТК, Отказ, ТаблицаСведенийТекущиеДанные,ТЗПерваяМиляКлючиАналитики,ТЗПоследняяМиляКлючиАналитики);
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
		Если ДополнительныеСвойства.Свойство("МассивУдаленныхКТК") = Истина Тогда
			ПроставитьСтатусКТК(ДополнительныеСвойства.МассивУдаленныхКТК,  Перечисления.СтатусыКТК.Свободен);
		КонецЕсли;	
		
	КонецЦикла; 
	
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 06.02.2025
	СтатусыКТКСервер.ПроверитьИзменениеИЗаписатьСтатусыКТК(Ссылка, ДополнительныеСвойства); 
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 06.02.2025
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ДвиженияПодсветкаФормДокументов(Отказ, РежимПроведения);
	// Евросиб Фролов)
	
	// ++ ДИТ_Агафонов_task 57613 19.10.2022
	//Нужно выполнять всегда, могут снять флажок ВыдачаОтСобственника
	ПроверитьУдалитьСвязьРелизов();
	// -- ДИТ_Агафонов_task 57613 19.10.2022
	
	// Евросиб Фролов (30.05.2022 Task №49741
	Если ВыдачаОтСобственника Тогда
		ОбновитьРелизСобственника(КонтейнерыДляРелизаСобственника(), Отказ);
	КонецЕсли;	
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. BUG 75526 TA 75527 02.10.23 -Начало
	Документы.РелизКлиента.ЗакрытьЗадачиВЗаявке(Заявка,СтатусОтправкиПолученияОтветаТерминала);
	//ДИТ Шевченко А.В. BUG 75526 TA 75527 02.10.23 -Конец 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	стоки_КлиентскоеОперирование.Период КАК Период,
	|	стоки_КлиентскоеОперирование.КТК КАК КТК
	|ПОМЕСТИТЬ втЗаписиСРелизом
	|ИЗ
	|	РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
	|ГДЕ
	|	стоки_КлиентскоеОперирование.кл_Релиз = &Релиз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_КлиентскоеОперирование.Период КАК Период,
	|	стоки_КлиентскоеОперирование.КТК КАК КТК
	|ИЗ
	|	 втЗаписиСРелизом КАК втЗаписиСРелизом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
	|		ПО втЗаписиСРелизом.КТК = стоки_КлиентскоеОперирование.КТК
	|			И втЗаписиСРелизом.Период <= стоки_КлиентскоеОперирование.Период";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Релиз", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.КТК.Установить(Выборка.КТК);
		НаборЗаписей.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

Процедура ОбновитьСтатусОтправкиВСвязанныхЗапросахНаАвтоперевозку() //ДИТ Шевченко А.В. US 62489 ТА 68009 02.05.2023
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Релиз = &Релиз
		|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Проведен
		|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Релиз", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрокиКвыгрузке = Новый ТаблицаЗначений;
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗапросОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СтрокиКвыгрузке.Очистить();
		Для Каждого СтрокаК Из ЗапросОб.Контейнеры Цикл
			Если СтрокаК.Релиз = Ссылка Тогда
				СтатусДоИзменения = СтрокаК.СтатусОтправкиЗапросаНаТерминалВыдачи;
				Документы.ЗапросНаАвтоперевозку.ЗаполнитьСтатусОтправкиЗапросаНаТерминалВыдачиПоРелизу(СтрокаК,ЭтотОбъект);
				Если СтрокаК.СтатусЗапросаНаАвтоперевозку <> Перечисления.СтатусЗапросаНаПеревозку.Отменен
					И СтрокаК.СтатусЗаказаНаТС <> Перечисления.СтатусЗаказаНаТс.ВыданВРейс
					И СтрокаК.СтатусЗаказаНаТС <> Перечисления.СтатусЗаказаНаТс.Закрыт Тогда
					Если СтрокаК.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен Тогда
						Если СтрокаК.СтатусОтправкиЗапросаНаТерминалВыдачи <> СтатусДоИзменения Тогда
							ЗаполнитьЗначенияСвойств(СтрокиКвыгрузке.Добавить(),СтрокаК);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			КонецЕсли;	
		КонецЦикла;
		Попытка
			ЗапросОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗапросаНаАвто"
				, УровеньЖурналаРегистрации.Ошибка, ЗапросОб.Метаданные(), ЗапросОб.Ссылка, ОписаниеОшибки());
			Документы.ЗапросНаАвтоперевозку.ОтправитьПисьмоОбОшибкахЗаписиЗапросаНаАвто("Ошибка записи запроса на авто при изменение статуса отправки/получения статуса от терминала.",ЗапросОб.Ссылка);
			Возврат;
		КонецПопытки;
		Если СтрокиКвыгрузке.Количество() Тогда
			ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", ЗапросОб.Ссылка, СтрокиКвыгрузке);
			ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьПоЗаявке(ДанныеЗаполнения)

	РеквизитыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заявка, "Организация");
	Организация = РеквизитыДокументаОснования.Организация;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ТаблицаТранспортныхСредств = ДанныеЗаполнения.ТранспортныеСредства.Получить();	
	
	//ТранспортныеСредстваУдалить.Загрузить(ТаблицаТранспортныхСредств);
	//ДИТ Шевченко А.В. 59364 13.03.2023 -начало
	//ТаблицаТранспортныхСредствПоследняяМиля = ДанныеЗаполнения.ТранспортныеСредстваПоследняяМиля.Получить();	
	//ТранспортныеСредстваПоследняяМиляУдалить.Загрузить(ТаблицаТранспортныхСредствПоследняяМиля);
	//ДИТ Шевченко А.В. 59364 13.03.2023 -конец
	
	МассивКлючейИтог = Новый Массив;
	ТаблицаТранспортныхСредств = ДанныеЗаполнения.ТранспортныеСредства.Получить();
	Для Каждого Стр Из ТаблицаТранспортныхСредств Цикл
		МассивКлючейИтог.Добавить(Стр.КлючАналитикиПеревозки);
	КонецЦикла;	
	ТаблицаТранспортныхСредствПоследняяМиля = ДанныеЗаполнения.ТранспортныеСредстваПоследняяМиля.Получить();
	Для Каждого Стр Из ТаблицаТранспортныхСредствПоследняяМиля Цикл
		МассивКлючейИтог.Добавить(Стр.КлючАналитикиПеревозки);
	КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//ДИТ Шевченко А.В. US 62421 TA 64347 21.02.2023 -начало
	МассивКлючей = ПолучитьКлючиИзЗапросаНаАвтоперевозку(ДанныеЗаполнения.Заявка,ДанныеЗаполнения.ИдентификаторСтроки);
	//ДИТ Шевченко А.В. 59364 13.03.2023 -начало
	Для Каждого КлючМ Из МассивКлючей Цикл
		МассивКлючейИтог.Добавить(КлючМ);
	КонецЦикла;  
	
	// ДИТ US 78243 ТА 80591 Сержантова А.С. Начало: 07.02.2024
	МассивКлючейИтог = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКлючейИтог);
	// ДИТ US 78243 ТА 80591 Сержантова А.С. Конец: 07.02.2024
	
	Для Каждого КлючМ Из МассивКлючейИтог Цикл
		НовСтрока = Контейнеры.Добавить();
		НовСтрока.КлючАналитикиПеревозки = КлючМ;
	КонецЦикла;
	
	//Субботин 77659 15.12.2023 Начало
	//КолДобавляемыхСтрок = ДанныеЗаполнения.ОбщееКоличествоКТКВРелизе - МассивКлючейИтог.Количество();
	//Для Инд = 1 По КолДобавляемыхСтрок Цикл
	//	НовСтрока = Контейнеры.Добавить();
	//	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
	//	СтруктураКлюча.Вставить("Заявка",ДанныеЗаполнения.Заявка);
	//	СтрОтвет = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
	//	НовСтрока.КлючАналитикиПеревозки = СтрОтвет.КлючАналитикиПеревозки;
	//КонецЦикла; 
	//
	//Субботин 77659 15.12.2023 Начало 
	Если ДанныеЗаполнения.МассивКТК.Количество() = 0 тогда  
		КолДобавляемыхСтрок = ДанныеЗаполнения.ОбщееКоличествоКТКВРелизе - МассивКлючейИтог.Количество();
		Для Инд = 1 По КолДобавляемыхСтрок Цикл
			НовСтрока = Контейнеры.Добавить();
			СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
			СтруктураКлюча.Вставить("Заявка",ДанныеЗаполнения.Заявка);
			СтрОтвет = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
			НовСтрока.КлючАналитикиПеревозки = СтрОтвет.КлючАналитикиПеревозки;
		КонецЦикла;
	Иначе
		Для Каждого Ктк Из ДанныеЗаполнения.МассивКТК Цикл
			СуществющийКлюч = Контейнеры.Найти(ДанныеЗаполнения.СоответствиеКлючейАналитики.Получить(Ктк), "КлючАналитикиПеревозки");
			Если СуществющийКлюч = Неопределено Тогда 
				КлючДляДобавления = ДанныеЗаполнения.СоответствиеКлючейАналитики.Получить(Ктк);
				Если ЗначениеЗаполнено(КлючДляДобавления) Тогда	
					НовСтрока = Контейнеры.Добавить(); 
					НовСтрока.КлючАналитикиПеревозки = КлючДляДобавления;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Субботин 77659 15.12.2023 Конец
	
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец	
	//ДИТ Шевченко А.В. US 62421 TA 64347 21.02.2023 -конец
КонецПроцедуры

Функция ПолучитьКлючиИзЗапросаНаАвтоперевозку(Заявка,ИдентификаторСтроки) Экспорт //ДИТ Шевченко А.В. US 62421 TA 64347 21.02.2023		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления  
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 22.02.2024
		|	И ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку <> ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.Отменен)
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 22.02.2024
		|	И ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиЗапроса = &ИдентификаторСтрокиЗапроса
		|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ИдентификаторСтрокиЗапроса", ИдентификаторСтроки);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	
КонецФункции	

Процедура ПроверитьУдаленныеКТК(ДополнительныеСвойства)
	
	// Доп. требования по Task №45185
	// Если в релизе клиента имеется галка "Номерная выдача", то при удалении контейнера из ТЧ проведенного
	// релиза клиента и при проведении документа необходимо устанавливать статус "Свободен" по этому контейнеру в АРМ КТК Текущие данные.
	
	// В доп. свойства документа поместим КТК, которые были удалены и передадим их в процедуру проведения.
	
	#Область СтарыйЗапрос
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	РелизКлиентаКонтейнеры.Контейнер КАК Контейнер
	//|ПОМЕСТИТЬ втКТКСсылки
	//|ИЗ
	//|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	//|		ПО РелизКлиентаКонтейнеры.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
	//|ГДЕ
	//|	РелизКлиентаКонтейнеры.Ссылка.Проведен
	//|	И РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	//|	И стоки_ТекущиеДанныеСрезПоследних.тек_Статус <> &Свободен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КонтейнерыОбъекта.Контейнер КАК Контейнер
	//|ПОМЕСТИТЬ втКТКОбъекта
	//|ИЗ
	//|	&КонтейнерыОбъекта КАК КонтейнерыОбъекта
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втКТКСсылки.Контейнер КАК Контейнер
	//|ИЗ
	//|	втКТКСсылки КАК втКТКСсылки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ втКТКОбъекта КАК втКТКОбъекта
	//|		ПО втКТКСсылки.Контейнер = втКТКОбъекта.Контейнер
	//|ГДЕ
	//|	втКТКОбъекта.Контейнер ЕСТЬ NULL";
	#КонецОбласти
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ втКТКСсылки
	|ИЗ
	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
	|ГДЕ
	|	РелизКлиентаКонтейнеры.Ссылка.Проведен
	|	И РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	|	И стоки_ТекущиеДанныеСрезПоследних.тек_Статус <> &Свободен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ   
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	// Было:
	//|	ВЫРАЗИТЬ(КонтейнерыОбъекта.КлючАналитикиПеревозки КАК СПравочник.КлючиАналитикиПеревозки) КАК Ключ 
	//Стало:
	|	ВЫРАЗИТЬ(КонтейнерыОбъекта.КлючАналитикиПеревозки КАК Справочник.КлючиАналитикиПеревозки).Контейнер КАК Контейнер
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	//|	КонтейнерыОбъекта.КлючАналитикиПеревозки.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ втКТКОбъекта1
	|ИЗ
	|	&КонтейнерыОбъекта КАК КонтейнерыОбъекта 
	|;
	|ВЫБРАТЬ  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	// Было:
	//|	втКТКОбъекта1.Ключ.Контейнер КАК Контейнер 
	//Стало:
	|	втКТКОбъекта1.Контейнер КАК Контейнер
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	|ПОМЕСТИТЬ втКТКОбъекта
	|ИЗ
	|	втКТКОбъекта1 КАК втКТКОбъекта1
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	|ГДЕ
	|	НЕ &ЕстьИзмененияНаФорме
	|
	|Объединить
	|
	|ВЫБРАТЬ
	|	ТЧФормы.Контейнер
	|ИЗ
	|	втКТКОбъекта1 КАК ТЧФормы
	|ГДЕ
	|	&ЕстьИзмененияНаФорме
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКТКСсылки.Контейнер КАК Контейнер
	|ИЗ
	|	втКТКСсылки КАК втКТКСсылки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКТКОбъекта КАК втКТКОбъекта
	|		ПО втКТКСсылки.Контейнер = втКТКОбъекта.Контейнер
	|ГДЕ
	|	втКТКОбъекта.Контейнер ЕСТЬ NULL";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("КонтейнерыОбъекта", Контейнеры.Выгрузить());
	Запрос.УстановитьПараметр("Свободен", Перечисления.СтатусыКТК.Свободен); 
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023  
	// если данные ключа обновлены из формы документа, то берем КТК из данных формы 
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда   
		КТКСФормы = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики.Скопировать(, "Контейнер"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
					"ВЫРАЗИТЬ(КонтейнерыОбъекта.КлючАналитикиПеревозки КАК Справочник.КлючиАналитикиПеревозки)",
					"КонтейнерыОбъекта");
		Запрос.УстановитьПараметр("КонтейнерыОбъекта", КТКСФормы); 
		Запрос.УстановитьПараметр("ЕстьИзмененияНаФорме", Истина);
	Иначе
		Запрос.УстановитьПараметр("ЕстьИзмененияНаФорме", Ложь);
	КонецЕсли;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивУдаленныхКТК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контейнер");
		ДополнительныеСвойства.Вставить("МассивУдаленныхКТК", МассивУдаленныхКТК); 
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроставитьСтатусКТК(МассивКТК,  СтатусКТК)	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&МассивКТК)) КАК стоки_ТекущиеДанныеСрезПоследних
	|ГДЕ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус <> &СтатусКТК";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);
	Запрос.УстановитьПараметр("СтатусКТК", СтатусКТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекущиеДанные = Новый Соответствие;
			ТекущиеДанные.Вставить("тек_Статус", СтатусКТК);
			ТекущиеДанные.Вставить("ИсточникЗаписи", "Добавлено " + Пользователи.ТекущийПользователь() + " " + ТекущаяДата());
			РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Выборка.КТК, ТекущиеДанные);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПодстокиКонтейнеров()
	
	// Подсток выдачи
	Если Не ЗначениеЗаполнено(СтокВыдачи) Тогда
		// Евросиб Фролов (28.03.2022 Task №49126
		//УдалитьПодстокВыдачи = "";
		ПодстокиВыдачи.Очистить();
		// Евросиб Фролов)
	Иначе
		СобственныйСток = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтокВыдачи, "СобственныйСток");
	
		Если СобственныйСток = Ложь Тогда
			// Евросиб Фролов (28.03.2022 Task №49126
			//УдалитьПодстокВыдачи = "";
			ПодстокиВыдачи.Очистить();
			// Евросиб Фролов)
		КонецЕсли;
	КонецЕсли;
	
	// Подсток сдачи
	Если Не ЗначениеЗаполнено(СтокСдачи) Тогда
		// Евросиб Фролов (28.03.2022 Task №49126
		//УдалитьПодстокСдачи = "";
		ПодстокиСдачи.Очистить();
		// Евросиб Фролов)
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	МультилокацииЛокации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Ссылка = &СтокСдачи
		|	И МультилокацииЛокации.Локация.СобственныйСток";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("СтокСдачи", СтокСдачи);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
		   	// Евросиб Фролов (28.03.2022 Task №49126
			//УдалитьПодстокСдачи = "";
			ПодстокиСдачи.Очистить();
			// Евросиб Фролов)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКоличествоТранспортныхСредств(Отказ)
	
	КоличествоТранспортныхСредств = 0;
		
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало  
	МассивКлючей = Новый Массив;
	Для Каждого Стр Из Контейнеры Цикл
		МассивКлючей.Добавить(Стр.КлючАналитикиПеревозки);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|ГДЕ
		|	КлючиАналитикиПеревозкиМили.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ПустаяСтрока(ВыборкаДетальныеЗаписи.ФИОВодителя) И ПустаяСтрока(ВыборкаДетальныеЗаписи.РегНомерТС) Тогда
			стр = Контейнеры.Найти(ВыборкаДетальныеЗаписи.Ссылка,"КлючАналитикиПеревозки");
			ОбщегоНазначения.СообщитьПользователю(
												"В строке №" + стр.НомерСтроки + " данных об автоперевозке не заполнено поле ""Рег. № ТС""",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТранспортныеСредства", стр.НомерСтроки, "РегНомерТС"),
												,
												Отказ);
			ИначеЕсли ПустаяСтрока(ВыборкаДетальныеЗаписи.ФИОВодителя) И Не ПустаяСтрока(ВыборкаДетальныеЗаписи.РегНомерТС) Тогда
			стр = Контейнеры.Найти(ВыборкаДетальныеЗаписи.Ссылка,"КлючАналитикиПеревозки");									
			ОбщегоНазначения.СообщитьПользователю(
												"В строке №" + стр.НомерСтроки + " данных об автоперевозке не заполнено поле ""ФИО водителя""",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТранспортныеСредства", стр.НомерСтроки, "ФИОВодителя"),
												,
												Отказ);
		Иначе
			// заполнены и ФИО, и номер ТС
			КоличествоТранспортныхСредств = КоличествоТранспортныхСредств + 1;	
		КонецЕсли;
	КонецЦикла;
	
	//Для Каждого ТекущаяСтрока Из ТранспортныеСредстваУдалить Цикл
	//	
	//	Если Не ПустаяСтрока(ТекущаяСтрока.ФИОВодителя) И ПустаяСтрока(ТекущаяСтрока.РегНомерТС) Тогда
	//		ОбщегоНазначения.СообщитьПользователю(
	//											"В строке №" + ТекущаяСтрока.НомерСтроки + " данных об автоперевозке не заполнено поле ""Рег. № ТС""",
	//											ЭтотОбъект,
	//											ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТранспортныеСредства", ТекущаяСтрока.НомерСтроки, "РегНомерТС"),
	//											,
	//											Отказ);
	//	ИначеЕсли ПустаяСтрока(ТекущаяСтрока.ФИОВодителя) И Не ПустаяСтрока(ТекущаяСтрока.РегНомерТС) Тогда
	//		ОбщегоНазначения.СообщитьПользователю(
	//											"В строке №" + ТекущаяСтрока.НомерСтроки + " данных об автоперевозке не заполнено поле ""ФИО водителя""",
	//											ЭтотОбъект,
	//											ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТранспортныеСредства", ТекущаяСтрока.НомерСтроки, "ФИОВодителя"),
	//											,
	//											Отказ);
	//	Иначе
	//		// заполнены и ФИО, и номер ТС
	//		КоличествоТранспортныхСредств = КоличествоТранспортныхСредств + 1;	
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
КонецПроцедуры

Процедура ВыполнитьЗаписьВКлиентскоеОперирование(МассивКТК, Отказ)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	стоки_КлиентскоеОперирование.КТК КАК КТК,
	|	стоки_КлиентскоеОперирование.кл_Релиз КАК кл_Релиз,
	|	стоки_КлиентскоеОперирование.кл_ДатаВыдачи КАК кл_ДатаВыдачи,
	|	стоки_КлиентскоеОперирование.кл_СрокПользования КАК кл_СрокПользования,
	|	стоки_КлиентскоеОперирование.кл_ВодительЗабор КАК кл_ВодительЗабор,
	|	стоки_КлиентскоеОперирование.кл_НомерТСЗабор КАК кл_НомерТСЗабор,
	|	стоки_КлиентскоеОперирование.кл_ВодительСдача КАК кл_ВодительСдача,
	|	стоки_КлиентскоеОперирование.кл_НомерТССдача КАК кл_НомерТССдача,
	|	стоки_КлиентскоеОперирование.допл_ИнструкцииПоСдачеДопл КАК допл_ИнструкцииПоСдачеДопл,
	|	стоки_КлиентскоеОперирование.кл_ДатаВозврата КАК кл_ДатаВозврата
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	|	,стоки_КлиентскоеОперирование.кл_Клиент КАК кл_Клиент
	|	,стоки_КлиентскоеОперирование.кл_Договор КАК кл_Договор
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	|ПОМЕСТИТЬ втКлиентскоеОперирование
	|ИЗ
	|	РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних(, КТК В (&МассивКТК)) КАК стоки_КлиентскоеОперирование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕстьNULL(ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Контейнер, ЗаявкаСоставУслуги.НомерКТК) КАК Контейнер,
	|	ЗаявкаСоставУслуги.Релиз КАК РелизКлиента
	|ПОМЕСТИТЬ втКонтейнерыВЗаяке
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &ЗаявкаСсылка
	|	И ЗаявкаСоставУслуги.Релиз Ссылка Документ.РелизКлиента
	|;
	|
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
	|ВЫБРАТЬ
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК КТК,
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
	|	РелизКлиентаКонтейнеры.Ссылка КАК кл_Релиз,
	|	ЕстьNULL(КлючиАналитикиПеревозки.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1,1,1)) КАК кл_ДатаВыдачи,
	|	РелизКлиентаКонтейнеры.Ссылка.СрокИспользованияКТК КАК кл_СрокПользования,
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	//|	РелизКлиентаТранспортныеСредства.ФИОВодителя КАК кл_ВодительЗабор,
	//|	РелизКлиентаТранспортныеСредства.РегНомерТС КАК кл_НомерТСЗабор,
	|	КлючиАналитикиПеревозки.ФИОВодителя КАК кл_ВодительЗабор,
	|	КлючиАналитикиПеревозки.РегНомерТС КАК кл_НомерТСЗабор,
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
	//++ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	//|	РелизКлиентаКонтейнеры.СдачаКонтейнераФИОВодителя КАК кл_ВодительСдача,
	//|	РелизКлиентаКонтейнеры.СдачаКонтейнераРегНомерТС КАК кл_НомерТССдача,
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	|	КлючиАналитикиПеревозкиПоследняяМиля.ФИОВодителя КАК кл_ВодительСдача,
	|	КлючиАналитикиПеревозкиПоследняяМиля.РегНомерТС КАК кл_НомерТССдача,
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	//--ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК допл_ИнструкцииПоСдачеДопл,
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
	//|	РелизКлиентаКонтейнеры.ДатаВозвратаКлиентом КАК кл_ДатаВозврата,
	|	ЕстьNULL(КлючиАналитикиПеревозкиПоследняяМиля.ДатаСдачиКТКНаТерминал,ДАТАВРЕМЯ(1,1,1)) КАК кл_ДатаВозврата,
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
	|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС
	//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, начало
	|	,ВЫБОР КОГДА ЕстьNULL(КлючиАналитикиПеревозки.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|				ИЛИ втКонтейнерыВЗаяке.Контейнер Есть NULL
	|		ТОГДА Значение(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ ДокументЗаявка.Контрагент
	|	 КОНЕЦ КАК кл_Клиент
	|	,ВЫБОР КОГДА ЕстьNULL(КлючиАналитикиПеревозки.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|				ИЛИ втКонтейнерыВЗаяке.Контейнер Есть NULL
	|		ТОГДА Значение(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		ИНАЧЕ ДокументЗаявка.Договор
	|	 КОНЕЦ КАК кл_Договор
	//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, конец
	|ПОМЕСТИТЬ втКонтейнеры
	|ИЗ
	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
	//|		ПО РелизКлиентаКонтейнеры.Ссылка = РелизКлиентаТранспортныеСредства.Ссылка
	//|			И РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки
	//++ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредстваПоследняяМиля КАК РелизКлиентаТранспортныеСредстваПоследняяМиля
	//|		ПО РелизКлиентаКонтейнеры.Ссылка = РелизКлиентаТранспортныеСредстваПоследняяМиля.Ссылка
	//|			И РелизКлиентаКонтейнеры.ИдентификаторСтрокиТСПоследняяМиля = РелизКлиентаТранспортныеСредстваПоследняяМиля.ИдентификаторСтроки
	//--ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозки
	|		ПО КлючиАналитикиПеревозки.Ссылка = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Ссылка
	|	    	И КлючиАналитикиПеревозки.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиПоследняяМиля
	|		ПО КлючиАналитикиПеревозкиПоследняяМиля.Ссылка = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Ссылка
	|	    	И КлючиАналитикиПеревозкиПоследняяМиля.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокументЗаявка 
	|		ПО ДокументЗаявка.Ссылка = РелизКлиентаКонтейнеры.Ссылка.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтейнерыВЗаяке КАК втКонтейнерыВЗаяке 
	|		ПО втКонтейнерыВЗаяке.РелизКлиента = РелизКлиентаКонтейнеры.Ссылка
	|			И втКонтейнерыВЗаяке.Контейнер = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	|ГДЕ
	|	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	|	И РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтейнеры.КТК КАК КТК,
	|	втКонтейнеры.кл_Релиз КАК кл_Релиз,
	|	втКонтейнеры.кл_ДатаВыдачи КАК кл_ДатаВыдачи,
	|	втКонтейнеры.кл_СрокПользования КАК кл_СрокПользования,
	|	втКонтейнеры.кл_ВодительЗабор КАК кл_ВодительЗабор,
	|	втКонтейнеры.кл_НомерТСЗабор КАК кл_НомерТСЗабор,
	|	втКонтейнеры.кл_ВодительСдача КАК кл_ВодительСдача,
	|	втКонтейнеры.кл_НомерТССдача КАК кл_НомерТССдача,
	|	втКонтейнеры.допл_ИнструкцииПоСдачеДопл КАК допл_ИнструкцииПоСдачеДопл,
	|	втКонтейнеры.кл_ДатаВозврата КАК кл_ДатаВозврата
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	|	,втКонтейнеры.кл_Клиент КАК кл_Клиент
	|	,втКонтейнеры.кл_Договор КАК кл_Договор
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	|ИЗ
	|	втКонтейнеры КАК втКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКлиентскоеОперирование КАК втКлиентскоеОперирование
	|		ПО втКонтейнеры.КТК = втКлиентскоеОперирование.КТК
	|ГДЕ
	|	(втКлиентскоеОперирование.кл_Релиз <> втКонтейнеры.кл_Релиз
	|			ИЛИ втКлиентскоеОперирование.кл_ДатаВыдачи <> втКонтейнеры.кл_ДатаВыдачи
	|			ИЛИ втКлиентскоеОперирование.кл_СрокПользования <> втКонтейнеры.кл_СрокПользования
	|			ИЛИ втКлиентскоеОперирование.кл_ВодительЗабор <> втКонтейнеры.кл_ВодительЗабор
	|			ИЛИ втКлиентскоеОперирование.кл_НомерТСЗабор <> втКонтейнеры.кл_НомерТСЗабор
	|			ИЛИ втКлиентскоеОперирование.кл_ВодительСдача <> втКонтейнеры.кл_ВодительСдача
	|			ИЛИ втКлиентскоеОперирование.кл_НомерТССдача <> втКонтейнеры.кл_НомерТССдача
	|			ИЛИ втКлиентскоеОперирование.допл_ИнструкцииПоСдачеДопл <> втКонтейнеры.допл_ИнструкцииПоСдачеДопл
	|			ИЛИ втКлиентскоеОперирование.кл_ДатаВозврата <> втКонтейнеры.кл_ДатаВозврата
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	|			ИЛИ втКлиентскоеОперирование.кл_Клиент <> втКонтейнеры.кл_Клиент
	|			ИЛИ втКлиентскоеОперирование.кл_Договор <> втКонтейнеры.кл_Договор
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	|			ИЛИ втКлиентскоеОперирование.КТК ЕСТЬ NULL)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивКТК", 	МассивКТК);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	Запрос.УстановитьПараметр("ЗаявкаСсылка", 	Заявка);
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КлиентскоеОперирование = Новый Соответствие;
		КлиентскоеОперирование.Вставить("кл_Релиз", 					Ссылка);
		КлиентскоеОперирование.Вставить("кл_ДатаВыдачи", 				Выборка.кл_ДатаВыдачи);
		КлиентскоеОперирование.Вставить("кл_СрокПользования",			СрокИспользованияКТК);
		КлиентскоеОперирование.Вставить("кл_ВодительЗабор", 			Выборка.кл_ВодительЗабор);
		КлиентскоеОперирование.Вставить("кл_НомерТСЗабор", 				Выборка.кл_НомерТСЗабор);
		КлиентскоеОперирование.Вставить("кл_ВодительСдача", 			Выборка.кл_ВодительСдача);
		КлиентскоеОперирование.Вставить("кл_НомерТССдача", 				Выборка.кл_НомерТССдача);
		КлиентскоеОперирование.Вставить("допл_ИнструкцииПоСдачеДопл", 	Выборка.допл_ИнструкцииПоСдачеДопл);
		КлиентскоеОперирование.Вставить("кл_ДатаВозврата", 				Выборка.кл_ДатаВозврата);
		//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
		КлиентскоеОперирование.Вставить("кл_Клиент", 					Выборка.кл_Клиент); 
		КлиентскоеОперирование.Вставить("кл_Договор", 					Выборка.кл_Договор); 
		//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
		
		//РегистрыСведений.стоки_КлиентскоеОперирование.ДобавитьЗапись(Выборка.КТК, КлиентскоеОперирование);
		//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, начало
		Если ЗначениеЗаполнено(Выборка.кл_Клиент) Тогда
			РегистрыСведений.стоки_КлиентскоеОперирование.ДобавитьЗапись(Выборка.КТК, КлиентскоеОперирование);
		Иначе
			РегистрыСведений.стоки_КлиентскоеОперирование.УдалитьЗаписиПоВыбранномуКТКиРелизу(Выборка.КТК, Ссылка);
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, конец	
	КонецЦикла;	
		
КонецПроцедуры

//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
Процедура ВыполнитьЗаписьВКлиентскоеОперированиеПоДокументу() Экспорт
	ТаблицаКонтейнеров = ПолучитьТаблицуКТКИзКлючейАналитикиТЧ();
	МассивКонтейнеров = ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер");
	ВыполнитьЗаписьВКлиентскоеОперирование(МассивКонтейнеров, "");
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец

Процедура ВыполнитьЗаписьВТекущиеДанные(ТекущийКТК, Отказ, ТаблицаСведений,ТЗПерваяМиляКлючиАналитики,ТЗПоследняяМиляКлючиАналитики)
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
	СведенияПоКТК = ТаблицаСведений.Найти(ТекущийКТК.КлючАналитикиПеревозки.Контейнер, "КТК");
	
	ДатаВывозаП = Дата(1,1,1);
	ДатаВозвратаКлиентомП = Дата(1,1,1);
	Если ЗначениеЗаполнено(ТекущийКТК.КлючАналитикиПеревозки) Тогда
		НайденнаяСтрокаТЗПерваяМиля 	= ТЗПерваяМиляКлючиАналитики.Найти(ТекущийКТК.КлючАналитикиПеревозки);
		Если НайденнаяСтрокаТЗПерваяМиля <> Неопределено Тогда
			ДатаВывозаП = НайденнаяСтрокаТЗПерваяМиля.ДатаВыдачиКТКСТерминала;
		КонецЕсли;
		НайденнаяСтрокаТЗПоследняяМиля 	= ТЗПоследняяМиляКлючиАналитики.Найти(ТекущийКТК.КлючАналитикиПеревозки);
		Если НайденнаяСтрокаТЗПоследняяМиля <> Неопределено Тогда
			ДатаВозвратаКлиентомП = НайденнаяСтрокаТЗПоследняяМиля.ДатаСдачиКТКНаТерминал;
		КонецЕсли;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
	ТекущийСтатус = Неопределено;
	ТекущийСток = Неопределено;
	Если СведенияПоКТК <> Неопределено Тогда
		ТекущийСтатус = СведенияПоКТК.Статус;
		ТекущийСток = СведенияПоКТК.Сток;
	КонецЕсли;	
	
	// РС "ТекущиеДанные"
	ТекущиеДанные = Новый Соответствие;
	
	// Если "Номерная выдача" и стоит статус "Не согласован" в поле "Статус согласования списка КТК с терминалом"
	// и имеются контейнеры с не заполненным полем "Дата взятия", то необходимо таким контейнерам устанавливать
	// статус "Предварит. резерв" в поле "Статус" АРМ КТК Текущие данные.
	// Если статус "Согласован", то таким контейнерам устанавливать статус "Зарезервирован"
	Если НомернаяВыдача И Не ЗначениеЗаполнено(ДатаВывозаП) Тогда //ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23
		// Статус "Не согласован" не проверяем, т.к. их всего два "Согласован" и "Не согласован" и заполняется обязательно при номерной выдаче.
		НовыйСтатусКТК = Перечисления.СтатусыКТК.ПредварительныйРезерв;
		Если СтатусСогласованияСпискаКТК = Перечисления.СтатусыСогласованияСпискаКТКСТерминалами.Согласован Тогда
			НовыйСтатусКТК = Перечисления.СтатусыКТК.Зарезервирован;
		КонецЕсли;	
		
		Если НовыйСтатусКТК <> ТекущийСтатус Тогда
			ТекущиеДанные.Вставить("тек_Статус", НовыйСтатусКТК);
		КонецЕсли;	
	КонецЕсли;
	
	//// Если установлена галка "Номерная выдача" и в табличной части не заполнено поле "Дата вывоза",
	//// то необходимо устанавливать контейнерам статус "Зарезервирован" в АРМ КТК Текущие данные.
	//Если НомернаяВыдача И Не ЗначениеЗаполнено(ТекущийКТК.ДатаВывоза) Тогда
	//	ТекущиеДанные.Вставить("тек_Статус", Перечисления.СтатусыКТК.Зарезервирован);
	//КонецЕсли;
	
	// Если в строке табличной части заполнено поле "Дата вывоза", не заполнено поле "Дата возврата клиентом"
	// и значение в поле "Автоперевозка" равно "Силами клиента" либо "Силами Евросиб",
	// то устанавливать статус "В движении" в АРМ КТК Текущие данные.
	Если ЗначениеЗаполнено(ДатаВывозаП) И Не ЗначениеЗаполнено(ДатаВозвратаКлиентомП) //ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23
		И Автоперевозка <> Перечисления.ВариантыАвтоперевозки.НеТребуется
		И ТекущийСтатус <> Перечисления.СтатусыКТК.ВДвижении Тогда
		ТекущиеДанные.Вставить("тек_Статус", Перечисления.СтатусыКТК.ВДвижении);
	КонецЕсли;	
	
	// Если в строке заполнена дата вывоза и при этом заполнена дата возврата клиентом, необходимо:
	// - устанавливать статус "Свободен" по таким контейнерам в АРМ КТК Текущие данные;
	// - в поле "Тек. сток" в АРМ КТК перенести данные из поля "Сток сдачи" релиза клиента.
	Если ЗначениеЗаполнено(ДатаВывозаП) И ЗначениеЗаполнено(ДатаВозвратаКлиентомП) Тогда //ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23
		Если ТекущийСтатус <> Перечисления.СтатусыКТК.Свободен Тогда
			ТекущиеДанные.Вставить("тек_Статус", Перечисления.СтатусыКТК.Свободен);
		КонецЕсли;
		Если ТекущийСток <> СтокСдачи Тогда
			ТекущиеДанные.Вставить("тек_Сток", СтокСдачи);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ТекущиеДанные.Количество() > 0 Тогда
		ТекущиеДанные.Вставить("ИсточникЗаписи", "Добавлено " + Пользователи.ТекущийПользователь() + " " + ТекущаяДата());
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -начало
		//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(ТекущийКТК.Контейнер, ТекущиеДанные);
		РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(ТекущийКТК.КлючАналитикиПеревозки.Контейнер, ТекущиеДанные);
		//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 -конец
	КонецЕсли;	
	
КонецПроцедуры	

Функция СведенияПоКТКИзАРМ(МассивКТК)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК Статус,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Сток КАК Сток
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&МассивКТК)) КАК стоки_ТекущиеДанныеСрезПоследних";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
	
Функция ЛокацияПодходит(Локация, СодержитСток)
	// Евросиб Фролов (16.02.2022 Task №46605
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МультилокацииЛокации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|ГДЕ
	|	МультилокацииЛокации.Ссылка = &Локация
	|	И МультилокацииЛокации.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)";
	
	Если СодержитСток = Ложь Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"И МультилокацииЛокации.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)",
									"И МультилокацииЛокации.Локация.Тип <> ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Локация", Локация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	// Евросиб Фролов)
КонецФункции	

Функция КонтейнерыДляРелизаСобственника()
	// Евросиб Фролов (30.05.2022 Task №49741
    ТекстЗапроса = 
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	//"ВЫБРАТЬ
	//|	Контейнеры.Контейнер КАК Контейнер,
	//// ++ ДИТ_Агафонов_task 50388 29.06.2022
	//|	Контейнеры.Контейнер.ТипТЕ КАК ТипоразмерКТК,
	//|	Контейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки
	//// -- ДИТ_Агафонов_task 50388 29.06.2022
	//|ПОМЕСТИТЬ втКТК
	//|ИЗ
	//|	&Контейнеры КАК Контейнеры
	//|;
	"ВЫБРАТЬ
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	|	ВЫРАЗИТЬ(Контейнеры.КлючАналитикиПеревозки КАК СПравочник.КлючиАналитикиПеревозки) КАК КлючиАналитикиПеревозки,
	// ++ ДИТ_Агафонов_task 50388 29.06.2022
	|	Контейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки
	// -- ДИТ_Агафонов_task 50388 29.06.2022
	|ПОМЕСТИТЬ втКТК
	|ИЗ
	|	&Контейнеры КАК Контейнеры
	|	ГДЕ
	|		ВЫРАЗИТЬ(Контейнеры.КлючАналитикиПеревозки КАК СПравочник.КлючиАналитикиПеревозки).Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|;
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКТК.КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
	// ++ ДИТ_Агафонов_task 50388 29.06.2022
	|	втКТК.КлючиАналитикиПеревозки.Контейнер.ТипТЕ КАК ТипоразмерКТК,
	|	втКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	// -- ДИТ_Агафонов_task 50388 29.06.2022
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	|	ЕстьNULL(КлючиАналитикиПеревозкиТ.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1,1,1)) КАК ДатаВывоза
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	|ИЗ
	|	втКТК КАК втКТК
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиТ
	|		ПО КлючиАналитикиПеревозкиТ.Ссылка = втКТК.КлючиАналитикиПеревозки
	|	    	И КлючиАналитикиПеревозкиТ.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	|				И ЕстьNULL(КлючиАналитикиПеревозкиТ.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1,1,1)) <> ДАТАВРЕМЯ(1, 1, 1)";
	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаКТК = Результат.Выгрузить();
	
	Возврат ТаблицаКТК;	
	// Евросиб Фролов)	
КонецФункции

Процедура ОбновитьРелизСобственника(Контейнеры, Отказ)
    // Евросиб Фролов (30.05.2022 Task №49741

	// Запросом получаем строки релиза собстевнника, которые не были добавлена или обновлены из релиза клиента.
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
	|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки
	|ПОМЕСТИТЬ втНоминации
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.Ссылка = &РелизСобственника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоминации.ГУИДСтроки КАК ГУИДСтроки,
	// ++ ДИТ_Агафонов_task 50388 25.06.2022
	|	СвязьРелизов.РелизКлиента КАК РелизКлиента
	// -- ДИТ_Агафонов_task 50388 25.06.2022
	|ИЗ
	|	втНоминации КАК втНоминации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязьРелизов КАК СвязьРелизов
	|		ПО втНоминации.Ссылка = СвязьРелизов.РелизСобственника
	|			И втНоминации.ГУИДСтроки = СвязьРелизов.ГУИДСтроки
	|ГДЕ
	|	(СвязьРелизов.РелизСобственника ЕСТЬ NULL
	// ++ ДИТ_Агафонов_task 50388 25.06.2022
	//Добавим проверку, вдруг что случилось с уже добавленной строкой
	|			ИЛИ СвязьРелизов.РелизКлиента = &РелизКлиента
	// -- ДИТ_Агафонов_task 50388 25.06.2022
	|			ИЛИ СвязьРелизов.РелизКлиента = ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("РелизСобственника", РелизСобственника);
	Запрос.УстановитьПараметр("РелизКлиента", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// ++ ДИТ_Агафонов_task 50388 25.06.2022
	//Нет наших строк - это не влзврат, а добавление всех строк.
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;	
	// -- ДИТ_Агафонов_task 50388 25.06.2022

	// Массив строк релиза собственника, которые можно обновить
	// (они не были обновлены или добавлены из релиза клиента).
	ПодходящиеСтрокиРелизаСобственника = РезультатЗапроса.Выгрузить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.РелизСобственника");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", РелизСобственника);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	ДокументОбъект = РелизСобственника.ПолучитьОбъект();
	
	ПроводитьРелизСобственника = Ложь;
	
	// ++ ДИТ_Агафонов_task 50388 30.06.2022
	Если ДокументОбъект.Проведен Тогда
		РежимЗаписиРелиза = РежимЗаписиДокумента.Проведение;
	Иначе		
		РежимЗаписиРелиза = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	// -- ДИТ_Агафонов_task 50388 30.06.2022
	
	Для Каждого ТекущаяСтрока Из Контейнеры Цикл
			
		// Из релиза клиента переносим сведения только по тем строкам, в которых заполнены контейнер и дата вывоза.
		//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
		//Если Не ЗначениеЗаполнено(ТекущаяСтрока.КонтейнерУдалить) Или Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаВывоза) Тогда
        Если Не ЗначениеЗаполнено(ТекущаяСтрока.Контейнер) Или Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаВывоза) Тогда
		//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
			Продолжить;
		КонецЕсли;	
		
		// По контейнеру релиза клиента ищем строки в релизе собственника.
		//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
		СтрокиРелизаСобственника = ДокументОбъект.Номинации.НайтиСтроки(Новый Структура("Контейнер", ТекущаяСтрока.Контейнер));
		//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
		
		// Если по номеру КТК в релизе собственника нашлись строки (сработает цикл), то обновляем их.
		Для Каждого СтрокаКТКРелизаСобственника Из СтрокиРелизаСобственника Цикл
			
			НайденнаяСтрока = ПодходящиеСтрокиРелизаСобственника.Найти(СтрокаКТКРелизаСобственника.ГУИДСтроки,"ГУИДСтроки");
			
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// ++ ДИТ_Агафонов_task 57613 19.10.2022
			//Если Не ЗначениеЗаполнено(СтрокаКТКРелизаСобственника.ДатаВзятия) Тогда
			Если 
				//ЗначениеЗаполнено(ТекущаяСтрока.ДатаВывоза) и 
				СтрокаКТКРелизаСобственника.ДатаВзятия <> ТекущаяСтрока.ДатаВывоза Тогда
				// -- ДИТ_Агафонов_task 57613 19.10.2022
				СтрокаКТКРелизаСобственника.ДатаВзятия = ТекущаяСтрока.ДатаВывоза;
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
				//РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, СтрокаКТКРелизаСобственника.ГУИДСтроки,ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.КонтейнерУдалить, Ссылка, Отказ);
				РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, "",ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.Контейнер, Ссылка, Отказ);
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
				ПроводитьРелизСобственника = Истина;
				// ++ ДИТ_Агафонов_task 50388 25.06.2022
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
				//Если СтрокаКТКРелизаСобственника.ТипКТК<>ТекущаяСтрока.ТипоразмерКТКУдалить Тогда
				Если СтрокаКТКРелизаСобственника.ТипКТК <> ТекущаяСтрока.ТипоРазмерКТК Тогда
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец	
					СтрокаКТКРелизаСобственника.РелизКлиентаНеСовпадаетТипоразмерКТК = Истина;
					ДокументОбъект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК = ДокументОбъект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК + 1;
				КонецЕсли;
				// -- ДИТ_Агафонов_task 50388 25.06.2022
				// ++ ДИТ_Агафонов_task 50388 25.06.2022
				//Добавим проверку на связь
			//ИначеЕсли Не ЗначениеЗаполнено(НайденнаяСтрока.РелизКлиента) Тогда
			//	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
			//	//РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, СтрокаКТКРелизаСобственника.ГУИДСтроки,ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.КонтейнерУдалить, Ссылка, Отказ);
			//	РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, СтрокаКТКРелизаСобственника.ГУИДСтроки,ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.Контейнер, Ссылка, Отказ);
			//	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
			//	// ++ ДИТ_Агафонов_task 50388 25.06.2022
			//	//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
			//	//Если СтрокаКТКРелизаСобственника.ТипКТК<>ТекущаяСтрока.ТипоразмерКТКУдалить Тогда
			//	Если СтрокаКТКРелизаСобственника.ТипКТК<>ТекущаяСтрока.Контейнер.ТипТЕ Тогда
			//		//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
			//		СтрокаКТКРелизаСобственника.РелизКлиентаНеСовпадаетТипоразмерКТК = Истина;
			//		ДокументОбъект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК = ДокументОбъект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК + 1;
			//		ПроводитьРелизСобственника = Истина;
			//	КонецЕсли;
			//	// -- ДИТ_Агафонов_task 50388 25.06.2022
			//	// -- ДИТ_Агафонов_task 50388 25.06.2022	
			КонецЕсли;	
			
			Прервать;
			
		КонецЦикла;
		//МассивЗаписываемыхКлючейАналитики = Новый Массив; //ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, закомментировал
		// Если по номеру КТК в релизе собственника не нашли строку, то ищем строки с незаполненным КТК, датой взятия и таким же типоразмером КТК, как в релизе клиента.
		Если СтрокиРелизаСобственника.Количество() = 0 Тогда	
			//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
			//СтрокиБезКТКИДатыВзятия = ДокументОбъект.Номинации.НайтиСтроки(Новый Структура("Контейнер, ДатаВзятия, ТипКТК", Справочники.ТЕ.ПустаяСсылка(), Дата(1, 1, 1), ТекущаяСтрока.ТипоразмерКТКУдалить));
			СтрокиБезКТКИДатыВзятия = ДокументОбъект.Номинации.НайтиСтроки(Новый Структура("Контейнер, ДатаВзятия, ТипКТК", Справочники.ТЕ.ПустаяСсылка(), Дата(1, 1, 1), ТекущаяСтрока.Контейнер.ТипТЕ));
			//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
			Для Каждого СтрокаКТКРелизаСобственника Из СтрокиБезКТКИДатыВзятия Цикл
				
				Если ПодходящиеСтрокиРелизаСобственника.Найти(СтрокаКТКРелизаСобственника.ГУИДСтроки) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
				//СтрокаКТКРелизаСобственника.Контейнер = ТекущаяСтрока.КонтейнерУдалить;
				//СтрокаКТКРелизаСобственника.Контейнер = ТекущаяСтрока.Контейнер;
				//обКлюч = СтрокаКТКРелизаСобственника.ПолучитьОбъект();
				//ЗаполнитьЗначенияСвойств(обКлюч, ТекущаяСтрока.КлючАналитикиПеревозки, "Контейнер");
				//МассивЗаписываемыхКлючейАналитики.Добавить(обКлюч);
				//ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, начало
				СтрокаКТКРелизаСобственника.Контейнер = ТекущаяСтрока.Контейнер;
				//ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, конец
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
				СтрокаКТКРелизаСобственника.ДатаВзятия = ТекущаяСтрока.ДатаВывоза;
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
				//РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, СтрокаКТКРелизаСобственника.ГУИДСтроки,ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.КонтейнерУдалить, Ссылка, Отказ, Истина);
				РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, "",ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.Контейнер, Ссылка, Отказ, Истина);
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
				ПроводитьРелизСобственника = Истина;
				Прервать;
			КонецЦикла;
			
			// Если строка с незаполненным КТК и датой взятия не найдена, то добавим новую строку в релиз собственника.
			// ++ ДИТ_Агафонов_task 50388 30.06.2022 Важное уточнение - добавляем копированием.
			Если СтрокиБезКТКИДатыВзятия.Количество() = 0 Тогда				
				НоваяСтрока = ДокументОбъект.Номинации.Добавить();
				
				// ++ ДИТ_Агафонов_task 50388 30.06.2022
				НовыйГУИД = Строка(Новый УникальныйИдентификатор);
				КоличествоСтрок = ДокументОбъект.Номинации.Количество();
				Если КоличествоСтрок>1 Тогда
					// Евросиб Рыбьяков К.А. 08.08.2025 (( Добавил ключ аналитики в исключения, иначе один ключ будет в нескольких строках
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ДокументОбъект.Номинации[КоличествоСтрок-2],, "КлючАналитики");
					//ЗаполнитьЗначенияСвойств(НоваяСтрока,ДокументОбъект.Номинации[КоличествоСтрок-2]); 
					// Евросиб Рыбьяков К.А. 08.08.2025 ))
					НоваяСтрокаСНП = ДокументОбъект.СНП.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСНП,ДокументОбъект.СНП[КоличествоСтрок-2]);
					НоваяСтрокаСНП.ГУИДСтроки = НовыйГУИД;
				Иначе	
					РежимЗаписиРелиза = РежимЗаписиДокумента.Запись;
				КонецЕсли;
				НоваяСтрока.РелизКлиентаНоваяЗаписьКТК = Истина;
				НоваяСтрока.РелизКлиентаНоваяЗаписьКТК_Выполнено = Ложь;
				НоваяСтрока.РелизКлиентаНеСовпадаетТипоразмерКТК = Ложь;
				НоваяСтрока.РелизКлиентаНеСовпадаетТипоразмерКТК_Выполнено = Ложь;
				ДокументОбъект.КолвоРелизКлиентаНоваяЗаписьКТК = ДокументОбъект.КолвоРелизКлиентаНоваяЗаписьКТК + 1;
				// -- ДИТ_Агафонов_task 50388 30.06.2022
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -начало
				//НоваяСтрока.ТипКТК = ТекущаяСтрока.ТипоразмерКТКУдалить;
				//НоваяСтрока.ТипКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки, "Контейнер.ТипТЕ");;
				//ДИТ Шевченко А.В. US 62421 TA 64347 23.01.23 -конец
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
				//обКлюч.Контейнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки, "Контейнер");
				//ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, начало
				НоваяСтрока.ТипКТК = ТекущаяСтрока.ТипоразмерКТК;
				НоваяСтрока.Контейнер = ТекущаяСтрока.Контейнер;
				//ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, конец
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
				НоваяСтрока.ДатаВзятия = ТекущаяСтрока.ДатаВывоза;
				//НоваяСтрока.ГУИДСтроки = НовыйГУИД;
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
				//РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, НоваяСтрока.ГУИДСтроки,ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.КонтейнерУдалить, Ссылка, Отказ, Истина);
				РегистрыСведений.СвязьРелизов.ПривязатьСтрокуНоминацииКРелизуКлиента(РелизСобственника, "",ТекущаяСтрока.ИдентификаторСтроки,ТекущаяСтрока.Контейнер, Ссылка, Отказ, Истина);
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
				ПроводитьРелизСобственника = Истина;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ПроводитьРелизСобственника Тогда 
		//Для каждого ЗаписываемыйКлюч Из МассивЗаписываемыхКлючейАналитики Цикл  //ДИТ, Беляев СЮ, Ticket#0330465, 01-11-2023, закомментировал
		//	ЗаписываемыйКлюч.Записать();
		//КонецЦикла;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзРелизаКлиента", Истина);
		ДокументОбъект.Записать(РежимЗаписиРелиза);
	КонецЕсли;	
	
	// Евросиб Фролов)
КонецПроцедуры	

// ++ ДИТ_Агафонов_task 56709 14.09.2022
// ++ ДИТ_Агафонов_task 57613 19.10.2022 Исправляем процедуру под новые требования
Процедура ПроверитьУдалитьСвязьРелизов(ЭтоОтменаПроведения = ложь)

	//Нам нужно проверить и удалить записи
	//которые не соответствуют релизу собственника из шапки(смена или очистка релиза собственника в шапке)
	//гуиды, которых теперь уже нет в релизе клиента (удалили строку в релизе клиента)
	//по которым теперь пустая дата (очистили дату в релизе клиента)
	Запрос = Новый Запрос;
	Запрос.Текст =
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//"ВЫБРАТЬ
	//|	Контейнеры.Контейнер КАК Контейнер,
	//|	Контейнеры.ТипоразмерКТК КАК ТипоразмерКТК,
	//|	Контейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	Контейнеры.ДатаВывоза КАК ДатаВывоза
	//|ПОМЕСТИТЬ втКТК
	//|ИЗ
	//|	&Контейнеры КАК Контейнеры
	//|;
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Контейнеры.КлючАналитикиПеревозки КАК СПравочник.КлючиАналитикиПеревозки) КАК КлючАналитикиПеревозки,
	|	Контейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втКТК_1
	|ИЗ
	|	&Контейнеры КАК Контейнеры
	|;
	|ВЫБРАТЬ
	|	втКТК_1.КлючАналитикиПеревозки.Контейнер КАК Контейнер,
	|	втКТК_1.КлючАналитикиПеревозки.Контейнер.ТипТЕ КАК ТипоразмерКТК,
	|	втКТК_1.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВывоза
	|ПОМЕСТИТЬ втКТК
	|ИЗ
	|	втКТК_1 КАК втКТК_1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|		ПО втКТК_1.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|	    	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	|;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязьРелизов.РелизСобственника КАК РелизСобственника,
	|	СвязьРелизов.ГУИДСтроки КАК ГУИДСтроки,
	|	СвязьРелизов.РелизКлиента КАК РелизКлиента,
	|	СвязьРелизов.Контейнер КАК Контейнер,
	|	СвязьРелизов.ГУИД_СтрокиРелизКлиента КАК ГУИД_СтрокиРелизКлиента,
	|	СвязьРелизов.БылУстановленКТКизРелизаКлиента КАК БылУстановленКТКизРелизаКлиента
	|ПОМЕСТИТЬ ТаблицаСвязей
	|ИЗ
	|	РегистрСведений.СвязьРелизов КАК СвязьРелизов
	|ГДЕ
	|	СвязьРелизов.РелизКлиента = &РелизКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСвязей.РелизСобственника КАК РелизСобственника,
	|	ТаблицаСвязей.ГУИДСтроки КАК ГУИДСтроки,
	|	ТаблицаСвязей.РелизКлиента КАК РелизКлиента,
	|	ТаблицаСвязей.Контейнер КАК Контейнер,
	|	ТаблицаСвязей.ГУИД_СтрокиРелизКлиента КАК ГУИД_СтрокиРелизКлиента,
	|	ТаблицаСвязей.БылУстановленКТКизРелизаКлиента КАК БылУстановленКТКизРелизаКлиента,
	|	ВЫБОР
	|		КОГДА ТаблицаСвязей.РелизСобственника <> &РелизСобственника
	|			ТОГДА 1
	|		КОГДА втКТК.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА 2
	|		КОГДА втКТК.ДатаВывоза = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втКТК.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК СостояниеПоЗаписи
	|ИЗ
	|	ТаблицаСвязей КАК ТаблицаСвязей
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКТК КАК втКТК
	|		ПО ТаблицаСвязей.ГУИД_СтрокиРелизКлиента = втКТК.ИдентификаторСтроки
	|			И (&ЭтоОтменаПроведения = ЛОЖЬ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТаблицаСвязей.РелизСобственника <> &РелизСобственника
	|				ТОГДА 1
	|			КОГДА втКТК.ИдентификаторСтроки ЕСТЬ NULL
	|				ТОГДА 2
	|			КОГДА втКТК.ДатаВывоза = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ втКТК.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|				ТОГДА 3
	|			ИНАЧЕ 4
	|		КОНЕЦ < 4
	|
	|УПОРЯДОЧИТЬ ПО
	|	РелизСобственника,
	|	СостояниеПоЗаписи
	|ИТОГИ ПО
	|	РелизСобственника";	
	
	Запрос.УстановитьПараметр("Контейнеры",Контейнеры);
	Запрос.УстановитьПараметр("РелизСобственника",РелизСобственника);
	Запрос.УстановитьПараметр("РелизКлиента",Ссылка);
	Запрос.УстановитьПараметр("ЭтоОтменаПроведения",ЭтоОтменаПроведения);
	
	//ТаблицаСвязейНаУдаление = Запрос.Выполнить().Выгрузить();
	ВыборкаРелизСобственника = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УстановитьПривилегированныйРежим(Истина);
	Пока ВыборкаРелизСобственника.Следующий() Цикл
		РелизСобственникаОбъект = ВыборкаРелизСобственника.РелизСобственника.ПолучитьОбъект();
		ПроводитьРелизСобственника = Ложь;
		БылаОшибкаПоРелизуСобственника = Ложь;
		Если РелизСобственникаОбъект.Проведен Тогда
			РежимЗаписиРелиза = РежимЗаписиДокумента.Проведение;
		Иначе		
			РежимЗаписиРелиза = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		//Если РелизСобственникаОбъект = Неопределено Тогда
		//	РелизСобственникаОбъект = Документы.РелизСобственника.СоздатьДокумент();
		//КонецЕсли;
		СтрокаСвязи = ВыборкаРелизСобственника.Выбрать();	
		
		//Сначала попробуем изменеить релизы собственника
		Пока СтрокаСвязи.Следующий() Цикл
			СтрокаНоминации = РелизСобственникаОбъект.Номинации.Найти(СтрокаСвязи.ГУИДСтроки);
			Если не СтрокаНоминации = Неопределено и СтрокаНоминации.Контейнер = СтрокаСвязи.Контейнер Тогда
				Если СтрокаНоминации.РелизКлиентаНоваяЗаписьКТК Тогда
					РелизСобственникаОбъект.Номинации.Удалить(СтрокаНоминации);	
				ИначеЕсли СтрокаСвязи.БылУстановленКТКизРелизаКлиента Тогда	
					СтрокаНоминации.Контейнер = Справочники.ТЕ.ПустаяСсылка();
					СтрокаНоминации.ДатаВзятия = Дата(1,1,1);
				Иначе
					СтрокаНоминации.ДатаВзятия = Дата(1,1,1);
				КонецЕсли;
				ПроводитьРелизСобственника = Истина;	
			КонецЕсли;
		КонецЦикла;
		Если ПроводитьРелизСобственника Тогда
			РелизСобственникаОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзРелизаКлиента", Истина);
			Попытка
				РелизСобственникаОбъект.Записать(РежимЗаписиРелиза);
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Ошибка при попытке изменения "+ВыборкаРелизСобственника.РелизСобственника+". Внесите изменения по контейнерам вручную.");
				ОбщегоНазначения.СообщитьПользователю("Описание ошибки: "+ОписаниеОшибки());
				БылаОшибкаПоРелизуСобственника = Истина;
			КонецПопытки;
		КонецЕсли;	
		
		//Если все ок с релизами собственника, то нужно отработать вручную.
		Если не БылаОшибкаПоРелизуСобственника Тогда
		СтрокаСвязи.Сбросить();
		СписокКТК = Новый СписокЗначений;
		Пока СтрокаСвязи.Следующий() Цикл
		//Для каждого СтрокаСвязи Из ТаблицаСвязейНаУдаление Цикл
			МенеджерЗаписиСвязи = РегистрыСведений.СвязьРелизов.СоздатьМенеджерЗаписи();	
			МенеджерЗаписиСвязи.РелизСобственника = СтрокаСвязи.РелизСобственника;
			МенеджерЗаписиСвязи.ГУИДСтроки = СтрокаСвязи.ГУИДСтроки;
			МенеджерЗаписиСвязи.Прочитать();
			Если МенеджерЗаписиСвязи.Выбран() Тогда
				МенеджерЗаписиСвязи.Удалить();	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаСвязи.Контейнер) Тогда
				СписокКТК.Добавить(СтрокаСвязи.Контейнер);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	стоки_ТекущиеДанные.Период КАК Период,
		|	стоки_ТекущиеДанные.КТК КАК КТК,
		|	стоки_ТекущиеДанные.тек_Релиз КАК тек_Релиз
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|ГДЕ
		|	стоки_ТекущиеДанные.тек_Релиз = &тек_Релиз
		|	И стоки_ТекущиеДанные.КТК В(&СписокКТК)";
		
		Запрос.УстановитьПараметр("СписокКТК", СписокКТК);
		Запрос.УстановитьПараметр("тек_Релиз", ВыборкаРелизСобственника.РелизСобственника);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписиСвязи = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();	
			МенеджерЗаписиСвязи.КТК = Выборка.КТК;
			МенеджерЗаписиСвязи.Период = Выборка.Период;
			МенеджерЗаписиСвязи.Прочитать();
			Если МенеджерЗаписиСвязи.Выбран() Тогда
				МенеджерЗаписиСвязи.Удалить();	
			КонецЕсли;
		КонецЦикла;
		
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
// -- ДИТ_Агафонов_task 56709 14.09.2022

// Евросиб Фролов (28.02.2022 Task №46354
Процедура ДвиженияПодсветкаФормДокументов(Отказ, РежимПроведения);	
	ЭтоНовый = Ложь;
	ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
	Если ЭтоНовый = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПодсвечиваниеПолейОбъектов.ВыполнитьДвиженияПодсветкаФормДокументов(Ссылка, ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ, РежимПроведения);		
КонецПроцедуры

// Евросиб Фролов)

Функция ПолучитьТаблицуКТКИзКлючейАналитикиТЧ() Экспорт //ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23 
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.КлючАналитикиПеревозки КАК Ключ,
		|	ТЗ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Контейнеры
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контейнеры.НомерСтроки КАК НомерСтроки,
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер
		|ИЗ
		|	ВТ_Контейнеры КАК ВТ_Контейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО ВТ_Контейнеры.Ключ = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ
		|	КлючиАналитикиПеревозки.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТЗ",Контейнеры.Выгрузить(,"КлючАналитикиПеревозки,НомерСтроки"));
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

//ДИТ Шевченко А.В. US 62421 TA 64347 20.01.23
Функция ПроверитьОтсутствиеДублейКТКВКлючахАналитики(Отказ, ДанныеДляОбновленияКлючейАналитики = Неопределено) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.КлючАналитикиПеревозки КАК Ключ,
		|	ТЗ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Контейнеры
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контейнеры.НомерСтроки КАК НомерСтроки,
		|	ЕстьNULL(КлючиАналитикиПеревозки.Контейнер,ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) КАК Контейнер
		|ПОМЕСТИТЬ ВТ_Контейнер
		|ИЗ
		|	ВТ_Контейнеры КАК ВТ_Контейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО ВТ_Контейнеры.Ключ <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|           И ВТ_Контейнеры.Ключ = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ 
		|	ЕстьNULL(КлючиАналитикиПеревозки.Контейнер,ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)	
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контейнер.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ Дубли_КТК
		|ИЗ
		|	ВТ_Контейнер КАК ВТ_Контейнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Контейнер.Контейнер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Дубли_КТК.Контейнер КАК Контейнер,
		|	ВТ_Контейнер.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Дубли_КТК КАК Дубли_КТК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контейнер КАК ВТ_Контейнер
		|		ПО Дубли_КТК.Контейнер = ВТ_Контейнер.Контейнер
		|ИТОГИ ПО
		|	Контейнер";
	
	Запрос.УстановитьПараметр("ТЗ",Контейнеры.Выгрузить(,"КлючАналитикиПеревозки,НомерСтроки"));  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023 - данные были обновлены с формы
	Если ДанныеДляОбновленияКлючейАналитики <> Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Контейнер КАК Контейнер,
		|	ТЗ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Контейнер
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контейнер.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ Дубли_КТК
		|ИЗ
		|	ВТ_Контейнер КАК ВТ_Контейнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Контейнер.Контейнер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Дубли_КТК.Контейнер КАК Контейнер,
		|	ВТ_Контейнер.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Дубли_КТК КАК Дубли_КТК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контейнер КАК ВТ_Контейнер
		|		ПО Дубли_КТК.Контейнер = ВТ_Контейнер.Контейнер
		|ИТОГИ ПО
		|	Контейнер";
		Запрос.УстановитьПараметр("ТЗ", ДанныеДляОбновленияКлючейАналитики.Скопировать(,"Контейнер,НомерСтроки"));  
	КонецЕсли;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтейнер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивСообщений = Новый Массив;
	МассивНомеровСтрок = Новый Массив;
	
	Пока ВыборкаКонтейнер.Следующий() Цикл
		
	  		
		ВыборкаДетальныеЗаписи = ВыборкаКонтейнер.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивНомеровСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки);
		КонецЦикла;
		
		МассивСообщений.Добавить(СтрШаблон("Значения %1 повторяются в строках %2.",ВыборкаКонтейнер.Контейнер,СтрСоединить(МассивНомеровСтрок,",")));
		
	КонецЦикла;
	
	Возврат МассивСообщений;
	
КонецФункции	

Функция ЗаполнитьКонтейнерыПоИнформацииОтТерминалов() Экспорт
	НеобходимаЗаписьОбъекта = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РелизКлиентаКонтейнеры.КлючАналитикиПеревозки КАК Справочник.КлючиАналитикиПеревозки) КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ ВТ_РелизКлиентаКонтейнеры
	|ИЗ
	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Контейнер КАК Контейнер,
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК КонтейнерРелиза
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РелизКлиентаКонтейнеры КАК РелизКлиентаКонтейнеры
	|		ПО ИнформацияОтТерминалов.Контейнер = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер
	|ГДЕ
	|	ИнформацияОтТерминалов.НомерРелиза = &НомерРелиза
	|	И РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер ЕСТЬ NULL";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РелизКлиента.Контейнеры", "&РелизКлиентаКонтейнеры");
	Запрос.УстановитьПараметр("РелизКлиентаКонтейнеры", Контейнеры.Выгрузить());
	Запрос.УстановитьПараметр("НомерРелиза", НомерРелиза);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;     
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		НеобходимаЗаписьОбъекта = Истина;
		НоваяСтрока = Контейнеры.Добавить();
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.Контейнер = Выборка.Контейнер;
		КлючАналитики = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		//Евросиб - АСуслов 27.09.2023 14:15:38 #75435
		//(
		//НоваяСтрока.КлючАналитикиПеревозки = КлючАналитики;
		НоваяСтрока.КлючАналитикиПеревозки = КлючАналитики.КлючАналитикиПеревозки;
		//)
		//Евросиб - АСуслов 27.09.2023 14:15:39 #75435
		НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;
	Возврат НеобходимаЗаписьОбъекта;
КонецФункции

// ДИТ US 80736 ТА 81088 Сержантова А.С. 27.02.2024
Процедура ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление()

	// проверяем есть ли не помеченные на удаление запросы на авто, в которых есть строки из данного релиза    
	КлючиВРелизе = Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления
		|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки В(&КлючиВРелизе)
		// Евросиб(ДИТ) BUG 87051 Сержантова А.С. Начало: 25.06.2024
		|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)
		// Евросиб(ДИТ) BUG 87051 Сержантова А.С. Конец: 25.06.2024
		|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки В(&ОтборПоМиле)
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало 05.03.2024
		|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалВыдачи
		|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалСдачи"; 
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец 05.03.2024
	
	ОтборПоМиле = Новый Массив;
	Если не ЗначениеЗаполнено(Ссылка) 
		или (Ссылка.ТерминалВыдачи <> ТерминалВыдачи и Ссылка.СтокСдачи <> СтокСдачи) Тогда   
		ОтборПоМиле.Добавить(Перечисления.ЭтапыПеревозки.ПерваяМиля);
		ОтборПоМиле.Добавить(Перечисления.ЭтапыПеревозки.ПоследняяМиля);
	ИначеЕсли Ссылка.ТерминалВыдачи <> ТерминалВыдачи Тогда
	    ОтборПоМиле.Добавить(Перечисления.ЭтапыПеревозки.ПерваяМиля);  
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало 05.03.2024   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалСдачи", ""); 
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец 05.03.2024
	ИначеЕсли Ссылка.СтокСдачи <> СтокСдачи Тогда	
	    ОтборПоМиле.Добавить(Перечисления.ЭтапыПеревозки.ПоследняяМиля); 
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало 05.03.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалВыдачи", "");
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец 05.03.2024
	КонецЕсли;  
	Запрос.УстановитьПараметр("КлючиВРелизе", КлючиВРелизе);
	Запрос.УстановитьПараметр("ОтборПоМиле", ОтборПоМиле);
	
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();  
		СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина;
				КонецЕсли;
			КонецЦикла;  
			Если не ЗадачаОбновленияДобавлена Тогда
				//Применить к запросу на авто маршрут
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

//Евросиб Коханенко Н.А. 02.04.2024 (( #80513 
Процедура ЗаполнитьРегистрСвязанныеОбъектыПоРелизуКлиента();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК СчетСсылка,
		|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК СделкаСсылка,
		|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка КАК ПоступлениеСсылка
		|ПОМЕСТИТЬ вт_СчетаПоступленияСделки
		|ИЗ
		|	Документ.РелизКлиента КАК РелизКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
		|			ПО СчетНаОплатуПокупателюДокументыОснования.Ссылка = ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю
		|				И (ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.Проведен)
		|		ПО (РелизКлиента.Ссылка = &Ссылка)
		|			И РелизКлиента.Заявка = СчетНаОплатуПокупателюДокументыОснования.Документ
		|			И (СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Релиз Собственника
		|ВЫБРАТЬ
		|	&Ссылка КАК Основание,
		|	РелизКлиента.РелизСобственника КАК Ссылка
		|ИЗ
		|	Документ.РелизКлиента КАК РелизКлиента
		|ГДЕ
		|	РелизКлиента.Ссылка = &Ссылка
		|	И РелизКлиента.ВыдачаОтСобственника
		|
		// Заявка
        // выводится типовым механизмом, второй раз не добавляем
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	&Ссылка,
		//|	РелизКлиента.Заявка
		//|ИЗ
		//|	Документ.РелизКлиента КАК РелизКлиента
		//|ГДЕ
		//|	РелизКлиента.Ссылка = &Ссылка
		//|	И РелизКлиента.Заявка <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		// Счета по Заявке
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Ссылка,
		|	вт_СчетаПоступленияСделки.СчетСсылка
		|ИЗ
		|	вт_СчетаПоступленияСделки КАК вт_СчетаПоступленияСделки
		|
		|ОБЪЕДИНИТЬ
		|
		// Сделки по Заявке
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Ссылка,
		|	вт_СчетаПоступленияСделки.СделкаСсылка
		|ИЗ
		|	вт_СчетаПоступленияСделки КАК вт_СчетаПоступленияСделки
		|ГДЕ
		|	вт_СчетаПоступленияСделки.СделкаСсылка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		// Поступления по Счетам
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Ссылка,
		|	вт_СчетаПоступленияСделки.ПоступлениеСсылка
		|ИЗ
		|	вт_СчетаПоступленияСделки КАК вт_СчетаПоступленияСделки
		|ГДЕ
		|	вт_СчетаПоступленияСделки.ПоступлениеСсылка <> ЗНАЧЕНИЕ(Документ.ПоступлениеНаРасчетныйСчет.ПустаяСсылка)
		|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	УстановитьПривилегированныйРежим(Истина);
	
	СвязанныеОбъекты = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	СвязанныеОбъекты.Отбор.Основание.Установить(Ссылка);
	
	СвязанныеОбъекты.Прочитать();
	МассивЗаписейВРегистре = СвязанныеОбъекты.ВыгрузитьКолонку("Ссылка");
    МассивСсылокИзВыборки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивыИдентичны = ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(МассивЗаписейВРегистре, МассивСсылокИзВыборки);

	Если НЕ МассивыИдентичны Тогда
		
		СвязанныеОбъекты.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = СвязанныеОбъекты.Добавить();
			НоваяЗапись.Основание = Выборка.Основание;
			НоваяЗапись.Ссылка = Выборка.Ссылка;
		КонецЦикла; 
	
		СвязанныеОбъекты.Записать();
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //Евросиб Коханенко Н.А. 02.04.2024 )) #80513 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли