Функция СоздатьИЗаполнитьДокументПереносаДанных(ИсточникДанных) Экспорт
	Результат = Неопределено;
	#Область СтараяВерсия
	//Если ИсточникДанных = Перечисления.ИсточникиДанныхИнформацииОтТерминалов.РучнаяЗагрузка Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РучнаяЗагрузкаСтоков.Период КАК Период,
	//	|	РучнаяЗагрузкаСтоков.КТК КАК КТК,
	//	|	РучнаяЗагрузкаСтоков.Терминал КАК Терминал,
	//	|	РучнаяЗагрузкаСтоков.ДатаОперации КАК ДатаОперации,
	//	|	РучнаяЗагрузкаСтоков.Контрагент КАК Контрагент,
	//	|	РучнаяЗагрузкаСтоков.ФедеральныйОкруг КАК ФедеральныйОкруг,
	//	|	РучнаяЗагрузкаСтоков.Город КАК Город,
	//	|	РучнаяЗагрузкаСтоков.Станция КАК Станция,
	//	|	РучнаяЗагрузкаСтоков.Состояние КАК Состояние,
	//	|	РучнаяЗагрузкаСтоков.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	//	|	РучнаяЗагрузкаСтоков.ВидТранспорта КАК ВидТранспорта,
	//	|	РучнаяЗагрузкаСтоков.НомерТранспорта КАК НомерТранспорта,
	//	|	РучнаяЗагрузкаСтоков.ФИОВодителя КАК ФИОВодителя,
	//	|	РучнаяЗагрузкаСтоков.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	//	|	РучнаяЗагрузкаСтоков.ТипОперации КАК ТипОперации,
	//	|	РучнаяЗагрузкаСтоков.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	//	|	РучнаяЗагрузкаСтоков.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	//	|	РучнаяЗагрузкаСтоков.ЛинияПодсток КАК ЛинияПодсток,
	//	|	РучнаяЗагрузкаСтоков.НаличиеПодвреждения КАК НаличиеПодвреждения,
	//	|	РучнаяЗагрузкаСтоков.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	//	|	РучнаяЗагрузкаСтоков.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	//	|	РучнаяЗагрузкаСтоков.КомментарийТерминала КАК КомментарийТерминала,
	//	|	РучнаяЗагрузкаСтоков.КомментарийСотрудника КАК КомментарийСотрудника,
	//	|	РучнаяЗагрузкаСтоков.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	//	|	РучнаяЗагрузкаСтоков.ТипПодрядчика КАК ТипПодрядчика,
	//	|	РучнаяЗагрузкаСтоков.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	//	|	РучнаяЗагрузкаСтоков.ПеренесеноВЧистыйСток КАК ПеренесеноВЧистыйСток,
	//	|	РучнаяЗагрузкаСтоков.ДатаВыходаПредыдущегоТерминала КАК ДатаВыходаПредыдущегоТерминала,
	//	|	РучнаяЗагрузкаСтоков.СправочникОшибок КАК СправочникОшибок,
	//	|	РучнаяЗагрузкаСтоков.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток,
	//	|	РучнаяЗагрузкаСтоков.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	//	|	РучнаяЗагрузкаСтоков.ДатаВыхода КАК ДатаВыхода
	//	|ПОМЕСТИТЬ ВТ_ДанныеДляЗагрузки
	//	|ИЗ
	//	|	РегистрСведений.РучнаяЗагрузкаСтоков КАК РучнаяЗагрузкаСтоков
	//	|ГДЕ
	//	|	НЕ РучнаяЗагрузкаСтоков.ПеренесенВЧистыйСток
	//	|	И ВЫБОР
	//	|			КОГДА РучнаяЗагрузкаСтоков.СправочникОшибок <> ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)
	//	|				ТОГДА РучнаяЗагрузкаСтоков.СправочникОшибок.ВсеОшибкиИсправлены
	//	|			ИНАЧЕ ИСТИНА
	//	|		КОНЕЦ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеДляЗагрузки.КТК КАК Контейнер,
	//	|	ВТ_ДанныеДляЗагрузки.Состояние КАК Состояние,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	//	|	ВТ_ДанныеДляЗагрузки.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	//	|	ВТ_ДанныеДляЗагрузки.ЛинияПодсток КАК ЛинияПодсток,
	//	|	ВТ_ДанныеДляЗагрузки.НаличиеПодвреждения КАК НаличиеПодвреждения,
	//	|	ВТ_ДанныеДляЗагрузки.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийТерминала КАК КомментарийТерминала,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОперации КАК ДатаОперации,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийСотрудника КАК КомментарийСотрудника,
	//	|	ВТ_ДанныеДляЗагрузки.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	//	|	ВТ_ДанныеДляЗагрузки.ФИОВодителя КАК ФИОВодителя,
	//	|	ВТ_ДанныеДляЗагрузки.НомерТранспорта КАК НомерТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспорта КАК ВидТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	//	|	ВТ_ДанныеДляЗагрузки.Станция КАК Станция,
	//	|	ВТ_ДанныеДляЗагрузки.Контрагент КАК Контрагент
	//	|ПОМЕСТИТЬ ВТ_ДанныеПоОперациямЧистыйСток
	//	|ИЗ
	//	|	ВТ_ДанныеДляЗагрузки КАК ВТ_ДанныеДляЗагрузки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ДанныеДляЗагрузки.КТК,
	//	|	ВТ_ДанныеДляЗагрузки.ЗаявкаНаВыдачу,
	//	|	ВТ_ДанныеДляЗагрузки.Состояние,
	//	|	ВТ_ДанныеДляЗагрузки.ЛинияПодсток,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОбновленияИнформации,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийТерминала,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОперации,
	//	|	ВТ_ДанныеДляЗагрузки.ТерминальнаяУслуга,
	//	|	ВТ_ДанныеДляЗагрузки.НаличиеПодвреждения,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийСотрудника,
	//	|	ВТ_ДанныеДляЗагрузки.ИсточникДобавленияДанных,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспортаУбытия,
	//	|	ВТ_ДанныеДляЗагрузки.ФИОВодителя,
	//	|	ВТ_ДанныеДляЗагрузки.НомерТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.ОтветственныйЗаЗагрузку,
	//	|	ВТ_ДанныеДляЗагрузки.Станция,
	//	|	ВТ_ДанныеДляЗагрузки.Контрагент
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.Контейнер КАК Контейнер,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ДатаОперации КАК ДатаОперации,
	//	|	МАКСИМУМ(ВТ_ДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации) КАК ДатаОбновленияИнформации
	//	|ПОМЕСТИТЬ ВТ_ДанныеПоОперациямЧистыйСток_Максимум
	//	|ИЗ
	//	|	ВТ_ДанныеПоОперациямЧистыйСток КАК ВТ_ДанныеПоОперациямЧистыйСток
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.Контейнер,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ДатаОперации
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.КТК КАК Контейнер,
	//	|	ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Терминал КАК Терминал,
	//	|	ВЫБОР
	//	|		КОГДА ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.ВидДвижения = ""Приход""
	//	|			ТОГДА ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Количество
	//	|		ИНАЧЕ -ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Количество
	//	|	КОНЕЦ КАК Количество,
	//	|	ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Период КАК ДатаОперации,
	//	|	ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Ссылка КАК ДокументЗагрузки
	//	|ПОМЕСТИТЬ ВТ_СгенерированныеЗаписиМестоположения
	//	|ИЗ
	//	|	Документ.ЗагрузкаСтоков.СгенерированныеЗаписиМестоположения КАК ЗагрузкаСтоковСгенерированныеЗаписиМестоположения
	//	|ГДЕ
	//	|	ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.Ссылка.Проведен
	//	|	И НЕ ЗагрузкаСтоковСгенерированныеЗаписиМестоположения.ПеренесеноВЧистыйСток
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеПоОперациямЧистыйСток_Максимум.Контейнер КАК Контейнер,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток_Максимум.ДатаОперации КАК ДатаОперации,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток_Максимум.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.Состояние КАК Состояние,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ЛинияПодсток КАК ЛинияПодсток,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.НаличиеПодвреждения КАК НаличиеПодвреждения,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.КомментарийТерминала КАК КомментарийТерминала,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.КомментарийСотрудника КАК КомментарийСотрудника,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ФИОВодителя КАК ФИОВодителя,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.НомерТранспорта КАК НомерТранспорта,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ВидТранспорта КАК ВидТранспорта,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.Станция КАК Станция,
	//	|	ВТ_ДанныеПоОперациямЧистыйСток.Контрагент КАК Контрагент
	//	|ИЗ
	//	|	ВТ_ДанныеПоОперациямЧистыйСток_Максимум КАК ВТ_ДанныеПоОперациямЧистыйСток_Максимум
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОперациямЧистыйСток КАК ВТ_ДанныеПоОперациямЧистыйСток
	//	|		ПО ВТ_ДанныеПоОперациямЧистыйСток_Максимум.Контейнер = ВТ_ДанныеПоОперациямЧистыйСток.Контейнер
	//	|			И ВТ_ДанныеПоОперациямЧистыйСток_Максимум.ДатаОперации = ВТ_ДанныеПоОперациямЧистыйСток.ДатаОперации
	//	|			И ВТ_ДанныеПоОперациямЧистыйСток_Максимум.ДатаОбновленияИнформации = ВТ_ДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеДляЗагрузки.КТК КАК КТК,
	//	|	ВТ_ДанныеДляЗагрузки.Контрагент КАК Собственник
	//	|ИЗ
	//	|	ВТ_ДанныеДляЗагрузки КАК ВТ_ДанныеДляЗагрузки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ДанныеДляЗагрузки.КТК,
	//	|	ВТ_ДанныеДляЗагрузки.Контрагент
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеДляЗагрузки.КТК КАК Контейнер,
	//	|	ВТ_ДанныеДляЗагрузки.Терминал КАК Терминал,
	//	|	1 КАК Количество,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОперации КАК ДатаОперации
	//	|ИЗ
	//	|	ВТ_ДанныеДляЗагрузки КАК ВТ_ДанныеДляЗагрузки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ДанныеДляЗагрузки.КТК,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОперации,
	//	|	ВТ_ДанныеДляЗагрузки.Терминал
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеДляЗагрузки.КТК,
	//	|	ВТ_ДанныеДляЗагрузки.Терминал,
	//	|	-1,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаВыхода
	//	|ИЗ
	//	|	ВТ_ДанныеДляЗагрузки КАК ВТ_ДанныеДляЗагрузки
	//	|ГДЕ
	//	|	ВТ_ДанныеДляЗагрузки.ДатаВыхода <> ДАТАВРЕМЯ(1, 1, 1)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ДанныеДляЗагрузки.КТК,
	//	|	ВТ_ДанныеДляЗагрузки.Терминал,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаВыхода
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДатаОперации
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДанныеДляЗагрузки.Период КАК Период,
	//	|	ВТ_ДанныеДляЗагрузки.КТК КАК КТК,
	//	|	ВТ_ДанныеДляЗагрузки.Терминал КАК Терминал,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОперации КАК ДатаОперации,
	//	|	ВТ_ДанныеДляЗагрузки.Контрагент КАК Контрагент,
	//	|	ВТ_ДанныеДляЗагрузки.ФедеральныйОкруг КАК ФедеральныйОкруг,
	//	|	ВТ_ДанныеДляЗагрузки.Город КАК Город,
	//	|	ВТ_ДанныеДляЗагрузки.Станция КАК Станция,
	//	|	ВТ_ДанныеДляЗагрузки.Состояние КАК Состояние,
	//	|	ВТ_ДанныеДляЗагрузки.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспорта КАК ВидТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.НомерТранспорта КАК НомерТранспорта,
	//	|	ВТ_ДанныеДляЗагрузки.ФИОВодителя КАК ФИОВодителя,
	//	|	ВТ_ДанныеДляЗагрузки.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	//	|	ВТ_ДанныеДляЗагрузки.ТипОперации КАК ТипОперации,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	//	|	ВТ_ДанныеДляЗагрузки.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	//	|	ВТ_ДанныеДляЗагрузки.ЛинияПодсток КАК ЛинияПодсток,
	//	|	ВТ_ДанныеДляЗагрузки.НаличиеПодвреждения КАК НаличиеПодвреждения,
	//	|	ВТ_ДанныеДляЗагрузки.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	//	|	ВТ_ДанныеДляЗагрузки.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийТерминала КАК КомментарийТерминала,
	//	|	ВТ_ДанныеДляЗагрузки.КомментарийСотрудника КАК КомментарийСотрудника,
	//	|	ВТ_ДанныеДляЗагрузки.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	//	|	ВТ_ДанныеДляЗагрузки.ТипПодрядчика КАК ТипПодрядчика,
	//	|	ВТ_ДанныеДляЗагрузки.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	//	|	ВТ_ДанныеДляЗагрузки.ПеренесеноВЧистыйСток КАК ПеренесеноВЧистыйСток,
	//	|	ВТ_ДанныеДляЗагрузки.ДатаВыходаПредыдущегоТерминала КАК ДатаВыходаПредыдущегоТерминала,
	//	|	ВТ_ДанныеДляЗагрузки.СправочникОшибок КАК СправочникОшибок,
	//	|	ВТ_ДанныеДляЗагрузки.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток
	//	|ИЗ
	//	|	ВТ_ДанныеДляЗагрузки КАК ВТ_ДанныеДляЗагрузки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_СгенерированныеЗаписиМестоположения.ДокументЗагрузки КАК ДокументЗагрузки
	//	|ИЗ
	//	|	ВТ_СгенерированныеЗаписиМестоположения КАК ВТ_СгенерированныеЗаписиМестоположения
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_СгенерированныеЗаписиМестоположения.ДокументЗагрузки";
	//КонецЕсли;
	//
	//РезультатыЗапроса = Запрос.ВыполнитьПакет();
	//ДанныеПоОперациямЧистыйСток = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-4].Выгрузить();
	//СобственникиКонтейнеров = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-3].Выгрузить();
	//МестонахождениеЧистыйСток = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-2].Выгрузить();
	#КонецОбласти
	
	Если Не ТранзакцияАктивна() Тогда
		НачатьТранзакцию();
	КонецЕсли;     
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 113133 Начало 03.07.2025 
	//перенесено в рег задание АннулированиеНеподтвержденныхСтрокПоИнформацииОтАвтоподрядчика
	//Было:
	////Контроль 48 часов
	//Попытка
	//	ВыполнитьКонтроль48Часов();
	//Исключение
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	//	Если ТранзакцияАктивна() Тогда
	//		ОтменитьТранзакцию();
	//		ВызватьИсключение(ОписаниеОшибки());
	//	КонецЕсли;
	//КонецПопытки;
	
	ДокументОбъект = Документы.ПереносДанныхВЧистыйСток.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.УстановитьНовыйНомер();
	
	ЗаполнитьДанныеИзИсточниковДляЧистогоСтокаНаСервере(ДокументОбъект);  
	ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере_Новая(ДокументОбъект);  
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Результат = ДокументОбъект.Ссылка;
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
			ВызватьИсключение(ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура УдалитьВыполнитьКонтроль48Часов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МестонахождениеЧистыйСтокОстатки.Контейнер КАК Контейнер,
		|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
		|	ЕСТЬNULL(ДанныеПоОперациямЧистыйСтокАктуальный.ДатаОперации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА МестонахождениеЧистыйСтокОстатки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА -МестонахождениеЧистыйСтокОстатки.Количество
		|		ИНАЧЕ МестонахождениеЧистыйСтокОстатки.Количество
		|	КОНЕЦ КАК КоличествоОстаток,
		|	МестонахождениеЧистыйСтокОстатки.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВТ_МестонахождениеАктуальное
		|ИЗ
		|	РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСтокОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСтокАктуальный КАК ДанныеПоОперациямЧистыйСтокАктуальный
		|		ПО МестонахождениеЧистыйСтокОстатки.Контейнер = ДанныеПоОперациямЧистыйСтокАктуальный.Контейнер
		|			И МестонахождениеЧистыйСтокОстатки.Терминал = ДанныеПоОперациямЧистыйСтокАктуальный.Терминал
		|ГДЕ
		|	МестонахождениеЧистыйСтокОстатки.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|	И МестонахождениеЧистыйСтокОстатки.Регистратор ССЫЛКА Документ.ПереносДанныхВЧистыйСток
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контейнер,
		|	ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МестонахождениеАктуальное.Терминал КАК Терминал,
		|	ВТ_МестонахождениеАктуальное.Контейнер КАК Контейнер,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации КАК ДатаОперации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_МестонахождениеАктуальное.КоличествоОстаток КАК КоличествоОстаток,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанныхСток
		|ПОМЕСТИТЬ ВТ_ЧистыйСток
		|ИЗ
		|	ВТ_МестонахождениеАктуальное КАК ВТ_МестонахождениеАктуальное
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних(, ) КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСтокДанныеРедактирования.СрезПоследних(, ) КАК ДанныеПоОперациямЧистыйСтокДанныеРедактированияСрезПоследних
		|			ПО ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = ДанныеПоОперациямЧистыйСтокДанныеРедактированияСрезПоследних.Контейнер
		|				И ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = ДанныеПоОперациямЧистыйСтокДанныеРедактированияСрезПоследних.ДатаОперации
		|		ПО ВТ_МестонахождениеАктуальное.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЧистыйСток.Контейнер КАК Контейнер,
		|	МАКСИМУМ(ВТ_ЧистыйСток.ДатаОперации) КАК ДатаОперации
		|ПОМЕСТИТЬ ВТ_Максимумы
		|ИЗ
		|	ВТ_ЧистыйСток КАК ВТ_ЧистыйСток
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЧистыйСток.Контейнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Максимумы.ДатаОперации КАК ДатаОперации,
		|	ВТ_ЧистыйСток.Терминал КАК Терминал,
		|	ВТ_ЧистыйСток.Контейнер КАК Контейнер,
		|	ВТ_ЧистыйСток.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_ЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ЧистыйСток.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ПредИтог
		|ИЗ
		|	ВТ_Максимумы КАК ВТ_Максимумы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЧистыйСток КАК ВТ_ЧистыйСток
		|		ПО ВТ_Максимумы.Контейнер = ВТ_ЧистыйСток.Контейнер
		|			И ВТ_Максимумы.ДатаОперации = ВТ_ЧистыйСток.ДатаОперации
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВТ_ЧистыйСток.ДатаОбновленияИнформации, &ТекущаяДата, МИНУТА) >= 1
		|	И ВТ_ЧистыйСток.ИсточникДобавленияДанныхСток = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредИтог.ДатаОперации КАК ДатаОперации,
		|	ВТ_ПредИтог.Терминал КАК Терминал,
		|	ВТ_ПредИтог.Контейнер КАК Контейнер,
		|	ВТ_ПредИтог.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_ПредИтог.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ПредИтог.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ВТ_ПредИтог КАК ВТ_ПредИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам КАК ИнформацияОтАвтоподрядчиковПоТерминалам
		|		ПО ВТ_ПредИтог.ДатаОперации = ИнформацияОтАвтоподрядчиковПоТерминалам.ДатаОперации
		|			И ВТ_ПредИтог.Контейнер = ИнформацияОтАвтоподрядчиковПоТерминалам.Контейнер
		|			И ВТ_ПредИтог.Терминал = ИнформацияОтАвтоподрядчиковПоТерминалам.Терминал
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ИнформацияОтАвтоподрядчиковПоТерминалам.ОшибкиПриЗагрузкеИнформацииОтТерминалов, ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ ИнформацияОтАвтоподрядчиковПоТерминалам.ОшибкиПриЗагрузкеИнформацииОтТерминалов.Контроль48Часов
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Данные записи надо удалить с чистого стока.
		Параметры = Новый Структура("Контейнер,Терминал,ДатаОперации,КоличествоОстаток",Выборка.Контейнер,Выборка.Терминал,Выборка.ДатаОперации,Выборка.КоличествоОстаток);
		Отказ = Ложь;
		Попытка
			ДокументРедактирования = Документы.РедактированиеДанныхЧистогоСтока.ВвестиДокументСторно(Параметры,Отказ);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ШаблонОшибки = СтрШаблон("Не удалось сформировать сторно Контейнер:%1 ,Терминал:%2, ДатаОперации:%3, КоличествоОстаток:%4",
				Выборка.Контейнер,Выборка.Терминал,Выборка.ДатаОперации,Выборка.КоличествоОстаток);
				ВызватьИсключение(ШаблонОшибки);
			КонецЕсли;	
		КонецПопытки;
		//Запись ошибки
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(Выборка.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(Выборка.ДатаОперации);
		НаборИсточника.Отбор.Терминал.Установить(Выборка.Терминал);
		НаборИсточника.Прочитать();
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если Не ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда 
				//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Начало 23.07.2025
				//СправочникОшибки = СоздатьСправочникОшибки();
				СправочникОшибки = СоздатьСправочникОшибки(Перечисления.ОшибкиЗагрузкиСтоков.Другое, Истина);
				//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Конец 23.07.2025
				СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов = СправочникОшибки;
				НаборИсточника.ОбменДанными.Загрузка = Истина;
				НаборИсточника.Записать();
			Иначе
				ДополнитьСправочникОшибки(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов, Перечисления.ОшибкиЗагрузкиСтоков.Другое, Истина);	
			КонецЕсли;
		КонецЕсли; 
		
		Если Не Отказ Тогда
			ЗаполнитьРегистрАктуальный(ДокументРедактирования,Параметры);
		Иначе
			Если ТранзакцияАктивна() Тогда
				ВызватьИсключение("Не удалось сформировать сторно");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 23.07.2025 добавлены параметры ТипОшибки и Контроль48Часов
//Процедура ДополнитьСправочникОшибки48Часов(СправочникСсылка) Экспорт
Процедура ДополнитьСправочникОшибки(СправочникСсылка, ТипОшибки, Контроль48Часов) Экспорт
	
	СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	СправочникОбъект.Контроль48Часов = Контроль48Часов;
	СтрокаОшибкиСправочника = СправочникОбъект.ОшибкиПриЗагрузке.Добавить();
	СтрокаОшибкиСправочника.ТипОшибки = ТипОшибки;
	СтрокаОшибкиСправочника.Пользователь = Пользователи.ТекущийПользователь();
	
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 23.07.2025 добавлены параметры ТипОшибки и Контроль48Часов
Функция СоздатьСправочникОшибки(ТипОшибки, Контроль48Часов) Экспорт
	
	СправочникОбъект = Справочники.ОшибкиПриЗагрузкеИнформацииОтТерминалов.СоздатьЭлемент();
	//СправочникОбъект.ОшибкиПриЗагрузке.Загрузить(ТаблицаОшибок);
	СправочникОбъект.УстановитьНовыйКод();
	СправочникОбъект.Контроль48Часов = Контроль48Часов;
	СтрокаОшибкиСправочника = СправочникОбъект.ОшибкиПриЗагрузке.Добавить();
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Начало 23.07.2025
	//СтрокаОшибкиСправочника.ТипОшибки = Перечисления.ОшибкиЗагрузкиСтоков.Другое;
	СтрокаОшибкиСправочника.ТипОшибки = ТипОшибки;
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Конец 23.07.2025 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 18.08.2025
	Если ТипОшибки = Перечисления.ОшибкиЗагрузкиСтоков.ИнформацияОтАвтоподрядчика Тогда
		СтрокаОшибкиСправочника.ИсправляемаяОшибка = Истина;
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 18.08.2025
	СтрокаОшибкиСправочника.Пользователь = Пользователи.ТекущийПользователь();
	
	
	Попытка
		СправочникОбъект.Записать();
		Возврат СправочникОбъект.Ссылка;
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции 

Процедура ОтметитьДанныеЗагруженными(ДанныеДляПометки) Экспорт
	//Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
	//Для Каждого СтрокаДанных Из ДанныеДляПометки Цикл
	//	Если СтрокаДанных.ИсточникДобавленияДанных = Справочники.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка Тогда
	//		Набор = РегистрыСведений.РучнаяЗагрузкаСтоков.СоздатьНаборЗаписей();
	//		Набор.Отбор.КТК.Установить(СтрокаДанных.Контейнер);
	//	ИначеЕсли СтрокаДанных.ИсточникДобавленияДанных = Справочники.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков Тогда
	//		Набор = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
	//		Набор.Отбор.Контейнер.Установить(СтрокаДанных.Контейнер);
	//	ИначеЕсли СтрокаДанных.ИсточникДобавленияДанных = Справочники.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов Тогда
	//		Набор = РегистрыСведений.ИнформацияОтТерминаловCodeco.СоздатьНаборЗаписей();
	//		Набор.Отбор.Контейнер.Установить(СтрокаДанных.Контейнер);
	//	КонецЕсли;
	//	Набор.Отбор.ДатаОперации.Установить(СтрокаДанных.ДатаОперации);
	//	Набор.Отбор.Терминал.Установить(СтрокаДанных.Терминал);
	//	Набор.Прочитать();
	//	Для Каждого СтрокаНабора Из Набор Цикл
	//		СтрокаНабора.ПеренесенВЧистыйСток = Истина;
	//	КонецЦикла;
	//	Набор.Записать();
	//КонецЦикла;
	
	УстановитьВРегистреРучнаяЗагрузкаСтоков(ДанныеДляПометки);
	УстановитьВРегистреИнформацияОтАвтоподрядчиковПоТерминалам(ДанныеДляПометки);
	УстановитьВРегистреИнформацияОтТерминаловCodeco(ДанныеДляПометки);
	//Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
КонецПроцедуры

Процедура УстановитьВРегистреИнформацияОтТерминаловCodeco(ДанныеДляПометки) //Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&ТЗ КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
		|ГДЕ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияОтТерминаловCodeco.Период КАК Период,
		|	ИнформацияОтТерминаловCodeco.Контейнер КАК Контейнер,
		|	ИнформацияОтТерминаловCodeco.Терминал КАК Терминал,
		|	ИнформацияОтТерминаловCodeco.ДатаОперации КАК ДатаОперации,
		|	ИнформацияОтТерминаловCodeco.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток
		|ПОМЕСТИТЬ ИТОГ
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОтТерминаловCodeco КАК ИнформацияОтТерминаловCodeco
		|		ПО (ИнформацияОтТерминаловCodeco.Контейнер = ВременнаяТаблица.Контейнер)
		|			И (ИнформацияОтТерминаловCodeco.Терминал = ВременнаяТаблица.Терминал)
		|			И (ИнформацияОтТерминаловCodeco.ДатаОперации = ВременнаяТаблица.ДатаОперации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТОГ.Период КАК Период,
		|	ИТОГ.Контейнер КАК Контейнер,
		|	ИТОГ.Терминал КАК Терминал,
		|	ИТОГ.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	ИТОГ КАК ИТОГ
		|ГДЕ
		|	НЕ ИТОГ.ПеренесенВЧистыйСток";
	
	Запрос.УстановитьПараметр("ТЗ", ДанныеДляПометки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.ИнформацияОтТерминаловCodeco.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		Набор.Отбор.Контейнер.Установить(ВыборкаДетальныеЗаписи.Контейнер);
		Набор.Отбор.ДатаОперации.Установить(ВыборкаДетальныеЗаписи.ДатаОперации);
		Набор.Отбор.Терминал.Установить(ВыборкаДетальныеЗаписи.Терминал);
		Набор.Прочитать();
		Для Каждого СтрокаНабора Из Набор Цикл
			СтрокаНабора.ПеренесенВЧистыйСток = Истина;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВРегистреИнформацияОтАвтоподрядчиковПоТерминалам(ДанныеДляПометки) //Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&ТЗ КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
		|ГДЕ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Период КАК Период,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Контейнер КАК Контейнер,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.Терминал КАК Терминал,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.ДатаОперации КАК ДатаОперации,
		|	ИнформацияОтАвтоподрядчиковПоТерминалам.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток
		|ПОМЕСТИТЬ ИТОГ
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам КАК ИнформацияОтАвтоподрядчиковПоТерминалам
		|		ПО (ИнформацияОтАвтоподрядчиковПоТерминалам.Контейнер = ВременнаяТаблица.Контейнер)
		|			И (ИнформацияОтАвтоподрядчиковПоТерминалам.Терминал = ВременнаяТаблица.Терминал)
		|			И (ИнформацияОтАвтоподрядчиковПоТерминалам.ДатаОперации = ВременнаяТаблица.ДатаОперации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТОГ.Период КАК Период,
		|	ИТОГ.Контейнер КАК Контейнер,
		|	ИТОГ.Терминал КАК Терминал,
		|	ИТОГ.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	ИТОГ КАК ИТОГ
		|ГДЕ
		|	НЕ ИТОГ.ПеренесенВЧистыйСток";
	
	Запрос.УстановитьПараметр("ТЗ", ДанныеДляПометки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		Набор.Отбор.Контейнер.Установить(ВыборкаДетальныеЗаписи.Контейнер);
		Набор.Отбор.ДатаОперации.Установить(ВыборкаДетальныеЗаписи.ДатаОперации);
		Набор.Отбор.Терминал.Установить(ВыборкаДетальныеЗаписи.Терминал);
		Набор.Прочитать();
		Для Каждого СтрокаНабора Из Набор Цикл
			СтрокаНабора.ПеренесенВЧистыйСток = Истина;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВРегистреРучнаяЗагрузкаСтоков(ДанныеДляПометки) //Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&ТЗ КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
		|ГДЕ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РучнаяЗагрузкаСтоков.Период КАК Период,
		|	РучнаяЗагрузкаСтоков.КТК КАК КТК,
		|	РучнаяЗагрузкаСтоков.Терминал КАК Терминал,
		|	РучнаяЗагрузкаСтоков.ДатаОперации КАК ДатаОперации,
		|	РучнаяЗагрузкаСтоков.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток
		|ПОМЕСТИТЬ ИТОГ
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РучнаяЗагрузкаСтоков КАК РучнаяЗагрузкаСтоков
		|		ПО (РучнаяЗагрузкаСтоков.КТК = ВременнаяТаблица.Контейнер)
		|			И (РучнаяЗагрузкаСтоков.Терминал = ВременнаяТаблица.Терминал)
		|			И (РучнаяЗагрузкаСтоков.ДатаОперации = ВременнаяТаблица.ДатаОперации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТОГ.Период КАК Период,
		|	ИТОГ.КТК КАК КТК,
		|	ИТОГ.Терминал КАК Терминал,
		|	ИТОГ.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	ИТОГ КАК ИТОГ
		|ГДЕ
		|	НЕ ИТОГ.ПеренесенВЧистыйСток";
	
	Запрос.УстановитьПараметр("ТЗ", ДанныеДляПометки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.РучнаяЗагрузкаСтоков.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		Набор.Отбор.КТК.Установить(ВыборкаДетальныеЗаписи.КТК);
		Набор.Отбор.ДатаОперации.Установить(ВыборкаДетальныеЗаписи.ДатаОперации);
		Набор.Отбор.Терминал.Установить(ВыборкаДетальныеЗаписи.Терминал);
		Набор.Прочитать();
		Для Каждого СтрокаНабора Из Набор Цикл
			СтрокаНабора.ПеренесенВЧистыйСток = Истина;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияДокумента(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Начало 27.06.2025
	//Ищем в РН Местонахождение ЧС авторасходные строки, которые были созданы ранее и их можно сторнировать (пришел фактический расход от терминалов)
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Контейнер КАК Контейнер,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Терминал КАК Терминал,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Состояние КАК Состояние,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 21.08.2025  
	//|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОперации КАК ДатаОперации,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОперацииОбогащаемая КАК ДатаОперации, 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 21.08.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Действие КАК Действие,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Авторасход КАК Авторасход,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
	|ПОМЕСТИТЬ ВТ_ДанныеПоОперациямЧС
	|ИЗ
	|	Документ.ПереносДанныхВЧистыйСток.ДанныеПоОперациямЧистыйСток КАК ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток
	|ГДЕ
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Ссылка = &Ссылка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоОперациямЧС.Контейнер КАК Контейнер,
	|	ВТ_ДанныеПоОперациямЧС.Терминал КАК Терминал,
	|	ВТ_ДанныеПоОперациямЧС.Состояние КАК Состояние,
	|	ВТ_ДанныеПоОперациямЧС.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеПоОперациямЧС.Действие КАК Действие,
	|	ВТ_ДанныеПоОперациямЧС.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_ДанныеРасходаОтТерминалов
	|ИЗ
	|	ВТ_ДанныеПоОперациямЧС КАК ВТ_ДанныеПоОперациямЧС
	|ГДЕ
	|	ВТ_ДанныеПоОперациямЧС.Действие = Значение(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход) 
	|	И ВТ_ДанныеПоОперациямЧС.Авторасход = ЛОЖЬ  
	|	И ВТ_ДанныеПоОперациямЧС.ИсточникДобавленияДанных <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРасходаОтТерминалов.Контейнер КАК Контейнер,
	|	ВТ_ДанныеРасходаОтТерминалов.Терминал КАК Терминал,
	|	ВТ_ДанныеРасходаОтТерминалов.Состояние КАК Состояние,
	|	МАКСИМУМ(МестонахождениеЧистыйСтокОбороты.Период) КАК ДатаОперацииПриходаПредыдущая,
	|	ВТ_ДанныеРасходаОтТерминалов.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеРасходаОтТерминалов.Действие КАК Действие,
	|	ВТ_ДанныеРасходаОтТерминалов.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_ПоискПредыдущегоПрихода
	|ИЗ
	|	ВТ_ДанныеРасходаОтТерминалов КАК ВТ_ДанныеРасходаОтТерминалов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Обороты(, , Запись, ) КАК МестонахождениеЧистыйСтокОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
	|			ПО (ДанныеПоОперациямЧистыйСток.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер)
	|				И (ДанныеПоОперациямЧистыйСток.ДатаОперации = МестонахождениеЧистыйСтокОбороты.Период)
	|		ПО ВТ_ДанныеРасходаОтТерминалов.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер
	|			И ВТ_ДанныеРасходаОтТерминалов.Терминал = МестонахождениеЧистыйСтокОбороты.Терминал
	|			И (МестонахождениеЧистыйСтокОбороты.КоличествоПриход = 1)
	|			И (МестонахождениеЧистыйСтокОбороты.Период < ВТ_ДанныеРасходаОтТерминалов.ДатаОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеРасходаОтТерминалов.Контейнер,
	|	ВТ_ДанныеРасходаОтТерминалов.Терминал,
	|	ВТ_ДанныеРасходаОтТерминалов.Состояние,
	|	ДанныеПоОперациямЧистыйСток.Состояние,
	|	МестонахождениеЧистыйСтокОбороты.Терминал,
	|	ВТ_ДанныеРасходаОтТерминалов.ДатаОперации,
	|	ВТ_ДанныеРасходаОтТерминалов.Действие,
	|	ВТ_ДанныеРасходаОтТерминалов.ИдентификаторСтроки
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	МестонахождениеЧистыйСтокОбороты.Период КАК Период,
	|	МестонахождениеЧистыйСтокОбороты.Контейнер КАК Контейнер,
	|	МестонахождениеЧистыйСтокОбороты.Период КАК ИсходнаяДатаОперации,
	|	МестонахождениеЧистыйСтокОбороты.Терминал КАК Терминал,
	|	ВТ_ПоискПредыдущегоПрихода.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка) КАК ИсточникДобавленияДанных,
	|	- МестонахождениеЧистыйСтокОбороты.КоличествоРасход КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ПОМЕСТИТЬ ВТ_АвторасходКСторно
	|ИЗ
	|	РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
	|			,
	|			,
	|			Запись,
	|			(Контейнер, Терминал) В
	|				(ВЫБРАТЬ
	|					Т.Контейнер,
	|					Т.Терминал
	|				ИЗ
	|					ВТ_ДанныеРасходаОтТерминалов КАК Т)) КАК МестонахождениеЧистыйСтокОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних(
	|				,
	|				Авторасход
	|					И Контейнер В
	|						(ВЫБРАТЬ
	|							Т.Контейнер
	|						ИЗ
	|							ВТ_ДанныеРасходаОтТерминалов КАК Т)) КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
	|		ПО (МестонахождениеЧистыйСтокОбороты.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер)
	|			И (ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = МестонахождениеЧистыйСтокОбороты.Период)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоискПредыдущегоПрихода КАК ВТ_ПоискПредыдущегоПрихода
	|		ПО (ВТ_ПоискПредыдущегоПрихода.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер)
	|			И (ВТ_ПоискПредыдущегоПрихода.Терминал = МестонахождениеЧистыйСтокОбороты.Терминал)
	|			И ВТ_ПоискПредыдущегоПрихода.ДатаОперацииПриходаПредыдущая < МестонахождениеЧистыйСтокОбороты.Период
	|			И (МестонахождениеЧистыйСтокОбороты.КоличествоРасход > 0)   
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Конец 27.06.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Ссылка КАК Регистратор,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации КАК Период,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Начало 21.08.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОперацииОбогащаемая КАК ДатаОперацииОбогащаемая,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Конец 21.08.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОперации КАК ДатаОперации,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Контейнер КАК Контейнер,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Состояние КАК Состояние,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ЛинияПодсток КАК ЛинияПодсток,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ФИОВодителя КАК ФИОВодителя,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НомерТранспорта КАК НомерТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ВидТранспорта КАК ВидТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Станция КАК Станция,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.КомментарийТерминала КАК КомментарийТерминала,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Контрагент КАК Контрагент,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Комбинированная КАК Комбинированная,   
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Начало 27.06.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Авторасход КАК Авторасход,
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Конец 27.06.2025
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ПереносДанныхВЧистыйСток.ДанныеПоОперациямЧистыйСток КАК ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток
	|ГДЕ
	|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.Ссылка КАК Регистратор,
	|	ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.КТК КАК КТК,
	|	МАКСИМУМ(ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.Собственник) КАК Собственник
	|ИЗ
	|	Документ.ПереносДанныхВЧистыйСток.СобственникиКонтейнеров КАК ПереносДанныхВЧистыйСтокСобственникиКонтейнеров
	|ГДЕ
	|	ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.Ссылка,
	|	ПереносДанныхВЧистыйСтокСобственникиКонтейнеров.КТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Ссылка КАК Регистратор,
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ДатаОперации КАК Период,
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Контейнер КАК Контейнер, 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Начало 12.08.2025
	//|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ДатаОперации КАК ИсходнаяДатаОперации,
	|	Выбор когда ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ИсходнаяДатаОперации <> ДатаВремя(1,1,1,0,0,0)
	|		Тогда ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ИсходнаяДатаОперации
	|		Иначе ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ДатаОперации 
	|	Конец КАК ИсходнаяДатаОперации,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Конец 12.08.2025
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Терминал КАК Терминал,
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВЫБОР  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Начало 13.08.2025
	|		КОГДА ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Сторно   
	|			ТОГДА ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Конец 13.08.2025
	|		КОГДА ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество < 0
	|			ТОГДА -ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество
	|		ИНАЧЕ ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА (ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество < 0  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Начало 13.08.2025
	|			И не ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Сторно)
	|			ИЛИ (ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Количество > 0
	|			И ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Сторно)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Конец 13.08.2025
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения
	|ИЗ
	|	Документ.ПереносДанныхВЧистыйСток.МестонахождениеЧистыйСток КАК ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток
	|ГДЕ
	|	ПереносДанныхВЧистыйСтокМестонахождениеЧистыйСток.Ссылка = &Ссылка 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Начало 27.06.2025
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвторасходКСторно.Регистратор,
	|	АвторасходКСторно.Период,
	|	АвторасходКСторно.Контейнер,
	|	АвторасходКСторно.ИсходнаяДатаОперации,
	|	АвторасходКСторно.Терминал,
	|	АвторасходКСторно.ИдентификаторСтроки,
	|	АвторасходКСторно.ИсточникДобавленияДанных,
	|	АвторасходКСторно.Количество,
	|	АвторасходКСторно.ВидДвижения
	|ИЗ 
	|	ВТ_АвторасходКСторно КАК АвторасходКСторно";
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Конец 27.06.2025
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	//ДанныеПоОперациямЧистыйСток
	ТаблицаКПроведению = ПроверитьДанныеПоОперациямЧистыйСток(РезультатыЗапроса[РезультатыЗапроса.ВГраница()-2].Выгрузить(), Источник.Ссылка);
	ТаблицаИдентификаторов = ТаблицаКПроведению.Скопировать(,"ИдентификаторСтроки");
	ТаблицаИдентификаторов.Свернуть("ИдентификаторСтроки");
	УспешныеСтроки = ТаблицаИдентификаторов.ВыгрузитьКолонку("ИдентификаторСтроки");
	
	Источник.Движения.ДанныеПоОперациямЧистыйСток.Загрузить(ТаблицаКПроведению);
	Источник.Движения.ДанныеПоОперациямЧистыйСток.Записывать = Истина;
	Источник.Движения.ДанныеПоОперациямЧистыйСток.Записать();
	//СобственникиКонтейнеров
	Источник.Движения.СобственникиКонтейнеров.Загрузить(РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выгрузить());
	Источник.Движения.СобственникиКонтейнеров.Записывать = Истина;
	
	//МестонахождениеЧистыйСток
	ТаблицаМестонахождения = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить();
	Для Каждого СтрокаМестонахождения Из ТаблицаМестонахождения Цикл     
		Если УспешныеСтроки.Найти(СтрокаМестонахождения.ИдентификаторСтроки) = Неопределено 
			//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Начало 12.08.2025 - техническую запись переносим всегда
			и СтрокаМестонахождения.ИсточникДобавленияДанных <> Справочники.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись Тогда
			//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115175 Конец 12.08.2025
			Продолжить;
		КонецЕсли;      
		ЗаполнитьЗначенияСвойств(Источник.Движения.МестонахождениеЧистыйСток.Добавить(),СтрокаМестонахождения);
	КонецЦикла;
	Источник.Движения.МестонахождениеЧистыйСток.Записывать = Истина;
	Источник.Движения.МестонахождениеЧистыйСток.Записать();   
	//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ЗаполнитьРегистрАктуальныйПропустить") Тогда
		ЗаполнитьРегистрАктуальный(Источник);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025
	ЗаписатьПризнакЗагрузкиТерминала(Источник);
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025 
	
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Начало 11.03.2025
	ЗаписатьБлокировкуКонтейнеров(Источник); 
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Конец 11.03.2025  
	
КонецПроцедуры

Функция ПроверитьДанныеПоОперациямЧистыйСток(Коллекция, Ссылка)
	ТаблицаРезультат = Коллекция.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Коллекция",Коллекция);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Период КАК Период,
		|	Т.Контейнер КАК Контейнер,
		|	Т.ДатаОперации КАК ДатаОперации,
		|	Т.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Набор
		|ИЗ
		|	&Коллекция КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоОперациямЧистыйСток.Контейнер КАК Контейнер,
		|	ДанныеПоОперациямЧистыйСток.ДатаОперации КАК ДатаОперации,
		|	ДанныеПоОперациямЧистыйСток.Период КАК Период,
		|	ДанныеПоОперациямЧистыйСток.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДанныеБД
		|ИЗ
		|	РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
		|ГДЕ
		|	(ДанныеПоОперациямЧистыйСток.Период, ДанныеПоОперациямЧистыйСток.Контейнер, ДанныеПоОперациямЧистыйСток.ДатаОперации) В
		|			(ВЫБРАТЬ
		|				ВТ_Набор.Период КАК Период,
		|				ВТ_Набор.Контейнер КАК Контейнер,
		|				ВТ_Набор.ДатаОперации КАК ДатаОперации
		|			ИЗ
		|				ВТ_Набор КАК ВТ_Набор)
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Начало 27.06.2025
		|	и ДанныеПоОперациямЧистыйСток.Регистратор <> &Ссылка
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Конец 27.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоОперациямЧистыйСток.Контейнер,
		|	ДанныеПоОперациямЧистыйСток.ДатаОперации,
		|	ДанныеПоОперациямЧистыйСток.Период,
		|	ДанныеПоОперациямЧистыйСток.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Набор.Период КАК Период,
		|	ВТ_Набор.Контейнер КАК Контейнер,
		|	ВТ_Набор.ДатаОперации КАК ДатаОперации,
		|	ВТ_Набор.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ОбщиеДанные_начало
		|ИЗ
		|	ВТ_Набор КАК ВТ_Набор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеБД.Период,
		|	ВТ_ДанныеБД.Контейнер,
		|	ВТ_ДанныеБД.ДатаОперации,
		|	ВТ_ДанныеБД.НомерСтроки
		|ИЗ
		|	ВТ_ДанныеБД КАК ВТ_ДанныеБД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеДанные_начало.Период КАК Период,
		|	ВТ_ОбщиеДанные_начало.Контейнер КАК Контейнер,
		|	ВТ_ОбщиеДанные_начало.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОбщиеДанные_начало.НомерСтроки КАК НомерСтроки,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТ_ОбщиеДанные
		|ИЗ
		|	ВТ_ОбщиеДанные_начало КАК ВТ_ОбщиеДанные_начало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеДанные.Период КАК Период,
		|	ВТ_ОбщиеДанные.Контейнер КАК Контейнер,
		|	ВТ_ОбщиеДанные.ДатаОперации КАК ДатаОперации,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбщиеДанные.НомерЗаписи) КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТ_РасчетДублей
		|ИЗ
		|	ВТ_ОбщиеДанные КАК ВТ_ОбщиеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбщиеДанные.Период,
		|	ВТ_ОбщиеДанные.ДатаОперации,
		|	ВТ_ОбщиеДанные.Контейнер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбщиеДанные.НомерЗаписи) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Набор.Период КАК Период,
		|	ВТ_Набор.Контейнер КАК Контейнер,
		|	ВТ_Набор.ДатаОперации КАК ДатаОперации,
		|	ВТ_Набор.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Набор КАК ВТ_Набор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетДублей КАК ВТ_РасчетДублей
		|		ПО ВТ_Набор.Период = ВТ_РасчетДублей.Период
		|			И ВТ_Набор.Контейнер = ВТ_РасчетДублей.Контейнер
		|			И ВТ_Набор.ДатаОперации = ВТ_РасчетДублей.ДатаОперации
		|ГДЕ
		|	ВТ_РасчетДублей.НомерЗаписи ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетДублей.Период КАК Период,
		|	ВТ_РасчетДублей.Контейнер КАК Контейнер,
		|	ВТ_РасчетДублей.ДатаОперации КАК ДатаОперации,
		|	ВТ_РасчетДублей.НомерЗаписи КАК НомерЗаписи
		|ИЗ
		|	ВТ_РасчетДублей КАК ВТ_РасчетДублей";
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Начало 27.06.2025
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112968 (п.4) Конец 27.06.2025                                                                         
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаУспех = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выгрузить();
	ТаблицаОшибок = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить();
	
	Для Каждого СтрокаУспех Из ТаблицаУспех Цикл
		Отбор = Новый Структура("НомерСтроки,Период,Контейнер,ДатаОперации");
		ЗаполнитьЗначенияСвойств(Отбор,СтрокаУспех);
		НайденныеСтроки = Коллекция.НайтиСтроки(Отбор); 
		Если НайденныеСтроки.Количество() Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(),НайденныеСтроки[0]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		Ошибка = СтрШаблон("Обнаружена не уникальная запись Период:%1 Контейнер:%2 ДатаОперации:%3",СтрокаОшибки.Период,СтрокаОшибки.Контейнер,СтрокаОшибки.ДатаОперации);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		ЗаписьЖурналаРегистрации("ПроведениеПереносЧистыйСток_ДанныеПоОперациямЧистыйСток",,,,Ошибка);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
КонецФункции

Процедура ЗаполнитьРегистрАктуальный(Источник,Параметры = Неопределено) Экспорт
	Терминал = Неопределено;
	Контейнер = Неопределено;
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("Терминал",Терминал);
		Параметры.Свойство("Контейнер",Контейнер);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
		//"ВЫБРАТЬ 
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
		//|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер КАК Контейнер,
		//|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации КАК ДатаОперации,
		//|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Терминал КАК Терминал,
		//|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Период КАК Период
		//|ПОМЕСТИТЬ ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков
		//|ИЗ
		//|	РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СрезПоследних(
		//|			,
		//|			ТребуетсяПодтверждениеОперацииАвтоподрядчика = ИСТИНА
		//|				И ПеренесенВЧистыйСток = ИСТИНА
		//|				И ДОБАВИТЬКДАТЕ(ДатаОперации, ЧАС, &СрокПодтверждения) < &ТекущаяДата
		//|				И (ОшибкиПриЗагрузкеИнформацииОтТерминалов <> ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)
		//|					ИЛИ ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены = ЛОЖЬ)
		//|				И ВЫБОР
		//|					КОГДА &ЕстьОтборКонтейнер
		//|						ТОГДА Контейнер = &Контейнер
		//|					ИНАЧЕ ИСТИНА
		//|				КОНЕЦ
		//|				И ВЫБОР
		//|					КОГДА &ЕстьОтборТерминал
		//|						ТОГДА Терминал = &Терминал
		//|					ИНАЧЕ ИСТИНА
		//|				КОНЕЦ) КАК ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних 
		//|ГДЕ
		//|	&УстановленСрокПодтвержденияДанныхАвтоподрядчика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер КАК Контейнер,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации КАК ДатаОперации,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
		//|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Комбинированная КАК Комбинированная
		//|ПОМЕСТИТЬ ВТ_СрезАналитики
		//|ИЗ
		//|	РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних КАК ДанныеПоОперациямЧистыйСтокСрезПоследних 
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков КАК ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков
		//|		ПО (ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.Контейнер
		//|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.ДатаОперации
		//|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		//|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.ДатаОперации)
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА &ЕстьОтборКонтейнер
		//|				ТОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = &Контейнер
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ     
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
		//|	И ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.Контейнер ЕСТЬ NULL
		////Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_СрезАналитики.Контейнер КАК Контейнер,
		//|	МАКСИМУМ(ВТ_СрезАналитики.ДатаОперации) КАК ДатаОперации
		//|ПОМЕСТИТЬ ВТ_МаксимумАналитики
		//|ИЗ
		//|	ВТ_СрезАналитики КАК ВТ_СрезАналитики
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_СрезАналитики.Контейнер
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_СрезАналитики.Контейнер КАК Контейнер,
		//|	ВТ_СрезАналитики.ДатаОперации КАК ДатаОперации,
		//|	ВТ_СрезАналитики.Состояние КАК Состояние,
		//|	ВТ_СрезАналитики.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		//|	ВТ_СрезАналитики.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		//|	ВТ_СрезАналитики.ЛинияПодсток КАК ЛинияПодсток,
		//|	ВТ_СрезАналитики.НаличиеПодвреждения КАК НаличиеПодвреждения,
		//|	ВТ_СрезАналитики.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		//|	ВТ_СрезАналитики.КомментарийТерминала КАК КомментарийТерминала,
		//|	ВТ_СрезАналитики.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		//|	ВТ_СрезАналитики.КомментарийСотрудника КАК КомментарийСотрудника,
		//|	ВТ_СрезАналитики.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		//|	ВТ_СрезАналитики.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		//|	ВТ_СрезАналитики.ФИОВодителя КАК ФИОВодителя,
		//|	ВТ_СрезАналитики.НомерТранспорта КАК НомерТранспорта,
		//|	ВТ_СрезАналитики.ВидТранспорта КАК ВидТранспорта,
		//|	ВТ_СрезАналитики.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		//|	ВТ_СрезАналитики.Станция КАК Станция,
		//|	ВТ_СрезАналитики.Комбинированная КАК Комбинированная,
		//|	ВТ_СрезАналитики.Контрагент КАК Контрагент
		//|ПОМЕСТИТЬ ВТ_Аналитика
		//|ИЗ
		//|	ВТ_МаксимумАналитики КАК ВТ_МаксимумАналитики
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СрезАналитики КАК ВТ_СрезАналитики
		//|		ПО ВТ_МаксимумАналитики.Контейнер = ВТ_СрезАналитики.Контейнер
		//|			И ВТ_МаксимумАналитики.ДатаОперации = ВТ_СрезАналитики.ДатаОперации
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Аналитика.Контейнер КАК Контейнер,
		//|	ВТ_Аналитика.ДатаОперации КАК ДатаОперации,
		//|	ВТ_Аналитика.Состояние КАК Состояние,
		//|	ВТ_Аналитика.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		//|	ВТ_Аналитика.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		//|	ВТ_Аналитика.ЛинияПодсток КАК ЛинияПодсток,
		//|	ВТ_Аналитика.НаличиеПодвреждения КАК НаличиеПодвреждения,
		//|	ВТ_Аналитика.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		//|	ВТ_Аналитика.КомментарийТерминала КАК КомментарийТерминала,
		//|	ВТ_Аналитика.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		//|	ВТ_Аналитика.КомментарийСотрудника КАК КомментарийСотрудника,
		//|	ВТ_Аналитика.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		//|	ВТ_Аналитика.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		//|	ВТ_Аналитика.ФИОВодителя КАК ФИОВодителя,
		//|	ВТ_Аналитика.НомерТранспорта КАК НомерТранспорта,
		//|	ВТ_Аналитика.ВидТранспорта КАК ВидТранспорта,
		//|	ВТ_Аналитика.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		//|	ВТ_Аналитика.Станция КАК Станция,
		//|	ВТ_Аналитика.Контрагент КАК Контрагент,
		//|	ВТ_Аналитика.Комбинированная КАК Комбинированная,
		//|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
		//|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК Количество,   
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(МестонахождениеЧистыйСтокОстатки.КоличествоОстаток, 0) <= 0
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ДобавлятьСтроку
		//|ИЗ
		//|	ВТ_Аналитика КАК ВТ_Аналитика
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Остатки КАК МестонахождениеЧистыйСтокОстатки
		//|		ПО ВТ_Аналитика.Контейнер = МестонахождениеЧистыйСтокОстатки.Контейнер
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА &ЕстьОтборТерминал
		//|				ТОГДА МестонахождениеЧистыйСтокОстатки.Терминал = &Терминал
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//|ИТОГИ ПО
		//|	Терминал,
		//|	ДатаОперации";
		
		"ВЫБРАТЬ
		|	МАКСИМУМ(МестонахождениеЧистыйСтокОбороты.Период) КАК Период,
		|	МестонахождениеЧистыйСтокОбороты.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ПоследнииПриходы
		|ИЗ
		|	РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
		|			,
		|			,
		|			Секунда,
		|			ВЫБОР
		|					КОГДА &ЕстьОтборКонтейнер
		|						ТОГДА Контейнер = &Контейнер
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ЕстьОтборТерминал
		|						ТОГДА Терминал = &Терминал
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК МестонахождениеЧистыйСтокОбороты
		|ГДЕ
		|	МестонахождениеЧистыйСтокОбороты.КоличествоПриход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	МестонахождениеЧистыйСтокОбороты.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПоследнииПриходы.Период КАК Период,
		|	ВТ_ПоследнииПриходы.Контейнер КАК Контейнер,
		|	МестонахождениеЧистыйСтокОбороты.Терминал КАК Терминал
		|ПОМЕСТИТЬ ВТ_ПоследнииПриходыКонтейнерТерминал
		|ИЗ
		|	ВТ_ПоследнииПриходы КАК ВТ_ПоследнииПриходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
		|				,
		|				,
		|				Секунда,
		|				ВЫБОР
		|						КОГДА &ЕстьОтборКонтейнер
		|							ТОГДА Контейнер = &Контейнер
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &ЕстьОтборТерминал
		|							ТОГДА Терминал = &Терминал
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК МестонахождениеЧистыйСтокОбороты
		|		ПО (МестонахождениеЧистыйСтокОбороты.Период = ВТ_ПоследнииПриходы.Период)
		|			И ВТ_ПоследнииПриходы.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоследнииПриходыКонтейнерТерминал.Контейнер КАК Контейнер,
		|	ВТ_ПоследнииПриходыКонтейнерТерминал.Терминал КАК Терминал,
		|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки	
		|ИЗ
		|	ВТ_ПоследнииПриходыКонтейнерТерминал КАК ВТ_ПоследнииПриходыКонтейнерТерминал
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Остатки(
		|				,
		|				ВЫБОР
		|										КОГДА &ЕстьОтборКонтейнер
		|											ТОГДА Контейнер = &Контейнер
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|									И ВЫБОР
		|										КОГДА &ЕстьОтборТерминал
		|											ТОГДА Терминал = &Терминал
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ) КАК МестонахождениеЧистыйСтокОстатки
		|		ПО (МестонахождениеЧистыйСтокОстатки.Терминал = ВТ_ПоследнииПриходыКонтейнерТерминал.Терминал)
		|			И (ВТ_ПоследнииПриходыКонтейнерТерминал.Контейнер = МестонахождениеЧистыйСтокОстатки.Контейнер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер КАК Контейнер,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации КАК ДатаОперации,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Терминал КАК Терминал,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков
		|ИЗ
		|	РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СрезПоследних(
		|			,
		|			ТребуетсяПодтверждениеОперацииАвтоподрядчика = ИСТИНА
		|				И ПеренесенВЧистыйСток = ИСТИНА
		|				И ДОБАВИТЬКДАТЕ(ДатаОперации, ЧАС, &СрокПодтверждения) < &ТекущаяДата
		|				И (ОшибкиПриЗагрузкеИнформацииОтТерминалов <> ЗНАЧЕНИЕ(Справочник.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПустаяСсылка)
		|					ИЛИ ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены = ЛОЖЬ)
		|				И ВЫБОР
		|					КОГДА &ЕстьОтборКонтейнер
		|						ТОГДА Контейнер = &Контейнер
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ЕстьОтборТерминал
		|						ТОГДА Терминал = &Терминал
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних
		|ГДЕ
		|	&УстановленСрокПодтвержденияДанныхАвтоподрядчика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер КАК Контейнер,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации КАК ДатаОперации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Комбинированная КАК Комбинированная
		|ПОМЕСТИТЬ ВТ_СрезАналитики
		|ИЗ
		|	РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков КАК ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков
		|		ПО ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.Контейнер
		|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.ДатаОперации
		|			И (ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков))
		|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации = ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.ДатаОперации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьОтборКонтейнер
		|				ТОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = &Контейнер
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВТ_ИсключитьНеподтвержденныеДанныеОтАвтоподрядчиков.Контейнер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрезАналитики.Контейнер КАК Контейнер,
		|	МАКСИМУМ(ВТ_СрезАналитики.ДатаОперации) КАК ДатаОперации
		|ПОМЕСТИТЬ ВТ_МаксимумАналитики
		|ИЗ
		|	ВТ_СрезАналитики КАК ВТ_СрезАналитики
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СрезАналитики.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрезАналитики.Контейнер КАК Контейнер,
		|	ВТ_СрезАналитики.ДатаОперации КАК ДатаОперации,
		|	ВТ_СрезАналитики.Состояние КАК Состояние,
		|	ВТ_СрезАналитики.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_СрезАналитики.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ВТ_СрезАналитики.ЛинияПодсток КАК ЛинияПодсток,
		|	ВТ_СрезАналитики.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ВТ_СрезАналитики.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ВТ_СрезАналитики.КомментарийТерминала КАК КомментарийТерминала,
		|	ВТ_СрезАналитики.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ВТ_СрезАналитики.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ВТ_СрезАналитики.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_СрезАналитики.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ВТ_СрезАналитики.ФИОВодителя КАК ФИОВодителя,
		|	ВТ_СрезАналитики.НомерТранспорта КАК НомерТранспорта,
		|	ВТ_СрезАналитики.ВидТранспорта КАК ВидТранспорта,
		|	ВТ_СрезАналитики.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ВТ_СрезАналитики.Станция КАК Станция,
		|	ВТ_СрезАналитики.Комбинированная КАК Комбинированная,
		|	ВТ_СрезАналитики.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Аналитика
		|ИЗ
		|	ВТ_МаксимумАналитики КАК ВТ_МаксимумАналитики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СрезАналитики КАК ВТ_СрезАналитики
		|		ПО ВТ_МаксимумАналитики.Контейнер = ВТ_СрезАналитики.Контейнер
		|			И ВТ_МаксимумАналитики.ДатаОперации = ВТ_СрезАналитики.ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Аналитика.Контейнер КАК Контейнер,
		|	ВТ_Аналитика.ДатаОперации КАК ДатаОперации,
		|	ВТ_Аналитика.Состояние КАК Состояние,
		|	ВТ_Аналитика.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_Аналитика.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ВТ_Аналитика.ЛинияПодсток КАК ЛинияПодсток,
		|	ВТ_Аналитика.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ВТ_Аналитика.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ВТ_Аналитика.КомментарийТерминала КАК КомментарийТерминала,
		|	ВТ_Аналитика.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ВТ_Аналитика.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ВТ_Аналитика.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_Аналитика.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ВТ_Аналитика.ФИОВодителя КАК ФИОВодителя,
		|	ВТ_Аналитика.НомерТранспорта КАК НомерТранспорта,
		|	ВТ_Аналитика.ВидТранспорта КАК ВидТранспорта,
		|	ВТ_Аналитика.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ВТ_Аналитика.Станция КАК Станция,
		|	ВТ_Аналитика.Контрагент КАК Контрагент,
		|	ВТ_Аналитика.Комбинированная КАК Комбинированная,
		|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
		|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(МестонахождениеЧистыйСтокОстатки.КоличествоОстаток, 0) <= 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ДобавлятьСтроку
		|ИЗ
		|	ВТ_Аналитика КАК ВТ_Аналитика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остатки КАК МестонахождениеЧистыйСтокОстатки
		|		ПО ВТ_Аналитика.Контейнер = МестонахождениеЧистыйСтокОстатки.Контейнер
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьОтборТерминал
		|				ТОГДА МестонахождениеЧистыйСтокОстатки.Терминал = &Терминал
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|ИТОГИ ПО
		|	Терминал,
		|	ДатаОперации";
		//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
		
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025 
	СрокПодтвержденияИнформации = Константы.СрокПодтвержденияИнформацииОтАвтоподрядчикаВТекущемСтокеЧасов.Получить(); 
	Запрос.УстановитьПараметр("УстановленСрокПодтвержденияДанныхАвтоподрядчика", ?(ЗначениеЗаполнено(СрокПодтвержденияИнформации), Истина, Ложь));
	Запрос.УстановитьПараметр("СрокПодтверждения", СрокПодтвержденияИнформации);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
	Запрос.УстановитьПараметр("Терминал",Терминал);
	Запрос.УстановитьПараметр("ЕстьОтборТерминал",ЗначениеЗаполнено(Терминал));
	Запрос.УстановитьПараметр("Контейнер",Контейнер);
	Запрос.УстановитьПараметр("ЕстьОтборКонтейнер",ЗначениеЗаполнено(Контейнер));
	РезультатЗапись = Запрос.Выполнить();
	//Очистим актуальный по терминалам которые загрузили
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПереносДанныхВЧистыйСток") Тогда
		//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПереносДанныхВЧистыйСтокТерминалы.Ссылка КАК Ссылка,
		|	ПереносДанныхВЧистыйСтокТерминалы.НомерСтроки КАК НомерСтроки,
		|	ПереносДанныхВЧистыйСтокТерминалы.Терминал КАК Терминал
		|ИЗ
		|	Документ.ПереносДанныхВЧистыйСток.Терминалы КАК ПереносДанныхВЧистыйСтокТерминалы
		|ГДЕ
		|	ПереносДанныхВЧистыйСтокТерминалы.Ссылка.Проведен";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ДанныеПоОперациямЧистыйСтокАктуальный.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.Терминал.Установить(ВыборкаТерминал.Терминал);
			НаборЗаписей.Отбор.Терминал.Установить(ВыборкаДетальныеЗаписи.Терминал);	
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		//Для Каждого СтрокаТерминала Из Источник.Терминалы Цикл
		//	НаборЗаписей = РегистрыСведений.ДанныеПоОперациямЧистыйСтокАктуальный.СоздатьНаборЗаписей();
		//	//НаборЗаписей.Отбор.Терминал.Установить(ВыборкаТерминал.Терминал);
		//	НаборЗаписей.Отбор.Терминал.Установить(СтрокаТерминала.Терминал);	
		//	НаборЗаписей.Записать();
		//КонецЦикла;
		//Евросиб Шевченко А.В. US 128390 TA 128391 27.02.2026
	ИначеЕсли ЗначениеЗаполнено(Терминал) Тогда
		НаборЗаписей = РегистрыСведений.ДанныеПоОперациямЧистыйСтокАктуальный.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Терминал.Установить(ВыборкаТерминал.Терминал);
		НаборЗаписей.Отбор.Терминал.Установить(Терминал);	
		Если ЗначениеЗаполнено(Контейнер) Тогда
			НаборЗаписей.Отбор.Контейнер.Установить(Контейнер);
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	//Поместим новые актуальные данные из остатков
	ВыборкаТерминал = РезультатЗапись.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТерминал.Следующий() Цикл
		ВыборкаДата = ВыборкаТерминал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ДанныеПоОперациямЧистыйСтокАктуальный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДатаОперации.Установить(ВыборкаДата.ДатаОперации);
			НаборЗаписей.Отбор.Терминал.Установить(ВыборкаТерминал.Терминал);
			
			
			Выборка = ВыборкаДата.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.ДобавлятьСтроку Тогда
					ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Выборка); 
				КонецЕсли;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере(Объект) Экспорт //Евросиб(ДИТ) US 78754 ТА 98408 Шевченко А.В. Начало: 19.12.2024
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеИзИсточниковДляЧистогоСтока",Объект.ДанныеИзИсточниковДляЧистогоСтока.Выгрузить());
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НомерСтроки КАК НомерСтроки,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Состояние КАК Состояние,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЛинияПодсток КАК ЛинияПодсток,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийТерминала КАК КомментарийТерминала,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контрагент КАК Контрагент,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ФИОВодителя КАК ФИОВодителя,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НомерТранспорта КАК НомерТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Станция КАК Станция,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспорта КАК ВидТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.УИД КАК УИД,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации КАК ТипОперации
	|ПОМЕСТИТЬ ВТ_ДанныеИзИсточников
	|ИЗ
	|	&ДанныеИзИсточниковДляЧистогоСтока КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.УИД КАК УИД,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|				ТОГДА 1
	|			КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|				ТОГДА 2
	|			КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|				ТОГДА 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыПоГуидам
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеИзИсточников.УИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер КАК Контейнер,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 1
	|		КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 2
	|		КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	|	ВТ_ДанныеИзИсточников.УИД КАК УИД,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ДанныеПоОперациям
	|ИЗ
	|	РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ПО ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер = ВТ_ДанныеИзИсточников.Контейнер
	|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние = ВТ_ДанныеИзИсточников.Состояние
	|			И ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция = ВТ_ДанныеИзИсточников.Станция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоОперациям.Контейнер КАК Контейнер,
	|	ВТ_ДанныеПоОперациям.Состояние КАК Состояние,
	|	ВТ_ДанныеПоОперациям.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеПоОперациям.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеПоОперациям.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеПоОперациям.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеПоОперациям.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеПоОперациям.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеПоОперациям.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеПоОперациям.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеПоОперациям.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеПоОперациям.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеПоОперациям.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеПоОперациям.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеПоОперациям.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеПоОперациям.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеПоОперациям.Станция КАК Станция,
	|	ВТ_ДанныеПоОперациям.Контрагент КАК Контрагент,
	|	ВТ_ДанныеПоОперациям.Приоритет КАК Приоритет,
	|	ВТ_ДанныеПоОперациям.УИД КАК УИД,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Сторнировать) КАК Действие
	|ИЗ
	|	ВТ_ДанныеПоОперациям КАК ВТ_ДанныеПоОперациям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыПоГуидам КАК ВТ_ПриоритетыПоГуидам
	|		ПО ВТ_ДанныеПоОперациям.УИД = ВТ_ПриоритетыПоГуидам.УИД
	|			И ВТ_ДанныеПоОперациям.Приоритет > ВТ_ПриоритетыПоГуидам.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеИзИсточников.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточников.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточников.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеИзИсточников.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеИзИсточников.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеИзИсточников.Контрагент КАК Контрагент,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточников.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточников.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеИзИсточников.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеИзИсточников.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточников.Станция КАК Станция,
	|	ВТ_ДанныеИзИсточников.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеИзИсточников.УИД КАК УИД,
	|	ВТ_ДанныеИзИсточников.ТипОперации КАК ТипОперации,
	|	ВТ_ПриоритетыПоГуидам.Приоритет КАК Приоритет,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ДанныеИзИсточниковСМаксПриоритетом
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыПоГуидам КАК ВТ_ПриоритетыПоГуидам
	|		ПО ВТ_ДанныеИзИсточников.УИД = ВТ_ПриоритетыПоГуидам.УИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контрагент КАК Контрагент,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Станция КАК Станция,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.УИД КАК УИД,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ТипОперации КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить) КАК Действие,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Терминал КАК Терминал
	|ИЗ
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом КАК ВТ_ДанныеИзИсточниковСМаксПриоритетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОперациям КАК ВТ_ДанныеПоОперациям
	|		ПО ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контейнер = ВТ_ДанныеПоОперациям.Контейнер
	|			И ВТ_ДанныеИзИсточниковСМаксПриоритетом.Состояние = ВТ_ДанныеПоОперациям.Состояние
	|			И ВТ_ДанныеИзИсточниковСМаксПриоритетом.Станция = ВТ_ДанныеПоОперациям.Станция
	|			И ВТ_ДанныеИзИсточниковСМаксПриоритетом.Приоритет > ВТ_ДанныеПоОперациям.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контрагент КАК Контрагент,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Станция КАК Станция,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.УИД КАК УИД,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.ТипОперации КАК ТипОперации,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Приоритет КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести) КАК Действие,
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом.Терминал КАК Терминал
	|ИЗ
	|	ВТ_ДанныеИзИсточниковСМаксПриоритетом КАК ВТ_ДанныеИзИсточниковСМаксПриоритетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОперациям КАК ВТ_ДанныеПоОперациям
	|		ПО ВТ_ДанныеИзИсточниковСМаксПриоритетом.Контейнер = ВТ_ДанныеПоОперациям.Контейнер
	|			И ВТ_ДанныеИзИсточниковСМаксПриоритетом.Состояние = ВТ_ДанныеПоОперациям.Состояние
	|			И ВТ_ДанныеИзИсточниковСМаксПриоритетом.Станция = ВТ_ДанныеПоОперациям.Станция
	|ГДЕ
	|	ВТ_ДанныеПоОперациям.Контейнер ЕСТЬ NULL";
	
	//Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписиСторно = РезультатЗапроса[3].Выбрать();
	ВыборкаДетальныеЗаписиНеПереносить = РезультатЗапроса[5].Выбрать();
	ВыборкаДетальныеЗаписиПереносить = РезультатЗапроса[6].Выбрать();
	
	Объект.ДанныеПоОперациямЧистыйСток.Очистить();
	
	Пока ВыборкаДетальныеЗаписиСторно.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДанныеПоОперациямЧистыйСток.Добавить(),ВыборкаДетальныеЗаписиСторно);
	КонецЦикла;
	Пока ВыборкаДетальныеЗаписиНеПереносить.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДанныеПоОперациямЧистыйСток.Добавить(),ВыборкаДетальныеЗаписиНеПереносить);
	КонецЦикла;
	Пока ВыборкаДетальныеЗаписиПереносить.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДанныеПоОперациямЧистыйСток.Добавить(),ВыборкаДетальныеЗаписиПереносить);
	КонецЦикла;
	
	Объект.ДанныеПоОперациямЧистыйСток.Сортировать("УИД");
	
	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 23.12.2024
	Объект.МестонахождениеЧистыйСток.Очистить();
	Для Каждого СтрокаОпераци Из Объект.ДанныеПоОперациямЧистыйСток Цикл
		Если СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНакопления = Объект.МестонахождениеЧистыйСток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНакопления, СтрокаОпераци);
		Если СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести Тогда
			СтрокаНакопления.Количество = 1;
		ИначеЕсли СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Сторнировать
			ИЛИ СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход Тогда
			СтрокаНакопления.Количество = -1;
		КонецЕсли;
	КонецЦикла;
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 23.12.2024
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПереносаВЧистыйСтокНаСервере_Новая(Объект) Экспорт //Евросиб(ДИТ) US 78754 ТА 98408 Шевченко А.В. Начало: 19.12.2024
	
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 19.08.2025
	//Если пришли подтверждающие данные для автоподрядчиков от терминалов позже 48 часов (уже есть сторно),
	//то удаляем сторнирование информации от автоподрядчиков
	УбратьСторнированиеПодтвержденныхСтрокАвтоподрядчиков(Объект.ДанныеИзИсточниковДляЧистогоСтока.Выгрузить());
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 19.08.2025
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеИзИсточниковДляЧистогоСтока",Объект.ДанныеИзИсточниковДляЧистогоСтока.Выгрузить());
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаДанныхПереносаВЧистыйСток(); 
	
	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 26.02.2025
	//Старая версия заполнения до обогащения 2.0
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Объект.ДанныеПоОперациямЧистыйСток.Очистить();
	//
	//Пока Выборка.Следующий() Цикл
	//	ЗаполнитьЗначенияСвойств(Объект.ДанныеПоОперациямЧистыйСток.Добавить(),Выборка);
	//КонецЦикла;
	  
	Объект.ДанныеПоОперациямЧистыйСток.Очистить();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	// данные которые не надо обогащать
	ВыборкаПрямогоПереноса = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	Пока ВыборкаПрямогоПереноса.Следующий() Цикл
		СтрокаТЧ = Объект.ДанныеПоОперациямЧистыйСток.Добавить();
		СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаПрямогоПереноса);
		
	КонецЦикла;
	
	//Обогащение 2.0
	ТаблицаКОбогащению = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-2].Выгрузить();
	ТаблицаМаксимумовПриоритета = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить();
	ДанныеКПереносу = ОбогатитьТаблицуПоКлючам(ТаблицаКОбогащению,ТаблицаМаксимумовПриоритета);
	Для Каждого СтрокаДанных Из ДанныеКПереносу Цикл
		СтрокаТЧ = Объект.ДанныеПоОперациямЧистыйСток.Добавить();
		СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаДанных);	
	КонецЦикла;
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 26.02.2025

	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025
	ДозаполнитьДанныеПоРасходуТерминалов(Объект);
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025
	
	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 26.02.2025
	Объект.ДанныеПоОперациямЧистыйСток.Сортировать("Контейнер,ДатаОперации");
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 26.02.2025
	
	Объект.МестонахождениеЧистыйСток.Очистить();
	Для Каждого СтрокаОпераци Из Объект.ДанныеПоОперациямЧистыйСток Цикл
		Если СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить 
			ИЛИ СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНакопления = Объект.МестонахождениеЧистыйСток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНакопления, СтрокаОпераци);
		Если СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести Тогда
			СтрокаНакопления.Количество = 1;
		ИначеЕсли СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Сторнировать
			ИЛИ СтрокаОпераци.Действие = Перечисления.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход Тогда
			СтрокаНакопления.Количество = -1;
		КонецЕсли;
	КонецЦикла;
	
	// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025
	ЗаполнитьТЧТерминалы(Объект);
	// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025  
	
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Начало ,.2025
	//Убираем отрицательные остатки по информации от автоподрядчиков 
	//(добавление строки Технической записи прихода, запись в спр Ошибки при загрузке информации от терминалов)    
	ДобавитьТехническуюЗаписьПриходаПоОтрицательнымОстаткамПоИнформацииАвтоподрядчиков(Объект);
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 Конец 22.07.2025
	
КонецПроцедуры  

Функция ОбогатитьТаблицуПоКлючам(Знач ТаблицаКОбогащению,ТаблицаМаксимумовПриоритета)
	ТаблицаРезультат = ТаблицаКОбогащению.СкопироватьКолонки();
	Ключи = КлючиОбогащения();
	КолонкиКОбогащению = КолонкиКОбогащению();  
	
	//Обогатим всю коллекцию
	ПрошлаяСтрока = Неопределено;
	Для Каждого СтрокаТЧ Из ТаблицаКОбогащению Цикл
		Если ПрошлаяСтрока = Неопределено Тогда
			ПрошлаяСтрока = СтрокаТЧ;
			Продолжить;
		КонецЕсли;
		Если СтрокаСовпадаетПоКлючам(Ключи,СтрокаТЧ,ПрошлаяСтрока) Тогда
			ОбогатитьСтроку(КолонкиКОбогащению,ПрошлаяСтрока,СтрокаТЧ);
			СтрокаТЧ.ДатаОбновленияИнформации = Макс(ПрошлаяСтрока.ДатаОбновленияИнформации,СтрокаТЧ.ДатаОбновленияИнформации);
			ПрошлаяСтрока = СтрокаТЧ;
		Иначе
			ПрошлаяСтрока = Неопределено;
		КонецЕсли;
	КонецЦикла;
	//Выберем самый высокий приоритет
	Для Каждого МаксПриоритет Из ТаблицаМаксимумовПриоритета Цикл
		Отбор = Новый Структура("ПриходРасход,ДатаОперацииСвязьРасхода,Контейнер,Терминал,Приоритет");
		ЗаполнитьЗначенияСвойств(Отбор,МаксПриоритет);
		ОбогащенныеСтроки = ТаблицаКОбогащению.НайтиСтроки(Отбор);
		Если ОбогащенныеСтроки.Количество() Тогда
			СтрокаРезультата = ТаблицаРезультат.Добавить();
			СтрокаДанных = ОбогащенныеСтроки[ОбогащенныеСтроки.ВГраница()];
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаРезультат;
КонецФункции

Процедура ОбогатитьСтроку(КолонкиКОбогащению,ПрошлаяСтрока,ТекущаяСтрока)
	//ПрошлаяСтрока - приоритет ниже
	Для Каждого ИмяКолонки Из КолонкиКОбогащению Цикл
		ПрошлоеЗначение = ПрошлаяСтрока[ИмяКолонки];
		ТекущееЗначение = ТекущаяСтрока[ИмяКолонки];
		Если Не ЗначениеЗаполнено(ТекущееЗначение) Тогда
			ТекущаяСтрока[ИмяКолонки] = ПрошлоеЗначение;
			ТекущаяСтрока.Комбинированная = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//Если ПрошлаяСтрока.ИсточникДобавленияДанных = ПредопределенноеЗначение("Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков")
	//	И ТекущаяСтрока.ИсточникДобавленияДанных = ПредопределенноеЗначение("Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка") 
	//	ИЛИ ПрошлаяСтрока.ДанныеИзБД Тогда   
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 18.08.2025
	// Обновляем дату операции только если приоритет текущей строки ниже приоритета предыдущей строки из БД
	//Если ПрошлаяСтрока.ДанныеИзБД Тогда
	Если ПрошлаяСтрока.ДанныеИзБД 
		и ТекущаяСтрока.Приоритет > ПрошлаяСтрока.Приоритет Тогда
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 18.08.2025
		ТекущаяСтрока.ДанныеИзБД = ПрошлаяСтрока.ДанныеИзБД;  
		//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 21.08.2025
		// дату операции не изменяем при обогащении, записываем в ресурс ДатаОперацииОбогащаемая
		//ТекущаяСтрока.ДатаОперации = ПрошлаяСтрока.ДатаОперации;
		//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 21.08.2025
		//ТекущаяСтрока.Комбинированная = Истина;
	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Функция СтрокаСовпадаетПоКлючам(Ключи,Строка1,Строка2)
	Результат = Истина;
	Для Каждого ИмяКолонки Из Ключи Цикл
		Значение1 = Строка1[ИмяКолонки];
		Значение2 = Строка2[ИмяКолонки];
		Если Значение1 <> Значение2 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция КлючиОбогащения()
	Ключи = Новый Массив;
	Ключи.Добавить("ПриходРасход");
	Ключи.Добавить("ДатаОперацииСвязьРасхода");
	Ключи.Добавить("Контейнер");
	Ключи.Добавить("Терминал");
	Возврат Ключи;
КонецФункции

Функция КолонкиКОбогащению()
	КолонкиКОбогащению = Новый Массив;
	КолонкиКОбогащению.Добавить("Состояние");
	КолонкиКОбогащению.Добавить("ТерминальнаяУслуга");
	КолонкиКОбогащению.Добавить("ЛинияПодсток");
	КолонкиКОбогащению.Добавить("НаличиеПодвреждения");
	КолонкиКОбогащению.Добавить("ЗаявкаНаВыдачу");
	КолонкиКОбогащению.Добавить("КомментарийТерминала");
	КолонкиКОбогащению.Добавить("Контрагент");
	КолонкиКОбогащению.Добавить("ЗаявкаНаСдачу");
	КолонкиКОбогащению.Добавить("КомментарийСотрудника");
	КолонкиКОбогащению.Добавить("ВидТранспортаУбытия");
	КолонкиКОбогащению.Добавить("ФИОВодителя");
	КолонкиКОбогащению.Добавить("НомерТранспорта");
	КолонкиКОбогащению.Добавить("Станция");
	КолонкиКОбогащению.Добавить("ВидТранспорта");
	КолонкиКОбогащению.Добавить("ДатаВыхода");
	Возврат КолонкиКОбогащению;
КонецФункции

Функция ТекстЗапросаДанныхПереносаВЧистыйСток_Старый()
	Возврат "ВЫБРАТЬ
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Состояние КАК Состояние,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЛинияПодсток КАК ЛинияПодсток,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийТерминала КАК КомментарийТерминала,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контрагент КАК Контрагент,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ФИОВодителя КАК ФИОВодителя,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НомерТранспорта КАК НомерТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Станция КАК Станция,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспорта КАК ВидТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.УИД КАК УИД,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации КАК ТипОперации,
	|	ЛОЖЬ КАК ДанныеИзБД,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ДанныеИзИсточников
	|ИЗ
	|	&ДанныеИзИсточниковДляЧистогоСтока КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал,
	|	ВТ_ДанныеИзИсточников.УИД КАК УИД
	|ПОМЕСТИТЬ ВТ_ПарыКлючей
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеИзИсточников.Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал,
	|	ВТ_ДанныеИзИсточников.УИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеЧистыйСтокОстатки.Контейнер КАК Контейнер,
	|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
	|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК Количество,
	|	ИСТИНА КАК ДанныеИзБД,
	|	ВТ_ПарыКлючей.УИД КАК УИД
	|ПОМЕСТИТЬ ВТ_ТекущееМестоположение
	|ИЗ
	|	РегистрНакопления.МестонахождениеЧистыйСток.Остатки(
	|			,
	|			Контейнер В
	|				(ВЫБРАТЬ
	|					ВТ_ПарыКлючей.Контейнер КАК Контейнер
	|				ИЗ
	|					ВТ_ПарыКлючей КАК ВТ_ПарыКлючей)) КАК МестонахождениеЧистыйСтокОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПарыКлючей КАК ВТ_ПарыКлючей
	|		ПО МестонахождениеЧистыйСтокОстатки.Контейнер = ВТ_ПарыКлючей.Контейнер
	|			И МестонахождениеЧистыйСтокОстатки.Терминал = ВТ_ПарыКлючей.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположение.Терминал КАК Терминал,
	|	ВТ_ТекущееМестоположение.Контейнер КАК Контейнер,
	|	ВТ_ТекущееМестоположение.Количество КАК Количество,
	|	ВТ_ТекущееМестоположение.ДанныеИзБД КАК ДанныеИзБД,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
	|	ВТ_ТекущееМестоположение.УИД КАК УИД,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_ТекущееМестоположениеСАналитикой
	|ИЗ
	|	ВТ_ТекущееМестоположение КАК ВТ_ТекущееМестоположение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних(, ) КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
	|		ПО ВТ_ТекущееМестоположение.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
	|			И ВТ_ТекущееМестоположение.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал,
	|	ВТ_ДанныеИзИсточников.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточников.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточников.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеИзИсточников.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеИзИсточников.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеИзИсточников.Контрагент КАК Контрагент,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточников.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточников.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеИзИсточников.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеИзИсточников.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточников.Станция КАК Станция,
	|	ВТ_ДанныеИзИсточников.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеИзИсточников.УИД КАК УИД,
	|	ВТ_ДанныеИзИсточников.ТипОперации КАК ТипОперации,
	|	ВТ_ДанныеИзИсточников.ДанныеИзБД КАК ДанныеИзБД,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 1
	|		КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 2
	|		КОГДА ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	|	ВТ_ДанныеИзИсточников.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ВесьКонтекстЧС_Начало
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположениеСАналитикой.Контейнер,
	|	ВТ_ТекущееМестоположениеСАналитикой.Терминал,
	|	ВТ_ТекущееМестоположениеСАналитикой.Состояние,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОбновленияИнформации,
	|	ВТ_ТекущееМестоположениеСАналитикой.ТерминальнаяУслуга,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЛинияПодсток,
	|	ВТ_ТекущееМестоположениеСАналитикой.НаличиеПодвреждения,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаВыдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийТерминала,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации,
	|	ВТ_ТекущееМестоположениеСАналитикой.Контрагент,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаСдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийСотрудника,
	|	ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспортаУбытия,
	|	ВТ_ТекущееМестоположениеСАналитикой.ФИОВодителя,
	|	ВТ_ТекущееМестоположениеСАналитикой.НомерТранспорта,
	|	ВТ_ТекущееМестоположениеСАналитикой.ОтветственныйЗаЗагрузку,
	|	ВТ_ТекущееМестоположениеСАналитикой.Станция,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспорта,
	|	ВТ_ТекущееМестоположениеСАналитикой.УИД,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт),
	|	ВТ_ТекущееМестоположениеСАналитикой.ДанныеИзБД,
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 1
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 2
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	ВТ_ТекущееМестоположениеСАналитикой КАК ВТ_ТекущееМестоположениеСАналитикой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ВЫБОР
	|		КОГДА ВТ_ВесьКонтекстЧС_Начало.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|			ТОГДА 1
	|		КОГДА ВТ_ВесьКонтекстЧС_Начало.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриходРасход,
	|	ВТ_ВесьКонтекстЧС_Начало.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстЧС_Начало.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстЧС_Начало.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстЧС_Начало.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстЧС_Начало.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстЧС_Начало.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстЧС_Начало.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстЧС_Начало.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстЧС_Начало.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстЧС_Начало.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстЧС_Начало.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстЧС_Начало.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстЧС_Начало.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстЧС_Начало.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстЧС_Начало.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстЧС_Начало.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстЧС_Начало.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстЧС_Начало.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстЧС_Начало.Станция КАК Станция,
	|	ВТ_ВесьКонтекстЧС_Начало.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстЧС_Начало.УИД КАК УИД,
	|	ВТ_ВесьКонтекстЧС_Начало.ТипОперации КАК ТипОперации,
	|	ВТ_ВесьКонтекстЧС_Начало.ДанныеИзБД КАК ДанныеИзБД,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	|	ВТ_ВесьКонтекстЧС_Начало.Приоритет КАК Приоритет,
	|	ВТ_ВесьКонтекстЧС_Начало.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ВесьКонтекстЧС
	|ИЗ
	|	ВТ_ВесьКонтекстЧС_Начало КАК ВТ_ВесьКонтекстЧС_Начало
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ПриходРасход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВесьКонтекстЧС.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстЧС.Терминал КАК Терминал,
	|	МИНИМУМ(ВТ_ВесьКонтекстЧС.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_КонтекстСрез
	|ИЗ
	|	ВТ_ВесьКонтекстЧС КАК ВТ_ВесьКонтекстЧС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВесьКонтекстЧС.ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.Терминал,
	|	ВТ_ВесьКонтекстЧС.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ВТ_ВесьКонтекстЧС.ПриходРасход КАК ПриходРасход,
	|	ВТ_ВесьКонтекстЧС.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстЧС.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстЧС.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстЧС.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстЧС.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстЧС.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстЧС.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстЧС.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстЧС.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстЧС.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстЧС.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстЧС.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстЧС.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстЧС.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстЧС.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстЧС.Станция КАК Станция,
	|	ВТ_ВесьКонтекстЧС.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстЧС.УИД КАК УИД,
	|	ВТ_ВесьКонтекстЧС.ТипОперации КАК ТипОперации,
	|	МАКСИМУМ(ВТ_ВесьКонтекстЧС.ДанныеИзБД) КАК ДанныеИзБД,
	|	ВТ_ВесьКонтекстЧС.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстЧС.Приоритет КАК Приоритет,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтрокиСреза,
	|	ВТ_ВесьКонтекстЧС.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ВесьКонтекстСрез
	|ИЗ
	|	ВТ_КонтекстСрез КАК ВТ_КонтекстСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВесьКонтекстЧС КАК ВТ_ВесьКонтекстЧС
	|		ПО ВТ_КонтекстСрез.Контейнер = ВТ_ВесьКонтекстЧС.Контейнер
	|			И ВТ_КонтекстСрез.ДатаОперации = ВТ_ВесьКонтекстЧС.ДатаОперации
	|			И ВТ_КонтекстСрез.Приоритет = ВТ_ВесьКонтекстЧС.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВесьКонтекстЧС.ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстЧС.КомментарийСотрудника,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстЧС.Контрагент,
	|	ВТ_ВесьКонтекстЧС.КомментарийТерминала,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстЧС.НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстЧС.ЛинияПодсток,
	|	ВТ_ВесьКонтекстЧС.ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстЧС.ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстЧС.Состояние,
	|	ВТ_ВесьКонтекстЧС.Терминал,
	|	ВТ_ВесьКонтекстЧС.Контейнер,
	|	ВТ_ВесьКонтекстЧС.ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.ДатаВыхода,
	|	ВТ_ВесьКонтекстЧС.ТипОперации,
	|	ВТ_ВесьКонтекстЧС.ВидТранспорта,
	|	ВТ_ВесьКонтекстЧС.ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстЧС.Станция,
	|	ВТ_ВесьКонтекстЧС.ФИОВодителя,
	|	ВТ_ВесьКонтекстЧС.НомерТранспорта,
	|	ВТ_ВесьКонтекстЧС.ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстЧС.УИД,
	|	ВТ_ВесьКонтекстЧС.ПриходРасход,
	|	ВТ_ВесьКонтекстЧС.НомерСтроки,
	|	ВТ_ВесьКонтекстЧС.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ДатаВыхода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-1 КАК ПриходРасход,
	|	ВЫБОР
	|		КОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВесьКонтекстСрез.ДатаОперации, ДЕНЬ, 1)
	|	КОНЕЦ КАК ДатаОперации,
	|	ВТ_ВесьКонтекстСрез.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстСрез.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстСрез.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстСрез.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстСрез.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстСрез.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстСрез.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстСрез.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстСрез.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстСрез.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстСрез.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстСрез.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстСрез.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстСрез.Станция КАК Станция,
	|	ВТ_ВесьКонтекстСрез.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстСрез.УИД КАК УИД,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта) КАК ТипОперации,
	|	ЛОЖЬ КАК ДанныеИзБД,
	|	ВТ_ВесьКонтекстСрез.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстСрез.Приоритет КАК Приоритет,
	|	ВТ_ВесьКонтекстСрез.НомерСтрокиСреза КАК НомерСтрокиСреза,
	|	ВТ_ВесьКонтекстСрез.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_РасчетРасхода
	|ИЗ
	|	ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез_ПрошлаяСтрока
	|		ПО (ВТ_ВесьКонтекстСрез.НомерСтрокиСреза = ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.НомерСтрокиСреза - 1)
	|ГДЕ
	|	ВТ_ВесьКонтекстСрез.ПриходРасход = 1
	|	И ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.ПриходРасход = 1
	|	И ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.Контейнер
	|	И ВТ_ВесьКонтекстСрез.Терминал <> ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.Контейнер ЕСТЬ NULL
	|			ТОГДА ВТ_ВесьКонтекстСрез.ПриходРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриходРасход,
	|	ВТ_ВесьКонтекстСрез.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстСрез.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстСрез.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстСрез.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстСрез.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстСрез.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстСрез.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстСрез.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстСрез.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстСрез.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстСрез.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстСрез.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстСрез.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстСрез.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстСрез.Станция КАК Станция,
	|	ВТ_ВесьКонтекстСрез.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстСрез.УИД КАК УИД,
	|	ВТ_ВесьКонтекстСрез.ТипОперации КАК ТипОперации,
	|	ВТ_ВесьКонтекстСрез.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_ВесьКонтекстСрез.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстСрез.Приоритет КАК Приоритет,
	|	ВТ_ВесьКонтекстСрез.НомерСтрокиСреза КАК НомерСтрокиСреза,
	|	ВТ_ВесьКонтекстСрез.ДатаВыхода КАК ДатаВыхода,
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.Контейнер ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход > 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|					КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход < 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|	КОНЕЦ КАК Действие
	|ПОМЕСТИТЬ ВТ_КонецРасчета
	|ИЗ
	|	ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикой КАК ВТ_ТекущееМестоположениеСАналитикой
	|		ПО ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ТекущееМестоположениеСАналитикой.Контейнер
	|			И ВТ_ВесьКонтекстСрез.ДатаОперации = ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации
	|			И ВТ_ВесьКонтекстСрез.Терминал = ВТ_ТекущееМестоположениеСАналитикой.Терминал
	|			И (НЕ ВТ_ВесьКонтекстСрез.ДанныеИзБД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасчетРасхода.ПриходРасход,
	|	ВТ_РасчетРасхода.ДатаОперации,
	|	ВТ_РасчетРасхода.Контейнер,
	|	ВТ_РасчетРасхода.Терминал,
	|	ВТ_РасчетРасхода.Состояние,
	|	ВТ_РасчетРасхода.ДатаОбновленияИнформации,
	|	ВТ_РасчетРасхода.ТерминальнаяУслуга,
	|	ВТ_РасчетРасхода.ЛинияПодсток,
	|	ВТ_РасчетРасхода.НаличиеПодвреждения,
	|	ВТ_РасчетРасхода.ЗаявкаНаВыдачу,
	|	ВТ_РасчетРасхода.КомментарийТерминала,
	|	ВТ_РасчетРасхода.Контрагент,
	|	ВТ_РасчетРасхода.ЗаявкаНаСдачу,
	|	ВТ_РасчетРасхода.КомментарийСотрудника,
	|	ВТ_РасчетРасхода.ИсточникДобавленияДанных,
	|	ВТ_РасчетРасхода.ВидТранспортаУбытия,
	|	ВТ_РасчетРасхода.ФИОВодителя,
	|	ВТ_РасчетРасхода.НомерТранспорта,
	|	ВТ_РасчетРасхода.ОтветственныйЗаЗагрузку,
	|	ВТ_РасчетРасхода.Станция,
	|	ВТ_РасчетРасхода.ВидТранспорта,
	|	ВТ_РасчетРасхода.УИД,
	|	ВТ_РасчетРасхода.ТипОперации,
	|	ВТ_РасчетРасхода.ДанныеИзБД,
	|	ВТ_РасчетРасхода.НомерСтроки,
	|	ВТ_РасчетРасхода.Приоритет,
	|	ВТ_РасчетРасхода.НомерСтрокиСреза,
	|	ВТ_РасчетРасхода.ДатаВыхода,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетРасхода.ПриходРасход > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|		КОГДА ВТ_РасчетРасхода.ПриходРасход < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|	КОНЕЦ
	|ИЗ
	|	ВТ_РасчетРасхода КАК ВТ_РасчетРасхода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонецРасчета.ПриходРасход КАК ПриходРасход,
	|	ВТ_КонецРасчета.ДатаОперации КАК ДатаОперации,
	|	ВТ_КонецРасчета.Контейнер КАК Контейнер,
	|	ВТ_КонецРасчета.Терминал КАК Терминал,
	|	ВТ_КонецРасчета.Состояние КАК Состояние,
	|	ВТ_КонецРасчета.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_КонецРасчета.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_КонецРасчета.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_КонецРасчета.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_КонецРасчета.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_КонецРасчета.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_КонецРасчета.Контрагент КАК Контрагент,
	|	ВТ_КонецРасчета.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_КонецРасчета.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_КонецРасчета.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_КонецРасчета.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_КонецРасчета.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_КонецРасчета.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_КонецРасчета.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_КонецРасчета.Станция КАК Станция,
	|	ВТ_КонецРасчета.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_КонецРасчета.УИД КАК УИД,
	|	ВТ_КонецРасчета.ТипОперации КАК ТипОперации,
	|	ВТ_КонецРасчета.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_КонецРасчета.НомерСтроки КАК НомерСтроки,
	|	ВТ_КонецРасчета.Приоритет КАК Приоритет,
	|	ВТ_КонецРасчета.НомерСтрокиСреза КАК НомерСтрокиСреза,
	|	ВЫБОР
	|		КОГДА ВТ_КонецРасчета.ПриходРасход > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|		КОГДА ВТ_КонецРасчета.ПриходРасход < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|	КОНЕЦ КАК ДействиеРасчет,
	|	ВТ_КонецРасчета.ДатаВыхода КАК ДатаВыхода,
	|	ВТ_КонецРасчета.Действие КАК Действие
	|ИЗ
	|	ВТ_КонецРасчета КАК ВТ_КонецРасчета
	|ГДЕ
	|	НЕ ВТ_КонецРасчета.ДанныеИзБД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ПриходРасход";
КонецФункции

Функция ТекстЗапросаДанныхПереносаВЧистыйСток()
	Возврат 
	"ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации КАК ТипОперации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Состояние КАК Состояние,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЛинияПодсток КАК ЛинияПодсток,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийТерминала КАК КомментарийТерминала,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контрагент КАК Контрагент,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ФИОВодителя КАК ФИОВодителя,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.НомерТранспорта КАК НомерТранспорта,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Станция КАК Станция,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ВидТранспорта КАК ВидТранспорта,
	|	ЛОЖЬ КАК ДанныеИзБД,
	|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаВыхода КАК ДатаВыхода,
	|	ВЫБОР
	|		КОГДА ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|			ТОГДА 1
	|		КОГДА ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриходРасход
	|ПОМЕСТИТЬ ВТ_ДанныеИзИсточников
	|ИЗ
	|	&ДанныеИзИсточниковДляЧистогоСтока КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ТипОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ПарыКлючей
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеИзИсточников.Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеЧистыйСтокОстатки.Контейнер КАК Контейнер,
	|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
	|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК Количество,
	|	ИСТИНА КАК ДанныеИзБД,           
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
	//|	ЕСТЬNULL(ДанныеПоОперациямЧистыйСтокАктуальный.ДатаОперации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОперации
	|	МАКСИМУМ(ЕСТЬNULL(МестонахождениеЧистыйСток.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОперации
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
	|ПОМЕСТИТЬ ВТ_ТекущееМестоположение
	|ИЗ
	|	РегистрНакопления.МестонахождениеЧистыйСток.Остатки(
	|			,
	|			Контейнер В
	|				(ВЫБРАТЬ
	|					ВТ_ПарыКлючей.Контейнер КАК Контейнер
	|				ИЗ
	|					ВТ_ПарыКлючей КАК ВТ_ПарыКлючей)) КАК МестонахождениеЧистыйСтокОстатки  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСтокАктуальный КАК ДанныеПоОперациямЧистыйСтокАктуальный
	//|		ПО МестонахождениеЧистыйСтокОстатки.Контейнер = ДанныеПоОперациямЧистыйСтокАктуальный.Контейнер
	//|			И МестонахождениеЧистыйСтокОстатки.Терминал = ДанныеПоОперациямЧистыйСтокАктуальный.Терминал
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСток
	|		ПО (МестонахождениеЧистыйСток.Контейнер = МестонахождениеЧистыйСтокОстатки.Контейнер
	|			И МестонахождениеЧистыйСток.Терминал = МестонахождениеЧистыйСтокОстатки.Терминал)     
	|
	|СГРУППИРОВАТЬ ПО
	|	МестонахождениеЧистыйСтокОстатки.Контейнер,
	|	МестонахождениеЧистыйСтокОстатки.Терминал,
	|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположение.Терминал КАК Терминал,
	|	ВТ_ТекущееМестоположение.Контейнер КАК Контейнер,
	|	ВТ_ТекущееМестоположение.Количество КАК Количество,
	|	ВТ_ТекущееМестоположение.ДанныеИзБД КАК ДанныеИзБД,  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
	|ВЫБОР
	|	КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|		ТОГДА 2
	|	КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|		ТОГДА 1
	|	КОГДА ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|		ТОГДА 3
	|КОНЕЦ КАК Приоритет,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
	|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_ТекущееМестоположениеСАналитикой
	|ИЗ
	|	ВТ_ТекущееМестоположение КАК ВТ_ТекущееМестоположение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних(, ) КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
	|		ПО ВТ_ТекущееМестоположение.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
	|			И (НАЧАЛОПЕРИОДА(ВТ_ТекущееМестоположение.ДатаОперации, ЧАС) = НАЧАЛОПЕРИОДА(ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации, ЧАС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположениеСАналитикой.Контейнер КАК Контейнер,
	|	МАКСИМУМ(ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации) КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_Максимумы
	|ИЗ
	|	ВТ_ТекущееМестоположениеСАналитикой КАК ВТ_ТекущееМестоположениеСАналитикой
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекущееМестоположениеСАналитикой.Контейнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контейнер,
	|	ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположениеСАналитикой.Терминал КАК Терминал,
	|	ВТ_ТекущееМестоположениеСАналитикой.Контейнер КАК Контейнер,
	|	ВТ_ТекущееМестоположениеСАналитикой.Количество КАК Количество,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_ТекущееМестоположениеСАналитикой.Состояние КАК Состояние,    
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 13.08.2025
	|	ВТ_ТекущееМестоположениеСАналитикой.Приоритет КАК Приоритет, 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 13.08.2025
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ТекущееМестоположениеСАналитикой.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ТекущееМестоположениеСАналитикой.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ТекущееМестоположениеСАналитикой.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ТекущееМестоположениеСАналитикой.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ТекущееМестоположениеСАналитикой.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ТекущееМестоположениеСАналитикой.Станция КАК Станция,
	|	ВТ_ТекущееМестоположениеСАналитикой.Контрагент КАК Контрагент,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_ТекущееМестоположениеСАналитикойАкт
	|ИЗ
	|	ВТ_Максимумы КАК ВТ_Максимумы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикой КАК ВТ_ТекущееМестоположениеСАналитикой
	|		ПО ВТ_Максимумы.Контейнер = ВТ_ТекущееМестоположениеСАналитикой.Контейнер
	|			И ВТ_Максимумы.ДатаОперации = ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал,
	|	ВТ_ДанныеИзИсточников.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточников.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточников.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеИзИсточников.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеИзИсточников.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеИзИсточников.Контрагент КАК Контрагент,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточников.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточников.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеИзИсточников.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеИзИсточников.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточников.Станция КАК Станция,
	|	ВТ_ДанныеИзИсточников.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеИзИсточников.ТипОперации КАК ТипОперации,
	|	ВТ_ДанныеИзИсточников.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_ДанныеИзИсточников.Приоритет КАК Приоритет,
	|	ВТ_ДанныеИзИсточников.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_КонтекстРасчетаРасходаРучн
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТекущееМестоположениеСАналитикой.Контейнер,
	|	ВТ_ТекущееМестоположениеСАналитикой.Терминал,
	|	ВТ_ТекущееМестоположениеСАналитикой.Состояние,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОбновленияИнформации,
	|	ВТ_ТекущееМестоположениеСАналитикой.ТерминальнаяУслуга,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЛинияПодсток,
	|	ВТ_ТекущееМестоположениеСАналитикой.НаличиеПодвреждения,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаВыдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийТерминала,
	|	ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации,
	|	ВТ_ТекущееМестоположениеСАналитикой.Контрагент,
	|	ВТ_ТекущееМестоположениеСАналитикой.ЗаявкаНаСдачу,
	|	ВТ_ТекущееМестоположениеСАналитикой.КомментарийСотрудника,
	|	ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспортаУбытия,
	|	ВТ_ТекущееМестоположениеСАналитикой.ФИОВодителя,
	|	ВТ_ТекущееМестоположениеСАналитикой.НомерТранспорта,
	|	ВТ_ТекущееМестоположениеСАналитикой.ОтветственныйЗаЗагрузку,
	|	ВТ_ТекущееМестоположениеСАналитикой.Станция,
	|	ВТ_ТекущееМестоположениеСАналитикой.ВидТранспорта,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 22.08.2025
	//|	ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт), 
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.Количество < 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|	КОНЕЦ,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 22.08.2025
	|	ВТ_ТекущееМестоположениеСАналитикой.ДанныеИзБД,
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	ВТ_ТекущееМестоположениеСАналитикойАкт КАК ВТ_ТекущееМестоположениеСАналитикой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ВЫБОР
	|		КОГДА ВТ_КонтекстРасчетаРасходаРучн.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|			ТОГДА 1
	|		КОГДА ВТ_КонтекстРасчетаРасходаРучн.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриходРасход,
	|	ВТ_КонтекстРасчетаРасходаРучн.ДатаОперации КАК ДатаОперации,
	|	ВТ_КонтекстРасчетаРасходаРучн.Контейнер КАК Контейнер,
	|	ВТ_КонтекстРасчетаРасходаРучн.Терминал КАК Терминал,
	|	ВТ_КонтекстРасчетаРасходаРучн.Состояние КАК Состояние,
	|	ВТ_КонтекстРасчетаРасходаРучн.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_КонтекстРасчетаРасходаРучн.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_КонтекстРасчетаРасходаРучн.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_КонтекстРасчетаРасходаРучн.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_КонтекстРасчетаРасходаРучн.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_КонтекстРасчетаРасходаРучн.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_КонтекстРасчетаРасходаРучн.Контрагент КАК Контрагент,
	|	ВТ_КонтекстРасчетаРасходаРучн.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_КонтекстРасчетаРасходаРучн.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_КонтекстРасчетаРасходаРучн.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_КонтекстРасчетаРасходаРучн.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_КонтекстРасчетаРасходаРучн.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_КонтекстРасчетаРасходаРучн.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_КонтекстРасчетаРасходаРучн.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_КонтекстРасчетаРасходаРучн.Станция КАК Станция,
	|	ВТ_КонтекстРасчетаРасходаРучн.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_КонтекстРасчетаРасходаРучн.ТипОперации КАК ТипОперации,
	|	ВТ_КонтекстРасчетаРасходаРучн.ДанныеИзБД КАК ДанныеИзБД,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	|	ВТ_КонтекстРасчетаРасходаРучн.Приоритет КАК Приоритет,
	|	ВТ_КонтекстРасчетаРасходаРучн.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ВесьКонтекстРасчетаРасходаРучн
	|ИЗ
	|	ВТ_КонтекстРасчетаРасходаРучн КАК ВТ_КонтекстРасчетаРасходаРучн
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ПриходРасход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ВТ_ВесьКонтекстЧС.ПриходРасход КАК ПриходРасход,
	|	ВТ_ВесьКонтекстЧС.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстЧС.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстЧС.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстЧС.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстЧС.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстЧС.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстЧС.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстЧС.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстЧС.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстЧС.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстЧС.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстЧС.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстЧС.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстЧС.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстЧС.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстЧС.Станция КАК Станция,
	|	ВТ_ВесьКонтекстЧС.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстЧС.ТипОперации КАК ТипОперации,
	|	МАКСИМУМ(ВТ_ВесьКонтекстЧС.ДанныеИзБД) КАК ДанныеИзБД,
	|	ВТ_ВесьКонтекстЧС.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстЧС.Приоритет КАК Приоритет,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтрокиСреза,
	|	ВТ_ВесьКонтекстЧС.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_ВесьКонтекстСрез
	|ИЗ
	|	ВТ_ВесьКонтекстРасчетаРасходаРучн КАК ВТ_ВесьКонтекстЧС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВесьКонтекстЧС.ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстЧС.КомментарийСотрудника,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстЧС.Контрагент,
	|	ВТ_ВесьКонтекстЧС.КомментарийТерминала,
	|	ВТ_ВесьКонтекстЧС.ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстЧС.НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстЧС.ЛинияПодсток,
	|	ВТ_ВесьКонтекстЧС.ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстЧС.ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстЧС.Состояние,
	|	ВТ_ВесьКонтекстЧС.Терминал,
	|	ВТ_ВесьКонтекстЧС.Контейнер,
	|	ВТ_ВесьКонтекстЧС.ДатаОперации,
	|	ВТ_ВесьКонтекстЧС.ДатаВыхода,
	|	ВТ_ВесьКонтекстЧС.ТипОперации,
	|	ВТ_ВесьКонтекстЧС.ВидТранспорта,
	|	ВТ_ВесьКонтекстЧС.ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстЧС.Станция,
	|	ВТ_ВесьКонтекстЧС.ФИОВодителя,
	|	ВТ_ВесьКонтекстЧС.НомерТранспорта,
	|	ВТ_ВесьКонтекстЧС.ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстЧС.ПриходРасход,
	|	ВТ_ВесьКонтекстЧС.НомерСтроки,
	|	ВТ_ВесьКонтекстЧС.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	ДатаВыхода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-1 КАК ПриходРасход,
	|	ВЫБОР
	|		КОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВесьКонтекстСрез.ДатаОперации, ДЕНЬ, 1)
	|	КОНЕЦ КАК ДатаОперации,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТ_ВесьКонтекстСрез.ДатаВыхода
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВесьКонтекстСрез.ДатаОперации, ДЕНЬ, 1)
	|		КОНЕЦ, ДЕНЬ) КАК ДатаОперацииСвязьРасхода,
	|	ВТ_ВесьКонтекстСрез.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстСрез.Терминал КАК Терминал,
	|	ВТ_ВесьКонтекстСрез.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстСрез.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстСрез.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстСрез.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстСрез.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстСрез.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстСрез.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстСрез.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстСрез.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстСрез.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстСрез.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстСрез.Станция КАК Станция,
	|	ВТ_ВесьКонтекстСрез.ВидТранспорта КАК ВидТранспорта,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта) КАК ТипОперации,
	|	ЛОЖЬ КАК ДанныеИзБД, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025  
	|	ВТ_ВесьКонтекстСрез.ДатаОперации КАК ДатаОперацииПредыдущегоЗавоза,
	|	Истина КАК Авторасход,
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ВТ_ВесьКонтекстСрез.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстСрез.Приоритет КАК Приоритет,
	|	ВТ_ВесьКонтекстСрез.НомерСтрокиСреза КАК НомерСтрокиСреза,
	|	ВТ_ВесьКонтекстСрез.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_РасчетРасхода
	|ИЗ
	|	ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез_ПрошлаяСтрока
	|		ПО (ВТ_ВесьКонтекстСрез.НомерСтрокиСреза = ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.НомерСтрокиСреза - 1)
	|ГДЕ
	|	ВТ_ВесьКонтекстСрез.ПриходРасход = 1
	|	И ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.ПриходРасход = 1
	|	И ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.Контейнер
	|	И ВТ_ВесьКонтекстСрез.Терминал <> ВТ_ВесьКонтекстСрез_ПрошлаяСтрока.Терминал  
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025  
	//Если из других источников есть расходная строка, то убираем авторасходную строку
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.ПриходРасход КАК ПриходРасход,
	|	МАКСИМУМ(ВТ_РасчетРасхода.ДатаОперации) КАК ДатаОперации,
	|	ВТ_РасчетРасхода.Контейнер КАК Контейнер,
	|	ВТ_РасчетРасхода.Терминал КАК Терминал,
	|	ВТ_РасчетРасхода.Состояние КАК Состояние,
	|	ВТ_РасчетРасхода.ТипОперации КАК ТипОперации
	|ПОМЕСТИТЬ ВТ_УдалитьСтрокиАвторасхода
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасчетРасхода КАК ВТ_РасчетРасхода
	|		ПО (ВТ_ДанныеИзИсточников.Контейнер = ВТ_РасчетРасхода.Контейнер)
	|			И (ВТ_ДанныеИзИсточников.Терминал = ВТ_РасчетРасхода.Терминал)
	|			И (ВТ_ДанныеИзИсточников.Состояние = ВТ_РасчетРасхода.Состояние)
	|			И (ВТ_ДанныеИзИсточников.ТипОперации = ВТ_РасчетРасхода.ТипОперации)
	|			И (ВТ_ДанныеИзИсточников.ДатаОперации > ВТ_РасчетРасхода.ДатаОперацииПредыдущегоЗавоза)
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ПриходРасход = -1
	|	И ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
    |
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеИзИсточников.ПриходРасход,
	|	ВТ_ДанныеИзИсточников.ДатаОперации,
	|	ВТ_РасчетРасхода.Контейнер,
	|	ВТ_РасчетРасхода.Терминал,
	|	ВТ_РасчетРасхода.Состояние,
	|	ВТ_РасчетРасхода.ТипОперации
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|;
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 12.08.2025
	//Если по таблице ВТ_ТекущееМестоположениеСАналитикойАкт нет оборота, но расход или приход по дате операции есть, 
	//то не дублируем запись в местонахождение ЧС, а обновляем имеющуюся - выбираем строки для обогащения
	|ВЫБРАТЬ Различные
	|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал,
	|	ВТ_ДанныеИзИсточников.ТипОперации КАК ТипОперации, 
	|	ВЫБОР
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	|	ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ДанныеПоОперациямЧистыйСток.ДатаОперации КАК ДатаОперации,
	|	ДанныеПоОперациямЧистыйСток.Состояние КАК Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОперации КАК ДатаОперацииИсточника,
	|	ДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ДанныеПоОперациямЧистыйСток.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ДанныеПоОперациямЧистыйСток.ЛинияПодсток КАК ЛинияПодсток,
	|	ДанныеПоОперациямЧистыйСток.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ДанныеПоОперациямЧистыйСток.КомментарийТерминала КАК КомментарийТерминала,
	|	ДанныеПоОперациямЧистыйСток.Контрагент КАК Контрагент,
	|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ДанныеПоОперациямЧистыйСток.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ДанныеПоОперациямЧистыйСток.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ДанныеПоОперациямЧистыйСток.ФИОВодителя КАК ФИОВодителя,
	|	ДанныеПоОперациямЧистыйСток.НомерТранспорта КАК НомерТранспорта,
	|	ДанныеПоОперациямЧистыйСток.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ДанныеПоОперациямЧистыйСток.Станция КАК Станция,
	|	ДанныеПоОперациямЧистыйСток.ВидТранспорта КАК ВидТранспорта
	|ПОМЕСТИТЬ ВТ_ПоискПриходаРасходаВМестонахождении
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
	|				,
	|				,
	|				Запись,
	|				(Контейнер, Терминал) В
	|					(ВЫБРАТЬ
	|						Т.Контейнер,
	|						Т.Терминал
	|					ИЗ
	|						ВТ_ДанныеИзИсточников КАК Т)) КАК МестонахождениеЧистыйСтокОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
	|			ПО (ДанныеПоОперациямЧистыйСток.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер)
	|				И (ДанныеПоОперациямЧистыйСток.ДатаОперации = МестонахождениеЧистыйСтокОбороты.Период)
	|				И (МестонахождениеЧистыйСтокОбороты.КоличествоРасход > 0)
	|		ПО ВТ_ДанныеИзИсточников.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер
	|			И ВТ_ДанныеИзИсточников.Терминал = МестонахождениеЧистыйСтокОбороты.Терминал
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|	и ВТ_ДанныеИзИсточников.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ДанныеПоОперациямЧистыйСток.ДатаОперации, ЧАС, -1) и ДОБАВИТЬКДАТЕ(ДанныеПоОперациямЧистыйСток.ДатаОперации, ЧАС,1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеИзИсточников.Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал,
	|	ВТ_ДанныеИзИсточников.ТипОперации,
	|	ВЫБОР
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ,
	|	ДанныеПоОперациямЧистыйСток.ИсточникДобавленияДанных,
	|	ДанныеПоОперациямЧистыйСток.ДатаОперации,
	|	ДанныеПоОперациямЧистыйСток.Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОперации,
	|	ДанныеПоОперациямЧистыйСток.ДатаОбновленияИнформации,
	|	ДанныеПоОперациямЧистыйСток.ТерминальнаяУслуга,
	|	ДанныеПоОперациямЧистыйСток.ЛинияПодсток,
	|	ДанныеПоОперациямЧистыйСток.НаличиеПодвреждения,
	|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаВыдачу,
	|	ДанныеПоОперациямЧистыйСток.КомментарийТерминала,
	|	ДанныеПоОперациямЧистыйСток.Контрагент,
	|	ДанныеПоОперациямЧистыйСток.ЗаявкаНаСдачу,
	|	ДанныеПоОперациямЧистыйСток.КомментарийСотрудника,
	|	ДанныеПоОперациямЧистыйСток.ВидТранспортаУбытия,
	|	ДанныеПоОперациямЧистыйСток.ФИОВодителя,
	|	ДанныеПоОперациямЧистыйСток.НомерТранспорта,
	|	ДанныеПоОперациямЧистыйСток.ОтветственныйЗаЗагрузку,
	|	ДанныеПоОперациямЧистыйСток.Станция,
	|	ДанныеПоОперациямЧистыйСток.ВидТранспорта
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
	|				,
	|				,
	|				Запись,
	|				(Контейнер, Терминал) В
	|					(ВЫБРАТЬ
	|						Т.Контейнер,
	|						Т.Терминал
	|					ИЗ
	|						ВТ_ДанныеИзИсточников КАК Т)) КАК МестонахождениеЧистыйСтокОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
	|			ПО (ДанныеПоОперациямЧистыйСток.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер
	|					И ДанныеПоОперациямЧистыйСток.ДатаОперации = МестонахождениеЧистыйСтокОбороты.Период
	|					И МестонахождениеЧистыйСтокОбороты.КоличествоПриход > 0)
	|		ПО (ВТ_ДанныеИзИсточников.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер)
	|			И (ВТ_ДанныеИзИсточников.Терминал = МестонахождениеЧистыйСтокОбороты.Терминал)
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|	И ВТ_ДанныеИзИсточников.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ДанныеПоОперациямЧистыйСток.ДатаОперации, ЧАС, -1) И ДОБАВИТЬКДАТЕ(ДанныеПоОперациямЧистыйСток.ДатаОперации, ЧАС, 1)
	|;
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВесьКонтекстСрез.ДатаОперации КАК ДатаОперации,
	|	ВТ_ВесьКонтекстСрез.ДатаОперации КАК ДатаОперацииСвязьРасхода,
	|	ВТ_ВесьКонтекстСрез.Контейнер КАК Контейнер,
	|	ВТ_ВесьКонтекстСрез.Терминал КАК Терминал,
	|	ВЫБОР
	|		КОГДА ВТ_ТекущееМестоположениеСАналитикой.Контейнер ЕСТЬ NULL
	|			ТОГДА ВТ_ВесьКонтекстСрез.ПриходРасход
	|		ИНАЧЕ ВТ_ВесьКонтекстСрез.ПриходРасход
	|	КОНЕЦ КАК ПриходРасход,
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	//|	ВЫБОР
	//|		КОГДА ВТ_ВесьКонтекстСрез.ДанныеИзБД
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ВТ_ТекущееМестоположениеСАналитикой.Контейнер ЕСТЬ NULL
	//|					ТОГДА ВЫБОР
	//|							КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход > 0
	//|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	//|							КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход < 0
	//|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	//|						КОНЕЦ
	//|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Действие,
	|	ВЫБОР
	|		КОГДА ВТ_ВесьКонтекстСрез.ДанныеИзБД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ТекущееМестоположениеСАналитикой.Контейнер ЕСТЬ NULL
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход > 0
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_ВесьКонтекстСрез.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|											ТОГДА ВЫБОР
	|													КОГДА ВТ_ТекущееМестоположение.Контейнер ЕСТЬ NULL
	|														ТОГДА ВЫБОР
	|																КОГДА ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер ЕСТЬ NULL
	|																	ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|																ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|															КОНЕЦ
	|													ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|												КОНЕЦ
	|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|									КОНЕЦ
	|							КОГДА ВТ_ВесьКонтекстСрез.ПриходРасход < 0
	|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|						КОНЕЦ
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|			КОНЕЦ
	|	КОНЕЦ КАК Действие,
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	|	ВТ_ВесьКонтекстСрез.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ВесьКонтекстСрез.Состояние КАК Состояние,
	|	ВТ_ВесьКонтекстСрез.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ВесьКонтекстСрез.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ВесьКонтекстСрез.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ВесьКонтекстСрез.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ВесьКонтекстСрез.Контрагент КАК Контрагент,
	|	ВТ_ВесьКонтекстСрез.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ВесьКонтекстСрез.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ВесьКонтекстСрез.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ВесьКонтекстСрез.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ВесьКонтекстСрез.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ВесьКонтекстСрез.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ВесьКонтекстСрез.Станция КАК Станция,
	|	ВТ_ВесьКонтекстСрез.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ВесьКонтекстСрез.ТипОперации КАК ТипОперации,
	|	ВТ_ВесьКонтекстСрез.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_ВесьКонтекстСрез.НомерСтроки КАК НомерСтроки,
	|	ВТ_ВесьКонтекстСрез.Приоритет КАК Приоритет,
	|	ВТ_ВесьКонтекстСрез.НомерСтрокиСреза КАК НомерСтрокиСреза,  
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	Ложь КАК Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ВТ_ВесьКонтекстСрез.ДатаВыхода КАК ДатаВыхода
	|ПОМЕСТИТЬ ВТ_КонецРасчета
	|ИЗ
	|	ВТ_ВесьКонтекстСрез КАК ВТ_ВесьКонтекстСрез
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикойАкт КАК ВТ_ТекущееМестоположениеСАналитикой
	|		ПО ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ТекущееМестоположениеСАналитикой.Контейнер
	|			И (НАЧАЛОПЕРИОДА(ВТ_ВесьКонтекстСрез.ДатаОперации, ЧАС) = НАЧАЛОПЕРИОДА(ВТ_ТекущееМестоположениеСАналитикой.ДатаОперации, ЧАС))
	|			И ВТ_ВесьКонтекстСрез.Терминал = ВТ_ТекущееМестоположениеСАналитикой.Терминал
	|			И (НЕ ВТ_ВесьКонтекстСрез.ДанныеИзБД)
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикой КАК ВТ_ТекущееМестоположение
	|		ПО ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ТекущееМестоположение.Контейнер
	|			И (НАЧАЛОПЕРИОДА(ВТ_ВесьКонтекстСрез.ДатаОперации, ЧАС) = НАЧАЛОПЕРИОДА(ВТ_ТекущееМестоположение.ДатаОперации, ЧАС))
	|			И ВТ_ВесьКонтекстСрез.Терминал = ВТ_ТекущееМестоположение.Терминал
	|			И (НЕ ВТ_ВесьКонтекстСрез.ДанныеИзБД)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоискПриходаРасходаВМестонахождении КАК ВТ_ПоискПриходаРасходаВМестонахождении
	|		ПО ВТ_ВесьКонтекстСрез.Контейнер = ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер
	|			И ВТ_ВесьКонтекстСрез.Терминал = ВТ_ПоискПриходаРасходаВМестонахождении.Терминал
	|			И ВТ_ВесьКонтекстСрез.Состояние = ВТ_ПоискПриходаРасходаВМестонахождении.Состояние
	|			И ВТ_ВесьКонтекстСрез.ДатаОперации = ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперацииИсточника
	//Евросиб Шевченко А.В. US 128213 ТА 131297 25.02.2026
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасчетРасхода.ДатаОперации,
	|	ВТ_РасчетРасхода.ДатаОперацииСвязьРасхода,
	|	ВТ_РасчетРасхода.Контейнер,
	|	ВТ_РасчетРасхода.Терминал,
	|	ВТ_РасчетРасхода.ПриходРасход,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетРасхода.ПриходРасход > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|		КОГДА ВТ_РасчетРасхода.ПриходРасход < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|	КОНЕЦ,
	|	ВТ_РасчетРасхода.ИсточникДобавленияДанных,
	|	ВТ_РасчетРасхода.Состояние,
	|	ВТ_РасчетРасхода.ДатаОбновленияИнформации,
	|	ВТ_РасчетРасхода.ТерминальнаяУслуга,
	|	ВТ_РасчетРасхода.ЛинияПодсток,
	|	ВТ_РасчетРасхода.НаличиеПодвреждения,
	|	ВТ_РасчетРасхода.ЗаявкаНаВыдачу,
	|	ВТ_РасчетРасхода.КомментарийТерминала,
	|	ВТ_РасчетРасхода.Контрагент,
	|	ВТ_РасчетРасхода.ЗаявкаНаСдачу,
	|	ВТ_РасчетРасхода.КомментарийСотрудника,
	|	ВТ_РасчетРасхода.ВидТранспортаУбытия,
	|	ВТ_РасчетРасхода.ФИОВодителя,
	|	ВТ_РасчетРасхода.НомерТранспорта,
	|	ВТ_РасчетРасхода.ОтветственныйЗаЗагрузку,
	|	ВТ_РасчетРасхода.Станция,
	|	ВТ_РасчетРасхода.ВидТранспорта,
	|	ВТ_РасчетРасхода.ТипОперации,
	|	ВТ_РасчетРасхода.ДанныеИзБД,
	|	ВТ_РасчетРасхода.НомерСтроки,
	|	ВТ_РасчетРасхода.Приоритет,
	|	ВТ_РасчетРасхода.НомерСтрокиСреза,  
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	ВТ_РасчетРасхода.Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ВТ_РасчетРасхода.ДатаВыхода
	|ИЗ
	|	ВТ_РасчетРасхода КАК ВТ_РасчетРасхода   
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УдалитьСтрокиАвторасхода КАК ВТ_УдалитьСтрокиАвторасхода
	|		ПО (ВТ_РасчетРасхода.ДатаОперации = ВТ_УдалитьСтрокиАвторасхода.ДатаОперации
	|				И ВТ_РасчетРасхода.Контейнер = ВТ_УдалитьСтрокиАвторасхода.Контейнер
	|				И ВТ_РасчетРасхода.Терминал = ВТ_УдалитьСтрокиАвторасхода.Терминал
	|				И ВТ_РасчетРасхода.ТипОперации = ВТ_УдалитьСтрокиАвторасхода.ТипОперации
	|				И ВТ_РасчетРасхода.Состояние = ВТ_УдалитьСтрокиАвторасхода.Состояние)
	|ГДЕ
	|	ВТ_УдалитьСтрокиАвторасхода.Контейнер ЕСТЬ NULL
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|;
	| 
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 12.08.2025
	|ВЫБРАТЬ
	|	ВТ_КонецРасчета.ПриходРасход КАК ПриходРасход,
	|	ВТ_КонецРасчета.ДатаОперации КАК ДатаОперации,
	|	ВТ_КонецРасчета.Контейнер КАК Контейнер,
	|	ВТ_КонецРасчета.Терминал КАК Терминал,
	|	ВТ_КонецРасчета.Приоритет КАК Приоритет,
	|	ВТ_КонецРасчета.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_КонецРасчета.Состояние КАК Состояние,
	|	ВТ_КонецРасчета.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_КонецРасчета.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_КонецРасчета.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_КонецРасчета.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_КонецРасчета.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_КонецРасчета.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_КонецРасчета.Контрагент КАК Контрагент,
	|	ВТ_КонецРасчета.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_КонецРасчета.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_КонецРасчета.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_КонецРасчета.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_КонецРасчета.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_КонецРасчета.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_КонецРасчета.Станция КАК Станция,
	|	ВТ_КонецРасчета.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_КонецРасчета.ТипОперации КАК ТипОперации,
	|	ВТ_КонецРасчета.ДанныеИзБД КАК ДанныеИзБД,
	|	ВЫБОР
	|		КОГДА ВТ_КонецРасчета.ПриходРасход > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|		КОГДА ВТ_КонецРасчета.ПриходРасход < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|	КОНЕЦ КАК ДействиеРасчет,
	|	ВТ_КонецРасчета.ДатаВыхода КАК ДатаВыхода,
	|	ВТ_КонецРасчета.Действие КАК Действие,  
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	ВТ_КонецРасчета.Авторасход КАК Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	НАЧАЛОПЕРИОДА(ВТ_КонецРасчета.ДатаОперацииСвязьРасхода, ЧАС) КАК ДатаОперацииСвязьРасхода
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	|	, ДОБАВИТЬКДАТЕ(ВТ_КонецРасчета.ДатаОперацииСвязьРасхода, ЧАС, -1) КАК ДатаОперацииСвязьРасходаНачало,
	|	ДОБАВИТЬКДАТЕ(ВТ_КонецРасчета.ДатаОперацииСвязьРасхода, ЧАС, 1) КАК ДатаОперацииСвязьРасходаКонец
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|ПОМЕСТИТЬ ВТ_ДанныеКОбогащению
	|ИЗ
	|	ВТ_КонецРасчета КАК ВТ_КонецРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.ПриходРасход,
	|	ВТ_ДанныеИзИсточников.ДатаОперации,
	|	ВТ_ДанныеИзИсточников.Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал,
	|	ВТ_ДанныеИзИсточников.Приоритет,
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточников.Состояние,
	|	ВТ_ДанныеИзИсточников.ДатаОбновленияИнформации,
	|	ВТ_ДанныеИзИсточников.ТерминальнаяУслуга,
	|	ВТ_ДанныеИзИсточников.ЛинияПодсток,
	|	ВТ_ДанныеИзИсточников.НаличиеПодвреждения,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаВыдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийТерминала,
	|	ВТ_ДанныеИзИсточников.Контрагент,
	|	ВТ_ДанныеИзИсточников.ЗаявкаНаСдачу,
	|	ВТ_ДанныеИзИсточников.КомментарийСотрудника,
	|	ВТ_ДанныеИзИсточников.ВидТранспортаУбытия,
	|	ВТ_ДанныеИзИсточников.ФИОВодителя,
	|	ВТ_ДанныеИзИсточников.НомерТранспорта,
	|	ВТ_ДанныеИзИсточников.ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеИзИсточников.Станция,
	|	ВТ_ДанныеИзИсточников.ВидТранспорта,
	|	ВТ_ДанныеИзИсточников.ТипОперации,
	|	ВТ_ДанныеИзИсточников.ДанныеИзБД, 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 12.08.2025
	|	ВЫБОР
	|		КОГДА (ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер ЕСТЬ NULL
	|				И ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт))
	|			ИЛИ (ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер ЕСТЬ NULL 
	|				И ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта))
	|		ТОГДА
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 12.08.2025
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеИзИсточников.ПриходРасход > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|		КОГДА ВТ_ДанныеИзИсточников.ПриходРасход < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 12.08.2025
	|		КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 12.08.2025
	|	КОНЕЦ,
	|	ВТ_ДанныеИзИсточников.ДатаВыхода,
	|	ВЫБОР  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 12.08.2025
	//|		КОГДА ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер ЕСТЬ NULL
	|		КОГДА (ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер ЕСТЬ NULL
	|				И ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт))
	|			ИЛИ (ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер ЕСТЬ NULL 
	|				И ВТ_ДанныеИзИсточников.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта))				
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 12.08.2025
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ДанныеИзИсточников.ПриходРасход > 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Перенести)
	|					КОГДА ВТ_ДанныеИзИсточников.ПриходРасход < 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить)
	|				КОНЕЦ  
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление)
	|	КОНЕЦ,              
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	Ложь, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	НАЧАЛОПЕРИОДА(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	|	, ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, -1),
	|	ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, 1)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикойАкт КАК ВТ_ТекущееМестоположениеСАналитикойАкт
	|		ПО ВТ_ДанныеИзИсточников.Контейнер = ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер
	|			И ВТ_ДанныеИзИсточников.Терминал = ВТ_ТекущееМестоположениеСАналитикойАкт.Терминал
	//|			И (НАЧАЛОПЕРИОДА(ВТ_ДанныеИзИсточников.ДатаОперации, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_ТекущееМестоположениеСАналитикойАкт.ДатаОперации, ЧАС))
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 11.08.2025
	|			И (ВТ_ТекущееМестоположениеСАналитикойАкт.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, -1) и ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, 1))
	|           И (ВТ_ТекущееМестоположениеСАналитикойАкт.Состояние = ВТ_ДанныеИзИсточников.Состояние)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоискПриходаРасходаВМестонахождении КАК ВТ_ПоискПриходаРасходаВМестонахождении
	|		ПО (ВТ_ДанныеИзИсточников.Контейнер = ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер
	|			И ВТ_ДанныеИзИсточников.Терминал = ВТ_ПоискПриходаРасходаВМестонахождении.Терминал
	|			И ВТ_ДанныеИзИсточников.Состояние = ВТ_ПоискПриходаРасходаВМестонахождении.Состояние
	|			И ВТ_ДанныеИзИсточников.ДатаОперации = ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперацииИсточника)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 11.08.2025
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка) 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 12.08.2025
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзИсточников.ПриходРасход,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперации,
	|	ВТ_ДанныеИзИсточников.Контейнер,
	|	ВТ_ДанныеИзИсточников.Терминал,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.Приоритет,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ИсточникДобавленияДанных,
	|	ВТ_ДанныеИзИсточников.Состояние,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОбновленияИнформации,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ТерминальнаяУслуга,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ЛинияПодсток,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.НаличиеПодвреждения,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ЗаявкаНаВыдачу,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.КомментарийТерминала,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.Контрагент,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ЗаявкаНаСдачу,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.КомментарийСотрудника,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ВидТранспортаУбытия,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ФИОВодителя,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.НомерТранспорта,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ОтветственныйЗаЗагрузку,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.Станция,
	|	ВТ_ПоискПриходаРасходаВМестонахождении.ВидТранспорта,
	|	ВТ_ДанныеИзИсточников.ТипОперации,
	|	Истина,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.НеПереносить),
	|	ВТ_ДанныеИзИсточников.ДатаВыхода,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Обновление),
	|	ЛОЖЬ,
	|	НАЧАЛОПЕРИОДА(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС), 
	|	ДОБАВИТЬКДАТЕ(ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперации, ЧАС, -1),
	|	ДОБАВИТЬКДАТЕ(ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперации, ЧАС, 1)
	|ИЗ
	|	ВТ_ДанныеИзИсточников КАК ВТ_ДанныеИзИсточников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущееМестоположениеСАналитикойАкт КАК ВТ_ТекущееМестоположениеСАналитикойАкт
	|		ПО ВТ_ДанныеИзИсточников.Контейнер = ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер
	|			И ВТ_ДанныеИзИсточников.Терминал = ВТ_ТекущееМестоположениеСАналитикойАкт.Терминал
	|			И (ВТ_ТекущееМестоположениеСАналитикойАкт.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, -1) и ДОБАВИТЬКДАТЕ(ВТ_ДанныеИзИсточников.ДатаОперации, ЧАС, 1))
	|			И (ВТ_ТекущееМестоположениеСАналитикойАкт.Состояние = ВТ_ДанныеИзИсточников.Состояние)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоискПриходаРасходаВМестонахождении КАК ВТ_ПоискПриходаРасходаВМестонахождении
	|		ПО ВТ_ДанныеИзИсточников.Контейнер = ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер
	|			И ВТ_ДанныеИзИсточников.Терминал = ВТ_ПоискПриходаРасходаВМестонахождении.Терминал
	|			И ВТ_ДанныеИзИсточников.Состояние = ВТ_ПоискПриходаРасходаВМестонахождении.Состояние
	|			И ВТ_ДанныеИзИсточников.ДатаОперации = ВТ_ПоискПриходаРасходаВМестонахождении.ДатаОперацииИсточника
	|ГДЕ
	|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|	И НЕ ВТ_ПоискПриходаРасходаВМестонахождении.Контейнер ЕСТЬ NULL
	|	и ВТ_ТекущееМестоположениеСАналитикойАкт.Контейнер Есть NULL
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 12.08.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1410065407
	|	ВТ_ДанныеКОбогащению.ПриходРасход КАК ПриходРасход,
	|	ВТ_ДанныеКОбогащению.ДатаОперации КАК ДатаОперации,
	|	ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода,
	|	ВТ_ДанныеКОбогащению.Контейнер КАК Контейнер,
	|	ВТ_ДанныеКОбогащению.Терминал КАК Терминал,
	|	ВТ_ДанныеКОбогащению.Приоритет КАК Приоритет,
	|	ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_ДанныеКОбогащению.Состояние КАК Состояние,
	|	ВТ_ДанныеКОбогащению.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_ДанныеКОбогащению.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_ДанныеКОбогащению.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_ДанныеКОбогащению.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_ДанныеКОбогащению.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_ДанныеКОбогащению.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_ДанныеКОбогащению.Контрагент КАК Контрагент,
	|	ВТ_ДанныеКОбогащению.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_ДанныеКОбогащению.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_ДанныеКОбогащению.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_ДанныеКОбогащению.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ДанныеКОбогащению.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ДанныеКОбогащению.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_ДанныеКОбогащению.Станция КАК Станция,
	|	ВТ_ДанныеКОбогащению.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ДанныеКОбогащению.ТипОперации КАК ТипОперации,
	|	ВТ_ДанныеКОбогащению.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_ДанныеКОбогащению.ДействиеРасчет КАК ДействиеРасчет,
	|	ВТ_ДанныеКОбогащению.ДатаВыхода КАК ДатаВыхода,  
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	ВТ_ДанныеКОбогащению.Авторасход КАК Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ВТ_ДанныеКОбогащению.Действие КАК Действие
	|ПОМЕСТИТЬ ВТ_НачалоОбогащения
	|ИЗ
	|	ВТ_ДанныеКОбогащению КАК ВТ_ДанныеКОбогащению
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер,
	|	ДатаОперации,
	|	Приоритет УБЫВ,
	|	ПриходРасход УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	//Было:
	//|ВЫБРАТЬ
	//|	ВТ_НачалоОбогащения.ПриходРасход КАК ПриходРасход,
	//|	ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода,
	//|	ВТ_НачалоОбогащения.Контейнер КАК Контейнер,
	//|	ВТ_НачалоОбогащения.Терминал КАК Терминал,
	//|	МИНИМУМ(ВТ_НачалоОбогащения.Приоритет) КАК Приоритет,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_НачалоОбогащения.ИсточникДобавленияДанных) КАК ИсточникДобавленияДанных,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_НачалоОбогащения.ДатаОперации) КАК ДатаОперации
	//|ПОМЕСТИТЬ ВТ_ОбогащаемыеСтроки
	//|ИЗ
	//|	ВТ_НачалоОбогащения КАК ВТ_НачалоОбогащения
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_НачалоОбогащения.ПриходРасход,
	//|	ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода,
	//|	ВТ_НачалоОбогащения.Контейнер,
	//|	ВТ_НачалоОбогащения.Терминал
	//Стало:
	|ВЫБРАТЬ
	|	ВТ_ДанныеКОбогащению.ПриходРасход КАК ПриходРасход,
	|	ВТ_ДанныеКОбогащению.ДатаОперации КАК ДатаОперации,    
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеКОбогащению.ДанныеИзБД
	|			ТОГДА ВТ_ДанныеКОбогащению.ДатаОперации
	|		ИНАЧЕ ВТ_ДанныеКОбогащениюНовые.ДатаОперации
	|	КОНЕЦ КАК ДатаОперацииПервичная,
	|	ВТ_ДанныеКОбогащению.Контейнер КАК Контейнер,
	|	ВТ_ДанныеКОбогащению.Терминал КАК Терминал,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	|	ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,  
	|	ВТ_ДанныеКОбогащению.ДанныеИзБД,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ДанныеКОбогащению.ДатаОперации, СЕКУНДА, РАЗНОСТЬДАТ(ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаНачало, ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало, СЕКУНДА) / 2), МИНУТА) КАК Дата
	|ПОМЕСТИТЬ ВТ_ВычислениеСтрокКОбогащению
	|ИЗ
	|	ВТ_ДанныеКОбогащению КАК ВТ_ДанныеКОбогащению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеКОбогащению КАК ВТ_ДанныеКОбогащениюНовые
	|		ПО ВТ_ДанныеКОбогащению.Терминал = ВТ_ДанныеКОбогащениюНовые.Терминал
	|			И ВТ_ДанныеКОбогащению.Контейнер = ВТ_ДанныеКОбогащениюНовые.Контейнер
	|			И ВТ_ДанныеКОбогащению.ДатаОперации <> ВТ_ДанныеКОбогащениюНовые.ДатаОперации
	|			И ВТ_ДанныеКОбогащению.Состояние = ВТ_ДанныеКОбогащениюНовые.Состояние
	|			И ВТ_ДанныеКОбогащению.ПриходРасход = ВТ_ДанныеКОбогащениюНовые.ПриходРасход
	|			И (ВТ_ДанныеКОбогащению.ДатаОбновленияИнформации < ВТ_ДанныеКОбогащениюНовые.ДатаОбновленияИнформации
	|					И ВТ_ДанныеКОбогащению.ДанныеИзБД
	|					И (ВТ_ДанныеКОбогащению.ДатаОперации МЕЖДУ ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало И ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаКонец)
	|				ИЛИ ВТ_ДанныеКОбогащению.ДатаОбновленияИнформации >= ВТ_ДанныеКОбогащениюНовые.ДатаОбновленияИнформации
	|					И НЕ ВТ_ДанныеКОбогащению.ДанныеИзБД
	|					И (ВТ_ДанныеКОбогащению.ДатаОперации МЕЖДУ ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало И ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаКонец))
	|ГДЕ
	|	ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало <> ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаНачало
	|	И ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаКонец <> ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаКонец
	|	И ВТ_ДанныеКОбогащениюНовые.ИсточникДобавленияДанных <> ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеКОбогащению.ПриходРасход,
	|	ВТ_ДанныеКОбогащению.ДатаОперации,
	|		ВЫБОР
	|		КОГДА ВТ_ДанныеКОбогащению.ДанныеИзБД
	|			ТОГДА ВТ_ДанныеКОбогащению.ДатаОперации
	|		ИНАЧЕ ВТ_ДанныеКОбогащениюНовые.ДатаОперации
	|	КОНЕЦ,
	|	ВТ_ДанныеКОбогащению.Контейнер,
	|	ВТ_ДанныеКОбогащению.Терминал,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ,
	|	ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных,
	|	ВТ_ДанныеКОбогащению.ДанныеИзБД,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ДанныеКОбогащению.ДатаОперации, СЕКУНДА, РАЗНОСТЬДАТ(ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаНачало, ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало, СЕКУНДА) / 2), МИНУТА)
	|ИЗ
	|	ВТ_ДанныеКОбогащению КАК ВТ_ДанныеКОбогащению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеКОбогащению КАК ВТ_ДанныеКОбогащениюНовые
	|		ПО ВТ_ДанныеКОбогащению.Терминал = ВТ_ДанныеКОбогащениюНовые.Терминал
	|			И ВТ_ДанныеКОбогащению.Контейнер = ВТ_ДанныеКОбогащениюНовые.Контейнер
	|			И ВТ_ДанныеКОбогащению.Состояние = ВТ_ДанныеКОбогащениюНовые.Состояние
	|			И ВТ_ДанныеКОбогащению.ПриходРасход = ВТ_ДанныеКОбогащениюНовые.ПриходРасход
	//|			И ВТ_ДанныеКОбогащению.ДатаОбновленияИнформации = ВТ_ДанныеКОбогащениюНовые.ДатаОбновленияИнформации
	|			И ВТ_ДанныеКОбогащению.ДатаОперации = ВТ_ДанныеКОбогащениюНовые.ДатаОперации
	|ГДЕ
	|	ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаНачало = ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаНачало
	|	И ВТ_ДанныеКОбогащениюНовые.ДатаОперацииСвязьРасходаКонец = ВТ_ДанныеКОбогащению.ДатаОперацииСвязьРасходаКонец
	|	И ВТ_ДанныеКОбогащениюНовые.ИсточникДобавленияДанных <> ВТ_ДанныеКОбогащению.ИсточникДобавленияДанных 
	| 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПриходРасход КАК ПриходРасход,
	|	ВложенныйЗапрос.ДатаОперации КАК ДатаОперацииКоличество,
	|	ВложенныйЗапрос.Контейнер КАК Контейнер,
	|	ВложенныйЗапрос.Терминал КАК Терминал,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет,
	|	ВложенныйЗапрос.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных, 
	|	ВЫБОР КОГДА ВТ_ВычислениеСтрокКОбогащению.Приоритет > ВложенныйЗапрос.Приоритет
	|			ТОГДА ВТ_ВычислениеСтрокКОбогащению.ДатаОперацииПервичная
	|		ИНАЧЕ ВТ_ВычислениеСтрокКОбогащению.ДатаОперации
	|	КОНЕЦ КАК ДатаОперацииПоПриоритету,
	|	ВТ_ВычислениеСтрокКОбогащению.ДатаОперации КАК ДатаОперации,    
	|	ВТ_ВычислениеСтрокКОбогащению.ДатаОперацииПервичная КАК ДатаОперацииПервичная,
	|	ВложенныйЗапрос.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода
	|ПОМЕСТИТЬ ВТ_ОбогащаемыеСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВычислениеСтрокКОбогащению.ПриходРасход КАК ПриходРасход,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВычислениеСтрокКОбогащению.ДатаОперации) КАК ДатаОперации,
	|		ВТ_ВычислениеСтрокКОбогащению.Контейнер КАК Контейнер,
	|		ВТ_ВычислениеСтрокКОбогащению.Терминал КАК Терминал,
	|		МИНИМУМ(ВТ_ВычислениеСтрокКОбогащению.Приоритет) КАК Приоритет,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВычислениеСтрокКОбогащению.ИсточникДобавленияДанных) КАК ИсточникДобавленияДанных,
	|		ВТ_ВычислениеСтрокКОбогащению.Дата КАК ДатаОперацииСвязьРасхода
	|	ИЗ
	|		ВТ_ВычислениеСтрокКОбогащению КАК ВТ_ВычислениеСтрокКОбогащению
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВычислениеСтрокКОбогащению.ПриходРасход,
	|		ВТ_ВычислениеСтрокКОбогащению.Дата,
	|		ВТ_ВычислениеСтрокКОбогащению.Контейнер,
	|		ВТ_ВычислениеСтрокКОбогащению.Терминал)КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВычислениеСтрокКОбогащению КАК ВТ_ВычислениеСтрокКОбогащению
	|		ПО (ВложенныйЗапрос.ПриходРасход = ВТ_ВычислениеСтрокКОбогащению.ПриходРасход)
	|			И (ВложенныйЗапрос.ДатаОперацииСвязьРасхода = ВТ_ВычислениеСтрокКОбогащению.Дата)
	|			И (ВложенныйЗапрос.Контейнер = ВТ_ВычислениеСтрокКОбогащению.Контейнер)
	|			И (ВложенныйЗапрос.Терминал = ВТ_ВычислениеСтрокКОбогащению.Терминал)
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НачалоОбогащения.ПриходРасход КАК ПриходРасход,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025 
	//|	ВТ_НачалоОбогащения.ДатаОперации КАК ДатаОперации,
	//|	ВТ_НачалоОбогащения.Приоритет КАК Приоритет,
	//|	ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода, 
	|	ВТ_ОбогащаемыеСтроки.ДатаОперацииПоПриоритету КАК ДатаОперацииОбогащаемая,
	|	ВТ_ОбогащаемыеСтроки.ДатаОперацииПервичная КАК ДатаОперации,
	|	ВТ_ОбогащаемыеСтроки.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода, 
	|	ВЫБОР
	|		КОГДА ВТ_НачалоОбогащения.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
	|			ТОГДА 2
	|		КОГДА ВТ_НачалоОбогащения.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов)
	|			ТОГДА 1
	|		КОГДА ВТ_НачалоОбогащения.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
	|			ТОГДА 3
	|	КОНЕЦ КАК Приоритет,
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|	ВТ_НачалоОбогащения.Контейнер КАК Контейнер,
	|	ВТ_НачалоОбогащения.Терминал КАК Терминал,
	|	ВТ_НачалоОбогащения.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_НачалоОбогащения.Состояние КАК Состояние,
	|	ВТ_НачалоОбогащения.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_НачалоОбогащения.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_НачалоОбогащения.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_НачалоОбогащения.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_НачалоОбогащения.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_НачалоОбогащения.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_НачалоОбогащения.Контрагент КАК Контрагент,
	|	ВТ_НачалоОбогащения.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_НачалоОбогащения.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_НачалоОбогащения.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_НачалоОбогащения.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_НачалоОбогащения.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_НачалоОбогащения.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_НачалоОбогащения.Станция КАК Станция,
	|	ВТ_НачалоОбогащения.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_НачалоОбогащения.ТипОперации КАК ТипОперации,
	|	ВТ_НачалоОбогащения.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_НачалоОбогащения.ДействиеРасчет КАК ДействиеРасчет,
	|	ВТ_НачалоОбогащения.ДатаВыхода КАК ДатаВыхода,
	|	ВТ_НачалоОбогащения.Действие КАК Действие,
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	ВТ_НачалоОбогащения.Авторасход КАК Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ЛОЖЬ КАК Комбинированная
	|ИЗ
	|	ВТ_ОбогащаемыеСтроки КАК ВТ_ОбогащаемыеСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоОбогащения КАК ВТ_НачалоОбогащения
	|		ПО ВТ_ОбогащаемыеСтроки.ПриходРасход = ВТ_НачалоОбогащения.ПриходРасход
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	//|			И ВТ_ОбогащаемыеСтроки.ДатаОперацииСвязьРасхода = ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода
	|			И ВТ_ОбогащаемыеСтроки.ДатаОперации = ВТ_НачалоОбогащения.ДатаОперации
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|			И ВТ_ОбогащаемыеСтроки.Контейнер = ВТ_НачалоОбогащения.Контейнер
	|			И ВТ_ОбогащаемыеСтроки.Терминал = ВТ_НачалоОбогащения.Терминал
	|			И (ВТ_ОбогащаемыеСтроки.ИсточникДобавленияДанных > 1
	|				ИЛИ ВТ_ОбогащаемыеСтроки.ДатаОперацииКоличество > 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Терминал,
	|	Контейнер,
	|	ДатаОперацииСвязьРасхода,
	|	Приоритет УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_НачалоОбогащения.ПриходРасход КАК ПриходРасход,
	|	ВТ_НачалоОбогащения.ДатаОперации КАК ДатаОперации,  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	|	ВТ_НачалоОбогащения.ДатаОперации КАК ДатаОперацииОбогащаемая,   
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|	ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода,
	|	ВТ_НачалоОбогащения.Контейнер КАК Контейнер,
	|	ВТ_НачалоОбогащения.Терминал КАК Терминал,
	|	ВТ_НачалоОбогащения.Приоритет КАК Приоритет,
	|	ВТ_НачалоОбогащения.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
	|	ВТ_НачалоОбогащения.Состояние КАК Состояние,
	|	ВТ_НачалоОбогащения.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	ВТ_НачалоОбогащения.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	ВТ_НачалоОбогащения.ЛинияПодсток КАК ЛинияПодсток,
	|	ВТ_НачалоОбогащения.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	ВТ_НачалоОбогащения.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	ВТ_НачалоОбогащения.КомментарийТерминала КАК КомментарийТерминала,
	|	ВТ_НачалоОбогащения.Контрагент КАК Контрагент,
	|	ВТ_НачалоОбогащения.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	ВТ_НачалоОбогащения.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_НачалоОбогащения.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	ВТ_НачалоОбогащения.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_НачалоОбогащения.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_НачалоОбогащения.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	ВТ_НачалоОбогащения.Станция КАК Станция,
	|	ВТ_НачалоОбогащения.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_НачалоОбогащения.ТипОперации КАК ТипОперации,
	|	ВТ_НачалоОбогащения.ДанныеИзБД КАК ДанныеИзБД,
	|	ВТ_НачалоОбогащения.ДействиеРасчет КАК ДействиеРасчет,
	|	ВТ_НачалоОбогащения.ДатаВыхода КАК ДатаВыхода,
	|	ВТ_НачалоОбогащения.Действие КАК Действие,    
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Начало 26.06.2025
	|	ВТ_НачалоОбогащения.Авторасход КАК Авторасход, 
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 (п.4) Конец 26.06.2025
	|	ЛОЖЬ КАК Комбинированная
	|ИЗ
	|	ВТ_ОбогащаемыеСтроки КАК ВТ_ОбогащаемыеСтроки 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоОбогащения КАК ВТ_НачалоОбогащения
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_НачалоОбогащения КАК ВТ_НачалоОбогащения
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|		ПО ВТ_ОбогащаемыеСтроки.ПриходРасход = ВТ_НачалоОбогащения.ПриходРасход  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	//|			И ВТ_ОбогащаемыеСтроки.ДатаОперацииСвязьРасхода = ВТ_НачалоОбогащения.ДатаОперацииСвязьРасхода   
	|			И ВТ_ОбогащаемыеСтроки.ДатаОперации = ВТ_НачалоОбогащения.ДатаОперации
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|			И ВТ_ОбогащаемыеСтроки.Контейнер = ВТ_НачалоОбогащения.Контейнер
	|			И ВТ_ОбогащаемыеСтроки.Терминал = ВТ_НачалоОбогащения.Терминал
	//|			И (ВТ_ОбогащаемыеСтроки.ИсточникДобавленияДанных = 1)
	//|			И (ВТ_ОбогащаемыеСтроки.ДатаОперации = 1)
	|ГДЕ
	|	НЕ ВТ_НачалоОбогащения.ДанныеИзБД 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025  
	|	и ВТ_ОбогащаемыеСтроки.Контейнер Есть NULL
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	//|ВЫБРАТЬ 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|	ВТ_ОбогащаемыеСтроки.ПриходРасход КАК ПриходРасход,
	|	ВТ_ОбогащаемыеСтроки.ДатаОперацииСвязьРасхода КАК ДатаОперацииСвязьРасхода,
	|	ВТ_ОбогащаемыеСтроки.Контейнер КАК Контейнер,
	|	ВТ_ОбогащаемыеСтроки.Терминал КАК Терминал,
	|	ВТ_ОбогащаемыеСтроки.Приоритет КАК Приоритет
	|ИЗ
	|	ВТ_ОбогащаемыеСтроки КАК ВТ_ОбогащаемыеСтроки 
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 14.08.2025
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоОбогащения КАК ВТ_НачалоОбогащения
	|		ПО ВТ_ОбогащаемыеСтроки.ПриходРасход = ВТ_НачалоОбогащения.ПриходРасход
	|			И ВТ_ОбогащаемыеСтроки.ДатаОперации = ВТ_НачалоОбогащения.ДатаОперации
	|			И ВТ_ОбогащаемыеСтроки.Контейнер = ВТ_НачалоОбогащения.Контейнер
	|			И ВТ_ОбогащаемыеСтроки.Терминал = ВТ_НачалоОбогащения.Терминал
	|			И ВТ_ОбогащаемыеСтроки.Приоритет = ВТ_НачалоОбогащения.Приоритет
	//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Конец 14.08.2025
	|ГДЕ
	|	(ВТ_ОбогащаемыеСтроки.ИсточникДобавленияДанных > 1
	|			ИЛИ ВТ_ОбогащаемыеСтроки.ДатаОперацииКоличество > 1)"
КонецФункции

// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.202
Процедура ЗаписатьПризнакЗагрузкиТерминала(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокТерминалы.Терминал КАК Терминал,
		|	НАЧАЛОПЕРИОДА(ПереносДанныхВЧистыйСтокТерминалы.Ссылка.Дата, ДЕНЬ) КАК ДатаЗагрузки,
		|	ИСТИНА КАК Обработано
		|ИЗ
		|	Документ.ПереносДанныхВЧистыйСток.Терминалы КАК ПереносДанныхВЧистыйСтокТерминалы
		|ГДЕ
		|	ПереносДанныхВЧистыйСтокТерминалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ДатыЗагрузокДанныхПоТерминалам.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьТЧТерминалы(Объект)
	Объект.Терминалы.Очистить();
	ТчТерминалы = Объект.ДанныеПоОперациямЧистыйСток.Выгрузить(,"Терминал");
	ТчТерминалы.Свернуть("Терминал");
	Для Каждого СтрокаТерминала Из ТчТерминалы Цикл
		ЗаполнитьЗначенияСвойств(Объект.Терминалы.Добавить(),СтрокаТерминала);
	КонецЦикла;
КонецПроцедуры

Процедура ДозаполнитьДанныеПоРасходуТерминалов(Объект) Экспорт
	ДатаПереноса = НачалоДня(Объект.Дата);
	ДатаРасхода = ДатаПереноса - 1;
	ТаблицаИсключений = Объект.ДанныеПоОперациямЧистыйСток.Выгрузить(,"Контейнер,Терминал");
	ТаблицаИсключений.Свернуть("Контейнер,Терминал");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОстатков", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаЗагрузки", ДатаПереноса); 
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка); 
	Запрос.УстановитьПараметр("ДатаРасхода", ДатаРасхода); 
	Запрос.УстановитьПараметр("ТаблицаИсключений", ТаблицаИсключений); 
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗагрузокДанныхПоТерминалам.Терминал КАК Терминал,
		|	ДатыЗагрузокДанныхПоТерминалам.ДатаЗагрузки КАК ДатаЗагрузки
		|ПОМЕСТИТЬ ВТ_Терминалы
		|ИЗ
		|	РегистрСведений.ДатыЗагрузокДанныхПоТерминалам КАК ДатыЗагрузокДанныхПоТерминалам
		|ГДЕ
		|	НЕ ДатыЗагрузокДанныхПоТерминалам.Обработано
		|	И ДатыЗагрузокДанныхПоТерминалам.ДатаЗагрузки = &ДатаЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИсключений.Контейнер КАК Контейнер,
		|	ТаблицаИсключений.Терминал КАК Терминал
		|ПОМЕСТИТЬ ВТ_Ислючения
		|ИЗ
		|	&ТаблицаИсключений КАК ТаблицаИсключений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестонахождениеЧистыйСтокОстатки.Контейнер КАК Контейнер,
		|	МестонахождениеЧистыйСтокОстатки.Терминал КАК Терминал,
		|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.МестонахождениеЧистыйСток.Остатки(
		//Евросиб Шевченко А.В. US 129202 TA 132019 03.03.2026
		|			&ДатаОстатков,
		//Евросиб Шевченко А.В. US 129202 TA 132019 03.03.2026
		|			Терминал В
		|				(ВЫБРАТЬ
		|					ВТ_Терминалы.Терминал КАК Терминал
		|				ИЗ
		|					ВТ_Терминалы КАК ВТ_Терминалы)) КАК МестонахождениеЧистыйСтокОстатки
		//Евросиб Шевченко А.В. US 129202 TA 132019 03.03.2026
		|ГДЕ
		|	МестонахождениеЧистыйСтокОстатки.КоличествоОстаток > 0
		//Евросиб Шевченко А.В. US 129202 TA 132019 03.03.2026
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоОперациямЧистыйСток.Контейнер КАК Контейнер,
		|	МАКСИМУМ(ДанныеПоОперациямЧистыйСток.ДатаОперации) КАК ДатаОперации
		|ПОМЕСТИТЬ ВТ_МаксимумыАналитика
		|ИЗ
		|	РегистрСведений.ДанныеПоОперациямЧистыйСток КАК ДанныеПоОперациямЧистыйСток
		|ГДЕ
		|	ДанныеПоОперациямЧистыйСток.Контейнер В
		|			(ВЫБРАТЬ
		|				ВТ_Остатки.Контейнер КАК Контейнер
		|			ИЗ
		|				ВТ_Остатки КАК ВТ_Остатки)
		|	И ДанныеПоОперациямЧистыйСток.ДатаОперации <= &ДатаРасхода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоОперациямЧистыйСток.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаЗагрузки КАК ДатаОперации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер КАК Контейнер,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Состояние КАК Состояние,
		|	&ТекущаяДата КАК ДатаОбновленияИнформации,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ФИОВодителя КАК ФИОВодителя,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.НомерТранспорта КАК НомерТранспорта,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ВидТранспорта КАК ВидТранспорта,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Станция КАК Станция,
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.Контрагент КАК Контрагент,
		|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиДанныхПоОперациямЧистыйСток.Расход) КАК Действие
		|ПОМЕСТИТЬ ВТ_ДанныеКРасходу
		|ИЗ
		|	ВТ_МаксимумыАналитика КАК ВТ_МаксимумыАналитика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоОперациямЧистыйСток.СрезПоследних(, ) КАК ДанныеПоОперациямЧистыйСтокСрезПоследних
		|		ПО ВТ_МаксимумыАналитика.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
		|			И ВТ_МаксимумыАналитика.ДатаОперации = ДанныеПоОперациямЧистыйСтокСрезПоследних.ДатаОперации
		|			И ВТ_МаксимумыАналитика.Контейнер = ДанныеПоОперациямЧистыйСтокСрезПоследних.Контейнер
		|ГДЕ
		|	ДанныеПоОперациямЧистыйСтокСрезПоследних.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеКРасходу.ДатаОперации КАК ДатаОперации,
		|	ВТ_ДанныеКРасходу.Контейнер КАК Контейнер,
		|	ВТ_ДанныеКРасходу.Состояние КАК Состояние,
		|	ВТ_ДанныеКРасходу.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_ДанныеКРасходу.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ВТ_ДанныеКРасходу.ЛинияПодсток КАК ЛинияПодсток,
		|	ВТ_ДанныеКРасходу.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ВТ_ДанныеКРасходу.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ВТ_ДанныеКРасходу.КомментарийТерминала КАК КомментарийТерминала,
		|	ВТ_ДанныеКРасходу.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ВТ_ДанныеКРасходу.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ВТ_ДанныеКРасходу.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ДанныеКРасходу.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ВТ_ДанныеКРасходу.ФИОВодителя КАК ФИОВодителя,
		|	ВТ_ДанныеКРасходу.НомерТранспорта КАК НомерТранспорта,
		|	ВТ_ДанныеКРасходу.ВидТранспорта КАК ВидТранспорта,
		|	ВТ_ДанныеКРасходу.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ВТ_ДанныеКРасходу.Станция КАК Станция,
		|	ВТ_ДанныеКРасходу.Контрагент КАК Контрагент,
		|	ВТ_ДанныеКРасходу.Действие КАК Действие,
		|	ВТ_Остатки.Терминал КАК Терминал
		|ПОМЕСТИТЬ ВТ_ИтогРасхода
		|ИЗ
		|	ВТ_ДанныеКРасходу КАК ВТ_ДанныеКРасходу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_ДанныеКРасходу.Контейнер = ВТ_Остатки.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогРасхода.ДатаОперации КАК ДатаОперации,
		|	ВТ_ИтогРасхода.Контейнер КАК Контейнер,
		|	ВТ_ИтогРасхода.Состояние КАК Состояние,
		|	ВТ_ИтогРасхода.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	ВТ_ИтогРасхода.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	ВТ_ИтогРасхода.ЛинияПодсток КАК ЛинияПодсток,
		|	ВТ_ИтогРасхода.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	ВТ_ИтогРасхода.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	ВТ_ИтогРасхода.КомментарийТерминала КАК КомментарийТерминала,
		|	ВТ_ИтогРасхода.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	ВТ_ИтогРасхода.КомментарийСотрудника КАК КомментарийСотрудника,
		|	ВТ_ИтогРасхода.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ИтогРасхода.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	ВТ_ИтогРасхода.ФИОВодителя КАК ФИОВодителя,
		|	ВТ_ИтогРасхода.НомерТранспорта КАК НомерТранспорта,
		|	ВТ_ИтогРасхода.ВидТранспорта КАК ВидТранспорта,
		|	ВТ_ИтогРасхода.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
		|	ВТ_ИтогРасхода.Станция КАК Станция,
		|	ВТ_ИтогРасхода.Контрагент КАК Контрагент,
		|	ВТ_ИтогРасхода.Действие КАК Действие,
		|	ВТ_ИтогРасхода.Терминал КАК Терминал
		|ИЗ
		|	ВТ_ИтогРасхода КАК ВТ_ИтогРасхода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ислючения КАК ВТ_Ислючения
		|		ПО ВТ_ИтогРасхода.Контейнер = ВТ_Ислючения.Контейнер
		|ГДЕ
		|	ВТ_Ислючения.Контейнер ЕСТЬ NULL";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл            
		СтрокаТЧ = Объект.ДанныеПоОперациямЧистыйСток.Добавить();
		СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла;

КонецПроцедуры
// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 06.02.2025

// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 22.12.2024
Процедура ЗаполнитьДанныеИзИсточниковДляЧистогоСтокаНаСервере(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Период КАК Период,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Контейнер КАК Контейнер,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ДатаОперации КАК ДатаОперации,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Терминал КАК Терминал,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА ИнформацияОтТерминаловCodecoСрезПоследних.Состояние
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|	КОНЕЦ КАК Состояние,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Поврежден КАК Поврежден,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ТипКТК КАК ТипКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.РазмерКТК КАК РазмерКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Подсток КАК Подсток,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Транспорт КАК Транспорт,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерРелиза КАК НомерРелиза,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Комментарий КАК Комментарий,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Тара КАК Тара,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Нетто КАК Нетто,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Брутто КАК Брутто,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Ошибка КАК Ошибка,
	|	ВЫРАЗИТЬ(ИнформацияОтТерминаловCodecoСрезПоследних.КомментарийКОшибке КАК СТРОКА(1000)) КАК КомментарийКОшибке,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Собственник КАК Собственник,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Менеджер КАК Менеджер,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ПлановоеНаправление КАК ПлановоеНаправление,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КПИсходящий КАК КПИсходящий,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОСотрудника КАК ФИОСотрудника,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ТипИсточникаИнформации КАК ТипИсточникаИнформации,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.СпособВнесенияДанных КАК СпособВнесенияДанных,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОСотрудникаЕвросиб КАК ФИОСотрудникаЕвросиб,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ДатаВнесенияДанных КАК ДатаВнесенияДанных,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.РегистраторЗагрузка КАК РегистраторЗагрузка,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КодТерминала КАК КодТерминала,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерКонтейнера КАК НомерКонтейнера,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ПОМЕСТИТЬ ВТ_СрезСТерминала
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминаловCodeco.СрезПоследних КАК ИнформацияОтТерминаловCodecoСрезПоследних
	|ГДЕ
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Статус = &Вывоз
	|	И НЕ ИнформацияОтТерминаловCodecoСрезПоследних.ПеренесенВЧистыйСток
	|	И ЕСТЬNULL(ИнформацияОтТерминаловCodecoСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены, ИСТИНА)
	|	И ИнформацияОтТерминаловCodecoСрезПоследних.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Период,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Контейнер,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ДатаОперации,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Терминал,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Статус,
	|	ВЫБОР
	|		КОГДА ИнформацияОтТерминаловCodecoСрезПоследних.Состояние
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|	КОНЕЦ,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Поврежден,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ТипКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.РазмерКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Подсток,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Транспорт,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерТранспорта,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОВодителя,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерРелиза,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Комментарий,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Тара,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Нетто,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Брутто,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Ошибка,
	|	ВЫРАЗИТЬ(ИнформацияОтТерминаловCodecoСрезПоследних.КомментарийКОшибке КАК СТРОКА(1000)),
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Собственник,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Менеджер,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ПлановоеНаправление,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КПИсходящий,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КомментарийСотрудника,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОСотрудника,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ТипИсточникаИнформации,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.СпособВнесенияДанных,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ФИОСотрудникаЕвросиб,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ДатаВнесенияДанных,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.РегистраторЗагрузка,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.АдресМестаОперацииСКТК,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.КодТерминала,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.НомерКонтейнера,
	|	ИнформацияОтТерминаловCodecoСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминаловCodeco.СрезПоследних КАК ИнформацияОтТерминаловCodecoСрезПоследних
	|ГДЕ
	|	ИнформацияОтТерминаловCodecoСрезПоследних.Статус = &Завоз
	|	И НЕ ИнформацияОтТерминаловCodecoСрезПоследних.ПеренесенВЧистыйСток
	|	И ЕСТЬNULL(ИнформацияОтТерминаловCodecoСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены, ИСТИНА)
	|	И ИнформацияОтТерминаловCodecoСрезПоследних.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Период КАК Период,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер КАК Контейнер,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации КАК ДатаОперации,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Терминал КАК Терминал,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаВнесенияДанных КАК ДатаВнесенияДанных,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Состояние КАК Состояние,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.НомерРелиза КАК НомерРелиза,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Нетто КАК Нетто,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Статус КАК Статус,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ПОМЕСТИТЬ ВТ_СрезОтАвоперевозчика
	|ИЗ
	|	РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СрезПоследних КАК ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних
	|ГДЕ
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Статус = &Вывоз
	|	И НЕ ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ПеренесенВЧистыйСток
	|	И ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ЕСТЬNULL(ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены, ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Период,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Терминал,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаВнесенияДанных,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Состояние,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.НомерРелиза,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Нетто,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.АдресМестаОперацииСКТК,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.НомерТранспорта,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ФИОВодителя,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.КлючАналитикиПеревозки,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Статус,
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ИЗ
	|	РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СрезПоследних КАК ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних
	|ГДЕ
	|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Статус = &Завоз
	|	И НЕ ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ПеренесенВЧистыйСток
	|	И ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ЕСТЬNULL(ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ВсеОшибкиИсправлены, ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СрезОтАвоперевозчика.Период КАК Период,
	|	ВТ_СрезОтАвоперевозчика.Контейнер КАК Контейнер,
	|	ВТ_СрезОтАвоперевозчика.ДатаОперации КАК ДатаОперации,
	|	ВТ_СрезОтАвоперевозчика.Терминал КАК Терминал,
	|	ВТ_СрезОтАвоперевозчика.ДатаВнесенияДанных КАК ДатаВнесенияДанных,
	|	ВТ_СрезОтАвоперевозчика.Состояние КАК Состояние,
	|	ВТ_СрезОтАвоперевозчика.НомерРелиза КАК НомерРелиза,
	|	ВТ_СрезОтАвоперевозчика.Нетто КАК Нетто,
	|	ВТ_СрезОтАвоперевозчика.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_СрезОтАвоперевозчика.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_СрезОтАвоперевозчика.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_СрезОтАвоперевозчика.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_СрезОтАвоперевозчика.Статус КАК Статус,
	|	ВТ_СрезОтАвоперевозчика.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ПОМЕСТИТЬ ВТ_ПодтвержденнаяИнфАвтоперевозчиков
	|ИЗ
	|	ВТ_СрезОтАвоперевозчика КАК ВТ_СрезОтАвоперевозчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезСТерминала КАК ВТ_СрезСТерминала
	|		ПО ВТ_СрезОтАвоперевозчика.Контейнер = ВТ_СрезСТерминала.Контейнер
	|			И ВТ_СрезОтАвоперевозчика.Статус = ВТ_СрезСТерминала.Статус
	|			И ВТ_СрезОтАвоперевозчика.Терминал = ВТ_СрезСТерминала.Терминал
	|ГДЕ
	|	НЕ ВТ_СрезСТерминала.Контейнер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СрезОтАвоперевозчика.Период КАК Период,
	|	ВТ_СрезОтАвоперевозчика.Контейнер КАК Контейнер,
	|	ВТ_СрезОтАвоперевозчика.ДатаОперации КАК ДатаОперации,
	|	ВТ_СрезОтАвоперевозчика.Терминал КАК Терминал,
	|	ВТ_СрезОтАвоперевозчика.ДатаВнесенияДанных КАК ДатаВнесенияДанных,
	|	ВТ_СрезОтАвоперевозчика.Состояние КАК Состояние,
	|	ВТ_СрезОтАвоперевозчика.НомерРелиза КАК НомерРелиза,
	|	ВТ_СрезОтАвоперевозчика.Нетто КАК Нетто,
	|	ВТ_СрезОтАвоперевозчика.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_СрезОтАвоперевозчика.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_СрезОтАвоперевозчика.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_СрезОтАвоперевозчика.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_СрезОтАвоперевозчика.Статус КАК Статус,
	|	ВТ_СрезОтАвоперевозчика.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ПОМЕСТИТЬ ВТ_НеПодтвержденнаяИнфАвтоперевозчиков
	|ИЗ
	|	ВТ_СрезОтАвоперевозчика КАК ВТ_СрезОтАвоперевозчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезСТерминала КАК ВТ_СрезСТерминала
	|		ПО ВТ_СрезОтАвоперевозчика.Контейнер = ВТ_СрезСТерминала.Контейнер
	|			И ВТ_СрезОтАвоперевозчика.Статус = ВТ_СрезСТерминала.Статус
	|			И ВТ_СрезОтАвоперевозчика.Терминал = ВТ_СрезСТерминала.Терминал
	|ГДЕ
	|	ВТ_СрезСТерминала.Контейнер ЕСТЬ NULL
	|	И НЕ ВТ_СрезОтАвоперевозчика.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Период КАК Период,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер КАК Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ДатаОперации КАК ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Терминал КАК Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ДатаВнесенияДанных КАК ДатаВнесенияДанных,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Состояние КАК Состояние,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.НомерРелиза КАК НомерРелиза,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Нетто КАК Нетто,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус КАК Статус,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ПОМЕСТИТЬ ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, ) КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО (стоки_ТекущиеДанныеСрезПоследних.КТК = ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер = РелизСобственникаНоминации.Контейнер
	|			И (&ТекДата >= РелизСобственникаНоминации.Ссылка.НачалоДействия)
	|			И (&ТекДата <= РелизСобственникаНоминации.Ссылка.ОкончаниеДействия)
	|			И (РелизСобственникаНоминации.тек_СобственностьКТК В (&тек_СобственностьКТК))
	|			И (ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Период >= ДОБАВИТЬКДАТЕ(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ, РелизСобственникаНоминации.НормативВозврата - 5))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК Мультилокации
	|		ПО (РелизСобственникаНоминации.Ссылка.ВозможныеСтокиСдачи = Мультилокации.Ссылка)
	|			И (Мультилокации.Локация = ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Терминал)
	|ГДЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус = &Завоз
	|	И (ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Состояние
	|			ИЛИ РелизСобственникаНоминации.Ссылка ЕСТЬ NULL
	|			ИЛИ Мультилокации.Ссылка ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Период,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ДатаВнесенияДанных,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Состояние,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.НомерРелиза,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Нетто,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.АдресМестаОперацииСКТК,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.НомерТранспорта,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ФИОВодителя,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.КлючАналитикиПеревозки,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ОшибкиПриЗагрузкеИнформацииОтТерминалов
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, ) КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО (стоки_ТекущиеДанныеСрезПоследних.КТК = ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер)
	|ГДЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус = &Завоз
	|	И (ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Состояние
	|			ИЛИ НЕ стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Клиентский))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ГоризонтальныеСвязиЛокаций.ЖДСтанция) КАК ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ГоризонтальныеСвязиЛокацийCodec
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ
	|				ВТ_СрезСТерминала.Терминал
	|			ИЗ
	|				ВТ_СрезСТерминала КАК ВТ_СрезСТерминала)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГоризонтальныеСвязиЛокаций.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ГоризонтальныеСвязиЛокаций.ЖДСтанция) КАК ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ
	|				ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал
	|			ИЗ
	|				ВТ_ПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_ПодтвержденнаяИнфАвтоперевозчиков)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГоризонтальныеСвязиЛокаций.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ГоризонтальныеСвязиЛокаций.ЖДСтанция) КАК ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Терминал
	|ПОМЕСТИТЬ ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ
	|				ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал
	|			ИЗ
	|				ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ
	|		
	|			ОБЪЕДИНИТЬ
	|		
	|			ВЫБРАТЬ
	|				ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеВЫВОЗ.Терминал
	|			ИЗ
	|				ВТ_НеПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеВЫВОЗ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГоризонтальныеСвязиЛокаций.Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СрезСТерминала.Период КАК Период,
	|	ВТ_СрезСТерминала.Контейнер КАК Контейнер,
	|	ВТ_СрезСТерминала.ДатаОперации КАК ДатаОперации,
	|	ВТ_СрезСТерминала.Терминал КАК Терминал,
	|	ВТ_СрезСТерминала.Терминал.Контрагент КАК Контрагент,
	|	ВТ_СрезСТерминала.Статус КАК ТипОперации,
	|	ВТ_СрезСТерминала.Состояние КАК Состояние,
	|	ВЫБОР
	|		КОГДА ВТ_СрезСТерминала.Поврежден
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.Поврежден)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.НеПоврежден)
	|	КОНЕЦ КАК НаличиеПодвреждения,
	|	ВТ_СрезСТерминала.ТипКТК КАК ТипКТК,
	|	ВТ_СрезСТерминала.РазмерКТК КАК РазмерКТК,
	|	ВТ_СрезСТерминала.Подсток КАК ЛинияПодсток,
	|	ВТ_СрезСТерминала.Транспорт КАК ВидТранспорта,
	|	ВТ_СрезСТерминала.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_СрезСТерминала.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_СрезСТерминала.НомерРелиза КАК НомерРелиза,
	|	ВЫРАЗИТЬ(ВТ_СрезСТерминала.Комментарий КАК СТРОКА(1000)) КАК КомментарийТерминала,
	|	ВТ_СрезСТерминала.Тара КАК Тара,
	|	ВТ_СрезСТерминала.Нетто КАК Нетто,
	|	ВТ_СрезСТерминала.Брутто КАК Брутто,
	|	ВТ_СрезСТерминала.Ошибка КАК Ошибка,
	|	ВЫРАЗИТЬ(ВТ_СрезСТерминала.КомментарийКОшибке КАК СТРОКА(1000)) КАК КомментарийКОшибке,
	|	ВТ_СрезСТерминала.Собственник КАК Собственник,
	|	ВТ_СрезСТерминала.Менеджер КАК Менеджер,
	|	ВТ_СрезСТерминала.ПлановоеНаправление КАК ПлановоеНаправление,
	|	ВТ_СрезСТерминала.КПИсходящий КАК КПИсходящий,
	|	ВТ_СрезСТерминала.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ВТ_СрезСТерминала.ФИОСотрудника КАК ФИОСотрудника,
	|	ВТ_СрезСТерминала.ТипИсточникаИнформации КАК ТипИсточникаИнформации,
	|	ВТ_СрезСТерминала.СпособВнесенияДанных КАК СпособВнесенияДанных,
	|	ВТ_СрезСТерминала.ФИОСотрудникаЕвросиб КАК ФИОСотрудникаЕвросиб,
	|	ВТ_СрезСТерминала.ДатаВнесенияДанных КАК ДатаОбновленияИнформации,
	|	ВТ_СрезСТерминала.РегистраторЗагрузка КАК РегистраторЗагрузка,
	|	ВТ_СрезСТерминала.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_СрезСТерминала.КодТерминала КАК КодТерминала,
	|	ВТ_СрезСТерминала.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТ_СрезСТерминала.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтТерминалов) КАК ИсточникДобавленияДанных,
	|	ВЫБОР
	|		КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА ВТ_СрезСТерминала.НомерРелиза
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаявкаНаВыдачу,
	|	ВЫБОР
	|		КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|			ТОГДА ВТ_СрезСТерминала.НомерРелиза
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаявкаНаСдачу,
	|	ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф.ЖДСтанция КАК Станция,
	|	ВЫБОР
	|		КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА ВТ_СрезСТерминала.Транспорт
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидТранспортаУбытия,
	|	ВЫБОР
	|		КОГДА ВТ_СрезСТерминала.Терминал.ТипПодрядчика = ЗНАЧЕНИЕ(Перечисление.ТипПодрядчикаТерминал.Терминал)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|							И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.АВТО)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ОтправкаПоЖД)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|									И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.АВТО)
	|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ХранениеДепо)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|											И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ПрибытиеПоЖД)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|													И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|												ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ТранзитПоЖД)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ВТ_СрезСТерминала.Терминал.ТипПодрядчика = ЗНАЧЕНИЕ(Перечисление.ТипПодрядчикаТерминал.Порт)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|							И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.АВТО)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ОтправкаПоМорю)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|									И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.АВТО)
	|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ХранениеДепо)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|											И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ОтправкаПоМорю)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|													И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|												ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ТранзитПоЖД)
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|															И НЕ ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.Авто)
	|															И НЕ ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|														ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.Реэкспорт)
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ВТ_СрезСТерминала.Терминал.ТипПодрядчика = ЗНАЧЕНИЕ(Перечисление.ТипПодрядчикаТерминал.Депо)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СрезСТерминала.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|							И ВТ_СрезСТерминала.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.АВТО)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТерминальныеУслуги.ХранениеДепо)
	|				КОНЕЦ
	|	КОНЕЦ КАК ТерминальнаяУслуга
	|ИЗ
	|	ВТ_СрезСТерминала КАК ВТ_СрезСТерминала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГоризонтальныеСвязиЛокацийCodec КАК ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф
	|		ПО ВТ_СрезСТерминала.Терминал = ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф.Терминал
	|ГДЕ
	|	ВТ_СрезСТерминала.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ВТ_СрезСТерминала.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Период КАК Период,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Контейнер КАК Контейнер,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.ДатаОперации КАК ДатаОперации,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал КАК Терминал,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал.Контрагент КАК Контрагент,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.ДатаВнесенияДанных КАК ДатаОбновленияИнформации,
	|	ВЫБОР
	|		КОГДА ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Состояние
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|	КОНЕЦ КАК Состояние,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.НомерРелиза КАК НомерРелиза,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Нетто КАК Нетто,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Статус КАК ТипОперации,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков) КАК ИсточникДобавленияДанных,
	|	ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф.ЖДСтанция КАК Станция,
	|	ВЫБОР
	|		КОГДА ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)
	|			ТОГДА ВТ_ПодтвержденнаяИнфАвтоперевозчиков.НомерРелиза
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаявкаНаВыдачу,
	|	ВЫБОР
	|		КОГДА ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
	|			ТОГДА ВТ_ПодтвержденнаяИнфАвтоперевозчиков.НомерРелиза
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаявкаНаСдачу
	|ИЗ
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_ПодтвержденнаяИнфАвтоперевозчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф КАК ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф
	|		ПО ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал = ВТ_ГоризонтальныеСвязиЛокацийПодтвержденнаяИнф.Терминал
	|ГДЕ
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Период КАК Период,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Контейнер КАК Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.ДатаОперации КАК ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал КАК Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал.Контрагент КАК Контрагент,
	|	""Авто"" КАК ВидТранспорта,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.ДатаВнесенияДанных КАК ДатаОбновленияИнформации,
	|	ВЫБОР
	|		КОГДА ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Состояние
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|	КОНЕЦ КАК Состояние,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.НомерРелиза КАК НомерРелиза,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Нетто КАК Нетто,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.НомерТранспорта КАК НомерТранспорта,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.ФИОВодителя КАК ФИОВодителя,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Статус КАК ТипОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков) КАК ИсточникДобавленияДанных,
	|	ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф.ЖДСтанция КАК Станция,
	|	"""" КАК ЗаявкаНаВыдачу,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.НомерРелиза КАК ЗаявкаНаСдачу
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф КАК ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф
	|		ПО ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал = ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф.Терминал
	|ГДЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Период,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Терминал.Контрагент,
	|	""Авто"",
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.ДатаВнесенияДанных,
	|	ВЫБОР
	|		КОГДА ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Состояние
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|	КОНЕЦ,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.НомерРелиза,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Нетто,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.АдресМестаОперацииСКТК,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.НомерТранспорта,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.ФИОВодителя,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.КлючАналитикиПеревозки,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Статус,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков),
	|	ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф.ЖДСтанция,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.НомерРелиза,
	|	""""
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф КАК ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф
	|		ПО ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Терминал = ВТ_ГоризонтальныеСвязиЛокацийНеПодтвержденнаяИнф.Терминал
	|ГДЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковВывоз.Статус = &Вывоз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РучнаяЗагрузкаСтоковСрезПоследних.Период КАК Период,
	|	РучнаяЗагрузкаСтоковСрезПоследних.КТК КАК Контейнер,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Терминал КАК Терминал,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ДатаОперации КАК ДатаОперации,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Контрагент КАК Контрагент,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ФедеральныйОкруг КАК ФедеральныйОкруг,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Город КАК Город,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Станция КАК Станция,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Состояние КАК Состояние,
	|	РучнаяЗагрузкаСтоковСрезПоследних.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ВидТранспорта КАК ВидТранспорта,
	|	РучнаяЗагрузкаСтоковСрезПоследних.НомерТранспорта КАК НомерТранспорта,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ФИОВодителя КАК ФИОВодителя,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ТипОперации КАК ТипОперации,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ЛинияПодсток КАК ЛинияПодсток,
	|	РучнаяЗагрузкаСтоковСрезПоследних.НаличиеПодвреждения КАК НаличиеПодвреждения,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
	|	РучнаяЗагрузкаСтоковСрезПоследних.КомментарийТерминала КАК КомментарийТерминала,
	|	РучнаяЗагрузкаСтоковСрезПоследних.КомментарийСотрудника КАК КомментарийСотрудника,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.РучнаяЗагрузка) КАК ИсточникДобавленияДанных,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ТипПодрядчика КАК ТипПодрядчика,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ПеренесеноВЧистыйСток КАК ПеренесеноВЧистыйСток,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ДатаВыходаПредыдущегоТерминала КАК ДатаВыходаПредыдущегоТерминала,
	|	РучнаяЗагрузкаСтоковСрезПоследних.СправочникОшибок КАК СправочникОшибок,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ПеренесенВЧистыйСток КАК ПеренесенВЧистыйСток,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ОтветственныйЗаЗагрузку КАК ОтветственныйЗаЗагрузку,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ДатаВыхода КАК ДатаВыхода
	|ИЗ
	|	РегистрСведений.РучнаяЗагрузкаСтоков.СрезПоследних КАК РучнаяЗагрузкаСтоковСрезПоследних
	|ГДЕ
	|	НЕ РучнаяЗагрузкаСтоковСрезПоследних.ПеренесенВЧистыйСток
	|	И НЕ РучнаяЗагрузкаСтоковСрезПоследних.ПеренесеноВЧистыйСток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СрезСТерминала.Контейнер КАК Контейнер,
	|	ВТ_СрезСТерминала.ДатаОперации КАК ДатаОперации,
	|	ВТ_СрезСТерминала.Терминал КАК Терминал,
	|	ВТ_СрезСТерминала.Статус КАК Статус,
	|	ВТ_СрезСТерминала.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_ИнфДляГуидов
	|ИЗ
	|	ВТ_СрезСТерминала КАК ВТ_СрезСТерминала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Контейнер,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.ДатаОперации,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Терминал,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Статус,
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков.Состояние
	|ИЗ
	|	ВТ_ПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_ПодтвержденнаяИнфАвтоперевозчиков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Статус,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ.Состояние
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиковПодходящиеЗАВОЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Контейнер,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.ДатаОперации,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Терминал,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус,
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Состояние
	|ИЗ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков КАК ВТ_НеПодтвержденнаяИнфАвтоперевозчиков
	|ГДЕ
	|	ВТ_НеПодтвержденнаяИнфАвтоперевозчиков.Статус = &Вывоз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РучнаяЗагрузкаСтоковСрезПоследних.КТК,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ДатаОперации,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Терминал,
	|	РучнаяЗагрузкаСтоковСрезПоследних.ТипОперации,
	|	РучнаяЗагрузкаСтоковСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.РучнаяЗагрузкаСтоков.СрезПоследних КАК РучнаяЗагрузкаСтоковСрезПоследних
	|ГДЕ
	|	НЕ РучнаяЗагрузкаСтоковСрезПоследних.ПеренесенВЧистыйСток
	|	И НЕ РучнаяЗагрузкаСтоковСрезПоследних.ПеренесеноВЧистыйСток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИнфДляГуидов.Контейнер КАК Контейнер,
	|	ВТ_ИнфДляГуидов.ДатаОперации КАК ДатаОперации,
	|	ВТ_ИнфДляГуидов.Терминал КАК Терминал,
	|	ВТ_ИнфДляГуидов.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИнфДляГуидов.Состояние) = ТИП(БУЛЕВО)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ИнфДляГуидов.Состояние = ИСТИНА
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ИнфДляГуидов.Состояние
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	ВТ_ИнфДляГуидов КАК ВТ_ИнфДляГуидов";
	
	мСобств = Новый Массив;
	мСобств.Добавить(Перечисления.ВариантыСобственности.Спот);
	мСобств.Добавить(Перечисления.ВариантыСобственности.СпотДоплатный);
	
	Запрос.УстановитьПараметр("Вывоз", Справочники.ОперацииСВагонами.ВывозКонтейнераСКонтПункта);
	Запрос.УстановитьПараметр("Завоз", Справочники.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт);
	Запрос.УстановитьПараметр("тек_СобственностьКТК", мСобств);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеСТерминала = РезультатЗапроса[8].Выбрать();
	ВыборкаДетальныеПодтвержденныеТерминалом = РезультатЗапроса[9].Выбрать();
	ВыборкаДетальныеНеПодтвержденныеТерминалом = РезультатЗапроса[10].Выбрать();
	ВыборкаДетальныеРучнаяЗагрузка = РезультатЗапроса[11].Выбрать();
	ВыборкаДетальныеОдинаковыеСтроки = РезультатЗапроса[13].Выбрать();
	
	Объект.ДанныеИзИсточниковДляЧистогоСтока.Очистить();
	ДатаОбновленияИнформации = ТекущаяДата();
	Пока ВыборкаДетальныеСТерминала.Следующий() Цикл 
		СтрокаТЧ = Объект.ДанныеИзИсточниковДляЧистогоСтока.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеСТерминала);
		СтрокаТЧ.ДатаОбновленияИнформации = ДатаОбновленияИнформации;
	КонецЦикла;
	Пока ВыборкаДетальныеПодтвержденныеТерминалом.Следующий() Цикл
		СтрокаТЧ = Объект.ДанныеИзИсточниковДляЧистогоСтока.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеПодтвержденныеТерминалом);
		СтрокаТЧ.ДатаОбновленияИнформации = ДатаОбновленияИнформации;
	КонецЦикла;
	Пока ВыборкаДетальныеНеПодтвержденныеТерминалом.Следующий() Цикл
		СтрокаТЧ = Объект.ДанныеИзИсточниковДляЧистогоСтока.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеНеПодтвержденныеТерминалом);
		СтрокаТЧ.ДатаОбновленияИнформации = ДатаОбновленияИнформации;
	КонецЦикла;
	Пока ВыборкаДетальныеРучнаяЗагрузка.Следующий() Цикл
		СтрокаТЧ = Объект.ДанныеИзИсточниковДляЧистогоСтока.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеРучнаяЗагрузка);
		СтрокаТЧ.ДатаОбновленияИнформации = ДатаОбновленияИнформации;
	КонецЦикла;  
	
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Начало 25.06.2025
	//для источника от автоподряда переопределяем тип локации по горизонтальной связи на Терминал
	ПереопределитьТерминалУИсточниковАвтоподряда(Объект);
	//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Конец 25.06.2025
	
	//Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
	//Пока ВыборкаДетальныеОдинаковыеСтроки.Следующий() Цикл
	//	сПоиска = Новый Структура("Контейнер,ДатаОперации,Терминал,ТипОперации,Состояние",ВыборкаДетальныеОдинаковыеСтроки.Контейнер
	//	,ВыборкаДетальныеОдинаковыеСтроки.ДатаОперации
	//	,ВыборкаДетальныеОдинаковыеСтроки.Терминал
	//	,ВыборкаДетальныеОдинаковыеСтроки.Статус
	//	,ВыборкаДетальныеОдинаковыеСтроки.Состояние);
	//	
	//	УИД = Новый УникальныйИдентификатор();
	//	//НайденыеСтроки = Объект.ДанныеИзИсточниковДляЧистогоСтока.НайтиСтроки(сПоиска);
	//	НайденыеСтроки = НайтиСтрокиВТЧСТочностьДоЧаса(Объект.ДанныеИзИсточниковДляЧистогоСтока,сПоиска);
	//	Для Каждого НайденыяСтрока Из НайденыеСтроки Цикл
	//		НайденыяСтрока.УИД = УИД;	
	//	КонецЦикла;	
	//КонецЦикла;
	УстановитьУИДСтрок(Объект.ДанныеИзИсточниковДляЧистогоСтока);
	//Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
	Объект.ДанныеИзИсточниковДляЧистогоСтока.Сортировать("УИД");
	
КонецПроцедуры

Процедура УстановитьУИДСтрок(ДанныеИзИсточниковДляЧистогоСтока) Экспорт //Евросиб Шевченко А.В. US 112575 TA 124359 24.11.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧасть.Контейнер КАК Контейнер,
		|	ТабЧасть.ДатаОперации КАК ДатаОперации,
		|	ТабЧасть.Терминал КАК Терминал,
		|	ТабЧасть.ТипОперации КАК ТипОперации,
		|	ТабЧасть.Состояние КАК Состояние,
		|	ТабЧасть.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ТабЧасть
		|ИЗ
		|	&ТЗ КАК ТабЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабЧасть.Контейнер КАК Контейнер,
		|	ТабЧасть.ДатаОперации КАК ДатаОперации,
		|	ТабЧасть.Терминал КАК Терминал,
		|	ТабЧасть.ТипОперации КАК ТипОперации,
		|	ТабЧасть.Состояние КАК Состояние,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерГруппировки
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ТабЧасть КАК ТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабЧасть КАК ТабЧасть1
		|		ПО ТабЧасть.Контейнер = ТабЧасть1.Контейнер
		|			И (НАЧАЛОПЕРИОДА(ТабЧасть.ДатаОперации, ЧАС) = НАЧАЛОПЕРИОДА(ТабЧасть1.ДатаОперации, ЧАС))
		|			И ТабЧасть.Терминал = ТабЧасть1.Терминал
		|			И ТабЧасть.ТипОперации = ТабЧасть1.ТипОперации
		|			И ТабЧасть.Состояние = ТабЧасть1.Состояние
		|			И ТабЧасть.НомерСтроки <> ТабЧасть1.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧасть1.НомерСтроки КАК НомерСтроки,
		|	ВТ_Итог.НомерГруппировки КАК НомерГруппировки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЧасть КАК ТабЧасть1
		|		ПО ВТ_Итог.Контейнер = ТабЧасть1.Контейнер
		|			И (НАЧАЛОПЕРИОДА(ВТ_Итог.ДатаОперации, ЧАС) = НАЧАЛОПЕРИОДА(ТабЧасть1.ДатаОперации, ЧАС))
		|			И ВТ_Итог.Терминал = ТабЧасть1.Терминал
		|			И ВТ_Итог.ТипОперации = ТабЧасть1.ТипОперации
		|			И ВТ_Итог.Состояние = ТабЧасть1.Состояние
		|ИТОГИ ПО
		|	НомерГруппировки";
	
	Запрос.УстановитьПараметр("ТЗ", ДанныеИзИсточниковДляЧистогоСтока.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерГруппировки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерГруппировки.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаНомерГруппировки.Выбрать();
		
		УИД = Новый УникальныйИдентификатор;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура("НомерСтроки",ВыборкаДетальныеЗаписи.НомерСтроки);
			СтрокаТЧ = ДанныеИзИсточниковДляЧистогоСтока[ВыборкаДетальныеЗаписи.НомерСтроки-1];
			Если ЗначениеЗаполнено(СтрокаТЧ.УИД) Тогда
				Продолжить;
			КонецЕсли;	
			СтрокаТЧ.УИД = УИД;
		КонецЦикла;
				
	КонецЦикла;
	
	Для Каждого СТрокаТЧ Из ДанныеИзИсточниковДляЧистогоСтока Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.УИД) Тогда
			СтрокаТЧ.УИД = Новый УникальныйИдентификатор;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Функция НайтиСтрокиВТЧСТочностьДоЧаса(ТЧ,Отбор)
	МассивНайденныхСтрок = Новый Массив;
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаПодходит = Истина;
		Для Каждого КлючЗначение Из Отбор Цикл
			
			ЗначениеСтроки = СтрокаТЧ[КлючЗначение.Ключ];
			ЗначениеОтбора = КлючЗначение.Значение;
			Если КлючЗначение.Ключ = "ДатаОперации" Тогда
				ЗначениеСтроки = НачалоЧаса(ЗначениеСтроки);
				ЗначениеОтбора = НачалоЧаса(ЗначениеОтбора);
			КонецЕсли;
			Если ЗначениеСтроки <> ЗначениеОтбора Тогда
				СтрокаПодходит = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаПодходит Тогда
			МассивНайденныхСтрок.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивНайденныхСтрок;
КонецФункции
// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 22.12.2024

// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 04.02.2025
Процедура ОбработатьРасходЗагружаемогоПериода(Дата) Экспорт
	ДатаКонтроля = НачалоДня(Дата);
	
	
КонецПроцедуры
// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 04.02.2025

//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 11.03.2025
Процедура ЗаписатьБлокировкуКонтейнеров(Источник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Контейнер КАК КТК,
		|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НаличиеПодвреждения КАК НаличиеПовреждения,
		|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.ДатаОперации КАК Период,
		|	ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_СостояниеБлокировкиПриПереносеДанных
		|ИЗ
		|	Документ.ПереносДанныхВЧистыйСток.ДанныеПоОперациямЧистыйСток КАК ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток
		|ГДЕ
		|	НЕ ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.НаличиеПодвреждения В (ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.НетДанных), ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.ПустаяСсылка))
		|	И ПереносДанныхВЧистыйСтокДанныеПоОперациямЧистыйСток.Ссылка = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.КТК КАК КТК,
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.НаличиеПовреждения КАК НаличиеПовреждения,
		|	МАКСИМУМ(ВТ_СостояниеБлокировкиПриПереносеДанных.Период) КАК Период,
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_КТКкУстановкеСтатуса
		|ИЗ
		|	ВТ_СостояниеБлокировкиПриПереносеДанных КАК ВТ_СостояниеБлокировкиПриПереносеДанных
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.КТК,
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.НаличиеПовреждения,
		|	ВТ_СостояниеБлокировкиПриПереносеДанных.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КТКкУстановкеСтатуса.КТК КАК КТК,
		|	ВЫБОР
		|		КОГДА ВТ_КТКкУстановкеСтатуса.НаличиеПовреждения = ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.Поврежден)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыКТК.Заблокирован)
		|		КОГДА ВТ_КТКкУстановкеСтатуса.НаличиеПовреждения = ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.НеПоврежден)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыКТК.НеЗаблокирован)
		|	КОНЕЦ КАК Статус,
		|	""Установка статуса при проведении Переноса данных в чистый сток"" КАК Комментарий,
		|	ВТ_КТКкУстановкеСтатуса.Период КАК Период,
		|	&Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ВТ_КТКкУстановкеСтатуса.НаличиеПовреждения = ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.Поврежден)
		|			ТОГДА ИСТИНА
		|		КОГДА ВТ_КТКкУстановкеСтатуса.НаличиеПовреждения = ЗНАЧЕНИЕ(Перечисление.ТипыПоврежденияКТК.НеПоврежден)
		|			ТОГДА ЛОЖЬ
		|	КОНЕЦ КАК Поврежден,
		|	ВТ_КТКкУстановкеСтатуса.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(СостояниеБлокировкиКТКСрезПоследних.ПросроченСВВ, ЛОЖЬ) КАК ПросроченСВВ,
		|	ЕСТЬNULL(СостояниеБлокировкиКТКСрезПоследних.Другое, ЛОЖЬ) КАК Другое,
		|	СостояниеБлокировкиКТКСрезПоследних.ОписаниеПричиныДругое КАК ОписаниеПричиныДругое,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаПоврежден КАК ДатаПоврежден,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаПросроченСВВ КАК ДатаПросроченСВВ,
		|	СостояниеБлокировкиКТКСрезПоследних.ДатаДругое КАК ДатаДругое,
		|	СостояниеБлокировкиКТКСрезПоследних.СостояниеРемонта КАК СостояниеРемонта
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_КТКкУстановкеСтатуса КАК ВТ_КТКкУстановкеСтатуса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеБлокировкиКТКАктуальный.СрезПоследних(
		|				&Период,
		|				КТК В
		|					(ВЫБРАТЬ
		|						ВТ_КТКкУстановкеСтатуса.КТК КАК КТК
		|					ИЗ
		|						ВТ_КТКкУстановкеСтатуса КАК ВТ_КТКкУстановкеСтатуса)) КАК СостояниеБлокировкиКТКСрезПоследних
		|		ПО ВТ_КТКкУстановкеСтатуса.КТК = СостояниеБлокировкиКТКСрезПоследних.КТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.КТК КАК КТК,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Поврежден
		|				ИЛИ ВТ_Итог.ПросроченСВВ
		|				ИЛИ ВТ_Итог.Другое
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыКТК.Заблокирован)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатусыКТК.НеЗаблокирован)
		|	КОНЕЦ КАК Статус,
		|	&Период КАК ДатаПереноса,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		|	ВТ_Итог.Период КАК Период,
		|	ВТ_Итог.Регистратор КАК Регистратор,
		|	ВТ_Итог.Поврежден КАК Поврежден,
		|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
		|	ВТ_Итог.ПросроченСВВ КАК ПросроченСВВ,
		|	ВТ_Итог.Другое КАК Другое,
		|	ВТ_Итог.ОписаниеПричиныДругое КАК ОписаниеПричиныДругое,
		|	ВТ_Итог.ДатаПоврежден КАК ДатаПоврежден,
		|	ВТ_Итог.ДатаПросроченСВВ КАК ДатаПросроченСВВ,
		|	ВТ_Итог.ДатаДругое КАК ДатаДругое,
		|	ВТ_Итог.СостояниеРемонта КАК СостояниеРемонта
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка); 
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаКПроведению = ПроверитьСостояниеБлокировкиКТК(РезультатЗапроса.Выгрузить());
	Источник.Движения.СостояниеБлокировкиКТК.Загрузить(ТаблицаКПроведению);
	Источник.Движения.СостояниеБлокировкиКТК.Записывать = Истина;
	Источник.Движения.СостояниеБлокировкиКТК.Записать();
	
КонецПроцедуры

Функция ПроверитьСостояниеБлокировкиКТК(Коллекция)
	ТаблицаРезультат = Коллекция.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Коллекция",Коллекция);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Период КАК Период,
		|	Т.КТК КАК КТК,
		|	Т.ДатаПереноса КАК ДатаПереноса, 
		|	Т.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Набор
		|ИЗ
		|	&Коллекция КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостояниеБлокировкиКТК.КТК КАК КТК,
		|	СостояниеБлокировкиКТК.ДатаПереноса КАК ДатаПереноса,
		|	СостояниеБлокировкиКТК.Период КАК Период,
		|	СостояниеБлокировкиКТК.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДанныеБД
		|ИЗ
		|	РегистрСведений.СостояниеБлокировкиКТК КАК СостояниеБлокировкиКТК
		|ГДЕ
		|	(СостояниеБлокировкиКТК.Период, СостояниеБлокировкиКТК.КТК, СостояниеБлокировкиКТК.ДатаПереноса) В
		|			(ВЫБРАТЬ
		|				ВТ_Набор.Период КАК Период,
		|				ВТ_Набор.КТК КАК КТК,
		|				ВТ_Набор.Период КАК ДатаПереноса
		|			ИЗ
		|				ВТ_Набор КАК ВТ_Набор)
		|
		|СГРУППИРОВАТЬ ПО
		|	СостояниеБлокировкиКТК.КТК,
		|	СостояниеБлокировкиКТК.Период,
		|	СостояниеБлокировкиКТК.ДатаПереноса,
		|	СостояниеБлокировкиКТК.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Набор.Период КАК Период,
		|	ВТ_Набор.КТК КАК КТК,
		|	ВТ_Набор.ДатаПереноса КАК ДатаПереноса,
		|	ВТ_Набор.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ОбщиеДанные_Начало
		|ИЗ
		|	ВТ_Набор КАК ВТ_Набор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеБД.Период,
		|	ВТ_ДанныеБД.КТК,
		|	ВТ_ДанныеБД.ДатаПереноса,
		|	ВТ_ДанныеБД.НомерСтроки
		|ИЗ
		|	ВТ_ДанныеБД КАК ВТ_ДанныеБД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеДанные_Начало.Период КАК Период,
		|	ВТ_ОбщиеДанные_Начало.КТК КАК КТК,
		|	ВТ_ОбщиеДанные_Начало.ДатаПереноса КАК ДатаПереноса,
		|	ВТ_ОбщиеДанные_Начало.НомерСтроки КАК НомерСтроки,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТ_ОбщиеДанные
		|ИЗ
		|	ВТ_ОбщиеДанные_Начало КАК ВТ_ОбщиеДанные_Начало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеДанные.Период КАК Период,
		|	ВТ_ОбщиеДанные.КТК КАК КТК,
		|	ВТ_ОбщиеДанные.ДатаПереноса КАК ДатаПереноса,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбщиеДанные.НомерЗаписи) КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТ_РасчетДублей
		|ИЗ
		|	ВТ_ОбщиеДанные КАК ВТ_ОбщиеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбщиеДанные.Период,
		|	ВТ_ОбщиеДанные.ДатаПереноса,
		|	ВТ_ОбщиеДанные.КТК
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбщиеДанные.НомерЗаписи) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Набор.Период КАК Период,
		|	ВТ_Набор.КТК КАК КТК,
		|	ВТ_Набор.ДатаПереноса КАК ДатаПереноса,
		|	ВТ_Набор.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Набор КАК ВТ_Набор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетДублей КАК ВТ_РасчетДублей
		|		ПО ВТ_Набор.Период = ВТ_РасчетДублей.Период
		|			И ВТ_Набор.КТК = ВТ_РасчетДублей.КТК 
		|			И ВТ_Набор.ДатаПереноса = ВТ_РасчетДублей.ДатаПереноса 
		|ГДЕ
		|	ВТ_РасчетДублей.НомерЗаписи ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетДублей.Период КАК Период,
		|	ВТ_РасчетДублей.КТК КАК КТК,
		|	ВТ_РасчетДублей.ДатаПереноса КАК ДатаПереноса,
		|	ВТ_РасчетДублей.НомерЗаписи КАК НомерЗаписи
		|ИЗ
		|	ВТ_РасчетДублей КАК ВТ_РасчетДублей";
	                                                                         
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаУспех = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выгрузить();
	ТаблицаОшибок = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить();
	
	Для Каждого СтрокаУспех Из ТаблицаУспех Цикл
		Отбор = Новый Структура("НомерСтроки,Период,КТК,ДатаПереноса");
		ЗаполнитьЗначенияСвойств(Отбор,СтрокаУспех);
		НайденныеСтроки = Коллекция.НайтиСтроки(Отбор); 
		Если НайденныеСтроки.Количество() Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(),НайденныеСтроки[0]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		Ошибка = СтрШаблон("Обнаружена не уникальная запись Период:%1 КТК:%2 ДатаПереноса:%3",СтрокаОшибки.Период,СтрокаОшибки.КТК,СтрокаОшибки.ДатаПереноса);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		ЗаписьЖурналаРегистрации("ПроведениеПереносЧистыйСток_СостояниеБлокировкиКТК",,,,Ошибка);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
КонецФункции

//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 25.06.2025
Функция ПереопределитьТерминалУИсточниковАвтоподряда(Объект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Состояние КАК Состояние,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации КАК ТипОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВТ_ВсеИсточники
		|ИЗ
		|	&ДанныеИзИсточниковДляЧистогоСтока КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеИсточники.Контейнер КАК Контейнер,
		|	ВТ_ВсеИсточники.Терминал КАК Терминал,
		|	ВТ_ВсеИсточники.Состояние КАК Состояние,
		|	ВТ_ВсеИсточники.ДатаОперации КАК ДатаОперации,
		|	ВТ_ВсеИсточники.ТипОперации КАК ТипОперации
		|ПОМЕСТИТЬ ВТ_ОбрабатываемыеСтроки
		|ИЗ
		|	ВТ_ВсеИсточники КАК ВТ_ВсеИсточники
		|ГДЕ
		|	ВЫРАЗИТЬ(ВТ_ВсеИсточники.Терминал КАК Справочник.Локации).Тип <> ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|	И ВТ_ВсеИсточники.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|	И ВТ_ВсеИсточники.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ЖДСтанция,
		|	ГоризонтальныеСвязиЛокаций.Терминал КАК Терминал,
		|	ВложенныйЗапрос.КоличествоТерминалов КАК КоличествоТерминалов
		|ПОМЕСТИТЬ ВТ_ТерминалыСтанций
		|ИЗ
		|	ВТ_ОбрабатываемыеСтроки КАК ВТ_ОбрабатываемыеСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
		|		ПО ВТ_ОбрабатываемыеСтроки.Терминал = ГоризонтальныеСвязиЛокаций.ЖДСтанция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ЖДСтанция,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГоризонтальныеСвязиЛокаций.Терминал) КАК КоличествоТерминалов
		|		ИЗ
		|			ВТ_ОбрабатываемыеСтроки КАК ВТ_ОбрабатываемыеСтроки
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
		|				ПО ВТ_ОбрабатываемыеСтроки.Терминал = ГоризонтальныеСвязиЛокаций.ЖДСтанция
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГоризонтальныеСвязиЛокаций.ЖДСтанция) КАК ВложенныйЗапрос
		|		ПО (ВложенныйЗапрос.ЖДСтанция = ВТ_ОбрабатываемыеСтроки.Терминал)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбрабатываемыеСтроки.Контейнер КАК Контейнер,
		|	ВТ_ОбрабатываемыеСтроки.Состояние КАК Состояние,
		|	ВТ_ОбрабатываемыеСтроки.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОбрабатываемыеСтроки.ТипОперации КАК ТипОперации,
		|	ВТ_ВсеИсточники.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ВсеИсточники.Терминал КАК Терминал,
		|	ВТ_ОбрабатываемыеСтроки.Терминал КАК Терминал1
		|ПОМЕСТИТЬ ВТ_ПодборТерминалаИзПрочихДанных
		|ИЗ
		|	ВТ_ВсеИсточники КАК ВТ_ВсеИсточники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбрабатываемыеСтроки КАК ВТ_ОбрабатываемыеСтроки
		|		ПО ВТ_ВсеИсточники.Контейнер = ВТ_ОбрабатываемыеСтроки.Контейнер
		|			И ВТ_ВсеИсточники.Состояние = ВТ_ОбрабатываемыеСтроки.Состояние
		|			И ВТ_ВсеИсточники.ТипОперации = ВТ_ОбрабатываемыеСтроки.ТипОперации
		|			И (РАЗНОСТЬДАТ(ВТ_ВсеИсточники.ДатаОперации, ВТ_ОбрабатываемыеСтроки.ДатаОперации, ДЕНЬ) <= 1
		|					И РАЗНОСТЬДАТ(ВТ_ВсеИсточники.ДатаОперации, ВТ_ОбрабатываемыеСтроки.ДатаОперации, ДЕНЬ) >= 0
		|				ИЛИ РАЗНОСТЬДАТ(ВТ_ОбрабатываемыеСтроки.ДатаОперации, ВТ_ВсеИсточники.ДатаОперации, ДЕНЬ) <= 1
		|					И РАЗНОСТЬДАТ(ВТ_ОбрабатываемыеСтроки.ДатаОперации, ВТ_ВсеИсточники.ДатаОперации, ДЕНЬ) >= 0)
		|ГДЕ
		|	ВТ_ВсеИсточники.ИсточникДобавленияДанных <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|	И ВЫРАЗИТЬ(ВТ_ВсеИсточники.Терминал КАК Справочник.Локации).Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОбрабатываемыеСтроки.Контейнер КАК Контейнер,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ПодборТерминалаИзПрочихДанных.Терминал ЕСТЬ NULL
		|			ТОГДА ВТ_ПодборТерминалаИзПрочихДанных.Терминал
		|		КОГДА ВТ_ТерминалыСтанций.КоличествоТерминалов = 1
		|			ТОГДА ВТ_ТерминалыСтанций.Терминал
		|		ИНАЧЕ ""УдалитьСтроку""
		|	КОНЕЦ КАК Терминал,
		|	ВТ_ОбрабатываемыеСтроки.Состояние КАК Состояние,
		|	ВТ_ОбрабатываемыеСтроки.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОбрабатываемыеСтроки.ТипОперации КАК ТипОперации
		|ИЗ
		|	ВТ_ОбрабатываемыеСтроки КАК ВТ_ОбрабатываемыеСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодборТерминалаИзПрочихДанных КАК ВТ_ПодборТерминалаИзПрочихДанных
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТерминалыСтанций КАК ВТ_ОграничениеНайденныхТерминалов
		|			ПО (ВТ_ОграничениеНайденныхТерминалов.ЖДСтанция = ВТ_ПодборТерминалаИзПрочихДанных.Терминал1)
		|				И (ВТ_ОграничениеНайденныхТерминалов.Терминал = ВТ_ПодборТерминалаИзПрочихДанных.Терминал)
		|		ПО (ВТ_ПодборТерминалаИзПрочихДанных.Контейнер = ВТ_ОбрабатываемыеСтроки.Контейнер)
		|			И (ВТ_ПодборТерминалаИзПрочихДанных.Состояние = ВТ_ОбрабатываемыеСтроки.Состояние)
		|			И (ВТ_ПодборТерминалаИзПрочихДанных.ДатаОперации = ВТ_ОбрабатываемыеСтроки.ДатаОперации)
		|			И (ВТ_ПодборТерминалаИзПрочихДанных.ТипОперации = ВТ_ОбрабатываемыеСтроки.ТипОперации)
		|			И (ВТ_ПодборТерминалаИзПрочихДанных.Терминал1 = ВТ_ОбрабатываемыеСтроки.Терминал)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТерминалыСтанций КАК ВТ_ТерминалыСтанций
		|		ПО ВТ_ОбрабатываемыеСтроки.Терминал = ВТ_ТерминалыСтанций.ЖДСтанция";
	Запрос.УстановитьПараметр("ДанныеИзИсточниковДляЧистогоСтока", Объект.ДанныеИзИсточниковДляЧистогоСтока.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СтруктураПоискаСтроки = Новый Структура("Контейнер,Состояние,ДатаОперации,ТипОперации");
	Пока Выборка.Следующий() Цикл         
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, Выборка);
		КорректируемыеСтроки = Объект.ДанныеИзИсточниковДляЧистогоСтока.НайтиСтроки(СтруктураПоискаСтроки);    
		Для каждого КорректируемаяСтрока Из КорректируемыеСтроки Цикл
			Если Выборка.Терминал = "УдалитьСтроку" Тогда
				Объект.ДанныеИзИсточниковДляЧистогоСтока.Удалить(КорректируемаяСтрока);	
			Иначе
				КорректируемаяСтрока.Терминал = Выборка.Терминал;
			КонецЕсли;
		КонецЦикла; 
		
	КонецЦикла;

КонецФункции 

//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 114167 22.07.2025
Процедура ДобавитьТехническуюЗаписьПриходаПоОтрицательнымОстаткамПоИнформацииАвтоподрядчиков(Объект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_ДанныеИзИсточников.Контейнер КАК Контейнер,
		|	ВТ_ДанныеИзИсточников.Терминал КАК Терминал,
		|	ВТ_ДанныеИзИсточников.ДатаОперации КАК ДатаОперации,
		|	ВТ_ДанныеИзИсточников.Количество КАК Количество,
		|	ВТ_ДанныеИзИсточников.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеИзИсточников.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных
		|ПОМЕСТИТЬ ВТ_СтрокиМестонахождения
		|ИЗ
		|	&МестонахождениеЧистыйСток КАК ВТ_ДанныеИзИсточников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиМестонахождения.Контейнер КАК Контейнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СтрокиМестонахождения.НомерСтроки) КАК НомерСтроки,
		|	ВТ_СтрокиМестонахождения.ДатаОперации КАК ДатаОперации
		|ПОМЕСТИТЬ ВТ_НеПереносимВМестонахождение
		|ИЗ
		|	ВТ_СтрокиМестонахождения КАК ВТ_СтрокиМестонахождения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтрокиМестонахождения.Контейнер,
		|	ВТ_СтрокиМестонахождения.ДатаОперации
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СтрокиМестонахождения.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиМестонахождения.Контейнер КАК Контейнер,
		|	ВТ_СтрокиМестонахождения.Терминал КАК Терминал,
		|	СУММА(ВТ_СтрокиМестонахождения.Количество) КАК Количество
		|ПОМЕСТИТЬ Вт_ОстаткиПоТерминалам
		|ИЗ
		|	ВТ_СтрокиМестонахождения КАК ВТ_СтрокиМестонахождения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеПереносимВМестонахождение КАК ВТ_НеПереносимВМестонахождение
		|		ПО ВТ_СтрокиМестонахождения.Контейнер = ВТ_НеПереносимВМестонахождение.Контейнер
		|			И (ВТ_НеПереносимВМестонахождение.ДатаОперации = ВТ_СтрокиМестонахождения.ДатаОперации)
		|ГДЕ
		|	ВТ_НеПереносимВМестонахождение.Контейнер ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтрокиМестонахождения.Контейнер,
		|	ВТ_СтрокиМестонахождения.Терминал
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.Контейнер,
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.Терминал,
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.КоличествоКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.МестонахождениеЧистыйСток.ОстаткиИОбороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			(Контейнер, Терминал) В
		|				(ВЫБРАТЬ
		|					Т.Контейнер,
		|					Т.Терминал
		|				ИЗ
		|					ВТ_СтрокиМестонахождения КАК Т)) КАК МестонахождениеЧистыйСтокОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСток
		|		ПО МестонахождениеЧистыйСтокОстаткиИОбороты.Период = МестонахождениеЧистыйСток.Период
		|			И (МестонахождениеЧистыйСток.Контейнер = МестонахождениеЧистыйСтокОстаткиИОбороты.Контейнер)
		|			И (МестонахождениеЧистыйСток.Терминал = МестонахождениеЧистыйСтокОстаткиИОбороты.Терминал)
		|ГДЕ
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.Регистратор <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ОстаткиПоТерминалам.Контейнер КАК Контейнер,
		|	Вт_ОстаткиПоТерминалам.Терминал КАК Терминал,
		|	СУММА(Вт_ОстаткиПоТерминалам.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОтрицательныеОстатки
		|ИЗ
		|	Вт_ОстаткиПоТерминалам КАК Вт_ОстаткиПоТерминалам
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ОстаткиПоТерминалам.Контейнер,
		|	Вт_ОстаткиПоТерминалам.Терминал
		|
		|ИМЕЮЩИЕ
		|	СУММА(Вт_ОстаткиПоТерминалам.Количество) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОтрицательныеОстатки.Контейнер КАК Контейнер,
		|	ВТ_ОтрицательныеОстатки.Терминал КАК Терминал,
		|	ВТ_ОтрицательныеОстатки.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ПоследнийРасходОтАвтоперевоза
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_СтрокиМестонахождения.Контейнер КАК Контейнер,
		|		ВТ_СтрокиМестонахождения.Терминал КАК Терминал,
		|		МАКСИМУМ(ВТ_СтрокиМестонахождения.ДатаОперации) КАК ДатаОперации
		|	ИЗ
		|		ВТ_СтрокиМестонахождения КАК ВТ_СтрокиМестонахождения
		|	ГДЕ
		|		ВТ_СтрокиМестонахождения.Количество = -1
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_СтрокиМестонахождения.Контейнер,
		|		ВТ_СтрокиМестонахождения.Терминал) КАК ДатаОперацииПоследнегоРасхода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиМестонахождения КАК ВТ_СтрокиМестонахождения
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтрицательныеОстатки КАК ВТ_ОтрицательныеОстатки
		|			ПО (ВТ_ОтрицательныеОстатки.Контейнер = ВТ_СтрокиМестонахождения.Контейнер)
		|				И (ВТ_ОтрицательныеОстатки.Терминал = ВТ_СтрокиМестонахождения.Терминал)
		|		ПО ДатаОперацииПоследнегоРасхода.Контейнер = ВТ_СтрокиМестонахождения.Контейнер
		|			И ДатаОперацииПоследнегоРасхода.Терминал = ВТ_СтрокиМестонахождения.Терминал
		|			И ДатаОперацииПоследнегоРасхода.ДатаОперации = ВТ_СтрокиМестонахождения.ДатаОперации
		|			И (ВТ_СтрокиМестонахождения.Количество = -1)
		|ГДЕ
		|	ВТ_СтрокиМестонахождения.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ИнформацияОтАвтоподрядчиков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ОстаткиПоТерминалам.Контейнер КАК Контейнер,
		|	Вт_ОстаткиПоТерминалам.Терминал КАК Терминал,
		|	СУММА(Вт_ОстаткиПоТерминалам.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ПоложительныеОстатки
		|ИЗ
		|	Вт_ОстаткиПоТерминалам КАК Вт_ОстаткиПоТерминалам
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ОстаткиПоТерминалам.Контейнер,
		|	Вт_ОстаткиПоТерминалам.Терминал
		|
		|ИМЕЮЩИЕ
		|	СУММА(Вт_ОстаткиПоТерминалам.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоложительныеОстатки.Контейнер КАК Контейнер,
		|	ВТ_ПоложительныеОстатки.Терминал КАК Терминал,
		|	Минимум(ВТ_СтрокиМестонахождения.ДатаОперации) КАК ДатаОперации,
		|	Минимум(ВТ_СтрокиМестонахождения.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_СтрокиАвтоподрядчиковПриход
		|ИЗ
		|	ВТ_ПоложительныеОстатки КАК ВТ_ПоложительныеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиМестонахождения КАК ВТ_СтрокиМестонахождения
		|		ПО (ВТ_ПоложительныеОстатки.Контейнер = ВТ_СтрокиМестонахождения.Контейнер)
		|			И (ВТ_ПоложительныеОстатки.Терминал = ВТ_СтрокиМестонахождения.Терминал)
		|ГДЕ
		|	ВТ_СтрокиМестонахождения.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоложительныеОстатки.Контейнер,
		|	ВТ_ПоложительныеОстатки.Терминал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(МестонахождениеЧистыйСтокОстаткиИОбороты.Период) КАК ПериодСледующегоВывоза,
		|	ВТ_СтрокиАвтоподрядчиковПриход.Контейнер КАК Контейнер,
		|	ВТ_СтрокиАвтоподрядчиковПриход.Терминал КАК Терминал,
		|	ВТ_СтрокиАвтоподрядчиковПриход.ДатаОперации КАК ДатаОперации,
		|	ВТ_СтрокиАвтоподрядчиковПриход.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ПоискСледующегоВывозаПоЗавозу
		|ИЗ
		|	ВТ_СтрокиАвтоподрядчиковПриход КАК ВТ_СтрокиАвтоподрядчиковПриход
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.ОстаткиИОбороты(
		|				,
		|				,
		|				Запись,
		|				,
		|				(Контейнер, Терминал) В
		|					(ВЫБРАТЬ
		|						Т.Контейнер,
		|						Т.Терминал
		|					ИЗ
		|						ВТ_СтрокиАвтоподрядчиковПриход КАК Т)) КАК МестонахождениеЧистыйСтокОстаткиИОбороты
		|		ПО ВТ_СтрокиАвтоподрядчиковПриход.Контейнер = МестонахождениеЧистыйСтокОстаткиИОбороты.Контейнер
		|			И ВТ_СтрокиАвтоподрядчиковПриход.Терминал = МестонахождениеЧистыйСтокОстаткиИОбороты.Терминал
		|			И (МестонахождениеЧистыйСтокОстаткиИОбороты.Период > ВТ_СтрокиАвтоподрядчиковПриход.ДатаОперации)
		|ГДЕ
		|	МестонахождениеЧистыйСтокОстаткиИОбороты.КоличествоРасход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтрокиАвтоподрядчиковПриход.Контейнер,
		|	ВТ_СтрокиАвтоподрядчиковПриход.Терминал,
		|	ВТ_СтрокиАвтоподрядчиковПриход.ДатаОперации,
		|	ВТ_СтрокиАвтоподрядчиковПриход.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоискСледующегоВывозаПоЗавозу.Контейнер КАК Контейнер,
		|	ВТ_ПоискСледующегоВывозаПоЗавозу.Терминал КАК Терминал,
		|	ВТ_ПоискСледующегоВывозаПоЗавозу.ПериодСледующегоВывоза КАК ИсходнаяДатаОперации,
		|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись) КАК ИсточникДобавленияДанных,
		|	МестонахождениеЧистыйСток.ВидДвижения КАК ВидДвижения,
		|	-МестонахождениеЧистыйСток.Количество КАК Количество,
		|	МестонахождениеЧистыйСток.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ТехническаяЗаписьЗавозаКСторно
		|ИЗ
		|	ВТ_ПоискСледующегоВывозаПоЗавозу КАК ВТ_ПоискСледующегоВывозаПоЗавозу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСток
		|		ПО ВТ_ПоискСледующегоВывозаПоЗавозу.Терминал = МестонахождениеЧистыйСток.Терминал
		|			И (МестонахождениеЧистыйСток.Контейнер = ВТ_ПоискСледующегоВывозаПоЗавозу.Контейнер)
		|			И ВТ_ПоискСледующегоВывозаПоЗавозу.ПериодСледующегоВывоза > МестонахождениеЧистыйСток.Период
		|			И ВТ_ПоискСледующегоВывозаПоЗавозу.ДатаОперации < МестонахождениеЧистыйСток.Период
		|ГДЕ
		|	МестонахождениеЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТ_ПоследнийРасходОтАвтоперевоза.Контейнер КАК Контейнер,
		|	ВТ_ПоследнийРасходОтАвтоперевоза.Терминал КАК Терминал,
		|	-ВТ_ПоследнийРасходОтАвтоперевоза.Количество КАК Количество,
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации), СЕКУНДА, -1) КАК ДатаОперации,
		|	МАКСИМУМ(ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации) КАК ИсходнаяДатаОперации,
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации), СЕКУНДА, -1) КАК Период,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаВнесенияДанных КАК ДатаДобавленияДанных,
		|	ВЫБОР
		|		КОГДА ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Состояние
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
		|	КОНЕЦ КАК Состояние,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись) КАК ИсточникДобавленияДанных,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации КАК ДатаОперацииРасхода
		|ИЗ
		|	ВТ_ПоследнийРасходОтАвтоперевоза КАК ВТ_ПоследнийРасходОтАвтоперевоза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СрезПоследних(
		|				,
		|				(Контейнер, Терминал) В
		|						(ВЫБРАТЬ
		|							Т.Контейнер,
		|							Т.Терминал
		|						ИЗ
		|							ВТ_ОтрицательныеОстатки КАК Т)
		|					И Статус = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ВывозКонтейнераСКонтПункта)) КАК ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних
		|		ПО ВТ_ПоследнийРасходОтАвтоперевоза.Контейнер = ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Контейнер
		|			И ВТ_ПоследнийРасходОтАвтоперевоза.Терминал = ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Терминал
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоследнийРасходОтАвтоперевоза.Контейнер,
		|	ВТ_ПоследнийРасходОтАвтоперевоза.Терминал,
		|	ВТ_ПоследнийРасходОтАвтоперевоза.Количество,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаВнесенияДанных,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.КлючАналитикиПеревозки,
		|	ВЫБОР
		|		КОГДА ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.Состояние
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Груженый)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияКТК.Порожний)
		|	КОНЕЦ,
		|	ИнформацияОтАвтоподрядчиковПоТерминаламСрезПоследних.ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.Контейнер КАК Контейнер,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.Терминал КАК Терминал,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.ИсходнаяДатаОперации КАК ИсходнаяДатаОперации,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.ВидДвижения КАК ВидДвижения,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.Количество КАК Количество,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.Период КАК ДатаОперации,
		|	ВТ_ТехническаяЗаписьЗавозаКСторно.Период КАК Период,
		|	ИСТИНА КАК Сторно
		|ИЗ
		|	ВТ_ТехническаяЗаписьЗавозаКСторно КАК ВТ_ТехническаяЗаписьЗавозаКСторно";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("МестонахождениеЧистыйСток", Объект.МестонахождениеЧистыйСток.Выгрузить());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСозданиеТехническогоЗавоза = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	
	Пока ВыборкаСозданиеТехническогоЗавоза.Следующий() Цикл
		// Добавляем техническую запись прихода для исключения отрицательных остатков
		СтрокаМестонахождение = Объект.МестонахождениеЧистыйСток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМестонахождение, ВыборкаСозданиеТехническогоЗавоза);   
		СтрокаМестонахождение.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
		
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(ВыборкаСозданиеТехническогоЗавоза.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(ВыборкаСозданиеТехническогоЗавоза.ДатаОперацииРасхода);
		НаборИсточника.Отбор.Терминал.Установить(ВыборкаСозданиеТехническогоЗавоза.Терминал);
		НаборИсточника.Прочитать();  
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если Не ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда 
				СправочникОшибки = СоздатьСправочникОшибки(Перечисления.ОшибкиЗагрузкиСтоков.ТерминалНеСообщилОВвозеКТК, Ложь);
				СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов = СправочникОшибки;
				НаборИсточника.ОбменДанными.Загрузка = Истина;
				НаборИсточника.Записать();
			Иначе
				ДополнитьСправочникОшибки(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов, Перечисления.ОшибкиЗагрузкиСтоков.ТерминалНеСообщилОВвозеКТК, Ложь);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	ВыборкаСторноТехническогоЗавоза = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	
	Пока ВыборкаСторноТехническогоЗавоза.Следующий() Цикл
		// Добавляем техническую запись прихода для исключения отрицательных остатков
		СтрокаМестонахождение = Объект.МестонахождениеЧистыйСток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМестонахождение, ВыборкаСторноТехническогоЗавоза);   
		СтрокаМестонахождение.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
	КонецЦикла;  
	
	Объект.МестонахождениеЧистыйСток.Сортировать("Количество Убыв");

КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 105060 ТА 115174 Начало 18.08.2025
Процедура УбратьСторнированиеПодтвержденныхСтрокАвтоподрядчиков(ДанныеИзИсточников)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Контейнер КАК Контейнер,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Терминал КАК Терминал,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.Состояние КАК Состояние,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ДатаОперации КАК ДатаОперации,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока.ТипОперации КАК ТипОперации
		|ПОМЕСТИТЬ ВТ_ВходящиеДанныеТерминалов
		|ИЗ
		|	&ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока КАК ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестонахождениеЧистыйСтокОбороты.Регистратор КАК Регистратор,
		|	МестонахождениеЧистыйСток.Период КАК ДатаОперации,
		|	МестонахождениеЧистыйСток.Контейнер КАК Контейнер,
		|	МестонахождениеЧистыйСток.Терминал КАК Терминал
		|ИЗ
		|	ВТ_ВходящиеДанныеТерминалов КАК ВТ_ВходящиеДанныеТерминалов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				(Контейнер, Терминал) В
		|					(ВЫБРАТЬ
		|						Т.Контейнер,
		|						Т.Терминал
		|					ИЗ
		|						ВТ_ВходящиеДанныеТерминалов КАК Т)) КАК МестонахождениеЧистыйСтокОбороты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестонахождениеЧистыйСток КАК МестонахождениеЧистыйСток
		|			ПО (МестонахождениеЧистыйСток.Регистратор = МестонахождениеЧистыйСтокОбороты.Регистратор)
		|				И МестонахождениеЧистыйСтокОбороты.Контейнер = МестонахождениеЧистыйСток.Контейнер
		|				И МестонахождениеЧистыйСтокОбороты.Терминал = МестонахождениеЧистыйСток.Терминал
		|		ПО ВТ_ВходящиеДанныеТерминалов.Контейнер = МестонахождениеЧистыйСтокОбороты.Контейнер
		|			И ВТ_ВходящиеДанныеТерминалов.Терминал = МестонахождениеЧистыйСтокОбороты.Терминал
		|			И (ВЫБОР
		|				КОГДА ВТ_ВходящиеДанныеТерминалов.ТипОперации = ЗНАЧЕНИЕ(Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт)
		|					ТОГДА МестонахождениеЧистыйСтокОбороты.КоличествоПриход = -1
		|				ИНАЧЕ МестонахождениеЧистыйСтокОбороты.КоличествоРасход = -1
		|			КОНЕЦ)
		|			И (ВТ_ВходящиеДанныеТерминалов.ДатаОперации МЕЖДУ ДОБАВИТЬКДАТЕ(МестонахождениеЧистыйСтокОбороты.Период, ЧАС, -1) И ДОБАВИТЬКДАТЕ(МестонахождениеЧистыйСтокОбороты.Период, ЧАС, 1))
		|ГДЕ
		|	МестонахождениеЧистыйСток.ИсточникДобавленияДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхЧистогоСтока.ТехническаяЗапись)
		|	И ТИПЗНАЧЕНИЯ(МестонахождениеЧистыйСтокОбороты.Регистратор) = ЗНАЧЕНИЕ(Документ.РедактированиеДанныхЧистогоСтока)";
	
	Запрос.УстановитьПараметр("ПереносДанныхВЧистыйСтокДанныеИзИсточниковДляЧистогоСтока", ДанныеИзИсточников);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокРедактирования = Выборка.Регистратор.ПолучитьОбъект(); 
		Для каждого РегистрДвижения Из ДокРедактирования.Движения Цикл
			Если ТипЗнч(РегистрДвижения) = Тип("РегистрНакопленияНаборЗаписей.МестонахождениеЧистыйСток") Тогда
				РегистрДвижения.Записать();
			КонецЕсли;	
		КонецЦикла;  
		ДокРедактирования.Движения.МестонахождениеЧистыйСток.Записывать = Истина;
		ДокРедактирования.Записать();   
		
		//в РС ИнформацияОтАвтоподрядчиковПоТерминалам делаем пометку, что не требуется подтверждение
		НЗ = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НЗ.Отбор.ДатаОперации.Установить(Выборка.ДатаОперации); 
		НЗ.Отбор.Терминал.Установить(Выборка.Терминал);
		НЗ.Отбор.Контейнер.Установить(Выборка.Контейнер);   
		НЗ.Прочитать();
		Для каждого СтрокаНЗ Из НЗ Цикл
			СтрокаНЗ.ТребуетсяПодтверждениеОперацииАвтоподрядчика = Ложь;
		КонецЦикла;
		НЗ.ОбменДанными.Загрузка = Истина;
		НЗ.Записать();
		
		//Убираем ошибку при загрузке информации от терминалов из записей от автоперевозчика
		НаборИсточника = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьНаборЗаписей();
		НаборИсточника.Отбор.Контейнер.Установить(Выборка.Контейнер);
		НаборИсточника.Отбор.ДатаОперации.Установить(Выборка.ДатаОперации);
		НаборИсточника.Отбор.Терминал.Установить(Выборка.Терминал);
		НаборИсточника.Прочитать();
		
		Если НаборИсточника.Количество() = 1 Тогда
			СтрокаИсточника = НаборИсточника[0];  
			Если ЗначениеЗаполнено(СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов) Тогда 
				ОбъектОшибки = СтрокаИсточника.ОшибкиПриЗагрузкеИнформацииОтТерминалов.ПолучитьОбъект();  
				ОбъектОшибки.ВсеОшибкиИсправлены = Истина;   
				Для каждого СтрОшибки Из ОбъектОшибки.ОшибкиПриЗагрузке Цикл
					СтрОшибки.Комментарий = "Запись подтверждена информацией от терминала";
				КонецЦикла;
				ОбъектОшибки.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

