
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.ПереносДанныхВЧистыйСток.ЗаполнитьДвиженияДокумента(ЭтотОбъект);
	ДанныеДляОтметки = ДанныеИзИсточниковДляЧистогоСтока.Выгрузить(,"Контейнер,Терминал,ДатаОперации,ИсточникДобавленияДанных");
	ДанныеДляОтметки.Свернуть("Контейнер,Терминал,ДатаОперации,ИсточникДобавленияДанных");
	//ЗаписатьДвижения();
	Документы.ПереносДанныхВЧистыйСток.ОтметитьДанныеЗагруженными(ДанныеДляОтметки);
КонецПроцедуры

Процедура ЗаписатьДвижения()
	Движения.ДанныеПоОперациямЧистыйСток.Записать();
	Движения.МестонахождениеЧистыйСток.Записать();
	Движения.СобственникиКонтейнеров.Записать(); 
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Начало 11.03.2025
	Движения.СостояниеБлокировкиКТК.Записать();
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Окончание 11.03.2025
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ПереносДанныхВЧистыйСток.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ПереносДанныхВЧистыйСток КАК ПереносДанныхВЧистыйСток
	//	|ГДЕ
	//	|	ПереносДанныхВЧистыйСток.Проведен
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Ссылка УБЫВ";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Если Выборка.Ссылка <> Ссылка Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Можно отменять проведение только последнего документа!",,,,Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
