#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Евросиб Фролов (16.02.2022 Task №46605
	
	// Список типов локаций содержит список только разрешенных типов локаций.
	// Добавлено для того, чтобы организовать выбор только тех мультилокаций, 
	// в составе которых присутствуют только указанные типы локаций и отсутствуют какие-л. другие.
    СписокТиповЛокаций = Параметры.СписокТиповЛокаций;
	
	// Мультилокация родителя используется для отбора в списке только тех мультилокаций,
	// в составе которых есть только локации подчиненные локациям мультилокации родителя.
	МультилокацияРодителей = Параметры.МультилокацияРодителей;
	
	Если СписокТиповЛокаций.Количество() > 0
		ИЛИ ЗначениеЗаполнено(МультилокацияРодителей) Тогда
		ЗаполнитьТекстЗапросаДинамическогоСписка();
		Список.Параметры.УстановитьЗначениеПараметра("СписокТипов", СписокТиповЛокаций);
		Если ЗначениеЗаполнено(МультилокацияРодителей) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("МультилокацияРодителей", МультилокацияРодителей);
		КонецЕсли;	
	КонецЕсли;		
	// Евросиб Фролов)
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 ) 
 	//Евросиб - АСуслов 04.07.2023 17:55:01 #67501 локации
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации
	

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	// Евросиб Фролов (16.02.2022 Task №46605
	// Если заполнена мультилокация родителя, то для выбора локаций в форме добавления
	// необходимо отобразить только те локации, родителями которых являются локации переданной мультилокаци.
	Если ЗначениеЗаполнено(МультилокацияРодителей) Тогда
		
		Отказ = Истина;		
		
		РодительЛокации = Новый СписокЗначений;
		РодительЛокации.ЗагрузитьЗначения(СоставМультилокации(МультилокацияРодителей));
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РодительЛокации", РодительЛокации);
		
		Если СписокТиповЛокаций.Количество() > 0 Тогда
			ПараметрыФормыВыбора.Вставить("ТипЛокации", СписокТиповЛокаций);
		КонецЕсли;		
		
		ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормыВыбора, Элемент);
		
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТекстЗапросаДинамическогоСписка()
    // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента

	// Меняем текст запроса списка, чтобы для выбора предложить только те мультилокации,
	// в которых присутствуют только указанные в списке "Список типов локаций" типы локаций.
	// Запрос меняем через процедуру, чтобы не замедлять открытие формы выбора для случаев, когда такой отбор не требуется.
	Список.ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МультилокацииЛокации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втПодходящиеМультилокации
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|
	|СГРУППИРОВАТЬ ПО
	|	МультилокацииЛокации.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА МультилокацииЛокации.Локация.Тип В (&СписокТипов)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА";
	
	Если ЗначениеЗаполнено(МультилокацияРодителей) Тогда
		// Если указана мультилокация родителя, то отображаем только те мультилокации,
		// в составе которых есть только локации подчиненные локациям мультилокации родителя.
		Список.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультилокацииЛокации.Локация КАК Локация
		|ПОМЕСТИТЬ втРодители
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Ссылка = &МультилокацияРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Локации.Ссылка КАК Локация
		|ПОМЕСТИТЬ втЛокации
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Родитель В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				втРодители.Локация
		|			ИЗ
		|				втРодители КАК втРодители)
		|	И Локации.Тип В (&СписокТипов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультилокацииЛокации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втПодходящиеМультилокации
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЛокации КАК втЛокации
		|		ПО МультилокацииЛокации.Локация = втЛокации.Локация
		|
		|СГРУППИРОВАТЬ ПО
		|	МультилокацииЛокации.Ссылка
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ВЫБОР
		|			КОГДА втЛокации.Локация ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) = ИСТИНА";
	КонецЕсли;	
	
	Список.ТекстЗапроса = Список.ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Список.ТекстЗапроса = Список.ТекстЗапроса +
	"ВЫБРАТЬ
	|	СправочникМультилокации.Ссылка КАК Ссылка,
	|	СправочникМультилокации.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникМультилокации.Код КАК Код,
	|	СправочникМультилокации.Наименование КАК Наименование,
	|	СправочникМультилокации.Предопределенный КАК Предопределенный,
	|	СправочникМультилокации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Мультилокации КАК СправочникМультилокации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПодходящиеМультилокации КАК втПодходящиеМультилокации
	|		ПО СправочникМультилокации.Ссылка = втПодходящиеМультилокации.Ссылка";
	// Евросиб Фролов)
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставМультилокации(Мультилокация)
	// Евросиб Фролов (16.02.2022 Task №46605
	Возврат Справочники.Мультилокации.СоставМультилокации(Мультилокация);
	// Евросиб Фролов)
КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	// Евросиб Фролов (16.02.2022 Task №46605
	Если ЗначениеЗаполнено(МультилокацияРодителей)
		Или СписокТиповЛокаций.Количество() > 0 Тогда
		Отказ = Истина;
		
		СсылкаНаЭлементСправочника = Элементы.Список.ТекущаяСтрока;
		
		РодительЛокации = Новый СписокЗначений;
		Если ЗначениеЗаполнено(МультилокацияРодителей) Тогда			
			РодительЛокации.ЗагрузитьЗначения(СоставМультилокации(МультилокацияРодителей));
		КонецЕсли;
	
		ПараметрыФормыФормы = Новый Структура;
		ПараметрыФормыФормы.Вставить("РодительЛокации", РодительЛокации);
		ПараметрыФормыФормы.Вставить("ТипЛокации", 		СписокТиповЛокаций);
		ПараметрыФормыФормы.Вставить("Ключ", 			СсылкаНаЭлементСправочника);
		
		ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормыФормы);
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти