
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 16.01.2023 ( 60424
	Если Не РольДоступна("ПолныеПрава") И РольДоступна("dc_ДобавлениеИзменениеПричинНеурегулированныхРасходовПользователя") Тогда
			
		ГруппаПричиныПользователя = Справочники.ПричиныНеурегулированныхРасходов.ПричиныПользователя;
		
		Если Родитель.Пустая() Или (Не Родитель.ПринадлежитЭлементу(ГруппаПричиныПользователя) И Родитель <> ГруппаПричиныПользователя) Тогда
			ОбщегоНазначения.СообщитьПользователю("Недостаточно прав доступа. Вам доступно редактирование элементов в группе ""Причины пользователя"".",,,, Отказ);
			Возврат;
		КонецЕсли;
		
		Если Не ЭтоНовый() 
			И (Не Ссылка.ПринадлежитЭлементу(ГруппаПричиныПользователя)
				Или Ссылка = ГруппаПричиныПользователя) Тогда
				
			ОбщегоНазначения.СообщитьПользователю("Недостаточно прав доступа. Вам доступно редактирование элементов в группе ""Причины пользователя"".",,,, Отказ);
			Возврат;
			
		КонецЕсли;
					
	КонецЕсли;
	//Евросиб Каблов 16.01.2023 )
	
КонецПроцедуры
