
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УдалениеСтрокиДохода") Тогда
		ЗаголовокФормы = "Для строк добавленных из АРМ дополнительные услуги 
			|необходимо заполнить причину удаления";
		ГуидыДоходныхСтрок.ЗагрузитьЗначения(Параметры.МассивГУИДВыбранныхСтрок);
	Иначе
		ЗаголовокФормы = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОК(Команда)
	
	Комментарий = СокрЛП(Комментарий);
	
	Если Комментарий <> "" Тогда
		ЗаписатьКомментарийВТаблицу(Комментарий);
		
		АдресТаблицы = ПоместитьТаблицуУслугВоВременноеХранилище();
		Результат = Новый Структура;
		Результат.Вставить("АдресТаблицы", АдресТаблицы);
		//Результат.Вставить("КодВозвратаДиалога", КодВозвратаДиалога.Да);
		Закрыть(Результат);
	Иначе
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить комментарий'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Комментарий");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийВТаблицу(КомментарийПользователя)
	
	МассивГуидов = ГуидыДоходныхСтрок.ВыгрузитьЗначения();
	
	Для Каждого Гуид Из МассивГуидов Цикл
		НоваяСтрокаТаблицы = ТаблицаРезультат.Добавить();
		НоваяСтрокаТаблицы.ГуидСтроки = Гуид;
		НоваяСтрокаТаблицы.Комментарий = КомментарийПользователя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуУслугВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРезультат.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции
