
&НаКлиенте
Функция ПолучитьМассивСтруктурСертификатов(знач ТолькоЛичные) 

	МК = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider", "", 75);
	//МК = Новый МенеджерКриптографии("Microsoft Enhanced Cryptographic Provider v1.0", "", 1);
	МК.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.НеВключать;
	
	МассивСтруктурСертификатов = Новый Массив;
	
	Отказ = Ложь;
	Если Отказ Тогда
		Возврат МассивСтруктурСертификатов;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	// для подписи
	//Хранилище = МК.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Хранилище = МК.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	СертификатыХранилища = Хранилище.ПолучитьВсе();
	//Возврат СертификатыХранилища;
	
	ИндексСтроки = 0;
	Для Каждого стр из СертификатыХранилища Цикл
		Попытка
			Элементы.СертификатДляЭЦП.СписокВыбора.Добавить(ИндексСтроки, стр.Субъект.CN);
			ИндексСтроки = ИндексСтроки + 1;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ПолучитьМассивСтруктурСертификатов(Истина); 
КонецПроцедуры
