
Функция ПолучитьТарифыПоПараметрам(СтруктураПараметров) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиков.Ссылка КАК Ссылка,
	               |	ТарифыПоставщиков.Валюта КАК Валюта
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
	               |ГДЕ
	               |	НЕ ТарифыПоставщиков.ПометкаУдаления
	               |	И НЕ ТарифыПоставщиков.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА &КалькуляцияСухопутнойСоставляющей
	               |				ТОГДА ТарифыПоставщиков.КалькуляцияСухопутнойСоставляющей
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &КалькуляцияМорскойСоставляющей
	               |				ТОГДА ТарифыПоставщиков.КалькуляцияМорскойСоставляющей
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ПериодЗадан
	               |				ТОГДА &Период МЕЖДУ ТарифыПоставщиков.НачалоДействия И ТарифыПоставщиков.ОкончаниеДействия
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ДляГруженых
	               |				ТОГДА ТарифыПоставщиков.ДляГруженых
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ДляПорожних
	               |				ТОГДА ТарифыПоставщиков.ДляПорожних
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ПоставщикЗадан
	               |				ТОГДА &Поставщик = ТарифыПоставщиков.Поставщик
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &СсылкаЗадан
	               |				ТОГДА &Ссылка = ТарифыПоставщиков.Ссылка
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОрганизацияЗадан
	               |				ТОГДА &Организация = ТарифыПоставщиков.Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ТарифыПоставщиков.Услуга = &Услуга";
	Запрос.УстановитьПараметр("КалькуляцияСухопутнойСоставляющей", Ложь); //СтруктураПараметров.Свойство("КалькуляцияСухопутнойСоставляющей"));
	Запрос.УстановитьПараметр("КалькуляцияМорскойСоставляющей", Ложь); //СтруктураПараметров.Свойство("КалькуляцияМорскойСоставляющей"));
	Запрос.УстановитьПараметр("ДляГруженых", СтруктураПараметров.Свойство("ДляГруженых"));
	Запрос.УстановитьПараметр("ДляПорожних", СтруктураПараметров.Свойство("ДляПорожних"));
	Запрос.УстановитьПараметр("Услуга", СтруктураПараметров.Услуга);
	
	УстановитьПараметрЪ("Ссылка", Запрос, СтруктураПараметров);
	УстановитьПараметрЪ("Период", Запрос, СтруктураПараметров);
	УстановитьПараметрЪ("Поставщик", Запрос, СтруктураПараметров);
	УстановитьПараметрЪ("Организация", Запрос, СтруктураПараметров);
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		// отбираем по пунктам отправления
		Если СтруктураПараметров.Свойство("ПунктОтправления") Тогда
			Если НЕ ЛокацияСоответствуетТарифу(Ответ.Ссылка, СтруктураПараметров.ПунктОтправления, Истина) Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		// отбираем по пунктам назначения
		Если СтруктураПараметров.Свойство("ПунктНазначения") И НЕ СтруктураПараметров.Свойство("ИгнорироватьПунктНазначения") Тогда
			Если НЕ ЛокацияСоответствуетТарифу(Ответ.Ссылка, СтруктураПараметров.ПунктНазначения, Ложь) Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		// отбираем по типам ТС
		Если СтруктураПараметров.Свойство("ТипыТС") Тогда
			НМассив = Ответ.Ссылка.ТипыТС.Выгрузить().ВыгрузитьКолонку("ТипТС");
			Если НМассив.Количество() > 0 И НЕ ВПервомМассивеСодержатсяВсеЭлементыВторого(НМассив, СтруктураПараметров.ТипыТС) Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		// отбираем по типам ТЕ
		Если СтруктураПараметров.Свойство("ТипыТЕ") Тогда
			НМассив = Ответ.Ссылка.ТипыТЕ.Выгрузить().ВыгрузитьКолонку("ТипТЕ");
			Если НМассив.Количество() > 0 И НЕ ВПервомМассивеСодержатсяВсеЭлементыВторого(НМассив, СтруктураПараметров.ТипыТЕ) Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		// отбираем по размерам КТК
		Если СтруктураПараметров.Свойство("РазмерыКТК") Тогда
			НМассив = Ответ.Ссылка.РазмерыКТК.Выгрузить().ВыгрузитьКолонку("РазмерКТК");
			Если НМассив.Количество() > 0 И НЕ ВПервомМассивеСодержатсяВсеЭлементыВторого(НМассив, СтруктураПараметров.РазмерыКТК) Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("Тариф, Себестоимость, Валюта", Ответ.Ссылка, ВычислитьСтоимостьПоТарифуДляОперации(СтруктураПараметров, Ответ.Ссылка), Ответ.Валюта));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЛокацияСоответствуетТарифу(Тариф, Локации, ПунктОтправления = Истина)
	
	Если (ПунктОтправления И НЕ ЗначениеЗаполнено(Тариф.ПунктОтправления)) ИЛИ (НЕ ПунктОтправления И НЕ ЗначениеЗаполнено(Тариф.ПунктНазначения)) Тогда Возврат Истина; КонецЕсли;
	
	Результат = Ложь;
	
	ИмяРеквизита = "ПунктОтправления";
	ИмяРеквизитаВРегионе = "ПунктОтправленияВРегионе";
	
	Если НЕ ПунктОтправления Тогда
		ИмяРеквизита = "ПунктНазначения";
		ИмяРеквизитаВРегионе = "ПунктНазначенияВРегионе";
	КонецЕсли;
	
	Если Тариф[ИмяРеквизитаВРегионе] Тогда
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
		Если ТипЗнч(Локации) = Тип("Массив") Тогда;
			Для Каждого Локация Из Локации Цикл
				Если Локация1ВИерархииЛокации2(Локация, Тариф[ИмяРеквизита]) Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			Результат = Локация1ВИерархииЛокации2(Локации, Тариф[ИмяРеквизита]);
		КонецЕсли
		//Результат = Локация1ВИерархииЛокации2(Локация, Тариф[ИмяРеквизита]);
		// Евросиб Рыбьяков К.А. 18.09.2024 ))
	Иначе
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
		Если ТипЗнч(Локации) = Тип("Массив") Тогда;
			Для Каждого Локация Из Локации Цикл
				Если (Локация = Тариф[ИмяРеквизита]) Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Результат = (Локации = Тариф[ИмяРеквизита]);
		КонецЕсли
		//Результат = (Локация = Тариф[ИмяРеквизита]);
		// Евросиб Рыбьяков К.А. 18.09.2024 ))
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Локация1ВИерархииЛокации2(Знач Локация1, Локация2)
	
	ВертикальИерархии = Новый Массив;
	
	Пока ЗначениеЗаполнено(Локация1) Цикл
		ВертикальИерархии.Добавить(Локация1);
		Локация1 = Локация1.Родитель;
	КонецЦикла;
	Возврат ВертикальИерархии.Найти(Локация2) <> неопределено;	
	
КонецФункции

Функция ВПервомМассивеСодержатсяВсеЭлементыВторого(Массив1, Массив2)
	
	Результат  = Истина;
	
	Для каждого м2 из Массив2 Цикл
		м2Найден = Ложь;
		Для каждого м1 из Массив1 Цикл
			Если м1 = м2 Тогда м2Найден = Истина; Прервать; КонецЕсли;
		КонецЦикла;
		Если не м2Найден Тогда
			Результат  = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрЪ(ИмяПараметра, Запрос, СтруктураПараметров)
	
	Если СтруктураПараметров.Свойство(ИмяПараметра) Тогда
		Запрос.УстановитьПараметр(ИмяПараметра+"Задан", Истина);
		Запрос.УстановитьПараметр(ИмяПараметра, СтруктураПараметров[ИмяПараметра]);
	Иначе
		Запрос.УстановитьПараметр(ИмяПараметра+"Задан", Ложь);
		Запрос.УстановитьПараметр(ИмяПараметра, неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ВычислитьСтоимостьПоТарифуДляОперации(СтруктураПараметров, Тариф) ЭКСПОРТ
	
	//КэшПреобразователяЕдиницИзмерения = ОбщегоНазначения.ОбновитьКэшПреобразователяЕдиницИзмерения();
	//ДлительностьЧасов = КалендариКлиентСервер.ПолучитьРазностьДат(ИсхСтрока.Окончание, ИсхСтрока.Начало, Перечисления.ТипыДлительности.Часы, неопределено, неопределено);
	//ДлительностьДней = ДлительностьЧасов / 24;
	ДлительностьДней = 1;
	ДлительностьЧасов = 24;
	Сумма = 0;
	КоэффициентТарифа = 1;
	
	// для режима ВЦелом все просто - длительность не учитывается вообще
	Если Тариф.МетодТарификации = Перечисления.МетодыТарификации.ВЦелом Тогда
		ЗначениеТарифа = 1;
		Если Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ГП Тогда
			//ЗначениеТарифа = ?(ЗначениеЗаполнено(ИсхСтрока.ГрузоваяПартия), 1, 0);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.КоличествоНоменклатуры Тогда
			//ЗначениеТарифа = ПолучитьКоличествоНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ВесНоменклатуры Тогда
			//ЗначениеТарифа = ПолучитьВесНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ОбъемНоменклатуры Тогда
			//ЗначениеТарифа = ПолучитьОбъемНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		КонецЕсли;
		Если Тариф.ТипСуммирования = Перечисления.ТипыСуммирования.ПоИтоговомуЗначению Тогда
			Для каждого Стр из Тариф.ТаблицаСтоимость Цикл
				СтрДо = ?(ЗначениеЗаполнено(Стр.До), Стр.До, 9999999);
				Если Стр.От < ЗначениеТарифа И СтрДо >= ЗначениеТарифа Тогда Сумма = ЗначениеТарифа * Стр.Стоимость; КонецЕсли;
			КонецЦикла;
		Иначе
			ОбщаяЧисленность = ЗначениеТарифа;
			Для каждого стр из Тариф.ТаблицаСтоимость Цикл
				стрДо = ?(ЗначениеЗаполнено(стр.До), стр.До, 9999999);
				Если ЗначениеТарифа = 0 Тогда Прервать; КонецЕсли;
				Если ОбщаяЧисленность > стр.От И ОбщаяЧисленность <= стрДо Тогда
					Сумма = Сумма + ЗначениеТарифа * стр.Стоимость;
					ЗначениеТарифа = 0;
				КонецЕсли;
				Если ОбщаяЧисленность > стрДо Тогда
					Сумма = Сумма + стр.Стоимость * стрДо;
					ЗначениеТарифа = ЗначениеТарифа - стрДо;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	// для режима ЗаДень все сложнее - надо вычислить длительность операции и ее оценивать по шкале,
	// а ЗначениеТарифа будет лишь множителем к общей сумме
	Иначе
		КоэффициентТарифа = 1;
		Если Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ГП Тогда
			//КоэффициентТарифа = ?(ЗначениеЗаполнено(ИсхСтрока.ГрузоваяПартия), 1, 0);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.КоличествоНоменклатуры Тогда
			//КоэффициентТарифа = ПолучитьКоличествоНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ВесНоменклатуры Тогда
			//КоэффициентТарифа = ПолучитьВесНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		ИначеЕсли Тариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ОбъемНоменклатуры Тогда
			//КоэффициентТарифа = ПолучитьОбъемНоменклатуры(ИсхСтрока, Тариф.ЕдиницаИзмерения, КэшПреобразователяЕдиницИзмерения);
		КонецЕсли;
		ЗначениеТарифа = ?(Тариф.МетодТарификации = Перечисления.МетодыТарификации.ЗаДень, ДлительностьДней, ДлительностьЧасов);
		Если Тариф.ТипСуммирования = Перечисления.ТипыСуммирования.ПоИтоговомуЗначению Тогда
			Для каждого Стр из Тариф.ТаблицаСтоимость Цикл
				СтрДо = ?(ЗначениеЗаполнено(Стр.До), Стр.До, 9999999);
				Если Стр.От < ЗначениеТарифа И СтрДо >= ЗначениеТарифа Тогда Сумма = ЗначениеТарифа * Стр.Стоимость; КонецЕсли;
			КонецЦикла;
		Иначе
			ОбщаяЧисленность = ЗначениеТарифа;
			Для каждого стр из Тариф.ТаблицаСтоимость Цикл
				стрДо = ?(ЗначениеЗаполнено(стр.До), стр.До, 9999999);
				Если ЗначениеТарифа = 0 Тогда Прервать; КонецЕсли;
				Если ОбщаяЧисленность > стр.От И ОбщаяЧисленность <= стрДо Тогда
					Сумма = Сумма + ЗначениеТарифа * стр.Стоимость;
					ЗначениеТарифа = 0;
				КонецЕсли;
				Если ОбщаяЧисленность > стрДо Тогда
					Сумма = Сумма + стр.Стоимость * стрДо;
					ЗначениеТарифа = ЗначениеТарифа - стрДо;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сумма * КоэффициентТарифа;
	
КонецФункции

Функция ПолучитьДеталиТарифа(Тариф) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиков.НормативнаяДлительность КАК НормативнаяДлительность,
	               |	ТарифыПоставщиков.ЕИНормативнойДлительности КАК ЕИНормативнойДлительности,
	               |	ТарифыПоставщиков.Поставщик КАК Поставщик,
	               |	ТарифыПоставщиков.Договор КАК Договор,
	               |	ТарифыПоставщиков.Организация КАК Организация,
	               |	ТарифыПоставщиков.Валюта КАК Валюта,
	               |	ТарифыПоставщиков.СтавкаНДС КАК СтавкаНДС,
	               |	ТарифыПоставщиков.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
	               |ГДЕ
	               |	ТарифыПоставщиков.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Тариф);
	Ответ = Запрос.Выполнить().Выбрать();
	Если ответ.Следующий() Тогда
		Результат.Вставить("НормативнаяДлительность", Ответ.НормативнаяДлительность);
		Результат.Вставить("ЕИНормативнойДлительности", Ответ.ЕИНормативнойДлительности);
		Результат.Вставить("Поставщик", Ответ.Поставщик);
		Результат.Вставить("Договор", Ответ.Договор);
		Результат.Вставить("Организация", Ответ.Организация);
		Результат.Вставить("Валюта", Ответ.Валюта);
		Результат.Вставить("СтавкаНДС", Ответ.СтавкаНДС);
		Результат.Вставить("СуммаВключаетНДС", Ответ.СуммаВключаетНДС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьТарифПоПараметрам(ТипСоздаваемогоТарифа, АдресРасположения, СтруктураПараметров) Экспорт
	
//	Если ТипСоздаваемогоТарифа = 1 Тогда
		
	СтруктураПапок = СтрРазделить(АдресРасположения, "|", Ложь);
	ТекАдрес = Справочники.ТарифыПоставщиков.ПустаяСсылка();
	Для каждого Стр из СтруктураПапок Цикл
		
		НайдЭлемент = Справочники.ТарифыПоставщиков.НайтиПоНаименованию(Стр, Истина, ТекАдрес);
		Если ЗначениеЗаполнено(НайдЭлемент) Тогда
			ТекАдрес = НайдЭлемент;
		Иначе
			НЭлемент = Справочники.ТарифыПоставщиков.СоздатьГруппу();
			НЭлемент.Наименование = Стр;
			НЭлемент.Родитель = ТекАдрес;
			НЭлемент.Записать();
			ТекАдрес = НЭлемент.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Тариф) Тогда
		НТариф = СтруктураПараметров.Тариф.ПолучитьОбъект();
	Иначе
		НТариф = Справочники.ТарифыПоставщиков.СоздатьЭлемент();
	КонецЕсли;
	Нтариф.Наименование = "" + СтруктураПараметров.НоменклатураПоставщика + " " + СтруктураПараметров.СтанцияОтправления + " - " + СтруктураПараметров.СтанцияНазначения;
	НТариф.Родитель = ТекАдрес;
	НТариф.НачалоДействия = СтруктураПараметров.НачалоДействия;
	НТариф.ОкончаниеДействия = СтруктураПараметров.ОкончаниеДействия;
	НТариф.Поставщик = СтруктураПараметров.Контрагент;
	НТариф.Договор = СтруктураПараметров.Договор;
	НТариф.Валюта = СтруктураПараметров.Валюта;
	НТариф.Услуга = СтруктураПараметров.Услуга;  //Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
	НТариф.СтавкаНДС = СтруктураПараметров.НДС;
	НТариф.НоменклатураПоставщика = СтруктураПараметров.НоменклатураПоставщика;
	НТариф.ПунктОтправления = СтруктураПараметров.СтанцияОтправления;
	НТариф.ПунктОтправленияВРегионе = Истина;
	НТариф.ПунктНазначения = СтруктураПараметров.СтанцияНазначения;
	НТариф.ПунктНазначенияВРегионе = Истина;
	
	СтруктураПараметров.Свойство("СозданНаОсновании", НТариф.СозданНаОсновании);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")

	Если ТипСоздаваемогоТарифа = 1 Тогда
		НТариф.ТипыТС.Очистить();
		Если ЗначениеЗаполнено(СтруктураПараметров.ТипВагона) Тогда
			НТариф.ТипыТС.Добавить().ТипТС = СтруктураПараметров.ТипВагона;
		КонецЕсли;
		НТариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС;
	Иначе
		НТариф.ТипыТЕ.Очистить();
		Если ЗначениеЗаполнено(СтруктураПараметров.ТипКонтейнера) Тогда
			НТариф.ТипыТЕ.Добавить().ТипТЕ = СтруктураПараметров.ТипКонтейнера;
		КонецЕсли;
		НТариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТЕ;
	КонецЕсли;
	
	Если ТипСоздаваемогоТарифа = 5 Тогда 
		
		НТариф.РазмерыКТК.Очистить();
		Если ЗначениеЗаполнено(СтруктураПараметров.РазмерКТК) Тогда
			НТариф.РазмерыКТК.Добавить().РазмерКТК = СтруктураПараметров.РазмерКТК;
		КонецЕсли;
		
		НТариф.Груз = СтруктураПараметров.Груз;
		НТариф.КлассОпасностиIMO = СтруктураПараметров.КлассОпасностиIMO;
		НТариф.КлассОпасностиUN = СтруктураПараметров.КлассОпасностиUN;
		
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//НТариф.СобственностьПеревозимогоКТК = СтруктураПараметров.СобственностьПеревозимогоКТК;
		//ок)
		НТариф.УдалитьСобственностьПеревозимогоКТК = СтруктураПараметров.УдалитьСобственностьПеревозимогоКТК;
		НТариф.ПринадлежностьТЕ = СтруктураПараметров.ПринадлежностьТЕ;
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		НТариф.КодТарифаЛинии = СтруктураПараметров.КодТарифаЛинии;
		НТариф.ПунктОтправленияУсловия = СтруктураПараметров.УсловияПогрузки;
		НТариф.ПунктНазначенияУсловия = СтруктураПараметров.УсловияВыгрузки;
 //Евросиб Гудкова( 06.09.2020 Ticket№ 0202979		НТариф.Услуга = СтруктураПараметров.Услуга;
		
	КонецЕсли;
	
	НТариф.ТаблицаСтоимость.Очистить();
	//Если ТипСоздаваемогоТарифа = 3 ИЛИ ТипСоздаваемогоТарифа = 5 Тогда
	//	НТариф.ДляГруженых = ?(СтруктураПараметров.ПостановкаГрПор>0,Истина,Ложь);
	//	НТариф.ДляПорожних = ?(СтруктураПараметров.ПостановкаГрПор>0,Ложь,Истина);
	//Иначе
		НТариф.ДляГруженых = истина;
		НТариф.ДляПорожних = Истина;
	//КонецЕсли;
	
	НТариф.Организация = СтруктураПараметров.Организация;
	НТариф.ЕИНормативнойДлительности = Перечисления.ЕдиницаИзмеренияДлительности.КалендарныйДень;
	НТариф.КалькуляцияСухопутнойСоставляющей = Истина;
	//НТариф.ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС;
	НТариф.МетодТарификации = Перечисления.МетодыТарификации.ВЦелом;
	НТариф.ТипСуммирования = перечисления.ТипыСуммирования.ПоПромежуточнымЗначениям;
	
	Если ТипСоздаваемогоТарифа = 1 Тогда
		МаксВыбрСтрока = Макс(СтруктураПараметров.НормативВыгрузки, СтруктураПараметров.НормативПогрузки);
		Если МаксВыбрСтрока = 0 ИЛИ СтруктураПараметров.СтоимостьСНП = 0 Тогда
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.До = 1000;
			НСтр.Стоимость = СтруктураПараметров.Ставка;
		Иначе
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.До = МаксВыбрСтрока;
			НСтр.Стоимость = СтруктураПараметров.Ставка;
			
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.От = МаксВыбрСтрока;
			НСтр.До = 1000;
			НСтр.Стоимость = СтруктураПараметров.СтоимостьСНП;
			НСтр.СчитатьСверхнормативом = Истина;
		КонецЕсли;
	ИначеЕсли ТипСоздаваемогоТарифа = 2 Тогда
		Если СтруктураПараметров.СтоимостьСНПХранилище.Количество()>0 Тогда
			Для Каждого Стр Из СтруктураПараметров.СтоимостьСНПХранилище Цикл
				НСтр = НТариф.ТаблицаСтоимость.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр,Стр);
				НСтр.СчитатьСверхнормативом = Истина;
			КонецЦикла;
		Иначе
			Если СтруктураПараметров.НормативПогрузки = 0 ИЛИ СтруктураПараметров.СтоимостьСНП = 0 Тогда
				НСтр = НТариф.ТаблицаСтоимость.Добавить();
				НСтр.До = 1000;
				НСтр.Стоимость = СтруктураПараметров.Ставка;
			Иначе
				НСтр = НТариф.ТаблицаСтоимость.Добавить();
				НСтр.До = СтруктураПараметров.НормативПогрузки;
				НСтр.Стоимость = СтруктураПараметров.Ставка;
				
				НСтр = НТариф.ТаблицаСтоимость.Добавить();
				НСтр.От = СтруктураПараметров.НормативПогрузки;
				НСтр.До = 1000;
				НСтр.Стоимость = СтруктураПараметров.СтоимостьСНП;
				НСтр.СчитатьСверхнормативом = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипСоздаваемогоТарифа = 3 Тогда
		// норма загрузки по весу
		Если СтруктураПараметров.НормативПогрузки = 0 ИЛИ СтруктураПараметров.СтоимостьСНП = 0 Тогда
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.До = 1000;
			НСтр.Стоимость = СтруктураПараметров.Ставка;
		Иначе
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.До = СтруктураПараметров.НормативПогрузки;
			НСтр.Стоимость = СтруктураПараметров.Ставка;
			
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.От = СтруктураПараметров.НормативПогрузки;
			НСтр.До = 1000;
			НСтр.Стоимость = СтруктураПараметров.СтоимостьСНП;
			НСтр.СчитатьСверхнормативом = Истина;
		КонецЕсли;
	ИначеЕсли ТипСоздаваемогоТарифа = 4 Тогда
		// норма загрузки по времени
		Если НЕ СтруктураПараметров.НормативВремени = 0 И НЕ СтруктураПараметров.СтоимостьСНПВ = 0 Тогда
			НСтр = НТариф.ТаблицаСтоимость.Добавить();
			НСтр.От = СтруктураПараметров.НормативВремени;
			НСтр.До = 1000;
			НСтр.Стоимость = СтруктураПараметров.СтоимостьСНПВ;
			НСтр.СчитатьСверхнормативом = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипСоздаваемогоТарифа = 5 Тогда
		// пятый тариф просто ставка без сверхнорматива
		НСтр = НТариф.ТаблицаСтоимость.Добавить();
		НСтр.От = 0;
		НСтр.До = 1000;
		НСтр.Стоимость = СтруктураПараметров.Стоимость;
		
		НТариф.КольцевойМаршрут = СтруктураПараметров.Кольцевой;
		НТариф.ВидОтправки = СтруктураПараметров.ВидОтправки;
		НТариф.ЕИТЭО = СтруктураПараметров.ЕИ;
		
		НТариф.ДопУсловия = СтруктураПараметров.ДополнительныеУсловия;
		НТариф.Примечание = СтруктураПараметров.Примечания;
		
	КонецЕсли;
		
	НТариф.Записать();
		
	Возврат НТариф.Ссылка;
		
	
КонецФункции

