
&НаКлиенте
Процедура СписокСтоковПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.СписокСтоков.ТекущиеДанные;
	
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	// остатки по стокам
	ОтборРегион = неопределено;
	Если ТекД.Свойство("Ссылка") Тогда
		ОтборРегион = ТекД.Ссылка;
	ИначеЕсли ТекД.Свойство("ГруппировкаСтроки") Тогда
		ОтборРегион = ТекД.ГруппировкаСтроки.Ключ;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014 
	//Список.Параметры.УстановитьЗначениеПараметра("СтокВыбр", ОтборРегион);
	//Список.Параметры.УстановитьЗначениеПараметра("СтокНеОграничен", НЕ ТолькоДанныеПоСтоку);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Сток", ОтборРегион, 
																			ВидСравненияКомпоновкиДанных.ВИерархии,, ТолькоДанныеПоСтоку); 
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014  
	//Список.Параметры.УстановитьЗначениеПараметра("ОтборАктивность", ОтборАктивность);
	//Список.Параметры.УстановитьЗначениеПараметра("ОтборЗаполняемость", ОтборЗаполненность);
	//++ Зубов US 33131 TA 38910 27.10.2021	
	//Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
	//Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	//-- Зубов US 33131 TA 38910 27.10.2021 
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	// ДИТ US 76956 ТА 76972 Сержантова А.С. Начало: 01.11.2023
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014  
	ТолькоДанныеПоСтоку = Ложь;
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014  
	//Список.Параметры.УстановитьЗначениеПараметра("СтокНеОграничен", Истина);
	//Список.Параметры.УстановитьЗначениеПараметра("СтокВыбр", Неопределено);
	// ДИТ US 76956 ТА 76972 Сержантова А.С. Конец: 01.11.2023
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Активность", ОтборАктивность, 
																			ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборАктивность)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Реализованность", ОтборЗаполненность, 
																			ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборЗаполненность)); 
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014 
	
	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОтборЗаполненностьПриИзменении(Элемент)
	
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014 
	//Список.Параметры.УстановитьЗначениеПараметра("ОтборЗаполняемость", ОтборЗаполненность);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Реализованность", ОтборЗаполненность, 
																			ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборЗаполненность)); 
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАктивностьПриИзменении(Элемент)
	
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014 
	//Список.Параметры.УстановитьЗначениеПараметра("ОтборАктивность", ОтборАктивность);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Активность", ОтборАктивность, 
																			ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборАктивность)); 
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014 

КонецПроцедуры

//++ Зубов US 33131 TA 38910 27.10.2021
&НаКлиенте
Процедура ОтборПоКТКИзExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиКТКExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиКТКExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		СписокКТКОтбор.ЗагрузитьЗначения(Параметр1);
		//Евросиб Коханенко Н.А. 11.07.2024 (( #88014 
		//Если СписокКТКОтбор.Количество() = 0 Тогда
		//	Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
		//Иначе
		//	Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
		//	Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
		//КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка.Номинации.Контейнер", СписокКТКОтбор, 
																			ВидСравненияКомпоновкиДанных.ВСписке,, (СписокКТКОтбор.Количество() > 0)); 
		//Евросиб Коханенко Н.А. 11.07.2024 )) #88014 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКТКОтборПриИзменении(Элемент)
	//Евросиб Коханенко Н.А. 11.07.2024 (( #88014 
	//Если СписокКТКОтбор.Количество() = 0 Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
	//	Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
	//	Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	//КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка.Номинации.Контейнер", СписокКТКОтбор, 
																		ВидСравненияКомпоновкиДанных.ВСписке,, (СписокКТКОтбор.Количество() > 0)); 
	//Евросиб Коханенко Н.А. 11.07.2024 )) #88014 
КонецПроцедуры
//-- Зубов US 33131 TA 38910 27.10.2021