
Функция ПолучитьНастройкиВидаУслуг(ВидУслугПоставщика, ИмяТаблицы) Экспорт
	
	НастройкиВидаУслуг = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыУслугПоставщиков.ТипУчетныхЕдиницДетализации КАК ТипУчетныхЕдиницДетализации,
	|	ВидыУслугПоставщиков.ВалютаПоУмолчанию КАК ВалютаПоУмолчанию,
	|	ВидыУслугПоставщиков.ЗаполнятьНормативы КАК ЗаполнятьНормативы,
	|	ВидыУслугПоставщиков.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВидыУслугПоставщиков.ИспользоватьЗаполнениеНормативов КАК ИспользоватьЗаполнениеНормативов
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков КАК ВидыУслугПоставщиков
	|ГДЕ
	|	ВидыУслугПоставщиков.Ссылка = &ВидУслугПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Имя КАК Имя,
	|	Таблица.Представление КАК Представление,
	|	Таблица.Выводить КАК Выводить,
	|	Таблица.Обязательное КАК Обязательное,
	|	Таблица.ИмяТаблицы КАК ИмяТаблицы,
	|	Таблица.ЗагружатьИзExcel КАК ЗагружатьИзExcel,
	|	Таблица.ЗагружатьИзExcelВПростойФорме КАК ЗагружатьИзExcelВПростойФорме,
	|	Таблица.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Таблица.ЭтоГруппаЭлементов КАК ЭтоГруппаЭлементов,
	|	Таблица.ОтображатьВШапке КАК ОтображатьВШапке,
	|	Таблица.Группировка КАК Группировка,
	|	Таблица.Родитель КАК Родитель,
	|	Таблица.ТолькоПросмотр КАК ТолькоПросмотр,
	|	Таблица.ЗаполнятьАвтоматически КАК ЗаполнятьАвтоматически
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ПоляТаблицыУслуг КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВидУслугПоставщика
	|	И Таблица.ИмяТаблицы = &ИмяТаблицы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ИмяТаблицы КАК ИмяТаблицы,
	|	Таблица.Имя КАК Имя,
	|	Таблица.Значение КАК Значение
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.СпискиВыбора КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВидУслугПоставщика
	|	И Таблица.ИмяТаблицы = &ИмяТаблицы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Имя,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ИмяТаблицы КАК ИмяТаблицы,
	|	Таблица.Имя КАК Имя,
	|	Таблица.ИмяТипа КАК ИмяТипа
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ОграниченияТипов КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВидУслугПоставщика
	|	И Таблица.ИмяТаблицы = &ИмяТаблицы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ИмяТаблицы КАК ИмяТаблицы,
	|	Таблица.Имя КАК Имя,
	|	Таблица.ИмяПараметра КАК ИмяПараметра,
	|	Таблица.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ПараметрыВыбора КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВидУслугПоставщика
	|	И Таблица.ИмяТаблицы = &ИмяТаблицы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Имя,
	|	ИмяПараметра,
	|	ЗначениеПараметра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ИмяТаблицы КАК ИмяТаблицы,
	|	Таблица.Имя КАК Имя,
	|	Таблица.ИмяПоля КАК ИмяПоля
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ПоляПоиска КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВидУслугПоставщика
	|	И Таблица.ИмяТаблицы = &ИмяТаблицы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|ВЫБРАТЬ
	|	ВидыУслугПоставщиковДополнительныеУсловия.Имя КАК Имя,
	|	ВидыУслугПоставщиковДополнительныеУсловия.Условие КАК Условие
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ДополнительныеУсловия КАК ВидыУслугПоставщиковДополнительныеУсловия
	|ГДЕ
	|	ВидыУслугПоставщиковДополнительныеУсловия.Ссылка = &ВидУслугПоставщика
	|	И ВидыУслугПоставщиковДополнительныеУсловия.ИмяТаблицы = &ИмяТаблицы";
	
	Запрос.УстановитьПараметр("ВидУслугПоставщика", ВидУслугПоставщика);
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Запрос.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Таблица.ИмяТаблицы = &ИмяТаблицы", "");
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаНастроек = РезультатыЗапроса[0].Выбрать();
	ПоляТаблицыУслуг = РезультатыЗапроса[1].Выгрузить();
	ПоляТаблицыУслуг.Колонки.Добавить("Тип", Новый ОписаниеТипов("ОписаниеТипов"));
	ПоляТаблицыУслуг.Колонки.Добавить("ПараметрыВыбора", Новый ОписаниеТипов("Массив"));
	ПоляТаблицыУслуг.Колонки.Добавить("СписокВыбора", Новый ОписаниеТипов("СписокЗначений"));
	ПоляТаблицыУслуг.Колонки.Добавить("ОграничениеТипа", Новый ОписаниеТипов("Массив"));
	ПоляТаблицыУслуг.Колонки.Добавить("ПоляПоиска", Новый ОписаниеТипов("Массив"));
	ПоляТаблицыУслуг.Колонки.Добавить("ДопУсловия", Новый ОписаниеТипов("Массив"));
	ПоляТаблицыУслуг.Колонки.Добавить("ВыборГруппИЭлементов");
	
	СпискиВыбора = РезультатыЗапроса[2].Выгрузить();
	СпискиВыбора.Индексы.Добавить("ИмяТаблицы, Имя");
	
	ОграниченияТипов = РезультатыЗапроса[3].Выгрузить();
	ОграниченияТипов.Индексы.Добавить("ИмяТаблицы, Имя");
	
	ВыборкаПараметровВыбора = РезультатыЗапроса[4].Выбрать();
	
	ПоляПоиска = РезультатыЗапроса[5].Выгрузить();	
	
	ДопУсловия = РезультатыЗапроса[6].Выгрузить();
	
	НастройкиВидаУслуг.Вставить("ТипУчетныхЕдиницДетализации");
	НастройкиВидаУслуг.Вставить("ВалютаПоУмолчанию");
	НастройкиВидаУслуг.Вставить("ИспользоватьЗаполнениеНормативов");
	НастройкиВидаУслуг.Вставить("ЗаполнятьНормативы");	
	НастройкиВидаУслуг.Вставить("СуммаВключаетНДС");
	
	Если ВыборкаНастроек.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НастройкиВидаУслуг, ВыборкаНастроек);
	КонецЕсли;
	
	Для Каждого Реквизит из Метаданные.Документы.ПСЦПоставщика.ТабличныеЧасти.Услуги.Реквизиты Цикл
		ОписаниеРеквизита = ПоляТаблицыУслуг.Найти(Реквизит.Имя, "Имя");
		Если ОписаниеРеквизита <> Неопределено Тогда
			ОписаниеРеквизита.Тип = Реквизит.Тип;
		КонецЕсли;
	КонецЦикла;
	
	ДоступныеРеквизиты = ПолучитьДоступныеРеквизиты(ИмяТаблицы);
	
	СоставИмениТаблицы = СтрРазделить(ИмяТаблицы, ".");
	ИмяДокумента = СоставИмениТаблицы[0];
	ИмяТЧ = СоставИмениТаблицы[1];
	МетаданныеТаблицы = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти[ИмяТЧ];	
	
	Для Каждого Поле Из ПоляТаблицыУслуг Цикл
		
		НайденныеСтроки = ДоступныеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, Поле.Имя));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			ДоступныйРеквизит = НайденныеСтроки[0];
		Иначе
			Продолжить;
		КонецЕсли;
		
		Поле.Тип = ДоступныйРеквизит.Тип;
				
		СписокВыбора = СпискиВыбора.Скопировать(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, Поле.Имя), "Значение");
		Если ЗначениеЗаполнено(СписокВыбора) Тогда
			
			Поле.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьКолонку("Значение"));
			
			Значения = Поле.СписокВыбора.ВыгрузитьЗначения();
			Поле.ПараметрыВыбора.Добавить(Новый Структура("ИмяПараметра, ЗначениеПараметра", "Отбор.Ссылка", Новый ФиксированныйМассив(Значения)));
			
		КонецЕсли;
		
		ОграничениеТипа = ОграниченияТипов.Скопировать(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, Поле.Имя), "ИмяТипа");
		Если ЗначениеЗаполнено(ОграничениеТипа) Тогда
			Поле.ОграничениеТипа = ОграничениеТипа.ВыгрузитьКолонку("ИмяТипа");
		КонецЕсли;
		
		ТекПоляПоиска = ПоляПоиска.Скопировать(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, Поле.Имя), "ИмяПоля");
		Если ЗначениеЗаполнено(ТекПоляПоиска) Тогда
			Поле.ПоляПоиска = ТекПоляПоиска.ВыгрузитьКолонку("ИмяПоля");
		КонецЕсли;
		
		МетаданныеРеквизита = МетаданныеТаблицы.Реквизиты.Найти(Поле.Имя);
		Если МетаданныеРеквизита <> Неопределено Тогда
			Поле.ВыборГруппИЭлементов = МетаданныеРеквизита.ВыборГруппИЭлементов;
		КонецЕсли;
				
	КонецЦикла;
	
	Пока ВыборкаПараметровВыбора.СледующийПоЗначениюПоля("Имя") Цикл
		
		Поле = ПоляТаблицыУслуг.Найти(ВыборкаПараметровВыбора.Имя, "Имя");
		
		Если Поле <> Неопределено Тогда
			Пока ВыборкаПараметровВыбора.СледующийПоЗначениюПоля("ИмяПараметра") Цикл
				
				ЗначенияПараметра = Новый Массив;
				Пока ВыборкаПараметровВыбора.СледующийПоЗначениюПоля("ЗначениеПараметра") Цикл
					ЗначенияПараметра.Добавить(ВыборкаПараметровВыбора.ЗначениеПараметра);
				КонецЦикла;
				
				Если ЗначенияПараметра.Количество() = 1 Тогда
					ЗначениеПараметра = ЗначенияПараметра[0];
				Иначе
					ЗначениеПараметра = Новый ФиксированныйМассив(ЗначенияПараметра);
				КонецЕсли;
				
				Поле.ПараметрыВыбора.Добавить(Новый Структура("ИмяПараметра, ЗначениеПараметра", ВыборкаПараметровВыбора.ИмяПараметра, ЗначениеПараметра));
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	НастройкиВидаУслуг.Вставить("ПоляТаблицыУслуг", ПоляТаблицыУслуг);
	НастройкиВидаУслуг.Вставить("ДопУсловия", ДопУсловия);
	
	Возврат НастройкиВидаУслуг;
	
КонецФункции

Функция ПолучитьДоступныеРеквизиты(ИмяТаблицы = "") Экспорт
	
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	ТипОписаниеТипов = Новый ОписаниеТипов("ОписаниеТипов");
	
	ДоступныеРеквизиты = Новый ТаблицаЗначений;
	ДоступныеРеквизиты.Колонки.Добавить("Имя", ТипСтрока150);
	ДоступныеРеквизиты.Колонки.Добавить("Представление", ТипСтрока150);
	ДоступныеРеквизиты.Колонки.Добавить("ИмяТаблицы", ТипСтрока150);
	ДоступныеРеквизиты.Колонки.Добавить("Тип", ТипОписаниеТипов);
	
	Для Каждого Реквизит из Метаданные.Документы.ПСЦПоставщика.ТабличныеЧасти.Услуги.Реквизиты Цикл
		
		НоваяСтрока = ДоступныеРеквизиты.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
		НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
		НоваяСтрока.Тип = Реквизит.Тип;
		
	КонецЦикла;
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Контейнеры";
	НоваяСтрока.Представление = "Контейнеры";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
		
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Вагоны";
	НоваяСтрока.Представление = "Вагоны";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КонтейнерыВагоны";
	НоваяСтрока.Представление = "Номера КТК/Вагонов";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТЕ, СправочникСсылка.ТС");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерКТК_Вагона";
	НоваяСтрока.Представление = "Типоразмер КТК/Вагона";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ, СправочникСсылка.ТипоразмерыТС");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыКТК";
	НоваяСтрока.Представление = "Типоразмеры КТК";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыКТКСтрокой";
	НоваяСтрока.Представление = "Типоразмеры КТК (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерВагонов";
	НоваяСтрока.Представление = "Типоразмер вагонов";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыВагонов";
	НоваяСтрока.Представление = "Типоразмеры вагонов";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыВагоновСтрокой";
	НоваяСтрока.Представление = "Типоразмеры вагонов (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ВидыОтправок";
	НоваяСтрока.Представление = "Виды отправок";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОтправок");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ВидыОтправокСтрокой";
	НоваяСтрока.Представление = "Виды отправок (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОтправок");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтанцияОтправленияНазначения";
	НоваяСтрока.Представление = "Станция отправления и назначения";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.Локации, СправочникСсылка.Мультилокации");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "НормаВремениНаПогрузкуВыгрузку";
	НоваяСтрока.Представление = "Норма времени на погрузку/выгрузку";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ДорогаОтправления";
	НоваяСтрока.Представление = "Дорога отправления";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ЖелезныеДороги");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ДорогаНазначения";
	НоваяСтрока.Представление = "Дорога назначения";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ЖелезныеДороги");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПортОтправленияЛокацияВышестоящегоУровня";
	НоваяСтрока.Представление = "Страна/город (порт отправления)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПортНазначенияЛокацияВышестоящегоУровня";
	НоваяСтрока.Представление = "Страна/город (порт назначения)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПериодПредоставления";
	НоваяСтрока.Представление = "Период предоставления (суток)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Критерии";
	НоваяСтрока.Представление = "Критерии";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.КритерииУслугПоставщиков");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КритерииСтрокой";
	НоваяСтрока.Представление = "Критерии (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ЕТСНГ";
	НоваяСтрока.Представление = "ЕТСНГ";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(9));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ГНГ";
	НоваяСтрока.Представление = "ГНГ";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(8));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КлючиНормативныхСтавок";
	НоваяСтрока.Представление = "Нормативные ставки";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиСтрокПротокола");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КлючиНормативныхСтавокСтрокой";
	НоваяСтрока.Представление = "Нормативные ставки (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтанцииЖД";
	НоваяСтрока.Представление = "Станции ЖД";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Порты";
	НоваяСтрока.Представление = "Порты";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СостоянияГруженыйПорожний";
	НоваяСтрока.Представление = "Состояния груженый/порожний";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияКТК");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СостоянияГруженыйПорожнийСтрокой";
	НоваяСтрока.Представление = "Состояния груженый/порожний (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	ИмяТаблицыНормативныхСтавок = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	
	Для Каждого Реквизит из Метаданные.Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ТабличныеЧасти.Услуги.Реквизиты Цикл
		
		НоваяСтрока = ДоступныеРеквизиты.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
		НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
		НоваяСтрока.Тип = Реквизит.Тип;
		
	КонецЦикла;
	
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтавкаЗаКМ40FutБезНДС";
	НоваяСтрока.Представление = "Ставка за КМ - 40 Fut, без НДС";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтавкаЗаКМ20FutБезНДС";
	НоваяСтрока.Представление = "Ставка за КМ - 20 Fut, без НДС";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьБезНДС_КТК20";
	НоваяСтрока.Представление = "Стоимость без НДС (20 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьСНДС_КТК20";
	НоваяСтрока.Представление = "Стоимость с НДС (20 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьБезНДС_КТК40";
	НоваяСтрока.Представление = "Стоимость без НДС  (40 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьСНДС_КТК40";
	НоваяСтрока.Представление = "Стоимость с НДС  (40 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьБезНДС";
	НоваяСтрока.Представление = "Стоимость без НДС";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьСНДС";
	НоваяСтрока.Представление = "Стоимость с НДС";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьЗаСуткиБезНДС";
	НоваяСтрока.Представление = "Стоимость за сутки без НДС";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерКТК20";
	НоваяСтрока.Представление = "Типоразмер КТК (20 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерКТК40";
	НоваяСтрока.Представление = "Типоразмер КТК (40 fut)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Критерии";
	НоваяСтрока.Представление = "Критерии";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.КритерииУслугПоставщиков");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КритерииСтрокой";
	НоваяСтрока.Представление = "Критерии (строкой)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.КритерииУслугПоставщиков");
	
	// Евросиб US US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Продукт";
	НоваяСтрока.Представление = "Продукт";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ПродуктыДКП");
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПродуктСтрокой";
	НоваяСтрока.Представление = "Продукт (строкой)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ПродуктыДКП");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "УчетныеНаправления";
	НоваяСтрока.Представление = "Учетные направления";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.УчетныеНаправления");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "УчетныеНаправленияСтрокой";
	НоваяСтрока.Представление = "Учетные направления (строкой)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.УчетныеНаправления");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ДорогаОтправления";
	НоваяСтрока.Представление = "Дорога отправления";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ДорогаНазначения";
	НоваяСтрока.Представление = "Дорога назначения";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ВидТранспорта";
	НоваяСтрока.Представление = "Вид транспорта";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТранспорта");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыКТКСтрокой";
	НоваяСтрока.Представление = "Типоразмеры КТК (строкой)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ТипоразмерыВагоновСтрокой";
	НоваяСтрока.Представление = "Типоразмеры вагонов (строкой)";
	НоваяСтрока.ИмяТаблицы = ИмяТаблицыНормативныхСтавок;
	НоваяСтрока.Тип = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС");
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ЖелезнаяДорога";
	НоваяСтрока.Представление = "Дорога ЖД";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоПриемуАвто";
	НоваяСтрока.Представление = "Авто";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоПриемуМоре";
	НоваяСтрока.Представление = "Море";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоПриемуСклад";
	НоваяСтрока.Представление = "Склад";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоПриемуЖД";
	НоваяСтрока.Представление = "ЖД";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоОтправлениюАвто";
	НоваяСтрока.Представление = "Авто";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоОтправлениюМоре";
	НоваяСтрока.Представление = "Море";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоОтправлениюСклад";
	НоваяСтрока.Представление = "Склад";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПеревалкаПоОтправлениюЖД";
	НоваяСтрока.Представление = "ЖД";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭтаповПеревалки");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Терминал";
	НоваяСтрока.Представление = "Терминал";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Строка");
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КоличествоКТКВПартии";
	НоваяСтрока.Представление = "Кол-во КТК в партии";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число");
	//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025
	
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ВидТранспорта";
	НоваяСтрока.Представление = "Вид транспорта";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТранспорта");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СвободныйПериодХраненияКТК";
	НоваяСтрока.Представление = "СвободныйПериодХраненияКТК";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число");
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СвободныйПериодХраненияВаг";
	НоваяСтрока.Представление = "СвободныйПериодХраненияВаг";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("Число");
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "КлассОпасностиСтрокой";
	НоваяСтрока.Представление = "Класс опасности (строкой)";
	НоваяСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НоваяСтрока.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.КлассОпасностиГруза");
	
	Возврат ДоступныеРеквизиты;
	
КонецФункции

Функция ПолучитьДоступныеПоляСпискаТарифов() Экспорт
	
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	//ТипОписаниеТипов = Новый ОписаниеТипов("ОписаниеТипов");
	
	ДоступныеРеквизиты = Новый ТаблицаЗначений;
	ДоступныеРеквизиты.Колонки.Добавить("Имя", ТипСтрока150);
	ДоступныеРеквизиты.Колонки.Добавить("Представление", ТипСтрока150);
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Регистратор";
	НоваяСтрока.Представление = "Регистратор";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Период";
	НоваяСтрока.Представление = "Начало действия";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтатусТарифа";
	НоваяСтрока.Представление = "Статус тарифа";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "Статус";
	НоваяСтрока.Представление = "Статус";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ПоКТКВагонам";
	НоваяСтрока.Представление = "По КТК/вагонам";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ОкончаниеДействия";
	НоваяСтрока.Представление = "Действия";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьБезНДС";
	НоваяСтрока.Представление = "Стоимость без НДС";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьСНДС";
	НоваяСтрока.Представление = "Стоимость с НДС";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ШкалаСтоимостьБезНДС";
	НоваяСтрока.Представление = "Шкала стоимость без НДС";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "ШкалаСтоимостьСНДС";
	НоваяСтрока.Представление = "Шкала стоимость с НДС";
	
	Для Каждого Реквизит из Метаданные.Справочники.КритерииУслугПоставщиков.Реквизиты Цикл
		
		НоваяСтрока = ДоступныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Критерий." + Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
		
	КонецЦикла;
	
	//Евросиб Шевченко А.В. US 123730 TA 126427 17.12.2025
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьЗаСуткиБезНДС";
	НоваяСтрока.Представление = "Ставка в сут. без НДС";
	
	НоваяСтрока = ДоступныеРеквизиты.Добавить();
	НоваяСтрока.Имя = "СтоимостьЗаСуткиСНДС";
	НоваяСтрока.Представление = "Ставка в сут, с НДС";
	//Евросиб Шевченко А.В. US 123730 TA 126427 17.12.2025
	Возврат ДоступныеРеквизиты;
	
КонецФункции

Функция ПолучитьПоляСпискаТарифовВидаУслуг(ВидУслуг) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыУслугПоставщиковПоляСпискаТарифов.Ссылка КАК Ссылка,
	|	ВидыУслугПоставщиковПоляСпискаТарифов.НомерСтроки КАК НомерСтроки,
	|	ВидыУслугПоставщиковПоляСпискаТарифов.Имя КАК Имя,
	|	ВидыУслугПоставщиковПоляСпискаТарифов.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ВидыУслугПоставщиков.ПоляСпискаТарифов КАК ВидыУслугПоставщиковПоляСпискаТарифов
	|ГДЕ
	|	НЕ ВидыУслугПоставщиковПоляСпискаТарифов.Ссылка.ПометкаУдаления
	|	И ВидыУслугПоставщиковПоляСпискаТарифов.Ссылка = &ВидУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Имя КАК Имя,
	|	ВТ.Представление КАК Представление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Имя КАК Имя,
	|		ВТ.НомерСтроки КАК НомерСтроки,
	|		МИНИМУМ(ВТ.Ссылка) КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТ.Имя КАК Имя,
	|			МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки
	|		ИЗ
	|			ВТ КАК ВТ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ.Имя) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|			ПО ВложенныйЗапрос.Имя = ВТ.Имя
	|				И ВложенныйЗапрос.НомерСтроки = ВТ.НомерСтроки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ.Имя,
	|		ВТ.НомерСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ВложенныйЗапрос.Ссылка = ВТ.Ссылка
	|			И ВложенныйЗапрос.Имя = ВТ.Имя
	|			И ВложенныйЗапрос.НомерСтроки = ВТ.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Представление";
	
	Если ЗначениеЗаполнено(ВидУслуг) Тогда
		Запрос.УстановитьПараметр("ВидУслуг", ВидУслуг);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидыУслугПоставщиковПоляСпискаТарифов.Ссылка = &ВидУслуг", "");
	КонецЕсли;
	
	ПоляСпискаТарифов = Запрос.Выполнить().Выгрузить();
	
	Возврат ПоляСпискаТарифов;
	
КонецФункции

