 
 //Субботин 77659 24.11.2023 Начало
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Пометка = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Пометка = Ложь; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчик()
	
	Для Сч = 1 По ТЧ.Количество() Цикл
		ТЧ[Сч-1].N = Сч;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Типоразмер = Параметры.ТипКТК;
	ПерваяМиля = Параметры.ПерваяМиля;
	ПоследняяМиля = Параметры.ПоследняяМиля;
//	ТзКопия = Параметры.ЗаявкаТЧУслуги.выгрузить().СкопироватьКолонки();
	ТЧУслуги.Загрузить(Параметры.ЗаявкаТЧУслуги.выгрузить());

	СписокКТКДругихСтрокЗапроса.ЗагрузитьЗначения(Параметры.КТКЗапроса);
	Если Параметры.Свойство("СоставТЕ") Тогда
		МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТЕ), ";", Ложь);
		Для Каждого Стр Из МассивТС Цикл
			НСтр = ТЧ.Добавить(); 
			Если ТипЗнч(Стр) = Тип("Строка") Тогда
				НСтр.УчетнаяЕдиница = РаботаСКонтейнерамиСервер.НайтиКТК(Стр); 
			Иначе
				НСтр.УчетнаяЕдиница = Стр;
			КонецЕсли;
			НСтр.ТипКТК  = Типоразмер ;
			НСтр.ПерваяМиля = ПерваяМиля;
			НСтр.ПоследняяМиля = ПоследняяМиля;
		КонецЦикла;
	КонецЕсли;
	Если ТЧ.Количество()< 2 тогда
		Элементы.ПеренестиВОтдельныйЗапросНаКТК.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтрокаТипоразмер = "" ;
	СтрокаПерваяМиля = "" ;
	СтрокаПоследняяМиля = "";
	ЭтоПервый = Истина;
	
	МассивВыбранных = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		Если ЭтоПервый Тогда
			ЭтоПервый = Ложь;
			СтрокаТипоразмер = Стр.ТипКТК;
			СтрокаПерваяМиля = Стр.ПерваяМиля;
			СтрокаПоследняяМиля = Стр.ПоследняяМиля;
			МассивВыбранных.Добавить(Стр);	
		ИначеЕсли  СтрокаТипоразмер = Стр.ТипКТК и СтрокаПерваяМиля = Стр.ПерваяМиля и	СтрокаПоследняяМиля = Стр.ПоследняяМиля тогда
			МассивВыбранных.Добавить(Стр);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбор ктк с разными типами или способами автоперевозки невозможен");
			Возврат
		КонецЕсли;	
	КонецЦикла;	
	Закрыть(Новый Структура("СтрокиКонтейнеров", МассивВыбранных));
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСчетчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПослеУдаления(Элемент)
	
	ОбновитьСчетчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОтдельныйЗапросНаКТК(Команда)
	
	СтрокаТипоразмер = "" ;
	СтрокаПерваяМиля = "" ;
	СтрокаПоследняяМиля = "";
	ЭтоПервый = Истина;
		
	МассивКТК =  Новый Массив;
	МассивВыбранных = Новый Массив;
	МассивСтрокНаУдаление = Новый Массив; 
	Для Каждого Стр из ТЧ Цикл			
		Если ЭтоПервый Тогда
			ЭтоПервый = Ложь;
			СтрокаТипоразмер = Стр.ТипКТК;
			СтрокаПерваяМиля = Стр.ПерваяМиля;
			СтрокаПоследняяМиля = Стр.ПоследняяМиля;
		КонецЕсли;	
		Если Стр.Пометка и СтрокаТипоразмер = Стр.ТипКТК И СтрокаПерваяМиля = Стр.ПерваяМиля И	СтрокаПоследняяМиля = Стр.ПоследняяМиля Тогда
			МассивВыбранных.Добавить(Стр.УчетнаяЕдиница);
			МассивСтрокНаУдаление.Добавить(Стр);
		ИначеЕсли СтрокаТипоразмер = Стр.ТипКТК И СтрокаПерваяМиля = Стр.ПерваяМиля И СтрокаПоследняяМиля = Стр.ПоследняяМиля Тогда
			МассивКТК.Добавить(Стр);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбор ктк с разными типами или способами автоперевозки невозможен");
			Возврат
		КонецЕсли;	
	КонецЦикла;
	Для каждого УдаляемаяСтрока из МассивСтрокНаУдаление Цикл
		Тч.Удалить(УдаляемаяСтрока);
	КонецЦикла;	
	
	Закрыть(Новый Структура("СтрокиКонтейнеров, ПереносимыеКТК", МассивКТК, МассивВыбранных));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзУслуг(Команда)
	 
	Список = ВыгрузитьКТК();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Список, СписокКТКДругихСтрокЗапроса.ВыгрузитьЗначения());
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("Документ.Заявка.Форма.ФормаПодбораКТК", Новый Структура("ТЕ, СоставТЕ, ТЧУслуги", Истина, Список, ТЧУслуги)
	,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры 

Функция ВыгрузитьКТК()
	
	Контейнеры = Новый Массив;
		
	Для Каждого ктк Из ТЧ Цикл
		Контейнеры.Добавить(ктк.УчетнаяЕдиница);
	КонецЦикла;	
		
	Возврат Контейнеры;

КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 = Неопределено Тогда Возврат; КонецЕсли; 
	
	Для Каждого СтрокаКТК из Параметр1 Цикл
		НовСтрока = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаКТК);
		НовСтрока.Пометка = Ложь;
	КонецЦикла;
	
	ОбновитьСчетчик();
	Если ТЧ.Количество()> 1 тогда
		Элементы.ПеренестиВОтдельныйЗапросНаКТК.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТЧПриИзменении(Элемент) 
	
	Если ТЧ.Количество()< 2 Тогда
		Элементы.ПеренестиВОтдельныйЗапросНаКТК.Доступность = Ложь;
	Иначе
		Элементы.ПеренестиВОтдельныйЗапросНаКТК.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

//Субботин 77801 28.11.2023 Конец 

