
////ПОДКЛЮЧЕНИЕ К ЭТРАН

#Область ПодключениеКЭтран

Функция ПодключитьКЭтранНаСервере(Логин = Неопределено,Пароль = Неопределено) 
	
	Если Логин = Неопределено или Пароль = Неопределено тогда
		НастройкиЭтрнан = ПолучитьНастройкиЭТРАН();

		Логин =  НастройкиЭтрнан.Логин;
		Пароль = НастройкиЭтрнан.Пароль;
	КонецЕсли;
	
	
	
	
	Попытка
		глЭтран = Новый COMObject("EtranASUGO.EtranASUGO");
	Исключение
		глЭтран = неопределено;
		//Сообщить("Проблемы с подключением к EtranASUGO(возможно не установлен соответствующий COM объект).");
	КонецПопытки;
	
	Попытка			     
		глЭтран.Connect("http://10.248.35.14:8092/EtranServer/EtranHttpSrvr.dll",Логин,Пароль);
		//Сообщить("Связь с этраном установлена " + ТекущаяДата());
	Исключение
		//Сообщить("Связь с этраном не установлена");
		глЭтран = неопределено;                                             
	КонецПопытки;
	
	Возврат глЭтран;
	
КонецФункции


Функция ПолучитьОтветНаЗапрос(ТекстЗапроса) Экспорт
	
	НастройкиЭтрнан = ПолучитьНастройкиЭТРАН();
	
	ТипПараметраString = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema","string");
	Логин  = ФабрикаXDTO.Создать(ТипПараметраString, НастройкиЭтрнан.Логин);
	Пароль = ФабрикаXDTO.Создать(ТипПараметраString, НастройкиЭтрнан.Пароль);
	ЗапросТекст = ФабрикаXDTO.Создать(ТипПараметраString, ТекстЗапроса);

	ОпределениеWSDL = ПолучитьОпределение(НастройкиЭтрнан);
	Если ОпределениеWSDL = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения WSDL определения от tsxapp!");
		Возврат "Ошибка подключения к прокси. error";
	КонецЕсли;
	
	Прокси = ПолучитьПрокси(ОпределениеWSDL,НастройкиЭтрнан);
	
	Если Прокси = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения прокси!"+ОписаниеОшибки());
		Возврат "Ошибка подключения к прокси. error";
	иначе	
		Попытка
			Результат = Прокси.GetBlockUser(ЗапросТекст,Логин,Пароль);
			Возврат Результат.XMLFromEtran;
		Исключение 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения ответа на запрос!"+ОписаниеОшибки());
			Возврат "Ошибка подключения к прокси. error";
		КонецПопытки; 		
	КонецЕсли;

КонецФункции

Функция ПолучитьОпределение(НастройкиЭтрнан)	
	
	Результат = неопределено;
	Попытка
		Результат = Новый WSОпределения(НастройкиЭтрнан.Адрес,НастройкиЭтрнан.Логин,НастройкиЭтрнан.Пароль);
	Исключение
		ОО = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьПрокси(Определение,НастройкиЭтрнан)
	
	Прокси = Новый WSПрокси(Определение,определение.Сервисы[0].URIПространстваИмен,определение.Сервисы[0].Имя,определение.Сервисы[0].ТочкиПодключения[0].Имя,,300);
	Прокси.Пользователь = НастройкиЭтрнан.Логин; 
	Прокси.Пароль = НастройкиЭтрнан.Пароль; 
	
	////Попытка
	//	Прокси = WSСсылки.WSСсылкаЭТРАН.СоздатьWSПрокси(НастройкиЭтрнан.Адрес, "IEtranSysservice", "IEtranSysPort"); //"http:// :8080/EtranServer/EtranLR.dll/soap"
	//	Прокси.Пользователь = НастройкиЭтрнан.Логин; 
	//	Прокси.Пароль = НастройкиЭтрнан.Пароль; 
	////Исключение
	////	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не правильно заданы настройки ЭТРАН");
	////	Прокси = Неопределено;
	////КонецПопытки;
	
	Возврат Прокси;
	
КонецФункции

#КонецОбласти 

// ЗАГРУЗКА ДОКУМЕНТОВ
#Область ЗагрузкаДокументов

Функция ЗаполнитьДокументАкт(operid = неопределено) Экспорт
	
	
	
	ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_Акт"));
	
	глЭтран = Неопределено;
	
	//глЭтран = ПодключитьКЭтранНаСервере(Выборка.Логин,Выборка.Пароль);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ActUslugNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("ActUslugID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ТекущаяДата = ТекущаяДата();    
	НачалоПериода = ГраницаПериодаЗагрузкиДокументов;// - 7200;
	
	//Пробуем получить operid. 
	//Если функция возвращает 999999999999999(нет записи по запросу), тогда грузим по периоду
	Если operid = "999999999999999" Тогда 
	иначе
		operid = ПолучитьНомерПоследнейОперации(Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);
	КонецЕсли;
	
	//Евросиб Каблов 06.12.2019 (
	ТриЧаса = 10800;
	//Евросиб Каблов 06.12.2019 )
	
	
	Пока НачалоПериода < ТекущаяДата Цикл
		
		Таблица.Очистить();
		//Евросиб Каблов 06.12.2019 ( 
		//КонецПериода = НачалоЧаса(НачалоПериода) + (3600*24*3-1);
		КонецПериода = НачалоЧаса(НачалоПериода) + ТриЧаса;
		//Евросиб Каблов 06.12.2019 )
		
		//ТекстЗапроса = "<ActUslugStatus version=""1.0"">
		//|<fromDate value=""" + НачалоПериода + """/>
		//|<toDate value=""" + КонецПериода + """/>
		//|<OperId value=""999999999999999""/>
		//|</ActUslugStatus>";
		
		//Евросиб Каблов 06.12.2019 (
		//ТекстЗапроса = "<ActUslugStatus version=""1.0"">";		
		//Если operid = "999999999999999" Тогда
		//	ТекстЗапроса = ТекстЗапроса + 
		//	"
		//	|<fromDate value=""" + НачалоПериода + """/>
		//	|<toDate value=""" + КонецПериода + """/>
		//	|<OperId value=""999999999999999""/>";
		//Иначе
		//	ТекстЗапроса = ТекстЗапроса + 
		//	"			
		//	|<OperId value="""+operid+"""/>"; 
		//КонецЕсли; 		
		//ТекстЗапроса = ТекстЗапроса + 
		//"
		//|</ActUslugStatus>";
		//
		//НачалоПериода = КонецПериода;
		
		ТекстЗапроса = 
			"<ActUslugStatus version=""1.0"">		
			|<fromDate value=""" + НачалоПериода + """/>
			|<toDate value=""" + КонецПериода + """/>						
			//|<OperId value="""+operid+"""/>		
			|</ActUslugStatus>";
		//Евросиб Каблов 06.12.2019 )
		
		НачалоПериода = КонецПериода+1;		            
		
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656		ЗаписатьЛогЭТРАН("Запрос статуса Акта:" , ТекстЗапроса, РезультатЗапроса,,"Этран");
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса Акта"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		Иначе
			
			Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
				//Повторяем запрос 45  по 180 секунд, около 1,5 часа	
				КоличествоПовторов = 0;
				Пока КоличествоПовторов < 5 Цикл
					ПаузаВСекундах(60);// 3 минуты
					
					Если Константы.э_ВебСервис.Получить() Тогда
						РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
					Иначе 
						РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
					КонецЕсли;
					
					РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса Акта");//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
					Если не РезультатПроверки.КодОшибки = "100" Тогда
						РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
						Прервать;	
					КонецЕсли;
					КоличествоПовторов = КоличествоПовторов + 1;
				КонецЦикла;  				
			КонецЕсли;
			
			//СКА 19102019
			Если РезультатПроверки.КодОшибки = "1" Тогда
				Продолжить;
			КонецЕсли;
			//СКА 19102019


		КонецЕсли;
		
		
		
		
		// Заполнение Таблицы
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
		Строка = Неопределено;
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "ActUslugID" Тогда
				Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
				Если Строка <> Неопределено Тогда
					Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
				КонецЕсли; 					
			ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				OperId = ЧтениеXML.ПолучитьАтрибут("value");
				Строка = Неопределено; // на всякий случай
				ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаАктов);				
			КонецЕсли;
		КонецЦикла;        
		
		НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
		ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,"э_Акт");
		
		
		Для Каждого Строка Из Таблица Цикл
			ИДАкта        = Строка.ActUslugID;
			ТекстЗапроса = "<getActUslug version=""1.0"">
			|<DocId value=""" + ИДАкта + """/>
			|<Flag value=""2""/>
			//Использование 6-значных кодов станций и грузов в ответе --- ТекстЗапроса = ТекстЗапроса + "<useMod11/>"
			|<useMod11/>
			|</getActUslug>";
			
			
			Если Константы.э_ВебСервис.Получить() Тогда
				РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
			Иначе 
				РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
			КонецЕсли;
			
			РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных Акта");//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
			Если РезультатПроверки.КодОшибки = Неопределено Тогда 
				РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
			Иначе
				Продолжить;
			КонецЕсли;          
			
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656			ЗаписатьЛогЭТРАН("Запрос данных Акта:" , ТекстЗапроса, РезультатЗапроса,,"Этран");

			Документ2 = Документы.э_Акт.НайтиПоРеквизиту("ИД",ИДАкта);
			
			Если Документ2.Пустая() Тогда
				Документ = Документы.э_Акт.СоздатьДокумент();
			Иначе	
				Документ = Документ2.ПолучитьОбъект();
				Документ.Вагоны.Очистить();
				Документ.Услуги.Очистить(); 
			КонецЕсли;
			

			МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_Акт");
			
			Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
			СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
			ЗаполнитьОбъектИзXMLАКТ(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
			
					
			Документ.Дата = ТекущаяДата();	
			Документ.Записать(РежимЗаписиДокумента.Запись);
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	//глЭтран.disconnect(); 
	
	
	
	
	Возврат Истина;
	
	
КонецФункции                                                                           

Процедура ЗагрузитьДокументыИзЭтран() Экспорт
	
	// параметры - (operid = Неопределено) 
	Сообщить("Начало ведомостей: " + ТекущаяДата());
	ПодгрузитьНовыеВедомостиПодачиУборкиВагонов();
	// параметры - (operid = Неопределено) 
	Сообщить("Начало накопительных: " + ТекущаяДата());
	//ПодгрузитьНовыеНакопительныеВедомости();
	ПодгрузитьНовыеНакопительныеВедомости_сидата();
	// параметры - (Параметр = "", АдресРезультата = Неопределено,operid = Неопределено)
	Сообщить("Начало накладных: " + ТекущаяДата());
	ПодгрузитьНовыеНакладныеНаСервере();
//Евросиб Литвинов 29.06.2021 ( Ticket#0219692 #33382
	Сообщить("Начало накладных(обновить Дата раскредитации): " + ТекущаяДата());
	ОбновитьДатуРаскредитацииПо44НакладнымНаСервере();
//Евросиб Литвинов 29.06.2021 ) Ticket#0219692 #33382
	// параметры - (Параметр = "", АдресРезультата = Неопределено,operid = Неопределено)
	//ПодгрузитьНовыеЗаявкиНаСервере();	// SIV 10-04-2020 - загрузка ГУ-12 реализована Си Датой отдельным фоновым заданием 
	// параметры - (operid = Неопределено) 
	Сообщить("Начало актов: " + ТекущаяДата());
	ЗаполнитьДокументАкт();	
	Сообщить("Завершение актов: " + ТекущаяДата());
	
КонецПроцедуры

Процедура ПодгрузитьНовыеНакладныеНаСервере(Параметр = "", АдресРезультата = Неопределено,operid = Неопределено)Экспорт
	
	глЭтран = неопределено;
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Если не Константы.э_ВебСервис.Получить() Тогда 			
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("invNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(8)));
	Таблица.Колонки.Добавить("invoiceID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	
	ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_Накладная"));
	
	ТекущаяДата = ТекущаяДата();
	//Пробуем получить operid. 
	//Если функция возвращает 999999999999999(нет записи по запросу), тогда грузим по периоду
	Очищатьoperid = Ложь;
	Если operid = "999999999999999" Тогда 
		Очищатьoperid = Истина;
		ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_Накладная"));
		НачалоПериода = ГраницаПериодаЗагрузкиДокументов;// - 7200;
	Иначе
		operid = ПолучитьНомерПоследнейОперации(Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);  
		НачалоПериода = ТекущаяДата-1;
	КонецЕсли;
	
	Пока НачалоПериода < ТекущаяДата Цикл
		
		Таблица.Очистить();
		
		КонецПериода = НачалоЧаса(НачалоПериода) + 3599;
		
		ТекстЗапроса = "<invoiceStatus version=""1.0"">";
		
		Если operid = "999999999999999" Тогда
			ТекстЗапроса = ТекстЗапроса +
			"
			|<fromDate value=""" + (НачалоПериода -1) + """/>
			|<toDate value=""" + (КонецПериода+1) + """/>
			|<OperId value=""999999999999999""/>";
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<OperId value="""+operid+"""/>"; 
		КонецЕсли;
		
		// use вообще все
		//|<usePayer/><useViza/><useSpoil/><useSending/><useArrive/><useDelivery/><useSpoilDelivery/><useSender/><useStation/><usePort/>
		//|<useRecip/> 
		ТекстЗапроса = ТекстЗапроса + 
		"
		|<useSender/><useRecip/><useOwnerCont/><useTenantCar/><useOwnerCar/><usePayer/><useAll/> 
		|</invoiceStatus>";
		НачалоПериода = КонецПериода+1;		            
		
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
		//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 		ЗаписатьЛогЭТРАН("Запрос статуса накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		Иначе
			
			Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
				//Повторяем запрос 45  по 180 секунд, около 1,5 часа	
				КоличествоПовторов = 0;
				Пока КоличествоПовторов < 45 Цикл
					ПаузаВСекундах(180);// 3 минуты
					
					Если Константы.э_ВебСервис.Получить() Тогда
						РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
					Иначе 
						РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
					КонецЕсли;
					
					РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656  
					Если не РезультатПроверки.КодОшибки = "100" Тогда
						РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
						Прервать;	
					КонецЕсли;
					КоличествоПовторов = КоличествоПовторов + 1;
				КонецЦикла;
				//Евросиб Каблов 18.08.2021 ( Ticket#0238931
				Если РезультатПроверки.КодОшибки = "100" Тогда
					Возврат;
				КонецЕсли;
				//Евросиб Каблов 18.08.2021 )
			КонецЕсли;
			
			//СКА 19102019
			//Если РезультатПроверки.КодОшибки = "1" Тогда
			//     Продолжить;
			//КонецЕсли;
			//СКА 19102019
			
			Если РезультатПроверки.КодОшибки = "1" ИЛИ РезультатПроверки.КодОшибки = "0" Тогда // SIV 09-12-2020
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		//РезультатЗапроса = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,ложь); //Если в результате содержатся ошибки, то возврат Неопределено
		//\15022018 Добавляем получение кода ошибки		
		
		Если РезультатЗапроса = Неопределено Тогда                            
			ВсеДокументыЗагрузились = Ложь;
			ЧасовСОшибкой = ЧасовСОшибкой + 1;  
			Продолжить;
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
		
		// Заполнение Таблицы
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
		Строка = Неопределено;
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "invoice" Тогда
				Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
			ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				OperId = ЧтениеXML.ПолучитьАтрибут("value");
				Строка = Неопределено; // на всякий случай
				//ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику); // SIV 09-12-20 перенес запись оперИД в конец, чтобы если произошла ошибка, курсор не сдвигался
			ИначеЕсли Строка <> Неопределено Тогда
				Попытка
					Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;        
		
		Если operid = "999999999999999" Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,"э_Накладная");
		КонецЕсли;
		
		//СКА 19102019
		Если Таблица.Количество() = 0 Тогда  
			Если operid = "999999999999999" Тогда 
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;   		
		КонецЕсли;
		
		//Если Таблица.Количество() = 0 Тогда////////////////////////////////////////////
		//	//НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата-(3600*ЧасовСОшибкой+3600));			 
		//	Продолжить;
		//КонецЕсли;
		//СКА 19102019
		
		Для Каждого Выборка Из Таблица Цикл
			ИДНакладной        = Выборка.invoiceID;
			НомерНакладной    = Выборка.invNumber;
			//Евросиб Гудкова( 09.11.2020 Ticket№ 0211268 
			Если Не ЗначениеЗаполнено(НомерНакладной) Тогда
				Продолжить;
			КонецЕсли; 
			// Евросиб Гудкова) 			
			ТекстЗапроса = "<getInvoice version=""1.0"">
			|<invoiceID value=""" + ИДНакладной + """/>
			|<invNumber value=""" + НомерНакладной + """/>
			//Использование 6-значных кодов станций и грузов в ответе --- ТекстЗапроса = ТекстЗапроса + "<useMod11/>"
			|<useMod11/><useValid/>
			|</getInvoice>";
			
			Если Константы.э_ВебСервис.Получить() Тогда
				РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
			Иначе 
				РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
			КонецЕсли;
			
			//15022018 Добавляем получение кода ошибки
			РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
			Если РезультатПроверки.КодОшибки = Неопределено Тогда 
				РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
			Иначе
				
				Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
					//Повторяем запрос 45  по 180 секунд, около 1,5 часа	
					КоличествоПовторов = 0;
					Пока КоличествоПовторов < 5 Цикл
						ПаузаВСекундах(30);// 0,5 минуты
						
						
						Если Константы.э_ВебСервис.Получить() Тогда
							РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
						Иначе 
							РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
						КонецЕсли;
						
						
						РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
						Если не РезультатПроверки.КодОшибки = "100" Тогда
							РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
							Прервать;	
						КонецЕсли;
						КоличествоПовторов = КоличествоПовторов + 1;
					КонецЦикла;
					//Евросиб Каблов 18.08.2021 ( Ticket#0238931
					Если РезультатПроверки.КодОшибки = "100" Тогда
						Возврат;
					КонецЕсли;
					//Евросиб Каблов 18.08.2021 ) 
				КонецЕсли;
				
				//СКА 19102019
				Если РезультатПроверки.КодОшибки = "0" ИЛИ РезультатПроверки.КодОшибки = "1" Тогда // SIV 09-12-2020 добавил выход, если одна из накладных не загрузилась
					Возврат;
				КонецЕсли;
				//СКА 19102019
				
				// Евросиб US 132808 TA 132809 Рыбьяков К.А. 20.03.2026 (( код ошибки из этрана изменился
				Если РезультатПроверки.СтатусКод = "404" 
					И РезультатПроверки.КодОшибки = "4" 
					И ЗначениеЗаполнено(ИДНакладной) Тогда // Документ платный, обращаемся к Ритму
				// Евросиб Рыбьяков К.А. 20.03.2026 ))
				//Рыбьяков К.А 03.05.2024 Ticket#0350495  
				//Если РезультатПроверки.СтатусКод = "407" И ЗначениеЗаполнено(ИДНакладной) Тогда
					РезультатЗапроса = ЗапроситьНакладнуюВРИТМе(ИДНакладной);
				КонецЕсли;
				//Рыбьяков К.А 03.05.2024 Ticket#0350495
				
			КонецЕсли;
			//РезультатЗапроса = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,ложь); //Если в результате содержатся ошибки, то возврат Неопределено
			//\15022018 Добавляем получение кода ошибки
			
			Если РезультатЗапроса = Неопределено Тогда                            
				ВсеДокументыЗагрузились = Ложь;
				Продолжить;
			КонецЕсли;
			
			//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
			//Гудкова ЗаписатьЛогЭТРАН("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
			ДлительныеОперации.СообщитьПрогресс(, "Загрузка накладной: " + НомерНакладной);
			
			Рез = ЗаполнитьДокументНакладная(РезультатЗапроса,ВсеДокументыЗагрузились,НомерНакладной,НачалоПериода,КонецПериода,ТекущаяДата());
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику); // SIV 09-12-20 перенес запись оперИД в конец, чтобы если произошла ошибка, курсор не сдвигался
	
	глЭтранИдетЗагрузка = Ложь;
	Попытка
		//глЭтран.disconnect();         
	Исключение
	КонецПопытки;
 
КонецПроцедуры

Процедура ПодгрузитьНовыеНакладныеНаСервере_СиДата(Знач ДатаНачала = неопределено, Знач ДатаОкончания = неопределено)Экспорт
	
	глЭтран = неопределено;
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ВсеДокументыЗагрузились = Истина;
	
	Если ДатаНачала = неопределено Тогда
		ДатаНачала = ТекущаяДата() - 6*3600;
	КонецЕсли;
	
	Если ДатаОкончания = неопределено Тогда
		ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	Сообщить("Начало запроса ЭТРАН: " + ТекущаяДата());
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("invNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(8)));
	Таблица.Колонки.Добавить("invoiceID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ТекстЗапроса = "<invoiceStatus version=""1.0"">
	|<fromDate value=""" + (ДатаНачала -1) + """/>
	|<toDate value=""" + (ДатаОкончания+1) + """/>
	|<useSender/><useRecip/><useOwnerCont/><useTenantCar/><useOwnerCar/><usePayer/><useAll/> 
	|</invoiceStatus>";
	
	РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	
	РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
	Если РезультатПроверки.КодОшибки = Неопределено Тогда 
		РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
	Иначе
		
		Если РезультатПроверки.КодОшибки = "1" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатЗапроса = Неопределено Тогда                            
		ВсеДокументыЗагрузились = Ложь;
		Возврат;
	КонецЕсли;
	
	// Заполнение Таблицы
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	Строка = Неопределено;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "invoice" Тогда
			Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
		ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			OperId = ЧтениеXML.ПолучитьАтрибут("value");
			Строка = Неопределено; // на всякий случай
			ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);				
		ИначеЕсли Строка <> Неопределено Тогда
			Попытка
				Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;        
	
	////////////// !!!
	
	Для Каждого Выборка Из Таблица Цикл
		ИДНакладной        = Выборка.invoiceID;
		НомерНакладной    = Выборка.invNumber;
		ТекстЗапроса = "<getInvoice version=""1.0"">
		|<invoiceID value=""" + ИДНакладной + """/>
		|<invNumber value=""" + НомерНакладной + """/>
		|<useMod11/><useValid/>
		|</getInvoice>";
		
		
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		КонецЕсли;
		Если РезультатЗапроса = Неопределено Тогда                            
			ВсеДокументыЗагрузились = Ложь;
			Продолжить;
		КонецЕсли;
				
		Рез = ЗаполнитьДокументНакладная(РезультатЗапроса,ВсеДокументыЗагрузились,НомерНакладной,ДатаНачала,ДатаОкончания,ТекущаяДата());
		
	КонецЦикла;
	
	Сообщить("Конец запроса ЭТРАН: " + ТекущаяДата());
	
	глЭтранИдетЗагрузка = Ложь;
	
КонецПроцедуры

Процедура ПаузаВСекундах(Секунды)
	
	ВремяМС = Секунды * 1000;
	
	Если ВремяМС = 0 Тогда
        Возврат
    КонецЕсли;
    Сигнатура = Формат(ТекущаяДата(), "ДФ=yyyyMMddhhmmss");
    ПутьСкрипта = КаталогВременныхФайлов()+"SleepScript"+Сигнатура+".vbs";
    СкриптФайл = Новый ТекстовыйДокумент;
    СкриптФайл.ДобавитьСтроку("WScript.Sleep("+Формат(ВремяМС, "ЧГ=0")+")");
    СкриптФайл.Записать(ПутьСкрипта, КодировкаТекста.OEM);
    WSHShell = Новый COMОбъект("WScript.Shell");
    WSHShell.Run("wscript.exe """+ПутьСкрипта+"""", 0, Истина);
    УдалитьФайлы(ПутьСкрипта);

	
КонецПроцедуры 

Функция ЗагрузитьНакладруюИзЭТРАНПоНомеру(Номер = "", АдресРезультата = Неопределено) Экспорт
	
	ВозвращаемаяСтруктура = Новый Структура("Ссылка, Сообщение");
		
	НачалоПериода = НачалоДня('00010101');
	КонецПериода = КонецДня('39991231');
	
	
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	

	
	НомерНакладной = Номер;
	ТекстЗапроса = "<getInvoice version=""1.0"">
	|<invNumber value=""" + НомерНакладной + """/>
	//|<invoiceID value=""" + НомерНакладной + """/>
	//|<useMod11/><useValid/>
	|<useMod11/>
	|</getInvoice>";
	
	
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		глЭтран = неопределено;
		глЭтран = ПодключитьКЭтранНаСервере();
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
	
	ПозицияОшибки = Найти(РезультатЗапроса,"errorMessage value=");
	Если ПозицияОшибки > 0  Тогда 				
		КонецОшибки  = Найти(РезультатЗапроса,"errorStatusCode value=");
		Если КонецОшибки > 0  Тогда 
			Результат = Сред(РезультатЗапроса,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
			ВозвращаемаяСтруктура.Сообщение = Результат;
			ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
			Возврат ВозвращаемаяСтруктура;
		КонецЕсли;
	КонецЕсли;
	
	//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	ЗаписатьЛогЭТРАН("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	ДлительныеОперации.СообщитьПрогресс(, "Загрузка накладной: " + НомерНакладной);
	
	Если ЗаполнитьДокументНакладная(РезультатЗапроса,Ложь,НомерНакладной,НачалоПериода,КонецПериода,ТекущаяДата(),, ВозвращаемаяСтруктура.Ссылка) = Истина Тогда
		ВозвращаемаяСтруктура.Сообщение = "Накладная " + НомерНакладной + " загружена";
		ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
	КонецЕсли;
	
	Возврат ВозвращаемаяСтруктура;
	
КонецФункции

Функция НайтиНомерВОсобыхОтметках(Строка)
	
	ДлинаСтроки = СтрДлина(Строка);  	
	НомерВагона = "";
	н=1;
	Пока ДлинаСтроки >= н Цикл
		
		СимволИзСтроки = Сред(Строка,н,1);
		Попытка
			
			Если СимволИзСтроки = " " или СимволИзСтроки ="." или СимволИзСтроки ="," Тогда   
				НомерВагона = "";
			Иначе				
				СимволЧисло = Число(СимволИзСтроки);
				НомерВагона = НомерВагона + СимволЧисло;
				Если СтрДлина(НомерВагона) = 8 тогда
					Возврат НомерВагона;
				КонецЕсли;   				              				
			КонецЕсли;
			
		Исключение
			НомерВагона = "";
		КонецПопытки;
		
		н=н+1;
	КонецЦикла;
	
	Возврат "";		
	
КонецФункции

//++ [US 58841] Denis Isadchenko, 06.03.2023
Функция ПроверитьЕТСНГПорожний(СправочникЕТСНГ) Экспорт
	Если НЕ ЗначениеЗаполнено(СправочникЕТСНГ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор КАК СпрДатакор
	|ИЗ
	|	РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	|ГДЕ
	|	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана = &СпрЭтан";
	Запрос.УстановитьПараметр("СпрЭтан",СправочникЕТСНГ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденыйСправочник = Выборка.СпрДатакор;
	КонецЦикла;
	
	Если НайденыйСправочник <> Неопределено Тогда
		Если НайденыйСправочник.ПорожнийВагон ИЛИ НайденыйСправочник.ПорожнийКТК Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-- [US 58841] Denis Isadchenko, 06.03.2023
	
Функция ЗаполнитьДокументНакладная(РезультатЗапроса,ВсеДокументыЗагрузились,НомерНакладной,НачалоПериода,КонецПериода,ТекущаяДата,Ссылка = Неопределено, СсылкаРезультат = Неопределено)  Экспорт
			
	
	ПерезаполнитьГрузы = Ложь;
	ПерезаполнитьГрузыЕслиЕстьИзменения = Ложь;
	НастройкиЭтран = ПолучитьНастройкиЭТРАН();
	
			
			ЗапросОбщиеПоказатели = Новый Запрос;
			ЗапросОбщиеПоказатели.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.э_ОбщиеПоказатели ГДЕ Наименование = &Наименование И ИдентификаторПараметра = &ИдентификаторПараметра";
			ПустаяСсылкаОбщиеПоказатели = Справочники.э_ОбщиеПоказатели.ПустаяСсылка();

	        //Заполнение Документа ЭлектроннаяНакладная
			Документ = Документы.э_Накладная.СоздатьДокумент();
			МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_Накладная");
			Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
			СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
			ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
			//++ [US 58841] Denis Isadchenko, 06.03.2023
			Загружаем = Ложь;
			Если Документ.Контейнеры.Количество() > 0 Тогда
				Загружаем = Истина;
			КонецЕсли;
			
			// ДИТ US 58841 TA 67680 Евсенкин М.А. Начало: 27.03.2023
			Таблица	= Новый ТаблицаЗначений;
			Таблица.Колонки.Добавить("Реквизит");
			Таблица.Колонки.Добавить("Значение");
			// ДИТ US 58841 TA 67680 Евсенкин М.А. Конец: 27.03.2023
			
			ПроверитьЕТСНГ = Ложь;
			Если Загружаем = Ложь Тогда
				Если Документ.Вагоны.Количество() > 0 Тогда
					Для Каждого СтрокаВагоны ИЗ Документ.Вагоны Цикл
						// ДИТ US 58841 TA 67680 Евсенкин М.А. Начало: 27.03.2023
						НоваяСтрока = Таблица.Добавить();
						НоваяСтрока.Реквизит = "Код";
						НоваяСтрока.Значение = СтрокаВагоны.РодВагонаИД;
						СтрокаВагоны.РодВагона = ПолучитьИлиСоздатьСсылкуНаОбъект("э_РодаВагоновДляНакладных","Справочник",Таблица);
						Таблица.Очистить();
						// ДИТ US 58841 TA 67680 Евсенкин М.А. Конец: 27.03.2023
						Если ЗначениеЗаполнено(СтрокаВагоны.РодВагона) Тогда
							Если СтрокаВагоны.РодВагона.ЯвляетсяПлатформой Тогда
								Загружаем = Истина;	
							КонецЕсли;
						Иначе
							ПроверитьЕТСНГ = Истина;
						КонецЕсли;
					КонецЦикла;
				Иначе
					ПроверитьЕТСНГ = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если ПроверитьЕТСНГ Тогда 
				Если Загружаем = Ложь Тогда
					Если Документ.ГрузыЖД.Количество() > 0 Тогда
						Для Каждого СтрокаГрузыЖД ИЗ Документ.ГрузыЖД Цикл
							Если ЗначениеЗаполнено(СтрокаГрузыЖД.ЕТСНГ) Тогда
								Если ПроверитьЕТСНГПорожний(СтрокаГрузыЖД.ЕТСНГ) Тогда
									Загружаем = Истина;
								КонецЕсли;
							Иначе
								Если ЗначениеЗаполнено(СтрокаГрузыЖД.КодЕТСНГ) Тогда
									э_ЕТСНГГруза = Справочники.э_ЕТСНГ.НайтиПоКоду(СтрокаГрузыЖД.КодЕТСНГ);
									Если ЗначениеЗаполнено(э_ЕТСНГГруза) Тогда
										Если ПроверитьЕТСНГПорожний(э_ЕТСНГГруза) Тогда
											Загружаем = Истина;
										КонецЕсли;
									Иначе	
										ЕТСНГГруза = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ",СтрокаГрузыЖД.КодЕТСНГ);
										Если ЕТСНГГруза.Порожний Тогда
											Загружаем = Истина;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Загружаем = Ложь Тогда
				Возврат Ложь;
			КонецЕсли;
//-- [US 58841] Denis Isadchenko, 06.03.2023
						
					

			
			
			
//Евросиб Гудкова( 13.10.2020 Ticket№ 0209893 охрана
	НайденнаяСтрока = Документ.СпециальныеОтметки.Найти(398,"ОтметкаИД");
	Если  (не НайденнаяСтрока = Неопределено) Тогда
		Документ.Охрана = Истина;
	КонецЕсли;
// Евросиб Гудкова) 			
			//Найдем вагоны в лоп. таблицах
			Если Документ.Вагоны.Количество() = 0 Тогда
				
				НайденнаяСтрока = Документ.СпециальныеОтметки.Найти(975,"ОтметкаИД");
				Если  (не НайденнаяСтрока = Неопределено) и СтрДлина(СокрЛП(НайденнаяСтрока.Замечание)) = 8 Тогда
					СтрокаВагон = Документ.Вагоны.Добавить(); 
					СтрокаВагон.НомерВагона = НайденнаяСтрока.Замечание;		
				КонецЕсли;
			КонецЕсли;	
			
			Если Документ.Вагоны.Количество() = 0 Тогда
				
				НайденнаяСтрока = Документ.СпециальныеОтметки.Найти(882,"ОтметкаИД");
				Если  (не НайденнаяСтрока = Неопределено) Тогда
					НомерВагона = НайтиНомерВОсобыхОтметках(НайденнаяСтрока.Замечание); 					
					СтрокаВагон = Документ.Вагоны.Добавить(); 
					СтрокаВагон.НомерВагона = НомерВагона;		
				КонецЕсли;
				
			КонецЕсли;		
			
		           
			СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
			
			Если не ЗначениеЗаполнено(Документ.ЗаявкаГУ12) и ЗначениеЗаполнено(Документ.ЗаявкаГУ12ИД) Тогда 
				ЗагрузитьЗаявкуНаПеревозку(Документ.ЗаявкаГУ12ИД);
				Документ.ЗаявкаГУ12 = Документы.э_ЗаявкаНаПеревозку.НайтиПоРеквизиту("ИДЗаявки",Документ.ЗаявкаГУ12ИД);
			КонецЕсли;
			
			Если не Ссылка = Неопределено Тогда
				Документ2 = Ссылка; 				
			Иначе                                      
				Документ2 = Документы.э_Накладная.НайтиПоРеквизиту("НакладнаяИД",Документ.НакладнаяИД);
			КонецЕсли;
			
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало (закомментировал, перенес удаление ниже, чтобы было после логики найти ГВЦ или Ексель и перезалить данные в неё)
			//ДИТ Шевченко А.В. US 58850 TA 73964 22.09.2023
			//Если ЗначениеЗаполнено(Документ2) Тогда
			//	Запрос = Новый Запрос;
			//	Запрос.Текст = 
			//	"ВЫБРАТЬ ПЕРВЫЕ 1
			//	|	э_Накладная.Ссылка КАК Ссылка,
			//	|	э_Накладная.Ссылка.Дата КАК СсылкаДата
			//	|ИЗ
			//	|	Документ.э_Накладная КАК э_Накладная
			//	|ГДЕ
			//	|	э_Накладная.УнифицированныйНомерНакладной = &УнифицированныйНомерНакладной
			//	//|	И э_Накладная.ИсточникНакладной = &ГВЦ
			//	//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, начало
			//	|	И э_Накладная.ИсточникНакладной В(&МассивИсточниковЖДН)
			//	//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, конец
			//	|	И НЕ э_Накладная.ПометкаУдаления
			//	|	И э_Накладная.ТекущееСостояниеНакладной.ДействующийСтатус
			//	|
			//	|УПОРЯДОЧИТЬ ПО
			//	|	СсылкаДата УБЫВ";  
			//	
			//	Запрос.УстановитьПараметр("УнифицированныйНомерНакладной", э_ОбщиеСервер.ПолучитьУнифицированныйНомерНакладной(Документ.НакладнаяНомер));	
			//	//Запрос.УстановитьПараметр("ГВЦ", Перечисления.ИсточникЖДН.ГВЦ);
			//	//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, начало
			//	МассивИсточниковЖДН = Новый Массив();
			//	МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ГВЦ);
			//	МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ЗагрузкаИзEXCEL);
			//	Запрос.УстановитьПараметр("МассивИсточниковЖДН", МассивИсточниковЖДН);
			//	//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, конец
			//	
			//	Выборка = Запрос.Выполнить().Выбрать();
			//	Если Выборка.Следующий() Тогда
			//		НакладнаяГВЦоб = Выборка.Ссылка.ПолучитьОбъект();
			//		НакладнаяГВЦоб.ПометкаУдаления = Истина;
			//		НакладнаяГВЦоб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	КонецЕсли;
			//	
			//КонецЕсли;
			//ДИТ Шевченко А.В. US 58850 TA 73964 22.09.2023
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
			
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало
			ДатаДокумента = ТекущаяДата();
			Если ЗначениеЗаполнено(Документ.ДатаИВремяПринятияГрузаКПеревозкеМестная) Тогда
				ДатаДокумента = Документ.ДатаИВремяПринятияГрузаКПеревозкеМестная;   
			ИначеЕсли ЗначениеЗаполнено(Документ.ДатаИВремяОтправленияГруза) Тогда
				ДатаДокумента = Документ.ДатаИВремяОтправленияГруза;
			ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Дата) Тогда
				ДатаДокумента = ТекущаяДата();
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
			
			//Евросиб Каблов 13.05.2021 ( Ticket#0226746
			Если Не ЗначениеЗаполнено(Документ2) Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	э_Накладная.Ссылка КАК Ссылка,
				|	э_Накладная.Ссылка.Дата КАК СсылкаДата
				|ИЗ
				|	Документ.э_Накладная КАК э_Накладная
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
				|		ПО э_Накладная.Ссылка = э_НакладнаяВагоны.Ссылка
				|			И (э_НакладнаяВагоны.НомерВагона В (&НомераВагонов))
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
				|		ПО э_Накладная.Ссылка = э_НакладнаяКонтейнеры.Ссылка
				|			И (э_НакладнаяКонтейнеры.НомерКонтейнера В (&НомераКонтейнеров))
				|ГДЕ
				//|	э_Накладная.НакладнаяНомер = &НомерНакладной 
				//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало
				|	э_Накладная.УнифицированныйНомерНакладной = &УнифицированныйНомерНакладной
				//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец
				//|	И э_Накладная.ИсточникНакладной = &ГВЦ
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, начало
				|	И э_Накладная.ИсточникНакладной В(&МассивИсточниковЖДН)
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, конец
				|	И НЕ э_Накладная.ПометкаУдаления
				|	И (НЕ э_НакладнаяВагоны.НомерВагона ЕСТЬ NULL
				|			ИЛИ НЕ э_НакладнаяКонтейнеры.НомерКонтейнера ЕСТЬ NULL)
				//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало
				|	И (НАЧАЛОПЕРИОДА(э_Накладная.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
				|			ИЛИ э_Накладная.Дата Между НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ) И &Дата)
				//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
				|
				|УПОРЯДОЧИТЬ ПО
				|	СсылкаДата УБЫВ";
				//Запрос.УстановитьПараметр("НомерНакладной", Документ.НакладнаяНомер);   
				//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало   
				Запрос.УстановитьПараметр("УнифицированныйНомерНакладной", э_ОбщиеСервер.ПолучитьУнифицированныйНомерНакладной(Документ.НакладнаяНомер));
				//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец	
				//Запрос.УстановитьПараметр("ГВЦ", Перечисления.ИсточникЖДН.ГВЦ);
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, начало
				МассивИсточниковЖДН = Новый Массив();
				МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ГВЦ);
				МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ЗагрузкаИзEXCEL);
				Запрос.УстановитьПараметр("МассивИсточниковЖДН", МассивИсточниковЖДН);
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0319829, 06-08-2024, конец
				//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало
				Запрос.УстановитьПараметр("Дата", ДатаДокумента);
				//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
				
				НомераВагонов = Новый Массив;
				Для Каждого СтрокаПоВагону Из Документ.Вагоны Цикл
					Если ЗначениеЗаполнено(СтрокаПоВагону.НомерВагона) Тогда
						НомераВагонов.Добавить(СтрокаПоВагону.НомерВагона);
					КонецЕсли;
				КонецЦикла;
				Запрос.УстановитьПараметр("НомераВагонов", НомераВагонов);
				
				НомераКонтейнеров = Новый Массив;
				Для Каждого СтрокаПоКонтейнеру Из Документ.Контейнеры Цикл
					Если ЗначениеЗаполнено(СтрокаПоКонтейнеру.НомерКонтейнера) Тогда
						НомераКонтейнеров.Добавить(СтрокаПоКонтейнеру.НомерКонтейнера);
					КонецЕсли;
				КонецЦикла;
				Запрос.УстановитьПараметр("НомераКонтейнеров", НомераКонтейнеров);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Документ2 = Выборка.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			//Евросиб Каблов 13.05.2021 ) 
					
			//ДатаДокумента = ТекущаяДата;	 //Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, (закомментировал)
			Если Не Документ2.Пустая() Тогда
				Документ2 = Документ2.ПолучитьОбъект();
				ОбъектыЗаполнения = ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек);
				ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"<Ссылки>",",");
				
				//ДИТ Шевченко А.В. 55332 10.08.2022 -начало
				Если Документ2.ИсточникНакладной = Перечисления.ИсточникЖДН.ЭТРАН Тогда
					СтруктураПоиска = Новый Структура("НомерВагона","");
					ПустыеВагоныВЭтран = Документ.Вагоны.НайтиСтроки(СтруктураПоиска);
					Если ПустыеВагоныВЭтран.Количество() > 0 Тогда
						ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"Вагоны,","");
						СохранитьПорядковыеНомераВагоновВКонтейнерах(Документ2,Документ);
					КонецЕсли;
					//ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"Вагоны,","");
					//Для Каждого СтрокаДок Из Документ.Вагоны Цикл
					//	СтруктураПоиска = Новый Структура("НомерВагона",СтрокаДок.НомерВагона);
					//	МассивСтрокВагонов = Документ2.Вагоны.НайтиСтроки(СтруктураПоиска);
					//	Если МассивСтрокВагонов.Количество() = 0 Тогда
					//		СтруктураПоиска = Новый Структура("НомерВагона","");
					//		МассивСтрокВагонов = Документ2.Вагоны.НайтиСтроки(СтруктураПоиска);
					//		Если МассивСтрокВагонов.Количество() = 0 Тогда
					//			ЗаполнитьЗначенияСвойств(Документ2.Вагоны.Добавить(),СтрокаДок);
					//		Иначе
					//			ЗаполнитьЗначенияСвойств(МассивСтрокВагонов[0],СтрокаДок);
					//		КонецЕсли;
					//	Иначе
					//		ЗаполнитьЗначенияСвойств(МассивСтрокВагонов[0],СтрокаДок);
					//	КонецЕсли;		
					//КонецЦикла; 
				КонецЕсли;
				//ДИТ Шевченко А.В. 55332 10.08.2022 -конец
				
				//Проверим изменения таблицы грузов 
				Если Документ.ГрузыЖД.Количество() > 0 и (не НастройкиЭтран = Неопределено) и НастройкиЭтран.ПерезаполнитьГрузыЕслиЕстьИзменения Тогда
						ПерезаполнитьГрузыЕслиЕстьИзменения = не ПровериьИзмененияТЧГрузы(Документ2,Документ);								
				КонецЕсли;
				
				ЗаполнитьОбъект(Документ2,Документ,ОбъектыЗаполнения);
				//Евросиб Каблов 11.06.2021 ( Ticket#0209893
				Документ2.Охрана = Документ.Охрана;
				//Евросиб Каблов 11.06.2021 )
				Документ = Документ2;
			КонецЕсли;
			
			Если  Документ.Проведен Тогда
				СсылкаРезультат = Документ.Ссылка;
				//Гудкова Возврат Ложь;
			КонецЕсли;	
			
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало (закомменировал, перенес выше)
			//БЫЛО
			//Документ.Дата = ДатаДокумента;
			//Если ЗначениеЗаполнено(Документ.ДатаИВремяПринятияГрузаКПеревозкеМестная) Тогда
			//	Документ.Дата = Документ.ДатаИВремяПринятияГрузаКПеревозкеМестная;   
			//ИначеЕсли ЗначениеЗаполнено(Документ.ДатаИВремяОтправленияГруза) Тогда
			//	Документ.Дата = Документ.ДатаИВремяОтправленияГруза;
			//ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Дата) Тогда
			//	Документ.Дата = ТекущаяДата();
			//КонецЕсли;
			//СТАЛО
			Документ.Дата = ДатаДокумента;
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
			
			//Если ЗначениеЗаполнено(Документ.ДатаИВремяОтправленияГруза) Тогда
			//	Документ.Дата = Документ.ДатаИВремяПринятияГрузаКПеревозкеМестная;  // SIV 07-05-2020 человек, который писал этот код - дебил. 
			//КонецЕсли;     			
			                             
			Документ.Номер = НомерНакладной;
			Документ.ДатаПоследнейЗагрузкиИзЭтран = ТекущаяДата();
			
			Если не ЗначениеЗаполнено(Документ.ЗаявкаГУ12) и ЗначениеЗаполнено(Документ.ЗаявкаГУ12ИД)  Тогда 				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	э_ЗаявкаНаПеревозку.Ссылка
				               |ИЗ
				               |	Документ.э_ЗаявкаНаПеревозку КАК э_ЗаявкаНаПеревозку
				               |ГДЕ
				               |	э_ЗаявкаНаПеревозку.ИДЗаявки = &ИДЗаявки";				
				Запрос.УстановитьПараметр("ИДЗаявки",Документ.ЗаявкаГУ12ИД);  				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();  				
				
				Если Выборка.Количество() = 0 Тогда
					Если ЗагрузитьЗаявкуНаПеревозку(Документ.ЗаявкаГУ12ИД) Тогда
						Документ.ЗаявкаГУ12 = Документы.э_ЗаявкаНаПеревозку.НайтиПоРеквизиту("ИДЗаявки",Документ.ЗаявкаГУ12ИД);
					КонецЕсли;  					
				Иначе 						
					Пока Выборка.Следующий() Цикл 							
						Документ.ЗаявкаГУ12 =  Выборка.Ссылка;							
					КонецЦикла;  						
				КонецЕсли;
				
				
			КонецЕсли;                                                  
			
			//Евросиб Каблов 13.05.2021 ( Ticket#0226746		 
			//Документ.ОсновнаяНакладная = Документы.э_Накладная.НайтиПоРеквизиту("НакладнаяИД",Документ.ОсновнаяНакладнаяИД);
			Если ЗначениеЗаполнено(Документ.ОсновнаяНакладнаяИД) Тогда
				Документ.ОсновнаяНакладная = Документы.э_Накладная.НайтиПоРеквизиту("НакладнаяИД",Документ.ОсновнаяНакладнаяИД);
			КонецЕсли;
			//Евросиб Каблов 13.05.2021 )
			Документ.ИсточникНакладной = Перечисления.ИсточникЖДН.ЭТРАН;
			Документ.Номер = Документ.НакладнаяНомер;
			
			Если Документ.Грузы.Количество() > 0 Тогда   				
				Если (не НастройкиЭтран = Неопределено) и НастройкиЭтран.ПерезаполнятьТаблицуГрузов Тогда
					ПерезаполнитьГрузы = Истина;
				КонецЕсли;			
			Иначе    				
				ПерезаполнитьГрузы = Истина;
			КонецЕсли;
			
	        Документ.пометкаудаления = Ложь;
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Проведение);
				СсылкаРезультат = Документ.Ссылка;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, начало (поиск и удаление дублирующей накладной)
			Если Документ.ТекущееСостояниеНакладнойДействующийСтатус Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	э_Накладная.Ссылка КАК Ссылка,
				|	э_Накладная.Ссылка.Дата КАК СсылкаДата
				|ИЗ
				|	Документ.э_Накладная КАК э_Накладная
				|ГДЕ
				|	э_Накладная.УнифицированныйНомерНакладной = &УнифицированныйНомерНакладной
				|	И э_Накладная.ИсточникНакладной В(&МассивИсточниковЖДН)
				|	И НЕ э_Накладная.ПометкаУдаления
				|	И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус
				|	И (НАЧАЛОПЕРИОДА(э_Накладная.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
				|			ИЛИ э_Накладная.Дата Между НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ) И &Дата)
				|
				|УПОРЯДОЧИТЬ ПО
				|	СсылкаДата УБЫВ";  
				
				Запрос.УстановитьПараметр("УнифицированныйНомерНакладной", э_ОбщиеСервер.ПолучитьУнифицированныйНомерНакладной(Документ.НакладнаяНомер));	
				МассивИсточниковЖДН = Новый Массив();
				МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ГВЦ);
				МассивИсточниковЖДН.Добавить(Перечисления.ИсточникЖДН.ЗагрузкаИзEXCEL);
				Запрос.УстановитьПараметр("МассивИсточниковЖДН", МассивИсточниковЖДН);
				Запрос.УстановитьПараметр("Дата", ДатаДокумента);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НакладнаяГВЦоб = Выборка.Ссылка.ПолучитьОбъект();
					НакладнаяГВЦоб.ПометкаУдаления = Истина;
					НакладнаяГВЦоб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, BUG 89957/TA 89962, 16-08-2024, конец
			
		Если ВсеДокументыЗагрузились Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить("э_Накладная");
			Запись = НаборЗаписей.Добавить();
			Запись.Объект  = "э_Накладная";
			Запись.Граница = НоваяГраницаПериода;
			НаборЗаписей.Записать();
		КонецЕсли;
	

		Возврат Истина;
	
КонецФункции                                                                           

Процедура СохранитьПорядковыеНомераВагоновВКонтейнерах(Приемник,Источник) //ДИТ Шевченко А.В. 55599 17.01.23
		
	Для Каждого СтрокаПриемник Из Приемник.Контейнеры Цикл
		НайденнаяСтрока = Источник.Контейнеры.Найти(СтрокаПриемник.НомерКонтейнера,"НомерКонтейнера");
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.НомерВагонаДляКонтейнерногоПоезда = СтрокаПриемник.НомерВагонаДляКонтейнерногоПоезда;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПровериьИзмененияТЧГрузы(ДокументОригинал,ДокументИзЭТРАН)
	
	 ТаблицаЗначений1 = ДокументОригинал.ГрузыЖД.Выгрузить();
	 ТаблицаЗначений2 = ДокументИзЭТРАН.ГрузыЖД.Выгрузить();
	 
	 Возврат СравнитьТаблицыНаборовЗаписей(ТаблицаЗначений1, ТаблицаЗначений2);	
	
КонецФункции

Процедура ПодгрузитьНовыеЗаявкиНаСервере(Параметр = "", АдресРезультата = Неопределено,operid = Неопределено, НПериода_внешнееУправление = неопределено, КПериода_внешнееУправление = неопределено) Экспорт
	
	//Евросиб - АСуслов 26.11.2024 12:40:45 #96573
	//(
	Возврат;
	//)
	//Евросиб - АСуслов 26.11.2024 12:40:51 #96573
	
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");

	Если не Константы.э_ВебСервис.Получить() Тогда
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("claimNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("claimID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	
	ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_ЗаявкаНаПеревозку"));
    ТекущаяДата = КонецЧаса(ТекущаяДата());    
    НачалоПериода = ГраницаПериодаЗагрузкиДокументов - 3600;

	//Пробуем получить operid. 
	//Если функция возвращает 999999999999999(нет записи по запросу), тогда грузим по периоду
	Очищатьoperid = Ложь;
	Если operid = "999999999999999" Тогда 
		Очищатьoperid = Истина;
		ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_ЗаявкаНаПеревозку"));
		НачалоПериода = ГраницаПериодаЗагрузкиДокументов;// - 7200;
	Иначе
		operid = ПолучитьНомерПоследнейОперации(Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);  
		НачалоПериода = ТекущаяДата-1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НПериода_внешнееУправление) Тогда
		Очищатьoperid = Истина;
		НачалоПериода = НПериода_внешнееУправление;
		operid = "999999999999999";
		ГраницаПериодаЗагрузкиДокументов = НачалоЧаса(ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_ЗаявкаНаПеревозку"));
		
	КонецЕсли;
	
	Пока НачалоПериода < ТекущаяДата Цикл
		
		Таблица.Очистить();
		
		КонецПериода = НачалоЧаса(НачалоПериода) + 3599;
		
		Если ЗначениеЗаполнено(КПериода_внешнееУправление) Тогда
			КонецПериода = КПериода_внешнееУправление;
		КонецЕсли;
		
		ТекстЗапроса = "<claimToAgreementStatus version=""1.0"">";
		//|<fromDate value=""" + (НачалоПериода -1) + """/>
		//|<toDate value=""" + (КонецПериода+1) + """/>
		//|<OperId value=""999999999999999""/>
		Если operid = "999999999999999" Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<fromDate value=""" + (НачалоПериода -1) + """/>
			|<toDate value=""" + (КонецПериода+1) + """/>
			|<OperId value=""999999999999999""/>";
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<OperId value="""+operid+"""/>"; 
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|<usePayer/><useViza/><useAgreement/><useCancel/></claimToAgreementStatus>";
		
		
		Если operid = "999999999999999" Тогда 
			НачалоПериода = КонецПериода+1;	
		КонецЕсли; 
		
		
		ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
		
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
		//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос статуса заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран",НомерТранзакции);
		
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 		ЗаписатьЛогЭТРАН("Запрос статуса заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран",НомерТранзакции);
		
		НомерТранзакции = НомерТранзакции + 1;
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		Иначе
			
			Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
				КоличествоПовторов = 0;
				Пока КоличествоПовторов < 5 Цикл
					ПаузаВСекундах(30);// 0,5 минуты
					Если Константы.э_ВебСервис.Получить() Тогда
						РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
					Иначе 
						РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
					КонецЕсли;
					РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
					Если не РезультатПроверки.КодОшибки = "100" Тогда
						РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
						Прервать;	
					КонецЕсли;
					КоличествоПовторов = КоличествоПовторов + 1;
				КонецЦикла;  				
			КонецЕсли;
			
			//СКА 19102019
			Если РезультатПроверки.КодОшибки = "1" Тогда
				Продолжить;
			КонецЕсли;
			//СКА 19102019

		КонецЕсли;
		
		
		Если РезультатЗапроса = Неопределено Тогда                            
			ВсеДокументыЗагрузились = Ложь;
			Продолжить;
		КонецЕсли;
		
		// Заполнение Таблицы
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
		Строка = Неопределено;
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "claim" Тогда
				Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
			ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				OperId = ЧтениеXML.ПолучитьАтрибут("value");
				Строка = Неопределено; // на всякий случай
				ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);
				Если Очищатьoperid Тогда
					operid = "999999999999999";
				КонецЕсли; 
			ИначеЕсли Строка <> Неопределено Тогда
				Попытка
					Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;  
		
		Если operid = "999999999999999" Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,"э_ЗаявкаНаПеревозку");
		КонецЕсли;

		//СКА 19102019
		Если Таблица.Количество() = 0 Тогда  
			Если operid = "999999999999999" Тогда 
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;   		
		КонецЕсли;
		
		//Если Таблица.Количество() = 0 Тогда////////////////////////////////////////////  			
		//	Продолжить;
		//КонецЕсли;
		//СКА 19102019
		
		//Сообщить("Начало загрузки документов из списка: " + ТекущаяДата());
		Для Каждого Выборка Из Таблица Цикл
			
			ИДЗаявки	= Выборка.claimID;
			НомерЗаявки	= Выборка.claimNumber;
			ТекстЗапроса = "<getClaim version=""1.0"">
			|<claimID value=""" + ИДЗаявки + """/>
			|<claimNumber value=""" + НомерЗаявки + """/>
			// ?????? - frontEndId должен быть передан клиентский идентификатор передаваемого запроса
			|<frontEndId value=""" + ИДЗаявки + """/>
			//Использование 6-значных кодов станций и грузов в ответе --- ТекстЗапроса = ТекстЗапроса + "<useMod11/>";
			|<useMod11/>
			|</getClaim>";
			
			Если Константы.э_ВебСервис.Получить() Тогда
				РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
			Иначе 
				РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
			КонецЕсли;

		КонецЦикла;
		
		//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос данных заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран",НомерТранзакции);
		
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656  		ЗаписатьЛогЭТРАН("Запрос данных заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран",НомерТранзакции);
		
		НомерТранзакции = НомерТранзакции +1;
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656  
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		Иначе
			
			Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
			//Повторяем запрос	
				КоличествоПовторов = 0;
				Пока КоличествоПовторов < 5 Цикл
					ПаузаВСекундах(30);// 0,5 минуты
					Если Константы.э_ВебСервис.Получить() Тогда
						РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
					Иначе 
						РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
					КонецЕсли;
					РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
					Если не РезультатПроверки.КодОшибки = "100" Тогда
						РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
						Прервать;	
					КонецЕсли;
					КоличествоПовторов = КоличествоПовторов + 1;
				КонецЦикла;  				
			КонецЕсли;
			
			//СКА 19102019
			Если РезультатПроверки.КодОшибки = "1" Тогда
				Продолжить;
			КонецЕсли;
			//СКА 19102019

		КонецЕсли;
		//РезультатЗапроса = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,ложь); //Если в результате содержатся ошибки, то возврат Неопределено
		//\15022018 Добавляем получение кода ошибки
		
		ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
		
		Если РезультатЗапроса = Неопределено Тогда                            
			ВсеДокументыЗагрузились = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(, "Загрузка заявки: " + НомерЗаявки);
		
		Рез = ЗаполнитьДокументЗаявкаНаПеревозку(РезультатЗапроса,ВсеДокументыЗагрузились,НомерЗаявки,НачалоПериода,КонецПериода,ТекущаяДата(),Неопределено);
		
		Если ЗначениеЗаполнено(НПериода_внешнееУправление) тогда Прервать; КонецЕсли;
		
	КонецЦикла;
	

глЭтранИдетЗагрузка = Ложь;
//Попытка
//	глЭтран.disconnect();
//Исключение
//КонецПопытки;



КонецПроцедуры

Функция ПодгрузитьЗаявкиПоПериоду(НПериода_внешнееУправление = неопределено, КПериода_внешнееУправление = неопределено, НовыйМеханизмЗапроса, Регламент) Экспорт
	
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("claimNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("claimID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	НачалоПериода = НПериода_внешнееУправление;
	КонецПериода = КПериода_внешнееУправление;
//Евросиб - АСуслов 26.11.2024 12:36:47 #96573
//(
	Если НовыйМеханизмЗапроса Тогда
		МассивОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
	Иначе
		МассивОтвета = ПономернойЗапросВЭтран(Таблица,ВсеДокументыЗагрузились,НачалоПериода,КонецПериода,НомерТранзакции,Регламент);
	КонецЕсли;
	
	Возврат МассивОтвета;
//)
//Евросиб - АСуслов 26.11.2024 12:36:54 #96573	
	
	ТекстЗапроса = "<claimToAgreementStatus version=""1.0"">
					|<fromDate value=""" + (НачалоПериода -1) + """/>
					|<toDate value=""" + (КонецПериода+1) + """/>
					|<OperId value=""999999999999999""/>
					|<usePayer/><useViza/><useAgreement/><useCancel/></claimToAgreementStatus>";
	
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	
	// записывается текст каждого запроса и ответ на него
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656   	ЗаписатьЛогЭТРАН("Запрос статуса заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран",НомерТранзакции);
	НомерТранзакции = НомерТранзакции + 1;
	
	// структура с кодом ошибки
	РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656   
	Если РезультатПроверки.КодОшибки = Неопределено Тогда 
		РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
	Иначе
		СписокНезагруженных = Новый Массив;
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("ПериодЗапроса","с " + Строка(НачалоПериода) + " по " + Строка(КонецПериода));
		СтруктураОшибки.Вставить("ТекстОшибки",РезультатПроверки.ТекстОшибки);
		СписокНезагруженных.Добавить(СтруктураОшибки);
		
		ПериодЗапроса = Новый СтандартныйПериод;
		ПериодЗапроса.ДатаНачала = НачалоПериода;
		ПериодЗапроса.ДатаОкончания = КонецПериода;
		
		ЗаписатьОшибкиЗагрузкиЭТРАН("Запрос заголовков заявок за период", ТекстЗапроса, РезультатЗапроса, Регламент, РезультатПроверки.ТекстОшибки, "", ПериодЗапроса);
		
	КонецЕсли;
	Если РезультатЗапроса = Неопределено Тогда                            
		ВсеДокументыЗагрузились = Ложь;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	Строка = Неопределено;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "claim" Тогда
			Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
		ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			OperId = ЧтениеXML.ПолучитьАтрибут("value");
			Строка = Неопределено; // на всякий случай
		ИначеЕсли Строка <> Неопределено Тогда
			Попытка
				Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;  
	
	Если НовыйМеханизмЗапроса Тогда
		МассивОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
	Иначе
		МассивОтвета = ПономернойЗапросВЭтран(Таблица,ВсеДокументыЗагрузились,НачалоПериода,КонецПериода,НомерТранзакции,Регламент);
	КонецЕсли;
	
	Возврат МассивОтвета;
	
КонецФункции

Функция ПономернойЗапросВЭтран(Таблица,ВсеДокументыЗагрузились,НачалоПериода,КонецПериода,НомерТранзакции,Регламент) ЭКСПОРТ
	
	СписокНезагруженных = Новый Массив;  
	//Евросиб - АСуслов 26.11.2024 12:39:54 #96573
	//(
	Возврат СписокНезагруженных;
	//)
	//Евросиб - АСуслов 26.11.2024 12:40:01 #96573
	
	Для Каждого Выборка Из Таблица Цикл
		
		ИДЗаявки	= Выборка.claimID;
		НомерЗаявки	= Выборка.claimNumber;
		ТекстЗапроса = "<getClaim version=""1.0"">
						|<claimID value=""" + ИДЗаявки + """/>
						|<claimNumber value=""" + НомерЗаявки + """/>
						|<frontEndId value=""" + ИДЗаявки + """/>
						|<useMod11/>
						|</getClaim>";
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656    	ЗаписатьЛогЭТРАН("Запрос данных заявки на перевозку", ТекстЗапроса, РезультатЗапроса, , "Этран", НомерТранзакции);
		НомерТранзакции = НомерТранзакции +1;
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656    
		
		Если РезультатПроверки.КодОшибки = Неопределено Тогда 
			РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
		Иначе
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("ИДЗаявки",ИДЗаявки);
			СтруктураОшибки.Вставить("ТекстОшибки",РезультатПроверки.ТекстОшибки);
			СписокНезагруженных.Добавить(СтруктураОшибки);
			
			ПериодЗапроса = Новый СтандартныйПериод;
			ПериодЗапроса.ДатаНачала = НачалоПериода;
			ПериодЗапроса.ДатаОкончания = КонецПериода;
			
			ЗаписатьОшибкиЗагрузкиЭТРАН("Пономерной запрос заявок на перевозку", ТекстЗапроса, РезультатЗапроса, Регламент, РезультатПроверки.ТекстОшибки, ИДЗаявки, ПериодЗапроса);
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
		Если РезультатЗапроса = Неопределено Тогда                            
			ВсеДокументыЗагрузились = Ложь;
		КонецЕсли;
		ДлительныеОперации.СообщитьПрогресс(, "Загрузка заявки: " + НомерЗаявки);
		
		Рез = ЗаполнитьГУ12(РезультатЗапроса,ВсеДокументыЗагрузились,ИДЗаявки,НачалоПериода,КонецПериода,ТекущаяДата(),НомерЗаявки,Регламент);
		
		Если НЕ Рез Тогда
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("ИДЗаявки",ИДЗаявки);
			СтруктураОшибки.Вставить("ТекстОшибки","Не удалось записать документ");
			СписокНезагруженных.Добавить(СтруктураОшибки);
		КонецЕсли;
		
	КонецЦикла;

	Возврат СписокНезагруженных;
	
КонецФункции	

Процедура ЗагрузкаЗаявокПоРегламенту() Экспорт
	
	ПоследняяЗагрузка = Константы.ДатаПоследнейЗагрузкиГУЭТРАН.Получить();
	
	Если НЕ ЗначениеЗаполнено(ПоследняяЗагрузка) Тогда
		ПериодЗапроса = Новый СтандартныйПериод;
		ПериодЗапроса.ДатаНачала = ТекущаяДата();
		ПериодЗапроса.ДатаОкончания = ТекущаяДата();
		ЗаписатьОшибкиЗагрузкиЭТРАН("Регламентное задание по загрузке ГУ-12", "", "", Истина, "Не установлена дата последней успешной загрузки", "", ПериодЗапроса);
		Возврат;
	КонецЕсли;
	
	НачалоЦиклическогоПериода = ПоследняяЗагрузка;
	
	Пока НачалоЦиклическогоПериода < ТекущаяДата() Цикл
		
		НачалоПериодаЗагрузки = НачалоЦиклическогоПериода-2*3600;
		КонецПериодаЗагрузки = НачалоЦиклическогоПериода-1*3600;
		
		СтруктураОтветаЭтран = э_ОбщиеСервер.ПодгрузитьЗаявкиПоПериоду(НачалоПериодаЗагрузки, КонецПериодаЗагрузки, ЛОЖЬ, Истина);
		
		Если СтруктураОтветаЭтран.Количество() = 0 Тогда
			Константы.ДатаПоследнейЗагрузкиГУЭТРАН.Установить(КонецПериодаЗагрузки);
		Иначе
			Прервать;
		КонецЕсли;
		
		НачалоЦиклическогоПериода = НачалоЦиклическогоПериода + 3600;
		
	КонецЦикла;
	
	//НачалоПериодаЗагрузки = ПоследняяЗагрузка-1*3600;
	//КонецПериодаЗагрузки = ПоследняяЗагрузка+1*3600;
	//
	//СтруктураОтветаЭтран = э_ОбщиеСервер.ПодгрузитьЗаявкиПоПериоду(НачалоПериодаЗагрузки, КонецПериодаЗагрузки, ЛОЖЬ, Истина);
	//
	//// перезаписываем дату только если загрузка прошла без ошибок
	//Если СтруктураОтветаЭтран.Количество() = 0 Тогда
	//	Константы.ДатаПоследнейЗагрузкиГУЭТРАН.Установить(КонецПериодаЗагрузки);
	//КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьДокументЗаявкаНаПеревозку(РезультатЗапроса,ВсеДокументыЗагрузились,НомерЗаявки,НачалоПериода,КонецПериода,ТекущаяДата,Ссылка)Экспорт
	
			
	ЗапросОбщиеПоказатели = Новый Запрос;
	ЗапросОбщиеПоказатели.Текст = "ВЫБРАТЬ
	                              |	э_ОбщиеПоказатели.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.э_ОбщиеПоказатели КАК э_ОбщиеПоказатели
	                              |ГДЕ
	                              |	э_ОбщиеПоказатели.Наименование = &Наименование
	                              |	И э_ОбщиеПоказатели.ИдентификаторПараметра = &ИдентификаторПараметра";
	ПустаяСсылкаОбщиеПоказатели = Справочники.э_ОбщиеПоказатели.ПустаяСсылка();
	
	Документ = Документы.э_ЗаявкаНаПеревозку.СоздатьДокумент(); 
	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	
	Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
	ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
	СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
	
	Если Ссылка = неопределено Тогда
		Документ2 = Документы.э_ЗаявкаНаПеревозку.НайтиПоРеквизиту("ИДЗаявки",Документ.ИДЗаявки);  
	Иначе
		Документ2 = Ссылка;  			
	КонецЕсли;
	
	Ошибки = "";
	Если Найти(РезультатЗапроса,"<warning>") > 0 Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);		
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "warning" Тогда
				Ошибки = ЧтениеXML.ПолучитьАтрибут("value");			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	

		
	Если Не Документ2.Пустая() Тогда
		Документ2 = Документ2.ПолучитьОбъект();
		ОбъектыЗаполнения = ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек);
		ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"<Ссылки>",",");
		ЗаполнитьОбъект(Документ2,Документ,ОбъектыЗаполнения);
		Документ = Документ2;
	КонецЕсли;                                
	
	Документ.Дата =  Документ.ДатаРегистрации;//Документ.claimRegDate;
	Документ.Номер = НомерЗаявки;
	Документ.Ошибки = Ошибки;
	
		
	Если Документ.Отправки.Количество() > 0 Тогда
		ПаспортОрганизации = Справочники.э_ПаспортаОрганизаций.НайтиПоКоду(XMLСтрока(Документ.Отправки[0].ГрузополучательИД)); 	
			
	КонецЕсли;
	
	Для каждого СтрокаОтправки Из Документ.Плательщики Цикл  		
		   Плательщик  =  ПолучитьПлательщика(СтрокаОтправки);
		   Если ЗначениеЗаполнено(Плательщик) Тогда
				 //ЗаполнитьЗначенияСвойств(СтрокаОтправки,Плательщик);
				 СтрокаОтправки.Плательщик = Плательщик; 
				 Документ.Плательщик  = Плательщик;
		   КонецЕсли;
		   
	КонецЦикла;
	
	

	 
	Попытка
		Документ.ПредыдущийЗапросНеПолучен = ложь;         
		Документ.Записать();
	Исключение
	
	КонецПопытки;
	
	Если ВсеДокументыЗагрузились Тогда
		НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
		НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить("э_ЗаявкаНаПеревозку");
		Запись = НаборЗаписей.Добавить();
		Запись.Объект  = "э_ЗаявкаНаПеревозку";
		Запись.Граница = НоваяГраницаПериода;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьГУ12(РезультатЗапроса,ВсеДокументыЗагрузились,ИДЗаявки,НачалоПериода,КонецПериода,ТекущаяДата,НомерЗаявки,Регламент)Экспорт
	
	НайденнаяЗаявка = Документы.э_ЗаявкаНаПеревозку.НайтиПоРеквизиту("ИДЗаявки",ИДЗаявки);  
	Если Не НайденнаяЗаявка.Пустая() Тогда
		ДокументЗаявка = НайденнаяЗаявка.ПолучитьОбъект();
	Иначе
		ДокументЗаявка = Документы.э_ЗаявкаНаПеревозку.СоздатьДокумент();
	КонецЕсли;
	
	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	
	Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
	ЗаполнитьОбъектИзXML(ДокументЗаявка,Соответствие,СоответствиеПеревод,РезультатЗапроса);
	СоздатьСсылкиПоРеквизитам(ДокументЗаявка,МакетНастроек);
	
	Ошибки = "";
	Если Найти(РезультатЗапроса,"<warning>") > 0 Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);		
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "warning" Тогда
				Ошибки = ЧтениеXML.ПолучитьАтрибут("value");			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	//ДокументЗаявка.Номер = НомерЗаявки;
	ДокументЗаявка.Дата = ДокументЗаявка.ДатаРегистрации;
	ДокументЗаявка.Ошибки = Ошибки;
	
		
	Если ДокументЗаявка.Отправки.Количество() > 0 Тогда
		ПаспортОрганизации = Справочники.э_ПаспортаОрганизаций.НайтиПоКоду(XMLСтрока(ДокументЗаявка.Отправки[0].ГрузополучательИД)); 	
	КонецЕсли;
	
	Попытка
		ДокументЗаявка.ПредыдущийЗапросНеПолучен = ложь;         
		ДокументЗаявка.Записать();
	Исключение
		ОО = ОписаниеОшибки();
		ПериодЗапроса = Новый СтандартныйПериод;
		ПериодЗапроса.ДатаНачала = НачалоПериода;
		ПериодЗапроса.ДатаОкончания = КонецПериода;
		ЗаписатьОшибкиЗагрузкиЭТРАН("Запись ГУ-12 в БД", "", "", Регламент, ОО, ИДЗаявки, ПериодЗапроса);
		Возврат Ложь;
	КонецПопытки;
	
	Если ВсеДокументыЗагрузились Тогда
		НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
		НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить("э_ЗаявкаНаПеревозку");
		Запись = НаборЗаписей.Добавить();
		Запись.Объект  = "э_ЗаявкаНаПеревозку";
		Запись.Граница = НоваяГраницаПериода;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПлательщика(СтрокаОтправки)
	
	Возврат Неопределено;

	Если СтрокаОтправки.ПлательщикОКПО = "" Тогда
		Плательщик = Справочники.э_Перевозчики.НайтиПоРеквизиту("УсловныйИдентификаторПеревозчика",СтрокаОтправки.УсловныйИдентификаторПеревозчика);
	Иначе
		Плательщик = Справочники.э_Перевозчики.НайтиПоРеквизиту("ПлательщикОКПО",СтрокаОтправки.ПлательщикОКПО);	
	КонецЕсли;

	Если ЗначениеЗаполнено(Плательщик) Тогда
		НовЭл =	Плательщик.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(НовЭл,СтрокаОтправки);
		НовЭл.Наименование =  СтрокаОтправки.ПлательщикНаименование;
		Попытка
			НовЭл.Записать();
		Исключение
			Возврат Неопределено;
		КонецПопытки;

		Возврат НовЭл.Ссылка;    
	Иначе
		НовЭл =	Справочники.э_Перевозчики.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовЭл,СтрокаОтправки);
		НовЭл.Наименование =  СтрокаОтправки.ПлательщикНаименование;
		Попытка
			НовЭл.Записать();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат НовЭл.Ссылка;
		
	КонецЕсли;          	                                                             
	
	
КонецФункции

Функция ПолучитьТипРейса(КодСтНазначения) Экспорт
	         	                                                             
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКонтейнер(СтрокаТС)
	
	ISO = СтрокаТС.РазмерКрупнотоннажногоКонтейнера.КодРазмера  + СтрокаТС.ТипКрупнотоннажногоКонтейнера.КодТипа;
	
	ТипКонт = Справочники.э_ТипыКонтейнеров.НайтиПоРеквизиту("ISO",ISO);
	
	Если ЗначениеЗаполнено(ТипКонт) Тогда 		
	Иначе 
		
		//Создавать типы не будем, будем подставлять простые типы
		Если СтрокаТС.РазмерКрупнотоннажногоКонтейнера.НоминальнаяДлиннаВФутах = 20 тогда
			ТипКонт = Справочники.э_ТипыКонтейнеров.НайтиПоРеквизиту("ISO","20G1");
		Иначе
			ТипКонт = Справочники.э_ТипыКонтейнеров.НайтиПоРеквизиту("ISO","40G1");			
		КонецЕсли;
		
		
	КонецЕсли;
	

	
	
	
	НомерКонтейнера = СтрокаТС.НомерКонтейнера; 
	
	РезСПр = Справочники.э_Контейнеры.НайтиПоНаименованию(НомерКонтейнера);	
	ЕСли ЗначениеЗаполнено(РезСПр) Тогда
		//Возврат  РезСПр;
		НовСпр =  РезСПр.ПолучитьОбъект();  
	Иначе
		НовСпр =  Справочники.э_Контейнеры.СоздатьЭлемент();  
	КонецЕсли;
	
		
	НовСпр.Наименование = НомерКонтейнера;
	НовСпр.НомерКонтейнера = НомерКонтейнера;
	НовСпр.ТипКонтейнера = ТипКонт;
	НовСпр.Записать();
	
	Возврат НовСпр;
	
КонецФункции

Функция ПолучитьВагон(НомерВагона)
	
	Вагон = Справочники.э_Вагоны.НайтиПоКоду(НомерВагона);
	
	Если ЗначениеЗаполнено(Вагон) Тогда 	
		Возврат Вагон;
	Иначе 
		
		Вагон =  Справочники.э_Вагоны.СоздатьЭлемент();        
		Вагон.Код = НомерВагона;
		Вагон.Записать();
		Возврат Вагон.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция ЗагрузитьЗаявкуНаПеревозку(ИДЗаявки) Экспорт
	
	//Евросиб - АСуслов 26.11.2024 12:31:16 #96573
	//(
	Возврат Ложь;
	//)
	//Евросиб - АСуслов 26.11.2024 12:31:41 #96573
	Если ИДЗаявки = "" Тогда
		Возврат Документы.э_ЗаявкаНаПеревозку.ПустаяСсылка();
	КонецЕсли;
	
	Если не Константы.э_ВебСервис.Получить() Тогда  
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;


	ТекстЗапроса = "<getClaim version=""1.0"">
	|<claimID value=""" + ИДЗаявки + """/>
	//|<claimNumber value=""" + НомерЗаявки + """/>
	// ?????? - frontEndId должен быть передан клиентский идентификатор передаваемого запроса
	|<frontEndId value=""" + ИДЗаявки + """/>
	//Использование 6-значных кодов станций и грузов в ответе --- ТекстЗапроса = ТекстЗапроса + "<useMod11/>";
	|<useMod11/>
	|</getClaim>";
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса); 	
	КонецЕсли;

	//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос данных заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656     	ЗаписатьЛогЭТРАН("Запрос данных заявки на перевозку", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	//15022018 Добавляем получение кода ошибки
	РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных заявки на перевозку"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656     
	Если РезультатПроверки.КодОшибки = Неопределено Тогда 
		РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
	Иначе
		
		Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
			КоличествоПовторов = 0;
			Пока КоличествоПовторов < 5 Цикл
				ПаузаВСекундах(30);// 0,5 минуты
				Если Константы.э_ВебСервис.Получить() Тогда
					РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
				Иначе 
					РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
				КонецЕсли;
				РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
				Если не РезультатПроверки.КодОшибки = "100" Тогда
					РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
					Прервать;	
				КонецЕсли;
				КоличествоПовторов = КоличествоПовторов + 1;
			КонецЦикла;  				
		КонецЕсли;
		
		//СКА 19102019
		Если РезультатПроверки.КодОшибки = "1" Тогда
			Возврат ложь; 
		КонецЕсли;
		//СКА 19102019

			
	КонецЕсли;
	//РезультатЗапроса = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,ложь); //Если в результате содержатся ошибки, то возврат Неопределено
	//\15022018 Добавляем получение кода ошибки
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат ложь;
	Иначе
		Возврат ЗаполнитьДокументЗаявкаНаПеревозку(РезультатЗапроса,ложь,"",ТекущаяДата(),ТекущаяДата(),ТекущаяДата(),Неопределено);
	КонецЕсли;

КонецФункции

Процедура ЗагрузитьНакладную(ПараметрыПроцедуры, МассивРезультатов) Экспорт
	
	Если ПараметрыПроцедуры.ИДНакладной = Неопределено  и ПараметрыПроцедуры.НомерНакладной = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Если не Константы.э_ВебСервис.Получить() Тогда  
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	//Если глЭтран = Неопределено Тогда
	//	МассивРезультатов.Добавить(Новый Структура("Ссылка, Сообщение", Неопределено, "Не удалось подключиться к ЭТРАН"));
	//	Возврат;
	//КонецЕсли;
	
	ТекстЗапроса = "<getInvoice version=""1.0"">";
	Если не ПараметрыПроцедуры.ИДНакладной = Неопределено Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|<invoiceID value=""" + ПараметрыПроцедуры.ИДНакладной + """/>";
	ИначеЕсли  не ПараметрыПроцедуры.НомерНакладной = Неопределено Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|<invNumber value=""" + ПараметрыПроцедуры.НомерНакладной + """/>";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса +"
	|<useMod11/><useValid/>
	|</getInvoice>";
	
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;
	
	//15022018 Добавляем получение кода ошибки
	РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      
	Если РезультатПроверки.КодОшибки = Неопределено Тогда 
		РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
	Иначе
		
		Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
			
			//Повторяем запрос 45  по 180 секунд, около 1,5 часа	
			КоличествоПовторов = 0;
			Пока КоличествоПовторов < 5 Цикл
				ПаузаВСекундах(30);// 0,5 минуты
				Если Константы.э_ВебСервис.Получить() Тогда
					РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
				Иначе 
					РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
				КонецЕсли;
				РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      
				Если не РезультатПроверки.КодОшибки = "100" Тогда
					РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
					Прервать;	
				КонецЕсли;
				КоличествоПовторов = КоличествоПовторов + 1;
			КонецЦикла;  
			
		КонецЕсли; 
		
		//СКА 19102019
		Если РезультатПроверки.КодОшибки = "1" 
			ИЛИ РезультатПроверки.КодОшибки = "0" 
			ИЛИ (РезультатПроверки.КодОшибки = "4" 
				И Не РезультатПроверки.СтатусКод = "407") Тогда // 407 Документ платный, обращаемся к Ритму // SIV 09-12-2020 добавил код ошибки 0
			Возврат;
		КонецЕсли;
		//СКА 19102019
		
		// Рыбьяков К.А 03.05.2024 Ticket#0350495  
		Если РезультатПроверки.СтатусКод = "407" И ЗначениеЗаполнено(ПараметрыПроцедуры.ИДНакладной) Тогда // Документ платный, обращаемся к Ритму
			РезультатЗапроса = ЗапроситьНакладнуюВРИТМе(ПараметрыПроцедуры.ИДНакладной); 					
		КонецЕсли;
		// Рыбьяков К.А 03.05.2024 Ticket#0350495
		
	КонецЕсли;
	//РезультатЗапроса = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,ложь); //Если в результате содержатся ошибки, то возврат Неопределено
	//\15022018 Добавляем получение кода ошибки
	
	ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
	
	//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656 
	//Если РезультатЗапроса = Неопределено ИЛИ СтрНайти(РезультатЗапроса, "<error>") > 0 Тогда                            
	//	ЗаписатьЛогЭТРАН("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
	//	Возврат;
	//КонецЕсли;
	//Евросиб Гудкова) 04.09.2020 Ticket№ 0205656 	
	
	//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      	ЗаписатьЛогЭТРАН("Запрос данных накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	ДлительныеОперации.СообщитьПрогресс(, "Загрузка накладной");
	
	СсылкаНаНакладную = Неопределено;
	
	Рез = ЗаполнитьДокументНакладная(РезультатЗапроса,ложь,ПараметрыПроцедуры.НомерНакладной,ТекущаяДата(),ТекущаяДата(),ТекущаяДата(),, СсылкаНаНакладную);
	
	Если Рез = Истина Тогда
		МассивРезультатов.Добавить(Новый Структура("Ссылка, Сообщение", СсылкаНаНакладную, "Накладная " + ПараметрыПроцедуры.НомерНакладной + " загружена"));
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьНакладнуюПоНомеруВагона(НомерВагона = "", АдресРезультата = Неопределено) Экспорт
	
	Если не Константы.э_ВебСервис.Получить() Тогда  
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	
	ВозвращаемаяСтруктура = Новый Структура("Ссылка, Сообщение, НомерВагона",,,НомерВагона);
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	

	ТекстЗапроса = "<invoiceByCar version=""1.0""> 
	|<car><carNumber value=""" + НомерВагона + """/></car> 
	//|<invToStation value=" + НомерВагона + """/>	
	|<all/></invoiceByCar>";
	
	//Если глЭтран = Неопределено Тогда
	//	ВозвращаемаяСтруктура.Сообщение = "Не удалось подключиться к ЭТРАН";
	//	ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
	//	Возврат;
	//КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;

	//Если СтрНайти(РезультатЗапроса,"invoiceId") = 0 Тогда	
	//	
	//	ТекстЗапроса = "<invoiceByCar version=""1.0""> 
	//	|<car><carNumber value=""" + НомерВагона + """/></car> 
	//	//|<invToStation value=" + НомерВагона + """/>	
	//	|<all/></invoiceByCar>";
	//	
	//	РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	//КонецЕсли;
	
	
	Если СтрНайти(РезультатЗапроса,"invoiceId") = 0 Тогда
		ВозвращаемаяСтруктура.Сообщение = "Накладная не найдена в ЭТРАН";
		ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");

	
	МассивНакладных = Новый Массив; 		
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	НакладнаяИД = "";
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "invoiceId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НакладнаяИД = ЧтениеXML.ПолучитьАтрибут("value");			
			НакладнаяНомерИД = Новый Структура("НомерНакладной, НакладнаяИД, ДатаОперации, СтанцияНазначения");
			НакладнаяНомерИД.Вставить("НакладнаяИД", НакладнаяИД); 
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "invNumber" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НомерНакладной = ЧтениеXML.ПолучитьАтрибут("value"); 
			НакладнаяНомерИД.Вставить("НомерНакладной", НомерНакладной); 
			//МассивНакладных.Добавить(НакладнаяНомерИД);	
		КонецЕсли;

		Если ЧтениеXML.Имя = "invoiceLastOper" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ДатаОперации = ЧтениеXML.ПолучитьАтрибут("value"); 
			
			Попытка
				ПериодНакладной = Дата(Сред(ДатаОперации,7,4) + Сред(ДатаОперации,4,2) + Лев(ДатаОперации,2));
			Исключение  				
				ПериодНакладной = Дата('0001.01.01');
			КонецПопытки;
			
			Если ПериодНакладной < (НачалоМесяца(ТекущаяДата()) - 3600*25*30) Тогда
				продолжить;
			Иначе
			КонецЕсли;  

			
			НакладнаяНомерИД.Вставить("ДатаОперации", ПериодНакладной); 
			//МассивНакладных.Добавить(НакладнаяНомерИД);	
		КонецЕсли;

		
		                                  
		Если ЧтениеXML.Имя = "invToStation" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			СтанцияНазначения = ЧтениеXML.ПолучитьАтрибут("value");
			НакладнаяНомерИД.Вставить("СтанцияНазначения", СтанцияНазначения);
			
			Если ЗначениеЗаполнено(НакладнаяНомерИД.НомерНакладной) и ЗначениеЗаполнено(НакладнаяНомерИД.НакладнаяИД) Тогда
				
				МассивНакладных.Добавить(НакладнаяНомерИД);	
				
			КонецЕсли;
			
			
		КонецЕсли;

		
	КонецЦикла; 
	
	МассивРезультатов = Новый Массив;
	
	
	
	
	Для каждого ЭлМасс из МассивНакладных Цикл
		
		Если не НакладнаяИД = "" Тогда
			ДлительныеОперации.СообщитьПрогресс(, "Загрузка накладной: " + ЭлМасс.НакладнаяИД);
			ЗагрузитьНакладную(Новый Структура("ИДНакладной, НомерНакладной", ЭлМасс.НакладнаяИД,ЭлМасс.НомерНакладной), МассивРезультатов);
		Иначе
			МассивРезультатов.Добавить(Новый Структура("Ссылка, Сообщение", Неопределено, "Накладная " + Строка(ЭлМасс.НомерНакладной) + " не загружена"));
		КонецЕсли;
	КонецЦикла;
	
	ВозвращаемаяСтруктура.Вставить("МассивРезультатов", МассивРезультатов);
				
	ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);	
	
КонецПроцедуры

Процедура ЗагрузитьОднуНакладнуюПоНомеруВагона(НомерВагона = "", АдресРезультата = Неопределено) Экспорт
	
	Если не Константы.э_ВебСервис.Получить() Тогда  
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
		
	
	ВозвращаемаяСтруктура = Новый Структура("Ссылка, Сообщение, НомерВагона",,,НомерВагона);
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	

	ТекстЗапроса = "<invoiceByCar version=""1.0""> 
	|<car><carNumber value=""" + НомерВагона + """/></car> 
	//|<invToStation value=" + НомерВагона + """/>	
	|<all/></invoiceByCar>";
	
	//Если глЭтран = Неопределено Тогда
	//	ВозвращаемаяСтруктура.Сообщение = "Не удалось подключиться к ЭТРАН";
	//	ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
	//	Возврат;
	//КонецЕсли;
	//
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;

	//Если СтрНайти(РезультатЗапроса,"invoiceId") = 0 Тогда	
	//	
	//	ТекстЗапроса = "<invoiceByCar version=""1.0""> 
	//	|<car><carNumber value=""" + НомерВагона + """/></car> 
	//	//|<invToStation value=" + НомерВагона + """/>	
	//	|<all/></invoiceByCar>";
	//	
	//	РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	//КонецЕсли;
	
	
	Если СтрНайти(РезультатЗапроса,"invoiceId") = 0 Тогда
		ВозвращаемаяСтруктура.Сообщение = "Накладная не найдена в ЭТРАН";
		ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");

	
	МассивНакладных = Новый Массив; 		
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	НакладнаяИД = "";
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "invoiceId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НакладнаяИД = ЧтениеXML.ПолучитьАтрибут("value");			
			НакладнаяНомерИД = Новый Структура("НомерНакладной, НакладнаяИД, ДатаОперации, СтанцияНазначения");
			НакладнаяНомерИД.Вставить("НакладнаяИД", НакладнаяИД); 
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "invNumber" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НомерНакладной = ЧтениеXML.ПолучитьАтрибут("value"); 
			НакладнаяНомерИД.Вставить("НомерНакладной", НомерНакладной); 
			//МассивНакладных.Добавить(НакладнаяНомерИД);	
		КонецЕсли;

		Если ЧтениеXML.Имя = "invoiceLastOper" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ДатаОперации = ЧтениеXML.ПолучитьАтрибут("value"); 
			
			Попытка
				ПериодНакладной = Дата(Сред(ДатаОперации,7,4) + Сред(ДатаОперации,4,2) + Лев(ДатаОперации,2));
			Исключение  				
				ПериодНакладной = Дата('0001.01.01');
			КонецПопытки;
			
			Если ПериодНакладной < (НачалоМесяца(ТекущаяДата()) - 3600*25*30) Тогда
				продолжить;
			Иначе
			КонецЕсли;  

			
			НакладнаяНомерИД.Вставить("ДатаОперации", ПериодНакладной); 
			//МассивНакладных.Добавить(НакладнаяНомерИД);	
		КонецЕсли;

		
		                                  
		Если ЧтениеXML.Имя = "invToStation" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			СтанцияНазначения = ЧтениеXML.ПолучитьАтрибут("value");
			НакладнаяНомерИД.Вставить("СтанцияНазначения", СтанцияНазначения);
			
			Если ЗначениеЗаполнено(НакладнаяНомерИД.НомерНакладной) и ЗначениеЗаполнено(НакладнаяНомерИД.НакладнаяИД) Тогда
				
				МассивНакладных.Добавить(НакладнаяНомерИД);	
				
			КонецЕсли;
			
			
		КонецЕсли;

		
	КонецЦикла; 
	
	МассивРезультатов = Новый Массив;
	
	
	МассивНакладных = ОтобратьДанные(МассивНакладных);
	Если не МассивНакладных = Неопределено тогда
		Для каждого ЭлМасс из МассивНакладных Цикл
			
			Если не НакладнаяИД = "" Тогда 
				ДлительныеОперации.СообщитьПрогресс(, "Загрузка накладной: " + ЭлМасс.НакладнаяИД);
				ЗагрузитьНакладную(Новый Структура("ИДНакладной, НомерНакладной", ЭлМасс.НакладнаяИД,ЭлМасс.НомерНакладной), МассивРезультатов);
			Иначе
				МассивРезультатов.Добавить(Новый Структура("Ссылка, Сообщение", Неопределено, "Накладная " + Строка(ЭлМасс.НомерНакладной) + " не загружена"));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВозвращаемаяСтруктура.Вставить("МассивРезультатов", МассивРезультатов);
				
	ПоместитьВоВременноеХранилище(ВозвращаемаяСтруктура, АдресРезультата);	
	
КонецПроцедуры

Функция ОтобратьДанные(МассивНакладных)
	
	    МассивДанныхОтбор = Неопределено;
	
		ДатаНак  =   Дата('0001.01.01');
		Для каждого СтрокаМас из МассивНакладных Цикл 
			Если (СтрокаМас.СтанцияНазначения = "98000" или СтрокаМас.СтанцияНазначения = "98010" или СтрокаМас.СтанцияНазначения = "98020") И ЗначениеЗаполнено(СтрокаМас.ДатаОперации) Тогда
  				Если СтрокаМас.ДатаОперации> ДатаНак Тогда
					МассивДанныхОтбор = Новый Массив;
					ДатаНак = СтрокаМас.ДатаОперации;
					МассивДанныхОтбор.Добавить(СтрокаМас);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Возврат МассивДанныхОтбор;
	
	
КонецФункции

Функция ЗаполнитьДокументЗаявкаНаПеревозкуПриВыгрузке(РезультатЗапроса,ВсеДокументыЗагрузились,НомерЗаявки,НачалоПериода,КонецПериода,ТекущаяДата,Документ)Экспорт
			
	ЗапросОбщиеПоказатели = Новый Запрос;
	ЗапросОбщиеПоказатели.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.э_ОбщиеПоказатели ГДЕ Наименование = &Наименование И ИдентификаторПараметра = &ИдентификаторПараметра";
	ПустаяСсылкаОбщиеПоказатели = Справочники.э_ОбщиеПоказатели.ПустаяСсылка();
	
	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	
	Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
	ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
	СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
		
	Ошибки = "";
	Если Найти(РезультатЗапроса,"<warning>") > 0 Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);		
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "warning" Тогда
				Ошибки = ЧтениеXML.ПолучитьАтрибут("value");			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Документ.Дата =  Документ.ДатаРегистрации;//Документ.claimRegDate;
	Документ.Номер = НомерЗаявки;
	Документ.Ошибки = Ошибки;
	Если Документ.Отправки.Количество() > 0 Тогда
		ПаспортОрганизации = Справочники.э_ПаспортаОрганизаций.НайтиПоКоду(XMLСтрока(Документ.Отправки[0].ГрузополучательИД));
	КонецЕсли;
	Возврат Документ;
	
КонецФункции

Процедура ПодгрузитьНовыеВедомостиПодачиУборкиВагонов(operid = Неопределено) Экспорт
	
	глЭтран = неопределено;
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Если не Константы.э_ВебСервис.Получить() Тогда 			
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("vpuNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("vpuID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	
	ГраницаПериодаЗагрузкиДокументов = ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_ВедомостьПодачиУборкиВагонов"); 
	
	//Пробуем получить operid. 
	//Если функция возвращает 999999999999999(нет записи по запросу), тогда грузим по периоду
	Если operid = "999999999999999" Тогда 
		иначе
		operid = ПолучитьНомерПоследнейОперации(Перечисления.э_ИменаЗапросов.ЗапросСтатусаВедомостиПодачиУборкиВагонов);
	КонецЕсли;
	
	День = 24*60*60;
	ДваДня = 2*День;	
	ТекущаяДата = ТекущаяДата();	
	НачалоПериода = ГраницаПериодаЗагрузкиДокументов - ДваДня;
	
	Пока НачалоПериода < ТекущаяДата Цикл
		Таблица.Очистить();
		КонецПериода = НачалоПериода + День;
		ТекстЗапроса = "<vpuStatus version=""1.0"">";
		//|<fromDate value=""" + (НачалоПериода-1) + """/>
		//|<toDate value=""" + (КонецПериода+1) + """/>
		////|<OperId value=""999999999999999""/>
		
		Если operid = "999999999999999" Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<fromDate value=""" + (НачалоПериода -1) + """/>
			|<toDate value=""" + (КонецПериода+1) + """/>
			|<OperId value=""999999999999999""/>";
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<OperId value="""+operid+"""/>"; 
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|</vpuStatus>";
		
		НачалоПериода = КонецПериода;
		
		
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
		//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос статуса накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
 //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      		ЗаписатьЛогЭТРАН("Запрос статуса ведомости подачи-уборки вагонов", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса ведомости подачи-уборки вагонов"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      
		
		//СКА 19102019
		Если РезультатПроверки.КодОшибки = "1" Тогда
			Продолжить;
		КонецЕсли;
		//СКА 19102019

		
		
		// Заполнение Таблицы
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
		Строка = Неопределено;
		Попытка // Евросиб Фролов, 28.02.2022
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "vpu" Тогда
					Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
				ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					OperId = ЧтениеXML.ПолучитьАтрибут("value");
					Строка = Неопределено; // на всякий случай
					ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаВедомостиПодачиУборкиВагонов);	
					//НаборЗаписей = РегистрыСведений.э_НомерПоследнейОперации.СоздатьНаборЗаписей(); 
					//НаборЗаписей.Отбор.Запрос.Установить(Перечисления.э_ИменаЗапросов.ЗапросСтатусаВедомостиПодачиУборкиВагонов);
					//НоваяЗапись = НаборЗаписей.Добавить();
					//НоваяЗапись.Запрос = Перечисления.э_ИменаЗапросов.ЗапросСтатусаВедомостиПодачиУборкиВагонов;
					//НоваяЗапись.НомерОперации = OperId; 
					//НаборЗаписей.Записать(); 
				ИначеЕсли Строка <> Неопределено Тогда
					Попытка
						Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		Исключение
			ЗаписьЖурналаРегистрации("Загрузка ведомости подачи / уборки вагонов", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.э_РегламентнаяЗагрузкаДокументовЭТРАН, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		//СКА 19102019
		Если operid = "999999999999999" Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,"э_ВедомостьПодачиУборкиВагонов");
		КонецЕсли;
		
		
		Если Таблица.Количество() = 0 Тогда  
			Если operid = "999999999999999" Тогда 
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;   		
		КонецЕсли;
		
		Для Каждого Выборка Из Таблица Цикл
			ИДВедомости = Выборка.vpuID;
			ТекстЗапроса = "<getVPU version=""1.0"">
							|<vpuId value=""" + ИДВедомости + """/>
							//Использование 6-значных кодов станций и грузов в ответе --- ТекстЗапроса = ТекстЗапроса + "<useMod11/>";
							|<useMod11/>
							|</getVPU>";
		
			Если Константы.э_ВебСервис.Получить() Тогда
				РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
			Иначе 
				РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
			КонецЕсли;
			
			//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос статуса накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
 //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      			ЗаписатьЛогЭТРАН("Запрос данных ведомости подачи-уборки вагонов", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
			//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных ведомости подачи-уборки вагонов"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      

			//СКА 19102019
			Если РезультатПроверки.КодОшибки = "1" Тогда
				Продолжить;
			КонецЕсли;
			//СКА 19102019

		
			// Заполнение Документа ВедомостьПодачиУборкиВагонов
			Документ = Документы.э_ВедомостьПодачиУборкиВагонов.СоздатьДокумент();
			МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ВедомостьПодачиУборкиВагонов");
			Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
			СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
			ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
			СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
			Документ2 = Документы.э_ВедомостьПодачиУборкиВагонов.НайтиПоНомеру(ИДВедомости);
			Если Не Документ2.Пустая() Тогда
				Документ2 = Документ2.ПолучитьОбъект();
				//ЗаполнитьЗначенияСвойств(Документ2,Документ);
				ОбъектыЗаполнения =ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек);
				ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"<Ссылки>",",");
				ЗаполнитьОбъект(Документ2,Документ,ОбъектыЗаполнения);
				Документ = Документ2;
			КонецЕсли;
			Документ.Дата = ТекущаяДата();   // ???????
			Документ.Номер = ИДВедомости;
			Документ.Записать();
		КонецЦикла;
		Если ВсеДокументыЗагрузились Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить("э_ВедомостьПодачиУборкиВагонов");
			Запись = НаборЗаписей.Добавить();
			Запись.Объект  = "э_ВедомостьПодачиУборкиВагонов";
			Запись.Граница = НоваяГраницаПериода;
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодгрузитьНовыеНакопительныеВедомости(operid = Неопределено) Экспорт
	
	
	глЭтран = неопределено;
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Если не Константы.э_ВебСервис.Получить() Тогда 			
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;

	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("cumNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("cumID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	
	ГраницаПериодаЗагрузкиДокументов = ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата(),"э_ВедомостьНакопительная"); 
	
	//Пробуем получить operid. 
	//Если функция возвращает 999999999999999(нет записи по запросу), тогда грузим по периоду
	Если operid = "999999999999999" Тогда 
		иначе
		operid = ПолучитьНомерПоследнейОперации(Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакладныхПоПлательщику);
	КонецЕсли;

	
	День = 24*60*60;
	ДваДня = 2*День;	
	ТекущаяДата = ТекущаяДата();	
	НачалоПериода = ГраницаПериодаЗагрузкиДокументов - ДваДня;
	
	Пока НачалоПериода < ТекущаяДата Цикл
		Таблица.Очистить();
		КонецПериода = НачалоПериода + День;
		ТекстЗапроса = "<cumulativeStatus version=""1.0"">";
		//|<fromDate value=""" + (НачалоПериода-1) + """/>
		//|<toDate value=""" + (КонецПериода+1) + """/>
		//|<OperId value=""999999999999999""/>   			
		Если operid = "999999999999999" Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<fromDate value=""" + (НачалоПериода -1) + """/>
			|<toDate value=""" + (КонецПериода+1) + """/>
			|<OperId value=""999999999999999""/>";
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"
			|<OperId value="""+operid+"""/>"; 
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|</cumulativeStatus>";
		
		НачалоПериода = КонецПериода;

			
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
		//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос статуса накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      		ЗаписатьЛогЭТРАН("Запрос статуса накопительной ведомости", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос статуса накопительной ведомости"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      

		//СКА 19102019
		Если РезультатПроверки.КодОшибки = "1" Тогда
			Продолжить;
		КонецЕсли;
		//СКА 19102019

		
		
		// Заполнение Таблицы
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
		Строка = Неопределено;
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "cum" Тогда
				Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
			ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				OperId = ЧтениеXML.ПолучитьАтрибут("value");
				Строка = Неопределено; // на всякий случай
				ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакопительнойВедомости);
				//НаборЗаписей = РегистрыСведений.э_НомерПоследнейОперации.СоздатьНаборЗаписей(); 
				//НаборЗаписей.Отбор.Запрос.Установить(Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакопительнойВедомости);
				//НоваяЗапись = НаборЗаписей.Добавить();
				//НоваяЗапись.Запрос = Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакопительнойВедомости; 
				//НоваяЗапись.НомерОперации = OperId; 
				//НаборЗаписей.Записать(); 
			ИначеЕсли Строка <> Неопределено Тогда
				Попытка
					Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		///СКА 19102019
		Если operid = "999999999999999" Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,"э_ВедомостьНакопительная");
		КонецЕсли;
		
		
		Если Таблица.Количество() = 0 Тогда  
			Если operid = "999999999999999" Тогда 
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;   		
		КонецЕсли;
		
		//Если Таблица.Количество() = 0 Тогда////////////////////////////////////////////
		//	НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
		//	НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
		//	НаборЗаписей.Отбор.Объект.Установить("э_ВедомостьНакопительная");
		//	Запись = НаборЗаписей.Добавить();
		//	Запись.Объект  = "э_ВедомостьНакопительная";
		//	Запись.Граница = НоваяГраницаПериода;
		//	НаборЗаписей.Записать();
		//	Продолжить;
		//КонецЕсли;
		///СКА 19102019
		
		
		Для Каждого Выборка Из Таблица Цикл
			ИДВедомости = Выборка.cumID;
			ТекстЗапроса = "<getCumulativeList version=""1.0"">
							|<cumId value=""" + ИДВедомости + """/>
							|</getCumulativeList>";
		
			
			Если Константы.э_ВебСервис.Получить() Тогда
				РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
			Иначе 
				РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
			КонецЕсли;
			
			//ПутьКФайлуЛога = ЗаписатьЛогВМодуле("Запрос статуса накладной", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      			ЗаписатьЛогЭТРАН("Запрос данных накопительной ведомости", ТекстЗапроса, РезультатЗапроса,,"Этран");
			
			//15022018 Добавляем получение кода ошибки
			РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накопительной ведомости"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      

			//СКА 19102019
			Если РезультатПроверки.КодОшибки = "1" Тогда
				Продолжить;
			КонецЕсли;
			//СКА 19102019

			
		//Файл = Новый ЧтениеТекста("D:\НакопительнаяВедомость.txt");
		//РезультатЗапроса = Файл.Прочитать();

		
		
			// Заполнение Документа ВедомостьНакопительная
			Документ = Документы.э_ВедомостьНакопительная.СоздатьДокумент();
			МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ВедомостьНакопительная");
			Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
			СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
			ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
			СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
			Документ2 = Документы.э_ВедомостьНакопительная.НайтиПоНомеру(ИДВедомости);
			Если Не Документ2.Пустая() Тогда
				Документ2 = Документ2.ПолучитьОбъект();
				//ЗаполнитьЗначенияСвойств(Документ2,Документ);
				ОбъектыЗаполнения = ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек);
				ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"<Ссылки>",",");
				ЗаполнитьОбъект(Документ2,Документ,ОбъектыЗаполнения);
				Документ = Документ2;
			КонецЕсли;
			Документ.Дата = ТекущаяДата();
			Документ.Номер = ИДВедомости;
			Документ.Записать();
		КонецЦикла;
		Если ВсеДокументыЗагрузились Тогда
			НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
			НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить("э_ВедомостьНакопительная");
			Запись = НаборЗаписей.Добавить();
			Запись.Объект  = "э_ВедомостьНакопительная";
			Запись.Граница = НоваяГраницаПериода;
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодгрузитьНовыеНакопительныеВедомости_сидата(ДатаОтсчета = неопределено) Экспорт
	
	Если ДатаОтсчета = неопределено Тогда ДатаОтсчета = ТекущаяДата(); КонецЕсли;
	
	глЭтран = неопределено;
	глЭтранИдетЗагрузка = Истина;
	НомерТранзакции = 1;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	Если не Константы.э_ВебСервис.Получить() Тогда 			
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;
	
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("cumNumber",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("cumID",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	
	ВсеДокументыЗагрузились = Истина;
	
	День = 24*60*60;
	ДваДня = 2*День;	
	ТекущаяДата = ДатаОтсчета;	
	НачалоПериода = ТекущаяДата - День;
	
	Таблица.Очистить();
	КонецПериода = ТекущаяДата;
	ТекстЗапроса = "<cumulativeStatus version=""1.0"">
	|<fromDate value=""" + (НачалоПериода -1) + """/>
	|<toDate value=""" + (КонецПериода+1) + """/>
	|<OperId value=""999999999999999""/>
	|</cumulativeStatus>";
	
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;
	
	ЗаписатьЛогЭТРАН("Запрос статуса накопительной ведомости", ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	// Заполнение Таблицы
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	Строка = Неопределено;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "cum" Тогда
			Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);
		ИначеЕсли ЧтениеXML.Имя = "OperId" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			OperId = ЧтениеXML.ПолучитьАтрибут("value");
			Строка = Неопределено; // на всякий случай
			ЗаписатьНомерПоследнейОперации(OperId,Перечисления.э_ИменаЗапросов.ЗапросСтатусаНакопительнойВедомости);
		ИначеЕсли Строка <> Неопределено Тогда
			Попытка
				Строка[ЧтениеXML.Имя] = ЧтениеXML.ПолучитьАтрибут("value");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	Для Каждого Выборка Из Таблица Цикл
		ИДВедомости = Выборка.cumID;
		ТекстЗапроса = "<getCumulativeList version=""1.0"">
		|<cumId value=""" + ИДВедомости + """/>
		|</getCumulativeList>";
		
		
		Если Константы.э_ВебСервис.Получить() Тогда
			РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
		Иначе 
			РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
		КонецЕсли;
		
		
//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      		ЗаписатьЛогЭТРАН("Запрос данных накопительной ведомости", ТекстЗапроса, РезультатЗапроса,,"Этран");
		
		//15022018 Добавляем получение кода ошибки
		РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накопительной ведомости"); //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656      
		
		//СКА 19102019
		Если РезультатПроверки.КодОшибки = "1" Тогда
			Продолжить;
		КонецЕсли;
		//СКА 19102019
		
		
		
		// Заполнение Документа ВедомостьНакопительная
		Документ = Документы.э_ВедомостьНакопительная.СоздатьДокумент();
		МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ВедомостьНакопительная");
		Соответствие = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
		СоответствиеПеревод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек);
		ЗаполнитьОбъектИзXML(Документ,Соответствие,СоответствиеПеревод,РезультатЗапроса);
		СоздатьСсылкиПоРеквизитам(Документ,МакетНастроек);
		Документ2 = Документы.э_ВедомостьНакопительная.НайтиПоРеквизиту("ИдентификаторНакопительнойВедомости", ИДВедомости);
		Если Не Документ2.Пустая() Тогда
			Документ2 = Документ2.ПолучитьОбъект();
			//ЗаполнитьЗначенияСвойств(Документ2,Документ);
			ОбъектыЗаполнения = ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек);
			ОбъектыЗаполнения = СтрЗаменить(ОбъектыЗаполнения,"<Ссылки>",",");
			ЗаполнитьОбъект(Документ2,Документ,ОбъектыЗаполнения);
			Документ = Документ2;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Документ.Дата) тогда 
			Документ.Дата = ТекущаяДата;
		КонецЕсли;
		Документ.ПометкаУдаления = Ложь;
		//Документ.Номер = ИДВедомости;
		Документ.Записать();
	КонецЦикла;
	
	Если ВсеДокументыЗагрузились Тогда
		НоваяГраницаПериода = ?(КонецПериода<ТекущаяДата,КонецПериода,ТекущаяДата);
		НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить("э_ВедомостьНакопительная");
		Запись = НаборЗаписей.Добавить();
		Запись.Объект  = "э_ВедомостьНакопительная";
		Запись.Граница = НоваяГраницаПериода;
		НаборЗаписей.Записать();		
	КонецЕсли;

КонецПроцедуры

//Евросиб Литвинов 28.06.2021 ( Ticket#0219692 #33382
Процедура ОбновитьДатуРаскредитацииПо44НакладнымНаСервере() Экспорт
	
	ЗапросПо44 = Новый Запрос;
	ЗапросПо44.УстановитьПараметр("Статус44",  Справочники.э_СостоянияДокументов.НайтиПоКоду(44));
	ЗапросПо44.УстановитьПараметр("ТекущаяДата", ДобавитьМесяц(ТекущаяДата(), -3));
	ЗапросПо44.Текст = "ВЫБРАТЬ
	                   |	э_Накладная.Ссылка КАК Ссылка,
	                   |	э_Накладная.НакладнаяИД КАК invoiceID,
	                   |	э_Накладная.НакладнаяНомер КАК invNumber
	                   |ИЗ
	                   |	Документ.э_Накладная КАК э_Накладная
	                   |ГДЕ
	                   |	э_Накладная.Проведен = ИСТИНА
	                   |	И э_Накладная.ДатаИВремяРаскредитованияГруза = ДАТАВРЕМЯ(1, 1, 1)
	                   |	И э_Накладная.ТекущееСостояниеНакладной = &Статус44
	                   |	И э_Накладная.Дата > &ТекущаяДата
	                   |
	                   |УПОРЯДОЧИТЬ ПО
	                   |	э_Накладная.Дата";
	Выборка = ЗапросПо44.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	глЭтранИдетЗагрузка = Истина;

    ДлительныеОперации.СообщитьПрогресс(, "Получение ответа от ЭТРАН");
	
	КонстантыЭ_ВебСервис = Константы.э_ВебСервис.Получить();
	
	Пока Выборка.Следующий() Цикл
		ОтказПоФильтру = Истина;
        ИДНакладной    = Формат(Выборка.invoiceID, "ЧГ=");
        НомерНакладной = Выборка.invNumber;
		Если Не ЗначениеЗаполнено(НомерНакладной) Тогда
			Продолжить;
		КонецЕсли; 
		
		ПередаваемыйПараметр = Новый Структура;
		ПередаваемыйПараметр.Вставить("ЖДН", Выборка.Ссылка);
		ПередаваемыйПараметр.Вставить("ИДНакладной", ?(СтрДлина(ИДНакладной)>8, Формат(ИДНакладной, "ЧГ="), Неопределено));
		ПередаваемыйПараметр.Вставить("НомерНакладной", ?(СтрДлина(НомерНакладной)>8, Неопределено, НомерНакладной));
		
		ПолучитьДатуРаскредитацииПоНакладной(ПередаваемыйПараметр, КонстантыЭ_ВебСервис);
    КонецЦикла;
	
    глЭтранИдетЗагрузка = Ложь;
    
КонецПроцедуры

Процедура ПолучитьДатуРаскредитацииПоНакладной(ПараметрыДокумента, КонстантыЭ_ВебСервис = Неопределено) Экспорт
	
	Если ПараметрыДокумента.Свойство("НайтиИОбновить") И ПараметрыДокумента.НайтиИОбновить Тогда
		ЗапросПоИД = Новый Запрос;
		ЗапросПоИД.УстановитьПараметр("Статус44",  Справочники.э_СостоянияДокументов.НайтиПоКоду(44));
		Попытка
			чНомерНакладнойИД = Число(ПараметрыДокумента.ИДНакладной);
		Исключение
			Возврат;
		КонецПопытки;
		ЗапросПоИД.УстановитьПараметр("ИДНакладной", чНомерНакладнойИД);
		ЗапросПоИД.Текст = "ВЫБРАТЬ
		                   |	э_Накладная.Ссылка КАК Ссылка,
		                   |	э_Накладная.НакладнаяНомер КАК НакладнаяНомер
		                   |ИЗ
		                   |	Документ.э_Накладная КАК э_Накладная
		                   |ГДЕ
		                   |	э_Накладная.Проведен = ИСТИНА
		                   |	И э_Накладная.НакладнаяИД = &ИДНакладной
		                   |	И э_Накладная.ТекущееСостояниеНакладной = &Статус44";
		Выборка = ЗапросПоИД.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПараметрыДокумента.ЖДН = Выборка.Ссылка;
			ПараметрыДокумента.НомерНакладной = Выборка.НакладнаяНомер;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыДокумента.ИДНакладной = Неопределено И ПараметрыДокумента.НомерНакладной = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(, "Подключение к ЭТРАН");
	
	ТекстЗапроса = "<getInvoice version=""1.0"">";
	Если не ПараметрыДокумента.ИДНакладной = Неопределено Тогда 
	ТекстЗапроса = ТекстЗапроса + "
	|<invoiceID value=""" + ПараметрыДокумента.ИДНакладной + """/>";
	ИначеЕсли  не ПараметрыДокумента.НомерНакладной = Неопределено Тогда 
	ТекстЗапроса = ТекстЗапроса + "
	|<invNumber value=""" + ПараметрыДокумента.НомерНакладной + """/>";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса +"
	|<useMod11/><useValid/>
	|</getInvoice>";
	
	ДлительныеОперации.СообщитьПрогресс(, "Отправка запроса в ЭТРАН");
	
	Если ?(КонстантыЭ_ВебСервис = Неопределено, Константы.э_ВебСервис.Получить(), КонстантыЭ_ВебСервис) Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		глЭтран = ПодключитьКЭтранНаСервере();
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;

	РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной");      
	Если РезультатПроверки.КодОшибки = Неопределено Тогда 
		РезультатЗапроса = РезультатПроверки.РезультатЗапроса;
	Иначе
		
		Если РезультатПроверки.КодОшибки = "100" Тогда  //100-Код ошибки связи, 0 - прочая ошибка. повторение не требуется
			//Повторяем запрос 45  по 180 секунд, около 1,5 часа	
			КоличествоПовторов = 0;
			Пока КоличествоПовторов < 5 Цикл
				ПаузаВСекундах(30);// 0,5 минуты
				Если ?(КонстантыЭ_ВебСервис = Неопределено, Константы.э_ВебСервис.Получить(), КонстантыЭ_ВебСервис) Тогда
					РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
				Иначе 
					РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
				КонецЕсли;
				РезультатПроверки = ОбработкаОшибокЗапросаДанных(РезультатЗапроса,, ТекстЗапроса, "Запрос данных накладной");      
				Если не РезультатПроверки.КодОшибки = "100" Тогда
					РезультатЗапроса = РезультатПроверки.РезультатЗапроса;	
					Прервать;	
				КонецЕсли;
				КоличествоПовторов = КоличествоПовторов + 1;
			КонецЦикла;  
		КонецЕсли;
		Если РезультатПроверки.КодОшибки = "0" 
			ИЛИ РезультатПроверки.КодОшибки = "1" 
			ИЛИ РезультатПроверки.КодОшибки = "4" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатЗапроса = Неопределено Тогда                            
        Возврат;
    КонецЕсли;

	ДлительныеОперации.СообщитьПрогресс(, "Обработка ответа от ЭТРАН");
	invoiceStateID = Неопределено;
	ДатаРаскредитации = Дата(1,1,1);

	ОтказПоФильтру = Истина;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "invoiceStateID" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			invoiceStateID = ЧтениеXML.ПолучитьАтрибут("value");
			Если invoiceStateID = "44" Тогда
				ОтказПоФильтру = Ложь;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.Имя = "invLastOper" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			// временно ориентируемся на реквизит invLastOper вместо invDateDelivery, т.к. последнего пока нет в ответе 
			Попытка 
				ДатаРаскредитации = Дата(ЧтениеXML.ПолучитьАтрибут("value"));
			Исключение
				ОтказПоФильтру = Истина;
				Возврат;
			КонецПопытки;
			Если invoiceStateID = "44" Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;        

	Если ОтказПоФильтру Тогда
		Возврат;
	КонецЕсли;

	ДлительныеОперации.СообщитьПрогресс(, "Обновление накладной: " + ПараметрыДокумента.НомерНакладной);
	
	Если ЗначениеЗаполнено(ДатаРаскредитации) И ЗначениеЗаполнено(ПараметрыДокумента.ЖДН) Тогда
		эН = ПараметрыДокумента.ЖДН.ПолучитьОбъект();
		эН.ДатаИВремяРаскредитованияГруза 		 = МАКС(эН.ДатаИВремяРаскредитованияГруза, ДатаРаскредитации);
		эН.ДатаИВремяРаскредитованияГрузаМестная = МАКС(эН.ДатаИВремяРаскредитованияГрузаМестная, ДатаРаскредитации);
		Попытка
			эН.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			//ОбщегоНазначения.СообщитьПользователю("Ошибка обновления даты раскредитования из ЭТРАН. "+ПараметрыДокумента.ЖДН);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб Литвинов 28.06.2021 ) Ticket#0219692 #33382

#КонецОбласти

////ЗАГРУЗКА СПРАВОЧНИКОВ
#Область ЗагрузкаСправочников


Функция НайтиЭлементСправочникаОбщиеПоказатели(Код, ИдентификаторПараметра) 
	
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	э_ОбщиеПоказатели.Ссылка
	  |ИЗ
	  |	Справочник.э_ОбщиеПоказатели КАК э_ОбщиеПоказатели
	  |ГДЕ
	  |	э_ОбщиеПоказатели.Код = &Код
	  |	И э_ОбщиеПоказатели.ИдентификаторПараметра = &ИдентификаторПараметра";
	  
	  Запрос.УстановитьПараметр("Код", Число(Код));
	  Запрос.УстановитьПараметр("ИдентификаторПараметра", Число(ИдентификаторПараметра));
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Пока Выборка.Следующий() Цикл
	  
	  	   Возврат Выборка.Ссылка;
	  
	  КонецЦикла;
	  
	  
	  Возврат Неопределено;
	  
КонецФункции

Функция ЗагрузитьОднуЗапись(Справочник, Знач ТаблицаРеквизитов, УдалятьЕслиНезаполнен=Ложь, СписокРеквизитовОбъекта = Неопределено) Экспорт
	
	Если ТаблицаРеквизитов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТаблицаРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	
	// Если хотябы один из ключевых реквизитов не заполнен, тогда выходим
	Для Каждого Строка Из ТаблицаРеквизитов Цикл
		Если Не ЗначениеЗаполнено(Строка.Значение) Тогда
			Возврат Неопределено;
		КонецЕсли;		
	КонецЦикла;
		
	ТаблицаРеквизитов = ПреобразоватьТипыПоискаКТипамРеквизитов(Справочник,"Справочник",ТаблицаРеквизитов);
	
	Попытка
		Макет = Обработки.э_Макеты.ПолучитьМакет(Справочник);
		Область = Макет.НайтиТекст("<ТаблицаНСИ>",,Макет.Область("C1"),,Истина);
	Исключение
		//Сообщить("Макет настроек не найден: " + Справочник);
		Возврат Неопределено;
	КонецПопытки;
	Если Область = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЗапрашиваемаяТаблица 	= Макет.Область(Область.Верх, 2).Текст;
	//ПолеИД 					= Макет.Область(Область.Верх + 1,1).Текст;
	Если ПустаяСтрока(ЗапрашиваемаяТаблица) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Область = Макет.НайтиТекст("<Реквизиты>",,Макет.Область("C1"),,Истина);
	Если Область = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	ТаблицаР = ТаблицаРеквизитов.Скопировать();
	Если ТаблицаР.Колонки.Найти("ПолеТаблицы") = Неопределено Тогда
		ТаблицаР.Колонки.Добавить("ПолеТаблицы");
		Индекс = Область.Верх + 1;
		Пока Макет.Область(Индекс, 1).Текст <> "<\Реквизиты>" Цикл
			
			Реквизит = Макет.Область(Индекс, 2).Текст;
			Строка = ТаблицаР.Найти(Реквизит, "Реквизит");
			Если  Строка <> Неопределено Тогда
				Строка.ПолеТаблицы = Макет.Область(Индекс, 1).Текст;
			КонецЕсли;
			
			Индекс = Индекс + 1;
		КонецЦикла;
	ИначеЕсли ТаблицаР.Колонки.Найти("Реквизит") = Неопределено Тогда
		ТаблицаР.Колонки.Добавить("Реквизит");
		Индекс = Область.Верх + 1;
		Пока Макет.Область(Индекс, 1).Текст <> "<\Реквизиты>" Цикл
			
			ПолеТаблицы = Макет.Область(Индекс, 1).Текст;
			Строка = ТаблицаР.Найти(ПолеТаблицы, "ПолеТаблицы");
			Если  Строка <> Неопределено Тогда
				Строка.Реквизит = Макет.Область(Индекс, 2).Текст;
			КонецЕсли;
			
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;

	РезультатЗапроса = ПолучитьОднуЗапись(ЗапрашиваемаяТаблица,ТаблицаР);
	
	Таблица = XMLВТаблицуОднаЗапись(РезультатЗапроса,Макет);
	Спр = Неопределено;
	Если Таблица.Количество() <> 0 Тогда
		//Спр = Справочники[Справочник].НайтиПоКоду(Строка.Код);
		Спр = НайтиПоРеквизитам("Справочник", Справочник, ТаблицаР);
		Если Спр = Неопределено Тогда
			Спр = Справочники[Справочник].СоздатьЭлемент();
		Иначе
			
			Если Не СписокРеквизитовОбъекта = Неопределено Тогда
				Спр = СписокРеквизитовОбъекта;
			Иначе
				Спр = Спр.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			
		КонецЕсли;
		  		   
		ЗаполнитьЗначенияСвойств(Спр, Таблица[0]);
		Если СписокРеквизитовОбъекта = Неопределено Тогда
		Для каждого Колонка из Таблица.Колонки Цикл
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта(Колонка.Имя, Спр.Метаданные()) Тогда
				Если Спр.Метаданные().Реквизиты[Колонка.Имя].Тип = Новый ОписаниеТипов("Булево")  Тогда
					Спр[Колонка.Имя] = Булево(Число(Таблица[0][Колонка.Имя]));
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		КонецЕсли;
		
		Если Справочник = "э_Вагоны" Тогда
			
			Спр = ПолучитьСоздатьСобственниковАрендаторов(Спр,СписокРеквизитовОбъекта);
			
		КонецЕсли;
		
		
		/////////////////////////////////////////
		// Надо сделать правильно
		Попытка
			Если Спр.RECDATEEND > '30000101' Тогда
				Спр.RECDATEEND ='30000101';
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если Спр.ДатаВыводаИзДействия > '30000101' Тогда
				Спр.ДатаВыводаИзДействия ='30000101';
			КонецЕсли;
		Исключение
		КонецПопытки;

		//////////////////////////////////////////
		Если СписокРеквизитовОбъекта = Неопределено Тогда
			попытка
				Спр.Записать();
			исключение
			КонецПопытки;
			Спр = Спр.Ссылка;
		КонецЕсли;
	Иначе
		Если УдалятьЕслиНезаполнен Тогда
			Спр = НайтиПоРеквизитам("Справочник", Справочник, ТаблицаР);
			Если Спр <> Неопределено Тогда
				Спр = Справочник.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Истина);
                Спр.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Спр;
	
КонецФункции

Функция ПолучитьОднуЗапись(Справочник,ТаблицаРеквизитов) 
	
	Если ТаблицаРеквизитов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если ТаблицаРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЕстьКолонкаУсловие = ТаблицаРеквизитов.Колонки.Найти("Условие")<>Неопределено;
	//Добавляем условие на запрос вагонов, так как данные беруться из другой НСИ
	
	ТекстЗапроса 	= "<getNSI> <tableName value=""" + Справочник +"""/>";  
		
		ПоляОтбора 		= "";
		УсловияОтбора   = "";
		ЗначенияОтбора 	= "";
		Для Каждого Строка Из ТаблицаРеквизитов Цикл
			Если Строка.ПолеТаблицы = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			ПоляОтбора 		= ПоляОтбора + "," + Строка.ПолеТаблицы;
			Если ЕстьКолонкаУсловие Тогда
				УсловияОтбора	= УсловияОтбора + ?(Строка.Условие=Неопределено,",=",","+Строка.Условие);
			Иначе
				УсловияОтбора	= УсловияОтбора + ",=";
			КонецЕсли;
			
			ЗначенияОтбора	= ЗначенияОтбора + "," + Формат(Строка.Значение,"ЧГ=0");		
		КонецЦикла;
		
		ПоляОтбора 		= "<filterField value=""" + Сред(ПоляОтбора, 2) + """/>";
		УсловияОтбора 	= "<filterCond value=""" + Сред(УсловияОтбора, 2) + """/>";	
		//ЗначенияОтбора 	= "<filterValue value=""" + Сред(ЗначенияОтбора, 2) + """/>";
		
		Если Справочник = "STATION" или Справочник = "FREIGHT" или Справочник = "GNG_FREIGHT_2001"  Тогда
			ЗначенияОтбора 	= "<filterValue value=""" + Лев(Сред(ЗначенияОтбора, 2),5) + """/>";			
		Иначе
			ЗначенияОтбора 	= "<filterValue value=""" + Сред(ЗначенияОтбора, 2) + """/>"; 			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ПоляОтбора + УсловияОтбора + ЗначенияОтбора + "<useMod11/></getNSI>";
		
		Если Справочник = "car" Тогда
			Возврат Неопределено;
			ТекстЗапроса 	= "<getCarNSI version=""1.0""> <car> <carNumber value=""" +Строка.Значение+ """/> </car><useCond/></getCarNSI>";
		КонецЕсли;
		
		Если Справочник = "OrgPassport" Тогда
			ТекстЗапроса 	= "<getOrgPassport version=""1.0""><orgOKPO value=""" +Строка.Значение+ """/> </getOrgPassport>";
		КонецЕсли;

		Если Справочник = "cont" Тогда
			Возврат Неопределено;
			ТекстЗапроса 	= "<getCotnNSI version=""1.0""> <cont> <contNumber value=""" +Строка.Значение+ """/> </cont><useLocalNsi/></getContNSI>";
		КонецЕсли;             

		
		

	
	Возврат ЗапросДанных(Справочник,ТекстЗапроса,);
	
	
КонецФункции

Функция ПолучитьСоздатьСобственниковАрендаторов(Спр,СписокРеквизитовОбъекта)
	
	Если ЗначениеЗаполнено(Спр.СобственникИД) Тогда 
		СпрОб = Справочники.э_СобственникиАрендаторыВагонов.НайтиПоКоду(Спр.СобственникИД);
		Если ЗначениеЗаполнено(СпрОб) Тогда
//Евросиб Гудкова( 03.01.2021 Ticket№ 0218255
		Если СпрОб.Наименование <> СократитьНазваниеЮрЛица(Спр.СобственникНаименование)
			ИЛИ СпрОб.ОКПО <> Спр.СобственникОКПО Тогда
			СпрОб.ПолучитьОбъект();
			СпрОб.Наименование = СократитьНазваниеЮрЛица(Спр.СобственникНаименование);
			СпрОб.ОКПО = Спр.СобственникОКПО;
			СпрОб.Записать();
		КонецЕсли; 
// Евросиб Гудкова) 			
		ИначеЕсли ЗначениеЗаполнено(Спр.СобственникНаименование) Тогда
			СпрСоб = Справочники.э_СобственникиАрендаторыВагонов.СоздатьЭлемент();	
			СпрСоб.Код = Спр.СобственникИД;
			СпрСоб.Наименование = СократитьНазваниеЮрЛица(Спр.СобственникНаименование);
			СпрСоб.ОКПО = Спр.СобственникОКПО;  
			СпрСоб.Записать();
		КонецЕсли;
	
		Если СписокРеквизитовОбъекта = Неопределено тогда
			Спр.Собственник =  СпрОб;
		КонецЕсли;
		
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Спр.АрендаторИД) Тогда
		СпрАр = Справочники.э_СобственникиАрендаторыВагонов.НайтиПоКоду(Спр.АрендаторИД);
		Если ЗначениеЗаполнено(СпрАр) Тогда
//Евросиб Гудкова( 03.01.2021 Ticket№ 0218255
		Если СпрАр.Наименование <> СократитьНазваниеЮрЛица(Спр.АрендаторНаименование)
			ИЛИ СпрАр.ОКПО <> Спр.АрендаторОКПО Тогда
			СпрАр.ПолучитьОбъект();
			СпрАр.Наименование = СократитьНазваниеЮрЛица(Спр.АрендаторНаименование);
			СпрАр.ОКПО = Спр.АрендаторОКПО;
			СпрАр.Записать();
		КонецЕсли; 
// Евросиб Гудкова) 			
		ИначеЕсли ЗначениеЗаполнено(Спр.АрендаторНаименование) Тогда
			СпрАр = Справочники.э_СобственникиАрендаторыВагонов.СоздатьЭлемент();		
			СпрАр.Код = Спр.АрендаторИД;
			СпрАр.Наименование = СократитьНазваниеЮрЛица(Спр.АрендаторНаименование);
			СпрАр.ОКПО = Спр.АрендаторОКПО;
			СпрАр.Записать();
		КонецЕсли;
		
		Если СписокРеквизитовОбъекта = Неопределено тогда
			Спр.Арендатор =  СпрАр;
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если не  Спр.МодельВагонаНаименование = "" Тогда 
		СпрОб = Справочники.э_МоделиВагонов.НайтиПоНаименованию(Спр.МодельВагонаНаименование);
		Если ЗначениеЗаполнено(СпрОб) Тогда
		Иначе
			СпрСоб = Справочники.э_МоделиВагонов.СоздатьЭлемент();	
			СпрСоб.Наименование = Спр.МодельВагонаНаименование;
			СпрСоб.Записать();
		КонецЕсли;
		
		Если СписокРеквизитовОбъекта = Неопределено тогда
			Спр.МодельВагона =  СпрОб;
		КонецЕсли;
		
	КонецЕсли;		

	
	
	
	Возврат Спр;
	
КонецФункции

Функция СократитьНазваниеЮрЛица(НаименованиеЮрЛица)
	
	ДлиннаНаименованиеЮрЛица = СтрДлина(НаименованиеЮрЛица);
	
	Если Лев(НаименованиеЮрЛица,40) = "общество с ограниченной ответственностью" Тогда
		 НаименованиеЮрЛица = Сред(НаименованиеЮрЛица, 41,ДлиннаНаименованиеЮрЛица-41);  
	КонецЕсли;	
	
	Возврат НаименованиеЮрЛица;
		
КонецФункции

Процедура ЗагрузитьВсеЗаписи(Справочник) Экспорт
	
	
	
	Попытка
		Выборка = Справочники[Справочник].Выбрать(); 
		Макет = Обработки.э_Макеты.ПолучитьМакет(Справочник);
	Исключение
		Возврат;
	КонецПопытки;

	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.ПометкаУдаления или Выборка.Предопределенный Тогда
	//	Иначе 
	//		Объект = Выборка.ПолучитьОбъект();
	//		Объект.УстановитьПометкуУдаления(Истина);
	//		Объект.Записать();
	//	КонецЕсли;
	//КонецЦикла;


	Область = Макет.НайтиТекст("<ТаблицаНСИ>",,Макет.Область("C1"),,Истина);
	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗапрашиваемаяТаблица 	= Макет.Область(Область.Верх, 2).Текст;
	ПолеИД					= Макет.Область(Область.Верх + 1, 1).Текст;
	ПолеИНД					= Макет.Область(Область.Верх + 2, 1).Текст;
	
	Попытка
		МаксимальноеЗначение= Число(Макет.Область(Область.Верх + 2, 2).Текст);
		Шаг = Число(Макет.Область(Область.Верх + 2, 3).Текст); 
		ЗагрузитьВсеЗаписи = Ложь;
	Исключение
		МаксимальноеЗначение = 2;
		Шаг = 200;
		ЗагрузитьВсеЗаписи = Истина;
	КонецПопытки;
	
	Если ПустаяСтрока(ЗапрашиваемаяТаблица) Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(ПолеИНД) Тогда
		МаксимальноеЗначение = 2;
		Шаг = 200;
		ЗагрузитьВсеЗаписи = Истина;
		Если ПустаяСтрока(ПолеИД) Тогда
			Возврат;
		КонецЕсли;
		ПолеИНД = ПолеИД;
	КонецЕсли;
	
	Область = Макет.НайтиТекст("<Реквизиты>",,Макет.Область("C1"),,Истина);
	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Реквизит = Неопределено;
	Индекс = Область.Верх + 1;
	Пока Макет.Область(Индекс, 1).Текст <> "<\Реквизиты>" Цикл
		Если Макет.Область(Индекс, 1).Текст = ПолеИД Тогда
			Реквизит = Макет.Область(Индекс, 2).Текст;
			Прервать;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	Если Реквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	КонецДиапазона = -1;
	Пока 1 Цикл
		НачалоДиапазона = КонецДиапазона + 1;
		КонецДиапазона = НачалоДиапазона + Шаг;
		Если НачалоДиапазона > МаксимальноеЗначение Тогда
			Прервать;
		КонецЕсли;
		Если КонецДиапазона > МаксимальноеЗначение Тогда
			КонецДиапазона = МаксимальноеЗначение;
		КонецЕсли;
		РезультатЗапроса = Неопределено;
		КоличествоПопыток = 0;
		//ОбработкаПрерыванияПользователя();
		Пока РезультатЗапроса = "Ошибка подключения к прокси. error"
			ИЛИ РезультатЗапроса = Неопределено
			И КоличествоПопыток < 3 Цикл  
			КоличествоПопыток = КоличествоПопыток + 1;
			РезультатЗапроса = ПолучитьДиапазонЗаписей(ЗапрашиваемаяТаблица,ПолеИНД,НачалоДиапазона,КонецДиапазона,ЗагрузитьВсеЗаписи);  				
		КонецЦикла;
		
		Таблица = XMLВТаблицу(РезультатЗапроса,Макет);
		
		Для Каждого Строка Из Таблица Цикл
			
			
			Если Справочник =  "э_ОбщиеПоказатели"  Тогда
				Спр = НайтиЭлементСправочникаОбщиеПоказатели(Строка.Код, Строка.ИдентификаторПараметра);
			Иначе
				
				Попытка   					             
					Спр = Справочники[Справочник].НайтиПоКоду(Строка.Код);
				Исключение   					
					Спр = Неопределено;	
				КонецПопытки;

				
				Попытка
					Спр = ?(ЗначениеЗаполнено(Спр), Спр, Справочники[Справочник].НайтиПоРеквизиту(Реквизит, Строка[Реквизит])); 
				Исключение
					Спр = Неопределено;	
				КонецПопытки;
				
			КонецЕсли;
			
		
			Если Спр = Неопределено или не ЗначениеЗаполнено(Спр)Тогда
				Спр = Справочники[Справочник].СоздатьЭлемент();
			Иначе
				Спр = Спр.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;			
			
			ЗаполнитьЗначенияСвойств(Спр, Строка);
			
			/////////////////////////////////////////
			// Надо сделать правильно
			Попытка
				Если Спр.RECDATEEND > '30000101' Тогда
					Спр.RECDATEEND ='30000101';
				КонецЕсли;
			Исключение
				    
			КонецПопытки;
			//////////////////////////////////////////
			
			
			Попытка
				Спр.Записать();
				
			Исключение
			Сообщить("Не загружен справочник: " + Спр + " Справочник: " + Справочник + " " + ОписаниеОшибки());	
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры
// Функция получает диапазон записей справочника из Этран
Функция ПолучитьДиапазонЗаписей(ЗапрашиваемаяТаблица,ПолеОтбора,НачалоДиапазона,КонецДиапазона,ВсеЗаписи = Ложь) 
	
	ТекстЗапроса = "<getNSI><tableName value=""" + ЗапрашиваемаяТаблица +"""/>";
	Если Не ВсеЗаписи Тогда
		//ТекстЗапроса = ТекстЗапроса + "<filterField value=""" + ПолеОтбора + "," + ПолеОтбора + """/> <filterCond value=""&gt;,&lt;""/><filterValue value=""" + НачалоДиапазона + "," + КонецДиапазона + """/>";
		
		ТекстЗапроса = ТекстЗапроса + "<filterField value=""" + ПолеОтбора + "," + ПолеОтбора + """/> <filterCond value=""&gt;,&lt;""/><filterValue value=""" + СтрЗаменить(Строка(НачалоДиапазона),Символы.НПП,"") + "," + СтрЗаменить(Строка(КонецДиапазона),Символы.НПП,"") + """/>";
		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "<useMod11/></getNSI>";
	
	РезультатЗапроса = ЗапросДанных(ЗапрашиваемаяТаблица,ТекстЗапроса,);
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Процедура обновляет все справочники из Этрана
Процедура ЗагрузитьВсеСправочникиНаСервере(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт  	
	
	Макеты  		= ПолучитьНаименованиеМакетовВсехСправочников();
	МассивСообщений = Новый Массив;
	
	Если Макеты.количество() <> 0 Тогда
		Для Каждого СправочникНСИ из Макеты Цикл
			ДлительныеОперации.СообщитьПрогресс(, "Загрузка справочника: " + СправочникНСИ);
			ЗагрузитьВсеЗаписи(СправочникНСИ);			  
		КонецЦикла;
	иначе
		МассивСообщений.Добавить("Нет макетов справочников!");  		
	КонецЕсли;        
	
	МассивСообщений.Добавить("Обновление справочников НСИ завершена");
	
	ПоместитьВоВременноеХранилище(МассивСообщений, АдресРезультата);

КонецПроцедуры

Функция ПолучитьНаименованиеМакетовВсехСправочников()  
	
	Результат = Новый Массив;
	
	Макет = Обработки.э_Макеты.ПолучитьМакет("э_СправочникиНСИ");
	Область = Макет.НайтиТекст("<СправочникиНСИ>",,Макет.Область("C1"),,Истина);
	Если Область = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Индекс = Область.Верх + 1;
	
	Пока Макет.Область(Индекс,1).Текст <> "<\СправочникиНСИ>" Цикл
		
		СправочникНСИ 	= Макет.Область(Индекс, 1).Текст;
		Если Не ПустаяСтрока(СправочникНСИ) Тогда
			Результат.Добавить(СправочникНСИ);
		Иначе
			прервать;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;

	Возврат Результат;
			
КонецФункции	

Процедура ЗагрузитьДанныеПоВагонуИзЭтран(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Для Каждого НомерВагона Из ПараметрыПроцедуры.НомераВагонов Цикл
		Если СтрДлина(НомерВагона) = 8 тогда
			
			Таблица = Новый ТаблицаЗначений;
			Таблица.Колонки.Добавить("Реквизит");
			Таблица.Колонки.Добавить("Значение");
			
			СтрокаТ = Таблица.Добавить();
			СтрокаТ.Реквизит = "Код";
			СтрокаТ.Значение = НомерВагона;
			
			ДлительныеОперации.СообщитьПрогресс(, "Загрузка данных по вагону: " + НомерВагона);
			
			Результат = ЗагрузитьОднуЗапись("э_Вагоны",Таблица,,ПараметрыПроцедуры.СписокРеквизитовОбъекта);
			
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	Исключение
		ЗаписьЖурналаРегистрации("ЗагрузкаДанныхПоВагонуИзЭТРАН", УровеньЖурналаРегистрации.Ошибка,,, "Невозможно поместить в хранилище тип значения: " + Строка(ТипЗнч(Результат)));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// ВСПОМОГАТЕЛЬНЫЕ
#Область Вспомогательные

Функция ПолучитьГраницуПериодаЗагрузкиОбъектов(ТекущаяДата,НазваниеДокмента) 
	
	НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(НазваниеДокмента);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ГраницаПериодаЗагрузкиДокументов = НаборЗаписей[0].Граница;
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.Объект  = НазваниеДокмента;
		Запись.Граница = ТекущаяДата();
		ГраницаПериодаЗагрузкиДокументов = Запись.Граница;
		НаборЗаписей.Записать();		
	КонецЕсли;		
	
	
	Возврат ГраницаПериодаЗагрузкиДокументов;
	
КонецФункции

Функция ПолучитьНомерПоследнейОперации(НаименованиеЗапроса) 
	
	НомерПоследнейОперации = "999999999999999";	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НомерПоследнейОперации.НомерОперации КАК НомерОперации
	               |ИЗ
	               |	РегистрСведений.э_НомерПоследнейОперации КАК э_НомерПоследнейОперации
	               |ГДЕ
	               |	э_НомерПоследнейОперации.Запрос = &Запрос";
	Запрос.УстановитьПараметр("Запрос", НаименованиеЗапроса);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		НомерПоследнейОперации = Ответ.НомерОперации;
	КонецЕсли;
	
	Возврат НомерПоследнейОперации;
	
КонецФункции

//Функция ОбработкаОшибокЗапросаДанных(РезультатЗапроса, Отключить = Ложь) //Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
Функция ОбработкаОшибокЗапросаДанных(РезультатЗапроса, Отключить = Ложь, ТекстЗапроса = Неопределено, ТипЗапроса = Неопределено) экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("КодОшибки",Неопределено);
	//Рыбьяков К.А 03.05.2024 Ticket#0350495
	Ответ.Вставить("СтатусКод",Неопределено);
	//Рыбьяков К.А 03.05.2024 Ticket#0350495
	
	Если Не Отключить Тогда
		
		Если РезультатЗапроса = "Ошибка подключения к прокси. error"  Тогда 
			Ответ.Вставить("КодОшибки","0"); 
		КонецЕсли;
		
		//СКА 19102019
		Если РезультатЗапроса = "" Тогда 
			Ответ.Вставить("КодОшибки","1"); 
		КонецЕсли;
		//СКА 19102019
		
		//Евросиб Каблов 18.08.2021 ( Ticket#0238931
		//Если Найти(РезультатЗапроса,"<error>") > 0 Тогда
		Если Найти(РезультатЗапроса,"<error") > 0 Тогда
			//Евросиб Каблов 18.08.2021 ) 
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(РезультатЗапроса);
			КодОшибки = "0";
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "errorCode" Тогда
					КодОшибки = ЧтениеXML.ПолучитьАтрибут("value");
					Ответ.Вставить("КодОшибки",КодОшибки); 
				ИначеЕсли ЧтениеXML.Имя = "errorMessage" Тогда
					ТекстОшибки = ЧтениеXML.ПолучитьАтрибут("value");
					Ответ.Вставить("ТекстОшибки",ТекстОшибки);
					//Рыбьяков К.А 03.05.2024 Ticket#0350495
				ИначеЕсли ЧтениеXML.Имя = "errorStatusCode" Тогда
					СтатусКод = ЧтениеXML.ПолучитьАтрибут("value");
					Ответ.Вставить("СтатусКод", СтатусКод);
					//Рыбьяков К.А 03.05.2024 Ticket#0350495
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//Евросиб Гудкова( 04.09.2020 Ticket№ 0205656
	ЗаписатьЛогЭТРАН(ТипЗапроса, ТекстЗапроса, РезультатЗапроса,,,, Ответ.КодОшибки <> Неопределено);
	// Евросиб Гудкова) 	
	Возврат Ответ;
	
КонецФункции

Процедура ЗаписатьЛогЭТРАН(ТипЗапроса, ТекстЗапроса, РезультатЗапроса, ОтключитьЗаписьВФайл = Ложь, Пользователь = "Этран",НомерТранзакции = Неопределено, Ошибка = Ложь) 
	
	Если Не ОтключитьЗаписьВФайл Тогда
		
		//Пользователь 				   = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи 				   = РегистрыСведений.э_ЛогиЭТРАН.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период		   = ТекущаяДата();
		//МенеджерЗаписи.Пользователь    = "";
		МенеджерЗаписи.ТипЗапроса 	   = ТипЗапроса;
		МенеджерЗаписи.НомерТранзакции = НомерТранзакции;
		МенеджерЗаписи.Запрос 		   = ТекстЗапроса;
//Евросиб Гудкова( 08.10.2019
//было 		МенеджерЗаписи.Ответ 		   = РезультатЗапроса;
		Сжатие = Новый СжатиеДанных(9);
		МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
// Евросиб Гудкова)
		
		Если Найти(РезультатЗапроса,"error") > 0 Или Ошибка Тогда
			МенеджерЗаписи.Ошибка = Истина;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОшибкиЗагрузкиЭТРАН(ТипЗапроса, ТекстЗапроса, РезультатЗапроса, Регламент, ТекстОшибки, ИДЗаявки, ПериодЗапроса) 

	МенеджерЗаписи = РегистрыСведений.ОшибкиЗагрузкиЭТРАН.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Период = ПериодЗапроса.ДатаНачала;
	МенеджерЗаписи.ОкончаниеПериода = ПериодЗапроса.ДатаОкончания;
	МенеджерЗаписи.ТипЗапроса = ТипЗапроса;
	МенеджерЗаписи.ИДЗаявки = ИДЗаявки;
	МенеджерЗаписи.Запрос = ТекстЗапроса;
	Сжатие = Новый СжатиеДанных(9);
	МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
	МенеджерЗаписи.Ошибка = ТекстОшибки;
	МенеджерЗаписи.Регламент = Регламент;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНомерПоследнейОперации(OperId,НаименованиеЗапроса)

	НаборЗаписей = РегистрыСведений.э_НомерПоследнейОперации.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Запрос.Установить(НаименованиеЗапроса);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Запрос = НаименованиеЗапроса;
	НоваяЗапись.НомерОперации = OperId; 
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьГраницуПериодаЗагрузкиОбъектов(НоваяГраницаПериода,НазваниеДокумента) Экспорт

	НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(НазваниеДокумента);
	Запись = НаборЗаписей.Добавить();
	Запись.Объект  = НазваниеДокумента;
	Запись.Граница = НоваяГраницаПериода;
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ПолучитьСоответствиеТаблицОбъекта(МакетНастроек) экспорт 
	Соответствие = Новый Соответствие;

	Область = МакетНастроек.НайтиТекст("<СоответствиеТаблицОбъекта>",,МакетНастроек.Область("C1"),,Истина);
	Индекс = Область.Верх + 1;
	
	Пока МакетНастроек.Область(Индекс,1).Текст <> "<\СоответствиеТаблицОбъекта>" Цикл
		Если ПустаяСтрока(МакетНастроек.Область(Индекс,1).Текст) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		Ключ = МакетНастроек.Область(Индекс,1).Текст;
		Значение = МакетНастроек.Область(Индекс,2).Текст;
		Соответствие.Вставить(Ключ, Значение);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

//Процедура копирует объект Источник в объект Приемник, объекты должны быть одинакового состава
Процедура ЗаполнитьОбъект(Приемник, Источник, ОбъектыЗаполнения="") 
	Если ОбъектыЗаполнения="" Тогда
		ЗаполнитьЗначенияСвойств(Приемник, Источник);
		Для Каждого Объект Из Приемник.Метаданные().ТабличныеЧасти Цикл
			ТабличнаяЧасть = Приемник[Объект.Имя];
			ТабличнаяЧасть.Загрузить(Источник[Объект.Имя].Выгрузить());
		КонецЦикла;
	Иначе
		Реквизиты = "";
		Таблицы = "";
		ПозицияТаблиц = Найти(ОбъектыЗаполнения,"<Таблицы>");
		Если ПозицияТаблиц <> 0 Тогда
			Таблицы   = СтрЗаменить(Сред(ОбъектыЗаполнения,ПозицияТаблиц),"<Таблицы>","");
			Реквизиты = Сред(ОбъектыЗаполнения,1,ПозицияТаблиц-1);
		КонецЕсли;
		Реквизиты = СтрЗаменить(Реквизиты,"<Реквизиты>","");
		Если Реквизиты <> "" Тогда			
			Для Каждого Объект Из Приемник.Метаданные().Реквизиты Цикл
				ПозицияРеквизита = Найти(Реквизиты,Объект.Имя);
				Если ПозицияРеквизита <> 0 Тогда
					Приемник[Объект.Имя] = Источник[Объект.Имя];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Таблицы <> "" Тогда
			Для Каждого Объект Из Приемник.Метаданные().ТабличныеЧасти Цикл
				ПозицияТаблицы = Найти(Таблицы,Объект.Имя);
				Если ПозицияТаблицы <> 0 и не Объект.Имя = "Грузы" Тогда
					ТабличнаяЧасть = Приемник[Объект.Имя];
					ТабличнаяЧасть.Загрузить(Источник[Объект.Имя].Выгрузить());
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Функция возращает Соответствие, в котором перечислены все реквезиты и таблицы объекта в переведённом виде
// Если Загрузка=Истина, то возвращается соответствие данных XML реквизитам АТК, 
// иначе возвращается соответствие реквизитов АТК данным XML(для создания запросов)
Функция ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек,Знач КолонкаЗагрузки=0) Экспорт
	Соответствие = Новый Соответствие;

	Область = МакетНастроек.НайтиТекст("<Перевод>",,МакетНастроек.Область("C1"),,Истина);
	Индекс = Область.Верх + 1;
	
	Если КолонкаЗагрузки=0 Тогда	
		Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Перевод>" Цикл
			Если ПустаяСтрока(МакетНастроек.Область(Индекс,1).Текст) Тогда
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
			Если МакетНастроек.Область(Индекс,1).Текст = "<Реквизиты>" Тогда
				Индекс = Индекс + 1;
				Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл
					
					РеквизитЭтран = МакетНастроек.Область(Индекс,1).Текст;
					РеквизитАТК = МакетНастроек.Область(Индекс,2).Текст;
					
					Если ПустаяСтрока(РеквизитЭтран) Или ПустаяСтрока(РеквизитАТК) Тогда
						Индекс = Индекс + 1;
						Продолжить;
					КонецЕсли;
					
					Соответствие.Вставить(РеквизитЭтран, РеквизитАТК);
					Индекс = Индекс + 1;
				КонецЦикла;
			ИначеЕсли МакетНастроек.Область(Индекс,1).Текст = "<Таблица>" Тогда
				ТаблицаЭтран = МакетНастроек.Область(Индекс,2).Текст;
				ТаблицаАТК = МакетНастроек.Область(Индекс,3).Текст;
				Если Не (ПустаяСтрока(ТаблицаЭтран) Или ПустаяСтрока(ТаблицаАТК)) Тогда
					Соответствие.Вставить("Т" + ТаблицаЭтран, ТаблицаАТК);
					Индекс = Индекс + 1;
					Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Таблица>" Цикл
						РеквизитЭтран = МакетНастроек.Область(Индекс,1).Текст;
						РеквизитАТК = МакетНастроек.Область(Индекс,2).Текст;
						
						Если ПустаяСтрока(РеквизитЭтран) Или ПустаяСтрока(РеквизитАТК) Тогда
							Индекс = Индекс + 1;
							Продолжить;
						КонецЕсли;
						
						Соответствие.Вставить(ТаблицаАТК + РеквизитЭтран, РеквизитАТК);
						Индекс = Индекс + 1;					
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	Иначе
		КолонкаЗагрузки = 2 + КолонкаЗагрузки;
		Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Перевод>" Цикл
			Если ПустаяСтрока(МакетНастроек.Область(Индекс,1).Текст) Тогда
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
			Если МакетНастроек.Область(Индекс,1).Текст = "<Реквизиты>" Тогда
				Индекс = Индекс + 1;
				Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл

					РеквизитАТК = МакетНастроек.Область(Индекс,2).Текст;
					РеквизитЭтран = ?(МакетНастроек.Область(Индекс,КолонкаЗагрузки).Текст="+"
										,МакетНастроек.Область(Индекс,1).Текст
										,МакетНастроек.Область(Индекс,КолонкаЗагрузки).Текст);						
					
					Если ПустаяСтрока(РеквизитЭтран) Или ПустаяСтрока(РеквизитАТК) Тогда
						Индекс = Индекс + 1;
						Продолжить;
					КонецЕсли;
					
					Соответствие.Вставить(РеквизитАТК, РеквизитЭтран);
					Индекс = Индекс + 1;
				КонецЦикла;
			ИначеЕсли МакетНастроек.Область(Индекс,1).Текст = "<Таблица>" Тогда
				ТаблицаАТК = МакетНастроек.Область(Индекс,3).Текст;
				ТаблицаЭтран = ?(МакетНастроек.Область(Индекс,КолонкаЗагрузки+1).Текст="+"
									,МакетНастроек.Область(Индекс,2).Текст
									,МакетНастроек.Область(Индекс,КолонкаЗагрузки+1).Текст);					

				Если Не (ПустаяСтрока(ТаблицаЭтран) Или ПустаяСтрока(ТаблицаАТК)) Тогда
					Соответствие.Вставить("Т" + ТаблицаАТК, ТаблицаЭтран);
					Индекс = Индекс + 1;
					Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Таблица>" Цикл
						РеквизитАТК = МакетНастроек.Область(Индекс,2).Текст;
						РеквизитЭтран = ?(МакетНастроек.Область(Индекс,КолонкаЗагрузки).Текст="+"
											,МакетНастроек.Область(Индекс,1).Текст
											,МакетНастроек.Область(Индекс,КолонкаЗагрузки).Текст);						

						Если ПустаяСтрока(РеквизитЭтран) Или ПустаяСтрока(РеквизитАТК) Тогда
							Индекс = Индекс + 1;
							Продолжить;
						КонецЕсли;
						
						Соответствие.Вставить(ТаблицаЭтран + РеквизитАТК, РеквизитЭтран);
						Индекс = Индекс + 1;					
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции

// Функция возращает именя переведенных реквизитов, ссылок и таблиц, которые используются при загрузке объекта из Этран
Функция ПолучитьИменаПереведенныхРеквизитовИСсылокИТаблиц(МакетНастроек) 
	
	Реквизиты = "";
	Ссылки = "";
	Таблицы = "";
	
	Область = МакетНастроек.НайтиТекст("<Перевод>",,МакетНастроек.Область("C1"),,Истина);
	Область = МакетНастроек.НайтиТекст("<Реквизиты>",Область,МакетНастроек.Область("C1"),,Истина);
	Индекс = Область.Верх + 1;

	Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл
		
		РеквизитЭтран = МакетНастроек.Область(Индекс,1).Текст;
		РеквизитАТК = МакетНастроек.Область(Индекс,2).Текст;
		
		Если ПустаяСтрока(РеквизитЭтран) Или ПустаяСтрока(РеквизитАТК) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;

		Реквизиты = Реквизиты + "," + РеквизитАТК;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Область = МакетНастроек.НайтиТекст("<СоответствиеТаблицОбъекта>",Область,МакетНастроек.Область("C1"),,Истина);
	Индекс = Область.Верх + 1;

	Пока МакетНастроек.Область(Индекс,1).Текст <> "<\СоответствиеТаблицОбъекта>" Цикл

		ТаблицаАТК = МакетНастроек.Область(Индекс,1).Текст;
		
		Если ПустаяСтрока(ТаблицаАТК) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;

		Таблицы = Таблицы + "," + ТаблицаАТК;
		Индекс = Индекс + 1;
	КонецЦикла;

	
	Область = МакетНастроек.НайтиТекст("<ЗаполнениеСсылок>",Область,МакетНастроек.Область("C1"),,Истина);
	Область = МакетНастроек.НайтиТекст("<Реквизиты>",Область,МакетНастроек.Область("C1"),,Истина);
	Индекс = Область.Верх + 1;

	Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл

		СсылкаАТК = МакетНастроек.Область(Индекс,1).Текст;
		
		Если ПустаяСтрока(СсылкаАТК) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;

		Ссылки = Ссылки + "," + СсылкаАТК;
		Индекс = Индекс + 1;
	КонецЦикла;

	Реквизиты = Сред(Реквизиты,2);
	Ссылки = Сред(Ссылки,2);
	Таблицы = Сред(Таблицы,2);
	
	Результат = "<Реквизиты>" + Реквизиты + "<Ссылки>" + Ссылки + "<Таблицы>" + Таблицы;
	Возврат Результат;
	
КонецФункции

// Процедура заполняет реквизиты и табличные части Объекта в соответствии с данными из СтрокиXML
// В соответстви СоответствиеТаблицОбъекта указаны все табличные части объекта в первом параметре, 
// а во втором - название реквизита, ссылающегося на другую табличную часть, для данной табличной части
Процедура ЗаполнитьОбъектИзXML(Объект,СоответствиеТаблицОбъекта,СоответствиеПеревод,СтрокаXML,ПутьКФайлу = Неопределено) 
	
	СтрокаXMLПослеЗаменыСимволов = ЗаменитьСимволыXML(СтрокаXML);
	
	//ЧтениеXML = Новый ЧтениеXML;
	//ЧтениеXML.УстановитьСтроку(СтрокаXMLПослеЗаменыСимволов);
	ЧтениеXML = Новый ЧтениеXML;
	
	Если ПутьКФайлу = Неопределено Тогда
		ЧтениеXML.УстановитьСтроку(СтрокаXML);	
	Иначе  		
		ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	КонецЕсли;

	Стек = Новый Массив;
	Стек.Добавить("");
	Стек.Добавить(Объект);
	ПредыдущийПараметр = Неопределено;
	ПредыдущаяСтрока = Неопределено;
	
	ГОКОД = неопределено;
	ГПКОД = неопределено;
	ГОНаименование = "";
	ГПНаименование = "";
	
	//Попытка для поиск ошибки
	Попытка
		Пока ЧтениеXML.Прочитать() Цикл
			
			Имя = ЧтениеXML.Имя;
			ТаблицаАТК = СоответствиеПеревод["Т" + Имя];
			Параметр = СоответствиеТаблицОбъекта[ТаблицаАТК];
			
			Если Параметр <> Неопределено Тогда
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					//ТаблицаАТК = СоответствиеПеревод["Т" + Имя];
					Строка = Объект[ТаблицаАТК].Добавить();
					Стек.Добавить(ТаблицаАТК);
					Стек.Добавить(Строка);
					Если Параметр <> "" Тогда
						Если Найти(Параметр,"->") = 1 Тогда
							РеквизитАТК = СтрЗаменить(Параметр,"->","");
							Строка[РеквизитАТК] = ?(ПредыдущийПараметр = Параметр,ПредыдущаяСтрока[РеквизитАТК] + 1,0);
							ПредыдущийПараметр = Параметр;
							ПредыдущаяСтрока = Строка;
						Иначе
							Родитель = Стек[Стек.Количество()-3];
							Строка[Параметр] = Родитель[Параметр];
						КонецЕсли;					
					КонецЕсли;
				Иначе
					Стек.Удалить(Стек.Количество()-1);
					Стек.Удалить(Стек.Количество()-1);
				КонецЕсли;
			Иначе
				Попытка
					Атрибут = ЧтениеXML.ПолучитьАтрибут("value");
					Если Атрибут <> Неопределено Тогда
						Строка      = Стек[Стек.Количество()-1];
						ТаблицаАТК  = Стек[Стек.Количество()-2];
						РеквизитАТК = СоответствиеПеревод[ТаблицаАТК + Имя];
						
						Если Имя = "invSenderName" Тогда
							ГОНаименование = Атрибут;
						ИначеЕсли Имя = "invRecipName" Тогда
							ГПНаименование = Атрибут;
						ИначеЕсли Имя = "invSenderID" Тогда
							ГОКОД = Атрибут;
						ИначеЕсли Имя = "invRecipID" Тогда
							ГПКОД = Атрибут;
						КонецЕсли;
							
						Строка[РеквизитАТК] = Атрибут;
						
					КонецЕсли;
				Исключение
					//Сообщить(Имя + " : " + Атрибут);
				КонецПопытки;			
				
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ы=1;
	КонецПопытки;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.э_Накладная") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Грузоотправитель) И ЗначениеЗаполнено(ГОНаименование) Тогда
			Объект.Грузоотправитель = ПолучитьГОГП(ГОКОД, ГОНаименование);
			Объект.ГрузоотправительИД = ГОКОД;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) И ЗначениеЗаполнено(ГПНаименование) Тогда
			Объект.Грузополучатель = ПолучитьГОГП(ГПКОД, ГПНаименование);
			Объект.ГрузополучательИД = ГПКОД;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГОГП(Код, Наименование)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_ПаспортаОрганизаций.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.э_ПаспортаОрганизаций КАК э_ПаспортаОрганизаций
	               |ГДЕ
	               |	НЕ э_ПаспортаОрганизаций.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &Код <> НЕОПРЕДЕЛЕНО
	               |				ТОГДА э_ПаспортаОрганизаций.Код = &Код
	               |			ИНАЧЕ э_ПаспортаОрганизаций.Наименование = &Наименование
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	Иначе
		
		НСпр = Справочники.э_ПаспортаОрганизаций.СоздатьЭлемент();
		НСпр.Наименование = Наименование;
		НСпр.Код = Код;
		Попытка
			НСпр.Записать();
		Исключение
			Возврат Неопределено;
		КонецПопытки; 		
		Результат = НСпр.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Функция возвращает Строку XML на основе данных объекта
// В соответстви СоответствиеТаблицОбъекта указаны все табличные части объекта в первом параметре, 
// а во втором - название реквизита, ссылающегося на другую табличную часть, для данной табличной части
Функция ЗаполнитьXMLИзОбъекта(Объект,СоответствиеТаблицОбъекта,СоответствиеПеревод,МакетНастроек = Неопределено) экспорт
	
	//АТК 29012015
	Если МакетНастроек = Неопределено тогда
		Возврат "";
	иначе
		
		СтрокаXML = "";
		
		//АТК 29012015
		Индекс = 0;
		БлокДанных = "";
		ТекТаблица = "";
		ТекущийТекст = МакетНастроек.Область(Индекс,1).Текст;  				
		
		Пока ТекущийТекст <> "<\Перевод>" Цикл
			
			Если ПустаяСтрока(ТекущийТекст) Тогда
				Индекс = Индекс + 1;
				ТекущийТекст = МакетНастроек.Область(Индекс,1).Текст;
				Продолжить;
			ИначеЕсли ТекущийТекст = "<Реквизиты>" Тогда
				БлокДанных = "Реквизиты";
			ИначеЕсли ТекущийТекст = "<Таблица>" Тогда  
				БлокДанных = "Таблица"; 
				ТекТаблица = МакетНастроек.Область(Индекс,3).Текст;
			КонецЕсли;
			
			ТекущееЗначение = МакетНастроек.Область(Индекс,2).Текст;	
			Если ПустаяСтрока(ТекущееЗначение) Тогда
				Индекс = Индекс + 1;
				ТекущийТекст = МакетНастроек.Область(Индекс,1).Текст;
				Продолжить;
			КонецЕсли;
			
			Если БлокДанных = "Реквизиты" Тогда
				
				РеквизитЭтран = СоответствиеПеревод[ТекущееЗначение];
				Если РеквизитЭтран<>Неопределено Тогда
					Значение = Объект[ТекущееЗначение];
					Если ЗначениеЗаполнено(Значение) Тогда
						Значение = ?(ТипЗнч(Объект[ТекущееЗначение]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
						СтрокаXML = СтрокаXML + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
					КонецЕсли;
				КонецЕсли;		
				
			КонецЕсли;
			
			Если БлокДанных = "Таблица" Тогда
				
				Для Каждого Таблица Из Объект.Метаданные().ТабличныеЧасти Цикл
					Если Таблица.Имя = ТекТаблица тогда
						ТаблицаЭтран = СоответствиеПеревод["Т" + Таблица.Имя];
						РеквизитСвязиТаблиц = СоответствиеТаблицОбъекта[Таблица.Имя];
						Если ТаблицаЭтран<>Неопределено И РеквизитСвязиТаблиц = "" Тогда
							
							
							Для Каждого Строка Из Объект[Таблица.Имя] Цикл
								
								
								СтрокаXMLТаблицы = "";  				
								//СтрокаXML = СтрокаXML + Символы.ПС + "<" + ТаблицаЭтран + ">";
								Для Каждого Реквизит Из Объект.Метаданные().ТабличныеЧасти[Таблица.Имя].Реквизиты Цикл
									РеквизитЭтран = СоответствиеПеревод[ТаблицаЭтран+Реквизит.Имя];
									Если РеквизитЭтран<>Неопределено Тогда
										Значение = Строка[Реквизит.Имя];
										Если ЗначениеЗаполнено(Значение) Тогда
											Значение = ?(ТипЗнч(Строка[Реквизит.Имя]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
											СтрокаXMLТаблицы = СтрокаXMLТаблицы + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								//Если в таблице есть реквизит, указанный в следующей(СоответствиеТаблицОбъекта), то вставляем следующую таблицу сюда.
								// тоже самое делаем со всеми последующими
								
								Для Каждого ВложеннаяТаблица Из Объект.Метаданные().ТабличныеЧасти Цикл
									ВложеннаяТаблицаЭтран = СоответствиеПеревод["Т" + ВложеннаяТаблица.Имя];
									РеквизитСвязиТаблиц = СоответствиеТаблицОбъекта[ВложеннаяТаблица.Имя];
									Если ВложеннаяТаблицаЭтран<>Неопределено И РеквизитСвязиТаблиц <> "" Тогда
										Попытка
											КолонкаРодителя = Объект.Метаданные().ТабличныеЧасти[Таблица.Имя].Реквизиты[РеквизитСвязиТаблиц];
										Исключение
											Продолжить;
										КонецПопытки;
										Отбор = Новый Структура();
										Отбор.Вставить(РеквизитСвязиТаблиц,Строка[РеквизитСвязиТаблиц]);
										НайденныеСтроки = Объект[ВложеннаяТаблица.Имя].НайтиСтроки(Отбор);
										
										Для Каждого ВложеннаяСтрока Из НайденныеСтроки Цикл
											СтрокаXMLВложеннойТаблицы = "";
											//СтрокаXML = СтрокаXML + Символы.ПС + "<" + ВложеннаяТаблицаЭтран + ">";
											Для Каждого Реквизит Из Объект.Метаданные().ТабличныеЧасти[ВложеннаяТаблица.Имя].Реквизиты Цикл
												РеквизитЭтран = СоответствиеПеревод[ВложеннаяТаблицаЭтран+Реквизит.Имя];
												Если РеквизитЭтран<>Неопределено Тогда
													Значение = ВложеннаяСтрока[Реквизит.Имя];
													Если ЗначениеЗаполнено(Значение) Тогда
														Значение = ?(ТипЗнч(ВложеннаяСтрока[Реквизит.Имя]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
														СтрокаXMLВложеннойТаблицы = СтрокаXMLВложеннойТаблицы + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
													КонецЕсли;
												КонецЕсли;
											КонецЦикла;
											//Если в таблице есть реквизит, указанный в следующей(СоответствиеТаблицОбъекта), то вставляем следующую таблицу сюда.
											// тоже самое делаем со всеми последующими
											
											Если ЗначениеЗаполнено(СтрокаXMLВложеннойТаблицы) Тогда
												СтрокаXMLТаблицы = СтрокаXMLТаблицы 
												+ Символы.ПС + "<" + ВложеннаяТаблицаЭтран + ">" 
												+ СтрокаXMLВложеннойТаблицы
												+ Символы.ПС + "</" + ВложеннаяТаблицаЭтран + ">";
											КонецЕсли;
											//СтрокаXML = СтрокаXML + Символы.ПС + "</" + ВложеннаяТаблицаЭтран + ">";
										КонецЦикла;			
										
									КонецЕсли;
								КонецЦикла;
								
								
								Если ЗначениеЗаполнено(СтрокаXMLТаблицы) Тогда
									СтрокаXML = СтрокаXML 
									+ Символы.ПС + "<" + ТаблицаЭтран + ">" 
									+ СтрокаXMLТаблицы 
									+ Символы.ПС + "</" + ТаблицаЭтран + ">";
								КонецЕсли;
								//СтрокаXML = СтрокаXML + Символы.ПС + "</" + ТаблицаЭтран + ">";
							КонецЦикла;			
							
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				 				
			КонецЕсли;
			
			Индекс = Индекс + 1;

		КонецЦикла;
			
		СтрокаXML = СтрЗаменить(СтрокаXML,Символы.НПП,"");
		
		Возврат СтрокаXML;
		
	//АТК 29012015	
	КонецЕсли;

	
	//До изменения 20012015
	//СтрокаXML = ""; 	
	//Для Каждого Реквизит Из Объект.Метаданные().Реквизиты Цикл
	//	РеквизитЭтран = СоответствиеПеревод[Реквизит.Имя];
	//	Если РеквизитЭтран<>Неопределено Тогда
	//		Значение = Объект[Реквизит.Имя];
	//		Если ЗначениеЗаполнено(Значение) Тогда
	//			Значение = ?(ТипЗнч(Объект[Реквизит.Имя]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
	//			СтрокаXML = СтрокаXML + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЦикла;
	//	
	//	Для Каждого Таблица Из Объект.Метаданные().ТабличныеЧасти Цикл
	//		ТаблицаЭтран = СоответствиеПеревод["Т" + Таблица.Имя];
	//		РеквизитСвязиТаблиц = СоответствиеТаблицОбъекта[Таблица.Имя];
	//		Если ТаблицаЭтран<>Неопределено И РеквизитСвязиТаблиц = "" Тогда
	//			
	//			
	//			Для Каждого Строка Из Объект[Таблица.Имя] Цикл
	//				
	//				
	//				СтрокаXMLТаблицы = "";  				
	//				//СтрокаXML = СтрокаXML + Символы.ПС + "<" + ТаблицаЭтран + ">";
	//				Для Каждого Реквизит Из Объект.Метаданные().ТабличныеЧасти[Таблица.Имя].Реквизиты Цикл
	//					РеквизитЭтран = СоответствиеПеревод[ТаблицаЭтран+Реквизит.Имя];
	//					Если РеквизитЭтран<>Неопределено Тогда
	//						Значение = Строка[Реквизит.Имя];
	//						Если ЗначениеЗаполнено(Значение) Тогда
	//							Значение = ?(ТипЗнч(Строка[Реквизит.Имя]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
	//							СтрокаXMLТаблицы = СтрокаXMLТаблицы + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
	//						КонецЕсли;
	//					КонецЕсли;
	//				КонецЦикла;
	//				//Если в таблице есть реквизит, указанный в следующей(СоответствиеТаблицОбъекта), то вставляем следующую таблицу сюда.
	//				// тоже самое делаем со всеми последующими
	//				
	//				Для Каждого ВложеннаяТаблица Из Объект.Метаданные().ТабличныеЧасти Цикл
	//					ВложеннаяТаблицаЭтран = СоответствиеПеревод["Т" + ВложеннаяТаблица.Имя];
	//					РеквизитСвязиТаблиц = СоответствиеТаблицОбъекта[ВложеннаяТаблица.Имя];
	//					Если ВложеннаяТаблицаЭтран<>Неопределено И РеквизитСвязиТаблиц <> "" Тогда
	//						Попытка
	//							КолонкаРодителя = Объект.Метаданные().ТабличныеЧасти[Таблица.Имя].Реквизиты[РеквизитСвязиТаблиц];
	//						Исключение
	//							Продолжить;
	//						КонецПопытки;
	//						Отбор = Новый Структура();
	//						Отбор.Вставить(РеквизитСвязиТаблиц,Строка[РеквизитСвязиТаблиц]);
	//						НайденныеСтроки = Объект[ВложеннаяТаблица.Имя].НайтиСтроки(Отбор);
	//						
	//						Для Каждого ВложеннаяСтрока Из НайденныеСтроки Цикл
	//							СтрокаXMLВложеннойТаблицы = "";
	//							//СтрокаXML = СтрокаXML + Символы.ПС + "<" + ВложеннаяТаблицаЭтран + ">";
	//							Для Каждого Реквизит Из Объект.Метаданные().ТабличныеЧасти[ВложеннаяТаблица.Имя].Реквизиты Цикл
	//								РеквизитЭтран = СоответствиеПеревод[ВложеннаяТаблицаЭтран+Реквизит.Имя];
	//								Если РеквизитЭтран<>Неопределено Тогда
	//									Значение = ВложеннаяСтрока[Реквизит.Имя];
	//									Если ЗначениеЗаполнено(Значение) Тогда
	//										Значение = ?(ТипЗнч(ВложеннаяСтрока[Реквизит.Имя]) = Тип("Число"),СтрЗаменить(Значение,",","."),Значение);
	//										СтрокаXMLВложеннойТаблицы = СтрокаXMLВложеннойТаблицы + Символы.ПС + "<" + РеквизитЭтран + " value=""" + Значение + """/>";
	//									КонецЕсли;
	//								КонецЕсли;
	//							КонецЦикла;
	//							//Если в таблице есть реквизит, указанный в следующей(СоответствиеТаблицОбъекта), то вставляем следующую таблицу сюда.
	//							// тоже самое делаем со всеми последующими
	//							
	//							Если ЗначениеЗаполнено(СтрокаXMLВложеннойТаблицы) Тогда
	//								СтрокаXMLТаблицы = СтрокаXMLТаблицы 
	//								+ Символы.ПС + "<" + ВложеннаяТаблицаЭтран + ">" 
	//								+ СтрокаXMLВложеннойТаблицы
	//								+ Символы.ПС + "</" + ВложеннаяТаблицаЭтран + ">";
	//							КонецЕсли;
	//							//СтрокаXML = СтрокаXML + Символы.ПС + "</" + ВложеннаяТаблицаЭтран + ">";
	//						КонецЦикла;			
	//						
	//					КонецЕсли;
	//				КонецЦикла;
	//				
	//				
	//				Если ЗначениеЗаполнено(СтрокаXMLТаблицы) Тогда
	//					СтрокаXML = СтрокаXML 
	//					+ Символы.ПС + "<" + ТаблицаЭтран + ">" 
	//					+ СтрокаXMLТаблицы 
	//					+ Символы.ПС + "</" + ТаблицаЭтран + ">";
	//				КонецЕсли;
	//				//СтрокаXML = СтрокаXML + Символы.ПС + "</" + ТаблицаЭтран + ">";
	//			КонецЦикла;			
	//			
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	СтрокаXML = СтрЗаменить(СтрокаXML,Символы.НПП,"");
	//	
	//	Возврат СтрокаXML;
	//	
	////АТК 29012015	
	//КонецЕсли;

КонецФункции

// Функция преобразовывает данные XML в таблицу
// Имена колонок в таблице задаются в соответтствии с макетом КонвертацияРеквизитов
Функция XMLВТаблицу(СтрокаXML,КонвертацияРеквизитов) 
	
	НезагруженныеРеквизиты = Новый массив;
	
	Конвертация = Новый Соответствие;
	Таблица = Новый ТаблицаЗначений;
	СсылочныеОбъекты = Новый ТаблицаЗначений;
	СсылочныеОбъекты.Колонки.Добавить("РеквизитСсылка");
	СсылочныеОбъекты.Колонки.Добавить("ОбъектПоиска");
	СсылочныеОбъекты.Колонки.Добавить("РеквизитПоиска");
	
	Если СтрокаXML = Неопределено
		ИЛИ СтрокаXML = "" Тогда
		Возврат Таблица;
	КонецЕсли;

	// Создание колонок в Таблице
	Область = КонвертацияРеквизитов.НайтиТекст("<Реквизиты>",,КонвертацияРеквизитов.Область("C1"),,Истина);
	Если Область = Неопределено Тогда 
		Возврат Таблица;
	КонецЕсли;
	Индекс = Область.Верх + 1;	
	
	Пока КонвертацияРеквизитов.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл
		Если ПустаяСтрока(КонвертацияРеквизитов.Область(Индекс,2).Текст) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		НовоеИмя = КонвертацияРеквизитов.Область(Индекс,2).Текст;
		//СтароеИмя = Неопределено;
		Если Не ПустаяСтрока(КонвертацияРеквизитов.Область(Индекс,1).Текст) Тогда
			СтароеИмя = КонвертацияРеквизитов.Область(Индекс,1).Текст;
			Конвертация.Вставить(СтароеИмя,НовоеИмя);
		КонецЕсли;
		Таблица.Колонки.Добавить(НовоеИмя);
		ОбъектПоиска = КонвертацияРеквизитов.Область(Индекс,3).Текст;
		Если Не ПустаяСтрока(ОбъектПоиска) Тогда
			Строка = СсылочныеОбъекты.Добавить();
			Строка.РеквизитСсылка = НовоеИмя;
			Строка.ОбъектПоиска = ОбъектПоиска;
			РеквизитПоиска = КонвертацияРеквизитов.Область(Индекс,4).Текст;
			Строка.РеквизитПоиска = ?(РеквизитПоиска="",Строка.РеквизитСсылка,РеквизитПоиска);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	// Заполнение Таблицы
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	Строка = Неопределено;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "row" Тогда
			Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);			
		ИначеЕсли Строка <> Неопределено Тогда
			Попытка
				Строка[Конвертация[ЧтениеXML.Имя]] = ЧтениеXML.ПолучитьАтрибут("value");
			Исключение
				Если НезагруженныеРеквизиты.Найти(ЧтениеXML.Имя) = неопределено Тогда
					НезагруженныеРеквизиты.добавить();
				КонецЕсли; 				
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение ссылочных полей
	Если СсылочныеОбъекты.Количество() <> 0 Тогда
		ТаблицаРеквизитов = Новый ТаблицаЗначений;
		ТаблицаРеквизитов.Колонки.Добавить("Реквизит");
		ТаблицаРеквизитов.Колонки.Добавить("Значение");
		//НовоеНаименование = "";
		
		Для Каждого Строка Из Таблица Цикл
			Для Каждого СтрокаСсылка Из СсылочныеОбъекты Цикл
				ТаблицаРеквизитов.Очистить();
				Стр = ТаблицаРеквизитов.Добавить();
				Стр.Реквизит = СтрокаСсылка.РеквизитПоиска;
				РеквизитСсылка = СтрокаСсылка.РеквизитСсылка;
				Стр.Значение = Строка[РеквизитСсылка];				
				ОбъектПоиска = СтрокаСсылка.ОбъектПоиска;
				//НовоеНаименование = НовоеНаименование + "_" + Строка[РеквизитСсылка];
				Строка[РеквизитСсылка] = ПолучитьИлиСоздатьСсылкуНаОбъект(ОбъектПоиска,"Справочник",ТаблицаРеквизитов);
			КонецЦикла;
			//Строка[Наименование] = ?(Строка[Наименование] = "",Сред(НовоеНаименование,2),Строка[Наименование]);
		КонецЦикла;
	КонецЕсли;
	
		           	
	
	Возврат Таблица;

КонецФункции

Функция XMLВТаблицуОднаЗапись(СтрокаXML,КонвертацияРеквизитов) 
	
	НезагруженныеРеквизиты = Новый массив;
	
	Конвертация = Новый Соответствие;
	Таблица = Новый ТаблицаЗначений;
	СсылочныеОбъекты = Новый ТаблицаЗначений;
	СсылочныеОбъекты.Колонки.Добавить("РеквизитСсылка");
	СсылочныеОбъекты.Колонки.Добавить("ОбъектПоиска");
	СсылочныеОбъекты.Колонки.Добавить("РеквизитПоиска");
	
	Если СтрокаXML = Неопределено Тогда
		Возврат Таблица;
	КонецЕсли;

	// Создание колонок в Таблице
	Область = КонвертацияРеквизитов.НайтиТекст("<Реквизиты>",,КонвертацияРеквизитов.Область("C1"),,Истина);
	Если Область = Неопределено Тогда 
		Возврат Таблица;
	КонецЕсли;
	Индекс = Область.Верх + 1;	
	
	Пока КонвертацияРеквизитов.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл
		Если ПустаяСтрока(КонвертацияРеквизитов.Область(Индекс,2).Текст) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		НовоеИмя = КонвертацияРеквизитов.Область(Индекс,2).Текст;
		//СтароеИмя = Неопределено;
		Если Не ПустаяСтрока(КонвертацияРеквизитов.Область(Индекс,1).Текст) Тогда
			СтароеИмя = КонвертацияРеквизитов.Область(Индекс,1).Текст;
			Конвертация.Вставить(СтароеИмя,НовоеИмя);
		КонецЕсли;
		Таблица.Колонки.Добавить(НовоеИмя);
		ОбъектПоиска = КонвертацияРеквизитов.Область(Индекс,3).Текст;
		Если Не ПустаяСтрока(ОбъектПоиска) Тогда
			Строка = СсылочныеОбъекты.Добавить();
			Строка.РеквизитСсылка = НовоеИмя;
			Строка.ОбъектПоиска = ОбъектПоиска;
			РеквизитПоиска = КонвертацияРеквизитов.Область(Индекс,4).Текст;
			Строка.РеквизитПоиска = ?(РеквизитПоиска="",Строка.РеквизитСсылка,РеквизитПоиска);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	// Заполнение Таблицы
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	Строка = Неопределено;
	Попытка // Евросиб Фролов (26.04.2022
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "row" или ЧтениеXML.Имя = "car" или ЧтениеXML.Имя = "org" или ЧтениеXML.Имя = "cont" тогда
				Строка = ?(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента, Таблица.Добавить(), Неопределено);			
			Иначе
				Попытка
					Строка[Конвертация[ЧтениеXML.Имя]] = ЧтениеXML.ПолучитьАтрибут("value");
				Исключение
					Если НезагруженныеРеквизиты.Найти(ЧтениеXML.Имя) = неопределено Тогда
						НезагруженныеРеквизиты.добавить();
					КонецЕсли; 				
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		// Евросиб Фролов (26.04.2022
		ЗаписьЖурналаРегистрации("Регламентная загрузка документов ЭТРАН", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.э_РегламентнаяЗагрузкаДокументовЭТРАН, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		// Евросиб Фролов)
	КонецПопытки;
	
	// Заполнение ссылочных полей
	Если СсылочныеОбъекты.Количество() <> 0 Тогда
		ТаблицаРеквизитов = Новый ТаблицаЗначений;
		ТаблицаРеквизитов.Колонки.Добавить("Реквизит");
		ТаблицаРеквизитов.Колонки.Добавить("Значение");
		//НовоеНаименование = "";
		
		Для Каждого Строка Из Таблица Цикл
			Для Каждого СтрокаСсылка Из СсылочныеОбъекты Цикл
				ТаблицаРеквизитов.Очистить();
				Стр = ТаблицаРеквизитов.Добавить();
				Стр.Реквизит = СтрокаСсылка.РеквизитПоиска;
				РеквизитСсылка = СтрокаСсылка.РеквизитСсылка;
				Стр.Значение = Строка[РеквизитСсылка];				
				ОбъектПоиска = СтрокаСсылка.ОбъектПоиска;
				//НовоеНаименование = НовоеНаименование + "_" + Строка[РеквизитСсылка];
				Строка[РеквизитСсылка] = ПолучитьИлиСоздатьСсылкуНаОбъект(ОбъектПоиска,"Справочник",ТаблицаРеквизитов);
			КонецЦикла;
			//Строка[Наименование] = ?(Строка[Наименование] = "",Сред(НовоеНаименование,2),Строка[Наименование]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица;

КонецФункции

// Функция преобразовывает таблицу в данные XML
// Имена колонок в таблице задаются в соответтствии с макетом КонвертацияРеквизитов
Функция ТаблицуВXML(Данные,КонвертацияРеквизитов) 
	
КонецФункции

Процедура СоздатьСсылкиПоРеквизитам(Объект,МакетНастроек) 
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Реквизит");
	Таблица.Колонки.Добавить("Значение");

	Область = МакетНастроек.НайтиТекст("<ЗаполнениеСсылок>",,МакетНастроек.Область("C1"),,Истина);
	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПараметров = Область.Верх;
	Индекс = Область.Верх + 1;
	
	Пока МакетНастроек.Область(Индекс,1).Текст <> "<\ЗаполнениеСсылок>" Цикл
		Если ПустаяСтрока(МакетНастроек.Область(Индекс,1).Текст) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		
		Если МакетНастроек.Область(Индекс,1).Текст = "<Реквизиты>" Тогда
			Индекс = Индекс + 1;
			Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Реквизиты>" Цикл
				
				РеквизитСсылка = МакетНастроек.Область(Индекс,1).Текст;
				ОбъектПоиска = МакетНастроек.Область(Индекс,2).Текст;
				ТипОбъекта = МакетНастроек.Область(Индекс,3).Текст;
				
				Если ПустаяСтрока(РеквизитСсылка) Или ПустаяСтрока(ОбъектПоиска) Или ПустаяСтрока(ТипОбъекта) Тогда
					Индекс = Индекс + 1;
					Продолжить;
				КонецЕсли;
				
				Попытка
					ТестНаНаличиеРеквизита = Объект[РеквизитСсылка];
					Если ТипОбъекта = "Справочник" Тогда
						ТестНаНаличиеСправочника = Справочники[ОбъектПоиска];
					ИначеЕсли ТипОбъекта = "Документ" Тогда
						ТестНаНаличиеДокумента = Документы[ОбъектПоиска];
					КонецЕсли;
				Исключение
					Индекс = Индекс + 1;
					Продолжить;
				КонецПопытки;
				
				Колонка = 4;
				Пока Не ПустаяСтрока(МакетНастроек.Область(Индекс,Колонка).Текст) Цикл
					Значение = МакетНастроек.Область(Индекс,Колонка).Текст;
					Реквизит = МакетНастроек.Область(Индекс,Колонка + 1).Текст;
					Если Не ПустаяСтрока(Реквизит) И Не ПустаяСтрока(Значение) Тогда
						Строка = Таблица.Добавить();
						Строка.Реквизит = Реквизит;
						ПараметрПреобразования = МакетНастроек.Область(СтрокаПараметров,Колонка).Текст;
						Попытка
							Строка.Значение = Число(Значение);
							Строка.Значение = Значение;
						Исключение

							Строка.Значение = Объект[Значение];
						КонецПопытки;
					КонецЕсли;
					Колонка = Колонка + 2;
				КонецЦикла;
				 
				РезПоискаОбъекта = ПолучитьИлиСоздатьСсылкуНаОбъект(ОбъектПоиска,ТипОбъекта,Таблица);
				
				Если  ЗначениеЗаполнено(РезПоискаОбъекта)Тогда 
					Объект[РеквизитСсылка] = РезПоискаОбъекта;
				КонецЕсли;
				
					
				Таблица.Очистить();

				Индекс = Индекс + 1;
			КонецЦикла;

		ИначеЕсли МакетНастроек.Область(Индекс,1).Текст = "<Таблица>" Тогда
			ТаблицаОбъекта = МакетНастроек.Область(Индекс,2).Текст;
			Индекс = Индекс + 1;
			Если ПустаяСтрока(ТаблицаОбъекта) Тогда
				Продолжить;
			КонецЕсли;
			Пока МакетНастроек.Область(Индекс,1).Текст <> "<\Таблица>" Цикл
				
				РеквизитСсылка = МакетНастроек.Область(Индекс,1).Текст;					
				ОбъектПоиска = МакетНастроек.Область(Индекс,2).Текст;
				ТипОбъекта = МакетНастроек.Область(Индекс,3).Текст;
				
				Если ПустаяСтрока(РеквизитСсылка) Или ПустаяСтрока(ОбъектПоиска) Или ПустаяСтрока(ТипОбъекта) Тогда
					Индекс = Индекс + 1;
					Продолжить;
				КонецЕсли;
				
				Попытка
					Если ТипОбъекта = "Справочник" Тогда
						ТестНаНаличиеСправочника = Справочники[ОбъектПоиска];
					ИначеЕсли ТипОбъекта = "Документ" Тогда
						ТестНаНаличиеДокумента = Документы[Объект];
					КонецЕсли;
				Исключение
					Индекс = Индекс + 1;
					Продолжить;
				КонецПопытки;

				
				Для Каждого СтрокаТаблицы Из Объект[ТаблицаОбъекта] Цикл
					Попытка
						ТестНаНаличиеРеквизита = СтрокаТаблицы[РеквизитСсылка];
					Исключение
						Индекс = Индекс + 1;
						Продолжить;//работает не правильно, если ошибка в реквизите, уходит в вечный цикл
					КонецПопытки;     
						
					Колонка = 4;
					Пока Не ПустаяСтрока(МакетНастроек.Область(Индекс,Колонка).Текст) Цикл
						Значение = МакетНастроек.Область(Индекс,Колонка).Текст;
						Реквизит = МакетНастроек.Область(Индекс,Колонка + 1).Текст;
						Если Не ПустаяСтрока(Реквизит) И Не ПустаяСтрока(Значение) Тогда
							Строка = Таблица.Добавить();
							Строка.Реквизит = Реквизит;
							ПараметрПреобразования = МакетНастроек.Область(СтрокаПараметров,Колонка).Текст;
							Попытка
								Строка.Значение = Число(Значение);
								Строка.Значение = Значение;
							Исключение
								Строка.Значение = СтрокаТаблицы[Значение];
							КонецПопытки;
						КонецЕсли;
						Колонка = Колонка + 2;
					КонецЦикла;
					СтрокаТаблицы[РеквизитСсылка] = ПолучитьИлиСоздатьСсылкуНаОбъект(ОбъектПоиска,ТипОбъекта,Таблица);
					Таблица.Очистить();
				
				КонецЦикла;				
				Индекс = Индекс + 1;
			КонецЦикла;                 
		КонецЕсли;		
		Индекс = Индекс + 1;
	КонецЦикла;
 
КонецПроцедуры

Функция ПолучитьИлиСоздатьСсылкуНаОбъект(Объект,ТипОбъекта,Знач ТаблицаРеквизитов) 

	Если ТаблицаРеквизитов <> Неопределено Тогда
		
		Если ТаблицаРеквизитов.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Если хотябы один из ключевых реквизитов не заполнен, тогда выходим
		Для Каждого Строка Из ТаблицаРеквизитов Цикл
			Если Не ЗначениеЗаполнено(Строка.Значение) Тогда
				Возврат Неопределено;
			КонецЕсли;		
		КонецЦикла;
		
		ТаблицаРеквизитов = ПреобразоватьТипыПоискаКТипамРеквизитов(Объект,ТипОбъекта,ТаблицаРеквизитов);

		Ссылка = НайтиПоРеквизитам(ТипОбъекта,Объект,ТаблицаРеквизитов);

		Если Ссылка <> Неопределено Тогда
			Возврат Ссылка;		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипОбъекта = "Справочник" Тогда
		НовыйОбъект = ЗагрузитьОднуЗапись(Объект, ТаблицаРеквизитов, истина);
	ИначеЕсли ТипОбъекта = "Документ" Тогда
		//НовыйОбъект = Документы[Объект].ЗагрузитьДокумент(ТаблицаРеквизитов[0].Значение);
	КонецЕсли;

	Возврат НовыйОбъект;

КонецФункции

Функция ПреобразоватьТипыПоискаКТипамРеквизитов(Объект,ТипОбъекта,ТаблицаРеквизитов)
	
	Если ТаблицаРеквизитов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипОбъекта = "Справочник" Тогда
		
		Справочник = Справочники[Объект].СоздатьЭлемент();

		Для Каждого Строка Из ТаблицаРеквизитов Цикл
			Если ТипЗнч(Справочник[Строка.Реквизит]) = Тип("Число") Тогда
				Строка.Значение = Число(Строка.Значение);
			ИначеЕсли ТипЗнч(Справочник[Строка.Реквизит]) = Тип("Строка") Тогда
				Строка.Значение = Формат(Строка.Значение,"ЧГ=0");
			КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = "Документ" Тогда
		
		Документ = Документы[Объект].СоздатьДокумент();

		Для Каждого Строка Из ТаблицаРеквизитов Цикл
			Если ТипЗнч(Документ[Строка.Реквизит]) = Тип("Число") Тогда
				Строка.Значение = Число(Строка.Значение);
			ИначеЕсли ТипЗнч(Документ[Строка.Реквизит]) = Тип("Строка") Тогда
				Строка.Значение = Формат(Строка.Значение,"ЧГ=0");
			КонецЕсли;			
		КонецЦикла;

	КонецЕсли;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

//ТипОбъекта	(Строка)	,например "Справочник"
//Объект		(Строка)	,например "Валюты"
//Таблица, содержет колонки:
//	Реквизит		(Строка)    ,например "Код"
//	Значение		(?)			,например 94
//Возвращает Ссылку на объект или Неопределено
Функция НайтиПоРеквизитам(ТипОбъекта, Объект, Таблица) 

	Если ТипОбъекта = "" Или Объект = "" Или Таблица = Неопределено Или Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ " + Объект + ".Ссылка ИЗ " + ТипОбъекта + "." + Объект + " КАК " + Объект + " ГДЕ";
	ТекстУсловия = "";
	Индекс = 0;
	Для Каждого Строка Из Таблица Цикл
		//Евросиб Каблов 21.04.2021 ( Ticket#0227855
		//ТекстУсловия = ТекстУсловия + " И " + Объект + "." + Строка.Реквизит +" = &Значение" + Индекс;// +" И " + Объект + ".ПометкаУдаления = ЛОЖЬ";
		Если Объект = "э_Станции" И Строка.Реквизит = "Код" Тогда
			ТекстУсловия = ТекстУсловия + " И ПОДСТРОКА(" + Объект + "." + Строка.Реквизит +", 1, 5) = &Значение" + Индекс;
			Строка.Значение = Лев(Строка.Значение, 5);
		Иначе
			ТекстУсловия = ТекстУсловия + " И " + Объект + "." + Строка.Реквизит +" = &Значение" + Индекс;// +" И " + Объект + ".ПометкаУдаления = ЛОЖЬ";
		КонецЕсли;
		//Евросиб Каблов 21.04.2021 )
		Запрос.УстановитьПараметр("Значение" + Индекс, Строка.Значение);
		Индекс = Индекс + 1;
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + Сред(ТекстУсловия,3);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат[0].Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ЗаменитьСимволыXML(Знач СтрокаXML)
	СоотвествиеЗамещаемыеСимволыXML = Новый Соответствие;
	СоотвествиеЗамещаемыеСимволыXML.Вставить("&#28;", "(");
	СоотвествиеЗамещаемыеСимволыXML.Вставить("&#2;", " ");
	СоотвествиеЗамещаемыеСимволыXML.Вставить("&#26;", " ");
	 
	Для Каждого КлючЗначение Из СоотвествиеЗамещаемыеСимволыXML Цикл
		СтрокаXML = СтрЗаменить(СтрокаXML, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат СтрокаXML;
КонецФункции


Функция ЗапросДанных(ТипЗапроса, ТекстЗапроса, ОтключитьОбработкуОшибок = Ложь) экспорт 
	
	Если не Константы.э_ВебСервис.Получить() Тогда  
		глЭтран = ПодключитьКЭтранНаСервере();
	КонецЕсли;

	//РезультатЗапроса = глЭтран.Call("<getNSI><tableName value="DF_DANGER"/><filterField value="DANGER_ID,DANGER_ID"/> <filterCond value=">=,<="/><filterValue value="0,150"/></getNSI>");
	Если Константы.э_ВебСервис.Получить() Тогда
		РезультатЗапроса = ПолучитьОтветНаЗапрос(ТекстЗапроса);	
	Иначе 
		РезультатЗапроса = глЭтран.Call(ТекстЗапроса);
	КонецЕсли;
	
	Если не Константы.э_ВебСервис.Получить() Тогда
		глЭтран.disconnect();
	КонецЕсли;

	//ПутьКФайлуЛога = ЗаписатьЛогВМодуле(ТипЗапроса, ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	//ЗаписатьЛогЭТРАН(ТипЗапроса, ТекстЗапроса, РезультатЗапроса,,"Этран");
	
	//Возврат  ОбработкаОшибокЗапросаДанных(РезультатЗапроса, ПутьКФайлуЛога, ОтключитьОбработкуОшибок); //Если в результате содержатся ошибки, то возврат Неопределено
	Возврат  ОбработкаОшибокЗапросаДанных(РезультатЗапроса, ОтключитьОбработкуОшибок, ТекстЗапроса, ТипЗапроса).РезультатЗапроса; //Если в результате содержатся ошибки, то возврат Неопределено

	
КонецФункции

Функция ПолучитьНастройкиЭТРАН() Экспорт
	
	
	НаборЗаписей = РегистрыСведений.э_НастройкиЭТРАН.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Использовать.Установить(Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат НаборЗаписей[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;


КонецФункции


Процедура ОтладкаФормыФоновогоЗадания (ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	Для Номер = 1 по 10000000000 Цикл
		ДлительныеОперации.СообщитьПрогресс(, "Что-то делается");
	КонецЦикла;
КонецПроцедуры

Функция МассивКодовЕТСНГ_ПорожниеВагоны() Экспорт
	//++ [US 58841] Denis Isadchenko,17.03.2023
	//Результат = Новый Массив;
	//Результат.Добавить("421212");
	//Результат.Добавить("421034");
	//Результат.Добавить("421227");
	//Результат.Добавить("421195");
	//Результат.Добавить("421208");
	//Результат.Добавить("391089");
	//Результат.Добавить("693157");
	//Результат.Добавить("421246");
	//Возврат Результат;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Грузы.ЕТСНГ КАК ЕТСНГ
	|ИЗ
	|	Справочник.Грузы КАК Грузы
	|ГДЕ
	|	Грузы.ПорожнийВагон = &ПрожнийВагон";
	Запрос.УстановитьПараметр("ПрожнийВагон",Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ЕТСНГ);
	КонецЦикла;
	
	Возврат Результат;
	//-- [US 58841] Denis Isadchenko,17.03.2023
	
КонецФункции

Функция СписокКодовЕТСНГ_ПорожниеВагоны() Экспорт
	
	СписокКодов = Новый СписокЗначений;
	СписокКодов.ЗагрузитьЗначения(МассивКодовЕТСНГ_ПорожниеВагоны());
	Возврат СписокКодов;
	
КонецФункции

Функция МассивКодовЕТСНГ_ПорожниеКТК() Экспорт
	
	//++ [US 58841] Denis Isadchenko,17.03.2023
	//Результат = Новый Массив;
	//Результат.Добавить("391464");
	//Результат.Добавить("391159");
	//Результат.Добавить("391479");
	//Результат.Добавить("391483");
	//Результат.Добавить("391498");
	//Результат.Добавить("693231");
	//Возврат Результат;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Грузы.ЕТСНГ КАК ЕТСНГ
	|ИЗ
	|	Справочник.Грузы КАК Грузы
	|ГДЕ
	|	Грузы.ПорожнийКТК = &ПрожнийКТК";
	Запрос.УстановитьПараметр("ПрожнийКТК",Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ЕТСНГ);
	КонецЦикла;
	
	Возврат Результат;
	//-- [US 58841] Denis Isadchenko,17.03.2023		
КонецФункции

#КонецОбласти

//ОЧЕРЕД ЗАПРОСОВ В ЭТРАН
#Область РаботаСОчередью
//важная функция, все запросы не с сервера обрабатываются через эту процедуру
Процедура ПоместитьЗапросВОчередь(ТипЗапроса,ТекстЗапроса,Документ=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.э_ОчередьЗапросовКЭтрану.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.ТипЗапроса.Установить(ТипЗапроса);
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	Запись = НаборЗаписей.Добавить();
    Запись.ДатаЗаписи = ТекущаяДата();
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.ТипЗапроса = ТипЗапроса;
	Запись.Документ = Документ;
	Запись.Запрос = ТекстЗапроса;
	Запись.Ответ = "";
	Запись.Обработан = Ложь;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОпросОчередиЗапросовКЭтрану() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	э_ОчередьЗапросовКЭтрану.Пользователь,
				   |	э_ОчередьЗапросовКЭтрану.ТипЗапроса
				   |ИЗ
				   |	РегистрСведений.э_ОчередьЗапросовКЭтрану КАК э_ОчередьЗапросовКЭтрану
				   |ГДЕ
				   |	(НЕ э_ОчередьЗапросовКЭтрану.Обработан)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	э_ОчередьЗапросовКЭтрану.ДатаЗаписи";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.э_ОчередьЗапросовКЭтрану.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
		НаборЗаписей.Отбор.ТипЗапроса.Установить(Выборка.ТипЗапроса);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Обработан Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.Пользователь = Выборка.Пользователь;
			Запись.ТипЗапроса = Выборка.ТипЗапроса;
			Запись.Ответ = ЗапросДанных(Выборка.ТипЗапроса,Запись.Запрос,Истина);
			Запись.Обработан = Истина;
			
			Если ЗначениеЗаполнено(Запись.Документ)Тогда
				Если ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.э_ЖДНакладнаяВходящая") Тогда
					
					ПозицияИД = Найти(Запись.Ответ,"invUNP value");
					ПозицияОшибки = Найти(Запись.Ответ,"errorMessage value=");   
					
					Если ПозицияИД > 0 или ПозицияОшибки > 0 Тогда
						ДокОб = Запись.Документ.ПолучитьОбъект();	
						
						Если ПозицияИД > 0  Тогда  
							ИДНакладной = Сред(Запись.Ответ,ПозицияИД+14,9);
							ДокОб.НакладнаяИД = ИДНакладной; 
							//ДокОб.СписокНекритическихОшибок ="";
							Попытка
								ДокОб.Записать();
								//При ошибке в записи документа, запрос на вагоны создаваться не будет, надо это как-то "обойти"
								//Если Выборка.ТипЗапроса = "Запрос на визу и на погрузку электронная накладная" Тогда   							
								//	э_ОбщийМодуль.ОтправитьЗапросНаПогрузку(ДокОб.Ссылка);
								//КонецЕсли;					
							Исключение
							КонецПопытки;
							//Запишем ошибку
						ИначеЕсли ПозицияОшибки > 0  Тогда 
							
							КонецОшибки  = Найти(Запись.Ответ,"errorStatusCode value=");
							
							Если КонецОшибки > 0  Тогда 
								//Попытка
								//	ДокОб.СписокНекритическихОшибок = Сред(Запись.Ответ,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
								//Исключение
								//КонецПопытки;
							КонецЕсли;
							
							Попытка
								ДокОб.Записать(); 										
							Исключение
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.э_ЗаявкаНаПеревозку") Тогда
					
					ПозицияИД = Найти(Запись.Ответ,"claimID value");
					ПозицияОшибки = Найти(Запись.Ответ,"errorMessage value=");   
					
					Если ПозицияИД > 0 или ПозицияОшибки > 0 Тогда
						ДокОб = Запись.Документ.ПолучитьОбъект();	
						
						Если ПозицияИД > 0  Тогда  
							ИДНакладной = Сред(Запись.Ответ,ПозицияИД+14,9);
							ДокОб.ИДЗаявки = ИДНакладной; 
							//ДокОб.СписокНекритическихОшибок ="";
							Попытка
								ДокОб.Записать();
								//При ошибке в записи документа, запрос на вагоны создаваться не будет, надо это как-то "обойти"
								//Если Выборка.ТипЗапроса = "Запрос на визу и на погрузку электронная накладная" Тогда   							
								//	э_ОбщийМодуль.ОтправитьЗапросНаПогрузку(ДокОб.Ссылка);
								//КонецЕсли;					
							Исключение
							КонецПопытки;
							//Запишем ошибку
						ИначеЕсли ПозицияОшибки > 0  Тогда 
							
							КонецОшибки  = Найти(Запись.Ответ,"errorStatusCode value=");
							
							Если КонецОшибки > 0  Тогда 
								//Попытка
								//	ДокОб.СписокНекритическихОшибок = Сред(Запись.Ответ,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
								//Исключение
								//КонецПопытки;
							КонецЕсли;
							
							Попытка
								ДокОб.Записать(); 										
							Исключение
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
				Иначе
					//ПолучитьЭлементСправочника(Запись.ТипЗапроса, Запись.Ответ);
				КонецЕсли;
			КонецЕсли;
			
			
			
		КонецЦикла;
			
		НаборЗаписей.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// СОЗДАНИЕ ЗАЯВКИ
#Область СозданиеЗаявки

Процедура СоздатьЗаявку(СтруктураДокумента, АдресРезультата = Неопределено) Экспорт
	
	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	СоответствиеТаблиц = ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	Перевод = ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек,1);
	ТекстЗапроса = ЗаполнитьXMLИзОбъекта(СтруктураДокумента.Ссылка,СоответствиеТаблиц,Перевод,МакетНастроек);
	ТекстЗапроса =
	//<!-- ********************************** -->
	//<!-- ПОДАЧА ЗАЯВКИ НА ПЕРЕВОЗКУ: запрос -->
	//<!-- ********************************** -->
	"<claimAgreement version=""1.0"">"
	+ ТекстЗапроса
	////<!-- Формировать заявку только до отправок включительно - не использовать данные блоков маршрутов, графиков подач и плательщиков -->
	//+ "<notFullClaim/>"
	//<!-- Использование 6-значных кодов станций и грузов в ответе -->
	+ "<useMod11/>"
	//<!-- Расчет графика подач(если не указан график подач и способ подачи не по датам) -->
	+ "<useCalcGraphPod/>"
	//<!-- Выдавать данные подписи ЭЦП -->
	+ "<useECP/>"
	//<!-- Не переводить состояние заявки в согласовано -->
	+ "<notState/>"
	//<!-- Не возвращать данные о накладных по заявке. -->
	+ "<notGetInv/>"
	//<!-- Выдавать список некритических ошибок-->
	//<!-- * тип данных: строка -->
	+ "<useWarning/>"
	+ "</claimAgreement>";
	
	ТипЗапроса = "Запрос создания заявки на перевозку грузов";
	ПоместитьЗапросВОчередь(ТипЗапроса, ТекстЗапроса, СтруктураДокумента.Ссылка);
	
	ДокументОбъект = Документы.э_ЗаявкаНаПеревозку.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_ОчередьЗапросовКЭтрану.Пользователь КАК Пользователь,
	               |	э_ОчередьЗапросовКЭтрану.ТипЗапроса КАК ТипЗапроса
	               |ИЗ
	               |	РегистрСведений.э_ОчередьЗапросовКЭтрану КАК э_ОчередьЗапросовКЭтрану
	               |ГДЕ
	               |	НЕ э_ОчередьЗапросовКЭтрану.Обработан
	               |	И э_ОчередьЗапросовКЭтрану.Документ = &Заявка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	э_ОчередьЗапросовКЭтрану.ДатаЗаписи";
	
	Запрос.УстановитьПараметр("Заявка", СтруктураДокумента.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.э_ОчередьЗапросовКЭтрану.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
		НаборЗаписей.Отбор.ТипЗапроса.Установить(Выборка.ТипЗапроса);
		НаборЗаписей.Отбор.Документ.Установить(СтруктураДокумента.Ссылка);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Обработан Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.Пользователь = Выборка.Пользователь;
			Запись.ТипЗапроса = Выборка.ТипЗапроса;
			Запись.Документ = СтруктураДокумента.Ссылка;
			Запись.Ответ = ЗапросДанных(Выборка.ТипЗапроса,Запись.Запрос,Истина);
			Запись.Обработан = Истина;

			ПозицияИД = Найти(Запись.Ответ,"claimID value");
			ПозицияОшибки = Найти(Запись.Ответ,"errorMessage value=");   
			
			Если ПозицияИД > 0 или ПозицияОшибки > 0 Тогда
				
				Если ПозицияИД > 0  Тогда  
					ИДНакладной = Сред(Запись.Ответ,ПозицияИД+14,9);
					ДокументОбъект.ИДЗаявки = ИДНакладной; 
					
					ЗаполнитьДокументЗаявкаНаПеревозкуПриВыгрузке(Запись.Ответ,Ложь,"",ТекущаяДата(),ТекущаяДата(),ТекущаяДата(), ДокументОбъект);
					
					
				ИначеЕсли ПозицияОшибки > 0  Тогда 				
					КонецОшибки  = Найти(Запись.Ответ,"errorStatusCode value=");
					
					Если КонецОшибки > 0  Тогда 
						ДокументОбъект.Ошибки = Сред(Запись.Ответ,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
					КонецЕсли; 			
					
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
	
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураДокумента, ДокументОбъект);
	
	ПоместитьВоВременноеХранилище(СтруктураДокумента, АдресРезультата); 
	
КонецПроцедуры

Процедура э_ЗагрузкаИзЭТРАН() Экспорт
	
	//Евросиб - АСуслов 26.11.2024 12:32:37 #96573
	//(
		//ПодгрузитьНовыеЗаявкиНаСервере();
	//)
	//Евросиб - АСуслов 26.11.2024 12:32:49 #96573
		ПодгрузитьНовыеНакладныеНаСервере();
		
КонецПроцедуры

Процедура э_ОпросОчередиЭТРАН() Экспорт
	
	ОпросОчередиЗапросовКЭтрану();
		
КонецПроцедуры

#КонецОбласти

Функция СравнитьТаблицыНаборовЗаписей(ТаблицаЗначений1, ТаблицаЗначений2) Экспорт

    Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
        Возврат Ложь;
    КонецЕсли; 
    
    Если ТаблицаЗначений1.Количество() <> ТаблицаЗначений2.Количество() Тогда
        Возврат Ложь;
    КонецЕсли; 

    Если ТаблицаЗначений1.Колонки.Количество() <> ТаблицаЗначений2.Колонки.Количество() Тогда
        Возврат Ложь;
    КонецЕсли;
    
   // Проверим поля
 
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если ТаблицаЗначений1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла; 
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений2.Индексы.Добавить(СтрокаИндекса);
    
   // Проверим записи
 
    Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы2 = ТаблицаЗначений2.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы2.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
   // сформируем строку индекса для оптимизации поиска по таблице значений
 
    СтрокаИндекса = "";
    Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
        Если СтрокаИндекса = "" Тогда
            СтрокаИндекса = Колонка.Имя;
        Иначе
            СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
        КонецЕсли;
    КонецЦикла;
   // добавим индекс
 
    ТаблицаЗначений1.Индексы.Добавить(СтрокаИндекса);
    
    Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
        СтруктураПоиска = Новый Структура;
        Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
            СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
        КонецЦикла;
        СтрокиТаблицы1 = ТаблицаЗначений1.НайтиСтроки(СтруктураПоиска);
        Если СтрокиТаблицы1.Количество() <> 1 Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
    Возврат Истина;
    
КонецФункции// СравнитьТаблицыЗначений()

// Процедура добавляет новую запись в логфайл
Процедура ЗаписатьЛогВФайл(ТипЗапроса, ТекстЗапроса, РезультатЗапроса)
	
	//ТДата = Формат(ТекущаяДата(),"ДФ=yyyyMMdd_hhmmss");
	//ПутьКФайлу = "C:\Лог ЭТРАН\" + ТДата + "_" + ".txt";
	//Текст = РезультатЗапроса;
	//
	//Файл = Новый ТекстовыйДокумент;
	//Файл.УстановитьТекст(Текст);
	//Файл.Записать(ПутьКФайлу);
	
КонецПроцедуры

//АКТ  
Процедура ЗаполнитьОбъектИзXMLАКТ(Объект,СоответствиеТаблицОбъекта,СоответствиеПеревод,СтрокаXML,ПутьКФайлу = Неопределено) 
	
		
	ПредИмя = "";
	ПредИмяВложения = "";
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);

	
	Стек = Новый Массив;
	Стек.Добавить("");
	Стек.Добавить(Объект);
	ПредыдущийПараметр = Неопределено;
	ПредыдущаяСтрока = Неопределено;
	
	НомерСтрокиАкта = 1;
	НомерСтрокиСчетФактуры = 1;	
	НомерНакладной = "";
	//Попытка для поиск ошибки
	Попытка
		Пока ЧтениеXML.Прочитать() Цикл
			   			   
			Имя = ЧтениеXML.Имя;
			ТаблицаАТК = СоответствиеПеревод["Т" + Имя];
			Параметр = СоответствиеТаблицОбъекта[ТаблицаАТК];
			
			
			Если Параметр <> Неопределено Тогда
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					//ТаблицаАТК = СоответствиеПеревод["Т" + Имя];
					Строка = Объект[ТаблицаАТК].Добавить();
					Стек.Добавить(ТаблицаАТК);
					Стек.Добавить(Строка);
					Если Параметр <> "" Тогда
						Если Найти(Параметр,"->") = 1 Тогда
							РеквизитАТК = СтрЗаменить(Параметр,"->","");
							
							Если ТаблицаАТК = "Накладные" Тогда
								Строка.НомерУслуги = НомерСтрокиАкта;
								Строка.НомерСчетФактуры = НомерСтрокиСчетФактуры; 
							КонецЕсли;
							
							Если ТаблицаАТК = "СчетФактуры" Тогда
								Строка.НомерУслуги = НомерСтрокиАкта;
							КонецЕсли;

							Если ТаблицаАТК = "Вагоны" или ТаблицаАТК = "Контейнеры" или ТаблицаАТК = "Грузы" или ТаблицаАТК = "Веса" Тогда
								Строка.НакладнаяНомер = НомерНакладной;
							КонецЕсли;
							
						Иначе
							Родитель = Стек[Стек.Количество()-3];
							Строка[Параметр] = Родитель[Параметр];
						КонецЕсли;					
					КонецЕсли;
				Иначе
					Стек.Удалить(Стек.Количество()-1);
					Стек.Удалить(Стек.Количество()-1);
				КонецЕсли;
			Иначе
				Попытка
					
					Если Имя = "#text" Тогда
									
						Строка      = Стек[Стек.Количество()-1];
						ТаблицаАТК  = Стек[Стек.Количество()-2];
						РеквизитАТК = СоответствиеПеревод[ТаблицаАТК + ПредИмя];
						Если ТипЗнч(Строка[РеквизитАТК]) = Тип("Дата") Тогда
							Строка[РеквизитАТК] = Дата(Сред(ЧтениеXML.Значение,7,4) + Сред(ЧтениеXML.Значение,4,2) + Лев(ЧтениеXML.Значение,2));
						Иначе
							Строка[РеквизитАТК] = ЧтениеXML.Значение;    
						КонецЕсли;

						
						Попытка
							Если ТаблицаАТК = "Услуги" Тогда
								НомерСтрокиАкта = Строка.НомерСтроки;
							КонецЕсли;
							Если ТаблицаАТК = "СчетФактуры" Тогда
								НомерСтрокиСчетФактуры = Строка.НомерСтроки;
							КонецЕсли; 
							Если ТаблицаАТК = "Накладные" Тогда
								НомерНакладной = Строка.НакладнаяНомер;
							КонецЕсли; 

						Исключение
						КонецПопытки;                                                                                 
					КонецЕсли;
					

						ПредИмя = Имя; 					
	
					
				Исключение
					//Сообщить(Имя + " : " + Атрибут);
				КонецПопытки;			
				
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ы=1;
	КонецПопытки;
	
КонецПроцедуры

//ЭЦП _________________________________________________________

Процедура ПодписатьЭЦПНакладную(IDДокумента) Экспорт

	 а=1;
КонецПроцедуры


Функция ПолучитИнформациюОДокументеЭЦП(ИдДокумента, БинарныйТекст)  Экспорт
	
	//	<!-- ******************************************** -->
	//<!-- ЗАПРОС ПОЛУЧЕНИЯ ИНФОРМАЦИИ О ДОКУМЕНТЕ ДЛЯ ПРОВЕДЕНИЯ ЭЦП: запрос -->
	//<!-- ******************************************** -->
	
	ТекстЗапроса = 	"<getTextForECP version=""1.0"">"
	+ 	"<docID value=""" + Формат(ИдДокумента,"ЧВН=; ЧГ=0") + """/>" ;
	//<!-- При использовании тега текстовое представление будет получено в base64 -->
	Если БинарныйТекст Тогда 
	ТекстЗапроса = ТекстЗапроса + "<useBinary/>";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "</getTextForECP>";  		
	
	
	//НаВремяТеста = Истина;
	//Если НаВремяТеста Тогда
	//	ПоместитьЗапросВОчередь("Запрос данных документа для ЭЦП",ТекстЗапроса);
	//	Возврат Неопределено;
	//Иначе  		
		РезультатЗапроса = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);  		
		
		МенеджерЗаписи 				   = РегистрыСведений.э_ЛогиЭТРАН.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период		   = ТекущаяДата();
		МенеджерЗаписи.ТипЗапроса 	   = "Запрос данных документа для ЭЦП";
		МенеджерЗаписи.НомерТранзакции = 1;
		МенеджерЗаписи.Запрос 		   = ТекстЗапроса;
//Евросиб Гудкова( 08.10.2019
//было 		МенеджерЗаписи.Ответ 		   = РезультатЗапроса;
		Сжатие = Новый СжатиеДанных(9);
		МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
// Евросиб Гудкова)
		
		Если Найти(РезультатЗапроса,"error") > 0 Тогда
			МенеджерЗаписи.Ошибка = Истина;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
		
		//ПутьКФайлу = ПолучитьИмяВременногоФайла();
		//ТДата = Формат(ТекущаяДата(),"ДФ=yyyyMMdd_hhmmss");
		//ПутьКФайлу =  "C:\Лог ЭТРАН\" + ТДата + "_" + ".txt";
		//
		//Файл = Новый ТекстовыйДокумент;
		//Файл.УстановитьТекст(РезультатЗапроса);
		//Файл.Записать(ПутьКФайлу);
		
		//
		
	//КонецЕсли;
	
	
	Возврат РезультатЗапроса;
	
	
КонецФункции

Функция ЗапросПроведенияЭЦПНАдДокументом(ИдДокумента,ИнформацияОДокументе,ЭЦПДокумента,ШтампВремени, БинарныйТекст)  Экспорт
	
	
	
	//	<!-- ******************************************** -->
	//<!-- ЗАПРОС ПРОВЕДЕНИЯ ЭЦП НАД ДОКУМЕНТОМ: запрос -->
	//<!-- ******************************************** -->
	ТекстЗапроса = 	"<setECP version=""1.0"">"
	//<!-- Идентификатор документа -->
	//<!-- * тип данных: целое число --> 
	+ "<docID value=""" + СтрЗаменить(Строка(ИдДокумента),Символы.НПП,"") + """/>";
	
	//<!-- Информация о документе для подписания ЭЦП -->
	//<!-- без использования UseBinary в запросе --> 
	//<!-- * тип данных: строка --> 
	//+ "<text value=""" +СтрЗаменить(ИнформацияОДокументе,"""","&quot;")  + """/>"
	
	//+ "<text value=""" +ИнформацияОДокументе + """/>"
	
	//<!-- с использованием UseBinary в запросе --> 
	//<!-- * тип данных: строка --> 
	Если БинарныйТекст Тогда
		ТекстЗапроса = ТекстЗапроса +"<textBinary value=""" + ИнформацияОДокументе +"""/>";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "<text value=""" +СтрЗаменить(ИнформацияОДокументе,"""","&quot;")  + """/>";
	КонецЕсли;
	//<!-- ЭЦП документа-->
	//<!-- * тип данных: строка --> 
	ТекстЗапроса = ТекстЗапроса+" <ecp value="""+ ЭЦПДокумента +"""/>"
	//<!-- Штамп времени документа-->
	//<!-- * тип данных: строка --> 
	+ "<tsp value=""" +ШтампВремени + """/>"
	//<!-- Версия алгоритма формирования ЭЦП(1 – версия от КриптоПро, 2 – версия от ТрансТелеком)-->
	//<!-- * тип данных: строка --> 
	+ "<version value=" + """1""" + "/>";
	//<!-- Используется для подписания документов с текстовым представлением в base64 -->
	Если БинарныйТекст Тогда
		ТекстЗапроса = ТекстЗапроса +"<useBinary/>";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "</setECP>";
	
	//НаВремяТеста = Ложь;
	//Если НаВремяТеста Тогда
	//	ПоместитьЗапросВОчередь("Запрос проведения ЭЦП",ТекстЗапроса);   		
	//	Возврат Неопределено; 		
	//Иначе  		
		РезультатЗапроса = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);  		
	//КонецЕсли;	
	
	
		МенеджерЗаписи 				   = РегистрыСведений.э_ЛогиЭТРАН.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период		   = ТекущаяДата();
		МенеджерЗаписи.ТипЗапроса 	   = "Запрос проведения ЭЦП";
		МенеджерЗаписи.НомерТранзакции = 1;
		МенеджерЗаписи.Запрос 		   = ТекстЗапроса;
//Евросиб Гудкова( 08.10.2019
//было 		МенеджерЗаписи.Ответ 		   = РезультатЗапроса;
		Сжатие = Новый СжатиеДанных(9);
		МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
// Евросиб Гудкова)
		
		Если Найти(РезультатЗапроса,"error") > 0 Тогда
			МенеджерЗаписи.Ошибка = Истина;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
	

	Возврат РезультатЗапроса;
	
	
КонецФункции

Процедура э_РегламентнаяЗагрузкаДокументовЭТРАН() Экспорт
	
	ЗагрузитьДокументыИзЭтран();
	
КонецПроцедуры


//\ЭЦП_________________________________________________________

/// СИ ДАТА - Фоновое задание отработки ГУ-12

Процедура АвтоматическаяОтработкаГУ12() Экспорт
	
	//// все истекшие по тайм-ауту ГУ-12 переводим в "автоматически отклонено"
	ТаймАутВЧасахАвтоматическогоОтклоненияГУ12 = Константы.ТаймАутВЧасахАвтоматическогоОтклоненияГУ12.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_ЗаявкаНаПеревозку.Ссылка КАК Ссылка,
	               |	э_ЗаявкаНаПеревозку.СтатусСогласования КАК СтатусСогласования
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.э_ЗаявкаНаПеревозку КАК э_ЗаявкаНаПеревозку
	               |ГДЕ
	               |	НЕ э_ЗаявкаНаПеревозку.ПометкаУдаления
	               |	И э_ЗаявкаНаПеревозку.СогласованиеДатаПолучения <= &ТекущаяДатаМинусТаймАут
	               |	И э_ЗаявкаНаПеревозку.СогласованиеДатаПолучения <> ДАТАВРЕМЯ(1, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Ссылка КАК Ссылка
	               |ИЗ
	               |	Т1 КАК Т1
	               |ГДЕ
	               |	Т1.СтатусСогласования = &ОжидаетсяРешение";
	Запрос.УстановитьПараметр("ТекущаяДатаМинусТаймАут", ТекущаяДата() - ТаймАутВЧасахАвтоматическогоОтклоненияГУ12 * 3600);
	Запрос.УстановитьПараметр("ОжидаетсяРешение", Перечисления.СтатусСогласованияГУ12.ОжидаетРешения);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		ЗаявкаОбъект = Ответ.Ссылка.ПолучитьОбъект();
		ЗаявкаОбъект.СтатусСогласования = Перечисления.СтатусСогласованияГУ12.АвтоматическиОтклонено;
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОО = ОписаниеОшибки();
		КонецПопытки
	КонецЦикла;
	
	//// все не переданные ГУ-12 во внешнюю систему передаем и отмечаем факт их передачи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_ЗаявкаНаПеревозку.Ссылка КАК Ссылка,
	               |	э_ЗаявкаНаПеревозку.СтатусСогласования КАК СтатусСогласования
	               |ИЗ
	               |	Документ.э_ЗаявкаНаПеревозку КАК э_ЗаявкаНаПеревозку
	               |ГДЕ
	               |	э_ЗаявкаНаПеревозку.СогласованиеРезультатПередан = ДАТАВРЕМЯ(1, 1, 1)
	               |	И (э_ЗаявкаНаПеревозку.СтатусСогласования = ЗНАЧЕНИЕ(Перечисление.СтатусСогласованияГУ12.АвтоматическиОтклонено)
	               |			ИЛИ э_ЗаявкаНаПеревозку.СтатусСогласования = ЗНАЧЕНИЕ(Перечисление.СтатусСогласованияГУ12.ОтклоненоВручную)
	               |			ИЛИ э_ЗаявкаНаПеревозку.СтатусСогласования = ЗНАЧЕНИЕ(Перечисление.СтатусСогласованияГУ12.ПодтвержденоВручную))
	               |	И НЕ э_ЗаявкаНаПеревозку.ПометкаУдаления";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		ЗаявкаОбъект = Ответ.Ссылка.ПолучитьОбъект();
		ЗаявкаОбъект.dc_ОшибкаЭтран = ПередатьРезультатГУ12(Ответ.Ссылка, (Ответ.СтатусСогласования = Перечисления.СтатусСогласованияГУ12.ПодтвержденоВручную));
		ЗаявкаОбъект.СогласованиеРезультатПередан = ТекущаяДата();
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОО = ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПередатьРезультатГУ12(Заявка, ПодтвержденаДАНЕТ) Экспорт
	
	Результат = Ложь;
	
	Если ПодтвержденаДАНЕТ = Истина Тогда
		
		ТекстЗапроса = "<claimAssentViza version=""1.0""><claimID value="""+Заявка.ИДЗаявки+""" /><frontEndId value="""+Заявка.ИДЗаявки+""" /></claimAssentViza>";
		
	Иначе
		
		ТекстЗапроса = "<claimRejectViza version=""1.0""><claimID value="""+Заявка.ИДЗаявки+""" /><frontEndId value="""+Заявка.ИДЗаявки+""" /></claimRejectViza>";
		
	КонецЕсли;
	
	/////////////////////////////////////////
	РезультатЗапроса = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);
	
	//Рез = ЗаполнитьДокументЗаявкаНаПеревозку(РезультатЗапроса,Истина,Заявка.ИДЗаявки,ТекущаяДата(),ТекущаяДата(),ТекущаяДата(),Неопределено);
	
	МенеджерЗаписи 				   = РегистрыСведений.э_ЛогиЭТРАН.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период		   = ТекущаяДата();
	МенеджерЗаписи.ТипЗапроса 	   = "Согласование ГУ12";
	МенеджерЗаписи.НомерТранзакции = 1;
	МенеджерЗаписи.Документы	   = Заявка;
	МенеджерЗаписи.Запрос 		   = ТекстЗапроса;
	Сжатие = Новый СжатиеДанных(9);
	МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
	
	Результат = Истина;
	Если Найти(РезультатЗапроса,"error") > 0 Тогда
		МенеджерЗаписи.Ошибка = Истина;
		Результат = Ложь;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	/////////////////////////////////////////
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТарифИзЖДН(НомерНакладной, НомерВагона, НомерКТК) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	э_Накладная.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.э_Накладная КАК э_Накладная
	               |ГДЕ
	               |	э_Накладная.НакладнаяНомер = &НакладнаяНомер
	               |	И НЕ э_Накладная.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	э_Накладная.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях КАК СуммаВРублях
	               |ИЗ
	               |	Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Т1 КАК Т1
	               |		ПО э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка = Т1.Ссылка
	               |ГДЕ
	               |	(э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона = &НомерВагона
	               |			ИЛИ э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера = &НомерКонтейнера)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
	               |ИЗ
	               |	Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Т1 КАК Т1
	               |		ПО э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка = Т1.Ссылка
	               |ГДЕ
	               |	(э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона = &НомерВагона
	               |			ИЛИ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера = &НомерКонтейнера)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
	               |ИЗ
	               |	Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Т1 КАК Т1
	               |		ПО э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка = Т1.Ссылка
	               |ГДЕ
	               |	(э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона = &НомерВагона
	               |			ИЛИ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера = &НомерКонтейнера)";
	Запрос.УстановитьПараметр("НакладнаяНомер", НомерНакладной);
	Запрос.УстановитьПараметр("НомерВагона", НомерВагона.Наименование);
	Запрос.УстановитьПараметр("НомерКонтейнера", НомерКТК.Наименование);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат = Ответ.СуммаВРублях;
		
	Иначе
		Сообщить("!!! Тариф в накладной " + НомерНакладной + " + " + НомерВагона + " + " + НомерКТК + " равен нулю. Укажите сумму плановых расходов в ТЧ Расходы вручную.");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Литвинов 05.02.21 task 28203 (

Функция ГрупповаяПечать(Знач ОтборПоСписку) Экспорт
	
	Возврат ПечатьКомплектаДокументов.ГрупповаяПечать(ОтборПоСписку);
	
КонецФункции

//Евросиб Литвинов 05.02.21 task 28203 )

//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало
Функция ПолучитьУнифицированныйНомерНакладной(Знач вхНакладнаяНомер) Экспорт
	//ЦифрыБез0 = "123456789";
	//ДлинаНомера = СтрДлина(вхНакладнаяНомер);
	//Для НомерСимвола = 1 По ДлинаНомера Цикл
	//	Символ = Сред(вхНакладнаяНомер, НомерСимвола, 1);
	//	Если СтрНайти(ЦифрыБез0, Символ) <> 0 Тогда
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//ЦифроваяЧастьНомера = Сред(вхНакладнаяНомер, НомерСимвола, ДлинаНомера); //получен номер без лидирующих нулей и символов не являющихся цифрами
	//Возврат Прав("00000000" + ЦифроваяЧастьНомера, 8); //добавлены лидирующие нули слева с обрезкой до 8 символов 
	
	//ДИТ Шевченко А.В. 55332 10.08.2022 -Начало
	//Возврат СтроковыеФункцииКлиентСервер.ДополнитьСтроку(вхНакладнаяНомер, 8, "0", "Слева")
	//ДИТ Шевченко А.В. 55332 10.08.2022 -Конец
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, начало
	Возврат СтроковыеФункцииКлиентСервер.ДополнитьСтроку(вхНакладнаяНомер, ДлинаНомераНакладной(), "0", "Слева");
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, конец
КонецФункции
//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец

//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, начало
Функция ДлинаНомераНакладной() Экспорт
	//Возврат Метаданные.Документы.э_Накладная.ДлинаНомера;
	Возврат 10;
КонецФункции
//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, конец 

// Рыбьяков К.А 03.05.2024 Ticket#0350495
Функция ЗапроситьНакладнуюВРИТМе(НакладнаяИД) Экспорт

	ИмяОперации = "GetEtranInvoiceByInvoiceID";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("invoiceID", НакладнаяИД);

	ЗапросXML = ТранспортныеДокументы_сервер.ПолучитьТекстЗапросаВебСервису(СтруктураПараметров);
	
	Ответ = ВебСервисы_сервер.ЗапроситьРИТМ(ИмяОперации, ЗапросXML);
	
	Возврат Ответ;
	
КонецФункции 
// Рыбьяков К.А 03.05.2024 Ticket#0350495
