Функция СоздатьОперациюПоПараметрам(Параметры) Экспорт
	
	Результат = Документы.Операция.СоздатьДокумент();
	Результат.Заполнить(неопределено);
	Результат.Дата = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(Результат, Параметры);
	
	Результат.Записать(РежимЗаписиДокумента.Запись);
	Попытка
		Результат.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Успешно создана операция: " + Результат.Ссылка);
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Ошибка проведения операции: " + ОО);
		ЗаписьЖурналаРегистрации("ОшибкаПроведенияОперации", УровеньЖурналаРегистрации.Ошибка, Документы.Операция, Результат.Ссылка, "Ошибка проведения операции: " + ОО);
	КонецПопытки;
	
	Возврат Результат.Ссылка;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Услуга");
	Поля.Добавить("Поставщик");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = ""+Данные.Услуга+" от "+Формат(Данные.Дата, "ДФ=dd.MM.yy")+?(ЗначениеЗаполнено(Данные.Поставщик), " пост.: "+Данные.Поставщик, "");
КонецПроцедуры
