Функция ПолучитьРегиональныйЦФОПоДороге(Дорога) Экспорт
	
	РегиональныйЦФО = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегиональныеЦФОДороги.Ссылка КАК РегиональныйЦФО
	|ИЗ
	|	Справочник.РегиональныеЦФО.Дороги КАК РегиональныеЦФОДороги
	|ГДЕ
	|	РегиональныеЦФОДороги.Дорога = &Дорога";
	Запрос.УстановитьПараметр("Дорога", Дорога);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РегиональныйЦФО = РезультатЗапроса.Выгрузить()[0].РегиональныйЦФО;
	КонецЕсли;
	Возврат РегиональныйЦФО;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("РегиональныеЦФО", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры
