
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("ПредметТСх") Тогда
		Возврат;
	КонецЕсли;
	
	ПредметТСх = Параметры.Отбор.ПредметТСх;
	
	МассивТСх = ПостроительТСх_сервер.ПолучитьТСхОбъекта(ПредметТСх);
	Для каждого Стр из МассивТСх Цикл
		СсылкаТСх = Стр.ТСх;
		Вариант = Стр.Вариант;
		Элементы.Вариант.СписокВыбора.Добавить(Стр.Вариант);
	КонецЦикла;
	
	ВалютаПоУмолчанию = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПостроитьДеревоПоЭлементу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКнопокРедактирования()
	
	Если ЗахваченоДляРедактирования Тогда
		Элементы.ВключитьРедактирование.ЦветФона = WebЦвета.Розовый;
	Иначе
		Элементы.ВключитьРедактирование.ЦветФона = Элементы.ОтменитьРедактирование.ЦветФона;
	КонецЕсли;
	Элементы.ДобавитьВариант.Доступность = НЕ ЗахваченоДляРедактирования;
	Элементы.общ_Связи.Доступность = ЗахваченоДляРедактирования;
	Элементы.Дерево.ТолькоПросмотр = НЕ ЗахваченоДляРедактирования;
	//Элементы.СоздатьОперации.Доступность = ЗахваченоДляРедактирования;
	Элементы.Дерево_ДобавитьКорень.Доступность = ЗахваченоДляРедактирования;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРедактирование(Команда)
	
	Если НЕ ЗначениеЗаполнено(СсылкаТСх) Тогда
		ЗахваченоДляРедактирования = истина;
	Иначе
		Заблокировать_сервер();
	КонецЕсли;
	
	ОбновитьОтображениеКнопокРедактирования();
	
КонецПроцедуры

&НаСервере
Процедура Заблокировать_сервер()
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(СсылкаТСх,, ЭтаФорма.УникальныйИдентификатор);	
		ЗахваченоДляРедактирования = Истина;
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Объект заблокирован: " + ОО);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура Разблокировать_сервер()
	
	Попытка
		РазблокироватьДанныеДляРедактирования(СсылкаТСх, ЭтаФорма.УникальныйИдентификатор);
		ЗахваченоДляРедактирования = Ложь;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТСх(Команда)
	
	Разблокировать_сервер();
	ЗаписатьДеревоВЭлемент();
	ОбновитьОтображениеКнопокРедактирования();
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДеревоПоЭлементу()
	
	Если НЕ ЗначениеЗаполнено(СсылкаТСх) тогда Возврат; КонецЕсли;
	
	ТЧ.Очистить();
	Для каждого Стр из СсылкаТСх.ТЧ Цикл
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		НСтр.Состояние = Стр.Операция.ТекущееСостояние;
		Для каждого Стр3 из Стр.Операция.Состояния Цикл
			Если Стр3.Состояние = НСтр.Состояние Тогда
				НСтр.Статус = Стр3.Статус;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьДеревоПоТЧ()
	
	РеестрРодителей = Новый Соответствие;
	
	РеестрСоответствияКодов = Новый Соответствие;
	СчРодитель = 1;
	Для каждого Стр из ТЧ Цикл
		Если Стр.НесколькоРодителей Тогда
			Если ЗначениеЗаполнено(Стр.Родитель1) Тогда РеестрСоответствияКодов.Вставить(Стр.Родитель1, СчРодитель); СчРодитель = СчРодитель + 1; КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Родитель2) Тогда РеестрСоответствияКодов.Вставить(Стр.Родитель2, СчРодитель); СчРодитель = СчРодитель + 1; КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Родитель3) Тогда РеестрСоответствияКодов.Вставить(Стр.Родитель3, СчРодитель); СчРодитель = СчРодитель + 1; КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Родитель4) Тогда РеестрСоответствияКодов.Вставить(Стр.Родитель4, СчРодитель); СчРодитель = СчРодитель + 1; КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Родитель5) Тогда РеестрСоответствияКодов.Вставить(Стр.Родитель5, СчРодитель); СчРодитель = СчРодитель + 1; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// дальше строим дерево
	Дерево.ПолучитьЭлементы().Очистить();
	ОперацииСозданы = Истина;
	Для каждого Стр из ТЧ Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Родитель1) ИЛИ Стр.НесколькоРодителей Тогда
			НСтр = Дерево.ПолучитьЭлементы().Добавить();
			НСтр.СвязьВх = 9;
			НСтр.СвязьИсх = 9;
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			РеестрРодителей.Вставить(НСтр.ГУИД, НСтр);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Операция) Тогда ОперацииСозданы = Ложь; КонецЕсли;
		Если РеестрСоответствияКодов.Получить(НСтр.ГУИД) <> неопределено Тогда
			НСтр.МойНомер = РеестрСоответствияКодов.Получить(НСтр.ГУИД);
			НСтр.СвязьИсх = 0;
		КонецЕсли;
		Если НСтр.НесколькоРодителей Тогда
			НСтр.НомераРодителейСписком = "";
			НСтр.СвязьВх = 1;
			Если ЗначениеЗаполнено(НСтр.Родитель1) Тогда НСтр.НомераРодителейСписком = РеестрСоответствияКодов.Получить(НСтр.Родитель1); КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.Родитель2) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель2); КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.Родитель3) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель3); КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.Родитель4) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель4); КонецЕсли;
			Если ЗначениеЗаполнено(НСтр.Родитель5) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель5); КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = 0 По ТЧ.Количество()-1 Цикл
		Если РеестрРодителей.Получить(ТЧ[Сч].ГУИД) = неопределено И РеестрРодителей.Получить(ТЧ[Сч].Родитель1) <> неопределено Тогда
			НСтр = РеестрРодителей.Получить(ТЧ[Сч].Родитель1).ПолучитьЭлементы().Добавить();
			НСтр.СвязьВх = 9;
			НСтр.СвязьИсх = 9;
			ЗаполнитьЗначенияСвойств(НСтр, ТЧ[Сч]);
			
			Если РеестрСоответствияКодов.Получить(НСтр.ГУИД) <> неопределено Тогда
				НСтр.МойНомер = РеестрСоответствияКодов.Получить(НСтр.ГУИД);
				НСтр.СвязьИсх = 0;
			КонецЕсли;
			Если НСтр.НесколькоРодителей Тогда
				НСтр.НомераРодителейСписком = "";
				НСтр.СвязьВх = 1;
				Если ЗначениеЗаполнено(НСтр.Родитель1) Тогда НСтр.НомераРодителейСписком = РеестрСоответствияКодов.Получить(НСтр.Родитель1); КонецЕсли;
				Если ЗначениеЗаполнено(НСтр.Родитель2) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель2); КонецЕсли;
				Если ЗначениеЗаполнено(НСтр.Родитель3) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель3); КонецЕсли;
				Если ЗначениеЗаполнено(НСтр.Родитель4) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель4); КонецЕсли;
				Если ЗначениеЗаполнено(НСтр.Родитель5) Тогда НСтр.НомераРодителейСписком = НСтр.НомераРодителейСписком + ?(НСтр.НомераРодителейСписком = "", "", ", ") + РеестрСоответствияКодов.Получить(НСтр.Родитель5); КонецЕсли;
			КонецЕсли;

			РеестрРодителей.Вставить(НСтр.ГУИД, НСтр);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из Дерево.ПолучитьЭлементы() Цикл
		Элементы.Дерево.Развернуть(Стр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДеревоВЭлемент()
	
	Если ЗначениеЗаполнено(СсылкаТСх) Тогда
		ТСХОбъект = СсылкаТСх.ПолучитьОбъект();
	Иначе
		ТСХОбъект = Справочники.ТехнологическаяСхема.СоздатьЭлемент();
	КонецЕсли;
	
	ТСХОбъект.ТЧ.Очистить();
	Для каждого Стр из ТЧ Цикл
		ЗаполнитьЗначенияСвойств(ТСХОбъект.ТЧ.Добавить(), Стр);
	КонецЦикла;
	ТСХОбъект.Записать();
	
	МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДата();
	МЗ.ПредметТСх = ПредметТСх;
	МЗ.ТСх = ТСХОбъект.Ссылка;
	МЗ.Вариант = Вариант;
	МЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРедактирование(Команда)
	
	Разблокировать_сервер();
	ЗахваченоДляРедактирования = Ложь;
	ПостроитьДеревоПоЭлементу();
	ПерестроитьДеревоПоТЧ();
	ОбновитьОтображениеКнопокРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ПредметТСх) тогда
		ОткрытьФорму("РегистрСведений.ТехнологическаяСхема.Форма.ФормаСпискаПростая");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ПерестроитьДеревоПоТЧ();
	
	Если НЕ ЗначениеЗаполнено(СсылкаТСх) Тогда
		ЗахваченоДляРедактирования = Истина;
	КонецЕсли;
	
	ОбновитьОтображениеКнопокРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СсылкаТСх) Тогда
		Разблокировать_сервер();
		ЗахваченоДляРедактирования = Ложь;
		ОбновитьОтображениеКнопокРедактирования();
	КонецЕсли;
	
	СсылкаТСх = неопределено;
	
	Если ЗначениеЗаполнено(Вариант) И Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Вариант) = неопределено Тогда
		Элементы.Вариант.СписокВыбора.Добавить(Вариант);
	КонецЕсли;
	
	Дерево.ПолучитьЭлементы().Очистить();
	ТЧ.Очистить();
	МассивТСх = ПостроительТСх_сервер.ПолучитьТСхОбъекта(ПредметТСх);
	Для каждого Стр из МассивТСх Цикл
		Если Стр.Вариант = Вариант Тогда
			СсылкаТСх = Стр.ТСх;
			ПостроитьДеревоПоЭлементу();
			ПерестроитьДеревоПоТЧ();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариант(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаНовогоВарианта", ЭтаФорма);
	ПоказатьВводСтроки(ОпОп, , "Введите имя нового варианта", 20, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНовогоВарианта(Параметр1 = неопределено, Параметр2 = неопределено) экспорт
	
	Если НЕ ЗначениеЗаполнено(Параметр1) Тогда Возврат;	КонецЕсли;
	
	Если Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Параметр1) <> неопределено Тогда Сообщить("Такой вариант уже есть!"); Возврат КонецЕсли;
	
	Элементы.Вариант.СписокВыбора.Добавить(Параметр1);
	Вариант = Параметр1;
	ВариантПриИзменении(неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		НСтр = ТЧ.Добавить();
		ТекД.Регламентный = Истина;
		ТекД.Картинка = 0;
		ТекД.СвязьВх = 9;
		ТекД.СвязьИсх = 9;
		ТекД.ГУИД = Строка(Новый УникальныйИдентификатор);
		ТекД.ТипДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницаИзмеренияДлительности.КалендарныйДень");
		ТекД.Валюта = ВалютаПоУмолчанию;
		Сч = 1;
		Для каждого Стр из ПослРодители Цикл
			ТекД["Родитель"+Сч] = Стр.Значение;
			Сч = Сч + 1;
			Если Сч > 5 Тогда Прервать; КонецЕсли;
		КонецЦикла;
		ТекД.НесколькоРодителей = (ПослРодители.Количество() > 1);
		
		//Если ТекД.НесколькоРодителей Тогда
		//	СпецСтрока = Дерево.ПолучитьЭлементы().Добавить();
		//	ЗаполнитьЗначенияСвойств(СпецСтрока, ТекД);
		//	ТекД.ПолучитьРодителя().ПолучитьЭлементы().Удалить(ТекД);
		//	Элементы.Дерево.ТекущаяСтрока = СпецСтрока.ПолучитьИдентификатор();
		//КонецЕсли;
		ЗаполнитьЗначенияСвойств(НСтр, ТекД);
		Если ТекД.НесколькоРодителей Тогда
			ПерестроитьДеревоПоТЧ();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	МассивПодчиненных = ПостроительТСх_клиент.ПолучитьМассивПодчиненных(ТЧ, ТекД.ГУИД, Истина, Ложь);
	
	МассивУдаляемых = Новый Массив;
	
	Для каждого Стр из ТЧ Цикл
		Если МассивПодчиненных.Найти(Стр.ГУИД) <> неопределено Тогда
			МассивУдаляемых.Добавить(Стр);
		Иначе
			ХотьЧтоТоСтерли = Ложь;
			Если МассивПодчиненных.Найти(Стр.Родитель1) <> неопределено Тогда
				ХотьЧтоТоСтерли = Истина;
				Стр.Родитель1 = "";
			КонецЕсли;
			Если Стр.Родитель2 <> "" И МассивПодчиненных.Найти(Стр.Родитель2) <> неопределено Тогда
				ХотьЧтоТоСтерли = Истина;
				Стр.Родитель2 = "";
			КонецЕсли;
			Если Стр.Родитель3 <> "" И МассивПодчиненных.Найти(Стр.Родитель3) <> неопределено Тогда
				ХотьЧтоТоСтерли = Истина;
				Стр.Родитель3 = "";
			КонецЕсли;
			Если Стр.Родитель4 <> "" И МассивПодчиненных.Найти(Стр.Родитель4) <> неопределено Тогда
				ХотьЧтоТоСтерли = Истина;
				Стр.Родитель4 = "";
			КонецЕсли;
			Если Стр.Родитель5 <> "" И МассивПодчиненных.Найти(Стр.Родитель5) <> неопределено Тогда
				ХотьЧтоТоСтерли = Истина;
				Стр.Родитель5 = "";
			КонецЕсли;
			Если ХотьЧтоТоСтерли И Стр.Родитель1 = "" И Стр.Родитель2 = "" И Стр.Родитель3 = "" И Стр.Родитель4 = "" И Стр.Родитель5 = "" Тогда
				МассивУдаляемых.Добавить(Стр);
			ИначеЕсли ХотьЧтоТоСтерли Тогда
				ПостроительТСх_клиент.НормализоватьРодителейЭлемента(Стр);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для каждого Стр из МассивУдаляемых Цикл
		ТЧ.Удалить(Стр);
	КонецЦикла;
	
	ПерестроитьДеревоПоТЧ();
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПослРодители.Очистить();
	Для каждого Стр из Элементы.Дерево.ВыделенныеСтроки Цикл
		ПослРодители.Добавить(Дерево.НайтиПоИдентификатору(Стр).ГУИД);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПриИзменении(Элемент)
	
	Если Элементы.Дерево.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из ТЧ Цикл
		Если Элементы.Дерево.ТекущиеДанные.ГУИД = Стр.ГУИД Тогда 
			ЗаполнитьЗначенияСвойств(Стр,  Элементы.Дерево.ТекущиеДанные); 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПунктНазначенияПриИзменении(Элемент)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	
	Для каждого Стр из ТекД.ПолучитьЭлементы() Цикл
		Стр.ПунктОтправления = ТекД.ПунктНазначения;
	КонецЦикла;
	Для каждого Стр из Дерево.ПолучитьЭлементы() Цикл
		Если Стр.Родитель1 = ТекД.ГУИД ИЛИ Стр.Родитель2 = ТекД.ГУИД ИЛИ Стр.Родитель3 = ТекД.ГУИД ИЛИ Стр.Родитель4 = ТекД.ГУИД ИЛИ Стр.Родитель5 = ТекД.ГУИД Тогда
			Стр.ПунктОтправления = ТекД.ПунктНазначения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоДатаНазначенияПриИзменении(Элемент)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	ТекД.Срок = 0;
	
	Для каждого Стр из ТЧ Цикл
		Если Стр.ГУИД = ТекД.ГУИД Тогда 
			ЗаполнитьЗначенияСвойств(Стр, ТекД, "ДатаОтправления,Срок,ТипДлительности,ДатаНазначения"); 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	ПостроительТСх_клиент.ПересчитатьПоТаблице(ТЧ, ТекД.ГУИД);
	ПерестроитьДеревоПоТЧ();
		
КонецПроцедуры

&НаКлиенте
Процедура общ_Открыть(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаОткрытия", ЭтаФорма);
	
	СписокВыбораОткрытие = Новый СписокЗначений;
	СписокВыбораОткрытие.Добавить("Открыть операцию", "Открыть операцию",, БиблиотекаКартинок.Найти);
	СписокВыбораОткрытие.Добавить("Открыть тариф", "Открыть тариф",, БиблиотекаКартинок.НайтиВСодержании);
	СписокВыбораОткрытие.Добавить("                                  ");
	СписокВыбораОткрытие.Добавить("Открыть карточку ТСх", "Открыть карточку ТСх");
	
	
	ПоказатьВыборИзСписка(ОпОп, СписокВыбораОткрытие, Элементы.общ_Открыть);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОткрытия(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	Если Параметр1 = неопределено ИЛИ ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр1.Значение = "Открыть операцию" И ЗначениеЗаполнено(ТекД.Операция) Тогда
		
		ПоказатьЗначение(, ТекД.Операция);
		
	ИначеЕсли Параметр1.Значение = "Открыть тариф" И ЗначениеЗаполнено(ТекД.Тариф) Тогда
		
		ПоказатьЗначение(, ТекД.Тариф);
		
	ИначеЕсли Параметр1.Значение = "Открыть карточку ТСх" Тогда
		
		ПоказатьЗначение(, СсылкаТСх);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура общ_Связи(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСвязи", ЭтаФорма);
	
	СписокВыбораОткрытие = Новый СписокЗначений;
	СписокВыбораОткрытие.Добавить("Добавить родителя", "Изменить связи",, БиблиотекаКартинок.Операция_Связать_с_Операцией);
	//СписокВыбораОткрытие.Добавить("Создать операции для ТСх", "Создать операции для ТСх",, БиблиотекаКартинок.Заказ_удалить_связь);
	СписокВыбораОткрытие.Добавить("                                  ");
	//СписокВыбораОткрытие.Добавить("Открыть карточку ТСх", "Открыть карточку ТСх");
	
	
	ПоказатьВыборИзСписка(ОпОп, СписокВыбораОткрытие, Элементы.общ_Связи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСвязи(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	Если Параметр1 = неопределено ИЛИ ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр1.Значение = "Добавить родителя" Тогда
		
		ТекД.ТекСтрока = Истина;
		МассивРодителей = Новый Массив;
		Если ЗначениеЗаполнено(ТекД.Родитель1) Тогда МассивРодителей.Добавить(ТекД.Родитель1); КонецЕсли;
		Если ЗначениеЗаполнено(ТекД.Родитель2) Тогда МассивРодителей.Добавить(ТекД.Родитель2); КонецЕсли;
		Если ЗначениеЗаполнено(ТекД.Родитель3) Тогда МассивРодителей.Добавить(ТекД.Родитель3); КонецЕсли;
		Если ЗначениеЗаполнено(ТекД.Родитель4) Тогда МассивРодителей.Добавить(ТекД.Родитель4); КонецЕсли;
		Если ЗначениеЗаполнено(ТекД.Родитель5) Тогда МассивРодителей.Добавить(ТекД.Родитель5); КонецЕсли;
		Для каждого Стр из дерево.ПолучитьЭлементы() Цикл
			УстановитьПометкиРодителей(Стр, МассивРодителей);
		КонецЦикла;
		Элементы.ДеревоРодитель.Видимость = Истина;
		Элементы.ГруппаКоманднаяПанель2.Видимость = Истина;
		
	ИначеЕсли Параметр1.Значение = "Удалить связь с родителями" Тогда
		
		ПоказатьЗначение(, ТекД.Тариф);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекС, МассивРодителей)
	
	ТекС.Родитель = (МассивРодителей.Найти(ТекС.ГУИД) <> неопределено);
	
	Для каждого Стр из ТекС.ПолучитьЭлементы() Цикл
		УстановитьПометкиРодителей(Стр, МассивРодителей);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура родитель_Отмена(Команда)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	
	ТекГУИД = "";
	ПомеченныеРодители = Новый Массив;
	Для каждого Стр из дерево.ПолучитьЭлементы() Цикл
		СнятьТекущегоИСобратьРодителей(Стр, ТекГУИД, ПомеченныеРодители);
	КонецЦикла;

	Элементы.ДеревоРодитель.Видимость = Ложь;
	Элементы.ГруппаКоманднаяПанель2.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура родитель_Сохранить(Команда)
	
	ТекГУИД = "";
	ПомеченныеРодители = Новый Массив;
	Для каждого Стр из дерево.ПолучитьЭлементы() Цикл
		СнятьТекущегоИСобратьРодителей(Стр, ТекГУИД, ПомеченныеРодители);
	КонецЦикла;
	
	Для каждого Стр из ТЧ Цикл
		Если Стр.ГУИД = ТекГУИД Тогда
			Для Сч = 1 По 5 Цикл
				Стр["Родитель"+Сч] = "";
				Если ПомеченныеРодители.Количество() >= Сч Тогда Стр["Родитель"+Сч] = ПомеченныеРодители[Сч-1]; КонецЕсли;
			КонецЦикла;	
			Стр.НесколькоРодителей = ЗначениеЗаполнено(Стр.Родитель2);
		КонецЕсли;
	КонецЦикла;
	Элементы.ДеревоРодитель.Видимость = Ложь;
	Элементы.ГруппаКоманднаяПанель2.Видимость = Ложь;
	ПерестроитьДеревоПоТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьТекущегоИСобратьРодителей(Стр, ТекГУИД, ПомеченныеРодители)
	
	Если Стр.ТекСтрока Тогда ТекГУИД = Стр.ГУИД; КонецЕсли;
	Стр.ТекСтрока = Ложь;
	Если Стр.Родитель Тогда ПомеченныеРодители.Добавить(Стр.ГУИД); КонецЕсли;
	Для каждого Стр2 из Стр.ПолучитьЭлементы() Цикл
		СнятьТекущегоИСобратьРодителей(Стр2, ТекГУИД, ПомеченныеРодители);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОперации(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Операция) Тогда 
			СтруктураПараметров = Новый Структура;
			МассивРеквизитов = "Услуга,Регламентный,ПунктОтправления,ПунктНазначения,ДатаОтправления,ДатаНазначения,ТипДлительности,Срок,Поставщик,Договор,Тариф,Себестоимость,Валюта,СтавкаНДС,ВключаетНДС,ДатаОтправленияФакт,ДатаНазначенияФакт";
			Для каждого Стр7 из СтрРазделить(МассивРеквизитов, ",", Ложь) Цикл
				СтруктураПараметров.Вставить(Стр7, Стр[Стр7]);
			КонецЦикла;
			Стр.Операция = ПостроительТСх_сервер.СоздатьОперацию(СтруктураПараметров);
			ОперацииСозданы = Истина;
		КонецЕсли;
	КонецЦикла;
	ПерестроитьДеревоПоТЧ();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьОперацию(Параметры)
	
	Возврат Документы.Операция.СоздатьОперациюПоПараметрам(Параметры);
	
КонецФункции


&НаКлиенте
Процедура УдалитьВариант(Команда)
	
	Если НЕ ЗначениеЗаполнено(СсылкаТСх) Тогда
		Сообщить("Не выбрана удаляемая схема!");
		Возврат;
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработчикВопросаУдаления", ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Вы действительно хотите удалить вариант ТСх?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаУдаления(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если ЗахваченоДляРедактирования Тогда
		Разблокировать_сервер();
	КонецЕсли;
	
	ПостроительТСх_сервер.Удалить_ТСх(СсылкаТСх);
	Элементы.Вариант.СписокВыбора.Удалить(Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Вариант));	
	Вариант = "Основной";
	Если Элементы.Вариант.СписокВыбора.Количество() > 0 Тогда
		Вариант = Элементы.Вариант.СписокВыбора[0].Значение;
	КонецЕсли;
	ВариантПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Дерево_ДобавитьКорень(Команда)
	
	ПослРодители.Очистить();
	ТекД = Дерево.ПолучитьЭлементы().Добавить();
	ТекД.Регламентный = Истина;
	ТекД.Картинка = 0;
	ТекД.СвязьВх = 9;
	ТекД.СвязьИсх = 9;
	ТекД.ГУИД = Строка(Новый УникальныйИдентификатор);
	ТекД.ТипДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницаИзмеренияДлительности.КалендарныйДень");
	ТекД.Валюта = ВалютаПоУмолчанию;
	НСтр = ТЧ.Добавить();
	ЗаполнитьЗначенияСвойств(НСтр, ТекД);
	Элементы.Дерево.ТекущаяСтрока = ТекД.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСрокПриИзменении(Элемент)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	ТекД.ДатаНазначения = неопределено;
	
	Для каждого Стр из ТЧ Цикл
		Если Стр.ГУИД = ТекД.ГУИД Тогда 
			ЗаполнитьЗначенияСвойств(Стр, ТекД, "ДатаОтправления,Срок,ТипДлительности,ДатаНазначения"); 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	ПостроительТСх_клиент.ПересчитатьПоТаблице(ТЧ, ТекД.ГУИД);
	ПерестроитьДеревоПоТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДатаОтправленияПриИзменении(Элемент)
	
	ТекД = Элементы.Дерево.ТекущиеДанные;
	
	Для каждого Стр из ТЧ Цикл
		Если Стр.ГУИД = ТекД.ГУИД Тогда 
			ЗаполнитьЗначенияСвойств(Стр, ТекД, "ДатаОтправления,Срок,ТипДлительности,ДатаНазначения"); 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	ПостроительТСх_клиент.ПересчитатьПоТаблице(ТЧ, ТекД.ГУИД);
	ПерестроитьДеревоПоТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмениласьОперация" Тогда
		ОпНайдена = Ложь;
		Для каждого стр из ТЧ Цикл
			Если стр.Операция = Параметр Тогда ОпНайдена = Истина; Прервать; КонецЕсли;
		КонецЦикла;
		Если ОпНайдена Тогда
			Дерево.ПолучитьЭлементы().Очистить();
			ТЧ.Очистить();
			ПостроитьДеревоПоЭлементу();
			ПерестроитьДеревоПоТЧ();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТСх(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораКалькуляцииДляКопирования", ЭтаФорма);
	ОткрытьФорму("Документ.Калькуляция.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКалькуляцииДляКопирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	ПривязатьТСхКТекущемуОбъекту(Параметр1, ПредметТСх);
	
КонецПроцедуры

&НаСервере
Процедура ПривязатьТСхКТекущемуОбъекту(Параметр1, ПредметТСх)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	               |	ТехнологическаяСхема.Вариант КАК Вариант,
	               |	ТехнологическаяСхема.ТСх КАК ТСх
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх";
	Запрос.УстановитьПараметр("ПредметТСх", Параметр1);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		КопияТСх = ПостроительТСх_сервер.СкопироватьТСх(Ответ.ТСх);
		
		МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
		МЗ.Вариант = Ответ.Вариант+"_"+Прав(КопияТСх.Код, 7);
		МЗ.ПредметТСх = ПредметТСх;
		МЗ.ТСх = КопияТСх;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
	Элементы.Вариант.СписокВыбора.Очистить();
	МассивТСх = ПостроительТСх_сервер.ПолучитьТСхОбъекта(ПредметТСх);
	Для каждого Стр из МассивТСх Цикл
		СсылкаТСх = Стр.ТСх;
		Вариант = Стр.Вариант;
		Элементы.Вариант.СписокВыбора.Добавить(Стр.Вариант);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТСхИзПродукта(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораПродуктаДляКопирования", ЭтаФорма);
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
	//ОткрытьФорму("Справочник.Продукты.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Справочник.СервисыУчетноеНаправление.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПродуктаДляКопирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	ПривязатьТСхКТекущемуОбъекту(Параметр1, ПредметТСх);
	
КонецПроцедуры