
Процедура СоздатьЛокациюПриЗаписиСтраныПриЗаписи(Источник, Отказ) Экспорт
	
	Если НЕ Источник.ПометкаУдаления Тогда
		
		Если Источник.Ссылка = Справочники.СтраныМира.Россия и НЕ ЗначениеЗаполнено(Справочники.Локации.РОССИЯ.Страна) Тогда
			РО = Справочники.Локации.РОССИЯ.ПолучитьОбъект();
			РО.Тип = Справочники.ТипыЛокаций.Страна;
			РО.Страна = Справочники.СтраныМира.Россия;
			РО.Записать();
		Иначе
			РО = ПолучитьЛокациюПоСтране(Источник.Ссылка);
			Если РО = неопределено Тогда
				РО = Справочники.Локации.СоздатьЭлемент();
				РО.Родитель = Справочники.Локации.ВСЕ;
				РО.Наименование = Источник.Наименование;
				РО.Тип = Справочники.ТипыЛокаций.Страна;
				РО.Страна = Источник.Ссылка;
				РО.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЛокациюПоСтране(Страна) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	НЕ Локации.ПометкаУдаления
	               |	И Локации.Страна = &Страна
	               |	И Локации.Тип = &Тип";
	Запрос.УстановитьПараметр("Страна", Страна);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Страна);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЖелезнуюДорогуПоКоду(КодЖД, Наименование = неопределено) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖелезныеДороги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖелезныеДороги КАК ЖелезныеДороги
	               |ГДЕ
	               |	ЖелезныеДороги.Код = &Код
	               |	И НЕ ЖелезныеДороги.ПометкаУдаления";
	Запрос.УстановитьПараметр("Код", КодЖД);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат = Ответ.Ссылка;
		
	Иначе
		
		РезультатЪ = Справочники.ЖелезныеДороги.СоздатьЭлемент();
		РезультатЪ.Код = КодЖД;
		Если Наименование <> неопределено Тогда
			РезультатЪ.Наименование = Наименование;
		Иначе
			РезультатЪ.Наименование = КодЖД;
		КонецЕсли;
		РезультатЪ.Записать();
		Результат = РезультатЪ.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
Функция НайтиСтанциюПоНеполномуКоду(Код) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	НЕ Локации.ПометкаУдаления
	               |	И ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = &КодЖДСтанции";
//	               |	И Локации.Тип = &Тип";
	//Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.СтанцияЖД);
	ЧастьКода = Лев(СокрЛП(Код), 5);
	Запрос.УстановитьПараметр("КодЖДСтанции", ЧастьКода);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСтанциюЭТРАНПоНеполномуКоду(Код) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.э_Станции КАК Локации
	               |ГДЕ
	               |	НЕ Локации.ПометкаУдаления
	               |	И ПОДСТРОКА(Локации.Код, 1, 5) = &КодЖДСтанции";
//	               |	И Локации.Тип = &Тип";
	//Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.СтанцияЖД);
	ЧастьКода = Лев(СокрЛП(Код), 5);	
	Запрос.УстановитьПараметр("КодЖДСтанции", ЧастьКода);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьАналогСтанции(Станция1, Станция2) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АналогиЛокаций.Локация КАК Локация,
	               |	АналогиЛокаций.Аналог КАК Аналог
	               |ИЗ
	               |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |ГДЕ
	               |	(АналогиЛокаций.Локация = &Л1
	               |				И АналогиЛокаций.Аналог = &Л2
	               |			ИЛИ АналогиЛокаций.Локация = &Л2
	               |				И АналогиЛокаций.Аналог = &Л1)";
	Запрос.УстановитьПараметр("Л1", Станция1);
	Запрос.УстановитьПараметр("Л2", Станция2);
	Если Запрос.Выполнить().Пустой() Тогда 
		
		МЗ = РегистрыСведений.АналогиЛокаций.СоздатьМенеджерЗаписи();
		МЗ.Аналог = Станция2;
		МЗ.Локация = Станция1;
		МЗ.Период = ТекущаяДата();
		МЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьGPSСтанции(Станция, LON, LAT) Экспорт
	
	СОбъект = Станция.ПолучитьОбъект();
	СОбъект.Широта = LAT;
	СОбъект.Долгота = LON;
	СОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьЛокациюПоНечеткомуПоиску(СтрокаПоиска, ПолноеСовпадение = Ложь, ТолькоСток = Ложь) Экспорт
	
	Если СтрокаПоиска = "" Тогда Возврат неопределено; КонецЕсли;
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛокацииТаблицаСинонимов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |ГДЕ
	               |	(ЛокацииТаблицаСинонимов.СинонимЛокации ПОДОБНО &СинонимЛокации
	               |			ИЛИ ЛокацииТаблицаСинонимов.Ссылка.Наименование ПОДОБНО &СинонимЛокации)
	               |	И НЕ ЛокацииТаблицаСинонимов.Ссылка.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &ТолькоСток
	               |				ТОГДА ЛокацииТаблицаСинонимов.Ссылка.Тип = &Сток
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СинонимЛокации", ?(ПолноеСовпадение, Строкапоиска, "%"+Строкапоиска+"%"));
	Запрос.УстановитьПараметр("ТолькоСток", ТолькоСток);
	Запрос.УстановитьПараметр("Сток", Справочники.ТипыЛокаций.Сток);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКодСтанции(Станция, ДлинаКода = 6) Экспорт
	
	Возврат Лев(Станция.КодЖДСтанции, ДлинаКода);
	
КонецФункции

Функция ПолучитьМассивРодителей(Локация, ВключаяТекущий) Экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Локация) Тогда Возврат Результат; КонецЕсли;
	
	ТекРодитель = Локация.Родитель;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		Результат.Добавить(ТекРодитель);
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	Если ВключаяТекущий = Истина Тогда Результат.Добавить(Локация); КОнецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивПодчиненных(Локация, ВключаяТекущий) Экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Локация) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.ПометкаУдаления = ЛОЖЬ
	               |	И Локации.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И Локации.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Локация);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат.Добавить(Ответ.Ссылка);
		
	КонецЦикла;
	
	Если ВключаяТекущий = Истина Тогда Результат.Добавить(Локация); КОнецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАналогиИСтанцииБлижеЧемУказано(Локация, Радиус) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АналогиЛокаций.Локация КАК Локация,
	               |	АналогиЛокаций.Аналог КАК Аналог
	               |ИЗ
	               |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |ГДЕ
	               |	(АналогиЛокаций.Локация = &Локация
	               |			ИЛИ АналогиЛокаций.Аналог = &Локация)";
	Запрос.УстановитьПараметр("Локация", Локация);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если результат.Найти(Ответ.Локация) = неопределено Тогда Результат.Добавить(Ответ.Локация); КонецЕсли;
		Если результат.Найти(Ответ.Аналог) = неопределено Тогда Результат.Добавить(Ответ.Аналог); КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасстоянияМеждуЛокациями.Локация1 КАК Локация1,
	               |	РасстоянияМеждуЛокациями.Локация2 КАК Локация2
	               |ИЗ
	               |	РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
	               |ГДЕ
	               |	РасстоянияМеждуЛокациями.РасстояниеКМ <= &РасстояниеКМ
	               |	И (РасстоянияМеждуЛокациями.Локация1 = &Локация
	               |			ИЛИ РасстоянияМеждуЛокациями.Локация2 = &Локация)";
	Запрос.УстановитьПараметр("РасстояниеКМ", Радиус);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если результат.Найти(Ответ.Локация1) = неопределено Тогда Результат.Добавить(Ответ.Локация1); КонецЕсли;
		Если результат.Найти(Ответ.Локация2) = неопределено Тогда Результат.Добавить(Ответ.Локация2); КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКодыАналоговСтанцииПоКоду(КодЛокации) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(КодЛокации);
	Если СтрДлина(КодЛокации) = 6 Тогда Результат.Добавить(Лев(КодЛокации, 5)); КонецЕсли;
	
	ИскЛокация = НайтиСтанциюПоНеполномуКоду(КодЛокации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АналогиЛокаций.Локация.КодЖДСтанции КАК Локация,
	               |	АналогиЛокаций.Аналог.КодЖДСтанции КАК Аналог
	               |ИЗ
	               |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |ГДЕ
	               |	(АналогиЛокаций.Локация = &Локация
	               |			ИЛИ АналогиЛокаций.Аналог = &Локация)";
	Запрос.УстановитьПараметр("Локация", ИскЛокация);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если результат.Найти(Ответ.Локация) = неопределено Тогда 
			Результат.Добавить(Ответ.Локация); 
			Если СтрДлина(Ответ.Локация) = 6 Тогда Результат.Добавить(Лев(Ответ.Локация, 5)); КонецЕсли;
		КонецЕсли;
		Если результат.Найти(Ответ.Аналог) = неопределено Тогда 
			Результат.Добавить(Ответ.Аналог); 
			Если СтрДлина(Ответ.Аналог) = 6 Тогда Результат.Добавить(Лев(Ответ.Аналог, 5)); КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
Функция ПолучитьКодыАналоговСтанций(МассивСтанций) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АналогиЛокаций.Локация.КодЖДСтанции КАК Локация,
	               |	АналогиЛокаций.Аналог.КодЖДСтанции КАК Аналог
	               |ИЗ
	               |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |ГДЕ
	               |	(АналогиЛокаций.Локация В (&Локации)
	               |			ИЛИ АналогиЛокаций.Аналог В (&Локации))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Локации.КодЖДСтанции КАК Локация
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Ссылка В(&Локации)";
	Запрос.УстановитьПараметр("Локации", МассивСтанций);
	РезультатПакет = Запрос.ВыполнитьПакет();
	//Аналоги локаций
	Ответ = РезультатПакет[0].Выбрать();
	Пока Ответ.Следующий() Цикл
		Если результат.Найти(Ответ.Локация) = неопределено Тогда 
			Результат.Добавить(Ответ.Локация); 
			Если СтрДлина(Ответ.Локация) = 6 Тогда Результат.Добавить(Лев(Ответ.Локация, 5)); КонецЕсли;
		КонецЕсли;
		Если результат.Найти(Ответ.Аналог) = неопределено Тогда 
			Результат.Добавить(Ответ.Аналог); 
			Если СтрДлина(Ответ.Аналог) = 6 Тогда Результат.Добавить(Лев(Ответ.Аналог, 5)); КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Добавим станции из параметра, на случай отсутствия записей в РС АналогиЛокаций
	Ответ = РезультатПакет[1].Выбрать();
	Пока Ответ.Следующий() Цикл
		Если результат.Найти(Ответ.Локация) = неопределено Тогда 
			Результат.Добавить(Ответ.Локация); 
			Если СтрДлина(Ответ.Локация) = 6 Тогда Результат.Добавить(Лев(Ответ.Локация, 5)); КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец

Функция ПолучитьРасстояниеМеждуСтанциями(Локация1,Локация2) Экспорт
	
	Расстояние = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасстоянияМеждуЛокациями.Локация1 КАК Локация1,
	               |	РасстоянияМеждуЛокациями.Локация2 КАК Локация2,
	               |	РасстоянияМеждуЛокациями.РасстояниеКМ КАК РасстояниеКМ
	               |ИЗ
	               |	РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
	               |ГДЕ
	               |	РасстоянияМеждуЛокациями.Локация1 = &Локация1
	               |	И РасстоянияМеждуЛокациями.Локация2 = &Локация2";
	Запрос.УстановитьПараметр("Локация1",Локация1);
	Запрос.УстановитьПараметр("Локация2",Локация2);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		Расстояние = Ответ.РасстояниеКМ;
	КонецЕсли;
	
	Возврат Расстояние;
	
КонецФункции

Функция ПолучитьСовпадениеСтанций(Локация1,Локация2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛокацииТаблицаСинонимов.СинонимЛокации КАК СинонимЛокации
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |ГДЕ
	               |	(ЛокацииТаблицаСинонимов.СинонимЛокации = &Локация1
	               |			ИЛИ ЛокацииТаблицаСинонимов.Ссылка.Наименование = &Локация1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛокацииТаблицаСинонимов.СинонимЛокации КАК СинонимЛокации
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ
	               |		ПО ЛокацииТаблицаСинонимов.СинонимЛокации = ВТ.СинонимЛокации
	               |ГДЕ
	               |	(ЛокацииТаблицаСинонимов.СинонимЛокации = &Локация2
	               |			ИЛИ ЛокацииТаблицаСинонимов.Ссылка.Наименование = &Локация2)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.СинонимЛокации КАК СинонимЛокации
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО ВТ1.СинонимЛокации = ВТ2.СинонимЛокации";
	Запрос.УстановитьПараметр("Локация1",Локация1.Наименование);
	Запрос.УстановитьПараметр("Локация2",Локация2.Наименование);
	РЗ = Запрос.Выполнить();
	Если РЗ.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ВычислитьСтокПодхода(ПунктНазначения) Экспорт
	
	Результат = неопределено;
	
	Если НЕ ЗначениеЗаполнено(ПунктНазначения) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	НЕ Локации.ПометкаУдаления
	               |	И Локации.Родитель = &Родитель
	               |	И Локации.Тип = &ТипСток
	               |	И Локации.СтокРегионаПоУмолчанию";
	Запрос.УстановитьПараметр("Родитель", ПунктНазначения);
	Запрос.УстановитьПараметр("ТипСток", Справочники.ТипыЛокаций.Сток);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб - АСуслов 05.05.2023 13:41:43 #67522 62583
//(
Процедура ЗагрузкаЖелезныхДорогЛокаций() Экспорт
	э_ОбщиеСервер.ЗагрузитьВсеСправочникиНаСервере(Истина);
КонецПроцедуры
//)
//Евросиб - АСуслов 05.05.2023 13:41:50 #67522

// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
&НаСервере
Функция ЛокацииПоЛокацииВышестоящегоУровняИТипу(ЛокацияВышестоящегоУровня, Типы) Экспорт
	
	Локации = Новый Массив;
	
	Если Тип("СправочникСсылка.Мультилокации") = ТипЗнч(ЛокацияВышестоящегоУровня) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МультилокацииЛокации.Локация КАК Локация
			|ИЗ
			|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
			|ГДЕ
			|	МультилокацииЛокации.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЛокацияВышестоящегоУровня);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Локации.Добавить(Выборка.Локация);
		КонецЦикла;
	Иначе
		Локации.Добавить(ЛокацияВышестоящегоУровня);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИерархияЛокаций.Локация КАК Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
	|ИЗ
	|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|ГДЕ
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня В (&ЛокацииВышестоящегоУровня)
	|	И ИерархияЛокаций.Локация.Тип В (&Типы)";

	Запрос.УстановитьПараметр("ЛокацииВышестоящегоУровня", Локации);
	Запрос.УстановитьПараметр("Типы", Типы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции
// Евросиб Рыбьяков К.А. 22.10.2024 ))  

//Евросиб Коханенко Н.А. 01.08.2025 (( #115525
Функция ПолучитьЛокациюВУПоЛокацииИТипу(Локация, Тип) Экспорт
	
	Ответ = Справочники.Локации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
		|ИЗ
		|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
		|ГДЕ
		|	ИерархияЛокаций.Локация = &Локация
		|	И ИерархияЛокаций.ТипИерархии = &ТипИерархии";
	
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("ТипИерархии", Тип);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЛокацияВышестоящегоУровня;
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции //Евросиб Коханенко Н.А. 01.08.2025 )) #115525 

Функция ПолучитьЛокациюВышестоящегоУровняИТипу(Локация, Тип) Экспорт
	
	Ответ = Справочники.Локации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
		|ИЗ
		|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
		|ГДЕ
		|	ИерархияЛокаций.Локация = &Локация
		|	И ИерархияЛокаций.ТипИерархии = &ТипИерархии";
	
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("ТипИерархии", Тип);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЛокацияВышестоящегоУровня;
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции	
// Евросиб Рыбьяков К.А. 22.10.2024 )) 
