
//4.2.1.	Инфообмен «Перечень контейнеров и платформ»
Функция GetDislocationCont(XMLRequest)
	
	Возврат ЕСОбменСибурСервер.ПолучитьДислокациюКонтейнеров(XMLRequest);
	
КонецФункции

Функция УдалитьGetDislocationCont(XMLRequest)
	
	ФорматДаты = "ДФ=yyyy-MM-ddTHH:mm:ss+03:00";
	//ТаблицаСтатусов = ПолучитьТаблицуДислокационныхСтатусов();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
		
	Если ОбъектXDTO.Свойства().Получить("CREATED_ON_START") <> Неопределено Или ОбъектXDTO.Свойства().Получить("CREATED_ON_END") <> Неопределено Тогда
		ДатаНачала = XMLЗначение(Тип("Дата"), ОбъектXDTO.CREATED_ON_START);
		ДатаНачала = МестноеВремя(ДатаНачала);
		ДатаОкончания = XMLЗначение(Тип("Дата"), ОбъектXDTO.CREATED_ON_END);
		ДатаОкончания = МестноеВремя(ДатаОкончания);
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("CONTAINER_ID") <> Неопределено Тогда
		ИдентификаторКонтейнера = ОбъектXDTO.CONTAINER_ID;
		Выборка = ПолучитьДислокационныеДанныеПоИдентификаторуКонтейнераЗаПериод(ДатаНачала, ДатаОкончания, ИдентификаторКонтейнера);
	Иначе
		Выборка = ПолучитьДислокационныеДанныеЗаПериод(ДатаНачала, ДатаОкончания);
	КонецЕсли;	
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("n0:mt_displacement_data_ans");
	
	ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "urn:sibur:po:a:TM:Railway");
	
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("ROW");
	
		ДобавитьЭлементВФайл(Запись, "WAYBILL_INV_NUM", Выборка.НомерНакладной);
		ДобавитьЭлементВФайл(Запись, "PARENT_KEY_WBINVNUM", ""); //Номер досылочной накладной, если имеется
		ДобавитьЭлементВФайл(Запись, "INDEX_RW", Выборка.ИндексПоезда); //Индекс поезда
		
		НомерПоезда = "";
		Если ЗначениеЗаполнено(Выборка.ИндексПоезда) Тогда
			НомерПоезда = Сред(Выборка.ИндексПоезда, 7, 3);
		КонецЕсли;
		ДобавитьЭлементВФайл(Запись, "NUMBER_RW", НомерПоезда);			//Номер поезда
		ДобавитьЭлементВФайл(Запись, "CONTAINER_ID", Выборка.КонтейнерНаименование);		
		ДобавитьЭлементВФайл(Запись, "CONTAINER_MOT", Выборка.РазмерКТК + "FT");		
		//ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_VAL", Выборка.МассыВКгТары); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_UOM", "КГ"); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "CAPACITY_MAX", ""); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "CAPACITY_MAX_UOM", ""); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "WEIGHT", ""); //Удалено из формата  //Максимально допустимый вес продукции. При выгрузке из Ритма пусто
		//ДобавитьЭлементВФайл(Запись, "WEIGHT_UOM", ""); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "NET_WEI_VAL", Выборка.МассыВКгНетто); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "NET_WEI_UOM", "КГ"); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "VOLUME", ""); 
		//ДобавитьЭлементВФайл(Запись, "VOLUME_UOM", ""); 
		ДобавитьЭлементВФайл(Запись, "PLATE_ID", Выборка.НомерВагона);
		ДобавитьЭлементВФайл(Запись, "PLATE_MOT", Выборка.ВидЖДПлатформы);
		//ДобавитьЭлементВФайл(Запись, "PLATE_WEI_VAL", Выборка.МассаТарыВагона); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "PLATE_WEI_UOM", "КГ"); //Удалено из формата
		
		Если Выборка.СобственникМорскаяЛиния = Неопределено Тогда
			ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", "");
			ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", "");
		ИначеЕсли Выборка.СобственникМорскаяЛиния = Истина Тогда
			
		КонецЕсли;
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", );
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", );
		//ДобавитьЭлементВФайл(Запись, "CARRIER_ID", ); //Удалено из формата
		//ДобавитьЭлементВФайл(Запись, "CARRIER_DESCR", ); //Удалено из формата
		ДобавитьЭлементВФайл(Запись, "SHIPPER_ID", Выборка.ГрузоотправительИД);
		ДобавитьЭлементВФайл(Запись, "SHIPPER_DESCR", Выборка.ГрузоотправительНаименование);
		ДобавитьЭлементВФайл(Запись, "CONSIGNEE_ID", Выборка.ГрузополучательИД);
		ДобавитьЭлементВФайл(Запись, "CONSIGNEE_DESCR", Выборка.ГрузополучательНаименование);
		ДобавитьЭлементВФайл(Запись, "SOURCE_LOC", Выборка.СтанцияОтправленияКод);
		ДобавитьЭлементВФайл(Запись, "SOURCE_LOC_DESC", Выборка.НаименованиеСтанцииОтправления);
		ДобавитьЭлементВФайл(Запись, "DEST_LOC", Выборка.СтанцияНазначенияКодЖДСтанции);
		ДобавитьЭлементВФайл(Запись, "DEST_LOC_DESC", Выборка.СтанцияНазначенияНаименование);
		ДобавитьЭлементВФайл(Запись, "CURRENT_LOC", Выборка.СтанцияОперацииКодЖДСтанции);
		ДобавитьЭлементВФайл(Запись, "CURRENT_LOC_DESC", Выборка.СтанцияОперацииНаименование);
		//ДобавитьЭлементВФайл(Запись, "RFQ_ETA", Формат(Выборка.ДатаИВремяПрибытияГруза, ФорматДаты)); //Удалено из формата // новая
		ДобавитьЭлементВФайл(Запись, "RFQ_ID", "1100000020/100"); //новая Идентификатор заявки SAP TM - новая
		ДобавитьЭлементВФайл(Запись, "REF_RFQ", "8955624896");  //CHAR 20	Внешний номер заявки  
		//ДобавитьЭлементВФайл(Запись, "NEXT_LOCT", Выборка.СтанцияНазначенияКодЖДСтанции); //Удалено из формата//Станция назначения. Информация по исполнению перевозки в рамках конкретной заявки

		ДобавитьЭлементВФайл(Запись, "ETD", Формат(Выборка.ДатаИВремяОтправленияГруза, ФорматДаты));
		ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИВремяРаскредитованияГруза, ФорматДаты));			
		
		//Вместо справочника Сибур, используются наши статусы
		//Статус = ПолучитьДислокационныйСтатус(ТаблицаСтатусов, Выборка.ОперацияСВагономКод);		
		//ДобавитьЭлементВФайл(Запись, "STATUS", Статус.STATUS);
		//ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Статус.STATUS_DESC);
		ДобавитьЭлементВФайл(Запись, "STATUS", Выборка.ОперацияСВагономКод);
		ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Выборка.ОперацияСВагономНаименование);
		
		ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(Выборка.Период, ФорматДаты)); //Фактическая дата наступления события - Новая
		
		ДобавитьЭлементВФайл(Запись, "SPEC", "");
		ДобавитьЭлементВФайл(Запись, "SPEC_DESCR", "");
		ДобавитьЭлементВФайл(Запись, "COMMENT", "");
		ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(Выборка.Период, ФорматДаты));
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01");
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Успешно");
		
		Запись.ЗаписатьКонецЭлемента(); //ROW
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //n0:mt_displacement_data_ans
			
	Возврат Запись.Закрыть();
	
КонецФункции

//4.2.1.	Инфообмен «Перечень контейнеров и платформ»

Функция УдалитьGetDislocationContByPeriod(XMLRequest)
	
	ФорматДаты = "ДФ='дд.ММ.гггг чч:мм:сс'";
	ТаблицаСтатусов = ПолучитьТаблицуДислокационныхСтатусов();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбъектXDTO.Свойства().Получить("CREATED_ON_START") = Неопределено Или ОбъектXDTO.Свойства().Получить("CREATED_ON_END") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДатаНачала = Дата(ОбъектXDTO.CREATED_ON_START);
	ДатаОкончания = Дата(ОбъектXDTO.CREATED_ON_END);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Заказчик", Справочники.э_ПаспортаОрганизаций.НайтиПоНаименованию("ООО ""НХТК"""));	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	Документ.э_Накладная КАК э_Накладная
	|ГДЕ
	|	э_Накладная.ДатаИВремяОтправленияГруза <= &ДатаОкончания
	|	И э_Накладная.ДатаИВремяПрибытияГруза >= &ДатаНачала
	|	И (э_Накладная.Грузоотправитель = &Заказчик
	|			ИЛИ э_Накладная.Грузополучатель = &Заказчик)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер
	|ПОМЕСТИТЬ ВТКонтейнерыНакладной
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|		ПО ВТНакладные.Накладная = э_НакладнаяКонтейнеры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКонтейнерыНакладной.Накладная КАК Накладная,
	|	ВТКонтейнерыНакладной.Контейнер КАК Контейнер,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование
	|ПОМЕСТИТЬ ВТДислокация
	|ИЗ
	|	ВТКонтейнерыНакладной КАК ВТКонтейнерыНакладной
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТКонтейнерыНакладной.Контейнер = ДислокацияКонтейнеров.Контейнер
	|			И ВТКонтейнерыНакладной.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТКонтейнерыНакладной.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТКонтейнерыНакладной.Контейнер КАК Контейнер,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.КонтейнерНаименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначенияКодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперацииКодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперацииНаименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагономКод КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагономНаименование КАК ОперацияСВагономНаименование,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ВТНакладные.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТКонтейнерыНакладной.МассыВКгТары КАК МассыВКгТары,
	|	ВТКонтейнерыНакладной.МассыВКгНетто КАК МассыВКгНетто,
	|	ДислокацияКонтейнеров.НомерВагона КАК НомерВагона,
	|	ДислокацияКонтейнеров.ДлинаВагона КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.ДлинаВагона <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.ДлинаВагона <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтейнерыНакладной КАК ВТКонтейнерыНакладной
	|		ПО ВТНакладные.Накладная = ВТКонтейнерыНакладной.Накладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДислокация КАК ДислокацияКонтейнеров
	|		ПО (ВТКонтейнерыНакладной.Контейнер = ДислокацияКонтейнеров.Контейнер)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИВремяОтправленияГруза,
	|	Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("n0:mt_displacement_data_ans");
	
	ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "http://На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:prx", "На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:n1", "На этапе реализации");		
	
	ДобавитьЭлементВФайл(Запись, "BasicMessageHeader", "");
	
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("ROW");
	
		ДобавитьЭлементВФайл(Запись, "WAYBILL_INV_NUM", Выборка.НомерНакладной);
		//ДобавитьЭлементВФайл(Запись, "PARENT_KEY_WBINVNUM", );
		ДобавитьЭлементВФайл(Запись, "NATUR_LIST_NUM", Выборка.ИндексПоезда);			
		ДобавитьЭлементВФайл(Запись, "CONTAINER_ID", Выборка.КонтейнерНаименование);
		ДобавитьЭлементВФайл(Запись, "CONTAINER_MOT", Выборка.ТипКонтейнера);
		ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_VAL", Выборка.МассыВКгТары);
		ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_UOM", "КГ");
		ДобавитьЭлементВФайл(Запись, "WEIGHT", "");  //Максимально допустимый вес продукции. При выгрузке из Ритма пусто
		ДобавитьЭлементВФайл(Запись, "WEIGHT_UOM", "");
		ДобавитьЭлементВФайл(Запись, "NET_WEI_VAL", Выборка.МассыВКгНетто);
		ДобавитьЭлементВФайл(Запись, "NET_WEI_UOM", "КГ");
		//ДобавитьЭлементВФайл(Запись, "VOLUME", ""); 
		//ДобавитьЭлементВФайл(Запись, "VOLUME_UOM", ""); 
		ДобавитьЭлементВФайл(Запись, "PLATE_ID", Выборка.НомерВагона);
		ДобавитьЭлементВФайл(Запись, "PLATE_MOT", Выборка.ВидЖДПлатформы);
		//ДобавитьЭлементВФайл(Запись, "PLATE_WEI_VAL", Выборка.МассаТарыВагона);
		ДобавитьЭлементВФайл(Запись, "PLATE_WEI_UOM", "КГ");
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", "");
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", "");
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", );
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", );
		ДобавитьЭлементВФайл(Запись, "CARRIER_ID", );
		ДобавитьЭлементВФайл(Запись, "CARRIER_DESCR", );
		ДобавитьЭлементВФайл(Запись, "SHIPPER_ID", Выборка.ГрузоотправительИД);
		ДобавитьЭлементВФайл(Запись, "SHIPPER_DESCR", Выборка.ГрузоотправительНаименование);
		ДобавитьЭлементВФайл(Запись, "CONSIGNEE_ID", Выборка.ГрузополучательИД);
		ДобавитьЭлементВФайл(Запись, "CONSIGNEE_DESCR", Выборка.ГрузополучательНаименование);
		ДобавитьЭлементВФайл(Запись, "SOURCE_LOC", Выборка.СтанцияОтправленияКод);
		ДобавитьЭлементВФайл(Запись, "SOURCE_LOC_DESC", Выборка.НаименованиеСтанцииОтправления);
		ДобавитьЭлементВФайл(Запись, "DEST_LOC", Выборка.СтанцияНазначенияКодЖДСтанции);
		ДобавитьЭлементВФайл(Запись, "DEST_LOC_DESC", Выборка.СтанцияНазначенияНаименование);
		ДобавитьЭлементВФайл(Запись, "CURRENT_LOC", Выборка.СтанцияОперацииКодЖДСтанции);
		ДобавитьЭлементВФайл(Запись, "CURRENT_LOC_DESC", Выборка.СтанцияОперацииНаименование);
		ДобавитьЭлементВФайл(Запись, "RFQ_ETA", Формат(Выборка.ДатаИВремяПрибытияГруза, ФорматДаты)); // новая
		ДобавитьЭлементВФайл(Запись, "RFQ_ID", ); //новая Идентификатор заявки SAP TM - новая
		ДобавитьЭлементВФайл(Запись, "TEND_KEY", ); //Номер позиции заявки RFQ SAP TM - Новая
		ДобавитьЭлементВФайл(Запись, "NEXT_LOCT", ); //Порт отправления (при доставке через море)/Конечная станция (при сухопутных перевозках) - Новая
		ДобавитьЭлементВФайл(Запись, "ETD", Формат(Выборка.ДатаИВремяОтправленияГруза, ФорматДаты));
		ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИВремяРаскредитованияГруза, ФорматДаты));			
		ДобавитьЭлементВФайл(Запись, "OPER", Прав(Выборка.ОперацияСВагономКод, 2));
		
		Статус = ПолучитьДислокационныйСтатус(ТаблицаСтатусов, Выборка.ОперацияСВагономКод);		
		ДобавитьЭлементВФайл(Запись, "STATUS", Статус.STATUS);
		ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Статус.STATUS_DESC);
		ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(Выборка.Период, ФорматДаты)); //Фактическая дата наступления события - Новая
		
		ДобавитьЭлементВФайл(Запись, "SPEC", "");
		ДобавитьЭлементВФайл(Запись, "SPEC_DESCR", "");
		ДобавитьЭлементВФайл(Запись, "COMMENT", "");
		ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(Выборка.Период, ФорматДаты));
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01");
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Успешно");
		
		Запись.ЗаписатьКонецЭлемента(); //ROW
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //n0:mt_displacement_data_ans
			
	Возврат Запись.Закрыть();
	
КонецФункции

//4.2.2.	Инфообмен «Дислокационные данные» (релевантно для порожнего и груженного плеча по ж/д, а также морского плеча)

&НаСервере
Функция УдалитьGetDislocationContData(XMLRequest)
	
	ФорматДаты = "ДФ='дд.ММ.гггг чч:мм:сс'";
	ТаблицаСтатусов = ПолучитьТаблицуДислокационныхСтатусов();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбъектXDTO.Свойства().Получить("CONTAINER_ID") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторКонтейнера = ОбъектXDTO.CONTAINER_ID;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторКонтейнера", ИдентификаторКонтейнера);
	Запрос.УстановитьПараметр("Заказчик", Справочники.э_ПаспортаОрганизаций.НайтиПоНаименованию("ООО ""НХТК"""));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер
	|ПОМЕСТИТЬ ВТНакладныеПоЗаказчику
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|ГДЕ
	|	(э_НакладнаяКонтейнеры.Ссылка.Грузоотправитель = &Заказчик
	|			ИЛИ э_НакладнаяКонтейнеры.Ссылка.Грузополучатель = &Заказчик)
	|	И э_НакладнаяКонтейнеры.НомерКонтейнера = &ИдентификаторКонтейнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	ПоследняяНакладная.НомерКонтейнера КАК НомерКонтейнера,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ПоследняяНакладная.Контейнер КАК Контейнер,
	|	ПоследняяНакладная.МассыВКгТары КАК МассыВКгТары,
	|	ПоследняяНакладная.МассыВКгНетто КАК МассыВКгНетто
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТНакладные.Ссылка КАК Ссылка,
	|		ВТНакладные.Контейнер КАК Контейнер,
	|		ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|		ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|		ВТНакладные.МассыВКгНетто КАК МассыВКгНетто
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(ВТНакладные.ДатаИВремяОтправленияГруза) КАК ДатаИВремяОтправленияГруза
	|		ИЗ
	|			ВТНакладныеПоЗаказчику КАК ВТНакладные) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладныеПоЗаказчику КАК ВТНакладные
	|			ПО ВложенныйЗапрос.ДатаИВремяОтправленияГруза = ВТНакладные.ДатаИВремяОтправленияГруза) КАК ПоследняяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО ПоследняяНакладная.Ссылка = э_Накладная.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ВТНакладные.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|	ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТНакладные.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|			И ВТНакладные.Контейнер = ДислокацияКонтейнеров.Контейнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("n0:mt_displacement_data_ans");
	
	ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "http://На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:prx", "На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:n1", "На этапе реализации");		
	
	ДобавитьЭлементВФайл(Запись, "BasicMessageHeader", "");
		
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("ROW");
		
			ДобавитьЭлементВФайл(Запись, "WAYBILL_INV_NUM", Выборка.НомерНакладной);
			//ДобавитьЭлементВФайл(Запись, "PARENT_KEY_WBINVNUM", ); //Номер досылочной накладной, если имеется
			ДобавитьЭлементВФайл(Запись, "NATUR_LIST_NUM", Выборка.ИндексПоезда);
			ДобавитьЭлементВФайл(Запись, "SEALINE", "");
			ДобавитьЭлементВФайл(Запись, "SEALINE_ID", "");
			ДобавитьЭлементВФайл(Запись, "CONTAINER_ID", Выборка.КонтейнерНаименование);
			ДобавитьЭлементВФайл(Запись, "CONTAINER_MOT", Выборка.ТипКонтейнера);
			ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_VAL", Выборка.МассыВКгТары);
			ДобавитьЭлементВФайл(Запись, "CONTAINER_WEI_UOM", "КГ");
			ДобавитьЭлементВФайл(Запись, "WEIGHT", "");
			ДобавитьЭлементВФайл(Запись, "WEIGHT_UOM", "");
			ДобавитьЭлементВФайл(Запись, "NET_WEI_VAL", Выборка.МассыВКгНетто);
			ДобавитьЭлементВФайл(Запись, "NET_WEI_UOM", "КГ");
			ДобавитьЭлементВФайл(Запись, "PLATE_ID", Выборка.НомерВагона);
			ДобавитьЭлементВФайл(Запись, "PLATE_MOT", Выборка.ВидЖДПлатформы);
			ДобавитьЭлементВФайл(Запись, "PLATE_WEI_VAL", Выборка.МассаТарыВагона);
			ДобавитьЭлементВФайл(Запись, "PLATE_WEI_UOM", "КГ");
			ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", "");
			ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", "");
			ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", );
			ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", );
			ДобавитьЭлементВФайл(Запись, "CARRIER_ID", );
			ДобавитьЭлементВФайл(Запись, "CARRIER_DESCR", );
			ДобавитьЭлементВФайл(Запись, "SHIPPER_ID", Выборка.ГрузоотправительИД);
			ДобавитьЭлементВФайл(Запись, "SHIPPER_DESCR", Выборка.ГрузоотправительНаименование);
			ДобавитьЭлементВФайл(Запись, "CONSIGNEE_ID", Выборка.ГрузополучательИД);
			ДобавитьЭлементВФайл(Запись, "CONSIGNEE_DESCR", Выборка.ГрузополучательНаименование);
			ДобавитьЭлементВФайл(Запись, "SOURCE_LOC", Выборка.СтанцияОтправленияКод);
			ДобавитьЭлементВФайл(Запись, "SOURCE_LOC_DESC", Выборка.НаименованиеСтанцииОтправления);
			ДобавитьЭлементВФайл(Запись, "DEST_LOC", Выборка.СтанцияНазначенияКодЖДСтанции);
			ДобавитьЭлементВФайл(Запись, "DEST_LOC_DESC", Выборка.СтанцияНазначенияНаименование);
			//ДобавитьЭлементВФайл(Запись, "DEST_COUNTRY", );
			ДобавитьЭлементВФайл(Запись, "CURRENT_LOC", Выборка.СтанцияОперацииКодЖДСтанции);
			ДобавитьЭлементВФайл(Запись, "CURRENT_LOC_DESC", Выборка.СтанцияОперацииНаименование);
			ДобавитьЭлементВФайл(Запись, "RFQ_ETA", Формат(Выборка.ДатаИВремяПрибытияГруза, ФорматДаты)); // новая
			ДобавитьЭлементВФайл(Запись, "RFQ_ID", ); //новая Идентификатор заявки SAP TM - новая
			ДобавитьЭлементВФайл(Запись, "TEND_KEY", ); //Номер позиции заявки RFQ SAP TM - Новая
			ДобавитьЭлементВФайл(Запись, "NEXT_LOCT", ); //Порт отправления (при доставке через море)/Конечная станция (при сухопутных перевозках) - Новая
			ДобавитьЭлементВФайл(Запись, "ETD", Формат(Выборка.ДатаИВремяОтправленияГруза, ФорматДаты));
			ДобавитьЭлементВФайл(Запись, "ETA", Формат(Выборка.ДатаИВремяРаскредитованияГруза, ФорматДаты));
			ДобавитьЭлементВФайл(Запись, "OPER", Прав(Выборка.ОперацияСВагономКод, 2));
			
			Статус = ПолучитьДислокационныйСтатус(ТаблицаСтатусов, Выборка.ОперацияСВагономКод);			
			ДобавитьЭлементВФайл(Запись, "STATUS", Статус.STATUS);
			ДобавитьЭлементВФайл(Запись, "STATUS_DESC", Статус.STATUS_DESC);
			ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(Выборка.Период, ФорматДаты));
			
			//ДобавитьЭлементВФайл(Запись, "VOYAGE", );
			//ДобавитьЭлементВФайл(Запись, "VESSEL", );
			ДобавитьЭлементВФайл(Запись, "SPEC", "");
			ДобавитьЭлементВФайл(Запись, "SPEC_DESCR", "");
			ДобавитьЭлементВФайл(Запись, "COMMENT", "");
			ДобавитьЭлементВФайл(Запись, "CREATED_ON", Формат(Выборка.Период, ФорматДаты));
			ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01");
			ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Успешно");
		
		Запись.ЗаписатьКонецЭлемента(); //ROW
		
	КонецЦикла;	
	
	Запись.ЗаписатьКонецЭлемента(); //n0:mt_displacement_data_ans
				
	Возврат Запись.Закрыть();
	
КонецФункции

//4.1.1. Инфообмен «Размещение заявок экспедиторам» CreateClaims

Функция УдалитьCreateClaims(XMLRequest)
	
	ФорматДаты = "ДФ='дд.ММ.гггг чч:мм:сс'";
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Чтение.Закрыть();
	
	Заявки = Новый Массив;
	ИдентификаторыЗаявок = Новый Массив;
	КодыСтанций = Новый Массив;
	
	Если ОбъектXDTO.ROW = Тип("СписокXDTO") Тогда
		Для Каждого Элемент Из ОбъектXDTO.ROW Цикл
			Заявка = ПолучитьСвойстваЗаявки(Элемент);
			Заявки.Добавить(Заявка);
			ИдентификаторыЗаявок.Добавить(Заявка.KEY);
			КодыСтанций.Добавить(Заявка.SOURCE_LOC);
		КонецЦикла;
	Иначе
		Заявка = ПолучитьСвойстваЗаявки(ОбъектXDTO.ROW);
		Заявки.Добавить(Заявка);
		ИдентификаторыЗаявок.Добавить(Заявка.KEY);
		КодыСтанций.Добавить(Заявка.SOURCE_LOC);
	КонецЕсли;
	
	//Поиск среди размещенных заявок
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РазмещенныеЗаявкиСибур.ext_KEY КАК ext_KEY,
	|	РазмещенныеЗаявкиСибур.Заявка КАК ДокументЗаявка
	|ИЗ
	|	РегистрСведений.РазмещенныеЗаявкиСибур КАК РазмещенныеЗаявкиСибур
	|ГДЕ
	|	РазмещенныеЗаявкиСибур.ext_KEY В(&ИдентификаторыЗаявок)";
	Запрос.УстановитьПараметр("ИдентификаторыЗаявок", ИдентификаторыЗаявок);
	Выборка = Запрос.Выполнить().Выбрать();
	НайденныеЗаявки = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		НайденныеЗаявки.Вставить(Выборка.ext_KEY, Выборка.ДокументЗаявка);
	КонецЦикла;
	
	//Получение станций по кодам
	СтанцииПоКодам = Новый Соответствие;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Локации.КодЖДСтанции КАК Код,
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.КодЖДСтанции В(&КодыСтанций)";
	Запрос.УстановитьПараметр("КодыСтанций", КодыСтанций);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтанцииПоКодам.Вставить(Выборка.Код, Выборка.Ссылка);
	КонецЦикла;
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("n0:mt_displacement_data_ans");
	
	ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "http://На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:prx", "На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:n1", "На этапе реализации");		
	
	ДобавитьЭлементВФайл(Запись, "BasicMessageHeader", "");
	
	Для Каждого Заявка Из Заявки Цикл
		
		Запись.ЗаписатьНачалоЭлемента("ROW");
		
		НайденнаяЗаявка = НайденныеЗаявки.Получить(Заявка.KEY);
		Если НайденнаяЗаявка = Неопределено Тогда
			ДокументЗаявка = Документы.Заявка.СоздатьДокумент();
			ДокументЗаявка.Дата = Заявка.CREATED_ON;
			ДокументЗаявка.Создано = Заявка.CREATED_ON;			
		Иначе
			ДокументЗаявка = НайденнаяЗаявка.ПолучитьОбъект();
		КонецЕсли;
				
		ДокументЗаявка.Отправка = Заявка.START_DATETIME;
		ДокументЗаявка.Прибытие = Заявка.END_DATETIME;
		
		СтанцияОтправления = СтанцииПоКодам.Получить(Заявка.SOURCE_LOC);
		СтанцияНазначения = СтанцииПоКодам.Получить(Заявка.DEST_LOC);
		ФинальнаяСтанцияНазначения = СтанцииПоКодам.Получить(Заявка.FIN_LOC);
		СтанцияВозвратаПорожнегоКонтейнера = СтанцииПоКодам.Получить(Заявка.RET_LOC);
		
		ВесПродукции = Число(Заявка.WEIGHT);
		Объем = Число(Заявка.VOLUME);
		КоличествоКонтейнеров = Число(Заявка.QUANT);
				
		Если Заявка.CONTAINER_MOT = "20FT" Тогда
			РазмерКТК = Справочники.РазмерыКТК.К20;
		ИначеЕсли Заявка.CONTAINER_MOT = "40FT" Тогда
			РазмерКТК = Справочники.РазмерыКТК.К40;
		ИначеЕсли Заявка.CONTAINER_MOT = "45FT" Тогда
			РазмерКТК = Справочники.РазмерыКТК.К45;
		Иначе
			РазмерКТК = Неопределено;
		КонецЕсли;
		
		ДокументЗаявка.СоставУслуги.Очистить();
		Для ПорядковыйНомер = 1 По КоличествоКонтейнеров Цикл
			НоваяСтрока = ДокументЗаявка.СоставУслуги.Добавить();
			НоваяСтрока.РазмерКТК = РазмерКТК;
		КонецЦикла;
		
		НачатьТранзакцию();
		
		ДокументЗаявка.Записать();
		
		Если НайденнаяЗаявка = Неопределено Тогда
			РазмещеннаяЗаявка = РегистрыСведений.СибурРазмещенныеЗаявки.СоздатьМенеджерЗаписи();
			РазмещеннаяЗаявка.RFQ_ID = Заявка.KEY;
			РазмещеннаяЗаявка.Заявка = ДокументЗаявка.Ссылка;
			РазмещеннаяЗаявка.ext_PARENT_KEY = Заявка.PARENT_KEY;
			РазмещеннаяЗаявка.ext_ROOT_KEY = Заявка.ROOT_KEY;
			РазмещеннаяЗаявка.ext_TEND_KEY = Заявка.TEND_KEY;
			РазмещеннаяЗаявка.ext_TEND_SEQ_NR = Заявка.TEND_SEQ_NR;
			РазмещеннаяЗаявка.ext_TSP_ID = Заявка.TSP_ID;
			РазмещеннаяЗаявка.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		ДобавитьЭлементВФайл(Запись, "KEY", Заявка.KEY);
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01");
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "успешно");
		ДобавитьЭлементВФайл(Запись, "STATUS_DATE", Формат(ТекущаяДатаСеанса(), ФорматДаты));
		
		Запись.ЗаписатьКонецЭлемента(); //ROW
		
	КонецЦикла;	
		
	Запись.ЗаписатьКонецЭлемента(); //n0:mt_displacement_data_ans
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция CreateClaims(XMLRequest)
	
	Возврат ЕСОбменСибурСервер.СоздатьЗаявку(XMLRequest);
	
КонецФункции

Функция CreateClaimsXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбъектXDTO.Свойства().Получить("ROW") <> Неопределено Тогда
		ОбъектXDTO = ОбъектXDTO.ROW;
	КонецЕсли;
	
	ДанныеДляОтвета = ЕСОбменСибурСервер.СоздатьЗаявку(ОбъектXDTO);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, ДанныеДляОтвета,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

Функция GetConfirmClaim(Request)
	
	Возврат ЕСОбменСибурСервер.ПодтвердитьЗаявку(Request);
	
КонецФункции

Функция GetConfirmClaimXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбъектXDTO.Свойства().Получить("ROW") <> Неопределено Тогда
		ОбъектXDTO = ОбъектXDTO.ROW;
	КонецЕсли;
	
	ДанныеДляОтвета = ЕСОбменСибурСервер.ПодтвердитьЗаявку(ОбъектXDTO);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, ДанныеДляОтвета,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

//4.1.2. Инфообмен «Предложение по заявкам»

Функция УдалитьGetOfferClaims(XMLRequest)
	
	ФорматДаты = "ДФ='дд.ММ.гггг чч:мм:сс'";
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Чтение.Закрыть();
	
	ext_KEY = ОбъектXDTO.KEY;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ext_KEY", ext_KEY);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РазмещенныеЗаявкиСибур.Заявка КАК Заявка,
	|	РазмещенныеЗаявкиСибур.ext_KEY КАК ext_KEY,
	|	РазмещенныеЗаявкиСибур.ext_PARENT_KEY КАК ext_PARENT_KEY,
	|	РазмещенныеЗаявкиСибур.ext_ROOT_KEY КАК ext_ROOT_KEY,
	|	РазмещенныеЗаявкиСибур.ext_RFQ_ID КАК ext_RFQ_ID,
	|	РазмещенныеЗаявкиСибур.ext_TEND_SEQ_NR КАК ext_TEND_SEQ_NR,
	|	РазмещенныеЗаявкиСибур.ext_TEND_KEY КАК ext_TEND_KEY,
	|	РазмещенныеЗаявкиСибур.ext_TSP_ID КАК ext_TSP_ID,
	|	ЗаявкаСостояния.Статус КАК Статус,
	|	ЗаявкаСостояния.ПричинаОтказа КАК ПричинаОтказа,
	|	ЗаявкаСостояния.ПричинаОтказа.Наименование КАК ПричинаОтказаНаименование,
	|	РазмещенныеЗаявкиСибур.Заявка.КоличествоКТК20 КАК КоличествоКТК20,
	|	РазмещенныеЗаявкиСибур.Заявка.КоличествоКТК40 КАК КоличествоКТК40
	|ПОМЕСТИТЬ ВТЗаявка
	|ИЗ
	|	РегистрСведений.РазмещенныеЗаявкиСибур КАК РазмещенныеЗаявкиСибур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.Состояния КАК ЗаявкаСостояния
	|		ПО РазмещенныеЗаявкиСибур.Заявка = ЗаявкаСостояния.Ссылка
	|			И РазмещенныеЗаявкиСибур.Заявка.ТекущееСостояние = ЗаявкаСостояния.Состояние
	|ГДЕ
	|	РазмещенныеЗаявкиСибур.ext_KEY = &ext_KEY
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров20,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров40,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К45)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтейнеров45
	|ПОМЕСТИТЬ ВТКоличествоКонтейнеров
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТЗаявка.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И (ЗаявкаСоставУслуги.ПодтвержденоЗаказчику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаявка.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявка.Заявка КАК Заявка,
	|	ВТЗаявка.ext_KEY КАК ext_KEY,
	|	ВТЗаявка.ext_PARENT_KEY КАК ext_PARENT_KEY,
	|	ВТЗаявка.ext_ROOT_KEY КАК ext_ROOT_KEY,
	|	ВТЗаявка.ext_RFQ_ID КАК ext_RFQ_ID,
	|	ВТЗаявка.ext_TEND_SEQ_NR КАК ext_TEND_SEQ_NR,
	|	ВТЗаявка.ext_TEND_KEY КАК ext_TEND_KEY,
	|	ВТЗаявка.ext_TSP_ID КАК ext_TSP_ID,
	|	ВТЗаявка.Статус КАК Статус,
	|	ВТЗаявка.ПричинаОтказа КАК ПричинаОтказа,
	|	ВТЗаявка.ПричинаОтказаНаименование КАК ПричинаОтказаНаименование,
	|	ВТЗаявка.КоличествоКТК20 КАК КоличествоКТК20,
	|	ВТЗаявка.КоличествоКТК40 КАК КоличествоКТК40,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров20 КАК КоличествоКонтейнеров20,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров40 КАК КоличествоКонтейнеров40,
	|	ВТКоличествоКонтейнеров.КоличествоКонтейнеров45 КАК КоличествоКонтейнеров45
	|ИЗ
	|	ВТЗаявка КАК ВТЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоКонтейнеров КАК ВТКоличествоКонтейнеров
	|		ПО ВТЗаявка.Заявка = ВТКоличествоКонтейнеров.Заявка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаОтвета = ТекущаяДатаСеанса();
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("n0:mt_displacement_data_ans");
	
	ДобавитьАтрибутВФайл(Запись, "xmlns:n0", "http://На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:prx", "На этапе реализации");
	ДобавитьАтрибутВФайл(Запись, "xmlns:n1", "На этапе реализации");		
	
	ДобавитьЭлементВФайл(Запись, "BasicMessageHeader", "");
	
	Запись.ЗаписатьНачалоЭлемента("ROW");
	
	Если Выборка.Следующий() Тогда				
		
		Если Выборка.Статус = Перечисления.СтатусыЭтапов.Отклонен Тогда
			КоличествоКонтейнеров = 0;
			СтатусОтвета = "02";
			СтатусОтветаНаименование = "Не успешно";
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			//КоличествоКонтейнеров = Выборка.КоличествоКТК20 + Выборка.КоличествоКТК40 * 2;
			КоличествоКонтейнеров = Выборка.КоличествоКонтейнеров20 + Выборка.КоличествоКонтейнеров40 * 2 + Выборка.КоличествоКонтейнеров45 * 2;
			СтатусОтвета = "01";
			СтатусОтветаНаименование = "Успешно";
		Иначе
			КоличествоКонтейнеров = 0;
			СтатусОтвета = "01";
			СтатусОтветаНаименование = "Успешно";
		КонецЕсли;
		
		
		ДобавитьЭлементВФайл(Запись, "KEY", Выборка.ext_KEY); //CHAR 32(X(16))	Техническое поле номера заявки
		ДобавитьЭлементВФайл(Запись, "PARENT_KEY", Выборка.ext_PARENT_KEY); //CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
		ДобавитьЭлементВФайл(Запись, "ROOT_KEY", Выборка.ext_ROOT_KEY); //CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
		ДобавитьЭлементВФайл(Запись, "RFQ_ID", Выборка.ext_RFQ_ID); //CHAR 10	Идентификатор заявки SAP TM
		ДобавитьЭлементВФайл(Запись, "TEND_SEQ_NR", Выборка.ext_TEND_SEQ_NR); //CHAR 3	Порядковый номер заявки к конкретному ЛП (в случае переторжки = 2, 3, n…)
		ДобавитьЭлементВФайл(Запись, "TEND_KEY", Выборка.ext_TEND_KEY); //NUMC 10	Номер позиции заявки SAP TM
		ДобавитьЭлементВФайл(Запись, "RESP_STATUS", СтатусОтвета); //CHAR 2	Статус ответа. Справочник RESP_STATUS 
		ДобавитьЭлементВФайл(Запись, "RESP_STATUS_DESCR", "Успешно"); //CHAR 20	Наименование статуса ответа
		ДобавитьЭлементВФайл(Запись, "RESP_DATE", Формат(ДатаОтвета, ФорматДаты)); //Поле содержит дату ответа по тендерному запросу в формате DD.MM.YYYY HH:MM:SS
		ДобавитьЭлементВФайл(Запись, "TSP_ID", Выборка.ext_TSP_ID); //CHAR 10	Код ЛП
		ДобавитьЭлементВФайл(Запись, "REASON_M", Выборка.ПричинаОтказаНаименование); //CHAR 50	Причина отказа. Вручную заполняемый комментарий
		ДобавитьЭлементВФайл(Запись, "REASON_V", ""); //CHAR 50	Причина отказа. Комментарий из предопределённого справочника.
		ДобавитьЭлементВФайл(Запись, "CARRIER_GU_ID", ""); //CHAR 20	Экспедитор-исполнитель. Необходимо для формирования ГУ 12
		ДобавитьЭлементВФайл(Запись, "CARRIER_GU_DESCR", ""); //CHAR 60	Наименование экспедитора-исполнителя
		ДобавитьЭлементВФайл(Запись, "BORDER_LOC", ""); //CHAR 20	Выходящий погран/переход
		ДобавитьЭлементВФайл(Запись, "BORDER_LOC_DESCR", ""); //CHAR 60	Описание погран/перехода
		ДобавитьЭлементВФайл(Запись, "RAILROAD_CARRIER_ID", ""); //CHAR 20	Перевозчик по дороге. Пример: РЖД
		ДобавитьЭлементВФайл(Запись, "RAILROAD_CARRIER_DESCR", ""); //CHAR 60	Описание перевозчика по дороге
		ДобавитьЭлементВФайл(Запись, "PAYER_ID", ""); //CHAR 20	Плательщик по Ж/Д
		ДобавитьЭлементВФайл(Запись, "PAYER_DESCR", ""); //CHAR 60	Описание плательщика по Ж/Д
				
		ДобавитьЭлементВФайл(Запись, "QUANT", КоличествоКонтейнеров); //QUAN 31	Количество контейнеров
		ДобавитьЭлементВФайл(Запись, "QUANT_UOM", "ШТ"); //UNIT 3	ЕИ Количество. Справочник QUANT_UOM 
		
		ДобавитьЭлементВФайл(Запись, "LOWEST_PRICE_PROP", ""); //P(15) DECIMALS 6	Предложенная ставка (в случае возможности изменения ставки)
		ДобавитьЭлементВФайл(Запись, "LOWEST_PRICE_PROP_CURR", ""); //CHAR 5	Поле содержит курс валюты заявки (в случае закрытой ставки может быть пустым)
									 									//Возможные курсы валют необходимо брать из справочника CURRENCY
		ДобавитьЭлементВФайл(Запись, "COMMENT", ""); //CHAR 255	Комментарий
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "01"); //CHAR 2	Статус обработки запроса к сервису Возможные значения лежат в справочнике STATUS_PROC.
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Успешно"); //CHAR 60	Наименование статуса обработки запроса к сервису
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", ""); //CHAR 20	Собственник контейнера. Возможные значения описаны в справочнике Контрагенты
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", ""); //CHAR 60	Наименование собственника контейнера
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", ""); //CHAR 20	Собственник ж/д – платформы. Возможные значения описаны в справочнике Контрагенты
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", ""); //CHAR 60	Наименование собственника ж/д - платформы
			
	Иначе
		
		ДобавитьЭлементВФайл(Запись, "KEY", ""); //CHAR 32(X(16))	Техническое поле номера заявки
		ДобавитьЭлементВФайл(Запись, "PARENT_KEY", ""); //CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
		ДобавитьЭлементВФайл(Запись, "ROOT_KEY", ""); //CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
		ДобавитьЭлементВФайл(Запись, "RFQ_ID", ""); //CHAR 10	Идентификатор заявки SAP TM
		ДобавитьЭлементВФайл(Запись, "TEND_SEQ_NR", ""); //CHAR 3	Порядковый номер заявки к конкретному ЛП (в случае переторжки = 2, 3, n…)
		ДобавитьЭлементВФайл(Запись, "TEND_KEY", ""); //NUMC 10	Номер позиции заявки SAP TM
		ДобавитьЭлементВФайл(Запись, "RESP_STATUS", ""); //CHAR 2	Статус ответа. Справочник RESP_STATUS 
		ДобавитьЭлементВФайл(Запись, "RESP_STATUS_DESCR", ""); //CHAR 20	Наименование статуса ответа
		ДобавитьЭлементВФайл(Запись, "RESP_DATE", ""); //Поле содержит дату ответа по тендерному запросу в формате DD.MM.YYYY HH:MM:SS
		ДобавитьЭлементВФайл(Запись, "TSP_ID", ""); //CHAR 10	Код ЛП
		ДобавитьЭлементВФайл(Запись, "REASON_M", ""); //CHAR 50	Причина отказа. Вручную заполняемый комментарий
		ДобавитьЭлементВФайл(Запись, "REASON_V", ""); //CHAR 50	Причина отказа. Комментарий из предопределённого справочника.
		ДобавитьЭлементВФайл(Запись, "CARRIER_GU_ID", ""); //CHAR 20	Экспедитор-исполнитель. Необходимо для формирования ГУ 12
		ДобавитьЭлементВФайл(Запись, "CARRIER_GU_DESCR", ""); //CHAR 60	Наименование экспедитора-исполнителя
		ДобавитьЭлементВФайл(Запись, "BORDER_LOC", ""); //CHAR 20	Выходящий погран/переход
		ДобавитьЭлементВФайл(Запись, "BORDER_LOC_DESCR", ""); //CHAR 60	Описание погран/перехода
		ДобавитьЭлементВФайл(Запись, "RAILROAD_CARRIER_ID", ""); //CHAR 20	Перевозчик по дороге. Пример: РЖД
		ДобавитьЭлементВФайл(Запись, "RAILROAD_CARRIER_DESCR", ""); //CHAR 60	Описание перевозчика по дороге
		ДобавитьЭлементВФайл(Запись, "PAYER_ID", ""); //CHAR 20	Плательщик по Ж/Д
		ДобавитьЭлементВФайл(Запись, "PAYER_DESCR", ""); //CHAR 60	Описание плательщика по Ж/Д
		ДобавитьЭлементВФайл(Запись, "QUANT", ""); //QUAN 31	Количество контейнеров
		ДобавитьЭлементВФайл(Запись, "QUANT_UOM", ""); //UNIT 3	ЕИ Количество. Справочник QUANT_UOM 
		ДобавитьЭлементВФайл(Запись, "LOWEST_PRICE_PROP", ""); //P(15) DECIMALS 6	Предложенная ставка (в случае возможности изменения ставки)
		ДобавитьЭлементВФайл(Запись, "LOWEST_PRICE_PROP_CURR", ""); //CHAR 5	Поле содержит курс валюты заявки (в случае закрытой ставки может быть пустым)
									 									//Возможные курсы валют необходимо брать из справочника CURRENCY
		ДобавитьЭлементВФайл(Запись, "COMMENT", "Заявка не найдена"); //CHAR 255	Комментарий
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC", "02"); //CHAR 2	Статус обработки запроса к сервису Возможные значения лежат в справочнике STATUS_PROC.
		ДобавитьЭлементВФайл(Запись, "STATUS_PROC_DESC", "Не успешно"); //CHAR 60	Наименование статуса обработки запроса к сервису
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_ID", ""); //CHAR 20	Собственник контейнера. Возможные значения описаны в справочнике Контрагенты
		ДобавитьЭлементВФайл(Запись, "CONTAINER_OWNER_DESCR", ""); //CHAR 60	Наименование собственника контейнера
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_ID", ""); //CHAR 20	Собственник ж/д – платформы. Возможные значения описаны в справочнике Контрагенты
		ДобавитьЭлементВФайл(Запись, "PLATE_OWNER_DESCR", ""); //CHAR 60	Наименование собственника ж/д - платформы
		
	КонецЕсли;
	
	Запись.ЗаписатьКонецЭлемента(); //ROW
		
	Запись.ЗаписатьКонецЭлемента(); //n0:mt_displacement_data_ans
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция GetOfferClaims(XMLRequest)
	
	ЕСОбменСибурСервер.ПолучитьПредложениеПоЗаявке(XMLRequest);
	
КонецФункции

Функция GetOfferClaimsXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбъектXDTO.Свойства().Получить("ROW") <> Неопределено Тогда
		ОбъектXDTO = ОбъектXDTO.ROW;
	КонецЕсли;
	
	ДанныеДляОтвета = ЕСОбменСибурСервер.ПолучитьПредложениеПоЗаявке(ОбъектXDTO);
	
	Если ЗначениеЗаполнено(ДанныеДляОтвета.RFQ_ID) Тогда
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(Запись, ДанныеДляОтвета,, "",);
		XMLResponse = Запись.Закрыть();
		XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
		XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	Иначе
		XMLResponse = "";
	КонецЕсли;
	
	Возврат XMLResponse;	
	
КонецФункции

// Букинги

Функция Booking(Request)
		
	Возврат ЕСОбменСибурСервер.БронированиеМестНаСудне(Request);
	
КонецФункции

Функция BookingXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	Request = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если Request.Свойства().Получить("ROW") <> Неопределено Тогда
		Request = Request.ROW;
	КонецЕсли;
	
	Response = ЕСОбменСибурСервер.БронированиеМестНаСудне(Request);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, Response,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

Функция BookingConfirm(Request)
	
	Возврат ЕСОбменСибурСервер.ПодтверждениеБронированияМестНаСудне(Request);
	
КонецФункции

Функция BookingConfirmXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	Request = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если Request.Свойства().Получить("ROW") <> Неопределено Тогда
		Request = Request.ROW;
	КонецЕсли;
	
	Response = ЕСОбменСибурСервер.ПодтверждениеБронированияМестНаСудне(Request);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, Response,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

Функция BookingNotify(Request)
	
	Возврат ЕСОбменСибурСервер.УведомлениеОБронированииМестНаСудне(Request);
	
КонецФункции

Функция BookingNotifyXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	Request = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если Request.Свойства().Получить("ROW") <> Неопределено Тогда
		Request = Request.ROW;
	КонецЕсли;
	
	Response = ЕСОбменСибурСервер.УведомлениеОБронированииМестНаСудне(Request);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, Response,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;	
	
КонецФункции

// Коносаменты

Функция BillOfLadingInstruction(Request)
	
	Возврат ЕСОбменСибурСервер.ЗаписатьИнструкцию(Request);
	
КонецФункции

Функция BillOfLadingInstructionXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	Request = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если Request.Свойства().Получить("ROW") <> Неопределено Тогда
		Request = Request.ROW;
	КонецЕсли;
	
	Response = ЕСОбменСибурСервер.ЗаписатьИнструкцию(Request);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, Response,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

Функция BillOfLading(Request)
	
	Возврат ЕСОбменСибурСервер.ДрафтКоносамента(Request);	
	
КонецФункции

Функция BillOfLadingXML(XMLRequest)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLRequest);	
	Request = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если Request.Свойства().Получить("ROW") <> Неопределено Тогда
		Request = Request.ROW;
	КонецЕсли;
	
	Response = ЕСОбменСибурСервер.ДрафтКоносамента(Request);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, Response,, "",);
	XMLResponse = Запись.Закрыть();
	XMLResponse = СтрЗаменить(XMLResponse, "xmlns=""""", "");
	XMLResponse = СтрЗаменить(XMLResponse, "ОбъектXDTO", "");
	
	Возврат XMLResponse;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСвойстваЗаявки(ОбъектXDTO)
	
	СвойстваЗаявки = Новый Структура;	
	
	СвойстваЗаявки.Вставить("KEY",					ОбъектXDTO.KEY); 				// 	32(X(16))	Технический идентификатор заявки в SAP TM
	СвойстваЗаявки.Вставить("PARENT_KEY", 			ОбъектXDTO.PARENT_KEY); 		//	CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
	СвойстваЗаявки.Вставить("ROOT_KEY", 			ОбъектXDTO.ROOT_KEY); 			//	CHAR 32(X(16))	Технический идентификатор общей потребности на контейнеры
	СвойстваЗаявки.Вставить("RFQ_ID", 				ОбъектXDTO.RFQ_ID); 			//	CHAR 10	Идентификатор заявки SAP TM
	СвойстваЗаявки.Вставить("TEND_SEQ_NR", 			ОбъектXDTO.TEND_SEQ_NR); 		//	CHAR 3	Порядковый номер заявки к конкретному ЛП (в случае переторжки = 2, 3, n…)
	СвойстваЗаявки.Вставить("TEND_MANAGER", 		ОбъектXDTO.TEND_MANAGER); 		//	CHAR 12	Поле содержит идентификатор контактного лица
	СвойстваЗаявки.Вставить("TEND_MANAGER_TEL", 	ОбъектXDTO.TEND_MANAGER_TEL); 	//	CHAR 20	Контактный телефон
	СвойстваЗаявки.Вставить("TEND_MANAGER_MAIL", 	ОбъектXDTO.TEND_MANAGER_MAIL); 	//	CHAR 50	Контактная почта
	СвойстваЗаявки.Вставить("CHANGED_TOR", 			ОбъектXDTO.CHANGED_TOR); 		//	CHAR 1	Поле содержит признак внесения изменений в первоначальный запрос (количество контейнеров)
	СвойстваЗаявки.Вставить("START_DATETIME", 		ОбъектXDTO.START_DATETIME); 	//	DATE/TIME	Дата отправления порожнего контейнера DD.MM.YYYY HH:MM:SS
	СвойстваЗаявки.Вставить("END_DATETIME", 		ОбъектXDTO.END_DATETIME); 		//	DATE/TIME	Дата прибытия порожнего контейнера DD.MM.YYYY HH:MM:SS
	СвойстваЗаявки.Вставить("CREATED_BY", 			ОбъектXDTO.CREATED_BY); 		//	CHAR 12	Поле содержит идентификатор пользователя, создавшего заявку
	СвойстваЗаявки.Вставить("CREATED_ON", 			ОбъектXDTO.CREATED_ON); 		//	DATE/TIME	Поле содержит дату создания заявки в формате DD.MM.YYYY HH:MM:SS
	СвойстваЗаявки.Вставить("CHANGED_BY", 			ОбъектXDTO.CHANGED_BY); 		//	CHAR 12	Поле содержит идентификатор пользователя, внесшего изменения в заявку
	СвойстваЗаявки.Вставить("CHANGED_ON", 			ОбъектXDTO.CHANGED_ON); 		//	DATE/TIME	Поле содержит дату внесения изменений в заявку в формате DD.MM.YYYY HH:MM:SS
	СвойстваЗаявки.Вставить("LIFECYCLE_RFQ", 		ОбъектXDTO.LIFECYCLE_RFQ); 		//	CHAR 2	Поле содержит статус заявки. Возможные значения необходимо брать из справочника LIFECYCLE_RFQ 
	СвойстваЗаявки.Вставить("LOWEST_PRICE_PROP", 	ОбъектXDTO.LOWEST_PRICE_PROP); 	//	P(15) DECIMALS 6	Поле содержит стоимость, предлагаемую клиентом для выполнения заявки (в случае закрытой ставки может быть пустым; ре)
	СвойстваЗаявки.Вставить("LOWEST_PRICE_PROP_CURR", ОбъектXDTO.LOWEST_PRICE_PROP_CURR); //	CHAR 5	Поле содержит курс валюты заявки (в случае закрытой ставки может быть пустым)
			 																				//Возможные курсы валют необходимо брать из справочника CURRENCY
	СвойстваЗаявки.Вставить("EST_END_DATETIME", 	ОбъектXDTO.EST_END_DATETIME); 			//	DATE/TIME	Поле содержит дату крайнего срока ответа экспедитора в формате DD.MM.YYYY HH:MM:SS
	СвойстваЗаявки.Вставить("TSP_ID", 				ОбъектXDTO.TSP_ID); 			//	CHAR 10	Код ЛП
	СвойстваЗаявки.Вставить("TEND_KEY", 			ОбъектXDTO.TEND_KEY); 			//	NUMC 10	Номер позиции заявки SAP TM
	СвойстваЗаявки.Вставить("SOURCE_LOC", 			ОбъектXDTO.SOURCE_LOC); 		//	CHAR 20	Поле содержит код станции отправления (код ЭТРАН)/порта отправления
	СвойстваЗаявки.Вставить("SOURCE_LOC_DESCR", 	ОбъектXDTO.SOURCE_LOC_DESCR); 	//	CHAR 255	Адрес станции отправления/порта отправления
	СвойстваЗаявки.Вставить("DEST_LOC", 			ОбъектXDTO.DEST_LOC); 			//	CHAR 20	Поле содержит код станции назначения/порта прибытия
	СвойстваЗаявки.Вставить("DEST_LOC_DESCR", 		ОбъектXDTO.DEST_LOC_DESCR); 	//	CHAR 255	Адрес станции назначения/порта прибытия
	СвойстваЗаявки.Вставить("FIN_LOC", 				ОбъектXDTO.FIN_LOC); 			//	CHAR 20	Финальная станция назначения/порта прибытия (при первичной подаче заявки до осуществления продажи – направление/страна)
	СвойстваЗаявки.Вставить("FIN_LOC_DESCR", 		ОбъектXDTO.FIN_LOC_DESCR); 		//	CHAR 255	Адрес финальной станции назначения
	СвойстваЗаявки.Вставить("RET_LOC", 				ОбъектXDTO.RET_LOC); 			//	CHAR 20	Станция возврата порожнего контейнера
	СвойстваЗаявки.Вставить("RET_LOC_DESCR", 		ОбъектXDTO.RET_LOC_DESCR); 		//	CHAR 255	Адрес станции возврата порожнего контейнера
	СвойстваЗаявки.Вставить("WEIGHT", 				ОбъектXDTO.WEIGHT); 			//	QUAN 31	Вес продукции
	СвойстваЗаявки.Вставить("WEIGHT_UOM", 			ОбъектXDTO.WEIGHT_UOM); 		//	UNIT 3	ЕИ Вес. Возможные значения ЕИ Вес необходимо брать из справочника WEIGHT_UOM
	СвойстваЗаявки.Вставить("VOLUME", 				ОбъектXDTO.VOLUME); 			//	QUAN 31	Объем (опционально)
	СвойстваЗаявки.Вставить("VOLUME_UOM", 			ОбъектXDTO.VOLUME_UOM); 		//	UNIT 3	ЕИ Объем (опционально). Возможные значения ЕИ Объем необходимо брать из справочника VOLUME_UOM
	СвойстваЗаявки.Вставить("QUANT", 				ОбъектXDTO.QUANT); 				//	QUAN 31	Количество контейнеров
	СвойстваЗаявки.Вставить("QUANT_UOM", 			ОбъектXDTO.QUANT_UOM); 			//	UNIT 3	ЕИ Количество. Возможные значения ЕИ Количество необходимо брать из справочника QUANT_UOM
	СвойстваЗаявки.Вставить("CONTAINER_MOT", 		ОбъектXDTO.CONTAINER_MOT); 		//	CHAR 2	Вид контейнера.. Возможные значения необходимо брать из справочника  CONTAINER_MOT
	СвойстваЗаявки.Вставить("CONTAINER_MOT_DESCR", 	ОбъектXDTO.CONTAINER_MOT_DESCR); //	CHAR 20	Описание вида контейнера
	СвойстваЗаявки.Вставить("DISTANCE", 			ОбъектXDTO.DISTANCE); 			//	QUAN 31	Расстояние (будут предоставляться для информации)
	СвойстваЗаявки.Вставить("DISTANCE_UOM", 		ОбъектXDTO.DISTANCE_UOM); 		//	UNIT 3	ЕИ Расстояния(Справочник DISTANCE_UOM)
	СвойстваЗаявки.Вставить("DANGEROUS", 			ОбъектXDTO.DANGEROUS); 			//	CHAR 1	Признак опасного груза (опционально). Возможные значения - справочник DANGEROUS
	СвойстваЗаявки.Вставить("CARGO", 				ОбъектXDTO.CARGO); 				//	CHAR 6	Код груза (ЕТСНГ)
	СвойстваЗаявки.Вставить("CARGO_DESCR", 			ОбъектXDTO.CARGO_DESCR); 		//	CHAR 50	Наименование груза (ЕТСНГ)
	СвойстваЗаявки.Вставить("TENDER_TYPE", 			ОбъектXDTO.TENDER_TYPE); 		//	CHAR 20	Тип тендера. Возможные значения в справочнике TENDER_TYPE
	СвойстваЗаявки.Вставить("COMMENT", 				ОбъектXDTO.COMMENT); 			//	CHAR 255	Комментарий
	
	Возврат СвойстваЗаявки;
	
КонецФункции

Функция ПолучитьДислокационныеДанныеПоИдентификаторуКонтейнера(ИдентификаторКонтейнера)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторКонтейнера", ИдентификаторКонтейнера);
	Запрос.УстановитьПараметр("Заказчик", Справочники.э_ПаспортаОрганизаций.НайтиПоНаименованию("ООО ""НХТК"""));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер
	|ПОМЕСТИТЬ ВТНакладныеПоЗаказчику
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|ГДЕ
	|	(э_НакладнаяКонтейнеры.Ссылка.Грузоотправитель = &Заказчик
	|			ИЛИ э_НакладнаяКонтейнеры.Ссылка.Грузополучатель = &Заказчик)
	|	И э_НакладнаяКонтейнеры.НомерКонтейнера = &ИдентификаторКонтейнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	ПоследняяНакладная.НомерКонтейнера КАК НомерКонтейнера,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ПоследняяНакладная.Контейнер КАК Контейнер,
	|	ПоследняяНакладная.Контейнер.ТипТЕ.РазмерКТК.Наименование КАК РазмерКТК,
	|	ПоследняяНакладная.МассыВКгТары КАК МассыВКгТары,
	|	ПоследняяНакладная.МассыВКгНетто КАК МассыВКгНетто,
	|	э_Накладная.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	э_Накладная.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТНакладные.Ссылка КАК Ссылка,
	|		ВТНакладные.Контейнер КАК Контейнер,
	|		ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|		ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|		ВТНакладные.МассыВКгНетто КАК МассыВКгНетто
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(ВТНакладные.ДатаИВремяОтправленияГруза) КАК ДатаИВремяОтправленияГруза
	|		ИЗ
	|			ВТНакладныеПоЗаказчику КАК ВТНакладные) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладныеПоЗаказчику КАК ВТНакладные
	|			ПО ВложенныйЗапрос.ДатаИВремяОтправленияГруза = ВТНакладные.ДатаИВремяОтправленияГруза) КАК ПоследняяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО ПоследняяНакладная.Ссылка = э_Накладная.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ВТНакладные.РазмерКТК КАК РазмерКТК,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ВТНакладные.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|	ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование,
	|	ВТНакладные.СтанцияНазначенияКод КАК СтанцияНазначенияНакладнойКод,
	|	ВТНакладные.СтанцияНазначенияНаименование КАК СтанцияНазначенияНакладнойНаименование
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТНакладные.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|			И ВТНакладные.Контейнер = ДислокацияКонтейнеров.Контейнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";	
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьДислокационныеДанныеЗаПериод(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Заказчик", Справочники.э_ПаспортаОрганизаций.НайтиПоНаименованию("ООО ""НХТК"""));	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	э_Накладная.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	э_Накладная.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	Документ.э_Накладная КАК э_Накладная
	|ГДЕ
	|	э_Накладная.ДатаИВремяОтправленияГруза <= &ДатаОкончания
	|	И э_Накладная.ДатаИВремяПрибытияГруза >= &ДатаНачала
	|	И (э_Накладная.Грузоотправитель = &Заказчик
	|			ИЛИ э_Накладная.Грузополучатель = &Заказчик)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер,
	|	ТЕ.ТипТЕ.РазмерКТК.Наименование КАК РазмерКТК,
	|	э_НакладнаяКонтейнеры.СобственникОКПО КАК СобственникОКПОВНакладной,
	|	э_НакладнаяКонтейнеры.СобственникНаименование КАК СобственникНаименованиеВНакладной
	|ПОМЕСТИТЬ ВТКонтейнерыНакладной
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|		ПО ВТНакладные.Накладная = э_НакладнаяКонтейнеры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.КодПоОКПО КАК СобственникКодПоОКПО,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.Наименование КАК СобственникНаименование,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.МорскаяЛиния КАК СобственникМорскаяЛиния
	|ПОМЕСТИТЬ ВТПризнакСобственностиКонтейнера
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
	|			,
	|			Контейнер В
	|				(ВЫБРАТЬ
	|					КонтейнерыНакладной.Контейнер
	|				ИЗ
	|					ВТКонтейнерыНакладной КАК КонтейнерыНакладной)) КАК ПризнакСобственностиКонтейнераСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКонтейнерыНакладной.Накладная КАК Накладная,
	|	ВТКонтейнерыНакладной.Контейнер КАК Контейнер,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование
	|ПОМЕСТИТЬ ВТДислокация
	|ИЗ
	|	ВТКонтейнерыНакладной КАК ВТКонтейнерыНакладной
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТКонтейнерыНакладной.Контейнер = ДислокацияКонтейнеров.Контейнер
	|			И ВТКонтейнерыНакладной.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|ГДЕ
	|	ДислокацияКонтейнеров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТКонтейнерыНакладной.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТКонтейнерыНакладной.Контейнер КАК Контейнер,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.КонтейнерНаименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначенияКодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперацииКодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперацииНаименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагономКод КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагономНаименование КАК ОперацияСВагономНаименование,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ВТНакладные.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТКонтейнерыНакладной.МассыВКгТары КАК МассыВКгТары,
	|	ВТКонтейнерыНакладной.МассыВКгНетто КАК МассыВКгНетто,
	|	ВТКонтейнерыНакладной.РазмерКТК КАК РазмерКТК,
	|	ДислокацияКонтейнеров.НомерВагона КАК НомерВагона,
	|	ДислокацияКонтейнеров.ДлинаВагона КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.ДлинаВагона <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.ДлинаВагона <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы,
	|	ВТНакладные.СтанцияНазначенияКод КАК СтанцияНазначенияНакладнойКод,
	|	ВТНакладные.СтанцияНазначенияНаименование КАК СтанцияНазначенияНакладнойНаименование,
	|	ВТКонтейнерыНакладной.СобственникОКПОВНакладной КАК СобственникОКПОВНакладной,
	|	ВТКонтейнерыНакладной.СобственникНаименованиеВНакладной КАК СобственникНаименованиеВНакладной,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникКодПоОКПО, """") КАК СобственникКодПоОКПО,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникНаименование, """") КАК СобственникНаименование,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникМорскаяЛиния, НЕОПРЕДЕЛЕНО) КАК СобственникМорскаяЛиния
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтейнерыНакладной КАК ВТКонтейнерыНакладной
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПризнакСобственностиКонтейнера КАК ВТПризнакСобственностиКонтейнера
	|			ПО ВТКонтейнерыНакладной.Контейнер = ВТПризнакСобственностиКонтейнера.Контейнер
	|		ПО ВТНакладные.Накладная = ВТКонтейнерыНакладной.Накладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДислокация КАК ДислокацияКонтейнеров
	|		ПО (ВТКонтейнерыНакладной.Контейнер = ДислокацияКонтейнеров.Контейнер)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИВремяОтправленияГруза,
	|	Период";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьДислокационныеДанныеПоИдентификаторуКонтейнераЗаПериод(ДатаНачала, ДатаОкончания, ИдентификаторКонтейнера)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ИдентификаторКонтейнера", ИдентификаторКонтейнера);
	Запрос.УстановитьПараметр("Заказчик", Справочники.э_ПаспортаОрганизаций.НайтиПоНаименованию("ООО ""НХТК"""));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	э_НакладнаяКонтейнеры.МассыВКгТары КАК МассыВКгТары,
	|	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	|	ТЕ.Ссылка КАК Контейнер,
	|	э_НакладнаяКонтейнеры.СобственникНаименование КАК СобственникНаименование,
	|	э_НакладнаяКонтейнеры.СобственникОКПО КАК СобственникОКПО
	|ПОМЕСТИТЬ ВТНакладныеПоЗаказчику
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|ГДЕ
	|	(э_НакладнаяКонтейнеры.Ссылка.Грузоотправитель = &Заказчик
	|			ИЛИ э_НакладнаяКонтейнеры.Ссылка.Грузополучатель = &Заказчик)
	|	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза <= &ДатаОкончания
	|	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза >= &ДатаНачала
	|	И э_НакладнаяКонтейнеры.НомерКонтейнера = &ИдентификаторКонтейнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Накладная,
	|	э_Накладная.Номер КАК НомерНакладной,
	|	ПоследняяНакладная.НомерКонтейнера КАК НомерКонтейнера,
	|	э_Накладная.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	э_Накладная.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправления,
	|	э_Накладная.СтанцияОтправления.Наименование КАК НаименованиеСтанцииОтправления,
	|	э_Накладная.Грузоотправитель КАК Грузоотправитель,
	|	э_Накладная.ГрузоотправительИД КАК ГрузоотправительИД,
	|	э_Накладная.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	э_Накладная.Грузополучатель КАК Грузополучатель,
	|	э_Накладная.ГрузополучательИД КАК ГрузополучательИД,
	|	э_Накладная.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	э_Накладная.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_Накладная.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	э_Накладная.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ПоследняяНакладная.Контейнер КАК Контейнер,
	|	ПоследняяНакладная.Контейнер.ТипТЕ.РазмерКТК.Наименование КАК РазмерКТК,
	|	ПоследняяНакладная.МассыВКгТары КАК МассыВКгТары,
	|	ПоследняяНакладная.МассыВКгНетто КАК МассыВКгНетто,
	|	э_Накладная.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	э_Накладная.СтанцияНазначенияНаименование КАК СтанцияНазначенияНаименование,
	|	ПоследняяНакладная.СобственникНаименование КАК СобственникНаименование,
	|	ПоследняяНакладная.СобственникОКПО КАК СобственникОКПО
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТНакладные.Ссылка КАК Ссылка,
	|		ВТНакладные.Контейнер КАК Контейнер,
	|		ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|		ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|		ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|		ВТНакладные.СобственникНаименование КАК СобственникНаименование,
	|		ВТНакладные.СобственникОКПО КАК СобственникОКПО
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(ВТНакладные.ДатаИВремяОтправленияГруза) КАК ДатаИВремяОтправленияГруза
	|		ИЗ
	|			ВТНакладныеПоЗаказчику КАК ВТНакладные) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладныеПоЗаказчику КАК ВТНакладные
	|			ПО ВложенныйЗапрос.ДатаИВремяОтправленияГруза = ВТНакладные.ДатаИВремяОтправленияГруза) КАК ПоследняяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО ПоследняяНакладная.Ссылка = э_Накладная.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.КодПоОКПО КАК СобственникКодПоОКПО,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.Наименование КАК СобственникНаименование,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК.МорскаяЛиния КАК СобственникМорскаяЛиния
	|ПОМЕСТИТЬ ВТПризнакСобственностиКонтейнера
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
	|			,
	|			Контейнер В
	|				(ВЫБРАТЬ
	|					Накладные.Контейнер
	|				ИЗ
	|					ВТНакладные КАК Накладные)) КАК ПризнакСобственностиКонтейнераСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладные.Накладная КАК Накладная,
	|	ВТНакладные.НомерНакладной КАК НомерНакладной,
	|	ВТНакладные.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТНакладные.Контейнер КАК Контейнер,
	|	ВТНакладные.РазмерКТК КАК РазмерКТК,
	|	ВТНакладные.НаименованиеСтанцииОтправления КАК НаименованиеСтанцииОтправления,
	|	ВТНакладные.Грузоотправитель КАК Грузоотправитель,
	|	ВТНакладные.ГрузоотправительИД КАК ГрузоотправительИД,
	|	ВТНакладные.ГрузоотправительНаименование КАК ГрузоотправительНаименование,
	|	ВТНакладные.Грузополучатель КАК Грузополучатель,
	|	ВТНакладные.ГрузополучательИД КАК ГрузополучательИД,
	|	ВТНакладные.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	ВТНакладные.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	ВТНакладные.СтанцияОтправленияНаименование КАК СтанцияОтправленияНаименование,
	|	ВТНакладные.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза,
	|	ВТНакладные.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
	|	ВТНакладные.ДатаИВремяПрибытияГруза КАК ДатаИВремяПрибытияГруза,
	|	ВТНакладные.МассыВКгТары КАК МассыВКгТары,
	|	ВТНакладные.МассыВКгНетто КАК МассыВКгНетто,
	|	ДислокацияКонтейнеров.Период КАК Период,
	|	ДислокацияКонтейнеров.Вагон.Наименование КАК НомерВагона,
	|	ДислокацияКонтейнеров.Вагон.ТипТС.Длина КАК ДлинаВагона,
	|	ВЫБОР
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 15240
	|			ТОГДА ""40""
	|		КОГДА ДислокацияКонтейнеров.Вагон.ТипТС.Длина <= 21336
	|			ТОГДА ""60""
	|		ИНАЧЕ ""80""
	|	КОНЕЦ КАК ВидЖДПлатформы,
	|	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияКонтейнеров.Контейнер.Наименование КАК КонтейнерНаименование,
	|	ДислокацияКонтейнеров.ТипКонтейнера КАК ТипКонтейнера,
	|	ДислокацияКонтейнеров.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначенияКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияНазначения.Наименование КАК СтанцияНазначенияНаименование,
	|	ДислокацияКонтейнеров.СтанцияОперации.КодЖДСтанции КАК СтанцияОперацииКодЖДСтанции,
	|	ДислокацияКонтейнеров.СтанцияОперации.Наименование КАК СтанцияОперацииНаименование,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Код КАК ОперацияСВагономКод,
	|	ДислокацияКонтейнеров.ОперацияСВагоном.Наименование КАК ОперацияСВагономНаименование,
	|	ВТНакладные.СтанцияНазначенияКод КАК СтанцияНазначенияНакладнойКод,
	|	ВТНакладные.СтанцияНазначенияНаименование КАК СтанцияНазначенияНакладнойНаименование,
	|	ВТНакладные.СобственникНаименование КАК СобственникНаименованиеВНакладной,
	|	ВТНакладные.СобственникОКПО КАК СобственникОКПОВНакладной,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникКодПоОКПО, """") КАК СобственникКодПоОКПО,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникНаименование, """") КАК СобственникНаименование,
	|	ЕСТЬNULL(ВТПризнакСобственностиКонтейнера.СобственникМорскаяЛиния, НЕОПРЕДЕЛЕНО) КАК СобственникМорскаяЛиния
	|ИЗ
	|	ВТНакладные КАК ВТНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	|		ПО ВТНакладные.НомерНакладной = ДислокацияКонтейнеров.НомерНакладной
	|			И ВТНакладные.Контейнер = ДислокацияКонтейнеров.Контейнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПризнакСобственностиКонтейнера КАК ВТПризнакСобственностиКонтейнера
	|		ПО ВТНакладные.Контейнер = ВТПризнакСобственностиКонтейнера.Контейнер
	|ГДЕ
	|	ДислокацияКонтейнеров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";	
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ДобавитьАтрибутВФайл(Файл, ИмяЭлемента, Значение)
	
	Файл.ЗаписатьНачалоАтрибута(ИмяЭлемента);		
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецАтрибута();
	
КонецПроцедуры

Процедура ДобавитьЭлементВФайл(Файл, ИмяЭлемента, Значение)
	
	Файл.ЗаписатьНачалоЭлемента(ИмяЭлемента);		
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ПолучитьТаблицуДислокационныхСтатусов()
	
	ТаблицаСтатусов = Новый ТаблицаЗначений;
	ТаблицаСтатусов.Колонки.Добавить("КодОперации");
	ТаблицаСтатусов.Колонки.Добавить("НаименованиеОперации");
	ТаблицаСтатусов.Колонки.Добавить("STATUS");
	ТаблицаСтатусов.Колонки.Добавить("STATUS_DESC");
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "037";
	НоваяСтрока.НаименованиеОперации = "ПРИЕМ ОТ КЛИЕНТА НА СТАНЦИИ";
	НоваяСтрока.STATUS = "LOAD_BEGIN";
	НоваяСтрока.STATUS_DESC = "Начало погрузки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "030";
	НоваяСтрока.НаименованиеОперации = "ПОГРУЗКА В ВАГОН НА КП";
	НоваяСтрока.STATUS = "LOAD_END";
	НоваяСтрока.STATUS_DESC = "Окончание погрузки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "004";
	НоваяСтрока.НаименованиеОперации = "ВКЛЮЧЕНИЕ В ПОЕЗД";
	НоваяСтрока.STATUS = "POPU";
	НоваяСтрока.STATUS_DESC = "Подтверждение погрузки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "002";
	НоваяСтрока.НаименованиеОперации = "ОТПРАВЛЕНИЕ ВАГОНА СО СТАНЦИИ";
	НоваяСтрока.STATUS = "DEPARTURE";
	НоваяСтрока.STATUS_DESC = "Убытие";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "008";
	НоваяСтрока.НаименованиеОперации = "ПРИБЫТИЕ С ПОЕЗДОМ НА СТАНЦИЮ";
	НоваяСтрока.STATUS = "ARRIV_DEST";
	НоваяСтрока.STATUS_DESC = "Прибытие";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "003";
	НоваяСтрока.НаименованиеОперации = "ИСКЛЮЧЕНИЕ ИЗ ПОЕЗДА";
	НоваяСтрока.STATUS = "UNLOAD_BEGIN";
	НоваяСтрока.STATUS_DESC = "Начало разгрузки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "080";
	НоваяСтрока.НаименованиеОперации = "ПОДАЧА ВАГОНА С КОНТ.";
	НоваяСтрока.STATUS = "UNLOAD_END";
	НоваяСтрока.STATUS_DESC = "Окончание разгрузки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "040";
	НоваяСтрока.НаименованиеОперации = "ВЫГРУЗКА ИЗ ВАГОНА НА КП";
	НоваяСтрока.STATUS = "POD";
	НоваяСтрока.STATUS_DESC = "Подтверждение доставки";
	
	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.КодОперации = "";
	НоваяСтрока.НаименованиеОперации = "";
	НоваяСтрока.STATUS = "LOCATION";
	НоваяСтрока.STATUS_DESC = "Текущее местоположение";
	
	Возврат ТаблицаСтатусов;
	
КонецФункции

Функция ПолучитьДислокационныйСтатус(ТаблицаСтатусов, КодОперации)
	
	Статус = Новый Структура("STATUS, STATUS_DESC");
	
	НайденнаяСтрока = ТаблицаСтатусов.Найти(КодОперации, "КодОперации");
	Если НайденнаяСтрока <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Статус, НайденнаяСтрока);
	Иначе
		Статус.STATUS = "LOCATION";
		Статус.STATUS_DESC = "Текущее местоположение";
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти

