
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	ДатаПроведения = ТекущаяДата();
	
	Наименование = "Совещание " + ДатаПроведения;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	СписокТегов = СтрСоединить(Теги.Выгрузить().ВыгрузитьКолонку("Тег"), "; ");
	ТекстДляПоиска = СтрСоединить(Абзацы.Выгрузить().ВыгрузитьКолонку("Абзац"), "; ");
	
КонецПроцедуры
