
Функция НайтиСоздатьГруз(Наименование, ЕТСНГ, ГНГ) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Грузы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Грузы КАК Грузы
	               |ГДЕ
	               |	НЕ Грузы.ПометкаУдаления
	//Евросиб Каблов 26.01.2022 ( Task 46219 
	//               |	И Грузы.ЕТСНГ = &ЕТСНГ";
	//Запрос.УстановитьПараметр("ЕТСНГ", ЕТСНГ);
	               |	И ПОДСТРОКА(Грузы.ЕТСНГ, 1, 5) = &ЕТСНГ";
	Запрос.УстановитьПараметр("ЕТСНГ", Лев(ЕТСНГ, 5));
	//Евросиб Каблов 26.01.2022 )
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат = Ответ.Ссылка;
		
	КонецЕсли;

	//Евросиб Каблов 26.01.2022 ( Task 46219
	//Если НЕ ЗначениеЗаполнено(Результат) Тогда
	Если НЕ ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(ЕТСНГ) И ЗначениеЗаполнено(Наименование) Тогда
	//Евросиб Каблов 26.01.2022 )
		
		НовГруз = Справочники.Грузы.СоздатьЭлемент();
		НовГруз.Наименование = Наименование;
		НовГруз.ЕТСНГ = ЕТСНГ;
		НовГруз.ГНГ = ГНГ;
		НовГруз.Записать();
		Результат = НовГруз.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("Грузы", ДанныеВыбора, Параметры, СтандартнаяОбработка);

	
КонецПроцедуры
