
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);  
	
	Если Параметры.Свойство("ПСЦПоставщика") Тогда
		ЭтаФорма.ПСЦПоставщика = Параметры.ПСЦПоставщика;
		ЭтаФорма.НуженОтборПоПСЦПоставщика = Истина;
	КонецЕсли; 
	Параметры.Свойство("Контрагент", ЭтаФорма.Контрагент);
	Параметры.Свойство("Договор", ЭтаФорма.ДоговорКонтрагента);
	Параметры.Свойство("ДатаДокумента", ЭтаФорма.ДатаАктуальности); 
	Если Параметры.Свойство("СписокУслуг") Тогда
		ЭтаФорма.СписокУслуг.ЗагрузитьЗначения(Параметры.СписокУслуг);
		ОтборПоУслугам = Истина;
		Элементы.ГруппаОтборУслуг.Видимость = Истина;
	КонецЕсли;
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

&НаСервере
Процедура УстановитьОтборыДинамическогоСписка()  
	
	Для Каждого ТекНастройка Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ТекНастройка);
	КонецЦикла;
	
	УстановитьОтборПоУслугам();

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ПометкаУдаления", Ложь, 
		ВидСравненияКомпоновкиДанных.Равно,,Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);	
		
	Если НуженОтборПоПСЦПоставщика Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"ПСЦПоставщика", ПСЦПоставщика, 
			ВидСравненияКомпоновкиДанных.Равно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
			Строка(Новый УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПСЦПоставщика");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Контрагент", Контрагент, 
			ВидСравненияКомпоновкиДанных.Равно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
			Строка(Новый УникальныйИдентификатор)); 
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Контрагент");
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Договор", ДоговорКонтрагента, 
			ВидСравненияКомпоновкиДанных.Равно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
			Строка(Новый УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Договор");
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"НачалоДействия", ДатаАктуальности, 
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный,
			Строка(Новый УникальныйИдентификатор));
			
		ГруппаОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.Использование = Истина;
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;  
			
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОкончаниеДействия");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ДатаАктуальности;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОкончаниеДействия");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Иначе      
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "НачалоДействия");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ОкончаниеДействия");	
	КонецЕсли;  
	
	Элементы.Список.Обновить();
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьОтборПоУслугам()

	Если ЗначениеЗаполнено(СписокУслуг) и ОтборПоУслугам Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НуженОтборПоУслугам", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокУслуг", СписокУслуг);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Услуги.Номенклатура", СписокУслуг, 
			ВидСравненияКомпоновкиДанных.ВСписке,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НуженОтборПоУслугам", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокУслуг", Новый СписокЗначений);
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Услуги.Номенклатура");
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоУслугамПриИзменении(Элемент)
	УстановитьОтборПоУслугам();
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПриИзменении(Элемент)
	УстановитьОтборПоУслугам();
КонецПроцедуры


&НаКлиенте
Процедура Изменить(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПоказатьЗначение(, ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

