Процедура ПостановкаЗадачиВСлучаеИсключенияКТКИзСделкиПриНаличииРТУ_Сделка(ЭтотОбъект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда Возврат; КонецЕсли;
	
	ЕстьХотьОднаУдаленнаяСтрока = Ложь;
	МассивОставшихсяКТК = Новый Массив;
	
	Для каждого Стр из ЭтотОбъект.СвязьУчетныхЕдиниц Цикл

		//Евросиб - АСуслов 24.05.2022 12:51:31 #
		//(
		//синхронизация с хранилищем, взял с рабочей
		Если Стр.Удалена = Ложь Тогда 
		//)
		//Евросиб - АСуслов 24.05.2022 12:51:37 #
			МассивОставшихсяКТК.Добавить(Стр.Контейнер);
		Иначе
			ЕстьХотьОднаУдаленнаяСтрока = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьХотьОднаУдаленнаяСтрока Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КлючевыеСобытияСделки.КТК КАК КТК,
	               |	КлючевыеСобытияСделки.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	               |ГДЕ
	               |	КлючевыеСобытияСделки.Сделка = &Сделка
	               |	И ТИПЗНАЧЕНИЯ(КлючевыеСобытияСделки.Документ) = ТИП(Документ.РеализацияТоваровУслуг)
	               |	И НЕ КлючевыеСобытияСделки.КТК В (&КТК)";
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("КТК", МассивОставшихсяКТК);
	МассивУдаленныхКТК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КТК");
	
	Если МассивУдаленныхКТК.Количество() > 0 Тогда
		
		ИскСост = Справочники.Состояния.ТребуетсяИсключитьКонтейнерыИзРТУ;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.ПримечаниеЗадачаИсполнителю = Истина;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;              
		//Евросиб - АСуслов 17.01.2022 18:02:03 #45645
		//(
		СтрокаСписокКТК = СтрСоединить(МассивУдаленныхКТК, ", ");
		НСтр.Комментарий = "Исключить удаленные контейнеры из РТУ: " + СтрокаСписокКТК;
		ТекстСообщения = СтрШаблон("По сделке %1 необходимо исключить удаленные контейнеры из РТУ: %2",
									ЭтотОбъект,
									СтрокаСписокКТК);
		Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
		//)
		//Евросиб - АСуслов 17.01.2022 18:02:03 #45645
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПостановкаЗадачиПриИзмененииКоличестваВыставляемыхКТК_Заявка(ЭтотОбъект) Экспорт
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И (ЭтотОбъект.Ссылка.СоставУслуги.Количество() < ЭтотОбъект.СоставУслуги.Количество() ИЛИ СоставКонтейнеровРазличается(ЭтотОбъект.Ссылка.СоставУслуги.ВыгрузитьКолонку("НомерКТК"), ЭтотОбъект.СоставУслуги.ВыгрузитьКолонку("НомерКТК"))) И ПоЭтойЗаявкеЕстьСделка(ЭтотОбъект.Ссылка) Тогда
		
		ИскСост = Справочники.Состояния.ОбновитьСоставПоездаСвязанныхСделок;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.ПримечаниеЗадачаИсполнителю = Истина;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
		НСтр.Комментарий = "Требуется перезаполнить состав поезда по сделкам: " + СписокСделокПоЗаявке(ЭтотОбъект.Ссылка);
		Сообщить(НСтр.Комментарий, СтатусСообщения.ОченьВажное);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ЭтотОбъект.Ссылка.СоставУслуги.Количество() < ЭтотОбъект.СоставУслуги.Количество() И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
		
		ИскСост = Справочники.Состояния.НеобходимоВыставитьДопСчет;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
		Сообщить("На эту заявку оформлен авансовый счет. При увеличении количества КТК необходимо довыставить счет клиенту!", СтатусСообщения.ОченьВажное);
		
	//ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ЭтотОбъект.Ссылка.СоставУслуги.Количество() > ЭтотОбъект.СоставУслуги.Количество() И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ИзменениеКоличестваАктивныхСтрок(ЭтотОбъект) < 0 И ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(ЭтотОбъект.Ссылка) Тогда
		
		ИскСост = Справочники.Состояния.НеобходимоСогласоватьПереносАванса;
		
		НайдСтр = ЭтотОбъект.Состояния.Найти(ИскСост, "Состояние");
		
		Если НайдСтр <> неопределено Тогда
			НСтр = НайдСтр;
		Иначе
			НСтр = ЭтотОбъект.Состояния.Добавить();
		КонецЕсли;
		
		НСтр.Состояние = ИскСост;
		НСтр.Исполнитель = ЭтотОбъект.Автор;
		НСтр.Наблюдатель = НСтр.Исполнитель;
		НСтр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
		Сообщить("На эту заявку оформлен авансовый счет. При уменьшении количества КТК необходимо согласовать перенос аванса или выставить другой счет!", СтатусСообщения.ОченьВажное);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоставКонтейнеровРазличается(СписокКТК1, СписокКТК2)
	
	Результат = Ложь;
	
	Для каждого Стр из СписокКТК1 Цикл
		Если СписокКТК2.Найти(Стр) = неопределено Тогда Результат = Истина; КонецЕсли;
	КонецЦикла;
	Если Результат = Ложь Тогда
		Для каждого Стр из СписокКТК2 Цикл
			Если СписокКТК1.Найти(Стр) = неопределено Тогда Результат = Истина; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоЭтойЗаявкеЕстьСделка(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПоЭтойЗаявкеЕстьОплаченныйАвансСчет(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ПО ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю = СчетНаОплатуПокупателю.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.ДокументыОснования.Документ = &Заявка
	               |	И СчетНаОплатуПокупателю.ПометкаУдаления = ЛОЖЬ
	               |	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюДокументыОснования.Ссылка
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	               |		ПО СчетНаОплатуПокупателюДокументыОснования.Ссылка = ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю
	               |ГДЕ
	               |	СчетНаОплатуПокупателюДокументыОснования.Документ = &Заявка
	               |	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СписокСделокПоЗаявке(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Ссылка.Номер КАК СсылкаНомер
	               |ИЗ
	               |	Т1 КАК Т1";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаНомер"), ", ");
	
КонецФункции

Функция ПеренестиКТКВДругуюЗаявку(СписокКТК, ПредыдущаяЗаявка, НоваяЗаявка) Экспорт
	
	НЗ = неопределено;
	
	Если НоваяЗаявка = Истина Тогда
		НЗ = ПредыдущаяЗаявка.Скопировать();
		НЗ.СоставУслуги.Очистить();
		НЗ.Маршрутизировать = Истина;
		НЗ.НаМоментЗаписиБылаЗадолженность = Ложь;
		НЗ.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		НЗ = НоваяЗаявка.ПолучитьОбъект();
	КонецЕсли;
	
	ПредыдущаяЗаявкаЪ = ПредыдущаяЗаявка.ПолучитьОбъект();
	
	Для каждого Стр из ПредыдущаяЗаявкаЪ.СоставУслуги Цикл
		
		Если СписокКТК.Найти(Стр.НомерКТК) <> неопределено Тогда
			НСтр = НЗ.СоставУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			Стр.ПеренесенВЗаявку = НЗ.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	ПредыдущаяЗаявкаЪ.Записать(РежимЗаписиДокумента.Проведение);
	НЗ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НЗ.Ссылка;
	
КонецФункции

Функция ИзменениеКоличестваАктивныхСтрок(Заявка)
	
	Изменение = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ЗаявкаУслуги
	|ИЗ
	|	&СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.ПеренесенВЗаявку = Значение(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаявкаПослеЗаписи.НомерСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ЗаявкаПослеЗаписи
	|ИЗ
	|	ВТ_ЗаявкаУслуги КАК ВТ_ЗаявкаПослеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаСоставУслуги.НомерСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ЗаявкаДоЗаписи
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = Значение(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкаПослеЗаписи.КоличествоСтрок - ВТ_ЗаявкаДоЗаписи.КоличествоСтрок КАК Изменение
	|ИЗ
	|	ВТ_ЗаявкаДоЗаписи КАК ВТ_ЗаявкаДоЗаписи,
	|	ВТ_ЗаявкаПослеЗаписи КАК ВТ_ЗаявкаПослеЗаписи";
	Запрос.УстановитьПараметр("СоставУслуги", Заявка.СоставУслуги.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Заявка.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Изменение = РезультатЗапроса.Выгрузить()[0].Изменение; 
	КонецЕсли; 
	Возврат Изменение;
	
КонецФункции
 
Функция ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, Знач ОбъектСделка) Экспорт
	Возврат Документы.Сделка.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ОбъектСделка);		
КонецФункции

// Евросиб Фролов (24.03.2022 US №40767, Task №40768
Функция ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторов, Знач ОбъектСделка) Экспорт
	Возврат Документы.Сделка.ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторов, ОбъектСделка);	
КонецФункции	
// Евросиб Фролов)

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
Функция ПолучитьДанныеПоЗапрещеннымДляПереноса(Знач ОбъектСделка, МассивУникальныхЗаявок) Экспорт

	СтруктураДанныеПоЗапрещеннымДляПересчета = Новый Структура("МассивДобавленоИзАкцепта, МассивОбъединениеПорожнейИГруженойСделок", Новый Массив, Новый Массив);
	Расходы = ОбъектСделка.Расходы.Выгрузить();
	СвязьУчетныхЕдиниц = ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("БезЖДН", Истина));	
	СписокГУИДЗапрещенныхКПерезаполнению = ПерезаполнениеСделкиСервер.ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета, 
																													Расходы, 
																													СвязьУчетныхЕдиниц, 
																													МассивУникальныхЗаявок);

	Возврат СтруктураДанныеПоЗапрещеннымДляПересчета;
КонецФункции
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
&НаСервере
Функция ВыполнитьОтключениеРасходовИзАкцептаИВыполнитьРазъединение(Знач Объект, ДополнительныеПараметры) Экспорт     
	Возврат ПерезаполнениеСделкиСервер.ОтключитьРасходыПоАкцептамИВыполнитьРазъединение(Объект, ДополнительныеПараметры);	
КонецФункции
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
 
