
&НаКлиенте
Процедура НазначитьВОтправку(Команда)
	
	РЕЗ = НазначитьВОтправкуНаСервере();
	
	Если РЕЗ = Истина Тогда
		
		Оповестить("ТребуетсяОбновитьОтправку");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НазначитьВОтправкуНаСервере()
	
	Сч = 2;
	НомерВагона = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	
	ВагонМассив = Новый Массив;
	ВсеОК = Истина;
	ВсеОКСтрока = "";
	
	Пока НомерВагона <> "" Цикл
		
		ВагонСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(НомерВагона); // Справочники.ТЕ.НайтиПоНаименованию(НомерВагона);
		Если ЗначениеЗаполнено(ВагонСсылка) Тогда
			
			ВагонМассив.Добавить(ВагонСсылка);
			
		Иначе
			
			ВсеОК = Ложь;
			ВсеОКСтрока = ВсеОКСтрока + НомерВагона + ", ";
			
		КонецЕсли;
		
		Сч = Сч + 1;
		НомерВагона = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		
	КонецЦикла;
	
	Если НЕ ВсеОК Тогда
		
		Сообщить("Не найдены вагоны № " + ВсеОКСтрока);
		Возврат Ложь;
		
	Иначе
		
		Для каждого Стр из ВагонМассив Цикл
			
			МЗ = РегистрыСведений.КонтейнерыВОтправке.СоздатьМенеджерЗаписи();
			МЗ.Контейнер = Стр;
			МЗ.Отправка = Отправка;
			МЗ.Период = ТекущаяДата();
			МЗ.Записать(Истина);
			
		КонецЦикла;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отправка = Параметры.Отправка;
	
КонецПроцедуры
