
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МножественныйВыбор") 
		//Евросиб Гудкова( 20.05.2020 Ticket№ 0195027
		И Параметры.МножественныйВыбор = Истина
		// Евросиб Гудкова) 
		Тогда
		Элементы.Список.МножественныйВыбор = Истина;
	КонецЕсли;
//Евросиб Гудкова( 20.05.2020 Ticket№ 0195027
	//Если Параметры.Свойство("ОдиночныйВыбор") Тогда
	//	Элементы.Список.МножественныйВыбор = Ложь;
	//КонецЕсли;
// Евросиб Гудкова) 
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )


