
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// + Состояния
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	СтруктураКартинок = Новый Структура;
	ОписаниеФормат.УстановитьHTML(Объект.Описание, СтруктураКартинок);
	
	Для каждого Стр из Объект.Стратегии Цикл
		Стратегии.Добавить(Стр.Стратегия);
	КонецЦикла;
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтруктураКартинок = Новый Структура();
	ОписаниеФормат.ПолучитьHTML(Объект.Описание, СтруктураКартинок);
	
	Объект.Стратегии.Очистить();
	Для каждого Стр из Стратегии Цикл
		Объект.Стратегии.Добавить().Стратегия = Стр.Значение;
	КонецЦикла;
	
	
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("КонтрольныйСрок", Объект.КонтрольныйСрок);
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПроект(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация =  
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	Если ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроектов.Архивный");
	КонецЕсли;
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура тестНаСервере()
	Пользователи_sd_сервер.ОповещениеОТекущихЗадачахИПросрочках();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СостоянияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Текд.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроектов.Архивный");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ДопСвойстваОбъекта.Очистить();
КонецПроцедуры
