
// основные и служебные функции

Функция ПолучитьЗначениеПоказателя(Организация, Показатель, Отборы, ДатаНачала, ДатаПроверки, Цель = неопределено) Экспорт
	
	Результат = 0;
	
	Если Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДебиторкаКоличествоКонтрагентовСПДЗ Тогда
		
		ДанныеДебиторки = ПолучитьДанныеДебиторки(Организация, Отборы, ДатаПроверки);
		
		Результат = Новый Структура("Результат, Детализация", ДанныеДебиторки.Результат.КоличествоКонтрагентов, ДанныеДебиторки.ДетализацияКоличестваРезультат);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДебиторкаОбщаяСуммаПДЗ Тогда
		
		ДанныеДебиторки = ПолучитьДанныеДебиторки(Организация, Отборы, ДатаПроверки);
		
		//Результат = ДанныеДебиторки.ОбщаяСумма;
		Результат = Новый Структура("Результат, Детализация", ДанныеДебиторки.Результат.ОбщаяСумма, ДанныеДебиторки.ДетализацияСуммыРезультат);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДоговорыКоличествоНовыхДоговоров Тогда
			
		Результат = КоличествоНовыхДоговоров(Организация, Отборы, ДатаНачала, ДатаПроверки);	
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДоговорыКоличествоНовыхПСЦ Тогда
			
		Результат = КоличествоНовыхПСЦ(Организация, Отборы, ДатаНачала, ДатаПроверки);	
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДоговорыКоличествоНовыхТарифовВСистеме Тогда
			
		Результат = КоличествоНовыхТарифов(Организация, Отборы, ДатаНачала, ДатаПроверки);	
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДоговорыРазницаМеждуМаксимальнымиТарифамиЗаПериод Тогда
		
		ЦенаТарифаВПервыйДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаНачала, ДатаНачала+24*3600);
		ЦенаТарифаВПоследнийДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаПроверки, ДатаПроверки+24*3600);
		Результат = ЦенаТарифаВПервыйДень - ЦенаТарифаВПоследнийДень;

	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДоговорыРазницаМеждуСамымДорогимИСамымДешевым Тогда
		
		МаксТарифВПервыйДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаНачала, ДатаНачала+24*3600);
		МинТарифВПервыйДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаНачала, ДатаНачала+24*3600, Ложь);
		
		МаксТарифВПоследнийДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаПроверки, ДатаПроверки+24*3600);
		МинТарифВПоследнийДень = ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаПроверки, ДатаПроверки+24*3600, Ложь);
		
		Результат = (МаксТарифВПервыйДень - МинТарифВПервыйДень) - (МаксТарифВПоследнийДень - МинТарифВПоследнийДень);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДокументыКлиентуКоличествоСделокБезДокументов Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.КоличествоСделкиБезРеализаций;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.КоличествоСделкиБезРеализаций, СделкиИнфо.ДетализацияКоличествоСделкиБезРеализаций);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДокументыКлиентуКоличествоСделокБезОплат Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.КоличествоСделокБезОплаты;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.КоличествоСделокБезОплаты, СделкиИнфо.ДетализацияКоличествоСделокБезОплаты);		
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ДокументыКлиентуСуммаСНПЗаПериод Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.СуммаСНПЗаПериод;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.СуммаСНПЗаПериод, СделкиИнфо.ДетализацияСуммаСНПЗаПериод);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ПеревозкиКоличествоСделокЗаПериод Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.КоличествоСделок;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.КоличествоСделок, СделкиИнфо.ДетализацияКоличествоСделок);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ПеревозкиСуммаКонтрибуцииЗаПериод Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.СуммаКонтрибуцииЗаПериод;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.СуммаКонтрибуцииЗаПериод, СделкиИнфо.ДетализацияСуммаКонтрибуцииЗаПериод);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ПеревозкиСуммаРеализацийЗаПериод Тогда
		
		СделкиИнфо = СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки);
		//Результат = СделкиИнфо.СуммаРеализацийЗаПериод;
		
		Результат = Новый Структура("Результат, Детализация", СделкиИнфо.Результат.СуммаРеализацийЗаПериод, СделкиИнфо.ДетализацияСуммаРеализацийЗаПериод);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ОтклоненияКоличествоОтменПоездов Тогда
		
		РейсИнфо = СобратьИнформациюПоОтправкам(Отборы, ДатаНачала, ДатаПроверки);
		//Результат = РейсИнфо.ОтменПоездов;
		
		Результат = Новый Структура("Результат, Детализация", РейсИнфо.Результат.ОтменПоездов, РейсИнфо.ДетализацияОтменПоездовРезультат);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ПеревозкиКоличествоПоездовУшедшихВовремя Тогда
		
		РейсИнфо = СобратьИнформациюПоОтправкам(Отборы, ДатаНачала, ДатаПроверки);
		//Результат = РейсИнфо.ПоездовВовремя;

		Результат = Новый Структура("Результат, Детализация", РейсИнфо.Результат.ПоездовВовремя, РейсИнфо.ДетализацияПоездовВовремяРезультат);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.ПеревозкиКоличествоПоездовНЕУшедшихВовремя Тогда
		
		РейсИнфо = СобратьИнформациюПоОтправкам(Отборы, ДатаНачала, ДатаПроверки);
		//Результат = РейсИнфо.ПоездовНеВовремя;
		
		Результат = Новый Структура("Результат, Детализация", РейсИнфо.Результат.ПоездовНеВовремя, РейсИнфо.ДетализацияПоездовНеВовремяРезультат);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.КонтейнерыОбщееКоличествоКТКВЗаявках Тогда
		
		Результат = ПолучитьКоличествоКТКВЗаявках(Организация, Отборы, ДатаНачала, ДатаПроверки);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.РучныеОперацииКоличествоЗагруженныхФайловПоТипам Тогда
		
		Результат = ПолучитьКоличествоЗагруженныхФайлов(Организация, Отборы, ДатаНачала, ДатаПроверки);
		
	ИначеЕсли Показатель = Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.РучныеОперацииРучнаяОтметка Тогда
		
		Результат = ПолучитьКоличествоРучныхОтметокЗаПериод(Цель, ДатаНачала, ДатаПроверки);
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРасходыРУР(Сделка, ГУИДДоходов, РУР)
	
	СуммаРасходов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаРасходы.СуммаИтого КАК СуммаИтого,
	               |	СделкаРасходы.Валюта КАК Валюта,
	               |	СделкаРасходы.Ссылка.Дата КАК ДатаДокумента
	               |ИЗ
	               |	Документ.Сделка.Расходы КАК СделкаРасходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	               |		ПО СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	               |			И СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	               |ГДЕ
	               |	СделкаСвязьДоходовИРасходов.Доходы = &Доходы
	               |	И СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Доходы", ГУИДДоходов);
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		СуммаРасходов = СуммаРасходов + РаботаСКурсамиВалют.ПересчитатьВВалюту(Ответ.СуммаИтого, Ответ.Валюта, РУР, Ответ.ДатаДокумента);
	КонецЦикла;
	
	Возврат СуммаРасходов;
	
КонецФункции

Функция РегионСоответствует(РегионДоговора, ОтборПоРегионам)
	
	Результат = Ложь;
	
	Если ОтборПоРегионам.Количество() = 0 Тогда Возврат Истина; КонецЕсли;
	
	МассивРегионаДоговора = Локации_сервер.ПолучитьМассивРодителей(РегионДоговора, Истина);
	
	Для каждого Стр из ОтборПоРегионам ЦИкл
		
		Результат = Результат ИЛИ МассивРегионаДоговора.Найти(Стр) <> неопределено;
		
	КонецЦикла;
	
	Возврат результат;
	
КонецФункции

Процедура ОчиститьЗаписиЛичныхЦелей(ОбъектЪ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектЪ) тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.РучнаяОтметкаЛичныхЦелей КАК РучнаяОтметкаЛичныхЦелей
	               |ГДЕ
	               |	РучнаяОтметкаЛичныхЦелей.ОбъектЛичнойЦели = &ОбъектЛичнойЦели";
	Запрос.УстановитьПараметр("ОбъектЛичнойЦели", ОбъектЪ);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		МЗ = РегистрыСведений.РучнаяОтметкаЛичныхЦелей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		МЗ.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗаписиЛичныхЦелей(ОбъектЪ) Экспорт
	
	Если ОбъектЪ.ПометкаУдаления Тогда Возврат; КонецЕсли;
	Для каждого Стр из ОбъектЪ.ЛичныеЦели Цикл
		
		Если НЕ Стр.Отметка Тогда Продолжить; КонецЕсли;
		
		МЗ = РегистрыСведений.РучнаяОтметкаЛичныхЦелей.СоздатьМенеджерЗаписи();
		МЗ.Исполнитель = Стр.Исполнитель;
		МЗ.ОбъектЛичнойЦели = ОбъектЪ;
		МЗ.Отметка = Стр.Отметка;
		МЗ.Цель = Стр.Цель;
		МЗ.ПериодЪ = Стр.ДатаОтметки;
		МЗ.Период = Стр.ДатаОтметки;
		МЗ.Отметка = ?(Стр.Отметка, 1, 0);
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОповещенияПоЛичнымЦелям() Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	
КонецПроцедуры

Функция ПолучитьДействующиеЦелиДляРучнойОтметки(ОбъектЛичнойЦели) экспорт
	
	ИмяОбъектаМетаданного = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектЛичнойЦели)).ПолноеИмя();
	Если НЕ ПравоДоступа("Редактирование", Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданного)) Тогда Возврат Новый Массив; КонецЕсли; 
	
	МассивНедопустимыхЛичныхЦелей = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектЛичнойЦели) Тогда
		МассивНедопустимыхЛичныхЦелей = ОбъектЛичнойЦели.ЛичныеЦели.ВыгрузитьКолонку("Цель");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеЦелиЪ.Ссылка КАК Ссылка,
	               |	ЛичныеЦелиЪ.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Документ.ЛичныеЦели КАК ЛичныеЦелиЪ
	               |ГДЕ
	               |	НЕ ЛичныеЦелиЪ.ПометкаУдаления
	               |	И ЛичныеЦелиЪ.НачалоРаботы <= &ТекДата
	               |	И ЛичныеЦелиЪ.КонтрольныйПоказатель = &КонтрольныйПоказатель
	               |	И ЛичныеЦелиЪ.СрокДостижения >= &ТекДата
	               |	И НЕ ЛичныеЦелиЪ.Ссылка В (&МассивНедопустимыхЛичныхЦелей)";
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("КонтрольныйПоказатель", Перечисления.ЛичныеЦели_СписокКонтрольныхПоказателей.РучныеОперацииРучнаяОтметка);
	Запрос.УстановитьПараметр("МассивНедопустимыхЛичныхЦелей", МассивНедопустимыхЛичныхЦелей);
	Результат = Новый Массив;
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Новый Структура("Цель, Исполнитель", Ответ.Ссылка, Ответ.Сотрудник));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДействующиеЦелиНаДату(ДатаЪ) экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеЦелиЪ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛичныеЦели КАК ЛичныеЦелиЪ
	               |ГДЕ
	               |	НЕ ЛичныеЦелиЪ.ПометкаУдаления
	               |	И ЛичныеЦелиЪ.НачалоРаботы <= &ДатаЪ
	               |	И ЛичныеЦелиЪ.СрокДостижения >= &ДатаЪ";
	Запрос.УстановитьПараметр("ДатаЪ", ДатаЪ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// функции вычисления конкретных показателей

Функция ПолучитьКоличествоРучныхОтметокЗаПериод(Цель, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияРучныхОтметокРезультат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РучнаяОтметкаЛичныхЦелей.Отметка КАК Отметка,
	               |	РучнаяОтметкаЛичныхЦелей.ОбъектЛичнойЦели КАК ОбъектЛичнойЦели,
	               |	РучнаяОтметкаЛичныхЦелей.Цель КАК Цель,
	               |	РучнаяОтметкаЛичныхЦелей.Исполнитель КАК Исполнитель
	               |ИЗ
	               |	РегистрСведений.РучнаяОтметкаЛичныхЦелей КАК РучнаяОтметкаЛичныхЦелей
	               |ГДЕ
	               |	РучнаяОтметкаЛичныхЦелей.Цель = &Цель
	               |	И РучнаяОтметкаЛичныхЦелей.ПериодЪ МЕЖДУ &Дата1 И &Дата2
	               |	И РучнаяОтметкаЛичныхЦелей.Отметка > 0";
	Запрос.УстановитьПараметр("Цель", Цель);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Результат + Ответ.Отметка;
		ДетализацияРучныхОтметокРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.ОбъектЛичнойЦели + ", " + Ответ.Исполнитель, 1));
	КонецЕсли;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияРучныхОтметокРезультат);	
	
КонецФункции

Функция ПолучитьКоличествоЗагруженныхФайлов(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияРучныхОтметокРезультат = Новый Массив;
	
	ОтборПоТипамФайлов = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоФайлыСледующегоТипа Тогда ОтборПоТипамФайлов = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Ссылка КАК Ссылка,
	               |	Файлы.ВладелецФайла КАК ВладелецФайла,
	               |	Файлы.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	НЕ Файлы.ПометкаУдаления
	               |	И Файлы.ДатаСоздания МЕЖДУ &Дата1 И &Дата2
	               |	И (Файлы.ВидДокумента  В (&СписокТиповФайлов)
	               |			ИЛИ &СписокТиповНеЗаполнен)
	               |	И (Файлы.ВладелецФайла.Организация = &Организация
	               |			ИЛИ Файлы.ВладелецФайла.Организация ЕСТЬ NULL)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	
	Запрос.УстановитьПараметр("СписокТиповФайлов", ОтборПоТипамФайлов);
	Запрос.УстановитьПараметр("СписокТиповНеЗаполнен", ОтборПоТипамФайлов.Количество() = 0);
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат = Результат + 1;
		ДетализацияРучныхОтметокРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.ВладелецФайла + ", " + Ответ.ВидДокумента, 1));
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияРучныхОтметокРезультат);	
	
КонецФункции

Функция ПолучитьКоличествоКТКВЗаявках(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияРучныхОтметокРезультат = Новый Массив;
	
	ОтборПоПродуктам = Новый Массив;
	ОтборПоНоменклатуре = Новый Массив;
	ОтборПоКонтрагентам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСПродуктомВСписке Тогда ОтборПоПродуктам = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоНоменклатураВСписке Тогда ОтборПоНоменклатуре = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагентам = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	ЗаявкаПосчитана = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Ссылка,
	               |	ЗаявкаСоставУслуги.Услуга КАК Услуга,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |ГДЕ
	               |	НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления
	               |	И (ЗаявкаСоставУслуги.Ссылка.Контрагент  В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ЗаявкаСоставУслуги.Ссылка.Организация = &Организация
	               |	И ЗаявкаСоставУслуги.Ссылка.Создано МЕЖДУ &Дата1 И &Дата2
	               |	И (ЗаявкаСоставУслуги.Услуга  В (&СписокНоменклатуры)
	               |			ИЛИ &НоменклатураНеУказана)
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоПродуктам
	               |				ТОГДА ЗаявкаСоставУслуги.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ЗаявкаПереченьРейсов.Ссылка КАК Ссылка
	               |						ИЗ
	               |							Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |						ГДЕ
	               |							ЗаявкаПереченьРейсов.Рейс.Продукт В (&Продукты))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", ОтборПоНоменклатуре);
	Запрос.УстановитьПараметр("НоменклатураНеУказана", ОтборПоНоменклатуре.Количество() = 0);
	
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагентам);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагентам.Количество() = 0);
	
	Запрос.УстановитьПараметр("ОтборПоПродуктам", НЕ ОтборПоПродуктам.Количество() = 0);
	Запрос.УстановитьПараметр("Продукты", ОтборПоПродуктам);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Ответ.НомерКТК) Тогда 
			Результат = Результат + 1;
			ДетализацияРучныхОтметокРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.НомерКТК + ", " + Ответ.Ссылка, 1));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияРучныхОтметокРезультат);	
	
КонецФункции

Функция СобратьИнформациюПоОтправкам(Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = Новый Структура("ПоездовВовремя, ПоездовНеВовремя, ОтменПоездов", 0, 0, 0);
	
	ДетализацияПоездовВовремяРезультат = Новый Массив;
	ДетализацияПоездовНеВовремяРезультат = Новый Массив;
	ДетализацияОтменПоездовРезультат = Новый Массив;
	
	ОтборПоРегионамОтпр = Новый Массив;
	ОтборПоРегионамНазн = Новый Массив;
	ОтборПоПродуктам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСПродуктомВСписке Тогда ОтборПоПродуктам = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономОтправленияВСписке Тогда ОтборПоРегионамОтпр = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономНазначенияВСписке Тогда ОтборПоРегионамНазн = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсыЖД.Ссылка КАК Ссылка,
	               |	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
	               |	РейсыЖД.СдвигРейсаПредыдущаяДата КАК СдвигРейсаПредыдущаяДата,
	               |	РейсыЖД.РейсОтменен КАК РейсОтменен,
	               |	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
	               |	РейсыЖД.ПунктНазначения КАК ПунктНазначения
	               |ИЗ
	               |	Справочник.РейсыЖД КАК РейсыЖД
	               |ГДЕ
	               |	(РейсыЖД.Продукт В (&СписокПродуктов)
	               |			ИЛИ &ПродуктыНеУказаны)
	               |	И НЕ РейсыЖД.ПометкаУдаления
	               |	И РейсыЖД.ДатаОтправления МЕЖДУ &Дата1 И &Дата2";
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Мин(ДатаПроверки, ТекущаяДата()));
	
	Запрос.УстановитьПараметр("СписокПродуктов", ОтборПоПродуктам);
	Запрос.УстановитьПараметр("ПродуктыНеУказаны", ОтборПоПродуктам.Количество() = 0);
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если РегионСоответствует(Ответ.ПунктОтправления, ОтборПоРегионамОтпр) и РегионСоответствует(Ответ.ПунктНазначения, ОтборПоРегионамНазн) Тогда 
			
			Если НЕ Ответ.РейсОтменен И ЗначениеЗаполнено(Ответ.СдвигРейсаПредыдущаяДата) Тогда
				Результат.ПоездовНеВовремя = Результат.ПоездовНеВовремя + 1;
				ДетализацияПоездовНеВовремяРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			ИначеЕсли НЕ Ответ.РейсОтменен Тогда
				Результат.ПоездовВовремя = Результат.ПоездовВовремя + 1;
				ДетализацияПоездовВовремяРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			Иначе
				Результат.ОтменПоездов = Результат.ОтменПоездов + 1;
				ДетализацияОтменПоездовРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, ДетализацияПоездовВовремяРезультат, ДетализацияПоездовНеВовремяРезультат, ДетализацияОтменПоездовРезультат", Результат, ДетализацияПоездовВовремяРезультат, ДетализацияПоездовНеВовремяРезультат, ДетализацияОтменПоездовРезультат);
	
КонецФункции

Функция СобратьЭкономикуПоСделкам(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = Новый Структура("КоличествоСделокБезОплаты, КоличествоСделкиБезРеализаций, СуммаСНПЗаПериод, СуммаРеализацийЗаПериод, СуммаКонтрибуцииЗаПериод, КоличествоСделок", 0, 0, 0, 0, 0, 0);
	
	ДетализацияКоличествоСделокБезОплаты = Новый Массив;
	ДетализацияКоличествоСделкиБезРеализаций = Новый Массив;
	ДетализацияСуммаСНПЗаПериод = Новый Массив;
	ДетализацияСуммаРеализацийЗаПериод = Новый Массив;
	ДетализацияСуммаКонтрибуцииЗаПериод = Новый Массив;
	ДетализацияКоличествоСделок = Новый Массив;
	
	
	ОтборПоПродуктам = Новый Массив;
	ОтборПоПроектам = Новый Массив;
	ОтборПоКонтрагентам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСПродуктомВСписке Тогда ОтборПоПродуктам = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСПроектомВСписке Тогда ОтборПоПроектам = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагентам = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	РУР = Константы.ВалютаРегламентированногоУчета.Получить();
	
	МассивУслугСНП = Новый Массив;
	МассивУслугСНП.Добавить(Константы.УслугаСНППоВагону.Получить());
	МассивУслугСНП.Добавить(Константы.УслугаСНППоКТК.Получить());
	
	МассивОтработанныхСделок = Новый Массив;
	МассивОтработанныхСделокБезОплат = Новый Массив;
	МассивОтработанныхСделокБезРеализаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаДоходы.Ссылка КАК Ссылка,
	               |	СделкаДоходы.Клиент КАК Клиент,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.СуммаНДС КАК СуммаНДС,
	               |	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	СделкаДоходы.СуммаИтого КАК СуммаИтого,
	               |	СделкаДоходы.Валюта КАК Валюта,
	               |	СделкаДоходы.УчДокумент КАК УчДокумент,
	               |	ЕСТЬNULL(ОплатыПоРеализациям.Оплачено, 0) КАК ОплаченоПоРеализации,
	               |	ЕСТЬNULL(СделкаДоходы.УчДокумент.ДатаДокумента, &ТекДата) КАК ДатаДокумента,
	               |	СделкаДоходы.ГУИД КАК ГУИД
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации КАК Реализация,
	               |			СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) КАК Оплачено
	               |		ИЗ
	               |			Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации) КАК ОплатыПоРеализациям
	               |		ПО СделкаДоходы.УчДокумент = ОплатыПоРеализациям.Реализация
	               |ГДЕ
	               |	НЕ СделкаДоходы.Ссылка.ПометкаУдаления
	               |	И СделкаДоходы.Ссылка.Организация = &Организация
	               |	И (СделкаДоходы.Ссылка.Проект В (&СписокПроектов)
	               |			ИЛИ &ПроектыНеУказаны)
	               |	И СделкаДоходы.Ссылка.Создано МЕЖДУ &Дата1 И &Дата2
	               |	И (СделкаДоходы.Клиент В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоПродуктам
	               |				ТОГДА СделкаДоходы.Ссылка В
	               |						(ВЫБРАТЬ
	               |							СделкаРейсы.Ссылка КАК Ссылка
	               |						ИЗ
	               |							Документ.Сделка.Рейсы КАК СделкаРейсы
	               |						ГДЕ
	               |							СделкаРейсы.Рейс.Продукт В (&Продукты))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	
	Запрос.УстановитьПараметр("СписокПроектов", ОтборПоПроектам);
	Запрос.УстановитьПараметр("ПроектыНеУказаны", ОтборПоПроектам.Количество() = 0);
	
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагентам);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагентам.Количество() = 0);
	
	Запрос.УстановитьПараметр("ОтборПоПродуктам", НЕ ОтборПоПродуктам.Количество() = 0);
	Запрос.УстановитьПараметр("Продукты", ОтборПоПродуктам);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		СуммаТекущейСтроки = ?(Ответ.НДСВключенВСтоимость, Ответ.СуммаИтого - Ответ.СуммаНДС, Ответ.СуммаИтого);
		
		Если МассивОтработанныхСделок.Найти(Ответ.ссылка) = неопределено Тогда
			Результат.КоличествоСделок = Результат.КоличествоСделок + 1;
			МассивОтработанныхСделок.Добавить(Ответ.Ссылка);
			
			ДетализацияКоличествоСделок.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			
		КонецЕсли;
		
		Если Ответ.СуммаИтого > Ответ.ОплаченоПоРеализации и МассивОтработанныхСделокБезОплат.Найти(Ответ.Ссылка) = неопределено Тогда
			Результат.КоличествоСделокБезОплаты = Результат.КоличествоСделокБезОплаты + 1;
			МассивОтработанныхСделокБезОплат.Добавить(Ответ.Ссылка);
			
			ДетализацияКоличествоСделокБезОплаты.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Ответ.УчДокумент) И МассивОтработанныхСделокБезРеализаций.Найти(Ответ.Ссылка) = неопределено Тогда
			Результат.КоличествоСделкиБезРеализаций = Результат.КоличествоСделкиБезРеализаций + 1;
			МассивОтработанныхСделокБезРеализаций.Добавить(Ответ.Ссылка);
			
			ДетализацияКоличествоСделкиБезРеализаций.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
			
		КонецЕсли;
		
		Если МассивУслугСНП.Найти(Ответ.Услуга) <> неопределено Тогда
			КвантСНП = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаТекущейСтроки, Ответ.Валюта, РУР, ?(ЗначениеЗаполнено(Ответ.ДатаДокумента), Ответ.ДатаДокумента, Ответ.Ссылка.Дата));
			
			Результат.СуммаСНПЗаПериод = Результат.СуммаСНПЗаПериод + КвантСНП;
			
			ДетализацияСуммаСНПЗаПериод.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, КвантСНП));
			
		КонецЕсли;
		
		КвантРеализации = РаботаСКурсамиВалют.ПересчитатьВВалюту(Ответ.СуммаИтого, Ответ.Валюта, РУР, Ответ.ДатаДокумента);
		
		Результат.СуммаРеализацийЗаПериод = Результат.СуммаРеализацийЗаПериод + КвантРеализации;
		
		ДетализацияСуммаРеализацийЗаПериод.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, КвантРеализации));
		
		КвантКонтрибуции = РаботаСКурсамиВалют.ПересчитатьВВалюту(Ответ.СуммаИтого, Ответ.Валюта, РУР, Ответ.ДатаДокумента) - ПолучитьРасходыРУР(Ответ.Ссылка, Ответ.ГУИД, РУР);
		
		Результат.СуммаКонтрибуцииЗаПериод = Результат.СуммаКонтрибуцииЗаПериод + КвантКонтрибуции;

		ДетализацияСуммаКонтрибуцииЗаПериод.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, КвантКонтрибуции));
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат,ДетализацияКоличествоСделок,ДетализацияКоличествоСделокБезОплаты,ДетализацияКоличествоСделкиБезРеализаций,ДетализацияСуммаСНПЗаПериод,ДетализацияСуммаРеализацийЗаПериод,ДетализацияСуммаКонтрибуцииЗаПериод",
	Результат,ДетализацияКоличествоСделок,ДетализацияКоличествоСделокБезОплаты,ДетализацияКоличествоСделкиБезРеализаций,ДетализацияСуммаСНПЗаПериод,ДетализацияСуммаРеализацийЗаПериод,ДетализацияСуммаКонтрибуцииЗаПериод);
	
КонецФункции

Функция ПолучитьДанныеДебиторки(Организация, Отборы, ДатаПроверки)
	
	ДетализацияКоличестваРезультат = Новый Массив;
	ДетализацияСуммыРезультат = Новый Массив;
	
	Результат = Новый Структура("КоличествоКонтрагентов, ОбщаяСумма", 0, 0);
	
	РУР = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ОтборПоКонтрагенту = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагенту = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
	               |	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
	               |	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	               |	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	               |	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	               |	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов.Дата КАК ДатаДокумента
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(&Период, Организация = &Организация) КАК ВзаиморасчетыСПокупателямиОстатки
	               |ГДЕ
	               |	ДОБАВИТЬКДАТЕ(ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов.Дата, ДЕНЬ, ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты) < &Период
	               |	И (ВзаиморасчетыСПокупателямиОстатки.Контрагент В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ТИПЗНАЧЕНИЯ(ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов) = ТИП(Документ.РеализацияТоваровУслуг)
	               |	И ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток < 0";
	Запрос.УстановитьПараметр("Период", ДатаПроверки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагенту);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагенту.Количество() = 0);
	Ответ = Запрос.Выполнить().Выбрать();
	ПосчитанныеКонтрагенты = Новый Массив;	
	Пока Ответ.Следующий() Цикл
		Если ПосчитанныеКонтрагенты.Найти(Ответ.Контрагент) = неопределено Тогда
			ПосчитанныеКонтрагенты.Добавить(Ответ.Контрагент);
			Результат.КоличествоКонтрагентов = Результат.КоличествоКонтрагентов + 1;
			ДетализацияКоличестваРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Контрагент + ", " + Ответ.ДокументВзаиморасчетов, 1));
		КонецЕсли;
		
		ДельтаМинус = - РаботаСКурсамиВалют.ПересчитатьВВалюту(Ответ.СуммаБезНДСОстаток, Ответ.ВалютаРасчетов, РУР, Ответ.ДатаДокумента);
		
		Результат.ОбщаяСумма = Результат.ОбщаяСумма + ДельтаМинус; // минус потому что ПДЗ отрицательная, а нам надо сумму этой ПДЗ 
		ДетализацияСуммыРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Контрагент + ", " + Ответ.ДокументВзаиморасчетов, ДельтаМинус));
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, ДетализацияКоличестваРезультат, ДетализацияСуммыРезультат", Результат, ДетализацияКоличестваРезультат, ДетализацияСуммыРезультат);
	
КонецФункции

Функция КоличествоНовыхДоговоров(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияКоличестваРезультат = Новый Массив;

	ОтборПоВиду = Новый Массив;
	ОтборПоКатегории = Новый Массив;
	ОтборПоРегиону = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСВидомДоговораВСписке Тогда ОтборПоВиду = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСКатегориейДоговораВСписке Тогда ОтборПоКатегории = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономДействияДоговораВСписке Тогда ОтборПоРегиону = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	               |	ДоговорыКонтрагентов.РегионДоговора КАК РегионДоговора
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И (ДоговорыКонтрагентов.ВидДоговора В (&ВидДоговора)
	               |			ИЛИ &ВидДоговораНеУказан)
	               |	И (ДоговорыКонтрагентов.КатегорияДоговора В (&КатегорияДоговора)
	               |			ИЛИ &КатегорияДоговораНеУказан)
	               |	И ДоговорыКонтрагентов.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	Запрос.УстановитьПараметр("ВидДоговора", ОтборПоВиду);
	Запрос.УстановитьПараметр("ВидДоговораНеУказан", ОтборПоВиду.Количество() = 0);
	Запрос.УстановитьПараметр("КатегорияДоговора", ОтборПоКатегории);
	Запрос.УстановитьПараметр("КатегорияДоговораНеУказан", ОтборПоКатегории.Количество() = 0);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если РегионСоответствует(Ответ.РегионДоговора, ОтборПоРегиону) Тогда 
			Результат = Результат + 1;
			ДетализацияКоличестваРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияКоличестваРезультат);
	
КонецФункции

Функция КоличествоНовыхПСЦ(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияКоличестваРезультат = Новый Массив;
	
	ОтборПоВиду = Новый Массив;
	ОтборПоКатегории = Новый Массив;
	ОтборПоРегиону = Новый Массив;
	ОтборПоКонтрагентам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСВидомДоговораВСписке Тогда ОтборПоВиду = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСКатегориейДоговораВСписке Тогда ОтборПоКатегории = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономДействияДоговораВСписке Тогда ОтборПоРегиону = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагентам = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПСЦ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПСЦ КАК ПСЦ
	               |ГДЕ
	               |	НЕ ПСЦ.ПометкаУдаления
	               |	И ПСЦ.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И (ПСЦ.Договор.ВидДоговора В (&ВидДоговора)
	               |			ИЛИ &ВидДоговораНеУказан)
	               |	И (ПСЦ.Договор.КатегорияДоговора  В (&КатегорияДоговора)
	               |			ИЛИ &КатегорияДоговораНеУказан)
	               |	И (ПСЦ.Контрагент В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ПСЦ.Организация = &Организация";
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	Запрос.УстановитьПараметр("ВидДоговора", ОтборПоВиду);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговораНеУказан", ОтборПоВиду.Количество() = 0);
	Запрос.УстановитьПараметр("КатегорияДоговора", ОтборПоКатегории);
	Запрос.УстановитьПараметр("КатегорияДоговораНеУказан", ОтборПоКатегории.Количество() = 0);
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагентам);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагентам.Количество() = 0);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат = Результат + 1;
		ДетализацияКоличестваРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияКоличестваРезультат);
	
КонецФункции

Функция КоличествоНовыхТарифов(Организация, Отборы, ДатаНачала, ДатаПроверки)
	
	Результат = 0;
	
	ДетализацияКоличестваРезультат = Новый Массив;
	
	ОтборПоРегионуОтпр = Новый Массив;
	ОтборПоРегионуНазн = Новый Массив;
	ОтборПоНоменклатуре = Новый Массив;
	ОтборПоКонтрагентам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономОтправленияВСписке Тогда ОтборПоРегионуОтпр = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономНазначенияВСписке Тогда ОтборПоРегионуНазн = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоНоменклатураВСписке Тогда ОтборПоНоменклатуре = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагентам = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиков.Ссылка КАК Ссылка,
	               |	ТарифыПоставщиков.ПунктОтправления КАК ПунктОтправления,
	               |	ТарифыПоставщиков.ПунктНазначения КАК ПунктНазначения
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
	               |ГДЕ
	               |	НЕ ТарифыПоставщиков.ПометкаУдаления
	               |	И ТарифыПоставщиков.Организация = &Организация
	               |	И (ТарифыПоставщиков.Услуга В (&СписокНоменклатуры)
	               |			ИЛИ &НоменклатураНеУказана)
	               |	И (ТарифыПоставщиков.Поставщик В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ТарифыПоставщиков.Создано МЕЖДУ &Дата1 И &Дата2";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаПроверки);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ОтборПоНоменклатуре);
	Запрос.УстановитьПараметр("НоменклатураНеУказана", ОтборПоНоменклатуре.Количество() = 0);
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагентам);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагентам.Количество() = 0);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если РегионСоответствует(Ответ.ПунктОтправления, ОтборПоРегионуОтпр) И РегионСоответствует(Ответ.ПунктНазначения, ОтборПоРегионуНазн) Тогда
			Результат = Результат + 1;
			ДетализацияКоличестваРезультат.Добавить(Новый Структура("Детализация, ЧисловойПоказатель", "" + Ответ.Ссылка, 1));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("Результат, Детализация", Результат, ДетализацияКоличестваРезультат);
	
КонецФункции

Функция ВычисленнаяЦенаТарифа(Организация, Отборы, ДатаНачала, ДатаПроверки, Максимальная = Истина)
	
	Результат = 0;
	
	ОтборПоРегионуОтпр = Новый Массив;
	ОтборПоРегионуНазн = Новый Массив;
	ОтборПоНоменклатуре = Новый Массив;
	ОтборПоКонтрагентам = Новый Массив;
	Для каждого Стр из Отборы Цикл
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономОтправленияВСписке Тогда ОтборПоРегионуОтпр = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоСРегиономНазначенияВСписке Тогда ОтборПоРегионуНазн = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоНоменклатураВСписке Тогда ОтборПоНоменклатуре = Стр.СписокОтборов; КонецЕсли;
		Если Стр.Ограничение = Перечисления.ЛичныеЦели_СписокОграничений.ТолькоКонтрагентыВСписке Тогда ОтборПоКонтрагентам = Стр.СписокОтборов; КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиков.Ссылка КАК Ссылка,
	               |	ТарифыПоставщиков.ПунктОтправления КАК ПунктОтправления,
	               |	ТарифыПоставщиков.ПунктНазначения КАК ПунктНазначения
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
	               |ГДЕ
	               |	НЕ ТарифыПоставщиков.ПометкаУдаления
	               |	И ТарифыПоставщиков.Организация = &Организация
	               |	И (ТарифыПоставщиков.Услуга В (&СписокНоменклатуры)
	               |			ИЛИ &НоменклатураНеУказана)
	               |	И (ТарифыПоставщиков.Поставщик В (&СписокКонтрагентов)
	               |			ИЛИ &КонтрагентыНеУказаны)
	               |	И ТарифыПоставщиков.НачалоДействия <= &НачалоДействия
	               |	И ТарифыПоставщиков.ОкончаниеДействия >= &ОкончаниеДействия";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоДействия", ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеДействия", ДатаПроверки);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ОтборПоНоменклатуре);
	Запрос.УстановитьПараметр("НоменклатураНеУказана", ОтборПоНоменклатуре.Количество() = 0);
	Запрос.УстановитьПараметр("СписокКонтрагентов", ОтборПоКонтрагентам);
	Запрос.УстановитьПараметр("КонтрагентыНеУказаны", ОтборПоКонтрагентам.Количество() = 0);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если РегионСоответствует(Ответ.ПунктОтправления, ОтборПоРегионуОтпр) И РегионСоответствует(Ответ.ПунктНазначения, ОтборПоРегионуНазн) Тогда
			
			Для каждого Стр из Ответ.Ссылка.ТаблицаСтоимость Цикл
				
				Если Максимальная Тогда
					Результат = Макс(Результат, Стр.Стоимость);
				Иначе
					Результат = ?(Результат = 0, Стр.Стоимость, Мин(Результат, Стр.Стоимость));
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

