
Функция ПолучитьНовуюТаблицу() Экспорт
	
	ТипСтрока100 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50));
	ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Код", ТипСтрока100, "Код");
	Таблица.Колонки.Добавить("БезКТК_РФ", ТипНоменклатура, "Без КТК (РФ)");
	Таблица.Колонки.Добавить("ГруженыйКТК_РФ", ТипНоменклатура, "Груженый КТК (РФ)");
	Таблица.Колонки.Добавить("ПорожнийКТК_РФ", ТипНоменклатура, "Порожний КТК (РФ)");
	Таблица.Колонки.Добавить("БезКТК", ТипНоменклатура, "Без КТК");
	Таблица.Колонки.Добавить("ГруженыйКТК", ТипНоменклатура, "Груженый КТК");
	Таблица.Колонки.Добавить("ПорожнийКТК", ТипНоменклатура, "Порожний КТК");
	
	Возврат Таблица;
	
КонецФункции