//++ Зубов 0245991 11.10.2021
&НаКлиенте
Процедура ИсточникЗаписиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Лев(Запись.ИсточникЗаписи,6)="Заявка" Тогда
		Ключ = Новый Структура("Ключ", ПолучитьСсылкуНаЗаяку(Сред(Запись.ИсточникЗаписи,8,15)));
		Форма = ПолучитьФорму("Документ.Заявка.ФормаОбъекта", Ключ);
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаЗаяку(НомерЗаявки)
	СсылкаНаЗаявку = Документы.Заявка.НайтиПоНомеру(НомерЗаявки);
	Возврат СсылкаНаЗаявку;
КонецФункции
//-- Зубов 0245991 11.10.2021

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 14.10.2021 ( 39046
	ДоступноПраво_КонтейнернойГруппы = РольДоступна("арм_ктк_ПраваКонтейнернойГруппы") Или РольДоступна("ПолныеПрава");
	
	Если ЗначениеЗаполнено(Запись.Инвентаризация) И Не ДоступноПраво_КонтейнернойГруппы Тогда
		Элементы.тек_СрокВозврата.ТолькоПросмотр = Истина;
		Элементы.тек_ДатаПриемаВПользование.ТолькоПросмотр = Истина;
		Элементы.тек_ВидСобственности.ТолькоПросмотр = Истина;
		Элементы.тек_Собственник.ТолькоПросмотр = Истина;
	КонецЕсли;
	//Евросиб Каблов 14.10.2021 )
	
КонецПроцедуры

//++ Зубов US 45162 TA 45703 21.01.2022
&НаКлиенте
Процедура Ставка0ПриИзменении(Элемент)
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//Если Запись.тек_СобственностьКТК = ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Спот") Тогда
	//ок)
	Если Запись.Удалитьтек_СобственностьКТК = ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Спот") Тогда
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		Если Запись.комм_НулеваяСтавка Тогда
			Запись.комм_Ставка = 0;
		КонецЕсли;
	Иначе
		Запись.комм_НулеваяСтавка = НЕ Запись.комм_НулеваяСтавка;
		Сообщить("Нулевая ставка разрешена только для вида собственности Спот!");
	КонецЕсли;
КонецПроцедуры
//-- Зубов US 45162 TA 45703 21.01.2022