//Процедура ПеречитатьГрузовойСоставНаСервере(СтруктураДанныеПоЗапрещеннымДляПересчета,СтруктураПараметров) Экспорт 
Процедура ПеречитатьГрузовойСостав(СтруктураПараметровПерезаполнения) Экспорт 
	
	//ВТ_СвязьУчетныхЕдиниц        = ПолучитьТаблицуВТ_СвязьУчетныхЕдиниц();
	ВТ_СвязьУчетныхЕдиниц = СтруктураПараметровПерезаполнения.СвязьУчетныхЕдиниц.Скопировать(,"ГУИД, 
																							| ГУИДСтрокиЗаявки, 
																							| ВидТранспортногоСообщения, 
																							| Контейнер,
																							| Калькуляция,
																							| Коносамент,
																							| ПортОтправления,
																							| ПортНазначения"); 
													// Евросиб Рыбьяков 17.07.2024 US 84658
													// добавил доп. поля для сопоставления коносаментов
																						
	ЗаполненныеРанееДоплатныеКТК 				= СтруктураПараметровПерезаполнения.ЗаполненныеРанееДоплатныеКТК;
	СписокКТКФрахт               				= СтруктураПараметровПерезаполнения.СписокКТКФрахт;
	ДинамоИсторияКонтейнеров     				= СтруктураПараметровПерезаполнения.ДинамоИсторияКонтейнеров;
	ОбъектРейсы                  				= СтруктураПараметровПерезаполнения.ОбъектРейсы;
	ОбъектЗаявки                 				= СтруктураПараметровПерезаполнения.ОбъектЗаявки;
	СвязьУчетныхЕдиниц           				= СтруктураПараметровПерезаполнения.СвязьУчетныхЕдиниц;
	РазрешитьРейсыДругихСделок   				= СтруктураПараметровПерезаполнения.РазрешитьРейсыДругихСделок;
	ИсторияФильтрацииКонтейнеров 				= СтруктураПараметровПерезаполнения.ИсторияФильтрацииКонтейнеров;
	Расходы                      				= СтруктураПараметровПерезаполнения.Расходы;
	ПодсылПорожних               				= СтруктураПараметровПерезаполнения.ПодсылПорожних;
	ОбъектСсылка                 				= СтруктураПараметровПерезаполнения.ОбъектСсылка;
	ЕдиныйОтветственныйОтУчета   				= СтруктураПараметровПерезаполнения.ЕдиныйОтветственныйОтУчета;
	СтруктураДанныеПоЗапрещеннымДляПересчета 	= СтруктураПараметровПерезаполнения.СтруктураДанныеПоЗапрещеннымДляПересчета;
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, закомментировал
	////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	////ПользовательВыбралВсехКонтрагентов = Ложь; //используем для полного перезаполнения в случае замены заявок, строки в СУЕ нужно почистить
	//Если СтруктураПараметровПерезаполнения.Свойство("ПользовательВыбралВсехКонтрагентов") Тогда
	//	ПользовательВыбралВсехКонтрагентов = СтруктураПараметровПерезаполнения.ПользовательВыбралВсехКонтрагентов;
	//КонецЕсли;
	////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
		
	//Проверим рейсы:
	//1. в тч рейсов есть рейсы, причем ЖД рейс должен быть 1!
	//2. если они есть, то каждая заявка проверяется на соответствие одному из рейсов сделки

	////Евросиб - АСуслов 22.09.2022 13:35:20 #
	////(
	//Для каждого СтрокаСУЕ Из СвязьУчетныхЕдиниц Цикл
	//	Если НЕ ЗначениеЗаполнено(СтрокаСУЕ.ВидТранспортногоСообщения) Тогда
	//		СтрокаСУЕ.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД;
	//	КонецЕсли;
	//КонецЦикла;
	////)
	////Евросиб - АСуслов 22.09.2022 13:35:20 #	
	
	ЗаполненныеРанееДоплатныеКТК.Очистить();
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		
		Если 
			ЗначениеЗаполнено(Стр.Доплата_Клиент) И 
			ЗначениеЗаполнено(Стр.Доплата_Договор) И 
			ЗначениеЗаполнено(Стр.Доплата_ПСЦ) И 
			ЗначениеЗаполнено(Стр.Доплата_Калькуляция) И 
			ЗначениеЗаполнено(Стр.Доплата_Доплата) И 
			ЗначениеЗаполнено(Стр.Доплата_Валюта)  
		Тогда
			ЗаполненныеРанееДоплатныеКТК.Добавить(Стр.Контейнер);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ РазрешитьРейсыДругихСделок Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Рейсы.Рейс КАК Рейс
		               |ПОМЕСТИТЬ ПереченьРейсов
		               |ИЗ
		               |	&Рейсы КАК Рейсы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Заявки.Заявка КАК Заявка
		               |ПОМЕСТИТЬ ПереченьЗаявок
		               |ИЗ
		               |	&Заявки КАК Заявки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СделкаРейсы.Рейс КАК Рейс,
		               |	СделкаЗаявки.Заявка КАК Заявка
		               |ИЗ
		               |	ПереченьЗаявок КАК СделкаЗаявки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ПереченьРейсов КАК СделкаРейсы
		               |			ПО ЗаявкаПереченьРейсов.Рейс = СделкаРейсы.Рейс
		               |		ПО СделкаЗаявки.Заявка = ЗаявкаПереченьРейсов.Ссылка
		               |ГДЕ
		               |	НЕ СделкаРейсы.Рейс ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкаРейсы.Рейс) КАК КоличествоЖДРейсов
		               |ИЗ
		               |	ПереченьРейсов КАК СделкаРейсы
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)";
		Запрос.УстановитьПараметр("Рейсы", ОбъектРейсы);
		Запрос.УстановитьПараметр("Заявки", ОбъектЗаявки);
		МассивПакетов = Запрос.ВыполнитьПакет();
		Если МассивПакетов[3].Выгрузить()[0].КоличествоЖДРейсов > 1 Тогда
			Сообщить("В списке рейсов должен быть максимум 1 ЖД Рейс");
			Возврат;
		КонецЕсли; 
		
		Если МассивПакетов[2].Пустой() Тогда
			Сообщить("Рейсы сделки не обнаружены в связанных заявках, перезаполнение отменено!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РЗ = МорскиеРейсыЗаявок(ОбъектЗаявки);
	
	//Для каждого СтрокаТЧ Из СвязьУчетныхЕдиниц Цикл
	//	ЗаполнитьЗначенияСвойств(ВТ_СвязьУчетныхЕдиниц.Добавить(),СтрокаТЧ);
	//КонецЦикла;	
	
	МассивУдаляемых = Новый Массив;
	
	// Евросиб Фролов (14.10.2021 Ticket№ 40390
	// Подготовим массив для КТК, по которым сформированы закрывающие документы.
	// По этим КТК не нужно удалять строки из таблица заявок.
	//МассивГУИДСЗакрывающимиДокументами = Новый Массив; //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
	// Евросиб Фролов)                                                                                                            
	//СписокГУИДЗапрещенныхКПерезаполнению = ПолучитьСписокГУИДЗапрещенныхКПерезаполнению();    
	//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, начало  
	//СписокГУИДЗапрещенныхКПерезаполнению = ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц);
	//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, конец
	////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	//СписокГУИДЗапрещенныхКПерезаполнению = ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц,ОбъектЗаявки,ПользовательВыбралВсехКонтрагентов);
	////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
	СписокГУИДЗапрещенныхКПерезаполнению = ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц,ОбъектЗаявки);
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
	//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, начало
	//МассивГУИДСтрокЗаявокЗапрещенныхКПерезаполнению = Новый Массив; //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
	//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, конец
	
	//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, начало
	ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению = Новый ТаблицаЗначений;
	ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Колонки.Добавить("ГУИДСтрокиЗаявки", Метаданные.ОпределяемыеТипы.ГУИД.Тип);
	ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Колонки.Добавить("ВидТранспортногоСообщения", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТранспортныхСообщений"));
	//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, конец
	
	Для каждого СтрУдалить из СвязьУчетныхЕдиниц Цикл
		
		////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
		//Если НЕ ПользовательВыбралВсехКонтрагентов И ОбъектЗаявки.Найти(СтрУдалить.Заявка, "Заявка") = Неопределено Тогда
		//	Продолжить;
		//КонецЕсли;
		////ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
		
		//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
		Если ОбъектЗаявки.Найти(СтрУдалить.Заявка, "Заявка") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
		
		//ДИТ, Беляев СЮ, TA55125, 27-07-2022, начало
		Если НЕ ЗначениеЗаполнено(СтрУдалить.Заявка) И НЕ ЗначениеЗаполнено(СтрУдалить.ГУИДСтрокиЗаявки) Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, TA55125, 27-07-2022, конец
		
		// Евросиб Фролов (14.10.2021 Ticket№ 40390
		// При перезаполнении состава поезда строки с КТК, 
		// по которым сформированы закрывающие документы не должны изменяться.
		Если СтрУдалить.СформированыЗакрывающиеДокументы Тогда
			//МассивГУИДСЗакрывающимиДокументами.Добавить(СтрУдалить.ГУИДСтрокиЗаявки); //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сведения по контейнеру <%1> не перезаполнены, т.к. есть закрывающие документы.", СтрУдалить.Контейнер)); // Евросиб Фролов (17.02.2022 Ticket №0259955
			
			//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, начало
			НовСтрТЗ = ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Добавить();
			НовСтрТЗ.ГУИДСтрокиЗаявки = СтрУдалить.ГУИДСтрокиЗаявки;
			НовСтрТЗ.ВидТранспортногоСообщения = СтрУдалить.ВидТранспортногоСообщения;
			//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, конец
		    Продолжить;
		КонецЕсли;
		// Евросиб Фролов)
		//Евросиб - АСуслов 08.07.2022 15:56:29 #
		//(
		Если ЗначениеЗаполнено(СписокГУИДЗапрещенныхКПерезаполнению.Найти(СтрУдалить.ГУИД, "СтрокаСвязьУчетныхЕдиниц")) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сведения по контейнеру <%1> не перезаполнены, т.к. существуют строки в расходах, добавленные из акцептов или порожних сделок.", СтрУдалить.Контейнер)); // Евросиб Фролов (17.02.2022 Ticket №0259955
			//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, начало
			//МассивГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Добавить(СтрУдалить.ГУИДСтрокиЗаявки); //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
			//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, конец   		
			
			//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, начало
			НовСтрТЗ = ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Добавить();
			НовСтрТЗ.ГУИДСтрокиЗаявки = СтрУдалить.ГУИДСтрокиЗаявки;
			НовСтрТЗ.ВидТранспортногоСообщения = СтрУдалить.ВидТранспортногоСообщения;
			//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, конец
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 08.07.2022 15:56:29 #
		
		СтрНайдена = Ложь;
		Для каждого СтрРешение из ИсторияФильтрацииКонтейнеров Цикл
			Если СтрУдалить.Контейнер = СтрРешение.КТК И СтрУдалить.Заявка = СтрРешение.Заявка И СтрРешение.Решение <> 0 Тогда
				СтрНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;        
		
		Если СтрНайдена = Ложь Тогда МассивУдаляемых.Добавить(СтрУдалить); КонецЕсли;
	//Евросиб - АСуслов 22.09.2022 13:35:20 #
	//(
		Если НЕ ЗначениеЗаполнено(СтрУдалить.ВидТранспортногоСообщения) Тогда
			СтрУдалить.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД;
		КонецЕсли;
	//)
	//Евросиб - АСуслов 22.09.2022 13:35:20 #	
	КонецЦикла;
	
	Для каждого СтрУдалить из МассивУдаляемых Цикл
		СвязьУчетныхЕдиниц.Удалить(СтрУдалить);
	КонецЦикла;
	
	//Евросиб Каблов 28.06.2022 ( Task 53759
	Если ПодсылПорожних Тогда
		СписокЗаявок = ОбъектЗаявки.ВыгрузитьКолонку("Заявка");
		КалькуляцииСПодсылом = ПолучитьЗаявкиКалькуляцииСПодсылом(СписокЗаявок, "Калькуляция");
	КонецЕсли;
	//Евросиб Каблов 28.06.2022 )

	//Евросиб - АСуслов 21.09.2022 16:42:14 #56288
	//(
	ТаблицаВидовТранспортныхСообщенийПоСтрокамЗаявок = ПолучитьВидыТранспортныхСообщенийПоСтрокамЗаявок(ОбъектЗаявки);
	//)
	//Евросиб - АСуслов 21.09.2022 16:42:22 #56288
	
	//Для каждого ОбъектЗаявка из ОбъектЗаявки Цикл
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
	Для каждого ОбъектЗаявка из ОбъектЗаявки.НайтиСтроки(Новый Структура( "ЗаявкаПрисутствуетВТаблицеЗаявокСделки", Истина)) Цикл
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
			Для каждого СтрокаСоставУслуги из ОбъектЗаявка.Заявка.СоставУслуги Цикл
				
				//Евросиб Коханенко Н.А. 14.02.2025 (( #101467 
				//Если СтрокаСоставУслуги.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыСтрокЗаявки.ВРаботе") Тогда
				Если СтрокаСоставУслуги.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСтрокЗаявки.Черновик") Тогда
					Продолжить;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 14.02.2025 )) #101467 
				
				// Евросиб Фролов (14.10.2021 Ticket№ 40390
				// Если на этапе удаления КТК из состава поезда нашлись КТК с закрывающими документами,
				// то такие КТК находятся в массиве МассивКТКСЗакрывающиемиДокументами и они не были удалены.
				// По таким КТК заполнять данные не нужно, т.к. они не удалялись.
				//Если //МассивКТКСЗакрывающиемиДокументами.Найти(Стр2.НомерКТК) <> Неопределено 
				//	МассивГУИДСЗакрывающимиДокументами.Найти(СтрокаСоставУслуги.ГУИДСтроки) <> Неопределено Тогда
				
				//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, начало
				ВидыПеревозокПоСтрокеЗаявки = ТаблицаВидовТранспортныхСообщенийПоСтрокамЗаявок.НайтиСтроки(Новый Структура("ГУИДСтроки", СтрокаСоставУслуги.ГУИДСтроки));
				Для каждого СтрокаВидПеревозки Из ВидыПеревозокПоСтрокеЗаявки Цикл
					
				ОтборПоВидуСообщения = Новый Структура("ГУИДСтрокиЗаявки, ВидТранспортногоСообщения", СтрокаСоставУслуги.ГУИДСтроки, СтрокаВидПеревозки.ВидТранспортногоСообщения);
				ОтборПоПустомуВидуСообщения = Новый Структура("ГУИДСтрокиЗаявки, ВидТранспортногоСообщения", СтрокаСоставУслуги.ГУИДСтроки, Перечисления.ВидыТранспортныхСообщений.ПустаяСсылка());
				ЕстьСтрокиСВидомСообщения = ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.НайтиСтроки( ОтборПоВидуСообщения).Количество() > 0;
				ЕстьСтрокиБезВидаСообщения = ТаблицаГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.НайтиСтроки( ОтборПоПустомуВидуСообщения).Количество() > 0;
				ЗапретДобавления = ЕстьСтрокиСВидомСообщения ИЛИ ЕстьСтрокиБезВидаСообщения;
				Если ЗапретДобавления Тогда
	            //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, конец
					// Евросиб Фролов (14.11.2021 Ticket№ 0247498
					// Логвинова: разрешить обновление информации в сделке в столбце "Собственность перевозимого контейнера",
					// при условии, что в экономике сделки по данному КТК нет строки с номенклатурой услуги "Фрахт"  и заполненным полем "Уч.документ".
					// Перезаполняем только поле "СобственностьПеревозимогоКТК"
					Если СписокКТКФрахт.НайтиПоЗначению(СтрокаСоставУслуги.НомерКТК) = Неопределено Тогда
						СтрокаСостава = СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Контейнер", СтрокаСоставУслуги.НомерКТК));
						Если СтрокаСостава.Количество() > 0 Тогда
							// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
							//ок(
							//Если СтрокаСостава[0].СобственностьПеревозимогоКТК <> СтрокаСоставУслуги.СобственностьПеревозимогоКТК Тогда
							//	СтрокаСостава[0].СобственностьПеревозимогоКТК = СтрокаСоставУслуги.СобственностьПеревозимогоКТК;
							//ок)
							Если СтрокаСостава[0].УдалитьСобственностьПеревозимогоКТК <> СтрокаСоставУслуги.УдалитьСобственностьПеревозимогоКТК Тогда
								СтрокаСостава[0].УдалитьСобственностьПеревозимогоКТК = СтрокаСоставУслуги.УдалитьСобственностьПеревозимогоКТК;
							// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
								ТекстСообщения = СтрШаблон("По контейнеру <%1> перезаполнено значение ""Собственность перевозимого КТК"".", СтрокаСоставУслуги.НомерКТК);
								ОбщегоНазначения.СообщитьПользователю(
																ТекстСообщения,
																,
							// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
							//ок(
							//									ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаСостава[0].НомерСтроки, "СобственностьПеревозимогоКТК"),
							//ок)
																ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаСостава[0].НомерСтроки, "УдалитьСобственностьПеревозимогоКТК"),
							// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
																"Объект");
							КонецЕсли;									
							// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
							Если СтрокаСостава[0].ПринадлежностьТЕ <> СтрокаСоставУслуги.ПринадлежностьТЕ Тогда
								СтрокаСостава[0].ПринадлежностьТЕ = СтрокаСоставУслуги.ПринадлежностьТЕ;
								ТекстСообщения = СтрШаблон("По контейнеру <%1> перезаполнено значение ""Принадлежность"".", СтрокаСоставУслуги.НомерКТК);
								ОбщегоНазначения.СообщитьПользователю(
																ТекстСообщения,
																,
																ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаСостава[0].НомерСтроки, "ПринадлежностьТЕ"),
																"Объект");
							КонецЕсли;
							// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
						КонецЕсли;
					КонецЕсли;							
					// Евросиб Фролов)
					
					Продолжить;
				КонецЕсли;
				// Евросиб Фролов)
				
				// -> SIV 06-04-21 по КТК, по которым зафиксировано решение, не надо перезаполнять состав поезда. 
				// мы их либо сохранили на предыдущем шаге, либо удалили и зачем их еще раз добавлять.
				СтрНайдена = Ложь;
				Для каждого СтрРешение из ИсторияФильтрацииКонтейнеров Цикл
					Если СтрокаСоставУслуги.НомерКТК = СтрРешение.КТК И Стр.Заявка = СтрРешение.Заявка И СтрРешение.Решение <> 0 Тогда
						СтрНайдена = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если СтрНайдена = Истина Тогда Продолжить; КонецЕсли;
				// <-
				
				//Евросиб Каблов 28.06.2022 ( Task 53759
				Если ПодсылПорожних Тогда
					
					Если ЗначениеЗаполнено(СтрокаСоставУслуги.Калькуляция) Тогда
						ПроверяемаяКалькуляция = СтрокаСоставУслуги.Калькуляция;
					Иначе
						ПроверяемаяКалькуляция = Стр.Калькуляция;
					КонецЕсли;
					
					Если КалькуляцииСПодсылом.Найти(ПроверяемаяКалькуляция) = Неопределено Тогда
						ТекстСообщения = СтрШаблон("%1 не содержит в калькуляции признаков подсыла, поэтому не может быть добавлен в порожнюю сделку", СтрокаСоставУслуги.НомерКТК);	
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				//Евросиб Каблов 28.06.2022 )      
				
				//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, начало
				//Если МассивГУИДСтрокЗаявокЗапрещенныхКПерезаполнению.Найти(СтрокаСоставУслуги.ГУИДСтроки) <> Неопределено Тогда //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
				//	Продолжить;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, Ticket#0278739, 14-07-2022, конец
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("СвязьУчетныхЕдиниц", 				СвязьУчетныхЕдиниц);
				СтруктураПараметров.Вставить("ОбъектЗаявка", 					ОбъектЗаявка);
				СтруктураПараметров.Вставить("СтрокаСоставУслуги", 				СтрокаСоставУслуги);
				СтруктураПараметров.Вставить("РЗ", 								РЗ);
				СтруктураПараметров.Вставить("ОбъектСсылка", 					ОбъектСсылка);
				СтруктураПараметров.Вставить("ЗаполненныеРанееДоплатныеКТК", 	ЗаполненныеРанееДоплатныеКТК);
				//ВидыПеревозокПоСтрокеЗаявки = ТаблицаВидовТранспортныхСообщенийПоСтрокамЗаявок.НайтиСтроки(Новый Структура("ГУИДСтроки", СтрокаСоставУслуги.ГУИДСтроки)); //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
				//Для каждого СтрокаВидПеревозки Из ВидыПеревозокПоСтрокеЗаявки Цикл //ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, закомментировал
					ДобавитьСтрокуСоставаПоезда(СтруктураПараметров, СтрокаВидПеревозки.ВидТранспортногоСообщения);		
				КонецЦикла;
				//КонецЕсли;
			КонецЦикла;
	КонецЦикла;
	
	ОтветственныеПоДоговорам = Новый Массив;
	
	// единый ответственный учета
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 01.12.2022
		// Было:
		//Если ОтветственныеПоДоговорам.Найти(Стр.Договор.ОтветственныйЗаУчет) = неопределено Тогда ОтветственныеПоДоговорам.Добавить(Стр.Договор.ОтветственныйЗаУчет); КонецЕсли; 
		//Стало: 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор",				Стр.Договор);
		СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
		СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
		ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
		Если ОтветственныеПоДоговорам.Найти(ОтветственныйЗаУчет) = неопределено Тогда 
			ОтветственныеПоДоговорам.Добавить(ОтветственныйЗаУчет); 
		КонецЕсли;
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 01.12.2022
		
		
	КонецЦикла;
	
	Если ОтветственныеПоДоговорам.Количество() = 1 Тогда ЕдиныйОтветственныйОтУчета = ОтветственныеПоДоговорам[0]; КонецЕсли;
		
	СписокСделок = Новый Массив;
	Соответствие = Новый Массив;
	
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл		
		СписокСделок.Добавить(Стр.Заявка);
		Соответствие.Добавить(Новый Структура("Заявка, ГУИДСтрокиЗаявки, ГУИД", Стр.Заявка, Стр.ГУИДСтрокиЗаявки, Стр.ГУИД));
	КонецЦикла;
	
	ВосстановитьГУИДыСтрок(СвязьУчетныхЕдиниц,ВТ_СвязьУчетныхЕдиниц);
	// Евросиб US 84658 Рыбьяков К.А. 17.07.2024 ((
	ВосстановитьКоносаментыСтрок(СвязьУчетныхЕдиниц, ВТ_СвязьУчетныхЕдиниц);
	// Евросиб Рыбьяков К.А. 17.07.2024 ))
	
	Результат = ПолучитьВладельцевУказанныхКТКИзЗаявки(СписокСделок, Соответствие);
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл	
		Для каждого Стр2 из Результат Цикл
			Если Стр.Заявка = Стр2.Заявка 
				И Стр.ГУИДСтрокиЗаявки = Стр2.ГУИДСтроки Тогда 
				ЗаполнитьЗначенияСвойств(Стр, Стр2, "ВремяПрибытияНаТерминал");
				Прервать; 
			КонецЕсли;			
		КонецЦикла;	
	КонецЦикла;
	
	//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, начало
	СвязьУчетныхЕдиниц.Сортировать("Клиент, Договор, Заявка, Контейнер, ВидТранспортногоСообщения");
	//ДИТ, Беляев СЮ, Ticket#0299564, 02-02-2023, конец
	
	СписокСделок = Новый Массив;
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		СписокСделок.Добавить(Стр.Заявка);
	КонецЦикла;
	СписокСделок.Добавить(ОбъектСсылка); 
	
	Если ДинамоИсторияКонтейнеров <> Неопределено Тогда
		ДинамоИсторияКонтейнеров.Параметры.УстановитьЗначениеПараметра("Сделка", СписокСделок); 
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьСтруктуруПараметровДляПерезаполненияСделки(СделкаОб, СписокКонтрагентовДляПерезаполнения = Неопределено) Экспорт
	
		ЗаполненныеРанееДоплатныеКТК = Новый СписокЗначений;
		СписокКТКФрахт               = Новый СписокЗначений;
		ДинамоИсторияКонтейнеров     = Неопределено;
		
		СвязьУчетныхЕдиниц = СделкаОб.СвязьУчетныхЕдиниц.Выгрузить();
		Если СвязьУчетныхЕдиниц.Колонки.Найти("СформированыЗакрывающиеДокументы") = Неопределено Тогда
			СвязьУчетныхЕдиниц.Колонки.Добавить("СформированыЗакрывающиеДокументы",Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура("ОбъектДоходыКТК,ОбъектДоходы,ОбъектСвязьДоходовИРасходов,ОбъектСвязьУчетныхЕдиниц,СписокКТКФрахт",
												СделкаОб.ДоходыКТК,
												СделкаОб.Доходы,
												СделкаОб.СвязьДоходовИРасходов,
												СвязьУчетныхЕдиниц,
												СписокКТКФрахт);
		
		ЗаполнитьКолонкуСформированыЗакрывающиеДокументы(СтруктураПараметров);
		СвязьУчетныхЕдиниц = СтруктураПараметров.ОбъектСвязьУчетныхЕдиниц;
		СписокКТКФрахт     = СтруктураПараметров.СписокКТКФрахт;
		//СтруктураПараметров = Новый Структура("ЗаполненныеРанееДоплатныеКТК,ВТ_СвязьУчетныхЕдиниц,СписокКТКФрахт,ДинамоИсторияКонтейнеров,ОбъектРейсы,ОбъектЗаявки,СвязьУчетныхЕдиниц,РазрешитьРейсыДругихСделок,ИсторияФильтрацииКонтейнеров,Расходы,ПодсылПорожних,ОбъектСсылка,ЕдиныйОтветственныйОтУчета",
		//										ЗаполненныеРанееДоплатныеКТК,
		//										ВТ_СвязьУчетныхЕдиниц,
		//										СписокКТКФрахт,
		//										ДинамоИсторияКонтейнеров,
		//										СделкаОб.Рейсы.Выгрузить(),
		//										СделкаОб.Заявки.Выгрузить(),
		//										СвязьУчетныхЕдиниц,
		//										СделкаОб.РазрешитьРейсыДругихСделок,
		//										СделкаОб.ИсторияФильтрацииКонтейнеров,
		//										СделкаОб.Расходы.Выгрузить(),
		//										СделкаОб.ПодсылПорожних,
		//										СделкаОб.Ссылка,
		//										СделкаОб.ЕдиныйОтветственныйОтУчета);									
		СтруктураПараметров = Новый Структура("ЗаполненныеРанееДоплатныеКТК,СписокКТКФрахт,ДинамоИсторияКонтейнеров,ОбъектРейсы,ОбъектЗаявки,СвязьУчетныхЕдиниц,РазрешитьРейсыДругихСделок,ИсторияФильтрацииКонтейнеров,Расходы,ПодсылПорожних,ОбъектСсылка,ЕдиныйОтветственныйОтУчета",
												ЗаполненныеРанееДоплатныеКТК,
												СписокКТКФрахт,
												ДинамоИсторияКонтейнеров,
												СделкаОб.Рейсы.Выгрузить(),
												СделкаОб.Заявки.Выгрузить(),
												СвязьУчетныхЕдиниц,
												СделкаОб.РазрешитьРейсыДругихСделок,
												СделкаОб.ИсторияФильтрацииКонтейнеров,
												СделкаОб.Расходы.Выгрузить(),
												СделкаОб.ПодсылПорожних,
												СделкаОб.Ссылка,
												СделкаОб.ЕдиныйОтветственныйОтУчета);                                 
		СтруктураПараметров.Вставить("СтруктураДанныеПоЗапрещеннымДляПересчета", Новый Структура("МассивДобавленоИзАкцепта, МассивОбъединениеПорожнейИГруженойСделок", Новый Массив, Новый Массив));

		ЗаполнитьПараметрыЗаполненияПоКонтрагенту(СделкаОб, СтруктураПараметров, СписокКонтрагентовДляПерезаполнения);	
		
		Возврат СтруктураПараметров;	
	
	
КонецФункции 

Функция ЗаполнитьПараметрыЗаполненияПоКонтрагенту(СделкаОбъект, СтруктураПараметров, СписокКонтрагентовДляПерезаполнения = Неопределено) Экспорт
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//	|	СделкаЗаявки.Заявка КАК Заявка,
	//	|	СделкаЗаявки.Калькуляция КАК Калькуляция
	//	|ПОМЕСТИТЬ ВТЗаявки
	//	|ИЗ
	//	|	Документ.Сделка.Заявки КАК СделкаЗаявки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТЗаявки.Заявка КАК Заявка,
	//	|	ВТЗаявки.Калькуляция КАК Калькуляция
	//	|ИЗ
	//	|	ВТЗаявки КАК ВТЗаявки
	//	|ГДЕ
	//	|	ИСТИНА	
	//	|	И ВТЗаявки.Заявка.Контрагент В(&СписокКонтрагентовДляПерезаполнения)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВТЗаявки.Заявка.Контрагент КАК ЗаявкаКонтрагент
	//	|ИЗ
	//	|	ВТЗаявки КАК ВТЗаявки";
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаЗаявки.Заявка КАК Заявка,
		|	СделкаЗаявки.Калькуляция КАК Калькуляция
		|ПОМЕСТИТЬ ВТЗаявки
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТЗаявкиИзСУЕ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаявки.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТЗаявкиВСЕ
		|ИЗ
		|	ВТЗаявки КАК ВТЗаявки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТЗаявкиИзСУЕ.Заявка
		|ИЗ
		|	ВТЗаявкиИзСУЕ КАК ВТЗаявкиИзСУЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаявки.Заявка КАК Заявка,
		|	МАКСИМУМ(ВТЗаявки.Калькуляция) КАК Калькуляция
		|ПОМЕСТИТЬ ВТЗаявкиСПервойКалькуляцией
		|ИЗ
		|	ВТЗаявки КАК ВТЗаявки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗаявки.Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаявкиВСЕ.Заявка КАК Заявка,
		|	ВТЗаявкиСПервойКалькуляцией.Калькуляция КАК Калькуляция,
		|	ВЫБОР
		|		КОГДА ВТЗаявкиСПервойКалькуляцией.Заявка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаявкаПрисутствуетВТаблицеЗаявокСделки
		|ИЗ
		|	ВТЗаявкиВСЕ КАК ВТЗаявкиВСЕ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаявкиСПервойКалькуляцией КАК ВТЗаявкиСПервойКалькуляцией
		|		ПО (ВТЗаявкиСПервойКалькуляцией.Заявка = ВТЗаявкиВСЕ.Заявка)
		|ГДЕ
		|	ИСТИНА
		|	И ВТЗаявкиВСЕ.Заявка.Контрагент В(&СписокКонтрагентовДляПерезаполнения)";
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Заявки", "&Заявки");
	Запрос.УстановитьПараметр("Заявки", СделкаОбъект.Заявки.Выгрузить());
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить());
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
	Если СписокКонтрагентовДляПерезаполнения = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВТЗаявкиВСЕ.Заявка.Контрагент В(&СписокКонтрагентовДляПерезаполнения)", "");		
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокКонтрагентовДляПерезаполнения", СписокКонтрагентовДляПерезаполнения);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
	//ТЗЗаявкиДляПерезаполнения = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2].Выгрузить();
	//ПользовательВыбралВсехКонтрагентов = СписокКонтрагентовДляПерезаполнения = Неопределено ИЛИ РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выгрузить().Количество() = СписокКонтрагентовДляПерезаполнения.Количество();
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, начало
	ТЗЗаявкиДляПерезаполнения = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выгрузить();
	//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, конец
	
	СтруктураПараметров.Вставить("ОбъектЗаявки",ТЗЗаявкиДляПерезаполнения);
	//СтруктураПараметров.Вставить("ПользовательВыбралВсехКонтрагентов",ПользовательВыбралВсехКонтрагентов); //ДИТ, Беляев СЮ, ТА62590, 08-12-2022, закомментировано
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
КонецФункции
	
//Евросиб Каблов 10.06.2025 #111512
Процедура ЗаполнитьРейсыВСоставеПоезда(ОбъектСделка, ВыполненыИзменения = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	//Евросиб СубботинВ #124205 27.11.2025 Начало 
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН
	//|ПОМЕСТИТЬ ТаблицаКонтейнеров
	//|ИЗ
	//|	&ТаблицаКонтейнеров КАК СделкаСвязьУчетныхЕдиниц
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаКонтейнеров.Контейнер КАК Контейнер,
	//|	ТаблицаКонтейнеров.ЖДН КАК ЖДН,
	//|	ТЕ.Наименование КАК НомерКонтейнера,
	//|	ТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерЖДН
	//|ПОМЕСТИТЬ Контейнеры
	//|ИЗ
	//|	ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	//|		ПО ТаблицаКонтейнеров.Контейнер = ТЕ.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	//|		ПО ТаблицаКонтейнеров.ЖДН = ТранспортныйДокумент.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Контейнеры.Контейнер КАК Контейнер,
	//|	Контейнеры.ЖДН КАК ЖДН,
	//|	РейсыЖДФактическийСоставПоезда.Ссылка КАК Рейс,
	//|	РейсыЖДФактическийСоставПоезда.Ссылка.ДатаОтправления КАК ДатаОтправления,
	//|	РейсыЖДФактическийСоставПоезда.Ссылка.ДатаОтправленияФакт КАК ДатаОтправленияФакт
	//|ИЗ
	//|	Контейнеры КАК Контейнеры
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
	//|		ПО Контейнеры.НомерКонтейнера = РейсыЖДФактическийСоставПоезда.НомерКонтейнера
	//|			И Контейнеры.НомерЖДН = РейсыЖДФактическийСоставПоезда.НомерНакладной
	//|ГДЕ
	//|	НЕ РейсыЖДФактическийСоставПоезда.Ссылка.ПометкаУдаления
	//|	И НЕ РейсыЖДФактическийСоставПоезда.Ссылка.РейсОтменен
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаОтправленияФакт УБЫВ,
	//|	ДатаОтправления УБЫВ";
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН
	|ПОМЕСТИТЬ ТаблицаКонтейнеров
	|ИЗ
	|	&ТаблицаКонтейнеров КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонтейнеров.Контейнер КАК Контейнер,
	|	ТаблицаКонтейнеров.ЖДН КАК ЖДН,
	|	ТЕ.Наименование КАК НомерКонтейнера,
	|	ТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерЖДН
	|ПОМЕСТИТЬ Контейнеры
	|ИЗ
	|	ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО ТаблицаКонтейнеров.Контейнер = ТЕ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО ТаблицаКонтейнеров.ЖДН = ТранспортныйДокумент.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контейнеры.Контейнер КАК Контейнер,
	|	Контейнеры.ЖДН КАК ЖДН,
	|	РейсыЖДФактическийСоставПоезда.Ссылка КАК Рейс,
	|	РейсыЖДФактическийСоставПоезда.Ссылка.ДатаОтправления КАК ДатаОтправления,
	|	РейсыЖДФактическийСоставПоезда.Ссылка.ДатаОтправленияФакт КАК ДатаОтправленияФакт,
	|	ТС.Ссылка КАК ВагонПослеПерегруза
	|ИЗ
	|	Контейнеры КАК Контейнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.РеестрКонтейнеров КАК РейсыЖДРеестрКонтейнеров
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|				ПО РейсыЖДРеестрКонтейнеров.ВагонПослеПерегруза = ТС.Наименование
	|					И (НЕ ТС.ПометкаУдаления)
	|					И (НЕ РейсыЖДРеестрКонтейнеров.ВагонПослеПерегруза = """")
	|			ПО РейсыЖДФактическийСоставПоезда.Ссылка = РейсыЖДРеестрКонтейнеров.Ссылка
	|				И РейсыЖДФактическийСоставПоезда.НомерКонтейнера = РейсыЖДРеестрКонтейнеров.НомерКонтейнера
	|		ПО Контейнеры.НомерКонтейнера = РейсыЖДФактическийСоставПоезда.НомерКонтейнера
	|			И Контейнеры.НомерЖДН = РейсыЖДФактическийСоставПоезда.НомерНакладной
	|ГДЕ
	|	НЕ РейсыЖДФактическийСоставПоезда.Ссылка.ПометкаУдаления
	|	И НЕ РейсыЖДФактическийСоставПоезда.Ссылка.РейсОтменен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправленияФакт УБЫВ,
	|	ДатаОтправления УБЫВ";

	
	//Евросиб СубботинВ #124205 27.11.2025 Конец 
	
	ТаблицаКонтейнеров = ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить(, "Контейнер, ЖДН");
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	
	ПустаяДата = '00010101';
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	РейсыЖДПустаяСсылка = Справочники.РейсыЖД.ПустаяСсылка();
	
	ТаблицаРейсов = Запрос.Выполнить().Выгрузить();
	ТаблицаРейсов.Индексы.Добавить("Контейнер, ЖДН");
	ПараметрыПоиска = Новый Структура("Контейнер, ЖДН");
	
	Для Каждого Стр из ОбъектСделка.СвязьУчетныхЕдиниц Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, Стр);
		НайденныеСтроки = ТаблицаРейсов.НайтиСтроки(ПараметрыПоиска);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Если Стр.ЖДРейс <> НайденныеСтроки[0].Рейс Тогда
				Стр.ЖДРейс = НайденныеСтроки[0].Рейс;
				ВыполненыИзменения = Истина;
			КонецЕсли;
			//Евросиб СубботинВ #124205 27.11.2025 Начало
			Если ЗначениеЗаполнено(НайденныеСтроки[0].ВагонПослеПерегруза) Тогда
				Стр.ФТГПослеПерегруза = НайденныеСтроки[0].ВагонПослеПерегруза;
				ВыполненыИзменения = Истина;
			ИначеЕсли ЗначениеЗаполнено(Стр.ФТГПослеПерегруза) Тогда
				Стр.ФТГПослеПерегруза = Неопределено;				
				ВыполненыИзменения = Истина;
			КонецЕсли;
			//Евросиб СубботинВ #124205 27.11.2025 Конец			
		Иначе
			Если Стр.ЖДРейс <> РейсыЖДПустаяСсылка Тогда
				Стр.ЖДРейс = РейсыЖДПустаяСсылка;
				ВыполненыИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
		
КонецПроцедуры
	


//Евросиб - АСуслов 21.09.2022 15:14:31 #56288
//(             
Функция ПолучитьВидыТранспортныхСообщенийПоСтрокамЗаявок(СписокЗаявок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	// Евросиб US 86792 Рыбьяков К.А. 08.07.2024 ((
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
	|	ВЫБОР
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ КалькуляцияЖД_УслугиВнеСтавки.ИдентификаторСтроки ЕСТЬ НЕ NULL  
	|				ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ИдентификаторСтроки ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК ВидТранспортногоСообщения,
	|	1 КАК Сортировка
	//|	ВЫБОР
	//|		КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	//|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ИтогоСтавка20
	//|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ИтогоСтавка
	//|	КОНЕЦ КАК Поле1,
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ИтогоСтавка КАК ММ_ИтогоСтавка
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|			ПО (ДокументКалькуляция.Ссылка = КалькуляцияЖД_УслугиВнеСтавки.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|			ПО (ДокументКалькуляция.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка)
	// Евросиб Рыбьяков К.А. 08.07.2024 ))
	|		ПО (ЗаявкаСоставУслуги.Калькуляция = ДокументКалькуляция.Ссылка)
	//БИТ Белинский Д.А. 18.04.2023 -начало TASK 66201
	|	И ((КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции В(&МежсервисныеРасходы) И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Контрагент = &КонтрагентДКП) Или
	//БИТ Белинский Д.А. 18.04.2023 -конец TASK 66201
	////Евросиб - АСуслов 04.01.2023 11:06:57 #63213
	//|			 (ВЫБОР
	//|				КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	//|					ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ИтогоСтавка20
	//|				ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ИтогоСтавка
	//|			КОНЕЦ > 0))
	////)
	////Евросиб - АСуслов 04.01.2023 11:06:59 #63213
	//ДИТ, Беляев СЮ, Ticket#0328878, 18-10-2023, начало
	|	(ВЫБОР
	|		КОГДА ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|			ИЛИ ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|				ТОГДА ДокументКалькуляция.ММ_ИтогоСтавка
	|					КОГДА ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|						ТОГДА ДокументКалькуляция.ММ_ИтогоСтавка20
	|					ИНАЧЕ ДокументКалькуляция.ММ_ИтогоСтавка
	|		КОНЕЦ >= 0))
	//ДИТ, Беляев СЮ, Ticket#0328878, 18-10-2023, конец
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка В (&СписокЗаявок)
	// Евросиб US 86792 Рыбьяков К.А. 08.07.2024 ((
	|	И ДокументКалькуляция.ОтсутствуетПеревозкаПоЖД = ЛОЖЬ
	// Евросиб Рыбьяков К.А. 08.07.2024 ))
	// Евросиб(ДИТ) Ticket#0371272 Сержантова А.С. Начало: 15.10.2024
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	//|	И ДокументКалькуляция.ТипКалькуляции <> &ТипКалькуляцииСубсидии  
	|	И НЕ ДокументКалькуляция.ТипКалькуляции В (&ТипКалькуляцииСубсидии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	// Евросиб(ДИТ) Ticket#0371272 Сержантова А.С. Конец: 15.10.2024
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.ГУИДСтроки,
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|	КОНЕЦ,
	|	2
	//|	NULL,
	//|	NULL
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ЗаявкаСоставУслуги.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка В(&СписокЗаявок)  
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Начало: 03.06.2024   
	|
	|	ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.ГУИДСтроки,
	|	Неопределено,
	|	3
	//|	NULL,
	//|	NULL
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияПоСубсидии
	|		ПО (ЗаявкаСоставУслуги.Калькуляция = КалькуляцияПоСубсидии.Ссылка)
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка В (&СписокЗаявок)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	//|	И КалькуляцияПоСубсидии.ТипКалькуляции = &ТипКалькуляцииСубсидии
	|	И КалькуляцияПоСубсидии.ТипКалькуляции В (&ТипКалькуляцииСубсидии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Конец: 03.06.2024
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГУИДСтроки,
	|	Сортировка";
	Запрос.УстановитьПараметр("СписокЗаявок", СписокЗаявок.ВыгрузитьКолонку("Заявка"));
	//БИТ Белинский Д.А. 17.04.2023 -начало TASK 66201 
	МежсервисныеРасходы = Новый Массив;
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("МежсервисныеРасходы", МежсервисныеРасходы);
	Запрос.УстановитьПараметр("КонтрагентДКП", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());
	//БИТ Белинский Д.А. 17.04.2023 -конец TASK 66201   
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Начало: 03.06.2024
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	//Запрос.УстановитьПараметр("ТипКалькуляцииСубсидии", Перечисления.ТипыКалькуляций.Субсидии);
	мТипКалькуляций = Новый Массив;
	мТипКалькуляций.Добавить(Перечисления.ТипыКалькуляций.Субсидии);
	мТипКалькуляций.Добавить(Перечисления.ТипыКалькуляций.Премии);
	Запрос.УстановитьПараметр("ТипКалькуляцииСубсидии", мТипКалькуляций);
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Конец: 03.06.2024
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции


Процедура ДобавитьСтрокуСоставаПоезда(СтруктураПараметров, ВидТранспортногоСообщения)
	СвязьУчетныхЕдиниц = СтруктураПараметров.СвязьУчетныхЕдиниц;
	ОбъектЗаявка = СтруктураПараметров.ОбъектЗаявка;
	СтрокаСоставУслуги = СтруктураПараметров.СтрокаСоставУслуги;
	РЗ = СтруктураПараметров.РЗ;
	ОбъектСсылка = СтруктураПараметров.ОбъектСсылка;
	ЗаполненныеРанееДоплатныеКТК = СтруктураПараметров.ЗаполненныеРанееДоплатныеКТК;
	НСтр = СвязьУчетныхЕдиниц.Добавить();
	НСтр.ВидТранспортногоСообщения = ВидТранспортногоСообщения;
	НСтр.Заявка = ОбъектЗаявка.Заявка;
	ЗаполнитьЗначенияСвойств(НСтр, ОбъектЗаявка);
	НСтр.Контейнер = СтрокаСоставУслуги.НомерКТК;
	НСтр.Протокол = СтрокаСоставУслуги.ПСЦ;
	НСтр.Клиент = ОбъектЗаявка.Заявка.Контрагент;
	НСтр.ПравилоГотовностиКВыставлению = Перечисления.ПравилоГотовностиКВыставлению.Вручную;
	НСтр.Договор = ОбъектЗаявка.Заявка.Договор;
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
	// Было:
	//НСтр.Груз = СтрокаСоставУслуги.Груз;
	//Стало:
	НСтр.Груз = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСоставУслуги.КлючАналитикиПеревозки,"Груз");
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
	НСтр.ВесГрузаНетто = СтрокаСоставУслуги.ВесГрузаНетто;
	НСтр.Груженый = СтрокаСоставУслуги.Груженый;
	НСтр.УсловияПеревозки = СтрокаСоставУслуги.Калькуляция.УсловияПеревозки_Отправление;
	НСтр.УсловияПеревозкиНазначение = СтрокаСоставУслуги.Калькуляция.УсловияПеревозки_Прибытие;
	НСтр.Калькуляция = ОбъектЗаявка.Калькуляция;
	НСтр.РазмерКТК = СтрокаСоставУслуги.РазмерКТК;
	нСтр.Коносамент = СтрокаСоставУслуги.Коносамент;
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//нСтр.СобственностьПеревозимогоКТК = СтрокаСоставУслуги.СобственностьПеревозимогоКТК;
	//ок)
	нСтр.УдалитьСобственностьПеревозимогоКТК = СтрокаСоставУслуги.УдалитьСобственностьПеревозимогоКТК;
	нСтр.ПринадлежностьТЕ = СтрокаСоставУслуги.ПринадлежностьТЕ;
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	НСтр.СтокСДачиПорожнего = СтрокаСоставУслуги.СтокСдачиПорожнего;
	нСтр.НеАктивна = ЗначениеЗаполнено(СтрокаСоставУслуги.ПеренесенВЗаявку);
	
	Если ЗаполненныеРанееДоплатныеКТК.НайтиПоЗначению(НСтр.Контейнер) <> Неопределено
		И ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД Тогда
		РезЗапросаДоплаты = ПолучитьДанныеДоплаты(СтрокаСоставУслуги.НомерКТК, СтрокаСоставУслуги.ДатаВыдачи, ОбъектСсылка);
		ЗаполнитьЗначенияСвойств(НСтр, РезЗапросаДоплаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаСоставУслуги.Калькуляция) тогда
		НСтр.Калькуляция = СтрокаСоставУслуги.Калькуляция;
		// заполнение по калькуляции порта отправления или назначения (если это одно значение, а не список, то подставляем по умолчанию)
		Если НСтр.Калькуляция.ФрахтИмпорт Тогда
			Если НСтр.Калькуляция.НФ_ПортыОтправленияНазначения.Количество() = 1 Тогда
				НСтр.ПортОтправления = НСтр.Калькуляция.НФ_ПортыОтправленияНазначения[0].Порт;
			КонецЕсли;
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
			Если НСтр.Калькуляция.ММ_ПортыОтправленияНазначения.Количество() = 1 Тогда
				НСтр.ПортНазначения = НСтр.Калькуляция.ММ_ПортыОтправленияНазначения[0].Порт;
			КонецЕсли;
			//НСтр.ПортНазначения = НСтр.Калькуляция.ММ_ПортОтправления;
			// Евросиб Рыбьяков К.А. 18.09.2024 ))
		Иначе
			Если НСтр.Калькуляция.НФ_ПортыОтправленияНазначения.Количество() = 1 Тогда
				НСтр.ПортНазначения = НСтр.Калькуляция.НФ_ПортыОтправленияНазначения[0].Порт;
			КонецЕсли;
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
			Если НСтр.Калькуляция.ММ_ПортыОтправленияНазначения.Количество() = 1 Тогда
				НСтр.ПортОтправления = НСтр.Калькуляция.ММ_ПортыОтправленияНазначения[0].Порт;
			КонецЕсли;
			//НСтр.ПортОтправления = НСтр.Калькуляция.ММ_ПортОтправления;
			// Евросиб Рыбьяков К.А. 18.09.2024 ))
		КонецЕсли;
	КонецЕсли;
	НСтр.Вагон = СтрокаСоставУслуги.Вагон;
	//ДИТ, Беляев СЮ, Ticket#0307708, 14-04-2023, начало
	Если ЗначениеЗаполнено(НСтр.Коносамент) Тогда
		РеквизитыКоносамента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НСтр.Коносамент,"МорскойРейс,СтанцияОтправления,СтанцияНазначения, МестоПолученияГруза, МестоПоставкиГруза");
		НСтр.МорскойРейс = РеквизитыКоносамента.МорскойРейс;         
		НСтр.ПортОтправления =  ?(ЗначениеЗаполнено(РеквизитыКоносамента.СтанцияОтправления),РеквизитыКоносамента.СтанцияОтправления,НСтр.ПортОтправления);
		НСтр.ПортНазначения = ?(ЗначениеЗаполнено(РеквизитыКоносамента.СтанцияНазначения),РеквизитыКоносамента.СтанцияНазначения,НСтр.ПортНазначения); 
	Иначе
	//ДИТ, Беляев СЮ, Ticket#0307708, 14-04-2023, конец
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерКТК",НСтр.Контейнер);
		ПараметрыОтбора.Вставить("Заявка",ОбъектЗаявка.Заявка);
		НайденныеСтроки = РЗ.НайтиСтроки(ПараметрыОтбора);
		// проверяем наличие КТК в результате запроса. Если есть и заявка та самая, то указываем морской рейс
		// (запрос упорядочен по дате коносамента => берем самый новый)
		Если НайденныеСтроки.Количество()>0 Тогда
			НСтр.МорскойРейс = НайденныеСтроки[0].МорскойРейс;
			НСтр.Коносамент = НайденныеСтроки[0].Коносамент;
			НСтр.ПортОтправления = ?(ЗначениеЗаполнено(НайденныеСтроки[0].СтанцияОтправления),НайденныеСтроки[0].СтанцияОтправления,НСтр.ПортОтправления);
			НСтр.ПортНазначения = ?(ЗначениеЗаполнено(НайденныеСтроки[0].СтанцияНазначения),НайденныеСтроки[0].СтанцияНазначения,НСтр.ПортНазначения);
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб Фролов (23.12.2021 TASK №44661
	НСтр.ГУИДСтрокиЗаявки = СтрокаСоставУслуги.ГУИДСтроки;
	// Евросиб Фролов)
КонецПроцедуры

//)
//Евросиб - АСуслов 21.09.2022 15:14:41 #56288

Функция МорскиеРейсыЗаявок(СделкаЗаявки) Экспорт
	
	// Получим все морские рейсы на все заявки из сделки.
	
	МассивЗаявок = СделкаЗаявки.ВыгрузитьКолонку("Заявка");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК,
	|	ЗаявкаПереченьРейсов.Ссылка КАК Заявка,
	|	ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс КАК МорскойРейс,
	|	ТранспортныйДокументКоносаменты.Ссылка КАК Коносамент,
	|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
	|	ТранспортныйДокументКоносаменты.Ссылка.СтанцияНазначения КАК СтанцияНазначения, 
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 05.11.2024
	|	ТранспортныйДокументКоносаменты.Ссылка.МестоПолученияГруза КАК ТерминалОтправления,
	|	ТранспортныйДокументКоносаменты.Ссылка.МестоПоставкиГруза КАК ТерминалНазначения
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 05.11.2024
	|ИЗ
	|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	|		ПО ЗаявкаПереченьРейсов.Рейс = ТранспортныйДокументКоносаменты.Ссылка.МорскойРейс    
	//// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 05.11.2024
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеМорскихРейсов КАК ДанныеМорскихРейсов
	//|		ПО ЗаявкаПереченьРейсов.Рейс = ДанныеМорскихРейсов.МорскойРейс 
	//// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 05.11.2024
	|ГДЕ
	|	ЗаявкаПереченьРейсов.Ссылка В(&МассивЗаявок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортныйДокументКоносаменты.Ссылка.ДатаТранспортногоДокумента УБЫВ";
	
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

//Функция ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц)
//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, добавлены параметры: ОбъектЗаявки, ПользовательВыбралВсехКонтрагентов 
//Функция ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц,ОбъектЗаявки,ПользовательВыбралВсехКонтрагентов)
//ДИТ, Беляев СЮ, ТА62590, 08-12-2022, убран параметр ПользовательВыбралВсехКонтрагентов
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, изменил область видимости функции (добавил Экспорт)
Функция ПолучитьСписокГУИДЗапрещенныхКПерезаполнению(СтруктураДанныеПоЗапрещеннымДляПересчета,Расходы,СвязьУчетныхЕдиниц,ОбъектЗаявки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	//|ПОМЕСТИТЬ ВТ_Расходы
	//|ИЗ
	//|	Документ.Сделка.Расходы КАК СделкаРасходы
	
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	"ВЫБРАТЬ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	// Евросиб US 114964 TA 114988 Рыбьяков К.А. 01.10.2025 ((
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена
	// Евросиб Рыбьяков К.А. 01.10.2025 ))
	|ПОМЕСТИТЬ ВТ_ВсеРасходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	//ДИТ, Беляев СЮ, Ticket#0282283, 29-08-2022, начало
	//|ГДЕ
	// Евросиб US 114964 TA 114988 Рыбьяков К.А. 01.10.2025 (( закомментировал, перенес ниже
	//|	НЕ СделкаРасходы.УслугаОтключена   
	// Евросиб Рыбьяков К.А. 01.10.2025 ))
	//ДИТ, Беляев СЮ, Ticket#0282283, 29-08-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_ГУИДдляПерезаполнения
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ СделкаСвязьУчетныхЕдиниц.Заявка В(&ЗаявкиДляПерезаполнения) 
	//|	 ИЛИ &ПользовательВыбралВсехКонтрагентов //ДИТ, Беляев СЮ, ТА62590, 08-12-2022, закомментировал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ВТ_ВсеРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_ВсеРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	ВТ_ВсеРасходы КАК ВТ_ВсеРасходы
	|ГДЕ ВТ_ВсеРасходы.СтрокаСвязьУчетныхЕдиниц В(ВЫБРАТЬ ВТ_ГУИДдляПерезаполнения.ГУИД ИЗ ВТ_ГУИДдляПерезаполнения КАК ВТ_ГУИДдляПерезаполнения)
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
	// Евросиб US 114964 TA 114988 Рыбьяков К.А. 01.10.2025 ((
	|	И НЕ ВТ_ВсеРасходы.УслугаОтключена
	// Евросиб Рыбьяков К.А. 01.10.2025 ))
	|;
	|
	// Евросиб US 114964 TA 114988 Рыбьяков К.А. 01.10.2025 ((
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ВТ_ВсеРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_ВсеРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_РасходыПоОбъедененнымСделкам
	|ИЗ
	|	ВТ_ВсеРасходы КАК ВТ_ВсеРасходы
	|ГДЕ
	|	ВТ_ВсеРасходы.СтрокаСвязьУчетныхЕдиниц В
	|			(ВЫБРАТЬ
	|				ВТ_ГУИДдляПерезаполнения.ГУИД
	|			ИЗ
	|				ВТ_ГУИДдляПерезаполнения КАК ВТ_ГУИДдляПерезаполнения)
	|;
	| 
	// Евросиб Рыбьяков К.А. 01.10.2025 ))
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая В(&ИсточникиПоявленияСтрокиЭкономики)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникиПоявленияСтрокиЭкономики) 
	//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, начало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|ГДЕ
	|	НЕ ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц В
	|				(ВЫБРАТЬ
	|					ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц
	|				ИЗ
	|					ВТ_Расходы КАК ВТ_Расходы
	|				ГДЕ
	|					ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики В (&ИсточникиПриоритетПередРасходамиИзАкцепта))
	|	И НЕ ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц В (&МассивГУИДСформированыЗакрывающиеДокументы) 
	|	И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики_Старая = &ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта
	|			ИЛИ ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	// Евросиб US 114964 TA 114988 Рыбьяков К.А. 01.10.2025 ((
	|	ВТ_РасходыПоОбъедененнымСделкам КАК ВТ_Расходы
	//|	ВТ_Расходы КАК ВТ_Расходы
	// Евросиб Рыбьяков К.А. 01.10.2025 ))
	|ГДЕ
	|	НЕ ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц В
	|				(ВЫБРАТЬ
	|					ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц
	|				ИЗ
	|					ВТ_Расходы КАК ВТ_Расходы
	|				ГДЕ
	|					ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики В (&ИсточникиПриоритетПередРасходамиОбъединениеСделок))
	|	И НЕ ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц В (&МассивГУИДСформированыЗакрывающиеДокументы)
	|	И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики_Старая = &ИсточникПоявленияСтрокиЭкономики_ОбъединениеПорожнейИГруженойСделок
	|			ИЛИ ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономики_ОбъединениеПорожнейИГруженойСделок)";
    //ДИТ, Беляев СЮ, ТА54910, 19-07-2022, конец
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	массивИсточниковПоявленияСтрокиЭкономики = Новый Массив;
	//массивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта); //ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, закомментировано (блокировка отключена)
	массивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок);
	массивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПеремещениеКТК);
	//Запрос.УстановитьПараметр("Расходы", Расходы.Скопировать(,"ИсточникПоявленияСтрокиЭкономики_Старая, ИсточникПоявленияСтрокиЭкономики, СтрокаСвязьУчетныхЕдиниц"));
	//ДИТ, Беляев СЮ, Ticket#0282283, 29-08-2022, начало	
	Запрос.УстановитьПараметр("Расходы", Расходы.Скопировать(,"ИсточникПоявленияСтрокиЭкономики_Старая, ИсточникПоявленияСтрокиЭкономики, СтрокаСвязьУчетныхЕдиниц, УслугаОтключена"));
	//ДИТ, Беляев СЮ, Ticket#0282283, 29-08-2022, конец
	Запрос.УстановитьПараметр("ИсточникиПоявленияСтрокиЭкономики", массивИсточниковПоявленияСтрокиЭкономики);
	//РезультатЗапроса = Запрос.Выполнить();
	//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, начало    
	//если имеются расходы с ПеремещениеКТК, то по ним Акцепты не проверяем
	массивИсточниковПриоритетПередРасходамиИзАкцепта = Новый Массив;
	массивИсточниковПриоритетПередРасходамиИзАкцепта.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПеремещениеКТК); 
	//если имеются расходы с ПеремещениеКТК и ДобавленоИзАкцепта, то по ним ОбъединениеСделок не проверяем, их не отвязать в таком случае
	массивИсточниковПриоритетПередРасходамиОбъединениеСделок = Новый Массив;
	//ДИТ, Беляев СЮ, US 66796 / TA 72424, 17-07-2023, начало (закомментировал, теперь перезаполнение СП отключит расходы из Акцепта и значит надо все строки из порожней убрать)
	//массивИсточниковПриоритетПередРасходамиОбъединениеСделок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	//ДИТ, Беляев СЮ, US 66796 / TA 72424, 17-07-2023, конец
	массивИсточниковПриоритетПередРасходамиОбъединениеСделок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПеремещениеКТК);
	//если по строкам СформированыЗакрывающиеДокументы, то по ним не проверям возможность перезаполнения
	ОтборСформированыЗакрывающиеДокументы = Новый Структура("СформированыЗакрывающиеДокументы",Истина);
	МассивГУИДСформированыЗакрывающиеДокументы = СвязьУчетныхЕдиниц.Скопировать(ОтборСформированыЗакрывающиеДокументы,"ГУИД").ВыгрузитьКолонку("ГУИД");
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики_ОбъединениеПорожнейИГруженойСделок", Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок);
    Запрос.УстановитьПараметр("ИсточникиПриоритетПередРасходамиИзАкцепта", массивИсточниковПриоритетПередРасходамиИзАкцепта);  
	Запрос.УстановитьПараметр("ИсточникиПриоритетПередРасходамиОбъединениеСделок", массивИсточниковПриоритетПередРасходамиОбъединениеСделок);    
	Запрос.УстановитьПараметр("МассивГУИДСформированыЗакрывающиеДокументы", МассивГУИДСформированыЗакрывающиеДокументы);    
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СвязьУчетныхЕдиниц.Скопировать(,"ГУИД, Заявка"));
	//Запрос.УстановитьПараметр("ЗаявкиДляПерезаполнения", ОбъектЗаявки.ВыгрузитьКолонку("Заявка"));
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	Если ТипЗнч(ОбъектЗаявки) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ЗаявкиДляПерезаполнения", ОбъектЗаявки);
	Иначе
		Запрос.УстановитьПараметр("ЗаявкиДляПерезаполнения", ОбъектЗаявки.ВыгрузитьКолонку("Заявка"));
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	//Запрос.УстановитьПараметр("ПользовательВыбралВсехКонтрагентов", ПользовательВыбралВсехКонтрагентов); //ДИТ, Беляев СЮ, ТА62590, 08-12-2022, закомментировал
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	//РезультатЗапроса = РезультатЗапросаПакет[1];    
	//СтруктураДанныеПоЗапрещеннымДляПересчета.МассивДобавленоИзАкцепта = РезультатЗапросаПакет[2].Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц");	  
	//СтруктураДанныеПоЗапрещеннымДляПересчета.МассивОбъединениеПорожнейИГруженойСделок = РезультатЗапросаПакет[3].Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц"); 
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, начало
	РезультатЗапроса = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-3];    
	//СтруктураДанныеПоЗапрещеннымДляПересчета.МассивДобавленоИзАкцепта = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2].Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц");	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, закомментировано (блокировка отключена)
	СтруктураДанныеПоЗапрещеннымДляПересчета.МассивОбъединениеПорожнейИГруженойСделок = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц");
	//ДИТ, Беляев СЮ, Ticket#0286563 (US 58604), 04-10-2022, конец
	//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, конец
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции 

Функция ПолучитьЗаявкиКалькуляцииСПодсылом(Заявки, ИмяДокумента) Экспорт
	
	ТипЗначенияЗаявки = ТипЗнч(Заявки);
	Если ТипЗначенияЗаявки = Тип("Массив") Или ТипЗначенияЗаявки = Тип("СписокЗначений") Тогда
		СписокЗаявок = Заявки;
	Иначе
		СписокЗаявок = Новый Массив;
		СписокЗаявок.Добавить(Заявки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
	|	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ КалькуляцииЗаявок
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка В(&СписокЗаявок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КалькуляцииЗаявок.Заявка КАК Док
	|ИЗ
	|	КалькуляцииЗаявок КАК КалькуляцииЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО КалькуляцииЗаявок.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|ГДЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних";
	
	Если ИмяДокумента = "Калькуляция" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КалькуляцииЗаявок.Заявка КАК Док", "КалькуляцииЗаявок.Калькуляция КАК Док");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокЗаявок", СписокЗаявок);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	СписокДокументов = ТаблицаДокументов.ВыгрузитьКолонку("Док");
	
	Возврат СписокДокументов;
	
КонецФункции   

Функция ПолучитьДанныеДоплаты(КТК, ПериодЪ, ТекСделка = неопределено)
	
	Результат = Новый Структура("Доплата_Клиент, Доплата_Договор, Доплата_ПСЦ, Доплата_Калькуляция, Доплата_Доплата, Доплата_Валюта");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Клиент КАК Доплата_Клиент,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Договор КАК Доплата_Договор,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_ПСЦ КАК Доплата_ПСЦ,
	               |	ВЫБОР
	               |		КОГДА стоки_ТекущиеДанныеСрезПоследних.комм_Ставка > 0
	               |			ТОГДА стоки_ТекущиеДанныеСрезПоследних.комм_Ставка
	               |		ИНАЧЕ -стоки_ТекущиеДанныеСрезПоследних.комм_Ставка
	               |	КОНЕЦ КАК Доплата_Доплата,
	               |	стоки_ТекущиеДанныеСрезПоследних.комм_Валюта КАК Доплата_Валюта,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Калькуляция КАК Доплата_Калькуляция
	               |ИЗ
	               |	РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних(, КТК = &КТК) КАК стоки_КлиентскоеОперированиеСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	               |		ПО стоки_КлиентскоеОперированиеСрезПоследних.КТК = стоки_ТекущиеДанныеСрезПоследних.КТК
	               |ГДЕ
	               |	НЕ стоки_КлиентскоеОперированиеСрезПоследних.допл_ПСЦ В
	               |				(ВЫБРАТЬ
	               |					СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ
	               |				ИЗ
	               |					Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |				ГДЕ
	               |					СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |					И СделкаСвязьУчетныхЕдиниц.Ссылка <> &ТекСделка
	               |					И СделкаСвязьУчетныхЕдиниц.Контейнер = &КТК)";
				   //|	И стоки_КлиентскоеОперированиеСрезПоследних.допл_Сделка = &ТекСделка"; //ДИТ, Беляев СЮ, Ticket#0271096, 04-05-2022 закомментировал - отбор не требуется и нет такого реквизита на рабочей базе
	
	Запрос.УстановитьПараметр("КТК", КТК);
	Запрос.УстановитьПараметр("ТекСделка", ТекСделка);
	
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() И ЗначениеЗаполнено(Ответ.Доплата_Клиент) Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ПерезаполнитьВладельцевКТКСервер(СвязьУчетныхЕдиниц) экспорт
	
	СписокСделок = Новый Массив;
	Соответствие = Новый Массив;
	
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		
		СписокСделок.Добавить(Стр.Заявка);
		// Евросиб Фролов (26.12.2021 TASK №44663
		//Соответствие.Добавить(Новый Структура("Заявка, НомерКТК, ГУИД", Стр.Заявка, Стр.Контейнер, Стр.ГУИД));
		Соответствие.Добавить(Новый Структура("Заявка, ГУИДСтрокиЗаявки, ГУИД", Стр.Заявка, Стр.ГУИДСтрокиЗаявки, Стр.ГУИД));
		// Евросиб Фролов)
	КонецЦикла;
	
	Результат = ПолучитьВладельцевУказанныхКТКИзЗаявки(СписокСделок, Соответствие);
	
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		
		Для каждого Стр2 из Результат Цикл
			
			// Евросиб Фролов (26.12.2021 TASK №44663
			Если Стр.Заявка = Стр2.Заявка 
				И Стр.ГУИДСтрокиЗаявки = Стр2.ГУИДСтроки Тогда 
				// Евросиб Bug 91817 TA 91845 Рыбьяков К.А. 18.09.2024 ((
				//ЗаполнитьЗначенияСвойств(Стр, Стр2, "ВладелецКТК, ПринадлежностьТЕ, ДатаВыдачиГрузаКлиенту, ВремяПрибытияНаТерминал");
				ЗаполнитьЗначенияСвойств(Стр, Стр2, "ВладелецКТК, ДатаВыдачиГрузаКлиенту, ВремяПрибытияНаТерминал");
				// Евросиб Рыбьяков К.А. 18.09.2024 ))
				Прервать; 
			КонецЕсли;			
			// Евросиб Фролов)
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВосстановитьГУИДыСтрок(СвязьУчетныхЕдиниц,ВТ_СвязьУчетныхЕдиниц)
	Для каждого СтрСостав Из СвязьУчетныхЕдиниц Цикл
		//ДИТ, Беляев СЮ, TA55125, 27-07-2022, начало
		Если ЗначениеЗаполнено(СтрСостав.ГУИД) Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, TA55125, 27-07-2022, конец
		
		// Евросиб Фролов (15.12.2021 Ticket№ 0244435
		//СтрокиКТК = ВТ_СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки", СтрСостав.ГУИДСтрокиЗаявки));  
		СтрокиКТК = ВТ_СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки, ВидТранспортногоСообщения",
		СтрСостав.ГУИДСтрокиЗаявки,
		СтрСостав.ВидТранспортногоСообщения));
		// Евросиб Фролов)
		
		Если СтрокиКТК.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрСостав,СтрокиКТК[0],"ГУИД"); 
			//ДИТ, Беляев СЮ, ТА52417 / Ticket#0274408, 06-06-2022, начало
		Иначе 
			СтрСостав.ГУИД = Новый УникальныйИдентификатор;	
			//ДИТ, Беляев СЮ, ТА52417 / Ticket#0274408, 06-06-2022, конец
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Функция ПолучитьВладельцевУказанныхКТКИзЗаявки(СписокСделок, Соответствие)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Ссылка,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	               |	ЗаявкаСоставУслуги.ВладелецКТК КАК ВладелецКТК,
	               |	ЗаявкаСоставУслуги.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
	               |	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	               |	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", СписокСделок);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Для каждого Стр из Соответствие Цикл
			// Евросиб Фролов (26.12.2021 TASK №44663
			//Если Ответ.Ссылка = Стр.Заявка И (Ответ.НомерКТК = Стр.НомерКТК ИЛИ Ответ.ГУИДСтроки = Стр.ГУИД) Тогда
			Если Ответ.Ссылка = Стр.Заявка 
				И (Ответ.ГУИДСтроки = Стр.ГУИДСтрокиЗаявки 
					ИЛИ Ответ.ГУИДСтроки = Стр.ГУИД) Тогда
				//Результат.Добавить(Новый Структура("Заявка, КТК, Владелец, ВремяПрибытияНаТерминал, ПринадлежностьТЕ, ДатаВыдачиГрузаКлиенту, ГУИДСтроки", Стр.Заявка, Стр.НомерКТК, Ответ.ВладелецКТК, Ответ.ВремяПрибытияНаТерминал, Ответ.ПринадлежностьТЕ, Ответ.ДатаПодачиАвтоПодВыгрузку, Ответ.ГУИДСтроки));
				Результат.Добавить(Новый Структура("Заявка, ВладелецКТК, ВремяПрибытияНаТерминал, ПринадлежностьТЕ, ДатаВыдачиГрузаКлиенту, ГУИДСтроки", 
												Стр.Заявка, Ответ.ВладелецКТК, Ответ.ВремяПрибытияНаТерминал, Ответ.ПринадлежностьТЕ, Ответ.ДатаПодачиАвтоПодВыгрузку, Ответ.ГУИДСтроки));	
			// Евросиб Фролов)	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуВТ_СвязьУчетныхЕдиниц()
	
	ВТ_СвязьУчетныхЕдиниц        = Новый ТаблицаЗначений;
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ГотовоКВыставлению",Новый ОписаниеТипов("Булево"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ДокументыСформированы",Новый ОписаниеТипов("Булево"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ДокументыВыставлены",Новый ОписаниеТипов("Булево"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ЗадачаГотовностиКВыставлению",Новый ОписаниеТипов("СправочникСсылка.Состояния"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("Протокол",Новый ОписаниеТипов("ДокументСсылка.ПСЦ"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("Калькуляция",Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("НеАктивна",Новый ОписаниеТипов("Булево"));
	ВТ_СвязьУчетныхЕдиниц.Колонки.Добавить("ГУИДСтрокиЗаявки",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));	
	
	Возврат ВТ_СвязьУчетныхЕдиниц;
	
КонецФункции	

//Процедура ЗаполнитьКолонкуСформированыЗакрывающиеДокументы(СтруктураПараметры) Экспорт
//	
//	//ОбъектДоходыКТК 				= СтруктураПараметры.ОбъектДоходыКТК;
//	//ОбъектДоходы 					= СтруктураПараметры.ОбъектДоходы;
//	//ОбъектСвязьДоходовИРасходов 	= СтруктураПараметры.ОбъектСвязьДоходовИРасходов;
//	//ОбъектСвязьУчетныхЕдиниц 		= СтруктураПараметры.ОбъектСвязьУчетныхЕдиниц;
//	//СписокКТКФрахт                  = СтруктураПараметры.СписокКТКФрахт;
//	
//	// Если в сделке на вкладке "Экономика сделки" в ТЧ "Доходы" по строке сформированы закрывающие документы клиенту по КТК 
//	// (заполнено поле Уч. Документ) и РТУ проведена, не аннулирована и не помечена на удаление, то должен быть реализован
//	// запрет на изменение любых данных на вкладке «Состав поезда» по этим КТК.
//	// Для этого заполняем колонку "Сформированы закрывающие документы" таблицы "Связь учетных единиц".
//	
//	// Получаем список КТК таблицы "Доходы".
//	// Список КТК текстом хранится в таблице "ДоходыКТК", связь с таблицей "Доходы" по "ГУИД".
//	
//	ОписаниеТиповСтрока36 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)); // ГУИД
//	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11)); // Наименование
//	
//	ТаблицаКонтейнеровДоходов = Новый ТаблицаЗначений;
//	ТаблицаКонтейнеровДоходов.Колонки.Добавить("КТК", 	ОписаниеТиповСтрока11);
//	ТаблицаКонтейнеровДоходов.Колонки.Добавить("ГУИД", 	ОписаниеТиповСтрока36);
//	
//	Для Каждого ТекущийКТКДоходов Из ОбъектДоходыКТК Цикл
//		
//		МассивПредставленийКТК = СтрРазделить(ТекущийКТКДоходов.КТК, ";", Ложь);
//		Для Каждого ПредставлениеКТК из МассивПредставленийКТК Цикл
//		
//			СтрокаКТК = ТаблицаКонтейнеровДоходов.Добавить();
//			СтрокаКТК.КТК = ПредставлениеКТК;
//			СтрокаКТК.ГУИД = ТекущийКТКДоходов.ГУИД;
//		
//		КонецЦикла;		
//		
//	КонецЦикла;
//	
//	// По полученным КТК определяем закрывающие документы и проверяем наличие аннулирования.
//	// Если закрывающие документы проведены и не аннулированы, то в строке устанавливаем признак "СформированыЗакрывающиеДокументы".
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	ТаблицаКонтейнеровДоходов.КТК КАК КТК,
//	|	ТаблицаКонтейнеровДоходов.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ втТаблицаКонтейнеровДоходовСтрокой
//	|ИЗ
//	|	&ТаблицаКонтейнеровДоходов КАК ТаблицаКонтейнеровДоходов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
//	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
//	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
//	|ИЗ
//	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
//	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
//	|ИЗ
//	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТЕ.Ссылка КАК КТК,
//	|	втТаблицаКонтейнеровДоходовСтрокой.ГУИД КАК ГУИД
//	|ПОМЕСТИТЬ втТаблицаКонтейнеровДоходов
//	|ИЗ
//	|	втТаблицаКонтейнеровДоходовСтрокой КАК втТаблицаКонтейнеровДоходовСтрокой
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
//	|		ПО втТаблицаКонтейнеровДоходовСтрокой.КТК = ТЕ.Наименование
//	|			И (НЕ ТЕ.ПометкаУдаления)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Доходы.ГУИД КАК ГУИД,
//	|	Доходы.УчДокумент КАК УчДокумент,
//	|	Доходы.Услуга КАК Услуга,
//	|	Доходы.Клиент КАК Клиент,
//	|	Доходы.Договор КАК Договор
//	|ПОМЕСТИТЬ втДоходы
//	|ИЗ
//	|	Документ.Сделка.Доходы КАК Доходы 
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втТаблицаКонтейнеровДоходов.КТК КАК КТК,
//	|	втДоходы.УчДокумент КАК УчетныйДокумент,
//	|	втДоходы.УчДокумент.Проведен КАК УчетныйДокументПроведен,
//	|	втДоходы.Услуга.Наименование КАК НаименованиеУслуги,
//	|	втДоходы.ГУИД КАК ГУИД,
//	|	втДоходы.Клиент КАК Клиент,
//	|	втДоходы.Договор КАК Договор
//	|ПОМЕСТИТЬ втУчетныеДокументыКТК
//	|ИЗ
//	|	втДоходы КАК втДоходы
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаКонтейнеровДоходов КАК втТаблицаКонтейнеровДоходов
//	|		ПО втДоходы.ГУИД = втТаблицаКонтейнеровДоходов.ГУИД
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втУчетныеДокументыКТК.УчетныйДокумент КАК УчетныйДокумент,
//	|	МАКСИМУМ(ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка, ЛОЖЬ)
//	|			ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление, ЛОЖЬ)
//	|			ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование, ЛОЖЬ)) КАК ИзмененияРазрешены
//	|ПОМЕСТИТЬ втРазрешениеИзменений
//	|ИЗ
//	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(, ) КАК РазрешениеВводаКорректировокСрезПоследних
//	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = РазрешениеВводаКорректировокСрезПоследних.ОбъектКорректировки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	втУчетныеДокументыКТК.УчетныйДокумент
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втУчетныеДокументыКТК.КТК КАК КТК,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА втУчетныеДокументыКТК.УчетныйДокументПроведен
//	|					И КорректировкаРеализации.Ссылка ЕСТЬ NULL
//	|					И втРазрешениеИзменений.ИзмененияРазрешены = ЛОЖЬ
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ) КАК СформированыЗакрывающиеДокументы,
//	|	втУчетныеДокументыКТК.Клиент КАК Клиент,
//	|	втУчетныеДокументыКТК.Договор КАК Договор
//	|ИЗ
//	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
//	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = КорректировкаРеализации.ДокументРеализации
//	|			И (КорректировкаРеализации.ДокументРеализации.Проведен)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазрешениеИзменений КАК втРазрешениеИзменений
//	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = втРазрешениеИзменений.УчетныйДокумент
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	втУчетныеДокументыКТК.КТК,
//	|	втУчетныеДокументыКТК.Клиент,
//	|	втУчетныеДокументыКТК.Договор
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втУчетныеДокументыКТК.КТК КАК КТК,
//	|	втУчетныеДокументыКТК.УчетныйДокумент КАК УчетныйДокумент,
//	|	втУчетныеДокументыКТК.НаименованиеУслуги КАК НаименованиеУслуги,
//	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
//	|ИЗ
//	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
//	|		ПО втУчетныеДокументыКТК.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
//	|ГДЕ
//	|	втУчетныеДокументыКТК.НаименованиеУслуги = &УслугаФрахт
//	|	И втУчетныеДокументыКТК.УчетныйДокумент <> НЕОПРЕДЕЛЕНО
//	|	И втУчетныеДокументыКТК.УчетныйДокумент <> ЗНАЧЕНИЕ(Документ.ОтчетКомитентуОПродажах.ПустаяСсылка)
//	|	И втУчетныеДокументыКТК.УчетныйДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";
//	// Евросиб Фролов)
//	
//	Запрос = Новый Запрос;
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.Доходы", "&Доходы");
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
//	Запрос.Текст = ТекстЗапроса;
//	
//	
//	Запрос.УстановитьПараметр("ТаблицаКонтейнеровДоходов", 	ТаблицаКонтейнеровДоходов);
//	Запрос.УстановитьПараметр("Доходы", 					ОбъектДоходы);
//	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", 		ОбъектСвязьДоходовИРасходов);
//	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", 		ОбъектСвязьУчетныхЕдиниц);
//	Запрос.УстановитьПараметр("УслугаФрахт",				Константы.УслугаФрахтаДляКалькуляции.Получить());
//	
//	РезультатЗапроса = Запрос.ВыполнитьПакет();	
//	РезультатПоВыставленнымДокументам = РезультатЗапроса[7];
//	РезультатПоФрахту = РезультатЗапроса[8]; 
//	
//	Если Не РезультатПоВыставленнымДокументам.Пустой() Тогда
//		Выборка = РезультатПоВыставленнымДокументам.Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			ПараметрыПоиска = Новый Структура;
//			ПараметрыПоиска.Вставить("Контейнер", Выборка.КТК);
//			ПараметрыПоиска.Вставить("Клиент", Выборка.Клиент);
//			ПараметрыПоиска.Вставить("Договор", Выборка.Договор); // Евросиб Фролов (10.02.2022 Task №45022
//			НайденныеСтроки = ОбъектСвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыПоиска);
//			
//			Если НайденныеСтроки.Количество() > 0 Тогда
//				СтрокаКТК = НайденныеСтроки[0];
//				СтрокаКТК.СформированыЗакрывающиеДокументы = Выборка.СформированыЗакрывающиеДокументы;
//			КонецЕсли;	
//			
//		КонецЦикла;	
//	КонецЕсли;	
//	
//	Если НЕ РезультатПоФрахту.Пустой() Тогда
//		КТКФрахт = РезультатПоФрахту.Выгрузить().ВыгрузитьКолонку("КТК");
//		СписокКТКФрахт.ЗагрузитьЗначения(КТКФрахт);
//	КонецЕсли;	
//	
//КонецПроцедуры


Процедура ЗаполнитьКолонкуСформированыЗакрывающиеДокументы(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("ЗаполнениеФормы") Тогда
		ОбъектДоходыКТК 				= СтруктураПараметров.Объект.ДоходыКТК;
		ОбъектДоходы 					= СтруктураПараметров.Объект.Доходы;
		ОбъектСвязьДоходовИРасходов 	= СтруктураПараметров.Объект.СвязьДоходовИРасходов;
		ОбъектСвязьУчетныхЕдиниц 		= СтруктураПараметров.Объект.СвязьУчетныхЕдиниц;
		ТаблицаСвязьУчетныхЕдиниц 		= ОбъектСвязьУчетныхЕдиниц.Выгрузить();
	Иначе
		ОбъектДоходыКТК 				= СтруктураПараметров.ОбъектДоходыКТК;
		ОбъектДоходы 					= СтруктураПараметров.ОбъектДоходы;
		ОбъектСвязьДоходовИРасходов 	= СтруктураПараметров.ОбъектСвязьДоходовИРасходов;
		ОбъектСвязьУчетныхЕдиниц 		= СтруктураПараметров.ОбъектСвязьУчетныхЕдиниц;
		ТаблицаСвязьУчетныхЕдиниц		= ОбъектСвязьУчетныхЕдиниц;
	КонецЕсли;
	СписокКТКФрахт                  = Новый СписокЗначений;
	
	// Если в сделке на вкладке "Экономика сделки" в ТЧ "Доходы" по строке сформированы закрывающие документы клиенту по КТК 
	// (заполнено поле Уч. Документ) и РТУ проведена, не аннулирована и не помечена на удаление, то должен быть реализован
	// запрет на изменение любых данных на вкладке «Состав поезда» по этим КТК.
	// Для этого заполняем колонку "Сформированы закрывающие документы" таблицы "Связь учетных единиц".
	
	// Получаем список КТК таблицы "Доходы".
	// Список КТК текстом хранится в таблице "ДоходыКТК", связь с таблицей "Доходы" по "ГУИД".
	
	ОписаниеТиповСтрока36 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)); // ГУИД
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11)); // Наименование
	
	ТаблицаКонтейнеровДоходов = Новый ТаблицаЗначений;
	ТаблицаКонтейнеровДоходов.Колонки.Добавить("КТК", 	ОписаниеТиповСтрока11);
	ТаблицаКонтейнеровДоходов.Колонки.Добавить("ГУИД", 	ОписаниеТиповСтрока36);
	
	Для Каждого ТекущийКТКДоходов Из ОбъектДоходыКТК Цикл
		
		МассивПредставленийКТК = СтрРазделить(ТекущийКТКДоходов.КТК, ";", Ложь);
		Для Каждого ПредставлениеКТК из МассивПредставленийКТК Цикл
		
			СтрокаКТК = ТаблицаКонтейнеровДоходов.Добавить();
			СтрокаКТК.КТК = ПредставлениеКТК;
			СтрокаКТК.ГУИД = ТекущийКТКДоходов.ГУИД;
		
		КонецЦикла;		
		
	КонецЦикла;
	
	// По полученным КТК определяем закрывающие документы и проверяем наличие аннулирования.
	// Если закрывающие документы проведены и не аннулированы, то в строке устанавливаем признак "СформированыЗакрывающиеДокументы".
	
	//ДИТ, Беляев СЮ, BUG 61636, 22-11-2022, вернул потерянные исправления по BUG 57430/TA 57684
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022 информация об изменениях в логике
	//устанавливать "СформированыЗакрывающиеДокументы" в случаях
	//1) Корректировка по РТУ запрещена или есть корректируемый документ к РТУ, необходимо учитывать список КТК в новой строке, т.к. могут быть некоторые КТК исключены
	//2) Выполнено аннулирование и создан новый документ РТУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|ГДЕ
	//|	СделкаСвязьДоходовИРасходов.Ссылка = &Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ГУИД КАК ГУИД,
	|	Доходы.УчДокумент КАК УчДокумент,
	|	Доходы.Услуга КАК Услуга,
	|	Доходы.Клиент КАК Клиент,
	|	Доходы.Договор КАК Договор
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
	|	,Доходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту
	|	,Доходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
	|	,Доходы.КорректировкаДокумента КАК КорректировкаДокумента
	|	,ВЫБОР КОГДА Доходы.ГУИДИсправляемойСтроки <> """" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоСтрокаИсправления
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, конец
	|ПОМЕСТИТЬ втДоходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК Доходы
	//|ГДЕ
	//|	Доходы.Ссылка = &Сделка
	|;
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ    //УБРАНО, НЕ БУДЕТ СВЯЗИ С Составом поезда У СТРОК КОРРЕКТИРОВКИ, В РЕЗУЛЬТАТЕ ВСЕГДА "НЕ СФОРМИРОВАНЫ ДОКУМЕНТЫ"
	//|	втДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
	//|ПОМЕСТИТЬ втДоходыИсправленныеИСтрокиАннулирования
	//|ИЗ
	//|	втДоходы КАК втДоходы
	//|ГДЕ втДоходы.ГУИДИсправляемойСтроки <> """"
	//|	И ЕстьNULL(втДоходы.КорректировкаДокумента.ВидОперации, Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) <> Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втДоходы.ГУИД КАК ГУИДИсправляемойСтроки
	|ПОМЕСТИТЬ втДоходыИсправленныеИСтрокиАннулирования
	|ИЗ
	|	втДоходы КАК втДоходы
   	|ГДЕ ЕстьNULL(втДоходы.КорректировкаДокумента.ВидОперации, Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)    	
	|;
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, конец
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК связьучетныхединиц,
	//|	втДоходы.УчДокумент КАК УчетныйДокумент,
	//|	втДоходы.УчДокумент.Проведен КАК УчетныйДокументПроведен,
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
	|	ВЫБОР КОГДА втДоходы.ЭтоСтрокаИсправления ТОГДА
	|			втДоходы.КорректировкаДокумента ИНАЧЕ
	|			втДоходы.УчДокумент КОНЕЦ КАК УчетныйДокумент,
	|	ВЫБОР КОГДА втДоходы.ЭтоСтрокаИсправления ТОГДА
	|			втДоходы.КорректировкаДокумента.Проведен ИНАЧЕ
	|			втДоходы.УчДокумент.Проведен КОНЕЦ КАК УчетныйДокументПроведен, 
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, конец
	|	втДоходы.Услуга.Наименование КАК НаименованиеУслуги,
	|	втДоходы.ГУИД КАК ГУИД,
	|	втДоходы.Клиент КАК Клиент,
	|	втДоходы.Договор КАК Договор
	|ПОМЕСТИТЬ втУчетныеДокументыКТК
	|ИЗ
	|	втДоходы КАК втДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО втДоходы.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
	|ГДЕ втДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	|	И НЕ втДоходы.ГУИД В (ВЫБРАТЬ втДоходыИсправленныеИСтрокиАннулирования.ГУИДИсправляемойСтроки ИЗ втДоходыИсправленныеИСтрокиАннулирования КАК втДоходыИсправленныеИСтрокиАннулирования)
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУчетныеДокументыКТК.УчетныйДокумент КАК УчетныйДокумент,
	|	МАКСИМУМ(ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка, ЛОЖЬ)
	|			ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление, ЛОЖЬ)
	|			ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование, ЛОЖЬ)) КАК ИзмененияРазрешены
	|ПОМЕСТИТЬ втРазрешениеИзменений
	|ИЗ
	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(, ) КАК РазрешениеВводаКорректировокСрезПоследних
	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = РазрешениеВводаКорректировокСрезПоследних.ОбъектКорректировки
	|
	|СГРУППИРОВАТЬ ПО
	|	втУчетныеДокументыКТК.УчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУчетныеДокументыКТК.связьучетныхединиц КАК связьучетныхединиц,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втУчетныеДокументыКТК.УчетныйДокументПроведен
	//|					И КорректировкаРеализации.Ссылка ЕСТЬ NULL
	//|					И втРазрешениеИзменений.ИзмененияРазрешены = ЛОЖЬ
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
	|					И (втРазрешениеИзменений.ИзмененияРазрешены = ЛОЖЬ ИЛИ НЕ КорректировкаРеализации.Ссылка ЕСТЬ NULL)
	//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, конец
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК СформированыЗакрывающиеДокументы,
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, начало
	|	МАКСИМУМ(втУчетныеДокументыКТК.УчетныйДокументПроведен) КАК УчетныйДокументПроведен,
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, конец
	|	втУчетныеДокументыКТК.Клиент КАК Клиент,
	|	втУчетныеДокументыКТК.Договор КАК Договор
	|ИЗ
	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = КорректировкаРеализации.ДокументРеализации
	|			И (КорректировкаРеализации.ДокументРеализации.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазрешениеИзменений КАК втРазрешениеИзменений
	|		ПО втУчетныеДокументыКТК.УчетныйДокумент = втРазрешениеИзменений.УчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	втУчетныеДокументыКТК.связьучетныхединиц,
	|	втУчетныеДокументыКТК.Клиент,
	|	втУчетныеДокументыКТК.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУчетныеДокументыКТК.УчетныйДокумент КАК УчетныйДокумент,
	|	втУчетныеДокументыКТК.НаименованиеУслуги КАК НаименованиеУслуги,
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ИЗ
	|	втУчетныеДокументыКТК КАК втУчетныеДокументыКТК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО втУчетныеДокументыКТК.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	|ГДЕ
	|	втУчетныеДокументыКТК.НаименованиеУслуги = &УслугаФрахт
	|	И втУчетныеДокументыКТК.УчетныйДокумент.Ссылка ЕСТЬ НЕ NULL ";
	// Евросиб Фролов)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.Доходы", "&Доходы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.Текст = ТекстЗапроса;
	
	
	Запрос.УстановитьПараметр("ТаблицаКонтейнеровДоходов", 	ТаблицаКонтейнеровДоходов);
	Запрос.УстановитьПараметр("Доходы", 					ОбъектДоходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", 		ОбъектСвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", 		ТаблицаСвязьУчетныхЕдиниц);
	Запрос.УстановитьПараметр("УслугаФрахт",				Константы.УслугаФрахтаДляКалькуляции.Получить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоПакетов = РезультатЗапроса.Количество();
	РезультатПоВыставленнымДокументам = РезультатЗапроса[КоличествоПакетов-2];
	РезультатПоФрахту = РезультатЗапроса[КоличествоПакетов - 1];
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, начало
	МассивСтрокВРежимеКорректирования = Новый Массив;
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, конец
	
	Если Не РезультатПоВыставленнымДокументам.Пустой() Тогда
		Выборка = РезультатПоВыставленнымДокументам.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПараметрыПоиска = Новый Структура;
			//ПараметрыПоиска.Вставить("Контейнер", Выборка.КТК);
			//ПараметрыПоиска.Вставить("Клиент", Выборка.Клиент);
			//ПараметрыПоиска.Вставить("Договор", Выборка.Договор); // Евросиб Фролов (10.02.2022 Task №45022
			ПараметрыПоиска.Вставить("ГУИД", Выборка.СвязьУчетныхЕдиниц);
			НайденныеСтроки = ОбъектСвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыПоиска);
			
			//Если НайденныеСтроки.Количество() > 0 Тогда
			//	СтрокаКТК = НайденныеСтроки[0];
			//	СтрокаКТК.СформированыЗакрывающиеДокументы = Выборка.СформированыЗакрывающиеДокументы;
			//КонецЕсли;	
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.СформированыЗакрывающиеДокументы = Выборка.СформированыЗакрывающиеДокументы;
				//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, начало
				Если НЕ Выборка.СформированыЗакрывающиеДокументы 
					И Выборка.УчетныйДокументПроведен = Истина Тогда
					МассивСтрокВРежимеКорректирования.Добавить(Выборка.СвязьУчетныхЕдиниц);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, конец
			КонецЦикла;
			
		КонецЦикла;	
	КонецЕсли;	
	
	//Если НЕ РезультатПоФрахту.Пустой() Тогда
	//	КТКФрахт = РезультатПоФрахту.Выгрузить().ВыгрузитьКолонку("КТК");
	//	СписокКТКФрахт.ЗагрузитьЗначения(КТКФрахт);
	//КонецЕсли;	
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, начало
	СтруктураПараметров.Вставить("МассивСтрокВРежимеКорректирования", МассивСтрокВРежимеКорректирования);
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 18-03-2025, конец
	
КонецПроцедуры

//ДИТ Авдеева В.С. 50072 Начало 08.09.2022
Функция ПроверитьНаличиеЗаявкиВДругихСделках(ЗаявкиДляПроверки, ТекущаяСделка) Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сделка.Номер КАК НомерСделки,
	|	ДокЗаявка.Номер КАК НомерЗаявки,
	|	СделкаЗаявки.Заявка КАК Заявка
	|ИЗ
	|	Документ.Сделка.Заявки КАК СделкаЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
	|		ПО СделкаЗаявки.Ссылка = Сделка.Ссылка
	|			И (Сделка.Проведен)
	|			И (НЕ Сделка.ПодсылПорожних)
	|			И (НЕ Сделка.Ссылка = &ТекущаяСделка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	|		ПО СделкаЗаявки.Заявка = ДокЗаявка.Ссылка
	|ГДЕ
	|	СделкаЗаявки.Заявка В(&Заявки)
	|ИТОГИ ПО
	|	Заявка";
	
	Запрос.УстановитьПараметр("Заявки", ЗаявкиДляПроверки);
	Запрос.УстановитьПараметр("ТекущаяСделка", ТекущаяСделка);    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаявкиСообщения = Новый Соответствие;
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		ВыборкаЗаявка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		
		Пока ВыборкаЗаявка.Следующий() Цикл  
			
			Выборка = ВыборкаЗаявка.Выбрать();
			
			МассивСообщений = Новый Массив; 
			
			Пока Выборка.Следующий() Цикл   
				ТекстСоообщения = СтрШаблон("Заявка %1 используется в другой сделке %2", 
											Выборка.НомерЗаявки, Выборка.НомерСделки);
											
				МассивСообщений.Добавить(ТекстСоообщения);  
				
			КонецЦикла;    
			
			ЗаявкиСообщения.Вставить(ВыборкаЗаявка.Заявка, МассивСообщений);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЗаявкиСообщения;

КонецФункции //ДИТ Авдеева В.С. 50072 Конец 08.09.2022	

//ДИТ, Беляев СЮ, US 66796 / TA 72424, 17-07-2023, начало
Функция ОтключитьРасходыПоАкцептамИВыполнитьРазъединение(Объект, ДополнительныеПараметры) Экспорт
	СтруктураРезультата = Новый Структура; 
	//СтруктураРезультата.Вставить("ЕстьРезультатОтключенияРасходов", Неопределено); //ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, закомментировал
	СтруктураРезультата.Вставить("ЕстьРезультатРазъединенияСделок", Неопределено);
	СтруктураРезультата.Вставить("РезультатРазъединения", "");
	СтруктураРезультата.Вставить("СписокСделок", "");
	//СтруктураРезультата.Вставить("РезультатОтключения", ""); //ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, закомментировал
		
	//РАЗЪЕДИНИМ СДЕЛКИ
	МассивОбъединениеПорожнейИГруженойСделок = ДополнительныеПараметры.МассивОбъединениеПорожнейИГруженойСделок;
	Если МассивОбъединениеПорожнейИГруженойСделок.Количество()>0 Тогда
		СтруктураРезультатаРазъединения = Документы.Сделка.ВыполнитьРазъединениеОтПорожнихСделок(МассивОбъединениеПорожнейИГруженойСделок, Объект.Ссылка);
		СтруктураРезультата.ЕстьРезультатРазъединенияСделок = СтруктураРезультатаРазъединения.ЕстьРезультат;
		СтруктураРезультата.РезультатРазъединения = СтруктураРезультатаРазъединения.РезультатРазъединения;
		СтруктураРезультата.СписокСделок = ?(СтруктураРезультатаРазъединения.Свойство("СписокСделок"),СтруктураРезультатаРазъединения.СписокСделок,"");
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, начало (закомментирован блок ниже, методика отключения изменена)
	////ОТКЛЮЧИМ СТРОКИ, ОТВЯЗКУ АКЦЕПТОВ ВЫПОЛНИТ ЗАДАНИЕ ПО ДАННЫМ РЕГИСТРА "ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов"
	//МассивДобавленоИзАкцепта = ДополнительныеПараметры.МассивДобавленоИзАкцепта;
	//Если МассивДобавленоИзАкцепта.Количество()>0 Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//	|	СделкаРасходы.ГУИД КАК ГУИД
	//	|ПОМЕСТИТЬ ВТ_Расходы
	//	|ИЗ
	//	|	Документ.Сделка.Расходы КАК СделкаРасходы
	//	|ГДЕ
	//	|	НЕ СделкаРасходы.УслугаОтключена
	//	|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = &ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта
	//	|			ИЛИ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта)
	//	|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц В(&МассивДобавленоИзАкцепта)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//	|	ВТ_Расходы.ГУИД КАК СтрокаРасходаГУИД
	//	|ИЗ
	//	|	ВТ_Расходы КАК ВТ_Расходы";
	//    Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	//	Запрос.УстановитьПараметр("Расходы", Объект.Расходы.Выгрузить());
	//	Запрос.УстановитьПараметр("МассивДобавленоИзАкцепта", ДополнительныеПараметры.МассивДобавленоИзАкцепта);
	//	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики_ДобавленоИзАкцепта", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		СделкаОбъект = Объект.Ссылка.ПолучитьОбъект();
	//		РасходыСделки = СделкаОбъект.Расходы;
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			СтрокаРасхода = РасходыСделки.Найти( ВыборкаДетальныеЗаписи.СтрокаРасходаГУИД, "ГУИД" );
	//			СтрокаРасхода.УслугаОтключена = Истина;
	//			СтрокаРасхода.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки;
	//		КонецЦикла;
	//		СделкаОбъект.УстановитьКомментарийВерсииИсторииДанных("Отключения расходов из Акцептов с целью перезаполнения Состава поезда");
	//		СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		СтруктураРезультата.ЕстьРезультатОтключенияРасходов = Истина;
	//		СтруктураРезультата.РезультатОтключения = "Отключены Расходы из Акцептов";
	//	КонецЕсли;
	//КонецЕсли;
	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, конец
	
	Возврат СтруктураРезультата;
КонецФункции
//ДИТ, Беляев СЮ, US 66796 / TA 72424, 17-07-2023, конец

// Евросиб US 84658 Рыбьяков К.А. 17.07.2024 ((
Процедура ВосстановитьКоносаментыСтрок(СвязьУчетныхЕдиниц, ВТ_СвязьУчетныхЕдиниц)
	
	Для Каждого СтрСостав Из СвязьУчетныхЕдиниц Цикл
			
		НайденныеСтроки = ВТ_СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("
			|Гуид,
			|Контейнер, 
			|Калькуляция, 
			|ПортОтправления, 
			|ПортНазначения,  
			|ВидТранспортногоСообщения", 
			СтрСостав.Гуид,
			СтрСостав.Контейнер, 
			СтрСостав.Калькуляция,  
			СтрСостав.ПортОтправления, 
			СтрСостав.ПортНазначения, 
			СтрСостав.ВидТранспортногоСообщения));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрСостав, НайденныеСтроки[0], "Коносамент"); 
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРейсыПоКТКНомеруНакладнойФакт(мРейсы) Экспорт //ДИТ Шевченко А.В. US 62360 ТА 73008 28.07.2023
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыЖДФактическийСоставПоезда.НомерКонтейнера КАК НомерКонтейнера,
		|	РейсыЖДФактическийСоставПоезда.НомерНакладной КАК НомерНакладной,
		|	РейсыЖДФактическийСоставПоезда.Ссылка КАК Рейс
		|ИЗ
		|	Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
		|ГДЕ
		|	РейсыЖДФактическийСоставПоезда.Ссылка В(&мРейсы)
		|	И НЕ РейсыЖДФактическийСоставПоезда.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("мРейсы", мРейсы);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции	
// Евросиб Рыбьяков К.А. 17.07.2024 ))
