
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Подразделение = Автор.Подразделение;
	Создано = ТекущаяДата();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// + Состояния
	
	//Евросиб Каблов 20.07.2020 (
	СибурИзменилЗаявку = Ложь;
	СибурИзмененияЗаявки = Неопределено;
	Если ДополнительныеСвойства.Свойство("СибурИзмененияЗаявки", СибурИзмененияЗаявки) Тогда
		СибурИзменилЗаявку = Истина;		
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )

	// Маршрутизация заявки
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Грузоотправитель <> Грузоотправитель ИЛИ
	Состояния.Количество() = 0 ИЛИ
	//Евросиб Каблов 20.07.2020 (
	Ссылка.СтатусЗаявки <> СтатусЗаявки И СибурИзменилЗаявку;
	//Евросиб Каблов 20.07.2020 )
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Грузоотправитель);
		ПараметрыЗапроса.Вставить("Договор", Неопределено);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Неопределено);
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Ложь);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Неопределено);
		ПараметрыЗапроса.Вставить("ПротоколНеУказан", Истина);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьБукинг(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//Евросиб Каблов 20.07.2020 (
	Если СибурИзменилЗаявку Тогда
		СтрокаСостояния = Состояния.Найти(Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента, "Состояние");
		Если СтрокаСостояния <> Неопределено Тогда
			СтрокаСостояния.Комментарий = СибурИзмененияЗаявки.Комментарий;
			СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )
	
	
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();

	//++ Зубов 0228547 15.09.2021
	НомерБукинга = "";
	ИДБукинга = "";
	//-- Зубов 0228547 15.09.2021
КонецПроцедуры
