#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ПериодРеестра.ДатаНачала = Объект.ДатаНачала;
	ПериодРеестра.ДатаОкончания = Объект.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьЗаполненностьНормативногоСрокаПогрузкиВыгрузки();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Объект.СуммаСНДС = СуммаСНДС;	
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьТаблицаРеестрАвтоподрядчика();
КонецПроцедуры
 
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ЗаполнитьТаблицаРеестрАвтоподрядчика();
	ОбновлениеПредставленияПСЦ()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.ОтветственныйМенеджер = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Договор,"ОтветственныйЗаДоговор");
	ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРеестраПриИзменении(Элемент)
	Объект.ДатаНачала = ПериодРеестра.ДатаНачала;
	Объект.ДатаОкончания = ПериодРеестра.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Объект.ЦФО = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Подразделение,"ЦФО");
КонецПроцедуры

&НаКлиенте
Процедура ПТУПриИзменении(Элемент)
	Объект.ВСФ = ПолучитьСчетФактуру(Объект.ПТУ);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	СравнениеДанныхКолонкиТЧиЗначенияВШапке("СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ПСЦНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОпОп = Новый ОписаниеОповещения("ПослеВыбораПСЦ", ЭтаФорма, Истина);
	СтандартнаяОбработка = Ложь;

    ПараметрыФормы = ПараметрыФормыВыбораПСЦ();
	ОткрытьФорму("Документ.ПСЦПоставщика.ФормаВыбора",ПараметрыФормы, , , , ,ОпОп);	
КонецПроцедуры

&НаКлиенте
Процедура ПСЦОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.ПСЦПоставщика);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеестрАвтоподрядчик

&НаКлиенте
Процедура РеестрАвтоподрядчикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.РеестрАвтоподрядчика.ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаЗапросНаАвто", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ЗапросНаАвто);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаНомерКТК", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.НомерКТК);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаТипКТК", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ТипКТК);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаКлиент", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.Клиент);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаТерминалПостановки", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ТерминалПостановки);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаТерминалСдачи", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ТерминалСдачи);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаТипОперацииНаТерминалеФПостановки", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ТипОперацииНаТерминалеПостановки);
	СоответствиеИмен.Вставить("РеестрАвтоподрядчикаНормаЗагрузкиКТК", Элементы.РеестрАвтоподрядчика.ТекущиеДанные.НормаЗагрузкиКТК);
	
	ОткрываемоеЗначение = СоответствиеИмен.Получить(Поле.Имя);
	Если ОткрываемоеЗначение <> Неопределено Тогда
		ПоказатьЗначение(, ОткрываемоеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ЗаполнитьВниз();
	КонецЕсли;
	ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика();
		
	Если Элемент.ТекущийЭлемент.Имя = "РеестрАвтоподрядчикаБазоваяСтавкаНадбавка" ИЛИ Элемент.ТекущийЭлемент.Имя = "РеестрАвтоподрядчикаНомерПСЦ" Тогда
		ЗаполнитьОсновнуюСтавку();		
	КонецЕсли;
	
	СравнениеДанныхКолонкиТЧиЗначенияВШапке("ПСЦПоставщика");
	СравнениеДанныхКолонкиТЧиЗначенияВШапке("СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаНормативныйСрокПогрузкиВыгрузкиСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Строка = Элементы.РеестрАвтоподрядчика.ТекущиеДанные;
	НовоеЗначение = Строка.НормативныйСрокПогрузкиВыгрузки + 0.5 * Направление;
	Если НовоеЗначение <= 0 Тогда
		Строка.НормативныйСрокПогрузкиВыгрузкиСтрока = ПолучитьЧасыМинутыСтрокой(0);
		Строка.НормативныйСрокПогрузкиВыгрузки = 0;
	Иначе
		Строка.НормативныйСрокПогрузкиВыгрузкиСтрока = ПолучитьЧасыМинутыСтрокой(НовоеЗначение*60);
		Строка.НормативныйСрокПогрузкиВыгрузки = НовоеЗначение;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаНормативныйСрокПогрузкиВыгрузкиСтрокаПриИзменении(Элемент)
	ТекДанные = Элементы.РеестрАвтоподрядчика.ТекущиеДанные;
	ОбработатьИзменениеНормыВремениНаПогрузкуВыгрузку(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаНомерПСЦПриИзменении(Элемент)

	ИзменениеПСЦВТЧ(Элементы.РеестрАвтоподрядчика.ТекущиеДанные.ПСЦПоставщика);
    ОбновлениеПредставленияПСЦ();
КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаНомерПСЦНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОпОп = Новый ОписаниеОповещения("ПослеВыбораПСЦ", ЭтаФорма, Ложь);
	СтандартнаяОбработка = Ложь;

    ПараметрыФормы = ПараметрыФормыВыбораПСЦ();
	ОткрытьФорму("Документ.ПСЦПоставщика.ФормаВыбора",ПараметрыФормы, , , , ,ОпОп);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);   
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТаблицаРеестрАвтоподрядчика()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЧРеестра.КлючАналитики КАК Справочник.КлючиАналитикиПеревозки) КАК КлючАналитики,
		|	ТЧРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТЧРеестра.ДатаВремяПодачиКТКПлан КАК ДатаВремяПодачиКТКПлан,
		|	ТЧРеестра.ХолостойПрогон КАК ХолостойПрогон,
		|	ТЧРеестра.ПСЦПоставщика КАК ПСЦСсылка,
		|	ТЧРеестра.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку
		|ПОМЕСТИТЬ ГуидЗаказаНаТС
		|ИЗ
		|	&ТаблицаРеестра КАК ТЧРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиМили.НомерЗаказаНаТС КАК НомерЗаказаНаТС,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС КАК СтатусЗаказаНаТС,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК НомерАвто,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК Водитель,
		|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто.Контрагент КАК Клиент,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК НомерКТК,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачиФакт КАК ТерминалПостановки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.АдресСкладаФакт КАК АдресПогрузкиВыгрузкиСсылка,
		|	ЗапросНаАвтоперевозкуКонтейнеры.УдалитьАдресСкладаФакт КАК АдресПогрузкиВыгрузки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачиФакт КАК ТерминалСдачи,
		|	КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку КАК ДатаИВремяПрибытияНаПогрузкуВыгрузку,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ДатаЗавершенияОперацииНаСкладеКлиента КАК ДатаИВремяУбытияСПогрузкиВыгрузки,
		|	КлючиАналитикиПеревозкиМили.ЭкспедированиеФакт КАК Экспедирование,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеПостановкиФакт КАК ТипОперацииНаТерминалеПостановки,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаСкладеКлиентаФакт КАК ТипОперацииНаСкладеКлиента,
		|	КлючиАналитикиПеревозкиМили.ОперацияНаТерминалеСдачиФакт КАК ТипОперацииНаТерминалеСдачи,
		|	КлючиАналитикиПеревозкиМили.КомментарийДиспЕвросиб КАК КомментарийЕвросиб,
		|	КлючиАналитикиПеревозкиМили.КомментарийПеревозчика КАК КомментарийПеревозчика,
		|	РАЗНОСТЬДАТ(КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку, ЗапросНаАвтоперевозкуКонтейнеры.ДатаЗавершенияОперацииНаСкладеКлиента, МИНУТА) КАК ВремяНаПогрузке,
		|	КлючиАналитикиПеревозкиМили.ВесНеттоФакт КАК ВесНетто,
		|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто КАК ЗаказНаТССсылка,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер.ТипТЕ КАК ТипКТК,
		|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитики,
		|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку, ДЕНЬ) <> КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку
		|				И НАЧАЛОПЕРИОДА(ГуидЗаказаНаТС.ДатаВремяПодачиКТКПлан, ДЕНЬ) <> ГуидЗаказаНаТС.ДатаВремяПодачиКТКПлан
		|				И КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку > ГуидЗаказаНаТС.ДатаВремяПодачиКТКПлан
		|			ТОГДА РАЗНОСТЬДАТ(ГуидЗаказаНаТС.ДатаВремяПодачиКТКПлан, КлючиАналитикиПеревозкиМили.ДатаИВремяПрибытияНаПогрузкуВыгрузку, МИНУТА)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОпозданиеНаПогрузкуВыгрузку,
		|	КлючиАналитикиПеревозкиМили.ПротоколПоставщика КАК ПСЦПоставщика,
		|	ВЫБОР
		|		КОГДА &РольСменыХолостогоПрогона 
		|				ИЛИ ГуидЗаказаНаТС.ХолостойПрогон = ЗНАЧЕНИЕ(Перечисление.ВидыПрогонаТС.ХолостойПрогонСКТК)  
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоступностьХолостогоПрогонаРуб,
		|	ГуидЗаказаНаТС.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку
		|ИЗ
		|	ГуидЗаказаНаТС КАК ГуидЗаказаНаТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО (ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = ГуидЗаказаНаТС.КлючАналитики)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ГуидЗаказаНаТС.ЗапросНаАвто)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ = ГуидЗаказаНаТС.ИдентификаторСтрокиЗапросаНаАвтоперевозку)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО ГуидЗаказаНаТС.КлючАналитики = КлючиАналитикиПеревозкиМили.Ссылка
		|			И ГуидЗаказаНаТС.ЗапросНаАвто = КлючиАналитикиПеревозкиМили.ЗапросНаАвто";
	
	Запрос.УстановитьПараметр("ТаблицаРеестра", Объект.Заказы.Выгрузить());
	Запрос.УстановитьПараметр("РольСменыХолостогоПрогона", РольДоступна("dc_АРМРеестрАвтоподрядчикаКорректировкаСуммы") ИЛИ РольДоступна("ПолныеПрава"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиЗаполнения = Объект.Заказы.НайтиСтроки(Новый Структура("КлючАналитики, ЗапросНаАвто, ИдентификаторСтрокиЗапросаНаАвтоперевозку",
			ВыборкаДетальныеЗаписи.КлючАналитики, ВыборкаДетальныеЗаписи.ЗапросНаАвто, ВыборкаДетальныеЗаписи.ИдентификаторСтрокиЗапросаНаАвтоперевозку));
		
		Если СтрокиЗаполнения.количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаЗаполнения = СтрокиЗаполнения[0];
		ИсключенияЗаполнения ="КлючАналитики, ЗапросНаАвто, ПСЦПоставщика";

		ЗаполнитьЗначенияСвойств(СтрокаЗаполнения, ВыборкаДетальныеЗаписи,, ИсключенияЗаполнения);
		
		СтрокаЗаполнения.НомерЗаказаНаТС = Лев(ВыборкаДетальныеЗаписи.НомерЗаказаНаТС,25);
		СтрокаЗаполнения.ОпозданиеНаПогрузкуВыгрузкуСтрока = ?(ВыборкаДетальныеЗаписи.ОпозданиеНаПогрузкуВыгрузку < 1440 И ВыборкаДетальныеЗаписи.ОпозданиеНаПогрузкуВыгрузку > 0, ПолучитьЧасыМинутыСтрокой(ВыборкаДетальныеЗаписи.ОпозданиеНаПогрузкуВыгрузку), "");
	КонецЦикла;
	ЗаполнитьСсылкаНаАдреса();
	ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика();                    
	                            
КонецФункции

&НаСервере
Функция ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРеестра.КлючАналитики КАК КлючАналитики,
		|	ТаблицаРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТаблицаРеестра.ТипКТК КАК ТипКТК,
		|	ТаблицаРеестра.ПСЦПоставщика КАК СсылкиПСЦ,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.ТерминалПостановки КАК Справочник.Локации) КАК ТерминалПостановки,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.ТерминалСдачи КАК Справочник.Локации) КАК ТерминалСдачи,
		|	ТаблицаРеестра.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТаблицаРеестра.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТаблицаРеестра.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТаблицаРеестра.НомерКТК КАК НомерКТК,
		|	ТаблицаРеестра.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.АдресПогрузкиВыгрузкиСсылка КАК Справочник.АдресаВНаселенныхПунктах) КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ СсылкиСтрок
		|ИЗ
		|	&ТаблицаРеестра КАК ТаблицаРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПоставщиков.НомерСтроки КАК НомерСтроки,
		|	СсылкиСтрок.КлючАналитики КАК КлючАналитики,
		|	СсылкиСтрок.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СсылкиСтрок.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТарифыПоставщиков.Критерий КАК Критерий,
		|	ПСЦПоставщика.НомерПСЦ КАК НомерПСЦ,
		|	ПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ПСЦПоставщика.СтавкаНДС КАК СтавкаНДС,
		|	СсылкиСтрок.ТипКТК КАК ТипКТК,
		|	СсылкиСтрок.СсылкиПСЦ КАК СсылкиПСЦ,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщика.СуммаВключаетНДС
		|			ТОГДА ТарифыПоставщиков.СтоимостьСНДС
		|		ИНАЧЕ ТарифыПоставщиков.СтоимостьБезНДС
		|	КОНЕЦ КАК Стоимость,
		|	ЛокацииПостановки.Тип КАК ТерминалПостановкиТип,
		|	ЛокацииСдачи.Тип КАК ТерминалСдачиТип,
		|	СсылкиСтрок.ТерминалПостановки КАК ТерминалПостановки,
		|	СсылкиСтрок.ТерминалСдачи КАК ТерминалСдачи,
		|	СсылкиСтрок.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СсылкиСтрок.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СсылкиСтрок.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СсылкиСтрок.НомерКТК КАК НомерКТК,
		|	СсылкиСтрок.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТаблицаТарифов
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|		ПО ТарифыПоставщиков.Регистратор = ПСЦПоставщика.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СсылкиСтрок КАК СсылкиСтрок
		|		ПО ТарифыПоставщиков.Регистратор = СсылкиСтрок.СсылкиПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииПостановки
		|		ПО (СсылкиСтрок.ТерминалПостановки = ЛокацииПостановки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииСдачи
		|		ПО (СсылкиСтрок.ТерминалСдачи = ЛокацииСдачи.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТарифов.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТарифов.КлючАналитики КАК КлючАналитики,
		|	ТаблицаТарифов.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТаблицаТарифов.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТаблицаТарифов.Критерий КАК Критерий,
		|	ТаблицаТарифов.НомерПСЦ КАК НомерПСЦ,
		|	ТаблицаТарифов.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТаблицаТарифов.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТарифов.Стоимость КАК Стоимость,
		|	КритерииУслугПоставщиков.Номенклатура КАК Номенклатура,
		|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	КритерииУслугПоставщиков.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	КритерииУслугПоставщиков.АдресСкладаПогрузкиВыгрузки КАК АдресСкладаПогрузкиВыгрузки,
		|	КритерииУслугПоставщиков.ПунктОтправления КАК ПунктОтправления,
		|	КритерииУслугПоставщиков.ПунктНазначения КАК ПунктНазначения,
		|	ТаблицаТарифов.ТерминалПостановкиТип КАК ТерминалПостановкиТип,
		|	ТаблицаТарифов.ТерминалСдачиТип КАК ТерминалСдачиТип,
		|	ТаблицаТарифов.ТерминалПостановки КАК ТерминалПостановки,
		|	ТаблицаТарифов.ТерминалСдачи КАК ТерминалСдачи,
		|	КритерииУслугПоставщиков.ПунктОтправления.Тип КАК ПунктОтправленияТип,
		|	КритерииУслугПоставщиков.ПунктНазначения.Тип КАК ПунктНазначенияТип,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТаблицаТарифов.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТаблицаТарифов.НомерКТК КАК НомерКТК,
		|	ТаблицаТарифов.ТипКТК КАК ТипКТК,
		|	ТаблицаТарифов.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ СобранныеТарифы
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТаблицаТарифов.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И ТаблицаТарифов.ТипКТК = КритерииУслугПоставщиков.ТипоразмерКТК
		|			И (КритерииУслугПоставщиков.Номенклатура В (ЗНАЧЕНИЕ(Справочник.Номенклатура.СНПавтотранспорта), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера), ЗНАЧЕНИЕ(Справочник.Номенклатура.ЭкспедированиеАвтотранспорт), ЗНАЧЕНИЕ(Справочник.Номенклатура.ДопАдрес), ЗНАЧЕНИЕ(Справочник.Номенклатура.БазоваяСтавкаАвто)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобранныеТарифы.НомерСтроки КАК НомерСтроки,
		|	СобранныеТарифы.КлючАналитики КАК КлючАналитики,
		|	СобранныеТарифы.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СобранныеТарифы.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СобранныеТарифы.Критерий КАК Критерий,
		|	СобранныеТарифы.НомерПСЦ КАК НомерПСЦ,
		|	СобранныеТарифы.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СобранныеТарифы.СтавкаНДС КАК СтавкаНДС,
		|	СобранныеТарифы.Стоимость КАК Стоимость,
		|	СобранныеТарифы.Номенклатура КАК Номенклатура,
		|	СобранныеТарифы.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	СобранныеТарифы.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ВЫБОР
		|		КОГДА МультиадресаАдресаАдреса.Адрес ЕСТЬ NULL
		|			ТОГДА СобранныеТарифы.АдресСкладаПогрузкиВыгрузки
		|		ИНАЧЕ МультиадресаАдресаАдреса.Адрес
		|	КОНЕЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктОтправленияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктОтправленияТип <> СобранныеТарифы.ТерминалПостановкиТип
		|			ТОГДА СобранныеТарифы.ПунктОтправления.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктОтправления
		|	КОНЕЦ КАК ПунктОтправления,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктНазначенияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктНазначенияТип <> СобранныеТарифы.ТерминалСдачиТип
		|			ТОГДА СобранныеТарифы.ПунктНазначения.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктНазначения
		|	КОНЕЦ КАК ПунктНазначения,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалПостановки <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалПостановки.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалПостановкиТип <> СобранныеТарифы.ПунктОтправленияТип
		|			ТОГДА СобранныеТарифы.ТерминалПостановки.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалПостановки
		|	КОНЕЦ КАК ТерминалПостановки,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалСдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалСдачиТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалСдачиТип <> СобранныеТарифы.ПунктНазначенияТип
		|			ТОГДА СобранныеТарифы.ТерминалСдачи.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалСдачи
		|	КОНЕЦ КАК ТерминалСдачи,
		|	СобранныеТарифы.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СобранныеТарифы.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СобранныеТарифы.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СобранныеТарифы.НомерКТК КАК НомерКТК,
		|	СобранныеТарифы.ТипКТК КАК ТипКТК,
		|	СобранныеТарифы.АдресПогрузкиВыгрузки КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТарифыСАдресами
		|ИЗ
		|	СобранныеТарифы КАК СобранныеТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдресаАдреса
		|		ПО СобранныеТарифы.АдресСкладаПогрузкиВыгрузки = МультиадресаАдресаАдреса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦ
		|ИЗ
		|	НижнийУровеньАдресаВПСЦНомер КАК НижнийУровеньАдресаВПСЦНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВПСЦНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестреНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестре
		|ИЗ
		|	НижнийУровеньАдресаВРеестреНомер КАК НижнийУровеньАдресаВРеестреНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВРеестреНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.НомерСтроки КАК НомерСтроки,
		|	ТарифыСАдресами.КлючАналитики КАК КлючАналитики,
		|	ТарифыСАдресами.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТарифыСАдресами.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТарифыСАдресами.Критерий КАК Критерий,
		|	ТарифыСАдресами.НомерПСЦ КАК НомерПСЦ,
		|	ТарифыСАдресами.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТарифыСАдресами.СтавкаНДС КАК СтавкаНДС,
		|	ТарифыСАдресами.Стоимость КАК Стоимость,
		|	ТарифыСАдресами.Номенклатура КАК Номенклатура,
		|	ТарифыСАдресами.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	ТарифыСАдресами.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ТарифыСАдресами.ПунктОтправления = ТарифыСАдресами.ТерминалПостановки КАК СовпадениеПунктОтправления,
		|	ТарифыСАдресами.ПунктНазначения = ТарифыСАдресами.ТерминалСдачи КАК СовпадениеПунктНазначения,
		|	ТарифыСАдресами.ПунктОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.ПунктНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка) КАК ПустаяСсылкаМаршрута,
		|	ВЫБОР
		|		КОГДА НижнийУровеньАдресаВРеестре.ВидНайденногоТопонима = ""locality""
		|				ИЛИ НижнийУровеньАдресаВПСЦ.ВидНайденногоТопонима = ""locality""
		|			ТОГДА ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ.Владелец = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка.Владелец
		|		ИНАЧЕ ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|	КОНЕЦ КАК СовпаденииеАдресов,
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТарифыСАдресами.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТарифыСАдресами.НомерКТК КАК НомерКТК,
		|	ТарифыСАдресами.ТипКТК КАК ТипКТК,
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВРеестре КАК НижнийУровеньАдресаВРеестре
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = НижнийУровеньАдресаВРеестре.АдресСкладаПогрузкиВыгрузкиРеестра
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВПСЦ КАК НижнийУровеньАдресаВПСЦ
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = НижнийУровеньАдресаВПСЦ.АдресСкладаПогрузкиВыгрузкиВПСЦ";



	Запрос.УстановитьПараметр("ТаблицаРеестра", Объект.Заказы.Выгрузить());
	ПакетРезультатовЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаПСЦ =ПакетРезультатовЗапросов[1].выгрузить();
	РезультатЗапроса = ПакетРезультатовЗапросов[8].выгрузить();

	Ошибки = Неопределено;

	Для Каждого СтрокаЗаказа Из Объект.Заказы Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("КлючАналитики", СтрокаЗаказа.КлючАналитики);
		СтруктураПоиска.Вставить("ЗапросНаАвто", СтрокаЗаказа.ЗапросНаАвто);
		СтруктураПоиска.Вставить("ЗапросНаАвто", СтрокаЗаказа.ЗапросНаАвто);
		МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() = 0 Тогда
			Если СтрокаЗаказа.ПСЦПоставщика = Документы.ПСЦПоставщика.ПустаяСсылка() Тогда
				СтрокаЗаказа.НомерПСЦПоказ = "";
				СтрокаЗаказа.СтоимостьСНДС = Ложь;
				СтрокаЗаказа.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();				
			Иначе
				МасивПСЦ = ТаблицаПСЦ.НайтиСтроки(СтруктураПоиска); 
				СтрокаЗаказа.НомерПСЦПоказ = МасивПСЦ[0].НомерПСЦ;
	            СтрокаЗаказа.СтоимостьСНДС = МасивПСЦ[0].СуммаВключаетНДС;
				СтрокаЗаказа.СтавкаНДС = МасивПСЦ[0].СтавкаНДС;	
			КонецЕсли;
			
			СтрокаЗаказа.ПростойСверхНормыРуб = 0;
			СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузки = 0;
			СтрокаЗаказа.ПростойАвтотранспортаНаПогрузкеВыгрузкеСверхНормы = "";
			СтрокаЗаказа.Перегруз = 0;
			СтрокаЗаказа.ПерегрузРуб = 0;
			СтрокаЗаказа.НормаЗагрузкиКТК = Справочники.ВесаПоТипоразмерам.ПустаяСсылка();
			СтрокаЗаказа.ЭкспедированиеРуб = 0;
			СтрокаЗаказа.ДопАдресРуб = 0;
			СтрокаЗаказа.БазоваяСтавкаНадбавкаРуб = 0;
			СтрокаЗаказа.ИтоговаяСтоимостьПеревозкиРуб = 0;
			СтрокаЗаказа.ПерегрузОшибка = "";
			СтрокаЗаказа.СНПОшибка = "";
		Иначе

			СтрокаРеквизитовПСЦ = МассивСтрок[0];
	        СтрокаЗаказа.НомерПСЦПоказ = СтрокаРеквизитовПСЦ.НомерПСЦ;
			СтрокаЗаказа.СтавкаНДС = СтрокаРеквизитовПСЦ.СтавкаНДС;
			СтрокаЗаказа.СтоимостьСНДС = СтрокаРеквизитовПСЦ.СуммаВключаетНДС;
		
			СтруктураПоиска.Вставить("Номенклатура", Справочники.Номенклатура.СНПавтотранспорта);
			МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаСтоимостиСНП = Неопределено;	
			Иначе							
				СтрокаСтоимостиСНП = Неопределено;
				
	        	СтруктураПоиска.Вставить("СовпадениеПунктНазначения", Истина);
				СтруктураПоиска.Вставить("СовпаденииеАдресов", Истина);
				СтруктураПоиска.Вставить("СовпадениеПунктОтправления", Истина);
				МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
				Если МассивСтрок.Количество() <> 0 Тогда
					СтрокаСтоимостиСНП = МассивСтрок[0];		
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаСтоимостиСНП) Тогда
					МассивПодобранныхСтрок = Новый Массив();
					
					СтруктураПоиска.Удалить("СовпадениеПунктОтправления");

					РезультатЗапросаБезПунктовОтправления = РезультатЗапроса.Скопировать();
					КолонкаДляУдаления = РезультатЗапросаБезПунктовОтправления.Колонки.Найти("СовпадениеПунктОтправления");
					РезультатЗапросаБезПунктовОтправления.Колонки.Удалить(КолонкаДляУдаления);
					РезультатЗапросаБезПунктовОтправления.Свернуть("КлючАналитики, ЗапросНаАвто, Номенклатура, СовпаденииеАдресов, СовпадениеПунктНазначения, НормативНахожденияНаПогрузке, Стоимость");
					
					МассивСтрок = РезультатЗапросаБезПунктовОтправления.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодобранныхСтрок, МассивСтрок);
					КонецЕсли;			

					СтруктураПоиска.Удалить("СовпадениеПунктНазначения");
					СтруктураПоиска.Вставить("СовпадениеПунктОтправления", Истина);
					
					РезультатЗапросаБезПунктовНазначения = РезультатЗапроса.Скопировать();
					КолонкаДляУдаления = РезультатЗапросаБезПунктовНазначения.Колонки.Найти("СовпадениеПунктНазначения");
					РезультатЗапросаБезПунктовНазначения.Колонки.Удалить(КолонкаДляУдаления);
					РезультатЗапросаБезПунктовНазначения.Свернуть("КлючАналитики, ЗапросНаАвто, Номенклатура, СовпаденииеАдресов, СовпадениеПунктОтправления, НормативНахожденияНаПогрузке, Стоимость");
					
					МассивСтрок = РезультатЗапросаБезПунктовНазначения.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодобранныхСтрок, МассивСтрок);
					КонецЕсли;
					
					Если МассивПодобранныхСтрок.Количество() = 1 Тогда
						СтрокаСтоимостиСНП = МассивПодобранныхСтрок[0];	
					ИначеЕсли МассивПодобранныхСтрок.Количество() > 1 Тогда
						СтрокаСтоимостиСНП = "Ошибка";	
					КонецЕсли;
				КонецЕсли;
				
				СтруктураПоиска.Удалить("СовпаденииеАдресов");
				СтруктураПоиска.Удалить("СовпадениеПунктОтправления");
				СтруктураПоиска.Удалить("СовпадениеПунктНазначения");
				
				Если НЕ ЗначениеЗаполнено(СтрокаСтоимостиСНП) Тогда 
					СтруктураПоиска.Вставить("ПустаяСсылкаМаршрута", Истина);
					МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						СтрокаСтоимостиСНП = МассивСтрок[0];		
					КонецЕсли;
				КонецЕсли;
				СтруктураПоиска.Удалить("ПустаяСсылкаМаршрута");
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(СтрокаСтоимостиСНП) И СтрокаСтоимостиСНП <> "Ошибка" Тогда
				СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузки = СтрокаСтоимостиСНП.НормативНахожденияНаПогрузке;		
				НормативныйСрокПогрузкиВыгрузкиВСек = СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузки * 3600;		
				ПростойНаПогрузкеМин = Цел((СтрокаЗаказа.ДатаИВремяУбытияСПогрузкиВыгрузки - СтрокаЗаказа.ДатаИВремяПрибытияНаПогрузкуВыгрузку - НормативныйСрокПогрузкиВыгрузкиВСек)/60);
				ПростойВЧасах = ПростойНаПогрузкеМин/60;
				ВремяПростоя = ?(ПростойВЧасах-Цел(ПростойВЧасах) = 0.5, ПростойВЧасах, Окр(ПростойВЧасах));			
				СтрокаЗаказа.ПростойСверхНормыРуб = ?(ВремяПростоя > 0 И СтрокаЗаказа.ВремяНаПогрузке < 1440, ВремяПростоя * СтрокаСтоимостиСНП.Стоимость, 0);
				СтрокаЗаказа.ПростойАвтотранспортаНаПогрузкеВыгрузкеСверхНормы = ?(СтрокаЗаказа.ВремяНаПогрузке < 1440, ПолучитьЧасыМинутыСтрокой(ПростойНаПогрузкеМин), "Расчет невозможен");
				СтрокаЗаказа.СНПОшибка = "";
			Иначе
				СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузки = 0;
				СтрокаЗаказа.ПростойСверхНормыРуб = 0;
				СтрокаЗаказа.ПростойАвтотранспортаНаПогрузкеВыгрузкеСверхНормы = "";
				СтрокаЗаказа.СНПОшибка = "Ставка не найдена";
				Если СтрокаСтоимостиСНП = "Ошибка" Тогда
					ТекстСообщения = СтрШаблон("Не найдена ставка за «СНП» в строке №%1, т.к. в ПСЦ есть несколько тарифов, отвечающих запросу, необходимо уточнить маршрут", СтрокаЗаказа.НомерСтроки);
				Иначе
					ТекстСообщения = СтрШаблон("В строке №%1 Не найдена ставка для расчета простоя сверх нормы , т.к. не найдено совпадения по маршруту", СтрокаЗаказа.НомерСтроки);
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ,ТекстСообщения);
			КонецЕсли;
			
			СтруктураПоиска.Вставить("Номенклатура", Справочники.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера);
			МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаСтоимостиПерегруз = Неопределено;
			Иначе
				СтрокаСтоимостиПерегруз = Неопределено;
				
	        	СтруктураПоиска.Вставить("СовпадениеПунктНазначения", Истина);
				СтруктураПоиска.Вставить("СовпаденииеАдресов", Истина);
				СтруктураПоиска.Вставить("СовпадениеПунктОтправления", Истина);
				МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
				Если МассивСтрок.Количество() <> 0 Тогда
					СтрокаСтоимостиПерегруз = МассивСтрок[0];		
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаСтоимостиПерегруз) Тогда
                    МассивПодобранныхСтрок = Новый Массив();
					СтруктураПоиска.Удалить("СовпадениеПунктОтправления");
					
					РезультатЗапросаБезПунктовОтправления = РезультатЗапроса.Скопировать();
					КолонкаДляУдаления = РезультатЗапросаБезПунктовОтправления.Колонки.Найти("СовпадениеПунктОтправления");
					РезультатЗапросаБезПунктовОтправления.Колонки.Удалить(КолонкаДляУдаления);
					РезультатЗапросаБезПунктовОтправления.Свернуть("КлючАналитики, ЗапросНаАвто, Номенклатура, СовпаденииеАдресов, СовпадениеПунктНазначения, НормаЗагрузкиКТК, Стоимость");
					
					МассивСтрок = РезультатЗапросаБезПунктовОтправления.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодобранныхСтрок, МассивСтрок);		
					КонецЕсли;
					
					СтруктураПоиска.Удалить("СовпадениеПунктНазначения");
					СтруктураПоиска.Вставить("СовпадениеПунктОтправления", Истина);
					
					РезультатЗапросаБезПунктовНазначения = РезультатЗапроса.Скопировать();
					КолонкаДляУдаления = РезультатЗапросаБезПунктовНазначения.Колонки.Найти("СовпадениеПунктНазначения");
					РезультатЗапросаБезПунктовНазначения.Колонки.Удалить(КолонкаДляУдаления);
					РезультатЗапросаБезПунктовНазначения.Свернуть("КлючАналитики, ЗапросНаАвто, Номенклатура, СовпаденииеАдресов, СовпадениеПунктОтправления, НормаЗагрузкиКТК, Стоимость");
					
					МассивСтрок = РезультатЗапросаБезПунктовНазначения.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодобранныхСтрок, МассивСтрок);		
					КонецЕсли;
					
					Если МассивПодобранныхСтрок.Количество() = 1 Тогда
						СтрокаСтоимостиПерегруз = МассивПодобранныхСтрок[0];	
					ИначеЕсли МассивПодобранныхСтрок.Количество() > 1 Тогда
						СтрокаСтоимостиПерегруз = "Ошибка";	
					КонецЕсли;
				КонецЕсли;
				
				СтруктураПоиска.Удалить("СовпаденииеАдресов");
				СтруктураПоиска.Удалить("СовпадениеПунктОтправления");
				СтруктураПоиска.Удалить("СовпадениеПунктНазначения");
				
				Если НЕ ЗначениеЗаполнено(СтрокаСтоимостиПерегруз) Тогда 
					СтруктураПоиска.Вставить("ПустаяСсылкаМаршрута", Истина);
					МассивСтрок = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрок.Количество() <> 0 Тогда
						СтрокаСтоимостиПерегруз = МассивСтрок[0];		
					КонецЕсли;
				КонецЕсли;
				
				СтруктураПоиска.Удалить("ПустаяСсылкаМаршрута");
				
			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаСтоимостиПерегруз) И СтрокаСтоимостиПерегруз <> "Ошибка" Тогда
		    	СтрокаЗаказа.НормаЗагрузкиКТК = СтрокаСтоимостиПерегруз.НормаЗагрузкиКТК;
				Перегруз = ?(СтрокаЗаказа.НормаЗагрузкиКТК <> Справочники.ВесаПоТипоразмерам.ПустаяСсылка(), СтрокаЗаказа.ВесНетто - ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСтоимостиПерегруз.НормаЗагрузкиКТК,"Вес"), 0);
				СтрокаЗаказа.Перегруз = ?(Перегруз > 0, Перегруз, 0);
				СтрокаЗаказа.ПерегрузРуб = СтрокаЗаказа.Перегруз * СтрокаСтоимостиПерегруз.Стоимость / 1000;
				СтрокаЗаказа.ПерегрузОшибка = "";
			Иначе
				СтрокаЗаказа.НормаЗагрузкиКТК = Справочники.ВесаПоТипоразмерам.ПустаяСсылка();
				СтрокаЗаказа.Перегруз = 0;
				СтрокаЗаказа.ПерегрузРуб = 0;
				СтрокаЗаказа.ПерегрузОшибка = "Ставка не найдена";
				
				Если СтрокаСтоимостиПерегруз = "Ошибка" Тогда
					ТекстСообщения = СтрШаблон("Не найдена ставка за «Перегруз» в строке №%1, т.к. в ПСЦ есть несколько тарифов, отвечающих запросу, необходимо уточнить маршрут", СтрокаЗаказа.НомерСтроки);
				Иначе
					ТекстСообщения = СтрШаблон("В строке %1 Не найдена ставка для расчета перегруза , т.к. не найдено совпадения по маршруту", СтрокаЗаказа.НомерСтроки);
				КонецЕсли;

				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ,ТекстСообщения);
			КонецЕсли;
			
			
			
			СтрокаЗаказа.ЭкспедированиеРуб = ?(СтрокаЗаказа.Экспедирование,ПолучитьСтоимостьПоНоменклатура(РезультатЗапроса, СтруктураПоиска, Справочники.Номенклатура.ЭкспедированиеАвтотранспорт), 0);
			СтрокаЗаказа.ДопАдресРуб = ?(СтрокаЗаказа.ДопАдресаКоличество <> 0, СтрокаЗаказа.ДопАдресаКоличество * ПолучитьСтоимостьПоНоменклатура(РезультатЗапроса, СтруктураПоиска, Справочники.Номенклатура.ДопАдрес), 0);
			СтрокаЗаказа.БазоваяСтавкаНадбавкаРуб = ?(СтрокаЗаказа.БазоваяСтавкаНадбавка, ПолучитьСтоимостьПоНоменклатура(РезультатЗапроса, СтруктураПоиска, Справочники.Номенклатура.БазоваяСтавкаАвто), 0);
			
			ВремяНаПогрузкеМин = Цел((СтрокаЗаказа.ДатаИВремяУбытияСПогрузкиВыгрузки - СтрокаЗаказа.ДатаИВремяПрибытияНаПогрузкуВыгрузку)/60);
			СтрокаЗаказа.ВремяНаПогрузкеЗагрузке = ?(ВремяНаПогрузкеМин < 1440, ПолучитьЧасыМинутыСтрокой(ВремяНаПогрузкеМин), "");
			СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузкиСтрока = ПолучитьЧасыМинутыСтрокой(СтрокаЗаказа.НормативныйСрокПогрузкиВыгрузки * 60);
    	КонецЕсли;
	КонецЦикла;
	
	Если Ошибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);	
	КонецЕсли;
	РассчитатьСуммуВСтроках();
	РасчетСуммы();

КонецФункции                                                                      

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЧасыМинутыСтрокой(Минут)
	
	Если Минут > 0 Тогда
		Часы = Цел(Минут / 60);
		Минуты = Минут % 60;
		ПараметрыФорматаЧасы = ?(Часы > 99, "ЧЦ=3; ЧН=00; ЧВН=", "ЧЦ=2; ЧН=00; ЧВН=");
		ЧасыСтрокой = Формат(Часы, ПараметрыФорматаЧасы);
		МинутыСтрокой = Формат(Минуты, "ЧЦ=2; ЧН=00; ЧВН=");
		
		ЧасыМинутыСтрокой = СтрШаблон("%1:%2", ЧасыСтрокой, МинутыСтрокой);
	Иначе
		ЧасыМинутыСтрокой = "";
	КонецЕсли;
	
	Возврат ЧасыМинутыСтрокой;
		
КонецФункции 

&НаСервере
Процедура РасчетСуммы()
	КолВоСтрокСНДС = Объект.Заказы.НайтиСтроки(Новый Структура("СтоимостьСНДС",Истина)).Количество();
	КолВоСтрокБезНДС = Объект.Заказы.НайтиСтроки(Новый Структура("СтоимостьСНДС",Ложь)).Количество();
	Если КолВоСтрокСНДС > 0 И КолВоСтрокБезНДС > 0 Тогда
		СуммаСНДС = 0;
		СуммаБезНДС = 0;
		ОбщегоНазначения.СообщитьПользователю("Невозможно рассчитать итоговую сумму, т.к. разные значения в поле «Стоимость с НДС»");		
	ИначеЕсли КолВоСтрокСНДС > 0 Тогда
		СуммаСНДС = Объект.Заказы.Итог("ИтоговаяСтоимостьПеревозкиРуб");
		СуммаБезНДС = 0;
	ИначеЕсли КолВоСтрокБезНДС > 0 Тогда
		СуммаСНДС = 0;
		СуммаБезНДС = Объект.Заказы.Итог("ИтоговаяСтоимостьПеревозкиРуб");
	Иначе
		СуммаСНДС = 0;
		СуммаБезНДС = 0;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВниз()
	ТекД = Элементы.РеестрАвтоподрядчика.ТекущиеДанные;
	ИндексСтроки = Элементы.РеестрАвтоподрядчика.ТекущаяСтрока;
	Если Текд <> Неопределено Тогда
		
		ИмяЭлемента = Элементы.РеестрАвтоподрядчика.ТекущийЭлемент.Имя;
		
		Если ИмяЭлемента = "РеестрАвтоподрядчикаНомерПСЦ" Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].ПСЦПоставщика = ТекД.ПСЦПоставщика;	
			КонецЦикла;
		ИначеЕсли ИмяЭлемента = "РеестрАвтоподрядчикаНормативныйСрокПогрузкиВыгрузкиСтрока" Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].НормативныйСрокПогрузкиВыгрузки = ТекД.НормативныйСрокПогрузкиВыгрузки;	
			КонецЦикла;
		ИначеЕсли ИмяЭлемента = "РеестрАвтоподрядчикаБазоваяСтавкаНадбавка" Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].БазоваяСтавкаНадбавка = ТекД.БазоваяСтавкаНадбавка;	
			КонецЦикла;
		ИначеЕсли ИмяЭлемента = "РеестрАвтоподрядчикаДатаВремяПодачиКТКПлан" Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].ДатаВремяПодачиКТКПлан = ТекД.ДатаВремяПодачиКТКПлан;	
			КонецЦикла;
		ИначеЕсли ИмяЭлемента = "РеестрАвтоподрядчикаДопАдресКол" Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].ДопАдресаКоличество = ТекД.ДопАдресаКоличество;	
			КонецЦикла;
		КонецЕсли;
		ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика();
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНормыВремениНаПогрузкуВыгрузку(ТекДанные)
	
	Строки = СтрРазделить(ТекДанные.НормативныйСрокПогрузкиВыгрузкиСтрока, ":");
	Часов = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[0]);
	Если Строки.Количество() > 1 Тогда
		Минут = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[1]);
	Иначе
		Минут = 0;
	КонецЕсли;
	ТекДанные.НормативныйСрокПогрузкиВыгрузкиСтрока =ПолучитьЧасыМинутыСтрокой(Часов * 60 + Минут);
				
	ДробнаяЧасть = Окр(Минут / 60, 2);	
	НормативЧисло = Часов + ДробнаяЧасть;
	
	ТекДанные.НормативныйСрокПогрузкиВыгрузки = НормативЧисло;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетФактуру(СсылкаПТУ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураПолученный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка
		|			И (СчетФактураПолученный.ДокументОснование = &ДокументОснование)
		|			И СчетФактураПолученный.НомерВходящегоДокумента = ПоступлениеТоваровУслуг.НомерВходящегоДокумента
		|ГДЕ
		|	СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаПТУ);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Документы.СчетФактураПолученный.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьСтоимостьПоНоменклатура(ТаблицаРезультатов, СтруктураПоиска, ВидНоменклатуры)
	СтруктураПоиска.Вставить("Номенклатура", ВидНоменклатуры);
	МассивСтрок = ТаблицаРезультатов.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат 0;	
	Иначе
		СтрокаСтоимости = МассивСтрок[0];
		Возврат СтрокаСтоимости.Стоимость;	
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполненностьНормативногоСрокаПогрузкиВыгрузки()
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("НормативныйСрокПогрузкиВыгрузки", 0);
	НезаполненныеСтроки = Объект.Заказы.НайтиСтроки(СтруктураПоиска);
	Если НезаполненныеСтроки.Количество() = 1 Тогда
		ТекстСообщения = "Заполните нормативный срок погрузки/выгрузки на вкладке ""Реестр автоподрядчика"" в строке №" + НезаполненныеСтроки[0].НомерСтроки;	
	ИначеЕсли НезаполненныеСтроки.Количество() > 1 Тогда
		НомераСтрок = "";
		Для Каждого Строка Из НезаполненныеСтроки Цикл
			НомераСтрок = ?(ЗначениеЗаполнено(НомераСтрок), НомераСтрок + ", " + Строка.НомерСтроки, НомераСтрок + Строка.НомерСтроки);  
		КонецЦикла;
		
		ТекстСообщения = "Заполните нормативный срок погрузки/выгрузки на вкладке ""Реестр автоподрядчика"" в строках №" + НомераСтрок;
	Иначе
		Возврат
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

//Временное решение пока решается вопрос с сыллками на адреса
&НаСервере
Процедура ЗаполнитьСсылкаНаАдреса()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЧРеестра.КлючАналитики КАК Справочник.КлючиАналитикиПеревозки) КАК КлючАналитики,
		|	ТЧРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТЧРеестра.АдресПогрузкиВыгрузки КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ ГуидЗаказаНаТС
		|ИЗ
		|	&ТаблицаРеестра КАК ТЧРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГуидЗаказаНаТС.КлючАналитики КАК КлючАналитики,
		|	ГуидЗаказаНаТС.ЗапросНаАвто КАК ЗапросНаАвто,
		|	АдресаВНаселенныхПунктах.Ссылка КАК Ссылка
		|ИЗ
		|	ГуидЗаказаНаТС КАК ГуидЗаказаНаТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
		|		ПО ГуидЗаказаНаТС.АдресПогрузкиВыгрузки = АдресаВНаселенныхПунктах.Адрес
		|ГДЕ
		|	АдресаВНаселенныхПунктах.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТаблицаРеестра", Объект.Заказы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиЗаполнения = Объект.Заказы.НайтиСтроки(Новый Структура("КлючАналитики, ЗапросНаАвто, ИдентификаторСтрокиЗапросаНаАвтоперевозку",
			ВыборкаДетальныеЗаписи.КлючАналитики, ВыборкаДетальныеЗаписи.ЗапросНаАвто, ВыборкаДетальныеЗаписи.ИдентификаторСтрокиЗапросаНаАвтоперевозку));
		
		Если СтрокиЗаполнения.количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		
		СтрокаЗаполнения = СтрокиЗаполнения[0];
		Если СтрокаЗаполнения.АдресПогрузкиВыгрузкиСсылка = Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка() Тогда
			СтрокаЗаполнения.АдресПогрузкиВыгрузкиСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнуюСтавку(Перезаполнить = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРеестра.КлючАналитики КАК КлючАналитики,
		|	ТаблицаРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТаблицаРеестра.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТаблицаРеестра.ТипКТК КАК ТипКТК,
		|	ТаблицаРеестра.ПСЦПоставщика КАК СсылкиПСЦ,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.ТерминалПостановки КАК Справочник.Локации) КАК ТерминалПостановки,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.ТерминалСдачи КАК Справочник.Локации) КАК ТерминалСдачи,
		|	ТаблицаРеестра.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТаблицаРеестра.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТаблицаРеестра.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТаблицаРеестра.НомерКТК КАК НомерКТК,
		|	ВЫРАЗИТЬ(ТаблицаРеестра.АдресПогрузкиВыгрузкиСсылка КАК Справочник.АдресаВНаселенныхПунктах) КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ СсылкиСтрок
		|ИЗ
		|	&ТаблицаРеестра КАК ТаблицаРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПоставщиков.НомерСтроки КАК НомерСтроки,
		|	СсылкиСтрок.КлючАналитики КАК КлючАналитики,
		|	СсылкиСтрок.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СсылкиСтрок.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТарифыПоставщиков.Критерий КАК Критерий,
		|	ПСЦПоставщика.НомерПСЦ КАК НомерПСЦ,
		|	ПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ПСЦПоставщика.СтавкаНДС КАК СтавкаНДС,
		|	СсылкиСтрок.ТипКТК КАК ТипКТК,
		|	СсылкиСтрок.СсылкиПСЦ КАК СсылкиПСЦ,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщика.СуммаВключаетНДС
		|			ТОГДА ТарифыПоставщиков.СтоимостьСНДС
		|		ИНАЧЕ ТарифыПоставщиков.СтоимостьБезНДС
		|	КОНЕЦ КАК Стоимость,
		|	ЛокацииПостановки.Тип КАК ТерминалПостановкиТип,
		|	ЛокацииСдачи.Тип КАК ТерминалСдачиТип,
		|	СсылкиСтрок.ТерминалПостановки КАК ТерминалПостановки,
		|	СсылкиСтрок.ТерминалСдачи КАК ТерминалСдачи,
		|	СсылкиСтрок.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СсылкиСтрок.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СсылкиСтрок.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СсылкиСтрок.НомерКТК КАК НомерКТК,
		|	СсылкиСтрок.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТаблицаТарифов
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|		ПО ТарифыПоставщиков.Регистратор = ПСЦПоставщика.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СсылкиСтрок КАК СсылкиСтрок
		|		ПО ТарифыПоставщиков.Регистратор = СсылкиСтрок.СсылкиПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииПостановки
		|		ПО (СсылкиСтрок.ТерминалПостановки = ЛокацииПостановки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииСдачи
		|		ПО (СсылкиСтрок.ТерминалСдачи = ЛокацииСдачи.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТарифов.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТарифов.КлючАналитики КАК КлючАналитики,
		|	ТаблицаТарифов.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТаблицаТарифов.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТаблицаТарифов.Критерий КАК Критерий,
		|	ТаблицаТарифов.НомерПСЦ КАК НомерПСЦ,
		|	ТаблицаТарифов.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТаблицаТарифов.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТарифов.Стоимость КАК Стоимость,
		|	КритерииУслугПоставщиков.Номенклатура КАК Номенклатура,
		|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	КритерииУслугПоставщиков.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	КритерииУслугПоставщиков.АдресСкладаПогрузкиВыгрузки КАК АдресСкладаПогрузкиВыгрузки,
		|	КритерииУслугПоставщиков.ПунктОтправления КАК ПунктОтправления,
		|	КритерииУслугПоставщиков.ПунктНазначения КАК ПунктНазначения,
		|	ТаблицаТарифов.ТерминалПостановки.Тип КАК ТерминалПостановкиТип,
		|	ТаблицаТарифов.ТерминалСдачи.Тип КАК ТерминалСдачиТип,
		|	ТаблицаТарифов.ТерминалПостановки КАК ТерминалПостановки,
		|	ТаблицаТарифов.ТерминалСдачи КАК ТерминалСдачи,
		|	КритерииУслугПоставщиков.ПунктОтправления.Тип КАК ПунктОтправленияТип,
		|	КритерииУслугПоставщиков.ПунктНазначения.Тип КАК ПунктНазначенияТип,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТаблицаТарифов.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТаблицаТарифов.НомерКТК КАК НомерКТК,
		|	ТаблицаТарифов.ТипКТК КАК ТипКТК,
		|	ТаблицаТарифов.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ СобранныеТарифы
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТаблицаТарифов.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И ТаблицаТарифов.ТипКТК = КритерииУслугПоставщиков.ТипоразмерКТК
		|			И (КритерииУслугПоставщиков.Номенклатура В (ЗНАЧЕНИЕ(Справочник.Номенклатура.СНПавтотранспорта), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера), ЗНАЧЕНИЕ(Справочник.Номенклатура.ЭкспедированиеАвтотранспорт), ЗНАЧЕНИЕ(Справочник.Номенклатура.ДопАдрес), ЗНАЧЕНИЕ(Справочник.Номенклатура.БазоваяСтавкаАвто), ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер), ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаПорожнийКонтейнер)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТарифов.НомерСтроки,
		|	ТаблицаТарифов.КлючАналитики,
		|	ТаблицаТарифов.ЗапросНаАвто,
		|	ТаблицаТарифов.ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТаблицаТарифов.Критерий,
		|	ТаблицаТарифов.НомерПСЦ,
		|	ТаблицаТарифов.СуммаВключаетНДС,
		|	ТаблицаТарифов.СтавкаНДС,
		|	ТаблицаТарифов.Стоимость,
		|	КритерииУслугПоставщиков.Номенклатура,
		|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке,
		|	КритерииУслугПоставщиков.НормаЗагрузкиКТК,
		|	КритерииУслугПоставщиков.АдресСкладаПогрузкиВыгрузки,
		|	КритерииУслугПоставщиков.ПунктОтправления,
		|	КритерииУслугПоставщиков.ПунктНазначения,
		|	ТаблицаТарифов.ТерминалПостановки.Тип,
		|	ТаблицаТарифов.ТерминалСдачи.Тип,
		|	ТаблицаТарифов.ТерминалПостановки,
		|	ТаблицаТарифов.ТерминалСдачи,
		|	КритерииУслугПоставщиков.ПунктОтправления.Тип,
		|	КритерииУслугПоставщиков.ПунктНазначения.Тип,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеПостановки,
		|	ТаблицаТарифов.ТипОперацииНаТерминалеСдачи,
		|	ТаблицаТарифов.БазоваяСтавкаНадбавка,
		|	ТаблицаТарифов.НомерКТК,
		|	ТаблицаТарифов.ТипКТК,
		|	ТаблицаТарифов.АдресПогрузкиВыгрузкиСсылка
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТаблицаТарифов.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И (КритерииУслугПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобранныеТарифы.НомерСтроки КАК НомерСтроки,
		|	СобранныеТарифы.КлючАналитики КАК КлючАналитики,
		|	СобранныеТарифы.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СобранныеТарифы.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СобранныеТарифы.Критерий КАК Критерий,
		|	СобранныеТарифы.НомерПСЦ КАК НомерПСЦ,
		|	СобранныеТарифы.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СобранныеТарифы.СтавкаНДС КАК СтавкаНДС,
		|	СобранныеТарифы.Стоимость КАК Стоимость,
		|	СобранныеТарифы.Номенклатура КАК Номенклатура,
		|	СобранныеТарифы.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	СобранныеТарифы.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ВЫБОР
		|		КОГДА МультиадресаАдресаАдреса.Адрес ЕСТЬ NULL
		|			ТОГДА СобранныеТарифы.АдресСкладаПогрузкиВыгрузки
		|		ИНАЧЕ МультиадресаАдресаАдреса.Адрес
		|	КОНЕЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктОтправленияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктОтправленияТип <> СобранныеТарифы.ТерминалПостановкиТип
		|			ТОГДА СобранныеТарифы.ПунктОтправления.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктОтправления
		|	КОНЕЦ КАК ПунктОтправления,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ПунктНазначенияТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ПунктНазначенияТип <> СобранныеТарифы.ТерминалСдачиТип
		|			ТОГДА СобранныеТарифы.ПунктНазначения.Родитель
		|		ИНАЧЕ СобранныеТарифы.ПунктНазначения
		|	КОНЕЦ КАК ПунктНазначения,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалПостановки <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалПостановки.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалПостановкиТип <> СобранныеТарифы.ПунктОтправленияТип
		|			ТОГДА СобранныеТарифы.ТерминалПостановки.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалПостановки
		|	КОНЕЦ КАК ТерминалПостановки,
		|	ВЫБОР
		|		КОГДА СобранныеТарифы.ТерминалСдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|				И СобранныеТарифы.ТерминалСдачиТип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
		|				И СобранныеТарифы.ТерминалСдачиТип <> СобранныеТарифы.ПунктНазначенияТип
		|			ТОГДА СобранныеТарифы.ТерминалСдачи.Родитель
		|		ИНАЧЕ СобранныеТарифы.ТерминалСдачи
		|	КОНЕЦ КАК ТерминалСдачи,
		|	СобранныеТарифы.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	СобранныеТарифы.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	СобранныеТарифы.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	СобранныеТарифы.НомерКТК КАК НомерКТК,
		|	СобранныеТарифы.ТипКТК КАК ТипКТК,
		|	СобранныеТарифы.АдресПогрузкиВыгрузки КАК АдресПогрузкиВыгрузкиСсылка
		|ПОМЕСТИТЬ ТарифыСАдресами
		|ИЗ
		|	СобранныеТарифы КАК СобранныеТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдресаАдреса
		|		ПО СобранныеТарифы.АдресСкладаПогрузкиВыгрузки = МультиадресаАдресаАдреса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВПСЦ
		|ИЗ
		|	НижнийУровеньАдресаВПСЦНомер КАК НижнийУровеньАдресаВПСЦНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВПСЦНомер.АдресСкладаПогрузкиВыгрузкиВПСЦ = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВПСЦНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестреНомер
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра КАК АдресСкладаПогрузкиВыгрузкиРеестра,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима
		|ПОМЕСТИТЬ НижнийУровеньАдресаВРеестре
		|ИЗ
		|	НижнийУровеньАдресаВРеестреНомер КАК НижнийУровеньАдресаВРеестреНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ПО НижнийУровеньАдресаВРеестреНомер.АдресСкладаПогрузкиВыгрузкиРеестра = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
		|			И НижнийУровеньАдресаВРеестреНомер.НомерСтроки = АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСАдресами.НомерСтроки КАК НомерСтроки,
		|	ТарифыСАдресами.КлючАналитики КАК КлючАналитики,
		|	ТарифыСАдресами.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТарифыСАдресами.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТарифыСАдресами.Критерий КАК Критерий,
		|	ТарифыСАдресами.НомерПСЦ КАК НомерПСЦ,
		|	ТарифыСАдресами.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ТарифыСАдресами.СтавкаНДС КАК СтавкаНДС,
		|	ТарифыСАдресами.Стоимость КАК Стоимость,
		|	ТарифыСАдресами.Номенклатура КАК Номенклатура,
		|	ТарифыСАдресами.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
		|	ТарифыСАдресами.НормаЗагрузкиКТК КАК НормаЗагрузкиКТК,
		|	ТарифыСАдресами.ПунктОтправления = ТарифыСАдресами.ТерминалПостановки КАК СовпадениеПунктОтправления,
		|	ТарифыСАдресами.ПунктНазначения = ТарифыСАдресами.ТерминалСдачи КАК СовпадениеПунктНазначения,
		|	ТарифыСАдресами.ПунктОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.ПунктНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|		И ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка) КАК ПустаяСсылкаМаршрута,
		|	ВЫБОР
		|		КОГДА НижнийУровеньАдресаВРеестре.ВидНайденногоТопонима = ""locality""
		|				ИЛИ НижнийУровеньАдресаВПСЦ.ВидНайденногоТопонима = ""locality""
		|			ТОГДА ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ.Владелец = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка.Владелец
		|		ИНАЧЕ ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка
		|	КОНЕЦ КАК СовпаденииеАдресов,
		|	ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ КАК АдресСкладаПогрузкиВыгрузкиВПСЦ,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеПостановки КАК ТипОперацииНаТерминалеПостановки,
		|	ТарифыСАдресами.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ТарифыСАдресами.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
		|	ТарифыСАдресами.НомерКТК КАК НомерКТК,
		|	ТарифыСАдресами.ТипКТК КАК ТипКТК,
		|	ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка КАК АдресПогрузкиВыгрузки
		|ПОМЕСТИТЬ СборнаяТаблица
		|ИЗ
		|	ТарифыСАдресами КАК ТарифыСАдресами
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВРеестре КАК НижнийУровеньАдресаВРеестре
		|		ПО ТарифыСАдресами.АдресПогрузкиВыгрузкиСсылка = НижнийУровеньАдресаВРеестре.АдресСкладаПогрузкиВыгрузкиРеестра
		|		ЛЕВОЕ СОЕДИНЕНИЕ НижнийУровеньАдресаВПСЦ КАК НижнийУровеньАдресаВПСЦ
		|		ПО ТарифыСАдресами.АдресСкладаПогрузкиВыгрузкиВПСЦ = НижнийУровеньАдресаВПСЦ.АдресСкладаПогрузкиВыгрузкиВПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики КАК КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Номенклатура КАК Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СборнаяТаблица.КлючАналитики КАК КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто КАК ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость КАК Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов КАК ПолноеСовпадениеМаршрута,
		|	СборнаяТаблица.Номенклатура КАК Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК = ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.АдресСкладаПогрузкиВыгрузкиВПСЦ = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаПорожнийКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ЛОЖЬ
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ЛОЖЬ
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ИСТИНА
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ЛОЖЬ
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СборнаяТаблица.КлючАналитики,
		|	СборнаяТаблица.ЗапросНаАвто,
		|	СборнаяТаблица.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	СборнаяТаблица.Стоимость,
		|	СборнаяТаблица.СовпадениеПунктОтправления
		|		И СборнаяТаблица.СовпадениеПунктНазначения
		|		И СборнаяТаблица.СовпаденииеАдресов,
		|	СборнаяТаблица.Номенклатура
		|ИЗ
		|	СборнаяТаблица КАК СборнаяТаблица
		|ГДЕ
		|	СборнаяТаблица.БазоваяСтавкаНадбавка = ЛОЖЬ
		|	И СборнаяТаблица.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.ТипКТК <> ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)
		|	И СборнаяТаблица.АдресПогрузкиВыгрузки <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеПостановки = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК)
		|	И СборнаяТаблица.ТипОперацииНаТерминалеСдачи = ЗНАЧЕНИЕ(Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК)
		|	И СборнаяТаблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
		|	И СборнаяТаблица.СовпадениеПунктОтправления = ЛОЖЬ
		|	И СборнаяТаблица.СовпадениеПунктНазначения = ИСТИНА
		|	И СборнаяТаблица.СовпаденииеАдресов = ИСТИНА";

	Запрос.УстановитьПараметр("ТаблицаРеестра", Объект.Заказы.Выгрузить());
	ПакетРезультатовЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТаблицаОсновныхСтавок = ПакетРезультатовЗапросов[10].Выгрузить();
	ТаблицаНаличияКотировок = ПакетРезультатовЗапросов[9].Выгрузить(); 
	Ошибки = Неопределено;
	
	Для ИндексСтроки = ?(Перезаполнить, 0,Элементы.РеестрАвтоподрядчика.ТекущаяСтрока) По ?(ЗаполнятьВниз ИЛИ Перезаполнить, Объект.Заказы.Количество() - 1, Элементы.РеестрАвтоподрядчика.ТекущаяСтрока) Цикл
		СтрокаЗаказа = Объект.Заказы[ИндексСтроки];	
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("КлючАналитики", СтрокаЗаказа.КлючАналитики);
		СтруктураПоиска.Вставить("ЗапросНаАвто", СтрокаЗаказа.ЗапросНаАвто);
		СтруктураПоиска.Вставить("ИдентификаторСтрокиЗапросаНаАвтоперевозку", СтрокаЗаказа.ИдентификаторСтрокиЗапросаНаАвтоперевозку);

		СтрокиОсновнойСтавки = ТаблицаОсновныхСтавок.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиОсновнойСтавки.Количество() = 0 Тогда
			СтрокаЗаказа.ОсновнаяСтавка = 0;
			СтрокаЗаказа.ОсновнаяСтавкаОшибка = "Ставка не найдена";
			СтруктураПоиска.Вставить("Номенклатура", Справочники.Номенклатура.АвтоперевозкаГруженыйКонтейнер);
			ОтсутствиеКотировок = ТаблицаНаличияКотировок.НайтиСтроки(СтруктураПоиска).Количество() = 0;
			СтруктураПоиска.Удалить("Номенклатура");
			Если СтрокаЗаказа.БазоваяСтавкаНадбавка Тогда
				
				ТекстОшибки = СтрШаблон("В строке №%1 невозможно подобрать основную ставку - при наличии Базовой ставки расчет не возможен", СтрокаЗаказа.НомерСтроки);
				
			ИначеЕсли СтрокаЗаказа.ТипКТК = Справочники.ТипоразмерыТЕ.ПустаяСсылка() ИЛИ СтрокаЗаказа.НомерКТК = Справочники.ТЕ.ПустаяСсылка() Тогда
				
				ТекстОшибки = СтрШаблон("В строке №%1 невозможно применить ставку по номенклатуре «АвтоперевозкаГруженый КТК»/«АвтоперевозкаПорожнийКТК»", СтрокаЗаказа.НомерСтроки);
				
			ИначеЕсли СтрокаЗаказа.АдресПогрузкиВыгрузкиСсылка = Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка() Тогда
				
				Если СтрокаЗаказа.ТерминалПостановки = Справочники.Локации.ПустаяСсылка() 
					ИЛИ СтрокаЗаказа.ТерминалСдачи = Справочники.Локации.ПустаяСсылка() Тогда
					
					ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка по перевозке груженого КТК, т.к. не указан склад погрузки/выгрузки или отсутствует пункт выдачи/сдачи в маршруте", СтрокаЗаказа.НомерСтроки);
				
				ИначеЕсли СтрокаЗаказа.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК 
					И СтрокаЗаказа.ТипОперацииНаТерминалеПостановки = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК Тогда
					
					ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка за перевозку по средней миле, т.к. не найдено совпадения по маршруту", СтрокаЗаказа.НомерСтроки);
					
				ИначеЕсли СтрокаЗаказа.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаПорожнегоКТК
					И СтрокаЗаказа.ТипОперацииНаТерминалеПостановки = Перечисления.ТипОперацииНаТерминале.ПриемПорожнегоКТК Тогда
					
					ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка за перевозку порожнего КТК, т.к. не найдено совпадения по маршруту", СтрокаЗаказа.НомерСтроки);	
					
				Иначе
					
					ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка по перевозке груженого КТК, т.к. не указан склад погрузки/выгрузки или отсутствует пункт выдачи/сдачи в маршруте", СтрокаЗаказа.НомерСтроки);	
					
				КонецЕсли;
				
			ИначеЕсли (СтрокаЗаказа.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК 
				И СтрокаЗаказа.ТипОперацииНаТерминалеПостановки = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК)
				ИЛИ (СтрокаЗаказа.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаПорожнегоКТК
				И СтрокаЗаказа.ТипОперацииНаТерминалеПостановки = Перечисления.ТипОперацииНаТерминале.ПриемПорожнегоКТК) Тогда
				
				ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка, т.к. не найдено совпадения по маршруту и отсутствует один из пунктов выдачи/сдачи КТК", СтрокаЗаказа.НомерСтроки);
				
			ИначеЕсли ОтсутствиеКотировок Тогда
				ТекстОшибки = СтрШаблон("В строке №%1 в ПСЦ по строке Реестра нет котировки по «АвтоперевозкаГруженыйКонтейнер»", СтрокаЗаказа.НомерСтроки);
			Иначе
				ТекстОшибки = СтрШаблон("В строке №%1 Не найдена ставка за перевозку груженого КТК», т.к. не найдено совпадения по маршруту", СтрокаЗаказа.НомерСтроки);		
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ,ТекстОшибки);
		ИначеЕсли СтрокиОсновнойСтавки.Количество() > 1 Тогда
			СтруктураПоиска.Вставить("ПолноеСовпадениеМаршрута",Истина);
			СтрокиОсновнойСтавки = ТаблицаОсновныхСтавок.НайтиСтроки(СтруктураПоиска);
						
			Если СтрокиОсновнойСтавки.Количество() = 1 Тогда
				СтрокаЗаказа.ОсновнаяСтавка = СтрокиОсновнойСтавки[0].Стоимость;
				СтрокаЗаказа.ОсновнаяСтавкаОшибка = "";
			Иначе
				СтрокаЗаказа.ОсновнаяСтавка = 0;
				СтрокаЗаказа.ОсновнаяСтавкаОшибка = "Ставка не найдена";
				ТекстОшибки = СтрШаблон("В строке №%1 не найдена ставка за перевозку груженого КТК, т.к. в ПСЦ есть несколько тарифов, отвечающих запросу, необходимо уточнить маршрут", СтрокаЗаказа.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ,ТекстОшибки);
			КонецЕсли;
			
            СтруктураПоиска.Удалить("ПолноеСовпадениеМаршрута");
		Иначе
			СтрокаЗаказа.ОсновнаяСтавка = СтрокиОсновнойСтавки[0].Стоимость;
			СтрокаЗаказа.ОсновнаяСтавкаОшибка = "";
		КонецЕсли;
	КонецЦикла;

	Если Ошибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);	
	КонецЕсли;
	
	РассчитатьСуммуВСтроках();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВСтроках()
	Для Каждого СтрокаЗаказа Из Объект.Заказы Цикл
		СтрокаЗаказа.ИтоговаяСтоимостьПеревозкиРуб = СтрокаЗаказа.ПростойСверхНормыРуб + СтрокаЗаказа.ПерегрузРуб + СтрокаЗаказа.ЭкспедированиеРуб 
															+ СтрокаЗаказа.ДопАдресРуб + СтрокаЗаказа.БазоваяСтавкаНадбавкаРуб + СтрокаЗаказа.ОсновнаяСтавка + СтрокаЗаказа.ХолостойПрогонРуб;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИзменениеПСЦВТЧ(ВыбранныйПСЦ)
	Если НЕ Объект.ПСЦПоставщика.Пустая() И ВыбранныйПСЦ <> Объект.ПСЦПоставщика Тогда
		Объект.ПСЦПоставщика = Документы.ПСЦПоставщика.ПустаяСсылка();
		ОбщегоНазначения.СообщитьПользователю("Значение по номеру Протокола поставщика в табличной части Реестра отличается от значения в Основных данных, поэтому в Основных данных поле очищено");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СравнениеДанныхКолонкиТЧиЗначенияВШапке(ИмяКолонки)
	Если ИмяКолонки <> "СтавкаНДС" И  ИмяКолонки <> "ПСЦПоставщика" Тогда
		Возврат
	КонецЕсли;
	
	Список = Объект.Заказы.Выгрузить(,ИмяКолонки);
	Список.Свернуть(ИмяКолонки);
	МассивПротоколов = Список.ВыгрузитьКолонку(ИмяКолонки);
	Если МассивПротоколов.Количество() = 1 Тогда
		Объект[ИмяКолонки] = ?(ИмяКолонки = "СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("СтавкаНДС", МассивПротоколов[0]), МассивПротоколов[0]);
	Иначе
		Объект[ИмяКолонки] = ?(ИмяКолонки = "СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка(), Документы[ИмяКолонки].ПустаяСсылка());
	КонецЕсли;
	ОбновлениеПредставленияПСЦ();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеПредставленияПСЦ()
	Если Объект.ПСЦПоставщика = Документы.ПСЦПоставщика.ПустаяСсылка() Тогда
		ПредставлениеПСЦСтрокой = "";
	Иначе
		ДанныеПСЦДляПредставления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПСЦПоставщика,"Дата, НомерПСЦ");
		ПредставлениеПСЦСтрокой = СтрШаблон("%1 от %2", ДанныеПСЦДляПредставления.НомерПСЦ, Формат(ДанныеПСЦДляПредставления.Дата, "ДЛФ=Д"));
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект); 
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Функция ПараметрыФормыВыбораПСЦ()
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	Если НЕ Объект.Договор =ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка") Тогда
		ЭлементОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Объект.Договор;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;

	ЭлементОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проведен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидУслугПоставщика");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки");
	ЭлементОтбора.Использование = Истина;
	
	ГруппаЭлементовОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	 
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Подписано");
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоБезЗамечаний"); 
		
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", НастройкиКД);
	
	Возврат ПараметрыФормы
КонецФункции

&НаСервере
Процедура ПослеВыбораПСЦ(Результат, ДопПараметры)
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	Объект.ПСЦПоставщика = Результат;
	Если ДопПараметры = Истина Тогда
		Для Каждого Стр ИЗ Объект.Заказы Цикл
			Стр.ПСЦПоставщика = Объект.ПСЦПоставщика;
		КонецЦикла;
	Иначе
		ИндексСтроки = Элементы.РеестрАвтоподрядчика.ТекущаяСтрока;
		Если ЗаполнятьВниз Тогда
			Для Индекс = ИндексСтроки По Объект.Заказы.Количество()-1 Цикл
				Объект.Заказы[Индекс].ПСЦПоставщика = Результат;	
			КонецЦикла;	
		Иначе
			Объект.Заказы[ИндексСтроки].ПСЦПоставщика = Результат
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьРасчетныеПоляТаблицаРеестрАвтоподрядчика();
	ЗаполнитьОсновнуюСтавку(Истина);
	ОбновлениеПредставленияПСЦ();
	СравнениеДанныхКолонкиТЧиЗначенияВШапке("ПСЦПоставщика");
	СравнениеДанныхКолонкиТЧиЗначенияВШапке("СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура РеестрАвтоподрядчикаХолостойПрогонПриИзменении(Элемент)
	ПересчитатьХолостойПрогон();
	РассчитатьСуммуВСтроках();
	РасчетСуммы();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьХолостойПрогон(Перезаполнить = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЧРеестра.КлючАналитики КАК Справочник.КлючиАналитикиПеревозки) КАК КлючАналитики,
		|	ТЧРеестра.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ТЧРеестра.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ТЧРеестра.ДатаВремяПодачиКТКПлан КАК ДатаВремяПодачиКТКПлан,
		|	ВЫРАЗИТЬ(ТЧРеестра.ПСЦПоставщика КАК Документ.ПСЦПоставщика) КАК ПСЦСсылка
		|ПОМЕСТИТЬ ГуидЗаказаНаТС
		|ИЗ
		|	&ТаблицаРеестра КАК ТЧРеестра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГуидЗаказаНаТС.КлючАналитики КАК КлючАналитики,
		|	ГуидЗаказаНаТС.ЗапросНаАвто КАК ЗапросНаАвто,
		|	ГуидЗаказаНаТС.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщика.СуммаВключаетНДС
		|			ТОГДА ТарифыПоставщиков.СтоимостьСНДС
		|		ИНАЧЕ ТарифыПоставщиков.СтоимостьБезНДС
		|	КОНЕЦ КАК Стоимость
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|		ПО ТарифыПоставщиков.Регистратор = ПСЦПоставщика.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГуидЗаказаНаТС КАК ГуидЗаказаНаТС
		|		ПО ТарифыПоставщиков.Регистратор = ГуидЗаказаНаТС.ПСЦСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
		|		ПО ТарифыПоставщиков.Критерий = КритерииУслугПоставщиков.Ссылка
		|			И (КритерииУслугПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон))";
	
	Запрос.УстановитьПараметр("ТаблицаРеестра", Объект.Заказы.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для ИндексСтроки = ?(Перезаполнить, 0,Элементы.РеестрАвтоподрядчика.ТекущаяСтрока) По ?(ЗаполнятьВниз ИЛИ Перезаполнить, Объект.Заказы.Количество() - 1, Элементы.РеестрАвтоподрядчика.ТекущаяСтрока) Цикл
		СтрокаЗаказа = Объект.Заказы[ИндексСтроки];
		Если НЕ ЗначениеЗаполнено(СтрокаЗаказа.ХолостойПрогон) ИЛИ СтрокаЗаказа.ХолостойПрогон = Перечисления.ВидыПрогонаТС.ГруженыйПрогон  Тогда
			СтрокаЗаказа.ХолостойПрогонРуб = 0;
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("КлючАналитики", СтрокаЗаказа.КлючАналитики);
		СтруктураПоиска.Вставить("ЗапросНаАвто", СтрокаЗаказа.ЗапросНаАвто);
		СтруктураПоиска.Вставить("ИдентификаторСтрокиЗапросаНаАвтоперевозку", СтрокаЗаказа.ИдентификаторСтрокиЗапросаНаАвтоперевозку);

		Строка = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
		Если Строка.Количество() = 0 Тогда
			СтрокаЗаказа.ХолостойПрогонРуб = 0;	
		Иначе
			СтрокаЗаказа.ХолостойПрогонРуб = Строка[0].Стоимость;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти