
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресХранилища = Параметры.АдресХранилища;
	
	пТаблица = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Таблица.Загрузить(пТаблица);
		
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	мОтвет = Новый Массив;
	
	Для Каждого СтрокаТ Из Таблица Цикл
		Если СтрокаТ.Пометка Тогда
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Строка", СтрокаТ.Текст);
			ПараметрыОповещения.Вставить("ИдентификаторСтрокиСНП", СтрокаТ.ИдентификаторСтроки);
			ПараметрыОповещения.Вставить("ГУИДСтрокиСНП", СтрокаТ.ГУИДСтроки);
			мОтвет.Добавить(ПараметрыОповещения);
		КонецЕсли;	
	КонецЦикла;
	
	Закрыть(мОтвет);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
