
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаУникальностиЗаписи(Отказ);
КонецПроцедуры

Процедура ПроверкаУникальностиЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиВыгрузкиОАД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиВыгрузкиОАД КАК НастройкиВыгрузкиОАД
		|ГДЕ
		|	НастройкиВыгрузкиОАД.Организация = &Организация
		|	И НастройкиВыгрузкиОАД.ИмяТаблицыВыгрузки = &ИмяТаблицыВыгрузки
		|	И НастройкиВыгрузкиОАД.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ИмяТаблицыВыгрузки", ИмяТаблицыВыгрузки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("Запись невозможна. Не уникальная комбинаяция имени таблицы выгрузки и организации.",,,,Отказ)	
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

