
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	РежимРемонтнойВедомости = Перечисления.РежимРемонтнойВедомости.ВведенаВручную;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КалькуляцияРемонтАренда.Записывать = Истина;
	Движение = Движения.КалькуляцияРемонтАренда.Добавить();
	Движение.Вагон = Вагон;
	Движение.Период = ДатаПереводаВНерабочийПарк;
	Движение.ДатаОкончания = ДатаОкончанияРемонта;
	
	// записать данные о рементах в повагонку, если нашли этот вагон
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
	               |			,
	               |			Вагон = &Вагон
	               |				И ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПовагонныеОтправкиСрезПоследних";
	Запрос.УстановитьПараметр("Вагон",Вагон);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
		
		ЗаписьИзменена = Ложь;
		Если ЗначениеЗаполнено(ДатаОкончанияРемонта) Тогда
			ТекЗапись.ВыводИзНРП = ДатаОкончанияРемонта;
			ТекЗапись.ДатаПередачиВПользование = ДатаОкончанияРемонта;
			ЗаписьИзменена = Истина;
		КонецЕсли;
		Если НЕ ТекЗапись.ПереводВНРП = ДатаПереводаВНерабочийПарк Тогда
			ТекЗапись.ПереводВНРП = ДатаПереводаВНерабочийПарк;
			ТекЗапись.ДатаПередачиВПользование = "";
			ЗаписьИзменена = Истина;
		КонецЕсли;
		
		Если ЗаписьИзменена Тогда
			ТекЗапись.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// если вагон в плановых, то нужно обновить данные в плановом регистре. 
	// а если станция отправки совпадает с регионом отправления, перенести данные в повагонные отправки и удалить в плановом регистре
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон
	               |ИЗ
	               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
	               |ГДЕ
	               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
	Запрос.УстановитьПараметр("Вагон",Вагон);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		ТекЗапись = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
		ТекЗапись2 = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
		
		ЗаписьИзменена = Ложь;
		Если НЕ ТекЗапись.ПереводВНРП = ДатаПереводаВНерабочийПарк Тогда
			ТекЗапись.ПереводВНРП = ДатаПереводаВНерабочийПарк;
			ТекЗапись.ДатаПередачиВПользование = "";
			ЗаписьИзменена = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончанияРемонта) Тогда
			ТекЗапись.ВыводИзНРП = ДатаОкончанияРемонта;
			Если ЗначениеЗаполнено(ТекЗапись.ДатаПередачиВПользование) И ТекЗапись.ДатаПередачиВПользование<ДатаОкончанияРемонта Тогда
				ТекЗапись.ДатаПередачиВПользование = ДатаОкончанияРемонта;
				ЗаписьИзменена = Истина;
			КонецЕсли;
			
			// получить текущую дислокацию вагона
			Запрос2 = Новый Запрос;
			Запрос2.Текст = "ВЫБРАТЬ
			                |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
			                |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
			                |ПОМЕСТИТЬ ПериодДисл
			                |ИЗ
			                |	РегистрСведений.ДислокацияВагонов.СрезПоследних(, Вагон = &Вагон) КАК ДислокацияВагоновСрезПоследних
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ДислокацияВагоновСрезПоследних.Вагон
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ
			                |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.ОперацияСВагоном) КАК ОперацияСВагоном,
			                |	ПериодДисл.Период КАК Период,
			                |	ПериодДисл.Вагон КАК Вагон
			                |ПОМЕСТИТЬ ОперацияДисл
			                |ИЗ
			                |	ПериодДисл КАК ПериодДисл
			                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
			                |		ПО ПериодДисл.Период = ДислокацияВагоновСрезПоследних.Период
			                |			И ПериодДисл.Вагон = ДислокацияВагоновСрезПоследних.Вагон
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ПериодДисл.Период,
			                |	ПериодДисл.Вагон
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ
			                |	ДислокацияВагоновСрезПоследних.Период КАК Период,
			                |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
			                |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации
			                |ИЗ
			                |	ОперацияДисл КАК ОперацияДисл
			                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
			                |		ПО ОперацияДисл.Период = ДислокацияВагоновСрезПоследних.Период
			                |			И ОперацияДисл.Вагон = ДислокацияВагоновСрезПоследних.Вагон
			                |			И ОперацияДисл.ОперацияСВагоном = ДислокацияВагоновСрезПоследних.ОперацияСВагоном";
			Запрос2.УстановитьПараметр("Вагон",Вагон);
			Ответ2 = Запрос2.Выполнить().Выбрать();
			Если Ответ2.Следующий() Тогда
			
				РегионОтправленияИерархМассив = Локации_сервер.ПолучитьМассивРодителей(Ответ2.СтанцияОперации,Истина);
				
				Если НЕ РегионОтправленияИерархМассив.Найти(ТекЗапись.РегионОтправления) = Неопределено Тогда
					
					ТекЗапись3 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
					
					ЗаполнитьЗначенияСвойств(ТекЗапись3,ТекЗапись);
					
					ТекЗапись3.Период = ТекЗапись.ВыводИзНРП;
					ТекЗапись3.ДатаПередачиВПользование = ТекЗапись.ВыводИзНРП;
					ТекЗапись3.Записать();
					// Удаление из регистра ВагоныЗапланированныеКПовагонке.
					ТекЗапись.Удалить();
					ЗаписьИзменена = Ложь;
					
				Иначе
					ТекЗапись.Записать();
						
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗаписьИзменена Тогда
			ТекЗапись.Записать();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
