
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Команда)
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 )
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Отказ = Ложь;
	
	Результат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		ИндексСтроки = ТаблицаРезультат.Индекс(Строка);
		Результат.Добавить(Новый Структура("SOCCOC, 
										|	РазмерностьКТК, 
										|	ВалютаЖД,
										|	СтавкаЖД,
										|	ВалютаФРАХТ,
										|	СтавкаФРАХТ", 
										Строка.ПринадлежностьКТК,
										Строка.РазмерностьКТК,
										Строка.ВалютаЖД,
										Строка.СтавкаЖД,
										Строка.ВалютаФРАХТ,
										Строка.СтавкаФРАХТ));
	КонецЦикла;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	
	Счетчик = 2;
	ТаблицаРезультат.Очистить();
	
	ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
	
	Пока ПрочитаннаяСтрока <> "" Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		
		//Клиент = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст);
		//НайденныйКлиент = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Клиент);
		//Если ЗначениеЗаполнено(НайденныйКлиент) Тогда
		//	НоваяСтрока.Клиент = НайденныйКлиент;
		//КонецЕсли;
		ПринадлежностьКТК = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст);
		Если ВРег(ПринадлежностьКТК) = ВРег("SOC") Тогда
			НоваяСтрока.ПринадлежностьКТК = Перечисления.ПринадлежностьТЕ.КТКлиента;
		ИначеЕсли ВРег(ПринадлежностьКТК) = ВРег("COC") Тогда
			НоваяСтрока.ПринадлежностьКТК = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
		КонецЕсли;
		
		РазмерКТК = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C2").Текст);
		Если РазмерКТК = "20" Тогда
			НоваяСтрока.РазмерностьКТК = Справочники.РазмерыКТК.К20;
		ИначеЕсли РазмерКТК = "40" Тогда
			НоваяСтрока.РазмерностьКТК = Справочники.РазмерыКТК.К40;
		ИначеЕсли РазмерКТК = "45" Тогда
			НоваяСтрока.РазмерностьКТК = Справочники.РазмерыКТК.К45;
		КонецЕсли;
		
		ВалютаЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C3").Текст);
		НайденнаяВалюта = Валюта_сервер.ПолучитьВалюту(ВалютаЖД);
		Если ЗначениеЗаполнено(НайденнаяВалюта) Тогда
			НоваяСтрока.ВалютаЖД = НайденнаяВалюта;
		КонецЕсли;
		
		СтавкаЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C4").Текст);
		Если ЗначениеЗаполнено(СтавкаЖД) Тогда
			ЭтоЧисло = ОбщегоНазначенияКлиентСервер.ЭтоЧисло(СтавкаЖД);
			Если ЭтоЧисло Тогда
				НоваяСтрока.СтавкаЖД = СтавкаЖД;
			КонецЕсли;
		КонецЕсли;
		
		ВалютаФрахт = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C5").Текст);
		НайденнаяВалюта = Валюта_сервер.ПолучитьВалюту(ВалютаФрахт);
		Если ЗначениеЗаполнено(НайденнаяВалюта) Тогда
			НоваяСтрока.ВалютаФрахт = НайденнаяВалюта;
		КонецЕсли;
		
		СтавкаФрахт = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C6").Текст);
		Если ЗначениеЗаполнено(СтавкаФрахт) Тогда
			ЭтоЧисло = ОбщегоНазначенияКлиентСервер.ЭтоЧисло(СтавкаФрахт);
			Если ЭтоЧисло Тогда
				НоваяСтрока.СтавкаФрахт = СтавкаФрахт;
			КонецЕсли;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиПунткЖДПортФрахт(Наименование, ЖД = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	Локации.Тип КАК Тип
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование ПОДОБНО &Шаблон
	|	И Локации.Тип В(&Типы)
	|	И НЕ Локации.ПометкаУдаления";
	
	Если ЖД Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
		Запрос.УстановитьПараметр("Типы", МассивТипов);
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		Запрос.УстановитьПараметр("Типы", МассивТипов);
	КонецЕсли;

	//Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование) + "%");
	Запрос.УстановитьПараметр("Шаблон", "%" + Наименование + "%");

	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

&НаСервере
Функция НайтиУсловияПеревозки(Наименование, УсловияПеревозКТК = Истина)
	
	Ответ = Неопределено;
	
	Если УсловияПеревозКТК Тогда
		Если Найти(Наименование, "door") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.DOOR;
		ИначеЕсли Найти(Наименование, "cy") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.CY;
		ИначеЕсли Найти(Наименование, "for") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.FOR;
		ИначеЕсли Найти(Наименование, "lifo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.LIFO;
		ИначеЕсли Найти(Наименование, "fi") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.Fi;
		ИначеЕсли Найти(Наименование, "fo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.Fo;
		КонецЕсли;
	Иначе
		Если Найти(Наименование, "door") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.DOOR;
		ИначеЕсли Найти(Наименование, "fi") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.Fi;
		ИначеЕсли Найти(Наименование, "fo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.Fo;
		ИначеЕсли Найти(Наименование, "li") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LI;
		ИначеЕсли Найти(Наименование, "lo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LO;
		ИначеЕсли Найти(Наименование, "fios") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FIOS;
		ИначеЕсли Найти(Наименование, "filo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FILO;
		ИначеЕсли Найти(Наименование, "lifo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LIFO;
		ИначеЕсли Найти(Наименование, "lilo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LILO;
		ИначеЕсли Найти(Наименование, "exw") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.EXW;
		ИначеЕсли Найти(Наименование, "fca") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FCA;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

