
Функция ПроверитьИзмененияРеквизитов(Объект) Экспорт
	
	РеквизитыДляСравнения = Новый Массив;
	РеквизитыДляСравнения.Добавить("Услуга");
	РеквизитыДляСравнения.Добавить("НомерКТК");
	РеквизитыДляСравнения.Добавить("ФактическаяДатаНачалаПоДаннымКлиента");
	РеквизитыДляСравнения.Добавить("ФактическаяДатаНачалаПоДаннымПодрядчика");
	РеквизитыДляСравнения.Добавить("ФактическаяДатаОкончанияПоДаннымКлиента");
	РеквизитыДляСравнения.Добавить("ФактическаяДатаОкончанияПоДаннымПодрядчика");
	РеквизитыДляСравнения.Добавить("КоличествоСНПвЕдиницеИзмерения");
	РеквизитыДляСравнения.Добавить("КорректировкаСуммыСНП");
	РеквизитыДляСравнения.Добавить("СуммаСкорректирована");
	РеквизитыДляСравнения.Добавить("ВариантВыставленияСчета");
	РеквизитыДляСравнения.Добавить("ОбщаяСуммаСНП");
	РеквизитыДляСравнения.Добавить("Ставка");
	РеквизитыДляСравнения.Добавить("СтавкаПрогрессивная");
	РеквизитыДляСравнения.Добавить("НормативныйСрок");
	РеквизитыДляСравнения.Добавить("ЕдиницаИзмеренияРасчетаСНП");
	РеквизитыДляСравнения.Добавить("СтавкаНДС");
	РеквизитыДляСравнения.Добавить("СтавкаВключаетНДС");
			
	СписокРеквизитовДляСравнения = СтрСоединить(РеквизитыДляСравнения, ",");
	
	ЗначенияРеквизитовРасчетаСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, СписокРеквизитовДляСравнения);
	ЗначенияРеквизитовРасчетаОбъект = Новый Структура(СписокРеквизитовДляСравнения);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовРасчетаОбъект, Объект);
	
	Возврат ОбщегоНазначения.КоллекцииИдентичны(ЗначенияРеквизитовРасчетаОбъект, ЗначенияРеквизитовРасчетаСсылка);
	
КонецФункции

