
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	
	Если ЭтоКорректировка Тогда
		Если Не ЗначениеЗаполнено(ТипКорректировки) Тогда
			Сообщить("Не указан тип корректировки.");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбоснованиеКорректировки) Тогда
			Сообщить("Не указано обоснование корректировки.");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;		
	
	Если ПометкаУдаления И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
		СтатусОтклонен = Перечисления.СтатусыЭтапов.Отклонен;
		
		ДатаВыполнения = ТекущаяДата();
		
		Для Каждого СтрокаТЧ Из Состояния Цикл
			Если СтрокаТЧ.Статус <> СтатусВыполнен И СтрокаТЧ.Статус <> СтатусОтклонен Тогда
				СтрокаТЧ.Статус = СтатусВыполнен;
				СтрокаТЧ.ЗавершениеРаботы = ДатаВыполнения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	
	ПустаяДата = '00010101';
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если Не ЭтоНовый() И СчетПроведен Тогда		
		РеквизитыИзменены = Не Документы.РасчетСНП.ПроверитьИзмененияРеквизитов(ЭтотОбъект);
		Если РеквизитыИзменены Тогда
			ТекстСообщения = "Запрещено изменение реквизитов расчета СНП, так как проведен счет!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФактическаяДатаНачалаПоДаннымПодрядчика) Тогда
		ФактическаяДатаНачала = ФактическаяДатаНачалаПоДаннымПодрядчика;
	ИначеЕсли ЗначениеЗаполнено(ФактическаяДатаНачалаПоДаннымКлиента) Тогда
		ФактическаяДатаНачала = ФактическаяДатаНачалаПоДаннымКлиента;
	Иначе
		ФактическаяДатаНачала = ПустаяДата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФактическаяДатаОкончанияПоДаннымПодрядчика) Тогда
		ФактическаяДатаОкончания = ФактическаяДатаОкончанияПоДаннымПодрядчика;
	ИначеЕсли ЗначениеЗаполнено(ФактическаяДатаОкончанияПоДаннымКлиента) Тогда
		ФактическаяДатаОкончания = ФактическаяДатаОкончанияПоДаннымКлиента;		
	Иначе
		ФактическаяДатаОкончания = ПустаяДата;
	КонецЕсли;

	Если Не ПометкаУдаления Тогда
		
		Если ЗначениеЗаполнено(ФактическаяДатаНачала) И ЗначениеЗаполнено(ФактическаяДатаОкончания) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
			Запрос.УстановитьПараметр("ФактическаяДатаНачала", ФактическаяДатаНачала);
			Запрос.УстановитьПараметр("ФактическаяДатаОкончания", ФактическаяДатаОкончания);
			Запрос.УстановитьПараметр("ЭтоКорректировка", ЭтоКорректировка); //Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
					
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КлючиАналитикиПеревозки1.Ссылка КАК Ключ,
			|	РасчетСНП.Ссылка КАК Ссылка,
			|	РасчетСНП.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
			|	РасчетСНП.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
			|	РасчетСНП.КлючАналитикиПеревозки.Контейнер.Наименование КАК НомерКТК,
			|	РасчетСНП.КлючАналитикиПеревозки.Заявка.Представление КАК ПредставлениеЗаявки
			|ИЗ
			|	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки1
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
			|			ПО КлючиАналитикиПеревозки1.Ссылка = РасчетСНП.КлючАналитикиПеревозки
			//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
			|				И РасчетСНП.ЭтоКорректировка = &ЭтоКорректировка
			//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
			|		ПО КлючиАналитикиПеревозки.Контейнер = КлючиАналитикиПеревозки1.Контейнер
			|ГДЕ
			|	КлючиАналитикиПеревозки.Ссылка = &КлючАналитикиПеревозки
			|	И РасчетСНП.Ссылка <> &Ссылка
			|	И РасчетСНП.ФактическаяДатаНачала < &ФактическаяДатаОкончания
			|	И РасчетСНП.ФактическаяДатаОкончания > &ФактическаяДатаНачала
			|	И НЕ РасчетСНП.ПометкаУдаления
			|	И НЕ РасчетСНП.АннулированДокумент";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать расчет по контейнеру %1! Уже есть расчет с периодом %2 - %3 по заявке %4.", Выборка.НомерКТК, Формат(Выборка.ФактическаяДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Выборка.ФактическаяДатаОкончания, "ДФ=dd.MM.yyyy"), Выборка.ПредставлениеЗаявки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчДокумент) Тогда
		ВыставленДокумент = Истина;
	Иначе
		ВыставленДокумент = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаУведомленияКлиентаОбСНП) Тогда
		
		СекундВСутках = 86400;
		
		СрокОтказа = ?(СрокОтказаОтСНП > 0, СрокОтказаОтСНП, 7);		
		СрокОтказаВСекундах = СрокОтказа * СекундВСутках;
		ДатаЗавершенияСрокаОтказаОтСНП = ДатаУведомленияКлиентаОбСНП + СрокОтказаВСекундах;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПервыйРасчет) Тогда
		Если ЭтоНовый() Тогда
			НоваяСсылка = Документы.РасчетСНП.ПолучитьСсылку();
			УстановитьСсылкуНового(НоваяСсылка);
			ПервыйРасчет = НоваяСсылка;
		Иначе
			ПервыйРасчет = Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ФактическаяДатаНачала) И Не ЗначениеЗаполнено(ФактическаяДатаОкончания) И Не ПометкаУдаления Тогда
	//	
	//	Если ЕдиницаИзмеренияРасчетаСНП = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремениРасчетаСНП.Часы") Тогда
	//		
	//		КоличествоСекундВЧасе = 3600;
	//		
	//		КоличествоЧасовДоНаступленияСНП = НормативныйСрок + 1 - ПользованиеВПредыдущихРасчетах;
	//		Если КоличествоЧасовДоНаступленияСНП >= 0 Тогда
	//			ПредполагаемаяДатаНачалаСНП = ФактическаяДатаНачала + КоличествоЧасовДоНаступленияСНП * КоличествоСекундВЧасе;
	//		Иначе
	//			ПредполагаемаяДатаНачалаСНП = ПустаяДата;
	//		КонецЕсли;
	//		
	//	Иначе
	//		
	//		КоличествоСекундВСутках = 86400;
	//		
	//		КоличествоДнейДоНаступленияСНП = НормативныйСрок - ПользованиеВПредыдущихРасчетах;
	//		Если КоличествоДнейДоНаступленияСНП >= 0 Тогда
	//			ПредполагаемаяДатаНачалаСНП = ФактическаяДатаНачала + КоличествоДнейДоНаступленияСНП * КоличествоСекундВСутках;
	//		Иначе
	//			ПредполагаемаяДатаНачалаСНП = ПустаяДата;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	ПредполагаемаяДатаНачалаСНП = ПустаяДата;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Создано) Тогда
		Создано = ТекущаяДата();
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РасчетСНП") Тогда
		
		ИсключаемыеПоля = Новый Массив;
		ИсключаемыеПоля.Добавить("Номер");
		ИсключаемыеПоля.Добавить("Дата");
		ИсключаемыеПоля.Добавить("ФактическаяДатаНачалаПоДаннымКлиента");
		ИсключаемыеПоля.Добавить("ФактическаяДатаНачалаПоДаннымПодрядчика");
		ИсключаемыеПоля.Добавить("ФактическаяДатаОкончанияПоДаннымКлиента");
		ИсключаемыеПоля.Добавить("ФактическаяДатаОкончанияПоДаннымПодрядчика");
		ИсключаемыеПоля.Добавить("Счет");
		ИсключаемыеПоля.Добавить("СчетПроведен");
		ИсключаемыеПоля.Добавить("ВыставленДокумент");
		ИсключаемыеПоля.Добавить("СНПЗакрыто");
		ИсключаемыеПоля.Добавить("ДатаЗавершенияСрокаОтказаОтСНП");
		ИсключаемыеПоля.Добавить("КлиентУведомленОбСНП");
		ИсключаемыеПоля.Добавить("ДатаУведомленияКлиентаОбСНП");
		ИсключаемыеПоля.Добавить("КорректировкаСуммыСНП");
		ИсключаемыеПоля.Добавить("СуммаСкорректирована");
		ИсключаемыеПоля.Добавить("ОбоснованиеКорректировки");
		ИсключаемыеПоля.Добавить("ВыставитьЗакрывающиеДокументы");
		ИсключаемыеПоля.Добавить("АннулированДокумент");
		СтрокаИсключаемыеПоля = СтрСоединить(ИсключаемыеПоля, ",");		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, СтрокаИсключаемыеПоля);
		
		Если Не ЗначениеЗаполнено(ПервыйРасчет) Тогда
			ПервыйРасчет = ДанныеЗаполнения;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(РасчетСНП.ПользованиеВсего) КАК ПользованиеВсего
		|ИЗ
		|	Документ.РасчетСНП КАК РасчетСНП
		|ГДЕ
		|	РасчетСНП.ПервыйРасчет = &ПервыйРасчет";
		Запрос.УстановитьПараметр("ПервыйРасчет", ПервыйРасчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПользованиеВПредыдущихРасчетах = Выборка.ПользованиеВсего;
		КонецЕсли;
		
		Если ВариантВыставленияСчета = Перечисления.ВариантыВыставленияСчетаЗаСНП.ВОбщемСчетеЗаУслугу Тогда
			ВариантВыставленияСчета = Перечисления.ВариантыВыставленияСчетаЗаСНП.ПустаяСсылка();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ФактическаяДатаОкончанияПоДаннымКлиента) Тогда
			ФактическаяДатаНачалаПоДаннымКлиента = КонецДня(ДанныеЗаполнения.ФактическаяДатаОкончанияПоДаннымКлиента) + 1;
			ФактическаяДатаОкончанияПоДаннымКлиента = ТекущаяДата();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ФактическаяДатаОкончанияПоДаннымПодрядчика) Тогда
			ФактическаяДатаНачалаПоДаннымПодрядчика = КонецДня(ДанныеЗаполнения.ФактическаяДатаОкончанияПоДаннымПодрядчика) + 1;
			ФактическаяДатаОкончанияПоДаннымПодрядчика = ТекущаяДата();
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПСЦПрогрессивнаяШкалаСНП.Ссылка КАК Ссылка,
		|	ПСЦПрогрессивнаяШкалаСНП.ГУИДСтроки КАК ГУИДСтроки,
		|	ПСЦПрогрессивнаяШкалаСНП.От КАК От,
		|	ПСЦПрогрессивнаяШкалаСНП.До КАК До,
		|	ПСЦПрогрессивнаяШкалаСНП.Стоимость КАК Стоимость,
		|	0 КАК Количество,
		|	0 КАК Сумма
		|ИЗ
		|	Документ.ПСЦ.ПрогрессивнаяШкалаСНП КАК ПСЦПрогрессивнаяШкалаСНП
		|ГДЕ
		|	ПСЦПрогрессивнаяШкалаСНП.Ссылка = &ПСЦ
		|	И ПСЦПрогрессивнаяШкалаСНП.ГУИДСтроки = &ГУИДСтрокиПротокола
		|
		|УПОРЯДОЧИТЬ ПО
		|	От
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетСНППрогрессивнаяШкалаСНП.Ссылка КАК Ссылка,
		|	РасчетСНППрогрессивнаяШкалаСНП.НомерСтроки КАК НомерСтроки,
		|	РасчетСНППрогрессивнаяШкалаСНП.От КАК От,
		|	РасчетСНППрогрессивнаяШкалаСНП.До КАК До,
		|	РасчетСНППрогрессивнаяШкалаСНП.Стоимость КАК Стоимость,
		|	РасчетСНППрогрессивнаяШкалаСНП.Количество КАК Количество,
		|	РасчетСНППрогрессивнаяШкалаСНП.Сумма КАК Сумма
		|ИЗ
		|	Документ.РасчетСНП.ПрогрессивнаяШкалаСНП КАК РасчетСНППрогрессивнаяШкалаСНП
		|ГДЕ
		|	РасчетСНППрогрессивнаяШкалаСНП.Ссылка = &РасчетСНП
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("РасчетСНП", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
		Запрос.УстановитьПараметр("ГУИДСтрокиПротокола", ГУИДСтрокиПротокола);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		ТаблицаСтавокПСЦ = РезультатыЗапроса[0].Выгрузить();
		ТаблицаСтавокРасчетаСНП = РезультатыЗапроса[1].Выгрузить();
		
		Если ТаблицаСтавокРасчетаСНП.Количество() > 0 Тогда
			ТаблицаСтавок = ТаблицаСтавокРасчетаСНП;
		Иначе
			ТаблицаСтавок = ТаблицаСтавокПСЦ;
		КонецЕсли;
		
		БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.РассчитатьСНП(ЭтотОбъект, ТаблицаСтавок);
		
		ПрогрессивнаяШкалаСНП.Загрузить(ТаблицаСтавок);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		КлючАналитикиПеревозки = Неопределено;
		ДанныеЗаполнения.Свойство("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
		
		Если ЗначениеЗаполнено(КлючАналитикиПеревозки) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
			|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
			|	ЗаявкаСоставУслуги.ПСЦ КАК ПСЦ,
			|	ЗаявкаСоставУслуги.РазмерКТК КАК РазмерКТК,
			|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
			|ПОМЕСТИТЬ УслугиЗаявки
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|ГДЕ
			|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки = &КлючАналитикиПеревозки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УслугиЗаявки.НомерКТК КАК НомерКТК,
			|	УслугиЗаявки.ПСЦ КАК ПСЦ,
			|	УслугиЗаявки.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
			|	ПСЦСверхнормативноеПользование.Услуга КАК Услуга,
			|	ПСЦСверхнормативноеПользование.НормативныйСрок КАК НормативныйСрок,
			|	ПСЦСверхнормативноеПользование.Валюта КАК Валюта,
			|	ПСЦСверхнормативноеПользование.СтавкаНДС КАК СтавкаНДС,
			|	ПСЦСверхнормативноеПользование.СтавкаВключаетНДС КАК СтавкаВключаетНДС,
			|	ПСЦСверхнормативноеПользование.Ставка КАК Ставка,
			|	ПСЦСверхнормативноеПользование.ГУИДСтроки КАК ГУИДСтрокиПротокола,
			|	ПСЦСверхнормативноеПользование.ЭтапСНП КАК ЭтапСНП,
			|	ПСЦСверхнормативноеПользование.СобытиеНачалаРасчетаПользования КАК СобытиеНачалаРасчетаПользования,
			|	ПСЦСверхнормативноеПользование.ЛокацияСобытияНачала КАК ЛокацияСобытияНачала,
			|	ПСЦСверхнормативноеПользование.СобытиеОкончанияРасчетаПользования КАК СобытиеОкончанияРасчетаПользования,
			|	ПСЦСверхнормативноеПользование.ЛокацияСобытияОкончания КАК ЛокацияСобытияОкончания,
			|	ПСЦСверхнормативноеПользование.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
			|	ПСЦСверхнормативноеПользование.ЕдиницаИзмеренияРасчетаСНП КАК ЕдиницаИзмеренияРасчетаСНП,
			|	ПСЦСверхнормативноеПользование.СрокОтказаОтСНП КАК СрокОтказаОтСНП,
			|	ПСЦСверхнормативноеПользование.ВариантОпределенияДатыКурсаВалют КАК ВариантОпределенияДатыКурсаВалют
			|ПОМЕСТИТЬ СверхнормативыПСЦ
			|ИЗ
			|	УслугиЗаявки КАК УслугиЗаявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ.СверхнормативноеПользование КАК ПСЦСверхнормативноеПользование
			|		ПО УслугиЗаявки.ПСЦ = ПСЦСверхнормативноеПользование.Ссылка
			|			И УслугиЗаявки.РазмерКТК = ПСЦСверхнормативноеПользование.ТипКТК
			|			И (ПСЦСверхнормативноеПользование.ГУИДСтроки = &ГУИДСтрокиПротокола)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СверхнормативыПСЦ.НомерКТК КАК НомерКТК,
			|	СверхнормативыПСЦ.ПСЦ КАК ПСЦ,
			|	СверхнормативыПСЦ.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
			|	СверхнормативыПСЦ.Услуга КАК Услуга,
			|	СверхнормативыПСЦ.НормативныйСрок КАК НормативныйСрок,
			|	СверхнормативыПСЦ.Валюта КАК Валюта,
			|	СверхнормативыПСЦ.СтавкаНДС КАК СтавкаНДС,
			|	СверхнормативыПСЦ.СтавкаВключаетНДС КАК СтавкаВключаетНДС,
			|	СверхнормативыПСЦ.Ставка КАК Ставка,
			|	СверхнормативыПСЦ.ГУИДСтрокиПротокола КАК ГУИДСтрокиПротокола,
			|	СверхнормативыПСЦ.ЭтапСНП КАК ЭтапСНП,
			|	СверхнормативыПСЦ.СобытиеНачалаРасчетаПользования КАК СобытиеНачалаРасчетаПользования,
			|	СверхнормативыПСЦ.ЛокацияСобытияНачала КАК ЛокацияСобытияНачала,
			|	СверхнормативыПСЦ.СобытиеОкончанияРасчетаПользования КАК СобытиеОкончанияРасчетаПользования,
			|	СверхнормативыПСЦ.ЛокацияСобытияОкончания КАК ЛокацияСобытияОкончания,
			|	СверхнормативыПСЦ.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
			|	СверхнормативыПСЦ.ЕдиницаИзмеренияРасчетаСНП КАК ЕдиницаИзмеренияРасчетаСНП,
			|	СверхнормативыПСЦ.СрокОтказаОтСНП КАК СрокОтказаОтСНП,
			|	СверхнормативыПСЦ.ВариантОпределенияДатыКурсаВалют КАК ВариантОпределенияДатыКурсаВалют
			|ИЗ
			|	СверхнормативыПСЦ КАК СверхнормативыПСЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПСЦПрогрессивнаяШкалаСНП.Ссылка КАК Ссылка,
			|	ПСЦПрогрессивнаяШкалаСНП.ГУИДСтроки КАК ГУИДСтроки,
			|	ПСЦПрогрессивнаяШкалаСНП.НомерСтроки КАК НомерСтроки,
			|	ПСЦПрогрессивнаяШкалаСНП.От КАК От,
			|	ПСЦПрогрессивнаяШкалаСНП.До КАК До,
			|	ПСЦПрогрессивнаяШкалаСНП.Стоимость КАК Стоимость
			|ИЗ
			|	СверхнормативыПСЦ КАК СверхнормативыПСЦ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ.ПрогрессивнаяШкалаСНП КАК ПСЦПрогрессивнаяШкалаСНП
			|		ПО СверхнормативыПСЦ.ПСЦ = ПСЦПрогрессивнаяШкалаСНП.Ссылка
			|			И СверхнормативыПСЦ.ГУИДСтрокиПротокола = ПСЦПрогрессивнаяШкалаСНП.ГУИДСтроки
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
			
			ПараметрГУИДСтрокиПротокола = Неопределено;
			Если ДанныеЗаполнения.Свойство("ГУИДСтрокиПротокола", ПараметрГУИДСтрокиПротокола) Тогда
				Запрос.УстановитьПараметр("ГУИДСтрокиПротокола", ПараметрГУИДСтрокиПротокола);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ПСЦСверхнормативноеПользование.ГУИДСтроки = &ГУИДСтрокиПротокола)", "");
			КонецЕсли;
			
			Результаты = Запрос.ВыполнитьПакет();
			
			КоличествоЗапросов = Результаты.Количество();
			ПараметрыСНП = Результаты[КоличествоЗапросов - 2].Выбрать();
			ТаблицаСтавок = Результаты[КоличествоЗапросов - 1].Выгрузить();
			ТаблицаСтавок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
			ТаблицаСтавок.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
			
			Если ПараметрыСНП.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыСНП);
				
				СтавкиПоСтрокеПротокола = ТаблицаСтавок.Скопировать(Новый Структура("ГУИДСтроки", ПараметрыСНП.ГУИДСтрокиПротокола));
				
				БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.РассчитатьСНП(ЭтотОбъект, СтавкиПоСтрокеПротокола);		
				ПрогрессивнаяШкалаСНП.Загрузить(СтавкиПоСтрокеПротокола);
		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Счет = Неопределено;
	
	ПустаяДата = '00010101';
	ФактическаяДатаНачалаПоДаннымКлиента = ПустаяДата;
	ФактическаяДатаНачалаПоДаннымПодрядчика = ПустаяДата;
	ФактическаяДатаОкончанияПоДаннымКлиента = ПустаяДата;
	ФактическаяДатаОкончанияПоДаннымПодрядчика = ПустаяДата;
	
КонецПроцедуры
