///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "DATACore_ES";
	Описание.Версия = "1.0.0.124";
	 // Требуется библиотека стандартных подсистем.
    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	//Евросиб Каблов 27.12.2019 ( Ticket#0183004	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.1";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьВопросыОтветыАнкетКонтрагентов";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 27.12.2019 )
	
	//Евросиб Каблов 27.12.2019 ( Ticket#0182095
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.2";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбработатьКатегорииКонтрагентов";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 27.12.2019 )
	
	//Евросиб Каблов 18.08.2020 (
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.3";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбработатьНаименованияПодписей";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 18.08.2020 )
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.4";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбработатьВидыКонтактнойИнформации";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.5";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПараметрыРегламентногоЗаданияДиадок";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.6";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнениеПризнаковПоставщикКлиентКонтрагентовСервисаДиадок";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.7";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьПредопределенногоКонтрагентаРЖД";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.8";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьДанныеЭлементаНоменклатурыПретензии";
	Обработчик.РежимВыполнения     = "Оперативно";      
	
	//ДИТ Авдеева В. 43126 04.04.2022 начало      
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.9";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьПредопределеннуюНоменклатуруТЭУ";
	Обработчик.РежимВыполнения     = "Оперативно";      
	//ДИТ Авдеева В. 43126 04.04.2022 Конец 
	
	
	////Евросиб Каблов 04.05.2022 ( Task 45436
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия              = "1.0.0.11";
	//Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостояния";
	//Обработчик.РежимВыполнения     = "Оперативно";
	////Евросиб Каблов 04.05.2022 )

	////Евросиб - АСуслов 04.05.2022 18:28:25 #
	//(

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.13";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьСправочникиВидыЖДН";
	Обработчик.РежимВыполнения     = "Оперативно";      

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.13";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьПризнакиНоменклатурыЭтоТариф";
	Обработчик.РежимВыполнения     = "Оперативно";      

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.13";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьПризнакиНоменклатурыОтсутствиеПеревозкиПоЖДДляКалькуляции";
	Обработчик.РежимВыполнения     = "Оперативно";      

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.13";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьГУИДыВКалькуляциях";
	Обработчик.РежимВыполнения     = "Оперативно";      
	//)
	//Евросиб - АСуслов 26.04.2022 15:45:55 #
	
	//Евросиб Каблов 01.08.2022 ( Ticket#0239076
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.14";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ДобавитьПредопределенныеЭлементыСправочникаСостоянияПоИзменениюСчета";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 01.08.2022 )
	
	//ДИТ Шевченко А.В. TASK 53546 28.07.2022 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.15";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаОбщиеПоказатели";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. TASK 53546 28.07.2022 -Конец
	
	// ++ ДИТ_Агафонов_task 50388 08.07.2022
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.15";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияДляРелизаСобственника";
	Обработчик.РежимВыполнения     = "Оперативно";
	// -- ДИТ_Агафонов_task 50388 08.07.2022
	
	//ДИТ Шевченко А.В. TASK 51973 01.07.2022 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.16";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьПредопределенныйГрузСборнаяКонтейнернаяОтправка";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.16";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьКонтактнуюИнформациюДляЗапросаНаАвтоперевозку";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. TASK 51973 01.07.2022 -Конец 
	
	//ДИТ Шевченко А.В. TASK 55132 28.07.2022 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.16";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияПоЗапросуНаАвтоперевозку";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. TASK 55132 28.07.2022 -Конец

	//Евросиб - АСуслов 08.09.2022 14:59:44 #
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.17";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьШаблоныКлючейАналитикиСтрокКалькуляции";
	Обработчик.РежимВыполнения     = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.17";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьКлючиАналитикиВКалькуляциях";
	Обработчик.РежимВыполнения     = "Отложенно";      
	//)
	//Евросиб - АСуслов 08.09.2022 14:59:46 #
	
	//ДИТ Шевченко А.В. 08.09.2022 46657 -начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.18";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ДобавитьПредопределенныеЭлементыСправочникаВидыПеревозок";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. 08.09.2022 46657 -конец

	//Евросиб - АСуслов 11.10.2022 14:43:30 #
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.19";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаписатьДанныеВИсториюРазнесенияПоступлений";
	Обработчик.РежимВыполнения     = "Оперативно";
 	//)
	//Евросиб - АСуслов 11.10.2022 14:43:30 #
	//Евросиб - АСуслов 31.08.2022 15:01:07 #56211
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.20";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьУчетныеНаправленияВКалькуляциях";
	Обработчик.РежимВыполнения     = "Оперативно";

	//)
	//Евросиб - АСуслов 31.08.2022 15:01:22 #56211
	
	//ДИТ Шевченко А.В. 06.10.2022 59945 -начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.21";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ВыполнитьПереносАвтоперевозчиковНаСервере";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. 06.10.2022 59945 -конец
	
	//ДИТ Авдеева В.С. 52214 Начало 28.09.2022    
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.22";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьДопРеквизитГруппаОРК";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Авдеева В.С. 52214 Конец 28.09.2022
	
	//ДИТ Шевченко А.В. 51340 29.09.2022 -начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.23";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьЭлементыСтатусыЗаявок";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. 51340 29.09.2022 -конец
	//Евросиб - АСуслов 21.11.2022 12:04:37 #58550
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.24";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьРегистрОчередьАвторазнесения";
	Обработчик.РежимВыполнения     = "Оперативно";

	//Евросиб - АСуслов 25.11.2022 9:48:56 #
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.24";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьШаблоныКлючейАналитикиСтрокКалькуляции_2";
	Обработчик.РежимВыполнения     = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.24";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьКлючиАналитикиВКалькуляциях_2";
	Обработчик.РежимВыполнения     = "Оперативно";      
	//)
	//Евросиб - АСуслов 25.11.2022 9:48:56 #
//)
	//Евросиб - АСуслов 21.11.2022 12:04:39 #58550
	//Евросиб - АСуслов 23.11.2022 19:29:00 #
	
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.25";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ДобавитьПредопределенныеЭлементыСправочникаСтраныМираИЛокации";
	Обработчик.РежимВыполнения     = "Оперативно";
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	
	//++ДИТ Моисеенко Ю.В. task#59323 11.11.2022
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.26";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ДобавитьПредопределенныйЭлементТипоразмерыТСРефПлатформа";
	Обработчик.РежимВыполнения     = "Оперативно";
	//--ДИТ Моисеенко Ю.В. task#59323 11.11.2022 
	
	//ДИТ Шевченко А.В. 06.09.2022 56947 -начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.27";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ДобавитьПредопределенныеЭлементыСправочникаСостоянияДоговоры";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. 06.09.2022 56947 -конец
	
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 09.12.2022
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.27";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ВыполнитьПереносОтветственныхИзРеквизитовВТЧОтветственные";
	Обработчик.РежимВыполнения     = "Оперативно"; 
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 09.12.2022
	
	//Евросиб - АСуслов 23.11.2022 19:29:00 #
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.28";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьДанныеВидовЖДН";
	Обработчик.РежимВыполнения     = "Оперативно";
	//)
	//Евросиб - АСуслов 23.11.2022 19:29:01 #

	//Евросиб Коханенко Н.А. #61823 28.12.2022 (
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.29";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияТребуетсяЗаполнитьРейс";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. #61823 28.12.2022 )
	
	//ДИТ Шевченко А.В. 57147 28.12.2022
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.30";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ПредопределитьЭлементыСтатусыЗаявокСибур";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. 57147 28.12.2022
	
	//Евросиб - АСуслов 20.01.2023 13:27:07 #64698
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.31";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьРегиональныйЦФО";
	Обработчик.РежимВыполнения     = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.31";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьРегиональныйЦФОВСделках";
	Обработчик.РежимВыполнения     = "Оперативно";
	//)
	//Евросиб - АСуслов 20.01.2023 13:27:15 #64698  
	

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.33";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ПеренестиДанныеСВВ";

	Обработчик.РежимВыполнения     = "Оперативно";

	// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.35";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостояния_ГотовностьКомплектаПодтверждающихДокументов";

	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
	
	// ++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.36";
	Обработчик.Процедура           = 
		"ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянийРефСцепа";
	Обработчик.РежимВыполнения     = "Оперативно";
	

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.36";
	Обработчик.Процедура           = 
		"ОбновлениеИнформационнойБазыDC.ЗаполнитьКонстантыРефСцепов";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	// ++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	
	//ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.37";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементГруппыПользователей";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023 -Конец
	
	//ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.37";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементГруппыПользователейДепартаментаПродажКП";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023 -Конец
	
	//ДИТ Шевченко А.В. US 72111 ТА 72114 17.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.37";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ВыполнитьОбработкуСогласованийОтделаПродажВКалькуляциях";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 72111 ТА 72114 17.07.2023 -Конец

	//Евросиб - АСуслов 10.08.2023 9:38:54 #локации
	//(
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.38";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьУровниТипаЛокаций";
	Обработчик.РежимВыполнения     = "Оперативно";
	//)
	//Евросиб - АСуслов 10.08.2023 9:38:57 #локации
	
	//Евросиб Коханенко Н.А. 11.08.2023 (( #72829 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.39";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияСогласованиеПЭО";
	Обработчик.РежимВыполнения     = "Оперативно";
 
	//уже реализовано в версии 31.0.0.37
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.39";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаГруппыПользователейРуководительОтделаПродаж";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 11.08.2023 )) #72829
	
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.41";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьКонтактнуюИнформациюДляЛокаций";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Конец
	
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.41";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьОперацииСВагонамиДобавитьЛокацию";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Конец  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.41";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаТипыЛокаций";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.41";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияПоЗапросуНаАвтоперевозкуПередатьКлиентуДанные";
	Обработчик.РежимВыполнения     = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.42";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьКонстантыГеокодера";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.43";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьКонстантуКоличествоМесяцевНаПодписаниеПСЦсДвухСторон";
	Обработчик.РежимВыполнения     = "Оперативно"; 
	
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.44";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределеннуюГруппуПользователейРуководительОтделаПродажНСК";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023

	//Евросиб Коханенко Н.А. 16.10.2023 (( #76015 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.45";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределеннуюГруппуПользователейУправление";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 16.10.2023 )) #76015 
	
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.46";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьТипОтветственногоПДЗвРегистре";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец
	
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.48";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьЭлементыПродуктыДКП";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Конец
		
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.48";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьЭлементыСхемыПеревозок";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Конец
	
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.48";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьЭлементыОтрезкиСхемПеревозок";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023 -Конец   
	
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.49";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СостояниеВводПСЦвПредопределенные";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 15.11.2023 
	
	// Субботин 75158 Начало 25.09.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.50";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределенныйВидТС";
	Обработчик.РежимВыполнения     = "Оперативно";
	// Субботин 75158 конец 25.09.2023  
	
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Начало: 22.11.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.52";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СостояниеПрикреплениеПодписанногоПСЦвПредопределенные";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Конец: 22.11.2023
	
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Начало: 22.11.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.52";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СостояниеСогласованиеПрикреплениеПодписанногоПСЦвПредопределенные";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Конец: 22.11.2023 
	
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Начало: 22.11.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.52";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СостояниеПереводВПодписанПСЦвПредопределенные";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Конец: 22.11.2023
	
	//ДИТ, Беляев СЮ, Ticket#0335550, 21-12-2023, начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.54";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияТребуетсяСоздатьКомплект";
	Обработчик.РежимВыполнения     = "Оперативно";
	//ДИТ, Беляев СЮ, Ticket#0335550, 21-12-2023, конец

	//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.55";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаЛокацииНеизвестнаяСтанция";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 28.12.2023 )) #79320 
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 26.02.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.56";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределенноеСостояниеНеобходимоОбновление";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 26.02.2024
	
	//Евросиб Коханенко Н.А. 26.02.2024 (( #80981 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.57";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьЛокациюВышестоящегоУровняВСправочникеАдресаВНаселенныхПунктах";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 26.02.2024 )) #80981 
	
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.58";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределенноеСостояниеУдалениеСчета";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024  
	
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Начало: 19.04.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.60";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределенноеСостояниеОтменаРейса";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Конец: 19.04.2024  
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.61";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьЭлементНоменклатурыПремия";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 28.07.2023      
	
	// ДИТ US 59973 ТА 74834 Сержантова А.С. Начало: 14.09.2023
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.61";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределеннуюВалютуЮань";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 59973 ТА 74834 Сержантова А.С. Конец: 14.09.2023

	//Евросиб Коханенко Н.А. 22.07.2024 (( #88035 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.67";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаСостоянияЗаполнитьТипИХарактеристикуКлиента";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 22.07.2024 )) #88035 
 	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Начало: 11.07.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.68";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределеннуюГруппуПользователейПроизводственнаяДирекция";
	Обработчик.РежимВыполнения     = "Оперативно";
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Конец: 11.07.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.68";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьПредопределеннуюГруппуПользователейДиректорПоПроизводству";
	Обработчик.РежимВыполнения     = "Оперативно"; 
	
	// Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 06.09.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.69";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьТаблицыМаршрутовИзРеквизитов";
	Обработчик.РежимВыполнения     = "Оперативно";
	// Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 06.09.2024
	
	//Евросиб СубботинВ #89533 18.10.2024 Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.70";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределеннуюГруппуПользователейДКП";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб СубботинВ #89533 18.10.2024 Конец
	
	//Евросиб Каблов 18.10.2024 (
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.71";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьПротоколОбменовЖДРейсов";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 18.10.2024 ) 
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 12.09.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.72";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьСостояниеМорскойРейсУдален";
	Обработчик.РежимВыполнения     = "Оперативно";
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024   
	
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 31.10.2024 
	//записываем данные морских рейсов в РС Данные морских рейсов. 
	//Заменяем наименования услуг в справочнике ФормированиеФинДокументов
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.73";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбработатьЗаписьДанныхРейсовИИзменениеНаименованийУслуг"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 31.10.2024

	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.74";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьНастройкиГруппДКС"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец   
	
	//Евросиб Коханенко Н.А. 22.11.2024 (( #92915 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.75";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаЭлементыПечатнойФормыПротокола"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 22.11.2024 )) #92915
	
	//Евросиб Каблов 29.11.2024 ( #89891
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.76";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйВидПеревозкиМеждународная"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 29.11.2024 )
	
	//Евросиб Каблов 25.12.2024 ( #89872
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.77";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗагрузитьВидыУслугПоставщиков"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 29.11.2024 )
	
	//Евросиб Каблов 25.12.2024 ( #99155
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.78";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьПолноеНаименованиеМультилокаций"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 29.11.2024 )
	
	//Евросиб Коханенко Н.А. 17.09.2024 (( #91409 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.79";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаИсточникиПакетовДанныхПолучениеДанныхОСреднейМиле";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 17.09.2024 )) #91409
	
	// ДИТ US 91362 ТА 97665 Шевченко А.В. Начало: 25.12.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.81";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаСостоянийУтвержденДопРасходы";
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 91362 ТА 97665 Шевченко А.В. Начало: 25.12.2024

	//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.82";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаЭлементыПечатнойФормыПротоколаТаблицаДоговорнаяЦенаCOCSOC"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
	
	// ДИТ US 94594 ТА 96789 Лаврентьев О.М. Начало: 06.12.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.83";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаменитьНаПредопределенныйЭлементСправочникаСостояний"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	// ДИТ US 94594 ТА 96789 Лаврентьев О.М. Конец: 06.12.2024 
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало // блок по внедрению заявок на оплату //начало	04.03.2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.84";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаГруппыПользователейБезПодразделения"; 
	Обработчик.РежимВыполнения     = "Оперативно";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.84";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаСостоянийУтвержден"; 
	Обработчик.РежимВыполнения     = "Оперативно";
		
	//Евросиб СубботинВ #96807 17.12.2024 Начало 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.84";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаГруппыПользователейОтделАренды"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб СубботинВ #96807 17.12.2024 Конец
    //Евросиб СубботинВ #89527 30.10.2024 Конец + выше обработчик ,
	
	//Евросиб СубботинВ #96807 17.12.2024 Начало 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.84";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаРедактированиеДокумента"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб СубботинВ #96807 17.12.2024 Конец  // блок по внедрению заявок на оплату //Конец 04.03.2024	
	
	//Евросиб Каблов 17.03.2025 ( #100116 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.85";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатуры85"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 17.03.2025 )

	//Евросиб Коханенко Н.А. 20.03.2025 (( #100979 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.86";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатурыДляПодбораПродуктаВКалькуляции"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 20.03.2025 )) #100979 
	
	//Евросиб(ДИТ), Беляев СЮ, US 105324 / TA 105326, 20-03-2025, начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.87";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаВидыПСЦ_ОснованиеДляВозмещенияРасходов";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб(ДИТ), Беляев СЮ, US 105324 / TA 105326, 20-03-2025, конец
	
	//Евросиб Коханенко Н.А. 24.03.2025 (( #105705 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.88";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаПродуктыДКП";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 24.03.2025 )) #105705

	//Евросиб Коханенко Н.А. 24.03.2025 (( #105938 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.89";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаЭлементыПечатнойФормыПротоколаШапкаНотисаММ";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 24.03.2025 )) #105938

	//Евросиб Каблов 09.04.2025 ( #105407 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.90";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьРегистрыЗакрытыхПериодов"; 
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 09.04.2025 )

	//Евросиб Коханенко Н.А. 04.03.2025 (( #102319 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.91";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатурыАвтоперевозки";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Коханенко Н.А. 04.03.2025 )) #102319
	
	//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.92";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаСобытияНачалаИОкончанияРасчетаПользования";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217

//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.92";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаЭтапыСНП";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217

//Евросиб Коханенко Н.А. 22.04.2025 (( #78722 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.93";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаОфисыПродаж";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Коханенко Н.А. 22.04.2025 )) #78722

// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.94";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостояний";
	Обработчик.РежимВыполнения     = "Оперативно";
// Евросиб Рыбьяков К.А. 04.06.2025 ))

//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.95";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементСправочникаБазовыеСтавкиНадбавкиМСКЗонаВнутриМКАД";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Коханенко Н.А. 05.06.2025 )) #110783

	//Евросиб Каблов 28.05.2025 ( #109346
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.96";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_96";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 28.05.2025 )
	
//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 26.06.25 Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.97";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияЗаполнитьПолеГруппаДКС";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 26.06.25 Начало

	//Евросиб Каблов 26.06.2025 ( #100085
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.97";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_97";
	Обработчик.РежимВыполнения     = "Оперативно";
	//Евросиб Каблов 26.06.2025 )  
	
//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112173 Начало 02.07.2025
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.98";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УстановитьФлагКонстантыВыгрузкаРеестровФНС";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112173 Конец 02.07.2025

//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.99";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостояний_КорректировкаПТУ";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец

//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 107993 01.07.25 Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.100";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияОтправитьОригиналыКлиенту";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 107993 01.07.25 Начало

//Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.101";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьСобытияДокументовВПакетахАктуальный";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025

//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.102";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УбратьТерминалыСдачиВыдачиДляУслугПоставщикаКонтейнеры";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025

//Евросиб Шевченко А.В. US 112687 TA 115016 22.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.103";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ПереносСчетовИзШапкиВНовуюТЧКорРТУОтчетКомитентуОПродажах";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 112687 TA 115016 22.07.2025

//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.104";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаНоменклатура_ШтрафыПрочие";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
// Евросиб US 115468 TA 115468 Рыбьяков К.А. 04.08.2025 ((
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.105";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_105";
	Обработчик.РежимВыполнения     = "Оперативно";
// Евросиб Рыбьяков К.А. 04.08.2025 ))
//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.106";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьГруппуТЭОУслугПоставщика";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 116178 05.08.25 Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.107";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияПовторноОтправитьОригиналыКлиенту";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 116178 05.08.25 Начало
//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.108";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаНоменклатураРелокацияКонтейнерПорожний";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.109";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьГруппуПортыУслугПоставщика";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025

//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.110";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаНоменклатураХранения";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.111";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаНоменклатураТерминальнаяОбработка";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
// Евросиб US 114823 TA 116919 Рыбьяков К.А. 18.08.2025 ((
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.112";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыГруппыПользователей";
	Обработчик.РежимВыполнения     = "Оперативно";
// Евросиб Рыбьяков К.А. 18.08.2025 ))

//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.113";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаСостоянияСозданиеСЗНаКорректировкуРТУПоСНП";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445

// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.08.2025 ((
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.114";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСправочникаГрузы";
	Обработчик.РежимВыполнения     = "Оперативно";
// Евросиб Рыбьяков К.А. 18.08.2025 ))

//Евросиб Коханенко Н.А. 05.09.2025 (( #118637
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.115";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыГруппыДКСПолувыгоны";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Коханенко Н.А. 05.09.2025 )) #118637

//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.116";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыГруппыДКСДПРК";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025

//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.117";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыГруппПользователейИЗаписиРегистраСведенийДопАналитикиДокументов";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025

//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.118";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьВидУслугПоставщикаФрахт";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 110215 TA 121214 13.20.2025
//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.119";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ОбновитьВидУслугПоставщикаТЭО";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025

//Евросиб Каблов 06.11.2025 ( #107942
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.120";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.ЗаполнитьСлужебнуюИнформациюДляУчетаПлановыхРасходовПолныйФакт";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Каблов 06.11.2025 ) #107942

//Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.121";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыСостоянияСнятьКопииПТУ";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025
//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.122";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.УтановитьДатуНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025

//Евросиб Коханенко Н.А. 19.12.2025 (( #125251
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.123";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныйЭлементИсточникиПакетовДанныхПолучениеДанныхГеокодера";
	Обработчик.РежимВыполнения     = "Оперативно";
//Евросиб Коханенко Н.А. 19.12.2025 )) #125251 

//Евросиб СубботинВ #117990 15.01.2026 Начало
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.0.0.124";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыDC.СоздатьПредопределенныеЭлементыГруппыПользователейГруппыОтветственныхЗаСопровождение";
	Обработчик.РежимВыполнения     = "Оперативно";

//Евросиб СубботинВ #117990 15.01.2026 Конец

КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
			
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_1

//Евросиб Каблов 27.12.2019 ( Ticket#0183004
Процедура ЗаполнитьВопросыОтветыАнкетКонтрагентов() Экспорт
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка вопросов анкет");
	
	//Характеристика структуры рынка
	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.ХарактеристикаСтруктурыРынкаТоваровУслуг.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "ХарактеристикаСтруктурыРынкаТоваровУслуг";
	КонецПопытки;	
	ВопросОбъект.Наименование = "Характеристика структуры рынка товаров и услуг";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ХарактеристикаСтруктурыРынкаТоваровУслуг_Монополия.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ХарактеристикаСтруктурыРынкаТоваровУслуг_Монополия";
	КонецПопытки;
	ОтветОбъект.Наименование = "Монополия";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ХарактеристикаСтруктурыРынкаТоваровУслуг_Олигополия.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ХарактеристикаСтруктурыРынкаТоваровУслуг_Олигополия";
	КонецПопытки;
	ОтветОбъект.Наименование = "Олигополия";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ХарактеристикаСтруктурыРынкаТоваровУслуг_Конкуренция.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ХарактеристикаСтруктурыРынкаТоваровУслуг_Конкуренция";
	КонецПопытки;
	ОтветОбъект.Наименование = "Конкуренция";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Сроки оказания услуги

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СрокиОказанияУслугиПодрядчиком.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугиПодрядчиком";
	КонецПопытки;
	ВопросОбъект.Наименование = "Сроки оказания услуги";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СрокиОказанияУслугиПодрядчиком_Срочно.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугиПодрядчиком_Срочно";
	КонецПопытки;
	ОтветОбъект.Наименование = "Срочно";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СрокиОказанияУслугиПодрядчиком_НеСрочно.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугиПодрядчиком_НеСрочно";
	КонецПопытки;
	ОтветОбъект.Наименование = "Не срочно";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Использование услуги

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.ИспользованиеУслуги.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "ИспользованиеУслуги";
	КонецПопытки;
	ВопросОбъект.Наименование = "Использование услуги (клиентов укажите в комментарии)";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ИспользованиеУслуги_ДляКлиентов.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ИспользованиеУслуги_ДляКлиентов";
	КонецПопытки;
	ОтветОбъект.Наименование = "Услуга для клиентов";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ИспользованиеУслуги_ДляНовогоПроекта.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ИспользованиеУслуги_ДляНовогоПроекта";
	КонецПопытки;
	ОтветОбъект.Наименование = "Услуга для нового проекта";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Характеристика услуг для нового проекта

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.ХарактеристикаУслугДляНовогоПроекта.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "ХарактеристикаУслугДляНовогоПроекта";
	КонецПопытки;
	ВопросОбъект.Наименование = "Характеристика услуг для нового проекта";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ХарактеристикаУслугДляНовогоПроекта_СуществующиеРынки.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ХарактеристикаУслугДляНовогоПроекта_СуществующиеРынки";
	КонецПопытки;
	ОтветОбъект.Наименование = "Существующие рынки";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ХарактеристикаУслугДляНовогоПроекта_НовыеРынки.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ХарактеристикаУслугДляНовогоПроекта_НовыеРынки";
	КонецПопытки;
	ОтветОбъект.Наименование = "Новые рынки";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Клиент, для которого закупается услуга, является стратегическим

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.КлиентДляКоторогоЗакупаетсяУслугаЯвляетсяСтратегическим.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "КлиентДляКоторогоЗакупаетсяУслугаЯвляетсяСтратегическим";
	КонецПопытки;
	ВопросОбъект.Наименование = "Клиент, для которого закупается услуга, является стратегическим?";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("Булево");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	//Отражаются условия договора с подрядчиком в договоре с клиентом

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.ОтражаютсяУсловияДоговораСПодрядчикомВДоговореСКлиентом.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "ОтражаютсяУсловияДоговораСПодрядчикомВДоговореСКлиентом";
	КонецПопытки;
	ВопросОбъект.Наименование = "Отражаются условия договора с подрядчиком в договоре с клиентом?";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("Булево");
	ВопросОбъект.ТипКонтрагента_Подрядчик = Истина;
	ВопросОбъект.Записать();

	//Клиент

	//История работы с клиентом

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.ИсторияРаботыСКлиентом.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "ИсторияРаботыСКлиентом";
	КонецПопытки;
	ВопросОбъект.Наименование = "История работы с клиентом";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Клиент = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ИсторияРаботыСКлиентом_НовыйКлиент.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ИсторияРаботыСКлиентом_НовыйКлиент";
	КонецПопытки;
	ОтветОбъект.Наименование = "Новый клиент";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.ИсторияРаботыСКлиентом_ИзменениеФормыУсловийДоговора.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "ИсторияРаботыСКлиентом_ИзменениеФормыУсловийДоговора";
	КонецПопытки;
	ОтветОбъект.Наименование = "Изменение формы/условий договора";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Сроки оказания услуг

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СрокиОказанияУслугКлиенту.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
	КонецПопытки;
	ВопросОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугКлиенту";
	ВопросОбъект.Наименование = "Сроки оказания услуг";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Клиент = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СрокиОказанияУслугКлиенту_Срочно.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугКлиенту_Срочно";
	КонецПопытки;
	ОтветОбъект.Наименование = "Срочно";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СрокиОказанияУслугКлиенту_Плановые.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СрокиОказанияУслугКлиенту_Плановые";
	КонецПопытки;
	ОтветОбъект.Наименование = "Плановые";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	//Наличие у клиента альтернативного подрядчика

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.НаличиеУКлиентаАльтернативногоПодрядчика.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "НаличиеУКлиентаАльтернативногоПодрядчика";
	КонецПопытки;
	ВопросОбъект.Наименование = "Наличие у клиента альтернативного подрядчика";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("Булево");
	ВопросОбъект.ТипКонтрагента_Клиент = Истина;
	ВопросОбъект.Записать();

	//Сроки оказания услуг

	Попытка
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СпособЗаключенияДоговора.ПолучитьОбъект();
	Исключение
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыАнкетКонтрагентов.СоздатьЭлемент();
		ВопросОбъект.ИмяПредопределенныхДанных = "СпособЗаключенияДоговора";
	КонецПопытки;
	ВопросОбъект.Наименование = "Способ заключения договора";
	ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОтветыНаВопросыАнкет");
	ВопросОбъект.ТипКонтрагента_Клиент = Истина;
	ВопросОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СпособЗаключенияДоговора_ПереговорыДоговор.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СпособЗаключенияДоговора_ПереговорыДоговор";
	КонецПопытки;
	ОтветОбъект.Наименование = "Переговоры (договор)";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();

	Попытка
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СпособЗаключенияДоговора_УчастиеВТендере.ПолучитьОбъект();
	Исключение
		ОтветОбъект = Справочники.ОтветыНаВопросыАнкет.СоздатьЭлемент();
		ОтветОбъект.ИмяПредопределенныхДанных = "СпособЗаключенияДоговора_УчастиеВТендере";
	КонецПопытки;
	ОтветОбъект.Наименование = "Участие в тендере";
	ОтветОбъект.ВопросАнкеты = ВопросОбъект.Ссылка;
	ОтветОбъект.Записать();
	
КонецПроцедуры
//Евросиб Каблов 27.12.2019 )

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_2

//Евросиб Каблов 27.12.2019 ( Ticket#0182095
Процедура ОбработатьКатегорииКонтрагентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииКонтрагентов.Период КАК Период,
		|	КатегорииКонтрагентов.Контрагент КАК Контрагент,
		|	КатегорииКонтрагентов.ТипКонтрагента КАК ТипКонтрагента,
		|	КатегорииКонтрагентов.УдалитьКатегорияФактическая КАК УдалитьКатегорияФактическая
		|ИЗ
		|	РегистрСведений.КатегорииКонтрагентов КАК КатегорииКонтрагентов
		|ГДЕ
		|	КатегорииКонтрагентов.ПлановаяФактическая = ЗНАЧЕНИЕ(Перечисление.ПланФакт.ПустаяСсылка)
		|	И КатегорииКонтрагентов.УдалитьКатегорияФактическая <> """"
		|	И КатегорииКонтрагентов.Категория = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
		
	Пока Выборка.Следующий() Цикл		
		
		ЗаписьРегистра = РегистрыСведений.КатегорииКонтрагентов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка, "Период, Контрагент, ТипКонтрагента");
		ЗаписьРегистра.ПлановаяФактическая = Перечисления.ПланФакт.Факт;
		ЗаписьРегистра.Категория = Выборка.УдалитьКатегорияФактическая;
		ЗаписьРегистра.Записать();		
		
	КонецЦикла;
	
	СтарыеЗаписи = РегистрыСведений.КатегорииКонтрагентов.СоздатьНаборЗаписей();
	СтарыеЗаписи.Отбор.ПлановаяФактическая.Значение = Перечисления.ПланФакт.ПустаяСсылка();
	СтарыеЗаписи.Отбор.ПлановаяФактическая.Использование = Истина;
	СтарыеЗаписи.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
//Евросиб Каблов 27.12.2019 )

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_3

//Евросиб Каблов 18.08.2020
Процедура ОбработатьНаименованияПодписей() Экспорт
	
	ЭлементОбъект = Справочники.НаименованияПодписей.Исполнитель.ПолучитьОбъект();
	ЭлементОбъект.ТипПодписи = Перечисления.ТипыПодписей.ПодписьИсполнителя;
	ЭлементОбъект.Записать();
	
	ЭлементОбъект = Справочники.НаименованияПодписей.Клиент.ПолучитьОбъект();
	ЭлементОбъект.ТипПодписи = Перечисления.ТипыПодписей.ПодписьКлиента;
	ЭлементОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_4

//Евросиб Каблов 06.10.2020
Процедура ОбработатьВидыКонтактнойИнформации() Экспорт
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизацииАнгл.ПолучитьОбъект();
	ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ВидКонтактнойИнформации.Используется = Истина;
	ВидКонтактнойИнформации.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_5

//Евросиб Каблов 08.10.2020
Процедура УстановитьПараметрыРегламентногоЗаданияДиадок() Экспорт
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Диадок_РегламентныеДействия);
	РеглЗадание.Параметры.Добавить("КонтурЭДО"); //Имя встроенной обработки Диадок
	РеглЗадание.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_9

//ДИТ Авдеева В. 43126 04.04.2022 начало      
Процедура ОбновитьПредопределеннуюНоменклатуруТЭУ() Экспорт
	НоменклатураТЭУ = Справочники.Номенклатура.НайтиПоКоду("Z00000063");
	Если ЗначениеЗаполнено(НоменклатураТЭУ) Тогда
		НоменклатураОбъект = НоменклатураТЭУ.ПолучитьОбъект();
		НоменклатураОбъект.ИмяПредопределенныхДанных = "ТЭУ";
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		НоменклатураОбъект.Записать();
	КонецЕсли;
     
КонецПроцедуры
//ДИТ Авдеева В. 43126 04.04.2022 Конец 

#КонецОбласти   

#Область ОбработчикиПереходаНаВерсию_1_0_0_10

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_11

////Евросиб Каблов 04.05.2022  Task 45436
//Процедура СоздатьПредопределенныеЭлементыСправочникаСостояния() Экспорт
//	
//	СостояниеСсылка = Справочники.Состояния.НайтиПоНаименованию("Ввод заявки, выбор рейса");
//	Если ЗначениеЗаполнено(СостояниеСсылка) Тогда
//		СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
//		СостояниеОбъект.ИмяПредопределенныхДанных = "ВводЗаявкиВыборРейса";
//		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//		СостояниеОбъект.Записать();
//	КонецЕсли;
//	
//	СостояниеСсылка = Справочники.Состояния.НайтиПоНаименованию("Подбор заявок, заполнение состава поезда, ТСх");
//	Если ЗначениеЗаполнено(СостояниеСсылка) Тогда
//		СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
//		СостояниеОбъект.ИмяПредопределенныхДанных = "СделкаПодборЗаявокЗаполнениеСоставаПоездаТСх";
//		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//		СостояниеОбъект.Записать();
//	КонецЕсли;
//	
//	СостояниеСсылка = Справочники.Состояния.НайтиПоНаименованию("Исполнение перевозки");
//	Если ЗначениеЗаполнено(СостояниеСсылка) Тогда
//		СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
//		СостояниеОбъект.ИмяПредопределенныхДанных = "СделкаИсполнениеПеревозки";
//		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//		СостояниеОбъект.Записать();
//	КонецЕсли;
//	
//	//Задачи делегирования
//	Попытка
//		СостояниеСогласованиеГруппа = Справочники.Состояния.СогласованиеГруппа;
//	Исключение
//		СостояниеСогласованиеГруппа = Справочники.Состояния.ПустаяСсылка();
//	КонецПопытки;
//	
//	СостояниеЗадачиДелегированияСсылка = Справочники.Состояния.НайтиПоНаименованию("Задачи делегирования");
//	Если Не ЗначениеЗаполнено(СостояниеЗадачиДелегированияСсылка) Тогда
//		СостояниеОбъект = Справочники.Состояния.СоздатьГруппу();
//		СостояниеОбъект.Родитель = СостояниеСогласованиеГруппа;
//		СостояниеОбъект.Наименование = "Задачи делегирования";
//		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗадачиДелегирования";
//		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//		СостояниеОбъект.Записать();
//		СостояниеЗадачиДелегированияСсылка = СостояниеОбъект.Ссылка;
//	КонецЕсли;
//	
//	ДелегированноеСогласованиеСсылка = Справочники.Состояния.НайтиПоНаименованию("Делегированное согласование");
//	Если ЗначениеЗаполнено(ДелегированноеСогласованиеСсылка) Тогда
//		Если ДелегированноеСогласованиеСсылка.ИмяПредопределенныхДанных = "" Тогда
//			СостояниеОбъект = ДелегированноеСогласованиеСсылка.ПолучитьОбъект();
//			СостояниеОбъект.ИмяПредопределенныхДанных = "ДелегированноеСогласование";
//			СостояниеОбъект.Родитель = СостояниеЗадачиДелегированияСсылка;
//			СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//			СостояниеОбъект.Записать();
//		КонецЕсли;
//	Иначе
//		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
//		СостояниеОбъект.ИмяПредопределенныхДанных = "ДелегированноеСогласование";
//		СостояниеОбъект.Родитель = СостояниеЗадачиДелегированияСсылка;
//		СостояниеОбъект.Наименование = "Делегированное согласование";
//		СостояниеОбъект.Процессное = Истина;
//		СостояниеОбъект.Согласование = Истина;
//		СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ВсегдаПерезапускать;
//		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//		СостояниеОбъект.Записать();
//	КонецЕсли;
//	
//	Для Сч = 2 по 10 Цикл
//		
//		СтрокаСч = Строка(Сч);
//		ИмяПредопределенного = "ДелегированноеСогласование" + СтрокаСч;
//		НаименованиеПредопределенного = "Делегированное согласование " + СтрокаСч;
//		
//		Попытка
//		    ДелегированноеСогласованиеСсылка = Справочники.Состояния[ИмяПредопределенного];
//		Исключение
//			ДелегированноеСогласованиеСсылка = Неопределено;
//		КонецПопытки;
//		
//		Если Не ЗначениеЗаполнено(ДелегированноеСогласованиеСсылка) Тогда
//			ДелегированноеСогласованиеСсылка = Справочники.Состояния.НайтиПоНаименованию(НаименованиеПредопределенного);
//			Если ЗначениеЗаполнено(ДелегированноеСогласованиеСсылка) Тогда
//				СостояниеОбъект = ДелегированноеСогласованиеСсылка.ПолучитьОбъект();
//				СостояниеОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
//				СостояниеОбъект.Родитель = СостояниеЗадачиДелегированияСсылка;
//				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//				СостояниеОбъект.Записать();
//			Иначе
//				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
//				СостояниеОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
//				СостояниеОбъект.Родитель = СостояниеЗадачиДелегированияСсылка;
//				СостояниеОбъект.Наименование = НаименованиеПредопределенного;
//				СостояниеОбъект.Процессное = Истина;
//				СостояниеОбъект.Согласование = Истина;
//				СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ВсегдаПерезапускать;
//				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
//				СостояниеОбъект.Записать();
//			КонецЕсли;
//		КонецЕсли;
//	
//		//СостУчета = Справочники.Состояния["ДелегированноеСогласование"+Сч];	
//		//Если МассивИспользованных.Найти(СостУчета) = Неопределено Тогда
//		//	МассивИспользованных.Добавить(СостУчета);
//		//	Возврат СостУчета;
//		//КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_13

Процедура ЗаполнитьСправочникиВидыЖДН() Экспорт
	
	//груженая ждн
	ссВидЖДН = Справочники.ВидыЖДН.ГруженаяЖДН;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ЖДН";
	обВидЖДН.ЕстьДопРазделениеКТКПорожний = Истина;
	обВидЖДН.ВсегдаДобавлятьУслугу = Ложь;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ГруженыйЖДтарифРФ", Истина);
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	обВидЖДН.Записать();
	
	//Порожняя ЖДН (ваг)
	ссВидЖДН = Справочники.ВидыЖДН.ПорожняяЖДН_Ваг;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ВагоннаяЖДН";
	обВидЖДН.ЭтоВагоннаяЖДН = Истина;
	обВидЖДН.ВсегдаДобавлятьУслугу = Ложь;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПодПогрузкуРФ", Истина);
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифПодПогрузкуПрочТерритории", Истина);
	обВидЖДН.Записать();
		
	//Порожняя ЖДН (КТК)
	ссВидЖДН = Справочники.ВидыЖДН.ПорожняяЖДН_КТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ПорожняяЖДНКТК";
	обВидЖДН.ВсегдаДобавлятьУслугу = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	обВидЖДН.Записать();

	//ЖДН перестановки до груж. КТК
	ссВидЖДН = Справочники.ВидыЖДН.ЖДН_ПерестановкиДоГружКТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ЖДНПерестановкиДоГружКТК";
	обВидЖДН.ВсегдаДобавлятьУслугу = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПодПогрузкуРФ", Истина);
	обВидЖДН.Записать();

	//ЖДН перестановки до пор. КТК
	ссВидЖДН = Справочники.ВидыЖДН.ЖДН_ПерестановкиДоПорКТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ЖДНПерестановкиДоПорКТК";
	обВидЖДН.ВсегдаДобавлятьУслугу = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПодПогрузкуРФ", Истина);
	обВидЖДН.Записать();

	//ЖДН подсыла под порожний КТК
	ссВидЖДН = Справочники.ВидыЖДН.ЖДН_ПодсылПодПорожнийКТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ПорожняяВагоннаяЖДН";
	обВидЖДН.ЭтоВагоннаяЖДН = Истина;
	обВидЖДН.ВсегдаДобавлятьУслугу = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПодПогрузкуРФ", Истина);
	обВидЖДН.Записать();

	//ЖДН после груж. (вагон)
	ссВидЖДН = Справочники.ВидыЖДН.ЖДН_ПослеГружВагон;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "НакладнаяПослеГруженогоПлеча";
	обВидЖДН.ВсегдаДобавлятьУслугу = Ложь;
	обВидЖДН.ИспользоватьТолькоУслугиСГруппой = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПослеВыгрузкиРФ", Истина);
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифПослеВыгрузкиПрочТерритории", Истина);
 	обВидЖДН.Записать();

	//ЖДН после груж. (КТК)
	ссВидЖДН = Справочники.ВидыЖДН.ЖДН_ПослеГружКТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "НакладнаяПослеГружКТК";
	обВидЖДН.ВсегдаДобавлятьУслугу = Ложь; 
	обВидЖДН.ИспользоватьТолькоУслугиСГруппой = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифКонтейнерПрочТерритории", Истина);
	обВидЖДН.Записать();

	//Груженая ЖДН порожний КТК
	ссВидЖДН = Справочники.ВидыЖДН.ГруженаяЖДН_ПорожнийКТК;
	обВидЖДН = ссВидЖДН.ПолучитьОбъект();
	обВидЖДН.ИмяРеквизитаВСоставеПоезда = "ЖДН";
	обВидЖДН.ВсегдаДобавлятьУслугу = Ложь;
	обВидЖДН.ЕстьДопРазделениеКТКПорожний = Истина;
	обВидЖДН.КТКПорожний = Истина;
	обВидЖДН.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	обВидЖДН.СвязанныеУслуги.Очистить();
	нУслуга = обВидЖДН.СвязанныеУслуги.Добавить();
	нУслуга.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	обВидЖДН.Записать();
КонецПроцедуры

Процедура ЗаполнитьПризнакиНоменклатурыЭтоТариф() Экспорт

	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПодПогрузкуРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПослеВыгрузкиРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифПодПогрузкуПрочТерритории", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифПослеВыгрузкиПрочТерритории", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ГруженыйЖДтарифРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ГруженыйЖДтарифПрочТерритории", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("Порожний ТарифКонтейнерПрочТерритории", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ЭтоТариф = Истина;
	обНом.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиНоменклатурыОтсутствиеПеревозкиПоЖДДляКалькуляции() Экспорт	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ГруженыйЖДтарифРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ОтсутствиеПеревозкиПоЖДДляКалькуляции = Истина;
	обНом.Записать();
	
	ссНом = Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифКонтейнерРФ", Истина);
	обНом = ссНом.ПолучитьОбъект();
	обНом.ОтсутствиеПеревозкиПоЖДДляКалькуляции = Истина;
	обНом.Записать();
	
КонецПроцедуры  

//Евросиб - АСуслов 26.04.2022 15:44:45 #
//(
Процедура ЗаполнитьГУИДыВКалькуляциях() Экспорт

	Константы.НачалоПериодаИспользованияНовогоАлгоритмаЗаполненияРасходов.Установить(Дата("20220601"));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Калькуляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	(Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.ИдентификаторСтроки = &ИдентификаторСтроки
	|			ИЛИ Калькуляция.НФ_ВыбранныеСтавки.ИдентификаторСтроки = &ИдентификаторСтроки
	|			ИЛИ Калькуляция.ЖД_УслугиВнеСтавки.ИдентификаторСтроки = &ИдентификаторСтроки)";
	Запрос.УстановитьПараметр("ИдентификаторСтроки", "");
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обКалькуляция = Выборка.Ссылка.ПолучитьОбъект();
		обКалькуляция.ЗаполнитьИдентификаторыСтрок();
		обКалькуляция.УстановитьПризнакОтсутствуетПеревозкаПоЖД();
		Попытка
			обКалькуляция.ОбменДанными.Загрузка = Истина;
			обКалькуляция.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_16
//ДИТ Шевченко А.В. TASK 51973 01.07.2022 -Конец

//ДИТ Шевченко А.В. TASK 55132 28.07.2022 -Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияПоЗапросуНаАвтоперевозку() Экспорт
	
	СостоянияПустаяСсылка = Справочники.Состояния.ПустаяСсылка();
		
	Если Справочники.Состояния.НайтиПоНаименованию("Несовпадение план. и факт. номера КТК") = СостоянияПустаяСсылка Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.Наименование = "Несовпадение план. и факт. номера КТК";
		СостояниеОбъект.ИмяПредопределенныхДанных = "НесовпадениеПланФактНомераКТК";
		СостояниеОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 01.08.2022 Ticket#0239076
Процедура ДобавитьПредопределенныеЭлементыСправочникаСостоянияПоИзменениюСчета() Экспорт
	
	ГруппаСлужебныеСостоянияСчета = Справочники.Состояния.НайтиПоНаименованию("Служебные состояния счета");
	Если Не ЗначениеЗаполнено(ГруппаСлужебныеСостоянияСчета) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьГруппу();
		СостояниеОбъект.Наименование = "Служебные состояния счета";
		СостояниеОбъект.ИмяПредопределенныхДанных = "СлужебныеСостоянияСчета";
		СостояниеОбъект.Записать();
		ГруппаСлужебныеСостоянияСчета = СостояниеОбъект.Ссылка;
	КонецЕсли;
	
	СостоянияПустаяСсылка = Справочники.Состояния.ПустаяСсылка();
	
	НаименованиеЭлемента = "Задачи: отработать изменение счета, отменить РТУ";
	ГруппаЗадачиОтработатьИзменениеСчетаОтменитьРТУ = Справочники.Состояния.НайтиПоНаименованию(НаименованиеЭлемента);
	Если Не ЗначениеЗаполнено(ГруппаЗадачиОтработатьИзменениеСчетаОтменитьРТУ) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьГруппу();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗадачиОтработатьИзменениеСчетаОтменитьРТУ";
		СостояниеОбъект.Родитель = ГруппаСлужебныеСостоянияСчета;
		СостояниеОбъект.Записать();
		ГруппаЗадачиОтработатьИзменениеСчетаОтменитьРТУ = СостояниеОбъект.Ссылка;
	КонецЕсли;
	
	НаименованиеЭлемента = "Задачи: отработать изменение счета, создать СЗ на изменение документов";
	ГруппаЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов = Справочники.Состояния.НайтиПоНаименованию(НаименованиеЭлемента);
	Если Не ЗначениеЗаполнено(ГруппаЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьГруппу();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов";
		СостояниеОбъект.Родитель = ГруппаСлужебныеСостоянияСчета;
		СостояниеОбъект.Записать();
		ГруппаЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов = СостояниеОбъект.Ссылка;
	КонецЕсли;
	
	ИмяЭлемента = "ОтработатьИзменениеСчетаОтменитьРТУ";
	НаименованиеЭлемента = "Отработать изменение счета, отменить РТУ";	
	Попытка
	    СостояниеСсылка = Справочники.Состояния[ИмяЭлемента];
		СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = ИмяЭлемента + "1";
		СостояниеОбъект.Родитель = ГруппаЗадачиОтработатьИзменениеСчетаОтменитьРТУ;
		СостояниеОбъект.Записать();	
	Исключение
		
	КонецПопытки;
	
	Для Сч = 1 По 10 Цикл
		
		СчСтрокой = Формат(Сч, "ЧГ=0");
		ИмяТекЭлемента = ИмяЭлемента + СчСтрокой;
		
		Попытка
			СостояниеСсылка = Справочники.Состояния[ИмяТекЭлемента];
		Исключение
			СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
			СостояниеОбъект.Наименование = НаименованиеЭлемента;
			СостояниеОбъект.ИмяПредопределенныхДанных = ИмяТекЭлемента;
			СостояниеОбъект.Родитель = ГруппаЗадачиОтработатьИзменениеСчетаОтменитьРТУ;
			СостояниеОбъект.Записать();
		КонецПопытки;
		
	КонецЦикла;
	
	ИмяЭлемента = "ОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов";
	НаименованиеЭлемента = "Отработать изменение счета, создать СЗ на изменение документов";
	Попытка
	    СостояниеСсылка = Справочники.Состояния[ИмяЭлемента];
		СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = ИмяЭлемента + "1";
		СостояниеОбъект.Родитель = ГруппаЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов;
		СостояниеОбъект.Записать();	
	Исключение
		
	КонецПопытки;
	
	Для Сч = 1 По 10 Цикл
		
		СчСтрокой = Формат(Сч, "ЧГ=0");
		ИмяТекЭлемента = ИмяЭлемента + СчСтрокой;
		
		Попытка
			СостояниеСсылка = Справочники.Состояния[ИмяТекЭлемента];
		Исключение
			СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
			СостояниеОбъект.Наименование = НаименованиеЭлемента;
			СостояниеОбъект.ИмяПредопределенныхДанных = ИмяТекЭлемента;
			СостояниеОбъект.Родитель = ГруппаЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов;
			СостояниеОбъект.Записать();
		КонецПопытки;
		
	КонецЦикла;
	 
	Если Справочники.Состояния.НайтиПоНаименованию("Изменен счет на оплату. Проверить соответствие информации в шапке сделки, составе КП, экономике") = СостоянияПустаяСсылка Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = "Изменен счет на оплату. Проверить соответствие информации в шапке сделки, составе КП, экономике";
		СостояниеОбъект.ИмяПредопределенныхДанных = "ИзмененСчетПроверитьСоответствиеИнформацииВСделке";
		СостояниеОбъект.Родитель = Справочники.Состояния.СлужебныеСостоянияСделки;
		СостояниеОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 01.07.2022 -Начало
Процедура ОбновитьПредопределенныйГрузСборнаяКонтейнернаяОтправка() Экспорт	
	ЭлГруз = Справочники.Грузы.НайтиПоКоду("000001900");
	Если ЗначениеЗаполнено(ЭлГруз) Тогда
		ОбГруз = ЭлГруз.ПолучитьОбъект();
		ОбГруз.ИмяПредопределенныхДанных = "СборнаяКонтейнернаяОтправка";
		ОбГруз.ОбменДанными.Загрузка = Истина;
		ОбГруз.Записать();
	КонецЕсли;    
КонецПроцедуры

Процедура ОбновитьКонтактнуюИнформациюДляЗапросаНаАвтоперевозку() Экспорт
	ГруппаКонтактнойИнформации     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформации.Имя = "ДокументЗапросНаАвтоперевозку";
    ГруппаКонтактнойИнформации.Наименование = НСтр("ru='Контактная информация документа ""Запрос на автоперевозку""'");
    
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);
	
	ГруппаКонтактнойИнформацииТЧ     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииТЧ.Имя = "ДокументЗапросНаАвтоперевозкуКонтейнеры";
    ГруппаКонтактнойИнформацииТЧ.Наименование = НСтр("ru='Контактная информация тч документа ""Запрос на автоперевозку""'");
	ГруппаКонтактнойИнформацииТЧ.Группа = Группа;
	
    ГруппаТЧ = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);
    
    Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресЗаказНаАвтоперевозку";
	Вид.Наименование = "Адрес склада клиента";
    Вид.Порядок = 1;
    Вид.Группа = ГруппаТЧ;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    Вид.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
    Вид.НастройкиПроверки. ПроверятьКорректность = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);	
КонецПроцедуры	
//ДИТ Шевченко А.В. TASK 55132 28.07.2022 -Конец

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_20
Процедура ЗаполнитьУчетныеНаправленияВКалькуляциях() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Калькуляция,
	|	ВЫБОР
	|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.РефрижераторныеПеревозки)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.РефрижераторныеПеревозки)
	|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.МультимодальныеПеревозки)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УчетноеНаправление
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.УчетноеНаправление = ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.РефрижераторныеПеревозки)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.РефрижераторныеПеревозки)
	|			КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.МультимодальныеПеревозки)
	|		КОНЕЦ <> НЕОПРЕДЕЛЕНО";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обКалькуляция = Выборка.Калькуляция.ПолучитьОбъект();
		обКалькуляция.УчетноеНаправление = Выборка.УчетноеНаправление;
		обКалькуляция.ОбменДанными.Загрузка = Истина;
		Попытка
		обКалькуляция.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_23
Процедура СоздатьЭлементыСтатусыЗаявок() Экспорт
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Вставить(50,"Не Отправлен");
	МассивСтатусов.Вставить(51,"Отправлен");
	МассивСтатусов.Вставить(52,"Частично отправлен");
	МассивСтатусов.Вставить(53,"Частично отправлен, без ответа");
	МассивСтатусов.Вставить(54,"Отправлен, без ответа");
	МассивСтатусов.Вставить(55,"Частично принят");
	МассивСтатусов.Вставить(56,"Принят");
	МассивСтатусов.Вставить(57,"Не принят");
	МассивСтатусов.Вставить(58,"Версия отправки устарела");
	МассивСтатусов.Вставить(59,"Удалено");
	
	МассивСтатусовПред = Новый Массив;
	МассивСтатусовПред.Вставить(50,"НеОтправлен");
	МассивСтатусовПред.Вставить(51,"Отправлен");
	МассивСтатусовПред.Вставить(52,"ЧастичноОтправлен");
	МассивСтатусовПред.Вставить(53,"ЧастичноОтправленБезОтвета");
	МассивСтатусовПред.Вставить(54,"ОтправленБезОтвета");
	МассивСтатусовПред.Вставить(55,"ЧастичноПринят");
	МассивСтатусовПред.Вставить(56,"Принят");
	МассивСтатусовПред.Вставить(57,"НеПринят");
	МассивСтатусовПред.Вставить(58,"ВерсияОтправкиУстарела");
	МассивСтатусовПред.Вставить(59,"Удалено");
	
	Для инд = 50 По 59 Цикл
		
		НайденыйЭлемент = Справочники.СибурСтатусыЗаявок.НайтиПоРеквизиту("КодСтатуса",СокрЛП(инд));
		Если НЕ ЗначениеЗаполнено(НайденыйЭлемент) Тогда
			НовЭлемент = Справочники.СибурСтатусыЗаявок.СоздатьЭлемент();
			НовЭлемент.Наименование = МассивСтатусов.Получить(инд);
			НовЭлемент.КодСтатуса = инд;
			НовЭлемент.ВидЗаявки = Перечисления.ВидыЗаявокСибура.РелизКлиента;
			НовЭлемент.ИмяПредопределенныхДанных = МассивСтатусовПред.Получить(инд);
			НовЭлемент.Записать();
		Иначе
			СпрНайд = НайденыйЭлемент.ПолучитьОбъект();
			СпрНайд.ИмяПредопределенныхДанных = МассивСтатусовПред.Получить(инд);
			СпрНайд.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_24
Процедура ЗаполнитьРегистрОчередьАвторазнесения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВложенныйЗапрос.Изменено, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоАкцепта
	|ПОМЕСТИТЬ ТЧ_ПТУ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Акцепт.Поступление КАК Поступление,
	|			МАКСИМУМ(Акцепт.Изменено) КАК Изменено
	|		ИЗ
	|			Документ.Акцепт КАК Акцепт
	|		ГДЕ
	|			Акцепт.ПометкаУдаления = ЛОЖЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Акцепт.Поступление) КАК ВложенныйЗапрос
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ВложенныйЗапрос.Поступление
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен
	|	И ПоступлениеТоваровУслуг.УдалитьВОчередиАвторазнесения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	коррПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВложенныйЗапрос.Изменено, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоАкцепта
	|ПОМЕСТИТЬ ТЧ_коррПТУ
	|ИЗ
	|	Документ.КорректировкаПоступления КАК коррПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Акцепт.Поступление КАК Поступление,
	|			МАКСИМУМ(Акцепт.Изменено) КАК Изменено
	|		ИЗ
	|			Документ.Акцепт КАК Акцепт
	|		ГДЕ
	|			Акцепт.ПометкаУдаления = ЛОЖЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Акцепт.Поступление) КАК ВложенныйЗапрос
	|		ПО коррПоступлениеТоваровУслуг.Ссылка = ВложенныйЗапрос.Поступление
	|ГДЕ
	|	коррПоступлениеТоваровУслуг.Проведен
	|	И коррПоступлениеТоваровУслуг.УдалитьВОчередиАвторазнесения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_ПТУ.Ссылка КАК Ссылка,
	|	ТЧ_ПТУ.ДатаПоследнегоАкцепта КАК ДатаПоследнегоАкцепта
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ТЧ_ПТУ КАК ТЧ_ПТУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ_коррПТУ.Ссылка,
	|	ТЧ_коррПТУ.ДатаПоследнегоАкцепта
	|ИЗ
	|	ТЧ_коррПТУ КАК ТЧ_коррПТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ПротоколАвторазнесенияПТУСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколАвторазнесенияПТУ.СрезПоследних КАК ПротоколАвторазнесенияПТУСрезПоследних
	|		ПО ВТ.Ссылка = ПротоколАвторазнесенияПТУСрезПоследних.Поступление
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОкончания,
	|	ПротоколАвторазнесенияПТУСрезПоследних.Поступление.Дата";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		мз = РегистрыСведений.ОчередьАвторазнесения.СоздатьМенеджерЗаписи();
		мз.Поступление = Выборка.Ссылка;
		мз.ДатаРазнесения = Выборка.ДатаОкончания;
		мз.СостояниеАвторазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Выборка.Ссылка).СтатусРазнесения;
		мз.Записать();
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СоздатьШаблоныКлючейАналитикиСтрокКалькуляции_2() Экспорт 
	
	Ключ = Справочники.КлючиАналитикиСтрокКалькуляции.СоздатьЭлемент();
	Ключ.РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияСтавокПоФрахту;
	Ключ.ИспользуетсяКакШаблон = Истина;
	КлючевыеПоля = Ключ.КлючевыеПоля;
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "Услуга";
	Ключ.Записать();
КонецПроцедуры	

Процедура ЗаполнитьКлючиАналитикиВКалькуляциях_2() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Калькуляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.НФ_ВыбранныеСтавки.КлючАналитикиСтрокиКалькуляции = &ПустойКлюч";
	Запрос.УстановитьПараметр("ПустойКлюч", Справочники.КлючиАналитикиСтрокКалькуляции.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обКалькуляция = Выборка.Ссылка.ПолучитьОбъект();
		обКалькуляция.ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияСтавокПоФрахту);
		Попытка
			обКалькуляция.ОбменДанными.Загрузка = Истина;
			обКалькуляция.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_25
Процедура ДобавитьПредопределенныеЭлементыСправочникаСтраныМираИЛокации() Экспорт
	
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	КитайСтрана = Справочники.СтраныМира.НайтиПоНаименованию("КИТАЙ", Истина);
	Если ЗначениеЗаполнено(КитайСтрана) Тогда
		КитайСтранаОбъект = КитайСтрана.ПолучитьОбъект();
		КитайСтранаОбъект.ИмяПредопределенныхДанных = "Китай";
		КитайСтранаОбъект.Записать();
	КонецЕсли;
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
		
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_26
Процедура ДобавитьПредопределенныйЭлементТипоразмерыТСРефПлатформа() Экспорт

	//ДИТ Моисеенко Ю.В. 11.11.2022 59323 -начало
	ТСРеф = Справочники.ТипоразмерыТС.НайтиПоКоду("13-6903");
	Если ЗначениеЗаполнено(ТСРеф) Тогда
		ТСРефОбъект = ТСРеф.ПолучитьОбъект();
		ТСРефОбъект.ИмяПредопределенныхДанных = "РефСцПлатформа";
		ТСРефОбъект.Записать();
	КонецЕсли;
	//ДИТ Моисеенко Ю.В. 11.11.2022 59323 -конец
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_27
Процедура ДобавитьПредопределенныеЭлементыСправочникаСостоянияДоговоры() Экспорт
	СлужебныеСостоянияСчетаОтвЗаУчет = Справочники.Состояния.НайтиПоНаименованию("Заполнить ответственного за учет");
	Если ЗначениеЗаполнено(СлужебныеСостоянияСчетаОтвЗаУчет) Тогда
		СостояниеОбъект = СлужебныеСостоянияСчетаОтвЗаУчет.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьОтветственногоЗаУчет";
		СостояниеОбъект.Записать();
	КонецЕсли;
	
	СлужебныеСостоянияСчетаОтвЗаСопр = Справочники.Состояния.НайтиПоНаименованию("Указать ответственного за сопровождение");
	Если ЗначениеЗаполнено(СлужебныеСостоянияСчетаОтвЗаСопр) Тогда
		СостояниеОбъект = СлужебныеСостоянияСчетаОтвЗаСопр.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "УказатьОтветственногоЗаСопровождение";
		СостояниеОбъект.Записать();
	КонецЕсли;
	
	СлужебныеСостоянияСчетаПередачаОригинала = Справочники.Состояния.НайтиПоНаименованию("Контроль поступления оригинала договора"); 
	ГруппаСлужебныеДоговора = Справочники.Состояния.НайтиПоНаименованию("Маршруты договора");
	Если НЕ ЗначениеЗаполнено(СлужебныеСостоянияСчетаПередачаОригинала) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = "Контроль поступления оригинала договора";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ИмяПредопределенныхДанных = "КонтрольПоступленияОригиналаДоговора";
		СостояниеОбъект.Родитель = ГруппаСлужебныеДоговора;
		СостояниеОбъект.Записать();
	КонецЕсли;	
	
	
	СлужебныеСостоянияСчетаНСК = Справочники.Состояния.НайтиПоНаименованию("Указать ответственного за сопровождение и учет НСК"); 
	ГруппаСлужебныеДоговора = Справочники.Состояния.НайтиПоНаименованию("Маршруты договора");
	Если НЕ ЗначениеЗаполнено(СлужебныеСостоянияСчетаНСК) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = "Указать ответственного за сопровождение и учет НСК";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ИмяПредопределенныхДанных = "УказатьОтветственногоЗаСопровождениеИУчетНСК";
		СостояниеОбъект.Родитель = ГруппаСлужебныеДоговора;
		СостояниеОбъект.Записать();
	КонецЕсли;
	
	СлужебныеСостоянияСчетаНСК = Справочники.Состояния.НайтиПоНаименованию("Заполнить вкладку «Контакты» Клиента, поле «Менеджеры»"); 
	ГруппаСлужебныеДоговора = Справочники.Состояния.НайтиПоНаименованию("Маршруты договора");
	Если НЕ ЗначениеЗаполнено(СлужебныеСостоянияСчетаНСК) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = "Заполнить вкладку «Контакты» Клиента, поле «Менеджеры»";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджеры";
		СостояниеОбъект.Родитель = ГруппаСлужебныеДоговора;
		СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриИзмененииПараметров;
		СостояниеОбъект.ПроверяемыеПараметры = "ОтветственныйЗаСопровождение";
		СостояниеОбъект.Записать();
	Иначе
		СостояниеОбъект = СлужебныеСостоянияСчетаНСК.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджеры";
		СостояниеОбъект.Записать();
	КонецЕсли;
	
	СлужебныеСостоянияСчетаНСК = Справочники.Состояния.НайтиПоНаименованию("Заполнить вкладку «Контакты» Клиента, поле «Менеджеры» НСК"); 
	ГруппаСлужебныеДоговора = Справочники.Состояния.НайтиПоНаименованию("Маршруты договора");
	Если НЕ ЗначениеЗаполнено(СлужебныеСостоянияСчетаНСК) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = "Заполнить вкладку «Контакты» Клиента, поле «Менеджеры» НСК";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджерыНСК";
		СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриИзмененииПараметров; 
		СостояниеОбъект.ПроверяемыеПараметры = "ОтветственныйЗаСопровождениеНСК";
		СостояниеОбъект.Родитель = ГруппаСлужебныеДоговора;
		СостояниеОбъект.Записать();
	Иначе
		СостояниеОбъект = СлужебныеСостоянияСчетаНСК.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджерыНСК";
		СостояниеОбъект.Записать();	
	КонецЕсли;
КонецПроцедуры	

Процедура ВыполнитьПереносОтветственныхИзРеквизитовВТЧОтветственные() Экспорт 
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 09.12.2022
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО) КАК ЦФО,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение) КАК ТипОтветственного,
	               |	ДоговорыКонтрагентов.ОтветственныйЗаСопровождение КАК Ответственный
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ОтветственныйЗаСопровождение = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка,
	               |	ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО),
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет),
	               |	ДоговорыКонтрагентов.ОтветственныйЗаУчет
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ОтветственныйЗаУчет = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка,
	               |	ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск),
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение),
	               |	ДоговорыКонтрагентов.ОтветственныйЗаСопровождениеНСК
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ОтветственныйЗаСопровождениеНСК = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка,
	               |	ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск),
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет),
	               |	ДоговорыКонтрагентов.ОтветственныйЗаУчетНСК
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ОтветственныйЗаУчетНСК = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |ИТОГИ ПО
	               |	Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	Пока ВыборкаДоговор.Следующий() Цикл 
		ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();
		ДоговорОбъект = ВыборкаДоговор.Договор.ПолучитьОбъект();
		// Перенос ответственных в ТЧ
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ДоговорОбъект.Ответственные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		//*
		// очистка старых реквизитов
		ДоговорОбъект.ОтветственныйЗаУчет 				= ПустойПользователь;
		ДоговорОбъект.ОтветственныйЗаСопровождение 		= ПустойПользователь;
		ДоговорОбъект.ОтветственныйЗаУчетНСК 			= ПустойПользователь;
		ДоговорОбъект.ОтветственныйЗаСопровождениеНСК 	= ПустойПользователь;
		//*
		ДоговорОбъект.ОбменДанными.Загрузка = Истина; // что бы не вызывались лишние обработчики и не создавали задачи.
		ДоговорОбъект.Записать();
	КонецЦикла;
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 09.12.2022
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиПереходаНаВерсию_1_0_0_19
Процедура ЗаписатьДанныеВИсториюРазнесенияПоступлений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Акцепт.Поступление КАК Поступление,
	|	Акцепт.Ссылка КАК Акцепт
	|ПОМЕСТИТЬ ВТАктуальныеАкцепты
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|ГДЕ
	|	Акцепт.Проведен
	|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|	И НЕ Акцепт.Ссылка В
	|				(ВЫБРАТЬ
	|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	|				ИЗ
	|					Документ.Акцепт КАК Акцепт
	|				ГДЕ
	|					Акцепт.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокАкцепт.Ссылка КАК Ссылка
	|ИЗ
	|	ВТАктуальныеАкцепты КАК ВТАктуальныеАкцепты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт КАК ДокАкцепт
	|		ПО ВТАктуальныеАкцепты.Акцепт = ДокАкцепт.Ссылка
	|			И (НЕ ДокАкцепт.Услуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка))";
	Запрос.УстановитьПараметр("", );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обАкцепт = Выборка.Ссылка.ПолучитьОбъект();
		обАкцепт.ЗаписатьИсториюРазнесения();
	КонецЦикла;
	
КонецПроцедуры	
#КонецОбласти 


 #Область ОбработчикиПереходаНаВерсию_1_0_0_31
Процедура СоздатьРегиональныйЦФО() Экспорт             
	РЦФО = Справочники.РегиональныеЦФО.НайтиПоНаименованию("Центр");
	Если РЦФО.Пустая() Тогда
		обРЦФО = Справочники.РегиональныеЦФО.СоздатьЭлемент();
		обРЦФО.Наименование = "Центр";
	Иначе
		обРЦФО = РЦФО.ПолучитьОбъект();
		обРЦФО.Дороги.Очистить();
	КонецЕсли;
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ГОР");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ДОH");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("КЛГ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("КБШ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("МСК");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ОКТ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("Польские");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ПДН");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("СВР");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("СЕВ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("Финская");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЭСТ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЮУР");
	обРЦФО.Записать();
	
	РЦФО = Справочники.РегиональныеЦФО.НайтиПоНаименованию("Восток");
	Если РЦФО.Пустая() Тогда
		обРЦФО = Справочники.РегиональныеЦФО.СоздатьЭлемент();
		обРЦФО.Наименование = "Восток";
	Иначе
		обРЦФО = РЦФО.ПолучитьОбъект();
		обРЦФО.Дороги.Очистить();
	КонецЕсли;
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ДВС");
	обРЦФО.Записать();
	
	РЦФО = Справочники.РегиональныеЦФО.НайтиПоНаименованию("Юг");
	Если РЦФО.Пустая() Тогда
		обРЦФО = Справочники.РегиональныеЦФО.СоздатьЭлемент();
		обРЦФО.Наименование = "Юг";
	Иначе
		обРЦФО = РЦФО.ПолучитьОбъект();
		обРЦФО.Дороги.Очистить();
	КонецЕсли;
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("АЗЕ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("АРМ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ГРУ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ПРИ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("СКА");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЮВС");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЮЖH");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЮЗП");
	обРЦФО.Записать();
	
	РЦФО = Справочники.РегиональныеЦФО.НайтиПоНаименованию("Азия Транзит");
	Если РЦФО.Пустая() Тогда
		обРЦФО = Справочники.РегиональныеЦФО.СоздатьЭлемент();
		обРЦФО.Наименование = "Азия Транзит";
	Иначе
		обРЦФО = РЦФО.ПолучитьОбъект();
		обРЦФО.Дороги.Очистить();
	КонецЕсли;
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("БЕЛ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("КЗХ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("КРГ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("МОН");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ТАД");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ТУР");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("УЗБ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("Улан-Баторская");
	обРЦФО.Записать();
	
	РЦФО = Справочники.РегиональныеЦФО.НайтиПоНаименованию("Сибирь");
	Если РЦФО.Пустая() Тогда
		обРЦФО = Справочники.РегиональныеЦФО.СоздатьЭлемент();
		обРЦФО.Наименование = "Сибирь";
	Иначе
		обРЦФО = РЦФО.ПолучитьОбъект();
		обРЦФО.Дороги.Очистить();
	КонецЕсли;
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ВСБ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЗАБ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЗСИ");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("КРС");
	нДорога = обРЦФО.Дороги.Добавить();
	нДорога.Дорога = Справочники.ЖелезныеДороги.НайтиПоНаименованию("ЖДЯ");
	обРЦФО.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьРегиональныйЦФОВСделках() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.РегиональныйЦФО = &РегиональныйЦФО";
	Запрос.УстановитьПараметр("РегиональныйЦФО", Справочники.РегиональныеЦФО.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обСделка = Выборка.Ссылка.ПолучитьОбъект();
		Если обСделка.Служебная Тогда                                              
			РегиональныйЦФОРасходыДКП = Справочники.РегиональныеЦФО.РасходыДКП;
			обСделка.РегиональныйЦФО = РегиональныйЦФОРасходыДКП;
		ИначеЕсли НЕ ЗначениеЗаполнено(обСделка.РегиональныйЦФО) Тогда 
			ДорогаСтанцииОтправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(обСделка.СтанцияОтправления,"ЖелезнаяДорога");
			Если ЗначениеЗаполнено(ДорогаСтанцииОтправления) Тогда
				обСделка.РегиональныйЦФО = Справочники.РегиональныеЦФО.ПолучитьРегиональныйЦФОПоДороге(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(обСделка.СтанцияОтправления,"ЖелезнаяДорога"));	
			КонецЕсли;
		КонецЕсли;           
		Если ЗначениеЗаполнено(обСделка.РегиональныйЦФО) Тогда
			обСделка.ОбменДанными.Загрузка = Истина;
			обСделка.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_37
Процедура СоздатьПредопределенныйЭлементГруппыПользователей() Экспорт
	
	НайденЭл = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель отдела продаж");
	Если НайденЭл = Справочники.ГруппыПользователей.ПустаяСсылка() Тогда
		ОбОтделПродажГруппа = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ОбОтделПродажГруппа.Наименование = "Руководитель отдела продаж";
		ОбОтделПродажГруппа.ИмяПредопределенныхДанных = "РуководительОтделаПродаж";
		ОбОтделПродажГруппа.Записать();
	Иначе
		
		ОбОтделПродажГруппа = НайденЭл.ПолучитьОбъект();
		ОбОтделПродажГруппа.ИмяПредопределенныхДанных = "РуководительОтделаПродаж";	
		ОбОтделПродажГруппа.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура СоздатьПредопределенныйЭлементГруппыПользователейДепартаментаПродажКП() Экспорт
	
	НайденЭл = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель департамента продаж КП");
	Если НайденЭл = Справочники.ГруппыПользователей.ПустаяСсылка() Тогда
		ОбОтделПродажГруппа = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ОбОтделПродажГруппа.Наименование = "Руководитель департамента продаж КП";
		ОбОтделПродажГруппа.ИмяПредопределенныхДанных = "РуководительДепартаментаПродажКП";
		ОбОтделПродажГруппа.Записать();
	Иначе
		
		ОбОтделПродажГруппа = НайденЭл.ПолучитьОбъект();
		ОбОтделПродажГруппа.ИмяПредопределенныхДанных = "РуководительДепартаментаПродажКП";	
		ОбОтделПродажГруппа.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОбработкуСогласованийОтделаПродажВКалькуляциях() Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|ГДЕ
		|	ПСЦ.Проведен
		|	И НЕ ПСЦ.ПометкаУдаления
		|	И ПСЦ.СтатусДокумента В(&СтатусДокумента)";
	
	МассивСогласований = Новый Массив;
	МассивСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
	МассивСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	МассивСогласований.Добавить(Перечисления.СтатусыСогласования.Подписано);
	Запрос.УстановитьПараметр("СтатусДокумента", МассивСогласований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МаршрутизацияСервер.ЗакрытьЗадачиСогласованияВСвязанныхКалькуляциях(ВыборкаДетальныеЗаписи.Ссылка,Истина);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти 

// ++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянийРефСцепа() Экспорт

	СлужебныеСостоянияРефСцепаГруппа = Справочники.Состояния.НайтиПоНаименованию("Служебные состояния реф.сцепа");
	Если не ЗначениеЗаполнено(СлужебныеСостоянияРефСцепаГруппа) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "СлужебныеСостоянияРефСцепа";
		СостояниеГруппа.Наименование = "Служебные состояния реф.сцепа";
		СостояниеГруппа.ОбменДанными.Загрузка = Истина;
		СостояниеГруппа.Записать();
		СлужебныеСостоянияРефСцепаГруппа = СостояниеГруппа.Ссылка;
	КонецЕсли; 
	
	ОбновитьДанныеОВагонахВРефСцепе = Справочники.Состояния.НайтиПоНаименованию("Обновить данные о вагонах в реф. сцепе");
	Если не  ЗначениеЗаполнено(ОбновитьДанныеОВагонахВРефСцепе)  Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ОбновитьДанныеОВагонахВРефСцепе";
		СостояниеОбъект.Наименование = "Обновить данные о вагонах в реф. сцепе";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Родитель = СлужебныеСостоянияРефСцепаГруппа;
		СостояниеОбъект.Записать();
	КонецЕсли; 
	
	МаршрутРефСцепГруппа = Справочники.Состояния.НайтиПоНаименованию("Маршрут Реф.сцеп");
	Если не ЗначениеЗаполнено(МаршрутРефСцепГруппа) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "МаршрутРефСцепГруппа";
		СостояниеГруппа.Наименование = "Маршрут Реф.сцеп";
		СостояниеГруппа.ОбменДанными.Загрузка = Истина;
		СостояниеГруппа.Записать();
		МаршрутРефСцепГруппа = СостояниеГруппа.Ссылка;
	КонецЕсли; 
	

	НаборГрузовойБазыВРефСцеп = Справочники.Состояния.НайтиПоНаименованию("Набор грузовой базы в реф. сцеп");
	Если не ЗначениеЗаполнено(НаборГрузовойБазыВРефСцеп) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "НаборГрузовойБазыВРефСцеп";
		СостояниеОбъект.Наименование = "Набор грузовой базы в реф. сцеп";
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Родитель = МаршрутРефСцепГруппа;
		СостояниеОбъект.Записать();
	КонецЕсли; 
	
	Для Счетчик = 0 По 9 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["СоздатьЗаявкиНаКТКИзРефСцепа" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = "СоздатьЗаявкиНаКТКИзРефСцепа"+Строка(Счетчик);
				СостояниеОбъект.Наименование = "Создать заявки на КТК из реф. сцепа";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
				СостояниеОбъект.Родитель = СлужебныеСостоянияРефСцепаГруппа;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	Для Счетчик = 0 По 9 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["ИсключитьКТКИзСделкиВСвязиСоСменойРефСцепа" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = "ИсключитьКТКИзСделкиВСвязиСоСменойРефСцепа"+Строка(Счетчик);
				СостояниеОбъект.Наименование = "Исключить КТК из сделки в связи со сменой реф.сцепа";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
				СостояниеОбъект.Родитель = СлужебныеСостоянияРефСцепаГруппа;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	Для Счетчик = 0 По 9 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["УдалитьКТКИзЗаявкиСоздатьНовуюЗаявку" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = "УдалитьКТКИзЗаявкиСоздатьНовуюЗаявку"+Строка(Счетчик);
				СостояниеОбъект.Наименование = "Удалить КТК из заявки, создать новую заявку";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
				СостояниеОбъект.Родитель = СлужебныеСостоянияРефСцепаГруппа;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// Заодно добавим тип КТК
	
	ТипоразмерDG = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию("40DG");
	
	Если не ЗначениеЗаполнено(ТипоразмерDG) Тогда
		ТипоразмерDGНовый = Справочники.ТипоразмерыТЕ.СоздатьЭлемент();
		ТипоразмерDGНовый.ИмяПредопределенныхДанных = "Тип40DG";
		ТипоразмерDGНовый.Наименование = "40DG";
		ТипоразмерDGНовый.РазмерКТК  = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40");
		ТипоразмерDGНовый.Длина		 = 12192;
		ТипоразмерDGНовый.Ширина	 = 2438;
		ТипоразмерDGНовый.Высота	 = 2896;
		ТипоразмерDGНовый.Объем		 = 675;
		ТипоразмерDGНовый.КодISO	 = "45SJ";
		ТипоразмерDGНовый.ОбменДанными.Загрузка = Истина;
		ТипоразмерDGНовый.Записать();     
	Иначе
		ТипоразмерDGНовый = ТипоразмерDG.ПолучитьОбъект();
		ТипоразмерDGНовый.ИмяПредопределенныхДанных = "Тип40DG";
		ТипоразмерDGНовый.РазмерКТК  = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40");
		ТипоразмерDGНовый.Длина		 = 12192;
		ТипоразмерDGНовый.Ширина	 = 2438;
		ТипоразмерDGНовый.Высота	 = 2896;
		ТипоразмерDGНовый.Объем		 = 675;
		ТипоразмерDGНовый.КодISO	 = "45SJ";
		ТипоразмерDGНовый.ОбменДанными.Загрузка = Истина;
		ТипоразмерDGНовый.Записать();     
	КонецЕсли;	
	
КонецПроцедуры

#Область ОбработчикиПереходаНаВерсию_1_0_0_33
Процедура ПеренестиДанныеСВВ() Экспорт
	
	Константы.МинимальнаяДлинаПоследнегоБлокаСимволовНомераТДТ.Установить(7);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СВВ КАК СВВ,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_НомерТДТ КАК НомерТДТ,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_КомментарийСВВ КАК КомментарийСВВ,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СправкаЦФТО КАК СправкаЦФТО,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_РешениеТО КАК РешениеТО
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|ГДЕ
		|	(стоки_ТекущиеДанныеСрезПоследних.тек_СВВ <> ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ стоки_ТекущиеДанныеСрезПоследних.тек_НомерТДТ <> """"
		|			ИЛИ стоки_ТекущиеДанныеСрезПоследних.тек_КомментарийСВВ <> """"
		|			ИЛИ стоки_ТекущиеДанныеСрезПоследних.тек_СправкаЦФТО <> """"
		|			ИЛИ стоки_ТекущиеДанныеСрезПоследних.тек_РешениеТО <> """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		обКТК = ВыборкаДетальныеЗаписи.КТК.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(обКТК, ВыборкаДетальныеЗаписи);
		обКТК.Записать();
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_35

// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
Процедура СоздатьПредопределенныеЭлементыСправочникаСостояния_ГотовностьКомплектаПодтверждающихДокументов() Экспорт
	
	СостояниеРодитель = Справочники.Состояния.НайтиПоНаименованию("Задачи готовность комплекта подтверждающих документов");
	
	Если Не ЗначениеЗаполнено(СостояниеРодитель) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "ЗадачиГотовностьКомплектаПодтверждающихДокументов";
		СостояниеГруппа.Наименование = "Задачи готовность комплекта подтверждающих документов";
		СостояниеГруппа.Родитель = Справочники.Состояния.СлужебныеСостоянияСделки;
		Попытка
		СостояниеГруппа.Записать();
		Исключение
		КонецПопытки;
		СостояниеРодитель = СостояниеГруппа.Ссылка;
	КонецЕсли;
	
	Для Счетчик = 1 По 40 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["ГотовностьКомплектаПодтверждающихДокументов" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = ("ГотовностьКомплектаПодтверждающихДокументов" + Строка(Счетчик));
				СостояниеОбъект.Наименование = "Готовность комплекта подтверждающих документов";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.Родитель = СостояниеРодитель;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДИТ 64186 Давудов М.А. Конец: 07.03.2023

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_39
//Евросиб Коханенко Н.А. 11.08.2023 (( #72829
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияСогласованиеПЭО() Экспорт
    СостоянияПустаяСсылка = Справочники.Состояния.ПустаяСсылка();
	СогласованиеПЭОСсылка = Справочники.Состояния.НайтиПоНаименованию("Согласование ПЭО"); 
	Если СогласованиеПЭОСсылка = СостоянияПустаяСсылка Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СогласованиеПЭО";
		СостояниеОбъект.Наименование = "Согласование ПЭО";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	Иначе
		СостояниеОбъект = СогласованиеПЭОСсылка.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СогласованиеПЭО";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

//уже реализовано в версии 31.0.0.37
Процедура СоздатьПредопределенныеЭлементыСправочникаГруппыПользователейРуководительОтделаПродаж() Экспорт
    ГруппыПользователейПустаяСсылка = Справочники.ГруппыПользователей.ПустаяСсылка();
	РуководительОтделаПродажСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель отдела продаж"); 
	Если РуководительОтделаПродажСсылка = ГруппыПользователейПустаяСсылка Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "РуководительОтделаПродаж";
		СостояниеОбъект.Наименование = "Руководитель отдела продаж";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	Иначе
		СостояниеОбъект = РуководительОтделаПродажСсылка.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "РуководительОтделаПродаж";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
//Евросиб Коханенко Н.А. 11.08.2023 )) #72829
#КонецОбласти 
#Область ОбработчикиПереходаНаВерсию_1_0_0_42
Процедура ЗаполнитьКонстантыГеокодера() Экспорт
	
	Константы.АдресГеокодераЯндекс.Установить("geocode-maps.yandex.ru");
	Константы.КлючAPIГеокодераЯндекс.Установить("62416ac2-82d1-447b-8106-79262aeeca85");
	
КонецПроцедуры
#КонецОбласти

//Евросиб Коханенко Н.А. 16.10.2023 (( #76015 
#Область ОбработчикиПереходаНаВерсию_1_0_0_45
Процедура УстановитьПредопределеннуюГруппуПользователейУправление() Экспорт

	ГруппаПольз = Справочники.ГруппыПользователей.НайтиПоНаименованию("Управление"); 
	Если ГруппаПольз <> Неопределено и ГруппаПольз <> Справочники.ГруппыПользователей.ПустаяСсылка() Тогда
		ОбъектГруппаПольз = ГруппаПольз.ПолучитьОбъект();
		ОбъектГруппаПольз.ИмяПредопределенныхДанных = "Управление";
		ОбъектГруппаПольз.ОбменДанными.Загрузка = Истина;
		ОбъектГруппаПольз.Записать();
	КонецЕсли;	

КонецПроцедуры  
#КонецОбласти  
//Евросиб Коханенко Н.А. 16.10.2023 )) #76015 

#Область ОбработчикиПереходаНаВерсию_1_0_0_46

//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
Процедура ЗаполнитьТипОтветственногоПДЗвРегистре() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомментарииПользователейВОтчетеПДЗ.Договор КАК Договор,
		|	КомментарииПользователейВОтчетеПДЗ.ДатаКомментария КАК ДатаКомментария,
		|	КомментарииПользователейВОтчетеПДЗ.ТипОтветственногоПДЗ КАК ТипОтветственногоПДЗ
		|ИЗ
		|	РегистрСведений.КомментарииПользователейВОтчетеПДЗ КАК КомментарииПользователейВОтчетеПДЗ
		|ГДЕ
		|	КомментарииПользователейВОтчетеПДЗ.ТипОтветственногоПДЗ = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственныхПДЗ.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьРегистра = РегистрыСведений.КомментарииПользователейВОтчетеПДЗ.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Договор = ВыборкаДетальныеЗаписи.Договор;
		ЗаписьРегистра.ДатаКомментария = ВыборкаДетальныеЗаписи.ДатаКомментария;
		ЗаписьРегистра.ТипОтветственногоПДЗ = ВыборкаДетальныеЗаписи.ТипОтветственногоПДЗ;
		ЗаписьРегистра.Прочитать();
		
		ЗаписьРегистра.ТипОтветственногоПДЗ = Перечисления.ТипыОтветственныхПДЗ.Менеджер;
		ЗаписьРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец

#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_48

Процедура СоздатьЭлементыПродуктыДКП() Экспорт
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000011";
	эПродукт.ИмяПредопределенныхДанных	= "АвтономнаяАвтодоставка";
	эПродукт.Наименование 				= "Автономная автодоставка";
	эПродукт.Описание 					= "Перспективный продукт. Подразумевает наличие экспедируемого автотранспорта";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000010";
	эПродукт.ИмяПредопределенныхДанных	= "АвтономныйФрахтШиппинг";
	эПродукт.Наименование 				= "Автономный фрахт (шиппинг)";
	эПродукт.Описание 					= "Максимальный набор услуг: Фрахт; Автодоставка; ТерминальноеТЭО";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000008";
	эПродукт.ИмяПредопределенныхДанных	= "ВыдачаКТКВРынок";
	эПродукт.Наименование 				= "Выдача КТК в рынок";
	эПродукт.Описание 					= "Предоставление КТК";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000003";
	эПродукт.ИмяПредопределенныхДанных	= "МестоВПоезде";
	эПродукт.Наименование 				= "Место в поезде";
	эПродукт.Описание 					= "Контейнерный поезд. Максимальный набор услуг: Выдача/сдача контейнера на терминале (услуга – пользование контейнером); Доставка автотранспортом до двери клиента под погрузку / выгрузку по месту прибытия; Доставка контейнера по ж. д. станция/сух пп – станция/сух. Пп. (ж. д. тариф + предоставление платформы); Терминальное ТЭО";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000001";
	эПродукт.ИмяПредопределенныхДанных	= "ММморской";
	эПродукт.Наименование 				= "ММ морской";
	эПродукт.Описание 					= "ММ перевозка контейнера. Максимальный набор услуг: порт иностранного государства – город РФ – порт иностранного государства";
	эПродукт.Записать(); 
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000002";
	эПродукт.ИмяПредопределенныхДанных	= "ММсухопутный";
	эПродукт.Наименование 				= "ММ сухопутный";
	эПродукт.Описание 					= "ММ перевозка контейнера. Максимальный набор услуг: территория иностранного государства – сухопутная граница с РФ - город РФ или сухопутная граница с РФ – территория иностранного государства";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000006";
	эПродукт.ИмяПредопределенныхДанных	= "ОдиночнаяКонтейнернаяОтправка";
	эПродукт.Наименование 				= "Одиночная контейнерная отправка (КО)";
	эПродукт.Описание 					= "Контейнерная отправка. Максимальный набор услуг: Выдача/сдача контейнера на терминале (услуга – пользование контейнером); Доставка контейнера по ж. д. станция – станция (ж. д. тариф + предоставление платформы)";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000005";
	эПродукт.ИмяПредопределенныхДанных	= "СдачаВагонаВПользование";
	эПродукт.Наименование 				= "Сдача вагона в пользование";
	эПродукт.Описание 					= "Предоставление вагона";
	эПродукт.Записать();
	
	эПродукт = Справочники.ПродуктыДКП.СоздатьЭлемент();
	эПродукт.Код = "000000004";
	эПродукт.ИмяПредопределенныхДанных	= "ЭлектроместоВПоезде";
	эПродукт.Наименование 				= "Электроместо в поезде";
	эПродукт.Описание 					= "Контейнерный поезд (перевозка рефконтейнера). Максимальный набор услуг: Выдача/сдача контейнера на терминале (услуга – пользование контейнером); Доставка автотранспортом до двери клиента под погрузку / выгрузку по месту прибытия; Доставка контейнера по ж. д. станция/сух пп – станция/сух. Пп. (ж. д. тариф + предоставление платформы); Терминальное ТЭО";
	эПродукт.Записать();
	
КонецПроцедуры	

Процедура СоздатьЭлементыСхемыПеревозок() Экспорт

	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("МСК – Сибирь – Приморье – МСК, в т. ч. сухопутный экспорт и транзит на Гродеково") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
		эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент(); 
		
		эСхемыПеревозки.Код	= "000000001";
		эСхемыПеревозки.ИмяПредопределенныхДанных	= "МскСибирьПриморьеМск";
		эСхемыПеревозки.Наименование 				= "МСК – Сибирь – Приморье – МСК, в т. ч. сухопутный экспорт и транзит на Гродеково";
		эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("МСК – Сибирь – Сухие п. п. РФ/Китай (кроме Гродеково ) - МСК") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000002";
	эСхемыПеревозки.Наименование 				= "МСК – Сибирь – Сухие п. п. РФ/Китай (кроме Гродеково ) - МСК";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("МСК/ СЗ – сухие п. п. РФ / Китай – МСК") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000003";
	эСхемыПеревозки.Наименование 				= "МСК - СЗ – сухие п. п. РФ / Китай – МСК";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("МСК – СЗ – Приморье – МСК") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000004";
	эСхемыПеревозки.Наименование 				= "МСК – СЗ – Приморье – МСК";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("Транзит Наушки – Беларусь - Наушки") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000005";
	эСхемыПеревозки.Наименование 				= "Транзит Наушки – Беларусь - Наушки";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("Другое") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000006";
	эСхемыПеревозки.ИмяПредопределенныхДанных	= "Другое";
	эСхемыПеревозки.Наименование 				= "Другое";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("Фиктивный факт") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000007";
	эСхемыПеревозки.Наименование 				= "Фиктивный факт";
	эСхемыПеревозки.Записать();
	КонецЕсли;
	
	Если Справочники.СхемыПеревозки.НайтиПоНаименованию("РФ - Средняя Азия - РФ") = Справочники.СхемыПеревозки.ПустаяСсылка() Тогда
	эСхемыПеревозки = Справочники.СхемыПеревозки.СоздатьЭлемент();
	
	эСхемыПеревозки.Код	= "000000008";
	эСхемыПеревозки.Наименование 				= "РФ - Средняя Азия - РФ";
	эСхемыПеревозки.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура СоздатьЭлементыОтрезкиСхемПеревозок() Экспорт
	
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000001") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000001";
		эОтрезкиСхемПеревозок.Наименование 				= "МСК/СЗ - Сибирь";                     
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000002") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000002";
		эОтрезкиСхемПеревозок.Наименование 				= "Сибирь - Приморье";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000003") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000003";
		эОтрезкиСхемПеревозок.Наименование 				= "Приморье - МСК/СЗ";
		эОтрезкиСхемПеревозок.ИмяПредопределенныхДанных	= "ПриморьеМскСЗ";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000004") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000004";
		эОтрезкиСхемПеревозок.Наименование 				= "МСК/СЗ - Сибирь";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("2", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000005") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000005";
		эОтрезкиСхемПеревозок.Наименование 				= "Сибирь - сухие п/п";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("2", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000006") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000006";
		эОтрезкиСхемПеревозок.Наименование 				= "Сухие п/п - МСК/СЗ";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("2", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000007") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000007";
		эОтрезкиСхемПеревозок.Наименование 				= "МСК/СЗ - Сухие п/п";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("3", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000008") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000008";
		эОтрезкиСхемПеревозок.Наименование 				= "Сухие п/п - МСК/СЗ";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("3", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000009") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000009";
		эОтрезкиСхемПеревозок.Наименование 				= "МСК/СЗ - Приморье";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("4", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000010") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000010";
		эОтрезкиСхемПеревозок.Наименование 				= "Приморье - МСК/СЗ";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("4", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000011") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000011";
		эОтрезкиСхемПеревозок.Наименование 				= "Наушки - Беларусь";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("5", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000012") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000012";
		эОтрезкиСхемПеревозок.Наименование 				= "Беларусь - Наушки";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("5", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000013") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000013";
		эОтрезкиСхемПеревозок.Наименование 				= "Другое ";
		эОтрезкиСхемПеревозок.ИмяПредопределенныхДанных	= "Другое";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("6", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000014") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000014";
		эОтрезкиСхемПеревозок.Наименование 				= "Фиктивный факт";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("7", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000015") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
		эОтрезкиСхемПеревозок.Код	= "000000015";
		эОтрезкиСхемПеревозок.Наименование 				= "РФ - Средняя Азия";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("8", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
	Если Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду("000000016") = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() Тогда
		эОтрезкиСхемПеревозок = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();	
		эОтрезкиСхемПеревозок.Код	= "000000016";
		эОтрезкиСхемПеревозок.Наименование 				= "Средняя Азия - РФ";
		эОтрезкиСхемПеревозок.Схема 					= Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку("8", 9,,));
		эОтрезкиСхемПеревозок.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

// Субботин 75158 Начало 25.09.2023
#Область ОбработчикиПереходаНаВерсию_1_0_0_50
Процедура УстановитьПредопределенныйВидТС() Экспорт
	ВидТС = Справочники.ТипоразмерыТС.НайтиПоКоду("ЦБ5-659-11"); 
	Если ВидТС <> Неопределено и ВидТС <> Справочники.ТипоразмерыТС.ПустаяСсылка() Тогда
		ОбъектВидТС = ВидТС.ПолучитьОбъект();
		ОбъектВидТС.Код = "0000000003";
		ОбъектВидТС.ИмяПредопределенныхДанных = "СудноКонтейнеровоз";
		ОбъектВидТС.ОбменДанными.Загрузка = Истина;
		ОбъектВидТС.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти 
// Субботин 75158 Конец 25.09.2023

#Область ОбработчикиПереходаНаВерсию_1_0_0_52
// ДИТ US 64822 ТА 77071 Сержантова А.С. 22.11.2023
Процедура СостояниеПрикреплениеПодписанногоПСЦвПредопределенные() Экспорт 
	
	СостояниеПрикреплениеПСЦ = Справочники.Состояния.НайтиПоНаименованию("Прикрепить скан-копию подписанного с двух сторон протокола"); 
	Если СостояниеПрикреплениеПСЦ <> Неопределено и СостояниеПрикреплениеПСЦ <> Справочники.Состояния.ПустаяСсылка() Тогда
		СостояниеПрикреплениеПСЦ = СостояниеПрикреплениеПСЦ.ПолучитьОбъект();
		СостояниеПрикреплениеПСЦ.ИмяПредопределенныхДанных = "ПрикрепитьСканКопиюПодписанногоСДвухСторонПротокола";
		СостояниеПрикреплениеПСЦ.ОбменДанными.Загрузка = Истина;
		СостояниеПрикреплениеПСЦ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

// ДИТ US 64822 ТА 77071 Сержантова А.С. 22.11.2023
Процедура СостояниеСогласованиеПрикреплениеПодписанногоПСЦвПредопределенные() Экспорт 
	
	СостояниеПрикреплениеПСЦ = Справочники.Состояния.НайтиПоНаименованию("Проверка согласования, отправка контрагенту и подкрепление подписанной с двух сторон копии ПСЦ"); 
	Если СостояниеПрикреплениеПСЦ <> Неопределено и СостояниеПрикреплениеПСЦ <> Справочники.Состояния.ПустаяСсылка() Тогда
		СостояниеПрикреплениеПСЦ = СостояниеПрикреплениеПСЦ.ПолучитьОбъект();
		СостояниеПрикреплениеПСЦ.ИмяПредопределенныхДанных = "ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ";
		СостояниеПрикреплениеПСЦ.ОбменДанными.Загрузка = Истина;
		СостояниеПрикреплениеПСЦ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

// ДИТ US 64822 ТА 77071 Сержантова А.С. 22.11.2023
Процедура СостояниеПереводВПодписанПСЦвПредопределенные() Экспорт 
	
	СостояниеПрикреплениеПСЦ = Справочники.Состояния.НайтиПоНаименованию("Перевод протокола в ""подписан"""); 
	Если СостояниеПрикреплениеПСЦ <> Неопределено и СостояниеПрикреплениеПСЦ <> Справочники.Состояния.ПустаяСсылка() Тогда
		СостояниеПрикреплениеПСЦ = СостояниеПрикреплениеПСЦ.ПолучитьОбъект();
		СостояниеПрикреплениеПСЦ.ИмяПредопределенныхДанных = "ПереводПротоколаВподписан";
		СостояниеПрикреплениеПСЦ.ОбменДанными.Загрузка = Истина;
		СостояниеПрикреплениеПСЦ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_55

//Евросиб Коханенко Н.А. 28.12.2023 (( #79320 
Процедура СоздатьПредопределенныйЭлементСправочникаЛокацииНеизвестнаяСтанция() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Справочник.Ссылка Из Справочник.Локации КАК Справочник ГДЕ Справочник.КодЖДСтанции = &КодЖДСтанции И Справочник.Наименование = &Наименование");
	Запрос.УстановитьПараметр("КодЖДСтанции", "ОбъектXDTO");
	Запрос.УстановитьПараметр("Наименование", "НЕИЗВЕСТНАЯ СТАНЦИЯ");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НеизвестнаяСтанция = Выборка.Ссылка;
		ОбъектЛокации = НеизвестнаяСтанция.ПолучитьОбъект();
		ОбъектЛокации.ИмяПредопределенныхДанных = "НеизвестнаяСтанция";
		ОбъектЛокации.Записать();
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 28.12.2023 )) #79320

#КонецОбласти 

#КонецОбласти

// Сержантова А.С. US 57674 ТА 79279 25.03.2024
#Область ОбработчикиПереходаНаВерсию_1_0_0_58
Процедура УстановитьПредопределенноеСостояниеУдалениеСчета() Экспорт

	НовоеСостояние = Справочники.Состояния.НайтиПоНаименованию("Удаление счета"); 
	Если НовоеСостояние = Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектНовоеСостояние = Справочники.Состояния.СоздатьЭлемент(); 
		ОбъектНовоеСостояние.Родитель = Справочники.Состояния.СлужебныеСостоянияСчета;
		ОбъектНовоеСостояние.ИмяПредопределенныхДанных	= "УдалениеСчета";
		ОбъектНовоеСостояние.Наименование 				= "Удаление счета";
		ОбъектНовоеСостояние.Записать();
	Иначе
		ОбъектНовоеСостояние = НовоеСостояние.ПолучитьОбъект();
		ОбъектНовоеСостояние.ИмяПредопределенныхДанных	= "УдалениеСчета";
		ОбъектНовоеСостояние.Наименование 				= "УдалениеСчета";
		ОбъектНовоеСостояние.Записать();
	КонецЕсли;

КонецПроцедуры  
#КонецОбласти   

// ДИТ US 81881 ТА 83783 Сержантова А.С. 19.04.2024  
#Область ОбработчикиПереходаНаВерсию_1_0_0_60
Процедура УстановитьПредопределенноеСостояниеОтменаРейса() Экспорт
	
	РодительСостояния = Справочники.Состояния.НайтиПоНаименованию("Состояния запросов на авто", Истина);
	НовоеСостояние = Справочники.Состояния.НайтиПоНаименованию("[отмена рейса] Актуализировать терминал выдачи"); 
	Если НовоеСостояние = Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектНовоеСостояние = Справочники.Состояния.СоздатьЭлемент(); 
	Иначе
		ОбъектНовоеСостояние = НовоеСостояние.ПолучитьОбъект();
	КонецЕсли; 
	ОбъектНовоеСостояние.ИмяПредопределенныхДанных	= "ОтменаРейсаАктуализироватьТерминал";
	ОбъектНовоеСостояние.Наименование 				= "[отмена рейса] Актуализировать терминал выдачи";
	ОбъектНовоеСостояние.Процессное = Истина;
	ОбъектНовоеСостояние.Родитель = РодительСостояния;
	ОбъектНовоеСостояние.Записать();
	
	СостояниеОбновление = Справочники.Состояния.НайтиПоНаименованию("Необходимо обновить данные после изменения Терминала [выдачи/сдачи] в Релизе клиента");
	Если СостояниеОбновление <> Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектСостояниеОбновление = СостояниеОбновление.ПолучитьОбъект();
		ОбъектСостояниеОбновление.Наименование = "Необходимо обновить данные";
	    ОбъектСостояниеОбновление.Записать();
	КонецЕсли;

КонецПроцедуры  
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_67

//Евросиб Коханенко Н.А. 22.07.2024 (( #88035 
Процедура СоздатьПредопределенныйЭлементСправочникаСостоянияЗаполнитьТипИХарактеристикуКлиента() Экспорт
	
	НаименованиеЭлемента = "Заполнить тип и характеристику клиента";
	НайденныйЭлемент = Справочники.Состояния.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьТипИХарактеристикуКлиента";
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 22.07.2024 )) #88035 

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_68
// Сержантова А.С. US 73033 ТА 87495 11.07.2024
Процедура УстановитьПредопределеннуюГруппуПользователейПроизводственнаяДирекция() Экспорт

	ГруппаПольз = Справочники.ГруппыПользователей.НайтиПоНаименованию("Производственная дирекция"); 
	Если ГруппаПольз <> Неопределено и ГруппаПольз <> Справочники.ГруппыПользователей.ПустаяСсылка() Тогда
		ОбъектГруппаПольз = ГруппаПольз.ПолучитьОбъект();
		ОбъектГруппаПольз.ИмяПредопределенныхДанных = "ПроизводственнаяДирекция";
		ОбъектГруппаПольз.ОбменДанными.Загрузка = Истина;
		ОбъектГруппаПольз.Записать();
	КонецЕсли;	

КонецПроцедуры  

Процедура УстановитьПредопределеннуюГруппуПользователейДиректорПоПроизводству() Экспорт

	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Директор по производству"); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДиректорПоПроизводству";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Записать();
	КонецЕсли;	

КонецПроцедуры  
#КонецОбласти   


#Область ОбработчикиПереходаНаВерсию_1_0_0_70
//Евросиб СубботинВ #89533 18.10.2024 Начало 
Процедура СоздатьПредопределеннуюГруппуПользователейДКП() Экспорт 
	
	ГруппаДКП = Справочники.ГруппыПользователей.СоздатьЭлемент();
	ГруппаДКП.ИмяПредопределенныхДанных = "ДирекцияКонтейнерныхПеревозок";
	ГруппаДКП.Наименование = "Дирекция контейнерных перевозок";
	ГруппаДКП.ОбменДанными.Загрузка = Истина;
	ГруппаДКП.Записать();

КонецПроцедуры
//Евросиб СубботинВ #//Евросиб СубботинВ #89533 18.10.2024 Начало  18.10.2024 Конец
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_71
//Евросиб Каблов 18.10.2024 ( 
Процедура ЗаполнитьПротоколОбменовЖДРейсов() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсыЖД.Ссылка КАК Ссылка,
	|	РейсыЖД.УдалитьГУИД_DX КАК УдалитьГУИД_DX 
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|ГДЕ
	|	РейсыЖД.УдалитьГУИД_DX <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(Выборка.УдалитьГУИД_DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры
//Евросиб Каблов 18.10.2024 )
#КонецОбласти   

// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. 12.09.2024
#Область ОбработчикиПереходаНаВерсию_1_0_0_72
Процедура СоздатьСостояниеМорскойРейсУдален() Экспорт
	
	НаименованиеЭлемента = "Выбранный морской рейс был удален";
	НайденныйЭлемент = Справочники.Состояния.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "УдаленМорскойРейс";
	СостояниеОбъект.Записать();
	
КонецПроцедуры 
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_73
// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. 31.10.2024
Процедура ОбработатьЗаписьДанныхРейсовИИзменениеНаименованийУслуг() Экспорт

	//ОбновитьЗаписиМорскихРейсовВРегистре();
	ОбработатьОписаниеУслуг();

КонецПроцедуры 

Процедура ОбновитьЗаписиМорскихРейсовВРегистре()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыМоре.ПунктОтправления КАК МестоПогрузки,
		|	РейсыМоре.ПунктНазначения КАК МестоРазгрузки,
		|	РейсыМоре.МестоПогрузки КАК ПунктОтправления,
		|	РейсыМоре.МестоРазгрузки КАК ПунктНазначения,
		|	РейсыМоре.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РейсыМоре КАК РейсыМоре
		|ГДЕ
		|	(РейсыМоре.МестоПогрузки.Тип = &ТипПорт
		|			ИЛИ РейсыМоре.МестоРазгрузки.Тип = &ТипПорт)
		|	И (РейсыМоре.ПунктОтправления.Тип = &ТипТерминал
		|			ИЛИ РейсыМоре.ПунктНазначения.Тип = &ТипТерминал)
		|	И РейсыМоре.ДатаОтправления >= ДАТАВРЕМЯ(2024, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ТипПорт", Справочники.ТипыЛокаций.Порт);
	Запрос.УстановитьПараметр("ТипТерминал", Справочники.ТипыЛокаций.Терминал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РейсОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(РейсОбъект, Выборка);
		РейсОбъект.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыМоре.Ссылка КАК Ссылка,
		|	РейсыМоре.ПунктОтправления КАК ПунктОтправления,
		|	РейсыМоре.ПунктНазначения КАК ПунктНазначения,
		|	РейсыМоре.МестоПогрузки КАК МестоПогрузки,
		|	РейсыМоре.МестоРазгрузки КАК МестоРазгрузки,
		|	РейсыМоре.ДатаОтправления КАК ДатаОтправления,
		|	РейсыМоре.ДатаПрибытия КАК ДатаПрибытия
		|ИЗ
		|	Справочник.РейсыМоре КАК РейсыМоре
		|ГДЕ
		|	НЕ РейсыМоре.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоЗаписей = 0;
	Пока Выборка.Следующий() Цикл
		ДобавитьОбновитьЗаписьДанныхМорскогоРейса(Выборка, КоличествоЗаписей);
	КонецЦикла;    
	
	СообщениеИнформации = "Добавлено " + КоличествоЗаписей + " записей в РС по данным морских рейсов";
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОбновлениеНаВерсию", УровеньЖурналаРегистрации.Информация, ,"",СообщениеИнформации);

КонецПроцедуры   

Процедура ДобавитьОбновитьЗаписьДанныхМорскогоРейса(ДанныеРейса, КоличествоЗаписей)
	
    НаборЗаписей = РегистрыСведений.УдалитьДанныеМорскихРейсов.СоздатьНаборЗаписей();   
	НаборЗаписей.Отбор.МорскойРейс.Установить(ДанныеРейса.Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Если Запись.ДанныеОтличаютсяОтДанныхРейса Тогда
			Возврат;
		КонецЕсли;
	Иначе	
	    Запись = НаборЗаписей.Добавить();
	КонецЕсли; 
	
	Запись.МорскойРейс					= ДанныеРейса.Ссылка;
	Запись.ПортОтправления				= ДанныеРейса.ПунктОтправления;
	Запись.МорскойТерминалОтправления 	= ДанныеРейса.МестоПогрузки;
	Запись.ДатаОтправления 				= ДанныеРейса.ДатаОтправления;
	Запись.ПортНазначения 				= ДанныеРейса.ПунктНазначения;
	Запись.МорскойТерминалНазначения 	= ДанныеРейса.МестоРазгрузки;
	Запись.ДатаПрибытия 				= ДанныеРейса.ДатаПрибытия;   
	
	НаборЗаписей.Записать();  
	КоличествоЗаписей = КоличествоЗаписей + 1;
	
КонецПроцедуры

Процедура ОбработатьОписаниеУслуг()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФормированиеФинДокументов.ТекстАвансовогоСчета КАК ТекстАвансовогоСчета,
		|	ФормированиеФинДокументов.ТекстРеализацииИИСФ КАК ТекстРеализацииИИСФ,
		|	ФормированиеФинДокументов.ТекстАвансовогоСчетаФрахт КАК ТекстАвансовогоСчетаФрахт,
		|	ФормированиеФинДокументов.ТекстРеализацииИИСФФрахт КАК ТекстРеализацииИИСФФрахт,
		|	ФормированиеФинДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		|ГДЕ
		|	(ФормированиеФинДокументов.ТекстАвансовогоСчета <> """"
		|			ИЛИ ФормированиеФинДокументов.ТекстРеализацииИИСФ <> """"
		|			ИЛИ ФормированиеФинДокументов.ТекстАвансовогоСчетаФрахт <> """"
		|			ИЛИ ФормированиеФинДокументов.ТекстРеализацииИИСФФрахт <> """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	КоличествоЗаписанныхПравил = 0;
	Пока Выборка.Следующий() Цикл 
		НужноПереформироватьТекст = Ложь;
		Если СтрНайти(Выборка.ТекстАвансовогоСчета, "##Пункт_ОтправленияКСENG") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчета, "##Пункт_НазначенияКСENG") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчета, "##ПунктОтправленияКС") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчета, "##ПунктНазначенияКС") <> 0 
			
			или СтрНайти(Выборка.ТекстРеализацииИИСФ, "##Пункт_ОтправленияКСENG") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФ, "##Пункт_НазначенияКСENG") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФ, "##ПунктОтправленияКС") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФ, "##ПунктНазначенияКС") <> 0
			
			или СтрНайти(Выборка.ТекстАвансовогоСчетаФрахт, "##Пункт_ОтправленияКСENG") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчетаФрахт, "##Пункт_НазначенияКСENG") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчетаФрахт, "##ПунктОтправленияКС") <> 0
			или СтрНайти(Выборка.ТекстАвансовогоСчетаФрахт, "##ПунктНазначенияКС") <> 0 
			
			или СтрНайти(Выборка.ТекстРеализацииИИСФФрахт, "##Пункт_ОтправленияКСENG") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФФрахт, "##Пункт_НазначенияКСENG") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФФрахт, "##ПунктОтправленияКС") <> 0
			или СтрНайти(Выборка.ТекстРеализацииИИСФФрахт, "##ПунктНазначенияКС") <> 0 Тогда    
			
		    НужноПереформироватьТекст = Истина; 
			
		КонецЕсли;	
		
		Если НужноПереформироватьТекст Тогда
			ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ОбработатьТексты(ПравилоОбъект.ТекстАвансовогоСчета);
		    ОбработатьТексты(ПравилоОбъект.ТекстРеализацииИИСФ);
			ОбработатьТексты(ПравилоОбъект.ТекстАвансовогоСчетаФрахт);
			ОбработатьТексты(ПравилоОбъект.ТекстРеализацииИИСФФрахт); 
			Попытка
			    ПравилоОбъект.Записать();
				КоличествоЗаписанныхПравил = КоличествоЗаписанныхПравил + 1;
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОбновлениеНаВерсию", УровеньЖурналаРегистрации.Ошибка, ,Выборка.Ссылка,"Не удалось изменить наименование услуг");
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;   
	
	СообщениеИнформации = "Обработано " + КоличествоЗаписанныхПравил + " правил формирования клиентских документов - изменены наименования услуг";
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОбновлениеНаВерсию", УровеньЖурналаРегистрации.Информация, ,"",СообщениеИнформации);
	
КонецПроцедуры    

Процедура ОбработатьТексты(ИзменяемыйТекст)

	ИзменяемыйТекст = СтрЗаменить(ИзменяемыйТекст, "##Пункт_ОтправленияКСENG", "##ПортОтправленияКСENG (##МорскойТерминалОтправленияКСENG)");	  
	ИзменяемыйТекст = СтрЗаменить(ИзменяемыйТекст, "##Пункт_НазначенияКСENG", "##ПортНазначенияКСENG (##МорскойТерминалНазначенияКСENG)");
	ИзменяемыйТекст = СтрЗаменить(ИзменяемыйТекст, "##ПунктОтправленияКС", "##ПортОтправленияКС (##МорскойТерминалОтправленияКС)");
	ИзменяемыйТекст = СтрЗаменить(ИзменяемыйТекст, "##ПунктНазначенияКС", "##ПортНазначенияКС (##МорскойТерминалНазначенияКС)");
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_74
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Процедура ЗаполнитьНастройкиГруппДКС() Экспорт
	
	Константы.ДатаНачалаПроверкиЗаполненияГруппыДКС.Установить(ТекущаяДата());
	
	ПолныеНаименования = Новый Структура;
	ПолныеНаименования.Вставить("Море", "Группа по работе с морскими клиентами (транзит, экспорт)");
	ПолныеНаименования.Вставить("Сухопут", "Группа по работе с сухопутными клиентами (импорт, транзит, экспорт)");
	ПолныеНаименования.Вставить("ДВ", "Дальний Восток (офис Дальний Восток)");
	ПолныеНаименования.Вставить("ММ", "Мультимодальные перевозки (отдел)");
	ПолныеНаименования.Вставить("НСК", "Новосибирск (офис Новосибирск для ДКП)");
	ПолныеНаименования.Вставить("ВРП", "Отдел по работе с внутрироссийскими клиентами");
	ПолныеНаименования.Вставить("ВЭД", "Отдел развития внешнеэкономической деятельности");
	ПолныеНаименования.Вставить("ДМС", "Перевозки Департамента по производству мультимодальных сервисов (доплаты, субсидии, выдача КТК в рынок)");
	ПолныеНаименования.Вставить("ЕКЗХ", "Перевозки Евросиб - Казахстан");
	ПолныеНаименования.Вставить("Рефы", "Рефрижераторные перевозки");
	
	Для Каждого ТекНаименование Из ПолныеНаименования Цикл
		
		Попытка
			ГруппаДКС = Справочники.ГруппыДКС[ТекНаименование.Ключ];
			ОбоъектГруппаДКС = ГруппаДКС.ПолучитьОбъект();
			ОбоъектГруппаДКС.ПолноеНаименование = ТекНаименование.Значение;
			ОбоъектГруппаДКС.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_75
//Евросиб Коханенко Н.А. 22.11.2024 (( #92915 
Процедура СоздатьПредопределенныеЭлементыСправочникаЭлементыПечатнойФормыПротокола() Экспорт
	
	НаименованиеЭлемента = "Таблица Контактные данные";
	НайденныйЭлемент = Справочники.ЭлементыПечатнойФормыПротокола.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ЭлементыПечатнойФормыПротокола.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ТаблицаКонтактныеДанные";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

	НаименованиеЭлемента = "Таблица Договорная Цена ЖД";
	НайденныйЭлемент = Справочники.ЭлементыПечатнойФормыПротокола.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ЭлементыПечатнойФормыПротокола.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ТаблицаДоговорнаяЦенаЖД";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 22.11.2024 )) #92915
#КонецОбласти    

#Область ОбработчикиПереходаНаВерсию_1_0_0_76
//Евросиб Каблов 29.11.2024 #89891
Процедура СоздатьПредопределенныйВидПеревозкиМеждународная() Экспорт

	НаименованиеЭлемента = "Международная";
	СправочникМенеджер = Справочники.ВидыПеревозок;
	НайденныйЭлемент = СправочникМенеджер.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		ЭлементОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		ЭлементОбъект = СправочникМенеджер.СоздатьЭлемент();
		ЭлементОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	ЭлементОбъект.ИмяПредопределенныхДанных = "Международная";                          
	ЭлементОбъект.ОбменДанными.Загрузка = Истина;
	ЭлементОбъект.Записать();
	
	НаименованиеЭлемента = "АрендаКонтейнеров";
	СправочникМенеджер = Справочники.Номенклатура;
	НайденныйЭлемент = СправочникМенеджер.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		ЭлементОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		ЭлементОбъект = СправочникМенеджер.СоздатьЭлемент();
		ЭлементОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	ЭлементОбъект.ИмяПредопределенныхДанных = НаименованиеЭлемента;                          
	ЭлементОбъект.ОбменДанными.Загрузка = Истина;
	ЭлементОбъект.Записать();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_77
//Евросиб Каблов 25.12.2024 #89872
Процедура ЗагрузитьВидыУслугПоставщиков() Экспорт
	
	Попытка
				
		ДвоичныеДанные = ПолучитьОбщийМакет("ВидыУслугПоставщиков");
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);		
		
		ОбработкаЗагрузки = Обработки.ВыгрузкаЗагрузкаДанныхXML.Создать();
		ОбработкаЗагрузки.ВыполнитьЗагрузку(ИмяВременногоФайла);		
			
		Файл = Новый Файл(ИмяВременногоФайла);
		
		Если Файл.Существует() Тогда			
			УдалитьФайлы(ИмяВременногоФайла);			
		КонецЕсли;			
	
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОбновлениеНаВерсию", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВидыУслугПоставщиков, "", "Не удалось загрузить Виды услуг поставщиков: " + ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_78
//Евросиб Каблов 25.12.2024 #99155
Процедура ЗаполнитьПолноеНаименованиеМультилокаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мультилокации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Мультилокации КАК Мультилокации";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МультОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Запрос = Новый Запрос;
		МассивЛокаций = МультОбъект.Локации.ВыгрузитьКолонку("Локация");
		Запрос.УстановитьПараметр("МассивЛокаций", МассивЛокаций);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Локации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Ссылка В(&МассивЛокаций)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Локации.Код";
		
		ТаблицаЛокаций = Запрос.Выполнить().Выгрузить();
		НаименованияЛокаций = ТаблицаЛокаций.ВыгрузитьКолонку("Наименование");
		МультОбъект.НаименованиеПолное = СтрСоединить(НаименованияЛокаций, "; ");
		//Наименование = НаименованиеПолное;
		
		МультОбъект.ОбменДанными.Загрузка = Истина;
		МультОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_79
//Евросиб Коханенко Н.А. 17.09.2024 (( #91409 
Процедура СоздатьПредопределенныйЭлементСправочникаИсточникиПакетовДанныхПолучениеДанныхОСреднейМиле() Экспорт
	
	НаименованиеЭлемента = "Получение данных о средней миле";
	НайденныйЭлемент = Справочники.ИсточникиПакетовДанных.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ИсточникиПакетовДанных.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ПолучениеДанныхОСреднейМиле";
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 17.09.2024 )) #91409
#КонецОбласти

// ++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
Процедура ЗаполнитьКонстантыРефСцепов() Экспорт
	Константы.КодыОперацийСВагономСПризнакомНеисправен.Установить("452,053");
	Константы.МаршрутизироватьРефСцеп.Установить(Истина);
	Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Установить(Справочники.Контрагенты.НайтиПоКоду("Y0000OZ1"));
	
	ГруппаРуководителейРефСцепов = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель группы рефрижераторных перевозок");
	Если ЗначениеЗаполнено(ГруппаРуководителейРефСцепов) Тогда
		ГруппаРуководителейРефСцеповОбъект = ГруппаРуководителейРефСцепов.ПолучитьОбъект();
		ГруппаРуководителейРефСцеповОбъект.ИмяПредопределенныхДанных = "РуководительГруппыРефрижераторныхПеревозок";
		ГруппаРуководителейРефСцеповОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаРуководителейРефСцеповОбъект.Записать();
	Иначе
		ГруппаРуководителейРефСцеповОбъект = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаРуководителейРефСцеповОбъект.ИмяПредопределенныхДанных = "РуководительГруппыРефрижераторныхПеревозок";
		ГруппаРуководителейРефСцеповОбъект.Наименование = "Руководитель группы рефрижераторных перевозок";
		ГруппаРуководителейРефСцеповОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаРуководителейРефСцеповОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры 
Процедура ОбновитьКонтактнуюИнформациюДляЛокаций() Экспорт
	ГруппаКонтактнойИнформации     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформации.Имя = "СправочникЛокации";
    ГруппаКонтактнойИнформации.Наименование = НСтр("ru='Контактная информация справочника ""Локации""'");
    
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);
    
    Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефоныЛокации";
	Вид.Наименование = "Телефоны";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
	Вид.РазрешитьВводНесколькихЗначений = Истина;
	Вид.Используется = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);	
КонецПроцедуры

Процедура ОбновитьОперацииСВагонамиДобавитьЛокацию() Экспорт
	ЭлОперацииСВагонами = Справочники.ОперацииСВагонами.НайтиПоНаименованию("ОКОНЧАНИЕ ОПЕРАЦИИ ПОГРУЗКИ");
	Если ЗначениеЗаполнено(ЭлОперацииСВагонами) Тогда
		ОбОперацииСВагонами = ЭлОперацииСВагонами.ПолучитьОбъект();
		ОбОперацииСВагонами.ИмяПредопределенныхДанных = "ОкончаниеОперацииПогрузки";
		ОбОперацииСВагонами.ОбменДанными.Загрузка = Истина;
		ОбОперацииСВагонами.Записать();
	КонецЕсли;
	ЭлОперацииСВагонами = Справочники.ОперацииСВагонами.НайтиПоНаименованию("ОКОНЧАНИЕ ОПЕРАЦИИ ВЫГРУЗКИ");
	Если ЗначениеЗаполнено(ЭлОперацииСВагонами) Тогда
		ОбОперацииСВагонами = ЭлОперацииСВагонами.ПолучитьОбъект();
		ОбОперацииСВагонами.ИмяПредопределенныхДанных = "ОкончаниеОперацииВыгрузки";
		ОбОперацииСВагонами.ОбменДанными.Загрузка = Истина;
		ОбОперацииСВагонами.Записать();
	КонецЕсли;
	
	НоваяЛокация = Справочники.Локации.СоздатьЭлемент();
	НоваяЛокация.Наименование = "Склад клиента";
	НоваяЛокация.ИмяПредопределенныхДанных = "СкладКлиента";
	НоваяЛокация.Родитель = Справочники.Локации.НайтиПоНаименованию("РОССИЯ");
	НоваяЛокация.Тип      = Справочники.ТипыЛокаций.Терминал;
	НоваяЛокация.Страна   = Справочники.СтраныМира.Россия;
	НоваяЛокация.ОбменДанными.Загрузка = Истина;
	НоваяЛокация.Записать();
КонецПроцедуры

//ДИТ Шевченко А.В. 59965 25.11.2022 -Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияПоЗапросуНаАвтоперевозкуПередатьКлиентуДанные() Экспорт
	
	СостоянияПустаяСсылка = Справочники.Состояния.ПустаяСсылка();
		
	Если Справочники.Состояния.НайтиПоНаименованию("Передать клиенту данные по автоперевозке") = СостоянияПустаяСсылка Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.Процессное = Истина;
		СостояниеОбъект.Наименование = "Передать клиенту данные по автоперевозке";
		СостояниеОбъект.ИмяПредопределенныхДанных = "ПередатьКлиентуДанныеПоАвтоперевозке";
		СостояниеОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредопределитьЭлементыСтатусыЗаявокСибур() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СибурСтатусыЗаявок.Наименование КАК Наименование,
		|	СибурСтатусыЗаявок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СибурСтатусыЗаявок КАК СибурСтатусыЗаявок
		|ГДЕ
		|	СибурСтатусыЗаявок.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокСибура.ЗаявкаЖД)
		|	И НЕ СибурСтатусыЗаявок.ВнешнийСтатус";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Наименование = "Подтверждено" Тогда
			СпрОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрОб.ИмяПредопределенныхДанных = "Подтверждено";
			СпрОб.Записать();
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.Наименование = "Подтверждено с условием" Тогда
			СпрОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрОб.ИмяПредопределенныхДанных = "ПодтвержденоСУсловием";
			СпрОб.Записать();
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.Наименование = "Изменено после согл." Тогда
			СпрОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрОб.ИмяПредопределенныхДанных = "ИзмененоПослеСогл";
			СпрОб.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиПереходаНаВерсию_1_0_0_57

//Евросиб Коханенко Н.А. 26.02.2024 (( #80981
Процедура ЗаполнитьЛокациюВышестоящегоУровняВСправочникеАдресаВНаселенныхПунктах() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ЛокацияВышестоящегоУровня = ЭлементОбъект.Владелец.ЛокацияВышестоящегоУровня;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 26.02.2024 )) #80981

#КонецОбласти 
// -- Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  

#Область ОбработчикиПереходаНаВерсию_1_0_0_6

//Евросиб Каблов 20.12.2020
Процедура ЗаполнениеПризнаковПоставщикКлиентКонтрагентовСервисаДиадок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.КонтрагентСервиса КАК КонтрагентСервиса,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ВложенныйЗапрос.Контрагент.ТипКонтрагента_Подрядчик, ЛОЖЬ) КАК Поставщик,
		|	ЕСТЬNULL(ВложенныйЗапрос.Контрагент.ТипКонтрагента_Клиент, ЛОЖЬ) КАК Клиент
		|ИЗ
		|	(ВЫБРАТЬ
		|		Диадок_ЮрФизЛица.Ссылка КАК КонтрагентСервиса,
		|		Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК Контрагент
		|	ИЗ
		|		Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|	ГДЕ
		|		Диадок_ЮрФизЛица.СвязанныйСправочник1 ССЫЛКА Справочник.Контрагенты) КАК ВложенныйЗапрос
		|ГДЕ
		|	(ЕСТЬNULL(ВложенныйЗапрос.Контрагент.ТипКонтрагента_Подрядчик, ЛОЖЬ)
		|			ИЛИ ЕСТЬNULL(ВложенныйЗапрос.Контрагент.ТипКонтрагента_Клиент, ЛОЖЬ))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтрагентДиадокОбъект = Выборка.КонтрагентСервиса.ПолучитьОбъект();
		КонтрагентДиадокОбъект.Клиент = Выборка.Клиент;
		КонтрагентДиадокОбъект.Поставщик = Выборка.Поставщик;
		КонтрагентДиадокОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 17.02.2021
Процедура ОбновитьПредопределенногоКонтрагентаРЖД() Экспорт
	
	КонтрагентРЖД = Справочники.Контрагенты.НайтиПоКоду("Y00000гж");
	Если ЗначениеЗаполнено(КонтрагентРЖД) Тогда
		КонтрагентОбъект = КонтрагентРЖД.ПолучитьОбъект();
		КонтрагентОбъект.ИмяПредопределенныхДанных = "РЖД";
		КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
		КонтрагентОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЭлементаНоменклатурыПретензии() Экспорт
	
	ПретензииОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	ПретензииОбъект.Наименование = "Претензии";
	ПретензииОбъект.ИмяПредопределенныхДанных = "Претензии";
	ПретензииОбъект.Записать();
	
	Запись = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
	Запись.Объект = Справочники.Номенклатура.Претензии;
	Запись.УИДИсточника = "10000000008";
	Запись.УзелОбмена = Перечисления.УзлыОбмена.УПП;
	Запись.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_15
//ДИТ Шевченко А.В. TASK 53546 01.08.2022 -Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаОбщиеПоказатели() Экспорт
	
	ОбщиеПоказатели = Справочники.э_ОбщиеПоказатели.НайтиПоНаименованию("Досылочная накладная");
	Если ЗначениеЗаполнено(ОбщиеПоказатели) Тогда
		ОбОбщиеПоказатели = ОбщиеПоказатели.ПолучитьОбъект();
		ОбОбщиеПоказатели.ИмяПредопределенныхДанных = "ДосылочнаяНакладная";
		ОбОбщиеПоказатели.ОбменДанными.Загрузка = Истина;
		ОбОбщиеПоказатели.Записать();
	КонецЕсли;
	
КонецПроцедуры
//ДИТ Шевченко А.В. TASK 53546 01.08.2022 -Конец

// ++ ДИТ_Агафонов_task 50388 08.07.2022
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияДляРелизаСобственника() Экспорт
	
	Группа_СлужебныеСостоянияРелизаСобственника = Справочники.Состояния.НайтиПоНаименованию("Служебные состояния релиза собственника");
	Если Не ЗначениеЗаполнено(Группа_СлужебныеСостоянияРелизаСобственника) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьГруппу();
		СостояниеОбъект.Наименование = "Служебные состояния релиза собственника";
		СостояниеОбъект.ИмяПредопределенныхДанных = "СлужебныеСостоянияРелизаСобственника";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
		Группа_СлужебныеСостоянияРелизаСобственника = СостояниеОбъект.Ссылка;
	ИначеЕсли Не Группа_СлужебныеСостоянияРелизаСобственника.ИмяПредопределенныхДанных = "СлужебныеСостоянияРелизаСобственника" Тогда
		СостояниеОбъект = Группа_СлужебныеСостоянияРелизаСобственника.ПолучитьОбъект();	
		СостояниеОбъект.ИмяПредопределенныхДанных = "СлужебныеСостоянияРелизаСобственника";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
	
	КорректировкаКоличестваКТК = Справочники.Состояния.НайтиПоНаименованию("Корректировка количества КТК и связанных док-тов (при необходимости)");
	Если Не ЗначениеЗаполнено(КорректировкаКоличестваКТК) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "КорректировкаКоличестваКТК";
		СостояниеОбъект.Родитель = Группа_СлужебныеСостоянияРелизаСобственника;
		СостояниеОбъект.Наименование = "Корректировка количества КТК и связанных док-тов (при необходимости)";
		СостояниеОбъект.Процессное = Истина;
		//СостояниеОбъект.Согласование = Истина;
		//СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ВсегдаПерезапускать;
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не КорректировкаКоличестваКТК.ИмяПредопределенныхДанных = "КорректировкаКоличестваКТК" Тогда
			СостояниеОбъект = КорректировкаКоличестваКТК.ПолучитьОбъект();
			СостояниеОбъект.ИмяПредопределенныхДанных = "КорректировкаКоличестваКТК";
			СостояниеОбъект.Родитель = Группа_СлужебныеСостоянияРелизаСобственника;
			СостояниеОбъект.ОбменДанными.Загрузка = Истина;
			СостояниеОбъект.Записать();
	КонецЕсли;
	
	КорректировкаТипоразмераКТК = Справочники.Состояния.НайтиПоНаименованию("Корректировка типоразмера КТК");
	Если Не ЗначениеЗаполнено(КорректировкаТипоразмераКТК) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "КорректировкаТипоразмераКТК";
		СостояниеОбъект.Родитель = Группа_СлужебныеСостоянияРелизаСобственника;
		СостояниеОбъект.Наименование = "Корректировка типоразмера КТК";
		СостояниеОбъект.Процессное = Истина;
		//СостояниеОбъект.Согласование = Истина;
		//СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ВсегдаПерезапускать;
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не КорректировкаТипоразмераКТК.ИмяПредопределенныхДанных = "КорректировкаТипоразмераКТК" Тогда
			СостояниеОбъект = КорректировкаТипоразмераКТК.ПолучитьОбъект();
			СостояниеОбъект.ИмяПредопределенныхДанных = "КорректировкаТипоразмераКТК";
			СостояниеОбъект.Родитель = Группа_СлужебныеСостоянияРелизаСобственника;
			СостояниеОбъект.ОбменДанными.Загрузка = Истина;
			СостояниеОбъект.Записать();
	КонецЕсли;
		
КонецПроцедуры
// -- ДИТ_Агафонов_task 50388 08.07.2022

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_17
Процедура СоздатьШаблоныКлючейАналитикиСтрокКалькуляции() Экспорт 
	
	Константы.ОтвязыватьАкцептыОтОтключенныхСтрок.Установить(Истина);
	
	Ключ = Справочники.КлючиАналитикиСтрокКалькуляции.СоздатьЭлемент();
	Ключ.РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияМультимодальнойЦепочки;
	Ключ.ИспользуетсяКакШаблон = Истина;
	КлючевыеПоля = Ключ.КлючевыеПоля;
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "Услуга";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ВнутренняяСебестоимость";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ПунктОтправления.Родитель";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ПунктНазначения.Родитель";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ГруппаУслуг";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ОсновнаяУслугаГруппы";
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "ПодсылПорожних";
	КлючевоеПоле.ИмяПоляСделка = "Подсыл";
	Ключ.Записать();
	
	Ключ = Справочники.КлючиАналитикиСтрокКалькуляции.СоздатьЭлемент();
	Ключ.РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияУслугВнеСтавки;
	Ключ.ИспользуетсяКакШаблон = Истина;
	КлючевыеПоля = Ключ.КлючевыеПоля;
	КлючевоеПоле = КлючевыеПоля.Добавить();
	КлючевоеПоле.ИмяПоля = "Услуга";
	Ключ.Записать();
КонецПроцедуры	

Процедура ЗаполнитьКлючиАналитикиВКалькуляциях() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Калькуляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	(Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.КлючАналитикиСтрокиКалькуляции = &ПустойКлюч
	|			ИЛИ Калькуляция.ЖД_УслугиВнеСтавки.КлючАналитикиСтрокиКалькуляции = &ПустойКлюч)";
	Запрос.УстановитьПараметр("ПустойКлюч", Справочники.КлючиАналитикиСтрокКалькуляции.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		обКалькуляция = Выборка.Ссылка.ПолучитьОбъект();
		обКалькуляция.ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияМультимодальнойЦепочки);
		обКалькуляция.ЗаполнитьКлючиАналитикиСтрокКалькуляции(Перечисления.РазделыКалькуляции.КалькуляцияУслугВнеСтавки);
		Попытка
			обКалькуляция.ОбменДанными.Загрузка = Истина;
			обКалькуляция.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_18
Процедура ДобавитьПредопределенныеЭлементыСправочникаВидыПеревозок() Экспорт
	ВидыПеревозокПустаяСсылка = Справочники.ВидыПеревозок.ПустаяСсылка();
	
	Если Справочники.ВидыПеревозок.НайтиПоНаименованию("Вне территории РФ") = ВидыПеревозокПустаяСсылка Тогда
		ВидыПеревозокОбъект = Справочники.ВидыПеревозок.СоздатьЭлемент();
		ВидыПеревозокОбъект.Наименование = "Вне территории РФ";
		ВидыПеревозокОбъект.ИмяПредопределенныхДанных = "ВнеТерриторииРФ";
		ВидыПеревозокОбъект.Записать();
	КонецЕсли;	
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_21
Процедура ВыполнитьПереносАвтоперевозчиковНаСервере() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаАвтоперевозчики.Ссылка КАК Заявка,
		|	ЗаявкаАвтоперевозчики.Перевозчик КАК Автоперевозчик,
		|	ЗаявкаАвтоперевозчики.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
		|	ЗаявкаАвтоперевозчики.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.Заявка.УдалитьАвтоперевозчики КАК ЗаявкаАвтоперевозчики
		|ГДЕ
		|	НЕ ЗаявкаАвтоперевозчики.Ссылка.ПометкаУдаления
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ЗаявкаОб = ВыборкаСсылка.Заявка.ПолучитьОбъект();
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЗаявкаОб.ТранспортныеСредства.Добавить(),ВыборкаДетальныеЗаписи);
		КонецЦикла;
		ЗаявкаОб.ОбменДанными.Загрузка = ИСТИНА;
		ЗаявкаОб.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаАвтоперевозчики.Ссылка КАК Заявка,
		|	ЗаявкаАвтоперевозчики.Перевозчик КАК Автоперевозчик,
		|	ЗаявкаАвтоперевозчики.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
		|	ЗаявкаАвтоперевозчики.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.Заявка.УдалитьАвтоперевозчикиПоследняяМиля КАК ЗаявкаАвтоперевозчики
		|ГДЕ
		|	НЕ ЗаявкаАвтоперевозчики.Ссылка.ПометкаУдаления
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ЗаявкаОб = ВыборкаСсылка.Заявка.ПолучитьОбъект();
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЗаявкаОб.ТранспортныеСредстваПоследняяМиля.Добавить(),ВыборкаДетальныеЗаписи);
		КонецЦикла;
		ЗаявкаОб.ОбменДанными.Загрузка = ИСТИНА;
		ЗаявкаОб.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизКлиента.Ссылка КАК Релиз,
		|	РелизКлиента.Перевозчик КАК Автоперевозчик,
		|	РелизКлиента.ИНН КАК ИНН,
		|	РелизКлиента.КПП КАК КПП,
		|	РелизКлиента.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.РелизКлиента.УдалитьАвтоперевозчики КАК РелизКлиента
		|ГДЕ
		|	НЕ РелизКлиента.Ссылка.ПометкаУдаления
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		РелизОб = ВыборкаСсылка.Релиз.ПолучитьОбъект();
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(РелизОб.ТранспортныеСредства.Добавить(),ВыборкаДетальныеЗаписи);
		КонецЦикла;
		РелизОб.ОбменДанными.Загрузка = ИСТИНА;
		РелизОб.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизКлиента.Ссылка КАК Релиз,
		|	РелизКлиента.Перевозчик КАК Автоперевозчик,
		|	РелизКлиента.ИНН КАК ИНН,
		|	РелизКлиента.КПП КАК КПП,
		|	РелизКлиента.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.РелизКлиента.УдалитьАвтоперевозчикиПоследняяМиля КАК РелизКлиента
		|ГДЕ
		|	НЕ РелизКлиента.Ссылка.ПометкаУдаления
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		РелизОб = ВыборкаСсылка.Релиз.ПолучитьОбъект();
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(РелизОб.ТранспортныеСредстваПоследняяМиля.Добавить(),ВыборкаДетальныеЗаписи);
		КонецЦикла;
		РелизОб.ОбменДанными.Загрузка = ИСТИНА;
		РелизОб.Записать();
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_22
//ДИТ Авдеева В.С. 52214 Начало 28.09.2022
Процедура СоздатьДопРеквизитГруппаОРК() Экспорт   

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка


	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведений.Наименование = &Наименование
	|	И НЕ НаборыДополнительныхРеквизитовИСведений.Предопределенный"; 
	
	Запрос.УстановитьПараметр("Наименование", "Пользователи");

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();       
		
		Пока Выборка.Следующий() Цикл
		
			ДопРеквизитОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			ДопРеквизитОбъект.Заголовок = "Группа ОРК";
			ДопРеквизитОбъект.НаборСвойств = Выборка.Ссылка;
			ДопРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов");
			ДопРеквизитОбъект.Наименование = ДопРеквизитОбъект.Заголовок + " ("+ДопРеквизитОбъект.НаборСвойств+")";
			ДопРеквизитОбъект.Виден = Истина;
			ДопРеквизитОбъект.Доступен = Истина;
			ДопРеквизитОбъект.ДополнительныеЗначенияИспользуются = Истина;
			ДопРеквизитОбъект.Имя = "ГруппаОРК";
			ДопРеквизитОбъект.Записать();
			ДопРеквизитСсылка = ДопРеквизитОбъект.Ссылка;		
			
			НаборДополнительныхРеквизитовПользователи = Выборка.Ссылка.ПолучитьОбъект();
			Если НаборДополнительныхРеквизитовПользователи.ДополнительныеРеквизиты.Найти(ДопРеквизитСсылка, "Свойство") = Неопределено Тогда
				Стр = НаборДополнительныхРеквизитовПользователи.ДополнительныеРеквизиты.Добавить();
				Стр.Свойство = ДопРеквизитСсылка;
				НаборДополнительныхРеквизитовПользователи.Записать();
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ДИТ Авдеева В.С. 52214 Конец 28.09.2022
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_28
Процедура ОбновитьДанныеВидовЖДН() Экспорт

	Выборка = Справочники.ВидыЖДН.Выбрать();
	Пока Выборка.Следующий() Цикл
		обВидЖДН = Выборка.ПолучитьОбъект();       
		//Груженая ЖДН
		//Груженая ЖДН порожний КТК
		//ЖДН перестановки до груж. КТК
		//ЖДН после груж. (вагон)
		//Порожняя ЖДН (ваг)
		Если обВидЖДН.Ссылка = Справочники.ВидыЖДН.ГруженаяЖДН 
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ГруженаяЖДН_ПорожнийКТК
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ЖДН_ПерестановкиДоГружКТК
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ЖДН_ПослеГружВагон
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ПорожняяЖДН_Ваг
			Тогда
			обВидЖДН.ИмяРеквизитаВагонВСоставеПоезда = "Вагон";
		КонецЕсли;
		//ЖДН перестановки до пор. КТК
		//Порожняя ЖДН (КТК)
		//ЖДН подсыла под порожний КТК
		Если обВидЖДН.Ссылка = Справочники.ВидыЖДН.ЖДН_ПерестановкиДоПорКТК 
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ПорожняяЖДН_КТК
			ИЛИ обВидЖДН.Ссылка = Справочники.ВидыЖДН.ЖДН_ПодсылПодПорожнийКТК
			Тогда
			обВидЖДН.ИмяРеквизитаВагонВСоставеПоезда = "ВагонПодсылаПорКТК";
		КонецЕсли;
		//из реквизита "ВагонПересылаПорКТК " для накладных вида:
		//ЖДН после груж. (КТК)
		Если обВидЖДН.Ссылка = Справочники.ВидыЖДН.ЖДН_ПослеГружКТК 
			Тогда
			обВидЖДН.ИмяРеквизитаВагонВСоставеПоезда = "ВагонПересылаПорКТК";
		КонецЕсли;
		//установить в Истина "ЭтоВагоннаяЖДН" для всех текущих видов ЖДН кроме тех, 
		//у кого "имя реквизита в составе поезда" = НакладнаяПослеГружКТК, ПорожняяЖДНКТК или ЖДН	
		Если обВидЖДН.ИмяРеквизитаЖДНВСоставеПоезда = "ЖДН"
			ИЛИ обВидЖДН.ИмяРеквизитаЖДНВСоставеПоезда = "НакладнаяПослеГружКТК" 
			ИЛИ обВидЖДН.ИмяРеквизитаЖДНВСоставеПоезда = "ПорожняяЖДНКТК" 
			Тогда
			обВидЖДН.ЭтоВагоннаяЖДН = Ложь;
		Иначе
			обВидЖДН.ЭтоВагоннаяЖДН = Истина;
		КонецЕсли;                          
		обВидЖДН.Записать();
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_29
//Евросиб Коханенко Н.А. #61823 28.12.2022 ( 
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияТребуетсяЗаполнитьРейс() Экспорт
	ТребуетсяЗаполнитьРейс = Справочники.Состояния.НайтиПоНаименованию("Требуется заполнить рейс");
	Если Не ЗначениеЗаполнено(ТребуетсяЗаполнитьРейс) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТребуетсяЗаполнитьРейс";
		СостояниеОбъект.Наименование = "Требуется заполнить рейс";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ТребуетсяЗаполнитьРейс.ИмяПредопределенныхДанных = "ТребуетсяЗаполнитьРейс" Тогда
		СостояниеОбъект = ТребуетсяЗаполнитьРейс.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТребуетсяЗаполнитьРейс";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
//Евросиб Коханенко Н.А. #61823 28.12.2022 ) 
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_38
Процедура СоздатьПредопределенныйЭлементСправочникаТипыЛокаций() Экспорт
	
	Если Справочники.ТипыЛокаций.НайтиПоНаименованию("Адрес в населенном пункте") = Справочники.ТипыЛокаций.ПустаяСсылка() Тогда
		ТипЛокацииОбъект = Справочники.ТипыЛокаций.СоздатьЭлемент();
		ТипЛокацииОбъект.Наименование = "Адрес в населенном пункте";
		ТипЛокацииОбъект.ИмяПредопределенныхДанных = "АдресВНаселенномПункте";
		ТипЛокацииОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры
Процедура УстановитьУровниТипаЛокаций() Экспорт
	обТипЛокации = Справочники.ТипыЛокаций.Регион.ПолучитьОбъект();
	обТипЛокации.Уровень = 1;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.НаселенныйПункт.ПолучитьОбъект();
	обТипЛокации.Уровень = 2;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.СтанцияЖД.ПолучитьОбъект();
	обТипЛокации.Уровень = 3;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.Порт.ПолучитьОбъект();
	обТипЛокации.Уровень = 3;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.Терминал.ПолучитьОбъект();
	обТипЛокации.Уровень = 3;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.Сток.ПолучитьОбъект();
	обТипЛокации.Уровень = 4;
	обТипЛокации.Записать();

	обТипЛокации = Справочники.ТипыЛокаций.Улица.ПолучитьОбъект();
	обТипЛокации.Уровень = 9;
	обТипЛокации.Записать();

	//обТипЛокации = Справочники.ТипыЛокаций.АдресВНаселенномПункте.ПолучитьОбъект();
	//обТипЛокации.Уровень = 9;
	//обТипЛокации.Записать();

КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_42

Процедура УстановитьКонстантуКоличествоМесяцевНаПодписаниеПСЦсДвухСторон() Экспорт
	Константы.КоличествоМесяцевНаПодписаниеПСЦсДвухСторон.Установить(2);
КонецПроцедуры

#КонецОбласти    

// Сержантова А.С. US 72111 ТА 73815 28.09.2023
#Область ОбработчикиПереходаНаВерсию_1_0_0_44
Процедура УстановитьПредопределеннуюГруппуПользователейРуководительОтделаПродажНСК() Экспорт

	ГруппаПольз = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель отдела продаж НСК"); 
	Если ГруппаПольз <> Неопределено и ГруппаПольз <> Справочники.ГруппыПользователей.ПустаяСсылка() Тогда
		ОбъектГруппаПольз = ГруппаПольз.ПолучитьОбъект();
		ОбъектГруппаПольз.ИмяПредопределенныхДанных = "РуководительОтделаПродажНСК";
		ОбъектГруппаПольз.ОбменДанными.Загрузка = Истина;
		ОбъектГруппаПольз.Записать();
	КонецЕсли;	

КонецПроцедуры  
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_49
// ДИТ US 76975 ТА 76977 Сержантова А.С. 15.11.2023
Процедура СостояниеВводПСЦвПредопределенные() Экспорт 
	
	СостояниеВводПСЦ = Справочники.Состояния.НайтиПоНаименованию("Ввод ПСЦ"); 
	Если СостояниеВводПСЦ <> Неопределено и СостояниеВводПСЦ <> Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектВводПСЦ = СостояниеВводПСЦ.ПолучитьОбъект();
		ОбъектВводПСЦ.ИмяПредопределенныхДанных = "ВводПСЦ";
		ОбъектВводПСЦ.ОбменДанными.Загрузка = Истина;
		ОбъектВводПСЦ.Записать();
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_54

//ДИТ, Беляев СЮ, Ticket#0335550, 21-12-2023, начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияТребуетсяСоздатьКомплект() Экспорт
	ГруппаЗадачиСозданияКомплектаДокументов = Справочники.Состояния.ЗадачиСозданияКомплектаДокументов;
	
	Для Счетчик = 41 По 80 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["ТребуетсяСоздатьКомплектДокументов" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = "ТребуетсяСоздатьКомплектДокументов"+Строка(Счетчик);
				СостояниеОбъект.Наименование = "Требуется создать комплект документов";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ВсегдаПерезапускать;
				СостояниеОбъект.Родитель = ГруппаЗадачиСозданияКомплектаДокументов;
				СостояниеОбъект.УстановитьНовыйКод();
				СостояниеОбъект.ОбменДанными.Загрузка = Истина;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Сержантова А.С. US 80736 ТА 81088 26.02.2024
#Область ОбработчикиПереходаНаВерсию_1_0_0_56
Процедура УстановитьПредопределенноеСостояниеНеобходимоОбновление() Экспорт

	НовоеСостояние = Справочники.Состояния.НайтиПоНаименованию("Необходимо обновить данные после изменения Терминала [выдачи/сдачи] в Релизе клиента"); 
	Если НовоеСостояние <> Неопределено и НовоеСостояние <> Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектНовоеСостояние = НовоеСостояние.ПолучитьОбъект();
		ОбъектНовоеСостояние.ИмяПредопределенныхДанных = "НеобходимоОбновитьДанные";
		ОбъектНовоеСостояние.ОбменДанными.Загрузка = Истина;
		ОбъектНовоеСостояние.Записать();
	КонецЕсли;	

КонецПроцедуры  
#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_61

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023
Процедура СоздатьЭлементНоменклатурыПремия() Экспорт   
	ЭлементПремия = Справочники.Номенклатура.НайтиПоНаименованию("Премия"); 
	Если ЭлементПремия = Справочники.Номенклатура.ПустаяСсылка() Тогда
		НоменклатураПремия = Справочники.Номенклатура.СоздатьЭлемент();
		НоменклатураПремия.ИмяПредопределенныхДанных = "Премия";
		НоменклатураПремия.Наименование 			 = "Премия"; 
		НоменклатураПремия.НаименованиеПолное		 = "Премия за осуществление перевозки на территории КНР с учетом государственного субсидирования";
		НоменклатураПремия.НаименованиеПолноеАнгл	 = "Bonus for transportation within the PRC in view of state subsidizing";
		НоменклатураПремия.Доходная					 = Истина;
		НоменклатураПремия.Услуга					 = Истина;
		НоменклатураПремия.ЕдиницаИзмерения			 = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("t01");
		НоменклатураПремия.Родитель				 	 = Справочники.Номенклатура.НайтиПоНаименованию("Штрафы, Претензии, Убытки, Сборы");
		НС = НоменклатураПремия.ПереводыНаименований.Добавить();
		НС.Валюта = Справочники.Валюты.НайтиПоКоду("156"); 
		НС.НаименованиеНаЯзыкеСтраны = "中国境内运输费用，包括政府补贴。";
		НоменклатураПремия.Записать();
	Иначе
		НоменклатураПремия = ЭлементПремия.ПолучитьОбъект();
		НоменклатураПремия.ИмяПредопределенныхДанных	= "Премия";
		НоменклатураПремия.Наименование 				= "Премия";
		НоменклатураПремия.Записать();
	КонецЕсли;
КонецПроцедуры

// ДИТ US 59973 ТА 74834 Сержантова А.С. 14.09.2023
Процедура УстановитьПредопределеннуюВалютуЮань() Экспорт
	ЮаньВалюта = Справочники.Валюты.НайтиПоКоду("156"); 
	Если ЮаньВалюта <> Неопределено и ЮаньВалюта <> Справочники.Валюты.ПустаяСсылка() Тогда
		ОбъектВалюты = ЮаньВалюта.ПолучитьОбъект();
		ОбъектВалюты.ИмяПредопределенныхДанных = "Юань";
		ОбъектВалюты.ОбменДанными.Загрузка = Истина;
		ОбъектВалюты.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. 06.09.2024
#Область ОбработчикиПереходаНаВерсию_1_0_0_69
Процедура ЗаполнитьТаблицыМаршрутовИзРеквизитов() Экспорт
	
	//В справочнике Маршрутизация заменяем реквизиты Контрагент и Договор на таблицу КонтрагентыИДоговоры,
	//реквизит ВидПеревозки на таблицу ВидыПеревозок 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Маршрутизация.Ссылка КАК Ссылка,
		|	Маршрутизация.УдалитьКонтрагент КАК УдалитьКонтрагент,
		|	Маршрутизация.УдалитьДоговор КАК УдалитьДоговор,
		|	Маршрутизация.УдалитьВидПеревозки КАК УдалитьВидПеревозки
		|ИЗ
		|	Справочник.Маршрутизация КАК Маршрутизация
		|ГДЕ
		|	(Маршрутизация.УдалитьКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ИЛИ Маршрутизация.УдалитьДоговор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ИЛИ Маршрутизация.УдалитьВидПеревозки <> ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МаршрутОбъект = Выборка.Ссылка.ПолучитьОбъект();  
		Если ЗначениеЗаполнено(Выборка.УдалитьВидПеревозки) Тогда
			НС = МаршрутОбъект.ВидыПеревозок.Добавить();
			НС.ВидПеревозки = Выборка.УдалитьВидПеревозки;
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(Выборка.УдалитьКонтрагент) или ЗначениеЗаполнено(Выборка.УдалитьДоговор) Тогда
			НС = МаршрутОбъект.КонтрагентыИДоговоры.Добавить();
			НС.Договор = Выборка.УдалитьДоговор;
			НС.Контрагент = Выборка.УдалитьКонтрагент;	
		КонецЕсли; 
		МаршрутОбъект.Записать();
		
	КонецЦикла;	

КонецПроцедуры  
#КонецОбласти

 #Область ОбработчикиПереходаНаВерсию_1_0_0_80
// ДИТ US 91362 ТА 97665 Шевченко А.В. Начало: 25.12.2024
Процедура СоздатьПредопределенныйЭлементСправочникаСостоянийУтвержденДопРасходы() Экспорт
	
	Состояние = Справочники.Состояния.СоздатьЭлемент();
	Состояние.ИмяПредопределенныхДанных = "ТребуетсяСоздатьКомплектДокументовПоДопРасходам";
	Состояние.Наименование = "Требуется создать комплект документов по доп.расходам счет на оплату";
	Состояние.ОбменДанными.Загрузка = Истина;
	Состояние.Записать();
	
	Состояние = Справочники.Состояния.СоздатьЭлемент();
	Состояние.ИмяПредопределенныхДанных = "ТребуетсяСоздатьКомплектДокументовПоДопРасходамРТУ";
	Состояние.Наименование = "Требуется создать комплект документов по доп.расходам счет на оплату + РТУ";
	Состояние.ОбменДанными.Загрузка = Истина;
	Состояние.Записать();
	
КонецПроцедуры
// ДИТ US 91362 ТА 97665 Шевченко А.В. Конец: 25.12.2024
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_82
//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
Процедура СоздатьПредопределенныйЭлементСправочникаЭлементыПечатнойФормыПротоколаТаблицаДоговорнаяЦенаCOCSOC() Экспорт
	
	НаименованиеЭлемента = "Таблица Договорная Цена COC";
	НайденныйЭлемент = Справочники.ЭлементыПечатнойФормыПротокола.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ЭлементыПечатнойФормыПротокола.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ТаблицаДоговорнаяЦенаCOC";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

	НаименованиеЭлемента = "Таблица Договорная Цена SOC";
	НайденныйЭлемент = Справочники.ЭлементыПечатнойФормыПротокола.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ЭлементыПечатнойФормыПротокола.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ТаблицаДоговорнаяЦенаSOC";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();
	
КонецПроцедуры //Евросиб Коханенко Н.А. 12.02.2025 )) #102614
#КонецОбласти    

#Область ОбработчикиПереходаНаВерсию_1_0_0_83
// ДИТ US 94594 ТА 96789 Лаврентьев О.М. Начало: 06.12.2024
Процедура ЗаменитьНаПредопределенныйЭлементСправочникаСостояний() Экспорт
	НаименованиеЭлемента = "Подтвержд.факта оказания подрядчиком услуг и суммы документа. Отработка задач из АРМ неурег.сумм.";
	НайденныйЭлемент = Справочники.Состояния.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	КонецЕсли;

	СостояниеОбъект.ИмяПредопределенныхДанных = "ПодтверждФактаОказанияПодрядчикомУслугИСуммыДокумента";
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();                                                                
	
КонецПроцедуры
 // ДИТ US 94594 ТА 96789 Лаврентьев О.М. Конец: 06.12.2024
#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_84
//Евросиб СубботинВ #96807 17.12.2024 Начало  // блок по внедрению заявок на оплату //начало 04.03.2024 
Процедура СоздатьПредопределенныйЭлементСправочникаГруппыПользователейОтделАренды() Экспорт
	
	ГруппаДКП = Справочники.ГруппыПользователей.СоздатьЭлемент();
	ГруппаДКП.ИмяПредопределенныхДанных = "ОтделАренды";
	ГруппаДКП.Наименование = "Отдел аренды";
	ГруппаДКП.ОбменДанными.Загрузка = Истина;
	ГруппаДКП.Записать();
	
КонецПроцедуры

Процедура СоздатьПредопределенныйЭлементСправочникаСостоянийУтвержден() Экспорт
	
	ГруппаДКП = Справочники.Состояния.СоздатьЭлемент();
	ГруппаДКП.ИмяПредопределенныхДанных = "Утверждение";
	ГруппаДКП.Наименование = "Утверждение";
	ГруппаДКП.ОбменДанными.Загрузка = Истина;
	ГруппаДКП.Записать();
	
КонецПроцедуры

Процедура СоздатьПредопределенныйЭлементСправочникаГруппыПользователейБезПодразделения () Экспорт
	
	ГруппаДКП = Справочники.ГруппыПользователей.СоздатьЭлемент();
	ГруппаДКП.ИмяПредопределенныхДанных = "ДКПБезПодразделения";
	ГруппаДКП.Наименование = "Сотрудники без подразделения";
	ГруппаДКП.ОбменДанными.Загрузка = Истина;
	ГруппаДКП.Записать();
	
КонецПроцедуры
 //Евросиб СубботинВ #96807 17.12.2024 Конец 
 
 //Евросиб СубботинВ #103435 03.03.2025 Начало
 Процедура СоздатьПредопределенныйЭлементСправочникаРедактированиеДокумента () Экспорт
	
	ГруппаДКП = Справочники.Состояния.СоздатьЭлемент();
	ГруппаДКП.ИмяПредопределенныхДанных = "РедактированиеДокумента";
	ГруппаДКП.Наименование = "Редактирование Документа";
	ГруппаДКП.ОбменДанными.Загрузка = Истина;
	ГруппаДКП.Записать();

КонецПроцедуры  
//Евросиб СубботинВ #103435 03.03.2025 Конец   // блок по внедрению заявок на оплату //Конец 04.03.2024
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_86
//Евросиб Коханенко Н.А. 14.03.2025 (( #100979 
Процедура СоздатьПредопределенныеЭлементыНоменклатурыДляПодбораПродуктаВКалькуляции() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("ГруженыйЖДтарифРФ");
	ИменаНовыхЭлементов.Добавить("ГруженыйЖДтарифПрочТерритории");
	ИменаНовыхЭлементов.Добавить("ТерминальнаяОбработкаПерегрузНСК");
	ИменаНовыхЭлементов.Добавить("Фрахт");

	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла; 
	
	НаименованиеЭлемента = "Перегруз ПВ";
	НайденныйЭлемент = Справочники.ПродуктыДКП.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ПродуктыДКП.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ПерегрузПВ";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

	
КонецПроцедуры //Евросиб Коханенко Н.А. 14.03.2025 )) #100979 
#КонецОбласти 

//Евросиб Каблов 17.03.2025 #100116
Процедура СоздатьПредопределенныеЭлементыНоменклатуры85() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаГруженыйКонтейнер");
	ИменаНовыхЭлементов.Добавить("ПревышениеНормыЗагрузкиКонтейнера");
	ИменаНовыхЭлементов.Добавить("СНПавтотранспорта");
	ИменаНовыхЭлементов.Добавить("СНПвагонов");
	ИменаНовыхЭлементов.Добавить("СНПвагоновПогрузкаВыгрузка");
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаПорожнийКонтейнер");
	ИменаНовыхЭлементов.Добавить("БазоваяСтавкаАвто");
	ИменаНовыхЭлементов.Добавить("ЭкспедированиеАвтотранспорт");
	ИменаНовыхЭлементов.Добавить("ДопСборыПрочиеАвто");
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаХолостойПрогон");
	ИменаНовыхЭлементов.Добавить("ГруженыйЖДтарифРФ");
	ИменаНовыхЭлементов.Добавить("ГруженыйЖДтарифПрочТерритории");
	ИменаНовыхЭлементов.Добавить("ТерминальнаяОбработкаПерегрузНСК");
	ИменаНовыхЭлементов.Добавить("Фрахт");
	
	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиПереходаНаВерсию_1_0_0_87
//Евросиб(ДИТ), Беляев СЮ, US 105324 / TA 105326, 20-03-2025, начало
Процедура СоздатьПредопределенныйЭлементСправочникаВидыПСЦ_ОснованиеДляВозмещенияРасходов() Экспорт
	
	НаименованиеЭлемента = "Основание для возмещения расходов";
	ИмяПредопределенныхДанных = "ОснованиеДляВозмещенияРасходов";
	
	ЕстьЭлементСправочника = Ложь;
	Попытка
		СостояниеСсылка = Справочники.ВидыПСЦ[ИмяПредопределенныхДанных];
		ЕстьЭлементСправочника = Истина;
	Исключение
	КонецПопытки;
	
	Если Не ЕстьЭлементСправочника Тогда
		ЭлементСсылка = Справочники.ВидыПСЦ.НайтиПоНаименованию(НаименованиеЭлемента, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.ВидыПСЦ.СоздатьЭлемент();
			ЭлементОбъект.Наименование = НаименованиеЭлемента;
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 
//Евросиб(ДИТ), Беляев СЮ, US 105324 / TA 105326, 20-03-2025, конец
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_88
//Евросиб Коханенко Н.А. 24.03.2025 (( #105705 
Процедура СоздатьПредопределенныеЭлементыСправочникаПродуктыДКП() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("РелокацияКонтейнера");
	ИменаНовыхЭлементов.Добавить("МежсервисныеРасходы");
	
	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.ПродуктыДКП.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.ПродуктыДКП.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 24.03.2025 )) #105705
#КонецОбласти     

#Область ОбработчикиПереходаНаВерсию_1_0_0_89
//Евросиб Коханенко Н.А. 12.02.2025 (( #105938 
Процедура СоздатьПредопределенныйЭлементСправочникаЭлементыПечатнойФормыПротоколаШапкаНотисаММ() Экспорт
	
	НаименованиеЭлемента = "Шапка нотиса ММ";
	НайденныйЭлемент = Справочники.ЭлементыПечатнойФормыПротокола.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ЭлементыПечатнойФормыПротокола.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ШапкаНотисаММ";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 12.02.2025 )) #105938
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_90
Процедура ЗаполнитьРегистрыЗакрытыхПериодов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытиеПериода.Дата КАК Дата,
	|	ЗакрытиеПериода.Ссылка КАК Закрытие,
	|	ЗакрытиеПериода.Представление КАК ЗакрытиеПредставление,
	|	ЗакрытиеПериода.Организация КАК Организация,
	|	ЗакрытиеПериода.ПериодБлокировки КАК ПериодБлокировки,
	|	ЗакрытыеПериодыДоходов.Регистратор КАК ЗакрытиеДоходов,
	|	ЗакрытиеПериода.Автор КАК Автор,
	|	ЗакрытиеПериода.Создано КАК Создано,
	|	ЗакрытиеПериода.Редактор КАК Редактор,
	|	ЗакрытиеПериода.Изменено КАК Изменено
	|ИЗ
	|	Документ.ЗакрытиеПериода КАК ЗакрытиеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытыеПериодыДоходов КАК ЗакрытыеПериодыДоходов
	|		ПО ЗакрытиеПериода.Организация = ЗакрытыеПериодыДоходов.Организация
	|			И ЗакрытиеПериода.ПериодБлокировки = ЗакрытыеПериодыДоходов.Период
	|ГДЕ
	|	ЗакрытиеПериода.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодБлокировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ЗакрытиеДоходов) Тогда
						
			Движения = РегистрыСведений.ЗакрытыеПериодыДоходов.СоздатьНаборЗаписей();
			Движения.Отбор.Регистратор.Значение = Выборка.Закрытие;
			Движения.Отбор.Регистратор.Использование = Истина;
			
			Запись = Движения.Добавить();
			Запись.Период = Выборка.ПериодБлокировки;
			Запись.Организация = Выборка.Организация;
			Запись.Регистратор = Выборка.Закрытие;
			
			Движения.Записать();
			
		КонецЕсли;		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытыеПериодыБУ.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ЗакрытыеПериодыБУ КАК ЗакрытыеПериодыБУ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движения = РегистрыСведений.ЗакрытыеПериодыБУ.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Значение = Выборка.Регистратор;
		Движения.Отбор.Регистратор.Использование = Истина;		
		Движения.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокЗакрытие.Дата КАК Дата,
	|	ДокЗакрытие.Ссылка КАК Ссылка,
	|	ДокЗакрытие.Организация КАК Организация,
	|	ДокЗакрытие.ПериодБлокировки КАК ПериодБлокировки,
	|	ЗакрытыеПериодыБУ.Период КАК ЗакрытПериодБУ
	|ИЗ
	|	Документ.ЗакрытиеПериодаБУ КАК ДокЗакрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытыеПериодыБУ КАК ЗакрытыеПериодыБУ
	|		ПО ДокЗакрытие.Ссылка = ЗакрытыеПериодыБУ.Регистратор
	|ГДЕ
	|	ДокЗакрытие.Проведен
	|	И ДокЗакрытие.ЗакрытиеПериодаБУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодБлокировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Движения = РегистрыСведений.ЗакрытыеПериодыБУ.СоздатьНаборЗаписей();
			Движения.Отбор.Регистратор.Значение = Выборка.Ссылка;
			Движения.Отбор.Регистратор.Использование = Истина;
			
			Запись = Движения.Добавить();
			Запись.Период = Выборка.ПериодБлокировки;
			Запись.Организация = Выборка.Организация;
			Запись.Регистратор = Выборка.Ссылка;
			
			Движения.Записать();
		Исключение
		
		КонецПопытки;
		
	КонецЦикла;
	
	Константы.АдресЭлектроннойПочтыДляРассылкиУведомлений.Установить("PolzovateliDATACore@eurosib.biz");
	Константы.АдресЭлектроннойПочтыДляРассылкиУведомленийТестовый.Установить("");
	
КонецПроцедуры
#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_91
//Евросиб Коханенко Н.А. 07.03.2025 (( #102319 
Процедура СоздатьПредопределенныеЭлементыНоменклатурыАвтоперевозки() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаГруженыйКонтейнер");
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаПорожнийКонтейнер");
	ИменаНовыхЭлементов.Добавить("БазоваяСтавкаАвто");
	ИменаНовыхЭлементов.Добавить("ЭкспедированиеАвтотранспорт");
	ИменаНовыхЭлементов.Добавить("ДопСборыПрочиеАвто");
	ИменаНовыхЭлементов.Добавить("АвтоперевозкаХолостойПрогон");

	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 07.03.2025 )) #102319 
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_92
//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217
Процедура СоздатьПредопределенныйЭлементСправочникаСобытияНачалаИОкончанияРасчетаПользования() Экспорт
	
	ИменаНовыхЭлементов = Новый Соответствие;
	ИменаНовыхЭлементов.Вставить("Дата выгрузки КТК в порту назначения","ДатаВыгрузкиКТКВПортуНазначения");
	ИменаНовыхЭлементов.Вставить("Дата выдачи порожнего КТК","ДатаВыдачиПорожнегоКТК");
	ИменаНовыхЭлементов.Вставить("Дата прибытия в порт отправления","ДатаПрибытияВПортОтправления");
	ИменаНовыхЭлементов.Вставить("Дата прибытия контейнера на станцию назначения","ДатаПрибытияКонтейнераНаСтанциюНазначения");
	ИменаНовыхЭлементов.Вставить("Дата сдачи порожнего КТК в сток","ДатаСдачиПорожнегоКТКВСток");
	ИменаНовыхЭлементов.Вставить("Получение ДТ/телекс/релиза","ПолучениеДТТелексРелиза");
	
	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.СобытияНачалаИОкончанияРасчетаПользования.НайтиПоНаименованию(ИмяЭлемента.Ключ, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента.Значение;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217

//Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217
Процедура СоздатьПредопределенныйЭлементСправочникаЭтапыСНП() Экспорт
	
	ИменаНовыхЭлементов = Новый Соответствие;
	ИменаНовыхЭлементов.Вставить("СНП в локации отправления (иностранная территория)","СНПВЛокацииОтправленияИностраннаяТерритория");
	ИменаНовыхЭлементов.Вставить("СНП в порту прибытия","СНПВПортуПрибытия");
	ИменаНовыхЭлементов.Вставить("СНП на ЖД станции прибытия","СНПНаЖДСтанцииПрибытия");	
	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.ЭтапыСНП.НайтиПоНаименованию(ИмяЭлемента.Ключ, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента.Значение;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //Евросиб Шевченко А.В. 12.05.2025 US 94035 TA 104217
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_93
//Евросиб Коханенко Н.А. 22.04.2025 (( #78722 
Процедура СоздатьПредопределенныеЭлементыСправочникаОфисыПродаж() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Центральный", "Центральный"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Новосибирск", "Новосибирск"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "ДальнийВосток", "Дальний Восток"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Рефы", "Рефы"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Агрологистика", "Агрологистика"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "РасходыДКП", "Расходы ДКП"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Казахстан", "Казахстан"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("ИмяПредопределенныхДанных, Наименование", "Китай", "Китай"));
	
	Для Каждого Элемент Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.ОфисыПродаж.НайтиПоНаименованию(Элемент.Наименование, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = Справочники.ОфисыПродаж.СоздатьЭлемент();
			ЭлементОбъект.Наименование = Элемент.Наименование;
		Иначе
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		КонецЕсли;
		ЭлементОбъект.ИмяПредопределенныхДанных = Элемент.ИмяПредопределенныхДанных;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.04.2025 )) #78722
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_94
// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
Процедура СоздатьПредопределенныеЭлементыСправочникаСостояний() Экспорт
	
	СостояниеРодитель = Справочники.Состояния.НайтиПоНаименованию("Задачи требуется создать комплект документов по дополнительным расходам");
	
	Если Не ЗначениеЗаполнено(СостояниеРодитель) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "ЗадачиТребуетсяСоздатьКомплектДокументовПоДопРасходам";
		СостояниеГруппа.Наименование = "Задачи требуется создать комплект документов по дополнительным расходам";
		СостояниеГруппа.Родитель = Справочники.Состояния.СлужебныеСостоянияСделки;
		Попытка
			СостояниеГруппа.Записать();
		Исключение
		КонецПопытки;
		СостояниеРодитель = СостояниеГруппа.Ссылка;
	КонецЕсли;
	
	Для Счетчик = 1 По 40 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["ТребуетсяСоздатьКомплектДокументовПоДопРасходам" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = ("ТребуетсяСоздатьКомплектДокументовПоДопРасходам" + Строка(Счетчик));
				СостояниеОбъект.Наименование = "Требуется создать комплект документов по доп. расходам";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.Родитель = СостояниеРодитель;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("ОрганизацияОхраны");
	ИменаНовыхЭлементов.Добавить("ОрганизацияУсиленнойОхраны");

	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_95
//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
Процедура СоздатьПредопределенныйЭлементСправочникаБазовыеСтавкиНадбавкиМСКЗонаВнутриМКАД() Экспорт
	
	НаименованиеЭлемента = "МСК - зона внутри МКАД";
	НайденныйЭлемент = Справочники.БазовыеСтавкиНадбавки.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.БазовыеСтавкиНадбавки.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "МСКЗонаВнутриМКАД";                          
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 05.06.2025 )) #110783
#КонецОбласти    

#Область ОбработчикиПереходаНаВерсию_1_0_0_96
//Евросиб Каблов 28.05.2025 #109346
Процедура СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_96() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("НакладныеРасходы");
	ИменаНовыхЭлементов.Добавить("МежсервисныеРасходы");

	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_97
//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 26.06.25 Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияЗаполнитьПолеГруппаДКС() Экспорт
	ЗаполнитьПолеГруппаДКС = Справочники.Состояния.НайтиПоНаименованию("Заполнить поле группа ДКС");
	Если Не ЗначениеЗаполнено(ЗаполнитьПолеГруппаДКС) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьПолеГруппаДКС";
		СостояниеОбъект.Наименование = "Заполнить поле группа ДКС";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ЗаполнитьПолеГруппаДКС.ИмяПредопределенныхДанных = "ЗаполнитьПолеГруппаДКС" Тогда
		СостояниеОбъект = ЗаполнитьПолеГруппаДКС.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ЗаполнитьПолеГруппаДКС";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры //Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 26.06.25 Конец

//Евросиб Каблов 26.06.2025 #100085
Процедура СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_97() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("ХранениеТерминалГруженыйКонтейнер");
	ИменаНовыхЭлементов.Добавить("ХранениеТерминалПорожнийКонтейнер");
	ИменаНовыхЭлементов.Добавить("НакладныеРасходы");
	ИменаНовыхЭлементов.Добавить("МежсервисныеРасходы");

	Для Каждого ИмяЭлемента Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.Номенклатура.НайтиПоНаименованию(ИмяЭлемента, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
			ЭлементОбъект.Наименование = ИмяЭлемента;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ИмяГруппы = "Время";
	ЭлементСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ИмяГруппы, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяГруппы;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	Иначе
		ЭлементОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьГруппу();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяГруппы;
		ЭлементОбъект.Наименование = ИмяГруппы;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "ваг.сут", "ВагоноСутки"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "TEU-сут", "TEU_сутки"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "ктк.сут", "КонтейнероСутки"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "мин", "Минута"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "ч", "Час"));
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование,Имя", "сут", "Сутки"));
	
	Для Каждого Элемент Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Элемент.Наименование, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = Элемент.Имя;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = Элемент.Имя;
			ЭлементОбъект.Наименование = Элемент.Наименование;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти    

#Область ОбработчикиПереходаНаВерсию_1_0_0_98
//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112173 02.07.2025
Процедура УстановитьФлагКонстантыВыгрузкаРеестровФНС() Экспорт

	Константы.ВыгрузкаРеестровНДСИзРН.Установить(Истина);	

КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_99
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостояний_КорректировкаПТУ() Экспорт
	
	///// Задачи Корректировка ПТУ. Требуется внести изменения ВР //////
	СостояниеРодитель = Справочники.Состояния.НайтиПоНаименованию("Задачи Корректировка ПТУ. Требуется внести изменения ВР");
	
	Если Не ЗначениеЗаполнено(СостояниеРодитель) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "ЗадачиКорректировкаПТУТребуетсяВнестиИзмененияВР";
		СостояниеГруппа.Наименование = "Задачи Корректировка ПТУ. Требуется внести изменения ВР";
		СостояниеГруппа.Родитель = Справочники.Состояния.СлужебныеСостоянияСделки;
		Попытка
			СостояниеГруппа.Записать();
		Исключение
		КонецПопытки;
		СостояниеРодитель = СостояниеГруппа.Ссылка;
	КонецЕсли;
	
	Для Счетчик = 1 По 20 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["КорректировкаПТУТребуетсяВнестиИзмененияВР" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = ("КорректировкаПТУТребуетсяВнестиИзмененияВР" + Строка(Счетчик));
				СостояниеОбъект.Наименование = "Корректировка ПТУ. Требуется внести изменения ВР";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.Родитель = СостояниеРодитель;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	///// Задачи Требуется аннулировать Отчет Комитенту //////
	СостояниеРодитель = Справочники.Состояния.НайтиПоНаименованию("Задачи Требуется аннулировать Отчет Комитенту");
	
	Если Не ЗначениеЗаполнено(СостояниеРодитель) Тогда
		СостояниеГруппа = Справочники.Состояния.СоздатьГруппу();
		СостояниеГруппа.ИмяПредопределенныхДанных = "ЗадачиТребуетсяАннулироватьОтчетКомитенту";
		СостояниеГруппа.Наименование = "Задачи Требуется аннулировать Отчет Комитенту";
		СостояниеГруппа.Родитель = Справочники.Состояния.СлужебныеСостоянияСделки;
		Попытка
			СостояниеГруппа.Записать();
		Исключение
		КонецПопытки;
		СостояниеРодитель = СостояниеГруппа.Ссылка;
	КонецЕсли;
	
	Для Счетчик = 1 По 20 Цикл
		ЕстьЭлементСправочника = Ложь;
		Попытка
			СостояниеСсылка = Справочники.Состояния["ТребуетсяАннулироватьОтчетКомитенту" + Строка(Счетчик)];
			ЕстьЭлементСправочника = Истина;
		Исключение
		КонецПопытки;
		
		Если Не ЕстьЭлементСправочника Тогда
			Попытка
				СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
				СостояниеОбъект.ИмяПредопределенныхДанных = ("ТребуетсяАннулироватьОтчетКомитенту" + Строка(Счетчик));
				СостояниеОбъект.Наименование = "Требуется аннулировать Отчет Комитенту";
				СостояниеОбъект.Процессное = Истина;
				СостояниеОбъект.Родитель = СостояниеРодитель;
				СостояниеОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_100
//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 107993 01.07.25 Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияОтправитьОригиналыКлиенту() Экспорт
	ЗаполнитьПолеОтправитьОригиналы = Справочники.Состояния.НайтиПоНаименованию("Отправить оригиналы клиенту");
	Если Не ЗначениеЗаполнено(ЗаполнитьПолеОтправитьОригиналы) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ОтправитьОригиналыКлиенту";
		СостояниеОбъект.Наименование = "Отправить оригиналы клиенту";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ЗаполнитьПолеОтправитьОригиналы.ИмяПредопределенныхДанных = "ОтправитьОригиналыКлиенту" Тогда
		СостояниеОбъект = ЗаполнитьПолеОтправитьОригиналы.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ОтправитьОригиналыКлиенту";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры //Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 107993 01.07.25 Конец
#КонецОбласти       

#Область ОбработчикиПереходаНаВерсию_1_0_0_101
//Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025
Процедура ЗаполнитьСобытияДокументовВПакетахАктуальный() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПакетыДокументовСрезПоследних.Период КАК Период,
		|	ПакетыДокументовСрезПоследних.Пакет КАК Пакет,
		|	ПакетыДокументовСрезПоследних.Документ КАК Документ,
		|	ПакетыДокументовСрезПоследних.СпособОтправки КАК СпособОтправки,
		|	ПакетыДокументовСрезПоследних.Событие КАК Событие,
		|	ПакетыДокументовСрезПоследних.ДатаСобытия КАК ДатаСобытия,
		|	ПакетыДокументовСрезПоследних.Пользователь КАК Пользователь,
		|	ПакетыДокументовСрезПоследних.Примечание КАК Примечание,
		|	ПакетыДокументовСрезПоследних.Изменен КАК Изменен,
		|	ПакетыДокументовСрезПоследних.Подписан КАК Подписан,
		|	ПакетыДокументовСрезПоследних.ПричинаНеПодписан КАК ПричинаНеПодписан,
		|	ПакетыДокументовСрезПоследних.ДатаОтправки КАК ДатаОтправки,
		|	ПакетыДокументовСрезПоследних.ДатаВозврата КАК ДатаВозврата,
		|	ПакетыДокументовСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.ПакетыДокументов.СрезПоследних КАК ПакетыДокументовСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Приемник = РегистрыСведений.СобытияДокументовВПакетахАктуальный.СоздатьМенеджерЗаписи();		
		ЗаполнитьЗначенияСвойств(Приемник,ВыборкаДетальныеЗаписи);				
		Приемник.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры //Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_102
//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
Процедура УбратьТерминалыСдачиВыдачиДляУслугПоставщикаКонтейнеры() Экспорт
	ВидыУслугКонтейнеры = СПравочники.ВидыУслугПоставщиков.Контейнеры;
	
	обВидыУслугКонтейнеры = ВидыУслугКонтейнеры.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура("ИмяТаблицы,Имя","ПСЦПоставщика.Услуги","ПунктОтправления");
	НайденныеСтроки = обВидыУслугКонтейнеры.ПоляТаблицыУслуг.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() Тогда
		НайденныеСтроки[0].Выводить = Ложь;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИмяТаблицы,Имя","ПСЦПоставщика.Услуги","ПунктНазначения");
	НайденныеСтроки = обВидыУслугКонтейнеры.ПоляТаблицыУслуг.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() Тогда
		НайденныеСтроки[0].Выводить = Ложь;
	КонецЕсли;
	
	обВидыУслугКонтейнеры.Записать();	
КонецПроцедуры //Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_103
//Евросиб Шевченко А.В. US 112687 TA 115016 22.07.2025
Процедура ПереносСчетовИзШапкиВНовуюТЧКорРТУОтчетКомитентуОПродажах() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка КАК Ссылка,
		|	КорректировкаРеализации.УдалитьСчетНаОплатуПокупателю КАК УдалитьСчетНаОплатуПокупателю
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	НЕ КорректировкаРеализации.ПометкаУдаления
		|	И КорректировкаРеализации.УдалитьСчетНаОплатуПокупателю <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОб.СчетаНаОплатуПокупателям.Очистить();
		НовСтрока = ДокОб.СчетаНаОплатуПокупателям.Добавить();
		НовСтрока.СчетПокупателю = ВыборкаДетальныеЗаписи.УдалитьСчетНаОплатуПокупателю;
		ДокОб.ОбменДанными.Загрузка = Истина;
		ДокОб.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
		|	ОтчетКомитентуОПродажах.УдалитьСчетНаОплатуПокупателю КАК УдалитьСчетНаОплатуПокупателю
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|ГДЕ
		|	НЕ ОтчетКомитентуОПродажах.ПометкаУдаления
		|	И ОтчетКомитентуОПродажах.УдалитьСчетНаОплатуПокупателю <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОб.СчетаНаОплатуПокупателям.Очистить();
		НовСтрока = ДокОб.СчетаНаОплатуПокупателям.Добавить();
		НовСтрока.СчетПокупателю = ВыборкаДетальныеЗаписи.УдалитьСчетНаОплатуПокупателю;
		НовСтрока.Сумма = ВыборкаДетальныеЗаписи.УдалитьСчетНаОплатуПокупателю.СуммаДокумента;
		ДокОб.ОбменДанными.Загрузка = Истина;
		ДокОб.Записать();
	КонецЦикла;		
КонецПроцедуры //Евросиб Шевченко А.В. US 112687 TA 115016 22.07.2025
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_104
//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
Процедура СоздатьПредопределенныеЭлементыСправочникаНоменклатура_ШтрафыПрочие() Экспорт
	ШтрафыПрочие = Справочники.Номенклатура.НайтиПоНаименованию("ШтрафыПрочие");
	Если Не ШтрафыПрочие.ИмяПредопределенныхДанных = "ШтрафыПрочие" Тогда
		обШтрафыПрочие = ШтрафыПрочие.ПолучитьОбъект();
		обШтрафыПрочие.ИмяПредопределенныхДанных = "ШтрафыПрочие";
		обШтрафыПрочие.ОбменДанными.Загрузка = Истина;
		обШтрафыПрочие.Записать();
	КонецЕсли;
КонецПроцедуры //Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_105
// Евросиб US 115468 TA 115468 Рыбьяков К.А. 04.08.2025 ((
Процедура СоздатьПредопределенныеЭлементыНоменклатуры_1_0_0_105() Экспорт
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить(Новый Структура("Наименование, Имя", "teu", "TEU"));
	
	Для Каждого Элемент Из ИменаНовыхЭлементов Цикл
		ЭлементСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Элемент.Наименование, Истина);
		Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.ИмяПредопределенныхДанных = Элемент.Имя;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		Иначе
			ЭлементОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЭлементОбъект.ИмяПредопределенныхДанных = Элемент.Имя;
			ЭлементОбъект.Наименование = Элемент.Наименование;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 04.08.2025 ))
#КонецОбласти 

//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
#Область ОбработчикиПереходаНаВерсию_1_0_0_106
Процедура ЗаполнитьГруппуТЭОУслугПоставщика() Экспорт
			
	обТЭО = СПравочники.ВидыУслугПоставщиков.ТЭО.ПолучитьОбъект();

	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	
	//Номенклатура	
	Имя		   = "Номенклатура";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;	

	НовСтрока.Представление = "Номенклатура системы";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	
	//Учетное направление	
	Имя		   = "УчетныеНаправленияСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = "Учетное направление";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	
	//Группа локации выдачи
	Имя		   = "ГруппаЛокацияВыдачи";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Локация выдачи";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Группировка = "Горизонтальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	//ПунктОтправления
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Пункт отправления";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаЛокацияВыдачи";
	
	//ПунктОтправленияСтрана
	Имя		   = "ПунктОтправленияСтрана";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Страна";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаЛокацияВыдачи";
	
	//Группа локации сдачи
	Имя		   = "ГруппаЛокацияСдачи";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Локация сдачи";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Группировка = "Горизонтальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	//ПунктОтправления
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Пункт назначения";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаЛокацияСдачи";
	
	//ПунктОтправленияСтрана
	Имя		   = "ПунктНазначенияСтрана";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Страна";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаЛокацияСдачи";
	
	//ЛокацияОказанияУслуги
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Локация оказания услуги (порт, терминал, ЖДст.)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//Вид собственности актива
	Имя		   = "ВидСобственности";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Вид собственности актива";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//ГруппаТипоразмеровКТКиВагонов
	Имя		   = "ГруппаТипоразмеровКТКиВагонов";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Группировка = "Вертикальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	//Тип и размер КТК
	Имя		   = "ТипоразмерыКТКСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = "Тип и размер КТК";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаТипоразмеровКТКиВагонов";
	
	//Тип и размер КТК
	Имя		   = "ТипоразмерыВагоновСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Тип и размер вагона";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Родитель = "ГруппаТипоразмеровКТКиВагонов";
	
	//НормаПользования
	Имя		   = "НормаПользования";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Нормативный срок выполнения услуги, сут. ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	
	//ВидТранспорта
	Имя		   = "ВидТранспорта";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Вид транспорта";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//Вид отправки
	Имя		   = "ВидыОтправокСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Вид отправки";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//Стоимость услуги / ставки без НДС
	Имя		   = "СтоимостьБезНДС";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Стоимость услуги / ставки без НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//СтоимостьЗаСуткиБезНДС	
	Имя		   = "СтоимостьЗаСуткиБезНДС";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;	

	НовСтрока.Представление = "Ставка в сут., без НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	
	//Валюта
	Имя		   = "Валюта";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Валюта";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//Ед. изм.
	Имя		   = "ЕдиницаИзмерения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Ед. изм.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	
	//Комментарий
	Имя		   = "Комментарий";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Представление = "Комментарий";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//КритерииСтрокой	
	Имя		   = "КритерииСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = "Созданные тарифы";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ТолькоПросмотр = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	
	//////////////////Отборы//////////////////////////
	
	
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Терминал);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Порт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.СтанцияЖД);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.НаселенныйПункт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.НаселенныйПункт;
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Терминал);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Порт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.СтанцияЖД);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.НаселенныйПункт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.НаселенныйПункт;
	
	Имя		   = "ПунктНазначенияСтрана";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Страна);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Страна;
	
	Имя		   = "ПунктОтправленияСтрана";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Страна);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Страна;
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Терминал);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Порт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.СтанцияЖД);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
	//////////////////Отборы//////////////////////////
	
	//////////////////ОграниченияТипов//////////////////////////
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Локации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктОтправления";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Мультилокации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Локации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктНазначения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Мультилокации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Локации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Мультилокации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
    //////////////////ОграниченияТипов//////////////////////////
	
	//////////////////СпискиВыбора//////////////////////////
	Имя		   = "ТипоразмерыВагоновСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП40"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП40");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП60"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП60");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП80"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП80");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ПВ"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ПВ");
	//////////////////СпискиВыбора//////////////////////////
	
	//////////////////ПоляПоиска//////////////////////////
	
	Имя		   = "ПунктОтправления";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Наименование");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Наименование";
	
	Имя		   = "ПунктОтправления";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"НаименованиеАнгл");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "НаименованиеАнгл";
	
	Имя		   = "ПунктОтправления";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Код");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Код";
	
	Имя		   = "ПунктНазначения";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Наименование");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Наименование";
	
	Имя		   = "ПунктНазначения";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"НаименованиеАнгл");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "НаименованиеАнгл";
	
	Имя		   = "ПунктНазначения";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Код");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Код";
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Наименование");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Наименование";
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"НаименованиеАнгл");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "НаименованиеАнгл";
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Код");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Код";
	
	//////////////////ПоляПоиска//////////////////////////
	
	обТЭО.Записать();
	
КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_107
//Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 116178 05.08.25 Начало
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияПовторноОтправитьОригиналыКлиенту() Экспорт
	ЗаполнитьПолеОтправитьОригиналы = Справочники.Состояния.НайтиПоНаименованию("Повторно отправить пакет документов клиенту (внесены изменения)");
	Если Не ЗначениеЗаполнено(ЗаполнитьПолеОтправитьОригиналы) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ПовторноОтправитьОригиналыКлиенту";
		СостояниеОбъект.Наименование = "Отправить оригиналы клиенту";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ЗаполнитьПолеОтправитьОригиналы.ИмяПредопределенныхДанных = "ПовторноОтправитьОригиналыКлиенту" Тогда
		СостояниеОбъект = ЗаполнитьПолеОтправитьОригиналы.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ПовторноОтправитьОригиналыКлиенту";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры //Евросиб(ДИТ) Серебреников А.Г. US 107866 ТА 116178 05.08.25 Конец
#КонецОбласти

//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
#Область ОбработчикиПереходаНаВерсию_1_0_0_108
Процедура СоздатьПредопределенныеЭлементыСправочникаНоменклатураРелокацияКонтейнерПорожний() Экспорт
	РелокацияКонтейнерПорожний = Справочники.Номенклатура.НайтиПоНаименованию("РелокацияКонтейнерПорожний");
	Если Не ЗначениеЗаполнено(РелокацияКонтейнерПорожний) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "РелокацияКонтейнерПорожний";
		СостояниеОбъект.Наименование = "РелокацияКонтейнерПорожний";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не РелокацияКонтейнерПорожний.ИмяПредопределенныхДанных = "РелокацияКонтейнерПорожний" Тогда
		СостояниеОбъект = РелокацияКонтейнерПорожний.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "РелокацияКонтейнерПорожний";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025

//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
#Область ОбработчикиПереходаНаВерсию_1_0_0_109
Процедура ЗаполнитьГруппуПортыУслугПоставщика() Экспорт

	
	обТЭО = СПравочники.ВидыУслугПоставщиков.Порты.ПолучитьОбъект();

	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	
	Имя		   = "Порты";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Имя = "Терминал";
		НовСтрока.Представление = "Терминал";
	КонецЕсли;
	
	Имя		   = "СпособВводаУчетныхЕдиниц";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Представление = "Способ ввода учетн.ед.";
	КонецЕсли;
	
	
	//ГруппаДанныеПоКонтейнерамВагонам	
	Имя		   = "ГруппаДанныеПоКонтейнерамВагонам";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НЕ НайденныеСтроки.Количество() Тогда
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
		НовСтрока.Представление = "ГруппаДанныеПоКонтейнерамВагонам";
		НовСтрока.Выводить = Истина;
		НовСтрока.ОтображатьВШапке = Ложь;
		НовСтрока.Группировка = "Горизонтальная";
		НовСтрока.ЭтоГруппаЭлементов = Истина; 
		обТЭО.ПоляТаблицыУслуг.Сдвинуть(НовСтрока,-21);
	Иначе
		//НовСтрока = НайденныеСтроки[0];
		//обТЭО.ПоляТаблицыУслуг.Сдвинуть(НовСтрока,-21);	
	КонецЕсли;
	Имя		   = "ГруппаУчЕдНомера";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Родитель = "ГруппаДанныеПоКонтейнерамВагонам";
	КонецЕсли;
	Имя		   = "ГруппаКТКВагонОпСоб";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Родитель = "ГруппаДанныеПоКонтейнерамВагонам";
	КонецЕсли;
	
	Имя		   = "ТипоразмерыВагоновСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП40"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП40");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП60"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП60");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП80"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП80");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,Значение",ИмяТаблицы,Имя,Справочники.ТипоразмерыТС.НайтиПоКоду("ПВ"));
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.СпискиВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ПВ");
	
	//СтоимостьБезНДС	
	Имя		   = "ГруппаОсобыйТемпературныйРежим";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Родитель = "";
	КонецЕсли;
	
	
	//СостояниеГруженыйПорожний	
	Имя		   = "СостояниеГруженыйПорожний";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Имя = "СостоянияГруженыйПорожнийСтрокой";
		НовСтрока.Представление = "Груженый/Порожний";
	КонецЕсли;
	
	//СтоимостьБезНДС	
	Имя		   = "СтоимостьБезНДС";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Представление = "Стоимость услуги/ставки без НДС";
	КонецЕсли;
	
	//СтоимостьБезНДС	
	Имя		   = "СтоимостьСНДС";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Представление = "Стоимость услуги/ставки с НДС";
	КонецЕсли;
	
	
	//СтоимостьБезНДС	
	Имя		   = "ОпасныйСпецГруз";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Представление = "Опасный груз";
	КонецЕсли;
	
	
	
	
	//ТипоразмерыКТК	
	Имя		   = "ТипоразмерыКТК";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Имя = "ТипоразмерыКТКСтрокой";
	КонецЕсли;
	
	
	//СвободныйПериодХранения	
	Имя		   = "СвободныйПериодХранения";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Представление = "Свободный период хранения, сут.";
	КонецЕсли;
	
	
	//ТипоразмерВагонов	
	Имя		   = "ТипоразмерВагонов";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Имя = "ТипоразмерыВагоновСтрокой";
		НовСтрока.Обязательное = Истина;
	КонецЕсли;
	
	//ЖелезнаяДорога	
	Имя		   = "ЖелезнаяДорога";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;	

	НовСтрока.Представление = "Дорога ЖД";
	НовСтрока.Родитель = "ГруппаПортДорогаЖД";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.ОтображатьВШапке = Истина;
	
	//ВидыОтправок	
	Имя		   = "ВидыОтправок";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
		НовСтрока.Имя = "ВидыОтправокСтрокой";
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = "ВидыОтправокСтрокой";
	КонецЕсли;	

	НовСтрока.Представление = "Вид отправки";
	НовСтрока.Родитель = "ГруппаЭкспортИмпорт";
	НовСтрока.Выводить = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяТипа",ИмяТаблицы,Имя,"СправочникСсылка.Локации");
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ОграниченияТипов.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;	
	КонецЕсли;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Терминал);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "ЛокацияОказанияУслуги";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ЗначениеПараметра",ИмяТаблицы,Имя,Справочники.ТипыЛокаций.Порт);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Наименование");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Наименование";
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"НаименованиеАнгл");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "НаименованиеАнгл";
	
	Имя		   = "ЛокацияОказанияУслуги";
	
	СтрктураП = Новый Структура("ИмяТаблицы,Имя,ИмяПоля",ИмяТаблицы,Имя,"Код");
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляПоиска.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	НовСтрока.ИмяПоля = "Код";
	
	
	Имя		   = "ГруппаПеревалка";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "Перевалка";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Группировка = "Горизонтальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	Имя		   = "ГруппаПеревалкаПоПриему";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "По приему";
	НовСтрока.Родитель = "ГруппаПеревалка";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Группировка = "Горизонтальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	Имя		   = "ГруппаПеревалкаПоОтправлению";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;

	НовСтрока.Представление = "По отправлению";
	НовСтрока.Родитель = "ГруппаПеревалка";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Истина;
	НовСтрока.Группировка = "Горизонтальная";
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	
	Имя		   = "ПеревалкаПоПриемуАвто";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоПриему";
	
	Имя		   = "ПеревалкаПоПриемуМоре";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоПриему";
	
	Имя		   = "ПеревалкаПоПриемуСклад";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоПриему";
	
	Имя		   = "ПеревалкаПоПриемуЖД";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоПриему"; 
	
	
	
	Имя		   = "ПеревалкаПоОтправлениюАвто";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоОтправлению";
	
	Имя		   = "ПеревалкаПоОтправлениюМоре";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоОтправлению";
	
	Имя		   = "ПеревалкаПоОтправлениюСклад";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоОтправлению";
	
	Имя		   = "ПеревалкаПоОтправлениюЖД";

	СтрктураП = Новый Структура("ИмяТаблицы,Имя",ИмяТаблицы,Имя);
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(СтрктураП);
	
	Если НайденныеСтроки.Количество() Тогда
		НовСтрока = НайденныеСтроки[0];
	Иначе
		НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.Имя = Имя;
	КонецЕсли;
	
	НовСтрока.Представление = " ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.ЗагружатьИзExcel = Ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Родитель = "ГруппаПеревалкаПоОтправлению";
	
	обТЭО.ОбменДанными.Загрузка = Истина;
	обТЭО.Записать();
		
КонецПроцедуры
#КонецОбласти
//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025

#Область ОбработчикиПереходаНаВерсию_1_0_0_110
Процедура СоздатьПредопределенныеЭлементыСправочникаНоменклатураХранения() Экспорт
	СНХранениеГруженогоКонтейнера = Справочники.Номенклатура.НайтиПоНаименованию("СНХранениеГруженогоКонтейнера");
	Если Не ЗначениеЗаполнено(СНХранениеГруженогоКонтейнера) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СНХранениеГруженогоКонтейнера";
		СостояниеОбъект.Наименование = "СНХранениеГруженогоКонтейнера";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не СНХранениеГруженогоКонтейнера.ИмяПредопределенныхДанных = "СНХранениеГруженогоКонтейнера" Тогда
		СостояниеОбъект = СНХранениеГруженогоКонтейнера.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СНХранениеГруженогоКонтейнера";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
	СНХранениеПорожнегоКонтейнера = Справочники.Номенклатура.НайтиПоНаименованию("СНХранениеПорожнегоКонтейнера");
	Если Не ЗначениеЗаполнено(СНХранениеПорожнегоКонтейнера) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СНХранениеПорожнегоКонтейнера";
		СостояниеОбъект.Наименование = "СНХранениеПорожнегоКонтейнера";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не СНХранениеПорожнегоКонтейнера.ИмяПредопределенныхДанных = "СНХранениеПорожнегоКонтейнера" Тогда
		СостояниеОбъект = СНХранениеПорожнегоКонтейнера.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СНХранениеПорожнегоКонтейнера";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
	ХранениеПортГруженыйКонтейнер = Справочники.Номенклатура.НайтиПоНаименованию("ХранениеПортГруженыйКонтейнер");
	Если Не ЗначениеЗаполнено(ХранениеПортГруженыйКонтейнер) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ХранениеПортГруженыйКонтейнер";
		СостояниеОбъект.Наименование = "ХранениеПортГруженыйКонтейнер";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ХранениеПортГруженыйКонтейнер.ИмяПредопределенныхДанных = "ХранениеПортГруженыйКонтейнер" Тогда
		СостояниеОбъект = ХранениеПортГруженыйКонтейнер.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ХранениеПортГруженыйКонтейнер";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
	ХранениеПортПорожнийКонтейнер = Справочники.Номенклатура.НайтиПоНаименованию("ХранениеПортПорожнийКонтейнер");
	Если Не ЗначениеЗаполнено(ХранениеПортПорожнийКонтейнер) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ХранениеПортПорожнийКонтейнер";
		СостояниеОбъект.Наименование = "ХранениеПортПорожнийКонтейнер";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ХранениеПортПорожнийКонтейнер.ИмяПредопределенныхДанных = "ХранениеПортПорожнийКонтейнер" Тогда
		СостояниеОбъект = ХранениеПортПорожнийКонтейнер.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ХранениеПортПорожнийКонтейнер";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_111
Процедура СоздатьПредопределенныеЭлементыСправочникаНоменклатураТерминальнаяОбработка() Экспорт
	ТерминальнаяОбработкаОтправка = Справочники.Номенклатура.НайтиПоНаименованию("ТерминальнаяОбработкаОтправка");
	Если Не ЗначениеЗаполнено(ТерминальнаяОбработкаОтправка) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаОтправка";
		СостояниеОбъект.Наименование = "ТерминальнаяОбработкаОтправка";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ТерминальнаяОбработкаОтправка.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаОтправка" Тогда
		СостояниеОбъект = ТерминальнаяОбработкаОтправка.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаОтправка";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
	ТерминальнаяОбработкаПриём = Справочники.Номенклатура.НайтиПоНаименованию("ТерминальнаяОбработкаПриём");
	Если Не ЗначениеЗаполнено(ТерминальнаяОбработкаПриём) Тогда
		СостояниеОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаПрием";
		СостояниеОбъект.Наименование = "ТерминальнаяОбработкаПриём";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не ТерминальнаяОбработкаПриём.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаПрием" Тогда
		СостояниеОбъект = ТерминальнаяОбработкаПриём.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "ТерминальнаяОбработкаПрием";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_112
// Евросиб US 114823 TA 116919 Рыбьяков К.А. 18.08.2025 ((
Процедура СоздатьПредопределенныеЭлементыГруппыПользователей() Экспорт
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Группа выдачи контейнеров по запросу ВРП", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ГруппаВыдачиКонтейнеровПоЗапросуВРП";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Записать();
	КонецЕсли;
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Группа оформления релиза", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ГруппаОформленияРелиза";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Записать();
	КонецЕсли;
КонецПроцедуры // Евросиб Рыбьяков К.А. 04.08.2025 ))
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_113
Процедура СоздатьПредопределенныеЭлементыСправочникаСостоянияСозданиеСЗНаКорректировкуРТУПоСНП() Экспорт //Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	СозданиеСЗНаКорректировкуРТУПоСНП = Справочники.Состояния.НайтиПоНаименованию("Создание СЗ на корректировку РТУ по СНП");
	Если Не ЗначениеЗаполнено(СозданиеСЗНаКорректировкуРТУПоСНП) Тогда
		СостояниеОбъект = Справочники.Состояния.СоздатьЭлемент();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СозданиеСЗНаКорректировкуРТУПоСНП";
		СостояниеОбъект.Наименование = "Создание СЗ на корректировку РТУ по СНП";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	ИначеЕсли Не СозданиеСЗНаКорректировкуРТУПоСНП.ИмяПредопределенныхДанных = "СозданиеСЗНаКорректировкуРТУПоСНП" Тогда
		СостояниеОбъект = СозданиеСЗНаКорректировкуРТУПоСНП.ПолучитьОбъект();
		СостояниеОбъект.ИмяПредопределенныхДанных = "СозданиеСЗНаКорректировкуРТУПоСНП";
		СостояниеОбъект.ОбменДанными.Загрузка = Истина;
		СостояниеОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_114
// Евросиб US 82073 TA 114490 Рыбьяков К.А. 02.09.2025 ((
Процедура СоздатьПредопределенныеЭлементыСправочникаГрузы() Экспорт	
	ЭлГруз = Справочники.Грузы.НайтиПоКоду("000005629");
	Если ЗначениеЗаполнено(ЭлГруз) Тогда
		ОбГруз = ЭлГруз.ПолучитьОбъект();
		ОбГруз.ИмяПредопределенныхДанных = "КонтейнерыУниверсальныеПорожниеСобственные";
		ОбГруз.ОбменДанными.Загрузка = Истина;
		ОбГруз.Записать();
	КонецЕсли;
КонецПроцедуры // Евросиб Рыбьяков К.А. 02.09.2025 ))
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_115
//Евросиб Коханенко Н.А. 05.09.2025 (( #118637 
Процедура СоздатьПредопределенныеЭлементыГруппыДКСПолувыгоны() Экспорт
	
	ИмяЭлемента = "Полувагоны";
	ПолноеНаименование = "Дивизион ПВ";

	ЭлементСсылка = Справочники.ГруппыДКС.НайтиПоНаименованию(ИмяЭлемента, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.ПолноеНаименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	Иначе
		ЭлементОбъект = Справочники.ГруппыДКС.СоздатьЭлемент();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ИмяЭлемента;
		ЭлементОбъект.ПолноеНаименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 05.09.2025 )) #118637 
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_116
//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025
Процедура СоздатьПредопределенныеЭлементыГруппыДКСДПРК() Экспорт
	
	ИмяЭлемента = "ДПРК";
	ПолноеНаименование = "Департамент по работе с контейнерами";

	ЭлементСсылка = Справочники.ГруппыДКС.НайтиПоНаименованию(ИмяЭлемента, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.ПолноеНаименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	Иначе
		ЭлементОбъект = Справочники.ГруппыДКС.СоздатьЭлемент();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ИмяЭлемента;
		ЭлементОбъект.ПолноеНаименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры //Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025 
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_117
//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025
Процедура СоздатьПредопределенныеЭлементыГруппПользователейИЗаписиРегистраСведенийДопАналитикиДокументов() Экспорт
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Группа согласующих удаления счета покупателю", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъектР = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъектР.ИмяПредопределенныхДанных = "ГруппаСогласующихУдаленияСчетаПокупателю";
		ГруппаПользователейОбъектР.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъектР.Записать();
	Иначе
		ГруппаПользователейОбъектР = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаПользователейОбъектР.ИмяПредопределенныхДанных = "ГруппаСогласующихУдаленияСчетаПокупателю";
		ГруппаПользователейОбъектР.Наименование = "Группа согласующих удаления счета покупателю";
		ГруппаПользователейОбъектР.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъектР.Записать();	
	КонецЕсли;
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("ДКП. ДКС.", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДКС";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();
	Иначе
		ГруппаПользователейОбъект = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДКС";
		ГруппаПользователейОбъект.Наименование = "ДКП. ДКС.";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();	
	КонецЕсли;
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("ДКП. ДМС.", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДМС";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();
	Иначе
		ГруппаПользователейОбъект = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДМС";
		ГруппаПользователейОбъект.Наименование = "ДКП. ДМС.";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();	
	КонецЕсли;
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("ДКП. ДПРК.", Истина); 
	Если ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъект = ГруппаПользователейСсылка.ПолучитьОбъект();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДПРК";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();
	Иначе
		ГруппаПользователейОбъект = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаПользователейОбъект.ИмяПредопределенныхДанных = "ДКПДПРК";
		ГруппаПользователейОбъект.Наименование = "ДКП. ДПРК.";
		ГруппаПользователейОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъект.Родитель = ГруппаПользователейОбъектР.Ссылка;
		ГруппаПользователейОбъект.Записать();	
	КонецЕсли;
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Страхова Екатерина Георгиевна");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДКС,ПользовательСсылка,"");
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Матюшенко Дарья Геннадьевна");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДКС,ПользовательСсылка,"");
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Масамусенко Евгения Александровна");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДКС,ПользовательСсылка,"");
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Музаффарова Айнура Агамирзаевна");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДКС,ПользовательСсылка,"");
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Харьков Дмитрий Владимирович");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДМС,ПользовательСсылка,"");
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию("Рахманкулова Лия Рашитовна");
	ПользователиСлужебный.ДобавитьПользователяВГруппу(Справочники.ГруппыПользователей.ДКПДПРК,ПользовательСсылка,"");
	
	НовоеСостояние = Справочники.Состояния.НайтиПоНаименованию("Требуется пометка на удаление счета"); 
	Если НовоеСостояние = Справочники.Состояния.ПустаяСсылка() Тогда
		ОбъектНовоеСостояние = Справочники.Состояния.СоздатьЭлемент();
		ОбъектНовоеСостояние.ИмяПредопределенныхДанных	= "ТребуетсяПометкаНаУдалениеСчета";
		ОбъектНовоеСостояние.Наименование 				= "Требуется пометка на удаление счета";
		ОбъектНовоеСостояние.Записать();
	Иначе
		ОбъектНовоеСостояние = НовоеСостояние.ПолучитьОбъект();
		ОбъектНовоеСостояние.ИмяПредопределенныхДанных	= "ТребуетсяПометкаНаУдалениеСчета";
		ОбъектНовоеСостояние.Наименование 				= "Требуется пометка на удаление счета";
		ОбъектНовоеСостояние.Записать();
	КонецЕсли;
	
КонецПроцедуры //Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025 
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_118
Процедура ОбновитьВидУслугПоставщикаФрахт() Экспорт
	ЗаполнитьФрахт();	
КонецПроцедуры

Процедура ЗаполнитьФрахт()
	обФрахт = СПравочники.ВидыУслугПоставщиков.Фрахт.ПолучитьОбъект();
	
	обФрахт.ПоляТаблицыУслуг.Очистить();
	ОбФрахт.СпискиВыбора.Очистить();
	обФрахт.ОграниченияТипов.Очистить();
	обФрахт.ПараметрыВыбора.Очистить();
	ОбФрахт.ПоляПоиска.Очистить();
	ОбФрахт.ПоляСпискаТарифов.Очистить();
	
	ЗаполнитьПоляУслуги(обФрахт);
	
	ЗаполнитьОграниченияТипаФрахт(обФрахт);
	
	ЗаполнитьОтборыФрахт(обФрахт);
	
	ОбФрахт.Записать();
КонецПроцедуры

Процедура ЗаполнитьПоляУслуги(обФрахт)
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	//1
	//Номер строки
	
    //2
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "НаименованиеНоменклатурыПоставщика";
	НовСтрока.Представление = "Номенклатура поставщика";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//3
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Номенклатура";
	НовСтрока.Представление = "Номенклатура системы";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	//4
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ЕдиницаИзмерения";
	НовСтрока.Представление = "Ед. изм.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	
	//5
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Линия";
	НовСтрока.Представление = "Линия";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	
	СоздатьГруппу(обФрахт,"ГруппаПорты","","Вертикальная");
	
	//6
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктОтправления";
	НовСтрока.Представление = "Порт отправления";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаПорты";
	
	//7
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктНазначения";
	НовСтрока.Представление = "Порт назначения";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаПорты";
	
	СоздатьГруппу(обФрахт,"ГруппаТипоразмеровКТКиВагонов","","Вертикальная");
	
	//8
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТипоразмерыКТКСтрокой";
	НовСтрока.Представление = "Тип и размер КТК";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.Родитель = "ГруппаТипоразмеровКТКиВагонов";
	
	//9
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КоличествоКТКВПартии";
	НовСтрока.Представление = "Кол-во КТК в партии";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТипоразмеровКТКиВагонов";
	
	СоздатьГруппу(обФрахт,"ГруппаГружПорож","","Вертикальная");
	
	//10
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПринадлежностьТЕ";
	НовСтрока.Представление = "Принадлежность КТК (COC/SOC)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаГружПорож";
	
	//11
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СостоянияГруженыйПорожнийСтрокой";
	НовСтрока.Представление = "Груженый/Порожний";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаГружПорож";
	
	СоздатьГруппу(обФрахт,"ГруппаУсловияПеревозкиКоносамент","","Вертикальная");
	
	//12
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "УсловияПеревозкиПоОтправлению";
	НовСтрока.Представление = "Условия перевозки (базис)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаУсловияПеревозкиКоносамент";
	
	//13
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Коносамент";
	НовСтрока.Представление = "№ Коносамента";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаУсловияПеревозкиКоносамент";
	
	СоздатьГруппу(обФрахт,"ГруппаСудноРейс","","Вертикальная");
	
	//14
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Судно";
	НовСтрока.Представление = "Судно";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСудноРейс";
	
	//15
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "РейсМоре";
	НовСтрока.Представление = "Рейс";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСудноРейс";
	
	СоздатьГруппу(обФрахт,"ГруппаГрузоотправительГрузополучатель","","Вертикальная");
	
	//16
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Грузоотправитель";
	НовСтрока.Представление = "Грузоотправитель";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаГрузоотправительГрузополучатель";
	
	//17
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Грузополучатель";
	НовСтрока.Представление = "Грузополучатель";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаГрузоотправительГрузополучатель";
	
	СоздатьГруппу(обФрахт,"ГруппаТНВЭД","","Вертикальная");
	
	//18
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КодТНВЭД";
	НовСтрока.Представление = "ТНВЭД";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТНВЭД";
	
	//19
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ГрузТНВЭД";
	НовСтрока.Представление = "Груз по ТНВЭД";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТНВЭД";
	
	СоздатьГруппу(обФрахт,"ГруппаВесРастоможен","","Вертикальная");
	
	//20
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВесГруза";
	НовСтрока.Представление = "Вес груза, кг";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаВесРастоможен";
	
	//21
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ГрузРастаможен";
	НовСтрока.Представление = "Груз растаможен";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаВесРастоможен";
	
	СоздатьГруппу(обФрахт,"ГруппаОпасныйГруз","","Горизонтальная");
	
	//22
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОпасныйСпецГруз";
	НовСтрока.Представление = "Опасный груз";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасныйГруз";
	
	СоздатьГруппу(обФрахт,"ГруппаОпасностьГруза","","Горизонтальная",,"ГруппаОпасныйГруз");

	СоздатьГруппу(обФрахт,"ГруппаОпасностьГрузаВложенная","","Вертикальная",,"ГруппаОпасностьГруза");
	
	//23
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КлассОпасностиГруза";
	НовСтрока.Представление = "Класс опасности груза";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасностьГрузаВложенная";
	
	//24
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтандартОпасностиГруза";
	НовСтрока.Представление = "Стандарт опасности груза";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасностьГрузаВложенная";
	
	СоздатьГруппу(обФрахт,"ГруппаОсобыйТемпературныйРежим","Особый температурный режим","Горизонтальная",Истина);
	
	//25
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОсобыйТемпературныйРежим";
	НовСтрока.Представление = "Особый температурный режим (да/нет)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОсобыйТемпературныйРежим";
	//25-2
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОсобыйТемпературныйРежимЗначение";
	НовСтрока.Представление = "Особый температурный режим (значение)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОсобыйТемпературныйРежим";
	
	//26
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СвободныйПериодХранения";
	НовСтрока.Представление = "Свободный период хранения, сут.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//27
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтавкаПрогрессивная";
	НовСтрока.Представление = "Ставка прогрессивная";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//28
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтоимостьБезНДС";
	НовСтрока.Представление = "Стоимость услуги/ставки без НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	//29
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтоимостьСНДС";
	НовСтрока.Представление = "Стоимость услуги/ставки с НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;

	СоздатьГруппу(обФрахт,"ГруппаВалюта","","Вертикальная");
	
	//30
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Валюта";
	НовСтрока.Представление = "Валюта";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.Родитель = "ГруппаВалюта";
	
	//31
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВариантОпределенияДатыКурсаВалют";
	НовСтрока.Представление = "Курс валюты на дату";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаВалюта";
	
	//32
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтавкаНДС";
	НовСтрока.Представление = "Ставка НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	СоздатьГруппу(обФрахт,"ГруппаДанныеПоКонтейнерамВагонам","ГруппаДанныеПоКонтейнерамВагонам","Вертикальная");
	СоздатьГруппу(обФрахт,"ГруппаУчЕдНомера","","Вертикальная",Ложь,"ГруппаДанныеПоКонтейнерамВагонам");
	
	//33
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СпособВводаУчетныхЕдиниц";
	НовСтрока.Представление = "Способ ввода учетн.ед.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаУчЕдНомера";
	
	//34
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КонтейнерыВагоны";
	НовСтрока.Представление = "Номера КТК/вагонов";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаУчЕдНомера";
	
	//35
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Комментарий";
	НовСтрока.Представление = "Комментарий";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//36
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОкончаниеДействияФакт";
	НовСтрока.Представление = "Окончание действия (факт)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//37
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КритерииСтрокой";
	НовСтрока.Представление = "Созданный тариф";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = ложь;
	
КонецПроцедуры

Процедура СоздатьГруппу(обФрахт,Имя,Представление,Группировка,ОтображатьВШапке = Ложь,Родитель = "")
	
	НовСтрока = обФрахт.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.Представление = Представление;
	НовСтрока.Выводить = Истина;
	НовСтрока.ОтображатьВШапке = ОтображатьВШапке;
	НовСтрока.Группировка = Группировка;
	НовСтрока.ЭтоГруппаЭлементов = Истина;
	НовСтрока.Родитель = Родитель;
	
КонецПроцедуры	

Процедура ЗаполнитьОграниченияТипаФрахт(обФрахт)
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обФрахт.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обФрахт.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
	Имя		   = "ПунктНазначения";

	НовСтрока = обФрахт.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктНазначения";

	НовСтрока = обФрахт.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
КонецПроцедуры

Процедура ЗаполнитьОтборыФрахт(обФрахт)
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обФрахт.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
		
	Имя		   = "ПунктНазначения";

	НовСтрока = обФрахт.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "Судно";

	НовСтрока = обФрахт.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.ТипТС";
	НовСтрока.ЗначениеПараметра = Справочники.ТипоразмерыТС.СудноКонтейнеровоз;
	
	Имя		   = "Коносамент";

	НовСтрока = обФрахт.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.ВидОперации";
	НовСтрока.ЗначениеПараметра = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент;
	
	Имя		   = "Коносамент";

	НовСтрока = обФрахт.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Проведен";
	НовСтрока.ЗначениеПараметра = Истина;
	
КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_119
Процедура ОбновитьВидУслугПоставщикаТЭО() Экспорт
	ЗаполнитьТЭО();	
КонецПроцедуры

Процедура ЗаполнитьТЭО()
	обТЭО = СПравочники.ВидыУслугПоставщиков.ТЭО.ПолучитьОбъект();
	
	сПоиск = Новый Структура("ИмяТаблицы","ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");
	
	НайденныеСтроки = обТЭО.ПоляТаблицыУслуг.НайтиСтроки(сПоиск);
	ТЗВрем = обТЭО.ПоляТаблицыУслуг.Выгрузить(НайденныеСтроки);
	обТЭО.ПоляТаблицыУслуг.Очистить();
	обТЭО.ПоляТаблицыУслуг.Загрузить(ТЗВрем);
	
	НайденныеСтроки = обТЭО.СпискиВыбора.НайтиСтроки(сПоиск);
	ТЗВрем = обТЭО.СпискиВыбора.Выгрузить(НайденныеСтроки);
	обТЭО.СпискиВыбора.Очистить();
	обТЭО.СпискиВыбора.Загрузить(ТЗВрем);
	
	НайденныеСтроки = обТЭО.ОграниченияТипов.НайтиСтроки(сПоиск);
	ТЗВрем = обТЭО.ОграниченияТипов.Выгрузить(НайденныеСтроки);
	обТЭО.ОграниченияТипов.Очистить();
	обТЭО.ОграниченияТипов.Загрузить(ТЗВрем);
	
	НайденныеСтроки = обТЭО.ПараметрыВыбора.НайтиСтроки(сПоиск);
	ТЗВрем = обТЭО.ПараметрыВыбора.Выгрузить(НайденныеСтроки);
	обТЭО.ПараметрыВыбора.Очистить();
	обТЭО.ПараметрыВыбора.Загрузить(ТЗВрем);
	
	НайденныеСтроки = обТЭО.ПоляПоиска.НайтиСтроки(сПоиск);
	ТЗВрем = обТЭО.ПоляПоиска.Выгрузить(НайденныеСтроки);
	обТЭО.ПоляПоиска.Очистить();
	обТЭО.ПоляПоиска.Загрузить(ТЗВрем);
	
	обТЭО.ТипУчетныхЕдиницДетализации = "";
	
	ЗаполнитьПоляУслугиТЭО(обТЭО);
	
	ЗаполнитьОграниченияТипаТЭО(обТЭО);
	
	ЗаполнитьОтборыТЭО(обТЭО);
	
	ЗаполнитьСпискиВыбораТЭО(обТЭО);
	
	обТЭО.Записать();
КонецПроцедуры

Процедура ЗаполнитьПоляУслугиТЭО(обТЭО)
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	
	//1
	//Номер строки
	
    //2
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "НаименованиеНоменклатурыПоставщика";
	НовСтрока.Представление = "Номенклатура поставщика";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	
	//3
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Номенклатура";
	НовСтрока.Представление = "Номенклатура системы";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	//4
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ЕдиницаИзмерения";
	НовСтрока.Представление = "Ед. изм.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Истина;
	
	СоздатьГруппу(обТЭО,"ГруппаТипРазмер","","Вертикальная");
	
	//5
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТипоразмерыКТКСтрокой";
	НовСтрока.Представление = "Тип и размер КТК";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТипРазмер";
	
	//6
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТипоразмерыВагоновСтрокой";
	НовСтрока.Представление = "Тип и размер вагона";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТипРазмер";
	
	//7
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СостоянияГруженыйПорожнийСтрокой";
	НовСтрока.Представление = "Груженый/Порожний";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	
	СоздатьГруппу(обТЭО,"ЛокацияОтправления","Локация отправления","Вертикальная",Истина);
	СоздатьГруппу(обТЭО,"ЛокацияОтправленияГор","Локация отправления","Горизонтальная",Ложь,"ЛокацияОтправления");
	СоздатьГруппу(обТЭО,"ЛокацияОтправленияПунктСтрана","","Вертикальная",Ложь,"ЛокацияОтправленияГор");
	СоздатьГруппу(обТЭО,"ЛокацияОтправленияТерминалПереход","","Вертикальная",Ложь,"ЛокацияОтправленияГор");
	
	//8
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктОтправления";
	НовСтрока.Представление = "Пункт отправления (ЖД ст./Порт/Город)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.Родитель = "ЛокацияОтправленияПунктСтрана";
	
	//9
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктОтправленияСтрана";
	НовСтрока.Представление = "Страна";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияОтправленияПунктСтрана";
	
	//10
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТерминалОтправления";
	НовСтрока.Представление = "Терминал";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияОтправленияТерминалПереход";
	
	//11
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтанцииПогранпереходовОтправления";
	НовСтрока.Представление = "Погран.переход";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияОтправленияТерминалПереход";
	
	СоздатьГруппу(обТЭО,"ЛокацияНазначения","Локация назначения","Вертикальная",Истина);
	СоздатьГруппу(обТЭО,"ЛокацияНазначенияяГор","Локация отправления","Горизонтальная",Ложь,"ЛокацияНазначения");
	СоздатьГруппу(обТЭО,"ЛокацияНазначенияПунктСтрана","","Вертикальная",Ложь,"ЛокацияНазначенияяГор");
	СоздатьГруппу(обТЭО,"ЛокацияНазначенияТерминалПереход","","Вертикальная",Ложь,"ЛокацияНазначенияяГор");
	
	//12
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктНазначения";
	НовСтрока.Представление = "Пункт назначения (ЖД ст./Порт/Город)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.Родитель = "ЛокацияНазначенияПунктСтрана";
	
	//13
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПунктНазначенияСтрана";
	НовСтрока.Представление = "Страна";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияНазначенияПунктСтрана";
	
	//14
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТерминалНазначения";
	НовСтрока.Представление = "Терминал";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияНазначенияТерминалПереход";
	
	//15
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтанцииПогранпереходовНазначение";
	НовСтрока.Представление = "Погран.переход";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛокацияНазначенияТерминалПереход";
	
	СоздатьГруппу(обТЭО,"ОказаниеУслугБондоваяЗона","","Вертикальная");
	
	//16
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ЛокацияОказанияУслуги";
	НовСтрока.Представление = "Локация оказания услуги";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ОказаниеУслугБондоваяЗона";
	
	//17
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "БондоваяЗона";
	НовСтрока.Представление = "Бондовая зона (Да/Нет)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ОказаниеУслугБондоваяЗона";
	
	//18
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВидТранспорта";
	НовСтрока.Представление = "Вид транспорта";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	
	СоздатьГруппу(обТЭО,"ВидОтправкиКоплСтавка","","Вертикальная",Ложь);
	
	//19
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВидыОтправокСтрокой";
	НовСтрока.Представление = "Вид отправки";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ВидОтправкиКоплСтавка";
	
	//20
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ТребуетсяДетализацияКомплекснойСтавки";
	НовСтрока.Представление = "Требуется детализация комплексной ставки";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ВидОтправкиКоплСтавка";
	
	СоздатьГруппу(обТЭО,"ГруппаТНВЭД","","Вертикальная");
	
	//21
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КодТНВЭД";
	НовСтрока.Представление = "ТНВЭД";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТНВЭД";
	
	//22
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ГрузТНВЭД";
	НовСтрока.Представление = "Груз по ТНВЭД";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаТНВЭД";
	
	СоздатьГруппу(обТЭО,"ГруппаЕТСНГ","","Вертикальная");
	
	//23
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ЕТСНГ";
	НовСтрока.Представление = "ЕТСНГ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаЕТСНГ";
	
	//24
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ГрузЕТСНГ";
	НовСтрока.Представление = "Груз по ЕТСНГ";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаЕТСНГ";
	
	СоздатьГруппу(обТЭО,"ГруппаУсловияПеревозкиОсновная","","Горизонтальная");	
	
	//25
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "УсловияИнкотермс";
	НовСтрока.Представление = "Условия Инкотермс";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаУсловияПеревозкиОсновная";
	
	СоздатьГруппу(обТЭО,"УсловияПеревозки","Условия перевозки","Вертикальная",Истина,"ГруппаУсловияПеревозкиОсновная");
	
	//26
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "УсловияПеревозкиПоОтправлению";
	НовСтрока.Представление = "По отправлению";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "УсловияПеревозки";
	
	//27
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "УсловияПеревозкиПоПрибытию";
	НовСтрока.Представление = "По прибытию";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "УсловияПеревозки";
	
	СоздатьГруппу(обТЭО,"ГруппаДанныеЛинии","","Горизонтальная");
	СоздатьГруппу(обТЭО,"ЛинияКонос","","Вертикальная",,"ГруппаДанныеЛинии");
	
	//28
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Линия";
	НовСтрока.Представление = "Линия";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛинияКонос";
	
	//29
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Коносамент";
	НовСтрока.Представление = "№ Коносамента";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ЛинияКонос";
	
	СоздатьГруппу(обТЭО,"СудноРейс","","Вертикальная",,"ГруппаДанныеЛинии");
	
	//30
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Судно";
	НовСтрока.Представление = "Судно";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "СудноРейс";
	
	//31
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "РейсМоре";
	НовСтрока.Представление = "Рейс";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "СудноРейс";
	
	СоздатьГруппу(обТЭО,"ГруппаНормативы","","Горизонтальная");
	СоздатьГруппу(обТЭО,"ГруппаСвободныйПериодХранения1","Свободный период хранения, сут.","Вертикальная",Истина,"ГруппаНормативы");
	
	
	//32
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СвободныйПериодХраненияКТК";
	НовСтрока.Представление = "Для КТК";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСвободныйПериодХранения1";
	
	//33
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СвободныйПериодХраненияВаг";
	НовСтрока.Представление = "Для вагонов";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСвободныйПериодХранения1";
	
	//34
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "НормаПользования";
	НовСтрока.Представление = "Норма пользования, сут.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаНормативы";
	
	СоздатьГруппу(обТЭО,"ВесГрузаГрузРастаможен","","Вертикальная",,"ГруппаНормативы");
	
	//35
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВесГруза";
	НовСтрока.Представление = "Вес груза";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ВесГрузаГрузРастаможен";
	
	//36
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ГрузРастаможен";
	НовСтрока.Представление = "Груз растаможен";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ВесГрузаГрузРастаможен";
	
	СоздатьГруппу(обТЭО,"ГруппаОпасныйГруз","","Горизонтальная");
	
	//37
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОпасныйСпецГруз";
	НовСтрока.Представление = "Опасный груз";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасныйГруз";
	
	СоздатьГруппу(обТЭО,"ГруппаОпасностьГруза","","Горизонтальная",,"ГруппаОпасныйГруз");

	СоздатьГруппу(обТЭО,"ГруппаОпасностьГрузаВложенная","","Вертикальная",,"ГруппаОпасностьГруза");
	
	//38
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КлассОпасностиГруза";
	НовСтрока.Представление = "Класс опасности груза";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасностьГрузаВложенная";
	
	//39
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтандартОпасностиГруза";
	НовСтрока.Представление = "Стандарт опасности груза";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОпасностьГрузаВложенная";
	
	СоздатьГруппу(обТЭО,"ГруппаОсобыйТемпературныйРежим","Особый температурный режим","Горизонтальная",Истина);
	
	//40
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОсобыйТемпературныйРежим";
	НовСтрока.Представление = "Особый температурный режим (да/нет)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОсобыйТемпературныйРежим";
	//40-2
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОсобыйТемпературныйРежимЗначение";
	НовСтрока.Представление = "Особый температурный режим (значение)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаОсобыйТемпературныйРежим";
	
	//41
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтавкаПрогрессивная";
	НовСтрока.Представление = "Ставка прогрессивная";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//42
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтоимостьБезНДС";
	НовСтрока.Представление = "Стоимость услуги/ставки без НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	//43
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтоимостьСНДС";
	НовСтрока.Представление = "Стоимость услуги/ставки с НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;

	СоздатьГруппу(обТЭО,"ГруппаВалюта","","Вертикальная");
	
	//44
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Валюта";
	НовСтрока.Представление = "Валюта";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	НовСтрока.Родитель = "ГруппаВалюта";
	
	//45
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВариантОпределенияДатыКурсаВалют";
	НовСтрока.Представление = "Курс валюты на дату";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаВалюта";
	
	//46
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СтавкаНДС";
	НовСтрока.Представление = "Ставка НДС";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Истина;
	
	СоздатьГруппу(обТЭО,"ГруппаДанныеПоКонтейнерамВагонам",,"Горизонтальная");
	
	СоздатьГруппу(обТЭО,"ГруппаПринадлежностьКТК","","Вертикальная",,"ГруппаДанныеПоКонтейнерамВагонам");
	
	//47
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ПринадлежностьТЕ";
	НовСтрока.Представление = "Принадлежность КТК (COC/SOC)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаПринадлежностьКТК";
	
	//48
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВидСобственности";
	НовСтрока.Представление = "Вид собственности вагона";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаПринадлежностьКТК";
	
	СоздатьГруппу(обТЭО,"ГруппаСпособВвода","","Вертикальная",,"ГруппаДанныеПоКонтейнерамВагонам");
	
	//49
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "СпособВводаУчетныхЕдиниц";
	НовСтрока.Представление = "Способ ввода учетных ед.";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСпособВвода";
	
	//50
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КонтейнерыВагоны";
	НовСтрока.Представление = "Номера КТК/вагонов";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСпособВвода";
	
	СоздатьГруппу(обТЭО,"ГруппаСобственник","","Вертикальная",,"ГруппаДанныеПоКонтейнерамВагонам");
	
	//51
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КТКОпределенногоСобственника";
	НовСтрока.Представление = "КТК определенного собственника";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСобственник";
	
	//52
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ВагонОпределенногоСобственника";
	НовСтрока.Представление = "Вагон определенного собственника";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	НовСтрока.Родитель = "ГруппаСобственник";
	
	//53
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "Комментарий";
	НовСтрока.Представление = "Комментарий";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = Истина;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = Истина;
	НовСтрока.Обязательное = Ложь;
	
	//54
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "ОкончаниеДействияФакт";
	НовСтрока.Представление = "Окончание действия (факт)";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = Ложь;
	
	//55
	НовСтрока = обТЭО.ПоляТаблицыУслуг.Добавить();
	НовСтрока.ИмяТаблицы = ИмяТаблицы;
	НовСтрока.Имя = "КритерииСтрокой";
	НовСтрока.Представление = "Созданный тариф";
	НовСтрока.Выводить = Истина;
	НовСтрока.ЗагружатьИзExcel = ложь;
	НовСтрока.ЗагружатьИзExcelВПростойФорме = ложь;
	НовСтрока.Обязательное = ложь;
КонецПроцедуры

Процедура ЗаполнитьОграниченияТипаТЭО(обТЭО)
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
	Имя		   = "ПунктНазначения";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ПунктНазначения";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Мультилокации";
	
	Имя		   = "ЛокацияОказанияУслуги";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ТерминалОтправления";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "ТерминалНазначения";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "СтанцииПогранпереходовОтправления";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
	Имя		   = "СтанцииПогранпереходовНазначение";

	НовСтрока = обТЭО.ОграниченияТипов.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяТипа = "СправочникСсылка.Локации";
	
КонецПроцедуры

Процедура ЗаполнитьОтборыТЭО(обТЭО)
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
		
	Имя		   = "ПунктНазначения";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Порт;
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
		
	Имя		   = "ПунктНазначения";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
	Имя		   = "ПунктОтправления";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.НаселенныйПункт;
		
	Имя		   = "ПунктНазначения";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.НаселенныйПункт;
	
	
	Имя		   = "Судно";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.ТипТС";
	НовСтрока.ЗначениеПараметра = Справочники.ТипоразмерыТС.СудноКонтейнеровоз;
	
	Имя		   = "Коносамент";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.ВидОперации";
	НовСтрока.ЗначениеПараметра = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент;
	
	Имя		   = "ПунктОтправленияСтрана";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Страна;
	
	Имя		   = "ПунктНазначенияСтрана";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Страна;
	
	Имя		   = "ТерминалОтправления";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "ТерминалНазначения";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.Терминал;
	
	Имя		   = "СтанцииПогранпереходовОтправления";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
	Имя		   = "СтанцииПогранпереходовНазначение";

	НовСтрока = обТЭО.ПараметрыВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;
	НовСтрока.ИмяПараметра = "Отбор.Тип";
	НовСтрока.ЗначениеПараметра = Справочники.ТипыЛокаций.СтанцияЖД;
	
КонецПроцедуры	

Процедура ЗаполнитьСпискиВыбораТЭО(обТЭО)
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	НовСтрока = обТЭО.СпискиВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП40");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	НовСтрока = обТЭО.СпискиВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП60");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	НовСтрока = обТЭО.СпискиВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ФГП80");
	
	Имя		   = "ТипоразмерыВагоновСтрокой";
	
	НовСтрока = обТЭО.СпискиВыбора.Добавить();
	НовСтрока.ИмяТаблицы = "ПСЦПоставщика.Услуги";
	НовСтрока.Имя = Имя;	
	НовСтрока.Значение = Справочники.ТипоразмерыТС.НайтиПоКоду("ПВ");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_120

//Евросиб Каблов 06.11.2025 #107942
Процедура ЗаполнитьСлужебнуюИнформациюДляУчетаПлановыхРасходовПолныйФакт() Экспорт
	
	ДатаНачалаУчетаПлановыхРасходовПолныйФакт = '20251001';
	Константы.ДатаНачалаУчетаПлановыхРасходовПолныйФакт.Установить(ДатаНачалаУчетаПлановыхРасходовПолныйФакт);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_121
//Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025
Процедура СоздатьПредопределенныеЭлементыСостоянияСнятьКопииПТУ() Экспорт
	
	ИмяЭлемента = "ПолучитьОригиналыСнятьПризнакКопияПодготовитьПТУкВыгрузкеВУПП";
	ПолноеНаименование = "Получ.ориг.док., пров. соотв. ориг. копии, снять признак ""копия"". Подготовить ПТУ у выгрузке в УПП";

	ЭлементСсылка = Справочники.Состояния.НайтиПоНаименованию(ПолноеНаименование, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
	ИмяЭлемента = "ПолучитьОригиналыСнятьПризнакКопияПодготовитьКорПТУкВыгрузкеВУПП";
	ПолноеНаименование = "Получ.ориг.док., пров. соотв. ориг. копии, снять признак ""копия"".Подготовить КорПТУ у выгрузке в УПП";

	ЭлементСсылка = Справочники.Состояния.НайтиПоНаименованию(ПолноеНаименование, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
	ИмяЭлемента = "ПолучениеОригиналовДокументовОтНерезидентовПроверитьСнятьПризнакКопия";
	ПолноеНаименование = "Получение оригиналов документов от нерезидентов, проверить, снять признак ""копия""";

	ЭлементСсылка = Справочники.Состояния.НайтиПоНаименованию(ПолноеНаименование, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
	ИмяЭлемента = "ПолучениеОригДокументовОтНерезидентаПровНаСоответствиеОригКопииСнятьПризнакКопия";
	ПолноеНаименование = "Получение ориг. документов от нерезидента, пров. на соответствие ориг. копии, снять признак ""копия""";

	ЭлементСсылка = Справочники.Состояния.НайтиПоНаименованию(ПолноеНаименование, Истина);
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПредопределенныхДанных = ИмяЭлемента;
		ЭлементОбъект.Наименование = ПолноеНаименование;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры //Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025 
#КонецОбласти

#Область ОбработчикиПереходаНаВерсию_1_0_0_122
Процедура УтановитьДатуНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях() Экспорт //Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Константы.ДатаНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях.Установить(Дата(2025,12,4,23,59,59));	
КонецПроцедуры
#КонецОбласти  

#Область ОбработчикиПереходаНаВерсию_1_0_0_123
//Евросиб Коханенко Н.А. 19.12.2025 (( #125251 
Процедура СоздатьПредопределенныйЭлементИсточникиПакетовДанныхПолучениеДанныхГеокодера() Экспорт
	
	НаименованиеЭлемента = "Получение данных геокодера";
	НайденныйЭлемент = Справочники.ИсточникиПакетовДанных.НайтиПоНаименованию(НаименованиеЭлемента); 
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		СостояниеОбъект = НайденныйЭлемент.ПолучитьОбъект();
	Иначе
		СостояниеОбъект = Справочники.ИсточникиПакетовДанных.СоздатьЭлемент();
		СостояниеОбъект.Наименование = НаименованиеЭлемента;
	КонецЕсли;
	
	СостояниеОбъект.ИмяПредопределенныхДанных = "ПолучениеДанныхГеокодера";
	СостояниеОбъект.ОбменДанными.Загрузка = Истина;
	СостояниеОбъект.Записать();

КонецПроцедуры //Евросиб Коханенко Н.А. 19.12.2025 )) #125251
#КонецОбласти 

#Область ОбработчикиПереходаНаВерсию_1_0_0_124

//Евросиб СубботинВ #117990 15.01.2026 Начало
Процедура СоздатьПредопределенныеЭлементыГруппыПользователейГруппыОтветственныхЗаСопровождение() Экспорт
	
	ГруппаПользователейСсылка = Справочники.ГруппыПользователей.НайтиПоНаименованию("Группы ответственных за сопровождение", Истина);
	Если Не ЗначениеЗаполнено(ГруппаПользователейСсылка) Тогда
		ГруппаПользователейОбъектР = Справочники.ГруппыПользователей.СоздатьЭлемент();
		ГруппаПользователейОбъектР.ИмяПредопределенныхДанных = "ГруппыОтветственныхЗаСопровождение";
		ГруппаПользователейОбъектР.Наименование = "Группы ответственных за сопровождение";
		ГруппаПользователейОбъектР.ОбменДанными.Загрузка = Истина;
		ГруппаПользователейОбъектР.Записать();
	КонецЕсли;	

КонецПроцедуры
//Евросиб СубботинВ #117990 15.01.2026 Конец
 #КонецОбласти 
