#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ЗафиксироватьЗапросНомераЗаявки(ПараметрыЗапроса) Экспорт
	
	//Евросиб - АСуслов 28.10.2025 11:19:53 #120720
	//(
	РезультатСтруктура = ПолучитьНомерЗаявкиПоИдентификаторуЗаявкиИКонтрагенту(ПараметрыЗапроса.ИдентификаторЗаявки, ПараметрыЗапроса.Контрагент, ПараметрыЗапроса.ИсточникЗапросаСсылка);
	Если РезультатСтруктура.Успешно
		ИЛИ РезультатСтруктура.ЕстьОшибки Тогда
		Возврат РезультатСтруктура;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 28.10.2025 11:19:55 #120720
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("Успешно", Ложь);
	РезультатСтруктура.Вставить("ГУИД_Заявки", "");
	РезультатСтруктура.Вставить("НомерЗаявки", "");
	РезультатСтруктура.Вставить("ТекстИнформирования", ""); 
	
	
	
	КодовоеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Контрагент, "КодовоеНаименование");
	
	Если НЕ ЗначениеЗаполнено(КодовоеНаименование) Тогда
		РезультатСтруктура.ТекстИнформирования = "Не заполнено <Кодовое наименование> Контрагента";
		Возврат РезультатСтруктура;
	КонецЕсли;
	
	ЗанятыйПорядковыйНомерЗаявки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВнешниеНомераЗаявок.ПорядковыйНомерЗаявки) КАК ПорядковыйНомерЗаявки
		|ИЗ
		|	РегистрСведений.ВнешниеНомераЗаявок КАК ВнешниеНомераЗаявок
		|ГДЕ
		|	ВнешниеНомераЗаявок.Контрагент = &Контрагент
		|	И ВнешниеНомераЗаявок.КодовоеНаименование = &КодовоеНаименование";
	
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса.Контрагент);
	Запрос.УстановитьПараметр("КодовоеНаименование", КодовоеНаименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ПорядковыйНомерЗаявки <> Null Тогда
			ЗанятыйПорядковыйНомерЗаявки = ВыборкаДетальныеЗаписи.ПорядковыйНомерЗаявки;
		КонецЕсли;
	КонецЦикла;
	
	ПорядковыйНомерЗаявки = ЗанятыйПорядковыйНомерЗаявки + 1;
	ГУИД_Заявки = Новый УникальныйИдентификатор;
	ИтоговыйНомерЗаявки = СтрШаблон("%1_%2", КодовоеНаименование, Формат(ПорядковыйНомерЗаявки,"ЧГ=0"));
	
	МенеджерЗаписи = РегистрыСведений.ВнешниеНомераЗаявок.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ГУИД = ГУИД_Заявки;
	МенеджерЗаписи.КодовоеНаименование = КодовоеНаименование;
	МенеджерЗаписи.ПорядковыйНомерЗаявки = ПорядковыйНомерЗаявки;
	МенеджерЗаписи.ИтоговыйНомерЗаявки = ИтоговыйНомерЗаявки;
	МенеджерЗаписи.ИсточникЗапроса = ПараметрыЗапроса.ИсточникЗапросаСсылка;
	МенеджерЗаписи.Контрагент = ПараметрыЗапроса.Контрагент;
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	МенеджерЗаписи.ИдентификаторЗаявкиИсточника = ПараметрыЗапроса.ИдентификаторЗаявки;
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	МенеджерЗаписи.ДатаЗапроса = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
	РезультатСтруктура.ГУИД_Заявки = ГУИД_Заявки;
	РезультатСтруктура.НомерЗаявки = ИтоговыйНомерЗаявки;
	РезультатСтруктура.Успешно = Истина;
	
	Возврат РезультатСтруктура;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ЕстьЗаписиПоКонтрагенту(КонтрагентСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВнешниеНомераЗаявок.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.ВнешниеНомераЗаявок КАК ВнешниеНомераЗаявок
		|ГДЕ
		|	ВнешниеНомераЗаявок.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ПолучитьНомерЗаявкиПоГУИД(ГУИД) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешниеНомераЗаявок.ИтоговыйНомерЗаявки КАК ИтоговыйНомерЗаявки
		|ИЗ
		|	РегистрСведений.ВнешниеНомераЗаявок КАК ВнешниеНомераЗаявок
		|ГДЕ
		|	ВнешниеНомераЗаявок.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ИтоговыйНомерЗаявки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
Функция ПолучитьНомерЗаявкиПоИдентификаторуЗаявкиИКонтрагенту(ИдентификаторЗаявки,КонтрагентСсылка,ИсточникЗапроса) Экспорт
	
	Результат = Неопределено;
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("Успешно", Ложь);
	РезультатСтруктура.Вставить("ЕстьОшибки", Ложь);
	РезультатСтруктура.Вставить("ГУИД_Заявки", "");
	РезультатСтруктура.Вставить("НомерЗаявки", "");
	РезультатСтруктура.Вставить("ТекстИнформирования", "");
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗаявки) Тогда
		Возврат РезультатСтруктура;
	КонецЕсли;	
	//Евросиб - АСуслов 28.10.2025 9:13:02 #120720
	//(
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВнешниеНомераЗаявок.ДатаЗапроса КАК ДатаЗапроса
	|ИЗ
	|	РегистрСведений.ВнешниеНомераЗаявок КАК ВнешниеНомераЗаявок
	|ГДЕ
	|	ВнешниеНомераЗаявок.ИсточникЗапроса = &ИсточникЗапроса
	|	И ВнешниеНомераЗаявок.ДатаЗапроса > &ДатаВремяОграниченияНаВыдачуНомера
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗапроса УБЫВ
	|;
	|
	//)
	//Евросиб - АСуслов 28.10.2025 9:13:31 #120720
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнешниеНомераЗаявок.ГУИД КАК ГУИД_Заявки,
	|	ВнешниеНомераЗаявок.ИтоговыйНомерЗаявки КАК ИтоговыйНомерЗаявки
	|ИЗ
	|	РегистрСведений.ВнешниеНомераЗаявок КАК ВнешниеНомераЗаявок
	|ГДЕ
	|	ВнешниеНомераЗаявок.Контрагент = &Контрагент
	|	И ВнешниеНомераЗаявок.ИдентификаторЗаявкиИсточника = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	
	//Евросиб - АСуслов 28.10.2025 9:13:44 #120720
	//(   
	Запрос.УстановитьПараметр("ДатаВремяОграниченияНаВыдачуНомера",ТекущаяДата() - 60);
	Запрос.УстановитьПараметр("ИсточникЗапроса", ИсточникЗапроса);
	ОграничениеКоличествоНомеровЗаявокВМинуту = Константы.ОграничениеКоличествоНомеровЗаявокВМинуту.Получить();
	Если ОграничениеКоличествоНомеровЗаявокВМинуту > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", СтрШаблон("ПЕРВЫЕ %1", Формат(ОграничениеКоличествоНомеровЗаявокВМинуту,"ЧГ=")));
	КонецЕсли;
	//РезультатЗапроса = Запрос.Выполнить();
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивРезультатовЗапроса[1];
	//)
	//Евросиб - АСуслов 28.10.2025 9:13:46 #120720	
	
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		РезультатСтруктура.ГУИД_Заявки = Выборка.ГУИД_Заявки;
		РезультатСтруктура.НомерЗаявки = Выборка.ИтоговыйНомерЗаявки;
		РезультатСтруктура.Успешно = Истина;
		
	КонецЕсли;
	
	//Евросиб - АСуслов 28.10.2025 9:17:00 #120720
	//(
	Если ОграничениеКоличествоНомеровЗаявокВМинуту > 0 Тогда
		ТаблицаВыданныхНомеров = МассивРезультатовЗапроса[0].Выгрузить();                     
		Если ТаблицаВыданныхНомеров.Количество() = ОграничениеКоличествоНомеровЗаявокВМинуту Тогда                      
			ДатаВремяСнятияОграниченияНаВыдачуНомера = ТаблицаВыданныхНомеров[ОграничениеКоличествоНомеровЗаявокВМинуту-1].ДатаЗапроса + 60;
			РезультатСтруктура.ЕстьОшибки = Истина;
			РезультатСтруктура.ТекстИнформирования = СтрШаблон("Превышено ограничение на количество выданных номеров заявок в минуту (%1). Следующий номер можно получить %2", ОграничениеКоличествоНомеровЗаявокВМинуту, ДатаВремяСнятияОграниченияНаВыдачуНомера);
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 28.10.2025 9:17:05 #120720
	Возврат РезультатСтруктура;
	
КонецФункции
//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти