// + ДИТ Кузнецов Е.Е. 52172 10.10.2022
Функция ПроверитьНеобходимостьЗаписи(ЖдНакладная,Запись) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЖдНакладная",ЖдНакладная);
	СрезПоследних = СрезПоследних(,Отбор);
	
	Если Не СрезПоследних.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтрокаСреза = СрезПоследних[0];
	ЕстьОтличия = Ложь;
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияКомментариевАрмНакладные.Ресурсы Цикл
		Если Ресурс.Имя = "КонтрольУстановил" Тогда
			Продолжить;
		КонецЕсли;
		ЕстьОтличия = СтрокаСреза[Ресурс.Имя] <> Запись[Ресурс.Имя];
		Если ЕстьОтличия Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьОтличия;
	
КонецФункции
// - ДИТ Кузнецов Е.Е. 52172 10.10.2022
