#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, начало
	ОткрытьФорму("ОбщаяФорма.СвязанныеСправочникиДиадок", Новый Структура("ОбъектОтбора", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//Евросиб(ДИТ), Беляев СЮ, BUG 105608 / TA 105638, 15-04-2025, конец
КонецПроцедуры

#КонецОбласти