
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////Евросиб Коханенко Н.А. #61705 09.12.2022 (
	//ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	////Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	Если Параметры.Свойство("СписокКлиентов") Тогда
		Для каждого Клиент из Параметры.СписокКлиентов Цикл
			НоваяСтрока = ЭтотОбъект.СписокКлиентов.Добавить();
			НоваяСтрока.Клиент = Клиент;
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
//&НаКлиенте
//Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
//	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
//КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

&НаКлиенте
Процедура ОК(Команда)
	
	мПустыхКлиентов = СписокКлиентов.НайтиСтроки(Новый Структура("Клиент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")));
	Для каждого стр из мПустыхКлиентов Цикл
		СписокКлиентов.Удалить(Стр);
	КонецЦикла;	
	АдресВХранилище = ПеренестиСервере();
	ЭтаФорма.Закрыть(АдресВХранилище);
КонецПроцедуры

&НаСервере
Функция ПеренестиСервере()
	тзСписокКлиентов = СписокКлиентов.Выгрузить();
	тзСписокКлиентов.Свернуть("Клиент");
	Возврат ПоместитьВоВременноеХранилище(тзСписокКлиентов.ВыгрузитьКолонку("Клиент")); 
КонецФункции	

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура("ТипКонтрагента_Клиент, МножественныйВыбор, ЗакрыватьПриВыборе"
		, Истина, Ложь, Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКлиентов", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора"
		, ПараметрыОтбора
		, Элемент
		, ЭтаФорма.УникальныйИдентификатор,,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКлиентов(Результат, ДополнительныеПараметры = неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	СписокКлиентов.Добавить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКлиентовПодбор(Результат, ДополнительныеПараметры = неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Для каждого стрРезультат из Результат Цикл 
		НоваяСтрока = СписокКлиентов.Добавить();
		Новаястрока.Клиент = СтрРезультат;
	КонецЦикла;	
КонецПроцедуры	


&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыОтбора = Новый Структура("ТипКонтрагента_Клиент, МножественныйВыбор, ЗакрыватьПриВыборе"
		, Истина, Истина, Истина, );

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКлиентовПодбор", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора"
		, ПараметрыОтбора
		, 
		, ЭтаФорма.УникальныйИдентификатор,,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
