
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	СоздатьКалькуляцииНаОснованииРелиза(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКалькуляцииНаОснованииРелиза(ТекущийРелиз)
	
	Если ЕстьНеЗаполненныеСтроки(ТекущийРелиз) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РелизСобственникаСтавкиДоплатныхКТК.НомерСтроки КАК НомерСтроки,
	|	РелизСобственникаСтавкиДоплатныхКТК.ТипКТК.РазмерКТК КАК РазмерКТК,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ставка КАК Ставка,
	|	РелизСобственникаСтавкиДоплатныхКТК.Валюта КАК Валюта,
	|	РелизСобственникаСтавкиДоплатныхКТК.СтокСдачи КАК СтокСдачи,
	|	РелизСобственникаСтавкиДоплатныхКТК.СтавкаНДС КАК СтавкаНДС,
	|	РелизСобственникаСтавкиДоплатныхКТК.НДСвключен КАК НДСвключен,
	|	РелизСобственникаСтавкиДоплатныхКТК.ЛокацияСдачи КАК ЛокацияСдачиИзСтавок,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.Контрагент КАК Контрагент,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.Договор КАК Договор,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.Локация КАК Локация,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.ЛокацияСдачи КАК ЛокацияСдачи,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.НомерДокумента КАК НомерДокумента,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.Организация КАК Организация,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.РелизСобственника.СтавкиДоплатныхКТК КАК РелизСобственникаСтавкиДоплатныхКТК
	|ГДЕ
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка = &Релиз";
	
	Запрос.УстановитьПараметр("Релиз", ТекущийРелиз);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	НомерСтрокиДляСообщения = 0;
	НомераСтрокСКалькуляциями = "";
	
	УбратьИзВыгрузкиПараметрыУжеСозданныхКалькуляций(Выгрузка, ТекущийРелиз, НомераСтрокСКалькуляциями, НомерСтрокиДляСообщения);
	
	НаборКалькуляции = СобратьНаборКалькуляцийДляСоздания(Выгрузка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомераКалькуляций = Новый Массив;
	
	Для Каждого ДанныеКалькуляции Из НаборКалькуляции Цикл
		
		ПараметрыКалькуляции = ОбработатьПодготовленныеСтроки(ДанныеКалькуляции);
		
		СтранаПунктаОтправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыКалькуляции.Локация, "Страна");
		Если ТипЗнч(ПараметрыКалькуляции.ЛокацияСдачиИзСтавок) = Тип("СправочникСсылка.Мультилокации") Тогда
			СтранаПунктаНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыКалькуляции.ЛокацияСдачиИзСтавок.Локации[0].Локация, "Страна");
		Иначе
			СтранаПунктаНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыКалькуляции.ЛокацияСдачиИзСтавок, "Страна");
		КонецЕсли;
		
		ТерриторияМаршрута = ТерриторияМаршрута(СтранаПунктаОтправления, СтранаПунктаНазначения);
		
		НоваяКалькуляция = Документы.Калькуляция.СоздатьДокумент();
		НоваяКалькуляция.Автор = Пользователи.ТекущийПользователь();
		НоваяКалькуляция.Дата = ТекущаяДатаСеанса();
		НоваяКалькуляция.Контрагент = ПараметрыКалькуляции.Контрагент;
		НоваяКалькуляция.Договор = ПараметрыКалькуляции.Договор;
		НоваяКалькуляция.СтавкаНДС = ПараметрыКалькуляции.СтавкаНДС;
		НоваяКалькуляция.СуммаВключаетНДС = ПараметрыКалькуляции.НДСвключен;
		НоваяКалькуляция.ТарифицируемыйРазмерКТК = ПараметрыКалькуляции.РазмерКТК;
		Если ПараметрыКалькуляции.РазмерКТК = "20" Тогда
			НоваяКалькуляция.ММ_Вознаграждение = ПараметрыКалькуляции.Ставка20;
		ИначеЕсли ПараметрыКалькуляции.РазмерКТК = "40" Тогда
			НоваяКалькуляция.ММ_Вознаграждение40 = ПараметрыКалькуляции.Ставка40;
		ИначеЕсли ПараметрыКалькуляции.РазмерКТК = "2040" Тогда
			НоваяКалькуляция.ММ_Вознаграждение = ПараметрыКалькуляции.Ставка20;
			НоваяКалькуляция.ММ_Вознаграждение40 = ПараметрыКалькуляции.Ставка40;
		КонецЕсли;
		НоваяКалькуляция.ТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные;
		НоваяКалькуляция.ОсновнаяУслуга = Справочники.Номенклатура.ТЭУ;
		НоваяКалькуляция.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ктк;
		НоваяКалькуляция.Суша_ПунктОтправления = ПараметрыКалькуляции.Локация;
		НоваяКалькуляция.Суша_ПунктНазначения = ПараметрыКалькуляции.ЛокацияСдачиИзСтавок;
		НоваяКалькуляция.Валюта = ПараметрыКалькуляции.Валюта;
		НоваяКалькуляция.Организация = ПараметрыКалькуляции.Организация;
		НоваяКалькуляция.веб_ДляКТКЕвросиб = Истина;
		НоваяКалькуляция.ТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд;
		НоваяКалькуляция.ЖД_ПринадлежностьПС = Перечисления.ПринадлежностьПС.Собственный;
		НоваяКалькуляция.УсловияПеревозки_Отправление = Перечисления.УсловияПеревозкиКТК.DOOR;
		НоваяКалькуляция.УсловияПеревозки_Прибытие = Перечисления.УсловияПеревозкиКТК.DOOR;
		НоваяКалькуляция.ДатаКурса = ТекущаяДатаСеанса();
		
		ШаблонСообщения = НСтр("ru = 'Релиз %1 %2 %3 %4 %5 %6'");
		ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения, 
			ПараметрыКалькуляции.Номер, 
			ПараметрыКалькуляции.НомерДокумента, 
			?(ПараметрыКалькуляции.РазмерКТК = "2040", "20/40", ПараметрыКалькуляции.РазмерКТК), 
			?(ПараметрыКалькуляции.Ставка20 <> 0, ПараметрыКалькуляции.Ставка20, ""),
			?(ПараметрыКалькуляции.Ставка40 <> 0, ПараметрыКалькуляции.Ставка40, ""),
			ПараметрыКалькуляции.Валюта);
		ТекстКомментария = СтрЗаменить(ТекстКомментария, "  ", " ");
			
		НоваяКалькуляция.Комментарий = ТекстКомментария;
		НоваяКалькуляция.ДокументОснование = ТекущийРелиз;
		
		Для Каждого СтокСдачи Из ПараметрыКалькуляции.СтокиСдачи Цикл
			СтрокаСпискаСтанцийНазначения = НоваяКалькуляция.СписокСтанцийНазначения.Добавить();
			СтрокаСпискаСтанцийНазначения.Станция = СтокСдачи;
		КонецЦикла;
	
		НоваяКалькуляция.ТерриторияМаршрута = ТерриторияМаршрута;
		
		НоваяКалькуляция.ПС_ВидПеревозки = УчетноеНаправлениеВидПеревозки(СтранаПунктаОтправления, СтранаПунктаНазначения);
		НоваяКалькуляция.УчетноеНаправление = УчетноеНаправлениеВидПеревозки(СтранаПунктаОтправления, СтранаПунктаНазначения, Истина);
		
		НоваяКалькуляция.ММ_КалькуляцияЖДСоставляющей.Очистить();
		НоваяКалькуляция.Состояния.Очистить();
		
		ЖД_Себестоимость20 = 0;
		ЖД_Себестоимость40 = 0;
		ММ_СебестоимостьСуши20 = 0;
		ММ_СебестоимостьСуши = 0;
		
		// Пересчет будет необходим только в случае добавления строк в табличную часть ЖД_КалькуляцияСебестоимости
		//КалькуляцииЗаявкиПСЦСервер.РасчитатьСебестоимостьЖД(НоваяКалькуляция, ЖД_Себестоимость20, ЖД_Себестоимость40);
		
		ПараметрыПересчета = Новый Структура;
		ПараметрыПересчета.Вставить("ЖД_Себестоимость20", ЖД_Себестоимость20);
		ПараметрыПересчета.Вставить("ЖД_Себестоимость40", ЖД_Себестоимость40);
		ПараметрыПересчета.Вставить("ММ_СебестоимостьСуши20", ММ_СебестоимостьСуши20);
		ПараметрыПересчета.Вставить("ММ_СебестоимостьСуши", ММ_СебестоимостьСуши);
		Ответ = КалькуляцииЗаявкиПСЦСервер.ПересчитатьРеквизитыИтогов(НоваяКалькуляция, ПараметрыПересчета);
		ЗаполнитьЗначенияСвойств(НоваяКалькуляция, Ответ);
		
		Попытка
			НоваяКалькуляция.Записать(РежимЗаписиДокумента.Проведение);
			НомераКалькуляций.Добавить(НоваяКалькуляция.Номер);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				
			ОбработатьСообщениеОшибки(ПараметрыКалькуляции, ТекущийРелиз);
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НомераСтрокСКалькуляциями <> "" Тогда
		НомераСтрокСКалькуляциями = ОтсортироватьСтрокуЧисел(НомераСтрокСКалькуляциями);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для строк %1 есть подходящие калькуляции.'"), НомераСтрокСКалькуляциями);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, 
			ТекущийРелиз,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.СтавкиДоплатныхКТК", НомерСтрокиДляСообщения, "НомерСтроки"));
	КонецЕсли;
	
	Если НомераКалькуляций.Количество() > 0 Тогда
		Калькуляции = "";
		Для Каждого Номер Из НомераКалькуляций Цикл
			Калькуляции = Калькуляции + "Калькуляция " + Номер + "; ";
		КонецЦикла;
		Калькуляции = Лев(Калькуляции, СтрДлина(Калькуляции) - 2);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Созданы калькуляции: %1.'"), Калькуляции);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНеЗаполненныеСтроки(Релиз)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РелизСобственникаСтавкиДоплатныхКТК.Ставка КАК Ставка,
	|	РелизСобственникаСтавкиДоплатныхКТК.Валюта КАК Валюта,
	|	РелизСобственникаСтавкиДоплатныхКТК.СтавкаНДС КАК СтавкаНДС,
	|	РелизСобственникаСтавкиДоплатныхКТК.НомерСтроки КАК НомерСтроки,
	|	РелизСобственникаСтавкиДоплатныхКТК.СтокСдачи КАК СтокСдачи
	|ИЗ
	|	Документ.РелизСобственника.СтавкиДоплатныхКТК КАК РелизСобственникаСтавкиДоплатныхКТК
	|ГДЕ
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка = &Релиз";
	
	Запрос.УстановитьПараметр("Релиз", Релиз);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокиСОшибкой = Новый Массив;
	
	Результат = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Ставка)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Валюта)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.СтокСдачи)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
			СтрокиСОшибкой.Добавить(Выборка.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиСОшибкой.Количество() > 0 Тогда
		Результат = Истина;
		НомераСтрок = "";
		Для Каждого Номер Из СтрокиСОшибкой Цикл
			НомераСтрок = НомераСтрок + "№" + Номер + ", ";
		КонецЦикла;
		НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1. отсутствуют данные для создания калькуляции. Заполните значения и повторите процесс.'"), НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция УчетноеНаправлениеВидПеревозки(СтранаПунктаОтправления, СтранаПунктаНазначения, УчетноеНаправление = Ложь)
	
	Результат = Неопределено;
	
	СтранаРоссия = Справочники.СтраныМира.Россия;
	
	Если СтранаПунктаОтправления = СтранаРоссия И СтранаПунктаНазначения = СтранаРоссия Тогда
		Если УчетноеНаправление Тогда
			Результат = Справочники.УчетныеНаправления.ВРП;
		Иначе
			Результат = Справочники.ВидыПеревозок.Внутрироссийская;
		КонецЕсли;
	ИначеЕсли СтранаПунктаОтправления = СтранаРоссия И СтранаПунктаНазначения <> СтранаРоссия Тогда
		Если УчетноеНаправление Тогда
			Результат = Справочники.УчетныеНаправления.ЭкспортСухопутный;
		Иначе
			Результат = Справочники.ВидыПеревозок.Экспорт;
		КонецЕсли;
	Иначе
		Если УчетноеНаправление Тогда
			Результат = Справочники.УчетныеНаправления.ИмпортСухопутный;
		Иначе
			Результат = Справочники.ВидыПеревозок.Импорт;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТерриторияМаршрута(СтранаПунктаОтправления, СтранаПунктаНазначения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТерриторииМаршрутаСтраны.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ТерриторииМаршрутаСтраны.НомерСтроки) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоСтрок
	|ИЗ
	|	Справочник.ТерриторииМаршрута.Страны КАК ТерриторииМаршрутаСтраны
	|
	|СГРУППИРОВАТЬ ПО
	|	ТерриторииМаршрутаСтраны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТерриторииМаршрутаСтраны.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Отправления
	|ИЗ
	|	Справочник.ТерриторииМаршрута.Страны КАК ТерриторииМаршрутаСтраны
	|ГДЕ
	|	ТерриторииМаршрутаСтраны.Страна = &СтранаОтправления
	|	И ТерриторииМаршрутаСтраны.НомерСтроки = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТерриторииМаршрутаСтраны.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТерриторииМаршрута.Страны КАК ТерриторииМаршрутаСтраны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСтрок КАК ВТ_КоличествоСтрок
	|		ПО ТерриторииМаршрутаСтраны.Ссылка = ВТ_КоличествоСтрок.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Отправления КАК ВТ_Отправления
	|		ПО ТерриторииМаршрутаСтраны.Ссылка = ВТ_Отправления.Ссылка
	|ГДЕ
	|	ТерриторииМаршрутаСтраны.Страна = &СтранаНазначения
	|	И ТерриторииМаршрутаСтраны.НомерСтроки = ВТ_КоличествоСтрок.Количество
	|	И ВТ_КоличествоСтрок.Количество <= 2
	|	И НЕ ТерриторииМаршрутаСтраны.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СтранаОтправления", СтранаПунктаОтправления);

	Если СтранаПунктаНазначения = Неопределено Тогда
		Запрос.УстановитьПараметр("СтранаНазначения", СтранаПунктаОтправления);
	Иначе
		Запрос.УстановитьПараметр("СтранаНазначения", СтранаПунктаНазначения);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		СозданныйМаршрут = СоздатьТерриториюМаршрута(СтранаПунктаОтправления, СтранаПунктаНазначения);
		Результат = СозданныйМаршрут;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СоздатьТерриториюМаршрута(СтранаОтправления, СтранаНазначения)
	
	НовыйЭлементТерриторияМаршрута = Справочники.ТерриторииМаршрута.СоздатьЭлемент();
	Строка1 = НовыйЭлементТерриторияМаршрута.Страны.Добавить();
	Строка1.Страна = СтранаОтправления;
	
	Если СтранаОтправления <> СтранаНазначения Тогда
		Строка2 = НовыйЭлементТерриторияМаршрута.Страны.Добавить();
		Строка2.Страна = СтранаНазначения;
	КонецЕсли;
	
	НовыйЭлементТерриторияМаршрута.Записать();
	СсылкаСозданногоЭлемента = НовыйЭлементТерриторияМаршрута.Ссылка;
	
	Возврат СсылкаСозданногоЭлемента;
	
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеОшибки(ДополнительныеДанные, РелизСсылка)

	СообщенияИзКалькуляции = ПолучитьСообщенияПользователю(Истина);
	Если СообщенияИзКалькуляции.Количество() > 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для строк %1 калькуляция не создана. По причине: %2'"), 
			ДополнительныеДанные.НомераСтрок, 
			СообщенияИзКалькуляции[0].Текст);
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для строк %1 калькуляция не создана.'"), ДополнительныеДанные.НомераСтрок);
	КонецЕсли;
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, 
		РелизСсылка, 
		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.СтавкиДоплатныхКТК", ДополнительныеДанные.НомерСтрокиДляСообщения, "НомерСтроки"));
	
КонецПроцедуры

&НаСервере
Функция ЕстьПодходящаяКалькуляция(Параметры, Территория, РелизСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО (КалькуляцияСписокСтанцийНазначения.Ссылка = Калькуляция.Ссылка)
	|ГДЕ
	|	Калькуляция.Договор = &Договор
	|	И Калькуляция.Организация = &Организация
	|	И Калькуляция.Контрагент = &Контрагент
	|	И Калькуляция.СтавкаНДС = &СтавкаНДС
	|	И Калькуляция.СуммаВключаетНДС = &СуммаВключаетНДС
	|	И (Калькуляция.Суша_ПунктНазначения = &Суша_ПунктНазначения 
	|		ИЛИ Калькуляция.Суша_ПунктНазначения = Неопределено)
	|	И Калькуляция.Суша_ПунктОтправления = &Суша_ПунктОтправления
	|	И Калькуляция.Валюта = &Валюта
	|	И Калькуляция.ТерриторияМаршрута = &ТерриторияМаршрута
	|	И Калькуляция.ММ_Вознаграждение40 = &ММ_Вознаграждение40
	|	И Калькуляция.ММ_Вознаграждение = &ММ_Вознаграждение
	|	И Калькуляция.ТарифицируемыйРазмерКТК = &РазмерКТК
	|	И Калькуляция.ДокументОснование = &ДокументОснование
	|	И (КалькуляцияСписокСтанцийНазначения.Станция В(&Станция)
	|			ИЛИ КалькуляцияСписокСтанцийНазначения.Ссылка ЕСТЬ NULL)
	|	И Калькуляция.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("ДокументОснование", РелизСсылка);
	Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
	Запрос.УстановитьПараметр("Договор", Параметры.Договор);
	Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("СтавкаНДС", Параметры.СтавкаНДС);
	Запрос.УстановитьПараметр("СуммаВключаетНДС", Параметры.НДСвключен);
	Запрос.УстановитьПараметр("Станция", Параметры.СтокиСдачи);
	Запрос.УстановитьПараметр("РазмерКТК", Параметры.РазмерКТК);
	Запрос.УстановитьПараметр("Суша_ПунктНазначения", Параметры.ЛокацияСдачиИзСтавок);
	Запрос.УстановитьПараметр("Суша_ПунктОтправления", Параметры.Локация);
	Запрос.УстановитьПараметр("ТерриторияМаршрута", Территория);
	Если Параметры.РазмерКТК = "20" Тогда
		Запрос.УстановитьПараметр("ММ_Вознаграждение", Параметры.Ставка20);
		Запрос.УстановитьПараметр("ММ_Вознаграждение40", 0);
	ИначеЕсли Параметры.РазмерКТК = "40" Тогда
		Запрос.УстановитьПараметр("ММ_Вознаграждение", 0);
		Запрос.УстановитьПараметр("ММ_Вознаграждение40", Параметры.Ставка40);
	ИначеЕсли Параметры.РазмерКТК = "2040" Тогда
		Запрос.УстановитьПараметр("ММ_Вознаграждение", Параметры.Ставка20);
		Запрос.УстановитьПараметр("ММ_Вознаграждение40", Параметры.Ставка40);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Ложь;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДополнительныеДанные(Данные, РелизСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РелизСобственникаСтавкиДоплатныхКТК.НомерСтроки КАК НомерСтроки,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ставка КАК Ставка,
	|	ПРЕДСТАВЛЕНИЕ(МАКСИМУМ(РелизСобственникаСтавкиДоплатныхКТК.ТипКТК.РазмерКТК)) КАК ТипКТК
	|ИЗ
	|	Документ.РелизСобственника.СтавкиДоплатныхКТК КАК РелизСобственникаСтавкиДоплатныхКТК
	|ГДЕ
	|	РелизСобственникаСтавкиДоплатныхКТК.Ссылка = &Релиз
	|	И РелизСобственникаСтавкиДоплатныхКТК.СтокСдачи = &СтокСдачи
	|	И РелизСобственникаСтавкиДоплатныхКТК.Валюта = &Валюта
	|	И РелизСобственникаСтавкиДоплатныхКТК.СтавкаНДС = &СтавкаНДС
	|	И РелизСобственникаСтавкиДоплатныхКТК.НДСвключен = &НДСвключен 
	|СГРУППИРОВАТЬ ПО
	|	РелизСобственникаСтавкиДоплатныхКТК.НомерСтроки,
	|	РелизСобственникаСтавкиДоплатныхКТК.Ставка";
	
	Запрос.УстановитьПараметр("Релиз", РелизСсылка);
	Запрос.УстановитьПараметр("Валюта", Данные.Валюта);
	Запрос.УстановитьПараметр("НДСвключен", Данные.НДСвключен);
	Запрос.УстановитьПараметр("СтавкаНДС", Данные.СтавкаНДС);
	Запрос.УстановитьПараметр("СтокСдачи", Данные.СтокСдачи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РезультатСтруктура = Новый Структура;
	
	НомераСтрок = "";
	Пока Выборка.Следующий() Цикл
		Номер = Строка(Выборка.НомерСтроки) + ", ";
		НомераСтрок = НомераСтрок + Номер;
		Если Выборка.ТипКТК = "20" Тогда
			РезультатСтруктура.Вставить("Ставка20", Выборка.Ставка);
			РезультатСтруктура.Вставить("Ставка40", 0);
		КонецЕсли;
		Если Выборка.ТипКТК = "40" Тогда
			РезультатСтруктура.Вставить("Ставка20", 0);
			РезультатСтруктура.Вставить("Ставка40", Выборка.Ставка);
		КонецЕсли;
	КонецЦикла;
	
	РезультатСтруктура.Вставить("НомерСтрокиДляСообщения", Строка(Выборка.НомерСтроки));
	РезультатСтруктура.Вставить("НомераСтрок", НомераСтрок);
	//РезультатСтруктура.Вставить("СтокиСдачи", НомераСтрок);

	Возврат РезультатСтруктура;
	
КонецФункции

&НаСервере
Функция СобратьНаборКалькуляцийДляСоздания(Выгрузка)
	
	МассивКалькуляции = Новый Массив;
	
	Выгрузка.Колонки.Добавить("СтрокаДобавлена", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ПоисковаяСтрока Из Выгрузка Цикл
		
		Калькуляция = Новый Массив;

		Если ПоисковаяСтрока.СтрокаДобавлена Тогда
			Продолжить;
		Иначе
			СтруктураСтроки = СтруктураСтроки();
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ПоисковаяСтрока);
			Калькуляция.Добавить(СтруктураСтроки);
			ПоисковаяСтрока.СтрокаДобавлена = Истина;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("РазмерКТК", ПоисковаяСтрока.РазмерКТК);
		Отбор.Вставить("СтавкаНДС", ПоисковаяСтрока.СтавкаНДС);
		Отбор.Вставить("Валюта", ПоисковаяСтрока.Валюта);
		Отбор.Вставить("ЛокацияСдачиИзСтавок", ПоисковаяСтрока.ЛокацияСдачиИзСтавок);
		Отбор.Вставить("Ставка", ПоисковаяСтрока.Ставка);
		Отбор.Вставить("НДСвключен", ПоисковаяСтрока.НДСвключен);
		
		ПодходятПоРазмеруИКлючевымПараметрам = Выгрузка.НайтиСтроки(Отбор);
		Для Каждого Строка Из ПодходятПоРазмеруИКлючевымПараметрам Цикл
			Если Строка.СтрокаДобавлена Тогда
				Продолжить;
			Иначе
				СтруктураСтроки = СтруктураСтроки();
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
				Калькуляция.Добавить(СтруктураСтроки);
				Строка.СтрокаДобавлена = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Отбор2 = Новый Структура;
		Отбор2.Вставить("СтавкаНДС", ПоисковаяСтрока.СтавкаНДС);
		Отбор2.Вставить("Валюта", ПоисковаяСтрока.Валюта);
		Отбор2.Вставить("НДСвключен", ПоисковаяСтрока.НДСвключен);
		Отбор2.Вставить("ЛокацияСдачиИзСтавок", ПоисковаяСтрока.ЛокацияСдачиИзСтавок);
		Отбор2.Вставить("СтрокаДобавлена", Ложь);
		
		ПодходящаяСтрокаНайдена = Ложь;
		
		ПодходятПоКлючевымПараметрам = Выгрузка.НайтиСтроки(Отбор2);
		Для Каждого Строка Из ПодходятПоКлючевымПараметрам Цикл
			Если ПодходящаяСтрокаНайдена = Ложь Тогда
				Если Строка.РазмерКТК <> ПоисковаяСтрока.РазмерКТК Тогда
					ПодходящаяСтрокаНайдена = Истина;
				Иначе
					Продолжить;
				КонецЕсли;

				СтруктураСтроки = СтруктураСтроки();
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
				Калькуляция.Добавить(СтруктураСтроки);
				Строка.СтрокаДобавлена = Истина;
				
				Отбор3 = Новый Структура;
				Отбор3.Вставить("РазмерКТК", Строка.РазмерКТК);
				Отбор3.Вставить("СтавкаНДС", Строка.СтавкаНДС);
				Отбор3.Вставить("Валюта", Строка.Валюта);
				Отбор3.Вставить("ЛокацияСдачиИзСтавок", ПоисковаяСтрока.ЛокацияСдачиИзСтавок);
				Отбор3.Вставить("Ставка", Строка.Ставка);
				Отбор3.Вставить("НДСвключен", Строка.НДСвключен);
				
				ПодходятПоКлючевымПараметрам2 = Выгрузка.НайтиСтроки(Отбор3);
				Для Каждого Строка Из ПодходятПоКлючевымПараметрам2 Цикл
					Если Строка.СтрокаДобавлена Тогда
						Продолжить;
					Иначе
						СтруктураСтроки = СтруктураСтроки();
						ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
						Калькуляция.Добавить(СтруктураСтроки);
						Строка.СтрокаДобавлена = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		МассивКалькуляции.Добавить(Калькуляция);
	КонецЦикла;
	
	Возврат МассивКалькуляции;
	
КонецФункции

&НаСервере
Функция ОбработатьПодготовленныеСтроки(МассивСтрок)
	
	Результат = Новый Структура;
	Результат.Вставить("НомераСтрок", "");
	Результат.Вставить("НомерСтрокиДляСообщения", "");
	Результат.Вставить("РазмерКТК", "");
	Результат.Вставить("Ставка20", 0);
	Результат.Вставить("Ставка40", 0);
	Результат.Вставить("Валюта", Неопределено);
	Результат.Вставить("СтокиСдачи", Новый Массив);
	Результат.Вставить("СтавкаНДС", Неопределено);
	Результат.Вставить("НДСвключен", Ложь);
	Результат.Вставить("ЛокацияСдачиИзСтавок", Неопределено);
	Результат.Вставить("Контрагент", Неопределено);
	Результат.Вставить("Договор", Неопределено);
	Результат.Вставить("Локация", Неопределено);
	Результат.Вставить("ЛокацияСдачи", Неопределено);
	Результат.Вставить("НомерДокумента", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("Номер", Неопределено);
	
	РазмерыВКалькуляции = Новый ТаблицаЗначений;
	РазмерыВКалькуляции.Колонки.Добавить("РазмерКТК");
	СтокиСдачи = Новый ТаблицаЗначений;
	СтокиСдачи.Колонки.Добавить("СтокСдачи");
	
	КлючевыеПоляЗаполнены = Ложь;
	
	НомераСтрок = "";
	
	Для Каждого Строка Из МассивСтрок Цикл
		Если Не КлючевыеПоляЗаполнены Тогда
			ЗаполнитьЗначенияСвойств(Результат, Строка, , "РазмерКТК");
			КлючевыеПоляЗаполнены = Истина;
		КонецЕсли;
		НомераСтрок = НомераСтрок + Строка(Строка.НомерСтроки) + ", ";
		Результат.НомерСтрокиДляСообщения = Строка(Строка.НомерСтроки);
		НоваяСтрокаРазмер = РазмерыВКалькуляции.Добавить();
		НоваяСтрокаРазмер.РазмерКТК = Строка.РазмерКТК;
		Если Строка.РазмерКТК = Справочники.РазмерыКТК.К20 Тогда
			Результат.Ставка20 = Строка.Ставка;
		Иначе
			Результат.Ставка40 = Строка.Ставка;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.СтокСдачи) Тогда
			НоваяСтрокаСтоки = СтокиСдачи.Добавить();
			НоваяСтрокаСтоки.СтокСдачи = Строка.СтокСдачи;
		КонецЕсли;
	КонецЦикла;
	
	ТарифКалькуляции = "";
	РазмерыВКалькуляции.Свернуть("РазмерКТК");
	Если РазмерыВКалькуляции.Количество() > 1 Тогда
		ТарифКалькуляции = "2040";
	Иначе
		ТарифКалькуляции = Строка(РазмерыВКалькуляции[0].РазмерКТК);
	КонецЕсли;
	Результат.РазмерКТК = ТарифКалькуляции;
	
	СтокиСдачи.Свернуть("СтокСдачи");
	Результат.СтокиСдачи = СтокиСдачи.ВыгрузитьКолонку("СтокСдачи");
	НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
	Результат.НомераСтрок = НомераСтрок;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтруктураСтроки()
	
	Результат = Новый Структура;
	Результат.Вставить("НомерСтроки", "");
	Результат.Вставить("РазмерКТК", Неопределено);
	Результат.Вставить("Ставка", 0);
	Результат.Вставить("Валюта", Неопределено);
	Результат.Вставить("СтокСдачи", Неопределено);
	Результат.Вставить("СтавкаНДС", Неопределено);
	Результат.Вставить("НДСвключен", Ложь);
	Результат.Вставить("ЛокацияСдачиИзСтавок", Неопределено);
	Результат.Вставить("Контрагент", Неопределено);
	Результат.Вставить("Договор", Неопределено);
	Результат.Вставить("Локация", Неопределено);
	Результат.Вставить("ЛокацияСдачи", Неопределено);
	Результат.Вставить("НомерДокумента", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("Номер", Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтсортироватьСтрокуЧисел(Строка)
	
	Подстроки = СтрРазделить(Строка, ", ", Ложь);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Подстроки);
	СписокЗначений.СортироватьПоЗначению();
	Массив = СписокЗначений.ВыгрузитьЗначения(); 
	
	ОбработаннаяСтрока = СтрСоединить(Массив, ", ");
	
	Возврат ОбработаннаяСтрока;
	
КонецФункции

&НаСервере
Процедура УбратьИзВыгрузкиПараметрыУжеСозданныхКалькуляций(Таблица, Релиз, НомераСтрок, НомерСтрокиДляСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Ссылка,
	|	Калькуляция.Валюта КАК Валюта,
	|	Калькуляция.СтавкаНДС КАК СтавкаНДС,
	|	Калькуляция.СуммаВключаетНДС КАК НДСвключен,
	|	Калькуляция.Суша_ПунктОтправления КАК Локация,
	|	Калькуляция.Суша_ПунктНазначения КАК ЛокацияСдачиИзСтавок,
	|	КалькуляцияСписокСтанцийНазначения.Станция КАК СтокСдачи,
	|	Калькуляция.ММ_Вознаграждение КАК ММ_Вознаграждение,
	|	Калькуляция.ММ_Вознаграждение40 КАК ММ_Вознаграждение40,
	|	Калькуляция.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
	|	Калькуляция.Договор КАК Договор,
	|	Калькуляция.Контрагент КАК Контрагент,
	|	Калькуляция.Организация КАК Организация
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО Калькуляция.Ссылка = КалькуляцияСписокСтанцийНазначения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
	|		ПО Калькуляция.Ссылка = КалькуляцияСписокСтанцийОтправления.Ссылка
	|ГДЕ
	|	Калькуляция.ДокументОснование = &Релиз
	|	И НЕ Калькуляция.ПометкаУдаления";

	Запрос.УстановитьПараметр("Релиз", Релиз);
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	ТаблицаОтбора = Таблица.Скопировать();
	ТаблицаОтбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТарифицируемыйРазмерКТК = "2040" Тогда
			НоваяСтрока = ТаблицаОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Ставка = Выборка.ММ_Вознаграждение;
			НоваяСтрока.РазмерКТК = Справочники.РазмерыКТК.К20;
			
			НоваяСтрока2 = ТаблицаОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока2, Выборка);
			НоваяСтрока2.Ставка = Выборка.ММ_Вознаграждение40;
			НоваяСтрока2.РазмерКТК = Справочники.РазмерыКТК.К40;
		ИначеЕсли Выборка.ТарифицируемыйРазмерКТК = "20" Тогда
			НоваяСтрока = ТаблицаОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Ставка = Выборка.ММ_Вознаграждение;
			НоваяСтрока.РазмерКТК = Справочники.РазмерыКТК.К20;
		ИначеЕсли Выборка.ТарифицируемыйРазмерКТК = "40" Тогда
			НоваяСтрока = ТаблицаОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Ставка = Выборка.ММ_Вознаграждение40;
			НоваяСтрока.РазмерКТК = Справочники.РазмерыКТК.К40;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаОтбора Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Валюта", Строка.Валюта);
		Отбор.Вставить("СтавкаНДС", Строка.СтавкаНДС);
		Отбор.Вставить("НДСВключен", Строка.НДСВключен);
		Отбор.Вставить("Локация", Строка.Локация);
		Отбор.Вставить("ЛокацияСдачиИзСтавок", Строка.ЛокацияСдачиИзСтавок);
		Отбор.Вставить("СтокСдачи", Строка.СтокСдачи);
		Отбор.Вставить("Ставка", Строка.Ставка);
		Отбор.Вставить("Договор", Строка.Договор);
		Отбор.Вставить("Контрагент", Строка.Контрагент);
		Отбор.Вставить("Организация", Строка.Организация);
		Отбор.Вставить("РазмерКТК", Строка.РазмерКТК);
		
		НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			НомерСтрокиДляСообщения = ?(СтрокаТаблицы.НомерСтроки > НомерСтрокиДляСообщения, СтрокаТаблицы.НомерСтроки, НомерСтрокиДляСообщения);
			НомераСтрок = НомераСтрок + Строка(СтрокаТаблицы.НомерСтроки) + ", ";
			Таблица.Удалить(СтрокаТаблицы);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти