
&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	МЗ = РегистрыСведений.Рецензирование.СоздатьМенеджерЗаписи();
	МЗ.ИсходныйТекст = ИсходныйТекст;
	МЗ.Комментарии = Комментарий;
	МЗ.НоваяРедакция = НоваяРедакция;
	МЗ.Рецензент = пользователи.ТекущийПользователь();
	МЗ.РецензОбъект = РецензОбъект;
	МЗ.ТаймШтамп = ТекущаяДата();
	МЗ.СогласованнаяРедакция = СогласованнаяРедакция;
	МЗ.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РецензОбъект = Параметры.РецензОбъект;
	ИсходныйТекст = Параметры.ИсходныйТекст;
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура СогласованнаяРедакцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СВ = Новый СписокЗначений;
	СВ.Добавить("Редакция Евросиб");
	СВ.Добавить("Редакция Клиента");
	ОпОп = новый ОписаниеОповещения("ОбработкаВыбораВариантаРедакции", ЭтаФорма);
	ПоказатьВыборИзСписка(ОпОп, СВ, Элементы.СогласованнаяРедакция);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаРедакции(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		СогласованнаяРедакция = П1.Значение;
	КонецЕсли;
	
КонецПроцедуры
