// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	ДвиженияЗаПериод.Параметры.УстановитьЗначениеПараметра("Документ", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	Доход = Объект.ОбщийДоход - Объект.ОбщийРасход;
	
	ПериодБлокировки = Формат(Объект.ПериодБлокировки, "ДФ='ММММ гггг'");
	
	ДвиженияЗаПериод.Параметры.УстановитьЗначениеПараметра("Документ", Объект.Ссылка);
	
	//Евросиб Каблов 09.06.2021 ( 29035
	Элементы.ВключитьРассылку.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
	//Евросиб Каблов 09.06.2021 ) 
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентныеОперации(Команда)
	
	Объект.ДвиженияПериода.Очистить();
	
	ЗапуститьРегламентныеОперацииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьРегламентныеОперацииСервер()

	НЗ = РегистрыСведений.ТЧ_Движения_ЗакрытиеПериода.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	НЗ.Прочитать();
	
	ДвиженияПериода = НЗ.Выгрузить();
	ДвиженияПериода.Свернуть("Контрагент");
	
	Для каждого Стр из Объект.РеглОперации Цикл
		
		Если НЕ Стр.Выполнена И Стр.КодОперации = "01" Тогда
			СписокАктивныхТекДок = Новый Массив;
			Для каждого Стр8 из ДвиженияПериода Цикл
				СписокАктивныхТекДок.Добавить(Стр8.Контрагент);
			КонецЦикла;
			Стр.РезультатВыполнения = СнятьСМониторингаНеактивныхКонтрагентов(СписокАктивныхТекДок, Объект.ПериодБлокировки, Объект.Ссылка);
			Стр.ДатаВыполнения = текущаядата();
			Стр.Выполнена = Истина;
		КонецЕсли;

		Если НЕ Стр.Выполнена И Стр.КодОперации = "02" Тогда
			СписокАктивныхТекДок = Новый Массив;
			Для каждого Стр8 из ДвиженияПериода Цикл
				СписокАктивныхТекДок.Добавить(Стр8.Контрагент);
			КонецЦикла;
			Стр.РезультатВыполнения = ПостановкаНаМониторинг(СписокАктивныхТекДок);
			Стр.ДатаВыполнения = текущаядата();
			Стр.Выполнена = Истина;
		КонецЕсли;
		
		Если НЕ Стр.Выполнена И Стр.КодОперации = "03" Тогда
			Стр.РезультатВыполнения = ОбновлениеИндексаСпаркПоКонтрагентамНаМониторинге();
			Стр.ДатаВыполнения = текущаядата();
			Стр.Выполнена = Истина;
		КонецЕсли;
			
		//Если НЕ Стр.Выполнена И Стр.КодОперации = "04" Тогда
		//	Стр.РезультатВыполнения = ОтнесениеВСтопЛистПокупателейСЗадолженностью();
		//	Стр.ДатаВыполнения = текущаядата();
		//	Стр.Выполнена = Истина;
		//КонецЕсли;
		
		//Евросиб Каблов 26.02.2020 ( Ticket#0182095
		Если НЕ Стр.Выполнена И Стр.КодОперации = "05" Тогда
			ПериодРасчета = ДобавитьМесяц(Объект.ПериодБлокировки, 1);
			КонтрагентыДоговоры_сервер.РассчитатьПлановуюКатегориюКонтрагентов(ПериодРасчета);
			Стр.ДатаВыполнения = текущаядата();
			Стр.Выполнена = Истина;
		КонецЕсли;
		//Евросиб Каблов 26.02.2020 )
			
	КонецЦикла;

КонецПроцедуры
 

// Блок описания регламентных операций периода выполненных объемов

&НаСервереБезКонтекста
Функция ОтнесениеВСтопЛистПокупателейСЗадолженностью()
	
	СрокДляБана = Константы.СрокЗадолженностиДляОтнесенияПокупателяВСтопЛист.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор КАК Договор,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю КАК СчетПокупателю,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК НеразнесеннаяСуммаОстаток,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты КАК СрокОплаты,
	               |	РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) КАК ПрошлоВремени,
	               |	ВЫБОР
	               |		КОГДА РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты > РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ)
	               |			ТОГДА 0
	               |		ИНАЧЕ РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) - РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты
	               |	КОНЕЦ КАК ПросрочкаПлатежа,
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор.Номер КАК НомерДоговора
	               |ИЗ
	               |	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтопЛистКонтрагентов.СрезПоследних КАК СтопЛистКонтрагентовСрезПоследних
	               |		ПО РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент = СтопЛистКонтрагентовСрезПоследних.Контрагент";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	МассивЗаблокированныхКлиентов = Новый Массив;
	СписокПричин = "";
	КоличествоКонтрагентов = 0;
	СписокКонтрагентов = "";
	Пока Ответ.Следующий() Цикл
		Если МассивЗаблокированныхКлиентов.Найти(Ответ.Контрагент) = неопределено И Ответ.ПросрочкаПлатежа > 0 И Ответ.ВСтопЛисте <> Истина Тогда
			
			Причина = "Просрочка оплаты на сумму " + Ответ.НеразнесеннаяСуммаОстаток + " по договору " + Ответ.НомерДоговора + " на дней " + Ответ.ПросрочкаПлатежа;
			
			МЗ = РегистрыСведений.СтопЛистКонтрагентов.СоздатьМенеджерЗаписи();
			МЗ.ВСтопЛисте = Истина;
			МЗ.Комментарий = "Отнесено автоматически при закрытии периода выполненных объемов " + ТекущаяДата() + " " + Причина;
			МЗ.Пользователь = Пользователи.ТекущийПользователь();
			МЗ.Период = ТекущаяДата();
			МЗ.Контрагент = Ответ.Контрагент;
			МЗ.Записать(Истина);
			
			КоличествоКонтрагентов = КоличествоКонтрагентов + 1;
			СписокКонтрагентов = СписокКонтрагентов + ", " + Ответ.Контрагент;
			СписокПричин = СписокПричин + ", " + Причина;
			МассивЗаблокированныхКлиентов.Добавить(Ответ.Контрагент);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат "Заблокировано: " + КоличествоКонтрагентов + " список: " + СписокКонтрагентов + " причины: " + СписокПричин;
	
КонецФункции

&НаСервереБезКонтекста
Функция СнятьСМониторингаНеактивныхКонтрагентов(ТекАктивные, Период, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ПометкаУдаления
	               |	И НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.СПАРК_Мониторинг
	               |	И НЕ Контрагенты.Ссылка В (&АктивныеСейчас)
	               |	И НЕ Контрагенты.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ЗакрытиеПериодаДвиженияПериода.Контрагент КАК Контрагент
	               |				ИЗ
	               |					ТЧ_Движения_ЗакрытиеПериода КАК ЗакрытиеПериодаДвиженияПериода
	               |				ГДЕ
	               |					ЗакрытиеПериодаДвиженияПериода.Документ.Проведен
	               |					И ЗакрытиеПериодаДвиженияПериода.Документ.ПериодБлокировки МЕЖДУ &Период1 И &Период2
	               |					И ЗакрытиеПериодаДвиженияПериода.Документ = &ТекДок
	               |				СГРУППИРОВАТЬ ПО
	               |					ЗакрытиеПериодаДвиженияПериода.Контрагент)";
	Запрос.УстановитьПараметр("АктивныеСейчас", ТекАктивные);
	Запрос.УстановитьПараметр("ТекДок", Ссылка);
	//Евросиб Каблов М.Б. 29.10.2019 (
	//Запрос.УстановитьПараметр("Период1", Период - Константы.СрокМесяцевСнятияКонтрагентовСМониторинга.Получить()*31*24*3600);
	СрокМесяцевСнятияСМониторинга = Константы.СрокМесяцевСнятияКонтрагентовСМониторинга.Получить();
	Запрос.УстановитьПараметр("Период1", ДобавитьМесяц(Период, -СрокМесяцевСнятияСМониторинга));
	//Евросиб Каблов М.Б. 29.10.2019 )
	Запрос.УстановитьПараметр("Период2", Период);	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСнятых = 0;
	СтрокаСписка = "";
	Пока Ответ.Следующий() Цикл
		КоличествоСнятых = КоличествоСнятых + 1;
		ОО = Ответ.Ссылка.ПолучитьОбъект();
		ОО.СПАРК_Мониторинг = Ложь;
		ОО.Записать();
		СтрокаСписка = СтрокаСписка + ", " + Ответ.Ссылка;
	КонецЦикла;
	
	Возврат "Снято с мониторинга: " + КоличествоСнятых + " " + СтрокаСписка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПостановкаНаМониторинг(ТекАктивные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ПометкаУдаления
	               |	И НЕ Контрагенты.ЭтоГруппа
	               |	И НЕ Контрагенты.СПАРК_Мониторинг
	               |	И Контрагенты.Ссылка В(&АктивныеСейчас)
	               |	И Контрагенты.СтранаРегистрации = &СтранаРегистрацииРоссия";
	Запрос.УстановитьПараметр("АктивныеСейчас", ТекАктивные);
	Запрос.УстановитьПараметр("СтранаРегистрацииРоссия", Справочники.СтраныМира.Россия);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСнятых = 0;
	СтрокаСписка = "";
	Пока Ответ.Следующий() Цикл
		КоличествоСнятых = КоличествоСнятых + 1;
		ОО = Ответ.Ссылка.ПолучитьОбъект();
		ОО.СПАРК_Мониторинг = Истина;
		ОО.Записать();
		СтрокаСписка = СтрокаСписка + ", " + Ответ.Ссылка;
	КонецЦикла;
	
	Возврат "Поставлено на мониторинг: " + КоличествоСнятых + " " + СтрокаСписка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновлениеИндексаСпаркПоКонтрагентамНаМониторинге()
	
	КоличествоУспешных = 0;
	КоличествоНеуспешных = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ПометкаУдаления
	               |	И НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.СПАРК_Мониторинг";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат = СПАРКЗапросыСервер.ОбновитьКонтрагентаСПАРК(Ответ.Ссылка);
		Если Результат = Истина ТОгда
			КоличествоУспешных = КоличествоУспешных + 1;
		Иначе
			КоличествоНеуспешных = КоличествоНеуспешных + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "Успешно: " + КоличествоУспешных + ", не успешно: " + КоличествоНеуспешных;
	
КонецФункции

&НаКлиенте
Процедура ПериодБлокировкиРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ПериодБлокировки = НачалоМесяца(ДобавитьМесяц(Объект.ПериодБлокировки, Направление));
	Модифицированность = Истина;
	
	ПериодБлокировки = Формат(Объект.ПериодБлокировки, "ДФ='ММММ гггг'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗакрытиеПериода(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
