
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Поступление", Поступление);
	Параметры.Свойство("Акцепт", Акцепт);
	
	АдресТаблицыУслуг = Неопределено;
	Если Параметры.Свойство("АдресТаблицыУслуг", АдресТаблицыУслуг) Тогда
		ТаблицаУслуг = ПолучитьИзВременногоХранилища(АдресТаблицыУслуг);
		ЗаполнитьТаблицуУслуг(ТаблицаУслуг);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРейсов, "ПустаяДата", '00010101');
	
	УстановитьОтборыСпискаРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСпискаРейсовПоПериодуОтправления();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АкцептПриИзменении(Элемент)
	
	ЗаполнитьТаблицуУслуг();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов
#КонецОбласти

&НаСервере
Процедура ЗаполнитьТаблицуУслуг(ТаблицаУслугАкцепта = Неопределено)
	
	Если ТаблицаУслугАкцепта = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.Содержание КАК Содержание,
		|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	АкцептУслуги.Рейс КАК Рейс,
		|	АкцептУслуги.ДатаОтправленияКП КАК ДатаОтправленияКП,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ПоступлениеЦена КАК ПоступлениеЦена,
		|	АкцептУслуги.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
		|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
		|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
		|	АкцептУслуги.Неурег КАК Неурег,
		|	АкцептУслуги.НеурегКомментарий КАК НеурегКомментарий,
		|	АкцептУслуги.НеурегПричинаУказаннаяПользователем КАК НеурегПричинаУказаннаяПользователем,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Акцепт);
		Услуги.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Иначе
		
		Услуги.Загрузить(ТаблицаУслугАкцепта);
		
	КонецЕсли;
	
	ТаблицаСтанций = Услуги.Выгрузить(, "СтанцияОтправления");
	ТаблицаСтанций.Свернуть("СтанцияОтправления");
	ОтборСтанцииОтправления.ЗагрузитьЗначения(ТаблицаСтанций.ВыгрузитьКолонку("СтанцияОтправления"));
	
	Если ОтборСтанцииОтправления.Количество() > 0 Тогда
		ИспользоватьОтборСтанцииОтправления = Истина;
	КонецЕсли;
	
	ТаблицаСтанций = Услуги.Выгрузить(, "СтанцияНазначения");
	ТаблицаСтанций.Свернуть("СтанцияНазначения");
	ОтборСтанцииНазначения.ЗагрузитьЗначения(ТаблицаСтанций.ВыгрузитьКолонку("СтанцияНазначения"));
	
	Если ОтборСтанцииНазначения.Количество() > 0 Тогда
		ИспользоватьОтборСтанцииНазначения = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСпискаРейсов()
	
	Если ИспользоватьОтборСтанцииОтправления Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРейсов, "ПунктОтправления", ОтборСтанцииОтправления.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокРейсов, "ПунктОтправления");
	КонецЕсли;
	
	Если ИспользоватьОтборСтанцииНазначения Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРейсов, "ПунктНазначения", ОтборСтанцииНазначения.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокРейсов, "ПунктНазначения");
	КонецЕсли;
	
	ОбновитьПараметрыСпискаРейсов()
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпискаРейсовПоПериодуОтправления(ОбновитьПараметры = Ложь)
	
	УслугиТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если УслугиТекДанные <> Неопределено Тогда
		
		Если ТекДатаОтправленияКП <> УслугиТекДанные.ДатаОтправленияКП Тогда
			ОбновитьПараметры = Истина;
			ТекДатаОтправленияКП = УслугиТекДанные.ДатаОтправленияКП;
		КонецЕсли;
		
		Если ТекСтанцияОтправления <> УслугиТекДанные.СтанцияОтправления Тогда
			ОбновитьПараметры = Истина;
			ТекСтанцияОтправления = УслугиТекДанные.СтанцияОтправления;
		КонецЕсли;
		
		Если ТекСтанцияНазначения <> УслугиТекДанные.СтанцияНазначения Тогда
			ОбновитьПараметры = Истина;
			ТекСтанцияНазначения = УслугиТекДанные.СтанцияНазначения;
		КонецЕсли;
		
	Иначе
		ТекДатаОтправленияКП = Неопределено;
		ТекСтанцияОтправления = Неопределено;
		ТекСтанцияНазначения = Неопределено;
	КонецЕсли;
	
	Если ОбновитьПараметры Тогда		
		ОбновитьПараметрыСпискаРейсов();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыСпискаРейсов()
	
	ПустаяДата = '00010101';
	
	Если ЗначениеЗаполнено(ТекДатаОтправленияКП) Тогда
		
		СекундВСутках = 86400;
		КоличествоСекунд = КоличествоДнейУвеличенияПериодаОтправления * СекундВСутках;
		ДатаНачала = ТекДатаОтправленияКП - КоличествоСекунд;
		ДатаОкончания = КонецДня(ТекДатаОтправленияКП + КоличествоСекунд);
		
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРейсов, "ДатаОтправления", НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРейсов, "ДатаОтправления", КонецПериода, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРейсов, "ДатаНачала", ДатаНачала);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРейсов, "ДатаОкончания", ДатаОкончания);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(РейсыЖД.ДатаОтправления, ДЕНЬ)) КАК ДатаНачала,
		|	NULL КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.РейсыЖД КАК РейсыЖД
		|ГДЕ
		|	НЕ РейсыЖД.ПометкаУдаления
		|	И НЕ РейсыЖД.РейсОтменен
		|	И РейсыЖД.ПунктОтправления В(&ПунктыОтправления)
		|	И РейсыЖД.ПунктНазначения В(&ПунктыНазначения)
		|	И РейсыЖД.ДатаОтправления <= &ТекДатаОтправленияКП
		|	И РейсыЖД.ДатаОтправления <> &ПустаяДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(РейсыЖД.ДатаОтправления, ДЕНЬ))
		|ИЗ
		|	Справочник.РейсыЖД КАК РейсыЖД
		|ГДЕ
		|	НЕ РейсыЖД.ПометкаУдаления
		|	И НЕ РейсыЖД.РейсОтменен
		|	И РейсыЖД.ПунктОтправления В(&ПунктыОтправления)
		|	И РейсыЖД.ПунктНазначения В(&ПунктыНазначения)
		|	И РейсыЖД.ДатаОтправления >= &ТекДатаОтправленияКП
		|	И РейсыЖД.ДатаОтправления <> &ПустаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВТ.ДатаОкончания) КАК ДатаОкончания
		|ИЗ
		|	ВТ КАК ВТ";
		
		Если ЗначениеЗаполнено(ТекСтанцияОтправления) Тогда
			ТекСтанцииОтправления = Новый Массив;
			ТекСтанцииОтправления.Добавить(ТекСтанцияОтправления);
			Запрос.УстановитьПараметр("ПунктыОтправления", ТекСтанцииОтправления);
		ИначеЕсли ИспользоватьОтборСтанцииОтправления Тогда
			Запрос.УстановитьПараметр("ПунктыОтправления", ОтборСтанцииОтправления.ВыгрузитьЗначения());
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РейсыЖД.ПунктОтправления В(&ПунктыОтправления)", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтанцияНазначения) Тогда
			ТекСтанцииНазначения = Новый Массив;
			ТекСтанцииНазначения.Добавить(ТекСтанцияНазначения);
			Запрос.УстановитьПараметр("ПунктыНазначения", ТекСтанцииНазначения);
		ИначеЕсли ИспользоватьОтборСтанцииНазначения Тогда
			Запрос.УстановитьПараметр("ПунктыНазначения", ОтборСтанцииНазначения.ВыгрузитьЗначения());
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РейсыЖД.ПунктНазначения В(&ПунктыНазначения)", "");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТекДатаОтправленияКП", ТекДатаОтправленияКП);
		Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			РазностьДатаНачала = ТекДатаОтправленияКП - Выборка.ДатаНачала;
		Иначе
			РазностьДатаНачала = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			РазностьДатаОкончания = Выборка.ДатаОкончания - ТекДатаОтправленияКП;
		Иначе
			РазностьДатаОкончания = Неопределено;
		КонецЕсли;
		
		Если РазностьДатаНачала <> Неопределено И РазностьДатаОкончания <> Неопределено Тогда
			Если РазностьДатаНачала > РазностьДатаОкончания Тогда
				БлижайшаяДатаНачала = ПустаяДата;
				БлижайшаяДатаОкончания = Выборка.ДатаОкончания;
			ИначеЕсли РазностьДатаНачала < РазностьДатаОкончания Тогда
				БлижайшаяДатаНачала = Выборка.ДатаНачала;
				БлижайшаяДатаОкончания = ПустаяДата;
			Иначе
				БлижайшаяДатаНачала = Выборка.ДатаНачала;
				БлижайшаяДатаОкончания = Выборка.ДатаОкончания;
			КонецЕсли;
		ИначеЕсли РазностьДатаНачала <> Неопределено Тогда
			БлижайшаяДатаНачала = Выборка.ДатаНачала;
			БлижайшаяДатаОкончания = ПустаяДата;
		ИначеЕсли РазностьДатаОкончания <> Неопределено Тогда
			БлижайшаяДатаНачала = ПустаяДата;
			БлижайшаяДатаОкончания = Выборка.ДатаОкончания;
		Иначе
			БлижайшаяДатаНачала = ПустаяДата;
			БлижайшаяДатаОкончания = ПустаяДата;
		КонецЕсли;	
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРейсов, "ДатаНачала", ПустаяДата);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРейсов, "ДатаОкончания", ПустаяДата);
		
		БлижайшаяДатаНачала = ПустаяДата;
		БлижайшаяДатаОкончания = ПустаяДата;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСтанцииОтправленияПриИзменении(Элемент)
	
	УстановитьОтборыСпискаРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСтанцииНазначенияПриИзменении(Элемент)
	
	УстановитьОтборыСпискаРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтанцииОтправленияПриИзменении(Элемент)
	
	УстановитьОтборыСпискаРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтанцииНазначенияПриИзменении(Элемент)
	
	УстановитьОтборыСпискаРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейУвеличенияПериодаОтправленияПриИзменении(Элемент)
	
	УстановитьОтборСпискаРейсовПоПериодуОтправления(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьРейсКлиент()
	
	УслугиТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если УслугиТекДанные <> Неопределено Тогда
		
		Рейс = Элементы.СписокРейсов.ТекущаяСтрока;
		Если Рейс <> Неопределено Тогда			
			УслугиТекДанные.Рейс = Рейс;
			УслугиТекДанные.ПодобранРейс = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьРейс(Команда)
	
	ЗафиксироватьРейсКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРейсовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗафиксироватьРейсКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВАкцепт(Команда)
	
	ПодобранныеРейсы = Новый Массив;
	Для Каждого Стр Из Услуги Цикл
		Если Стр.ПодобранРейс Тогда
			ПодобранныеРейсы.Добавить(Новый Структура("ГУИД, Рейс", Стр.ГУИД, Стр.Рейс));
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ПодобранныеРейсы);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикАктивизацииСтрокиУслуг", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикАктивизацииСтрокиУслуг()
	
	УстановитьОтборСпискаРейсовПоПериодуОтправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиРейсПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ПодобранРейс = Истина;
	КонецЕсли;
	
КонецПроцедуры
