
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ПеренестиВДокумент Тогда
		СтруктураРезультат = Новый Структура("Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,ЭтаФорма);
		
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ПеренестиВДокумент = Ложь;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей");

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


