
&НаКлиенте
Процедура ОК(Команда)
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Клиент",Клиент);
	ПараметрыВыбора.Вставить("Договор",Договор);
	ПараметрыВыбора.Вставить("Калькуляция",Калькуляция);
	Закрыть(ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Договор = ПолучитьДанныеПоДоговору(Клиент);
	Калькуляция = ПолучитьДанныеПоКалькуляции(Клиент,Договор);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоДоговору(Клиент)
	
	ДоговорКлиента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		ДоговорКлиента = ТЗ[0].Ссылка;
	КонецЕсли;
		
	Возврат ДоговорКлиента;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоКалькуляции(Клиент,Договор)
	
	КалькуляцияКлиента = Документы.Калькуляция.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Калькуляция.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Калькуляция КАК Калькуляция
	               |ГДЕ
	               |	Калькуляция.Контрагент = &Контрагент
	               |	И Калькуляция.Договор = &Договор";
	Запрос.УстановитьПараметр("Контрагент",Клиент);
	Запрос.УстановитьПараметр("Договор",Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		КалькуляцияКлиента = ТЗ[0].Ссылка;
	КонецЕсли;
		
	Возврат КалькуляцияКлиента;
	
КонецФункции


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Калькуляция = ПолучитьДанныеПоКалькуляции(Клиент,Договор);
КонецПроцедуры

