Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля = Новый Массив;
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ДатаВходящегоДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерВходящегоДокумента = ?(ЗначениеЗаполнено(Данные.НомерВходящегоДокумента), Данные.НомерВходящегоДокумента, Данные.Номер);
	ДатаВходящегоДокумента = ?(ЗначениеЗаполнено(Данные.ДатаВходящегоДокумента), Данные.ДатаВходящегоДокумента, Данные.Дата);
	
	Представление = "ВСФ " + НомерВходящегоДокумента + " от " + Формат(ДатаВходящегоДокумента, "ДФ='dd.MM.yyyy'");
	
КонецПроцедуры