
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") И ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		Комментарий = "ОТКАЗ";
		Сообщить("На основании отчета о закупках счет-фактура полученный не вводится. Операция отменена.")
	КонецЕсли;
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//	удПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		
		СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДанныеЗаполнения.Ссылка,"СчетФактураПолученный",,);
		Если СчФ = Неопределено 
			ИЛИ Ссылка = СчФ //Гудкова 
			Тогда
			//ЭтотОбъект.Дата = ДанныеЗаполнения.Дата;
			//ЭтотОбъект.Записать();
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
			
		Иначе
			Комментарий = "ОТКАЗ";
			Сообщить("Уже существует счет-фактура, введенный на основании данного документа.");
		КонецЕсли;
//Евросиб (Литвинов 13.05.2021 #30663	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДанныеЗаполнения.ДокументОснование, ЭтотОбъект);
//Евросиб )Литвинов 13.05.2021 #30663	
	КонецЕсли;	                   	
	
	Маршрутизировать = Константы.МаршрутизироватьСФП.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) И ДокументыОснования.Количество() > 0 Тогда
		ДокументОснование = ДокументыОснования[0].ДокументОснование;
	КонецЕсли;

//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			ДатаСФХЖ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДатаСФХЖ");
			Если ДатаСФХЖ >= Дата(2022,1,1) Тогда
				ДатаВходящего = ДатаВходящегоДокумента;//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДатаВходящегоДокумента");
				Разность = (НачалоДня(ДатаВходящего) - НачалоДня(ДатаСФХЖ)) / (24*60*60);
				Если Разность >= 1 И Разность <= 5 Тогда
					Сообщить("Дата счета-фактуры больше даты совершения факта хоз.жизни документа-основания на "+Разность+" дн.");
				ИначеЕсли НЕ Разность = 0 Тогда 
					Отказ = Истина;
					Сообщить("Дата счета-фактуры "+Формат(ДатаВходящего, "ДЛФ=DD")+" и дата совершения факта хоз.жизни в документе-основании "+Формат(ДатаСФХЖ, "ДЛФ=DD")+" не могут отличаться больше, чем на 5 дней в сторону более поздней даты СФ. Проверьте и исправьте Дату совершения факта хоз. жизни в документе-основании.");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
//Евросиб Литвинов) 	

#Область Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ Состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФП(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
#КонецОбласти 	
	
//Евросиб Гудкова( 16.01.2020 
	СФМодифицированДляВыгрузки = Ложь;
	Если Не Ссылка.Пустая() Тогда
		ПрошлаяВыгрузка = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Если ЗначениеЗаполнено(ПрошлаяВыгрузка.Ссылка) Тогда
			СФМодифицированДляВыгрузки = ПроверитьРеквизитыСФПНаИзменение("ВидСчетаФактуры,ДатаИсправления,НомерИсправления,ДатаИсходногоДокумента,НомерИсходногоДокумента,ДатаИсходногоДокумента,НомерИсходногоДокумента,ДатаВходящегоДокумента,НомерВходящегоДокумента,ДоговорКонтрагента,Контрагент,ДокументОснование,ИсправляемыйСчетФактура,Организация,Продавец,СуммаДокумента,СуммаНДСДокумента,СуммаНДСУвеличение,СуммаНДСУменьшение,СуммаУвеличение,СуммаУменьшение",
											"ДокументОснование,НомерИсходногоДокумента,ДатаИсходногоДокумента,НомерИсправленияИсходногоДокумента,ДатаИсправленияИсходногоДокумента,СуммаУвеличение,СуммаУменьшение,СуммаНДСУвеличение,СуммаНДСУменьшение");
			Если СФМодифицированДляВыгрузки Тогда
				ДатаМодификации = ТекущаяДата();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
// Евросиб Гудкова) 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьСФП.Получить();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//<< Евросиб - Витвицкий 23.07.2019
	Если ДополнительныеСвойства.Свойство("СтруктураДанных") Тогда
		ЕСОбменСервер.ЗаписатьСостояниеДокументаВДиадоке(Ссылка, ДополнительныеСвойства.СтруктураДанных.СостояниеДокументооборота, Создано); 
	КонецЕсли;	
	//>> Евросиб - Витвицкий 23.07.2019	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ДокументОснование.Проведен = Ложь Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

//Евросиб Гудкова( 16.01.2020 
Функция ПроверитьРеквизитыСФПНаИзменение(РеквизитыШапки, РеквизитыТЧДокументыОснования) Экспорт

	ДокументИзменен = Ложь;
	МассивШапки = СтрРазделить(РеквизитыШапки, ",", Ложь);
	МассивТЧОснований = СтрРазделить(РеквизитыТЧДокументыОснования, ",", Ложь);
	Для каждого СтрокаШапки Из МассивШапки Цикл
		Если ДокументИзменен Тогда
			Прервать;
		КонецЕсли; 
		ДокументИзменен = ДокументИзменен Или ЭтотОбъект[СтрокаШапки] <> Ссылка[СтрокаШапки];
	КонецЦикла;
	
	Для каждого СтрокаДокОсн Из ДокументыОснования Цикл
		Если ДокументИзменен Тогда
			Прервать;
		КонецЕсли; 
		СтрокаДокОснСохраненная = Ссылка.ДокументыОснования.Найти(СтрокаДокОсн.ДокументОснование, "ДокументОснование");
		Если СтрокаДокОснСохраненная = Неопределено Тогда
			ДокументИзменен = Истина;
			Прервать;
		КонецЕсли; 
		Для каждого КолонкаДокОсн Из МассивТЧОснований Цикл
			Если ДокументИзменен Тогда
				Прервать;
			КонецЕсли; 
			ДокументИзменен = ДокументИзменен Или СтрокаДокОсн[КолонкаДокОсн] <> СтрокаДокОснСохраненная[КолонкаДокОсн];
		КонецЦикла;
	КонецЦикла; 
	
	Возврат ДокументИзменен;

КонецФункции // ПроверитьРеквизитыСФПНаИзменение()
// Евросиб Гудкова) 