
&НаКлиенте
Процедура ЗапроситьДанныеПоКТКВMAERSK(Команда)
	ТЧ.Очистить();
	ЗапроситьДанныеПоКТКВMAERSKНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапроситьДанныеПоКТКВMAERSKНаСервере()
	
	Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_CONT_OR_BILL(Объект.Наименование);
	ЧТДЖ = Новый ЧтениеJSON();
	ЧТДЖ.УстановитьСтроку(Результат);
	РЕЗ = ПрочитатьJSON(ЧТДЖ);
	Для каждого стр из РЕЗ.containers Цикл
		
		НСтр = ТЧ.Добавить();
		НСтр.ПунктОтправленияКод = РЕЗ.origin.geo_site;
		НСтр.ПунктОтправления = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктОтправленияКод);
		НСтр.ПунктНазначенияКод = РЕЗ.destination.geo_site;
		НСтр.ПунктНазначения = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктНазначенияКод);
		НСтр.НомерКТК = стр.container_num;
		НСтр.ТипКТК = стр.container_type;
		НСтр.РазмерКТК = стр.container_size;
		НСтр.ISO = стр.iso_code;
		НСтр.ОжидаемаяДоставка = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(стр.eta_final_delivery, 2);
		НСтр.Статус = стр.status;
		НСтр.ПоследняяОперация = стр.latest.activity;
		НСтр.ДатаПоследнейОперации = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(стр.latest.actual_time, 2);
		НСтр.МестоПоследнейОперацииКод = стр.latest.geo_site;
		НСтр.МестоПоследнейОперации = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(стр.latest.geo_site);
		
		Если НЕ ЗначениеЗаполнено(НСтр.МестоПоследнейОперации) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.МестоПоследнейОперацииКод;
			НЭлемент.Наименование = стр.latest.city;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", стр.latest.country_code);
			НЭлемент.Записать();
			НСтр.МестоПоследнейОперации = НЭлемент.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НСтр.ПунктОтправления) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.ПунктОтправленияКод;
			НЭлемент.Наименование = РЕЗ.origin.terminal;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", РЕЗ.origin.country_code);
			НЭлемент.Записать();
			НСтр.ПунктОтправления = НЭлемент.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НСтр.ПунктНазначения) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.ПунктНазначенияКод;
			НЭлемент.Наименование = РЕЗ.destination.terminal;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", РЕЗ.destination.country_code);
			НЭлемент.Записать();
			НСтр.ПунктНазначения = НЭлемент.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Константы.ИспользоватьАРМКТК.Получить() = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации,
		               |	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК тек_Статус,
		               |	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
		               |	стоки_ТекущиеДанныеСрезПоследних.тек_НаСлежении КАК тек_НаСлежении,
					   //Евросиб Каблов 14.10.2021 ( 39046
		               |	стоки_ТекущиеДанныеСрезПоследних.Инвентаризация КАК Инвентаризация
					   //Евросиб Каблов 14.10.2021 )
		               |ИЗ
		               |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
		Запрос.УстановитьПараметр("КТК", Объект.Ссылка);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			
			ВЭксплуатации = Ответ.тек_ВЭксплуатации;
			ВидСобственности = Ответ.тек_ВидСобственности;
			//ДатаОбновленияСобственности = Ответ.Собств_Период;
			НаСлежении = Ответ.тек_НаСлежении;
			//ДатаОбновленияСлежения = Ответ.Слежение_Период;
			
			//Евросиб Каблов 26.09.2021 ( 39046
			Если ЗначениеЗаполнено(Ответ.Инвентаризация) Тогда
				ДоступноПраво_КонтейнернойГруппы = РольДоступна("арм_ктк_ПраваКонтейнернойГруппы") Или РольДоступна("ПолныеПрава");
				Если Не ДоступноПраво_КонтейнернойГруппы Тогда
					Элементы.ТипТЕ.ТолькоПросмотр = Истина;
				КонецЕсли;
			КонецЕсли;
			//Евросиб Каблов 26.09.2021 )
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Контейнер", Объект.Ссылка);
			Запрос.УстановитьПараметр("ПериодСегодня", ТекущаяДата());
			Запрос.Текст = "ВЫБРАТЬ
			|	ВагоныНаСлеженииСрезПоследних.Период КАК Слежение_Период,
			|	ВагоныНаСлеженииСрезПоследних.НаСлежении КАК НаСлежении,
			|	ПризнакСобственностиВагонаСрезПоследних.Период КАК Собств_Период,
			|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
			|	ПризнакСобственностиВагонаСрезПоследних.ВЭксплуатации КАК ВЭксплуатации
			|ИЗ
			|	РегистрСведений.КонтейнерыНаСлежении.СрезПоследних(&ПериодСегодня, Контейнер = &Контейнер) КАК ВагоныНаСлеженииСрезПоследних
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(&ПериодСегодня, Контейнер = &Контейнер) КАК ПризнакСобственностиВагонаСрезПоследних
			|		ПО ВагоныНаСлеженииСрезПоследних.Контейнер = ПризнакСобственностиВагонаСрезПоследних.Контейнер";
			Ответ = Запрос.Выполнить().Выбрать();
			Если Ответ.Следующий() Тогда
				ВЭксплуатации = Ответ.ВЭксплуатации;
				ВидСобственности = Ответ.ПризнакСобственности;
				ДатаОбновленияСобственности = Ответ.Собств_Период;
				НаСлежении = Ответ.НаСлежении;
				ДатаОбновленияСлежения = Ответ.Слежение_Период;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Параметры.Ключ.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СрокиИспользованияКонтейнеров.ПолучениеКонтейнера КАК ПолучениеКонтейнера,
			|	СрокиИспользованияКонтейнеров.НормативВозвратаВСток КАК НормативВозвратаВСток,
			|	СрокиИспользованияКонтейнеров.ВыдачаКлиенту КАК ВыдачаКлиенту,
			|	СрокиИспользованияКонтейнеров.НормативВозвратаОтКлиента КАК НормативВозвратаОтКлиента,
			|	СрокиИспользованияКонтейнеров.ВозвратОтКлиента КАК ВозвратОтКлиента,
			|	СрокиИспользованияКонтейнеров.ВозвратВСток КАК ВозвратВСток,
			|	СрокиИспользованияКонтейнеров.Клиент КАК Клиент,
			|	СрокиИспользованияКонтейнеров.Договор КАК Договор
			|ИЗ
			|	РегистрСведений.СрокиИспользованияКонтейнеров КАК СрокиИспользованияКонтейнеров
			|ГДЕ
			|	СрокиИспользованияКонтейнеров.Контейнер = &Контейнер
			|ИТОГИ ПО
			|	ПолучениеКонтейнера";
			
			Запрос.УстановитьПараметр("Контейнер", Объект.Ссылка);
			
			ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			ЗначениеВРеквизитФормы(ТЗ, "ДатыВладенияКТК");
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументыКТК.Параметры.УстановитьЗначениеПараметра("Контейнер", Объект.Ссылка);
	СписокРемонтов.Параметры.УстановитьЗначениеПараметра("Контейнер", Объект.Ссылка);
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ПоказатьЗначение(, Элементы.ДокументыКТК.ТекущиеДанные.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьРемонт(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияРемонтов", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.РемонтыКТК.Форма.ФормаЗаписи", Новый Структура("КТК", Объект.Ссылка), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияРемонтов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
КонецПроцедуры

//++ Зубов 0239381 06.08.2021
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Объект.Наименование=""+Объект.Префикс+Объект.Номер+Объект.КонтрольноеЧисло И ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Проверьте правильность заполнения Наименования, Префикса, Номера и Контрольного числа!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
//-- Зубов 0239381 06.08.2021                 

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
&НаКлиенте
Процедура ИспользуетсяВПареСТанкКонтейнеромПриИзменении(Элемент)
	Элементы.ТанкКонтейнер.Видимость = Объект.ИспользуетсяВПареСТанкКонтейнером;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюТанкКонтейнеров();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюТанкКонтейнеров()
	Если Не ЗначениеЗаполнено(Объект.ТипТЕ) Тогда Возврат; КонецЕсли;
	Если Объект.ТипТЕ = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.Тип40DG") Тогда
		Элементы.ИспользуетсяВПареСТанкКонтейнером.Видимость = Истина;
	КонецЕсли;	
	Если Объект.ИспользуетсяВПареСТанкКонтейнером и не Параметры.Ключ.Пустая() Тогда
		Элементы.ТанкКонтейнер.Видимость = Истина;
		ТанкКонтейнер = РефСцепСервер.ПолучитьТанкКонтейнерНаСервере(Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТанкКонтейнерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если не ТанкКонтейнерИзменен Тогда
		ТанкКонтейнерИзменен = ВыбранноеЗначение <> ТанкКонтейнер;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ТанкКонтейнерИзменен
		и ЗначениеЗаполнено(Объект.Ссылка)
		и ЗначениеЗаполнено(ТанкКонтейнер) Тогда
		МенеджерЗаписи 		  		 = РегистрыСведений.СвязиДГКиТанкКонтейнеров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДГК 	  		 = Объект.Ссылка;
		МенеджерЗаписи.Период 		 = Текущаядата();
		МенеджерЗаписи.ТанкКонтейнер = ТанкКонтейнер;
		Попытка
			МенеджерЗаписи.Записать();
		Исключение	
			Сообщить("Ошибка записи Танк-контейнера. Проверьте данные.");
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТипТЕПриИзменении(Элемент)
	УправлениеВидимостьюТанкКонтейнеров();
КонецПроцедуры
// -- Евросиб Дудоров С.В. US 57543 30.01.2023  

// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Начало: 22.11.2024
&НаКлиенте
Процедура ДатаИзготовленияКТКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ВыборПериодаИС",,,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораДаты",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораДаты(ПараметрЗакрытия, ДополнительныеПараметры)Экспорт
	Если НЕ ПараметрЗакрытия = Неопределено Тогда 
		Если ПараметрЗакрытия > ТекущаяДата() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выбор будущих периодов невозможен, выбран текущий период";
			Сообщение.Сообщить();
			Объект.ДатаИзготовленияКТК = ТекущаяДата(); 
		Иначе
			Объект.ДатаИзготовленияКТК = ПараметрЗакрытия;
		КонецЕсли; 		
	КонецЕсли; 
КонецПроцедуры
// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Конец: 22.11.2024
