
//Евросиб Каблов 15.01.2025 #89876 скопировал функцию из формы элемента
Функция ПолучитьИсполнителяЭтапаСЗамечаниями(ДокументСогласования, Состояние) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСогласования, "ПримененныйМаршрут, Дата, ПримененныйМаршрут.НачальныйСтатус, Договор, ВидПеревозки");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МаршрутизацияСостояния.Состояние КАК Состояние,
	|	МаршрутизацияСостояния.Исполнитель КАК Исполнитель,
	|	МаршрутизацияСостояния.Наблюдатель КАК Наблюдатель,
	|	МаршрутизацияСостояния.ПредыдущиеЭтапы КАК ПредыдущиеЭтапы,
	|	МаршрутизацияСостояния.СопровождениеПоДоговору КАК СопровождениеПоДоговору,
	|	МаршрутизацияСостояния.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
	|	МаршрутизацияСостояния.ОтветственныйЗаДоговор КАК ОтветственныйЗаДоговор,
	|	МаршрутизацияСостояния.НормативИсполненияСМоментаСоздания КАК НормативИсполненияСМоментаСоздания,
	|	МаршрутизацияСостояния.ТребуетсяУказатьНаблюдателя КАК ТребуетсяУказатьНаблюдателя,
	|	МаршрутизацияСостояния.ТребуетсяУказатьИсполнителя КАК ТребуетсяУказатьИсполнителя,
	|	МаршрутизацияСостояния.ВидНормативаИсполнения КАК ВидНормативаИсполнения,
	|	МаршрутизацияСостояния.ИсполнительКакРуководительПоНаправлению КАК ИсполнительКакРуководительПоНаправлению,
	|	МаршрутизацияСостояния.НаблюдательКакРуководительПоНаправлению КАК НаблюдательКакРуководительПоНаправлению,
	|	МаршрутизацияСостояния.ОтветственныйМенеджерПСЦ КАК ОтветственныйМенеджерПСЦ,
	|	МаршрутизацияСостояния.РуководительСотрудника КАК РуководительСотрудника,
	|	МаршрутизацияСостояния.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника КАК ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника
	|ИЗ
	|	Справочник.Маршрутизация.Состояния КАК МаршрутизацияСостояния
	|ГДЕ
	|	МаршрутизацияСостояния.Ссылка = &ПримененныйМаршрут
	|	И МаршрутизацияСостояния.Состояние = &Состояние";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПримененныйМаршрут", РеквизитыДокумента.ПримененныйМаршрут);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Стр = Результат.Выбрать();
		Стр.Следующий();
				
		РезультатЗапроса = Новый Массив;
		
		Статус = РеквизитыДокумента.ПримененныйМаршрутНачальныйСтатус;
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, ОтветственныйМенеджерПСЦ, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, РеквизитыДокумента.ПримененныйМаршрут, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.ОтветственныйМенеджерПСЦ, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	
		МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, РеквизитыДокумента.Дата, РеквизитыДокумента.Договор);
		МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, РеквизитыДокумента.Дата, РеквизитыДокумента.ВидПеревозки);
		
		Возврат РезультатЗапроса[0].Исполнитель;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Евросиб Каблов 26.02.2025 #89876 скопировал функцию из формы элемента
Процедура ЗаполнитьТЧСостояния(Объект, ТекЦикл, СброситьПроверку = Ложь) Экспорт
	
	СохранитьОтветИнициатора = СохранитьОтветИнициатора(Объект.ДокументСогласования);
	
	ТЧСост = Объект.ДокументСогласования.Состояния;
	ПерваяСтр = 0;
	Для Каждого Стр Из ТЧСост Цикл
		// добавлять только согласование
		Если Стр.Состояние.Согласование = Истина Тогда
			НовСтр = Объект.Состояния.Добавить();
			ПерваяСтр = ПерваяСтр + 1;
			//++ Зубов 35844 05.08.2021
			//ЗаполнитьЗначенияСвойств(НовСтр,Стр,"Состояние,Исполнитель,Наблюдатель,ПредыдущиеЭтапы,НормативИсполненияСМоментаСоздания");
			// Евросиб US 128174 TA 130483 Рыбьяков К.А. 10.02.2026 ((
			Если СохранитьОтветИнициатора Тогда
				ЗаполнитьЗначенияСвойств(НовСтр,Стр,"Состояние,Исполнитель,Наблюдатель,ПредыдущиеЭтапы,
													|НормативИсполненияСМоментаСоздания,НачалоРаботы,ОтветИнициатора");
			Иначе
				ЗаполнитьЗначенияСвойств(НовСтр,Стр,"Состояние,Исполнитель,Наблюдатель,ПредыдущиеЭтапы,
													|НормативИсполненияСМоментаСоздания,НачалоРаботы,Комментарий");
			КонецЕсли;
			//ЗаполнитьЗначенияСвойств(НовСтр,Стр,"Состояние,Исполнитель,Наблюдатель,ПредыдущиеЭтапы,НормативИсполненияСМоментаСоздания,НачалоРаботы");
			// Евросиб Рыбьяков К.А. 10.02.2026 ))
			//-- Зубов 35844 05.08.2021
			НовСтр.ШагЦикла = ТекЦикл;
			
			// Евросиб US 90342 Рыбьяков К.А. 19.03.2026 ((
			Если ТипЗнч(Объект.ДокументСогласования) = Тип("ДокументСсылка.РеестрПлатежей") Тогда
				
				НовСтр.СтатусСогласования = Перечисления.СтатусыСогласования.Планируется;
				НовСтр.Статус = Перечисления.СтатусыЭтапов.Новый;
				Если ТекЦикл > 1 И Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
					НовыйИсполнитель = ПолучитьИсполнителяЭтапаСЗамечаниями(Объект.ДокументСогласования, Стр.Состояние);
					Если НовыйИсполнитель <> Неопределено Тогда
						НовСтр.Исполнитель = НовыйИсполнитель;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Объект.ДокументСогласования) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
				
				Если Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
					Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями
					Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями
					Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний Тогда
					
					НовСтр.СтатусСогласования = Стр.СтатусСогласования;
					НовСтр.Статус = Стр.Статус;
					НовСтр.Комментарий = Стр.Комментарий;
					
					Если ТекЦикл > 1 Тогда
						НовСтр.ЗавершениеРаботы = Стр.ЗавершениеРаботы;
					КонецЕсли;
				Иначе
					НовСтр.СтатусСогласования = Перечисления.СтатусыСогласования.Планируется;
					НовСтр.Статус = ?(ТекЦикл = 1,Стр.Статус,Перечисления.СтатусыЭтапов.Новый);
					
					Если ТекЦикл > 1 И Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
						НовыйИсполнитель = ПолучитьИсполнителяЭтапаСЗамечаниями(Объект.ДокументСогласования, Стр.Состояние);
						Если НовыйИсполнитель <> Неопределено Тогда
							НовСтр.Исполнитель = НовыйИсполнитель;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			// Евросиб Рыбьяков К.А. 19.03.2026 ))
			//Евросиб СубботинВ #89527 30.10.2024 Начало
			Иначе
			// Евросиб US 90342 Рыбьяков К.А. 19.03.2026 (( закомментировал и перенес выше
			//Если НЕ ТипЗнч(Объект.ДокументСогласования) = Тип("ДокументСсылка.РеестрПлатежей") Тогда 
				//Евросиб СубботинВ #89527 30.10.2024 Конец				
				Если Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
					// Евросиб Фролов (7.02.2022 TASK #46807
					Или Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями Тогда
					// Евросиб Фролов)
					НовСтр.СтатусСогласования = Стр.СтатусСогласования;
					НовСтр.Статус = Стр.Статус;
					
					// Евросиб Фролов (7.02.2022 TASK #46807
					Если Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями Тогда
						НовСтр.Комментарий = Стр.Комментарий;
					КонецЕсли;	
					// Евросиб Фролов)
					
					// Евросиб Фролов (28.02.2022 Task №47911
					// Для задач, которые не требуют повторного исполнения, дата завершения не должна меняться.
					Если ТекЦикл > 1 Тогда
						НовСтр.ЗавершениеРаботы = Стр.ЗавершениеРаботы;
					КонецЕсли;	
					// Евросиб Фролов)
				Иначе
					НовСтр.СтатусСогласования = Перечисления.СтатусыСогласования.Планируется;
					//НовСтр.Статус = Перечисления.СтатусыЭтапов.Новый;
					НовСтр.Статус = ?(ТекЦикл = 1,Стр.Статус,Перечисления.СтатусыЭтапов.Новый);
					
					// Евросиб Фролов (19.01.2022 Ticket№ 0252994
					// "Сброс" исполнителя по этапу с замечаниями(при запуске согласования на новый цикл) на первоначальную группу.
					Если ТекЦикл > 1 И Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
						НовыйИсполнитель = ПолучитьИсполнителяЭтапаСЗамечаниями(Объект.ДокументСогласования, Стр.Состояние);
						Если НовыйИсполнитель <> Неопределено Тогда
							НовСтр.Исполнитель = НовыйИсполнитель;
						КонецЕсли;	
					КонецЕсли;	
					// Евросиб Фролов)
					
				КонецЕсли;				
				
			// Евросиб US 90342 Рыбьяков К.А. 19.03.2026 (( закомментировал и перенес выше
			//Евросиб СубботинВ #89527 30.10.2024 Начало
			//Иначе
			//	НовСтр.СтатусСогласования = Перечисления.СтатусыСогласования.Планируется;
			//	НовСтр.Статус = Перечисления.СтатусыЭтапов.Новый;
			//	Если ТекЦикл > 1 И Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
			//		НовыйИсполнитель = ПолучитьИсполнителяЭтапаСЗамечаниями(Объект.ДокументСогласования, Стр.Состояние);
			//		Если НовыйИсполнитель <> Неопределено Тогда
			//			НовСтр.Исполнитель = НовыйИсполнитель;
			//		КонецЕсли;	
			//	КонецЕсли;				
			КонецЕсли;	
			//Евросиб СубботинВ #89527 30.10.2024 Конец
			
					
			Если СброситьПроверку И Стр.Состояние = Справочники.Состояния.ПроверкаРезультатовСогласования Тогда
				НовСтр.Статус = ?(ТекЦикл = 1,Стр.Статус,Перечисления.СтатусыЭтапов.Новый);
			КонецЕсли;
			
			НовСтр.НомерТекущегоЭтапаСогласования = Стр.НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Евросиб US 128174 TA 130483 Рыбьяков К.А. 15.03.2026 ((
Функция СохранитьОтветИнициатора(ДокументСогласования) Экспорт
	
	УДокументаЕстьРеквизитОтветИнициатора = Ложь;
	
	Если ТипЗнч(ДокументСогласования) = Тип("ДокументСсылка.ПСЦПоставщика")
		Или ТипЗнч(ДокументСогласования) = Тип("ДокументСсылка.Калькуляция")
		Или ТипЗнч(ДокументСогласования) = Тип("ДокументСсылка.КредитнаяЗаявка")
		Или ТипЗнч(ДокументСогласования) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		УДокументаЕстьРеквизитОтветИнициатора = Истина;
	КонецЕсли;
	
	Возврат УДокументаЕстьРеквизитОтветИнициатора;
	
КонецФункции // Евросиб Рыбьяков К.А. 15.03.2026 ))