
Функция Фирма1_ПрочитатьФайлPDF(ДвДанные)
	Поток		 = ДвДанные.ОткрытьПотокДляЧтения();
	ФайлЧтение	 = Новый ЧтениеТекста(Поток,КодировкаТекста.UTF8);
	ЧислоСтраниц = СтрЧислоВхождений(ФайлЧтение.Прочитать(),Символы.ПФ);
	// вернуться в начало файла после чтения страниц
	Поток.Перейти(-Поток.ТекущаяПозиция(),ПозицияВПотоке.Конец);
	
	НомерСтраницы	 = 1;
	фСтрока			 = ФайлЧтение.ПрочитатьСтроку();
	// Парсер текстового файла
	Пока фСтрока <> Неопределено Цикл
		Если СтрНачинаетсяС(фСтрока, Символы.ПФ) Тогда // перевод страницы FF - определелим
			НомерСтраницы = НомерСтраницы + 1;
		КонецЕсли;
		мСтрока = СтрЗаменить(фСтрока," ","");
		Если НомерСтраницы = 1 Тогда
			// первая страница документа
			// при желании парсим 1ую страницу
		Иначе
			фСтрока = ВРег(фСтрока);
			//парсим таблицы и остальные данные на следующих страницах
			// например через разложить строку в массив и потом анализирую элементы массива
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(фСтрока,"  ",Истина,Истина);
		КонецЕсли;
		фСтрока = ФайлЧтение.ПрочитатьСтроку();
	КонецЦикла;
	ФайлЧтение.Закрыть();
	Поток.Закрыть();
	Возврат "Something";
КонецФункции

Процедура ПриЗаписи(Отказ)
	
//Евросиб Гудкова( 05.02.2020 Ticket№ 0186097 временно перенесла кусок в процедуру ПередЗаписью, но надо это вообще исправлять
	//НЗ = РегистрыСведений.Рецензирование.СоздатьНаборЗаписей();
	//НЗ.Отбор.РецензОбъект.Установить(ДокументСогласования);
	//НЗ.Записать(Истина);
// Евросиб Гудкова)

	МаксШаг = 0;
	Для каждого Стр из Состояния Цикл
		МаксШаг = Макс(МаксШаг, Стр.ШагЦикла);
	КонецЦикла;
	
	Для каждого Стр из Состояния Цикл
		
		Если ЗначениеЗаполнено(Стр.Комментарий) И Стр.ШагЦикла = МаксШаг тогда
			МЗ = РегистрыСведений.Рецензирование.СоздатьМенеджерЗаписи();
			МЗ.ЦиклСогласования = Стр.ШагЦикла;
			МЗ.РецензОбъект = ДокументСогласования;
			МЗ.Рецензент = Стр.Исполнитель;
			//Евросиб Каблов 08.01.2025 ( #97984
			//МЗ.ТаймШтамп = ТекущаяДата();
			МЗ.ТаймШтамп = Стр.ЗавершениеРаботы;
			МЗ.Прочитать();
			Если Не МЗ.Выбран() Тогда
				МЗ.ЦиклСогласования = Стр.ШагЦикла;
				МЗ.РецензОбъект = ДокументСогласования;
				МЗ.Рецензент = Стр.Исполнитель;
				МЗ.ТаймШтамп = Стр.ЗавершениеРаботы;
			КонецЕсли;
			
			МЗ.Действие = Стр.Статус;
			МЗ.СтатусОбъекта = Стр.СтатусСогласования;
			МЗ.Состояние = Стр.Состояние;
			//Евросиб Каблов 08.01.2025 )			
			
			МЗ.Комментарии = Стр.Комментарий;
			МЗ.ОтветИнициатора = Стр.ОтветИнициатора;			
			МЗ.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
//Евросиб Гудкова( 05.02.2020 Ticket№ 0186097 временно перенесла кусок в процедуру ПередЗаписью, но надо это вообще исправлять
	//Если Не ЭтоНовый() Тогда
	//	НЗ = РегистрыСведений.Рецензирование.СоздатьНаборЗаписей();
	//	НЗ.Отбор.РецензОбъект.Установить(ДокументСогласования);
	//	НЗ.Записать(Истина);
	//КонецЕсли; 
// Евросиб Гудкова)
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Евросиб Каблов 15.01.2025 ( #89876
	Дата = ТекущаяДата();

	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
				
		ДокументСогласования = ДанныеЗаполнения;			
		Если ЗначениеЗаполнено(ДокументСогласования) Тогда
			Наименование = ДокументСогласования;
			Справочники.ПроцессСогласования.ЗаполнитьТЧСостояния(ЭтотОбъект, 1);
		КонецЕсли;			
	КонецЕсли;
	//Евросиб Каблов 15.01.2025 )
		
КонецПроцедуры  

