
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Поступление = Параметры.Поступление;
//Евросиб Гудкова( 02.12.2021 Ticket№ 42922
	УИДЗамера = Параметры.УИДЗамера;
// Евросиб Гудкова)
	//++ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
	Если Параметры.Свойство("МассивДокументов") Тогда
		СписокДокументов.ЗагрузитьЗначения(Параметры.МассивДокументов);
		Элементы.СписокПоступлений.Заголовок = СтрСоединить(Параметры.МассивДокументов, Символы.ПС);
	Иначе
		Элементы.СписокПоступлений.Заголовок = Параметры.Поступление;
	КонецЕсли;
	//--ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
	//++ДИТ Гаузер А.В. BUG 54206 TA 54207 10.08.2022
	//Заголовок = СтрШаблон("Авторазнесение %1", Поступление);
	//Если СписокДокументов.Количество() > 1 Тогда
	//	МассивНомеров = 	 Массив();
	//	Для Каждого Значение Из СписокДокументов Цикл
	//		МассивНомеров.Добавить(Значение.Значение.Номер + " от " + Формат(Значение.Значение.Дата, "ДФ=dd.MM.yy"));
	//	КонецЦикла;
	//	Элементы.ДекорацияЗаголовок.Заголовок = "Авторазнесение поступлений товаров и услуг: " + СтрСоединить(МассивНомеров, ", ");
	//Иначе
	//	Элементы.ДекорацияЗаголовок.Заголовок = СтрШаблон("Авторазнесение %1", Поступление);
	//КонецЕсли;
	//--ДИТ Гаузер А.В. BUG 54206 TA 54207 10.08.2022
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ПараметрКоманды = Новый Массив;
	//++ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
	//ПараметрКоманды.Добавить(Поступление);
	Если СписокДокументов.Количество() Тогда
		ПараметрКоманды = СписокДокументов.ВыгрузитьЗначения();
	Иначе
		ПараметрКоманды.Добавить(Поступление);
	КонецЕсли;
	//--ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	
	//ВыполнениеКомандКлиент.ВыполнитьКомандуОднократноеРазнесение(ПараметрКоманды, ПараметрыВыполненияКоманды);
	ВыполнитьКомандуОднократноеРазнесение(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуОднократноеРазнесение(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	//Евросиб Каблов 09.11.2022 ( Ticket#0288962
	Если ПараметрКоманды.Количество() = 1 Тогда
		ИдентификаторЗадания = ПараметрКоманды[0].УникальныйИдентификатор();
	Иначе
		ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	РезультатДлительнойОперации = ВыполнениеКомандСервер.ЗапуститьФоновоеЗаданиеОднократноеРазнесение(ПараметрКоманды, ИдентификаторЗадания);
	
	Если РезультатДлительнойОперации.Статус = "Ошибка"
		И РезультатДлительнойОперации.КраткоеПредставлениеОшибки = "Задание с таким значением ключа уже выполняется. " Тогда
		
		МожноЗакрытьФорму = Истина;
		Закрыть();
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 09.11.2022 )
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РезультатДлительнойОперации", РезультатДлительнойОперации);
	ДопПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);
	
	Подключаемый_ПроверитьВыполнениеЗадания(, ДопПараметры);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДопПараметры = "") Экспорт
	
	Попытка
		РезультатДлительнойОперации = ДопПараметры.РезультатДлительнойОперации;
		Если РезультатДлительнойОперации.Статус = "Выполнено" 
			Или ВыполнениеКомандСервер.ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда
			//РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
			//Если РезультатВыполнения = Неопределено Тогда 
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Однократное разнесение ПТУ завершено");
			//	ПоказатьПредупреждение(, "Разнесение ПТУ не выполнено");
			//Иначе

			    //++ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Однократное разнесение %1 завершено",Поступление));
				МассивРезультатов = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
				//Если СписокДокументов.Количество() Тогда
				//	Для Каждого Документ Из СписокДокументов Цикл
				//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Однократное разнесение %1 завершено", Документ));
				//	КонецЦикла;
				//Иначе
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Однократное разнесение %1 завершено",Поступление));
				//КонецЕсли;
				Для каждого Результат Из МассивРезультатов Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
				КонецЦикла;
				//--ДИТ Гаузер А.В. BUG 54206 TA 54207 14.07.2022
				МожноЗакрытьФорму = Истина;
				Закрыть();
			//КонецЕсли;
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДопПараметры.Источник);
			//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
			ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
			ПараметрыОжидания.Интервал = 1;
			ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект, ДопПараметры);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатДлительнойОперации, ОписаниеОповещения, ПараметрыОжидания);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
		Если НЕ МожноЗакрытьФорму Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВопросаЗакрытияФормы", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "При закрытии формы задание по авторазнесению будет отменено! Закрыть форму?",РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
//Евросиб Гудкова( 02.12.2021 Ticket№ 42922
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(Новый УникальныйИдентификатор(УИДЗамера));
// Евросиб Гудкова)
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаВопросаЗакрытияФормы(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		МожноЗакрытьФорму = Истина;
		Если ЭтаФорма.Открыта() Тогда
//Евросиб Гудкова( 02.12.2021 Ticket№ 42922
			ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(Новый УникальныйИдентификатор(УИДЗамера), Истина);
// Евросиб Гудкова)
			Закрыть();	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
