Процедура ПерезаполнитьВалютуВДокументахОснования(ПараметрыПерезаполнения, АдресРезультата = Неопределено) Экспорт
	Попытка
		НачатьТранзакцию();
		Для каждого ДокументОснование Из ПараметрыПерезаполнения.МассивДокументовОснования Цикл
			ДокументОснованиеОбъект = ДокументОснование.ПолучитьОбъект();
			ДокументОснованиеОбъект.ВалютаОплаты =  ПараметрыПерезаполнения.Валюта;
			ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить("ПерезаполнениеВалютыИзЗаявки", Истина);
			ДокументОснованиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; 
		//Евросиб СубботинВ #102528 21.07.2025 Начало
		Для Каждого СвязаннаяЗаявка Из ПараметрыПерезаполнения.СвязанныеЗаявкиНаИзменение Цикл 
			СвязаннаяЗаявкаОбъект =  ДокументОснование.ПолучитьОбъект();
			СвязаннаяЗаявкаОбъект.ВалютаОплаты =  ПараметрыПерезаполнения.Валюта; 
			СвязаннаяЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		//Евросиб СубботинВ #102528 21.07.2025 Конец		
		
		ЗафиксироватьТранзакцию();
		СтруктураРезультата = Новый Структура; 
		СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", "Документы перезаполнены");
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	Исключение
		ОО = ОписаниеОшибки();
		ОтменитьТранзакцию();                 
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", ОО);
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	КонецПопытки;	
КонецПроцедуры

Процедура ПерезаполнитьДатуОплатыВДокументахОснования(ПараметрыПерезаполнения, АдресРезультата = Неопределено) Экспорт
	Попытка
		НачатьТранзакцию();
		Для каждого ДокументОснование Из ПараметрыПерезаполнения.МассивДокументовОснования Цикл
			ДокументОснованиеОбъект = ДокументОснование.ПолучитьОбъект();
			ДокументОснованиеОбъект.ДатаОплаты =  ПараметрыПерезаполнения.ДатаОплаты;
			ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить("ПерезаполнениеДатыОплатыИзЗаявки", Истина);
			ДокументОснованиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		СтруктураРезультата = Новый Структура; 
		СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", "Документы перезаполнены");
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	Исключение
		ОО = ОписаниеОшибки();
		ОтменитьТранзакцию();                 
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", ОО);
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	КонецПопытки;	
КонецПроцедуры

Процедура ПерезаполнитьСтавкуНДСВДокументахОснования(ПараметрыПерезаполнения, АдресРезультата = Неопределено) Экспорт
	Попытка
		НачатьТранзакцию();		
		Для Каждого ДокументОснование Из ПараметрыПерезаполнения.МассивДокументовОснования Цикл
			Если ТипЗнч(ДокументОснование.ОснованиеДляПлатежа) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				Продолжить;
			КонецЕсли;
			ДокументОснованиеОбъект = ДокументОснование.ОснованиеДляПлатежа.ПолучитьОбъект(); 
			СуммаДокументаДоИзменения = ДокументОснованиеОбъект.СуммаДокумента;
			Для Каждого СтрокаТовар Из ДокументОснованиеОбъект.Товары Цикл
				СтрокаТовар.СтавкаНДС =  ДокументОснование.СтавкаНДС;				
				//Евросиб СубботинВ #102528 21.07.2025 Начало
				БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.РассчитатьСуммуСтрокиТабличнойЧасти(СтрокаТовар);
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТовар.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС),
																						ДокументОснованиеОбъект.УчитыватьНДС, ДокументОснованиеОбъект.СуммаВключаетНДС);
				СтрокаТовар.СуммаНДС = СуммаНДС;
				
				//Евросиб СубботинВ #102528 21.07.2025 Конец	
			КонецЦикла;
		
			//Евросиб СубботинВ #102528 21.07.2025 Начало
			ИтогоВсегоНДС = ?(ДокументОснованиеОбъект.Товары.Количество()>0, ДокументОснованиеОбъект.Товары.Итог("СуммаНДС"),0);
			ДокументОснованиеОбъект.СуммаДокумента = ?(ДокументОснованиеОбъект.Товары.Количество()>0, ДокументОснованиеОбъект.Товары.Итог("Сумма"),0)+?(ДокументОснованиеОбъект.СуммаВключаетНДС,0,ИтогоВсегоНДС);
			
			Если НЕ СуммаДокументаДоИзменения = ДокументОснованиеОбъект.СуммаДокумента Тогда
				ОбщегоНазначения.СообщитьПользователю("В связи с изменением ставки НДС изменена общая сумма документа:" + ДокументОснование.ОснованиеДляПлатежа);
			КонецЕсли;
			//Евросиб СубботинВ #102528 21.07.2025 Конец
			
			ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить("ПерезаполнениеСтавкиНДСИзЗаявки", Истина);
			ДокументОснованиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДокументОснованиеОбъект.Движения.Записать();

		КонецЦикла; 
		//Евросиб СубботинВ #102528 21.07.2025 Начало
		Если НЕ ПараметрыПерезаполнения.СвязанныеЗаявкиНаИзменение = Неопределено и ПараметрыПерезаполнения.СвязанныеЗаявкиНаИзменение.Количество() > 0 Тогда 
			Для Каждого СвязаннаяЗаявка Из ПараметрыПерезаполнения.СвязанныеЗаявкиНаИзменение Цикл 
				СвязаннаяЗаявкаОбъект =  СвязаннаяЗаявка.Заявка.ПолучитьОбъект();
				Для Каждого СтрокаОснований из СвязаннаяЗаявка.МассивСтруктурОснований Цикл
					//Для Каждого Основание из СтавкаОснованияДляПлатежаКИзменению.МассивДокументовВРазрезеСтавок Цикл
						Для Каждого ДокументНаОплату из СвязаннаяЗаявкаОбъект.ДокументыНаОплату Цикл 
							Если НЕ ДокументНаОплату.ОснованиеДляПлатежа = СтрокаОснований.Основание Тогда
								Продолжить;
							КонецЕсли;	
							ДокументНаОплату.СтавкаНДС = СтрокаОснований.СтавкаНДС;					
							УчитыватьНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНаОплату.ОснованиеДляПлатежа, "УчитыватьНДС");
							ДокументНаОплату.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ДокументНаОплату.СуммаОплаты,
							БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДокументНаОплату.СтавкаНДС), УчитыватьНДС, Истина);					
						КонецЦикла;
					//КонецЦикла;
				КонецЦикла;
					СвязаннаяЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЕсли;
		//Евросиб СубботинВ #102528 21.07.2025 Конец		
		ЗафиксироватьТранзакцию();

		СтруктураРезультата = Новый Структура; 
		СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", "Документы перезаполнены");
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	Исключение
		ОО = ОписаниеОшибки();
		ОтменитьТранзакцию();                 
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
		СтруктураРезультата.Вставить("РезультатПерезаполнения", ОО);
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	КонецПопытки;	
КонецПроцедуры  

//Евросиб СубботинВ #102528 09.04.2025 Начало
//Функция ПолучитьСуществующуюЗаявкуПоДокументу(ДокументОснование) Экспорт
Функция ПолучитьСуществующуюЗаявкуПоДокументу(ДокументОснование, Ставка = Неопределено) Экспорт
//Евросиб СубботинВ #102528 09.04.2025 Конец
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК Ссылка,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа В(&ОснованиеДляПлатежа)
	|	И ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Проведен
	|	И &СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_Статусы
	|ИЗ
	|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
	|			,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_Документы.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_Документы КАК ВТ_Документы)) КАК СтатусыОбъектовСрезПоследних
	|ГДЕ
	|	СтатусыОбъектовСрезПоследних.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Документы.Дата КАК Дата
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Статусы КАК ВТ_Статусы
	|		ПО ВТ_Документы.Ссылка = ВТ_Статусы.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ"; 
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало 
	ДокументыОснования = Новый Массив;
	Если ТипЗнч(ДокументОснование) = Тип("Массив") Тогда
		Для Каждого СтрокаМассива из  ДокументОснование Цикл
			ДокументыОснования.Добавить(СтрокаМассива.ОснованиеДляПлатежа);
		КонецЦикла;
	Иначе
		ДокументыОснования.Добавить(ДокументОснование);		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Статус", Справочники.СтатусыДокументов.Подготовлена);
	Запрос.УстановитьПараметр("ОснованиеДляПлатежа", ДокументыОснования);
	Если НЕ Ставка = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&СтавкаНДС", "ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС = &СтавкаНДС");
		Запрос.УстановитьПараметр("СтавкаНДС", Ставка);
	Иначе
		Запрос.УстановитьПараметр("СтавкаНДС", Истина); 
	КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;               
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаРезультатаЗапроса.Следующий();
	Возврат ВыборкаРезультатаЗапроса.Ссылка;
	
КонецФункции

Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. 12.07.2024
Функция ПроверитьОплаченнуюЗаявкуПоДокументуОснованию(ДокументОснование) Экспорт
	
	РезультатПроверки = Новый Структура("ОплаченнаяЗаявка", Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК ЗаявкаНаОплату
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = &ОснованиеДляПлатежа";
	Запрос.УстановитьПараметр("ОснованиеДляПлатежа", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		ЕстьОплаченнаяЗаявка = ложь;
		Пока Выборка.Следующий() Цикл
			РеквизитыИзУПП = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Выборка.ЗаявкаНаОплату, Перечисления.УзлыОбмена.УПП, 
																				Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
			Если ЗначениеЗаполнено(РеквизитыИзУПП.ДатаОплатыБУ) Тогда
				РезультатПроверки.ОплаченнаяЗаявка = Выборка.ЗаявкаНаОплату;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 
	Возврат РезультатПроверки;
	
КонецФункции 

//Евросиб СубботинВ #102528 09.04.2025 Начало
Функция СоздатьЗаявкиПоРазнымНДС(СоответствиеМассивовДокументов, Объект = Неопределено) Экспорт
	
	Ответ = Неопределено;

	Если Объект = Неопределено Тогда
		
		Для Каждого СтрокаПоСтавкеНДС из СоответствиеМассивовДокументов Цикл
			ОбрабатываемаяСтавка = СтрокаПоСтавкеНДС.Ключ;
			ОбрабатываемыеДокументы = СтрокаПоСтавкеНДС.Значение;
			
			НовЗаявка = Документы.ЗаявкаНаОплату.СоздатьДокумент();
			ДокументДляЗаполнения = ОбрабатываемыеДокументы[0].ОснованиеДляПлатежа;
			СтруктураЗаполнения = Новый Структура("Основание, НеЗаполнятьТЧ", ДокументДляЗаполнения, Истина);
			
			НовЗаявка.Заполнить(СтруктураЗаполнения);

			
			Для Каждого ОбрабатываемыйДокумент из ОбрабатываемыеДокументы Цикл;
				НовСтрокаДокументовОплаты = НовЗаявка.ДокументыНаОплату.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаДокументовОплаты,ОбрабатываемыйДокумент);
				НовСтрокаДокументовОплаты.ОснованиеДляПлатежа = ОбрабатываемыйДокумент.ОснованиеДляПлатежа;
				ЗаполнитьЗначенияСвойств(НовСтрокаДокументовОплаты,НовЗаявка);
				//ДокументДляЗаполнения = ОбрабатываемыйДокумент.ОснованиеДляПлатежа;				
			КонецЦикла;

			НовЗаявка.Дата = ТекущаяДата();
			
			НовЗаявка.ВсегоПоЗаявке = НовЗаявка.ДокументыНаОплату.Итог("СуммаОплаты"); 
			ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовЗаявка.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
			НовЗаявка.ВсегоВВалютеОплаты = РаботаСКурсамиВалют.ПересчитатьВВалюту(НовЗаявка.ВсегоПоЗаявке, ВалютаДоговора, НовЗаявка.ВалютаОплаты, НовЗаявка.ДатаПланируемойОплаты);
			НовЗаявка.Записать(РежимЗаписиДокумента.Запись);
			РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(НовЗаявка.Ссылка, Справочники.СтатусыДокументов.Подготовлена);
			ОбщегоНазначения.СообщитьПользователю("Создана " + НовЗаявка); 
		КонецЦикла;		
	Иначе	
		сч = 0;
		Для Каждого СтрокаПоСтавкеНДС из СоответствиеМассивовДокументов Цикл
			Если сч = 0 Тогда
				сч = сч + 1;
				Продолжить
			КонецЕсли;	
			ОбрабатываемаяСтавка = СтрокаПоСтавкеНДС.Ключ;
			ОбрабатываемыеДокументы = СтрокаПоСтавкеНДС.Значение;
			
			НовЗаявка = Документы.ЗаявкаНаОплату.СоздатьДокумент(); 
			НовЗаявка.Заполнить(Объект);
			
			Для Каждого ОбрабатываемыйДокумент из ОбрабатываемыеДокументы Цикл;
				НовСтрокаДокументовОплаты = НовЗаявка.ДокументыНаОплату.Добавить();
				НовСтрокаДокументовОплаты.ОснованиеДляПлатежа = ОбрабатываемыйДокумент; 
				
				ПараметрыОтбора = Новый Структура("ОснованиеДляПлатежа", ОбрабатываемыйДокумент);	
				СтрокаДляУдаления = Объект.ДокументыНаОплату.НайтиСтроки(ПараметрыОтбора);
				ЗаполнитьЗначенияСвойств(НовСтрокаДокументовОплаты,СтрокаДляУдаления[0]); 
				Объект.ДокументыНаОплату.Удалить(СтрокаДляУдаления[0]);
			КонецЦикла;
			
			НовЗаявка.ВсегоПоЗаявке = НовЗаявка.ДокументыНаОплату.Итог("СуммаОплаты"); 
			ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовЗаявка.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
			НовЗаявка.ВсегоВВалютеОплаты = РаботаСКурсамиВалют.ПересчитатьВВалюту(НовЗаявка.ВсегоПоЗаявке, ВалютаДоговора, НовЗаявка.ВалютаОплаты, НовЗаявка.ДатаПланируемойОплаты);
			
			НовЗаявка.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Создана " + НовЗаявка); 
			сч = сч + 1;
		КонецЦикла;		

	КонецЕсли;
	Если СоответствиеМассивовДокументов.Количество() = 1 Тогда 
		Ответ =	НовЗаявка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции
//Евросиб СубботинВ #102528 09.04.2025 Конец


//Евросиб СубботинВ #102528 21.07.2025 Начало
Функция ПолучитьЗаявкиПоДокументуОснованию(ДокументыОснования, ВалютаОплаты, Ссылка, СвязьСтавка = Ложь, СвязьВалютаОплаты = Ложь) Экспорт
	
    Результат = Новый Структура("РезультатПроверки, СвязанныеЗаявки, Сообщение", Истина, Новый Массив, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВалютаОплаты КАК ВалютаОплаты,
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_ДокументыОснования
	|ИЗ
	|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК Ссылка,
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты КАК ВалютаОплаты,
	|	ВТ_ДокументыОснования.СтавкаНДС КАК НоваяСтавка
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ВТ_ДокументыОснования.ОснованиеДляПлатежа
	|			И (НЕ ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка)
	|			И (&СвязьСтавка)
	|			И (&СвязьВалютаОплаты)
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты,
	|	ВТ_ДокументыОснования.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_Статусы
	|ИЗ
	|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
	|			,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_Документы.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_Документы КАК ВТ_Документы)) КАК СтатусыОбъектовСрезПоследних
	|ГДЕ
	|	НЕ СтатусыОбъектовСрезПоследних.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
	|	ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_Документы.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Документы.ВалютаОплаты КАК ВалютаОплаты
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Статусы КАК ВТ_Статусы
	|		ПО ВТ_Документы.Ссылка = ВТ_Статусы.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_СтатусыДляИзменений
	|ИЗ
	|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
	|			,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_Документы.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_Документы КАК ВТ_Документы)) КАК СтатусыОбъектовСрезПоследних
	|ГДЕ
	|	СтатусыОбъектовСрезПоследних.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
	|	ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_Документы.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Документы.ВалютаОплаты КАК ВалютаОплаты,
	|	ВТ_Документы.НоваяСтавка КАК НоваяСтавка
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыДляИзменений КАК ВТ_СтатусыДляИзменений
	|		ПО ВТ_Документы.Ссылка = ВТ_СтатусыДляИзменений.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДокументыОснования.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДокументыОснования.ВалютаОплаты КАК ВалютаОплаты,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетНаОплатуПоставщикаТовары.СтавкаНДС) КАК СтавкиНДСОснования,
	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	|ИЗ
	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыОснования.СтавкаНДС,
	|	ВТ_ДокументыОснования.ВалютаОплаты,
	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.СтавкаНДС,
	//|	ВТ_ДокументыОснования.ВалютаОплаты,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугУслуги.СтавкаНДС),
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДокументыОснования.СтавкаНДС,
	//|	ВТ_ДокументыОснования.ВалютаОплаты,
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа
	|";
	
	
	Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыОснования);
	Запрос.УстановитьПараметр("Статус", Справочники.СтатусыДокументов.Подготовлена); 
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВалютаОплаты", ВалютаОплаты);
	
	Если СвязьСтавка Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СвязьСтавка", "НЕ ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС = ВТ_ДокументыОснования.СтавкаНДС");
		ШаблонСообщения = "По документу %1 есть связанная заявка (""%2"") не в статусе ""Подготовлена"" со ставкой ндс %3. Перезаполнение отменено.";
		
	Иначе	
		Запрос.УстановитьПараметр("СвязьСтавка", Истина); 
	КонецЕсли;	
	Если СвязьВалютаОплаты Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СвязьВалютаОплаты", "НЕ ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаОплаты = ВТ_ДокументыОснования.ВалютаОплаты");
		ШаблонСообщения = "По документу %1 есть связанная заявка (""%2"") в валюте оплаты %3. Перезаполнение отменено."; 
	Иначе	
		Запрос.УстановитьПараметр("СвязьВалютаОплаты", Истина); 
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//Если СвязьВалютаОплаты Тогда
		Выборка = РезультатЗапроса[3].Выбрать();	
		Если РезультатЗапроса[3].Пустой() Тогда
			Результат.РезультатПроверки = Истина;
		Иначе 
			Выборка = РезультатЗапроса[3].Выбрать();	
			Пока Выборка.Следующий() Цикл	
				ПараметрЗаполненияСообщения = ?(СвязьСтавка, Выборка.СтавкаНДС, Выборка.ВалютаОплаты);
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Выборка.ОснованиеДляПлатежа,
				Выборка.Ссылка, ПараметрЗаполненияСообщения));
			КонецЦикла;
			Результат.РезультатПроверки = Ложь;
			Возврат Результат;
		КонецЕсли;
	//КонецЕсли;
	
	Если СвязьСтавка Тогда	
		ВыборкаРазныхСтавок = РезультатЗапроса[6].Выбрать();
		Пока ВыборкаРазныхСтавок.Следующий() Цикл 	
			Если НЕ ВыборкаРазныхСтавок.СтавкиНДСОснования = 1 Тогда
				Результат.РезультатПроверки = Ложь;
				ШаблонСообщения = "В документе %1 содержится несколько(%2) ставок НДС. Перезаполнение ставок требуется выполнить вручную.";			
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ВыборкаРазныхСтавок.ОснованиеДляПлатежа,
				ВыборкаРазныхСтавок.СтавкиНДСОснования));
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Если Результат.РезультатПроверки = Ложь Тогда
			Возврат Результат;
		КонецЕсли;		
		
		ВыборкаДокументовДляИзменений = РезультатЗапроса[5].Выбрать();
		
		МассивДокументовДляИзменений = Новый Массив; 
		МассивСообщений = Новый Массив;
		Пока ВыборкаДокументовДляИзменений.СледующийПоЗначениюПоля("Ссылка") Цикл 
			//МассивДокументыОснования = Новый Массив;
			МассивСчетов = Новый Массив;
			//Пока ВыборкаДокументовДляИзменений.СледующийПоЗначениюПоля("НоваяСтавка") Цикл
				МассивОснований = Новый Массив;
				Пока ВыборкаДокументовДляИзменений.Следующий() Цикл  
					МассивОснований.Добавить(Новый Структура("СтавкаНДС, Основание", ВыборкаДокументовДляИзменений.НоваяСтавка, ВыборкаДокументовДляИзменений.ОснованиеДляПлатежа));
					РеквитизыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаДокументовДляИзменений.ОснованиеДляПлатежа,"Номер, Дата");
					МассивСчетов.Добавить("Счет " + РеквитизыСчета.Номер + " от " + РеквитизыСчета.Дата);
				КонецЦикла;
				//МассивДокументыОснования.Добавить(Новый Структура("Заявка, МассивДокументовВРазрезеСтавок", ВыборкаДокументовДляИзменений.Ссылка, МассивОснований));	
			//КонецЦикла;	
			МассивДокументовДляИзменений.Добавить(Новый Структура("Заявка, МассивСтруктурОснований",
			ВыборкаДокументовДляИзменений.Ссылка, МассивОснований));	
			
			МассивСообщений.Добавить(СтрШаблон("К документу %1 привязаны следующие счета: %2.",
			ВыборкаДокументовДляИзменений.Ссылка, СтрСоединить(МассивСчетов,"; ")));
		КонецЦикла;
		Если НЕ МассивСообщений.Количество() = 0 Тогда											
			Результат.Сообщение = СтрСоединить(МассивСообщений,"; ") + " НДС также будет перезаполнен по данным текущей заявки";
		КонецЕсли;
		
		Результат.СвязанныеЗаявки = МассивДокументовДляИзменений;
		
	КонецЕсли; 
	Возврат Результат 
	
КонецФункции	
//Евросиб СубботинВ #102528 21.07.2025 Конец

