
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Начало: 18.07.2024   
	Если не Отказ и ДополнительныеСвойства.Свойство("ЗарегистрироватьДляОтправкиВУПП") Тогда
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.УПП);
	КонецЕсли;
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Конец: 18.07.2024
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  

	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Если СогласованиеСервер.ЕстьДублиСостояний(Состояния.Выгрузить()) Тогда
		Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ПодразделениеАвтора = Справочники.Пользователи.ПолучитьГруппуДКППользователя(Автор);
		Если ПодразделениеАвтора = Справочники.ГруппыПользователей.ПустаяСсылка() тогда 
		//	или ПодразделениеАвтора = Справочники.ГруппыПользователей.ДКПБезПодразделения Тогда
			ОбщегоНазначения.СообщитьПользователю("Требуется определить подразделение пользователя " + Автор + ". Создание отменено. Обратитесь к непосредственному руководителю");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Евросиб СубботинВ #89527 30.10.2024 Конец 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//ВыполнитьПроверкуПередПроведением(Отказ);				

	КонецЕсли;  
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		или (ЗначениеЗаполнено(Ссылка) и не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ПометкаУдаления") и ПометкаУдаления) Тогда
		Если ДополнительныеСвойства.Свойство("СтатусДокумента") тогда
			ТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
		Иначе
			ТекущийСтатусСтруктура = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Ссылка));
			ТекущийСтатус = ТекущийСтатусСтруктура.Статус;
		КонецЕсли;
		Если ТекущийСтатус = Справочники.СтатусыДокументов.Подготовлена Тогда
			ДанныеОбмена = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
			Если ЗначениеЗаполнено(ДанныеОбмена.СтатусБУ) и НЕ (ДанныеОбмена.СтатусБУ = "Отклонен")  Тогда 
				ТекстОшибки = "Удаление и распроведение заявки доступно только в статусе документа «Подготовлена» и состоянию в УПП «Отклонен»";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "СостояниеЗаявкиУПП", "Объект.СостояниеЗаявкиУПП", Отказ); 
			КонецЕсли;   
			Если ДокументыНаОплату.Количество() <> 0 Тогда  
				ТекстОшибки = "Удаление/отмена проведение Заявки невозможно. Привязаны следующие документы: "; 
				МассивДокументов = Новый Массив;
				Для каждого СтрДокумента Из ДокументыНаОплату Цикл
					МассивДокументов.Добавить(СтрДокумента.ОснованиеДляПлатежа); 
				КонецЦикла;
				ТекстОшибки = ТекстОшибки + СтрСоединить(МассивДокументов, ", ");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ); 
			КонецЕсли;
		Иначе
			ТекстОшибки = "Удаление и распроведение заявки доступно только в статусе документа «Подготовлена»";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "СтатусДокумента",, Отказ);
		КонецЕсли;		
	КонецЕсли;
	//Евросиб СубботинВ #102000 07.02.2025 Конец 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Конец: 12.07.2024
	
	// Маршрутизация заявки
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект); 
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	Если ЗначениеЗаполнено(Ссылка) и ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		СтатусДляСтартаМаршрутизации = Справочники.СтатусыДокументов.НаСогласование;	
		ТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
		УстановленНужныйСтатусДляМаршрутизации = СтатусДляСтартаМаршрутизации = ТекущийСтатус; 
	Иначе 
		УстановленНужныйСтатусДляМаршрутизации = Ложь;
	КонецЕсли;
	
	//Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация и УстановленНужныйСтатусДляМаршрутизации Тогда
		//Евросиб СубботинВ #89527 30.10.2024 Конец 
		
		ПараметрыЗапроса = Документы.ЗаявкаНаОплату.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		//Евросиб СубботинВ #89527 30.10.2024 Начало
		//РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРефСцеп(ПараметрыЗапроса, Дата);
		ПараметрыЗапроса.Вставить("ВидОперации", ВидОперации);
		ПараметрыЗапроса.Вставить("ПодразделениеДКП", ПодразделениеДКП);

		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗаявкуНаОплату(ПараметрыЗапроса, Дата);
		//Евросиб СубботинВ #89527 30.10.2024 Конец

		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
		
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РаспределитьСуммыПоСтатьямДДС();
	КонецЕсли;     
	
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Начало: 18.07.2024  
	//Если дрокумент помечается на удаление или распроводится и он был ранее отправлен в УПП, то отправляем пометку удаления/удаление проведения в УПП.
	Если не Отказ и (ЗначениеЗаполнено(Ссылка) 
		и (не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ПометкаУдаления") и ПометкаУдаления) 
		или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		ДанныеОбмена = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Если ЗначениеЗаполнено(ДанныеОбмена.СтатусБУ) Тогда   
			ДополнительныеСвойства.Вставить("ЗарегистрироватьДляОтправкиВУПП", Истина);
		КонецЕсли;
	КонецЕсли;
	// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. Конец: 18.07.2024
		
КонецПроцедуры   

Процедура РаспределитьСуммыПоСтатьямДДС()
	
	//Если ДокументыНаОплату.Итог("СуммаОплаты") = СтатьиДвиженияДенежныхСредств.Итог("Сумма") Тогда
	//	Возврат;
	//КонецЕсли;
	Для каждого ДокументНаОплату Из ДокументыНаОплату Цикл  
		// Евросиб(ДИТ) BUG 97336 ТА 97367 Сержантова А.С. Начало: 09.12.2024
		// Было:
		//Если Не ЗначениеЗаполнено(ДокументНаОплату.ИдентификаторСтроки) Тогда 
		//Стало:
		СтрокиСТакимЖеИдентификатором = ДокументыНаОплату.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ДокументНаОплату.ИдентификаторСтроки));
		Если Не ЗначениеЗаполнено(ДокументНаОплату.ИдентификаторСтроки) или СтрокиСТакимЖеИдентификатором.Количество() > 1 Тогда
		// Евросиб(ДИТ) BUG 97336 ТА 97367 Сержантова А.С. Конец: 09.12.2024
			ДокументНаОплату.ИдентификаторСтроки = ПолучитьИдентификаторСтроки();
		КонецЕсли;
	КонецЦикла;
	СтатьиДвиженияДенежныхСредств.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК СуммаОплаты,
	|	ЗаявкаНаОплатуДокументыНаОплату.ИдентификаторСтроки КАК ИдентификаторСтроки
	//Евросиб СубботинВ #107729 18.04.2025 Начало
    |	,ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС КАК СуммаНДС
	//Евросиб СубботинВ #107729 18.04.2025 Конец
	//Евросиб СубботинВ #102528 09.04.2025 Начало
    |	,ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	|ПОМЕСТИТЬ ВТ_ЗаявкаНаОплатуДокументыНаОплату
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК СуммаОплаты,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура.СтатьяДДС КАК СтатьяДДС,
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Начало: 17.10.2024
	// Было:
	//|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма, 
	//Стало:
	|ВЫБОР
	|	КОГДА ПоступлениеТоваровУслугУслуги.Сумма <> 0
	|		ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|	ИНАЧЕ ПоступлениеТоваровУслугУслуги.ПолнаяСумма
	|КОНЕЦ КАК Сумма,
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Конец: 17.10.2024
	|	ЗаявкаНаОплатуДокументыНаОплату.ИдентификаторСтроки КАК ИдентификаторСтроки
	//Евросиб СубботинВ #107729 18.04.2025 Начало
	|,ВЫБОР
	|	КОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС <> 0
	|		ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС
	|	ИНАЧЕ ПоступлениеТоваровУслугУслуги.ПолнаяСуммаНДС
	|КОНЕЦ КАК СуммаНДС
	|	,ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС КАК СуммаНДСОбщая
	//Евросиб СубботинВ #107729 18.04.2025 Конец
	|ПОМЕСТИТЬ ВТ_ДляГруппировки
	|ИЗ
	|	ВТ_ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка 
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	|		И  ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС = ПоступлениеТоваровУслугУслуги.СтавкаНДС
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты,
	|	СчетНаОплатуПоставщикаУслуги.Номенклатура.СтатьяДДС,
	|	СчетНаОплатуПоставщикаУслуги.Сумма,
	|	ЗаявкаНаОплатуДокументыНаОплату.ИдентификаторСтроки
	//Евросиб СубботинВ #107729 18.04.2025 Начало
    |	,СчетНаОплатуПоставщикаУслуги.СуммаНДС
	|	,ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС КАК СуммаНДСОбщая
	//Евросиб СубботинВ #107729 18.04.2025 Конец
	|ИЗ
	|	ВТ_ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаУслуги
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаУслуги.Ссылка
		//Евросиб СубботинВ #102528 09.04.2025 Начало
	|		И  ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС = СчетНаОплатуПоставщикаУслуги.СтавкаНДС
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ДляГруппировки.СуммаОплаты) КАК СуммаОплаты,
	|	ВТ_ДляГруппировки.СтатьяДДС КАК СтатьяДДС, 
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Начало: 28.10.2024
	// Было:
	//|	МАКСИМУМ(ВТ_ДляГруппировки.Сумма) КАК Сумма, 
	//Стало:
	|	СУММА(ВТ_ДляГруппировки.Сумма) КАК Сумма,
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Конец: 28.10.2024
	|	ВТ_ДляГруппировки.ИдентификаторСтроки КАК ИдентификаторСтроки
	//Евросиб СубботинВ #107729 18.04.2025 Начало
    |	,СУММА(ВТ_ДляГруппировки.СуммаНДС) КАК СуммаНДС
	|	,МАКСИМУМ(ВТ_ДляГруппировки.СуммаНДСОбщая) КАК СуммаНДСОбщая
	//Евросиб СубботинВ #107729 18.04.2025 Конец
	|ИЗ
	|	ВТ_ДляГруппировки КАК ВТ_ДляГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДляГруппировки.СтатьяДДС,
	|	ВТ_ДляГруппировки.ИдентификаторСтроки
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Начало: 21.10.2024
	|ИТОГИ ПО
	|	ИдентификаторСтроки";
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Конец: 21.10.2024
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЗаявкаНаОплату.ДокументыНаОплату", "&ЗаявкаНаОплатуДокументыНаОплату");
	Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();   
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Начало: 21.10.2024
	// Было:
	//ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	//ТаблицаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
	//Пока ВыборкаРезультатаЗапроса.СледующийПоЗначениюПоля("ИдентификаторСтроки") Цикл  
	//	СуммаРаспределения = ВыборкаРезультатаЗапроса.СуммаОплаты;
	//	КоэффициентыРаспределения = Новый Массив;
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		КоэффициентыРаспределения.Добавить(ВыборкаРезультатаЗапроса.Сумма);
	//	КонецЦикла;
	//	МассивРезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаРаспределения, КоэффициентыРаспределения);
	//	Если МассивРезультатРаспределения = Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Для каждого ЭлементРезультатРаспределения Из МассивРезультатРаспределения Цикл
	//		нСтрокаДвиженияДС = СтатьиДвиженияДенежныхСредств.Добавить();
	//		нСтрокаДвиженияДС.ИдентификаторСтрокиОплаты = ВыборкаРезультатаЗапроса.ИдентификаторСтроки;
	//		нСтрокаДвиженияДС.СтатьяДвиженияДенежныхСредств = ВыборкаРезультатаЗапроса.СтатьяДДС;
	//		нСтрокаДвиженияДС.Сумма = ЭлементРезультатРаспределения;
	//	КонецЦикла;
	//Стало:
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		СуммаРаспределения = ВыборкаРезультатаЗапроса.СуммаОплаты;
		//Евросиб СубботинВ #107729 18.04.2025 Начало
        СуммаРаспределенияНДС = ВыборкаРезультатаЗапроса.СуммаНДСОбщая;
		КоэффициентыРаспределенияНДС = Новый Массив; 
		//Евросиб СубботинВ #107729 18.04.2025 Конец
		КоэффициентыРаспределения = Новый Массив; 
		ВыборкаДеталиПоСтроке = ВыборкаРезультатаЗапроса.Выбрать();
		Пока ВыборкаДеталиПоСтроке.Следующий() Цикл
			КоэффициентыРаспределения.Добавить(ВыборкаДеталиПоСтроке.Сумма);
			//Евросиб СубботинВ #107729 18.04.2025 Начало
			КоэффициентыРаспределенияНДС.Добавить(ВыборкаДеталиПоСтроке.СуммаНДС);
			//Евросиб СубботинВ #107729 18.04.2025 Конец
		КонецЦикла;
		МассивРезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаРаспределения, КоэффициентыРаспределения);
		//Евросиб СубботинВ #107729 18.04.2025 Начало
		МассивРезультатРаспределенияНДС = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаРаспределенияНДС, КоэффициентыРаспределенияНДС);
		//Евросиб СубботинВ #107729 18.04.2025 Конец
		Если МассивРезультатРаспределения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаДеталиПоСтроке.Сбросить(); 
		Счетчик = 0;
		Пока ВыборкаДеталиПоСтроке.Следующий() Цикл
			нСтрокаДвиженияДС = СтатьиДвиженияДенежныхСредств.Добавить();
			нСтрокаДвиженияДС.ИдентификаторСтрокиОплаты = ВыборкаДеталиПоСтроке.ИдентификаторСтроки;
			нСтрокаДвиженияДС.СтатьяДвиженияДенежныхСредств = ВыборкаДеталиПоСтроке.СтатьяДДС;
			нСтрокаДвиженияДС.Сумма = МассивРезультатРаспределения[Счетчик];
			//Евросиб СубботинВ #107729 18.04.2025 Начало
			Если НЕ МассивРезультатРаспределенияНДС = Неопределено Тогда
				нСтрокаДвиженияДС.СуммаНДС = МассивРезультатРаспределенияНДС[Счетчик];
			КонецЕсли;
			//Евросиб СубботинВ #107729 18.04.2025 Конец
			Счетчик = Счетчик + 1;
		КонецЦикла;
	// Евросиб(ДИТ) BUG 91762 ТА 93140 Сержантова А.С. Конец: 21.10.2024
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	#Область ТиповойФункционалДокументов

	Автор 			 = Пользователи.ТекущийПользователь();
	Подразделение    = Автор.Подразделение;
	Организация 	 = Константы.ОсновнаяОрганизация.Получить();
	Создано 		 = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьЗаявкуНаОплату.Получить();
	
	#КонецОбласти
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаОплату") или ТипЗнч(ДанныеЗаполнения)= Тип("ДанныеФормыСтруктура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,
								"ДокументыНаОплату,Состояния,СтатьиДвиженияДенежныхСредств,Номер,Проведен,ПометкаУдаления,Создано,ПримененныйМаршрут");		
	Иначе 
	//Евросиб СубботинВ #102528 09.04.2025 Конец
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			Если ДанныеЗаполнения.Свойство("Основание") Тогда 
				//Евросиб СубботинВ #102528 09.04.2025 Начало
				Если ДанныеЗаполнения.Свойство("НеЗаполнятьТЧ") Тогда
					ЗаполнятьТЧ = Ложь;
				Иначе 
					ЗаполнятьТЧ = Истина;
					КонецЕсли;
				//Евросиб СубботинВ #102528 09.04.2025 Конец
				Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда 
					//Евросиб СубботинВ #102528 09.04.2025 Начало
                   // ЗаполнитьПоДаннымСчетНаОплатуПоставщика(ДанныеЗаполнения.Основание);
					ЗаполнитьПоДаннымСчетНаОплатуПоставщика(ДанныеЗаполнения.Основание, ЗаполнятьТЧ);
					//Евросиб СубботинВ #102528 09.04.2025 Конец
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
					//Евросиб СубботинВ #102528 09.04.2025 Начало
					//ЗаполнитьПоДаннымПоступлениеТоваровУслуг(ДанныеЗаполнения.Основание);
					ЗаполнитьПоДаннымПоступлениеТоваровУслуг(ДанныеЗаполнения.Основание, ЗаполнятьТЧ);
					//Евросиб СубботинВ #102528 09.04.2025 Конец
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента) и Не ЗначениеЗаполнено(ПодразделениеДКП) Тогда
			ОтветственныйЗаДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "ОтветственныйЗаДоговор");	
			ПодразделениеДКП = Справочники.Пользователи.ПолучитьГруппуДКППользователя(ОтветственныйЗаДоговор);
		КонецЕсли;	
		
		Если ЭтотОбъект.ПодразделениеДКП = Справочники.ГруппыПользователей.ОтделАренды Тогда
			ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаОплату.ОплатаАренды;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
			ВидОперации = Перечисления.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику;
		КонецЕсли; 
		
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец	
	
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымСчетНаОплатуПоставщика(СчетНаОплатуПоставщика, ЗаполнятьТЧ = Истина)
	
	Запрос = Новый Запрос;
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало

	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СчетНаОплатуПоставщика.ВалютаОплаты КАК ВалютаОплаты,
	//|	СчетНаОплатуПоставщика.ДоговорОплаты КАК ДоговорОплаты,
	//|	СчетНаОплатуПоставщика.Ссылка КАК ОснованиеДляПлатежа,
	//|	СчетНаОплатуПоставщика.СуммаДокумента КАК СуммаОплаты,
	//|	СчетНаОплатуПоставщика.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	//|	СчетНаОплатуПоставщика.ЦФО КАК ЦФО,
	//|	ГруппыПользователейСостав.Ссылка КАК ПодразделениеДКП
	//|ИЗ
	//|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	//|		ПО СчетНаОплатуПоставщика.ДоговорКонтрагента.ОтветственныйЗаДоговор = ГруппыПользователейСостав.Пользователь
	//|		И (НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления)
	//|		И (ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ (&ДКП))
	//|ГДЕ
	//|	СчетНаОплатуПоставщика.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.Организация КАК Организация,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.Контрагент КАК Контрагент,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	МАКСИМУМ(СчетНаОплатуПоставщикаТовары.СтавкаНДС) КАК СтавкаНДС,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ДатаОплаты КАК ДатаПланируемойОплаты,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ЦФО КАК ЦФО
	//|	, Выбор
	//|       Когда НЕ МаршрутизацияКонтрагентыИДоговоры1.Ссылка ЕСТЬ NULL или НЕ МаршрутизацияКонтрагентыИДоговоры.Ссылка ЕСТЬ NULL
	//|       Тогда  Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные)
	//|		Иначе  Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику)
	//|       Конец КАК ВидОперации
	//|ИЗ
	//|	Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры1
	//|		ПО СчетНаОплатуПоставщикаТовары.Ссылка.Контрагент = МаршрутизацияКонтрагентыИДоговоры1.Контрагент
	//|		И СчетНаОплатуПоставщикаТовары.Ссылка.ЦФО = МаршрутизацияКонтрагентыИДоговоры1.Ссылка.ЦФО
	//|      	и МаршрутизацияКонтрагентыИДоговоры1.Ссылка.МаршрутизируемыйОбъект = Значение(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаНаОплату)
	//|      ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
	//|		ПО СчетНаОплатуПоставщикаТовары.Ссылка.Контрагент = МаршрутизацияКонтрагентыИДоговоры.Контрагент
	//|      	и МаршрутизацияКонтрагентыИДоговоры.Ссылка.МаршрутизируемыйОбъект = Значение(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаНаОплату)
	//|ГДЕ
	//|	СчетНаОплатуПоставщикаТовары.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.Организация,
	//|     Выбор
	//|       Когда НЕ МаршрутизацияКонтрагентыИДоговоры1.Ссылка ЕСТЬ NULL или НЕ МаршрутизацияКонтрагентыИДоговоры.Ссылка ЕСТЬ NULL
	//|       Тогда  Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные)
	//|		Иначе  Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику)
	//|     Конец,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.Контрагент,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ДоговорКонтрагента,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ЦФО,
	//|	СчетНаОплатуПоставщикаТовары.Ссылка.ДатаОплаты";
	//
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщика.Организация КАК Организация,
	|	СчетНаОплатуПоставщика.Контрагент КАК Контрагент,
	|	СчетНаОплатуПоставщика.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетНаОплатуПоставщика.ДатаОплаты КАК ДатаПланируемойОплаты,
	|	СчетНаОплатуПоставщика.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	|	СчетНаОплатуПоставщика.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА НЕ МаршрутизацияКонтрагентыИДоговоры1.Ссылка ЕСТЬ NULL
	|				ИЛИ НЕ МаршрутизацияКонтрагентыИДоговоры.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику)
	|	КОНЕЦ КАК ВидОперации,
	|	СчетНаОплатуПоставщика.ВалютаОплаты КАК ВалютаОплаты,
	|	СчетНаОплатуПоставщика.ДоговорОплаты КАК ДоговорОплаты,
	|	СчетНаОплатуПоставщика.Ссылка КАК ОснованиеДляПлатежа,
	|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры1
	|		ПО СчетНаОплатуПоставщика.Ссылка.Контрагент = МаршрутизацияКонтрагентыИДоговоры1.Контрагент
	|			И СчетНаОплатуПоставщика.Ссылка.ЦФО = МаршрутизацияКонтрагентыИДоговоры1.Ссылка.ЦФО
	|			И (МаршрутизацияКонтрагентыИДоговоры1.Ссылка.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаНаОплату))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
	|		ПО СчетНаОплатуПоставщика.Ссылка.Контрагент = МаршрутизацияКонтрагентыИДоговоры.Контрагент
	|			И (МаршрутизацияКонтрагентыИДоговоры.Ссылка.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаНаОплату))
	|ГДЕ
	|	СчетНаОплатуПоставщика.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаОплатуОстатки.СуммаОстаток КАК СуммаОплаты,
	|	ЗаявкиНаОплатуОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	ЗаявкиНаОплатуОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявкиНаОплатуОстатки.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаОплату.Остатки(
	|			,
	|			ОснованиеДляПлатежа В
	|				(ВЫБРАТЬ
	|					ВТ_Документы.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_Документы КАК ВТ_Документы)) КАК ЗаявкиНаОплатуОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыПользователейСостав.Ссылка КАК Группа
	|ПОМЕСТИТЬ ВТ_ДКП
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ПО ВТ_Документы.ОтветственныйЗаОплату = ГруппыПользователейСостав.Пользователь
	|			И (НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления)
	|			И (ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ (&ДКП))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Организация КАК Организация,
	|	ВТ_Документы.Контрагент КАК Контрагент,
	|	ВТ_Документы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Документы.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
	|	ВТ_Документы.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ВТ_Документы.ЦФО КАК ЦФО,
	|	ВТ_Документы.ВидОперации КАК ВидОперации,
	|	ВТ_Документы.ВалютаОплаты КАК ВалютаОплаты,
	|	ВТ_Документы.ДоговорОплаты КАК ДоговорОплаты,
	|	ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_ДКП.Группа КАК ПодразделениеДКП,
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Остатки.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_Остатки.СуммаНДС КАК СуммаНДС,
	|	ВТ_Остатки.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Документы.Ссылка = ВТ_Остатки.ОснованиеДляПлатежа,
	|	ВТ_ДКП КАК ВТ_ДКП";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплатуПоставщика);
	Запрос.УстановитьПараметр("ДКП", Справочники.ГруппыПользователей.ДирекцияКонтейнерныхПеревозок);		
	//МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	//РезультатЗапроса = МассивРезультатовЗапроса[0];
	//ДокументыНаОплату.Загрузить(РезультатЗапроса.Выгрузить());
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект, МассивРезультатовЗапроса[1].Выгрузить()[0]);
	//СоответствиеОснованияПлатежа = ЗаявкиНаОплатуСервер.ПолучитьДанныеДляЗаполненияЗаявокПоДокументамОплаты(ДокументыНаОплату.ВыгрузитьКолонку("ОснованиеДляПлатежа"));
	//ИдентификаторСтроки = 0;
	//Для каждого ДокументНаОплату Из ДокументыНаОплату Цикл
	//	ЗначениеСоответствиеОснованияПлатежа = СоответствиеОснованияПлатежа.Получить(ДокументНаОплату.ОснованиеДляПлатежа);
	//	ЗаполнитьЗначенияСвойств(ДокументНаОплату, ЗначениеСоответствиеОснованияПлатежа,,"СуммаОплаты");
	//	ДокументНаОплату.СуммаОплаты = Мин(ДокументНаОплату.СуммаОплаты, ЗначениеСоответствиеОснованияПлатежа.СуммаОплаты);
	//	ДокументНаОплату.ИдентификаторСтроки = ИдентификаторСтроки;
	//	ИдентификаторСтроки = ИдентификаторСтроки + 1;
	//КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗРезультатЗапроса = РезультатЗапроса.Выгрузить();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТЗРезультатЗапроса[0]);
	ИдентификаторСтроки = 0;
	
	////Евросиб СубботинВ #102528 09.04.2025 Начало
	//Если ЗаполнятьТЧ Тогда		
	//	ОбходПоСчетам = РезультатЗапроса.Выбрать();
	//	Пока ОбходПоСчетам.СледующийПоЗначениюПоля("ОснованиеДляПлатежа") Цикл 
	//		//Евросиб СубботинВ #102528 09.04.2025 Начало

	//		//Евросиб СубботинВ #102528 09.04.2025 Конец
	//		Пока ОбходПоСчетам.Следующий() Цикл
	//			НовСтрока = ДокументыНаОплату.Добавить();
	//			ЗаполнитьЗначенияСвойств(НовСтрока,ОбходПоСчетам);
	//			СуммаСписания = Мин(ОбходПоСчетам.Сумма, СуммаОплаты);
	//			НовСтрока.СуммаОплаты = СуммаСписания;
	//			НовСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
	//			ИдентификаторСтроки = ИдентификаторСтроки + 1; 
	//			СуммаОплаты = СуммаОплаты - СуммаСписания;
	//		КонецЦикла;
	//	КонецЦикла;
	//	//Евросиб СубботинВ #102528 09.04.2025 Конец

	//
	//	ВсегоПоЗаявке = ДокументыНаОплату.Итог("СуммаОплаты");
	//КонецЕсли;
	////Евросиб СубботинВ #102528 09.04.2025 Конец  
	
		//Евросиб СубботинВ #102528 09.04.2025 Начало
	Если ЗаполнятьТЧ Тогда 
		ДокументыНаОплату.Загрузить(РезультатЗапроса.Выгрузить());
	//Евросиб СубботинВ #102528 09.04.2025 Конец 
		//Евросиб СубботинВ #102528 09.04.2025 Начало
		//	Основания = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОснованиеДляПлатежа");		
		//	СоответствиеОснованияПлатежа = ЗаявкиНаОплатуСервер.ПолучитьДанныеДляЗаполненияЗаявокПоДокументамОплаты(ДокументыНаОплату.ВыгрузитьКолонку("ОснованиеДляПлатежа"));
		//Евросиб СубботинВ #102528 09.04.2025 Конец
		
		ИдентификаторСтроки = 0;
		Для Каждого ДокументНаОплату Из ДокументыНаОплату Цикл
			//Евросиб СубботинВ #102528 09.04.2025 Начало
			//ЗначениеСоответствиеОснованияПлатежа = СоответствиеОснованияПлатежа.Получить(ДокументНаОплату.ОснованиеДляПлатежа);
			//ЗаполнитьЗначенияСвойств(ДокументНаОплату, ЗначениеСоответствиеОснованияПлатежа,, "СуммаОплаты");
			//ДокументНаОплату.СуммаОплаты = Мин(ДокументНаОплату.СуммаОплаты, ЗначениеСоответствиеОснованияПлатежа.СуммаОплаты);
			//Евросиб СубботинВ #102528 09.04.2025 Конец
			ДокументНаОплату.ИдентификаторСтроки = ИдентификаторСтроки;
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КонецЦикла; 
		ВсегоПоЗаявке = ДокументыНаОплату.Итог("СуммаОплаты"); 
		
		
		//Евросиб СубботинВ #102528 09.04.2025 Начало
	КонецЕсли;
	
	Ставки = ДокументыНаОплату.ВыгрузитьКолонку("СтавкаНДС");
	Ставки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(Ставки);
	Если Ставки.Количество()> 1 Тогда
		ЗаявкаПоРазнымСтавкамНДС = истина;
	КонецЕсли;	
	
	

КонецПроцедуры 

Процедура ЗаполнитьПоДаннымПоступлениеТоваровУслуг(ПоступлениеТоваровУслуг, ЗаполнятьТЧ = Истина)

	Запрос = Новый Запрос;
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало

	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК ОснованиеДляПлатежа,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СуммаНаПТУ КАК СуммаОплаты,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.ВалютаОплаты КАК ВалютаОплаты,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.ДоговорОплаты КАК ДоговорОплаты,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ЦФО КАК ЦФО,
	//|	ГруппыПользователейСостав.Ссылка КАК ПодразделениеДКП
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	//|		ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор = ГруппыПользователейСостав.Пользователь
	//|		И (НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления)
	//|		И (ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ (&ДКП))
	//|ГДЕ
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация КАК Организация,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент КАК Контрагент,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	МАКСИМУМ(ПоступлениеТоваровУслугУслуги.СтавкаНДС) КАК СтавкаНДС,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ДатаОплаты КАК ДатаПланируемойОплаты,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ЦФО КАК ЦФО
	//|	, Выбор
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Страхование 
	//|     	Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование)
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Штраф
	//|       Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов)
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Претензия
	//|       Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий)
	//|       Иначе Неопределено
	//|	Конец
	//|	КАК ВидОперации
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|ГДЕ
	//|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ЦФО,
	//|	  Выбор
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Страхование
	//|     	Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование)
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Штраф
	//|       Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов)
	//|		Когда ПоступлениеТоваровУслугУслуги.Ссылка.Претензия
	//|       Тогда Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий)
	//|       Иначе Неопределено
	//|	Конец,
	////Евросиб СубботинВ #89527 30.10.2024 Конец
	//|	ПоступлениеТоваровУслугУслуги.Ссылка.ДатаОплаты";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК ОснованиеДляПлатежа,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.ПоступлениеТоваровУслуг).ДоговорКонтрагента
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.СчетНаОплатуПоставщика).ДоговорКонтрагента
	|	КОНЕЦ КАК СчетПоставщикаДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.ПоступлениеТоваровУслуг).ВалютаДокумента
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.СчетНаОплатуПоставщика).ВалютаДокумента
	|	КОНЕЦ КАК СчетПоставщикаВалютаДокумента,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ВалютаОплаты КАК ВалютаОплаты
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|ГДЕ
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ЦФО,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.ПоступлениеТоваровУслуг).ДоговорКонтрагента
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.СчетНаОплатуПоставщика).ДоговорКонтрагента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.ПоступлениеТоваровУслуг).ВалютаДокумента
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК Документ.СчетНаОплатуПоставщика).ВалютаДокумента
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ВалютаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗаявкиНаОплатуОстатки.СуммаОстаток) КАК СуммаОплаты,
	|	СУММА(ЗаявкиНаОплатуОстатки.СуммаНДСОстаток) КАК СуммаНДС,
	|	ЗаявкиНаОплатуОстатки.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкиНаОплатуОстатки.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ Вт_Остатки
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаОплату.Остатки(
	|			,
	|			(ОснованиеДляПлатежа, СтавкаНДС) В
	|				(ВЫБРАТЬ
	|					ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|					ВТ_Документы.СтавкаНДС КАК СтавкаНДС
	|				ИЗ
	|					ВТ_Документы КАК ВТ_Документы)) КАК ЗаявкиНаОплатуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкиНаОплатуОстатки.ОснованиеДляПлатежа,
	|	ЗаявкиНаОплатуОстатки.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Документы.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ГруппыПользователейСостав.Ссылка КАК Группа
	|ПОМЕСТИТЬ ВТ_ДКП
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ПО ВТ_Документы.ОтветственныйЗаОплату = ГруппыПользователейСостав.Пользователь
	|			И (НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления)
	|			И (ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ (&ДКП))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_Документы.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ВТ_Документы.ЦФО КАК ЦФО,
	|	ВТ_ДКП.Группа КАК ПодразделениеДКП,
	|	ВТ_Документы.СчетПоставщикаДоговорКонтрагента КАК СчетПоставщикаДоговорКонтрагента,
	|	ВТ_Документы.СчетПоставщикаВалютаДокумента КАК СчетПоставщикаВалютаДокумента,
	|	ВТ_Документы.СтавкаНДС КАК СтавкаНДС,
	|	Вт_Остатки.СуммаОплаты КАК СуммаОплаты,
	|	Вт_Остатки.СуммаНДС КАК СуммаНДС,
	|	ВТ_Документы.ВалютаОплаты КАК ВалютаОплаты
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Остатки КАК Вт_Остатки
	|		ПО ВТ_Документы.ОснованиеДляПлатежа = Вт_Остатки.ОснованиеДляПлатежа
	|			И ВТ_Документы.СтавкаНДС = Вт_Остатки.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДКП КАК ВТ_ДКП
	|		ПО ВТ_Документы.ОтветственныйЗаОплату = ВТ_ДКП.ОтветственныйЗаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация КАК Организация,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	МАКСИМУМ(ПоступлениеТоваровУслугУслуги.СтавкаНДС) КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДатаОплаты КАК ДатаПланируемойОплаты,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор КАК ОтветственныйЗаОплату,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Страхование
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование)
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Штраф
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов)
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Претензия
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидОперации
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ЦФО,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Страхование
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование)
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Штраф
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов)
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.Претензия
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДатаОплаты,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ОтветственныйЗаДоговор";	
	
	
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	
	Запрос.УстановитьПараметр("Ссылка", ПоступлениеТоваровУслуг);	
	//Евросиб СубботинВ #89533 10.09.2024 Начало
	Запрос.УстановитьПараметр("ДКП", Справочники.ГруппыПользователей.ДирекцияКонтейнерныхПеревозок);		
    //Евросиб СубботинВ #89533 10.09.2024 Конец 

	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивРезультатовЗапроса[3];
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	//ДокументыНаОплату.Загрузить(РезультатЗапроса.Выгрузить());
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, МассивРезультатовЗапроса[4].Выгрузить()[0]);
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	Если ЗаполнятьТЧ Тогда 
		ДокументыНаОплату.Загрузить(РезультатЗапроса.Выгрузить());
	//Евросиб СубботинВ #102528 09.04.2025 Конец 
		//Евросиб СубботинВ #102528 09.04.2025 Начало
		//	Основания = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОснованиеДляПлатежа");		
		//	СоответствиеОснованияПлатежа = ЗаявкиНаОплатуСервер.ПолучитьДанныеДляЗаполненияЗаявокПоДокументамОплаты(ДокументыНаОплату.ВыгрузитьКолонку("ОснованиеДляПлатежа"));
		//Евросиб СубботинВ #102528 09.04.2025 Конец
		
		ИдентификаторСтроки = 0;
		Для Каждого ДокументНаОплату Из ДокументыНаОплату Цикл
			//Евросиб СубботинВ #102528 09.04.2025 Начало
			//ЗначениеСоответствиеОснованияПлатежа = СоответствиеОснованияПлатежа.Получить(ДокументНаОплату.ОснованиеДляПлатежа);
			//ЗаполнитьЗначенияСвойств(ДокументНаОплату, ЗначениеСоответствиеОснованияПлатежа,, "СуммаОплаты");
			//ДокументНаОплату.СуммаОплаты = Мин(ДокументНаОплату.СуммаОплаты, ЗначениеСоответствиеОснованияПлатежа.СуммаОплаты);
			//Евросиб СубботинВ #102528 09.04.2025 Конец
			ДокументНаОплату.ИдентификаторСтроки = ИдентификаторСтроки;
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КонецЦикла; 
		ВсегоПоЗаявке = ДокументыНаОплату.Итог("СуммаОплаты");
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец  
	
	Ставки = ДокументыНаОплату.ВыгрузитьКолонку("СтавкаНДС");
	Ставки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(Ставки);
	Если Ставки.Количество()> 1 Тогда
		ЗаявкаПоРазнымСтавкамНДС = истина;
	КонецЕсли;	
	
	
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)                                       
	
	//Евросиб СубботинВ #102528 09.04.2025 Начало
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Организация КАК Организация,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Контрагент КАК Контрагент,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДоговорКонтрагента КАК Договор,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК Сделка,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Ссылка КАК ЗаявкаНаОплату,
	////|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты КАК Валюта,
	////Евросиб СубботинВ #89541 16.10.2024 Начало
	//|	ВЫБОР
	//|	КОГДА ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ОплатаВИнойВалюте
	//|		ТОГДА ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты
	//|	ИНАЧЕ ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	//|	КОНЕЦ КАК Валюта,
	////Евросиб СубботинВ #89541 16.10.2024 Конец
	//|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК Сумма,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Период
	//|ИЗ
	//|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|ГДЕ
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Движения.ЗаявкиНаРасходованиеДенежныхСредств.Записывать = Истина;
	//Движения.ЗаявкиНаРасходованиеДенежныхСредств.Загрузить(Запрос.Выполнить().Выгрузить());
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	////Евросиб СубботинВ #102528 09.04.2025 Начало
	////"ВЫБРАТЬ
	////|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	////|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК Сумма,
	////|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаДокумента КАК Валюта,
	////|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	////|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Период
	////|ИЗ
	////|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	////|ГДЕ
	////|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка";
	//"ВЫБРАТЬ
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	СУММА(ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты) КАК Сумма,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаДокумента КАК Валюта,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Период,
	//|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС,
	//|	СУММА(ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС) КАК СуммаНДС
	//|ИЗ
	//|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|ГДЕ
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата,
	//|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаДокумента";
	////Евросиб СубботинВ #102528 09.04.2025 Конец

	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Движения.ЗаявкиНаОплату.Загрузить(Запрос.Выполнить().Выгрузить());
	//Движения.ЗаявкиНаОплату.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Организация КАК Организация,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Контрагент КАК Контрагент,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДоговорКонтрагента КАК Договор,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК Сделка,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Ссылка КАК ЗаявкаНаОплату,
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты КАК Валюта,
	//Евросиб СубботинВ #89541 16.10.2024 Начало
	|	ВЫБОР
	|	КОГДА ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ОплатаВИнойВалюте
	|		ТОГДА ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ВалютаОплаты
	|	ИНАЧЕ ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	//Евросиб СубботинВ #89541 16.10.2024 Конец
	|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка; 
	|//////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	СУММА(ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты) КАК Сумма,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаДокумента КАК Валюта,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата КАК Период,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Дата,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ВалютаДокумента";
    //Евросиб СубботинВ #102528 09.04.2025 Конец
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Движения.ЗаявкиНаРасходованиеДенежныхСредств.Записывать = Истина;
	Движения.ЗаявкиНаРасходованиеДенежныхСредств.Загрузить(РезультатЗапроса[0].Выгрузить());
	
	Движения.ЗаявкиНаОплату.Загрузить(РезультатЗапроса[1].Выгрузить());
	Движения.ЗаявкиНаОплату.Записать();	
	
	//Евросиб СубботинВ #102528 09.04.2025 Конец 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкиНаОплатуОстатки.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ЗаявкиНаОплатуОстатки.Валюта КАК Валюта,
	//|	ЗаявкиНаОплатуОстатки.СуммаОстаток КАК СуммаОстаток,
	//|	ЗаявкиНаОплатуОстатки.СтавкаНДС КАК СтавкаНДС
	//|ИЗ
	////|	РегистрНакопления.ЗаявкиНаОплату.Остатки(&Дата, ОснованиеДляПлатежа В (&ОснованияПлатежа)) КАК ЗаявкиНаОплатуОстатки
	//|	РегистрНакопления.ЗаявкиНаОплату.Остатки(, ОснованиеДляПлатежа В (&ОснованияПлатежа)) КАК ЗаявкиНаОплатуОстатки
	//|ГДЕ
	//|	ЗаявкиНаОплатуОстатки.СуммаОстаток < 0"; 
	
	
	"ВЫБРАТЬ 
	|	ОснованияПоЗаявке.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ОснованияПоЗаявке.СтавкаНДС КАК СтавкаНДС 
	|Поместить ВТ_данныеОснований
	|ИЗ
	| &ОснованияПлатежа как ОснованияПоЗаявке;
	| ///
	|ВЫБРАТЬ	
	|	ЗаявкиНаОплатуОстатки.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкиНаОплатуОстатки.Валюта КАК Валюта,
	|	ЗаявкиНаОплатуОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ЗаявкиНаОплатуОстатки.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	//|	РегистрНакопления.ЗаявкиНаОплату.Остатки(&Дата, ОснованиеДляПлатежа В (&ОснованияПлатежа)) КАК ЗаявкиНаОплатуОстатки
	|	РегистрНакопления.ЗаявкиНаОплату.Остатки(, (ОснованиеДляПлатежа, СтавкаНДС) В (ВЫБРАТЬ ВТ_данныеОснований.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа, ВТ_данныеОснований.СтавкаНДС КАК СтавкаНДС ИЗ ВТ_данныеОснований как ВТ_данныеОснований )) КАК ЗаявкиНаОплатуОстатки
	|ГДЕ
	|	ЗаявкиНаОплатуОстатки.СуммаОстаток < 0";

	Запрос.УстановитьПараметр("ОснованияПлатежа", ДокументыНаОплату.Выгрузить(,"ОснованиеДляПлатежа, СтавкаНДС")); 
	
	//Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	РезультатЗапроса = Запрос.Выполнить();                                                                 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для основания платежа %1 не хватает остатка для ввода заявки на оплату %2 в валюте %3 со ставкой ндс %4", 
													ВыборкаРезультатаЗапроса.ОснованиеДляПлатежа,
													-ВыборкаРезультатаЗапроса.СуммаОстаток,
													ВыборкаРезультатаЗапроса.Валюта, ВыборкаРезультатаЗапроса.СтавкаНДС),,,,Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИдентификаторСтроки()
	ИдентификаторСтроки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_ТаблицаОплат
	|ИЗ
	|	&ТаблицаОплат КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_ТаблицаОплат КАК т"; 
	Запрос.УстановитьПараметр("ТаблицаОплат", ДокументыНаОплату.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаРезультатаЗапроса.Следующий();
		ИдентификаторСтроки = ВыборкаРезультатаЗапроса.ИдентификаторСтроки + 1;
	КонецЕсли;                                                                 
	Возврат ИдентификаторСтроки;
КонецФункции 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	Если ДокументыНаОплату.Количество() = 0 Тогда
	//	Отказ = Истина;
		ТекстСообщенияОбОшибке = "Не выбраны документы на оплату";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, "ДокументыНаОплату",,Отказ);
	КонецЕсли;   

	//Евросиб СубботинВ #102528 09.04.2025 Начало //убрана т.к теперь можно в заявке иметь строки с разным НДС
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	&СтавкаНДС КАК СтавкаНДС,
	//|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ПОМЕСТИТЬ ВТ_ДокументыОснования
	//|ИЗ
	//|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ДокументыОснования.СтавкаНДС КАК СтавкаНДС
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаТовары.Ссылка
	//|			И ВТ_ДокументыОснования.СтавкаНДС <> СчетНаОплатуПоставщикаТовары.СтавкаНДС
	//|ОБЪЕДИНИТЬ ВСЕ
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ДокументыОснования.СтавкаНДС КАК СтавкаНДС
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка
	//|			И ВТ_ДокументыОснования.СтавкаНДС <> ПоступлениеТоваровУслугУслуги.СтавкаНДС";
	//Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	//Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
	//РезультатЗапроса = Запрос.Выполнить(); 
	//ВыводитьПервоеСообщенияПроведения = Истина;
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//	ВыводитьПервоеСообщенияПроведения = Ложь;
	//	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 ставки НДС в документе основания не совпадают со ставкой НДС заявки", ВыборкаРезультатаЗапроса.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли;
	//Евросиб СубботинВ #102528 09.04.2025 Конец 
	
		//Евросиб СубботинВ #102528 09.04.2025 Начало оптимизация

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	&ДатаОплаты КАК ДатаОплаты,
	//|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ПОМЕСТИТЬ ВТ_ДокументыОснования
	//|ИЗ
	//|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ДокументыОснования.ДатаОплаты КАК СтавкаНДС
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщика.Ссылка
	//|			И ВТ_ДокументыОснования.ДатаОплаты <> СчетНаОплатуПоставщика.ДатаОплаты
	//|ОБЪЕДИНИТЬ ВСЕ
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ДокументыОснования.ДатаОплаты КАК СтавкаНДС
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслуг.Ссылка
	//|			И ВТ_ДокументыОснования.ДатаОплаты <> ПоступлениеТоваровУслуг.ДатаОплаты";
	//Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	//Запрос.УстановитьПараметр("ДатаОплаты", ДатаПланируемойОплаты);
	//РезультатЗапроса = Запрос.Выполнить(); 
	//ВыводитьПервоеСообщенияПроведения = Истина;
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//	ВыводитьПервоеСообщенияПроведения = Ложь;
	//	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 дата оплаты в документе основания не совпадают с датой оплаты заявки", ВыборкаРезультатаЗапроса.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли; 
	//Если ОплатаВИнойВалюте Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	&ВалютаОплаты КАК ВалютаОплаты,
	//	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//	|ПОМЕСТИТЬ ВТ_ДокументыОснования
	//	|ИЗ
	//	|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//	|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//	|	ВТ_ДокументыОснования.ВалютаОплаты КАК ВалютаОплаты
	//	|ИЗ
	//	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	//	|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщика.Ссылка
	//	|			И ВТ_ДокументыОснования.ВалютаОплаты <> СчетНаОплатуПоставщика.ВалютаОплаты
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа,
	//	|	ВТ_ДокументыОснования.НомерСтроки,
	//	|	ВТ_ДокументыОснования.ВалютаОплаты
	//	|ИЗ
	//	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//	|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслуг.Ссылка
	//	|			И ВТ_ДокументыОснования.ВалютаОплаты <> ПоступлениеТоваровУслуг.ВалютаОплаты";
	//	Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	//	Запрос.УстановитьПараметр("ВалютаОплаты", ВалютаОплаты);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если НЕ РезультатЗапроса.Пустой() Тогда 
	//		Если ВыводитьПервоеСообщенияПроведения Тогда
	//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//			ВыводитьПервоеСообщенияПроведения = Ложь;			
	//		КонецЕсли;
	//		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	//		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//			ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 валюта оплаты в документе основания не совпадают с валютой оплаты заявки", ВыборкаРезультатаЗапроса.НомерСтроки);
	//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	////если по документам основаниям не созданы заказы, то проводить нельзя
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ПОМЕСТИТЬ ВТ_ДокументыОснования
	//|ИЗ
	//|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ЗаявкаНаОплатуДокументыНаОплату
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	//|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПротоколОбменов.Объект
	//|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	//|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	//|ГДЕ
	//|	ПротоколОбменов.Объект ЕСТЬ NULL
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ЗаявкаНаОплатуДокументыНаОплату
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	//|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПротоколОбменов.Объект
	//|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	//|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)),
	//|	Константа.ДатаНачалаИспользованияЗаявокНаОплату КАК ДатаНачалаИспользованияЗаявокНаОплату
	//|ГДЕ
	//|	ПротоколОбменов.ДатаОбмена < ДатаНачалаИспользованияЗаявокНаОплату.Значение";
	//Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	//МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	//Если НЕ МассивРезультатовЗапроса[1].Пустой() Тогда 
	//	Если ВыводитьПервоеСообщенияПроведения Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//		ВыводитьПервоеСообщенияПроведения = Ложь;			
	//	КонецЕсли;                   
	//	ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[1].Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 по документу основания не выгружены заказы в УПП", ВыборкаРезультатаЗапроса.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли;
	//Если НЕ МассивРезультатовЗапроса[2].Пустой() Тогда 
	//	Если ВыводитьПервоеСообщенияПроведения Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//		ВыводитьПервоеСообщенияПроведения = Ложь;			
	//	КонецЕсли;                   
	//	ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[2].Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 по документу основания созданы заявки на расходование средств в УПП", ВыборкаРезультатаЗапроса.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли;  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ДатаОплаты КАК ДатаОплаты,
	|	&ВалютаОплаты КАК ВалютаОплаты,
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_ДокументыОснования
	|ИЗ
	|	&ЗаявкаНаОплатуДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ДокументыОснования.ДатаОплаты КАК ДатаОплаты
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщика.Ссылка
	//|			И ВТ_ДокументыОснования.ДатаОплаты <> СчетНаОплатуПоставщика.ДатаОплаты
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДокументыОснования.ОснованиеДляПлатежа,
	//|	ВТ_ДокументыОснования.НомерСтроки,
	//|	ВТ_ДокументыОснования.ДатаОплаты
	//|ИЗ
	//|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслуг.Ссылка
	//|			И ВТ_ДокументыОснования.ДатаОплаты <> ПоступлениеТоваровУслуг.ДатаОплаты
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДокументыОснования.ВалютаОплаты КАК ВалютаОплаты
	|ИЗ
	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщика.Ссылка
	|			И ВТ_ДокументыОснования.ВалютаОплаты <> СчетНаОплатуПоставщика.ВалютаОплаты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа,
	|	ВТ_ДокументыОснования.НомерСтроки,
	|	ВТ_ДокументыОснования.ВалютаОплаты
	|ИЗ
	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслуг.Ссылка
	|			И ВТ_ДокументыОснования.ВалютаОплаты <> ПоступлениеТоваровУслуг.ВалютаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	|ИЗ
	|	ВТ_ДокументыОснования КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПротоколОбменов.Объект
	|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|ГДЕ
	|	ПротоколОбменов.Объект ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	|ИЗ
	|	ВТ_ДокументыОснования КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПротоколОбменов.Объект
	|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)),
	|	Константа.ДатаНачалаИспользованияЗаявокНаОплату КАК ДатаНачалаИспользованияЗаявокНаОплату
	|ГДЕ
	|	ПротоколОбменов.ДатаОбмена < ДатаНачалаИспользованияЗаявокНаОплату.Значение
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	//Евросиб СубботинВ #120458 26.09.2025 Начало 
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК Ссылка,
	//|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ПОМЕСТИТЬ ВТ_Документы
	//|ИЗ
	//|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	//|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ВТ_ДокументыОснования.ОснованиеДляПлатежа
	//|			И (НЕ ЗаявкаНаОплатуДокументыНаОплату.Ссылка = &Ссылка)
	////|			И (НЕ ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС = ВТ_ДокументыОснования.СтавкаНДС
	//|				И НЕ ЗаявкаНаОплатуДокументыНаОплату.Ссылка.ДатаПланируемойОплаты = ВТ_ДокументыОснования.ДатаОплаты
	//|ГДЕ
	//|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.Проведен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
	//|ПОМЕСТИТЬ ВТ_Статусы
	//|ИЗ
	//|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
	//|			,
	//|			Объект В
	//|				(ВЫБРАТЬ
	//|					ВТ_Документы.Ссылка КАК Ссылка
	//|				ИЗ
	//|					ВТ_Документы КАК ВТ_Документы)) КАК СтатусыОбъектовСрезПоследних
	//|ГДЕ
	//|	НЕ СтатусыОбъектовСрезПоследних.Статус = &Статус
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Документы.Ссылка КАК Ссылка,
	//|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
	//|	ВТ_Документы.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа
	//|ИЗ
	//|	ВТ_Документы КАК ВТ_Документы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Статусы КАК ВТ_Статусы
	//|		ПО ВТ_Документы.Ссылка = ВТ_Статусы.Объект;
	//|////////////////////////////////////////////////////////////////////////////////
	//Евросиб СубботинВ # 26.09.2025 120458 Конец
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДокументыОснования.ОснованиеДляПлатежа КАК ОснованиеДляПлатежа,
	|	ВТ_ДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДокументыОснования.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|	ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаТовары.Ссылка
	|		И ВТ_ДокументыОснования.СтавкаНДС = СчетНаОплатуПоставщикаТовары.СтавкаНДС
	|ГДЕ
	|	СчетНаОплатуПоставщикаТовары.СтавкаНДС ЕСТЬ NULL
	|   и ОснованиеДляПлатежа ССЫЛКА Документ.СчетНаОплатуПоставщика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|ВТ_ДокументыОснования.ОснованиеДляПлатежа,
	|	ВТ_ДокументыОснования.НомерСтроки,
	|	ВТ_ДокументыОснования.СтавкаНДС
	|ИЗ
	|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|	ПО ВТ_ДокументыОснования.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка
	|			И ВТ_ДокументыОснования.СтавкаНДС = ПоступлениеТоваровУслугУслуги.СтавкаНДС
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС ЕСТЬ NULL
	|   и ОснованиеДляПлатежа ССЫЛКА Документ.ПоступлениеТоваровУслуг";
	
	
	Запрос.УстановитьПараметр("ЗаявкаНаОплатуДокументыНаОплату", ДокументыНаОплату.Выгрузить());
	Запрос.УстановитьПараметр("ДатаОплаты", ДатаПланируемойОплаты);
	Запрос.УстановитьПараметр("ВалютаОплаты", ВалютаОплаты); 
	Запрос.УстановитьПараметр("Статус", Справочники.СтатусыДокументов.Подготовлена); 
    Запрос.УстановитьПараметр("Ссылка", Ссылка); 

	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	ВыводитьПервоеСообщенияПроведения = Истина;
	//Если НЕ МассивРезультатовЗапроса[1].Пустой() Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
	//	ВыводитьПервоеСообщенияПроведения = Ложь;
	//	ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[1].Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
	//		ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 дата оплаты в документе основания не совпадают с датой оплаты заявки", ВыборкаРезультатаЗапроса.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли;
	
	Если ОплатаВИнойВалюте Тогда	
		Если НЕ МассивРезультатовЗапроса[1].Пустой() Тогда 
			Если ВыводитьПервоеСообщенияПроведения Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
				ВыводитьПервоеСообщенияПроведения = Ложь;			
			КонецЕсли;
			ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[1].Выбрать();
			Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
				ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 валюта оплаты в документе основания не совпадают с валютой оплаты заявки", ВыборкаРезультатаЗапроса.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ МассивРезультатовЗапроса[4].Пустой() Тогда 
		Если ВыводитьПервоеСообщенияПроведения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
			ВыводитьПервоеСообщенияПроведения = Ложь;			
		КонецЕсли;
		ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[4].Выбрать();
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ТекстСообщенияОбОшибке = СтрШаблон("Ставка НДС в заявке и документе основании %1 не совпадают. Выполните изменения в документах и вновь проведите документ.", ВыборкаРезультатаЗапроса.ОснованиеДляПлатежа);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
		КонецЦикла;
	КонецЕсли;
	
	
	Если НЕ МассивРезультатовЗапроса[2].Пустой() Тогда 
		Если ВыводитьПервоеСообщенияПроведения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
			ВыводитьПервоеСообщенияПроведения = Ложь;			
		КонецЕсли;                   
		ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[2].Выбрать();
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 по документу основания не выгружены заказы в УПП", ВыборкаРезультатаЗапроса.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
		КонецЦикла;
	КонецЕсли;
	Если НЕ МассивРезультатовЗапроса[3].Пустой() Тогда 
		Если ВыводитьПервоеСообщенияПроведения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("При проверке заполненности данных произошли ошибки %1", ЭтотОбъект));
			ВыводитьПервоеСообщенияПроведения = Ложь;			
		КонецЕсли;                   
		ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[3].Выбрать();
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 по документу основания созданы заявки на расходование средств в УПП", ВыборкаРезультатаЗапроса.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
		КонецЦикла;
	КонецЕсли; 
	
	//
	//Если НЕ МассивРезультатовЗапроса[6].Пустой() Тогда	                  
	//	ВыборкаРезультатаЗапроса = МассивРезультатовЗапроса[6].Выбрать();
	//	Пока ВыборкаРезультатаЗапроса.СледующийПоЗначениюПоля("НомерСтроки") Цикл
	//		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл				
	//			ТекстСообщенияОбОшибке = СтрШаблон("По строке %1 по документу основания создана заявка (""%2"") с другой датой на оплату", ВыборкаРезультатаЗапроса.НомерСтроки, ВыборкаРезультатаЗапроса.Ссылка);
	//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыНаОплату", ВыборкаРезультатаЗапроса.НомерСтроки, "ОснованиеДляПлатежа"),,Отказ);
	//		КонецЦикла;		
	//	КонецЦикла;
	//КонецЕсли;
	
	//Евросиб СубботинВ #102528 09.04.2025 Конец оптимизация

	
КонецПроцедуры

//Евросиб СубботинВ #89527 30.10.2024 Начало

Процедура ПриКопировании(ОбъектКопирования)
	Состояния.Очистить();
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

//Евросиб СубботинВ #89527 30.10.2024 Конец  

