// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
    ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтактнаяИнформация");
    УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//Состояния
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	Отрасль.ЗагрузитьЗначения(Объект.ОтраслиКонтрагента.Выгрузить().ВыгрузитьКолонку("Отрасль"));
	//Договоры.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
	АнкетыПодрядчиков.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(АнкетыПодрядчиков, "Владелец", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	
	ОбновитьСостояниеВСтопЛисте();
	
	ОбновитьНаФормеПоказателиСПАРК();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияПоказателейСПАРК, "Контрагент", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	ОбновитьНаФормеКатегориюПодрядчика();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РейтингКлиента, "Контрагент", Объект.Ссылка, Истина);
	
	Если Объект.ТипКонтрагента_Подрядчик Тогда
		ЗаполнитьТаблицыФинансовыхПоказателейПодрядчикаСервер();
	КонецЕсли;
	
	Элементы.ГруппаАнкетаПодрядчика.Видимость = Объект.ТипКонтрагента_Подрядчик;
	Элементы.ГруппаФинансовыеПоказатели.Видимость = Объект.ТипКонтрагента_Подрядчик;
//Евросиб Гудкова( 02.02.2020 Ticket№ 0185396
	Элементы.ГруппаРасчетРисков.Видимость = Объект.ТипКонтрагента_Подрядчик;
// Евросиб Гудкова) 	
	Элементы.ГруппаАнкетаКлиента.Видимость = Объект.ТипКонтрагента_Клиент;
	
	// заполнить данные по лицензии
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛицензияНаПеревозкуОпасныхГрузов.ДатаНачалаДействияЛицензии КАК ДатаНачалаЛицензииОпГр,
	               |	ЛицензияНаПеревозкуОпасныхГрузов.ДатаОкончанияДействияЛицензии КАК ДатаОкончанияЛицензииОпГр,
	               |	ЛицензияНаПеревозкуОпасныхГрузов.ДатаИНомерЛицензии КАК ДатаИНомерЛицензииОпасныеГрузы
	               |ИЗ
	               |	РегистрСведений.ЛицензияНаПеревозкуОпасныхГрузов КАК ЛицензияНаПеревозкуОпасныхГрузов
	               |ГДЕ
	               |	ЛицензияНаПеревозкуОпасныхГрузов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(Этаформа,ТЗ[0]);
	КонецЕсли;
	//Евросиб Каблов 27.04.2020 ( Ticket#0187054	
	Если Объект.РасчетРисков.Количество() > 0 Тогда
		КатегорияРискаПодрядчика = Объект.РасчетРисков[0].КатегорияРиска;
	КонецЕсли;
	//Евросиб Каблов 27.04.2020 )
	//Евросиб (Гонтаренко 02.03.2021 #28263
	СобственныйКонтрагент = РегистрыСведений.СобственныеКонтрагенты.ЭтоСобственныйКонтрагент(Объект.Ссылка);
	//Евросиб )Гонтаренко 02.03.2021 #28263
	
	//Евросиб Каблов 05.08.2021 ( Ticket#0237548
	ЭтоРезидент = Объект.СтранаРегистрации = Справочники.СтраныМира.Россия;
	Элементы.ВнешнийКодНерезидента.Доступность = Не ЭтоРезидент И (РольДоступна("dc_РаботаСЗаявками") Или РольДоступна("ПолныеПрава"));
	//Евросиб Каблов 05.08.2021 )  
	
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722 
	ОфисПродаж = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьАналитикуДокумента(Объект.Ссылка,
		ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ОфисПродаж);
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
	
	// ++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023
	Элементы.ДляСлужебныхЗаявок.Видимость = РольДоступна("ПолныеПрава");
	// -- Евросиб Дудоров С.В. USER STORY 57543 30.01.2023
	
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаГруппаРеестрИсключения", "Доступность", ЭтоРезидент);
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
	ДоступныПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.КодовоеНаименование.Доступность = ДоступныПолныеПрава;
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец
	
	//Евросиб(ДИТ) Серебреников А.Г. US 107184 ТА 107186 19.05.25 Начало 
	Если Объект.ТипКонтрагента_Клиент Тогда 
		Элементы.ТранзитныйКлиент.Доступность = РольДоступна("dc_УстановкаТранзитногоКлиента") Или РольДоступна("ПолныеПрава");
	Иначе
		Элементы.ТранзитныйКлиент.Видимость = Ложь;
	КонецЕсли;	
	//Евросиб(ДИТ)) Серебреников А.Г. US 107184 ТА 107186 19.05.25 Конец
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//<< Евросиб - Витвицкий 17.07.2019
	ПоследнееОбновлениеСПАРК = СПАРКЗапросыСервер.ДатаПоследнегоОбновленияСпарка(ТекущийОбъект.Ссылка);
	//>> Евросиб - Витвицкий 17.07.2019
	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 20.03.2023
	УстановитьЗначениеРеквизитаСибур();
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 20.03.2023
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ТекущийОбъект.ОтраслиКонтрагента.Очистить();
	Для каждого стр из Отрасль Цикл
		ТекущийОбъект.ОтраслиКонтрагента.Добавить().Отрасль = стр.Значение;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаИНомерЛицензииОпасныеГрузы) Или ЗначениеЗаполнено(ДатаНачалаЛицензииОпГр) Тогда //Евросиб Гудкова( 19.06.2020 Ticket№ 0197854
		// записать данные по лицензии
		МЗ = РегистрыСведений.ЛицензияНаПеревозкуОпасныхГрузов.СоздатьМенеджерЗаписи();
		МЗ.Контрагент = Объект.Ссылка;
		МЗ.ДатаИНомерЛицензии = ДатаИНомерЛицензииОпасныеГрузы;
		МЗ.ДатаНачалаДействияЛицензии = ДатаНачалаЛицензииОпГр;
		МЗ.ДатаОкончанияДействияЛицензии = ДатаОкончанияЛицензииОпГр;
		МЗ.Записать();
	КонецЕсли; // Евросиб Гудкова) 	

КонецПроцедуры

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат)
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры


&НаСервере
Функция СоздатьВБФНаСервере()
	
	Возврат БитФинансСервер.ПередатьКонтрагентаВБФ(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура СоздатьВБФ(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Отказ = Ложь;
		Ответ = Вопрос("Перед отправкой запроса в Бит.Финанс контрагента необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		ИначеЕсли Записать() = Ложь Тогда
			Отказ = Истина;
		КонецЕсли;
		Если Отказ = Истина Тогда
			Сообщить("Контрагент не записан, данные в Бит.Финанс переданы не будут!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Сообщение = СоздатьВБФНаСервере();
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаГоризонтаПланирования2(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	Сч = 0;
	Пока Сч < Параметр1 Цикл
		НСтр  = Объект.ПлановыеПоказателиРаботыСКлиентом.Добавить();
		НСтр.МесяцНачалаРаботы = НачалоМесяца(ТекущаяДата() + Сч * 31 * 24 * 3600);
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Договоры.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(АнкетыПодрядчиков, "Владелец", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияПоказателейСПАРК, "Контрагент", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РейтингКлиента, "Контрагент", Объект.Ссылка, Истина);

КонецПроцедуры

&НаКлиенте
Процедура АнкетыПодрядчиковПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.АнкетыПодрядчиков.ТекущиеДанные;
	Если ТекДанные <> неопределено Тогда
		ЗаполнитьФормуПоАнкете(ТекДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоАнкете(Анкета)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Анкета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АнкетыПодрядчиков.ТипПодрядчика КАК ТипПодрядчика,
	|	АнкетыПодрядчиков.Ресурсы КАК Ресурсы,
	|	АнкетыПодрядчиков.КонечныйПодрядчик КАК КонечныйПодрядчик,
	|	АнкетыПодрядчиков.Регион КАК Регион,
	|	АнкетыПодрядчиков.ДатаАнкеты КАК ДатаАнкеты,
	|	АнкетыПодрядчиков.ВидУслуги КАК ВидУслуги,
	|	АнкетыПодрядчиков.ДействительнаДо КАК ДействительнаДо
	|ИЗ
	|	Справочник.АнкетыПодрядчиков КАК АнкетыПодрядчиков
	|ГДЕ
	|	АнкетыПодрядчиков.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыПодрядчиковХарактеристикиПодрядчика.НомерСтроки КАК НомерСтроки,
	|	АнкетыПодрядчиковХарактеристикиПодрядчика.Вопрос КАК Вопрос,
	|	АнкетыПодрядчиковХарактеристикиПодрядчика.Ответ КАК Ответ,
	|	АнкетыПодрядчиковХарактеристикиПодрядчика.Комментарий КАК Комментарий
	|ИЗ
	|	Справочник.АнкетыПодрядчиков.ХарактеристикиПодрядчика КАК АнкетыПодрядчиковХарактеристикиПодрядчика
	|ГДЕ
	|	АнкетыПодрядчиковХарактеристикиПодрядчика.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыПодрядчиковВидыУслугИРиски.НомерСтроки КАК НомерСтроки,
	|	АнкетыПодрядчиковВидыУслугИРиски.Услуга КАК Услуга,
	|	АнкетыПодрядчиковВидыУслугИРиски.Риски КАК Риски,
	|	АнкетыПодрядчиковВидыУслугИРиски.ГруппаРасчета КАК ГруппаРасчета
	|ИЗ
	|	Справочник.АнкетыПодрядчиков.ВидыУслугИРиски КАК АнкетыПодрядчиковВидыУслугИРиски
	|ГДЕ
	|	АнкетыПодрядчиковВидыУслугИРиски.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.НомерСтроки КАК НомерСтроки,
	|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.МесяцНачалаРаботы КАК МесяцНачалаРаботы,
	|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.Количество КАК Количество,
	|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.ОбъемЗакупаемыхУслугТР КАК ОбъемЗакупаемыхУслугТР
	|ИЗ
	|	Справочник.АнкетыПодрядчиков.ПлановыеПоказателиРаботыСПодрядчиком КАК АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком
	|ГДЕ
	|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Анкета_ТипПодрядчика = Выборка.ТипПодрядчика;
		Анкета_Ресурсы = Выборка.Ресурсы;
		Анкета_КонечныйПодрядчик = Выборка.КонечныйПодрядчик;
		Анкета_Регион = Выборка.Регион;
		Анкета_ДатаАнкеты = Выборка.ДатаАнкеты;
		Анкета_ВидУслуги = Выборка.ВидУслуги;
		Анкета_ДействительнаДо = Выборка.ДействительнаДо;
	КонецЕсли;
	
	Анкета_ХарактеристикиПодрядчика.Загрузить(Результаты[1].Выгрузить());
	Анкета_ВидУслугИРиски.Загрузить(Результаты[2].Выгрузить());
	Анкета_ПлановыеПоказатели.Загрузить(Результаты[3].Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборомПараметров(Команда)
	
	Для каждого Стр из Объект.РасчетРисков.НайтиСтроки(Новый Структура("КатегорияРиска", КатегорияРискаПодрядчика)) Цикл
		Объект.РасчетРисков.Удалить(Стр);
	КонецЦикла;
	
	Для каждого Стр из РейтингиИРискиКонтрагентовКлиент.ПолучитьТаблицуПараметровПоКатегорииХарактеристикПодрядчика(КатегорияРискаПодрядчика) Цикл
		НСтр = Объект.РасчетРисков.Добавить();
		НСтр.КатегорияРиска = КатегорияРискаПодрядчика;
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияРискаПодрядчикаПриИзменении(Элемент)
	
	Элементы.РасчетРисков.ОтборСтрок = Новый ФиксированнаяСтруктура("КатегорияРиска", КатегорияРискаПодрядчика);
	ПосчитатьИтогПроцентовРисков();
//Евросиб Каблов 27.04.2020 ( Ticket#0187054
	УстановитьДоступностьЭлементовРасчетаРисков();
//Евросиб Каблов 27.04.2020 )
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРисковПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.РасчетРисков.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ввод_ГруппаХарактеристик = ТекД.КатегорияРиска;
		ввод_Характеристика = текД.Характеристика;
		ввод_ЗначениеРиска = текД.Риски;
		
		ТипХарактеристики = РейтингиИРискиКонтрагентовКлиент.ВариантыЗначенияДляХарактеристики(ввод_Характеристика);
		Если ТипХарактеристики = "Число" Тогда
			Элементы.ввод_Число.Видимость = Истина;
			Элементы.ввод_ВыборИзСписка.Видимость = Ложь;
			ввод_Число = ТекД.ЗначениеХарактеристики;
		Иначе
			Элементы.ввод_Число.Видимость = Ложь;
			Элементы.ввод_ВыборИзСписка.Видимость = Истина;
			Элементы.ввод_ВыборИзСписка.СписокВыбора.Очистить();
			Для Сч = 0 По ТипХарактеристики.Количество()-1 Цикл
				Элементы.ввод_ВыборИзСписка.СписокВыбора.Добавить(ТипХарактеристики[Сч].Значение, ТипХарактеристики[Сч].Представление);
				Если ТекД.ЗначениеХарактеристики = ТипХарактеристики[Сч].Представление Тогда
					ввод_ВыборИзСписка = ТипХарактеристики[Сч].Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ввод_ЧислоПриИзменении(Элемент)
	
	ввод_ЗначениеРиска = РейтингиИРискиКонтрагентовКлиент.ПолучитьЗначениеРиска(ввод_ГруппаХарактеристик, ввод_Характеристика, ввод_Число);
	
	ТекД = Элементы.РасчетРисков.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.ЗначениеХарактеристики = ввод_Число;
		текД.Риски = ввод_ЗначениеРиска;
		
	КонецЕсли;
	
	ПосчитатьИтогПроцентовРисков();
	
КонецПроцедуры

&НаКлиенте
Процедура ввод_ВыборИзСпискаПриИзменении(Элемент)
	
	ввод_ЗначениеРиска = РейтингиИРискиКонтрагентовКлиент.ПолучитьЗначениеРиска(ввод_ГруппаХарактеристик, ввод_Характеристика, ввод_ВыборИзСписка);
	ПредставлениеЗначения = Элементы.ввод_ВыборИзСписка.СписокВыбора.найтиПоЗначению(ввод_ВыборИзСписка).Представление;
	
	ТипХарактеристики = РейтингиИРискиКонтрагентовКлиент.ВариантыЗначенияДляХарактеристики(ввод_Характеристика);
	
	ТекД = Элементы.РасчетРисков.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.ЗначениеХарактеристики = ПредставлениеЗначения;
		текД.Риски = ввод_ЗначениеРиска;
		
	КонецЕсли;
	
	ПосчитатьИтогПроцентовРисков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИтогПроцентовРисков()
	
	Итог = 0;
	Для каждого Стр из Объект.РасчетРисков Цикл
		Если Стр.КатегорияРиска = КатегорияРискаПодрядчика Тогда
			Итог = Итог + Стр.Риски;
		КонецЕсли;
	КонецЦикла;
	Элементы.РасчетРисковРиски.ТекстПодвала = Формат(Итог, "ЧДЦ=2; ЧГ=");
	
КонецПроцедуры

#Область ФинансовыеПоказатели

&НаКлиенте
Процедура ЗаполнитьТаблицыФинансовыхПоказателейПодрядчика(Команда)
	
	ЗаполнитьТаблицыФинансовыхПоказателейПодрядчикаСервер();
	
	ГруппыПоказателей = СтатистикаРаботыЗаПолгода.ПолучитьЭлементы();
	Для Каждого ГруппаПоказателей Из ГруппыПоказателей Цикл
		Элементы.СтатистикаРаботыЗаПолгода.Развернуть(ГруппаПоказателей.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыФинансовыхПоказателейПодрядчикаСервер()
	
	//Статистика по годам
	
	СтатистикаРаботыПоГодам.Очистить();
	
	СтрокаПоказателяОбъемЗакупокСНДС = СтатистикаРаботыПоГодам.Добавить();
	СтрокаПоказателяОбъемЗакупокСНДС.Показатель = "Объем закупок";
	СтрокаПоказателяОбъемЗакупокСНДС.УчетНДС = "с учетом НДС";
	
	СтрокаПоказателяОбъемЗакупокБезНДС = СтатистикаРаботыПоГодам.Добавить();
	СтрокаПоказателяОбъемЗакупокБезНДС.Показатель = "Объем закупок";
	СтрокаПоказателяОбъемЗакупокБезНДС.УчетНДС = "без учета НДС";
	
	СтрокаПоказателяПлатежиСНДС = СтатистикаРаботыПоГодам.Добавить();
	СтрокаПоказателяПлатежиСНДС.Показатель = "Платежи";
	СтрокаПоказателяПлатежиСНДС.УчетНДС = "с учетом НДС";	
	
	СтрокаПоказателяОперативноеСальдо = СтатистикаРаботыПоГодам.Добавить();
	СтрокаПоказателяОперативноеСальдо.Показатель = "Оперативное сальдо";
	СтрокаПоказателяОперативноеСальдо.УчетНДС = "с учетом НДС";
	
	ТекДата = ТекущаяДатаСеанса();
	ТекГод = Год(ТекДата);	
	
	СоответствиеГодИмяКолонки = Новый Соответствие;	
	Для Счетчик = 0 По 2 Цикл
		
		ГодТекКолонки = ТекГод - Счетчик;
		СчетчикСтрокой = Формат(Счетчик, "ЧН=0; ЧГ=0");		
		СоответствиеГодИмяКолонки.Вставить(ГодТекКолонки, "Год" + СчетчикСтрокой);
		Элементы["СтатистикаРаботыПоГодамГод" + СчетчикСтрокой].Заголовок = Формат(ГодТекКолонки, "ЧГ=0");
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Дата(ТекГод - 2, 1, 1));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекДата);
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Год КАК Год,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокБезНДС) КАК ОбъемЗакупокБезНДС,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокСНДС) КАК ОбъемЗакупокСНДС,
	|	СУММА(ВложенныйЗапрос.ПлатежиСНДС) КАК ПлатежиСНДС,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокБезНДС - ВложенныйЗапрос.ПлатежиСНДС) КАК ОперативноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГОД(ЗакупкиОбороты.Период) КАК Год,
	|		ЗакупкиОбороты.СтоимостьОборот - ЗакупкиОбороты.НДСОборот КАК ОбъемЗакупокБезНДС,
	|		ЗакупкиОбороты.СтоимостьОборот КАК ОбъемЗакупокСНДС,
	|		0 КАК ПлатежиСНДС
	|	ИЗ
	|		РегистрНакопления.Закупки.Обороты(&ДатаНачала, &ДатаОкончания, Год, Контрагент = &Контрагент) КАК ЗакупкиОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГОД(ДвиженияДенежныхСредствОбороты.Период),
	|		0,
	|		0,
	|		ДвиженияДенежныхСредствОбороты.СуммаОборот
	|	ИЗ
	|		РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				Год,
	|				Контрагент = &Контрагент
	|					И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)) КАК ДвиженияДенежныхСредствОбороты) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Год";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяКолонки = СоответствиеГодИмяКолонки.Получить(Выборка.Год);
		Если ИмяКолонки <> Неопределено Тогда
			
			СтрокаПоказателяОбъемЗакупокСНДС[ИмяКолонки] = Выборка.ОбъемЗакупокСНДС;
			СтрокаПоказателяОбъемЗакупокБезНДС[ИмяКолонки] = Выборка.ОбъемЗакупокБезНДС;
			СтрокаПоказателяПлатежиСНДС[ИмяКолонки] = Выборка.ПлатежиСНДС;
			СтрокаПоказателяОперативноеСальдо[ИмяКолонки] = Выборка.ОперативноеСальдо;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Статистика за полгода
	
	ГруппыПоказателей = СтатистикаРаботыЗаПолгода.ПолучитьЭлементы();
	ГруппыПоказателей.Очистить();
	
	ГруппаПоказателейПлатежи = ГруппыПоказателей.Добавить();
	ГруппаПоказателейПлатежи.Показатель = "Платежи (тыс. руб.)";
	СтрокиГруппы = ГруппаПоказателейПлатежи.ПолучитьЭлементы();
	СтрокаПоказателяПлатежиСНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяПлатежиСНДС.Показатель = "Сумма с учетом НДС";
	
	ГруппаПоказателейОбъемУслугПоВСФ = ГруппыПоказателей.Добавить();
	ГруппаПоказателейОбъемУслугПоВСФ.Показатель = "Объем услуг по ВСФ (тыс. руб.)";
	СтрокиГруппы = ГруппаПоказателейОбъемУслугПоВСФ.ПолучитьЭлементы();
	СтрокаПоказателяОбъемУслугСНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяОбъемУслугСНДС.Показатель = "Сумма всего с НДС";
	СтрокаПоказателяОбъемУслугБезНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяОбъемУслугБезНДС.Показатель = "Сумма без учета НДС";
	СтрокаПоказателяОбъемУслугНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяОбъемУслугНДС.Показатель = "Сумма НДС";
	
	ГруппаПоказателейВыполненныеОбъемы = ГруппыПоказателей.Добавить();
	ГруппаПоказателейВыполненныеОбъемы.Показатель = "Объем услуг - выполненные объемы по заказам клиентов (тыс. руб.)";
	СтрокиГруппы = ГруппаПоказателейВыполненныеОбъемы.ПолучитьЭлементы();
	СтрокаПоказателяВыполненныеОбъемыСНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыСНДС.Показатель = "Сумма всего с НДС";
	СтрокаПоказателяВыполненныеОбъемыБезНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыБезНДС.Показатель = "Сумма без учета НДС";
	СтрокаПоказателяВыполненныеОбъемыНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыНДС.Показатель = "Сумма НДС";
	СтрокаПоказателяВыполненныеОбъемыВРСНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыВРСНДС.Показатель = "в т.ч. ВР (с НДС)";
	СтрокаПоказателяВыполненныеОбъемыВРБезНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыВРБезНДС.Показатель = "в т.ч. ВР (без учета НДС)";
	СтрокаПоказателяВыполненныеОбъемыСебестоимостьСНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыСебестоимостьСНДС.Показатель = "в т.ч. Себестоимость (с НДС)";
	СтрокаПоказателяВыполненныеОбъемыСебестоимостьБезНДС = СтрокиГруппы.Добавить();
	СтрокаПоказателяВыполненныеОбъемыСебестоимостьБезНДС.Показатель = "в т.ч. Себестоимость (без учета НДС)";	
	
	ТекМесяц = НачалоМесяца(ТекДата);
	
	СоответствиеМесяцИмяКолонки = Новый Соответствие;
	
	Для Счетчик = 0 по 5 Цикл
		
		МесяцТекКолонки = ДобавитьМесяц(ТекМесяц, -Счетчик);
		СчетчикСтрокой = Формат(Счетчик, "ЧН=0; ЧГ=0");
		СоответствиеМесяцИмяКолонки.Вставить(МесяцТекКолонки, "Месяц" + СчетчикСтрокой);
		Элементы["СтатистикаРаботыЗаПолгодаМесяц" + СчетчикСтрокой].Заголовок = Формат(МесяцТекКолонки, "ДФ='МММ гг'");
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ДатаНачала", МесяцТекКолонки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	СУММА(ВложенныйЗапрос.ВыполненныеОбъемыСНДС) КАК ВыполненныеОбъемыСНДС,
	|	СУММА(ВложенныйЗапрос.ВРсНДС) КАК ВРсНДС,
	|	СУММА(ВложенныйЗапрос.СебестоимостьСНДС) КАК СебестоимостьСНДС,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокБезНДС) КАК ОбъемЗакупокБезНДС,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокСНДС) КАК ОбъемЗакупокСНДС,
	|	СУММА(ВложенныйЗапрос.ОбъемЗакупокНДС) КАК ОбъемЗакупокНДС,
	|	СУММА(ВложенныйЗапрос.ПлатежиСНДС) КАК ПлатежиСНДС,
	|	СУММА(ВложенныйЗапрос.ВыполненныеОбъемыНДС) КАК ВыполненныеОбъемыНДС,
	|	СУММА(ВложенныйЗапрос.ВРНДС) КАК ВРНДС,
	|	СУММА(ВложенныйЗапрос.СебестоимостьНДС) КАК СебестоимостьНДС
	|ИЗ
	|	(
	//|   ВЫБРАТЬ
	//|		ЗакрытиеПериодовОбороты.Период КАК Период,
	//|		ЗакрытиеПериодовОбороты.СуммаРасходаРасход КАК ВыполненныеОбъемыСНДС,
	//|		ВЫБОР
	//|			КОГДА ЗакрытиеПериодовОбороты.Перевыставляемая
	//|				ТОГДА ЗакрытиеПериодовОбороты.СуммаРасходаРасход
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ВРсНДС,
	//|		ВЫБОР
	//|			КОГДА НЕ ЗакрытиеПериодовОбороты.Перевыставляемая
	//|				ТОГДА ЗакрытиеПериодовОбороты.СуммаРасходаРасход
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК СебестоимостьСНДС,
	//|		ЗакрытиеПериодовОбороты.СуммаНДСРасходаРасход КАК ВыполненныеОбъемыНДС,
	//|		ВЫБОР
	//|			КОГДА ЗакрытиеПериодовОбороты.Перевыставляемая
	//|				ТОГДА ЗакрытиеПериодовОбороты.СуммаНДСРасходаРасход
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ВРНДС,
	//|		ВЫБОР
	//|			КОГДА НЕ ЗакрытиеПериодовОбороты.Перевыставляемая
	//|				ТОГДА ЗакрытиеПериодовОбороты.СуммаНДСРасходаРасход
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК СебестоимостьНДС,
	//|		0 КАК ОбъемЗакупокБезНДС,
	//|		0 КАК ОбъемЗакупокСНДС,
	//|		0 КАК ОбъемЗакупокНДС,
	//|		0 КАК ПлатежиСНДС
	//|	ИЗ
	//|		РегистрНакопления.ЗакрытиеПериодов.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Контрагент = &Контрагент) КАК ЗакрытиеПериодовОбороты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗакупкиОбороты.Период,
	|		0 КАК ВыполненныеОбъемыСНДС,
	|		0 КАК ВРсНДС,
	|		0 КАК СебестоимостьСНДС,
	|		0 КАК ВыполненныеОбъемыНДС,
	|		0 КАК ВРНДС,
	|		0 КАК СебестоимостьНДС,
	|		ЗакупкиОбороты.СтоимостьОборот - ЗакупкиОбороты.НДСОборот КАК ОбъемЗакупокБезНДС,
	|		ЗакупкиОбороты.СтоимостьОборот КАК ОбъемЗакупокСНДС,
	|		ЗакупкиОбороты.НДСОборот КАК ОбъемЗакупокНДС,
	|		0 КАК ПлатежиСНДС
	|	ИЗ
	|		РегистрНакопления.Закупки.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Контрагент = &Контрагент) КАК ЗакупкиОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДенежныхСредствОбороты.Период,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ДвиженияДенежныхСредствОбороты.СуммаОборот
	|	ИЗ
	|		РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				Месяц,
	|				Контрагент = &Контрагент
	|					И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)) КАК ДвиженияДенежныхСредствОбороты) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяКолонки = СоответствиеМесяцИмяКолонки.Получить(Выборка.Период);
		Если ИмяКолонки <> Неопределено Тогда
			СтрокаПоказателяПлатежиСНДС[ИмяКолонки] = Выборка.ПлатежиСНДС;
			СтрокаПоказателяОбъемУслугСНДС[ИмяКолонки] = Выборка.ОбъемЗакупокСНДС;
			СтрокаПоказателяОбъемУслугБезНДС[ИмяКолонки] = Выборка.ОбъемЗакупокБезНДС;
			СтрокаПоказателяОбъемУслугНДС[ИмяКолонки] = Выборка.ОбъемЗакупокНДС;
			СтрокаПоказателяВыполненныеОбъемыСНДС[ИмяКолонки] = Выборка.ВыполненныеОбъемыСНДС;
			СтрокаПоказателяВыполненныеОбъемыБезНДС[ИмяКолонки] = Выборка.ВыполненныеОбъемыСНДС - Выборка.ВыполненныеОбъемыНДС;
			СтрокаПоказателяВыполненныеОбъемыНДС[ИмяКолонки] = Выборка.ВыполненныеОбъемыНДС;
			СтрокаПоказателяВыполненныеОбъемыВРСНДС[ИмяКолонки] = Выборка.ВРсНДС;
			СтрокаПоказателяВыполненныеОбъемыВРБезНДС[ИмяКолонки] = Выборка.ВРсНДС - Выборка.ВРНДС;			
			СтрокаПоказателяВыполненныеОбъемыСебестоимостьСНДС[ИмяКолонки] = Выборка.СебестоимостьСНДС;
			СтрокаПоказателяВыполненныеОбъемыСебестоимостьБезНДС[ИмяКолонки] = Выборка.СебестоимостьСНДС - Выборка.СебестоимостьНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуВСФПоКонтрагентуЗаГод(Контрагент, Год)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СчетФактураВыданный.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |ГДЕ
	               |	СчетФактураВыданный.Контрагент = &Контрагент
	               |	И СчетФактураВыданный.Проведен
	               |	И ГОД(СчетФактураВыданный.ДатаВыставления) = &Год";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Год", Год);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.СуммаДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСуммуПлатежейСНДС(Контрагент, Год)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СписаниеСРасчетногоСчета.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	               |ГДЕ
	               |	СписаниеСРасчетногоСчета.Проведен
	               |	И СписаниеСРасчетногоСчета.ВидОперации = &ВидОперации
	               |	И ГОД(СписаниеСРасчетногоСчета.ДатаВзаиморасчетов) = &Год
	               |	И СписаниеСРасчетногоСчета.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Год", Год);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.СуммаДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ТипКонтрагента_ПодрядчикПриИзменении(Элемент)
	
	Элементы.ГруппаАнкетаПодрядчика.Видимость = Объект.ТипКонтрагента_Подрядчик;
	Элементы.ГруппаФинансовыеПоказатели.Видимость = Объект.ТипКонтрагента_Подрядчик;
//Евросиб Гудкова( 02.02.2020 Ticket№ 0185396
	Элементы.ГруппаРасчетРисков.Видимость = Объект.ТипКонтрагента_Подрядчик;
// Евросиб Гудкова) 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагента_КлиентПриИзменении(Элемент)
	
	Элементы.ГруппаАнкетаКлиента.Видимость = Объект.ТипКонтрагента_Клиент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ТипКонтрагента_Подрядчик Тогда
		ГруппыПоказателей = СтатистикаРаботыЗаПолгода.ПолучитьЭлементы();
		Для Каждого ГруппаПоказателей Из ГруппыПоказателей Цикл
			Элементы.СтатистикаРаботыЗаПолгода.Развернуть(ГруппаПоказателей.ПолучитьИдентификатор());
		КонецЦикла;
		//Евросиб Каблов 27.04.2020 ( Ticket#0187054
		Элементы.РасчетРисков.ОтборСтрок = Новый ФиксированнаяСтруктура("КатегорияРиска", КатегорияРискаПодрядчика);
		ПосчитатьИтогПроцентовРисков();
		УстановитьДоступностьЭлементовРасчетаРисков();		
		//Евросиб Каблов 27.04.2020 )
	КонецЕсли;
	
//Евросиб Гудкова( 03.01.2021 Ticket№0218528 
	Если  ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для каждого Элемент Из Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ПолеФормы") И СтрНачинаетсяС(Элемент.Имя, "БФ") Тогда
				Элемент.ТолькоПросмотр = Истина;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
// Евросиб Гудкова) 	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Евросиб Коханенко Н.А. 02.08.2024 (( #88035 
	//Состояния
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб Коханенко Н.А. 02.08.2024 )) #88035 

	Если Объект.ТипКонтрагента_Клиент Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КатегорииКонтрагентовСрезПоследних.Категория КАК Категория
		|ИЗ
		|	РегистрСведений.КатегорииКонтрагентов.СрезПоследних КАК КатегорииКонтрагентовСрезПоследних
		|ГДЕ
		|	КатегорииКонтрагентовСрезПоследних.Контрагент = &Контрагент
		|	И КатегорииКонтрагентовСрезПоследних.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиент)
		|	И КатегорииКонтрагентовСрезПоследних.ПлановаяФактическая = ЗНАЧЕНИЕ(Перечисление.ПланФакт.Факт)";
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекущаяКатегория = "";
		Если Выборка.Следующий() Тогда
			ТекущаяКатегория = Выборка.Категория;
		КонецЕсли;
		
		Если КатегорияКлиентаФактическая <> ТекущаяКатегория Тогда
			Запись = РегистрыСведений.КатегорииКонтрагентов.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДатаСеанса();
			Запись.Контрагент = Объект.Ссылка;
			Запись.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
			Запись.ПлановаяФактическая = Перечисления.ПланФакт.Факт;
			Запись.Категория = КатегорияКлиентаФактическая;
			Запись.Записать();
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаГоризонтПланирования2(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаГоризонтаПланирования2", ЭтаФорма);
	ПоказатьВводЧисла(ОпОп, , "Укажите горизонт планирования", 10, 0);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаФормеПоказателиСПАРК()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СПАРКИндексыРисковСрезПоследних.СводныйИндикаторРиска КАК Сводный,
	|	СПАРКИндексыРисковСрезПоследних.ИндексДолжнойОсмотрительности КАК ИДО,
	|	СПАРКИндексыРисковСрезПоследних.ИндексФинансовогоРиска КАК ИФР,
	|	СПАРКИндексыРисковСрезПоследних.ИндексПлатежнойДисциплины КАК ИПД
	|ИЗ
	|	РегистрСведений.СПАРКИндексыРисков.СрезПоследних(, Контрагент = &Контрагент) КАК СПАРКИндексыРисковСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
				
		ДанныеСпаркСводный = Выборка.Сводный;
		ДанныеСпаркИДО = Выборка.ИДО;
		ДанныеСпаркИФР = Выборка.ИФР;
		ДанныеСпаркИПД = Выборка.ИПД;
		
		Если ДанныеСпаркСводный = "Низкий риск" Тогда
			Элементы.ДанныеСпаркСводный.ЦветФона = WebЦвета.БледноЗеленый;
		ИначеЕсли ДанныеСпаркСводный = "Средний риск" Тогда
			Элементы.ДанныеСпаркСводный.ЦветФона = WebЦвета.Желтый;
		ИначеЕсли ДанныеСпаркСводный = "Высокий риск" Тогда
			Элементы.ДанныеСпаркСводный.ЦветФона = WebЦвета.Красный;
		Иначе
			Элементы.ДанныеСпаркСводный.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
		КонецЕсли;
		
	Иначе
		
		ДанныеСпаркСводный = "";
		ДанныеСпаркИДО = "";
		ДанныеСпаркИФР = "";
		ДанныеСпаркИПД = "";
		
		Элементы.ДанныеСпаркСводный.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаФормеКатегориюПодрядчика()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	|	КатегорииКонтрагентовСрезПоследних.ТипКонтрагента КАК ТипКонтрагента,
	|	КатегорииКонтрагентовСрезПоследних.ПлановаяФактическая КАК ПлановаяФактическая,
	|	КатегорииКонтрагентовСрезПоследних.Категория КАК Категория
	|ИЗ
	|	РегистрСведений.КатегорииКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК КатегорииКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
			Если Выборка.ПлановаяФактическая = Перечисления.ПланФакт.Факт Тогда
				КатегорияКлиентаФактическая = Выборка.Категория;
			ИначеЕсли Выборка.ПлановаяФактическая = Перечисления.ПланФакт.План Тогда
				КатегорияКлиентаПлановая = Выборка.Категория;
			КонецЕсли;
		ИначеЕсли Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Подрядчик Тогда
			Если Выборка.ПлановаяФактическая = Перечисления.ПланФакт.Факт Тогда
				КатегорияПодрядчикаФактическая = Выборка.Категория;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеВСтопЛисте()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	СтопЛистКонтрагентовСрезПоследних.Период КАК Период,
	               |	СтопЛистКонтрагентовСрезПоследних.Пользователь КАК Пользователь,
	               |	СтопЛистКонтрагентовСрезПоследних.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.СтопЛистКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтопЛистКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() и Ответ.ВСтопЛисте Тогда
		
		Элементы.ПредупреждениеСтопЛист.Видимость = Истина;
		Элементы.ПредупреждениеСтопЛист.Заголовок = "Контрагент в стоп-листе с " + Формат(Ответ.Период, "ДФ=dd.MM.yy") + " пользователем " + Ответ.Пользователь + " по причине: " + Ответ.Комментарий;
		
	Иначе
		
		Элементы.ПредупреждениеСтопЛист.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#Область Работа_со_спарком

&НаКлиенте
Процедура СПАРК_СкачатьДосье(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
		Если СПАРКЗапросыСервер.ЗапросБылВыполненМенее3ДнейНазад(Объект.Ссылка) Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СПАРК_СкачатьДосьеЗавершение", ЭтаФорма), "Предыдущий запрос был выполнен менее трех дней назад. Вы уверены, что хотите загрузить актуальную версию досье контрагента?",
			РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
//Евросиб Каблов М.Б. 25.11.2019 (
		Иначе
			СПАРК_СкачатьДосьеЗавершение(КодВозвратаДиалога.Да, Неопределено);
//Евросиб Каблов М.Б. 25.11.2019 )
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предварительно нужно записать эту карточку контрагента");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_СкачатьДосьеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;		
	
	СПАРК_СкачатьДосьеФрагмент();
//Евросиб Гудкова( 07.10.2019 Ticket№ 0178067
	СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры);
// Евросиб Гудкова) 	

КонецПроцедуры

&НаКлиенте
Процедура СПАРК_СкачатьДосьеФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО");
	СтруктураРеквизитов.Контрагент = Объект.Ссылка;
	СтруктураРеквизитов.ИНН = Объект.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_СкачатьДосьеНаСервере(СтруктураРеквизитов, Отказ);
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
			Объект.ИНН = СтруктураРеквизитов.ИНН;
			Модифицированность = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ОГРН) Тогда
			Объект.ОГРН = СтруктураРеквизитов.ОГРН;
			Модифицированность = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КодПоОКПО) Тогда
			Объект.КодПоОКПО = СтруктураРеквизитов.КодПоОКПО;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказатели(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
		Если СПАРКЗапросыСервер.ЗапросБылВыполненМенее3ДнейНазад(Объект.Ссылка) Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СПАРК_ОбновитьПоказателиЗавершение", ЭтаФорма), "Предыдущий запрос был выполнен менее трех дней назад. Вы уверены, что хотите загрузить актуальные показатели?",
			РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
            Возврат;		
		КонецЕсли;	
		СПАРК_ОбновитьПоказателиФрагмент();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предварительно нужно записать эту карточку контрагента");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;		
	
	СПАРК_ОбновитьПоказателиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказателиФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО, ПоследнееОбновлениеСПАРК");
	СтруктураРеквизитов.Контрагент = Объект.Ссылка;
	СтруктураРеквизитов.ИНН = Объект.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_ОбновитьПоказателиНаСервере(СтруктураРеквизитов, Отказ);
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
			ЭтаФорма.Объект.ИНН = СтруктураРеквизитов.ИНН;
			//Модифицированность = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ОГРН) Тогда
			ЭтаФорма.Объект.ОГРН = СтруктураРеквизитов.ОГРН;
			//Модифицированность = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КодПоОКПО) Тогда
			ЭтаФорма.Объект.КодПоОКПО = СтруктураРеквизитов.КодПоОКПО;
			//Модифицированность = Истина;
		КонецЕсли;
		ОбновитьНаФормеПоказателиСПАРК();
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ПоследнееОбновлениеСПАРК) Тогда
		ПоследнееОбновлениеСПАРК = СтруктураРеквизитов.ПоследнееОбновлениеСПАРК;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АнкетыПодрядчиковПриИзменении(Элемент)
	
	ТекДанные = Элементы.АнкетыПодрядчиков.ТекущиеДанные;
	Если ТекДанные <> неопределено Тогда
		ЗаполнитьФормуПоАнкете(ТекДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИсторияПоказателейСПАРКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВопросыХарактеристикиКлиента(Команда)
	
	Объект.ХарактеристикиКлиента.Очистить();
	
	Вопросы = ПолучитьВопросыХарактеристикиКлиента();
	Для Каждого Вопрос Из Вопросы Цикл
		
		НоваяСтрока = Объект.ХарактеристикиКлиента.Добавить();
		НоваяСтрока.Вопрос = Вопрос;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВопросыХарактеристикиКлиента()
	
	Возврат Справочники.Контрагенты.ПолучитьВопросыХарактеристикиКлиента();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьВСтопЛисте" И Параметр = Объект.Ссылка Тогда
		ОбновитьСостояниеВСтопЛисте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМенеджерыПриИзменении(Элемент)
	
	ТекД = Элементы.ТабМенеджеры.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Редактор = ПользователиКлиент.ТекущийПользователь();
		ТекД.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 27.04.2020 ( Ticket#0187054
&НаКлиенте
Процедура УстановитьДоступностьЭлементовРасчетаРисков()
	
	ВыбранаКатегорияРиска = ЗначениеЗаполнено(КатегорияРискаПодрядчика);
	
	Элементы.ГруппаВводПараметра.Доступность = ВыбранаКатегорияРиска;
	Элементы.РасчетРисков.Доступность = ВыбранаКатегорияРиска;
	
КонецПроцедуры

//Евросиб Каблов 27.04.2020 )

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Евросиб (Гонтаренко 02.03.2021 #28263
//Евросиб Гудкова( 09.03.2021 Ticket№ грузится из БФ
//было  	РегистрыСведений.СобственныеКонтрагенты.УстановитьСнятьСобственныйКонтрагент(ТекущийОбъект.Ссылка, СобственныйКонтрагент);		
// Евросиб Гудкова)
	//Евросиб )Гонтаренко 02.03.2021 #28263 
	
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722
	Если ЗначениеЗаполнено(ОфисПродаж) Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(ТекущийОбъект.Ссылка,
			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ОфисПродаж,
			ОфисПродаж);
	Иначе
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(ТекущийОбъект.Ссылка,
			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ОфисПродаж);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 

КонецПроцедуры

// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 20.03.2023
&НаСервере
Процедура УстановитьЗначениеРеквизитаСибур(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рПО.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК рПО
		|ГДЕ
		|	рПО.Объект = &Объект
		|	И рПО.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
		|	И рПО.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.Сибур)";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда 
		КодКонтрагентаСибур = Выборка.УИДИсточника;
	КонецЕсли;	
	
КонецПроцедуры	
// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 20.03.2023  

// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 20.03.2023
&НаКлиенте
Асинх Процедура ИзменитьКодКонтрагентаСибур(Команда)
	Обещание = Ждать ВвестиСтрокуАсинх(КодКонтрагентаСибур);
	Если Не Обещание = Неопределено Тогда 
		КодКонтрагентаСибур = Обещание;
		СтруктураМенеджераЗаписи = Новый Структура("Объект,УИДИсточника",Объект.Ссылка,КодКонтрагентаСибур);
		ЗаписатьКодКонтрагентаСибурНаСервере(Объект.Ссылка,КодКонтрагентаСибур);
	КонецЕсли;
КонецПроцедуры
// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 20.03.2023 

// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 20.03.2023
&НаСервереБезКонтекста
Процедура ЗаписатьКодКонтрагентаСибурНаСервере(мОбъект,УИДИсточника)   
	
	ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных; 
	УзелОбмена = Перечисления.УзлыОбмена.Сибур;
	
	Если Не УИДИсточника = "" Тогда 
		МенеджерЗаписи = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДействиеПриОбмене = ДействиеПриОбмене;
		МенеджерЗаписи.УзелОбмена = УзелОбмена;
		МенеджерЗаписи.ДатаОбмена = ТекущаяДатаСеанса();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Объект = мОбъект;
		МенеджерЗаписи.УИДИсточника = УИДИсточника;
		МенеджерЗаписи.Записать();
	Иначе
		НаборЗаписей = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДействиеПриОбмене.Установить(ДействиеПриОбмене);
		НаборЗаписей.Отбор.УзелОбмена.Установить(УзелОбмена);
		НаборЗаписей.Отбор.Объект.Установить(мОбъект);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 20.03.2023

//Евросиб Коханенко Н.А. 02.08.2024 (( #88035 
// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, Объект.ТекущееСостояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ
//Евросиб Коханенко Н.А. 02.08.2024 )) #88035
