
&НаКлиенте
Процедура СравнительныйАнализ(Команда)
	
	ОткрытьФорму("Обработка.КартаСравнительногоАнализаПодрядчиков.Форма", Новый СТруктура("ЗаранееВыбранные", Элементы.список.ВыделенныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеАвтообновленияСтопЛиста(Команда)
	
	Расп = ПретензииИНеакцептыСервер.ПолучитьРасписаниеФоновогоЗаданияАвтоакцептов();
	ОпОп = Новый ОписаниеОповещения("ОкончаниеРедактированияРасписание", ПретензииИНеакцептыСервер);
	
	
	ДиалогРедактирования = Новый ДиалогРасписанияРегламентногоЗадания(Расп);
    ДиалогРедактирования.Показать(ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиABCXYZ(Команда)
	
	КонтрагентыДоговоры_сервер.РассчитатьПлановуюКатегориюКонтрагентов(ТекущаяДата());
	Сообщить("Расчет по заполненным клиентским карточкам произведен!");
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Не СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(Элементы.Список) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступностьКнопок = Элементы.Список.ТекущиеДанные.КонтрагентРезидент;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаГруппаРеестрИсключения", "Доступность", ДоступностьКнопок);
КонецПроцедуры
//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец
