Процедура ЗаполнитьРасшифровкуДебиторскойЗадолжености (ДокументКД) Экспорт
	
	ДокументКД.РасшифровкаДебиторскойЗадолженности.Очистить();
	ТЗРТУ = Новый ТаблицаЗначений;
	//Евросиб СубботинВ #103438 24.02.2025 Начало 
	//ТЗРТУ.Колонки.Добавить("Сделка",Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	ОписаниеТиповСсылкиДокументов = Новый ОписаниеТипов(МассивТипов); 
	ТЗРТУ.Колонки.Добавить("Сделка", ОписаниеТиповСсылкиДокументов); 
	//Евросиб СубботинВ #103438 24.02.2025 Конец
	ТЗРТУ.Колонки.Добавить("ДоговорКонтрагента",Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТЗРТУ.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка"));
	ТЗРТУ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	ТЗРТУ.Колонки.Добавить("ДатаВзаиморасчетов", Новый ОписаниеТипов("Дата"));	
	
	//Евросиб СубботинВ #103438 24.02.2025 Начало
	//Если ДокументКД.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
	Если ДокументКД.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее		
		или ((ДокументКД.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		или ДокументКД.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
		или ДокументКД.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности)
		и (ДокументКД.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя
			или ДокументКД.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя )) Тогда
	//
	//Евросиб СубботинВ #103438 24.02.2025 Конец


		Для Каждого СтрД Из ДокументКД.ДебиторскаяЗадолженность Цикл
			//Евросиб СубботинВ #103438 24.02.2025 Начало
			//Если ТипЗнч(СтрД.Сделка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ТипЗнч(СтрД.Сделка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				или ТипЗнч(СтрД.Сделка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда				
				//Евросиб СубботинВ #103438 24.02.2025 Конец			
				НоваяСтрокаТЗ = ТЗРТУ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, СтрД);
			КонецЕсли;
		КонецЦикла;
		        
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РТУ.Сделка КАК ДокументОснования,
		|	РТУ.Сумма КАК Сумма,
		|	РТУ.ГУИД КАК ГУИД,
		|	РТУ.ДатаВзаиморасчетов КАК ДатаВзаиморасчетов,
		|	РТУ.ДоговорКонтрагента КАК Договор
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	&РТУ КАК РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
		//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
		//|	РеализацияТоваровУслугУслуги.Ссылка КАК РТУ,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК ДокументОснования,
		//Евросиб СубботинВ #103438 24.02.2025 Начало
		|	ВТ_РТУ.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_РТУ.ГУИД КАК СТРОКА(36)) КАК ГУИД,
		|	ВТ_РТУ.ДатаВзаиморасчетов КАК ДатаВзаиморасчетов,
		|	ВТ_РТУ.Договор КАК Договор,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю.ДатаДокумента КАК СчетПокупателюДатаДокумента,
		//Евросиб Каблов 04.09.2025 ( #115139
		|   МИНИМУМ(Выбор Когда РеализацияТоваровУслугСчетаНаОплатуПокупателям.ВидДоходов = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг) тогда 0 иначе 1 конец) КАК Приоритет
		//Евросиб Каблов 04.09.2025 )		
		|ПОМЕСТИТЬ ВТ_СчетаПокупателю
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|		ПО ВТ_РТУ.ДокументОснования = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка
		//Евросиб СубботинВ #93039 15.10.2024 Начало 
		|			И (РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка))
		//Евросиб СубботинВ #93039 15.10.2024 Конец	
		|     
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РТУ.Договор,
		|	ВТ_РТУ.Сумма,
		|	ВЫРАЗИТЬ(ВТ_РТУ.ГУИД КАК СТРОКА(36)),
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка,
		|	ВТ_РТУ.ДатаВзаиморасчетов,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю.ДатаДокумента
		|  
		
		|ОБЪЕДИНИТЬ 
		|
		|ВЫБРАТЬ
		|ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,
		|ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка,
		|ВТ_РТУ.Сумма,
		|ВЫРАЗИТЬ(ВТ_РТУ.ГУИД КАК СТРОКА(36)),
		|ВТ_РТУ.ДатаВзаиморасчетов,
		|ВТ_РТУ.Договор,
		|ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю.ДатаДокумента,
		//Евросиб Каблов 04.09.2025 ( #115139
		|   МИНИМУМ(Выбор Когда ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.ВидДоходов = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг) тогда 0 иначе 1 конец) КАК Приоритет
		//Евросиб Каблов 04.09.2025 )
		|ИЗ
		|ВТ_РТУ КАК ВТ_РТУ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|	ПО ВТ_РТУ.ДокументОснования = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
		|		И (ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РТУ.Договор,
		|	ВТ_РТУ.Сумма,
		|	ВЫРАЗИТЬ(ВТ_РТУ.ГУИД КАК СТРОКА(36)),
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка,
		|	ВТ_РТУ.ДатаВзаиморасчетов,
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю.ДатаДокумента
		
		//Евросиб Каблов 04.09.2025 ( #115139
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.НеразнесеннаяСуммаОборот) КАК НеразнесеннаяСуммаОстаток,
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю КАК СчетПокупателю
		|ПОМЕСТИТЬ ВтОстаткиПоСчетам
		|ИЗ
		|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			СчетПокупателю В
		|				(ВЫБРАТЬ
		|					ВТ_СчетаПокупателю.СчетПокупателю КАК СчетНаОплату
		|				ИЗ
		|					ВТ_СчетаПокупателю КАК ВТ_СчетаПокупателю)) КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты
		|ГДЕ
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Регистратор <> &ДокРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю
		//Каблов 04.09.2025 ) #115139
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СчетаПокупателю.СчетПокупателю КАК СчетПокупателю,
		//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
        //|	ВТ_СчетаПокупателю.РТУ КАК РТУ,
		|	ВТ_СчетаПокупателю.ДокументОснования КАК ДокументОснования,
		//Евросиб СубботинВ #103438 24.02.2025 Конец
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК НеразнесеннаяСуммаОстаток,
		|	ВТ_СчетаПокупателю.Сумма КАК Сумма,
		|	ВТ_СчетаПокупателю.ГУИД КАК ГУИД,
		|	ВТ_СчетаПокупателю.ДатаВзаиморасчетов КАК ДатаВзаиморасчетов,
		|	ВТ_СчетаПокупателю.Договор КАК Договор,
		|	ВТ_СчетаПокупателю.СчетПокупателюДатаДокумента КАК СчетПокупателюДатаДокумента,
		//Евросиб Каблов 04.09.2025 ( #115139
		//|	ВТ_СчетаПокупателю.ВидЗадолженности КАК ВидЗадолженности
		|	ВТ_СчетаПокупателю.Приоритет КАК Приоритет
		//Евросиб Каблов 04.09.2025 ) #115139
		|ИЗ
		|	ВТ_СчетаПокупателю КАК ВТ_СчетаПокупателю
		//Евросиб Каблов 04.09.2025 ( #115139
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		//|		ПО ВТ_СчетаПокупателю.СчетПокупателю = РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю
		//|			И (РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток > 0)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОстаткиПоСчетам КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		|		ПО ВТ_СчетаПокупателю.СчетПокупателю = РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю
		|			И (РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток > 0)
		//Евросиб Каблов 04.09.2025 ) #115139
		|
		|УПОРЯДОЧИТЬ ПО
		//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
		//|РТУ
		//Евросиб СубботинВ #103438 24.02.2025 Конец
		|	ДокументОснования,
		//Евросиб Каблов 04.09.2025 ( #115139
		//|	ВидЗадолженности,
		|	Приоритет,
		//Евросиб Каблов 04.09.2025 ) #115139
		|	СчетПокупателюДатаДокумента,
		|	СчетПокупателю";		
		
		
		Запрос.УстановитьПараметр("РТУ", ТЗРТУ);
		Запрос.УстановитьПараметр("ДокРегистратор", ДокументКД.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
		//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
		//Пока ВыборкаРезультатЗапроса.СледующийПоЗначениюПоля("РТУ") Цикл
		Пока ВыборкаРезультатЗапроса.СледующийПоЗначениюПоля("ДокументОснования") Цикл	
		//Евросиб СубботинВ #103438 24.02.2025 Конец
			СуммаДляСписания = ВыборкаРезультатЗапроса.Сумма;
			ГУИДСтроки = ВыборкаРезультатЗапроса.ГУИД;
			//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
            //РТУрасшифровки = ВыборкаРезультатЗапроса.РТУ;
			ДокРасшифровки = ВыборкаРезультатЗапроса.ДокументОснования;
			//Евросиб СубботинВ #103438 24.02.2025 Конец
			ДатаВзаиморасчетов = ВыборкаРезультатЗапроса.ДатаВзаиморасчетов;
			ДоговорСписания  = ВыборкаРезультатЗапроса.Договор;
			Пока ВыборкаРезультатЗапроса.СледующийПоЗначениюПоля("СчетПокупателю")
				и СуммаДляСписания > 0 Цикл
				//Евросиб СубботинВ #93039 15.10.2024 Начало 
				ОстатокДляРазнесения = ВыборкаРезультатЗапроса.НеразнесеннаяСуммаОстаток; 
				СтруктураПоиска = Новый Структура("ДокументРасшифровки", ВыборкаРезультатЗапроса.СчетПокупателю);
				СтрокиПоТекущемуСчету =  ДокументКД.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(СтруктураПоиска);
				Если СтрокиПоТекущемуСчету.Количество() <> 0 Тогда
					СуммаСписанногоОстатка = 0;
					Для Каждого РанееОбработаннаяСтрока из СтрокиПоТекущемуСчету Цикл
						СуммаСписанногоОстатка = СуммаСписанногоОстатка + РанееОбработаннаяСтрока.Сумма;
					КонецЦикла;	
					ОстатокДляРазнесения = ОстатокДляРазнесения - СуммаСписанногоОстатка;
					Если ОстатокДляРазнесения = 0 тогда
						Продолжить;
					КонецЕсли;	
				КонецЕсли;
				//Евросиб СубботинВ #93039 15.10.2024 Конец 
				НовСтрока = ДокументКД.РасшифровкаДебиторскойЗадолженности.Добавить();
				НовСтрока.ГУИДДебиторскаяЗадолженность =  ГУИДСтроки; 
				НовСтрока.ДатаРасчетов = ДатаВзаиморасчетов;
				//Евросиб СубботинВ #103438 24.02.2025 Начало // переименовал поле
				//НовСтрока.ДокументРасчетов = РТУрасшифровки;
				НовСтрока.ДокументРасчетов = ДокРасшифровки;
				//Евросиб СубботинВ #103438 24.02.2025 Конец
				НовСтрока.ДоговорКонтрагента = ДоговорСписания;
				НовСтрока.ДокументРасшифровки  = ВыборкаРезультатЗапроса.СчетПокупателю;
				СуммаДвижения = Мин(СуммаДляСписания, ОстатокДляРазнесения);
				НовСтрока.Сумма = СуммаДвижения;
				СуммаДляСписания = СуммаДляСписания - СуммаДвижения;
			КонецЦикла;			
		КонецЦикла;
	КонецЕсли;	
	
	
КонецПроцедуры	