// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПредставленияCodeco")
		и Параметры.ПредставленияCodeco.Количество() Тогда
	    Список.ЗагрузитьЗначения(Параметры.ПредставленияCodeco);
	КонецЕсли;   
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
	    ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
		ЭтаФорма.АвтоЗаголовок = Ложь;
	КонецЕсли;
КонецПроцедуры

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть(Список.ВыгрузитьЗначения());
КонецПроцедуры

