 
 //Субботин 77659 24.11.2023 Начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	МассивРеквизитов = Новый Массив;

	СтруктураОтбора = Новый Структура("Релиз", Неопределено); 
	РелизНеопределено = (Параметры.ТЧУслуги.выгрузить(СтруктураОтбора)); 
	СтруктураОтбора = Новый Структура("Релиз", Документы.РелизКлиента.ПустаяСсылка()); 
	РелизКлиента = (Параметры.ТЧУслуги.выгрузить(СтруктураОтбора));
	
	Для каждого СтрокаТЗ Из РелизКлиента Цикл ЗаполнитьЗначенияСвойств(РелизНеопределено.Добавить(), СтрокаТЗ) КонецЦикла;
	ТЗУслуги.Загрузить(РелизНеопределено); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Заявка_услуг.ТипКТК КАК ТипКТК,
		|	Заявка_услуг.ПерваяМиля КАК ПерваяМиля,
		|	Заявка_услуг.ПоследняяМиля КАК ПоследняяМиля,
		|	Заявка_услуг.ВидСобственности КАК ВидСобственности,
		|	Заявка_услуг.РазмерКТК КАК РазмерКТК,
		|	Заявка_услуг.Релиз КАК Релиз,
		|	Заявка_услуг.НомерКТК КАК НомерКТК,
		|	Заявка_услуг.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	Заявка_услуг.ПеренесенВЗаявку КАК ПеренесенВЗаявку
		|ПОМЕСТИТЬ ВТ_ЗаявкаТЧ_услуги
		|ИЗ
		|	&Заявка_услуги КАК Заявка_услуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявкаТЧ_услуги.НомерКТК КАК УчетнаяЕдиница,
		|	ВТ_ЗаявкаТЧ_услуги.ТипКТК КАК ТипКТК,
		|	ВТ_ЗаявкаТЧ_услуги.ПерваяМиля КАК ПерваяМиля,
		|	ВТ_ЗаявкаТЧ_услуги.ПоследняяМиля КАК ПоследняяМиля,
		|	ВТ_ЗаявкаТЧ_услуги.ВидСобственности КАК ВидСобственности,
		|	ВТ_ЗаявкаТЧ_услуги.РазмерКТК КАК РазмерКТК
		|ИЗ
		|	ВТ_ЗаявкаТЧ_услуги КАК ВТ_ЗаявкаТЧ_услуги
		|ГДЕ
		|	ВТ_ЗаявкаТЧ_услуги.ПринадлежностьТЕ = &ПринадлежностьТЕ
		|	И НЕ ВТ_ЗаявкаТЧ_услуги.НомерКТК В (&НомераКТК)	
		|	И ВТ_ЗаявкаТЧ_услуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|	И ВТ_ЗаявкаТЧ_услуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ПринадлежностьТЕ", Перечисления.ПринадлежностьТЕ.КТЕвросиба);
	Запрос.УстановитьПараметр("Заявка_услуги", ТЗУслуги.Выгрузить());	
	Запрос.УстановитьПараметр("НомераКТК", Параметры.СоставТЕ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокКТК.Загрузить(РезультатЗапроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСчетчик();
КонецПроцедуры 

&НаКлиенте
Процедура Перенести(Команда)
	
	СтрокаТипоразмер = "" ;
	СтрокаПерваяМиля = "" ;
	СтрокаПоследняяМиля = "";
	ЭтоПервый = Истина;
	
	МассивВыбранных = Новый Массив;
	СтруктураПоиска = Новый Структура("Пометка", Истина); 
	ВыбранныеКтк = СписокКТК.НайтиСтроки(СтруктураПоиска);
	Если ВыбранныеКтк.Количество() > 0 Тогда
		Для каждого Стр из ВыбранныеКтк Цикл 
			Если Стр.Пометка и ЭтоПервый Тогда
				ЭтоПервый = Ложь;
				СтрокаТипоразмер = Стр.ТипКТК;
				СтрокаПерваяМиля = Стр.ПерваяМиля;
				СтрокаПоследняяМиля = Стр.ПоследняяМиля;
				МассивВыбранных.Добавить(Стр);
			ИначеЕсли Стр.Пометка и СтрокаТипоразмер = Стр.ТипКТК и СтрокаПерваяМиля = Стр.ПерваяМиля и	СтрокаПоследняяМиля = Стр.ПоследняяМиля тогда
				МассивВыбранных.Добавить(Стр);
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю("Выбор ктк с разными типами или способами автоперевозки невозможен");
				Возврат
			КонецЕсли; 
		КонецЦикла;
		Закрыть(МассивВыбранных);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбраны ктк для переноса");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из СписокКТК Цикл Стр.Пометка = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	Для каждого Стр из СписокКТК Цикл Стр.Пометка = Ложь; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчик()
	
	Для Сч = 1 По СписокКТК.Количество() Цикл
		СписокКТК[Сч-1].N = Сч;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокКТКПослеУдаления(Элемент)
	ОбновитьСчетчик();
КонецПроцедуры

//Субботин 77801 28.11.2023 Конец 


