
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Автор 			= Пользователи.ТекущийПользователь();
	Создано 		= ТекущаяДата();
	Организация 	= Константы.ОсновнаяОрганизация.Получить();
	//Евросиб Каблов 09.04.2025 ( #105407
	//НовыйПериодВО 	= ДобавитьМесяц(КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация),-1);
	НовыйПериодВО 	= ДобавитьМесяц(КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация),-1);
	//Евросиб Каблов 09.04.2025 )

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Повторная запись проведенного документа запрещена!");
		Возврат;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//НачатьТранзакцию();
	Ошибки = "";     
	ЕстьОшибки = Ложь;                     
	СоответствиеСделок = Новый Соответствие;
	Для каждого СтрокаПереноса Из ДокументыДляПереноса Цикл
		обДокументПереноса = СтрокаПереноса.ДокументДляПереноса.ПолучитьОбъект();
		обДокументПереноса.ПериодВО = НовыйПериодВО;
		//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587    
		//Евросиб Дубская 09.02.2023 ( Ticket#0299935
		//Если ТипЗнч(СтрокаПереноса.ДокументДляПереноса)  = Тип("ДокументСсылка.КорректировкаРеализации") 
		Если (ТипЗнч(СтрокаПереноса.ДокументДляПереноса) = Тип("ДокументСсылка.КорректировкаРеализации")
				И ЗначениеЗаполнено(обДокументПереноса.ДатаСоставления))
		//Евросиб Дубская 09.02.2023 )	
			ИЛИ ТипЗнч(СтрокаПереноса.ДокументДляПереноса) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			Тогда                                                          
			//Евросиб Дубская 26.01.2023 ( Ticket#0299496
			//обДокументПереноса.ДатаСоставления = КонецМесяца(НовыйПериодВО);
			Если КонецМесяца(обДокументПереноса.ДатаДокумента) = КонецМесяца(НовыйПериодВО) Тогда
				обДокументПереноса.ДатаСоставления = обДокументПереноса.ДатаДокумента;  
			Иначе
				обДокументПереноса.ДатаСоставления = КонецМесяца(НовыйПериодВО);
			КонецЕсли;
			//Евросиб Дубская 26.01.2023 )
		КонецЕсли;
		//Евросиб Литвинов) 	
		//обДокументПереноса.ДатаДокумента = НовыйПериодВО;
		//Евросиб Каблов 15.02.2022 ( Ticket#0259157
		Если ТипЗнч(обДокументПереноса) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
			ПериодВОДокументаРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(обДокументПереноса.ДокументРеализации, "ПериодВО");
			Если ПериодВОДокументаРеализации >= обДокументПереноса.ПериодВО Тогда
				обДокументПереноса.ДатаДокумента = КонецМесяца(обДокументПереноса.ПериодВО);
			Иначе
				обДокументПереноса.ДатаДокумента = НачалоМесяца(обДокументПереноса.ПериодВО);
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 15.02.2022 )
		Попытка
			обДокументПереноса.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			ЕстьОшибки = Истина;
			Ошибки = Ошибки + ОписаниеОшибки();
		КонецПопытки;                                                         
		Если ТипЗнч(обДокументПереноса) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			Для каждого СтрокаУслуга Из обДокументПереноса.Услуги Цикл
				обСделка = СоответствиеСделок.Получить(СтрокаУслуга.Сделка);
				Если обСделка = Неопределено Тогда
					обСделка = СтрокаУслуга.Сделка.ПолучитьОбъект();
					СоответствиеСделок.Вставить(СтрокаУслуга.Сделка, обСделка);
				КонецЕсли;		                                               
				СтрокаДоходы = обСделка.Доходы.Найти(СтрокаУслуга.СтрокаДоходовСделки, "ГУИД");
				//Евросиб Каблов 14.02.2022 ( Ticket#0259157
				//СтрокаДоходы.ПериодВО = обДокументПереноса.ПериодВО;
				Если СтрокаДоходы <> Неопределено Тогда
					СтрокаДоходы.ПериодВО = обДокументПереноса.ПериодВО;
				КонецЕсли
				//Евросиб Каблов 14.02.2022 )
			КонецЦикла;
		ИначеЕсли ТипЗнч(обДокументПереноса) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") Тогда
			Для каждого СтрокаУслуга Из обДокументПереноса.Товары Цикл
				обСделка = СоответствиеСделок.Получить(обДокументПереноса.Сделка);
				Если обСделка = Неопределено Тогда
					обСделка = обДокументПереноса.Сделка.ПолучитьОбъект();
					СоответствиеСделок.Вставить(обДокументПереноса.Сделка, обСделка);
				КонецЕсли;		                                               
				СтрокаДоходы = обСделка.Доходы.Найти(СтрокаУслуга.СтрокаДоходовСделки, "ГУИД");
				//Евросиб Каблов 14.02.2022 ( Ticket#0259157
				//СтрокаДоходы.ПериодВО = обДокументПереноса.ПериодВО;
				Если СтрокаДоходы <> Неопределено Тогда
					СтрокаДоходы.ПериодВО = обДокументПереноса.ПериодВО;
				КонецЕсли
				//Евросиб Каблов 14.02.2022 )
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	Для каждого СтрокаСоответствие Из СоответствиеСделок Цикл
		СтрокаСоответствие.Значение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	Для каждого СтрокаОбработки Из АкцептыДляОбработки Цикл 
		Если ЕстьОшибки Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		Поступление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОбработки.Акцепт, "Поступление");
		//обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
		//ПериодАкцепта = Мин(обАкцепт.ПериодВО, обАкцепт.ПериодБУ);
		//ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(обАкцепт, Истина, ПериодАкцепта);
		//обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
		//Попытка
		//	обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение   
		//	ЕстьОшибки = Истина;
		//	Ошибки = Ошибки + ОписаниеОшибки();
		//КонецПопытки;
		//СтрокаОбработки.Акцепт = обАкцепт.Ссылка;
		Попытка
			ОбАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
			ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(СтрокаОбработки.Акцепт.Услуги.Выгрузить(), обАкцепт.Услуги.выгрузить(),,, Истина);		
			//Если ВДокументеНетИзменений = Ложь ИЛИ ДокументИзменен Тогда
			Если ИзмененийНет = Ложь Тогда
				//)
				//Евросиб - АСуслов 12.01.2022 18:17:35 #
				обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
				обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			ЕстьОшибки = Истина;
			Ошибки = Ошибки + ОписаниеОшибки() + "
			|Необходимо исключить из переноса " + СтрокаОбработки.ДокументИСФ;
		КонецПопытки;
	КонецЦикла;
	Если ЕстьОшибки = Ложь Тогда
		УчетДоходовРасходовСервер.ПереносИСФ_СформироватьДвиженияПереносаДанных(ЭтотОбъект);
		ЭтотОбъект.Записать();
	//	ЗафиксироватьТранзакцию();
	Иначе               
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
		Отказ = Истина;
	//	ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	НачатьТранзакцию();
	Ошибки = "";     
	ЕстьОшибки = Ложь;
	Для каждого СтрокаПереноса Из ДокументыДляПереноса Цикл
		обДокументПереноса = СтрокаПереноса.ДокументДляПереноса.ПолучитьОбъект();
		обДокументПереноса.ПериодВО = ДобавитьМесяц(НовыйПериодВО,1);
		//обДокументПереноса.ДатаДокумента = ДобавитьМесяц(НовыйПериодВО,1);
		Попытка
			обДокументПереноса.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			ЕстьОшибки = Истина;
			Ошибки = Ошибки + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла; 
	Для каждого СтрокаОбработки Из АкцептыДляОбработки Цикл                                 
		Поступление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОбработки.Акцепт, "Поступление");
		обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Ложь);
		ПериодАкцепта = Мин(обАкцепт.ПериодВО, обАкцепт.ПериодБУ);
		ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(обАкцепт, Истина, ПериодАкцепта);
		обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
		Попытка
			обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			ЕстьОшибки = Истина;
			Ошибки = Ошибки + ОписаниеОшибки();
		КонецПопытки;
		СтрокаОбработки.Акцепт = обАкцепт.Ссылка;
	КонецЦикла;
	Если ЕстьОшибки = Ложь Тогда
		//УчетДоходовРасходовСервер.ПереносИСФ_СформироватьДвиженияПереносаДанных(ЭтотОбъект);
		ЭтотОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Иначе               
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
		Отказ = Истина;
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры
