
&НаСервере
Процедура ПрочитатьДанныеMAERSKНаСервере()
	
	Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_VESSELS();
	
	ЧТДЖ = Новый ЧтениеJSON();
	ЧТДЖ.УстановитьСтроку(Результат);
	
	РЕЗ = ПрочитатьJSON(ЧТДЖ);
	
	Для каждого стр из РЕЗ.vessels Цикл
		
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр, "code,name");
		
		Если ЗначениеЗаполнено(НСтр.code) Тогда
			
			ДеталиПоСудну = ЗагрузкаВнешнихИсточников_сервер.MAERSK_VESSEL_DETAILED(НСтр.code);
			
			Если ДеталиПоСудну <> "" Тогда
				ЧТДЖ2 = Новый ЧтениеJSON();
				ЧТДЖ2.УстановитьСтроку(ДеталиПоСудну);
				РЕЗ2 = ПрочитатьJSON(ЧТДЖ2);
				ЗаполнитьЗначенияСвойств(НСтр, РЕЗ2);
			Иначе
				НСтр.Ошибка = Истина;
			КонецЕсли;
			
			НСтр.Судно = ЗагрузкаВнешнихИсточников_сервер.ПолучитьТСПоИдентификаторуMAERSK(НСтр.code); // Справочники.ТС.НайтиПоРеквизиту("ИдентификаторMAERSK", НСтр.code);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеMAERSK(Команда)
	
	ТЧ.Очистить();
	ПрочитатьДанныеMAERSKНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеСудов(Команда)
	ЗаписатьДанныеСудовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеСудовНаСервере()
	
	Сч = 0;
	
	Для каждого стр из ТЧ Цикл
		
		Если стр.Ошибка Тогда Продолжить; КонецЕсли;
		
		СудноО = Справочники.ТС.СоздатьЭлемент();
		
		Если ЗначениеЗаполнено(стр.Судно) тогда
			СудноО = стр.Судно.ПолучитьОбъект();
		КонецЕсли;
		
		СудноО.Наименование 	= стр.name;
		СудноО.ТипТС 			= ТипТСДляСудов;
		СудноО.ВладелецТС 		= ВладелецЗагружаемыхТС;
		СудноО.flag 			= стр.flag;
		СудноО.imoNumber 		= стр.imoNumber;
		СудноО.buildDate 		= ПреобразоватьДату(стр.buildDate);
		СудноО.callSign 		= стр.callSign;
		СудноО.longName 		= стр.longName;
		СудноО.capacityTeu 		= ?(стр.capacityTeu = "", 0, Число(стр.capacityTeu));
		СудноО.class 			= стр.class;
		СудноО.serviceCode 		= стр.serviceCode;
		СудноО.ИдентификаторMAERSK = стр.code;
		СудноО.Записать();
		
		стр.Судно = СудноО.Ссылка;
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	Сообщить("Обновлено " + Сч  + " карточек!");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразоватьДату(ВхДата)
	
	Результат = неопределено;
	
	Если ЗначениеЗаполнено(ВхДата) Тогда
		Результат = Дата(СтрЗаменить(ВхДата, "-", ""));
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
