//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция GetNumberOrder(XMLParams)
	Возврат ОбменДаннымиЗаявки.СоздатьЗапросНаПолучениеНомера(XMLParams);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция GetOrders(XMLParams)
	Возврат ОбменДаннымиЗаявки.ВыгрузитьЗаявки(XMLParams);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция PutOrders(XMLParams)
	Возврат ОбменДаннымиЗаявки.ОбновитьДанныеЗаявки(XMLParams);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция DownloadConfirmation(XMLParams)
	Возврат ОбменДаннымиЗаявки.ПодтвердитьЗагрузкуДокументовВУзелОбмена(XMLParams);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец
