
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазмерКТК = Параметры.РазмерКТК;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Контрагент КАК Клиент,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Договор КАК Договор,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка КАК Калькуляция,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения КАК ПунктНазначения,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ВидРасходов КАК ВидРасходов,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Валюта КАК Валюта,
	               |	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	               |	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	КалькуляцияЖД_УслугиВнеСтавки.БазаДляРасчетаВР КАК БазаДляРасчетаВР,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20 КАК Себестоимость20,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение20 КАК Вознаграждение20,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ставка20 КАК Ставка20,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40 КАК Себестоимость40,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение40 КАК Вознаграждение40,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ставка40 КАК Ставка40,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Поставщик КАК Поставщик,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Договор КАК Поставщик_Договор,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки КАК ТипСтавки,
	               |	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения
	               |ИЗ
	               |	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	               |ГДЕ
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Параметры.Калькуляция);
	ПСЦ = ПолучитьПСЦ(Параметры.Калькуляция);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.ПСЦ = ПСЦ;
		
	КонецЦикла;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Функция ПолучитьПСЦ(Калькуляция)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПСЦКалькуляции.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	               |ГДЕ
	               |	ПСЦКалькуляции.Калькуляция = &Калькуляция
	               |	И НЕ ПСЦКалькуляции.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПСЦКалькуляции.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ТЧВыбраноПриИзменении(Элемент)
	
	Для каждого Стр из ТЧ Цикл Стр.Выбрано = Ложь; КонецЦикла;
	Элементы.ТЧ.ТекущиеДанные.Выбрано = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЪ(Команда)
	
	Результат = неопределено;
	Для каждого Стр из ТЧ Цикл
		Если Стр.Выбрано Тогда Результат = Новый Структура(
			"Клиент, Договор, Услуга, Калькуляция, ПСЦ, Количество, СтавкаНДС, НДСВключенВСтоимость, РазмерКТК, Валюта, ПроцентВознаграждения, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Вознаграждение, ВознаграждениеИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ТипСтавки",
			
			Стр.Клиент,
			Стр.Договор,
			Стр.Услуга,
			Стр.Калькуляция,
			Стр.ПСЦ,
			1,
			Стр.СтавкаНДС,
			Стр.СуммаВключаетНДС,
			РазмерКТК,
			Стр.Валюта,
			Стр.ПроцентВознаграждения,
			Стр.СтавкаНДСВознаграждения,
			Стр.ВознаграждениеВключаетНДС,
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Себестоимость20, Стр.Себестоимость40),
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Себестоимость20, Стр.Себестоимость40),
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Вознаграждение20, Стр.Вознаграждение40),
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Вознаграждение20, Стр.Вознаграждение40),
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Ставка20, Стр.Ставка40),
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Ставка20, Стр.Ставка40),
			0,
			?(РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"), Стр.Ставка20, Стр.Ставка40),
			Стр.Поставщик,
			Стр.Поставщик_Договор,
			Стр.Услуга,
			Стр.ПунктОтправления,
			Стр.ПунктНазначения,
			Стр.СтавкаНДС,
			Стр.СуммаВключаетНДС,
			1,
			Стр.Валюта,
			Стр.ТипСтавки
			
			); Прервать; КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры
