
Функция ПолучитьEMAILПользователя(Контрагент) 
	
	Результат = "";
	Для каждого Стр из Контрагент.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(Стр.АдресЭП) тогда
			Результат = Стр.Представление;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура РассылкаПоПФВагонов() Экспорт
	
	РассылкаПоПФВагоновПользователям();
	
КонецПроцедуры

Процедура РассылкаПоПФВагоновПользователям() Экспорт
	
	Возврат;
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда 
		возврат; 
	КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ГруппаПолучателей = Константы.ГруппаИсполнителейПоНазначениюВагонов.Получить();
	Если НЕ ЗначениеЗаполнено(ГруппаПолучателей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаПоПланФактВагонов.Период КАК Период,
		|	РассылкаПоПланФактВагонов.ВагонПлан КАК ВагонПлан,
		|	РассылкаПоПланФактВагонов.Сделка КАК Сделка,
		|	РассылкаПоПланФактВагонов.ВагонФакт КАК ВагонФакт,
		|	РассылкаПоПланФактВагонов.ТипТС КАК ТипТС,
		|	РассылкаПоПланФактВагонов.ТЕУ КАК ТЕУ
		|ИЗ
		|	РегистрСведений.РассылкаПоПланФактВагонов КАК РассылкаПоПланФактВагонов
		|ИТОГИ ПО
		|	Сделка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Стр Из ГруппаПолучателей.Состав Цикл
	
		ВыборкаСделка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// одно письмо для каждого пользователя
		Тема = "Несоответствие по плану и факту назначенных вагонов";
		ТекстПисьма = "";
		ПолучателиПисьма = Новый Массив;
		
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		EMAIL = ПолучитьEMAILПользователя(Стр.Пользователь);
		Если ЗначениеЗаполнено(EMAIL) Тогда
			Для каждого ЭлПисьма из СтрРазделить(EMAIL, ";", Ложь) Цикл
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(Стр.Пользователь), ЭлПисьма));
			КонецЦикла;
		КонецЕсли;
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		// для вложений
		Соответствие = Новый Соответствие();
		
		Пока ВыборкаСделка.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаСделка.Выбрать();
			
			// в зависсимости от того, вагонная или контейнерная дислокация, формируются разные макеты
			ТабДок = Новый ТабличныйДокумент;
			ТабДок.АвтоМасштаб = Истина;
			
			Макет = РегистрыСведений.РассылкаПоПланФактВагонов.ПолучитьМакет("МакетРассылки");
			
			ТабДок.НачатьАвтогруппировкуКолонок();
			
			// заполнение таблицы макета
			Область = Макет.ПолучитьОбласть("ОбластьШапка"); 
			ТабДок.Вывести(Область);
			
			НомерСтр = 1;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Область = Макет.ПолучитьОбласть("ОбластьСтроки"); 
				Область.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				Область.Параметры.НомерПП = НомерСтр;
				ТабДок.Вывести(Область);
				
				НомерСтр = НомерСтр+1;
				
			КонецЦикла;
			
			// сформировать табличный документ
			ТабДок.ЗакончитьАвтогруппировкуКолонок();
			ТабДок.ОтображатьСетку = Истина;
			ТабДок.Защита = Ложь;
			ТабДок.ТолькоПросмотр = Истина;		
			ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
			ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			
			ФайлВложения = Новый ДвоичныеДанные(ИмяФайла);
			Соответствие.Вставить("План/факт по вагонам.xlsx",ФайлВложения);

			ПараметрыОтправкиПисьма.Вставить("Вложения", Соответствие);

		КонецЦикла;
		
		РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);

	КонецЦикла;

	НаборЗаписей = РегистрыСведений.РассылкаПоПланФактВагонов.СоздатьНаборЗаписей();  			
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
	    ЗаписьНабора.Отправлено = Истина;
	КонецЦикла;
	НаборЗаписей.Записать();	
КонецПроцедуры

