
Процедура ЗаписатьДанныеВРасчет(ДанныеРасчетов) Экспорт
	
	ГуидыДоходныхСтрок = ДанныеРасчетов.ВыгрузитьКолонку("ГуидСтроки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыДопРасходы.Ссылка КАК ДокументРасчет,
	|	РасчетыДопРасходы.ГУИДСтрокиДохода КАК ГУИДСтрокиДохода
	|ИЗ
	|	Документ.РасчетДополнительныеРасходы КАК РасчетыДопРасходы
	|ГДЕ
	|	РасчетыДопРасходы.ГУИДСтрокиДохода В(&ГуидыДоходныхСтрок)";
	
	Запрос.УстановитьПараметр("ГуидыДоходныхСтрок", ГуидыДоходныхСтрок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ДокументРасчет.ПолучитьОбъект();
		ДанныеСтроки = ДанныеРасчетов.НайтиСтроки(Новый Структура("ГуидСтроки", Выборка.ГУИДСтрокиДохода))[0];
		ДокументОбъект.КомментарийУдаленияДоходнойСтроки = ДанныеСтроки.Комментарий;
		ДокументОбъект.ПричинаПометкиНаУдаление = "Доходная строка удалена пользователем";
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.ДополнительныеСвойства.Вставить("УдалениеСтрокиДоходов");
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры

