
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПометкаДоЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
	Если ПометкаУдаления <> ПометкаДоЗаписи И Не ДополнительныеСвойства.Свойство("УдалениеСтрокиДоходов") Тогда
		Если ПометкаУдаления И Не ЗначениеЗаполнено(ЗакрывающийСчет) И Не ЗначениеЗаполнено(УчетныйДокумент) Тогда
			ПричинаПометкиНаУдаление = "Удален пользователем";
			Если ЗначениеЗаполнено(ГУИДСтрокиДохода) Тогда
				ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
			КонецЕсли;
			// Евросиб US 119867 TA 120221 Рыбьяков К.А. 10.10.2025 ((
			Если Не ЗначениеЗаполнено(ГУИДСтрокиДохода) И РасчетНеОбработанОчередью() Тогда
				МенеджерЗаписи = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ОбрабатываемыйОбъект = Сделка;
				МенеджерЗаписи.ИсточникИзменения = Ссылка;
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.Удалить();
				КонецЕсли;
			КонецЕсли;
			// Евросиб Рыбьяков К.А. 10.10.2025 ))
		Иначе
			Если ЗначениеЗаполнено(ЗакрывающийСчет) Или ЗначениеЗаполнено(УчетныйДокумент) Тогда
				ТекстСообщения = НСтр("ru = 'По строке заполнено РТУ и Счет на оплату, задача не может быть удалена.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			ПричинаПометкиНаУдаление = "";
			КомментарийУдаленияДоходнойСтроки = "";
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("УдалениеЗаявки") Тогда
		ПричинаПометкиНаУдаление = "Заявка удалена из сделки";
		ПометкаУдаления = Истина;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(ГУИДСтрокиДохода) Тогда
		ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 15.04.2025 ((	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.04.2025 ))
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура УдалитьДоходнуюСтрокуСвязаннуюСРасчетом() Экспорт
	
	//Перед удалением заполним рту, чтобы не удалить строчку, по которой рту создана, но её нет в сделке
	//СделкаОбъект = Сделка.ПолучитьОбъект();
	//Документы.Сделка.ЗаполнитьУчетныеДокументыВДоходах(СделкаОбъект);
	//
	//МассивУдаляемыхСтрок = Новый Массив;
	//МассивИдентификаторовУдаляемыхСтрок = Новый Массив;
	//
	//ТекущаяСтрока = СделкаОбъект.Доходы.НайтиСтроки(Новый Структура("ГУИД", ГУИДСтрокиДохода))[0];
	//МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
	//МассивИдентификаторовУдаляемыхСтрок.Добавить(ГУИДСтрокиДохода);
	//
	//Документы.Сделка.ОчиститьДанныеВВспомогательныхТаблицахНаСервере(СделкаОбъект, МассивИдентификаторовУдаляемыхСтрок, "Доходы");
	//Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
	//	СделкаОбъект.Доходы.Удалить(УдаляемаяСтрока);
	//КонецЦикла;
	//
	//СделкаОбъект.Записать();
	
КонецПроцедуры

// Евросиб US 119867 TA 120221 Рыбьяков К.А. 10.10.2025 ((
Функция РасчетНеОбработанОчередью()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения КАК ИсточникИзменения
	|ИЗ
	|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
	|ГДЕ
	|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения = &ИсточникИзменения
	|	И НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано";
	
	Запрос.УстановитьПараметр("ИсточникИзменения", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // Евросиб Рыбьяков К.А. 10.10.2025 ))

#КонецОбласти