
&НаКлиенте
Процедура Цвет_RПриИзменении(Элемент)
	
	ОбновитьЦвет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦвет()
	
	Если (Объект.Цвет_R+Объект.Цвет_G+Объект.Цвет_B) > 0 Тогда
		Элементы.Наименование.ЦветФона = Новый Цвет(Объект.Цвет_R, Объект.Цвет_G, Объект.Цвет_B);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_GПриИзменении(Элемент)
	
	ОбновитьЦвет();
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет_BПриИзменении(Элемент)
	
	ОбновитьЦвет();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЦвет();
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

