
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа тогда
		Услуга = Истина;
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если СинонимыНоменклатуры.Количество() = 0 И Не ЭтоГруппа Тогда
		СинонимыНоменклатуры.Добавить().СинонимНоменклатуры = Наименование;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СинонимыНоменклатуры.Очистить();
	РазрешенныеЕИ.Очистить();
	
КонецПроцедуры
