
//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	КнопкаВыбрать = Элементы.Вставить("КнопкаВыбрать", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель, Элементы.ФормаВыбрать);
	КнопкаВыбрать.ИмяКоманды = "Выбрать";
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб - АСуслов 26.01.2024 15:25:26 #78327
//(
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если РаботаСФормамиКлиент.ПолучитьИмяВладельца(ЭтаФорма).ИмяФормы = "Документ.ЗаявкаНаОплату.Форма.ФормаДокумента" Тогда
		ДокументВыгруженВУПП = ПроверитьДокументВыгруженВУППНаСервере(ВыбраннаяСтрока);
		Если Не ДокументВыгруженВУПП Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("По выбранному документу основанию не создан Заказ в УПП/ не создана Корректировка заказа в УПП. Выбор отменен.");
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры                                                                        

&НаСервереБезКонтекста
Функция ПроверитьДокументВыгруженВУППНаСервере(Документ)
	
	//Евросиб СубботинВ #118799 09.10.2025 Начало
	//РезультатПроверки = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Документ, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	//Возврат ЗначениеЗаполнено(РезультатПроверки.ДатаОбмена);
	РезультатПроверки = ЗаявкиНаОплатуСервер.ПроверитьДокументВыгруженВУППНаСервере(Документ); 
	Возврат ЗначениеЗаполнено(РезультатПроверки);
	//Евросиб СубботинВ #118799 09.10.2025 Конец

КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	Если РаботаСФормамиКлиент.ПолучитьИмяВладельца(ЭтаФорма).ИмяФормы = "Документ.ЗаявкаНаОплату.Форма.ФормаДокумента" Тогда
		ДокументВыгруженВУПП = ПроверитьДокументВыгруженВУППНаСервере(Элементы.Список.ВыделенныеСтроки[0]);
		Если Не ДокументВыгруженВУПП Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("По выбранному документу основанию не создан Заказ в УПП. Выбор отменен.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ОповеститьОВыборе(Элементы.Список.ВыделенныеСтроки[0]);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РаботаСФормамиКлиент.ПолучитьИмяВладельца(ЭтаФорма).ИмяФормы = "Документ.ЗаявкаНаОплату.Форма.ФормаДокумента" Тогда
		Элементы.КнопкаВыбрать.ЦветФона = Новый Цвет(255, 255, 0);
		//Элементы.КнопкаВыбрать.Шрифт = Новый Шрифт(,,Истина);
		Элементы.ФормаВыбрать.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
//)
//Евросиб - АСуслов 26.01.2024 15:25:28 #78327
