
&НаСервере
Процедура ОбновитьНаСервере()
	
	ТабДок = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.ПФ_MXL_СправочникГрузовСКлассами");
	Для ТекИндексЧисло = 1 По ТабДок.ВысотаТаблицы Цикл
		ТекИнд = Формат(ТекИндексЧисло,"ЧГ=0");
        Область_cgCode = ТабДок.Область("R" + Строка(ТекИнд) + "C1");
		Область_cgName = ТабДок.Область("R" + Строка(ТекИнд) + "C2");
		Область_cgDTInit = ТабДок.Область("R" + Строка(ТекИнд) + "C3");
		Область_cgProps = ТабДок.Область("R" + Строка(ТекИнд) + "C4");
		Область_cgRecID = ТабДок.Область("R" + Строка(ТекИнд) + "C5");
		Область_cgRfCode = ТабДок.Область("R" + Строка(ТекИнд) + "C6");
		Область_cgFLDUpd = ТабДок.Область("R" + Строка(ТекИнд) + "C7");
		Область_class = ТабДок.Область("R" + Строка(ТекИнд) + "C8");
	        
        Если ЗначениеЗаполнено(Область_cgCode.Текст) Тогда
			ЗаписьРС = РегистрыСведений.КлассыГрузов.СоздатьМенеджерЗаписи();
			ЗаписьРС.cgCode = Область_cgCode.Текст;
			ЗаписьРС.cgName = Область_cgName.Текст;
			ЗаписьРС.cgDTInit = Область_cgDTInit.Текст;
			ЗаписьРС.cgProps = Область_cgProps.Текст;
			ЗаписьРС.cgRecID = Область_cgRecID.Текст;
			ЗаписьРС.cgRfCode = Область_cgRfCode.Текст;
			ЗаписьРС.cgFLDUpd = Область_cgFLDUpd.Текст;
			ЗаписьРС.class = Область_class.Текст;
			ЗаписьРС.Записать();
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
