//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
&НаКлиенте
Перем ИдентификаторЗамераПроведение;
//Евросиб Гудкова)

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	//Евросиб - АСуслов 06.01.2023 10:10:41 #63243
	//(
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы, Объект);
	//)
	//Евросиб - АСуслов 06.01.2023 10:10:59 #63243
	//Евросиб Каблов 07.07.2021 ) 
	//Евросиб СубботинВ Подправил баг открытия формы 27.06.2025 Начало
	Если Объект.Поступление = Неопределено Тогда
		Объект.Поступление = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	//Евросиб СубботинВ Подправил баг открытия формы 27.06.2025 Конец
	
	СтруктураРеквизитовПТУ 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Поступление, "Контрагент, ДоговорКонтрагента, НомерВходящегоДокумента, ДатаВходящегоДокумента");
	ПоставщикПТУ 				= СтруктураРеквизитовПТУ.Контрагент;
	ДоговорПТУ 					= СтруктураРеквизитовПТУ.ДоговорКонтрагента;
	НомерВходящегоДокумента 	= СтруктураРеквизитовПТУ.НомерВходящегоДокумента; 
	ДатаВходящегоДокумента 		= СтруктураРеквизитовПТУ.ДатаВходящегоДокумента;
	
	//Евросиб Каблов 13.01.2021 (
	РольПолныеПраваДоступна = РольДоступна("ПолныеПрава");
	Элементы.ПериодВО.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	Элементы.ПериодБУ.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	//Евросиб Каблов 13.01.2021 )
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		//Евросиб Каблов 07.09.2022 ( US49022 Блокировка элементов формы перенесена в КонтрольДоступностиДокументов_сервер		
		////Евросиб Каблов 28.01.2021 (
		//Если Объект.Проведен Тогда
		////Евросиб Каблов 28.01.2021 )
		//
		//	ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО, Объект.Организация);
		//	ДокументВыгруженВУПП = Ложь;//Гудкова Документы.Акцепт.ДокументВыгруженВУПП(Объект.Ссылка);
		//	ТолькоПросмотр = ЗначениеЗаполнено(Объект.ПериодВО) И (ДокументВЗакрытомПериоде Или ДокументВыгруженВУПП);
		//	
		//	ТолькоПросмотр = ТолькоПросмотр ИЛИ (ЗначениеЗаполнено(Объект.ПериодБУ) И Объект.ПериодБУ < КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ());
		//
		//КонецЕсли;
		//Евросиб Каблов 07.09.2022 )
		
		ДоступенДляСторно = Документы.Акцепт.ДокументДоступенДляСторно(Объект.Ссылка);
		Элементы.Сторнировать.Доступность = ДоступенДляСторно;
		
		Если Не ТолькоПросмотр И Объект.ПометкаУдаления Тогда
			СнятьПометкуУдаления = Ложь;
			Если Параметры.Свойство("СнятьПометкуУдаления", СнятьПометкуУдаления) И СнятьПометкуУдаления Тогда
				Объект.ПометкаУдаления = Ложь;
				ЗаполнитьПоПоступлению();
			КонецЕсли;
		КонецЕсли;
		
		//Евросиб - АСуслов 23.11.2023 12:41:44 #77780
		//(
		//Для каждого Стр из Объект.Услуги Цикл
		//	Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = Услуги_сервер.ПолучитьСуммуАРМКонтроляСписаний(Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке, Стр.СделкаКТК, Стр.Номенклатура);
		//	Стр.РазницаАРМКСиСуммаИтого = (Стр.ПоступлениеСумма - Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		//	Стр.ЕстьРазница = (Стр.ПоступлениеСумма > 0 И Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра > 0 И Стр.ПоступлениеСумма <> Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		//КонецЦикла;                                                                     
		//)     
		Элементы.УслугиГруппа5.Видимость = Ложь;
		//Евросиб - АСуслов 23.11.2023 12:41:46 #77780
		СпозиционироватьсяНаСтроке = Параметры.Свойство("ПерейтиКСтрокеУслуг");
		Если СпозиционироватьсяНаСтроке Тогда
			СтрокиПоИдентификаторуВСделке = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРасходовВСделке", Параметры.ПерейтиКСтрокеУслуг));
			Если ЗначениеЗаполнено(СтрокиПоИдентификаторуВСделке) Тогда
				Элементы.Услуги.ТекущаяСтрока = СтрокиПоИдентификаторуВСделке[0].ПолучитьИдентификатор();
			//Евросиб Каблов 09.09.2022 ( US49022
			Иначе
			    СтрокиПоИдентификаторуВАкцепте = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Параметры.ПерейтиКСтрокеУслуг));
				Если ЗначениеЗаполнено(СтрокиПоИдентификаторуВАкцепте) Тогда
					Элементы.Услуги.ТекущаяСтрока = СтрокиПоИдентификаторуВАкцепте[0].ПолучитьИдентификатор();
				КонецЕсли;
			//Евросиб Каблов 09.09.2022 )
			КонецЕсли;
		КонецЕсли;		
	Иначе
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Поступление, "ВидОперации");
			Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение ИЛИ ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
				ОткрытыйПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
				ДоходыСделкиВР = ПолучитьДоходыСделки(ОткрытыйПериодВО);
				Для Каждого СтрокаДоходовСделки Из ДоходыСделкиВР Цикл
					СтрокаУслуги = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", СтрокаДоходовСделки.ГУИДАкцепта))[0];
					СтрокаУслуги.УчДокумент = Неопределено;
					СтрокаУслуги.ИдентификаторСтрокиДоходовВСделкеКорректируемый = СтрокаДоходовСделки.Доходы;
					Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
						СтрокаУслуги.ИдентификаторСтрокиРасходовВСделке = "";
					КонецЕсли;
					СписокГУИДкАвторазнесению.Добавить(СтрокаУслуги.ГУИД);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	

	//ОбновитьДополнительныеРеквизитыТаблицыУслуг(); //Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, закомментировал (достаточно в методе ПриЧтенииНаСервере)
	ПодсвечиватьАкцептКраснымПриРазницеПланФактСуммБолее = Константы.ПодсвечиватьАкцептКраснымПриРазницеПланФактСуммБолее.Получить();	
	
	//ЦветКнопки_Исходный = Элементы.УслугиЗаполнятьПоПервойСтроке.ЦветФона;
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//Евросиб Каблов 25.02.2021 ( Ticket#0224210
	////Евросиб Каблов 24.12.2020 ( Ticket#0215402 Разрешить пользователю редактировать Неурег.причину «Отработка в РИТМ»
	//////Евросиб Каблов 08.10.2020
	////РазрешитьРедактированиеСтрокОбработкаВРИТМ = РольДоступна("ПолныеПрава");
	//////Евросиб Каблов 03.11.2020
	////Элементы.УслугиВыгруженаВРИТМ.ТолькоПросмотр = Не РазрешитьРедактированиеСтрокОбработкаВРИТМ;
	//Элементы.УслугиВыгруженаВРИТМ.ТолькоПросмотр = Не РольПолныеПраваДоступна;  	
	////Евросиб Каблов 24.12.2020 )
	//Евросиб Каблов 25.02.2021 )
	
	//Евросиб Каблов 20.01.2021 (
	Элементы.УслугиПривязалПользователь.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	//Евросиб Каблов 20.01.2021 )
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0230703
	Элементы.УслугиУчДокумент.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	//Евросиб Каблов 28.04.2021 )
	
//Евросиб Гудкова( 14.09.2021  

	// ДИТ Поморцева Задача 0244645 20.10.21. начало
	//Элементы.УслугиГруппаСтрокаСделки.ТолькоПросмотр = Не РольПолныеПраваДоступна; 
	Элементы.УслугиСделка.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	Элементы.УслугиГруппаДанныеДокументов.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	// ДИТ Поморцева Задача 0244645 20.10.21. конец
	Элементы.УслугиГруппаОтнесеннаяСумма.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	Элементы.УслугиГруппаГУИДы.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	Элементы.УслугиГруппаГУИДыАкцепта.ТолькоПросмотр = Не РольПолныеПраваДоступна;
	Элементы.УслугиУказаннаяПользователемСделка.ТолькоПросмотр = Не РольПолныеПраваДоступна;
// Евросиб Гудкова)
	
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	
		Элементы.УслугиПоступлениеСумма.Заголовок = "Сумма корр";
		Элементы.УслугиПоступлениеЦена.Заголовок = "Цена корр";
		Элементы.УслугиПоступлениеСуммаНДС.Заголовок = "НДС корр";
	
	КонецЕсли;                                
	//Евросиб - АСуслов 13.01.2023 14:40:20 #63243
	//(
	//перенес в УстановитьДоступностьЭлементов
	//УстановитьДоступностьИзмененияСоставаСтрок();
	//)
	//Евросиб - АСуслов 13.01.2023 14:40:21 #63243

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	// ++ ДИТ_Агафонов_task 41390
	//У команд проставлены Изменяет данные: 
	//excel_ВставитьВагоны excel_ВставитьВагоныИКТК excel_ВставитьКонтейнеры ОбновитьДетализацию РазнестиАвтоматически
	//ОстатокОплатитьНаОснованииПТУ
	
	////Создана на форме группа ГруппаБлокировкаКорректировка
	//КорректировкаПоступления = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(Объект.Ссылка);
	//Элементы.ГруппаБлокировкаКорректировка.Видимость = ЗначениеЗаполнено(КорректировкаПоступления);	
	
	//Добавлены на форму данные КорректировкиДокумента
	//переименована имеющаяся на форме элемент ПредупреждениеРедактирования на ПредупреждениеПроведения
	//Добавлены элементы ПредупреждениеРедактирования и ГруппаКорректировкиДокумента 
	Документы.КорректировкаПоступления.ЗаполнитьСписокКорректировокПоступленияРекурсивно(Объект.Ссылка, КорректировкиДокумента);
	ЕстьКорректировки = КорректировкиДокумента.Количество()>0;
	Элементы.ГруппаКорректировкиДокумента.Видимость = ЕстьКорректировки; 
	Если ЕстьКорректировки Тогда
		Элементы.ПредупреждениеРедактирования.Заголовок = "Работа с документом должна происходить через документ исправления!";			
		Элементы.ПредупреждениеРедактирования.Видимость = Истина;	
		Если не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(КорректировкаПоступления);	
		КонецЕсли;	
	КонецЕсли;

	// -- ДИТ_Агафонов_task 41390 
	
	//Субботин 75691 19.10.2023 начало
	Если ЗначениеЗаполнено(Объект.Поступление) и ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
		ПризнакиДокументаПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Поступление, "Штраф, Претензия");
		Штраф = ПризнакиДокументаПТУ.Штраф;
		Претензия = ПризнакиДокументаПТУ.Претензия;
	КонецЕсли;
	//Субботин 75691 19.10.2023 Конец 
	
	//Евросиб - АСуслов 03.11.2023 15:55:16 #0330713
	//(
	Элементы.УслугиРазнестиНакопительнуюВедомость.Видимость = Ложь;
	//)
	//Евросиб - АСуслов 03.11.2023 15:55:17 #0330713
	//Евросиб Пирожкова( 27.10.2025 Ticket№0406736
	Элементы.ПроверитьВыгрузкуВУПП.Доступность = Истина;
	// Евросиб Пирожкова 27.10.2025)
	
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
&НаСервере
Функция ПолучитьДоходыСделки(ОткрытыйПериодВО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиАкцепта.ГУИД КАК ГУИД,
		|	УслугиАкцепта.Сделка КАК Сделка,
		|	УслугиАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
		|ПОМЕСТИТЬ ВТУслугиАкцепта
		|ИЗ
		|	&УслугиАкцепта КАК УслугиАкцепта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУслугиАкцепта.ГУИД КАК ГУИДАкцепта,
		|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
		|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы
		|ИЗ
		|	ВТУслугиАкцепта КАК ВТУслугиАкцепта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ПО ВТУслугиАкцепта.Сделка = СделкаСвязьДоходовИРасходов.Ссылка
		|			И ВТУслугиАкцепта.ИдентификаторСтрокиРасходовВСделке = СделкаСвязьДоходовИРасходов.Расходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|		ПО (СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка)
		|			И (СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД)
		|			И (СделкаДоходы.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах)";
		//|			И (ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.ОтчетКомитентуОПродажах).ПериодВО < &ОткрытыйПериодВО)"; //Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, закомментировал (для открытого периода тоже надо)
		
	Запрос.УстановитьПараметр("УслугиАкцепта", Объект.Услуги.Выгрузить(,"ГУИД,Сделка,ИдентификаторСтрокиРасходовВСделке"));
	Запрос.УстановитьПараметр("ОткрытыйПериодВО", ОткрытыйПериодВО);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Стр из ТекущийОбъект.Услуги Цикл
		Если Стр.Номенклатура.ТребоватьОбязательногоЗаполненияЛокацийВАкцепте = Истина И (НЕ ЗначениеЗаполнено(Стр.СтанцияОтправления) ИЛИ НЕ ЗначениеЗаполнено(Стр.СтанцияНазначения)) Тогда
			Сообщить("По номенклатуре " + Стр.Номенклатура + " обязательно требуется заполнить пункт отправления и назначения! Акцепт не будет записан!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//Евросиб Каблов 07.09.2022 ( US49022
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акцепт.Дата КАК Дата,
	|	Акцепт.Ссылка КАК Ссылка,
	|	Акцепт.Представление КАК Представление,
	|	0 КАК Порядок
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|ГДЕ
	|	Акцепт.Поступление = &Поступление
	|	И Акцепт.ПериодВО <= &ПериодВО
	|	И Акцепт.ПериодБУ <= &ПериодБУ
	|	И НЕ(Акцепт.ПериодВО = &ПериодВО
	|				И Акцепт.ПериодБУ = &ПериодБУ)
	|	И Акцепт.Проведен
	|	И Акцепт.Дата >= &Дата
	|	И Акцепт.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акцепт.Дата,
	|	Акцепт.Ссылка,
	|	Акцепт.Представление,
	|	ВЫБОР
	|		КОГДА &ЭтоСторно
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|ГДЕ
	|	Акцепт.Поступление = &Поступление
	|	И Акцепт.ПериодВО = &ПериодВО
	|	И Акцепт.ПериодБУ = &ПериодБУ
	|	И Акцепт.Проведен
	|	И ВЫБОР
	|			КОГДА &ЭтоСторно
	|				ТОГДА Акцепт.Дата <= &Дата
	|			ИНАЧЕ Акцепт.Дата >= &Дата
	|		КОНЕЦ
	|	И Акцепт.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акцепт.Дата,
	|	Акцепт.Ссылка,
	|	Акцепт.Представление,
	|	1
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|ГДЕ
	|	Акцепт.Поступление = &Поступление
	|	И Акцепт.ПериодВО >= &ПериодВО
	|	И Акцепт.ПериодБУ >= &ПериодБУ
	|	И НЕ(Акцепт.ПериодВО = &ПериодВО
	|				И Акцепт.ПериодБУ = &ПериодБУ)
	|	И Акцепт.Проведен
	|	И Акцепт.Дата <= &Дата
	|	И Акцепт.Ссылка <> &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("Поступление", ТекущийОбъект.Поступление);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПериодВО", ТекущийОбъект.ПериодВО);
	Запрос.УстановитьПараметр("ПериодБУ", ТекущийОбъект.ПериодБУ);
	Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
	ЭтоСторно = ?(ЗначениеЗаполнено(ТекущийОбъект.СторнируемыйАкцепт), Истина, Ложь);
	Запрос.УстановитьПараметр("ЭтоСторно", ЭтоСторно); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Порядок = 0 Тогда
			ТекстСообщения = СтрШаблон("Дата акцепта должна быть больше даты предыдущего акцепта %1", Выборка.Дата);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			ТекстСообщения = СтрШаблон("Дата акцепта должна быть меньше даты следующего акцепта %1", Выборка.Дата);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 07.09.2022 )
	
	//Евросиб - АСуслов 22.08.2022 12:32:32 #55129
	//(
	//Евросиб - АСуслов 12.01.2023 16:51:29 #63368
	//(
	ПроверитьКорректностьПризнакаРазнесеноПолностью(Отказ);
	//)
	//Евросиб - АСуслов 12.01.2023 16:51:31 #63368
	СнятьПризнакРазнесеноПолностьюДляАкцептованныхСтрокНаОднуСрокуСделки(ТекущийОбъект);
	//)
	//Евросиб - АСуслов 22.08.2022 12:32:35 #55129 
	
	//Евросиб Каблов 16.12.2024 ( #94192
	////Евросиб Каблов 20.12.2022 ( 62430
	//Запрос = Новый Запрос;	
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТаблицаАкцепта.НомерСтроки КАК НомерСтроки,
	//|	ТаблицаАкцепта.Номенклатура КАК Номенклатура,
	//|	ТаблицаАкцепта.СтанцияОтправления КАК ПунктОтправления,
	//|	ТаблицаАкцепта.СтанцияНазначения КАК ПунктНазначения
	//|ПОМЕСТИТЬ ТаблицаАкцепта
	//|ИЗ
	//|	&ТаблицаАкцепта КАК ТаблицаАкцепта
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаАкцепта.НомерСтроки КАК НомерСтроки,
	//|	СпрНоменклатура.Ссылка КАК Номенклатура,
	//|	ЛокацииОтпр.Ссылка КАК ПунктОтправления,
	//|	ЛокацииНазн.Ссылка КАК ПунктНазначения,
	//|	СпрНоменклатура.Представление КАК НоменклатураПредставление
	//|ПОМЕСТИТЬ ТаблицаАкцептаСЛокациями
	//|ИЗ
	//|	ТаблицаАкцепта КАК ТаблицаАкцепта
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииОтпр
	//|		ПО ТаблицаАкцепта.ПунктОтправления = ЛокацииОтпр.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииНазн
	//|		ПО ТаблицаАкцепта.ПунктНазначения = ЛокацииНазн.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|		ПО ТаблицаАкцепта.Номенклатура = СпрНоменклатура.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НоменклатураДоступныеТипыЛокаций.Ссылка КАК Номенклатура,
	//|	НоменклатураДоступныеТипыЛокаций.ТипЛокации КАК ТипЛокации
	//|ПОМЕСТИТЬ ТипыЛокацийНоменеклатуры
	//|ИЗ
	//|	Справочник.Номенклатура.ДоступныеТипыЛокаций КАК НоменклатураДоступныеТипыЛокаций
	//|ГДЕ
	//|	НоменклатураДоступныеТипыЛокаций.Ссылка В
	//|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|				ТаблицаАкцепта.Номенклатура КАК Номенклатура
	//|			ИЗ
	//|				ТаблицаАкцепта КАК ТаблицаАкцепта)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаАкцепта.НомерСтроки КАК НомерСтроки,
	//|	ТаблицаАкцепта.Номенклатура КАК Номенклатура,
	//|	ТаблицаАкцепта.ПунктОтправления КАК ПунктОтправления,
	//|	ТаблицаАкцепта.ПунктНазначения КАК ПунктНазначения,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА ТипыЛокацийНоменеклатуры.ТипЛокации ЕСТЬ NULL
	//|					ИЛИ ТаблицаАкцепта.ПунктОтправления.Тип ЕСТЬ NULL
	//|				ТОГДА ИСТИНА
	//|			КОГДА ТаблицаАкцепта.ПунктОтправления.Тип = ТипыЛокацийНоменеклатуры.ТипЛокации
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ) КАК ПунктОтправленияПодходит,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА ТипыЛокацийНоменеклатуры.ТипЛокации ЕСТЬ NULL
	//|					ИЛИ ТаблицаАкцепта.ПунктНазначения.Тип ЕСТЬ NULL
	//|				ТОГДА ИСТИНА
	//|			КОГДА ТаблицаАкцепта.ПунктНазначения.Тип = ТипыЛокацийНоменеклатуры.ТипЛокации
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ) КАК ПунктНазначенияПодходит,
	//|	ТаблицаАкцепта.НоменклатураПредставление КАК НоменклатураПредставление
	//|ИЗ
	//|	ТаблицаАкцептаСЛокациями КАК ТаблицаАкцепта
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТипыЛокацийНоменеклатуры КАК ТипыЛокацийНоменеклатуры
	//|		ПО ТаблицаАкцепта.Номенклатура = ТипыЛокацийНоменеклатуры.Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаАкцепта.ПунктОтправления,
	//|	ТаблицаАкцепта.Номенклатура,
	//|	ТаблицаАкцепта.ПунктНазначения,
	//|	ТаблицаАкцепта.НомерСтроки,
	//|	ТаблицаАкцепта.НоменклатураПредставление
	//|
	//|ИМЕЮЩИЕ
	//|	(МАКСИМУМ(ВЫБОР
	//|				КОГДА ТипыЛокацийНоменеклатуры.ТипЛокации ЕСТЬ NULL
	//|						ИЛИ ТаблицаАкцепта.ПунктОтправления.Тип ЕСТЬ NULL
	//|					ТОГДА ИСТИНА
	//|				КОГДА ТаблицаАкцепта.ПунктОтправления.Тип = ТипыЛокацийНоменеклатуры.ТипЛокации
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ) = ЛОЖЬ
	//|		ИЛИ МАКСИМУМ(ВЫБОР
	//|				КОГДА ТипыЛокацийНоменеклатуры.ТипЛокации ЕСТЬ NULL
	//|						ИЛИ ТаблицаАкцепта.ПунктНазначения.Тип ЕСТЬ NULL
	//|					ТОГДА ИСТИНА
	//|				КОГДА ТаблицаАкцепта.ПунктНазначения.Тип = ТипыЛокацийНоменеклатуры.ТипЛокации
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ) = ЛОЖЬ)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТипыЛокацийНоменеклатуры.Номенклатура КАК Номенклатура,
	//|	ТипыЛокацийНоменеклатуры.ТипЛокации КАК ТипЛокации,
	//|	ТипыЛокацийНоменеклатуры.ТипЛокации.Представление КАК ТипЛокацииПредставление
	//|ИЗ
	//|	ТипыЛокацийНоменеклатуры КАК ТипыЛокацийНоменеклатуры";
	//
	//Запрос.УстановитьПараметр("ТаблицаАкцепта", Объект.Услуги.Выгрузить(, "НомерСтроки, Номенклатура, СтанцияОтправления, СтанцияНазначения"));
	//
	//РезультатыЗапроса = Запрос.ВыполнитьПакет();
	//Выборка = РезультатыЗапроса[3].Выбрать();
	//ТаблицаДоступныхТиповЛокаций = РезультатыЗапроса[4].Выгрузить();
	//Пока Выборка.Следующий() Цикл
	//	
	//	СтрокиДоступныхТиповЛокаций = ТаблицаДоступныхТиповЛокаций.Скопировать(Новый Структура("Номенклатура", Выборка.Номенклатура), "ТипЛокацииПредставление").ВыгрузитьКолонку("ТипЛокацииПредставление");
	//	СтрокаДоступныеТипы = СтрСоединить(СтрокиДоступныхТиповЛокаций, ", ");
	//	
	//	Если Не Выборка.ПунктОтправленияПодходит Тогда
	//		ТекстСообщения = СтрШаблон("В строке %1 тип выбранной станции отправления не соответствует доступным типам локаций услуги %2. Доступные типы локаций: %3", Выборка.НомерСтроки, Выборка.НоменклатураПредставление, СтрокаДоступныеТипы);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Выборка.НомерСтроки, "СтанцияОтправления"), "Объект", Отказ);
	//	КонецЕсли;
	//	
	//	Если Не Выборка.ПунктНазначенияПодходит Тогда
	//		ТекстСообщения = СтрШаблон("В строке %1 тип выбранной станции назначения не соответствует доступным типам локаций услуги %2. Доступные типы локаций: %3", Выборка.НомерСтроки, Выборка.НоменклатураПредставление, СтрокаДоступныеТипы);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Выборка.НомерСтроки, "СтанцияНазначения"), "Объект", Отказ);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	////Евросиб Каблов 20.12.2022 )
	//Евросиб Каблов 16.12.2024 )
		
	//Евросиб Каблов 18.03.2022 ( Ticket#0264427
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПроведениеИзФормы", Истина);
		// ++ ДИТ_Агафонов_task 41390 02.02.2023
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СообщенияПослеПроведения", "");
		// -- ДИТ_Агафонов_task 41390 02.02.2023
	КонецЕсли;
	//Евросиб Каблов 18.03.2022 ) 
	
	// Евросиб US83437 TA83438 Рыбьяков К.А. 15.07.2024 ((
	//Если ДанныеДляДобавленияВАкцепт <> Неопределено Тогда
	//	ДанныеДляСделок = ДанныеДляДобавленияВАкцепт.Получить();
	//	Для Каждого Данные Из ДанныеДляСделок Цикл
	//		Документы.Акцепт.ЗаписатьДанныеДляОтложенногоИзмененияСделки(Данные.Сделка, Данные, Данные.ДанныеИзСП);
	//		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//			ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(Данные.Сделка, ТекущийОбъект.Ссылка);
	//		КонецЕсли;
	//	КонецЦикла;
	//	ДанныеДляДобавленияВАкцепт = Неопределено;
	//КонецЕсли;
	Если ДанныеДляДобавленияВАкцепт <> Неопределено Тогда
		ДанныеДляСделок = ДанныеДляДобавленияВАкцепт.Получить();
		Документы.Акцепт.ЗаписатьДанныеДляОтложенногоИзмененияСделки(ДанныеДляСделок, ТекущийОбъект.Поступление);
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			МассивСделокДляОбработки = Новый Массив;
			ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(МассивСделокДляОбработки, ДанныеДляСделок.ВыгрузитьКолонку("Сделка"));
			Для Каждого Сделка Из МассивСделокДляОбработки Цикл
				ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(Сделка, ТекущийОбъект.Ссылка);
			КонецЦикла;  
		КонецЕсли;
		ДанныеДляДобавленияВАкцепт = Неопределено;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.07.2024 ))
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Евросиб Каблов 07.09.2022 ( US49022
	ТипСтруктура = Тип("Структура");
	ТипЗначенияПараметра = ТипЗнч(Параметр);
	Если ИмяСобытия = "Диалоги_ОтправкаСообщения" Тогда
		Если ТипЗначенияПараметра = ТипСтруктура Тогда
			Контекст = Неопределено;
			Если Параметр.Свойство("Контекст", Контекст) И Контекст = Объект.Поступление Тогда
				ОбновитьДанныеПоДиалогамНеурегРасходов();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 07.09.2022 )
	
КонецПроцедуры

//Евросиб - АСуслов 22.08.2022 12:34:24 #55129
//(
&НаСервере
Процедура ПроверитьКорректностьПризнакаРазнесеноПолностью(Отказ)

	Если НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтролироватьОтрицательныеОстаткиРегистраРазнесениеРасходов")  Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.ПолностьюРазнесено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|			И ВТ_Услуги.Сделка = СделкаРасходы.Ссылка
	|			И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
	Запрос.УстановитьПараметр("АкцептУслуги", Объект.Услуги.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();                                
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	Пока ВыборкаРезультата.Следующий() Цикл  
		ТекстСообщения = СтрШаблон("В строке %1 указан признак «Разнесено полностью» для расхода сделки, добавленого из акцепта.
		|Снимите признак или отмените разнесение", ВыборкаРезультата.НомерСтроки);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги",ВыборкаРезультата.НомерСтроки,"ПолностьюРазнесено"), "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьПризнакРазнесеноПолностьюДляАкцептованныхСтрокНаОднуСрокуСделки(ТекущийОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.ПолностьюРазнесено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Услуги.НомерСтроки) КАК НомерСтроки,
	|	ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
	|ПОМЕСТИТЬ ВТ_ПовторныеРазнесения
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Услуги.НомерСтроки) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.НомерСтроки КАК НомерСтроки,
	|	ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|ГДЕ
	|	ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке В
	|			(ВЫБРАТЬ
	|				т.ИдентификаторСтрокиРасходовВСделке
	|			ИЗ
	|				ВТ_ПовторныеРазнесения КАК т)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтрокиРасходовВСделке,
	|	НомерСтроки";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
	Запрос.УстановитьПараметр("АкцептУслуги", Объект.Услуги.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	Пока ВыборкаРезультата.СледующийПоЗначениюПоля("ИдентификаторСтрокиРасходовВСделке") Цикл
		Пока ВыборкаРезультата.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			СтрокаУслуги = ТекущийОбъект.Услуги.Найти(ВыборкаРезультата.НомерСтроки, "НомерСтроки");
			СтрокаУслуги.ПолностьюРазнесено = Ложь;
		КонецЦикла;                              
		//у последней поставим истина
		СтрокаУслуги.ПолностьюРазнесено = Истина;
	КонецЦикла;
	
КонецПроцедуры	
//)
//Евросиб - АСуслов 22.08.2022 12:34:26 #55129

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();  
	//Евросиб - АСуслов 13.01.2023 14:42:14 #63243
	//(
	УстановитьДоступностьЭлементов();
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы, Объект);
	//УстановитьДоступностьИзмененияСоставаСтрок();
	//)
	//Евросиб - АСуслов 13.01.2023 14:42:16 #63243
	Если НЕ Объект.Проведен Тогда
		ТолькоПросмотр = Ложь;
	КонецЕсли; 
	// ++ ДИТ_Агафонов_task 41390 02.02.2023
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("СообщенияПослеПроведения") Тогда
		СообщенияПослеПроведения = ТекущийОбъект.ДополнительныеСвойства.СообщенияПослеПроведения;
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390 02.02.2023
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

#КонецОбласти

&НаСервере
Процедура УстановитьДоступностьИзмененияСоставаСтрок()
	Элементы.Услуги.ИзменятьСоставСтрок = НЕ Объект.Проведен;
	Элементы.ДекорацияОтменитеПроведение.Видимость = Объект.Проведен;
КонецПроцедуры


// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Проведен Тогда
		ОповещениеОСогласииСОтменойПроведения = Новый ОписаниеОповещения("ОбработкаСогласияСОтменойПроведения", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОСогласииСОтменойПроведения, "Необходимо отменить проведение акцепта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСогласияСОтменойПроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроведениеОтменено = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Если ПроведениеОтменено Тогда
			ЗаполнитьПродолжение();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить отмену проведения акцепта. Заполнение по услугам не выполнено.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродолжение()
	
	ЗаполнитьНаСервере();
	ДополнитьДанные(Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнитьДанные(Команда)
	
	ДополнитьДанные_Сервер(Истина);
	ОбновитьПодсветку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсветку()
	
	Для каждого Стр из Объект.Услуги Цикл
		
		Стр.ПометитьЗеленым = Ложь;
		Стр.ПометитьКрасным = Ложь;
		Стр.ПометитьЗеленым = ЗначениеЗаполнено(Стр.Сделка);		
		Стр.ПометитьКрасным = Sqrt(Pow((Стр.ПоступлениеСумма - Стр.СделкаСумма), 2)) > ПодсвечиватьАкцептКраснымПриРазницеПланФактСуммБолее;		
		
	КонецЦикла;
	
	Элементы.УслугиПоступлениеСумма.ТекстПодвала 		= Формат(Объект.Услуги.Итог("ПоступлениеСумма"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСделкаСумма.ТекстПодвала 			= Формат(Объект.Услуги.Итог("СделкаСумма"), "ЧДЦ=2; ЧН=");
//Евросиб Гудкова( 17.11.2020 Ticket№ 0214363
	Элементы.УслугиПоступлениеКоличество.ТекстПодвала 	= Формат(Объект.Услуги.Итог("ПоступлениеКоличество"), "ЧДЦ=0; ЧН=");
	Элементы.УслугиПоступлениеСуммаНДС.ТекстПодвала 	= Формат(Объект.Услуги.Итог("ПоступлениеСуммаНДС"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиПодтвержденнаяСумма.ТекстПодвала 	= Формат(Объект.Услуги.Итог("ПодтвержденнаяСумма"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСуммаПретензии.ТекстПодвала	 		= Формат(Объект.Услуги.Итог("СуммаПретензии"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСуммаРасходовИзАРМКонтроляСписанийИзРегистра.ТекстПодвала 	= Формат(Объект.Услуги.Итог("СуммаРасходовИзАРМКонтроляСписанийИзРегистра"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиРазницаАРМКСиСуммаИтого.ТекстПодвала 		= Формат(Объект.Услуги.Итог("РазницаАРМКСиСуммаИтого"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСделкаСуммаНДС.ТекстПодвала 		= Формат(Объект.Услуги.Итог("СделкаСуммаНДС"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСумма.ТекстПодвала 	= Формат(Объект.Услуги.Итог("Сумма"), "ЧДЦ=2; ЧН=");
	Элементы.УслугиСуммаНДС.ТекстПодвала 		= Формат(Объект.Услуги.Итог("СуммаНДС"), "ЧДЦ=2; ЧН=");
	// Евросиб Гудкова) 	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДанные_Сервер(ИзменятьДанные)
	
	
	//Евросиб Каблов 02.09.2021 (
	ПериодАкцепта = Мин(Объект.ПериодВО, Объект.ПериодБУ);
	ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(Объект, ИзменятьДанные, ПериодАкцепта);
	//Евросиб Каблов 02.09.2021 )
	
    ОбновитьДополнительныеРеквизитыТаблицыУслуг(); //Евросиб Гудкова( 19.07.2022
	
	Для каждого Стр из Объект.Услуги Цикл
		
		// Обновить данные по арм контроля списаний
		//Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = Услуги_сервер.ПолучитьСуммуАРМКонтроляСписаний(Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке, Стр.СделкаКТК, Стр.Номенклатура);
		//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало (регистр ФактическиеСуммыНакладныхОтнесенныеНаЗатратыСделок не используется)
		Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = 0;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
		Стр.РазницаАРМКСиСуммаИтого = (Стр.ПоступлениеСумма - Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		Стр.ЕстьРазница = (Стр.ПоступлениеСумма > 0 И Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра > 0 И Стр.ПоступлениеСумма <> Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура excel_ВставитьВагоныИКТК(Команда)
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0230703
	//ДополнительныеПараметры = Новый Структура;
	//ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиТаблицыВагоновИКТК", ЭтаФорма, ДополнительныеПараметры);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Поступление", Объект.Поступление);
	//ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаВставкиВагоновИКТК", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Если Объект.Проведен Тогда
		ОповещениеОСогласииСОтменойПроведения = Новый ОписаниеОповещения("ОбработкаСогласияСОтменойПроведенияПередВставкойВагоновИКТК", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОСогласииСОтменойПроведения, "Необходимо отменить проведение акцепта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВставитьВагоныИКТКПродолжение();
	КонецЕсли;
	//Евросиб Каблов 28.04.2021 )
	
КонецПроцедуры

//Евросиб Каблов 28.04.2021 Ticket#0230703
&НаКлиенте
Процедура ОбработкаСогласияСОтменойПроведенияПередВставкойВагоновИКТК(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроведениеОтменено = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Если ПроведениеОтменено Тогда
			ВставитьВагоныИКТКПродолжение();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить отмену проведения акцепта. Вставка вагонов и КТК не выполнена.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 28.04.2021 Ticket#0230703
&НаКлиенте
Процедура ВставитьВагоныИКТКПродолжение()
	
	ДополнительныеПараметры = Новый Структура;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиТаблицыВагоновИКТК", ЭтаФорма, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Поступление", Объект.Поступление);
	//Евросиб Каблов 16.12.2024 ( #94192
	ПараметрыФормы.Вставить("ПроверятьДоступныеТипыЛокацииНоменклатуры", Истина);
	//Евросиб Каблов 16.12.2024 )
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаВставкиВагоновИКТК", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицыНоменклатурыПоступления(Поступление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервыеСтрокиПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ПоступлениеТоваровУслугУслуги.НомерСтроки) КАК НомерСтроки,
		|		ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|		ПоступлениеТоваровУслугУслуги.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|	ГДЕ
		|		ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПоступлениеТоваровУслугУслуги.Номенклатура,
		|		ПоступлениеТоваровУслугУслуги.Ссылка) КАК ПервыеСтрокиПоНоменклатуре
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО ПервыеСтрокиПоНоменклатуре.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
		|			И ПервыеСтрокиПоНоменклатуре.Номенклатура = ПоступлениеТоваровУслугУслуги.Номенклатура
		|			И ПервыеСтрокиПоНоменклатуре.НомерСтроки = ПоступлениеТоваровУслугУслуги.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Поступление);
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры, Новый УникальныйИдентификатор);	
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВставкиТаблицыВагоновИКТК(Результат, ДополнительныеПараметры) Экспорт
	
	//Евросиб Каблов 03.11.2020 (
	//Если Результат <> Неопределено Тогда
	//	ДобавитьСтрокиВагоновИКТКСервер(Результат, ДополнительныеПараметры.АдресТаблицыНоменклатуры);
	//Иначе
	//	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресТаблицыНоменклатуры);
	//КонецЕсли;
	Если Результат <> Неопределено Тогда
		ДобавитьСтрокиВагоновИКТКСервер(Результат);
	КонецЕсли;
	//Евросиб Каблов 03.11.2020 )
	
КонецПроцедуры

&НаСервере
//Евросиб Каблов 03.11.2020
Процедура ДобавитьСтрокиВагоновИКТКСервер(ДобавляемыеСтроки)
	
//Евросиб Гудкова( 05.11.2020 Ticket№ 0212465 
	РеквизитыНДС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Поступление, "СуммаВключаетНДС, УчитыватьНДС");	
	ИтогСумма = 0;
	ИтогСуммаНДС = 0;
// Евросиб Гудкова) 	
	Для каждого Стр из ДобавляемыеСтроки Цикл
		СтрокаУслуги = Объект.Услуги.Добавить();
		//Евросиб Каблов 13.09.2022 ( 57446
		СтрокаУслуги.ГУИД = Новый УникальныйИдентификатор;
		//Евросиб Каблов 13.09.2022 )
		СтрокаУслуги.Номенклатура = Стр.ПоступлениеНоменклатура;
		СтрокаУслуги.Вагон = Стр.ПоступлениеВагоны;
		СтрокаУслуги.Контейнер = Стр.ПоступлениеКТК;		
		ЗаполнитьЗначенияСвойств(СтрокаУслуги, Стр);
		
		СтавкаНДСПоНоменклатуре = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаУслуги.ПоступлениеСтавкаНДС);
		СтрокаУслуги.ПоступлениеСуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаУслуги.ПоступлениеСумма, СтавкаНДСПоНоменклатуре, Истина, Истина);
		//Евросиб Гудкова( 05.11.2020 Ticket№ 0212465 
		//Евросиб - АСуслов 13.12.2020 18:15:11 #0213047 
		//(
		//СтрокаУслуги.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаУслуги.ПоступлениеСумма, СтавкаНДСПоНоменклатуре, РеквизитыНДС.УчитыватьНДС, Истина);
		Если НЕ РеквизитыНДС.УчитыватьНДС Тогда
			СтрокаУслуги.ПоступлениеЦена = СтрокаУслуги.ПоступлениеСумма;
			//Гудкова СтрокаУслуги.Цена = СтрокаУслуги.Цена;
			СтрокаУслуги.ПоступлениеСтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			СтрокаУслуги.ПоступлениеСуммаНДС = 0;
			//Гудкова СтрокаУслуги.СуммаНДС = 0;
		ИначеЕсли Не РеквизитыНДС.СуммаВключаетНДС Тогда
			СтрокаУслуги.ПоступлениеЦена = СтрокаУслуги.ПоступлениеСумма - СтрокаУслуги.ПоступлениеСуммаНДС;
			СтрокаУслуги.Цена = СтрокаУслуги.ПоступлениеСумма - СтрокаУслуги.ПоступлениеСуммаНДС;
		КонецЕсли; 
		ИтогСумма = ИтогСумма + СтрокаУслуги.ПоступлениеСумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаУслуги.ПоступлениеСуммаНДС;
		//)
		//Евросиб - АСуслов 13.12.2020 18:15:17 #0213047 
		// Евросиб Гудкова) 
		//Евросиб - АСуслов 13.12.2020 18:08:06 #0213047 
		//(
//Евросиб Гудкова( 16.12.2020 Ticket№ 0217328 		СтрокаУслуги.Сумма = СтрокаУслуги.ПоступлениеСумма;
		СтрокаУслуги.СтанцияОтправления = Стр.СтанцияОтправления;
		СтрокаУслуги.СтанцияНазначения = Стр.СтанцияНазначения;
		СтрокаУслуги.ТранспортныйДокумент = Стр.ТранспортныйДокумент;
		//)
		//Евросиб - АСуслов 13.12.2020 18:08:08 #0213047 
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 17.07.2023
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУслуги.Номенклатура, "КатегорияРасходов") = Справочники.КатегорииРасходов.НайтиПоКоду("РасхЧстП") Тогда
			СтрокаУслуги.РасходыЗаСчетЧП = Истина;
		КонецЕсли;
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 17.07.2023
	КонецЦикла;	
	
	//здесь был код устранения расхождения ндс с пту, перенесли в обработку проведения
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРазнесение(Команда)
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0230703
	Если Объект.Проведен Тогда
		ОповещениеОСогласииСОтменойПроведения = Новый ОписаниеОповещения("ОбработкаСогласияСОтменойПроведенияПередОчисткойРазнесения", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОСогласииСОтменойПроведения, "Необходимо отменить проведение акцепта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ОчиститьРазнесениеПродолжение();
	КонецЕсли;
	//Евросиб Каблов 28.04.2021 )
	
КонецПроцедуры

//Евросиб Каблов 28.04.2021 Ticket#0230703
&НаКлиенте
Процедура ОбработкаСогласияСОтменойПроведенияПередОчисткойРазнесения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроведениеОтменено = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Если ПроведениеОтменено Тогда
			ОчиститьРазнесениеПродолжение();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить отмену проведения акцепта. Очистка разнесения не выполнена.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 28.04.2021 Ticket#0230703
&НаКлиенте
Процедура ОчиститьРазнесениеПродолжение()
	
	Объект.Услуги.Очистить();
	Объект.СуммаАкцепта = 0;
	Объект.СуммаНДСАкцепта = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыТаблицыРазнесения_ПоказатьВсе(Команда)
	
	//Евросиб Каблов 04.03.2021 ( Ticket#0224143
	УслугиОтборСтрок = Элементы.Услуги.ОтборСтрок;
	Если УслугиОтборСтрок = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	Иначе
		СтруктураОтбора = Новый Структура(УслугиОтборСтрок);
	КонецЕсли;
	СтруктураОтбора.Удалить("ПоказатьВОтбореТолькоНеРазнесенные");
	Элементы.Услуги.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	//Евросиб Каблов 04.03.2021 )
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыТаблицыРазнесения_ТолькоНеразнесенные(Команда)
	
	//Евросиб Каблов 04.03.2021 ( Ticket#0224143
	УслугиОтборСтрок = Элементы.Услуги.ОтборСтрок;
	Если УслугиОтборСтрок = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	Иначе
		СтруктураОтбора = Новый Структура(УслугиОтборСтрок);
	КонецЕсли;
	СтруктураОтбора.Вставить("ПоказатьВОтбореТолькоНеРазнесенные", Истина);
	Элементы.Услуги.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	//Евросиб Каблов 04.03.2021 ) 
	
КонецПроцедуры

&НаКлиенте
Процедура Сторнировать(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Документ был изменен. Сначала необходимо его записать.");
		Возврат;
	КонецЕсли;
	
	ДоступенДляСторно = ДокументДоступенДляСторно(Объект.Ссылка);		
	Если ДоступенДляСторно Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("СторнируемыйАкцепт", Объект.Ссылка);	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.Акцепт.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	Иначе
		ПоказатьПредупреждение(, "Выбранный акцепт не доступен для сторно!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПоступлениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Поступление) Тогда
		ПоступлениеПриИзмененииНаСервере();
		//Субботин 75691 19.10.2023 начало
		Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
			ПризнакиДокументаПТУ = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(Объект.Поступление, "Штраф, Претензия");
			Штраф = ПризнакиДокументаПТУ.Штраф;
			Претензия = ПризнакиДокументаПТУ.Претензия;
		Иначе
			Штраф = Ложь;
			Претензия = Ложь;
		КонецЕсли;
		//Субботин 75691 19.10.2023 Конец
	КонецЕсли;
	
	ОбновитьПодсветку();
	
КонецПроцедуры

&НаСервере
Процедура ПоступлениеПриИзмененииНаСервере()
	
	ЗаполнитьПоПоступлению();
	
КонецПроцедуры

&НаКлиенте
Процедура СторнируемыйАкцептПриИзменении(Элемент)
	
	СторнируемыйАкцептПриИзмененииНаСервере();
	
	ОбновитьПодсветку();
		
КонецПроцедуры

&НаСервере
Процедура СторнируемыйАкцептПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.СторнируемыйАкцепт) Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.ЗаполнитьПоСторнируемомуАкцепту();
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	ИначеЕсли ЗначениеЗаполнено(Объект.Поступление) Тогда
		ПоступлениеПриИзмененииНаСервере();	
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	//МассивРазрешенныхПолей = Новый Массив;
	//МассивРазрешенныхПолей.Добавить("НачалоРасчета");
	//МассивРазрешенныхПолей.Добавить("ОкончаниеРасчета");
	//МассивРазрешенныхПолей.Добавить("НачалоОказанияУслуги");
	//МассивРазрешенныхПолей.Добавить("ОкончаниеОказанияУслуги");
	//МассивРазрешенныхПолей.Добавить("Сумма");
	//МассивРазрешенныхПолей.Добавить("СуммаНДС");	
	
	НеурегОтработкаВРИТМ = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ");
//Евросиб Гудкова( 16.12.2020 Ticket№ 0217328 
	//Если ЗаполнятьПоПервойСтроке Тогда
	//	ИмяТЧ = Элемент.Имя;
	//	ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
	//			
	//	Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
	//		Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
	//		
	//		Если ИмяПоля = "Сумма" Тогда
	//			Объект[ИмяТЧ][Сч]["СуммаНДС"] = Объект[ИмяТЧ][0]["СуммаНДС"];
	//		ИначеЕсли ИмяПоля = "Неурег" Тогда
	//			Если Объект[ИмяТЧ][Сч].Неурег = НеурегОтработкаВРИТМ Тогда
	//				Объект[ИмяТЧ][Сч]["Сумма"] = 0;
	//				Объект[ИмяТЧ][Сч]["СуммаНДС"] = 0;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	Если ЗаполнятьПоПервойСтроке Тогда
		ТекД = Элементы.Услуги.ТекущиеДанные;
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		НовоеЗначение = ТекД[ИмяПоля];
		
		//Евросиб Каблов 16.12.2024 ( #94192
		ПроверенныеСтроки = Новый Массив;	
		//Евросиб Каблов 16.12.2024 )
		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			
			//Евросиб Каблов 16.01.2023 ( 60424
			ДанныеСтроки = Объект[ИмяТЧ][Сч];
			Если ИмяПоля = "НеурегПричинаУказаннаяПользователем" Тогда
				Если ЗначениеЗаполнено(ДанныеСтроки.Сделка) Или ДанныеСтроки.Неурег = НеурегОтработкаВРИТМ Или ДанныеСтроки.СуммаПретензии <> 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//Евросиб Каблов 16.01.2023 )
			
			//Евросиб Каблов 16.12.2024 ( #94192
			//РезПроверки = Элементы.Услуги.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			ИдентификаторСтроки = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			РезПроверки = Элементы.Услуги.ПроверитьСтроку(ИдентификаторСтроки);
			//Евросиб Каблов 16.12.2024 )
			
			Если РезПроверки <> Неопределено Тогда
				Если РезПроверки Тогда
					//Евросиб Каблов 16.12.2024 ( #94192
					//Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
					//Если ИмяПоля = "Сумма" Тогда
					//	Объект[ИмяТЧ][Сч]["СуммаНДС"] = ТекД["СуммаНДС"];
					//ИначеЕсли ИмяПоля = "ПоступлениеСумма" Тогда
					//	Объект[ИмяТЧ][Сч]["ПоступлениеСуммаНДС"] = ТекД["ПоступлениеСуммаНДС"];
					//ИначеЕсли ИмяПоля = "Неурег" Тогда
					//	Если Объект[ИмяТЧ][Сч].Неурег = НеурегОтработкаВРИТМ Тогда
					//		Объект[ИмяТЧ][Сч]["Сумма"] = 0;
					//		Объект[ИмяТЧ][Сч]["СуммаНДС"] = 0;
					//	КонецЕсли;
					//КонецЕсли;
					ПроверенныеСтроки.Добавить(ИдентификаторСтроки);
					//Евросиб Каблов 16.12.2024 )
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		
		//Евросиб Каблов 16.12.2024 ( #94192
		Если ЗначениеЗаполнено(ПроверенныеСтроки) Тогда
			ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
			ИмяТекущегоЭлемента = Элементы.Услуги.ТекущийЭлемент.Имя;
			ВыполнитьЗаполнениеПоПервойСтроке(ТекСтрока, ПроверенныеСтроки, ИмяПоля);
		КонецЕсли;
		//Евросиб Каблов 16.12.2024 )
		
	КонецЕсли;
// Евросиб Гудкова) 	
	
		
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	ОбновитьПодсветку();
	//Евросиб Каблов 24.12.2020 ( Ticket#0215402
	УстановитьВидимостьНадписиОтправитьСтрокиВРитм();
	//Евросиб Каблов 24.12.2020 )	
	
КонецПроцедуры

//Евросиб Каблов 16.12.2024 #94192
&НаСервере
Процедура ВыполнитьЗаполнениеПоПервойСтроке(ТекСтрока, ПроверенныеСтроки, ИмяПоля)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	НовоеЗначение = ТекДанные[ИмяПоля];
	
	ЛокацииПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	
	ПроверитьТипЛокации = Ложь;
	
	Если ИмяПоля = "СтанцияОтправления" Или ИмяПоля = "СтанцияНазначения" Тогда
		
		Если ЗначениеЗаполнено(НовоеЗначение) Тогда
			ПроверитьТипЛокации = Истина;
			ТипЛокацииНовогоЗначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовоеЗначение, "Тип");
			ТаблицаНоменклатуры = Объект.Услуги.Выгрузить(, "Номенклатура");
			ТаблицаНоменклатуры.Свернуть("Номенклатура");
			СписокНоменклатуры = ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура");
			СоответствиеТиповЛокацийНоменклатуре = НоменклатураСервер.ПолучитьСоответствиеДоступныхТиповЛокацийНоменклатуре(СписокНоменклатуры);		
		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "Номенклатура" Тогда
		
		ДоступныеТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(НовоеЗначение);
		
	КонецЕсли;	
	
	Для Каждого ИдентификаторСтроки Из ПроверенныеСтроки Цикл
		
		СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		РезультатПроверки = Истина;		
		Если ПроверитьТипЛокации Тогда
			ДоступныеТипыЛокаций = СоответствиеТиповЛокацийНоменклатуре.Получить(СтрокаУслуг.Номенклатура);
			Если ЗначениеЗаполнено(ДоступныеТипыЛокаций) Тогда
				Если ДоступныеТипыЛокаций.Найти(ТипЛокацииНовогоЗначения) = Неопределено Тогда
					РезультатПроверки = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатПроверки Тогда
			
			СтрокаУслуг[ИмяПоля] = НовоеЗначение;
			
			Если ИмяПоля = "Сумма" Тогда
				СтрокаУслуг.СуммаНДС = ТекДанные.СуммаНДС;
			ИначеЕсли ИмяПоля = "ПоступлениеСумма" Тогда
				СтрокаУслуг.ПоступлениеСуммаНДС = ТекДанные.ПоступлениеСуммаНДС;
			ИначеЕсли ИмяПоля = "Номенклатура" Тогда
				
				Если ЗначениеЗаполнено(ДоступныеТипыЛокаций) Тогда
					
					Если ЗначениеЗаполнено(СтрокаУслуг.СтанцияОтправления) Тогда
						Если ДоступныеТипыЛокаций.Найти(СтрокаУслуг.СтанцияОтправления.Тип) = Неопределено Тогда
							СтрокаУслуг.СтанцияОтправления = ЛокацииПустаяСсылка;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаУслуг.СтанцияНазначения) Тогда
						Если ДоступныеТипыЛокаций.Найти(СтрокаУслуг.СтанцияНазначения.Тип) = Неопределено Тогда
							СтрокаУслуг.СтанцияНазначения = ЛокацииПустаяСсылка;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоПоступлению()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьПоПоступлению();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	//Евросиб - АСуслов 13.01.2023 14:41:13 #63243
	//(
	УстановитьДоступностьИзмененияСоставаСтрок();
	//)
	//Евросиб - АСуслов 13.01.2023 14:41:15 #63243
	Если Не ТолькоПросмотр Тогда
		//Евросиб Каблов 13.01.2021 (
		//ДоступностьЭлементов = Не ЗначениеЗаполнено(Объект.СторнируемыйАкцепт);
		//Элементы.Поступление.Доступность = ДоступностьЭлементов;
		//Элементы.Услуги.Доступность = ДоступностьЭлементов;
		//Элементы.Услуги.Видимость = ДоступностьЭлементов;
		ЭтоСторно = ЗначениеЗаполнено(Объект.СторнируемыйАкцепт);
		Элементы.Поступление.ТолькоПросмотр = ЭтоСторно;
		Элементы.Услуги.ТолькоПросмотр = ЭтоСторно;
		Элементы.Услуги.Видимость = Не ЭтоСторно;                      
		//Евросиб - АСуслов 13.01.2023 11:20:51 #63243
		//(
		Элементы.ДекорацияОтменитеПроведение.Видимость = Не ЭтоСторно И Объект.Проведен;
		Если ЭтоСторно Тогда
			Элементы.ПредупреждениеПроведения.Видимость = Ложь;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 13.01.2023 11:20:53 #63243
		//Евросиб Каблов 13.01.2021 ) 
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 17.07.2023
		Если Пользователи.РолиДоступны("ПолныеПрава") Тогда
			Элементы.УслугиРасходыЗаСчетЧП.ТолькоПросмотр = Ложь;	
		КонецЕсли;
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 17.07.2023
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Если ТипЗнч(Объект.Поступление) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		// ++ ДИТ_Агафонов_task 41390
		И НЕ ОпределениеЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах()
		// -- ДИТ_Агафонов_task 41390
		Тогда
		//Евросиб Каблов 22.12.2020 (
		//ДокОбъект.ЗаполнитьУслуги();
		ДокОбъект.ЗаполнитьУслуги("ПоПТУ");
		//Евросиб Каблов 22.12.2020 )
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Иначе
		// Евросиб Фролов (27.01.2022 Task№ 44918
		ТаблицаУслугПТУ = Объект.Услуги.Выгрузить();
		ТаблицаУслугПТУ.Очистить();
		ДокОбъект.ЗаполнитьУслуги("ПоПТУ", ТаблицаУслугПТУ);
		СравнитьПолученнуюТаблицуСТекущей(ТаблицаУслугПТУ);
		// Евросиб Фролов)
	КонецЕсли;		
	
	Для каждого Стр из Объект.Услуги Цикл
		//Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = Услуги_сервер.ПолучитьСуммуАРМКонтроляСписаний(Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке, Стр.СделкаКТК, Стр.Номенклатура);
		//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало (регистр ФактическиеСуммыНакладныхОтнесенныеНаЗатратыСделок не используется)
		Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = 0;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
		Стр.РазницаАРМКСиСуммаИтого = (Стр.ПоступлениеСумма - Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		Стр.ЕстьРазница = (Стр.ПоступлениеСумма > 0 И Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра > 0 И Стр.ПоступлениеСумма <> Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		//Евросиб - АСуслов 07.09.2022 14:06:12 #56540
		//(
		ЗаполнитьПериодОказанияУслуги(Стр);		
		//)
		//Евросиб - АСуслов 07.09.2022 14:07:50 #56540   
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 17.07.2023
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КатегорияРасходов") = Справочники.КатегорииРасходов.НайтиПоКоду("РасхЧстП") Тогда
			Стр.РасходыЗаСчетЧП = Истина;
		КонецЕсли;
		// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 17.07.2023
	КонецЦикла;
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуУслуг(АдресТаблицы)
	
	ТаблицаУслуг = ПолучитьИзВременногоХранилища(АдресТаблицы);
	УдалитьИзВременногоХранилища(АдресТаблицы);
	
	Объект.Услуги.Загрузить(ТаблицаУслуг);
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизитыТаблицыУслуг()
	
//Евросиб Гудкова( 19.07.2022 Ticket№ часть реквизитов заполнялась быстро на форме, часть медленно в модуле менеджера. 
		//перенесла всё заполнение в эту процедуру на форму
//было	Документы.Акцепт.ОбновитьДополнительныеРеквизитыТаблицыУслуг(Объект.Услуги, Объект.Поступление);
//стало
	ТЗСписокОтчетовКомитенту = ПолучитьСписокРеквизитовСделки();
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	Если ТЗСписокОтчетовКомитенту.Количество()>1000 Тогда
		ТЗСписокОтчетовКомитенту.Индексы.Добавить("ИдентификаторСтрокиРасходовВСделке");
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
	//Евросиб Гудкова( 19.07.2022 Ticket№ 
	ТаблицаПТУ = ПолучитьСписокТДпоПТУ();
	// Евросиб Гудкова)
	//Евросиб Каблов 07.09.2022 ( US49022
	ТаблицаДиалогов = ПолучитьТаблицуДиалогов();
	ШаблонПоляНеурегЗапрос = "Запрос %1";
	//Евросиб Каблов 07.09.2022 )
	Для каждого СтрокаУслуга Из Объект.Услуги Цикл
//Евросиб Гудкова( 19.07.2022 Ticket№ 
		СтрокаПТУ = ТаблицаПТУ.Найти(СтрокаУслуга.ИдентификаторСтрокиПоступления, "ИдентификаторСтрокиПоступления");
		Если СтрокаПТУ <> Неопределено Тогда
			СтрокаУслуга.СписокТД = СтрокаПТУ.СписокТД;
		КонецЕсли;
// Евросиб Гудкова)
		Если ЗначениеЗаполнено(СтрокаУслуга.ИдентификаторСтрокиРасходовВСделке) Тогда
			СтрокаОтчет = ТЗСписокОтчетовКомитенту.Найти(СтрокаУслуга.ИдентификаторСтрокиРасходовВСделке, "ИдентификаторСтрокиРасходовВСделке");
			Если СтрокаОтчет <> Неопределено Тогда
//Евросиб Гудкова( 19.07.2022
				ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаОтчет, "ДатаЖДОтправки, СтанцияОтправленияСделки, СтанцияНазначенияСделки,
				|СделкаКТК, СделкаВагоны, СделкаТД, Протокол, ПериодВО, БитаяСсылка");
				//СтрокаУслуга.СтанцияОтправленияСделки = СтрокаОтчет.СтанцияОтправленияСделки;
				//СтрокаУслуга.СтанцияНазначенияСделки = СтрокаОтчет.СтанцияНазначенияСделки;
				//СтрокаУслуга.ДатаЖДОтправки = СтрокаОтчет.ДатаЖДОтправки;
				////Евросиб Каблов 09.07.2021 ( Ticket#0232246
				//СтрокаУслуга.Протокол = СтрокаОтчет.Протокол;
				////Евросиб Каблов 09.07.2021 )
// Евросиб Гудкова)
			КонецЕсли; 
		КонецЕсли; 	
		//Евросиб Каблов 04.03.2021 ( Ticket#0224143
		Если ЗначениеЗаполнено(СтрокаУслуга.Сделка) Или СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
			//Евросиб Каблов 16.06.2021 ( 28971
			Или (ЗначениеЗаполнено(СтрокаУслуга.ПричинаНеакцепта) И СтрокаУслуга.СтатусПричины <> Перечисления.СтатусыПричинНеакцепта.Откз) Тогда
			//Евросиб Каблов 16.06.2021 )
			СтрокаУслуга.ПоказатьВОтбореТолькоНеРазнесенные = Ложь;
		Иначе
			СтрокаУслуга.ПоказатьВОтбореТолькоНеРазнесенные = Истина;
		КонецЕсли;
		//Евросиб Каблов 04.03.2021 )
		
		//Евросиб Каблов 07.09.2022 ( US49022
		Если ЗначениеЗаполнено(СтрокаУслуга.ГУИД) Тогда
			Диалог = ТаблицаДиалогов.Найти(СтрокаУслуга.ГУИД, "ИдентификаторСтрокиАкцепта");
			Если Диалог <> Неопределено Тогда
				СтрокаУслуга.НеурегЗапрос = СтрШаблон(ШаблонПоляНеурегЗапрос, Диалог.ДатаСозданияЗапроса);
				СтрокаУслуга.ГУИДТемы = Диалог.ГУИДТемы;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 07.09.2022 )
		
	КонецЦикла;
// Евросиб Гудкова)	
КонецПроцедуры  

//Евросиб - АСуслов 07.09.2022 14:23:05 #56540
//(
&НаСервере
Процедура ЗаполнитьПериодОказанияУслуги(СтрокаАкцепта)
	
	//Субботин 79474 25.01.2024 начало // доработал алгоритм, и перенес в модуль менеджера
	Если СтрокаАкцепта.ВыгруженаВРИТМ Или ЗначениеЗаполнено(СтрокаАкцепта.Сделка) Тогда
		Возврат
	КонецЕсли;
			
	//Субботин 82523 18.03.2024 баг //Добавил обнуление для проверки
	СтрокаАкцепта.НачалоОказанияУслуги = Дата(1,1,1);
	СтрокаАкцепта.ОкончаниеОказанияУслуги = Дата(1,1,1);
	//Субботин 82523 18.03.2024 баг //Добавил обнуление для проверки
	
	Документы.Акцепт.ЗаполнитьПериодОказанияУслуги(СтрокаАкцепта, Объект.Поступление);	 
	 //Субботин 79474 25.01.2024 Конец  	
		
КонецПроцедуры
//)
//Евросиб - АСуслов 07.09.2022 14:23:17 #56540


&НаСервереБезКонтекста
Функция ПолучитьДанныеШапкиДокументаОснования(Поступление)
	
	Результат = Новый Структура("Контрагент, Договор", Поступление.Контрагент, Поступление.ДоговорКонтрагента);
	
	Попытка
		Результат.Вставить("Регламентный", Поступление.Регламентный);
	Исключение
		Результат.Вставить("Регламентный", Истина);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеПретензионногоБлока();
	
	Если Объект.Услуги.Итог("СделкаСумма") = 0 Тогда
		ДополнитьДанные_Сервер(Ложь);
	КонецЕсли;
	
	УстановитьДоступность();
	
	ОбновитьПодсветку();
	//Евросиб Каблов 24.12.2020 ( Ticket#0215402
	УстановитьВидимостьНадписиОтправитьСтрокиВРитм();
	//Евросиб Каблов 24.12.2020 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	Если СписокГУИДкАвторазнесению.Количество() > 0 Тогда
		Для Каждого ГУИДкАвторазнесению Из СписокГУИДкАвторазнесению Цикл
			НайденнаеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", ГУИДкАвторазнесению.Значение));
			НайденнаеСтроки[0].Выбрать = Истина;
		КонецЦикла;
		н_ДобавитьВозмещаемыеДоходыИРасходы(Неопределено);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	ОбновлениеТаймераИсключенияОчередиОтложенногоИзменения();
	ВремяОбновленияПредупрежденияВСекундах = 30;
	ПодключитьОбработчикОжидания("ОбновлениеТаймераИсключенияОчередиОтложенногоИзменения", ВремяОбновленияПредупрежденияВСекундах, Ложь);
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
&НаКлиенте
Процедура ОбновлениеТаймераИсключенияОчередиОтложенногоИзменения()
	
	ТекстПредупреждения = ПолучитьСтатусВременногоИсключения(Объект.Ссылка);
	
	Если ТекстПредупреждения = Неопределено Тогда
		Элементы.ПредупреждениеИсключенияОчередиОтложенногоИзменения.Видимость = Ложь;
		Элементы.ОтключитьБлокировкуОчереди.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Элементы.ПредупреждениеИсключенияОчередиОтложенногоИзменения.Видимость = Истина;
	Элементы.ОтключитьБлокировкуОчереди.Видимость = Истина;
	Элементы.ОтключитьБлокировкуОчереди.Доступность = Истина;
	Элементы.ПредупреждениеИсключенияОчередиОтложенногоИзменения.Заголовок = ТекстПредупреждения;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.УслугиГруппаКоличествоЦена.ТолькоПросмотр 	= Объект.Проведен;
	Элементы.УслугиГруппаСумма.ТолькоПросмотр 			= Объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
//Евросиб Гудкова( 13.12.2021 Ticket№ 42922
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОценкаПроизводительностиКлиент.УстановитьПризнакОшибкиЗамера(ИдентификаторЗамераПроведение, Ложь);
	КонецЕсли;
// Евросиб Гудкова)

	ОбновитьПодсветку();
	Оповестить("ЗаписьАкцепта", Объект.Ссылка);
	//Евросиб Каблов 24.12.2020 (
	УстановитьВидимостьНадписиОтправитьСтрокиВРитм();
	//Евросиб Каблов 24.12.2020 )
	
	// ++ ДИТ_Агафонов_task 41390 02.02.2023
	Если СообщенияПослеПроведения.Количество()>0 Тогда
		Для каждого ТекстСообщения Из СообщенияПослеПроведения Цикл
			Сообщить(ТекстСообщения);
		КонецЦикла;
		СообщенияПослеПроведения.Очистить();
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390 02.02.2023
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеКолонки(Команда)
	
	Для каждого Стр из Элементы.Услуги.ПодчиненныеЭлементы Цикл
		Если Стр.Видимость = Ложь Тогда Стр.Видимость = Истина; КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументДоступенДляСторно(Акцепт)
	
	Возврат Документы.Акцепт.ДокументДоступенДляСторно(Акцепт);
	
КонецФункции

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекДанные.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекДанные.ПоступлениеСтавкаНДС), Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПретензию(Команда)
	
	ТекД = Элементы.Услуги.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		//Евросиб Каблов 11.06.2021 ( Ticket#0229012
		Если ЗначениеЗаполнено(ТекД.Сделка) Тогда
			ПоказатьПредупреждение(, "Выбранная строка привязана к сделке! Сначала отвяжите строку, а затем повторите создание претензии.");
			Возврат;
		КонецЕсли;
		//Евросиб Каблов 11.06.2021 )
		
		//Евросиб Каблов 31.08.2021 ( Ticket#0241956
		Если ТекД.Неурег = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ") Тогда
			ПоказатьПредупреждение(, "Выбранная строка передана в РИТМ! Сначала верните строку из РИТМа, а затем повторите создание претензии.");
			Возврат;
		КонецЕсли;
		//Евросиб Каблов 31.08.2021 )
		
		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораПретензии", ЭтаФорма);
		ОткрытьФорму("Документ.Акцепт.Форма.ФормированиеПретензии", Новый Структура("ИсходнаяУслуга,ИсходноеКоличество,ИсходнаяСумма", ТекД.Номенклатура, ТекД.ПоступлениеКоличество, ТекД.ПоступлениеСумма), ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПретензии(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	ТекД = Элементы.Услуги.ТекущиеДанные;
	//Евросиб Каблов 04.06.2021 ( Ticket#0229012
	//Если ТекД <> неопределено И ТекД.ПоступлениеКоличество = П1.ПретензионноеКоличество Тогда
	Если ТекД <> неопределено И ТекД.ПоступлениеСумма = П1.ПретензионнаяСумма Тогда
	//Евросиб Каблов 04.06.2021 )	
		ТекД.ПричинаНеакцепта = П1.ПричинаПретензии;
		ТекД.СтатусПричины = ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.НаРассм");
		ТекД.ДатаПретензии = ТекущаяДата();
		ТекД.ПодтвержденнаяСумма =  П1.ПризнаннаяСумма;
		ТекД.СуммаПретензии = П1.ПретензионнаяСумма;		
		ТекД.Сумма = ТекД.ПоступлениеСумма;
		ТекД.СуммаНДС = ТекД.ПоступлениеСуммаНДС;
		ТекД.ПолностьюРазнесено = Истина;
		ТекД.НоменклатураСделки = ПредопределенноеЗначение("Справочник.Номенклатура.Претензии");
		ТекД.СделкаСтавкаНДС = ТекД.ПоступлениеСтавкаНДС;
	//Евросиб Каблов 04.06.2021 ( Ticket#0229012
	//ИначеЕсли ТекД <> неопределено И П1.ПретензионноеКоличество > 0 Тогда
	//	
	//	ТекД.ПоступлениеКоличество = П1.ПризнанноеКоличество;
	//	ТекД.ПоступлениеЦена = ТекД.ПоступлениеЦена * (П1.ПризнаннаяСумма / ТекД.ПоступлениеСумма);
	//	ТекД.ПоступлениеСуммаНДС = ТекД.ПоступлениеСуммаНДС * (П1.ПризнаннаяСумма / ТекД.ПоступлениеСумма);
	//	ТекД.ПоступлениеСумма = П1.ПризнаннаяСумма;
	//	ТекД.ПодтвержденнаяСумма =  П1.ПризнаннаяСумма;
	//	
	//	НовСтрока = Объект.Услуги.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтрока, ТекД);
	//	НовСтрока.ДатаПретензии = ТекущаяДата();
	//	НовСтрока.ПоступлениеКоличество = П1.ПретензионноеКоличество;
	//	НовСтрока.ПоступлениеЦена = ТекД.ПоступлениеЦена * (П1.ПретензионнаяСумма / ТекД.ПоступлениеСумма);
	//	НовСтрока.ПоступлениеСуммаНДС = ТекД.ПоступлениеСуммаНДС * (П1.ПретензионнаяСумма / ТекД.ПоступлениеСумма);
	//	НовСтрока.ПоступлениеСумма = П1.ПретензионнаяСумма;
	//	НовСтрока.ПричинаНеакцепта = П1.ПричинаПретензии;
	//	НовСтрока.СтатусПричины = ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.НаРассм");
	//	НовСтрока.СуммаПретензии = П1.ПретензионнаяСумма;
	
	//	ТекД.ПоЭтойСтрокеСформированаЧастичнаяПретензия = Истина;
		
	ИначеЕсли ТекД <> неопределено И П1.ПретензионнаяСумма > 0 Тогда
		
		ПризнаннаяСуммаНДС = ТекД.ПоступлениеСуммаНДС * (П1.ПризнаннаяСумма / ТекД.ПоступлениеСумма);
		ПретензионнаяСуммаНДС = ТекД.ПоступлениеСуммаНДС - ПризнаннаяСуммаНДС;
		ТекД.ПоступлениеСуммаНДС = ПризнаннаяСуммаНДС;
		ТекД.ПоступлениеСумма = П1.ПризнаннаяСумма;
		ТекД.ПоступлениеЦена = ТекД.ПоступлениеСумма;
		ТекД.ПоступлениеКоличество = 1;
		ТекД.СуммаРасходовИзАРМКонтроляСписанийИзРегистра = 0;
		ТекД.РазницаАРМКСиСуммаИтого = 0;
		
		НовСтрока = Объект.Услуги.Вставить(Объект.Услуги.Индекс(ТекД) + 1);
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекД);
		НовСтрока.ГУИД = Строка(Новый УникальныйИдентификатор);
		НовСтрока.ДатаПретензии = ТекущаяДата();
		НовСтрока.ПоступлениеСумма = П1.ПретензионнаяСумма;
		НовСтрока.ПоступлениеСуммаНДС = ПретензионнаяСуммаНДС;
		НовСтрока.ПричинаНеакцепта = П1.ПричинаПретензии;
		НовСтрока.СтатусПричины = ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.НаРассм");
		НовСтрока.СуммаПретензии = П1.ПретензионнаяСумма;
		НовСтрока.ПоступлениеЦена = НовСтрока.ПоступлениеСумма;
		//НовСтрока.ПоступлениеКоличество = 0;
		//ДИТ, Беляев СЮ, BUG 83808 / TA 85076, 14-05-2024, начало (требуется количество, иначе в Сделке в расчетах деление на 0)
		НовСтрока.ПоступлениеКоличество = 1;
		//ДИТ, Беляев СЮ, BUG 83808 / TA 85076, 14-05-2024, конец
		НовСтрока.Сумма = НовСтрока.ПоступлениеСумма;
		НовСтрока.СуммаНДС = ПретензионнаяСуммаНДС;
		НовСтрока.ПолностьюРазнесено = Истина;
		НовСтрока.НоменклатураСделки = ПредопределенноеЗначение("Справочник.Номенклатура.Претензии");
		НовСтрока.СделкаСтавкаНДС = НовСтрока.ПоступлениеСтавкаНДС;
		НовСтрока.СуммаРасходовИзАРМКонтроляСписанийИзРегистра = 0;
		НовСтрока.РазницаАРМКСиСуммаИтого = 0;
	//Евросиб Каблов 04.06.2021 )
		
	КонецЕсли;

	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
	ОбновитьСуммуПретензий();
	ОбновитьОтображениеПретензионногоБлока();
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуПретензий()
	
	Объект.СуммаПретензий = 0;
	Для каждого стр из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(стр.ПричинаНеакцепта) Тогда
//Евросиб Гудкова( 02.11.2020 Ticket№ 0212652
// 			Объект.СуммаПретензий = Объект.СуммаПретензий + стр.ПоступлениеСумма;
			Объект.СуммаПретензий = Объект.СуммаПретензий + стр.СуммаПретензии;
// Евросиб Гудкова)
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПретензионногоБлока()
		
	//Евросиб Каблов 19.05.2022 ( Ticket#0270481
	//ВидимостьКолонки = ЗначениеЗаполнено(Объект.СуммаПретензий);
	ВидимостьКолонки = Ложь;
	Для Каждого Стр Из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(Стр.ПричинаНеакцепта) Или ЗначениеЗаполнено(Стр.СуммаПретензии) Тогда
			ВидимостьКолонки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 19.05.2022 )
	Элементы.УслугиПоЭтойСтрокеСформированаЧастичнаяПретензия.Видимость = ВидимостьКолонки;
	Элементы.ГруппаПретензионнаяРабота.Видимость = ВидимостьКолонки;
	Элементы.УслугиСтатусПричины.Видимость = ВидимостьКолонки;
	Элементы.УслугиПричинаНеакцепта.Видимость = ВидимостьКолонки;
	Элементы.УслугиДатаПретензии.Видимость = ВидимостьКолонки;
	Элементы.УслугиПримечаниеНеакцепта.Видимость = ВидимостьКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПричинаНеакцептаПриИзменении(Элемент)
	
	ОбновитьСуммуПретензий();
	ОбновитьОтображениеПретензионногоБлока();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоРасхожденияСКонтролемСписанийПриИзменении(Элемент)
	
	Если ТолькоРасхожденияСКонтролемСписаний Тогда
		
		Для каждого Стр из Объект.Услуги Цикл
			Стр.ЕстьРазница = (Стр.ПоступлениеСумма > 0 И Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра > 0 И Стр.ПоступлениеСумма <> Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
		КонецЦикла;
		
		Элементы.Услуги.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьРазница", Истина);
		
	Иначе
		
		Элементы.Услуги.ОтборСтрок = неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВыделенное(Команда)
	
	Для каждого Стр из Элементы.Услуги.ВыделенныеСтроки Цикл
		
		ТекСтр = Объект.Услуги.НайтиПоИдентификатору(Стр);
		ТекСтр.ПодтвержденнаяСумма = ТекСтр.ПоступлениеСумма;
		ТекСтр.СуммаПретензии = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АвторазнесениеПоПараметрам(Команда)
	
//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени("АкцептЗапускРучногоРазнесения");
// Евросиб Гудкова)
	массивУслуг = Новый Массив;
	массивВагонов = Новый Массив;
	массивКТК = Новый Массив;
	массивЖДН = Новый Массив;
	массивПоставщиков = Новый Массив; массивПоставщиков.Добавить(ПоставщикПТУ);
	массивДоговоров = Новый Массив; массивДоговоров.Добавить(ДоговорПТУ);
	массивСтОтправления = Новый Массив;
	массивСтНазначения = Новый Массив;
	ДатаОтправленияМин = Дата("00010101");
	ДатаОтправленияМакс = Дата("00010101");
	ДатаПрибытияМин = Дата("00010101");
	ДатаПрибытияМакс = Дата("00010101");
	
	МассивСтрок = Новый Массив;
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0229256
	ТипОтчетКомитенту = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
	ПустаяСсылкаОтчетКомитенту = ПредопределенноеЗначение("Документ.ОтчетКомитентуОПродажах.ПустаяСсылка");
	//Евросиб Каблов 28.04.2021 )
	
	Для каждого Стр из Объект.Услуги Цикл
		
		Если Стр.ГУИД = "" Тогда
			Стр.ГУИД = Строка(Новый УникальныйИдентификатор);
		КонецЕсли; 
		
		Если Стр.Неурег = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ") Тогда Продолжить; КонецЕсли;
		
		//Евросиб Каблов 28.04.2021 ( Ticket#0229256
		Если ТипЗнч(Стр.УчДокумент) = ТипОтчетКомитенту И Стр.УчДокумент <> ПустаяСсылкаОтчетКомитенту Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб Каблов 28.04.2021 )
		
		//Евросиб Каблов 05.06.2021 ( Ticket#0229012
		Если ЗначениеЗаполнено(Стр.ПричинаНеакцепта) И Стр.СтатусПричины <> ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.Откз") Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб Каблов 05.06.2021 ) 
		
		СтрР = Новый Структура("Номенклатура,Содержание,ВесПоНакладной,Неурег,НеурегКомментарий,ИдентификаторСтрокиПоступления,ПоступлениеЦена,Сделка,ИдентификаторСтрокиРасходовВСделке,НачалоОказанияУслуги,ОкончаниеОказанияУслуги,ТранспортныйДокумент,СтанцияОтправления,СтанцияНазначения,Контейнер,Вагон,ПолностьюРазнесено,ПоступлениеСумма,ГУИД");
		ЗаполнитьЗначенияСвойств(СтрР, Стр);
		
		МассивСтрок.Добавить(СтрР);
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) И массивУслуг.Найти(Стр.Номенклатура) = неопределено Тогда 
			
			массивУслуг.Добавить(Стр.Номенклатура);
			
			РазСоп = ПретензииИНеакцептыСервер.НоменклатуруРазрешеноСопоставлятьС(Стр.Номенклатура, Стр.ВесПоНакладной);
			Для каждого Стр4 из РазСоп Цикл массивУслуг.Добавить(Стр4); КонецЦикла;
			
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Вагон) И массивВагонов.Найти(Стр.Вагон) = неопределено Тогда массивВагонов.Добавить(Стр.Вагон); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Контейнер) И массивКТК.Найти(Стр.Контейнер) = неопределено Тогда массивКТК.Добавить(Стр.Контейнер); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ТранспортныйДокумент) И массивЖДН.Найти(Стр.ТранспортныйДокумент) = неопределено Тогда массивЖДН.Добавить(Стр.ТранспортныйДокумент) КонецЕсли;

		Если ЗначениеЗаполнено(Стр.НачалоОказанияУслуги) тогда ДатаОтправленияМин = ?(ЗначениеЗаполнено(ДатаОтправленияМин), Мин(ДатаОтправленияМин, Стр.НачалоОказанияУслуги), Стр.НачалоОказанияУслуги); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.НачалоОказанияУслуги) тогда ДатаОтправленияМакс = ?(ЗначениеЗаполнено(ДатаОтправленияМакс), Макс(ДатаОтправленияМакс, Стр.НачалоОказанияУслуги), Стр.НачалоОказанияУслуги); КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ОкончаниеОказанияУслуги) тогда ДатаПрибытияМин = ?(ЗначениеЗаполнено(ДатаПрибытияМин), Мин(ДатаПрибытияМин, Стр.ОкончаниеОказанияУслуги), Стр.ОкончаниеОказанияУслуги); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ОкончаниеОказанияУслуги) тогда ДатаПрибытияМакс = ?(ЗначениеЗаполнено(ДатаПрибытияМакс), Макс(ДатаПрибытияМакс, Стр.ОкончаниеОказанияУслуги), Стр.ОкончаниеОказанияУслуги); КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ТранспортныйДокумент) И массивЖДН.Найти(Стр.ТранспортныйДокумент) = неопределено Тогда массивЖДН.Добавить(Стр.ТранспортныйДокумент) КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.СтанцияОтправления) И массивСтОтправления.Найти(Стр.СтанцияОтправления) = неопределено Тогда массивСтОтправления.Добавить(Стр.СтанцияОтправления) КонецЕсли;
		Если ЗначениеЗаполнено(Стр.СтанцияНазначения) И массивСтНазначения.Найти(Стр.СтанцияНазначения) = неопределено Тогда массивСтНазначения.Добавить(Стр.СтанцияНазначения) КонецЕсли;
		
	КонецЦикла;
	
	
	ПараметрыЪ = Новый Структура("массивСтрок,массивДоговоров,массивУслуг,массивКТК,массивВагонов,массивЖДН,массивПоставщиков,массивСтОтправления,массивСтНазначения,ДатаОтправленияМин,ДатаОтправленияМакс,ДатаПрибытияМин,ДатаПрибытияМакс,НомерАкцепта, ДатаАкцепта
//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
	|,УИДЗамера",
// Евросиб Гудкова)
	МассивСтрок,массивДоговоров,массивУслуг,массивКТК,массивВагонов,массивЖДН,массивПоставщиков,массивСтОтправления,массивСтНазначения,ДатаОтправленияМин,ДатаОтправленияМакс,ДатаПрибытияМин,ДатаПрибытияМакс,Объект.Номер, Объект.Дата
//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
	,УИДЗамера);
// Евросиб Гудкова)
	ОпОп = Новый ОписаниеОповещения("ЗаконченПодбор", ЭтаФорма);
	
	
	ОткрытьФорму("Документ.Акцепт.Форма.АвторазнесениеПоПараметрам1", ПараметрыЪ, , ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченПодбор(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Каждого Стр Из П1 Цикл
		
		// Евросиб US 83437 Рыбьяков К.А. 15.07.2024 ((
		//Если ДанныеДляДобавленияВАкцепт <> Неопределено Тогда
		//	ПроверитьСтрокиДляОтложенногоИзменения(Стр);
		//КонецЕсли;
		// Евросиб Рыбьяков К.А. 15.07.2024 ))
		
		//НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоступления,Контейнер,Вагон,ТранспортныйДокумент", СТр.ИдентификаторСтрокиПоступления,СТр.Контейнер,СТр.Вагон,СТр.ТранспортныйДокумент));
		НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Стр.ГУИД));
		Для каждого Стр2 из НайдСтроки Цикл
			//Евросиб Каблов 20.01.2021 ( Ticket#0213606
			Если ЗначениеЗаполнено(Стр.Сделка) Тогда
				Если Не ЗначениеЗаполнено(Стр2.ПривязалПользователь)
					И (Стр2.Сделка <> Стр.Сделка
					Или Стр2.ИдентификаторСтрокиРасходовВСделке <> Стр.ИдентификаторСтрокиРасходовВСделке) Тогда
					
					Стр2.ПривязалПользователь = ПользователиКлиент.ТекущийПользователь();
				КонецЕсли;
			Иначе
				Стр2.ПривязалПользователь = Неопределено;
			КонецЕсли;
			//Евросиб Каблов 20.01.2021 )
			//Евросиб - АСуслов 08.09.2022 14:03:01 #56540
			//(
			//Стр2.ИдентификаторСтрокиРасходовВСделке = Стр.ИдентификаторСтрокиРасходовВСделке;
			//Стр2.Сделка = Стр.Сделка;    
			ЗаполнитьЗначенияСвойств(Стр2, Стр, "ИдентификаторСтрокиРасходовВСделке, Сделка, НачалоОказанияУслуги, ОкончаниеОказанияУслуги");
			//)
			//Евросиб - АСуслов 08.09.2022 14:03:05 #56540
			Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Стр.Сделка);
			//Евросиб - АСуслов 29.08.2022 14:08:24 #56528
			//(
			Если ЗначениеЗаполнено(Стр.Сделка) Тогда //ДИТ, Беляев СЮ, US 84896/ TA 85068, 22-05-2024, добавил условие по результатам тестирования в TASK 84898
				Стр2.ПричинаОтключенияСтрокиВСделке = Неопределено;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 29.08.2022 14:08:26 #56528 
		КонецЦикла;
		
		
	КонецЦикла;
	
	ДополнитьДанные(неопределено);
	
	Для Каждого ТекСтрокаУслуги Из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(ТекСтрокаУслуги.Сделка) Тогда
			ТекСтрокаУслуги.Сумма = ТекСтрокаУслуги.ПоступлениеСумма;
			ТекСтрокаУслуги.СуммаНДС = ТекСтрокаУслуги.ПоступлениеСуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПодсветку();
	
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПричинуНеурегРасходов(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаПричиныНеурегов", ЭтаФорма);
	ОткрытьФорму("Документ.Акцепт.Форма.ФормаУказанияПричиныНеакцепта",,,,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПричиныНеурегов(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого ТекС из Объект.Услуги Цикл
		
		Если ТекС.Выбрать = ложь Тогда Продолжить; КонецЕсли;
		
		//ТекС = Объект.Услуги.НайтиПоИдентификатору(Стр);
		
		Если ТекС.Неурег = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ") Тогда Продолжить; КонецЕсли;
		
		//Евросиб Каблов 16.12.2020 ( Ticket#0211264
		Если П1.Причина = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ") И ЗначениеЗаполнено(ТекС.Сделка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для строки, привязанной к сделке, запрещено выбирать причину неурегулированных расходов Отработка в РИТМ!", Объект.Ссылка, "Услуги[" + Формат(ТекС.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сделка", Объект);
			Продолжить;
		КонецЕсли;
		//Евросиб Каблов 16.12.2020 )
		
		Если ЗначениеЗаполнено(П1.Причина) Тогда
			ТекС.Неурег = П1.Причина;
			Если ТекС.Неурег = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ") Тогда
				ТекС.Сумма = 0;
				ТекС.СуммаНДС = 0;
				//Евросиб Каблов 31.08.2021 ( Ticket#0241956
				ТекС.ПричинаНеакцепта = Неопределено;
				ТекС.СтатусПричины = неопределено;
				ТекС.ДатаПретензии = '00010101';
				ТекС.СуммаПретензии = 0;
				ТекС.ПодтвержденнаяСумма = 0;
				ТекС.НоменклатураСделки = Неопределено;
				//Евросиб Каблов 31.08.2021 )	
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(П1.Комментарий) Тогда ТекС.НеурегКомментарий = П1.Комментарий; КонецЕсли;
		
	КонецЦикла;
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРИТМСтроки(Команда)
	
	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ПодтверждениеОтработки", ЭтаФорма, НеЗаписан);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой акцепта его необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ПодтверждениеОтработки(КодВозвратаДиалога.Да, НеЗаписан);
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступностьПТУ(ПТУ)
	
	Результат  = Истина;
	
	Попытка
		ПТУОбъект = ПТУ.ПолучитьОбъект();
		ПТУОбъект.Заблокировать();
		ПТУОбъект.Разблокировать();
	Исключение
		ОО = ОписаниеОшибки();
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодтверждениеОтработки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ПередачаXMLРИТМ(П2); //Гудкова 2й параметр необходимости записи
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФлагЭДО(Контрагент)
	
	Возврат Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент);
	
	//Запрос = новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Диадок_ЮрФизЛица.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//               |ГДЕ
	//               |	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//               |	И НЕ Диадок_ЮрФизЛица.ПометкаУдаления";
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Контрагент);
	//Возврат ?(Запрос.Выполнить().Пустой(), "0", "1");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьНДСВРИТМ(СтавкаНДС, НДСВключенВСтоимость)
	
	РезультатТаблица = Новый ТаблицаЗначений;
	РезультатТаблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	РезультатТаблица.Колонки.Добавить("НДСВключен", Новый ОписаниеТипов("Булево"));
	РезультатТаблица.Колонки.Добавить("Формулировка", Новый ОписаниеТипов("Строка"));
	
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС; НСтр.НДСВключен = Истина; НСтр.Формулировка 	= "Без НДС";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС; НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "Без НДС";
	
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС0; НСтр.НДСВключен = Истина; НСтр.Формулировка 		= "НДС-0%";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС0; НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-0%";
	
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18; НСтр.НДСВключен = Истина; НСтр.Формулировка		= "НДС-18% (в том числе)";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18; НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-18% (кроме того)";
	
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; НСтр.НДСВключен = Истина; НСтр.Формулировка 		= "НДС-20% (в том числе)";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-20% (кроме того)";
	
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС5;  НСтр.НДСВключен = Истина; НСтр.Формулировка 		= "НДС-5% (в том числе)";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС5;  НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-5% (кроме того)";
	
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС7;  НСтр.НДСВключен = Истина; НСтр.Формулировка 		= "НДС-7% (в том числе)";
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС7;  НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-7% (кроме того)";	
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;  НСтр.НДСВключен = Истина; НСтр.Формулировка 		= "НДС-22% (в том числе)";
    НСтр = РезультатТаблица.Добавить(); НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;  НСтр.НДСВключен = Ложь; НСтр.Формулировка 		= "НДС-22% (кроме того)";	
    //Евросиб СубботинВ #125845 09.12.2025 Конец
	
	НайдСтроки = РезультатТаблица.НайтиСтроки(Новый Структура("СтавкаНДС, НДСВключен", СтавкаНДС, НДСВключенВСтоимость));
	
	Если НайдСтроки.Количество() > 0 Тогда
		
		Возврат НайдСтроки[0].Формулировка;
		
	КонецЕсли;
	
//Евросиб Гудкова( 27.01.2021 Ticket№ 0221405
// 	Возврат "Налогообложение не имеет смысла";
 	Возврат "Без НДС";
// Евросиб Гудкова)
	
КонецФункции

&НаСервере
Процедура ПередачаXMLРИТМ(НеЗаписан) //Евросиб Гудкова( 29.10.2020 добавила параметр
	
//Евросиб Гудкова( 29.10.2020 Ticket№ 0212208
	Если НеЗаписан Тогда
		//Евросиб Каблов 08.10.10 (
		АкцептПровелся = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Если Не АкцептПровелся Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести акцепт. Выгрузка строк в РИТМ не выполнена.");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
// Евросиб Гудкова) 	
	
	// ++ ДИТ_Агафонов_task 41390 п6.6
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") 
		и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Поступление,"ВидОперации") = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		ЭтоИсправлениеПервички = Истина;					
		ПоступлениеИсходное = НайтиПоступлениеИсходноеРекурсивно(Объект.Поступление);
	Иначе	
		ЭтоИсправлениеПервички = Ложь;
		ПоступлениеИсходное = Объект.Поступление;
	КонецЕсли;	
	// -- ДИТ_Агафонов_task 41390
	
	НомерСФ = "";
	ДатаСФ = "";
	// ++ ДИТ_Агафонов_task 41390 п6.6
	НомерСФИсп = "";
	ДатаСФИсп = "";
	// -- ДИТ_Агафонов_task 41390
	
//Евросиб Гудкова( 18.10.2020 Ticket№ 0210517 для нерезидентов наличие СФ не требуется
    // ++ ДИТ_Агафонов_task 41390 п6.6
	//РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Поступление, "Контрагент, НомерВходящегоДокумента, ДатаВходящегоДокумента, СуммаВключаетНДС");
	РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеИсходное, "Контрагент, НомерВходящегоДокумента, ДатаВходящегоДокумента, СуммаВключаетНДС");
	Если ЭтоИсправлениеПервички Тогда
		РеквизитыКорректировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Поступление, "Контрагент, НомерВходящегоДокумента, ДатаВходящегоДокумента, СуммаВключаетНДС, НомерИсправления, ДатаИсправления");
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390
	СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПТУ.Контрагент, "СтранаРегистрации");
	Если СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Объект.Поступление, "СчетФактураПолученный");
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			// ++ ДИТ_Агафонов_task 41390 п6.6
			//РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "НомерВходящегоДокумента, ДатаВходящегоДокумента");
			РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "НомерВходящегоДокумента, ДатаВходящегоДокумента, НомерИсправления, ДатаИсправления");
			НомерСФИсп = РеквизитыСФ.НомерИсправления;
			ДатаСФИсп = РеквизитыСФ.ДатаИсправления;			
			// -- ДИТ_Агафонов_task 41390
			НомерСФ = РеквизитыСФ.НомерВходящегоДокумента;
			ДатаСФ = РеквизитыСФ.ДатаВходящегоДокумента;
		// ++ ДИТ_Агафонов_task 41390 п6.6
		ИначеЕсли ЭтоИсправлениеПервички Тогда
			НомерСФ = РеквизитыПТУ.НомерВходящегоДокумента;
			ДатаСФ = РеквизитыПТУ.ДатаВходящегоДокумента;
			НомерСФИсп = РеквизитыКорректировки.НомерИсправления;
			ДатаСФИсп = РеквизитыКорректировки.ДатаИсправления;			
		// -- ДИТ_Агафонов_task 41390
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для поступления товаров и услуг не введен счет-фактура! Выгрузка строк в РИТМ не выполнена.");
			Возврат;
		КонецЕсли;
		//Евросиб Каблов )
	Иначе	
		НомерСФ = РеквизитыПТУ.НомерВходящегоДокумента;
		ДатаСФ = РеквизитыПТУ.ДатаВходящегоДокумента;
		// ++ ДИТ_Агафонов_task 41390 п6.6
		Если ЭтоИсправлениеПервички Тогда
			СчетФактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Объект.Поступление, "СчетФактураПолученный");
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "НомерВходящегоДокумента, ДатаВходящегоДокумента, НомерИсправления, ДатаИсправления");
				НомерСФ = РеквизитыСФ.НомерВходящегоДокумента;
				ДатаСФ = РеквизитыСФ.ДатаВходящегоДокумента;
				НомерСФИсп = РеквизитыСФ.НомерИсправления;
				ДатаСФИсп = РеквизитыСФ.ДатаИсправления;			
			Иначе
				НомерСФИсп = РеквизитыКорректировки.НомерИсправления;
				ДатаСФИсп = РеквизитыКорректировки.ДатаИсправления;
			КонецЕсли;
		КонецЕсли;
		// -- ДИТ_Агафонов_task 41390
	КонецЕсли; 
// Евросиб Гудкова) 	
	
	Запрос = Новый Запрос;
//Евросиб Гудкова( 26.10.2020 Ticket№ 0211615
//было
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника
	//               |ИЗ
	//               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	//               |ГДЕ
	//               |	ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
	//               |	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)
	//               |	И ПротоколОбменов.Объект = &Объект_Ссылка
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ПротоколОбменов.УИДИсточника
	//               |ИЗ
	//               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	//               |ГДЕ
	//               |	ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
	//               |	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)
	//               |	И ПротоколОбменов.Объект = &Объект_Ссылка";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	ПротоколОбменов.ДействиеПриОбмене КАК ДействиеПриОбмене,
	               |	ПротоколОбменовЗаказ.НомерДатаВБУ КАК НомерДатаЗаказа
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовЗаказ
	               |			ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = ПротоколОбменовЗаказ.Объект
	               |		ПО ПротоколОбменов.Объект = ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
	               |			И (ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.НомерСтроки = 1)
	               |ГДЕ
	               |	ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)
	               |	И ПротоколОбменов.Объект = &Объект_Ссылка";
// Евросиб Гудкова) 	
	Запрос.УстановитьПараметр("Объект_Ссылка", Объект.Поступление);
	
	ФорматМаскиВремени = "ДФ=гггг-ММ-ддTЧЧ:мм:сс";
	ФорматЧисла = "ЧРД=.; ЧН=; ЧГ=";
	УстановитьПривилегированныйРежим(Истина);
	ТекЛогин = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	УстановитьПривилегированныйРежим(Ложь);
	
	УИДПоступления = Неопределено;
	РезультатЗапроса = Запрос.Выполнить();
	ТабРез = РезультатЗапроса.Выгрузить();
	
	//Евросиб Каблов 13.05.2021 ( Ticket#0222113 если документом-основанием является коррПТУ, то вместо ГУИДа ПТУ возвращать в РИТМ реквизит ГУИДстроки
	ИдентификаторыСтрокКоррПТУ = Новый Соответствие;
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаПоступленияУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	КорректировкаПоступленияУслуги.ГУИДстроки КАК ГУИДстроки
		|ИЗ
		|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|ГДЕ
		|	КорректировкаПоступленияУслуги.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.Поступление);
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл		
			ИдентификаторыСтрокКоррПТУ.Вставить(Выборка.ГУИДПТУ, Выборка.ГУИДстроки);		
		КонецЦикла;
	КонецЕсли;
	//Евросиб Каблов 13.05.2021 )
	
	Если РезультатЗапроса.Пустой() Или ТабРез[0].ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
		// это свой собственный ПТУ
		НомерДатаЗаказа = "";
		Если РезультатЗапроса.Пустой() Тогда
			УИДПоступления = Строка(Объект.Поступление.УникальныйИдентификатор());
		Иначе
			УИДПоступления = ТабРез[0].УИДИсточника;
			НомерДатаЗаказа = ТабРез[0].НомерДатаЗаказа;
		КонецЕсли; 
		
		ТЧРаспределенияПоУслугам = Новый ТаблицаЗначений;
		ТЧРаспределенияПоУслугам.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЧРаспределенияПоУслугам.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		ТЧРаспределенияПоУслугам.Колонки.Добавить("НДС", Новый ОписаниеТипов("Число"));
		ТЧРаспределенияПоУслугам.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС")); //Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
		ТЧРаспределенияПоУслугам.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка")); //Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
		
		Для каждого Стр из Объект.Услуги Цикл
			
			Если Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда
				
				НСтр = ТЧРаспределенияПоУслугам.Добавить();
				НСтр.Услуга = Стр.Номенклатура;
				НСтр.Сумма = ?(РеквизитыПТУ.СуммаВключаетНДС, Стр.ПоступлениеСумма, Стр.ПоступлениеСумма - Стр.ПоступлениеСуммаНДС); //Евросиб Гудкова( 05.11.2020 Ticket№ 0212465
				НСтр.НДС = Стр.ПоступлениеСуммаНДС;
				НСтр.СтавкаНДС = Стр.ПоступлениеСтавкаНДС;//Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
				НСтр.Содержание = СокрЛП(Стр.Содержание);//Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
			КонецЕсли;
			
		КонецЦикла;
		
		ТЧРаспределенияПоУслугам.Свернуть("Услуга, СтавкаНДС, Содержание", "Сумма, НДС"); //Евросиб Гудкова( 22.10.2020 Ticket№ 0210027 СтавкаНДС, Содержание
		
		СуммаОбрабатываемогоВРИТМ = ТЧРаспределенияПоУслугам.Итог("Сумма");
		НДСОбрабатываемогоВРИТМ = ТЧРаспределенияПоУслугам.Итог("НДС");
		
		РезультатXML = "<Список_ВСФ>
							|<ВСФ>
							// ++ ДИТ_Агафонов_task 41390 п6.6
////Евросиб Гудкова( 20.04.2021 Ticket№ 0230136
//							|<ГУИД_ВСФ>"+Строка(Объект.Поступление.УникальныйИдентификатор())+"</ГУИД_ВСФ>
//// Евросиб Гудкова) 		
							//|<Ссылочный_код_ВСФ>"+Объект.Поступление.Номер+"</Ссылочный_код_ВСФ>
							//|<pmRfCode>"+Объект.Поступление.Номер+"</pmRfCode>
							|<ГУИД_ВСФ>"+Строка(ПоступлениеИсходное.УникальныйИдентификатор())+"</ГУИД_ВСФ>
							|<Ссылочный_код_ВСФ>"+ПоступлениеИсходное.Номер+"</Ссылочный_код_ВСФ>
							|<pmRfCode>"+ПоступлениеИсходное.Номер+"</pmRfCode>
							// -- ДИТ_Агафонов_task 41390 17.01.2023
							|<Логин_исполнителя>"+ТекЛогин+"</Логин_исполнителя>
//Евросиб Гудкова( 27.10.2020 Ticket№ 0210343
							|<НомерДатаЗаказа>"+НомерДатаЗаказа+"</НомерДатаЗаказа>
// Евросиб Гудкова) 							
							//Евросиб Каблов (							
							//|<Номер_ВСФ>"+Объект.Поступление.НомерВходящегоДокумента+"</Номер_ВСФ>
							|<isCopy>" + Формат(Объект.Поступление.Копия, "БЛ=0; БИ=1") + "</isCopy>
							|<Номер_ВСФ>"+НомерСФ+"</Номер_ВСФ>
							//Евросиб Каблов )
							|<Тип_ВСФ>ПТУ</Тип_ВСФ>
							//Евросиб Каблов (
							//|<Дата_ВСФ>"+Формат(Объект.Поступление.ДатаВходящегоДокумента, ФорматМаскиВремени)+"</Дата_ВСФ>
							|<Дата_ВСФ>"+Формат(ДатаСФ, ФорматМаскиВремени)+"</Дата_ВСФ>"
							//Евросиб Каблов )
							// ++ ДИТ_Агафонов_task 41390 17.01.2023 п6.6
							+?(Не ЭтоИсправлениеПервички,Символы.ПС,Символы.ПС+
							"<Номер_ВСФИсп>"+НомерСФИсп+"</Номер_ВСФИсп>
							|<Дата_ВСФИсп>"+Формат(ДатаСФИсп, ФорматМаскиВремени)+"</Дата_ВСФИсп>"+Символы.ПС)
							// -- ДИТ_Агафонов_task 41390 17.01.2023
							+"<Начало_оказания_услуги></Начало_оказания_услуги>
							|<Окончание_оказания_услуги></Окончание_оказания_услуги>
							|<Поставщик>"+Объект.Поступление.Контрагент.ИНН+"</Поставщик>
							|<Покупатель>"+Объект.Поступление.Организация.ИНН+"</Покупатель>
							//Евросиб Каблов 12.08.2021 ( Ticket#0238900
							|<sellerRfC>"+Объект.Поступление.ПоставщикВУ.Код+"</sellerRfC>
							//Евросиб Каблов 12.08.2021
							|<Статья_расхода></Статья_расхода>
							|<dRfCode>"+Объект.Поступление.ДоговорКонтрагента.Код+"</dRfCode>
							|<Договор>"+Объект.Поступление.ДоговорКонтрагента.Наименование+"</Договор>
							|<Сумма_ВСФ>"+Формат(СуммаОбрабатываемогоВРИТМ, ФорматЧисла)+"</Сумма_ВСФ>
							|<Сумма_НДС>"+Формат(НДСОбрабатываемогоВРИТМ, ФорматЧисла)+"</Сумма_НДС>
							|<Валюта_ВСФ>"+Объект.Поступление.ВалютаДокумента.Наименование+"</Валюта_ВСФ>
							|<Признак_ЭДО>"+ПолучитьФлагЭДО(Объект.Поступление.Контрагент)+"</Признак_ЭДО>
							|<pmActNo>"+Объект.Поступление.НомерВходящегоДокумента+"</pmActNo>
							|<pmActDated>"+Формат(Объект.Поступление.ДатаПоступленияДокумента, ФорматМаскиВремени)+"</pmActDated>
							//Евросиб - АСуслов 30.03.2023 10:22:51 #65868
							//(
							|<ActDocInput>"+Формат(Объект.Поступление.Дата, ФорматМаскиВремени)+"</ActDocInput>
							//)
							//Евросиб - АСуслов 30.03.2023 10:22:53 #65868
							|<Суммы_по_документу>"+Символы.ПС;
//Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПротоколОбменов.Объект КАК Объект,
		               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника
		               |ИЗ
		               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		               |ГДЕ
		               |	ПротоколОбменов.Объект В(&Номенклатура)
		               |	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.Узлыобмена.РИТМ)";
		Запрос.УстановитьПараметр("Номенклатура", ТЧРаспределенияПоУслугам.ВыгрузитьКолонку("Услуга"));
		ТабСоответсвийУслуг = Запрос.Выполнить().Выгрузить();
// Евросиб Гудкова) 
		
		Для каждого Стр из ТЧРаспределенияПоУслугам Цикл
//Евросиб Гудкова( 22.10.2020 Ticket№ 0210027
//было
			//РезультатXML = РезультатXML + "<rowSum>
									//|<pmRfCode>"+Стр.Услуга.Код+"</pmRfCode>
									//|<pmAppNo>"+Стр.Услуга.Код+"</pmAppNo>
									//|<pmSItem>"+Стр.Услуга.Наименование+"</pmSItem>
									//|<pmSItemName>"+Стр.Услуга.Наименование+"</pmSItemName>
									//|<pmSType>СУММА   </pmSType>
									//|<pmSValue>"+Формат(Стр.Сумма, ФорматЧисла)+"</pmSValue>
									//|<tcRfCode>"+Стр.Услуга.Код+"</tcRfCode>
									//|<pmServiceName>"+Стр.Услуга.НаименованиеПолное+"</pmServiceName>
			СоответствиеУслуги = ТабСоответсвийУслуг.Найти(Стр.Услуга, "Объект");
			КодУслуги = ?(СоответствиеУслуги = Неопределено, "", СоответствиеУслуги.УИДИсточника);
			  
			// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 26.12.2024
			// Было:
			//КодНДС = "";
			//Если Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
			//	КодНДС = "TC00000R";
			//ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 И Объект.Поступление.СуммаВключаетНДС Тогда
			//	КодНДС = "TC0020BT";
			//ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 И Не Объект.Поступление.СуммаВключаетНДС Тогда
			//	КодНДС = "TC0020KT";
			//Иначе //Если Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			//	КодНДС = "TC00000P";
			//КонецЕсли;
			//Стало:
			КодНДС = Справочники.СтавкиНДС.ПолучитьКодСтавкиРИТМ(Стр.СтавкаНДС, Объект.Поступление.СуммаВключаетНДС); 
			// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 26.12.2024
			РезультатXML = РезультатXML + "<rowSum>
									|<pmRfCode/>
									|<pmAppNo>"+(ТЧРаспределенияПоУслугам.Индекс(Стр)+1) +"</pmAppNo>
									|<pmSItem>"+КодУслуги+"</pmSItem>
									|<pmSItemName>"+Стр.Услуга.Наименование+"</pmSItemName>
									|<pmSType>СУММА   </pmSType>
									|<pmSValue>"+Формат(Стр.Сумма, ФорматЧисла)+"</pmSValue>
									|<tcRfCode>"+КодНДС+"</tcRfCode>
									|<pmServiceName>"+Стр.Содержание+"</pmServiceName>
// Евросиб Гудкова) 
								|</rowSum>"+Символы.ПС;
		КонецЦикла;
							РезультатXML = РезультатXML + "</Суммы_по_документу>
							|<Строки_приложения>" + Символы.ПС;
							
		Для каждого Стр из Объект.Услуги Цикл
			
			Если Стр.Неурег <> Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда Продолжить; КонецЕсли;
			
			//Евросиб Каблов 13.05.2021 ( Ticket#0222113 если документом-основанием является коррПТУ, то вместо ГУИДа ПТУ возвращать в РИТМ реквизит ГУИДстроки
			ИдентификаторСтроки = ИдентификаторыСтрокКоррПТУ.Получить(Стр.ИдентификаторСтрокиПоступления);
			Если Не ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
				ИдентификаторСтроки = Стр.ИдентификаторСтрокиПоступления;
			КонецЕсли; 
			//Евросиб Каблов 13.05.2021 )
			
			ПараметрыНакладной = ПолучитьПараметрыНакладной(Стр.Контейнер, Стр.ТранспортныйДокумент.НакладнаяЭТРАН);
//Евросиб Гудкова( 25.10.2020 Ticket№ 0210027
			НайденныеСтроки = ТЧРаспределенияПоУслугам.НайтиСтроки(Новый Структура("Услуга, СтавкаНДС, Содержание", Стр.Номенклатура, Стр.ПоступлениеСтавкаНДС, СокрЛП(Стр.Содержание)));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НомерПриложения = ТЧРаспределенияПоУслугам.Индекс(НайденныеСтроки[0])+1;
			Иначе
				НомерПриложения = Объект.Номер;
			КонецЕсли; 
// Евросиб Гудкова) 			
			РезультатXML = РезультатXML + "<row>
				//Евросиб Каблов 13.05.2021 ( Ticket#0222113 если документом-основанием является коррПТУ, то вместо ГУИДа ПТУ возвращать в РИТМ реквизит ГУИДстроки
				//|<pmtRFC>"+Стр.ИдентификаторСтрокиПоступления+"</pmtRFC>
				|<pmtRFC>" + ИдентификаторСтроки + "</pmtRFC>
				//Евросиб Каблов 13.05.2021 )
				|<Отправление_Прибытие></Отправление_Прибытие>
				|<Номер_дорожной_ведомости>"+Стр.ТранспортныйДокумент.НомерТранспортногоДокумента+"</Номер_дорожной_ведомости>
				|<Номер_вагона>"+Стр.Вагон.Наименование+"</Номер_вагона>
				|<Серия_контейнера>"+Стр.Контейнер.Префикс+"</Серия_контейнера>
				|<Номер_контейнера>"+Сред(Стр.Контейнер.Наименование, 5)+"</Номер_контейнера>
				|<Размерность_контейнера>"+Стр.Контейнер.ТипТЕ.Наименование+"</Размерность_контейнера>
				|<Номенклатура>"+Стр.Номенклатура.Наименование+"</Номенклатура>
				|<Наименование_услуги_в_СФ>"+Стр.Содержание+"</Наименование_услуги_в_СФ>
				|<Дата_отправки>"+Формат(Стр.ТранспортныйДокумент.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза, ФорматМаскиВремени)+"</Дата_отправки>
				|<Тип_пункта_отправления>Станция</Тип_пункта_отправления>
//Евросиб Гудкова( 09.12.2020 Ticket№ 
//				|<Пункт_отправления>"+Стр.ТранспортныйДокумент.НакладнаяЭТРАН.СтанцияОтправленияКод+"</Пункт_отправления>
				|<Пункт_отправления>"+?(ЗначениеЗаполнено(Стр.СтанцияОтправления), Стр.СтанцияОтправления.КодЖДСтанции, Стр.ТранспортныйДокумент.СтанцияОтправления.КодЖДСтанции)+"</Пункт_отправления>
// Евросиб Гудкова) 				
				|<Тип_пункта_назначения>Станция</Тип_пункта_назначения>
//Евросиб Гудкова( 09.12.2020 Ticket№ 
//				|<Пункт_назначения>"+Стр.ТранспортныйДокумент.НакладнаяЭТРАН.СтанцияНазначенияКод+"</Пункт_назначения>
				|<Пункт_назначения>"+?(ЗначениеЗаполнено(Стр.СтанцияНазначения), Стр.СтанцияНазначения.КодЖДСтанции, Стр.ТранспортныйДокумент.СтанцияНазначения.КодЖДСтанции)+"</Пункт_назначения>
// Евросиб Гудкова) 				
				|<Груз_ГНГ>"+ПараметрыНакладной.ГрузГНГ+"</Груз_ГНГ>
				|<Груз_по_прейскуранту_1001>"+ПараметрыНакладной.ГрузЕТСНГ+"</Груз_по_прейскуранту_1001>
				|<Фактический_вес_груза>"+Формат(ПараметрыНакладной.ВесГруза, ФорматЧисла)+"</Фактический_вес_груза>
				|<Единица_измерения>ктк</Единица_измерения>
				|<Количество_в_единицах_измерения>1.000000</Количество_в_единицах_измерения>
				|<Валюта>"+Объект.Поступление.ВалютаДокумента.Наименование+"</Валюта>
				|<Цена_за_единицу>"+Формат(Стр.ПоступлениеЦена, ФорматЧисла)+"</Цена_за_единицу>
//Евросиб Гудкова( 09.11.2020 Ticket№ 0213068 
//				|<Предъявлено>"+Формат(Стр.ПоступлениеСумма, ФорматЧисла)+"</Предъявлено>
				|<Предъявлено>"+Формат(?(РеквизитыПТУ.СуммаВключаетНДС, Стр.ПоступлениеСумма, Стр.ПоступлениеСумма - Стр.ПоступлениеСуммаНДС), ФорматЧисла)+"</Предъявлено>
// Евросиб Гудкова) 				
				|<НДС>"+Формат(Стр.ПоступлениеСуммаНДС, ФорматЧисла)+"</НДС>
				|<Корректировка/>
				|<Доступный_остаток></Доступный_остаток>
				|<Разность></Разность>
				|<Сумма_акцепта_расчетная>"+Формат(Стр.СделкаСумма, ФорматЧисла)+"</Сумма_акцепта_расчетная>
				|<Сумма_акцепта_подтверженная>"+Формат(Стр.ПодтвержденнаяСумма, ФорматЧисла)+"</Сумма_акцепта_подтверженная>
				|<Сумма_акцепта_фактическая>"+Формат(Стр.ПоступлениеЦена, ФорматЧисла)+"</Сумма_акцепта_фактическая>
				|<Неурегулированная_сумма_по_акцепту></Неурегулированная_сумма_по_акцепту>
				|<Неурегулированная_сумма_по_налогообложению/>
				|<Сумма_претензии>"+Формат(Стр.СуммаПретензии, ФорматЧисла)+"</Сумма_претензии>
				|<Сумма_возврата/>
				|<Коды_претензии>"+Стр.ПричинаНеакцепта.Код+"</Коды_претензии>
				|<Текст_претензии>"+Стр.ПримечаниеНеакцепта+"</Текст_претензии>
				|<Плата_из_других_программ/>
				|<Коэффициенты_к_базовой_ставке/>
				|<Код_исключительного_тарифа/>
				|<Подкод/>
				|<Тарифное_расстояние/>
				|<Расстояние_из_других_программ/>
				|<Схема_налогообложения>" + ПреобразоватьНДСВРИТМ(Стр.ПоступлениеСтавкаНДС, Объект.Поступление.СуммаВключаетНДС) + "</Схема_налогообложения>
				|<Схема_налогообложения_при_акцепте>" + ПреобразоватьНДСВРИТМ(Стр.ПоступлениеСтавкаНДС, Объект.Поступление.СуммаВключаетНДС) + "</Схема_налогообложения_при_акцепте>
				|<База_тарифа>ПР-1001 </База_тарифа>
				|<Тип_строки>ж.д. строка</Тип_строки>
				|<Дата_для_пересчета>"+Формат(Объект.Поступление.ДатаВходящегоДокумента, ФорматМаскиВремени)+"</Дата_для_пересчета>
				|<Допустимая_погрешность>0.00</Допустимая_погрешность>
				//|<Примечание>"+Объект.Поступление.Комментарий+"</Примечание>
				//Евросиб(ДИТ), Беляев СЮ, US 103762 / TA 104186, 12-03-2025, начало
				|<Примечание>"+СтроковыеФункцииКлиентСервер.НормализованнаяСтрокаXML(Объект.Поступление.Комментарий)+"</Примечание>
				//Евросиб(ДИТ), Беляев СЮ, US 103762 / TA 104186, 12-03-2025, конец
				|<ИД_накладной>"+Формат(Стр.ТранспортныйДокумент.НакладнаяЭТРАН.НакладнаяИД, "ЧГ=")+"</ИД_накладной>
				|<Номер_заказа></Номер_заказа>
				//|<Комментарий>"+Объект.Поступление.Комментарий+"</Комментарий>
				//Евросиб(ДИТ), Беляев СЮ, US 103762 / TA 104186, 12-03-2025, начало
				|<Комментарий>"+СтроковыеФункцииКлиентСервер.НормализованнаяСтрокаXML(Объект.Поступление.Комментарий)+"</Комментарий>
				//Евросиб(ДИТ), Беляев СЮ, US 103762 / TA 104186, 12-03-2025, конец
//Евросиб Гудкова( 20.10.2020 Ticket№ имелся ввиду заказ РИТМа, поле должно быть пустым
//				|<Ответственный_за_заказ>"+Объект.Автор+"</Ответственный_за_заказ>
				|<Ответственный_за_заказ/>
// Евросиб Гудкова) 				
				//Евросиб Каблов 13.05.2021 ( Ticket#0222113 если документом-основанием является коррПТУ, то вместо ГУИДа ПТУ возвращать в РИТМ реквизит ГУИДстроки
				//|<Cсылка_на_строку_приложения>"+Стр.ИдентификаторСтрокиПоступления+"</Cсылка_на_строку_приложения>
				|<Cсылка_на_строку_приложения>" + ИдентификаторСтроки + "</Cсылка_на_строку_приложения>
				//Евросиб Каблов 13.05.2021 )
				|<Ссылка_на_ВСФ>"+Объект.Поступление.Номер+"</Ссылка_на_ВСФ>
//Евросиб Гудкова( 25.10.2020 Ticket№ 0210027
//				|<Номер_приложения>"+Объект.Номер+"</Номер_приложения>
				|<Номер_приложения>"+НомерПриложения+"</Номер_приложения>
// Евросиб Гудкова) 				
			|</row>" + Символы.ПС;
			
		КонецЦикла;
		
		// Евросиб US 115240 TA 104735 Рыбьяков К.А. 20.08.2025 ((
		РезультатXML = СтрЗаменить(РезультатXML, "'", "&apos;");
		// Евросиб Рыбьяков К.А. 20.08.2025 ))
		
		РезультатXML = РезультатXML + "</Строки_приложения>
									|</ВСФ>
									|</Список_ВСФ>";
		Попытка
			ИмяФайла = "c:\work\dumps\accept_to_ritm_processing.xml";
			ЗТ = Новый ЗаписьТекста(ИмяФайла);
			ЗТ.Записать(РезультатXML);
			ЗТ.Закрыть();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		РЕЗ = ВебСервисы_сервер.ЗапроситьРИТМ("DCCreateVSF", РезультатXML);
		Сообщить("Ответ РИТМ: " + РЕЗ);
		
		
	Иначе
		// это ПТУ, полученный из РИТМ
		УИДПоступления = ТабРез[0].УИДИсточника; //Евросиб Гудкова( 20.10.2020
		РезультатXML = "<xml><pmTables>"+Символы.ПС;
		
		Для каждого Стр из Объект.Услуги Цикл
			
			Если Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда
				
				//Евросиб Каблов 13.05.2021 ( Ticket#0222113 если документом-основанием является коррПТУ, то вместо ГУИДа ПТУ возвращать в РИТМ реквизит ГУИДстроки
				//РезультатXML = РезультатXML + "<R pmtRFC="""+Стр.ИдентификаторСтрокиПоступления+"""/>"+Символы.ПС;
				ИдентификаторСтроки = ИдентификаторыСтрокКоррПТУ.Получить(Стр.ИдентификаторСтрокиПоступления);
				Если ИдентификаторСтроки = Неопределено Тогда
					ИдентификаторСтроки = Стр.ИдентификаторСтрокиПоступления;
				КонецЕсли;
				РезультатXML = РезультатXML + "<R pmtRFC=""" + ИдентификаторСтроки + """/>"+Символы.ПС;
				//Евросиб Каблов 13.05.2021 )
				
			КонецЕсли;
			
		КонецЦикла;
		
   		РезультатXML = РезультатXML + "</pmTables></xml>";
		
		РЕЗ = ВебСервисы_сервер.ЗапроситьРИТМ("DCDownSignPerfDC", РезультатXML);
		Сообщить("Ответ РИТМ: " + РЕЗ);
		
		
	КонецЕсли;
	//Евросиб Каблов 08.10.2020 (
	Если ТипЗнч(РЕЗ) = Тип("Строка") Тогда
		
		КоличествоВыгруженныхСтрок = 0;
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(РЕЗ);
		ДанныеОтвета = ФабрикаXDTO.ПрочитатьXML(Чтение);
//Евросиб Гудкова( 20.10.2020 не работает при первой выгрузке ПТУ из Датакора 
//было 
		//Если ДанныеОтвета.Свойства().Получить("rowcount") <> Неопределено Тогда
		//	КоличествоВыгруженныхСтрок = Число(ДанныеОтвета.rowcount);
		//КонецЕсли;
		//
		//Если КоличествоВыгруженныхСтрок > 0 Тогда
		Если ДанныеОтвета.Свойства().Получить("Error") = Неопределено Тогда
// Евросиб Гудкова) 		
			
			//Если ЗначениеЗаполнено(УИДПоступления) Тогда
			//	СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.РИТМ, Объект.Поступление);
			//	СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", УИДПоступления, Пользователи.АвторизованныйПользователь(), "");
			//	Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "ПТУ выгружено при выгрузке строк отработки в РИТМ");
			//КонецЕсли;
			
			//Евросиб Каблов 24.12.2020 ( Ticket#0215402 Когда очистили причину неурега Отработка в РИТМ, нужно снять признак выгрузки в ритм
			//СтрокиОтработкиВРитм = Объект.Услуги.НайтиСтроки(Новый Структура("Неурег", Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ));	
			//Для каждого Стр из СтрокиОтработкиВРитм Цикл			
			//	Стр.ВыгруженаВРИТМ = Истина;
			//КонецЦикла;
			Для Каждого Стр Из Объект.Услуги Цикл
				Если Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда
					Стр.ВыгруженаВРИТМ = Истина;
				Иначе
					Стр.ВыгруженаВРИТМ = Ложь;
				КонецЕсли;
			КонецЦикла;
			//Евросиб Каблов 24.12.2020 )
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		КонецЕсли;
	Иначе Возврат; //Гудкова. а есть варианты? почему может быть не строка?	
	КонецЕсли;
	//Евросиб Каблов 08.10.2020 )
//Евросиб Гудкова( 20.10.2020 Ticket№ 0211007 в протокол загрузок записать
	Если ДанныеОтвета.Свойства().Получить("row") <> Неопределено Тогда
		УИДПоступления = ДанныеОтвета.Row.pmRfCode;
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.РИТМ, Объект.Поступление);
		СтруктураДанных = Новый Структура("УИДИсточника, Ответственный", УИДПоступления, Пользователи.АвторизованныйПользователь());
		Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "ПТУ выгружено при выгрузке строк отработки в РИТМ");
		Сообщение.Сообщить();
	КонецЕсли;
// Евросиб Гудкова) 	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыНакладной(Контейнер, ЖДН)
	
	Результат = Новый Структура("ГрузЕТСНГ, ГрузГНГ, ВесГруза", "", "", 0);
	
	Если НЕ ЗначениеЗаполнено(ЖДН) ИЛИ НЕ ЗначениеЗаполнено(Контейнер) тогда Возврат Результат; КонецЕсли;
	
	Для каждого Стр из ЖДН.ГрузыЖД Цикл
		
		Результат.ГрузЕТСНГ = "" + Результат.ГрузЕТСНГ + ?(Результат.ГрузЕТСНГ = "", "", "; ") + Стр.КодЕТСНГ + " " + Стр.НаименованиеГруза;
		Результат.ГрузГНГ = "" + Результат.ГрузГНГ + ?(Результат.ГрузГНГ = "", "", "; ") + Стр.КодГНГ + " " + Стр.ГНГ.Наименование;
		Результат.ВесГруза = ЖДН.ГрузыЖД.Итог("РеальныйВесГруза");
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СобратьДанныеОтмеченныхСтрок(СписокВыбранныхСтрок)
	
	Результат = Новый Массив;
	
	ОбщиеДанныеПТУ = ПолучитьОбщиеДанныеПТУ(Объект.Поступление);
	
	Для каждого Стр из Объект.Услуги Цикл
		
		Если Стр.Выбрать Тогда
			
			Результат.Добавить(Новый Структура("НомерИсходнойСтроки, Поставщик, Договор, Услуга, Себестоимость, Количество, СтавкаНДС, НДСВключенВСтоимость, ТипВагонов, ТипКТК, УчДокумент, Валюта, КатегорияРасходов, НоменклатурнаяГруппа, Регламентный, ПунктОтправления, ПунктНазначения, Контейнер, Вагон, ТД",
			Стр.НомерСтроки, ОбщиеДанныеПТУ.Поставщик, ОбщиеДанныеПТУ.Договор, Стр.Номенклатура, Стр.ПоступлениеСумма, Стр.ПоступлениеКоличество, Стр.ПоступлениеСтавкаНДС, Объект.СуммаВключаетНДС, Стр.Вагон, Стр.Контейнер, Объект.Поступление, ОбщиеДанныеПТУ.Валюта, неопределено, Стр.НоменклатурнаяГруппа, Истина, Стр.СтанцияОтправления, Стр.СтанцияНазначения, Стр.Контейнер, Стр.Вагон, Стр.ТранспортныйДокумент));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбщиеДанныеПТУ(ПТУ)
	
	Результат = Новый Структура("Поставщик, Договор, Валюта", ПТУ.Контрагент, ПТУ.ДоговорКонтрагента, ПТУ.ВалютаДокумента);
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВнестиНакладныеВСделку(Сделка, СписокВыбранныхСтрок, ВключитьВДоходы, ВключитьВРасходы)
	
	Возврат РаботаСоСделкамиСервер.ВнестиДанныеАкцептаВСделку(СписокВыбранныхСтрок, Сделка, ВключитьВДоходы, ВключитьВРасходы);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаОткрытияСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = КодВозвратаДиалога.Да Тогда ПоказатьЗначение(, П2); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	РезСделка = ВнестиНакладныеВСделку(П1, П2.СписокВыбранныхСтрок, П2.ВключитьВДоходы, П2.ВключитьВРасходы);
	
	Для каждого РезРаз Из РезСделка.РезультатРазнесения Цикл
		
		НайдСтрока = Объект.Услуги.НайтиСтроки(Новый Структура("НомерСтроки", РезРаз.ИсхНомерСтроки));
		Если НайдСтрока.Количество() > 0 Тогда
			
			НайдСтрока[0].ПолностьюРазнесено = Истина;
			НайдСтрока[0].Сделка = РезРаз.Сделка;
			НайдСтрока[0].ИдентификаторСтрокиРасходовВСделке = РезРаз.ГУИДРасходов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьДанные_Сервер(Истина);
	ОбновитьПодсветку();
		
	ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаОткрытияСделки", ЭтаФорма, РезСделка.Сделка);
	ПоказатьВопрос(ОпОп, "Данные внесены в сделку. Открыть ее?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать_ВыбратьВсе(Команда)
	
	Для каждого стр из Объект.Услуги Цикл
		ИдентификаторСтроки = стр.ПолучитьИдентификатор();
		Если Элементы.Услуги.ПроверитьСтроку(ИдентификаторСтроки) = Истина Тогда
			стр.Выбрать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать_ОтменитьВыбор(Команда)
	
	//Евросиб Каблов 08.10.2020 (
	//Для каждого стр из Объект.Услуги Цикл стр.Выбрать = Ложь; КонецЦикла;
	Для каждого стр из Объект.Услуги Цикл
		ИдентификаторСтроки = стр.ПолучитьИдентификатор();
		Если Элементы.Услуги.ПроверитьСтроку(ИдентификаторСтроки) = Истина Тогда
			стр.Выбрать = Ложь;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 08.10.2020 )
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0229256
	ТипОтчетКомитенту = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
	ПустаяСсылкаОтчетКомитенту = ПредопределенноеЗначение("Документ.ОтчетКомитентуОПродажах.ПустаяСсылка");
	//Евросиб Каблов 28.04.2021 )
	
	Для Каждого ИдентификаторСтроки Из Элемент.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаТЧ.ВыгруженаВРИТМ Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строку, выгруженную в РИТМ удалять запрещено!");
			Прервать;
		//Евросиб Каблов 28.04.2021 ( Ticket#0229256
		ИначеЕсли ТипЗнч(СтрокаТЧ.УчДокумент) = ТипОтчетКомитенту И СтрокаТЧ.УчДокумент <> ПустаяСсылкаОтчетКомитенту Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строку, с видом расходов Возмещаемые и документом Отчет комитенту удалять запрещено!");
			Прервать;
		//Евросиб Каблов 28.04.2021 )
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Гудкова( 29.10.2020 Ticket№ 0212208
&НаСервере
Процедура ВернутьВРИТМПретензииНаСервере(НеЗаписан)
	
	Если НеЗаписан Тогда
		АкцептПровелся = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Если Не АкцептПровелся Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести акцепт. Выгрузка строк в РИТМ не выполнена.");
			Возврат;
		КонецЕсли;
	КонецЕсли; 

	Результат = ПретензииИНеакцептыСервер.ПредоставитьДанныеНеакцептовПоПериодуИлиНомеруДокумента(Объект.Номер, неопределено, неопределено, Истина, Объект.Ссылка);
	
	РезультатXML = "<xml>" + Символы.ПС + "<claims>" + Символы.ПС;
	
	Для каждого Стр из Результат Цикл
		
		РезультатXML = РезультатXML + "<claim pmRfCode=""" + Стр.pmRfCode + """ pmtRFC=""" + 
		Стр.pmtRFC + """ pmtObjDate=""" + Стр.pmtObjDate + """ pmtObjSum=""" + 
		Формат(Стр.pmtObjSum, "ЧН=; ЧГ=; ЧРД=.") + """ vSymCode=""" + Стр.vSymCode + """ pmtErrCodes=""" + 
		Стр.pmtErrCodes + """ pmtErrText=""" + Стр.pmtErrText + """ pmtObjFulfilment=""" + 
		Стр.pmtObjFulfilment + """ pmtNotes=""" + Стр.pmtNotes + """ pmtIsActual=""" + ?(Строка(Стр.pmtObjFulfilment) = "На рассмотрении", 1, 0) + """ />";
		
	КонецЦикла;
	
	РезультатXML = РезультатXML + "</claims>" + Символы.ПС + "</xml>";
		
	РЕЗ = ВебСервисы_сервер.ЗапроситьРИТМ("DCLoadClaims", РезультатXML);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРИТМПретензии(Команда)

	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ПодтверждениеПретензии", ЭтаФорма, НеЗаписан);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой претензии акцепт необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ПодтверждениеПретензии(КодВозвратаДиалога.Да, НеЗаписан);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПретензии(Ответ = неопределено, НеЗаписан = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ВернутьВРИТМПретензииНаСервере(НеЗаписан);
	
КонецПроцедуры
// Евросиб Гудкова) 	

//Евросиб Каблов 04.11.2020 (
&НаКлиенте
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораСтрокиПоступления", ЭтаФорма);
	ОткрытьФорму("Документ.Акцепт.Форма.ФормаВыбораСтрокиУслугиПоступления", Новый Структура("Поступление", Объект.Поступление), ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтрокиПоступления(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		Результат.Свойство("СтавкаНДС", ТекДанные.ПоступлениеСтавкаНДС);
		Результат.Свойство("ГУИДПТУ", ТекДанные.ИдентификаторСтрокиПоступления);
		Результат.Свойство("Номенклатура", ТекДанные.Номенклатура);
		Результат.Свойство("Содержание", ТекДанные.Содержание);
		
		//Евросиб Каблов 16.12.2024 ( #94192
		ОбработкаВыбораСтрокиПоступленияСервер(Элементы.Услуги.ТекущаяСтрока);
		//Евросиб Каблов 16.12.2024 )
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораСтрокиПоступленияСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ЛокацииПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	ДоступныеТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ТекДанные.Номенклатура);
	Если ЗначениеЗаполнено(ДоступныеТипыЛокаций) Тогда
		
		Если ЗначениеЗаполнено(ТекДанные.СтанцияОтправления) Тогда
			Если ДоступныеТипыЛокаций.Найти(ТекДанные.СтанцияОтправления.Тип) = Неопределено Тогда
				ТекДанные.СтанцияОтправления = ЛокацииПустаяСсылка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.СтанцияНазначения) Тогда
			Если ДоступныеТипыЛокаций.Найти(ТекДанные.СтанцияНазначения.Тип) = Неопределено Тогда
				ТекДанные.СтанцияНазначения = ЛокацииПустаяСсылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура н_ДобавитьВозмещаемыеДоходыИРасходы(Команда)
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
	Если НеобходимоОтвязатьСтрокиОтСделки(МассивВыделенныхСтрок) Тогда
		Возврат;
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
	//ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.ВозмещаемыеДоходыИРасходы")));
	//ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("ВозмДоходыРасходы, СписокСтрок, ИнтерактивноеОткрытия", Истина, МассивВыделенныхСтрок, Истина),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	Если СписокГУИДкАвторазнесению.Количество() > 0 Тогда
		СделкаКАвторазнесению = Неопределено;
		Для Каждого ГУИДкАвторазнесению Из СписокГУИДкАвторазнесению Цикл
			НайденнаеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", ГУИДкАвторазнесению.Значение));
			СделкаКАвторазнесению = НайденнаеСтроки[0].Сделка;
			Прервать;
		КонецЦикла;
		ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.ВозмещаемыеДоходыИРасходы")));
		ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", 
			Новый Структура("ВозмДоходыРасходы, СписокСтрок, ИнтерактивноеОткрытия, Сделка, СвязатьПоВидуТранспортногоСообщения", Истина, МассивВыделенныхСтрок, Истина, СделкаКАвторазнесению, ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСообщений.ЖД"))
			,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.ВозмещаемыеДоходыИРасходы")));
		ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("ВозмДоходыРасходы, СписокСтрок, ИнтерактивноеОткрытия", Истина, МассивВыделенныхСтрок, Истина),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция НеобходимоОтвязатьСтрокиОтСделки(МассивВыделенныхСтрок) //Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
	
	Отказ = Ложь;
	
	Для Каждого мСтрока Из МассивВыделенныхСтрок Цикл
		//Если ЗначениеЗаполнено(мСтрока.Сделка) И ЗначениеЗаполнено(мСтрока.ИдентификаторСтрокиРасходовВСделке) Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		Если ЗначениеЗаполнено(мСтрока.Сделка) И ЗначениеЗаполнено(мСтрока.ИдентификаторСтрокиРасходовВСделке) И НЕ ЗначениеЗаполнено(мСтрока.ИдентификаторСтрокиДоходовВСделкеКорректируемый) Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
			ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется отвязать строки от сделки!",,,,Отказ);
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Функция СобратьМассивВыделенныхСтрок()
	
	Результат = Новый Массив;
	
	РеквизитыПТУ = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(Объект.Поступление, "ВалютаДокумента, Контрагент, ДоговорКонтрагента");
	
	Для каждого Стр из Объект.Услуги.НайтиСтроки(Новый Структура("Выбрать", Истина)) Цикл
		
		НайдСтрока = Стр;
		
		Результат.Добавить(Новый Структура(
		//Евросиб Каблов 13.09.2022 ( 57446
		//"СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ИсходныйНомерСтроки", 
		// ДИТ US 72035 ТА 72037 Сержантова А.С. Начало: 14.07.2023
		// Было:
		//"СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ИдентификаторСтрокиАкцепта", 
		//Стало:
		//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
		//"НомерСтроки,СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ГУИД", 
		//"НомерСтроки,СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ГУИД, ИдентификаторСтрокиРасходовВСделке, Сделка",
		//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
		// ДИТ US 72035 ТА 72037 Сержантова А.С. Конец: 14.07.2023
		//Евросиб Каблов 13.09.2022 )
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		"НомерСтроки,СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ГУИД, ИдентификаторСтрокиРасходовВСделке, Сделка, ИдентификаторСтрокиДоходовВСделкеКорректируемый",
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		
		// ДИТ US 72035 ТА 72037 Сержантова А.С. Начало: 14.07.2023
		НайдСтрока.НомерСтроки,
		// ДИТ US 72035 ТА 72037 Сержантова А.С. Конец: 14.07.2023
		НайдСтрока.Содержание, 
		Объект.Поступление,
		НайдСтрока.Номенклатура, 
		НайдСтрока.ПоступлениеКоличество, 
		НайдСтрока.Контейнер, 
		НайдСтрока.Вагон, 
		НайдСтрока.ТранспортныйДокумент,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Объект.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Объект.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеЦена,
		НайдСтрока.ПоступлениеСумма,
		НайдСтрока.ПоступлениеЦена,
		НайдСтрока.ПоступлениеСумма,
		НайдСтрока.ПоступлениеСуммаНДС,
		НайдСтрока.ПоступлениеСумма,
		РеквизитыПТУ.ВалютаДокумента,
		РеквизитыПТУ.Контрагент,
		РеквизитыПТУ.ДоговорКонтрагента,
		НайдСтрока.Номенклатура,
		НайдСтрока.СтанцияОтправления,
		НайдСтрока.СтанцияНазначения,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Объект.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеКоличество, 
		РеквизитыПТУ.ВалютаДокумента,
		//Евросиб Каблов 13.09.2022 ( 57446
		//НайдСтрока.ИсходныйНомерСтроки,
		НайдСтрока.ГУИД,
		//Евросиб Каблов 13.09.2022 )
		//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
		НайдСтрока.ИдентификаторСтрокиРасходовВСделке,
		НайдСтрока.Сделка
		//Евросиб Шевченко А.В. US 102803 TA 102806 06.06.2025
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		,НайдСтрока.ИдентификаторСтрокиДоходовВСделкеКорректируемый
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаДобавленияВСделку(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	//Евросиб Каблов 06.09.2021 ( Ticket#0237622
	//Для каждого Стр из П1.ТаблицаДанных Цикл
	//	
	//	НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ИсходныйНомерСтроки", СТр.ИсходныйНомерСтроки));
	//	Для каждого Стр2 из НайдСтроки Цикл
	//		
	//		Стр2.ИдентификаторСтрокиРасходовВСделке = Стр.ГУИДРасходов;
	//		Стр2.Сделка = П1.Сделка;
	//		Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(П1.Сделка);
	//		//Евросиб Каблов 20.01.2021 ( Ticket#0213606
	//		Если ЗначениеЗаполнено(П1.Сделка) Тогда
	//			Стр2.ПривязалПользователь = ПользователиКлиент.ТекущийПользователь();
	//		Иначе
	//			Стр2.ПривязалПользователь = Неопределено;
	//		КонецЕсли;
	//		//Евросиб Каблов 20.01.2021 )
	//		
	//	КонецЦикла;
	//	
	//	
	//КонецЦикла;
	//
	//ДополнитьДанные(неопределено);
	//
	//Для Каждого ТекСтрокаУслуги Из Объект.Услуги Цикл
	//	Если ЗначениеЗаполнено(ТекСтрокаУслуги.Сделка) Тогда
	//		ТекСтрокаУслуги.Сумма = ТекСтрокаУслуги.ПоступлениеСумма;
	//		ТекСтрокаУслуги.СуммаНДС = ТекСтрокаУслуги.ПоступлениеСуммаНДС;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ОбновитьПодсветку();
	//
	//
	//Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	//Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	//Записать();
	ЗаписатьДанныеВСделкуИАкцептСервер(П1.Сделка, П1.АдресТаблицы, П1.ДанныеИзСП, П2.ВариантРазнесения); //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
	
	// Евросиб US83437 TA83438 Рыбьяков К.А. 12.06.2024 ((
	//ЗаписьВыполнена = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Если ЗаписьВыполнена Тогда
	//	ПоказатьОповещениеПользователя("Акцепт записан", , ,);
	//КонецЕсли;
	// Евросиб Рыбьяков К.А. 12.06.2024 ))
	
	ОбновитьПодсветку();
	//Евросиб Каблов 06.09.2021 )
	
КонецПроцедуры

//Евросиб Каблов 06.09.2021 Ticket#0237622
&НаСервере
Процедура ЗаписатьДанныеВСделкуИАкцептСервер(Сделка, АдресТаблицы, ДанныеИзСП, ВариантРазнесения = Неопределено)
	
	// Евросиб US 83437 Рыбьяков К.А. 05.07.2024 ((
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицы);
	ТаблицаДанных.Колонки.Добавить("ДанныеИзСП");
	ТаблицаДанных.Колонки.Добавить("Сделка");
	
	Если ДанныеДляДобавленияВАкцепт <> Неопределено Тогда
		ТаблицаРанееЗагруженныхСтрок = ДанныеДляДобавленияВАкцепт.Получить();
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.07.2024 ))
	
	Для Каждого Стр из ТаблицаДанных Цикл
		// Евросиб US 83437 Рыбьяков К.А. 15.07.2024 ((
		Стр.ДанныеИзСП = ДанныеИзСП;
		Стр.Сделка = Сделка;
		Если ТаблицаРанееЗагруженныхСтрок <> Неопределено Тогда
			НайденныеСтроки = ТаблицаРанееЗагруженныхСтрок.НайтиСтроки(Новый Структура("Гуид", Стр.Гуид));
			Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
				ТаблицаРанееЗагруженныхСтрок.Удалить(СтрокаТаблицы);
			КонецЦикла;
			ДопСтрока = ТаблицаРанееЗагруженныхСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(ДопСтрока, Стр);
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 15.07.2024 ))
		
		//Евросиб Каблов 13.09.2022 ( 57446
		//НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ИсходныйНомерСтроки", СТр.ИсходныйНомерСтроки));
		НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
		//Евросиб Каблов 13.09.2022 )
		Для Каждого Стр2 Из НайдСтроки Цикл
			
			Стр2.ИдентификаторСтрокиРасходовВСделке = Стр.ГУИДРасходов;
			Стр2.Сделка = Сделка;
			//Евросиб - АСуслов 22.08.2022 12:08:02 #55129
			//(
			//Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Сделка);
			Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Сделка) 
										И НЕ Стр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			//)
			//Евросиб - АСуслов 22.08.2022 12:08:02 #55129
			Если ЗначениеЗаполнено(Сделка) Тогда
				Стр2.ПривязалПользователь = ПользователиКлиентСервер.ТекущийПользователь();
			Иначе
				Стр2.ПривязалПользователь = Неопределено;
			КонецЕсли; 
			
			Стр2.ВариантРазнесения = ВариантРазнесения;			
			Стр2.Сумма = Стр2.ПоступлениеСумма;
			Стр2.СуммаНДС = Стр2.ПоступлениеСуммаНДС;  
			// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 14.07.2023
			Стр2.РасходыЗаСчетЧП = Стр.РасходыЗаСчетЧП;
			// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 14.07.2023
			
			// Евросиб US 83437 Рыбьяков К.А. 15.06.2024 ((
			Стр2.НоменклатурнаяГруппа = Стр.НоменклатурнаяГруппа;
			Стр2.НоменклатураСделки = Стр.Услуга;
			Стр2.Выбрать = Ложь;
			// Евросиб Рыбьяков К.А. 05.07.2024 ))
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Евросиб US 83437 Рыбьяков К.А. 15.07.2024 ((
	Если ТаблицаРанееЗагруженныхСтрок <> Неопределено Тогда
		ДанныеДляДобавленияВАкцепт = Новый ХранилищеЗначения(ТаблицаРанееЗагруженныхСтрок);
	Иначе
		ДанныеДляДобавленияВАкцепт = Новый ХранилищеЗначения(ТаблицаДанных);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.07.2024 ))
	
	ДополнитьДанные_Сервер(Истина);
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");

	#Область СтарыйКод 
	//НачатьТранзакцию();  
	//Евросиб - АСуслов 08.07.2022 11:30:11 #
	//(мы тут с Яной решили поправить косячок
	//сели на двоих утром 08.07 и поправили
	//между прочим это пятница была
	//Попытка
	//)
	//Евросиб - АСуслов 08.07.2022 11:30:31 #
	//Заполнение и запись Сделки
	//СделкаОбъект = Сделка.ПолучитьОбъект();
	//СделкаОбъект.Заблокировать();

	//РаботаСоСделкамиСервер.ДобавитьСтрокиРасходовВСделку(СделкаОбъект, ТаблицаДанных, ДанныеИзСП);
	//СделкаОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
	// ДИТ Поморцва Т.П. Задача 243097 16.09.21. начало
	//СделкаОбъект.Записать();
	//УстановитьПривилегированныйРежим(Истина);
	//Евросиб - АСуслов 18.08.2022 14:54:34 #55129
	//(
	//СделкаОбъект.Записать();
	//СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//РаботаСоСделкамиСервер.СформироватьДвиженияРазнесенияЗатратПТУ(СделкаОбъект);
	//СделкаОбъект.Движения.РазнесениеЗатратПТУ.Записать();
	//)
	//Евросиб - АСуслов 18.08.2022 14:54:36 #55129
	//УстановитьПривилегированныйРежим(Ложь);
	// ДИТ Поморцва Т.П. Задача 243097 16.09.21. конец
	
	//Заполнение и запись ацепта
	//МассивСтрокАкцепта = Новый Массив;
	//Для каждого Стр из ТаблицаДанных Цикл
	//	//Евросиб Каблов 13.09.2022 ( 57446
	//	//НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ИсходныйНомерСтроки", СТр.ИсходныйНомерСтроки));
	//	НайдСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", СТр.ИдентификаторСтрокиАкцепта));
	//	//Евросиб Каблов 13.09.2022 )
	//	Для каждого Стр2 из НайдСтроки Цикл
	//		
	//		Стр2.ИдентификаторСтрокиРасходовВСделке = Стр.ГУИДРасходов;
	//		Стр2.Сделка = Сделка;
	//		//Евросиб - АСуслов 22.08.2022 12:08:02 #55129
	//		//(
	//		//Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Сделка);
	//		Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Сделка) 
	//									И НЕ Стр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
	//		//)
	//		//Евросиб - АСуслов 22.08.2022 12:08:02 #55129
	//		Если ЗначениеЗаполнено(Сделка) Тогда
	//			Стр2.ПривязалПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//		Иначе
	//			Стр2.ПривязалПользователь = Неопределено;
	//		КонецЕсли; 
	//		
	//		Стр2.ВариантРазнесения = ВариантРазнесения;
	//		
	//		Стр2.Сумма = Стр2.ПоступлениеСумма;
	//		Стр2.СуммаНДС = Стр2.ПоступлениеСуммаНДС;  
	//		// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 14.07.2023
	//		Стр2.РасходыЗаСчетЧП = Стр.РасходыЗаСчетЧП;
	//		// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 14.07.2023
	//		
	//	КонецЦикла;		
	//	
	//КонецЦикла;
	//
	//ДополнитьДанные_Сервер(Истина);
	//
	//Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	//Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	//ЗаписьВыполнена = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	//Евросиб - АСуслов 08.07.2022 11:30:11 #
	//(мы тут с Яной решили поправить косячок
	//сели на двоих утром 08.07 и поправили
	//между прочим это пятница была
	//Если ЗаписьВыполнена Тогда
	//)
	//Евросиб - АСуслов 08.07.2022 11:30:31 #
		//ЗафиксироватьТранзакцию(); 
	//Сообщить("Данные сделки " + Сделка + " и акцепта обновлены!");
	//Иначе                  
	//Исключение
	//	ОтменитьТранзакцию(); 
	//	Прочитать();
	//	ВызватьИсключение СтрШаблон("Не удалось добавить данные в сделку!
	//	|%1", ОписаниеОшибки());
	//КонецЕсли;
	//КонецПопытки;
	//Евросиб - АСуслов 22.12.2022 16:13:06 #63313
	//(
	//СделкаОбъект.Разблокировать();
	//)
	//Евросиб - АСуслов 22.12.2022 16:13:14 #63313
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура н_ДобавитьДоходыИРасходыДопУслугой(Команда)
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.ДоходыИРасходыДополнительнойУслугой")));
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("ДоходыРасходыОтдельнойУслугой, СписокСтрок", Истина, МассивВыделенныхСтрок),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура н_ДобавитьРасходыПоПеревозкеКлиента(Команда)
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;   
	// ДИТ US 72035 ТА 72037 Сержантова А.С. Начало: 14.07.2023 
	СтрокиБезВагонаКонтейнера = Новый Массив;
	Для каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		Если не ЗначениеЗаполнено(ВыделеннаяСтрока.Вагон) 
			и не ЗначениеЗаполнено(ВыделеннаяСтрока.КТК) Тогда
		    СтрокиБезВагонаКонтейнера.Добавить(ВыделеннаяСтрока.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Если СтрокиБезВагонаКонтейнера.Количество() Тогда
		ТекстСообщения = СтрШаблон("В %1 №%2 не указан контейнер или вагон. Введите детализацию и повторите попытку.", 
		                ?(СтрокиБезВагонаКонтейнера.Количество()=1, "строке", "строках"),
						СтрСоединить(СтрокиБезВагонаКонтейнера, ", "));
		ПоказатьПредупреждение(,ТекстСообщения, , "Не заполнены вагоны/контейнеры");
		Возврат;
	КонецЕсли;
	// ДИТ US 72035 ТА 72037 Сержантова А.С. Конец: 14.07.2023
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.РасходыПоПеревозкеКлиента")));

	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("РасходыПоПеревозкеКлиента, СписокСтрок", Истина, МассивВыделенныхСтрок),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	Если Объект.Услуги.Количество() > 500 Тогда
		ВремяИсключенияВМинутах = 60;
		ВключитьБлокировкуОчередиОтложенногоИзмененияНаСервере( Объект.Ссылка, ВремяИсключенияВМинутах );
		ОбновлениеТаймераИсключенияОчередиОтложенногоИзменения();
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
	
КонецПроцедуры

&НаКлиенте
Процедура н_ДобавитьСобственныеЗатраты(Команда)
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.СобственныеЗатраты")));
	ПараметрыФормы = Новый Структура("РасходыСобственныеЗатраты, СписокСтрок, ПериодУУ", Истина, МассивВыделенныхСтрок, ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Поступление,"ДатаВходящегоДокумента"));
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку",ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДополнительныеРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТДпоПТУ()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ИдентификаторСтрокиПоступления,
	|	ПоступлениеТоваровУслугУслуги.СписокТД КАК СписокТД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &Поступление";
	//Евросиб Каблов 09.02.2023 ( Ticket#0294452
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеТоваровУслуг.Услуги", "КорректировкаПоступления.Услуги");
	КонецЕсли;
	//Евросиб Каблов 09.02.2023 )
	Запрос.УстановитьПараметр("Поступление", Объект.Поступление);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьСписокРеквизитовСделки()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
////Евросиб Гудкова( 05.08.2022 Ticket№ 0281401	
//	|	СделкаДоходы.УчДокумент КАК УчДокумент,
//	|	СделкаДоходы.УчДокумент.ПериодВО КАК ПериодВО,
	|	СделкаДоходы.ПериодВО КАК ПериодВО,
// Евросиб Гудкова)
	|	СделкаРасходы.Ссылка.ЖДОтправка КАК ДатаЖДОтправки,
	|	СделкаРасходы.Ссылка.СтанцияОтправления КАК СтанцияОтправленияСделки,
	|	СделкаРасходы.Ссылка.СтанцияНазначения КАК СтанцияНазначенияСделки,
//Евросиб Гудкова( 19.07.2022 Ticket№ 
	|	СделкаРасходы.Контейнер КАК СделкаКТК,
	|	СделкаРасходы.Вагон КАК СделкаВагоны,
	|	СделкаРасходы.ТранспортныйДокумент КАК СделкаТД,
	|	СделкаРасходы.ГУИД Есть NULL КАК БитаяСсылка,
// Евросиб Гудкова)
	//Евросиб Каблов 09.07.2021 ( Ticket#0232246
	|	СделкаДоходы.ПСЦ КАК Протокол
	//Евросиб Каблов 09.07.2021 )
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|				ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	//Евросиб Каблов 09.07.2021 ( Ticket#0232246
	//|					И СделкаСвязьДоходовИРасходов.Услуга = СделкаДоходы.Услуга
	//Евросиб Каблов 09.07.2021 )
	|			ПО СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
// Евросиб Гудкова 31.01.2021 	|				И СделкаРасходы.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	|		ПО  АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	|   		И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
//Евросиб Гудкова( 19.07.2022 Ticket№ 
	|	И АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
// Евросиб Гудкова)
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ОтвязатьСтроки(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ПодтверждениеОтвязки", ЭтаФорма);
	
	ТекстВопроса = "Выбранные строки будут отвязаны от сделок и их нужно разнести повторно.
				|Акцепт будет автоматически записан. Продолжить?"; 
	ПоказатьВопрос(ОпОп, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПодтверждениеОтвязки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	ОтвязатьВыбранныеСтрокиСервер();
	
	ОбновитьПодсветку();
	
КонецПроцедуры

//Евросиб Каблов 02.07.2021 Ticket#0234010
&НаСервере
Процедура ОтвязатьВыбранныеСтрокиСервер()
	
	//Евросиб Каблов 02.07.2021 ( Ticket#0234010
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления")
		// ++ ДИТ_Агафонов_task 41390 07.02.2023
		И Не ОпределениеЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах()
		// -- ДИТ_Агафонов_task 41390 07.02.2023
		Тогда
		
		ЭтоКорректировочныйАкцепт = Истина;
		
		ТаблицаОтвязываемыхСтрок = Объект.Услуги.Выгрузить(Новый Структура("Выбрать", Истина), "ИдентификаторСтрокиПоступления, Сделка, ИдентификаторСтрокиРасходовВСделке, ГУИД");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ТаблицаАкцепта.Сделка КАК Сделка,
		|	ТаблицаАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ТаблицаАкцепта.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТСтрокиАкцепта
		|ИЗ
		|	&ТаблицаАкцепта КАК ТаблицаАкцепта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтрокиАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТСтрокиАкцепта.Сделка КАК Сделка,
		|	ВТСтрокиАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ВТСтрокиАкцепта.ГУИД КАК ГУИД,
		|	КорректировкаПоступленияУслуги.Ссылка КАК КорректировкаПоступления,
		|	ПоступлениеТоваровУслугУслуги.Ссылка КАК Поступление
		|ИЗ
		|	ВТСтрокиАкцепта КАК ВТСтрокиАкцепта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|			ПО КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления = ПоступлениеТоваровУслугУслуги.Ссылка
		|				И КорректировкаПоступленияУслуги.ГУИДПТУ = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|		ПО ВТСтрокиАкцепта.ИдентификаторСтрокиПоступления = КорректировкаПоступленияУслуги.ГУИДПТУ
		|ГДЕ
		|	КорректировкаПоступленияУслуги.Ссылка = &КорректировкаПоступления";
		Запрос.УстановитьПараметр("ТаблицаАкцепта", ТаблицаОтвязываемыхСтрок);
		Запрос.УстановитьПараметр("КорректировкаПоступления", Объект.Поступление);
		СтрокиКорректировкиПоступления = Запрос.Выполнить().Выгрузить();
	Иначе
		ЭтоКорректировочныйАкцепт = Ложь;
	КонецЕсли;
	//Евросиб Каблов 02.07.2021 )
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0229256
	ТипОтчетКомитенту = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
	ПустаяСсылкаОтчетКомитенту = ПредопределенноеЗначение("Документ.ОтчетКомитентуОПродажах.ПустаяСсылка");
	//Евросиб Каблов 28.04.2021 )
	
	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	НомераСтрокСРеализацией = Новый Массив;
	
	ВыбранныеСтрокиАкцепта = Объект.Услуги.НайтиСтроки(Новый Структура("Выбрать", Истина));
	ТаблицаИдентификаторов = Объект.Услуги.Выгрузить(ВыбранныеСтрокиАкцепта, "НомерСтроки, Сделка, ИдентификаторСтрокиРасходовВСделке");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ТаблицаИдентификаторов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИдентификаторов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаИдентификаторов.Сделка КАК Сделка,
	|	ТаблицаИдентификаторов.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
	|ПОМЕСТИТЬ ТаблицаИдентификаторов
	|ИЗ
	|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИдентификаторов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаИдентификаторов.Сделка КАК Сделка,
	|	ТаблицаИдентификаторов.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ) КАК Проведен
	|ИЗ
	|	ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО ТаблицаИдентификаторов.Сделка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И ТаблицаИдентификаторов.ИдентификаторСтрокиРасходовВСделке = СделкаСвязьДоходовИРасходов.Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО ТаблицаИдентификаторов.Сделка = СделкаРасходы.Ссылка
	|			И ТаблицаИдентификаторов.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|ГДЕ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|	И СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)";
	СвязанныеСтрокиДоходовСделки = Запрос.Выполнить().Выгрузить();
	//Евросиб Каблов 17.01.2022 )
	
	МассивСтрокСделкиДляИзменения = Новый Массив;
	//Евросиб Каблов 13.09.2021 (
	//НачатьТранзакцию();
	//Евросиб Каблов 13.09.2021 )
	
	//Субботин 75883 10.10.2023 начало 
	ВыбранныеСтроки = Объект.Услуги.Выгрузить(Новый Структура("Выбрать",Истина));  
	ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(Объект.Услуги, ВыбранныеСтроки);
	//Субботин 75883 10.10.2023 Конец
	
	Для каждого Стр из Объект.Услуги Цикл
		Если Стр.Выбрать = ложь Тогда Продолжить; КонецЕсли;
		
		//Евросиб - АСуслов 30.12.2022 13:47:14 #61016
		//(
		Если Не ЗначениеЗаполнено(Стр.Сделка) Тогда
			ТекстСообщения = СтрШаблон("Строка %1 пропущена, т.к. как не привязана к сделке", Стр.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 30.12.2022 13:47:24 #61016
		//Евросиб Каблов 28.04.2021 ( Ticket#0229256
		Если ТипЗнч(Стр.УчДокумент) = ТипОтчетКомитенту И Стр.УчДокумент <> ПустаяСсылкаОтчетКомитенту Тогда
			//ТекстСообщения = СтрШаблон("Строка %1 не была отвязана, т.к. в ней вид расходов Возмещаемые и документ Отчет комитенту!", Стр.НомерСтроки);
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//Продолжить;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
			ПроверкаРазрешенияКорректировки = КорректировкиРТУСервер.ПолучитьСтатусРазрешенияКорректировки(Стр.УчДокумент);
			РазрешенаКорректировкаИлиИсправление = ПроверкаРазрешенияКорректировки.Корректировка ИЛИ ПроверкаРазрешенияКорректировки.Исправление;
			Если НЕ РазрешенаКорректировкаИлиИсправление Тогда
				ТекстСообщения = СтрШаблон("Строка %1 не была отвязана, т.к. в ней вид расходов Возмещаемые и документ Отчет комитенту!", Стр.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
		КонецЕсли;
		//Евросиб Каблов 28.04.2021 )
		
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		СтрокиДоходов = СвязанныеСтрокиДоходовСделки.НайтиСтроки(Новый Структура("НомерСтроки", Стр.НомерСтроки));
		Для Каждого СтрокаДоходов Из СтрокиДоходов Цикл
			Если СтрокаДоходов.Проведен Тогда
				НомераСтрокСРеализацией.Добавить(Формат(Стр.НомерСтроки, "ЧГ=0"));
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//Евросиб Каблов 17.01.2022 )
		
		//Евросиб Каблов 02.07.2021 ( Ticket#0234010
		//МассивСтрокСделкиДляИзменения.Добавить(Новый Структура("Сделка, ГУИДРасходов", Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке));
		Если ЭтоКорректировочныйАкцепт Тогда
			//Обновлять только те строки сделки, которые связаны со строками корректировки поступления, не связанными со строками ПТУ (т.е. добавленными в Корректировку поступления).
			СтрокаКоректировкиПоступления = СтрокиКорректировкиПоступления.Найти(Стр.ИдентификаторСтрокипоступления, "ИдентификаторСтрокипоступления"); 
			Если СтрокаКоректировкиПоступления <> Неопределено И Не ЗначениеЗаполнено(СтрокаКоректировкиПоступления.Поступление) Тогда
				МассивСтрокСделкиДляИзменения.Добавить(Новый Структура("Сделка, ГУИДРасходов", Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке));
			КонецЕсли;
		Иначе
			МассивСтрокСделкиДляИзменения.Добавить(Новый Структура("Сделка, ГУИДРасходов", Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке));
		КонецЕсли;
		//Евросиб Каблов 02.07.2021 )
		//Субботин 75883 10.10.2023 Начало 
		СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
		//Было
		//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр, Объект, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка);
		//Стало
		Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], Объект, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка);
		ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
		Стр.Выбрать = Ложь;
		//Субботин 75883 10.10.2023 Конец 
		
		// Евросиб US 83437 Рыбьяков К.А. 15.07.2024 ((
		Если ДанныеДляДобавленияВАкцепт <> Неопределено Тогда
			ПроверитьСтрокиДляОтложенногоИзменения(Стр);
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 05.07.2024 ))
	КонецЦикла;
	
	//ОбновитьСделкиНаСервере(МассивСтрокСделкиДляИзменения, Объект.Ссылка);
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
	//РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", ?(Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись)));
	//Если РезультатЗаписи Тогда  
	//	ЗафиксироватьТранзакцию();
	//	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	//	Если НомераСтрокСРеализацией.Количество() > 0 Тогда
	//		СписокНомеровСтрок = СтрСоединить(НомераСтрокСРеализацией, ", ");
	//		ТекстСообщения = СтрШаблон("По строкам акцепта %1 сформированы РТУ. При повторном разнесении, нужно привязать акцепт к существующим строкам.", СписокНомеровСтрок);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//	КонецЕсли;
	//	//Евросиб Каблов 17.01.2022 )
	//Иначе
	//	ОтменитьТранзакцию();
	//	Прочитать();                                                     
	//	ОписаниеОшибки = ОписаниеОшибки();
	//	ВызватьИсключение СтрШаблон("Не удалось записать данные акцепта и сделок!
	//	|%1)", ОписаниеОшибки);
	//	
	//КонецЕсли;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ОбновитьСделкиНаСервере(МассивСтрокСделкиДляИзменения, АкцептСсылка)
	
	//Евросиб - АСуслов 05.12.2022 15:38:07 #51968
	//(
	//СоответствиеСделок = Новый Соответствие; 
	//МассивСделокДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов = Новый Массив;
	//Для каждого Стр Из МассивСтрокСделкиДляИзменения Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	обСделка = СоответствиеСделок.Получить(Стр.Сделка);
	//	Если обСделка = Неопределено Тогда
	//		обСделка = Стр.Сделка.ПолучитьОбъект();
	//		СоответствиеСделок.Вставить(Стр.Сделка, обСделка);
	//	КонецЕсли; 
	//	СтрокаРасходов = обСделка.Расходы.Найти(Стр.ГУИДРасходов);
	//	Если СтрокаРасходов = Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	Если СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
	//		мСтрокКУдалению = Новый Массив;
	//		мСтрокКУдалению.Добавить(СтрокаРасходов);		 
	//		обСделка.УдалитьСтрокиРасходов(мСтрокКУдалению, Ложь, Истина, Ложь);
	//	Иначе
	//		СтрокаРасходов.УчДокумент = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	//	КонецЕсли;
	//КонецЦикла; 
	//Для каждого СтрокаСоответствие Из СоответствиеСделок Цикл
	//	обСделка = СтрокаСоответствие.Значение;
	//	обСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта", Истина);
	//	обСделка.Записать(РежимЗаписиДокумента.Проведение);
	//КонецЦикла; 
	МассивСделокДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов = Новый Массив;
	Для каждого Стр Из МассивСтрокСделкиДляИзменения Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
			Продолжить;
		КонецЕсли; 
		Если МассивСделокДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов.Найти(Стр.Сделка) = Неопределено Тогда
			МассивСделокДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов.Добавить(Стр.Сделка);
		КонецЕсли;                                                                                       
	КонецЦикла;
	Для каждого СделкаДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов Из МассивСделокДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов Цикл
		ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(СделкаДляЗаписиОчередиОтложенногоИзмененияВзаимосвязанныхОбъектов, АкцептСсылка);
	КонецЦикла;
	//)
	//Евросиб - АСуслов 05.12.2022 15:38:19 #51968

КонецПроцедуры

&НаКлиенте
Процедура УслугиПоступлениеСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ПоступлениеСуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекДанные.ПоступлениеСумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекДанные.ПоступлениеСтавкаНДС), Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНеурегПриИзменении(Элемент)
	
	//Евросиб Каблов 16.12.2020 ( Ticket#0211264 
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные.Неурег = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ")
			И ЗначениеЗаполнено(ТекДанные.Сделка) Тогда
		ТекДанные.Неурег = Неопределено;
		ПоказатьПредупреждение(, "Для строки, привязанной к сделке, запрещено выбирать причину неурегулированных расходов Отработка в РИТМ!");
	КонецЕсли;
	//Евросиб Каблов 16.12.2020 )
	
КонецПроцедуры

//Евросиб Каблов 24.12.2020 Ticket#0215402
&НаКлиенте
Функция УстановитьВидимостьНадписиОтправитьСтрокиВРитм()
	
	ВсеСтрокиВыгружены = Истина;
	ОтработкаВРитм = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ");
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл		
		Если СтрокаТЧ.ВыгруженаВРИТМ <> (СтрокаТЧ.Неурег = ОтработкаВРитм) Тогда
			ВсеСтрокиВыгружены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОтправитьСтрокиВРитм.Видимость = Не ВсеСтрокиВыгружены;
	
КонецФункции


&НаКлиенте
Процедура УслугиСделкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда	
		Если ЗначениеЗаполнено(ТекДанные.Сделка) Тогда		
			ТекДанные.ПривязалПользователь = ПользователиКлиент.ТекущийПользователь();
		Иначе
			ТекДанные.ПривязалПользователь = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


//Евросиб Каблов 26.01.2021
&НаКлиенте
Процедура ПроверкаСделокЗаказов(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("АдресТаблицыАкцепта", ПолучитьАдресТаблицыДляПроверкиСделокЗаказов());
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытияПроверкиСделокЗаказов", ЭтаФорма);
	ОткрытьФорму("Документ.Акцепт.Форма.ПроверкаСделокЗаказов", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыДляПроверкиСделокЗаказов()
	
	ТаблицаАкцепта = Объект.Услуги.Выгрузить(, "НомерСтроки, Контейнер, Вагон, ТранспортныйДокумент, ИдентификаторСтрокиПоступления, Сделка");
	Возврат ПоместитьВоВременноеХранилище(ТаблицаАкцепта, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗакрытияПроверкиСделокЗаказов(АдресТаблицы, ДополнительныеПараметры) Экспорт

	Если АдресТаблицы <> Неопределено Тогда	
		ОбработкаПроверкиСделокЗаказов(АдресТаблицы);
		Модифицированность = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиСделокЗаказов(АдресТаблицы)

	ТаблицаАкцепта = ПолучитьИзВременногоХранилища(АдресТаблицы);
	УдалитьИзВременногоХранилища(АдресТаблицы);
	Для ИндексСтроки = 0 По ТаблицаАкцепта.Количество() - 1 Цикл
		СтрокаТаблицыУслуг = Объект.Услуги[ИндексСтроки];
	    Если ТаблицаАкцепта[ИндексСтроки].Отметка Тогда
		    СтрокаТаблицыУслуг.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ;
		ИначеЕсли СтрокаТаблицыУслуг.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда
			СтрокаТаблицыУслуг.Неурег = Неопределено;
		КонецЕсли; 		
	КонецЦикла;	

КонецПроцедуры // ОбработкаПроверкиСделокЗаказов()

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Евросиб Каблов 07.09.2022 ( US49022
	ДанныеСтроки = Объект.Услуги.НайтиПоИдентификатору(ВыбраннаяСтрока);
	//Евросиб Каблов 07.09.2022 )
	
	Если Объект.Проведен Тогда
		Если Элемент.ТекущийЭлемент.Родитель.Имя = "УслугиГруппаКоличествоЦена"
			ИЛИ Элемент.ТекущийЭлемент.Родитель.Имя = "УслугиГруппаСумма" Тогда
			ПоказатьПредупреждение(,
							"Колонки количество, цена, ставка НДС, сумма НДС и сумма заблокированы для изменения в проведенном документе");
		КонецЕсли; 
	КонецЕсли;
	
	//Евросиб Каблов 28.04.2021 ( Ticket#0230703
	Если Элемент.ТекущийЭлемент.Имя = "УслугиУчДокумент" И (Элемент.ТекущийЭлемент.ТолькоПросмотр ИЛИ ТолькоПросмотр) Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.УчДокумент);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "УслугиСделка" И (Элемент.ТекущийЭлемент.ТолькоПросмотр ИЛИ ТолькоПросмотр) Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Сделка);
	КонецЕсли;
	//Евросиб Каблов 28.04.2021 )
	
	//Евросиб Каблов 07.09.2022 ( US49022
	Если Поле = Элементы.УслугиНеурегЗапрос И ЗначениеЗаполнено(ДанныеСтроки.ГУИДТемы) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОткрытьТему", ДанныеСтроки.ГУИДТемы);
		ОткрытьФорму("Обработка.Диалоги.Форма", ПараметрыФормы);
	КонецЕсли;
	//Евросиб Каблов 07.09.2022 )
	
КонецПроцедуры


&НаКлиенте
Процедура ПеречитатьПериоды(Команда)

	ПеречитатьПериодыСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьПериодыСервер()
	
	ТекущийПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	//Евросиб Каблов 09.04.2025 ( #105407
	//ТекущийПериодБУ = Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
	ТекущийПериодБУ = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ(Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект.Поступление,"СчетФактураПолученный");
	Если РеквизитыСФ <> Неопределено Тогда
		ДатаВСФ = РеквизитыСФ.ДатаВходящегоДокумента;
	Иначе
		ДатаВСФ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Поступление, "ДатаВходящегоДокумента");
	КонецЕсли;
	ТекущийПериодВО = Макс(ТекущийПериодВО, НачалоМесяца(ДатаВСФ));
	ТекущийПериодБУ = Макс(ТекущийПериодБУ, НачалоМесяца(ДатаВСФ));
	
	Если ТекущийПериодБУ <> Объект.ПериодБУ Или ТекущийПериодВО <> Объект.ПериодВО Тогда
		Объект.ПериодБУ = ТекущийПериодБУ;
		Объект.ПериодВО = ТекущийПериодВО;
		ДополнитьДанные_Сервер(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровНакладных(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Накладные"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, Накладные", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровВагонов(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Вагоны"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, Вагоны", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровКТК(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Контейнеры"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, КТК", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Список, ДополнительныеПараметры) Экспорт
	
	Если Список <> Неопределено И ДополнительныеПараметры <> неопределено Тогда
		ИмяРеквизитаОтбора = Неопределено;
		Если ДополнительныеПараметры.Свойство("ИмяРеквизитаОтбора", ИмяРеквизитаОтбора) Тогда
			Если ИмяРеквизитаОтбора = "Вагоны" Тогда
				Вагон = СтрСоединить(Список, ";");
				Вагоны.ЗагрузитьЗначения(ПолучитьСписокВагонов(Список));
			ИначеЕсли ИмяРеквизитаОтбора = "Контейнеры" Тогда
				Контейнер = СтрСоединить(Список, ";");
				Контейнеры.ЗагрузитьЗначения(ПолучитьСписокКонтейнеров(Список));
			ИначеЕсли ИмяРеквизитаОтбора = "Накладные" Тогда
				Накладная = СтрСоединить(Список, ";");
				Накладные.ЗагрузитьЗначения(ПолучитьСписокНакладных(Список));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборТаблицыУслуг();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВагонов(Номера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТС КАК ТС
		|ГДЕ
		|	ТС.Наименование В (&Номера)";
	
	Запрос.УстановитьПараметр("Номера", Номера);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтейнеров(Наименования)
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	ТаблицаНомеров.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(4, ДопустимаяДлина.Переменная)));
	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(6, ДопустимаяДлина.Переменная)));
	ТаблицаНомеров.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная)));
	
	Для каждого Наименование Из Наименования Цикл	
		СтрокаТаблицы = ТаблицаНомеров.Добавить();
		СтрокаТаблицы.Префикс = Лев(ВРег(Наименование), 4);
		СтрокаТаблицы.Номер = Сред(Наименование, 5, 6);
		СтрокаТаблицы.Наименование = Наименование;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНомеров.Префикс КАК Префикс,
		|	ТаблицаНомеров.Номер КАК Номер
		|ПОМЕСТИТЬ ВТНомера
		|ИЗ
		|	&ТаблицаНомеров КАК ТаблицаНомеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЕ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТЕ КАК ТЕ
		|ГДЕ
		|	(ТЕ.Префикс, ТЕ.Номер) В
		|			(ВЫБРАТЬ
		|				ВТНомера.Префикс КАК Префикс,
		|				ВТНомера.Номер КАК Номер
		|			ИЗ
		|				ВТНомера КАК ВТНомера)";
	
	Запрос.УстановитьПараметр("ТаблицаНомеров", ТаблицаНомеров);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокНакладных(Номера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныйДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ГДЕ
		|	ТранспортныйДокумент.НомерТранспортногоДокумента В(&Номера)
		|	И ТранспортныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная)";
	
	Запрос.УстановитьПараметр("Номера", Номера);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура НакладнаяПриИзменении(Элемент)
	
	Накладная = СокрЛП(Накладная);
	Если ЗначениеЗаполнено(Накладная) Тогда
		Список = СтрРазделить(Накладная, ";", Ложь);
		Накладные.ЗагрузитьЗначения(ПолучитьСписокНакладных(Список));
	Иначе
		Накладные.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура ВагонПриИзменении(Элемент)
	
	Вагон = СокрЛП(Вагон);
	Если ЗначениеЗаполнено(Вагон) Тогда
		Список = СтрРазделить(Вагон, ";", Ложь);
		Вагоны.ЗагрузитьЗначения(ПолучитьСписокВагонов(Список));
	Иначе
		Вагоны.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерПриИзменении(Элемент)
	
	Контейнер = СокрЛП(Контейнер);
	Если ЗначениеЗаполнено(Контейнер) Тогда
		Список = СтрРазделить(Контейнер, ";", Ложь);
		Контейнеры.ЗагрузитьЗначения(ПолучитьСписокКонтейнеров(Список));
	Иначе
		Контейнеры.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыУслуг();
	
КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьОтборТаблицыУслуг()
	
	ПроверятьВагоны = ЗначениеЗаполнено(Вагон);
	ПроверятьКонтейнеры = ЗначениеЗаполнено(Контейнер);
	ПроверятьНакладные = ЗначениеЗаполнено(Накладная);
	Для каждого Стр из Объект.Услуги Цикл
		
		Если ПроверятьВагоны И Вагоны.НайтиПоЗначению(Стр.Вагон) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ПроверятьКонтейнеры И Контейнеры.НайтиПоЗначению(Стр.Контейнер) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ПроверятьНакладные И Накладные.НайтиПоЗначению(Стр.ТранспортныйДокумент) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Стр.ПоказатьВОтборе = Истина;
		
	КонецЦикла;
	
	//Евросиб Каблов 04.03.2021 ( Ticket#0224143
	//СтруктураОтбора = Новый Структура("ПоказатьВОтборе", Истина);
	УслугиОтборСтрок = Элементы.Услуги.ОтборСтрок;
	Если УслугиОтборСтрок = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	Иначе
		СтруктураОтбора = Новый Структура(УслугиОтборСтрок);
	КонецЕсли;
	СтруктураОтбора.Вставить("ПоказатьВОтборе", Истина);
	//Евросиб Каблов 04.03.2021 )
	
	Элементы.Услуги.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиНакопительнуюВедомость(Команда)
	
	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		Сообщить("Документ поступления не соответсвует Поступлению товаров и услуг!");
		Возврат;
	
	КонецЕсли; 
	
	// Проверка на актуальность:
	АктАкцепт = ПолучитьАктАкцепт(Объект.Поступление);
	
	Если АктАкцепт <> Объект.Ссылка Тогда
	
		Сообщить("Акцепт не актуален! Для корректного разнесения откройте актуальный акцепт.");
		Возврат;
	
	КонецЕсли; 
	
	ОпОп = Новый ОписаниеОповещения("РазнестиНакопительнуюВедомость_ПослеРазнесения", ЭтаФорма);
	ОткрытьФорму("Документ.Акцепт.Форма.ФормаРазнесениеРасходовИзНВ", Новый Структура("Поступление, Акцепт", Объект.Поступление, Объект.Ссылка) ); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАктАкцепт(Поступление)

	АктАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Истина);

	Возврат АктАкцепт;
	
КонецФункции // ()

&НаКлиенте
Процедура РазнестиНакопительнуюВедомость_ПослеРазнесения(Пар1, Пар2) Экспорт

	ЭтаФорма.Прочитать();

КонецПроцедуры

&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Евросиб Фролов (30.01.2022 Task №45723
	// Т.к. ранее был запрет на добавление строки кроме копирования, а теперь 
	// просят запретить добавлять строки еще и копированием, то всегда ставим "Отказ"
	Отказ = Истина;	
	// Часть кода ниже закомментировал
	//Если Не Копирование Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	// Евросиб Фролов)
	 
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	//Евросиб Каблов 12.04.2021 ( Ticket#0228837
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ГУИД = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	//Евросиб Каблов 12.04.2021 )
	
КонецПроцедуры

//Евросиб Каблов 05.06.2021 Ticket#0229012
&НаКлиенте
Процедура УслугиСтатусПричиныПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ПричинаНеакцепта) И ТекДанные.СтатусПричины <> ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.Откз") Тогда
		ТекДанные.Сумма = ТекДанные.ПоступлениеСумма;
		ТекДанные.СуммаНДС = ТекДанные.ПоступлениеСуммаНДС;
		ТекДанные.ПолностьюРазнесено = Истина;
		ТекДанные.НоменклатураСделки = ПредопределенноеЗначение("Справочник.Номенклатура.Претензии");
		ТекДанные.СделкаСтавкаНДС = ТекДанные.ПоступлениеСтавкаНДС;
	ИначеЕсли ЗначениеЗаполнено(ТекДанные.ПричинаНеакцепта) И ТекДанные.СтатусПричины = ПредопределенноеЗначение("Перечисление.СтатусыПричинНеакцепта.Откз") Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.Сделка) Тогда
			ТекДанные.Сумма = 0;
			ТекДанные.СуммаНДС = 0;
			ТекДанные.ПолностьюРазнесено = Ложь;
			ТекДанные.НоменклатураСделки = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ТекДанные.СделкаСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Объект.СуммаАкцепта = Объект.Услуги.Итог("Сумма");
	Объект.СуммаНДСАкцепта = Объект.Услуги.Итог("СуммаНДС");
	
КонецПроцедуры

//Евросиб Каблов 05.06.2021 Ticket#0229012
&НаКлиенте
Процедура УслугиСтатусПричиныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.ПричинаНеакцепта) Тогда
		СтандартнаяОбработка = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 02.07.2021 Ticket#0234010
&НаСервере
Процедура РазделитьСтрокуНаСервере(ТекущаяСтрока)
	
	ТекД = Объект.Услуги.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекД <> Неопределено Тогда
		НовСтрока = Объект.Услуги.Вставить(Объект.Услуги.Индекс(ТекД) + 1);
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекД);
		НовСтрока.ГУИД = Строка(Новый УникальныйИдентификатор);
		НовСтрока.СуммаРасходовИзАРМКонтроляСписанийИзРегистра = 0;
		НовСтрока.РазницаАРМКСиСуммаИтого = 0;
		
		//Евросиб Каблов 17.01.2022 ( Task 41630
		//НовСтрока.ИдентификаторСтрокиРасходовВСделке = неопределено;
		//НовСтрока.Сделка = неопределено;
		//НовСтрока.ПолностьюРазнесено = Ложь;
		//НовСтрока.НоменклатурнаяГруппа = Неопределено;
		//НовСтрока.СделкаСумма = 0;
		//НовСтрока.СделкаСтавкаНДС = Неопределено;
		//НовСтрока.СделкаСуммаНДС = 0;
		//НовСтрока.НоменклатураСделки = Неопределено;
		//НовСтрока.ВидРасходов = Неопределено;
		//НовСтрока.Сумма = 0;
		//НовСтрока.СуммаНДС = 0;
		//НовСтрока.УчДокумент  = Неопределено;
		//НовСтрока.Количество = 0;
		//НовСтрока.Цена = 0;
		//НовСтрока.ПривязалПользователь = Неопределено;
		//НовСтрока.ВидЗатрат = Неопределено;		
		//НовСтрока.ПериодВО = Дата(1,1,1);
		
		//Субботин 75883 10.10.2023 начало // переделал на процедуру  очистки данных, без записи
		//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(НовСтрока, Объект, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка);
		Документы.Акцепт.ОчиститьДанныеПривязки(НовСтрока, Перечисления.СобытияОтвязкиПоступления.РучнаяОтвязка);		
		//Субботин 75883 10.10.2023 Конец

		//Евросиб Каблов 17.01.2022 )
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 02.07.2021 Ticket#0234010
&НаКлиенте
Процедура РазделитьСтроку(Команда)
	ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		РазделитьСтрокуНаСервере(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

// ДИТ Поморцева Задача 0244645 20.10.21. начало
&НаСервере
Функция ДоступныПолныеПрава()    
    Возврат РольДоступна("ПолныеПрава");    
КонецФункции

&НаКлиенте
Процедура УслугиСделкаПротоколОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если НЕ ДоступныПолныеПрава() Тогда 
 		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры
// ДИТ Поморцева Задача 0244645 20.10.21. конец

//Евросиб Гудкова( 02.12.2021 Ticket№ 42922
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        ИдентификаторЗамераПроведение = ОценкаПроизводительностиКлиент.ЗамерВремени("АкцептПроведениеИнтерактивное");
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
        ИдентификаторЗамераПроведение = ОценкаПроизводительностиКлиент.ЗамерВремени("АкцептОтменаПроведенияИнтерактивная");
	Иначе
		ИдентификаторЗамераПроведение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Гудкова)

// Евросиб Фролов (27.01.2022 Ticket№ 44918
&НаСервере
Процедура СравнитьПолученнуюТаблицуСТекущей(ТаблицаУслугПТУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.Контейнер КАК Контейнер,
	|	АкцептУслуги.Вагон КАК Вагон,
	|	АкцептУслуги.ПоступлениеЦена КАК ПоступлениеЦена,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
	|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.УчДокумент КАК УчДокумент,                   
	//Евросиб - АСуслов 07.03.2023 16:54:24 #66486
	//(
	|   АкцептУслуги.Сделка КАК Сделка,
	|   АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
	//)
	//Евросиб - АСуслов 07.03.2023 16:54:31 #66486
	|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ПОМЕСТИТЬ втУслуги
	|ИЗ
	|	&Услуги КАК АкцептУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПТУ.Контейнер КАК Контейнер,
	|	ПТУ.Вагон КАК Вагон,
	|	ПТУ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	ПТУ.Номенклатура КАК Номенклатура,
	|	ПТУ.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
	|	ПТУ.ПоступлениеКоличество КАК ПоступлениеКоличество,
	|	ПТУ.ПоступлениеЦена КАК ПоступлениеЦена,
	|	ПТУ.ПоступлениеСумма КАК ПоступлениеСумма,
	|	ПТУ.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	ПТУ.СтанцияОтправления КАК СтанцияОтправления,
	|	ПТУ.СтанцияНазначения КАК СтанцияНазначения,
	|	ПТУ.Содержание КАК Содержание,
	|	ПТУ.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ПТУ.ВесПоНакладной КАК ВесПоНакладной
	|ПОМЕСТИТЬ втПТУ
	|ИЗ
	|	&ПТУ КАК ПТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПТУ.Контейнер КАК Контейнер,
	|	втПТУ.Вагон КАК Вагон,
	|	втПТУ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	втПТУ.Номенклатура КАК Номенклатура,
	|	втПТУ.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
	|	втПТУ.ПоступлениеКоличество КАК ПоступлениеКоличество,
	|	втПТУ.ПоступлениеЦена КАК ПоступлениеЦена,
	|	втПТУ.ПоступлениеСумма КАК ПоступлениеСумма,
	|	втПТУ.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	втПТУ.СтанцияОтправления КАК СтанцияОтправления,
	|	втПТУ.СтанцияНазначения КАК СтанцияНазначения,
	|	втПТУ.Содержание КАК Содержание,
	|	втПТУ.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	втПТУ.ВесПоНакладной КАК ВесПоНакладной,
	|	втУслуги.ГУИД КАК ГУИД,                       
	//Евросиб - АСуслов 07.03.2023 16:57:26 #66486
	//(
	|   ЕСТЬNULL(СделкаРасходы.УслугаОтключена, Ложь) КАК УслугаОтключена,
	|   ЕСТЬNULL(СделкаРасходы.ИсточникПоявленияСтрокиЭкономики, Неопределено) КАК ИсточникПоявленияСтрокиЭкономики
	//)
	//Евросиб - АСуслов 07.03.2023 16:57:28 #66486
	|ИЗ
	|	втПТУ КАК втПТУ
	|		ПОЛНОЕ СОЕДИНЕНИЕ втУслуги КАК втУслуги
	|		ПО втПТУ.ИдентификаторСтрокиПоступления = втУслуги.ИдентификаторСтрокиПоступления
	|			И втПТУ.Номенклатура = втУслуги.Номенклатура
	|			И втПТУ.Контейнер = втУслуги.Контейнер
	|			И втПТУ.Вагон = втУслуги.Вагон
	|   	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|  			ПО втУслуги.Сделка = СделкаРасходы.Ссылка
	|  				И втУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|ГДЕ
	|	(ЕСТЬNULL(втПТУ.ПоступлениеЦена, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеЦена, 0)
	|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеСтавкаНДС, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСтавкаНДС, 0)
	|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеСумма, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСумма, 0)
	|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеСуммаНДС, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСуммаНДС, 0)
	|			ИЛИ ЕСТЬNULL(втПТУ.ТранспортныйДокумент, &ПустойТД) <> ЕСТЬNULL(втУслуги.ТранспортныйДокумент, &ПустойТД))";
	
	Запрос.УстановитьПараметр("Услуги", 	Объект.Услуги.Выгрузить());
	Запрос.УстановитьПараметр("ПТУ", 		ТаблицаУслугПТУ);
	Запрос.УстановитьПараметр("ПустойТД", 	Документы.ТранспортныйДокумент.ПустаяСсылка()); 
	
	// ++ ДИТ_Агафонов_task 41390
	// В Корреткировке могут быть несколько записей по КТК (корректирующие) это надо учесть
	ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах = ОпределениеЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах();			
	Если ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Вагон КАК Вагон,
		|	АкцептУслуги.ПоступлениеКоличество КАК ПоступлениеКоличество,
		|	АкцептУслуги.ПоступлениеЦена КАК ПоступлениеЦена,
		|	АкцептУслуги.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
		|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
		|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.КлючСтрокиПустаяАналитика КАК КлючСтрокиПустаяАналитика,
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.УчДокумент КАК УчДокумент,
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:54:24 #66486
		//(
		|   АкцептУслуги.Сделка КАК Сделка,
		|   АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
		//)
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:54:31 #66486
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ПОМЕСТИТЬ втУслуги
		|ИЗ
		|	&Услуги КАК АкцептУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втУслуги.Номенклатура КАК Номенклатура,
		|	втУслуги.Контейнер КАК Контейнер,
		|	втУслуги.Вагон КАК Вагон,
		|	МАКСИМУМ(втУслуги.ПоступлениеКоличество) КАК ПоступлениеКоличество,
		|	СУММА(втУслуги.ПоступлениеЦена) КАК ПоступлениеЦена,
		|	МАКСИМУМ(втУслуги.ПоступлениеСтавкаНДС) КАК ПоступлениеСтавкаНДС,
		|	СУММА(втУслуги.ПоступлениеСумма) КАК ПоступлениеСумма,
		|	СУММА(втУслуги.ПоступлениеСуммаНДС) КАК ПоступлениеСуммаНДС,
		|	втУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	втУслуги.КлючСтрокиПустаяАналитика КАК КлючСтрокиПустаяАналитика,
		|	МИНИМУМ(втУслуги.ГУИД) КАК ГУИД,
		|	МАКСИМУМ(втУслуги.УчДокумент) КАК УчДокумент,
		|	МАКСИМУМ(втУслуги.ТранспортныйДокумент) КАК ТранспортныйДокумент,
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:57:26 #66486
		//(
		|   МАКСИМУМ(ЕСТЬNULL(СделкаРасходы.УслугаОтключена, Ложь)) КАК УслугаОтключена,
		|   МАКСИМУМ(ЕСТЬNULL(СделкаРасходы.ИсточникПоявленияСтрокиЭкономики, Неопределено)) КАК ИсточникПоявленияСтрокиЭкономики
		//)
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:57:28 #66486
		|ПОМЕСТИТЬ втУслуги_Свернутая
		|ИЗ
		|	втУслуги КАК втУслуги
		|   	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|  			ПО втУслуги.Сделка = СделкаРасходы.Ссылка
		|  				И втУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
		|
		|СГРУППИРОВАТЬ ПО
		|	втУслуги.ИдентификаторСтрокиПоступления,
		|	втУслуги.Номенклатура,
		|	втУслуги.Контейнер,
		|	втУслуги.Вагон,
		|	втУслуги.КлючСтрокиПустаяАналитика
		|
		//|ИМЕЮЩИЕ
		//|	СУММА(втУслуги.ПоступлениеСумма) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПТУ.Контейнер КАК Контейнер,
		|	ПТУ.Вагон КАК Вагон,
		|	ПТУ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ПТУ.КлючСтрокиПустаяАналитика КАК КлючСтрокиПустаяАналитика,
		|	ПТУ.Номенклатура КАК Номенклатура,
		|	ПТУ.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
		|	ПТУ.ПоступлениеКоличество КАК ПоступлениеКоличество,
		|	ПТУ.ПоступлениеЦена КАК ПоступлениеЦена,
		|	ПТУ.ПоступлениеСумма КАК ПоступлениеСумма,
		|	ПТУ.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
		|	ПТУ.СтанцияОтправления КАК СтанцияОтправления,
		|	ПТУ.СтанцияНазначения КАК СтанцияНазначения,
		|	ПТУ.Содержание КАК Содержание,
		|	ПТУ.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ПТУ.ВесПоНакладной КАК ВесПоНакладной
		|ПОМЕСТИТЬ втПТУ
		|ИЗ
		|	&ПТУ КАК ПТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПТУ.Контейнер КАК Контейнер,
		|	втПТУ.Вагон КАК Вагон,
		|	втПТУ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	втПТУ.КлючСтрокиПустаяАналитика КАК КлючСтрокиПустаяАналитика,
		|	втПТУ.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(втПТУ.ПоступлениеСтавкаНДС) КАК ПоступлениеСтавкаНДС,
		|	МАКСИМУМ(втПТУ.ПоступлениеКоличество) КАК ПоступлениеКоличество,
		|	СУММА(втПТУ.ПоступлениеЦена) КАК ПоступлениеЦена,
		|	Максимум(втПТУ.ПоступлениеЦена) КАК ПоступлениеЦенаМакс,
		|	СУММА(втПТУ.ПоступлениеСумма) КАК ПоступлениеСумма,
		|	СУММА(втПТУ.ПоступлениеСуммаНДС) КАК ПоступлениеСуммаНДС,
		|	МАКСИМУМ(втПТУ.СтанцияОтправления) КАК СтанцияОтправления,
		|	МАКСИМУМ(втПТУ.СтанцияНазначения) КАК СтанцияНазначения,
		|	МАКСИМУМ(втПТУ.Содержание) КАК Содержание,
		|	МАКСИМУМ(втПТУ.ТранспортныйДокумент) КАК ТранспортныйДокумент,
		|	МАКСИМУМ(втПТУ.ВесПоНакладной) КАК ВесПоНакладной
		|ПОМЕСТИТЬ втПТУ_Свернутая
		|ИЗ
		|	втПТУ КАК втПТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	втПТУ.ИдентификаторСтрокиПоступления,
		|	втПТУ.Номенклатура,
		|	втПТУ.Контейнер,
		|	втПТУ.Вагон,
		|	втПТУ.КлючСтрокиПустаяАналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПТУ.Контейнер КАК Контейнер,
		|	втПТУ.Вагон КАК Вагон,
		|	втПТУ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	втПТУ.КлючСтрокиПустаяАналитика КАК КлючСтрокиПустаяАналитика,
		|	втПТУ.Номенклатура КАК Номенклатура,
		|	втПТУ.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
		|	втПТУ.ПоступлениеКоличество КАК ПоступлениеКоличество,
		|	втПТУ.ПоступлениеЦена КАК ПоступлениеЦена,
		|	втПТУ.ПоступлениеЦенаМакс КАК ПоступлениеЦенаМакс,
		|	втПТУ.ПоступлениеСумма КАК ПоступлениеСумма,
		|	втПТУ.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
		|	втПТУ.СтанцияОтправления КАК СтанцияОтправления,
		|	втПТУ.СтанцияНазначения КАК СтанцияНазначения,
		|	втПТУ.Содержание КАК Содержание,
		|	втПТУ.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	втПТУ.ВесПоНакладной КАК ВесПоНакладной,
		|	втУслуги.ГУИД КАК ГУИД,
		|	ЕстьNULL(втУслуги.ПоступлениеКоличество,0) КАК ПоступлениеКоличество1,
		|	ЕстьNULL(втУслуги.ПоступлениеСумма,0) КАК ПоступлениеСумма1,
		|	ЕстьNULL(втУслуги.ПоступлениеСуммаНДС,0) КАК ПоступлениеСуммаНДС1,
		|	ЕстьNULL(втУслуги.ПоступлениеЦена,0) КАК ПоступлениеЦена1,
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:57:26 #66486
		//(
		|   втУслуги.УслугаОтключена КАК УслугаОтключена,
		|   втУслуги.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//)
		//Евросиб - Агафонов на АСуслов 07.03.2023 16:57:28 #66486
		|	втПТУ.ПоступлениеСумма-ЕстьNULL(втУслуги.ПоступлениеСумма,0) КАК ПоступлениеСуммаДельта,
		|	втПТУ.ПоступлениеСуммаНДС-ЕстьNULL(втУслуги.ПоступлениеСуммаНДС,0) КАК ПоступлениеСуммаНДСДельта,
		|	втПТУ.ПоступлениеЦена-ЕстьNULL(втУслуги.ПоступлениеЦена,0) КАК ПоступлениеЦенаДельта
		|ИЗ
		|	втПТУ_Свернутая КАК втПТУ
		|		ПОЛНОЕ СОЕДИНЕНИЕ втУслуги_Свернутая КАК втУслуги
		|		ПО втПТУ.ИдентификаторСтрокиПоступления = втУслуги.ИдентификаторСтрокиПоступления
		|			И втПТУ.Номенклатура = втУслуги.Номенклатура
		|			И втПТУ.Контейнер = втУслуги.Контейнер
		|			И втПТУ.Вагон = втУслуги.Вагон
		|			И втПТУ.КлючСтрокиПустаяАналитика = втУслуги.КлючСтрокиПустаяАналитика
		|ГДЕ
		|	((ЕСТЬNULL(втПТУ.ПоступлениеСумма, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСумма, 0)
		//|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеЦена, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеЦена, 0))
		//|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеСтавкаНДС, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСтавкаНДС, 0)
		|			ИЛИ ЕСТЬNULL(втПТУ.ПоступлениеСуммаНДС, 0) <> ЕСТЬNULL(втУслуги.ПоступлениеСуммаНДС, 0)
		|			ИЛИ ЕСТЬNULL(втПТУ.ТранспортныйДокумент, &ПустойТД) <> ЕСТЬNULL(втУслуги.ТранспортныйДокумент, &ПустойТД)))
		|";
		
		//Агафонов_task 41390 Нам нужно отслеживать изменение сумму и количество по ТЗ, но еще нужно отслеживать ктк и вагоны. В поступление есть ошибки при наличии нескольких строк по КТК и вагону будет ошибка. Поэтому добавили группировку, но тогда не работают пустые строки, для них добавляем ключ.
		ТаблицаУслугПТУ_Текущая = Объект.Услуги.Выгрузить();
		ТаблицаУслугПТУ_Текущая.Колонки.Добавить("КлючСтрокиПустаяАналитика", Новый ОписаниеТипов("Число"));
		ТаблицаУслугПТУ.Колонки.Добавить("КлючСтрокиПустаяАналитика", Новый ОписаниеТипов("Число"));
		СчетчикПустойСтроки=0;
		ТекИдентификаторСтрокиПоступления = Неопределено;
		Для каждого СтрокаОбработки Из ТаблицаУслугПТУ_Текущая Цикл
			Если ТекИдентификаторСтрокиПоступления <> СтрокаОбработки.ИдентификаторСтрокиПоступления Тогда	
				ТекИдентификаторСтрокиПоступления = СтрокаОбработки.ИдентификаторСтрокиПоступления;
				СчетчикПустойСтроки = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаОбработки.Контейнер) и не ЗначениеЗаполнено(СтрокаОбработки.Вагон) Тогда
				СчетчикПустойСтроки = СчетчикПустойСтроки + 1;	
				СтрокаОбработки.КлючСтрокиПустаяАналитика = СчетчикПустойСтроки;
			КонецЕсли;
		КонецЦикла;
		СчетчикПустойСтроки=0;
		ТекИдентификаторСтрокиПоступления = Неопределено;
		Для каждого СтрокаОбработки Из ТаблицаУслугПТУ Цикл
			Если ТекИдентификаторСтрокиПоступления <> СтрокаОбработки.ИдентификаторСтрокиПоступления Тогда	
				ТекИдентификаторСтрокиПоступления = СтрокаОбработки.ИдентификаторСтрокиПоступления;
				СчетчикПустойСтроки = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаОбработки.Контейнер) и не ЗначениеЗаполнено(СтрокаОбработки.Вагон) Тогда
				СчетчикПустойСтроки = СчетчикПустойСтроки + 1;	
				СтрокаОбработки.КлючСтрокиПустаяАналитика = СчетчикПустойСтроки;
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Услуги", 	ТаблицаУслугПТУ_Текущая);
		Запрос.УстановитьПараметр("ПТУ", 		ТаблицаУслугПТУ);
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПерезаполняемыеСтроки = Новый Массив;
	УдаляемыеСтроки = Новый Массив;

	МассивПропускаемыхСтрок = Новый Массив();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторСтрокиПоступления)
			И ЗначениеЗаполнено(Выборка.ГУИД) Тогда
			//Евросиб - АСуслов 07.03.2023 16:58:44 #66486
			//(
			Если Выборка.УслугаОтключена И Выборка.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта 
				// ++ ДИТ_Агафонов_task 41390 12.04.2023
				//Для корректировок нужно использовать согласно требованию бизнеса механизм фиксации строк
				И не ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах	
				// -- ДИТ_Агафонов_task 41390 12.04.2023	
				Тогда
				МассивПропускаемыхСтрок.Добавить(Выборка.ГУИД);
				Продолжить;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 07.03.2023 16:58:48 #66486
			// Строки в ПТУ и акцепте отличаются: нужно отвязать и перезаполнить
			ПерезаполняемыеСтроки.Добавить(Выборка.ГУИД);
		ИначеЕсли Выборка.ИдентификаторСтрокиПоступления = NULL Тогда
			// в ПТУ удалена строка: нужно отвязать и удалить 
			УдаляемыеСтроки.Добавить(Выборка.ГУИД);
		КонецЕсли;	
		
	КонецЦикла;	
	
	// Отвяжем строки
	МассивПропускаемыхСтрок = Новый Массив();
	Для Каждого ТекУслуга Из Объект.Услуги Цикл
		
		ТипОтчетКомитенту = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
		ПустаяСсылкаОтчетКомитенту = ПредопределенноеЗначение("Документ.ОтчетКомитентуОПродажах.ПустаяСсылка");
		ЗапрещеноОтвязыватьСтроку = ТипЗнч(ТекУслуга.УчДокумент) = ТипОтчетКомитенту И ТекУслуга.УчДокумент <> ПустаяСсылкаОтчетКомитенту;
		// ++ ДИТ_Агафонов_task 41390
		Если ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах Тогда
		ЗапрещеноОтвязыватьСтроку = ЗапрещеноОтвязыватьСтроку или ТекУслуга.ЗафиксироватьСтрокуДляКорректировок;
		КонецЕсли;
		// -- ДИТ_Агафонов_task 41390
		
		Если ПерезаполняемыеСтроки.Найти(ТекУслуга.ГУИД) <> Неопределено
			ИЛИ УдаляемыеСтроки.Найти(ТекУслуга.ГУИД) <> Неопределено Тогда
			
			Если ЗапрещеноОтвязыватьСтроку Тогда   
				// ++ ДИТ_Агафонов_task 41390 07.02.2023
				//Для корректировки требование сторнировать
				Если не ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах Тогда
				// -- ДИТ_Агафонов_task 41390 07.02.2023
				ТекстСообщения = СтрШаблон("Строка %1, не была перезаполнена, т.к. ее невозможно отвязать от сделки (в ней вид расходов Возмещаемые и документ Отчет комитенту)!", ТекУслуга.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				МассивПропускаемыхСтрок.Добавить(ТекУслуга.ГУИД);
				Продолжить;
			КонецЕсли;
			
			ТекУслуга.Выбрать = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	ОтвязатьВыбранныеСтрокиСервер();	
	
	// Переносим услуги в акцепт
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл  
		
		// ++ ДИТ_Агафонов_task 41390
		ПропускалиСтроку = Ложь;
		// -- ДИТ_Агафонов_task 41390
		
		Если МассивПропускаемыхСтрок.Найти(Выборка.ГУИД) <> Неопределено Тогда // если строки не были отвязаны, то пропускаем их
			// ++ ДИТ_Агафонов_task 41390 
			Если ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах Тогда
				ПропускалиСтроку = Истина;	
			Иначе	
			// -- ДИТ_Агафонов_task 41390
			Продолжить;  
			КонецЕсли
		КонецЕсли;	
		
		Если ПерезаполняемыеСтроки.Найти(Выборка.ГУИД) <> Неопределено Тогда
			НайденныеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Выборка.ГУИД));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаУслуги = НайденныеСтроки[0];
				// ++ ДИТ_Агафонов_task 41390
				Если ПропускалиСтроку 
					и (Выборка.ПоступлениеСуммаДельта<>0 или Выборка.ПоступлениеСуммаНДСДельта<>0)
					Тогда
					СтрокаКорректировки = Объект.Услуги.Добавить();	
					ЗаполнитьЗначенияСвойств(СтрокаКорректировки, СтрокаУслуги,"Номенклатура,НоменклатурнаяГруппа,ИдентификаторСтрокиПоступления,Контейнер,Вагон,ТранспортныйДокумент,ПоступлениеСтавкаНДС,СтанцияОтправления,СтанцияНазначения");
				    СтрокаКорректировки.ПоступлениеСумма = Выборка.ПоступлениеСуммаДельта;
				    СтрокаКорректировки.ПоступлениеСуммаНДС = Выборка.ПоступлениеСуммаНДСДельта;
				    СтрокаКорректировки.ПоступлениеЦена = Выборка.ПоступлениеСуммаДельта;
					Продолжить;
				ИначеЕсли ПропускалиСтроку  Тогда	
					ТекстСообщения = СтрШаблон("Строка %1, не была перезаполнена по ставке НДС и транспортному документу, т.к. она зафиксирована или ее невозможно отвязать от сделки (в ней вид расходов Возмещаемые и документ Отчет комитенту)!", ТекУслуга.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;	
				Если ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах Тогда
					Если (СтрокаУслуги.ПоступлениеСумма + Выборка.ПоступлениеСуммаДельта) = 0 и (СтрокаУслуги.ПоступлениеСуммаНДС + Выборка.ПоступлениеСуммаНДСДельта)=0 Тогда
						Объект.Услуги.Удалить(СтрокаУслуги);
					Иначе	
						ЗаполнитьЗначенияСвойств(СтрокаУслуги, Выборка,,"ПоступлениеСумма,ПоступлениеСуммаНДС,ПоступлениеЦена");
						СтрокаУслуги.ПоступлениеСумма = СтрокаУслуги.ПоступлениеСумма + Выборка.ПоступлениеСуммаДельта;
						СтрокаУслуги.ПоступлениеСуммаНДС = СтрокаУслуги.ПоступлениеСуммаНДС + Выборка.ПоступлениеСуммаНДСДельта;
						СтрокаУслуги.ПоступлениеЦена = СтрокаУслуги.ПоступлениеЦена + Выборка.ПоступлениеЦенаДельта;
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// -- ДИТ_Агафонов_task 41390
				ЗаполнитьЗначенияСвойств(СтрокаУслуги, Выборка);
			КонецЕсли;
		ИначеЕсли УдаляемыеСтроки.Найти(Выборка.ГУИД) <> Неопределено Тогда
			НайденныеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Выборка.ГУИД));   
			// ++ ДИТ_Агафонов_task 41390
			Если ПропускалиСтроку и НайденныеСтроки.Количество() > 0 Тогда
				СтрокаУдаления = Объект.Услуги.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаУдаления,НайденныеСтроки[0],"Номенклатура,НоменклатурнаяГруппа,ИдентификаторСтрокиПоступления,Контейнер,Вагон,ТранспортныйДокумент,ПоступлениеСтавкаНДС,СтанцияОтправления,СтанцияНазначения");
			    СтрокаУдаления.ПоступлениеКоличество = Выборка.ПоступлениеКоличество1 * (-1);
			    СтрокаУдаления.ПоступлениеСумма = Выборка.ПоступлениеСумма1 * (-1);
			    СтрокаУдаления.ПоступлениеСуммаНДС = Выборка.ПоступлениеСуммаНДС1 * (-1);
			    СтрокаУдаления.ПоступлениеЦена = Выборка.ПоступлениеЦена1;
				Продолжить;
			КонецЕсли;	
			// -- ДИТ_Агафонов_task 41390
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаУслуги = НайденныеСтроки[0];
				Объект.Услуги.Удалить(СтрокаУслуги);
			КонецЕсли;
		Иначе
			// если строки нет ни в перезаполняемых, ни в удаляемых, то это добавленная в ПТУ строка
			НоваяСтрока = Объект.Услуги.Добавить();
			//Евросиб Каблов 13.09.2022 ( 57446
			НоваяСтрока.ГУИД = Новый УникальныйИдентификатор;
			//Евросиб Каблов 13.09.2022 )
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;	
		
	КонецЦикла;	
	
	РежимЗаписиАкцепта = ?(Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиАкцепта))
	
КонецПроцедуры
// Евросиб Фролов)

//Евросиб Каблов 07.09.2022 US49022
&НаСервере
Функция ПолучитьТаблицуДиалогов()
	
	ИдентификаторыСтрокАкцепта = Объект.Услуги.Выгрузить(, "ГУИД").ВыгрузитьКолонку("ГУИД");
	Возврат Обработки.АРМНеурегулированныеРасходы.ПолучитьТаблицуДиалоговПоСтрокамАкцепта(Объект.Поступление, ИдентификаторыСтрокАкцепта);
	
КонецФункции

//Евросиб Каблов 07.09.2022 US49022
&НаСервере
Процедура ОбновитьДанныеПоДиалогамНеурегРасходов()
	
	ТаблицаДиалогов = ПолучитьТаблицуДиалогов();
	ШаблонПоляНеурегЗапрос = "Запрос %1";
	Для каждого СтрокаУслуга Из Объект.Услуги Цикл
		
		Если ЗначениеЗаполнено(СтрокаУслуга.ГУИД) Тогда
			Диалог = ТаблицаДиалогов.Найти(СтрокаУслуга.ГУИД, "ИдентификаторСтрокиАкцепта");
			Если Диалог <> Неопределено Тогда
				СтрокаУслуга.НеурегЗапрос = СтрШаблон(ШаблонПоляНеурегЗапрос, Диалог.ДатаСозданияЗапроса);
				СтрокаУслуга.ГУИДТемы = Диалог.ГУИДТемы;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
				
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСделку(Команда)

	ТекД = Элементы.Услуги.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;                                             
	Поступление = ТекД.УчДокумент;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(текД.Сделка) Тогда		
		ПараметрыФормы.Вставить("Ключ", текД.Сделка);
		ПараметрыФормы.Вставить("ПерейтиКСтрокеУслуг", ТекД.ИдентификаторСтрокиРасходовВСделке);
	КонецЕсли;
	
	ОткрытьФорму("Документ.Сделка.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры


&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент) 
//	Элементы.УслугиКонтекстноеМенюОткрытьСделку.Видимость = Ложь;
	ПодключитьОбработчикОжидания("ОтключитьЭлементыКонтекстногоМенюУслуги", 0.1, Истина);
	
	//Евросиб Каблов 16.01.2023 ( 60424
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	//ДИТ, Беляев СЮ, Ticket#0306463, 03-04-2023, начало
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0306463, 03-04-2023, конец
	НеурегОтработкаВРИТМ = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ");
	Если ЗначениеЗаполнено(ТекДанные.Сделка) Или ТекДанные.Неурег = НеурегОтработкаВРИТМ Или ТекДанные.СуммаПретензии <> 0 Тогда
		Элементы.УслугиНеурегПричинаУказаннаяПользователем.ТолькоПросмотр = Истина;
	Иначе
		Элементы.УслугиНеурегПричинаУказаннаяПользователем.ТолькоПросмотр = Ложь;
	КонецЕсли;
	//Евросиб Каблов 16.01.2023 )
		
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьЭлементыКонтекстногоМенюУслуги()

	Если Элементы.Услуги.ТекущиеДанные = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(Элементы.Услуги.ТекущиеДанные.Сделка) Тогда
		
		Элементы.УслугиКонтекстноеМенюОткрытьСделку.Видимость = Ложь;
	Иначе
		Элементы.УслугиКонтекстноеМенюОткрытьСделку.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 07.09.2022 US49022
&НаКлиенте
Процедура СоздатьЗапросНеурегулированныеРасходы(Команда)
	
	ВыбранныеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("Выбрать", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны строки для создания запроса!");
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ОтработкаВРИТМ = ПредопределенноеЗначение("Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ");
	
	АкцептыВыбранныхСтрок = Новый Массив;
	ИдентификаторыСтрокАкцепта = Новый Массив;
	МассивУслуги = Новый Массив;
	МассивКонтейнеры = Новый Массив;
	МассивВагоны = Новый Массив;

	Для Каждого Стр Из ВыбранныеСтроки Цикл
		
		ИндексСтроки = Формат(Стр.НомерСтроки - 1, "ЧГ=0");
		//Если выбраны строки по нескольким акцептам, то создавать запрос нельзя
		Если ЗначениеЗаполнено(Стр.Сделка) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя создать запрос причины неурег. расхода по акцептованной строке!",, "Услуги["+ИндексСтроки+"].Выбрать", "Объект", Отказ);
		ИначеЕсли Стр.Неурег = ОтработкаВРИТМ Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя создать запрос причины неурег. расхода по строке, переданной в РИТМ!",, "Услуги["+ИндексСтроки+"].Выбрать", "Объект", Отказ);
		ИначеЕсли ЗначениеЗаполнено(Стр.ПричинаНеакцепта) Или ЗначениеЗаполнено(Стр.СуммаПретензии) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя создать запрос причины неурег. расхода по строке с претензией!",, "Услуги["+ИндексСтроки+"].Выбрать", "Объект", Отказ);
		ИначеЕсли ЗначениеЗаполнено(Стр.ГУИДТемы) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("По строке уже создан запрос причины неурег расходов!",, "Услуги["+ИндексСтроки+"].Выбрать", "Объект", Отказ);
		КонецЕсли;
		
		Если Не Отказ Тогда
			ИдентификаторыСтрокАкцепта.Добавить(Стр.ГУИД);
			МассивУслуги.Добавить(Стр.Номенклатура);
			МассивКонтейнеры.Добавить(Новый Структура("Контейнер, НеурегПричинаПользователя", Стр.Контейнер, Стр.НеурегПричинаУказаннаяПользователем));
			МассивВагоны.Добавить(Новый Структура("Вагон, НеурегПричинаПользователя", Стр.Вагон, Стр.НеурегПричинаУказаннаяПользователем));
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СоздатьНовыйДиалог", Истина);	
		ПараметрыФормы.Вставить("КонтекстТемы", Объект.Поступление);
		ПараметрыФормы.Вставить("ИдентификаторыСтрокАкцепта", ИдентификаторыСтрокАкцепта);
		
		ТемаДиалога = СформироватьТемуДиалога(МассивУслуги, МассивКонтейнеры, МассивВагоны);
		ПараметрыФормы.Вставить("ТемаНовогоДиалога", ТемаДиалога);
		
		ОткрытьФорму("Обработка.Диалоги.Форма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 07.09.2022 US49022
&НаСервереБезКонтекста
Функция СформироватьТемуДиалога(Услуги, Контейнеры, Вагоны)
	
	Возврат Обработки.АРМНеурегулированныеРасходы.СформироватьТемуДиалога(Услуги, Контейнеры, Вагоны);
	
КонецФункции

&НаКлиенте
Процедура УслугиСтанцияОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	//Евросиб - АСуслов 30.06.2023 13:06:41 #локации
	//(
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияОтправления) Тогда
		ТекДанные.СтанцияОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	//)
	//Евросиб - АСуслов 30.06.2023 13:06:43 #локации
	ТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ТекДанные.Номенклатура);
	
	Если ЗначениеЗаполнено(ТипыЛокаций) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораСтанцииОтправления = Новый ОписаниеОповещения("ОбработкаВыбораСтанцииОтправления", ЭтаФорма);	
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса, Отбор", Ложь, Истина, Новый Структура("Тип", ТипыЛокаций)),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораСтанцииОтправления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораСтанцииОтправления", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
		
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцияНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	//Евросиб - АСуслов 30.06.2023 13:06:41 #локации
	//(
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияНазначения) Тогда
		ТекДанные.СтанцияНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	//)
	//Евросиб - АСуслов 30.06.2023 13:06:43 #локации
	ТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ТекДанные.Номенклатура);
	
	Если ЗначениеЗаполнено(ТипыЛокаций) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораСтанцииНазначения = Новый ОписаниеОповещения("ОбработкаВыбораСтанцииНазначения", ЭтаФорма);	
	//(
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса, Отбор", Ложь, Истина, Новый Структура("Тип", ТипыЛокаций)),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораСтанцииНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораСтанцииНазначения", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
		
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

//Евросиб Каблов 20.12.2022 62430
&НаКлиенте
Процедура ОбработкаВыбораСтанцииОтправления(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = Элементы.УслугиСтанцияОтправления;
	УслугиСтанцияОтправленияОбработкаВыбора(ТекЭлемент, ВыбранноеЗначение, Истина);
	УслугиПриИзменении(Элементы.Услуги);
	
КонецПроцедуры

//Евросиб Каблов 20.12.2022 62430
&НаКлиенте
Процедура ОбработкаВыбораСтанцииНазначения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = Элементы.УслугиСтанцияОтправления;
	УслугиСтанцияНазначенияОбработкаВыбора(ТекЭлемент, ВыбранноеЗначение, Истина);
	УслугиПриИзменении(Элементы.Услуги);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцияОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Номенклатура, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если ЛокацияСоответствуетУслуге Тогда
		ТекДанные.СтанцияОтправления = ВыбранноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = СтрШаблон("В строке №%1 тип выбранной станции отправления %2 не соответствует доступным типам локаций услуги. Доступные типы локаций: %3", ТекДанные.НомерСтроки, СтрокаТипЛокации, СтрокаДоступныеТипы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", ТекДанные.НомерСтроки, "СтанцияОтправления"), "Объект");
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцияНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Номенклатура, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если ЛокацияСоответствуетУслуге Тогда
		ТекДанные.СтанцияНазначения = ВыбранноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = СтрШаблон("В строке №%1 тип выбранной станции назначения %2 не соответствует доступным типам локаций услуги. Доступные типы локаций: %3", ТекДанные.НомерСтроки, СтрокаТипЛокации, СтрокаДоступныеТипы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", ТекДанные.НомерСтроки, "СтанцияНазначения"), "Объект");
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

// ++ ДИТ_Агафонов_task 41390 п6.6
Функция НайтиПоступлениеИсходноеРекурсивно(КорректировкаПоступления)
	ДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорректировкаПоступления,"ДокументПоступления");
	Если ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Возврат ДокументПоступления;	
	Иначе
		ДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления,"ДокументПоступления");
		Возврат ДокументПоступления;	
	КонецЕсли;
КонецФункции // ()

&НаСервере
Функция ОпределениеЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах()

	Если ТипЗнч(Объект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Поступление,"ВидОперации") = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки	
		Тогда
		ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах = Истина;			
	Иначе	
		ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах = Ложь;			
	КонецЕсли;
	
	Возврат ЭтоКорректировкаПоступленияВидОперацииИсправлениеВПервичныхДокументах;

КонецФункции // ()
// -- ДИТ_Агафонов_task 41390

// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 14.07.2023
&НаКлиенте
Процедура н_ДобавитьУслугиЗаСчетЧП(Команда)
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, Новый Структура("ВариантРазнесения", ПредопределенноеЗначение("Перечисление.ВариантыРазнесенияЗатрат.УслугиЗаСчетЧП")));
	ПараметрыФормы = Новый Структура("УслугиЗаСчетЧистойПрибыли, СписокСтрок, ПериодУУ", 
		Истина, МассивВыделенныхСтрок, ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Поступление,"ДатаВходящегоДокумента"));
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку",ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//Евросиб Каблов 31.07.2023 #64831
&НаКлиенте
Процедура ПодобратьЖДРейс(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Поступление", Объект.Поступление);
	ПараметрыФормы.Вставить("Акцепт", Объект.Ссылка);
	
	АдресТаблицыУслуг = ПолучитьАдресТаблицыУслугДляПодбораРейсов();
	ПараметрыФормы.Вставить("АдресТаблицыУслуг", АдресТаблицыУслуг);
	
	ОповещениеОПодбореЖДРейсов = Новый ОписаниеОповещения("ОбработкаПодбораЖДРейсов", ЭтаФорма);
	
	ОткрытьФорму("Документ.Акцепт.Форма.ПодборРейсов", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОПодбореЖДРейсов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Евросиб Каблов 31.07.2023 #64831
&НаСервере
Функция ПолучитьАдресТаблицыУслугДляПодбораРейсов()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	ВыгружаемыеРеквизиты.Добавить("НомерСтроки");
	ВыгружаемыеРеквизиты.Добавить("Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("Содержание");
	ВыгружаемыеРеквизиты.Добавить("СтанцияОтправления");
	ВыгружаемыеРеквизиты.Добавить("СтанцияНазначения");
	ВыгружаемыеРеквизиты.Добавить("Рейс");
	ВыгружаемыеРеквизиты.Добавить("ДатаОтправленияКП");
	ВыгружаемыеРеквизиты.Добавить("Контейнер");
	ВыгружаемыеРеквизиты.Добавить("ТранспортныйДокумент");
	ВыгружаемыеРеквизиты.Добавить("СписокТД");
	ВыгружаемыеРеквизиты.Добавить("ПоступлениеЦена");
	ВыгружаемыеРеквизиты.Добавить("ПоступлениеСтавкаНДС");
	ВыгружаемыеРеквизиты.Добавить("ПоступлениеСумма");
	ВыгружаемыеРеквизиты.Добавить("ПоступлениеСуммаНДС");
	ВыгружаемыеРеквизиты.Добавить("Неурег");
	ВыгружаемыеРеквизиты.Добавить("НеурегКомментарий");
	ВыгружаемыеРеквизиты.Добавить("НеурегПричинаУказаннаяПользователем");
	ВыгружаемыеРеквизиты.Добавить("ГУИД");
	ВыгружаемыеРеквизиты.Добавить("ИдентификаторСтрокиПоступления");	
	СтрокаВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сделка", Документы.Сделка.ПустаяСсылка());
	
	ТаблицаАкцепта = Объект.Услуги.Выгрузить(ПараметрыОтбора, СтрокаВыгружаемыеРеквизиты);
	
	ПараметрыОтбора.Очистить();
	ПараметрыОтбора.Вставить("Неурег", Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ);
	СтрокиКУдалению = ТаблицаАкцепта.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из СтрокиКУдалению Цикл
		ТаблицаАкцепта.Удалить(Стр);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаАкцепта, УникальныйИдентификатор);
	
КонецФункции

//Евросиб Каблов 31.07.2023 #64831
&НаКлиенте
Процедура ОбработкаПодбораЖДРейсов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда		
		Для Каждого Стр Из Результат Цикл
			СтрокиУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ГУИД", Стр.ГУИД));
			Для Каждого СтрУслуги Из СтрокиУслуг Цикл
				СтрУслуги.Рейс = Стр.Рейс;
			КонецЦикла;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Евросиб US 83437 Рыбьяков К.А. 15.07.2024 ((
&НаСервере
Процедура ПроверитьСтрокиДляОтложенногоИзменения(Строка)
	
	ТаблицаРанееЗагруженныхСтрок = ДанныеДляДобавленияВАкцепт.Получить();
	НайденныеСтроки = ТаблицаРанееЗагруженныхСтрок.НайтиСтроки(Новый Структура("Гуид", Строка.Гуид));
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		ТаблицаРанееЗагруженныхСтрок.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Если ТаблицаРанееЗагруженныхСтрок.Количество() = 0 Тогда
		ДанныеДляДобавленияВАкцепт = Неопределено;
	Иначе
		ДанныеДляДобавленияВАкцепт = Новый ХранилищеЗначения(ТаблицаРанееЗагруженныхСтрок);
	КонецЕсли;
	
КонецПроцедуры

// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. 25.12.2024
&НаКлиенте
Процедура УслугиПоступлениеСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ПоступлениеСуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекДанные.ПоступлениеСумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекДанные.ПоступлениеСтавкаНДС), Истина, Истина);
	КонецЕсли;
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
&НаСервереБезКонтекста
Функция ВключитьБлокировкуОчередиОтложенногоИзмененияНаСервере( Ссылка, ВремяОтключения )
	РегистрыСведений.ВременныеИсключенияОчередиОтложенногоИзменения.ДобавитьОбъектДляИсключения(Ссылка, ВремяОтключения);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
&НаКлиенте
Процедура ОтключитьБлокировкуОчереди(Команда)
	ВключитьОбработкуОчередьюОтложенногоИзмененияНаСервере( Объект.Ссылка );
	ОбновлениеТаймераИсключенияОчередиОтложенногоИзменения();
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
&НаСервереБезКонтекста
Процедура ВключитьОбработкуОчередьюОтложенногоИзмененияНаСервере( Ссылка )
	РегистрыСведений.ВременныеИсключенияОчередиОтложенногоИзменения.УбратьОбъектИзИсключения(Ссылка);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
&НаСервереБезКонтекста
Функция ПолучитьСтатусВременногоИсключения( Ссылка )
	Возврат РегистрыСведений.ВременныеИсключенияОчередиОтложенногоИзменения.ПолучитьСтатусПоОбъекту(Ссылка);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
&НаКлиенте
Процедура ЗапроситьАннулированиеОК(Команда)
	
	МассивСтрок = Новый Массив;
	ВыполнитьДействиеАннулированиеОК(Истина);
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
&НаКлиенте
Процедура ВыполнитьДействиеАннулированиеОК(Действие)
	
	МассивСтрок = Новый Массив;
	МассивСделок = Новый Массив;
	Для каждого Стр из Объект.Услуги.НайтиСтроки(Новый Структура("Выбрать", Истина)) Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.УчДокумент) Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Стр.УчДокумент) <> Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок.Добавить(Новый Структура("Сделка, УчДокумент", Стр.Сделка, Стр.УчДокумент));
		МассивСделок.Добавить(Стр.Сделка);
	КонецЦикла;
	
	Если МассивСтрок.Количество() > 0 Тогда
		ДанныеОбработки = ЗаписатьЗадачиАннулированияОК(МассивСтрок, МассивСделок, Действие);
		СтрокаСделокЗаписано = ?(ДанныеОбработки.МассивСделокЗаписано.Количество() = 0, "", "Записаны сделки: "+СтрСоединить(ДанныеОбработки.МассивСделокЗаписано));
		СтрокаСделокОшибкаЗаписи = ?(ДанныеОбработки.МассивСделокОшибка.Количество() = 0, "", "Не удалось записать сделки: "+СтрСоединить(ДанныеОбработки.МассивСделокОшибка));
		СтрокаСообщения = СтрокаСделокЗаписано + Символы.ПС + СтрокаСделокОшибкаЗаписи;
		ПоказатьПредупреждение(, СтрокаСообщения, 30);
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
&НаСервереБезКонтекста
Функция ЗаписатьЗадачиАннулированияОК(МассивСтрок, МассивСделок, Значение)
	
	МассивСделокЗаписано = Новый Массив;
	МассивСделокОшибка = Новый Массив;
	
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивСделок);
	
	Для Каждого текСделка Из МассивСделок Цикл
		
		СделкаОбъект = текСделка.ПолучитьОбъект();
		Для Каждого текСтрока Из МассивСтрок Цикл
			Если текСтрока.Сделка <> текСделка Тогда
				Продолжить;
			КонецЕсли;
			ДоходыСделки = СделкаОбъект.Доходы.НайтиСтроки(Новый Структура("УчДокумент", текСтрока.УчДокумент));
			Для Каждого строкаДохода Из ДоходыСделки Цикл
				строкаДохода.ТребуетсяАннулироватьОтчетКомитенту = Значение;
			КонецЦикла;
		КонецЦикла;
		Попытка
			СделкаОбъект.Записать();
			МассивСделокЗаписано.Добавить(СделкаОбъект.Номер);
		Исключение
			МассивСделокОшибка.Добавить(СделкаОбъект.Номер);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Новый Структура("МассивСделокЗаписано, МассивСделокОшибка", МассивСделокЗаписано, МассивСделокОшибка);
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
&НаКлиенте
Процедура ОтозватьЗапросАннулированияОК(Команда)
	ВыполнитьДействиеАннулированиеОК(Ложь);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец  

//Евросиб Пирожкова( 30.07.2025 Ticket№0406736 
&НаКлиенте
Процедура ПроверитьВыгрузкуВУПП(Команда)
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаВыгрузка", ЭтаФорма, НеЗаписан);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой акцепта его необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе		
		ОбработкаВопросаВыгрузка(КодВозвратаДиалога.Да, НеЗаписан); 
		ПроверитьВыгрузкуВУППСервер();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВопросаВыгрузка(Ответ = неопределено, НеЗаписан) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Если НеЗаписан Тогда
		АкцептПровелся = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Если Не АкцептПровелся Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести акцепт.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьВыгрузкуВУППСервер()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьВыгрузкуВУПП();
	
КонецПроцедуры
// Евросиб Пирожкова 30.07.2025)
