
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Евросиб Фролов (08.02.2022 Task №45961
	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени("АвторазнесениеКлиент",,Ложь);
	// Евросиб Фролов)	
	
	//Евросиб Каблов 22.08.2022 ( US55531
	ПараметрКоманды = ПолучитьДокументыДоступныеДляАвторазнесения(ПараметрКоманды);
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 22.08.2022 )
	
	// Евросиб Фролов (08.02.2022 Task №45961
	//ПретензииИНеакцептыСервер.РазнестиСписокПТУ(ПараметрКоманды);
	//Сообщить("Задача выполнена!");
	ВыполнениеКомандКлиент.ВыполнитьКомандуОднократноеРазнесение(ПараметрКоманды, ПараметрыВыполненияКоманды, УИДЗамера);
	// Евросиб Фролов)
	
КонецПроцедуры

//Евросиб Каблов 22.08.2022 US55531
&НаСервере
Функция ПолучитьДокументыДоступныеДляАвторазнесения(МассивДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка КАК Ссылка,
	|	КорректировкаПоступления.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|		ИЛИ КорректировкаПоступления.КорректироватьСуммыВПервичномВСФ КАК АвторазнесениеДоступно,
	|	КорректировкаПоступления.Номер КАК Номер,
	|	КорректировкаПоступления.Дата КАК Дата
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Ссылка В(&МассивДокументов)";	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	СписокНедоступных = ТаблицаДокументов.НайтиСтроки(Новый Структура("АвторазнесениеДоступно", Ложь));		
	Для Каждого Док Из СписокНедоступных Цикл
		ТекстСообщения = СтрШаблон("Корректировочный ВСФ №%1 от %2 необходимо разносить вручную. Постановка на авторазнесение запрещена.", Док.Номер, Док.Дата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ТаблицаДокументов.Удалить(Док);
	КонецЦикла;
	
	МассивДоступных = ТаблицаДокументов.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивДоступных;
	
КонецФункции