
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПСЦ") Тогда
		ИсходныйПСЦ = Параметры.ПСЦ;
	КонецЕсли;
	
	ЗаполнитьОтборыИКалькуляции();
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПунктыНазначенияОтборВыбратьПриИзменении(Элемент)
	ВыполнитьОтборКалькуляций();
КонецПроцедуры

&НаКлиенте
Процедура ПунктыОтправленияОтборВыбратьПриИзменении(Элемент)
	ВыполнитьОтборКалькуляций();
КонецПроцедуры

&НаКлиенте
Процедура РазмерКТКОтборВыбратьПриИзменении(Элемент)
	ВыполнитьОтборКалькуляций();
	ОбновитьДоступныеПункты();
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежностьТЕПриИзменении(Элемент)
	ВыполнитьОтборКалькуляций();
	ОбновитьДоступныеПункты();
КонецПроцедуры

&НаКлиенте
Процедура РазмерКТКВКалькуляцияхПриИзменении(Элемент)
	ВыполнитьОтборКалькуляций();
КонецПроцедуры

&НаКлиенте
Процедура ИсходныйПСЦПриИзменении(Элемент)
	ЗаполнитьОтборыИКалькуляции();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)
	СкопироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОтборыИКалькуляции()
	
	ПринадлежностьТЕОтбор.Очистить();
	РазмерКТКОтбор.Очистить();
	ПунктыНазначенияОтбор.Очистить();
	ПунктыОтправленияОтбор.Очистить();
	СписокКалькуляций.Очистить();
	НовыеКопии.Очистить();
	
	НоваяСтрока = ПринадлежностьТЕОтбор.Добавить();
	НоваяСтрока.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
	
	НоваяСтрока = ПринадлежностьТЕОтбор.Добавить();
	НоваяСтрока.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента;
	
	НоваяСтрока = РазмерКТКОтбор.Добавить();
	НоваяСтрока.РазмерКТК = "20";
		
	НоваяСтрока = РазмерКТКОтбор.Добавить();
	НоваяСтрока.РазмерКТК = "40";
	
	ВсеПунктыНазначения = ПунктыНазначения();
	ВсеПунктыОтправления = ПунктыОтправления();
	
	Для Каждого Пункт Из ВсеПунктыНазначения Цикл
		НоваяСтрока = ПунктыНазначенияОтбор.Добавить();
		НоваяСтрока.ПунктНазначения = Пункт;
	КонецЦикла;
	
	Для Каждого Пункт Из ВсеПунктыОтправления Цикл
		НоваяСтрока = ПунктыОтправленияОтбор.Добавить();
		НоваяСтрока.ПунктОтправления = Пункт;
	КонецЦикла;
		
	ВсеКалькуляции = ИсходныйПСЦ.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция");
	
	Номер = 1;
	Для Каждого Калькуляция Из ВсеКалькуляции Цикл
		НоваяСтрока = СписокКалькуляций.Добавить();
		НоваяСтрока.НомерСтроки = Номер;
		НоваяСтрока.Калькуляция = Калькуляция;
		Номер = Номер + 1
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере()

	ЗапросСхемыКалькуляций = Новый Запрос;
	ЗапросСхемыКалькуляций.Текст = "ВЫБРАТЬ
	|	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	|	ТехнологическаяСхема.Вариант КАК Вариант,
	|	ТехнологическаяСхема.ТСх КАК ТСх
	|ИЗ
	|	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	|ГДЕ
	|	ТехнологическаяСхема.ПредметТСх = &ПредметТСх";
	
	Для Каждого Клиент Из НовыеКопии Цикл
		
		РеквизитыИсходныйПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйПСЦ, "НачалоДействия");
		
		Если ЗначениеЗаполнено(Клиент.НовыйПСЦ) ИЛИ НЕ ЗначениеЗаполнено(Клиент.НовыйКлиент) ИЛИ НЕ ЗначениеЗаполнено(Клиент.НовыйДоговор) Тогда
			Сообщить("В строке " + Клиент.НовыйКлиент + " указан ПСЦ или не указан контрагент. Строка пропущена.");
			Продолжить; 
		КонецЕсли;
		
		НовыйПСЦ = ИсходныйПСЦ.Скопировать();
		НовыйПСЦ.Контрагент = Клиент.НовыйКлиент;
		НовыйПСЦ.Договор = Клиент.НовыйДоговор;
		НовыйПСЦ.НачалоДействия = РеквизитыИсходныйПСЦ.НачалоДействия;
		НовыйПСЦ.Дата = ТекущаяДата();
		НовыйПСЦ.Состояния.Очистить();
		
		НовыйПСЦ.Калькуляции.Очистить();
		НовыйПСЦ.КалькуляцииПовагонки.Очистить();
		
		Для каждого Кальк Из СписокКалькуляций Цикл
			
			РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Кальк.Калькуляция, "УчетноеНаправление, ТипКалькуляции");
			
			НовКальк = Кальк.Калькуляция.Скопировать();
			НовКальк.Автор = Пользователи.ТекущийПользователь();
			НовКальк.Дата = ТекущаяДата();
			НовКальк.Контрагент = Клиент.НовыйКлиент;
			НовКальк.Договор = Клиент.НовыйДоговор;
			НовКальк.УчетноеНаправление = РеквизитыКалькуляции.УчетноеНаправление;
			НовКальк.ТипКалькуляции = РеквизитыКалькуляции.ТипКалькуляции;
			НовКальк.Состояния.Очистить();
			НовКальк.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗапросСхемыКалькуляций.УстановитьПараметр("ПредметТСх", Кальк.Калькуляция);
			ОтветСхемы = ЗапросСхемыКалькуляций.Выполнить().Выбрать();
			Пока ОтветСхемы.Следующий() Цикл
				ТСхКопия = ПостроительТСх_сервер.СкопироватьТСх(ОтветСхемы.ТСх);
				
				МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
				МЗ.Вариант = ОтветСхемы.Вариант + "_" + Прав(ТСхКопия.Код, 7);
				МЗ.ПредметТСх = НовКальк.Ссылка;
				МЗ.ТСх = ТСхКопия;
				МЗ.Записать(Истина);
			КонецЦикла;
			
			НовыйПСЦ.ДоступныеКалькуляцииНотиса.Добавить().Калькуляция = НовКальк.Ссылка;
			НовыйПСЦ.Калькуляции.Добавить().Калькуляция = НовКальк.Ссылка;
			
		КонецЦикла;
		
		НовыйПСЦ.Записать(РежимЗаписиДокумента.Проведение);
		Клиент.НовыйПСЦ = НовыйПСЦ.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтборКалькуляций()
	
	ВсеКалькуляции = ИсходныйПСЦ.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция");
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Калькуляция.Ссылка КАК Калькуляция
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО (Калькуляция.Ссылка = КалькуляцияСписокСтанцийНазначения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
	|		ПО (Калькуляция.Ссылка = КалькуляцияСписокСтанцийОтправления.Ссылка)
	|ГДЕ
	|	Калькуляция.Ссылка В(&Калькуляции)
	|	И (Калькуляция.ТарифицируемыйРазмерКТК В(&ТарифицируемыйРазмерКТК)
	|		ИЛИ Калькуляция.ТарифицируемыйРазмерКТК = ""2040"") 
	|	И (КалькуляцияСписокСтанцийОтправления.Станция В (&СтанцииОтправлений)
	|		ИЛИ Калькуляция.Суша_ПунктОтправления В (&СтанцииОтправлений))
	| 	И (КалькуляцияСписокСтанцийНазначения.Станция В (&СтанцииНазначений)
	|		ИЛИ Калькуляция.Суша_ПунктНазначения В (&СтанцииНазначений))";
	
	Для Каждого Принадлежность Из ПринадлежностьТЕОтбор Цикл
		Если Принадлежность.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба И Принадлежность.Выбрать = Истина Тогда
			Запрос.Текст = Запрос.Текст + " И (Калькуляция.веб_ДляКТКЕвросиб = Истина)";
		КонецЕсли;
		Если Принадлежность.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента И Принадлежность.Выбрать = Истина Тогда
			Запрос.Текст = Запрос.Текст + " И (Калькуляция.веб_ДляКТККлиента = Истина)";
		КонецЕсли;	
	КонецЦикла;
	
	РазмерыКТКВКалькуляцияхСтрокой = Новый Массив;
	Для Каждого Размер Из РазмерКТКОтбор Цикл
		Если Размер.Выбрать = Истина Тогда
			РазмерыКТКВКалькуляцияхСтрокой.Добавить(Размер.РазмерКТК);
		КонецЕсли;
	КонецЦикла;
	Если РазмерыКТКВКалькуляцияхСтрокой.Количество() = 0 Тогда
		РазмерыКТКВКалькуляцияхСтрокой.Добавить("20");
		РазмерыКТКВКалькуляцияхСтрокой.Добавить("40");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Калькуляции", ВсеКалькуляции);
	Запрос.УстановитьПараметр("ТарифицируемыйРазмерКТК", РазмерыКТКВКалькуляцияхСтрокой);
	
	ВыбранныеПунктыНазначения = Новый Массив;
	ВыбранныеПунктыОтправления = Новый Массив;
	
	Для Каждого Пункт Из ПунктыОтправленияОтбор Цикл
		Если Пункт.Выбрать = Истина Тогда
			ВыбранныеПунктыОтправления.Добавить(Пункт.ПунктОтправления);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Пункт Из ПунктыНазначенияОтбор Цикл
		Если Пункт.Выбрать = Истина Тогда
			ВыбранныеПунктыНазначения.Добавить(Пункт.ПунктНазначения);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныеПунктыНазначения.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("СтанцииНазначений", ПунктыНазначения());
	Иначе
		Запрос.УстановитьПараметр("СтанцииНазначений", ВыбранныеПунктыНазначения);
	КонецЕсли;
	Если ВыбранныеПунктыОтправления.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("СтанцииОтправлений", ПунктыОтправления());
	Иначе
		Запрос.УстановитьПараметр("СтанцииОтправлений", ВыбранныеПунктыОтправления);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокКалькуляций.Очистить();
	Номер = 1;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокКалькуляций.Добавить();
		НоваяСтрока.НомерСтроки = Номер;
		НоваяСтрока.Калькуляция = Выборка.Калькуляция;
		Номер = Номер + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПунктыОтправления()
	
	ВсеКалькуляции = ИсходныйПСЦ.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция");
	ОтправленияКалькуляций = Новый Массив;

	Для Каждого Калькуляция Из ВсеКалькуляции Цикл
		
		Станции = Калькуляция.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция");
		Суша_ПунктОтправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "Суша_ПунктОтправления");
		
		Если ЗначениеЗаполнено(Суша_ПунктОтправления) Тогда
			Станции.Добавить(Суша_ПунктОтправления);
		КонецЕсли;
		
		Для Каждого Станция Из Станции Цикл
			ОтправленияКалькуляций.Добавить(Станция);
		КонецЦикла;
		
	КонецЦикла;
	
	ОтправленияКалькуляций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОтправленияКалькуляций);
	
	Возврат ОтправленияКалькуляций;
	
КонецФункции

&НаСервере
Функция ПунктыНазначения()
	
	ВсеКалькуляции = ИсходныйПСЦ.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция");
	НазначенияКалькуляций = Новый Массив;
	
	Для Каждого Калькуляция Из ВсеКалькуляции Цикл
		
		Станции = Калькуляция.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция");
		Суша_ПунктНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "Суша_ПунктНазначения");
		
		Если ЗначениеЗаполнено(Суша_ПунктНазначения) Тогда
			Станции.Добавить(Суша_ПунктНазначения);
		КонецЕсли;
		
		Для Каждого Станция Из Станции Цикл
			НазначенияКалькуляций.Добавить(Станция);
		КонецЦикла;
		
	КонецЦикла;
	
	НазначенияКалькуляций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НазначенияКалькуляций);
	
	Возврат НазначенияКалькуляций;
	
КонецФункции

&НаСервере
Процедура ОбновитьДоступныеПункты()
	
	Если СписокКалькуляций.Количество() = 0 Тогда
		ПунктыНазначенияОтбор.Очистить();
		ПунктыОтправленияОтбор.Очистить();
		Возврат;
	КонецЕсли;
	
	ВыбранныеПунктыНазначения = Новый Массив;
	ВыбранныеПунктыОтправления = Новый Массив;
	СтанцииОтправленияПослеОтбора = Новый Массив;
	СтанцииНазначенияПослеОтбора = Новый Массив;
	
	Для Каждого Пункт Из ПунктыОтправленияОтбор Цикл
		Если Пункт.Выбрать = Истина Тогда
			ВыбранныеПунктыОтправления.Добавить(Пункт.ПунктОтправления);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Пункт Из ПунктыНазначенияОтбор Цикл
		Если Пункт.Выбрать = Истина Тогда
			ВыбранныеПунктыНазначения.Добавить(Пункт.ПунктНазначения);
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого Калькуляция Из СписокКалькуляций Цикл
		СтанцииОтправления = Калькуляция.Калькуляция.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция");
		Суша_ПунктОтправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция.Калькуляция, "Суша_ПунктОтправления");
		Если ЗначениеЗаполнено(Суша_ПунктОтправления) Тогда
			СтанцииОтправления.Добавить(Суша_ПунктОтправления);
		КонецЕсли;
		Для Каждого Станция Из СтанцииОтправления Цикл
			СтанцииОтправленияПослеОтбора.Добавить(Станция);
		КонецЦикла;
		
		СтанцииНазначения = Калькуляция.Калькуляция.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция");
		Суша_ПунктНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция.Калькуляция, "Суша_ПунктНазначения");
		Если ЗначениеЗаполнено(Суша_ПунктНазначения) Тогда
			СтанцииНазначения.Добавить(Суша_ПунктНазначения);
		КонецЕсли;
		Для Каждого Станция Из СтанцииНазначения Цикл
			СтанцииНазначенияПослеОтбора.Добавить(Станция);
		КонецЦикла;
	КонецЦикла;
	
	СтанцииОтправленияПослеОтбора = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтанцииОтправленияПослеОтбора);
	СтанцииНазначенияПослеОтбора = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтанцииНазначенияПослеОтбора);
		
	ПунктыНазначенияОтбор.Очистить();
	ПунктыОтправленияОтбор.Очистить();
	Для Каждого Пункт Из СтанцииОтправленияПослеОтбора Цикл
		НоваяСтрока = ПунктыОтправленияОтбор.Добавить();
		НоваяСтрока.ПунктОтправления = Пункт;
		Если ВыбранныеПунктыОтправления.Найти(Пункт) <> Неопределено Тогда
			НоваяСтрока.Выбрать = Истина;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Пункт Из СтанцииНазначенияПослеОтбора Цикл
		НоваяСтрока = ПунктыНазначенияОтбор.Добавить();
		НоваяСтрока.ПунктНазначения = Пункт;
		Если ВыбранныеПунктыНазначения.Найти(Пункт) <> Неопределено Тогда
			НоваяСтрока.Выбрать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти