
&НаКлиенте
Процедура ВставитьИзEXCEL(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхПозиций(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	ТаблицаВагонов.Очистить();
	Для каждого Стр из параметр1 Цикл
		НовСтр = ТаблицаВагонов.Добавить();
		НовСтр.НомерВагона = Стр;
		НовСтр.ЦФО = ЦФОПользователя;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВагоны(Команда)
	
	Если ИсточникДобавления = "АРМ_Логист" Тогда
		// записываем в регистр
		ЗаписатьВРС();
		Закрыть(ТаблицаВагонов);
	Иначе
		СтрокиБезЦФО = ТаблицаВагонов.НайтиСтроки(Новый Структура("ЦФО", ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка")));
		Если СтрокиБезЦФО.Количество() > 0 Тогда
			ПоказатьПредупреждение(, "Поле ЦФО обязательно для заполнения. Есть строки где ЦФО не выбран.");
			Возврат;
		КонецЕсли;
		Закрыть(ТаблицаВагонов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРС()
	
	Для Каждого Стр Из ТаблицаВагонов Цикл

		Если РежимДобавленияВагонов = 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
			               |ГДЕ
			               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
			
			Запрос.УстановитьПараметр("Вагон", Стр.НомерВагона);
			ИмяРегистра = "ВагоныЗапланированныеКПовагонке";
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
			               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
			               |ИЗ
			               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
			               |			,
			               |			Вагон = &Вагон) КАК ПовагонныеОтправкиСрезПоследних";
			
			Запрос.УстановитьПараметр("Вагон", Стр.НомерВагона);
			ИмяРегистра = "ПовагонныеОтправки";
		КонецЕсли;
		
		РЗ = Запрос.Выполнить();
		Если НЕ РЗ.Пустой() Тогда
			
			Продолжить;
			
		Иначе
			// если записи нет, создать новую
			ТекЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись,Стр);
			ТекЗапись.Вагон = Стр.НомерВагона;
			Если ИмяРегистра = "ПовагонныеОтправки" Тогда
				ТекЗапись.Период = ТекущаяДата();
				ТекЗапись.ОтветственныйВнесДанные = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			// получить данные по вагону из дислокации
			ЗапросДисл = Новый Запрос;
			ЗапросДисл.Текст = "ВЫБРАТЬ
			                   |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
			                   |	ДислокацияВагонов.Вагон КАК Вагон
			                   |ПОМЕСТИТЬ МаксПериод
			                   |ИЗ
			                   |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
			                   |ГДЕ
			                   |	ДислокацияВагонов.Вагон = &Вагон
			                   |	И ДислокацияВагонов.Период >= &Период
			                   |
			                   |СГРУППИРОВАТЬ ПО
			                   |	ДислокацияВагонов.Вагон
			                   |;
			                   |
			                   |////////////////////////////////////////////////////////////////////////////////
			                   |ВЫБРАТЬ
			                   |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
			                   |	ДислокацияВагонов.Вагон КАК Вагон,
			                   |	МАКСИМУМ(ДислокацияВагонов.ОперацияСВагоном) КАК ОперацияСВагоном
			                   |ПОМЕСТИТЬ ОперВаг
			                   |ИЗ
			                   |	МаксПериод КАК МаксПериод
			                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
			                   |		ПО МаксПериод.Период = ДислокацияВагонов.Период
			                   |			И МаксПериод.Вагон = ДислокацияВагонов.Вагон
			                   |
			                   |СГРУППИРОВАТЬ ПО
			                   |	ДислокацияВагонов.Вагон
			                   |;
			                   |
			                   |////////////////////////////////////////////////////////////////////////////////
			                   |ВЫБРАТЬ
			                   |	ДислокацияВагонов.Период КАК Период2,
			                   |	ДислокацияВагонов.Вагон КАК Вагон,
			                   |	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
			                   |	ДислокацияВагонов.РабочийПарк КАК РабочийПарк,
			                   |	ДислокацияВагонов.Груженый КАК Груженый,
			                   |	ДислокацияВагонов.НомерПоезда КАК НомерПоезда,
			                   |	ДислокацияВагонов.ИндексПоезда КАК ИндексПоезда,
			                   |	ДислокацияВагонов.КодГрузоотправителя КАК КодГрузоотправителя,
			                   |	ДислокацияВагонов.КодГрузополучателя КАК КодГрузополучателя,
			                   |	ДислокацияВагонов.Собственник КАК Собственник,
			                   |	ДислокацияВагонов.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
			                   |	ДислокацияВагонов.Груз КАК Груз,
			                   |	ДислокацияВагонов.ВесГруза КАК ВесГруза,
			                   |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации,
			                   |	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
			                   |	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления,
			                   |	ДислокацияВагонов.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
			                   |	ДислокацияВагонов.ПростойНаСтанции КАК ПростойНаСтанции,
			                   |	ДислокацияВагонов.ДатаОтправленияСоСтанции КАК ДатаОтправления
			                   |ИЗ
			                   |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
			                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОперВаг КАК ОперВаг
			                   |		ПО ДислокацияВагонов.Период = ОперВаг.Период
			                   |			И ДислокацияВагонов.Вагон = ОперВаг.Вагон
			                   |			И ДислокацияВагонов.ОперацияСВагоном = ОперВаг.ОперацияСВагоном";
			ЗапросДисл.УстановитьПараметр("Вагон",Стр.НомерВагона);
			ЗапросДисл.УстановитьПараметр("Период",Стр.ДатаПередачиВПользование);
			
			ОтветДисл = ЗапросДисл.Выполнить().Выбрать();
			Если ОтветДисл.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ТекЗапись,ОтветДисл);
			КонецЕсли;
			
			ТекЗапись.Записать();
			
		КонецЕсли;
		
		мз = РегистрыСведений.ВагоныЗапрошенныеВПовагонку.СоздатьМенеджерЗаписи();
		мз.Вагон = Стр.НомерВагона;
		мз.Прочитать();
		Если мз.Выбран() Тогда
			мз.Удалить();
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВагоновКлиентПриИзменении(Элемент)
	
	ТекД = Элементы.ТаблицаВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// очищаем договор
	ТекД.Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Клиент",ТекД.Клиент);
	СтруктураЗапроса.Вставить("Договор",ТекД.Договор);
	СтруктураОтвета = ПолучитьДоговор(СтруктураЗапроса);
	ЗаполнитьЗначенияСвойств(ТекД,СтруктураОтвета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоговор(СтруктураЗапроса)
	
	// если у клиента один договор и/или один ПСЦ, то подставим их автоматически
	
	Договор = СтруктураЗапроса.Договор;
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗапроса.Договор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",СтруктураЗапроса.Клиент);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() = 1 Тогда
			Договор = ТЗ[0].Ссылка;
		Иначе
			Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	
	СтруктураЗапроса.Вставить("Договор",Договор);
	
	Возврат СтруктураЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Если РежимДобавленияВагонов = 0 Тогда
		Элементы.ТаблицаВагоновРегионОтправления.Видимость = Истина;
		Элементы.МоментВремениДобавленияВПовагонку.Видимость = Ложь;
		Для Каждого Стр Из ТаблицаВагонов Цикл
			Стр.ВводВРейс = Ложь;
		КонецЦикла;
	Иначе
		Элементы.ТаблицаВагоновРегионОтправления.Видимость = Ложь;
		Элементы.МоментВремениДобавленияВПовагонку.Видимость = Истина;
		Для Каждого Стр Из ТаблицаВагонов Цикл
			Стр.ВводВРейс = Истина;
		КонецЦикла;
		Для Каждого Стр Из ТаблицаВагонов Цикл
			Стр.РегионОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимДобавленияВагоновПриИзменении(Элемент)
	
	ВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокВагонов") Тогда
		ИсточникДобавления = "АРМ_Логист";
		Для Каждого ЭлСп Из Параметры.СписокВагонов Цикл
			НовСтр = ТаблицаВагонов.Добавить();
			НовСтр.НомерВагона = ЭлСп.Значение;
		КонецЦикла;
	Иначе
		ИсточникДобавления = "АРМ_Повагонка";
	КонецЕсли;
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		ЦФОПользователя = ТекПользователь.ЦФО;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура МоментВремениДобавленияВПовагонкуПриИзменении(Элемент)
	
	Если МоментВремениДобавленияВПовагонку = 0 Тогда
		Для Каждого Стр Из ТаблицаВагонов Цикл
			Стр.ВводВРейс = Истина;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из ТаблицаВагонов Цикл
			Стр.ВводВРейс = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьСтрокиПоПервойСтроке(Команда)
	
	ЗаполнятьПоПервойСтроке = НЕ ЗаполнятьПоПервойСтроке;	
	Элементы.ТаблицаВагоновЗаполнятьСтрокиПоПервойСтроке.Пометка = ЗаполнятьПоПервойСтроке;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВагоновПриИзменении(Элемент)
		
	ТекДанные = Элементы.ТаблицаВагонов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные <> ТаблицаВагонов[0] Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		Для Сч = 1 По ТаблицаВагонов.Количество() - 1 Цикл
			ТаблицаВагонов[Сч][ИмяПоля] = ТаблицаВагонов[0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
