
&НаСервере
Процедура ДобавитьРеквизитыНаФорму()       
	
	МассивКонтейнеров = ДублиТерминалов.Выгрузить().ВыгрузитьКолонку("Контейнер");
	МассивКонтейнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКонтейнеров);
	
	// Формируем поля для выбора терминалов  
	НомерСтроки = 1;
	Для каждого СтрКТК Из МассивКонтейнеров Цикл    
		
		ГруппаКТК = ЭтаФорма.Элементы.Добавить("ГруппаОбычная" + НомерСтроки, Тип("ГруппаФормы"), ЭтаФорма);
		ГруппаКТК.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКТК.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаКТК.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаКТК.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
		
		ДобавляемыеРеквизиты = Новый Массив; 
		НовыйРеквизит = Новый РеквизитФормы("КТК" + НомерСтроки,Новый ОписаниеТипов("СправочникСсылка.ТЕ")); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);  
		
		НовыйРеквизит = Новый РеквизитФормы("ТерминалВыдачи" + НомерСтроки,Новый ОписаниеТипов("СправочникСсылка.Локации")); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
		ЭтаФорма["КТК" + НомерСтроки] = СтрКТК;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КТК" + НомерСтроки, Тип("ПолеФормы"), ГруппаКТК);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлемент.ТолькоПросмотр = Истина; 
		НовыйЭлемент.Заголовок = "Контейнер";
		НовыйЭлемент.ПутьКДанным = "КТК" + НомерСтроки;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ТерминалВыдачи" + НомерСтроки, Тип("ПолеФормы"),ГруппаКТК);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;     
		НовыйЭлемент.РежимВыбораИзСписка = Истина; 
		НовыйЭлемент.Заголовок = "Терминал выдачи";
		//НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииТерминала");
		НовыйЭлемент.ПутьКДанным = "ТерминалВыдачи" + НомерСтроки;    
		
		СтрокиТерминалов = ДублиТерминалов.НайтиСтроки(Новый Структура("Контейнер", СтрКТК));
		Для каждого Стр Из СтрокиТерминалов Цикл    
			Если не ЗначениеЗаполнено(ЭтаФорма["ТерминалВыдачи" + НомерСтроки]) Тогда
				ЭтаФорма["ТерминалВыдачи" + НомерСтроки] = Стр.ТерминалВыдачи;
			КонецЕсли;
			Элементы["ТерминалВыдачи" + НомерСтроки].СписокВыбора.Добавить(Стр.ТерминалВыдачи);
		КонецЦикла;   
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДублиТерминалов") Тогда
		Для каждого СтрПараметра Из Параметры.ДублиТерминалов Цикл
			НС = ДублиТерминалов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрПараметра); 
		КонецЦикла;    
		ДобавитьРеквизитыНаФорму();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)   
	Результат = СформироватьОтветПользователя();
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры   

&НаСервере
Функция СформироватьОтветПользователя()
	
	МассивКонтейнеров = ДублиТерминалов.Выгрузить().ВыгрузитьКолонку("Контейнер");
	МассивКонтейнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКонтейнеров);
	
	// Фиксируем выбранные значения 
	Результат = Новый Соответствие;
	НомерСтроки = 1;
	Для каждого СтрКТК Из МассивКонтейнеров Цикл  
		Результат.Вставить(СтрКТК, ЭтаФорма["ТерминалВыдачи" + НомерСтроки]);	
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции 

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
