
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Параметры.Свойство("Фрахт", ЭтотОбъект.Фрахт);
	Параметры.Свойство("Авто", ЭтотОбъект.Авто);
	Параметры.Свойство("СчетФактура", ЭтотОбъект.СчетФарктураСсылка);
	
	Элементы.ФормаДобавить.Доступность = Пользователи.РолиДоступны("dc_РаботаСНДС0");
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеКолонок();
	
	ТаблицаФрахтИзменена = Ложь;
	
	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Истина;	
	
	ИзменитьДоступностьТЧПодтверждающиеДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
  
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Если ЗаполнитьПоПервойСтроке Тогда
		 Для Каждого Строка Из ПодтверждающиеДокументы Цикл
			Строка.ВыбратьСтрокуДляЗаполнения = Истина;
		КонецЦикла;
	Иначе
		Если ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") Или ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре") Тогда
			Для каждого Строка Из ПодтверждающиеДокументы Цикл
				ЕстьДокПоМорскомуТранспорту = ПроверитьНаличиеДокументовПоМорскомуТранспорту(Строка);
				Если ЕстьДокПоМорскомуТранспорту Тогда
					Строка.ДокументыЕсть = Истина;
				Иначе
					Строка.ДокументыЕсть = Ложь;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого Строка Из ПодтверждающиеДокументы Цикл
				Строка.ДокументыЕсть = Истина;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)

	Для каждого Строка Из ПодтверждающиеДокументы Цикл
		Если ЗаполнитьПоПервойСтроке Тогда
			Строка.ВыбратьСтрокуДляЗаполнения = Ложь;			
		Иначе
			Строка.ДокументыЕсть = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКолонок()
	
	Если ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Транзит") 
			Или ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ТранзитМоре")
		Тогда
		Элементы.ПодтверждающиеДокументыВходнаяСтанция.Видимость = Истина;	
		Элементы.ПодтверждающиеДокументыВыходнаяСтанция.Видимость = Истина;
	Иначе	
		Элементы.ПодтверждающиеДокументыВходнаяСтанция.Видимость = Ложь;	
		Элементы.ПодтверждающиеДокументыВыходнаяСтанция.Видимость = Ложь;
	КонецЕсли;
	Элементы.ПодтверждающиеДокументы.Видимость = НЕ Фрахт;
	Элементы.МорскойТранспорт.Видимость = НЕ Фрахт;
	Элементы.ТаблицаФрахт.Видимость = Фрахт;
	
КонецПроцедуры

#Область ТаблицаПодтверждающиеДокументы

&НаКлиенте
Процедура ПодтверждающиеДокументыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ПодтверждающиеДокументы.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	УстановитьОтборПоЖДН(Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыНомерГТДОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ДлинаНомера = СтрДлина(Текст);
	Если ДлинаНомера > 0 И ДлинаНомера <> 23 Тогда
		ТекСтрока = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
		Поле = СтрШаблон("ПодтверждающиеДокументы[%1].НомерГТД", ТекСтрока.НомерСтроки - 1);
		ТекстСообщения = СтрШаблон("Номер ГТД должен состоять из 23 знаков! Введено %1.", Строка(ДлинаНомера));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыДокументыЕстьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	Если ТекДанные.ДокументыЕсть И (ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") Или ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре")) Тогда
		ЕстьДокПоМорскомуТранспорту = ПроверитьНаличиеДокументовПоМорскомуТранспорту(ТекДанные);
		Если Не ЕстьДокПоМорскомуТранспорту Тогда
			ТекДанные.ДокументыЕсть = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны документы по морскому транспорту!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыПриИзменении(Элемент)
	Если ЗаполнитьПоПервойСтроке И Элемент.ТекущийЭлемент.Имя <> "ПодтверждающиеДокументыВыбратьСтрокуДляЗаполнения"
		И Элемент.ТекущиеДанные.ВыбратьСтрокуДляЗаполнения Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = Элементы.ПодтверждающиеДокументы.ТекущиеДанные[ИмяПоля];
	    ЗаполнитьПодтверждающиеДокументыПоПервойСтроке(ИмяПоля,НовоеЗначение);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти 

#Область ТаблицаМорскойТранспорт

 &НаКлиенте
Процедура МорскойТранспортПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Элементы.ПодтверждающиеДокументы.ТекущиеДанные = Неопределено Тогда
		Элементы.МорскойТранспорт.ТекущиеДанные.КлючСтроки = Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки;
		Элементы.МорскойТранспорт.ТекущиеДанные.ВыбратьДляПереноса = Элементы.ПодтверждающиеДокументы.ТекущиеДанные.ВыбратьДляПереноса;
	КонецЕсли; 
	Элементы.МорскойТранспорт.ТекущиеДанные.НомерСтроки = МорскойТранспорт.Количество();

КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортПортРазгрузкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ПортРазгрузки) Тогда
		СтранаРазгрузки = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ПортРазгрузки, "Страна");
		Если ЗначениеЗаполнено(СтранаРазгрузки) Тогда
			ТекДанные.СтранаРазгрузки = СтранаРазгрузки;
		Иначе ТекДанные.СтранаРазгрузки = Неопределено;
		КонецЕсли;
	Иначе ТекДанные.СтранаРазгрузки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортКоносаментПриИзменении(Элемент)
	
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Коносамент) Тогда
		ДанныеКоносамента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекДанные.Коносамент, "НомерТранспортногоДокумента, ДатаТранспортногоДокумента, Судно");
		Если ЗначениеЗаполнено(ДанныеКоносамента.НомерТранспортногоДокумента) Тогда
			ТекДанные.НомерДокумента = ДанныеКоносамента.НомерТранспортногоДокумента;
		Иначе ТекДанные.НомерДокумента = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКоносамента.ДатаТранспортногоДокумента) Тогда
			ТекДанные.ДатаДокумента = ДанныеКоносамента.ДатаТранспортногоДокумента;
		Иначе ТекДанные.ДатаДокумента = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКоносамента.Судно) Тогда
			ТекДанные.Судно = ДанныеКоносамента.Судно;
		Иначе ТекДанные.Судно = Неопределено;
		КонецЕсли;
	Иначе 
		ТекДанные.НомерДокумента = "";
		ТекДанные.ДатаДокумента = Неопределено;
		ТекДанные.Судно = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортПриИзменении(Элемент)
	текДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Для каждого СтрокаДанные Из МорскойТранспорт Цикл
			Если СтрокаДанные.Коносамент = текДанные.Коносамент
				И СтрокаДанные.ТипДокумента = текДанные.ТипДокумента
				И СтрокаДанные.НомерДокумента = текДанные.НомерДокумента Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДанные, текДанные,,"КлючСтроки");
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортПортПогрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ПортПогрузки) Тогда
		СтранаПогрузки = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ПортПогрузки, "Страна");
		Если ЗначениеЗаполнено(СтранаПогрузки) Тогда
			ТекДанные.СтранаПогрузки = СтранаПогрузки;
		Иначе ТекДанные.СтранаПогрузки = Неопределено;
		КонецЕсли;
	Иначе ТекДанные.СтранаПогрузки = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Коносаменты_ОтметитьВсе(Команда)
	Если Элементы.МорскойТранспорт.ОтборСтрок <> Неопределено Тогда     
		КлючСтроки = Элементы.МорскойТранспорт.ОтборСтрок["КлючСтроки"];
		СтрокиТаб = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки)); 
		Для каждого СтрокаМорскогоТранспорта Из СтрокиТаб Цикл
			СтрокаМорскогоТранспорта.ВыбратьДляПереноса = Истина;	
		КонецЦикла;
	Иначе	
	    Для каждого СтрокаМорскогоТранспорта Из МорскойТранспорт Цикл
			СтрокаМорскогоТранспорта.ВыбратьДляПереноса = Истина;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Коносаменты_СнятьВсе(Команда)
	Если Элементы.МорскойТранспорт.ОтборСтрок <> Неопределено Тогда
		КлючСтроки = Элементы.МорскойТранспорт.ОтборСтрок["КлючСтроки"];
		СтрокиТаб = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки)); 
		Для каждого СтрокаМорскогоТранспорта Из СтрокиТаб Цикл
			СтрокаМорскогоТранспорта.ВыбратьДляПереноса = Ложь;	
		КонецЦикла;
	Иначе	
	    Для каждого СтрокаМорскогоТранспорта Из МорскойТранспорт Цикл
			СтрокаМорскогоТранспорта.ВыбратьДляПереноса = Ложь;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти   

#Область ТаблицаФрахт

&НаКлиенте
Процедура ТаблицаФрахтПослеУдаления(Элемент)
	ТаблицаФрахтИзменена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрахтПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)  
	
	Если Не ОтменаРедактирования 
		И (Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТипДокумента)
		ИЛИ Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.НомерДокумента)) Тогда
		ПоказатьПредупреждение(,"Необходимо заполнить поля «ТипДокумента», «НомерДокумента»",20);
		Отказ = Истина;
	КонецЕсли; 
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если Не ОтменаРедактирования Тогда
		ТаблицаФрахтИзменена = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеТабФрахт(Команда)
	
	Для Каждого Строка Из ТаблицаФрахт Цикл
		Строка.ВыбратьДляПереноса = Истина; 
		ПоискПодтв = ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("КлючСтроки", Строка.КлючСтроки));
		Для каждого СтрПодтв Из ПоискПодтв Цикл
			СтрПодтв.ВыбратьДляПереноса = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьВсеТабФрахт(Команда)

	Для каждого Строка Из ТаблицаФрахт Цикл
		Строка.ВыбратьДляПереноса = Ложь;	
		ПоискПодтв = ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("КлючСтроки", Строка.КлючСтроки));
		Для каждого СтрПодтв Из ПоискПодтв Цикл
			СтрПодтв.ВыбратьДляПереноса = Ложь;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаФрахтПриИзменении(Элемент)
	Если ЗаполнитьПоПервойСтроке И Элемент.ТекущийЭлемент.Имя <> "ТаблицаФрахтВыбратьСтрокуДляЗаполнения"
		И Элемент.ТекущиеДанные.ВыбратьСтрокуДляЗаполнения Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = Элементы.ТаблицаФрахт.ТекущиеДанные[ИмяПоля];
	    ЗаполнитьТаблицуФрахтПоПервойСтроке(ИмяПоля,НовоеЗначение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрахтПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаФрахт.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьОтборПоЖДН(КлючСтроки)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСтроки", Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки);
	Элементы.МорскойТранспорт.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска); 	
	
	//Коносаменты_СнятьВсе(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	Элементы.МорскойТранспорт.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Отказ = Ложь;
	
	Если не ЗначениеЗаполнено(ВыбраннаяИСФ) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана ИСФ для добавления строк ГТД!",,,"ВыбраннаяИСФ",Отказ);
	КонецЕсли;
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109048 Начало 11.06.2025
	//Если ЗначениеЗаполнено(ВыбраннаяИСФ) и СписокДобавленныхИСФ.НайтиПоЗначению(ВыбраннаяИСФ) <> Неопределено Тогда
	Если ПодтверждающиеДокументы.Количество() <> 0 и ЗначениеЗаполнено(ВыбраннаяИСФ) 
		и СписокДобавленныхИСФ.НайтиПоЗначению(ВыбраннаяИСФ) <> Неопределено Тогда
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109048 Конец 11.06.2025
		ОбщегоНазначенияКлиент.СообщитьПользователю("По выбранной ИСФ строки ГТД уже были добавлены!",,,"ВыбраннаяИСФ",Отказ);	
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;   
	
	ДобавитьСтрокиГТДизИСФ(ВыбраннаяИСФ);
	
	СписокДобавленныхИСФ.Добавить(ВыбраннаяИСФ);
		
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСтрокиГТДизИСФ(ВыбраннаяИСФСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН КАК ЖДН,
		|	СчетФактураВыданныйПодтверждающиеДокументы.Вагон КАК Вагон,
		|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер КАК Контейнер,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ДокументыЕсть КАК ДокументыЕсть,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления КАК СтранаОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления КАК СтанцияОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция КАК ВходнаяСтанция,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения КАК СтранаНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения КАК СтанцияНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВыходнаяСтанция КАК ВыходнаяСтанция,
		|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД КАК НомерГТД,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаГТД КАК ДатаГТД,
		|	СчетФактураВыданныйПодтверждающиеДокументы.Транспорт КАК Транспорт,
		|	СчетФактураВыданныйПодтверждающиеДокументы.КлючСтроки КАК КлючСтроки,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВыбратьСтрокуДляЗаполнения КАК ВыбратьСтрокуДляЗаполнения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВключатьВОтчетДляФНС КАК ВключатьВОтчетДляФНС,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СуммаПоКТК КАК СуммаПоКТК,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС,
		|	СчетФактураВыданныйПодтверждающиеДокументы.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации
		|ИЗ
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = &ВыбраннаяИСФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетФактураВыданныйМорскойТранспорт.КлючСтроки КАК КлючСтроки,
		|	СчетФактураВыданныйМорскойТранспорт.ТипДокумента КАК ТипДокумента,
		|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента КАК НомерДокумента,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента КАК ДатаДокумента,
		|	СчетФактураВыданныйМорскойТранспорт.Судно КАК Судно,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки КАК ДатаРазрешенияПогрузки,
		|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки КАК ПортРазгрузки,
		|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки КАК СтранаРазгрузки,
		|	СчетФактураВыданныйМорскойТранспорт.Коносамент КАК Коносамент,
		|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки КАК ПортПогрузки,
		|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки КАК СтранаПогрузки,
		|	СчетФактураВыданныйМорскойТранспорт.НомерГТД КАК НомерГТД,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0,
		|	СчетФактураВыданныйМорскойТранспорт.ВключатьВОтчетДляФНС КАК ВключатьВОтчетДляФНС,
		|	СчетФактураВыданныйМорскойТранспорт.СуммаПоКТК КАК СуммаПоКТК,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС,
		|	СчетФактураВыданныйМорскойТранспорт.Контейнер КАК Контейнер,
		|	СчетФактураВыданныйМорскойТранспорт.ДокументыЕсть КАК ДокументыЕсть,
		|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации
		|ИЗ
		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
		|ГДЕ
		|	СчетФактураВыданныйМорскойТранспорт.Ссылка = &ВыбраннаяИСФ";
	
	Запрос.УстановитьПараметр("ВыбраннаяИСФ", ВыбраннаяИСФСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСуша = РезультатыЗапроса[0].Выбрать();     
	ВыборкаФрахт = РезультатыЗапроса[1].Выбрать();
	
	Если не Авто и не Фрахт Тогда  
		//Сухопутная перевозка, заполняем ТЧ ПодтверждающиеДокументы и ТЧ МорскойТранспорт  
		НомерСтрокиСуша = ПодтверждающиеДокументы.Количество() + 1;
		НомерСтрокиФрахт = МорскойТранспорт.Количество() + 1;
		Пока ВыборкаСуша.Следующий() Цикл
			
			НС = ПодтверждающиеДокументы.Добавить(); 
			НС.НомерСтроки = НомерСтрокиСуша;
			НС.ВыбратьДляПереноса = Истина;
			ЗаполнитьЗначенияСвойств(НС, ВыборкаСуша);
			
			СтруктураПоискаСтрокТранспорта = Новый Структура("КлючСтроки", НС.КлючСтроки);
			Пока ВыборкаФрахт.НайтиСледующий(СтруктураПоискаСтрокТранспорта) Цикл
				НС_Трансп = МорскойТранспорт.Добавить();
				НС_Трансп.НомерСтроки = НомерСтрокиФрахт; 
				НС_Трансп.ВыбратьДляПереноса = Истина;
				ЗаполнитьЗначенияСвойств(НС_Трансп, ВыборкаФрахт);
				
				НомерСтрокиФрахт = НомерСтрокиФрахт + 1;
			КонецЦикла;	
			ВыборкаФрахт.Сбросить();
			
			НомерСтрокиСуша = НомерСтрокиСуша + 1;
			
		КонецЦикла;   
		
	ИначеЕсли не Авто и Фрахт Тогда 
		//Морская перевозка, заполняем ТаблицаФрахт и ПодтверждающиеДокументы
		
		НомерСтрокиФрахт = ТаблицаФрахт.Количество() + 1;
		Пока ВыборкаФрахт.Следующий() Цикл
			НС_Фрахт = ТаблицаФрахт.Добавить();
			НС_Фрахт.НомерСтроки = НомерСтрокиФрахт;  
			НС_Фрахт.ВыбратьДляПереноса = Истина;
			ЗаполнитьЗначенияСвойств(НС_Фрахт, ВыборкаФрахт);
			
			НомерСтрокиФрахт = НомерСтрокиФрахт + 1;
			
			ТаблицаФрахтИзменена = Истина;
		КонецЦикла;  
		
		НомерСтрокиСуша = ПодтверждающиеДокументы.Количество() + 1;
		Пока ВыборкаСуша.Следующий() Цикл
			
			НС = ПодтверждающиеДокументы.Добавить(); 
			НС.НомерСтроки = НомерСтрокиСуша;   
			НС.ВыбратьДляПереноса = Истина;
			ЗаполнитьЗначенияСвойств(НС, ВыборкаСуша);
			
			НомерСтрокиСуша = НомерСтрокиСуша + 1;
			
		КонецЦикла;  
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеДокументовПоМорскомуТранспорту(СтрокаПоПодтверждающемуДокументу)
	
	Результат = Ложь;
	
	СтрокиМорскойТранспорт = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаПоПодтверждающемуДокументу.КлючСтроки));
	Если СтрокиМорскойТранспорт.Количество() > 0 Тогда
		Результат = ЗначениеЗаполнено(СтрокиМорскойТранспорт[0].Коносамент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Перенести(Команда)
	
	АдресВставки = УпаковатьТаблицыДляПередачи();
		
	Закрыть(АдресВставки);

КонецПроцедуры   

&НаСервере
Функция УпаковатьТаблицыДляПередачи()

	СтруктураЗаполненияГТД = Новый Структура("ПодтверждающиеДокументы, МорскойТранспорт, ПодтверждающиеДокументыАвто");
	
	Если ТаблицаФрахтИзменена Тогда
		ОбновитьТЧМорскойТранспорт();  
	КонецЕсли;       
	
	ВыбранныеСтрокиПодтвДок = ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("ВыбратьДляПереноса", Истина)); 
	ВыбранныеСтрокиМорскойТранспорт = МорскойТранспорт.НайтиСтроки(Новый Структура("ВыбратьДляПереноса", Истина));
	
	СтруктураЗаполненияГТД.ПодтверждающиеДокументы 	= ПодтверждающиеДокументы.Выгрузить(ВыбранныеСтрокиПодтвДок);
	СтруктураЗаполненияГТД.МорскойТранспорт 		= МорскойТранспорт.Выгрузить(ВыбранныеСтрокиМорскойТранспорт); 

	Возврат ЗначениеВСтрокуВнутр(СтруктураЗаполненияГТД);
	
КонецФункции 

Процедура ОбновитьТЧМорскойТранспорт()
	МорскойТранспорт.Очистить();
	Для Каждого СтрокаФрахт Из ТаблицаФрахт Цикл
		СтрокаМорскойТранспорт = МорскойТранспорт.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМорскойТранспорт, СтрокаФрахт);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПервойСтрокеПриИзменении(Элемент)
	ИзменитьДоступностьТЧПодтверждающиеДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьТЧПодтверждающиеДокументы()
	Элементы.ПодтверждающиеДокументыВагон.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыДатаГТД.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыДокументыЕсть.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыКонтейнер.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыТранспорт.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыКлючСтроки.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;    
	
	Элементы.ТаблицаФрахтДокументыЕсть.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ТаблицаФрахтКонтейнер.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
    Элементы.ТаблицаФрахтКлючСтроки.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументыПоПервойСтроке(ИмяПоля,НовоеЗначение)
	
	Для Сч = 0 По ПодтверждающиеДокументы.Количество() - 1 Цикл
		РезПроверки = Элементы.ПодтверждающиеДокументы.ПроверитьСтроку(ПодтверждающиеДокументы[Сч].ПолучитьИдентификатор());
		текСтрока = Элементы.ПодтверждающиеДокументы.ДанныеСтроки(ПодтверждающиеДокументы[Сч].ПолучитьИдентификатор());
		Если РезПроверки = Истина И текСтрока.ВыбратьСтрокуДляЗаполнения Тогда
			
			ПодтверждающиеДокументы[Сч][ИмяПоля] = НовоеЗначение;
			
			Если ИмяПоля = "СтранаНазначения" Тогда
				ПодтверждающиеДокументы[Сч]["СтанцияНазначения"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ИначеЕсли ИмяПоля = "СтранаОтправления" Тогда
				ПодтверждающиеДокументы[Сч]["СтанцияОтправления"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКДокументу(Команда)
	
	СтрокиМорскогоТранспорта = Новый Массив;
	СтруктураОтбора = Новый Структура("Флаг", Истина); 
	СтрокиКДобавлению = МорскойТранспорт.НайтиСтроки(СтруктураОтбора);  
	Если СтрокиКДобавлению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СтрутураКоносамента = Новый Структура;
	СтрутураКоносамента.Вставить("СтрокиКоносаментов",СтрокиКДобавлению); 
	
	//Коносаменты_СнятьВсе(Неопределено);
	
	СписокЖДН = Новый СписокЗначений;
	СписокЖДН.Добавить("Ссылка");
	СписокЖДН.Очистить();
	
	Для каждого СтрокаЖДН Из ПодтверждающиеДокументы Цикл
		Если ТекущийСписокЖДН.НайтиПоЗначению(СтрокаЖДН.ЖДН) = Неопределено Тогда
			СписокЖДН.Добавить(Новый Структура("Ссылка, Контейнер", СтрокаЖДН.ЖДН, Строка(СтрокаЖДН.Контейнер)), Строка(СтрокаЖДН.КлючСтроки)); 
		КонецЕсли; 
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораМорскихЖДНИзСписка", ЭтаФорма, СтрутураКоносамента);
	ОткрытьФорму("ОбщаяФорма.э_ФормаВыбораИзСписка",Новый Структура("Список,Заголовок,ОбъектВладелец",СписокЖДН,"Выберите список ЖДН для добавления морских документов",СчетФарктураСсылка),СчетФарктураСсылка,,,,ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМорскихЖДНИзСписка(Параметр1, Параметр2) Экспорт
	
	Если Параметр1 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийСписокЖДН.Очистить();
	Для каждого Элемент Из Параметр1 Цикл
		Если Элемент.Пометка Тогда 
			Для каждого СтрКоносамента Из Параметр2.СтрокиКоносаментов Цикл
				СтрокиМорскойТранспорт = МорскойТранспорт.НайтиСтроки(Новый Структура("Коносамент,КлючСтроки", СтрКоносамента.Коносамент,Элемент.Представление));
				Если СтрокиМорскойТранспорт.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = МорскойТранспорт.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрКоносамента,,"КлючСтроки");
				НоваяСтрока.КлючСтроки = Элемент.Представление;
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПравоРаботыСНДС0()
	// Евросиб Фролов (01.12.2021 Task №43170
	Возврат Пользователи.РолиДоступны("dc_РаботаСНДС0");
	// Евросиб Фролов)
КонецФункции

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТаблицуФрахтПоПервойСтроке(ИмяПоля,НовоеЗначение)
	
	Для Сч = 0 По ТаблицаФрахт.Количество() - 1 Цикл
		РезПроверки = Элементы.ТаблицаФрахт.ПроверитьСтроку(ТаблицаФрахт[Сч].ПолучитьИдентификатор());
		текСтрока = Элементы.ТаблицаФрахт.ДанныеСтроки(ТаблицаФрахт[Сч].ПолучитьИдентификатор());
		Если РезПроверки = Истина И текСтрока.ВыбратьСтрокуДляЗаполнения Тогда
			
			ТаблицаФрахт[Сч][ИмяПоля] = НовоеЗначение;			
			// ДИТ Поморцева Т.П. 0252360 07.12.21. начало
			Если ИмяПоля = "СтранаПогрузки" Тогда
				ТаблицаФрахт[Сч]["ПортПогрузки"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ИначеЕсли ИмяПоля = "СтранаРазгрузки" Тогда
				ТаблицаФрахт[Сч]["ПортРазгрузки"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			КонецЕсли; 
			// ДИТ Поморцева Т.П. 0252360 07.12.21. конец
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодтверждениеЖДНИлиКоносамента()
	
	ЧастичноПодтвержденныеДокументы = Новый Массив;
	
	Если Фрахт Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Коносамент,
		|	ПодтверждающиеДокументы.ДатаПодтвержденияНДС0,
		|	ПодтверждающиеДокументы.Контейнер
		|ПОМЕСТИТЬ ВТ_ПодтверждающиеДокументы
		|ИЗ 
		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК ПодтверждающиеДокументы  
		|ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйМорскойТранспорт.Коносамент КАК Коносамент,
		|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК
		|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
		|ИЗ
		|	ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйМорскойТранспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|		ПО (СчетФактураВыданныйМорскойТранспорт.Коносамент = ТранспортныйДокументКоносаменты.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВременнаяТаблица.Коносамент КАК ТранспортныйДокумент,
		|	ВТ_ВременнаяТаблица.НомерКТК КАК Контейнер,
		|	ЕСТЬNULL(СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПодтвержденияНДС0
		|ИЗ
		|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйМорскойТранспорт
		|		ПО (ВТ_ВременнаяТаблица.НомерКТК = СчетФактураВыданныйМорскойТранспорт.Контейнер)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерКТК)
		|ПО
		|	ТранспортныйДокумент";  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.МорскойТранспорт КАК ПодтверждающиеДокументы", 
												 "&ПодтверждающиеДокументы КАК ПодтверждающиеДокументы");  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка", ""); 
		
		Запрос.УстановитьПараметр("ПодтверждающиеДокументы", МорскойТранспорт.Выгрузить(,"Коносамент, Контейнер, ДатаПодтвержденияНДС0")); 
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодтверждающиеДокументы.ЖДН,
		|	ПодтверждающиеДокументы.ДатаПодтвержденияНДС0,
		|	ПодтверждающиеДокументы.Контейнер
		|ПОМЕСТИТЬ ВТ_ПодтверждающиеДокументы
		|ИЗ 
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы  
		|ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка
		|;
		|		
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН КАК ЖДН,
		|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
		|ИЗ
		|	ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|		ПО (СчетФактураВыданныйПодтверждающиеДокументы.ЖДН = ТранспортныйДокументУчетныеЕдиницы.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВременнаяТаблица.ЖДН КАК ТранспортныйДокумент,
		|	ВТ_ВременнаяТаблица.Контейнер КАК Контейнер,
		|	ЕСТЬNULL(СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПодтвержденияНДС0
		|ИЗ
		|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|		ПО (ВТ_ВременнаяТаблица.Контейнер = СчетФактураВыданныйПодтверждающиеДокументы.Контейнер)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контейнер)
		|ПО
		|	ТранспортныйДокумент";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы", 
												 "&ПодтверждающиеДокументы КАК ПодтверждающиеДокументы");  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка", ""); 
		
		Запрос.УстановитьПараметр("ПодтверждающиеДокументы", ПодтверждающиеДокументы.Выгрузить(,"ЖДН, Контейнер, ДатаПодтвержденияНДС0"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТранспортныйДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТранспортныйДокумент.Следующий() Цикл
		КоличествоКонтейнеров = ВыборкаТранспортныйДокумент.Контейнер;
		Если ВыборкаТранспортныйДокумент.Контейнер = 1 Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаКТК = ВыборкаТранспортныйДокумент.Выбрать();
		ПодтвержденныеКонтейнеры = Новый Массив;
		Пока ВыборкаКТК.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаКТК.ДатаПодтвержденияНДС0) Тогда
				Если ПодтвержденныеКонтейнеры.Найти(ВыборкаКТК.Контейнер) = Неопределено Тогда
					ПодтвержденныеКонтейнеры.Добавить(ВыборкаКТК.Контейнер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ПодтвержденныеКонтейнеры.Количество() <> 0 Тогда
			Если КоличествоКонтейнеров <> ПодтвержденныеКонтейнеры.Количество() Тогда
				ЧастичноПодтвержденныеДокументы.Добавить(ВыборкаТранспортныйДокумент.ТранспортныйДокумент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧастичноПодтвержденныеДокументы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммыПоКТК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|			ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Цена
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|			ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Контейнер
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер
	|	КОНЕЦ КАК Контейнер
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО СчетФактураВыданный.Ссылка = СчетФактураВыданныйДокументыОснования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.СтавкаНДС = &СтавкаНДС)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &Услуга)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.РасшифровкаУслугПоТС КАК КорректировкаРеализацииРасшифровкаУслугПоТС
	|		ПО (КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование)
	|			И (КорректировкаРеализацииРасшифровкаУслугПоТС.СтавкаНДСДоИзменения = &СтавкаНДС)
	|			И (КорректировкаРеализацииРасшифровкаУслугПоТС.Услуга = &Услуга)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И (НЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.НДС0);
	Запрос.УстановитьПараметр("Услуга", Константы.УслугаФрахтаДляКалькуляции.Получить());
	Запрос.УстановитьПараметр("Ссылка", СчетФарктураСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Контейнер", Выборка.Контейнер);
		Если Фрахт Тогда
			НайденныеСтроки = ТаблицаФрахт.НайтиСтроки(Отбор);
		Иначе
			НайденныеСтроки = ПодтверждающиеДокументы.НайтиСтроки(Отбор);
		КонецЕсли;
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.СуммаПоКТК = Выборка.Сумма;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяИСФАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеАвтоподбораРасширенные(Текст);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеАвтоподбораРасширенные(СтрокаПоиска)

	Возврат Документы.СчетФактураВыданный.ПолучитьДанныеВыбора(Новый Структура("СтрокаПоиска, ВводПоСтрокеРасширенный", СтрокаПоиска, Истина));	

КонецФункции


&НаКлиенте
Процедура КПереносуУстановить(Команда)
	Для каждого СтрПодтверждающих Из ПодтверждающиеДокументы Цикл   
		СтрПодтверждающих.ВыбратьДляПереноса = Истина;
		ПоискТранспорта = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", СтрПодтверждающих.КлючСтроки));
		Для каждого СтрТранспорт Из ПоискТранспорта Цикл
			СтрТранспорт.ВыбратьДляПереноса = Истина;
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КПереносуСнять(Команда)
	Для каждого СтрПодтверждающих Из ПодтверждающиеДокументы Цикл   
		СтрПодтверждающих.ВыбратьДляПереноса = Ложь;
		ПоискТранспорта = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", СтрПодтверждающих.КлючСтроки));
		Для каждого СтрТранспорт Из ПоискТранспорта Цикл
			СтрТранспорт.ВыбратьДляПереноса = Ложь;
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыВыбратьДляПереносаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ПоискТранспорта = МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", ТекСтрока.КлючСтроки));
		Для каждого СтрТранспорт Из ПоискТранспорта Цикл
			СтрТранспорт.ВыбратьДляПереноса = ТекСтрока.ВыбратьДляПереноса;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

