
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	МассивПользователей = Новый Массив;
	МассивПользователей = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПользователей, Пользователи_sd_Сервер.ПолучитьСписокМоихГрупп(ТекПользователь));
	Список.Параметры.УстановитьЗначениеПараметра("МассивПользователей", МассивПользователей);
	
КонецПроцедуры
