&НаКлиенте
Перем ПланыОтправокВХранилище;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодДокумента.ДатаНачала = Объект.ДатаНачала;
	ПериодДокумента.ДатаОкончания = Объект.ДатаОкончания;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПоРегламентуПродуктов(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРП", ЭтаФорма);
	ОткрытьФорму("Документ.РегламентПродуктов.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наКлиенте
Процедура ОбработкаВыбораРП(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	ЗаполнитьНаСервере(П1);
	Для каждого Стр из объект.Продукты Цикл
		ПродуктыКоличество20ПриИзменении(неопределено, Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(П1)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегламентПродуктовПродукты.Продукт КАК Продукт,
	               |	РегламентПродуктовПродукты.СвободныхМест КАК СвободныхМест,
	               |	РегламентПродуктовПродукты.ДатаНачала КАК ДатаНачала,
	               |	РегламентПродуктовПродукты.Продукт.Контрибуция20 КАК Контрибуция20,
	               |	РегламентПродуктовПродукты.Продукт.Реализация20 КАК Реализация20,
	               |	РегламентПродуктовПродукты.Продукт.Контрибуция40 КАК Контрибуция40,
	               |	РегламентПродуктовПродукты.Продукт.Реализация40 КАК Реализация40
	               |ИЗ
	               |	Документ.РегламентПродуктов.Продукты КАК РегламентПродуктовПродукты
	               |ГДЕ
	               |	РегламентПродуктовПродукты.Действует
	               |	И РегламентПродуктовПродукты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", П1);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр 							= Объект.Продукты.Добавить();
		НСтр.ГУИДСтроки					= Строка(Новый УникальныйИдентификатор);
		НСтр.Продукт 					= Ответ.Продукт;
		НСтр.Количество 				= Ответ.СвободныхМест;
		НСтр.КоличествоПоИсхДокументу 	= Ответ.СвободныхМест;
		НСтр.ПлановаяДатаУслуги 		= Ответ.ДатаНачала;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоПлануОтправок(Команда)
	
    //ПараметрыФормы  = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);
	
	//Оповещение = Новый ОписаниеОповещения("ЗаполнениеПоПлануОтправок", ЭтотОбъект);
	//ОткрытьФорму("Обработка.ПланыОтправок.Форма.ФормаВыбора",ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ПланыОтправокВХранилище = ПоместитьПОВХранилище();
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ПланыОтправокВХранилище", ПланыОтправокВХранилище);
	ПараметрыПодбора.Вставить("НачалоПериода", Объект.ДатаНачала);
	ПараметрыПодбора.Вставить("КонецПериода", Объект.ДатаОкончания);

	ОткрытьФорму("Обработка.ПланыОтправок.Форма.ФормаВыбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьПОВХранилище()
	
	ТаблицаПродуктов = Объект.Продукты.Выгрузить(, "Продукт,Количество,КоличествоПоИсхДокументу,Отправка,Количество40,СтавкаЗа20,СтавкаЗа40,КонтрибуцияЗа20,КонтрибуцияЗа40,ПлановаяДатаУслуги");
	// если не нужно показывать то, что загрузили ранее, то эту строку откомментить
	//ТаблицаПродуктов.Очистить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПродуктов, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПодбор() Экспорт                                    
	ПолучитьПОИзХранилища(ПланыОтправокВХранилище);
	
	//Для каждого Услуга Из  Объект.Услуги Цикл
	//	ПересчитатьСумму(Услуга);
	//КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыКоличество20ПриИзменении(Элемент, ТекД = неопределено)
	
	//Если ТекД = неопределено Тогда
	//	ТекД = Элементы.Продукты.ТекущиеДанные;
	//КонецЕсли;
	//Если ТекД <> неопределено Тогда
	//	ТекД.Количество = ТекД.Количество20 + ТекД.Количество40*2;
	//	Если ТекД.Количество > 0 Тогда
	//		ТекД.СтавкаЗаТЕУ = (ТекД.Количество20*ТекД.СтавкаЗа20 + ТекД.Количество40*ТекД.СтавкаЗа40) / ТекД.Количество;
	//		ТекД.КонтрибуцияЗаТЕУ = (ТекД.Количество20*ТекД.КонтрибуцияЗа20 + ТекД.Количество40*ТекД.КонтрибуцияЗа40) / ТекД.Количество;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыПриИзменении(Элемент, ТекД = неопределено)
	
	Если ТекД = неопределено Тогда
		ТекД = Элементы.Продукты.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекД <> неопределено Тогда
		ТекД.Количество = ТекД.Количество20 + ТекД.Количество40 * 2;
		Если ТекД.Количество > 0 Тогда
			ТекД.СтавкаЗаТЕУ = (ТекД.Количество20*ТекД.СтавкаЗа20+2*ТекД.Количество40*ТекД.СтавкаЗа40)/ТекД.Количество;
			ТекД.КонтрибуцияЗаТЕУ = (ТекД.Количество20*ТекД.КонтрибуцияЗа20+2*ТекД.Количество40*ТекД.КонтрибуцияЗа40)/ТекД.Количество;
		КонецЕсли;
	КонецЕсли;
	                
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКалькуляцииИСтавки(Команда)
	
	ПодобратьКалькуляцииИСтавкиНаСервере();
	Для каждого Стр из Объект.Продукты Цикл
		 ПродуктыПриИзменении(неопределено, Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьКалькуляцииИСтавкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродуктыПланПродаж_Калькуляции.Калькуляция КАК Калькуляция
	               |ИЗ
				   //ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
	               //|	Справочник.Продукты.ПланПродаж_Калькуляции КАК ПродуктыПланПродаж_Калькуляции
				   |	Справочник.СервисыУчетноеНаправление.ПланПродаж_Калькуляции КАК ПродуктыПланПродаж_Калькуляции
				   //ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
	               |ГДЕ
	               |	ПродуктыПланПродаж_Калькуляции.Ссылка = &Ссылка
	               |	И (ПродуктыПланПродаж_Калькуляции.Клиент = &Клиент
	               |			ИЛИ ПродуктыПланПродаж_Калькуляции.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПродуктыПланПродаж_Калькуляции.Клиент УБЫВ";
	
	Для каждого Стр из Объект.Продукты Цикл
		
		// для заполненных строк это вообще не нужно
		Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) Тогда 
			
			// для не заполненных ищем калькуляцию...		
			Запрос.УстановитьПараметр("Ссылка", Стр.Продукт);
			Запрос.УстановитьПараметр("Клиент", Стр.Клиент);
			Ответ = запрос.Выполнить().Выбрать();
			Если Ответ.Следующий() Тогда
				Стр.Калькуляция = Ответ.Калькуляция;
			КонецЕсли;
			
		КонецЕсли;
		
		// и если нашли, то вытаскиваем из нее ставки
		Если ЗначениеЗаполнено(Стр.Калькуляция) Тогда
			
			Если НЕ Стр.Калькуляция.СуммаВключаетНДС ИЛИ Стр.Калькуляция.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 ИЛИ Стр.Калькуляция.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				
				// доходы 20
				Стр.СтавкаЗа20 = Стр.Калькуляция.ММ_ИтогоСтавка20;
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.СтавкаЗа20 = Стр.СтавкаЗа20 + Стр8.Ставка20;
				КонецЦикла;
				
				// доходы 40
				Стр.СтавкаЗа40 = Стр.Калькуляция.ММ_ИтогоСтавка;
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.СтавкаЗа40 = Стр.СтавкаЗа40 + Стр8.Ставка40;
				КонецЦикла;
				
				// контрибуция 20
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				//Стр.КонтрибуцияЗа20 = Стр.Калькуляция.ММ_ИтогоВознаграждение20;
				//ДатаНачалаНовогоРасчетаВознаграждения = Константы.ДатаНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях.Получить();
				//Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию20ПоДокументу(Стр.Калькуляция);
					Стр.КонтрибуцияЗа20 = ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
				//Иначе
				//	Стр.КонтрибуцияЗа20 = Стр.Калькуляция.ММ_ИтогоВознаграждение20;
				//КонецЕсли;
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.КонтрибуцияЗа20 = Стр.КонтрибуцияЗа20 + Стр8.Вознаграждение20;
				КонецЦикла;
				
				// контрибуция 40
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				//Стр.КонтрибуцияЗа40 = Стр.Калькуляция.ММ_ИтогоВознаграждение;
				//Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию40ПоДокументу(Стр.Калькуляция);
					Стр.КонтрибуцияЗа40 = ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
				//Иначе
				//	Стр.КонтрибуцияЗа40 = Стр.Калькуляция.ММ_ИтогоВознаграждение;
				//КонецЕсли;
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.КонтрибуцияЗа40 = Стр.КонтрибуцияЗа40 + Стр8.Вознаграждение40;
				КонецЦикла;
				
			Иначе
				
				// доходы 20
				Стр.СтавкаЗа20 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоСтавка20, Стр.Калькуляция.СтавкаНДС);
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.СтавкаЗа20 = Стр.СтавкаЗа20 + ПолучитьСуммуБезНДС(Стр8.Ставка20, Стр.Калькуляция.СтавкаНДС);
				КонецЦикла;
				
				// доходы 40
				Стр.СтавкаЗа40 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоСтавка, Стр.Калькуляция.СтавкаНДС);
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.СтавкаЗа40 = Стр.СтавкаЗа40 + ПолучитьСуммуБезНДС(Стр8.Ставка40, Стр.Калькуляция.СтавкаНДС);
				КонецЦикла;
				
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				//Стр.КонтрибуцияЗа20 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоВознаграждение20, Стр.Калькуляция.СтавкаНДС);
				ДатаНачалаНовогоРасчетаВознаграждения = Константы.ДатаНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях.Получить();
				Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию20ПоДокументу(Стр.Калькуляция);
					Стр.КонтрибуцияЗа20 = ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
				Иначе
					Стр.КонтрибуцияЗа20 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоВознаграждение20, Стр.Калькуляция.СтавкаНДС);
				КонецЕсли;
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.КонтрибуцияЗа20 = Стр.КонтрибуцияЗа20 + ПолучитьСуммуБезНДС(Стр8.Вознаграждение20, Стр.Калькуляция.СтавкаНДС);
				КонецЦикла;
				
				// контрибуция 40
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				//Стр.КонтрибуцияЗа40 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоВознаграждение, Стр.Калькуляция.СтавкаНДС);
				Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию40ПоДокументу(Стр.Калькуляция);
					Стр.КонтрибуцияЗа40 = ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
				Иначе
					Стр.КонтрибуцияЗа40 = ПолучитьСуммуБезНДС(Стр.Калькуляция.ММ_ИтогоВознаграждение, Стр.Калькуляция.СтавкаНДС);
				КонецЕсли;
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				Для каждого Стр8 из Стр.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Стр.КонтрибуцияЗа40 = Стр.КонтрибуцияЗа40 + ПолучитьСуммуБезНДС(Стр8.Вознаграждение40, Стр.Калькуляция.СтавкаНДС);
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуБезНДС(Сумма, Ставка)
	
	Множитель = 1;
	Если Ставка = Перечисления.СтавкиНДС.НДС10 Тогда
		Множитель = 1.1;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС18 Тогда
		Множитель = 1.18;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС20 Тогда
		Множитель = 1.20;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС5 Тогда
		Множитель = 1.05; 
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС7 Тогда
		Множитель = 1.07; 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024 
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС22 Тогда
		Множитель = 1.22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	КонецЕсли;
	
	Возврат Сумма / Множитель;
	
КонецФункции

&НаКлиенте
Процедура ПродуктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Продукты.ТекущиеДанные.ГУИДСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПОИзХранилища(ПланыОтправокВХранилище1)
	//Процедура ПолучитьПОИзХранилища(ПланыОтправокВХранилище1, РезультатПодбора = неопределено)
	//Если РезультатПодбора = неопределено Тогда
		РезультатПодбора = ПолучитьИзВременногоХранилища(ПланыОтправокВХранилище1);
	//КонецЕсли;
	
	Для Каждого Строка Из РезультатПодбора Цикл
		// Проверяем на уникальность
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Отправка",Строка.Отправка);
		НайденныеСтроки = Объект.Продукты.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()=0 Тогда
			Услуга = Объект.Продукты.Добавить();
			ЗаполнитьЗначенияСвойств(Услуга, Строка);
			
			Услуга.ГУИДСтроки = Строка(Новый УникальныйИдентификатор);
			// Если количество 40' целое, то ОК, есл нет, то нужно указать целое число 40' и одну 20'
			Если НЕ Окр(Услуга.Количество40,0,0) = Услуга.Количество40 Тогда
				Услуга.Количество40 = Цел(Услуга.Количество40);
				Услуга.Количество20 = 1;
			КонецЕсли;

			// для не заполненных ищем калькуляцию...		
			Для каждого СтрКК из Услуга.Продукт.ПланПродаж_Калькуляции Цикл
				Если СтрКК.Клиент = Услуга.Клиент ИЛИ НЕ ЗначениеЗаполнено(СтрКК.Клиент) Тогда Услуга.Калькуляция = СтрКК.Калькуляция; Прервать; КонецЕсли;
			КонецЦикла;
			
			// и если нашли, то вытаскиваем из нее ставки
			Если ЗначениеЗаполнено(Услуга.Калькуляция) Тогда
				
				// доходы 20
				Услуга.СтавкаЗа20 = Услуга.Калькуляция.море20_Вознаграждение + Услуга.Калькуляция.море20_Себестоимость + 
									Услуга.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Итог("Итого20") + Услуга.Калькуляция.ММ_Вознаграждение;
				Для каждого Стр8 из Услуга.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Услуга.СтавкаЗа20 = Услуга.СтавкаЗа20 + Стр8.Ставка20;
				КонецЦикла;
				
				// доходы 40
				Услуга.СтавкаЗа40 = Услуга.Калькуляция.море40_Вознаграждение + Услуга.Калькуляция.море40_Себестоимость + 
									Услуга.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Итог("Итого40") + Услуга.Калькуляция.ММ_Вознаграждение40;
				Для каждого Стр8 из Услуга.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Услуга.СтавкаЗа40 = Услуга.СтавкаЗа40 + Стр8.Ставка40;
				КонецЦикла;
				
				// контрибуция 20
				Услуга.КонтрибуцияЗа20 = Услуга.СтавкаЗа20 - Услуга.Калькуляция.море20_Себестоимость;
				Для каждого Стр8 из Услуга.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки Цикл
					Услуга.КонтрибуцияЗа20 = Услуга.КонтрибуцияЗа20 - Стр8.Цена20;
				КонецЦикла;
				Для каждого Стр8 из Услуга.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Услуга.КонтрибуцияЗа20 = Услуга.КонтрибуцияЗа20 - Стр8.Себестоимость20;
				КонецЦикла;
				
				// контрибуция 40
				Услуга.КонтрибуцияЗа40 = Услуга.СтавкаЗа40 - Услуга.Калькуляция.море40_Себестоимость;
				Для каждого Стр8 из Услуга.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки Цикл
					Услуга.КонтрибуцияЗа40 = Услуга.КонтрибуцияЗа40 - Стр8.Цена40;
				КонецЦикла;
				Для каждого Стр8 из Услуга.Калькуляция.ЖД_УслугиВнеСтавки Цикл
					Услуга.КонтрибуцияЗа40 = Услуга.КонтрибуцияЗа40 - Стр8.Себестоимость40;
				КонецЦикла;
				
				Если Услуга.Количество > 0 Тогда
					Услуга.СтавкаЗаТЕУ = (Услуга.Количество20*Услуга.СтавкаЗа20+Услуга.Количество40*Услуга.СтавкаЗа40)/Услуга.Количество;
					Услуга.КонтрибуцияЗаТЕУ = (Услуга.Количество20*Услуга.КонтрибуцияЗа20+Услуга.Количество40*Услуга.КонтрибуцияЗа40)/Услуга.Количество;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ПродуктыКлиентПриИзмененииНаСервере(ИД)
	
	ТекСтр = Объект.Продукты.НайтиПоИдентификатору(ИД);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",ТекСтр.Клиент);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		ТекСтр.Договор = ТЗ[0].Ссылка;
	Иначе
		ТекСтр.Договор = "";
	КонецЕсли;
	ТекСтр.Калькуляция = неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура ПродуктыКлиентПриИзменении(Элемент)
	
	ТекД = Элементы.Продукты.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПродуктыКлиентПриИзмененииНаСервере(ТекД.ПолучитьИдентификатор());
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПериодДокументаПриИзменении(Элемент)
	
	Объект.ДатаНачала = ПериодДокумента.ДатаНачала;
	Объект.ДатаОкончания = ПериодДокумента.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПериоду(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработчикВыбораСП", ЭтаФорма);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Показать(ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСП(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	Объект.ДатаНачала = П1.ДатаНачала;
	Объект.ДатаОкончания = П1.ДатаОкончания;
	
	РезСтруктура = ПолучитьСтруктуруОтправокПоПериоду(П1.ДатаНачала, П1.ДатаОкончания);
	
	Для каждого Стр из РезСтруктура Цикл
		
		Если Объект.Продукты.НайтиСтроки(Новый Структура("Отправка", Стр.Отправка)).Количество() > 0 Тогда Продолжить; КонецЕсли;
		
		НСтр 					= Объект.Продукты.Добавить();
		НСтр.Отправка 			= Стр.Отправка;
		НСтр.Продукт 			= Стр.Продукт;
		НСтр.Количество 		= Стр.ВсегоТЕУ;
		НСтр.ПлановаяДатаУслуги = Стр.ДатаУслуги;
		НСтр.Количество20 		= Стр.Двадцаток;
		НСтр.Количество40 		= Стр.Сороковок;
		НСтр.ГУИДСтроки 		= Строка(Новый УникальныйИдентификатор);
		
	КонецЦикла;
	
	ПодобратьКалькуляцииИСтавкиНаСервере();
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруОтправокПоПериоду(ДатаНачала, ДатаОкончания)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсыЖД.Ссылка КАК Ссылка,
	               |	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
	               |	РейсыЖД.КоличествоТЕУ КАК КоличествоТЕУ,
	               |	РейсыЖД.Продукт КАК Продукт
	               |ИЗ
	               |	Справочник.РейсыЖД КАК РейсыЖД
	               |ГДЕ
	               |	РейсыЖД.ДатаПрибытия МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ РейсыЖД.ПометкаУдаления
	               |	И НЕ РейсыЖД.РейсОтменен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПрибытия";
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		КоличествоДвадцаток = 0;
		СтруктураПроданныхКТК = Отправки_сервер.ПолучитьТаблицуПривязанныхКонтейнеров(Ответ.Ссылка);
		Для каждого Стр из СтруктураПроданныхКТК Цикл
			Если Стр.ТипКТК.ТЕУ = 1 Тогда
				КоличествоДвадцаток = КоличествоДвадцаток + Стр.КоличествоКТК;
			КонецЕсли;
		КонецЦикла;
		Результат.Добавить(Новый Структура("Отправка, Продукт, ДатаУслуги, ВсегоТЕУ, Двадцаток, Сороковок", Ответ.Ссылка, Ответ.Продукт, Ответ.ДатаПрибытия, Ответ.КоличествоТЕУ, КоличествоДвадцаток, (Ответ.КоличествоТЕУ-КоличествоДвадцаток)/2));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
