#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Выполняет добавление на вкладку "РазнесениеНаСчетаПокупателям" документа "Поступление на расчетный счет"
// счетов тех РТУ, которые указаны на вкладке "ДокументыОплаты".
// Евросиб Фролов (31.03.2022 Task №49440
Процедура РазнестиОплатуПоСчетамНаСервере(ПоступлениеНаРасчетныйСчет) Экспорт
	// Евросиб Фролов (01.04.2022 Task №49443 
	
	Если Не (ПоступлениеНаРасчетныйСчет.ДокументыОплаты.Количество() > 0
		И ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб СубботинВ #90789 16.08.2024 Начало
	МассивДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокСвязанныхДоговоров(ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента);
	//Евросиб СубботинВ #90789 16.08.2024 Конец

	//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
	
	ТекстЗапроса =
	"ВЫБРАТЬ 
	//Евросиб СубботинВ #84453 02.07.2024 Начало
	//|	ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации КАК ДокументРеализации,
	//|	ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты КАК СуммаОплаты
	//|ПОМЕСТИТЬ втТабличнаяЧасть
	//|ИЗ
	//|	&ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втТабличнаяЧасть.ДокументРеализации КАК ДокументРеализации,
	//|	ВЫРАЗИТЬ(втТабличнаяЧасть.ДокументРеализации КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю КАК СчетНаОплату,
	//|	втТабличнаяЧасть.СуммаОплаты КАК СуммаОплаты
	//|ПОМЕСТИТЬ втДокументыОплаты
	//|ИЗ
	//|	втТабличнаяЧасть КАК втТабличнаяЧасть
	//|ГДЕ
	//|	ВЫРАЗИТЬ(втТабличнаяЧасть.ДокументРеализации КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Каблов 04.09.2025 ( #115139
	//|	ВЫРАЗИТЬ(ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации КАК Документ.РеализацияТоваровУслуг) КАК ДокументРеализации,
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации КАК ДокументРеализации,
	//Евросиб Каблов 04.09.2025 ) #115139
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты КАК СуммаОплаты
	|ПОМЕСТИТЬ втТабличнаяЧасть
	|ИЗ
	|	&ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|	РеализацияТоваровУслуг.НомерДляПечати КАК НомерДляПечати,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугСчетаНаОплатуПокупателям.ВидДоходов = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	втТабличнаяЧасть.СуммаОплаты КАК СуммаОплаты
	|ПОМЕСТИТЬ втДокументыОплаты
	|ИЗ
	|	втТабличнаяЧасть КАК втТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|		ПО (втТабличнаяЧасть.ДокументРеализации = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка)
	//Евросиб СубботинВ #90789 16.08.2024 Начало //Добавил связь по договору
	|		И (РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю.ДоговорКонтрагента В (&Договоры))
	//Евросиб СубботинВ #90789 16.08.2024 Конец
	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (втТабличнаяЧасть.ДокументРеализации = РеализацияТоваровУслуг.Ссылка)
	
	//Евросиб Каблов 04.09.2025 ( #115139
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК ДокументРеализации,
	|	ОтчетКомитентуОПродажах.НомерДляПечати КАК НомерДляПечати,
	|	ОтчетКомитентуОПродажах.Дата КАК Дата,
	|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.ВидДоходов = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	втТабличнаяЧасть.СуммаОплаты КАК СуммаОплаты
	|ИЗ
	|	втТабличнаяЧасть КАК втТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
	|		ПО (втТабличнаяЧасть.ДокументРеализации = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка)
	|		И (ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю.ДоговорКонтрагента В (&Договоры))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ПО (втТабличнаяЧасть.ДокументРеализации = ОтчетКомитентуОПродажах.Ссылка)
	//Евросиб Каблов 04.09.2025 ) #115139
	
	|;	
	//Евросиб СубботинВ #84453 02.07.2024 Конец	
	|////////////////////////////////////////////////////////////////////////////////
	// Субботин 82477 04.04.2024 Начало
	|ВЫБРАТЬ
	|	Сумма(РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.НеразнесеннаяСуммаОборот) КАК НеразнесеннаяСуммаОборот,
	|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ ВтОстаткиПоСчетам
	|ИЗ
	|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Обороты(
	|		, , Регистратор,
	|		СчетПокупателю В
	|			(ВЫБРАТЬ
	|				втДокументыОплаты.СчетНаОплату КАК СчетНаОплату
	|			ИЗ
	|				втДокументыОплаты КАК втДокументыОплаты)) КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты 
	|Где  
	|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Регистратор <> &ДокРегистратор
	|СГРУППИРОВАТЬ ПО
	|	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю
	|;
	// Субботин 82477 04.04.2024 Конец//
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыОплаты.ДокументРеализации КАК ДокументРеализации,
	|	втДокументыОплаты.НомерДляПечати КАК НомерРеализации,
	|	втДокументыОплаты.Дата КАК ДатаРеализации,
	|	втДокументыОплаты.НомерДляПечати КАК НомерДляПечати,
	|	втДокументыОплаты.СчетНаОплату КАК СчетНаОплату,
	|	втДокументыОплаты.СчетНаОплату.Номер КАК НомерСчета,
	|	втДокументыОплаты.СчетНаОплату.Дата КАК ДатаСчета,
	|	втДокументыОплаты.Приоритет КАК Приоритет,
	|	Сумма(втДокументыОплаты.СуммаОплаты) КАК СуммаОплаты,
	// Субботин 82477 04.04.2024 начало убрал и поменял таблицу
	//старое 
	//|	ЕСТЬNULL(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток, 0) КАК НеразнесеннаяСуммаОстаток
	//|ИЗ
	//|	втДокументыОплаты КАК втДокументыОплаты 
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
	//|		ПО втДокументыОплаты.СчетНаОплату = РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю
	//новое
	|	ЕСТЬNULL(ВтОстаткиПоСчетам.НеразнесеннаяСуммаОборот, 0) КАК НеразнесеннаяСуммаОстаток
   	|ИЗ
    |	втДокументыОплаты КАК втДокументыОплаты 
    |	ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиПоСчетам КАК ВтОстаткиПоСчетам
    |		ПО втДокументыОплаты.СчетНаОплату = ВтОстаткиПоСчетам.СчетПокупателю 
		//добавил группировку
	|СГРУППИРОВАТЬ ПО
	|	втДокументыОплаты.ДокументРеализации,
	|	втДокументыОплаты.НомерДляПечати,
	|	втДокументыОплаты.Дата,
	|	втДокументыОплаты.НомерДляПечати,
	|	втДокументыОплаты.СчетНаОплату,
	|	втДокументыОплаты.СчетНаОплату.Номер,
	|	втДокументыОплаты.СчетНаОплату.Дата,
	|	Приоритет,
	|	ЕСТЬNULL(ВтОстаткиПоСчетам.НеразнесеннаяСуммаОборот, 0)
		// Субботин 82477 04.04.2024 Конец
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ДатаСчета,
	|	ДокументРеализации,	
	|	СчетНаОплату
	//Евросиб Каблов 04.09.2025 ( #115139
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТабличнаяЧасть.ДокументРеализации КАК ДокументРеализации,
	|	СУММА(втТабличнаяЧасть.СуммаОплаты) КАК СуммаОплаты
	|ИЗ
	|	втТабличнаяЧасть КАК втТабличнаяЧасть
	|
	|СГРУППИРОВАТЬ ПО
	|	втТабличнаяЧасть.ДокументРеализации";
	//Евросиб Каблов 04.09.2025 ) #115139
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДокументыОплаты", ПоступлениеНаРасчетныйСчет.ДокументыОплаты.Выгрузить());
	// Субботин 82477 04.04.2024 начало 
	Запрос.УстановитьПараметр("ДокРегистратор", ПоступлениеНаРасчетныйСчет.Ссылка);
	// Субботин 82477 04.04.2024 Конец
	//Евросиб СубботинВ #90789 16.08.2024 Начало //
	Запрос.УстановитьПараметр("Договоры", МассивДоговоров);
    //Евросиб СубботинВ #90789 16.08.2024 Конец //
	
	//Евросиб Каблов 04.09.2025 ( #115139
	//Результат = Запрос.Выполнить();
	Результаты = Запрос.ВыполнитьПакет();
	Результат = Результаты[3];
	ОстатокСуммы = ПоступлениеНаРасчетныйСчет.СуммаДокумента;
	//Евросиб Каблов 04.09.2025 ) #115139
	
	Если Не Результат.Пустой() Тогда
		
		//Евросиб Каблов 04.09.2025 ( #115139
		ТаблицаОплат = Результаты[4].Выгрузить();
		//Евросиб Каблов 04.09.2025 ) #115139
				
		Выборка = Результат.Выбрать();
		
		НомерПоступления = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПоступлениеНаРасчетныйСчет.Номер);

		ШаблонСообщенияУспешнойПривязки = "Счет на оплату №%1 от %2 г. (к реализации №%3 от %4 г.) успешно добавлен в поступление на расчетный счет №%5 от %6 г.";
		ШаблонСообщения = "Счет на оплату №%1 от %2 г. (к реализации №%3 от %4 г.) НЕ добавлен в поступление на расчетный счет №%5 от %6 г., т.к. сумма оплаты (%7) больше неразнесенной суммы (%8)";
		
		Пока Выборка.Следующий() Цикл
			// Субботин 82477 04.04.2024 Начало //
			
			//Евросиб Каблов 04.09.2025 ( #115139
			//Если Выборка.СуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
			СтрокаПоРеализации = ТаблицаОплат.Найти(Выборка.ДокументРеализации, "ДокументРеализации");
			Если СтрокаПоРеализации = Неопределено Тогда
				Продолжить;
			ИначеЕсли СтрокаПоРеализации.СуммаОплаты = 0 Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Каблов 04.09.2025 ) #115139
			
			// Субботин 82477 04.04.2024 Конец //
			НомерСчета = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НомерСчета);
			
			//Евросиб СубботинВ #92045 14.10.2024 Начало 
			
			ВалютаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СчетНаОплату, "ВалютаДокумента");
			ОстатокВВалютеОплаты = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.НеразнесеннаяСуммаОстаток, ВалютаСчета,
																		ПоступлениеНаРасчетныйСчет.ВалютаДокумента,
																		ПоступлениеНаРасчетныйСчет.ДатаВзаиморасчетов);			
			
			
			//Если Выборка.НеразнесеннаяСуммаОстаток >= Выборка.СуммаОплаты Тогда
			
			//Евросиб Каблов 04.09.2025 ( #115139
			//Если ОстатокВВалютеОплаты >= Выборка.СуммаОплаты Тогда
			СуммаРазнесения = Мин(ОстатокВВалютеОплаты, СтрокаПоРеализации.СуммаОплаты);			
			Если СуммаРазнесения > ОстатокСуммы Тогда
				Прервать;
			КонецЕсли;
			
			Если СуммаРазнесения <> 0 Тогда
				
				СтрокаПоРеализации.СуммаОплаты = СтрокаПоРеализации.СуммаОплаты - СуммаРазнесения;
				ОстатокСуммы = ОстатокСуммы - СуммаРазнесения;
			//Евросиб Каблов 04.09.2025 ) #115139
			//Евросиб СубботинВ #92045 14.10.2024 Конец 
			
				СтрокаРазнесения = ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям.Добавить();
				СтрокаРазнесения.РаспознанныйНомерДокумента 	= Выборка.НомерДляПечати;
				СтрокаРазнесения.СчетПокупателю 				= Выборка.СчетНаОплату;
				//Евросиб Каблов 04.09.2025 ( #115139
				//СтрокаРазнесения.РазнесеннаяСумма 				= Выборка.СуммаОплаты;
				СтрокаРазнесения.РазнесеннаяСумма 				= СуммаРазнесения;
				//Евросиб Каблов 04.09.2025 ) #115139
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
				СтрокаРазнесения.СпособРазнесения 				= Перечисления.СпособыРазнесенияСчетовПокупателям.ПоРТУ;
				СтрокаРазнесения.Пользователь 					= ТекущийПользователь;
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
				
				//Евросиб СубботинВ #92045 14.10.2024 Начало
				ЗаполнитьДанныеСтрокиПоМультивалютномуСчету(СтрокаРазнесения, ПоступлениеНаРасчетныйСчет.ВалютаДокумента, ПоступлениеНаРасчетныйСчет.ДатаВзаиморасчетов); 
				//Евросиб СубботинВ #92045 14.10.2024 Конец
			//Евросиб Каблов 04.09.2025 ( #115139
			//	ТекстСообщения = СтрШаблон(ШаблонСообщенияУспешнойПривязки,
			//								НомерСчета,
			//								Формат(Выборка.ДатаСчета, "ДЛФ=D"),
			//								Выборка.НомерРеализации,
			//								Формат(Выборка.ДатаРеализации, "ДЛФ=D"),
			//								НомерПоступления,
			//								Формат(ПоступлениеНаРасчетныйСчет.Дата, "ДЛФ=D"));
			//
			//Иначе
			//	ТекстСообщения = СтрШаблон(ШаблонСообщения,
			//								НомерСчета,
			//								Формат(Выборка.ДатаСчета, "ДЛФ=D"),
			//								Выборка.НомерРеализации,
			//								Формат(Выборка.ДатаРеализации, "ДЛФ=D"),
			//								НомерПоступления,
			//								Формат(ПоступлениеНаРасчетныйСчет.Дата, "ДЛФ=D"),
			//								Выборка.СуммаОплаты,
			//								//Евросиб СубботинВ #92045 14.10.2024 Начало 
			//								//Выборка.НеразнесеннаяСуммаОстаток);
			//								ОстатокВВалютеОплаты);
			//								//Евросиб СубботинВ #92045 14.10.2024 Конец
			//Евросиб Каблов 04.09.2025 ) #115139
			КонецЕсли;	
			
			//Евросиб Каблов 04.09.2025 ( #115139
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПоступлениеНаРасчетныйСчет);
			//Евросиб Каблов 04.09.2025 )
		КонецЦикла;
		
		//Евросиб СубботинВ #92045 14.10.2024 Начало
		Для Каждого СтрокаРазнесений Из ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям Цикл 
			ВалютаВзаиморасчетовСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРазнесений.СчетПокупателю, "ВалютаДокумента");
			Если ВалютаВзаиморасчетовСчета <> ПоступлениеНаРасчетныйСчет.ВалютаДокумента Тогда 
				ПоступлениеНаРасчетныйСчет.ВалютаСчетаОтличнаОтВалютыОплаты = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		//Евросиб СубботинВ #92045 14.10.2024 Конец		
	КонецЕсли;	
	
	// Евросиб Фролов)
КонецПроцедуры

// Субботин 82477 01.04.2024 начало // удаляет счет из списка разнесения.
Процедура УдалитьСчетИзРазнесенияПоступления(ТаблицаРазнесения, Счета) Экспорт 
	
	//ПараметрыПоиска = Новый Структура("СчетПокупателю", Счет);	
	//НайденныеСтроки = ТаблицаРазнесения.НайтиСтроки(ПараметрыПоиска);
	//Для каждого НайденнаяСтрока из НайденныеСтроки  Цикл
	//	ТаблицаРазнесения.удалить(НайденнаяСтрока);
	//КонецЦикла;
	
		//Евросиб СубботинВ #92045 14.10.2024 Начало переписала алгоритм, т.к отказались от реквзиита счетв  шапке РТУ 
    //Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации и поменялся алгоритм
	//	ТаблицаСчетов = Счета.Выгрузить();
	//Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации

	Для Каждого СтрокаСоСчетомРТУ из Счета Цикл
		//ПараметрыПоиска = Новый Структура("СчетПокупателю", СтрокаСоСчетомРТУ.СчетПокупателю);	
		//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
		ПараметрыПоиска = Новый Структура("СчетПокупателю, СпособРазнесения", СтрокаСоСчетомРТУ.СчетПокупателю, Перечисления.СпособыРазнесенияСчетовПокупателям.ПоРТУ);
		//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
		НайденныеСтроки = ТаблицаРазнесения.НайтиСтроки(ПараметрыПоиска);
		Для каждого НайденнаяСтрока из НайденныеСтроки  Цикл
			ТаблицаРазнесения.удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;	
	//Евросиб СубботинВ #92045 14.10.2024 Конец 

	
КонецПроцедуры
// Субботин 82477 01.04.2024 начало 

//Евросиб СубботинВ #90789 16.08.2024 Начало      //Евросиб СубботинВ #92045 26.09.2024 Начало // добавил парам ЗаполнениеРазнесеннойСуммы
Процедура ЗаполнитьДанныеСтрокиПоМультивалютномуСчету(СтрокаРазнесений, ВалютаДокумента, ДатаВзаиморасчетов) Экспорт
	
	Если не ЗначениеЗаполнено(СтрокаРазнесений.ДатаКурса) Тогда
		СтрокаРазнесений.ДатаКурса = ДатаВзаиморасчетов;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаРазнесений.Валюта) Тогда
		СтрокаРазнесений.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРазнесений.СчетПокупателю, "ВалютаДокумента");
	КонецЕсли;			
	Если Не ЗначениеЗаполнено(СтрокаРазнесений.КурсОплаты) Тогда
		
		//Евросиб СубботинВ #90789 16.08.2024 Начало // доп правка добавил условия по валютам, т.к могут отличаться
		Если СтрокаРазнесений.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() и ВалютаДокумента <> СтрокаРазнесений.Валюта Тогда			
			СтрокаРазнесений.КурсОплаты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, СтрокаРазнесений.ДатаКурса).Курс;
		ИначеЕсли СтрокаРазнесений.Валюта = ВалютаДокумента Тогда
			СтрокаРазнесений.КурсОплаты = 1;
		Иначе
			СтрокаРазнесений.КурсОплаты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаРазнесений.Валюта, СтрокаРазнесений.ДатаКурса).Курс;
		КонецЕсли;
		//Евросиб СубботинВ #90789 16.08.2024 Конец // доп правка добавил условия по валютам, т.к могут отличаться
	КонецЕсли;
	
	//Евросиб СубботинВ #92045 26.09.2024 Начало 	
	Если Не ЗначениеЗаполнено(СтрокаРазнесений.КурсВзаиморасчетов) Тогда
	      СтрокаРазнесений.КурсВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРазнесений.СчетПокупателю, "КурсВзаиморасчетов");
		  Если Не ЗначениеЗаполнено(СтрокаРазнесений.КурсВзаиморасчетов) Тогда
             СтрокаРазнесений.КурсВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаРазнесений.Валюта,СтрокаРазнесений.ДатаКурса).Курс;
          КонецЕсли;			 
    КонецЕсли;	
	СтрокаРазнесений.СуммаВВалюте = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрокаРазнесений.РазнесеннаяСумма,
				ВалютаДокумента, СтрокаРазнесений.Валюта, СтрокаРазнесений.ДатаКурса);
	//Евросиб СубботинВ #92045 26.09.2024 Конец			
				
КонецПроцедуры
//Евросиб СубботинВ #90789 16.08.2024 Конец 


#КонецОбласти

#КонецЕсли    
