
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьПоступлениеНаРС.Получить();
	ТребуетсяАвтоматическоеРазнесениеПоСчетам = Константы.АвторазнесениеВхПлатежейПоСчетамПокупателям.Получить();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьПоступлениеНаРС.Получить();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 81912/ TA 82268, 03-04-2024, начало
&НаСервере
Функция ЕстьПравоПровестиНеПроведенныйДокумент(РежимЗаписи)
	ДокументМеняетСтатусНаПроведенный = (РежимЗаписи = РежимЗаписиДокумента.Проведение) И НЕ Проведен;
	Если НЕ ДокументМеняетСтатусНаПроведенный Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ПравоДоступа("ОтменаПроведения", ЭтотОбъект.Метаданные()); //Определяем по доступу на отмену проведения
КонецФункции
//ДИТ, Беляев СЮ, US 81912/ TA 82268, 03-04-2024, конец

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб СубботинВ #103438 24.02.2025 Начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.Регистратор КАК Документ,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.СуммаРасход КАК Сумма,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.Валюта КАК Валюта,
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.КурсВзаиморасчетов КАК КурсВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.РазнесениеВходящихПлатежейПоСчетамПокупателей.Обороты(, , Регистратор, Поступление = &Поступление) КАК РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты
	|ГДЕ
	|	РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.СуммаРасход > 0
	|	И РазнесениеВходящихПлатежейПоСчетамПокупателейОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга";
	
	Запрос.УстановитьПараметр("Поступление", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если не РезультатЗапроса.Пустой() Тогда
		ВыгрузкаЗапроса = РезультатЗапроса.Выгрузить();
		СуммаПеренесенныхДС = ВыгрузкаЗапроса.Итог("Сумма");
	Иначе
		СуммаПеренесенныхДС = 0;
	КонецЕсли;	
		
	РазнесеннаяСумма = РазнесениеНаСчетаПокупателям.Итог("РазнесеннаяСумма");
	
	Если РазнесеннаяСумма + СуммаПеренесенныхДС > СуммаДокумента Тогда
		//Сообщить("Сумма привязанных счетов покупателям (" + РазнесеннаяСумма + ") не должна превышать сумму документа ("+СуммаДокумента+"). Проведение отменено.");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сумма привязанных счетов покупателям (%1) %3 не должна превышать сумму документа (%2). Проведение отменено."
														,РазнесеннаяСумма, СуммаДокумента,
														?(СуммаПеренесенныхДС <> 0, "и сумма перенесенных средств ("+СуммаПеренесенныхДС+")","")));
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//Евросиб СубботинВ #103438 24.02.2025 Конец
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	//ДИТ, Беляев СЮ, US 81912/ TA 82268, 03-04-2024, начало (необходмо разрешить изменение и перепроведение документа, проведение непроведённого запретить, снятие с проведения запретить)
	Если НЕ ЕстьПравоПровестиНеПроведенныйДокумент(РежимЗаписи) Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет доступа проводить непроведенный документ");
		Отказ = Истина;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 81912/ TA 82268, 03-04-2024, конец
	
	//// Субботин 79718 22.01.2024 начало// перенес код чтобы он отрабатывал всегда
	////Евросиб Каблов 03.02.2021 ( Ticket#0216383
	//Если Не ЭтоНовый() Тогда
	//	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Очистить();
	//	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записать();
	//КонецЕсли;
	////Евросиб Каблов 03.02.2021 )
	//// Субботин 79718 22.01.2024 Конец
	
	//Если ТребуетсяАвтоматическоеРазнесениеПоСчетам и НЕ ВыполненаПопыткаРазнесения Тогда
	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, начало (не выполнять разнесение и соответственно очистку движений по <РазнесениеСчетовПокупателейПоВходящимПлатежам> для режима записи без перепроведения)
	ЗапретитьРазнесение = Не ЭтоНовый() И Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись;
	Если ТребуетсяАвтоматическоеРазнесениеПоСчетам и НЕ ВыполненаПопыткаРазнесения И НЕ ЗапретитьРазнесение Тогда
	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, конец
	
		// Субботин 79718 22.01.2024 начало// перенес код чтобы он отрабатывал всегда
		//Евросиб Каблов 03.02.2021 ( Ticket#0216383
		//Если Не ЭтоНовый() Тогда
		//	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Очистить();
		//	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записать();
		//КонецЕсли;
		////Евросиб Каблов 03.02.2021 )
		// Субботин 79718 22.01.2024 Конец
		//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, начало (вернул очистку движений в условие)
		Если Не ЭтоНовый() Тогда
			Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Очистить();
			Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записать();
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, конец
		
		НаборНеЗначСимв = ПолучитьНаборНеЗначСимв();
		
		ПреобразовНазнач = ВРег(УдалитьНеЗначащиеСимволы(НазначениеПлатежа, НаборНеЗначСимв) );
		
		РазнесениеНаСчетаПокупателям.Очистить();
		ТребуетсяРазнестиСумму = СуммаДокумента;
		//Евросиб СубботинВ #90789 16.08.2024 Начало
		МассивДоговоровПоПТУ = Справочники.ДоговорыКонтрагентов.ПолучитьСписокСвязанныхДоговоров(ДоговорКонтрагента);
		//Евросиб СубботинВ #90789 16.08.2024 Конец

		// попытка по договорам
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор КАК Договор,
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК Сумма,
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю КАК СчетПокупателю,
		//Евросиб СубботинВ #92045 14.10.2024 начало // добавил получение валюты в рамках оптимизации
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ВалютаДокумента КАК ВалютаСчета,
		//Евросиб СубботинВ #92045 14.10.2024 Конец // 
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.НомерДляПечати КАК НомерДляПечати
		|ИЗ
		|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки(, Договор В (&Договора)) КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		|ГДЕ
		//Евросиб СубботинВ #90789 16.08.2024 Начало
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор = &Договор
		//Евросиб СубботинВ #90789 16.08.2024 Конец
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.НомерДляПечати <> """"
		|	И РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ЦФО = &ЦФО
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.Дата";
		//Евросиб СубботинВ #90789 16.08.2024 Начало
      	//Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
       	Запрос.УстановитьПараметр("Договора", МассивДоговоровПоПТУ);
		//Евросиб СубботинВ #90789 16.08.2024 Конец
		
		//Субботин 81466  04.03.2024 начало
		Запрос.УстановитьПараметр("ЦФО", ЦФО);
		//Субботин 81466  04.03.2024 Конец
		Рез1 = Запрос.Выполнить();
		ОтветВыполнить = Рез1;

		
		//Евросиб СубботинВ #90789 16.08.2024 Начало //переход на единый алгоритм, с поиском только по договорам при наличии мультивалютки 
													 //или текущему договору если признак мультивалюты отсутствует
		//Рез2 = Неопределено;
		//
		//Запрос.Текст = "ВЫБРАТЬ
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор КАК Договор,
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК Сумма,
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю КАК СчетПокупателю,
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.НомерДляПечати КАК НомерДляПечати
		//|ИЗ
		//|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		//|ГДЕ
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент = &Контрагент
		//|	И РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.НомерДляПечати <> """"
		////Субботин 81466  04.03.2024 начало
		//|	И РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ЦФО = &ЦФО
		////Субботин 81466  04.03.2024 Конец
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.Дата";
		//Запрос.УстановитьПараметр("Контрагент", Контрагент);
		////Субботин 81466  04.03.2024 начало
		//Запрос.УстановитьПараметр("ЦФО", ЦФО);
		////Субботин 81466  04.03.2024 Конец
		//Рез2 = Запрос.Выполнить();
		//
		//Если Рез1.Пустой() Тогда	
		//	ОтветВыполнить = Рез2;
		//КонецЕсли;
		//Евросиб СубботинВ #90789 16.08.2024 Конец
		
		ОтветВыполнить = ОтветВыполнить.Выбрать();
		Пока ОтветВыполнить.Следующий() Цикл 
			
			//Евросиб СубботинВ #92045 14.10.2024 начало // в рамках задачи так же в строках поменял "ОтветВыполнить.Сумма на СуммаПодСписание"
			 //ВалютаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветВыполнить.СчетПокупателю, "ВалютаДокумента"); убрал получение (в рамках оптимизации) в запрос
			Если ВалютаДокумента <> ОтветВыполнить.ВалютаСчета Тогда
				СуммаПодСписание =  РаботаСКурсамиВалют.ПересчитатьВВалюту(ОтветВыполнить.Сумма, ОтветВыполнить.ВалютаСчета, ВалютаДокумента, ДатаВзаиморасчетов);
			Иначе 
				СуммаПодСписание = ОтветВыполнить.Сумма;	
			КонецЕсли;	
			//Евросиб СубботинВ #92045 14.10.2024 Конец
			
			Если ТребуетсяРазнестиСумму = 0 Тогда Прервать; КонецЕсли;
			Если СтрНайти(НазначениеПлатежа, ОтветВыполнить.НомерДляПечати) <> 0 Тогда //Евросиб Гудкова( 12.12.2019 неопределено Тогда
				НСтр = РазнесениеНаСчетаПокупателям.Добавить();
				НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
				НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю; 
				//Евросиб СубботинВ #92045 14.10.2024 начало //
				//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
				НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
				//Евросиб СубботинВ #92045 14.10.2024 Конец
				ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
				НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
				НСтр.Пользователь = Редактор;
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
				Продолжить; // прерываем поиск
			КонецЕсли;
			
			// Шейко О.Е. (27.10.2020)
			// 1. Пробуем откинуть не значащие символы
			ПреобразовНомДляПеч = УдалитьНеЗначащиеСимволы(ОтветВыполнить.НомерДляПечати, НаборНеЗначСимв);
			Если СтрНайти(ПреобразовНазнач, ПреобразовНомДляПеч) <> 0 Тогда //Евросиб Гудкова( 12.12.2019 неопределено Тогда
				НСтр = РазнесениеНаСчетаПокупателям.Добавить();
				НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
				НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
				//Евросиб СубботинВ #92045 14.10.2024 начало //
				//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
				НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
				//Евросиб СубботинВ #92045 14.10.2024 Конец
				ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
				НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
				НСтр.Пользователь = Редактор;
				//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
				Продолжить; // прервыем поиск
			КонецЕсли;
			// 2. Пробуем откидывать лидирующие нули
			Если СтрДлина(ПреобразовНомДляПеч) > 1 Тогда
				
				Для Сч = 1 По СтрДлина(ПреобразовНомДляПеч) Цикл
					
					Если Сред(ПреобразовНомДляПеч, Сч, 1) = "0" Тогда
						
						
						
					Иначе	
						ТекСтрока = ВРег(Сред(ПреобразовНомДляПеч, Сч));
						Прервать;
					КонецЕсли; 
					
				КонецЦикла;
				
				Если СтрНайти(ПреобразовНазнач, ТекСтрока) <> 0 Тогда
					НСтр = РазнесениеНаСчетаПокупателям.Добавить();
					НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
					НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
					//Евросиб СубботинВ #92045 14.10.2024 начало //
					//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
					НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
					//Евросиб СубботинВ #92045 14.10.2024 Конец
					ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
					//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
					НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
					НСтр.Пользователь = Редактор;
					//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
					Продолжить;
				КонецЕсли;
				
				// 3. Пробуем проверить варианты при ошибках Анг-рус
				// 3.1. Вариант когда счет с рус Р
				Если СтрНайти(ТекСтрока, "Р") > 0 Тогда
					
					Если СтрНайти(ПреобразовНазнач, "P") > 0 Тогда // англ P (ткнули в англ P вместо рус)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "P", "Р");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли; 
					
					Если СтрНайти(ПреобразовНазнач, "З") > 0 Тогда // рус З вместо P рус (ткнули в англ P)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "З", "Р");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли; 
					
					Если СтрНайти(ПреобразовНазнач, "H") > 0 Тогда // англ H (не верная раскладка)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "H", "Р");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				// 3.2. Вариант когда счет с рус Н
				Если СтрНайти(ТекСтрока, "Н") > 0 Тогда
					
					Если СтрНайти(ПреобразовНазнач, "Р") > 0 Тогда // рус Р (ткнули в рус Р которая англ H)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "Р", "Н");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли; 
					
					Если СтрНайти(ПреобразовНазнач, "H") > 0 Тогда // англ H (ткнули в рус Р которая англ H)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "H", "Н");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрНайти(ПреобразовНазнач, "Y") > 0 Тогда // англ Y (не верная раскладка)
						
						ПопНазн = СтрЗаменить(ПреобразовНазнач, "Y", "Н");
						
						Если СтрНайти(ПопНазн, ТекСтрока) <> 0 Тогда
							НСтр = РазнесениеНаСчетаПокупателям.Добавить();
							НСтр.РаспознанныйНомерДокумента = ОтветВыполнить.НомерДляПечати;
							НСтр.СчетПокупателю = ОтветВыполнить.СчетПокупателю;
							//Евросиб СубботинВ #92045 14.10.2024 начало //
							//НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, ОтветВыполнить.Сумма);
							НСтр.РазнесеннаяСумма = Мин(ТребуетсяРазнестиСумму, СуммаПодСписание);
							//Евросиб СубботинВ #92045 14.10.2024 Конец
							ТребуетсяРазнестиСумму = ТребуетсяРазнестиСумму - НСтр.РазнесеннаяСумма;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, начало
							НСтр.СпособРазнесения = Перечисления.СпособыРазнесенияСчетовПокупателям.ПоНазначениюПлатежа;
							НСтр.Пользователь = Редактор;
							//Евросиб(ДИТ), Беляев СЮ, BUG 104029 / TA 104043, 07-03-2025, конец
							Продолжить;
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
	// Субботин 79718 22.01.2024 начало//	вынес проверку в общий код, вне зависимоти от способа разнесения
		//УспешноРазнесенаВсяСумма = (РазнесениеНаСчетаПокупателям.Итог("РазнесеннаяСумма") = СуммаДокумента);
	// Субботин 79718 22.01.2024 Конец//
		ВыполненаПопыткаРазнесения = Истина;
		
		//Евросиб СубботинВ #90789 16.08.2024 Начало
		Для Каждого СтрокаРазнесений Из РазнесениеНаСчетаПокупателям Цикл 
			ВалютаВзаиморасчетовСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРазнесений.СчетПокупателю, "ВалютаДокумента");
			Если ВалютаВзаиморасчетовСчета <> ВалютаДокумента Тогда
				ВалютаСчетаОтличнаОтВалютыОплаты = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ВалютаСчетаОтличнаОтВалютыОплаты Тогда	
			Для Каждого СтрокаРазнесений Из РазнесениеНаСчетаПокупателям Цикл
				Документы.ПоступлениеНаРасчетныйСчет.ЗаполнитьДанныеСтрокиПоМультивалютномуСчету(СтрокаРазнесений, ВалютаДокумента, ДатаВзаиморасчетов);
			КонецЦикла;
		КонецЕсли;
			
		//Евросиб СубботинВ #90789 16.08.2024 Конец	
		
	КонецЕсли; 
    // Субботин 79718 22.01.2024 начало//	вынес проверку в общий код, вне зависимоти от способа разнесения
	УспешноРазнесенаВсяСумма = (РазнесениеНаСчетаПокупателям.Итог("РазнесеннаяСумма") = СуммаДокумента);
   	// Субботин 79718 22.01.2024 Конец//
	
	// + Состояния
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента
	ИЛИ Состояния.Количество() = 0 //Гудкова 09.07.2020
	ИЛИ УспешноРазнесенаВсяСумма <> Ссылка.УспешноРазнесенаВсяСумма; // Субботин 79718 22.01.2024  // добавил проверку изменения реквизита успешности разнесения
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
		ПараметрыЗапроса.Вставить("УспешноРазнесенаВсяСумма", УспешноРазнесенаВсяСумма);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПоступлениеНаРС(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	// - Состояния 
	
	//Евросиб Коханенко Н.А. 21.08.2025 (( #117444 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьДоплатныеПВ
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК РазнесениеНаСчетаПокупателям
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|	ПО (ЗначенияДополнительныхАналитикДокументов.Документ = РазнесениеНаСчетаПокупателям.СчетПокупателю)
		|		И (ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности))
		|		И (ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДоплатныеПВ))
		|ГДЕ
		|	РазнесениеНаСчетаПокупателям.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(Ссылка, ПредопределенноеЗначение("Перечисление.ВидыЗадолженности.ДоплатныеПВ"));
	КонецЕсли;
	//Евросиб Коханенко Н.А. 21.08.2025 )) #117444 
	
	//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Начало
	ГруппаДКСВРС = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(Ссылка);
	СостояниеГруппыДКС = ПредопределенноеЗначение("Справочник.Состояния.ЗаполнитьПолеГруппаДКС"); 
	Если ДополнительныеСвойства.Свойство("ГруппаДКС") И ЗначениеЗаполнено(ДополнительныеСвойства.ГруппаДКС) Тогда 
		Если Не ДополнительныеСвойства.ГруппаДКС = ГруппаДКСВРС Тогда 
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(Ссылка, ДополнительныеСвойства.ГруппаДКС);
		КонецЕсли; 

		СтрокаТЧСостояния = Состояния.Найти(СостояниеГруппыДКС, "Состояние");
		Если Не СтрокаТЧСостояния = Неопределено Тогда
			СтрокаТЧСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
		КонецЕсли;	
	Иначе 
		МассивСчетов = РазнесениеНаСчетаПокупателям.Выгрузить(,"СчетПокупателю").ВыгрузитьКолонку("СчетПокупателю"); 
		Если Не МассивСчетов.Количество() = 0 Тогда 
			МассивГрупДКС = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппыДКССвязанныхДокументов(МассивСчетов); 
			Если МассивГрупДКС.Количество() = 1 Тогда
				РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(Ссылка, МассивГрупДКС[0]);
			Иначе
				СтрокаТЧСостояния = Состояния.Найти(СостояниеГруппыДКС, "Состояние");
				Если СтрокаТЧСостояния = Неопределено Тогда
					
					НовСтр = Состояния.Добавить();
					НовСтр.Состояние = СостояниеГруппыДКС; 				
					
					СтрокаТЧПредСостояния = Состояния.Найти(ПредопределенноеЗначение("Справочник.Состояния.Выполнение"), "Состояние");
					Если Не СтрокаТЧПредСостояния = Неопределено Тогда
						НовСтр.Исполнитель = СтрокаТЧПредСостояния.Исполнитель;
					Иначе
						НовСтр.Исполнитель = Стр.Исполнитель;
					КонецЕсли; 		 
					НовСтр.Наблюдатель = Автор;
					НовСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
					НовСтр.НачалоРаботы = ТекущаяДата();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Конец           
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	//Евросиб СубботинВ #103438 24.02.2025 перенес в проверку заполнения	
	//РазнесеннаяСумма = РазнесениеНаСчетаПокупателям.Итог("РазнесеннаяСумма");
	//
	//Если РазнесеннаяСумма > СуммаДокумента Тогда
	//	Сообщить("Сумма привязанных счетов покупателям (" + РазнесеннаяСумма + ") не должна превышать сумму документа ("+СуммаДокумента+"). Проведение отменено.");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//Евросиб СубботинВ #103438 24.02.2025 Начало
	
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Дата);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записывать = Истина;
	//Евросиб Субботин 92530 22.10.2024 начало
	Движения.ЗаявкиНаРасходованиеДенежныхСредств.Записывать = Истина;
    //Евросиб Субботин 92530 22.10.2024 Конец 
	
	Для каждого Стр из РасшифровкаПлатежа Цикл
		
		//Евросиб Каблов 07.09.2021 ( Ticket#0240419
		ПараметрыКурсаПоСтроке = Новый Структура("Валюта, Курс, Кратность", ВалютаДокумента, Стр.КурсВзаиморасчетов, Стр.КратностьВзаиморасчетов);
		//Евросиб Каблов 07.09.2021 )
		
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();		
		//Измерения
		Движение.Период = ДатаВзаиморасчетов;
		Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход;
		Движение.Организация = Организация;
		Движение.БанковскийСчет = СчетОрганизации;
		Движение.СтатьяДвиженияДенежныхСредств = Стр.СтатьяДвиженияДенежныхСредств;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
		Движение.Счет = ?(ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя, Стр.Сделка, ДокументОснование);
		Движение.ДокументДвижения = Ссылка;				
		//Ресурсы
		Движение.СуммаВал = Стр.СуммаВзаиморасчетов;
		//Евросиб Каблов 07.09.2021 ( Ticket#0240419
		//Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаВзаиморасчетов, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаВзаиморасчетов, ПараметрыКурсаПоСтроке, ПараметрыКурсаРегл);
		//Евросиб Каблов 07.09.2021 )
		
//Евросиб Гудкова( 10.11.2020 Ticket№ 0213176
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
	    	//Евросиб Каблов 07.10.2022 ( 54532
			//Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//Движение.Период = ДатаВзаиморасчетов;
			//Движение.Организация = Организация;
			//Движение.Контрагент = Контрагент;
			//Движение.Договор = ДоговорКонтрагента;
			//Движение.ВалютаРасчетов = ВалютаДокумента;
			//Движение.ДатаРасчетов = Дата;
			//Движение.ДокументВзаиморасчетов = Ссылка;
			//Движение.СуммаСНДС = Стр.СуммаВзаиморасчетов;
			//СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаВзаиморасчетов, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДС), Истина, Истина);
			//Движение.СуммаНДС = СуммаНДС;
			//Движение.СуммаБезНДС = Стр.СуммаВзаиморасчетов - СуммаНДС;
			////Евросиб Каблов 18.03.2021 (
			//Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			//Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			//Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			////Евросиб Каблов 18.03.2021 )
			ВзаиморасчетыСервер.ПоступлениеНаРасчетныйСчет_СформироватьДвиженияВзаиморасчетыСПокупателями(ЭтотОбъект);
			//Евросиб Каблов 07.10.2022 )
		Иначе
			Если ЗначениеЗаполнено(Стр.Сделка) Тогда
				Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
				Движение.Период 		= ДатаВзаиморасчетов;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= Контрагент;
				Движение.Договор 		= ДоговорКонтрагента;
				Движение.СчетПоставщика	= Стр.Сделка;
				Движение.Сумма			= -Стр.СуммаВзаиморасчетов;
			КонецЕсли; 
			
			Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
			Движение.Период 		= ДатаВзаиморасчетов;
			Движение.Организация 	= Организация;
			Движение.Контрагент 	= Контрагент;
			Движение.Договор 		= ДоговорКонтрагента;
			Движение.ДокументВзаиморасчетов	= Стр.Сделка; 
			//Евросиб Фокеева( 09.11.2022 Ticket№0291287
			//Движение.СуммаСНДС 		= - СуммаДокумента;
			//Движение.СуммаНДС 		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 - СуммаНДСДокумента;
			//Движение.СуммаБезНДС 	= СуммаДокумента - СуммаНДСДокумента;  
			Движение.СуммаСНДС 		= - Стр.СуммаВзаиморасчетов;
			Движение.СуммаНДС 		= - Стр.СуммаНДС;
			Движение.СуммаБезНДС 	= Стр.СуммаНДС - Стр.СуммаВзаиморасчетов;        
			//Евросиб Фокеева)
			Движение.ДатаРасчетов 	= ДатаВзаиморасчетов
		КонецЕсли;
		// Евросиб Гудкова)
		
		//Евросиб Субботин 92530 22.10.2024 начало
		Если ЗначениеЗаполнено(Стр.ЗаявкаНаОплату) Тогда		  
			Движение = Движения.ЗаявкиНаРасходованиеДенежныхСредств.ДобавитьПриход();
			Движение.Период = ДатаВзаиморасчетов;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Стр.ДоговорКонтрагента;
			Движение.Сделка = Стр.Сделка;
			Движение.ЗаявкаНаОплату = Стр.ЗаявкаНаОплату;
			Движение.Валюта = ВалютаДокумента;
			Движение.Сумма = Стр.СуммаВзаиморасчетов;
		КонецЕсли;
		//Евросиб Субботин 92530 22.10.2024 Конец 
		
	КонецЦикла;

//Евросиб Каблов 07.10.2022 ( 54532
//	Для Каждого Стр Из ДокументыОплаты Цикл
////Евросиб Гудкова( 10.11.2020 Ticket№ 0213176
//		Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//		Движение.Период = Стр.ДатаОплаты;
//		Движение.Организация = Организация;
//		Движение.Контрагент = Контрагент;
//		Движение.Договор = ДоговорКонтрагента;
//		Движение.ВалютаРасчетов = ВалютаДокумента;
//		Движение.ДатаРасчетов = Макс(ДатаВзаиморасчетов, Стр.ДокументРеализации.ДатаДокумента);
//		Движение.ДокументВзаиморасчетов = Ссылка;
//		Движение.СуммаСНДС = Стр.СуммаОплаты;
//		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДС), Истина, Истина);
//		Движение.СуммаНДС = СуммаНДС;
//		Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
//		//Евросиб Каблов 18.03.2021 (
//		ПараметрыКурсаРеглСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Движение.ДатаРасчетов);
//		ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Движение.ДатаРасчетов);
//		Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		//Евросиб Каблов 18.03.2021 )
//// Евросиб Гудкова) 			

//		Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Период = Стр.ДатаОплаты;			
//		Движение.Организация = Организация;
//		Движение.Контрагент = Контрагент;
//		Движение.Договор = ДоговорКонтрагента;
//		Движение.ВалютаРасчетов = ВалютаДокумента;
//		Движение.ДатаРасчетов = Макс(ДатаВзаиморасчетов, Стр.ДокументРеализации.ДатаДокумента);
//		Движение.ДокументВзаиморасчетов = Стр.ДокументРеализации;
//		Движение.СуммаСНДС = Стр.СуммаОплаты;
//		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СуммаОплаты, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДС), Истина, Истина);
//		Движение.СуммаНДС = СуммаНДС;
//		Движение.СуммаБезНДС = Стр.СуммаОплаты - СуммаНДС;
//		//Евросиб Каблов 18.03.2021 (
//		ПараметрыКурсаРеглСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Движение.ДатаРасчетов);
//		ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Движение.ДатаРасчетов);
//		Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаСтроки, ПараметрыКурсаРеглСтроки);
//		//Евросиб Каблов 18.03.2021 )
//		
//		// Евросиб Фролов (12.01.2022 Task№ 45208
//		Движение.ЭтоВР = Стр.ЭтоВР;
//		// Евросиб Фролов)
//	КонецЦикла;
//Евросиб Каблов 07.10.2022 )

	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, начало (требуется для проверки ниже)
	Если Не ЭтоНовый() Тогда
		Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Очистить();
		Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.Записать();
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, конец
	
	// Субботин 79718 07.02.2024 начало//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетПокупателя.СчетПокупателю КАК Счет
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	&СчетПокупателя КАК СчетПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Счета.Счет КАК Счет,
	|	ЕСТЬNULL(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток, 0) КАК НеразнесеннаяСуммаОстаток
	|ИЗ
	|	ВТ_Счета КАК ВТ_Счета
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, начало (требуется для проверки ниже)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
	//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, конец
	|		ПО ВТ_Счета.Счет = РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю";
	
	Запрос.УстановитьПараметр("СчетПокупателя", Ссылка.РазнесениеНаСчетаПокупателям.Выгрузить(,"СчетПокупателю"));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	// Субботин 79718 07.02.2024 Конец//
		
	Для каждого Стр из РазнесениеНаСчетаПокупателям Цикл
		
		Движение = Движения.РазнесениеСчетовПокупателейПоВходящимПлатежам.ДобавитьРасход();
		Движение.Период 		= ДатаВзаиморасчетов;
		Движение.Контрагент 	= Стр.СчетПокупателю.Контрагент;
		Движение.Договор 		= Стр.СчетПокупателю.ДоговорКонтрагента;
		Движение.СчетПокупателю = Стр.СчетПокупателю;
		//Евросиб Коханенко Н.А. #67586 31.03.2023 (( 
		//Движение.НеразнесеннаяСумма = Стр.РазнесеннаяСумма;
		Движение.НеразнесеннаяСумма = ?(ВалютаСчетаОтличнаОтВалютыОплаты, Стр.СуммаВВалюте, Стр.РазнесеннаяСумма);
		//Евросиб Коханенко Н.А. #67586 31.03.2023 ))
		
		// Субботин 79718 07.02.2024 начало//
		СтруктураПоиска = Новый Структура("Счет",Стр.СчетПокупателю);
		ОстаткиПоСчету = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
		Если ОстаткиПоСчету.Количество() >0 Тогда
			Если Движение.НеразнесеннаяСумма > ОстаткиПоСчету[0].НеразнесеннаяСуммаОстаток тогда
				ОбщегоНазначения.СообщитьПользователю("Разнесенная на " + Стр.СчетПокупателю +" сумма ("+ Движение.НеразнесеннаяСумма +
				") не должна превышать остаток ("+ ОстаткиПоСчету[0].НеразнесеннаяСуммаОстаток + ") по документу. Проведение отменено.",,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		// Субботин 79718 07.02.2024 Конец//		
	КонецЦикла;
	
	//Евросиб Каблов 29.11.2023 ( #75365
	ВзаиморасчетыСервер.СформироватьДвиженияРазнесениеВходящихПлатежейПоСчетамПокупателей(ЭтотОбъект);
	//Евросиб Каблов 29.11.2023 )
	
	//Евросиб Каблов 10.08.2023 ( 68187
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ РазнесениеНаСчета
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетСНП.Ссылка КАК РасчетСНП,
	|	РасчетСНП.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	РасчетСНП.ГУИДСтрокиПротокола КАК ГУИДСтрокиПротокола,
	|	РасчетСНП.Счет КАК Счет
	|ИЗ
	|	РазнесениеНаСчета КАК РазнесениеНаСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
	|		ПО РазнесениеНаСчета.СчетПокупателю = РасчетСНП.Счет
	|ГДЕ
	|	НЕ РасчетСНП.СчетОплачен";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РасчетСНП = Выборка.РасчетСНП.ПолучитьОбъект();
		РасчетСНП.СчетОплачен = Истина;
		РасчетСНП.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	//Евросиб Каблов 10.08.2023 ) 

	//Евросиб СубботинВ #118799 09.10.2025 Начало
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика Тогда
		Движения.ЗаявкиНаОплату.Записывать = Истина;
		//Евросиб СубботинВ #118799 09.10.2025 Конец		
		Расшифровка = РасшифровкаПлатежа.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка КАК Сделка,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ЗаявкаНаОплату КАК ЗаявкаНаОплату
				|ПОМЕСТИТЬ ВТ_Расшифровка
		|ИЗ
		|	&ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Ссылка КАК ДокументПоступления,
		|	ВТ_Расшифровка.Сделка КАК ОснованиеДляПлатежа,
		|	&ДатаВзаиморасчетов КАК Период,
		|	ВТ_Расшифровка.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Расшифровка.СуммаНДС КАК СуммаНДС,
		|	ВТ_Расшифровка.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	ЗаявкаНаОплатуДокументыНаОплату.СуммаОплаты КАК Сумма,
		|	&ВалютаПлатежа КАК ВалютаПлатежа,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
		|ИЗ
		|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расшифровка КАК ВТ_Расшифровка
		|		ПО ЗаявкаНаОплатуДокументыНаОплату.Ссылка = ВТ_Расшифровка.ЗаявкаНаОплату
		|			И ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ВТ_Расшифровка.Сделка";
		
		Запрос.УстановитьПараметр("ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа", Расшифровка);
		Запрос.УстановитьПараметр("ВалютаПлатежа", ВалютаДокумента);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаВзаиморасчетов", ДатаВзаиморасчетов);
		Движения.ЗаявкиНаОплату.Загрузить(Запрос.Выполнить().Выгрузить()); 
	КонецЕсли;
	//Евросиб СубботинВ #118799 09.10.2025 Конец
	
КонецПроцедуры	

Функция ПолучитьНаборНеЗначСимв()

	Мас = Новый Массив;
	Мас.Добавить(" ");
	Мас.Добавить("/");
	Мас.Добавить("\");
	Мас.Добавить("(");  //Евросиб Фокеева( 17.10.2022 US №56989
	Мас.Добавить(")");
	Мас.Добавить("|");  // Евросиб Фокеева
	Мас.Добавить(Символы.ВК);
	Мас.Добавить(Символы.ВТаб);
	Мас.Добавить(Символы.НПП);
	Мас.Добавить(Символы.ПС);
	Мас.Добавить(Символы.ПФ);
	Мас.Добавить(Символы.Таб);
	
	Возврат Мас;

КонецФункции // ПолучитьНаборНеЗначСимв()
 
Функция УдалитьНеЗначащиеСимволы(СтрИзн, НаборНеЗначСимв)

	Если СтрИзн = "" Тогда
		
		ПреобразовСтр = "";
		
	Иначе
		ПреобразовСтр = "";
		// Убираем из строки все пробелы (мало ли в номере окажется)
		Для Сч = 1 По СтрДлина(СтрИзн) Цикл
			
			ТекСимв = Сред(СтрИзн, Сч, 1);
			
			Если НаборНеЗначСимв.Найти(ТекСимв) = Неопределено Тогда
				
				ПреобразовСтр = ПреобразовСтр + ТекСимв;
				
			Иначе
				
				
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;

	Возврат ПреобразовСтр;
	
КонецФункции // УдалитьНеЗначащиеСимволы(СтрИзн, НаборНеЗначСимв)

