
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	РежимПаковочногоЛиста = Перечисления.УпаковкаРазупаковка.Упаковка;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Для каждого Стр из СписокКонтейнеров Цикл
		РаботаСКонтейнерамиСервер.ДобавитьЗаписьИспользованияКонтейнера(Стр.ВыдачаПодЗатаркуРастарку, Стр.Контейнер, Новый Соответствие, Истина);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТараВКонтейнерах.Записывать = Истина;
	Для каждого Стр из ОборотнаяТара Цикл
		
		Если РежимПеретарки = Перечисления.УпаковкаРазупаковка.Упаковка Тогда
			Движение = Движения.ТараВКонтейнерах.ДобавитьПриход();
		Иначе
			Движение = Движения.ТараВКонтейнерах.ДобавитьРасход();
		КонецЕсли;
		Движение.ОборотнаяТара = Стр.Тара;
		Движение.Контейнер = Стр.Контейнер;
		Движение.Период = Дата;
		Движение.Затарено = 1;
		Движение.Регистратор = Ссылка;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТараВКонтейнерахОстатки.ОборотнаяТара КАК ОборотнаяТара,
	               |	ТараВКонтейнерахОстатки.Контейнер КАК Контейнер,
	               |	ТараВКонтейнерахОстатки.ЗатареноОстаток КАК ЗатареноОстаток
	               |ИЗ
	               |	РегистрНакопления.ТараВКонтейнерах.Остатки(, ) КАК ТараВКонтейнерахОстатки
	               |ГДЕ
	               |	ТараВКонтейнерахОстатки.ЗатареноОстаток < 0";
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого Стр из СписокКонтейнеров Цикл
			
			СоответствиеПараметры = Новый Соответствие;
			СоответствиеПараметры.Вставить("ВыдачаКлиенту", Стр.ВыдачаПодЗатаркуРастарку);
			СоответствиеПараметры.Вставить("НормативВозвратаОтКлиента", Стр.НормативПользования);
			СоответствиеПараметры.Вставить("ВозвратОтКлиента", стр.ВозвратОтКлиента);
			СоответствиеПараметры.Вставить("Клиент", ЭтотОбъект.Контрагент);
			СоответствиеПараметры.Вставить("Договор", ЭтотОбъект.ДоговорКонтрагента);
			РаботаСКонтейнерамиСервер.ДобавитьЗаписьИспользованияКонтейнера(Стр.ВыдачаПодЗатаркуРастарку, Стр.Контейнер, СоответствиеПараметры, Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
