//Евросиб Каблов 09.06.2021 29035
//Процедура ОтправитьСообщениеОЗакрытииПериода(ДокЗакрытие, Закрыт = Ложь) Экспорт
//Процедура ОтправитьСообщениеОЗакрытииПериода(ДокЗакрытие, Закрыт = Ложь, ВО = Истина) Экспорт  // Евросиб Фролов, 11.11.2021 TASK№ 42128
Процедура ОтправитьСообщениеОЗакрытииПериода(ДокЗакрытие, Закрыт = Ложь, ИмяПериода) Экспорт //Евросиб Каблов 09.04.2025 #105407
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
	//	Возврат;
	//КонецЕсли;
	Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда	
		Получатели = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("АдресЭлектроннойПочтыДляРассылкиУведомленийТестовый");
	Иначе
		Получатели = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("АдресЭлектроннойПочтыДляРассылкиУведомлений");		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Получатели) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан адрес электронной почты для рассылки уведомлений. Рассылка не выполнена.");
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 09.04.2025 )
	
	ПериодБлокировки = Формат(ДокЗакрытие.ПериодБлокировки, "ДФ='MMMM yyyy'");	
	НаименованиеОрганизации = ДокЗакрытие.Организация.НаименованиеСокращенное;

	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	Если УчетнаяЗаписьПоУмолчанию Тогда
		
		//Тема = СтрШаблон("Закрытие периода %1 %2 в ПО DATACore", ПериодБлокировки, НаименованиеОрганизации);
		//Тема = СтрШаблон("Закрытие периода %1 %2 %3 в ПО DATACore", ?(ВО, "ВО", "БУ"), ПериодБлокировки, НаименованиеОрганизации); // Евросиб Фролов, 11.11.2021 TASK№ 42128
		Тема = СтрШаблон("Закрытие периода %1 %2 %3 в ПО DATACore", ИмяПериода, ПериодБлокировки, НаименованиеОрганизации); //Евросиб Каблов 09.04.2025 #105407
		
		ТелоПисьма = Новый ФорматированныйДокумент;
		ТелоПисьма.Добавить("Уважаемые пользователи!");
		ТелоПисьма.Добавить(Символы.ПС);
		ТелоПисьма.Добавить(Символы.ПС);
		Если Закрыт Тогда
			ТекДата = ТекущаяДата();
			//ТелоПисьма.Добавить(СтрШаблон("Период ""%1"" по организации %2 в ПО DATACore закрыт %3 в %4.", ПериодБлокировки, НаименованиеОрганизации, Формат(ТекДата, "ДЛФ=DD"), Формат(ТекДата, "ДФ=HH:mm")));
			//ТелоПисьма.Добавить(СтрШаблон("Период %1 ""%2"" по организации %3 в ПО DATACore закрыт %4 в %5.", ?(ВО, "ВО", "БУ"), ПериодБлокировки, НаименованиеОрганизации, Формат(ТекДата, "ДЛФ=DD"), Формат(ТекДата, "ДФ=HH:mm"))); // Евросиб Фролов, 11.11.2021 TASK№ 42128
			ТелоПисьма.Добавить(СтрШаблон("Период %1 ""%2"" по организации %3 в ПО DATACore закрыт %4 в %5.", ИмяПериода, ПериодБлокировки, НаименованиеОрганизации, Формат(ТекДата, "ДЛФ=DD"), Формат(ТекДата, "ДФ=HH:mm"))); //Евросиб Каблов 09.04.2025 #105407 
		Иначе
			//ТелоПисьма.Добавить(СтрШаблон("Выполняется закрытие периода ""%1"" по организации %2 в ПО DATACore", ПериодБлокировки, НаименованиеОрганизации));
			//ТелоПисьма.Добавить(СтрШаблон("Выполняется закрытие периода %1 ""%2"" по организации %3 в ПО DATACore", ?(ВО, "ВО", "БУ"), ПериодБлокировки, НаименованиеОрганизации)); // Евросиб Фролов, 11.11.2021 TASK№ 42128
			ТелоПисьма.Добавить(СтрШаблон("Выполняется закрытие периода %1 ""%2"" по организации %3 в ПО DATACore", ИмяПериода, ПериодБлокировки, НаименованиеОрганизации)); //Евросиб Каблов 09.04.2025 #105407
			ТелоПисьма.Добавить(Символы.ПС);
			ТелоПисьма.Добавить("До окончания закрытия запрещено проведение сделок и разнесение акцептов.");
		КонецЕсли;
		ТелоПисьма.Добавить(Символы.ПС);
		ТелоПисьма.Добавить(Символы.ПС);
		//Евросиб Каблов 09.04.2025 ( #105407
		//ТелоПисьма.Добавить("Служба поддержки пользователей");
		//ТелоПисьма.Добавить(Символы.ПС);
		//ТелоПисьма.Добавить("ЗАО ""Евросиб СПб-ТС""");
		//ТелоПисьма.Добавить(Символы.ПС);
		//ТелоПисьма.Добавить("Тел. 31-04");
		ТелоПисьма.Добавить("С уважением,");
		ТелоПисьма.Добавить(Символы.ПС);
		ТелоПисьма.Добавить("Техническая поддержка ООО ""Аврора"" helpdesk_ts@avrora-it.biz");
		ТелоПисьма.Добавить(Символы.ПС);
		ТелоПисьма.Добавить("Тел. 3104");
		//Евросиб Каблов 09.04.2025 )

		//закрыт 8 декабря 2020 г. в 22:59.
		
		//Евросиб Каблов 09.04.2025 ( #105407
		//Получатели = "PolzovateliDATACore@eurosib.biz";
		//Евросиб Каблов 09.04.2025 )
		
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТелоПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		ПараметрыОтправкиПисьма.Вставить("Кому", Получатели);
		//ПараметрыОтправкиПисьма.Вставить("Копии", ТекПользовательСтруктура);
		ПараметрыОтправкиПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Высокая);
		
		Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	КонецЕсли;
	
КонецПроцедуры

// Трундуков 17.04.2025 55657
// Процедура Регламентного задания
Процедура ВыгрузкаТекущегоПериода() Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаАнализаДеятаельностиТекущегоПериода);


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиВыгрузкиОАД.ИмяТаблицыВыгрузки КАК ИмяТаблицыВыгрузки,
		|	НастройкиВыгрузкиОАД.Организация КАК Организация,
		|	НастройкиВыгрузкиОАД.ИсключитьПланФактВПериоде КАК ИсключитьПланФактВПериоде,
		|	НастройкиВыгрузкиОАД.Активна КАК Активна,
		|	НастройкиВыгрузкиОАД.Ссылка КАК ИмяТаблицыВыгрузкиСсылка,
		|	НастройкиВыгрузкиОАД.НачалоПериода КАК НачалоПериода
		|ИЗ
		|	Справочник.НастройкиВыгрузкиОАД КАК НастройкиВыгрузкиОАД
		|ГДЕ
		|	НастройкиВыгрузкиОАД.Активна = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачалоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ВыборкаДетальныеЗаписи.Организация);
		Если НачалоПериода < ВыборкаДетальныеЗаписи.НачалоПериода Тогда
			Продолжить;
		КонецЕсли;
		КонецПериода = КонецМесяца(НачалоПериода);	
		
		Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда	
			КоличествоЗаписей = ВыгрузкаОтчётаАнализДеятельности(НачалоПериода, КонецПериода, ВыборкаДетальныеЗаписи.ИсключитьПланФактВПериоде, "AnalisysActivityReportDataTest2",ВыборкаДетальныеЗаписи.Организация);
			СоздатьЗаписьВРегистре(ТекущаяДатаСеанса(), Ложь, ВыборкаДетальныеЗаписи.ИмяТаблицыВыгрузкиСсылка, КоличествоЗаписей, ВыборкаДетальныеЗаписи.Организация);
			Продолжить;		
		КонецЕсли;
 
		КоличествоЗаписей = ВыгрузкаОтчётаАнализДеятельности(НачалоПериода, КонецПериода, ВыборкаДетальныеЗаписи.ИсключитьПланФактВПериоде, ВыборкаДетальныеЗаписи.ИмяТаблицыВыгрузки, ВыборкаДетальныеЗаписи.Организация);
		СоздатьЗаписьВРегистре(ТекущаяДатаСеанса(), Ложь, ВыборкаДетальныеЗаписи.ИмяТаблицыВыгрузкиСсылка, КоличествоЗаписей, ВыборкаДетальныеЗаписи.Организация);
		
	КонецЦикла	
КонецПроцедуры

// Трундуков 17.04.2025 55657
// Процедура Регламентного задания
Процедура ВыгрузкаЗакрытогоПериода() Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаАнализаДеятаельностиЗакрытогоПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиВыгрузкиОАД.ИмяТаблицыВыгрузки КАК ИмяТаблицыВыгрузки,
		|	НастройкиВыгрузкиОАД.Организация КАК Организация,
		|	НастройкиВыгрузкиОАД.ИсключитьПланФактВПериоде КАК ИсключитьПланФактВПериоде,
		|	НастройкиВыгрузкиОАД.Активна КАК Активна,
		|	ЗакрытыеПериоды.Период КАК Период,
		|	НастройкиВыгрузкиОАД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВсеПериодыВыгрузки
		|ИЗ
		|	Справочник.НастройкиВыгрузкиОАД КАК НастройкиВыгрузкиОАД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытыеПериоды КАК ЗакрытыеПериоды
		|		ПО НастройкиВыгрузкиОАД.Организация = ЗакрытыеПериоды.Организация
		|			И НастройкиВыгрузкиОАД.НачалоПериода <= ЗакрытыеПериоды.Период
		|ГДЕ
		|	НастройкиВыгрузкиОАД.Активна = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеПериодыВыгрузки.ИмяТаблицыВыгрузки КАК ИмяТаблицыВыгрузки,
		|	ВсеПериодыВыгрузки.Организация КАК Организация,
		|	ВсеПериодыВыгрузки.ИсключитьПланФактВПериоде КАК ИсключитьПланФактВПериоде,
		|	ВсеПериодыВыгрузки.Период КАК Период,
		|	ВсеПериодыВыгрузки.Ссылка КАК ТаблицаВыгрузкиСсылка,
		|	ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.ЗакрытиеПериода КАК ЗакрытиеПериода
		|ИЗ
		|	ВсеПериодыВыгрузки КАК ВсеПериодыВыгрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам КАК ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам
		|		ПО ВсеПериодыВыгрузки.ИмяТаблицыВыгрузки = ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.ТаблицаВыгрузки.ИмяТаблицыВыгрузки
		|			И ВсеПериодыВыгрузки.Организация = ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.Организация
		|			И ВсеПериодыВыгрузки.Период = ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.ВыгруженныйПериод
		|			И ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.ЗакрытиеПериода = ИСТИНА
		|ГДЕ
		|	ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.Организация ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачалоПериода = ВыборкаДетальныеЗаписи.Период;
		КонецПериода = КонецМесяца(НачалоПериода);
		
		Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда	
			КоличествоЗаписей = ВыгрузкаОтчётаАнализДеятельности(НачалоПериода, КонецПериода, ВыборкаДетальныеЗаписи.ИсключитьПланФактВПериоде, "AnalisysActivityReportDataTest2", ВыборкаДетальныеЗаписи.Организация);
			СоздатьЗаписьВРегистре(НачалоПериода, Истина, ВыборкаДетальныеЗаписи.ТаблицаВыгрузкиСсылка, КоличествоЗаписей, ВыборкаДетальныеЗаписи.Организация);
			Продолжить;		
		КонецЕсли;
 
		КоличествоЗаписей = ВыгрузкаОтчётаАнализДеятельности(НачалоПериода, КонецПериода, ВыборкаДетальныеЗаписи.ИсключитьПланФактВПериоде, ВыборкаДетальныеЗаписи.ИмяТаблицыВыгрузки, ВыборкаДетальныеЗаписи.Организация);
		СоздатьЗаписьВРегистре(НачалоПериода, Истина, ВыборкаДетальныеЗаписи.ТаблицаВыгрузкиСсылка, КоличествоЗаписей, ВыборкаДетальныеЗаписи.Организация);
		
	КонецЦикла;
КонецПроцедуры

// Трундуков 17.04.2025 55657
// Процедура выгрузки отчёта
Функция ВыгрузкаОтчётаАнализДеятельности(НачалоПериода, КонецПериода, ИсключитьПланФактВПериоде, ИмяТаблицы, Организация = "")
	
    Период = Новый СтандартныйПериод();
	Период.ДатаНачала = НачалоПериода;
	Период.ДатаОкончания = КонецПериода;

	ОтчетОбъект = Отчеты.АнализДеятельности.Создать();
	
	НастройкиДляВыгрузки = Неопределено;
    Для Каждого Вариант Из ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		Если Вариант.Имя = "АнализДеятельностиВыгрузка" Тогда
			НастройкиДляВыгрузки = Вариант.Настройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	АдресВоВременноеХранилище = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных);
    ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременноеХранилище);	
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиДляВыгрузки);

	
    КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ОтчетОбъект.КомпоновщикНастроек, "Период", Период);
	
	ПараметрыУстановкиОтбора = Новый Структура;
	ПараметрыУстановкиОтбора.Вставить("ЗаменятьСуществующий", Истина);
	ПараметрыУстановкиОтбора.Вставить("ВПользовательскиеНастройки", Истина);
	ИспользованиеОтбораПланФактВПериоде = ИсключитьПланФактВПериоде;
	ДобавитьОтбор(ОтчетОбъект.КомпоновщикНастроек, "ПланФактВПериоде", Ложь, ВидСравненияКомпоновкиДанных.Равно, ИспользованиеОтбораПланФактВПериоде, ПараметрыУстановкиОтбора);
	
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрКоманды = Новый Структура;
	ПараметрКоманды.Вставить("СхемаКомпоновкиДанных", ОтчетОбъект.СхемаКомпоновкиДанных);
	ПараметрКоманды.Вставить("Настройки", Настройки);
	ПараметрКоманды.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрКоманды.Вставить("ВыгружатьЧастями", Истина);
	Возврат РегистрыСведений.ОчередьЗаписиДанныхПоОтправлениям.ОбработкаДанныхДляОАД(ПараметрКоманды);
	
КонецФункции

// Трундуков 17.04.2025 55657
// Добавляет отбор в коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//	ЭлементСтруктуры        - КомпоновщикНастроекКомпоновкиДанных, НастройкиКомпоновкиДанных - элемент структуры КД
//	Поле                    - Строка - имя поля, по которому добавляется отбор
//	Значение                - Произвольный - значение отбора КД
//	ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнений КД (по умолчанию: Неопределено)
//	Использование           - Булево - признак использования отбора (по умолчанию: Истина)
//	ДополнительныеПараметры - Структура
//		* ВПользовательскиеНастройки - Булево - признак добавления в пользовательские настройки КД (по умолчанию: ложь)
//		* ЗаменятьСуществующий       - Булево - признак полной замены существующего отбора по полю (по умолчанию: истина).
//
// Возвращаемое значение:
//	ЭлементОтбораКомпоновкиДанных - добавленный отбор.
//
Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение = Неопределено, ВидСравнения = Неопределено, Использование = Истина, ДополнительныеПараметры = Неопределено) Экспорт
		
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Ложь, Истина); 
	Иначе
		Если Не ДополнительныеПараметры.Свойство("ВПользовательскиеНастройки") Тогда
			ДополнительныеПараметры.Вставить("ВПользовательскиеНастройки", Ложь);
		КонецЕсли;
		Если Не ДополнительныеПараметры.Свойство("ЗаменятьСуществующий") Тогда
			ДополнительныеПараметры.Вставить("ЗаменятьСуществующий", Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЭлементОтбора = Неопределено;
	Если ДополнительныеПараметры.ЗаменятьСуществующий Тогда
		Для каждого Элемент Из Отбор.Элементы Цикл
			
			Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элемент.ЛевоеЗначение = Поле Тогда
				ЭлементОтбора = Элемент;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ДополнительныеПараметры.ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки Тогда
					ЭлементОтбора = ЭлементНастройки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементОтбора.Использование		= Использование;
	ЭлементОтбора.ЛевоеЗначение		= Поле;
	ЭлементОтбора.ВидСравнения		= ВидСравнения;
	ЭлементОтбора.ПравоеЗначение	= Значение;
	
	Возврат ЭлементОтбора;
	
КонецФункции

// Трундуков 17.04.2025 55657
// Процедура создание записи в регистре сведений "ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам"
Процедура СоздатьЗаписьВРегистре(Период, ЗакрытиеПериода, ИмяТаблицы, КоличествоЗаписей = 0, Организация = Неопределено)
	ЗаписьРегистра = РегистрыСведений.ВыгруженныеАнализыДеятельностиПоЗакрытымПериодам.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.ВыгруженныйПериод = Период;
	ЗаписьРегистра.ЗакрытиеПериода = ЗакрытиеПериода;
	ЗаписьРегистра.Организация = Организация;
	ЗаписьРегистра.ДатаВыгрузки = ТекущаяДатаСеанса();
	ЗаписьРегистра.ТаблицаВыгрузки = ИмяТаблицы;
	ЗаписьРегистра.ЧислоВыгруженныхЗаписей = КоличествоЗаписей;
	ЗаписьРегистра.Записать();	
КонецПроцедуры
