&НаКлиенте
Перем КТКВХранилище;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоРедактирования = ПравоДоступа("Редактирование", Метаданные.Документы.Заявка);
	РаботаЧерезАРМКТК = Константы.ИспользоватьАРМКТК.Получить();
	
	// + Состояния
	ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	ЦветКнопки_Исходный = Элементы.СоставУслугиЗаполнятьСтрокиПоПервойСтроке.ЦветФона;
	ЦветКнопки_Выделенный = WebЦвета.Розовый;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	ОперативныеЗадачи.Параметры.УстановитьЗначениеПараметра("ДокументОснование",Объект.Ссылка);
	
	//Евросиб Каблов 12.05.2020 (
	ЗаполнитьВкладкуСИБУР();
	УстановитьВидимостьВкладкиСибур();
	//Евросиб Каблов 12.05.2020 )
	
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	Если Параметры.Ключ.Пустая() Тогда		
		ЗаполнитьДобавленныеКолонкиТаблицыЗапросНаКТК();
	КонецЕсли;
	// Евросиб Фролов)
	
	ДоступныеЛичныеЦели = ЛичныеЦелиСервер.ПолучитьДействующиеЦелиДляРучнойОтметки(Объект.Ссылка);
	Для каждого Стр из ДоступныеЛичныеЦели Цикл
		НСтр = Объект.ЛичныеЦели.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
	КонецЦикла;
	
	МассивКолонокЗаполняемыхВАРМ.ЗагрузитьЗначения(АРМ_Сервер.ПолучитьНаборКолонокКоторыеЗаполняютсяИзАРМ());
	МассивКолонокЗаполняемыхВЗаявке.ЗагрузитьЗначения(АРМ_Сервер.ПолучитьНаборКолонокКоторыеЗаполняютсяИзЗаявки());
	
	ВидыСобственностиСобственногоКТК.ЗагрузитьЗначения(АРМ_Сервер.ПолучитьВидСобственностиПоПринадлежности(Перечисления.ПринадлежностьТЕ.КТЕвросиба));
	ВидыСобственностиКлиентскогоКТК.ЗагрузитьЗначения(АРМ_Сервер.ПолучитьВидСобственностиПоПринадлежности(Перечисления.ПринадлежностьТЕ.КТКлиента));
	
	РазрешитьВыборПроизвольнойКалькуляции = РазрешитьВыборПроизвольнойКалькуляции_функция(Объект.ВидПеревозки);
	ОбновитьОтображениеКолонокТЧ();
	ОбновитьСВВиТДТ_Сервер();
	
	//Евросиб Каблов 01.07.2021 ( Ticket#0228545
	ЗаполнитьНомераПоездовКлиентов();
	//Евросиб Каблов 01.07.2021 )
	
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	// Список полей ТЧ "Список запрос на КТК", которые запрещено менять
	// пользователям с ролью "(dc) Работа с заявками".
	УправлениеФормой();
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.04.2022 Task №50233
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. TASK 51973 14.06.2022 -Начало
	ЗаполнитьСсылкаНаЗапросыАвтоперевозки();
	//ДИТ Шевченко А.В. TASK 51973 14.06.2022 -Конец

	//Евросиб Коханенко Н.А. 09.12.2022 (( #61705
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. 09.12.2022 )) #61705
	
	//ДИТ Шевченко А.В. 57147 28.12.2022 -начало                             
	Элементы.ФормаПроверитьЗаявкуСибур.Видимость = Объект.Контрагент = ПолучитьКонтрагентаСибур();
	//ДИТ Шевченко А.В. 57147 28.12.2022 -конец 

	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
	ОбновитьДанныеКлючаНаФорме();
	ДетализацияПоГрузуИзКлючей();
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
	Если Параметры.Свойство("ЭтоСозданиеЗаявкиИзРефСцепа") Тогда
		ЗаполнитьКонтейнерыИзРефСцепа(Параметры.Основание
			, Истина
			, Параметры.МассивКонтейнеров
			, Параметры.Свойство("ДГК"));
	ИначеЕсли Параметры.Свойство("ЭтоДобавлениеВЗаявкуИзРефСцепа") Тогда
		ЗаполнитьКонтейнерыИзРефСцепа(Параметры.Основание
			, Ложь
			, Параметры.МассивКонтейнеров
			, Ложь);
		
	ИначеЕсли не Параметры.Ключ.Пустая()
		и (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РефСцеп")) Тогда
		СинхронизироватьДанныеСРефСцепом();	
	КонецЕсли;		
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023  
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТранспортныеСредстваСиламиЕвросиб.Загрузить(Документы.Заявка.ЗаполнитьТранспортныеСредстваСиламиЕвросиб(Объект.Ссылка)); //ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023
	КонецЕсли;
	
	//БИТ Белинский Д.А. 11.04.2023 -начало
		УстановитьДоступностьПолейПоследнейМили();
	//БИТ Белинский Д.А. 11.04.2023 -конец 
	
	// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 19.03.2024
	ЗаполнитьИменаБлокируемыхПолейКлюча();
	// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 19.03.2024
	
	//БИТ Белинский Д.А. 20.06.2023 -начало
	УстановитьВидимостьПолейПоКонтрагенту();
	//БИТ Белинский Д.А. 20.06.2023 -конец  
	//Евросиб - АСуслов 06.09.2023 10:30:16 #74149
	//(
	Элементы.СоставУслугиСвязатьКТКСоСтоками.Видимость = Ложь;
	//)
	//Евросиб - АСуслов 06.09.2023 10:30:24 #74149
	
	//Евросиб Коханенко Н.А. 02.09.2024 (( #90198 
	УстановитьДоступностьПолейПоЗаявкеИзЛК();
	//Евросиб Коханенко Н.А. 02.09.2024 )) #90198 
	
	// Евросиб(ДИТ) BUG 92539 ТА 97789 Сержантова А.С. Начало: 10.12.2024
	СкрытьКолонкиСНаименованиемУдалить();
	// Евросиб(ДИТ) BUG 92539 ТА 97789 Сержантова А.С. Конец: 10.12.2024
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	ГруппаДКС = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ГруппаДКС) Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, начало
		МассивКалькуляций = Объект.СоставУслуги.Выгрузить().ВыгрузитьКолонку("Калькуляция");
		//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, конец
		Элементы.ГруппаДКС.ОтметкаНезаполненного = ЗапрещеноНезаполненноеЗначениеГруппыДКС(Объект.Дата, МассивКалькуляций);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ВидЗадолженности = ПолучитьВидЗадолженности(Объект.Ссылка);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец 
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	ТранзитДляКлиента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентапоДокументу(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ТранзитДляКлиента) Тогда
		ТранзитДляКлиента = ПолучитьТранзитДляКлиентаПокументаОснования();
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	//Евросиб Коханенко Н.А. 28.12.2024 (( #97950 
	УстановитьДоступностьПолейСреднейМили(); 
	//Евросиб Коханенко Н.А. 28.12.2024 )) #97950 
	
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 25-03-2025, начало
	ДоступныПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.СоставУслугиГруппаСтатуса.Доступность = ДоступныПолныеПрава;
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 25-03-2025, конец 
	
	//Евросиб Коханенко Н.А. 23.04.2025 (( #78722
	ЕстьСвязаннаяРТУ = ЕстьСвязаннаяРТУ(Объект.Ссылка);
	Если ЕстьСвязаннаяРТУ <> "" Тогда 
		Элементы.СоставУслугиОфисПродаж.ТолькоПросмотр = Истина; 
	КонецЕсли;
	//Евросиб Коханенко Н.А. 23.04.2025 )) #78722
	
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 01.07.2025 ((
	ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций();
	Элементы.СоставУслугиПодобратьКалькуляцию.Видимость = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций;
	Элементы.СоставУслугиЗагрузитьПлановыеЛокацииСдачиКТК.Видимость = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций;
	// Евросиб Рыбьяков К.А. 01.07.2025 ))
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТранзитДляКлиентаПокументаОснования() //ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ПСЦ) Тогда
		ПСЦ = Объект.ПСЦ;		
		Результат = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентаПоДокументу(ПСЦ);				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
&НаСервереБезКонтекста
Функция ПолучитьВидЗадолженности(Ссылка)
	Возврат РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(Ссылка);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьКолонокПринадлежности();
	ПСЦПриИзменении(неопределено);
	ОбновитьОпасность();
	ОбновитьВидимостьПредупрежденияБлокировки();
	
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	НастроитьВидимостьВкладкиЗапросНаКТК();
	ОбновитьИтоги();
	// Евросиб Фролов)
	
	// на переходный период. полностью выключить при переводе в ПЭ
	//Если ПравоРедактирования Тогда
	//	Для каждого Стр из Объект.СоставУслуги Цикл
	//		Если НЕ ЗначениеЗаполнено(Стр.ГУИДСтроки) Тогда
	//			Стр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Элементы.ГруппаЛичныеЦели.Заголовок = "Личные цели ("+Объект.ЛичныеЦели.Количество()+")";
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
    НастроитьВидимостьКомандЗаполнения();
	// Евросиб Фролов)  
	
	//Евросиб Коханенко Н.А. 17.05.2024 (( #83866 
	УстановитьВидимостьКнопокПереносаКТК();
	//Евросиб Коханенко Н.А. 17.05.2024 )) #83866 
	
	// Евросиб Фролов (28.04.2022 Task №50233
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    // Евросиб Фролов)
	
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Начало
	ОбновитьИменаКомандЗапросовНаАстоперевозку();
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Конец
		
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 29.12.2022
	СтанцияДата();		
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022
	
	//Евросиб Каблов 27.01.2026 ( #126739
	ОтмененныеРейсы = Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("РейсОтменен", Истина));
	Если ЗначениеЗаполнено(ОтмененныеРейсы) Тогда
		Элементы.ПереченьРейсовГруппаРейсОтменен.Видимость = Истина;
		Для Каждого ОтмененныйРейс Из ОтмененныеРейсы Цикл
			ВывестиСообщениеПоОтмененномуРейсу(ОтмененныйРейс);
		КонецЦикла;
	Иначе
		Элементы.ПереченьРейсовГруппаРейсОтменен.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Каблов 27.01.2026 ) #126739
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ЗаполнитьДобавленныеКолонкиТаблицыЗапросНаКТК();
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	
	// Евросиб Фролов)   
	
	// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 05.03.2024
	ОбновитьДоступностьПолейКлючаАналитикиПеревозки();
	// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 05.03.2024
	
	// Евросиб Фролов (28.04.2022 Task №50233
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Евросиб Фролов)  
	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
	ОбновитьДанныеКлючаНаФорме();
	Для Каждого Стр Из Объект.СоставУслуги Цикл 
		Стр.ВерсияКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ВерсияДанных");
	КонецЦикла;	   	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
	
	ЗаполнитьДобавленныеКолонки(); //ДИТ Шевченко А.В. US 62482 ТА 71463 21.06.2023
	
	//Субботин 77659 24.11.2023 начало 
	НастроитьВидимостьВкладкиЗапросНаКТК();
	//Субботин 77659 24.11.2023 Конец 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Субботин 77659 24.11.2023 Начало 
	
	Если Объект.ЗапросНаКТК и (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РефСцеп") или ПроверитьСвязанныеДокументы()) Тогда 
		РезультатПроверки = ОбработкаПроверкиРаспределенияКТК();
		Если РезультатПроверки <> Неопределено Тогда
			Отказ = Истина;
			ЗадатьВопросПользователю(РезультатПроверки);
			Возврат
		КонецЕсли;
	КонецЕсли;	
	//Субботин 77659 24.11.2023 Конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, начало
	МассивКалькуляций = Новый Массив;
	//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, конец
	
	Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре") Тогда
		
		КТКПустойСобственник = Новый Массив;
		Для каждого стр из Объект.СоставУслуги Цикл
			//	Если НЕ ЗначениеЗаполнено(Стр.СобственностьПеревозимогоКТК) Тогда КТКПустойСобственник.Добавить(Стр.НомерКТК); КонецЕсли;
			//КонецЦикла;
			//Если КТКПустойСобственник.Количество() > 0 Тогда
			//	//Сообщить("!!! Не указан вид собственности у контейнеров: " + СтрСоединить(КТКПустойСобственник, ", "), СтатусСообщения.ОченьВажное);
			//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "ДатаВыдачиГрузаКлиенту"), "Объект");
			//	МассивСтрокСОшибками.Добавить(Объект.СвязьУчетныхЕдиниц[Выборка.НомерСтроки-1]);
			// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
			//ок(
			//Если НЕ ЗначениеЗаполнено(Стр.СобственностьПеревозимогоКТК) Тогда 
			//ок)
			Если НЕ ЗначениеЗаполнено(Стр.ПринадлежностьТЕ) Тогда
				// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
				//ТекстСообщения = "Не указан вид собственности у контейнера";
				//ДИТ, Беляев СЮ, Ticket#0311313, 30-05-2023, начало
				ТекстСообщения = "Не указан ""COC / SOC"" у контейнера";
				//ДИТ, Беляев СЮ, Ticket#0311313, 30-05-2023, конец
				// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
				//ок(
				//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", Стр.НомерСтроки, "СобственностьПеревозимогоКТК"), "Объект");
				//ок)
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", Стр.НомерСтроки, "ПринадлежностьТЕ"), "Объект");
				// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
			КонецЕсли; 
			//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, начало
			МассивКалькуляций.Добавить(Стр.Калькуляция);
			//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, конец
		КонецЦикла;
		
	Иначе
		
		ЗапрещенныеКонтейнеры = Новый Массив;
		Для каждого Стр из Объект.СоставУслуги Цикл
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//Если Стр.ВидСобственности = ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Море") Тогда
			//Стало:
			Если Стр.ВидСобственности = ПредопределенноеЗначение("Перечисление.ВариантыСобственности.СпотМорской") Тогда
				// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				ЗапрещенныеКонтейнеры.Добавить(Стр.НомерКТК);
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, начало
			МассивКалькуляций.Добавить(Стр.Калькуляция);
			//Евросиб(ДИТ), Беляев СЮ, US 95609 / TA 95939, 21-11-2024, конец
		КонецЦикла;
		Если ЗапрещенныеКонтейнеры.Количество() > 0 Тогда
			ВызватьИсключение "!!! Запрещено использовать морские КТК в сухопутных перевозках. Заявка не будет записана! КТК: " + СтрСоединить(ЗапрещенныеКонтейнеры, ", ");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизацииНаСервере(Объект);
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		//Евросиб - АСуслов 24.12.2021 11:26:44 #
		//(
		//ПараметрыЗапроса = Новый Соответствие;
		//ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		//ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		//ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		//ПараметрыЗапроса.Вставить("УказанРейс", Объект.ПереченьРейсов.Количество() > 0);
		//ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Объект.НаМоментЗаписиБылаЗадолженность);
		//ПараметрыЗапроса.Вставить("ИсточникЗаявки", Объект.ИсточникЗаявки);
		//ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		//ПараметрыЗапроса.Вставить("ПротоколНеУказан",НЕ ЗначениеЗаполнено(Объект.ПСЦ));
		//// Евросиб Фролов (16.11.2021 TASK№ №41969
		//ПараметрыЗапроса.Вставить("ЗапросНаКТК", Объект.ЗапросНаКТК);
		//// Евросиб Фролов)
		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		//)
		//Евросиб - АСуслов 24.12.2021 11:26:46 #
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗаявку(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
    // ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 26.12.2022 
	Ошибки = Неопределено;
	Для Каждого Стр Из Объект.СписокЗапросНаКТК Цикл  
		Если Стр.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется")
			И Стр.СтанцияНазначенияПоЖД = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка") Тогда 
			ИндексСтроки = Объект.СписокЗапросНаКТК.Индекс(Стр);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.СписокЗапросНаКТК[%1].СтанцияНазначенияПоЖД","Станция не заполнена","Станция",ИндексСтроки,"Станция не заполнена в строке %1",ИндексСтроки);	
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,Отказ);
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 26.12.2022
	
	//БИТ Белинский Д.А. 10.04.2023 -начало #66201
	Если Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() Тогда
		Если ЗначениеЗаполнено(Объект.ПСЦ) И ЭтоМежсервисныеРасходы(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ПСЦ, "ТипКалькуляции")) Тогда
			Если Объект.ПереченьРейсов.Количество() = 0 И ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.ВводЗаявкиВыборРейса") 
				И ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")  Тогда
				СообщениеПользователю = "Для выполнения задачи по вводу заявки и выбору рейса необходимо заполнить рейс на закладке «Рейсы» путем его выбора из справочника автомобильных, морских или ж/д рейсов";
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю,,,,Отказ);
				Возврат;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//БИТ Белинский Д.А. 10.04.2023 -конец #66201

	//БИТ Белинский Д.А. 12.04.2023 -начало #66201
	ПроверитьДанныеПоПоследнейМиле = НеобходимоПроверитьДанныеПоПоследнейМиле(ПараметрыЗаписи, Отказ); 
	Если ПроверитьДанныеПоПоследнейМиле Тогда
		ДанныеПоПоследнейМиле = ПолучитьДанныеПоПоследнейМиле(); 
		Если Не ЗначениеЗаполнено(ДанныеПоПоследнейМиле.ЗапросНаАвтоперевозку) Тогда
			ОчиститьСтрокиПоследнейМили();
		Иначе
			Если Не ДанныеПоПоследнейМиле.ОтправленТЛ И Не ДанныеПоПоследнейМиле.ПринятТЛ Тогда
				ОчиститьСтрокиПоследнейМили();
				ПометитьНаУдалениеЗапросНаАвтоПеревозку(ДанныеПоПоследнейМиле.ЗапросНаАвтоПеревозку);
				ОбновитьИменаКомандЗапросовНаАстоперевозку();
			ИначеЕсли ДанныеПоПоследнейМиле.ОтправленТЛ И Не ДанныеПоПоследнейМиле.ПринятТЛ Тогда
				ДанныеПоПоследнейМиле.Вставить("РежимЗаписи", ПараметрыЗаписи.РежимЗаписи);
				Режим = РежимДиалогаВопрос.ОКОтмена;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗапросеНаАвтоПеревозку", ЭтотОбъект, ДанныеПоПоследнейМиле);
				ПоказатьВопрос(Оповещение, "Удалить запрос на автоперевозку (посл. миля), очистить данные и провести заявку?", Режим, 0);
				Отказ = Истина;
				
			ИначеЕсли ДанныеПоПоследнейМиле.ОтправленТЛ И ДанныеПоПоследнейМиле.ПринятТЛ Тогда
				
				ТекстСообщения ="Выбор автомобильного рейса в заявке невозможен. 
					|По заявке был создан запрос на автоперевозку на последнюю милю %1, 
					|имеющий статус обработки в Транспортной логистике, не позволяющий вносить в него изменения в строке %2."; 	
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДанныеПоПоследнейМиле.ЗапросНаАвтоПеревозку, ДанныеПоПоследнейМиле.НомерСтроки);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	//БИТ Белинский Д.А. 12.04.2023 -конец #66201     
	
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 02.05.2024
	Если (ЭтаФорма.Модифицированность или ЭтаФорма.МодифицированностьФлаг) 
		и ЗначениеЗаполнено(Объект.Ссылка) и не ПараметрыЗаписи.Свойство("ВопросВыставленныеСчетаЗадан") Тогда 
		МассивВыставленныхСчетов = ПроверитьВыставленныеПоЗаявкеСчета(Объект.Ссылка);  
		Если МассивВыставленныхСчетов.Количество() Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросПродолжениеЗаписиЗавершение", ЭтаФорма, ПараметрыЗаписи);	
			СчетаСтрока = СтрСоединить(МассивВыставленныхСчетов, ", ");
			ТекстВопроса = "Внимание, вы изменяете заявку, на которую имеются выставленные счета: " + СчетаСтрока;
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок,,КодВозвратаДиалога.Да); 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 02.05.2024
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало (проверку на заполнение реквизита проверяем в форме, т.к. в ОбработкаПроверкиЗаполнения() выполнить проблематично, придется читать данные регистра и выполнять запись в регистр в форме документа)
	Если НЕ ЗначениеЗаполнено(ГруппаДКС) Тогда
		Если ЗапрещеноНезаполненноеЗначениеГруппыДКС(Объект.Дата, МассивКалькуляций) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить Группу ДКС",,"ГруппаДКС",,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец  
	
	//Евросиб Коханенко Н.А. 27.05.2025 (( #78722
	ОбновитьОфисыПродаж();
	//Евросиб Коханенко Н.А. 27.05.2025 )) #78722 
	
КонецПроцедуры   

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
&НаСервереБезКонтекста
Функция ЗапрещеноНезаполненноеЗначениеГруппыДКС(ПроверяемаяДата, МассивКалькуляций)
	
	ЕстьЗапретПоДате = Справочники.ГруппыДКС.ЗапрещеноНезаполненноеЗначениеГруппыДКС(ПроверяемаяДата);
	
	Если НЕ ЕстьЗапретПоДате Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипыКалькуляцийБезКонтроля = Новый Массив;
	ТипыКалькуляцийБезКонтроля.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	ТипыКалькуляцийБезКонтроля.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Калькуляция.Ссылка КАК Калькуляция
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Ссылка В(&МассивКалькуляций)
		|	И НЕ Калькуляция.ТипКалькуляции В (&ТипыКалькуляцийБезКонтроля)";
	
	Запрос.УстановитьПараметр("МассивКалькуляций", МассивКалькуляций);
	Запрос.УстановитьПараметр("ТипыКалькуляцийБезКонтроля", ТипыКалькуляцийБезКонтроля);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЕстьЗапретПоТипуКалькуляции = НЕ РезультатЗапроса.Пустой();
	
	Возврат ЕстьЗапретПоТипуКалькуляции;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;  
	
	// проверка на то, что КТК из заявки встречаются в другой недавней заявке
	// ОТКАЗ не делаем, т.к. по морскому экспорту это будет ПОСТОЯННО
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Ссылка,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.НомерКТК В(&НомерКТК)
	               |	И ЗаявкаСоставУслуги.Ссылка <> &Ссылка
	               |	И НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления
				   //Евросиб Коханенко Н.А. 10.06.2024 (( #83866 
				   //ищем только среди неперенесенных КТК	
				   |	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = Значение(Документ.Заявка.ПустаяСсылка) 
				   //Евросиб Коханенко Н.А. 10.06.2024 )) #83866 
				   |	И ЗаявкаСоставУслуги.Ссылка.Дата МЕЖДУ &ДатаМинус7дней И &Дата
				   //ДИТ Шевченко А.В. US 62515 ТА 70091 15.05.2023 +
				   |	И ЗаявкаСоставУслуги.НомерКТК <> Значение(Справочник.ТЕ.ПустаяСсылка)";
				   //ДИТ Шевченко А.В. US 62515 ТА 70091 15.05.2023 ++
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаМинус7дней", Объект.Дата-7*24*3600);
	Запрос.УстановитьПараметр("НомерКТК", Объект.СоставУслуги.Выгрузить().ВыгрузитьКолонку("НомерКТК"));
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Сообщить("!!! КТК № " + Ответ.НомерКТК + " встречается также в заявке " + Ответ.Ссылка + ". Проверьте, не ошибка ли это!", СтатусСообщения.Внимание);
	КонецЦикла;
	
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
	Если Документы.Калькуляция.ПроверитьПравилаЗапретаРасходовПоОхранеВСтавкуСНДС0( Объект ) Тогда
		Отказ = Истина;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец
	
	// ДИТ US 64086 TA 68396 Евсенкин М.А. Начало: 13.04.2023
    ПроверитьСтавкиКалькуляции(Отказ, ПараметрыЗаписи);
	// ДИТ US 64086 TA 68396 Евсенкин М.А. Конец: 13.04.2023
	
	//ДИТ Шевченко А.В. US 64086 TA 74172 25.08.2023 -начало
	МассивКонтейнеров 		= Новый Массив;
	Для Каждого СтрокаУ Из ТекущийОбъект.СоставУслуги Цикл
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
		// Было:
		//Если ЗначениеЗаполнено(СтрокаУ.КлючАналитикиПеревозки) Тогда
		//	Если ЗначениеЗаполнено(СтрокаУ.КлючАналитикиПеревозки.Контейнер) Тогда 
		//		МассивКонтейнеров.Добавить(СтрокаУ.КлючАналитикиПеревозки.Контейнер);
		//	КонецЕсли;
		//Стало:
		Если ЗначениеЗаполнено(СтрокаУ.НомерКТК) Тогда    
			МассивКонтейнеров.Добавить(СтрокаУ.НомерКТК);
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
		КонецЕсли;	
	КонецЦикла;
	ДанныеКТК 	= Новый Соответствие;
	Если МассивКонтейнеров.Количество() Тогда
		ДанныеКТК 	= Документы.РелизКлиента.ПолучитьИнструкции(МассивКонтейнеров);
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 64086 TA 74172 25.08.2023 -конец
	
	//ДИТ Шевченко А.В. US 62421 TA 70104 15.05.2023 -начало
	Для Каждого СтрокаУ Из ТекущийОбъект.СоставУслуги Цикл 
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
		// Было:	
		//Если ЗначениеЗаполнено(СтрокаУ.КлючАналитикиПеревозки) Тогда
		//	СтрокаУ.НомерКТК = СтрокаУ.КлючАналитикиПеревозки.Контейнер;
		//	//ДИТ Шевченко А.В. US 64086 TA 74172 25.08.2023 -начало
		//	Если ЗначениеЗаполнено(СтрокаУ.НомерКТК) И НЕ ЗначениеЗаполнено(СтрокаУ.НомерКТК.ТипТЕ) Тогда
		//		ДанныеТекущегоКТК = ДанныеКТК.Получить(СтрокаУ.КлючАналитикиПеревозки.Контейнер);
		//		Если ДанныеТекущегоКТК <> Неопределено Тогда
		//			Если ДанныеТекущегоКТК.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский ИЛИ ДанныеТекущегоКТК.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка() ИЛИ НЕ ЗначениеЗаполнено(ДанныеТекущегоКТК.ВидСобственности) Тогда
		//				Если ЗначениеЗаполнено(СтрокаУ.ТипКТК) Тогда
		//					ОбТЕ = СтрокаУ.НомерКТК.ПолучитьОбъект();
		//					ОбТЕ.ТипТЕ = СтрокаУ.ТипКТК;
		//					ОбТЕ.Записать();
		//				КонецЕсли;	
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//	//ДИТ Шевченко А.В. US 64086 TA 74172 25.08.2023 -конец   
		//Стало:
		Если ЗначениеЗаполнено(СтрокаУ.НомерКТК) И НЕ ЗначениеЗаполнено(СтрокаУ.НомерКТК.ТипТЕ) Тогда
			ДанныеТекущегоКТК = ДанныеКТК.Получить(СтрокаУ.НомерКТК);
			Если ДанныеТекущегоКТК <> Неопределено Тогда
				Если ДанныеТекущегоКТК.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский ИЛИ ДанныеТекущегоКТК.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка() ИЛИ НЕ ЗначениеЗаполнено(ДанныеТекущегоКТК.ВидСобственности) Тогда
					Если ЗначениеЗаполнено(СтрокаУ.ТипКТК) Тогда
						ОбТЕ = СтрокаУ.НомерКТК.ПолучитьОбъект();
						ОбТЕ.ТипТЕ = СтрокаУ.ТипКТК;
						ОбТЕ.Записать();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023	
		
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
			// Было:
			//СтрокаУ.ТипКТК 	  = СтрокаУ.НомерКТК.ТипТЕ;
			//СтрокаУ.РазмерКТК = СтрокаУ.ТипКТК.РазмерКТК; 
			//Стало:
			Если ЗначениеЗаполнено(СтрокаУ.НомерКТК) Тогда
				СтрокаУ.ТипКТК 	  = СтрокаУ.НомерКТК.ТипТЕ;
				СтрокаУ.РазмерКТК = СтрокаУ.ТипКТК.РазмерКТК;	
			КонецЕсли;
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024
			//Евросиб Коханенко Н.А. 07.07.2023 (( #72162 
			Если КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(ТекущийОбъект.Контрагент) И ТекущийОбъект.ЗапросНаКТК Тогда
				СтрокаУ.ПерваяМиля = ТекущийОбъект.СписокЗапросНаКТК[0].Автоперевозка; 
				СтрокаУ.ПоследняяМиля = ТекущийОбъект.СписокЗапросНаКТК[0].ПоследняяМиля;
				Если ТекущийОбъект.ПСЦ.Калькуляции.Количество() = 1 Тогда 
					СтрокаУ.Калькуляция = ТекущийОбъект.ПСЦ.Калькуляции[0].Калькуляция;
					//Евросиб Коханенко Н.А. 03.05.2024 (( #84617 
					СтрокаУ.УчетноеНаправление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУ.Калькуляция, "УчетноеНаправление");
					//Евросиб Коханенко Н.А. 03.05.2024 )) #84617 
				КонецЕсли;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 07.07.2023 )) #72162   
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
		//КонецЕсли;
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
	КонецЦикла;	
	//ДИТ Шевченко А.В. US 62421 TA 70104 15.05.2023 -конец      
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023    
	//Проверяем изменились ли ключи аналитики
	//Есть обработчик оповещения и обновления данных ключей на форме, но мало ли... вдруг за 5 секунд кто то поменял ключ
	БылоОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> "" и СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			БылоОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	
	Если БылоОбновлениеКлюча Тогда   
		ОбновитьДанныеКлючаНаФорме();
		ОбщегоНазначения.СообщитьПользователю("Перед записью заявки обнаружено, что ключи аналитики перевозки изменились. Данные перезаполнены, внесите необходимые корректировки");		
		Отказ = Истина;
	КонецЕсли;  
	
	Если не Отказ Тогда 
		ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования();
		ДанныеОбновленияКлючей = ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки();
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляОбновленияКлючейАналитики", ДанныеОбновленияКлючей); 
	КонецЕсли; 
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ГруппаДКС", ГруппаДКС);
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//Евросиб Коханенко Н.А. 24.01.2025 (( #98939 
    ТекущийОбъект.ДополнительныеСвойства.Вставить("АвтозагрузкаРейсовИзДХ", АвтозагрузкаРейсовИзДХ);
	//Евросиб Коханенко Н.А. 24.01.2025 )) #98939
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ТранзитДляКлиента", ТранзитДляКлиента);
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СибурКонтрагент = Константы.СибурКонтрагент.Получить();
	Если Объект.Контрагент = СибурКонтрагент Тогда
		
		//ЭтоЗаявкаНаПорожний = Истина;
		//ДанныеПоЗаявкеСибур = ПолучитьДанныеПоЗаявкеСибур();	
		//Если ДанныеПоЗаявкеСибур.Следующий() Тогда
		//	Если ДанныеПоЗаявкеСибур.Заявка <> Объект.Ссылка Тогда
		//		ЭтоЗаявкаНаПорожний = Ложь;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(СибурСвязаннаяЗаявка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Заявка.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Заявка КАК Заявка
			|ГДЕ
			|	Заявка.Ссылка = &Ссылка
			|	И (Заявка.Грузополучатель <> &Грузополучатель
			|			ИЛИ Заявка.ПортОтправления <> &ПортОтправления
			|			ИЛИ Заявка.ПунктПеревалки <> &ПунктПеревалки
			|			ИЛИ Заявка.ПритерминальнаяСтанция <> &ПритерминальнаяСтанция
			|			ИЛИ Заявка.СтанцияОтправленияГруженого <> &СтанцияОтправленияГруженого
			|			ИЛИ Заявка.СтанцияНазначенияГруженого <> &СтанцияНазначенияГруженого)";
			
			Если Объект.ГруженыйРейс Тогда
				Запрос.Текст = Запрос.Текст +
				"
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаявкаСоставУслуги.Ссылка
				|ИЗ
				|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
				|ГДЕ
				|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
				|	И (ЗаявкаСоставУслуги.СтанцияОтправления <> &ПритерминальнаяСтанция
				|	ИЛИ ЗаявкаСоставУслуги.СтанцияНазначения <> &СтанцияОтправленияГруженого)";
			Иначе				
				Запрос.Текст = Запрос.Текст +
				"
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаявкаСоставУслуги.Ссылка
				|ИЗ
				|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
				|ГДЕ
				|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
				|	И (ЗаявкаСоставУслуги.Грузополучатель <> &Грузополучатель
				|	ИЛИ ЗаявкаСоставУслуги.СтанцияОтправления <> &СтанцияОтправленияГруженого
				|	ИЛИ ЗаявкаСоставУслуги.СтанцияНазначения <> &СтанцияНазначенияГруженого)";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Грузополучатель", Объект.Грузополучатель);
			Запрос.УстановитьПараметр("Ссылка", СибурСвязаннаяЗаявка);
			Запрос.УстановитьПараметр("ПортОтправления", Объект.ПортОтправления);
			Запрос.УстановитьПараметр("ПунктПеревалки", Объект.ПунктПеревалки);
			Запрос.УстановитьПараметр("ПритерминальнаяСтанция", Объект.ПритерминальнаяСтанция);
			Запрос.УстановитьПараметр("СтанцияОтправленияГруженого", Объект.СтанцияОтправленияГруженого);
			Запрос.УстановитьПараметр("СтанцияНазначенияГруженого", Объект.СтанцияНазначенияГруженого);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				СвязаннаяЗаявкаОбъект = СибурСвязаннаяЗаявка.ПолучитьОбъект();
				СвязаннаяЗаявкаОбъект.Грузополучатель = Объект.Грузополучатель;
				СвязаннаяЗаявкаОбъект.ПортОтправления = Объект.ПортОтправления;
				СвязаннаяЗаявкаОбъект.ПунктПеревалки = Объект.ПунктПеревалки;
				СвязаннаяЗаявкаОбъект.ПритерминальнаяСтанция = Объект.ПритерминальнаяСтанция;
				СвязаннаяЗаявкаОбъект.СтанцияОтправленияГруженого = Объект.СтанцияОтправленияГруженого;
				СвязаннаяЗаявкаОбъект.СтанцияНазначенияГруженого = Объект.СтанцияНазначенияГруженого;
				Если Объект.ГруженыйРейс Тогда
					Для Каждого СтрокаТЧ Из СвязаннаяЗаявкаОбъект.СоставУслуги Цикл
						СтрокаТЧ.СтанцияОтправления = Объект.ПритерминальнаяСтанция;
						СтрокаТЧ.СтанцияНазначения = Объект.СтанцияОтправленияГруженого;
					КонецЦикла;
				Иначе
					Для Каждого СтрокаТЧ Из СвязаннаяЗаявкаОбъект.СоставУслуги Цикл
						СтрокаТЧ.Грузополучатель = Объект.Грузополучатель;
						СтрокаТЧ.СтанцияОтправления = Объект.СтанцияОтправленияГруженого;
						СтрокаТЧ.СтанцияНазначения = Объект.СтанцияНазначенияГруженого;
					КонецЦикла;
				КонецЕсли;
				Если СвязаннаяЗаявкаОбъект.Проведен Тогда
					РежимЗаписи = РежимЗаписиДокумента.Проведение;
				Иначе
					РежимЗаписи = РежимЗаписиДокумента.Запись;
				КонецЕсли;
				СвязаннаяЗаявкаОбъект.Записать(РежимЗаписи);
			КонецЕсли;
			
		КонецЕсли;
			
		Запись = РегистрыСведений.СибурРазмещенныеЗаявки.СоздатьМенеджерЗаписи();
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 07.04.2023
		Для Каждого Стр Из Объект.НомераЛотов Цикл 		
			Запись.НомерЛота = Стр.НомерЛота;
			// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 07.04.2023
			Если Объект.ГруженыйРейс Тогда
				Запись.Заявка = СибурСвязаннаяЗаявка;
				Запись.Прочитать();
				Запись.Заявка = СибурСвязаннаяЗаявка;
				Запись.ЗаявкаНаОтправкуГруженых = Объект.Ссылка;
			Иначе
				Запись.Заявка = Объект.Ссылка;
				Запись.Прочитать();
				Запись.Заявка = Объект.Ссылка;
				Запись.ЗаявкаНаОтправкуГруженых = СибурСвязаннаяЗаявка;			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Запись.Заявка) Тогда
				//Запись.RFQ_ID = СибурRFQ_ID;
				//Запись.EXT_RFQ_ID = СибурEXT_RFQ_ID;
				//Запись.ПлановаяДатаОтправленияПорожнего = СибурПлановаяДатаОтправленияПорожнего;
				Запись.ДатаКрайнегоСрокаОтветаЭкспедитора = СибурДатаКрайнегоСрокаОтветаЭкспедитора;
				Запись.ВидЗакупкиКод = СибурВидЗакупкиКод;
				Запись.ВидЗакупкиНаименование = СибурВидЗакупкиНаименование;
				Запись.ВидОтправкиКод = СибурВидОтправкиКод;
				Запись.ВидОтправкиНаименование = СибурВидОтправкиНаименование;
				//Запись.НомерДоговора = СибурНомерДоговора;
				//Запись.НеобходимаяДатаПодачиПорожнегоСостава = СибурНеобходимаяДатаПодачиПорожнегоСостава;
				//Запись.ПлановаяДатаОтгрузкиГруженогоСостава = СибурПлановаяДатаОтгрузкиГруженогоСостава;
				//Запись.КодСтанцииОтправкиГруженого = СибурКодСтанцииОтправкиГруженого;
				Запись.НазваниеСтанцииОтправкиГруженого = СибурНазваниеСтанцииОтправкиГруженого;
				Запись.МаршрутСледованияГруженогоПоезда = СибурМаршрутСледованияГруженогоПоезда;
				//Запись.КодСтанцииНазначенияГруженого = СибурКодСтанцииНазначенияГруженого;
				//Запись.НазваниеСтанцииНазначенияГруженого = СибурНазваниеСтанцииНазначенияГруженого;
				Запись.ОбщееКоличествоЗапрашиваемыхКонтейнеров = СибурОбщееКоличествоЗапрашиваемыхКонтейнеров;
				Запись.ЕдиницаИзмеренияКоличестваКонтейнеров = СибурЕдиницаИзмеренияКоличестваКонтейнеров;
				Запись.КодТипаКонтейнеров = СибурКодТипаКонтейнеров;
				Запись.ВесПродукции = СибурВесПродукции;
				Запись.ЕдиницаИзмеренияВесаПродукции = СибурЕдиницаИзмеренияВесаПродукции;
				Запись.Комментарий = СибурКомментарий;
				Запись.ИмяМенеджера = СибурИмяМенеджера;
				Запись.КонтактныйТелефонМенеджера = СибурКонтактныйТелефонМенеджера;
				Запись.АдресЭлектроннойПочтыМенеджера = СибурАдресЭлектроннойПочтыМенеджера;
				//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
				Запись.ЭкспедиторВПорту = СибурЭкспедиторВПорту;
				//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
				Запись.Записать();
			КонецЕсли;
			// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 07.04.2023
		КонецЦикла;
		// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 07.04.2023
	КонецЕсли;
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	МассивРелизов = Объект.СписокЗапросНаКТК.Выгрузить().ВыгрузитьКолонку("РелизКлиента");
	НомерЗаявокВРелизах = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивРелизов, "Заявка");
	Для Каждого ТекущаяСтрока Из Объект.СписокЗапросНаКТК Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.РелизКлиента) Тогда
			НомерЗаявкиВРелизе = НомерЗаявокВРелизах.Получить(ТекущаяСтрока.РелизКлиента);
			Если Не ЗначениеЗаполнено(НомерЗаявкиВРелизе) Тогда
				СохранитьНомерЗаявкиВРелиз(ТекущаяСтрока.РелизКлиента);
			КонецЕсли;	
		КонецЕсли;
		
		РегистрыСведений.РелизыКлиентовЗапросовНаКТК.ПривязатьРелизКЗапросу(Объект.Ссылка, ТекущаяСтрока.ИдентификаторСтроки, ТекущаяСтрока.РелизКлиента, Отказ);
	КонецЦикла;	
	РегистрыСведений.РелизыКлиентовЗапросовНаКТК.ОчиститьЗаписиПоУдаленнымСтрокам(Объект.Ссылка);
	// Евросиб Фролов) 
	
	//Евросиб Коханенко Н.А. 27.02.2024 (( #80981
	Если НЕ Отказ Тогда
		ОбновитьСтоимостьВЗапросахНаАвтоперевозку(ТекущийОбъект);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 27.02.2024 )) #80981  
	
	//Евросиб Коханенко Н.А. 30.07.2024 (( #88606
	ОтвязатьКлючиАналитикиУдаленныхСтрокОтЗаявки();
	//Евросиб Коханенко Н.А. 30.07.2024 )) #88606
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	ОбновитьСВВиТДТ_Сервер();
	//Евросиб Каблов 01.07.2021 ( Ticket#0228545
	ЗаполнитьНомераПоездовКлиентов();
	//Евросиб Каблов 01.07.2021 )
	
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ЗаполнитьДобавленныеКолонкиТаблицыЗапросНаКТК();
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	
	// Евросиб Фролов)  
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
	СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования();
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьОпасность();
	//Если Элементы.ГруппаОграничения.Видимость Тогда
	//	ОбновитьОграничения();
	//КонецЕсли;
	
	Оповестить("ОбновитьДанныеСтоков");
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
	ОбновитьДанныеКлючаНаФорме();
	ОбновитьВидимостьДетализацияПоГрузу();
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023 
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));   
	Оповестить("НеобходимоОбновитьДанныеКлючейАналитикиПеревозки",, ЭтаФорма);
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023  
	
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 15.04.2024
	Оповестить("НеобходимоОбновитьФормуЗапросаНаАвто", , ЭтаФорма);
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 15.04.2024 
	
	// ДИТ US 83871 ТА 85268 Сержантова А.С. 17.05.2024
	ОповеститьОбИзменении(Тип("СправочникСсылка.РейсыАвто"));
	// ДИТ US 83871 ТА 85268 Сержантова А.С. 17.05.2024
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ВидЗадолженности = ПолучитьВидЗадолженности(Объект.Ссылка);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 23.06.2025 ((
	ПроверитьПлановыеЛокацииНаНаличиеВКалькуляции();
	// Евросиб Рыбьяков К.А. 23.06.2025 ))
	
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 23.06.2022 -Начало
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если Источник.ИмяФормы = "Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента" Тогда
			ЗаполнитьСсылкаНаЗапросыАвтоперевозки();
			ОбновитьИменаКомандЗапросовНаАстоперевозку();		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//БИТ Белинский Д.А. 10.04.2023 -начало #66201
&НаСервереБезКонтекста
Функция ДирекцияКонтейнерныхПеревозок()
	Возврат Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
КонецФункции
//БИТ Белинский Д.А. 10.04.2023 -конец #66201 

//БИТ Белинский Д.А. 10.04.2023 -начало #66201
&НаСервереБезКонтекста
Функция ЭтоМежсервисныеРасходы(ТипКалькуляции)
	
	Результат = Ложь;
	Если ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы") 
		ИЛИ ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф") Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции
//ДИТ Шевченко А.В. TASK 51973 23.06.2022 -Конец

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024    
&НаСервере
Функция ПроверитьВыставленныеПоЗаявкеСчета(СсылкаЗаявки)

	МассивСчетов = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФормы.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ДанныеФормы.НомерКТК КАК КТК
		|ПОМЕСТИТЬ ВТ_ДанныеФормы
		|ИЗ
		|	&ДанныеФормы КАК ДанныеФормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеФормы.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	ВТ_ДанныеФормы КАК ВТ_ДанныеФормы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО ВТ_ДанныеФормы.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ
		|	КлючиАналитикиПеревозки.Контейнер <> ВТ_ДанныеФормы.КТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Представление КАК ПредставлениеСчета
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ = &Документ
		|	И НЕ СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления
		|	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Документ", СсылкаЗаявки);   
	Запрос.УстановитьПараметр("ДанныеФормы", Объект.СоставУслуги.Выгрузить(, "КлючАналитикиПеревозки, НомерКТК"));
	
	Результаты = Запрос.ВыполнитьПакет();  
	ЕстьИзменениеКТК = Результаты[1];
	Если ЕстьИзменениеКТК.Пустой() Тогда
		Возврат МассивСчетов;
	КонецЕсли;  
	
	РезультатЗапроса = Результаты[2];
	Если не РезультатЗапроса.Пустой() Тогда
		ВыборкаСчетов = РезультатЗапроса.Выбрать();
		Пока ВыборкаСчетов.Следующий() Цикл
			МассивСчетов.Добавить(ВыборкаСчетов.ПредставлениеСчета);
		КонецЦикла;
	КонецЕсли;

	Возврат МассивСчетов;
КонецФункции 

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024
&НаКлиенте
Процедура ПоказатьВопросПродолжениеЗаписиЗавершение(Результат, ПараметрыЗаписи) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросВыставленныеСчетаЗадан", Истина);
	    Записать(ПараметрыЗаписи);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапросНаКТКПриИзменении(Элемент)
	
	//Субботин 77659 24.11.2023 начало
	Если Объект.ЗапросНаКТК и НеобходимоПроверитьЗаписиДокумента()  Тогда		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ для перехода к запросу на КТК");
		Объект.ЗапросНаКТК = НЕ Объект.ЗапросНаКТК;
		Возврат;
	КонецЕсли;	
	 
	Если Объект.ЗапросНаКТК и  (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РефСцеп") Или ПроверитьСвязанныеДокументы()) Тогда 
			СтруктураПоиска = Новый Структура("ПринадлежностьТЕ ,ПеренесенВЗаявку", ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба")
			,ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка"));
			КТКЕвросиба = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
			Если КТКЕвросиба.Количество() > 0 Тогда			
				ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяПоЗаполнениюЗапроса", ЭтаФорма,);
				ПоказатьВопрос(ОпОп,"Запрос на ктк будет заполнен на основании ТЧ Услуги",РежимДиалогаВопрос.ОКОтмена);						
			КонецЕсли; 
	КонецЕсли;
	//Субботин 77659 24.11.2023 начало

	// Евросиб Фролов (16.11.2021 TASK№ №41969
	НастроитьВидимостьВкладкиЗапросНаКТК();
	// Евросиб Фролов)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
    НастроитьВидимостьКомандЗаполнения();
	// Евросиб Фролов) 
	
	//Субботин 77659 28.11.2023 начало 	
	Если НЕ Объект.ЗапросНаКТК Тогда		
		Объект.СписокЗапросНаКТК.Очистить();
	КонецЕсли;	
	//Субботин 77659 28.11.2023 Конец	
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗаявкиСибурПриИзменении(Элемент) //ДИТ Шевченко А.В. 57147 28.12.2022
	
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.Подтверждено"));
	МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ПодтвержденоСУсловием"));
	МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ИзмененоПослеСогл"));
	
	Если МассивСтатусы.Найти(Объект.СтатусЗаявкиСибур) <> Неопределено Тогда		
		Если Объект.ПереченьРейсов.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Объект.ПереченьРейсов[0].Рейс) Тогда
				РейсОтменен = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ПереченьРейсов[0].Рейс,"РейсОтменен");
				Если НЕ РейсОтменен Тогда 
					ВыполнитьПроверкиСибур();
				КонецЕсли
			КонецЕсли
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписокЗапросНаКТК

&НаКлиенте
Процедура СписокЗапросНаКТКПриИзменении(Элемент)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	
	ТекД = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];
		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.СписокЗапросНаКТК.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			Если РезПроверки = Истина Тогда
				
				//Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение; 
				//Субботин В.А. 58332 08.06.23  Начало
				Если Сч=0 тогда 
					продолжить;
				КонецЕсли;
				Элементы.СписокЗапросНаКТК.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				Попытка
					Выполнить(""+Элемент.ТекущийЭлемент.Имя + "ПриИзменении"+"(Объект[ИмяТЧ][Сч])");
				Исключение 
				//Субботин В.А. 58332 08.06.23  Конец 
				КонецПопытки
				
			КонецЕсли; 
			
		КонецЦикла;
		//Субботин В.А. 58332 08.06.23  Начало
		Элементы.СписокЗапросНаКТК.ТекущаяСтрока = Объект[ИмяТЧ][0].ПолучитьИдентификатор();
		текД = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
		//Субботин В.А. 58332 08.06.23  Конец
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		//Субботин 77659 24.11.2023 Начало  падала ошибка если строка была последней
		Если текД <> Неопределено Тогда
		//Субботин 77659 24.11.2023 Конец	
			ИмяТЧ = Элемент.Имя;
			ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
			
			НовоеЗначение = ТекД[ИмяПоля];
			
			СтрокаПройдена = Ложь;		
			Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
				РезПроверки = Элементы.СписокЗапросНаКТК.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
				
				СтрокаПройдена = СтрокаПройдена ИЛИ Элементы.СписокЗапросНаКТК.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
				
				Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда
					
					Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
					
				КонецЕсли; 
				
			КонецЦикла;
	//Субботин 77659 24.11.2023 Начало
		КонецЕсли;
	//Субботин 77659 24.11.2023 конец	
	КонецЕсли;	

	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	//Субботин 77659 26.12.2023 начало добавил проверку на неопределено. иначе при удалении посл. строки была ошибка
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если не Элемент.ТекущиеДанные = Неопределено тогда 
		//Субботин 77659  26.12.2023 конец
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Фролов)
	
	//++ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022
	ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	Сообщение = "Запрещено вводить локации с типом: ""Сток"", ""Терминал"", ""Порт"", ""Станция ЖД"", ""Улица""!";
	Если Элемент.ТекущийЭлемент.Имя = "СписокЗапросНаКТКЛокацияВыдачи"
	   И НеобходимоОчиститьЛокациюНаСервере(ТекущаяСтрока.ЛокацияВыдачи) Тогда
			ТекущаяСтрока.ЛокацияВыдачи = ЛокацияПустаяСсылка;
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение + " Локация выдачи очищена!"); 
	КонецЕсли;
		
	Если Элемент.ТекущийЭлемент.Имя = "СписокЗапросНаКТКЛокацияСдачи"	
	   И НеобходимоОчиститьЛокациюНаСервере(ТекущаяСтрока.ЛокацияСдачи) Тогда
			ТекущаяСтрока.ЛокацияСдачи = ЛокацияПустаяСсылка;
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение + " Локация сдачи очищена!"); 
	КонецЕсли;
	//--ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022
	
	ОбновитьИтоги();
	// Евросиб Фролов)
КонецПроцедуры

//++ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022
&НаСервере
Функция НеобходимоОчиститьЛокациюНаСервере(Локация)
	Возврат Документы.Заявка.НеобходимоОчиститьЛокацию(Локация);	
КонецФункции
//--ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022

&НаКлиенте
Процедура СписокЗапросНаКТКПриАктивизацииСтроки(Элемент)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	УстановитьОтборТранспортныхСредств();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	Если НоваяСтрока И Копирование Тогда		
		ОчиститьКопируемыеПоля(Элементы.СписокЗапросНаКТК.ПодчиненныеЭлементы);
		Элемент.ТекущиеДанные.ИдентификаторСтроки = ""; // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		Элемент.ТекущиеДанные.РелизКлиента = ПредопределенноеЗначение("Документ.РелизКлиента.ПустаяСсылка"); //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	КонецЕсли;		
	// Евросиб Фролов)
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	УстановитьОтборТранспортныхСредств();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКопируемыеПоля(ПоляТаблицы)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	
	СписокКопируемыхПолей = 
	"СписокЗапросНаКТККоличествоКТК,
	|СписокЗапросНаКТКТипКТК,
	|СписокЗапросНаКТКДействиеРелизаНачало,
	|СписокЗапросНаКТКДействиеРелизаОкончание,
	|СписокЗапросНаКТКЛокацияВыдачи,
	|СписокЗапросНаКТККомментарийКЛокацииВыдачи,
	|СписокЗапросНаКТКЛокацияСдачи,
	|СписокЗапросНаКТККомментарийКЛокацииСдачи,
	|СписокЗапросНаКТКСрокИспользованияКТК,
	|СписокЗапросНаКТККомментарийКСрокуИспользованияКТК,
	|СписокЗапросНаКТКСтавка,
	|СписокЗапросНаКТККомментарийКСтавке,
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	|СписокЗапросНаКТКВалютаПоДоговору,
	|СписокЗапросНаКТКСНП";
	// Евросиб Фролов)
	
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	//ПоляТаблицы = Элементы.СписокЗапросНаКТК.ПодчиненныеЭлементы;
	Для Каждого ТекущееПоле Из ПоляТаблицы Цикл			
		
		Если ТекущееПоле.Имя = "СписокЗапросНаКТКНомерСтроки" Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(ТекущееПоле) = Тип("ПолеФормы") Тогда
			
			Если СтрНайти(СписокКопируемыхПолей, ТекущееПоле.Имя) = 0 Тогда
				Если СтрНачинаетсяС(ТекущееПоле.Имя, "СписокЗапросНаКТКРелизКлиента")
					И ТекущееПоле.Имя <> "СписокЗапросНаКТКРелизКлиента" Тогда
					// Подчиненный реквизит из релиза клиента
					Продолжить;
				КонецЕсли;	
				// В поле, которое не должно копироваться, установим значение по умолчанию того типа, который у поля.
				ТекущиеДанные[СтрЗаменить(ТекущееПоле.Имя, "СписокЗапросНаКТК", "")] = Элементы[ТекущееПоле.Имя].ОграничениеТипа.ПривестиЗначение();
			КонецЕсли;
		Иначе
			ОчиститьКопируемыеПоля(ТекущееПоле.ПодчиненныеЭлементы);
		КонецЕсли;
					
	КонецЦикла;
	
	// Евросиб Фролов)

КонецПроцедуры	

&НаКлиенте
Процедура СписокЗапросНаКТКПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	Если НоваяСтрока И ОтменаРедактирования Тогда
		ОбновитьИтоги();
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКПослеУдаления(Элемент)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	УдалитьСтрокиПодчиненныхТаблицы("ТранспортныеСредства");
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКАвтовывозСиламиЕвросибПриИзменении(Элемент)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб") Тогда
		// Евросиб Фролов (16.02.2022 Task №44768
		//
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементУдален
		//ТекущиеДанные.ДанныеПоАвтоперевозке = "Заполняется сотрудником ОРП";
		ОчиститьТранспортныеСредстваИПеревозчиковСтроки(ТекущиеДанные.ИдентификаторСтроки,"ТранспортныеСредства");
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
		// Евросиб Фролов)
	ИначеЕсли ТекущиеДанные.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
		ТекущиеДанные.ФИОВодителяПерваяМиля = "";
		ТекущиеДанные.НомерТСПерваяМиля = "";
		ТекущиеДанные.АвтоперевозчикПерваяМиля = "";
		ТекущиеДанные.КомментарийПерваяМиля = "";
		ТекущиеДанные.ФИОВодителяПоследняяМиля = "";
		ТекущиеДанные.НомерТСПоследняяМиля = "";
		ТекущиеДанные.АвтоперевозчикПоследняяМиля = "";
		ТекущиеДанные.КомментарийПоследняяМиля = "";
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементУдален
		//ТекущиеДанные.ДанныеПоАвтоперевозке = "Заполняется сотрудником ОРК во вложенной таблице ниже"; // Евросиб Фролов (16.02.2022 Task №44768
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец  
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Начало: 11.01.2024 - подтянем в таблицу Транспортных средств данные строк из услуг по связи с релизом клиента 
		СтрокиУслугПоРелизу = Объект.СоставУслуги.НайтиСтроки(Новый Структура("Релиз", ТекущиеДанные.РелизКлиента));
		Для каждого СтрокаУслуги Из СтрокиУслугПоРелизу Цикл
			ЗаполнитьДанныеТаблицАвтоперевозки(СтрокаУслуги, Истина);		
		КонецЦикла;
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Конец: 11.01.2024
	Иначе
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		// Евросиб Фролов (16.02.2022 Task №44768
		//ТекущиеДанные.ВодительКлиента = "";
		//ТекущиеДанные.ТранспортноеСредствоКлиента = "";
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементУдален
		//ТекущиеДанные.ДанныеПоАвтоперевозке = "";
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
		ОчиститьТранспортныеСредстваИПеревозчиковСтроки(ТекущиеДанные.ИдентификаторСтроки,"ТранспортныеСредства"); 
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
		// Евросиб Фролов)
		ТекущиеДанные.ФИОВодителяПерваяМиля = "";
		ТекущиеДанные.НомерТСПерваяМиля = "";
		ТекущиеДанные.АвтоперевозчикПерваяМиля = "";
		ТекущиеДанные.КомментарийПерваяМиля = "";
		ТекущиеДанные.ФИОВодителяПоследняяМиля = "";
		ТекущиеДанные.НомерТСПоследняяМиля = "";
		ТекущиеДанные.АвтоперевозчикПоследняяМиля = "";
		ТекущиеДанные.КомментарийПоследняяМиля = "";
		// Евросиб Фролов)
	КонецЕсли;
	
	//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Начало
	УстановитьОтборТранспортныхСредств();
	//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Конец
	// Евросиб Фролов)
	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 07.12.2022
	УстановитьСтанциюДату(Элементы.СписокЗапросНаКТК.ТекущиеДанные);	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 07.12.2022
КонецПроцедуры	

// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 29.12.2022
&НаКлиенте
Процедура УстановитьСтанциюДату(ТекСтр)
	Если ТекСтр.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется") Тогда
		ТекСтр.СтанцияНазначенияПоЖД = СтанцияИзРейса;
		ТекСтр.ДатаОтправленияПоЖДПлан = ДатаОтправленияИзРейса; 
	Иначе 
		ТекСтр.СтанцияНазначенияПоЖД = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		ТекСтр.ДатаОтправленияПоЖДПлан = Дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры	
// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022

// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 29.12.2022
&НаКлиенте
Процедура СтанцияДата()
	Если Объект.ПереченьРейсов.Количество() > 0 Тогда 
		мРейс = Объект.ПереченьРейсов[0].Рейс;
		Если ТипЗнч(мРейс) = Тип("СправочникСсылка.РейсыЖД") Тогда 
			СтруктураРеквизитов = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(мРейс,"ПунктНазначения,ДатаОтправления");
			СтанцияИзРейса = СтруктураРеквизитов.ПунктНазначения;
			ДатаОтправленияИзРейса = СтруктураРеквизитов.ДатаОтправления; 
		КонецЕсли; 
	Иначе 
		СтанцияИзРейса = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		ДатаОтправленияИзРейса = Дата(1,1,1); 
	КонецЕсли;  
КонецПроцедуры	
// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022 

//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
&НаКлиенте
Процедура СписокЗапросНаКТКПоследняяМиляПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;	
	Если НЕ ТекущиеДанные.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
		//ДИТ Шевченко А.В. TASK  06.10.2022 -Начало
		ОчиститьТранспортныеСредстваИПеревозчиковСтроки(ТекущиеДанные.ИдентификаторСтроки,"ТранспортныеСредстваПоследняяМиля");
		//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
	КонецЕсли;
	
	//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Начало
	УстановитьОтборТранспортныхСредств();
	//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Конец
	
КонецПроцедуры 
//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец

&НаКлиенте
Процедура СписокЗапросНаКТКЛокацияВыдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Евросиб Фролов (03.03.2022 Ticket №0262925
	// Необходимо при выборе локации в поле "Локация выдачи" установить отбор,
	// исключающий отображение объектов с типом "Сток", "Терминал", "Порт", "Станция ЖД", "Улица"
	СтандартнаяОбработка = Ложь;
	
	ТипЛокации = Новый СписокЗначений;
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
	//Евросиб - АСуслов 05.05.2023 11:31:32 #67492
	//(
	//ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Субъект"));
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	//)
	//Евросиб - АСуслов 05.05.2023 11:31:39 #67492
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Регион"));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ТипЛокации", ТипЛокации);
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКЛокацияСдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Евросиб Фролов (03.03.2022 Ticket №0262925
	// Необходимо при выборе локации в поле "Локация сдачи" установить отбор,
	// исключающий отображение объектов с типом "Сток", "Терминал", "Порт", "Станция ЖД", "Улица"
	СтандартнаяОбработка = Ложь;
	
	ТипЛокации = Новый СписокЗначений;
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
	//Евросиб - АСуслов 05.05.2023 11:32:04 #67492
	//(
	//ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Субъект"));
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	//)
	//Евросиб - АСуслов 05.05.2023 11:32:08 #67492
	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Регион"));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ТипЛокации", ТипЛокации);
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТранспортныеСредства

&НаКлиенте
Процедура ТранспортныеСредстваПриИзменении(Элемент)
	//ДИТ Шевченко А.В. 58552 05.10.2022 -начало
	ТекД = Элементы.ТранспортныеСредства.ТекущиеДанные; 
	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	Если ТекД = Неопределено ИЛИ ТекД.КлючАналитикиПеревозки = ПредопределенноеЗначение("Справочник.КлючиАналитикиПеревозки.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;	
	СтруктураДляКлюча = Новый Структура("ФИОВодителя,РегНомерТС,ПаспортныеДанные,Автоперевозчик,ИНН,КПП,КлючАналитикиПеревозки");
	ЗаполнитьЗначенияСвойств(СтруктураДляКлюча,ТекД);   
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 18.01.2024
	Если ЗначениеЗаполнено(ТекД.Автоперевозчик) и ТипЗнч(ТекД.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда   
		ЗначенияРекв = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекД.Автоперевозчик, "ИНН, КПП");
		ТекД.ИНН = ЗначенияРекв.ИНН; 
		ТекД.КПП = ЗначенияРекв.КПП; 
	Иначе
		Элементы.ТранспортныеСредстваИНН.Доступность = Истина;
		Элементы.ТранспортныеСредстваКПП.Доступность = Истина;
	КонецЕсли;
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 18.01.2024
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
	//ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),ТекД.ВерсияКлюча);
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	
	Если ЗаполнятьВниз Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];
		
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
		Если ИмяПоля = "Автоперевозчик" Тогда     
			Если ТипЗнч(НовоеЗначение) = Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(НовоеЗначение) Тогда
				РеквизитыАвтоперевозчика = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(НовоеЗначение, "ИНН, КПП", Ложь);
			Иначе
				РеквизитыАвтоперевозчика = Новый Структура("ИНН, КПП", "", "");
			КонецЕсли;
		КонецЕсли;
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
		
		СтрокаПройдена = Ложь;		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.ТранспортныеСредства.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			
			СтрокаПройдена = СтрокаПройдена ИЛИ Элементы.ТранспортныеСредства.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			
			Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда
				
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение; 
				
				// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
				Если ИмяПоля = "Автоперевозчик" Тогда
					Объект[ИмяТЧ][Сч]["ИНН"] = РеквизитыАвтоперевозчика.ИНН;
					Объект[ИмяТЧ][Сч]["КПП"] = РеквизитыАвтоперевозчика.КПП;
				КонецЕсли;
				// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	//ДИТ Шевченко А.В. 58552 05.10.2022 -конец     
	
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 24.01.2024
	ЗаполнитьТранспортныеСредстваВУслугах(ТекД, ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"));
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 24.01.2024
КонецПроцедуры       

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ЗаполнитьТранспортныеСредстваВУслугах(ТекущиеДанные, ЭтапПеревозки)

	СтрокиВУслугах = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекущиеДанные.КлючАналитикиПеревозки));	
	Если СтрокиВУслугах.Количество() > 0 Тогда
		Если ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля") Тогда
			СтрокиВУслугах[0].ФИОВодителя = ТекущиеДанные.ФИОВодителя;
			СтрокиВУслугах[0].НомерАвто = ТекущиеДанные.РегНомерТС;
			СтрокиВУслугах[0].АвтоперевозчикПерваяМиля = ТекущиеДанные.Автоперевозчик;
		//Евросиб Коханенко Н.А. 23.01.2025 (( #91409 
		//Иначе
		ИначеЕсли ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля") Тогда
		//Евросиб Коханенко Н.А. 23.01.2025 )) #91409 
			СтрокиВУслугах[0].НомерКТК = ТекущиеДанные.Контейнер;
			СтрокиВУслугах[0].ФИОВодителяВыгрузка = ТекущиеДанные.ФИОВодителя;
			СтрокиВУслугах[0].НомерАвтоВыгрузка = ТекущиеДанные.РегНомерТС;
			СтрокиВУслугах[0].АвтоПеревозчик = ТекущиеДанные.Автоперевозчик;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Отказ = Истина;
	КонецЕсли;
	
    ТекущиеДанныеЗапроса = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	Если ТекущиеДанныеЗапроса = Неопределено Тогда
		ПоказатьПредупреждение(, "Укажите строку запроса");
		Отказ = Истина;
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Отказ = Истина;
	КонецЕсли;
	
	ТекущиеДанныеЗапроса = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	Если ТекущиеДанныеЗапроса = Неопределено Тогда
		ПоказатьПредупреждение(, "Укажите строку запроса");
		Отказ = Истина;
	КонецЕсли;
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;	
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущиеДанныеЗапроса = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
		ТекущаяСтрока.ИдентификаторСтрокиЗапроса = ТекущиеДанныеЗапроса.ИдентификаторСтроки;
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
		//ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		Если ЗначениеЗаполнено(ТекущиеДанныеЗапроса.РелизКлиента) Тогда
			МассивКлючей = Новый Массив;
			Для Каждого Стр Из Объект.ТранспортныеСредства Цикл
				МассивКлючей.Добавить(Стр.КлючАналитикиПеревозки);
			КонецЦикла;	
			СтруктураОтвет = ПолучитьКлючиИзРелизаКлиента(ТекущиеДанныеЗапроса.РелизКлиента,МассивКлючей,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"));
			
			Если СтруктураОтвет.ПустойКлюч Тогда
				Ответ = СоздатьКлючАналитики(Объект.Ссылка);
				ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
				ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
			Иначе
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока,СтруктураОтвет.КлючРелиза[0]);
			КонецЕсли;	
		Иначе
			// ДИТ US 78243 ТА 80591 Сержантова А.С. Начало: 07.02.2024 - если в ТЧ по последней миле уже есть строки с ключом, то берем их, если их не использовали ранее
			// Было:
			//Ответ = СоздатьКлючАналитики(Объект.Ссылка);
			//ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
			//ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;  
			////Стало:
			Если Объект.ТранспортныеСредстваПоследняяМиля.Количество() 
                // ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
				или Объект.СоставУслуги.Количество() Тогда 
				//КлючИзПоследнейМили = Неопределено;   - переименовала "КлючИзПоследнейМили" на "КлючДляПодбора"
				КлючДляПодбора = Неопределено;
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024 
				СтрокиПоследнейМилиДляПодбора = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(
													Новый Структура("ИдентификаторСтрокиЗапроса", ТекущаяСтрока.ИдентификаторСтрокиЗапроса));
				Для каждого СтрокаПоследнейМили Из СтрокиПоследнейМилиДляПодбора Цикл   
					СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки, ИдентификаторСтрокиЗапроса", 
										СтрокаПоследнейМили.КлючАналитикиПеревозки, СтрокаПоследнейМили.ИдентификаторСтрокиЗапроса);
					СтрокиПоКлючуВПервойМиле = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоКлючуВПервойМиле.Количество() = 0 Тогда
						КлючДляПодбора = СтрокаПоследнейМили.КлючАналитикиПеревозки;    
						ТекущаяСтрока.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(КлючДляПодбора, "ВерсияДанных"); 
						ТекущаяСтрока.КлючАналитикиПеревозки = КлючДляПодбора;
						Прервать;
					КонецЕсли;	
				КонецЦикла; 
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024 - Если не подобрали из последней мили, попробуем найти из услуг 
				Если КлючДляПодбора = Неопределено Тогда
					СписокКонтейнеров = ПолучитьСписокКткИзЗапросаКТКПоПереданнойСтроке(ТекущиеДанныеЗапроса.НомерСтроки); 
					КлючиИзСоставаУслуг = ПолучитьКлючиАналитикиПоКонтейнерамИзУслуг(СписокКонтейнеров);    
					Для каждого КлючСоставаУслуг Из КлючиИзСоставаУслуг Цикл   
						СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки, ИдентификаторСтрокиЗапроса", 
						КлючСоставаУслуг, ТекущаяСтрока.ИдентификаторСтрокиЗапроса);
						СтрокиПоКлючуВПервойМиле = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураПоиска);
						Если СтрокиПоКлючуВПервойМиле.Количество() = 0 Тогда
							КлючДляПодбора = КлючСоставаУслуг;    
							ТекущаяСтрока.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(КлючДляПодбора, "ВерсияДанных"); 
							ТекущаяСтрока.КлючАналитикиПеревозки = КлючДляПодбора;
							Прервать;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
				Если КлючДляПодбора = Неопределено Тогда
					Ответ = СоздатьКлючАналитики(Объект.Ссылка);  
					ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
					ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
				КонецЕсли;
			Иначе	
				Ответ = СоздатьКлючАналитики(Объект.Ссылка);
				ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
				ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
			КонецЕсли;
			//// ДИТ US 78243 ТА 80591 Сержантова А.С. Конец: 07.02.2024
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец    
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024
		СтрУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекущаяСтрока.КлючАналитикиПеревозки)); 
		Если СтрУслуг.Количество() > 0 Тогда
			СтрУслуг[0].ФИОВодителя = ТекущаяСтрока.ФИОВодителя;
			СтрУслуг[0].НомерАвто = ТекущаяСтрока.РегНомерТС;
			СтрУслуг[0].АвтоперевозчикПерваяМиля = ТекущаяСтрока.Автоперевозчик;
		КонецЕсли;
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущиеДанныеЗапроса = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
		ТекущаяСтрока.ИдентификаторСтрокиЗапроса = ТекущиеДанныеЗапроса.ИдентификаторСтроки;
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
		//ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		Если ЗначениеЗаполнено(ТекущиеДанныеЗапроса.РелизКлиента) Тогда
			МассивКлючей = Новый Массив;
			Для Каждого Стр Из Объект.ТранспортныеСредстваПоследняяМиля Цикл
				МассивКлючей.Добавить(Стр.КлючАналитикиПеревозки);
			КонецЦикла;	
			СтруктураОтвет = ПолучитьКлючиИзРелизаКлиента(ТекущиеДанныеЗапроса.РелизКлиента,МассивКлючей,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"));
			
			Если СтруктураОтвет.ПустойКлюч Тогда
				Ответ = СоздатьКлючАналитики(Объект.Ссылка);
				ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
				ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
			Иначе
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока,СтруктураОтвет.КлючРелиза[0]);
			КонецЕсли;	
		Иначе
			// ДИТ US 78243 ТА 80591 Сержантова А.С. Начало: 07.02.2024 - если в ТЧ по первой миле уже есть строки с ключом, то берем их, если их не использовали ранее
			// Было:
			//Ответ = СоздатьКлючАналитики(Объект.Ссылка);
			//ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
			//ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки; 
			// Стало:
			Если Объект.ТранспортныеСредства.Количество() 
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
				или Объект.СоставУслуги.Количество() Тогда 
				//КлючИзПервойМили = Неопределено;   - переименовала "КлючИзПервойМили" на "КлючДляПодбора"
				КлючДляПодбора = Неопределено;
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024 
				СтрокиПервойМилиДляПодбора = Объект.ТранспортныеСредства.НайтиСтроки(
													Новый Структура("ИдентификаторСтрокиЗапроса", ТекущаяСтрока.ИдентификаторСтрокиЗапроса));
				Для каждого СтрокаПервойМили Из СтрокиПервойМилиДляПодбора Цикл   
					СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки, ИдентификаторСтрокиЗапроса",
										СтрокаПервойМили.КлючАналитикиПеревозки, СтрокаПервойМили.ИдентификаторСтрокиЗапроса);
					СтрокиПоКлючуВПоследнейМиле = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоКлючуВПоследнейМиле.Количество() = 0 Тогда
						КлючДляПодбора = СтрокаПервойМили.КлючАналитикиПеревозки;    
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
						//ТекущаяСтрока.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(КлючДляПодбора, "ВерсияДанных"); 
						РеквизитыКлюча = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(КлючДляПодбора, "ВерсияДанных, Контейнер");
						ТекущаяСтрока.ВерсияКлюча = РеквизитыКлюча.ВерсияДанных; 
						ТекущаяСтрока.Контейнер = РеквизитыКлюча.Контейнер;
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024 
						ТекущаяСтрока.КлючАналитикиПеревозки = КлючДляПодбора;
						Прервать;
					КонецЕсли;	
				КонецЦикла;  
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024 - Если не подобрали из первой мили, попробуем найти из услуг
				Если КлючДляПодбора = Неопределено Тогда
					СписокКонтейнеров = ПолучитьСписокКткИзЗапросаКТКПоПереданнойСтроке(ТекущиеДанныеЗапроса.НомерСтроки); 
					КлючиИзСоставаУслуг = ПолучитьКлючиАналитикиПоКонтейнерамИзУслуг(СписокКонтейнеров);    
					Для каждого КлючСоставаУслуг Из КлючиИзСоставаУслуг Цикл   
						СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки, ИдентификаторСтрокиЗапроса", 
						КлючСоставаУслуг, ТекущаяСтрока.ИдентификаторСтрокиЗапроса);
						СтрокиПоКлючуВПоследнейМиле = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(СтруктураПоиска);
						Если СтрокиПоКлючуВПоследнейМиле.Количество() = 0 Тогда
							КлючДляПодбора = КлючСоставаУслуг;    
							РеквизитыКлюча = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(КлючДляПодбора, "ВерсияДанных, Контейнер");
							ТекущаяСтрока.ВерсияКлюча = РеквизитыКлюча.ВерсияДанных; 
							ТекущаяСтрока.Контейнер = РеквизитыКлюча.Контейнер;
							ТекущаяСтрока.КлючАналитикиПеревозки = КлючДляПодбора;
							Прервать;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;
				// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
				Если КлючДляПодбора = Неопределено Тогда
					Ответ = СоздатьКлючАналитики(Объект.Ссылка);  
					ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
					ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
				КонецЕсли;
			Иначе	
				Ответ = СоздатьКлючАналитики(Объект.Ссылка);
				ТекущаяСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
				ТекущаяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
			КонецЕсли;
			// ДИТ US 78243 ТА 80591 Сержантова А.С. Конец: 07.02.2024
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец   
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024
		СтрУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекущаяСтрока.КлючАналитикиПеревозки)); 
		Если СтрУслуг.Количество() > 0 Тогда
			СтрУслуг[0].ФИОВодителяВыгрузка = ТекущаяСтрока.ФИОВодителя;
			СтрУслуг[0].НомерАвтоВыгрузка = ТекущаяСтрока.РегНомерТС;
            СтрУслуг[0].АвтоПеревозчик = ТекущаяСтрока.Автоперевозчик;
		КонецЕсли;
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024
	КонецЕсли;
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьЗаявкуСибур(Команда) //ДИТ Шевченко А.В. 57147 28.12.2022
	ВыполнитьПроверкиСибур();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзЗапросаНаКТК(Команда)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ВыполнитьЗаполнениеУслугПоЗапросуНаКТК("Заполнить");
	ВидимостьКолонокПринадлежности();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРелизКлиента(Команда)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	Если Объект.Ссылка.Пустая()
		ИЛИ НЕ Объект.Ссылка.Пустая() И Модифицированность = Истина Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаписиЗаявки", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Перед созданием релиза клиента заявка должна быть сохранена.
									|Сохранить заявку?", Режим, 0);
	Иначе
		ВыполнитьСозданиеРелизаКлиента();
	КонецЕсли;
	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВодителейИзExcel(Команда)
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
	ВставитьВодителейИзExcelКлиент("ТранспортныеСредства");
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
&НаКлиенте
Процедура ВставитьВодителейИзExcelПоследняяМиля(Команда)
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	ВставитьВодителейИзExcelКлиент("ТранспортныеСредстваПоследняяМиля");
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВодителейИзExcelКлиент(Миля)
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	ТекущиеДанне = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанне = Неопределено Тогда
		ПоказатьПредупреждение(, "Укажите строку запроса, для которой необходимо загрузить сведения о ТС");
		Возврат;
	КонецЕсли;	
	
	Если ТекущиеДанне.КоличествоКТК = 0 Тогда
		ПоказатьПредупреждение(, "Укажите количество КТК");
		Возврат;
	КонецЕсли;	
	
	ТранспортныеСредстваСтроки = Объект[Миля].НайтиСтроки(Новый Структура("ИдентификаторСтрокиЗапроса", ТекущиеДанне.ИдентификаторСтроки));
	ДоступноеКоличество = ТекущиеДанне.КоличествоКТК - ТранспортныеСредстваСтроки.Количество();
    //ДИТ Шевченко А.В. 58552 05.10.2022 -начало
	//Если ДоступноеКоличество <= 0 Тогда
	//	ПоказатьПредупреждение(, "Для указанной строки запроса уже заполнено
	//							|необходимо количество транспортных средств.");
	//	Возврат;
	//КонецЕсли;	
	//ДИТ Шевченко А.В. 58552 05.10.2022 -конец
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("КоличествоСтрок", ДоступноеКоличество);
	ПараметрыЧтения.Вставить("ИдентификаторСтроки", ТекущиеДанне.ИдентификаторСтроки);
	
	ОповещениеЧтениеТранспортныхСредств = Новый ОписаниеОповещения("РезультатЧтенияТранспортныхСредств", ЭтаФорма,Новый Структура("Миля",Миля));
	ОткрытьФорму("Документ.Заявка.Форма.ДобавлениеТранспортныхСредств", ПараметрыЧтения,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеЧтениеТранспортныхСредств, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    // Евросиб Фролов)	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗапросНаАвтоперевозку(Команда)
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(ЗапросПерваяМиля) Тогда
		ПараметрыФ = Новый Структура;
		ПараметрыФ.Вставить("Ключ",ЗапросПерваяМиля);
		ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента",ПараметрыФ,ЭтаФорма);
	Иначе
		//Создание нового	
		
		НетВариантов = ПроверитьНаличиеВариантовАвтоперевозкиЕвросибом("Автоперевозка","ПерваяМиля");
		Если НетВариантов Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Создание запроса на автоперевозку невозможно по причине отсутствия в заявке данных для заполнения",,,,Отказ)
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	
		Если Объект.Ссылка.Пустая()
			ИЛИ НЕ Объект.Ссылка.Пустая() И Модифицированность = Истина ИЛИ НЕ Объект.Проведен Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПроведениЗаявки", ЭтотОбъект, Новый Структура("ЭтапПеревозки",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля")));
			ПоказатьВопрос(Оповещение, "Перед созданием заказ на автоперевозку заявка должна быть проведена.
			|Провести заявку?", Режим, 0);
		Иначе
			Если Не Отказ Тогда
				ОткрытьФормуНовогоЗаказаНаАвтоперевозку(ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаАвтоперевозкуПоследняяМиля(Команда)
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(ЗапросПоследняяМиля) Тогда
		ПараметрыФ = Новый Структура;
		ПараметрыФ.Вставить("Ключ",ЗапросПоследняяМиля);
		ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента",ПараметрыФ,ЭтаФорма);
	Иначе
		//Создание нового	
		
		НетВариантов = ПроверитьНаличиеВариантовАвтоперевозкиЕвросибом("ПоследняяМиля","ПоследняяМиля");
		Если НетВариантов Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Создание запроса на автоперевозку невозможно по причине отсутствия в заявке данных для заполнения",,,,Отказ)
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	
		Если Объект.Ссылка.Пустая()
			ИЛИ НЕ Объект.Ссылка.Пустая() И Модифицированность = Истина ИЛИ НЕ Объект.Проведен Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПроведениЗаявки", ЭтотОбъект, Новый Структура("ЭтапПеревозки",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля")));
			ПоказатьВопрос(Оповещение, "Перед созданием заказ на автоперевозку заявка должна быть проведена.
			|Провести заявку?", Режим, 0);
		Иначе
			Если Не Отказ Тогда
				ОткрытьФормуНовогоЗаказаНаАвтоперевозку(ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// Процедура - Открыть форму нового заказа на автоперевозку
//
// Параметры:
//  ПерваяМиля	 - Булево - Если Истина первая миля, если Ложь последняя миля
//
&НаКлиенте
Процедура ОткрытьФормуНовогоЗаказаНаАвтоперевозку(ЭтапПеревозкиП)
	
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024 
	//для первой мили проверяем есть ли строки, которые имеют значение "Силами Евросиб" в способе автоперевозки 
	//И имеют принадлежность = "КТК Евросиб" И имеют не заполненное поле "Релиз" ссылкой на документ релиз клиента
	Если ЭтапПеревозкиП = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля") Тогда
		НомераСтрокБезРелиза = ОпределитьСтрокиПоУсловиюПустогоРелиза(); 
		Если НомераСтрокБезРелиза.Количество() > 0 Тогда
			ПараметрыВопроса = Новый Структура("ЭтапПеревозки",ЭтапПеревозкиП);
		    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСоставеСтрокВЗаявкеНаАвто", ЭтотОбъект, ПараметрыВопроса);
			Если НомераСтрокБезРелиза.Количество() = 1 Тогда
				ТекстВопроса = СтрШаблон("Строка №%1 в заявке не связана с релизом клиента.
				|Продолжить перенос таких строк в запрос на автоперевозку?", НомераСтрокБезРелиза[0]);
			Иначе
			    ТекстВопроса = СтрШаблон("Строки №%1 в заявке не связаны с релизом клиента.
				|Продолжить перенос таких строк в запрос на автоперевозку?", СтрСоединить(НомераСтрокБезРелиза, ", "));
			КонецЕсли;                        
			КнопкиОтветов = Новый СписокЗначений;
			КнопкиОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			КнопкиОтветов.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			ПоказатьВопрос(Оповещение, ТекстВопроса, КнопкиОтветов, 0); 
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СоздатьНаОснованииЗаявки",Объект.Ссылка);
			ПараметрыФормы.Вставить("ЭтапПеревозки",ЭтапПеревозкиП);
			ПараметрыФормы.Вставить("ПростойАлгоритмЗаполнения", Ложь);
			ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
		КонецЕсли;
	Иначе
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СоздатьНаОснованииЗаявки",Объект.Ссылка);
		ПараметрыФормы.Вставить("ЭтапПеревозки",ЭтапПеревозкиП);
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024
		// Было:
		////ДИТ Шевченко А.В. 57808 22.09.2022 -начало
		//ПараметрыФормы.Вставить("ПростойАлгоритмЗаполнения",ЭтапПеревозкиП = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля") и НЕ ЗначениеЗаполнено(ЗапросПерваяМиля));
		////ДИТ Шевченко А.В. 57808 22.09.2022 -конец  
		//Стало:
		ПараметрыФормы.Вставить("ПростойАлгоритмЗаполнения",ЭтапПеревозкиП = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"));
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
		ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);    
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024
	КонецЕсли; 
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
	
КонецПроцедуры	  

// ДИТ US 78243 ТА 80825 Сержантова А.С. 08.02.2024
&НаСервере
Функция ОпределитьСтрокиПоУсловиюПустогоРелиза()
	
	Результат = Новый Массив;
	ТаблицаДляПроверки = Объект.СоставУслуги.Выгрузить(,"НомерСтроки, ПерваяМиля, ПринадлежностьТЕ, Релиз");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставУслуги.НомерСтроки КАК НомерСтроки,
		|	СоставУслуги.ПерваяМиля КАК ПерваяМиля,
		|	СоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	СоставУслуги.Релиз КАК Релиз
		|ПОМЕСТИТЬ ВТ_ИсходныеДанные
		|ИЗ
		|	&СоставУслуги КАК СоставУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ различные
		|	ВТ_ИсходныеДанные.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|ГДЕ
		|	ВТ_ИсходныеДанные.ПерваяМиля = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)
		|	И ВТ_ИсходныеДанные.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
		|	И ВТ_ИсходныеДанные.Релиз В (ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.РелизСобственника.ПустаяСсылка), Неопределено)";
	Запрос.УстановитьПараметр("СоставУслуги", ТаблицаДляПроверки); 
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.НомерСтроки);			
		КонецЦикла;
	КонецЕсли;   
	
	Возврат Результат;

КонецФункции

// ДИТ US 78243 ТА 80825 Сержантова А.С. 08.02.2024
&НаКлиенте
Процедура ПослеЗакрытияВопросаОСоставеСтрокВЗаявкеНаАвто(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СоздатьНаОснованииЗаявки",Объект.Ссылка);
	ПараметрыФормы.Вставить("ЭтапПеревозки",ДополнительныеПараметры.ЭтапПеревозки);
	ПараметрыФормы.Вставить("ПростойАлгоритмЗаполнения", Ложь);   
	ПараметрыФормы.Вставить("ДобавлятьСтрокиБезРелиза", Истина);
	ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Конец

&НаКлиенте
Процедура ДозаполнитьИзЗапросаНаКТК(Команда)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ВыполнитьЗаполнениеУслугПоЗапросуНаКТК("Дозаполнить");
	ВидимостьКолонокПринадлежности();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьИзЗапросаНаКТК(Команда)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	ВыполнитьЗаполнениеУслугПоЗапросуНаКТК("Перезаполнить");
	ВидимостьКолонокПринадлежности();
	// Евросиб Фролов)
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПроверкиСибур() //ДИТ Шевченко А.В. 57147 28.12.2022
	
	СтруктураОшибокУслуги = ОбработатьТЧУслугиПроверкаСибур();
	
	ЕстьОшибки = Ложь;
	
	Если СтруктураОшибокУслуги.НеЗаполненНомерКТКНомераСтрок.Количество() > 0 Тогда
		ТекстСообщения = "В строке %1 вкладки «Услуги» не заполнен номер КТК";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокУслуги.НеЗаполненНомерКТКНомераСтрок,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если СтруктураОшибокУслуги.НеЗаполненВладелецКТКНомераСтрок.Количество() > 0 Тогда
		ТекстСообщения = "В строке %1 вкладки «Услуги» не заполнен владелец КТК";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокУслуги.НеЗаполненВладелецКТКНомераСтрок,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если СтруктураОшибокУслуги.НерезидентыБезВнешнегоКода.Количество() > 0 Тогда
		ТекстСообщения = "Необходимо в Бит Финансе для нерезидента %1 заполнить «Внешний код нерезидента»";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокУслуги.НерезидентыБезВнешнегоКода,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если СтруктураОшибокУслуги.РезидентыБезКодаПоОКПО.Количество() > 0 Тогда
		ТекстСообщения = "Необходимо в Бит Финансе для резидента %1 заполнить «Код по ОКПО»";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокУслуги.РезидентыБезКодаПоОКПО,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 22.03.2023
	Если СтруктураОшибокУслуги.НеЗаполненКодКонтрагентаСибур.Количество() Тогда 
		ТекстСообщения = "Необходимо для контрагентов %1 заполнить «КодКонтрагентаСибур»";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокУслуги.НеЗаполненКодКонтрагентаСибур,",")),,,,ЕстьОшибки);
	КонецЕсли;	
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 22.03.2023
	
	СтруктураОшибокДислокацииКонтейнеров = ПолучитьВагоныПоДислокацииКонтейнеров(Объект.СоставУслуги);
	
	Если СтруктураОшибокДислокацииКонтейнеров.МассивКТКБезВагонов.Количество() > 0 Тогда
		ТекстСообщения = "Для КТК %1 не найдены номера вагонов по Дислокации контейнеров.  Необходимо проверить правильность заполнения номеров КТК в заявке и обратиться в ТП для проверки Дислокации контейнеров";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокДислокацииКонтейнеров.МассивКТКБезВагонов,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если СтруктураОшибокДислокацииКонтейнеров.МассивВыгоновБезСобственника.Количество() > 0 Тогда
		ТекстСообщения = "Необходимо в ИРС заполнить собственника вагона для вагонов %1";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокДислокацииКонтейнеров.МассивВыгоновБезСобственника,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если СтруктураОшибокДислокацииКонтейнеров.МассивСобственниковБезОКПО.Количество() > 0 Тогда
		ТекстСообщения = "В ИРС необходимо заполнить ОКПО собственников вагонов %1 в справочнике «Собственники/Арендаторы вагонов».";
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения,СтрСоединить(СтруктураОшибокДислокацииКонтейнеров.МассивСобственниковБезОКПО,",")),,,,ЕстьОшибки);
	КонецЕсли;
	
	Если НЕ ЕстьОшибки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Все обязательные реквизиты в заявке заполнены");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВагоныПоДислокацииКонтейнеров(Знач СоставУслуги) //ДИТ Шевченко А.В. 57147 28.12.2022

	СписокКонтейнеров 			 = СоставУслуги.Выгрузить(,"НомерКТК");
	ТЗ 				  			 = СоставУслуги.Выгрузить(,"НомерКТК,СтанцияНазначения,СтанцияОтправления");
	МассивКТКБезВагонов 		 = Новый Массив;
	МассивВыгоновБезСобственника = Новый Массив;
	МассивСобственниковБезОКПО 	 = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НомерКТК КАК НомерКТК,
		|	ТЗ.СтанцияНазначения КАК СтанцияНазначения,
		|	ТЗ.СтанцияОтправления КАК СтанцияОтправления
		|ПОМЕСТИТЬ ВТ_ТЧУслуги
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧУслуги.НомерКТК КАК НомерКТК,
		|	АналогиСтанцииПогрузкиКонтейнера.Аналог КАК АналогиСтанцииПогрузкиКонтейнера
		|ПОМЕСТИТЬ ВТ_ТЧУслугиИАналогиСтанцийПогрузки
		|ИЗ
		|	ВТ_ТЧУслуги КАК ВТ_ТЧУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиСтанцииПогрузкиКонтейнера
		|		ПО ВТ_ТЧУслуги.СтанцияОтправления = АналогиСтанцииПогрузкиКонтейнера.Локация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ТЧУслуги.НомерКТК,
		|	ВТ_ТЧУслуги.СтанцияОтправления
		|ИЗ
		|	ВТ_ТЧУслуги КАК ВТ_ТЧУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧУслуги.НомерКТК КАК НомерКТК,
		|	АналогиСтанцииНазначения.Аналог КАК АналогиСтанцииНазначения
		|ПОМЕСТИТЬ ВТ_ТЧУслугиИАналогиСтанцийНазначения
		|ИЗ
		|	ВТ_ТЧУслуги КАК ВТ_ТЧУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиСтанцииНазначения
		|		ПО ВТ_ТЧУслуги.СтанцияНазначения = АналогиСтанцииНазначения.Локация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ТЧУслуги.НомерКТК,
		|	ВТ_ТЧУслуги.СтанцияНазначения
		|ИЗ
		|	ВТ_ТЧУслуги КАК ВТ_ТЧУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧУслугиИАналогиСтанцийПогрузки.НомерКТК КАК НомерКТК,
		|	ВТ_ТЧУслугиИАналогиСтанцийПогрузки.АналогиСтанцииПогрузкиКонтейнера КАК АналогиСтанцииПогрузкиКонтейнера,
		|	ВТ_ТЧУслугиИАналогиСтанцийНазначения.АналогиСтанцииНазначения КАК АналогиСтанцииНазначения
		|ПОМЕСТИТЬ ВТ_УслугиИтог
		|ИЗ
		|	ВТ_ТЧУслугиИАналогиСтанцийПогрузки КАК ВТ_ТЧУслугиИАналогиСтанцийПогрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЧУслугиИАналогиСтанцийНазначения КАК ВТ_ТЧУслугиИАналогиСтанцийНазначения
		|		ПО ВТ_ТЧУслугиИАналогиСтанцийПогрузки.НомерКТК = ВТ_ТЧУслугиИАналогиСтанцийНазначения.НомерКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДислокацияКонтейнеровСрезПоследних.Контейнер КАК Контейнер,
		|	ДислокацияКонтейнеровСрезПоследних.СтанцияПогрузкиКонтейнера КАК СтанцияПогрузкиКонтейнера,
		|	ДислокацияКонтейнеровСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
		|	ДислокацияКонтейнеровСрезПоследних.Вагон КАК Вагон
		|ПОМЕСТИТЬ ВТ_СрезДислокацииКонтейнеров
		|ИЗ
		|	РегистрСведений.ДислокацияКонтейнеров.СрезПоследних(
		|			&Период,
		|			Контейнер В (&СписокКонтейнеров)
		|				И НЕ Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК ДислокацияКонтейнеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрезДислокацииКонтейнеров.Контейнер КАК Контейнер,
		|	АналогиСтанцииПогрузкиКонтейнера.Аналог КАК СтанцияПогрузкиКонтейнера,
		|	ВТ_СрезДислокацииКонтейнеров.Вагон КАК Вагон
		|ПОМЕСТИТЬ ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки
		|ИЗ
		|	ВТ_СрезДислокацииКонтейнеров КАК ВТ_СрезДислокацииКонтейнеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиСтанцииПогрузкиКонтейнера
		|		ПО ВТ_СрезДислокацииКонтейнеров.СтанцияПогрузкиКонтейнера = АналогиСтанцииПогрузкиКонтейнера.Локация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_СрезДислокацииКонтейнеров.Контейнер,
		|	ВТ_СрезДислокацииКонтейнеров.СтанцияПогрузкиКонтейнера,
		|	ВТ_СрезДислокацииКонтейнеров.Вагон
		|ИЗ
		|	ВТ_СрезДислокацииКонтейнеров КАК ВТ_СрезДислокацииКонтейнеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрезДислокацииКонтейнеров.Контейнер КАК Контейнер,
		|	АналогиСтанцииПогрузкиКонтейнера.Аналог КАК СтанцияНазначения,
		|	ВТ_СрезДислокацииКонтейнеров.Вагон КАК Вагон
		|ПОМЕСТИТЬ ВТ_СрезДислокацииКонтейнеровСтанцииНазначения
		|ИЗ
		|	ВТ_СрезДислокацииКонтейнеров КАК ВТ_СрезДислокацииКонтейнеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиСтанцииПогрузкиКонтейнера
		|		ПО ВТ_СрезДислокацииКонтейнеров.СтанцияНазначения = АналогиСтанцииПогрузкиКонтейнера.Локация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_СрезДислокацииКонтейнеров.Контейнер,
		|	ВТ_СрезДислокацииКонтейнеров.СтанцияНазначения,
		|	ВТ_СрезДислокацииКонтейнеров.Вагон
		|ИЗ
		|	ВТ_СрезДислокацииКонтейнеров КАК ВТ_СрезДислокацииКонтейнеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки.Контейнер КАК Контейнер,
		|	ЕСТЬNULL(ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК Вагон,
		|	ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки.СтанцияПогрузкиКонтейнера КАК СтанцияПогрузкиКонтейнера,
		|	ВТ_СрезДислокацииКонтейнеровСтанцииНазначения.СтанцияНазначения КАК СтанцияНазначения
		|ПОМЕСТИТЬ ВТ_СрезДислокацииКонтейнеровИтог
		|ИЗ
		|	ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки КАК ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезДислокацииКонтейнеровСтанцииНазначения КАК ВТ_СрезДислокацииКонтейнеровСтанцииНазначения
		|		ПО ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки.Контейнер = ВТ_СрезДислокацииКонтейнеровСтанцииНазначения.Контейнер
		|			И ВТ_СрезДислокацииКонтейнеровСтанцииПогрузки.Вагон = ВТ_СрезДислокацииКонтейнеровСтанцииНазначения.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УслугиИтог.НомерКТК КАК НомерКТК,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_СрезДислокацииКонтейнеровИтог.Вагон, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))) КАК Вагон
		|ПОМЕСТИТЬ ВТ_КонтейнерВагон
		|ИЗ
		|	ВТ_УслугиИтог КАК ВТ_УслугиИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезДислокацииКонтейнеровИтог КАК ВТ_СрезДислокацииКонтейнеровИтог
		|		ПО ВТ_УслугиИтог.АналогиСтанцииПогрузкиКонтейнера = ВТ_СрезДислокацииКонтейнеровИтог.СтанцияПогрузкиКонтейнера
		|			И ВТ_УслугиИтог.АналогиСтанцииНазначения = ВТ_СрезДислокацииКонтейнеровИтог.СтанцияНазначения
		|			И ВТ_УслугиИтог.НомерКТК = ВТ_СрезДислокацииКонтейнеровИтог.Контейнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_УслугиИтог.НомерКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтейнерВагон.НомерКТК КАК НомерКТК,
		|	ВТ_КонтейнерВагон.Вагон КАК Вагон,
		|	ЕСТЬNULL(ПаспортаВагоновСрезПоследних.Собственник, ЗНАЧЕНИЕ(Справочник.э_СобственникиАрендаторыВагонов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.э_СобственникиАрендаторыВагонов.ПустаяСсылка) КАК СобственникЗаполнен,
		|	ЕСТЬNULL(ПаспортаВагоновСрезПоследних.Собственник.ОКПО, """") <> """" КАК ОКПОЗаполнен,
		|	ЕСТЬNULL(ПаспортаВагоновСрезПоследних.Собственник, ЗНАЧЕНИЕ(Справочник.э_СобственникиАрендаторыВагонов.ПустаяСсылка)) КАК Собственник
		|ИЗ
		|	ВТ_КонтейнерВагон КАК ВТ_КонтейнерВагон
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
		|		ПО ВТ_КонтейнерВагон.Вагон = ПаспортаВагоновСрезПоследних.Вагон";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокКонтейнеров", СписокКонтейнеров);
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивКТКБезВагонов 		 = Новый Массив;
	МассивВыгоновБезСобственника = Новый Массив;
	МассивСобственниковБезОКПО 	 = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Вагон) Тогда
			Если НЕ ВыборкаДетальныеЗаписи.СобственникЗаполнен Тогда
				Если МассивВыгоновБезСобственника.Найти(ВыборкаДетальныеЗаписи.Вагон) = Неопределено Тогда
					МассивВыгоновБезСобственника.Добавить(ВыборкаДетальныеЗаписи.Вагон);
				КонецЕсли;
			ИначеЕсли ВыборкаДетальныеЗаписи.СобственникЗаполнен И НЕ ВыборкаДетальныеЗаписи.ОКПОЗаполнен Тогда
				Если МассивСобственниковБезОКПО.Найти(ВыборкаДетальныеЗаписи.Собственник) = Неопределено Тогда
					МассивСобственниковБезОКПО.Добавить(ВыборкаДетальныеЗаписи.Собственник);
				КонецЕсли;
			КонецЕсли;	
		Иначе
			МассивКТКБезВагонов.Добавить(ВыборкаДетальныеЗаписи.НомерКТК);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураОтвет = Новый Структура("МассивКТКБезВагонов,МассивВыгоновБезСобственника,МассивСобственниковБезОКПО",МассивКТКБезВагонов,МассивВыгоновБезСобственника,МассивСобственниковБезОКПО);
	
	Возврат СтруктураОтвет;
	
КонецФункции	

&НаКлиенте
Функция ОбработатьТЧУслугиПроверкаСибур() //ДИТ Шевченко А.В. 57147 28.12.2022
	
	НеЗаполненНомерКТКНомераСтрок 	 		 = Новый Массив;
	НеЗаполненВладелецКТКНомераСтрок 		 = Новый Массив;
	НерезидентыБезВнешнегоКода 	 			 = Новый Массив;
	РезидентыБезКодаПоОКПО 	 	 			 = Новый Массив;
	МассивВладелцевКТК				         = Новый Массив;
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 21.03.2023
	НеЗаполненКодКонтрагентаСибур			 = Новый Массив;
	ПроверкаКодКонтрагентаСибур(НеЗаполненКодКонтрагентаСибур);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 21.03.2023
	
	
	Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерКТК) Тогда
			НеЗаполненНомерКТКНомераСтрок.Добавить(СтрокаТЧ.НомерСтроки);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВладелецКТК) Тогда
			НеЗаполненВладелецКТКНомераСтрок.Добавить(СтрокаТЧ.НомерСтроки);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.ВладелецКТК) Тогда
			МассивВладелцевКТК.Добавить(СтрокаТЧ.ВладелецКТК);
		КонецЕсли	
	КонецЦикла;	
	
	Если МассивВладелцевКТК.Количество() > 0 Тогда
		ПолучитьРезидентовИНеРезидентовБезКодов(МассивВладелцевКТК,НерезидентыБезВнешнегоКода,РезидентыБезКодаПоОКПО);
	КонецЕсли;	
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("НеЗаполненНомерКТКНомераСтрок"			,НеЗаполненНомерКТКНомераСтрок);
	СтруктураОтвет.Вставить("НеЗаполненВладелецКТКНомераСтрок"		,НеЗаполненВладелецКТКНомераСтрок);
	СтруктураОтвет.Вставить("НерезидентыБезВнешнегоКода" 			,НерезидентыБезВнешнегоКода);
	СтруктураОтвет.Вставить("РезидентыБезКодаПоОКПО"				,РезидентыБезКодаПоОКПО);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 22.03.2023
	СтруктураОтвет.Вставить("НеЗаполненКодКонтрагентаСибур"			,НеЗаполненКодКонтрагентаСибур);
	// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 22.03.2023
	
	Возврат СтруктураОтвет; 
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ПолучитьРезидентовИНеРезидентовБезКодов(МассивВладелцевКТК,НерезидентыБезВнешнегоКода,РезидентыБезКодаПоОКПО) //ДИТ Шевченко А.В. 57147 28.12.2022
	
	РезидентыБезКодов 	= Новый Массив;
	НеРезидентыБезКодов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|	И Контрагенты.ВнешнийКодНерезидента = """"
		|	И Контрагенты.Ссылка В (&МассивВладелцевКТК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|	И Контрагенты.КодПоОКПО = """"
		|	И Контрагенты.Ссылка В (&МассивВладелцевКТК)";
	
	Запрос.УстановитьПараметр("МассивВладелцевКТК",МассивВладелцевКТК);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНеРезиденты = РезультатЗапроса[0].Выбрать();
	ВыборкаРезиденты = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаНеРезиденты.Следующий() Цикл
		НерезидентыБезВнешнегоКода.Добавить(ВыборкаНеРезиденты.Контрагент);
	КонецЦикла;
	
	Пока ВыборкаРезиденты.Следующий() Цикл
		РезидентыБезКодаПоОКПО.Добавить(ВыборкаРезиденты.Контрагент);
	КонецЦикла;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаСибур()
	
	Возврат Константы.СибурКонтрагент.Получить();
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьСсылкаНаЗапросыАвтоперевозки()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозку.ЭтапПеревозки КАК ЭтапПеревозки,
		|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросНаАвтоперевозку
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Заявка = &Заявка
		|	И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросНаАвтоперевозку.Дата";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗапросПерваяМиля 	= Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
	//Евросиб Коханенко Н.А. 07.08.2024 (( #87840 
	ЗапросСредняяМиля 	= Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
	//Евросиб Коханенко Н.А. 07.08.2024 )) #87840 
	ЗапросПоследняяМиля = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
			ЗапросПерваяМиля 	= ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		//Евросиб Коханенко Н.А. 07.08.2024 (( #87840 
		ИначеЕсли ВыборкаДетальныеЗаписи.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
			ЗапросСредняяМиля 	= ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		//Евросиб Коханенко Н.А. 07.08.2024 )) #87840 
		Иначе
			ЗапросПоследняяМиля = ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		КонецЕсли	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаписиЗаявки(Результат, Параметры) Экспорт
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Попытка
		ЭтаФорма.Записать();
	Исключение
		ПоказатьПредупреждение(, "Не удалось записать документ");
		Возврат;
	КонецПопытки;
	
	ВыполнитьСозданиеРелизаКлиента();
    // Евросиб Фролов)
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Начало
&НаКлиенте
Процедура ПослеЗакрытияВопросаОПроведениЗаявки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Попытка
		ЭтаФорма.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПоказатьПредупреждение(, "Не удалось провести документ");
		Возврат;
	КонецПопытки;
	ОткрытьФормуНовогоЗаказаНаАвтоперевозку(Параметры.ЭтапПеревозки);
КонецПроцедуры 
//ДИТ Шевченко А.В. TASK 51973 07.06.2022 -Конец

&НаКлиенте
Процедура ВыполнитьСозданиеРелизаКлиента()
    // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Укажите строку, по данным которой
								|необходимо создать релиз клиента.");
		Возврат;
	КонецЕсли;
	
	//ДИТ Шевченко А.В. 59986 12.12.2022 -Начало	
	ДоговорДействует = Истина;
		
	Если ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Отправка) и НЕ ЗначениеЗаполнено(Объект.Прибытие) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,Объект.Отправка,Дата(1,1,1),Истина);
	ИначеЕсли ЗначениеЗаполнено(Объект.Договор) И НЕ ЗначениеЗаполнено(Объект.Отправка) и ЗначениеЗаполнено(Объект.Прибытие) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,Объект.Прибытие,Дата(1,1,1),Истина);
	ИначеЕсли ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Отправка) И ЗначениеЗаполнено(Объект.Прибытие) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,Объект.Отправка,Объект.Прибытие);
	ИначеЕсли ЗначениеЗаполнено(Объект.Договор) И НЕ ЗначениеЗаполнено(Объект.Отправка) И НЕ ЗначениеЗаполнено(Объект.Прибытие) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,Объект.Дата,Дата(1,1,1),Истина);	
	КонецЕсли;
	
	Если НЕ ДоговорДействует Тогда
		Автопролонгация = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Договор,"Автопролонгация");
		Если Автопролонгация Тогда
			СообщениеТекст = "Документ не может быть создан. Договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
			ДобавитЗадачуНаПролонгациюДоговора(Объект.Договор); //ДИТ Шевченко А.В. 65173 09.02.2023
		Иначе
			СообщениеТекст = "Документ не может быть создан. Срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеТекст,,,,);
		Возврат;
	КонецЕсли;				
    //ДИТ Шевченко А.В. 59986 12.12.2022 -Конец
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Заявка", 					Объект.Ссылка);
	ДанныеЗаполнения.Вставить("ОбщееКоличествоКТКВРелизе", 	ТекущиеДанные.КоличествоКТК);
	ДанныеЗаполнения.Вставить("ТипоразмерКТК", 				ТекущиеДанные.ТипКТК);
	ДанныеЗаполнения.Вставить("ЛокацияВыдачи", 				ТекущиеДанные.ЛокацияВыдачи);
	ДанныеЗаполнения.Вставить("ЛокацияСдачи", 				ТекущиеДанные.ЛокацияСдачи);
	ДанныеЗаполнения.Вставить("ДействиеРелизаНачало", 		ТекущиеДанные.ДействиеРелизаНачало);
	ДанныеЗаполнения.Вставить("ДействиеРелизаОкончание", 	ТекущиеДанные.ДействиеРелизаОкончание);
	ДанныеЗаполнения.Вставить("Автоперевозка", 				ТекущиеДанные.Автоперевозка);
	//ДИТ Шевченко А.В. 59364 06.03.2023 -начало
	ДанныеЗаполнения.Вставить("АвтоперевозкаПоследняяМиля", ТекущиеДанные.ПоследняяМиля); 
	//ДИТ Шевченко А.В. 59364 06.03.2023 -конец
	ДанныеЗаполнения.Вставить("СрокИспользованияКТК", 		ТекущиеДанные.СрокИспользованияКТК);
	ДанныеЗаполнения.Вставить("Ставка", 					ТекущиеДанные.Ставка);
	ДанныеЗаполнения.Вставить("СНП", 						ТекущиеДанные.СНП);
	ДанныеЗаполнения.Вставить("Валюта", 					ТекущиеДанные.ВалютаПоДоговору);
	//ДИТ Шевченко А.В. US 62421 TA 64347 21.02.2023 -начало
	ДанныеЗаполнения.Вставить("ИдентификаторСтроки",		ТекущиеДанные.ИдентификаторСтроки);
	//ДИТ Шевченко А.В. US 62421 TA 64347 21.02.2023 -конец
	ДанныеЗаполнения.Вставить("ТранспортныеСредства", 		ПолучитьТаблицуДляПереноса("ТранспортныеСредства", ТекущиеДанные.ИдентификаторСтроки));
	//ДИТ Шевченко А.В. 59364 13.03.2023 -начало
	ДанныеЗаполнения.Вставить("ТранспортныеСредстваПоследняяМиля", 		ПолучитьТаблицуДляПереноса("ТранспортныеСредстваПоследняяМиля", ТекущиеДанные.ИдентификаторСтроки));
	//ДИТ Шевченко А.В. 59364 13.03.2023 -конец
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
	мСтруктураСтанцияДата = ПолучитьСтанциюНазначенияИДатуОтправления("СписокЗапросНаКТК", ТекущиеДанные.ИдентификаторСтроки);	
	ДанныеЗаполнения.Вставить("ДатаОтправленияПоЖДПлан",	мСтруктураСтанцияДата.ДатаОтправленияПоЖДПлан);
	ДанныеЗаполнения.Вставить("СтанцияНазначенияПоЖД",		мСтруктураСтанцияДата.СтанцияНазначенияПоЖД);
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
	
	//Субботин 77659 15.12.2023 Начало 
	МассивКтк = Новый Массив();
	МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(ТекущиеДанные.СписокКТК), ";", Ложь);
	Для Каждого ЭлемМассива Из МассивТЕ Цикл
		Если ТипЗнч(ЭлемМассива) = Тип("Строка") Тогда
			МассивКтк.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(ЭлемМассива)); 
		Иначе
			МассивКтк.Добавить(ЭлемМассива);
		КонецЕсли;
	КонецЦикла;	
	ДанныеЗаполнения.Вставить("МассивКТК", 					МассивКтк); 
	
	КлючиКТК = Новый Соответствие;
	Для Каждого СтрокаКТК Из МассивКтк Цикл 
		ПараметрыПоиска = Новый Структура("НомерКТК",СтрокаКТК);
		РезПоиска = Объект.СоставУслуги.НайтиСтроки(ПараметрыПоиска);
		Если РезПоиска.Количество()<> 0 Тогда 
			Для Каждого СтрокаРезультата Из РезПоиска Цикл
				КлючиКТК.Вставить(СтрокаРезультата.НомерКТК, СтрокаРезультата.КлючАналитикиПеревозки);
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;		
			
	ДанныеЗаполнения.Вставить("СоответствиеКлючейАналитики", КлючиКТК);	
	//Субботин 77659 15.12.2023 Конец
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", 		 ДанныеЗаполнения);
	ПараметрыФормы.Вставить("ИдентификаторСтрокиЗаявки", ТекущиеДанные.ИдентификаторСтроки);
	ПараметрыФормы.Вставить("СозданиеРелизаИзЗаявки", 	 Истина);
		
	ОткрытьФорму("Документ.РелизКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 
	// Евросиб Фролов)
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ДобавитЗадачуНаПролонгациюДоговора(Договор) //ДИТ Шевченко А.В. 65173 09.02.2023
	
	ДоговорОбъект = Договор.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
	МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор",				Договор);
	СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
	СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
	мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
	Если ЗначениеЗаполнено(мОтветственныйЗаСопровождение) Тогда
		Если МассивСтрок.Количество() = 0 Тогда
			НСтр = ДоговорОбъект.Состояния.Добавить();
			НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
			НСтр.Исполнитель = мОтветственныйЗаСопровождение;
			НСтр.Наблюдатель = мОтветственныйЗаСопровождение;
			НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НСтр.НормативИсполненияСМоментаСоздания = 2;
		Иначе
			Если МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
				МассивСтрок[0].Исполнитель = мОтветственныйЗаСопровождение;
				МассивСтрок[0].Наблюдатель = мОтветственныйЗаСопровождение;
				МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			ДоговорОбъект.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Создание задачи на пролонгацию договора");
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтанциюНазначенияИДатуОтправления(ИмяТаблицы,ИдентификаторСтроки);
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ТаблицаОбъекта = Объект[ИмяТаблицы].Выгрузить(ПараметрыОтбора);
	МассивСтрок = ТаблицаОбъекта.НайтиСтроки(ПараметрыОтбора);
	Структура = Новый Структура("ДатаОтправленияПоЖДПлан,СтанцияНазначенияПоЖД");
	Если МассивСтрок.Количество() > 0 Тогда 
		ЗаполнитьЗначенияСвойств(Структура,МассивСтрок[0]);
	КонецЕсли;	
	Возврат Структура;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
КонецФункции


&НаСервере
Функция ПолучитьТаблицуДляПереноса(ИмяТаблицы, ИдентификаторСтроки)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСтрокиЗапроса", ИдентификаторСтроки);
	
	ТаблицаДанных = Объект[ИмяТаблицы].Выгрузить(ПараметрыОтбора);
	
	Возврат Новый ХранилищеЗначения(ТаблицаДанных);
	// Евросиб Фролов)
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокиПодчиненныхТаблицы(ИмяТабличнойЧасти)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	МассивУдаляемыхСтрок = Новый Массив;
	
	Для Каждого ТекСтрока Из Объект[ИмяТабличнойЧасти] Цикл
		
		ИдентификаторСтрокиЗапроса = ТекСтрока.ИдентификаторСтрокиЗапроса;
		
		НайденныеСтроки = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтрокиЗапроса));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Если МассивУдаляемыхСтрок.Найти(ИдентификаторСтрокиЗапроса) = Неопределено Тогда
				МассивУдаляемыхСтрок.Добавить(ИдентификаторСтрокиЗапроса);
			КонецЕсли;		
		КонецЕсли;	
		
	КонецЦикла;	
	
	Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		
		Индекс = Объект[ИмяТабличнойЧасти].Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если Объект[ИмяТабличнойЧасти][Индекс].ИдентификаторСтрокиЗапроса = УдаляемаяСтрока Тогда
				Объект[ИмяТабличнойЧасти].Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
	КонецЦикла;
	// Евросиб Фролов)	
КонецПроцедуры	

&НаКлиенте
Процедура РезультатЧтенияТранспортныхСредств(ДанныеДляЗагрузки, ДополнительныеПараметры) Экспорт
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если ДанныеДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	Если ДополнительныеПараметры.Миля = "ТранспортныеСредстваПоследняяМиля" Тогда
		ЭтапПеревозки = "ПоследняяМиля";
	Иначе	
		ЭтапПеревозки = "ПерваяМиля";
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	ИдентификаторСтроки = ДанныеДляЗагрузки.ИдентификаторСтроки;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторСтроки",ИдентификаторСтроки);
	МассивСтрок = Объект.СписокЗапросНаКТК.НайтиСтроки(СтруктураОтбора);
	СтруктураОтвет = Неопределено;
	МассивКлючей = Новый Массив;
	Если ЗначениеЗаполнено(МассивСтрок[0].РелизКлиента) Тогда
		Для Каждого Стр Из Объект.ТранспортныеСредства Цикл
			МассивКлючей.Добавить(Стр.КлючАналитикиПеревозки);
		КонецЦикла;	
		СтруктураОтвет = ПолучитьКлючиИзРелизаКлиента(МассивСтрок[0].РелизКлиента,МассивКлючей,ПредопределенноеЗначение(СтрШаблон("Перечисление.ЭтапыПеревозки.%1",ЭтапПеревозки)));	
	// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024 - пробуем искать ключи аналитики в составе услуг по номеру КТК
	Иначе
		СписокКонтейнеров = ПолучитьСписокКткИзЗапросаКТКПоПереданнойСтроке(МассивСтрок[0].НомерСтроки); 
		КлючиИзСоставаУслуг = ПолучитьКлючиАналитикиПоКонтейнерамИзУслуг(СписокКонтейнеров);    
		//Если по строке запроса на КТК уже добавлены строки, уберем эти ключи из вариантов подбора
		СтруктураПоискаПоМиле = Новый Структура("ИдентификаторСтрокиЗапроса", МассивСтрок[0].ИдентификаторСтроки);  
		СтрокиПоМиле = Объект[ДополнительныеПараметры.Миля].НайтиСтроки(СтруктураПоискаПоМиле);
		Для каждого СтрокаЭтапаПеревозки Из СтрокиПоМиле Цикл    
			ИндексЗначения = КлючиИзСоставаУслуг.Найти(СтрокаЭтапаПеревозки.КлючАналитикиПеревозки); 
			Если ЗначениеЗаполнено(СтрокаЭтапаПеревозки.КлючАналитикиПеревозки)
				и ИндексЗначения <> Неопределено Тогда
			    КлючиИзСоставаУслуг.Удалить(ИндексЗначения);
			КонецЕсли;	
		КонецЦикла;
	// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024	
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	МассивСведений = ДанныеДляЗагрузки.Результат;
	инд = 0;
	Для Каждого ТекущаяЗапись Из МассивСведений Цикл
		НоваяСтрока = Объект[ДополнительныеПараметры.Миля].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
		НоваяСтрока.ИдентификаторСтрокиЗапроса = ИдентификаторСтроки;
		//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
		СтруктураДляКлюча = Новый Структура("ФИОВодителя,РегНомерТС,ПаспортныеДанные,Автоперевозчик,ИНН,КПП,КлючАналитикиПеревозки,Заявка,Контейнер");
		ЗаполнитьЗначенияСвойств(СтруктураДляКлюча,ТекущаяЗапись);
		СтруктураДляКлюча.Заявка = Объект.Ссылка;
		Если СтруктураОтвет <> Неопределено Тогда
			Если СтруктураОтвет.ПустойКлюч Тогда				
				ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение(СтрШаблон("Перечисление.ЭтапыПеревозки.%1",ЭтапПеревозки)),НоваяСтрока.ВерсияКлюча);
				НоваяСтрока.КлючАналитикиПеревозки = СтруктураДляКлюча.КлючАналитикиПеревозки;
			Иначе
				Если инд < СтруктураОтвет.КлючРелиза.Количество() Тогда
					СтруктураДляКлюча.КлючАналитикиПеревозки = СтруктураОтвет.КлючРелиза[инд].КлючАналитикиПеревозки;
				КонецЕсли;
				ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение(СтрШаблон("Перечисление.ЭтапыПеревозки.%1",ЭтапПеревозки)),НоваяСтрока.ВерсияКлюча);
				НоваяСтрока.КлючАналитикиПеревозки = СтруктураДляКлюча.КлючАналитикиПеревозки;
				инд = инд + 1;
			КонецЕсли;	
		Иначе  
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
			Если инд < КлючиИзСоставаУслуг.Количество() Тогда
			    СтруктураДляКлюча.КлючАналитикиПеревозки = КлючиИзСоставаУслуг[инд];
				ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение(СтрШаблон("Перечисление.ЭтапыПеревозки.%1",ЭтапПеревозки)),НоваяСтрока.ВерсияКлюча);
				НоваяСтрока.КлючАналитикиПеревозки = СтруктураДляКлюча.КлючАналитикиПеревозки; 
				инд = инд + 1;
			Иначе
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
				ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение(СтрШаблон("Перечисление.ЭтапыПеревозки.%1",ЭтапПеревозки)),НоваяСтрока.ВерсияКлюча);
				НоваяСтрока.КлючАналитикиПеревозки = СтруктураДляКлюча.КлючАналитикиПеревозки;  
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024 
			КонецЕсли;
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
		КонецЕсли;    
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 26.03.2024
		Если ЭтапПеревозки = "ПоследняяМиля" и ЗначениеЗаполнено(СтруктураДляКлюча.КлючАналитикиПеревозки) Тогда
			КонтейнерВКлюче = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(СтруктураДляКлюча.КлючАналитикиПеревозки, "Контейнер");
			НоваяСтрока.Контейнер = КонтейнерВКлюче;
		КонецЕсли;
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 26.03.2024
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	КонецЦикла;	
	УстановитьОтборТранспортныхСредств();
	// Евросиб Фролов )
КонецПроцедуры  

// ДИТ BUG 82599 ТА 82600 Сержантова А.С. 21.03.2024
&НаСервере
Функция ПолучитьКлючиАналитикиПоКонтейнерамИзУслуг(СписокКонтейнеров)

	КлючиИзУслуг = Новый Массив;
	Для каждого СтрокаУслуги Из Объект.СоставУслуги Цикл
		Если СписокКонтейнеров.Найти(СтрокаУслуги.НомерКТК) <> Неопределено 
			и ЗначениеЗаполнено(СтрокаУслуги.КлючАналитикиПеревозки) Тогда
		    КлючиИзУслуг.Добавить(СтрокаУслуги.КлючАналитикиПеревозки);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат КлючиИзУслуг;

КонецФункции 

&НаСервере
Процедура НастроитьВидимостьВкладкиЗапросНаКТК()
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	Элементы.ГруппаСписокЗапросНаКТК.Видимость 				= Объект.ЗапросНаКТК;
    //Элементы.СоставУслугиЗаполнитьИзЗапросаНаКТК.Видимость 	= Объект.ЗапросНаКТК; //ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023
	Если ЭтоЗаявкаПоСубсидии(Объект.ПСЦ) Тогда
		Элементы.ЗапросНаКТК.Видимость = Ложь;
		Элементы.ГруппаСписокЗапросНаКТК.Видимость = Ложь;
	КонецЕсли;
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 28.07.2023
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента 
	Элементы.ВнутреннийСтатусЗапроса.Видимость = Объект.ЗапросНаКТК;
	Если Не ЗначениеЗаполнено(Объект.ВнутреннийСтатусЗапроса)
		И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Черновик;
	КонецЕсли;	
	// Евросиб Фролов)
	
	// Ограничим доступность полей на вкладке "Услуги" если установлен признак "Запрос на КТК".
	// Евросиб Фролов (29.12.2021 TASK №44222
	// Перенесено в условное оформление, т.к. стало доступным по условию
	//Элементы.СоставУслугиНомерКТК.ТолькоПросмотр 				 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиПринадлежностьТЕ.ТолькоПросмотр 		 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиВладелецКТК.ТолькоПросмотр 			 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиРелиз.ТолькоПросмотр 					 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиСтокВыдачи.ТолькоПросмотр 				 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиДатаВыдачи.ТолькоПросмотр 				 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиНормативноеИспользование.ТолькоПросмотр = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиПунктОтправления.ТолькоПросмотр 		 = Объект.ЗапросНаКТК;
	//Элементы.СоставУслугиПунктНазначения.ТолькоПросмотр 		 = Объект.ЗапросНаКТК;
	// Евросиб Фролов)
	
	Элементы.СоставУслугиРазмерКТК.ТолькоПросмотр 				 = Объект.ЗапросНаКТК;
	Элементы.СоставУслугиТипКТК.ТолькоПросмотр 					 = Объект.ЗапросНаКТК;	
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//Элементы.СоставУслугиВидСобственности.ТолькоПросмотр 		 = Объект.ЗапросНаКТК;			
	//Стало:
	Элементы.СоставУслугиВидСобственности.ТолькоПросмотр = Истина;
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	// Евросиб Фролов)	

	//ДИТ Авдеева В.С. 51139 13.05.2022 Начало 
	Элементы.ДатаСозданияЗапроса.Видимость = Объект.ЗапросНаКТК;
	//ДИТ Авдеева В.С. 51139 13.05.2022 Конец
	
	//Субботин 81210 26.02.2024 Начало 
	КонтейнерыИзЗапроса = Объект.СписокЗапросНаКТК.Выгрузить(,"СписокКТК");	
	МассивКонтейнеров = Новый Массив;
	Для Каждого СтрокаКТК Из КонтейнерыИзЗапроса Цикл
		Если ЗначениеЗаполнено(СтрокаКТК.СписокКТК) Тогда
			МассивКонтейнеров.Добавить(СтрокаКТК);
		КонецЕсли;			
	КонецЦикла;
	ЗаполненРеквизитСписокКтк = НЕ МассивКонтейнеров.Количество() = 0;
	//Субботин 81210 26.02.2024 Начало

	
	//Субботин 77659 25.01.2024 начало	
   Элементы.СписокЗапросНаКТКСписокКТК.Видимость = Объект.ЗапросНаКТК 
   и (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РефСцеп") Или ПроверитьСвязанныеДокументы()) или ЗаполненРеквизитСписокКтк ; 
   	//Субботин 77659 25.01.2024 Конец
		
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьПолейЗапросаНаКТК(ПоляТаблицы)
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	
	СписокПолейЗапрещенныхОРК = "СписокЗапросНаКТККомментарийКРелизу,
								|СписокЗапросНаКТКРелизКлиента,
								//|СписокЗапросНаКТКТерминалВыдачи, // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
								|СписокЗапросНаКТКФИОВодителяПерваяМиля,
								|СписокЗапросНаКТКНомерТСПерваяМиля,
								|СписокЗапросНаКТКАвтоперевозчикПерваяМиля,
								|СписокЗапросНаКТККомментарийПерваяМиля,
								|СписокЗапросНаКТКФИОВодителяПоследняяМиля,
								|СписокЗапросНаКТКНомерТСПоследняяМиля,
								|СписокЗапросНаКТКАвтоперевозчикПоследняяМиля,
								|СписокЗапросНаКТККомментарийПоследняяМиля";
	
	// Проставим всем полям только просмотр (кроме администраторов и пользователей с ролью "dc_РаботаСЗаявками").
	ДоступнаРольРаботаСЗаявками = Пользователи.РолиДоступны("dc_РаботаСЗаявками");
	ДоступенТолькоПросмотр 		= НЕ ДоступнаРольРаботаСЗаявками;
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	Для Каждого ТекущееПоле Из ПоляТаблицы Цикл
		Если ТипЗнч(ТекущееПоле) = Тип("ПолеФормы") Тогда
			ТекущееПоле.ТолькоПросмотр = ДоступенТолькоПросмотр;
			
			Если СтрНайти(СписокПолейЗапрещенныхОРК, ТекущееПоле.Имя) > 0
				И НЕ ЭтоПолноправныйПользователь Тогда
				ТекущееПоле.ТолькоПросмотр = Истина;	
			КонецЕсли;		
			
		ИначеЕсли ТипЗнч(ТекущееПоле) = Тип("ГруппаФормы") Тогда
			НастроитьДоступностьПолейЗапросаНаКТК(ТекущееПоле.ПодчиненныеЭлементы);
		КонецЕсли;	
	КонецЦикла;
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементУдален
	//Элементы.СписокЗапросНаКТКДанныеПоАвтоперевозке.ТолькоПросмотр = Истина; // Евросиб Фролов (16.02.2022 Task №44768
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
	
	// Данные поля обновляются из релизов и не поделажт редактированию никому.
	Элементы.СписокЗапросНаКТКРелизКлиентаСтокВыдачи.ТолькоПросмотр 			 = Истина;
	Элементы.СписокЗапросНаКТКРелизКлиентаВыданоКТКПоРелизу.ТолькоПросмотр 		 = Истина;
	Элементы.СписокЗапросНаКТКРелизКлиентаОсталосьКВыдачеПоРелизу.ТолькоПросмотр = Истина;
	
	// Пользователям с ролью "dc_УчетВагоновКТК" разрешить редактирование
	// только следующих полей: "Комментарий к релизу", "Номер релиза собственника", "Номер релиза клиента", "Количество КТК".
	// Кроме того, нужно разрешить редактирование полей по автоперевозке силами Евросиб.
	ДоступнаРольУчетВагоновКТК = Пользователи.РолиДоступны("dc_УчетВагоновКТК");
	
	Если ДоступнаРольУчетВагоновКТК Тогда
		Элементы.СписокЗапросНаКТККомментарийКРелизу.ТолькоПросмотр = Ложь;
		Элементы.СписокЗапросНаКТКРелизКлиента.ТолькоПросмотр 		= Ложь;
		//Элементы.СписокЗапросНаКТКТерминалВыдачи.ТолькоПросмотр 	= Ложь; // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		Элементы.СписокЗапросНаКТККоличествоКТК.ТолькоПросмотр 		= Ложь;
		
		Для Каждого ПодчиненныйЭлемент Из Элементы.СписокЗапросНаКТКГруппаАвтоперевозкаПоОтправлению.ПодчиненныеЭлементы Цикл
			ПодчиненныйЭлемент.ТолькоПросмотр = Ложь;
		КонецЦикла;
		
		Для Каждого ПодчиненныйЭлемент Из Элементы.СписокЗапросНаКТКГруппаАвтоперевозкаПоПрибытию.ПодчиненныеЭлементы Цикл
			ПодчиненныйЭлемент.ТолькоПросмотр = Ложь;
		КонецЦикла;
	КонецЕсли;	
	
	// Евросиб Фролов)
КонецПроцедуры	

&НаСервере
Процедура ОбновитьИтоги()
	// Евросиб Фролов (16.11.2021 TASK№ №41969	
	Если Не Объект.ЗапросНаКТК Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаЗапросНаКТК.ТипКТК КАК ТипКТК,
	|	ЗаявкаЗапросНаКТК.КоличествоКТК КАК КоличествоКТК
	|ПОМЕСТИТЬ втТаблицаЗапросов
	|ИЗ
	|	&СписокЗапросНаКТК КАК ЗаявкаЗапросНаКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|		КОГДА втТаблицаЗапросов.ТипКТК.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА втТаблицаЗапросов.КоличествоКТК
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Размер20,
	|	СУММА(ВЫБОР
	|		КОГДА втТаблицаЗапросов.ТипКТК.РазмерКТК <> ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА втТаблицаЗапросов.КоличествоКТК
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Размер40
	|ИЗ
	|	втТаблицаЗапросов КАК втТаблицаЗапросов";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокЗапросНаКТК", Объект.СписокЗапросНаКТК.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
	
		ИтогиВсегоКТК20Фт = Выборка.Размер20;
		ИтогиВсегоКТК40Фт = Выборка.Размер40;
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТранспортныеСредстваИПеревозчиковСтроки(ИдентификаторСтроки,ТЧТранспортныеСредства)

	СтруктураДляПоиска = Новый Структура("ИдентификаторСтрокиЗапроса", ИдентификаторСтроки);
	
	//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
	// Удаляем транспортные средства
	МассивСтрокДляУдаления = Объект[ТЧТранспортныеСредства].НайтиСтроки(СтруктураДляПоиска);
	
	Для Каждого УдаляемаяСтрока Из МассивСтрокДляУдаления Цикл
		Объект[ТЧТранспортныеСредства].Удалить(УдаляемаяСтрока);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицыЗапросНаКТК()
		
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	Если НЕ Объект.ЗапросНаКТК Тогда
		Возврат;
	КонецЕсли;	
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ИдентификаторыСтрок = Объект.СписокЗапросНаКТК.Выгрузить().ВыгрузитьКолонку("ИдентификаторСтроки");
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента,
	|	РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки КАК ИдентификаторСтрокиЗаявки
	|ИЗ
	|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
	|ГДЕ
	|	РелизыКлиентовЗапросовНаКТК.Заявка = &Заявка
	|	И РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки В(&МассивИдетификаторов)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	Запрос.УстановитьПараметр("МассивИдетификаторов", ИдентификаторыСтрок);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРелизов = РезультатЗапроса.Выгрузить();
	
	// Евросиб Фролов (28.04.2022 Task №50233
	МассивРелизов = Новый Массив;
	// Евросиб Фролов)
	
	Для Каждого СтрокаТаблицы Из Объект.СписокЗапросНаКТК Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторСтроки) Тогда
			
			СтрокаРелиза = ТаблицаРелизов.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтрокиЗаявки");
			
			Если СтрокаРелиза <> Неопределено Тогда
				СтрокаТаблицы.РелизКлиента = СтрокаРелиза.РелизКлиента;
				
				// Евросиб Фролов (28.04.2022 Task №50233
				МассивРелизов.Добавить(СтрокаТаблицы.РелизКлиента);
				// Евросиб Фролов)
			КонецЕсли;	
		КонецЕсли;
		
		// Евросиб Фролов (16.02.2022 Task №44768
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементУдален
		//Если СтрокаТаблицы.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб") Тогда
		//	СтрокаТаблицы.ДанныеПоАвтоперевозке = "Заполняется сотрудником ОРП";
		//ИначеЕсли СтрокаТаблицы.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
		//	СтрокаТаблицы.ДанныеПоАвтоперевозке = "Заполняется сотрудником ОРК во вложенной таблице ниже"; // Евросиб Фролов (16.02.2022 Task №44768
		//Иначе
		//	СтрокаТаблицы.ДанныеПоАвтоперевозке = "";
		//КонецЕсли;
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало //ЭлементКонец
		// Евросиб Фролов)
		
	КонецЦикла;
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.04.2022 Task №50233
	ИнструкцииРелизов = Документы.Заявка.ТекстИнструкцииРелизаКлиента(МассивРелизов);
	Для Каждого СтрокаТаблицы Из Объект.СписокЗапросНаКТК Цикл
		СтрокаТаблицы.ИнструкцияПоСдаче = ИнструкцииРелизов.Получить(СтрокаТаблицы.РелизКлиента);
	КонецЦикла;	
	// Евросиб Фролов)
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0330059, 30-10-2023, закомменитровал неиспользуемую процедуру ПолучитьКоличествоКТКРелизов()
//&НаСервереБезКонтекста
//Функция ПолучитьКоличествоКТКРелизов(Релизы)
//	// Евросиб Фролов (16.11.2021 TASK№ №41969
//	
//	МассивРелизов = Новый Массив;
//	
//	//Если ТипЗнч(Релизы) = Тип("ДокументСсылка.РелизСобственника") Тогда
//	Если ТипЗнч(Релизы) = Тип("ДокументСсылка.РелизКлиента") Тогда // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
//		МассивРелизов.Добавить(Релизы);
//	Иначе
//		МассивРелизов = Релизы;
//	КонецЕсли;	
//	
//	КоличествоКТКРелизов = Новый Соответствие;
//	
//	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
//	//ТекстЗапроса =
//	//"ВЫБРАТЬ
//	//|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
//	//|	СУММА(ВЫБОР
//	//|			КОГДА РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
//	//|					И РелизСобственникаНоминации.ДатаВзятия <> ДАТАВРЕМЯ(1, 1, 1)
//	//|				ТОГДА 1
//	//|			ИНАЧЕ 0
//	//|		КОНЕЦ) КАК КоличествоКТК,
//	//|	СУММА(ВЫБОР
//	//|			КОГДА РелизСобственникаНоминации.ДатаВзятия = ДАТАВРЕМЯ(1, 1, 1)
//	//|				ТОГДА 1
//	//|			ИНАЧЕ 0
//	//|		КОНЕЦ) КАК ОсталосьКВыдаче
//	//|ИЗ
//	//|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
//	//|ГДЕ
//	//|	РелизСобственникаНоминации.Ссылка В(&МассивДокументов)
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	РелизСобственникаНоминации.Ссылка";
//	
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	РелизКлиентаКонтейнеры.Ссылка КАК Ссылка,
//	|	РелизКлиентаКонтейнеры.Ссылка.ОбщееКоличествоКТКВРелизе КАК ОбщееКоличествоКТКВРелизе,
//	|	СУММА(ВЫБОР
//	|			КОГДА РелизКлиентаКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
//	|					И РелизКлиентаКонтейнеры.ДатаВывоза <> ДАТАВРЕМЯ(1, 1, 1)
//	|				ТОГДА 1
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК Выдано
//	|ИЗ
//	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
//	|ГДЕ
//	|	РелизКлиентаКонтейнеры.Ссылка В(&МассивДокументов)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РелизКлиентаКонтейнеры.Ссылка";
//    // Евросиб Фролов)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	
//	Запрос.УстановитьПараметр("МассивДокументов", МассивРелизов);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Если Не РезультатЗапроса.Пустой() Тогда
//		
//		СоответствиеКоличества = Новый Соответствие;
//			
//		Выборка = РезультатЗапроса.Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
//			//СоответствиеКоличества.Вставить("КоличествоКТК", Выборка.КоличествоКТК);
//			//СоответствиеКоличества.Вставить("ОсталосьКВыдаче", Выборка.ОсталосьКВыдаче);
//			СоответствиеКоличества.Вставить("КоличествоКТК", Выборка.Выдано);
//			СоответствиеКоличества.Вставить("ОсталосьКВыдаче", Выборка.ОбщееКоличествоКТКВРелизе - Выборка.Выдано);
//			// Евросиб Фролов)
//			
//			КоличествоКТКРелизов.Вставить(Выборка.Ссылка, СоответствиеКоличества);
//		КонецЦикла;	
//	КонецЕсли;	
//	
//	Возврат КоличествоКТКРелизов;
//	// Евросиб Фролов)
//КонецФункции

&НаСервере
Процедура ВыполнитьЗаполнениеУслугПоЗапросуНаКТК(РежимЗаполнения)
	// Евросиб Фролов (16.11.2021 TASK №41969
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	РелизСобственникаНоминации.Ссылка КАК Релиз,
	//|	РелизСобственникаНоминации.Контейнер КАК НомерКТК,
	//|	РелизСобственникаНоминации.ТипКТК.РазмерКТК КАК РазмерКТК,
	//|	РелизСобственникаНоминации.ТипКТК КАК ТипКТК,
	//|	ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба) КАК ПринадлежностьТЕ,
	//|	РелизСобственникаНоминации.тек_СобственностьКТК КАК ВидСобственности,
	//|	РелизСобственникаНоминации.Ссылка.Контрагент КАК ВладелецКТК,
	//|	РелизСобственникаНоминации.Ссылка.Сток КАК СтокВыдачи,
	//|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВыдачи
	//|ИЗ
	//|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	//|ГДЕ
	//|	РелизСобственникаНоминации.Ссылка В(&МассивДокументов)
	//|	И РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|	И РелизСобственникаНоминации.ДатаВзятия <> ДАТАВРЕМЯ(1, 1, 1)";
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	// Выбираем для переноса только те строки КТК из релиза клиента,
	// которые не были добавлены в другие заявки
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента
		|ПОМЕСТИТЬ втРелизыКлиентов
		|ИЗ
		|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|ГДЕ
		|	РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки В(&МассивИдентификаторовСтрок)
		|	И РелизыКлиентовЗапросовНаКТК.РелизКлиента <> ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизКлиентаКонтейнеры.Ссылка КАК Релиз,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
		//|	РелизКлиентаКонтейнеры.Контейнер КАК НомерКТК,
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК НомерКТК,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -начало
		//|	РелизКлиентаКонтейнеры.ТипоразмерКТК.РазмерКТК КАК РазмерКТК,
		//|	РелизКлиентаКонтейнеры.ТипоразмерКТК КАК ТипКТК,
		  |	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер.ТипТЕ.РазмерКТК КАК РазмерКТК,
		  |	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер.ТипТЕ КАК ТипКТК,
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -конец
		|	ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба) КАК ПринадлежностьТЕ,
		//|	ВЫБОР
		//|		КОГДА РелизКлиентаКонтейнеры.Ссылка.ВыдачаОтСобственника
		//|			ТОГДА РелизКлиентаКонтейнеры.ВидСобственности
		//|		ИНАЧЕ стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности
		//|	КОНЕЦ КАК ВидСобственности,
		|	РелизКлиентаКонтейнеры.ВидСобственности КАК ВидСобственности,
		|	ВЫБОР
		|		КОГДА РелизКлиентаКонтейнеры.Ссылка.ВыдачаОтСобственника
		|			ТОГДА РелизКлиентаКонтейнеры.Ссылка.СобственникКТК
		|		ИНАЧЕ РелизКлиентаКонтейнеры.СобственникКТК
		|	КОНЕЦ КАК ВладелецКТК,
		|	РелизКлиентаКонтейнеры.Ссылка.СтокВыдачи КАК СтокВыдачи,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
		//|	РелизКлиентаКонтейнеры.ДатаВывоза КАК ДатаВыдачи,
		//|	ВЫБОР
		//|		КОГДА (ВЫРАЗИТЬ(стоки_ТекущиеДанныеСрезПоследних.тек_ИнструкцияПоСдаче КАК СТРОКА(1000))) <> """"
		//|			ТОГДА стоки_ТекущиеДанныеСрезПоследних.тек_ИнструкцияПоСдаче
		//|		ИНАЧЕ РелизКлиентаКонтейнеры.Ссылка.ИнструкцииПоСдаче
		//|	КОНЕЦ КАК ИнструкцииПоСдачеПорожнего,
		//|	РелизКлиентаКонтейнеры.ИнструкцияПоСдаче КАК ИнструкцииПоСдачеПорожнего,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачи,
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцииПоСдачеПорожнего,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
		|	РелизКлиентаКонтейнеры.Ссылка.СрокИспользованияКТК КАК НормативноеИспользование,
		|	РелизКлиентаКонтейнеры.Ссылка.ЛокацияВыдачи КАК ПунктОтправления,
		|	РелизКлиентаКонтейнеры.Ссылка.ЛокацияСдачи КАК ПунктНазначения,
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
		//|	РелизКлиентаТранспортныеСредства.ФИОВодителя КАК ФИОВодителя,
		//|	РелизКлиентаТранспортныеСредства.РегНомерТС КАК НомерАвто,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК НомерАвто,
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
		|	КлючиАналитикиПеревозкиМилиПоследняяМиля.ДатаСдачиКТКНаТерминал КАК ДатаВозвратаКлиентом,		
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаПодачиАвтоПодПогрузку,
		|	КлючиАналитикиПеревозкиМилиПоследняяМиля.ДатаВыездаКТКСоСклада КАК ДатаПодачиАвтоПодВыгрузку,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресПогрузки,
		|	КлючиАналитикиПеревозкиМилиПоследняяМиля.АдресКлиента КАК АдресВыгрузки,		
		|	КлючиАналитикиПеревозкиМилиПоследняяМиля.ФИОВодителя КАК ФИОВодителяВыгрузка,
		|	КлючиАналитикиПеревозкиМилиПоследняяМиля.РегНомерТС КАК НомерАвтоВыгрузка,
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец
		//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
		|	РелизКлиентаКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -начало
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	РелизКлиентаКонтейнеры.Ссылка.Автоперевозка КАК ПерваяМиля,
		|	РелизКлиентаКонтейнеры.Ссылка.АвтоперевозкаПоследняяМиля КАК ПоследняяМиля
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -конец
		|ПОМЕСТИТЬ втКонтейнеры
		|ИЗ
		|	втРелизыКлиентов КАК втРелизыКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
		//|			ПО РелизКлиентаКонтейнеры.Ссылка = РелизКлиентаТранспортныеСредства.Ссылка
		//|				И РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, ) КАК стоки_ТекущиеДанныеСрезПоследних
		//|			ПО РелизКлиентаКонтейнеры.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|			ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|				И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМилиПоследняяМиля
		|			ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМилиПоследняяМиля.Ссылка
		|				И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля))
		|		ПО втРелизыКлиентов.РелизКлиента = РелизКлиентаКонтейнеры.Ссылка
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
		//|			И (РелизКлиентаКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))
		//|			И (РелизКлиентаКонтейнеры.ДатаВывоза <> ДАТАВРЕМЯ(1, 1, 1))
		|			И (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))
		|			И (КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала <> ДАТАВРЕМЯ(1, 1, 1))
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЗаявкаСоставУслуги.Ссылка КАК Заявка
		|ПОМЕСТИТЬ втЗаявки
		|ИЗ
		|	втКонтейнеры КАК втКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО втКонтейнеры.ИдентификаторСтроки = ЗаявкаСоставУслуги.ИдентификаторСтрокиРелизаКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтейнеры.Релиз КАК Релиз,
		|	втКонтейнеры.НомерКТК КАК НомерКТК,
		|	втКонтейнеры.РазмерКТК КАК РазмерКТК,
		|	втКонтейнеры.ТипКТК КАК ТипКТК,
		|	втКонтейнеры.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	втКонтейнеры.ВидСобственности КАК ВидСобственности,
		|	втКонтейнеры.ВладелецКТК КАК ВладелецКТК,
		|	втКонтейнеры.СтокВыдачи КАК СтокВыдачи,
		|	втКонтейнеры.ДатаВыдачи КАК ДатаВыдачи,
		|	втКонтейнеры.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего,
		|	втКонтейнеры.НормативноеИспользование КАК НормативноеИспользование,
		|	втКонтейнеры.ПунктОтправления КАК ПунктОтправления,
		|	втКонтейнеры.ПунктНазначения КАК ПунктНазначения,
		|	втКонтейнеры.ФИОВодителя КАК ФИОВодителя,
		|	втКонтейнеры.НомерАвто КАК НомерАвто,
		|	втКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтрокиРелизаКлиента,
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -начало
		|	втКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	втКонтейнеры.ПерваяМиля КАК ПерваяМиля,
		|	втКонтейнеры.ПоследняяМиля КАК ПоследняяМиля
		//ДИТ Шевченко А.В. US 62421 TA 64347 14.02.23 -конец
		|ИЗ
		|	втКонтейнеры КАК втКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаявки КАК втЗаявки
		|		ПО втКонтейнеры.ИдентификаторСтроки = втЗаявки.ИдентификаторСтроки
		|ГДЕ
		|	(втЗаявки.Заявка ЕСТЬ NULL
		|			ИЛИ втЗаявки.Заявка = &ТекущаяЗаявка)
		|ИТОГИ ПО
		|	Релиз";
	// Евросиб Фролов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
    //МассивДокументов = Объект.СписокЗапросНаКТК.Выгрузить(, "РелизСобственника").ВыгрузитьКолонку("РелизСобственника");
    //МассивДокументов = Объект.СписокЗапросНаКТК.Выгрузить(, "РелизКлиента").ВыгрузитьКолонку("РелизКлиента");
	МассивИдентификаторовСтрок = Объект.СписокЗапросНаКТК.Выгрузить(, "ИдентификаторСтроки").ВыгрузитьКолонку("ИдентификаторСтроки");
	// Евросиб Фролов)
	
	//Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("МассивИдентификаторовСтрок", МассивИдентификаторовСтрок);
	Запрос.УстановитьПараметр("ТекущаяЗаявка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	// Если нажата кнопка "Перезаполнить", то сначала удалим ранее добавленные строки релиза клиента
	Если РежимЗаполнения = "Перезаполнить" Тогда
		Индекс = Объект.СоставУслуги.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если ЗначениеЗаполнено(Объект.СоставУслуги[Индекс].ИдентификаторСтрокиРелизаКлиента) Тогда
				Объект.СоставУслуги.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	
	// Соберем по каждому релизу допустимое количество строк
	СоответствиеКоличестваСтрока = Новый Соответствие;
	Для Каждого ТекущийЗапрос Из Объект.СписокЗапросНаКТК Цикл
		Если Не ЗначениеЗаполнено(ТекущийЗапрос.РелизКлиента) Тогда
			Продолжить;
		КонецЕсли;	
		
		СтруктураСведений = Новый Структура;
		СтруктураСведений.Вставить("КоличествоКТК", 		ТекущийЗапрос.КоличествоКТК);
		СтруктураСведений.Вставить("СрокИспользованияКТК", 	ТекущийЗапрос.СрокИспользованияКТК);
		СтруктураСведений.Вставить("ЛокацияВыдачи", 		ТекущийЗапрос.ЛокацияВыдачи);
		СтруктураСведений.Вставить("ЛокацияСдачи", 			ТекущийЗапрос.ЛокацияСдачи);
		
		СоответствиеКоличестваСтрока.Вставить(ТекущийЗапрос.РелизКлиента, СтруктураСведений);
	КонецЦикла;	
	
	ВыборкаРелизКлиента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРелизКлиента.Следующий() Цикл
		
		//Выборка = РезультатЗапроса.Выбрать();
		Выборка = ВыборкаРелизКлиента.Выбрать();
		
		ДопустимоеКоличествоСтрок 	= 0;
		НормативноеИспользование 	= 0;
		ПунктОтправления 			= Справочники.Локации.ПустаяСсылка();
		ПунктНазначения 			= Справочники.Локации.ПустаяСсылка();
		
		ЗапросПоРелизу = СоответствиеКоличестваСтрока.Получить(ВыборкаРелизКлиента.Релиз);
		Если ЗапросПоРелизу <> Неопределено Тогда
			ДопустимоеКоличествоСтрок 	= ЗапросПоРелизу.КоличествоКТК;
			НормативноеИспользование 	= ЗапросПоРелизу.СрокИспользованияКТК;
			ПунктОтправления 			= ЗапросПоРелизу.ЛокацияВыдачи;
			ПунктНазначения 			= ЗапросПоРелизу.ЛокацияСдачи; 
		КонецЕсли;	
		
		// Вычтем из допустимого количества строк количество ранее добавленных строк релиза клиента текущей заявки
		Если РежимЗаполнения = "Дозаполнить" Тогда
			Пока Выборка.Следующий() Цикл
				Если Объект.СоставУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРелизаКлиента", Выборка.ИдентификаторСтрокиРелизаКлиента)).Количество() > 0 Тогда
					ДопустимоеКоличествоСтрок = ДопустимоеКоличествоСтрок - 1;
				КонецЕсли;	
			КонецЦикла;
			
			Выборка.Сбросить();
			
			Если ДопустимоеКоличествоСтрок <= 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		ДобавленноеКоличествоСтрок = 0;
		// Евросиб Фролов)
		
		Пока Выборка.Следующий() Цикл
			
			// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
			
			// Если нажата кнопка "Дозаполнить...", то не дбавляем ранее добавленные строки
			Если РежимЗаполнения = "Дозаполнить"
				И Объект.СоставУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРелизаКлиента", Выборка.ИдентификаторСтрокиРелизаКлиента)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДобавленноеКоличествоСтрок >= ДопустимоеКоличествоСтрок Тогда
				Прервать;
			КонецЕсли;	
			ДобавленноеКоличествоСтрок = ДобавленноеКоличествоСтрок + 1;
			
			// Евросиб Фролов)
			
			СтрокаУслуги = Объект.СоставУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУслуги, Выборка);
			
			СтрокаУслуги.НормативноеИспользование 	= НормативноеИспользование;
			СтрокаУслуги.ПунктОтправления 			= ПунктОтправления;
			СтрокаУслуги.ПунктНазначения            = ПунктНазначения;
			
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
			СтрокаУслуги.КлючАналитикиПеревозки = НайтиКлючАналитикиПеревозки(СтрокаУслуги).КлючАналитикиПеревозки; 
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023			
			
			//Если СтрокиЗапроса.Количество() > 0 Тогда
			//	СтрокаУслуги.НормативноеИспользование 	= СтрокиЗапроса[0].СрокИспользованияКТК;
			//	СтрокаУслуги.ПунктОтправления 			= СтрокиЗапроса[0].ЛокацияВыдачи;
			//	СтрокаУслуги.ПунктНазначения 			= СтрокиЗапроса[0].ЛокацияСдачи;
			//КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Евросиб Фролов)
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	// Евросиб Фролов (16.11.2021 TASK №41969 
	//Евросиб СубботинВ #125504 03.12.2025 Начало 
	//ДоступнаРольРаботаСЗаявками = Пользователи.РолиДоступны("dc_РаботаСЗаявками");
	ДоступнаРольРаботаСЗаявками = Пользователи.РолиДоступны("dc_РаботаСЗаявками, dc_ПолныйПросмотрЗаявки");
	//Евросиб СубботинВ #125504 03.12.2025 Конец
	// Если пользователю недоступна роль "Работа с заявками", то редактировать всю форму нельзя
	// (разрешено редактировать только несколько полей в ТЧ "Список запрос на КТК".
	Элементы.ГруппаШапка.ТолькоПросмотр 		= НЕ ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаУслуги.Видимость 			= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаРейсы.Видимость 				= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаСостояния.Видимость 			= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаДополнительно.Видимость 		= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаОтладка.Видимость 			= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаОперативныеЗадачи.Видимость 	= ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаСибур.Видимость 				= Элементы.ГруппаСибур.Видимость И ДоступнаРольРаботаСЗаявками;
	Элементы.ГруппаЛичныеЦели.Видимость 		= ДоступнаРольРаботаСЗаявками;
	
	//Евросиб СубботинВ #125504 03.12.2025 Начало 
	Если РольДоступна("dc_ПолныйПросмотрЗаявки") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	//Евросиб СубботинВ #125504 03.12.2025 Конец

	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Элементы.СписокЗапросНаКТКСоздатьРелизКлиента.Доступность = Пользователи.РолиДоступны("dc_УчетВагоновКТК");
	
	НастроитьДоступностьПолейЗапросаНаКТК(Элементы.СписокЗапросНаКТК.ПодчиненныеЭлементы);
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.04.2022 Task №50233
	// Колонки с идентификаторами строк отображаем только администратору.
	ПользовательСПолнымиПравами = Пользователи.ЭтоПолноправныйПользователь();
    Элементы.СписокЗапросНаКТКИдентификаторСтроки.Видимость = ПользовательСПолнымиПравами;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	//Элементы.ТранспортныеСредстваИдентификаторСтроки.Видимость = ПользовательСПолнымиПравами;
	Элементы.ТранспортныеСредстваКлючАналитикиПеревозки.Видимость = ПользовательСПолнымиПравами;	
	//Элементы.СписокЗапросНаКТКРелизКлиентаТранспортныеСредстваИдентификаторСтроки.Видимость = ПользовательСПолнымиПравами;
	Элементы.ТранспортныеСредстваПоследняяМиляКлючАналитикиПеревозки.Видимость = ПользовательСПолнымиПравами;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	// Евросиб Фролов)
	
	//Евросиб - Дубская 14.06.2022 #52244  
	ДанныеПодключения = ?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, 
							Справочники.НастройкиПрограммы.Озон_тестовый, Справочники.НастройкиПрограммы.Озон); 
    Элементы.ДанныеОзон.Видимость = Объект.Контрагент = ДанныеПодключения.Контрагент;  
	//Евросиб - Дубская 14.06.2022 #52244
	
	//Евросиб Коханенко Н.А. 24.01.2025 (( #98939
	Если Объект.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре Тогда 
		Элементы.АвтозагрузкаРейсовИзДХ.Видимость = Истина;
		ПризнакАвтозагрузкиРейсов = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьАналитикуДокумента(Объект.Ссылка,
			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.АвтозагрузкаРейсовИзДХ);
		Если ПризнакАвтозагрузкиРейсов <> Неопределено Тогда
			АвтозагрузкаРейсовИзДХ = ПризнакАвтозагрузкиРейсов;
		Иначе
			АвтозагрузкаРейсовИзДХ = Ложь;
		КонецЕсли; 
	Иначе
		Элементы.АвтозагрузкаРейсовИзДХ.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 24.01.2025 )) #98939
КонецПроцедуры

&НаСервере
Процедура ОбновитьВнутреннийСтатусЗапроса(ТекущееСостояние, ТекущийСтатус);
	// Евросиб Фролов (2.03.2022 Task №44768
	Проведен = Неопределено;
	Объект.Свойство("Проведен", Проведен);
    Документы.Заявка.ОбновитьВнутреннийСтатусЗапроса(Объект, Проведен, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус);
	// Евросиб Фролов)
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменилсяСоставЗапроса(Объект)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Возврат Документы.Заявка.ИзменилсяСоставЗапроса(Объект);	
	// Евросиб Фролов)
КонецФункции

&НаКлиенте
Процедура УстановитьОтборТранспортныхСредств()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	//!!!!!!!!! Если обновлять надписи, то не срабатывает событие "При начале редактирования"
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Начало
	//ПодключитьОбработчикОжидания("ОбновитьНадписьТранспортныхСредств", 0.01, Истина);
	//ПодключитьОбработчикОжидания("ОбновитьНадписьПеревозчиков", 0.01, Истина);
	УстановитьЗаголовокГруппыАвтоперевозка();
	УстановитьЗаголовокГруппыАвтоперевозкаПоследняяМиля();
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Конец
	//// В заголовке транспортных средств укажем количество строк
	//ОбновитьНадписьТранспортныхСредств(ТекущиеДанные);
	//
	//// В заголовке перевозчиков укажем количество строк
	//ОбновитьНадписьПеревозчиков(); 
	
	Если ТекущиеДанные.Автоперевозка <> ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
		Элементы.ТранспортныеСредства.Доступность = Ложь;
	Иначе
		Элементы.ТранспортныеСредства.Доступность = Истина;
	КонецЕсли;	
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиЗапроса", ТекущиеДанные.ИдентификаторСтроки);
	Элементы.ТранспортныеСредства.ОтборСтрок = ОтборСтрок;
	
	Если ТекущиеДанные.ПоследняяМиля <> ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
		Элементы.ТранспортныеСредстваПоследняяМиля.Доступность = Ложь;
	Иначе
		Элементы.ТранспортныеСредстваПоследняяМиля.Доступность = Истина;
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиЗапроса", ТекущиеДанные.ИдентификаторСтроки);
	Элементы.ТранспортныеСредстваПоследняяМиля.ОтборСтрок = ОтборСтрок;
	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиЗапроса,ЭтапПеревозки", ТекущиеДанные.ИдентификаторСтроки,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"));
	Элементы.СписокЗапросНаКТКРелизКлиентаТранспортныеСредства.ОтборСтрок = ОтборСтрок;
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиЗапроса,ЭтапПеревозки", ТекущиеДанные.ИдентификаторСтроки,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"));
	Элементы.СписокЗапросНаКТКРелизКлиентаТранспортныеСредстваПоследняяМиля.ОтборСтрок = ОтборСтрок;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	
	// Обновим доступность кнопки "Дозаполнить" для таб. части "Состав услуг"
	КоличествоДобавленныхСтрокПоРелизу = Объект.СоставУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРелизаКлиента", ТекущиеДанные.ИдентификаторСтроки)).Количество();
	Если КоличествоДобавленныхСтрокПоРелизу >= ТекущиеДанные.КоличествоКТК Тогда
		Элементы.СоставУслугиДозаполнитьИзЗапросаНаКТК.Доступность = Ложь;
	КонецЕсли;	
	
	// Евросиб Фролов)
	ПодключитьОбработчикОжидания("НастроитьОтображениеАвтоперевозки", 0.01, Истина); // Евросиб Фролов, 28.04.2022 Task №50233
КонецПроцедуры		

&НаКлиенте
Процедура ОбновитьНадписьТранспортныхСредств()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиТранспортныхСредств = Объект.ТранспортныеСредства.НайтиСтроки(Новый Структура("ИдентификаторСтрокиЗапроса", ТекущиеДанные.ИдентификаторСтроки));
	КоличествоСтрок = СтрокиТранспортныхСредств.Количество();
	Элементы.ГруппаТранспортныеСредства.Заголовок = СтрШаблон("Водители и транспортные средства (%1)", КоличествоСтрок);
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПеревозчиков()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандЗаполнения()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
    // Насраиваем видимость кнопок заполнения услуг по запросу на КТК
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	//Если Объект.ЗапросНаКТК Тогда
	//	Если Объект.СоставУслуги.Количество() = 0 Тогда
	//		//Элементы.СоставУслугиЗаполнитьИзЗапросаНаКТК.Видимость 		= Истина;
	//		//Элементы.СоставУслугиПерезаполнитьИзЗапросаНаКТК.Видимость 	= Ложь;
	//		//Элементы.СоставУслугиДозаполнитьИзЗапросаНаКТК.Видимость 	= Ложь;
	//	Иначе
	//		//Элементы.СоставУслугиЗаполнитьИзЗапросаНаКТК.Видимость 		= Ложь;
	//		//Элементы.СоставУслугиПерезаполнитьИзЗапросаНаКТК.Видимость 	= Истина;
	//		//Элементы.СоставУслугиДозаполнитьИзЗапросаНаКТК.Видимость 	= Истина;
	//	КонецЕсли;
	//Иначе
	//	//Элементы.СоставУслугиЗаполнитьИзЗапросаНаКТК.Видимость 		= Ложь;
	//	//Элементы.СоставУслугиПерезаполнитьИзЗапросаНаКТК.Видимость 	= Ложь;
	//	//Элементы.СоставУслугиДозаполнитьИзЗапросаНаКТК.Видимость 	= Ложь;
	//КонецЕсли;
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	// Евросиб Фролов)
КонецПроцедуры		

&НаСервере
Процедура СохранитьНомерЗаявкиВРелиз(РелизКлиента)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.РелизКлиента");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", РелизКлиента);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	ДокументОбъект = РелизКлиента.ПолучитьОбъект();
	ДокументОбъект.Заявка = Объект.Ссылка;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	// Евросиб Фролов)
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьОтображениеАвтоперевозки()
	// Евросиб Фролов (28.04.2022 Task №50233
	// Если в строке запроса в поле "Автоперевозка" (заголовок "Кем осуществляется автоперевозка")
	// указано "Силами Евросиб", то скрывать табличные части автоперевозки и на их месте отображать
	// динамические списки с данными из релиза клиента.
	
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АвтоперевозкаСиламиЕвросиб = ТекущиеДанные.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб");
	
	Элементы.ТранспортныеСредства.Видимость = Не АвтоперевозкаСиламиЕвросиб;
	
	Элементы.СписокЗапросНаКТКРелизКлиентаТранспортныеСредства.Видимость = АвтоперевозкаСиламиЕвросиб;

	Если АвтоперевозкаСиламиЕвросиб Тогда
		Если ЗаполненаАвтоперевозкаРелизаКлиента(ТекущиеДанные.РелизКлиента,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля")) Тогда			
			Элементы.ГруппаАвтоперевозка.Видимость = Истина;					
			Элементы.ГруппаТранспортныеСредства.Заголовок = "Водители и транспортные средства (из релиза)";
		Иначе
			Элементы.ГруппаАвтоперевозка.Видимость = Ложь;
		КонецЕсли;
	Иначе	
		Элементы.ГруппаАвтоперевозка.Видимость = Истина;
		
		Элементы.ГруппаТранспортныеСредства.Заголовок = "Водители и транспортные средства";
	КонецЕсли;
	
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Начало
	
	АвтоперевозкаПоследняяМиляСиламиЕвросиб = ТекущиеДанные.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб");
	
	Элементы.ТранспортныеСредстваПоследняяМиля.Видимость = Не АвтоперевозкаПоследняяМиляСиламиЕвросиб;
	Элементы.СписокЗапросНаКТКРелизКлиентаТранспортныеСредстваПоследняяМиля.Видимость = АвтоперевозкаПоследняяМиляСиламиЕвросиб;
	Если АвтоперевозкаПоследняяМиляСиламиЕвросиб Тогда
		Если ЗаполненаАвтоперевозкаРелизаКлиента(ТекущиеДанные.РелизКлиента,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля")) Тогда			
			Элементы.ГруппаАвтоперевозкаПоследняяМиля.Видимость = Истина;		
			
			Элементы.ГруппаТранспортныеСредстваПоследняяМиля.Заголовок = "Водители и транспортные средства (из релиза)";
		Иначе
			Элементы.ГруппаАвтоперевозкаПоследняяМиля.Видимость = Ложь;
		КонецЕсли;
	Иначе	
		Элементы.ГруппаАвтоперевозкаПоследняяМиля.Видимость = Истина;
		
		Элементы.ГруппаТранспортныеСредстваПоследняяМиля.Заголовок = "Водители и транспортные средства";
	КонецЕсли;
	
	//ДИТ Шевченко А.В. TASK 51973 20.06.2022 -Начало
	Если ТекущиеДанные.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется") 
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Автоперевозка) Тогда
			Элементы.ГруппаАвтоперевозка.Видимость = Ложь;;
	КонецЕсли;
	Если ТекущиеДанные.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется") 
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ПоследняяМиля) Тогда
			Элементы.ГруппаАвтоперевозкаПоследняяМиля.Видимость = Ложь;;
	КонецЕсли;	
	//ДИТ Шевченко А.В. TASK 51973 20.06.2022 -Конец
	
	Если Элементы.ГруппаАвтоперевозка.Видимость Тогда
		ЭтаФорма.ПодключитьОбработчикОжидания("УстановитьЗаголовокГруппыАвтоперевозка",1,Ложь);
	Иначе
		ЭтаФорма.ОтключитьОбработчикОжидания("УстановитьЗаголовокГруппыАвтоперевозка");
	КонецЕсли;
	
	Если Элементы.ГруппаАвтоперевозкаПоследняяМиля.Видимость Тогда
		ЭтаФорма.ПодключитьОбработчикОжидания("УстановитьЗаголовокГруппыАвтоперевозкаПоследняяМиля",1,Ложь);
	Иначе
		ЭтаФорма.ОтключитьОбработчикОжидания("УстановитьЗаголовокГруппыАвтоперевозкаПоследняяМиля");	
	КонецЕсли;
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Конец
	// Евросиб Фролов)
КонецПроцедуры	

&НаСервере
Функция ЗаполненаАвтоперевозкаРелизаКлиента(РелизКлиента,Миля)
	// Евросиб Фролов (28.04.2022 Task №50233
	Если Не ЗначениеЗаполнено(РелизКлиента) Тогда
		Возврат Ложь;
	КонецЕсли;	
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Начало
	//ДИТ Шевченко А.В. TASK  06.10.2022 -Начало
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -начало
	//Если Миля = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
	//	РеквизитыРелизаКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РелизКлиента, "ТранспортныеСредства");
	//	ТранспортныеСредства = РеквизитыРелизаКлиента.ТранспортныеСредства.Выгрузить();
	//ИначеЕсли Миля = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
	//	РеквизитыРелизаКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РелизКлиента, "ТранспортныеСредстваПоследняяМиля");
	//	ТранспортныеСредства = РеквизитыРелизаКлиента.ТранспортныеСредстваПоследняяМиля.Выгрузить();
	//КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 конец
	//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Конец
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -начало
	Возврат ТранспортныеСредстваСиламиЕвросиб.Количество() > 0;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
	//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
	// Евросиб Фролов)
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКлючиИзРелизаКлиента(РелизКлиента,МассивКлючей,ЭтапПеревозки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозкиМили.Ссылка.ВерсияДанных КАК ВерсияКлюча
		|ИЗ
		|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|			И (КлючиАналитикиПеревозки.Ссылка В (&МассивКлючей))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = &ЭтапПеревозки)
		|ГДЕ
		|	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
		|	И КлючиАналитикиПеревозки.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", РелизКлиента);
	Запрос.УстановитьПараметр("ЭтапПеревозки", ЭтапПеревозки);
	Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ПустойКлюч",Истина);
	МассивСтруктура = новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураОтвет.Вставить("ПустойКлюч",Ложь);
		МассивСтруктура.Добавить(Новый Структура("ФИОВодителя,ПаспортныеДанные,РегНомерТС,Автоперевозчик,ИНН,КПП,Контейнер,КлючАналитикиПеревозки,ВерсияКлюча"
																,ВыборкаДетальныеЗаписи.ФИОВодителя
																,ВыборкаДетальныеЗаписи.ПаспортныеДанные
																,ВыборкаДетальныеЗаписи.РегНомерТС
																,ВыборкаДетальныеЗаписи.Автоперевозчик
																,ВыборкаДетальныеЗаписи.ИНН
																,ВыборкаДетальныеЗаписи.КПП
																,ВыборкаДетальныеЗаписи.Контейнер
																,ВыборкаДетальныеЗаписи.КлючАналитикиПеревозки
																,ВыборкаДетальныеЗаписи.ВерсияКлюча)); 
		
	КонецЦикла;
		СтруктураОтвет.Вставить("КлючРелиза",МассивСтруктура);
	Возврат СтруктураОтвет;
КонецФункции	

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()	//ДИТ Шевченко А.В. US 62482 ТА 71463 21.06.2023
	ТабличнаяЧасть 			= Объект.СоставУслуги.Выгрузить();
	МассивКонтейнеров 		= Новый Массив;
	Для Каждого СтрокаТЧ из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер")) Тогда
			МассивКонтейнеров.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер"));
		КонецЕсли;	
	КонецЦикла;	
	ДанныеКТК 	= Документы.РелизКлиента.ПолучитьИнструкции(МассивКонтейнеров);
	Для Каждого ТекущаяСтрока Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"Контейнер")) Тогда
			//ДИТ Шевченко А.В. 28.09.2023 Ticket#0325760 +
			Если НЕ ТекущаяСтрока.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
				ДанныеТекущегоКТК = ДанныеКТК.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"Контейнер"));
				Если ДанныеТекущегоКТК <> Неопределено Тогда
					ТекущаяСтрока.ВладелецКТК = ДанныеТекущегоКТК.СобственникКТК;
					ТекущаяСтрока.ВидСобственности = ДанныеТекущегоКТК.ВидСобственности;
					//ТекущаяСтрока.ПринадлежностьТЕ = АРМ_Сервер.ОпределитьПринадлежностьПоВидуСобственности(ДанныеТекущегоКТК.ВидСобственности);
				Иначе
					ТекущаяСтрока.ВладелецКТК 		= Справочники.Контрагенты.ПустаяСсылка();
					ТекущаяСтрока.ВидСобственности	= ПредопределенноеЗначение("Перечисление.ВариантыСобственности.ПустаяСсылка");
				КонецЕсли;
			КонецЕсли;
			//ДИТ Шевченко А.В. 28.09.2023 Ticket#0325760 -
		КонецЕсли;	
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура рейс_ДобавитьЖД(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРейса", ЭтаФорма);	
	// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023  
	// Было:
	//ОткрытьФорму("Справочник.РейсыЖД.ФормаВыбора", 	
	//,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	// Стало:           
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КТК", ПолучитьКонтейнерыЗаявки());
	ОткрытьФорму("Справочник.РейсыЖД.ФормаВыбора", ПараметрыОткрытия 	
		,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// ДИТ ТА 70350 Сержантова А.С. Конец: 09.06.2023
	
КонецПроцедуры 

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаСервере
Функция ПолучитьКонтейнерыЗаявки()

	МассивКонтейнеров = Новый Массив;
	Для каждого Стр Из Объект.СоставУслуги Цикл
		МассивКонтейнеров.Добавить(Стр.НомерКТК);	
	КонецЦикла;
	Возврат МассивКонтейнеров;

КонецФункции 

Функция ЭтоАвтоИлиМорскойРейс(ТекЭлемент)
	    Если ( (СтрНайти(Нрег(ТипЗнч(ТекЭлемент)),"авто")
			+ СтрНайти(Нрег(ТипЗнч(ТекЭлемент)),"мор"))>0 ) Тогда 
				Возврат Истина;
		КонецЕсли;
		Возврат ЛОЖЬ;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораРейса(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Если Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("Рейс", Параметр1)).Количество() = 0 Тогда
		НСТР = Объект.ПереченьРейсов.Добавить();
		НСТР.Рейс = Параметр1;
		НСТР.Продукт = ПолучитьРодителя(Параметр1); 
		//БИТ Белинский Д.А. 11.04.2023 -начало
			УстановитьДоступностьПолейПоследнейМили();
		//БИТ Белинский Д.А. 11.04.2023 -конец     
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 25.07.2024
		НСТР.Пользователь = ПользователиКлиент.ТекущийПользователь();
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 25.07.2024
		
		//++#ДИТ Коробов. А.П. Ticket#0259275 от 07.02.2021
		Если ЭтоАвтоИлиМорскойРейс(Параметр1) Тогда Возврат; КонецЕсли;
		//++#ДИТ Коробов. А.П. Ticket#0259275 от 07.02.2021
		//Евросиб Каблов 01.07.2021 ( Ticket#0228545
		//Евросиб Каблов 27.01.2026 ( #126739
		//НСТР.НомерПоездаКлиента = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НСТР.Рейс, "НомерПоездаКлиента");
		//Евросиб Каблов 27.01.2026 ) #126739
		//Евросиб Каблов 01.07.2021 )
		
		//ДИТ Шевченко А.В. 57147 28.12.2022 -начало
		//Евросиб Каблов 27.01.2026 ( #126739
		//Если ТипЗнч(Параметр1) = Тип("СправочникСсылка.РейсыЖД") И Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда
		//	РейсОтменен = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Параметр1,"РейсОтменен");
		//	Если НЕ РейсОтменен Тогда
		Если ТипЗнч(Параметр1) = Тип("СправочникСсылка.РейсыЖД") Тогда
			РеквизитыРейса = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(НСТР.Рейс, "НомерПоездаКлиента,РейсОтменен,ПричинаОтмены_DX");
			РейсОтменен = РеквизитыРейса.РейсОтменен;
			НСТР.РейсОтменен = РейсОтменен;
			НСТР.ПричинаОтмены = РеквизитыРейса.ПричинаОтмены_DX;
			Если РейсОтменен Тогда
				НСТР.ТекстРейсОтменен = "Рейс отменен!";
				ВывестиСообщениеПоОтмененномуРейсу(НСТР);
			Иначе
				НСТР.ТекстРейсОтменен = "";
				Если Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда
		//Евросиб Каблов 27.01.2026 ) #126739
			
				МассивСтатусы = Новый Массив;
				МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.Подтверждено"));
				МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ПодтвержденоСУсловием"));
				МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ИзмененоПослеСогл"));
				// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
				// Было:
				//Если МассивСтатусы.Найти(Объект.СтатусЗаявкиСибур) <> Неопределено Тогда
				//	ВыполнитьПроверкиСибур();
				//КонецЕсли;
				//Стало:
				Для Каждого Стр Из Объект.НомераЛотов Цикл  
					Если МассивСтатусы.Найти(Стр.СтатусЛота) <> Неопределено Тогда 
					ВыполнитьПроверкиСибур();
						Прервать;	
				КонецЕсли;
				КонецЦикла;	
				// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
			КонецЕсли;
			//Евросиб Каблов 27.01.2026 ( #126739
			КонецЕсли;
			//Евросиб Каблов 27.01.2026 ) #126739
		КонецЕсли;	
		//ДИТ Шевченко А.В. 57147 28.12.2022 -конец
		
		//Евросиб Каблов 27.01.2026 ( #126739
		ОтмененныеРейсы = Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("РейсОтменен", Истина));
		Элементы.ПереченьРейсовГруппаРейсОтменен.Видимость = ЗначениеЗаполнено(ОтмененныеРейсы);
		//Евросиб Каблов 27.01.2026 ) #126739
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРодителя(Параметр1)
	Возврат Параметр1.Продукт;
КонецФункции

&НаКлиенте
Процедура рейс_ДобавитьМорской(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРейса", ЭтаФорма);
	ОткрытьФорму("Справочник.РейсыМоре.ФормаВыбора",,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
Процедура рейс_ДобавитьАвто(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРейса", ЭтаФорма);
	ОткрытьФорму("Справочник.РейсыАвто.ФормаВыбора",,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

//ДИТ Шевченко А.В. TASK 51973 02.06.2022 -Начало
&НаКлиенте
Процедура УстановитьЗаголовокГруппыАвтоперевозка()
	
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиТранспортныхСредств = Объект.ТранспортныеСредства.НайтиСтроки(Новый Структура("ИдентификаторСтрокиЗапроса", ТекущиеДанные.ИдентификаторСтроки));
	КоличествоСтрок = СтрокиТранспортныхСредств.Количество();
	КоличествоСтрокПерваяМиля = КоличествоСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокГруппыАвтоперевозкаПоследняяМиля()
	
	ТекущиеДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиТранспортныхСредств = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(Новый Структура("ИдентификаторСтрокиЗапроса", ТекущиеДанные.ИдентификаторСтроки));
	КоличествоСтрок = СтрокиТранспортныхСредств.Количество();
	КоличествоСтрокПоследняяМиля = КоличествоСтрок;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьИменаКомандЗапросовНаАстоперевозку()
	
	ИмяЗаголовкаПерваяМиля    = "Создать запрос на автоперевозку (первая миля)";
	ИмяЗаголовкаПоследняяМиля = "Создать запрос на автоперевозку (последняя миля)";
	
	Если ЗначениеЗаполнено(ЗапросПерваяМиля) Тогда
		ИмяЗаголовкаПерваяМиля    = "Открыть запрос на автоперевозку (первая миля)";
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 07.08.2024 (( #87840 
	Элементы.ФормаЗапросНаАвтоперевозкуСредняяМиля.Видимость = ЗначениеЗаполнено(ЗапросСредняяМиля);
	//Евросиб Коханенко Н.А. 07.08.2024 )) #87840 
	
	Если ЗначениеЗаполнено(ЗапросПоследняяМиля) Тогда
		ИмяЗаголовкаПоследняяМиля = "Открыть запрос на автоперевозку (последняя миля)";
	КонецЕсли;
	
	Элементы.ФормаЗапросНаАвтоперевозку.Заголовок              = ИмяЗаголовкаПерваяМиля;
	Элементы.ФормаЗапросНаАвтоперевозкуПоследняяМиля.Заголовок = ИмяЗаголовкаПоследняяМиля;
КонецПроцедуры	
//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Конец

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если Объект.ЗапросНаКТК Тогда
		ОбновитьВнутреннийСтатусЗапроса(ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус);
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьПредупрежденияБлокировки()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		//Евросиб - АСуслов 09.11.2020 11:20:14 #
		//(
		//Рез = КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Объект.Контрагент, ТекущаяДата());
		Рез = КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Объект.Контрагент, ТекущаяДата());
		//)
		//Евросиб - АСуслов 09.11.2020 11:20:15 #
		Элементы.ПредупреждениеБлокировки.Видимость = Рез.ВСтопЛисте;
		Элементы.ПредупреждениеБлокировки.Заголовок = "Контрагент находится в стоп-листе. Запись заявки запрещена. Добавлен " + Формат(Рез.Период, "ДФ=dd.MM.yy") + " " + Рез.Пользователь + " по причине: " + Рез.Комментарий;
	Иначе
		Элементы.ПредупреждениеБлокировки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		//ПараметрыЗапроса = Новый Соответствие;
		//ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		//ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		//ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		//ПараметрыЗапроса.Вставить("УказанРейс", Объект.ПереченьРейсов.Количество() > 0);
		//ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Объект.НаМоментЗаписиБылаЗадолженность);
		//ПараметрыЗапроса.Вставить("ИсточникЗаявки", Объект.ИсточникЗаявки);
		//ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		//ПараметрыЗапроса.Вставить("ПротоколНеУказан",НЕ ЗначениеЗаполнено(Объект.ПСЦ));
		//// Евросиб Фролов (16.11.2021 TASK№ №41969
		//ПараметрыЗапроса.Вставить("ЗапросНаКТК", Объект.ЗапросНаКТК);
		//// Евросиб Фролов)   
		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗаявку(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ


&НаСервере
Процедура ОбновитьОтображениеКолонокТЧ()
	
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//Элементы.СоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Ложь;
	//ок)
	Элементы.УдалитьСоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Ложь;
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024 
	
	//Евросиб Коханенко Н.А. 30.08.2024 (( #90192
	Элементы.СоставУслугиГруппаСредняяМиля.Видимость = (Объект.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре); 
	//Евросиб Коханенко Н.А. 30.08.2024 )) #90192 
	
	Если Объект.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре Тогда
		
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//Элементы.СоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Истина;
		//ок)
		Элементы.УдалитьСоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Истина;
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		
		// 1
		Элементы.СоставУслугиГруппаВагон.Видимость = (Объект.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка);
		
		//ДИТ Шевченко А.В. 57939 29.09.2022 -начало	
		//Элементы.СоставУслугиРелиз.Видимость = Ложь;
		Элементы.СоставУслугиРелиз.Видимость = Истина;
		//ДИТ Шевченко А.В. 57939 29.09.2022 -конец
		Элементы.СоставУслугиПломбы.Видимость = Истина;
		
		Элементы.СоставУслугиОтметкаОСменеПломбы.Видимость = Истина;
		Элементы.СоставУслугиКоносамент.Видимость = Истина;
		Элементы.СоставУслугиКоносаментКонтрагент.Видимость = Ложь;
		
		Элементы.СоставУслугиГруппаДатаВыдачиКлиентуСрокИспКлие.Видимость = Истина;
		Элементы.СоставУслугиГруппаУсловияПеревозки.Видимость = Истина;
		//Элементы.СоставУслугиГруппа9РасширеннаяПодсказка.Видимость = Ложь;
		Элементы.СоставУслугиГруппаПрибытиеНаТермATD.Видимость = Истина;
		Элементы.СоставУслугиГруппаСудноETA.Видимость = Истина;
		Элементы.СоставУслугиГруппаТерПрибытияДатаВыгрузки.Видимость = Истина;
		
		Элементы.СоставУслугиРодУпаковки1.Видимость = Ложь;
		Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаАвтоперевозкаNEW.Видимость = Истина;
		//Элементы.СоставУслугиГруппаПараметрыГрузо.Видимость = Ложь;
		Элементы.СоставУслугиГруппаОстальноеНеОтоб.Видимость = Ложь;
		
		Элементы.СоставУслугиТерминальныеУслугиПоПрибытию.Видимость = Ложь;
		Элементы.СоставУслугиОсобыеОтметки.Видимость = Истина;
		Элементы.СоставУслугиИнструкцииПоСдачеПорожнего.Видимость = Истина;
		//Элементы.СоставУслугиГрузополучательДопПол.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаПланПеренесенВЗаявк.Видимость = Истина;
		
	ИначеЕсли Объект.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре Тогда
		
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//Элементы.СоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Истина;
		//ок)
		Элементы.УдалитьСоставУслугиСобственностьПеревозимогоКТК.АвтоОтметкаНезаполненного = Истина;
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		
		// 2
		Элементы.СоставУслугиГруппаВагон.Видимость = (Объект.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка);
		
		//ДИТ Шевченко А.В. 57939 29.09.2022 -начало	
		//Элементы.СоставУслугиРелиз.Видимость = Ложь;
		Элементы.СоставУслугиРелиз.Видимость = Истина;
		//ДИТ Шевченко А.В. 57939 29.09.2022 -конец
		Элементы.СоставУслугиПломбы.Видимость = Ложь;
		
		Элементы.СоставУслугиОтметкаОСменеПломбы.Видимость = Ложь;
		//Евросиб - АСуслов 25.01.2023 10:42:15 #64693
		//(
		//Элементы.СоставУслугиКоносамент.Видимость = Ложь;
		Элементы.СоставУслугиКоносамент.Видимость = Истина;
		//)
		//Евросиб - АСуслов 25.01.2023 10:42:23 #64693
		Элементы.СоставУслугиКоносаментКонтрагент.Видимость = Ложь;
		
		Элементы.СоставУслугиГруппаДатаВыдачиКлиентуСрокИспКлие.Видимость = Истина;
		Элементы.СоставУслугиГруппаУсловияПеревозки.Видимость = Истина;
		//Элементы.СоставУслугиГруппа9РасширеннаяПодсказка.Видимость = Ложь;
		Элементы.СоставУслугиГруппаПрибытиеНаТермATD.Видимость = Ложь;
		Элементы.СоставУслугиГруппаСудноETA.Видимость = Ложь;
		Элементы.СоставУслугиГруппаТерПрибытияДатаВыгрузки.Видимость = Ложь;
		
		Элементы.СоставУслугиРодУпаковки1.Видимость = Ложь;
		//Евросиб Каблов 14.10.2020 ( Ticket#0209246
		//Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Ложь;
		Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Истина;
		//Евросиб Каблов 14.10.2020 )
		
		//Элементы.СоставУслугиГруппаАвтоперевозкаNEW.Видимость = Ложь;
		//Элементы.СоставУслугиГруппаПараметрыГрузаРасширеннаяПодсказка.Видимость = Ложь;
		Элементы.СоставУслугиГруппаОстальноеНеОтоб.Видимость = Ложь;
		
		Элементы.СоставУслугиТерминальныеУслугиПоПрибытию.Видимость = Ложь;
		Элементы.СоставУслугиОсобыеОтметки.Видимость = Истина;
		Элементы.СоставУслугиИнструкцииПоСдачеПорожнего.Видимость = Истина;
		//Элементы.СоставУслугиГрузополучательДопПоле.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаПланПеренесенВЗаявк.Видимость = Истина;
		
	ИначеЕсли Объект.ВидПеревозки = Справочники.ВидыПеревозок.Внутрироссийская Тогда
		
		// 3
		Элементы.СоставУслугиГруппаВагон.Видимость = (Объект.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка);
		
		Элементы.СоставУслугиРелиз.Видимость = Истина;
		Элементы.СоставУслугиПломбы.Видимость = Истина;
		
		Элементы.СоставУслугиОтметкаОСменеПломбы.Видимость = Ложь;
		Элементы.СоставУслугиКоносамент.Видимость = Ложь;
		Элементы.СоставУслугиКоносаментКонтрагент.Видимость = Ложь;
		
		Элементы.СоставУслугиГруппаДатаВыдачиКлиентуСрокИспКлие.Видимость = Истина;
		Элементы.СоставУслугиГруппаУсловияПеревозки.Видимость = Истина;
		//Элементы.СоставУслугиГруппаАвтоперевозк.Видимость = Истина;
		Элементы.СоставУслугиГруппаПрибытиеНаТермATD.Видимость = Ложь;
		Элементы.СоставУслугиГруппаСудноETA.Видимость = Ложь;
		Элементы.СоставУслугиГруппаТерПрибытияДатаВыгрузки.Видимость = Ложь;
		
		Элементы.СоставУслугиРодУпаковки1.Видимость = Истина;
		Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаАвтоперевозкаNEW.Видимость = Ложь;
		//Элементы.СоставУслугиГруппаПараметрыГрузо.Видимость = Ложь;
		Элементы.СоставУслугиГруппаОстальноеНеОтоб.Видимость = Ложь;
		
		Элементы.СоставУслугиТерминальныеУслугиПоПрибытию.Видимость = Истина;
		Элементы.СоставУслугиОсобыеОтметки.Видимость = Истина;
		Элементы.СоставУслугиИнструкцииПоСдачеПорожнего.Видимость = Истина;
		//Элементы.СоставУслугиГрузополучательДопПоле.Видимость = Истина;
		
		//Элементы.СоставУслугиГруппаПланПеренесенВЗаявк.Видимость = Истина;
		
	ИначеЕсли Объект.ВидПеревозки = Справочники.ВидыПеревозок.Транзит
		ИЛИ Объект.ВидПеревозки = Справочники.ВидыПеревозок.Импорт
		ИЛИ Объект.ВидПеревозки = Справочники.ВидыПеревозок.Экспорт Тогда
		
		// 4
		Элементы.СоставУслугиГруппаВагон.Видимость = (Объект.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка);
		
		Элементы.СоставУслугиРелиз.Видимость = Истина;
		Элементы.СоставУслугиПломбы.Видимость = Ложь;
		
		Элементы.СоставУслугиОтметкаОСменеПломбы.Видимость = Ложь;
		Элементы.СоставУслугиКоносамент.Видимость = Ложь;
		Элементы.СоставУслугиКоносаментКонтрагент.Видимость = Ложь;
		
		Элементы.СоставУслугиГруппаДатаВыдачиКлиентуСрокИспКлие.Видимость = Истина;
		Элементы.СоставУслугиГруппаУсловияПеревозки.Видимость = Истина;
		//Элементы.СоставУслугиГруппа9РасширеннаяПодсказка.Видимость = Ложь;
		Элементы.СоставУслугиГруппаПрибытиеНаТермATD.Видимость = Ложь;
		Элементы.СоставУслугиГруппаСудноETA.Видимость = Ложь;
		Элементы.СоставУслугиГруппаТерПрибытияДатаВыгрузки.Видимость = Ложь;
		
		Элементы.СоставУслугиРодУпаковки1.Видимость = Ложь;
		Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Истина;
		
		//Элементы.СоставУслугиГруппаАвтоперевозкаNEW.Видимость = Ложь;
		//Элементы.СоставУслугиГруппаПараметрыГрузо.Видимость = Ложь;
		Элементы.СоставУслугиГруппаОстальноеНеОтоб.Видимость = Ложь;
		
		Элементы.СоставУслугиТерминальныеУслугиПоПрибытию.Видимость = Ложь;
		Элементы.СоставУслугиОсобыеОтметки.Видимость = Истина;
		Элементы.СоставУслугиИнструкцииПоСдачеПорожнего.Видимость = Истина;
		//Элементы.СоставУслугиГрузополучательДопПол.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаПланПеренесенВЗаявк.Видимость = Истина;
		
	Иначе
		
		// 5
		Элементы.СоставУслугиГруппаВагон.Видимость = (Объект.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка);
		
		Элементы.СоставУслугиРелиз.Видимость = Истина;
		Элементы.СоставУслугиПломбы.Видимость = Истина;
		
		Элементы.СоставУслугиОтметкаОСменеПломбы.Видимость = Истина;
		Элементы.СоставУслугиКоносамент.Видимость = Истина;
		Элементы.СоставУслугиКоносаментКонтрагент.Видимость = Истина;
		
		Элементы.СоставУслугиГруппаДатаВыдачиКлиентуСрокИспКлие.Видимость = Истина;
		Элементы.СоставУслугиГруппаУсловияПеревозки.Видимость = Истина;
		//Элементы.СоставУслугиГруппаАвтоперевозк.Видимость = Истина;
		Элементы.СоставУслугиГруппаПрибытиеНаТермATD.Видимость = Истина;
		Элементы.СоставУслугиГруппаСудноETA.Видимость = Истина;
		Элементы.СоставУслугиГруппаТерПрибытияДатаВыгрузки.Видимость = Истина;
		
		Элементы.СоставУслугиРодУпаковки1.Видимость = Истина;
		Элементы.СоставУслугиГруппаГрузоотпрПолуч.Видимость = Истина;
		
		//Элементы.СоставУслугиГруппаАвтоперевозкаNEW.Видимость = Ложь;
		//Элементы.СоставУслугиГруппаПараметрыГрузаРасширеннаяПодсказка.Видимость = Истина;
		Элементы.СоставУслугиГруппаОстальноеНеОтоб.Видимость = Истина;
		
		Элементы.СоставУслугиТерминальныеУслугиПоПрибытию.Видимость = Истина;
		Элементы.СоставУслугиОсобыеОтметки.Видимость = Истина;
		Элементы.СоставУслугиИнструкцииПоСдачеПорожнего.Видимость = Истина;
		//Элементы.СоставУслугиГрузополучательДопПоле.Видимость = Ложь;
		
		//Элементы.СоставУслугиГруппаПараметрыГрузаРасширеннаяПодсказка.Видимость = Истина;
		
	КонецЕсли; 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьКалькуляциюИУслугуПоУмолчанию(Протокол)
	
	Результат = Новый Массив;
	
	Для каждого Стр из Протокол.Калькуляции Цикл
		
		//Если Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
		//	
		//	Результат.Добавить(Новый Структура("Калькуляция, Услуга", Стр.Калькуляция, Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга));
		//	
		//КонецЕсли;	

		// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( 
		УслугаВКалькуляции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Калькуляция, "ОсновнаяУслуга");
		// Евросиб Рыбьяков К.А. 02.07.2024 ))
		
		//ДИТ, Беляев СЮ, Ticket#0291639, 10-11-2022, начало
		//УслугаВКалькуляции = Справочники.Номенклатура.ПустаяСсылка();
		//Если Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
		//	УслугаВКалькуляции = Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
		//КонецЕсли;	
		Результат.Добавить(Новый Структура("Калькуляция, Услуга", Стр.Калькуляция, УслугаВКалькуляции));
		//ДИТ, Беляев СЮ, Ticket#0291639, 10-11-2022, конец
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПринадлежностьТЕПриИзменении(Элемент)
	
	// ДИТ US 76659 ТА 77825 Сержантова А.С. Начало: 26.02.2024
	// Было:
	//ТекД = Элементы.СоставУслуги.ТекущиеДанные; 
	//Стало:
	Если ТипЗнч(Элемент) = Тип("ДанныеФормыЭлементКоллекции") Тогда
	    ТекД = Элемент; 
	Иначе
	    ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	КонецЕсли;
	// ДИТ US 76659 ТА 77825 Сержантова А.С. Конец: 26.02.2024
	
	Текд.ВидСобственности = "";
	//Текд.ДатаВзятия = "";
	Если ТекД.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") Тогда
		Текд.НормативноеИспользование = "";
	КонецЕсли;
	
	//ДИТ Шевченко А.В. 60130 23.11.2022 -начало
	Если ТекД.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") Тогда
		ТекД.ВладелецКТК = Объект.Контрагент;
	ИначеЕсли
		ТекД.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба") Тогда
		ТекД.ВладелецКТК = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	//ДИТ Шевченко А.В. 60130 23.11.2022 -конец
	
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	ЗаполнитьСвязанныеПоляПринадлежностьТЕ(ТекД.ПолучитьИдентификатор());
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	
	ОбновитьКаскадныйФильтр();
	
	ВидимостьКолонокПринадлежности(); 
	
	//Субботин 77659 05.12.2023 Начало
	УбратьКТКИзЗапросаКТК(Объект.СоставУслуги.НайтиПоИдентификатору(Элементы.СоставУслуги.ТекущаяСтрока));	
	//Субботин 77659 05.12.2023 Конец
	
КонецПроцедуры

// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
&НаСервере
Процедура ЗаполнитьСвязанныеПоляПринадлежностьТЕ(Знач ДанныеСтроки)
	
	Если ТипЗнч(ДанныеСтроки) <> Тип("Массив") Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(ДанныеСтроки);
	Иначе
		МассивСтрок = ДанныеСтроки;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивСтрок Цикл
		
		Если ТипЗнч(ЭлементМассива) = Тип("Число") Тогда
			СтрокаТЧ = Объект.СоставУслуги.НайтиПоИдентификатору(ЭлементМассива);
		Иначе
			СтрокаТЧ = ЭлементМассива;
		КонецЕсли;
		
		Если СтрокаТЧ.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
			// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
			//ок(
			//СтрокаТЧ.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.SOC;
			//ок)
			СтрокаТЧ.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.SOC;
			// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
			СтрокаТЧ.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский;
			СтрокаТЧ.ВладелецКТК = Объект.Контрагент;
		// ДИТ US 76659 ТА 76890 Сержантова А.С. Начало: 31.10.2023
		// Было:
		//ИначеЕсли СтрокаТЧ.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба Тогда 
		//Стало:
		ИначеЕсли СтрокаТЧ.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба 
			или СтрокаТЧ.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.ПустаяСсылка() Тогда	
		// ДИТ US 76659 ТА 76890 Сержантова А.С. Конец: 31.10.2023
			// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
			//ок(
			//СтрокаТЧ.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.COC;
			//ок)
			СтрокаТЧ.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.COC;
			// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерКТК) Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Контейнер", СтрокаТЧ.НомерКТК);
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ВидСобственности,
				|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК Собственник
				|ИЗ
				|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
				|			,
				|			КТК = &Контейнер) КАК стоки_ТекущиеДанныеСрезПоследних
				|ГДЕ
				|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.Возвращен)";
				
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					СтрокаТЧ.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
					СтрокаТЧ.ВладелецКТК = Справочники.Контрагенты.ПустаяСсылка();
				Иначе
					Выборка = Результат.Выбрать();
					Выборка.Следующий();
					
					СтрокаТЧ.ВидСобственности = Выборка.ВидСобственности;
					СтрокаТЧ.ВладелецКТК = Выборка.Собственник;
				КонецЕсли;
				
			Иначе
				СтрокаТЧ.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
				СтрокаТЧ.ВладелецКТК = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
		Иначе
			// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
			//ок(
			//СтрокаТЧ.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.ПустаяСсылка();
			//ок)
			СтрокаТЧ.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.ПустаяСсылка();
			// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
			СтрокаТЧ.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
			СтрокаТЧ.ВладелецКТК = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДИТ 65580 Давудов М.А. Конец: 23.02.2023

// ДИТ US 76659 ТА 77825 Сержантова А.С. 26.02.2024
&НаСервере
Процедура ЗаполнитьСобственностьПриВыбореКонтейнера(ИндексСтроки = Неопределено)
	
	Если ИндексСтроки <> Неопределено Тогда
		КонтейнерыВСтроках = Новый Массив; 
		ДанныеСтроки = Объект.СоставУслуги.НайтиПоИдентификатору(ИндексСтроки);
		КонтейнерыВСтроках.Добавить(ДанныеСтроки.НомерКТК);
	Иначе
		КонтейнерыВСтроках = Объект.СоставУслуги.Выгрузить(,"НомерКТК").ВыгрузитьКолонку("НомерКТК");
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контейнеры", КонтейнерыВСтроках);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЕ.Ссылка КАК КТК
	|ПОМЕСТИТЬ ВТ_Контенеры
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	ТЕ.Ссылка В(&Контейнеры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК ВидСобственности,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК Собственник,
	|	ЕСТЬNULL(стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации, ЛОЖЬ) КАК ВЭксплуатации,
	|	ВТ_Контенеры.КТК КАК КТК
	|ИЗ
	|	ВТ_Контенеры КАК ВТ_Контенеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&Контейнеры)) КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО ВТ_Контенеры.КТК = стоки_ТекущиеДанныеСрезПоследних.КТК";
	
	ДанныеПоКТК = Запрос.Выполнить().Выбрать();
	Пока ДанныеПоКТК.Следующий() Цикл
		СтрокиПоКТК = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", ДанныеПоКТК.КТК)); 
		Для каждого СтрокаУслуг Из СтрокиПоКТК Цикл  
			// для строк по релизу клиента оставляем принадлежность "как есть"
			Если ЗначениеЗаполнено(СтрокаУслуг.Релиз) Тогда
			    СтрокаУслуг.ВидСобственности = ДанныеПоКТК.ВидСобственности;
				СтрокаУслуг.ВладелецКТК = ДанныеПоКТК.Собственник;
			Иначе
				Если ДанныеПоКТК.ВЭксплуатации Тогда
					//Если ДанныеПоКТК.ВидСобственности = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
					//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало
					Если ДанныеПоКТК.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский Тогда
					//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец
						СтрокаУслуг.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента;
						// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
						//ок(
						//СтрокаУслуг.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.SOC;
						//ок)
						СтрокаУслуг.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.SOC;
						// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
						СтрокаУслуг.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский;
						СтрокаУслуг.ВладелецКТК = Объект.Контрагент;
					Иначе
						СтрокаУслуг.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
						// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
						//ок(
						//СтрокаУслуг.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.COC; 
						//ок)
						СтрокаУслуг.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.COC;
						// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
						СтрокаУслуг.ВидСобственности = ДанныеПоКТК.ВидСобственности;
						СтрокаУслуг.ВладелецКТК = ДанныеПоКТК.Собственник;
					КонецЕсли;
				Иначе  
					// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
					//ок(
					//СтрокаУслуг.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.ПустаяСсылка();
					//ок)
					СтрокаУслуг.УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.ПустаяСсылка();
					// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
					СтрокаУслуг.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.ПустаяСсылка();
					СтрокаУслуг.ВидСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
					СтрокаУслуг.ВладелецКТК = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКолонокПринадлежности()
	
	ПараметрыОтбора = Новый Структура("ПринадлежностьТЕ", ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба"));
	НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 Тогда
		Элементы.СоставУслугиВидСобственности.Видимость = Истина;
		//Элементы.СоставУслугиДатаВзятия.Видимость = Истина;
		Элементы.СоставУслугиНормативноеИспользование.Видимость = Истина;
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
			Элементы.СоставУслугиВладелецКТК.Видимость = Истина;
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
	Иначе
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//Элементы.СоставУслугиВидСобственности.Видимость = Ложь;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		//Элементы.СоставУслугиДатаВзятия.Видимость = Ложь;
		Элементы.СоставУслугиНормативноеИспользование.Видимость = Ложь;
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//Если НЕ ЭтоСибур Тогда
		//	Элементы.СоставУслугиВладелецКТК.Видимость = Ложь;
		//КонецЕсли;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
	КонецЕсли;
	
	//Элементы.СоставУслугиРеестрКлиента.Видимость = КлиентИзСписка(Объект.Контрагент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлиентИзСписка(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФормированиеФинДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	               |ГДЕ
	               |	ФормированиеФинДокументов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Клиент);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
	
&НаКлиенте
Процедура СоставУслугиТипКТКПриИзменении(Элемент)
	
	ИдентификаторСтроки = Элементы.СоставУслуги.ТекущаяСтрока;
	Если ИдентификаторСтроки <> Неопределено Тогда
		СоставУслугиНомерКТКПриИзмененииСервер(ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура СоставУслугиНомерКТКПриИзмененииСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.СоставУслуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ЗначениеРеквизитаОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ТипКТК, "РазмерКТК");
	Если ЗначениеЗаполнено(ЗначениеРеквизитаОбъекта) Тогда
		ТекДанные.РазмерКТК = ЗначениеРеквизитаОбъекта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиНомерКТКПриИзменении(Элемент)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;  
	
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 16.02.2024
	Если ТипЗнч(Элемент) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ТекД = Элемент;
	КонецЕсли;
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 16.02.2024
	
	Если ТекД <> неопределено Тогда
		
		ТипКТК = ПолучитьТипКТК(ТекД.НомерКТК);
		ЗаполнитьЗначенияСвойств(ТекД, ТипКТК);
		
		ОбновитьСВВиТДТ_Клиент(ТекД.НомерКТК);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
		НайтиКлючАналитикиПеревозкиКлиент(ТекД);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
		
		// ДИТ US 76659 ТА 77825 Сержантова А.С. Начало: 26.02.2024
		// Было:
		//// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(ТекД.ПолучитьИдентификатор());
		//// ДИТ 65580 Давудов М.А. Конец: 23.02.2023 
		//Стало:
		ЗаполнитьСобственностьПриВыбореКонтейнера(ТекД.ПолучитьИдентификатор());
		// ДИТ US 76659 ТА 77825 Сержантова А.С. Конец: 26.02.2024
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипКТК(КТК)
	
	Результат = Новый Структура("ТипКТК, РазмерКТК");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЕ.ТипТЕ КАК ТипТЕ,
	               |	ТЕ.ТипТЕ.РазмерКТК КАК РазмерКТК
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	ТЕ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", КТК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ТипКТК = Выборка.ТипТЕ;
		Результат.РазмерКТК = Выборка.РазмерКТК;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоставУслугиРазмерКТКПриИзменении(Элемент)
	
	ИдентификаторСтроки = Элементы.СоставУслуги.ТекущаяСтрока;
	Если ИдентификаторСтроки <> Неопределено Тогда
		
		ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТекДанные.РазмерКТК) Тогда
			ТекДанные.НомерКТК = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнятьСтрокиПоПервойСтроке(Команда)
	
	ЗаполнятьПоПервойСтроке = НЕ ЗаполнятьПоПервойСтроке;
	Элементы.СоставУслугиЗаполнятьСтрокиПоПервойСтроке.ЦветФона = ?(ЗаполнятьПоПервойСтроке, ЦветКнопки_Выделенный, ЦветКнопки_Исходный);
	
КонецПроцедуры


&НаКлиенте
Процедура СоставУслугиПриИзменении(Элемент)
	 
	МассивРазрешенныхПолей = Новый Массив;
	МассивРазрешенныхПолей.Добавить("ПодтвержденоЗаказчику");
	МассивРазрешенныхПолей.Добавить("Услуга");
	МассивРазрешенныхПолей.Добавить("ПринадлежностьТЕ");
	МассивРазрешенныхПолей.Добавить("ВидСобственности");
	//МассивРазрешенныхПолей.Добавить("ДатаВзятия");
	МассивРазрешенныхПолей.Добавить("НормативноеИспользование");
	МассивРазрешенныхПолей.Добавить("РазмерКТК");
	МассивРазрешенныхПолей.Добавить("ТипКТК");
	МассивРазрешенныхПолей.Добавить("ПунктОтправления");
	МассивРазрешенныхПолей.Добавить("СтанцияОтправления");
	МассивРазрешенныхПолей.Добавить("ПунктНазначения");
	МассивРазрешенныхПолей.Добавить("СтанцияНазначения");
	МассивРазрешенныхПолей.Добавить("Грузополучатель");
	МассивРазрешенныхПолей.Добавить("Груз");
	МассивРазрешенныхПолей.Добавить("Груженый");
	МассивРазрешенныхПолей.Добавить("КодГруза");
	МассивРазрешенныхПолей.Добавить("ТерминальныеУслугиПоПрибытию");
	МассивРазрешенныхПолей.Добавить("ОсобыеОтметки");
	МассивРазрешенныхПолей.Добавить("УсловияПеревозки");
	МассивРазрешенныхПолей.Добавить("УсловияПеревозкиНазначение"); 
	МассивРазрешенныхПолей.Добавить("ИнструкцииПоСдачеПорожнего");
	МассивРазрешенныхПолей.Добавить("ВладелецКТК");
	МассивРазрешенныхПолей.Добавить("Калькуляция");
	МассивРазрешенныхПолей.Добавить("ДатаВыдачи");
	МассивРазрешенныхПолей.Добавить("СрокОтправкиУведомления");
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	
	//Если СтрНайти(Элемент.ТекущийЭлемент.Имя, "ДатаВзятия") > 0 Тогда
	//	ТекД.ДатаВзятия = ТекД.ДатаВзятия;
	//КонецЕсли;
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];
		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.СоставУслуги.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			Если РезПроверки = Истина Тогда
				
				//Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.03.2023
				НайтиКлючАналитикиПеревозкиКлиент(Объект[ИмяТЧ][Сч]);
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.03.2023
				
				//Субботин В.А. 58332 08.06.23  Начало
				Если Сч=0 тогда 
					продолжить;
				КонецЕсли;       
				
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 07.03.2024 
				Если БлокируемыеПоляКлючаАналитикиПеревозки.НайтиПоЗначению("" + ИмяТЧ + "." + ИмяПоля) <> Неопределено Тогда
					Если ПолеКлючаНедоступноДляИзменения(Объект[ИмяТЧ][Сч], ИмяПоля) Тогда
						Продолжить;      
					КонецЕсли;
				КонецЕсли;
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 07.03.2024

				Элементы.СоставУслуги.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				Попытка
					Выполнить(""+Элемент.ТекущийЭлемент.Имя + "ПриИзменении"+"(Объект[ИмяТЧ][Сч])");
				Исключение 
					//Субботин В.А. 58332 08.06.23  Конец 
				КонецПопытки
						
			КонецЕсли; 
		КонецЦикла;
		//Субботин В.А. 58332 08.06.23  Начало
		Элементы.СоставУслуги.ТекущаяСтрока = Объект[ИмяТЧ][0].ПолучитьИдентификатор();
		текД = Элементы.СоставУслуги.ТекущиеДанные; 
		//Субботин В.А. 58332 08.06.23  Конец 
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];       
		
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 13.12.2023
		Если ИмяПоля = "Груз" Тогда
			НовоеЗначениеКодаГруза = ПолучитьЕТСНГГруза(НовоеЗначение);   
		ИначеЕсли ИмяПоля = "Калькуляция" Тогда
			ДанныеДляЗаполненияСвязанныхПолей = ПолучитьДанныеКалькуляции(НовоеЗначение);    
		ИначеЕсли ИмяПоля = "КодГруза" Тогда   
			НовоеЗначениеГруза = ПолучитьГрузПоЕТСНГ(НовоеЗначение); 
		КонецЕсли;   
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 13.12.2023
		
		СтрокаПройдена = Ложь;		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.СоставУслуги.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			
			СтрокаПройдена = СтрокаПройдена ИЛИ Элементы.СоставУслуги.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			
			//Евросиб Коханенко Н.А. 13.06.2024 (( #83866
			Если ЗначениеЗаполнено(Объект[ИмяТЧ][Сч].ПеренесенВЗаявку) Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 13.06.2024 )) #83866 

			Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда 
				
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 07.03.2024 
				Если БлокируемыеПоляКлючаАналитикиПеревозки.НайтиПоЗначению("" + ИмяТЧ + "." + ИмяПоля) <> Неопределено Тогда
					КлючАналитики = Объект[ИмяТЧ][Сч]["КлючАналитикиПеревозки"];					
					Если ПолеКлючаНедоступноДляИзменения(Объект[ИмяТЧ][Сч], ИмяПоля) Тогда
						Продолжить;      
					КонецЕсли;
				КонецЕсли;
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 07.03.2024
				
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.03.2023
				НайтиКлючАналитикиПеревозкиКлиент(Объект[ИмяТЧ][Сч]);
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.03.2023    
				
				// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 13.12.2023
				// Заполнение полей, связанных с измененным
				Если ИмяПоля = "Груз" и ИмяТЧ = "СоставУслуги" Тогда
					Объект[ИмяТЧ][Сч]["КодГруза"] = НовоеЗначениеКодаГруза; 
					
					НаименованиеГруза = ВРег(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НовоеЗначение, "Наименование"));
					Если СтрНайти(НаименованиеГруза, "КОНТЕЙНЕРЫ УНИВЕРСАЛЬНЫЕ ПОРОЖНИЕ") <> 0 
						или не ЗначениеЗаполнено(Объект[ИмяТЧ][Сч]["Груз"]) Тогда
						Объект[ИмяТЧ][Сч]["Груженый"] = Ложь;	
					Иначе	
						Объект[ИмяТЧ][Сч]["Груженый"] = Истина;
					КонецЕсли;        
				ИначеЕсли ИмяПоля = "КодГруза" и ИмяТЧ = "СоставУслуги" Тогда
					Объект[ИмяТЧ][Сч]["Груз"] = НовоеЗначениеГруза; 
					
					НаименованиеГруза = ВРег(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НовоеЗначениеГруза, "Наименование"));
					Если СтрНайти(НаименованиеГруза, "КОНТЕЙНЕРЫ УНИВЕРСАЛЬНЫЕ ПОРОЖНИЕ") <> 0 
						или не ЗначениеЗаполнено(Объект[ИмяТЧ][Сч]["Груз"]) Тогда
						Объект[ИмяТЧ][Сч]["Груженый"] = Ложь;	
					Иначе	
						Объект[ИмяТЧ][Сч]["Груженый"] = Истина;
					КонецЕсли;
				ИначеЕсли ИмяПоля = "Калькуляция" и ИмяТЧ = "СоставУслуги" Тогда
					ЗаполненныеПоля = Новый Массив;			
					Если ЗначениеЗаполнено(Объект[ИмяТЧ][Сч]["СтанцияОтправления"]) Тогда
						ЗаполненныеПоля.Добавить("СтанцияОтправления");
					КонецЕсли;
					Если ЗначениеЗаполнено(Объект[ИмяТЧ][Сч]["СтанцияНазначения"]) Тогда
						ЗаполненныеПоля.Добавить("СтанцияНазначения");
					КонецЕсли;
					ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
					ЗаполнитьЗначенияСвойств(Объект[ИмяТЧ][Сч], ДанныеДляЗаполненияСвязанныхПолей,, ИменаЗаполненныхПолей); 
				КонецЕсли;
				// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 13.12.2023 
				
				// ДИТ  US 78243 ТА 80591 Сержантова А.С. Начало: 06.02.2024
				Попытка
					Выполнить(""+Элемент.ТекущийЭлемент.Имя + "ПриИзменении"+"(Объект[ИмяТЧ][Сч])");
				Исключение 
				КонецПопытки  
				// ДИТ  US 78243 ТА 80591 Сержантова А.С. Конец: 06.02.2024

			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекД.Калькуляция) И НЕ ЗначениеЗаполнено(ТекД.НормативноеИспользование) Тогда
		ТекД.НормативноеИспользование = КолвоДнейКлиенту(ТекД.Калькуляция);
	КонецЕсли;       
	
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 24.01.2024 
	//Перенос значений по водителям из ТЧ Состав услуг в таблицы по первой/последней миле на вкладке запрос на КТК
	Если Объект.ЗапросНаКТК Тогда
		ЗаполнитьДанныеТаблицАвтоперевозки(ТекД, Истина);
	КонецЕсли;
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 24.01.2024
	
КонецПроцедуры   

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024 
&НаКлиенте
Процедура ЗаполнитьДанныеТаблицАвтоперевозки(ДанныеСтрокиУслуг, ДобавлятьСтрокиВТС = Ложь)  
	
	СтруктураОтбора = Новый Структура("КлючАналитикиПеревозки", ДанныеСтрокиУслуг.КлючАналитикиПеревозки);
	СтрокиПервойМили = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураОтбора);
	СтрокиПоследнейМили = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(СтруктураОтбора);  
	
	СтрокиЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("РелизКлиента", ДанныеСтрокиУслуг.Релиз)); 
	ИдентификаторСтрокиЗапроса = Неопределено;
	Если СтрокиЗапроса.Количество() > 0 Тогда
		ИдентификаторСтрокиЗапроса = СтрокиЗапроса[0].ИдентификаторСтроки;	
	КонецЕсли;
	
	Если СтрокиПервойМили.Количество() Тогда 
		Для каждого СтрокаПервойМили Из СтрокиПервойМили Цикл
			СтрокаПервойМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителя; 		
			СтрокаПервойМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвто; 		
			СтрокаПервойМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоперевозчикПерваяМиля; 	
			Если ТипЗнч(СтрокаПервойМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
				ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаПервойМили.Автоперевозчик, "ИНН, КПП");
				СтрокаПервойМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
				СтрокаПервойМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024
			//Иначе
			//	СтрокаПервойМили.ИНН = "";
			//	СтрокаПервойМили.КПП = ""; 
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024
			КонецЕсли;
		КонецЦикла;  
	ИначеЕсли ДобавлятьСтрокиВТС и ИдентификаторСтрокиЗапроса <> Неопределено 
		и ДанныеСтрокиУслуг.ПерваяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") 
		// ДИТ US 78243 ТА 80591 Сержантова А.С. Начало: 07.02.2024
		и (ЗначениеЗаполнено(ДанныеСтрокиУслуг.АвтоперевозчикПерваяМиля) или ЗначениеЗаполнено(ДанныеСтрокиУслуг.НомерАвто) 
		или ЗначениеЗаполнено(ДанныеСтрокиУслуг.ФИОВодителя)) Тогда
		// ДИТ US 78243 ТА 80591 Сержантова А.С. Конец: 07.02.2024
		НС = Объект.ТранспортныеСредства.Добавить();   
		НС.КлючАналитикиПеревозки = ДанныеСтрокиУслуг.КлючАналитикиПеревозки;
		НС.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителя; 		
		НС.РегНомерТС = ДанныеСтрокиУслуг.НомерАвто; 	
		НС.ИдентификаторСтрокиЗапроса = ИдентификаторСтрокиЗапроса;
		НС.Автоперевозчик = ДанныеСтрокиУслуг.АвтоперевозчикПерваяМиля; 
		Если ТипЗнч(НС.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
			ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(НС.Автоперевозчик, "ИНН, КПП");
			НС.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
			НС.КПП = ЗначенияРеквизитовКонтрагента.КПП;
		Иначе
			НС.ИНН = "";
			НС.КПП = "";
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокиПоследнейМили.Количество() Тогда 
		Для каждого СтрокаПоследнейМили Из СтрокиПоследнейМили Цикл
			СтрокаПоследнейМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителяВыгрузка; 		
			СтрокаПоследнейМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвтоВыгрузка; 		
			СтрокаПоследнейМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоПеревозчик; 	
			Если ТипЗнч(СтрокаПоследнейМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
				ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаПоследнейМили.Автоперевозчик, "ИНН, КПП");
				СтрокаПоследнейМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
				СтрокаПоследнейМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;   
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024
			//Иначе
			//	СтрокаПоследнейМили.ИНН = "";
			//	СтрокаПоследнейМили.КПП = ""; 
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024
			КонецЕсли;
		КонецЦикла;   
	ИначеЕсли ДобавлятьСтрокиВТС и ИдентификаторСтрокиЗапроса <> Неопределено 
		и ДанныеСтрокиУслуг.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") 
		// ДИТ US 78243 ТА 80591 Сержантова А.С. Начало: 07.02.2024
		и (ЗначениеЗаполнено(ДанныеСтрокиУслуг.Автоперевозчик) или ЗначениеЗаполнено(ДанныеСтрокиУслуг.НомерАвтоВыгрузка) 
		или ЗначениеЗаполнено(ДанныеСтрокиУслуг.ФИОВодителяВыгрузка)) Тогда
		// ДИТ US 78243 ТА 80591 Сержантова А.С. Конец: 07.02.2024
		НС = Объект.ТранспортныеСредстваПоследняяМиля.Добавить();   
		НС.КлючАналитикиПеревозки = ДанныеСтрокиУслуг.КлючАналитикиПеревозки;
		НС.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителяВыгрузка; 		
		НС.РегНомерТС = ДанныеСтрокиУслуг.НомерАвтоВыгрузка; 
		НС.ИдентификаторСтрокиЗапроса = ИдентификаторСтрокиЗапроса;
		НС.Автоперевозчик = ДанныеСтрокиУслуг.АвтоПеревозчик; 	
		Если ТипЗнч(НС.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
			ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(НС.Автоперевозчик, "ИНН, КПП");
			НС.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
			НС.КПП = ЗначенияРеквизитовКонтрагента.КПП;   
		Иначе
			НС.ИНН = "";
			НС.КПП = "";
		КонецЕсли;
	КонецЕсли;
	
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
	СтруктураОтбора.Вставить("ЭтапПеревозки", ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"));
	СтруктураОтбора.Вставить("КлючАналитикиПеревозки", ДанныеСтрокиУслуг.КлючАналитикиПеревозки);	
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
	СтрокиСиламиЕвросиб = ТранспортныеСредстваСиламиЕвросиб.НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиСиламиЕвросиб.Количество() Тогда 
		Для каждого СтрокаМили Из СтрокиСиламиЕвросиб Цикл  
			СтрокаМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителя; 		
			СтрокаМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвто; 		
			СтрокаМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоперевозчикПерваяМиля; 	
			Если ТипЗнч(СтрокаМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
				ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаМили.Автоперевозчик, "ИНН, КПП");
				СтрокаМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
				СтрокаМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024
			//Иначе
			//	СтрокаМили.ИНН = "";
			//	СтрокаМили.КПП = "";
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024
			КонецЕсли;
		КонецЦикла; 
	Иначе  
		СтрокиЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("РелизКлиента", ДанныеСтрокиУслуг.Релиз));
		Если СтрокиЗапроса.Количество() > 0 и ЗначениеЗаполнено(СтрокиЗапроса[0].ИдентификаторСтроки) Тогда 
			
			Если ДанныеСтрокиУслуг.ПерваяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
				СтрокаПервойМили = ТранспортныеСредстваСиламиЕвросиб.Добавить();  
				СтрокаПервойМили.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"); 
				СтрокаПервойМили.КлючАналитикиПеревозки = ДанныеСтрокиУслуг.КлючАналитикиПеревозки; 
				СтрокаПервойМили.ИдентификаторСтрокиЗапроса = СтрокиЗапроса[0].ИдентификаторСтроки;
				СтрокаПервойМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителя; 		
				СтрокаПервойМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвто; 		
				СтрокаПервойМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоперевозчикПерваяМиля; 	
				Если ТипЗнч(СтрокаПервойМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
					ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаПервойМили.Автоперевозчик, "ИНН, КПП");
					СтрокаПервойМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
					СтрокаПервойМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;
				Иначе
					СтрокаПервойМили.ИНН = "";
					СтрокаПервойМили.КПП = "";
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;   
	
	СтруктураОтбора.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля");
	СтрокиСиламиЕвросиб = ТранспортныеСредстваСиламиЕвросиб.НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиСиламиЕвросиб.Количество() Тогда 
		Для каждого СтрокаМили Из СтрокиСиламиЕвросиб Цикл  
			СтрокаМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителяВыгрузка; 		
			СтрокаМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвтоВыгрузка; 		
			СтрокаМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоПеревозчик; 	
			Если ТипЗнч(СтрокаМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
				ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаМили.Автоперевозчик, "ИНН, КПП");
				СтрокаМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
				СтрокаМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;   
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024
			//Иначе
			//	СтрокаМили.ИНН = "";
			//	СтрокаМили.КПП = ""; 
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024
			КонецЕсли;
		КонецЦикла; 
	Иначе  
		СтрокиЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("РелизКлиента", ДанныеСтрокиУслуг.Релиз));
		Если СтрокиЗапроса.Количество() > 0 и ЗначениеЗаполнено(СтрокиЗапроса[0].ИдентификаторСтроки) Тогда 
			Если ДанныеСтрокиУслуг.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
				СтрокаПоследнейМили = ТранспортныеСредстваСиламиЕвросиб.Добавить();  
				СтрокаПоследнейМили.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"); 
				СтрокаПоследнейМили.КлючАналитикиПеревозки = ДанныеСтрокиУслуг.КлючАналитикиПеревозки; 
				СтрокаПоследнейМили.ИдентификаторСтрокиЗапроса = СтрокиЗапроса[0].ИдентификаторСтроки;
				СтрокаПоследнейМили.ФИОВодителя = ДанныеСтрокиУслуг.ФИОВодителяВыгрузка; 		
				СтрокаПоследнейМили.РегНомерТС = ДанныеСтрокиУслуг.НомерАвтоВыгрузка; 		
				СтрокаПоследнейМили.Автоперевозчик = ДанныеСтрокиУслуг.АвтоПеревозчик; 	
				Если ТипЗнч(СтрокаПоследнейМили.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
					ЗначенияРеквизитовКонтрагента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(СтрокаПоследнейМили.Автоперевозчик, "ИНН, КПП");
					СтрокаПоследнейМили.ИНН = ЗначенияРеквизитовКонтрагента.ИНН; 
					СтрокаПоследнейМили.КПП = ЗначенияРеквизитовКонтрагента.КПП;
				Иначе
					СтрокаПоследнейМили.ИНН = "";
					СтрокаПоследнейМили.КПП = "";
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;   
	
	УстановитьОтборТранспортныхСредств();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КолвоДнейКлиенту(ТекКалькуляция)
	Возврат ТекКалькуляция.ММ_КалькуляцияКТКСоставляющей.Итог("ДлительностьДней");
КонецФункции
	
&НаКлиенте
Процедура ДобавитьБезномерныеПозиции(Команда)
	
	ОпОп = новый ОписаниеОповещения("ОбработкаДобавленияБезномерныхПозиций", ЭтаФорма);
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Начало: 16.02.2024
	// Было:
	//ОткрытьФорму("Документ.Заявка.Форма.ФормаДобавленияБезномерныхПозиций", ,, ЭтаФорма.УникальныйИдентификатор, ,,ОпОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Стало: 
	ПараметрыОткрытия = Новый Структура("ОткрытиеИзЗаявки", Истина);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДобавленияБезномерныхПозиций",ПараметрыОткрытия,, ЭтаФорма.УникальныйИдентификатор, ,,ОпОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Конец: 16.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияБезномерныхПозиций(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда возврат; КонецЕсли;
	
	//Если параметр1.Поведение = 1 Тогда Объект.СоставУслуги.Очистить(); КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
	Если Параметр1.Поведение = 1 Тогда
		УдалитьСтрокиНеВключенныеВСделку();
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец
	
	Для Сч = 1 По параметр1.Количество Цикл
		НСтр = Объект.СоставУслуги.Добавить();
		НСтр.РазмерКТК = параметр1.Размер;
		НСтр.ТипКТК = параметр1.Тип;
		НСтр.Услуга = УслугаПоУмолчанию;
		НСтр.Калькуляция = КалькуляцияПоУмолчанию;
		НСтр.ТипВагона = Параметр1.ТипВагонов;
		НСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор()); 
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
		НайтиКлючАналитикиПеревозкиКлиент(нСтр);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023
	КонецЦикла;
	
КонецПроцедуры
//Субботин 77659 25.01.2024 Конец


//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
&НаКлиенте
Процедура УдалитьСтрокиНеВключенныеВСделку()
	МассивГУИД = Новый Массив;
	Для каждого СтрокаСоставУслуги из Объект.СоставУслуги Цикл
		МассивГУИД.Добавить(СтрокаСоставУслуги.ГУИДСтроки);
	КонецЦикла;
	
	СтруктураРезультатПроверки = СтрокиВключенныеВСделки(Объект.Ссылка, МассивГУИД);
	МассивГУИДСтрокВключенныхВСделку = СтруктураРезультатПроверки.ГУИДыСтрокЗаявки;
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаСоставУслуги из Объект.СоставУслуги Цикл
		Если МассивГУИДСтрокВключенныхВСделку.Найти(СтрокаСоставУслуги.ГУИДСтроки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивУдаляемыхСтрок.Добавить(СтрокаСоставУслуги);
	КонецЦикла;
	
	Для каждого СтрокаСоставУслуги Из МассивУдаляемыхСтрок Цикл
		Объект.СоставУслуги.Удалить(СтрокаСоставУслуги);
	КонецЦикла;
	
	Если МассивГУИД.Количество() <> МассивУдаляемыхСтрок.Количество() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалены строки включенные в Сделку");
	КонецЕсли;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец

&НаКлиенте
Процедура ДобавитьИзEXCEL(Команда)
	
	ОпОп = новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДобавленияНомерных", ,, ЭтаФорма.УникальныйИдентификатор, ,,ОпОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхПозиций(ДанныеДляЗагрузки = неопределено, ДополнительныеПараметры = неопределено) Экспорт  
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 20.11.2023
	Если ДанныеДляЗагрузки = Неопределено или ДанныеДляЗагрузки.СтруктураКТК.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;   
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 20.11.2023
	
	Если ДанныеДляЗагрузки = Неопределено тогда возврат; КонецЕсли;
	
	//Если ДанныеДляЗагрузки.Поведение = 1 Тогда Объект.СоставУслуги.Очистить(); КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
	Если ДанныеДляЗагрузки.Поведение = 1 Тогда
		УдалитьСтрокиНеВключенныеВСделку();
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец
	
	Если ДанныеДляЗагрузки.Поведение = 3 Тогда 
		
		СвязатьКТКСоСтоками(, Ложь);
		
		Для каждого Стр из ДанныеДляЗагрузки.СтруктураКТК Цикл
			
			НСтр = Объект.СоставУслуги.Добавить();
			СписокПереносимыхПолей = Новый массив;
			Для каждого Стр22 из Стр Цикл
				Если ЗначениеЗаполнено(Стр22.Значение) И Стр22.Ключ <> "НомерРелиза" Тогда
					СписокПереносимыхПолей.Добавить(Стр22.Ключ);
				КонецЕсли;
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(НСтр, Стр, СтрСоединить(СписокПереносимыхПолей, ","));
			НСтр.Услуга = УслугаПоУмолчанию;
			НСтр.Калькуляция = КалькуляцияПоУмолчанию;
			НСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
			//НСтр.ДатаПостановкиВРезерв = НСтр.ДатаВзятия-1;
			//НСтр.ДатаПриемаВПользованиеПередПоставщиком = НСтр.ДатаВыдачи;
			
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
			НайтиКлючАналитикиПеревозкиКлиент(НСтр);
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
			
			// ДИТ US 76659 ТА 77825 Сержантова А.С. Начало: 26.02.2024
			ЗаполнитьСобственностьПриВыбореКонтейнера(НСтр.ПолучитьИдентификатор());
			// ДИТ US 76659 ТА 77825 Сержантова А.С. Конец: 26.02.2024
		КонецЦикла;
		
		ВидимостьКолонокПринадлежности();
		
		Возврат;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 07.11.2023
	// Заполнение пустых строк введеными номерами КТК
	ИначеЕсли ДанныеДляЗагрузки.Поведение = 4 Тогда  
	
		//Сначала посчитаем сколько строк нужно заполнить, если нет выделенных строк или всего одна выделенная   
		МассивИдентификаторов = Новый Массив;  
		КоличествоВыделенныхСтрок = Элементы.СоставУслуги.ВыделенныеСтроки.Количество();  
		КоличествоВставляемыхКТК = ДанныеДляЗагрузки.СтруктураКТК.Количество();
		Если КоличествоВыделенныхСтрок <= 1 Тогда
			НачальныйНомерЗаполнения = 0;	
			Если КоличествоВыделенныхСтрок = 1 Тогда
				НачальныйНомерЗаполнения = Элементы.СоставУслуги.ВыделенныеСтроки[0];
			КонецЕсли;  
			Пока НачальныйНомерЗаполнения <= (Объект.СоставУслуги.Количество() - 1) Цикл  
				МассивИдентификаторов.Добавить(НачальныйНомерЗаполнения);
				НачальныйНомерЗаполнения = НачальныйНомерЗаполнения + 1;	
			КонецЦикла;
		КонецЕсли;
		КоличествоСтрокЕслиНеВыделены = МассивИдентификаторов.Количество();    
		СтрокиКЗаполнению = ?(МассивИдентификаторов.Количество() = 0, Элементы.СоставУслуги.ВыделенныеСтроки, МассивИдентификаторов);
		
		//Если ввели больше строк КТК, чем выделено или чем есть в документе, то предупреждаем, что перенесем не все 
		Если (КоличествоВыделенныхСтрок > 1 
			и КоличествоВыделенныхСтрок < КоличествоВставляемыхКТК)
			или (КоличествоСтрокЕслиНеВыделены > 0 и КоличествоСтрокЕслиНеВыделены < КоличествоВставляемыхКТК) Тогда
			НеПеренесемКоличество = ?(КоличествоСтрокЕслиНеВыделены = 0,
									КоличествоВставляемыхКТК - КоличествоВыделенныхСтрок,
									КоличествоВставляемыхКТК - КоличествоСтрокЕслиНеВыделены);  
			ПараметрыПереноса = Новый Структура("СтрокиКЗаполнению, ДанныеБуфера"); 
			ПараметрыПереноса.СтрокиКЗаполнению = СтрокиКЗаполнению;
			ПараметрыПереноса.ДанныеБуфера = ДанныеДляЗагрузки.СтруктураКТК;
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОПереносе_ЗаполнениеПустыхСтрокКТК", ЭтаФорма, ПараметрыПереноса); 	
			ТекстВопроса = СтрШаблон("Количество выделенных в документе строк для вставки меньше количества добавленных из буфера обмена контейнеров, 
			| %1 последних по списку контейнеров не будут перенесены в табличную часть документа.", НеПеренесемКоличество); 
			ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса,РежимДиалогаВопрос.ОКОтмена);  
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(СтрокиКЗаполнению, ДанныеДляЗагрузки.СтруктураКТК);
		
		ОбновитьСВВиТДТ_Клиент();
		Возврат;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 07.11.2023	
	КонецЕсли;	
	
	//Евросиб Коханенко Н.А. 04.09.2023 (( #74199
	Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
		ИменаПолейИзКалькуляции = Новый Массив;
		ИменаПолейИзКалькуляции = СтрРазделить("УсловияПеревозки,УсловияПеревозкиНазначение,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения", ",");
		ДанныеИзКалькуляции = ПолучитьДанныеКалькуляции(КалькуляцияПоУмолчанию);
		ЗаполненныеПоля = Новый Массив;
		Для Каждого ИмяПоля из ИменаПолейИзКалькуляции Цикл
			ЗначениеПоля = Неопределено;
			Если ДанныеИзКалькуляции.Свойство(ИмяПоля, ЗначениеПоля) И ЗначениеЗаполнено(ЗначениеПоля) Тогда 
				ЗаполненныеПоля.Добавить(ИмяПоля); 
			КонецЕсли; 
		КонецЦикла;
		ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
	КонецЕсли;
	//Евросиб Коханенко Н.А. 04.09.2023 )) #74199 

	Для каждого Стр из ДанныеДляЗагрузки.СтруктураКТК Цикл
		
		НСтр = Объект.СоставУслуги.Добавить();
		
		КТК = неопределено;
		Тип = неопределено;
		Размер = неопределено;
		
		Если ЗначениеЗаполнено(Стр.Тип) Тогда
			
			Тип = НайтиТип(Стр.Тип);
			Размер = РазмерПоТипу(Тип);
			
		ИначеЕсли ЗначениеЗаполнено(Стр.Размер) Тогда
			
			Рез = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(Стр.Размер);
			Тип = Рез.Тип;
			Размер = Рез.Размер;
			
		КонецЕсли;
			
		//Евросиб Коханенко Н.А. 04.09.2023 (( #74199
		Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
			Если ЗначениеЗаполнено(Объект.ПСЦ) Тогда 
				НСтр.ПСЦ = Объект.ПСЦ;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НСтр, ДанныеИзКалькуляции, ИменаЗаполненныхПолей);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 04.09.2023 )) #74199 

		НСтр.НомерКТК = СоздатьКТК(Стр.КТК, Тип);
		РезПоТипам = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(НСтр.НомерКТК);
		НСтр.РазмерКТК = РезПоТипам.Размер;
		НСтр.ТипКТК = РезПоТипам.Тип;
		НСтр.Услуга = УслугаПоУмолчанию;
		НСтр.Калькуляция = КалькуляцияПоУмолчанию;
		НСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
		НайтиКлючАналитикиПеревозкиКлиент(НСтр);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
		// ДИТ US 76659 ТА 76890 Сержантова А.С. Начало: 31.10.2023
		ЗаполнитьСобственностьПриВыбореКонтейнера(НСтр.ПолучитьИдентификатор());
		// ДИТ US 76659 ТА 76890 Сержантова А.С. Конец: 31.10.2023
	КонецЦикла;
	
	ОбновитьСВВиТДТ_Клиент();
	
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023 
&НаКлиенте
Процедура ПослеВопросаОПереносе_ЗаполнениеПустыхСтрокКТК(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(Параметры.СтрокиКЗаполнению, Параметры.ДанныеБуфера);
		ОбновитьСВВиТДТ_Клиент();
	КонецЕсли;	

КонецПроцедуры   

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023  
&НаКлиенте
Асинх Процедура ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(МассивИдентификаторов, ДанныеВставки)   
	
	ИменаЗаполненныхПолей = "";
	ДанныеИзКалькуляции = Неопределено;	 
	КоличествоВставляемыхКТК = ДанныеВставки.Количество();
	
	Если ДанныеВставки[0].Количество() > 5 Тогда //Расширенный список
		СвязатьКТКСоСтоками(, Ложь);
	Иначе     
		
		Рез = ПолучитьКалькуляциюИУслугуПоУмолчанию(Объект.ПСЦ);
		Если Рез.Количество() = 1 Тогда
			КалькуляцияПоУмолчанию = Рез[0].Калькуляция;  
		Иначе
			КалькуляцияПоУмолчанию = Неопределено;
		КонецЕсли;

		Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
			ИменаПолейИзКалькуляции = Новый Массив;
			ИменаПолейИзКалькуляции = СтрРазделить("УсловияПеревозки,УсловияПеревозкиНазначение,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения", ",");
			ДанныеИзКалькуляции = ПолучитьДанныеКалькуляции(КалькуляцияПоУмолчанию);
			ЗаполненныеПоля = Новый Массив;
			Для Каждого ИмяПоля из ИменаПолейИзКалькуляции Цикл
				ЗначениеПоля = Неопределено;
				Если ДанныеИзКалькуляции.Свойство(ИмяПоля, ЗначениеПоля) И ЗначениеЗаполнено(ЗначениеПоля) Тогда 
					ЗаполненныеПоля.Добавить(ИмяПоля); 
				КонецЕсли; 
			КонецЦикла;
			ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
		КонецЕсли;  
	КонецЕсли;   
	
	МассивИдентификаторовДляСортировки = Новый СписокЗначений;
	МассивИдентификаторовДляСортировки.ЗагрузитьЗначения(МассивИдентификаторов);
	МассивИдентификаторовДляСортировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);  
	МассивИдентификаторов = МассивИдентификаторовДляСортировки.ВыгрузитьЗначения();

    НомерСтроки = 0;  
	ОтветПользователя_Перезаполнить = Неопределено;
	Для каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл 
		Если КоличествоВставляемыхКТК = НомерСтроки Тогда // больше нет контейнеров для вставки
			Прервать;
		КонецЕсли; 
		
		СтрокаУслуги = Объект.СоставУслуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(СтрокаУслуги.НомерКТК) Тогда
			//не задавали вопрос
			Если ОтветПользователя_Перезаполнить = Неопределено Тогда
				// здесь надо спросить у пользователя перезаполнить или пропустить?  
				КнопкиВопроса = Новый СписокЗначений();
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, "Пропустить");
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, "Перезаполнить");  
				КнопкиВопроса.Добавить(КодВозвратаДиалога.ОК, "Перезаполнить все" + Символы.ПС + "выделенные строки");
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
				ТекстВопроса = СтрШаблон("Поле ""Номер КТК"" заполнено в строке № %1." +
							Символы.ПС+ "Перезаполнить номер контейнера в указанной строке" +
							Символы.ПС+ "или пропустить её?",
				ИдентификаторСтроки + 1);    
				Обещание = Ждать ВопросАсинх(ТекстВопроса, КнопкиВопроса,,,"В строке уже заполнен КТК"); 
				Если Обещание = КодВозвратаДиалога.Нет Тогда      //Пропускаем одну строку
					Продолжить;
				ИначеЕсли Обещание = КодВозвратаДиалога.Да Тогда  //Перезаполнить одну строку
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, КалькуляцияПоУмолчанию, ДанныеИзКалькуляции, ИменаЗаполненныхПолей); 
					НомерСтроки = НомерСтроки + 1; 
					Продолжить;
				ИначеЕсли Обещание = КодВозвратаДиалога.Отмена Тогда //Прерываем последующее исполнение	
					Прервать;  
				ИначеЕсли Обещание = КодВозвратаДиалога.ОК Тогда  //Перезаполнить все выделенные строки
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, КалькуляцияПоУмолчанию, ДанныеИзКалькуляции, ИменаЗаполненныхПолей);
					НомерСтроки = НомерСтроки + 1;  
					ОтветПользователя_Перезаполнить = КодВозвратаДиалога.ОК;
					Продолжить;
				КонецЕсли; 
			//вопрос был задан ранее	
			Иначе
				Если ОтветПользователя_Перезаполнить = КодВозвратаДиалога.ОК Тогда
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, КалькуляцияПоУмолчанию, ДанныеИзКалькуляции, ИменаЗаполненныхПолей); 
					НомерСтроки = НомерСтроки + 1; 
					Продолжить;
	            КонецЕсли;
			КонецЕсли;
		Иначе	
			СтрокаВставки = ДанныеВставки[НомерСтроки];	
			ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, КалькуляцияПоУмолчанию, ДанныеИзКалькуляции, ИменаЗаполненныхПолей); 
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
	//ОбновитьДанныеКлючаНаФорме();  
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
	Для Каждого Стр Из Объект.СоставУслуги Цикл 
		Стр.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ВерсияДанных");
	КонецЦикла;	  
	ВидимостьКолонокПринадлежности(); 
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки")); 
	
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023 
&НаКлиенте
Процедура ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, КалькуляцияПоУмолчанию, ДанныеИзКалькуляции, ИменаЗаполненныхПолей) 
	
	СтрокаУслуги = Объект.СоставУслуги.НайтиПоИдентификатору(ИдентификаторСтроки);     
	
	Если СтрокаВставки.Количество() > 5 Тогда
	    // расширенный список  
		СписокПереносимыхПолей = Новый массив;
		Для каждого СвойствоВставки из СтрокаВставки Цикл
			Если ЗначениеЗаполнено(СвойствоВставки.Значение) И СвойствоВставки.Ключ <> "НомерРелиза" Тогда
				СписокПереносимыхПолей.Добавить(СвойствоВставки.Ключ);
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтрокаУслуги, СтрокаВставки, СтрСоединить(СписокПереносимыхПолей, ","));
	Иначе
		// Простой список
		Тип = неопределено;
		Если ЗначениеЗаполнено(СтрокаВставки.Тип) Тогда
			Тип = НайтиТип(СтрокаВставки.Тип);
		ИначеЕсли ЗначениеЗаполнено(СтрокаВставки.Размер) Тогда
			Рез = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(СтрокаВставки.Размер);
			Тип = Рез.Тип;
		КонецЕсли;    
		
		Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
			Если ЗначениеЗаполнено(Объект.ПСЦ) Тогда 
				СтрокаУслуги.ПСЦ = Объект.ПСЦ;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаУслуги, ДанныеИзКалькуляции, ИменаЗаполненныхПолей);
		КонецЕсли;
		
		СтрокаУслуги.НомерКТК = СоздатьКТК(СтрокаВставки.КТК, Тип);
		РезПоТипам = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(СтрокаУслуги.НомерКТК);
		СтрокаУслуги.РазмерКТК = РезПоТипам.Размер;
		СтрокаУслуги.ТипКТК = РезПоТипам.Тип;  
		СтрокаУслуги.Услуга = УслугаПоУмолчанию;   
		Если не ЗначениеЗаполнено(СтрокаУслуги.Калькуляция) Тогда
			СтрокаУслуги.Калькуляция = КалькуляцияПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	НайтиКлючАналитикиПеревозкиКлиент(СтрокаУслуги); 
	// ДИТ US 76659 ТА 77825 Сержантова А.С. Начало: 26.02.2024
	// Было:
	//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(ИдентификаторСтроки);
	// Стало:
	ЗаполнитьСобственностьПриВыбореКонтейнера(ИдентификаторСтроки);
	// ДИТ US 76659 ТА 77825 Сержантова А.С. Конец: 26.02.2024  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивКлючейСПустымКонтейнером(МассивКлючей) //ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	
	МассивОтвет = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|ГДЕ
		|	КлючиАналитикиПеревозки.Ссылка В(&МассивКлючей)
		|	И КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОтвет.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	
	
	Возврат МассивОтвет;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазмерПоТипу(Тип)
	Возврат Тип.РазмерКТК;
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКТК(КТК, Тип)
	
	//Результат = неопределено;
	//
	//СущКонтейнер = НайтиКТК(КТК);
	//
	//Если ЗначениеЗаполнено(СущКонтейнер) тогда
	//	Результат = СущКонтейнер;
	//Иначе
	//	//НКонтейнер = Справочники.те.СоздатьЭлемент();
	//	//НКонтейнер.Наименование = КТК;
	//	//НКонтейнер.ТипТЕ = Тип;
	//	//НКонтейнер.Префикс = Лев(КТК, 4);
	//	//НКонтейнер.Номер = Сред(КТК, 5, 6);
	//	//НКонтейнер.КонтрольноеЧисло = Сред(КТК, 11, 1);
	//	//НКонтейнер.Записать();
	//	//Результат = НКонтейнер.Ссылка;
	//КонецЕсли;
	
	// Евросиб Фролов (08.10.2021 Task №39041
	Результат = РаботаСКонтейнерамиСервер.СоздатьКТК(КТК, Тип);
	// Евросиб Фролов	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТип(ТипСтрока) 
	
	Результат = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипоразмерыТЕ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	               |ГДЕ
	               |	(ТипоразмерыТЕ.Наименование = &ТипСтрока
	               |			ИЛИ ТипоразмерыТЕ.КодISO = &ТипСтрока)
	               |	И НЕ ТипоразмерыТЕ.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТипСтрока", ТипСтрока);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	Иначе
		Сообщить("Не найден типоразмер для кода " + ТипСтрока);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКТК(Знач НомерКТК) 
	
	Результат = Неопределено;
	Если НомерКТК = "" Тогда Возврат Результат; КонецЕсли;
	НомерКТК = СтрЗаменить(НомерКТК, " ", "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.ПС, "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.Таб, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТЕ.Ссылка КАК Ссылка,
	               |	ТЕ.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	ТЕ.Префикс = &Префикс
	               |	И ТЕ.Номер = &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТЕ.ПометкаУдаления";
	Запрос.УстановитьПараметр("Префикс", Лев(ВРег(НомерКТК), 4));
	Запрос.УстановитьПараметр("Номер", Сред(НомерКТК, 5, 6));
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Если Результат <> Неопределено И Результат.ПометкаУдаления = Истина Тогда
		РезОбъект = Результат.ПолучитьОбъект();
		РезОбъект.ПометкаУдаления = Ложь;
		РезОбъект.Записать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодборКТКСток(Команда)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Сообщить("Выберите строку, по которой будет осуществляться подбор");
		Возврат;
	КонецЕсли;
	
	// надо что-то добавить, чтобы строка-источник дублировалась (данные по номенклатуре и проч переносились)
	Если НЕ ЗначениеЗаполнено(ТекД.ПунктОтправления) ИЛИ
		НЕ ЗначениеЗаполнено(ТекД.ПунктНазначения) ИЛИ
		НЕ ЗначениеЗаполнено(ТекД.ТипКТК) Тогда
		Сообщить("Для подбора контейнеров должны быть заполнены пункт отправления, пункт назначения и тип контейнера");
		Возврат;
	КонецЕсли;
	
	// запоминаем ГУИД строки для того, чтобы после подбора удалить ее по этому ГУИД. Иначе будет задвоение строки
	// Для строк, которые не являются подобранными из стока, галочка ПЛАН не стоит. 
	Если НЕ ТекД.План Тогда
		ТекГУИД = ТекД.ПолучитьИдентификатор();
	Иначе
		ТекГУИД = "П" + Строка(ТекД.ПолучитьИдентификатор());
	КонецЕсли;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент",ТекД.ВладелецКТК);
	ПараметрыОтбора.Вставить("Сток",ТекД.ПунктОтправления);
	ПараметрыОтбора.Вставить("Направление",ТекД.ПунктНазначения);
	ПараметрыОтбора.Вставить("ТипКонтейнера",ТекД.ТипКТК);
	ПараметрыОтбора.Вставить("СрокВозврата",Объект.Прибытие);
	ПараметрыОтбора.Вставить("ГУИД",ТекГУИД);
	ПараметрыОтбора.Вставить("Заявка",Объект.Ссылка);
	ПараметрыОтбора.Вставить("ДатаЗаявки",ЭтаФорма.Объект.Дата);
	
	КТКВХранилище = ПоместитьКТКВХранилище(ТекГУИД);
	
	ПараметрыОтбора.Вставить("КТКВХранилище", КТКВХранилище);

	КоличествоТребуемыхКТК = Объект.СоставУслуги.Количество()-Объект.СоставУслуги.НайтиСтроки(Новый Структура("ПринадлежностьТЕ", ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента"))).Количество();
	ПараметрыОтбора.Вставить("КоличествоТребуемыхКТК", КоличествоТребуемыхКТК);
	
	ОткрытьФорму("Документ.СтокКонтейнеров.Форма.ФормаПодбораКТИзСтоков", ПараметрыОтбора, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКТКВХранилище(ТекГУИД)
	
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("План",Истина);
	//// использовать именно конструкцию "ЭтаФорма.Объект.СоставУслуги", т.к. это позволяет получить данные незаписанного объекта.
	//// передаем в форму выбора только те строки, которые ранее были выбраны из стока.
	НайденныеСтроки = ЭтаФорма.Объект.СоставУслуги.НайтиСтроки(ПараметрыОтбора);

	// Если подбор б/н контейнеров, то добавить в таблицу хранилища строку с ГУИД, чтобы потом ее заменить на новую
	//Если НЕ ТекГУИД = Неопределено Тогда
	//	ТекСтр = ЭтаФорма.Объект.СоставУслуги.НайтиПоИдентификатору(ТекГУИД);
	//	НайденныеСтроки.Добавить(ТекСтр);
	//КонецЕсли;
	НаборРеквизитов = "НомерКТК,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения,ВладелецКТК,ТипКТК,ДатаВыдачи,ДатаПриемаВСток,ВремяПрибытияНаТерминал,ГУИДСтроки,ИнструкцииПоСдачеПорожнего";
	
	ТаблицаКТК = ЭтаФорма.Объект.СоставУслуги.Выгрузить(НайденныеСтроки, НаборРеквизитов);
	
	ТаблицаКТК.Колонки.Добавить("КонтейнерНаЗамену",Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаКТК, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПодбор(ТекГУИД) Экспорт
	
	ПолучитьКТКИзХранилища(КТКВХранилище,ТекГУИД);
	
	ВидимостьКолонокПринадлежности();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗамену() Экспорт
	
	ПолучитьЗаменуИзХранилища(КТКВХранилище);
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьВидСобственностиКТК(КТК)
	
	Результат = Перечисления.ВариантыСобственности.Спот;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	              |ИЗ
	              |	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(, Контейнер = &КТК) КАК ПризнакСобственностиКонтейнераСрезПоследних";
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.ПризнакСобственности;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПолучитьКТКИзХранилища(КТКВХранилище,ГУИДСтроки)
	
	РезультатПодбора = ПолучитьИзВременногоХранилища(КТКВХранилище);
	
	// если данные вносятся как замена нестоковых КТК на стоковые, то ТекГУИД = Замена.
	// если данные вносятся как новые данные и не замещают имеющиеся данные, то ГУИД будет заполнен.
	// если данные вносятся как новые но при этом не нужно удалять строку-родитель, то ГУИД не заполнен
	Если ГУИДСтроки = "Замена" Тогда
		Для Каждого Строка Из РезультатПодбора Цикл
			ПараметрыОтбора = Новый Структура;
			//НомерКТК,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения,ВладелецКТК,ТипКТК
			////////ПараметрыОтбора.Вставить("План",Ложь);
			//ПараметрыОтбора.Вставить("НомерКТК",Строка.НомерКТК);
			//ПараметрыОтбора.Вставить("ПунктОтправления",Строка.ПунктОтправления); // SIV 05-02-20 пока так
			//ПараметрыОтбора.Вставить("ПунктНазначения",Строка.ПунктНазначения); // SIV 05-02-20 пока так
			//ПараметрыОтбора.Вставить("ВладелецКТК",Строка.ВладелецКТК);
			//ПараметрыОтбора.Вставить("ТипКТК",Строка.ТипКТК); // SIV 25-08-20 А ТЕПЕРЬ ТАК!!!!
			ПараметрыОтбора.Вставить("НомерКТК",Справочники.ТЕ.ПустаяСсылка());
			НайденныеСтроки = ЭтаФорма.Объект.СоставУслуги.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Строка);
				НайденныеСтроки[0].План = Истина;
				НайденныеСтроки[0].ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
				// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
				//Было:
				//НайденныеСтроки[0].ВидСобственности = ПолучитьВидСобственностиКТК(Строка.НомерКТК);
				//Стало:
				ЗаполнитьСвязанныеПоляПринадлежностьТЕ(НайденныеСтроки[0]);
				// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				НайденныеСтроки[0].ДатаПостановкиВРезерв = ТекущаяДата();
				НайденныеСтроки[0].СтокВыдачи = Строка.ПунктОтправления;
				
				Если Строка.ПунктНазначения.Тип = Справочники.ТипыЛокаций.Сток Тогда
					НайденныеСтроки[0].СтокСдачиПорожнего = Строка.ПунктНазначения;
				Иначе
					СтокНазначения = Локации_сервер.ВычислитьСтокПодхода(Строка.ПунктНазначения);
					Если ЗначениеЗаполнено(СтокНазначения) Тогда
						НайденныеСтроки[0].СтокСдачиПорожнего = СтокНазначения;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		// если это плановая строка, то в начале ее ГУИДа стоит буква "П"
		Если СтрНачинаетсяС(ГУИДСтроки,"П") Тогда
			ГУИДСтроки2 = СтрЗаменить(ГУИДСтроки,"П","");
		Иначе
			ГУИДСтроки2 = ГУИДСтроки;
		КонецЕсли;
		// находим родительскую строку
		ТекСтр = ЭтаФорма.Объект.СоставУслуги.НайтиПоИдентификатору(ГУИДСтроки2);
		
		Для Каждого Строка Из РезультатПодбора Цикл
			НовСтр = Объект.СоставУслуги.Добавить();
			// Сначала заполняем каждую строку по родительской, а потом заменяем поля, которые были выбраны в стоке
			ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
			ЗаполнитьЗначенияСвойств(НовСтр,Строка,"НомерКТК,ПунктОтправления,СтанцияОтправления,ДатаПриемаВСток,ПунктНазначения,СтанцияНазначения,ВладелецКТК,ТипКТК,ДатаВыдачи,ВремяПрибытияНаТерминал,ИнструкцииПоСдачеПорожнего");
			НовСтр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//НовСтр.ВидСобственности = Перечисления.ВариантыСобственности.Спот;
			//Стало:
			ЗаполнитьСвязанныеПоляПринадлежностьТЕ(НовСтр);
			// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
			НовСтр.План = Истина;
			НовСтр.ДатаПостановкиВРезерв = ТекущаяДата();
			ЗначениеРеквизитаОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.ТипКТК, "РазмерКТК");
			Если ЗначениеЗаполнено(ЗначениеРеквизитаОбъекта) Тогда
				НовСтр.РазмерКТК = ЗначениеРеквизитаОбъекта;
			КонецЕсли;
		КонецЦикла;
		// удаляем родительскую строку только если это не плановая строка
		Если НЕ СтрНачинаетсяС(ГУИДСтроки,"П") Тогда
			ЭтаФорма.Объект.СоставУслуги.Удалить(ТекСтр);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаменуИзХранилища(КТКВХранилище)
	
	РезультатПодбора = ПолучитьИзВременногоХранилища(КТКВХранилище);
	Для Каждого Строка Из РезультатПодбора Цикл
		ПараметрыОтбора = Новый Структура;
		// отбирать по номеру контейнера нужно только в том случае, если заполнено "КонтейнерНаЗамену" ИЛИ "НомерКТК".
		// т.к. в форме замены могут очистить номер контейнера
		Если ЗначениеЗаполнено(Строка.КонтейнерНаЗамену) ИЛИ ЗначениеЗаполнено(Строка.НомерКТК) Тогда
			ПараметрыОтбора.Вставить("НомерКТК",Строка.НомерКТК);
		КонецЕсли;
		ПараметрыОтбора.Вставить("ПунктОтправления",Строка.ПунктОтправления);
		ПараметрыОтбора.Вставить("ПунктНазначения",Строка.ПунктНазначения);
		ПараметрыОтбора.Вставить("ВладелецКТК",Строка.ВладелецКТК);
		ПараметрыОтбора.Вставить("ТипКТК",Строка.ТипКТК);
		НайденныеСтроки = ЭтаФорма.Объект.СоставУслуги.НайтиСтроки(ПараметрыОтбора);
		// если номер контейнера введен впервые, то сделать отбор по таблице без номера ктк
		Если НайденныеСтроки.Количество()=0 Тогда
			ПараметрыОтбора.Удалить("НомерКТК");
			НайденныеСтроки2 = ЭтаФорма.Объект.СоставУслуги.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки2.Количество()>0 Тогда
				НайденныеСтроки2[0].НомерКТК = Строка.НомерКТК;
				//НайденныеСтроки2[0].ДатаВыдачи = Строка.ДатаВзятияИзСтока;
				//НайденныеСтроки2[0].НормативноеИспользованиеИзСтока = Строка.СрокВозврата;
				НайденныеСтроки2[0].ИнструкцииПоСдачеПорожнего = Строка.ИнструкцииПоСдачеПорожнего;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Строка.КонтейнерНаЗамену) ИЛИ ЗначениеЗаполнено(Строка.НомерКТК) Тогда
				// если контейнер на замену и номер ктк равны, то значит, ктк удалили, нужно очистить значения
				Если Строка.КонтейнерНаЗамену = Строка.НомерКТК Тогда
					НайденныеСтроки[0].НомерКТК = Справочники.ТЕ.ПустаяСсылка();
					//НайденныеСтроки[0].ДатаВыдачи = "";
					//НайденныеСтроки[0].НормативноеИспользованиеИзСтока = 0;
					//НайденныеСтроки[0].ВладелецКТК = Справочники.Контрагенты.ПустаяСсылка();
					//НайденныеСтроки[0].ДатаВзятия = "";
					//НайденныеСтроки[0].НормативноеИспользование = 0;
				Иначе
					НайденныеСтроки[0].НомерКТК = ?(ЗначениеЗаполнено(Строка.КонтейнерНаЗамену),Строка.КонтейнерНаЗамену,Строка.НомерКТК);
					//НайденныеСтроки[0].ДатаВыдачи = Строка.ДатаВзятияИзСтока;
					//НайденныеСтроки[0].НормативноеИспользованиеИзСтока = Строка.СрокВозврата;
					НайденныеСтроки[0].ИнструкцииПоСдачеПорожнего = Строка.ИнструкцииПоСдачеПорожнего;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораКонтейнера(ВыбЗнач, Параметры) Экспорт
    Если ВыбЗнач<>Неопределено Тогда
        ДобавитьСтрокиСоставУслуги(ВыбЗнач);		
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиСоставУслуги(ВыбЗнач)
	
	Для Каждого Стр Из ВыбЗнач Цикл
		НовСтр = Объект.СоставУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		НовСтр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		ЗаполнитьСвязанныеПоляПринадлежностьТЕ(НовСтр);
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		НовСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНаНомерные(Команда)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Сообщить("Выберите строку, по которой будет осуществляться замена");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекД.ПунктОтправления) ИЛИ
		НЕ ЗначениеЗаполнено(ТекД.ПунктНазначения) ИЛИ
		НЕ ЗначениеЗаполнено(ТекД.ТипКТК) Тогда
		Сообщить("Для замены контейнеров должны быть заполнены пункт отправления, пункт назначения и тип контейнера");
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент",ТекД.ВладелецКТК);
	ПараметрыОтбора.Вставить("Сток",ТекД.ПунктОтправления);
	ПараметрыОтбора.Вставить("Направление",ТекД.ПунктНазначения);
	ПараметрыОтбора.Вставить("ТипКонтейнера",ТекД.ТипКТК);
	
	КТКВХранилище = ПоместитьКТКВХранилище(Неопределено);
	ПараметрыОтбора.Вставить("КТКВХранилище", КТКВХранилище);

	ОткрытьФорму("Документ.СтокКонтейнеров.Форма.ФормаЗаменыВСтоках", ПараметрыОтбора, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элементы.СоставУслуги.ТекущиеДанные.ПСЦ = Объект.ПСЦ;
		Элементы.СоставУслуги.ТекущиеДанные.Услуга = УслугаПоУмолчанию;
		//Евросиб Коханенко Н.А. 24.02.2025 (( #101467 
		//Элементы.СоставУслуги.ТекущиеДанные.Калькуляция = КалькуляцияПоУмолчанию;
		Если ЗначениеЗаполнено(Объект.ПСЦ) Тогда
			Элементы.СоставУслуги.ТекущиеДанные.Калькуляция = КалькуляцияПоУмолчанию;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 24.02.2025 )) #101467 
		Элементы.СоставУслуги.ТекущиеДанные.НормативноеИспользование = КолвоДнейКлиенту(КалькуляцияПоУмолчанию);
		Элементы.СоставУслуги.ТекущиеДанные.План = Ложь;
		Элементы.СоставУслуги.ТекущиеДанные.СрокОтправкиУведомления = ПолучитьКоличествоДней();
		Элементы.СоставУслуги.ТекущиеДанные.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
		
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 13.02.2023
		Элементы.СоставУслуги.ТекущиеДанные.ВерсияКлюча = "";
		Если Копирование Тогда 
			Элементы.СоставУслуги.ТекущиеДанные.КлючАналитикиПеревозки = ПредопределенноеЗначение("Справочник.КлючиАналитикиПеревозки.ПустаяСсылка");
		КонецЕсли;
		ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
		НайтиКлючАналитикиПеревозкиКлиент(ТекущиеДанные);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 13.02.2023 
		
		//Евросиб Коханенко Н.А. 03.07.2023 (( #72162
		Если КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) И Объект.ЗапросНаКТК Тогда
			Если ЗначениеЗаполнено(Элементы.СписокЗапросНаКТК.ДанныеСтроки(0).Автоперевозка) Тогда 
				Элементы.СоставУслуги.ТекущиеДанные.ПерваяМиля = Элементы.СписокЗапросНаКТК.ДанныеСтроки(0).Автоперевозка;
			КонецЕсли;
			Если ЗначениеЗаполнено(Элементы.СписокЗапросНаКТК.ДанныеСтроки(0).ПоследняяМиля) Тогда 
				Элементы.СоставУслуги.ТекущиеДанные.ПоследняяМиля = Элементы.СписокЗапросНаКТК.ДанныеСтроки(0).ПоследняяМиля;
			КонецЕсли;
		КонецЕсли;	
		//Евросиб Коханенко Н.А. 03.07.2023 )) #72162
		
		//Евросиб Коханенко Н.А. 01.09.2023 (( #74199
		Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
			ИменаПолейИзКалькуляции = Новый Массив;
			ИменаПолейИзКалькуляции = СтрРазделить("УсловияПеревозки,УсловияПеревозкиНазначение,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения", ",");
			ДанныеИзКалькуляции = ПолучитьДанныеКалькуляции(КалькуляцияПоУмолчанию);
			ТекДанные = Элементы.СоставУслуги.ТекущиеДанные; 
			ЗаполненныеПоля = Новый Массив;
			Для Каждого ИмяПоля из ИменаПолейИзКалькуляции Цикл
				Если ЗначениеЗаполнено(ТекДанные[ИмяПоля]) Тогда 
					ЗаполненныеПоля.Добавить(ИмяПоля); 
				КонецЕсли; 
			КонецЦикла;
			ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
			//заполняем только незаполненные поля в строке
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеИзКалькуляции,, ИменаЗаполненныхПолей);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 01.09.2023 )) #74199 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоДней()
	Возврат Константы.ЗаСколькоДоСрокаВозвратаКТКИнформироватьПользователей.Получить();
КонецФункции	
	
&НаКлиенте
Процедура ПСЦПриИзменении(Элемент, ДействующийПСЦ = неопределено)

	// ДИТ ТА 112604 Дедуник Д.О. Начало: 24.07.2025
	ТранзитДляКлиента = ПолучитьТранзитДляКлиентаПокументаОснования();
	// ДИТ ТА 112604 Дедуник Д.О. Конец: 24.07.2025
	
	Если (НЕ ЗначениеЗаполнено(Объект.ПСЦ) и ДействующийПСЦ = неопределено) ИЛИ НЕ ПравоРедактирования тогда возврат; КонецЕсли;
	
	Если ДействующийПСЦ = неопределено Тогда ДействующийПСЦ = Объект.ПСЦ; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		Объект.Грузоотправитель = ГрузоотправительПоПСЦ(ДействующийПСЦ);
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 03.07.2023 (( #72162 
	ЗаполнитьПолеВидПеревозкиЗначениемПоУмолчанию();
	//Евросиб Коханенко Н.А. 03.07.2023 )) #72162 
	
	Рез = ПолучитьКалькуляциюИУслугуПоУмолчанию(ДействующийПСЦ);
	Если Рез.Количество() = 1 Тогда
		КалькуляцияПоУмолчанию = Рез[0].Калькуляция;
		УслугаПоУмолчанию = Рез[0].Услуга;
	Иначе
		КалькуляцияПоУмолчанию = неопределено;
		УслугаПоУмолчанию = неопределено;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 25.02.2025 (( #101467 
	//Элементы.СоставУслугиКалькуляция.СписокВыбора.Очистить();
	//Для каждого Стр из Рез Цикл
	//	Элементы.СоставУслугиКалькуляция.СписокВыбора.Добавить(Стр.Калькуляция);
	//КонецЦикла;  
	//Евросиб Коханенко Н.А. 25.02.2025 )) #101467 
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023
	Если ЭтоЗаявкаПоСубсидии(Объект.ПСЦ) Тогда
		УслугаПоУмолчанию = ПредопределенноеЗначение("Справочник.Номенклатура.Премия");
		Элементы.ГруппаСписокЗапросНаКТК.Видимость = Ложь;
	КонецЕсли;
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 28.07.2023
	
КонецПроцедуры 

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023   
&НаСервереБезКонтекста
Функция ЭтоЗаявкаПоСубсидии(ПСЦ)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПСЦ, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Субсидии ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПСЦ, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Премии;
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
КонецФункции 

&НаСервереБезКонтекста
Функция ГрузоотправительПоПСЦ(ПСЦ)
	Возврат Документы.Заявка.ПолучитьГрузоотправителяПоПСЦ(ПСЦ);
КонецФункции

&НаКлиенте
Процедура СоставУслугиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	//ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	//Если ТекД = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ТекД.План И ЗначениеЗаполнено(ТекД.ДатаВзятия) и ЗначениеЗаполнено(ТекД.ДатаВыдачи) Тогда
	//	Если ТекД.ДатаВыдачи < ТекД.ДатаВзятия Тогда
	//		Сообщить("Дата выдачи клиенту должна быть позже даты выдачи из стока");
	//		//Отказ = Истина;
	//		//Возврат;
	//	КонецЕсли;
	//	Если (ТекД.ДатаВзятия + ТекД.НормативноеИспользованиеИзСтока*3600*24) < (ТекД.ДатаВыдачи + ТекД.НормативноеИспользование*3600*24) Тогда
	//		Сообщить("Дата окончания пользования КТК клиентом не может быть больше даты возврата КТК поставщику");
	//		//Отказ = Истина;
	//		//Возврат;
	//	КонецЕсли;
	//	
	//	// проверка, что дата выдачи клиенту позже даты резерва КТК под заявку.
	//	// иначе в РС СтатусыКТК статус "В движении" будет ранее статуса "Зарезервирован".
	//	//(Дата выдачи клиенту устанавливает статус "В движении").
	//	Если ТекД.ДатаВыдачи <= ТекД.ДатаПостановкиВРезерв Тогда
	//		Сообщить("Дата выдачи клиенту должа быть позже даты резерва КТК под заявку!");
	//		//Отказ = Истина;
	//		//Возврат;
	//	КонецЕсли;
	//
	//	
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.СоставУслуги.ТекущийЭлемент.Имя = "СоставУслугиНомерКТК" Тогда
		//Евросиб Каблов 24.01.2022 ( Task 45889
		//ПоказатьЗначение(, Элементы.СоставУслуги.ТекущиеДанные.НомерКТК);
		ТолькоПросмотрКТК = Ложь;
		ТекД = Элементы.СоставУслуги.ТекущиеДанные;	
		Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.НомерКТК) И ЗначениеЗаполнено(Объект.Ссылка) Тогда		
			КонтейнерВключенВСделку = КонтейнерЗаявкиВключенВСделку(Объект.Ссылка, ТекД.НомерКТК, ТекД.ГУИДСтроки);
			Если  КонтейнерВключенВСделку Тогда
				ТолькоПросмотрКТК = Истина;						
			КонецЕсли;		
		КонецЕсли;
		
		Элементы.СоставУслугиНомерКТК.ТолькоПросмотр = ТолькоПросмотрКТК;
		Если ТолькоПросмотрКТК Тогда
			ПоказатьЗначение(, Элементы.СоставУслуги.ТекущиеДанные.НомерКТК);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		//Евросиб Каблов 24.01.2022 )
	//Евросиб Каблов 31.10.2022 ( 52066
	ИначеЕсли Элементы.СоставУслуги.ТекущийЭлемент.Имя = "СоставУслугиПеренесенВЗаявку" Тогда
		ТекД = Элементы.СоставУслуги.ТекущиеДанные;
		Если ТекД <> Неопределено И ЗначениеЗаполнено(ТекД.ПеренесенВЗаявку) Тогда
			ПоказатьЗначение(, ТекД.ПеренесенВЗаявку);
		КонецЕсли;
	//Евросиб Каблов 31.10.2022 )
	//ДИТ, Беляев СЮ, Ticket#0341163, 08-02-2024, начало
	ИначеЕсли Элементы.СоставУслуги.ТекущийЭлемент.Имя = "СоставУслугиРелиз" Тогда
		ТекД = Элементы.СоставУслуги.ТекущиеДанные;
		Если ТекД <> Неопределено И ЗначениеЗаполнено(ТекД.ИдентификаторСтрокиРелизаКлиента) И ЗначениеЗаполнено( ТекД.Релиз ) Тогда
			ПоказатьЗначение(, ТекД.Релиз);	
		КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0341163, 08-02-2024, конец 
	//Евросиб Коханенко Н.А. 23.04.2025 (( #78722 
	ИначеЕсли Элементы.СоставУслуги.ТекущийЭлемент.Имя = "СоставУслугиОфисПродаж" Тогда
		Если ЕстьСвязаннаяРТУ <> "" Тогда
			СтандартнаяОбработка = Ложь;
			ТекД = Элементы.СоставУслуги.ТекущиеДанные;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Обязательное поле ""Офис продаж"" не может быть изменено в связи с наличием связанной с заявкой РТУ: " + ЕстьСвязаннаяРТУ,,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", ТекД.НомерСтроки, "ОфисПродаж"), "Объект")
		КонецЕсли;
	//Евросиб Коханенко Н.А. 23.04.2025 )) #78722 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВагоныИзEXCEL(Команда)
	
	ОпОп = новый ОписаниеОповещения("ОбработкаДобавленияНомерныхВагонов", ЭтаФорма);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДобавленияНомерных", Новый Структура("ЭтоВагоны"),, ЭтаФорма.УникальныйИдентификатор, ,,ОпОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБезномерныеВагоны(Команда)
	
	ОпОп = новый ОписаниеОповещения("ОбработкаДобавленияБезномерныхПозиций", ЭтаФорма);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаДобавленияБезномерныхПозиций", Новый Структура("ЭтоВагоны", Истина),, ЭтаФорма.УникальныйИдентификатор, ,,ОпОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхВагонов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда возврат; КонецЕсли;
	
	//Если параметр1.Поведение = 1 Тогда Объект.СоставУслуги.Очистить(); КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
	Если параметр1.Поведение = 1 Тогда
		УдалитьСтрокиНеВключенныеВСделку();
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец
	
	Для каждого Стр из параметр1.СтруктураКТК Цикл
		
		НСтр = Объект.СоставУслуги.Добавить();
		НСтр.Услуга = УслугаПоУмолчанию;
		НСтр.Калькуляция = КалькуляцияПоУмолчанию;
		НайдВагонИМодель = ПолучитьВагонИМодель(Стр.НомерВагона);
		НСтр.ТипВагона = НайдВагонИМодель.ТипВагона;
		НСтр.Вагон = НайдВагонИМодель.Вагон;
		НСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
		НайтиКлючАналитикиПеревозкиКлиент(НСтр);
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
		
	КонецЦикла;
	
КонецПроцедуры

&наСервереБезКонтекста
Функция ПолучитьВагонИМодель(НомерВагона)
	
	Результат = Новый Структура("ТипВагона,Вагон");
	
	Ссылка = Справочники.тс.НайтиПоНаименованию(НомерВагона);
	Результат.Вагон = Ссылка;
	Результат.ТипВагона = Ссылка.ТипТС;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СоставУслугиВагонПриИзменении(Элемент)
	
	Элементы.СоставУслуги.ТекущиеДанные.ТипВагона = ПолучитьТипВагона(Элементы.СоставУслуги.ТекущиеДанные.Вагон);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипВагона(Вагон)
	Возврат Вагон.ТипТС;
КонецФункции

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
	// если спарк запрос выполнен более 3 дней назад, то запросить заново
	Если СПАРКЗапросыСервер.ЗапросБылВыполненМенее3ДнейНазад(Объект.Контрагент) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СПАРК_СкачатьДосьеЗавершение", ЭтаФорма), "Предыдущий запрос досье СПАРК был выполнен менее трех дней назад. Загрузить актуальную версию досье контрагента?",
		РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		СПАРК_СкачатьДосьеЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_СкачатьДосьеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СПАРК_СкачатьДосьеФрагмент();
		СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры);
	КонецЕсли;		
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;		
	
	СПАРК_ОбновитьПоказателиФрагмент();

КонецПроцедуры

&НаСервере
Процедура СПАРК_ОбновитьПоказателиФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО, ПоследнееОбновлениеСПАРК");
	СтруктураРеквизитов.Контрагент = Объект.Контрагент;
	СтруктураРеквизитов.ИНН = Объект.Контрагент.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Контрагент.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_ОбновитьПоказателиНаСервере(СтруктураРеквизитов, Отказ);
КонецПроцедуры

&НаСервере
Процедура СПАРК_СкачатьДосьеФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО");
	СтруктураРеквизитов.Контрагент = Объект.Контрагент;
	СтруктураРеквизитов.ИНН = Объект.Контрагент.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Контрагент.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_СкачатьДосьеНаСервере(СтруктураРеквизитов, Отказ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ПолучитьДанныеИзБазы();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБазы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСостояния.Ссылка КАК Ссылка,
	               |	ЗаявкаСостояния.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаСостояния.Состояние КАК Состояние,
	               |	ЗаявкаСостояния.Исполнитель КАК Исполнитель,
	               |	ЗаявкаСостояния.Наблюдатель КАК Наблюдатель,
	               |	ЗаявкаСостояния.Статус КАК Статус,
	               |	ЗаявкаСостояния.НачалоРаботы КАК НачалоРаботы,
	               |	ЗаявкаСостояния.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	ЗаявкаСостояния.ПричинаОтказа КАК ПричинаОтказа,
	               |	ЗаявкаСостояния.СтатусСогласования КАК СтатусСогласования,
	               |	ЗаявкаСостояния.ПредыдущиеЭтапы КАК ПредыдущиеЭтапы,
	               |	ЗаявкаСостояния.НормативИсполненияСМоментаСоздания КАК НормативИсполненияСМоментаСоздания
	               |ИЗ
	               |	Документ.Заявка.Состояния КАК ЗаявкаСостояния
	               |ГДЕ
	               |	ЗаявкаСостояния.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Объект.Состояния.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ПроверитьКонтрагентаКоносамент(Объект.Контрагент) Тогда
		Элементы.СоставУслугиРеестрКлиента.Заголовок = "Коносамент";
	Иначе
		Элементы.СоставУслугиРеестрКлиента.Заголовок = "Реестр клиента";
	КонецЕсли; 
	
	//Евросиб Коханенко Н.А. 03.07.2023 (( #72162 
	ЗаполнитьПолеВидПеревозкиЗначениемПоУмолчанию();
	//Евросиб Коханенко Н.А. 03.07.2023 )) #72162 
	
	//Евросиб Каблов 29.07.2020 (
	УстановитьВидимостьВкладкиСибур();
	//Евросиб Каблов 29.07.2020 )
	
	ОбновитьВидимостьПредупрежденияБлокировки();
	
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	МассивИдентификаторов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
		Если СтрокаТЧ.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") Тогда
			МассивИдентификаторов.Добавить(СтрокаТЧ.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИдентификаторов.Количество() > 0 Тогда
		ЗаполнитьСвязанныеПоляПринадлежностьТЕ(МассивИдентификаторов);
	КонецЕсли;
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023

	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023
	// -- Евросиб Дудоров С.В. US 61271 30.01.2023 в рамках
	ЗаполнитьДоговорЕслиОдин(Объект.Контрагент);
	// -- Евросиб Дудоров С.В. US 61271 30.01.2023 в рамках
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023
	
	//БИТ Белинский Д.А. 20.06.2023 -начало
	УстановитьВидимостьПолейПоКонтрагенту();
	//БИТ Белинский Д.А. 20.06.2023 -конец 
	
	//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
	ОбновитьОфисыПродаж();
	//Евросиб Коханенко Н.А. 11.02.2025 )) #78722 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьКонтрагентаКоносамент(Контрагент)
	
	Коносамент = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФормированиеФинДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	               |ГДЕ
	               |	ФормированиеФинДокументов.Контрагент = &Контрагент
	               |	И (ФормированиеФинДокументов.Коносамент
	               |	ИЛИ ФормированиеФинДокументов.ОдинКоносаментОдинДокумент)";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	РЗ = Запрос.Выполнить();
	Если НЕ РЗ.Пустой() Тогда
		Коносамент = Истина;
	КонецЕсли;
	
	Возврат Коносамент;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьГруппуСостояний(Команда)
	
	Элементы.ГруппаСостояния.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекД = Элементы.ОперативныеЗадачи.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ПоказатьЗначение(,ТекД.Документ);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 12.05.2020 (
&НаСервере
Процедура ЗаполнитьВкладкуСИБУР()
	
	ДанныеПоЗаявкеСибур = ПолучитьДанныеПоЗаявкеСибур();
	
	Если ДанныеПоЗаявкеСибур.Следующий() Тогда
		Если ДанныеПоЗаявкеСибур.Заявка = Объект.Ссылка Тогда
			Элементы.СибурСвязаннаяЗаявка.Заголовок = "Заявка на груженые";
			СибурСвязаннаяЗаявка = ДанныеПоЗаявкеСибур.ЗаявкаНаОтправкуГруженых;
			Элементы.СибурСвязаннаяЗаявкаОтправка.Видимость = Истина;
		Иначе
			Элементы.СибурСвязаннаяЗаявка.Заголовок = "Заявка на порожние";
			СибурСвязаннаяЗаявка = ДанныеПоЗаявкеСибур.Заявка;
			Элементы.СибурСвязаннаяЗаявкаОтправка.Видимость = Ложь;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеПоЗаявкеСибур);
	КонецЕсли;
	
	ОбновитьКонтактнуюИнформациюГрузополучателя();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформациюГрузополучателя()
	
	ГрузополучательТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Грузополучатель, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	ГрузополучательАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Грузополучатель, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВкладкиСибур()
	
	СибурКонтрагент = Константы.СибурКонтрагент.Получить();
	ЭтоСибур = Ложь;
	Если Объект.Контрагент = СибурКонтрагент Тогда
		Элементы.ГруппаСибур.Видимость = Истина;
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
		ЭтоСибур = Истина;
		//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
	Иначе
		Элементы.ГруппаСибур.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПоЗаявкеСибур()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СибурРазмещенныеЗаявки.Заявка КАК Заявка,
	|	СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых,
	|	СибурРазмещенныеЗаявки.ПлановаяДатаОтправленияПорожнего КАК ПлановаяДатаОтправленияПорожнего,
	|	СибурРазмещенныеЗаявки.КодКонечнойСтанцииНазначенияПриСухопутье КАК КодКонечнойСтанцииНазначенияПриСухопутье,
	|	СибурРазмещенныеЗаявки.НазваниеКонечнойСтанцииНазначенияПриСухопутье КАК НазваниеКонечнойСтанцииНазначенияПриСухопутье,
	|	СибурРазмещенныеЗаявки.КодПритерминальнойЖДСтанции КАК КодПритерминальнойЖДСтанции,
	|	СибурРазмещенныеЗаявки.НазваниеПритерминальнойЖДСтанции КАК НазваниеПритерминальнойЖДСтанции,
	|	СибурРазмещенныеЗаявки.ДатаКрайнегоСрокаОтветаЭкспедитора КАК ДатаКрайнегоСрокаОтветаЭкспедитора,
	|	СибурРазмещенныеЗаявки.ВидЗакупкиКод КАК ВидЗакупкиКод,
	|	СибурРазмещенныеЗаявки.ВидЗакупкиНаименование КАК ВидЗакупкиНаименование,
	|	СибурРазмещенныеЗаявки.ВидОтправкиКод КАК ВидОтправкиКод,
	|	СибурРазмещенныеЗаявки.ВидОтправкиНаименование КАК ВидОтправкиНаименование,
	|	СибурРазмещенныеЗаявки.НомерДоговора КАК НомерДоговора,
	|	СибурРазмещенныеЗаявки.НеобходимаяДатаПодачиПорожнегоСостава КАК НеобходимаяДатаПодачиПорожнегоСостава,
	|	СибурРазмещенныеЗаявки.ПлановаяДатаОтгрузкиГруженогоСостава КАК ПлановаяДатаОтгрузкиГруженогоСостава,
	|	СибурРазмещенныеЗаявки.КодСтанцииОтправкиГруженого КАК КодСтанцииОтправкиГруженого,
	|	СибурРазмещенныеЗаявки.НазваниеСтанцииОтправкиГруженого КАК НазваниеСтанцииОтправкиГруженого,
	|	СибурРазмещенныеЗаявки.МаршрутСледованияГруженогоПоезда КАК МаршрутСледованияГруженогоПоезда,
	|	СибурРазмещенныеЗаявки.КодСтанцииНазначенияГруженого КАК КодСтанцииНазначенияГруженого,
	|	СибурРазмещенныеЗаявки.НазваниеСтанцииНазначенияГруженого КАК НазваниеСтанцииНазначенияГруженого,
	|	СибурРазмещенныеЗаявки.ОбщееКоличествоЗапрашиваемыхКонтейнеров КАК ОбщееКоличествоЗапрашиваемыхКонтейнеров,
	|	СибурРазмещенныеЗаявки.ЕдиницаИзмеренияКоличестваКонтейнеров КАК ЕдиницаИзмеренияКоличестваКонтейнеров,
	|	СибурРазмещенныеЗаявки.КодТипаКонтейнеров КАК КодТипаКонтейнеров,
	|	СибурРазмещенныеЗаявки.ВесПродукции КАК ВесПродукции,
	|	СибурРазмещенныеЗаявки.ЕдиницаИзмеренияВесаПродукции КАК ЕдиницаИзмеренияВесаПродукции,
	|	СибурРазмещенныеЗаявки.Комментарий КАК Комментарий,
	|	СибурРазмещенныеЗаявки.ИмяМенеджера КАК ИмяМенеджера,
	|	СибурРазмещенныеЗаявки.КонтактныйТелефонМенеджера КАК КонтактныйТелефонМенеджера,
	|	СибурРазмещенныеЗаявки.АдресЭлектроннойПочтыМенеджера КАК АдресЭлектроннойПочтыМенеджера,
	|	СибурРазмещенныеЗаявки.RFQ_ID КАК RFQ_ID,
	//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
	|	СибурРазмещенныеЗаявки.ЭкспедиторВПорту КАК ЭкспедиторВПорту
	//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
	|ПОМЕСТИТЬ ВТРазмещенныеЗаявки
	|ИЗ
	|	РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
	|ГДЕ
	|	(СибурРазмещенныеЗаявки.Заявка = &Заявка
	|			ИЛИ СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых = &Заявка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазмещенныеЗаявки.Заявка КАК Заявка,
	|	ВТРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых,
	|	СибурСтатусыЗаявокСрезПоследних.СтатусЗаявки КАК СибурСтатусЗаявки,
	|	СибурСтатусыЗаявокСрезПоследних.ПричинаОтклоненияЗаявки КАК СибурПричинаОтклоненияЗаявки,
	|	ВТРазмещенныеЗаявки.ПлановаяДатаОтправленияПорожнего КАК СибурПлановаяДатаОтправленияПорожнего,
	|	ВТРазмещенныеЗаявки.КодКонечнойСтанцииНазначенияПриСухопутье КАК СибурКодКонечнойСтанцииНазначенияПриСухопутье,
	|	ВТРазмещенныеЗаявки.НазваниеКонечнойСтанцииНазначенияПриСухопутье КАК СибурНазваниеКонечнойСтанцииНазначенияПриСухопутье,
	|	ВТРазмещенныеЗаявки.КодПритерминальнойЖДСтанции КАК СибурКодПритерминальнойЖДСтанции,
	|	ВТРазмещенныеЗаявки.НазваниеПритерминальнойЖДСтанции КАК СибурНазваниеПритерминальнойЖДСтанции,
	|	ВТРазмещенныеЗаявки.ДатаКрайнегоСрокаОтветаЭкспедитора КАК СибурДатаКрайнегоСрокаОтветаЭкспедитора,
	|	ВТРазмещенныеЗаявки.ВидЗакупкиКод КАК СибурВидЗакупкиКод,
	|	ВТРазмещенныеЗаявки.ВидЗакупкиНаименование КАК СибурВидЗакупкиНаименование,
	|	ВТРазмещенныеЗаявки.ВидОтправкиКод КАК СибурВидОтправкиКод,
	|	ВТРазмещенныеЗаявки.ВидОтправкиНаименование КАК СибурВидОтправкиНаименование,
	|	ВТРазмещенныеЗаявки.НомерДоговора КАК СибурНомерДоговора,
	|	ВТРазмещенныеЗаявки.НеобходимаяДатаПодачиПорожнегоСостава КАК СибурНеобходимаяДатаПодачиПорожнегоСостава,
	|	ВТРазмещенныеЗаявки.ПлановаяДатаОтгрузкиГруженогоСостава КАК СибурПлановаяДатаОтгрузкиГруженогоСостава,
	|	ВТРазмещенныеЗаявки.КодСтанцииОтправкиГруженого КАК СибурКодСтанцииОтправкиГруженого,
	|	ВТРазмещенныеЗаявки.НазваниеСтанцииОтправкиГруженого КАК СибурНазваниеСтанцииОтправкиГруженого,
	|	ВТРазмещенныеЗаявки.МаршрутСледованияГруженогоПоезда КАК СибурМаршрутСледованияГруженогоПоезда,
	|	ВТРазмещенныеЗаявки.КодСтанцииНазначенияГруженого КАК СибурКодСтанцииНазначенияГруженого,
	|	ВТРазмещенныеЗаявки.НазваниеСтанцииНазначенияГруженого КАК СибурНазваниеСтанцииНазначенияГруженого,
	|	ВТРазмещенныеЗаявки.ОбщееКоличествоЗапрашиваемыхКонтейнеров КАК СибурОбщееКоличествоЗапрашиваемыхКонтейнеров,
	|	ВТРазмещенныеЗаявки.ЕдиницаИзмеренияКоличестваКонтейнеров КАК СибурЕдиницаИзмеренияКоличестваКонтейнеров,
	|	ВТРазмещенныеЗаявки.КодТипаКонтейнеров КАК СибурКодТипаКонтейнеров,
	|	ВТРазмещенныеЗаявки.ВесПродукции КАК СибурВесПродукции,
	|	ВТРазмещенныеЗаявки.ЕдиницаИзмеренияВесаПродукции КАК СибурЕдиницаИзмеренияВесаПродукции,
	|	ВТРазмещенныеЗаявки.Комментарий КАК СибурКомментарий,
	|	ВТРазмещенныеЗаявки.ИмяМенеджера КАК СибурИмяМенеджера,
	|	ВТРазмещенныеЗаявки.КонтактныйТелефонМенеджера КАК СибурКонтактныйТелефонМенеджера,
	|	ВТРазмещенныеЗаявки.АдресЭлектроннойПочтыМенеджера КАК СибурАдресЭлектроннойПочтыМенеджера,
	|	ВТРазмещенныеЗаявки.RFQ_ID КАК СибурRFQ_ID,
	//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -начало
	|	ВТРазмещенныеЗаявки.ЭкспедиторВПорту КАК СибурЭкспедиторВПорту
	//ДИТ Шевченко А.В. US 57149 TA 66232 20.03.2023 -конец
	|ИЗ
	|	ВТРазмещенныеЗаявки КАК ВТРазмещенныеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СибурСтатусыЗаявок.СрезПоследних(
	|				,
	|				Заявка В
	|					(ВЫБРАТЬ
	|						ВТРазмещенныеЗаявки.Заявка КАК Заявка
	|					ИЗ
	|						ВТРазмещенныеЗаявки КАК ВТРазмещенныеЗаявки)) КАК СибурСтатусыЗаявокСрезПоследних
	|		ПО ВТРазмещенныеЗаявки.Заявка = СибурСтатусыЗаявокСрезПоследних.Заявка";
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции
//Евросиб Каблов 12.05.2020 )

&НаСервере
Процедура ОбновитьСВВиТДТ_Сервер(ТолькоВыбранныйКТК = неопределено)
	
	МассивКТК = Новый Массив;
	Для каждого Стр из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НомерКТК) ИЛИ (ТолькоВыбранныйКТК <> неопределено И Стр.НомерКТК <> ТолькоВыбранныйКТК) Тогда Продолжить; КонецЕсли;
		МассивКТК.Добавить(Стр.НомерКТК);
	КонецЦикла;
	
	РезСобиранияСВВиТДТ = СобратьДанныеСВВиТДТ(МассивКТК);
	
	Для каждого Стр из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НомерКТК) ИЛИ (ТолькоВыбранныйКТК <> неопределено И Стр.НомерКТК <> ТолькоВыбранныйКТК) Тогда Продолжить; КонецЕсли;
		РезСопост = РезСобиранияСВВиТДТ.Получить(Стр.НомерКТК);
		Если РезСопост <> неопределено Тогда
			ЗаполнитьЗначенияСвойств(Стр, РезСопост);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСВВиТДТ_Клиент(ТолькоВыбранныйКТК = неопределено)
	
	МассивКТК = Новый Массив;
	Для каждого Стр из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НомерКТК) ИЛИ (ТолькоВыбранныйКТК <> неопределено И Стр.НомерКТК <> ТолькоВыбранныйКТК) Тогда Продолжить; КонецЕсли;
		МассивКТК.Добавить(Стр.НомерКТК);
	КонецЦикла;
	
	РезСобиранияСВВиТДТ = СобратьДанныеСВВиТДТ(МассивКТК);
	
	Для каждого Стр из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НомерКТК) ИЛИ (ТолькоВыбранныйКТК <> неопределено И Стр.НомерКТК <> ТолькоВыбранныйКТК) Тогда Продолжить; КонецЕсли;
		РезСопост = РезСобиранияСВВиТДТ.Получить(Стр.НомерКТК);
		Если РезСопост <> неопределено Тогда
			ЗаполнитьЗначенияСвойств(Стр, РезСопост);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СобратьДанныеСВВиТДТ(СписокКТК)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_СВВ КАК тек_СВВ,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_КомментарийСВВ КАК тек_КомментарийСВВ,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_НомерТДТ КАК тек_НомерТДТ
	               |ИЗ
	               |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&СписокКТК)) КАК стоки_ТекущиеДанныеСрезПоследних";
	Запрос.УстановитьПараметр("СписокКТК", СписокКТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Вставить(Ответ.КТК, Новый Структура("СВВ, КомментарийСВВ, НомерТДТ", Ответ.тек_СВВ, Ответ.тек_КомментарийСВВ, Ответ.тек_НомерТДТ));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
	ИначеЕсли ИмяСобытия = "НеобходимоОбновитьДанныеКлючейАналитикиПеревозки" Тогда	
		Если Источник <> Неопределено и Источник.УникальныйИдентификатор <> ЭтаФорма.УникальныйИдентификатор Тогда
			ПроверитьАктуальностьКлючаАналитики();   
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
			Если Элементы.СоставУслуги.ТекущиеДанные <> неопределено Тогда
				ОбновитьВидимостьДетализацияПоГрузу();
			КонецЕсли;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
		КонецЕсли; 
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	ИначеЕсли ИмяСобытия = "СозданиеРелизаКлиентаИзЗаявки" Тогда
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		НайденныеСтроки = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Параметр.ИдентификаторСтрокиЗаявки));
		
		Если НайденныеСтроки.Количество() > 0
			И ЗначениеЗаполнено(Параметр.Релиз) Тогда
			ЭтаФорма.Прочитать(); //ДИТ Шевченко А.В. BUG 75526 TA 75527 02.10.23 -Начало
			СтрокаДанных = НайденныеСтроки[0];
			СтрокаДанных.РелизКлиента = Параметр.Релиз;
			//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
			МассивСтруктур = Параметр.МассивКлючей;
			Для Каждого ЗнчМ Из МассивСтруктур Цикл
				СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",ЗнчМ.Ключ);
				НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НовСтрока = Объект.СоставУслуги.Добавить();
					НовСтрока.КлючАналитикиПеревозки = ЗнчМ.Ключ;
					НовСтрока.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба");
					НовСтрока.Релиз = Параметр.Релиз;
					//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
					// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
					//ок(
					//НовСтрока.СобственностьПеревозимогоКТК = ПредопределенноеЗначение("Перечисление.СобственностьПеревозимогоКонтейнера.COC");
					//ок)
					НовСтрока.УдалитьСобственностьПеревозимогоКТК = ПредопределенноеЗначение("Перечисление.УдалитьСобственностьПеревозимогоКонтейнера.COC");
					// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
					НовСтрока.ПерваяМиля = Параметр.Автоперевозка;
					НовСтрока.ПоследняяМиля = Параметр.АвтоперевозкаПоследняяМиля;
					//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023  
					// ДИТ BUG 76435 Сержантова А.С. Начало: 23.11.2023
					НовСтрока.НормативноеИспользование = Параметр.НормативноеИспользование;
					// ДИТ BUG 76435 Сержантова А.С. Конец: 23.11.2023
					НовСтрока.ИдентификаторСтрокиРелизаКлиента = ЗнчМ.ИдентификаторСтроки;
					НовСтрока.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
					// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 12.02.2024
					НовСтрока.ТипКТК = Параметр.ТипКТК; 
					НовСтрока.РазмерКТК = Параметр.РазмерКТК;	
					// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 12.02.2024
					//Субботин 77659 20.12.2023 Начало //добавил иначе	
				Иначе
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.Релиз = Параметр.Релиз; 
						Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтрокиРелизаКлиента) тогда
							НайденнаяСтрока.ИдентификаторСтрокиРелизаКлиента =  ЗнчМ.ИдентификаторСтроки;
						КонецЕсли;
						НайденнаяСтрока.ПерваяМиля = Параметр.Автоперевозка;
						НайденнаяСтрока.ПоследняяМиля = Параметр.АвтоперевозкаПоследняяМиля;
						НайденнаяСтрока.НормативноеИспользование = Параметр.НормативноеИспользование;
					КонецЦикла;
					//Субботин 77659 20.12.2023 Конец
				КонецЕсли;	
			КонецЦикла;   
			
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 29.12.2023
			ОбновитьДанныеКлючаНаФорме();
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 29.12.2023
			
			Записать();
			//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец    
			// ДИТ BUG 76435 Сержантова А.С. Начало: 23.11.2023   
			//ОбновитьДанныеКлючаНаФорме();
			УправлениеФормой();
			УстановитьВидимостьПолейПоКонтрагенту();      
			// ДИТ BUG 76435 Сержантова А.С. Конец: 23.11.2023
		КонецЕсли;		
		// Евросиб Фролов)
			
	// ++ Дудоров С.В. Ticket#61931 29.11.2022
	//// Евросиб Фролов (16.02.2022 Task №44768	
	//ИначеЕсли ИмяСобытия = "ЗаписьЗаявки" Тогда 
	//	ЭтаФорма.ОбновитьОтображениеДанных();
	//	ЭтаФорма.Прочитать();
	//	ОбновитьПанельТекущегоПользователя();
	//	ОбновитьПанельСостояний();
	//// Евросиб Фролов)
	// -- Дудоров С.В. Ticket#61931 29.11.2022
	
	//Субботин 77659 05.02.2024 Начало	
	ИначеЕсли ИмяСобытия = "НеобходимоОбновитьФормуЗаявкиДляРаботыСЗапросомКТК" Тогда
		ЭтаФОрма.Прочитать(); 
	//Субботин 77659 05.02.2024 конец  
	
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866
	ИначеЕсли ИмяСобытия = "ОповещениеОПереносеКТКвДругуюЗаявку" И ЭтаФорма.УникальныйИдентификатор = Источник Тогда 
		ПеренестиКТКФоновоеЗадание(Параметр);
		ПереносКТККлиент.ПеренестиКТКвДругуюЗаявку_Заявка_Нажатие(ЭтаФорма); 
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузу(Команда)
	
	Элементы.ДетализацияПоГрузу.Видимость = НЕ Элементы.ДетализацияПоГрузу.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СоставУслуги.ТекущиеДанные <> неопределено Тогда
		
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
		ОбновитьВидимостьДетализацияПоГрузу();
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 07.02.2023
		// Было:
		//Элементы.ДетализацияПоГрузу.ОтборСтрок = Новый ФиксированнаяСтруктура("ГУИДСтроки", Элементы.СоставУслуги.ТекущиеДанные.ГУИДСтроки);
		//Стало:
		мТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
		Элементы.ДетализацияПоГрузу.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючАналитикиПеревозки", мТекущиеДанные.КлючАналитикиПеревозки);
		//Элементы.ДетализацияПоГрузу.ТолькоПросмотр = ЗначениеЗаполнено(мТекущиеДанные.ПеренесенВЗаявку) Или Не мТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка");
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 07.02.2023
		ОбновитьКаскадныйФильтр();
	КонецЕсли;
	
	//Евросиб Каблов 24.01.2022 ( Task 45889
	Элементы.СоставУслугиНомерКТК.ТолькоПросмотр = Ложь;
	//Евросиб Каблов 24.01.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДетализацияПоГрузу()
	Если Элементы.СоставУслуги.ТекущиеДанные <> Неопределено Тогда // US 62421 TA 64346 Евсенкин М.А. 02.03.2023 
		Элементы.СоставУслугиДетализацияПоГрузу.Доступность = Элементы.СоставУслуги.ТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка");
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.03.2023
		Если Элементы.ДетализацияПоГрузу.Видимость 
			И (ЗначениеЗаполнено(Элементы.СоставУслуги.ТекущиеДанные.ПеренесенВЗаявку) 
			Или Не Элементы.СоставУслуги.ТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка")) Тогда 
			Элементы.ДетализацияПоГрузу.ТолькоПросмотр = Истина;
		Иначе 
			Элементы.ДетализацияПоГрузу.ТолькоПросмотр = Ложь;
		КонецЕсли;	
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.03.2023
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьОпасность()
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
	//// Было:
	//МассивОпасныхГУИДов = Новый Массив;

	//Для каждого Стр из Объект.ДетализацияПоГрузу Цикл
	//	Если Стр.ОпасныйГруз Тогда 
	//		МассивОпасныхГУИДов.Добавить(Стр.ГУИДСТроки);   
	//	КонецЕсли;
	//КонецЦикла;
	//Для каждого Стр из Объект.СоставУслуги Цикл
	//	Стр.Опасный = (МассивОпасныхГУИДов.Найти(Стр.ГУИДСТроки) <> неопределено);
	//КонецЦикла;
	//Стало:
	МассивОпасных = Новый Массив;
	Для каждого Стр из ДетализацияПоГрузу Цикл 
		Если Стр.ОпасныйГруз Тогда 
			МассивОпасных.Добавить(Стр.КлючАналитикиПеревозки);
		КонецЕсли;
	КонецЦикла;
	Для каждого Стр из Объект.СоставУслуги Цикл
		Стр.Опасный = (МассивОпасных.Найти(Стр.КлючАналитикиПеревозки) <> неопределено);
	КонецЦикла;
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023 
		
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 07.02.2023
		// Было:
		//Элементы.ДетализацияПоГрузу.ТекущиеДанные.ГУИДСтроки = Элементы.ДетализацияПоГрузу.ОтборСтрок.ГУИДСтроки;
		//Стало:
		Элементы.ДетализацияПоГрузу.ТекущиеДанные.КлючАналитикиПеревозки = Элементы.ДетализацияПоГрузу.ОтборСтрок.КлючАналитикиПеревозки;
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 07.02.2023
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПриИзменении(Элемент)
	ОбновитьДанныеВОбщейСтроке();
	ОбновитьОпасность(); 
	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
	ТекДанн = Элементы.СоставУслуги.ТекущиеДанные;
	НайтиКлючАналитикиПеревозкиКлиент(ТекДанн);	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВОбщейСтроке()

	ТекДан = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если ТекДан = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 

	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
	// Было:  
	//ГУИД = ТекДан.ГУИДСтроки;
	//ИскМасСтр = Объект.ДетализацияПоГрузу.НайтиСтроки(Новый Структура("ГУИДСтроки", ГУИД) );
	//Стало:
	ИскМасСтр = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекДан.КлючАналитикиПеревозки) );
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023
	ВсегоКол = 0; ВсегоВес = 0;
	Для каждого ТекСтрИск Из ИскМасСтр Цикл
	
		Если Не ЗначениеЗаполнено(ТекДан.Груз) Тогда
		
			ТекДан.Груз = ТекСтрИск.Груз;
		
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТекДан.РодУпаковки) Тогда
		
			ТекДан.РодУпаковки = ТекСтрИск.РодУпаковки;
		
		КонецЕсли; 
		
		ВсегоКол = ВсегоКол + ТекСтрИск.КоличествоМест;
		ВсегоВес = ВсегоВес + ТекСтрИск.ВесГруза;
		
	КонецЦикла; 
	
	Если ВсегоКол <> 0 Тогда
	
		ТекДан.КоличествоМест = ВсегоКол;
	
	КонецЕсли; 
	
	Если ВсегоВес <> 0 Тогда
	
		ТекДан.ВесГрузаНетто = ВсегоВес;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОграничения(Команда)
	
	//Элементы.ГруппаОграничения.Видимость = НЕ Элементы.ГруппаОграничения.Видимость;
	//Если Элементы.ГруппаОграничения.Видимость Тогда
	//	ОбновитьОграничения();
	//КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьОграничения()
//	
//	Для каждого Стр из Объект.СоставУслуги Цикл
//		Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
//			СтруктураОграничений = ПолучитьСтруктуруОграничений(Стр.НомерКТК, Объект.Дата);
//			ЗаполнитьЗначенияСвойств(Стр, СтруктураОграничений);
//			Стр.ПунктыСдачи.ЗагрузитьЗначения(СтруктураОграничений.ПунктыСдачи);
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьСтруктуруОграничений(НомерКТК, Дата)
//	
//	Результат = Новый Структура("Направления, ПунктыСдачи, СтокКТК, СВВ, ЗабратьДо", неопределено, Новый Массив, неопределено, неопределено);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	КонтейнерыВСтоках.Регистратор КАК Регистратор,
//	               |	СтокКонтейнеровКонтейнеры.Направление КАК Направление,
//	               |	СтокКонтейнеровКонтейнеры.ПунктОкончательнойСдачи КАК ПунктОкончательнойСдачи,
//	               |	СтокКонтейнеровКонтейнеры.СВВ КАК СВВ,
//	               |	СтокКонтейнеровКонтейнеры.ЗабратьДо КАК ЗабратьДо
//	               |ИЗ
//	               |	РегистрНакопления.КонтейнерыВСтоках КАК КонтейнерыВСтоках
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СтокКонтейнеров.Контейнеры КАК СтокКонтейнеровКонтейнеры
//	               |		ПО КонтейнерыВСтоках.Регистратор = СтокКонтейнеровКонтейнеры.Ссылка
//	               |			И КонтейнерыВСтоках.Контейнер = СтокКонтейнеровКонтейнеры.Контейнер
//	               |ГДЕ
//	               |	КонтейнерыВСтоках.Период < &Период
//	               |	И КонтейнерыВСтоках.Контейнер = &Контейнер
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	КонтейнерыВСтоках.Период УБЫВ";
//	Запрос.УстановитьПараметр("Контейнер", НомерКТК);
//	Запрос.УстановитьПараметр("Период", Дата);
//	Ответ = Запрос.Выполнить().Выбрать();
//	Если Ответ.Следующий() Тогда
//		
//		Результат.Направления = Ответ.Направление;
//		Результат.СтокКТК = Ответ.Регистратор;
//		Результат.СВВ = Ответ.СВВ;
//		Результат.ЗабратьДо = Ответ.ЗабратьДо;
//		ПунктыСдачи = Ответ.ПунктОкончательнойСдачи.Получить();
//		Если ТипЗнч(ПунктыСдачи) = Тип("СписокЗначений") Тогда
//			Результат.ПунктыСдачи = ПунктыСдачи.ВыгрузитьЗначения();
//		КонецЕсли;
//				
//	КонецЕсли;
//	
//	Возврат результат;
//	
//КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Если модифицированность Тогда
	//	Для Каждого Стр Из Объект.Состояния Цикл
	//		// если исполнитель пустой, то проставляем тек пользователя
	//		Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//			Сообщить("Требуется указать исполнителя");
	//			Отказ = Истина;
	//		КонецЕсли;
	//		Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//			Сообщить("Требуется указать наблюдателя");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНеобходимостьМаршрутизацииНаСервере(Знач Объект)
	//СписокРеквизитовДляСравнения = "Организация, Контрагент, ВидПеревозки, Договор, ИсточникЗаявки, НаМоментЗаписиБылаЗадолженность, ЗапросНаКТК, Отправка, ВидПеревозки";  
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(Объект);
	
	//ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	//НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	//Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	//Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	//Объект.Ссылка.ВидПеревозки <> Объект.ВидПеревозки ИЛИ Объект.Состояния.Количество() = 0 ИЛИ
	//Объект.Ссылка.Договор <> Объект.Договор ИЛИ
	//Объект.Ссылка.ИсточникЗаявки <> Объект.ИсточникЗаявки ИЛИ
	//Объект.Ссылка.НаМоментЗаписиБылаЗадолженность <> Объект.НаМоментЗаписиБылаЗадолженность ИЛИ
	Если ДляДанногоОбъектаТребуетсяПеремаршрутизация = Ложь Тогда
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = Документы.Заявка.ТребуетсяМаршрутизацияДляОбъекта_ДополнительноДляЗаявки(Объект);
	КонецЕсли;                                                                   
	//Евросиб - АСуслов 24.12.2021 11:36:23 #
	//(
	//(ЗначениеЗаполнено(Объект.Ссылка.ПСЦ) И НЕ ЗначениеЗаполнено(Объект.ПСЦ)) ИЛИ
	//(НЕ ЗначениеЗаполнено(Объект.Ссылка.ПСЦ) И ЗначениеЗаполнено(Объект.ПСЦ)) ИЛИ
	//)
	//Евросиб - АСуслов 24.12.2021 11:36:23 #
	//Евросиб - АСуслов 24.12.2021 11:34:13 #44642
	//(
	//(Объект.Ссылка.ПереченьРейсов.Количество() = 0 И Объект.ПереченьРейсов.Количество() > 0) ИЛИ
	//(Объект.Ссылка.ПереченьРейсов.Количество() > 0 И Объект.ПереченьРейсов.Количество() = 0) ИЛИ
	//)
	//Евросиб - АСуслов 24.12.2021 11:34:26 #44642
	// Евросиб Фролов (16.11.2021 TASK№ №41969
	//Объект.Ссылка.ЗапросНаКТК <> Объект.ЗапросНаКТК ИЛИ
	// Евросиб Фролов)
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	//Объект.Ссылка.Отправка <> Объект.Отправка ИЛИ
	//Объект.Ссылка.ВидПеревозки <> Объект.ВидПеревозки ИЛИ ИзменилсяСоставЗапроса();
	// Евросиб Фролов)
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаКлиенте
Процедура ЛичныеЦелиОтметкаПриИзменении(Элемент)
	
	ТекД = Элементы.ЛичныеЦели.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекПользователь = ПользователиКлиент.ТекущийПользователь();
		МоиГруппы = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь);
		МоиГруппы.Добавить(ТекПользователь);
		
		ИмеюПравоМенять = (МоиГруппы.найти(ТекД.Исполнитель) <> неопределено);
		
		Если ИмеюПравоМенять Тогда
			ТекД.ДатаОтметки = ТекущаяДата();
			ТекД.Исполнитель = ТекПользователь;
		Иначе
			ТекД.Отметка = НЕ ТекД.Отметка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктПеревалкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Пункты = ПолучитьПунктыПеревалкиПоПорту(Объект.ПортОтправления);
	СписокПунктов = Новый СписокЗначений;
	СписокПунктов.ЗагрузитьЗначения(Пункты);
	ВыбранныйЭлемент = СписокПунктов.НайтиПоЗначению(Объект.ПунктПеревалки);
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораПортовогоТерминала", ЭтаФорма);	
	ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокПунктов, Элемент, ВыбранныйЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПортовогоТерминала(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.ПунктПеревалки = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПунктыПеревалкиПоПорту(Порт)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрузополучателиПоПортам.Грузополучатель КАК Грузополучатель
	|ИЗ
	|	РегистрСведений.ГрузополучателиПоПортам КАК ГрузополучателиПоПортам
	|ГДЕ
	|	ГрузополучателиПоПортам.Порт = &Порт";
	Запрос.УстановитьПараметр("Порт", Порт);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Грузополучатель");
	
КонецФункции

&НаКлиенте
Процедура ПортОтправленияПриИзменении(Элемент)
	
	Объект.ПунктПеревалки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДатуПрибытияНаТерминалИзExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВставкаДатыПрибытияНаТерминал", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК, РазмерКТК, ПоказыватьДатуВзятия, ПередаватьИсходныеНомера, ФорматДаты", Истина, Истина, Истина, Истина, 2), ЭтаФорма.УникальныйИдентификатор,,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкаДатыПрибытияНаТерминал(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 по П1.КТК.Количество() - 1 Цикл
		
		КТКНайден = Ложь;
		Для каждого Стр из Объект.СоставУслуги Цикл
			Если Строка(Стр.НомерКТК) = П1.КТК[Сч] Тогда КТКНайден = Истина; Стр.ВремяПрибытияНаТерминал = П1.ДатыКТК[Сч]; КонецЕсли;
		КонецЦикла;
		Если НЕ КТКНайден Тогда
			
			Сообщить("Данные по контейнеру " + П1.КТК[Сч] + " не удалось записать в документ. Контейнер не найден.");
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиКалькуляцияПриИзменении(Элемент)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	//Евросиб Коханенко Н.А. 25.07.2023 (( #72829
	ДобавлениеНевозможно = ПроверитьНаВозможностьВыбораКалькуляцииПоРезультатамСогласования(Объект.Ссылка, ТекД.Калькуляция);
	Если ДобавлениеНевозможно Тогда
		ТекД.Калькуляция = Неопределено;
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.07.2023 )) #72829 
	
	Результат = ПолучитьДанныеКалькуляции(ТекД.Калькуляция);
	
	//Евросиб Каблов 31.10.2020 ( Ticket#0212382
	//ЗаполнитьЗначенияСвойств(ТекД, Результат);
	ЗаполненныеПоля = Новый Массив;			
	Если ЗначениеЗаполнено(ТекД.СтанцияОтправления) Тогда
		ЗаполненныеПоля.Добавить("СтанцияОтправления");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекД.СтанцияНазначения) Тогда
		ЗаполненныеПоля.Добавить("СтанцияНазначения");
	КонецЕсли;
	ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
	ЗаполнитьЗначенияСвойств(ТекД, Результат,, ИменаЗаполненныхПолей);
	//Евросиб Каблов 31.10.2020 )
	
	Если ЗаполнятьПоПервойСтроке Тогда 
		Для Сч = 1 по Объект.СоставУслуги.Количество()-1 Цикл
			
			//Евросиб Каблов 31.10.2020 ( Ticket#0212382
			//ЗаполнитьЗначенияСвойств(Объект.СоставУслуги[Сч], Результат);
			СтрокаТЧ = Объект.СоставУслуги[Сч];
			ЗаполненныеПоля = Новый Массив;			
			Если ЗначениеЗаполнено(СтрокаТЧ.СтанцияОтправления) Тогда
				ЗаполненныеПоля.Добавить("СтанцияОтправления");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧ.СтанцияНазначения) Тогда
				ЗаполненныеПоля.Добавить("СтанцияНазначения");
			КонецЕсли;
			ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Результат,, ИменаЗаполненныхПолей);
			//Евросиб Каблов 31.10.2020 )
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	Если НЕ ЗначениеЗаполнено(ГруппаДКС) Тогда
		ГруппаДКС = Результат.ГруппаДКС;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКалькуляции(Калькуляция) 
	
	//Результат = Новый Структура("Услуга, СтанцияОтправления, СтанцияНазначения, ПунктОтправления, ПунктНазначения, УсловияПеревозки, УсловияПеревозкиНазначение, Груженый");
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	Результат = Новый Структура("Услуга, СтанцияОтправления, СтанцияНазначения, ПунктОтправления, ПунктНазначения, УсловияПеревозки, УсловияПеревозкиНазначение, Груженый, ГруппаДКС");
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//Евросиб Коханенко Н.А. 24.04.2024 (( #84617
	Результат.Вставить("УчетноеНаправление", Справочники.УчетныеНаправления.ПустаяСсылка());
	//Евросиб Коханенко Н.А. 24.04.2024 )) #84617
	
	Если ЗначениеЗаполнено(Калькуляция) тогда
		//Результат.Услуга = Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
		РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Калькуляция, "ОсновнаяУслуга, ТипКалькуляции");
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
		//ДИТ, Беляев СЮ, Ticket#0291639, 10-11-2022, начало
		Если Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
			// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 ((
			//Результат.Услуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "ОсновнаяУслуга");
			//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
			Результат.Услуга = РеквизитыКалькуляции.ОсновнаяУслуга;
			//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
			// Евросиб Рыбьяков К.А. 02.07.2024 ))
			//Результат.Услуга = Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0291639, 10-11-2022, конец  
		// ДИТ US 59973 ТА 76151 Сержантова А.С. Начало: 16.10.2023
		//Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Субсидии Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
		Если РеквизитыКалькуляции.ТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии ИЛИ РеквизитыКалькуляции.ТипКалькуляции = Перечисления.ТипыКалькуляций.Премии Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец	
			Результат.Услуга = Справочники.Номенклатура.Премия;	
		КонецЕсли;
		// ДИТ US 59973 ТА 76151 Сержантова А.С. Конец: 16.10.2023
		Результат.СтанцияОтправления = Калькуляция.Суша_ПунктОтправления;
		Результат.ПунктОтправления = Калькуляция.Суша_ПунктОтправления;
		Результат.СтанцияНазначения = Калькуляция.Суша_ПунктНазначения;
		Результат.ПунктНазначения = Калькуляция.Суша_ПунктНазначения;
		результат.Груженый = Калькуляция.ММ_ГруженыйПоМорю;
		Результат.УсловияПеревозки = Калькуляция.УсловияПеревозки_Отправление;
		Результат.УсловияПеревозкиНазначение = Калькуляция.УсловияПеревозки_Прибытие;
		
		//Евросиб Коханенко Н.А. 24.04.2024 (( #84617
		Результат.Вставить("УчетноеНаправление", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "УчетноеНаправление"));
		//Евросиб Коханенко Н.А. 24.04.2024 )) #84617
		
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
		Результат.ГруппаДКС = Справочники.ГруппыДКС.ОпределитьГруппуДКС( РеквизитыКалькуляции.ТипКалькуляции );
		//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДополнительныеКолонки(Команда)
	
	//Элементы.СоставУслугиНормативноеИспользованиеИзСтока.Видимость = Истина;
	Элементы.СоставУслугиСрокОтправкиУведомления.Видимость = Истина;
	Элементы.СоставУслугиГУИДСтроки.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиГрузПриИзменении(Элемент)
			
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ТекД <> неопределено Тогда   
		
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
		ТекСтрока = Объект.СоставУслуги.НайтиПоИдентификатору(Элементы.СоставУслуги.ТекущаяСтрока);
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
		
		ТекД.КодГруза = ПолучитьЕТСНГГруза(ТекД.Груз);
		
		Если ЗаполнятьПоПервойСтроке Тогда
			ИмяТЧ = "СоставУслуги";
			ИмяПоля = "КодГруза";
			
			//Если МассивРазрешенныхПолей.Найти(ИмяПоля) = неопределено Тогда Возврат; КонецЕсли;
			Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
				Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
			КонецЦикла;
		КонецЕсли;
		
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
		//ОбновитьВидимостьДетализацияПоГрузу();  // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.03.2023

		Если ТекД.Груз <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
			// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 13.02.2023
			// Было:
			//Объект.ДетализацияПоГрузу.Очистить();	  
			//Стало:
			Найдено = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекД.КлючАналитикиПеревозки));
			Для Каждого СтрНайдено Из Найдено Цикл 
				ДетализацияПоГрузу.Удалить(ДетализацияПоГрузу.Индекс(СтрНайдено));
			КонецЦикла;   
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023   
		Иначе
			Найдено = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекД.КлючАналитикиПеревозки));
			КоличествоМест = 0;
			ВесГруза = 0;
			Для Каждого СтрНайдено Из Найдено Цикл 
				КоличествоМест = КоличествоМест + СтрНайдено.КоличествоМест;
				ВесГруза = ВесГруза + СтрНайдено.ВесГруза;
			КонецЦикла;	 
			ТекСтрока.ВесГрузаНетто = ВесГруза;
			ТекСтрока.КоличествоМест = КоличествоМест;  
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
		КонецЕсли;     
	
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023   
		НаименованиеГруза = ВРег(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекД.Груз, "Наименование"));
		Если СтрНайти(НаименованиеГруза, "КОНТЕЙНЕРЫ УНИВЕРСАЛЬНЫЕ ПОРОЖНИЕ") <> 0 
			или не ЗначениеЗаполнено(ТекД.Груз) Тогда
			ТекСтрока.Груженый = Ложь;	
		Иначе	
		    ТекСтрока.Груженый = Истина;
		КонецЕсли;
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023

		мТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
		НайтиКлючАналитикиПеревозкиКлиент(мТекущиеДанные);
		
		Если Элементы.ДетализацияПоГрузу.Видимость 
			И (ЗначениеЗаполнено(мТекущиеДанные.ПеренесенВЗаявку) 
			Или Не мТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка")) Тогда 
			Элементы.ДетализацияПоГрузу.ТолькоПросмотр = Истина;
		Иначе 
			Элементы.ДетализацияПоГрузу.ТолькоПросмотр = Ложь;	
		КонецЕсли;
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 13.02.2023
		//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕТСНГГруза(Груз)
	
	Возврат Груз.ЕТСНГ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГрузПоЕТСНГ(ЕТСНГ)
	
	Возврат Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", ЕТСНГ);
	
КонецФункции

&НаКлиенте
Процедура СоставУслугиКодГрузаПриИзменении(Элемент)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.Груз = ПолучитьГрузПоЕТСНГ(ТекД.КодГруза);
		
		Если ЗаполнятьПоПервойСтроке Тогда
			ИмяТЧ = "СоставУслуги";
			ИмяПоля = "Груз";
			
			//Если МассивРазрешенныхПолей.Найти(ИмяПоля) = неопределено Тогда Возврат; КонецЕсли;
			Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
				Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
			КонецЦикла;
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Сообщить("Удаление запрещено.");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиЗаявки(Команда)
	
	//ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	//
	//Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.НомерКТК) И ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	
	//	Сделка = ЗаявкаВключенаВСделку(Объект.Ссылка);
	//	Если  Сделка <> неопределено Тогда
	//		
	//		ПоказатьПредупреждение(, "Удаление запрещено! Заявка включена в сделку: " + Сделка);
	//		Возврат;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
	МассивГУИД = Новый Массив;
	Для каждого Стр из Элементы.СоставУслуги.ВыделенныеСтроки Цикл
		СтрокаСоставУслуги = Объект.СоставУслуги.НайтиПоИдентификатору(Стр);
		МассивГУИД.Добавить(СтрокаСоставУслуги.ГУИДСтроки);
	КонецЦикла;

	СтруктураРезультатПроверки = СтрокиВключенныеВСделки(Объект.Ссылка, МассивГУИД);
	Если СтруктураРезультатПроверки.ЕстьСтрокиВключенныеВСделки Тогда
		СтрокаСписокСделок = СтрСоединить(СтруктураРезультатПроверки.Сделки, ", ");
		ПоказатьПредупреждение(, "Удаление запрещено! Заявка включена в сделку: " + СтрокаСписокСделок);
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец
	
	ОпОп = Новый ОписаниеОповещения("УдалениеПодтверждено", ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Вы действительно хотите удалить выбранные строки?", РежимДиалогаВопрос.ДаНет);
	
	
	
КонецПроцедуры

//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, закомментировал, не используется
//&НаСервереБезКонтекста
//Функция ЗаявкаВключенаВСделку(Заявка)
//	
//	Результат = неопределено;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
//	               |ГДЕ
//	               //|	НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления И //ДИТ, Беляев СЮ, Ticket#0329859, 24-11-2023 (закомментировал, пользователи таким образом обходят проверку)
//	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка";
//	Запрос.УстановитьПараметр("Заявка", Заявка);
//	Ответ = Запрос.Выполнить().Выбрать();
//	Если Ответ.Следующий() Тогда
//		Результат = Ответ.Ссылка;
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, начало
&НаСервереБезКонтекста
Функция СтрокиВключенныеВСделки(Заявка, МассивГУИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка = &Заявка
	               |	И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки В(&МассивГУИД)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ.Сделка КАК Сделка
	               |ИЗ
	               |	ВТ КАК ВТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	               |ИЗ
	               |	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	МассивСделок = РезультатЗапросаПакет[1].Выгрузить().ВыгрузитьКолонку("Сделка");
	МассивГУИД = РезультатЗапросаПакет[2].Выгрузить().ВыгрузитьКолонку("ГУИДСтрокиЗаявки");
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ЕстьСтрокиВключенныеВСделки",	МассивСделок.Количество() <> 0);
	СтруктураРезультат.Вставить("Сделки",						МассивСделок);
	СтруктураРезультат.Вставить("ГУИДыСтрокЗаявки",				МассивГУИД);
	
	Возврат СтруктураРезультат;
	
КонецФункции
//ДИТ, Беляев СЮ, BUG 80907/ TA 80909, 09-02-2024, конец

&НаКлиенте
Процедура УдалениеПодтверждено(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	УдаляемыеСтроки = Новый Массив;
	
	Для каждого Стр из Элементы.СоставУслуги.ВыделенныеСтроки Цикл
		
		УдаляемыеСтроки.Добавить(Объект.СоставУслуги.НайтиПоИдентификатору(Стр));
		
	КонецЦикла;
	
	Для каждого Стр2 из УдаляемыеСтроки Цикл
		//Субботин 77659 05.12.2023 Начало
		УбратьКТКИзЗапросаКТК(Стр2, Истина);	
		//Субботин 77659 05.12.2023 Конец
		
		//Евросиб Коханенко Н.А. 30.07.2024 (( #88606
		//добавим в массив, чтобы при записи очистить поле Заявка в шапке ключа аналитики
		КлючиАналитикиУдаленныхСтрок.Добавить(Стр2.КлючАналитикиПеревозки); 
		//Евросиб Коханенко Н.А. 30.07.2024 )) #88606

		Объект.СоставУслуги.Удалить(Стр2);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиКоносаменты(Команда)
	
	КТКДляПоиска = Новый Массив;
	Для каждого Стр из Объект.СоставУслуги Цикл
		
		Если ЗначениеЗаполнено(Стр.НомерКТК) И НЕ ЗначениеЗаполнено(Стр.Коносамент) Тогда
			КТКДляПоиска.Добавить(Стр.НомерКТК);
		КонецЕсли;
		
	КонецЦикла;
	
	Соответствие_КТК_Коносамент = ПолучитьСоответствиеПоКоносаментам(КТКДляПоиска);
	
	Для каждого Стр из Объект.СоставУслуги Цикл
		
		Если ЗначениеЗаполнено(Стр.НомерКТК) И НЕ ЗначениеЗаполнено(Стр.Коносамент) Тогда
			
			Стр.Коносамент = Соответствие_КТК_Коносамент[Стр.НомерКТК];
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеПоКоносаментам(КТКДляПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК,
	               |	ТранспортныйДокументКоносаменты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	               |ГДЕ
	               |	НЕ ТранспортныйДокументКоносаменты.Ссылка.ПометкаУдаления
	               |	И ТранспортныйДокументКоносаменты.НомерКТК В(&КТКДляПоиска)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокументКоносаменты.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("КТКДляПоиска", КТКДляПоиска);
	РЕЗТЧ = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Соответствие;
	
	Для каждого Стр из КТКДляПоиска Цикл
		
		Для каждого СтрТЧ из РЕЗТЧ Цикл
			
			Если Стр = СтрТЧ.НомерКТК Тогда Результат.Вставить(Стр, СтрТЧ.Ссылка); Прервать; КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьГрузДляВыбранныхСтрок(Команда)
	
	Если Объект.ОтправляемыеГрузы.Количество() > 0 Тогда
		
		СписокГрузов = Новый СписокЗначений;
		Для Каждого СтрокаТЧ Из Объект.ОтправляемыеГрузы Цикл
			Если СписокГрузов.НайтиПоЗначению(СтрокаТЧ.Груз) = Неопределено Тогда
				СписокГрузов.Добавить(СтрокаТЧ.Груз);				
			КонецЕсли;
		КонецЦикла;
				
		ДополнительныеПараметры = Новый Структура;
		ВыделенныеСтроки = Элементы.СоставУслуги.ВыделенныеСтроки;
		ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
		
		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработатьВыборГруза", ЭтаФорма, ДополнительныеПараметры);
		СписокГрузов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выберите груз");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборГруза(ВыбранныйГруз, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйГруз <> Неопределено Тогда
		Груз = ВыбранныйГруз.Значение;
		КодЕТСНГ = ЗначениеРеквизитаОбъекта(Груз, "ЕТСНГ");		
		ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			СтрокаТЧ = Объект.СоставУслуги.НайтиПоИдентификатору(ИдентификаторСтроки);
			СтрокаТЧ.Груз = Груз;
			СтрокаТЧ.КодГруза = КодЕТСНГ;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	РазрешитьВыборПроизвольнойКалькуляции = РазрешитьВыборПроизвольнойКалькуляции_функция(Объект.ВидПеревозки);
	ОбновитьОтображениеКолонокТЧ();
	
	//Евросиб Коханенко Н.А. 24.01.2025 (( #98939
	ВидимостьЧекБоксаОтключитьАвтоподборРейсов = (Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
	Элементы.АвтозагрузкаРейсовИзДХ.Видимость = ВидимостьЧекБоксаОтключитьАвтоподборРейсов;
	//Евросиб Коханенко Н.А. 24.01.2025 )) #98939
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтейнерыИзАРМНакладные(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Отправка) Тогда
		ПоказатьПредупреждение(, "Не указана Дата отправки!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		ПоказатьПредупреждение(, "Не указан Грузоотправитель!");
		Возврат;
	КонецЕсли;
	
	СтрокиБезКонтейнеров = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка")));
	МаксимальноеКоличествоВыбранныхСтрок = СтрокиБезКонтейнеров.Количество();
	Если МаксимальноеКоличествоВыбранныхСтрок = 0 Тогда
		ПоказатьПредупреждение(, "Нет строк без контейнеров!");
		Возврат;
	КонецЕсли;    
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 28.03.2024 
	СтрокиБезКлюча = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ПредопределенноеЗначение("Справочник.КлючиАналитикиПеревозки.ПустаяСсылка")));
	Если СтрокиБезКлюча.Количество() > 0 Тогда
		ПоказатьПредупреждение(, "Необходимо сначала записать заявку!");
		Возврат;
	КонецЕсли; 
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 28.03.2024
	
	Грузополучатели = Новый Массив;
	СтанцииОтправления = Новый Массив;
	СтанцииНазначения = Новый Массив;
	Для Каждого СтрокаБезКонтейнера Из СтрокиБезКонтейнеров Цикл
		Если ЗначениеЗаполнено(СтрокаБезКонтейнера.Грузополучатель) И Грузополучатели.Найти(СтрокаБезКонтейнера.Грузополучатель) = Неопределено Тогда
			Грузополучатели.Добавить(СтрокаБезКонтейнера.Грузополучатель);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаБезКонтейнера.СтанцияОтправления) И СтанцииОтправления.Найти(СтрокаБезКонтейнера.СтанцияОтправления) = Неопределено Тогда
			СтанцииОтправления.Добавить(СтрокаБезКонтейнера.СтанцияОтправления);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаБезКонтейнера.СтанцияНазначения) И СтанцииНазначения.Найти(СтрокаБезКонтейнера.СтанцияНазначения) = Неопределено Тогда
			СтанцииНазначения.Добавить(СтрокаБезКонтейнера.СтанцияНазначения);
		КонецЕсли;
	КонецЦикла;
	
	Грузополучатель = Неопределено;
	Если Грузополучатели.Количество() > 0  Тогда
		Грузополучатель = Грузополучатели[0];
	Иначе
		ПоказатьПредупреждение(, "Не указан Грузополучатель!");
		Возврат;
	КонецЕсли;
	
	Если СтанцииОтправления.Количество() = 1 Тогда
		СтанцияОтправления = СтанцииОтправления[0];
	Иначе
		СтанцияОтправления = Неопределено;
	КонецЕсли;
	
	Если СтанцииНазначения.Количество() = 1 Тогда
		СтанцияНазначения = СтанцииНазначения[0];
	Иначе
		СтанцияНазначения = Неопределено;
	КонецЕсли;
	
	ПараметрыФормыПодбораНакладных = Новый Структура;
	ПараметрыФормыПодбораНакладных.Вставить("ПодборВДокумент", Истина);
	ПараметрыФормыПодбораНакладных.Вставить("ДатаНачала", НачалоДня(Объект.Отправка));
	ПараметрыФормыПодбораНакладных.Вставить("ДатаОкончания", КонецДня(Объект.Отправка));
	ПараметрыФормыПодбораНакладных.Вставить("Грузоотправитель", Объект.Грузоотправитель);
	ПараметрыФормыПодбораНакладных.Вставить("Грузополучатель", Грузополучатель);
	ПараметрыФормыПодбораНакладных.Вставить("СтанцияОтправления", СтанцияОтправления);
	ПараметрыФормыПодбораНакладных.Вставить("СтанцияНазначения", СтанцияНазначения);
	Если ЗначениеЗаполнено(СтанцияНазначения) И ЗначениеЗаполнено(СтанцияОтправления) Тогда
		ПараметрыФормыПодбораНакладных.Вставить("ВыполнитьПоискПриОткрытии", Истина);
	КонецЕсли;
	ПараметрыФормыПодбораНакладных.Вставить("МаксимальноеКоличествоВыбранныхСтрок", МаксимальноеКоличествоВыбранныхСтрок);	
	
	ОповещениеОПодбореКонтейнеров = Новый ОписаниеОповещения("ОбработатьВыборКонтейнеровИзАРМНакладные", ЭтаФорма);
	//ДИТ Шевченко А.В. 16.09.2022 55882 -начало
	ОткрытьФорму("Обработка.АРМНакладные.Форма", ПараметрыФормыПодбораНакладных, ЭтаФорма,,,, ОповещениеОПодбореКонтейнеров, РежимОткрытияОкнаФормы.Независимый);
	//ДИТ Шевченко А.В. 16.09.2022 55882 -конец
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКонтейнеровИзАРМНакладные(АдресТаблицы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(АдресТаблицы) Тогда
		ОбработатьВыборКонтейнеровИзАРМНакладныеСервер(АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборКонтейнеровИзАРМНакладныеСервер(АдресТаблицы)
	
	ВыбранныеНакладные = ПолучитьИзВременногоХранилища(АдресТаблицы);
	УдалитьИзВременногоХранилища(АдресТаблицы);
		
	Для Каждого Стр Из ВыбранныеНакладные Цикл
		
		Если Стр.ГрузоотправительСсылка <> Объект.Грузоотправитель Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиПоКонтейнеру = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", Стр.КонтейнерСсылка));
		Если СтрокиПоКонтейнеру.Количество() > 0 Тогда
			ТекстСообщения = СтрШаблон("Контейнер %1 уже выбран в строке №%2!", Стр.КонтейнерСсылка, СтрокиПоКонтейнеру[0].НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		СтрокиБезКонтейнера = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК, Грузополучатель", Справочники.ТЕ.ПустаяСсылка(), Стр.ГрузополучательСсылка));
		Если СтрокиБезКонтейнера.Количество() > 0 Тогда
			СтрокаЗаявки = СтрокиБезКонтейнера[0];
			СтрокаЗаявки.НомерКТК = Стр.КонтейнерСсылка;
			СтрокаЗаявки.ТипКТК = Стр.ТипКонтейнера;
			СтрокаЗаявки.РазмерКТК = Стр.РазмерКонтейнера;
			// ДИТ US 76659 ТА 77825 Сержантова А.С. Начало: 20.02.2024 
			// Было:
			//СтрокаЗаявки.ВидСобственности = Стр.ПризнакСобственности;
			//Если ЗначениеЗаполнено(СтрокаЗаявки.ВидСобственности) Тогда
			//	СтрокаЗаявки.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба");
			//Иначе
			//	СтрокаЗаявки.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента");
			//КонецЕсли;
			//// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(СтрокаЗаявки);
			//// ДИТ 65580 Давудов М.А. Конец: 23.02.2023  
			ЗаполнитьСобственностьПриВыбореКонтейнера(СтрокаЗаявки.ПолучитьИдентификатор());
			// ДИТ US 76659 ТА 77825 Сержантова А.С. Конец: 20.02.2024  
			
			// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 28.03.2024
			ЗаполнитьВСтрокеГрузыИзНакладной(СтрокаЗаявки, Стр.Документ); 
			// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 28.03.2024
		Иначе
			ТекстСообщения = СтрШаблон("Контейнер %3 не добавлен, т.к. не найдена строка, где Номер КТК не заполнен, Грузополучатель: %1 и размер КТК: %2!", Стр.ГрузополучательСсылка, Стр.РазмерКонтейнера, Стр.КонтейнерСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
						
	КонецЦикла;	 
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 16.04.2024
	ЭтаФорма.Модифицированность = Истина;
	ЭтаФорма.МодифицированностьФлаг = Истина;
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 16.04.2024
	
КонецПроцедуры  

// ДИТ US 81881 ТА 81882 Сержантова А.С. 01.04.2024  
&НаСервере
Процедура ЗаполнитьВСтрокеГрузыИзНакладной(СтрокаУслуг, НакладнаяЖД, ТекстСообщенияПользователю = "")

	ТЧГрузы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НакладнаяЖД, "ГрузыЖД"); 
	ДетализацияГрузаСтроки = ДетализацияПоГрузу.Выгрузить();  
	ДетализацияГрузаСтроки.Очистить();
	ДетализацияГрузаСтроки.Колонки.Добавить("КодГруза"); 
	ДетализацияГрузаСтроки.Колонки.Добавить("Груженый"); 
	ДетализацияГрузаСтроки.Колонки.Добавить("ВесГрузаНетто");
	ВыборкаГрузов = ТЧГрузы.Выбрать(); 
	МассивГрузов = Новый Массив;
	Пока ВыборкаГрузов.Следующий() Цикл    
		МассивГрузов.Добавить(ВыборкаГрузов.ЕТСНГ);
	КонецЦикла;   
	ВыборкаГрузов.Сбросить();
	
	СоответствиеГрузаДК = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.ПолучитьСопоставлениеЭтранДатакор(МассивГрузов);  
	Пока ВыборкаГрузов.Следующий() Цикл
		Груз = СоответствиеГрузаДК.Получить(ВыборкаГрузов.ЕТСНГ);   
		Если не ЗначениеЗаполнено(Груз) Тогда
			Продолжить;
		КонецЕсли;   
		НС = ДетализацияГрузаСтроки.Добавить();  
		НС.Груженый = Истина;
		НС.Груз = Груз;
		НС.КодГруза = ВыборкаГрузов.КодЕТСНГ;
		НС.КоличествоМест = ВыборкаГрузов.КоличествоМест; 
		НС.ВесГруза = ВыборкаГрузов.МассаГруза; 
		НС.ВесГрузаНетто = ВыборкаГрузов.МассаГруза;
		//НС.РодУпаковки = ВыборкаГрузов.ВидУпаковки; 
		НС.КлючАналитикиПеревозки = СтрокаУслуг.КлючАналитикиПеревозки;
	КонецЦикла;
	
	Если ДетализацияГрузаСтроки.Количество() > 0 Тогда  
		
		СтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаУслуг.КлючАналитикиПеревозки));
			
		Если ДетализацияГрузаСтроки.Количество() = 1 Тогда
			
			СтрокаЗаполняемыхПолей = "Груженый";
			Если Не ЗначениеЗаполнено(СтрокаУслуг.ВесГрузаНетто) Тогда
				СтрокаЗаполняемыхПолей = СтрокаЗаполняемыхПолей + ",ВесГрузаНетто";
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаУслуг.Груз) Тогда
				СтрокаЗаполняемыхПолей = СтрокаЗаполняемыхПолей + ",Груз,КодГруза";
			КонецЕсли;   
			Если Не ЗначениеЗаполнено(СтрокаУслуг.КоличествоМест) Тогда
				СтрокаЗаполняемыхПолей = СтрокаЗаполняемыхПолей + ",КоличествоМест";
			КонецЕсли;    
			Если СтрокаЗаполняемыхПолей <> "Груженый" Тогда
				Для каждого СтрДетализации Из СтрокиДетализации Цикл
					ДетализацияПоГрузу.Удалить(СтрДетализации);
				КонецЦикла;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаУслуг, ДетализацияГрузаСтроки[0], СтрокаЗаполняемыхПолей); 
			ТекстСообщенияПользователю = ТекстСообщенияПользователю + " Дозаполнены параметры груза.";   
		Иначе 
			Если Не ЗначениеЗаполнено(СтрокаУслуг.Груз) и Не ЗначениеЗаполнено(СтрокаУслуг.КоличествоМест)
				и Не ЗначениеЗаполнено(СтрокаУслуг.ВесГрузаНетто) Тогда
				Для каждого СтрДетализации Из СтрокиДетализации Цикл
					ДетализацияПоГрузу.Удалить(СтрДетализации);
				КонецЦикла;
				СтрокаУслуг.Груз = Справочники.Грузы.СборнаяКонтейнернаяОтправка;
				СтрокаУслуг.ВесГрузаНетто = ДетализацияГрузаСтроки.Итог("ВесГруза");
				СтрокаУслуг.КоличествоМест = ДетализацияГрузаСтроки.Итог("КоличествоМест");
				Для каждого СтрГруза Из ДетализацияГрузаСтроки Цикл
					СтрДетализации = ДетализацияПоГрузу.Добавить();
					ЗаполнитьЗначенияСвойств(СтрДетализации, СтрГруза); 
				КонецЦикла;	  
				ТекстСообщенияПользователю = ТекстСообщенияПользователю + " Заполнены параметры груза в таблице детализация по грузу.";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПСЦПриИзменении(Элемент)
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекД.ПСЦ) Тогда
		ПСЦПриИзменении(неопределено, ТекД.ПСЦ);
	//Евросиб Коханенко Н.А. 24.02.2025 (( #101467
	Иначе
		ТекД.Калькуляция = Неопределено;	
	//Евросиб Коханенко Н.А. 24.02.2025 )) #101467
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязатьКТКСоСтоками(Команда, ВыводитьСообщения = Истина)
	
	// Евросиб Фролов (25.04.2022 Task №50008
	// В тестовой была проверка на заполненность ссылки, а в рабочей не было.
	// Перенес в рабочую.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// Евросиб Фролов)
	
	СвоиКТК = Новый Массив;
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//СвоиКТК.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Арендованный"));
	//Стало:
	СвоиКТК.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.АрендаДлительная"));
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	СвоиКТК.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Собственный"));
	СвоиКТК.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Спот"));
	
	Для каждого Стр из Объект.СоставУслуги Цикл
		
		Если Стр.План ИЛИ НЕ ЗначениеЗаполнено(Стр.НомерКТК) ИЛИ Стр.ПринадлежностьТЕ <> ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба") Тогда Продолжить; КонецЕсли;
		
		//Если РаботаЧерезАРМКТК Тогда
			
			ДанныеАРМКТК = УправлениеКТКВСтокахСервер.ПолучитьДанныеКТКизАРМКТК(Стр.НомерКТК);
			
			//Если ЗначениеЗаполнено(ДанныеАРМКТК.тек_Сток) Тогда
				
				Стр.План = Истина;
				
				//СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ПринадлежностьТЕ", Стр.НомерКТК, Стр.ПринадлежностьТЕ, ДанныеАРМКТК.тек_ВидСобственности);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ВидСобственности", Стр.НомерКТК, Стр.ВидСобственности, ДанныеАРМКТК.тек_ВидСобственности);
				СтрПринадлежностьТЕ = АРМ_Сервер.ОпределитьПринадлежностьПоВидуСобственности(Стр.ВидСобственности);
				Если ЗначениеЗаполнено(СтрПринадлежностьТЕ) Тогда
					Стр.ПринадлежностьТЕ = СтрПринадлежностьТЕ;
					// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
					ЗаполнитьСвязанныеПоляПринадлежностьТЕ(Стр.ПолучитьИдентификатор());
					// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				КонецЕсли;
				
				// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
				//ок(
				//СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("СобственностьПеревозимогоКТК", Стр.НомерКТК, Стр.СобственностьПеревозимогоКТК, ДанныеАРМКТК.тек_СобственностьКТК);
				//ок)
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("УдалитьСобственностьПеревозимогоКТК", Стр.НомерКТК, Стр.УдалитьСобственностьПеревозимогоКТК, ДанныеАРМКТК.Удалитьтек_СобственностьКТК);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ПринадлежностьТЕ", Стр.НомерКТК, Стр.ПринадлежностьТЕ, ДанныеАРМКТК.тек_ПринадлежностьТЕ);
				// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ВладелецКТК", Стр.НомерКТК, Стр.ВладелецКТК, ДанныеАРМКТК.тек_Собственник);
				//Субботин 82200 25.03.2024 начало //удалил заполнение релиза
				//СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("Релиз", Стр.НомерКТК, Стр.Релиз, ДанныеАРМКТК.тек_Релиз);
				//СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("Релиз", Стр.НомерКТК, Стр.Релиз, ДанныеАРМКТК.тек_Релиз);
				//Субботин 82200 25.03.2024 Конец //удалил заполнение релиза
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ЗаявкаНаВыдачу", Стр.НомерКТК, Стр.ЗаявкаНаВыдачу, ДанныеАРМКТК.кл_ЗаявкаНаВыдачу);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("СтокВыдачи", Стр.НомерКТК, Стр.СтокВыдачи, ДанныеАРМКТК.тек_Сток);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ДатаВыдачи", Стр.НомерКТК, Стр.ДатаВыдачи, ДанныеАРМКТК.кл_ДатаВыдачи);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("НормативноеИспользование", Стр.НомерКТК, Стр.НормативноеИспользование, ДанныеАРМКТК.кл_СрокПользования);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ФИОВодителя", Стр.НомерКТК, Стр.ФИОВодителя, ДанныеАРМКТК.кл_ВодительЗабор);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("НомерАвто", Стр.НомерКТК, Стр.НомерАвто, ДанныеАРМКТК.кл_НомерТСЗабор);
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
				// Было:
				//СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ИнструкцииПоСдачеПорожнего", Стр.НомерКТК, Стр.ИнструкцииПоСдачеПорожнего, ДанныеАРМКТК.тек_ИнструкцияПоСдаче);
				//Стало:
				ИнструкцииПоСдачеПорожнего = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ИнструкцииПоСдачеПорожнего", Стр.НомерКТК, ИнструкцииПоСдачеПорожнего, ДанныеАРМКТК.тек_ИнструкцияПоСдаче);
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023							
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("СтокСдачиПорожнего", Стр.НомерКТК, Стр.СтокСдачиПорожнего, ДанныеАРМКТК.тек_СтокСдачи);
				СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение("ДатаВозвратаКлиентом", Стр.НомерКТК, Стр.ДатаВозвратаКлиентом, ДанныеАРМКТК.кл_ДатаВозврата);
				
				//Стр.ПринадлежностьТЕ = ?(СвоиКТК.Найти(ДанныеАРМКТК.тек_ВидСобственности) <> неопределено, ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба"), ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента"));
				//Стр.СобственностьПеревозимогоКТК = ДанныеАРМКТК.тек_СобственностьКТК;
				//Стр.ВидСобственности = ДанныеАРМКТК.тек_ВидСобственности;
				//Стр.ВладелецКТК = ДанныеАРМКТК.тек_Собственник;
				//Стр.СтокВыдачи = ДанныеАРМКТК.тек_Сток;
				//Стр.СтокСдачиПорожнего = ДанныеАРМКТК.тек_СтокСдачи;
				//Стр.ДатаВзятия = ДанныеАРМКТК.тек_ДатаВзятияИзСтока;
				//Стр.ДатаПриемаВПользованиеПередПоставщиком = ДанныеАРМКТК.тек_ДатаПриемаВПользование;
				//Стр.ДатаВыдачи = ДанныеАРМКТК.кл_ДатаВыдачи;
				//Стр.Релиз = ДанныеАРМКТК.тек_Релиз;
				//Стр.ФИОВодителя = ДанныеАРМКТК.кл_ВодительЗабор;
				//Стр.НомерАвто = ДанныеАРМКТК.кл_НомерТСЗабор;
				//Стр.ИнструкцииПоСдачеПорожнего = ДанныеАРМКТК.тек_ИнструкцияПоСдаче;
				
				//Стр.НормативноеИспользованиеИзСтока = ДанныеАРМКТК.тек_СрокВозврата;
				//Стр.НормативноеИспользование = ДанныеАРМКТК.кл_СрокПользования;
				//Стр.ДатаВозвратаКлиентом = ДанныеАРМКТК.кл_ДатаВозврата;
				//Если НЕ ЗначениеЗаполнено(Стр.ДатаПостановкиВРезерв) И ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
				//	Стр.ДатаПостановкиВРезерв = Мин(Объект.Дата+1, Стр.ДатаВзятия)-1;
				//ИначеЕсли НЕ ЗначениеЗаполнено(Стр.ДатаПостановкиВРезерв) Тогда
				//	Стр.ДатаПостановкиВРезерв = Объект.Дата;
				//	Стр.ДатаВзятия = Объект.Дата+1;
				//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКаскадныйФильтр()
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если ТекД <> неопределено Тогда
		
		Элементы.СоставУслугиВидСобственности.СписокВыбора.Очистить();
		Если ТекД.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента") Тогда
			Элементы.СоставУслугиВидСобственности.СписокВыбора.ЗагрузитьЗначения(ВидыСобственностиКлиентскогоКТК.ВыгрузитьЗначения());
		ИначеЕсли ТекД.ПринадлежностьТЕ = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба") Тогда
			Элементы.СоставУслугиВидСобственности.СписокВыбора.ЗагрузитьЗначения(ВидыСобственностиСобственногоКТК.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязатьСАРМКТК_ИнтеллектуальноеПрисвоение(ИмяКолонки, КТК, ЗначениеЗаявки, ЗначениеАРМ)
	
	Если ИмяКолонки = "ВидСобственности" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеЗаявки) И ЗначениеЗаполнено(ЗначениеАРМ) И ЗначениеЗаявки <> ЗначениеАРМ Тогда
			Сообщить("№ " + КТК + " несоответствует виду собственности в АРМ: " + ЗначениеАРМ, СтатусСообщения.ОченьВажное);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивКолонокЗаполняемыхВЗаявке.НайтиПоЗначению(ИмяКолонки) <> неопределено Тогда
		// Вариант - пользователь должен указывать это в заявке.
		
		Если НЕ ЗначениеЗаполнено(ЗначениеЗаявки) Тогда
			ЗначениеЗаявки = ЗначениеАРМ;
		КонецЕсли;
		
	ИначеЕсли МассивКолонокЗаполняемыхВАРМ.НайтиПоЗначению(ИмяКолонки) <> неопределено Тогда
		// Вариант - сведения должны заполняться из АРМ.
		
		Если ЗначениеЗаполнено(ЗначениеАРМ) Тогда
			ЗначениеЗаявки = ЗначениеАРМ;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПритерминальнаяСтанцияПриИзменении(Элемент)
	
	Если Не Объект.ГруженыйРейс Тогда
		Если ЗначениеЗаполнено(Объект.ПритерминальнаяСтанция) Тогда
			Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
				СтрокаТЧ.СтанцияОтправления = Объект.ПритерминальнаяСтанция;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	ОбновитьКонтактнуюИнформациюГрузополучателя();
	
	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
			СтрокаТЧ.Грузополучатель = Объект.Грузополучатель;
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СтанцияОтправленияГруженогоПриИзменении(Элемент)
	
	Если Объект.ГруженыйРейс Тогда
		Если ЗначениеЗаполнено(Объект.СтанцияОтправленияГруженого) Тогда
			Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
				СтрокаТЧ.СтанцияОтправления = Объект.СтанцияОтправленияГруженого;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.СтанцияОтправленияГруженого) Тогда
			Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
				СтрокаТЧ.СтанцияНазначения = Объект.СтанцияОтправленияГруженого;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНазначенияГруженогоПриИзменении(Элемент)
	
	Если Объект.ГруженыйРейс Тогда
		Если ЗначениеЗаполнено(Объект.СтанцияНазначенияГруженого) Тогда
			Для Каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
				СтрокаТЧ.СтанцияНазначения = Объект.СтанцияНазначенияГруженого;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиКалькуляцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб Коханенко Н.А. 24.02.2025 (( #101467 
	ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
	ТекПСЦ = ТекДанные.ПСЦ;
	Если Не ЗначениеЗаполнено(ТекПСЦ) Тогда
		Элементы.СоставУслугиКалькуляция.СписокВыбора.Очистить();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо внести ПСЦ перед добавлением калькуляции.",,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", ТекДанные.НомерСтроки, "ПСЦ"), "Объект");	
		Возврат;
	Иначе
		Рез = ПолучитьКалькуляциюИУслугуПоУмолчанию(ТекПСЦ);
		Элементы.СоставУслугиКалькуляция.СписокВыбора.Очистить();
		Для каждого Стр из Рез Цикл
			Элементы.СоставУслугиКалькуляция.СписокВыбора.Добавить(Стр.Калькуляция);
		КонецЦикла;  
	КонецЕсли;
	//Евросиб Коханенко Н.А. 24.02.2025 )) #101467 
	
	Если РазрешитьВыборПроизвольнойКалькуляции Тогда
		СтандартнаяОбработка = Ложь;
		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРучнойКалькуляции", ЭтаФорма);
		ОткрытьФорму("Документ.Калькуляция.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 18.02.2025 (( #101467 
&НаСервере
//БезКонтекста
Функция ПолучитьСписокКалькуляцийПоПСЦ(ПСЦ)
	
	СписокКалькуляций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПСЦ, "Калькуляции").Выгрузить();
	Возврат СписокКалькуляций.ВыгрузитьКолонку("Калькуляция");
	
КонецФункции //Евросиб Коханенко Н.А. 18.02.2025 )) #101467

&НаСервереБезКонтекста
Функция РазрешитьВыборПроизвольнойКалькуляции_функция(ВидПеревозки)
	
	Возврат ВидПеревозки.РазрешитьВыборПроизвольнойКалькуляции;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораРучнойКалькуляции(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		
		Элементы.СоставУслуги.ТекущиеДанные.Калькуляция = П1;
		СоставУслугиКалькуляцияПриИзменении(неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПоПервойСтрокеПриИзменении(Элемент)
	
	ЗаполнятьВниз = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьВнизПриИзменении(Элемент)
	
	ЗаполнятьПоПервойСтроке = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПользованияКлиентом(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиКлиентскихДанных", ЭтаФорма);
	// Евросиб US 88665 TA 88668 Рыбьяков К.А. 31.10.2024 ((
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка);
	// Евросиб Рыбьяков К.А. 31.10.2024 ))
	ОткрытьФорму("Обработка.АРМУправлениеКТК.Форма.ВставкаДанныхКлиентскогоПользованияВЗаявку", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиКлиентскихДанных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		//Евросиб Каблов 04.08.2022 ( Task 55246
		//Для каждого Стр из П1 Цикл
		ТаблицаРезультат = П1.Результат;
		РаботаСПустымиЗначениями = П1.РаботаСПустымиЗначениями;
		Для каждого Стр из ТаблицаРезультат Цикл
		//Евросиб Каблов 04.08.2022 )		
			Для каждого СтрЗа из Объект.СоставУслуги Цикл
				Если Стр.КТК = СтрЗа.НомерКТК Тогда
					//Евросиб Каблов 04.08.2022 ( Task 55246
					//СтрЗа.ДатаВыдачи = Стр.ДатаВыдачиКлиенту;
					//СтрЗа.НормативноеИспользование = Стр.СрокПользованияКлиентом;
					//СтрЗа.ДатаВозвратаКлиентом = Стр.ДатаВозвратаКлиентом;
					Если РаботаСПустымиЗначениями = 1 Или ЗначениеЗаполнено(Стр.ДатаВыдачиКлиенту) Тогда
						СтрЗа.ДатаВыдачи = Стр.ДатаВыдачиКлиенту;
					КонецЕсли;
					
					Если РаботаСПустымиЗначениями = 1 Или ЗначениеЗаполнено(Стр.СрокПользованияКлиентом) Тогда
						СтрЗа.НормативноеИспользование = Стр.СрокПользованияКлиентом;
					КонецЕсли;
					
					Если РаботаСПустымиЗначениями = 1 Или ЗначениеЗаполнено(Стр.ДатаВозвратаКлиентом) Тогда
						СтрЗа.ДатаВозвратаКлиентом = Стр.ДатаВозвратаКлиентом;
					КонецЕсли;
					//Евросиб Каблов 04.08.2022 )	
					// Евросиб US 88665 TA 88668 Рыбьяков К.А. 20.11.2024 ((
					Если РаботаСПустымиЗначениями = 1 Или ЗначениеЗаполнено(Стр.ЛокацияСдачиПорожКТКНаТерминал) Тогда
						СтрЗа.СтокВыдачи = Стр.ЛокацияСдачиПорожКТКНаТерминал;
					КонецЕсли;
					// Евросиб Рыбьяков К.А. 20.11.2024 ))
					// ДИТ US 76935 ТА 76938 Сержантова А.С. Начало: 08.11.2023 
					СтруктураТЧМили = Новый Структура;
					СтруктураТЧМили.Вставить("ДатаВыдачиКТКСТерминала",СтрЗа.ДатаВыдачи);
					Структура = ПолучитьСтруктуруДляЗаписиКлюча();
					ЗаполнитьЗначенияСвойств(Структура,СтрЗа);
					ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,СтрЗа.ДатаВыдачи,"ДатаВыдачиКТКСТерминала",
								ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);  
								
					СтруктураТЧМили = Новый Структура;
					СтруктураТЧМили.Вставить("ДатаСдачиКТКНаТерминал",СтрЗа.ДатаВозвратаКлиентом);
					ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,СтрЗа.ДатаВозвратаКлиентом,"ДатаСдачиКТКНаТерминал",
								ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
					// ДИТ US 76935 ТА 76938 Сержантова А.С. Конец: 08.11.2023
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьРейсовРейсПриИзменении(Элемент)
	
	//Евросиб Каблов 01.07.2021 ( Ticket#0228545
	ТекДанные = Элементы.ПереченьРейсов.ТекущиеДанные; 
	//++#ДИТ Коробов. А.П. Ticket#0259275 от 07.02.2021
	Если ЭтоАвтоИлиМорскойРейс(ТекДанные.Рейс) Тогда Возврат; КонецЕсли;
	//++#ДИТ Коробов. А.П. Ticket#0259275 от 07.02.2021	
	ТекДанные.НомерПоездаКлиента = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.Рейс, "НомерПоездаКлиента");
	//Евросиб Каблов 01.07.2021 )
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 29.12.2022
	СтанцияДата();
	Для Каждого Стр Из Объект.СписокЗапросНаКТК	Цикл 
		УстановитьСтанциюДату(Стр);
	КонецЦикла;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022
	
	//ДИТ Шевченко А.В. 57147 28.12.2022 -начало
	//Евросиб Каблов 27.01.2026 ( #126739
	//Если ЗначениеЗаполнено(ТекДанные.Рейс) И ТипЗнч(ТекДанные.Рейс) = Тип("СправочникСсылка.РейсыЖД") И Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда 
	//	РейсОтменен = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.Рейс,"РейсОтменен");
	//	Если НЕ РейсОтменен Тогда
	Если ЗначениеЗаполнено(ТекДанные.Рейс) И ТипЗнч(ТекДанные.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
		РеквизитыРейса = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекДанные.Рейс, "НомерПоездаКлиента,РейсОтменен,ПричинаОтмены_DX");
		РейсОтменен = РеквизитыРейса.РейсОтменен;
		ТекДанные.РейсОтменен = РеквизитыРейса.РейсОтменен;
		ТекДанные.ПричинаОтмены = РеквизитыРейса.ПричинаОтмены_DX;
		Если РейсОтменен Тогда
			ТекДанные.ТекстРейсОтменен = "Рейс отменен!";
			ВывестиСообщениеПоОтмененномуРейсу(ТекДанные);
		Иначе
			ТекДанные.ТекстРейсОтменен = "";
			Если Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда
	//Евросиб Каблов 27.01.2026 ) #126739
		
			МассивСтатусы = Новый Массив;
			МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.Подтверждено"));
			МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ПодтвержденоСУсловием"));
			МассивСтатусы.Добавить(ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.ИзмененоПослеСогл"));
			
			// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 30.03.2023
			// Было:
			//Если МассивСтатусы.Найти(Объект.СтатусЗаявкиСибур) <> Неопределено Тогда
			//	ВыполнитьПроверкиСибур();
			//КонецЕсли;
			//Стало:
			Для Каждого Стр Из Объект.НомераЛотов Цикл  
				Если МассивСтатусы.Найти(Стр.СтатусЛота) <> Неопределено Тогда 
				ВыполнитьПроверкиСибур();
					Прервать;	
			КонецЕсли;
			КонецЦикла;	
			// ДИТ US 60810 TA 66664 Евсенкин М.А. Конец: 30.03.2023
			
		КонецЕсли;
	//Евросиб Каблов 27.01.2026 ( #126739
		КонецЕсли;
	Иначе
		ТекДанные.РейсОтменен = Ложь;
		ТекДанные.ТекстРейсОтменен = "";
		ТекДанные.ПричинаОтмены = Неопределено;
	//Евросиб Каблов 27.01.2026 ) #126739
	КонецЕсли;	
	//ДИТ Шевченко А.В. 57147 28.12.2022 -конец
	
	//Евросиб Каблов 27.01.2026 ( #126739
	ОтмененныеРейсы = Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("РейсОтменен", Истина));
	Элементы.ПереченьРейсовГруппаРейсОтменен.Видимость = ЗначениеЗаполнено(ОтмененныеРейсы);
	//Евросиб Каблов 27.01.2026 ) #126739
	
КонецПроцедуры

//Евросиб Каблов 01.07.2021 Ticket#0228545
&НаСервере
Процедура ЗаполнитьНомераПоездовклиентов()
	
	//Евросиб Каблов 27.01.2026 ( #126739
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	РейсыЖД.Ссылка КАК Ссылка,
	//|	РейсыЖД.НомерПоездаКлиента КАК НомерПоездаКлиента,
	//|ИЗ
	//|	Справочник.РейсыЖД КАК РейсыЖД
	//|ГДЕ
	//|	РейсыЖД.Ссылка В(&Рейсы)
	//Запрос.УстановитьПараметр("Рейсы", Объект.ПереченьРейсов.Выгрузить(, "Рейс").ВыгрузитьКолонку("Рейс"));
	//Выборка = Запрос.Выполнить().Выбрать();
	//НомераПоездовПоРейсам = Новый Соответствие;
	//Пока Выборка.Следующий() Цикл	
	//	НомераПоездовПоРейсам.Вставить(Выборка.Ссылка, Выборка.НомерПоездаКлиента);
	//	СтрокиРейса = Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("Рейс", Выборка.Ссылка));
	//	Для каждого СтрокаРейса Из СтрокиРейса Цикл
	//	    СтрокаРейса.НомерПоездаКлиента = Выборка.НомерПоездаКлиента;		
	//	КонецЦикла; 
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсыЖД.Ссылка КАК Ссылка,
	|	РейсыЖД.НомерПоездаКлиента КАК НомерПоездаКлиента,
	|	РейсыЖД.РейсОтменен КАК РейсОтменен,
	|	РейсыЖД.ПричинаОтмены_DX КАК ПричинаОтмены
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|ГДЕ
	|	РейсыЖД.Ссылка В(&Рейсы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РейсыАвто.Ссылка,
	|	"""",
	|	РейсыАвто.РейсОтменен,
	|	""""
	|ИЗ
	|	Справочник.РейсыАвто КАК РейсыАвто
	|ГДЕ
	|	РейсыАвто.Ссылка В(&Рейсы)";
	
	Запрос.УстановитьПараметр("Рейсы", Объект.ПереченьРейсов.Выгрузить(, "Рейс").ВыгрузитьКолонку("Рейс"));
	
	ТаблицаРейсов = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из Объект.ПереченьРейсов Цикл
		НайденныеСтроки = ТаблицаРейсов.НайтиСтроки(Новый Структура("Ссылка", СтрокаТЧ.Рейс));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			ДанныеРейса = НайденныеСтроки[0];
			СтрокаТЧ.НомерПоездаКлиента = ДанныеРейса.НомерПоездаКлиента;
			СтрокаТЧ.РейсОтменен = ДанныеРейса.РейсОтменен;
			Если СтрокаТЧ.РейсОтменен Тогда
				СтрокаТЧ.ТекстРейсОтменен = "Рейс отменен!";
			КонецЕсли;
			СтрокаТЧ.ПричинаОтмены = ДанныеРейса.ПричинаОтмены;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 27.01.2026 ) #126739
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.Заявка.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции

&НаКлиенте
Процедура СоставУслугиПередНачаломИзменения(Элемент, Отказ)
	
	//Евросиб Каблов 24.01.2022 ( Task 45889
	ТолькоПросмотрКТК = Ложь;
	
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;	
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.НомерКТК) И ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		КонтейнерВключенВСделку = КонтейнерЗаявкиВключенВСделку(Объект.Ссылка, ТекД.НомерКТК, ТекД.ГУИДСтроки);
		Если  КонтейнерВключенВСделку Тогда
			ТолькоПросмотрКТК = Истина;						
		КонецЕсли;		
	КонецЕсли;
	
	Элементы.СоставУслугиНомерКТК.ТолькоПросмотр = ТолькоПросмотрКТК;
	//Евросиб Каблов 24.01.2022 )
	
КонецПроцедуры

//Евросиб Каблов 24.01.2022 Task 45889
&НаСервереБезКонтекста
Функция КонтейнерЗаявкиВключенВСделку(Заявка, Контейнер, ИдентификаторСтрокиЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Представление КАК СделкаПредставление
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО ЗаявкаСоставУслуги.Ссылка = СделкаСвязьУчетныхЕдиниц.Заявка
	|			И ЗаявкаСоставУслуги.НомерКТК = СделкаСвязьУчетныхЕдиниц.Контейнер
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Заявка
	|	И ЗаявкаСоставУслуги.НомерКТК = &Контейнер
	|	И ЗаявкаСоставУслуги.ГУИДСтроки = &ИдентификаторСтрокиЗаявки
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ИдентификаторСтрокиЗаявки", ИдентификаторСтрокиЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Начало
&НаКлиенте
Функция ПроверитьНаличиеВариантовАвтоперевозкиЕвросибом(ИмяПоляЗапросКТК,ИмяПоляУслуги)
	
	// BUG 81219 ТА 81220 Сержантова А.С. 15.02.2024 - вернуть
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить(ИмяПоляЗапросКТК,ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб"));	
	СтрокиЗапросов = Объект.СписокЗапросНаКТК.НайтиСтроки(ОтборСтрок);   
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить(ИмяПоляУслуги,ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб"));	
	СтрокиУслуг = Объект.СоставУслуги.НайтиСтроки(ОтборСтрок);
	
	Возврат СтрокиЗапросов.Количество() = 0 И СтрокиУслуг.Количество() = 0;
	
КонецФункции
//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец

//Евросиб - Дубская 14.06.2022 #52244  
&НаКлиенте
Процедура ОтправитьДатуПрибытия(Команда) 
	
	Если Объект.Ссылка.Пустая()
		ИЛИ Модифицированность Тогда       
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаписиЗаявкиОзон", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Перед отправкой данных заявка должна быть сохранена.
									|Сохранить заявку?", Режим, 0);
	Иначе
		ОтправитьДатуПрибытияОзон();
	КонецЕсли;
	
	
КонецПроцедуры //Евросиб - Дубская 14.06.2022 #52244     

//Евросиб - Дубская 14.06.2022 #52244  
&НаКлиенте
Процедура ОтправитьДатуПрибытияОзон() 
	
	Если ЗначениеЗаполнено(Объект.ПлановаяДатаПрибытия) Тогда
		Сообщить(ЕСОбменСервер.ОтправитьДатуПрибытияОзон(Объект.ВнешнийНомер, Объект.ПлановаяДатаПрибытия));   
	Иначе
		Сообщить("Укажите плановую дату прибытия");
	КонецЕсли;                   
	
КонецПроцедуры //Евросиб - Дубская 14.06.2022 #52244     

//Евросиб - Дубская 14.06.2022 #52244  
&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаписиЗаявкиОзон(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	Попытка
		ЭтаФорма.Записать();
	Исключение
		ПоказатьПредупреждение(, "Не удалось записать документ");
		Возврат;
	КонецПопытки;
	Если НЕ Модифицированность Тогда
		ОтправитьДатуПрибытияОзон();
	КонецЕсли;
	
КонецПроцедуры //Евросиб - Дубская 14.06.2022 #52244     

//Евросиб Бозняков( 06.04.2022 TASK 51077
&НаКлиенте
Процедура ДобавитьИзEXCELКТККлиента(Команда)
	
	ОпОп = новый ОписаниеОповещения("ОбработкаДобавленияКлиентскиеКТК", ЭтаФорма);
	//Евросиб Каблов 16.08.2022 ( US41519
	//ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК, РазмерКТК, КлиентскийКТК", Истина, Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормы = Новый Структура("КТК, РазмерКТК, КлиентскийКТК", Истина, Истина, Истина);
	ПараметрыФормы.Вставить("СоздаватьКТКПриПереносеВДокумент", Истина);
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", ПараметрыФормы, , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб Каблов 16.08.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияКлиентскиеКТК(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено Тогда
		
		//Евросиб Коханенко Н.А. 14.09.2023 (( #74199
        Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
			ИменаПолейИзКалькуляции = Новый Массив;
			ИменаПолейИзКалькуляции = СтрРазделить("УсловияПеревозки,УсловияПеревозкиНазначение,ПунктОтправления,СтанцияОтправления,ПунктНазначения,СтанцияНазначения", ",");
			ДанныеИзКалькуляции = ПолучитьДанныеКалькуляции(КалькуляцияПоУмолчанию);
			ЗаполненныеПоля = Новый Массив;
			Для Каждого ИмяПоля из ИменаПолейИзКалькуляции Цикл
				ЗначениеПоля = Неопределено;
				Если ДанныеИзКалькуляции.Свойство(ИмяПоля, ЗначениеПоля) И ЗначениеЗаполнено(ЗначениеПоля) Тогда 
					ЗаполненныеПоля.Добавить(ИмяПоля); 
				КонецЕсли; 
			КонецЦикла;
			ИменаЗаполненныхПолей = СтрСоединить(ЗаполненныеПоля, ",");
		КонецЕсли;
		//Евросиб Коханенко Н.А. 14.09.2023 )) #74199 

		Для Сч = 0 по Параметр1.КТК.Количество()-1 Цикл
			
			НСтр = Объект.СоставУслуги.Добавить();
			
			КТК = неопределено;
			Тип = неопределено;
			Размер = неопределено;
			
			Рез = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(ПолучитьРазмер(Параметр1.РазмерКТК[Сч]));
			Тип = Рез.Тип;
			Размер = Рез.Размер;
			
			НСтр.НомерКТК = СоздатьКТК(Параметр1.КТК[Сч], Тип);
			РезПоТипам = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(НСтр.НомерКТК);
			НСтр.РазмерКТК = РезПоТипам.Размер;
			НСтр.ТипКТК = РезПоТипам.Тип;
			
			НСтр.ПринадлежностьТЕ = ПолучитьПринадлежностьТЕКТКлиента();
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//НСтр.ВидСобственности = ПолучитьВидСобственностиПрочее();
			//НСтр.ВладелецКТК = Объект.Контрагент;
			//Стало:
			ЗаполнитьСвязанныеПоляПринадлежностьТЕ(НСтр.ПолучитьИдентификатор());
			// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
			
			НСтр.Услуга = УслугаПоУмолчанию;
			НСтр.Калькуляция = КалькуляцияПоУмолчанию;
			НСтр.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
			
			//Евросиб Каблов 16.08.2022 ( US41519
			НСтр.КлиентскийКТК = Истина;
			//Евросиб Каблов 16.08.2022 )
			
			//Евросиб Коханенко Н.А. 14.09.2023 (( #74199
			Если КалькуляцияПоУмолчанию <> Неопределено Тогда 
				Если ЗначениеЗаполнено(Объект.ПСЦ) Тогда 
					НСтр.ПСЦ = Объект.ПСЦ;
				КонецЕсли; 
				ЗаполнитьЗначенияСвойств(НСтр, ДанныеИзКалькуляции, ИменаЗаполненныхПолей);
			КонецЕсли;
			//Евросиб Коханенко Н.А. 14.09.2023 )) #74199 
				
		КонецЦикла;
		
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПринадлежностьТЕКТКлиента()
	Возврат Перечисления.ПринадлежностьТЕ.КТКлиента 	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидСобственностиПрочее()
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//Возврат Перечисления.ВариантыСобственности.Прочее 	
	//Стало:
	Возврат Перечисления.ВариантыСобственности.Клиентский;
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРазмер(КТК)
	Возврат КТК.РазмерКТК.Наименование; 	
КонецФункции


&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПриИзменении(Элемент)
	//ДИТ Шевченко А.В. 58552 05.10.2022 -начало
	ТекД = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные;
	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	Если ТекД = Неопределено ИЛИ ТекД.КлючАналитикиПеревозки = ПредопределенноеЗначение("Справочник.КлючиАналитикиПеревозки.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;
	СтруктураДляКлюча = Новый Структура("ФИОВодителя,РегНомерТС,ПаспортныеДанные,Автоперевозчик,ИНН,КПП,КлючАналитикиПеревозки,Контейнер");
	ЗаполнитьЗначенияСвойств(СтруктураДляКлюча,ТекД);  
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 18.01.2024
	Если ЗначениеЗаполнено(ТекД.Автоперевозчик) и ТипЗнч(ТекД.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда   
		ЗначенияРекв = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекД.Автоперевозчик, "ИНН, КПП");
		ТекД.ИНН = ЗначенияРекв.ИНН; 
		ТекД.КПП = ЗначенияРекв.КПП; 
	Иначе
		Элементы.ТранспортныеСредстваПоследняяМиляИНН.Доступность = Истина;
		Элементы.ТранспортныеСредстваПоследняяМиляКПП.Доступность = Истина;
	КонецЕсли;
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 18.01.2024
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
	//ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураДляКлюча,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),ТекД.ВерсияДанных);
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	
	Если ЗаполнятьВниз Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = ТекД[ИмяПоля];  
		
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
		Если ИмяПоля = "Автоперевозчик" Тогда     
			Если ТипЗнч(НовоеЗначение) = Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(НовоеЗначение) Тогда
				РеквизитыАвтоперевозчика = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(НовоеЗначение, "ИНН, КПП", Ложь);
			Иначе
				РеквизитыАвтоперевозчика = Новый Структура("ИНН, КПП", "", "");
			КонецЕсли;
		КонецЕсли;
		// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
		
		СтрокаПройдена = Ложь;		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.ТранспортныеСредстваПоследняяМиля.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			
			СтрокаПройдена = СтрокаПройдена ИЛИ Элементы.ТранспортныеСредстваПоследняяМиля.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			
			Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда
				
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				
				// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
				Если ИмяПоля = "Автоперевозчик" Тогда
					Объект[ИмяТЧ][Сч]["ИНН"] = РеквизитыАвтоперевозчика.ИНН;
					Объект[ИмяТЧ][Сч]["КПП"] = РеквизитыАвтоперевозчика.КПП;
				КонецЕсли;
				// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	//ДИТ Шевченко А.В. 58552 05.10.2022 -конец   
	
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 24.01.2024
	ЗаполнитьТранспортныеСредстваВУслугах(ТекД, ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"));
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 24.01.2024
КонецПроцедуры
// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022

&НаСервереБезКонтекста
Функция ПроверитьПериодДействияДоговора(Договор,ДатаНачала,ДатаОкончания,ПроверитьВхождениеОднойДаты = Ложь) //ДИТ Шевченко А.В. 59987 12.12.2022		
	ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,ДатаНачала,ДатаОкончания,ПроверитьВхождениеОднойДаты);
	Возврат ДоговорДействует;
КонецФункции

//Евросиб Бозняков )

// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 29.12.2022
&НаКлиенте
Процедура ПереченьРейсовПриИзменении(Элемент)
	СтанцияДата();
	Для Каждого Стр Из Объект.СписокЗапросНаКТК	Цикл 
		УстановитьСтанциюДату(Стр);
	КонецЦикла; 
	
	//БИТ Белинский Д.А. 11.04.2023 -начало
		УстановитьДоступностьПолейПоследнейМили();
	//БИТ Белинский Д.А. 11.04.2023 -конец     
	
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 24.07.2024
	ТекСтрока = Элементы.ПереченьРейсов.ТекущиеДанные;
	Если ТекСтрока <>  Неопределено Тогда
		ТекСтрока.Пользователь = ПользователиКлиент.ТекущийПользователь();
	КонецЕсли;
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 24.07.2024
	
	//Евросиб Каблов 27.01.2026 ( #126739
	ОтмененныеРейсы = Объект.ПереченьРейсов.НайтиСтроки(Новый Структура("РейсОтменен", Истина));
	Элементы.ПереченьРейсовГруппаРейсОтменен.Видимость = ЗначениеЗаполнено(ОтмененныеРейсы);
	//Евросиб Каблов 27.01.2026 ) #126739
	
КонецПроцедуры
// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 29.12.2022


// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023 
&НаКлиенте
Процедура НайтиКлючАналитикиПеревозкиКлиент(ТекСтр) 
		
	Структура = ПолучитьСтруктуруДляЗаписиКлюча(); //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
	Структура.ВесГруза = ТекСтр.ВесГрузаНетто;
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	ЗаполнитьЗначенияСвойств(Структура,ТекСтр);
		
	Если ТекСтр.ВерсияКлюча = "" Или ТекСтр.ВерсияКлюча = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекСтр.КлючАналитикиПеревозки,"ВерсияДанных") Тогда 
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 25.12.2023
		// Было:
		//КлючАналитикиПеревозки = НайтиКлючАналитикиПеревозки(Структура); 
		// Стало:
		ОбновитьВидимостьДетализацияПоГрузу();
		Возврат;
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 25.12.2023
	Иначе 
		КлючАналитикиПеревозки = ОбновитьДанныеКлючаАналитикиПеревозки(Структура);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
	КонецЕсли;	                   
	
	ТекСтр.КлючАналитикиПеревозки = КлючАналитикиПеревозки.КлючАналитикиПеревозки;  
	ТекСтр.ВерсияКлюча = КлючАналитикиПеревозки.ВерсияДанных;
	
	ОбновитьВидимостьДетализацияПоГрузу();   
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 22.11.2023  // ДИТ US 76935 ТА 78649 Сержантова А.С. 25.12.2023 - закомментировала
	//ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 22.11.2023
	
КонецПроцедуры
//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец

// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
&НаСервере
Функция ОбновитьДанныеКлючаАналитикиПеревозки(ТекСтр)
	Структура = Новый Структура("КлючАналитикиПеревозки,ВерсияКлюча");	
	НайденоУслуги = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));
	
	Если НайденоУслуги.Количество() Тогда  
		Стр = НайденоУслуги[0]; 
		Стр.Груз = ТекСтр.КлючАналитикиПеревозки.Груз;
		Стр.ВерсияКлюча = ТекСтр.КлючАналитикиПеревозки.ВерсияДанных;
		Стр.ИнструкцииПоСдачеПорожнего = ТекСтр.КлючАналитикиПеревозки.ИнструкцияПоСдаче;
		Структура = Новый Структура("КлючАналитикиПеревозки,ВерсияДанных",Стр.КлючАналитикиПеревозки,Стр.ВерсияКлюча);
		
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 - начало
		Для Каждого ВыборкаМили Из Стр.КлючАналитикиПеревозки.Мили Цикл
			
			ЗаполнитьСтрокуУслугиПоЭтапуПеревозки(Стр,ВыборкаМили);
			
		КонецЦикла;	
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 - конец
		
	КонецЕсли;
	мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу",Тип("ТаблицаЗначений"));
	НайденоГруз = мДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));
	Для Каждого СтрНайденоГруз Из НайденоГруз Цикл 
		мДетализацияПоГрузу.Удалить(СтрНайденоГруз);	
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Справочники.КлючиАналитикиПеревозки.ПолучитьДетализациюПоГрузу(ТекСтр.КлючАналитикиПеревозки),мДетализацияПоГрузу);
	ЗначениеВРеквизитФормы(мДетализацияПоГрузу,"ДетализацияПоГрузу");
	
	Возврат Структура;
КонецФункции


// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
&НаСервере
Функция НайтиКлючАналитикиПеревозки(ТекСтр)
	
	СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	СтруктураКлючаАналитикиПеревозки.КлючАналитики = ТекСтр.КлючАналитикиПеревозки; 
	СтруктураКлючаАналитикиПеревозки.Контейнер = ТекСтр.НомерКТК;
	СтруктураКлючаАналитикиПеревозки.Заявка = Объект.Ссылка;
	СтруктураКлючаАналитикиПеревозки.Груз = ТекСтр.Груз;
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
	СтруктураКлючаАналитикиПеревозки.КоличествоМест = ТекСтр.КоличествоМест; 
	СтруктураКлючаАналитикиПеревозки.ВесГруза = ТекСтр.ВесГруза;
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	СтруктураКлючаАналитикиПеревозки.ИнструкцияПоСдаче = ТекСтр.ИнструкцииПоСдачеПорожнего;
	
	мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу",Тип("ТаблицаЗначений"));
   	ТЗДетализацияПоГрузу = мДетализацияПоГрузу.СкопироватьКолонки();
	МассивСтрок = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));
	Для Каждого СтрМассивСтрок Из МассивСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТЗДетализацияПоГрузу.Добавить(),СтрМассивСтрок);
	КонецЦикла;
	
	СтруктураКлючаАналитикиПеревозки.ИзменятьТЧДетализацияПоГрузу = Истина;
	СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу = ТЗДетализацияПоГрузу;
	
	КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	
	Возврат КлючАналитикиПеревозки;
	
КонецФункции
// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023

// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
Процедура ОбновитьДанныеКлючаНаФорме() 
	МассивКлючей = Новый Массив;
	Для Каждого Стр Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда 
			мМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Стр.КлючАналитикиПеревозки);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКлючей, мМассив, Истина); 
		КонецЕсли;
	КонецЦикла;	
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 13.12.2023
	// Было:
	//Соответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивКлючей,"Контейнер,Груз,ИнструкцияПоСдаче,Мили"); //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 
	//Стало:
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. 28.06.2024 + ДетализацияПоГрузу
	Соответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивКлючей,"Контейнер,Груз,КоличествоМест,ВесГруза,ИнструкцияПоСдаче,Мили, ВерсияДанных, ДетализацияПоГрузу"); // + ВерсияДанных ДИТ US 76935 ТА 78649 Сержантова А.С. 27.12.2023
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 13.12.2023
	Для Каждого Стр Из Объект.СоставУслуги Цикл 
		Структура = Соответствие.Получить(Стр.КлючАналитикиПеревозки);
		Если Структура <> Неопределено Тогда
			//ДИТ Шевченко А.В. US 62421 TA 70104 15.05.2023 +
			Стр.НомерКТК  = Структура.Контейнер; 
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
			// Было:
			//Стр.ТипКТК 	  = Стр.НомерКТК.ТипТЕ;
			//Стр.РазмерКТК = Стр.ТипКТК.РазмерКТК;  
			//Стало: 
			Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
				Стр.ТипКТК 	  = Стр.НомерКТК.ТипТЕ;
				Стр.РазмерКТК = Стр.ТипКТК.РазмерКТК;
			КонецЕсли;
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024
			//ДИТ Шевченко А.В. US 62421 TA 70104 15.05.2023 ++
			Стр.Груз = Структура.Груз;    
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 28.06.2024
			Стр.КодГруза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Структура.Груз,"ЕТСНГ"); 
			СтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", Стр.КлючАналитикиПеревозки));
			Для каждого СтрДетализацииГруза Из СтрокиДетализации Цикл
				ДетализацияПоГрузу.Удалить(СтрДетализацииГруза);	
			КонецЦикла;
			ВыборкаДетализацияНовая = Структура.ДетализацияПоГрузу.Выбрать();
			Пока ВыборкаДетализацияНовая.Следующий() Цикл
				НС = ДетализацияПоГрузу.Добавить();	 
				ЗаполнитьЗначенияСвойств(НС, ВыборкаДетализацияНовая);  
				НС.КлючАналитикиПеревозки = Стр.КлючАналитикиПеревозки;
			КонецЦикла;
			// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 28.06.2024
			Стр.ИнструкцииПоСдачеПорожнего = Структура.ИнструкцияПоСдаче; 
			// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 13.12.2023 - оставим для сохранения данных из заявки, если в ключе пусто
			//Если (ЗначениеЗаполнено(Стр.ВесГрузаНетто) и не ЗначениеЗаполнено(Структура.ВесГруза)) 
			//	или (ЗначениеЗаполнено(Стр.КоличествоМест) и не ЗначениеЗаполнено(Структура.КоличествоМест)) Тогда  
			//	СтруктураКлюча = ПолучитьСтруктуруДляЗаписиКлюча();    
			//	СтруктураКлюча.ВесГруза = Стр.ВесГрузаНетто;
			//	ЗаполнитьЗначенияСвойств(СтруктураКлюча,Стр);
			//    НайтиКлючАналитикиПеревозки(СтруктураКлюча);
			//Иначе	
				Стр.ВесГрузаНетто = Структура.ВесГруза;
				Стр.КоличествоМест = Структура.КоличествоМест;
			//КонецЕсли;
			// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 13.12.2023 
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
			Стр.ВерсияКлюча = Структура.ВерсияДанных;
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
			//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 - начало
			ВыборкаМили = Структура.Мили.Выбрать();
			Пока ВыборкаМили.Следующий() Цикл
				ЗаполнитьСтрокуУслугиПоЭтапуПеревозки(Стр,ВыборкаМили);
			КонецЦикла;	
			//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 - конец  
			// ДИТ US 76659 ТА 76890 Сержантова А.С. Начало: 31.10.2023
			ЗаполнитьСвязанныеПоляПринадлежностьТЕ(Стр);
			// ДИТ US 76659 ТА 76890 Сержантова А.С. Конец: 31.10.2023
		КонецЕсли;
	КонецЦикла;	
	
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	ЗаполнитьТаблицуВодителиПеревозчикиПоКлючамАналитики(,Перечисления.ЭтапыПеревозки.ПерваяМиля);
	ЗаполнитьТаблицуВодителиПеревозчикиПоКлючамАналитики(,Перечисления.ЭтапыПеревозки.ПоследняяМиля);
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	
КонецПроцедуры 
// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023

// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 07.02.2023
&НаСервере
Процедура ДетализацияПоГрузуИзКлючей()
	МассивКлючей = Новый Массив;
	Для Каждого Стр Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда 
			мМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Стр.КлючАналитикиПеревозки);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКлючей, мМассив, Истина); 
		КонецЕсли;
	КонецЦикла;	
	ТЗ = Справочники.КлючиАналитикиПеревозки.ПолучитьДетализациюПоГрузу(МассивКлючей); 
	ДетализацияПоГрузу.Загрузить(ТЗ); 
КонецПроцедуры	
// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 07.02.2023

// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 20.02.2023
&НаКлиенте
Процедура СоставУслугиИнструкцииПоСдачеПорожнегоПриИзменении(Элемент)
	ТекД = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если ТекД <> неопределено Тогда 
		НайтиКлючАналитикиПеревозкиКлиент(ТекД);
	КонецЕсли;
КонецПроцедуры
// -- Евросиб Дудоров С.В. US 61271 30.01.2023 в рамках
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 

// ДИТ US 60810 TA 66664 Евсенкин М.А. Начало: 21.03.2023
&НаСервере
Процедура ПроверкаКодКонтрагентаСибур(НеЗаполненКодКонтрагентаСибур)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВладелецКТК КАК ВладелецКТК,
		|	ТЗ.Грузополучатель КАК Грузополучатель
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ВладелецКТК КАК ВладелецКТК
		|ПОМЕСТИТЬ ВКТК
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	НЕ ВТ.ВладелецКТК = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ВладелецКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Грузополучатель КАК Грузополучатель
		|ПОМЕСТИТЬ ГП
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	НЕ ВТ.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Грузополучатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКТК.ВладелецКТК КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВКТК КАК ВКТК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГП.Грузополучатель
		|ИЗ
		|	ГП КАК ГП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Итог.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ПротоколОбменов.УИДИсточника ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УИДИсточникаСуществует
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ВТ_Итог.Контрагент = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.Сибур))";
	
	ТЗ = Объект.СоставУслуги.Выгрузить(,"ВладелецКТК,Грузополучатель");
	Если Не Объект.ПунктПеревалки = Справочники.Контрагенты.ПустаяСсылка() Тогда 
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.ВладелецКТК = Объект.ПунктПеревалки;
	КонецЕсли; 
	
	Если Не Объект.Грузополучатель = Справочники.Контрагенты.ПустаяСсылка() Тогда 
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.ВладелецКТК = Объект.Грузополучатель;
	КонецЕсли;    
	
	//ТЗ.Свернуть("ВладелецКТК");

	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.УИДИсточникаСуществует Тогда  
			НеЗаполненКодКонтрагентаСибур.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//БИТ Белинский Д.А. 11.04.2023 -начало  TASK 66201
&НаСервере
Процедура УстановитьДоступностьПолейПоследнейМили()
	
	Если Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() Тогда
		Если ЗначениеЗаполнено(Объект.ПСЦ) И ЭтоМежсервисныеРасходы(Объект.ПСЦ.ТипКалькуляции) Тогда

			ЕстьРейсАвто = Ложь;
			ЕстьДругиеРейсы = Ложь;
			Для Каждого СтрокаРейсы Из Объект.ПереченьРейсов Цикл
				Если ТипЗнч(СтрокаРейсы.Рейс) = Тип("СправочникСсылка.РейсыАвто") Тогда
					ЕстьРейсАвто = Истина;
				Иначе
					ЕстьДругиеРейсы = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьРейсАвто и НЕ ЕстьДругиеРейсы Тогда 
				Элементы.СоставУслугиПоследняяМиля.Доступность = Ложь;
				Элементы.СписокЗапросНаКТКПоследняяМиля.Доступность = Ложь;
			Иначе
				Элементы.СоставУслугиПоследняяМиля.Доступность = Истина;
				Элементы.СписокЗапросНаКТКПоследняяМиля.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//БИТ Белинский Д.А. 11.04.2023 -конец TASK 66201

//БИТ Белинский Д.А. 12.04.2023 -начало\  TASK 66201

&НаСервере
Функция НеобходимоПроверитьДанныеПоПоследнейМиле(ПараметрыЗаписи, Отказ)
	
	ПроверитьДанныеПоПоследнейМиле = Ложь;
	
	Если Отказ Тогда
		Возврат ПроверитьДанныеПоПоследнейМиле
	КонецЕсли;	
		
	Если ПараметрыЗаписи.Свойство("ПроверкаПоПоследнейМилеВыполнена") И ПараметрыЗаписи.ПроверкаПоПоследнейМилеВыполнена = Истина Тогда
		Возврат ПроверитьДанныеПоПоследнейМиле
	КонецЕсли;	
		
	//Если НЕ ТекущийИсполнитель_Состояние = Справочники.Состояния.ВводЗаявкиВыборРейса Тогда 
	//	Возврат ПроверитьДанныеПоПоследнейМиле
	//КонецЕсли;   
	
	//Если Не РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	Возврат ПроверитьДанныеПоПоследнейМиле;
	//КонецЕсли;
	
	Если Объект.ПереченьРейсов.Количество() = 0 Тогда
		Возврат ПроверитьДанныеПоПоследнейМиле;
	КонецЕсли;

	Если Не Объект.Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() Тогда
		Возврат ПроверитьДанныеПоПоследнейМиле;
	КонецЕсли;
	
	
	Если РаботаСЗаявкамиВызовСервера.ЭтоЗаявкаНаАвтоРейс(Объект) Тогда   
		ПроверитьДанныеПоПоследнейМиле = Истина;
	КонецЕсли;
	
	Возврат ПроверитьДанныеПоПоследнейМиле; 
	
КонецФункции	
	
&НаСервере
Функция ПолучитьДанныеПоПоследнейМиле()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросНаАвтоперевозку,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку КАК СтатусЗапросаНаАвтоперевозку,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС КАК СтатусЗаказаНаТС,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ЗапросНаАвтоперевозку.Ссылка)
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Проведен = ИСТИНА
		|	И ЗапросНаАвтоперевозку.Заявка = &Заявка
		|	И ЗапросНаАвтоперевозку.ЭтапПеревозки = &ЭтапПеревозки";
	
 	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
  	Запрос.УстановитьПараметр("ЭтапПеревозки", Перечисления.ЭтапыПеревозки.ПоследняяМиля);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДанныеПоПоследнейМили = Новый Структура("ЗапросНаАвтоперевозку, ОтправленТЛ, ПринятТЛ, НомерСтроки");
	ДанныеПоПоследнейМили.ОтправленТЛ = Ложь;
	ДанныеПоПоследнейМили.ПринятТЛ = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеПоПоследнейМили.ЗапросНаАвтоперевозку = ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		
		Если ВыборкаДетальныеЗаписи.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен Тогда
			ДанныеПоПоследнейМили.ОтправленТЛ = Истина;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ВыданВРейс
			Или ВыборкаДетальныеЗаписи.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.Закрыт Тогда
			ДанныеПоПоследнейМили.ПринятТЛ = Истина;
			ДанныеПоПоследнейМили.НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		КонецЕсли;

	КонецЦикла; 
	
	Возврат ДанныеПоПоследнейМили
	
КонецФункции 

&НаСервере
Процедура ПометитьНаУдалениеЗапросНаАвтоПеревозку(ЗапросНаАвтоперевозку, ПередатьДанныеВТЛ = Ложь)
	
	ДокументОбъект = ЗапросНаАвтоперевозку.ПолучитьОбъект();
	
	СтрокиКвыгрузке = Новый ТаблицаЗначений;
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");
	
	Для каждого Строка Из ДокументОбъект.Контейнеры Цикл
		Стр = СтрокиКВыгрузке.Добавить();
		Строка.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
		ЗаполнитьЗначенияСвойств(Стр, Строка);
	КонецЦикла;
    ДокументОбъект.Записать();
	
	ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", ЗапросНаАвтоперевозку, СтрокиКВыгрузке);
	ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);	

	ДокументОбъект.УстановитьПометкуУдаления(Истина);

	ЗапросПоследняяМиля = Неопределено;	
	ТекстСообщения =  "Удален запрос на автоперевозку на последнюю милю %1"; 			
	ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросНаАвтоперевозку);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтрокиПоследнейМили()
	
	ТекстНомераСтрок = "";
	Для Каждого СтрокаУслуги Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.ПоследняяМиля) Тогда
			СтрокаУслуги.ПоследняяМиля = Неопределено; 
			ТекстНомераСтрок = ТекстНомераСтрок + СтрокаУслуги.НомерСтроки + ";";
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстНомераСтрок) Тогда	
		ТекстСообщения =  "Очищены значения полей Кем осуществляется автоперевозка (последняя миля) в строках %1 на закладке %2"; 			
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстНомераСтрок, "услуги");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ТекстНомераСтрок = "";
	Для Каждого СтрокаУслуги Из Объект.СписокЗапросНаКТК Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.ПоследняяМиля) Тогда
			СтрокаУслуги.ПоследняяМиля = Неопределено; 
			ТекстНомераСтрок = ТекстНомераСтрок + СтрокаУслуги.НомерСтроки + ";";
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(ТекстНомераСтрок) Тогда	
		ТекстСообщения =  "Очищены значения полей Кем осуществляется автоперевозка (последняя миля) в строках %1 на закладке %2"; 			
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстНомераСтрок, "Запрос на КТК");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры 
//БИТ Белинский Д.А. 11.04.2023 -конец

//БИТ Белинский Д.А. 14.04.2023 -начало
&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗапросеНаАвтоПеревозку(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
	
	ОчиститьСтрокиПоследнейМили();
	ПометитьНаУдалениеЗапросНаАвтоПеревозку(Параметры.ЗапросНаАвтоПеревозку, Истина);	

	Попытка
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи, ПроверкаПоПоследнейМилеВыполнена", Параметры.РежимЗаписи, Истина));
	Исключение
		ПоказатьПредупреждение(, "Не удалось записать документ");
		Возврат;
	КонецПопытки;
	ОбновитьИменаКомандЗапросовНаАстоперевозку();
КонецПроцедуры
// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023 

//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
&НаСервере
Процедура ДобавитьЗначениеРеквизитаВКлючПоВодителяАвтоперевозчикам(СтруктураКлючаП,ЭтапПеревозки = Неопределено,ВерсияДанных = Неопределено) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	ЗаполнитьЗначенияСвойств(СтруктураКлюча,СтруктураКлючаП);		
	СтруктураКлюча.КлючАналитики = СтруктураКлючаП.КлючАналитикиПеревозки;
	Если СтруктураКлюча.КлючАналитики <> Неопределено и СтруктураКлюча.КлючАналитики <> Справочники.КлючиАналитикиПеревозки.ПустаяСсылка() Тогда
		Если ВерсияДанных <> СтруктураКлюча.КлючАналитики.ВерсияДанных Тогда 
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 26.12.2023
			// Было:
			//ЗаполнитьТаблицуВодителиПеревозчикиПоКлючамАналитики(СтруктураКлюча.КлючАналитики,ЭтапПеревозки);
			//ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
			// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 26.12.2023
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Миля = "СтруктураТЧМилиПерваяМиляКлючаАналитики";
	Иначе
		Миля = "СтруктураТЧМилиПоследняяМиляКлючаАналитики";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураКлюча[Миля],СтруктураКлючаП);
	Если ЗначениеЗаполнено(СтруктураКлюча[Миля].Автоперевозчик) И ТипЗнч(СтруктураКлюча[Миля].Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИНН = СтруктураКлюча[Миля].Автоперевозчик.ИНН;
		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.КПП = СтруктураКлюча[Миля].Автоперевозчик.КПП;
	Иначе
		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИНН = СтруктураКлючаП.ИНН;
		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.КПП = СтруктураКлючаП.КПП;
	КонецЕсли;
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 25.12.2023
	// Было:
	//Ответ = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);	
	//ВерсияДанных = Ответ.ВерсияДанных;
	//СтруктураКлючаП.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки; 
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 25.12.2023
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьКлючАналитики(Заявка) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
	СтруктураКлюча.Вставить("Заявка",Заявка);
	Возврат Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
		
КонецФункции

Процедура ЗаполнитьТаблицуВодителиПеревозчикиПоКлючамАналитики(Ключ = Неопределено,ЭтапПеревозки = Неопределено)
	Если Ключ <> Неопределено Тогда
		ОтборС = Новый Структура("КлючАналитикиПеревозки",Ключ);
	Иначе
		ОтборС = Неопределено;
	КонецЕсли;
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		
		МассивКлючей = Объект.ТранспортныеСредства.Выгрузить(ОтборС,"КлючАналитикиПеревозки").ВыгрузитьКолонку("КлючАналитикиПеревозки");	
		ТзМили = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,Перечисления.ЭтапыПеревозки.ПерваяМиля);
		Если Ключ <> Неопределено Тогда
			МСтроки = Объект.ТранспортныеСредства.НайтиСтроки(ОтборС);
		Иначе
			МСтроки = Объект.ТранспортныеСредства;
		КонецЕсли;
		Для Каждого МСтрока Из МСтроки Цикл
			СтруктураОтбора = новый Структура("КлючАналитикиПеревозки",МСтрока.КлючАналитикиПеревозки);
			ТЗМилиСтрока = ТЗМили.НайтиСтроки(СтруктураОтбора);
			Если ТЗМилиСтрока.Количество() Тогда
				ЗаполнитьЗначенияСвойств(МСтрока,ТЗМилиСтрока[0]);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивКлючей = Объект.ТранспортныеСредстваПоследняяМиля.Выгрузить(ОтборС,"КлючАналитикиПеревозки").ВыгрузитьКолонку("КлючАналитикиПеревозки");
		ТзМили = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,Перечисления.ЭтапыПеревозки.ПоследняяМиля);
		Если Ключ <> Неопределено Тогда
			МСтроки = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(ОтборС);
		Иначе
			МСтроки = Объект.ТранспортныеСредстваПоследняяМиля;
		КонецЕсли;
		Для Каждого МСтрока Из МСтроки Цикл
			СтруктураОтбора = новый Структура("КлючАналитикиПеревозки",МСтрока.КлючАналитикиПеревозки);
			ТЗМилиСтрока = ТЗМили.НайтиСтроки(СтруктураОтбора);
			Если ТЗМилиСтрока.Количество() Тогда
				ЗаполнитьЗначенияСвойств(МСтрока,ТЗМилиСтрока[0]);
				// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 22.01.2024 
				МСтрока.Контейнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МСтрока.КлючАналитикиПеревозки, "Контейнер");
				// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 22.01.2024
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023

Процедура ЗаполнитьСтрокуУслугиПоЭтапуПеревозки(Стр,ВыборкаМили) //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023
	Если ВыборкаМили.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Стр.ДатаВыдачи 					= ВыборкаМили.ДатаВыдачиКТКСТерминала;
		Стр.ДатаПодачиАвтоПодПогрузку 	= ВыборкаМили.ДатаВыездаКТКСоСклада;
		Если ЗначениеЗаполнено(ВыборкаМили.ДатаВыездаКТКСоСклада) Тогда
			Стр.АдресПогрузки 				= ВыборкаМили.АдресКлиента;    
		КонецЕсли;
		Стр.ФИОВодителя 				= ВыборкаМили.ФИОВодителя;
		Стр.НомерАвто 					= ВыборкаМили.РегНомерТС;
		Стр.АвтоперевозчикПерваяМиля    = ВыборкаМили.Автоперевозчик;
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Начало: 17.12.2024   
		Если РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(Стр.НомерКТК, Объект.Ссылка) Тогда
		    Стр.ДатаВозвратаКлиентом 	= ВыборкаМили.ДатаСдачиКТКНаТерминал;
		КонецЕсли;
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Конец: 17.12.2024
	//Евросиб Коханенко Н.А. 23.01.2025 (( #91409 
	//Иначе
	ИначеЕсли ВыборкаМили.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля") Тогда
	//Евросиб Коханенко Н.А. 23.01.2025 )) #91409 
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Начало: 17.12.2024
		// Было:
		//Стр.ДатаВозвратаКлиентом 		= ВыборкаМили.ДатаСдачиКТКНаТерминал; 
		//Стало:
		Если РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(Стр.НомерКТК, Объект.Ссылка) Тогда
		Иначе	
			Стр.ДатаВозвратаКлиентом 	= ВыборкаМили.ДатаСдачиКТКНаТерминал;
		КонецЕсли;
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Конец: 17.12.2024
		Стр.ДатаПодачиАвтоПодВыгрузку 	= ВыборкаМили.ДатаВыездаКТКСоСклада;
		Если ЗначениеЗаполнено(ВыборкаМили.ДатаВыездаКТКСоСклада) Тогда
			Стр.АдресВыгрузки 				= ВыборкаМили.АдресКлиента;
		КонецЕсли;
		Стр.ФИОВодителяВыгрузка         = ВыборкаМили.ФИОВодителя;
		Стр.НомерАвтоВыгрузка 			= ВыборкаМили.РегНомерТС;
		Стр.АвтоПеревозчик              = ВыборкаМили.Автоперевозчик;
	КонецЕсли;
КонецПроцедуры	

// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 20.02.2023 

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
Процедура СинхронизироватьДанныеСРефСцепом()    
	
	ДанныеИзРефСцепа = РефСцепСервер.ПолучитьДанныеЗаполненияЗаявкиНаОснованииРефСцепаПоКлючам
		(Объект.ДокументОснование, Объект.СоставУслуги.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки"));
		
	ДанныеПоКонтейнерам = ДанныеИзРефСцепа.ДанныеПоКонтейнерам;
	Шапка               = ДанныеИзРефСцепа.Шапка;
	ДанныеКлиента	    = ДанныеИзРефСцепа.ДанныеКлиента;
	
	ЕстьИзменения = Ложь;

	Пока Шапка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Шапка.ПланируемоеОтправление) Тогда
			Продолжить;
		КонецЕсли;	
		Для каждого СтрУслуг из Объект.СоставУслуги Цикл
			ЗаполнитьЗначенияСвойств(СтрУслуг, Шапка);
		КонецЦикла;	
		Если Шапка.ПланируемоеОтправление <> Объект.Отправка Тогда
			Объект.Отправка = Шапка.ПланируемоеОтправление;
			ЕстьИзменения   = истина;
		КонецЕсли;	
		Если Шапка.ПланируемоеПрибытие <> Объект.Прибытие Тогда
			Объект.Прибытие = Шапка.ПланируемоеПрибытие;
			ЕстьИзменения   = истина;
		КонецЕсли;	
		Если Объект.ПереченьРейсов.Количество()>0 ТОгда
			Если Объект.ПереченьРейсов[0].Рейс <> Шапка.Рейс Тогда
				Объект.ПереченьРейсов[0].Рейс 	 =  Шапка.Рейс;
				Объект.ПереченьРейсов[0].Продукт =  Шапка.Продукт;
				ЕстьИзменения = истина;
				Если не ЗначениеЗаполнено(Объект.ПереченьРейсов[0].Рейс) Тогда
					Объект.ПереченьРейсов.Очистить();
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Шапка.Рейс) Тогда
				НоваяСтрока = Объект.ПереченьРейсов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Шапка,"Рейс, Продукт");
				ЕстьИзменения = истина;
			КонецЕсли;	
		КонецЕсли;

		тзСоставУслуги = Объект.СоставУслуги.Выгрузить();
		Пока ДанныеПоКонтейнерам.Следующий() Цикл
			Если ДанныеПоКонтейнерам.КлючАналитикиПеревозки 
				= Справочники.КлючиАналитикиПеревозки.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
			мСоставаУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ДанныеПоКонтейнерам.КлючАналитикиПеревозки));
			Для каждого СтрокаУслуги Из мСоставаУслуг Цикл
				ЗаполнитьЗначенияСвойств(СтрокаУслуги, ДанныеПоКонтейнерам);
				СтрокаУслуги.НомерКТК = ДанныеПоКонтейнерам.Контейнер;
				
				СтруктураКлючаАналитикиПеревозки 			   = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлючаАналитикиПеревозки.Заявка 	   = ОБъект.Ссылка;
				СтруктураКлючаАналитикиПеревозки.Контейнер 	   = СтрокаУслуги.НомерКТК;
				СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаУслуги.КлючАналитикиПеревозки;
				КлючАналитикиПеревозки 						   = Справочники.КлючиАналитикиПеревозки
					.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
				СтрокаУслуги.КлючАналитикиПеревозки 			   = КлючАналитикиПеревозки.КлючАналитикиПеревозки;
				
				//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(СтрокаУслуги);
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла; 
	
		
	Если ЕстьИзменения Тогда
		ОбщегоНазначения.СообщитьПользователю("Есть изменение данных по документу основанию реф.сцеп");
	КонецЕсли;	
			
КонецПроцедуры	

Процедура ЗаполнитьКонтейнерыИзРефСцепа(Основание
				, ЭтоСозданиеЗаявкиИзРефСцепа
				, МассивКонтейнеров
				, ДГК);	

	ДанныеИзРефСцепа = РефСцепСервер.ПолучитьДанныеЗаполненияЗаявкиНаОснованииРефСцепа
		(Основание, МассивКонтейнеров);
	ДанныеПоКонтейнерам 	 = ДанныеИзРефСцепа.ДанныеПоКонтейнерам;
	Шапка               	 = ДанныеИзРефСцепа.Шапка;
	ДанныеКлиента			 = ДанныеИзРефСцепа.ДанныеКлиента;  
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024
	ДанныеДетализацииПоГрузу = ДанныеИзРефСцепа.ДетализацияПоГрузу;
	// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
	
	// Контейнеры
	Пока ДанныеПоКонтейнерам.Следующий() Цикл
		Если ДанныеПоКонтейнерам.КлючАналитикиПеревозки 
			= Справочники.КлючиАналитикиПеревозки.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
		НоваяСтрока     	   		    = Объект.СоставУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПоКонтейнерам);
		НоваяСтрока.НомерКТК 		    = ДанныеПоКонтейнерам.Контейнер;
		НоваяСтрока.ГУИДСтроки	 	    = Строка(Новый УникальныйИдентификатор()); 
		
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Начало: 01.07.2024 
		СтруктураПоискаДетализации = Новый Структура("КлючАналитикиПеревозки", ДанныеПоКонтейнерам.КлючАналитикиПеревозки); 
		Пока ДанныеДетализацииПоГрузу.НайтиСледующий(СтруктураПоискаДетализации) Цикл
			НСДетализации = ДетализацияПоГрузу.Добавить();
			ЗаполнитьЗначенияСвойств(НСДетализации, ДанныеДетализацииПоГрузу);
		КонецЦикла;
		// Евросиб(ДИТ) US 85028 ТА 87358 Сержантова А.С. Конец: 01.07.2024
		
		//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(НоваяСтрока);
		
		//СтруктураКлючаАналитикиПеревозки 			   = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		//СтруктураКлючаАналитикиПеревозки.Заявка 	   = ОБъект.Ссылка;
		//СтруктураКлючаАналитикиПеревозки.Контейнер 	   = НоваяСтрока.НомерКТК;
		//СтруктураКлючаАналитикиПеревозки.КлючАналитики = НоваяСтрока.КлючАналитикиПеревозки;
		//КлючАналитикиПеревозки 						   = Справочники.КлючиАналитикиПеревозки
		//	.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		//НоваяСтрока.КлючАналитикиПеревозки 			   = КлючАналитикиПеревозки.КлючАналитикиПеревозки;
		
	//Субботин 77659 02.02.2024 Начало
		ЭтаФорма.Модифицированность = Истина;
	//Субботин 77659 02.02.2024 Конец
	
	КонецЦикла;
	Пока Шапка.Следующий() Цикл
		Для каждого СтрУслуг из Объект.СоставУслуги Цикл
			ЗаполнитьЗначенияСвойств(СтрУслуг, Шапка);
		КонецЦикла;	
		Если ЭтоСозданиеЗаявкиИзРефСцепа Тогда
			Если ЗначениеЗаполнено(Шапка.Рейс) Тогда
				НоваяСтрока 	 	= Объект.ПереченьРейсов.Добавить();
				НоваяСтрока.Рейс 	= Шапка.Рейс;
				НоваяСтрока.Продукт = Шапка.Продукт;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	// Клиент
	Если ЭтоСозданиеЗаявкиИзРефСцепа Тогда
		Если ДГК Тогда
			Объект.Контрагент =  Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
			Объект.Договор	  =  КонтрагентыДоговоры_Сервер.ПолучитьЕдинственныйДоговорКонтрагента(Объект.Контрагент);
		Иначе	
			Пока ДанныеКлиента.Следующий() Цикл
				Объект.Контрагент = ДанныеКлиента.Клиент;
				Прервать;	
			КонецЦикла;	
        КонецЕсли;
	КонецЕсли; 
		
КонецПроцедуры
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 

// ++ Евросиб Дудоров С.В. US 61271 30.01.2023 в рамках
// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
&НаКлиенте
Процедура ЗаполнитьДоговорЕслиОдин(Элемент)
	Если не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.Договор = ПолучитьЕдинственныйДоговорКонтрагентаНаСервере(ОБъект.Контрагент);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдинственныйДоговорКонтрагентаНаСервере(Контрагент)
	КонтрагентДирекцииЕвросиба = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
	Если Контрагент = КонтрагентДирекцииЕвросиба Тогда
	    Возврат КонтрагентыДоговоры_Сервер.ПолучитьЕдинственныйДоговорКонтрагента(Контрагент);
	КонецЕсли;	
    Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, начало
	Если НЕ РазрешеноИзменитьКонтрагента() Тогда
		СтандартнаяОбработка = Ложь;	
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, конец
	
	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных;
	
	ГруппаОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;

	//далее добавляем первое условие отбора
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Родитель = ГруппаОтбора;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипКонтрагента_Клиент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;

	//далее добавляем второе условие отбора. У нас вид соединения: или 1 условие или 2 условие
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Родитель = ГруппаОтбора;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДляСлужебныхЗаявок");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
	
	ДополнительныеПараметры = Новый Структура();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьКонтрагентаПриВыбореЗавершение"
		, ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы,
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтрагентаПриВыбореЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.Контрагент = Результат;
		КонтрагентПриИзменении(Элементы.Контрагент);
	КонецЕсли;	
КонецПроцедуры
// ДИТ US 64086 TA 68396 Евсенкин М.А. Начало: 13.04.2023
&НаСервере
Процедура ПроверитьСтавкиКалькуляции(Отказ, ПараметрыЗаписи)
	Если Не Отказ Тогда
		МассивКалькуляций = Новый Массив;
		Для Каждого Стр Из Объект.СоставУслуги Цикл
			Если ЗначениеЗаполнено(Стр.Калькуляция) Тогда
				Если МассивКалькуляций.Найти(Стр.Калькуляция) = Неопределено Тогда
					МассивКалькуляций.Добавить(Стр.Калькуляция);        
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
		Запрос = Новый Запрос;
		//Запрос.Текст = 
		////"ВЫБРАТЬ
		////|	Калькуляция.Ссылка КАК Калькуляция,
		////|	СУММА(Калькуляция.Итого20) > 0 КАК ЕстьСтавка20,
		////|	СУММА(Калькуляция.Итого40) > 0 КАК ЕстьСтавка40
		////|ИЗ
		////|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК Калькуляция
		////|ГДЕ
		////|	Калькуляция.Ссылка В(&МассивКалькуляций)
		////|
		////|СГРУППИРОВАТЬ ПО
		////|	Калькуляция.Ссылка
		////ДИТ, Беляев СЮ, Ticket#0333737, 30-11-2023, начало
		//"ВЫБРАТЬ
		//|	Калькуляция.Ссылка КАК Калькуляция,
		//|	Калькуляция.ММ_ИтогоСтавка20 > 0 КАК ЕстьСтавка20,
		//|	Калькуляция.ММ_ИтогоСтавка > 0 КАК ЕстьСтавка40
		//|ИЗ
		//|	Документ.Калькуляция КАК Калькуляция
		//|ГДЕ
		//|	Калькуляция.Ссылка В(&МассивКалькуляций)
		////ДИТ, Беляев СЮ, Ticket#0333737, 30-11-2023, конец
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК Калькуляция,
		//|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 > 0 КАК ЕстьСтавка20,
		//|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 > 0 КАК ЕстьСтавка40,
		//|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC КАК SOCCOC
		//|ИЗ
		//|	Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
		//|ГДЕ
		//|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка В(&МассивКалькуляций)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		////|ВЫБРАТЬ
		////|	Калькуляция.Ссылка КАК Калькуляция,
		////|	СУММА(Калькуляция.Итого40) > 0 КАК ЕстьСтавка40
		////|ИЗ
		////|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК Калькуляция
		////|ГДЕ
		////|	Калькуляция.Ссылка В(&МассивКалькуляций)
		////|	И Калькуляция.Ссылка.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
		////|
		////|СГРУППИРОВАТЬ ПО
		////|	Калькуляция.Ссылка
		////ДИТ, Беляев СЮ, Ticket#0333737, 30-11-2023, начало
		//|ВЫБРАТЬ
		//|	Калькуляция.Ссылка КАК Калькуляция,
		//|	Калькуляция.ММ_ИтогоСтавка > 0 КАК ЕстьСтавка40
		//|ИЗ
		//|	Документ.Калькуляция КАК Калькуляция
		//|ГДЕ
		//|	Калькуляция.Ссылка В(&МассивКалькуляций)
		//|	И Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)";
		////ДИТ, Беляев СЮ, Ticket#0333737, 30-11-2023, конец
		
		//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Калькуляция.Ссылка КАК Калькуляция,
		|	Калькуляция.ММ_ИтогоСтавка20 > 0 КАК ЕстьСтавка20,
		|	Калькуляция.ММ_ИтогоСтавка > 0 КАК ЕстьСтавка40
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Ссылка В(&МассивКалькуляций)
		|	И (Калькуляция.ММ_ИтогоСтавка20 > 0
		|			ИЛИ Калькуляция.ММ_ИтогоСтавка > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК Калькуляция,
		|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 > 0 КАК ЕстьСтавка20,
		|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 > 0 КАК ЕстьСтавка40,
		|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC КАК SOCCOC,
		|	КалькуляцияНФ_ВыбранныеСтавки.Выбрано20 КАК Выбрано20,
		|	КалькуляцияНФ_ВыбранныеСтавки.Выбрано40 КАК Выбрано40
		|ИЗ
		|	Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
		|ГДЕ
		|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка В(&МассивКалькуляций)
		|	И (КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
		|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Калькуляция.Ссылка КАК Калькуляция,
		|	Калькуляция.ММ_ИтогоСтавка > 0 КАК ЕстьСтавка40
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Ссылка В(&МассивКалькуляций)
		|	И Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)";
		//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
		
		Запрос.УстановитьПараметр("МассивКалькуляций", МассивКалькуляций);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
				
		Раздел13 		 = РезультатЗапроса[0].Выгрузить();
		Раздел22 		 = РезультатЗапроса[1].Выгрузить();
		РазделДляВагонов = РезультатЗапроса[2].Выгрузить();
		
		МассивКонтейнеровБезРазмера = Новый Массив;	
		
		Для каждого Стр Из Объект.СоставУслуги Цикл
			Если ЗначениеЗаполнено(Стр.НомерКТК) И НЕ ЗначениеЗаполнено(Стр.РазмерКТК) Тогда
				МассивКонтейнеровБезРазмера.Добавить(Стр.НомерКТК);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;		
		
		Если НЕ Отказ Тогда
			КалькуляцииБезРазделов = Новый Массив;
			Для Каждого ЗнчКалк Из МассивКалькуляций Цикл
				
				КТКБезСтавки = Новый Массив;
				КТКФутность = Новый Массив;
				ВагоныБезСтавки = Новый Массив;
				КТКБезСобственности = Новый Массив; 
				СтруктураПоиска = Новый Структура("Калькуляция",ЗнчКалк);		
				СтрокиСоставаУслуг = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
				//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
				СтрокиТекущейКалькуляцииРаздел13 = Раздел13.НайтиСтроки(СтруктураПоиска);
				СтрокиТекущейКалькуляцииРаздел22 = Раздел22.НайтиСтроки(СтруктураПоиска);
				СтрокиРазделДляВагонов = РазделДляВагонов.НайтиСтроки(СтруктураПоиска);
				РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗнчКалк, "ЕдиницаИзмерения, ТипКалькуляции");
				//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
				
				Для Каждого Стр Из СтрокиСоставаУслуг Цикл
					
					//Проверка для вагонов
					//Если Стр.Калькуляция.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
					//	СтруктураПоиска = Новый Структура("Калькуляция",Стр.Калькуляция);
					//	СтрокиРазделДляВагонов = РазделДляВагонов.НайтиСтроки(СтруктураПоиска);
					//	Если СтрокиРазделДляВагонов.Количество() Тогда
					//		Если НЕ СтрокиРазделДляВагонов[0].ЕстьСтавка40 Тогда
					//			Если ВагоныБезСтавки.Найти(Стр.Вагон) = Неопределено Тогда
					//				ВагоныБезСтавки.Добавить(Стр.Вагон);
					//			КонецЕсли;		
					//		КонецЕсли;
					//	Иначе
					//		Если ВагоныБезСтавки.Найти(Стр.Вагон) = Неопределено Тогда
					//			ВагоныБезСтавки.Добавить(Стр.Вагон);
					//		КонецЕсли;
					//	КонецЕсли;
					//	Продолжить;
					//КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
					Если РеквизитыКалькуляции.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
						Если СтрокиРазделДляВагонов.Количество() > 0 Тогда
							Если НЕ СтрокиРазделДляВагонов[0].ЕстьСтавка40 Тогда
								ВагоныБезСтавки.Добавить(Стр.Вагон);
							КонецЕсли;
						Иначе
							ВагоныБезСтавки.Добавить(Стр.Вагон);
						КонецЕсли;
						Продолжить;
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
					
					//ДИТ, Беляев СЮ, BUG 79578/TA 79580, 12-01-2024, начало
					Если НЕ ЗначениеЗаполнено(Стр.НомерКТК) Тогда
						Продолжить;
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 79578/TA 79580, 12-01-2024, конец
					
					//Проверка для КТК и услуг
					// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
					//ок(
					//Если Стр.СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.SOC Тогда
					//ок)
					Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
					// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
						SOCCOC = "SOC";
					Иначе
						SOCCOC = "COC";
					КонецЕсли;
					
					//СтруктураПоиска = Новый Структура("Калькуляция",Стр.Калькуляция);
					//СтрокиРаздел22 = Раздел22.НайтиСтроки(СтруктураПоиска);
					//Если СтрокиРаздел22.Количество() Тогда
					//	SOCЗаполнен = Ложь;
					//	COCЗаполнен = Ложь;
					//	Для Каждого СтрокаРаздел22 Из СтрокиРаздел22 Цикл
					//		Если СтрокаРаздел22.SOCCOC = "SOC" Тогда
					//			Если СтрокаРаздел22.ЕстьСтавка20 ИЛИ СтрокаРаздел22.ЕстьСтавка40 Тогда
					//				SOCЗаполнен = Истина;
					//			КонецЕсли;
					//		Иначе
					//			Если СтрокаРаздел22.ЕстьСтавка20 ИЛИ СтрокаРаздел22.ЕстьСтавка40 Тогда
					//				COCЗаполнен = Истина;
					//			КонецЕсли;
					//		КонецЕсли;	
					//	КонецЦикла;	
					//	
					//	Для Каждого СтрокаРаздел22 Из СтрокиРаздел22 Цикл
					//		Если СтрокаРаздел22.SOCCOC = SOCCOC Тогда
					//			Если СтрокаРаздел22.SOCCOC = "SOC" Тогда
					//				Если НЕ СтрокаРаздел22.ЕстьСтавка20 И НЕ СтрокаРаздел22.ЕстьСтавка40 И COCЗаполнен Тогда
					//					Если КТКБезСобственности.Найти(Стр.НомерКТК) = Неопределено Тогда
					//						КТКБезСобственности.Добавить(Стр.НомерКТК);
					//					КонецЕсли;
					//					Продолжить;
					//				КонецЕсли;
					//			Иначе
					//				Если НЕ СтрокаРаздел22.ЕстьСтавка20 И НЕ СтрокаРаздел22.ЕстьСтавка40 И SOCЗаполнен Тогда
					//					Если КТКБезСобственности.Найти(Стр.НомерКТК) = Неопределено Тогда
					//						КТКБезСобственности.Добавить(Стр.НомерКТК);
					//					КонецЕсли;
					//					Продолжить;
					//				КонецЕсли;
					//			КонецЕсли;
					//			Если Стр.РазмерКТК.Наименование = "20" и НЕ СтрокаРаздел22.ЕстьСтавка20 И СтрокаРаздел22.ЕстьСтавка40 Тогда
					//				Если КТКФутность.Найти(Стр.НомерКТК) = Неопределено Тогда
					//					КТКФутность.Добавить(Стр.НомерКТК);
					//				КонецЕсли;	
					//			ИначеЕсли Стр.РазмерКТК.Наименование = "20" и НЕ СтрокаРаздел22.ЕстьСтавка20 И НЕ СтрокаРаздел22.ЕстьСтавка40 Тогда
					//				Если КТКБезСтавки.Найти(Стр.НомерКТК) = Неопределено Тогда
					//					КТКБезСтавки.Добавить(Стр.НомерКТК);
					//				КонецЕсли;
					//			КонецЕсли;
					//			Если (Стр.РазмерКТК.Наименование = "40" или Стр.РазмерКТК.Наименование = "45") и НЕ СтрокаРаздел22.ЕстьСтавка40 И СтрокаРаздел22.ЕстьСтавка20 Тогда
					//				Если КТКФутность.Найти(Стр.НомерКТК) = Неопределено Тогда
					//					КТКФутность.Добавить(Стр.НомерКТК);
					//				КонецЕсли;
					//			ИначеЕсли (Стр.РазмерКТК.Наименование = "40" или Стр.РазмерКТК.Наименование = "45") и НЕ СтрокаРаздел22.ЕстьСтавка40 И НЕ СтрокаРаздел22.ЕстьСтавка20 Тогда	
					//				Если КТКБезСтавки.Найти(Стр.НомерКТК) = Неопределено Тогда
					//					КТКБезСтавки.Добавить(Стр.НомерКТК);
					//				КонецЕсли;
					//			КонецЕсли;
					//		КонецЕсли;	
					//	КонецЦикла	
					//КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
					РазмерКТКНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.РазмерКТК, "Наименование");
					РазмерКонтейнера40 = (РазмерКТКНаименование = "40" или РазмерКТКНаименование = "45");
					Если СтрокиТекущейКалькуляцииРаздел22.Количество() > 0 Тогда
						СтруктураПоиска = Новый Структура();
						СтруктураПоиска.Вставить("Калькуляция", Стр.Калькуляция);
						СтруктураПоиска.Вставить("SOCCOC", SOCCOC);
						Если РазмерКонтейнера40 Тогда
							СтруктураПоиска.Вставить("Выбрано40", Истина);
						Иначе
							СтруктураПоиска.Вставить("Выбрано20", Истина);
						КонецЕсли;
						СтрокиРаздел22 = Раздел22.НайтиСтроки(СтруктураПоиска);
						Если СтрокиРаздел22.Количество() = 0 Тогда
							СтруктураПоиска.Удалить("SOCCOC");
							СтрокиРаздел22 = Раздел22.НайтиСтроки(СтруктураПоиска);
							Если СтрокиРаздел22.Количество() > 0 Тогда
								КТКБезСобственности.Добавить(Стр.НомерКТК);
							Иначе
								СтруктураПоиска.Вставить("SOCCOC", SOCCOC);
								СтруктураПоиска.Удалить("Выбрано20");
								СтруктураПоиска.Удалить("Выбрано40");
								Если РазмерКонтейнера40 Тогда
									СтруктураПоиска.Вставить("Выбрано20", Истина);
								Иначе
									СтруктураПоиска.Вставить("Выбрано40", Истина);
								КонецЕсли;
								СтрокиРаздел22 = Раздел22.НайтиСтроки(СтруктураПоиска);
								Если СтрокиРаздел22.Количество() > 0 Тогда
									КТКФутность.Добавить(Стр.НомерКТК);
								Иначе
									КТКБезСтавки.Добавить(Стр.НомерКТК);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
					
					//СтруктураПоиска = Новый Структура("Калькуляция",Стр.Калькуляция);
					//СтрокиРаздел13 = Раздел13.НайтиСтроки(СтруктураПоиска);
					//Если СтрокиРаздел13.Количество() Тогда
					//	Если Стр.РазмерКТК.Наименование = "20" и НЕ СтрокиРаздел13[0].ЕстьСтавка20 И СтрокиРаздел13[0].ЕстьСтавка40 Тогда
					//		Если КТКФутность.Найти(Стр.НомерКТК) = Неопределено Тогда
					//			КТКФутность.Добавить(Стр.НомерКТК);
					//		КонецЕсли;
					//	ИначеЕсли Стр.РазмерКТК.Наименование = "20" и НЕ СтрокиРаздел13[0].ЕстьСтавка20 И НЕ СтрокиРаздел13[0].ЕстьСтавка40 Тогда	
					//		Если КТКБезСтавки.Найти(Стр.НомерКТК) = Неопределено Тогда
					//			КТКБезСтавки.Добавить(Стр.НомерКТК);
					//		КонецЕсли;
					//	КонецЕсли;
					//	Если (Стр.РазмерКТК.Наименование = "40" или Стр.РазмерКТК.Наименование = "45") и НЕ СтрокиРаздел13[0].ЕстьСтавка40 И СтрокиРаздел13[0].ЕстьСтавка20 Тогда
					//		Если КТКФутность.Найти(Стр.НомерКТК) = Неопределено Тогда
					//			КТКФутность.Добавить(Стр.НомерКТК);
					//		КонецЕсли;
					//	ИначеЕсли (Стр.РазмерКТК.Наименование = "40" или Стр.РазмерКТК.Наименование = "45") и НЕ СтрокиРаздел13[0].ЕстьСтавка40 И НЕ СтрокиРаздел13[0].ЕстьСтавка20 Тогда	
					//		Если КТКБезСтавки.Найти(Стр.НомерКТК) = Неопределено Тогда
					//			КТКБезСтавки.Добавить(Стр.НомерКТК);
					//		КонецЕсли;
					//	КонецЕсли;
					//КонецЕсли;
					
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
					Если СтрокиТекущейКалькуляцииРаздел22.Количество() = 0 Тогда
						Если СтрокиТекущейКалькуляцииРаздел13.Количество() > 0 Тогда
							ЕстьСтавка20 = СтрокиТекущейКалькуляцииРаздел13[0].ЕстьСтавка20;
							ЕстьСтавка40 = СтрокиТекущейКалькуляцииРаздел13[0].ЕстьСтавка40;
							
							Если РазмерКонтейнера40 Тогда
								Если НЕ ЕстьСтавка40 И ЕстьСтавка20 Тогда
									КТКФутность.Добавить(Стр.НомерКТК);
								КонецЕсли;
								Если НЕ ЕстьСтавка40 И НЕ ЕстьСтавка20 Тогда	
									КТКБезСтавки.Добавить(Стр.НомерКТК);
								КонецЕсли;
							Иначе
								Если НЕ ЕстьСтавка20 И ЕстьСтавка40 Тогда
									КТКФутность.Добавить(Стр.НомерКТК);
								КонецЕсли;
								Если НЕ ЕстьСтавка20 И НЕ ЕстьСтавка40 Тогда	
									КТКБезСтавки.Добавить(Стр.НомерКТК);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
	
				КонецЦикла;
				//Если НЕ Стр.Калькуляция.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон  
				//	// ДИТ US 59973 Сержантова А.С. Начало: 12.09.2023 - по калькуляциям на субсидию раздел 1.3 и 2.2 не заполняются 
				//	и Стр.Калькуляция.ТипКалькуляции <> Перечисления.ТипыКалькуляций.Субсидии Тогда 
				//	// ДИТ US 59973 Сержантова А.С. Конец: 12.09.2023
				//	Если НЕ СтрокиРаздел22.Количество() И НЕ СтрокиРаздел13.Количество() Тогда
				//		Если КалькуляцииБезРазделов.Найти(ЗнчКалк) = Неопределено Тогда
				//			КалькуляцииБезРазделов.Добавить(ЗнчКалк);
				//		КонецЕсли;	
				//	КонецЕсли;
				//КонецЕсли;
				//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
				Если НЕ РеквизитыКалькуляции.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон
						И РеквизитыКалькуляции.ТипКалькуляции <> Перечисления.ТипыКалькуляций.Субсидии И РеквизитыКалькуляции.ТипКалькуляции <> Перечисления.ТипыКалькуляций.Премии Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
					Если СтрокиТекущейКалькуляцииРаздел13.Количество() = 0 И СтрокиТекущейКалькуляцииРаздел22.Количество() = 0 Тогда
						КалькуляцииБезРазделов.Добавить(ЗнчКалк);
					КонецЕсли;
				КонецЕсли;
				//ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
				Если КТКФутность.Количество() Тогда
					Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(КТКФутность); //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, добавлено
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В Калькуляции %1 от %2 не соответствует размер КТК № %3",ЗнчКалк.Номер,ЗнчКалк.Дата,СтрСоединить(КТКФутность,",")),,,,Отказ);
				КонецЕсли;
				
				Если КТКБезСтавки.Количество() Тогда
					Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(КТКБезСтавки); //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, добавлено
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В Калькуляции %1 от %2 не заполнена ставка",ЗнчКалк.Номер,ЗнчКалк.Дата),,,,Отказ);
				КонецЕсли;
				
				Если ВагоныБезСтавки.Количество() Тогда
					Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(ВагоныБезСтавки); //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, добавлено
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В Калькуляции %1 от %2 не заполнена ставка",ЗнчКалк.Номер,ЗнчКалк.Дата),,,,Отказ);
				КонецЕсли;
				
				Если КТКБезСобственности.Количество() Тогда
					Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(КТКБезСобственности); //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, добавлено
				//Евросиб СубботинВ #91170 07.10.2024 Начало  было 
				//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В Калькуляции %1 от %2 не соответствует принадлежность КТК № %3",ЗнчКалк.Номер,ЗнчКалк.Дата,СтрСоединить(КТКБезСобственности,",")),,,,Отказ);
				//Стало
				// поменял текст сообщения
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("У выбранной калькуляции %1 от %2 в разделе 2.2 не заполнена таблица ставок по фрахту для соответствующего размера и принадлежности КТК: %3.", ЗнчКалк.Номер, ЗнчКалк.Дата, СтрСоединить(КТКБезСобственности,",")),,,,Отказ);
				//Евросиб СубботинВ #91170 07.10.2024 Конец	
				КонецЕсли;
				
			КонецЦикла;
			Если КалькуляцииБезРазделов.Количество() Тогда
				Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(КалькуляцииБезРазделов); //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, добавлено
				Для Каждого ЗнчМ Из КалькуляцииБезРазделов Цикл
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В Калькуляции %1 от %2 не заполнена ставка",ЗнчКалк.Номер,ЗнчКалк.Дата),,,,Отказ);
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
		
		//Если МассивКонтейнеровБезРазмера.Количество() Тогда //ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, перенесено ниже
		//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнены размеры у КТК № %1",СтрСоединить(МассивКонтейнеровБезРазмера,",")),,,,Отказ);	
		//КонецЕсли;	
		
		//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, начало
		Если МассивКонтейнеровБезРазмера.Количество() Тогда
			Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКонтейнеровБезРазмера);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнены размеры у КТК № %1",СтрСоединить(МассивКонтейнеровБезРазмера,",")),,,,Отказ);	
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 80592/TA 80634, 04-03-2024, конец
	КонецЕсли;
	
	////ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, начало
	//Если МассивКонтейнеровБезРазмера.Количество() Тогда
	//	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКонтейнеровБезРазмера);
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнены размеры у КТК № %1",СтрСоединить(МассивКонтейнеровБезРазмера,",")),,,,Отказ);	
	//КонецЕсли;
	////ДИТ, Беляев СЮ, BUG 78827/TA 78829, 26-12-2023, конец
КонецПроцедуры	

// ДИТ US 64086 TA 68396 Евсенкин М.А. Конец: 13.04.2023	

&НаКлиенте
Процедура СоставУслугиДатаВыдачиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ДатаВыдачиКТКСТерминала",ТекущиеДанные.ДатаВыдачи);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ДатаВыдачи,"ДатаВыдачиКТКСТерминала",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеРеквизитаМилиВКлюч(ТекСтр,ЗначениеПоля,ИмяПоля,ЭтапПеревозки = Неопределено,СтруктураПолейТЧМили = Неопределено) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	Если ТекСтр.ВерсияКлюча <> ТекСтр.КлючАналитикиПеревозки.ВерсияДанных Тогда
		ОбновитьДанныеКлючаАналитикиПеревозки(ТекСтр);
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
	КонецЕсли;
	
	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();	
	СтруктураКлюча.Вставить("КлючАналитики",ТекСтр.КлючАналитикиПеревозки);
	
	Если ЭтапПеревозки = Неопределено Тогда
		СтруктураКлюча.Вставить(ИмяПоля,ЗначениеПоля);
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
		//ТекСтр.ВерсияКлюча = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных; 
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики,СтруктураПолейТЧМили);
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
		//ТекСтр.ВерсияКлюча = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных; 
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики,СтруктураПолейТЧМили); 
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
		//ТекСтр.ВерсияКлюча = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;   
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	КонецЕсли;	
	
КонецПроцедуры 

Функция ПолучитьСтруктуруДляЗаписиКлюча() //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
	// Было:
	//Возврат Новый Структура("КлючАналитикиПеревозки,НомерКТК,Груз,ВерсияКлюча,ИнструкцииПоСдачеПорожнего"); 
	//Стало:
	Возврат Новый Структура("КлючАналитикиПеревозки,НомерКТК,Груз,КоличествоМест,ВесГруза,ВерсияКлюча,ИнструкцииПоСдачеПорожнего");
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
КонецФункции

//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -начало
&НаКлиенте
Процедура СоставУслугиДатаВозвратаКлиентомПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ДатаСдачиКТКНаТерминал",ТекущиеДанные.ДатаВозвратаКлиентом);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ДатаВозвратаКлиентом,"ДатаСдачиКТКНаТерминал",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиФИОВодителяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ФИОВодителя",ТекущиеДанные.ФИОВодителя);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ФИОВодителя,"ФИОВодителя",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиНомерАвтоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("РегНомерТС",ТекущиеДанные.НомерАвто);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.НомерАвто,"РегНомерТС",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 24.01.2024
// Было:
//&НаКлиенте
//Процедура СоставУслугиАвтоперевозчикПерваяМиляПриИзменении(Элемент)
//	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
//	СтруктураТЧМили = Новый Структура;
//	СтруктураТЧМили.Вставить("Автоперевозчик",ТекущиеДанные.АвтоперевозчикПерваяМиля);
//	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
//	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
//	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.АвтоперевозчикПерваяМиля,"Автоперевозчик",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);
//КонецПроцедуры  
// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 24.01.2024

&НаКлиенте
Процедура СоставУслугиФИОВодителяВыгрузкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ФИОВодителя",ТекущиеДанные.ФИОВодителя);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ФИОВодителя,"ФИОВодителя",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиНомерАвтоВыгрузкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("РегНомерТС",ТекущиеДанные.НомерАвтоВыгрузка);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.НомерАвтоВыгрузка,"РегНомерТС",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 24.01.2024
// Было:
//&НаКлиенте
//Процедура СоставУслугиАвтоПеревозчик1ПриИзменении(Элемент)
//	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
//	СтруктураТЧМили = Новый Структура;
//	СтруктураТЧМили.Вставить("Автоперевозчик",ТекущиеДанные.АвтоПеревозчик);
//	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
//	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
//	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.АвтоПеревозчик,"Автоперевозчик",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
//КонецПроцедуры 
// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 24.01.2024

&НаКлиенте
Процедура СоставУслугиДатаПодачиАвтоПодПогрузкуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ДатаВыездаКТКСоСклада",ТекущиеДанные.ДатаПодачиАвтоПодПогрузку);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ДатаПодачиАвтоПодПогрузку,"ДатаВыездаКТКСоСклада",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили);
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиДатаПодачиАвтоПодВыгрузкуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, начало
	Если ТекущиеДанные <> неопределено Тогда
		Если ТекущиеДанные.ДатаПодачиАвтоПодВыгрузку > КонецДня(ТекущаяДата()) Тогда
			ТекущиеДанные.ДатаПодачиАвтоПодВыгрузку = Дата(1,1,1);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Дата доставка груза не может быть больше текущей даты!",,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", ТекущиеДанные.НомерСтроки, "ДатаПодачиАвтоПодВыгрузку"),"Объект")
		КонецЕсли;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, коне
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ДатаВыездаКТКСоСклада",ТекущиеДанные.ДатаПодачиАвтоПодВыгрузку);
	Структура = ПолучитьСтруктуруДляЗаписиКлюча();
	ЗаполнитьЗначенияСвойств(Структура,ТекущиеДанные);
	ДобавитьЗначениеРеквизитаМилиВКлюч(Структура,ТекущиеДанные.ДатаПодачиАвтоПодВыгрузку,"ДатаВыездаКТКСоСклада",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили);
КонецПроцедуры 
//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -конец

&НаСервере
Процедура УстановитьВидимостьПолейПоКонтрагенту() 
	
	ВидимостьЭлементов = Истина;
	
	Если Объект.Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() Тогда
    	ВидимостьЭлементов = Ложь;
	КонецЕсли;
		
	Элементы.СписокЗапросНаКТККомментарийКСрокуИспользованияКТК.Видимость = ВидимостьЭлементов;
	Элементы.СписокЗапросНаКТКВалютаПоДоговору.Видимость = ВидимостьЭлементов;
	Элементы.СписокЗапросНаКТКГруппаСтавка.Видимость = ВидимостьЭлементов;
	Элементы.СписокЗапросНаКТККомментарийКСтавке.Видимость = ВидимостьЭлементов; 
	
	//Евросиб Коханенко Н.А. 04.07.2023 (( #72162
	//Скрыть поля в шапке документа Заявка:
	Элементы.КонтактноеЛицо.Видимость = ВидимостьЭлементов; 						//- Контактное лицо
	Элементы.ВнешнийНомер.Видимость = ВидимостьЭлементов;   						//- «Внешний номер»;
	//Скрыть поля в табличной части Услуги документа Заявка:
	Элементы.СоставУслугиПодтвержденоЗаказчику.Видимость = ВидимостьЭлементов; 		//- Подтверждено заказчику;
	Элементы.СоставУслугиПлан.Видимость = ВидимостьЭлементов; 						//- КТК из стока (автом.);
	Элементы.СоставУслугиНормативноеИспользование.Видимость = ВидимостьЭлементов; 	//- Срок исп.клиентом;
	Элементы.СоставУслугиУсловияПеревозки.Видимость = ВидимостьЭлементов; 			//- Условия перевозки по отправлению;
	Элементы.СоставУслугиУсловияПеревозкиНазначение.Видимость = ВидимостьЭлементов; //- Условия перевозки по прибытию;
	Элементы.СоставУслугиГруппаПараметрыГруза.Видимость = ВидимостьЭлементов; 		//- Параметры груза_опасный, Параметры груза_Груз, Параметры груза_Груженый, Параметры груза_ЕТСНГ/ГНГ, Параметры груза_Род упаковки, Параметры груза_Ценный (охрана), Параметры груза_Вес нетто, кг, Параметры груза_Количество мест;
	Элементы.СоставУслугиДатаПостановкиВРезерв.Видимость = ВидимостьЭлементов; 		//- Резерв КТК под заявку;
	Элементы.СоставУслугиСрокОтправкиУведомления.Видимость = ВидимостьЭлементов; 	//- Срок отправки уведомления;
	Элементы.СоставУслугиРеестрКлиента.Видимость = ВидимостьЭлементов; 				//- Реестр/Поручение клиента;
	//Евросиб Коханенко Н.А. 04.07.2023 )) #72162 
	
КонецПроцедуры


&НаКлиенте
Процедура СоставУслугиАдресПогрузкиОтпр1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//Евросиб - АСуслов 30.06.2023 13:11:28 #локации
//(
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СозданиеСВыборомНаселенногоПункта");
	//ПараметрыОткрытияФормы.Вставить("Локация", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытияФормы.Вставить("Локация", Неопределено);
	ПараметрыОткрытияФормы.Вставить("АдресВЛокации", ДанныеВыбора);

	 //ОткрытьФорму("Справочник.АдресаВНаселенныхПунктах.Форма.ФормаПодбораАдреса", ПараметрыОткрытияФормы,Элемент);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАдресаПоГеокодеруЯндекс", ПараметрыОткрытияФормы,Элемент);

//)
//Евросиб - АСуслов 30.06.2023 13:11:32 #локации
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиАдресПогрузкиПрибытиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//Евросиб - АСуслов 30.06.2023 13:11:28 #локации
//(
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СозданиеСВыборомНаселенногоПункта");
	//ПараметрыОткрытияФормы.Вставить("Локация", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытияФормы.Вставить("Локация", Неопределено);
	ПараметрыОткрытияФормы.Вставить("АдресВЛокации", ДанныеВыбора);

	 //ОткрытьФорму("Справочник.АдресаВНаселенныхПунктах.Форма.ФормаПодбораАдреса", ПараметрыОткрытияФормы,Элемент);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАдресаПоГеокодеруЯндекс", ПараметрыОткрытияФормы,Элемент);
//)
//Евросиб - АСуслов 30.06.2023 13:11:32 #локации
КонецПроцедуры

//Евросиб Коханенко Н.А. 03.07.2023 (( #72162 
&НаКлиенте
Процедура ЗаполнитьПолеВидПеревозкиЗначениемПоУмолчанию();
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.ПСЦ) Тогда
		Если КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) Тогда 
			Объект.ВидПеревозки = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ПСЦ, "ВидПеревозки"); 
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
//Евросиб Коханенко Н.А. 03.07.2023 )) #72162 

//Евросиб Коханенко Н.А. 25.07.2023 (( #72829 
&НаСервереБезКонтекста
Функция ПроверитьНаВозможностьВыбораКалькуляцииПоРезультатамСогласования(ТекущийОбъектСсылка = Неопределено, Калькуляция)
	Если ТекущийОбъектСсылка = Неопределено Тогда
		ТекущийОбъектСсылка = Документы.Заявка.ПустаяСсылка();
	КонецЕсли;
	Возврат КалькуляцииЗаявкиПСЦСервер.ПроверитьНаВозможностьИспользованияКалькуляцииПоРезультатамСогласования(ТекущийОбъектСсылка, Калькуляция);
КонецФункции
//Евросиб Коханенко Н.А. 25.07.2023 )) #72829

//Субботин 77659 24.11.2023 Начало   //Обработчики событий формы
&НаКлиенте
Процедура СписокЗапросНаКТКСписокКТК1ПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	СтрокаТЧ.СписокКТК = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокКТК);

КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросНаКТКСписокКТК1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	СписокКТКИзСтрокЗапроса = ПолучитьСписокКткИзЗапросаКТКПоОстальнымСтрокам(Данные.НомерСтроки);	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("Документ.Заявка.Форма.ОкноСоставаКТК", Новый Структура("СоставТЕ, КТКЗапроса, ЗаявкаТЧУслуги, ТипКТК, ПерваяМиля, ПоследняяМиля", Данные.СписокКТК, СписокКТКИзСтрокЗапроса, Объект.СоставУслуги, Данные.ТипКТК,Данные.Автоперевозка, Данные.ПоследняяМиля),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	НеобходимПеренос = Ложь;
	
	СписокАктуальныхКТК = Параметр1.СтрокиКонтейнеров;
	Если Параметр1.Свойство("ПереносимыеКТК") тогда
		НеобходимПеренос = Истина;
		СписокКТКДляПереноса =  Параметр1.ПереносимыеКТК;
	КонецЕсли;
		
	Если Параметр2.Свойство("ТЕ") Тогда
		ТекДанные = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
		ОчиститьСвязьСоСтрокойЗапросаВСоставеУслуг(ТекДанные.ИдентификаторСтроки);
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
		ЭТС = ""; 
		ЭтоПервый = Истина;
		Для Каждого Стр из СписокАктуальныхКТК Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр.УчетнаяЕдиница);
			Если ЭтоПервый тогда 
				ЭтоПервый = Ложь;
				ТекДанные.ТипКТК = Стр.ТипКТК;
				ТекДанные.Автоперевозка = Стр.ПерваяМиля;
				ТекДанные.ПоследняяМиля = Стр.ПоследняяМиля;
			КонецЕсли;
			СтруктураПоиска = Новый Структура("НомерКТК", Стр.УчетнаяЕдиница);
			СтрокиДляЗаполненияРелиза = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаДляЗаполненияРелиза Из СтрокиДляЗаполненияРелиза Цикл 
				Если СтрокаДляЗаполненияРелиза.Релиз <> ТекДанные.РелизКлиента Тогда
					СтрокаДляЗаполненияРелиза.Релиз = ТекДанные.РелизКлиента;
				КонецЕсли;
		КонецЦикла;
		КонецЦикла;
		ТекДанные.СписокКТК = ЭТС;
		ТекДанные.КоличествоКТК = СписокАктуальныхКТК.Количество();
		Если Не ЗначениеЗаполнено(ТекДанные.ИдентификаторСтроки) Тогда
			ТекДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024  
		МассивКТКПоСтроке = ПолучитьСписокКткИзЗапросаКТКПоПереданнойСтроке(ТекДанные.НомерСтроки);
		УказатьВСтрокахУслугГУИДСтрокиЗапросаНаКТК(ТекДанные.ИдентификаторСтроки,МассивКТКПоСтроке);
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
	КонецЕсли;
 
	Если НеобходимПеренос и СписокКТКДляПереноса.Количество()> 0 Тогда
		Для Каждого ПереносимыйКтк Из СписокКТКДляПереноса Цикл
			СтруктураПоиска = Новый Структура("НомерКТК", ПереносимыйКтк);
			СтрокиДляОчистикиРелиза = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаДляОчистки Из СтрокиДляОчистикиРелиза Цикл
				СтрокаДляОчистки.Релиз = Неопределено;
			КонецЦикла; 
		КонецЦикла;	
		ФормированиеСтрокЗапросаКТК(СписокКТКДляПереноса);
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура СоставУслугиПоследняяМиляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.ЗапросНаКТК Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
		ПроверитьИзменениеВариантаАвтоперевозки(, Истина, ВыбранноеЗначение, ТекДанные, СтандартнаяОбработка)
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьИзменениеВариантаАвтоперевозки(ПерваяМиля = Неопределено, ПоследняяМиля  = Неопределено, ВыбранноеЗначение, ТекущиеДанные, СтандартнаяОбработка)
	
	ДанныеПоКТКИзЗапроса = ПолучитьСоставСтрокиЗапросаПоКТК(ТекущиеДанные.НомерКТК);	
	Если ДанныеПоКТКИзЗапроса <> Неопределено Тогда 
		
		Если ВыбранноеЗначение <> ?(ПерваяМиля <> Неопределено, ДанныеПоКТКИзЗапроса.ПерваяМиля, ДанныеПоКТКИзЗапроса.ПоследняяМиля)
			и ДанныеПоКТКИзЗапроса.КолвоКТК > 1 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеСтрокЗапросаКТК", ЭтаФорма, Новый Структура("ПерваяМиля, ПоследняяМиля, СтароеЗначение, ВыбранноеЗначение, МассивКТК, ГуидСтроки",
			ПерваяМиля, ПоследняяМиля,ТекущиеДанные, ВыбранноеЗначение, ДанныеПоКТКИзЗапроса.МассивКТК, ДанныеПоКТКИзЗапроса.ИдентификаторСтроки));
			
			ПоказатьВопрос(ОписаниеОповещения, "Значение перевозки по данной строке уже было перенесено в Запрос на КТК и сгруппировано с другими строками из Услуг. Хотите изменить все связанные строки?"
			, РежимДиалогаВопрос.ДаНет); 
		КонецЕсли;
	Иначе 
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
 КонецПроцедуры

 &НаКлиенте
Процедура СоставУслугиПерваяМиляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.ЗапросНаКТК Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
		ПроверитьИзменениеВариантаАвтоперевозки(Истина,,ВыбранноеЗначение, ТекДанные, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры 

//Функции по работе с контейнерами
&НаСервере
Процедура ФормированиеСтрокЗапросаКТК(СписокКТК = Неопределено, ДополнитьСтроки = Ложь) 

	РезультатЗапроса = Документы.Заявка.ПолучитьКткДляРаспределенияВЗапросНаКТК(Объект.СоставУслуги.Выгрузить(), СписокКТК);

	ВыборкаТипКТК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ТипКТК");	
	Пока ВыборкаТипКТК.Следующий() Цикл 
		ВыборкаПерваяМиля =  ВыборкаТипКТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПерваяМиля");
		Пока ВыборкаПерваяМиля.Следующий() Цикл
			ВыборкаПоследняяМиля =  ВыборкаПерваяМиля.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПоследняяМиля");
			Пока ВыборкаПоследняяМиля.Следующий() Цикл
				ВыборкаКтк = ВыборкаПоследняяМиля.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерКТК");
				ПереченьКТК = Новый Массив;
				Пока ВыборкаКтк.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаКтк.НомерКТК) тогда
						ПереченьКТК.Добавить(ВыборкаКтк.НомерКТК);
					КонецЕсли;
				КонецЦикла;
				Если ДополнитьСтроки Тогда
					СтруктураПоискаНужнойСтроки = Новый Структура("ТипКТК,Автоперевозка,ПоследняяМиля",
					ВыборкаТипКТК.ТипКТК,ВыборкаПерваяМиля.ПерваяМиля,ВыборкаПоследняяМиля.ПоследняяМиля);
					ПодходящиеСтроки = Объект.СписокЗапросНаКТК.НайтиСтроки(СтруктураПоискаНужнойСтроки);
					Если ПодходящиеСтроки.Количество() >0 Тогда
						Для Каждого ПодходящаяСтрока Из ПодходящиеСтроки Цикл
							ПодходящаяСтрока.СписокКТК = ПодходящаяСтрока.СписокКТК + ";" + СтрСоединить(ПереченьКТК,";");		
							ПодходящаяСтрока.КоличествоКТК = ПодходящаяСтрока.КоличествоКТК + ПереченьКТК.Количество();
						КонецЦикла;
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
						УказатьВСтрокахУслугГУИДСтрокиЗапросаНаКТК(ПодходящаяСтрока[0].ИдентификаторСтроки,ПереченьКТК);
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
					Иначе
						ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Подходящей строки для добавления контенейров с признаками: Тип КТК:  %1, Первая Миля: %2, Последняя Миля: %3 не найдено, был добавлен новый запрос на ктк",
							 ВыборкаТипКТК.ТипКТК,
							 ?(ЗначениеЗаполнено(ВыборкаПоследняяМиля.ПерваяМиля),ВыборкаПоследняяМиля.ПерваяМиля,"(Не указан)"),
							 ?(ЗначениеЗаполнено(ВыборкаПоследняяМиля.ПоследняяМиля),ВыборкаПоследняяМиля.ПоследняяМиля,"(Не указан)")));				
						СтрокаЗапросаКтк = Объект.СписокЗапросНаКТК.Добавить();
						СтрокаЗапросаКтк.СписокКТК = СтрСоединить(ПереченьКТК,";");
						СтрокаЗапросаКтк.КоличествоКТК = ПереченьКТК.Количество();
						СтрокаЗапросаКтк.ТипКТК = ВыборкаТипКТК.ТипКТК;
						СтрокаЗапросаКтк.Автоперевозка = ВыборкаПерваяМиля.ПерваяМиля;
						СтрокаЗапросаКтк.ПоследняяМиля = ВыборкаПоследняяМиля.ПоследняяМиля;			
						Если Не ЗначениеЗаполнено(СтрокаЗапросаКтк.ИдентификаторСтроки) Тогда
							СтрокаЗапросаКтк.ИдентификаторСтроки = Новый УникальныйИдентификатор;
						КонецЕсли;	
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
						УказатьВСтрокахУслугГУИДСтрокиЗапросаНаКТК(СтрокаЗапросаКтк.ИдентификаторСтроки,ПереченьКТК);
						// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
					КонецЕсли;
				Иначе
					СтрокаЗапросаКтк = Объект.СписокЗапросНаКТК.Добавить();
					СтрокаЗапросаКтк.СписокКТК = СтрСоединить(ПереченьКТК,";");
					СтрокаЗапросаКтк.КоличествоКТК = ПереченьКТК.Количество();
					СтрокаЗапросаКтк.ТипКТК = ВыборкаТипКТК.ТипКТК;
					СтрокаЗапросаКтк.Автоперевозка = ВыборкаПерваяМиля.ПерваяМиля;
					СтрокаЗапросаКтк.ПоследняяМиля = ВыборкаПоследняяМиля.ПоследняяМиля;			
					Если Не ЗначениеЗаполнено(СтрокаЗапросаКтк.ИдентификаторСтроки) Тогда
						СтрокаЗапросаКтк.ИдентификаторСтроки = Новый УникальныйИдентификатор;
					КонецЕсли;   
					// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 21.03.2024
					УказатьВСтрокахУслугГУИДСтрокиЗапросаНаКТК(СтрокаЗапросаКтк.ИдентификаторСтроки,ПереченьКТК);
					// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 21.03.2024
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// ДИТ BUG 82599 ТА 82600 Сержантова А.С. 21.03.2024   
&НаСервере
Процедура УказатьВСтрокахУслугГУИДСтрокиЗапросаНаКТК(ИдентификаторСтрокиЗапроса, ПереченьКТК)
	
	Для каждого КТКизПеречня Из ПереченьКТК Цикл
		СтруктураПоиска = Новый Структура("ПринадлежностьТЕ,Релиз,ПеренесенВЗаявку,НомерКТК", 
				Перечисления.ПринадлежностьТЕ.КТЕвросиба, Неопределено, Документы.Заявка.ПустаяСсылка(), КТКизПеречня);
		СписокКТКДляПроверкиРаспределенияНеопределено = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоиска = Новый Структура("ПринадлежностьТЕ,Релиз,ПеренесенВЗаявку,НомерКТК", 
				Перечисления.ПринадлежностьТЕ.КТЕвросиба, Документы.РелизКлиента.ПустаяСсылка(), Документы.Заявка.ПустаяСсылка(), КТКизПеречня);
		СписокКТКДляПроверкиРаспределенияПустаяСсылка = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска); 	
		
		Для каждого СтрокаСписка Из СписокКТКДляПроверкиРаспределенияНеопределено Цикл
			СтрокаСписка.ИдентификаторСтрокиЗапросаНаКТК = ИдентификаторСтрокиЗапроса; 
		КонецЦикла; 
		
		Для каждого СтрокаСписка Из СписокКТКДляПроверкиРаспределенияПустаяСсылка Цикл
			СтрокаСписка.ИдентификаторСтрокиЗапросаНаКТК = ИдентификаторСтрокиЗапроса; 
		КонецЦикла;
	КонецЦикла;	

КонецПроцедуры

//позволяет получить список ктк по контейнерам по строкам кроме переданной
Функция ПолучитьСписокКткИзЗапросаКТКПоОстальнымСтрокам(НомерТекущейСтроки) 
	
	Контейнеры = Объект.СписокЗапросНаКТК.Выгрузить(,"СписокКТК, НомерСтроки");
	МассивКонтейнеров = Новый Массив;
	Для Каждого СтрокаКТК Из Контейнеры Цикл
		Если СтрокаКТК.НомерСтроки = НомерТекущейСтроки тогда
			Продолжить;
		Иначе	
			МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаКТК.СписокКТК), ";", Ложь);
			Для Каждого Стр из МассивТЕ Цикл
				Если ТипЗнч(Стр) = Тип("Строка") Тогда
					МассивКонтейнеров.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(Стр)); 
				Иначе
					МассивКонтейнеров.Добавить(Стр);
				КонецЕсли;			
			КонецЦикла
		КонецЕсли;
	КонецЦикла;
	Возврат МассивКонтейнеров
	
КонецФункции  

// ДИТ BUG 82599 ТА 82600 Сержантова А.С. 21.03.2024   
//позволяет получить список ктк по контейнерам по переданной строке запроса на ктк
Функция ПолучитьСписокКткИзЗапросаКТКПоПереданнойСтроке(НомерТекущейСтроки) 
	
	Контейнеры = Объект.СписокЗапросНаКТК.Выгрузить(,"СписокКТК, НомерСтроки");
	МассивКонтейнеров = Новый Массив;
	Для Каждого СтрокаКТК Из Контейнеры Цикл
		Если СтрокаКТК.НомерСтроки <> НомерТекущейСтроки тогда
			Продолжить;
		Иначе	
			МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаКТК.СписокКТК), ";", Ложь);
			Для Каждого Стр из МассивТЕ Цикл
				Если ТипЗнч(Стр) = Тип("Строка") Тогда
					МассивКонтейнеров.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(Стр)); 
				Иначе
					МассивКонтейнеров.Добавить(Стр);
				КонецЕсли;			
			КонецЦикла
		КонецЕсли;
	КонецЦикла;
	Возврат МассивКонтейнеров
	
КонецФункции

// позволяет получить список ктк в строке запроса на ктк содержащей переданный КТК
Функция ПолучитьСоставСтрокиЗапросаПоКТК(НомерКТК) 
	
	СтрокиЗапросаКТК = Объект.СписокЗапросНаКТК.Выгрузить();	
	
	Для Каждого СтрокаЗапроса Из СтрокиЗапросаКТК Цикл
		МассивКтк = Новый Массив();
		МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаЗапроса.СписокКТК), ";", Ложь);
		
		Для Каждого ЭлемМассива Из МассивТЕ Цикл
			Если ТипЗнч(ЭлемМассива) = Тип("Строка") Тогда
				МассивКтк.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(ЭлемМассива)); 
			Иначе
				МассивКтк.Добавить(ЭлемМассива);
			КонецЕсли;
		КонецЦикла;	
		
		КолвоКТКвСтрокеЗапроса = МассивТЕ.Количество(); 
		РезПоиска = МассивКтк.Найти(НомерКТК);
		Если РезПоиска <> Неопределено Тогда 
			Возврат Новый Структура("КТК, ПерваяМиля, ПоследняяМиля, ИдентификаторСтроки, КолвоКТК, МассивКТК, РелизКлиента",
			НомерКТК, СтрокаЗапроса.Автоперевозка, СтрокаЗапроса.ПоследняяМиля, СтрокаЗапроса.ИдентификаторСтроки, КолвоКТКвСтрокеЗапроса, МассивКтк, СтрокаЗапроса.РелизКлиента);	
		КонецЕсли;
	КонецЦикла;
	
    Возврат Неопределено

КонецФункции	

&НаКлиенте
Процедура ИзменениеСтрокЗапросаКТК(ОтветПользователя = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда 
		ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
		
		Если ДопПараметры.ПерваяМиля <> Неопределено Тогда 
			 ТекДанные.ПерваяМиля = ДопПараметры.СтароеЗначение.ПерваяМиля;
		ИначеЕсли ДопПараметры.ПоследняяМиля <> Неопределено Тогда 
			 ТекДанные.ПоследняяМиля = ДопПараметры.СтароеЗначение.ПоследняяМиля;
		 КонецЕсли;
		 Возврат		
	КонецЕсли;
	
	Если ДопПараметры.ПерваяМиля <> Неопределено тогда 
		СтруктураПоискаВЗапросе =  Новый Структура("ИдентификаторСтроки", ДопПараметры.ГуидСтроки);
		НайденныеСтроки = Объект.СписокЗапросНаКТК.НайтиСтроки(СтруктураПоискаВЗапросе);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Автоперевозка = ДопПараметры.ВыбранноеЗначение;
		КонецЦикла;	
		Для Каждого КТК Из ДопПараметры.МассивКТК Цикл 
			СтруктураПоискаВУслугах =  Новый Структура("НомерКТК", КТК);
			НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(СтруктураПоискаВУслугах);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ПерваяМиля = ДопПараметры.ВыбранноеЗначение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если ДопПараметры.ПоследняяМиля <> Неопределено тогда 
		СтруктураПоискаВЗапросе =  Новый Структура("ИдентификаторСтроки", ДопПараметры.ГуидСтроки);
		НайденныеСтроки = Объект.СписокЗапросНаКТК.НайтиСтроки(СтруктураПоискаВЗапросе);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ПоследняяМиля = ДопПараметры.ВыбранноеЗначение;
		КонецЦикла;	
		Для Каждого КТК Из ДопПараметры.МассивКТК Цикл 
			СтруктураПоискаВУслугах =  Новый Структура("НомерКТК", КТК);
			НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(СтруктураПоискаВУслугах);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ПоследняяМиля = ДопПараметры.ВыбранноеЗначение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьКТКИзЗапросаКТК(ТекСтрока, Удаление = Ложь)
	
	Если Объект.ЗапросНаКТК Тогда
		ИзменяемыйКТК = ТекСтрока.НомерКТК;
		Если ТекСтрока.ПринадлежностьТЕ <> ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба") Или Удаление Тогда
			ДанныеПоЗапросу = ПолучитьСоставСтрокиЗапросаПоКТК(ИзменяемыйКТК);
			Если НЕ ДанныеПоЗапросу = Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(ДанныеПоЗапросу.РелизКлиента) Тогда
					ГуидСтрокиЗапроса = ДанныеПоЗапросу.ИдентификаторСтроки; 
					ДанныеПоЗапросу.МассивКТК.Удалить(ДанныеПоЗапросу.МассивКТК.Найти(ИзменяемыйКТК));
					СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ГуидСтрокиЗапроса);
					МеняемаяСтрокаЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(СтруктураПоиска);
					Для Каждого СтрокаЗапроса из МеняемаяСтрокаЗапроса Цикл
						ЭТС = ""; // Элементы текущей строки
						Для Каждого Стр из ДанныеПоЗапросу.МассивКТК Цикл
							ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
						КонецЦикла;				
						СтрокаЗапроса.СписокКТК = ЭТС;
						СтрокаЗапроса.КоличествоКТК = ДанныеПоЗапросу.МассивКТК.Количество(); 
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ОбработкаПроверкиРаспределенияКТК()
	
	Если Объект.ЗапросНаКТК Тогда 
	МассивыКТК = ПолучитьСпискиКонтейнеров();		
		НераспределенныеКТК = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивыКТК.КткУслуг, МассивыКТК.КткИзЗапросаНаКТК);
		Если НераспределенныеКТК.Количество() <> 0 тогда
			Возврат	НераспределенныеКТК			
		КонецЕсли;	
	КонецЕсли;
	Возврат Неопределено
	
КонецФункции

&НаКлиенте
Функция ЗадатьВопросПользователю(РезультатПроверки)
	
	СписокКнопок = Новый СписокЗначений;
    СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Разнести автоматически");
    СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Создать новые запросы на ктк");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтаФорма, Новый Структура("НераспределенныеКТК", РезультатПроверки));
    ПоказатьВопрос(ОпОп,"В Документе есть не разнесенные по запросам на ктк контейнеры из услуг.
									|Выберите способ разнесения", СписокКнопок, 20, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Отмена);
	
КонецФункции

Функция ПолучитьСпискиКонтейнеров()
	
	СтруктураПоиска = Новый Структура("ПринадлежностьТЕ, Релиз, ПеренесенВЗаявку", Перечисления.ПринадлежностьТЕ.КТЕвросиба, Неопределено, Документы.Заявка.ПустаяСсылка());
	СписокКТКДляПроверкиРаспределенияНеопределено = Объект.СоставУслуги.Выгрузить(СтруктураПоиска,"НомерКТК");
	
	СтруктураПоиска = Новый Структура("ПринадлежностьТЕ, Релиз, ПеренесенВЗаявку", Перечисления.ПринадлежностьТЕ.КТЕвросиба, Документы.РелизКлиента.ПустаяСсылка(), Документы.Заявка.ПустаяСсылка());
	СписокКТКДляПроверкиРаспределенияПустаяСсылка = Объект.СоставУслуги.Выгрузить(СтруктураПоиска,"НомерКТК"); 	

	
	МассивКткУслуг = Новый Массив;
	Для Каждого СтрокаМассива Из СписокКТКДляПроверкиРаспределенияНеопределено Цикл
		Если ЗначениеЗаполнено(СтрокаМассива.НомерКТК) Тогда
			МассивКткУслуг.Добавить(СтрокаМассива.НомерКТК);
		КонецЕсли;
	КонецЦикла; 	
	Для Каждого СтрокаМассива Из СписокКТКДляПроверкиРаспределенияПустаяСсылка Цикл
		Если ЗначениеЗаполнено(СтрокаМассива.НомерКТК) Тогда
			МассивКткУслуг.Добавить(СтрокаМассива.НомерКТК);
		КонецЕсли;
	КонецЦикла;
		
	КонтейнерыИзЗапроса = Объект.СписокЗапросНаКТК.Выгрузить(,"СписокКТК");	
	МассивКонтейнеров = Новый Массив;
	Для Каждого СтрокаКТК Из КонтейнерыИзЗапроса Цикл
		МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаКТК.СписокКТК), ";", Ложь);
		Для Каждого Стр из МассивТЕ Цикл
			Если ТипЗнч(Стр) = Тип("Строка") Тогда
				МассивКонтейнеров.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(Стр)); 
			Иначе
				МассивКонтейнеров.Добавить(Стр);
			КонецЕсли;			
		КонецЦикла
	КонецЦикла;
	
	Возврат Новый Структура("КткУслуг, КткИзЗапросаНаКТК", МассивКткУслуг, МассивКонтейнеров) 
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаПользователя(ОтветПользователя = Неопределено, ДопПараметры = Неопределено)Экспорт 
	
	Если ОтветПользователя = Неопределено Тогда Возврат; КонецЕсли;
	
	НераспределенныеКТК = ДопПараметры.НераспределенныеКТК;
	
	Если ОтветПользователя = КодВозвратаДиалога.Таймаут Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Вариант распределения ктк не был выбран.");				
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		МассивыКТК = ПолучитьСпискиКонтейнеров();
		ФормированиеСтрокЗапросаКТК(НераспределенныеКТК, Ложь);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нераспределенные ктк были разнесены в новые строки запроса на ктк автоматически. Проверьте заполнение обязательных реквизитов.");
		ЭтаФорма.Модифицированность = Истина;
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Да Тогда
		МассивыКТК = ПолучитьСпискиКонтейнеров();
		ФормированиеСтрокЗапросаКТК(НераспределенныеКТК, Истина);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нераспределенные ктк были добавлены в существующие строки запроса на ктк автоматически. Проверьте заполнение обязательных реквизитов.");
		ЭтаФорма.Модифицированность = Истина;
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Отмена Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Действие отменено. Контейнеры не были распределены по запросам на ктк.");				
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОтветаПользователяПоЗаполнениюЗапроса(ОтветПользователя = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОтветПользователя = Неопределено Тогда Возврат; КонецЕсли; 
	Если ОтветПользователя = КодВозвратаДиалога.ОК Тогда 
		Объект.СписокЗапросНаКТК.Очистить();
		ФормированиеСтрокЗапросаКТК();
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Отмена Тогда
		Объект.ЗапросНаКТК = Не Объект.ЗапросНаКТК;
			НастроитьВидимостьВкладкиЗапросНаКТК();
		    НастроитьВидимостьКомандЗаполнения(); 
	КонецЕсли;	
		
КонецПроцедуры	
//Субботин 77659 24.11.2023 Конец 

//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -конец        

// ДИТ US 78234 ТА 78241 Сержантова А.С. 12.12.2023
&НаКлиенте
Процедура СоставУслугиПриАктивизацииЯчейки(Элемент)
	ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;    
	
	// Если груз в строке Сборная контейнерная отправка, то вес и кол-во мест заполняем из ТЧ детализация по грузу,
	//в строках услуг заполнение не доступно. 
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.Груз <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
			Элементы.СоставУслугиВесГрузаНетто.Доступность = Истина;
			Элементы.СоставУслугиКоличествоМест.Доступность = Истина;
		Иначе
			Элементы.СоставУслугиВесГрузаНетто.Доступность = Ложь;
			Элементы.СоставУслугиКоличествоМест.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// ДИТ US 78234 ТА 78241 Сержантова А.С. 12.12.2023
&НаКлиенте
Процедура СоставУслугиВесГрузаНеттоПриИзменении(Элемент)
	мТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	НайтиКлючАналитикиПеревозкиКлиент(мТекущиеДанные);
КонецПроцедуры

// ДИТ US 78234 ТА 78241 Сержантова А.С. 12.12.2023
&НаКлиенте
Процедура СоставУслугиКоличествоМестПриИзменении(Элемент)
	мТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	НайтиКлючАналитикиПеревозкиКлиент(мТекущиеДанные);	
КонецПроцедуры

// ДИТ US 76935 ТА 78649 Сержантова А.С. 26.12.2023  
&НаСервере
Функция ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки() 
	
	ДанныеОбновленияКлючейАналитики = Новый ТаблицаЗначений;   
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("КлючАналитикиПеревозки", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПеревозки"));  
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("ДанныеКлюча");   
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("Груз"); 
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("ИсточникКлюча");
	
	Для каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
		
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаТЧ.КлючАналитикиПеревозки; 
		СтруктураКлючаАналитикиПеревозки.Контейнер = СтрокаТЧ.НомерКТК;
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 22.01.2024 
		СтрокиВАвтоперевозке = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));
		Если не ЗначениеЗаполнено(СтруктураКлючаАналитикиПеревозки.Контейнер) и СтрокиВАвтоперевозке.Количество() > 0 Тогда
			СтруктураКлючаАналитикиПеревозки.Контейнер = СтрокиВАвтоперевозке[0].Контейнер;		
		КонецЕсли; 
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 22.01.2024
		СтруктураКлючаАналитикиПеревозки.Заявка = Объект.Ссылка;
		СтруктураКлючаАналитикиПеревозки.Груз = СтрокаТЧ.Груз; 
		СтруктураКлючаАналитикиПеревозки.ИнструкцияПоСдаче = СтрокаТЧ.ИнструкцииПоСдачеПорожнего;  
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023
		СтруктураКлючаАналитикиПеревозки.КоличествоМест = СтрокаТЧ.КоличествоМест; 
		СтруктураКлючаАналитикиПеревозки.ВесГруза = СтрокаТЧ.ВесГрузаНетто;
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
		
		мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу",Тип("ТаблицаЗначений"));
		ТЗДетализацияПоГрузу = мДетализацияПоГрузу.СкопироватьКолонки();
		МассивСтрок = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",СтрокаТЧ.КлючАналитикиПеревозки));
		Для Каждого СтрМассивСтрок Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(ТЗДетализацияПоГрузу.Добавить(),СтрМассивСтрок);
		КонецЦикла;
		
		СтруктураКлючаАналитикиПеревозки.ИзменятьТЧДетализацияПоГрузу = Истина;
		СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу = ТЗДетализацияПоГрузу;

		МилиКлючаПервая = Новый Структура;
		МилиКлючаПервая.Вставить("ДатаВыдачиКТКСТерминала", СтрокаТЧ.ДатаВыдачи);
		//МилиКлючаПервая.Вставить("ДатаСдачиКТКНаТерминал", СтрокаТЧ.ДатаВозвратаКлиентом); 
		МилиКлючаПервая.Вставить("ДатаВыездаКТКСоСклада", СтрокаТЧ.ДатаПодачиАвтоПодПогрузку);
		МилиКлючаПервая.Вставить("ФИОВодителя", СтрокаТЧ.ФИОВодителя);
		МилиКлючаПервая.Вставить("РегНомерТС", СтрокаТЧ.НомерАвто); 
		МилиКлючаПервая.Вставить("Автоперевозчик", СтрокаТЧ.АвтоперевозчикПерваяМиля);
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024 US 79379 ТА 80813
		//МилиКлючаПервая.Вставить("ПаспортныеДанные", "");
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024
		Если ЗначениеЗаполнено(СтрокаТЧ.АвтоперевозчикПерваяМиля) 
			и ТипЗнч(СтрокаТЧ.АвтоперевозчикПерваяМиля) = Тип("СправочникСсылка.Контрагенты") Тогда
			МилиКлючаПервая.Вставить("ИНН",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоперевозчикПерваяМиля,"ИНН"));
			МилиКлючаПервая.Вставить("КПП",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоперевозчикПерваяМиля,"КПП"));  
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024
		Иначе
			МилиКлючаПервая.Вставить("ИНН", "");
			МилиКлючаПервая.Вставить("КПП", "");
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024	
		КонецЕсли;   
		ЗаполнитьСтруктуруМилиКлючаИзЗапросаНаКТК(СтрокаТЧ.КлючАналитикиПеревозки, МилиКлючаПервая, Объект.ТранспортныеСредства);
		
		МилиКлючаПоследняя = Новый Структура;
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Начало: 19.12.2024 
		//МилиКлючаПоследняя.Вставить("ДатаСдачиКТКНаТерминал", СтрокаТЧ.ДатаВозвратаКлиентом);
		Если не РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(СтруктураКлючаАналитикиПеревозки.Контейнер, Объект.Ссылка) Тогда
			МилиКлючаПоследняя.Вставить("ДатаСдачиКТКНаТерминал", СтрокаТЧ.ДатаВозвратаКлиентом);
		КонецЕсли;
		// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Конец: 19.12.2024 
		// ДИТ Ticket#0339024 Сержантова А.С. Начало: 22.01.2024
		МилиКлючаПоследняя.Вставить("ДатаВыездаКТКСоСклада", СтрокаТЧ.ДатаПодачиАвтоПодВыгрузку); 
		// ДИТ Ticket#0339024 Сержантова А.С. Конец: 22.01.2024
		МилиКлючаПоследняя.Вставить("ФИОВодителя", СтрокаТЧ.ФИОВодителяВыгрузка);
		МилиКлючаПоследняя.Вставить("РегНомерТС", СтрокаТЧ.НомерАвтоВыгрузка); 
		МилиКлючаПоследняя.Вставить("Автоперевозчик", СтрокаТЧ.АвтоПеревозчик); 
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024 US 79379 ТА 80813
		//МилиКлючаПоследняя.Вставить("ПаспортныеДанные", "");
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024
		Если ЗначениеЗаполнено(СтрокаТЧ.АвтоПеревозчик) 
			и ТипЗнч(СтрокаТЧ.АвтоПеревозчик) = Тип("СправочникСсылка.Контрагенты")Тогда
			МилиКлючаПоследняя.Вставить("ИНН",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоПеревозчик,"ИНН"));
			МилиКлючаПоследняя.Вставить("КПП",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоПеревозчик,"КПП"));
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 25.01.2024
		Иначе
			МилиКлючаПоследняя.Вставить("ИНН", "");
			МилиКлючаПоследняя.Вставить("КПП", "");
		// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 25.01.2024
		КонецЕсли;    
		ЗаполнитьСтруктуруМилиКлючаИзЗапросаНаКТК(СтрокаТЧ.КлючАналитикиПеревозки, МилиКлючаПоследняя, Объект.ТранспортныеСредстваПоследняяМиля);
		
		ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики, МилиКлючаПервая);
		ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики, МилиКлючаПоследняя);  
		
		НС = ДанныеОбновленияКлючейАналитики.Добавить(); 
		НС.НомерСтроки 				= СтрокаТЧ.НомерСтроки;
		НС.КлючАналитикиПеревозки 	= СтрокаТЧ.КлючАналитикиПеревозки;  
		НС.Контейнер 				= СтрокаТЧ.НомерКТК;
		НС.ДанныеКлюча 				= СтруктураКлючаАналитикиПеревозки;     
		НС.Груз 					= СтрокаТЧ.Груз;
		НС.ИсточникКлюча 			= "СоставУслуги";
	КонецЦикла;     
	
	//Для записи ключа, если его нет в Услугах
	Для каждого СтрокаТЧ Из Объект.ТранспортныеСредства Цикл  
		СтрокиВУслугах = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));
		Если СтрокиВУслугах.Количество() = 0 Тогда   
			
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлючаАналитикиПеревозки.Заявка = Объект.Ссылка; 
			// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024
			СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаТЧ.КлючАналитикиПеревозки; 
			// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
			
			МилиКлючаПервая = Новый Структура;
			МилиКлючаПервая.Вставить("ФИОВодителя", СтрокаТЧ.ФИОВодителя);
			МилиКлючаПервая.Вставить("РегНомерТС", СтрокаТЧ.РегНомерТС); 
			МилиКлючаПервая.Вставить("Автоперевозчик", СтрокаТЧ.Автоперевозчик);
			МилиКлючаПервая.Вставить("ПаспортныеДанные", СтрокаТЧ.ПаспортныеДанные);
			МилиКлючаПервая.Вставить("ИНН", СтрокаТЧ.ИНН);
			МилиКлючаПервая.Вставить("КПП", СтрокаТЧ.КПП); 
			ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики, МилиКлючаПервая); 
			
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024 
			//если ключа нет в услугах и нет в таблице по последней миле, то очищаем данные по последней миле
			СтрокиВПоследнейМиле = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));
			Если СтрокиВПоследнейМиле.Количество() = 0 Тогда 
				МилиКлючаПоследняя = Новый Структура("ФИОВодителя, РегНомерТС, Автоперевозчик, ПаспортныеДанные, ИНН, КПП","","","","","","");
				ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики, МилиКлючаПоследняя);
			КонецЕсли;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024

			// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024  
			СтрокаЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтрокиЗапроса));   
			ВариантАвтоперевозки = Перечисления.ВариантыАвтоперевозки.НеТребуется;
			Если СтрокаЗапроса.Количество() = 1 Тогда
				ВариантАвтоперевозки = СтрокаЗапроса[0].Автоперевозка;
				НомерСтрокиЗапроса = СтрокаЗапроса[0].НомерСтроки; 
			КонецЕсли;
			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.Вставить("ВариантАвтоперевозки", ВариантАвтоперевозки); 
			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.Вставить("НомерСтрокиЗапроса", НомерСтрокиЗапроса);
			// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
			
			НС = ДанныеОбновленияКлючейАналитики.Добавить(); 
			НС.НомерСтроки 				= СтрокаТЧ.НомерСтроки;
			НС.КлючАналитикиПеревозки 	= СтрокаТЧ.КлючАналитикиПеревозки;  
			НС.ДанныеКлюча 				= СтруктураКлючаАналитикиПеревозки;
			НС.ИсточникКлюча 			= "ТранспортныеСредства";
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.ТранспортныеСредстваПоследняяМиля Цикл  
		СтрокиВУслугах = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));
		Если СтрокиВУслугах.Количество() = 0 Тогда   
			
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
			СтруктураКлючаАналитикиПеревозки.Заявка = Объект.Ссылка;    
			// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024
			СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаТЧ.КлючАналитикиПеревозки; 
			СтруктураКлючаАналитикиПеревозки.Контейнер = СтрокаТЧ.Контейнер;    
			// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
			
			МилиКлючаПервая = Новый Структура;
			МилиКлючаПервая.Вставить("ФИОВодителя", СтрокаТЧ.ФИОВодителя);
			МилиКлючаПервая.Вставить("РегНомерТС", СтрокаТЧ.РегНомерТС); 
			МилиКлючаПервая.Вставить("Автоперевозчик", СтрокаТЧ.Автоперевозчик);
			МилиКлючаПервая.Вставить("ПаспортныеДанные", СтрокаТЧ.ПаспортныеДанные);
			МилиКлючаПервая.Вставить("ИНН", СтрокаТЧ.ИНН);
			МилиКлючаПервая.Вставить("КПП", СтрокаТЧ.КПП); 
			ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики, МилиКлючаПервая);
			
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 20.02.2024 
			//если ключа нет в услугах и нет в таблице по первой миле, то очищаем данные по первой миле
			СтрокиВПервойМиле = Объект.ТранспортныеСредства.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));
			Если СтрокиВПервойМиле.Количество() = 0 Тогда 
				МилиКлючаПервая = Новый Структура("ФИОВодителя, РегНомерТС, Автоперевозчик, ПаспортныеДанные, ИНН, КПП","","","","","","");
				ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики, МилиКлючаПервая);
			КонецЕсли;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 20.02.2024
			
			// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024
			СтрокаЗапроса = Объект.СписокЗапросНаКТК.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтрокиЗапроса));   
			ВариантАвтоперевозки = Перечисления.ВариантыАвтоперевозки.НеТребуется;
			Если СтрокаЗапроса.Количество() = 1 Тогда
				ВариантАвтоперевозки = СтрокаЗапроса[0].ПоследняяМиля; 
				НомерСтрокиЗапроса = СтрокаЗапроса[0].НомерСтроки;
			КонецЕсли;
			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Вставить("ВариантАвтоперевозки", ВариантАвтоперевозки);	
			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Вставить("НомерСтрокиЗапроса", НомерСтрокиЗапроса);
			// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
			
			НС = ДанныеОбновленияКлючейАналитики.Добавить(); 
			НС.НомерСтроки 				= СтрокаТЧ.НомерСтроки;
			НС.КлючАналитикиПеревозки 	= СтрокаТЧ.КлючАналитикиПеревозки;  
			НС.ДанныеКлюча 				= СтруктураКлючаАналитикиПеревозки;
			НС.ИсточникКлюча 			= "ТранспортныеСредстваПоследняяМиля";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеОбновленияКлючейАналитики;
	
КонецФункции  

// ДИТ US 76935 ТА 78649 Сержантова А.С. 26.12.2023 
//Если на вкладке Состав услуг данные не заполнены, возьмем со вкладки Запрос на КТК
&НаСервере
Процедура ЗаполнитьСтруктуруМилиКлючаИзЗапросаНаКТК(КлючАналитикиПеревозки, СтруктураКлюча, ТЧИсточникЗаполнения)

	Если ТЧИсточникЗаполнения.Количество() = 0 или не Объект.ЗапросНаКТК Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
	ДанныеТранспортныхСредствПоКлючу = ТЧИсточникЗаполнения.НайтиСтроки(Отбор);
	Если ДанныеТранспортныхСредствПоКлючу.Количество() > 0 Тогда
		Для каждого РеквизитКлюча Из СтруктураКлюча Цикл
			ИмяРеквизита = РеквизитКлюча.Ключ; 
			Если не ЗначениеЗаполнено(РеквизитКлюча.Значение) 
				и ТЧИсточникЗаполнения[0].Свойство(ИмяРеквизита) Тогда
				СтруктураКлюча[ИмяРеквизита] = ДанныеТранспортныхСредствПоКлючу[0][ИмяРеквизита]; 
			КонецЕсли;
		КонецЦикла;  
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 25.03.2024
		СтруктураКлюча.Вставить("ПаспортныеДанные", ДанныеТранспортныхСредствПоКлючу[0].ПаспортныеДанные);
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 25.03.2024
	КонецЕсли;
		
КонецПроцедуры 

// ДИТ US 76935 ТА 78649 Сержантова А.С. 26.12.2023  
&НаСервере 
Процедура ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования()
	Для каждого СтрКлюча Из Объект.СоставУслуги Цикл
		ЗаблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	
КонецПроцедуры 

// ДИТ US 76935 ТА 78649 Сержантова А.С. 26.12.2023  
&НаСервере 
Процедура СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования()
	Для каждого СтрКлюча Из Объект.СоставУслуги Цикл
		РазблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	
КонецПроцедуры

// ДИТ US 76935 ТА 78649 Сержантова А.С. 27.12.2023     
&НаСервере
Процедура ПроверитьАктуальностьКлючаАналитики()   
	НужноОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из Объект.СоставУслуги Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			НужноОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	   
	
	Если НужноОбновлениеКлюча Тогда  
		ОбновитьДанныеКлючаНаФорме();
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные");		
	КонецЕсли; 
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 18.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПриАктивизацииЯчейки(Элемент)
	ТекД = Элементы.ТранспортныеСредства.ТекущиеДанные; 
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Если ТипЗнч(ТекД.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.ТранспортныеСредстваИНН.Доступность = Ложь;
		Элементы.ТранспортныеСредстваКПП.Доступность = Ложь;
	Иначе
		Элементы.ТранспортныеСредстваИНН.Доступность = Истина;
		Элементы.ТранспортныеСредстваКПП.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 18.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПриАктивизацииЯчейки(Элемент)
	ТекД = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные; 
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Если ТипЗнч(ТекД.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.ТранспортныеСредстваПоследняяМиляИНН.Доступность = Ложь;
		Элементы.ТранспортныеСредстваПоследняяМиляКПП.Доступность = Ложь;
	Иначе
		Элементы.ТранспортныеСредстваПоследняяМиляИНН.Доступность = Истина;
		Элементы.ТранспортныеСредстваПоследняяМиляКПП.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваАвтоперевозчикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты")
		и ДанныеВыбора = Неопределено Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры  

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляАвтоперевозчикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты")
		и ДанныеВыбора = Неопределено Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваАвтоперевозчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты")
		и ВыбранноеЗначение = Тип("Строка") Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры       

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляАвтоперевозчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты")
		и ВыбранноеЗначение = Тип("Строка") Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваАвтоперевозчикОчистка(Элемент, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляАвтоперевозчикОчистка(Элемент, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ТипЗнч(ТекСтрока.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
	    ТекСтрока.ИНН = "";
		ТекСтрока.КПП = "";
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПередУдалением(Элемент, Отказ)    
	ТекСтрока = Элементы.ТранспортныеСредства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		СтрУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекСтрока.КлючАналитикиПеревозки)); 
		Если СтрУслуг.Количество() > 0 Тогда
			СтрУслуг[0].ФИОВодителя = "";
			СтрУслуг[0].НомерАвто = "";
            СтрУслуг[0].АвтоперевозчикПерваяМиля = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 79844 ТА 79845 Сержантова А.С. 24.01.2024
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.ТранспортныеСредстваПоследняяМиля.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		СтрУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ТекСтрока.КлючАналитикиПеревозки)); 
		Если СтрУслуг.Количество() > 0 Тогда
			СтрУслуг[0].ФИОВодителяВыгрузка = "";
			СтрУслуг[0].НомерАвтоВыгрузка = "";
            СтрУслуг[0].АвтоПеревозчик = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//Субботин 77659 25.01.2024 Начало
&НаСервере 
Функция ПроверитьСвязанныеДокументы()
	
	РефПривязан = Ложь ;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда Возврат РефПривязан КонецЕсли;
	
	СвязанныеДокументы = КритерииОтбора.СвязанныеДокументы.Найти(Объект.Ссылка);
	
	Для Каждого ТекСвязанныйДокумент Из СвязанныеДокументы Цикл
		Если НЕ РефПривязан  Тогда
			Если ТипЗнч(ТекСвязанныйДокумент) = ТИП("ДокументСсылка.РефСцеп") и ТекСвязанныйДокумент.Проведен Тогда
				РефПривязан = Истина;
			КонецЕсли;
		Иначе
			Прервать
		КонецЕсли;		
	КонецЦикла;
	Возврат РефПривязан
	
КонецФункции

Функция НеобходимоПроверитьЗаписиДокумента()
	
Возврат (НЕ ЗначениеЗаполнено(Объект.Ссылка) и НЕ Объект.СоставУслуги.Количество() = 0)
		или (ЗначениеЗаполнено(Объект.Ссылка)
		и Объект.СоставУслуги.Количество() <> Объект.Ссылка.СоставУслуги.Количество())	

КонецФункции

//ДИТ, Беляев СЮ, Ticket#0341163, 08-02-2024, начало
&НаКлиенте
Процедура ОткрытьРелиз(Команда)
	Если Элементы.СоставУслуги.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;                                  
	Релиз = Элементы.СоставУслуги.ТекущиеДанные.Релиз;
	Если Релиз <> Неопределено Тогда
		ПоказатьЗначение(,Релиз);	
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0341163, 08-02-2024, конец     

//Евросиб Коханенко Н.А. 12.02.2024 (( #80981 
Процедура ОбновитьСтоимостьВЗапросахНаАвтоперевозку(ТекущийОбъект);
	Если ЗначениеЗаполнено(ЗапросПерваяМиля) Тогда
		Документы.ЗапросНаАвтоперевозку.ОбновитьСтоимостьВЗапросеНаАвто(ЗапросПерваяМиля, Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗапросПоследняяМиля) Тогда
		Документы.ЗапросНаАвтоперевозку.ОбновитьСтоимостьВЗапросеНаАвто(ЗапросПоследняяМиля, Истина);
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 12.02.2024 )) #80981 

//Субботин 81210 26.02.2024 Начало
&НаКлиенте
Процедура ЗаполнитьНаОснованииУслуг(Команда)
	ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяПоЗаполнениюЗапросаНаОсновеТЧУслуг", ЭтаФорма);
	ПоказатьВопрос(ОпОп,"Запрос на ктк будет дозаполнен на основании ТЧ Услуги",РежимДиалогаВопрос.ОКОтмена);						
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПользователяПоЗаполнениюЗапросаНаОсновеТЧУслуг(ОтветПользователя = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОтветПользователя = Неопределено Тогда Возврат; КонецЕсли; 
	Если ОтветПользователя = КодВозвратаДиалога.ОК Тогда
		НераспределенныеКТК = ОбработкаПроверкиРаспределенияКТК();
		Если НераспределенныеКТК <> Неопределено Тогда 
			ФормированиеСтрокЗапросаКТК(НераспределенныеКТК, Ложь);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нераспределенные ктк были разнесены в новые строки запроса на ктк автоматически. Проверьте заполнение обязательных реквизитов.");
			ЭтаФорма.Модифицированность = Истина;
			НастроитьВидимостьВкладкиЗапросНаКТК();
		КонецЕсли;
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Отмена Тогда
	КонецЕсли;		
КонецПроцедуры	

// ДИТ US 79379 ТА 80813 Сержантова А.С. 05.03.2024      
&НаСервере
Процедура ОбновитьДоступностьПолейКлючаАналитикиПеревозки()

	КлючиВДокументе = Объект.СоставУслуги.Выгрузить(, "КлючАналитикиПеревозки, ПерваяМиля, ПоследняяМиля");
	КлючиАналитикиПеревозкиСервер.НастроитьБлокировкуПолей(Объект, КлючиВДокументе, ИмяФормы, ЭтаФорма, УсловноеОформление);

КонецПроцедуры

// ДИТ US 79379 ТА 80813 Сержантова А.С. 05.03.2024
&НаКлиенте
Процедура СоставУслугиПерваяМиляПриИзменении(Элемент)
	ОбновитьДоступностьПолейКлючаАналитикиПеревозки();
КонецПроцедуры

// ДИТ US 79379 ТА 80813 Сержантова А.С. 05.03.2024
&НаКлиенте
Процедура СоставУслугиПоследняяМиляПриИзменении(Элемент)
	ОбновитьДоступностьПолейКлючаАналитикиПеревозки();
КонецПроцедуры

// ДИТ US 79379 ТА 80813 Сержантова А.С. 07.03.2024 
&НаКлиенте
Функция ПолеКлючаНедоступноДляИзменения(СтрокаТаблицы, ИмяПоля)

	Структура = Новый Структура("ТаблицаБлокировкиПолейКлючаАналитики", Неопределено);
    
    ЗаполнитьЗначенияСвойств(Структура, ЭтаФорма);
    
	Если Структура["ТаблицаБлокировкиПолейКлючаАналитики"] <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки", СтрокаТаблицы.КлючАналитикиПеревозки); 
		СтрокиЗаблокированные = ЭтаФорма.ТаблицаБлокировкиПолейКлючаАналитики.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаКлюча Из СтрокиЗаблокированные Цикл
			НаименованияПолей = СтрРазделить(СтрокаКлюча.НаименованиеПоля, ","); 
			Если НаименованияПолей.Найти(ИмяПоля) <> Неопределено Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла; 
		// если в строке по миле установлен вариант автоперевозки "Не требуется", то все поля по этой миле не доступны для редактирования 
		ПоляПервойМили = СтрРазделить("ФИОВодителя,НомерАвто,АдресПогрузки,ДатаПодачиАвтоПодПогрузку,АвтоперевозчикПерваяМиля", ",");
		ПоляПоследнейМили = СтрРазделить("ФИОВодителяВыгрузка,НомерАвтоВыгрузка,АдресВыгрузки,ДатаПодачиАвтоПодВыгрузку,АвтоПеревозчик", ",");
		Если (ПоляПервойМили.Найти(ИмяПоля) <> Неопределено 
			и СтрокаТаблицы.ПерваяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется"))
			или (ПоляПоследнейМили.Найти(ИмяПоля) <> Неопределено 
			и СтрокаТаблицы.ПоследняяМиля = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется")) Тогда
		    Возврат Истина;
		КонецЕсли;
	КонецЕсли;  
	
	Возврат Ложь;

КонецФункции 

// ДИТ US 79379 ТА 80813 Сержантова А.С. 07.03.2024
&НаСервере
Процедура ЗаполнитьИменаБлокируемыхПолейКлюча()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаБлокировкиПолейКлючаПеревозки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПравилоБлокировки
		|ИЗ
		|	Справочник.ПравилаБлокировкиПолейКлючаПеревозки КАК ПравилаБлокировкиПолейКлючаПеревозки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО ПравилаБлокировкиПолейКлючаПеревозки.ВидОбъекта.ПолноеИмя = ИдентификаторыОбъектовМетаданных.ПолноеИмя
		|ГДЕ
		|	ПравилаБлокировкиПолейКлючаПеревозки.ФормаОбъекта = &ФормаОбъекта
		|	И НЕ ПравилаБлокировкиПолейКлючаПеревозки.ПометкаУдаления
		|	И ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки) = &ТипЗначенияОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаБлокировкиПолейКлючаПеревозкиПравила.РеквизитФормы КАК РеквизитФормы
		|ИЗ
		|	ВТ_ПравилоБлокировки КАК ВТ_ПравилоБлокировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаБлокировкиПолейКлючаПеревозки.Правила КАК ПравилаБлокировкиПолейКлючаПеревозкиПравила
		|		ПО ВТ_ПравилоБлокировки.Ссылка = ПравилаБлокировкиПолейКлючаПеревозкиПравила.Ссылка";
	
	Запрос.УстановитьПараметр("ТипЗначенияОбъекта", Тип("ДокументСсылка.Заявка")); 
	ЧастиИмени = СтрРазделить(ИмяФормы, ".");
	Запрос.УстановитьПараметр("ФормаОбъекта", ЧастиИмени[ЧастиИмени.Количество() - 1]);
	
	РезультатЗапроса = Запрос.Выполнить();  
	МассивБлокируемыхПолей = Новый Массив;
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивБлокируемыхПолей.Добавить(Выборка.РеквизитФормы);
		КонецЦикла;
	КонецЕсли;
	
	ЭтаФорма.БлокируемыеПоляКлючаАналитикиПеревозки.ЗагрузитьЗначения(МассивБлокируемыхПолей);
	
КонецПроцедуры

// ДИТ BUG 82599 ТА 82600 Сержантова А.С. 21.03.2024
&НаКлиенте
Процедура СписокЗапросНаКТКПередУдалением(Элемент, Отказ)     
	ТекСтрока = Элементы.СписокЗапросНаКТК.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и не Отказ Тогда
		ОчиститьСвязьСоСтрокойЗапросаВСоставеУслуг(ТекСтрока.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 82599 ТА 82600 Сержантова А.С. 21.03.2024
&НаСервере
Процедура ОчиститьСвязьСоСтрокойЗапросаВСоставеУслуг(ИдентификаторСтрокиЗапроса)  
	НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиЗапросаНаКТК", ИдентификаторСтрокиЗапроса));
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Для каждого СтрокаУслуги Из НайденныеСтроки Цикл
			СтрокаУслуги.ИдентификаторСтрокиЗапросаНаКТК = "";	
		КонецЦикла;		
	КонецЕсли;   
КонецПроцедуры

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024
&НаСервере
Процедура ЗаполнитьНаОснованииЖДННаСервере(ПараметрыНакладных)
	
	//Упрощенный запрос из АРМ Накладные
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ОКПО КАК ОКПО
		|ПОМЕСТИТЬ ДанныеОрганизаций
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И НЕ Организации.ОбособленноеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	э_Накладная.Ссылка КАК Накладная,
		|	ТранспортныйДокумент.Ссылка КАК ТД,
		|	НЕ АктуальныеЖДН.ЖДН ЕСТЬ NULL КАК НакладнаяРаспределена
		|ПОМЕСТИТЬ СписокНакладных
		|ИЗ
		|	Документ.э_Накладная КАК э_Накладная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АктуальныеЖДН КАК АктуальныеЖДН
		|			ПО (АктуальныеЖДН.ЖДН = ТранспортныйДокумент.Ссылка)
		|				И (АктуальныеЖДН.Регистратор ССЫЛКА Документ.Сделка)
		|		ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
		|			И (э_Накладная.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНач И &ДатаКон)
		|			И (э_Накладная.Проведен)
		|			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|		ПО э_Накладная.Ссылка = э_НакладнаяКонтейнеры.Ссылка
		|			И (э_НакладнаяКонтейнеры.НомерКонтейнера В (&СписокКТК))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
		|		ПО э_Накладная.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
		|		ПО э_Накладная.Ссылка = э_НакладнаяГрузыЖД.Ссылка
		|ГДЕ
		|	НЕ э_НакладнаяКонтейнеры.Ссылка ЕСТЬ NULL
		|	И (&НетОтбораСтанцииОтправления
		|			ИЛИ э_Накладная.СтанцияОтправления В (&ОтборыСтанцияОтправления))
		|	И (&НетОтбораСтанцииНазначения
		|			ИЛИ э_Накладная.СтанцияНазначения В (&ОтборыСтанцияНазначения))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	э_Накладная.Ссылка,
		|	ТранспортныйДокумент.Ссылка,
		|	НЕ АктуальныеЖДН.ЖДН ЕСТЬ NULL
		|ИЗ
		|	Документ.э_Накладная КАК э_Накладная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АктуальныеЖДН КАК АктуальныеЖДН
		|			ПО (АктуальныеЖДН.ЖДН = ТранспортныйДокумент.Ссылка)
		|				И (АктуальныеЖДН.Регистратор ССЫЛКА Документ.Сделка)
		|		ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
		|			И (э_Накладная.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНач И &ДатаКон)
		|			И (э_Накладная.Проведен)
		|			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|		ПО э_Накладная.Ссылка = э_НакладнаяКонтейнеры.Ссылка
		|			И (э_НакладнаяКонтейнеры.НомерКонтейнера В (&СписокКТК))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
		|		ПО э_Накладная.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
		|		ПО э_Накладная.Ссылка = э_НакладнаяГрузыЖД.Ссылка
		|ГДЕ
		|	НЕ э_НакладнаяКонтейнеры.Ссылка ЕСТЬ NULL
		|	И (&НетОтбораСтанцииОтправления
		|			ИЛИ э_Накладная.СтанцияОтправления В (&ОтборыСтанцияОтправления))
		|	И (&НетОтбораСтанцииНазначения
		|			ИЛИ э_Накладная.СтанцияНазначения В (&ОтборыСтанцияНазначения))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Накладная,
		|	ТД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД КАК ТД,
		|	СписокНакладных.Накладная КАК Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
		|	ЛОЖЬ КАК ПустойКТК,
		|	ЛОЖЬ КАК ПустойВагон
		|ПОМЕСТИТЬ ДанныеСделок
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ЖДН)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ПО (СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД)
		|			И (СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
		|		ПО (РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Контрагент = СделкаСвязьУчетныхЕдиниц.Клиент)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента = СделкаСвязьУчетныхЕдиниц.Договор)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	СписокНакладных.Накладная,
		|	СписокНакладных.ТД
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ЖДН)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|			И (СделкаСвязьУчетныхЕдиниц.Доплата_Клиент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
		|		ПО (РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Контрагент = СделкаСвязьУчетныхЕдиниц.Доплата_Клиент)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента = СделкаСвязьУчетныхЕдиниц.Доплата_Договор)
		|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.ВагонПодсылаПорКТК,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	СделкаСвязьУчетныхЕдиниц.ВагонПодсылаПорКТК,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ПорожняяВагоннаяЖДН)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.ВагонПересылаПорКТК,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	СделкаСвязьУчетныхЕдиниц.Вагон,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча)
		|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНакладных.ТД,
		|	СписокНакладных.Накладная,
		|	Расходы.Ссылка,
		|	Расходы.Контейнер,
		|	Расходы.Вагон,
		|	ВЫБОР
		|		КОГДА Расходы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Расходы.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.Сделка.Расходы КАК Расходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНакладных КАК СписокНакладных
		|		ПО (СписокНакладных.ТД = Расходы.ТранспортныйДокумент)
		|			И (Расходы.Ссылка.Проведен)
		|			И (НЕ Расходы.УслугаОтключена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтоимостьПоЖДНакладным.Вагон КАК Вагон,
		|	СтоимостьПоЖДНакладным.Контейнер КАК Контейнер,
		|	ВЫБОР
		|		КОГДА СтоимостьПоЖДНакладным.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ СтоимостьПоЖДНакладным.Контейнер.Наименование
		|	КОНЕЦ КАК КонтейнерНаименование,
		|	ВЫБОР
		|		КОГДА СтоимостьПоЖДНакладным.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ СтоимостьПоЖДНакладным.Вагон.Наименование
		|	КОНЕЦ КАК ВагонНаименование,
		|	СтоимостьПоЖДНакладным.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	СтоимостьПоЖДНакладным.ТранспортныйДокумент.НакладнаяЭТРАН КАК ТранспортныйДокументНакладнаяЭТРАН
		|ПОМЕСТИТЬ ВТ_СтоимостьПоЖДНакладным1
		|ИЗ
		|	РегистрНакопления.СтоимостьПоЖДНакладным КАК СтоимостьПоЖДНакладным
		|ГДЕ
		|	СтоимостьПоЖДНакладным.ТранспортныйДокумент В
		|			(ВЫБРАТЬ
		|				э_Накладная.ТД
		|			ИЗ
		|				СписокНакладных КАК э_Накладная)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПоЖДНакладным.ТранспортныйДокумент,
		|	СтоимостьПоЖДНакладным.Контейнер,
		|	СтоимостьПоЖДНакладным.Вагон,
		|	ВЫБОР
		|		КОГДА СтоимостьПоЖДНакладным.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА "" иначе СтоимостьПоЖДНакладным.Контейнер.наименование конец,
		|								Выбор когда СтоимостьПоЖДНакладным.Вагон = Значение(Справочник.ТС.ПустаяСсылка) Тогда ""
		|		ИНАЧЕ СтоимостьПоЖДНакладным.Вагон.Наименование
		|	КОНЕЦ,
		|	СтоимостьПоЖДНакладным.ТранспортныйДокумент.НакладнаяЭТРАН,
		|	ВЫБОР
		|		КОГДА СтоимостьПоЖДНакладным.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ СтоимостьПоЖДНакладным.Контейнер.Наименование
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СтоимостьПоЖДНакладным.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ СтоимостьПоЖДНакладным.Вагон.Наименование
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтоимостьПоЖДНакладным1.Вагон КАК Вагон,
		|	ВТ_СтоимостьПоЖДНакладным1.Контейнер КАК Контейнер,
		|	ВТ_СтоимостьПоЖДНакладным1.КонтейнерНаименование КАК КонтейнерНаименование,
		|	ВТ_СтоимостьПоЖДНакладным1.ВагонНаименование КАК ВагонНаименование,
		|	ВТ_СтоимостьПоЖДНакладным1.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_СтоимостьПоЖДНакладным1.ТранспортныйДокументНакладнаяЭТРАН КАК ТранспортныйДокументНакладнаяЭТРАН
		|ПОМЕСТИТЬ ВТ_СтоимостьПоЖДНакладным
		|ИЗ
		|	ВТ_СтоимостьПоЖДНакладным1 КАК ВТ_СтоимостьПоЖДНакладным1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтоимостьПоЖДНакладным1.ТранспортныйДокумент,
		|	ВТ_СтоимостьПоЖДНакладным1.Контейнер,
		|	ВТ_СтоимостьПоЖДНакладным1.Вагон,
		|	ВТ_СтоимостьПоЖДНакладным1.КонтейнерНаименование,
		|	ВТ_СтоимостьПоЖДНакладным1.ВагонНаименование,
		|	ВТ_СтоимостьПоЖДНакладным1.ТранспортныйДокументНакладнаяЭТРАН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка КАК ТД,
		|	ТранспортныйДокументУчетныеЕдиницы.НомерКонтейнера КАК НомерКонтейнера,
		|	ТранспортныйДокументУчетныеЕдиницы.НомерВагона КАК НомерВагона,
		|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ТЧВагоныКонтейнеры
		|ИЗ
		|	Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|ГДЕ
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка В
		|			(ВЫБРАТЬ
		|				э_Накладная.ТД
		|			ИЗ
		|				СписокНакладных КАК э_Накладная)
		|	И НЕ(ТранспортныйДокументУчетныеЕдиницы.НомерКонтейнера = """"
		|				И ТранспортныйДокументУчетныеЕдиницы.НомерВагона = """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	э_Накладная.Накладная КАК Документ,
		|	ЕСТЬNULL(СтоимостьПоЖДНакладным.Контейнер, ВТ_ТЧВагоныКонтейнеры.Контейнер) КАК НомерКТК,
		|	ЕСТЬNULL(СтоимостьПоЖДНакладным.Контейнер.Наименование, ВТ_ТЧВагоныКонтейнеры.НомерКонтейнера) КАК СтрокаНомерКТК
		|ИЗ
		|	СписокНакладных КАК э_Накладная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК ЖДН
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОрганизаций КАК ОКПОГО
		|			ПО ЖДН.ГрузоотправительОКПО = ОКПОГО.ОКПО
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОрганизаций КАК ОКПОГП
		|			ПО ЖДН.ГрузополучательОКПО = ОКПОГП.ОКПО
		|		ПО э_Накладная.Накладная = ЖДН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЧВагоныКонтейнеры КАК ВТ_ТЧВагоныКонтейнеры
		|		ПО э_Накладная.ТД = ВТ_ТЧВагоныКонтейнеры.ТД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьПоЖДНакладным КАК СтоимостьПоЖДНакладным
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|			ПО СтоимостьПоЖДНакладным.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.КонтейнерыЗПУСтрока КАК э_НакладнаяКонтейнерЗПУ
		|			ПО СтоимостьПоЖДНакладным.Контейнер.Наименование = э_НакладнаяКонтейнерЗПУ.НомерКонтейнера
		|				И (э_НакладнаяКонтейнерЗПУ.Ссылка = СтоимостьПоЖДНакладным.ТранспортныйДокумент.НакладнаяЭТРАН)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|			ПО СтоимостьПоЖДНакладным.Контейнер.Наименование = э_НакладнаяКонтейнеры.НомерКонтейнера
		|				И (э_НакладнаяКонтейнеры.Ссылка = СтоимостьПоЖДНакладным.ТранспортныйДокумент.НакладнаяЭТРАН)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСделок КАК ДанныеСделок
		|			ПО СтоимостьПоЖДНакладным.ТранспортныйДокумент = ДанныеСделок.ТД
		|				И (ДанныеСделок.ПустойКТК
		|					ИЛИ ДанныеСделок.Контейнер = СтоимостьПоЖДНакладным.Контейнер)
		|				И (ДанныеСделок.ПустойВагон
		|					ИЛИ ДанныеСделок.Вагон = СтоимостьПоЖДНакладным.Вагон)
		|		ПО э_Накладная.ТД = СтоимостьПоЖДНакладным.ТранспортныйДокумент
		|			И (СтоимостьПоЖДНакладным.КонтейнерНаименование = ВТ_ТЧВагоныКонтейнеры.НомерКонтейнера)
		|			И (СтоимостьПоЖДНакладным.ВагонНаименование = ВТ_ТЧВагоныКонтейнеры.НомерВагона)
		|ГДЕ
		|	ВТ_ТЧВагоныКонтейнеры.НомерКонтейнера В(&СписокКТК)
		|	И ДанныеСделок.Сделка ЕСТЬ NULL
		|ИТОГИ ПО
		|	НомерКТК";  
	ЗаполнитьПараметрыЗапросаКНакладным(Запрос, ПараметрыНакладных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда      
		СтруктураПоискаСтроки = Новый Структура("НомерКТК");
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		МассивЗаполненных = Новый Массив;
		Пока Выборка.Следующий() Цикл  
			ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки,Выборка);
			СтрокиУслуг = Объект.СоставУслуги.НайтиСтроки(СтруктураПоискаСтроки); 
			ВыборкаНакладная = Выборка.Выбрать();
			Если ВыборкаНакладная.Следующий() Тогда 
				МассивЗаполненных.Добавить(ВыборкаНакладная.СтрокаНомерКТК);
				Для каждого Стр Из СтрокиУслуг Цикл
					ЗаполнитьВСтрокеГрузыИзНакладной(Стр, ВыборкаНакладная.Документ);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗаполненных);  
		Если МассивЗаполненных.Количество() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("Обновлены данные по грузу и весу груза в строках контейнеров %1", СтрСоединить(МассивЗаполненных, ",")));
			ЭтаФорма.Модифицированность = Истина;		
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось подобрать накладные для КТК из услуг");
	КонецЕсли;
		
КонецПроцедуры   

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024  
&НаСервере
Процедура ЗаполнитьПараметрыЗапросаКНакладным(Запрос, ПараметрыНакладных)

	Запрос.УстановитьПараметр("ДатаКон", ПараметрыНакладных.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНач", ПараметрыНакладных.ДатаНачала);       
	
	//Станция отправления, станция назначения     
	СтанцияНазначения = Новый Массив;
	СтанцияОтправления = Новый Массив;
	
	Если ПараметрыНакладных.СтанцияОтправления <> Неопределено или ПараметрыНакладных.СтанцияНазначения <> Неопределено Тогда
		ЗапросСтанция = Новый Запрос;
		ЗапросСтанция.Текст =
		"ВЫБРАТЬ
		|	э_Станции.Ссылка КАК Станция
		|ИЗ
		|	Справочник.Локации КАК Локации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
		|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
		|ГДЕ
		|	Локации.Ссылка = &ЛокацияОтправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	э_Станции.Ссылка КАК Станция
		|ИЗ
		|	Справочник.Локации КАК Локации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.э_Станции КАК э_Станции
		|		ПО (ПОДСТРОКА(Локации.КодЖДСтанции, 1, 5) = ПОДСТРОКА(э_Станции.Код, 1, 5))
		|ГДЕ
		|	Локации.Ссылка = &ЛокацияНазначения";
		ЗапросСтанция.УстановитьПараметр("ЛокацияОтправления", ПараметрыНакладных.СтанцияОтправления);  
		ЗапросСтанция.УстановитьПараметр("ЛокацияНазначения", ПараметрыНакладных.СтанцияНазначения); 
		ПакетРезультатов = ЗапросСтанция.ВыполнитьПакет();
		РезСтанцияОтправления = ПакетРезультатов[0].Выбрать();
		РезСтанцияНазначения = ПакетРезультатов[1].Выбрать();
		
		Если РезСтанцияОтправления.Следующий() Тогда
			СтанцияОтправления.Добавить(РезСтанцияОтправления.Станция);
		КонецЕсли;
		
		Если РезСтанцияНазначения.Следующий() Тогда
			СтанцияНазначения.Добавить(РезСтанцияНазначения.Станция);
		КонецЕсли;
			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НетОтбораСтанцииНазначения",Не ЗначениеЗаполнено(СтанцияНазначения));	   
	Запрос.УстановитьПараметр("ОтборыСтанцияНазначения",СтанцияНазначения);
	
	Запрос.УстановитьПараметр("НетОтбораСтанцииОтправления",Не ЗначениеЗаполнено(СтанцияОтправления));	   
	Запрос.УстановитьПараметр("ОтборыСтанцияОтправления",СтанцияОтправления);
	
	//Список наименований КТК
	СписокКТК = Объект.СоставУслуги.Выгрузить(,"НомерКТК").ВыгрузитьКолонку("НомерКТК"); 
	СписокКТКСоответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокКТК,"Наименование");
	СписокКТК.Очистить();
	Для каждого СтрокаСоответствия Из СписокКТКСоответствие Цикл
		СписокКТК.Добавить(СтрокаСоответствия.Значение.Наименование);	
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокКТК", СписокКТК);	

КонецПроцедуры

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024
&НаКлиенте
Процедура ЗаполнитьНаОснованииЖДН(Команда)   
	
	// Евросиб(ДИТ) US 82176 ТА 86287 Сержантова А.С. Начало: 10.06.2024
	// Груз и вес заполняем из Сделки. Старый алгоритм поиска сохранен по просьбе Ольги Савченковой
	ЗаполнитьГрузИВесПоДаннымСделки();
	Возврат;
	// Евросиб(ДИТ) US 82176 ТА 86287 Сержантова А.С. Конец: 10.06.2024
	
	Если Не ЗначениеЗаполнено(Объект.Отправка) Тогда
		ПоказатьПредупреждение(, "Не указана Дата отправки!");
		Возврат;
	КонецЕсли;
	
	СтрокиБезКонтейнеров = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка")));
	МаксимальноеКоличествоВыбранныхСтрок = Объект.СоставУслуги.Количество() - СтрокиБезКонтейнеров.Количество();
	Если МаксимальноеКоличествоВыбранныхСтрок = 0 Тогда
		ПоказатьПредупреждение(, "Нет строк с заполненными контейнерами!");
		Возврат;
	КонецЕсли;          
	СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки, НомерКТК", 
			ПредопределенноеЗначение("Справочник.КлючиАналитикиПеревозки.ПустаяСсылка"),
			ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка"));
	СтрокиБезКлюча = Объект.СоставУслуги.НайтиСтроки(СтруктураПоиска);
	Если СтрокиБезКлюча.Количество() > 0 Тогда
		ПоказатьПредупреждение(, "Необходимо сначала записать заявку!");
		Возврат;
	КонецЕсли; 
	
	СтанцииОтправления = Новый Массив;
	СтанцииНазначения = Новый Массив;

	Для Каждого СтрокаУслуг Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуг.СтанцияОтправления) И СтанцииОтправления.Найти(СтрокаУслуг.СтанцияОтправления) = Неопределено Тогда
			СтанцииОтправления.Добавить(СтрокаУслуг.СтанцияОтправления);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаУслуг.СтанцияНазначения) И СтанцииНазначения.Найти(СтрокаУслуг.СтанцияНазначения) = Неопределено Тогда
			СтанцииНазначения.Добавить(СтрокаУслуг.СтанцияНазначения);
		КонецЕсли;
	КонецЦикла;
	
	Если СтанцииОтправления.Количество() = 1 Тогда
		СтанцияОтправления = СтанцииОтправления[0];
	Иначе
		СтанцияОтправления = Неопределено;
	КонецЕсли;
	
	Если СтанцииНазначения.Количество() = 1 Тогда
		СтанцияНазначения = СтанцииНазначения[0];
	Иначе
		СтанцияНазначения = Неопределено;
	КонецЕсли;
	
	ПараметрыНакладных = Новый Структура;
	ПараметрыНакладных.Вставить("ДатаНачала", НачалоДня(Объект.Отправка));
	ПараметрыНакладных.Вставить("ДатаОкончания", КонецДня(Объект.Отправка));
	ПараметрыНакладных.Вставить("СтанцияОтправления", СтанцияОтправления);
	ПараметрыНакладных.Вставить("СтанцияНазначения", СтанцияНазначения);
	
	ЗаполнитьНаОснованииЖДННаСервере(ПараметрыНакладных);
КонецПроцедуры   

// Евросиб(ДИТ) US 82176 ТА 86287 Сержантова А.С. 10.06.2024
&НаСервере
Процедура ЗаполнитьГрузИВесПоДаннымСделки()

	РезультатПоискаГрузаВЗаявке = ПолучитьДанныеВесаИГрузаИзСделки();
	МассивЗаполненных = Новый Массив;
	Для каждого СтрокаУслуги Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.НомерКТК) 
			и РезультатПоискаГрузаВЗаявке.Получить(СтрокаУслуги.НомерКТК) <> Неопределено Тогда 
			
			Если СтрокаУслуги.Груз <> РезультатПоискаГрузаВЗаявке[СтрокаУслуги.НомерКТК].Груз
				или СтрокаУслуги.ВесГрузаНетто <> РезультатПоискаГрузаВЗаявке[СтрокаУслуги.НомерКТК].ВесГрузаНетто 
				или РезультатПоискаГрузаВЗаявке[СтрокаУслуги.НомерКТК].СоставГруза <> Неопределено Тогда 
				
				СтрокиДетализации = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаУслуги.КлючАналитикиПеревозки));
				Для каждого СтрДетализации Из СтрокиДетализации Цикл
					ДетализацияПоГрузу.Удалить(СтрДетализации);	
				КонецЦикла;
				
				ГрузИВесИзЖДН = РезультатПоискаГрузаВЗаявке[СтрокаУслуги.НомерКТК]; 
				Если ГрузИВесИзЖДН.СоставГруза <> Неопределено Тогда
					Для каждого СтрСоставаГруза Из ГрузИВесИзЖДН.СоставГруза Цикл
						НС = ДетализацияПоГрузу.Добавить();
						ЗаполнитьЗначенияСвойств(НС, СтрСоставаГруза);
						НС.КлючАналитикиПеревозки = СтрокаУслуги.КлючАналитикиПеревозки;
					КонецЦикла;      
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаУслуги, ГрузИВесИзЖДН); 
				МассивЗаполненных.Добавить(СтрокаУслуги.НомерСтроки);
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;          
	Если МассивЗаполненных.Количество() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Обновлены данные по грузу и весу груза в строках контейнеров %1", СтрСоединить(МассивЗаполненных, ",")));
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

// Евросиб(ДИТ) US 82176 ТА 86287 Сержантова А.С. 10.06.2024 
&НаСервере
Функция ПолучитьДанныеВесаИГрузаИзСделки()  
	
	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Ссылка КАК Ссылка,
	               |	ТЕ.Ссылка КАК НомерКТК
	               |ПОМЕСТИТЬ ВТ_ДанныеЗаявки
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	ТЕ.Ссылка В(&СписокКТК)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	ВЫБОР
	               |		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Приоритет,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН
	               |ПОМЕСТИТЬ ВТ_ЖДНСделки
	               |ИЗ
	               |	ВТ_ДанныеЗаявки КАК ВТ_ДанныеЗаявки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
	               |			ПО СделкаСвязьУчетныхЕдиниц.Груз = Грузы.Ссылка
	               |		ПО ВТ_ДанныеЗаявки.Ссылка = СделкаСвязьУчетныхЕдиниц.Заявка
	               |			И ВТ_ДанныеЗаявки.НомерКТК = СделкаСвязьУчетныхЕдиниц.Контейнер
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЖДНСделки.Контейнер КАК Контейнер,
	               |	ВТ_ЖДНСделки.Приоритет КАК Приоритет,
	               |	э_Накладная.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_НакаладныеИзСделки
	               |ИЗ
	               |	ВТ_ЖДНСделки КАК ВТ_ЖДНСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	               |			ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_Накладная.Ссылка
	               |		ПО ВТ_ЖДНСделки.ЖДН = ТранспортныйДокумент.Ссылка
	               |			И (э_Накладная.Проведен)
	               |			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НакаладныеИзСделки.Контейнер КАК Контейнер,
	               |	ВТ_НакаладныеИзСделки.Приоритет КАК Приоритет,
	               |	ЕСТЬNULL(э_НакладнаяГрузыЖД.МассаГруза, 0) КАК ВесГрузаНетто,
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор КАК Груз,
	               |	ЕСТЬNULL(э_НакладнаяГрузыЖД.КодЕТСНГ, """") КАК КодГруза,
	               |	ЕСТЬNULL(э_НакладнаяГрузыЖД.КоличествоМест, 0) КАК КоличествоМест
	               |ИЗ
	               |	ВТ_НакаладныеИзСделки КАК ВТ_НакаладныеИзСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	               |			ПО э_НакладнаяГрузыЖД.ЕТСНГ = Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана
	               |		ПО ВТ_НакаладныеИзСделки.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет
	               |ИТОГИ
	               |	СУММА(ВесГрузаНетто),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Груз),
	               |	СУММА(КоличествоМест)
	               |ПО
	               |	Контейнер,
	               |	Приоритет";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокКТК", Объект.СоставУслуги.Выгрузить(,"НомерКТК")); 
	ВыборкаКТК = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	КодЕТСНГСборнойОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.Грузы.СборнаяКонтейнернаяОтправка, "ЕТСНГ");
	Пока ВыборкаКТК.Следующий() Цикл 
		СтруктураГруз = Новый Структура("Груз, КодГруза, ВесГрузаНетто, КоличествоМест, Груженый, СоставГруза");
	    ВыборкаПриоритет = ВыборкаКТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаПриоритет.Следующий() Тогда  
			Если ВыборкаПриоритет.ВесГрузаНетто = 0 и ВыборкаПриоритет.КоличествоМест = 0 и ВыборкаПриоритет.Груз = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если ВыборкаПриоритет.Груз > 1 Тогда
			    СтруктураГруз.Груз = Справочники.Грузы.СборнаяКонтейнернаяОтправка; 
				СтруктураГруз.КодГруза = КодЕТСНГСборнойОтправки;  
				СтруктураГруз.ВесГрузаНетто = ВыборкаПриоритет.ВесГрузаНетто; 
				СтруктураГруз.КоличествоМест = ВыборкаПриоритет.КоличествоМест;
				СтруктураГруз.Груженый = Истина;
				ВыборкаГруз = ВыборкаПриоритет.Выбрать(); 
				МассивСоставаГруза = Новый Массив;
				Пока ВыборкаГруз.Следующий() Цикл       
					СтрокаСоставаГруза = Новый Структура("Груз, ВесГруза, КоличествоМест");
					СтрокаСоставаГруза.Груз = ВыборкаГруз.Груз;
					СтрокаСоставаГруза.ВесГруза = ВыборкаГруз.ВесГрузаНетто; 
					СтрокаСоставаГруза.КоличествоМест = ВыборкаГруз.КоличествоМест;
					МассивСоставаГруза.Добавить(СтрокаСоставаГруза);		
				КонецЦикла;  
				СтруктураГруз.СоставГруза = МассивСоставаГруза; 
			Иначе	 
				ВыборкаГруз = ВыборкаПриоритет.Выбрать();
				ВыборкаГруз.Следующий();
				ЗаполнитьЗначенияСвойств(СтруктураГруз, ВыборкаГруз);
				Если ЗначениеЗаполнено(ВыборкаГруз.Груз) Тогда
					СтруктураГруз.Груженый = Истина;
				КонецЕсли;
			КонецЕсли;
			Результат.Вставить(ВыборкаКТК.Контейнер, СтруктураГруз); 	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

//Евросиб Коханенко Н.А. 24.04.2024 (( #84617  
Процедура ОбновитьУчетныеНаправленияВЗапросеНаАвто();
	Если ЗначениеЗаполнено(ЗапросПерваяМиля) Тогда
		ДокументОбъект = ЗапросПерваяМиля.ПолучитьОбъект();
		ДокументОбъект.ОбновитьУчетныеНаправленияИзЗаявки();
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗапросПоследняяМиля) Тогда
		ДокументОбъект = ЗапросПоследняяМиля.ПолучитьОбъект();
		ДокументОбъект.ОбновитьУчетныеНаправленияИзЗаявки();
	КонецЕсли;
КонецПроцедуры

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
&НаКлиенте
Процедура ПереносКТКВыделитьВсе(Команда)
	Для Каждого Стр Из Объект.СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ПеренесенВЗаявку) Тогда
			Стр.ПереносКТК = Истина;
		КонецЕсли;
	КонецЦикла;
	ОбновитьДоступностьКнопкиВыполненияПереносаКТК();
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
&НаКлиенте
Процедура ПереносКТКСнятьВсе(Команда)
	Для Каждого Стр Из Объект.СоставУслуги Цикл
		Стр.ПереносКТК = Ложь;
	КонецЦикла;
	ОбновитьДоступностьКнопкиВыполненияПереносаКТК();
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 22.05.2024 (( #83866 
&НаКлиенте
Процедура СоставУслугиПереносКТКПриИзменении(Элемент)
	ОбновитьДоступностьКнопкиВыполненияПереносаКТК();
КонецПроцедуры //Евросиб Коханенко Н.А. 22.05.2024 )) #83866

//Евросиб Коханенко Н.А. 22.05.2024 (( #83866 
&НаКлиенте
Процедура ОбновитьДоступностьКнопкиВыполненияПереносаКТК()
	ЭтаФорма.Элементы.СоставУслугиПеренестиКТКвДругуюЗаявкуОК.Доступность = Объект.СоставУслуги.НайтиСтроки(Новый Структура("ПереносКТК", Истина)).Количество() > 0;
КонецПроцедуры //Евросиб Коханенко Н.А. 22.05.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
&НаКлиенте
Процедура УстановитьВидимостьКнопокПереносаКТК()
	Если Элементы.СоставУслугиПеренестиКТКвДругуюЗаявку.Пометка Тогда
		Элементы.СоставУслугиПереносКТК.Видимость = Истина;
		Элементы.СоставУслугиПеренестиКТКвДругуюЗаявку.Видимость = Ложь;
		Элементы.СоставУслугиПеренестиКТКвДругуюЗаявкуОК.Видимость = Истина;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКУстановитьВсе.Видимость = Истина;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКСнятьВсе.Видимость = Истина;
		//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
		ЭтаФорма.Элементы.СоставУслугиФильтрПоКТК.Видимость = Истина;
		//Евросиб Коханенко Н.А. 12.09.2024 )) #89738 
	Иначе
		Элементы.СоставУслугиПереносКТК.Видимость = Ложь;
		Элементы.СоставУслугиПеренестиКТКвДругуюЗаявку.Видимость = Истина;
		ЭтаФорма.Элементы.СоставУслугиПеренестиКТКвДругуюЗаявкуОК.Видимость = Ложь;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКУстановитьВсе.Видимость = Ложь;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКСнятьВсе.Видимость = Ложь;
		//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
		ЭтаФорма.Элементы.СоставУслугиФильтрПоКТК.Видимость = Ложь;
		//Евросиб Коханенко Н.А. 12.09.2024 )) #89738 
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
&НаКлиенте
Процедура ПеренестиКТКвДругуюЗаявку(Команда)
	ПереносКТККлиент.ПеренестиКТКвДругуюЗаявку_Заявка_Нажатие(ЭтаФорма);
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
&НаКлиенте
Процедура ПеренестиКТКвДругуюЗаявкуОК(Команда)
	ПереносКТККлиент.ПеренестиКТКвДругуюЗаявку_ОК_Заявка_Нажатие(ЭтаФорма);
	ОбновитьДоступностьКнопкиВыполненияПереносаКТК();
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 28.05.2024 (( #83866 
&НаКлиенте
Процедура ПеренестиКТКФоновоеЗадание(ЦелеваяЗаявка) Экспорт
	
	МассивГУИДов = Новый Массив;
	Для Каждого Строка Из Объект.СоставУслуги Цикл
		Если Строка.ПереносКТК Тогда
			МассивГУИДов.Добавить(Строка.ГУИДСтроки);
		КонецЕсли;
	КонецЦикла;
	
	РезультатВыполнения = ПеренестиКТКНаСервере(ЦелеваяЗаявка, Объект.Ссылка, МассивГУИДов);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Выполняется перенос КТК в другую заявку.
										|Это может занять продолжительное время.";
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПереносКТКЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры //Евросиб Коханенко Н.А. 28.05.2024 )) #83866

//Евросиб Коханенко Н.А. 28.05.2024 (( #83866 
&НаСервере
Функция ПеренестиКТКНаСервере(ЦелеваяЗаявка, ЗаявкаИсточникСсылка, МассивГУИДов)

	РезультатВыполнения = Неопределено;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перенос КТК в другую заявку'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	стПараметры = Новый Структура;
	стПараметры.Вставить("ЦелеваяЗаявка", ЦелеваяЗаявка);
	стПараметры.Вставить("ЗаявкаИсточникСсылка", ЗаявкаИсточникСсылка);
	стПараметры.Вставить("ЗаявкаИсточникМассивГУИДов", МассивГУИДов);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("ПереносКТКСервер.ПеренестиКТКНаСервере", стПараметры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции //Евросиб Коханенко Н.А. 28.05.2024 )) #83866

//Евросиб Коханенко Н.А. 28.05.2024 (( #83866 
&НаКлиенте
Процедура ПереносКТКЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если СтруктураРезультата.Свойство("ЕстьРезультат") 
				И СтруктураРезультата.ЕстьРезультат = Истина Тогда
			//оповестим об обновлении ключа аналитики и заявок
			ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));
			ОповеститьОбИзменении(Тип("ДокументСсылка.Заявка"));
			//перечитаем форму заявки-источника
			ЭтаФорма.Прочитать();
			//узнаем, есть ли запросы на автоперевозку
			ЗаявкаПриемникСсылка = СтруктураРезультата.ЗаявкаПриемникСсылка;
			Если ЗаявкаПриемникСсылка <> Неопределено Тогда
				ОткрытьФорму("Документ.Заявка.ФормаОбъекта", Новый Структура("Ключ", ЗаявкаПриемникСсылка));
			КонецЕсли;
			//формируем текст сообщения
			КоличествоСвязанныхЗапросов = 0;
			СсылкиНаЗапросыНаАвто = ПолучитьСсылкиНаЗапросыНаАвтоперевозку(ЗаявкаПриемникСсылка);
			Если СсылкиНаЗапросыНаАвто.ПерваяМиля <> ПредопределенноеЗначение("Документ.ЗапросНаАвтоперевозку.ПустаяСсылка") Тогда
				КоличествоСвязанныхЗапросов = КоличествоСвязанныхЗапросов + 1;
			КонецЕсли;
			Если СсылкиНаЗапросыНаАвто.ПоследняяМиля <> ПредопределенноеЗначение("Документ.ЗапросНаАвтоперевозку.ПустаяСсылка") Тогда
				КоличествоСвязанныхЗапросов = КоличествоСвязанныхЗапросов + 1;
			КонецЕсли;
			ТекстСообщения = "Операция переноса КТК в другую заявку выполнена."; 
			Если КоличествоСвязанныхЗапросов > 0 Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон(" Отправьте запрос%1 на автоперевозку в ИС ""Транспортная логистика""", 
													?(КоличествоСвязанныхЗапросов < 2, "", "ы")); 
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 28.05.2024 )) #83866

//Евросиб Коханенко Н.А. 04.06.2024 (( #83866 
&НаСервере
Функция ПолучитьСсылкиНаЗапросыНаАвтоперевозку(ЗаявкаСсылка)
	
	СтруктураСсылок = Документы.Заявка.ПолучитьСсылкиНаЗапросыНаАвтоперевозку(ЗаявкаСсылка);
	Возврат СтруктураСсылок;

КонецФункции //Евросиб Коханенко Н.А. 04.06.2024 )) #83866 

//Евросиб Коханенко Н.А. 24.07.2024 (( #88606 
&НаСервере
Процедура ОтвязатьКлючиАналитикиУдаленныхСтрокОтЗаявки()
	Если КлючиАналитикиУдаленныхСтрок.Количество() > 0 Тогда
		Для Каждого КлючУдаленнойСтроки Из КлючиАналитикиУдаленныхСтрок Цикл 
			Если ЗначениеЗаполнено(КлючУдаленнойСтроки.Значение) Тогда
				СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлючаАналитикиПеревозки.КлючАналитики = КлючУдаленнойСтроки.Значение;  
				СтруктураКлючаАналитикиПеревозки.Заявка = Документы.Заявка.ПустаяСсылка();
				ОтвязанныйКлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки); 
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 24.07.2024 )) #88606 

//Евросиб Коханенко Н.А. 07.08.2024 (( #87840 
&НаКлиенте
Процедура ЗапросНаАвтоперевозкуСредняяМиля(Команда)
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(ЗапросСредняяМиля) Тогда
		ПараметрыФ = Новый Структура;
		ПараметрыФ.Вставить("Ключ", ЗапросСредняяМиля);
		ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДокумента", ПараметрыФ, ЭтаФорма);
	КонецЕсли;      
	
КонецПроцедуры //Евросиб Коханенко Н.А. 07.08.2024 )) #87840
//Евросиб Коханенко Н.А. 24.04.2024 )) #84617  

//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, начало
&НаКлиенте
Функция РазрешеноИзменитьКонтрагента()
	РезультатФункции = Истина;
	
	МассивГУИД = Новый Массив;
	Для каждого СтрокаТЧ из Объект.СоставУслуги Цикл
		МассивГУИД.Добавить(СтрокаТЧ.ГУИДСтроки);
	КонецЦикла;
	
	СтруктураРезультатПроверки = СтрокиВключенныеВСделки(Объект.Ссылка, МассивГУИД);
	Если СтруктураРезультатПроверки.ЕстьСтрокиВключенныеВСделки Тогда
		СтрокаСписокСделок = СтрСоединить(СтруктураРезультатПроверки.Сделки, ", ");
		ПоказатьПредупреждение(, "Запрещено изменять контрагента! Заявка включена в сделку: " + СтрокаСписокСделок);
		РезультатФункции = Ложь;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, начало
&НаКлиенте
Процедура КонтрагентНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если НЕ РазрешеноИзменитьКонтрагента() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, начало
&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если НЕ РазрешеноИзменитьКонтрагента() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, Ticket#0362212, 20-08-2024, конец  

//Евросиб Коханенко Н.А. 02.09.2024 (( #90198 
&НаСервере
Процедура УстановитьДоступностьПолейПоЗаявкеИзЛК(); 
	Если Объект.ЗаявкаЛККДКП Тогда  
		Элементы.ДатаОформленияЗаявки.ТолькоПросмотр = Истина;
		Элементы.ГрузоотправительПоВнешнеторговомуКонтракту.ТолькоПросмотр = Истина;
		Элементы.ГрузополучательПоВнешнеторговомуКонтракту.ТолькоПросмотр = Истина;
		Элементы.СогласованнаяCтавка.ТолькоПросмотр = Истина; 
		Элементы.СоставУслугиУсловияПеревозки.ТолькоПросмотр = Истина; 
		Элементы.СоставУслугиУсловияПеревозкиНазначение.ТолькоПросмотр = Истина;
		Элементы.СоставУслугиКодГруза.ТолькоПросмотр = Истина;
		Элементы.СоставУслугиГрузПоТНВЭД.ТолькоПросмотр = Истина;
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		Элементы.СоставУслугиГрузПоТНВЭД1.ТолькоПросмотр = Истина;
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		Элементы.СоставУслугиГрузПоГНГ.ТолькоПросмотр = Истина; 
		Элементы.СоставУслугиСтранаПроисхожденияГруза.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 02.09.2024 )) #90198 

//Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91420, 12-09-2024, начало
&НаКлиенте
Процедура ГрузыГрузОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Реквизиты = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ВыбранноеЗначение, "ЕТСНГ, ГНГ, Наименование");
		ТекД = Элементы.Грузы.ТекущиеДанные;
		ТекД.КодГрузаЕТСНГ = Реквизиты.ЕТСНГ;
		ТекД.НаименованиеГрузаЕТСНГ = Реквизиты.Наименование;
		ТекД.КодГрузаГНГ = Реквизиты.ГНГ;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91420, 12-09-2024, конец

//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
&НаКлиенте
Процедура ФильтрПоКТК(Команда)
	ОповещениеПослеВыбораКТК = Новый ОписаниеОповещения("ОбработатьФильтрПоКТК", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК, ВозвращатьСтрокиНедоступно", Истина, Истина), ЭтаФорма,,,, ОповещениеПослеВыбораКТК, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //Евросиб Коханенко Н.А. 12.09.2024 )) #89738  

//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
&НаКлиенте
Процедура ОбработатьФильтрПоКТК(РезультатВыбораФильтра, ДопПараметры) Экспорт
	
	Если РезультатВыбораФильтра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Объект.СоставУслуги Цикл
		ТекСтрока.ПереносКТК = Ложь;        
		Если РезультатВыбораФильтра.Найти(ТекСтрока.НомерКТК) <> Неопределено 
				И НЕ ЗначениеЗаполнено(ТекСтрока.ПеренесенВЗаявку) Тогда
			ТекСтрока.ПереносКТК = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	ОбновитьДоступностьКнопкиВыполненияПереносаКТК();

КонецПроцедуры //Евросиб Коханенко Н.А. 12.09.2024 )) #89738

//Евросиб Коханенко Н.А. 24.01.2025 (( #98939 
&НаКлиенте
Процедура АвтозагрузкаРейсовИзДХПриИзменении(Элемент)
	ДатаНачалаРазрешенияАвтозагрузки = ВернутьКонстантуАвтозагрузкаРейсовИзDXсДаты();
	Если ЗначениеЗаполнено(ДатаНачалаРазрешенияАвтозагрузки) Тогда
		Если ДатаНачалаРазрешенияАвтозагрузки > Объект.Создано Тогда
			ТекстСообщения = "Автообновление недоступно, так как дата создания заявки раньше даты разрешения автозагрузки";	
		Иначе
			ТекстСообщения = СтрШаблон("Информация о рейсах %1будет автоматически обновляться в %2связанных сделках",
				?(ЭтаФорма.АвтозагрузкаРейсовИзДХ, "больше не ", ""),
				?(ЭтаФорма.АвтозагрузкаРейсовИзДХ, "заявке и ", ""));
		КонецЕсли;
	Иначе
		ТекстСообщения = "Автообновление временно недоступно или заблокировано администраторами системы";	
	КонецЕсли;
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Модифицированность = Истина;
КонецПроцедуры //Евросиб Коханенко Н.А. 24.01.2025 )) #98939 

//Евросиб Коханенко Н.А. 24.01.2025 (( #98939 
&НаСервереБезКонтекста
Функция ВернутьКонстантуАвтозагрузкаРейсовИзDXсДаты()
  Возврат Константы.АвтозагрузкаРейсовИзDXсДаты.Получить();
КонецФункции //Евросиб Коханенко Н.А. 24.01.2025 )) #98939  
//Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91420, 12-09-2024, конец

// Евросиб(ДИТ) BUG 92539 ТА 97789 Сержантова А.С. 11.12.2024
Процедура СкрытьКолонкиСНаименованиемУдалить()
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;	
	КонецЕсли;  
	
	Для каждого Эл  Из Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ПолеФормы") и СтрНайти(Эл.ПутьКДанным, "Удалить") <> 0 Тогда
			Эл.Видимость = Ложь;   
		КонецЕсли;
	КонецЦикла;	   
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 28.12.2024 (( #97950 
&НаСервере
Процедура УстановитьДоступностьПолейСреднейМили(); 
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.СоставУслугиГруппаСредняяМиля.ТолькоПросмотр = Истина;
	КонецЕсли;  

КонецПроцедуры //Евросиб Коханенко Н.А. 28.12.2024 )) #97950 

//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
&НаКлиенте
Процедура ГруппаДКСПриИзменении(Элемент)
	ОбновитьОфисыПродаж();
КонецПроцедуры //Евросиб Коханенко Н.А. 11.02.2025 )) #78722

//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
&НаКлиенте
Процедура ОбновитьОфисыПродаж()
	
	Если ЕстьСвязаннаяРТУ <> "" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаУслуг Из Объект.СоставУслуги Цикл
		НовоеЗначениеОфисаПродаж = ПолучитьОфисПродаж(ГруппаДКС, Объект.Контрагент, СтрокаУслуг.Калькуляция, СтрокаУслуг.НомерКТК, СтрокаУслуг.ТипКТК);
		Если СтрокаУслуг.ОфисПродаж <> НовоеЗначениеОфисаПродаж Тогда
			СтрокаУслуг.ОфисПродаж = НовоеЗначениеОфисаПродаж;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;  
	
КонецПроцедуры //Евросиб Коханенко Н.А. 11.02.2025 )) #78722

//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
&НаСервере
Функция ПолучитьОфисПродаж(ГруппаДКС, Контрагент, Калькуляция, КТК, ТипКТК)
	
	//пп.10 ФТ: значение доп.аналитики Контрагента имеет приоритетное значение
	ОфисПродажКонтрагента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьАналитикуДокумента(Контрагент,
		ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ОфисПродаж);
	Если ЗначениеЗаполнено(ОфисПродажКонтрагента) Тогда
		Возврат ОфисПродажКонтрагента;	
	КонецЕсли;
	
	//пп.14
	Если ЗначениеЗаполнено(ТипКТК)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипКТК, "Рефрижераторный") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ОфисыПродаж.Рефы"); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Калькуляция) Тогда
		ДанныеКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Калькуляция, "ТипКалькуляции, ОтнестиРасходыНаСобственныеЗатраты, ОтнестиРасходыНаСебестоимостьКлиента");
		
		ПроверяемыеТипыКалькуляций = Новый СписокЗначений;
		ТипМежсервисныеРасходы = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы");
		ТипМежсервисныеРасходыРеф = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф");
		ПроверяемыеТипыКалькуляций.Добавить(ТипМежсервисныеРасходы);
		ПроверяемыеТипыКалькуляций.Добавить(ТипМежсервисныеРасходыРеф);
		ОфисПродажРасходыДКП = ПредопределенноеЗначение("Справочник.ОфисыПродаж.РасходыДКП"); 
		Если ПроверяемыеТипыКалькуляций.НайтиПоЗначению(ДанныеКалькуляции.ТипКалькуляции) <> Неопределено Тогда
			//пп.11 ФТ: если тип калькуляции Межсервисные расходы, и признак НаСобственныеЗатраты, то Офис продаж - РасходыДКП
			Если ДанныеКалькуляции.ОтнестиРасходыНаСобственныеЗатраты Тогда
				Возврат ОфисПродажРасходыДКП;
			КонецЕсли;
			//пп.11 ФТ: если же признак НаСебестоимостьКлиента, то или как в аналогичной заявке, или РасходыДКП
			Если ДанныеКалькуляции.ОтнестиРасходыНаСебестоимостьКлиента Тогда
				ОфисПродажВАналогичнойЗаявке = ИщемОфисПродажДляКТКВСвязаннойЧерезСделкуЗаявкеПоСовпадениюКТК(Объект.Ссылка, КТК);
				Если ЗначениеЗаполнено(ОфисПродажВАналогичнойЗаявке) Тогда
					Возврат ОфисПродажВАналогичнойЗаявке;
				Иначе
					Возврат ОфисПродажРасходыДКП;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//пп.9 ФТ: если калькуляция из уканных типов, то ищем вторую заявку в сделке с этим КТК, и по ней определяем Офис Продаж
		ПроверяемыеТипыКалькуляций.Очистить();
		ТипДоплатныеКТК = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Доплатные");
		ТипСубсидии = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Субсидии");
		//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		ТипПремии = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Премии");
		//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		ПроверяемыеТипыКалькуляций.Добавить(ТипДоплатныеКТК);
		ПроверяемыеТипыКалькуляций.Добавить(ТипСубсидии);
		ПроверяемыеТипыКалькуляций.Добавить(ТипПремии); //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025 
		
		Если ПроверяемыеТипыКалькуляций.НайтиПоЗначению(ДанныеКалькуляции.ТипКалькуляции) <> Неопределено Тогда
			ОфисПродажВАналогичнойЗаявке = ИщемОфисПродажДляКТКВСвязаннойЧерезСделкуЗаявкеПоСовпадениюКТК(Объект.Ссылка, КТК);
			Если ЗначениеЗаполнено(ОфисПродажВАналогичнойЗаявке) Тогда
				Возврат ОфисПродажВАналогичнойЗаявке;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Неопределено; 

	СоответсвиеГруппаДКСОфисПродаж = Новый Соответствие;
	ОфисЦентральный = ПредопределенноеЗначение("Справочник.ОфисыПродаж.Центральный");
	//Евросиб Коханенко Н.А. 28.08.2025 (( #117237 
	//СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ММ"), ОфисЦентральный);
	//Евросиб Коханенко Н.А. 28.08.2025 )) #117237 
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ВРП"), ОфисЦентральный);
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.Сухопут"), ОфисЦентральный);
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.Море"), ОфисЦентральный);
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ДМС"), ОфисЦентральный);
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ВЭД"), ОфисЦентральный);
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.Аренда"), ОфисЦентральный);
	
	ОфисДальнийВосток = ПредопределенноеЗначение("Справочник.ОфисыПродаж.ДальнийВосток");
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ДВ"), ОфисДальнийВосток);
	//Евросиб Коханенко Н.А. 28.08.2025 (( #117237 
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ММ"), ОфисДальнийВосток);
	//Евросиб Коханенко Н.А. 28.08.2025 )) #117237 
	
	ОфисНовосибирск = ПредопределенноеЗначение("Справочник.ОфисыПродаж.Новосибирск");
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.НСК"), ОфисНовосибирск);
	
	ОфисРефы = ПредопределенноеЗначение("Справочник.ОфисыПродаж.Рефы");
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.Рефы"), ОфисРефы);
	
	ОфисКазахстан = ПредопределенноеЗначение("Справочник.ОфисыПродаж.Казахстан");
	СоответсвиеГруппаДКСОфисПродаж.Вставить(ПредопределенноеЗначение("Справочник.ГруппыДКС.ЕКЗХ"), ОфисКазахстан);
	
	Результат = СоответсвиеГруппаДКСОфисПродаж.Получить(ГруппаДКС);
	
	Возврат Результат; 
	
КонецФункции //Евросиб Коханенко Н.А. 11.02.2025 )) #78722

//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
&НаСервере
Функция ЕстьСвязаннаяРТУ(ЗаявкаСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	РеализацияТоваровУслуг.Дата КАК Дата,
		//|	РеализацияТоваровУслуг.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Представление КАК Представление
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
		|		ПО СделкаДоходы.Ссылка = СделкаЗаявки.Ссылка
		|			И (СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг)
		|			И (СделкаДоходы.Ссылка.Проведен)
		|			И (СделкаДоходы.УчДокумент.Проведен)
		|			И (СделкаЗаявки.Заявка = &Заявка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО СделкаДоходы.УчДокумент = РеализацияТоваровУслуг.Ссылка";
	
	Запрос.УстановитьПараметр("Заявка", ЗаявкаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		//Результат = СтрШаблон("(%1 от %2)", Выборка.Номер, Выборка.Дата);
		Результат = Выборка.Представление;
	Иначе
		Результат = "";
	КонецЕсли;
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 11.02.2025 )) #78722

//Евросиб Коханенко Н.А. 11.02.2025 (( #78722 
&НаСервере
Функция ИщемОфисПродажДляКТКВСвязаннойЧерезСделкуЗаявкеПоСовпадениюКТК(ОсновнаяЗаявкаСсылка, НомерКТК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаявкаСоставУслуги.ОфисПродаж
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаОсновнаяЗаявка
		|		ПО (СделкаЗаявки.Ссылка = СделкаОсновнаяЗаявка.Ссылка)
		|			И СделкаОсновнаяЗаявка.Заявка = &ОсновнаяЗавка 
		|			И СделкаОсновнаяЗаявка.Заявка <> СделкаЗаявки.Заявка	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ЗаявкаСоставУслуги.Ссылка = СделкаЗаявки.Заявка
		|			И ЗаявкаСоставУслуги.НомерКТК = &НомерКТК
		|			И НЕ ЗаявкаСоставУслуги.ОфисПродаж = ЗНАЧЕНИЕ(Справочник.ОфисыПродаж.ПустаяСсылка)
		|			И ЗаявкаСоставУслуги.Ссылка.Проведен 
		|";
	
	Запрос.УстановитьПараметр("ОсновнаяЗавка", ОсновнаяЗаявкаСсылка);
	Запрос.УстановитьПараметр("НомерКТК", НомерКТК);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ОфисПродаж;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	Возврат Результат; 
	
КонецФункции //Евросиб Коханенко Н.А. 11.02.2025 )) #78722

//Евросиб Коханенко Н.А. 06.03.2025 (( #103978 
&НаКлиенте
Процедура СоставУслугиКоносаментПриИзменении(Элемент)
	ТекДанные = Элементы.СоставУслуги.ТекущиеДанные;
	Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") 
		И ЗначениеЗаполнено(ТекДанные.Коносамент)
			И ЗначениеЗаполнено(ТекДанные.НомерКТК) Тогда
		ВесИзКоносамента = ПолучитьВесКТКИзКоносамента(ТекДанные.Коносамент, ТекДанные.НомерКТК);	
		Если ЗначениеЗаполнено(ВесИзКоносамента) Тогда
			ТекДанные.ВесГрузаНетто = ВесИзКоносамента;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 06.03.2025 )) #103978 

//Евросиб Коханенко Н.А. 06.03.2025 (( #103978 
&НаСервереБезКонтекста
Функция ПолучитьВесКТКИзКоносамента(Коносамент, НомерКТК)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТранспортныйДокументКоносаменты.ВесНетто КАК ВесНетто
		|ИЗ
		|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|ГДЕ
		|	ТранспортныйДокументКоносаменты.Ссылка = &Коносамент
		|	И ТранспортныйДокументКоносаменты.НомерКТК = &НомерКТК";
	
	Запрос.УстановитьПараметр("Коносамент", Коносамент);
	Запрос.УстановитьПараметр("НомерКТК", НомерКТК);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.ВесНетто;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
    Возврат Результат;
КонецФункции //Евросиб Коханенко Н.А. 06.03.2025 )) #103978

//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, начало
&НаКлиенте
Процедура СтатусЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.СтатусыДокументов.СтатусыЗаявок"));
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ПараметрыФормы.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.СтатусыДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, конец

&НаКлиенте
Процедура ЗагрузитьПлановыеЛокацииСдачиКТК(Команда)
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗагрузикиПлановыеЛокацииСдачиКТК", ЭтаФорма);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаЗагрузкиПлановыеЛокацийСдачиКТК", , , ЭтаФорма.УникальныйИдентификатор, ,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузикиПлановыеЛокацииСдачиКТК(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	ДоступноРедактирование = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций();
		
	Если Не ДоступноРедактирование Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Запрещено изменять значение локации. При необходимости исправления локации обратитесь к ""%1""'"), Объект.Автор);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметр1) Тогда
		Модифицированность = Истина;
		Для Каждого СтруктураПодбора Из Параметр1 Цикл
			СтрокиУслуг = Объект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", СтруктураПодбора.НомерКТК));
			Для Каждого СтрокаУслуг Из СтрокиУслуг Цикл
				Если Не ЗначениеЗаполнено(СтрокаУслуг.ПеренесенВЗаявку) Тогда
					СтрокаУслуг.ПлановаяЛокацияСдачиКТК = СтруктураПодбора.ПлановаяЛокацияСдачиКТК;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКалькуляцию(Команда)
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатПодбораКалькуляций", ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка);
	ОткрытьФорму("Документ.Заявка.Форма.ФормаПодбораКалькуляцииПоПлановойЛокацииСдачиКТК", ПараметрыФормы, , ЭтаФорма.УникальныйИдентификатор, ,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура РезультатПодбораКалькуляций(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	Если Параметр1 <> Неопределено Тогда
		Для Каждого СтруктураРезультат Из Параметр1 Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("НомерКТК", СтруктураРезультат.НомерКТК);
			НайденныеСтроки = Объект.СоставУслуги.НайтиСтроки(Отбор);
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.Калькуляция = СтруктураРезультат.Калькуляция;
			КонецЦикла;
		КонецЦикла; 
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаСервере
Процедура ПроверитьПлановыеЛокацииНаНаличиеВКалькуляции()
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	МассивКалькуляций = Новый Массив;
	
	Для Каждого Строка Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(Строка.Калькуляция) Тогда
			МассивКалькуляций.Добавить(Строка.Калькуляция);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияСписокСтанцийНазначения.Станция КАК Станция,
	               |	КалькуляцияСписокСтанцийНазначения.Ссылка КАК Калькуляция
	               |ИЗ
	               |	Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	               |ГДЕ
	               |	КалькуляцияСписокСтанцийНазначения.Ссылка В(&Калькуляция)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДокументКалькуляция.Ссылка.Суша_ПунктНазначения,
	               |	ДокументКалькуляция.Ссылка
	               |ИЗ
	               |	Документ.Калькуляция КАК ДокументКалькуляция
	               |ГДЕ
	               |	ДокументКалькуляция.Ссылка В(&Калькуляция)";
	
	Запрос.УстановитьПараметр("Калькуляция", МассивКалькуляций);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = Новый Массив;
	
	Для Каждого Строка Из Объект.СоставУслуги Цикл
		Если ЗначениеЗаполнено(Строка.Калькуляция) 
				И ЗначениеЗаполнено(Строка.ПлановаяЛокацияСдачиКТК) 
				И Не ЗначениеЗаполнено(Строка.ПеренесенВЗаявку) Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Калькуляция", Строка.Калькуляция);
			Отбор.Вставить("Станция", Строка.ПлановаяЛокацияСдачиКТК);
			НайденныеСтроки = Выгрузка.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				МассивСтрок.Добавить(Строка.НомерСтроки);
				Строка.НеСовпадаетПлановаяЛокация = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	НомераСтрок = СтрСоединить(МассивСтрок, ", ");
	Если МассивСтрок.Количество() > 0 Тогда
		Текст = НСтр("ru = 'В строке " + НомераСтрок + ", калькуляции не соответствуют плановым локациям сдачи КТК. Необходимо или заменить калькуляцию или исправить план.локац.сдачи. Для подбора Калькуляции воспользуйтесь кнопкой ""Подобрать калькуляцию.""'");
		ОбщегоНазначения.СообщитьПользователю(Текст);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций()
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	Возврат ?(РольДоступна("ПолныеПрава") Или РольДоступна("dc_РедактированиеПлановыхЛокацийСдачиКТКВЗаявке"), Истина, Ложь);
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецФункции

&НаКлиенте
Процедура СоставУслугиПлановаяЛокацияСдачиКТКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	СтандартнаяОбработка = Ложь;
	
	ДоступноРедактирование = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций();

	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ДоступноРедактирование Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Запрещено изменять значение локации. При необходимости исправления локации обратитесь к ""%1""'"), Объект.Автор);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , 
									ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", ТекущиеДанные.НомерСтроки, "ПлановаяЛокацияСдачиКТК"), 
									"Объект");
		Возврат;
	Иначе
		МассивТиповЛокаций = Новый СписокЗначений;
		МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
		МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипЛокации", МассивТиповЛокаций);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыВыбораЛокации", ЭтаФорма);
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыВыбораЛокации(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если Параметр1 <> Неопределено Тогда
		ТекущиеДанные.ПлановаяЛокацияСдачиКТК = Параметр1;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПлановаяЛокацияСдачиКТКАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПлановаяЛокацияСдачиКТКОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставУслугиПлановаяЛокацияСдачиКТКОчистка(Элемент, СтандартнаяОбработка)
		// Евросиб US 99390 TA 108801 Рыбьяков К.А. 21.06.2025 ((
	СтандартнаяОбработка = Ложь;
	
	ДоступноРедактирование = ЕстьПравоРедактированияКалькуляцийИПлановыхЛокаций();

	ТекущиеДанные = Элементы.СоставУслуги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ДоступноРедактирование Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Запрещено изменять значение локации. При необходимости исправления локации обратитесь к ""%1""'"), Объект.Автор);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , 
									ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", ТекущиеДанные.НомерСтроки, "ПлановаяЛокацияСдачиКТК"), 
									"Объект");
		Возврат;
	Иначе
		ТекущиеДанные.ПлановаяЛокацияСдачиКТК = Неопределено;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.06.2025 ))
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, конец

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	// ДИТ ТА 112604 Дедуник Д.О. Начало: 24.07.2025
	ТранзитДляКлиента = ПолучитьТранзитДляКлиентаПокументаОснования();
	// ДИТ ТА 112604 Дедуник Д.О. Конец: 24.07.2025
КонецПроцедуры

//Евросиб Каблов 27.01.2026 #126739
&НаКлиенте
Процедура ВывестиСообщениеПоОтмененномуРейсу(Стр)
	
	Если Стр.РейсОтменен Тогда
		Если ЗначениеЗаполнено(Стр.ПричинаОтмены) Тогда
			ПричинаОтмены = СтрШаблон("(%1)", Стр.ПричинаОтмены);
		Иначе
			ПричинаОтмены = "";
		КонецЕсли;
		ТекстСообщения = СтрШаблон("Рейс %1 отменен на стороне DX%2. Требуется заменить рейс на действующий.", Стр.Рейс, ПричинаОтмены); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
	КонецЕсли;
			
КонецПроцедуры
