
&НаКлиенте
Перем ВыполняетсяЗакрытие;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контейнеры.Загрузить(Параметры.ДокументОбъект.Контейнеры.Выгрузить());
	ТранспортныеСредства.Загрузить(Параметры.ДокументОбъект.ТранспортныеСредства.Выгрузить());
	ПроставитьПризнакПривязки();	
	ТолькоНепривязанные = Истина;
	УстановитьОтборКТК();

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Процедура ПроверитьКорректностьПараметров(Отказ,ТранспортныеСредстваИмяТЧ)
	Если ТранспортныеСредстваИмяТЧ <> "ТранспортныеСредства" И ТранспортныеСредстваИмяТЧ <> "ТранспортныеСредстваПоследняяМиля" Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПроставитьПризнакПривязки();	
	Для Каждого ТекущаяСтрока Из ТранспортныеСредства Цикл
		ТекущаяСтрока.Привязан = ЗначениеЗаполнено(ТекущаяСтрока.Контейнер);		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборКТК()
	
	Элементы.ТранспортныеСредстваОтборТолькоНепривязанные.Пометка = ТолькоНепривязанные;
	
	Если ТолькоНепривязанные Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("Привязан", Ложь);
		Элементы.ТранспортныеСредства.ОтборСтрок = ОтборСтрок;
	Иначе
		Элементы.ТранспортныеСредства.ОтборСтрок = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвязатьСтроки(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Связать", Истина);
	
    СтрокиДляСвязиТС = ТранспортныеСредства.НайтиСтроки(ПараметрыОтбора);
			
		СтрокиДляСвязиКонтейнеры = Контейнеры.НайтиСтроки(ПараметрыОтбора);				
		Если СтрокиДляСвязиТС.Количество() = 0
			ИЛИ СтрокиДляСвязиКонтейнеры.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Не выбраны строки для связи");
			Возврат;
		КонецЕсли;					
		СтрокаТС = СтрокиДляСвязиТС[0];
		СтрокаКонтейнеры = СтрокиДляСвязиКонтейнеры[0];		
		СтрокаКонтейнер = СтрокаКонтейнеры.Контейнер;		
		// Если уже есть строки КТК с таким водителем, то нужно спросить о необходимости перепривязать водителя
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Контейнер", СтрокаКонтейнер);		
		СвязанныеСтроки = ТранспортныеСредства.НайтиСтроки(ПараметрыОтбора);	
		Если СвязанныеСтроки.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			
			ПараметрыПривязки = Новый Структура();
			ПараметрыПривязки.Вставить("СтрокаТС", 			СтрокаТС);
			ПараметрыПривязки.Вставить("Контейнер", 			СтрокаКонтейнеры.Контейнер);
			ПараметрыПривязки.Вставить("СвязанныеСтроки", 		СвязанныеСтроки);
			
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерепривязке", ЭтотОбъект, ПараметрыПривязки);
			ПоказатьВопрос(Оповещение, "Перепривязать данные по контейнеру " + СтрокаКонтейнеры.Контейнер + " к водителю " + СтрокаТС.ФИОВодителя  + " (" + СтрокаТС.РегНомерТС + ") " + "?" , Режим, 0);
		Иначе
			СтрокаТС.Контейнер = СтрокаКонтейнеры.Контейнер;
			СтрокаТС.Привязан = Истина;
		КонецЕсли;	

	
	УстановитьОтборКТК();
	
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерепривязке(Результат, ДопПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	// Уберем идентификатор водителя в ранее привязанных строках
	СвязанныеСтроки = ДопПараметры.СвязанныеСтроки;
	Для Каждого ТекущаяСтрока Из СвязанныеСтроки Цикл
		ТекущаяСтрока.Контейнер = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
		ТекущаяСтрока.Привязан = Ложь;
	КонецЦикла;	
	
	ДопПараметры.СтрокаТС.Контейнер = ДопПараметры.Контейнер;
	ДопПараметры.СтрокаТС.Привязан = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоНепривязанные(Команда)
	ТолькоНепривязанные = Не ТолькоНепривязанные;
	УстановитьОтборКТК();	
КонецПроцедуры

&НаСервере
Функция СтруктураВозвращаемыхДанных()
	
	СтруктураВозврата = Новый Структура;
	
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		
		СтруктураВозврата.Вставить(РеквизитФормы.Имя, ЭтотОбъект[РеквизитФормы.Имя]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ТранспортныеСредстваСвязатьПриИзменении(Элемент)
	
	// Для связки можно выбрать только одного водителя
	
	ТекущиеДанные = Элементы.ТранспортныеСредства.ТекущиеДанные;
	
	Если ТекущиеДанные.Связать Тогда
		Для Каждого ТекСтрока Из ТранспортныеСредства Цикл
			ТекСтрока.Связать = Ложь;
		КонецЦикла;
		ТекущиеДанные.Связать = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСвязатьПриИзменении(Элемент)
			
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	
	Если ТекущиеДанные.Связать Тогда
		Для Каждого ТекСтрока Из Контейнеры Цикл
			ТекСтрока.Связать = Ложь;
		КонецЦикла;
		ТекущиеДанные.Связать = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)	
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)	
	СохранитьПараметры = Истина;		
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ВыполняетсяЗакрытие И Модифицированность И Не СохранитьПараметры Тогда
		
		СохранитьПараметры = Ложь;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстПредупреждения = НСтр("ru = 'Привязка контейнеров была изменена. Перенести изменения?'");
		
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстПредупреждения);
		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыполняетсяЗакрытие = Истина;
	СохранитьПараметры  = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если СохранитьПараметры И Не ЗавершениеРаботы Тогда
		
		ОповеститьОВыборе(СтруктураВозвращаемыхДанных());
		
	КонецЕсли;
КонецПроцедуры


ВыполняетсяЗакрытие 			  = Ложь;