
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Запись.Договор = ПолучитьДанныеПоДоговору(Запись.Клиент);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоДоговору(Клиент)
	
	ДоговорКлиента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		ДоговорКлиента = ТЗ[0].Ссылка;
	КонецЕсли;
		
	Возврат ДоговорКлиента;
	
КонецФункции

