Процедура ЗафиксироватьИзменениеСтатусаОбъекта(ОбъектСсылка, НовыйСтатус, ИсточникУстановки = Неопределено, ЗаписьЦиклаДокумента = Истина, Комментарий = "",
												ПериодЗаписи = Неопределено) Экспорт

	НаборСтатусов = РегистрыСведений.СтатусыОбъектов.СоздатьНаборЗаписей();
	НаборСтатусов.Отбор.Объект.Установить(ОбъектСсылка);
	НаборСтатусов.Прочитать();
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	////Евросиб СубботинВ #107600 18.04.2025 Начало 
	//Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаявкаНаОплату") и НовыйСтатус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
	//	Если НаборСтатусов.Количество()> 0 Тогда
	//		ПоследняяЗапись = НаборСтатусов[НаборСтатусов.Количество()-1];
	//		Если ПоследняяЗапись.Статус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
	//			 ПоследняяЗапись.ЦиклРаботыСДокументом = ПоследняяЗапись.ЦиклРаботыСДокументом +1;
	//			 НаборСтатусов.Записать();
	//			 Возврат;
	//		 КонецЕсли;
	//	 КонецЕсли;
	//КонецЕсли;	 
	////Евросиб СубботинВ #107600 18.04.2025 Конец
	
	Если НаборСтатусов.Количество()> 0 Тогда
		ПоследняяЗапись = НаборСтатусов[НаборСтатусов.Количество()-1];
		ПоследнийСтатус = ПоследняяЗапись.Статус;
	Иначе
		ПоследняяЗапись = Неопределено;
		ПоследнийСтатус = Неопределено;
	КонецЕсли;
	
	Если НЕ ПоследняяЗапись = Неопределено
		и ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаявкаНаОплату")
		и НовыйСтатус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
		Если ПоследнийСтатус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
			ПоследняяЗапись.ЦиклРаботыСДокументом = ПоследняяЗапись.ЦиклРаботыСДокументом +1;
			НаборСтатусов.Записать();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	
	НС = НаборСтатусов.Добавить(); 
	НС.Объект 		= ОбъектСсылка;
	НС.Статус 		= НовыйСтатус;
	НС.Пользователь	= ?(ИсточникУстановки = Неопределено, Пользователи.ТекущийПользователь(), ИсточникУстановки);
	
	//Евросиб СубботинВ #128538 23.01.2026 Начло

	НС.СтатусПредыдущий = ?(ЗначениеЗаполнено(ПоследнийСтатус), ПоследнийСтатус, Неопределено);
	//Евросиб СубботинВ #128538 23.01.2026 Конец

	//Евросиб СубботинВ #89527 30.10.2024 Начало
	//Евросиб СубботинВ #107600 18.04.2025 Начало
	//СтруктураОтбора = Новый Структура("Объект",ОбъектСсылка);
	//Евросиб СубботинВ #107600 18.04.2025 Конец
	ТекущийЦикл = 1;
	Если ЗаписьЦиклаДокумента Тогда 
		//Евросиб СубботинВ #107600 18.04.2025 Начало //убрал лишний запрос
		//ПоследняяЗапись = РегистрыСведений.СтатусыОбъектов.СрезПоследних(ТекущаяДата(),СтруктураОтбора);
		//Если ПоследняяЗапись.Количество() > 0 Тогда
		//	Запись = ПоследняяЗапись[0];
		
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		//Если НаборСтатусов.Количество()> 0 Тогда
		//  Запись = НаборСтатусов[НаборСтатусов.Количество()-1];
		////Евросиб СубботинВ #107600 18.04.2025 Конец 
		//	Если Запись.Статус = Справочники.СтатусыДокументов.ОтклоненаВУПП или Запись.Статус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
		//		ТекущийЦикл = Запись.ЦиклРаботыСДокументом +1;
		//	Иначе
		//		ТекущийЦикл = Запись.ЦиклРаботыСДокументом; 
		//	КонецЕсли;  
		Если НЕ ПоследняяЗапись = Неопределено Тогда
			Если ПоследнийСтатус = Справочники.СтатусыДокументов.ОтклоненаВУПП или ПоследнийСтатус = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда
				ТекущийЦикл = ПоследняяЗапись.ЦиклРаботыСДокументом +1;
			Иначе
				ТекущийЦикл = ПоследняяЗапись.ЦиклРаботыСДокументом; 
			КонецЕсли;		
		//Евросиб СубботинВ #128538 23.01.2026 Конец

		КонецЕсли; 
	КонецЕсли;	
	НС.ЦиклРаботыСДокументом = ТекущийЦикл;
	НС.Комментарий = Комментарий; 
	//Евросиб СубботинВ #89527 30.10.2024 Конец
	
	//Евросиб СубботинВ #111466 04.07.2025 Начало
	//НС.Период= ТекущаяДата();
	Если ПериодЗаписи = Неопределено Тогда
		 ПериодЗаписи = ТекущаяДата();
	КонецЕсли;	 
	НС.Период = ПериодЗаписи;
	//Евросиб СубботинВ #111466 04.07.2025 Конец
	
	НаборСтатусов.Записать();
КонецПроцедуры

//Евросиб СубботинВ #103435 27.02.2025 Начало
Функция ПолучитьПоследнееЗначениеСтатуса(ОбъектСсылка) Экспорт
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	//Ответ = Новый Структура("Период,Объект,Статус,Пользователь,ЦиклРаботыСДокументом,Комментарий");
	Ответ = Новый Структура("Период, Объект, Статус, Пользователь, ЦиклРаботыСДокументом, Комментарий, СтатусПредыдущий");
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Период КАК Период,
		|	СтатусыОбъектовСрезПоследних.Объект КАК Объект,
		|	СтатусыОбъектовСрезПоследних.Статус КАК Статус,
		|	СтатусыОбъектовСрезПоследних.Пользователь КАК Пользователь,
		|	СтатусыОбъектовСрезПоследних.ЦиклРаботыСДокументом КАК ЦиклРаботыСДокументом,
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		|	СтатусыОбъектовСрезПоследних.СтатусПредыдущий КАК СтатусПредыдущий,
		//Евросиб СубботинВ # 12853823.01.2026 Конец
		|	СтатусыОбъектовСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект = &Объект) КАК СтатусыОбъектовСрезПоследних";
	
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
	 	ЗаполнитьЗначенияСвойств(Ответ,ВыборкаДетальныеЗаписи);	
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции	

//Евросиб СубботинВ #103435 27.02.2025 Конец 

//Евросиб СубботинВ #111466 09.06.2025 Начало
Функция ПроверитьНаличиеЗаписиСтатуса(СсылкаДокумента, ДатаСостояния, ФиксируемыйСтатус)Экспорт
	
	Результат = Ложь;
	НаборСтатусов = РегистрыСведений.СтатусыОбъектов.СоздатьНаборЗаписей();
	НаборСтатусов.Отбор.Объект.Установить(СсылкаДокумента); 
	НаборСтатусов.Прочитать();
	
	Для Каждого СтрокаСтатуса из НаборСтатусов Цикл
		Если СтрокаСтатуса.Период = ДатаСостояния и СтрокаСтатуса.Статус = ФиксируемыйСтатус Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции
//Евросиб СубботинВ #111466 09.06.2025 Конец


//Евросиб СубботинВ #128763 04.02.2026 Начало
Процедура ЗафиксироватьМассивСтатусов(МассивСтрокСтатусов, ОбъектСсылка) Экспорт
	
	НаборСтатусов = РегистрыСведений.СтатусыОбъектов.СоздатьНаборЗаписей();
	НаборСтатусов.Отбор.Объект.Установить(ОбъектСсылка);
	НаборСтатусов.Прочитать();
	Если НаборСтатусов.Количество()>0 Тогда
		ТекущийЦикл	= НаборСтатусов[НаборСтатусов.Количество()-1].ЦиклРаботыСДокументом;
	Иначе
		ТекущийЦикл = 1; 
	КонецЕсли;
	Для Каждого СтрокаСтатуса из МассивСтрокСтатусов Цикл		
		СтатусУжеЗаписан = Ложь;
		Для Каждого СтрокаСтатусаНабора из НаборСтатусов Цикл 
			Если СтрокаСтатуса.Период = СтрокаСтатусаНабора.Период и СтрокаСтатуса.Статус = СтрокаСтатусаНабора.Статус Тогда 
				СтатусУжеЗаписан = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если НЕ СтатусУжеЗаписан Тогда
			//Если НомерСтроки = 1 и НаборСтатусов.Количество()>0 Тогда
			//	СтатусПредыдущий = НаборСтатусов[НаборСтатусов.Количество()-1].Статус;
			//ИначеЕсли НЕ НомерСтроки = 1 Тогда 
			//	СтатусПредыдущий = ПредыдущийСтатусДляЗаполнения;
			//КонецЕсли;
			Если НаборСтатусов.Количество()>0 Тогда
				СтатусПредыдущий = НаборСтатусов[НаборСтатусов.Количество()-1].Статус;
			Иначе 
				СтатусПредыдущий = Неопределено;
			КонецЕсли;
			
			НС = НаборСтатусов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаСтатуса);
			НС.СтатусПредыдущий = СтатусПредыдущий;
			
			Если СтатусПредыдущий = Справочники.СтатусыДокументов.ОтклоненаВУПП
				или СтатусПредыдущий = Справочники.СтатусыДокументов.ЗаявкаОплачена Тогда				
				ТекущийЦикл = ТекущийЦикл +1
			КонецЕсли; 
			
			НС.ЦиклРаботыСДокументом = ТекущийЦикл;
			
			Если СтрокаСтатуса.НеобходимоИзменениеПризнакаАктивности Тогда
				Документы.РеестрПлатежей.ИзменитьПризнакАктивностиЗаявкиВРеестрах(ОбъектСсылка, СтрокаСтатуса.Признак);
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	Попытка
		НаборСтатусов.Записать();
	Исключение
		   ЗаписьЖурналаРегистрации("Формирование записей по " + ОбъектСсылка , УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки
	
КонецПроцедуры
//Евросиб СубботинВ #128763 04.02.2026 Конец

