#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	// + Состояния
	ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	ЦветКнопки_Исходный = Элементы.СоставУслугиЗаполнятьСтрокиПоПервойСтроке.ЦветФона;
	ЦветКнопки_Выделенный = WebЦвета.Розовый;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	//Евросиб Коханенко Н.А. #61705 20.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 20.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 20.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 20.12.2022 )

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ОбновитьВидимостьПредупрежденияБлокировки();
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//ОбновитьСВВиТДТ_Сервер();
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	//Если Элементы.ГруппаОграничения.Видимость Тогда
	//	ОбновитьОграничения();
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнятьСтроки

&НаКлиенте
Процедура ЗаполнятьСтрокиПоПервойСтроке(Команда)
		
	ЗаполнятьПоПервойСтроке = НЕ ЗаполнятьПоПервойСтроке;
	// !!! Вставить свой алгоритм  по первой строке
	//Элементы.СоставУслугиЗаполнятьСтрокиПоПервойСтроке.ЦветФона = ?(ЗаполнятьПоПервойСтроке, ЦветКнопки_Выделенный, ЦветКнопки_Исходный);

КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
		// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры    

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда

		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		
		// !!! Разработать и вставить свою процедуру маршрутизации
		
		//РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗаявку(ПараметрыЗапроса, Объект.Дата);
		
		//Если РезультатЗапроса.Количество() > 0 Тогда
		//	Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		//Иначе
		//	Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		//КонецЕсли;
		
		ОбновитьПанельСостояний();
		
	КонецЕсли;
	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.ШаблонДокумента.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции
// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ


// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
		// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Объект.Состояния.Загрузить(СогласованиеСервер.ПолучитьДанныеПоСостояниямОбъектаИзБазы(Объект.Ссылка));
	
КонецПроцедуры 


//&НаКлиенте
//Процедура ОбновитьВидимостьПредупрежденияБлокировки()
//	
//	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
//		//Евросиб - АСуслов 09.11.2020 11:20:14 #
//		//(
//		//Рез = КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Объект.Контрагент, ТекущаяДата());
//		Рез = КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Объект.Контрагент, ТекущаяДата());
//		//)
//		//Евросиб - АСуслов 09.11.2020 11:20:15 #
//		Элементы.ПредупреждениеБлокировки.Видимость = Рез.ВСтопЛисте;
//		Элементы.ПредупреждениеБлокировки.Заголовок = "Контрагент находится в стоп-листе. Запись заявки запрещена. Добавлен " + Формат(Рез.Период, "ДФ=dd.MM.yy") + " " + Рез.Пользователь + " по причине: " + Рез.Комментарий;
//	Иначе
//		Элементы.ПредупреждениеБлокировки.Видимость = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры


