
//Евросиб Коханенко Н.А. 28.11.2022 (( #61705  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяФормы") Тогда
        ИмяРасшифровка = Параметры.ИмяФормы;
		ИмяРасшифровка = СтрРазделить(ИмяРасшифровка, ".");               
        ТипОбъекта = ИмяРасшифровка[0];
		НазваниеОбъекта = ИмяРасшифровка[1];       
		НазваниеФормы = ИмяРасшифровка[ИмяРасшифровка.Количество()-1];
	Иначе
        Если Параметры.Свойство("ТипОбъекта") Тогда
	        ТипОбъекта = Параметры.ТипОбъекта;
		Иначе
	        ТипОбъекта = "";
	    КонецЕсли;

		Если Параметры.Свойство("НазваниеОбъекта") Тогда
	        НазваниеОбъекта = Параметры.НазваниеОбъекта;
		Иначе
	        НазваниеОбъекта = "";
	    КонецЕсли;

		Если Параметры.Свойство("НазваниеФормы") Тогда
	        НазваниеФормы = Параметры.НазваниеФормы;
		Иначе
	        НазваниеФормы = "";
	    КонецЕсли;
    КонецЕсли;
	
	ЭтаФорма.Заголовок = ТипОбъекта+" "+НазваниеОбъекта+" ("+НазваниеФормы+")";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИнструкций.Наименование КАК Наименование,
		|	НастройкиИнструкцийАдреса.ИмяФормы КАК ИмяФормы,
		|	НастройкиИнструкцийАдреса.НазваниеИнструкции КАК НазваниеИнструкции,
		|	НастройкиИнструкцийАдреса.АдресИнструкции КАК АдресИнструкции,
		//Евросиб Коханенко Н.А. 12.04.2023 (( #68554 
		|	НастройкиИнструкцийАдреса.ЭтоРуководствоАдминистратора КАК ЭтоРуководствоАдминистратора,
		//Евросиб Коханенко Н.А. 12.04.2023 )) #68554 
		|	НастройкиИнструкцийАдреса.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.НастройкиИнструкций КАК НастройкиИнструкций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиИнструкций.Адреса КАК НастройкиИнструкцийАдреса
		|		ПО (НастройкиИнструкцийАдреса.Ссылка = НастройкиИнструкций.Ссылка)
		|ГДЕ
		|	НастройкиИнструкций.Наименование = &Наименование
		|	И НастройкиИнструкцийАдреса.ИмяФормы = &ИмяФормы
		//Евросиб Коханенко Н.А. 12.04.2023 (( #68554 
		|	И НЕ НастройкиИнструкцийАдреса.ЭтоРуководствоАдминистратора		
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоРуководствоАдминистратора,
		|	НазваниеИнструкции";
		//Евросиб Коханенко Н.А. 12.04.2023 )) #68554 

	Запрос.УстановитьПараметр("Наименование", НазваниеОбъекта);
	Запрос.УстановитьПараметр("ИмяФормы", НазваниеФормы);
	
	//Евросиб Коханенко Н.А. 12.04.2023 (( #68554 
	ЦветГиперссылкиКрасный = Новый Цвет(255,0,0);
	ТекущийПользовательВГруппеАдминистраторов = ПолучитьПринадлежностьКГруппеАдминистраторовНаСервере();
	Если ТекущийПользовательВГруппеАдминистраторов Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ НастройкиИнструкцийАдреса.ЭтоРуководствоАдминистратора", "");
	КонецЕсли;
	//Евросиб Коханенко Н.А. 12.04.2023 )) #68554 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ЭлементФормы = ЭтаФорма.Элементы.Добавить("СсылокНет", Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаГиперссылок); 
		ЭлементФормы.Заголовок = "Для данной формы инструкций не найдено."+Символы.ПС+
								 "Обратитесь за помощью в техническую поддержку.";
		Возврат;
	КонецЕсли;
	
	ПодменюИнструкции = Неопределено;
	НомерСсылки = 1;
	
	Пока Выборка.Следующий() Цикл       
		// Создадим гиперссылку и привяжем к ней команду
		ЭлементФормы = ЭтаФорма.Элементы.Добавить("Гиперссылка_"+Выборка.Наименование+"_"+Выборка.НомерСтроки, Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаГиперссылок); 
		ЭлементФормы.Гиперссылка = Истина;
		ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		ЭлементФормы.Заголовок = Выборка.НазваниеИнструкции;
		ЭлементФормы.Подсказка = Выборка.АдресИнструкции;
		ЭлементФормы.УстановитьДействие("Нажатие", "ПерейтиПоСсылке");
		//Евросиб Коханенко Н.А. 12.04.2023 (( #68554   
		Если ТекущийПользовательВГруппеАдминистраторов И Выборка.ЭтоРуководствоАдминистратора Тогда
			ЭлементФормы.ЦветТекста = ЦветГиперссылкиКрасный; 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 12.04.2023 )) #68554 
		НомерСсылки = НомерСсылки + 1;  
	КонецЦикла; 

КонецПроцедуры 

&НаКлиенте
Процедура ПерейтиПоСсылке(Объект);
    ЗапуститьПриложение(Объект.Подсказка);
КонецПроцедуры 
//Евросиб Коханенко Н.А. 28.11.2022 )) #61705

//Евросиб Коханенко Н.А. 12.04.2023 (( #68554 
&НаСервере
Функция ПолучитьПринадлежностьКГруппеАдминистраторовНаСервере();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей КАК ГруппыПользователей
		|		ПО ГруппыПользователейСостав.Ссылка = ГруппыПользователей.Ссылка
		|ГДЕ
		|	ГруппыПользователей.Наименование = &Наименование
		|	И ГруппыПользователейСостав.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Наименование", "Администраторы");
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции
//Евросиб Коханенко Н.А. 12.04.2023 )) #68554 
