
&НаКлиенте
Процедура СнятьЗащиту(Команда)
	Элементы.ФормаОчиститьРегистр.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРегистр(Команда)
	ОчиститьРегистрНаСервере(ДатаОчистки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРегистрНаСервере(ДатаОчистки)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	э_ЛогиЭТРАН.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.э_ЛогиЭТРАН КАК э_ЛогиЭТРАН
	               |ГДЕ
	               |	э_ЛогиЭТРАН.Период < &ДатаОчистки";
	Запрос.УстановитьПараметр("ДатаОчистки", ДатаОчистки);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НЗ = РегистрыСведений.э_ЛогиЭТРАН.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Результат.Период);
		НЗ.Записать();
	КонецЦикла; 
	
КонецПроцедуры
