
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтзывСогласования(Команда)
	
	ПричинаОтзываСогласования = СокрЛП(ПричинаОтзываСогласования);
	Если Не ЗначениеЗаполнено(ПричинаОтзываСогласования) Тогда
		ПоказатьПредупреждение(, "Не указана причина отзыва согласования!");
		Возврат;
	КонецЕсли;
	
	Закрыть(ПричинаОтзываСогласования);
	
КонецПроцедуры
