
&НаКлиенте
Процедура ПоказатьАрхив(Команда)
	
	Элементы.СписокПоказатьАрхив.Пометка = НЕ Элементы.СписокПоказатьАрхив.Пометка;
	Если Элементы.СписокПоказатьАрхив.Пометка Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	ДокументСтокКонтейнеров.Ссылка КАК Ссылка,
		                      |	ДокументСтокКонтейнеров.ПометкаУдаления КАК ПометкаУдаления,
		                      |	ДокументСтокКонтейнеров.Номер КАК Номер,
		                      |	ДокументСтокКонтейнеров.Дата КАК Дата,
		                      |	ДокументСтокКонтейнеров.Проведен КАК Проведен,
		                      |	ДокументСтокКонтейнеров.Сток КАК Сток,
		                      |	ДокументСтокКонтейнеров.КоличествоБНКонтейнеров КАК КоличествоБНКонтейнеров,
		                      |	ДокументСтокКонтейнеров.Автор КАК Автор,
		                      |	ДокументСтокКонтейнеров.Изменено КАК Изменено,
		                      |	ДокументСтокКонтейнеров.Редактор КАК Редактор,
		                      |	ДокументСтокКонтейнеров.Создано КАК Создано,
		                      |	ДокументСтокКонтейнеров.Комментарий КАК Комментарий,
		                      |	ДокументСтокКонтейнеров.КоличествоКонтейнеров КАК КоличествоКонтейнеров,
		                      |	ДокументСтокКонтейнеров.КоличествоКонтейнеровВсего КАК КоличествоКонтейнеровВсего,
		                      |	ДокументСтокКонтейнеров.МоментВремени КАК МоментВремени
		                      |ИЗ
		                      |	Документ.СтокКонтейнеров КАК ДокументСтокКонтейнеров";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДанныеПоСтокуПриИзменении(Элемент)
	
	ТекД = Элементы.СписокСтоков.ТекущиеДанные;
	
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Если ТекД.Свойство("Ссылка") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Сток", ?(ТолькоДанныеПоСтоку И ТекД <> неопределено, ТекД.Ссылка, ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка")));
	КонецЕсли;
	
	// остатки по стокам
	ОтборРегион = неопределено;
	Если ТекД.Свойство("Ссылка") Тогда
		ОтборРегион = ТекД.Ссылка;
	ИначеЕсли ТекД.Свойство("ГруппировкаСтроки") Тогда
		ОтборРегион = ТекД.ГруппировкаСтроки.Ключ;
	КонецЕсли;
	
	ОстаткиКТКПоСтокам.Параметры.УстановитьЗначениеПараметра("СтокВыбр", ОтборРегион);
	ОстаткиКТКПоСтокам.Параметры.УстановитьЗначениеПараметра("СтоНеОграничен", НЕ ТолькоДанныеПоСтоку);
	
	//ОтборРегион = неопределено;
	//Если ТекД.Свойство("Ссылка") Тогда
	//	ОтборРегион = ТекД.Ссылка;
	//ИначеЕсли ТекД.Свойство("ГруппировкаСтроки") Тогда
	//	ОтборРегион = ТекД.ГруппировкаСтроки.Ключ;
	//КонецЕсли;
	//МассивЛокаций = ПолучитьВсеПодчиненные(ОтборРегион);
	//
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеПодчиненные(Локация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И НЕ Локации.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Локация);
	Возврат Запрос.Выполнить().Выгрузить("Ссылка");
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Сток", ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка"));
	ОстаткиКТКПоСтокам.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	КТКНаПодходе.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	ОстаткиКТКПоСтокам.Параметры.УстановитьЗначениеПараметра("СтоНеОграничен", НЕ ТолькоДанныеПоСтоку);
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ДобавитьСток(Команда)
	
	ТекД = Элементы.СписокСтоков.ТекущиеДанные;
	ОтборРегион = неопределено;
	Если ТекД.Свойство("Ссылка") Тогда
		ОтборРегион = ТекД.Ссылка;
	ИначеЕсли ТекД.Свойство("ГруппировкаСтроки") Тогда
		ОтборРегион = ТекД.ГруппировкаСтроки.Ключ;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Локации.ФормаОбъекта", Новый Структура("НовыйСток, Родитель", Истина, ОтборРегион));
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиКТКПоСтокамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Док = НайтиПоследнийДокПоСтоку(Элемент.ТекущиеДанные.Сток);
	ПоказатьЗначение(,Док);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиПоследнийДокПоСтоку(Сток)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СтокКонтейнеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СтокКонтейнеров КАК СтокКонтейнеров
	               |ГДЕ
	               |	НЕ СтокКонтейнеров.ПометкаУдаления
	               |	И СтокКонтейнеров.Сток = &Сток
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтокКонтейнеров.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сток", Сток);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьДанныеСтоков" Тогда
		Элементы.ОстаткиКТКПоСтокам.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрОстатковСписком(Команда)
	
	АдресВХР = ПоместитьПустуюТаблицуВХранилище(ЭтаФорма.УникальныйИдентификатор);
	ПараметрыСтруктура = Новый Структура("КТКВХранилище", АдресВХР);
	ОткрытьФорму("Документ.СтокКонтейнеров.Форма.ФормаПодбораКТИзСтоков", ПараметрыСтруктура,,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьПустуюТаблицуВХранилище(ГУИД)
	
	ТЧ = Новый ТаблицаЗначений;
	ТЧ.Колонки.Добавить("НомерКТК", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТЧ.Колонки.Добавить("ПунктОтправления", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЧ.Колонки.Добавить("ПунктНазначения", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЧ.Колонки.Добавить("ВладелецКТК", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЧ.Колонки.Добавить("ТипКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	
	Возврат ПоместитьВоВременноеХранилище(ТЧ, ГУИД);
	
КонецФункции


&НаКлиенте
Процедура ОткрытьЗаявку(Команда)
	
	ТекД = Элементы.КТКНаПодходе.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ПоказатьЗначение(, ТекД.Заявка);
	КонецЕсли;
	
КонецПроцедуры

