
#Область ПеренесеноИзМодуля_УдалениеКТКИзСделки_Клиент
Процедура ИсключитьКТКИзСделкиV2_Сделка_Нажатие(ЭтаФорма) Экспорт
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Стр.БезЖДН = Ложь;
	КонецЦикла;
	
	Элемент_КнопкаОК = ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКИзСделкиОК;
	Элемент_КнопкаИсключить = ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКИзСделки;
	
	Если Элемент_КнопкаОК.Видимость = Истина Тогда
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницБезЖДН.Видимость = Ложь;
		Элемент_КнопкаОК.Видимость = Ложь;
		Элемент_КнопкаИсключить.Заголовок = "Исключить КТК из сделки";
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКУстановитьВсе.Видимость = Ложь;
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКСнятьВсе.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницБезЖДН.Видимость = Истина;
		Элемент_КнопкаОК.Видимость = Истина;
		Элемент_КнопкаИсключить.Заголовок = "Исключить КТК из сделки (отмена)";
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКУстановитьВсе.Видимость = Истина;
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКСнятьВсе.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсключитьКТКИзСделкиV2_ОК_Сделка_Нажатие(ЭтаФорма) Экспорт
	
	Договор = неопределено;
	МассивУникальныхЗаявок = Новый Массив;
	
	// Евросиб Фролов (15.04.2022 Task №48577
	Для Каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина И Стр.ГотовоКВыставлению Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Ошибка: для КТК %1 в строке %2 установлен признак ""Готово к выставлению"". Нельзя переносить КТК, которые отмечены как готовые к выставлению", Стр.Контейнер, Стр.НомерСтроки));
			Стр.БезЖДН = Ложь;
		КонецЕсли;	
	КонецЦикла;
	// Евросиб Фролов)
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
		Если Стр.БезЖДН = Истина Тогда
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
			//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало (реквизит СформированыЗакрывающиеДокументы учитывает корректировки в Доходах)
			Если Стр.СформированыЗакрывающиеДокументы Тогда
			//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка: для исключения КТК %1 по строке %2 требуется скорректировать сформированный учетный документ", Стр.Контейнер, Стр.НомерСтроки));
				Стр.БезЖДН = Ложь;
				Продолжить;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(Стр.Заявка) Тогда
				//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
				Стр.БезЖДН = Ложь;
				//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
				Сообщить("Ошибка: в строке " + Стр.НомерСтроки + " по КТК " + Стр.Контейнер + " отсутствует заявка!");
				Продолжить;
			КонецЕсли;
			//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
			Если МассивУникальныхЗаявок.Найти(Стр.Заявка) = неопределено Тогда
				МассивУникальныхЗаявок.Добавить(Стр.Заявка);
			КонецЕсли;
			//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
			Договор = Стр.Договор;
		КонецЕсли;
	КонецЦикла;
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	Если МассивУникальныхЗаявок.Количество() > 1 Тогда
		ПоказатьПредупреждение(, "Разрешено выбирать КТК только из одной заявки!");
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	МассивСтрокИсключаемыхКТК = ЭтаФорма.Объект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("БезЖДН", Истина));
	Если МассивУникальныхЗаявок.Количество() = 0 
		ИЛИ МассивСтрокИсключаемыхКТК.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Не выбраны строки для исключения КТК из заявок!");
	   	Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 16.04.2024 ( #68187
	КлючиАналитикиПеревозки = Новый Массив;
	Для Каждого Стр Из МассивСтрокИсключаемыхКТК Цикл
		Если ЗначениеЗаполнено(Стр.Заявка) И ЗначениеЗаполнено(Стр.ГУИДСтрокиЗаявки) Тогда
			КлючиАналитикиПеревозки.Добавить(Новый Структура("Заявка, ГУИДСтрокиЗаявки", Стр.Заявка, Стр.ГУИДСтрокиЗаявки));
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КлючиАналитикиПеревозки) Тогда
		
		//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
		//НомераКонтейнеровСНезакрытымСНП = УдалениеКТКИзСделки_Сервер.ПолучитьНомераКонтейнеровСНезакрытымСНП(КлючиАналитикиПеревозки);
		НомераКонтейнеровСНезакрытымСНП = ПереносКТКСервер.ПолучитьНомераКонтейнеровСНезакрытымСНП(КлючиАналитикиПеревозки);
		//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
		
		Если ЗначениеЗаполнено(НомераКонтейнеровСНезакрытымСНП) Тогда
			ШаблонСообщения = "По КТК № %1 не закрыто СНП. Заполните дату окончания пользования КТК в АРМ СНП.";
			ТекстНомераКонтейнеров = СтрСоединить(НомераКонтейнеровСНезакрытымСНП, ", ");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстНомераКонтейнеров);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ПоказатьПредупреждение(, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 16.04.2024 )
																													
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСтрокИсключаемыхКТК", МассивСтрокИсключаемыхКТК);
	ДополнительныеПараметры.Вставить("ЭтаФорма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("Договор", Договор);
	ДополнительныеПараметры.Вставить("МассивУникальныхЗаявок", МассивУникальныхЗаявок);
	ОпОп = Новый ОписаниеОповещения("ПодтверждениеИсключенияКТКИзСделки", ПереносКТККлиент, ДополнительныеПараметры);
	ПоказатьВопрос(ОпОп, "Выбранные контейнеры будут исключены из сделки. Сделка будет автоматически записана. Продолжить?", РежимДиалогаВопрос.ДаНет);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
КонецПроцедуры  

Процедура ПодтверждениеИсключенияКТКИзСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;

	МассивДляСпискаКТК = Новый Массив;
	Для каждого СтрокаИсключаемыхКТК Из П2.МассивСтрокИсключаемыхКТК Цикл 
		//Евросиб Коханенко Н.А. 02.07.2024 (( #83866
		//МассивДляСпискаКТК.Добавить(СтрокаИсключаемыхКТК.Контейнер);
		МассивДляСпискаКТК.Добавить("" + ?(ЗначениеЗаполнено(СтрокаИсключаемыхКТК.Контейнер), СтрокаИсключаемыхКТК.Контейнер, "б/н"));
		//Евросиб Коханенко Н.А. 02.07.2024 )) #83866
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. 02.07.2024 (( #83866
	//СписокКТК = СтрСоединить(МассивДляСпискаКТК, "; ");
	//ТекстВопроса = СтрШаблон("Указанные КТК будут удалены из сделки (%1). Выберите способ удаления:",СписокКТК);
	СписокКТК = СтрСоединить(МассивДляСпискаКТК, ", ");
	ТекстВопроса = СтрШаблон("Указанные КТК будут удалены из сделки (%1)." + Символы.ПС + "Выберите способ удаления:", СписокКТК);
	//Евросиб Коханенко Н.А. 02.07.2024 )) #83866

	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	ОпОп = Новый ОписаниеОповещения("РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие", ПереносКТККлиент, П2);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
	//ОткрытьФорму("Документ.Сделка.Форма.ФормаИсключенияКТКИзСделки", Новый Структура("ТекстВопроса, ЭтаФормаЪ, Договор", ТекстВопроса, П2.ЭтаФорма.УникальныйИдентификатор, П2.Договор),П2.ЭтаФорма,П2.ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("ОбщаяФорма.ФормаПереносаКТК", 
				Новый Структура("ТекстВопроса, ЭтаФорма, Договор, РежимПереносаКТК", ТекстВопроса, П2.ЭтаФорма.УникальныйИдентификатор, П2.Договор, 0),
				П2.ЭтаФорма, П2.ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
КонецПроцедуры

Процедура РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено ИЛИ П1.ВыбраннаяЗаявка = Ложь Тогда 
		Возврат;
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866
	ИначеЕсли ТипЗнч(П2.ЭтаФорма.Объект.Ссылка)=Тип("ДокументСсылка.Заявка") Тогда 
		Оповестить("ОповещениеОПереносеКТКвДругуюЗаявку", П1.ВыбраннаяЗаявка, П1.ЭтаФормаЪ);
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	Иначе
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
		СтруктураДанныеПоЗапрещеннымДляПересчета = ПереносКТКСервер.ПолучитьДанныеПоЗапрещеннымДляПереноса(П2.ЭтаФорма.Объект, П2.МассивУникальныхЗаявок);
		МассивДобавленоИзАкцепта = СтруктураДанныеПоЗапрещеннымДляПересчета.МассивДобавленоИзАкцепта;
		МассивОбъединениеПорожнейИГруженойСделок = СтруктураДанныеПоЗапрещеннымДляПересчета.МассивОбъединениеПорожнейИГруженойСделок;
		Если МассивДобавленоИзАкцепта.Количество()>0 ИЛИ МассивОбъединениеПорожнейИГруженойСделок.Количество()>0 Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("МассивОбъединениеПорожнейИГруженойСделок",МассивОбъединениеПорожнейИГруженойСделок);
			ДополнительныеПараметры.Вставить("МассивДобавленоИзАкцепта",МассивДобавленоИзАкцепта);
			ДополнительныеПараметры.Вставить("МассивСтрокИсключаемыхКТК",П2.МассивСтрокИсключаемыхКТК);
			ДополнительныеПараметры.Вставить("ЭтаФорма",П2.ЭтаФорма);
			ДополнительныеПараметры.Вставить("Договор",П2.Договор);
			ДополнительныеПараметры.Вставить("ВыбраннаяЗаявка",П1.ВыбраннаяЗаявка);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеОтвязкиОбъединенныхСделокИОтключенияРасходовДляИсключенияКТК", ПереносКТККлиент, ДополнительныеПараметры);
			ТекстВопроса = "Будут разъединены порожние/груженые сделки, продолжить?";
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе	
			Оповестить("ОповещениеОбИсключенииКТКИзСделки", П1.ВыбраннаяЗаявка, П1.ЭтаФормаЪ);
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
Процедура ПодтверждениеОтвязкиОбъединенныхСделокИОтключенияРасходовДляИсключенияКТК(П1 = неопределено, П2 = неопределено) Экспорт
	Если П1 <> КодВозвратаДиалога.Да тогда Возврат; КонецЕсли;
	
	ДополнительныеПараметры = П2;
	ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
	
	//ОТВЯЗКА РАСХОДОВ ИЗ АКЦЕПТОВ И РАЗЪЕДИНЕНИЕ СДЕЛОК
	ДополнительныеПараметрыДляОбработки = Новый Структура;
	ДополнительныеПараметрыДляОбработки.Вставить("МассивДобавленоИзАкцепта", ДополнительныеПараметры.МассивДобавленоИзАкцепта);
	ДополнительныеПараметрыДляОбработки.Вставить("МассивОбъединениеПорожнейИГруженойСделок", Новый Массив);
	//для случая переноса КТК в другую Сделку разъединять Сделки не нужно, расходы будут перенесены в другую сделку
	Если НЕ ТипЗнч(ДополнительныеПараметры.ВыбраннаяЗаявка) = Тип("ДокументСсылка.Сделка") Тогда
		ДополнительныеПараметрыДляОбработки.Вставить("МассивОбъединениеПорожнейИГруженойСделок", ДополнительныеПараметры.МассивОбъединениеПорожнейИГруженойСделок);
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
	//СтруктураРезультата = УдалениеКТКИзСделки_Сервер.ВыполнитьОтключениеРасходовИзАкцептаИВыполнитьРазъединение(ЭтаФорма.Объект, ДополнительныеПараметрыДляОбработки);
	СтруктураРезультата = ПереносКТКСервер.ВыполнитьОтключениеРасходовИзАкцептаИВыполнитьРазъединение(ЭтаФорма.Объект, ДополнительныеПараметрыДляОбработки);
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	
	ТребуетсяПеречитатьФормуСделки = Ложь;
	
	ОчиститьСообщения();
	//Если СтруктураРезультата.ЕстьРезультатОтключенияРасходов <> Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураРезультата.РезультатОтключения);
	//	ТребуетсяПеречитатьФормуСделки = Истина;
	//КонецЕсли;
	
	Если СтруктураРезультата.ЕстьРезультатРазъединенияСделок <> Неопределено Тогда
		Если СтруктураРезультата.ЕстьРезультатРазъединенияСделок Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операция разъединения выполнена. Список разъединенных сделок:");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураРезультата.СписокСделок); 
			ТребуетсяПеречитатьФормуСделки = Истина;
		ИначеЕсли НЕ СтруктураРезультата.ЕстьРезультатРазъединенияСделок Тогда
			ПоказатьПредупреждение(,"Не удалось выполнить разъединение: "+СтруктураРезультата.РезультатРазъединения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяПеречитатьФормуСделки Тогда
		Оповестить("ПеречитатьФормуСделки", Истина, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	Оповестить("ОповещениеОбИсключенииКТКИзСделки", ДополнительныеПараметры.ВыбраннаяЗаявка, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец

Процедура ОбработкаОповещенияОбИсключенииКТКИзСделки_Сделка_ФормаОбъекта_Оповещение(ЭтаФорма, ПараметрОповещения) Экспорт
	
	ПредыдущаяЗаявка = неопределено;
	МассивОтрабатываемыхКТК = Новый Массив;
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			ПредыдущаяЗаявка = Стр.Заявка;
			МассивОтрабатываемыхКТК.Добавить(Стр.Контейнер);
		КонецЕсли;
	КонецЦикла;
	
	РезЗаявка = неопределено;
	
	Если ПараметрОповещения = Истина Тогда
		// Перенести КТК в новую заявку
		//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
		//РезЗаявка = УдалениеКТКИзСделки_Сервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
		РезЗаявка = ПереносКТКСервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
		//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	ИначеЕсли ТипЗнч(ПараметрОповещения) = Тип("ДокументСсылка.Заявка") Тогда
		// Перенести КТК в существующую заявку
		//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
		//РезЗаявка = УдалениеКТКИзСделки_Сервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
		РезЗаявка = ПереносКТКСервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
		//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	КонецЕсли;
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			Стр.Удалена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//ЭтаФорма.Модифицированность = Истина;
	ЭтаФорма.Записать();
	
	ПоказатьЗначение(, РезЗаявка);
	
КонецПроцедуры

// Евросиб Фролов (15.04.2022 Task №48577
// Алгоритм процедуры перенесен из процедуры ИсключитьКТКИзСделкиV2_ок_Сделка_Нажатие этого модуля,
// т.к. проверка на наличие расходов нужна не всегда (если КТК переносится в сделку, то такая проверка не нужна).

Процедура ПроверитьИсключаемыеКТКНаНаличиеРасходов(ЭтаФорма, ЕстьРасходы) Экспорт
	
	МассивИдентификаторовДляПроверкиПривязанныхПТУ = Новый Массив;
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			МассивИдентификаторовДляПроверкиПривязанныхПТУ.Добавить(Стр.ГУИД);
		КонецЕсли;
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
	//ИдентификаторыСУЕ = УдалениеКТКИзСделки_Сервер.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ЭтаФорма.Объект);
	ИдентификаторыСУЕ = ПереносКТКСервер.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ЭтаФорма.Объект);
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если ИдентификаторыСУЕ.Найти(Стр.ГУИД) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Внимание: К исключаемому контейнеру %1 по строке %2 привязаны расходы.
																		|Необходимо обратиться в бэк-офис за удалением строк расходов", Стр.Контейнер, Стр.НомерСтроки));
			Стр.БезЖДН = Ложь;
			ЕстьРасходы = Истина;
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры
// Евросиб Фролов) 
#КонецОбласти

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
Процедура ПеренестиКТКвДругуюЗаявку_Заявка_Нажатие(ЭтаФорма) Экспорт
	
	Для каждого Стр из ЭтаФорма.Объект.СоставУслуги Цикл
		Стр.ПереносКТК = Ложь;
	КонецЦикла;
	
	Элемент_КнопкаОК = ЭтаФорма.Элементы.СоставУслугиПеренестиКТКвДругуюЗаявкуОК;
	Элемент_КнопкаПеренести = ЭтаФорма.Элементы.СоставУслугиПеренестиКТКвДругуюЗаявку;
	
	Если Элемент_КнопкаОК.Видимость = Истина Тогда
		
		ЭтаФорма.Элементы.СоставУслугиПереносКТК.Видимость = Ложь;
		Элемент_КнопкаОК.Видимость = Ложь;
		Элемент_КнопкаПеренести.Заголовок = "Перенести КТК в другую заявку";
		
		ЭтаФорма.Элементы.СоставУслугиПереносКТКУстановитьВсе.Видимость = Ложь;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКСнятьВсе.Видимость = Ложь;
		
		//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
		ЭтаФорма.Элементы.СоставУслугиФильтрПоКТК.Видимость = Ложь;
		//Евросиб Коханенко Н.А. 12.09.2024 )) #89738 
	Иначе
		
		ЭтаФорма.Элементы.СоставУслугиПереносКТК.Видимость = Истина;
		Элемент_КнопкаОК.Видимость = Истина;
		Элемент_КнопкаПеренести.Заголовок = "Отменить перенос КТК в другую заявку";
		
		ЭтаФорма.Элементы.СоставУслугиПереносКТКУстановитьВсе.Видимость = Истина;
		ЭтаФорма.Элементы.СоставУслугиПереносКТКСнятьВсе.Видимость = Истина;
		
		//Евросиб Коханенко Н.А. 12.09.2024 (( #89738 
		ЭтаФорма.Элементы.СоставУслугиФильтрПоКТК.Видимость = Истина;
		//Евросиб Коханенко Н.А. 12.09.2024 )) #89738 
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 16.05.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
Процедура ПеренестиКТКвДругуюЗаявку_ОК_Заявка_Нажатие(ЭтаФорма) Экспорт

	МассивУникальныхЗаявок = Новый Массив;
	МассивУникальныхЗаявок.Добавить(ЭтаФорма.Объект.Ссылка);
	
	МассивСтрокПереносимыхКТК = ЭтаФорма.Объект.СоставУслуги.НайтиСтроки(Новый Структура("ПереносКТК", Истина));
	
	//Евросиб Коханенко Н.А. 22.08.2024 (( #89741 
	////проверим на наличие сделок, в которые включена наша заявка и переносимые КТК
	////если контейнеры в сделке, то такие КТК не переносим, но сообщаем об их наличии
	//МассивКТК = Новый Массив;
	//Для Каждого СтрокаКТК из МассивСтрокПереносимыхКТК Цикл
	//	МассивКТК.Добавить(СтрокаКТК.НомерКТК); 	
	//КонецЦикла;      
	//МассивНомеровСделокИКТК = ПереносКТКСервер.ПолучитьМассивСделокИКТКПоЗаявкеИКТК(ЭтаФорма.Объект.Ссылка, МассивКТК);
	//Если МассивНомеровСделокИКТК.Количество() > 0 Тогда 
	//	СтрокаНомеровКТК = "";
	//	МассивСтрокНомеровОтмененныхКТК = Новый Массив;
	//	КоличествоСтрок = МассивСтрокПереносимыхКТК.Количество()-1;
	//	ИндексСтроки = КоличествоСтрок;
	//	Для Счетчик = 0 по КоличествоСтрок Цикл
	//    	СтрокаКТК = МассивСтрокПереносимыхКТК[ИндексСтроки];
	//		Для ИндексЭлемента = 0 По МассивНомеровСделокИКТК.ВГраница() Цикл
	//			Если МассивНомеровСделокИКТК[ИндексЭлемента].Контейнер = СтрокаКТК.НомерКТК Тогда
	//				//контейнер в сделке	
	//				МассивСтрокПереносимыхКТК[ИндексСтроки].ПереносКТК = Ложь;
	//				МассивСтрокПереносимыхКТК.Удалить(ИндексСтроки);
	//				МассивСтрокНомеровОтмененныхКТК.Добавить("" + ?(СтрокаКТК.НомерКТК = "", "б/н", СтрокаКТК.НомерКТК));
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//    	ИндексСтроки = ИндексСтроки - 1;
	//	КонецЦикла;
	//	СтрокаНомеровКТК = СтрСоединить(МассивСтрокНомеровОтмененныхКТК, ", ");
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Выполнение переноса для КТК (%1) невозможно по причине включения КТК в сделку: %2!", 
	//													СтрокаНомеровКТК, 
	//													МассивНомеровСделокИКТК[0].ПредставлениеСделки));

	НайденнаяСделка = ПереносКТКСервер.НайтиСвязаннуюСделку(ЭтаФорма.Объект.Ссылка);
    Если НайденнаяСделка <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Выполнение переноса невозможно по причине включения заявки в сделку: %1! Воспользуйтесь механизмом исключения КТК из Сделки", 
														НайденнаяСделка));
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 22.08.2024 )) #89741 
													
	Если МассивСтрокПереносимыхКТК.Количество() = 0 Тогда
		//нечего переносить
		//ПоказатьПредупреждение(, "Нет выбранных КТК, разрешенных для переноса!");
		Возврат;
	КонецЕсли;
	
	//проверка на закрытие СНП
	//скопировано из Процедуры ИсключитьКТКИзСделкиV2_ок_Сделка_Нажатие 
	КлючиАналитикиПеревозки = Новый Массив;
	Для Каждого Стр Из МассивСтрокПереносимыхКТК Цикл
		Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) И ЗначениеЗаполнено(Стр.ГУИДСтроки) Тогда
			КлючиАналитикиПеревозки.Добавить(Новый Структура("Заявка, ГУИДСтрокиЗаявки", ЭтаФорма.Объект.Ссылка, Стр.ГУИДСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КлючиАналитикиПеревозки) Тогда
		
		НомераКонтейнеровСНезакрытымСНП = ПереносКТКСервер.ПолучитьНомераКонтейнеровСНезакрытымСНП(КлючиАналитикиПеревозки);
		
		Если ЗначениеЗаполнено(НомераКонтейнеровСНезакрытымСНП) Тогда
			ШаблонСообщения = "По КТК № %1 не закрыто СНП. Заполните дату окончания пользования КТК в АРМ СНП.";
			ТекстНомераКонтейнеров = СтрСоединить(НомераКонтейнеровСНезакрытымСНП, ", ");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстНомераКонтейнеров);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ПоказатьПредупреждение(, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//конец проверки на закрытие СНП
																													
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСтрокПереносимыхКТК", МассивСтрокПереносимыхКТК);
	ДополнительныеПараметры.Вставить("ЭтаФорма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("Договор", ЭтаФорма.Объект.Договор);
	ДополнительныеПараметры.Вставить("МассивУникальныхЗаявок", МассивУникальныхЗаявок);
	ОпОп = Новый ОписаниеОповещения("ПодтверждениеПереносаКТКвДругуюЗаявку", ПереносКТККлиент, ДополнительныеПараметры);
	ПоказатьВопрос(ОпОп, "Выбранные контейнеры будут перенесены в другую заявку. Заявка будет автоматически записана. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры //Евросиб Коханенко Н.А. 05.06.2024 )) #83866

//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
Процедура ПодтверждениеПереносаКТКвДругуюЗаявку(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНомеровКТК = "";
	МассивСтрокНомеровКТК = Новый Массив;
	КоличествоБезномерныхКТК = 0;
	Для каждого СтрокаКТК Из П2.МассивСтрокПереносимыхКТК Цикл
		Если ЗначениеЗаполнено(СтрокаКТК.НомерКТК) Тогда
			МассивСтрокНомеровКТК.Добавить("" + СтрокаКТК.НомерКТК);
		Иначе
			КоличествоБезномерныхКТК = КоличествоБезномерныхКТК + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоБезномерныхКТК > 0 Тогда
		МассивСтрокНомеровКТК.Добавить("" + КоличествоБезномерныхКТК + " б/н");
	КонецЕсли;
	Если МассивСтрокНомеровКТК.Количество() > 0 Тогда
		СтрокаНомеровКТК = СтрСоединить(МассивСтрокНомеровКТК, ", ");
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон("Указанные КТК будут перенесены: (%1)." + Символы.ПС + "Выберите способ переноса:", СтрокаНомеровКТК);
	ОпОп = Новый ОписаниеОповещения("РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие", ПереносКТККлиент, П2);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПереносаКТК", 
					Новый Структура("ТекстВопроса, ЭтаФорма, Договор, РежимПереносаКТК", ТекстВопроса, П2.ЭтаФорма.УникальныйИдентификатор, П2.Договор, 1),
					П2.ЭтаФорма, П2.ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //Евросиб Коханенко Н.А. 05.06.2024 )) #83866
