//Евросиб Гудкова( 15.07.2020 Ticket№ 0197646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Отбор.Свойство("ПунктОтправления") Тогда
		Параметры.ПрограммныйОтбор = Истина;
		Параметры.ПолеОтбора = Новый ПолеКомпоновкиДанных("ПунктОтправления");
		Параметры.Отбор.Свойство("ПунктОтправления", Параметры.ЗначениеОтбора);
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.ПрограммныйОтбор = Истина Тогда
		ПрограммныеНастройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
		Для Каждого ЭлементНастроек Из ПрограммныеНастройки.Отбор.Элементы Цикл
			Если ЭлементНастроек.ЛевоеЗначение = Параметры.ПолеОтбора Тогда
				ПрограммныеНастройки.Отбор.Элементы.Удалить(ЭлементНастроек);
			КонецЕсли;
		КонецЦикла;
		//Евросиб Каблов (
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, Параметры.ПолеОтбора, Параметры.ЗначениеОтбора,,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		// Второй параметр ИмяПоля должен иметь тип "строка"
		// Последний параметр ИдентификаторПользовательскойНастройки оказался очень важен. Имеет тип Строка, поэтому поставил туда имя поля.
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, Строка(Параметры.ПолеОтбора), Параметры.ЗначениеОтбора,,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Строка(Параметры.ПолеОтбора));
		//Евросиб Каблов )
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Параметры.ПрограммныйОтбор = Истина Тогда
		Настройки = Список.КомпоновщикНастроек.Настройки;
		Для Каждого ЭлементНастроек Из Настройки.Отбор.Элементы Цикл
			Если ЭлементНастроек.ЛевоеЗначение = Параметры.ПолеОтбора Тогда
				Настройки.Отбор.Элементы.Удалить(ЭлементНастроек);
			КонецЕсли;
		КонецЦикла;
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Гудкова) 



