Процедура ПередЗаписью(Отказ)
	
	// Евросиб US 81781 Рыбьяков К.А. 25.06.2024 ((
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Документ, ВидДокумента");   
	
	// Евросиб(ДИТ) US 87349 ТА 87350 Сержантова А.С. Начало: 27.06.2024
	СтатусыСЗапретомОтвязки = Новый Массив;
	СтатусыСЗапретомОтвязки.Добавить("Требуется аннулирование");
	СтатусыСЗапретомОтвязки.Добавить("Ожидается аннулирование");
	Если не РольДоступна("ПолныеПрава") и 
			Не ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЗначениеЗаполнено(РеквизитыДокумента.Документ)
			И (ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			ИЛИ ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.КорректировкаПоступления")) 
			и СтатусыСЗапретомОтвязки.Найти(ЭтотОбъект.Статус) <> Неопределено Тогда 
		ОбщегоНазначения.СообщитьПользователю("Невозможно отвязать документ. Обратитесь к ответственному сотруднику",,,,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	// Евросиб(ДИТ) US 87349 ТА 87350 Сержантова А.С. Конец: 27.06.2024
	
	//УстановитьПривилегированныйРежим(Истина);
	//Если Не ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЗначениеЗаполнено(РеквизитыДокумента.Документ)
	//		И (ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
	//		ИЛИ ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.КорректировкаРеализации"))
	//		И РеквизитыДокумента.ВидДокумента = Справочники.Диадок_ДополнительныеСправочники.НайтиПоКоду("000000036") Тогда 
	//	ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	//	ЗаписьВРегистрДиадока.Документ = РеквизитыДокумента.Документ;
	//	ЗаписьВРегистрДиадока.Прочитать();
	//	Если ЗаписьВРегистрДиадока.Выбран() Тогда
	//		ЗаписьВРегистрДиадока.Удалить();
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЗначениеЗаполнено(РеквизитыДокумента.Документ)
	//		И ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.СчетФактураВыданный")
	//		И РеквизитыДокумента.ВидДокумента = Справочники.Диадок_ДополнительныеСправочники.НайтиПоКоду("000000040") Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ
	//	|ИЗ
	//	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	//	|ГДЕ
	//	|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", РеквизитыДокумента.Документ);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если Не РезультатЗапроса.Пустой() Тогда
	//		ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	//		
	//		ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	//		ЗаписьВРегистрДиадока.Документ = ТаблицаДетальныеЗаписи[0].Документ;
	//		ЗаписьВРегистрДиадока.Прочитать();
	//		Если ЗаписьВРегистрДиадока.Выбран() Тогда
	//			ЗаписьВРегистрДиадока.Удалить();
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;
	//УстановитьПривилегированныйРежим(Ложь);
	//// Евросиб Рыбьяков К.А. 25.06.2024 ))
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
	ЗаписатьИзмененияВРегистр_СостоянияДокументовВДиадоке("УдалитьЗапись");
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Парам = 1;
//Евросиб Гудкова( 18.05.2021 Ticket№ 0232455 упала загрузка с сервера Диадока
	////(Евросиб Максимова 05.04.2021 #0215189
	//Если ТипЗнч(ЭтотОбъект.Документ)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
	//	И ЭтотОбъект.Направление = "Входящее"
	//	И ЗначениеЗаполнено(ЭтотОбъект.Документ) // ЛВ- 17.05.2021
	//	И ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
	//	Если Не ЭтотОбъект.Документ.ПримененныйМаршрут.ЭДО Тогда
	//		ДокО = ЭтотОбъект.Документ.ПолучитьОбъект();
	//		Попытка	
	//			ПараметрыПТУ = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Штраф, Копия, ЦФО, Автор, Дата, Ссылка");
	//			ЗаполнитьЗначенияСвойств(ПараметрыПТУ, ДокО);
	//			Документы.ПоступлениеТоваровУслуг.МаршрутизироватьПТУ(ПараметрыПТУ.Ссылка, ПараметрыПТУ);
	//		Исключение
	//			ОО = ОписаниеОшибки();
	//			Сообщить("Ошибка при установке маршрута в ПТУ: "+ОО);
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	////)Евросиб Максимова 05.04.2021 #0215189
// Евросиб Гудкова) 	

	// SIV 10-02-21 добавить в документ новое состояние для Отказ в подписи или Запрос на аннулирование
	Если ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЭтотОбъект.Направление = "Входящее" И ЭтотОбъект.Статус = "Контрагент отказал в подписи" Тогда
		
		ДокО = ЭтотОбъект.Документ.ПолучитьОбъект();
		Попытка 
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Начало: 04.07.2024
			ЕстьТаблицаСостояний = Ложь;
			Для каждого СтрокаМетаданныхТЧ Из ДокО.Метаданные().ТабличныеЧасти Цикл
				Если СтрокаМетаданныхТЧ.Имя = "Состояния" Тогда
					ЕстьТаблицаСостояний = Истина;  
					Прервать;
				КонецЕсли;
			КонецЦикла; 
			Если ЕстьТаблицаСостояний Тогда
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Конец: 04.07.2024
			
	//Евросиб Литвинов 31.08.2021 ( Ticket#234570 #38209 
				// Проверим на наличие строки с тем же набором данных, т.к. недозволено иметь их несколько подобных
				лПараметрыОтбора = Новый Структура;
				лПараметрыОтбора.Вставить("Состояние", 	 Справочники.Состояния.ЗапросНаАннулирование);
				лПараметрыОтбора.Вставить("Исполнитель", ЭтотОбъект.Документ.Автор);
				лПараметрыОтбора.Вставить("Статус", 	 Перечисления.СтатусыЭтапов.НаВыполнение);
				лПараметрыОтбора.Вставить("Наблюдатель", ЭтотОбъект.Документ.Автор);
				найдСтроки = ДокО.Состояния.НайтиСтроки(лПараметрыОтбора);
				Если найдСтроки.Количество() Тогда
					Возврат;
				КонецЕсли;
	//Евросиб Литвинов 31.08.2021 ) Ticket#234570 #38209
				НСтр = ДокО.Состояния.Добавить();
				НСтр.Состояние = Справочники.Состояния.КонтрагентОтказалВПодписи;
				НСтр.Исполнитель = ЭтотОбъект.Документ.Автор;
				НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				НСтр.Наблюдатель = ЭтотОбъект.Документ.Автор;
				ДокО.Записать(); 
			
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Начало: 04.07.2024
			КонецЕсли;
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Конец: 04.07.2024
		Исключение
			ОО = ОписаниеОшибки();
			Сообщить("Ошибка постановки задачи исполнителю: "+ОО);
			Сообщить("Сообщите в техподдержку.");
		КонецПопытки;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЭтотОбъект.Направление = "Входящее" И ЭтотОбъект.Статус = "Требуется аннулирование" Тогда
		
		ДокО = ЭтотОбъект.Документ.ПолучитьОбъект();
		Попытка
			//НСтр = ДокО.Состояния.Добавить();   
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Начало: 04.07.2024
			ЕстьТаблицаСостояний = Ложь;
			Для каждого СтрокаМетаданныхТЧ Из ДокО.Метаданные().ТабличныеЧасти Цикл
				Если СтрокаМетаданныхТЧ.Имя = "Состояния" Тогда
					ЕстьТаблицаСостояний = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла; 
			Если ЕстьТаблицаСостояний Тогда
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Конец: 04.07.2024
				//ДИТ, Беляев СЮ, Ticket#0344965, 08-05-2024, начало (добавление аналогичной задачи приведёт к ошибке записи документа и в следствии откатится запись элемента справочника)
				Отбор = Новый Структура;
				Отбор.Вставить("Состояние",  Справочники.Состояния.ЗапросНаАннулирование);
				найдСтроки = ДокО.Состояния.НайтиСтроки(Отбор);
				Если найдСтроки.Количество() = 0 Тогда
					НСтр = ДокО.Состояния.Добавить();
				Иначе
					НСтр = найдСтроки[0];
				КонецЕсли;
				//ДИТ, Беляев СЮ, Ticket#0344965, 08-05-2024, конец
				НСтр.Состояние = Справочники.Состояния.ЗапросНаАннулирование;
				НСтр.Исполнитель = ЭтотОбъект.Документ.Автор;
				НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				НСтр.Наблюдатель = ЭтотОбъект.Документ.Автор;
				ДокО.Записать();      
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Начало: 04.07.2024
			КонецЕсли;
			// Евросиб(ДИТ) Ticket#0358072 Сержантова А.С. Конец: 04.07.2024
		Исключение
			ОО = ОписаниеОшибки();
			Сообщить("Ошибка постановки задачи исполнителю: "+ОО);
			Сообщить("Сообщите в техподдержку.");
		КонецПопытки;
		
	КонецЕсли;	

	//// МальцевАН 84965 08.05.2024
	//// 000000036 - Акт
	//// 000000040 - УПД
	////(
	//УстановитьПривилегированныйРежим(Истина);
	//Если ЗначениеЗаполнено(ЭтотОбъект.Документ) И (ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
	//		ИЛИ ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.КорректировкаРеализации"))
	//		И ЭтотОбъект.ВидДокумента = Справочники.Диадок_ДополнительныеСправочники.НайтиПоКоду("000000036") Тогда 
	//	ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	//	ЗаписьВРегистрДиадока.Документ = ЭтотОбъект.Документ;
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
	//		ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.Статус;
	//	Иначе 
	//		ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.ДополнительныйСтатус;
	//	КонецЕсли;
	//	ЗаписьВРегистрДиадока.ДатаОбновленияСостояния = ЭтотОбъект.ДатаЗагрузки;
	//	ЗаписьВРегистрДиадока.Записать();
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ЭтотОбъект.Документ) И ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.СчетФактураВыданный")
	//	И ЭтотОбъект.ВидДокумента = Справочники.Диадок_ДополнительныеСправочники.НайтиПоКоду("000000040") Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ
	//	|ИЗ
	//	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	//	|ГДЕ
	//	|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Документ);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	//		
	//		ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	//		ЗаписьВРегистрДиадока.Документ = ТаблицаДетальныеЗаписи[0].Документ;
	//		Если ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
	//			ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.Статус;
	//		Иначе 
	//			ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.ДополнительныйСтатус;
	//		КонецЕсли;
	//		ЗаписьВРегистрДиадока.ДатаОбновленияСостояния = ЭтотОбъект.ДатаЗагрузки;
	//		ЗаписьВРегистрДиадока.Записать();	
	//	КонецЕсли;	
	//КонецЕсли;
	//УстановитьПривилегированныйРежим(Ложь);
	////)
	//// МальцевАН 84965 08.05.2024
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
	ЗаписатьИзмененияВРегистр_СостоянияДокументовВДиадоке("ЗаписатьСтатус");
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
Функция ПолучитьДокументОснованияСчетаФактуры( вхДокумент )
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", вхДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Документ;
	КонецЕсли;
	
	Возврат Результат
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
Процедура УдалитьЗаписьВРегистре( вхДокумент )
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	ЗаписьВРегистрДиадока.Документ = вхДокумент;
	ЗаписьВРегистрДиадока.Прочитать();
	Если ЗаписьВРегистрДиадока.Выбран() Тогда
		//Евросиб Каблов 20.10.2025 ( Ticket#0418967
		//ЗаписьВРегистрДиадока.Удалить();
		//Евросиб Каблов 04.12.2025 ( #117141
		//Если ЗаписьВРегистрДиадока.ДатаОбновленияСостояния <= ЭтотОбъект.ДатаЗагрузки Тогда
		Если ЗаписьВРегистрДиадока.ДатаОбновленияСостояния <= ЭтотОбъект.ДатаЗагрузки И ЭтотОбъект.Статус <> "Документооборот завершен" Тогда
		//Евросиб Каблов 04.12.2025 )
			ЗаписьВРегистрДиадока.Удалить();
		КонецЕсли;
		//Евросиб Каблов 20.10.2025 )
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
Процедура ДобавитьЗаписьВРегистр( вхДокумент )
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьВРегистрДиадока = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	ЗаписьВРегистрДиадока.Документ = вхДокумент;
	//Евросиб Каблов 20.10.2025 ( Ticket#0418967
	ЗаписьВРегистрДиадока.Прочитать();
	Если ЗаписьВРегистрДиадока.Выбран() Тогда
		//Евросиб Каблов 04.12.2025 ( #117141
		//Если ЗаписьВРегистрДиадока.ДатаОбновленияСостояния > ЭтотОбъект.ДатаЗагрузки Тогда
		Если ЗаписьВРегистрДиадока.ДатаОбновленияСостояния > ЭтотОбъект.ДатаЗагрузки Или ЭтотОбъект.Статус = "Документооборот завершен" Тогда
		//Евросиб Каблов 04.12.2025 )
			Возврат;
		КонецЕсли;
	Иначе
		ЗаписьВРегистрДиадока.Документ = вхДокумент;
	КонецЕсли;
	//Евросиб Каблов 20.10.2025 )
	Если ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
		ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.Статус;
	Иначе 
		ЗаписьВРегистрДиадока.СостояниеДокументооборота = ЭтотОбъект.ДополнительныйСтатус;
	КонецЕсли;
	// Евросиб(ДИТ) US 96006 ТА 96007 Шевченко А.В. Начало: 02.12.2024
	ЗаписьВРегистрДиадока.СостояниеДокументооборотаДоп = ЭтотОбъект.ДополнительныйСтатус;
	// Евросиб(ДИТ) US 96006 ТА 96007 Шевченко А.В. Конец: 02.12.2024
	ЗаписьВРегистрДиадока.ДатаОбновленияСостояния = ЭтотОбъект.ДатаЗагрузки;
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
	ЗаписьВРегистрДиадока.ДатаДокумента = ЭтотОбъект.ДатаДокумента;
	ЗаписьВРегистрДиадока.Подписант = ЭтотОбъект.Подписант;
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
	//Евросиб Шевченко А.В. US 104900 TA 112049 27.06.2025
	ЗаписьВРегистрДиадока.ДатаПодписиКонтрагентом = ЭтотОбъект.ДатаПодписиКонтрагентом;
	//Евросиб Шевченко А.В. US 104900 TA 112049 27.06.2025
	ЗаписьВРегистрДиадока.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
Функция ЭтоСсылкаНаДокумент( вхСсылка )
	ТипСсылки = ТипЗнч(вхСсылка);
	Возврат Документы.ТипВсеСсылки().СодержитТип(ТипСсылки);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, начало
Процедура ЗаписатьИзмененияВРегистр_СостоянияДокументовВДиадоке( Действие )
	
	Если Действие = "УдалитьЗапись" Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Документ, ВидДокумента, Статус, ДополнительныйСтатус");
		
		Если НЕ ЗначениеЗаполнено(РеквизитыДокумента.ВидДокумента) Тогда
			Возврат;
		КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, начало
		Если НЕ ЗначениеЗаполнено(РеквизитыДокумента.Статус) И НЕ ЗначениеЗаполнено(РеквизитыДокумента.ДополнительныйСтатус) Тогда
			Возврат;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, конец
		
		//очищаем в слечае наличия настройки, очищать все нельзя, т.к. последним из пакета может быть записан элемент без включенной регистрации и не останется записи по документу
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.ВидДокумента, "РегистрироватьСостояниеВРегистре") Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыДокумента.Документ) Тогда
			
			Если ТипЗнч(РеквизитыДокумента.Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
				ДокументОснование = ПолучитьДокументОснованияСчетаФактуры(РеквизитыДокумента.Документ);
				Если ДокументОснование <> Неопределено Тогда
					УдалитьЗаписьВРегистре( ДокументОснование );
				КонецЕсли;
			Иначе
				УдалитьЗаписьВРегистре( РеквизитыДокумента.Документ );
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Действие = "ЗаписатьСтатус" Тогда
		
		//Евросиб(ДИТ), АлексеевАА, Ticket#0359057, 28-06-2024, Начало
		Если (ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) 
									ИЛИ (ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.КорректировкаПоступления")) Тогда
			Если ЭтотОбъект.Статус = "Аннулирован" Тогда
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Документ, "СтатусДокумента") <> Перечисления.СтатусыДокументовПоступлений.Аннулирован Тогда //Евросиб(ДИТ), Беляев СЮ, Ticket#0363342, 20-08-2024, исключим лишнюю запись документа
					УстановитьПривилегированныйРежим(Истина);
					ДокОбъект = ЭтотОбъект.Документ.ПолучитьОбъект();
					ДокОбъект.СтатусДокумента = Перечисления.СтатусыДокументовПоступлений.Аннулирован;
					ДокОбъект.Записать();
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
			КонецЕсли;
			// Евросиб Bug 90451 TA 90452 Рыбьяков К.А. 21.08.2024 ((
			ДобавитьЗаписьВРегистр(ЭтотОбъект.Документ);
			// Евросиб Рыбьяков К.А. 21.08.2024 ))
		КонецЕсли;
		//Евросиб(ДИТ), АлексеевАА, Ticket#0359057, 28-06-2024, Конец
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидДокумента) Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ВидДокумента, "РегистрироватьСостояниеВРегистре") Тогда //пишем в случае наличия настройки
			Возврат;
		КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, начало
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Статус) И НЕ ЗначениеЗаполнено(ЭтотОбъект.ДополнительныйСтатус) Тогда
			Возврат;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102843 / TA 104678, 19-05-2025, конец
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Документ) И ЭтоСсылкаНаДокумент( ЭтотОбъект.Документ ) Тогда
			
			Если ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
				ДокументОснование = ПолучитьДокументОснованияСчетаФактуры(ЭтотОбъект.Документ);
				Если ДокументОснование <> Неопределено Тогда
					ДобавитьЗаписьВРегистр( ДокументОснование );
				КонецЕсли;
			Иначе
				ДобавитьЗаписьВРегистр( ЭтотОбъект.Документ );
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, Ticket#0344893, 28-06-2024, конец
