Функция ПолучитьМассивАдресовЧерезГеокодерЯндекс(АдресПоиска, Знач НаселенныйПункт, Знач Родитель) Экспорт
	
	Соединение = УстановитьСоединениеСГеокодеромЯндекс();
	СтруктураРезультата = Новый Структура("СтруктураРезультатаЗапроса, МассивАдресов, ОписаниеОшибки", Неопределено, Новый Массив, "");
    
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
    КонецЕсли;	
	
	КлючAPIГеокодераЯндекс = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстантыСУчетомКонтекста("КлючAPIГеокодераЯндекс");
	Если НЕ ЗначениеЗаполнено(КлючAPIГеокодераЯндекс) Тогда
		ОписаниеОшибки = "Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку";
		//#Если Клиент Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		//#Иначе
		//	ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		//#КонецЕсли
		//Возврат Неопределено;     
		СтруктураРезультата.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураРезультата;
	КонецЕсли;
	ПараметрЗапросаАдрес = СокрЛП(СтрШаблон("%1 %2", НаселенныйПункт, АдресПоиска));
	//ТелоОтвета = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес);
	СтруктураРезультатаЗапроса = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес); 
	Если ЗначениеЗаполнено(СтруктураРезультатаЗапроса.ОписаниеОшибки) Тогда
		СтруктураРезультата.ОписаниеОшибки = СтруктураРезультатаЗапроса.ОписаниеОшибки;	
		#Если Клиент Тогда                                                                                                                                          
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		#КонецЕсли
		Возврат СтруктураРезультата;
	КонецЕсли;
	СтруктураРезультата.СтруктураРезультатаЗапроса = СтруктураРезультатаЗапроса;
	ТелоОтвета = СтруктураРезультатаЗапроса.ТелоОтвета;
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
    Результат = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть(); 
	Если Результат.Свойство("error") Тогда
		СтруктураРезультата.ОписаниеОшибки = СтрШаблон("Не удалось выполнить запрос геокодера Яндекс: %1", Результат.message);
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	КоличествоНайденныхРезультатов = Число(Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found);
	//Если ничего не нашли                                                                                                         
	МассивАдресов = Новый Массив;
	Если КоличествоНайденныхРезультатов = 0 Тогда
		//Возврат МассивАдресов;
		Возврат СтруктураРезультата;
	Иначе             
		Для каждого featureMember Из Результат.response.GeoObjectCollection.featureMember Цикл
			НайденНаселенныйПункт = Ложь;
			НайденРодитель = Ложь;
			НаселенныйПункт = "";
			
			СтруктураЛокацииПоГеокодеру = ПолучитьСтруктуруЛокации(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.Address.Components);
			Если Не ЗначениеЗаполнено(СтруктураЛокацииПоГеокодеру.НаселенныйПункт)
				ИЛИ Не ЗначениеЗаполнено(СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НаселенныйПункт = "" Тогда 
				//Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea")
				//	И featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.Свойство("SubAdministrativeArea") Тогда
				//	Если НЕ featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Свойство("Locality")
				//		ИЛИ (НЕ featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Locality.Свойство("LocalityName")
				//			И (НЕ featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Locality.Свойство("DependentLocality"))) Тогда
				//		Продолжить;
				//	КонецЕсли;
				//	Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Locality.Свойство("LocalityName") Тогда
				//		ИмяЛокации = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Locality.LocalityName;	
				//	Иначе
				//		ИмяЛокации = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.Locality.DependentLocality.DependentLocalityName;
				//	КонецЕсли;
				//	ЛокацияВышестоящегоУровня = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.AdministrativeAreaName;
				//	Страна = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName;
				//ИначеЕсли featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea")
				//	И featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.Свойство("Locality")
				//	И featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.Locality.Свойство("LocalityName") Тогда
				//	ИмяЛокации = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.Locality.LocalityName;
				//	ЛокацияВышестоящегоУровня = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.AdministrativeAreaName;
				//	Страна = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName; 
				//Иначе
				//	Продолжить;
				//КонецЕсли;
			
				Координаты = СтрРазделить(featureMember.GeoObject.Point.pos, " ");
				Долгота = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[0]);
				Широта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[1]);
				//СтруктураЛокации = ГеокодированиеСервер.НайтиЛокацию(ИмяЛокации, ЛокацияВышестоящегоУровня, Долгота, Широта);
				СтруктураЛокации = ГеокодированиеСервер.НайтиЛокацию(СтруктураЛокацииПоГеокодеру.НаселенныйПункт, СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня, Долгота, Широта);
																	 
				Если СтруктураЛокации = Неопределено Тогда
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("не найдена локация %1 для подбора адреса в справочнике «Локации»", ИмяЛокации));
					//Возврат Неопределено;
					//СтруктураПараметров = Новый Структура("Наименование, Регион, Страна, Широта, Долгота", ИмяЛокации, ЛокацияВышестоящегоУровня, Страна, 0, 0);
					//ЛокацияСсылка = ГеокодированиеСервер.НайтиДобавитьНаселенныйПункт(СтруктураПараметров);
					//ГеокодированиеСервер.ПолучитьКоординатыЛокацииЧерезГеокодер(ЛокацияСсылка);
					//СтруктураЛокации = ГеокодированиеСервер.НайтиЛокацию(ИмяЛокации, ЛокацияВышестоящегоУровня);\
					//НаселенныйПункт = ИмяЛокации;
					НаселенныйПункт = СтруктураЛокацииПоГеокодеру.НаселенныйПункт;
					//Родитель = ЛокацияВышестоящегоУровня;
					Родитель = СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня;
					НаселенныйПунктСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
				Иначе
					НаселенныйПункт = СтруктураЛокации.Наименование;
					Родитель = СтруктураЛокации.РодительНаименование;
					НаселенныйПунктСсылка = СтруктураЛокации.НаселенныйПунктСсылка;
				КонецЕсли;
			КонецЕсли;          
			КомпонентыАдреса = Новый Массив;
			Для каждого AddressComponent Из featureMember.GeoObject.metaDataProperty.GeocoderMetaData.Address.Components Цикл
				НаименованиеВГеокодере = СтрЗаменить(ВРег(AddressComponent.Name), "Ё","Е");    
				НаселенныйПунктВРег = ВРег(НаселенныйПункт);                            
				РодительВРег = ВРег(Родитель);
				НайденНаселенныйПункт = НайденНаселенныйПункт ИЛИ СтрНайти(НаименованиеВГеокодере, НаселенныйПунктВРег) > 0 ИЛИ СтрНайти(НаселенныйПунктВРег, НаименованиеВГеокодере) > 0;
				НайденРодитель = НайденРодитель ИЛИ СтрНайти(НаименованиеВГеокодере, РодительВРег) > 0 ИЛИ СтрНайти(РодительВРег, НаименованиеВГеокодере) > 0;
				//Если НайденНаселенныйПункт 
				//	И НайденРодитель Тогда
				//	Прервать;
				//КонецЕсли;   
				КомпонентыАдреса.Добавить(Новый Структура("ВидНайденногоТопонима, Имя", AddressComponent.kind, AddressComponent.name));
			КонецЦикла;
			Если Не НайденНаселенныйПункт ИЛИ Не НайденРодитель Тогда
				Продолжить;
			КонецЕсли;
			МассивАдресов.Добавить(Новый Структура("Адрес, Страна, Долгота, Широта, НаселенныйПунктСсылка, ЛокацияВышестоящегоУровня, НаселенныйПункт, КомпонентыАдреса",
													featureMember.GeoObject.metaDataProperty.GeocoderMetaData.text,
													СтруктураЛокацииПоГеокодеру.Страна,
													Долгота,
													Широта,
													НаселенныйПунктСсылка,
													СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня,
													НаселенныйПункт,
													КомпонентыАдреса));
		КонецЦикла;
	КонецЕсли;
	
	СтруктураРезультата.МассивАдресов = МассивАдресов;
	Возврат СтруктураРезультата;
	//Возврат МассивАдресов;
    
КонецФункции 

Функция ПолучитьМассивЖелезнодорожныхСтанцийЧерезГеокодерЯндекс(ЖДСтанцияНаименование, ЖДСтанцияЖДДорога, ЖДСтанцияСтрана, ЖДСтанцияСтранаКодАльфа2) Экспорт

	Соединение = УстановитьСоединениеСГеокодеромЯндекс();
    
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
    КонецЕсли;	
	КлючAPIГеокодераЯндекс = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстантыСУчетомКонтекста("КлючAPIГеокодераЯндекс");
	Если НЕ ЗначениеЗаполнено(КлючAPIГеокодераЯндекс) Тогда
		#Если Клиент Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку");
		#Иначе
			ОбщегоНазначения.СообщитьПользователю("Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ПараметрЗапросаАдрес = СтрШаблон("%1", ЖДСтанцияНаименование);
	//ТелоОтвета = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс,ПараметрЗапросаАдрес, Новый Структура("КоличествоРезультатов", 50));
	СтруктураРезультатаЗапроса = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс,ПараметрЗапросаАдрес, Новый Структура("КоличествоРезультатов, НеОтправлятьПовторныеНезаписанныеЗапросы", 50, Истина));;
	Если ЗначениеЗаполнено(СтруктураРезультатаЗапроса.ОписаниеОшибки) Тогда
		СтруктураРезультатаЗапроса.Вставить("МассивЖДСтанций", Новый Массив);	
		#Если Клиент Тогда                                                                                                                                          
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультатаЗапроса.ОписаниеОшибки);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю(СтруктураРезультатаЗапроса.ОписаниеОшибки);
		#КонецЕсли
		Возврат СтруктураРезультатаЗапроса;
	КонецЕсли;
	ТелоОтвета = СтруктураРезультатаЗапроса.ТелоОтвета;
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
    Результат = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();           
	
	КоличествоНайденныхРезультатов = Число(Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found);
	//Если ничего не нашли                                                                                                         
	МассивЖДСтанций = Новый Массив;
	СтруктураРезультатаЗапроса.Вставить("МассивЖДСтанций", МассивЖДСтанций);
	Если КоличествоНайденныхРезультатов = 0 Тогда
		//Возврат МассивЖДСтанций;
		Возврат СтруктураРезультатаЗапроса;
	Иначе             
		Для каждого featureMember Из Результат.response.GeoObjectCollection.featureMember Цикл
			Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.kind = "railway_station" Тогда
				Если НЕ Результат.response.GeoObjectCollection.featureMember[0].GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Свойство("Country")
					ИЛИ НЕ Результат.response.GeoObjectCollection.featureMember[0].GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryNameCode = ЖДСтанцияСтранаКодАльфа2 Тогда
					Продолжить;	
				КонецЕсли;
				Координаты = СтрРазделить(featureMember.GeoObject.Point.pos, " "); 
				Наименование = featureMember.GeoObject.name;
				Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Наименование,," ()-"+Символ(8212))
					И НЕ СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Наименование,," ()-"+Символ(8212))Тогда
					Продолжить;
				КонецЕсли;
				МассивЖДСтанций.Добавить(Новый Структура("Долгота, Широта, Наименование", Координаты[0], Координаты[1], Наименование)); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураРезультатаЗапроса;
	
КонецФункции

Функция ПолучитьМассивНаселенныхПунктовЧерезГеокодерЯндекс(Координаты, ТолькоЛатиницаКириллицаВСтроке = Истина) Экспорт
		
	Соединение = УстановитьСоединениеСГеокодеромЯндекс();
    
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
    КонецЕсли;	
	
	КлючAPIГеокодераЯндекс = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстантыСУчетомКонтекста("КлючAPIГеокодераЯндекс");
	Если НЕ ЗначениеЗаполнено(КлючAPIГеокодераЯндекс) Тогда
		#Если Клиент Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку");
		#Иначе
			ОбщегоНазначения.СообщитьПользователю("Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ПараметрЗапросаАдрес = СтрШаблон("%1", Координаты);
	//ТелоОтвета = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес);
	СтруктураРезультатаЗапроса = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес, Новый Структура("НеОтправлятьПовторныеНезаписанныеЗапросы", Истина));
	Если ЗначениеЗаполнено(СтруктураРезультатаЗапроса.ОписаниеОшибки) Тогда
		#Если Клиент Тогда                                                                                                                                          
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультатаЗапроса.ОписаниеОшибки);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю(СтруктураРезультатаЗапроса.ОписаниеОшибки);
		#КонецЕсли
		Возврат СтруктураРезультатаЗапроса;
	КонецЕсли;
	ТелоОтвета = СтруктураРезультатаЗапроса.ТелоОтвета;
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
    Результат = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();           
	
	КоличествоНайденныхРезультатов = Число(Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found);
	//Если ничего не нашли                                                                                                         
	МассивСтруктурНаселенныхПунктов = Новый Массив;
	МассивСтруктурРайонов = Новый Массив;
	МассивНаименованийРайонов = Новый Массив;
	Если КоличествоНайденныхРезультатов = 0 Тогда
		Возврат МассивСтруктурНаселенныхПунктов;
	Иначе             
		Для каждого featureMember Из Результат.response.GeoObjectCollection.featureMember Цикл
			Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.kind = "locality" Тогда
				Координаты = СтрРазделить(featureMember.GeoObject.Point.pos, " ");
				Долгота = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[0]);
				Широта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[1]); 
				Наименование = featureMember.GeoObject.name; 
				Если ТолькоЛатиницаКириллицаВСтроке
					И НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Наименование,," ()-"+Символ(8212))
					И НЕ СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Наименование,," ()-"+Символ(8212)) Тогда
					Продолжить;
				КонецЕсли;                                                                                                                                                                                                         
				//Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea") Тогда
				//	НаименованиеРегиона = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.AdministrativeAreaName;	
				//Иначе
				//	НаименованиеРегиона = Неопределено;
				//КонецЕсли;
				СтруктураЛокацииПоГеокодеру = ПолучитьСтруктуруЛокации(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.Address.Components);
				//МассивСтруктурНаселенныхПунктов.Добавить(Новый Структура("Наименование, Регион, Страна, Долгота, Широта, Приоритет", Наименование, НаименованиеРегиона, featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName, Долгота, Широта, 1)); 
				МассивСтруктурНаселенныхПунктов.Добавить(Новый Структура("Наименование, Регион, Страна, Долгота, Широта, Приоритет", 
															СтруктураЛокацииПоГеокодеру.НаселенныйПункт,
															СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня,
															СтруктураЛокацииПоГеокодеру.Страна,
															Долгота,
															Широта,
															1)); 
			ИначеЕсли featureMember.GeoObject.metaDataProperty.GeocoderMetaData.kind = "area" 
				И featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.Свойство("SubAdministrativeArea")
				И МассивНаименованийРайонов.Найти(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.SubAdministrativeAreaName) = Неопределено Тогда
				Координаты = СтрРазделить(featureMember.GeoObject.Point.pos, " ");                   
				Долгота = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[0]);
				Широта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[1]);
				СтруктураЛокацииПоГеокодеру = ПолучитьСтруктуруЛокации(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.Address.Components);
				//Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea") Тогда
				//	Наименование = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.SubAdministrativeAreaName;
				Наименование = СтруктураЛокацииПоГеокодеру.НаселенныйПункт;
					Если ТолькоЛатиницаКириллицаВСтроке
						И НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Наименование,," ()-"+Символ(8212))
						И НЕ СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Наименование,," ()-"+Символ(8212))Тогда
						Продолжить;
					КонецЕсли;
				//Иначе
				//	Наименование = Неопределено;
				//КонецЕсли;   
				//Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea") Тогда
				//	НаименованиеРегиона = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.AdministrativeAreaName;
				НаименованиеРегиона = СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня;
					Если ТолькоЛатиницаКириллицаВСтроке
						И НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(НаименованиеРегиона,," ()-"+Символ(8212))
						И НЕ СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(НаименованиеРегиона,," ()-"+Символ(8212))Тогда
						Продолжить;
					КонецЕсли;
				//Иначе
				//	НаименованиеРегиона = Неопределено;
				//КонецЕсли;
				//МассивСтруктурРайонов.Добавить(Новый Структура("Наименование, Регион, Страна, Долгота, Широта, Приоритет", Наименование, НаименованиеРегиона, featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName, Долгота, Широта, 2)); 
				МассивСтруктурРайонов.Добавить(Новый Структура("Наименование, Регион, Страна, Долгота, Широта, Приоритет", 
												СтруктураЛокацииПоГеокодеру.НаселенныйПункт, 
												СтруктураЛокацииПоГеокодеру.ЛокацияВышестоящегоУровня,
												СтруктураЛокацииПоГеокодеру.Страна,
												Долгота,
												Широта,
												2)); 
				//МассивНаименованийРайонов.Добавить(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.SubAdministrativeAreaName);
				//МассивНаименованийРайонов.Добавить(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.SubAdministrativeArea.SubAdministrativeAreaName);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если МассивСтруктурНаселенныхПунктов.Количество() > 0 Тогда
		СтруктураРезультатаЗапроса.Вставить("МассивСтруктурРезультата", МассивСтруктурНаселенныхПунктов);
		//Возврат МассивСтруктурНаселенныхПунктов;
	Иначе
		СтруктураРезультатаЗапроса.Вставить("МассивСтруктурРезультата", МассивСтруктурРайонов);
		//Возврат МассивСтруктурРайонов;
	КонецЕсли;
	Возврат СтруктураРезультатаЗапроса;

КонецФункции

Функция ПолучитьМассивТопонимовЧерезГеокодерЯндекс(ПараметрыЗапроса) Экспорт
	СтруктураРезультата = Новый Структура("ИдентификаторЗапроса, МассивСтруктурТопонимов, ОписаниеОшибки", "", Новый Массив, "");
	Соединение = УстановитьСоединениеСГеокодеромЯндекс();
    
	Если Соединение = Неопределено Тогда
		//Возврат Неопределено;
		Возврат СтруктураРезультата;
    КонецЕсли;	
	
	КлючAPIГеокодераЯндекс = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстантыСУчетомКонтекста("КлючAPIГеокодераЯндекс");
	Если НЕ ЗначениеЗаполнено(КлючAPIГеокодераЯндекс) Тогда                                                                                                       
		ОписаниеОшибки = "Не удалось выполнить запрос геокодера Яндекс. Не заполнен ключ API. Обратитесь в Техническую поддержку";
		#Если Клиент Тогда                                                                                                                                          
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		#КонецЕсли
		//Возврат Неопределено;
		СтруктураРезультата.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураРезультата;
	КонецЕсли;
	ПараметрЗапросаАдрес = СтрШаблон("%1", ПараметрыЗапроса.Геокод);
	ПараметрыЗапроса.Вставить("НеОтправлятьПовторныеНезаписанныеЗапросы", Истина);
	//ТелоОтвета = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес, ПараметрыЗапроса);
	СтруктураРезультатаЗапроса = ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, ПараметрЗапросаАдрес, ПараметрыЗапроса);
	Если ЗначениеЗаполнено(СтруктураРезультатаЗапроса.ОписаниеОшибки) Тогда
		СтруктураРезультата.ОписаниеОшибки = СтруктураРезультатаЗапроса.ОписаниеОшибки;	
		#Если Клиент Тогда                                                                                                                                          
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		#КонецЕсли
		Возврат СтруктураРезультата;
	КонецЕсли;
	ТелоОтвета = СтруктураРезультатаЗапроса.ТелоОтвета;
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
    Результат = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();           
	
	КоличествоНайденныхРезультатов = Число(Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found);
	Если Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.Свойство("suggest") Тогда
		#Если Клиент Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Вариант запроса, исправленный сервисом исправления опечаток: "+ Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.suggest);
		#Иначе
			ОбщегоНазначения.СообщитьПользователю("Вариант запроса, исправленный сервисом исправления опечаток: "+ Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.suggest);
		#КонецЕсли
	КонецЕсли;
	//Если ничего не нашли                                                                                                         
	МассивСтруктурТопонимов = Новый Массив;
	Если КоличествоНайденныхРезультатов = 0 Тогда
		Возврат МассивСтруктурТопонимов;
	Иначе             
		Для каждого featureMember Из Результат.response.GeoObjectCollection.featureMember Цикл
			Координаты = СтрРазделить(featureMember.GeoObject.Point.pos, " ");
			СтруктураТопонима = Новый Структура("Наименование, Регион, Страна, Долгота, Широта, Приоритет, Вид");
			Наименование = featureMember.GeoObject.name;
			Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Наименование,," ()-"+Символ(8212))
				И НЕ СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Наименование,," ()-"+Символ(8212))Тогда
				Продолжить;
			КонецЕсли; 
			СтруктураЛокацииПоДаннымГеокодера = ПолучитьСтруктуруЛокации(featureMember.GeoObject.metaDataProperty.GeocoderMetaData.Address.Components);
			//Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Свойство("country") Тогда
			//	СтруктураТопонима.Страна = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName;
			//	Если featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.Свойство("AdministrativeArea") Тогда
			//		СтруктураТопонима.Регион = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.AdministrativeArea.AdministrativeAreaName;	
			//	КонецЕсли;
			//КонецЕсли; 
			СтруктураТопонима.Наименование = Наименование;
			СтруктураТопонима.Страна = СтруктураЛокацииПоДаннымГеокодера.Страна;
			СтруктураТопонима.Регион = СтруктураЛокацииПоДаннымГеокодера.ЛокацияВышестоящегоУровня;
			СтруктураТопонима.Долгота = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[0]);
			СтруктураТопонима.Широта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Координаты[1]);
			СтруктураТопонима.Вид = featureMember.GeoObject.metaDataProperty.GeocoderMetaData.kind;
			МассивСтруктурТопонимов.Добавить(СтруктураТопонима); 
		КонецЦикла;
	КонецЕсли;
	СтруктураРезультата.ИдентификаторЗапроса = СтруктураРезультатаЗапроса.ИдентификаторЗапроса;
	СтруктураРезультата.МассивСтруктурТопонимов = МассивСтруктурТопонимов;
	Возврат СтруктураРезультата;

КонецФункции

Функция УстановитьСоединениеСГеокодеромЯндекс()
	АдресГеокодераЯндекс = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("АдресГеокодераЯндекс");
	Попытка		
	    Соединение = Новый HTTPСоединение(АдресГеокодераЯндекс, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Исключение		
		#Если Клиент Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось установить соединение с сервером геодирования Яндекс. Проверьте правильность адреса сервера.");
		#Иначе
			ОбщегоНазначения.СообщитьПользователю("Не удалось установить соединение с сервером геодирования Яндекс. Проверьте правильность адреса сервера.");
		#КонецЕсли
        Соединение = Неопределено;
	Конецпопытки;
	Возврат Соединение;
КонецФункции     

Функция ПолучитьОтветГеокодераЯндекс(Соединение, КлючAPIГеокодераЯндекс, АдресПоиска, ДополнительныеПараметры = Неопределено)
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	СтруктураРезультата = Новый Структура("ИдентификаторЗапроса, ТелоОтвета, ОписаниеОшибки", ИдентификаторЗапроса, Неопределено, "");
	ШаблонАдресРесурсаЗапроса = "/1.x/?format=json&apikey=%1&geocode=%2";
	ДополнительныеПараметрыСтрокой = "";
	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ВидТопонима") Тогда
			//kind	Только если в параметре geocode указаны координаты. Вид необходимого топонима.
			//Список допустимых значений:
			//house — дом;
			//street — улица;
			//metro — станция метро;
			//district — район города;
			//locality — населенный пункт (город/поселок/деревня/село/...).
			ДополнительныеПараметрыСтрокой = ДополнительныеПараметрыСтрокой + "&kind="+ДополнительныеПараметры.ВидТопонима;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("КоличествоРезультатов") Тогда
			ДополнительныеПараметрыСтрокой = ДополнительныеПараметрыСтрокой + "&results="+ДополнительныеПараметры.КоличествоРезультатов;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("НеОтправлятьПовторныеНезаписанныеЗапросы") Тогда
			СтатусЗапросаГеокодера = ГеокодированиеВызовСервера.ПроверитьГеокодПоИсторииЗапросов(АдресПоиска+ДополнительныеПараметрыСтрокой);
			Если СтатусЗапросаГеокодера = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаГеокодера.ОтветПолученНеЗаписан") Тогда
				СтруктураРезультата.ОписаниеОшибки = СтрШаблон("При предыдущей отправке аналогичного значения в геокодер по запросу %1 системе не удалось найти подходящий условиям поиска ответ. Необходимо изменить исходные данные для отправки в геокодер, либо заполнить требуемые значения в ручном режиме", АдресПоиска);
				Возврат СтруктураРезультата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	АдресРесурсаЗапроса = СтрШаблон(ШаблонАдресРесурсаЗапроса, КлючAPIГеокодераЯндекс, АдресПоиска+ДополнительныеПараметрыСтрокой);
	
	ТелоОтвета = "";
	Попытка
		Запрос = Новый HTTPЗапрос;
		Запрос.АдресРесурса = АдресРесурсаЗапроса; 
		Ответ = Соединение.Получить(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Соединение = Неопределено;		
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке().Описание;
		СтруктураРезультата.ОписаниеОшибки = ОписаниеОшибки;
	КонецПопытки;
	СтруктураРезультата.ТелоОтвета = ТелоОтвета;
	ГеокодированиеСервер.ЗаписатьЛогГеокодирования(ИдентификаторЗапроса, АдресПоиска + ДополнительныеПараметрыСтрокой);
	Возврат СтруктураРезультата;
	
КонецФункции 

Функция ПолучитьСтруктуруЛокации(Components)
	КомпонентыАдреса = Новый Массив;
	Для каждого AddressComponent Из Components Цикл
		КомпонентыАдреса.Добавить(Новый Структура("ВидНайденногоТопонима, Имя", AddressComponent.kind, AddressComponent.name));
	КонецЦикла;              
	
	//страна                 
	ИспользуемыйЭлементЛокации = 0;
	Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
		Если КомпонентАдреса.ВидНайденногоТопонима = "country" Тогда
			Страна = КомпонентАдреса.Имя;
			ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//лву
	ЛокацияВышестоящегоУровня = Неопределено;
	Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
		Если КомпонентАдреса.ВидНайденногоТопонима = "province" Тогда
			ЛокацияВышестоящегоУровня = КомпонентАдреса.Имя;
			ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
		КонецЕсли;
	КонецЦикла;                                               
	//Евросиб - АСуслов 30.10.2023 14:28:43 #76794
	//(
	//если в компонентс нет тэга province то ЛВУ будет топоним с видом area
	Если ЛокацияВышестоящегоУровня = Неопределено Тогда
		Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
			Если КомпонентАдреса.ВидНайденногоТопонима = "area" Тогда
				ЛокацияВышестоящегоУровня = КомпонентАдреса.Имя;
				ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
			КонецЕсли;
		КонецЦикла;                              
	КонецЕсли;
	//)
	//Евросиб - АСуслов 30.10.2023 14:28:44 #76794

	//Евросиб Ситников К.А. 16.06.2025 Task 112059 
	//Если в компонентс нет тэга province и area то ЛВУ будет топоним с видом country 	
	Если ЛокацияВышестоящегоУровня = Неопределено Тогда
		Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
			Если КомпонентАдреса.ВидНайденногоТопонима = "country" Тогда
				ЛокацияВышестоящегоУровня = КомпонентАдреса.Имя;
				ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
			КонецЕсли;
		КонецЦикла;                              
	КонецЕсли;
	//Евросиб Ситников К.А. 16.06.2025 Task 112059	
	
	//локация  
	Локация = Неопределено;
	Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
		Если КомпонентАдреса.ВидНайденногоТопонима = "locality" Тогда
			Локация = КомпонентАдреса.Имя;
			ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Локация = Неопределено Тогда
		Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
			Если КомпонентАдреса.ВидНайденногоТопонима = "area" Тогда
				Локация = КомпонентАдреса.Имя;
				ИспользуемыйЭлементЛокации = КомпонентыАдреса.Найти(КомпонентАдреса);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	//Если ИспользуемыйЭлементЛокации > 0 Тогда
	//	ЛокацияВышестоящегоУровня = КомпонентыАдреса[ИспользуемыйЭлементЛокации-1];
	//Иначе
	//	ЛокацияВышестоящегоУровня = КомпонентыАдреса[ИспользуемыйЭлементЛокации];
	//КонецЕсли;
	Страна = СтрЗаменить(Страна, "Ё", "Е");
	Страна = СтрЗаменить(Страна, "ё", "е");
	ЛокацияВышестоящегоУровня = СтрЗаменить(ЛокацияВышестоящегоУровня, "Ё", "Е");
	ЛокацияВышестоящегоУровня = СтрЗаменить(ЛокацияВышестоящегоУровня, "ё", "е");
	Локация = СтрЗаменить(Локация, "Ё", "Е");
	Локация = СтрЗаменить(Локация, "ё", "е");
	Возврат Новый Структура("Страна, ЛокацияВышестоящегоУровня, НаселенныйПункт", Страна, ЛокацияВышестоящегоУровня, Локация);
	
КонецФункции

