&НаКлиенте
Перем КэшНаправлений;
&НаКлиенте
Перем КэшУслуг;
//Евросиб Коханенко Н.А. 17.03.2025 (( #100979 
&НаКлиенте
Перем КП;

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ММ_КалькуляцияЖДСоставляющейПриИзменении(Элемент)
	
	Если Объект.ММ_КоличествоКТКНаВагон = 0 Тогда Возврат; КонецЕсли;
	
	//Евросиб Каблов 28.05.2025 ( #109346
	//ДлитДней = ОкрВверх(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней"));
	//
	////Евросиб Коханенко Н.А. 16.01.2024 (( #79415 
	//ЭтоНоваяУслугаПредоставлениеПС = Ложь;
	////Евросиб Коханенко Н.А. 16.01.2024 )) #79415
	//
	//СтрокаНайдена = неопределено;
	//Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
	//	Если Стр.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПредоставлениеПлатформ") Тогда
	//		СтрокаНайдена = Стр;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если СтрокаНайдена = неопределено Тогда 
	//	СтрокаНайдена = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Добавить(); 
	//	//Евросиб Коханенко Н.А. 16.01.2024 (( #79415 
	//	ЭтоНоваяУслугаПредоставлениеПС = Истина;
	//	//Евросиб Коханенко Н.А. 16.01.2024 )) #79415
	//КонецЕсли;
	//
	//СтрокаНайдена.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПредоставлениеПлатформ");
	//
	//СтрокаНайдена.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль");
	//СтрокаНайдена.НДСВключенВСтоимость = Истина;
	//
	////Евросиб Коханенко Н.А. 16.01.2024 (( #79415 
	////СтрокаНайдена.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	//Если ЭтоНоваяУслугаПредоставлениеПС Тогда
	//	СтрокаНайдена.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	//КонецЕсли;
	////Евросиб Коханенко Н.А. 16.01.2024 )) #79415
	//
	//СтрокаНайдена.НормативныйПроцентВознаграждения40 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	//СтрокаНайдена.ПунктОтправления = Объект.Суша_ПунктОтправления;
	//СтрокаНайдена.ПунктНазначения = Объект.Суша_ПунктНазначения;
	//
	//СтрокаНайдена.Цена20 = 0;
	//СтрокаНайдена.НормативныйПроцентВознаграждения20 = 0;
	//СтрокаНайдена.Вознаграждение20 = 0;
	//СтрокаНайдена.СуммаВознаграждения20 = 0;
	//СтрокаНайдена.Цена40 = 0;
	//СтрокаНайдена.НормативныйПроцентВознаграждения40 = 0;
	//СтрокаНайдена.Вознаграждение40 = 0;
	//СтрокаНайдена.СуммаВознаграждения40 = 0;
	//
	//Если СтрНайти(ТарифицируемыйРазмерКТК, "20") <> 0 Тогда
	//	СтрокаНайдена.Цена20 = ДлитДней * Объект.ММ_СтавкаПредоставленияПлатформы / Объект.ММ_КоличествоКТКНаВагон;
	//	СтрокаНайдена.НормативныйПроцентВознаграждения20 = ПроцентВознагражденияУслуги(СтрокаНайдена.Услуга, Объект.Дата);
	//	СтрокаНайдена.Вознаграждение20 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	//КонецЕсли;
	//
	//Если СтрНайти(ТарифицируемыйРазмерКТК, "40") <> 0 Тогда
	//	СтрокаНайдена.Цена40 = ДлитДней * Объект.ММ_СтавкаПредоставленияПлатформы / Объект.ММ_КоличествоКТКНаВагон;
	//	СтрокаНайдена.НормативныйПроцентВознаграждения40 = ПроцентВознагражденияУслуги(СтрокаНайдена.Услуга, Объект.Дата);
	//	СтрокаНайдена.Вознаграждение40 = СтрокаНайдена.НормативныйПроцентВознаграждения40;
	//КонецЕсли;

	//ПосчитатьСтрокуКалькуляцииЖД(СтрокаНайдена);	
	//
	//ПересчитатьИтогоВИспользовании(неопределено);
	//ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,);
	ОбновитьСтоимостьУслугСервер(Истина);
	//Евросиб Каблов 28.05.2025 )
	
КонецПроцедуры

//Евросиб Каблов 28.05.2025 #109346
&НаСервере
Процедура ОбработатьИзменениеЖДСоставляющейСервер(ПараметрыТарифа = Неопределено, ДобавлятьСтрокуПредоставлениеПС = Ложь)
	
	Если Объект.ММ_КоличествоКТКНаВагон = 0 Тогда Возврат; КонецЕсли;
	
	НоменклатураПредоставлениеПС = Справочники.Номенклатура.ПредоставлениеПлатформ;
	ВалютаРубль = Справочники.Валюты.Рубль;
	СтавкаНДС0 = Перечисления.СтавкиНДС.НДС0;
	
	Если ЗначениеЗаполнено(ПараметрыТарифа) Тогда
		ВалютаТарифа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТарифа, "Валюта", ВалютаРубль);
		СтавкаНДСТарифа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТарифа, "СтавкаНДС", СтавкаНДС0);
		НДСВключенВСтоимость = Ложь;
	Иначе
		ВалютаТарифа = ВалютаРубль;
		СтавкаНДСТарифа = СтавкаНДС0;
		НДСВключенВСтоимость = Ложь;
	КонецЕсли;
	
	ДлитДней = ОкрВверх(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней"));
	
	НайденныеСтроки = Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиСтроки(Новый Структура("Услуга", НоменклатураПредоставлениеПС));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
	Иначе
		//Евросиб Каблов 25.06.2025 ( #112882
		Если ДобавлятьСтрокуПредоставлениеПС Тогда
		//Евросиб Каблов 25.06.2025 )
			НайденнаяСтрока = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Добавить();
			НайденнаяСтрока.Услуга = НоменклатураПредоставлениеПС;
		//Евросиб Каблов 25.06.2025 ( #112882
		Иначе
			Возврат;
		КонецЕсли;
		//Евросиб Каблов 25.06.2025 )
	КонецЕсли;
	
	НайденнаяСтрока.Валюта = ВалютаТарифа;
	НайденнаяСтрока.НДСВключенВСтоимость = НДСВключенВСтоимость;
	НайденнаяСтрока.СтавкаНДС = СтавкаНДСТарифа;
    
	НайденнаяСтрока.ПунктОтправления = Объект.Суша_ПунктОтправления;
	НайденнаяСтрока.ПунктНазначения = Объект.Суша_ПунктНазначения;
	
	НайденнаяСтрока.Цена20 = 0;
	НайденнаяСтрока.НормативныйПроцентВознаграждения20 = 0;
	НайденнаяСтрока.Вознаграждение20 = 0;
	НайденнаяСтрока.СуммаВознаграждения20 = 0;
	НайденнаяСтрока.Цена40 = 0;
	НайденнаяСтрока.НормативныйПроцентВознаграждения40 = 0;
	НайденнаяСтрока.Вознаграждение40 = 0;
	НайденнаяСтрока.СуммаВознаграждения40 = 0;
	
	Если СтрНайти(ТарифицируемыйРазмерКТК, "20") <> 0 Тогда
		НайденнаяСтрока.Цена20 = ДлитДней * Объект.ММ_СтавкаПредоставленияПлатформы / Объект.ММ_КоличествоКТКНаВагон;
		НайденнаяСтрока.НормативныйПроцентВознаграждения20 = ПроцентВознагражденияУслуги(НайденнаяСтрока.Услуга, Объект.Дата);
		НайденнаяСтрока.Вознаграждение20 = НайденнаяСтрока.НормативныйПроцентВознаграждения20;
	КонецЕсли;
	
	Если СтрНайти(ТарифицируемыйРазмерКТК, "40") <> 0 Тогда
		НайденнаяСтрока.Цена40 = ДлитДней * Объект.ММ_СтавкаПредоставленияПлатформы / Объект.ММ_КоличествоКТКНаВагон;
		НайденнаяСтрока.НормативныйПроцентВознаграждения40 = ПроцентВознагражденияУслуги(НайденнаяСтрока.Услуга, Объект.Дата);
		НайденнаяСтрока.Вознаграждение40 = НайденнаяСтрока.НормативныйПроцентВознаграждения40;
	КонецЕсли;
	
	ПосчитатьСтрокуКалькуляцииЖДСервер(НайденнаяСтрока.ПолучитьИдентификатор());	
	ПересчитатьИтогоВИспользовании(неопределено);
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,);
	
КонецПроцедуры

//Евросиб Каблов 28.05.2025 #109346
&НаКлиенте
Процедура ПосчитатьСтрокуКалькуляцииЖД(Знач ТекД = неопределено)
	
	Если ТекД <> Неопределено Тогда
		ТекСтрока = ТекД.ПолучитьИдентификатор();
	Иначе
		ТекСтрока = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущаяСтрока;
	КонецЕсли;
	
	Если ТекСтрока <> Неопределено Тогда
		ПосчитатьСтрокуКалькуляцииЖДСервер(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 28.05.2025 #109346
&НаСервере
Процедура ПосчитатьСтрокуКалькуляцииЖДСервер(ТекСтрока)
	
	Если ТекСтрока = неопределено Тогда Возврат; КонецЕсли;
	
	ТекД = Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиПоИдентификатору(ТекСтрока);
	
	СуммаНДСВключая20 = 0;
	СуммаНДСВключая40 = 0;
	Если текД.НДСВключенВСтоимость Тогда
		СуммаСтавки = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС);
		СуммаНДСВключая20 = ТекД.Цена20  * СуммаСтавки / (100+СуммаСтавки);
		СуммаНДСВключая40 = ТекД.Цена40  * СуммаСтавки / (100+СуммаСтавки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.Вознаграждение20) Тогда
		ТекД.СуммаВознаграждения20 = (ТекД.Цена20-СуммаНДСВключая20) * ТекД.Вознаграждение20 / 100;
	Иначе 
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712   
		Если ЭтоДирекцияКонтейнерныхПеревозок И ЭтоМежсервисныеРасходы() Тогда
			ТекД.СуммаВознаграждения20 = 0;
		КонецЕсли;                               
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекД.Вознаграждение40) Тогда
		ТекД.СуммаВознаграждения40 = (ТекД.Цена40-СуммаНДСВключая40) * ТекД.Вознаграждение40 / 100;
	Иначе
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712   
		Если ЭтоДирекцияКонтейнерныхПеревозок И ЭтоМежсервисныеРасходы() Тогда
			ТекД.СуммаВознаграждения40 = 0;
		КонецЕсли;                               
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	КонецЕсли;
	
	//Евросиб Каблов 28.05.2025 ( #109346
	//ТекД.СуммаНДС20 = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекД.Цена20+ТекД.СуммаВознаграждения20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	//ТекД.СуммаНДС40 = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекД.Цена40+ТекД.СуммаВознаграждения40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	ТекД.СуммаНДС20 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.Цена20+ТекД.СуммаВознаграждения20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	ТекД.СуммаНДС40 = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.Цена40+ТекД.СуммаВознаграждения40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	//Евросиб Каблов 28.05.2025 )
	
	ТекД.Итого20 = ТекД.СуммаВознаграждения20 + ТекД.Цена20 + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС20);
	ТекД.Итого40 = ТекД.СуммаВознаграждения40 + ТекД.Цена40 + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС40);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСебестоимостьПС()
	
	НСБПЛ = ПолучитьНормативнуюСебестоимостьПлатформы(Объект.Дата, Объект.Валюта, Объект.ЖД_РасчетСебестоимостиДляТипаФГП);
	НормативнаяСтавкаПредоставленияПС = ПолучитьНормативнуюСебестоимостьПлатформы(Объект.Дата, Объект.Валюта, Объект.ЖД_РасчетСебестоимостиДляТипаФГП, ПредопределенноеЗначение("Перечисление.ТипНормативнойСтавкиВагона.КлиентскаяСтавка"));
	
	СТРАСПР = ПолучитьСтатистикуРаспределения(Объект.ЖД_ПериодСбораСтатистикиРаспределенияНачало, Объект.ЖД_ПериодСбораСтатистикиРаспределенияОкончание);
	ЖД_СреднийПроцентСороковок = СТРАСПР.Для40;
	ЖД_СредняяЗагрузкаПлатформСтатистика = СТРАСПР.СредняяЗагрузка;
	Попытка
		Если НЕ ЗначениеЗаполнено(Объект.ЖД_СредняяЗагрузкаПлатформ) тогда
			Объект.ЖД_СредняяЗагрузкаПлатформ = ЖД_СредняяЗагрузкаПлатформСтатистика;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ЖД_СреднийПроцентСороковок) Тогда
			Объект.ЖД_СреднийПроцентСороковок = ЖД_СреднийПроцентСороковок;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ЖД_СебестоимостьПредоставленияПС.Очистить();
	НСтр = ЖД_СебестоимостьПредоставленияПС.Добавить();
	НСтр.Статья = "Мин. загрузка 1 кт/пл";
	НСтр.Для20 = (НСБПЛ * ЖД_ИтогоВИспользовании) + Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС;
	НСтр.Для40 = НСтр.Для20;
	
	НСтр2 = ЖД_СебестоимостьПредоставленияПС.Добавить();
	НСтр2.Статья = "Макс. загрузка";
	НСтр2.Для20 = НСтр.Для20/4;
	НСтр2.Для40 = НСтр.Для20/2;
	
	НСтр3 = ЖД_СебестоимостьПредоставленияПС.Добавить();
	НСтр3.Статья = "Средняя загрузка";
	Если (100-Объект.ЖД_СреднийПроцентСороковок) > 0 Тогда
		НСтр3.Для20 = НСтр2.Для20 / ((100-Объект.ЖД_СреднийПроцентСороковок) * 0.01);
	КонецЕсли;
	Если Объект.ЖД_СреднийПроцентСороковок > 0 Тогда
		НСтр3.Для40 = НСтр2.Для40 / (Объект.ЖД_СреднийПроцентСороковок * 0.01);
	КонецЕсли;
	
	НСтр4 = ЖД_СебестоимостьПредоставленияПС.Добавить();
	НСтр4.Статья = "Предоставление ПС (расчет)";
	Если Объект.ЖД_СредняяЗагрузкаПлатформ > 0 Тогда
		НСтр4.Для20 = НСтр2.Для20 / (Объект.ЖД_СредняяЗагрузкаПлатформ * 0.01);
		НСтр4.Для40 = НСтр2.Для40 / (Объект.ЖД_СредняяЗагрузкаПлатформ * 0.01);
	КонецЕсли;
	
	Если ЖД_ИтогоВИспользовании > 0 Тогда
		Попытка
			ДоходностьПлатформыСтатистика = (((Объект.ЖД_Вознаграждение20 + НСтр4.Для20) * (1 - Объект.ЖД_СреднийПроцентСороковок/100) + (Объект.ЖД_Вознаграждение40 + НСтр4.Для40) * (Объект.ЖД_СреднийПроцентСороковок/100)) * ПолучитьКоэффициентТипаФГП(Объект.ЖД_РасчетДляКТКРазмер) / ((1 - Объект.ЖД_СреднийПроцентСороковок/100) + Объект.ЖД_СреднийПроцентСороковок/100 * 2 )) * (Объект.ЖД_СредняяЗагрузкаПлатформ/100) - (Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС);
			ЖД_ДоходностьПлатформыВСутки = ДоходностьПлатформыСтатистика / ЖД_ИтогоВИспользовании;	
		Исключение
			ДоходностьПлатформыСтатистика = 0;
			ЖД_ДоходностьПлатформыВСутки = 0;
		КонецПопытки;
	КонецЕсли;
	

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентТипаФГП(ТипФГП)
	
	Возврат ТипФГП.КоэффициентРасчетаДоходности;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатистикуРаспределения(ДатаНачала, ДатаОкончания)
	
	Результат = Новый Структура("Для20, Для40, СредняяЗагрузка", 1, 1, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СРЕДНЕЕ(СтатистикаРаспределенияКТКВПоездах.Процент20) КАК Процент20,
	               |	СРЕДНЕЕ(СтатистикаРаспределенияКТКВПоездах.Процент40) КАК Процент40,
	               |	СРЕДНЕЕ(ПродажиПродуктовОстатки.ЗанятоСлотовОстаток / ПродажиПродуктовОстатки.ВсегоСлотовОстаток) КАК ПроцентЗагрузки
	               |ИЗ
	               |	РегистрСведений.СтатистикаРаспределенияКТКВПоездах КАК СтатистикаРаспределенияКТКВПоездах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПродуктов.Остатки КАК ПродажиПродуктовОстатки
	               |		ПО СтатистикаРаспределенияКТКВПоездах.Поезд = ПродажиПродуктовОстатки.Продукт
	               |ГДЕ
	               |	СтатистикаРаспределенияКТКВПоездах.Отправка МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ПродажиПродуктовОстатки.ЗанятоСлотовОстаток > 0";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.Для20 = ?(Ответ.Процент20 = NULL, 1, Ответ.Процент20);
		Результат.Для40 = ?(Ответ.Процент40 = NULL, 1, Ответ.Процент40);
		Результат.СредняяЗагрузка = ?(Ответ.ПроцентЗагрузки = NULL, 0, Ответ.ПроцентЗагрузки);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНормативнуюСебестоимостьПлатформы(ДатаДока, ВалютаДока, ТипПлатформы, Знач ВидСтавки = неопределено)
	
	Если ВидСтавки = неопределено Тогда
		ВидСтавки = Перечисления.ТипНормативнойСтавкиВагона.Себестоимость;
	КонецЕсли;
	
	Результат = 0;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НормативныеСтавкиВагонов.СтавкаНаПредоставление КАК СтавкаНаПредоставление,
	               |	НормативныеСтавкиВагонов.Валюта КАК Валюта
	               |ИЗ
	               |	Справочник.НормативныеСтавкиВагонов КАК НормативныеСтавкиВагонов
	               |ГДЕ
	               |	НЕ НормативныеСтавкиВагонов.ПометкаУдаления
	               |	И НормативныеСтавкиВагонов.ТипВагона = &ТипВагона
	               |	И НормативныеСтавкиВагонов.ВидСтавки = &ВидСтавки
	               |	И &ТекДата МЕЖДУ НормативныеСтавкиВагонов.НачалоДействия И НормативныеСтавкиВагонов.ОкончаниеДействия";
	Запрос.УстановитьПараметр("ТипВагона", ТипПлатформы);
	Запрос.УстановитьПараметр("ВидСтавки", ВидСтавки);
	Запрос.УстановитьПараметр("ТекДата", ДатаДока);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат = Валюта_сервер.ПересчитатьПоКурсу(Ответ.СтавкаНаПредоставление, Ответ.Валюта, ВалютаДока, ДатаДока);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 28.05.2025 #109346
//&НаКлиенте
&НаКлиентеНаСервереБезКонтекста
//Евросиб Каблов 28.05.2025 )
Функция ОкрВверх(ЧислоЪ)
	
	Возврат ?(ЧислоЪ%1 = 0, ЧислоЪ, (ЧислоЪ-ЧислоЪ%1)+1);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ДИТ Пак И.Т. Task34426 21.05.2021 Начало
	ЭтаФорма.ВызваноИзПродукта = Ложь;
	Попытка
		ВладелецРодитель = ВладелецФормы;
		Пока ВладелецРодитель <> Неопределено И ТипЗнч(ВладелецРодитель) <> Тип("ФормаКлиентскогоПриложения") Цикл
			ВладелецРодитель = ВладелецРодитель.Родитель;
		КонецЦикла;
		Если ВладелецРодитель.ВызваноИзПродукта Тогда
			ЭтаФорма.ВызваноИзПродукта = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЭтаФорма.ЭтоРежимКопирования И Не ЭтаФорма.ВызваноИзПродукта Тогда
		СброситьМаршрутизацию();
	КонецЕсли;
	//ДИТ Пак И.Т. Task34426 21.05.2021 Конец
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная") 
		//БИТ Белинский Д.А. 05.04.2023 -начало TASK 66201
		//ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Передислокация") Тогда
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Доплатные") Тогда
		//БИТ Белинский Д.А. 05.04.2023 -конец TASK 66201
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаМультимодальная;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьСтандартнымСпискомУслуг(неопределено);
	КонецЕсли;
	
	//БлокВалютыДокумента();
	
	ОбновитьВидимостьПолейПриСменеВидаКалькуляции();
	//Евросиб Гудкова( 01.09.2020 Ticket№ 0205278
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ММ_ОбновитьСтоимостьПредоставленияВагона(неопределено);
	//КонецЕсли;
	// Евросиб Гудкова) 
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,Истина,,Истина);
	ПересчитатьИтогоВИспользовании(неопределено);
	ОбновитьСебестоимостьПС();

	Элементы.Курс.Доступность = НЕ Объект.ЗафиксироватьКурс;
	Элементы.ДатаКурса.Доступность = НЕ Объект.ЗафиксироватьКурс;
	
	Элементы.ОбновитьНовыйФрахт.Заголовок = ">" + Символы.ПС + ">" + Символы.ПС + ">" + Символы.ПС + " " + Символы.ПС + "О" + Символы.ПС + "Б" + Символы.ПС + "Н" + Символы.ПС + "О" + Символы.ПС + "В" + Символы.ПС + "И" + Символы.ПС + "Т" + Символы.ПС + "Ь" +  Символы.ПС + " " + Символы.ПС + ">" + Символы.ПС + ">" + Символы.ПС + ">";
	
	ФрахтИмпортЭкспорт = ?(Объект.ФрахтИмпорт = Истина,0,1);
	Если Объект.ФрахтИмпорт Тогда
		Элементы.НФ_ПортОтправления.Заголовок = "Порт назначения";
		Элементы.НФ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт отправления";
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
		//Элементы.НФ_ПортыОтгрузкиВыгрузкиПорт.Заголовок = "Порт отгрузки";
		//Элементы.НФ_ЛинииПортыПортОтгрузкиВыгрузки.Заголовок = "Порт отгрузки";
		Элементы.ММ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт назначения";
		// Евросиб Рыбьяков К.А. 06.09.2024 ))
	Иначе
		Элементы.НФ_ПортОтправления.Заголовок = "Порт отправления";
		Элементы.НФ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт назначения";
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
		//Элементы.НФ_ПортыОтгрузкиВыгрузкиПорт.Заголовок = "Порт выгрузки";
		//Элементы.НФ_ЛинииПортыПортОтгрузкиВыгрузки.Заголовок = "Порт выгрузки";
		Элементы.ММ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт отправления";
		// Евросиб Рыбьяков К.А. 06.09.2024 ))
	КонецЕсли;
	
	Элементы.УсловияПримененияСтавки.Доступность = Объект.СпециальныеУсловия;

	//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
	ЭтоМежсервисныеРасходы = ЭтоМежсервисныеРасходы();
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712
	//Если ЭтоМежсервисныеРасходы И Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() Тогда
	Если ЭтоМежсервисныеРасходы И ЭтоДирекцияКонтейнерныхПеревозок Тогда
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712
		Элементы.Группа8.Скрыть();		
		Элементы.Группа47.Скрыть();		
		Элементы.ГруппаРазделФрахта.Скрыть(); 
		СписокСкрываемыхРеквизитовДляМР = СписокСкрываемыхРеквизитовДляМежсервисныхРасходов(); 
		Для Каждого ИмяРеквизита Из СписокСкрываемыхРеквизитовДляМР Цикл 
			Элементы[ИмяРеквизита].Видимость = Ложь; 
        КонецЦикла;
		
		ВыбраныМежсервисныеРасходы = Истина;
	КонецЕсли;
	Элементы.ТарифицируемыйРазмерКТК1.Видимость = ЭтоМежсервисныеРасходы;
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201
	
	//Евросиб Коханенко Н.А. 31.07.2023 (( #72829 
	ОбновитьВидимостьПолейДляСлужебнойКалькуляции();
	//Евросиб Коханенко Н.А. 31.07.2023 )) #72829   
	
	//Евросиб Коханенко Н.А. 27.07.2023 (( #73072 	
	ОбновитьБлокировкуСтатусаСостоянийСогласования();
	//Евросиб Коханенко Н.А. 27.07.2023 )) #73072 
	
	//Евросиб Коханенко Н.А. 17.03.2025 (( #100979 
	ЗаполнитьКлючевыеПараметрыПродукта(, КП);
	//Евросиб Коханенко Н.А. 17.03.2025 )) #100979 
	
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 30.07.2025 ((
	ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения();
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьПолейПриСменеВидаКалькуляции()  
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
	Элементы.ГруппаСтраницаЖелезнодорожная.Видимость = Истина;
	Элементы.ГруппаЖелезнодорожнаяПредоставление.Видимость = Истина;   
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 24.07.2023
	
	//БИТ Белинский Д.А. 20.06.2023 -начало // TASK 66201
	ЭтоМежсервисныеРасходы = ЭтоМежсервисныеРасходы();
	Если Не ЭтоМежсервисныеРасходы И ВыбраныМежсервисныеРасходы Тогда
		Элементы.Группа8.Показать();		
		Элементы.Группа47.Показать();		
		Элементы.ГруппаРазделФрахта.Показать();
		СписокСкрываемыхРеквизитовДляМР = СписокСкрываемыхРеквизитовДляМежсервисныхРасходов(); 
		Для Каждого ИмяРеквизита Из СписокСкрываемыхРеквизитовДляМР Цикл 
			Элементы[ИмяРеквизита].Видимость = Истина; 
        КонецЦикла;
	КонецЕсли;
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201
	
	ЭтоСГруженымИКомплекснойСтавкой = (Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КалькуляцияКомплекснойСтавки"));
	Элементы.ПС_ДопРасходыВклВСтавку.Видимость = ЭтоСГруженымИКомплекснойСтавкой;
	Элементы.ПС_СтавкаГруженогоТарифа.Видимость = ЭтоСГруженымИКомплекснойСтавкой;
	
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") 
		//Евросиб Коханенко Н.А. 02.09.2025 (( #118267 
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ДоплатныеПВ")
		//Евросиб Коханенко Н.А. 02.09.2025 )) #118267 
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом") Тогда
		
		ВидимостьЭлемента = Ложь;
		
	Иначе
		ВидимостьЭлемента = Истина;

	КонецЕсли;
	// закладка "Мультимодальная"
	//Элементы.СписокСтанцийНазначения.Видимость = НЕ ВидимостьЭлемента;
	//Элементы.СписокСтанцийОтправления.Видимость = НЕ ВидимостьЭлемента;
	Элементы.УсловияПеревозки_Отправление.Видимость = ВидимостьЭлемента;
	Элементы.УсловияПеревозки_Прибытие.Видимость = ВидимостьЭлемента;
	Элементы.ГруппаКалькуляцияКТКСоставляющей.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиТариф20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСтавкаМаксимальная20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиЦена20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиНормативныйПроцентВознаграждения20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиИтого20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_СебестоимостьСуши40.Видимость = ВидимостьЭлемента;
	Элементы.ММ_Вознаграждение.Видимость = ВидимостьЭлемента;
	Элементы.ММ_стараяСтавкаИтого20.Видимость = ВидимостьЭлемента;
	Элементы.ГруппаСтавки20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиТариф1.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиСебестоимость21.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиГруппа13.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиСтавка21.Видимость = ВидимостьЭлемента;
	Элементы.ММ_ИтогоСебестоимость20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_ИтогоВознаграждение20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_ИтогоРентабельность20.Видимость = ВидимостьЭлемента;
	Элементы.ММ_ИтогоСтавка20.Видимость = ВидимостьЭлемента;
	// закладка "КП"
	Элементы.СебестоимостьПредоставленияПСДля20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_КалькуляцияСебестоимостиСумма.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_КалькуляцияСебестоимостиТариф.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_КалькуляцияСебестоимостиНормВознаграждение20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_Себестоимость.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_Вознаграждение.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_Рентабельность20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_СтавкаКлиенту.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиТариф.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиСебестоимость20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиГруппа5.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиВнеСтавкиСтавка20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиПоСверхнормативамТариф20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиПоСверхнормативамСебестоимость20.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиПоСверхнормативамГруппа6.Видимость = ВидимостьЭлемента;
	Элементы.ЖД_УслугиПоСверхнормативамСтавка20.Видимость = ВидимостьЭлемента;
	Элементы.СтатистикаПлановыхКППроцент20.Видимость = ВидимостьЭлемента;
	Элементы.СтатистикаФактическихКППроцент20.Видимость = ВидимостьЭлемента;
	// закладка "Дополнительно"
	Элементы.ПланПродаж_ДоходыСуммаОплаты20.Видимость = ВидимостьЭлемента;
	Элементы.ПланПродаж_ДоходыСуммаАванса20.Видимость = ВидимостьЭлемента;
	Элементы.ПланПродаж_ДоходыСуммаНДС20.Видимость = ВидимостьЭлемента;
	Элементы.ПланПродаж_РасходыСуммаАванса20.Видимость = ВидимостьЭлемента;
	Элементы.ПланПродаж_РасходыСуммаОплаты20.Видимость = ВидимостьЭлемента;
	Элементы.ПланПродаж_РасходыТариф20.Видимость = ВидимостьЭлемента;
	// закладка "Мультимодальная"
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиТариф40.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСтавкаМаксимальная40.Заголовок = ?(ВидимостьЭлемента,"max 40""","max за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиЦена40.Заголовок = ?(ВидимостьЭлемента,"Ставка 40""","Ставка за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС40.Заголовок = ?(ВидимостьЭлемента,"Сумма НДС 40""","Сумма НДС за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиНормативныйПроцентВознаграждения40.Заголовок = ?(ВидимостьЭлемента,"Норм. % вознагр. 40""","Норм. % вознагр. за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"% вознагр. 40""","% вознагр. за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения40.Заголовок = ?(ВидимостьЭлемента,"Сумма вознагр. 40""","Сумма вознагр. за вагон");
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиИтого40.Заголовок = ?(ВидимостьЭлемента,"Итого 40""","Итого за вагон");
	Элементы.ММ_СебестоимостьСуши.Заголовок = ?(ВидимостьЭлемента,"Себестоимость 40""","Себестоимость за вагон");
	Элементы.ММ_Вознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение 40""","Вознаграждение за вагон");
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Элементы.ММ_СтараяСтавкаИтого.Заголовок = ?(ВидимостьЭлемента,"Ставка итого 40""","Ставка итого за вагон");
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Элементы.море40_Себестоимость.Заголовок = ?(ВидимостьЭлемента,"Себестоимость (40"")","Себестоимость (за вагон)");
	Элементы.море40_Вознаграждение.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение (40"")","Вознаграждение (за вагон)");
	Элементы.море40Ставка.Заголовок = ?(ВидимостьЭлемента,"Ставка (40"")","Ставка (за вагон)");
	Элементы.море40_Контрагент.Заголовок = ?(ВидимостьЭлемента,"Контрагент (40"")","Контрагент (вагон)");
	Элементы.ЖД_УслугиВнеСтавкиТариф41.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ЖД_УслугиВнеСтавкиСебестоимость41.Заголовок = ?(ВидимостьЭлемента,"Себестоимость 40""","Себестоимость за вагон");
	Элементы.ЖД_УслугиВнеСтавкиНормВознаграждение41.Заголовок = ?(ВидимостьЭлемента,"Норм. вознагр. 40""","Норм. вознагр. за вагон");
	Элементы.ЖД_УслугиВнеСтавкиВознаграждение41.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение 40""","Вознаграждение за вагон");
	Элементы.ЖД_УслугиВнеСтавкиСтавка41.Заголовок = ?(ВидимостьЭлемента,"Ставка 40""","Ставка за вагон");
	Элементы.ММ_ИтогоСебестоимость.Заголовок = ?(ВидимостьЭлемента,"себестоимость 40""","себестоимость за вагон");
	Элементы.ММ_ИтогоВознаграждение.Заголовок = ?(ВидимостьЭлемента,"вознаграждение 40""","вознаграждение за вагон");
	Элементы.ММ_ИтогоРентабельность.Заголовок = ?(ВидимостьЭлемента,"рентабельность 40""","рентабельность на вагон");
	Элементы.ММ_ИтогоСтавка.Заголовок = ?(ВидимостьЭлемента,"ставка 40""","ставка за вагон");	
	Элементы.Группа71.Видимость = ВидимостьЭлемента И (ПользовательСПолнымиПравами ИЛИ ПользовательСРольюРедактированиеНормативовКонтрибуции); //Евросиб Шевченко А.В. US 99262 TA 107242 23.05.2025
	// закладка "КП"
	Элементы.СебестоимостьПредоставленияПСДля40.Заголовок = ?(ВидимостьЭлемента,"40"""," за вагон");
	Элементы.ЖД_КалькуляцияСебестоимостиТариф40.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ЖД_КалькуляцияСебестоимостиНормВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Норм. вознагр. 40""","Норм. вознагр. за вагон");
	Элементы.ЖД_КалькуляцияСебестоимостиСумма40.Заголовок = ?(ВидимостьЭлемента,"Сумма 40""","Сумма за вагон");
	Элементы.ЖД_Себестоимость40.Заголовок = ?(ВидимостьЭлемента,"Себестоимость 40""","Себестоимость за вагон");
	Элементы.ЖД_Вознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение 40""","Вознаграждение за вагон");
	Элементы.ЖД_Рентабельность40.Заголовок = ?(ВидимостьЭлемента,"Рентабельность 40""","Рентабельность за вагон");
	Элементы.ЖД_СтавкаКлиенту40.Заголовок = ?(ВидимостьЭлемента,"Ставка 40""","Ставка за вагон");
	Элементы.ЖД_УслугиВнеСтавкиТариф40.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ЖД_УслугиВнеСтавкиСебестоимость40.Заголовок = ?(ВидимостьЭлемента,"Себестоимость 40""","Себестоимость за вагон");
	Элементы.ЖД_УслугиВнеСтавкиНормВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Норм. вознагр. 40""","Норм. вознагр. за вагон");
	Элементы.ЖД_УслугиВнеСтавкиВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение 40""","Вознаграждение за вагон");
	Элементы.ЖД_УслугиВнеСтавкиСтавка40.Заголовок = ?(ВидимостьЭлемента,"Ставка 40""","Ставка за вагон");
	Элементы.ЖД_УслугиПоСверхнормативамТариф40.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ЖД_УслугиПоСверхнормативамСебестоимость40.Заголовок = ?(ВидимостьЭлемента,"Себестоимость 40""","Себестоимость за вагон");
	Элементы.ЖД_УслугиПоСверхнормативамНормВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Норм. вознагр. 40""","Норм. вознагр. за вагон");
	Элементы.ЖД_УслугиПоСверхнормативамВознаграждение40.Заголовок = ?(ВидимостьЭлемента,"Вознаграждение 40""","Вознаграждение за вагон");
	Элементы.ЖД_УслугиПоСверхнормативамСтавка40.Заголовок = ?(ВидимостьЭлемента,"Ставка 40""","Ставка за вагон");
	Элементы.СтатистикаПлановыхКППроцент40.Заголовок = ?(ВидимостьЭлемента,"% 40""","% за вагон");
	Элементы.СтатистикаФактическихКППроцент40.Заголовок = ?(ВидимостьЭлемента,"% 40""","% за вагон");
	// закладка "Дополнительно"
	Элементы.ПланПродаж_ДоходыСуммаАванса40.Заголовок = ?(ВидимостьЭлемента,"Сумма аванса 40""","Сумма аванса за вагон");
	Элементы.ПланПродаж_ДоходыСуммаОплаты40.Заголовок = ?(ВидимостьЭлемента,"Сумма оплаты 40""","Сумма оплаты за вагон");
	Элементы.ПланПродаж_РасходыСуммаАванса40.Заголовок = ?(ВидимостьЭлемента,"Сумма аванса 40""","Сумма аванса за вагон");
	Элементы.ПланПродаж_РасходыСуммаОплаты40.Заголовок = ?(ВидимостьЭлемента,"Сумма оплаты 40""","Сумма оплаты за вагон");
	Элементы.ПланПродаж_РасходыТариф40.Заголовок = ?(ВидимостьЭлемента,"Тариф 40""","Тариф за вагон");
	Элементы.ПланПродаж_ДоходыСуммаНДС40.Заголовок = ?(ВидимостьЭлемента,"Сумма НДС 40""","Сумма НДС");
	
	//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
	Если ЭтоМежсервисныеРасходы Тогда
		
		Элементы.Группа8.Скрыть();		
		Элементы.Группа47.Скрыть();		
		Элементы.ГруппаРазделФрахта.Скрыть();

		СписокСкрываемыхРеквизитовДляМР = СписокСкрываемыхРеквизитовДляМежсервисныхРасходов(); 
		Для Каждого ИмяРеквизита Из СписокСкрываемыхРеквизитовДляМР Цикл 
			Элементы[ИмяРеквизита].Видимость = Ложь; 
        КонецЦикла;
		
	КонецЕсли;	
	Элементы.ТарифицируемыйРазмерКТК1.Видимость = ЭтоМежсервисныеРасходы;
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201  
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Субсидии") ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Премии") Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		Элементы.ГруппаСтраницаЖелезнодорожная.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожнаяПредоставление.Видимость = Ложь;   
	КонецЕсли;
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 24.07.2023
	
КонецПроцедуры
	
&НаКлиенте
Процедура ММ_КалькуляцияЖДСоставляющейПробегПриИзменении(Элемент)
	
	ВычислитьДлительностьТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияЖДСоставляющейУслугаПриИзменении(Элемент)
	
	ВычислитьДлительностьТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьДлительностьТекущейСтроки(Знач ТекД = неопределено)
	
	Если ТекД = неопределено Тогда
		ТекД = Элементы.ММ_КалькуляцияЖДСоставляющей.ТекущиеДанные;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекД.Операция) Тогда
		НормыРасчетаДлительности = Услуги_сервер.ПолучитьПараметрыРасчетаДлительностиУслуги(ТекД.Операция);
		ТекД.СчПробег = НормыРасчетаДлительности.Пробег;
	Иначе
		ТекД.СчПробег = Ложь;
	КонецЕсли;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Операция) И ЗначениеЗаполнено(ТекД.Пробег) Тогда
		
		Если НормыРасчетаДлительности.ДлительностьСчитаетсяПоНормативуПерегонаПорожнего Тогда
			ТекД.ДлительностьДней = ТекД.Пробег / НормативныйПробегВСуткиПорожнегоВагонаКМ;
		ИначеЕсли НормыРасчетаДлительности.ДлительностьСчитаетсяПоНормативуПерегонаГруженого Тогда
			ТекД.ДлительностьДней = ТекД.Пробег / НормативныйПробегВСуткиГруженогоВагонаКМ;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачалаНовогоРасчетаВознаграждения = Константы.ДатаНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях.Получить();
	
	Элементы.ГруппаКопированиеКалькуляций.Видимость = Ложь;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// + Состояния
	//ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	//ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	//ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	//Евросиб Каблов 22.09.2020 (
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 22.09.2020 )
	
	СтатистикаПлановыхКП.Параметры.УстановитьЗначениеПараметра("Дата1", ТекущаяДата());
	СтатистикаПлановыхКП.Параметры.УстановитьЗначениеПараметра("Дата2", ДобавитьМесяц(ТекущаяДата(), 12));//Евросиб Гудкова( 20.05.2020 ТекущаяДата()+365*24*3600);
	СтатистикаФактическихКП.Параметры.УстановитьЗначениеПараметра("Дата1", ДобавитьМесяц(ТекущаяДата(), -12));//Евросиб Гудкова( 20.05.2020ТекущаяДата()-365*24*3600);
	СтатистикаФактическихКП.Параметры.УстановитьЗначениеПараметра("Дата2", ТекущаяДата());
	
	ТарифицируемыйРазмерКТК = ?(ЗначениеЗаполнено(Объект.ТарифицируемыйРазмерКТК),Объект.ТарифицируемыйРазмерКТК,"40");
	//Евросиб СубботинВ #133276 11.03.2026 Начало // перенес заполнение при чтении, т.к при изменении и последущем перечитывании данные начинали расходится в пересчете ставок
	//ПериодДействия.ДатаНачала = Объект.НачалоДействия;
	//ПериодДействия.ДатаОкончания = Объект.ОкончаниеДействия;
	//Евросиб СубботинВ #133276 11.03.2026 Конец
	ПериодСтатистики.ДатаНачала = Объект.ЖД_ПериодСбораСтатистикиРаспределенияНачало;
	ПериодСтатистики.ДатаОкончания = Объект.ЖД_ПериодСбораСтатистикиРаспределенияОкончание;
	НормативныйПробегВСуткиГруженогоВагонаКМ = Константы.НормативныйПробегВСуткиГруженогоВагонаКМ.Получить();
	НормативныйПробегВСуткиПорожнегоВагонаКМ = Константы.НормативныйПробегВСуткиПорожнегоВагонаКМ.Получить();
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	УслугаПодсылаВагонов = константы.УслугаПодсылаВагонов.Получить();
	ПерестроитьТаблицуСтавокФрахтаНаСервере();
	ОбновитьДанныеРентабельности();
	
	УслугаФрахтаДляКалькуляции = Константы.УслугаФрахтаДляКалькуляции.Получить();
	
	// конструктор формулы для предоставления без тарифа груженого
	ТгрРжд = "Тгр.Ржд";
	ТгрСоб = "Тгр.соб.";
	ТгрПовагСоб = "Тгр.поваг.соб.";
	ТгрГрупСоб = "Тгр.груп.соб.";
	К = "K";
	С = "S";
	ЛевЗн = "СтКл = ";
	
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрРжд + " * " + К + " - " + ТгрСоб);
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрРжд + " - " + ТгрСоб + " - " + К + " * (" + ТгрРжд + " - " + ТгрСоб + ")");
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрРжд + " - " + К + " * " + ТгрСоб);
	
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + К + " * " + ТгрРжд);
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрРжд + " * " + К + " - " + С);
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрСоб);
	
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + ТгрРжд + " * " + К + " - " + ТгрСоб + " - " + С);
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + К + " * (" + ТгрПовагСоб + " - " + ТгрГрупСоб + ")");
	Элементы.ФормулаВычисленияСтавкиКлиенту.СписокВыбора.Добавить(ЛевЗн + "(" + ТгрРжд + " - " + ТгрСоб + ") * " + К + " - " + С);
	
	ВалютаИтогов = Объект.Валюта;
	СписокСтанцийНазначения.ЗагрузитьЗначения(Объект.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
	СписокСтанцийОтправления.ЗагрузитьЗначения(Объект.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));	
	
	Если НЕ ЗначениеЗаполнено(Объект.ТарифицируемыйРазмерКТК) Тогда
		Объект.ТарифицируемыйРазмерКТК = "40";
	КонецЕсли;
	
	// получить данные по новому механизму фрахта
	ОбновитьТаблицуВыбранныхСтавок(Ложь);     
	
	//ДИТ Авдеева В. 43126 04.04.2022 начало
	//было 
	//Если Объект.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда     
	//стало
	
	// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( Перенесено в отдельную функцию ЗаполнитьОсновнуюУслугу
	//УслугаПоКатегорииДоговора = ПолучитьУслугуПоКатегорииДоговора(Объект.Договор);   
	//
	//Если ЗначениеЗаполнено(УслугаПоКатегорииДоговора) Тогда
	//	ОсновнаяУслуга = УслугаПоКатегорииДоговора;
	//	Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(ОсновнаяУслуга));
	//ИначеЕсли Объект.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
	//ДИТ Авдеева В. 43126 04.04.2022 Конец 
	//	ОсновнаяУслуга = Объект.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
	//	Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(ОсновнаяУслуга));
	//Евросиб - АСуслов 12.11.2021 17:01:47 #
	//(
	//ИначеЕсли Объект.НФ_ВыбранныеСтавки.Количество() > 0 Тогда
	//	ОсновнаяУслуга = УслугаФрахтаДляКалькуляции;
	//	Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(ОсновнаяУслуга));
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 12.11.2021 17:01:47 #  	
	
	// ДИТ US 59973 ТА 75157 Сержантова А.С. Начало: 27.09.2023
	//Если Объект.ТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии Тогда
	//	ОсновнаяУслуга = Справочники.Номенклатура.Премия;
	//	Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(ОсновнаяУслуга));
	//КонецЕсли;
	// ДИТ US 59973 ТА 75157 Сержантова А.С. Конец: 27.09.2023
	// Евросиб Рыбьяков К.А. 02.07.2024 ))
	
	// SIV доп запрос на копирование калькуляций
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании) Тогда
		
		Элементы.ГруппаКопированиеКалькуляций.Видимость = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТехнологическаяСхема.ТСх) КАК ТСх
		               |ИЗ
		               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
		               |ГДЕ
		               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх";
		Запрос.УстановитьПараметр("ПредметТСх", Объект.КалькуляцияСозданаНаОсновании);
		Ответ = Запрос.Выполнить().Выбрать();
		Если ответ.Следующий() Тогда
			Элементы.Декорация17.Заголовок = "В исходной калькуляции имеется " + Ответ.ТСх + " технологических схем. Скопировать их?";
		КонецЕсли;
		
	КонецЕсли;
	
	//ДИТ Пак И.Т. Task34426 14.05.2021 Начало
	ЭтаФорма.ЭтоРежимКопирования = Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	Если ЭтаФорма.ЭтоРежимКопирования Тогда
		ЭтаФорма.ИсточникКопирования = Параметры.ЗначениеКопирования;
		ЭтаФорма.ТипЗаказаИсточник 	 = Параметры.ЗначениеКопирования.ТипЗаказа; //Евросиб Шевченко А.В. US 97821 TA 97822 21.05.2025
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПустаяСсылка(); //Евросиб Шевченко А.В. US 97821 TA 97822 21.05.2025
		КонецЕсли;
	КонецЕсли;
	//ДИТ Пак И.Т. Task34426 14.05.2021 Конец
	
	// Евросиб Фролов (28.12.2021 TASK №43954
	// Ставка НДС недоступна для редактирования если выбрана услуга "Модернизация терминала"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСтавкаНДС.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ММ_КалькуляцияМультимодальнойЦепочки.Услуга");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// "НДС вкл. в ставку" недоступно для редактирования если выбрана услуга "Модернизация терминала"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ММ_КалькуляцияМультимодальнойЦепочкиНДСВключенВСтоимость.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ММ_КалькуляцияМультимодальнойЦепочки.Услуга");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	// Евросиб Фролов)       
	Элементы.ОтсутствуетПеревозкаПоЖД.Подсказка = ПолучитьТекстПодсказкиОтсутствуетПеревозкаПоЖД();
	//Евросиб - АСуслов 21.09.2022 9:30:58 #57542
	//(
	ПользовательСПолнымиПравами = РольДоступна("ПолныеПрава");
	Элементы.ОтсутствуетПеревозкаПоЖД.ТолькоПросмотр = Не ПользовательСПолнымиПравами И Объект.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	//)
	//Евросиб - АСуслов 21.09.2022 9:31:05 #57542
	//ДИТ, Беляев СЮ, US 60121/TA 79276, 27-12-2023, начало
	//Евросиб Коханенко Н.А. 06.08.2025 (( #83408 
	//Элементы.Состояния.Доступность = ПользовательСПолнымиПравами;
	МассивСтатусовСогласований = Новый Массив;
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний); 
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	Элементы.Состояния.Доступность = ПользовательСПолнымиПравами
										ИЛИ (ЭтоМежсервисныеРасходы() 
										И Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияКалькуляции",, Ложь)
										И МассивСтатусовСогласований.Найти(Объект.СтатусДокумента) = Неопределено);
	Элементы.Состояния.ТолькоПросмотр = НЕ (ПользовательСПолнымиПравами
											ИЛИ (ЭтоМежсервисныеРасходы() 
											И Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияКалькуляции",, Ложь)
											И МассивСтатусовСогласований.Найти(Объект.СтатусДокумента) = Неопределено));
	//Евросиб Коханенко Н.А. 06.08.2025 )) #83408 
	//ДИТ, Беляев СЮ, US 60121/TA 79276, 27-12-2023, конец
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 19.09.2024 ((
	Элементы.НФ_ПортОтправления.Видимость = ПользовательСПолнымиПравами;
	// Евросиб Рыбьяков К.А. 19.09.2024 ))
	
	//ДИТ Шевченко А.В. 07.12.22 59978 -начало
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,ПериодДействия.ДатаНачала,ПериодДействия.ДатаОкончания);
		Элементы.НадписьНеДействуетДоговор.Видимость = НЕ ДоговорДействует;
	КонецЕсли;
	//ДИТ Шевченко А.В. 07.12.22 59978 -конец

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	ЭтоДирекцияКонтейнерныхПеревозок = КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент);
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	
	//БИТ Белинский Д.А. 05.04.2023 -начало TASK 6620
	Элементы.ПередислокацияКТК.Видимость = Ложь;
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Если ЭтоМежсервисныеРасходы() и Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() Тогда
	Если ЭтоМежсервисныеРасходы() И КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) Тогда	
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
		ВыбраныМежсервисныеРасходы = Истина;
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Неопределено)); 
	КонецЕсли;
	//БИТ Белинский Д.А. 05.04.2023 -конец  TASK 6620 
	
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
	Если Объект.ТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии ИЛИ Объект.ТипКалькуляции = Перечисления.ТипыКалькуляций.Премии Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		Элементы.ГруппаСтраницаЖелезнодорожная.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожнаяПредоставление.Видимость = Ложь;
	КонецЕсли;
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 24.07.2023
	
	//Евросиб Коханенко Н.А. 11.08.2023 (( #73084 
	ВычислитьКоличествоВыданныхКТКПоСвязаннымЗаявкам();
	//Евросиб Коханенко Н.А. 11.08.2023 )) #73084
	
	//Евросиб - АСуслов 11.09.2023 14:27:39 #локации
	//(
	Суша_ПунктОтправленияТип = ПолучитьТипПункта(Объект.Суша_ПунктОтправления);
	Суша_ПунктНазначенияТип = ПолучитьТипПункта(Объект.Суша_ПунктНазначения);
	//)
	//Евросиб - АСуслов 11.09.2023 14:27:42 #локации
	
	//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, начало
	МассивОсновныхВалют = Валюта_сервер.ПолучитьМассивОсновныхВалют();
	ОсновныеВалюты.ЗагрузитьЗначения(МассивОсновныхВалют);
	
	Элементы.Валюта.РежимВыбораИзСписка = Истина;
	Элементы.Валюта.СписокВыбора.ЗагрузитьЗначения(МассивОсновныхВалют);
	
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВалюта.РежимВыбораИзСписка = Истина;
	Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВалюта.СписокВыбора.ЗагрузитьЗначения(МассивОсновныхВалют);
	
	Элементы.ВалютаИтогов.РежимВыбораИзСписка = Истина;
	Элементы.ВалютаИтогов.СписокВыбора.ЗагрузитьЗначения(МассивОсновныхВалют);
	//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, конец   
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	ТранзитДляКлиента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентапоДокументу(Объект.Ссылка);
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	НормативнаяКонтрибуция = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьНормативнуюКонтрибуциюПоДокументу(Объект.Ссылка); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	//Евросиб Коханенко Н.А. 03.02.2025 (( #100979 
	АвтозаполнениеПродуктаВКалькуляцииСДаты = Константы.АвтозаполнениеПродуктаВКалькуляцииСДаты.Получить();
	ЗаменитьОбработчикиСобытийКлючевыхПолейПродукта();
	Если РольДоступна("dc_МенеджерПоПродажам")
			ИЛИ ПользовательСПолнымиПравами Тогда
		Элементы.ПродуктДКП.ТолькоПросмотр = Ложь;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 03.02.2025 )) #100979 
	
	//Евросиб Коханенко Н.А. 14.07.2025 (( #83408 
	Если НЕ ПользовательСПолнымиПравами
		И ЭтоМежсервисныеРасходы() Тогда
		РазрешитьРедактированиеСостоянияКалькуляции = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияКалькуляции",, Ложь);
		//РазрешитьРедактированиеСостоянияКалькуляции = Истина;
		Элементы.Состояния.Доступность = РазрешитьРедактированиеСостоянияКалькуляции;
		РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостоянияКалькуляции);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 14.07.2025 )) #83408 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипПункта(Пункт)
	ТипПункта = "";
	Если Пункт = Неопределено Тогда
		ТипПункта = "";
	ИначеЕсли ТипЗнч(Пункт) = Тип("СправочникСсылка.Локации") Тогда
		ТипПункта = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Пункт, "Тип");
	ИначеЕсли ТипЗнч(Пункт) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
		ТипПункта = "Адрес";
	КонецЕсли;             
	Возврат ТипПункта;
КонецФункции

	

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаСервере
Процедура ОбновитьДанныеРентабельности()
	
	ОграниченияМаксПроцРент = 0;
	ОграниченияМинПроцРент = 0;
	ОграниченияМаксСуммаРент = 0;
	ОграниченияМинСуммаРент = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НормативыМаржинальностиПеревозокСрезПоследних.МинПроцентСтавки КАК МинПроцентСтавки,
	               |	НормативыМаржинальностиПеревозокСрезПоследних.МаксПроцентСтавки КАК МаксПроцентСтавки,
	               |	НормативыМаржинальностиПеревозокСрезПоследних.МинСуммаРубли КАК МинСуммаРубли,
	               |	НормативыМаржинальностиПеревозокСрезПоследних.МаксСуммаРубли КАК МаксСуммаРубли
	               |ИЗ
	               |	РегистрСведений.НормативыМаржинальностиПеревозок.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И (Клиент = &Клиент
	               |					ИЛИ Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |				И (ВидКалькуляции = &ВидКалькуляции
	               |					ИЛИ ВидКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПустаяСсылка))) КАК НормативыМаржинальностиПеревозокСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НормативыМаржинальностиПеревозокСрезПоследних.Клиент УБЫВ,
	               |	НормативыМаржинальностиПеревозокСрезПоследних.ВидКалькуляции УБЫВ";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Клиент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ВидКалькуляции", Объект.ТипКалькуляции);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ОграниченияМаксПроцРент = Ответ.МаксПроцентСтавки;
		ОграниченияМинПроцРент = Ответ.МинПроцентСтавки;
		ОграниченияМаксСуммаРент = Ответ.МаксСуммаРубли;
		ОграниченияМинСуммаРент = Ответ.МинСуммаРубли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПриИзменении(Элемент, ВычислитьВознаграждениеПоСуммеИтого = Ложь, ПринудительноПересчитать = Ложь)
	
	//Евросиб Коханенко Н.А. 08.04.2024 (( #83546  
	//перенесено с процедуру УстановитьПризнакВнутреннейСебестоимостиПоПараметрам 
	//ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	//Если ТекД <> неопределено Тогда   
	//	ТекД.ВнутренняяСебестоимость = ПолучитьВнутреннююСебестоимость(ТекД.Услуга, ТекД.ПунктОтправления, ТекД.ПунктНазначения);
	//	// Евросиб Фролов (28.12.2021 TASK №43954
	//	Если ТекД.ВнутренняяСебестоимость Тогда
	//		ТекД.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	//		ТекД.НДСВключенВСтоимость = Ложь;
	//	КонецЕсли;
	//	// Евросиб Фролов)
	//КонецЕсли;
	//разрешаем вручную менять признак только, если он допустим в комбинации Номенклатуры и Пунктов отправления или назначения
	УстановитьПризнакВнутреннейСебестоимостиПоПараметрам(Истина);
	//Евросиб Коханенко Н.А. 08.04.2024 )) #83546 
	
	МассивРазрешенныхКПересчетуКолонок = Новый Массив;
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиТариф20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиТариф40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиЦена20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиЦена40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиВалюта");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиСтавкаНДС");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиНДСВключенВСтоимость");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиИтого20");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиИтого40");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппаУслуг");
	МассивРазрешенныхКПересчетуКолонок.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиОсновнаяУслугаГруппы");
	
	Если НЕ ПринудительноПересчитать И (Элемент = неопределено ИЛИ МассивРазрешенныхКПересчетуКолонок.Найти(Элемент.ТекущийЭлемент.Имя) = неопределено) Тогда Возврат; КонецЕсли;
	
	ПосчитатьСтрокуКалькуляцииЖД();
	
	ПараметрыКурса = Новый Соответствие;
	//ММ_СебестоимостьСуши = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Итог("Итого40");
	ММ_СебестоимостьСуши = 0;
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		
		Если Объект.Валюта = Стр.Валюта Тогда
			ММ_СебестоимостьСуши = ММ_СебестоимостьСуши + Стр.Итого40;
		Иначе
			ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Объект.Валюта);
			Если ПараметрыКурсаДокумента = неопределено Тогда
				ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				ПараметрыКурса.Вставить(Объект.Валюта, ПараметрыКурсаДокумента);
			КонецЕсли;
			ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
			Если ПараметрыКурсаСтроки = неопределено Тогда
				ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
			КонецЕсли;
			ММ_СебестоимостьСуши = ММ_СебестоимостьСуши + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Итого40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		КонецЕсли;
	КонецЦикла;
	
	//Если ВычислитьВознаграждениеПоСуммеИтого Тогда
	//	Объект.ММ_Вознаграждение = ММ_СтавкаИтого - ММ_СебестоимостьСуши;
	//Иначе
	//	ММ_СтавкаИтого = ММ_СебестоимостьСуши + Объект.ММ_Вознаграждение;
	//КонецЕсли;
		
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,);
		
КонецПроцедуры

&НаКлиенте
Процедура ММ_СтавкаИтогоПриИзменении(Элемент)
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Объект.ММ_Вознаграждение40 = ММ_СтавкаИтого - ММ_СебестоимостьСуши;
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();
	КонецЕсли;
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ММ_Вознаграждение40ПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ВознаграждениеПриИзменении(Элемент)
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	//ОбновитьИтоговыеПараметрыТаблиц();
	ММ_СтавкаИтого20 = ММ_СебестоимостьСуши20 + Объект.ММ_Вознаграждение;
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,Истина,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура БлокВалютыДокумента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Элементы.Валюта.ТолькоПросмотр = Истина;
		Если КонтрагентРезидент(Объект.Контрагент) Тогда
			Объект.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль");
		КонецЕсли;
		
	Иначе
		
		Элементы.Валюта.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентРезидент(Контрагент)
	
	Возврат (Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия);
	
КонецФункции

&НаКлиенте
Процедура ПодборНаправлений(Команда)
	
//Евросиб Гудкова( 15.07.2020 Ticket№ 0198053
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораНаправлений", ЭтаФорма);
	ОткрытьФорму("Справочник.НаправленияФрахт.ФормаВыбора", Новый Структура("МножественныйВыбор, Отбор", Истина, Новый Структура("ПунктОтправления", Объект.ММ_ПортОтправления)),,ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораНаправлений(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	МассивВыбора = Новый Массив;
	Если ТипЗнч(Параметр1) = Тип("Массив") Тогда
		МассивВыбора = Параметр1;
	Иначе
		МассивВыбора.Добавить(Параметр1);
	КонецЕсли;
	Для каждого Стр из МассивВыбора Цикл
		Объект.ММ_ПодборНаправлений.Добавить().Направление = Стр;
	КонецЦикла;
	ММ_ПодборНаправленийПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьТаблицуСтавокФрахта(Команда)
	
	ММ_ТаблицаСтавокФрахт.Очистить();
	ПерестроитьТаблицуСтавокФрахтаНаСервере();
	ММ_ТаблицаСтавокФрахтПриИзменении(неопределено);	
	
КонецПроцедуры

&НаСервере
Процедура bugfix_ДополнитьТЧ_ПросчитанныеСтавкиИНаправления()
	
	Для каждого Стр из Объект.ММ_ПодборНаправлений Цикл
		//-1
		Найдено = Ложь;
		Для каждого Стр2 из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
			Найдено = Найдено ИЛИ (Стр.Направление = Стр2.Направление);
		КонецЦикла;
		Если НЕ Найдено Тогда
			Объект.ММ_ПросчитанныеСтавкиФрахта.Добавить().Направление = Стр.Направление;
		КонецЕсли;
		//-2
		Найдено = Ложь;
		Для каждого Стр2 из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
			Найдено = Найдено ИЛИ (Стр.Направление = Стр2.Направление);
		КонецЦикла;
		Если НЕ Найдено Тогда
			Для каждого Стр3 из Стр.Направление.СтруктураЗатрат Цикл
				НСтр = Объект.ММ_ПросчитанныеУслугиФрахта.Добавить();
				НСтр.Направление = Стр.Направление;
				НСтр.Услуга = Стр3.Услуга;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьТаблицуСтавокФрахтаНаСервере()
	
	ММ_ТаблицаСтавокФрахт.Очистить();
	
	// сначала сформируем состав колонок
	
	МассивДобавляемыхРеквизитовФормы = Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НаправленияФрахтСтруктураЗатрат.Услуга КАК Услуга,
	               |	НаправленияФрахтСтруктураЗатрат.Ссылка.Линия КАК Линия
	               |ИЗ
	               |	Справочник.НаправленияФрахт.СтруктураЗатрат КАК НаправленияФрахтСтруктураЗатрат
	               |ГДЕ
	               |	НаправленияФрахтСтруктураЗатрат.Ссылка В(&СписокНаправлений)
	               |	И НЕ НаправленияФрахтСтруктураЗатрат.Ссылка.ПометкаУдаления
	               |ИТОГИ ПО
	               |	Линия";
	
	Запрос.УстановитьПараметр("СписокНаправлений", Объект.ММ_ПодборНаправлений.Выгрузить().ВыгрузитьКолонку("Направление"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЛиния = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛиния.Следующий() Цикл
		
		// услуги по линии
		
		НЭлемент = Элементы.Найти("ГруппаММФрахт"+ВыборкаЛиния.Линия.Код);
		Если НЭлемент = неопределено Тогда
			ГруппаТаблицыЛиния = Элементы.Добавить("ГруппаММФрахт"+ВыборкаЛиния.Линия.Код, Тип("ГруппаФормы"), Элементы.ММ_ТаблицаСтавокФрахт);
			ГруппаТаблицыЛиния.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаТаблицыЛиния.ОтображатьВШапке = Истина;
			ГруппаТаблицыЛиния.Заголовок = ВыборкаЛиния.Линия;
		Иначе
			ГруппаТаблицыЛиния = НЭлемент;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаЛиния.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ИмяНовогоРеквизита = "ЛинияУслуга_" + ВыборкаДетальныеЗаписи.Линия.Код + "_" + ВыборкаДетальныеЗаписи.Услуга.Код;
			
			МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10,2,ДопустимыйЗнак.Любой)), "ММ_ТаблицаСтавокФрахт", "", Истина));
			
			НайдЭлемент = Элементы.Найти(ИмяНовогоРеквизита);
			Если НайдЭлемент = неопределено Тогда
				НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
				НКолонка.Вид = ВидПоляФормы.ПолеВвода;
				НКолонка.Заголовок = ВыборкаДетальныеЗаписи.Услуга;
				НКолонка.ТолькоПросмотр = Истина;
				
				//
				//НКолонка.Ширина = 1;
				//НКолонка.РастягиватьПоГоризонтали = Ложь;
				//НКолонка.АвтоМаксимальнаяШирина = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		// вознаграждение и ставка по линии, условия выгрузки
		
		ИмяНовогоРеквизита = "ЛинияУсловия_" + ВыборкаЛиния.Линия.Код;
		МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Строка"), "ММ_ТаблицаСтавокФрахт", "", Истина));
		Если НайдЭлемент = неопределено Тогда
			НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
			НКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НКолонка.Заголовок = "Выгрузка";
			НКолонка.ТолькоПросмотр = Истина;
			
			//
			//НКолонка.АвтоМаксимальнаяШирина = Ложь;
			//НКолонка.Ширина = 1;
			//НКолонка.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
		
		ИмяНовогоРеквизита = "ЛинияВознаграждение_" + ВыборкаЛиния.Линия.Код;
		МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10,2,ДопустимыйЗнак.Любой)), "ММ_ТаблицаСтавокФрахт", "", Истина));
		НайдЭлемент = Элементы.Найти(ИмяНовогоРеквизита);
		Если НайдЭлемент = неопределено Тогда
			НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
			НКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НКолонка.Заголовок = "Вознаграждение";
			НКолонка.УстановитьДействие("ПриИзменении", "ВознаграждениеПриИзменении");
			
			//
			//НКолонка.Ширина = 1;
			//НКолонка.РастягиватьПоГоризонтали = Ложь;
			//НКолонка.АвтоМаксимальнаяШирина = Ложь;
		КонецЕсли;
		
		ИмяНовогоРеквизита = "ЛинияСтавка_" + ВыборкаЛиния.Линия.Код;
		МассивДобавляемыхРеквизитовФормы.Добавить(Новый РеквизитФормы(ИмяНовогоРеквизита, Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10,2,ДопустимыйЗнак.Любой)), "ММ_ТаблицаСтавокФрахт", "", Истина));
		Если НайдЭлемент = неопределено Тогда
			НКолонка = Элементы.Добавить(ИмяНовогоРеквизита, Тип("ПолеФормы"), ГруппаТаблицыЛиния);
			НКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НКолонка.Заголовок = "Ставка";
			НКолонка.УстановитьДействие("ПриИзменении", "СтавкаПриИзменении");
			
			//
			//НКолонка.Ширина = 1;
			//НКолонка.РастягиватьПоГоризонтали = Ложь;
			//НКолонка.АвтоМаксимальнаяШирина = Ложь;
		КонецЕсли;
				
	КонецЦикла;

	МассивУдаляемыхРеквизитовФормы = новый Массив;
	Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("ММ_ТаблицаСтавокФрахт") Цикл
		Если Стр.Имя <> "Порт" тогда МассивУдаляемыхРеквизитовФормы.Добавить(Стр.Путь+"."+Стр.Имя); КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитовФормы, МассивУдаляемыхРеквизитовФормы);
	
	Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("ММ_ТаблицаСтавокФрахт") Цикл
		Если Стр.Имя <> "Порт" И Элементы[Стр.Имя].ПутьКДанным <> Стр.Путь+"."+Стр.Имя тогда 
			Элементы[Стр.Имя].ПутьКДанным = Стр.Путь+"."+Стр.Имя; 
		КонецЕсли;
	КонецЦикла;
	
	// затем заполним строки таблицы пунктами назначения и ранее введенными ставками / посчитанными услугами
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НаправленияФрахт.ПунктНазначения КАК ПунктНазначения
	               |ИЗ
	               |	Справочник.НаправленияФрахт КАК НаправленияФрахт
	               |ГДЕ
	               |	НаправленияФрахт.Ссылка В(&СписокНаправлений)
	               |	И НЕ НаправленияФрахт.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СписокНаправлений", Объект.ММ_ПодборНаправлений.Выгрузить().ВыгрузитьКолонку("Направление"));
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр = ММ_ТаблицаСтавокФрахт.Добавить();
		НСтр.Порт = Ответ.ПунктНазначения;
		
		// вознаграждение и ставка
		Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
			Если Стр.Направление.ПунктНазначения = Ответ.ПунктНазначения Тогда
				ИмяИскомойКолонкиВознаграждение = "ЛинияВознаграждение_"+Стр.Направление.Линия.Код;
				Если Элементы.Найти(ИмяИскомойКолонкиВознаграждение) <> неопределено И Элементы.Найти(ИмяИскомойКолонкиВознаграждение).ПутьКДанным <> "" Тогда
					НСтр[ИмяИскомойКолонкиВознаграждение] = Стр.Вознаграждение;
				КонецЕсли;
				ИмяИскомойКолонкиСтавка = "ЛинияСтавка_"+Стр.Направление.Линия.Код;
				Если Элементы.Найти(ИмяИскомойКолонкиСтавка) <> неопределено И Элементы.Найти(ИмяИскомойКолонкиСтавка).ПутьКДанным <> "" Тогда
					НСтр[ИмяИскомойКолонкиСтавка] = Стр.Ставка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// себестоимость по услугам
		Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
			Если Стр.Направление.ПунктНазначения = Ответ.ПунктНазначения Тогда
				ИмяИскомойКолонкиУслуга = "ЛинияУслуга_"+Стр.Направление.Линия.Код+"_"+Стр.Услуга.Код;
				Если Элементы.Найти(ИмяИскомойКолонкиУслуга) <> неопределено И Элементы.Найти(ИмяИскомойКолонкиУслуга).ПутьКДанным <> "" Тогда
					НСтр[ИмяИскомойКолонкиУслуга] = Стр.Себестоимость;
				КонецЕсли;
				Если ЗначениеЗаполнено(Стр.Тариф) Тогда 
					ИмяИскомойКолонкиУслуга = "ЛинияУсловия_"+Стр.Направление.Линия.Код;
					Если Элементы.Найти(ИмяИскомойКолонкиУслуга) <> неопределено И Элементы.Найти(ИмяИскомойКолонкиУслуга).ПутьКДанным <> "" Тогда
						НСтр[ИмяИскомойКолонкиУслуга] = Лев(Стр.Тариф.ПунктНазначенияУсловия, 2);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ТаблицаСтавокФрахтПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_ТаблицаСтавокФрахт.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ПунктНазначения = ТекД.Порт;
		Для каждого ПодчЭ1 из Элементы.ММ_ТаблицаСтавокФрахт.ПодчиненныеЭлементы Цикл
			Если Лев(ПодчЭ1.Имя, 8) <> "ГруппаММ" Тогда Продолжить; КонецЕсли;
			Для каждого ПодчЭ2 из ПодчЭ1.ПодчиненныеЭлементы Цикл
				
				СтрСтроки = СтрРазделить(ПодчЭ2.Имя, "_", Ложь);
				КодЛинии = СтрСтроки[1];
				//ЛинияСсылка = 
				Направление = ПолучитьНаправление_Кэш(Объект.ММ_ПортОтправления, ПунктНазначения, КодЛинии);
				Если Направление = неопределено Тогда 
					
					Продолжить;
					//ОпОп = Новый ОписаниеОповещения("ВопросСозданияНаправления", ЭтаФорма, Новый Структура("ПортОтправления, ПортНазначения, КодЛинии", Объект.ММ_ПортОтправления, ПунктНазначения, КодЛинии));
					//ПоказатьВопрос(ОпОп, "В системе нет направления " + Объект.ММ_ПортОтправления + " - " + ПунктНазначения + " для линии " + ПодчЭ1.Имя, РежимДиалогаВопрос.ДаНет);
					
				КонецЕсли;
				
				Если СтрНайти(ПодчЭ2.Имя, "ЛинияУслуга") <> 0 Тогда
					// это строка с услугой
					КодУслуги = СтрСтроки[2];
					ЗначениеКода = ТекД[ПодчЭ2.Имя];
					Услуга = ПолучитьУслугу_Кэш(КодУслуги);
					
					СтрНайдена = Ложь;
					Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
						Если Стр.Направление = Направление И Стр.Услуга = Услуга Тогда
							СтрНайдена = Истина;
							Стр.Себестоимость = ЗначениеКода;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ СтрНайдена Тогда
						НСтр = Объект.ММ_ПросчитанныеУслугиФрахта.Добавить();
						НСтр.Направление = Направление;
						НСтр.Услуга = Услуга;
						НСтр.Себестоимость = ЗначениеКода;
					КонецЕсли;
					
				ИначеЕсли СтрНайти(ПодчЭ2.Имя, "ЛинияВознаграждение_") <> 0 Тогда
					// это строка с вознаграждением
					ЗначениеКода = ТекД[ПодчЭ2.Имя];
									
					СтрНайдена = Ложь;
					Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
						Если Стр.Направление = Направление Тогда
							СтрНайдена = Истина;
							Стр.Вознаграждение = ЗначениеКода;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ СтрНайдена Тогда
						НСтр = Объект.ММ_ПросчитанныеСтавкиФрахта.Добавить();
						НСтр.Направление = Направление;
						НСтр.Вознаграждение = ЗначениеКода;
					КонецЕсли;
					
				ИначеЕсли СтрНайти(ПодчЭ2.Имя, "ЛинияСтавка_") <> 0 Тогда
					// это строка со ставкой
					ЗначениеКода = ТекД[ПодчЭ2.Имя];
										
					СтрНайдена = Ложь;
					Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
						Если Стр.Направление = Направление Тогда
							СтрНайдена = Истина;
							Стр.Ставка = ЗначениеКода;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ СтрНайдена Тогда
						НСтр = Объект.ММ_ПросчитанныеСтавкиФрахта.Добавить();
						НСтр.Направление = Направление;
						НСтр.Ставка = ЗначениеКода;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
		//// МОРЕ таблицы
	ММ_МореСтавка = 0;
	ТопНаправление = неопределено;
	ММ_МореВознаграждение = 0;
	ММ_МореСебестоимость = 0;
	Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
		Если Стр.Ставка > ММ_МореСтавка Тогда
			ММ_МореСтавка = Стр.Ставка;
			ТопНаправление = Стр.Направление;
			ММ_МореВознаграждение = Стр.Вознаграждение;
		КонецЕсли;
	КонецЦикла;
	Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
		Если Стр.Направление = ТопНаправление Тогда
			ММ_МореСебестоимость = ММ_МореСебестоимость + Стр.Себестоимость;
			Объект.ПротоколСчитаетсяПоСтавкамКонтрагента = КонтрагентТарифа(Стр.Тариф);
		КонецЕсли;
	КонецЦикла;

	
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,Истина,,Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентТарифа(Тариф)
	
	Если ЗначениеЗаполнено(Тариф) Тогда
		Возврат Тариф.Поставщик;
	КонецЕсли;
	
	Возврат неопределено;
	
КонецФункции

//Евросиб Каблов 28.05.2025 ( #109346
//&НаКлиенте
&НаСервере
//Евросиб Каблов 28.05.2025 )
Процедура ОбновитьИтоговыеПараметрыТаблиц(Валюта,СохранитьВознаграждение = Ложь, КурсВручную = Ложь, СохранитьСтавку = Ложь)
	
	//+++ MM SECTION +++//
	
	// ЖД Таблицы
	ДлитДней = ОкрВверх(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней"));
	Элементы.ММ_КалькуляцияЖДСоставляющейДлительностьДней.ТекстПодвала = Формат(ДлитДней, "ЧДЦ=2; ЧН=");
	Элементы.ММ_КалькуляцияЖДСоставляющейПробег.ТекстПодвала = Формат(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("Пробег"), "ЧДЦ=2; ЧН=");
	Элементы.ММ_КалькуляцияЖДСоставляющейСтоимость.ТекстПодвала = Формат(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("Стоимость"), "ЧДЦ=2; ЧН=");
	Элементы.ММ_КалькуляцияЖДСоставляющейНДС.ТекстПодвала = Формат(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("НДС"), "ЧДЦ=2; ЧН=");
	Элементы.ММ_КалькуляцияЖДСоставляющейСтоимостьИтого.ТекстПодвала = Формат(Объект.ММ_КалькуляцияЖДСоставляющей.Итог("СтоимостьИтого"), "ЧДЦ=2; ЧН=");
	
	ДлитДней = ОкрВверх(Объект.ММ_КалькуляцияКТКСоставляющей.Итог("ДлительностьДней"));
	Элементы.ММ_КалькуляцияКТКСоставляющейДлительностьДней.ТекстПодвала = Формат(ДлитДней, "ЧДЦ=2; ЧН=");
	Элементы.ММ_КалькуляцияКТКСоставляющейПробег.ТекстПодвала = Формат(Объект.ММ_КалькуляцияКТКСоставляющей.Итог("Пробег"), "ЧДЦ=2; ЧН=");
	
	ПараметрыКурса = Новый Соответствие;
	
	НДСНеВкл20 = 0;
	НДСНеВкл40 = 0;
	
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		
		Если НЕ Стр.НДСВключенВСтоимость Тогда
			
			ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Валюта);
			Если ПараметрыКурсаДокумента = неопределено Тогда
				Если Объект.ЗафиксироватьКурс ИЛИ КурсВручную Тогда
					// если курс зафиксирован, то взять данные из реквизитов объекта
					ПараметрыКурсаДокумента = Новый Структура;
					ПараметрыКурсаДокумента.Вставить("Валюта",Валюта);
					ПараметрыКурсаДокумента.Вставить("ДатаКурса",Объект.ДатаКурса);
					ПараметрыКурсаДокумента.Вставить("Кратность",1);
					ПараметрыКурсаДокумента.Вставить("Курс",Объект.Курс);
				Иначе
					ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				КонецЕсли;
				ПараметрыКурса.Вставить(Валюта, ПараметрыКурсаДокумента);
			КонецЕсли;
			ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
			Если ПараметрыКурсаСтроки = неопределено Тогда
				ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
			КонецЕсли;
			
			НДСНеВкл20 = НДСНеВкл20 + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаНДС20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
			НДСНеВкл40 = НДСНеВкл40 + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаНДС40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
			
		КонецЕсли;
	КонецЦикла;
	
	//ММ_СебестоимостьСуши = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Итог("Цена40") + НДСНеВкл40;
	//ММ_СебестоимостьСуши20 = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Итог("Цена20") + НДСНеВкл20;
	
	ММ_СебестоимостьСуши = 0;
	ММ_СебестоимостьСуши20 = 0;
	
	ММ_Вознаграждение40ДоИзм = 0;
	ММ_ВознаграждениеДоИзм = 0;
	
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		
		ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Валюта);
		Если ПараметрыКурсаДокумента = неопределено Тогда
			Если Объект.ЗафиксироватьКурс ИЛИ КурсВручную Тогда
				ПараметрыКурсаДокумента = Новый Структура;
				ПараметрыКурсаДокумента.Вставить("Валюта",Валюта);
				ПараметрыКурсаДокумента.Вставить("ДатаКурса",Объект.ДатаКурса);
				ПараметрыКурсаДокумента.Вставить("Кратность",1);
				ПараметрыКурсаДокумента.Вставить("Курс",Объект.Курс);
			Иначе
				ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
			КонецЕсли;
			ПараметрыКурса.Вставить(Валюта, ПараметрыКурсаДокумента);
		КонецЕсли;
		ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
		Если ПараметрыКурсаСтроки = неопределено Тогда
			ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
			ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
		КонецЕсли;
		
		ММ_СебестоимостьСуши = ММ_СебестоимостьСуши + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		ММ_СебестоимостьСуши20 = ММ_СебестоимостьСуши20 + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		
		Если НЕ СохранитьВознаграждение Тогда
			
			ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Валюта);
			Если ПараметрыКурсаДокумента = неопределено Тогда
				Если Объект.ЗафиксироватьКурс ИЛИ КурсВручную Тогда
					ПараметрыКурсаДокумента = Новый Структура;
					ПараметрыКурсаДокумента.Вставить("Валюта",Валюта);
					ПараметрыКурсаДокумента.Вставить("ДатаКурса",Объект.ДатаКурса);
					ПараметрыКурсаДокумента.Вставить("Кратность",1);
					ПараметрыКурсаДокумента.Вставить("Курс",Объект.Курс);
				Иначе
					ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				КонецЕсли;
				ПараметрыКурса.Вставить(Валюта, ПараметрыКурсаДокумента);
			КонецЕсли;
			ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
			Если ПараметрыКурсаСтроки = неопределено Тогда
				ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
				ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
			КонецЕсли;
			
			ММ_Вознаграждение40ДоИзм = ММ_Вознаграждение40ДоИзм + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаВознаграждения40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
			ММ_ВознаграждениеДоИзм = ММ_ВознаграждениеДоИзм + РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаВознаграждения20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);

		КонецЕсли;

	КонецЦикла;
	
		
	ММ_СебестоимостьСуши = ММ_СебестоимостьСуши + НДСНеВкл40;
	ММ_СебестоимостьСуши20 = ММ_СебестоимостьСуши20 + НДСНеВкл20;
	
	Если НЕ СохранитьВознаграждение Тогда
		Объект.ММ_Вознаграждение40 = ММ_Вознаграждение40ДоИзм;
		Объект.ММ_Вознаграждение = ММ_ВознаграждениеДоИзм;
	КонецЕсли;
	//Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
	//	Если НЕ СохранитьСтавку Тогда
	//		Объект.ММ_Ставка40_1_3 = ММ_СебестоимостьСуши + Объект.ММ_Вознаграждение40;
	//		Объект.ММ_Ставка20_1_3 = ММ_СебестоимостьСуши20 + Объект.ММ_Вознаграждение;
	//	КонецЕсли;
	//	
	//	РассчитатьВознаграждение();
	//Иначе
	//	ММ_СтавкаИтого = ММ_СебестоимостьСуши + Объект.ММ_Вознаграждение40;
	//	ММ_СтавкаИтого20 = ММ_СебестоимостьСуши20 + Объект.ММ_Вознаграждение;
	//КонецЕсли;	                                                             
	
	ММ_СтавкаИтого = ММ_СебестоимостьСуши + Объект.ММ_Вознаграждение40;
	ММ_СтавкаИтого20 = ММ_СебестоимостьСуши20 + Объект.ММ_Вознаграждение;
	
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();
	КонецЕсли;	
	
	//// МОРЕ таблицы
	//ММ_МореСтавка = 0;
	//ТопНаправление = неопределено;
	//ММ_МореВознаграждение = 0;
	//ММ_МореСебестоимость = 0;
	//Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
	//	Если Стр.Ставка > ММ_МореСтавка Тогда
	//		ММ_МореСтавка = Стр.Ставка;
	//		ТопНаправление = Стр.Направление;
	//		ММ_МореВознаграждение = Стр.Вознаграждение;
	//	КонецЕсли;
	//КонецЦикла;
	//Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
	//	Если Стр.Направление = ТопНаправление Тогда
	//		ММ_МореСебестоимость = ММ_МореСебестоимость + Стр.Себестоимость;
	//		Объект.ПротоколСчитаетсяПоСтавкамКонтрагента = КонтрагентТарифа(Стр.Тариф);
	//	КонецЕсли;
	//КонецЦикла;
	
	//+++ ЖД SECTION +++//
	
	ЖД_Себестоимость20 = 0;
	ЖД_Себестоимость40 = 0;
	
	Для каждого Стр из Объект.ЖД_КалькуляцияСебестоимости Цикл
		
		Если Стр.Валюта = Валюта Тогда 
			ЖД_Себестоимость20 = ЖД_Себестоимость20 + Стр.Сумма20;
			ЖД_Себестоимость40 = ЖД_Себестоимость40 + Стр.Сумма40;
		Иначе
			ЖД_Себестоимость20 = ЖД_Себестоимость20 + Валюта_сервер.ПересчитатьПоКурсу(Стр.Сумма20, Стр.Валюта, Валюта, Объект.Дата);
			ЖД_Себестоимость40 = ЖД_Себестоимость40 + Валюта_сервер.ПересчитатьПоКурсу(Стр.Сумма40, Стр.Валюта, Валюта, Объект.Дата);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ЖД_КалькуляцияСебестоимостиСумма.ТекстПодвала = Формат(ЖД_Себестоимость20, "ЧДЦ=2; ЧН=");
	Элементы.ЖД_КалькуляцияСебестоимостиСумма40.ТекстПодвала = Формат(ЖД_Себестоимость40, "ЧДЦ=2; ЧН=");
	
	Элементы.ЖД_КалькуляцияСебестоимостиНормВознаграждение20.ТекстПодвала = Формат(Объект.ЖД_КалькуляцияСебестоимости.Итог("НормВознаграждение20"), "ЧДЦ=2; ЧН=");
	Элементы.ЖД_КалькуляцияСебестоимостиНормВознаграждение40.ТекстПодвала = Формат(Объект.ЖД_КалькуляцияСебестоимости.Итог("НормВознаграждение40"), "ЧДЦ=2; ЧН=");
	
	ЖД_СтавкаКлиенту20 = ЖД_Себестоимость20 + Объект.ЖД_Вознаграждение20;
	ЖД_СтавкаКлиенту40 = ЖД_Себестоимость40 + Объект.ЖД_Вознаграждение40;
	ЖД_Рентабельность20 = Объект.ЖД_Вознаграждение20 / ?(ЖД_СтавкаКлиенту20 = 0, 1, ЖД_СтавкаКлиенту20) * 100;
	ЖД_Рентабельность40 = Объект.ЖД_Вознаграждение40 / ?(ЖД_СтавкаКлиенту40 = 0, 1, ЖД_СтавкаКлиенту40) * 100;
	
	// ИТОГО таблицы
	Попытка
		// Евросиб US 88650 TA 88654 Рыбьяков К.А. 20.12.2024 (( Необходимо доделать, перенести расчет итогов из формы в модуль, 
																//т.к. если создать кальку без формы, итоги не расчитаются 
																//и в протоколе созданном на основании будет ошибка в печатной форме 
		//ПараметрыПересчета = Новый Структура;
		//ПараметрыПересчета.Вставить("ЖД_Себестоимость20", ЖД_Себестоимость20);
		//ПараметрыПересчета.Вставить("ЖД_Себестоимость40", ЖД_Себестоимость40);
		//ПараметрыПересчета.Вставить("ММ_СебестоимостьСуши20", ММ_СебестоимостьСуши20);
		//ПараметрыПересчета.Вставить("ММ_СебестоимостьСуши", ММ_СебестоимостьСуши);
		//Ответ = КалькуляцииЗаявкиПСЦСервер.ПересчитатьРеквизитыИтогов(Объект, ПараметрыПересчета);
		//ЗаполнитьЗначенияСвойств(Объект, Ответ);
		// Евросиб Рыбьяков К.А. 20.12.2024 ))
		
		// Евросиб US 88650 TA 88654 Рыбьяков К.А. 20.12.2024 (( Закомментировал
		Объект.ММ_ИтогоСебестоимость = ММ_СебестоимостьСуши + Валюта_сервер.ПересчитатьПоКурсу(объект.море40_Себестоимость, Объект.ММ_ВалютаФрахтовыхСтавок, Валюта, Объект.Дата) + ЖД_Себестоимость40;
		// Евросиб Рыбьяков К.А. 20.12.2024 ))
		
		//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712
        //Если Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() И ЭтоМежсервисныеРасходы() Тогда
		Если ЭтоДирекцияКонтейнерныхПеревозок И ЭтоМежсервисныеРасходы() Тогда
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712
			Объект.ММ_ИтогоСебестоимость = Объект.ММ_ИтогоСебестоимость + СуммаДельта40;
		КонецЕсли;
		//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
		
		// Евросиб US 88650 TA 88654 Рыбьяков К.А. 20.12.2024 (( Закомментировал
		Объект.ММ_ИтогоВознаграждение = Объект.ММ_Вознаграждение40 + Валюта_сервер.ПересчитатьПоКурсу(объект.море40_Вознаграждение, Объект.ММ_ВалютаФрахтовыхСтавок, Валюта, Объект.Дата) + Объект.ЖД_Вознаграждение40;
		//Объект.ММ_ИтогоСтавка = Объект.ММ_ИтогоСебестоимость + Объект.ММ_ИтогоВознаграждение;	
		//Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		//	Объект.ММ_ИтогоСтавка = Объект.ММ_Ставка40_1_3;
		//Иначе
		//	Объект.ММ_ИтогоСтавка = Объект.ММ_ИтогоСебестоимость + Объект.ММ_ИтогоВознаграждение;
		//КонецЕсли;
		
		Объект.ММ_ИтогоСтавка = Объект.ММ_ИтогоСебестоимость + Объект.ММ_ИтогоВознаграждение;
		
		Объект.ММ_ИтогоРентабельность = Объект.ММ_ИтогоВознаграждение / ?(Объект.ММ_ИтогоСтавка = 0, 1, Объект.ММ_ИтогоСтавка) * 100;
		
		Объект.ММ_ИтогоСебестоимость20 = ММ_СебестоимостьСуши20 + Валюта_сервер.ПересчитатьПоКурсу(объект.море20_Себестоимость, Объект.ММ_ВалютаФрахтовыхСтавок,Валюта, Объект.Дата) + ЖД_Себестоимость20;
		// Евросиб Рыбьяков К.А. 20.12.2024 ))
		
		//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712
        //Если Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() И ЭтоМежсервисныеРасходы() Тогда
		Если ЭтоДирекцияКонтейнерныхПеревозок И ЭтоМежсервисныеРасходы() Тогда
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712
			Объект.ММ_ИтогоСебестоимость20 = Объект.ММ_ИтогоСебестоимость20 + СуммаДельта20;
		КонецЕсли;
		//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
		
		// Евросиб US 88650 TA 88654 Рыбьяков К.А. 20.12.2024 (( Закомментировал
		Объект.ММ_ИтогоВознаграждение20 = Объект.ММ_Вознаграждение + Валюта_сервер.ПересчитатьПоКурсу(объект.море20_Вознаграждение, Объект.ММ_ВалютаФрахтовыхСтавок, Валюта, Объект.Дата) + Объект.ЖД_Вознаграждение20;
		//Объект.ММ_ИтогоСтавка20 = Объект.ММ_ИтогоСебестоимость20 + Объект.ММ_ИтогоВознаграждение20;
		//Объект.ММ_ИтогоСтавка20 = Объект.ММ_Ставка20_1_3;
		//Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		//	Объект.ММ_ИтогоСтавка20 = Объект.ММ_Ставка20_1_3;
		//Иначе
		//	Объект.ММ_ИтогоСтавка20 = Объект.ММ_ИтогоСебестоимость20 + Объект.ММ_ИтогоВознаграждение20;
		//КонецЕсли;
		
		Объект.ММ_ИтогоСтавка20 = Объект.ММ_ИтогоСебестоимость20 + Объект.ММ_ИтогоВознаграждение20;
		Объект.ММ_ИтогоРентабельность20 = Объект.ММ_ИтогоВознаграждение20 / ?(Объект.ММ_ИтогоСтавка20 = 0, 1, Объект.ММ_ИтогоСтавка20) * 100;
		// Евросиб Рыбьяков К.А. 20.12.2024 ))
		
	Исключение
		// нет прав на поля
	КонецПопытки;
	
	Элементы.ПС_ДопРасходыВклВСтавкуСуммаБезНДСРуб.ТекстПодвала = Формат(Объект.ПС_ДопРасходыВклВСтавку.Итог("СуммаБезНДСРуб"), "ЧДЦ=2; ЧН=");
	
	ОбщаяДлительность = Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы;
	Если ОбщаяДлительность > 0 Тогда
		Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
			ПС_РасчетнаяСтавкаПредоставленияСутки = (Объект.ПС_РасчетнаяСтавкаПредоставления - Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС) / ОбщаяДлительность;
		ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КалькуляцияКомплекснойСтавки") Тогда
			ПС_РасчетнаяСтавкаПредоставленияСутки = (Объект.ПС_РасчетнаяСтавкаПредоставления - Объект.ПС_СтавкаГруженогоТарифа - Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС - Объект.ПС_ДопРасходыСуммаВВалютеДокумента ) / ОбщаяДлительность;
		КонецЕсли;
	КонецЕсли;
	
	море20Ставка = Объект.море20_Вознаграждение + Объект.море20_Себестоимость;
	море40Ставка = Объект.море40_Вознаграждение + Объект.море40_Себестоимость;
	
	ПолучитьРасчетнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеПриИзменении(параметр1 = неопределено, параметр2 = неопределено)
	
	ТекД = Элементы.ММ_ТаблицаСтавокФрахт.ТекущиеДанные;
	Себестоимость = 0;
	ИмяРеквизитаСтавки = "";
	Для каждого Стр из параметр1.Родитель.ПодчиненныеЭлементы Цикл
		Если СтрНайти(Стр.Имя, "ЛинияУслуга") > 0 Тогда 
			Себестоимость = Себестоимость + ТекД[Стр.Имя];
		ИначеЕсли СтрНайти(Стр.Имя, "Ставка") > 0 Тогда 
			ИмяРеквизитаСтавки = Стр.Имя; 
		КонецЕсли;
	КонецЦикла;
	Если ИмяРеквизитаСтавки <> "" Тогда
		ТекД[ИмяРеквизитаСтавки] = Себестоимость + ТекД[параметр1.Имя];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении(параметр1 = неопределено, параметр2 = неопределено)
	
	ТекД = Элементы.ММ_ТаблицаСтавокФрахт.ТекущиеДанные;
	Себестоимость = 0;
	ИмяРеквизитаВознаграждение = "";
	Для каждого Стр из параметр1.Родитель.ПодчиненныеЭлементы Цикл
		Если СтрНайти(Стр.Имя, "ЛинияУслуга") > 0 Тогда 
			Себестоимость = Себестоимость + ТекД[Стр.Имя];
		ИначеЕсли СтрНайти(Стр.Имя, "Вознаграждение") > 0 Тогда 
			ИмяРеквизитаВознаграждение = Стр.Имя; 
		КонецЕсли;
	КонецЦикла;
	Если ИмяРеквизитаВознаграждение <> "" Тогда
		ТекД[ИмяРеквизитаВознаграждение] = ТекД[параметр1.Имя] - Себестоимость;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНаправление_Кэш(ПунктОтправления, ПунктНазначения, Линия)
	
	Результат = неопределено;
	
	Для каждого стр из КэшНаправлений Цикл
		Если стр.ПунктОтправления = ПунктОтправления И стр.ПунктНазначения = ПунктНазначения И стр.Линия = Линия Тогда
			Результат = стр.Направление;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Неопределено Тогда
		Результат = ПолучитьНаправление(ПунктОтправления, ПунктНазначения, Линия);
		Если результат <> неопределено Тогда
			КэшНаправлений.Добавить(Новый Структура("ПунктОтправления, ПунктНазначения, Линия, Направление", ПунктОтправления, ПунктНазначения, Линия, Результат));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьУслугу_Кэш(КодУслуги)
	
	Результат = КэшУслуг.Получить(КодУслуги);
	
	Если Результат = Неопределено Тогда
		Результат = Услуги_сервер.ПолучитьУслугуПоКоду(КодУслуги);
		КэшУслуг.Вставить(КодУслуги, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаправление(ПунктОтправления, ПунктНазначения, Линия)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НаправленияФрахт.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НаправленияФрахт КАК НаправленияФрахт
	               |ГДЕ
	               |	НаправленияФрахт.ПунктОтправления В ИЕРАРХИИ(&ПунктОтправления)
	               |	И НаправленияФрахт.ПунктНазначения В ИЕРАРХИИ(&ПунктНазначения)
	               |	И НаправленияФрахт.Линия.Код ПОДОБНО &Линия
	               |	И НЕ НаправленияФрахт.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);
	Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
	Запрос.УстановитьПараметр("Линия", Линия);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Тарификатор(Команда)
	
	bugfix_ДополнитьТЧ_ПросчитанныеСтавкиИНаправления();
	ПерестроитьТаблицуСтавокФрахта(неопределено);
	СтруктураПараметров = Новый Массив;
	Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
		СтруктураПараметров.Добавить(Новый Структура("Направление, Услуга", Стр.Направление, Стр.Услуга));
	КонецЦикла;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораТарифов", ЭтаФорма);
	ОткрытьФорму("Документ.Калькуляция.Форма.ПодборТарифаКалькуляцией", Новый Структура("ПоискТарифов, ДатаПоиска, Груженый, Организация, РазмерКТК", СтруктураПараметров, Объект.ММ_ДействиеСтавокНа, Объект.ММ_ГруженыйПоМорю, Объект.Организация, Объект.ММ_МореРазмерКТК),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТарифов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено Тогда
		
		ОбработкаВыбораТарифов_сервер(Параметр1);
		
		ПерестроитьТаблицуСтавокФрахта(неопределено);
		ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораТарифов_сервер(Параметр1)
	
	Для каждого СтрТариф из Параметр1 Цикл
		Для каждого СтрТЧ из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
			Если ЗначениеЗаполнено(СтрТариф.Себестоимость) И СтрТариф.Направление = СтрТЧ.Направление И СтрТариф.Услуга = СтрТЧ.Услуга Тогда
				
				СтрТЧ.Себестоимость = СтрТариф.Себестоимость; //Валюта_сервер.ПересчитатьПоКурсу(СтрТариф.Себестоимость, СтрТариф.Валюта, Объект.Валюта, Объект.Дата);
				СтрТЧ.Тариф = СтрТариф.Тариф;
				
			КонецЕсли;
		КонецЦикла;
		
		ТЧУслуг = Объект.ММ_ПросчитанныеУслугиФрахта.Выгрузить();
		ТЧУслуг.Свернуть("Направление", "Себестоимость");
		Для каждого Стр из ТЧУслуг Цикл
			НайдСтроки = Объект.ММ_ПросчитанныеСтавкиФрахта.НайтиСтроки(Новый Структура("Направление", Стр.Направление));
			Если НайдСтроки.Количество() > 0 Тогда
				НайдСтроки[0].Ставка = НайдСтроки[0].Вознаграждение + Стр.Себестоимость;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ММ_СтавкаПредоставленияПлатформыПриИзменении(Элемент)
	
	ММ_КалькуляцияЖДСоставляющейПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КоличествоКТКНаВагонПриИзменении(Элемент)
	
	ММ_КалькуляцияЖДСоставляющейПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамикаЦен(Команда)
	
	МассивНаправлений = Новый Массив;
	Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
		МассивНаправлений.Добавить(Стр.Направление);
	КонецЦикла;
	
	ОткрытьФорму("Документ.Калькуляция.Форма.ДинамикаЦен", Новый Структура("Направления, ПунктОтправления, РазмерКТК, Организация, ГруженыеКТК", МассивНаправлений, Объект.ММ_ПортОтправления, Объект.ММ_МореРазмерКТК, Объект.Организация, Объект.ММ_ГруженыйПоМорю),, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ВсеДействующиеДоговоры = КонтрагентыДоговоры_сервер.ПолучитьДействующиеДоговорыКонтрагента(Объект.Контрагент, Объект.Дата, Истина);
	Если ВсеДействующиеДоговоры.Количество() = 1 Тогда
		Объект.Договор = ВсеДействующиеДоговоры[0];
	КонецЕсли;
	ДоговорПриИзменении(неопределено);
	ОбновитьДанныеРентабельности();
	//БлокВалютыДокумента(); 
	
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	ЭтоДирекцияКонтейнерныхПеревозок = КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент);
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	
	//Евросиб Коханенко Н.А. 31.07.2023 (( #72829 
	ОбновитьВидимостьПолейДляСлужебнойКалькуляции();
	//Евросиб Коханенко Н.А. 31.07.2023 )) #72829 
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьКТКНаВагон(Параметр1 = неопределено)
	
	Объект.ММ_КоличествоКТКНаВагон = Объект.ММ_КоличествоКТК / ?(Объект.ММ_КоличествоВагонов=0, 1, Объект.ММ_КоличествоВагонов);
	ММ_КоличествоКТКНаВагонПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьДанныеРентабельности();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимКалькуляцииПриИзменении(Элемент)
	
	ОбновитьВидимостьПолейПриСменеВидаКалькуляции();    
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
	ОчиститьДанныеСкрываемыхВкладок(); // для вида калькуляции Субсидии
	// ДИТ US 59973 ТА 68125 Сержантова А.С. Конец: 24.07.2023
	ОбновитьДанныеРентабельности();

	//БИТ Белинский Д.А. 06.04.2023 -начало TASK 66201
	Если ЭтоМежсервисныеРасходы() Тогда
		                                                                                                                  Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ктк");
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
		//Объект.Контрагент = ДирекцияКонтейнерныхПеревозок(); 
		Объект.Контрагент = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтрагентДирекцияКонтейнерныхПеревозок"); 
        //Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
		КонтрагентПриИзменении(Неопределено);
		//Евросиб Шевченко А.В. US 97821 TA 97822 21.05.2025
		Если НЕ ЭтаФорма.ЭтоРежимКопирования Тогда
			Объект.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.КонтейнерныйПоезд");
		Иначе	
			Если НЕ ЗначениеЗаполнено(ЭтаФорма.ТипЗаказаИсточник) Тогда
				Объект.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.КонтейнерныйПоезд");	
			Иначе
				Объект.ТипЗаказа = ЭтаФорма.ТипЗаказаИсточник;
			КонецЕсли;	
		КонецЕсли;
		//Евросиб Шевченко А.В. US 97821 TA 97822 21.05.2025
		ВыбраныМежсервисныеРасходы = Истина; 
		Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Неопределено));
		Для Каждого СтрокаТЧ Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			
			СтрокаТЧ.НормативныйПроцентВознаграждения20 = 0;
			СтрокаТЧ.Вознаграждение20 = 0;
			СтрокаТЧ.СуммаВознаграждения20 = 0;
			СтрокаТЧ.НормативныйПроцентВознаграждения40 = 0;
			СтрокаТЧ.Вознаграждение40 = 0;
			СтрокаТЧ.СуммаВознаграждения40 = 0;
			СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
			
			ПосчитатьСтрокуКалькуляцииЖД(СтрокаТЧ); 
			
		КонецЦикла;
		ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);

	ИначеЕсли ВыбраныМежсервисныеРасходы Тогда
		Объект.Контрагент = Неопределено; 
 		Объект.Договор = Неопределено; 
		Объект.ТипЗаказа = Неопределено;
		ВыбраныМежсервисныеРасходы = Ложь;
	КонецЕсли;
	//БИТ Белинский Д.А. 06.04.2023 -конец TASK 66201
	
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
		Объект.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.ПовагоннаяОтправка");
		Объект.ПродуктДКП = ПредопределенноеЗначение("Справочник.ПродуктыДКП.СдачаВагонаВПользование"); //ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
		//Евросиб Каблов 28.05.2025 ( #109346
		ОбновитьСтоимостьУслуг(Ложь, Истина);
		//Евросиб Каблов 28.05.2025 )
	КонецЕсли;
	
	//Евросиб Каблов 19.04.2021 ( Ticket#0227397
	//Объект.ЕдиницаИзмерения = ПолучитьРеквизитСсылкиНаСервере(ОсновнаяУслуга, "ЕдиницаИзмерения").ЕдиницаИзмерения;
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого")
		//Евросиб Коханенко Н.А. 02.09.2025 (( #118267 
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ДоплатныеПВ")
		//Евросиб Коханенко Н.А. 02.09.2025 )) #118267 
		Или Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом") Тогда
		
		Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон");
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная") 

		//БИТ Белинский Д.А. 05.04.2023 -начало TASK 66201
		//ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Передислокация") Тогда
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Доплатные") Тогда
		//БИТ Белинский Д.А. 05.04.2023 -конец TASK 66201
				
		Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ктк");
		
	КонецЕсли;  
	
	// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 ((
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Субсидии") ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Премии") Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		Объект.ОсновнаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.Премия");
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Объект.ОсновнаяУслуга));
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 02.07.2024 ))
	
	//Евросиб Каблов 19.04.2021 )
	//Евросиб - АСуслов 30.08.2022 16:27:05 #56211
	//(
	ЗаполнитьУчетноеНаправление();
	//)
	//Евросиб - АСуслов 30.08.2022 16:27:25 #56211 
	
	//Евросиб Коханенко Н.А. 23.12.2024 (( #97643 
	ЗаполнитьПС_ВидПеревозки();
	//Евросиб Коханенко Н.А. 23.12.2024 )) #97643 
	
	//Евросиб Коханенко Н.А. 31.07.2023 (( #72829 
	ОбновитьВидимостьПолейДляСлужебнойКалькуляции();
	//Евросиб Коханенко Н.А. 31.07.2023 )) #72829 
	
	ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения(); //Евросиб Шевченко А.В. US 117355 TA 121128 07.10.2025
	
КонецПроцедуры   

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
&НаСервере
Процедура ОчиститьДанныеСкрываемыхВкладок()
	
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Субсидии") ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Премии") Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		РекурсивноОчиститьДанныеВкладки(Элементы.ГруппаСтраницаЖелезнодорожная); 
		РекурсивноОчиститьДанныеВкладки(Элементы.ГруппаЖелезнодорожнаяПредоставление); 	
	КонецЕсли;

КонецПроцедуры

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 24.07.2023
&НаСервере
Процедура РекурсивноОчиститьДанныеВкладки(ЭлементОчищения)
	
	Для каждого ЭлементГруппы Из ЭлементОчищения.ПодчиненныеЭлементы Цикл 
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			РекурсивноОчиститьДанныеВкладки(ЭлементГруппы)	
		ИначеЕсли ТипЗнч(ЭлементГруппы) <> Тип("ПолеФормы") 
			и ТипЗнч(ЭлементГруппы) <> Тип("ТаблицаФормы") Тогда
			Продолжить;
		Иначе
			ИменаЭл = СтрРазделить(ЭлементГруппы.ПутьКДанным, ".", Ложь);
			Если ИменаЭл.Количество() > 1 и ИменаЭл[0] = "Объект" Тогда 
				Если Объект[ИменаЭл[1]] = Неопределено Тогда  //значение не заполнено
					Продолжить;	
				КонецЕсли;
				Если ТипЗнч(Объект[ИменаЭл[1]]) = Тип("ДанныеФормыКоллекция")  Тогда
					Объект[ИменаЭл[1]].Очистить();
					Продолжить;  
				ИначеЕсли ТипЗнч(Объект[ИменаЭл[1]]) = Тип("Число")  Тогда
					Объект[ИменаЭл[1]] = 0;  
					Продолжить;
				ИначеЕсли ТипЗнч(Объект[ИменаЭл[1]]) = Тип("Строка")  Тогда
					Объект[ИменаЭл[1]] = "";   
					Продолжить;
				ИначеЕсли ТипЗнч(Объект[ИменаЭл[1]]) = Тип("Булево")  Тогда
					Объект[ИменаЭл[1]] = Ложь; 
					Продолжить;
				КонецЕсли;
				ТипСтрокой = Объект[ИменаЭл[1]].Метаданные().ПолноеИмя();
				ТипСтрокой = СтрЗаменить(ТипСтрокой, "Справочник", "СправочникСсылка");
				ТипСтрокой = СтрЗаменить(ТипСтрокой, "Документ", "ДокументСсылка");
                ТипСтрокой = СтрЗаменить(ТипСтрокой, "Перечисление", "ПеречислениеСсылка");
				ТипЗначения = Новый ОписаниеТипов(ТипСтрокой);
				Объект[ИменаЭл[1]] = ТипЗначения.ПривестиЗначение();
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Евросиб Коханенко Н.А. 25.12.2023 (( #78960
	//было:
	//Евросиб Коханенко Н.А. 31.07.2023 (( #72829 
	//Если Элементы.ГруппаОтнестиРасходы.Видимость Тогда
	//	
	//	//в служебной сделке должно быть выбрано либо одно, либо другое из полей
	//	Если НЕ (Объект.ОтнестиРасходыНаСебестоимостьКлиента ИЛИ Объект.ОтнестиРасходыНаСобственныеЗатраты) Тогда
	//		ОбщегоНазначенияКлиент.СообщитьПользователю("Калькуляция не может быть проведена, т.к. вы не выбрали условие по отнесению затрат.",,"Объект.ДобавитьРасходыНаСобственныеЗатраты",, Отказ);
	//	КонецЕсли;
	//	
	//	//в случае отклонения поле комментария состояния должно быть заполнено
	//	ПроверитьЗаполненностьКомментарияПриОтклоненииСлужебнойКалькуляции(Отказ);
	////ДИТ Шевченко А.В. US 62360 ТА 76584 26.10.2023 -начало временно попросили заблокировать вывод сообщения	
	////ДИТ Шевченко А.В. US 62360 ТА 73011 03.08.2023 -начало	
	//Иначе
	//	//Если НЕ ЗначениеЗаполнено(Объект.ПродуктДКП) И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Поле Продукт не заполнено. Проведение документа запрещено",,"Объект.ПродуктДКП");
	//	//КонецЕсли;
	////ДИТ Шевченко А.В. US 62360 ТА 73011 03.08.2023 -конец
	////ДИТ Шевченко А.В. US 62360 ТА 76584 26.10.2023 -начало
	//КонецЕсли;
	//
	//Евросиб Коханенко Н.А. 31.07.2023 )) #72829
	//стало:
	ПроверитьЗаполненностьКомментарияПриОтклоненииСлужебнойКалькуляции(Отказ);
	//Евросиб Коханенко Н.А. 25.12.2023 )) #78960 
	
	//Евросиб Гудкова( 04.06.2020
	//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Если Не (ЭтоМежсервисныеРасходы() И Объект.Контрагент = ДирекцияКонтейнерныхПеревозок()) Тогда
	Если Не (ЭтоМежсервисныеРасходы() И ЭтоДирекцияКонтейнерныхПеревозок) Тогда
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
		Если Не ЗначениеЗаполнено(Объект.ОсновнаяУслуга) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для записи калькуляции необходимо заполнить основную услугу.",, "Объект.ОсновнаяУслуга",, Отказ);
			Возврат;
		КонецЕсли;
		//Евросиб Гудкова( 16.09.2020 Ticket№ 0206886
		Если Не ПолучитьРеквизитСсылкиНаСервере(Объект.ОсновнаяУслуга, "Доходная").Доходная Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для записи калькуляции необходимо выбрать основную услугу, разрешенную для выставления клиенту.",,"Объект.ОсновнаяУслуга",, Отказ);
		КонецЕсли;
		Для каждого Строка Из Объект.ЖД_УслугиВнеСтавки Цикл
			Если Строка.ВидРасходов = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Себестоимость") 
				И Строка.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавокПротокола.Ставка")
				И Не ПолучитьРеквизитСсылкиНаСервере(Строка.Услуга, "Доходная").Доходная Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("В строке " + Строка.НомерСтроки + " таблицы 3 выбрана услуга, запрещенная к выбору для выставления клиенту.",,,, Отказ);
			КонецЕсли; 
		КонецЦикла; 
		// Евросиб Гудкова) 
	КонецЕсли;
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201 

   	//Евросиб - АСуслов 14.05.2021 16:41:01 #
	//(
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПС_ВидПеревозки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен вид перевозки",,"ПС_ВидПеревозки","Объект",Отказ);
		КонецЕсли;   
		
		//ДИТ Авдеева В. 43126 04.04.2022 начало  
		КатегорияДоговора = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Договор, "КатегорияДоговора"); 
		ЗначениеУслуги = ПолучитьУслугуПоКатегорииДоговора(Объект.Договор);
		Если ЗначениеЗаполнено(ЗначениеУслуги) И ЗначениеУслуги <> Объект.ОсновнаяУслуга Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Обратите внимание! Основная услуга в калькуляции: " + Объект.ОсновнаяУслуга 
															+ " отличается от категории договора: " + КатегорияДоговора);
	    КонецЕсли;
		//ДИТ Авдеева В. 43126 04.04.2022 конец 
	КонецЕсли; 
	//)
	//Евросиб - АСуслов 14.05.2021 16:41:01 #
	
	// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( Закомментировал 
	//Если Объект.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
	//	Объект.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга = ОсновнаяУслуга;
	//КонецЕсли;
	// Евросиб Рыбьяков К.А. 02.07.2024 ))
	
	Объект.НачалоДействия = ПериодДействия.ДатаНачала;
	Объект.ОкончаниеДействия = ПериодДействия.ДатаОкончания;
	Объект.ЖД_ПериодСбораСтатистикиРаспределенияНачало = ПериодСтатистики.ДатаНачала;
	Объект.ЖД_ПериодСбораСтатистикиРаспределенияОкончание = ПериодСтатистики.ДатаОкончания;
	
	Если Объект.КалькуляцияЗавершена Тогда
		
		Если ЗначениеЗаполнено(ОграниченияМаксПроцРент) И ОграниченияМаксПроцРент < Объект.ММ_ИтогоРентабельность Тогда
			Сообщить("Процент рентабельности не может быть выше " + ОграниченияМаксПроцРент);
			Отказ = истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОграниченияМинПроцРент) И ОграниченияМинПроцРент > Объект.ММ_ИтогоРентабельность Тогда
			Сообщить("Процент рентабельности не может быть ниже " + ОграниченияМинПроцРент);
			Отказ = истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОграниченияМаксСуммаРент) И ОграниченияМаксСуммаРент < Объект.ММ_ИтогоВознаграждение Тогда
			Сообщить("Сумма вознаграждения не может быть выше " + ОграниченияМаксСуммаРент);
			Отказ = истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОграниченияМинСуммаРент) И ОграниченияМинСуммаРент > Объект.ММ_ИтогоВознаграждение Тогда
			Сообщить("Сумма вознаграждения не может быть ниже " + ОграниченияМинСуммаРент);
			Отказ = истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// пересчитать итого в подвале, если валюта итого и валюта содержат разные данные
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,Истина,,Истина);
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Объект.Дата);
		//++ Зубов 03.08.2021 37315
		//КонецЕсли;
		//-- Зубов 03.08.2021 37315
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////
	// запись данных по новому механизму рассчета фрахта
	Объект.ФрахтИмпорт = ?(ФрахтИмпортЭкспорт = 0,Истина,Ложь);
	Объект.ТарифицируемыйРазмерКТК = ТарифицируемыйРазмерКТК;
	// таблица выбранных ставок
	//ПоместитьТаблицуСФормы();
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, начало
	ПоместитьТаблицуСФормы(Отказ);
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, конец
	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПроцДоходности = 0;
	//		Если Объект.ММ_ИтогоРентабельность <> 0 Тогда
	//			 ПроцДоходности = Объект.ММ_ИтогоРентабельность;
	//		 КонецЕсли;
	//		 Если Объект.ММ_ИтогоРентабельность20 <> 0 И Объект.ММ_ИтогоРентабельность20 < Объект.ММ_ИтогоРентабельность Тогда
	//			 ПроцДоходности = Объект.ММ_ИтогоРентабельность20;
	//		 КонецЕсли;
	//		 
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("МинимальныйПроцентДоходности", ПроцДоходности);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ПС_ВидПеревозки);
	//		ПараметрыЗапроса.Вставить("РежимКалькуляции", Объект.РежимКалькуляции);
	//		ПараметрыЗапроса.Вставить("ДействующийКлиент", ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании));
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	// Евросиб Фролов (28.12.2021 TASK№ 42761
	БылиИзменения = Модифицированность;
	// Евросиб Фролов)
	
	Если ПараметрыЗаписи.Свойство("ПропуститьПроверку") 
		И ПараметрыЗаписи.ПропуститьПроверку Тогда
		Возврат;
	КонецЕсли;
	СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД = ПроверитьНеобходимостьУстановитьПризнакОтсутствуетПеревозкаПоЖДНаСервере();
	//если признак в сохранненном варианте отличается от признака в сохраняемом, то задаём вопрос пользователю
	
	Если СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту 
		И СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту <> СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоСсылке Тогда
		Если СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту = Объект.ОтсутствуетПеревозкаПоЖД Тогда
			Отказ = Истина;            
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			ТекстВопроса = НСтр("ru = 'Установлен тип заказа «Предоставление вагонов». Расходы на ЖД будут включены. Снять признак «Отсутствует перевозка по ЖД»?'");	
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, снять");
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет");
			ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Ложь);
			Оповещение = Новый ОписаниеОповещения("ВопросУстановитьСнятьПризнакОтсутствуетПеревозкаПоЖД", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);
		КонецЕсли;
	ИначеЕсли (СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоОбъекту <> СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоСсылке 
		ИЛИ СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту <> СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоСсылке) 
		И СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоОбъекту <> Объект.ОтсутствуетПеревозкаПоЖД
		//ИЛИ СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоТипуЗаказаПоОбъекту <> Объект.ОтсутствуетПеревозкаПоЖД)
		Тогда
		Отказ = Истина;            
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		Если СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоОбъекту Тогда
			ТекстВопроса = НСтр("ru = 'В калькуляции не запланированы расходы на ЖД. Установить признак «Отсутствует перевозка по ЖД»?'");	
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, установить");
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет");
			ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Истина);
		Иначе
			ТекстВопроса = НСтр("ru = 'В калькуляции запланированы расходы на ЖД. Снять признак «Отсутствует перевозка по ЖД»?'");	
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, снять");
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет"); 
			ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Ложь);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросУстановитьСнятьПризнакОтсутствуетПеревозкаПоЖД", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);
 	ИначеЕсли Объект.ОтсутствуетПеревозкаПоЖД <> СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.ОтсутствуетПеревозкаПоЖДПоСсылке Тогда
		//Если (СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьСнятьПризнакПоТипуЗаказаПоОбъекту <> (Объект.ОтсутствуетПеревозкаПоЖД = Ложь)
		//	 ИЛИ СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.НеобходимостьУстановитьПризнакПоОбъекту <> (Объект.ОтсутствуетПеревозкаПоЖД = Истина)) 
		Если СтруктураНеобходимоУстановитьПризнакОтсутствуетПеревозкаПоЖД.ВКалькуляцииЗапланированыРасходыПоЖДПоОбъекту = Объект.ОтсутствуетПеревозкаПоЖД
			Тогда
			Отказ = Истина;            
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			Если Объект.ОтсутствуетПеревозкаПоЖД Тогда
				ТекстВопроса = НСтр("ru = 'В калькуляции запланированы расходы на ЖД. Всё равно установить признак «Отсутствует перевозка по ЖД»?'");	
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, установить");
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет, снять");
				ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Истина);
				ДополнительныеПараметры.Вставить("ЗначениеЕслиНет", Ложь);
			Иначе
				ТекстВопроса = НСтр("ru = 'В калькуляции не запланированы расходы на ЖД. Всё равно снять признак «Отсутствует перевозка по ЖД»?'");	
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, снять");
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет, установить"); 
				ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Ложь);
				ДополнительныеПараметры.Вставить("ЗначениеЕслиНет", Истина);
			КонецЕсли;
			Оповещение = Новый ОписаниеОповещения("ВопросУстановитьСнятьПризнакОтсутствуетПеревозкаПоЖД", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьУстановитьПризнакОтсутствуетПеревозкаПоЖДНаСервере()
	Возврат Документы.Калькуляция.ПроверитьНеобходимостьУстановитьПризнакОтсутствуетПеревозкаПоЖД(Объект);	
КонецФункции

//Евросиб - АСуслов 07.09.2022 10:51:20 #56211
//(
&НаКлиенте
Процедура ЗаполнитьУчетноеНаправление()
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.РефрижераторныеПеревозки") Тогда
		Объект.УчетноеНаправление = ПредопределенноеЗначение("Справочник.УчетныеНаправления.РефрижераторныеПеревозки")
	//Евросиб Коханенко Н.А. 02.12.2024 (( #96360 
	//ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная") Тогда
	//	Объект.УчетноеНаправление = ПредопределенноеЗначение("Справочник.УчетныеНаправления.МультимодальныеПеревозки")  
	//Евросиб Коханенко Н.А. 02.12.2024 )) #96360 
	//БИТ Белинский Д.А. 06.04.2023 -начало TASK 66201
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы") Тогда
		Объект.УчетноеНаправление = ПредопределенноеЗначение("Справочник.УчетныеНаправления.МежсервисныеРасходы")  
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф") Тогда
		Объект.УчетноеНаправление = ПредопределенноеЗначение("Справочник.УчетныеНаправления.РефрижераторныеПеревозки")  
	//БИТ Белинский Д.А. 06.04.2023 -конец TASK 66201
	Иначе
		Объект.УчетноеНаправление = Неопределено;
	КонецЕсли;
КонецПроцедуры
//)
//Евросиб - АСуслов 07.09.2022 10:51:22 #56211

&НаСервере
//Процедура ПоместитьТаблицуСФормы()
//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, добавлен параметр Отказ
Процедура ПоместитьТаблицуСФормы(Отказ)
	
	//Евросиб - АСуслов 08.04.2022 9:50:03 #42899
	//(
	ИдентификаторыВыбранныхСтавок.Загрузить(Объект.НФ_ВыбранныеСтавки.Выгрузить());
	//)
	//Евросиб - АСуслов 08.04.2022 9:50:52 #42899
	
	Объект.НФ_ВыбранныеСтавки.Очистить();
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, начало
	ТаблицаСопоставленияПолей = Новый ТаблицаЗначений; //таблица для сопоставления полей ТЧ НФ_ВыбранныеСтавки и таблицы формы НФ_ЛинииПорты, потребуется для подсветки полей пользователю
	ТаблицаСопоставленияПолей.Колонки.Добавить("ИдентификаторСтроки");
	ТаблицаСопоставленияПолей.Колонки.Добавить("Статья");
	ТаблицаСопоставленияПолей.Колонки.Добавить("Индекс");
	ТаблицаСопоставленияПолей.Колонки.Добавить("ИмяКолонки");
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, конец
	
	КолонкиТбл = НФ_ЛинииПорты.Выгрузить().Колонки;
	Для Каждого Кол Из КолонкиТбл Цикл
		ТекКолонка = Кол.Имя;
		
		ТекПортSOC = "";
		ТекПортCOC = "";
		
		Если (НЕ СтрНайти(ТекКолонка,"SOC") = 0 ИЛИ НЕ СтрНайти(ТекКолонка,"COC") = 0) Тогда
			Если СтрНайти(ТекКолонка,"Выбрано") = 0 Тогда
				ТекПортSOC = СтрЗаменить(ТекКолонка,"НФ_ИмяПорта_SOC_","");
				ТекПортCOC = СтрЗаменить(ТекКолонка,"НФ_ИмяПорта_COC_","");
			Иначе
				ТекПортSOC = СтрЗаменить(ТекКолонка,"НФ_ИмяПорта_Выбрано_SOC_","");
				ТекПортCOC = СтрЗаменить(ТекКолонка,"НФ_ИмяПорта_Выбрано_COC_","");
			КонецЕсли;
			
			// тек порт
			ТекПортSOCСсылка = Справочники.Локации.НайтиПоКоду(ТекПортSOC);
			ТекПортCOCСсылка = Справочники.Локации.НайтиПоКоду(ТекПортCOC);
			
			Порт = ?(ЗначениеЗаполнено(ТекПортSOCСсылка),ТекПортSOCСсылка,ТекПортCOCСсылка);
			SOCCOC = ?(ЗначениеЗаполнено(ТекПортSOCСсылка),"SOC","COC");
			
			Если НЕ ЗначениеЗаполнено(Порт) Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрЛиния Из Объект.НФ_Линии Цикл
				
				Если Объект.НФ_ПортыОтгрузкиВыгрузки.Количество() > 0 Тогда
					
					Для Каждого СтрокаПортВыгрузки Из Объект.НФ_ПортыОтгрузкиВыгрузки Цикл
						// ищем контрагента в таблице
						ПараметрыОтбораКонтр = Новый Структура;
						ПараметрыОтбораКонтр.Вставить("Контрагент",СтрЛиния.Линия);
						// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
						ПараметрыОтбораКонтр.Вставить("Порт", СтрокаПортВыгрузки.Порт);
						// Евросиб Рыбьяков К.А. 11.09.2024 ))
						НайденныеКонтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбораКонтр);
						
						Для Каждого Стр ИЗ НайденныеКонтр Цикл
							
							// для каждого порта и контрагента своя строка. проверяем на уникальность
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("Порт",Порт);
							ПараметрыОтбора.Вставить("SOCCOC",SOCCOC);
							ПараметрыОтбора.Вставить("Контрагент",СтрЛиния.Линия);
							// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
							ПараметрыОтбора.Вставить("ПортВыгрузкиОтгрузки", СтрокаПортВыгрузки.Порт);
							// Евросиб Рыбьяков К.А. 11.09.2024 ))
							Найденныестроки = Объект.НФ_ВыбранныеСтавки.НайтиСтроки(ПараметрыОтбора);
							//Евросиб - АСуслов 08.04.2022 9:52:05 #42899
							//(
							ИдентификаторыСтрок = ИдентификаторыВыбранныхСтавок.НайтиСтроки(ПараметрыОтбора);
							ИдентификаторСтроки = "";
							Если ИдентификаторыСтрок.Количество() > 0 Тогда
								ИдентификаторСтроки = ИдентификаторыСтрок[0].ИдентификаторСтроки; 
								КлючАналитикиСтрокиКалькуляции = ИдентификаторыСтрок[0].КлючАналитикиСтрокиКалькуляции; 
							КонецЕсли;
							//)
							//Евросиб - АСуслов 08.04.2022 9:52:09 #42899
							Если Найденныестроки.Количество() = 0 Тогда
								НовСтр = Объект.НФ_ВыбранныеСтавки.Добавить();
								НовСтр.Порт = Порт;
								НовСтр.SOCCOC = SOCCOC;
								НовСтр.Контрагент = СтрЛиния.Линия;
								//Евросиб - АСуслов 08.04.2022 9:54:32 #45899
								//(
								НовСтр.ИдентификаторСтроки = ИдентификаторСтроки;
								//)
								//Евросиб - АСуслов 08.04.2022 9:54:34 #45899    
								//Евросиб - АСуслов 24.11.2022 17:01:07 #
								//(
								НовСтр.КлючАналитикиСтрокиКалькуляции = КлючАналитикиСтрокиКалькуляции;			
								//)
								//Евросиб - АСуслов 24.11.2022 17:01:07 #
								// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
								НовСтр.ПортВыгрузкиОтгрузки = СтрокаПортВыгрузки.Порт;
								// Евросиб Рыбьяков К.А. 11.09.2024 ))
							Иначе
								НовСтр = Найденныестроки[0];
							КонецЕсли;
							
							Если НовСтр = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							
							ТекСтатья = Строка(Стр.Статья);
							
							Если НЕ ЗначениеЗаполнено(ТекСтатья) Тогда
								Продолжить;
							КонецЕсли;
							
							Если НЕ СтрНайти(ТекКолонка,"Выбрано") = 0 И НЕ СтрНайти(ТекСтатья,"20") = 0 Тогда
								НовСтр.Выбрано20 = Стр[ТекКолонка];
							ИначеЕсли НЕ СтрНайти(ТекКолонка,"Выбрано") = 0 И НЕ СтрНайти(ТекСтатья,"40") = 0 Тогда
								НовСтр.Выбрано40 = Стр[ТекКолонка];
							ИначеЕсли СтрНайти(ТекКолонка,"Выбрано") = 0 Тогда
								ТекСтатья = СтрЗаменить(ТекСтатья," ","");
								ТекСтатья = СтрЗаменить(ТекСтатья,"'","");
								
								НовСтр[ТекСтатья] = Стр[ТекКолонка];
								//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, начало
								СтрСопоставленяПолей = ТаблицаСопоставленияПолей.Добавить();
								СтрСопоставленяПолей.ИдентификаторСтроки = НовСтр.ИдентификаторСтроки;
								СтрСопоставленяПолей.Статья = ТекСтатья;
								СтрСопоставленяПолей.Индекс = НФ_ЛинииПорты.Индекс(Стр);
								СтрСопоставленяПолей.ИмяКолонки = ТекКолонка;
								//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, конец
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				Иначе
					// ищем контрагента в таблице
					ПараметрыОтбораКонтр = Новый Структура;
					ПараметрыОтбораКонтр.Вставить("Контрагент", СтрЛиния.Линия);
					НайденныеКонтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбораКонтр);
					
					Для Каждого Стр ИЗ НайденныеКонтр Цикл
						
						// для каждого порта и контрагента своя строка. проверяем на уникальность
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Порт",Порт);
						ПараметрыОтбора.Вставить("SOCCOC",SOCCOC);
						ПараметрыОтбора.Вставить("Контрагент", СтрЛиния.Линия);
						Найденныестроки = Объект.НФ_ВыбранныеСтавки.НайтиСтроки(ПараметрыОтбора);
						//Евросиб - АСуслов 08.04.2022 9:52:05 #42899
						//(
						ИдентификаторыСтрок = ИдентификаторыВыбранныхСтавок.НайтиСтроки(ПараметрыОтбора);
						ИдентификаторСтроки = "";
						Если ИдентификаторыСтрок.Количество() > 0 Тогда
							ИдентификаторСтроки = ИдентификаторыСтрок[0].ИдентификаторСтроки; 
							КлючАналитикиСтрокиКалькуляции = ИдентификаторыСтрок[0].КлючАналитикиСтрокиКалькуляции; 
						КонецЕсли;
						//)
						//Евросиб - АСуслов 08.04.2022 9:52:09 #42899
						Если Найденныестроки.Количество() = 0 Тогда
							НовСтр = Объект.НФ_ВыбранныеСтавки.Добавить();
							НовСтр.Порт = Порт;
							НовСтр.SOCCOC = SOCCOC;
							НовСтр.Контрагент = СтрЛиния.Линия;
							//Евросиб - АСуслов 08.04.2022 9:54:32 #45899
							//(
							НовСтр.ИдентификаторСтроки = ИдентификаторСтроки;
							//)
							//Евросиб - АСуслов 08.04.2022 9:54:34 #45899    
							//Евросиб - АСуслов 24.11.2022 17:01:07 #
							//(
							НовСтр.КлючАналитикиСтрокиКалькуляции = КлючАналитикиСтрокиКалькуляции;			
							//)
							//Евросиб - АСуслов 24.11.2022 17:01:07 #
						Иначе
							НовСтр = Найденныестроки[0];
						КонецЕсли;
						
						Если НовСтр = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						ТекСтатья = Строка(Стр.Статья);
						
						Если НЕ ЗначениеЗаполнено(ТекСтатья) Тогда
							Продолжить;
						КонецЕсли;
						
						Если НЕ СтрНайти(ТекКолонка,"Выбрано") = 0 И НЕ СтрНайти(ТекСтатья,"20") = 0 Тогда
							НовСтр.Выбрано20 = Стр[ТекКолонка];
						ИначеЕсли НЕ СтрНайти(ТекКолонка,"Выбрано") = 0 И НЕ СтрНайти(ТекСтатья,"40") = 0 Тогда
							НовСтр.Выбрано40 = Стр[ТекКолонка];
						ИначеЕсли СтрНайти(ТекКолонка,"Выбрано") = 0 Тогда
							ТекСтатья = СтрЗаменить(ТекСтатья," ","");
							ТекСтатья = СтрЗаменить(ТекСтатья,"'","");
							НовСтр[ТекСтатья] = Стр[ТекКолонка];
							//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, начало
							СтрСопоставленяПолей = ТаблицаСопоставленияПолей.Добавить();
							СтрСопоставленяПолей.ИдентификаторСтроки = НовСтр.ИдентификаторСтроки;
							СтрСопоставленяПолей.Статья = ТекСтатья;
							СтрСопоставленяПолей.Индекс = НФ_ЛинииПорты.Индекс(Стр);
							СтрСопоставленяПолей.ИмяКолонки = ТекКолонка;
							//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, конец
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, начало
	Для Каждого СтрокаФрахт Из Объект.НФ_ВыбранныеСтавки Цикл
		Если НЕ СтрокаФрахт.Выбрано20 И НЕ СтрокаФрахт.Выбрано40 Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаФрахт.Валюта) Тогда
			СтрокиСопоставления = ТаблицаСопоставленияПолей.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Статья", СтрокаФрахт.ИдентификаторСтроки, "Валюта"));
			Если СтрокиСопоставления.Количество()>0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не выбрана Валюта",, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("НФ_ЛинииПорты", СтрокиСопоставления[0].Индекс + 1, СтрокиСопоставления[0].ИмяКолонки));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаФрахт.Выбрано20 И НЕ ЗначениеЗаполнено(СтрокаФрахт.Итого20) Тогда
			СтрокиСопоставления = ТаблицаСопоставленияПолей.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Статья", СтрокаФрахт.ИдентификаторСтроки, "Итого20"));
			Если СтрокиСопоставления.Количество()>0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнена сумма Итого 20'",, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("НФ_ЛинииПорты", СтрокиСопоставления[0].Индекс + 1, СтрокиСопоставления[0].ИмяКолонки));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаФрахт.Выбрано40 И НЕ ЗначениеЗаполнено(СтрокаФрахт.Итого40) Тогда
			СтрокиСопоставления = ТаблицаСопоставленияПолей.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Статья", СтрокаФрахт.ИдентификаторСтроки, "Итого40"));
			Если СтрокиСопоставления.Количество()>0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнена сумма Итого 40'",, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("НФ_ЛинииПорты", СтрокиСопоставления[0].Индекс + 1, СтрокиСопоставления[0].ИмяКолонки));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, BUG 110813 / TA 111240, 03-06-2025, конец
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	//ДляДанногоОбъектаТребуетсяПеремаршрутизация = //Ссылка.ПС_ВидПеревозки <> ПС_ВидПеревозки;
	//НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	//Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	//Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	//Объект.Ссылка.Договор <> Объект.Договор ИЛИ
	//Объект.Ссылка.ПС_ВидПеревозки <> Объект.ПС_ВидПеревозки ИЛИ
	//Объект.Ссылка.ММ_ИтогоРентабельность <> Объект.ММ_ИтогоРентабельность ИЛИ
	//Объект.Ссылка.ММ_ИтогоРентабельность20 <> Объект.ММ_ИтогоРентабельность20 ИЛИ
	//Объект.Ссылка.РежимКалькуляции <> Объект.РежимКалькуляции ИЛИ Объект.Состояния.Количество() = 0;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РеквизитыКалькуляции = "Организация, Контрагент, Договор, ПС_ВидПеревозки, ММ_ИтогоРентабельность, ММ_ИтогоРентабельность20, ЖД_ПринадлежностьПС, ТипКалькуляции";
		ЗначенияРеквизитовКалькуляцииСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, РеквизитыКалькуляции);
		ЗначенияРеквизитовКалькуляцииОбъект = Новый Структура(РеквизитыКалькуляции);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовКалькуляцииОбъект, Объект)
	КонецЕсли;
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = Не ЗначениеЗаполнено(Объект.Ссылка) 
									ИЛИ Не ОбщегоНазначения.КоллекцииИдентичны(ЗначенияРеквизитовКалькуляцииОбъект, ЗначенияРеквизитовКалькуляцииСсылка)
									ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

//Евросиб Каблов 28.05.2025 ( #109346
//&НаКлиенте
&НаСервере
//Евросиб Каблов 28.05.2025 )
Процедура ПересчитатьИтогоВИспользовании(Элемент)
	
	ЖД_ИтогоВИспользовании = 
	Объект.ЖД_ПодсылПорожнейПлатформы+
	Объект.ЖД_ПодсылПорожнегоКТК+
	Объект.ЖД_Погрузка+
	Объект.ЖД_ДвижениеГруженый+
	Объект.ЖД_Выгрузка+
	Объект.ЖД_ВозвратПорожнегоКТК+
	Объект.ЖД_ВозвратПорожнейПлатформы+
	Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасчетСебестоимости(Команда)
	
	ОбновитьСебестоимостьПС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиПриИзменении(Элемент)
	
	Для каждого Стр из Объект.ЖД_КалькуляцияСебестоимости Цикл
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Сумма20) Тогда
			 Стр.НормВознаграждение20 = Стр.Сумма20 * Стр.ПроцентВознаграждения / 100;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Сумма40) Тогда
			 Стр.НормВознаграждение40 = Стр.Сумма40 * Стр.ПроцентВознаграждения / 100;
		 КонецЕсли;
		 
	КонецЦикла;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_ВознаграждениеПриИзменении(Элемент)
	
	ЖД_СтавкаКлиенту20 = Объект.ЖД_Вознаграждение20 + ЖД_Себестоимость20;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_СтавкаКлиентуПриИзменении(Элемент)
	
	Объект.ЖД_Вознаграждение20 = ЖД_СтавкаКлиенту20 - ЖД_Себестоимость20;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиУслугаПриИзменении(Элемент)
	
	ТекД = Элементы.ЖД_КалькуляцияСебестоимости.ТекущиеДанные;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Услуга) Тогда
		ТекД.ПроцентВознаграждения = ПроцентВознагражденияУслуги(ТекД.Услуга, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроцентВознагражденияУслуги(Услуга, Период)
	
	Результат = 0;
	
	//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
	Если Объект.Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() Тогда
		Возврат Результат;
	КонецЕсли;
 	//БИТ Белинский Д.А. 30.60.2023 -начало TASK 66201 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НормативныйПроцентВознаграженияСрезПоследних.ПроцентВознаграждения КАК ПроцентВознаграждения
	               |ИЗ
	               |	РегистрСведений.НормативныйПроцентВознагражения.СрезПоследних(&Период, Услуга = &Услуга) КАК НормативныйПроцентВознаграженияСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.ПроцентВознаграждения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекД = Элементы.ЖД_КалькуляцияСебестоимости.ТекущиеДанные;
	Если НоваяСтрока И ТекД <> неопределено Тогда
		ТекД.ВидРасходов = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Себестоимость");
		ТекД.Валюта = Объект.Валюта;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_СтавкаКлиенту40ПриИзменении(Элемент)
	
	Объект.ЖД_Вознаграждение40 = ЖД_СтавкаКлиенту40 - ЖД_Себестоимость40;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_Вознаграждение40ПриИзменении(Элемент)
	
	ЖД_СтавкаКлиенту40 = Объект.ЖД_Вознаграждение40 + ЖД_Себестоимость40;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекД = Элементы.ЖД_УслугиВнеСтавки.ТекущиеДанные;
	Если НоваяСтрока И ТекД <> неопределено Тогда
		ТекД.ВидРасходов = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Себестоимость");
		ТекД.Валюта = Объект.Валюта;
	КонецЕсли;
	//Евросиб - АСуслов 27.09.2022 13:36:18 #
	//(
	Если Копирование Тогда
		ТекД.ИдентификаторСтроки = "";
	КонецЕсли;
	//)
	//Евросиб - АСуслов 27.09.2022 13:36:18 #
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиУслугаПриИзменении(Элемент)
	
	ТекД = Элементы.ЖД_УслугиВнеСтавки1.ТекущиеДанные;
	
	// Евросиб US 86792 TA 86795 Рыбьяков К.А. 15.06.2024 ((
	Если ТекД.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ") Тогда
		ТекД.Услуга = Неопределено;
		Индекс = Строка(ТекД.НомерСтроки-1);
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Номенклатура: ""%1"" недоступна для использования. Необходимо заменить номенклатуру.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ")); 
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Объект.ЖД_УслугиВнеСтавки[" + Индекс + "].Услуга";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.06.2024 ))

	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Услуга) Тогда
		ТекД.ПроцентВознаграждения = ПроцентВознагражденияУслуги(ТекД.Услуга, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПриИзменении(Элемент)
	
	Для каждого Стр из Объект.ЖД_УслугиВнеСтавки Цикл
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Себестоимость20) Тогда
			 Стр.НормВознаграждение20 = Стр.Себестоимость20 * Стр.ПроцентВознаграждения / 100;
			 Если НЕ ЗначениеЗаполнено(Стр.Вознаграждение20) Тогда Стр.Вознаграждение20 = Стр.НормВознаграждение20; КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Себестоимость40) Тогда
			 Стр.НормВознаграждение40 = Стр.Себестоимость40 * Стр.ПроцентВознаграждения / 100;
			 Если НЕ ЗначениеЗаполнено(Стр.Вознаграждение40) Тогда Стр.Вознаграждение40 = Стр.НормВознаграждение40; КонецЕсли;
		 КонецЕсли;
		 Стр.Ставка20 = Стр.Себестоимость20 + Стр.Вознаграждение20 + ?(Стр.СуммаВключаетНДС, 0, БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(Стр.Себестоимость20 + Стр.Вознаграждение20, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС));
		 Стр.Ставка40 = Стр.Себестоимость40 + Стр.Вознаграждение40 + ?(Стр.СуммаВключаетНДС, 0, БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(Стр.Себестоимость40 + Стр.Вознаграждение40, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.СуммаВключаетНДС));
	КонецЦикла;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамПриИзменении(Элемент)
	
	Для каждого Стр из Объект.ЖД_УслугиПоСверхнормативам Цикл
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Себестоимость20) И НЕ ЗначениеЗаполнено(Стр.НормВознаграждение20) Тогда
			 Стр.НормВознаграждение20 = Стр.Себестоимость20 * Стр.ПроцентВознаграждения / 100;
			 Если НЕ ЗначениеЗаполнено(Стр.Вознаграждение20) Тогда Стр.Вознаграждение20 = Стр.НормВознаграждение20; КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.Себестоимость40) И НЕ ЗначениеЗаполнено(Стр.НормВознаграждение40) Тогда
			 Стр.НормВознаграждение40 = Стр.Себестоимость40 * Стр.ПроцентВознаграждения / 100;
			 Если НЕ ЗначениеЗаполнено(Стр.Вознаграждение40) Тогда Стр.Вознаграждение40 = Стр.НормВознаграждение40; КонецЕсли;
		 КонецЕсли;
		 Стр.Ставка20 = Стр.Себестоимость20 + Стр.Вознаграждение20;
		 Стр.Ставка40 = Стр.Себестоимость40 + Стр.Вознаграждение40;
	КонецЦикла;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамУслугаПриИзменении(Элемент)
	
	ТекД = Элементы.ЖД_УслугиПоСверхнормативам.ТекущиеДанные;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Услуга) Тогда
		ТекД.ПроцентВознаграждения = ПроцентВознагражденияУслуги(ТекД.Услуга, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекД = Элементы.ЖД_УслугиВнеСтавки.ТекущиеДанные;
	Если НоваяСтрока И ТекД <> неопределено Тогда
		ТекД.ВидРасходов = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Себестоимость");
		ТекД.Валюта = Объект.Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_СтатистикаПоКПЗаПоследниеДнейПриИзменении(Элемент)
	
	ПериодСтатистики.ДатаОкончания = ТекущаяДата();
	ПериодСтатистики.ДатаНачала = ТекущаяДата() - Объект.ЖД_СтатистикаПоКПЗаПоследниеДней * 24 * 3600;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСроковДвижения(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("ПоНормативам","По нормативам");
	СписокВыбора.Добавить("ПоРейлТариф","По Рейл-тариф");
	СписокВыбора.Добавить("ПоСтатистике","По статистике");
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораРасчетаСроков", ЭтаФорма);
	
	ПоказатьВыборИзСписка(ОпОп, СписокВыбора, Элементы.РасчетСроковДвижения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРасчетаСроков(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Значение = "ПоРейлТариф" Тогда
		
		//Заполнение параметров
		//Параметры станций
		ПараметрыКалькуляции = РейлТариф_клиент.ПолучитьСтруктуруПараметровКалькуляции();
		ПараметрыКалькуляции.КодСтанцииОтправления = ПолучитьРеквизитСсылкиНаСервере(Объект.Суша_ПунктОтправления,"КодЖДСтанции").КодЖДСтанции;
		ПараметрыКалькуляции.КодСтанцииНазначения = ПолучитьРеквизитСсылкиНаСервере(Объект.Суша_ПунктНазначения,"КодЖДСтанции").КодЖДСтанции;
		//Параметры типа отправки
		ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = ПолучитьРеквизитСсылкиНаСервере(Объект.ЖД_ВидОтправки,"КодВидаОтправки").КодВидаОтправки * 1000;
		ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 6;//Одиночные контейнеры (а также спец. контейнеры мелкой отправкой
		ПараметрыКалькуляции.ПараметрыОтправки.ПризнакМаршрутнойОтправки = 1;
		ПараметрыКалькуляции.ПараметрыОтправки.КодСкорости = 2;
		//Параметры груза
		КодГрузаЕТСНГ = ПолучитьРеквизитСсылкиНаСервере(Объект.ЖД_Груз,"ЕТСНГ").ЕТСНГ;
		
		ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ = КодГрузаЕТСНГ;
		ПараметрыКалькуляции.ПараметрыГруза.Вес = Объект.ПС_ФакторЦены_Вес;
		
		//Параметры вагона
		ПараметрыКалькуляции.ПараметрыКонтейнера.КодВагона = ПолучитьРеквизитСсылкиНаСервере(Объект.ЖД_РодПС, "КодПоКлассификаторуРейлТариф").КодПоКлассификаторуРейлТариф;
		ПараметрыКалькуляции.ПараметрыКонтейнера.ПринадлежностьВагона = ПолучитьПринадлежностьRTСервер(Объект.ЖД_ПринадлежностьПС);
		ПараметрыКалькуляции.ПараметрыКонтейнера.КоличествоВагонов = Объект.ЖД_КоличествоВагонов;
		//параметры платформы
		КодПлатформы = ПолучитьРеквизитСсылкиНаСервере(Объект.ЖД_ТипПлатформы, "КодПоКлассификаторуРейлТариф").КодПоКлассификаторуРейлТариф;
		ПринадлежностьПлатформы = ПолучитьПринадлежностьRTСервер(Объект.ЖД_ПринадлежностьПлатформы);
		КоличествоПлатформ = Объект.ЖД_КоличествоПлатформ;
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КодВагона = КодПлатформы;
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.ПринадлежностьВагона = ПринадлежностьПлатформы;
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КоличествоВагонов = КоличествоПлатформ;
		
		ПараметрыКалькуляции.Порожний = Ложь;
		
		//Установка параметров
		Результат = РейлТариф_клиент.ПолучитьКалькуляцию(ПараметрыКалькуляции);
		Если Результат.Ошибка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
			Возврат;
		КонецЕсли; 
		БазоваяЦенаГруженый = 0;
		Если Результат.Ошибка = Ложь Тогда
			Для каждого СтрокаДанныхРезультата Из Результат.РезультатТаблица Цикл
				БазоваяЦенаГруженый = БазоваяЦенаГруженый + СтрокаДанныхРезультата.Стоимость;
			КонецЦикла; 
		КонецЕсли; 
		
		ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = 1000;
		ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 100;//Порожние вагоны под погрузку/из-под выгрузки
		
		ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ = "421034";
		ПараметрыКалькуляции.ПараметрыГруза.Вес = 0;
		
		ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодВагона = КодПлатформы;
		ПараметрыКалькуляции.ПараметрыПорожнегоВагона.ПринадлежностьВагона = ПринадлежностьПлатформы;
		ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КоличествоВагонов = КоличествоПлатформ;
		ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодГруза = КодГрузаЕТСНГ;
		
		ПараметрыКалькуляции.Порожний = Истина;
		
		Результат = РейлТариф_клиент.ПолучитьКалькуляцию(ПараметрыКалькуляции);
		Если Результат.Ошибка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
			Возврат;
		КонецЕсли; 
		БазоваяЦенаПорожний = 0;
		Если Результат.Ошибка = Ложь Тогда
			Для каждого СтрокаДанныхРезультата Из Результат.РезультатТаблица Цикл
				БазоваяЦенаПорожний = БазоваяЦенаПорожний + СтрокаДанныхРезультата.Стоимость;
			КонецЦикла; 
		КонецЕсли; 
		
		Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС = БазоваяЦенаПорожний;
		Объект.ПС_СтавкаГруженогоТарифа = БазоваяЦенаГруженый;
		
 	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПринадлежностьRTСервер(ПринадлежностьТС)
	Возврат Документы.Калькуляция.ПолучитьПринадлежностьRT(ПринадлежностьТС);
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылкиНаСервере(СсылкаНаОбъект,Реквизит)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизит);
КонецФункции
 

&НаКлиенте
Процедура ПС_ДопРасходыВклВСтавкуУслугаПриИзменении(Элемент)
	
	ТекД = Элементы.ПС_ДопРасходыВклВСтавку.ТекущиеДанные;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Услуга) Тогда
		ТекД.ПроцентВознаграждения = ПроцентВознагражденияУслуги(ТекД.Услуга, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПС_ДопРасходыВклВСтавкуПриИзменении(Элемент)
	
	Для каждого Стр из Объект.ПС_ДопРасходыВклВСтавку Цикл
		Если ЗначениеЗаполнено(Стр.ПроцентВознаграждения) И ЗначениеЗаполнено(Стр.СуммаБезНДС) Тогда
			 Стр.НормВознаграждение = Стр.СуммаБезНДС * Стр.ПроцентВознаграждения / 100;
		 КонецЕсли;
		 Если НЕ ЗначениеЗаполнено(Стр.Вознаграждение) Тогда Стр.Вознаграждение = Стр.НормВознаграждение; КонецЕсли;
		 Стр.СтавкаКлиенту = Стр.Вознаграждение + Стр.СуммаБезНДС;
		 Стр.СуммаБезНДСРуб = Валюта_сервер.ПересчитатьПоКурсу(Стр.СуммаБезНДС, Стр.Валюта, ВалютаРеглУчета, Объект.Дата);
	КонецЦикла;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПС_ДопРасходыВклВСтавкуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	//ТекД = Элементы.ПС_ДопРасходыВклВСтавку.ТекущиеДанные;
	//Если НоваяСтрока И ТекД <> неопределено Тогда
	//	ТекД.Валюта = Объект.Валюта;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПС_ДопРасходыВклВСтавкуСтавкаКлиентуПриИзменении(Элемент)
	
	ТекД = Элементы.ПС_ДопРасходыВклВСтавку.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Вознаграждение = ТекД.СтавкаКлиенту - ТекД.СуммаБезНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасчетнуюСтавку(Команда)
	
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
		
		Если Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.ОтНормативнойСтавки") Тогда
			Объект.ПС_РасчетнаяСтавкаПредоставления = Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + НормативнаяСтавкаПредоставленияПС * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы);
		ИначеЕсли Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.РыночнаяСтавка") Тогда	
			Объект.ПС_РасчетнаяСтавкаПредоставления = Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ПС_СтавкаКлиентуРыночная * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы);
		ИначеЕсли Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.ФормулаПрейскурант10_01") Тогда
			Объект.ПС_РасчетнаяСтавкаПредоставления = 0;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КалькуляцияКомплекснойСтавки") Тогда
		
		Объект.ПС_ДопРасходыСуммаВВалютеДокумента = 0;
		Для каждого Стр из Объект.ПС_ДопРасходыВклВСтавку Цикл
			Объект.ПС_ДопРасходыСуммаВВалютеДокумента = Объект.ПС_ДопРасходыСуммаВВалютеДокумента + Валюта_сервер.ПересчитатьПоКурсу(Стр.СтавкаКлиенту, Стр.Валюта, Объект.Валюта, Объект.Дата);
		КонецЦикла;
		
		Если Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.ОтНормативнойСтавки") И Объект.ПС_ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
			Объект.ПС_РасчетнаяСтавкаПредоставления = Объект.ПС_СтавкаГруженогоТарифа + Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ПС_ДопРасходыСуммаВВалютеДокумента + НормативнаяСтавкаПредоставленияПС * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы);
		ИначеЕсли Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.ОтНормативнойСтавки") И Объект.ПС_ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.т") И ЗначениеЗаполнено(Объект.ПС_ФакторЦены_Вес) Тогда
			Объект.ПС_РасчетнаяСтавкаПредоставления = (Объект.ПС_СтавкаГруженогоТарифа + Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ПС_ДопРасходыСуммаВВалютеДокумента + НормативнаяСтавкаПредоставленияПС * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы))/Объект.ПС_ФакторЦены_Вес;
		ИначеЕсли Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.РыночнаяСтавка") И Объект.ПС_ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда	
			Объект.ПС_РасчетнаяСтавкаПредоставления = Объект.ПС_СтавкаГруженогоТарифа + Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ПС_ДопРасходыСуммаВВалютеДокумента + Объект.ПС_СтавкаКлиентуРыночная * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы);
		ИначеЕсли Объект.ПС_ТипСтавкиКлиенту = ПредопределенноеЗначение("Перечисление.ТипыСтавокКлиенту.РыночнаяСтавка") И Объект.ПС_ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.т") И ЗначениеЗаполнено(Объект.ПС_ФакторЦены_Вес) Тогда
			Объект.ПС_РасчетнаяСтавкаПредоставления = (Объект.ПС_СтавкаГруженогоТарифа + Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС + Объект.ПС_ДопРасходыСуммаВВалютеДокумента + Объект.ПС_СтавкаКлиентуРыночная * (Объект.ЖД_ПодсылПорожнейПлатформы + Объект.ЖД_Погрузка + Объект.ЖД_ДвижениеГруженый + Объект.ЖД_Выгрузка + Объект.ЖД_ВозвратПорожнейПлатформы))/Объект.ПС_ФакторЦены_Вес;
		Иначе
			Объект.ПС_РасчетнаяСтавкаПредоставления = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_РодПСПриИзменении(Элемент)
	
	Объект.ЖД_РасчетСебестоимостиДляТипаФГП = Объект.ЖД_РодПС;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ПодборНаправленийПриИзменении(Элемент)
	
	ПерестроитьТаблицуСтавокФрахта(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоСверхнормативамИзТарифов(Команда)
	
	ВидРасходовСоответствие = Новый Соответствие;
	
	МассивТарифовСверхнорматива20 = Новый Массив;
	МассивТарифовСверхнорматива40 = Новый Массив;
	Для каждого Стр из Объект.ЖД_КалькуляцияСебестоимости Цикл
		Если ЗначениеЗаполнено(Стр.Тариф20) тогда МассивТарифовСверхнорматива20.Добавить(Стр.Тариф20); ВидРасходовСоответствие.Вставить(Стр.Тариф20, Стр.ВидРасходов); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Тариф40) тогда МассивТарифовСверхнорматива40.Добавить(Стр.Тариф40); ВидРасходовСоответствие.Вставить(Стр.Тариф40, Стр.ВидРасходов); КонецЕсли;
	КонецЦикла;
	Для каждого Стр из Объект.ЖД_УслугиВнеСтавки Цикл
		Если ЗначениеЗаполнено(Стр.Тариф20) тогда МассивТарифовСверхнорматива20.Добавить(Стр.Тариф20); ВидРасходовСоответствие.Вставить(Стр.Тариф20, Стр.ВидРасходов); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Тариф40) тогда МассивТарифовСверхнорматива40.Добавить(Стр.Тариф40); ВидРасходовСоответствие.Вставить(Стр.Тариф40, Стр.ВидРасходов); КонецЕсли;
	КонецЦикла;
	
	Объект.ЖД_УслугиПоСверхнормативам.Очистить();
	
	ЗаполнитьДанныеПоСверхнормативамИзТарифов_сервер(МассивТарифовСверхнорматива20, МассивТарифовСверхнорматива40, ВидРасходовСоответствие);
	
	ЖД_УслугиПоСверхнормативамПриИзменении(неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСверхнормативамИзТарифов_сервер(МассивТарифовСверхнорматива20, МассивТарифовСверхнорматива40, ВидРасходовСоответствие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиковТаблицаСтоимость.От КАК ДиапазонМин,
	               |	ТарифыПоставщиковТаблицаСтоимость.До КАК ДиапазонМакс,
	               |	ТарифыПоставщиковТаблицаСтоимость.Стоимость КАК Себестоимость20,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка КАК Тариф20,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПунктОтправления КАК ПунктОтправления,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПунктНазначения КАК ПунктНазначения,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Валюта КАК Валюта,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Поставщик КАК Поставщик,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Договор КАК Договор,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Услуга КАК Услуга,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.СтавкаНДС КАК СтавкаНДС,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	НормативныйПроцентВознаграженияСрезПоследних.ПроцентВознаграждения КАК ПроцентВознаграждения
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков.ТаблицаСтоимость КАК ТарифыПоставщиковТаблицаСтоимость
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйПроцентВознагражения.СрезПоследних(&ПериодДействия, ) КАК НормативныйПроцентВознаграженияСрезПоследних
	               |		ПО ТарифыПоставщиковТаблицаСтоимость.Ссылка.Услуга = НормативныйПроцентВознаграженияСрезПоследних.Услуга
	               |ГДЕ
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка В(&Ссылка)
	               |	И ТарифыПоставщиковТаблицаСтоимость.СчитатьСверхнормативом
	               |	И НЕ ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПериодДействия", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", МассивТарифовСверхнорматива20);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = Объект.ЖД_УслугиПоСверхнормативам.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.ВидРасходов = ВидРасходовСоответствие[НСтр.Тариф20];
		
	КонецЦикла;
	
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПоставщиковТаблицаСтоимость.От КАК ДиапазонМин,
	               |	ТарифыПоставщиковТаблицаСтоимость.До КАК ДиапазонМакс,
	               |	ТарифыПоставщиковТаблицаСтоимость.Стоимость КАК Себестоимость40,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка КАК Тариф40,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПунктОтправления КАК ПунктОтправления,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПунктНазначения КАК ПунктНазначения,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Валюта КАК Валюта,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Поставщик КАК Поставщик,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Договор КАК Договор,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.Услуга КАК Услуга,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.СтавкаНДС КАК СтавкаНДС,
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	НормативныйПроцентВознаграженияСрезПоследних.ПроцентВознаграждения КАК ПроцентВознаграждения
	               |ИЗ
	               |	Справочник.ТарифыПоставщиков.ТаблицаСтоимость КАК ТарифыПоставщиковТаблицаСтоимость
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйПроцентВознагражения.СрезПоследних(&ПериодДействия, ) КАК НормативныйПроцентВознаграженияСрезПоследних
	               |		ПО ТарифыПоставщиковТаблицаСтоимость.Ссылка.Услуга = НормативныйПроцентВознаграженияСрезПоследних.Услуга
	               |ГДЕ
	               |	ТарифыПоставщиковТаблицаСтоимость.Ссылка В(&Ссылка)
	               |	И ТарифыПоставщиковТаблицаСтоимость.СчитатьСверхнормативом
	               |	И НЕ ТарифыПоставщиковТаблицаСтоимость.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПериодДействия", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", МассивТарифовСверхнорматива40);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = Объект.ЖД_УслугиПоСверхнормативам.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.ВидРасходов = ВидРасходовСоответствие[НСтр.Тариф40];
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТарификаторПоСтроке_руками(Команда)
	
	ТЧ = неопределено;
	Обработчик = 0;
	
	Если Команда = Истина Тогда
		ТЧ = Элементы.ЖД_КалькуляцияСебестоимости;
		Обработчик = 1;
	ИначеЕсли Команда = 8 Тогда
		ТЧ = Элементы.ЖД_УслугиВнеСтавки1;
		Обработчик = 8;
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КалькуляцияКомплекснойСтавки") 
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
		ТЧ = Элементы.ПС_ДопРасходыВклВСтавку;
		Обработчик = 2;
	Иначе
		ТЧ = Элементы.ЖД_УслугиВнеСтавки;
		Обработчик = 3;
	КонецЕсли;
	
	Если ТЧ = неопределено ИЛИ ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	Стр = ТЧ.ТекущиеДанные;
	
	//////////////
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимПодбораСухопутногоТарифа", Истина);
	СтруктураПараметров.Вставить("Период", Объект.Дата);
	СтруктураПараметров.Вставить("ПунктОтправления", Стр.ПунктОтправления);
	СтруктураПараметров.Вставить("ПунктНазначения", Стр.ПунктНазначения);
	СтруктураПараметров.Вставить("Услуга", Стр.Услуга);
	СтруктураПараметров.Вставить("Организация", Объект.Организация);

	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораТарифов_выбранныхВручную", ЭтаФорма, Обработчик);
	ОткрытьФорму("Документ.Калькуляция.Форма.ПодборТарифаКалькуляцией", СтруктураПараметров,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	/////////////
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("КалькуляцияСухопутнойСоставляющей", Истина);
	//СтруктураПараметров.Вставить("Период", Объект.Дата);
	//
	//СтруктураПараметров.Вставить("ПунктОтправления", Стр.ПунктОтправления);
	//СтруктураПараметров.Вставить("ПунктНазначения", Стр.ПунктНазначения);
	//
	//СтруктураПараметров.Вставить("Услуга", Стр.Услуга);
	//МРазмерКТК = Новый Массив;
	//МРазмерКТК.Добавить(ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"));
	//СтруктураПараметров.Вставить("РазмерыКТК", МРазмерКТК);
	//
	//РЕЗТарифы = Тарификатор_сервер.ПолучитьТарифыПоПараметрам(СтруктураПараметров);
	//
	//МаксСтавка = 0;
	//Для каждого Трф из РЕЗТарифы Цикл
	//	Если Трф.Себестоимость > МаксСтавка Тогда
	//		ПараметрыТарифа = Тарификатор_сервер.ПолучитьДеталиТарифа(Трф.Тариф);
	//		ЗаполнитьЗначенияСвойств(Стр, ПараметрыТарифа);
	//		ЗаполнитьСумму = Новый структура("Тариф20, Сумма20, Себестоимость20, СтавкаМаксимальная, СуммаБезНДС", Трф.Тариф, Трф.Себестоимость, Трф.Себестоимость, Истина, Трф.Себестоимость);
	//		ЗаполнитьЗначенияСвойств(Стр, ЗаполнитьСумму);
	//		МаксСтавка = Трф.Себестоимость;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Если Команда = Истина Тогда
	//	ЖД_КалькуляцияСебестоимостиПриИзменении(неопределено);
	//ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЖелезнодорожнаяПредоставление Тогда
	//	ПС_ДопРасходыВклВСтавкуПриИзменении(неопределено);
	//Иначе
	//	ЖД_УслугиВнеСтавкиПриИзменении(неопределено);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТарифов_выбранныхВручную(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТЧ = неопределено;
	
	Если Параметр2 = 1 Тогда
		ТЧ = Элементы.ЖД_КалькуляцияСебестоимости;
	ИначеЕсли Параметр2 = 8 Тогда
		ТЧ = Элементы.ЖД_УслугиВнеСтавки1;
	ИначеЕсли Параметр2 = 2 Тогда
		ТЧ = Элементы.ПС_ДопРасходыВклВСтавку;
	Иначе
		ТЧ = Элементы.ЖД_УслугиВнеСтавки;
	КонецЕсли;
	
	ТекД = ТЧ.ТекущиеДанные;
	Если Параметр1 = неопределено ИЛИ ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из Параметр1 Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Тариф) Тогда Продолжить; КонецЕсли;
		
		ДеталиТарифа = Тарификатор_сервер.ПолучитьДеталиТарифа(Стр.Тариф);
		ЗаполнитьЗначенияСвойств(ТекД, ДеталиТарифа);
		Если Стр.Размер = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20") Тогда
			ЗаполнитьСумму = Новый структура("Тариф20, Сумма20, Себестоимость20, СтавкаМаксимальная, СуммаБезНДС", Стр.Тариф, Стр.Себестоимость, Стр.Себестоимость, Стр.Максимум, Стр.Себестоимость);
		Иначе
			ЗаполнитьСумму = Новый структура("Тариф40, Сумма40, Себестоимость40, СтавкаМаксимальная, СуммаБезНДС", Стр.Тариф, Стр.Себестоимость, Стр.Себестоимость, Стр.Максимум, Стр.Себестоимость);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекД, ЗаполнитьСумму);
			
	КонецЦикла;
	
	Если Параметр2 = 1 Тогда
		ЖД_КалькуляцияСебестоимостиПриИзменении(неопределено);
	ИначеЕсли Параметр2 = 2 Тогда
		ПС_ДопРасходыВклВСтавкуПриИзменении(неопределено);
	Иначе
		ЖД_УслугиВнеСтавкиПриИзменении(неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТарификаторПоСтроке(Команда)
	
	ТЧ = неопределено;
	
	Если Команда = Истина Тогда
		ТЧ = Элементы.ЖД_КалькуляцияСебестоимости;
	ИначеЕсли Команда = 8 Тогда
		ТЧ = Элементы.ЖД_УслугиВнеСтавки1;
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КалькуляцияКомплекснойСтавки")
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
		ТЧ = Элементы.ПС_ДопРасходыВклВСтавку;
	Иначе
		ТЧ = Элементы.ЖД_УслугиВнеСтавки;
	КонецЕсли;
	
	Если ТЧ = неопределено ИЛИ ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	Стр = ТЧ.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КалькуляцияСухопутнойСоставляющей", Истина);
	СтруктураПараметров.Вставить("Период", Объект.Дата);
	
	СтруктураПараметров.Вставить("ПунктОтправления", Стр.ПунктОтправления);
	СтруктураПараметров.Вставить("ПунктНазначения", Стр.ПунктНазначения);
	
	СтруктураПараметров.Вставить("Услуга", Стр.Услуга);
	МРазмерКТК = Новый Массив;
	МРазмерКТК.Добавить(ПредопределенноеЗначение("Справочник.РазмерыКТК.К20"));
	СтруктураПараметров.Вставить("РазмерыКТК", МРазмерКТК);
	
	РЕЗТарифы = Тарификатор_сервер.ПолучитьТарифыПоПараметрам(СтруктураПараметров);
	
	МаксСтавка = 0;
	Для каждого Трф из РЕЗТарифы Цикл
		Если Трф.Себестоимость > МаксСтавка Тогда
			ПараметрыТарифа = Тарификатор_сервер.ПолучитьДеталиТарифа(Трф.Тариф);
			ЗаполнитьЗначенияСвойств(Стр, ПараметрыТарифа);
			ЗаполнитьСумму = Новый структура("Тариф20, Сумма20, Себестоимость20, СтавкаМаксимальная, СуммаБезНДС", Трф.Тариф, Трф.Себестоимость, Трф.Себестоимость, Истина, Трф.Себестоимость);
			ЗаполнитьЗначенияСвойств(Стр, ЗаполнитьСумму);
			МаксСтавка = Трф.Себестоимость;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КалькуляцияСухопутнойСоставляющей", Истина);
	СтруктураПараметров.Вставить("Период", Объект.Дата);
	
	СтруктураПараметров.Вставить("ПунктОтправления", Стр.ПунктОтправления);
	СтруктураПараметров.Вставить("ПунктНазначения", Стр.ПунктНазначения);
	
	СтруктураПараметров.Вставить("Услуга", Стр.Услуга);
	МРазмерКТК = Новый Массив;
	МРазмерКТК.Добавить(ПредопределенноеЗначение("Справочник.РазмерыКТК.К40"));
	СтруктураПараметров.Вставить("РазмерыКТК", МРазмерКТК);
	
	РЕЗТарифы = Тарификатор_сервер.ПолучитьТарифыПоПараметрам(СтруктураПараметров);
	
	МаксСтавка = 0;
	Для каждого Трф из РЕЗТарифы Цикл
		Если Трф.Себестоимость > МаксСтавка Тогда
			ПараметрыТарифа = Тарификатор_сервер.ПолучитьДеталиТарифа(Трф.Тариф);
			ЗаполнитьЗначенияСвойств(Стр, ПараметрыТарифа);
			ЗаполнитьСумму = Новый структура("Тариф40, Сумма40, Себестоимость40, СтавкаМаксимальная, СуммаБезНДС", Трф.Тариф, Трф.Себестоимость, Трф.Себестоимость, Истина, Трф.Себестоимость);
			ЗаполнитьЗначенияСвойств(Стр, ЗаполнитьСумму);
			МаксСтавка = Трф.Себестоимость;
		КонецЕсли;
	КонецЦикла;
	
	Если Команда = Истина Тогда
		ЖД_КалькуляцияСебестоимостиПриИзменении(неопределено);
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЖелезнодорожнаяПредоставление Тогда
		ПС_ДопРасходыВклВСтавкуПриИзменении(неопределено);
	Иначе
		ЖД_УслугиВнеСтавкиПриИзменении(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарификаторПоСтроке1(Команда)
	
	ТарификаторПоСтроке(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТарификаторПоСтроке1_руками(Команда)
	
	ТарификаторПоСтроке_руками(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 30.07.2025 ((
	ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения();
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
	
	//Евросиб СубботинВ #133276 11.03.2026 Начало // перенес из ПриСозданииНаСервере 
	ПериодДействия.ДатаНачала = Объект.НачалоДействия;
	ПериодДействия.ДатаОкончания = Объект.ОкончаниеДействия;
	//Евросиб СубботинВ #133276 11.03.2026 Конец
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ОбновитьСтоимостьПредоставленияВагона(Команда)
	ОбновитьСтоимостьУслуг(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтоимостьУслуг(ДобавлятьСтрокуПредоставлениеПС = Ложь, ОбновитьСтоимостьУслугКалькуляцииМультимодальнойЦепочки = Ложь)
	ОбновитьСтоимостьУслугСервер(ДобавлятьСтрокуПредоставлениеПС, ОбновитьСтоимостьУслугКалькуляцииМультимодальнойЦепочки);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимостьУслугСервер(ДобавлятьСтрокуПредоставлениеПС = Ложь, ОбновитьСтоимостьУслугКалькуляцииМультимодальнойЦепочки = Ложь)
	
	//Евросиб Каблов 28.05.2025 #109346
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	МАКСИМУМ(НормативныеСтавкиВагонов.СтавкаНаПредоставление) КАК СтавкаНаПредоставление
	//               |ИЗ
	//               |	Справочник.НормативныеСтавкиВагонов КАК НормативныеСтавкиВагонов
	//               |ГДЕ
	//               |	НЕ НормативныеСтавкиВагонов.ПометкаУдаления
	//               |	И &ДатаДокумента МЕЖДУ НормативныеСтавкиВагонов.НачалоДействия И НормативныеСтавкиВагонов.ОкончаниеДействия
	//               |	И НормативныеСтавкиВагонов.ВидСтавки = &Себестоимость
	//               |	И НормативныеСтавкиВагонов.РазмерКонтейнера = &РазмерКонтейнераПустой";
	//Запрос.УстановитьПараметр("Себестоимость", Перечисления.ТипНормативнойСтавкиВагона.Себестоимость);
	//Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	//Запрос.УстановитьПараметр("РазмерКонтейнераПустой", Справочники.РазмерыКТК.ПустаяСсылка());
	//Ответ = Запрос.Выполнить().Выбрать();
	//Если ответ.Следующий() Тогда
	//	Объект.ММ_СтавкаПредоставленияПлатформы = Ответ.СтавкаНаПредоставление;
	//КонецЕсли;
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	МАКСИМУМ(НормативныеСтавкиВагонов.СтавкаНаПредоставление) КАК СтавкаНаПредоставление,
	//               |	НормативныеСтавкиВагонов.РазмерКонтейнера КАК РазмерКонтейнера
	//               |ИЗ
	//               |	Справочник.НормативныеСтавкиВагонов КАК НормативныеСтавкиВагонов
	//               |ГДЕ
	//               |	НЕ НормативныеСтавкиВагонов.ПометкаУдаления
	//               |	И &ДатаДокумента МЕЖДУ НормативныеСтавкиВагонов.НачалоДействия И НормативныеСтавкиВагонов.ОкончаниеДействия
	//               |	И НормативныеСтавкиВагонов.ВидСтавки = &Себестоимость
	//               |	И НормативныеСтавкиВагонов.РазмерКонтейнера <> &РазмерКонтейнераПустой
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	НормативныеСтавкиВагонов.РазмерКонтейнера";
	//Запрос.УстановитьПараметр("Себестоимость", Перечисления.ТипНормативнойСтавкиВагона.Себестоимость);
	//Запрос.УстановитьПараметр("РазмерКонтейнераПустой", Справочники.РазмерыКТК.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	//Ответ = Запрос.Выполнить().Выбрать();
	//Пока ответ.Следующий() Цикл
	//	Если Ответ.РазмерКонтейнера = Справочники.РазмерыКТК.К20 Тогда
	//		Объект.ММ_СтавкаПредоставленияКТК20 = Ответ.СтавкаНаПредоставление;
	//	Иначе
	//		Объект.ММ_СтавкаПредоставленияКТК40 = Ответ.СтавкаНаПредоставление;
	//	КонецЕсли;
	//КонецЦикла;
	
	ПустаяДата = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ТарифыПоставщиковСрезПоследних.Критерий.СтавкаНДС КАК СтавкаНДС,
	|	ТарифыПоставщиковСрезПоследних.Критерий.Валюта КАК Валюта,
	|	ТарифыПоставщиковСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(
	|			&Период,
	|			Критерий.ВидУслуги = &ВидУслугиНормативыДляКалькуляций
	|				И Критерий.Номенклатура = &Номенклатура
	|				И Критерий.Продукт = &Продукт
	|				И Критерий.УчетноеНаправление = &УчетноеНаправление
	|				И Критерий.НормативныйПоказатель
	|				И Статус В (&Статусы)) КАК ТарифыПоставщиковСрезПоследних
	|ГДЕ
	|	(ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата
	|			ИЛИ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия >= &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидУслугиНормативыДляКалькуляций", Справочники.ВидыУслугПоставщиков.НормативыДляКалькуляций);
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПредоставлениеПлатформ);
	Запрос.УстановитьПараметр("Период", Объект.НачалоДействия);
	Запрос.УстановитьПараметр("Продукт", Объект.ПродуктДКП);
	Запрос.УстановитьПараметр("УчетноеНаправление", Объект.УчетноеНаправление);
	Запрос.УстановитьПараметр("Статусы", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ММ_СтавкаПредоставленияПлатформы = Выборка.СтоимостьБезНДС;
		ПараметрыТарифа = Новый Структура("Валюта, СтавкаНДС", Выборка.Валюта, Выборка.СтавкаНДС);
	Иначе
		ПараметрыТарифа = Неопределено;
	КонецЕсли;
	
	ОбработатьИзменениеЖДСоставляющейСервер(ПараметрыТарифа, ДобавлятьСтрокуПредоставлениеПС);
	
	Если ОбновитьСтоимостьУслугКалькуляцииМультимодальнойЦепочки Тогда
	
		НоменклатураСТарифами = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл		
			Если СтрокаТЧ.Услуга = Справочники.Номенклатура.НакладныеРасходы
					Или СтрокаТЧ.Услуга = Справочники.Номенклатура.МежсервисныеРасходы Тогда
				НоменклатураСТарифами.Добавить(СтрокаТЧ.Услуга);			
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
		|	ТарифыПоставщиковСрезПоследних.Критерий.Номенклатура КАК Номенклатура,
		|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиковСрезПоследних.Критерий.СтавкаНДС КАК СтавкаНДС,
		|	ТарифыПоставщиковСрезПоследних.Критерий.Валюта КАК Валюта,
		|	ТарифыПоставщиковСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(
		|			&Период,
		|			Критерий.ВидУслуги = &ВидУслугиНормативыДляКалькуляций
		|				И Критерий.Номенклатура В (&НоменклатураСТарифами)
		|				И Критерий.Продукт = &Продукт
		|				И Критерий.УчетноеНаправление = &УчетноеНаправление
		|				И Критерий.НормативныйПоказатель
		|				И Статус = &СтатусСогласованПоПСЦ) КАК ТарифыПоставщиковСрезПоследних
		|ГДЕ
		|	(ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата
		|			ИЛИ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия >= &Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("ВидУслугиНормативыДляКалькуляций", Справочники.ВидыУслугПоставщиков.НормативыДляКалькуляций);
		Запрос.УстановитьПараметр("НоменклатураСТарифами", НоменклатураСТарифами);
		Запрос.УстановитьПараметр("Период", Объект.НачалоДействия);
		Запрос.УстановитьПараметр("Продукт", Объект.ПродуктДКП);
		Запрос.УстановитьПараметр("УчетноеНаправление", Объект.УчетноеНаправление);
		Запрос.УстановитьПараметр("СтатусСогласованПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
		Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
		
		ТаблицаТарифов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТЧ Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			
			СтрокаТаблицыТарифов = ТаблицаТарифов.Найти(СтрокаТЧ.Услуга, "Номенклатура");
			Если СтрокаТаблицыТарифов <> Неопределено Тогда
				
				ПараметрыТарифа = Новый Структура("Валюта,СтавкаНДС,СтоимостьБезНДС");
				ЗаполнитьЗначенияСвойств(ПараметрыТарифа, СтрокаТаблицыТарифов);
				
				ОбработатьИзменениеУслугиММ_КалькуляцияМультимодальнойЦепочки(СтрокаТЧ, ПараметрыТарифа);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	//Евросиб Каблов 28.05.2025 )
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ПодборНаправленийПередУдалением(Элемент, Отказ)
	
	ТекД = Элементы.ММ_ПодборНаправлений.ТекущиеДанные;
	
	Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта.НайтиСтроки(Новый Структура("Направление", ТекД.Направление)) Цикл
		Объект.ММ_ПросчитанныеСтавкиФрахта.Удалить(Стр);
	КонецЦикла;
	
	Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта.НайтиСтроки(Новый Структура("Направление", ТекД.Направление)) Цикл
		Объект.ММ_ПросчитанныеУслугиФрахта.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияКТКСоставляющейУслугаПриИзменении(Элемент)
	
	ВычислитьДлительностьТекущейСтроки(Элементы.ММ_КалькуляцияКТКСоставляющей.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияКТКСоставляющейПриИзменении(Элемент)
	
	Если Объект.ММ_СтавкаПредоставленияКТК20 = 0 ИЛИ Объект.ММ_СтавкаПредоставленияКТК40 = 0 Тогда Возврат; КонецЕсли;
	
	ДлитДней = ОкрВверх(Объект.ММ_КалькуляцияКТКСоставляющей.Итог("ДлительностьДней"));
	
	СтрокаНайдена = неопределено;
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		Если Стр.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПредоставлениеКТК") Тогда
			СтрокаНайдена = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СтрокаНайдена = неопределено Тогда СтрокаНайдена = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Добавить(); КонецЕсли;
	СтрокаНайдена.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПредоставлениеКТК");
	
	
	СтрокаНайдена.Цена20 = ДлитДней * Объект.ММ_СтавкаПредоставленияКТК20;
	СтрокаНайдена.Цена40 = ДлитДней * Объект.ММ_СтавкаПредоставленияКТК40;
	
	СтрокаНайдена.НДСВключенВСтоимость = Истина;
	СтрокаНайдена.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	
	СтрокаНайдена.НормативныйПроцентВознаграждения20 = ПроцентВознагражденияУслуги(СтрокаНайдена.Услуга, Объект.Дата);
	СтрокаНайдена.НормативныйПроцентВознаграждения40 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	
	СтрокаНайдена.ПунктОтправления = Объект.Суша_ПунктОтправления;
	СтрокаНайдена.ПунктНазначения = Объект.Суша_ПунктНазначения;
	
	СтрокаНайдена.Вознаграждение20 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	СтрокаНайдена.Вознаграждение40 = СтрокаНайдена.НормативныйПроцентВознаграждения40;
	
	ПосчитатьСтрокуКалькуляцииЖД(СтрокаНайдена);
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартнымСпискомУслуг(Команда)
	
	СписокУслугВагона = ПолучитьСтандартныйСписокУслугВагона();
	Для каждого Стр из СписокУслугВагона Цикл
		СтрНайдена = Ложь;
		Для каждого Под из Объект.ММ_КалькуляцияЖДСоставляющей Цикл
			Если Под.Операция = Стр Тогда СтрНайдена = Истина; КонецЕсли;
		КонецЦикла;
		Если НЕ СтрНайдена Тогда
			НСтр = Объект.ММ_КалькуляцияЖДСоставляющей.Добавить();
			НСтр.Операция = Стр;
			НормыРасчетаДлительности = Услуги_сервер.ПолучитьПараметрыРасчетаДлительностиУслуги(НСтр.Операция);
			НСтр.СчПробег = НормыРасчетаДлительности.Пробег;
		КонецЕсли;
	КонецЦикла;
	
	СписокУслугКТК = ПолучитьСтандартныйСписокУслугКТК();
	Для каждого Стр из СписокУслугКТК Цикл
		СтрНайдена = Ложь;
		Для каждого Под из Объект.ММ_КалькуляцияКТКСоставляющей Цикл
			Если Под.Операция = Стр Тогда СтрНайдена = Истина; КонецЕсли;
		КонецЦикла;
		Если НЕ СтрНайдена Тогда
			НСтр = Объект.ММ_КалькуляцияКТКСоставляющей.Добавить();
			НСтр.Операция = Стр;
			НормыРасчетаДлительности = Услуги_сервер.ПолучитьПараметрыРасчетаДлительностиУслуги(НСтр.Операция);
			НСтр.СчПробег = НормыРасчетаДлительности.Пробег;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтандартныйСписокУслугВагона()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыОпераций.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыОпераций КАК ВидыОпераций
	               |ГДЕ
	               |	НЕ ВидыОпераций.ПометкаУдаления
	               |	И НЕ ВидыОпераций.ЭтоГруппа
	               |	И ВидыОпераций.ЗаполнятьВагоннуюСоставляющуюКалькуляции <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыОпераций.ЗаполнятьВагоннуюСоставляющуюКалькуляции";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтандартныйСписокУслугКТК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыОпераций.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыОпераций КАК ВидыОпераций
	               |ГДЕ
	               |	НЕ ВидыОпераций.ПометкаУдаления
	               |	И НЕ ВидыОпераций.ЭтоГруппа
	               |	И ВидыОпераций.ЗаполнятьКонтейнернуюСоставляющуюКалькуляции <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыОпераций.ЗаполнятьКонтейнернуюСоставляющуюКалькуляции";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ММ_КалькуляцияКТКСоставляющейПробегПриИзменении(Элемент)
	
	ВычислитьДлительностьТекущейСтроки(Элементы.ММ_КалькуляцияКТКСоставляющей.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_СтавкаПредоставленияКТК40ПриИзменении(Элемент)
	
	ММ_КалькуляцияКТКСоставляющейПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиУслугаПриИзменении(Элемент)
	
	СтрокаНайдена = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	
	Если СтрокаНайдена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Евросиб US 86792 TA 86795 Рыбьяков К.А. 15.06.2024 ((
	Если СтрокаНайдена.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ") Тогда
		СтрокаНайдена.Услуга = Неопределено;
		Индекс = Строка(СтрокаНайдена.НомерСтроки-1);
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Номенклатура: ""%1"" недоступна для использования. Необходимо заменить номенклатуру.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ")); 
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Объект.ММ_КалькуляцияМультимодальнойЦепочки[" + Индекс + "].Услуга";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 15.06.2024 ))
	
	//Евросиб Каблов 24.03.2025 ( #100520 Перенес в серверную процедуру ММ_КалькуляцияМультимодальнойЦепочкиУслугаПриИзмененииСервер
	//СтрокаНайдена.НормативныйПроцентВознаграждения20 = ПроцентВознагражденияУслуги(СтрокаНайдена.Услуга, Объект.Дата);
	//СтрокаНайдена.НормативныйПроцентВознаграждения40 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	//
	//СтрокаНайдена.Вознаграждение20 = СтрокаНайдена.НормативныйПроцентВознаграждения20;
	//СтрокаНайдена.Вознаграждение40 = СтрокаНайдена.НормативныйПроцентВознаграждения40;
	//
	//// Евросиб Фролов (28.12.2021 TASK №43954
	//Если СтрокаНайдена.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала") Тогда	
	//	СтрокаНайдена.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	//	СтрокаНайдена.НДСВключенВСтоимость = Ложь;
	//	
	//	Если Объект.ТарифицируемыйРазмерКТК = "20" Тогда
	//		СтрокаНайдена.Цена20 = 1500;			
	//	ИначеЕсли Объект.ТарифицируемыйРазмерКТК = "40" Тогда 
	//		СтрокаНайдена.Цена40 = 1500;
	//	ИначеЕсли Объект.ТарифицируемыйРазмерКТК = "2040" Тогда
	//		СтрокаНайдена.Цена20 = 1500;
	//		СтрокаНайдена.Цена40 = 1500;
	//	КонецЕсли;
	//	СтрокаНайдена.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль");
	//КонецЕсли;
	//// Евросиб Фролов)
	//
	////Евросиб Каблов 20.12.2022 ( 62430
	//ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	//
	//СтрокаДоступныеТипы = Неопределено;
	//СтрокаТипЛокации = Неопределено;
	//ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ТекДанные.ПунктОтправления, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	//Если Не ЛокацияСоответствуетУслуге Тогда
	//	ТекДанные.ПунктОтправления = Неопределено;
	//КонецЕсли;
	//
	//СтрокаДоступныеТипы = Неопределено;
	//СтрокаТипЛокации = Неопределено;
	//ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ТекДанные.ПунктНазначения, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	//Если Не ЛокацияСоответствуетУслуге Тогда
	//	ТекДанные.ПунктНазначения = Неопределено;
	//КонецЕсли;
	////Евросиб Каблов 20.12.2022 )	
	
	ТекСтрока = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущаяСтрока;
	ММ_КалькуляцияМультимодальнойЦепочкиУслугаПриИзмененииСервер(ТекСтрока);
		
	//Евросиб Каблов 24.03.2025 )
	
	//Евросиб Коханенко Н.А. 08.04.2024 (( #83546
	//перенесено с процедуру УстановитьПризнакВнутреннейСебестоимостиПоПараметрам 
	//ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	//Если ТекД <> неопределено Тогда   
	//	ТекД.ВнутренняяСебестоимость = ПолучитьВнутреннююСебестоимость(ТекД.Услуга, ТекД.ПунктОтправления, ТекД.ПунктНазначения);
	//	// Евросиб Фролов (28.12.2021 TASK №43954
	//	Если ТекД.ВнутренняяСебестоимость Тогда
	//		ТекД.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	//		ТекД.НДСВключенВСтоимость = Ложь;
	//	КонецЕсли;
	//	// Евросиб Фролов)
	//КонецЕсли;
	УстановитьПризнакВнутреннейСебестоимостиПоПараметрам();
	//Евросиб Коханенко Н.А. 08.04.2024 )) #83546 

КонецПроцедуры

//Евросиб Каблов 24.03.2025 #100520 Перенес из клиентской процедуры ММ_КалькуляцияМультимодальнойЦепочкиУслугаПриИзменении
&НаСервере
Процедура ММ_КалькуляцияМультимодальнойЦепочкиУслугаПриИзмененииСервер(ТекСтрока)
	
	СтрокаТЧ = Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиПоИдентификатору(ТекСтрока);
	
	//Евросиб Каблов 28.05.2025 ( #109346
	ПараметрыТарифа = Неопределено;
	Если СтрокаТЧ.Услуга = Справочники.Номенклатура.НакладныеРасходы
			Или СтрокаТЧ.Услуга = Справочники.Номенклатура.МежсервисныеРасходы
		       Или СтрокаТЧ.Услуга = Справочники.Номенклатура.ПредоставлениеПлатформ Тогда //Евросиб Шевченко А.В. US 115279 TA 119764 25.12.2025
			   
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
		|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиковСрезПоследних.Критерий.СтавкаНДС КАК СтавкаНДС,
		|	ТарифыПоставщиковСрезПоследних.Критерий.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(
		|			&Период,
		|			Критерий.ВидУслуги = &ВидУслугиНормативыДляКалькуляций
		|				И Критерий.Номенклатура = &Номенклатура
		|				И Критерий.Продукт = &Продукт
		|				И Критерий.УчетноеНаправление = &УчетноеНаправление
		|				И Критерий.НормативныйПоказатель
		|				И Статус = &СтатусСогласованПоПСЦ) КАК ТарифыПоставщиковСрезПоследних";
		
		Запрос.УстановитьПараметр("ВидУслугиНормативыДляКалькуляций", Справочники.ВидыУслугПоставщиков.НормативыДляКалькуляций);
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЧ.Услуга);
		Запрос.УстановитьПараметр("Период", Объект.НачалоДействия);
		Запрос.УстановитьПараметр("Продукт", Объект.ПродуктДКП);
		Запрос.УстановитьПараметр("УчетноеНаправление", Объект.УчетноеНаправление);
		Запрос.УстановитьПараметр("СтатусСогласованПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПараметрыТарифа = Новый Структура("Валюта,СтавкаНДС,СтоимостьБезНДС");
			ЗаполнитьЗначенияСвойств(ПараметрыТарифа, Выборка);
		КонецЕсли;
		
	КонецЕсли;
		
	ОбработатьИзменениеУслугиММ_КалькуляцияМультимодальнойЦепочки(СтрокаТЧ, ПараметрыТарифа);
	//Евросиб Каблов 28.05.2025 )
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВнутреннююСебестоимость(ТекУслуга, ПунктОтправления, ПунктНазначения)
	
	//Возврат ТекУслуга.ВнутренняяСебестоимость И (ПунктОтправления.НаТерминалеИспользуютсяУслугиВнСебестоимости ИЛИ ПунктНазначения.НаТерминалеИспользуютсяУслугиВнСебестоимости);
	//ДИТ, Беляев СЮ, Ticket#0334071, 04-12-2023, начало (тип реквизитов ПунктОтправления, ПунктНазначения может быть не назначен, а также могут быть ссылки на спр-к АдресаВНаселенныхПунктах)
	ФлагИспользованияНаТерминалеУслугиВнСебестоимости = Ложь;
	МассивПунктов = Новый Массив;
	МассивПунктов.Добавить(ПунктОтправления);
	МассивПунктов.Добавить(ПунктНазначения);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Локации.НаТерминалеИспользуютсяУслугиВнСебестоимости), ЛОЖЬ) КАК НаТерминалеИспользуютсяУслугиВнСебестоимости
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Ссылка В(&МассивПунктов)";
	
	Запрос.УстановитьПараметр("МассивПунктов", МассивПунктов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФлагИспользованияНаТерминалеУслугиВнСебестоимости = ВыборкаДетальныеЗаписи.НаТерминалеИспользуютсяУслугиВнСебестоимости;
	КонецЕсли;

	Возврат ТекУслуга.ВнутренняяСебестоимость И ФлагИспользованияНаТерминалеУслугиВнСебестоимости;
	//ДИТ, Беляев СЮ, Ticket#0334071, 04-12-2023, конец
	
КонецФункции	
	
&НаКлиенте
Процедура ТарификаторПоСтроке_Мультимодал(Команда)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимПодбораСухопутногоТарифа", Истина);
	СтруктураПараметров.Вставить("Период", Объект.Дата);
	СтруктураПараметров.Вставить("ПунктОтправления", ТекД.ПунктОтправления);
	СтруктураПараметров.Вставить("ПунктНазначения", ТекД.ПунктНазначения);
	СтруктураПараметров.Вставить("Услуга", ТекД.Услуга);
	СтруктураПараметров.Вставить("Организация", Объект.Организация);

	Если ЗначениеЗаполнено(ТекД.Поставщик) Тогда
		СтруктураПараметров.Вставить("Поставщик", ТекД.Поставщик);
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ТарификаторПоСтроке_Мультимодал_выбор", ЭтаФорма);
	ОткрытьФорму("Документ.Калькуляция.Форма.ПодборТарифаКалькуляцией", СтруктураПараметров,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТарификаторПоСтроке_Мультимодал_выбор(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	
	Если параметр1 = неопределено ИЛИ ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из Параметр1 Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Тариф) Тогда Продолжить; КонецЕсли;
		
		ДеталиТарифа = Тарификатор_сервер.ПолучитьДеталиТарифа(Стр.Тариф);
		ЗаполнитьЗначенияСвойств(ТекД, ДеталиТарифа);
		ТекД.НДСВключенВСтоимость = ДеталиТарифа.СуммаВключаетНДС;
		Если Стр.Размер = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20") Тогда
			ЗаполнитьСумму = Новый структура("Тариф20, Цена20, СтавкаМаксимальная20", Стр.Тариф, Стр.Себестоимость, Стр.Максимум);
		Иначе
			ЗаполнитьСумму = Новый структура("Тариф40, Цена40, СтавкаМаксимальная40", Стр.Тариф, Стр.Себестоимость, Стр.Максимум);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекД, ЗаполнитьСумму);
		ММ_КалькуляцияМультимодальнойЦепочкиПриИзменении(неопределено,,Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Тарификатор_Мультимодал_услуги_Макс(Команда)
	
	ТарификаторПоСтроке(8);
	
КонецПроцедуры

&НаКлиенте
Процедура Тарификатор_Мультимодал_услуги_Руками(Команда)
	
	ТарификаторПоСтроке_руками(8);
	
КонецПроцедуры

&НаКлиенте
Процедура море20_Заполнить(Команда)
	
	Объект.море20_Себестоимость = ММ_МореСебестоимость;
	Объект.море20_Вознаграждение = ММ_МореВознаграждение;
	Объект.море20_Контрагент = Объект.ПротоколСчитаетсяПоСтавкамКонтрагента;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура море40_Заполнить(Команда)
	
	Объект.море40_Себестоимость = ММ_МореСебестоимость;
	Объект.море40_Вознаграждение = ММ_МореВознаграждение;
	Объект.море40_Контрагент = Объект.ПротоколСчитаетсяПоСтавкамКонтрагента;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_МореРазмерКТКПриИзменении(Элемент)
	
	Объект.ММ_ПросчитанныеСтавкиФрахта.Очистить();
	Объект.ММ_ПросчитанныеУслугиФрахта.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколСчитаетсяПоСтавкамКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ПротоколСчитаетсяПоСтавкамКонтрагента.СписокВыбора.ЗагрузитьЗначения(ПолучитьКонтрагентовКалькуляцииФрахт());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентовКалькуляцииФрахт()
	
	Результат = Новый Массив;
	
	Для каждого Стр из Объект.ММ_ПодборНаправлений Цикл
		
		Если Результат.Найти(Стр.Направление.Линия.Контрагент) = неопределено Тогда
			Результат.Добавить(Стр.Направление.Линия.Контрагент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПротоколСчитаетсяПоСтавкамКонтрагентаПриИзменении(Элемент)
	
	ИзмененКонтрагент_сервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзмененКонтрагент_сервер()
	
	// МОРЕ таблицы
	ММ_МореСтавка = 0;
	ТопНаправление = неопределено;
	ММ_МореВознаграждение = 0;
	ММ_МореСебестоимость = 0;
	Для каждого Стр из Объект.ММ_ПросчитанныеСтавкиФрахта Цикл
		Если Стр.Направление.Линия.Контрагент = Объект.ПротоколСчитаетсяПоСтавкамКонтрагента И Стр.Ставка > ММ_МореСтавка Тогда
			ММ_МореСтавка = Стр.Ставка;
			ТопНаправление = Стр.Направление;
			ММ_МореВознаграждение = Стр.Вознаграждение;
		КонецЕсли;
	КонецЦикла;
	Для каждого Стр из Объект.ММ_ПросчитанныеУслугиФрахта Цикл
		Если Стр.Направление = ТопНаправление Тогда
			ММ_МореСебестоимость = ММ_МореСебестоимость + Стр.Себестоимость;
			Объект.ММ_ВалютаФрахтовыхСтавок = Стр.Тариф.Валюта;
			//Объект.ПротоколСчитаетсяПоСтавкамКонтрагента = КонтрагентТарифа(Стр.Тариф);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
	КолСостоянийЗавершено = 0;
	
	Для каждого Стр из Объект.Состояния Цикл
		
		Если Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		
			КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
		
		КонецЕсли;
		
	КонецЦикла;
	
	//РамкаПроцессная = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 2);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И КолСостоянийЗавершено = Объект.Состояния.Количество() Тогда
		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
		
		Элементы.ПредупреждениеРедактирования.Заголовок = "Документ полностью отработан. Запись заблокирована";
	Иначе	
		Элементы.ГруппаИнформацияОДокументе.Видимость = Ложь;
	КонецЕсли;
	
	// SIV 20-09-18 Еще одно ограничение: если ПСЦ согласован или подписан, то все его калькуляции блокируются
	
	//Если Элементы.ГруппаИнформацияОДокументе.Видимость = Ложь И ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	
	//	ПСЦ = Документы.Калькуляция.КалькуляцияНаходитсяВСогласованномПСЦ(Объект.Ссылка);
	//	
	//	Если ПСЦ <> неопределено Тогда
	//		
	//		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
	//		Элементы.ПредупреждениеРедактирования.Заголовок = "Данная калькуляция зафиксирована ПСЦ " + ПСЦ;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры


// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//Евросиб Коханенко Н.А. 27.07.2023 (( #73072 	
	ОбновитьБлокировкуСтатусаСостоянийСогласования();
	//Евросиб Коханенко Н.А. 27.07.2023 )) #73072 
	
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	НормативнаяКонтрибуция = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьНормативнуюКонтрибуциюПоДокументу(Объект.Ссылка);
	ОформитьПоляСтавокКонтрибуции();
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	//Евросиб Коханенко Н.А. 02.08.2023 (( #72829
	//если калькуляция служебная
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Если КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) 
	Если ЭтоДирекцияКонтейнерныхПеревозок 
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
		И КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции) Тогда
			
		//пункт 7
		//если текущее состояние, это согласование, и выбран статус - Отклонено, то необходимо оставить примечание
		// ДИТ US 85649 Сержантова А.С. Начало: 27.05.2024
		// Было:
		//ТекущееСостояниеЭтоСогласование = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование"); 
		//Стало: 
		Если ЗначениеЗаполнено(ТекущийИсполнитель_Состояние) Тогда
			ТекущееСостояниеЭтоСогласование = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущийИсполнитель_Состояние, "Согласование");
		Иначе
		    ТекущееСостояниеЭтоСогласование = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование"); 
		КонецЕсли;
		// ДИТ US 85649 Сержантова А.С. Конец: 27.05.2024
		Если ЭтаФорма.ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен")
				И ТекущееСостояниеЭтоСогласование Тогда
			// ДИТ US 85649 Сержантова А.С. Начало: 23.05.2024
			// Было:
			////вызываем форму для ввода примечания
			//Оповещение = Новый ОписаниеОповещения("ПослеВводаПричиныОтклонения", ЭтотОбъект);
 			//ПоказатьВводСтроки(Оповещение,,	"Укажите причину отклонения", 1000,	Истина);    
			//Стало:  
			ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
			ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
			Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
				ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
			Иначе
				ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
			КонецЕсли;
			ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			// ДИТ US 85649 Сержантова А.С. Конец: 23.05.2024
		КонецЕсли;

		//Евросиб Коханенко Н.А. 02.08.2023 (( #73084 
		ОбновитьДоступностьПоляСогласованноеКоличествоКТК();
		//Евросиб Коханенко Н.А. 02.08.2023 )) #73084 

	КонецЕсли;	
	//Евросиб Коханенко Н.А. 02.08.2023 )) #72829 
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 02.08.2023 (( #72829 
&НаКлиенте
Процедура ПослеВводаПричиныОтклонения(Результат, Параметры) Экспорт
	Если Не Результат = Неопределено Тогда
		НаименованиеТекущегоСостояния = ЭтаФорма.ТекущийИсполнитель_Состояние;
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", НаименованиеТекущегоСостояния));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Объект.Состояния[НайденныеСтроки[0].НомерСтроки-1].Комментарий = Результат;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
//Евросиб Коханенко Н.А. 02.08.2023 )) #72829 


&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;                               
		
		ОбновитьПанельСостояний();
		
	КонецЕсли;
	
КонецПроцедуры
//++ Зубов 03.08.2021 37315
&НаСервере
Функция ПолучитьНестандартнуюМаршрутизацию(НовМаршрутизация,ПроцДоходности)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Маршрутизация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Маршрутизация КАК Маршрутизация
		|ГДЕ
		|	Маршрутизация.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НовМаршрутизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПодходящаяМаршрутизация = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		Если Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов <> 0 И Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов > ПроцДоходности Тогда
			Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЕсли;
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению));
	КонецЦикла;
	МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, Объект.Дата, Объект.Договор);
	МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, Объект.Дата, Объект.ПС_ВидПеревозки);
	Возврат РезультатЗапроса;
КонецФункции

//Евросиб - АСуслов 16.12.2021 16:02:47 #42234
//(
//&НаСервере
//Функция СтандартнаяМаршрутизацияНаСервере()
//	Если ТипЗнч(Объект.КалькуляцияСозданаНаОсновании) = Тип("ДокументСсылка.Калькуляция") Тогда
//		Если Объект.КалькуляцияСозданаНаОсновании.Шаблон Тогда 
//			Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
//				Если Объект.Контрагент<>Объект.КалькуляцияСозданаНаОсновании.Контрагент Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				Иначе
//					Если ПроверитьИзменениеМодальности() Тогда
//						СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//					ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//						СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//					ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//						СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//					Иначе
//						СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//					КонецЕсли;
//				КонецЕсли;
//			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
//				Если ПроверитьИзменениеМодальности() Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//					СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//				ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
//					СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//				Иначе
//					СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
//				КонецЕсли;
//			КонецЕсли;
//		Иначе
//			СтандартнаяМаршрутизация = "Калькуляция нового клиента";
//		КонецЕсли;
//	Иначе
//		СтандартнаяМаршрутизация = "Стандарт";
//	КонецЕсли;
//	
//	Возврат СтандартнаяМаршрутизация;
//КонецФункции
&НаСервере
Функция ЭтоМаршрутизацияДействующегоКлиентаНаСервере()
	//ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//Если ТипЗнч(Объект.КалькуляцияСозданаНаОсновании) = Тип("ДокументСсылка.Калькуляция") Тогда
	//	Если Объект.КалькуляцияСозданаНаОсновании.Шаблон Тогда 
	//		Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
	//			Если Объект.Контрагент<>Объект.КалькуляцияСозданаНаОсновании.Контрагент Тогда
	//				//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
	//				ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//			Иначе
	//				Если ПроверитьИзменениеМодальности() Тогда
	//					//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
	//					ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//				ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
	//					//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
	//					ЭтоМаршрутизацияДействующегоКлиента = Истина;
	//				ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
	//					//СтандартнаяМаршрутизация = "Калькуляция нового клиента"; 
	//					ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//				Иначе
	//					//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
	//					ЭтоМаршрутизацияДействующегоКлиента = Истина;
	//				КонецЕсли;
	//			КонецЕсли;
	//		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании.Контрагент) Тогда
	//			Если ПроверитьИзменениеМодальности() Тогда
	//				//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
	//				ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//			ИначеЕсли Объект.ММ_ИтогоСтавка>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20>=Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
	//				//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
	//				ЭтоМаршрутизацияДействующегоКлиента = Истина;
	//			ИначеЕсли Объект.ММ_ИтогоСтавка<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка ИЛИ Объект.ММ_ИтогоСтавка20<Объект.КалькуляцияСозданаНаОсновании.ММ_ИтогоСтавка20 Тогда
	//				//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
	//				ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//			Иначе
	//				//СтандартнаяМаршрутизация = "Калькуляция действующего клиента";
	//				ЭтоМаршрутизацияДействующегоКлиента = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//	Иначе
	//		//СтандартнаяМаршрутизация = "Калькуляция нового клиента";
	//		ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//	КонецЕсли;
	//Иначе
	//	//СтандартнаяМаршрутизация = "Стандарт";
	//	ЭтоМаршрутизацияДействующегоКлиента = Ложь;
	//КонецЕсли;
	
	Возврат Документы.Калькуляция.ЭтоМаршрутизацияДействующегоКлиента(Объект);
КонецФункции

//)
//Евросиб - АСуслов 16.12.2021 16:03:07 #42234

&НаСервере
Функция ПроверитьИзменениеМодальности()
	Изменено = Ложь;
	Если Объект.ММ_КоличествоВагонов <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоВагонов
		ИЛИ Объект.ММ_КоличествоКТК <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоКТК
		ИЛИ Объект.ММ_СтавкаПредоставленияПлатформы <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияПлатформы
		ИЛИ Объект.ММ_КоличествоКТКНаВагон <> Объект.КалькуляцияСозданаНаОсновании.ММ_КоличествоКТКНаВагон
		ИЛИ Объект.ММ_ГруженыйПоСуше <> Объект.КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоСуше
		ИЛИ Объект.ММ_СтавкаПредоставленияКТК20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК20
		ИЛИ Объект.ММ_СтавкаПредоставленияКТК40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_СтавкаПредоставленияКТК40
		ИЛИ Объект.ЕдиницаИзмерения <> Объект.КалькуляцияСозданаНаОсновании.ЕдиницаИзмерения
		ИЛИ Объект.ЖД_РасчетСебестоимостиДляТипаФГП <> Объект.КалькуляцияСозданаНаОсновании.ЖД_РасчетСебестоимостиДляТипаФГП
		ИЛИ Объект.Груз <> Объект.КалькуляцияСозданаНаОсновании.Груз
		ИЛИ Объект.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.СтавкаНДС
		ИЛИ Объект.СуммаВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.СуммаВключаетНДС
		ИЛИ Объект.веб_ДляКТКЕвросиб <> Объект.КалькуляцияСозданаНаОсновании.веб_ДляКТКЕвросиб
		ИЛИ Объект.веб_ДляКТККлиента <> Объект.КалькуляцияСозданаНаОсновании.веб_ДляКТККлиента
		ИЛИ Объект.СпециальныеУсловия <> Объект.КалькуляцияСозданаНаОсновании.СпециальныеУсловия
		ИЛИ Объект.УсловияПримененияСтавки <> Объект.КалькуляцияСозданаНаОсновании.УсловияПримененияСтавки
		ИЛИ Объект.ТипЗаказа <> Объект.КалькуляцияСозданаНаОсновании.ТипЗаказа
		ИЛИ Объект.Суша_ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.Суша_ПунктОтправления
		ИЛИ Объект.УсловияПеревозки_Отправление <> Объект.КалькуляцияСозданаНаОсновании.УсловияПеревозки_Отправление
		ИЛИ Объект.Суша_ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.Суша_ПунктНазначения
		ИЛИ Объект.УсловияПеревозки_Прибытие <> Объект.КалькуляцияСозданаНаОсновании.УсловияПеревозки_Прибытие
		ИЛИ Объект.ЖД_ПринадлежностьПС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ПринадлежностьПС
		ИЛИ Объект.ПС_ВидПеревозки <> Объект.КалькуляцияСозданаНаОсновании.ПС_ВидПеревозки
		ИЛИ Объект.ТерриторияМаршрута <> Объект.КалькуляцияСозданаНаОсновании.ТерриторияМаршрута
		//ИЛИ Объект.ММ_Вознаграждение <> Объект.КалькуляцияСозданаНаОсновании.ММ_Вознаграждение
		//ИЛИ Объект.ММ_Вознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_Вознаграждение40
		ИЛИ Объект.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС
		ИЛИ Объект.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС
		ИЛИ Объект.ЖД_СредняяЗагрузкаПлатформ <> Объект.КалькуляцияСозданаНаОсновании.ЖД_СредняяЗагрузкаПлатформ
		ИЛИ Объект.ЖД_СреднийПроцентСороковок <> Объект.КалькуляцияСозданаНаОсновании.ЖД_СреднийПроцентСороковок
		ИЛИ Объект.ММ_ГруженыйПоМорю <> Объект.КалькуляцияСозданаНаОсновании.ММ_ГруженыйПоМорю
		ИЛИ Объект.ММ_ДействиеСтавокНа <> Объект.КалькуляцияСозданаНаОсновании.ММ_ДействиеСтавокНа
		ИЛИ Объект.Море_УсловияПогрузки <> Объект.КалькуляцияСозданаНаОсновании.Море_УсловияПогрузки
		ИЛИ Объект.Море_УсловияВыгрузки <> Объект.КалькуляцияСозданаНаОсновании.Море_УсловияВыгрузки
		// Евросиб US 87896 TA 91708 Рыбьяков К.А. 16.09.2024 ((
		//ИЛИ Объект.ММ_ПортОтправления  <> Объект.КалькуляцияСозданаНаОсновании.ММ_ПортОтправления 
		// Евросиб Рыбьяков К.А. 16.09.2024 ))
		Тогда
		Изменено = Истина;
	КонецЕсли;
	
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияЖДСоставляющей Цикл
			Если Строка.Операция <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Операция
				ИЛИ Строка.Пробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Пробег 
				ИЛИ Строка.ДлительностьДней <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ДлительностьДней 
				ИЛИ Строка.СчПробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СчПробег 
				ИЛИ Строка.Стоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Стоимость 
				ИЛИ Строка.НДС <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].НДС 
				ИЛИ Строка.СтоимостьИтого <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтоимостьИтого 
				ИЛИ Строка.СтанцияОтправления <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияОтправления 
				ИЛИ Строка.СтанцияНазначения <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].СтанцияНазначения 
				ИЛИ Строка.Груз <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].Груз 
				ИЛИ Строка.ТипВагона <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ТипВагона 
				ИЛИ Строка.ПринадлежностьВагона <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияЖДСоставляющей[Строка.НомерСтроки-1].ПринадлежностьВагона Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияКТКСоставляющей Цикл
			Если Строка.Пробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Пробег
				ИЛИ Строка.ДлительностьДней <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].ДлительностьДней
				ИЛИ Строка.СчПробег <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].СчПробег
				ИЛИ Строка.Операция <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияКТКСоставляющей[Строка.НомерСтроки-1].Операция Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если Строка.Услуга <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Услуга
				ИЛИ Строка.Затраты <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Затраты
				ИЛИ Строка.ВыставляемаяУслуга <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВыставляемаяУслуга
				ИЛИ Строка.Поставщик <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Поставщик
				ИЛИ Строка.Договор <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Договор
				ИЛИ Строка.Тариф20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф20
				ИЛИ Строка.Тариф40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Тариф40
				ИЛИ Строка.ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктОтправления
				ИЛИ Строка.ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПунктНазначения
				ИЛИ Строка.Цена20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена20
				ИЛИ Строка.Цена40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Цена40
				ИЛИ Строка.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаНДС
				ИЛИ Строка.НДСВключенВСтоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НДСВключенВСтоимость
				ИЛИ Строка.НормативныйПроцентВознаграждения20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения20
				ИЛИ Строка.НормативныйПроцентВознаграждения40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].НормативныйПроцентВознаграждения40
				ИЛИ Строка.Вознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение20
				ИЛИ Строка.Вознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Вознаграждение40
				ИЛИ Строка.СуммаВознаграждения20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения20
				ИЛИ Строка.СуммаВознаграждения40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаВознаграждения40
				ИЛИ Строка.Итого20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого20
				ИЛИ Строка.Итого40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Итого40
				ИЛИ Строка.СтавкаМаксимальная20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная20
				ИЛИ Строка.СтавкаМаксимальная40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СтавкаМаксимальная40
				ИЛИ Строка.СуммаНДС20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС20
				ИЛИ Строка.СуммаНДС40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].СуммаНДС40
				ИЛИ Строка.Валюта <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Валюта
				ИЛИ Строка.ВнутренняяСебестоимость <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ВнутренняяСебестоимость
				ИЛИ Строка.Возмещаемая <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Возмещаемая
				ИЛИ Строка.ПодсылПорожних <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПодсылПорожних
				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
				ИЛИ Строка.Примечание20 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание20
				ИЛИ Строка.Примечание40 <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].Примечание40
				ИЛИ Строка.ГруппаУслуг <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ГруппаУслуг
				ИЛИ Строка.ОсновнаяУслугаГруппы <> Объект.КалькуляцияСозданаНаОсновании.ММ_КалькуляцияМультимодальнойЦепочки[Строка.НомерСтроки-1].ОсновнаяУслугаГруппы Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.НФ_ПортыОтправленияНазначения Цикл
			Если Строка.Порт <> Объект.КалькуляцияСозданаНаОсновании.НФ_ПортыОтправленияНазначения[Строка.НомерСтроки-1].Порт Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.НФ_Линии Цикл
			Если Строка.Линия <> Объект.КалькуляцияСозданаНаОсновании.НФ_Линии[Строка.НомерСтроки-1].Линия Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ Изменено Тогда
		Для каждого Строка из Объект.ЖД_УслугиВнеСтавки Цикл
			Если Строка.Услуга <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Услуга
				ИЛИ Строка.ПунктОтправления <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктОтправления
				ИЛИ Строка.ПунктНазначения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПунктНазначения
				ИЛИ Строка.ВидРасходов <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВидРасходов
				ИЛИ Строка.Валюта <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Валюта
				ИЛИ Строка.СтавкаНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДС
				ИЛИ Строка.СуммаВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СуммаВключаетНДС
				ИЛИ Строка.СтавкаМаксимальная <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаМаксимальная
				ИЛИ Строка.Тариф20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф20
				ИЛИ Строка.ПроцентВознаграждения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПроцентВознаграждения
				ИЛИ Строка.СтавкаНДСВознаграждения <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].СтавкаНДСВознаграждения
				ИЛИ Строка.ВознаграждениеВключаетНДС <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВознаграждениеВключаетНДС
				ИЛИ Строка.БазаДляРасчетаВР <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].БазаДляРасчетаВР
				ИЛИ Строка.Себестоимость20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость20
				ИЛИ Строка.НормВознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение20
				ИЛИ Строка.Вознаграждение20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение20
				ИЛИ Строка.Ставка20 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка20
				ИЛИ Строка.Себестоимость40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Себестоимость40
				ИЛИ Строка.НормВознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].НормВознаграждение40
				ИЛИ Строка.Вознаграждение40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Вознаграждение40
				ИЛИ Строка.Ставка40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Ставка40
				ИЛИ Строка.Поставщик <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Поставщик
				ИЛИ Строка.Договор <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Договор
				ИЛИ Строка.Тариф40 <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].Тариф40
				ИЛИ Строка.ТипСтавки <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ТипСтавки
				ИЛИ Строка.ВключатьВПФПСЦ <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ВключатьВПФПСЦ
				ИЛИ Строка.ПлановаяСтоимостьИзЖДН <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ПлановаяСтоимостьИзЖДН
				ИЛИ Строка.ОснованиеДляВыставления <> Объект.КалькуляцияСозданаНаОсновании.ЖД_УслугиВнеСтавки[Строка.НомерСтроки-1].ОснованиеДляВыставления Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Изменено;
КонецФункции
//-- Зубов 03.08.2021 37315
// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетRT(Команда)
	
	Адрес = ПолучитьТЗУслугНаСервере();
	ОпОп = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыКалькуляции", ЭтотОбъект);
	ОткрытьФорму("Документ.Калькуляция.Форма.ФормаКалькуляции",Новый Структура("АдресТаблицыУслуг", Адрес),,,,,ОпОп);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗУслугНаСервере()
	
	ТЗУслуг = Объект.ММ_КалькуляцияЖДСоставляющей.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(ТЗУслуг, Новый УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗакрытияФормыКалькуляции(Параметр1, Параметр2) Экспорт
	ЗаполнитьУслугиНаСервере(Параметр1);
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиНаСервере(Параметр)
	АдресХранилища = Неопределено;
	Если НЕ Параметр = Неопределено И Параметр.Свойство("АдресТаблицыУслуг", АдресХранилища) Тогда
		ТЗУслуги = ПолучитьИзВременногоХранилища(АдресХранилища);
		Объект.ММ_КалькуляцияЖДСоставляющей.Загрузить(ТЗУслуги);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КалькуляцияЗавершенаПриИзменении(Элемент)
	
	Если Объект.КалькуляцияЗавершена Тогда
		
		ДляТекущейКалькуляцииНужнаУслугаПодсыла = Ложь;
		
		Если СтоимостьПодсылаВключенаВТекущуюОтправку(Объект.Отправка) Тогда
			ДляТекущейКалькуляцииНужнаУслугаПодсыла = Истина;
		Иначе
			ПредыдущаяОтправка = Отправки_сервер.ПолучитьПредыдущуюОтправку(Объект.Отправка);
			СтоимостьВключенаВПредыдущую = СтоимостьПодсылаВключенаВТекущуюОтправку(ПредыдущаяОтправка);
			Если НЕ СтоимостьВключенаВПредыдущую Тогда
				ДляТекущейКалькуляцииНужнаУслугаПодсыла = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ДляТекущейКалькуляцииНужнаУслугаПодсыла И Объект.ММ_КалькуляцияЖДСоставляющей.НайтиСтроки(Новый Структура("Операция", УслугаПодсылаВагонов)).Количество() = 0 Тогда
			
			ОпОп = Новый ОписаниеОповещения("ОтветНаОтсутствиеПодсыла", ЭтаФорма);
			ПоказатьВопрос(ОпОп, "В этой калькуляции должна быть учтена стоимость подсыла порожних вагонов, но ее нет. Вы действительно хотите оставить калькуляцию без стоимости подсыла?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаОтсутствиеПодсыла(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда
		Объект.КалькуляцияЗавершена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтоимостьПодсылаВключенаВТекущуюОтправку(Отправка)
	
	Возврат Отправка.Продукт.ВключаетРасходыПоПодсылуВагонов;
	
КонецФункции

&НаКлиенте
Процедура ММ_Вознаграждение40ПриИзменении(Элемент)
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ММ_СтавкаИтого = ММ_СебестоимостьСуши + Объект.ММ_Вознаграждение40;
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();
	КонецЕсли;
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияЖДСоставляющейДлительностьДнейПриИзменении(Элемент)
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ММ_СтавкаИтого20ПриИзменении(Элемент)
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	Объект.ММ_Вознаграждение = ММ_СтавкаИтого20 - ММ_СебестоимостьСуши20;
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ММ_ВознаграждениеПриИзменении(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		Объект.Валюта = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.Договор).Валюта; 
		
		//ДИТ Авдеева В. 43126 04.04.2022 начало 
		//УслугаПоКатегорииДоговора = ПолучитьУслугуПоКатегорииДоговора(Объект.Договор);   
		ЗаполнитьУслугуЕдиницыИзмерения();
		//ДИТ Авдеева В. 43126 04.04.2022 Конец      
		
		//ДИТ Шевченко А.В. 07.12.22 59978 -начало
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,ПериодДействия.ДатаНачала,ПериодДействия.ДатаОкончания);
		Элементы.НадписьНеДействуетДоговор.Видимость = НЕ ДоговорДействует;
		//ДИТ Шевченко А.В. 07.12.22 59978 -конец
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ВалютаФрахтовыхСтавокПриИзменении(Элемент)
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если НЕ Объект.ЗафиксироватьКурс Тогда
		Объект.ДатаКурса = ?(НЕ ЗначениеЗаполнено(Объект.ДатаКурса),ТекущаяДата(),Объект.ДатаКурса);
		ВалютаИтоговСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.ДатаКурса);
		Объект.Курс = ВалютаИтоговСтруктура.Курс;
	КонецЕсли;
	
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();                       
	КонецЕсли; //Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	
	ОбновитьИтоговыеПараметрыТаблиц(Объект.Валюта,Истина,,Истина);
	ВалютаИтогов = Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если НоваяСтрока И ТекД <> неопределено Тогда
		ТекД.Валюта = Объект.Валюта;
		ТекД.СтавкаНДС = Объект.СтавкаНДС;
		ТекД.НДСВключенВСтоимость = Объект.СуммаВключаетНДС;
		ТекД.ПунктОтправления = Объект.Суша_ПунктОтправления;
		ТекД.ПунктНазначения = Объект.Суша_ПунктНазначения;
	КонецЕсли;
	//Евросиб - АСуслов 27.09.2022 13:35:46 #
	//(
	Если Копирование Тогда
		ТекД.ИдентификаторСтроки = "";
		// Евросиб US 86792 TA 86795 Рыбьяков К.А. 15.06.2024 ((
		Если ТекД.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ") Тогда
			ТекД.Услуга = Неопределено;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 15.06.2024 ))
	КонецЕсли;
	//)
	//Евросиб - АСуслов 27.09.2022 13:35:47 #   
	
	//Евросиб - АСуслов 28.06.2023 10:43:33 #локации
	//(
	Если НоваяСтрока 
		И Не Копирование 
		// ДИТ US 85649 Сержантова А.С. Начало: 23.05.2024    
		и не КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции)
		// ДИТ US 85649 Сержантова А.С. Конец: 23.05.2024
		Тогда
		ТекД.ПунктОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		ТекД.ПунктНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 28.06.2023 10:43:36 #локации     
	
	// ДИТ US 85649 Сержантова А.С. Начало: 27.05.2024
	Если НоваяСтрока И Не Копирование 
		и КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции) Тогда
	    Если СписокСтанцийОтправления.Количество() Тогда
			ТекД.ПунктОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;
		 Если СписокСтанцийНазначения.Количество() Тогда
			ТекД.ПунктНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 85649 Сержантова А.С. Конец: 27.05.2024
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияЖДСоставляющейОперацияПриИзменении(Элемент)
	ВычислитьДлительностьТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияКТКСоставляющейОперацияПриИзменении(Элемент)
	ВычислитьДлительностьТекущейСтроки(Элементы.ММ_КалькуляцияКТКСоставляющей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоДоговору(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораДоговора", ЭтаФорма);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДоговора(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Объект.Договор = Параметр1;
	Объект.Контрагент = КонтрагентыДоговоры_сервер.ПолучитьВладельцаДоговора(Объект.Договор);
	
	//ДИТ Авдеева В. 43126 04.04.2022 начало      
	//УслугаПоКатегорииДоговора = ПолучитьУслугуПоКатегорииДоговора(Объект.Договор);   
	ЗаполнитьУслугуЕдиницыИзмерения();
	//ДИТ Авдеева В. 43126 04.04.2022 Конец 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
//Евросиб Гудкова( 08.09.2021 Ticket№ 
	//по требованию Ложниковой запрос в Спарк отключен, требуется только для согласования договоров.	
	СПАРК_СкачатьДосьеЗавершение(КодВозвратаДиалога.Нет, Неопределено);
	//// если спарк запрос выполнен более 3 дней назад, то запросить заново
	//Если СПАРКЗапросыСервер.ЗапросБылВыполненМенее3ДнейНазад(Объект.Контрагент) Тогда
	//	ПоказатьВопрос(Новый ОписаниеОповещения("СПАРК_СкачатьДосьеЗавершение", ЭтаФорма), "Предыдущий запрос досье СПАРК был выполнен менее трех дней назад. Загрузить актуальную версию досье контрагента?",
	//	РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	//Иначе
	//	СПАРК_СкачатьДосьеЗавершение(КодВозвратаДиалога.Да, Неопределено);
	//КонецЕсли;
// Евросиб Гудкова) 	

КонецПроцедуры

&НаКлиенте
Процедура СПАРК_СкачатьДосьеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СПАРК_СкачатьДосьеФрагмент();
		СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры);
	КонецЕсли;		
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;		
	
	СПАРК_ОбновитьПоказателиФрагмент();

КонецПроцедуры

&НаСервере
Процедура СПАРК_ОбновитьПоказателиФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО, ПоследнееОбновлениеСПАРК");
	СтруктураРеквизитов.Контрагент = Объект.Контрагент;
	СтруктураРеквизитов.ИНН = Объект.Контрагент.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Контрагент.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_ОбновитьПоказателиНаСервере(СтруктураРеквизитов, Отказ);
КонецПроцедуры

&НаСервере
Процедура СПАРК_СкачатьДосьеФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО");
	СтруктураРеквизитов.Контрагент = Объект.Контрагент;
	СтруктураРеквизитов.ИНН = Объект.Контрагент.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Контрагент.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_СкачатьДосьеНаСервере(СтруктураРеквизитов, Отказ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	//ПолучитьДанныеИзБазы();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБазы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияСостояния.Ссылка КАК Ссылка,
	               |	КалькуляцияСостояния.НомерСтроки КАК НомерСтроки,
	               |	КалькуляцияСостояния.Состояние КАК Состояние,
	               |	КалькуляцияСостояния.Исполнитель КАК Исполнитель,
	               |	КалькуляцияСостояния.Наблюдатель КАК Наблюдатель,
	               |	КалькуляцияСостояния.Статус КАК Статус,
	               |	КалькуляцияСостояния.НачалоРаботы КАК НачалоРаботы,
	               |	КалькуляцияСостояния.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	КалькуляцияСостояния.ПричинаОтказа КАК ПричинаОтказа,
	               |	КалькуляцияСостояния.СтатусСогласования КАК СтатусСогласования,
	               |	КалькуляцияСостояния.ПредыдущиеЭтапы КАК ПредыдущиеЭтапы,
	               |	КалькуляцияСостояния.НормативИсполненияСМоментаСоздания КАК НормативИсполненияСМоментаСоздания
	               |ИЗ
	               |	Документ.Калькуляция.Состояния КАК КалькуляцияСостояния
	               |ГДЕ
	               |	КалькуляцияСостояния.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Объект.Состояния.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаИтоговПриИзменении(Элемент)
	
	Если НЕ Объект.ЗафиксироватьКурс Тогда
		Объект.ДатаКурса = ?(НЕ ЗначениеЗаполнено(Объект.ДатаКурса),ТекущаяДата(),Объект.ДатаКурса);
		ВалютаИтоговСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаИтогов, Объект.ДатаКурса);
		КурсИтогов = ВалютаИтоговСтруктура.Курс;
	КонецЕсли;
	
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьКурсПриИзменении(Элемент)
	Элементы.Курс.Доступность = НЕ Объект.ЗафиксироватьКурс;
	Элементы.ДатаКурса.Доступность = НЕ Объект.ЗафиксироватьКурс;
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина, Истина,Истина)
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПодрядчикам(Команда)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОткрытьФорму("Обработка.СозданиеЗапросаПоставщику.Форма", Новый Структура("Услуга, РегионОказания", ТекД.Услуга, "" + Объект.Суша_ПунктОтправления + " - " + Объект.Суша_ПунктНазначения),,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеЗаполнениеКПр(Команда)
	АвтоматическоеЗаполнениеКПрНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОчиститьФорматПеревозки(ФПеревозки)
	
	Результат = ФПеревозки;
	
	МассивСоставляющих = СтрРазделить(ФПеревозки, "-", Ложь);
	
	Если МассивСоставляющих.Количество() > 1 Тогда
		Результат = МассивСоставляющих[1];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура АвтоматическоеЗаполнениеКПрНаСервере()
	
	УслПредоставленияКТК = Константы.УслугаОтражающаяПредоставлениеКТКДляКалькуляции.Получить();
	
	Объект.КП2_СоставУслуг.Очистить();
	Объект.КП2_ДоговорнаяЦенаВключает.Очистить();
	Объект.КП2_ДополнительныеУслуги.Очистить();
	
	УслугаПредоставленияКТК = Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиСтроки(Новый Структура("Услуга", УслПредоставленияКТК));
	
	Если Объект.ММ_ИтогоСтавка20 > 0 И УслугаПредоставленияКТК.Количество() > 0 Тогда
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "20 футов с предоставлением контейнера";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка20;
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "20 футов контейнер клиента";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка20 - РаботаСКурсамиВалют.ПересчитатьВВалюту(УслугаПредоставленияКТК[0].Итого20, УслугаПредоставленияКТК[0].Валюта, Объект.Валюта, Объект.ДатаКурса);
		
	ИначеЕсли Объект.ММ_ИтогоСтавка20 > 0 И УслугаПредоставленияКТК.Количество() = 0 Тогда
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "20 футов контейнер клиента";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка20;
		
	КонецЕсли;
	
	Если Объект.ММ_ИтогоСтавка > 0 И УслугаПредоставленияКТК.Количество() > 0 Тогда
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "40 футов с предоставлением контейнера";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка;
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "40 футов контейнер клиента";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка - РаботаСКурсамиВалют.ПересчитатьВВалюту(УслугаПредоставленияКТК[0].Итого40, УслугаПредоставленияКТК[0].Валюта, Объект.Валюта, Объект.ДатаКурса);
		
	ИначеЕсли Объект.ММ_ИтогоСтавка > 0 И УслугаПредоставленияКТК.Количество() = 0 Тогда
		
		НСтр = Объект.КП2_СоставУслуг.Добавить();
		НСтр.СтанцияОтправления = Объект.Суша_ПунктОтправления.Наименование;
		НСтр.СтанцияНазначения = Объект.Суша_ПунктНазначения.Наименование;
		НСтр.УсловияПеревозки = "" + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Отправление) + " - " + ОчиститьФорматПеревозки(Объект.УсловияПеревозки_Прибытие);
		НСтр.ВремяВПути = Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
		НСтр.КоличествоКТК = 0;
		НСтр.Типоразмер = "40 футов контейнер клиента";
		НСтр.СтавкаБезОхраны = Объект.ММ_ИтогоСтавка;
		
	КонецЕсли;
	
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		Объект.КП2_ДоговорнаяЦенаВключает.Добавить().Составляющая = Стр.Услуга.НаименованиеПолное;
	КонецЦикла;
	
	Для каждого Стр из Объект.ЖД_УслугиВнеСтавки Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Услуга.НаименованиеДляКП) Тогда Продолжить; КонецЕсли;
		
		НСтр = Объект.КП2_ДополнительныеУслуги.Добавить();
		НСтр.Составляющая = Стр.Услуга.НаименованиеДляКП;
		НСтр.ОтобразитьСТочкой = Истина;
		
		Если ЗначениеЗаполнено(Стр.Ставка20) Тогда
			НСтр = Объект.КП2_ДополнительныеУслуги.Добавить();
			НСтр.Составляющая = "20 футов - " + Стр.Ставка20 + " " + Стр.Валюта;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Стр.Ставка40) Тогда
			НСтр = Объект.КП2_ДополнительныеУслуги.Добавить();
			НСтр.Составляющая = "40 футов - " + Стр.Ставка40 + " " + Стр.Валюта;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМенеджеров(Команда)
	
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка", Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Ложь), Элементы.КП2_ГруппаМенеджеров, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеМенеджера(Менеджер)
	
	Результат = Новый Структура("ФИО, Должность, Телефон, Мобильный, ЭлПочта");
	
	Результат.ФИО = "" + Менеджер.ФизическоеЛицо.Имя + " " + Менеджер.ФизическоеЛицо.Фамилия;
	Результат.Должность = Менеджер.ФизическоеЛицо.Должность;
	
	Для каждого Стр из Менеджер.ФизическоеЛицо.КонтактнаяИнформация Цикл
		
		Если ЗначениеЗаполнено(Стр.АдресЭП) Тогда Результат.ЭлПочта = "e-mail: " + Стр.АдресЭП; КонецЕсли;
		Если ЗначениеЗаполнено(Стр.НомерТелефона) Тогда Результат.Телефон = "тел.: " + Стр.НомерТелефона; КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеКПНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.НаименованиеДляКП;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	
	ТекД = Элементы.КП2_ГруппаМенеджеров.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ПоказатьЗначение(, ТекД.Менеджер);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КП2_ДоговорнаяЦенаНЕВключаетПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = истина;
	ОпОп = Новый ОписаниеОповещения("ВыборНоменклатурыДляКП", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНоменклатурыДляКП(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(П1) Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из П1 Цикл
		
		РЕЗ = ПолучитьНаименованиеКПНоменклатуры(Стр);
		Если ЗначениеЗаполнено(РЕЗ) Тогда
			Объект.КП2_ДоговорнаяЦенаНЕВключает.Добавить().Составляющая = РЕЗ;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПодрядчикамМоре(Команда)
	
	ТекД = Элементы.ММ_ТаблицаСтавокФрахт.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		Услуга = УслугаФрахтаДляКалькуляции;
		ОткрытьФорму("Обработка.СозданиеЗапросаПоставщику.Форма", Новый Структура("Услуга, РегионОказания", Услуга, "" + Объект.ММ_ПортОтправления + " - " + ТекД.Порт),,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПодрядчикамПрочиеУслуги(Команда)
	
	ТекД = Элементы.ЖД_УслугиВнеСтавки1.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		Услуга = ТекД.Услуга;
		ОткрытьФорму("Обработка.СозданиеЗапросаПоставщику.Форма", Новый Структура("Услуга, РегионОказания", Услуга, "" + ТекД.ПунктОтправления + " - " + ТекД.ПунктНазначения),,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КП2_ГруппаМенеджеровОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого Стр из ВыбранноеЗначение Цикл
		
		Если Объект.КП2_ГруппаМенеджеров.НайтиСтроки(Новый Структура("Менеджер", Стр)).Количество() > 0 Тогда Продолжить; КонецЕсли;
		
		НСтр = Объект.КП2_ГруппаМенеджеров.Добавить();
		НСтр.Менеджер = Стр;
		СтруктураОписания = ПолучитьОписаниеМенеджера(Стр);
		ЗаполнитьЗначенияСвойств(НСтр, СтруктураОписания);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Новый Структура("ОдиночныйВыбор", Истина),Элементы.ОсновнаяУслуга,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура море20_Очистить(Команда)
	
	Объект.море20_Себестоимость = неопределено;
	Объект.море20_Вознаграждение = неопределено;
	Объект.море20_Контрагент = неопределено;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура море40_Очистить(Команда)
	
	Объект.море40_Себестоимость = неопределено;
	Объект.море40_Вознаграждение = неопределено;
	Объект.море40_Контрагент = неопределено;
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов,Истина,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиДоговорПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД <> Неопределено и ЗначениеЗаполнено(ТекД.Договор) Тогда
		ВалютаЪ = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(ТекД.Договор);
		ТекД.Валюта = ВалютаЪ.Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиДоговор1ПриИзменении(Элемент)
	
	ТекД = Элементы.ЖД_УслугиВнеСтавки1.ТекущиеДанные;
	Если ТекД <> Неопределено и ЗначениеЗаполнено(ТекД.Договор) Тогда
		ВалютаЪ = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(ТекД.Договор);
		ТекД.Валюта = ВалютаЪ.Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// проверим, что если это фрахтовая калькуляция, то для нее соблюдены условия портов
	Если ТекущийОбъект.ФрахтИмпорт = Истина Тогда // 0 = импорт
		
		// Евросиб US 87896 TA 91708 Рыбьяков К.А. 16.09.2024 ((
		Для Каждого Строка Из ТекущийОбъект.ММ_ПортыОтправленияНазначения Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Порт, "ИспользованиеПортаВКалькуляции") = 1 Тогда
				ИндексСтроки = Строка(Строка.НомерСтроки - 1);
				ТекстСообщения = НСтр("ru = 'Для порта " + Строка.Порт + " разрешено использование только в экспорте'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, 
					, 
					"ММ_ПортыОтправленияНазначения[" + ИндексСтроки + "].Порт", 
					"Объект", 
					Отказ);
			КонецЕсли;
		КонецЦикла;
		//Если ТекущийОбъект.ММ_ПортОтправления.ИспользованиеПортаВКалькуляции = 1 Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для порта "+ТекущийОбъект.ММ_ПортОтправления+" разрешено использование только в экспорте!",, "Объект.ММ_ПортОтправления",, Отказ);
		//КонецЕсли;
		// Евросиб Рыбьяков К.А. 16.09.2024 ))
		
	Иначе // 1 = экспорт
		
		Для каждого СтрПорт из ТекущийОбъект.НФ_ПортыОтправленияНазначения Цикл
			
			Если СтрПорт.Порт.ИспользованиеПортаВКалькуляции = 2 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для порта "+СтрПорт.Порт+" разрешено использование только в импорте!",, "Объект.НФ_ПортыОтправленияНазначения",, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//БИТ Белинский 16.05.2023 начало TASK 66201
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Если Не (ЭтоМежсервисныеРасходы() И Объект.Контрагент = ДирекцияКонтейнерныхПеревозок()) Тогда
	Если Не (ЭтоМежсервисныеРасходы() И КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент)) Тогда
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	//БИТ Белинский 16.05.2023 конец TASK 66201
			
		// проверим, что по операциям, где требуется указать длительность, она фактически указана
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыОпераций.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ВидыОпераций КАК ВидыОпераций
		               |ГДЕ
		               |	ВидыОпераций.ТребоватьУказаниеДлительности";
		МассивОперацийСДлительностью = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Для каждого Стр из Объект.ММ_КалькуляцияЖДСоставляющей Цикл
			Если НЕ ЗначениеЗаполнено(Стр.ДлительностьДней) И МассивОперацийСДлительностью.Найти(Стр.Операция) <> неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите длительность отмеченных операций!",, "Объект.ММ_КалькуляцияЖДСоставляющей",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	//БИТ Белинский 16.05.2023 начало TASK 66201
	КонецЕсли;
	//БИТ Белинский 16.05.2023 конец TASK 66201
	
	//Евросиб Каблов 19.04.2021 ( Ticket#0227397
	//Объект.ЕдиницаИзмерения = ПолучитьРеквизитСсылкиНаСервере(ОсновнаяУслуга, "ЕдиницаИзмерения").ЕдиницаИзмерения;
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение")
		И (Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого")
		Или Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом"))
		И Объект.ЕдиницаИзмерения <> ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для калькуляции с типом Предоставление ПС единицей измерения должен быть указан Вагон!",,"ЕдиницаИзмерения",, Отказ);
	КонецЕсли;
	//Евросиб Каблов 19.04.2021 ) 
	
	//Евросиб Коханенко Н.А. 28.08.2025 (( #93365 
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение")
		И ТекущийОбъект.Проведен
		И Модифицированность Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаявкаДок.Номер КАК Номер
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ЗаявкаДок
			|		ПО (ЗаявкаСоставУслуги.Ссылка = ЗаявкаДок.Ссылка)
			|ГДЕ
			|	ЗаявкаСоставУслуги.Ссылка.Проведен
			|	И ЗаявкаСоставУслуги.Калькуляция = &Калькуляция
		|";

		Запрос.УстановитьПараметр("Калькуляция", ТекущийОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			Заявка = РезультатЗапроса.Выгрузить();
			
			Текст = СтрШаблон("У калькуляции есть привязка к заявке № %1. Для внесения изменений в калькуляцию необходимо отвязать заявку.", 
				ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Заявка[0].Номер));
			ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			
		КонецЕсли;

	КонецЕсли;
	//Евросиб Коханенко Н.А. 28.08.2025 )) #93365 
	
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
	ТекущийОбъект.СписокСтанцийНазначения.Очистить();
	Для каждого Стр из СписокСтанцийНазначения Цикл 
		НСтр = ТекущийОбъект.СписокСтанцийНазначения.Добавить();
		НСтр.Станция = Стр.Значение; 
	КонецЦикла;
	ТекущийОбъект.СписокСтанцийОтправления.Очистить();
	Для каждого Стр из СписокСтанцийОтправления Цикл 
		НСтр = ТекущийОбъект.СписокСтанцийОтправления.Добавить();
		НСтр.Станция = Стр.Значение; 
	КонецЦикла;
	
	//Евросиб - АСуслов 23.11.2022 11:17:23 #61088
	//(
	Если Константы.ЗапретитьЗаписьКалькуляцииСПустойСухопутнойЧастью.Получить()
		И ТекущийОбъект.ММ_КалькуляцияМультимодальнойЦепочки.Количество() = 1 
		И ТекущийОбъект.ММ_КалькуляцияМультимодальнойЦепочки[0].Итого20 = 0
		И ТекущийОбъект.ММ_КалькуляцияМультимодальнойЦепочки[0].Итого40 = 0
		Тогда          
		ШаблонСообщения = "Запрещено записывать калькуляцию с единственной строчкой в таблице 1.3 и незаполненной ставкой.
		|Удалите строчку или заполните ставку.";
		ОбщегоНазначения.СообщитьПользователю(
					ШаблонСообщения,
					ТекущийОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ММ_КалькуляцияМультимодальнойЦепочки", 1, "Итого20"),,Отказ);	
		ОбщегоНазначения.СообщитьПользователю("Запись документа отменена.");
		Возврат;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 23.11.2022 11:17:26 #61088
	//Евросиб - АСуслов 26.09.2022 12:15:41 #
	//(
	ЕстьСообщенияОбязательногоЗаполненияЛокацийВКалькуляции = Ложь;
	Для каждого Стр из ТекущийОбъект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		//++ДИТ Кузнецов Е.Е. Ticket#0290442 31.10.2022
		//Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Услуга,"ТребоватьОбязательногоЗаполненияЛокацийВКалькуляции")
	    ОбязательноеЗаполнениеЛокацийВКалькуляции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Услуга,"ТребоватьОбязательногоЗаполненияЛокацийВКалькуляции");
		Если ОбязательноеЗаполнениеЛокацийВКалькуляции = Истина
		//--ДИТ Кузнецов Е.Е. Ticket#0290442 31.10.2022
			И (НЕ ЗначениеЗаполнено(Стр.ПунктОтправления) 
				ИЛИ НЕ ЗначениеЗаполнено(Стр.ПунктНазначения)) Тогда
				Если ЗначениеЗаполнено(Стр.ПунктОтправления) Тогда
					ПодсвечиваемыйЭлементУправления = "ПунктНазначения";
				Иначе
					ПодсвечиваемыйЭлементУправления = "ПунктОтправления";
				КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон("По услуге %1 необходимо заполнить пункт отправления и назначения!", Стр.Услуга),
						ТекущийОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ММ_КалькуляцияМультимодальнойЦепочки", Стр.НомерСтроки, ПодсвечиваемыйЭлементУправления),,Отказ);	
			Отказ = Истина; 
			ЕстьСообщенияОбязательногоЗаполненияЛокацийВКалькуляции = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Если ЕстьСообщенияОбязательногоЗаполненияЛокацийВКалькуляции Тогда
		ОбщегоНазначения.СообщитьПользователю("Изменить ограничения можно в карточке соответствующей номенклатуры");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 26.09.2022 12:15:42 #
	
	// Евросиб Фролов (28.12.2021 TASK№ 42761
	Если БылиИзменения Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("КалькуляцияИзменена", Истина);
	КонецЕсли;	
	// Евросиб Фролов) 
	
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НормативнаяКонтрибуция", НормативнаяКонтрибуция);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РасчетнаяКонтрибуция20", РасчетнаяКонтрибуция20);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РасчетнаяКонтрибуция40", РасчетнаяКонтрибуция40);
	//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305    
	
	//Евросиб Коханенко Н.А. 05.08.2025 (( #115687 
	Если Объект.ТипКалькуляции = Перечисления.ТипыКалькуляций.ДоплатныеПВ Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.ДоплатныеПВ);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 05.08.2025 )) #115687
	
КонецПроцедуры 

&НаКлиенте
Процедура ВопросУстановитьСнятьПризнакОтсутствуетПеревозкаПоЖД(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОтсутствуетПеревозкаПоЖД = ДополнительныеПараметры.ЗначениеЕслиДа;
	Иначе
		Если ДополнительныеПараметры.Свойство("ЗначениеЕслиНет") Тогда
			Объект.ОтсутствуетПеревозкаПоЖД = ДополнительныеПараметры.ЗначениеЕслиНет;
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;
	ПараметрыЗаписи.Вставить("ПропуститьПроверку", Истина);
	Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("Закрыть") Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиИтого20ПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.Вознаграждение20 = 0;
		ТекД.СуммаВознаграждения20 = ТекД.Итого20 - (ТекД.Цена20 + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС20));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиИтого40ПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.Вознаграждение40 = 0;
		ТекД.СуммаВознаграждения40 = ТекД.Итого40 - (ТекД.Цена40 + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС40));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНовыйФрахт(Команда)
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
	//Если Объект.НФ_ПортыОтгрузкиВыгрузки.Количество() = 0 Тогда
	//	Если Объект.ФрахтИмпорт Тогда
	//		ОбщегоНазначенияКлиент.СообщитьПользователю(
	//			Нстр("ru = 'Укажите хотя бы один порт отгрузки'"), , "НФ_ПортыОтгрузкиВыгрузки", "Объект");
	//	Иначе
	//		ОбщегоНазначенияКлиент.СообщитьПользователю(
	//			Нстр("ru = 'Укажите хотя бы один порт выгрузки'"), , "НФ_ПортыОтгрузкиВыгрузки", "Объект");
	//	КонецЕсли;
	//	Возврат;
	//КонецЕсли;
	// Евросиб Рыбьяков К.А. 11.09.2024 ))
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
	Если Объект.ММ_ПортыОтправленияНазначения.Количество() = 0 И Объект.НФ_ПортыОтправленияНазначения.Количество() = 0 Тогда
		
		НФ_ЛинииПорты.Очистить();
		УдалитьСтарыеЭлементы();
		
		ОбновитьТаблицуВыбранныхСтавок(Ложь); // Рыбьяков К.А. 12.09.2024 (( Поставил Истина
	Иначе
		Если Объект.ММ_ПортыОтправленияНазначения.Количество() = 0  Тогда
			Если Объект.ФрахтИмпорт Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				Нстр("ru = 'Укажите порт назначения'"), , "ММ_ПортыОтправленияНазначения", "Объект");
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				Нстр("ru = 'Укажите порт отправления'"), , "ММ_ПортыОтправленияНазначения", "Объект");
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Объект.НФ_ПортыОтправленияНазначения.Количество() = 0 Тогда
			Если Объект.ФрахтИмпорт Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				Нстр("ru = 'Укажите хотя бы один порт отправления'"), , "НФ_ПортыОтправленияНазначения", "Объект");
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				Нстр("ru = 'Укажите хотя бы один порт назначения'"), , "НФ_ПортыОтправленияНазначения", "Объект");
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Объект.НФ_Линии.Количество() = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Нстр("ru = 'Укажите хотя бы одну линию'"), , "НФ_Линии", "Объект");
			Возврат;
		КонецЕсли;
		
		НФ_ЛинииПорты.Очистить();
		УдалитьСтарыеЭлементы();
		
		ОбновитьТаблицуВыбранныхСтавок(Ложь); // Рыбьяков К.А. 12.09.2024 (( Поставил Истина
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 11.09.2024 ))
	
	//НФ_ЛинииПорты.Очистить();
	//УдалитьСтарыеЭлементы();

	//ОбновитьТаблицуВыбранныхСтавок(Ложь); // Рыбьяков К.А. 12.09.2024 (( Поставил Истина
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуВыбранныхСтавок(ДанныеИзТарифа)
	
	//1. создать таблицу
	// создаем колонки
	// сначала удалить все старые колонки
	//необходимо удалить старые программно созданные реквизиты
	МассивУдаляемыхРеквизитовФормы = новый Массив;
	Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("НФ_ЛинииПорты") Цикл
		ПутьКДан = ?(ЗначениеЗаполнено(Стр.Путь),Строка(Стр.Путь)+".","");
		Если СтрНачинаетсяС(Стр.Имя,"НФ_ИмяПорта") Тогда 
			МассивУдаляемыхРеквизитовФормы.Добавить(Строка(ПутьКДан) + Стр.Имя); 
		КонецЕсли;
	КонецЦикла;
		
	ТЗ = Новый ТаблицаЗначений;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ПараметрыЧисла = Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Любой);
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.УсловияПеревозкиПоПортам"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Валюты"));

	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, ПараметрыЧисла);
	
	МассивТипов2 = Новый Массив;
	МассивТипов2.Добавить(Тип("Число"));
	ПараметрыЧисла = Новый КвалификаторыЧисла(1);
	МассивТипов2.Добавить(Тип("Булево"));

	ДопустимыеТипы2 = Новый ОписаниеТипов(МассивТипов2,ПараметрыЧисла);
	
	
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_SOC_",ДопустимыеТипы);
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_Выбрано_SOC_",ДопустимыеТипы2,"Выб.");
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_Флажок_SOC_",Новый ОписаниеТипов("Булево"),"Выб.");
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_COC_",ДопустимыеТипы);
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_Выбрано_COC_",ДопустимыеТипы2,"Выб.");
	ТЗ.Колонки.Добавить("НФ_ИмяПорта_Флажок_COC_",Новый ОписаниеТипов("Булево"),"Выб.");
	
	МассивРеквизитов = Новый Массив;

	Для Каждого Стр Из Объект.НФ_ПортыОтправленияНазначения Цикл
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			ИмяКолонкиРеквизит = СокрЛП(Колонка.Имя + Строка(Стр.Порт.Код));
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяКолонкиРеквизит, Колонка.ТипЗначения,"НФ_ЛинииПорты"));
		КонецЦикла;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов,МассивУдаляемыхРеквизитовФормы);
	МассивУдаляемыхРеквизитовФормы.Очистить();
	
	Для Каждого Стр Из Объект.НФ_ПортыОтправленияНазначения Цикл
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			
			Если НЕ СтрНайти(Колонка.Имя,"SOC") = 0 Тогда
				SOCCOC = "SOC"
			Иначе
				SOCCOC = "COC"
			КонецЕсли;
			
			ИмяКолонкиЭлементФормы = СокрЛП(Колонка.Имя + Строка(Стр.Порт.Код));
			Если НЕ СтрНайти(Колонка.Имя,"SOC") = 0 И СтрНайти(Колонка.Имя,"Выбрано") = 0 И СтрНайти(Колонка.Имя,"Флажок") = 0 Тогда
				
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 12.09.2024 ((
				ИмяГруппыКолонок = "НФ_ИмяПорта_ГруппаИмя_" + SOCCOC + "_" + СокрЛП(Строка(Стр.Порт.Код));
				Попытка
					НоваяГруппаКолонок = Элементы.Добавить(ИмяГруппыКолонок,Тип("ГруппаФормы"), Элементы.НФ_ЛинииПорты);
					НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
					НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
					НоваяГруппаКолонок.Заголовок = Стр.Порт.Наименование;
					НоваяГруппаКолонок.Подсказка = Стр.Порт.Наименование;
					НоваяГруппаКолонок.ОтображатьВШапке = Истина;
					НовСтрЭФ = СписокЭФ.Добавить();
					НовСтрЭФ.ТекЭлемент = ИмяГруппыКолонок;
				Исключение
					НоваяГруппаКолонок = Элементы.Найти(ИмяГруппыКолонок);
				КонецПопытки;
				// Евросиб Рыбьяков К.А. 12.09.2024 ))
				
				НовыйЭлемент = Элементы.Добавить(ИмяКолонкиЭлементФормы, Тип("ПолеФормы"), НоваяГруппаКолонок);
				НовыйЭлемент.ПутьКДанным = "НФ_ЛинииПорты." + ИмяКолонкиЭлементФормы;
				НовыйЭлемент.Заголовок = Строка("SOC");
				НовыйЭлемент.Ширина = 8;
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.УстановитьДействие("НачалоВыбора","ЗначениеВПортуНачалоВыбора");
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
				//НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "ЗначениеВПортуОкончаниеВводаТекстаSOC");
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "ЗначениеВПортуПриИзмененииSOC");
				// Евросиб Рыбьяков К.А. 06.09.2024 ))

			ИначеЕсли НЕ СтрНайти(Колонка.Имя,"COC") = 0 И СтрНайти(Колонка.Имя,"Выбрано") = 0 И СтрНайти(Колонка.Имя,"Флажок") = 0 Тогда
				
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 12.09.2024 ((
				ИмяГруппыКолонок = "НФ_ИмяПорта_ГруппаИмя_" + SOCCOC + "_" + СокрЛП(Строка(Стр.Порт.Код));
				Попытка
					НоваяГруппаКолонок = Элементы.Добавить(ИмяГруппыКолонок,Тип("ГруппаФормы"), Элементы.НФ_ЛинииПорты);
					НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
					НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
					НоваяГруппаКолонок.Заголовок = Стр.Порт.Наименование;
					НоваяГруппаКолонок.Подсказка = Стр.Порт.Наименование;
					НоваяГруппаКолонок.ОтображатьВШапке = Истина;
					НовСтрЭФ = СписокЭФ.Добавить();
					НовСтрЭФ.ТекЭлемент = ИмяГруппыКолонок;
				Исключение
					НоваяГруппаКолонок = Элементы.Найти(ИмяГруппыКолонок);
				КонецПопытки;
				// Евросиб Рыбьяков К.А. 12.09.2024 ))
				
				НовыйЭлемент = Элементы.Добавить(ИмяКолонкиЭлементФормы, Тип("ПолеФормы"), НоваяГруппаКолонок);
				НовыйЭлемент.ПутьКДанным = "НФ_ЛинииПорты." + ИмяКолонкиЭлементФормы;
				НовыйЭлемент.Заголовок = Строка("COC");
				НовыйЭлемент.Ширина = 8;
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.УстановитьДействие("НачалоВыбора","ЗначениеВПортуНачалоВыбора");
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
				//НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "ЗначениеВПортуОкончаниеВводаТекстаCOC");
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "ЗначениеВПортуПриИзмененииCOC");
				// Евросиб Рыбьяков К.А. 06.09.2024 ))
			ИначеЕсли НЕ СтрНайти(Колонка.Имя,"Выбрано") = 0 Тогда
				
				ИмяГруппыКолонок = "НФ_ИмяПорта_Группа_" + SOCCOC + "_" + СокрЛП(Строка(Стр.Порт.Код));
				Попытка
					НоваяГруппаКолонок = Элементы.Добавить(ИмяГруппыКолонок,Тип("ГруппаФормы"), Элементы.НФ_ЛинииПорты);
					НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
					НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
					НоваяГруппаКолонок.ОтображатьВШапке = Ложь;
					НовСтрЭФ = СписокЭФ.Добавить();
					НовСтрЭФ.ТекЭлемент = ИмяГруппыКолонок;
				Исключение
					НоваяГруппаКолонок = Элементы.Найти(ИмяГруппыКолонок);
				КонецПопытки;
				
				НовыйЭлемент = Элементы.Добавить(ИмяКолонкиЭлементФормы, Тип("ПолеФормы"), НоваяГруппаКолонок);       
				НовыйЭлемент.ПутьКДанным = "НФ_ЛинииПорты." + ИмяКолонкиЭлементФормы;
				НовыйЭлемент.Заголовок = "Выб.";
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Ширина = 1;
				НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ИначеЕсли НЕ СтрНайти(Колонка.Имя,"Флажок") = 0 Тогда
				
				ИмяГруппыКолонок = "НФ_ИмяПорта_Группа_" + SOCCOC + "_" + СокрЛП(Строка(Стр.Порт.Код));
				Попытка
					НоваяГруппаКолонок = Элементы.Добавить(ИмяГруппыКолонок,Тип("ГруппаФормы"), Элементы.НФ_ЛинииПорты);
					НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
					НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
					НоваяГруппаКолонок.ОтображатьВШапке = Ложь;
					НовСтрЭФ = СписокЭФ.Добавить();
					НовСтрЭФ.ТекЭлемент = ИмяГруппыКолонок;
				Исключение
					НоваяГруппаКолонок = Элементы.Найти(ИмяГруппыКолонок);
				КонецПопытки;
				
				НовыйЭлемент = Элементы.Добавить(ИмяКолонкиЭлементФормы, Тип("ПолеФормы"), НоваяГруппаКолонок);       
				НовыйЭлемент.ПутьКДанным = "НФ_ЛинииПорты." + ИмяКолонкиЭлементФормы;
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.Заголовок = "Выб.";
			КонецЕсли;
			НовСтрЭФ = СписокЭФ.Добавить();
			НовСтрЭФ.ТекЭлемент = ИмяКолонкиЭлементФормы;
		КонецЦикла;
	КонецЦикла;
	
	СтатьиПо20 = Новый Массив;
	СтатьиПо20.Добавить(Перечисления.СтатьяФрахта.Вознаграждение20);
	СтатьиПо20.Добавить(Перечисления.СтатьяФрахта.Итого20);
	СтатьиПо20.Добавить(Перечисления.СтатьяФрахта.Фрахт20);
	
	СтатьиПо40 = Новый Массив;
	СтатьиПо40.Добавить(Перечисления.СтатьяФрахта.Вознаграждение40);
	СтатьиПо40.Добавить(Перечисления.СтатьяФрахта.Итого40);
	СтатьиПо40.Добавить(Перечисления.СтатьяФрахта.Фрахт40);
	
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 30.07.2025 (( Добавиль условие по единице измрения
	ЕдинизаИзмеренияTEU = Ложь;
	Если Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.teu") Тогда
		ЕдинизаИзмеренияTEU = Истина;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
	
	Для Каждого Стр Из Объект.НФ_Линии Цикл
		ПерваяСтрЛинии = Истина;
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
		Если Объект.НФ_ПортыОтгрузкиВыгрузки.Количество() > 0 Тогда
			Для Каждого Строка Из Объект.НФ_ПортыОтгрузкиВыгрузки Цикл
				ПерваяСтрокаПорта = Истина;
				// Евросиб Рыбьяков К.А. 06.09.2024 ))
				Для Каждого Перечисл Из Перечисления.СтатьяФрахта Цикл
					
					Если ТарифицируемыйРазмерКТК = "20" И СтатьиПо40.Найти(Перечисл) <> неопределено 
						ИЛИ ТарифицируемыйРазмерКТК = "40" И СтатьиПо20.Найти(Перечисл) <> неопределено 
						// Евросиб US 115279 TA 115468 Рыбьяков К.А. 31.07.2025 ((
						ИЛИ ЕдинизаИзмеренияTEU И СтатьиПо40.Найти(Перечисл) <> неопределено
						// Евросиб Рыбьяков К.А. 31.07.2025 ))
						// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
						//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Погрузка //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
						//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Выгрузка //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
						//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Валюта //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
						Тогда 
						// Евросиб Рыбьяков К.А. 09.09.2024 ))
						Продолжить; 
					КонецЕсли;
					
					НовСтр = НФ_ЛинииПорты.Добавить();
					Если ПерваяСтрЛинии = Истина Тогда
						НовСтр.ПерваяСтрокаЛинии = Истина;
						ПерваяСтрЛинии = Ложь;
					КонецЕсли;
					// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
					Если ПерваяСтрокаПорта = Истина Тогда
						НовСтр.ПерваяСтрокаПорта = Истина;
						ПерваяСтрокаПорта = Ложь;
					КонецЕсли;
					НовСтр.Порт = Строка.Порт;
					// Евросиб Рыбьяков К.А. 06.09.2024 ))
					НовСтр.Контрагент = Стр.Линия;
					НовСтр.Статья = Перечисл;
				КонецЦикла;
			КонецЦикла;
		Иначе
			// Евросиб Рыбьяков К.А. 06.09.2024 ))
			Для Каждого Перечисл Из Перечисления.СтатьяФрахта Цикл
				Если ТарифицируемыйРазмерКТК = "20" И СтатьиПо40.Найти(Перечисл) <> неопределено 
					ИЛИ ТарифицируемыйРазмерКТК = "40" И СтатьиПо20.Найти(Перечисл) <> неопределено 
					// Евросиб US 115279 TA 115468 Рыбьяков К.А. 31.07.2025 ((
					ИЛИ ЕдинизаИзмеренияTEU И СтатьиПо40.Найти(Перечисл) <> неопределено
					// Евросиб Рыбьяков К.А. 31.07.2025 ))
					// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
					//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Погрузка //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
					//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Выгрузка //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
					//ИЛИ Перечисл = Перечисления.СтатьяФрахта.Валюта //Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, закомментировал
					Тогда 
					// Евросиб Рыбьяков К.А. 09.09.2024 ))
					Продолжить; 
				КонецЕсли;
				НовСтр = НФ_ЛинииПорты.Добавить();
				Если ПерваяСтрЛинии = Истина Тогда
					НовСтр.ПерваяСтрокаЛинии = Истина;
					ПерваяСтрЛинии = Ложь;
				КонецЕсли;
				НовСтр.Контрагент = Стр.Линия;
				НовСтр.Статья = Перечисл;
			КонецЦикла;
			// Евросиб Рыбьяков К.А. 06.09.2024 ))
		КонецЕсли;
	КонецЦикла;
	
	//Для Каждого Стр Из Объект.НФ_Линии Цикл
	//	ПерваяСтрЛинии = Истина;
	//	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
	//	Для Каждого Строка Из Объект.НФ_ПортыОтгрузкиВыгрузки Цикл
	//	ПерваяСтрокаПорта = Истина;
	//	// Евросиб Рыбьяков К.А. 06.09.2024 ))
	//		Для Каждого Перечисл Из Перечисления.СтатьяФрахта Цикл
	//			
	//			Если ТарифицируемыйРазмерКТК = "20" И СтатьиПо40.Найти(Перечисл) <> неопределено 
	//				ИЛИ ТарифицируемыйРазмерКТК = "40" И СтатьиПо20.Найти(Перечисл) <> неопределено 
	//				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
	//				ИЛИ Перечисл = Перечисления.СтатьяФрахта.Погрузка 
	//				ИЛИ Перечисл = Перечисления.СтатьяФрахта.Выгрузка 
	//				ИЛИ Перечисл = Перечисления.СтатьяФрахта.Валюта Тогда 
	//				// Евросиб Рыбьяков К.А. 09.09.2024 ))
	//				Продолжить; 
	//			КонецЕсли;
	//			
	//			НовСтр = НФ_ЛинииПорты.Добавить();
	//			Если ПерваяСтрЛинии = Истина Тогда
	//				НовСтр.ПерваяСтрокаЛинии = Истина;
	//				ПерваяСтрЛинии = Ложь;
	//			КонецЕсли;
	//			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
	//			Если ПерваяСтрокаПорта = Истина Тогда
	//				НовСтр.ПерваяСтрокаПорта = Истина;
	//				ПерваяСтрокаПорта = Ложь;
	//			КонецЕсли;
	//			НовСтр.Порт = Строка.Порт;
	//			// Евросиб Рыбьяков К.А. 06.09.2024 ))
	//			НовСтр.Контрагент = Стр.Линия;
	//			НовСтр.Статья = Перечисл;
	//			
	//		КонецЦикла;
	//	КонецЦикла;
	//	// Евросиб Рыбьяков К.А. 06.09.2024 ))
	//КонецЦикла;
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
	//ВалUSD = Справочники.Валюты.НайтиПоНаименованию("USD");
	//Для каждого Стр из НФ_ЛинииПорты Цикл
	//	Если Стр.Статья = Перечисления.СтатьяФрахта.Валюта Тогда
	//		
	//		Для каждого СтрИмяКол из МассивРеквизитов Цикл
	//			Если СтрНачинаетсяС(СтрИмяКол.Имя, "НФ_ИмяПорта_SOC") ИЛИ СтрНачинаетсяС(СтрИмяКол.Имя, "НФ_ИмяПорта_COC") Тогда
	//				Стр[СтрИмяКол.Имя] = ВалUSD;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//КонецЦикла;
	// Евросиб Рыбьяков К.А. 06.09.2024 ))
	
	////////////////////////////////////////
	
	// 2. добавляем подвал таблицы в зависимости от выбранного тарифицируемого размера
	Если (НЕ ДанныеИзТарифа И Объект.НФ_ВыбранныеСтавки.Количество()>0) ИЛИ
		(ДанныеИзТарифа И НФ_ЛинииПорты.Количество()>0) Тогда
		Если Объект.ТарифицируемыйРазмерКТК = "20" ИЛИ Объект.ТарифицируемыйРазмерКТК = "2040" Тогда
			НовСтр = НФ_ЛинииПорты.Добавить();
			// добавляем НовСтр.ПерваяСтрокаЛинии = Истина, т.к. в условном оформлении на этот признак срабатывает очистка текста
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Минимум 20'";
			НовСтр = НФ_ЛинииПорты.Добавить();
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Среднее 20'";
			НовСтр = НФ_ЛинииПорты.Добавить();
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Максимум 20'";
		КонецЕсли;
		Если Объект.ТарифицируемыйРазмерКТК = "40" ИЛИ Объект.ТарифицируемыйРазмерКТК = "2040" Тогда
			НовСтр = НФ_ЛинииПорты.Добавить();
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Минимум 40'";
			НовСтр = НФ_ЛинииПорты.Добавить();
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Среднее 40'";
			НовСтр = НФ_ЛинииПорты.Добавить();
			НовСтр.ПерваяСтрокаЛинии = Истина;
			НовСтр.Контрагент = "Максимум 40'";
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеТблНФ();
	
	////////////////////////////////////////////////
	Если ДанныеИзТарифа Тогда
		// 3.,4.
		ЗаполнитьТаблицуТарифами();
	Иначе
		ЗаполнитьТаблицуСохраненнымиДанными();
	КонецЕсли;
	////////////////////////////////////////////
	
	///////////////////////////////////////////
	// 5. заполнение подвала суммами
	РасчетПодвалаФрахта();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТблНФ()
 
	//УсловноеОформление.Элементы.Очистить();
	
	КолонкиТЗ = НФ_ЛинииПорты.Выгрузить().Колонки;
	
	Для Каждого Кол Из КолонкиТЗ Цикл
		
		// показываем флажок для тех строк, у которых можно его установить (прячем строку)
		
		Если НЕ СтрНайти(Кол.Имя,"Выбрано") = 0 Тогда
		
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);

			ГруппаОтбора1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Минимум 20";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Среднее 20";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Максимум 20";
			
			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Минимум 40";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Среднее 40";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
			ОтборЭлемента.ПравоеЗначение = "Максимум 40";
			
			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Валюта;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Погрузка;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Выгрузка;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);
			ПолеОформления.Использование = Истина;
			
		КонецЕсли;
			//////
			
		Если НЕ СтрНайти(Кол.Имя,"Флажок") = 0 Тогда
			
			// прячем флажок и показываем строку
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);

			ГруппаОтбора1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Минимум 20";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Среднее 20";
			
			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Максимум 20";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Минимум 40";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Среднее 40";
			
			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Контрагент");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			ОтборЭлемента.ПравоеЗначение = "Максимум 40";

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Валюта;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Погрузка;

			ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты.Статья");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Перечисления.СтатьяФрахта.Выгрузка;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);
			ПолеОформления.Использование = Истина;
			
			//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
			//ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(СтрЗаменить(Кол.Имя,"Флажок","Выбрано"));
			//ПолеОформления.Использование = Истина;
			
			// подсветка выделенных областей
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НФ_ЛинииПорты."+Кол.Имя);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Истина;
			ЭлементОтбора.Использование = Истина;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
			ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);
			ПолеОформления.Использование = Истина;
			ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(СтрЗаменить(Кол.Имя,"_Флажок",""));
			ПолеОформления.Использование = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуСохраненнымиДанными()
	
	//Евросиб - АСуслов 07.04.2022 19:22:17 #42899
	//(
	// 3. получить ставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент КАК Поставщик,
	|	КалькуляцияНФ_ВыбранныеСтавки.Статья КАК Статья,
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт20 КАК Фрахт20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20 КАК Вознаграждение20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт40 КАК Фрахт40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40 КАК Вознаграждение40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Погрузка КАК Погрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Выгрузка КАК Выгрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
	|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC КАК SOCCOC,
	|	КалькуляцияНФ_ВыбранныеСтавки.Выбрано20 КАК Выбрано20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Выбрано40 КАК Выбрано40,
	|	КалькуляцияНФ_ВыбранныеСтавки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	КалькуляцияНФ_ВыбранныеСтавки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
	|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки КАК ПортВыгрузкиОтгрузки
	// Евросиб Рыбьяков К.А. 11.09.2024 ))
	|ПОМЕСТИТЬ TS1
	|ИЗ
	|	Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	TS1.Поставщик КАК Поставщик,
	|	TS1.Статья КАК Статья,
	|	TS1.Фрахт20 КАК Фрахт20,
	|	TS1.Вознаграждение20 КАК Вознаграждение20,
	|	TS1.Итого20 КАК Итого20,
	|	TS1.Фрахт40 КАК Фрахт40,
	|	TS1.Вознаграждение40 КАК Вознаграждение40,
	|	TS1.Итого40 КАК Итого40,
	|	TS1.Валюта КАК Валюта,
	|	TS1.Погрузка КАК Погрузка,
	|	TS1.Выгрузка КАК Выгрузка,
	|	TS1.Порт КАК Порт,
	|	TS1.SOCCOC КАК SOCCOC,
	|	TS1.Выбрано20 КАК Выбрано20,
	|	TS1.Выбрано40 КАК Выбрано40,
	|	TS1.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	TS1.ИдентификаторСтроки КАК ИдентификаторСтроки,
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
	|	TS1.ПортВыгрузкиОтгрузки КАК ПортВыгрузкиОтгрузки
	// Евросиб Рыбьяков К.А. 11.09.2024 ))
	|ИЗ
	|	TS1 КАК TS1
	|ИТОГИ ПО
	|	Поставщик";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Калькуляция.НФ_ВыбранныеСтавки", "&НФ_ВыбранныеСтавки");
	//)
	//Евросиб - АСуслов 07.04.2022 19:22:28 #42899
	
	Запрос.УстановитьПараметр("НФ_ВыбранныеСтавки",Объект.НФ_ВыбранныеСтавки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоставщик = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоставщик.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаПоставщик.Выбрать();
	
		// 4. ЗАПОЛНЕНИЕ ТАБЛИЦЫ СУММАМИ
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// ищем нужного контрагента
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Контрагент",ВыборкаПоставщик.Поставщик);
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 11.09.2024 ((
			ПараметрыОтбора.Вставить("Порт", ВыборкаДетальныеЗаписи.ПортВыгрузкиОтгрузки);
			// Евросиб Рыбьяков К.А. 11.09.2024 ))
			НайденныеСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			
			ВБлокеВыбрано = Ложь;
			Для Каждого НС Из НайденныеСтр Цикл
				
				КодПорта = СокрЛП(ВыборкаДетальныеЗаписи.Порт.Код);
				
				СобственностьПеревозимогоКТК = ВыборкаДетальныеЗаписи.SOCCOC;
				НаименованиеКолонки = "НФ_ИмяПорта_" + СобственностьПеревозимогоКТК + "_" + КодПорта;
				НаименованиеКолонкиВыбрано = "НФ_ИмяПорта_Выбрано_" + СобственностьПеревозимогоКТК + "_" + КодПорта;
				НаименованиеКолонкиФлажок = "НФ_ИмяПорта_Флажок_" + СобственностьПеревозимогоКТК + "_" + КодПорта;

				ТекСтатья = СтрЗаменить(НС.Статья," ","");
				ТекСтатья = СтрЗаменить(ТекСтатья,"'","");
				
				Если НС.Свойство(НаименованиеКолонки) Тогда
					
					НС[НаименованиеКолонки] = ВыборкаДетальныеЗаписи[ТекСтатья];
					Если НЕ СтрНайти(ТекСтатья,"20") = 0 Тогда
						НС[НаименованиеКолонкиВыбрано] = ВыборкаДетальныеЗаписи.Выбрано20;
						НС[НаименованиеКолонкиФлажок] = ВыборкаДетальныеЗаписи.Выбрано20;
						ВБлокеВыбрано = ?(ВыборкаДетальныеЗаписи.Выбрано20,Истина,ВБлокеВыбрано);
					ИначеЕсли НЕ СтрНайти(ТекСтатья,"40") = 0 Тогда
						НС[НаименованиеКолонкиВыбрано] = ВыборкаДетальныеЗаписи.Выбрано40;
						НС[НаименованиеКолонкиФлажок] = ВыборкаДетальныеЗаписи.Выбрано40;
						ВБлокеВыбрано = ?(ВыборкаДетальныеЗаписи.Выбрано40,Истина,ВБлокеВыбрано);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТарифами()
	
	// 3. получить ставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыПоставщиков.Валюта КАК Валюта,
		|	ТарифыПоставщиков.Ссылка КАК ТекТариф,
		|	ТарифыПоставщиков.ПунктОтправленияУсловия КАК ПунктОтправленияУсловия,
		|	ТарифыПоставщиков.ПунктНазначенияУсловия КАК ПунктНазначенияУсловия,
		|	МорскиеЛинии.Ссылка КАК Поставщик,
		|	ТарифыПоставщиков.ПунктОтправления КАК ПунктОтправления,
		|	ТарифыПоставщиков.ПунктНазначения КАК ПунктНазначения,
		|	ТарифыПоставщиковРазмерыКТК.РазмерКТК КАК РазмерКТК,
		|	ВЫБОР
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//|		КОГДА ТарифыПоставщиков.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.COC)
		//ок)
		|		КОГДА ТарифыПоставщиков.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		|			ТОГДА ""COC""
		|		ИНАЧЕ ""SOC""
		|	КОНЕЦ КАК СобственностьПеревозимогоКТК
		|ИЗ
		|	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифыПоставщиков.РазмерыКТК КАК ТарифыПоставщиковРазмерыКТК
		|		ПО (ТарифыПоставщиковРазмерыКТК.Ссылка = ТарифыПоставщиков.Ссылка)
		|			И (ТарифыПоставщиковРазмерыКТК.РазмерКТК В (&РазмерКТК))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МорскиеЛинии КАК МорскиеЛинии
		|		ПО ТарифыПоставщиков.Поставщик = МорскиеЛинии.Контрагент
		|ГДЕ
		|	ТарифыПоставщиков.ПунктОтправления В(&ПунктОтправления)
		|	И ТарифыПоставщиков.ПунктНазначения В(&ПунктНазначения)
		|	И ТарифыПоставщиков.Организация = &Организация
		|	И ТарифыПоставщиков.Поставщик В(&Поставщик)
		|	И &ДействиеТарифа МЕЖДУ ТарифыПоставщиков.НачалоДействия И ТарифыПоставщиков.ОкончаниеДействия
		|	И ВЫБОР
		|			КОГДА &Груженый
		|				ТОГДА ТарифыПоставщиков.ДляГруженых
		|			ИНАЧЕ ТарифыПоставщиков.ДляПорожних
		|		КОНЕЦ
		|	И ТарифыПоставщиков.Услуга = &Услуга
		|	И (ТарифыПоставщиков.ПунктОтправленияУсловия = &ПунктОтправленияУсловия
		|			ИЛИ &ПунктОтправленияУсловия = ЗНАЧЕНИЕ(Перечисление.УсловияПеревозкиПоПортам.ПустаяСсылка))
		|	И (ТарифыПоставщиков.ПунктНазначенияУсловия = &ПунктНазначенияУсловия
		|			ИЛИ ЗНАЧЕНИЕ(Перечисление.УсловияПеревозкиПоПортам.ПустаяСсылка) = &ПунктНазначенияУсловия)
		|ИТОГИ ПО
		|	Поставщик";
	
	Если Объект.ФрахтИмпорт Тогда
		Запрос.УстановитьПараметр("ПунктОтправления",Объект.НФ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт"));
		// Евросиб US 87896 TA 91708 Рыбьяков К.А. 16.09.2024 ((
		Запрос.УстановитьПараметр("ПунктНазначения", Объект.ММ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт"));
		//Запрос.УстановитьПараметр("ПунктНазначения",Объект.ММ_ПортОтправления);
	Иначе
		Запрос.УстановитьПараметр("ПунктОтправления", Объект.ММ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт"));
		//Запрос.УстановитьПараметр("ПунктОтправления",Объект.ММ_ПортОтправления);
		// Евросиб Рыбьяков К.А. 16.09.2024 ))
		Запрос.УстановитьПараметр("ПунктНазначения",Объект.НФ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	МассивЛиний = Новый Массив;
	Для Каждого СтрЛ Из Объект.НФ_Линии Цикл
		МассивЛиний.Добавить(СтрЛ.Линия.Контрагент);
	КонецЦикла;
	Запрос.УстановитьПараметр("ПунктОтправленияУсловия",Объект.Море_УсловияПогрузки);
	Запрос.УстановитьПараметр("ПунктНазначенияУсловия",Объект.Море_УсловияВыгрузки);
	Запрос.УстановитьПараметр("Поставщик",МассивЛиний);
	Запрос.УстановитьПараметр("ДействиеТарифа",Объект.ММ_ДействиеСтавокНа);
	Запрос.УстановитьПараметр("Груженый",Объект.ММ_ГруженыйПоМорю);
	Запрос.УстановитьПараметр("Услуга", УслугаФрахтаДляКалькуляции);
	МассивРазмеровКТК = Новый Массив;
	Если ТарифицируемыйРазмерКТК = "20" ИЛИ
		ТарифицируемыйРазмерКТК = "2040" Тогда
		МассивРазмеровКТК.Добавить(Справочники.РазмерыКТК.К20);
	КонецЕсли;
	Если ТарифицируемыйРазмерКТК = "40" ИЛИ
		ТарифицируемыйРазмерКТК = "2040" Тогда
		МассивРазмеровКТК.Добавить(Справочники.РазмерыКТК.К40);
	КонецЕсли;
	Запрос.УстановитьПараметр("РазмерКТК",МассивРазмеровКТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоставщик = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоставщик.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаПоставщик.Выбрать();
	
		// 4. ЗАПОЛНЕНИЕ ТАБЛИЦЫ СУММАМИ
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// ищем нужного контрагента
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Контрагент",ВыборкаПоставщик.Поставщик);
			НайденныеСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			
			Для Каждого НС Из НайденныеСтр Цикл
				
				Если Объект.ФрахтИмпорт Тогда
					КодПорта = СокрЛП(ВыборкаДетальныеЗаписи.ПунктОтправления.Код);
				Иначе
					КодПорта = СокрЛП(ВыборкаДетальныеЗаписи.ПунктНазначения.Код);
				КонецЕсли;
				СобственностьПеревозимогоКТК = ВыборкаДетальныеЗаписи.СобственностьПеревозимогоКТК;
				НаименованиеКолонки = "НФ_ИмяПорта_" + СобственностьПеревозимогоКТК + "_" + КодПорта;
				
				Если (ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20 И
					(Объект.ТарифицируемыйРазмерКТК = "20" ИЛИ Объект.ТарифицируемыйРазмерКТК = "2040") И
					(НС.Статья = Перечисления.СтатьяФрахта.Фрахт20 ИЛИ НС.Статья = Перечисления.СтатьяФрахта.Итого20)) ИЛИ
					
					(ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К40 И
					(Объект.ТарифицируемыйРазмерКТК = "40" ИЛИ Объект.ТарифицируемыйРазмерКТК = "2040")  И
					(НС.Статья = Перечисления.СтатьяФрахта.Фрахт40 ИЛИ НС.Статья = Перечисления.СтатьяФрахта.Итого40)) Тогда
					
					
					НС[НаименованиеКолонки] = Тарификатор_сервер.ВычислитьСтоимостьПоТарифуДляОперации(Новый Структура,ВыборкаДетальныеЗаписи.ТекТариф);
					
				ИначеЕсли НС.Статья = Перечисления.СтатьяФрахта.Валюта Тогда
					
					НС[НаименованиеКолонки] = ВыборкаДетальныеЗаписи.Валюта;
				
				ИначеЕсли НС.Статья = Перечисления.СтатьяФрахта.Погрузка Тогда
					
					НС[НаименованиеКолонки] = ВыборкаДетальныеЗаписи.ПунктОтправленияУсловия;
				
				ИначеЕсли НС.Статья = Перечисления.СтатьяФрахта.Выгрузка Тогда
					
					НС[НаименованиеКолонки] = ВыборкаДетальныеЗаписи.ПунктНазначенияУсловия;
					
				КонецЕсли;
					
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасчетПодвалаФрахта()
	
	КолонкиТЗ = НФ_ЛинииПорты.Выгрузить().Колонки;
	
	//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
		СуммаДельта20 = 0;
		СуммаДельта40 = 0;	
	//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
	
	Для Каждого Кол Из КолонкиТЗ Цикл
		
		Минимально20 = 999999999999999.999;
		Минимально40 = 999999999999999.999;
		Максимально20 = 0;
		Максимально40 = 0;
		Колво20 = 0;
		Колво40 = 0;
		//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
			Дельта20 = 0;
			Дельта40 = 0;	
		//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
		
		Если (НЕ СтрНайти(Кол.Имя,"SOC") = 0 ИЛИ НЕ СтрНайти(Кол.Имя,"COC") = 0) И 
			СтрНайти(Кол.Имя,"Выбрано") = 0 И
			СтрНайти(Кол.Имя,"Флажок") = 0 Тогда
			ТекКолонка = Кол.Имя;
			Для Каждого СтрТз Из НФ_ЛинииПорты Цикл
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Фрахт20 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Минимально20 = Мин(Минимально20,СтрТз[ТекКолонка]);
					Максимально20 = Макс(Максимально20,СтрТз[ТекКолонка]);
					Колво20 = Колво20 + 1;
				КонецЕсли;
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Фрахт40 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Минимально40 = Мин(Минимально40,СтрТз[ТекКолонка]);
					Максимально40 = Макс(Максимально40,СтрТз[ТекКолонка]);
					Колво40 = Колво40 + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = новый Структура;
		
		// 20футовые
		Если Колво20>0 Тогда
			ПараметрыОтбора.Вставить("Контрагент","Минимум 20'");
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
			//ПараметрыОтбора.Вставить("Порт", "Минимум 20'");
			// Евросиб Рыбьяков К.А. 09.09.2024 ))
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				НайдСтр[0][ТекКолонка] = Минимально20;
			КонецЕсли;
			
			ПараметрыОтбора.Вставить("Контрагент","Среднее 20'");
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				Если Колво20>1 Тогда
					Дельта20 = (Максимально20 - Минимально20);
				Иначе
					Дельта20 = Макс(Максимально20, Минимально20);
				КонецЕсли;
				НайдСтр[0][ТекКолонка] = Окр(Дельта20/Колво20,3);
			КонецЕсли;
		
			ПараметрыОтбора.Вставить("Контрагент","Максимум 20'");
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				НайдСтр[0][ТекКолонка] = Максимально20;
			КонецЕсли;
		КонецЕсли;
		
		// 40футовые
		Если Колво40>0 Тогда
			ПараметрыОтбора.Вставить("Контрагент","Минимум 40'");
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				НайдСтр[0][ТекКолонка] = Минимально40;
			КонецЕсли;
		
			ПараметрыОтбора.Вставить("Контрагент","Среднее 40'");
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				Если Колво40>1 Тогда
					Дельта40 = (Максимально40 - Минимально40);
				Иначе
					Дельта40 = Макс(Максимально40, Минимально40);
				КонецЕсли;
				НайдСтр[0][ТекКолонка] = Окр(Дельта40/Колво40,3);
			КонецЕсли;
		
			ПараметрыОтбора.Вставить("Контрагент","Максимум 40'");
			НайдСтр = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтр.Количество()>0 Тогда
				НайдСтр[0][ТекКолонка] = Максимально40;
			КонецЕсли;
		КонецЕсли;
		
		//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
		//Евросиб Коханенко Н.А. 02.10.2023 (( #75712
		//Если Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() И ЭтоМежсервисныеРасходы() Тогда
		Если КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) И ЭтоМежсервисныеРасходы() Тогда
		//Евросиб Коханенко Н.А. 02.10.2023 )) #75712	
			СуммаДельта20 = СуммаДельта20 + Дельта20;
			СуммаДельта40 = СуммаДельта40 + Дельта40;	
		КонецЕсли;
		//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеВПортуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//ТекД = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	//Если ТекД = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Элемент.ВыбиратьТип = Ложь;
	//Если НЕ СтрНайти(Строка(ТекД.Статья),Строка("20")) = 0 ИЛИ
	//	НЕ СтрНайти(Строка(ТекД.Статья),Строка("40")) = 0 Тогда
	//	Элемент.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3));
	//ИначеЕсли НЕ СтрНайти(Строка(ТекД.Статья),Строка("Валюта")) = 0 Тогда
	//	Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Валюты");
	//	Элемент.КнопкаВыбора = Истина;
	//ИначеЕсли НЕ СтрНайти(Строка(ТекД.Статья),Строка("Погрузка")) = 0 ИЛИ
	//	НЕ СтрНайти(Строка(ТекД.Статья),Строка("Выгрузка")) = 0 Тогда
	//	Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.УсловияПеревозкиПоПортам");
	//	Элемент.КнопкаВыбора = Истина;
	//	Элемент.БыстрыйВыбор = Истина;
	//	Элемент.КнопкаСпискаВыбора = Истина;
	//	Элемент.ИсторияВыбораПриВводе = Истина;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтарыеЭлементы()
	
	Для каждого ЭлементФ Из СписокЭФ Цикл
		Попытка
			Элементы.Удалить(Элементы.Найти(ЭлементФ.ТекЭлемент));
		Исключение
		КонецПопытки;
	КонецЦикла;
	СписокЭФ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НФ_ЛинииПортыПриАктивизацииЯчейки(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"SOC") = 0 ИЛИ 
		НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"COC") = 0) И
		СтрНайти(Элемент.ТекущийЭлемент.Имя,"Выбрано") = 0 И
		СтрНайти(Элемент.ТекущийЭлемент.Имя,"Флажок") = 0 Тогда	
		//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, начало
		Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Ложь;
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, конец
		Если НЕ СтрНайти(Строка(ТекД.Статья),Строка("20")) = 0 ИЛИ
			НЕ СтрНайти(Строка(ТекД.Статья),Строка("40")) = 0 Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3));
		ИначеЕсли НЕ СтрНайти(Строка(ТекД.Статья),Строка("Валюта")) = 0 Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Валюты");
			//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, начало
			Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Истина;
			Элемент.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(ОсновныеВалюты.ВыгрузитьЗначения());
			//ДИТ, Беляев СЮ, US 85745 / TA 85764, 24-05-2024, конец
		ИначеЕсли НЕ СтрНайти(Строка(ТекД.Статья),Строка("Погрузка")) = 0 ИЛИ
			НЕ СтрНайти(Строка(ТекД.Статья),Строка("Выгрузка")) = 0 Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.УсловияПеревозкиПоПортам");
		КонецЕсли;
	//ИначеЕсли (НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"SOC") = 0 ИЛИ 
	//	НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"COC") = 0) И
	//	НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"Выбрано") = 0 Тогда	
	//	Если НЕ СтрНайти(Строка(ТекД.Статья),Строка("Минимум")) = 0 ИЛИ
	//		НЕ СтрНайти(Строка(ТекД.Статья),Строка("Среднее")) = 0 ИЛИ
	//		НЕ СтрНайти(Строка(ТекД.Статья),Строка("Максимум")) = 0 Тогда
	//		//Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
	//		Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
	//		Элемент.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	Иначе
	//		//Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
	//		Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Булево");
	//		Элемент.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	//	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НФ_ЛинииПортыПриИзменении(Элемент)
	
	ТекД = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// изменения на флаги ВЫБРАНО
	Если НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя, "Флажок") = 0 Тогда
		
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
		КодПорта = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "_", Символы.ПС);
		КодПорта = СтрПолучитьСтроку(КодПорта, СтрЧислоСтрок(КодПорта));
		
		Если СтрНайти(Элемент.ТекущийЭлемент.Имя, "SOC") Тогда
			КодПоиска = "НФ_ИмяПорта_Выбрано_SOC_" + КодПорта;
		Иначе
			КодПоиска = "НФ_ИмяПорта_Выбрано_COC_" + КодПорта;
		КонецЕсли;
		
		ОбновитьФлажкиСтавок(КодПоиска);
		// Евросиб Рыбьяков К.А. 09.09.2024 ))
		
		//ТекКолонка = Элемент.ТекущийЭлемент.Имя;
		//ТекКолонкаВыбрано = СтрЗаменить(Элемент.ТекущийЭлемент.Имя,"Флажок","Выбрано");
		//
		//РазмерностьКТК = ?(СтрНайти(ТекД.Статья,"20") = 0, Строка("40"), Строка("20"));
		//
		//Если ТекД[ТекКолонка] = Ложь Тогда
		//	ТекД[ТекКолонкаВыбрано] = Ложь;
		//	// снять галки у группы данной ставки (у ставки, вознаграждения, итого)
		//	ПараметрыОтбора = Новый Структура;
		//	ПараметрыОтбора.Вставить("Контрагент",ТекД.Контрагент);
		//	НайденныеСтроки = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
		//	
		//	// если для данного контрагента галками отмечено несколько размеров КТК, то подвал блока (где валюта, погрузка, выгрузка)
		//	// обнулять не нужно.
		//	//ЕстьДругойРазмерКТК = Ложь;
		//	Для Каждого Стр Из НайденныеСтроки Цикл
		//		Если НЕ СтрНайти(Стр.Статья,РазмерностьКТК) = 0 Тогда
		//			Стр[ТекКолонка] = Ложь;
		//			Стр[ТекКолонкаВыбрано] = Ложь;
		//		//ИначеЕсли СтрНайти(Стр.Статья,РазмерностьКТК) = 0 И
		//		//	СтрНайти(Стр.Статья,Строка("Погрузка")) = 0 И
		//		//	СтрНайти(Строка(Стр.Статья),Строка("Выгрузка")) = 0 И
		//		//	СтрНайти(Строка(Стр.Статья),Строка("Валюта")) = 0 И
		//		//	Стр[ТекКолонка] = Истина Тогда
		//		//	ЕстьДругойРазмерКТК = Истина;
		//		КонецЕсли;
		//	КонецЦикла;
		//	//Если НЕ ЕстьДругойРазмерКТК Тогда
		//	//	Для Каждого Стр Из НайденныеСтроки Цикл
		//	//		Если НЕ СтрНайти(Стр.Статья,Строка("Погрузка")) = 0 ИЛИ
		//	//		НЕ СтрНайти(Строка(Стр.Статья),Строка("Выгрузка")) = 0 ИЛИ
		//	//		НЕ СтрНайти(Строка(Стр.Статья),Строка("Валюта")) = 0 Тогда
		//	//			Стр[ТекКолонка] = Ложь;
		//	//			Стр[ТекКолонкаВыбрано] = Ложь;
		//	//		КонецЕсли;
		//	//	КонецЦикла;
		//	//КонецЕсли;
		//	Возврат;
		//КонецЕсли;
		//
		//Для Каждого Стр Из НФ_ЛинииПорты Цикл
		//	// 1. установить галки у группы данной ставки (у ставки, вознаграждения, итого)
		//	Если Стр.Контрагент = ТекД.Контрагент Тогда 
		//		Если НЕ СтрНайти(Стр.Статья,РазмерностьКТК) = 0 Тогда
		//			//НЕ СтрНайти(Стр.Статья,Строка("Погрузка")) = 0 ИЛИ
		//			//НЕ СтрНайти(Строка(Стр.Статья),Строка("Выгрузка")) = 0 ИЛИ
		//			//НЕ СтрНайти(Строка(Стр.Статья),Строка("Валюта")) = 0 Тогда
		//			Стр[ТекКолонка] = Истина;
		//			Стр[ТекКолонкаВыбрано] = Истина;
		//		КонецЕсли;
		//	// 2. если устанавливается флаг, то снять его у всех других ячеек в этом столбце (только по тем, гд есть суммы)
		//	ИначеЕсли НЕ Стр.Контрагент = ТекД.Контрагент И
		//		(НЕ СтрНайти(Стр.Статья,"20") = 0 ИЛИ НЕ СтрНайти(Стр.Статья,"40") = 0) Тогда
		//    	Стр[ТекКолонка] = Ложь;
		//    	Стр[ТекКолонкаВыбрано] = Ложь;
		//	КонецЕсли;
		//КонецЦикла;
		// Евросиб Рыбьяков К.А. 09.09.2024 ))
	КонецЕсли;
	
	
	// изменения на суммы
	Если (НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"SOC") = 0 ИЛИ НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"COC") = 0) И
		СтрНайти(Элемент.ТекущийЭлемент.Имя,"Выбрано") = 0  И
		СтрНайти(Элемент.ТекущийЭлемент.Имя,"Флажок") = 0 Тогда
		
		ТекКолонка = Элемент.ТекущийЭлемент.Имя;
		РазмерностьКТК = ?(СтрНайти(ТекД.Статья,"20") = 0, Строка("40"), Строка("20"));
		ТекЗначение = ТекД[ТекКолонка];
		ТекСтатья = ТекД.Статья;
		
		// 1. пересчет итого, если изменена ставка или вознаграждение
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Контрагент",ТекД.Контрагент);
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 09.09.2024 ((
		ПараметрыОтбора.Вставить("Порт", ТекД.Порт);
		// Евросиб Рыбьяков К.А. 09.09.2024 ))
		НайденныеСтроки = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
		
		ТекВознаграждениеЗначение = 0;
		ТекСтавкаЗначение = 0;
		ТекСтавка = Ложь;
		ТекВознаграждение = Ложь;
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			// если изменили ставку, то нужно пересчитать ИТОГО с учетом вознаграждения. "пробегаем" циклом в рамках
			// контрагента и находим вознаграждение. если нашли такую позицию (статью), то сохраняем значение в ТекВознаграждениеЗначение
			Если ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого20") И ТекВознаграждение = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение + ТекВознаграждениеЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20") И ТекВознаграждение = Ложь Тогда
					ТекВознаграждениеЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекВознаграждение = Истина;
				КонецЕсли;
			// если изменили вознаграждение, то нужно пересчитать ИТОГО с учетом ставки и вознаграждения. "пробегаем" циклом в рамках
			// контрагента и находим ставку. если нашли такую позицию (статью), то сохраняем значение в ТекСтавкаЗначение
			ИначеЕсли ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого20") И ТекСтавка = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение + ТекСтавкаЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20") И ТекСтавка = Ложь Тогда
					ТекСтавкаЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекСтавка = Истина;
				КонецЕсли; 
			// если изменили ИТОГО, то нужно пересчитать вознаграждение с учетом ставки и итого. "пробегаем" циклом в рамках
			// контрагента и находим ставку. если нашли такую позицию (статью), то сохраняем значение в ТекСтавкаЗначение
			ИначеЕсли ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого20") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20") И ТекСтавка = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение - ТекСтавкаЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20") И ТекСтавка = Ложь Тогда
					ТекСтавкаЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекСтавка = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			// АНАЛОГИЧНО ДЛЯ 40футовых. <<подумать как упростить>>
			
			// если изменили ставку, то нужно пересчитать ИТОГО с учетом вознаграждения. "пробегаем" циклом в рамках
			// контрагента и находим вознаграждение. если нашли такую позицию (статью), то сохраняем значение в ТекВознаграждениеЗначение
			Если ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт40") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого40") И ТекВознаграждение = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение + ТекВознаграждениеЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение40") И ТекВознаграждение = Ложь Тогда
					ТекВознаграждениеЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекВознаграждение = Истина;
				КонецЕсли;
			// если изменили вознаграждение, то нужно пересчитать ИТОГО с учетом ставки и вознаграждения. "пробегаем" циклом в рамках
			// контрагента и находим ставку. если нашли такую позицию (статью), то сохраняем значение в ТекСтавкаЗначение
			ИначеЕсли ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение40") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого40") И ТекСтавка = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение + ТекСтавкаЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт40") И ТекСтавка = Ложь Тогда
					ТекСтавкаЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекСтавка = Истина;
				КонецЕсли; 
			// если изменили ИТОГО, то нужно пересчитать вознаграждение с учетом ставки и итого. "пробегаем" циклом в рамках
			// контрагента и находим ставку. если нашли такую позицию (статью), то сохраняем значение в ТекСтавкаЗначение
			ИначеЕсли ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого40") Тогда
				Если Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение40") И ТекСтавка = Истина Тогда
					Стр[ТекКолонка] = ТекЗначение - ТекСтавкаЗначение;
				ИначеЕсли Стр.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт40") И ТекСтавка = Ложь Тогда
					ТекСтавкаЗначение = ?(ЗначениеЗаполнено(Стр[ТекКолонка]),Стр[ТекКолонка],0); 
					ТекСтавка = Истина;
				КонецЕсли;
			КонецЕсли;
			
			//Если ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Погрузка") ИЛИ ТекСтатья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Выгрузка") Тогда
			//	
			//	ПунктОтправления = "";
			//	ПунктНазначения = "";
			//	Если Объект.ФрахтИмпорт Тогда
			//		ПунктОтправления = Объект.НФ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт");
			//		ПунктНазначения = Объект.ММ_ПортОтправления;
			//	Иначе
			//		ПунктОтправления = Объект.ММ_ПортОтправления;
			//		ПунктНазначения = Объект.НФ_ПортыОтправленияНазначения.Выгрузить().ВыгрузитьКолонку("Порт");
			//	КонецЕсли;
			//	
			//	ПараметрыОтвета = ПолучитьСуммуТарифов(ТекД.Контрагент, ТекКолонка);
			//	а = 1;
			//	
			//КонецЕсли;
			
		КонецЦикла;
		
		// изменить подвал таблицы
	РасчетПодвалаФрахта();		

	//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
	//ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов);
	//ДИТ, Беляев СЮ, BUG 76379, 19-10-2023, начало
	ОбновитьИтоговыеПараметрыТаблиц(ВалютаИтогов, Истина,,Истина);
	//ДИТ, Беляев СЮ, BUG 76379, 19-10-2023, конец
	//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
	
	КонецЕсли;
					
		
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьСуммуТарифов(Контрагент, ИмяКолонки)
//	
//	Результат = Новый Структура("Ставка20, Ставка40");
//	
//	Возврат Результат;
//	
//КонецФункции

&НаКлиенте
Процедура НФ_ЛинииПортыПередНачаломИзменения(Элемент, Отказ)
	
	ТекД = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтрНайти(Элемент.ТекущийЭлемент.Имя,"Выбрано") = 0 И
		(НЕ СтрНайти(Строка(ТекД.Статья),Строка("Валюта")) = 0 ИЛИ
		НЕ СтрНайти(Строка(ТекД.Статья),Строка("Погрузка")) = 0 ИЛИ
		НЕ СтрНайти(Строка(ТекД.Статья),Строка("Выгрузка")) = 0 ИЛИ
		НЕ СтрНачинаетсяС(Строка(ТекД.Контрагент),Строка("Минимум")) = 0 ИЛИ
		НЕ СтрНачинаетсяС(Строка(ТекД.Контрагент),Строка("Максимум")) = 0 ИЛИ
		НЕ СтрНачинаетсяС(Строка(ТекД.Контрагент),Строка("Среднее")) = 0) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФрахтИмпортЭкспортПриИзменении(Элемент)
	Объект.ФрахтИмпорт = ?(ФрахтИмпортЭкспорт = 0,Истина,Ложь);
	
	Если Объект.ФрахтИмпорт Тогда
		Элементы.НФ_ПортОтправления.Заголовок = "Порт назначения";
		Элементы.НФ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт отправления";
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
		//Элементы.НФ_ПортыОтгрузкиВыгрузкиПорт.Заголовок = "Порт отгрузки";
		//Элементы.НФ_ЛинииПортыПортОтгрузкиВыгрузки.Заголовок = "Порт отгрузки";
		Элементы.ММ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт назначения";
		// Евросиб Рыбьяков К.А. 06.09.2024 ))
	Иначе
		Элементы.НФ_ПортОтправления.Заголовок = "Порт отправления";
		Элементы.НФ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт назначения";
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
		//Элементы.НФ_ПортыОтгрузкиВыгрузкиПорт.Заголовок = "Порт выгрузки";
		//Элементы.НФ_ЛинииПортыПортОтгрузкиВыгрузки.Заголовок = "Порт выгрузки";
		Элементы.ММ_ПортыОтправленияНазначенияПорт.Заголовок = "Порт отправления";
		// Евросиб Рыбьяков К.А. 06.09.2024 ))
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифицируемыйРазмерКТКПриИзменении(Элемент)
	Объект.ТарифицируемыйРазмерКТК = ТарифицируемыйРазмерКТК;
	ММ_ОбновитьСтоимостьПредоставленияВагона(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеТарифы(Команда)
	
	ТекД = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	КодПорта = Прав(Элементы.НФ_ЛинииПорты.ТекущийЭлемент.Имя, 9);
	ПортЪ = ПолучитьЛокациюПоКоду(КодПорта);
	
	Если Объект.ФрахтИмпорт Тогда
		ПунктОтправления = ПортЪ;
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
		ПунктНазначения = Новый Массив;
		Для Каждого Строка Из Объект.ММ_ПортыОтправленияНазначения Цикл
			ПунктНазначения.Добавить(Строка.Порт);
		КонецЦикла;
		//ПунктНазначения = Объект.ММ_ПортОтправления;
		// Евросиб Рыбьяков К.А. 18.09.2024 ))
	Иначе
		// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
		ПунктОтправления = Новый Массив;
		Для Каждого Строка Из Объект.ММ_ПортыОтправленияНазначения Цикл
			ПунктОтправления.Добавить(Строка.Порт);
		КонецЦикла;
		//ПунктОтправления = Объект.ММ_ПортОтправления;
		// Евросиб Рыбьяков К.А. 18.09.2024 ))
		ПунктНазначения = ПортЪ; 
	КонецЕсли;
	
	СтрНаправление = Новый Структура("Линия,ПунктОтправления,ПунктНазначения", ТекД.Контрагент, ПунктОтправления, ПунктНазначения);
	
	РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40");
	Если 
		ТекД.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20") ИЛИ
		ТекД.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого20") ИЛИ
		ТекД.Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20")
	Тогда
		РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20");
	КонецЕсли;
		
	
	СтруктураПараметров = Новый Массив;
	СтруктураПараметров.Добавить(Новый Структура("Направление, Услуга", СтрНаправление, УслугаФрахтаДляКалькуляции));
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораТарифов_пустая", ЭтаФорма);
	ОткрытьФорму("Документ.Калькуляция.Форма.ПодборТарифаКалькуляцией", Новый Структура("ПоискТарифов, ДатаПоиска, Груженый, Организация, РазмерКТК", СтруктураПараметров, Объект.ММ_ДействиеСтавокНа, Объект.ММ_ГруженыйПоМорю, Объект.Организация, РазмерКТК),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЛокациюПоКоду(КодЛокации)
	
	Возврат Справочники.Локации.НайтиПоКоду(КодЛокации);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораТарифов_пустая(П1 = неопределено, П2 = неопределено) Экспорт
	
	а = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальныеУсловияПриИзменении(Элемент)
	
	Если Не Объект.СпециальныеУсловия Тогда
		Объект.УсловияПримененияСтавки = "";
	КонецЕсли;
	Элементы.УсловияПримененияСтавки.Доступность = Объект.СпециальныеУсловия;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяУслугаПриИзменении(Элемент)
	//Заполним основной ЕИ
	//Евросиб Каблов 19.04.2021 ( Ticket#0227397
	//Объект.ЕдиницаИзмерения = ПолучитьРеквизитСсылкиНаСервере(ОсновнаяУслуга, "ЕдиницаИзмерения").ЕдиницаИзмерения;
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого")
		Или Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом") Тогда
		
		Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон");
	ИначеЕсли Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная") Тогда
		Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ктк");
	Иначе
		Объект.ЕдиницаИзмерения = ПолучитьРеквизитСсылкиНаСервере(Объект.ОсновнаяУслуга, "ЕдиницаИзмерения").ЕдиницаИзмерения;
	КонецЕсли;
	//Евросиб Каблов 19.04.2021 ) 
	
	//Заполним вариантами 
	
	Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Объект.ОсновнаяУслуга));
	
	ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения(); //Евросиб Шевченко А.В. US 117355 TA 121128 07.10.2025
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийВыбораЕИ(Номенклатура)
	//БИТ Белинский Д.А. 30.06.2023 -начало TASK 66201
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Если ЭтоМежсервисныеРасходы() И Объект.Контрагент = ДирекцияКонтейнерныхПеревозок() Тогда
	Если ЭтоМежсервисныеРасходы() И КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) Тогда
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения";
		РезультатЗапроса = Запрос.Выполнить();
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//БИТ Белинский Д.А. 30.06.2023 -конец TASK 66201
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураРазрешенныеЕИ.Элемент КАК Элемент
		|ИЗ
		|	Справочник.Номенклатура.РазрешенныеЕИ КАК НоменклатураРазрешенныеЕИ
		|ГДЕ
		|	НоменклатураРазрешенныеЕИ.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Элемент");
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПолныйЭкран(Команда)
	
	Если Элементы.ГруппаНовыйФрахтПраво.Поведение = ПоведениеОбычнойГруппы.Всплывающая Тогда
		Элементы.ГруппаНовыйФрахтПраво.Поведение = ПоведениеОбычнойГруппы.Обычное;
		Элементы.НФ_ЛинииПортыПолныйЭкран.Заголовок = "Переключить в режим полноэкранной работы";
		Элементы.ГруппаНовыйФрахтПраво.Заголовок = "2.2. Таблица ставок по фрахту";
	Иначе
		Элементы.ГруппаНовыйФрахтПраво.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
		Элементы.НФ_ЛинииПортыПолныйЭкран.Заголовок = "Переключить в режим работы из формы";
		Элементы.ГруппаНовыйФрахтПраво.ЗаголовокСвернутогоОтображения = "2.2. Таблица ставок по фрахту (нажмите, чтобы открыть)";
		Элементы.ГруппаНовыйФрахтПраво.Заголовок = "2.2. Таблица ставок по фрахту (нажмите, чтобы открыть)";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеSOCCOC(Команда)
	
	УстановитьДоступностьSOCCOC(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьSOCCOC(SOC, COC)
	
	Для каждого Стр из Элементы.НФ_ЛинииПорты.ПодчиненныеЭлементы Цикл
		
		Если СтрНайти(Стр.Имя, "SOC") > 0 Тогда Стр.Видимость = SOC; КонецЕсли;
		Если СтрНайти(Стр.Имя, "COC") > 0 Тогда Стр.Видимость = COC; КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеSOC(Команда)
	
	УстановитьДоступностьSOCCOC(Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеCOC(Команда)
	
	УстановитьДоступностьSOCCOC(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТСх(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	СкопироватьТСхНаСервере(Объект.КалькуляцияСозданаНаОсновании, Объект.Ссылка);
	Элементы.ГруппаКопированиеКалькуляций.Видимость = Ложь;
	ПоказатьПредупреждение(, "Копирование завершено!");
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьТСхНаСервере(ОбъектКалькуляцияСозданаНаОсновании, ОбъектСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	               |	ТехнологическаяСхема.Вариант КАК Вариант,
	               |	ТехнологическаяСхема.ТСх КАК ТСх
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх";
	Запрос.УстановитьПараметр("ПредметТСх", ОбъектКалькуляцияСозданаНаОсновании);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		КопияТСх = ПостроительТСх_сервер.СкопироватьТСх(Ответ.ТСх);
		
		МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
		МЗ.Вариант = Ответ.Вариант+"_"+Прав(КопияТСх.Код, 7);
		МЗ.ПредметТСх = ОбъектСсылка;
		МЗ.ТСх = КопияТСх;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПримечание20НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаПояснения", ЭтаФорма, Новый Структура("Поле", "Примечание20"));
	ПоказатьВводСтроки(ОпОп, Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные.Примечание20, "Примечение для 20' КТК", 1000, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаПояснения(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные[П2.Поле] = П1;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПримечание40НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаПояснения", ЭтаФорма, Новый Структура("Поле", "Примечание40"));
	ПоказатьВводСтроки(ОпОп, Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные.Примечание40, "Примечение для 40' КТК", 1000, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиОсновнаяУслугаГруппыПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекД.ГруппаУслуг) Тогда 
		ТекД.ОсновнаяУслугаГруппы = Ложь; 
	Иначе
		Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если Стр.ГруппаУслуг = ТекД.ГруппаУслуг И ТекД <> Стр Тогда Стр.ОсновнаяУслугаГруппы = Ложь; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиГруппаУслугПриИзменении(Элемент)
	
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекД.ГруппаУслуг) Тогда 
		ТекД.ОсновнаяУслугаГруппы = Ложь; 
	Иначе
		УстановитьОсновнуюУслугуГруппы(ТекД.ГруппаУслуг);
		
		СписокДоступныхКатегорий = Новый Соответствие;
		Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда 
				НайдСтр = СписокДоступныхКатегорий.Получить(Стр.ГруппаУслуг);
				Если НайдСтр <> неопределено Тогда
					СписокДоступныхКатегорий[Стр.ГруппаУслуг] = СписокДоступныхКатегорий[Стр.ГруппаУслуг] + ?(Стр.ОсновнаяУслугаГруппы, 1, 0);
				Иначе
					СписокДоступныхКатегорий.Вставить(Стр.ГруппаУслуг, ?(Стр.ОсновнаяУслугаГруппы, 1, 0));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Стр из СписокДоступныхКатегорий Цикл
			Если Стр.Значение = 0 Тогда УстановитьОсновнуюУслугуГруппы(Стр.Ключ); КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнуюУслугуГруппы(НомерГруппы)
	
	МаксСтрокаУслуги20 = неопределено;
	МаксСтрокаУслуги40 = неопределено;
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		Если Стр.ГруппаУслуг <> НомерГруппы Тогда Продолжить; КонецЕсли;
		Стр.ОсновнаяУслугаГруппы = Ложь;
		Если МаксСтрокаУслуги20 = неопределено ИЛИ МаксСтрокаУслуги20.Итого20 < Стр.Итого20 Тогда
			МаксСтрокаУслуги20 = Стр;
		КонецЕсли;
		Если МаксСтрокаУслуги40 = неопределено ИЛИ МаксСтрокаУслуги40.Итого40 < Стр.Итого40 Тогда
			МаксСтрокаУслуги40 = Стр;
		КонецЕсли;
	КонецЦикла;
	Если МаксСтрокаУслуги40 <> неопределено Тогда
		МаксСтрокаУслуги40.ОсновнаяУслугаГруппы = Истина;
	ИначеЕсли МаксСтрокаУслуги20 <> неопределено Тогда
		МаксСтрокаУслуги20.ОсновнаяУслугаГруппы = Истина;
	КонецЕсли;
	
КонецПроцедуры


//ДИТ Пак И.Т. Task34426 22.05.2021 Начало

&НаКлиенте
Процедура СброситьМаршрутизацию()
	Объект.ПримененныйМаршрут = Неопределено;
	//++ Зубов 03.08.2021 37315
	//Объект.КалькуляцияСозданаНаОсновании = Неопределено;
	//-- Зубов 03.08.2021 37315
КонецПроцедуры

&НаСервере
Функция НаличиеИзмененийВМеньшуюСторону(СравниваемаяСсылка, Подробности = "")
	
	РезультатПоиска = НайтиИзмененияВТЧ(СравниваемаяСсылка, Истина, Ложь, Истина);
	
	Если РезультатПоиска.ЕстьСнижение Тогда
		Подробности = РезультатПоиска.ДеталиСнижения;
		Возврат Истина;
	КонецЕсли;
	
	Если РезультатПоиска.ИзмененоСодержание Тогда
		Подробности = РезультатПоиска.ДеталиИзменения;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция НайтиИзмененияВТЧ(СравниваемаяСсылка, ИскатьСнижение = Истина, ИскатьУвеличение = Истина, ИскатьИзменениеСодержания = Истина)
	
	ТабЧасти = Новый Массив;
	ТабЧасти.Добавить(ОписательТЧ("ММ_КалькуляцияЖДСоставляющей", "Калькуляция ЖД составляющей", "Операция,Груз", "Пробег,Стоимость,СтоимостьИтого"));
	ТабЧасти.Добавить(ОписательТЧ("ММ_КалькуляцияМультимодальнойЦепочки", "Калькуляция мультимодальной цепочки", "Услуга,ВыставляемаяУслуга,Поставщик", "Итого20,Итого40,ВнутренняяСебестоимость"));
	ТабЧасти.Добавить(ОписательТЧ("ММ_ПросчитанныеСтавкиФрахта", "Просчитанные ставки фрахта", "Направление", "Вознаграждение,Ставка"));
	ТабЧасти.Добавить(ОписательТЧ("ММ_ПросчитанныеУслугиФрахта", "Просчитанные услуги фрахта", "Направление,Услуга,Тариф", "Себестоимость"));
	ТабЧасти.Добавить(ОписательТЧ("ЖД_КалькуляцияСебестоимости", "Калькуляция себестоимости", "Услуга,ВидРасходов,СуммаВключаетНДС", "Сумма20,Сумма40,НормВознаграждение20,НормВознаграждение40"));
	ТабЧасти.Добавить(ОписательТЧ("ЖД_УслугиВнеСтавки", "Услуги вне ставки", "Услуга,Поставщик,СуммаВключаетНДС", "Себестоимость20,Себестоимость40,Вознаграждение20,Вознаграждение40"));
	ТабЧасти.Добавить(ОписательТЧ("ЖД_УслугиПоСверхнормативам", "Услуги по сверхнормативам", "Услуга,Поставщик,СуммаВключаетНДС", "Себестоимость20,Себестоимость40,Вознаграждение20,Вознаграждение40"));
	ТабЧасти.Добавить(ОписательТЧ("ПС_ДопРасходыВклВСтавку",, "Услуга,Поставщик,СуммаВключаетНДС", "СуммаБезНДС,СуммаБезНДСРуб"));
	ТабЧасти.Добавить(ОписательТЧ("ПланПродаж_Расходы",, "Номенклатура,Поставщик", "СуммаАванса20,СуммаОплаты20,СуммаАванса40,СуммаОплаты40", Ложь));
	ТабЧасти.Добавить(ОписательТЧ("ПланПродаж_Доходы",, "Номенклатура,ТипСтавки", "СуммаАванса20,СуммаОплаты20,СуммаАванса40,СуммаОплаты40,СуммаНДС20,СуммаНДС40"));
	
	ДанныеИсточника = Новый Структура;
	Для каждого ОписаниеТЧ Из ТабЧасти Цикл
		ИмяТЧ = ОписаниеТЧ.ИмяТЧ;
		ТЗ = СравниваемаяСсылка[ИмяТЧ].Выгрузить(, ОписаниеТЧ.КолонкиСодержания + "," + ОписаниеТЧ.КолонкиВеличины);
		ДанныеИсточника.Вставить(ИмяТЧ, ТЗ);
	КонецЦикла;
	
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("ЕстьОтличия"       , Ложь);
	РезультатПоиска.Вставить("ЕстьСнижение"      , Ложь);
	РезультатПоиска.Вставить("ДеталиСнижения"    , ""  );
	РезультатПоиска.Вставить("ЕстьУвеличение"    , Ложь);
	РезультатПоиска.Вставить("ДеталиУвеличения"  , ""  );
	РезультатПоиска.Вставить("ИзмененоСодержание", Ложь);
	РезультатПоиска.Вставить("ДеталиИзменения"   , ""  );
	
	РезультатПоиска.Вставить("ИскатьСнижение"           , ИскатьСнижение);
	РезультатПоиска.Вставить("ИскатьУвеличение"         , ИскатьУвеличение);
	РезультатПоиска.Вставить("ИскатьИзменениеСодержания", ИскатьИзменениеСодержания);
	
	Для каждого ОписаниеТЧ Из ТабЧасти Цикл
		ЗаполнитьХарактерИзмененийТЧ(ОписаниеТЧ, ДанныеИсточника, РезультатПоиска);
		Если ДостигнутыВсеЦелиПоиска(РезультатПоиска) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Функция ОписательТЧ(ИмяТЧ, СинонимТЧ = "", КолонкиСодержания, КолонкиВеличины, ЗнакПлюс = Истина)
	
	Если ЗначениеЗаполнено(СинонимТЧ) Тогда
		Синоним = СинонимТЧ;
	Иначе
		Синоним = Метаданные.Документы.Калькуляция.ТабличныеЧасти[ИмяТЧ].Синоним;
	КонецЕсли;
	
	ОписаниеТЧ = Новый Структура;
	ОписаниеТЧ.Вставить("ИмяТЧ"            , ИмяТЧ);
	ОписаниеТЧ.Вставить("СинонимТЧ"        , Синоним);
	ОписаниеТЧ.Вставить("КолонкиСодержания", КолонкиСодержания);
	ОписаниеТЧ.Вставить("КолонкиВеличины"  , КолонкиВеличины);
	ОписаниеТЧ.Вставить("ЗнакПлюс"         , ЗнакПлюс);
	
	Возврат ОписаниеТЧ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьХарактерИзмененийТЧ(ОписаниеТЧ, ДанныеИсточника, РезультатПоиска)
	
	ИмяТЧ = ОписаниеТЧ.ИмяТЧ;
	СинонимТЧ = ОписаниеТЧ.СинонимТЧ;
	КоэфПлюс = ?(ОписаниеТЧ.ЗнакПлюс, 1, -1);
	
	КолонкиСодержания = СтрРазделить(ОписаниеТЧ.КолонкиСодержания, ",");
	КолонкиВеличины = СтрРазделить(ОписаниеТЧ.КолонкиВеличины, ",");
	
	ТЗИтог = ДанныеИсточника[ИмяТЧ].Скопировать();
	ТЗИтог.Колонки.Добавить("КолСтр");
	ТЗИтог.Заполнить(-1, "КолСтр");
	
	Для каждого СтрокаИтог Из ТЗИтог Цикл
		Для каждого ИмяКолонки Из КолонкиВеличины Цикл
			СтрокаИтог[ИмяКолонки] = -КоэфПлюс * СтрокаИтог[ИмяКолонки];
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		СтрокаИтог = ТЗИтог.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИтог, СтрокаТЧ);
		СтрокаИтог.КолСтр = 1;
		Для каждого ИмяКолонки Из КолонкиВеличины Цикл
			СтрокаИтог[ИмяКолонки] = КоэфПлюс * СтрокаИтог[ИмяКолонки];
		КонецЦикла;
	КонецЦикла;
	
	ТЗИтог.Свернуть(КолонкиСодержания, КолонкиВеличины);
	
	Для каждого СтрокаИтог Из ТЗИтог Цикл
		
		Если Не РезультатПоиска.ИзмененоСодержание И СтрокаИтог.КолСтр <> 0 Тогда
			РезультатПоиска.ЕстьОтличия = Истина;
			РезультатПоиска.ИзмененоСодержание = Истина;
			Если СтрокаИтог.КолСтр < 0 Тогда
				РезультатПоиска.ДеталиИзменения = "Пропала строка " + ТекстОписанияСтроки(ИмяТЧ, СинонимТЧ, СтрокаИтог, КолонкиСодержания);
			Иначе
				РезультатПоиска.ДеталиИзменения = "Появилась строка " + ТекстОписанияСтроки(ИмяТЧ, СинонимТЧ, СтрокаИтог, КолонкиСодержания);
			КонецЕсли;
		КонецЕсли;
		
		Для каждого ИмяКолонки Из КолонкиВеличины Цикл
			
			Если Не РезультатПоиска.ЕстьСнижение И СтрокаИтог[ИмяКолонки] < 0 Тогда
				РезультатПоиска.ЕстьОтличия = Истина;
				РезультатПоиска.ЕстьСнижение = Истина;
				РезультатПоиска.ДеталиСнижения = "Уменьшение " + ИмяКолонки + "=" + СтрокаИтог[ИмяКолонки] + " " + ТекстОписанияСтроки(ИмяТЧ, СинонимТЧ, СтрокаИтог, КолонкиСодержания);
			КонецЕсли;
			
			Если Не РезультатПоиска.ЕстьУвеличение И СтрокаИтог[ИмяКолонки] < 0 Тогда
				РезультатПоиска.ЕстьОтличия = Истина;
				РезультатПоиска.ЕстьУвеличение = Истина;
				РезультатПоиска.ДеталиУвеличения = "Увеличение " + ИмяКолонки + "=" + СтрокаИтог[ИмяКолонки] + " " + ТекстОписанияСтроки(ИмяТЧ, СинонимТЧ, СтрокаИтог, КолонкиСодержания);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДостигнутыВсеЦелиПоиска(РезультатПоиска) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ТекстОписанияСтроки(ИмяТЧ, СинонимТЧ, СтрокаТаблицы, КолонкиСодержания)
	
	МетаРеквизиты = Метаданные.Документы.Калькуляция.ТабличныеЧасти[ИмяТЧ].Реквизиты;
	
	Текст = "";
	Для каждого ИмяКолонки Из КолонкиСодержания Цикл
		Текст = Текст + ?(Текст = "", "", ", ") + МетаРеквизиты[ИмяКолонки].Синоним + ": " + СтрокаТаблицы[ИмяКолонки];
	КонецЦикла;
	
	Текст = "в таблице " + СинонимТЧ + ", данные строки: " + Текст;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ДостигнутыВсеЦелиПоиска(РезультатПоиска)
	
	Ответ = РезультатПоиска.ЕстьОтличия;
	Ответ = Ответ И (Не РезультатПоиска.ИскатьСнижение            Или РезультатПоиска.ЕстьСнижение);
	Ответ = Ответ И (Не РезультатПоиска.ИскатьУвеличение          Или РезультатПоиска.ЕстьУвеличение);
	Ответ = Ответ И (Не РезультатПоиска.ИскатьИзменениеСодержания Или РезультатПоиска.ИзмененоСодержание);
	
	Возврат Ответ;
	
КонецФункции

//ДИТ Пак И.Т. Task34426 22.05.2021 Конец

//Евросиб Каблов 26.08.2021 Ticket#0232662
&НаКлиенте
Процедура ОтозватьСогласование(Команда)
	
	ОповещениеОВыбореЗначения = Новый ОписаниеОповещения("ОтменаСогласования", ЭтаФорма);
	
	ПоказатьВопрос(ОповещениеОВыбореЗначения, "Калькуляция будет возвращена на этап ввода, а информация о результатах согласования стерта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

//Евросиб Каблов 26.08.2021 Ticket#0232662
&НаКлиенте
Процедура ОтменаСогласования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Да Тогда
		Возврат; 
	КонецЕсли;
	
	Для Сч = 1 По Объект.Состояния.Количество()-1 Цикл
		
		Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		Если ЗначениеЗаполнено(Объект.Состояния[Сч].СтатусСогласования) Тогда
			Объект.Состояния[Сч].СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется");
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.Состояния.Количество() > 0 Тогда
		Объект.Состояния[0].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
	КонецЕсли;
		
	ЗаписатьОтменуСогласования();

	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//ДИТ, Беляев СЮ, Ticket#0256571, ++ 
	//Возвращаем дефолтные настройки доступности формы
	ВременнаяФорма = ПолучитьФорму("Документ.Калькуляция.Форма.ФормаДокумента",Новый Структура("ДефолтныеНастройки", Истина),,Истина);        
	ЭлементыВременнойФормы = ВременнаяФорма.Элементы; 
	Для Каждого ЭлементФормы Из ЭтаФорма.Элементы Цикл        
		ИмяСвойстваБлокировкиЭлементаФормы = ПолучитьИмяСвойстваБлокировкиЭлементаФормы(ЭлементФормы);
		Если НЕ ЗначениеЗаполнено(ИмяСвойстваБлокировкиЭлементаФормы) Тогда
			Продолжить;
		КонецЕсли;
		НайденныйЭлемент = ЭлементыВременнойФормы.Найти(ЭлементФормы.Имя);
		Если НайденныйЭлемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяСвойстваБлокировкиЭлементаФормы = "ТолькоПросмотр" Тогда
			Если ЭлементФормы.ТолькоПросмотр <> НайденныйЭлемент.ТолькоПросмотр Тогда
				ЭлементФормы.ТолькоПросмотр = НайденныйЭлемент.ТолькоПросмотр;
			КонецЕсли;
		Иначе
			Если ЭлементФормы.Доступность <> НайденныйЭлемент.Доступность Тогда
				ЭлементФормы.Доступность = НайденныйЭлемент.Доступность;
			КонецЕсли;		
		КонецЕсли;   	
	КонецЦикла;      
	//обработка требуемых блокировок
	ОбработатьБлокировкуЭлементовФормы();
	//ДИТ, Беляев СЮ, Ticket#0256571, --
КонецПроцедуры  

//ДИТ, Беляев СЮ, Ticket#0256571, ++   
&НаСервере
Процедура ОбработатьБлокировкуЭлементовФормы();
   	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0256571, --

//Евросиб Каблов 26.08.2021 Ticket#0232662
&НаСервере
Процедура ЗаписатьОтменуСогласования()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, ИзмененыТолькоРазрешенныеПоля", РежимЗаписиДокумента.Запись, Истина);	
	Записать(ПараметрыЗаписи);
	
	Если Не БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
	
		ОтветственныйЗаУчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ОтветственныйЗаУчет");
		Если ЗначениеЗаполнено(ОтветственныйЗаУчет) Тогда
			АдресПолучателя = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ОтветственныйЗаУчет, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		Иначе
			АдресПолучателя = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресПолучателя) Тогда
			
			Тема = СтрШаблон("Отменено согласование калькуляции %1", Объект.Ссылка);
			ТелоПисьма = Новый ФорматированныйДокумент;
			ТелоПисьма.Добавить(Тема);
			СкрытыеКопии = "";
			Вложения = Новый Массив;
			
			Если РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, Истина, Ложь) Тогда
				ПараметрыСообщения = новый Структура("Кому, ПолучателиСообщения, СкрытыеКопии, Тема, Тело, Вложения", АдресПолучателя, АдресПолучателя, СкрытыеКопии, Тема, ТелоПисьма, Вложения);
				Попытка
					ИДПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыСообщения);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					//ЗаписьЖурналаРегистрации("Письмо не отправлено по причине: " + ОписаниеОшибки, УровеньЖурналаРегистрации.Ошибка,,, "Рассылка об изменении рейтинга клиентов");
					//ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, начало
					ЗаписьЖурналаРегистрации(РаботаСПочтовымиСообщениями.СобытиеЖурналаРегистрацииОшибка(), УровеньЖурналаРегистрации.Ошибка,,, "Отмена согласования Калькуляции. Письмо не отправлено по причине: "+ОписаниеОшибки);
					//ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, конец
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.Калькуляция.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Евросиб Фролов (28.12.2021 TASK№ 42761
	Если БылиИзменения Тогда
		Оповестить("ИзмененаКалькуляция");
		БылиИзменения = Ложь;
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0256571, ++
&НаКлиенте 
Функция ПолучитьИмяСвойстваБлокировкиЭлементаФормы(Знач вхЭлементФормы)
	Результат = "";
	Если ТипЗнч(вхЭлементФормы) = Тип("ПолеФормы") 
			ИЛИ ТипЗнч(вхЭлементФормы) = Тип("ТаблицаФормы") Тогда
		Результат = "ТолькоПросмотр";
	КонецЕсли;
	Если ТипЗнч(вхЭлементФормы) = Тип("КнопкаФормы") Тогда
	   	Результат = "Доступность";	
	КонецЕсли;
	Возврат Результат;
КонецФункции  

//ДИТ Авдеева В. 43126 04.04.2022 Начало      
&НаСервереБезКонтекста
Функция ПолучитьУслугуПоКатегорииДоговора(Договор)  
	
	Услуга = Справочники.Номенклатура.ПустаяСсылка();   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииДоговоров.ОсновнаяНоменклатура КАК ОсновнаяНоменклатура
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КатегорииДоговоров КАК КатегорииДоговоров
	|		ПО ДоговорыКонтрагентов.КатегорияДоговора = КатегорииДоговоров.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";    
	
	Запрос.УстановитьПараметр("Договор", Договор);   
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда    
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Услуга = Выборка.ОсновнаяНоменклатура;
	КонецЕсли; 
	
	
	
	Возврат Услуга;
	
КонецФункции //ДИТ Авдеева В. 43126 04.04.2022 Конец 
	
&НаКлиенте
Процедура ОтсутствуетПеревозкаПоЖДПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры                

&НаСервереБезКонтекста
Функция ПолучитьТекстПодсказкиОтсутствуетПеревозкаПоЖД()

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Номенклатура.Представление КАК НоменклатураПредставление
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.ОтсутствиеПеревозкиПоЖДДляКалькуляции = Истина";
	//РезультатЗапроса = Запрос.Выполнить();
	//МассивНоменклатуры = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НоменклатураПредставление");
	//ШаблонТекста = "Признак устанавливается автоматически, если в разделе 1.3 НЕ учтены расходы с номенклатурами: %1 И выбран тип заказа отличный от «Предоставление вагонов»";
	//ТекстПодсказки = СтрШаблон(ШаблонТекста, СтрСоединить(МассивНоменклатуры, ", "));
	ТекстПодсказки = "Признак отражает наличие ЖД перевозки. Если установлен, фактические расходы (неуреги) автоматически не будут разноситься";
	Возврат ТекстПодсказки;
	
КонецФункции

&НаКлиенте
Процедура ЖД_УслугиВнеСтавки1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекД = Элементы.ЖД_УслугиВнеСтавки1.ТекущиеДанные;
	Если НоваяСтрока И ТекД <> неопределено Тогда
		ТекД.ВидРасходов = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Себестоимость");
		ТекД.Валюта = Объект.Валюта;
	КонецЕсли;
	//Евросиб - АСуслов 27.09.2022 13:36:18 #
	//(
	Если Копирование Тогда
		ТекД.ИдентификаторСтроки = "";
		// Евросиб US 86792 TA 86795 Рыбьяков К.А. 15.06.2024 ((
		Если ТекД.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.ТЭУ") Тогда
			ТекД.Услуга = Неопределено;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 15.06.2024 ))
	КонецЕсли;
	//)
	//Евросиб - АСуслов 27.09.2022 13:36:18 #
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	Элементы.ОтсутствуетПеревозкаПоЖД.ТолькоПросмотр = Не ПользовательСПолнымиПравами И Объект.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.ПовагоннаяОтправка");
КонецПроцедуры

//ДИТ Шевченко А.В. 07.12.22 59978 -начало
&НаСервереБезКонтекста
Функция ПроверитьПериодДействияДоговора(Договор,ДатаНачала,ДатаОкончания)
	Если ЗначениеЗаполнено(ДатаНачала) и НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда	
		ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,ДатаНачала,Дата(1,1,1),Истина);
		Возврат ДоговорДействует;
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,ДатаНачала,ДатаОкончания);
		Возврат ДоговорДействует;	
	КонецЕсли;
	Возврат Истина;
КонецФункции	

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	
	//Евросиб Каблов 28.05.2025 ( #109346
	Объект.НачалоДействия = ПериодДействия.ДатаНачала;
	Объект.ОкончаниеДействия = ПериодДействия.ДатаОкончания;
	//Евросиб Каблов 28.05.2025 )
	
	//ДИТ Шевченко А.В. 07.12.22 59978 -начало
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ДоговорДействует = ПроверитьПериодДействияДоговора(Объект.Договор,ПериодДействия.ДатаНачала,ПериодДействия.ДатаОкончания);
		Элементы.НадписьНеДействуетДоговор.Видимость = НЕ ДоговорДействует;
	КонецЕсли;
	//ДИТ Шевченко А.В. 07.12.22 59978 -конец
	
	//Евросиб СубботинВ #133276 11.03.2026 Начало
	ОбновитьСтоимостьУслуг(Ложь, Истина);
	//Евросиб СубботинВ #133276 11.03.2026 Конец
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	ТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ТекДанные.Услуга);
	
	Если ЗначениеЗаполнено(ТипыЛокаций) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораПунктаОтправления", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, Отбор, ПоказыватьВыборАдреса", Ложь, Новый Структура("Тип", ТипыЛокаций), Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	Иначе
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораПунктаОтправления", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	ТипыЛокаций = НоменклатураСервер.ПолучитьДоступныеТипыЛокацийПоНоменклатуре(ТекДанные.Услуга);
	
	Если ЗначениеЗаполнено(ТипыЛокаций) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораПунктаНазначения", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, Отбор, ПоказыватьВыборАдреса", Ложь, Новый Структура("Тип", ТипыЛокаций), Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	Иначе
		СтандартнаяОбработка = Ложь;
	
		ОбработкаВыбораПунктаНазначения = Новый ОписаниеОповещения("ОбработкаВыбораПунктаНазначения", ЭтаФорма);	
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,, ОбработкаВыбораПунктаНазначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

//Евросиб Каблов 20.12.2022 62430
&НаКлиенте
Процедура ОбработкаВыбораПунктаОтправления(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекЭлемент = Элементы.ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначения;
	ММ_КалькуляцияМультимодальнойЦепочкиПунктОтправленияОбработкаВыбора(ТекЭлемент, ВыбранноеЗначение, Истина);
	
КонецПроцедуры

//Евросиб Каблов 20.12.2022 62430
&НаКлиенте
Процедура ОбработкаВыбораПунктаНазначения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекЭлемент = Элементы.ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначения;
	ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначенияОбработкаВыбора(ТекЭлемент, ВыбранноеЗначение, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если ЛокацияСоответствуетУслуге Тогда
		ТекДанные.ПунктОтправления = ВыбранноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = СтрШаблон("В строке №%1 таблицы 1.3 тип выбранного пункта отправления %2 не соответствует доступным типам локаций услуги. Доступные типы локаций: %3", ТекДанные.НомерСтроки, СтрокаТипЛокации, СтрокаДоступныеТипы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ММ_КалькуляцияМультимодальнойЦепочки", ТекДанные.НомерСтроки, "ПунктОтправления"), "Объект");
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Евросиб Каблов 20.12.2022 ( 62430
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ВыбранноеЗначение, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если ЛокацияСоответствуетУслуге Тогда
		ТекДанные.ПунктНазначения = ВыбранноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = СтрШаблон("В строке №%1 таблицы 1.3 тип выбранного пункта назначения %2 не соответствует доступным типам локаций услуги. Доступные типы локаций: %3", ТекДанные.НомерСтроки, СтрокаТипЛокации, СтрокаДоступныеТипы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ММ_КалькуляцияМультимодальнойЦепочки", ТекДанные.НомерСтроки, "ПунктНазначения"), "Объект");
	КонецЕсли;
	//Евросиб Каблов 20.12.2022 )
	
КонецПроцедуры

//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
&НаСервереБезКонтекста
Функция СписокСкрываемыхРеквизитовДляМежсервисныхРасходов()
	
	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить("ОсновнаяУслуга");
	СписокРеквизитов.Добавить("ЖД_РасчетСебестоимостиДляТипаФГП1");
	СписокРеквизитов.Добавить("Груз");
	СписокРеквизитов.Добавить("Группа91");
	СписокРеквизитов.Добавить("ЖД_ПринадлежностьПС2");
	СписокРеквизитов.Добавить("ТерриторияМаршрута2");
	СписокРеквизитов.Добавить("ЖД_ТарифЗаПодсылПорожнейПлатформыБезНДС2");
	СписокРеквизитов.Добавить("ЖД_ТарифЗаВозвратПорожнейПлатформыПослеВыгрузкиБезНДС1");
	СписокРеквизитов.Добавить("Группа51");
	СписокРеквизитов.Добавить("УсловияПеревозки_Отправление"); //Отключить проверку
	СписокРеквизитов.Добавить("УсловияПеревозки_Прибытие"); //Отключить проверку
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа14"); 
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа3"); 
	
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа11");
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа15");
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа7");
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа8");
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиГруппа9");
	СписокРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочкиАналитики"); 
	

	//СписокРеквизитов.Добавить("Группа6");
	СписокРеквизитов.Добавить("Группа71");
	СписокРеквизитов.Добавить("ДополнительныеУсловияДляПечатиПСЦ");
	СписокРеквизитов.Добавить("ГруппаКоммерческоеПредложение");
	СписокРеквизитов.Добавить("ГруппаНастройкиДляСайта");
	СписокРеквизитов.Добавить("ГруппаСтраницаЖелезнодорожная");
	СписокРеквизитов.Добавить("ГруппаЖелезнодорожнаяПредоставление");
	
	СписокРеквизитов.Добавить("КалькуляцияЗавершена");
	//СписокРеквизитов.Добавить("Группа69");
	СписокРеквизитов.Добавить("Группа68");
	СписокРеквизитов.Добавить("Группа67");
	
	СписокРеквизитов.Добавить("НФ_ДействиеСтавокНа");
	СписокРеквизитов.Добавить("Море_УсловияВыгрузки");
	СписокРеквизитов.Добавить("Море_УсловияПогрузки");
	СписокРеквизитов.Добавить("Группа16");
	
	Возврат СписокРеквизитов;
	
КонецФункции

//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
&НаСервере
Функция ЭтоМежсервисныеРасходы()
	
	Результат = Ложь;
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы") 
		ИЛИ Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф") Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

//Субботин TASK 70840 20.06.2023 Начало 
&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Евросиб Шевченко А.В. US 115279 TA 119764 25.12.2025	
	Если (Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.teu") ИЛИ Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон")) И НЕ ЗначениеЗаполнено(Объект.ЖД_РасчетСебестоимостиДляТипаФГП) 
		И (ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПредоставлениеПлатформ") ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.МежсервисныеРасходы")) Тогда
		ТекстПредупреждения = "Для расчета ставки по номенклатуре "+ВыбранноеЗначение+" необходимо выбрать Тип платформы для расчета или изменить ед.измерения";	
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения,,, "Объект.ЖД_РасчетСебестоимостиДляТипаФГП");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 115279 TA 119764 25.12.2025
	
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиУслуга1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ПланПродаж_ДоходыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ПланПродаж_РасходыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано); //конт поезд
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ПС_ДопРасходыВклВСтавкуУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(ВыбранноеЗначение,СтандартнаяОбработка,,Объект.Создано);
КонецПроцедуры
//Субботин TASK 70840 20.06.2023 конец   

//Евросиб Коханенко Н.А. 02.10.2023 (( #75712
//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
//&НаСервереБезКонтекста
//Функция ДирекцияКонтейнерныхПеревозок()
//	Возврат Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
//КонецФункции
//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 

&НаКлиенте
Процедура Суша_ПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктНазначения1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктНазначения2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктОтправления1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктОтправления2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПунктОтправления1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПунктНазначения1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиВнеСтавкиПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_УслугиПоСверхнормативамПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктДКПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) //ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
	//Евросиб Коханенко Н.А. 02.04.2025 (( #106241
	//СтандартнаяОбработка = Ложь;
	//Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.ПродуктыДКП.СдачаВагонаВПользование") И Объект.ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого") Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Ручной выбор элемента запрещен");
	//	Возврат;
	//КонецЕсли;
	//Объект.ПродуктДКП = ВыбранноеЗначение;
	//Евросиб Коханенко Н.А. 02.04.2025 )) #106241
КонецПроцедуры

//Евросиб Коханенко Н.А. 31.07.2023 (( #72829 
&НаКлиенте
Процедура ОтнестиРасходыНаСобственныеЗатратыПриИзменении(Элемент)
	Объект.ОтнестиРасходыНаСебестоимостьКлиента = НЕ Объект.ОтнестиРасходыНаСобственныеЗатраты; 
КонецПроцедуры

&НаКлиенте
Процедура ОтнестиРасходыНаСебестоимостьКлиентаПриИзменении(Элемент)
	Объект.ОтнестиРасходыНаСобственныеЗатраты = НЕ Объект.ОтнестиРасходыНаСебестоимостьКлиента; 
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьВидимостьПолейДляСлужебнойКалькуляции()
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//ВидимостьПолей = КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) 
	ВидимостьПолей = ЭтоДирекцияКонтейнерныхПеревозок 
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
		И КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции);
	Элементы.ГруппаОтнестиРасходы.Видимость = ВидимостьПолей;
	Элементы.ГруппаКоличествоКТК.Видимость = ВидимостьПолей;
	Элементы.Примечание.ПодсказкаВвода = ?(ВидимостьПолей, "Обоснование причины передислокации", "");
	ОбновитьДоступностьПоляСогласованноеКоличествоКТК();
КонецПроцедуры 
	
&НаКлиенте
Процедура ОбновитьДоступностьПоляСогласованноеКоличествоКТК()
	//если статус состояния "Согласование ПЭО" установлен в "Выполнено", то поле Количество КТК становится нередактируемым
	СогласованиеПЭО = ПредопределенноеЗначение("Справочник.Состояния.СогласованиеПЭО");
	МассивСтрокСогласованияПЭО = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", СогласованиеПЭО));
	Если МассивСтрокСогласованияПЭО.Количество() > 0 Тогда
		НомерСтрокиВТЧ = МассивСтрокСогласованияПЭО[0].НомерСтроки-1;
		Если Объект.Состояния[НомерСтрокиВТЧ].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
			Элементы.СогласованноеКоличествоКТК.ТолькоПросмотр = Истина;
		Иначе
			Элементы.СогласованноеКоличествоКТК.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура ПроверитьЗаполненностьКомментарияПриОтклоненииСлужебнойКалькуляции(Отказ)
	//если текущее состояние - это Согласование и оно отклонено, то поле Комментария состояния не может оставаться не заполненным
	Если ЭтаФорма.ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен")
		//Евросиб Коханенко Н.А. 25.12.2023 (( #78960 
		//и если калькуляция служебная
		И КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) 
			И КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции)
		//Евросиб Коханенко Н.А. 25.12.2023 )) #78960
			И ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.ТекущееСостояние, "Согласование") Тогда
		НаименованиеТекущегоСостояния = ЭтаФорма.ТекущийИсполнитель_Состояние;
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", НаименованиеТекущегоСостояния));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НомерСтрокиВТЧ = НайденныеСтроки[0].НомерСтроки - 1;
			Если Объект.Состояния[НомерСтрокиВТЧ].Комментарий = "" Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана причина отклонения калькуляции",, "Объект.Состояния[" + НомерСтрокиВТЧ + "].Комментарий",, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры
//Евросиб Коханенко Н.А. 31.07.2023 )) #72829 

//Евросиб Коханенко Н.А. 26.07.2023 (( #73072 
&НаСервере
Процедура ОбновитьБлокировкуСтатусаСостоянийСогласования()
	
	//Евросиб Коханенко Н.А. 04.08.2025 (( #83408 
	//Если Объект.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
	Если ЭтоМежсервисныеРасходы()
	//Евросиб Коханенко Н.А. 04.08.2025 )) #83408	
		И КонтрагентыДоговоры_сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Объект.Контрагент) Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();

		Для каждого Стр из Объект.Состояния Цикл 
			Согласование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Состояние, "Согласование");
			Если НЕ Согласование Тогда Продолжить; КонецЕсли;
			Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
				Стр.БлокировкаИзмененияСтатуса = Стр.Исполнитель <> ТекущийПользователь;
			ИначеЕсли ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ГруппыПользователейСостав.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
					|ГДЕ
					|	ГруппыПользователейСостав.Ссылка = &Ссылка 
					|	И ГруппыПользователейСостав.Пользователь = &Пользователь";
				Запрос.УстановитьПараметр("Ссылка", Стр.Исполнитель);
				Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		        Стр.БлокировкаИзмененияСтатуса = (ВыборкаДетальныеЗаписи.Количество() = 0);
			Иначе
				Стр.БлокировкаИзмененияСтатуса = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЭлементОформления из УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.Представление = "ДоступностьПоляСтатус" Тогда
			УсловноеОформление.Элементы.Удалить(ЭлементОформления);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = "ДоступностьПоляСтатус";
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
       ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Состояния.БлокировкаИзмененияСтатуса");  
       ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;   
       ЭлементОтбора.ПравоеЗначение = Истина;   
       ЭлементОтбора.Использование = Истина;
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СостоянияСтатус");
		ПолеОформления.Использование = Истина;
		
	//Евросиб Коханенко Н.А. 04.08.2025 (( #83408
	МассивСтатусовСогласований = Новый Массив;
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний); 
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
	МассивСтатусовСогласований.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	Если НЕ ПользовательСПолнымиПравами
		И ЭтоМежсервисныеРасходы() 
		И Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияКалькуляции",, Ложь) 
		И МассивСтатусовСогласований.Найти(Объект.СтатусДокумента) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 04.08.2025 )) #83408
	
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СостоянияИсполнитель");
		ПолеОформления.Использование = Истина;
		
	ПользовательСРольюРедактированиеНормативовКонтрибуции = Пользователи.РолиДоступны("dc_РедактированиеНормативовКонтрибуции");	
		
КонецПроцедуры
//Евросиб Коханенко Н.А. 26.07.2023 )) #73072

//Евросиб Коханенко Н.А. 03.08.2023 (( #73084 
&НаСервере
Процедура ВычислитьКоличествоВыданныхКТКПоСвязаннымЗаявкам()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВыданоКТК = 0;
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заявка.Ссылка КАК Ссылка,
		|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО Заявка.Ссылка = ЗаявкаСоставУслуги.Ссылка
		|ГДЕ
		|	ЗаявкаСоставУслуги.Калькуляция = &Калькуляция
		|	И Заявка.Проведен";
	Запрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Объект.ВыданоКТК = ВыборкаДетальныеЗаписи.Количество();
КонецПроцедуры
//Евросиб Коханенко Н.А. 03.08.2023 )) #73084 

&НаКлиенте
Процедура ЖД_ПромежуточныеПунктыПунктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура ЖД_КалькуляцияСебестоимостиПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 28.06.2023 10:58:09 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 28.06.2023 10:58:12 #локации	
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктОтправления1ПриИзменении(Элемент)
	Суша_ПунктОтправленияТип = ПолучитьТипПункта(Объект.Суша_ПунктОтправления);
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктНазначения1ПриИзменении(Элемент)
	Суша_ПунктНазначенияТип = ПолучитьТипПункта(Объект.Суша_ПунктНазначения);
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктОтправления2ПриИзменении(Элемент)
	Суша_ПунктОтправленияТип = ПолучитьТипПункта(Объект.Суша_ПунктОтправления);
КонецПроцедуры

&НаКлиенте
Процедура Суша_ПунктНазначения2ПриИзменении(Элемент)
	Суша_ПунктНазначенияТип = ПолучитьТипПункта(Объект.Суша_ПунктНазначения);
КонецПроцедуры

//Евросиб Коханенко Н.А. 08.04.2024 (( #83546 
&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктОтправленияПриИзменении(Элемент)
	УстановитьПризнакВнутреннейСебестоимостиПоПараметрам();
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПунктНазначенияПриИзменении(Элемент)
	УстановитьПризнакВнутреннейСебестоимостиПоПараметрам();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьПризнакВнутреннейСебестоимостиПоПараметрам(УчитыватьТекущееСостояние = Ложь)
	ТекД = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда   
		ТекД.ВнутренняяСебестоимость = (ТекД.ВнутренняяСебестоимость ИЛИ НЕ УчитыватьТекущееСостояние) 
											И ПолучитьВнутреннююСебестоимость(ТекД.Услуга, ТекД.ПунктОтправления, ТекД.ПунктНазначения); 
		// Евросиб Фролов (28.12.2021 TASK №43954
		Если ТекД.ВнутренняяСебестоимость Тогда
			ТекД.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			ТекД.НДСВключенВСтоимость = Ложь;
		КонецЕсли;
		// Евросиб Фролов)
	КонецЕсли;
КонецПроцедуры  
//Евросиб Коханенко Н.А. 08.04.2024 )) #83546

// ДИТ US 85649 Сержантова А.С. 23.05.2024
&НаКлиенте
Процедура Суша_ПунктОтправленияПриИзменении(Элемент)
	Если КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции) 
		и СписокСтанцийОтправления.Количество() = 0 Тогда   
		Если ЗначениеЗаполнено(Объект.Суша_ПунктОтправления)  Тогда
		    Для каждого СтрЦепочки Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
				СтрЦепочки.ПунктОтправления = Объект.Суша_ПунктОтправления;
			КонецЦикла;
		Иначе
			
		КонецЕсли;
	КонецЕсли;
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры   

// ДИТ US 85649 Сержантова А.С. 23.05.2024
&НаКлиенте
Процедура Суша_ПунктНазначенияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Суша_ПунктНазначения) 
		и КалькуляцииЗаявкиПСЦСервер.ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(Объект.ТипКалькуляции) 
		и СписокСтанцийНазначения.Количество() = 0 Тогда
		Для каждого СтрЦепочки Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			СтрЦепочки.ПунктНазначения = Объект.Суша_ПунктНазначения;
		КонецЦикла;
	КонецЕсли;
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры

// ДИТ US 85649 Сержантова А.С. 23.05.2024
&НаКлиенте
Процедура Суша_ПунктОтправленияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Текст) и ЗначениеЗаполнено(Объект.Суша_ПунктОтправления) 
		и СписокСтанцийОтправления.Количество() = 0 Тогда
		СтрокиСоСтанцией =  Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиСтроки(Новый Структура("ПунктОтправления", Объект.Суша_ПунктОтправления));		
		Для каждого СтрЦепочки Из СтрокиСоСтанцией Цикл
			СтрЦепочки.ПунктОтправления = Неопределено;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// ДИТ US 85649 Сержантова А.С. 23.05.2024
&НаКлиенте
Процедура Суша_ПунктНазначенияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Текст) и ЗначениеЗаполнено(Объект.Суша_ПунктНазначения) 
		и СписокСтанцийНазначения.Количество() = 0 Тогда
		СтрокиСоСтанцией =  Объект.ММ_КалькуляцияМультимодальнойЦепочки.НайтиСтроки(Новый Структура("ПунктНазначения", Объект.Суша_ПунктНазначения));		
		Для каждого СтрЦепочки Из СтрокиСоСтанцией Цикл
			СтрЦепочки.ПунктНазначения = Неопределено;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 ((
&НаСервере
Процедура ЗаполнитьУслугуЕдиницыИзмерения()
	
	УслугаПоКатегорииДоговора = ПолучитьУслугуПоКатегорииДоговора(Объект.Договор);   

	Если ЗначениеЗаполнено(УслугаПоКатегорииДоговора) Тогда
		Объект.ОсновнаяУслуга = УслугаПоКатегорииДоговора;
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Объект.ОсновнаяУслуга));
	ИначеЕсли ЗначениеЗаполнено(Объект.ОсновнаяУслуга) Тогда
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Объект.ОсновнаяУслуга));
	ИначеЕсли Объект.НФ_ВыбранныеСтавки.Количество() > 0 Тогда
		УслугаФрахтаДляКалькуляции = Константы.УслугаФрахтаДляКалькуляции.Получить();
		Объект.ОсновнаяУслуга = УслугаФрахтаДляКалькуляции;
		Элементы.ЕдиницаИзмерения.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЗначенийВыбораЕИ(Объект.ОсновнаяУслуга));
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 02.07.2024 ))

// Евросиб US 87896 TA 90558 Рыбьяков К.А. 06.09.2024 ((
&НаКлиенте
Процедура ЗначениеВПортуПриИзмененииSOC(Элемент)
	
	ТекущиеДанные = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	//ВведенноеЧисло = Число(Элемент.ТекстРедактирования);
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, начало
	ВведенноеЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Элемент.ТекстРедактирования);
	Если ВведенноеЧисло = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, конец
	Если ВведенноеЧисло = 0 Тогда
		КодПорта = СтрЗаменить(Элемент.Имя, "_", Символы.ПС);
		КодПорта = СтрПолучитьСтроку(КодПорта, СтрЧислоСтрок(КодПорта));
		ТекущиеДанные["НФ_ИмяПорта_Флажок_SOC_" + КодПорта] = Ложь;
	Иначе
		КодПорта = СтрЗаменить(Элемент.Имя, "_", Символы.ПС);
		КодПорта = СтрПолучитьСтроку(КодПорта, СтрЧислоСтрок(КодПорта));
		ТекущиеДанные["НФ_ИмяПорта_Флажок_SOC_" + КодПорта] = Истина;
	КонецЕсли;
	
	ОбновитьФлажкиСтавок("НФ_ИмяПорта_Выбрано_SOC_" + КодПорта);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеВПортуПриИзмененииCOC(Элемент)
	
	ТекущиеДанные = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	//ВведенноеЧисло = Число(Элемент.ТекстРедактирования);
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, начало
	ВведенноеЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Элемент.ТекстРедактирования);
	Если ВведенноеЧисло = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379331, 11-12-2024, конец
	Если ВведенноеЧисло = 0 Тогда
		КодПорта = СтрЗаменить(Элемент.Имя, "_", Символы.ПС);
		КодПорта = СтрПолучитьСтроку(КодПорта, СтрЧислоСтрок(КодПорта));
		ТекущиеДанные["НФ_ИмяПорта_Флажок_COC_" + КодПорта] = Ложь;
	Иначе
		КодПорта = СтрЗаменить(Элемент.Имя, "_", Символы.ПС);
		КодПорта = СтрПолучитьСтроку(КодПорта, СтрЧислоСтрок(КодПорта));
		ТекущиеДанные["НФ_ИмяПорта_Флажок_COC_" + КодПорта] = Истина;
	КонецЕсли;
	
	ОбновитьФлажкиСтавок("НФ_ИмяПорта_Выбрано_COC_" + КодПорта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФлажкиСтавок(КодПоиска, ВыбраннаяСтатья = Неопределено)
	
	ТекущиеДанные = Элементы.НФ_ЛинииПорты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		Статья = ВыбраннаяСтатья;
	КонецЕсли;
	
	РазмерностьКТК = ?(СтрНайти(ТекущиеДанные.Статья, "20") = 0, Строка("40"), Строка("20"));
	Статья = ТекущиеДанные.Статья;
	
	ТекКолонка = СтрЗаменить(КодПоиска, "Выбрано", "Флажок");
	ТекИмяПорта = СтрЗаменить(КодПоиска, "Выбрано_", "");
	ТекКолонкаВыбрано = КодПоиска;
	
	СтатьяПодбора = Неопределено;
	Если Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20") Тогда
		СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20")
	ИначеЕсли Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение40") Тогда
		СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт40")
	ИначеЕсли Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт20") Тогда
		СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение20")
	ИначеЕсли Статья = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Фрахт40") Тогда
		СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Вознаграждение40")
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	ПараметрыОтбора.Вставить("Порт", ТекущиеДанные.Порт);
	ПараметрыОтбора.Вставить("Статья", СтатьяПодбора);
	НайденныеСтроки = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
	
	Если ТекущиеДанные[ТекКолонка] = Ложь Тогда
		//Для Каждого Строка Из НайденныеСтроки Цикл
		//	Если СтрНайти(Строка.Статья, РазмерностьКТК) <> 0 Тогда
		//		Строка[ТекКолонка] = Ложь;
		//		Строка[ТекКолонкаВыбрано] = Ложь;
		//	КонецЕсли;
		//КонецЦикла;
	Иначе
		//Для Каждого Строка Из НайденныеСтроки Цикл
		//	Если СтрНайти(Строка.Статья, РазмерностьКТК) <> 0 Тогда
		//		Строка[ТекКолонка] = Истина;
		//		Строка[ТекКолонкаВыбрано] = Истина;
		//		Если ПроверитьВторуюСтроку И ВведенноеЗначение <> 0 И СтрНайти(Строка.Статья, "Итог") = 0 Тогда
		//			ПоставитьФлажокИтого = ПоставитьФлажокИтого + 1;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НайденныеСтроки[0][ТекИмяПорта] <> 0 И НайденныеСтроки[0][ТекКолонка] = Истина Тогда
				Если РазмерностьКТК = "20" Тогда
					СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого20");
				Иначе	
					СтатьяПодбора = ПредопределенноеЗначение("Перечисление.СтатьяФрахта.Итого40");
				КонецЕсли;
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Контрагент", ТекущиеДанные.Контрагент);
				ПараметрыОтбора.Вставить("Порт", ТекущиеДанные.Порт);
				ПараметрыОтбора.Вставить("Статья", СтатьяПодбора);
				НайденныеСтроки = НФ_ЛинииПорты.НайтиСтроки(ПараметрыОтбора);
				НайденныеСтроки[0][ТекКолонка] = Истина;
				НайденныеСтроки[0][ТекКолонкаВыбрано] = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСтавки(Команда)
	
	НФ_ЛинииПортыВыбратьСнятьНаСервере("Установить");
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеСтавки(Команда)
	
	НФ_ЛинииПортыВыбратьСнятьНаСервере("Снять");
	
КонецПроцедуры

&НаСервере
Процедура НФ_ЛинииПортыВыбратьСнятьНаСервере(Действие)
	
	Таблица = НФ_ЛинииПорты.Выгрузить();
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если СтрНайти(Колонка.Имя, "Флажок") <> 0 Тогда
			Если Действие = "Установить" Тогда
				Таблица.ЗаполнитьЗначения(Истина, Колонка.Имя);
			Иначе
				Таблица.ЗаполнитьЗначения(Ложь, Колонка.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НФ_ЛинииПорты.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЛокацииММ(Результат, ДополнительныеПараметры) Экспорт 
	
	ТекущиеДанные = Элементы.ММ_ПортыОтправленияНазначения.ТекущиеДанные;
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		ТекущиеДанные.Порт = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтавкиSOC(Команда)

	ВставитьСтавки("SOC");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтавкиCOC(Команда)
	
	ВставитьСтавки("COC");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтавки(SOCилиCOC)
	
	ПортыОтгрузкиВыгрузки = Новый Массив;
	ПортыОтправленияНазначения = Новый Массив;
	
	Для Каждого Строка Из Объект.НФ_ПортыОтгрузкиВыгрузки Цикл
		ПортыОтгрузкиВыгрузки.Добавить(Строка.Порт);
	КонецЦикла;
	
	Для Каждого Строка Из Объект.НФ_ПортыОтправленияНазначения Цикл
		ПортыОтправленияНазначения.Добавить(Строка.Порт);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПортыОтгрузкиВыгрузки", ПортыОтгрузкиВыгрузки);
	ПараметрыФормы.Вставить("ПортыОтправленияНазначения", ПортыОтправленияНазначения);
	ПараметрыФормы.Вставить("SOCилиCOC", SOCилиCOC);
		
	Если Объект.ФрахтИмпорт Тогда
		ПараметрыФормы.Вставить("ФрахтИмпорт", Истина);
	Иначе
		ПараметрыФормы.Вставить("ФрахтИмпорт", Ложь);
	КонецЕсли;
	
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 29.07.2025 ((
	Если Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.teu") Тогда
		ПараметрыФормы.Вставить("ЕдиницаИзмеренияTEU");
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 20.08.2025 ))
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗагрузкиСтавок", ЭтаФорма, SOCилиCOC);
	
	ОткрытьФорму("Документ.Калькуляция.Форма.ФормаВставкиСтавокЗаФрахт",
		ПараметрыФормы,
		ЭтаФорма.УникальныйИдентификатор, 
		, 
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиСтавок(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеТаблицыФрахтов(Результат, Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТаблицыФрахтов(МассивДанных, SOCилиCOC)
	
	Таблица = НФ_ЛинииПорты.Выгрузить();
	
	ИмяКолонки = "НФ_ИмяПорта_" + SOCилиCOC + "_";
	
	Для Каждого Данные Из МассивДанных Цикл
		КодПорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ПортОтправленияНазначения, "Код");
		КодПорта = Строка(СокрЛП(КодПорта));
		ИмяКолонкиЭлементФормы = СокрЛП(ИмяКолонки + КодПорта);
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Если СтрНайти(Колонка.Имя, ИмяКолонкиЭлементФормы) <> 0 Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Порт", Данные.ПортОтгрузкиВыгрузки);
				НайденныеСтроки = Таблица.НайтиСтроки(ПараметрыОтбора);
				Для Каждого Строка Из НайденныеСтроки Цикл
					Если Строка.Статья = Перечисления.СтатьяФрахта.Фрахт20 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаФрахта20;
						Если Данные.СтавкаФрахта20 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
					Если Строка.Статья = Перечисления.СтатьяФрахта.Вознаграждение20 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаВознаграждения20;
						Если Данные.СтавкаВознаграждения20 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
					Если Строка.Статья = Перечисления.СтатьяФрахта.Итого20 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаФрахта20 + Данные.СтавкаВознаграждения20;
						Если Данные.СтавкаФрахта20 <> 0 И Данные.СтавкаВознаграждения20 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
					Если Строка.Статья = Перечисления.СтатьяФрахта.Фрахт40 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаФрахта40;
						Если Данные.СтавкаФрахта40 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
					Если Строка.Статья = Перечисления.СтатьяФрахта.Вознаграждение40 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаВознаграждения40;
						Если Данные.СтавкаВознаграждения40 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
					Если Строка.Статья = Перечисления.СтатьяФрахта.Итого40 Тогда
						Строка[ИмяКолонкиЭлементФормы] = Данные.СтавкаФрахта40 + Данные.СтавкаВознаграждения40;
						Если Данные.СтавкаФрахта40 <> 0 И Данные.СтавкаВознаграждения40 <> 0 Тогда
							Строка["НФ_ИмяПорта_Выбрано_" + SOCилиCOC + "_" + КодПорта] = Истина;
							Строка["НФ_ИмяПорта_Флажок_" + SOCилиCOC + "_" + КодПорта] = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	НФ_ЛинииПорты.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ММ_ПортыОтправленияНазначенияПриИзменении(Элемент)
	
	Если Объект.ММ_ПортыОтправленияНазначения.Количество() > 0 Тогда
		Объект.ММ_ПортОтправления = Объект.ММ_ПортыОтправленияНазначения[0].Порт;
	Иначе
		Объект.ММ_ПортОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 06.09.2024 ))

//Евросиб Коханенко Н.А. 19.11.2024 (( #95714 
&НаКлиенте
Процедура УчетноеНаправлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ОграничениеПоДатеИспользования", КонецДня(Объект.Дата))); 
	//Евросиб Коханенко Н.А. 13.12.2024 (( #97643
	СтруктураОтборов = ПараметрыФормы.Отбор;
	СтруктураОтборов.Вставить("РазрешитьВРП", Объект.ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная"));
	//Евросиб Коханенко Н.А. 13.12.2024 )) #97643 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораУчетноеНаправление", ЭтаФорма); 
	
	
	ОткрытьФорму("Справочник.УчетныеНаправления.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, 
					ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);    

КонецПроцедуры //Евросиб Коханенко Н.А. 19.11.2024 )) #95714 
	
//Евросиб Коханенко Н.А. 19.11.2024 (( #95714 
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораУчетноеНаправление(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Объект.УчетноеНаправление = Результат;
	КонецЕсли;   
	
	//Евросиб Коханенко Н.А. 03.02.2025 (( #100979
	стПараметры = Новый Структура("Имя", "УчетноеНаправление");
	СобытиеПодобратьЗначениеПродукта(стПараметры);
	//Евросиб Коханенко Н.А. 03.02.2025 )) #100979 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 19.11.2024 )) #95714 

//Евросиб Коханенко Н.А. 28.11.2024 (( #95714
&НаКлиенте
Процедура УчетноеНаправлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ОграничениеПоДатеИспользования", КонецДня(Объект.Дата));
	//Евросиб Коханенко Н.А. 13.12.2024 (( #97643 
	ПараметрыПолученияДанных.Отбор.Вставить("РазрешитьВРП", Объект.ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная"));
	//Евросиб Коханенко Н.А. 13.12.2024 )) #97643 

КонецПроцедуры //Евросиб Коханенко Н.А. 28.11.2024 )) #95714

//Евросиб Коханенко Н.А. 17.12.2024 (( #97643
&НаКлиенте
Процедура ПС_ВидПеревозки1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("РазрешитьВРП", Объект.ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная")));
	 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораПС_ВидПеревозки1", ЭтаФорма); 
	
	ОткрытьФорму("Справочник.ВидыПеревозок.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, 
					ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
					
КонецПроцедуры //Евросиб Коханенко Н.А. 17.12.2024 )) #97643

//Евросиб Коханенко Н.А. 17.12.2024 (( #97643 
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораПС_ВидПеревозки1(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Объект.ПС_ВидПеревозки = Результат;
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 17.12.2024 )) #97643 

//Евросиб Коханенко Н.А. 17.12.2024 (( #97643 
&НаКлиенте
Процедура ПС_ВидПеревозки1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("РазрешитьВРП", Объект.ТипКалькуляции <> ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная"));

КонецПроцедуры //Евросиб Коханенко Н.А. 17.12.2024 )) #97643

//Евросиб Коханенко Н.А. 23.12.2024 (( #97643 
&НаКлиенте
Процедура ЗаполнитьПС_ВидПеревозки()
	Если Объект.ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная") Тогда
		Объект.ПС_ВидПеревозки = Неопределено;
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 23.12.2024 )) #97643

//Евросиб Коханенко Н.А. 03.02.2025 (( #100979
&НаСервере
Процедура ЗаменитьОбработчикиСобытийКлючевыхПолейПродукта()
		
	СписокКлючевыхРеквизитов = Новый Массив;
	СписокКлючевыхРеквизитов.Добавить("УчетноеНаправление");
	СписокКлючевыхРеквизитов.Добавить("РежимКалькуляции");
	СписокКлючевыхРеквизитов.Добавить("ТипЗаказа");
	СписокКлючевыхРеквизитов.Добавить("ОсновнаяУслуга");
	СписокКлючевыхРеквизитов.Добавить("Суша_ПунктОтправления");
	СписокКлючевыхРеквизитов.Добавить("Суша_ПунктНазначения");
	СписокКлючевыхРеквизитов.Добавить("СписокСтанцийНазначения");
	СписокКлючевыхРеквизитов.Добавить("СписокСтанцийОтправления");
	СписокКлючевыхРеквизитов.Добавить("ММ_КалькуляцияМультимодальнойЦепочки");
	СписокКлючевыхРеквизитов.Добавить("НФ_ЛинииПорты");
	СписокКлючевыхРеквизитов.Добавить("ЦФО");
	СписокКлючевыхРеквизитов.Добавить("Груз");
	                                                   
	Для Каждого КлючевойРеквизит Из СписокКлючевыхРеквизитов Цикл 
		Действие = Элементы[КлючевойРеквизит].ПолучитьДействие("ПриИзменении");
		Если ЗначениеЗаполнено(Действие) Тогда
			нСоответствие = СоответствиеПроцедур.Добавить();
			нСоответствие.Реквизит = КлючевойРеквизит;
			нСоответствие.Процедура = Действие + "(Парам)";
		КонецЕсли; 
		Элементы[КлючевойРеквизит].УстановитьДействие("ПриИзменении", "СобытиеПодобратьЗначениеПродукта");
	КонецЦикла; 
		
КонецПроцедуры //Евросиб Коханенко Н.А. 03.02.2025 )) #100979

//Евросиб Коханенко Н.А. 03.02.2025 (( #100979
&НаКлиенте
Процедура СобытиеПодобратьЗначениеПродукта(Парам=Неопределено);
	
	Если Парам <> Неопределено Тогда
		СтрПроцедура = СоответствиеПроцедур.НайтиСтроки(Новый Структура("Реквизит", Парам.Имя));
		Если СтрПроцедура.Количество() > 0 Тогда
			Выполнить СтрПроцедура[0].Процедура;
		КонецЕсли; 
	КонецЕсли;   
	
	//проверяем, насколько старая дата создания калькуляции для механизма автозаполнения продукта
	Если Объект.Дата >= АвтозаполнениеПродуктаВКалькуляцииСДаты Тогда
		КП = ЗаполнитьКлючевыеПараметрыПродукта(Парам.Имя, КП);
		ВыбранныйПродукт = ПодобратьЗначениеПродукта(КП); 
		Если Объект.ПродуктДКП <> ВыбранныйПродукт Тогда
			Объект.ПродуктДКП = ВыбранныйПродукт;
			//Евросиб Каблов 28.05.2025 ( #109346
			ОбновитьСтоимостьУслуг(Ложь, Истина);
			//Евросиб Каблов 28.05.2025 )
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры //Евросиб Коханенко Н.А. 03.02.2025 )) #100979

//Евросиб Коханенко Н.А. 03.02.2025 (( #100979
&НаСервере
Функция ЗаполнитьКлючевыеПараметрыПродукта(Реквизит=Неопределено, КлючевыеПараметрыПродукта)
	
	ПересчитатьУчетноеНаправление = Ложь;
	ПересчитатьТипЗаказа = Ложь;
	
	РеквизитИмя = Реквизит;
	
	Если РеквизитИмя = Неопределено Тогда
		КлючевыеПараметрыПродукта = Новый Соответствие;
		КлючевыеПараметрыПродукта.Вставить("ФрахтЗаполнен", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УслугиТарифГруженыйЖД", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УслугаПредоставлениеКТК", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УслугаТерминальнаяОбработкаПерегрузНСК", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УчНаправлениеИмпортМорской", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УчНаправлениеМорской", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УчНаправлениеСухопутныйИлиТранзит", Ложь);
		КлючевыеПараметрыПродукта.Вставить("УчНаправлениеРефПеревозки", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииММ", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииКонтейнерныйПоезд", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииРефПеревозки", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииДоплатныеКТК", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииПредоставлениеПСБезТарифа", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииММИлиКонтейнерныйПоезд", Ложь);
		//Евросиб Коханенко Н.А. 24.03.2025 (( #105705 
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииСубсидииПремии", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииМежсервисныеРасходы", Ложь);
		//Евросиб Коханенко Н.А. 24.03.2025 )) #105705 
		//Евросиб Коханенко Н.А. 01.08.2025 (( # 115687
		КлючевыеПараметрыПродукта.Вставить("ТипКалькуляцииДоплатныеПВ", Ложь);
		//Евросиб Коханенко Н.А. 01.08.2025 )) # 115687
		КлючевыеПараметрыПродукта.Вставить("ТипЗаказаКонтейнерныйПоезд", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипЗаказаПоконтейнернаяОтправка", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипЗаказаПредоставлениеВагонов", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ТипЗаказаАвтоперевозка", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ОсновнаяУслугаТЭУ", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ОсновнаяУслугаФрахт", Ложь);
		КлючевыеПараметрыПродукта.Вставить("Погранпереход", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ЦФОТерминалНСК", Ложь);
		КлючевыеПараметрыПродукта.Вставить("ГрузКонтейнерыПорожние", Ложь);
		Все = Истина;
	Иначе
		Все = Ложь;
	КонецЕсли;
		
	//условие ФрахтЗаполнен
	Если Все ИЛИ РеквизитИмя = "НФ_ЛинииПорты" Тогда 
		ФрахтЗаполнен = Ложь;
		
		МассивРеквизитовФормы = Новый Массив;
		Для каждого Стр из ЭтаФорма.ПолучитьРеквизиты("НФ_ЛинииПорты") Цикл
			Если СтрНачинаетсяС(Стр.Имя,"НФ_ИмяПорта") Тогда 
				МассивРеквизитовФормы.Добавить(Стр.Имя); 
			КонецЕсли;
		КонецЦикла;
		
		КоличествоРеквизитов = МассивРеквизитовФормы.Количество();
		
		Если КоличествоРеквизитов >=3 Тогда
			Для Каждого СтрокаТЧ Из НФ_ЛинииПорты Цикл
				Если СтрокаТЧ.Статья = Перечисления.СтатьяФрахта.Итого20 
					ИЛИ	СтрокаТЧ.Статья = Перечисления.СтатьяФрахта.Итого40 Тогда
					Для НомерКолонки = 0 По Цел(КоличествоРеквизитов/3)-1 Цикл 
						Если ЗначениеЗаполнено(СтрокаТЧ[МассивРеквизитовФормы[НомерКолонки*3]])
							И СтрокаТЧ[МассивРеквизитовФормы[НомерКолонки*3+2]] 
							И СтрокаТЧ[МассивРеквизитовФормы[НомерКолонки*3]] > 0 Тогда
							ФрахтЗаполнен = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ФрахтЗаполнен Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		КлючевыеПараметрыПродукта["ФрахтЗаполнен"] = ФрахтЗаполнен;
	КонецЕсли;
	
	//условия наличия услуг в табл.1.3
	Если Все ИЛИ РеквизитИмя = "ММ_КалькуляцияМультимодальнойЦепочки" Тогда 
		УслугиТарифГруженыйЖД = Ложь;
		УслугаПредоставлениеКТК = Ложь;
		УслугаТерминальнаяОбработкаПерегрузНСК = Ложь;
		Для Каждого СтрокаТЧ Из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если СтрокаТЧ.Услуга = Справочники.Номенклатура.ГруженыйЖДтарифРФ 
					ИЛИ СтрокаТЧ.Услуга = Справочники.Номенклатура.ГруженыйЖДтарифПрочТерритории Тогда
				УслугиТарифГруженыйЖД = Истина;
			ИначеЕсли СтрокаТЧ.Услуга = Справочники.Номенклатура.ПредоставлениеКТК Тогда 
				УслугаПредоставлениеКТК = Истина;
			ИначеЕсли СтрокаТЧ.Услуга = Справочники.Номенклатура.ТерминальнаяОбработкаПерегрузНСК Тогда 
				УслугаТерминальнаяОбработкаПерегрузНСК = Истина;
			КонецЕсли;
		КонецЦикла;
		КлючевыеПараметрыПродукта["УслугиТарифГруженыйЖД"] = УслугиТарифГруженыйЖД;
		КлючевыеПараметрыПродукта["УслугаПредоставлениеКТК"] = УслугаПредоставлениеКТК;
		КлючевыеПараметрыПродукта["УслугаТерминальнаяОбработкаПерегрузНСК"] = УслугаТерминальнаяОбработкаПерегрузНСК;
	КонецЕсли;
	
	//условия ТипКалькуляции
	Если Все ИЛИ РеквизитИмя = "РежимКалькуляции" Тогда 
		ОбъектТипКалькуляции = Объект.ТипКалькуляции;
		
		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.Мультимодальная Тогда
			ТипКалькуляцииММ = Истина;
		Иначе
			ТипКалькуляцииММ = Ложь;
		КонецЕсли;
		
		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.КонтейнерныйПоезд Тогда
			ТипКалькуляцииКонтейнерныйПоезд = Истина;
		Иначе
			ТипКалькуляцииКонтейнерныйПоезд = Ложь;
		КонецЕсли;

		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.РефрижераторныеПеревозки Тогда
			ТипКалькуляцииРефПеревозки = Истина;
		Иначе
			ТипКалькуляцииРефПеревозки = Ложь;
		КонецЕсли;

		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные Тогда
			ТипКалькуляцииДоплатныеКТК = Истина;
		Иначе
			ТипКалькуляцииДоплатныеКТК = Ложь;
		КонецЕсли;

		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого Тогда
			ТипКалькуляцииПредоставлениеПСБезТарифа = Истина;
			//при смене Типа калькуляции изменяется значение Типа заказа, поэтому пересчитаем и по нему
			ПересчитатьТипЗаказа = Истина;
		Иначе
			ТипКалькуляцииПредоставлениеПСБезТарифа = Ложь;
		КонецЕсли;

		Если ТипКалькуляцииММ 
				ИЛИ ТипКалькуляцииКонтейнерныйПоезд Тогда
			ТипКалькуляцииММИлиКонтейнерныйПоезд = Истина;
		Иначе
			ТипКалькуляцииММИлиКонтейнерныйПоезд = Ложь;
		КонецЕсли;           
		
		//Евросиб Коханенко Н.А. 24.03.2025 (( #105705
		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии 
				ИЛИ ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.Премии Тогда
			ТипКалькуляцииСубсидииПремии = Истина;
		Иначе
			ТипКалькуляцииСубсидииПремии = Ложь;
		КонецЕсли;           
		
		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
				ИЛИ ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф Тогда
			ТипКалькуляцииМежсервисныеРасходы = Истина;
		Иначе
			ТипКалькуляцииМежсервисныеРасходы = Ложь;
		КонецЕсли;  
		КлючевыеПараметрыПродукта["ТипКалькуляцииСубсидииПремии"] = ТипКалькуляцииСубсидииПремии;
		КлючевыеПараметрыПродукта["ТипКалькуляцииМежсервисныеРасходы"] = ТипКалькуляцииМежсервисныеРасходы;
		//Евросиб Коханенко Н.А. 24.03.2025 )) #105705
		
		//Евросиб Коханенко Н.А. 01.08.2025 (( #115687
		Если ОбъектТипКалькуляции = Перечисления.ТипыКалькуляций.ДоплатныеПВ Тогда
			ТипКалькуляцииДоплатныеПВ = Истина;
		Иначе
			ТипКалькуляцииДоплатныеПВ = Ложь;
		КонецЕсли;
		КлючевыеПараметрыПродукта["ТипКалькуляцииДоплатныеПВ"] = ТипКалькуляцииДоплатныеПВ;
		//Евросиб Коханенко Н.А. 01.08.2025 )) #115687 

		КлючевыеПараметрыПродукта["ТипКалькуляцииММ"] = ТипКалькуляцииММ;
		КлючевыеПараметрыПродукта["ТипКалькуляцииКонтейнерныйПоезд"] = ТипКалькуляцииКонтейнерныйПоезд;
		КлючевыеПараметрыПродукта["ТипКалькуляцииРефПеревозки"] = ТипКалькуляцииРефПеревозки;
		КлючевыеПараметрыПродукта["ТипКалькуляцииДоплатныеКТК"] = ТипКалькуляцииДоплатныеКТК;
		КлючевыеПараметрыПродукта["ТипКалькуляцииПредоставлениеПСБезТарифа"] = ТипКалькуляцииПредоставлениеПСБезТарифа;
		КлючевыеПараметрыПродукта["ТипКалькуляцииММИлиКонтейнерныйПоезд"] = ТипКалькуляцииММИлиКонтейнерныйПоезд;
		
		//при смене Типа калькуляции изменяется значение Учетного направления, поэтому пересчитаем и по нему
		ПересчитатьУчетноеНаправление = Истина;
 	КонецЕсли;

	//условия УчетноеНаправление
	Если Все ИЛИ РеквизитИмя = "УчетноеНаправление" ИЛИ ПересчитатьУчетноеНаправление Тогда 
		ОбъектУчетноеНаправление = Объект.УчетноеНаправление;
		
		Если ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.ИмпортМорской Тогда
			УчНаправлениеИмпортМорской = Истина;
		Иначе
			УчНаправлениеИмпортМорской = Ложь;
		КонецЕсли;
		
		Если ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.ЭкспортМорской
				ИЛИ УчНаправлениеИмпортМорской Тогда
			УчНаправлениеМорской = Истина;
		Иначе
			УчНаправлениеМорской = Ложь;
		КонецЕсли;
			
		Если ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.ИмпортСухопутный
				ИЛИ ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.ЭкспортСухопутный
				ИЛИ ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.Транзит Тогда
			УчНаправлениеСухопутныйИлиТранзит = Истина;
		Иначе
			УчНаправлениеСухопутныйИлиТранзит = Ложь;
		КонецЕсли;
		
		Если ОбъектУчетноеНаправление = Справочники.УчетныеНаправления.РефрижераторныеПеревозки Тогда
	        УчНаправлениеРефПеревозки = Истина;
		Иначе
	        УчНаправлениеРефПеревозки = Ложь;
		КонецЕсли;
		КлючевыеПараметрыПродукта["УчНаправлениеИмпортМорской"] = УчНаправлениеИмпортМорской;
		КлючевыеПараметрыПродукта["УчНаправлениеМорской"] = УчНаправлениеМорской;
		КлючевыеПараметрыПродукта["УчНаправлениеСухопутныйИлиТранзит"] = УчНаправлениеСухопутныйИлиТранзит;
		КлючевыеПараметрыПродукта["УчНаправлениеРефПеревозки"] = УчНаправлениеРефПеревозки;
	КонецЕсли;

	//условия ТипЗаказа 
	Если Все ИЛИ РеквизитИмя = "ТипЗаказа" ИЛИ ПересчитатьТипЗаказа Тогда 
		ОбъектТипЗаказа = Объект.ТипЗаказа;
		
		Если ОбъектТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд Тогда
		    ТипЗаказаКонтейнерныйПоезд = Истина;
		Иначе	
		    ТипЗаказаКонтейнерныйПоезд = Ложь; 
		КонецЕсли;
		
		Если ОбъектТипЗаказа = Справочники.ТипыЗаказов.ПоконтейнернаяОтправка Тогда
		    ТипЗаказаПоконтейнернаяОтправка = Истина;
		Иначе	
		    ТипЗаказаПоконтейнернаяОтправка = Ложь;
		КонецЕсли;
		
		Если ТипЗаказаКонтейнерныйПоезд
				ИЛИ ТипЗаказаПоконтейнернаяОтправка Тогда
			ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка = Истина;
		Иначе	
		    ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка = Ложь;
		КонецЕсли;
		Если ОбъектТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка Тогда
		    ТипЗаказаПредоставлениеВагонов = Истина; 
		Иначе	
		    ТипЗаказаПредоставлениеВагонов = Ложь;
		КонецЕсли;
		
		Если ОбъектТипЗаказа = Справочники.ТипыЗаказов.Автоперевозка Тогда
		    ТипЗаказаАвтоперевозка = Истина;
		Иначе	
		    ТипЗаказаАвтоперевозка = Ложь;
		КонецЕсли;
		КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] = ТипЗаказаКонтейнерныйПоезд;
		КлючевыеПараметрыПродукта["ТипЗаказаПоконтейнернаяОтправка"] = ТипЗаказаПоконтейнернаяОтправка;
		КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка"] = ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка;
		КлючевыеПараметрыПродукта["ТипЗаказаПредоставлениеВагонов"] = ТипЗаказаПредоставлениеВагонов;
		КлючевыеПараметрыПродукта["ТипЗаказаАвтоперевозка"] = ТипЗаказаАвтоперевозка;
	КонецЕсли;

	//условия ОсновнаяУслуга
	Если Все ИЛИ РеквизитИмя = "ОсновнаяУслуга" Тогда 
		ОбъектОсновнаяУслуга = Объект.ОсновнаяУслуга;
	 
		 Если ОбъектОсновнаяУслуга = Справочники.Номенклатура.ТЭУ Тогда
		    ОсновнаяУслугаТЭУ = Истина;
		Иначе	
		    ОсновнаяУслугаТЭУ = Ложь;
		КонецЕсли;
		
		Если ОбъектОсновнаяУслуга = Справочники.Номенклатура.Фрахт Тогда
		    ОсновнаяУслугаФрахт = Истина;
		Иначе	
		    ОсновнаяУслугаФрахт = Ложь;
		КонецЕсли;
		КлючевыеПараметрыПродукта["ОсновнаяУслугаТЭУ"] = ОсновнаяУслугаТЭУ;
		КлючевыеПараметрыПродукта["ОсновнаяУслугаФрахт"] = ОсновнаяУслугаФрахт;
	КонецЕсли;

	//Условие Погранпереход
	Если Все ИЛИ РеквизитИмя = "Суша_ПунктОтправления" 
			 ИЛИ РеквизитИмя = "Суша_ПунктНазначения" 
			 ИЛИ РеквизитИмя = "СписокСтанцийОтправления" 
			 ИЛИ РеквизитИмя = "СписокСтанцийНазначения" Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛокацииПунктов.Значение КАК Локация
			|ПОМЕСТИТЬ вт_СписокСтанцийНазначения
			|ИЗ
			|	&СписокСтанцийНазначения КАК ЛокацииПунктов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛокацииПунктов.Значение КАК Локация
			|ПОМЕСТИТЬ вт_СписокСтанцийОтправления
			|ИЗ
			|	&СписокСтанцийОтправления КАК ЛокацииПунктов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&ПунктНазначения КАК Локация
			|ПОМЕСТИТЬ вт_Локации
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	&ПунктОтправления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	вт_СписокСтанцийНазначения.Локация
			|ИЗ
			|	вт_СписокСтанцийНазначения КАК вт_СписокСтанцийНазначения
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	вт_СписокСтанцийОтправления.Локация
			|ИЗ
			|	вт_СписокСтанцийОтправления КАК вт_СписокСтанцийОтправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Локации.Наименование КАК Наименование,
			|	Локации.Погранпереход КАК Погранпереход
			|ИЗ
			|	вт_Локации КАК вт_Локации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
			|		ПО вт_Локации.Локация = Локации.Ссылка
			|ГДЕ
			|	Локации.Погранпереход = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ПунктНазначения", Объект.Суша_ПунктНазначения);
		Запрос.УстановитьПараметр("ПунктОтправления", Объект.Суша_ПунктОтправления);
		Запрос.УстановитьПараметр("СписокСтанцийНазначения", СписокСтанцийНазначения);
		Запрос.УстановитьПараметр("СписокСтанцийОтправления", СписокСтанцийОтправления);
		РезультатЗапроса = Запрос.Выполнить();
		Погранпереход = НЕ РезультатЗапроса.Пустой();
		КлючевыеПараметрыПродукта["Погранпереход"] = Погранпереход;
	КонецЕсли;
	
	//условие ЦФО
	Если Все ИЛИ РеквизитИмя = "ЦФО" Тогда 
		Если Объект.ЦФО = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
			ЦФОТерминалНСК = Истина; 
		Иначе
			ЦФОТерминалНСК = Ложь; 
		КонецЕсли;
		КлючевыеПараметрыПродукта["ЦФОТерминалНСК"] = ЦФОТерминалНСК;
	КонецЕсли;
	
	//условие Груз
	Если Все ИЛИ РеквизитИмя = "Груз" Тогда 
		Если Объект.Груз = Перечисления.ТипыГрузов.КонтейнерыПорожние Тогда
			ГрузКонтейнерыПорожние = Истина; 
		Иначе
			ГрузКонтейнерыПорожние = Ложь; 
		КонецЕсли;
		КлючевыеПараметрыПродукта["ГрузКонтейнерыПорожние"] = ГрузКонтейнерыПорожние;
	КонецЕсли;
	
	Возврат КлючевыеПараметрыПродукта;

КонецФункции //Евросиб Коханенко Н.А. 03.02.2025 )) #100979

//Евросиб Коханенко Н.А. 03.02.2025 (( #100979
&НаСервере
Функция ПодобратьЗначениеПродукта(КлючевыеПараметрыПродукта)
		
	Если КлючевыеПараметрыПродукта["УчНаправлениеМорской"] 
		И КлючевыеПараметрыПродукта["ТипКалькуляцииММ"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["ФрахтЗаполнен"] 
		И КлючевыеПараметрыПродукта["ОсновнаяУслугаТЭУ"] Тогда
		Результат = Справочники.ПродуктыДКП.ММморской;
	ИначеЕсли КлючевыеПараметрыПродукта["УчНаправлениеСухопутныйИлиТранзит"] 
		И КлючевыеПараметрыПродукта["ТипКалькуляцииММ"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["УслугаПредоставлениеКТК"] 
		И КлючевыеПараметрыПродукта["Погранпереход"] Тогда
		Результат = Справочники.ПродуктыДКП.ММсухопутный;
	ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["УслугиТарифГруженыйЖД"] 
		И НЕ КлючевыеПараметрыПродукта["ФрахтЗаполнен"] Тогда
		Результат = Справочники.ПродуктыДКП.МестоВПоезде;
	ИначеЕсли КлючевыеПараметрыПродукта["УчНаправлениеРефПеревозки"] 
		И КлючевыеПараметрыПродукта["ТипКалькуляцииРефПеревозки"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоездИлиПоконтейнернаяОтправка"] Тогда
		Результат = Справочники.ПродуктыДКП.ЭлектроместоВПоезде;
	//Евросиб Коханенко Н.А. 02.04.2025 (( #106241 
	//ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииПредоставлениеПСБезТарифа"] 
	//	И КлючевыеПараметрыПродукта["ТипЗаказаПредоставлениеВагонов"]
	ИначеЕсли КлючевыеПараметрыПродукта["ТипЗаказаПредоставлениеВагонов"]
	//Евросиб Коханенко Н.А. 02.04.2025 )) #106241 
		//Евросиб Коханенко Н.А. 01.08.2025 (( #115687 
		//И НЕ КлючевыеПараметрыПродукта["УслугиТарифГруженыйЖД"] Тогда
		И НЕ КлючевыеПараметрыПродукта["УслугиТарифГруженыйЖД"] 
		ИЛИ КлючевыеПараметрыПродукта["ТипКалькуляцииДоплатныеПВ"] Тогда 
		//Евросиб Коханенко Н.А. 01.08.2025 )) #115687 
		Результат = Справочники.ПродуктыДКП.СдачаВагонаВПользование;
	ИначеЕсли КлючевыеПараметрыПродукта["УчНаправлениеМорской"] 
		И КлючевыеПараметрыПродукта["ТипКалькуляцииММ"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаПоконтейнернаяОтправка"] 
		И КлючевыеПараметрыПродукта["ФрахтЗаполнен"] 
		И КлючевыеПараметрыПродукта["ОсновнаяУслугаФрахт"] 
		И НЕ КлючевыеПараметрыПродукта["УслугиТарифГруженыйЖД"] Тогда
		Результат = Справочники.ПродуктыДКП.АвтономныйФрахтШиппинг;
	ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииММИлиКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаПоконтейнернаяОтправка"] Тогда
		Результат = Справочники.ПродуктыДКП.ОдиночнаяКонтейнернаяОтправка;
	ИначеЕсли КлючевыеПараметрыПродукта["ТипЗаказаАвтоперевозка"] 
		И КлючевыеПараметрыПродукта["ЦФОТерминалНСК"] Тогда
		Результат = Справочники.ПродуктыДКП.АвтономнаяАвтодоставка;
	ИначеЕсли КлючевыеПараметрыПродукта["УчНаправлениеИмпортМорской"] 
		И КлючевыеПараметрыПродукта["ТипКалькуляцииММ"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["УслугаТерминальнаяОбработкаПерегрузНСК"] Тогда
		Результат = Справочники.ПродуктыДКП.ПерегрузПВ;
	ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииДоплатныеКТК"] 
		И КлючевыеПараметрыПродукта["ТипЗаказаКонтейнерныйПоезд"] 
		И КлючевыеПараметрыПродукта["ГрузКонтейнерыПорожние"] Тогда
		Результат = Справочники.ПродуктыДКП.ВыдачаКТКВРынок;
	//Евросиб Коханенко Н.А. 24.03.2025 (( #105705 
	ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииСубсидииПремии"] Тогда 
		Результат = Справочники.ПродуктыДКП.РелокацияКонтейнера;
	ИначеЕсли КлючевыеПараметрыПродукта["ТипКалькуляцииМежсервисныеРасходы"] Тогда 
		Результат = Справочники.ПродуктыДКП.МежсервисныеРасходы;
	//Евросиб Коханенко Н.А. 24.03.2025 )) #105705 
	КонецЕсли;

	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 03.02.2025 )) #100979

//Евросиб Коханенко Н.А. 18.03.2025 (( #100979
&НаКлиенте
Процедура СписокСтанцийНазначенияПриИзменении(Элемент)
	//Не удалять! Необходима для автоподбора Продукта ДКП
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры //Евросиб Коханенко Н.А. 18.03.2025 )) #100979

//Евросиб Коханенко Н.А. 18.03.2025 (( #100979
&НаКлиенте
Процедура СписокСтанцийОтправленияПриИзменении(Элемент)
	//Не удалять! Необходима для автоподбора Продукта ДКП
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры //Евросиб Коханенко Н.А. 18.03.2025 )) #100979

//Евросиб Коханенко Н.А. 18.03.2025 (( #100979
&НаКлиенте
Процедура УчетноеНаправлениеПриИзменении(Элемент)
	//Не удалять! Необходима для автоподбора Продукта ДКП
	
	//Евросиб Каблов 28.05.2025 ( #109346
	ОбновитьСтоимостьУслуг(Ложь, Истина);
	//Евросиб Каблов 28.05.2025 )	
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры //Евросиб Коханенко Н.А. 18.03.2025 )) #100979

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПлановаяСтоимостьИзЖДНПриИзменении(Элемент)
	
	//Евросиб Каблов 24.03.2025 ( #100520
	ТекДанные = Элементы.ММ_КалькуляцияМультимодальнойЦепочки.ТекущиеДанные;
	Если ТекДанные.ПлановаяСтоимостьИзЖДН Тогда
		Если ЗначениеЗаполнено(ТекДанные.Услуга) Тогда
			ЭтоТариф = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.Услуга, "ЭтоТариф");
			Если Не ЭтоТариф Тогда
				ТекДанные.ПлановаяСтоимостьИзЖДН = Ложь;
				ТекстСообщения = СтрШаблон("Недопустимо сумму плановых расходов в сделке указывать из ЖДн для номенклатуры %1", ТекДанные.Услуга);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 24.03.2025 )
	
КонецПроцедуры

&НаСервере
//Евросиб Каблов 28.05.2025 ( #109346
Процедура ОбработатьИзменениеУслугиММ_КалькуляцияМультимодальнойЦепочки(ТекДанные, ПараметрыТарифа = Неопределено)
//Евросиб Каблов 28.05.2025 )
	
	ТекДанные.НормативныйПроцентВознаграждения20 = ПроцентВознагражденияУслуги(ТекДанные.Услуга, Объект.Дата);
	ТекДанные.НормативныйПроцентВознаграждения40 = ТекДанные.НормативныйПроцентВознаграждения20;
	
	ТекДанные.Вознаграждение20 = ТекДанные.НормативныйПроцентВознаграждения20;
	ТекДанные.Вознаграждение40 = ТекДанные.НормативныйПроцентВознаграждения40;
	
	Если ТекДанные.Услуга = ПредопределенноеЗначение("Справочник.Номенклатура.МодернизацияТерминала") Тогда	
		ТекДанные.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		ТекДанные.НДСВключенВСтоимость = Ложь;
		
		Если Объект.ТарифицируемыйРазмерКТК = "20" Тогда
			ТекДанные.Цена20 = 1500;			
		ИначеЕсли Объект.ТарифицируемыйРазмерКТК = "40" Тогда 
			ТекДанные.Цена40 = 1500;
		ИначеЕсли Объект.ТарифицируемыйРазмерКТК = "2040" Тогда
			ТекДанные.Цена20 = 1500;
			ТекДанные.Цена40 = 1500;
		КонецЕсли;
		ТекДанные.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль");
	//Евросиб Каблов 28.05.2025 ( #109346	
	ИначеЕсли ЗначениеЗаполнено(ПараметрыТарифа) Тогда
		//Евросиб Шевченко А.В. US 115279 TA 119764 25.12.2025
		Если Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон ИЛИ Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.teu Тогда
			
			Если ТекДанные.Услуга = Справочники.Номенклатура.НакладныеРасходы
				Или ТекДанные.Услуга = Справочники.Номенклатура.МежсервисныеРасходы
				Или ТекДанные.Услуга = Справочники.Номенклатура.ПредоставлениеПлатформ Тогда 
				
				Если Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.НакладныеРасходы Тогда
						ТекДанные.Цена40 = ПараметрыТарифа.СтоимостьБезНДС * 2;
						ТекДанные.Валюта = ПараметрыТарифа.Валюта;
						ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
					КонецЕсли;
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.МежсервисныеРасходы Тогда
						
						РазмерТЕУ = ПолучитьРазмерТЕУ(Объект.ЖД_РасчетСебестоимостиДляТипаФГП);	
						ТекДанные.Цена40 = ПараметрыТарифа.СтоимостьБезНДС * РазмерТЕУ;
						ТекДанные.Валюта = ПараметрыТарифа.Валюта;
						ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
						
					КонецЕсли;
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.ПредоставлениеПлатформ Тогда
						
						РазмерТЕУ = ПолучитьРазмерТЕУ(Объект.ЖД_РасчетСебестоимостиДляТипаФГП);	
						ТекДанные.Цена40 = Объект.ММ_СтавкаПредоставленияПлатформы * Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней");
						ТекДанные.Валюта = Справочники.Валюты.Рубль;
						ТекДанные.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.teu Тогда
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.НакладныеРасходы Тогда
						ТекДанные.Цена20 = ПараметрыТарифа.СтоимостьБезНДС;
						ТекДанные.Валюта = ПараметрыТарифа.Валюта;
						ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
					КонецЕсли;
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.МежсервисныеРасходы Тогда
						
						РазмерТЕУ = ПолучитьРазмерТЕУ(Объект.ЖД_РасчетСебестоимостиДляТипаФГП);	
						ТекДанные.Цена20 = ПараметрыТарифа.СтоимостьБезНДС;
						ТекДанные.Валюта = ПараметрыТарифа.Валюта;
						ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
						
					КонецЕсли;
					
					Если ТекДанные.Услуга = Справочники.Номенклатура.ПредоставлениеПлатформ Тогда
						
						РазмерТЕУ = ПолучитьРазмерТЕУ(Объект.ЖД_РасчетСебестоимостиДляТипаФГП);	
						ТекДанные.Цена20 = (Объект.ММ_СтавкаПредоставленияПлатформы * Объект.ММ_КалькуляцияЖДСоставляющей.Итог("ДлительностьДней")) / РазмерТЕУ;
						ТекДанные.Валюта = Справочники.Валюты.Рубль;
						ТекДанные.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;   
		//Евросиб Шевченко А.В. US 115279 TA 119764 25.12.2025	
		Иначе
			
		Если ТекДанные.Услуга = Справочники.Номенклатура.НакладныеРасходы
			Или ТекДанные.Услуга = Справочники.Номенклатура.МежсервисныеРасходы Тогда
			
			Если Найти(Объект.ТарифицируемыйРазмерКТК, "20") > 0 Тогда
				ТекДанные.Цена20 = ПараметрыТарифа.СтоимостьБезНДС;
				ТекДанные.Валюта = ПараметрыТарифа.Валюта;
				ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
			Иначе
				ТекДанные.Цена20 = 0;	
			КонецЕсли;
			
			Если Найти(Объект.ТарифицируемыйРазмерКТК, "40") > 0 Тогда
				ТекДанные.Цена40 = ПараметрыТарифа.СтоимостьБезНДС * 2;
				ТекДанные.Валюта = ПараметрыТарифа.Валюта;
				ТекДанные.СтавкаНДС = ПараметрыТарифа.СтавкаНДС;
			Иначе
				ТекДанные.Цена40 = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		КонецЕсли;
	
	//Евросиб Каблов 28.05.2025 )	
	КонецЕсли;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ТекДанные.ПунктОтправления, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если Не ЛокацияСоответствуетУслуге Тогда
		ТекДанные.ПунктОтправления = Неопределено;
	КонецЕсли;
	
	СтрокаДоступныеТипы = Неопределено;
	СтрокаТипЛокации = Неопределено;
	ЛокацияСоответствуетУслуге = НоменклатураСервер.ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(ТекДанные.Услуга, ТекДанные.ПунктНазначения, СтрокаТипЛокации, СтрокаДоступныеТипы); 
	Если Не ЛокацияСоответствуетУслуге Тогда
		ТекДанные.ПунктНазначения = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Услуга) Тогда
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Услуга, "ЭтоТариф");
		Если ТекДанные.ПлановаяСтоимостьИзЖДН И Не ЗначенияРеквизитовНоменклатуры.ЭтоТариф Тогда
			ТекДанные.ПлановаяСтоимостьИзЖДН = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
	
&НаСервере
Процедура РассчитатьВознаграждение() //Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	
	ПараметрыКурса = Новый Соответствие;
	Валюта = Объект.Валюта;
	КурсВручную = Ложь;
	
	Себестоимость20 = 0;
	Себестоимость40 = 0;
	
	ИтогСтавка13_20_СуммаНДС = 0;
	ИтогСтавка13_40_СуммаНДС = 0;
	
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;	
		
		ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Справочники.Валюты.Рубль);
		ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.Рубль, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
		ПараметрыКурса.Вставить(Справочники.Валюты.Рубль, ПараметрыКурсаДокумента);

		ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
		Если ПараметрыКурсаСтроки = неопределено Тогда
			ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
			ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
		КонецЕсли;
		
		Цена20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		Цена40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		
		Себестоимость20 = Себестоимость20 + Цена20;
		Себестоимость40 = Себестоимость40 + Цена40;
		
		Если Стр.НДСВключенВСтоимость Тогда
			чСтавкаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Себестоимость20 = Себестоимость20 - Цена20* чСтавкаНДС / (100 + чСтавкаНДС);
			Себестоимость40 = Себестоимость40 - Цена40* чСтавкаНДС / (100 + чСтавкаНДС);
		КонецЕсли;
		
	КонецЦикла;	

	//Если Себестоимость40 > 0 Тогда
	//	Себестоимость40 = Себестоимость40 / 2;
	//КонецЕсли;	
	
	//ИтогСтавка13_20 = Объект.ММ_Ставка20_1_3;
	//ИтогСтавка13_40 = Объект.ММ_Ставка40_1_3;
	
	ИтогСтавка13_20 = ММ_СтавкаИтого20;
	ИтогСтавка13_40 = ММ_СтавкаИтого;
	
	Если Объект.ЗафиксироватьКурс ИЛИ КурсВручную Тогда
		ПараметрыКурсаДокумента = Новый Структура;
		ПараметрыКурсаДокумента.Вставить("Валюта",Валюта);
		ПараметрыКурсаДокумента.Вставить("ДатаКурса",Объект.ДатаКурса);
		ПараметрыКурсаДокумента.Вставить("Кратность",1);
		ПараметрыКурсаДокумента.Вставить("Курс",Объект.Курс);
	Иначе
		ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
	КонецЕсли;

    ПараметрыКурсаПересчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.Рубль, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
	
	ИтогСтавка13_20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ИтогСтавка13_20, ПараметрыКурсаДокумента, ПараметрыКурсаПересчета);
	ИтогСтавка13_40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ИтогСтавка13_40, ПараметрыКурсаДокумента, ПараметрыКурсаПересчета);
	
	Если Объект.СуммаВключаетНДС Тогда
		
		ПроцентНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
		
		ИтогСтавка13_20_СуммаНДС   = Окр(ИтогСтавка13_20 * ПроцентНДС / (100 + ПроцентНДС), 2);
		ИтогСтавка13_20 = ИтогСтавка13_20 - ИтогСтавка13_20_СуммаНДС;
		
		ИтогСтавка13_40_СуммаНДС   = Окр(ИтогСтавка13_40 * ПроцентНДС / (100 + ПроцентНДС), 2);
		ИтогСтавка13_40 = ИтогСтавка13_40 - ИтогСтавка13_40_СуммаНДС;
	КонецЕсли;
	
	Объект.ММ_ИтогоВознаграждение20БезНДСРуб =  ИтогСтавка13_20 - Себестоимость20;
	Объект.ММ_ИтогоВознаграждениеБезНДСРуб =  ИтогСтавка13_40 - Себестоимость40;
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьРасчетнуюКонтрибуцию() //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	ПараметрыКурса = Новый Соответствие;
	Валюта = Объект.Валюта;
	КурсВручную = Ложь;
	
	РасчетнаяКонтрибуция20 = 0;
	РасчетнаяКонтрибуция40 = 0;
	
	Для каждого Стр из Объект.ММ_КалькуляцияМультимодальнойЦепочки Цикл
		
		Если Стр.ОсновнаяУслугаГруппы = Ложь И ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Продолжить; КонецЕсли;
		
		Если Стр.Услуга.ИсключатьИзРасчетнойКонтрибуции Тогда
			Продолжить;
		КонецЕсли;	
		
		ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Справочники.Валюты.Рубль);
		ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.Рубль, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
		ПараметрыКурса.Вставить(Справочники.Валюты.Рубль, ПараметрыКурсаДокумента);

		ПараметрыКурсаСтроки = ПараметрыКурса.Получить(Стр.Валюта);
		Если ПараметрыКурсаСтроки = неопределено Тогда
			ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
			ПараметрыКурса.Вставить(Стр.Валюта, ПараметрыКурсаСтроки);
		КонецЕсли;
		
		Цена20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		Цена40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
		
		РасчетнаяКонтрибуция20 = РасчетнаяКонтрибуция20 + Цена20;
		РасчетнаяКонтрибуция40 = РасчетнаяКонтрибуция40 + Цена40;
		
		Если Стр.НДСВключенВСтоимость Тогда
			чСтавкаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			РасчетнаяКонтрибуция20 = РасчетнаяКонтрибуция20 - Цена20* чСтавкаНДС / (100 + чСтавкаНДС);
			РасчетнаяКонтрибуция40 = РасчетнаяКонтрибуция40 - Цена40* чСтавкаНДС / (100 + чСтавкаНДС);
		КонецЕсли;
		
	КонецЦикла;	
	Если Объект.ЕдиницаИзмерения <> ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда	
		Если РасчетнаяКонтрибуция40 > 0 Тогда
			РасчетнаяКонтрибуция40 = РасчетнаяКонтрибуция40 / 2;
		КонецЕсли;	
	КонецЕсли;
	Возн40 = 0;
	Возн20 = 0;
	Итог40 = 0;
	Итог20 = 0;
	
	КолонкиТЗ = НФ_ЛинииПорты.Выгрузить().Колонки;
	
	мСтавок20 = Новый СписокЗначений;
	мСтавок40 = Новый СписокЗначений;
	
	тСтавок20 = Новый ТаблицаЗначений;
	тСтавок20.Колонки.Добавить("Возн20");
	тСтавок20.Колонки.Добавить("Итог20");
	тСтавок40 = Новый ТаблицаЗначений;
	тСтавок40.Колонки.Добавить("Возн40");
	тСтавок40.Колонки.Добавить("Итог40");
	
	Для Каждого Кол Из КолонкиТЗ Цикл	
		Если (НЕ СтрНайти(Кол.Имя,"SOC") = 0 ИЛИ НЕ СтрНайти(Кол.Имя,"COC") = 0) И 
			СтрНайти(Кол.Имя,"Выбрано") = 0 И
			СтрНайти(Кол.Имя,"Флажок") = 0 Тогда
			ТекКолонка = Кол.Имя;
			Для Каждого СтрТз Из НФ_ЛинииПорты Цикл
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Вознаграждение40 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Возн40 = СтрТз[ТекКолонка];
				КонецЕсли;
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Вознаграждение20 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Возн20 = СтрТз[ТекКолонка];
				КонецЕсли;
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Итого40 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Итог40 = СтрТз[ТекКолонка];
				КонецЕсли;
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Итого20 И ЗначениеЗаполнено(СтрТз[ТекКолонка]) Тогда
					Итог20 = СтрТз[ТекКолонка];
				КонецЕсли;
				Если СтрТз.Статья = Перечисления.СтатьяФрахта.Валюта Тогда
					
					ПараметрыКурсаДокумента = ПараметрыКурса.Получить(Справочники.Валюты.Рубль);
					ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.Рубль, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
					ПараметрыКурса.Вставить(Справочники.Валюты.Рубль, ПараметрыКурсаДокумента);

					ПараметрыКурсаСтроки = ПараметрыКурса.Получить(СтрТз[ТекКолонка]);
					Если ПараметрыКурсаСтроки = неопределено Тогда
						ПараметрыКурсаСтроки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрТз[ТекКолонка], ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
						ПараметрыКурса.Вставить(СтрТз[ТекКолонка], ПараметрыКурсаСтроки);
					КонецЕсли;
					Возн20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Возн20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
					Возн40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Возн40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
					
					Итог20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Итог20, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
					Итог40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Итог40, ПараметрыКурсаСтроки, ПараметрыКурсаДокумента);
					
					Если Объект.СуммаВключаетНДСФрахт Тогда
						
						ПроцентНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.НДСФрахт);
						
						Возн20_СуммаНДС   = Окр(Возн20 * ПроцентНДС / (100 + ПроцентНДС), 2);
						Возн20 = Возн20 - Возн20_СуммаНДС;
						
						Итог20_СуммаНДС   = Окр(Итог20 * ПроцентНДС / (100 + ПроцентНДС), 2);
						Итог20 = Итог20 - Итог20_СуммаНДС;
						
						Возн40_СуммаНДС   = Окр(Возн40 * ПроцентНДС / (100 + ПроцентНДС), 2);
						Возн40 = Возн40 - Возн40_СуммаНДС;
						
						Итог40_СуммаНДС   = Окр(Итог40 * ПроцентНДС / (100 + ПроцентНДС), 2);
						Итог40 = Итог40 - Итог40_СуммаНДС;
						
					КонецЕсли;
					Если Объект.ЕдиницаИзмерения <> ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
						Возн40 = Возн40/2;
					КонецЕсли;
					Если Возн20 <> 0 Тогда
						мСтавок20.Добавить(Возн20);
						новСтр = тСтавок20.Добавить();
						новСтр.Возн20 = Возн20;
						новСтр.Итог20 = Итог20;
					КонецЕсли;
					Если Возн40 <> 0 Тогда
						мСтавок40.Добавить(Возн40);
						новСтр = тСтавок40.Добавить();
						новСтр.Возн40 = Возн40;
						новСтр.Итог40 = Итог40;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЦикла;
		Иначе
			Продолжить;
		КонецЕсли;
		
		
	КонецЦикла;
	
	//Если мСтавок20.Количество() Тогда
	//	мСтавок20.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//	РасчетнаяКонтрибуция20 = РасчетнаяКонтрибуция20 + мСтавок20[0].Значение;
	//КонецЕсли;
	//Если мСтавок40.Количество() Тогда
	//	мСтавок40.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//	РасчетнаяКонтрибуция40 = РасчетнаяКонтрибуция40 + мСтавок40[0].Значение;
	//КонецЕсли;
	
	Если тСтавок20.Количество() Тогда
		тСтавок20.Сортировать("Возн20 ВОЗР");
		РасчетнаяКонтрибуция20 = РасчетнаяКонтрибуция20 + тСтавок20[0].Возн20;
		//море20Ставка		   = тСтавок20[0].Итог20; //Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
	КонецЕсли;
	
	Если тСтавок40.Количество() Тогда
		тСтавок40.Сортировать("Возн40 ВОЗР");
		РасчетнаяКонтрибуция40 = РасчетнаяКонтрибуция40 + тСтавок40[0].Возн40;
		//море40Ставка		   = тСтавок40[0].Итог40; //Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
	ИтогСтавка13_20 = ММ_СтавкаИтого20;
	ИтогСтавка13_40 = ММ_СтавкаИтого;
	//Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
	//	ИтогСтавка13_20 = Объект.ММ_Ставка20_1_3;
	//	ИтогСтавка13_40 = Объект.ММ_Ставка40_1_3;
	//Иначе
	//	ИтогСтавка13_20 = ММ_СтавкаИтого20;
	//	ИтогСтавка13_40 = ММ_СтавкаИтого;
	//КонецЕсли;
	
	Если Объект.ЗафиксироватьКурс ИЛИ КурсВручную Тогда
		ПараметрыКурсаДокумента = Новый Структура;
		ПараметрыКурсаДокумента.Вставить("Валюта",Валюта);
		ПараметрыКурсаДокумента.Вставить("ДатаКурса",Объект.ДатаКурса);
		ПараметрыКурсаДокумента.Вставить("Кратность",1);
		ПараметрыКурсаДокумента.Вставить("Курс",Объект.Курс);
	Иначе
		ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
	КонецЕсли;

	ПараметрыКурсаПересчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.Рубль, ?(ЗначениеЗаполнено(Объект.ДатаКурса), Объект.ДатаКурса, Объект.Дата));
	
	ИтогСтавка13_20 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ИтогСтавка13_20, ПараметрыКурсаДокумента, ПараметрыКурсаПересчета);
	ИтогСтавка13_40 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ИтогСтавка13_40, ПараметрыКурсаДокумента, ПараметрыКурсаПересчета);

	//ИтогСтавкаМоре_20 = море20Ставка;
	//ИтогСтавкаМоре_40 = море40Ставка;
	//
	Если Объект.СуммаВключаетНДС Тогда
		
		ПроцентНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
		
		ИтогСтавка13_20_СуммаНДС   = Окр(ИтогСтавка13_20 * ПроцентНДС / (100 + ПроцентНДС), 2);
		ИтогСтавка13_20 = ИтогСтавка13_20 - ИтогСтавка13_20_СуммаНДС;
		
		ИтогСтавка13_40_СуммаНДС   = Окр(ИтогСтавка13_40 * ПроцентНДС / (100 + ПроцентНДС), 2);
		ИтогСтавка13_40 = ИтогСтавка13_40 - ИтогСтавка13_40_СуммаНДС;
	КонецЕсли;
	//Если Объект.СуммаВключаетНДСФрахт Тогда
	//	
	//	ПроцентНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.НДСФрахт);
	//	
	//	ИтогСтавкаМоре_20_СуммаНДС   = Окр(ИтогСтавкаМоре_20 * ПроцентНДС / (100 + ПроцентНДС), 2);
	//	ИтогСтавкаМоре_20 = ИтогСтавкаМоре_20 - ИтогСтавкаМоре_20_СуммаНДС;
	//	
	//	ИтогСтавкаМоре_40_СуммаНДС   = Окр(ИтогСтавкаМоре_40 * ПроцентНДС / (100 + ПроцентНДС), 2);
	//	ИтогСтавкаМоре_40 = ИтогСтавкаМоре_40 - ИтогСтавкаМоре_40_СуммаНДС;
	//	
	//КонецЕсли;	
	//Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
	
	Если Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
		
		РазмерТЕУ = 1;
		
		Если ЗначениеЗаполнено(Объект.ЖД_РасчетСебестоимостиДляТипаФГП) Тогда
			
			РазмерТЕУ = ПолучитьРазмерТЕУ(Объект.ЖД_РасчетСебестоимостиДляТипаФГП);
			
		КонецЕсли;	
		//Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
		//РасчетнаяКонтрибуция20 = ((ИтогСтавка13_20 + ИтогСтавкаМоре_20) - РасчетнаяКонтрибуция20)/РазмерТЕУ;
		//РасчетнаяКонтрибуция40 = ((ИтогСтавка13_40 + ИтогСтавкаМоре_40) - РасчетнаяКонтрибуция40)/РазмерТЕУ;
		
		//РасчетнаяКонтрибуция20 = ((ИтогСтавка13_20 + ИтогСтавкаМоре_20) - РасчетнаяКонтрибуция20)/РазмерТЕУ;
		//РасчетнаяКонтрибуция40 = ((ИтогСтавка13_40 + ИтогСтавкаМоре_40) - РасчетнаяКонтрибуция40)/РазмерТЕУ;
		
		РасчетнаяКонтрибуция20 = (ИтогСтавка13_20 - РасчетнаяКонтрибуция20)/РазмерТЕУ;
		РасчетнаяКонтрибуция40 = (ИтогСтавка13_40 -  РасчетнаяКонтрибуция40)/РазмерТЕУ;
	Иначе
		//РасчетнаяКонтрибуция20 = (ИтогСтавка13_20 + ИтогСтавкаМоре_20) - РасчетнаяКонтрибуция20;
		//РасчетнаяКонтрибуция40 = ((ИтогСтавка13_40/2) + ИтогСтавкаМоре_40/2) - РасчетнаяКонтрибуция40;
		
		РасчетнаяКонтрибуция20 = ИтогСтавка13_20 - РасчетнаяКонтрибуция20;
		РасчетнаяКонтрибуция40 = (ИтогСтавка13_40/2) - РасчетнаяКонтрибуция40;
		
		//Евросиб Шевченко А.В. US 122386 TA 122575 30.10.2025
	КонецЕсли;
	
	
КонецПроцедуры	

&НаСервере 
Функция ПолучитьРазмерТЕУ(ЖД_РасчетСебестоимостиДляТипаФГП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТС.ТЕУ КАК ТЕУ
	|ИЗ
	|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|ГДЕ
	|	ТипоразмерыТС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЖД_РасчетСебестоимостиДляТипаФГП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТЕУ) Тогда
			Возврат ВыборкаДетальныеЗаписи.ТЕУ;
		КонецЕсли;
	КонецЦикла;

	Возврат 1;
	
КонецФункции

&НаСервере
Процедура ПолучитьНормативнуюКонтрибуцию() //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	Документы.Калькуляция.ПолучитьНормативнуюКонтрибуцию(Объект,НормативнаяКонтрибуция);
	
КонецПроцедуры	

//Евросиб Каблов 28.05.2025 ( #109346
//&НаКлиенте
&НаСервере
//Евросиб Каблов 28.05.2025 )
Процедура ОформитьПоляСтавокКонтрибуции() //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	Если РасчетнаяКонтрибуция20 > НормативнаяКонтрибуция Тогда
		Элементы.РасчетнаяКонтрибуция.ЦветФона = WebЦвета.БледноЗеленый;
	Иначе
		Элементы.РасчетнаяКонтрибуция.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
	КонецЕсли;
	Если РасчетнаяКонтрибуция40 > НормативнаяКонтрибуция Тогда
		Элементы.РасчетнаяКонтрибуция40.ЦветФона = WebЦвета.БледноЗеленый;
	Иначе
		Элементы.РасчетнаяКонтрибуция40.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
	КонецЕсли;
	
	Если РасчетнаяКонтрибуция20 = 0 ИЛИ НормативнаяКонтрибуция = 0 Тогда
		Элементы.РасчетнаяКонтрибуция.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
	Если РасчетнаяКонтрибуция40 = 0 ИЛИ НормативнаяКонтрибуция = 0 Тогда
		Элементы.РасчетнаяКонтрибуция40.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПродуктДКППриИзменении(Элемент)
	
	//Евросиб Каблов 28.05.2025 ( #109346
	ОбновитьСтоимостьУслуг(Ложь, Истина);
	//Евросиб Каблов 28.05.2025 )
	
	ПолучитьНормативнуюКонтрибуцию(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ОформитьПоляСтавокКонтрибуции(); //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПоискДокументаИСтавки(мПунктыОтправления,мПунктыНазначения) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	
	сОтвет = Новый Структура("Успех,ДокументСсылка,ГУИД,Ставка",Ложь,Документы.НормативКонтрибуции.ПустаяСсылка(),"",0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНормативовКонтрибуции.Регистратор КАК Регистратор,
		|	СтавкиНормативовКонтрибуции.НормативнаяСтавка КАК НормативнаяСтавка,
		|	СтавкиНормативовКонтрибуции.Клиент КАК Клиент,
		|	СтавкиНормативовКонтрибуции.ОфисПродаж КАК ОфисПродаж,
		|	СтавкиНормативовКонтрибуции.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	РегистрСведений.СтавкиНормативовКонтрибуции КАК СтавкиНормативовКонтрибуции
		|ГДЕ
		|	СтавкиНормативовКонтрибуции.Продукт = &Продукт
		|	И СтавкиНормативовКонтрибуции.УчетноеНаправление = &УчетноеНаправление
		|	И СтавкиНормативовКонтрибуции.ПунктОтправления В(&ПунктОтправления)
		|	И СтавкиНормативовКонтрибуции.ПунктНазначения В(&ПунктНазначения)
		|	И СтавкиНормативовКонтрибуции.ДатаНачалаПериодаДействия <= &Дата
		|	И СтавкиНормативовКонтрибуции.ДатаОкончанияПериодаДействия >= &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = &Клиент
		|	И ВТ_Итог.ОфисПродаж = &ОфисПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = &Клиент
		|	И ВТ_Итог.ОфисПродаж = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВТ_Итог.ОфисПродаж = &ОфисПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Истина КАК Успех,
		|	ВТ_Итог.Регистратор КАК ДокументСсылка,
		|	ВТ_Итог.ГУИД КАК ГУИД,
		|	ВТ_Итог.НормативнаяСтавка КАК Ставка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВТ_Итог.ОфисПродаж = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ,
		|	НормативнаяСтавка";
	
	ДатаПериод = Дата(1,1,1);
	
	пЗапрос = Новый Запрос;
	пЗапрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ПСЦКалькуляции.Ссылка КАК Ссылка,
	|	ПСЦКалькуляции.Ссылка.ДатаПСЦ КАК ДатаПСЦ
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Калькуляция = &Калькуляция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПСЦ УБЫВ";
	
	пЗапрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	
	пРезультатЗапроса = пЗапрос.Выполнить();
	
	пВыборкаДетальныеЗаписи = пРезультатЗапроса.Выбрать();
	
	Пока пВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаПериод = пВыборкаДетальныеЗаписи.ДатаПСЦ
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("Дата", ДатаПериод);
	Запрос.УстановитьПараметр("Клиент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ОфисПродаж", "");
	Запрос.УстановитьПараметр("Продукт", Объект.ПродуктДКП);
	Запрос.УстановитьПараметр("ПунктНазначения", мПунктыНазначения);
	Запрос.УстановитьПараметр("ПунктОтправления", мПунктыОтправления);
	Запрос.УстановитьПараметр("УчетноеНаправление", Объект.УчетноеНаправление);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКлиентОфис 				= РезультатЗапроса[1].Выбрать();
	ВыборкаКлиент 					= РезультатЗапроса[2].Выбрать();
	Выборкаофис 					= РезультатЗапроса[3].Выбрать();
	ВыборкаБезофисаБезКлиента 		= РезультатЗапроса[4].Выбрать();
	
	Пока ВыборкаКлиентОфис.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,ВыборкаКлиентОфис);
		Возврат сОтвет;
	КонецЦикла;
	Пока ВыборкаКлиент.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,ВыборкаКлиент);
		Возврат сОтвет;
	КонецЦикла;
	Пока Выборкаофис.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,Выборкаофис);
		Возврат сОтвет;
	КонецЦикла;
	Пока ВыборкаБезофисаБезКлиента.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сОтвет,Выборкаофис);
		Возврат сОтвет;
	КонецЦикла;
	
	Возврат сОтвет;
	
КонецФункции	

&НаКлиенте
Процедура СтавкаНДС2ПриИзменении(Элемент) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ПолучитьРасчетнуюКонтрибуцию();
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();                       
	КонецЕсли; //Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ОформитьПоляСтавокКонтрибуции();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДС2ПриИзменении(Элемент) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ПолучитьРасчетнуюКонтрибуцию();
	Если Объект.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
		РассчитатьВознаграждение();                       
	КонецЕсли; //Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
	ОформитьПоляСтавокКонтрибуции();
КонецПроцедуры

&НаКлиенте
Процедура НДСФрахт1ПриИзменении(Элемент) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ПолучитьРасчетнуюКонтрибуцию();
	ОформитьПоляСтавокКонтрибуции();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСФрахтПриИзменении(Элемент) //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	ПолучитьРасчетнуюКонтрибуцию();
	ОформитьПоляСтавокКонтрибуции();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения()
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 29.07.2025 ((
	Если Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.teu") Тогда
		Объект.ТарифицируемыйРазмерКТК = "2040";
		Элементы.ТарифицируемыйРазмерКТК.ТолькоПросмотр = Истина;
				
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиТариф40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСтавкаМаксимальная40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиЦена40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиНормативныйПроцентВознаграждения40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения40.Видимость = Ложь;
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиИтого40.Видимость = Ложь;
		Элементы.ММ_СебестоимостьСуши.Видимость = Ложь;
		Элементы.ММ_Вознаграждение40.Видимость = Ложь;
		//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
		Элементы.ММ_СтараяСтавкаИтого.Видимость = Ложь;
		//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
		
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиТариф20.Заголовок = "Тариф за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСтавкаМаксимальная20.Заголовок = "max за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиЦена20.Заголовок = "Ставка за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаНДС20.Заголовок = "Сумма НДС за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиНормативныйПроцентВознаграждения20.Заголовок = "Норм. % вознагр. за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиВознаграждение20.Заголовок = "% вознагр. за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиСуммаВознаграждения20.Заголовок = "Сумма вознагр. за TEU";
		Элементы.ММ_КалькуляцияМультимодальнойЦепочкиИтого20.Заголовок = "Итого за TEU";
		Элементы.ММ_СебестоимостьСуши40.Заголовок = "Себестоимость за TEU";
		Элементы.ММ_Вознаграждение.Заголовок = "Вознаграждение за TEU";
		//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
		Элементы.ММ_стараяСтавкаИтого20.Заголовок = "Ставка итого за TEU";
		//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
		
		Элементы.РасчетнаяКонтрибуция.Заголовок = "Расчетная контрибуция, руб. на TEU";
		Элементы.РасчетнаяКонтрибуция40.Видимость = Ложь;
		Возврат; //Евросиб Шевченко А.В. US 117355 TA 121128 07.10.2025
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 29.07.2025 ))
	
	//Евросиб Шевченко А.В. US 117355 TA 121128 07.10.2025
	
	ТипыКалкСтавкаЗаВагон = Новый Массив;
	ТипыКалкСтавкаЗаВагон.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ДоплатныеПВ"));
	ТипыКалкСтавкаЗаВагон.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого"));
	ТипыКалкСтавкаЗаВагон.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом"));
	
	Если Объект.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
		Элементы.РасчетнаяКонтрибуция.Заголовок = "Расчетная контрибуция, руб. на TEU";
		Элементы.РасчетнаяКонтрибуция40.Заголовок = "Расчетная контрибуция, руб. на TEU";
		Если ТипыКалкСтавкаЗаВагон.Найти(Объект.ТипКалькуляции) = Неопределено Тогда
			Элементы.РасчетнаяКонтрибуция40.Видимость = Ложь;
		Иначе
			Элементы.РасчетнаяКонтрибуция.Видимость = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Элементы.РасчетнаяКонтрибуция.Заголовок = "Расчетная контрибуция 20', в руб. на TEU";
	Элементы.РасчетнаяКонтрибуция40.Заголовок = "Расчетная контрибуция 40', в руб. на TEU";
	Элементы.РасчетнаяКонтрибуция.Видимость = Истина;
	Элементы.РасчетнаяКонтрибуция40.Видимость = Истина;	
	//Евросиб Шевченко А.В. US 117355 TA 121128 07.10.2025
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 04.08.2025 ((
	ОбновитьВидимостьПолейПриСменеЕдиницыИзмерения();
	// Евросиб Рыбьяков К.А. 04.08.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура ММ_КалькуляцияМультимодальнойЦепочкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Евросиб Каблов 05.12.2025 ( Ticket#0422793
	//Так как при изменении происходит вызов сервера, при начале редактирования не вызывалась
	Отказ = Истина;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	НоваяСтрока = Объект.ММ_КалькуляцияМультимодальнойЦепочки.Добавить();
	
	Если Копирование Тогда
		Если ТекДанные <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
		КонецЕсли;
	КонецЕсли;
	
	Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	ММ_КалькуляцияМультимодальнойЦепочкиПриИзменении(Элемент);
	
	ММ_КалькуляцияМультимодальнойЦепочкиПриНачалеРедактирования(Элемент, Истина, Копирование);
	//Евросиб Каблов 05.12.2025 )
	
КонецПроцедуры

КэшНаправлений = Новый Массив;
КэшУслуг = Новый Соответствие;
