#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеНеопределено = Неопределено;
	
	СписокВыбораСоставаТаблицыУслуг = Элементы.СоставТаблицыУслугИмя.СписокВыбора;
	СписокВыбораСоставаТаблицыНормативов = Элементы.СоставТаблицыНормативныхСтавокИмя.СписокВыбора;
	
	ДоступныеРеквизиты.Загрузить(Справочники.ВидыУслугПоставщиков.ПолучитьДоступныеРеквизиты());
	
	Для Каждого Реквизит из ДоступныеРеквизиты Цикл
		Если Реквизит.ИмяТаблицы = "ПСЦПоставщика.Услуги" Тогда
			СписокВыбораСоставаТаблицыУслуг.Добавить(Реквизит.Имя, Реквизит.Представление);
		ИначеЕсли Реквизит.ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги" Тогда
			СписокВыбораСоставаТаблицыНормативов.Добавить(Реквизит.Имя, Реквизит.Представление);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Реквизит Из ДоступныеРеквизиты Цикл
		
		ДоступныеПоляПоиска = Реквизит.ДоступныеПоляПоиска;
		Типы = Реквизит.Тип.Типы();
		Для Каждого Тип Из Типы Цикл
			
			СтроковоеПредставлениеТипа = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип);
			Реквизит.ДоступныеТипы.Добавить(СтроковоеПредставлениеТипа);
			
			ПолноеИмяТипа = СтрЗаменить(СтроковоеПредставлениеТипа, "Ссылка.", ".");
			КлассОМ = ЕСОбщегоНазначенияКлиентСервер.ПолучитьКлассОбъектаМетаданных(ПолноеИмяТипа);
			
			Если КлассОМ = "Справочник" Тогда
				
				МетаданныеПоТипу = Метаданные.НайтиПоТипу(Тип);
				
				Для Каждого Элемент Из МетаданныеПоТипу.СтандартныеРеквизиты Цикл
					Если Элемент.Имя = "Наименование" Или Элемент.Имя = "Код" Тогда
						Если ДоступныеПоляПоиска.НайтиПоЗначению(Элемент.Имя) = Неопределено Тогда
							ДоступныеПоляПоиска.Добавить(Элемент.Имя, Элемент.Синоним);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Элемент Из МетаданныеПоТипу.Реквизиты Цикл
					Если ДоступныеПоляПоиска.НайтиПоЗначению(Элемент.Имя) = Неопределено Тогда
						ДоступныеПоляПоиска.Добавить(Элемент.Имя, Элемент.Синоним);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			//МетаданныеПоТипу.ВводПоСтроке
			
		КонецЦикла;
			
		НайденныеСтроки = Объект.ПоляТаблицыУслуг.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", Реквизит.ИмяТаблицы, Реквизит.Имя));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.Используется = Истина;
			НайденнаяСтрока.Тип = Реквизит.Тип;
			НайденнаяСтрока.ДоступныеТипы.ЗагрузитьЗначения(Реквизит.ДоступныеТипы.ВыгрузитьЗначения());
			
			Для Каждого Элемент Из Реквизит.ДоступныеПоляПоиска Цикл
				НайденнаяСтрока.ДоступныеПоляПоиска.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла;	
	
	КорневыеЭлементы = СоставТаблицыУслуг.ПолучитьЭлементы();
	ЗаполнитьДеревоСоставТаблицы(КорневыеЭлементы, "ПСЦПоставщика.Услуги");
	
	КорневыеЭлементы = СоставТаблицыНормативныхСтавок.ПолучитьЭлементы();
	ЗаполнитьДеревоСоставТаблицы(КорневыеЭлементы, "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");
	
	СписокВыбораПолейСпискаТарифов = Элементы.ПоляСпискаТарифовИмя.СписокВыбора;
	ДоступныеПоляСпискаТарифов.Загрузить(Справочники.ВидыУслугПоставщиков.ПолучитьДоступныеПоляСпискаТарифов());
	Для Каждого ДоступноеПоле Из ДоступныеПоляСпискаТарифов Цикл
		СписокВыбораПолейСпискаТарифов.Добавить(ДоступноеПоле.Имя, ДоступноеПоле.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСоставТаблицы(КорневыеЭлементы, ИмяТаблицы)

	ГруппыКолонок = Новый Соответствие;
	НайденныеПоля = Объект.ПоляТаблицыУслуг.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы));
	
	Для Каждого Поле Из НайденныеПоля Цикл		
		
		Если ЗначениеЗаполнено(Поле.Родитель) Тогда
			ЭлементыТекущейГруппы = ГруппыКолонок.Получить(Поле.Родитель);
		Иначе
			ЭлементыТекущейГруппы = КорневыеЭлементы;
		КонецЕсли;
		
		ЭлементДерева = ЭлементыТекущейГруппы.Добавить();
		Если Поле.ЭтоГруппаЭлементов Тогда
			ГруппыКолонок.Вставить(Поле.Имя, ЭлементДерева.ПолучитьЭлементы());
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Поле);
		
		ЭлементыСписка = Объект.СпискиВыбора.НайтиСтроки(Новый Структура("Имя, ИмяТаблицы", Поле.Имя, ИмяТаблицы));
		Для Каждого Элемент Из ЭлементыСписка Цикл
			ЭлементДерева.СписокВыбора.Добавить(Элемент.Значение);
		КонецЦикла;
		//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
		ЭлементыСпискаДопУсловий = Объект.ДополнительныеУсловия.НайтиСтроки(Новый Структура("Имя, ИмяТаблицы", Поле.Имя, ИмяТаблицы));
		Для Каждого Стр Из ЭлементыСпискаДопУсловий Цикл
			ЭлементДерева.ДополнительныеУсловия.Добавить("Установлены отборы");
		КонецЦикла;
		//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
		ОграниченияТипа = Объект.ОграниченияТипов.НайтиСтроки(Новый Структура("Имя, ИмяТаблицы", Поле.Имя, ИмяТаблицы));
		Для Каждого Стр Из ОграниченияТипа Цикл
			ДоступныйТип = Поле.ДоступныеТипы.НайтиПоЗначению(Стр.ИмяТипа);
			Если ДоступныйТип <> Неопределено Тогда
				ЭлементДерева.ОграничениеТипа.Добавить(Стр.ИмяТипа, ДоступныйТип.Представление);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыВыбораПоля = Объект.ПараметрыВыбора.НайтиСтроки(Новый Структура("Имя, ИмяТаблицы", Поле.Имя, ИмяТаблицы));
		Для Каждого Стр Из ПараметрыВыбораПоля Цикл
			ЭлементДерева.ПараметрыВыбора.Добавить(Стр.ИмяПараметра + " = " + Строка(Стр.ЗначениеПараметра));
		КонецЦикла;
		
		ПоляПоиска = Объект.ПоляПоиска.НайтиСтроки(Новый Структура("Имя, ИмяТаблицы", Поле.Имя, ИмяТаблицы));		
		Для Каждого Стр Из ПоляПоиска Цикл
			ДоступноеПолеПоиска = Поле.ДоступныеПоляПоиска.НайтиПоЗначению(Стр.ИмяПоля);
			Если ДоступноеПолеПоиска <> Неопределено Тогда
				ЭлементДерева.ПоляПоиска.Добавить(Стр.ИмяПоля, ДоступноеПолеПоиска.Представление);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ПоляТаблицыУслуг.Очистить();
	Объект.СпискиВыбора.Очистить();
	ПеренестиДеревоВТаблицу(СоставТаблицыНормативныхСтавок, "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");
	ПеренестиДеревоВТаблицу(СоставТаблицыУслуг, "ПСЦПоставщика.Услуги");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляТаблицыУслуг

&НаКлиенте
Процедура ПоляТаблицыУслугПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ИдентификаторТекСтроки = Элементы.ПоляТаблицыУслуг.ТекущаяСтрока;
	ТекСтрока = Объект.ПоляТаблицыУслуг.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	
	Для Каждого Стр Из Объект.ПоляТаблицыУслуг Цикл
		
		ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
		Если  ИдентификаторСтроки = ИдентификаторТекСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.Имя = ТекСтрока.Имя Тогда
			ПоказатьПредупреждение(, "Реквизит уже выбран в другой строке!");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоляТаблицыУслугПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.ПоляТаблицыУслуг.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.Имя) Тогда
			Объект.ПоляТаблицыУслуг.Удалить(ТекДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляТаблицыУслугИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторТекСтроки = Элементы.ПоляТаблицыУслуг.ТекущаяСтрока;
	ТекДанные = Элементы.ПоляТаблицыУслуг.ТекущиеДанные;
	
	Для Каждого ДоступныйРеквизит Из ДоступныеРеквизиты Цикл
		
		Если ДоступныйРеквизит.Имя = ВыбранноеЗначение Тогда
			
			ВыбранВДругойСтроке = Ложь;
			Для Каждого Стр Из Объект.ПоляТаблицыУслуг Цикл
		
				ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
				Если ИдентификаторСтроки = ИдентификаторТекСтроки Тогда
					Продолжить;
				КонецЕсли;
				
				Если Стр.Имя = ДоступныйРеквизит.Имя Тогда
					ПоказатьПредупреждение(, "Реквизит уже выбран в другой строке!");
					ВыбранВДругойСтроке = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ВыбранВДругойСтроке Тогда
				ЗаполнитьЗначенияСвойств(ТекДанные, ДоступныйРеквизит);
				ТекДанные.Используется = Истина;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляТаблицыУслугИмяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляТаблицыУслугПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ПоляТаблицыУслуг.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		Если Не Копирование Тогда
			ТекДанные.Выводить = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваФормыСоставТаблицыУслуг

&НаКлиенте
Процедура СоставТаблицыУслугИмяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СоставТаблицыУслуг.ТекущиеДанные;
	
	Если Не ТекДанные.ЭтоГруппаЭлементов Тогда
		ВыполнитьАвтоподборПоляПоТексту(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугСписокВыбораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыУслуг";
	ОбработатьНачалоВыбораСпискаВыбора(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ТекДанные = Элементы.СоставТаблицыУслуг.ТекущиеДанные;
	
	НайденныеДоступныеРеквизиты = ДоступныеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ВыбранноеЗначение));
	Если ЗначениеЗаполнено(НайденныеДоступныеРеквизиты) Тогда
		ДоступныйРеквизит = НайденныеДоступныеРеквизиты[0];
		ЗаполнитьЗначенияСвойств(ТекДанные, ДоступныйРеквизит);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугОграничениеТипаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыУслуг";
	ОбработатьНачалоВыбораОграниченияТипа(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПараметрыВыбораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыУслуг";
	ОбработатьНачалоВыбораПараметровВыбора(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПоляПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыУслуг";
	ОбработатьНачалоВыбораПолейПоиска(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ДобавитьЭлементДерева("СоставТаблицыУслуг");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не ОтменаРедактирования Тогда
		
		ИдентификаторТекСтроки = Элементы.СоставТаблицыУслуг.ТекущаяСтрока;
		ТекСтрока = СоставТаблицыУслуг.НайтиПоИдентификатору(ИдентификаторТекСтроки);
		
		//НайденнаяСтрока = НайтиСтрокуДереваПоИмени(СоставТаблицыУслуг, ТекСтрока.Имя);
		//Если НайденнаяСтрока <> Неопределено Тогда
		//	ПоказатьПредупреждение(, "Реквизит уже выбран в другой строке!");
		//	Отказ = Истина;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//ТекДанные = Элементы.СоставТаблицыУслуг.ТекущиеДанные;
	//Если ТекДанные <> Неопределено Тогда
	//	Если Не ЗначениеЗаполнено(ТекДанные.Имя) Тогда
	//		СоставТаблицыУслуг.Удалить(ТекДанные);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыУслугПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбработатьАктивизациюСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтроки() Экспорт
	
	ТекДанные = Элементы.СоставТаблицыУслуг.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Элементы.СоставТаблицыУслугЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов(ТекДанные.Тип);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ДобавитьЭлементДерева("СоставТаблицыУслуг", Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовДереваФормыСоставТаблицыНормативныхСтавок

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокИмяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		
	ТекДанные = Элементы.СоставТаблицыНормативныхСтавок.ТекущиеДанные;
	
	Если Не ТекДанные.ЭтоГруппаЭлементов Тогда
		ВыполнитьАвтоподборПоляПоТексту(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокСписокВыбораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыНормативныхСтавок";
	ОбработатьНачалоВыбораСпискаВыбора(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	ТекДанные = Элементы.СоставТаблицыНормативныхСтавок.ТекущиеДанные;
	
	НайденныеДоступныеРеквизиты = ДоступныеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ВыбранноеЗначение));
	Если ЗначениеЗаполнено(НайденныеДоступныеРеквизиты) Тогда
		ДоступныйРеквизит = НайденныеДоступныеРеквизиты[0];
		ЗаполнитьЗначенияСвойств(ТекДанные, ДоступныйРеквизит);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокОграничениеТипаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыНормативныхСтавок";
	ОбработатьНачалоВыбораОграниченияТипа(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокПараметрыВыбораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыНормативныхСтавок";
	ОбработатьНачалоВыбораПараметровВыбора(ИмяТаблицы, ИмяДереваЭлементов);	
	
КонецПроцедуры


&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокПоляПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
   	ИмяТаблицы = "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыНормативныхСтавок";
	ОбработатьНачалоВыбораПолейПоиска(ИмяТаблицы, ИмяДереваЭлементов);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбработатьАктивизациюСтрокиСоставаНормативныхСтавок", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтрокиСоставаНормативныхСтавок() Экспорт
	
	ТекДанные = Элементы.СоставТаблицыНормативныхСтавок.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Элементы.СоставТаблицыНормативныхСтавокЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов(ТекДанные.Тип);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуТаблицыНормативныхСтавок(Команда)
	
	ДобавитьЭлементДерева("СоставТаблицыНормативныхСтавок", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьАвтоподборПоляПоТексту(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекстПоиска = ВРег(Текст);
	
	Пока СтрНайти(ТекстПоиска, "  ") > 0 Цикл
		ТекстПоиска = СтрЗаменить(ТекстПоиска, "  ", " ");
	КонецЦикла;
	
	ТекстПоиска = СокрЛП(ТекстПоиска);
	
	ДлинаТекста = СтрДлина(ТекстПоиска);
	Если ДлинаТекста = 0 Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Шрифт = Новый Шрифт(,,Истина);
	Цвет = WebЦвета.Зеленый;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	МассивПодстрок = СтрРазделить(ТекстПоиска, " ");
	
	Для Каждого Стр Из Элемент.СписокВыбора Цикл
		
		Значение = Стр.Значение;
		Строка = Стр.Представление;
		СтрокаВРег = ВРег(Строка);
		
		ВхожденияНайдены = Истина;
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			Если Найти(СтрокаВРег, Подстрока) = 0 Тогда
				ВхожденияНайдены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ВхожденияНайдены Тогда
			Продолжить
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(Строка);
		Массив = Новый Массив(ДлинаСтроки);
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			ДлинаПодстроки = СтрДлина(Подстрока);
			НачалоПоиска = 1;			
			Пока Истина Цикл
				ПозицияПодстроки = СтрНайти(СтрокаВРег, Подстрока, , НачалоПоиска);
				Если ПозицияПодстроки = 0 Тогда
					Прервать;
				КонецЕсли;
				
				НачалоПоиска = ПозицияПодстроки + ДлинаПодстроки;
				
				Для Сч = ПозицияПодстроки По НачалоПоиска - 1 Цикл
					Массив[Сч - 1] = Истина;
				КонецЦикла;				
				
				Если НачалоПоиска > ДлинаСтроки Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;			
		КонецЦикла;
		
		МассивСтрок = Новый Массив;		
		Для Сч = 0 По Массив.ВГраница() Цикл
			Символ = Сред(Строка, Сч + 1, 1);
			Если Массив[Сч] = Неопределено Тогда
				МассивСтрок.Добавить(Символ);
			Иначе
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символ, Шрифт, Цвет));
			КонецЕсли;
		КонецЦикла;
		
		ДанныеВыбора.Добавить(Значение, Новый ФорматированнаяСтрока(МассивСтрок));
		
		Если ДанныеВыбора.Количество() = 50 Тогда
			Прервать
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораСпискаВыбора(ИмяТаблицы, ИмяДереваЭлементов)
	
	ТекСтрока = Элементы[ИмяДереваЭлементов].ТекущаяСтрока;
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;
	
	СписокВыбора = ТекДанные.СписокВыбора.ВыгрузитьЗначения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипЗначенияСписка", ТекДанные.Тип);
	ПараметрыФормы.Вставить("ТекущийСписок", СписокВыбора);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ИмяДереваЭлементов", ИмяДереваЭлементов);	
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаВыбораЭлемента", ЭтаФорма, ПараметрыОповещения);
	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаВыбораЭлемента(СписокВыбора, ДополнительныеПараметры) Экспорт
	
	Если СписокВыбора <> Неопределено Тогда
		
		ИмяДереваЭлементов = ДополнительныеПараметры.ИмяДереваЭлементов;
		ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
		
		ТекПоле = ЭтотОбъект[ИмяДереваЭлементов].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		ТекПоле.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораПараметровВыбора(ИмяТаблицы, ИмяДереваЭлементов)
	
	ТекСтрока = Элементы[ИмяДереваЭлементов].ТекущаяСтрока;
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;
	
	ТекПараметрыВыбора = Объект.ПараметрыВыбора.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
	СписокПараметров = Новый Массив;
	Для Каждого Стр Из ТекПараметрыВыбора Цикл
		СписокПараметров.Добавить(Новый Структура("ИмяПараметра, ЗначениеПараметра", Стр.ИмяПараметра, Стр.ЗначениеПараметра));
	КонецЦикла;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ИмяДереваЭлементов", ИмяДереваЭлементов);
	
	ОповещениеОЗакрытииФормы = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияПараметровВыбора", ЭтаФорма, ПараметрыОповещения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокПараметров", СписокПараметров);
	
	ОткрытьФорму("Справочник.ВидыУслугПоставщиков.Форма.ФормаРедактированияПараметровВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытииФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияПараметровВыбора(СписокПараметров, ДопПараметры) Экспорт
	
	Если СписокПараметров <> Неопределено Тогда
		
		ИмяТаблицы = ДопПараметры.ИмяТаблицы;
		ИмяДереваЭлементов = ДопПараметры.ИмяДереваЭлементов;
		
		ТекДанные = ЭтотОбъект[ИмяДереваЭлементов].НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		
		ТекПараметрыВыбора = Объект.ПараметрыВыбора.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
		Для Каждого Стр Из ТекПараметрыВыбора Цикл
			Объект.ПараметрыВыбора.Удалить(Стр);
		КонецЦикла;
		
		ТекДанные.ПараметрыВыбора.Очистить();
		
		Для Каждого Параметр Из СписокПараметров Цикл
			
			Стр = Объект.ПараметрыВыбора.Добавить();
			Стр.ИмяТаблицы = ИмяТаблицы;
			Стр.Имя = ТекДанные.Имя;
			ЗаполнитьЗначенияСвойств(Стр, Параметр, "ИмяПараметра, ЗначениеПараметра");
			
			ТекДанные.ПараметрыВыбора.Добавить(Стр.ИмяПараметра + " = " + Строка(Стр.ЗначениеПараметра));
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораОграниченияТипа(ИмяТаблицы, ИмяДереваЭлементов)
	
	ТекСтрока = Элементы[ИмяДереваЭлементов].ТекущаяСтрока;
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;	
	
	СписокОграничениеТипа = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.ОграничениеТипа Цикл
		ДоступныйТип = ТекДанные.ДоступныеТипы.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ДоступныйТип <> Неопределено Тогда
			СписокОграничениеТипа.Добавить(ДоступныйТип.Значение, ДоступныйТип.Представление, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из ТекДанные.ДоступныеТипы Цикл
		ВыбранныйЭлемент = СписокОграничениеТипа.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент = Неопределено Тогда
			Пометка = ТекДанные.ОграничениеТипа.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено;		
			СписокОграничениеТипа.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, Пометка);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокОграничениеТипа);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ИмяДереваЭлементов", ИмяДереваЭлементов);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияОграниченияТипа", ЭтаФорма, ПараметрыОповещения);
	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияОграниченияТипа(СписокОграничениеТипа, ДополнительныеПараметры) Экспорт
	
	Если СписокОграничениеТипа <> Неопределено Тогда
		
		ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
		ИмяДереваЭлементов = ДополнительныеПараметры.ИмяДереваЭлементов;
		
		ТекДанные = ЭтотОбъект[ИмяДереваЭлементов].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		ОграничениеТипа = ТекДанные.ОграничениеТипа;
		ОграничениеТипа.Очистить();
		
		Для Каждого ЭлементСписка Из СписокОграничениеТипа Цикл
			Если ЭлементСписка.Пометка Тогда
				ОграничениеТипа.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементыПоТекущемуПолю = Объект.ОграниченияТипов.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
		Для Каждого Элемент Из ЭлементыПоТекущемуПолю Цикл
			Объект.ОграниченияТипов.Удалить(Элемент);
		КонецЦикла;
		
		Для Каждого Элемент Из ОграничениеТипа Цикл
			НовыйЭлемент = Объект.ОграниченияТипов.Добавить();
			НовыйЭлемент.ИмяТаблицы = ИмяТаблицы;
			НовыйЭлемент.Имя = ТекДанные.Имя;
			НовыйЭлемент.ИмяТипа = Элемент.Значение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораПолейПоиска(ИмяТаблицы, ИмяДереваЭлементов)
	
	ТекСтрока = Элементы[ИмяДереваЭлементов].ТекущаяСтрока;
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;
		
	СписокПолей = Новый СписокЗначений;
	
	ПоляПоиска = Объект.ПоляПоиска.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
	Для Каждого Стр Из ПоляПоиска Цикл
		ДоступныйТип = ТекДанные.ДоступныеПоляПоиска.НайтиПоЗначению(Стр.ИмяПоля);
		Если ДоступныйТип <> Неопределено Тогда
			СписокПолей.Добавить(ДоступныйТип.Значение, ДоступныйТип.Представление, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из ТекДанные.ДоступныеПоляПоиска Цикл
		ВыбранныйЭлемент = СписокПолей.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент = Неопределено Тогда
			СписокПолей.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокПолей);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ИмяДереваЭлементов", ИмяДереваЭлементов);	
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыСпискаПолейПоиска", ЭтаФорма, ПараметрыОповещения);
	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыСпискаПолейПоиска(СписокПолейПоиска, ДополнительныеПараметры) Экспорт
	
	Если СписокПолейПоиска <> Неопределено Тогда
		
		ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
		ИмяДереваЭлементов = ДополнительныеПараметры.ИмяДереваЭлементов;
		ТекДанные = ЭтотОбъект[ИмяДереваЭлементов].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		ПоляПоиска = ТекДанные.ПоляПоиска;
		ПоляПоиска.Очистить();
		
		Для Каждого ЭлементСписка Из СписокПолейПоиска Цикл
			Если ЭлементСписка.Пометка Тогда
				ПоляПоиска.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементыПоТекущемуПолю = Объект.ПоляПоиска.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
		Для Каждого Элемент Из ЭлементыПоТекущемуПолю Цикл
			Объект.ПоляПоиска.Удалить(Элемент);
		КонецЦикла;
		
		Для Каждого Элемент Из ПоляПоиска Цикл
			НовыйЭлемент = Объект.ПоляПоиска.Добавить();
			НовыйЭлемент.ИмяТаблицы = ИмяТаблицы;
			НовыйЭлемент.Имя = ТекДанные.Имя;
			НовыйЭлемент.ИмяПоля = Элемент.Значение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементДерева(ИмяДереваЭлементов, Группа = Ложь)
	
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда		
		Если ТекДанные.ЭтоГруппаЭлементов Тогда
			ЭлементыТекущейГруппы = ТекДанные.ПолучитьЭлементы();
			НовыйЭлемент = ЭлементыТекущейГруппы.Добавить();
		Иначе
			ТекущаяГруппа = ТекДанные.ПолучитьРодителя();
			Если ТекущаяГруппа = Неопределено Тогда
				ТекущаяГруппа = ЭтотОбъект[ИмяДереваЭлементов];
			КонецЕсли;
			ЭлементыТекущейГруппы = ТекущаяГруппа.ПолучитьЭлементы();
			ИндексТекущейСтроки = ЭлементыТекущейГруппы.Индекс(ТекДанные);
			НовыйЭлемент = ЭлементыТекущейГруппы.Вставить(ИндексТекущейСтроки + 1);
		КонецЕсли;
	Иначе
		ТекущаяГруппа = ЭтотОбъект[ИмяДереваЭлементов];
		ЭлементыТекущейГруппы = ТекущаяГруппа.ПолучитьЭлементы();
		НовыйЭлемент = ЭлементыТекущейГруппы.Добавить();
	КонецЕсли;
		
	Если Группа Тогда
		НовыйЭлемент.ЭтоГруппаЭлементов = Истина;
		НовыйЭлемент.Группировка = "Вертикальная";
	Иначе
		НовыйЭлемент.ЭтоГруппаЭлементов = Ложь;
		НовыйЭлемент.Группировка = "";
	КонецЕсли;
	
	НовыйЭлемент.Выводить = Истина;
	НовыйЭлемент.ОтображатьВШапке = Истина;
	Элементы[ИмяДереваЭлементов].ТекущаяСтрока = НовыйЭлемент.ПолучитьИдентификатор();
			
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДеревоВТаблицу(ГруппаЭлементов, ИмяТаблицы, ИмяГруппы = "")
	
	СтрокиДерева = ГруппаЭлементов.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		СтрокаТаблицы = Объект.ПоляТаблицыУслуг.Добавить();
		СтрокаТаблицы.ИмяТаблицы = ИмяТаблицы;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДерева);
		СтрокаТаблицы.Родитель = ИмяГруппы;
		
		Если СтрокаДерева.ЭтоГруппаЭлементов Тогда
			ПеренестиДеревоВТаблицу(СтрокаДерева, ИмяТаблицы, СтрокаДерева.Имя);
		Иначе
			
			Для Каждого ЭлементСписка Из СтрокаДерева.СписокВыбора Цикл
				НоваяСтрока = Объект.СпискиВыбора.Добавить();
				НоваяСтрока.Имя = СтрокаТаблицы.Имя;
				НоваяСтрока.ИмяТаблицы = ИмяТаблицы;
				НоваяСтрока.Значение = ЭлементСписка.Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуДереваПоИмени(ГруппаЭлементов, ИмяЭлемента)
	
	НайденнаяСтрока = Неопределено;
	СтрокиДерева = ГруппаЭлементов.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл		
		Если СтрокаДерева.ЭтоГруппаЭлементов Тогда
			НайденнаяСтрока = НайтиСтрокуДереваПоИмени(СтрокаДерева, ИмяЭлемента);
			Если НайденнаяСтрока <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		Иначе			
			Если СтрокаДерева.Имя = ИмяЭлемента Тогда
				НайденнаяСтрока = СтрокаДерева;
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ДобавитьЭлементДерева("СоставТаблицыНормативныхСтавок");
			
КонецПроцедуры

&НаКлиенте
Процедура СоставТаблицыНормативныхСтавокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляСпискаТарифовИмяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВыполнитьАвтоподборПоляПоТексту(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляСпискаТарифовИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ПоляСпискаТарифов.ТекущиеДанные;
	
	НайденныеДоступныеПоля = ДоступныеПоляСпискаТарифов.НайтиСтроки(Новый Структура("Имя", ВыбранноеЗначение));
	Если ЗначениеЗаполнено(НайденныеДоступныеПоля) Тогда
		ДоступноеПоле = НайденныеДоступныеПоля[0];
		ЗаполнитьЗначенияСвойств(ТекДанные, ДоступноеПоле);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
&НаКлиенте
Процедура СоставТаблицыУслугДополнительныеУсловияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = "ПСЦПоставщика.Услуги";
	ИмяДереваЭлементов = "СоставТаблицыУслуг";
	ОбработатьНачалоВыбораДополнительныеУсловия(ИмяТаблицы, ИмяДереваЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораДополнительныеУсловия(ИмяТаблицы, ИмяДереваЭлементов)
	
	ТекСтрока = Элементы[ИмяДереваЭлементов].ТекущаяСтрока;
	ТекДанные = Элементы[ИмяДереваЭлементов].ТекущиеДанные;
	
	ТекПараметрыВыбора = Объект.ДополнительныеУсловия.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
	
	сДопУсловий = Новый Структура("Ссылка,УникальныйИдентификаторВладельца,ИмяТаблицы,Имя,Адрес",Объект.Ссылка,Этаформа.УникальныйИдентификатор,"","","");
	
	Для Каждого СтрДопУсловие Из ТекПараметрыВыбора Цикл
		сДопУсловий.Вставить("Ссылка",Объект.Ссылка);
		сДопУсловий.Вставить("ИмяТаблицы",СтрДопУсловие.ИмяТаблицы);
		сДопУсловий.Вставить("Имя",СтрДопУсловие.Имя);
		сДопУсловий.Вставить("Адрес",СтрДопУсловие.Адрес);
	КонецЦикла;
	
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить(сДопУсловий);
		
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ИмяДереваЭлементов", ИмяДереваЭлементов);
	
	ОповещениеОЗакрытииФормы = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаДополнительныхУсловий", ЭтаФорма, ПараметрыОповещения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокПараметров", СписокПараметров);
	
	ОткрытьФорму("Справочник.ВидыУслугПоставщиков.Форма.ФормаРедактированияДопУсловий", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытииФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаДополнительныхУсловий(вПараметр, ДопПараметры) Экспорт
	
	Если вПараметр <> Неопределено Тогда
		
		ИмяТаблицы = ДопПараметры.ИмяТаблицы;
		ИмяДереваЭлементов = ДопПараметры.ИмяДереваЭлементов;
		
		ТекДанные = ЭтотОбъект[ИмяДереваЭлементов].НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		
		ТекПараметрыВыбора = Объект.ДополнительныеУсловия.НайтиСтроки(Новый Структура("ИмяТаблицы, Имя", ИмяТаблицы, ТекДанные.Имя));
		Для Каждого Стр Из ТекПараметрыВыбора Цикл
			Объект.ДополнительныеУсловия.Удалить(Стр);
		КонецЦикла;
		
		ТекДанные.ДополнительныеУсловия.Очистить();	
		
		Для Каждого Параметр Из вПараметр Цикл
			
			Если Параметр.ЗначениеПараметра <> "" И ТекДанные.Обязательное Тогда
				Стр = Объект.ДополнительныеУсловия.Добавить();
				Стр.ИмяТаблицы = ИмяТаблицы;
				Стр.Имя = ТекДанные.Имя;
				Стр.Адрес = Параметр.ЗначениеПараметра;
				ТекДанные.ДополнительныеУсловия.Добавить("Установлены отборы");
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	

&НаСервере
Функция ПолучитьАдресВременногоХранилища(Стр)
	Если НЕ ЗначениеЗаполнено(Стр.Условие) Тогда
		Возврат "";
	Иначе
		Возврат ПоместитьВоВременноеХранилище(Стр.Условие,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;	
КонецФункции	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрДопУсловия Из ТекущийОбъект.ДополнительныеУсловия Цикл
		Если ЗначениеЗаполнено(СтрДопУсловия.Адрес) Тогда
			СтрДопУсловия.Условие = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрДопУсловия.Адрес),Новый СжатиеДанных(9));
			СтрДопУсловия.Адрес = "";
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
#КонецОбласти
