&НаСервере
Перем СписокКТК;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
	Если Параметры.Свойство("ВызовБезОткрытияФормы") И Параметры.ВызовБезОткрытияФормы = Истина Тогда
		Возврат;
	КонецЕсли;
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
	
	Если Параметры.Свойство("ИзОбработки") Тогда
		ИзОбработки = Параметры.ИзОбработки;
		КТКВХранилище = Параметры.КТКВХранилище;
		//Евросиб Каблов 29.08.2022 ( 56025
		//РеестрКлиента = Параметры.РеестрКлиента.Наименование;
		РеестрКлиента = Параметры.РеестрКлиента;
		//Евросиб Каблов 29.08.2022 )
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 ((
	ИначеЕсли Параметры.Свойство("ИзРелиза") Тогда
		ИзРелиза = Параметры.ИзРелиза;
		КТКВХранилище = Параметры.КТКВХранилище;
		РеестрКлиента = Параметры.РеестрКлиента;
		РелизСобственника = Параметры.РелизСобственника;
		//Сделка = Параметры.Сделка;
		// Евросиб Рыбьяков К.А. 22.07.2025 ))
	ИначеЕсли Параметры.Свойство("Повагонка") Тогда
		Повагонка = Истина;
		ТЗ_Данные = Параметры.МассивСтрок;
		Для Каждого Эл Из ТЗ_Данные Цикл
			Если СписокСделокПовагонки.НайтиПоЗначению(Эл.Сделка) = Неопределено Тогда
				СписокСделокПовагонки.Добавить(Эл.Сделка);
			КонецЕсли;
		КонецЦикла;	
	Иначе
		Сделка = Параметры.Сделка;
	КонецЕсли;
	//Если ИзОбработки = Неопределено Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 (( добавил НЕ ИзРелиза
	Если НЕ ИзОбработки И НЕ ИзРелиза Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		МассивСтруктур = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаСчетовПоКоносаментам);
		ЭтаФорма.ВыставленныеКоносаменты.Очистить();
		Для каждого СтрокаМассива Из МассивСтруктур Цикл
			нСтрока = ЭтаФорма.ВыставленныеКоносаменты.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, СтрокаМассива);
		КонецЦикла; 
		МассивСтруктур = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаСчетовПоЖД);
		ЭтаФорма.ВыставленныеЖД.Очистить();
		Для каждого СтрокаМассива Из МассивСтруктур Цикл
			нСтрока = ЭтаФорма.ВыставленныеЖД.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, СтрокаМассива);
		КонецЦикла; 
	КонецЕсли; 
	//ДИТ, Беляев СЮ, Ticket#0259010, 31-01-2022, начало
	Если Параметры.Свойство("АдресХранилищаСтрокБезКалькуляций") Тогда
		МассивСтруктур = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаСтрокБезКалькуляций);
		Для каждого СтрокаМассива Из МассивСтруктур Цикл
			нСтрока = ЭтаФорма.ПодозрительныеСтрокиБезПравил.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, СтрокаМассива);	
		КонецЦикла;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0259010, 31-01-2022, конец
	
	ПараметрыГалок = Новый Соответствие;
	Если Параметры.Свойство("ПараметрыГалок") Тогда ПараметрыГалок = Параметры.ПараметрыГалок; КонецЕсли;
	ДоступностьКнопкиЭДО = Ложь;
	МассивСтрок = Параметры.МассивСтрок;
	ДатаКурсаСчета = Неопределено;
	КурсСчета = Неопределено;
	
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, начало
	МассивКлиентовБезВидовДокументовДляФормирования = Новый Массив;
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, конец
	
	Для каждого Эл из МассивСтрок Цикл
		РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Эл.ПСЦ, "ФиксКурсВалюты, ПересчетСуммыИСФнаДатуСчета");
				
		//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, начало
		Если Эл.СписокДокументов = Неопределено Тогда
			МассивКлиентовБезВидовДокументовДляФормирования.Добавить(Эл.Клиент);
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, конец
		
		Для каждого ВД из Эл.СписокДокументов Цикл
			// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Начало
			Если ЗначениеЗаполнено(РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета)				
			// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Конец
				И РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета 
				И ВД.ВидДокумента = "Счет покупателю" 
				И ЗначениеЗаполнено(ВД.Документ) Тогда
				ДатаКурсаСчета = ВД.Документ.ДатаКурса;
				КурсСчета = ВД.Документ.КурсВзаиморасчетов;
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого ВД из Эл.СписокДокументов Цикл
			
			НСтр = ТЧ.Добавить();
			НСтр.ДополнительныеУслуги = ?(Эл.Свойство("УслугаВнеСтавки"), Эл.УслугаВнеСтавки, Неопределено);
			нСтр.ГУИД = ?(Эл.Свойство("ГУИД"), Эл.ГУИД, "");
			нСтр.ГруппировкаДаты = ?(Эл.Свойство("ПериодВО"), Эл.ПериодВО, Дата(1,1,1));
			//НСтр.ВидДокумента = ВД;
			НСтр.ВидДокумента = ВД.ВидДокумента;
			//Евросиб СубботинВ #122887 14.11.2025 Начало 
			Если ТипЗнч(ВД.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") и Не ЗначениеЗаполнено(валюта_ДатаКурса) Тогда 
				 валюта_ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВД.Документ, "ДатаДокумента");
			КонецЕсли;
			//Евросиб СубботинВ #122887 14.11.2025 Конец			
			нСтр.ДатаВыставления = ВД.ДатаВыставления;
			НСтр.ИдентификаторПакета = ВД.ИдентификаторПакета;
			НСтр.СсылкаНаДокумент = ВД.Документ;
			нСтр.ДокументыСформированы = ЗначениеЗаполнено(ВД.Документ);
			НСтр.Контрагент = Эл.Клиент; 
			Нстр.ЭтоФрахт = ВД.ЭтоФрахт;
			нСтр.ЭДО = Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Эл.Клиент);   
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
			НСтр.ДокументФФД = Эл.ДокументФФД;             
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
			ВД.Свойство("Коносамент", НСтр.Коносамент);
			Если нСтр.ЭДО Тогда
				ДоступностьКнопкиЭДО = Истина;
			КонецЕсли; 
			НСтр.Договор = Эл.Договор;
			//Евросиб Каблов 12.09.2023 ( #68187
			Если Эл.Свойство("ЭтоСНП") Тогда
				НСтр.ЭтоСНП = Эл.ЭтоСНП;
			КонецЕсли;
			//Евросиб Каблов 12.09.2023 )
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 29.11.2022
			// Было:
			//нСтр.ОтветственныйЗаУчет = эл.Договор.ОтветственныйЗаУчет; 
			//Стало: 
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Договор",				эл.Договор);
			СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
			СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
			нСтр.ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 29.11.2022
			
			ПараметрыТекСтроки = ПараметрыГалок.Получить(НСтр.Договор);
			Если ПараметрыТекСтроки <> неопределено Тогда
				НСтр.ГотовоКВыставлению = ПараметрыТекСтроки.ГотовоКВыставлению;
				//НСтр.ДокументыСформированы = ПараметрыТекСтроки.ДокументыСформированы;
				//НСтр.Пометка = (НСтр.ГотовоКВыставлению = Истина И НСтр.ДокументыСформированы = ЛОЖЬ И ПараметрыТекСтроки.ДокументыДляМеня = Истина);
			КонецЕсли;
			
			НСтр.ПСЦ = Эл.ПСЦ;
			// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 ((
			//НСтр.СтавкаНДС = ?(Параметры.Свойство("ИзОбработки"), Неопределено, Эл.СтавкаНДС);
			Если Параметры.Свойство("ИзОбработки") Или Параметры.Свойство("ИзРелиза") Тогда
				НСтр.СтавкаНДС = Неопределено;
			Иначе
				НСтр.СтавкаНДС = Эл.СтавкаНДС;
			КонецЕсли;
			//НСтр.СтавкаНДС = ?(Параметры.Свойство("ИзОбработки"), Неопределено, Эл.СтавкаНДС);
			// Евросиб Рыбьяков К.А. 22.07.2025 ))
			// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Начало
			Если ЗначениеЗаполнено(РеквизитыПСЦ.ФиксКурсВалюты)
			// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Конец
				И РеквизитыПСЦ.ФиксКурсВалюты > 0 
				И (ВД.ВидДокумента = "Счет покупателю" 
					ИЛИ РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета) Тогда
				нСтр.ДатаКурса = Дата(1,1,1);
				нСтр.КурсВалюты = РеквизитыПСЦ.ФиксКурсВалюты;
				нСтр.ФиксКурсВалюты = РеквизитыПСЦ.ФиксКурсВалюты;
			ИначеЕсли СтрНайти(ВД.ВидДокумента, "Счет покупателю") > 0
				И ЗначениеЗаполнено(ВД.Документ) Тогда
				нСтр.ДатаКурса = ВД.Документ.ДатаКурса;
				нСтр.КурсВалюты = ВД.Документ.КурсВзаиморасчетов;
				// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Начало
			ИначеЕсли ЗначениеЗаполнено(РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета)
				// ДИТ Поморцева Т.П. Задача 0233013 31.05.21. Конец
				И (РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета)
				И ЗначениеЗаполнено(КурсСчета) Тогда
				нСтр.ДатаКурса = ДатаКурсаСчета;
				нСтр.КурсВалюты = КурсСчета;
			Иначе
				нСтр.ДатаКурса = ВД.ДатаВыставления;
				нСтр.КурсВалюты = ПолучитьКурсВалютыПСЦНаДату(нСтр.ДатаКурса, нСтр.ПСЦ); 
			КонецЕсли; 
			Если Повагонка Тогда
				НСтр.ГУИД = Эл.ГУИД;
				НСтр.Сделка = Эл.Сделка;
			КонецЕсли;
			//Док = НайтиРанееСозданныеДокументыПоВидуДокумента(Эл.Клиент,Эл.Договор,ВД,Сделка);
			//Если Док <> Неопределено Тогда
			//	НСтр.СсылкаНаДокумент = Док;
			//	НСтр.СуммаДокумента = Док.СуммаДокумента;
			//КонецЕсли;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
			Если ТипЗнч(ВД) = Тип("Структура")
			   И ВД.Свойство("CreditNote") Тогда
				НСтр.CreditNote = ВД.CreditNote;	
			КонецЕсли;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Конец   
			// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 20.09.2023
			//НСтр.СсылкаНаДокументПервоначальная = Эл.УчДокумент;
			//ДИТ, Беляев СЮ, Ticket#0325648, 26-09-2023, начало
			НСтр.СсылкаНаДокументПервоначальная = ?(Эл.Свойство("УчДокумент"), Эл.УчДокумент, "");
			//ДИТ, Беляев СЮ, Ticket#0325648, 26-09-2023, конец
			// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 20.09.2023
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
			НСтр.ИдентификаторГруппировки = ?(Эл.Свойство("ИдентификаторГруппировки"), Эл.ИдентификаторГруппировки, "");
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
			// Евросиб US 82073 TA 115104 Рыбьяков К.А. 09.09.2025 ((
			НСтр.ИзРелиза = Эл.ИзРелиза;
			НСтр.РелизСобственника = Эл.РелизСобственника;
			// Евросиб Рыбьяков К.А. 09.09.2025 ))
		КонецЦикла;
	КонецЦикла;
			
	//Для каждого КА из Параметры.Контрагенты Цикл
	//	Для каждого ВД из Параметры.ВидыДокументов Цикл
	//		
	//		НСтр = ТЧ.Добавить();
	//		НСтр.ВидДокумента = ВД;
	//		НСтр.Контрагент = КА;
	//		Док = НайтиРанееСозданныеДокументыПоВИдуДокумента(ВД);
	//	КонецЦикла;
	//КонецЦикла;
	
//Евросиб Гудкова( 03.01.2021 
	ЭтаФорма.Заголовок = Сделка;
// Евросиб Гудкова)
	ВидОтбораПоОтветственному = ХранилищеНастроекДанныхФорм.Загрузить("СозданиеКомплектаДокументов", "ВидОтбораПоОтветственному");
	
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, начало
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКлиентовБезВидовДокументовДляФормирования);
	Для Каждого ЭлМассива Из МассивКлиентовБезВидовДокументовДляФормирования Цикл
		ТекстПроблемСНаборомДокументовДляФормирования.ДобавитьСтроку("   - "+ЭлМассива);
	КонецЦикла;
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, конец

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	////Евросиб СубботинВ #122887 14.11.2025 Начало
	//ОткрытыйПериодБУ = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ();
	//ДатаСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сделка, "Дата");
	//Если ДатаСделки < ОткрытыйПериодБУ или НЕ КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РаботаСДокументамиКлиентов") Тогда
	//	Элементы.валюта_ДатаКурса.Доступность = Ложь;
	//КонецЕсли; 	
	////Евросиб СубботинВ #122887 14.11.2025 Конец

КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Функция НайтиРанееСозданныеДокументыПоВИдуДокумента(Контрагент, ДоговорКонтрагента, ВидДокумента, Сделка)
	
	Запрос = Новый Запрос;
	
	Если ВидДокумента = "Счет покупателю" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		               |ГДЕ
		               |	СчетНаОплатуПокупателю.Контрагент = &Контрагент
		               |	И СчетНаОплатуПокупателю.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И СчетНаОплатуПокупателю.Сделка = &Сделка
		               |	И СчетНаОплатуПокупателю.АвансовыйСчет = ЛОЖЬ";
		
	ИначеЕсли ВидДокумента = "Реализация товаров и услуг" Тогда 
		//Евросиб СубботинВ #84453 02.07.2024 Начало // Сделку РТУ смотрим по ТЧ УСЛУГ
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		//               |ИЗ
		//               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//               |ГДЕ
		//               |	РеализацияТоваровУслуг.Контрагент = &Контрагент
		//               |	И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
		//			   |	И РеализацияТоваровУслуг.Сделка = &Сделка";
					   
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент
		               |	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугУслуги.Сделка = &Сделка
					   |";
		 //Евросиб СубботинВ #84453 02.07.2024 Конец 
		
	ИначеЕсли  ВидДокумента = "Отчет комитенту о закупках" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		               |ГДЕ
		               |	ОтчетКомитентуОПродажах.Контрагент = &Контрагент
		               |	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И ОтчетКомитентуОПродажах.Сделка = &Сделка";
	ИначеЕсли ВидДокумента = "Счет-фактура выданный" Тогда
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	СчетФактураВыданный.Ссылка КАК Ссылка
	                   |ИЗ
	                   |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                   |ГДЕ
	                   |	СчетФактураВыданный.ДоговорКонтрагента = &ДоговорКонтрагента
	                   |	И СчетФактураВыданный.Контрагент = &Контрагент
	                   |	И СчетФактураВыданный.ДокументОснование.Сделка = &Сделка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",Сделка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура СоздатьКомплект(Команда)
	
	НайденаХотьОднаСтрока = Ложь;
	Отказ = Ложь;
	НомерСтроки = 0;
	Для каждого Стр из ТЧ Цикл  
		Если Стр.Пометка = ИСТИНА Тогда //И НЕ ЗначениеЗаполнено(Стр.СсылкаНаДокумент) Тогда
			НайденаХотьОднаСтрока = Истина;
			//Евросиб - АСуслов 22.03.2022 15:45:21 #
			//(                                                                               
			МассивТиповДокументов = Новый Массив;
			МассивТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
			МассивТиповДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
			Если ЗначениеЗаполнено(Стр.СсылкаНаДокумент)
				И МассивТиповДокументов.Найти(ТипЗнч(Стр.СсылкаНаДокумент)) <> Неопределено Тогда
		        ОбщегоНазначенияКлиент.СообщитьПользователю("По помеченным строкам уже выставлены документы!
				//|Для повторного создания документов необходимо пометить их на удаление",, СтрШаблон("ТЧ[%1].СсылкаНаДокумент",Формат(НомерСтроки, "ЧГ=")));
				|Для повторного создания документов необходимо пометить их на удаление",, СтрШаблон("ТЧ[%1].Пометка",Формат(НомерСтроки, "ЧГ=")));
				Отказ = Истина;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 22.03.2022 15:45:22 #
			//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, начало
			Если Стр.ДатаВыставления > КонецДня(ТекущаяДата()) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Дата выставления не может быть больше текущей даты!",, СтрШаблон("ТЧ[%1].ДатаВыставления",Формат(НомерСтроки, "ЧГ=")));
				Отказ = Истина;
			КонецЕсли;
			//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, конец
		КонецЕсли;
		НомерСтроки = НомерСтроки+1;
	КонецЦикла;  
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ НайденаХотьОднаСтрока Тогда
		
		ПоказатьПредупреждение(, "Не выбрано ни одной строки, по которой возможно создать документы. Действие не выполнено.");
		Возврат;
		
	КонецЕсли;
	
	//Для каждого Стр из ТЧ Цикл
	//	Если ЗначениеЗаполнено(Стр.СсылкаНаДокумент) Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЦикла;
	
	Результат = СоздатьДокументыНаСервере();
	
	//Ин = ТЧ.Количество();
	//Пока Ин > 0 Цикл
	//	Если ТЧ[Ин-1].Пометка Тогда
	//		ТЧ.Удалить(Ин-1);
	//	КонецЕсли;
	//	Ин = Ин - 1;
	//КонецЦИкла;
	
	Для каждого Комплект Из Результат Цикл
		СтруктураСвойствВидовДокументов = Новый Структура;
		СтруктураСвойствВидовДокументов.Вставить("Счет", "Счет покупателю");
		СтруктураСвойствВидовДокументов.Вставить("Акт", "Реализация товаров и услуг");
		СтруктураСвойствВидовДокументов.Вставить("Отчет", "Отчет комитенту о закупках");
		СтруктураСвойствВидовДокументов.Вставить("Счф", "Счет-фактура выданный");
		СтруктураСвойствВидовДокументов.Вставить("СчфВозн", "Счет-фактура выданный (вознаграждение)");
		//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
		СтруктураСвойствВидовДокументов.Вставить("CreditNote", "Выставлять Credit note");
		//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
		Для каждого Свойство Из Комплект Цикл
			ТипДокумента = Неопределено;
			ЕстьСвойство = СтруктураСвойствВидовДокументов.Свойство(Свойство.Ключ,ТипДокумента);
			Если НЕ ЕстьСвойство Тогда
				Продолжить;
			КонецЕсли; 
			Строки = ТЧ.НайтиСтроки(Новый Структура("ВидДокумента, ИдентификаторПакета", ТипДокумента + ?(Комплект.ДополнительныеУслуги = Истина," (Дополнительные услуги)",""), Комплект.ИдентификаторПакета));
			Если Строки.Количество() > 0 Тогда
				НовСтр = Строки[0];
				//НовСтр = ТЧ.Добавить();
				//НовСтр.Пометка = Истина;
				//НовСтр.ВидДокумента = "Счет покупателю";
				НовСтр.СсылкаНаДокумент = Свойство.Значение;
				НовСтр.ДокументыСформированы = ЗначениеЗаполнено(Свойство.Значение);   
				// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 20.09.2023
				//НовСтр.СсылкаНаДокументПервоначальная = Комплект.Акт;
				//ДИТ, Беляев СЮ, Ticket#0325648, 26-09-2023, начало
				//НовСтр.СсылкаНаДокументПервоначальная = ?(Комплект.Свойство("Акт"), Комплект.Акт, "");
				//ДИТ, Беляев СЮ, Ticket#0325648, 26-09-2023, конец
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0397946, 05-06-2025, начало
				Если Комплект.Свойство("Акт") Тогда
					НовСтр.СсылкаНаДокументПервоначальная = Комплект.Акт;
				ИначеЕсли Комплект.Свойство("Отчет") Тогда
					НовСтр.СсылкаНаДокументПервоначальная = Комплект.Отчет;
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0397946, 05-06-2025, конец
				// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 20.09.2023
			КонецЕсли; 
			//НовСтр.Пометка = Ложь;
		КонецЦикла; 
		//Если Комплект.Свойство("Счет") Тогда
		//	Строки = ТЧ.НайтиСтроки(Новый Структура("ВидДокумента, ИдентификаторПакета", "Счет покупателю", Комплект.ИдентификаторПакета));
		//	НовСтр = Строки[0];
		//	//НовСтр = ТЧ.Добавить();
		//	//НовСтр.Пометка = Истина;
		//	//НовСтр.ВидДокумента = "Счет покупателю";
		//	НовСтр.СсылкаНаДокумент = Комплект.Счет;
		//	НовСтр.ДокументыСформированы = Истина;
		//	НовСтр.Пометка = Ложь;
		//	//НовСтр.Контрагент = Комплект.Контрагент;
		//	//НовСТр.Договор = Комплект.Договор;
		//	//НовСтр.ЭДО = Комплект.ЭДО;
		//КонецЕсли;
		//Если Комплект.Свойство("Акт") Тогда
		//	Строки = ТЧ.НайтиСтроки(Новый Структура("ВидДокумента, ИдентификаторПакета", "Реализация товаров и услуг", Комплект.ИдентификаторПакета));
		//	НовСтр = Строки[0];
		//	//НовСтр = ТЧ.Добавить();
		//	//НовСтр.Пометка = Истина;
		//	//НовСтр.ВидДокумента = "Реализация товаров и услуг";
		//	НовСтр.СсылкаНаДокумент = Комплект.Акт;
		//	//НовСтр.Контрагент = Комплект.Контрагент;
		//	//НовСТр.Договор = Комплект.Договор;
		//	//НовСтр.ЭДО = Комплект.ЭДО;
		//КонецЕсли;
		//Если Комплект.Свойство("Отчет") Тогда
		//	Строки = ТЧ.НайтиСтроки(Новый Структура("ВидДокумента, ИдентификаторПакета", "Отчет комитенту о закупках", Комплект.ИдентификаторПакета));
		//	НовСтр = Строки[0];
		//	//НовСтр = ТЧ.Добавить();
		//	//НовСтр.Пометка = Истина;
		//	//НовСтр.ВидДокумента = "Отчет комитенту о закупках";
		//	НовСтр.СсылкаНаДокумент = Комплект.Отчет;
		//	//НовСтр.Контрагент = Комплект.Контрагент;
		//	//НовСТр.Договор = Комплект.Договор;
		//	//НовСтр.ЭДО = Комплект.ЭДО;
		//КонецЕсли;
		//Если Комплект.Свойство("СчФ") Тогда
		//	Строки = ТЧ.НайтиСтроки(Новый Структура("ВидДокумента, ИдентификаторПакета", "Счет-фактура выданный", Комплект.ИдентификаторПакета));
		//	НовСтр = Строки[0];
		//	//НовСтр = ТЧ.Добавить();
		//	//НовСтр.Пометка = Истина;
		//	//НовСтр.ВидДокумента = "Счет-фактура выданный";
		//	НовСтр.СсылкаНаДокумент = Комплект.СчФ;
		//	//НовСтр.Контрагент = Комплект.Контрагент;
		//	//НовСТр.Договор = Комплект.Договор;
		//	//НовСтр.ЭДО = Комплект.ЭДО;
		//КонецЕсли;
	
	КонецЦикла;
	
	Если Повагонка Тогда
		ЗаписатьДанныеВРСПОвагонки(СписокСделокПовагонки,Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВРСПОвагонки(СписокСделокПовагонки,Результат)
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
	//УслугаПовагонки = Константы.УслугаДляПовагоннойЗаявки.Получить();
	//УслугаСНП = Константы.УслугаСНППоВагону.Получить();
	
	//Для Каждого Эл Из Результат Цикл
	//	Если НЕ Эл.Свойство("Акт") Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ВыставлениеПосуточнойАрендыОбороты.Период КАК Период,
	//	               |	ВыставлениеПосуточнойАрендыОбороты.НомерВагона КАК НомерВагона
	//	               |ИЗ
	//	               |	РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
	//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	//	               |		ПО ВыставлениеПосуточнойАрендыОбороты.Период = ПовагонныеОтправки.ДатаОтправления
	//	               |			И ВыставлениеПосуточнойАрендыОбороты.НомерВагона = ПовагонныеОтправки.Вагон
	//	               |ГДЕ
	//	               |	ВыставлениеПосуточнойАрендыОбороты.Регистратор = &Регистратор";
	//	Запрос.УстановитьПараметр("Регистратор",Эл.Акт);
	//	Ответ = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Ответ.Следующий() Цикл
	//		
	//		НетИзменений = Истина;
	//		
	//		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
	//		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
	//		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
	//		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
	//		
	//		ТекЗапись.Прочитать();
	//		Если НЕ ТекЗапись.Выбран() Тогда
	//			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
	//		КонецЕсли;
	//	
	//		РТУ_ТЧ = Эл.Акт.РасшифровкаУслугПоТС;
	//		Для Каждого Стр Из РТУ_ТЧ Цикл
	//			Если Стр.Вагон = ТекЗапись.Вагон Тогда
	//				//Если Стр.Услуга = УслугаПовагонки Тогда
	//				//	ТекЗапись.РТУ = Истина;
	//				// запишем данные по РТУ СНП, т.к. их по одному на вагон
	//				Если Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП погрузки" Тогда
	//					ТекЗапись.РТУСНППогрузки = Истина;
	//					НетИзменений = Ложь;
	//				ИначеЕсли Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП выгрузки" Тогда
	//					ТекЗапись.РТУСНПВыгрузки = Истина;
	//					НетИзменений = Ложь;
	//				ИначеЕсли Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП следования" Тогда
	//					ТекЗапись.РТУСНППеревозки = Истина;
	//					НетИзменений = Ложь;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если НетИзменений = Ложь Тогда
	//			ТекЗапись.Записать();
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//		
	//КонецЦикла; 
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	
	// для сделки прописать данные в ТЧ доходы (информация о созданных реализациях)
	Для Каждого ЭлСп Из СписокСделокПовагонки Цикл
		ПолучОб = ЭлСп.Значение.ПолучитьОбъект();
		Для Каждого Стр Из ПолучОб.Доходы Цикл
			Для Каждого Эл Из Результат Цикл
				Если НЕ Эл.Свойство("Акт") Тогда
					Продолжить;
				КонецЕсли; 
				РТУ_ТЧ = Эл.Акт.РасшифровкаУслугПоТС;
				Для Каждого СтрРТУ Из РТУ_ТЧ Цикл
					Если Стр.ГУИД = СтрРТУ.СтрокаДоходовСделки Тогда
						Стр.УчДокумент = Эл.Акт;
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
		ПОлучОб.Записать();
	
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Функция СоздатьДокументыНаСервере()
	
	МассивРезультат = Новый Массив;
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("Пометка",Истина);
	ТЗКлиентДоговор = ТЧ.Выгрузить(ПараметрыОтбораСтрок);
	//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
	ПараметрыОтбораСтрок.Вставить("CreditNote", Ложь);
	//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
	
	//Для каждого Стр из ТЗКлиентДоговор Цикл
	//	Если Не Стр.Пометка Тогда
	//		ТЗКлиентДоговор.Удалить(Стр);
	//	КонецЕсли;
	//КонецЦикла;
	Если Повагонка Тогда
		//ТЗКлиентДоговор.Свернуть("Контрагент,Договор,ГУИД,Сделка, ИдентификаторПакета, ДополнительныеУслуги, СтавкаНДС, ДокументФФД");
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		ТЗКлиентДоговор.Свернуть("Контрагент,Договор,ГУИД,Сделка, ИдентификаторПакета, ДополнительныеУслуги, СтавкаНДС, ДокументФФД, ИдентификаторГруппировки");
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
	Иначе
		//Добавил ГУИД - он заполнен только у доп. услуг
		//Добавил ГруппировкаДаты - заполнена только у тех строк, где нужна группировка по датам периода во.
		//Добавлена ставка ндс
		//ТЗКлиентДоговор.Свернуть("Контрагент,Договор, ИдентификаторПакета, ДополнительныеУслуги, ПСЦ, Коносамент, ГУИД, ГруппировкаДаты, СтавкаНДС, ЭтоФрахт");
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		//ТЗКлиентДоговор.Свернуть("Контрагент,Договор, ИдентификаторПакета, ДополнительныеУслуги, ПСЦ, Коносамент, ГУИД, ГруппировкаДаты, СтавкаНДС, ЭтоФрахт, ДокументФФД");
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		//Евросиб Каблов 12.09.2023 ( #68187
		//ТЗКлиентДоговор.Свернуть("Контрагент,Договор, ИдентификаторПакета, ДополнительныеУслуги, ПСЦ, Коносамент, ГУИД, ГруппировкаДаты, СтавкаНДС, ЭтоФрахт, ДокументФФД, ЭтоСНП");
		//Евросиб Каблов 12.09.2023 )
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
		ТЗКлиентДоговор.Свернуть("Контрагент,Договор, ИдентификаторПакета, ДополнительныеУслуги, ПСЦ, Коносамент, ГУИД, 
						|ГруппировкаДаты, СтавкаНДС, ЭтоФрахт, ДокументФФД, ЭтоСНП, ИдентификаторГруппировки, ИзРелиза, РелизСобственника");
		//ТЗКлиентДоговор.Свернуть("Контрагент,Договор, ИдентификаторПакета, ДополнительныеУслуги, ПСЦ, Коносамент, ГУИД, ГруппировкаДаты, СтавкаНДС, ЭтоФрахт, ДокументФФД, ЭтоСНП, ИдентификаторГруппировки, ИзРелиза");
		// Евросиб Рыбьяков К.А. 17.03.2026 ))
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
	КонецЕсли;
	//Евросиб - АСуслов 26.04.2022 20:26:54 #45021
	//(
	ТЗКлиентДоговор.Сортировать("Договор, ПСЦ, ГруппировкаДаты Возр");
	//)
	//Евросиб - АСуслов 26.04.2022 20:26:54 #45021
	
	АктДляСледующегоШага = Неопределено;
	НеОчищатьДокументы = Ложь;  
	//Евросиб - АСуслов 26.04.2022 20:28:41 #45021
	//(
	ТекМесяцВыставления = Дата(1,1,1);
	//)
	//Евросиб - АСуслов 26.04.2022 20:28:55 #45021
	
	//Евросиб Каблов 12.09.2023 ( #68187
	//ТаблицаГУИДовДоходов = ТЗКлиентДоговор.Скопировать(, "ГУИД");
	//ТаблицаГУИДовДоходов.Свернуть("ГУИД");
	//Евросиб Каблов 12.09.2023 )
	
	Для каждого Стр из ТЗКлиентДоговор Цикл
		
		//Евросиб Каблов 12.09.2023 ( #68187
		//ИсключаемыеГУИДыДоходов = ТаблицаГУИДовДоходов.ВыгрузитьКолонку("ГУИД");
		//ИндексТекГУИДа = ИсключаемыеГУИДыДоходов.Найти(Стр.ГУИД);
		//Если ИндексТекГУИДа <> Неопределено Тогда
		//	ИсключаемыеГУИДыДоходов.Удалить(ИндексТекГУИДа);
		//КонецЕсли;
		//Евросиб Каблов 12.09.2023 )
		
		Если НЕ ЗначениеЗаполнено(ТекМесяцВыставления) Тогда
			ТекМесяцВыставления = НачалоМесяца(Стр.ГруппировкаДаты)
		КонецЕсли;
		_ПСЦ = неопределено;
		_ЗнКурса = неопределено;
		//Для каждого Стр2 из ТЧ Цикл
		//ДИТ, Беляев СЮ, Ticket#0331262, 20-11-2023, начало
		СтруктураОтбора = Новый Структура("Пометка", Истина);
		ОтмеченныеСтроки = ТЧ.НайтиСтроки(СтруктураОтбора);
		Для каждого Стр2 из ОтмеченныеСтроки Цикл
		//ДИТ, Беляев СЮ, Ticket#0331262, 20-11-2023, конец
			Если Стр2.Контрагент = Стр.Контрагент И Стр2.Договор = Стр.Договор Тогда
				_ПСЦ = Стр2.ПСЦ;
				Если Стр2.ВидДокумента = "Счет покупателю" Тогда
					_ЗнКурса = Стр2.КурсВалюты;
				КонецЕсли; 
				ДатаВыставленияДокументов = Стр2.ДатаВыставления;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьСчет = Ложь;
		ЕстьАкт = Ложь;
		ЕстьОтчет = Ложь;
		ЕстьСчФ = Ложь;
		Акт = Неопределено;
		Отчет = Неопределено;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", Стр.Контрагент);
		СтруктураОтбора.Вставить("Договор", Стр.Договор);
		СтруктураОтбора.Вставить("ИдентификаторПакета", Стр.ИдентификаторПакета);
		
		Если Повагонка Тогда
			СтруктураОтбора.Вставить("ГУИД", Стр.ГУИД);
		КонецЕсли;
		
		МассивВидовДокументов = ТЧ.НайтиСтроки(СтруктураОтбора);
		
		//РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,Стр.Договор,Сделка,Стр.ГУИД);
		
		ДополнительныеУслуги = Ложь;
		ЭтоВР = Ложь;
		Для каждого Эл из МассивВидовДокументов Цикл
			Если СтрНайти(Эл.ВидДокумента, "Отчет комитенту о закупках") > 0 Тогда
				ЭтоВР = Истина;
			КонецЕсли;
			Если НЕ Эл.Пометка Тогда
				Продолжить;
			КонецЕсли; 
			Если СтрНайти(Эл.ВидДокумента, "Счет покупателю") > 0 Тогда
				ЕстьСчет = Истина;
				_ЗнКурса = Эл.КурсВалюты;
			ИначеЕсли СтрНайти(Эл.ВидДокумента, "Реализация товаров и услуг" ) > 0 Тогда
				ЕстьАкт = Истина;
				Акт = ?(ЗначениеЗаполнено(Эл.СсылкаНаДокумент),Эл.СсылкаНаДокумент,Неопределено);
				ДатаВыставленияДокументов = Эл.ДатаВыставления;
			ИначеЕсли СтрНайти(Эл.ВидДокумента, "Отчет комитенту о закупках") > 0 Тогда
				ЕстьОтчет = Истина;
				Отчет = ?(ЗначениеЗаполнено(Эл.СсылкаНаДокумент),Эл.СсылкаНаДокумент,Неопределено);
			ИначеЕсли СтрНайти(Эл.ВидДокумента, "Счет-фактура выданный") > 0 Тогда
				ЕстьСчФ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(
								Неопределено,
								Неопределено,
								Неопределено,
								Стр.ДокументФФД);
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

		Если ЭтоВР Тогда
			//ВыборкаДанных = ПолучитьВыборкуДляОтчета(Сделка, Стр.Контрагент,Стр.Договор, Стр.ПСЦ, Стр.ГУИД);
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
			ВыборкаДанных = ПолучитьВыборкуДляОтчета(Сделка, Стр.Контрагент,Стр.Договор, Стр.ПСЦ, Стр.ГУИД, Стр.ИдентификаторГруппировки);
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		ИначеЕсли Повагонка Тогда          
			//РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,Стр.Договор,Стр.Сделка,Стр.СтавкаНДС,Стр.ГУИД); 
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
			//РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,Стр.Договор,Стр.Сделка,Стр.СтавкаНДС,Стр.ГУИД,,,,,,,ПараметрыФФД);
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
			//Евросиб Каблов 12.09.2023 ( #68187
			//РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,Стр.Договор,Стр.Сделка,Стр.СтавкаНДС,Стр.ГУИД,,,,,,,,ПараметрыФФД);
			//Евросиб Каблов 12.09.2023 )
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
			РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,Стр.Договор,Стр.Сделка,Стр.СтавкаНДС,Стр.ГУИД,,,,,,,,ПараметрыФФД,Стр.ИдентификаторГруппировки);
			//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 ((
		ИначеЕсли ИзРелиза Или Стр.ИзРелиза Тогда
			РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,
															  Стр.Договор,
															  Сделка,
															  Неопределено,//Перечисления.СтавкиНДС.НДС20,
															  Стр.ГУИД,
															  Стр.ДополнительныеУслуги,
															  Акт,
															  Стр.ПСЦ,
															  Неопределено,
															  Дата(1, 1, 1),
															  Ложь,
															  Стр.ЭтоСНП,
															  ПараметрыФФД,
															  Стр.ИдентификаторГруппировки,
															  Истина);
		// Евросиб Рыбьяков К.А. 22.07.2025 ))
		Иначе
			РезультатЗапроса = ВыборкаДанныхПоКлиентуДоговору(Стр.Контрагент,
															  Стр.Договор,
															  Сделка,
															  ?(ИзОбработки, Неопределено, Стр.СтавкаНДС),
															  //Неопределено,
															  Стр.ГУИД,
															  Стр.ДополнительныеУслуги,
															  Акт,
															  ?(ИзОбработки, Неопределено, Стр.ПСЦ),
															  ?(ИзОбработки, Неопределено, Стр.Коносамент),
															  ?(ИзОбработки, Дата(1, 1, 1), Стр.ГруппировкаДаты),
															  ?(ИзОбработки, Ложь, Стр.ЭтоФрахт),
															  //Евросиб Каблов 12.09.2023 ( #68187
															  Стр.ЭтоСНП,
															  //Евросиб Каблов 12.09.2023 )
															  //ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
															  ПараметрыФФД,
															  //ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
															  //Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
															  Стр.ИдентификаторГруппировки);
															  //Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		КонецЕсли;
		// для тех контрагентов, у которых стоит флаг ОдинКоносаментОдинДокумент, необходимо данные сгруппировать по коносаменту
		// для этого делаем запрос по таблице
		//НайденныйКлиент = Справочники.ФормированиеФинДокументов.НайтиПоРеквизиту("Контрагент",Стр.Контрагент);
		
		//по коносаменту могут быть уже созданные акты, найдем их и будем дозаполнять
		//Если ЗначениеЗаполнено(Стр.Коносамент) 
		//	И НайденныйКлиент.ОбъединятьКоносаментыИзРазныхСделок Тогда
		//	Акт = НайтиАктПоКоносаменту(Стр.Коносамент, Сделка);
		//	Если ЗначениеЗаполнено(Акт) Тогда
		//		НеОчищатьДокументы = Истина;
		//	КонецЕсли; 
		//КонецЕсли; 
		
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		//НеОдинКоносаментОдинДокумент_или_ДаГруппироватьСтрокиПоРазличнымПСЦ = Ложь;
		//ГруппироватьСтрокиПоРазличнымПСЦ = Ложь;
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		ОдинКоносаментОдинДокумент = Ложь;
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		
		//по коносаменту могут быть уже созданные акты, найдем их и будем дозаполнять
		Если ПараметрыФФД <> Неопределено Тогда 
			//Евросиб Каблов 24.12.2021 (
			Если Не Повагонка Тогда
				//Евросиб Каблов 24.12.2021 )
				Если ЗначениеЗаполнено(Стр.Коносамент) И ПараметрыФФД.ОбъединятьКоносаментыИзРазныхСделок Тогда
					Акт = НайтиАктПоКоносаменту(Стр.Коносамент, Сделка);
					Если ЗначениеЗаполнено(Акт) Тогда
						НеОчищатьДокументы = Истина;
					КонецЕсли; 
				КонецЕсли;  
				//Евросиб Каблов 24.12.2021 (
			КонецЕсли;
			//Евросиб Каблов 24.12.2021 )
			
			//Если НЕ ПараметрыФФД.ОдинКоносаментОдинДокумент ИЛИ ПараметрыФФД.ГруппироватьСтрокиПоРазличнымПСЦ Тогда 
			//	НеОдинКоносаментОдинДокумент_или_ДаГруппироватьСтрокиПоРазличнымПСЦ = Истина;	
			//КонецЕсли; 
			//ГруппироватьСтрокиПоРазличнымПСЦ = ПараметрыФФД.ГруппироватьСтрокиПоРазличнымПСЦ;
			//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
			ОдинКоносаментОдинДокумент = ПараметрыФФД.ОдинКоносаментОдинДокумент
			//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		КонецЕсли;  
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		
		//Если (НайденныйКлиент.Пустая() ИЛИ НЕ НайденныйКлиент.ОдинКоносаментОдинДокумент ИЛИ НайденныйКлиент.ГруппироватьСтрокиПоРазличнымПСЦ ИЛИ ЭтоВР) И НЕ Повагонка Тогда		
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		//Если НЕ Повагонка И (ПараметрыФФД = Неопределено ИЛИ НеОдинКоносаментОдинДокумент_или_ДаГруппироватьСтрокиПоРазличнымПСЦ ИЛИ ЭтоВР) Тогда
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		Если НЕ Повагонка И (ПараметрыФФД = Неопределено ИЛИ НЕ ОдинКоносаментОдинДокумент ИЛИ ЭтоВР) Тогда
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
			Если Не ЭтоВР Тогда
				ВыборкаДанных = РезультатЗапроса.Выбрать();
				//Евросиб - АСуслов 28.04.2022 14:02:59 #45021
				//используем предыдущий акт только если он в том же месяце выставления
				//(
				Если ТекМесяцВыставления = Стр.ГруппировкаДаты Тогда
					Акт = ?(ЗначениеЗаполнено(АктДляСледующегоШага), АктДляСледующегоШага, Акт);
				КонецЕсли;
				//)
				//Евросиб - АСуслов 28.04.2022 14:03:07 #45021
			КонецЕсли;                                                                                                                                                                                                                   
			//МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов,НеОчищатьДокументы, ЭтоВР);
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
			// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
			МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,
							Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов,НеОчищатьДокументы, ЭтоВР, ПараметрыФФД, Стр.РелизСобственника);
			//МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов,НеОчищатьДокументы, ЭтоВР, ПараметрыФФД);
			// Евросиб Рыбьяков К.А. 17.03.2026 ))
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
			Для каждого СтруктураКомплекта из МассивДокументов Цикл
				СтруктураКомплекта.Вставить("ИдентификаторПакета", Стр.ИдентификаторПакета);
				СтруктураКомплекта.Вставить("ДополнительныеУслуги", Стр.ДополнительныеУслуги);
				МассивРезультат.Добавить(СтруктураКомплекта); 
				//Если НайденныйКлиент.ГруппироватьСтрокиПоРазличнымПСЦ Тогда
				//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, закомментировал (
				////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
				//Если ГруппироватьСтрокиПоРазличнымПСЦ Тогда     
				////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --                        
				//	АктДляСледующегоШага = ?(СтруктураКомплекта.Свойство("Акт"),СтруктураКомплекта.Акт,Неопределено);
				//	НеОчищатьДокументы = Истина;
				//КонецЕсли; 
				//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, закомментировал )
				//Евросиб - АСуслов 26.04.2022 20:35:01 #45021
				//(
				ТекМесяцВыставления = НачалоМесяца(Стр.ГруппировкаДаты);
				//)
				//Евросиб - АСуслов 26.04.2022 20:35:04 #45021
			КонецЦикла;
		ИначеЕсли Повагонка Тогда
			ВыборкаДанных = РезультатЗапроса.Выбрать(); 
			//МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Стр.Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов);
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
			МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Стр.Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов,,,ПараметрыФФД);
			//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
			Для каждого СтруктураКомплекта из МассивДокументов Цикл
				СтруктураКомплекта.Вставить("ИдентификаторПакета", Стр.ИдентификаторПакета);
				СтруктураКомплекта.Вставить("ДополнительныеУслуги", Стр.ДополнительныеУслуги);
				МассивРезультат.Добавить(СтруктураКомплекта);
			КонецЦикла;
		Иначе
			ТЗ_РЗ = РезультатЗапроса.Выгрузить();
			Попытка
				ТЗ_РЗ.Колонки.Добавить("Вагон",Новый ОписаниеТипов("СправочникСсылка.ТС"));
			Исключение
			КонецПопытки;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   //Евросиб Каблов 04.05.2021 ( Ticket#0231162						   
						   |	ВТ.Сделка КАК Сделка,
						   //Евросиб Каблов 04.05.2021 )
			               |	ВТ.Клиент КАК Клиент,
			               |	ВТ.СтанцияОтправления КАК СтанцияОтправления,
			               |	ВТ.СтанцияНазначения КАК СтанцияНазначения,
			               |	ВТ.Услуга КАК Услуга,
			               |	ВТ.СтавкаНДС КАК СтавкаНДС,
			               |	ВТ.СуммаНДС КАК СуммаНДС,
			               |	ВТ.ГУИД КАК ГУИД,
			               |	ВТ.Перевыставляемая КАК Перевыставляемая,
			               |	ВТ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
			               |	ВТ.Калькуляция КАК Калькуляция,
			               |	ВТ.Ставка КАК Ставка,
			               |	ВТ.ТипВагонов КАК ТипВагонов,
			               |	ВТ.Груз КАК Груз,
			               |	ВТ.ПериодВО КАК ПериодВО,
			               |	ВТ.Валюта КАК Валюта,
			               |	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
			               |	ВТ.Маршрут КАК Маршрут,
			               |	ВТ.СтавкаИтого КАК СтавкаИтого,
			               |	ВТ.Вагон КАК Вагон,
			               |	ВТ.ТипЗаказа КАК ТипЗаказа,
			               |	ВТ.Количество КАК Количество,
			               |	ВТ.СуммаИтого КАК СуммаИтого,
						   |	ВТ.РазмерКТК КАК РазмерКТК,
			               //|	ВТ.Заявка КАК Заявка,
			               |	ВТ.РеестрКлиента КАК РеестрКлиента,
						   //Евросиб - АСуслов 11.03.2022 9:43:49 #45629
						   //(
			               |	ВТ.УслугаВнеСтавки КАК УслугаВнеСтавки,
						   //)
						   //Евросиб - АСуслов 11.03.2022 9:43:51 #45629
			               |	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
						//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 ++	
						   //|	ВТ.ОкруглениеКурса КАК ОкруглениеКурса,
						//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 --	
			               |	ВТ.ДокументФФД КАК ДокументФФД,
						   |    ВТ.Коносамент,
						   //Евросиб Каблов 13.11.2023 ( #68187
						   |	ВТ.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
						   //Евросиб Каблов 13.11.2023 )
						   //Евросиб Каблов 07.11.2022 ( 54532
						   |    ВТ.ДоплатныеКТК
						   //Евросиб Каблов 07.11.2022 )
			               |ПОМЕСТИТЬ ВремТЧ
			               |ИЗ
			               |	&ВТ КАК ВТ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
						   //Евросиб Каблов 04.05.2021 ( Ticket#0231162						   
						   |	ВремТЧ.Сделка КАК Сделка,
						   //Евросиб Каблов 04.05.2021 )
			               |	ВремТЧ.Клиент КАК Клиент,
			               |	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
			               |	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения,
			               |	ВремТЧ.Услуга КАК Услуга,
			               |	ВремТЧ.СтавкаНДС КАК СтавкаНДС,
			               |	ВремТЧ.СуммаНДС КАК СуммаНДС,
			               |	ВремТЧ.ГУИД КАК ГУИД,
			               |	ВремТЧ.Перевыставляемая КАК Перевыставляемая,
			               |	ВремТЧ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
			               |	ВремТЧ.Калькуляция КАК Калькуляция,
			               |	ВремТЧ.Ставка КАК Ставка,
			               |	ВремТЧ.ТипВагонов КАК ТипВагонов,
			               |	ВремТЧ.Груз КАК Груз,
			               |	ВремТЧ.ПериодВО КАК ПериодВО,
			               |	ВремТЧ.Валюта КАК Валюта,
			               |	ВремТЧ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
			               |	ВремТЧ.Маршрут КАК Маршрут,
			               |	ВремТЧ.СтавкаИтого КАК СтавкаИтого,
			               |	ВремТЧ.Вагон КАК Вагон,
			               |	ВремТЧ.ТипЗаказа КАК ТипЗаказа,
			               |	ВремТЧ.Количество КАК Количество,
			               |	ВремТЧ.СуммаИтого КАК СуммаИтого,
						   |	ВремТЧ.РазмерКТК КАК РазмерКТК,
			              // |	ВремТЧ.Заявка КАК Заявка,
						   //Евросиб - АСуслов 11.03.2022 9:43:49 #45629
						   //(
			               |	ВремТЧ.УслугаВнеСтавки КАК УслугаВнеСтавки,
						   //)
						   //Евросиб - АСуслов 11.03.2022 9:43:51 #45629
			               |	ВремТЧ.РеестрКлиента КАК РеестрКлиента,
			               |	ВремТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
						//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 ++	
						   //|	ВремТЧ.ОкруглениеКурса КАК ОкруглениеКурса,
			               |	&ОкруглениеКурса КАК ОкруглениеКурса,
						//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 --	
			               |	ВремТЧ.ДокументФФД КАК ДокументФФД,
						   |    ВремТЧ.Коносамент,
						   //Евросиб Каблов 13.11.2023 ( #68187
						   |	ВремТЧ.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
						   //Евросиб Каблов 13.11.2023 )
						   //Евросиб Каблов 07.11.2022 ( 54532
						   |    ВремТЧ.ДоплатныеКТК
						   //Евросиб Каблов 07.11.2022 )
			               |ИЗ
			               |	ВремТЧ КАК ВремТЧ
			               |ИТОГИ ПО
			               |	РеестрКлиента";
			Запрос.УстановитьПараметр("ВТ",ТЗ_РЗ);
			//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 ++	
			Запрос.УстановитьПараметр("ОкруглениеКурса",ПараметрыФФД.ОкруглениеКурса);
			//ДИТ, Гаузер АВ, Ticket#0277400, 04.07.2022 --	
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаРеестрКлиента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРеестрКлиента.Следующий() Цикл
				ВыборкаДанных = ВыборкаРеестрКлиента.Выбрать();
			    //МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов, НеОчищатьДокументы, ЭтоВР);
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
				МассивДокументов = СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ,Стр.Контрагент,Стр.Договор,Сделка,ВыборкаДанных, _ПСЦ, _ЗнКурса, ДатаВыставленияДокументов, НеОчищатьДокументы, ЭтоВР, ПараметрыФФД);
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
					Для каждого СтруктураКомплекта из МассивДокументов Цикл
						СтруктураКомплекта.Вставить("ИдентификаторПакета", Стр.ИдентификаторПакета);
						СтруктураКомплекта.Вставить("ДополнительныеУслуги", Стр.ДополнительныеУслуги);
						МассивРезультат.Добавить(СтруктураКомплекта);
					КонецЦикла;
//				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
	// Форматрование credit note
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("Пометка", Истина);
	ПараметрыОтбораСтрок.Вставить("CreditNote", Истина);
	
	ТЗКлиентДоговор = ТЧ.Выгрузить(ПараметрыОтбораСтрок);
	Для Каждого Стр из ТЗКлиентДоговор Цикл
		
		СчетОснование = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
		
		НайденныеСтроки = ТЧ.НайтиСтроки(Новый Структура("ИдентификаторПакета", Стр.ИдентификаторПакета));
		Для Инд = 0 по НайденныеСтроки.Количество() - 1 Цикл
			Если НЕ НайденныеСтроки[Инд].CreditNote 
			   И ТипЗнч(НайденныеСтроки[Инд].СсылкаНаДокумент) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
			   И ЗначениеЗаполнено(НайденныеСтроки[Инд].СсылкаНаДокумент) Тогда
			   	 СчетОснование = НайденныеСтроки[Инд].СсылкаНаДокумент;
				 Прервать;
			 КонецЕсли;
		КонецЦикла;			   
		
		// Сформируем CreditNote
		МассивДокументов = Документы.Сделка.СформироватьСчетНаОплатуПокупателюCreditNote(Сделка, Стр.Контрагент,Стр.Договор, СчетОснование); 
		Для каждого СтруктураКомплекта из МассивДокументов Цикл
			СтруктураКомплекта.Вставить("ИдентификаторПакета", Стр.ИдентификаторПакета);
			СтруктураКомплекта.Вставить("ДополнительныеУслуги", Стр.ДополнительныеУслуги);
			МассивРезультат.Добавить(СтруктураКомплекта);
		КонецЦикла;	
	КонецЦикла;
	//ДИТ Давудов М.А. Task32744 03.07.2021 Конец

	Возврат МассивРезультат;
КонецФункции

&НаСервере
Функция СоздатьНовыйСчетНаОплату(ПараметрыФФД, ДатаВыставленияДокументов)
	НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	//Евросиб Каблов 12.09.2023 ( #68187
	НовДок.УстановитьСсылкуНового(Документы.СчетНаОплатуПокупателю.ПолучитьСсылку());
	//Евросиб Каблов 12.09.2023 )
	НовДок.Заполнить(Неопределено);
	НовДок.Дата = ТекущаяДата();
	//НовДок.ДатаДокумента = ТекущаяДата();
	Если ПараметрыФФД <> Неопределено 
		И ПараметрыФФД.ВыставлятьЗакрывающиеСчетаТекущейДатой = Истина Тогда
		НовДок.ДатаДокумента = ТекущаяДата();
	Иначе
		НовДок.ДатаДокумента = ДатаВыставленияДокументов;
	КонецЕсли; 
	//Евросиб Гудкова( 03.01.2021 Ticket№ 0218868
	Если Год(НовДок.ДатаДокумента) <> Год(НовДок.Дата) Тогда
		//НовДок.Дата = НовДок.ДатаДокумента;				
		//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, начало
		НовДок.Дата = КонецМесяца(НовДок.ДатаДокумента);
		//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, конец
		НовДок.УстановитьНовыйНомер();
	КонецЕсли; 
	// Евросиб Гудкова)
	//Евросиб Каблов 09.04.2025 ( #105407
	//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
	НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
	//Евросиб Каблов 09.04.2025 )
	Возврат НовДок;
КонецФункции

//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
&НаСервере
Функция ПолучитьДатуКурсаИзАвансовогоСчета(АС, Выборка)
	ДатаКурса = Неопределено;
	Если АС <> Неопределено Тогда
		АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
		Если АСК.Количество() > 0 Тогда
			СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
			Если СтрокаСчетАванса <> Неопределено Тогда
				ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
			КонецЕсли; 
		КонецЕсли;
		Если ДатаКурса = Неопределено Тогда
			СтрокиАванс = Неопределено;
			СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
			Если СчетАвансаПоКТК.Количество() > 0 Тогда
				СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
			КонецЕсли;
			Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Услуга));
			КонецЕсли; 
			Если СтрокиАванс.Количество() > 0 Тогда
				СтрокаСчетАванса = СтрокиАванс[0]; 
				ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаКурса;				
КонецФункции
//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец  

//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
&НаСервере
Процедура УменьшитьСуммуНаВеличинуАвансовогоСчета(АС, Выборка, НовДок, НовСтр, ПредыдущийСчет, ВидыФормируемыхДокументов)
	Если АС <> Неопределено Тогда
		АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
		ПересчитатьОсновнуюТаблицуАвансов = Ложь;
		СтрокиАванс = Неопределено;
		Если АСК.Количество() > 0 Тогда
			СтрокиАванс = АСК.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
			ПересчитатьОсновнуюТаблицуАвансов = Истина;
		КонецЕсли; 
		Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
			//1й вариант - сумма на всю сумму счета и ищем с предыдущим счетом
			СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, НовСтр.Номенклатура, Выборка.ГУИД);
			
			//Евросиб Каблов 31.08.2023 ( #68187
			//Если СчетАвансаПоКТК.Количество() > 0 Тогда
			//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
			//КонецЕсли;
			СтрокиАванс = Новый Массив;
			Для Каждого СтрокаАвансаПоКТК Из СчетАвансаПоКТК Цикл
				НайденныеСтроки = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАвансаПоКТК.СчетПокупателю, Выборка.Услуга));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					СтрокиАванс.Добавить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			//Евросиб Каблов 31.08.2023 )
			
			ДополнительноеУсловиеПоДопУслуге = Истина;
			Если ВидыФормируемыхДокументов.ЕстьАкт Тогда //при формировании Счета с Актом добавлена проверка, чтобы услуга не была дополнительной (/Евросиб - АСуслов 11.03.2022 9:45:11 #45629)
				ДополнительноеУсловиеПоДопУслуге = НЕ Выборка.УслугаВнеСтавки;
			КонецЕсли;
			Если (СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0) И ДополнительноеУсловиеПоДопУслуге Тогда			
				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", НовСтр.Номенклатура, НовСтр.Сумма, ПредыдущийСчет));				
				Если СтрокиАванс.Количество() = 0 Тогда
					//2й вариант на всю сумму счета
					СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", НовСтр.Номенклатура, НовСтр.Сумма));				
					Если СтрокиАванс.Количество() = 0 Тогда
						//3й вариант	
						ИспользоватьПоискТолькоПоНоменклатуре = НЕ (ВидыФормируемыхДокументов.ЕстьСчет И ВидыФормируемыхДокументов.ЕстьОтчет); //для вр отключаем поиск по только номенклатуре, будет создаваться счет. (//Евросиб - АСуслов 11.03.2022 9:33:33 #45629)
						Если ИспользоватьПоискТолькоПоНоменклатуре Тогда
							СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
						КонецЕсли;					
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 			
		КонецЕсли; 

		Если СтрокиАванс <> Неопределено И СтрокиАванс.Количество() > 0 Тогда
			УбратьСчетаВыставленныеИзСделкиПоДругимДоходнымСтрокам(СтрокиАванс, НовСтр.Номенклатура, Выборка.ГУИД);
			Для каждого СтрокаАванс Из СтрокиАванс Цикл
				ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
				СуммаОстаток = СтрокаАванс.СуммаОстаток;
				СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
				НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
				НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
				Если ПересчитатьОсновнуюТаблицуАвансов Тогда
					СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАванс.СчетПокупателю, СтрокаАванс.Номенклатура));	
					СтрокиАвансОсновная[0].СуммаОстаток = СтрокаАванс.СуммаОстаток;
				КонецЕсли; 
				Если НовСтр.Сумма = 0 Тогда
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 	
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец

//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
//Убирает счета, которые сформированы с заполненным ГУИД Дохода сделки и этот ГУИД не совпадает с текущим
//Такая потребность возникла при формировании счетов из Сделки несколькими порциями с одинаковой Услугой и Списком КТК
Процедура УбратьСчетаВыставленныеИзСделкиПоДругимДоходнымСтрокам(СтрокиАванс, Номенклатура, ГУИДстрокиДохода)
	МассивСчетов = Новый Массив;
	Для каждого СтрокаАванс Из СтрокиАванс Цикл
		МассивСчетов.Добавить(СтрокаАванс.СчетПокупателю);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю
		|ПОМЕСТИТЬ ВТСчетаПоТекущейСтрокеДохода
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|ГДЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка В(&МассивСчетов)
		|	И СчетНаОплатуПокупателюТовары.Номенклатура = &Номенклатура
		|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки = &СтрокаДоходовСделки
		|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|ГДЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка В(&МассивСчетов)
		|	И СчетНаОплатуПокупателюТовары.Номенклатура = &Номенклатура
		|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> &СтрокаДоходовСделки
		|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> """"
		|	И НЕ СчетНаОплатуПокупателюТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТСчетаПоТекущейСтрокеДохода.СчетНаОплатуПокупателю
		|				ИЗ
		|					ВТСчетаПоТекущейСтрокеДохода КАК ВТСчетаПоТекущейСтрокеДохода)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", ГУИДстрокиДохода);
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивСчетовДляУдаления = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СчетНаОплатуПокупателю");
	
	КоличествоЭлементов = СтрокиАванс.Количество();
	Пока КоличествоЭлементов > 0 Цикл
		Индекс = КоличествоЭлементов - 1;
		КоличествоЭлементов = КоличествоЭлементов - 1;
		Если МассивСчетовДляУдаления.Найти(СтрокиАванс[Индекс].СчетПокупателю)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокиАванс.Удалить(Индекс);
	КонецЦикла;
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец

//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
Процедура УменьшитьСуммуНаВеличинуАвансовогоСчетаПоАналогичнойНоменклатуре(АС, НовДок, НовСтр)
	Если АС <> Неопределено Тогда
		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
		Если СтрокиАванс.Количество() > 0 Тогда
			Для каждого СтрокаАванс Из СтрокиАванс Цикл
				ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
				СуммаОстаток = СтрокаАванс.СуммаОстаток;
				СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
				НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
				НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
				Если НовСтр.Сумма = 0 Тогда
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец

//ДИТ, Беляев СЮ, BUG 570 / TA 58121 (Ticket#0266962), 28-03-2023, начало
&НаСервере
Процедура ЗаполнитьСчетаНаОплатуПокупателямАкта(АС, Выборка, НовАкт, нСтр, ПредыдущийСчет)
	Если АС <> Неопределено Тогда
		ОстатокСуммы = нСтр.Сумма;
		АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
		ПересчитатьОсновнуюТаблицуАвансов = Ложь;
		СтрокиСчетов = Неопределено;
		Если АСК.Количество() > 0 Тогда
			СтрокиСчетов = АСК.НайтиСтроки(Новый Структура("Номенклатура", нСтр.Номенклатура));
			ПересчитатьОсновнуюТаблицуАвансов = Истина;
		КонецЕсли; 
		Если СтрокиСчетов = Неопределено ИЛИ СтрокиСчетов.Количество() = 0 Тогда
			СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
			Если СчетАвансаПоКТК.Количество() > 0 Тогда
				СтрокиСчетов = Новый Массив;
				Для каждого СтрокаСчетАвансаПоКТК Из СчетАвансаПоКТК Цикл
					НайдСтрокиСчетов = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаСчетАвансаПоКТК.СчетПокупателю, Выборка.Услуга));
					Для каждого найдСтрокаСчетов Из НайдСтрокиСчетов Цикл
						СтрокиСчетов.Добавить(найдСтрокаСчетов);
					КонецЦикла; 
				КонецЦикла; 
			КонецЕсли;
			//приоритетный вариант - сумма на всю сумму счета, учитывая предыдущий счет, чтобы выбирать сумму из одного и того же счета
			Если СтрокиСчетов = Неопределено ИЛИ СтрокиСчетов.Количество() = 0 Тогда
				СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, ОстатокСуммы, ПредыдущийСчет));
				//если сумма по счету не нашлась, то тогда по полному остатку суммы
				Если СтрокиСчетов.Количество() = 0 Тогда
					СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, ОстатокСуммы));
					//по услуге и счету
					Если СтрокиСчетов.Количество() = 0 Тогда
						СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СчетПокупателю", Выборка.Услуга, ПредыдущийСчет));
						//по услуге
						Если СтрокиСчетов.Количество() = 0 Тогда
							СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Услуга));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		
		Для каждого СтрокаСчетов Из СтрокиСчетов Цикл
			Если СтрокаСчетов.СуммаОстаток > 0 Тогда
				ПредыдущийСчет = СтрокаСчетов.СчетПокупателю;
				нСтр.СчетНаОплатуПокупателю = СтрокаСчетов.СчетПокупателю;
				Если ОстатокСуммы <= СтрокаСчетов.СуммаОстаток Тогда
					СуммаСчета = ОстатокСуммы;
					СтрокаСчетов.СуммаОстаток = СтрокаСчетов.СуммаОстаток - ОстатокСуммы;
					ОстатокСуммы = 0;
				Иначе
					СуммаСчета = СтрокаСчетов.СуммаОстаток;
					ОстатокСуммы = ОстатокСуммы - СтрокаСчетов.СуммаОстаток;
				КонецЕсли; 
				//добавим в тч счета
				нСчет = НовАкт.СчетаНаОплатуПокупателям.Добавить();
				нСчет.Номенклатура = нСтр.Номенклатура;
				//Евросиб Каблов 28.11.2025 ( #111016
				//нСчет.Сделка = Сделка;
				//Евросиб Каблов 28.11.2025 ) #111016
				нСчет.СчетПокупателю = СтрокаСчетов.СчетПокупателю;
				нСчет.Сумма = СуммаСчета;
				//конец добавки
				Если ПересчитатьОсновнуюТаблицуАвансов Тогда
					СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаСчетов.СчетПокупателю, СтрокаСчетов.Номенклатура));	
					СтрокиАвансОсновная[0].СуммаОстаток = СтрокаСчетов.СуммаОстаток;
				КонецЕсли; 
				Если ОстатокСуммы = 0 Тогда
					Прервать;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;	 	
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец	

//Функция СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ, Клиент,Договор,Сделка,Выборка, ПСЦ = неопределено, КурсУказанРуками, ДатаВыставленияДокументов, НеОчищатьДокументы = Ложь, ЭтоВР = Ложь)
&НаСервере
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
Функция СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ, 
							Клиент,Договор,Сделка,Выборка, ПСЦ = неопределено, КурсУказанРуками, ДатаВыставленияДокументов, 
							НеОчищатьДокументы = Ложь, ЭтоВР = Ложь, ПараметрыФФД, РелизСобственника = Неопределено)
//Функция СоздатьКомплектДокументов(ЕстьСчет,ЕстьАкт,Акт,ЕстьОтчет,Отчет,ЕстьСчФ, Клиент,Договор,Сделка,Выборка, ПСЦ = неопределено, КурсУказанРуками, ДатаВыставленияДокументов, НеОчищатьДокументы = Ложь, ЭтоВР = Ложь, ПараметрыФФД)
// Евросиб Рыбьяков К.А. 17.03.2026 ))
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

//	ОпределенПроизвольныйКурс = неопределено;
	мВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	МассивКомплектов = Новый Массив;
		
	////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
	//ОкруглятьСтавкуПриПересчетеКурса = ?(ПараметрыФФД = Неопределено, Ложь, ПараметрыФФД.ОкруглятьСтавкуПриПересчетеКурса);
	////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
	////++ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022
	//ОкруглятьСтавкуПриПересчетеКурсаДляРТУБезПараметровФФД = Ложь;
	////--ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022
	//ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, начало (по умолчанию необходимо округлять, если в правилах не указано обратное)
	ОкруглятьСтавкуПриПересчетеКурса = ?(ПараметрыФФД = Неопределено, Истина, ПараметрыФФД.ОкруглятьСтавкуПриПересчетеКурса);
	//ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, конец
	
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
	ВидыФормируемыхДокументов = Новый Структура;
	ВидыФормируемыхДокументов.Вставить("ЕстьСчет", ЕстьСчет);
	ВидыФормируемыхДокументов.Вставить("ЕстьАкт", ЕстьАкт);
	ВидыФормируемыхДокументов.Вставить("ЕстьОтчет", ЕстьОтчет);
	ВидыФормируемыхДокументов.Вставить("ЕстьСчФ", ЕстьСчФ);
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
	
	//ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(Клиент,,Сделка.ПовагонныеОтправки,);
	//)
	//Евросиб - АСуслов 13.12.2021 16:19:02 #
	#Область ПрямыеПродажи     
	ПодставлятьСделкуИзВыборки = Ложь;
	Если Не ЗначениеЗаполнено(Сделка) Тогда
		ПодставлятьСделкуИзВыборки = Истина;
	КонецЕсли; 
	Если ЕстьСчет и ЕстьАкт Тогда
		АС = НайтиАвансовыйСчет(Сделка,Клиент,Договор,ВыставленныеКоносаменты.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"),ВыставленныеЖД.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"));
		СтруктураСчетАкт = Новый Структура;
		
		//Евросиб Каблов 12.09.2023 ( #68187
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СделкаДоходы.Ссылка КАК Ссылка,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
		|ПОМЕСТИТЬ ДоходыСделки
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|ГДЕ
		|	СделкаДоходы.Ссылка = &Ссылка
		|	И СделкаДоходы.ГУИД <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыСделки.ГУИД КАК ГУИД,
		|	ДоходыСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	РасчетСНП.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
		|	РасчетСНП.Ссылка КАК РасчетСНП,
		|	РасчетСНП.Счет КАК Счет
		|ПОМЕСТИТЬ РасчетыСНП
		|ИЗ
		|	ДоходыСделки КАК ДоходыСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
		|		ПО ДоходыСделки.Ссылка = РасчетСНП.Сделка
		|			И ДоходыСделки.ГУИД = РасчетСНП.ГУИДСтрокиДохода
		|;
		//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыСНП.ГУИД КАК ГУИД,		
		|	РасчетыСНП.РасчетСНП КАК РасчетСНП
		|ИЗ
		|	РасчетыСНП КАК РасчетыСНП
		|;
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыСделки.Ссылка КАК Ссылка,
		|	ДоходыСделки.ГУИД КАК ГУИД,
		|	ДоходыСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
		|ИЗ
		|	ДоходыСделки КАК ДоходыСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
		|				И СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
		|		ПО ДоходыСделки.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
		|			И ДоходыСделки.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСНП.ГУИД КАК ГУИД,
		|	МАКСИМУМ(РасчетыСНП.ФактическаяДатаОкончания) КАК ДатаЗавершенияСНП
		|ИЗ
		|	РасчетыСНП КАК РасчетыСНП
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСНП.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.Организация КАК Организация,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.Сделка КАК Сделка,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.Контрагент КАК Контрагент,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.СчетПокупателю КАК СчетПокупателю,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.Номенклатура КАК Номенклатура,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.Контейнер КАК Контейнер,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.СчетПокупателю.ДатаДокумента КАК ДатаСчета,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	СчетаПокупателейПоУчетнымЕдиницамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.СчетаПокупателейПоУчетнымЕдиницам.Остатки(
		|			,
		|			СчетПокупателю В
		|				(ВЫБРАТЬ
		|					РасчетыСНП.Счет КАК Счет
		|				ИЗ
		|					РасчетыСНП КАК РасчетыСНП)) КАК СчетаПокупателейПоУчетнымЕдиницамОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСчета";	
		Запрос.УстановитьПараметр("Ссылка", Сделка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		КоличествоЗапросов = РезультатыЗапроса.Количество();
		ТаблицаУчетныхЕдиниц = РезультатыЗапроса[КоличествоЗапросов - 3].Выгрузить();
		ТаблицаСНП = РезультатыЗапроса[КоличествоЗапросов - 2].Выгрузить();
		//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
		ТаблицаРасчетСНП = РезультатыЗапроса[КоличествоЗапросов - 4].Выгрузить();
		//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
		ТаблицаОстатковСчетовПоУчетнымЕдиницам = РезультатыЗапроса[КоличествоЗапросов - 1].Выгрузить();
		
		ТаблицаСчетов = ТаблицаОстатковСчетовПоУчетнымЕдиницам.СкопироватьКолонки("Номенклатура, Контейнер, Сделка, СчетПокупателю");
		ТаблицаСчетов.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
		ТаблицаСчетов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСчетов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		//Евросиб Каблов 12.09.2023 )
		
		//Создание счет по прямым продажам
		Если Акт <> Неопределено Тогда
			Если ЗначениеЗаполнено(Акт.СчетНаОплатуПокупателю)
				И НЕ Акт.СчетНаОплатуПокупателю.АвансовыйСчет Тогда
				НовДок = Акт.СчетНаОплатуПокупателю.ПолучитьОбъект();
				Если НовДок.ПометкаУдаления Тогда
					НовДок.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь;
				КонецЕсли;
				Если НеОчищатьДокументы = Ложь Тогда
					НовДок.Товары.Очистить();
					НовДок.Состояния.Очистить();
				Иначе
					АС = Неопределено;
				КонецЕсли; 
			Иначе
				НовДок = СоздатьНовыйСчетНаОплату(ПараметрыФФД, ДатаВыставленияДокументов);
			КонецЕсли;
		Иначе
			НовДок = СоздатьНовыйСчетНаОплату(ПараметрыФФД, ДатаВыставленияДокументов);
		КонецЕсли;
		
		НовДок.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
		НовДок.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.Подразделения.ПустаяСсылка());
		НовДок.ЦФО = ?(ЗначениеЗаполнено(Сделка),Сделка.ЦФО,Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка());
		НовДок.Контрагент = Клиент;
		НовДок.АвансовыйСчет = Ложь;
		НовДок.ДоговорКонтрагента = Договор;
		НовДок.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
		//Евросиб - АСуслов 12.09.2022 13:16:36 #57001
		//(
		//НовДок.ПравилоФормирования = ПараметрыФФД.Документ;
		//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, начало
		НовДок.ПравилоФормирования = ?(ПараметрыФФД = Неопределено, Справочники.ФормированиеФинДокументов.ПустаяСсылка(), ПараметрыФФД.Документ);
		//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, конец
		//)
		//Евросиб - АСуслов 12.09.2022 13:16:46 #57001
		Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.ДатаДокумента);
		НовДок.КурсВзаиморасчетов = Результат.Курс;
		//Евросиб СубботинВ #90789 04.09.2024 Начало // 
		НовДок.ДатаКурса = НовДок.ДатаДокумента;
		//Евросиб СубботинВ #90789 04.09.2024 Конец

		Если ПСЦ.Валюта <> Договор.ВалютаВзаиморасчетов Тогда
			Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
				НовДок.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
				ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
			ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
				НовДок.КурсВзаиморасчетов = КурсУказанРуками;
				ОпределенПроизвольныйКурс = КурсУказанРуками;
			Иначе
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, НовДок.ДатаДокумента);
				НовДок.КурсВзаиморасчетов = Результат.Курс;
			КонецЕсли;
		КонецЕсли;
			
		НовДок.КратностьВзаиморасчетов = Результат.Кратность;
		//Если НовДок.ВалютаДокумента = мВалютаРеглУчета Тогда
		//	НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
		//Иначе
		//	НовДок.БанковскийСчетОрганизации = Справочники.БанковскиеСчета.НайтиПоРеквизиту("ВалютаДенежныхСредств", НовДок.ВалютаДокумента,,НовДок.Организация);
		//КонецЕсли;   
		//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало	
		НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор); 
	    //ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
		НовДок.УчитыватьНДС = Истина;
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВыставлятьСчетНаАнглийскомЯзыке") Тогда
			СчетНаАнгл = Истина;
		Иначе
			СчетНаАнгл = Неопределено;
		КонецЕсли;
		ПредыдущийСчет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
		КурсВалютыФрахт = Новый Структура("Курс, Валюта, ДатаКурса", НовДок.КурсВзаиморасчетов, НовДок.ВалютаДокумента, НовДок.ДатаКурса);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, начало
		ПремииСубсидии = Ложь;
		ТипыКалькуляцийПремииСубсидии = Новый Массив;
		ТипыКалькуляцийПремииСубсидии.Добавить(Перечисления.ТипыКалькуляций.Субсидии);
		ТипыКалькуляцийПремииСубсидии.Добавить(Перечисления.ТипыКалькуляций.Премии);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, конец
		Пока Выборка.Следующий() Цикл
			
			Если ПодставлятьСделкуИзВыборки Тогда
				Сделка = Выборка.Сделка;
			КонецЕсли; 
			// подбор нужной выборки по справочнику формирования фин доков
			//ЗапросКл.УстановитьПараметр("ВидПеревозки",Выборка.Калькуляция.ПС_ВидПеревозки);
			//НайденныйКлиент = ЗапросКл.Выполнить();
			
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, начало
			Если ЗначениеЗаполнено(Выборка.Калькуляция) Тогда
				ТипКалькуляции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Калькуляция, "ТипКалькуляции");
				ПремииСубсидии = ПремииСубсидии 
									ИЛИ ТипыКалькуляцийПремииСубсидии.Найти(ТипКалькуляции) <> Неопределено;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, конец
			
			НовДок.ПериодВО = Выборка.ПериодВО; //++
			Если не Выборка.Перевыставляемая  Тогда
				НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
				НовСтр = НовДок.Товары.Добавить();
				//Евросиб - АСуслов 23.03.2022 16:46:11 #
				//(
				НовСтр.Идентификатор = Новый УникальныйИдентификатор;
				//)
				//Евросиб - АСуслов 23.03.2022 16:46:11 #
				НовСтр.Номенклатура = Выборка.Услуга;
				НовСтр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
				НовСтр.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
				//Евросиб Каблов 09.12.2025 ( #111016
				НовСтр.Калькуляция = Выборка.Калькуляция;
				//Евросиб Каблов 09.12.2025 ) #111016
				
				НовСТр.Количество = Выборка.Количество;
				НовСТр.СтавкаНДС = Выборка.СтавкаНДС;
				ВалютаСтроки = Выборка.Валюта;
				Если ВалютаСтроки <> НовДок.ВалютаДокумента Тогда
					
						//если по фрахту есть авансовый счет, то будем брать дату курса из него
						РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
						ДатаКурса = Неопределено;
						//Евросиб Каблов 12.09.2023 ( #68187
					    НайденнаяСтрока = ТаблицаСНП.Найти(Выборка.ГУИД, "ГУИД");
						Если НайденнаяСтрока <> Неопределено Тогда
							ДатаКурса = НовДок.ДатаДокумента;
						//Евросиб Каблов 12.09.2023 )
						ИначеЕсли РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
							//Если АС <> Неопределено Тогда
							//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
							//	Если АСК.Количество() > 0 Тогда
							//		СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//		Если СтрокаСчетАванса <> Неопределено Тогда
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//		КонецЕсли; 
							//	КонецЕсли;
							//	Если ДатаКурса = Неопределено Тогда
							//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
							//		Если СчетАвансаПоКТК.Количество() = 1 
							//			//есть вариант, что сумма будет больше остатка
							//			//И СчетАвансаПоКТК[0].СуммаОстаток >= НовСтр.Сумма 
							//			Тогда
							//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
							//		КонецЕсли;
							//		//Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//		//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
							//		//	Если СтрокиАванс.Количество() = 0 Тогда
							//		//		//2й вариант на всю сумму счета
							//		//		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
							//		//		Если СтрокиАванс.Количество() = 0 Тогда
							//		//			//3й вариант
							//				Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//					СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
							//				КонецЕсли; 
							//		//		КонецЕсли; 
							//		//	КонецЕсли; 
							//		//КонецЕсли; 
							//		Если СтрокиАванс.Количество() > 0 Тогда
							//			СтрокаСчетАванса = СтрокиАванс[0]; 
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//		КонецЕсли; 
							//	КонецЕсли; 
							//КонецЕсли; 
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
							ДатаКурса = ПолучитьДатуКурсаИзАвансовогоСчета(АС, Выборка);
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
						КонецЕсли;
						Если ДатаКурса = Неопределено Тогда
							//ДатаКурса = ДатаВыставленияДокументов;
							ДатаКурса = НовДок.ДатаДокумента;
						КонецЕсли; 
						Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
							ДатаКурса = валюта_ДатаКурса;
						КонецЕсли;      
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
						НовДок.ДатаКурса = ДатаКурса;     
						ЗаполнитьРеквизитыКурсаВалютВДокумент(НовДок);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
						
						//)
						//Евросиб - АСуслов 17.11.2020 12:27:43 #
						КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса);
						Если КурсВалютыФрахт.Курс = 1 Тогда
							//чтобы правильно выводилось в содержании
							//КурсВалютыФрахт.Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса).Курс;
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
						КонецЕсли; 
						Если НЕ Выборка.ОкруглениеКурса = Неопределено Тогда
							КурсВалютыФрахт.Курс = Окр(КурсВалютыФрахт.Курс, Выборка.ОкруглениеКурса);
						КонецЕсли; 
						//Евросиб - АСуслов 18.05.2021 15:24:29 #0232570 
						//(
						Если ЗначениеЗаполнено(Выборка.Калькуляция) Тогда
							РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Калькуляция, "ЗафиксироватьКурс, Курс");
						Иначе
							РеквизитыКалькуляции = Новый Структура("ЗафиксироватьКурс, Курс", Ложь, 1);
						КонецЕсли; 
						//)
						//Евросиб - АСуслов 18.05.2021 15:24:47 #0232570 
						Если РеквизитыКалькуляции.ЗафиксироватьКурс Тогда
							КурсВалютыФрахт.Курс = РеквизитыКалькуляции.Курс;
						КонецЕсли; 
						//Если ЗначениеЗаполнено(КурсУказанРуками) Тогда
						//	КурсВалютыФрахт.Курс = КурсУказанРуками;	
						//КонецЕсли; 
						
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, КурсВалютыФрахт.Курс, Истина);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,ДатаКурса, КурсВалютыФрахт.Курс, Истина);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
						Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,ДатаКурса, КурсВалютыФрахт.Курс, Истина, Выборка.ОкруглениеКурса);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
						НовСтр.ИсходнаяВалюта = Выборка.Валюта;
						НовСтр.ЦенаВВалюте = Выборка.Ставка; 
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
					//Иначе
					//	Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов, Истина);
					//КонецЕсли; 
					//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
					Если ОкруглятьСтавкуПриПересчетеКурса Тогда
						НовСтр.Цена = Ставка;
						НовСтр.Сумма = НовСтр.Цена * Выборка.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
						//Евросиб СубботинВ #125845 19.12.2025 Конец
					Иначе
						НовСтр.Сумма = Ставка * Выборка.Количество;
						НовСтр.Цена = НовСтр.Сумма / Выборка.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
                       	//Евросиб СубботинВ #125845 19.12.2025 Конец
					КонецЕсли; 
					Если Ставка = 0 Тогда
						Сообщить("При пересчете из валюты строки в валюту договора сумма по строке стала равна 0. Проверьте заполнение валюты взаиморасчетов в договоре и курсы валют.");
					КонецЕсли;
				Иначе
					СтавкаИтого = Выборка.СтавкаИтого;
					НовСтр.СуммаНДС = Выборка.СуммаНДС;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956  СтавкаИтого * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
					НовСтр.Сумма = СтавкаИтого;
					НовСтр.Цена = НовСтр.Сумма/НовСТр.Количество;
				КонецЕсли;
				//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,"Счет",СчетНаАнгл,,,КурсВалютыФрахт);
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
				СодержаниеУслуги = РаботаСоСделкамиСервер.ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,"Счет",СчетНаАнгл,,,КурсВалютыФрахт, ИзОбработки, КТКВХранилище); //Фролов 11.03.2022, таска 44976
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
				
				НовСТр.Содержание = СодержаниеУслуги;
				
				//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
				// Евросиб US 116744 TA 116885 Рыбьяков К.А. 12.08.2025 ((
				Если НовСтр.Номенклатура = Справочники.Номенклатура.СНПКонтейнеров И ТаблицаРасчетСНП <> Неопределено Тогда
				//Если НовСтр.Номенклатура = Справочники.Номенклатура.СНПКонтейнеров Тогда
				// Евросиб Рыбьяков К.А. 12.08.2025 ))
					
					НайденнаяСтрока = ТаблицаРасчетСНП.Найти(Выборка.ГУИД, "ГУИД");
					сРасчетСНП = Документы.РасчетСНП.ПустаяСсылка();
					Если НайденнаяСтрока <> Неопределено Тогда
						сРасчетСНП = НайденнаяСтрока.РасчетСНП;
					КонецЕсли;	
					
					НовСТр.Содержание = СодержаниеУслуги + РаботаСоСделкамиСервер.ПолучитьДополнениеУслугиСчета(НовДок, ПараметрыФФД, ВалютаСтроки <> НовДок.ВалютаДокумента, сРасчетСНП, ВалютаСтроки);
				КонецЕсли;
				//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
				
				//ищем авансовую сумму по этой услуге
				//Если АС <> Неопределено Тогда
				//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
				//	ПересчитатьОсновнуюТаблицуАвансов = Ложь;
				//	СтрокиАванс = Неопределено;
				//	Если АСК.Количество() > 0 Тогда
				//		СтрокиАванс = АСК.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
				//		ПересчитатьОсновнуюТаблицуАвансов = Истина;
				//	КонецЕсли; 
				//	Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
				//		//1й вариант - сумма на всю сумму счета и ищем с предыдущим счетом
				//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
				//		Если СчетАвансаПоКТК.Количество() = 1 
				//			//И СчетАвансаПоКТК[0].СуммаОстаток >= НовСтр.Сумма 
				//			Тогда
				//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
				//		КонецЕсли;
				//		//Евросиб - АСуслов 11.03.2022 9:45:11 #45629
				//		//( добавлена проверка, чтобы услуга не была дополнительной
				//		//Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 И НЕ Выборка.УслугаВнеСтавки Тогда 
				//		//ДИТ, Беляев СЮ, Ticket#0271294, 05-05-2022, начало
				//		Если (СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0) И НЕ Выборка.УслугаВнеСтавки Тогда
				//		//ДИТ, Беляев СЮ, Ticket#0271294, 05-05-2022, конец
				//			//)45629
				//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
				//			Если СтрокиАванс.Количество() = 0 Тогда
				//				//2й вариант на всю сумму счета
				//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
				//				Если СтрокиАванс.Количество() = 0 Тогда
				//					//3й вариант
				//					СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
				//				КонецЕсли; 
				//			КонецЕсли; 
				//		КонецЕсли; 

				//	КонецЕсли; 
				//	//Если СтрокиАванс.Количество() > 0 Тогда    
				//	//ДИТ, Беляев СЮ, Ticket#0271294, 05-05-2022, начало
				//	Если СтрокиАванс <> Неопределено И СтрокиАванс.Количество() > 0 Тогда
				//	//ДИТ, Беляев СЮ, Ticket#0271294, 05-05-2022, конец
				//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
				//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
				//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
				//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
				//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
				//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
				//			Если ПересчитатьОсновнуюТаблицуАвансов Тогда
				//				СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАванс.СчетПокупателю, СтрокаАванс.Номенклатура));	
				//				СтрокиАвансОсновная[0].СуммаОстаток = СтрокаАванс.СуммаОстаток;
				//			КонецЕсли; 
				//			Если НовСтр.Сумма = 0 Тогда
				//				Прервать;
				//			КонецЕсли; 
				//		КонецЦикла;
				//	КонецЕсли; 
				//КонецЕсли;
				
				//Евросиб Каблов 12.09.2023 ( #68187
				Если Выборка.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы Тогда
					
					СтрокиУчетныхЕдиниц = ТаблицаУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИД", Выборка.ГУИД));
					//Строка дохода по одному КТК
					Если СтрокиУчетныхЕдиниц.Количество() = 1 Тогда
						Для Каждого СтрУчетныхЕдиниц Из СтрокиУчетныхЕдиниц Цикл
							
							СтрокиОстатков = ТаблицаОстатковСчетовПоУчетнымЕдиницам.НайтиСтроки(Новый Структура("Номенклатура, Контейнер", Выборка.Услуга, СтрУчетныхЕдиниц.Контейнер));
							Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
								
								Если НовСтр.Сумма <= 0 Тогда
									Прервать;
								КонецЕсли;
								
								КоличествоИзменения = 0;
								СуммаИзменения = 0;
								
								Если СтрокаОстатка.СуммаОстаток > 0 Тогда
								
									Если СтрокаОстатка.СуммаОстаток >= НовСтр.Сумма Тогда
										СуммаИзменения = НовСтр.Сумма;
									Иначе
										СуммаИзменения = СтрокаОстатка.СуммаОстаток;
									КонецЕсли;
									
									НовСтр.Сумма = НовСтр.Сумма - СуммаИзменения;
									НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);							
									СтрокаОстатка.СуммаОстаток = СтрокаОстатка.СуммаОстаток - СуммаИзменения;
									
								КонецЕсли;
								
								Если СтрокаОстатка.КоличествоОстаток > 0 Тогда
									
									Если СтрокаОстатка.КоличествоОстаток >= НовСтр.Количество Тогда
										КоличествоИзменения = НовСтр.Количество;
									Иначе
										КоличествоИзменения = СтрокаОстатка.КоличествоОстаток;
									КонецЕсли;
									
									НовСтр.Количество = НовСтр.Количество - КоличествоИзменения;							
									СтрокаОстатка.КоличествоОстаток = СтрокаОстатка.КоличествоОстаток - КоличествоИзменения;
									
								КонецЕсли;
								
								СтрСчет = ТаблицаСчетов.Добавить();
								СтрСчет.ГУИД = Выборка.ГУИД;
								СтрСчет.Номенклатура = НовСтр.Номенклатура;
								СтрСчет.Контейнер = СтрУчетныхЕдиниц.Контейнер;
								СтрСчет.Сделка = Сделка;
								СтрСчет.СчетПокупателю = СтрокаОстатка.СчетПокупателю;
								СтрСчет.Сумма = СуммаИзменения;
								СтрСчет.Количество = КоличествоИзменения;
								
							КонецЦикла;
							
							Если НовСтр.Сумма <> 0 Тогда
								СтрСчет = ТаблицаСчетов.Добавить();
								СтрСчет.ГУИД = Выборка.ГУИД;
								СтрСчет.Номенклатура = НовСтр.Номенклатура;
								СтрСчет.Контейнер = СтрУчетныхЕдиниц.Контейнер;
								СтрСчет.Сделка = Сделка;
								СтрСчет.СчетПокупателю = ?(НовДок.ЭтоНовый(), НовДок.ПолучитьСсылкуНового(), НовДок.Ссылка);
								СтрСчет.Сумма = НовСтр.Сумма;
								СтрСчет.Количество = НовСтр.Количество;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				
				Иначе
				//Евросиб Каблов 12.09.2023 )
				
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					УменьшитьСуммуНаВеличинуАвансовогоСчета(АС, Выборка, НовДок, НовСтр, ПредыдущийСчет, ВидыФормируемыхДокументов);
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					
				//Евросиб Каблов 12.09.2023 ( #68187
				КонецЕсли;
				//Евросиб Каблов 12.09.2023 )
				
				НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
				Если НовСтр.Сумма = 0 Тогда
					НовДок.Товары.Удалить(НовСтр);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
//Евросиб Гудкова( 12.10.2020 Ticket№ найдите 1 отличие, и счета перестанут задваиваться
//		Если НовДок.СуммаДокумента < ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
		//Если НовДок.СуммаДокумента <= ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
		Если НовДок.СуммаДокумента = 0 Тогда
// Евросиб Гудкова) 		
			Если АС <> Неопределено Тогда
	            Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					НовДок = ПредыдущийСчет;
				Иначе
					НовДок = АС[0].СчетПокупателю;
					СтрокаНовДок = АС.Найти(0, "СуммаОстаток");
					Если СтрокаНовДок <> Неопределено Тогда
						НовДок = СтрокаНовДок.СчетПокупателю;
					Иначе
						НовДок = АС[0].СчетПокупателю;
					КонецЕсли; 
				КонецЕсли;
				Сообщить("Ранее был(и) создан(ы) документ(ы) на аванс на все сумму. Закрывающий счет создан не был.");
			Иначе
				НовДок = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
				Сообщить("Сумма документа равна 0. Закрывающий счет создан не был.");
			КонецЕсли;
		Иначе
			//Если АС <> Неопределено Тогда
			Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
//				Для каждого СтрАС Из АС Цикл
//				СтрАС = АС.Найти(СтрАС.СтрокаДоходовСделки,"СтрокаДоходовСделки");
//					Если СтрАС <> Неопределено Тогда
//						//СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
//						НовСтр.Сумма = НовСтр.Сумма - СтрАС.Сумма;
////Евросиб Гудкова( 12.10.2020 Ticket№ и молимся, что последняя строка счета не стала минусовой
//						НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
//						НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
//// Евросиб Гудкова) 						
//					КонецЕсли;
//				КонецЦикла; 
				НовДок.НомерДляПечати = "";
				//НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АС[0].СчетПокупателю, "НомерДляПечати")+"/1"); 
				НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущийСчет, "НомерДляПечати")+"/1"); 
			КонецЕсли;
			НовДок.ДополнительныеСвойства.Вставить("ПрограммноеИзменение", Истина); 
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//НовДок.Записать(РежимЗаписиДокумента.Запись);
		СтруктураСчетАкт.Вставить("Счет",НовДок.Ссылка);
		
		///////////// Создание акта по прямым продажам ///////////////////
		Если Акт <> Неопределено Тогда
			НовАкт = Акт.ПолучитьОбъект();
			Если НовАкт.ПометкаУдаления Тогда
				НовАкт.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь; 
			КонецЕсли;
			Если НеОчищатьДокументы = Ложь Тогда
				НовАкт.Услуги.Очистить();
				НовАкт.СчетаНаОплатуПокупателям.Очистить();
				НовАкт.РасшифровкаУслугПоТС.Очистить();
				НовАкт.Состояния.Очистить();
				НовАкт.НомерДляПечати = "";
				НовАкт.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли; 
		Иначе
			Если РежимИспользованияУдаленныхДокументовПоСделке Тогда
				//найдем удаленный документ по сделке/контрагенту/договору
				ссАкт = НайтиУдаленныйДокументПоСделке(Сделка, Клиент, Договор);
				Если ссАкт = Неопределено Тогда
					НовАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Иначе
					НовАкт = ссАкт.ПолучитьОбъект();
					НовАкт.УстановитьПометкуУдаления(Ложь);
					НовАкт.Услуги.Очистить();
					НовАкт.СчетаНаОплатуПокупателям.Очистить();
					НовАкт.РасшифровкаУслугПоТС.Очистить();
					НовАкт.Состояния.Очистить();
					НовАкт.НомерДляПечати = "";
				КонецЕсли; 
			Иначе
				НовАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			КонецЕсли; 
			//НовАкт.ДатаДокумента = ТекущаяДата();
			НовАкт.Дата = ТекущаяДата();
			НовАкт.Заполнить(неопределено);
			//Гудкова			НовАкт.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовАкт.Организация);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовАкт.Номер) Тогда
			НовАкт.УстановитьНовыйНомер();
		КонецЕсли; 
		НовАкт.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
		НовАкт.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.Подразделения.ПустаяСсылка());
		НовАкт.ЦФО = ?(ЗначениеЗаполнено(Сделка),Сделка.ЦФО,Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка());
		НовАкт.Контрагент = Клиент;
		НовАкт.ДоговорКонтрагента = Договор;
		//Евросиб СубботинВ #84453 02.07.2024 Начало // перенес заполнение сделки в тч
		//НовАкт.Сделка = Сделка;                     
		//Евросиб СубботинВ #84453 02.07.2024 Конец
 
		//// Евросиб(ДИТ) BUG 93109 ТА 93110 Сержантова А.С. Начало: 16.10.2024
		////ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		//ПремииСубсидии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Субсидии или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Премии;
		////ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		//Если ЗначениеЗаполнено(Выборка.Калькуляция) 
		//	и ПремииСубсидии Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
		//	НовАкт.Субсидии = Истина;	
		//КонецЕсли;
		//// Евросиб(ДИТ) BUG 93109 ТА 93110 Сержантова А.С. Конец: 16.10.2024
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, начало
		НовАкт.Субсидии = ПремииСубсидии;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0392119, 26-03-2025, конец
		НовАкт.ДатаНачалаПериодаПовагонки = Сделка.ДатаНачалаПериодаПовагонки;
		НовАкт.ДатаОкончанияПериодаПовагонки = Сделка.ДатаОкончанияПериодаПовагонки;
		НовАкт.УчитыватьНДС = Истина;
		НовАкт.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
		//Евросиб - АСуслов 12.09.2022 13:16:36 #57001
		//(
		//НовАкт.ПравилоФормирования = ПараметрыФФД.Документ;
		//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, начало
		НовАкт.ПравилоФормирования = ?(ПараметрыФФД = Неопределено, Справочники.ФормированиеФинДокументов.ПустаяСсылка(), ПараметрыФФД.Документ);
		//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, конец
		//)
		//Евросиб - АСуслов 12.09.2022 13:16:46 #57001
//Евросиб Гудкова( 12.10.2020 Ticket№ 0209986
//было		НовАкт.БанковскийСчетОрганизации = НовАкт.Организация.ОсновнойБанковскийСчет;
//		Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.ДатаДокумента);
//		НовАкт.КурсВзаиморасчетов = Результат.Курс;

		//Если НовДок.ВалютаДокумента = мВалютаРеглУчета Тогда
		//    //Собакарь 28.10.02
		//	НовАкт.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
		//	//НовАкт.БанковскийСчетОрганизации = НовАкт.Организация.ОсновнойБанковскийСчет;
		//Иначе
		//	НовАкт.БанковскийСчетОрганизации = Справочники.БанковскиеСчета.НайтиПоРеквизиту("ВалютаДенежныхСредств", НовАкт.ВалютаДокумента,,НовАкт.Организация);
		//КонецЕсли;  
		//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало	
		НовАкт.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор); 
	    //ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
		
		//Евросиб СубботинВ #85857 05.06.2024 Начало // по правкам ФТ 
		Если ТипЗнч(НовАкт.ссылка)	= Тип("ДокументСсылка.РеализацияТоваровУслуг") И УслугиПрошлыхПериодов тогда
			НовАкт.УслугиПрошлыхПериодов = Истина;
		КонецЕсли;	
		//Евросиб СубботинВ #85857 05.06.2024 Конец //по правкам фт
		
// Евросиб Гудкова) 		
		//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 
		//НовАкт.СчетНаОплатуПокупателю = НовДок.Ссылка;
		//Евросиб СубботинВ #84453 02.07.2024 Конец //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 
		//Евросиб Каблов 29.08.2022 ( 56025
		НовАкт.Реестр = РеестрКлиента;
		//Евросиб Каблов 29.08.2022 )
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ПравилоФормированияДатыУслуги, ПериодичностьВыставленияДокументов, ДатаПаспортаСделки");
		// siv 06-03-20
		//Евросиб - АСуслов 15.09.2020 13:04:01 #0206697 
		//(
		КурсУказан = Ложь;
		/////
		НовАкт.ДатаДокумента = ДатаВыставленияДокументов;
		/////////////////////////////////////////////////////////////////
		Если ЗначениеЗаполнено(ПСЦ) И ПСЦ.Валюта <> НовАкт.ВалютаДокумента Тогда
			РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
			Если РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
				НовАкт.КурсВзаиморасчетов = НовДок.КурсВзаиморасчетов;
				НовАкт.КратностьВзаиморасчетов = НовДок.КратностьВзаиморасчетов;
				НовАкт.ДатаКурса = НовДок.Дата;
			Иначе
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, НовАкт.ДатаДокумента);
				НовАкт.КурсВзаиморасчетов = Результат.Курс;
				НовАкт.КратностьВзаиморасчетов = Результат.Кратность;
				НовАкт.ДатаКурса = НовАкт.ДатаДокумента;
			КонецЕсли;
		Иначе
			Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовАкт.ВалютаДокумента, НовАкт.ДатаДокумента);
			НовАкт.КурсВзаиморасчетов = Результат.Курс;
			НовАкт.КратностьВзаиморасчетов = Результат.Кратность;
			НовАкт.ДатаКурса = НовАкт.ДатаДокумента;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 15.09.2020 13:04:02 #0206697 
		Выборка.сбросить();
		//Получим распределение по счетам
		АС = НайтиАвансовыйСчет(Сделка,Клиент,Договор,ВыставленныеКоносаменты.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"),ВыставленныеЖД.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"));
		ПредыдущийСчет = НовДок.Ссылка;
		Пока Выборка.Следующий() Цикл
			
			//Евросиб Каблов 28.10.2021 ( Ticket#0248229
			ГУИДСтрокиДоходов = Выборка.ГУИД;
			//Евросиб Каблов 28.10.2021 )
			
			// устанавливаем даты начала и окончания периода повагонки ДЛЯ РЕАЛИЗАЦИИ
			//Попытка
			//	НовАкт.ДатаНачалаПериодаПовагонки = Выборка.ДатаНачалаПериодаПовагонкиУчДок;
			//	НовАкт.ДатаОкончанияПериодаПовагонки = Выборка.ДатаОкончанияПериодаПовагонкиУчДок;
			//Исключение
			//КонецПопытки;
			
			// подбор нужной выборки по справочнику формирования фин доков
			//ЗапросКл.УстановитьПараметр("ВидПеревозки",Выборка.Калькуляция.ПС_ВидПеревозки);
			//НайденныйКлиент = ЗапросКл.Выполнить();
			
//Гудкова			НовАкт.ПериодВО = Выборка.ПериодВО; //++
			Если Не Выборка.Перевыставляемая  Тогда
				
				//Если Истина Тогда
				//	ДобавитьУслугиПоКонтейнерно(НовАкт, Выборка, НайденныйКлиент);
				//Иначе	
				//Евросиб - АСуслов 11.11.2020 15:29:34 #0213260 
				//(
				НовАкт.ПериодВО = НачалоМесяца(ДатаВыставленияДокументов);
				//НовАкт.ПериодВО = НачалоМесяца(Выборка.ПериодВО);
				//)
				//Евросиб - АСуслов 11.11.2020 15:29:36 #0213260 
				НовАкт.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
							
				НСтр = НовАкт.Услуги.Добавить();
				НСтр.Номенклатура = Выборка.Услуга;
//Гудкова				НСтр.Номенклатура = Выборка.ЕдиницаИзмерения;
				НСтр.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
				нСтр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
				
				НСтр.Количество = Выборка.Количество;
				НСтр.СтавкаНДС = Выборка.СтавкаНДС;
				
				//Евросиб СубботинВ #84453 02.07.2024 Начало // перенес заполнение сделки в тч
				НСтр.Сделка = Сделка;                     
				//Евросиб СубботинВ #84453 02.07.2024 Конец 

				Если Выборка.Валюта <> НовАкт.ВалютаДокумента Тогда
					//Если Выборка.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") 
					//	И НовАкт.КурсВзаиморасчетов = 1 Тогда
						//Евросиб - АСуслов 17.11.2020 11:54:06 #
						//(
						//для фрахта проверяем условие пересчета суммы
						ДатаКурса = Неопределено;
						//Евросиб Каблов 12.09.2023 ( #68187
					    НайденнаяСтрока = ТаблицаСНП.Найти(Выборка.ГУИД, "ГУИД");
						Если НайденнаяСтрока <> Неопределено Тогда
							ДатаКурса = НовДок.ДатаДокумента;
						//Евросиб Каблов 12.09.2023 )
						ИначеЕсли РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
							//Если АС <> Неопределено Тогда
							//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент);
							//	Если АСК.Количество() > 0 Тогда
							//		СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//		Если СтрокаСчетАванса <> Неопределено Тогда
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//		КонецЕсли; 
							//	КонецЕсли;
							//	Если ДатаКурса = Неопределено Тогда
							//		СтрокаСчетАванса = АС.Найти(Выборка.Услуга, "Номенклатура");
							//		Если СтрокаСчетАванса <> Неопределено Тогда
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//		КонецЕсли; 
							//	КонецЕсли; 
							//КонецЕсли; 
							//Если АС <> Неопределено Тогда
							//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
							//	Если АСК.Количество() > 0 Тогда
							//		СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//		Если СтрокаСчетАванса <> Неопределено Тогда
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//		КонецЕсли; 
							//	КонецЕсли;
							//	Если ДатаКурса = Неопределено Тогда
							//		СтрокиАванс = Неопределено;
							//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
							//		//Если СчетАвансаПоКТК.Количество() = 1 Тогда
							//		Если СчетАвансаПоКТК.Количество() > 0 Тогда
							//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
							//		КонецЕсли;
							//		//Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//		//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
							//		//	Если СтрокиАванс.Количество() = 0 Тогда
							//		//		//2й вариант на всю сумму счета
							//		//		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
							//				//Если СтрокиАванс.Количество() = 0 Тогда
							//					//3й вариант
							//					Если СтрокиАванс = Неопределено Тогда
							//						СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Услуга));
							//					КонецЕсли; 
							//				//КонецЕсли; 
							//		//	КонецЕсли; 
							//		//КонецЕсли; 
							//		Если СтрокиАванс.Количество() > 0 Тогда
							//			СтрокаСчетАванса = СтрокиАванс[0]; 
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//		КонецЕсли; 
							//	КонецЕсли; 
							//КонецЕсли; 
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
							ДатаКурса = ПолучитьДатуКурсаИзАвансовогоСчета(АС, Выборка);
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
						КонецЕсли;

						Если ДатаКурса = Неопределено Тогда
							//ДатаКурса = ДатаВыставленияДокументов;
							ДатаКурса = НовДок.ДатаДокумента;
						КонецЕсли; 
						Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
							ДатаКурса = валюта_ДатаКурса;
						КонецЕсли;   
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
                        НовАкт.ДатаКурса = ДатаВыставленияДокументов;    
						ЗаполнитьРеквизитыКурсаВалютВДокумент(НовАкт);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
						
						//)
						//Евросиб - АСуслов 17.11.2020 12:27:43 #
						КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);
						Если КурсВалютыФрахт.Курс = 1 Тогда
							//КурсВалютыФрахт.Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовАкт.ВалютаДокумента, ДатаКурса).Курс;
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовАкт.ВалютаДокумента, ДатаКурса);
						КонецЕсли; 
						Если НЕ Выборка.ОкруглениеКурса = Неопределено Тогда
							КурсВалютыФрахт.Курс = Окр(КурсВалютыФрахт.Курс, Выборка.ОкруглениеКурса);
						КонецЕсли; 
						//Евросиб - АСуслов 18.05.2021 15:24:29 #0232570 
						//(
						Если ЗначениеЗаполнено(Выборка.Калькуляция) Тогда
							РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Калькуляция, "ЗафиксироватьКурс, Курс");
						Иначе
							РеквизитыКалькуляции = Новый Структура("ЗафиксироватьКурс, Курс", Ложь, 1);
						КонецЕсли; 
						//)
						//Евросиб - АСуслов 18.05.2021 15:24:47 #0232570 
						Если РеквизитыКалькуляции.ЗафиксироватьКурс Тогда
							КурсВалютыФрахт.Курс = РеквизитыКалькуляции.Курс;
						КонецЕсли; 
						//Если ЗначениеЗаполнено(КурсУказанРуками) Тогда
						//	КурсВалютыФрахт.Курс = КурсУказанРуками;	
						//КонецЕсли; 
						//)
						//Евросиб - АСуслов 17.11.2020 11:54:07 #
						
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовАкт.ВалютаДокумента,НовАкт.Дата, КурсВалютыФрахт.Курс, Истина);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовАкт.ВалютаДокумента,ДатаКурса, КурсВалютыФрахт.Курс, Истина); 
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
						Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовАкт.ВалютаДокумента,ДатаКурса, КурсВалютыФрахт.Курс, Истина, Выборка.ОкруглениеКурса);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
						
						////++ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022 //ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, закомменировал изменения по BUG 52460
						//Если ПараметрыФФД = Неопределено И ТипЗнч(НовАкт) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
						//	ОкруглятьСтавкуПриПересчетеКурсаДляРТУБезПараметровФФД = Истина;
						//КонецЕсли;
						////--ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022
						
					//Иначе
					//	Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовАкт.ВалютаДокумента,НовАкт.Дата, НовАкт.КурсВзаиморасчетов, Истина);
					//КонецЕсли; 
					//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
					//++ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022 //ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, закомменировал изменения по BUG 52460
					//Если ОкруглятьСтавкуПриПересчетеКурса Тогда
					//Если ОкруглятьСтавкуПриПересчетеКурса ИЛИ ОкруглятьСтавкуПриПересчетеКурсаДляРТУБезПараметровФФД Тогда
					//--ДИТ Гаузер А.В. BUG 52460 TA 52461 21.07.2022	
					//ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, начало
					Если ОкруглятьСтавкуПриПересчетеКурса Тогда
					//ДИТ, Беляев СЮ, BUG 68441, 24-04-2023, конец
						НСтр.Цена = Ставка;
						НСтр.Сумма = НСтр.Цена * Выборка.Количество; 
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НСтр.СуммаНДС = НСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НСтр.СуммаНДС =  БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовАкт.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
                        //Евросиб СубботинВ #125845 19.12.2025 Конец
					Иначе
						НСтр.Сумма = Ставка * Выборка.Количество; 
						НСтр.Цена = НСтр.Сумма / Выборка.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НСтр.СуммаНДС = НСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовАкт.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
                        //Евросиб СубботинВ #125845 19.12.2025 Конец
					КонецЕсли; 
				Иначе
					нСтр.Сумма = Выборка.СтавкаИтого;
					нСтр.Цена = Выборка.СтавкаИтого / Выборка.Количество;
					НСтр.СуммаНДС = Выборка.СуммаНДС;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956 нСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
				КонецЕсли;
				// Субботин TASK 72390 18.07.2023  Начало
				Если ТипЗнч(НовАкт.ссылка)	= Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда 
					Если Выборка.НДСВключенВСтоимость тогда					
						нСтр.ВсегоСНДС  		= Валюта_сервер.ПересчитатьПоКурсу(НСтр.Сумма, НовАкт.ВалютаДокумента, мВалютаРеглУчета, НовАкт.ДатаКурса);
						нСтр.СуммаБезНалога 	= Валюта_сервер.ПересчитатьПоКурсу(нСтр.Сумма - НСтр.СуммаНДС, НовАкт.ВалютаДокумента, мВалютаРеглУчета, НовАкт.ДатаКурса);

					Иначе 
						нСтр.ВсегоСНДС  		= Валюта_сервер.ПересчитатьПоКурсу(НСтр.Сумма + НСтр.СуммаНДС, НовАкт.ВалютаДокумента, мВалютаРеглУчета, НовАкт.ДатаКурса);
						нСтр.СуммаБезНалога 	= Валюта_сервер.ПересчитатьПоКурсу(нСтр.Сумма, НовАкт.ВалютаДокумента, мВалютаРеглУчета, НовАкт.ДатаКурса);

					КонецЕсли;	
					нСтр.СуммаНДСРуб 		= Валюта_сервер.ПересчитатьПоКурсу(НСтр.СуммаНДС, НовАкт.ВалютаДокумента, мВалютаРеглУчета, НовАкт.ДатаКурса);
					нСтр.СтавкаНДСРуб 		= нСтр.СтавкаНДС ;
					//Евросиб СубботинВ #130097 19.02.2026 Начало
					Если Выборка.Валюта <> НовАкт.ВалютаДокумента и ЗначениеЗаполнено(КурсВалютыФрахт.Курс) Тогда
						нСтр.КурсВалютыФрахт = КурсВалютыФрахт.Курс;
					КонецЕсли;
					//Евросиб СубботинВ #130097 19.02.2026 Конец
				КонецЕсли;
				// Субботин TASK 72390 18.07.2023  Конец
				
				//Если АС <> Неопределено Тогда
				//	ОстатокСуммы = нСтр.Сумма;
				//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
				//	ПересчитатьОсновнуюТаблицуАвансов = Ложь;
				//	СтрокиСчетов = Неопределено;
				//	Если АСК.Количество() > 0 Тогда
				//		СтрокиСчетов = АСК.НайтиСтроки(Новый Структура("Номенклатура", нСтр.Номенклатура));
				//		ПересчитатьОсновнуюТаблицуАвансов = Истина;
				//	КонецЕсли; 
				//	Если СтрокиСчетов = Неопределено ИЛИ СтрокиСчетов.Количество() = 0 Тогда
				//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
				//		//Если СчетАвансаПоКТК.Количество() = 1 И СчетАвансаПоКТК[0].СуммаОстаток >= ОстатокСуммы Тогда
				//		Если СчетАвансаПоКТК.Количество() > 0 Тогда
				//			СтрокиСчетов = Новый Массив;
				//			Для каждого СтрокаСчетАвансаПоКТК Из СчетАвансаПоКТК Цикл
				//				НайдСтрокиСчетов = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаСчетАвансаПоКТК.СчетПокупателю, Выборка.Услуга));
				//				Для каждого найдСтрокаСчетов Из НайдСтрокиСчетов Цикл
				//					СтрокиСчетов.Добавить(найдСтрокаСчетов);
				//				КонецЦикла; 
				//			КонецЦикла; 
				//		КонецЕсли;
				//		//приоритетный вариант - сумма на всю сумму счета, учитывая предыдущий счет, чтобы выбирать сумму из одного и того же счета
				//		Если СтрокиСчетов = Неопределено ИЛИ СтрокиСчетов.Количество() = 0 Тогда
				//			СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, ОстатокСуммы, ПредыдущийСчет));
				//			//если сумма по счету не нашлась, то тогда по полному остатку суммы
				//			Если СтрокиСчетов.Количество() = 0 Тогда
				//				СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, ОстатокСуммы));
				//				//по услуге и счету
				//				Если СтрокиСчетов.Количество() = 0 Тогда
				//					СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура, СчетПокупателю", Выборка.Услуга, ПредыдущийСчет));
				//					//по услуге
				//					Если СтрокиСчетов.Количество() = 0 Тогда
				//						СтрокиСчетов = АС.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Услуга));
				//					КонецЕсли;
				//				КонецЕсли;
				//			КонецЕсли;
				//		КонецЕсли; 
				//	КонецЕсли; 
				//	
				//	Для каждого СтрокаСчетов Из СтрокиСчетов Цикл
				//		Если СтрокаСчетов.СуммаОстаток > 0 Тогда
				//			ПредыдущийСчет = СтрокаСчетов.СчетПокупателю;
				//			нСтр.СчетНаОплатуПокупателю = СтрокаСчетов.СчетПокупателю;
				//			Если ОстатокСуммы <= СтрокаСчетов.СуммаОстаток Тогда
				//				СуммаСчета = ОстатокСуммы;
				//				СтрокаСчетов.СуммаОстаток = СтрокаСчетов.СуммаОстаток - ОстатокСуммы;
				//				ОстатокСуммы = 0;
				//			Иначе
				//				СуммаСчета = СтрокаСчетов.СуммаОстаток;
				//				ОстатокСуммы = ОстатокСуммы - СтрокаСчетов.СуммаОстаток;
				//			КонецЕсли; 
				//			//добавим в тч счета
				//			нСчет = НовАкт.СчетаНаОплатуПокупателям.Добавить();
				//			нСчет.Номенклатура = нСтр.Номенклатура;
				//			нСчет.Сделка = Сделка;
				//			нСчет.СчетПокупателю = СтрокаСчетов.СчетПокупателю;
				//			нСчет.Сумма = СуммаСчета;
				//			//конец добавки
				//			Если ПересчитатьОсновнуюТаблицуАвансов Тогда
				//				СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаСчетов.СчетПокупателю, СтрокаСчетов.Номенклатура));	
				//				СтрокиАвансОсновная[0].СуммаОстаток = СтрокаСчетов.СуммаОстаток;
				//			КонецЕсли; 
				//			Если ОстатокСуммы = 0 Тогда
				//				Прервать;
				//			КонецЕсли; 
				//		КонецЕсли; 
				//	КонецЦикла; 
				//КонецЕсли; 
				
				//Евросиб Каблов 12.09.2023 ( #68187
				Если Выборка.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы Тогда
					СтрокиТаблицыСчетов = ТаблицаСчетов.НайтиСтроки(Новый Структура("ГУИД", Выборка.ГУИД));
					Если СтрокиТаблицыСчетов.Количество() > 0 Тогда
						Для Каждого Стр Из СтрокиТаблицыСчетов Цикл
							нСчет = НовАкт.СчетаНаОплатуПокупателям.Добавить();
							ЗаполнитьЗначенияСвойств(нСчет, Стр);
						КонецЦикла;
						нСтр.СчетНаОплатуПокупателю = Стр.СчетПокупателю;
					КонецЕсли;
				Иначе
				//Евросиб Каблов 12.09.2023 )
				
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					ЗаполнитьСчетаНаОплатуПокупателямАкта(АС, Выборка, НовАкт, нСтр, ПредыдущийСчет);
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					
				//Евросиб Каблов 12.09.2023 ( #68187
				КонецЕсли;
				//Евросиб Каблов 12.09.2023 )
				
				//Евросиб Каблов 26.08.2025 ( #111011
				НовАкт.СчетаНаОплатуПокупателям.Свернуть("СчетПокупателю,Номенклатура,Контейнер", "Сумма,Количество");
				Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(НовАкт.СчетаНаОплатуПокупателям);
				//Евросиб Каблов 26.08.2025 ) #111011
				
				Если ПодставлятьСделкуИзВыборки Тогда
					Сделка = Выборка.Сделка;
				КонецЕсли;
				//РасшифровкаЗаполнена = Ложь; //ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировал (перенесено в ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию)
				//Евросиб Каблов 03.08.2022 ( #55029
				СтрокаВагонов = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД, "ГУИД");
				//Если ЗначениеЗаполнено(СтрокаВагонов) Тогда   //ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировал (перенесено в ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию)
				//	МассивВагонов = СтрРазделить(СтрокаВагонов.Вагон, ";", Ложь);
				//	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивВагонов);
				//Иначе
				//	МассивВагонов = Новый Массив;
				//КонецЕсли;
				//КоличествоВагонов = МассивВагонов.Количество();
				//Евросиб Каблов 03.08.2022 )
				СтрокаКТК = Сделка.ДоходыКТК.Найти(Выборка.ГУИД, "ГУИД");
				Если ЗначениеЗаполнено(СтрокаКТК) Тогда
					НСтр.СписокТЕ = СтрокаКТК.КТК;
					//МассивКонтейнеров = СтрРазделить(СтрокаКТК.КТК, ";", Ложь);  //ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировал (перенесено в ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию)
					////Евросиб Каблов 03.08.2022 ( #55029
					//КоличествоКонтейнеров = МассивКонтейнеров.Количество();
					////Евросиб Каблов 03.08.2022 )
					//Для каждого ЭлМас Из МассивКонтейнеров ЦИкл
					//	//ИскНомерКТК = РаботаСКонтейнерамиСервер.НайтиКТК(ЭлМас);
					//	//++ Зубов 11.10.2021 Скорректируем код, т.к. у функции НайтиСтрокуПоезда другие параметры
					//	//СтрПоезда = Документы.Сделка.НайтиСтрокуПоезда(ЭлМас);
					//	СтрПоезда = Документы.Сделка.НайтиСтрокуПоезда(Сделка,ЭлМас,Истина);
					//	//-- Зубов 11.10.2021
					//	//СтрПоезда = Сделка.СвязьУчетныхЕдиниц.Найти(ИскНомерКТК, "Контейнер");
					//	Если ЗначениеЗаполнено(СтрПоезда) И Не СтрПоезда.НеАктивна Тогда
					//		НовСтрокаРасш = НовАкт.РасшифровкаУслугПоТС.Добавить();
					//		//Евросиб Каблов 03.08.2022 ( #55029
					//		//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка,, ПараметрыФФД);
					//		ЕдИзм = СтрПоезда.Калькуляция.ЕдиницаИзмерения;
					//		КоличествоДляСуммы = ?(ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.вагон, КоличествоВагонов, КоличествоКонтейнеров);
					//		Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка,, ПараметрыФФД, КоличествоДляСуммы);
					//		//Евросиб Каблов 03.08.2022 )
					//		РасшифровкаЗаполнена = Истина;
					//	КонецЕсли;
					//КонецЦИкла;
				КонецЕсли; 
				
				//СтрокаВагонов = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД, "ГУИД"); //Евросиб Каблов 03.08.2022 #55029
				Если ЗначениеЗаполнено(СтрокаВагонов) Тогда
					//Евросиб - АСуслов 16.01.2023 18:31:36 #61165
					//(          
					СписокВагонов = СтрокаВагонов.Вагон;
					МассивВагонов = СтрРазделить(СписокВагонов, ";");
					МассивВагонов = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивВагонов);
					НСтр.СписокТС = СтрСоединить(МассивВагонов, ";")
					//)
					//Евросиб - АСуслов 16.01.2023 18:31:37 #61165
					
					//// SIV: мне нужно добавить вагоны в расшифровку для реализаций услуг по предоставлению вагонов. 01-12-2019  //ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировал (перенесено в ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию)
					////Если НовАкт.РасшифровкаУслугПоТС.Количество() = 0 Тогда
					//Если НЕ РасшифровкаЗаполнена Тогда
					//	//МассивВагонов = СтрРазделить(СтрокаВагонов.Вагон, ";", Ложь); //Евросиб Каблов 03.08.2022 #55029
					//	Для каждого ЭлМас Из МассивВагонов ЦИкл
					//		СтрПоезда = Сделка.СвязьУчетныхЕдиниц.Найти(Справочники.ТС.НайтиПоНаименованию(СокрЛП(ЭлМас)), "Вагон");
					//		Если СтрПоезда <> неопределено И Не СтрПоезда.НеАктивна Тогда
					//			НовСтрокаРасш = НовАкт.РасшифровкаУслугПоТС.Добавить();
					//			//Евросиб Каблов 03.08.2022 ( #55029
					//			//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, Истина, ПараметрыФФД);
					//			Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, Истина, ПараметрыФФД, КоличествоВагонов);
					//			//Евросиб Каблов 03.08.2022 )
					//		КонецЕсли;
					//	КонецЦИкла;
					//КонецЕсли;
				КонецЕсли; 
				
				СтрокаТД = Сделка.ДоходыТД.Найти(Выборка.ГУИД, "ГУИД");
				Если ЗначениеЗаполнено(СтрокаТД) Тогда
					НСтр.СписокТД = СтрокаТД.ТД;
				КонецЕсли; 
				
// Евросиб Гудкова) 
				
				//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,"Акт",Неопределено,,,КурсВалютыФрахт); 
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
				// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
				СодержаниеУслуги = РаботаСоСделкамиСервер.ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,"Акт",Неопределено,,,КурсВалютыФрахт, ИзОбработки, КТКВХранилище, РелизСобственника); //Фролов 11.03.2022, таска 44976
				//СодержаниеУслуги = РаботаСоСделкамиСервер.ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,"Акт",Неопределено,,,КурсВалютыФрахт, ИзОбработки, КТКВХранилище);  //Фролов 11.03.2022, таска 44976
				// Евросиб Рыбьяков К.А. 18.03.2026 ))
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
				
				НСтр.Содержание = СодержаниеУслуги;
				
				НСтр.СтрокаДоходовСделки = Выборка.ГУИД;
				НСтр.Сделка = Сделка;
				//Евросиб Каблов 07.11.2022 ( 54532
				Если Выборка.ДоплатныеКТК Тогда
					НСтр.ВидЗадолженности = Перечисления.ВидыЗадолженности.Доплата;
				ИначеЕсли Выборка.УслугаВнеСтавки Тогда
					НСтр.ВидЗадолженности = Перечисления.ВидыЗадолженности.УслугиВнеСтавки;
				Иначе
					НСтр.ВидЗадолженности = Перечисления.ВидыЗадолженности.ОсновнойДолг;
				КонецЕсли;				
				//Евросиб Каблов 07.11.2022 )
			КонецЕсли; 
				
			//	НовАкт.СуммаДокумента = НовАкт.СуммаДокумента + Выборка.СуммаИтого;
			//КонецЕсли;
		КонецЦикла;
		//Документы.Сделка.СкорректироватьСуммыРасшифровки(НовАкт);
		//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало	
		ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию(НовАкт, РелизСобственника); // Евросиб US 82073 TA 114490 Рыбьяков К.А. Добавил РелизСобственника
		//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец
		
		
		НовАкт.СуммаДокумента = ?(НовАкт.СуммаВключаетНДС,НовАкт.Товары.Итог("Сумма")+НовАкт.Услуги.Итог("Сумма"),НовАкт.Товары.Итог("Сумма")+НовАкт.Услуги.Итог("Сумма")+НовАкт.Услуги.Итог("СуммаНДС") +НовАкт.Товары.Итог("СуммаНДС"));
		//НовАкт.ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(НовАкт, РеквизитыДоговора.ПравилоФормированияДатыУслуги,
		//																				РеквизитыДоговора.ПериодичностьВыставленияДокументов,
		//																				РеквизитыДоговора.ДатаПаспортаСделки);
		
		НовАкт.ДатаДокумента = ДатаВыставленияДокументов;
//Евросиб Гудкова( 03.01.2021 Ticket№ 0218868
		Если Год(НовАкт.ДатаДокумента) <> Год(НовАкт.Дата) Тогда
			//НовАкт.Дата = НовАкт.ДатаДокумента;				
			//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, начало
			НовАкт.Дата = КонецМесяца(НовАкт.ДатаДокумента);
			//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, конец
			НовАкт.УстановитьНовыйНомер();
		КонецЕсли; 
// Евросиб Гудкова)
		//Евросиб - АСуслов 13.09.2021 19:26:53 #33698
		//(
		//Евросиб Каблов 28.09.2020 (
		//Евросиб Каблов 28.10.2021 ( Ticket#0248229		
		//СтрокаДоходы = Сделка.Доходы.Найти(Выборка.ГУИД, "ГУИД");
		//НовАкт.ДатаОказанияУслуги = СтрокаДоходы.ДатаОказанияУслуги;
		Если ЗначениеЗаполнено(ГУИДСтрокиДоходов) Тогда
			СтрокаДоходы = Сделка.Доходы.Найти(ГУИДСтрокиДоходов, "ГУИД");
			НовАкт.ДатаОказанияУслуги = СтрокаДоходы.ДатаОказанияУслуги;
		КонецЕсли;
		Если НовАкт.СуммаДокумента = 0 Тогда
			НовАкт = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			Сообщить("Сумма документа равна 0. Закрывающий акт создан не был.");
		Иначе
			//дата устанавливается из экономики сделки поля период во.
			//НовАкт.УстановитьДатыДокумента();
			Попытка
				НовАкт.ДополнительныеСвойства.Вставить("ПрограммноеИзменение");
				НовАкт.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				// Евросиб Фролов (19.04.2022 
				ЗаписьЖурналаРегистрации("Создание РТУ при создании комплекта документов",
							УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ОтчетКомитентуОПродажах, НовАкт, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
				ТекстСообщения = СтрШаблон("Не удалось провести РТУ. Ошибка: %1",
													КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, НовАкт);
				// Евросиб Фролов)
			КонецПопытки;
		КонецЕсли;
		СтруктураСчетАкт.Вставить("Акт", НовАкт.Ссылка);
		// Создание счета-фактуры
		Если НовАкт.Ссылка <> Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			Если ЕстьСчФ Тогда
				Если ЗначениеЗаполнено(Акт) ИЛИ РежимИспользованияУдаленныхДокументовПоСделке Тогда
					СчФПред = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(НовАкт.Ссылка, "СчетФактураВыданный");
					Если СчФПред <> Неопределено Тогда
						СчФ = СчФПред.ПолучитьОбъект();
						Если СчФ.ПометкаУдаления Тогда
							СчФ.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь; 
						КонецЕсли;
					Иначе
						СЧФ = Документы.СчетФактураВыданный.СоздатьДокумент();
					КонецЕсли;
				Иначе	
					СЧФ = Документы.СчетФактураВыданный.СоздатьДокумент();
				КонецЕсли;
				//++ Зубов 38318 27.09.2021
				//БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовАкт.Ссылка, СЧФ);
				БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовАкт.Ссылка, СЧФ,,,,,Ложь);
				//-- Зубов 38318 27.09.2021
//Евросиб Гудкова( 24.02.2020 Ticket№ заполнение данных НДС0%

// Евросиб Гудкова)
				СЧФ.ДополнительныеСвойства.Вставить("ПрограммноеИзменение");
				СЧФ.Записать(РежимЗаписиДокумента.Проведение);
				СтруктураСчетАкт.Вставить("СчФ",СЧФ.Ссылка);
			КонецЕсли;
		Иначе
			Сообщить("Акт не был создан. Создание счета-фактуры прервано.");
		КонецЕсли;
		СтруктураСчетАкт.Вставить("Контрагент",Клиент);
		СтруктураСчетАкт.Вставить("Договор",Договор);
		СтруктураСчетАкт.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Клиент));
		МассивКомплектов.Добавить(СтруктураСчетАкт);
	КонецЕсли;
	#КонецОбласти
	
	////////////////////// Перевыставляемые ////////////////////////
	#Область Перевыставляемые
		Если ЕстьСчет и ЕстьОтчет Тогда
		СтруктураСчетОтчет = Новый Структура;
		//АС = НайтиАвансовыйСчет(Сделка,Клиент,Договор,ВыставленныеКоносаменты.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"),ВыставленныеЖД.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"));
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
		ДанныеПоАвансовымСчетам = НайтиАвансовыеСчетаПоВР(Сделка, Клиент, Договор);
		ТаблицаИнформированияПоСчетам = ПолучитьСтруктуру_ТаблицаИнформированияПоСчетам();
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		ДокПартии = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
		//ВыборкаОтч = ПолучитьВыборкуДляОтчета(Сделка, Клиент,Договор);
		ВыборкаОтч = Выборка;
		ПредыдущийСчет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
		//По каждой партии свой счет и отчет
		Пока ВыборкаОтч.Следующий() Цикл
			СтруктураСчетОтчет = Новый Структура;
			//Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, начало (закомментировал блок кода, решено проверку убрать)
			//Если не ТипЗнч(ВыборкаОтч.Партия) = Тип("Null") Тогда
			//	СчФПартии = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ВыборкаОтч.Партия,"СчетФактураПолученный");
			//Иначе
			//	СчФПартии = Неопределено;
			//КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, конец
			Если не ЗначениеЗаполнено(ВыборкаОтч.Партия) Тогда
				Сообщить("Для перевыставляемых услуг в табличной части Расходы не заполнен учетный документ (партия). Создание отчета комитенту невозможно.");
				Продолжить;
			//Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, начало (закомментировал блок кода, решено проверку убрать)
			//ИначеЕсли СчФПартии = Неопределено Тогда
			//	Сообщить("Для перевыставляемых услуг в табличной части Расходы к учетному документу не введен входящий счет-фактура. Создание отчета комитенту невозможно.");
			//	Продолжить;
			//Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, конец
			Иначе
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало (затирать счета запрещено)
				//БЫЛО
				////++ДИТ Гаузер А.В. BUG 53640 TA 53641 14.07.2022
				////СчетОтчетПред = НайтиСчетОтчетПоСделкеПартии(Сделка, Клиент, Договор, ВыборкаОтч.Партия);	
				//МассивГУИД = ПолучитьГУИДСтрокДоходовСделки(ВыборкаОтч);
				//СчетОтчетПред = НайтиСчетОтчетПоГУИДСтроки(МассивГУИД);	
				////--ДИТ Гаузер А.В. BUG 53640 TA 53641 14.07.2022
				//Если ЗначениеЗаполнено(СчетОтчетПред.Счет) Тогда
				//	НовДок = СчетОтчетПред.Счет.ПолучитьОбъект();
				//	Если НовДок.ПометкаУдаления  Тогда
				//		НовДок.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь; 
				//	КонецЕсли;	
				//	НовДок.Товары.Очистить();
				//	НовДок.Состояния.Очистить();
				//Иначе	
				//	НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
				//	НовДок.Заполнить(Неопределено);
				//	//НовДок.Дата = ТекущаяДата();
				//	//НовДок.ДатаДокумента = ТекущаяДата();
				//	//НовДок.ПериодВО = Выборка.ПериодВО; //КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
				//	НовДок.Партия = ВыборкаОтч.Партия;
				//КонецЕсли;
				//СТАЛО
				НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
				НовДок.Заполнить(Неопределено);
				НовДок.Партия = ВыборкаОтч.Партия;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
				НовДок.Дата = ТекущаяДата();
				Если Не ЗначениеЗаполнено(НовДок.Номер) Тогда
					НовДок.УстановитьНовыйНомер();
				КонецЕсли; 
				НовДок.ДатаДокумента = ДатаВыставленияДокументов;
	//Евросиб Гудкова( 03.01.2021 Ticket№ 0218868
				Если Год(НовДок.ДатаДокумента) <> Год(НовДок.Дата) Тогда
					//НовДок.Дата = НовДок.ДатаДокумента;				
					//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, начало
					НовДок.Дата = КонецМесяца(НовДок.ДатаДокумента);
					//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, конец
					НовДок.УстановитьНовыйНомер();
	// Евросиб Гудкова) 		
				КонецЕсли; // Евросиб Гудкова) 		
				НовДок.ПериодВО = НачалоМесяца(ДатаВыставленияДокументов);
				НовДок.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
				НовДок.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
				НовДок.Контрагент = Клиент;
				НовДок.АвансовыйСчет = Ложь;
				НовДок.ДоговорКонтрагента = Договор;
				НовДок.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.Дата);
				НовДок.КурсВзаиморасчетов = Результат.Курс;
				НовДок.ДатаКурса = НовДок.Дата;
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, начало
				ДатаКурса = НовДок.ДатаКурса;
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, конец
				
				// siv 06-03-20
				Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
					НовДок.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
					ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
				ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
					НовДок.КурсВзаиморасчетов = КурсУказанРуками;
					ОпределенПроизвольныйКурс = КурсУказанРуками;
					//НовДок.ДатаКурса = валюта_ДатаКурса;   //ДИТ, Беляев СЮ, TA51476, 09-06-2022, закомментировал, т.к. "валюта_ДатаКурса" пустая в этом режиме
				Иначе
					ДатаКурса = НовДок.Партия.ДатаВходящегоДокумента;
					Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
					НовДок.КурсВзаиморасчетов = Результат.Курс;
					НовДок.ДатаКурса = ДатаКурса;
				КонецЕсли;
				
				НовДок.КратностьВзаиморасчетов = Результат.Кратность;
							
				//НовДок.Сделка = Сделка;
				//Собакарь 28.10.20
				НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
				//НовДок.БанковскийСчетОрганизации = НовДок.Организация.ОсновнойБанковскийСчет;
				
				НовДок.УчитыватьНДС = Истина;
				НовДок.КомиссионныеУслуги = Истина;
				Выборка = ВыборкаОтч.Выбрать();
				СуммаВознагражденияИтог = 0;
				СуммаНДСВознагражденияИтог = 0;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				СтрокаНомераКТК = "";
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
				Пока Выборка.Следующий() Цикл
					
					// подбор нужной выборки по справочнику формирования фин доков
					//ЗапросКл.УстановитьПараметр("ВидПеревозки",Выборка.Калькуляция.ПС_ВидПеревозки);
					//НайденныйКлиент = ЗапросКл.Выполнить();
					
					//НовДок.СуммаВключаетНДС = ВыборкаОтч.НДСВключенВСтоимость;
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					НовСтр = НовДок.Товары.Добавить();
					НовСтр.Номенклатура = Выборка.Услуга;
					НовСтр.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
					//Евросиб Каблов 09.12.2025 ( #111016
					НовСтр.Калькуляция = Выборка.Калькуляция;
					//Евросиб Каблов 09.12.2025 ) #111016
					//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, начало
					НовСтр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
					//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, конец
					
					Если Клиент.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
						СчетНаАнгл = Истина;
					Иначе
						СчетНаАнгл = Неопределено;
					КонецЕсли;
					
					//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,"Счет",СчетНаАнгл);
					НовСТр.Содержание = Выборка.СодержаниеПТУ;
					НовСТр.Количество = 1;
					НовСТр.СтавкаНДС = Выборка.СтавкаНДС;
					ВалютаСтроки = Выборка.Валюта;
					СтавкаНДСВознаграждения = Выборка.СтавкаНДСВознаграждения;
					ВознаграждениеВключаетНДС = Выборка.ВознаграждениеВключаетНДС;
					Если ВалютаСтроки <> НовДок.ВалютаДокумента Тогда
						//СтавкаИтого = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.СтавкаИтого,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.ДатаКурса, НовДок.КурсВзаиморасчетов); 
						
						//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, начало
						РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
						Если РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
							ДатаКурса = ПолучитьДатуКурсаИзАвансовогоСчета(АС, Выборка);
						КонецЕсли;
						Если ДатаКурса = Неопределено Тогда
							ДатаКурса = НовДок.ДатаКурса; //возвращаем предыдущее значение, есои не нашли из авансового счета
						КонецЕсли; 
                        НовДок.ДатаКурса = ДатаКурса;
						ЗаполнитьРеквизитыКурсаВалютВДокумент(НовДок);
						//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, конец
						
						//ДИТ, Беляев СЮ, BUG 83306/TA 83308, 03-05-2024, начало (сделано аналогично логике пересчета курса для Отчета комитенту)
						Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
							ДатаКурса = валюта_ДатаКурса;
							СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
							НовДок.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
							НовДок.КурсВзаиморасчетов = СтруктураКурса.Курс;
							НовДок.ДатаКурса = ДатаКурса;
						КонецЕсли;
						//ДИТ, Беляев СЮ, BUG 83306/TA 83308, 03-05-2024, конец
						
						////ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.ДатаКурса, НовДок.КурсВзаиморасчетов, ,Выборка.ОкруглениеКурса);
						////ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
						
						//Евросиб(ДИТ), Беляев СЮ, Ticket#0355880, 18-06-2024, начало
						КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса);
						Если КурсВалютыФрахт.Курс = 1 Тогда
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
						КонецЕсли;
						
						Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.ДатаКурса, КурсВалютыФрахт.Курс, ,Выборка.ОкруглениеКурса);
						//Евросиб(ДИТ), Беляев СЮ, Ticket#0355880, 18-06-2024, конец
						
						НовСтр.ИсходнаяВалюта = Выборка.Валюта;
						НовСтр.ЦенаВВалюте = Выборка.Ставка; 
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
						НовСтр.Цена = Ставка;
						НовСтр.Сумма = Ставка * НовСТр.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Конец
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
                        //Евросиб СубботинВ #125845 19.12.2025 Конец

						Если Ставка = 0 Тогда
							Сообщить("При пересчете из валюты строки в валюту договора сумма по строке стала равна 0. Проверьте заполнение валюты взаиморасчетов в договоре и курсы валют.");
						КонецЕсли;
						//СуммаВознаграждения = Окр(РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Вознаграждение,Выборка.Валюта,НовДок.ВалютаДокумента,ДатаКурса, НовДок.КурсВзаиморасчетов, Истина),2);
						//СуммаВознаграждения = Окр(Ставка * Выборка.ПроцентВознаграждения / 100, 2);
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					Иначе
						//Делим на количество из доходов, т.к. в строках меняем количество на 1
						НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
						Ставка = Выборка.Ставка;
						НовСтр.СуммаНДС = Выборка.СуммаНДС / Выборка.Количество;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956  СтавкаИтого * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
						НовСтр.Сумма = Выборка.Ставка;
						НовСтр.Цена = Ставка;
					КонецЕсли;
					
					//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
					УменьшитьСуммуНаВеличинуАвансовогоСчетаПоВР(НовДок, ДанныеПоАвансовымСчетам, Выборка, НовСтр, ТаблицаИнформированияПоСчетам, ПредыдущийСчет);
					//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
					
					//Если прописано вознаграждение в т.ч. НДС, то базу считать с НДС. 
					//Если НДС кроме того, то базу брать без НДС
					Если Выборка.ВознаграждениеВключаетНДС Тогда
						Если Выборка.НДСВключенВСтоимость Тогда
							БазаВознаграждения = НовСтр.Сумма;
						Иначе
							БазаВознаграждения = НовСтр.Сумма + НовСтр.СуммаНДС; 
						КонецЕсли; 
						//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2);
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					Иначе
						//++ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						//Если Выборка.НДСВключенВСтоимость Тогда
						//	БазаВознаграждения = НовСтр.Сумма; 
						//Иначе
						//	БазаВознаграждения = НовСтр.Сумма - НовСтр.СуммаНДС;
						//КонецЕсли;
						БазаВознаграждения = НовСтр.Сумма;
						
						//--ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2), БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
						//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2) - СуммаНДСВознаграждения;
					КонецЕсли; 
					//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2);
					//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					//СуммаВознаграждения = БазаВознаграждения * Выборка.ПроцентВознаграждения / 100;
					// Евросиб US 131145 TA 131146 Рыбьяков К.А. 25.02.2026 ((
					БазаВознаграждения = НовСтр.Сумма - ?(Выборка.НДСВключенВСтоимость, НовСтр.СуммаНДС, 0);
					СуммаВознаграждения = БазаВознаграждения * Выборка.ПроцентВознаграждения / 100;
					СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Ложь);
					//СуммаНДСВознаграждения = Окр(БухгалтерскийУчетОбщиеПроцедурыСервер.РассчитатьСуммуНДС(СуммаВознаграждения, Выборка.ВознаграждениеВключаетНДС, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения)), 2); 
					//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					// Евросиб Рыбьяков К.А. 25.02.2026 ))
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					 
					СуммаВознагражденияИтог = СуммаВознагражденияИтог + СуммаВознаграждения;
					СуммаНДСВознагражденияИтог = СуммаНДСВознагражденияИтог + СуммаНДСВознаграждения;
					
					//ищем авансовую сумму по этой услуге
					//Если АС <> Неопределено Тогда
					//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//	Если СтрокиАванс.Количество() > 0 Тогда
					//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
					//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
					//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
					//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
					//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//			Если НовСтр.Сумма = 0 Тогда
					//				Прервать;
					//			КонецЕсли; 
					//		КонецЦикла;
					//	КонецЕсли; 
					//КонецЕсли; 
					//Если АС <> Неопределено Тогда
					//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
					//	ПересчитатьОсновнуюТаблицуАвансов = Ложь;
					//	СтрокиАванс = Неопределено;
					//	Если АСК.Количество() > 0 Тогда
					//		СтрокиАванс = АСК.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//		ПересчитатьОсновнуюТаблицуАвансов = Истина;
					//	КонецЕсли; 
					//	Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
					//		//1й вариант - сумма на всю сумму счета и ищем с предыдущим счетом
					//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
					//		Если СчетАвансаПоКТК.Количество() = 1 
					//			//И СчетАвансаПоКТК[0].СуммаОстаток >= НовСтр.Сумма 
					//			Тогда
					//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
					//		КонецЕсли;
					//		Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
					//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
					//			Если СтрокиАванс.Количество() = 0 Тогда
					//				//2й вариант на всю сумму счета
					//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
					//				//Евросиб - АСуслов 11.03.2022 9:33:33 #45629
					//				//( для вр отключаем поиск по только номенклатуре, будет создаваться счет.
					//				//Если СтрокиАванс.Количество() = 0 Тогда
					//				//	//3й вариант
					//				//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//				//КонецЕсли; 
					//				//)
					//				//Евросиб - АСуслов 11.03.2022 9:33:40 #45629
					//			КонецЕсли; 
					//		КонецЕсли; 
					//		
					//	КонецЕсли; 
					//	Если СтрокиАванс.Количество() > 0 Тогда
					//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
					//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
					//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
					//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
					//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//			Если ПересчитатьОсновнуюТаблицуАвансов Тогда
					//				СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАванс.СчетПокупателю, СтрокаАванс.Номенклатура));	
					//				СтрокиАвансОсновная[0].СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			КонецЕсли; 
					//			Если НовСтр.Сумма = 0 Тогда
					//				Прервать;
					//			КонецЕсли; 
					//		КонецЦикла;
					//	КонецЕсли; 
					//КонецЕсли; 
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					//УменьшитьСуммуНаВеличинуАвансовогоСчета(АС, Выборка, НовДок, НовСтр, ПредыдущийСчет, ВидыФормируемыхДокументов); //Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, закомментировал
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					
					//Если АС <> Неопределено Тогда
					//	СтрАС = АС.Найти(Выборка.ГУИД,"СтрокаДоходовСделки");
					//	Если СтрАС <> Неопределено Тогда
					//	//	СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
					//		СтавкаИтого = СтавкаИтого - СтрАС.Сумма;
					//	КонецЕсли;
					//КонецЕсли;
					
					НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
					Если НовСтр.Сумма = 0 Тогда
						НовДок.Товары.Удалить(НовСтр);
					Иначе
						//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
						СтрокаНомераКТК = СтрокаНомераКТК + Выборка.НомераКТК + ",";
						//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
					КонецЕсли; 
				КонецЦикла;
				Если СуммаВознагражденияИтог > 0 Тогда
					НовСтр = НовДок.Товары.Добавить();
					НовСтр.Номенклатура = Справочники.Номенклатура.Вознаграждение;
					НовСтр.Количество = 1;
					НовСтр.Содержание = НовСтр.Номенклатура.НаименованиеПолное;
					НовСтр.СтавкаНДС  = СтавкаНДСВознаграждения;
					НовСтр.СуммаНДС	= СуммаНДСВознагражденияИтог;
					//Евросиб Каблов 09.12.2025 ( #111016
					НовСтр.Калькуляция = НовДок.Товары[0].Калькуляция;
					//Евросиб Каблов 09.12.2025 ) #111016
					//тут придется вписать цену с учетом ндс
					//НовСтр.Цена = ?(ВознаграждениеВключаетНДС,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог,СуммаВознагражденияИтог);
					//здесь будем использовать настройку по документу, а не по строке, чтобы счет совпадал с отчетом
					//НовСтр.Сумма = ?(НовДок.СуммаВключаетНДС,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог,СуммаВознагражденияИтог);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					// Евросиб US 131145 TA 131146 Рыбьяков К.А. 25.02.2026 ((
					НовСтр.Цена = ?(ВознаграждениеВключаетНДС, СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог, СуммаВознагражденияИтог);
					НовСтр.Сумма = ?(НовДок.СуммаВключаетНДС, СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог, СуммаВознагражденияИтог);
					// Евросиб Рыбьяков К.А. 25.02.2026 ))
					//НовСтр.Цена = ?(ВознаграждениеВключаетНДС,СуммаВознагражденияИтог,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог);
					//НовСтр.Сумма = ?(НовДок.СуммаВключаетНДС,СуммаВознагражденияИтог,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					
					//Если АС <> Неопределено Тогда
					//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
					//	ПересчитатьОсновнуюТаблицуАвансов = Ложь;
					//	СтрокиАванс = Неопределено;
					//	Если АСК.Количество() > 0 Тогда
					//		СтрокиАванс = АСК.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//		ПересчитатьОсновнуюТаблицуАвансов = Истина;
					//	КонецЕсли; 
					//	Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
					//		//1й вариант - сумма на всю сумму счета и ищем с предыдущим счетом
					//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, НовСтр.Номенклатура, Выборка.ГУИД);
					//		Если СчетАвансаПоКТК.Количество() = 1 
					//			//И СчетАвансаПоКТК[0].СуммаОстаток >= НовСтр.Сумма 
					//			Тогда
					//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, НовСтр.Номенклатура));
					//		КонецЕсли;
					//		Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
					//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", НовСтр.Номенклатура, НовСтр.Сумма, ПредыдущийСчет));
					//			Если СтрокиАванс.Количество() = 0 Тогда
					//				//2й вариант на всю сумму счета
					//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", НовСтр.Номенклатура, НовСтр.Сумма));
					//				Если СтрокиАванс.Количество() = 0 Тогда
					//					//3й вариант
					//					СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//				КонецЕсли; 
					//			КонецЕсли; 
					//		КонецЕсли; 
					//		
					//	КонецЕсли; 
					//	Если СтрокиАванс.Количество() > 0 Тогда
					//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
					//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
					//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
					//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
					//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//			Если ПересчитатьОсновнуюТаблицуАвансов Тогда
					//				СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАванс.СчетПокупателю, СтрокаАванс.Номенклатура));	
					//				СтрокиАвансОсновная[0].СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			КонецЕсли; 
					//			Если НовСтр.Сумма = 0 Тогда
					//				Прервать;
					//			КонецЕсли; 
					//		КонецЦикла;
					//	КонецЕсли; 
					//КонецЕсли; 
					
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					//УменьшитьСуммуНаВеличинуАвансовогоСчета(АС, Выборка, НовДок, НовСтр, ПредыдущийСчет, ВидыФормируемыхДокументов); //Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, закомментировал
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					
					НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
					Если НовСтр.Сумма = 0 Тогда
						НовДок.Товары.Удалить(НовСтр);
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
			НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
			//Евросиб Гудкова( 12.10.2020 Ticket№ найдите 1 отличие, и счета перестанут задваиваться
			//		Если НовДок.СуммаДокумента < ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
			//Если НовДок.СуммаДокумента <= ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
			Если НовДок.СуммаДокумента = 0 Тогда
				//Если АС <> Неопределено Тогда
				//	Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
				//		НовДок = ПредыдущийСчет;
				//	Иначе
				//		НовДок = АС[0].СчетПокупателю;
				//		СтрокаНовДок = АС.Найти(0, "СуммаОстаток");
				//		Если СтрокаНовДок <> Неопределено Тогда
				//			НовДок = СтрокаНовДок.СчетПокупателю;
				//		Иначе
				//			НовДок = АС[0].СчетПокупателю;
				//		КонецЕсли; 
				//	КонецЕсли;
				//	Сообщить("Ранее был(и) создан(ы) документ(ы) на аванс на все сумму. Закрывающий счет создан не был.");
				//Иначе
				//	НовДок = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
				//	Сообщить("Сумма документа равна 0. Закрывающий счет создан не был.");
				//КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					НовДок = ПредыдущийСчет;
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
			Иначе
				//Если АС <> Неопределено Тогда
				Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					//				Для каждого СтрАС Из АС Цикл
					//				СтрАС = АС.Найти(СтрАС.СтрокаДоходовСделки,"СтрокаДоходовСделки");
					//					Если СтрАС <> Неопределено Тогда
					//						//СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
					//						НовСтр.Сумма = НовСтр.Сумма - СтрАС.Сумма;
					////Евросиб Гудкова( 12.10.2020 Ticket№ и молимся, что последняя строка счета не стала минусовой
					//						НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//						НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
					//// Евросиб Гудкова) 						
					//					КонецЕсли;
					//				КонецЦикла; 
					НовДок.НомерДляПечати = "";
					//НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АС[0].СчетПокупателю, "НомерДляПечати")+"/1"); 
					НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущийСчет, "НомерДляПечати")+"/1"); 
				КонецЕсли;
				НовДок.ДополнительныеСвойства.Вставить("ПрограммноеИзменение", Истина);
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				ДобавитьВТаблицуИнформированияПоСчетам(ТаблицаИнформированияПоСчетам, НовДок.Ссылка, СтрокаНомераКТК, Истина);
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
			КонецЕсли;
			//	НовДок.Записать(РежимЗаписиДокумента.Запись);
			СтруктураСчетОтчет.Вставить("Счет",НовДок.Ссылка);
			//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
			ВывестиСообщенияОСчетах(ТаблицаИнформированияПоСчетам);
			//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
			//Отчет комитенту
			//ВыборкаОтч.Сбросить();
			//ВыборкаОтч.Следующий();
			ДокПартии = ВыборкаОтч.Партия;
			//Евросиб - АСуслов 25.05.2021 16:02:45 #
			//(
			//по одной партии может быть несколько отчетов
			//Если ЗначениеЗаполнено(СчетОтчетПред.Отчет) Тогда
			//	НовОтчет = СчетОтчетПред.Отчет;
			//	Если ТипЗнч(НовОтчет) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			//		НовОтчет = НовОтчет.ПолучитьОбъект();
			//	КонецЕсли;
			//	Если НовОтчет.ПометкаУдаления Тогда
			//		НовОтчет.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь; 
			//	КонецЕсли;
			//	//НовОтчет.Товары.Очистить();
			//	//НовОтчет.Поставщики.Очистить();
			//	//НовОтчет.Состояния.Очистить();
			//	//НовОтчет.РасшифровкаУслугПоТС.Очистить();
			//Иначе
			//)
			//Евросиб - АСуслов 25.05.2021 16:02:45 #
				Если РежимИспользованияУдаленныхДокументовПоСделке Тогда
					//найдем удаленный документ по сделке/контрагенту/договору/партии
					//++ДИТ Гаузер А.В. BUG 53640 TA 53641 15.07.2022
					//ссОтчет = НайтиУдаленныйДокументОтчетКомитентуПоСделке(Сделка, Клиент, Договор, ДокПартии);    
					МассивГУИД = ПолучитьГУИДСтрокДоходовСделки(ВыборкаОтч);
					ссОтчет = НайтиУдаленныйДокументОтчетКомитентуПоГУИДСтроки(МассивГУИД);
					//--ДИТ Гаузер А.В. BUG 53640 TA 53641 15.07.2022
					Если ссОтчет = Неопределено Тогда
						НовОтчет = Документы.ОтчетКомитентуОПродажах.СоздатьДокумент();	
					Иначе
						НовОтчет = ссОтчет.ПолучитьОбъект();
						НовОтчет.УстановитьПометкуУдаления(Ложь);
					КонецЕсли; 
				Иначе
					НовОтчет = Документы.ОтчетКомитентуОПродажах.СоздатьДокумент();
				КонецЕсли;
			//КонецЕсли;	
			НовОтчет.Товары.Очистить();
			НовОтчет.Поставщики.Очистить();
			НовОтчет.РасшифровкаУслугПоТС.Очистить();
			НовОтчет.Заполнить(ДокПартии);
			НовОтчет.СуммаВознаграждения = 0;
			НовОтчет.СуммаНДСВознаграждения = 0;
			//НовОтчет.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод( НовОтчет.Организация);
			//НовОтчет.ПериодВО = Выборка.ПериодВО;
			НовОтчет.Дата = ТекущаяДата();
			Если Не ЗначениеЗаполнено(НовОтчет.Номер) Тогда
				НовОтчет.УстановитьНовыйНомер();
			КонецЕсли;
			//Евросиб Каблов 11.08.2021 ( Ticket#0238084
			//НовОтчет.ДатаДокумента = ДатаВыставленияДокументов;
			//Евросиб Каблов 11.08.2021 )			
//Евросиб Гудкова( 03.01.2021 Ticket№ 0218868
			Если Год(НовОтчет.ДатаДокумента) <> Год(НовОтчет.Дата) Тогда
				//НовОтчет.Дата = НовОтчет.ДатаДокумента;				
				//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, начало
				НовОтчет.Дата = КонецМесяца(НовОтчет.ДатаДокумента);
				//ДИТ, Беляев СЮ, Ticket#0297095, 11-01-2023, конец
				НовОтчет.УстановитьНовыйНомер();
// Евросиб Гудкова) 		
			КонецЕсли; // Евросиб Гудкова) 		
			НовОтчет.ПериодВО = НачалоМесяца(ДатаВыставленияДокументов);
			//Собакарь 28.10.20
			НовОтчет.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
			//НовОтчет.БанковскийСчетОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовОтчет.Организация, "ОсновнойБанковскийСчет");
			
			НовОтчет.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
			//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
			
			//НовОтчет.СчетНаОплатуПокупателю = НовДок.Ссылка;
			
			Если ЗначениеЗаполнено(НовДок.Ссылка) Тогда
				СчетС = НовДок.Ссылка;
				Для Каждого СтрокаТ ИЗ СчетС.Товары Цикл
					НовСтрокаСчета = НовОтчет.СчетаНаОплатуПокупателям.Добавить();			
					НовСтрокаСчета.СчетПокупателю = НовДок.Ссылка;
					НовСтрокаСчета.Номенклатура = СтрокаТ.Номенклатура;
					//Евросиб Каблов 28.11.2025 ( #111016
					//НовСтрокаСчета.Сделка = Сделка;
					//Евросиб Каблов 28.11.2025 ) #111016
					НовСтрокаСчета.Сумма = СтрокаТ.Сумма;
				КонецЦикла;	
			КонецЕсли;	
			//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
			//Евросиб Каблов 26.08.2025 ( #111011
			НовОтчет.СчетаНаОплатуПокупателям.Свернуть("СчетПокупателю,Номенклатура,Контейнер", "Сумма,Количество");
			Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(НовОтчет.СчетаНаОплатуПокупателям);
			//Евросиб Каблов 26.08.2025 ) #111011
			//ДИТ, Беляев СЮ, Ticket#0295835, 22-12-2022, начало
			//БЫЛО
			//НовОтчет.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
			//СТАЛО
			НовОтчет.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.Подразделения.ПустаяСсылка());
			НовОтчет.ЦФО = ?(ЗначениеЗаполнено(Сделка),Сделка.ЦФО,Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка());
			//ДИТ, Беляев СЮ, Ticket#0295835, 22-12-2022, конец

			НовОтчет.Сделка = Сделка;
			НовОтчет.Контрагент = Клиент;
			НовОтчет.ДоговорКонтрагента = Договор;
			НовОтчет.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
			СтруктураВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Договор.ВалютаВзаиморасчетов,ТекущаяДата());
			НовОтчет.КурсВзаиморасчетов = СтруктураВалюты.Курс;
			//НовОтчет.ДатаКурса = ТекущаяДата();   
			//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало (по аналогии с другими документами)
			НовОтчет.ДатаКурса = НовОтчет.Дата;  
			НовОтчет.КратностьВзаиморасчетов = СтруктураВалюты.Кратность;
			//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
				
			//Евросиб - АСуслов 04.10.2020 22:28:24 #
			//(
			НовОтчет.СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.УказываютсяСуммы;
			//)
			//Евросиб - АСуслов 04.10.2020 22:28:24 #
			//Евросиб Каблов 18.08.2021 ( Ticket#0240643
			//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, начало (закомментировал, неактуально)
			//Если НовОтчет.ДоговорКонтрагента.ДоговорТранспортнойЭкспедиции Тогда
			//	НовОтчет.ДатаДокумента = НачалоМесяца(НовОтчет.ДатаДокумента);
			//КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, конец
			//Евросиб Каблов 18.08.2021 )
			// siv 06-03-20
			//Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
			//	НовОтчет.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
			//	ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
			//ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
			//	НовОтчет.КурсВзаиморасчетов = КурсУказанРуками;
			//	ОпределенПроизвольныйКурс = КурсУказанРуками;
			//КонецЕсли;
			Если ЗначениеЗаполнено(ПСЦ) И ПСЦ.Валюта <> НовОтчет.ВалютаДокумента Тогда
				Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
					НовОтчет.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
					ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
				ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
					НовОтчет.КурсВзаиморасчетов = КурсУказанРуками;
					ОпределенПроизвольныйКурс = КурсУказанРуками;
					//НовОтчет.ДатаКурса = валюта_ДатаКурса;  //ДИТ, Беляев СЮ, TA51476, 09-06-2022, закомментировал, т.к. "валюта_ДатаКурса" пустая в этом режиме
				Иначе
					//Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, НовОтчет.ДатаДокумента);
					ДатаКурсаВх = ДокПартии.ДатаВходящегоДокумента;
					Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, ДатаКурсаВх);
					НовОтчет.КурсВзаиморасчетов = Результат.Курс;
					НовОтчет.КратностьВзаиморасчетов = Результат.Кратность;
					НовОтчет.ДатаКурса = ДатаКурсаВх;
				КонецЕсли;
			Иначе
				ДатаКурсаВх = ДокПартии.ДатаВходящегоДокумента;
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовОтчет.ВалютаДокумента, ДатаКурсаВх);
				НовОтчет.КурсВзаиморасчетов = Результат.Курс;
				НовОтчет.КратностьВзаиморасчетов = Результат.Кратность;
				НовОтчет.ДатаКурса = ДатаКурсаВх;
			КонецЕсли;
			
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, начало
			ДатаКурса = НовОтчет.ДатаКурса;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, конец
			
			//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, начало
			НовОтчет.ПравилоФормирования = ?(ПараметрыФФД = Неопределено, Справочники.ФормированиеФинДокументов.ПустаяСсылка(), ПараметрыФФД.Документ);
			//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, конец
			//НовОтчет.КратностьВзаиморасчетов = СтруктураВалюты.Кратность; //ДИТ, Беляев СЮ, TA51476, 09-06-2022, закомментировал
			
			//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
			НовСтрокаПоставщик = НовОтчет.Поставщики.Добавить();
			НовСтрокаПоставщик.Поставщик = ВыборкаОтч.Поставщик;
			НовСтрокаПоставщик.КПППоставщика = ВыборкаОтч.ПоставщикКПП;
			НовСтрокаПоставщик.Партия = ВыборкаОтч.Партия;
			СчфПоставщика = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ВыборкаОтч.Партия,"СчетФактураПолученный");
			НовСтрокаПоставщик.ПолученСФ = СчфПоставщика <> Неопределено;
			Если СчфПоставщика <> Неопределено Тогда
				РеквизитыСчфПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчфПоставщика, "ДатаВходящегоДокумента, НомерВходящегоДокумента");
				НовСтрокаПоставщик.НомерСчетаФактуры = РеквизитыСчфПоставщика.НомерВходящегоДокумента;
				НовСтрокаПоставщик.ДатаСФ = РеквизитыСчфПоставщика.ДатаВходящегоДокумента;
			Иначе
				РеквизитыСчфПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОтч.Партия, "ДатаВходящегоДокумента, НомерВходящегоДокумента");
				НовСтрокаПоставщик.НомерСчетаФактуры = РеквизитыСчфПоставщика.НомерВходящегоДокумента;
				НовСтрокаПоставщик.ДатаСФ = РеквизитыСчфПоставщика.ДатаВходящегоДокумента;
			КонецЕсли;
			НовСтрокаПоставщик.КлючСтроки = 1;
			//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
			
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0393278, 03-04-2025, начало
			НовОтчет.УстановитьДатыДокумента(); //установим даты когда уже заполены нужные реквизиты: Контрагент, Партия
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0393278, 03-04-2025, конец

			//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
			СуммаВознагражденияБезОкругления = 0;
			СуммаНДСВознагражденияБезОкругления = 0;
			//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
			
			ВыборкаСтрок = ВыборкаОтч.выбрать();
			//Для каждого СтрОтчета из НовОтчет.Товары Цикл
				Пока ВыборкаСтрок.Следующий() Цикл
					
					НовОтчет.СуммаВознагражденияВключаетНДС = ВыборкаСтрок.ВознаграждениеВключаетНДС;
					// подбор нужной выборки по справочнику формирования фин доков
					//ЗапросКл.УстановитьПараметр("ВидПеревозки",ВыборкаСтрок.Калькуляция.ПС_ВидПеревозки);
					//НайденныйКлиент = ЗапросКл.Выполнить();
					СтрОтчета = НовОтчет.Товары.Добавить();
					//Если СтрОтчета.Номенклатура = ВыборкаСтрок.Услуга Тогда
						СТрОтчета.СтрокаДоходовСделки = ВыборкаСтрок.ГУИД;
						
						//Евросиб Каблов 07.11.2022 ( 54532
						Если ВыборкаСтрок.ДоплатныеКТК Тогда
							СтрОтчета.ВидЗадолженности = Перечисления.ВидыЗадолженности.Доплата;
						ИначеЕсли ВыборкаСтрок.УслугаВнеСтавки Тогда
							СтрОтчета.ВидЗадолженности = Перечисления.ВидыЗадолженности.УслугиВнеСтавки;
						Иначе
							СтрОтчета.ВидЗадолженности = Перечисления.ВидыЗадолженности.ОсновнойДолг;
						КонецЕсли;				
						//Евросиб Каблов 07.11.2022 )
						
						СтрокаДоходы = Сделка.Доходы.Найти(ВыборкаСтрок.ГУИД, "ГУИД");
						НовОтчет.ДатаОказанияУслуги = СтрокаДоходы.ДатаОказанияУслуги;
						//Евросиб - АСуслов 13.11.2020 16:15:02 #
						//(
						//СтрОтчета.Количество = ВыборкаСтрок.Количество;
						СтрОтчета.Количество = 1;
						//)
						//Евросиб - АСуслов 13.11.2020 16:15:02 #
						СтрОтчета.Цена =ВыборкаСтрок.Ставка;
						СтрОтчета.НоменклатурнаяГруппа = ВыборкаСтрок.НоменклатурнаяГруппа;
						
						//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,ВыборкаСтрок,НайденныйКлиент,"Отчет",Неопределено);
						
						СтрОтчета.Номенклатура = ВыборкаСтрок.НоменклатураПТУ;
						СтрОтчета.ЕдиницаИзмерения = ВыборкаСтрок.ЕдиницаИзмерения;
						//СтрОтчета.Содержание = ВыборкаСтрок.СодержаниеПТУ;
						//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
						СтрОтчета.Содержание = ВыборкаСтрок.СодержаниеПТУ + РаботаСоСделкамиСервер.ПолучитьДополнениеУслугиОтчетаКомитенту(НовОтчет, ПараметрыФФД);
						//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
						СтрОтчета.ГУИДПТУ = ВыборкаСтрок.ИдентификаторСтрокиПоступления;
						
						//СтрОтчета.Цена = ?(ВыборкаСтрок.Валюта <> НовОтчет.ВалютаДокумента,РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.Ставка,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.Дата),ВыборкаСтрок.Ставка);
						НовОтчет.СуммаВключаетНДС = ВыборкаСтрок.НДСВключенВСтоимость;
						СтрОтчета.СтавкаНДС = ВыборкаСтрок.СтавкаНДС;
						
						Если ВыборкаСтрок.Валюта <> НовОтчет.ВалютаДокумента Тогда
							//Если Выборка.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") 
							//	И НовАкт.КурсВзаиморасчетов = 1 Тогда
							//Евросиб - АСуслов 17.11.2020 11:54:06 #
							//(
							//для фрахта проверяем условие пересчета суммы
							//РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
							//ДатаКурса = Неопределено;
							//Если РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
							//	//Если АС <> Неопределено Тогда
							//	//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент);
							//	//	Если АСК.Количество() > 0 Тогда
							//	//		СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//	//		Если СтрокаСчетАванса <> Неопределено Тогда
							//	//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//	//		КонецЕсли; 
							//	//	КонецЕсли;
							//	//	Если ДатаКурса = Неопределено Тогда
							//	//		СтрокаСчетАванса = АС.Найти(Выборка.Услуга, "Номенклатура");
							//	//		Если СтрокаСчетАванса <> Неопределено Тогда
							//	//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//	//		КонецЕсли; 
							//	//	КонецЕсли; 
							//	//КонецЕсли; 
							//	Если АС <> Неопределено Тогда
							//		АСК = НайтиАвансовыйСчетПоКоносаменту(АС, ВыборкаСтрок.Коносамент);
							//		Если АСК.Количество() > 0 Тогда
							//			СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//			Если СтрокаСчетАванса <> Неопределено Тогда
							//				ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//			КонецЕсли; 
							//		КонецЕсли;
							//		Если ДатаКурса = Неопределено Тогда
							//			СтрокиАванс = Неопределено;
							//			СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, ВыборкаСтрок.Услуга, ВыборкаСтрок.ГУИД);
							//			Если СчетАвансаПоКТК.Количество() = 1 Тогда
							//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, ВыборкаСтрок.Услуга));
							//			КонецЕсли;
							//			//Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//			//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
							//			//	Если СтрокиАванс.Количество() = 0 Тогда
							//			//		//2й вариант на всю сумму счета
							//			//		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
							//			//Если СтрокиАванс.Количество() = 0 Тогда
							//			//3й вариант
							//			Если СтрокиАванс = Неопределено Тогда
							//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаСтрок.Услуга));
							//			КонецЕсли; 
							//			//КонецЕсли; 
							//			//	КонецЕсли; 
							//			//КонецЕсли; 
							//			Если СтрокиАванс.Количество() > 0 Тогда
							//				СтрокаСчетАванса = СтрокиАванс[0]; 
							//				ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//			КонецЕсли; 
							//		КонецЕсли; 
							//	КонецЕсли; 
							//КонецЕсли;
							//Если ДатаКурса = Неопределено Тогда
							//	//ДатаКурса = ДатаВыставленияДокументов;
							//	ДатаКурса = НовДок.ДатаДокумента;
							//КонецЕсли; 
							
							//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, начало
							РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
							Если РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
								ДатаКурса = ПолучитьДатуКурсаИзАвансовогоСчета(АС, ВыборкаСтрок);
							КонецЕсли;
							Если ДатаКурса = Неопределено Тогда
								ДатаКурса = НовОтчет.ДатаКурса; //возвращаем предыдущее значение, есои не нашли из авансового счета
							КонецЕсли; 
							НовОтчет.ДатаКурса = ДатаКурса;
							ЗаполнитьРеквизитыКурсаВалютВДокумент(НовОтчет);
							//Евросиб(ДИТ), Беляев СЮ, Ticket#0356773, 25-06-2024, конец
							
							Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
								ДатаКурса = валюта_ДатаКурса;
								 СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовОтчет.ВалютаДокумента, ДатаКурса);
								 НовОтчет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
								 НовОтчет.КурсВзаиморасчетов = СтруктураКурса.Курс;
								 НовОтчет.ДатаКурса = ДатаКурса;
							КонецЕсли; 
							////)
							////Евросиб - АСуслов 17.11.2020 12:27:43 #
							//КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВыборкаСтрок.Валюта, ДатаКурса);
							//Если КурсВалютыФрахт.Курс = 1 Тогда
							//	//КурсВалютыФрахт.Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовАкт.ВалютаДокумента, ДатаКурса).Курс;
							//	КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовОтчет.ВалютаДокумента, ДатаКурса);
							//КонецЕсли; 
							//Если НЕ Выборка.ОкруглениеКурса = Неопределено Тогда
							//	КурсВалютыФрахт.Курс = Окр(КурсВалютыФрахт.Курс, ВыборкаСтрок.ОкруглениеКурса);
							//КонецЕсли; 
							//РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаСтрок.Калькуляция, "ЗафиксироватьКурс, Курс");
							//Если РеквизитыКалькуляции.ЗафиксироватьКурс Тогда
							//	КурсВалютыФрахт.Курс = РеквизитыКалькуляции.Курс;
							//КонецЕсли; 
							//Если ЗначениеЗаполнено(КурсУказанРуками) Тогда
							//	КурсВалютыФрахт.Курс = КурсУказанРуками;	
							//КонецЕсли; 
							//)
							//Евросиб - АСуслов 17.11.2020 11:54:07 #
							
							//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.Ставка,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.Дата, НовОтчет.КурсВзаиморасчетов, Истина);
							//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
							//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.Ставка,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.ДатаКурса, НовОтчет.КурсВзаиморасчетов, Истина); 
							//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
							//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
							//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.Ставка,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.ДатаКурса, НовОтчет.КурсВзаиморасчетов, Истина, ВыборкаСтрок.ОкруглениеКурса);
							//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
							
							//Евросиб(ДИТ), Беляев СЮ, Ticket#0355880, 18-06-2024, начало
							//КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса);
							//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВыборкаСтрок.Валюта, ДатаКурса);
							//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
							Если КурсВалютыФрахт.Курс = 1 Тогда
								КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
							КонецЕсли;
							
							Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.Ставка, ВыборкаСтрок.Валюта, НовОтчет.ВалютаДокумента,НовОтчет.ДатаКурса, КурсВалютыФрахт.Курс, Истина, ВыборкаСтрок.ОкруглениеКурса);
							//Евросиб(ДИТ), Беляев СЮ, Ticket#0355880, 18-06-2024, конец
							
							//Иначе
							//	Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовАкт.ВалютаДокумента,НовАкт.Дата, НовАкт.КурсВзаиморасчетов, Истина);
							//КонецЕсли; 
							//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
							Если ОкруглятьСтавкуПриПересчетеКурса Тогда
								СтрОтчета.Цена = Ставка;
								СтрОтчета.Сумма = СтрОтчета.Цена * СтрОтчета.Количество;
								//Евросиб СубботинВ #125845 19.12.2025 Начало
								//СтрОтчета.СуммаНДС = СтрОтчета.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДС)/?(ВыборкаСтрок.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
								СтрОтчета.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрОтчета.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДС), НовОтчет.УчитыватьНДС, ВыборкаСтрок.НДСВключенВСтоимость);
								//Евросиб СубботинВ #125845 19.12.2025 Конец	
							Иначе
								СтрОтчета.Сумма = Ставка * СтрОтчета.Количество;
								СтрОтчета.Цена = СтрОтчета.Сумма / СтрОтчета.Количество;
								//Евросиб СубботинВ #125845 19.12.2025 Начало
								//СтрОтчета.СуммаНДС = СтрОтчета.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДС)/?(ВыборкаСтрок.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
								СтрОтчета.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрОтчета.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДС), НовОтчет.УчитыватьНДС, ВыборкаСтрок.НДСВключенВСтоимость);
								//Евросиб СубботинВ #125845 19.12.2025 Конец
							КонецЕсли; 
							
							//СуммаВознаграждения = РаботаСКурсамиВалют.ПересчитатьВВалюту(Окр(СтрОтчета.Сумма * ВыборкаСтрок.ПроцентВознаграждения / 100, 2),ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,ДатаКурса, НовОтчет.КурсВзаиморасчетов, Истина);
							////СтрОтчета.СуммаВознаграждения = СуммаВознаграждения / ВыборкаСтрок.Количество;
							//Если НЕ ВыборкаСтрок.ВознаграждениеВключаетНДС Тогда
							//	СтрОтчета.СуммаВознаграждения = СуммаВознаграждения;
							//	СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрОтчета.СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
							//Иначе
							//	СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
							//	СтрОтчета.СуммаВознаграждения = СуммаВознаграждения - СтрОтчета.СуммаНДСВознаграждения;
							//КонецЕсли; 
						Иначе
							СтрОтчета.Сумма = ВыборкаСтрок.Ставка;
							//Если НЕ ВыборкаСтрок.ВознаграждениеВключаетНДС Тогда
							//	//СтрОтчета.Сумма = ВыборкаСтрок.СтавкаИтого;
							//	//СтрОтчета.СуммаВознаграждения = ВыборкаСтрок.ВознаграждениеИтого;
							//	//СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ВыборкаСтрок.ВознаграждениеИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
							//	//СтрОтчета.Сумма = ВыборкаСтрок.Ставка;
							//	СтрОтчета.СуммаВознаграждения = Окр(СтрОтчета.Сумма * ВыборкаСтрок.ПроцентВознаграждения / 100, 2);
							//	СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрОтчета.СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
							//Иначе
							//	//СтрОтчета.Сумма = ВыборкаСтрок.Ставка - (ВыборкаСтрок.СуммаНДС / ВыборкаСтрок.Количество);
							//	СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(СтрОтчета.Сумма * ВыборкаСтрок.ПроцентВознаграждения / 100, 2), БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
							//	СтрОтчета.СуммаВознаграждения = Окр(СтрОтчета.Сумма * ВыборкаСтрок.ПроцентВознаграждения / 100, 2) - СтрОтчета.СуммаНДСВознаграждения;
							//КонецЕсли; 
							СтрОтчета.Цена =  ВыборкаСтрок.Ставка;
							СтрОтчета.СуммаНДС = ВыборкаСтрок.СуммаНДС / ВыборкаСтрок.Количество;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956 нСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
						КонецЕсли; 
						//СтрОтчета.Сумма =  ?(ВыборкаСтрок.Валюта <> НовОтчет.ВалютаДокумента,РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.СтавкаИтого,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.Дата),ВыборкаСтрок.СтавкаИтого);
						//СтрОтчета.СуммаНДС = ВыборкаСтрок.СуммаНДС;
						СтрОтчета.КлючСтроки = 1;
						НовОтчет.СтавкаНДСВознаграждения = ВыборкаСтрок.СтавкаНДСВознаграждения;
						//Если прописано вознаграждение в т.ч. НДС, то базу считать с НДС. 
						//Если НДС кроме того, то базу брать без НДС
						//Евросиб Шевченко А.В. US 117058 TA 117059 18.08.2025
						//Если ВыборкаСтрок.ВознаграждениеВключаетНДС Тогда
						//	Если ВыборкаСтрок.НДСВключенВСтоимость Тогда
						//		БазаВознаграждения = СтрОтчета.Сумма;
						//	Иначе
						//		БазаВознаграждения = СтрОтчета.Сумма + СтрОтчета.СуммаНДС; 
						//	КонецЕсли; 
						//	//СуммаВознаграждения = Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, 2);
						//	//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
						//Иначе
						//	//++ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						//	//Если ВыборкаСтрок.НДСВключенВСтоимость Тогда
						//	//	БазаВознаграждения = СтрОтчета.Сумма;
						//	//Иначе
						//	//	БазаВознаграждения = СтрОтчета.Сумма - СтрОтчета.СуммаНДС; 
						//	//КонецЕсли;
						//	БазаВознаграждения = СтрОтчета.Сумма;							
						//	//--ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						//	 
						//	//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, 2), БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
						//	//СуммаВознаграждения = Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, 2) - СуммаНДСВознаграждения;
						//КонецЕсли;
						//СуммаВознаграждения = Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, 2);
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, 2), БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
						
						//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
						//СуммаВознагражденияБезОкругления = СуммаВознагражденияБезОкругления + БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100;
						//СуммаНДСВознагражденияБезОкругления = СуммаНДСВознагражденияБезОкругления + БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, ВыборкаСтрок.ВознаграждениеВключаетНДС);
						//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
						
						//Евросиб СубботинВ #120291 24.09.2025 Начало
						//БазаВознаграждения = СтрОтчета.Сумма - СтрОтчета.СуммаНДС;
						БазаВознаграждения = СтрОтчета.Сумма - ?(НовОтчет.СуммаВключаетНДС, СтрОтчета.СуммаНДС, 0);
						//Евросиб СубботинВ #120291 24.09.2025 Конец
						
						СуммаВознагражденияБезОкругления = СуммаВознагражденияБезОкругления + БазаВознаграждения*ВыборкаСтрок.ПроцентВознаграждения/100;								
						//Евросиб СубботинВ # 120291 02.10.2025 Начало 
						//СуммаНДСВознагражденияБезОкругления = СуммаНДСВознагражденияБезОкругления + БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения),Истина,ВыборкаСтрок.ВознаграждениеВключаетНДС);
						СуммаНДСВознагражденияБезОкругления = СуммаНДСВознагражденияБезОкругления + БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения), Истина, Ложь);
                    	//Евросиб СубботинВ #120291 02.10.2025 Конец						
						
						//СтрОтчета.СуммаВознаграждения = СуммаВознаграждения;
						//СтрОтчета.СуммаНДСВознаграждения = СуммаНДСВознаграждения;
						
						СтрОтчета.СуммаВознаграждения = Окр(БазаВознаграждения*ВыборкаСтрок.ПроцентВознаграждения/100, 2);								
						//Евросиб СубботинВ # 120291 02.10.2025 Начало
						//СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100,2),БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения),НовОтчет.УчитыватьНДС,ВыборкаСтрок.ВознаграждениеВключаетНДС);
						СтрОтчета.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * ВыборкаСтрок.ПроцентВознаграждения / 100,2),БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаСтрок.СтавкаНДСВознаграждения),Истина, Ложь);
                        //Евросиб СубботинВ # 120291 02.10.2025 Конец
						//Евросиб Шевченко А.В. US 117058 TA 117059 18.08.2025
						//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
						СтрОтчета.СодержаниеУслугиВознаграждения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.Номенклатура.Вознаграждение, "НаименованиеПолное");
						//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
						//СтрОтчета.СуммаНДС = ?(ВыборкаСтрок.Валюта <> НовОтчет.ВалютаДокумента,РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСтрок.СуммаНДС,ВыборкаСтрок.Валюта,НовОтчет.ВалютаДокумента,НовОтчет.Дата),ВыборкаСтрок.СуммаНДС);
						//Для каждого СтрКтк из Сделка.ДоходыКТК Цикл
						//	КТК = "";
						//	Если ВыборкаСтрок.ГУИД = СтрКтк.ГУИД Тогда КТК = СтрКтк.КТК; КонецЕсли;
						//	МассивКонтейнеров = СтрРазделить(КТК,";",Ложь);
						//	Если МассивКонтейнеров.Количество() <> 0 Тогда
						//		Для каждого ЭлМас Из МассивКонтейнеров ЦИкл
						//			СтрПоезда = Сделка.СвязьУчетныхЕдиниц.Найти(РаботаСКонтейнерамиСервер.НайтиКТК(ЭлМас),"Контейнер");
						//			Если СтрПоезда <> неопределено Тогда
						//				НовСтрокаРасш = НовОтчет.РасшифровкаУслугПоТС.Добавить();
						//				//Евросиб Гудкова( 24.02.2020 
						//				//НовСтрокаРасш.Услуга = ВыборкаСтрок.Услуга;
						//				//НовСтрокаРасш.НомерЖДН = СтрПоезда.НомерЖДН;
						//				//НовСтрокаРасш.Груз = СтрПоезда.Груз;
						//				//НовСтрокаРасш.Контейнер = СтрПоезда.Контейнер;//СтрПоезда.Контейнер.Префикс + " " +  СтрПоезда.Контейнер.Номер;
						//				//НовСтрокаРасш.Вагон = СтрПоезда.Вагон;
						//				//НовСтрокаРАсш.ПунктОтправления = Сделка.СтанцияОтправления;
						//				//НовСтрокаРасш.ПунктНазначения = Сделка.СтанцияНазначения;
						//				ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, ВыборкаСтрок, СтрОтчета, Сделка);
						//				// Евросиб Гудкова)
						//			КонецЕсли;
						//		КонецЦИкла;
						//	КонецЕсли;
						//КонецЦикла;
						
						
						//СтрокаКТК = Сделка.ДоходыКТК.Найти(ВыборкаСтрок.ГУИД, "ГУИД");
						//Если ЗначениеЗаполнено(СтрокаКТК) Тогда
							//СтрОтчета.СписокТЕ = СтрокаКТК.КТК;
							//МассивКонтейнеров = СтрРазделить(СтрокаКТК.КТК, ";", Ложь);
							//Для каждого ЭлМас Из МассивКонтейнеров ЦИкл
								//ИскНомерКТК = РаботаСКонтейнерамиСервер.НайтиКТК(ЭлМас);
								//СтрПоезда = НайтиСтрокуПоезда(ЭлМас);
								
								////Евросиб Каблов 03.08.2022 ( #55029      //ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировал
								//СтрокаВагонов = Сделка.ДоходыВагоны.Найти(ВыборкаСтрок.ГУИД, "ГУИД");
								//Если ЗначениеЗаполнено(СтрокаВагонов) Тогда
								//	МассивВагонов = СтрРазделить(СтрокаВагонов.Вагон, ";", Ложь);
								//	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивВагонов);
								//Иначе
								//	МассивВагонов = Новый Массив;
								//КонецЕсли;
								//КоличествоВагонов = МассивВагонов.Количество();
								
								//СтрокаКТК = Сделка.ДоходыКТК.Найти(ВыборкаСтрок.ГУИД, "ГУИД");
								//Если ЗначениеЗаполнено(СтрокаКТК) Тогда
								//	МассивКонтейнеров = СтрРазделить(СтрокаКТК.КТК, ";", Ложь);
								//Иначе
								//	КоличествоКонтейнеров = 1;
								//КонецЕсли;
								//КоличествоКонтейнеров = МассивКонтейнеров.Количество();
								////Евросиб Каблов 03.08.2022 )
				
								//СтрПоезда = Сделка.СвязьУчетныхЕдиниц.Найти(ВыборкаСтрок.СтрокаСвязьУчетныхЕдиниц, "ГУИД");
								//Если СтрПоезда <> Неопределено И Не СтрПоезда.НеАктивна Тогда
								//	НовСтрокаРасш = НовОтчет.РасшифровкаУслугПоТС.Добавить();
								//	//Евросиб Каблов 03.08.2022 ( #55029
								//	//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, ВыборкаСтрок, СтрОтчета, Сделка,, ПараметрыФФД);
								//	ЕдИзм = СтрПоезда.Калькуляция.ЕдиницаИзмерения;
								//	КоличествоДляСуммы = ?(ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.вагон, КоличествоВагонов, КоличествоКонтейнеров);
								//	Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, ВыборкаСтрок, СтрОтчета, Сделка,, ПараметрыФФД, КоличествоДляСуммы);
								//	//Евросиб Каблов 03.08.2022 )
								//	//СтрОтчета.СтрокаСвязьУчетныхЕдиниц = СтрПоезда.ГУИД;
								//КонецЕсли;
							//КонецЦИкла;
						//КонецЕсли; 
						
						//СтрокаВагонов = Сделка.ДоходыВагоны.Найти(ВыборкаСтрок.ГУИД, "ГУИД");
						//Если ЗначениеЗаполнено(СтрокаВагонов) Тогда
						//	СтрОтчета.СписокТС = СтрокаВагонов.Вагон;
						//	// SIV: мне нужно добавить вагоны в расшифровку для реализаций услуг по предоставлению вагонов. 01-12-2019
						//	Если НовОтчет.РасшифровкаУслугПоТС.Количество() = 0 Тогда
						//		МассивВагонов = СтрРазделить(СтрокаВагонов.Вагон, ";", Ложь);
						//		Для каждого ЭлМас Из МассивВагонов ЦИкл
									//СтрПоезда = Сделка.СвязьУчетныхЕдиниц.Найти(Справочники.ТС.НайтиПоНаименованию(ЭлМас), "Вагон");
									//Если СтрПоезда <> неопределено И Не СтрПоезда.НеАктивна Тогда
									//	НовСтрокаРасш = НовОтчет.РасшифровкаУслугПоТС.Добавить();
									//	ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, ВыборкаСтрок, СтрОтчета, Сделка);
									//КонецЕсли;
						//		КонецЦИкла;
						//	КонецЕсли;
						//КонецЕсли; 
						
						СтрокаТД = Сделка.ДоходыТД.Найти(Выборка.ГУИД, "ГУИД");
						Если ЗначениеЗаполнено(СтрокаТД) Тогда
							СтрОтчета.СписокТД = СтрокаТД.ТД;
						КонецЕсли; 
						
						СтрокаВагоны = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД, "ГУИД");
						Если ЗначениеЗаполнено(СтрокаВагоны) Тогда
							СтрОтчета.СписокТС = СтрокаВагоны.Вагон;
						КонецЕсли; 
						
						СтрокаКТК = Сделка.ДоходыКТК.Найти(Выборка.ГУИД, "ГУИД");
						Если ЗначениеЗаполнено(СтрокаКТК) Тогда
							СтрОтчета.СписокТЕ = СтрокаКТК.КТК;
						КонецЕсли;
						
						
					//КонецЕсли;
				КонецЦикла;
			//КонецЦикла;
			//Сч = НовОтчет.Товары.Количество();
			//Пока Сч > 0 Цикл
			//	Если не ЗначениеЗаполнено(НовОтчет.Товары[Сч-1].СтрокаДоходовСделки) Тогда
			//		НовОтчет.Товары.Удалить(Сч-1);
			//		Сч = Сч-1;
			//	Иначе
			//		Сч = Сч-1;
			//	КонецЕсли;
			//КонецЦикла;
			// Евросиб US 122278 TA 122482 Рыбьяков К.А. 30.10.2025 ((
			СуммаВознагражденияОбщая = Окр(Окр(СуммаВознагражденияБезОкругления + СуммаНДСВознагражденияБезОкругления, 3), 2);
			//СуммаВознагражденияОбщая = ?(НовОтчет.СуммаВознагражденияВключаетНДС, СуммаВознагражденияБезОкругления, Окр(Окр(СуммаВознагражденияБезОкругления + СуммаНДСВознагражденияБезОкругления, 3), 2));
			СуммаНДСВознагражденияБезОкругления = Окр(БухгалтерскийУчетОбщиеПроцедурыСервер.РассчитатьСуммуНДС(СуммаВознагражденияОбщая, Истина, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовОтчет.СтавкаНДСВознаграждения)), 2); 
			СуммаВознагражденияБезОкругления = Окр(СуммаВознагражденияОбщая - СуммаНДСВознагражденияБезОкругления, 2);
			// Евросиб Рыбьяков К.А. 06.11.2025 ))

			//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
			Если НовОтчет.Товары.Количество() > 0 Тогда
				РаспределитьКопейкиОтСуммыРассчитаннойБезОкругления( НовОтчет.Товары, СуммаВознагражденияБезОкругления, "СуммаВознаграждения" );
				РаспределитьКопейкиОтСуммыРассчитаннойБезОкругления( НовОтчет.Товары, СуммаНДСВознагражденияБезОкругления, "СуммаНДСВознаграждения" );
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
			
			НовОтчет.СуммаДокумента = ?(НовОтчет.СуммаВключаетНДС, НовОтчет.Товары.Итог("Сумма"),НовОтчет.Товары.Итог("Сумма")+НовОтчет.Товары.Итог("СуммаНДС"));
			//НовОтчет.СуммаВознаграждения = НовОтчет.Товары.Итог("СуммаВознаграждения") + ?(НовОтчет.СуммаВознагражденияВключаетНДС,0, НовОтчет.Товары.Итог("СуммаНДСВознаграждения"));
			//НовОтчет.СуммаНДСВознаграждения = НовОтчет.Товары.Итог("СуммаНДСВознаграждения");
			СуммаВознаграждения = НовОтчет.Товары.Итог("СуммаВознаграждения");
			//+ ?(НовОтчет.СуммаВознагражденияВключаетНДС,0, НовОтчет.Товары.Итог("СуммаНДСВознаграждения"));
			//Евросиб СубботинВ #120291 24.09.2025 Начало
			//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения,
			//																						БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовОтчет.СтавкаНДСВознаграждения),
			//																						НовОтчет.УчитыватьНДС,
			//																						НовОтчет.СуммаВознагражденияВключаетНДС);
			СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения,
																									БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовОтчет.СтавкаНДСВознаграждения),
																									НовОтчет.УчитыватьНДС,
																									Ложь);
			//НовОтчет.СуммаВознаграждения = СуммаВознаграждения + ?(НовОтчет.СуммаВознагражденияВключаетНДС, 0, СуммаНДСВознаграждения); 
			НовОтчет.СуммаВознаграждения = СуммаВознаграждения + ?(НовОтчет.СуммаВознагражденияВключаетНДС, СуммаНДСВознаграждения, 0);
			//Евросиб СубботинВ #120291 24.09.2025 Конец
			
			//НовОтчет.СуммаНДСВознаграждения = НовОтчет.Товары.Итог("СуммаНДСВознаграждения");
			НовОтчет.УслугаПоВознаграждению = Справочники.Номенклатура.Вознаграждение;
			Если НовОтчет.СуммаВознаграждения > 0 
				И НЕ ЗначениеЗаполнено(НовОтчет.РезервНомераВознаграждение) Тогда
				РезервНомера = Документы.РезервированиеНомеровДокументов.СоздатьДокумент();
				РезервНомера.Дата = ДатаВыставленияДокументов;
				РезервНомера.Записать();
				НовОтчет.РезервНомераВознаграждение = РезервНомера.Ссылка;
				НовОтчет.НомерДляПечатиВознаграждение= СтрШаблон("%1/%2/%3",
															НовОтчет.РезервНомераВознаграждение.Номер,
															НовДок.Номер,
															?(НовОтчет.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
			ИначеЕсли НовОтчет.СуммаВознаграждения = 0 Тогда 
				НовОтчет.СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается;
			КонецЕсли; 
			НовОтчет.НомерДляПечати = СтрШаблон("%1/%2/%3",
												НовОтчет.Номер,
												НовДок.Номер,
												?(НовОтчет.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
			
			//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало (закомменитровал, перенес выше)
			//НовСтрокаПоставщик = НовОтчет.Поставщики.Добавить();
			//НовСтрокаПоставщик.Поставщик = ВыборкаОтч.Поставщик;
			//НовСтрокаПоставщик.КПППоставщика = ВыборкаОтч.ПоставщикКПП;
			//НовСтрокаПоставщик.Партия = ВыборкаОтч.Партия;
			//СчфПоставщика = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ВыборкаОтч.Партия,"СчетФактураПолученный");
			//НовСтрокаПоставщик.ПолученСФ = СчфПоставщика <> Неопределено;
			////РеквизитыСчфПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчфПоставщика, "ДатаВходящегоДокумента, НомерВходящегоДокумента");
			////НовСтрокаПоставщик.НомерСчетаФактуры = РеквизитыСчфПоставщика.НомерВходящегоДокумента;
			////НовСтрокаПоставщик.ДатаСФ = РеквизитыСчфПоставщика.ДатаВходящегоДокумента;
			////Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, начало
			//Если СчфПоставщика <> Неопределено Тогда
			//	РеквизитыСчфПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчфПоставщика, "ДатаВходящегоДокумента, НомерВходящегоДокумента");
			//	НовСтрокаПоставщик.НомерСчетаФактуры = РеквизитыСчфПоставщика.НомерВходящегоДокумента;
			//	НовСтрокаПоставщик.ДатаСФ = РеквизитыСчфПоставщика.ДатаВходящегоДокумента;
			//Иначе
			//	РеквизитыСчфПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОтч.Партия, "ДатаВходящегоДокумента, НомерВходящегоДокумента");
			//	НовСтрокаПоставщик.НомерСчетаФактуры = РеквизитыСчфПоставщика.НомерВходящегоДокумента;
			//	НовСтрокаПоставщик.ДатаСФ = РеквизитыСчфПоставщика.ДатаВходящегоДокумента;
			//КонецЕсли;
			////Евросиб(ДИТ), Беляев СЮ, US 86937 / TA 87311, 24-06-2024, конец
			//НовСтрокаПоставщик.КлючСтроки = 1;
			//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
			
			//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало	
			ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию(НовОтчет);
			//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец
			
			//НовОтчет.УстановитьНовыйНомер();
			
	        //Евросиб - АСуслов 26.11.2020 15:14:17 #
			//(
			
			//)
			//Евросиб - АСуслов 26.11.2020 15:14:18 #
			//НовОтчет.НомерДляПечати =НовОтчет.Номер +"/"+НовДок.НомерДляПечати;
			//НовОтчет.НомерДляПечатиВозмещаемые=НовОтчет.РезервНомераВозмещаемые.Номер + "/"+НовДок.НомерДляПечати;
			//пример из РТУ
			//НомерДляПечати = Номер+"/"+?(СчетАв.Номер<>"",СчетАв.Номер+"/","")+?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
			Попытка
				НовОтчет.ДополнительныеСвойства.Вставить("ПрограммноеИзменение");
				НовОтчет.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				// Евросиб Фролов (19.04.2022 
				ЗаписьЖурналаРегистрации("Создание отчета комитенту о продажах при создании комплекта документов",
							УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ОтчетКомитентуОПродажах, НовОтчет, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
				ТекстСообщения = СтрШаблон("Не удалось провести отчет комитенту о продажах. Ошибка: %1",
													КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, НовОтчет);
				// Евросиб Фролов)
			КонецПопытки;
			//счета-фактуры формируются при записи отчета комитенту
			Если ЕстьСчФ Тогда
				//СЧФ = Документы.СчетФактураВыданный.СоздатьДокумент();
				//БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовОтчет.Ссылка,СЧФ,ДокПартии);
				//СЧФ.Записать(РежимЗаписиДокумента.Проведение);
				//СтруктураСчетОтчет.Вставить("СчФ",СЧФ.Ссылка);
				ПарамОтбора = Новый Структура;
				ПарамОтбора.Вставить("Партия",ДокПартии);
				МассивСтрокПостав = НовОтчет.Поставщики.НайтиСтроки(ПарамОтбора);
				Для каждого Эл из МассивСтрокПостав ЦИкл
					СтруктураСчетОтчет.Вставить("СчФ",Эл.СчетФактура);
				КонецЦикла;
				СтруктураСчетОтчет.Вставить("СчфВозн", БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(НовОтчет.Ссылка,"СчетФактураВыданный"));
				//Попытка
				//	НовОтчет.Записать(РежимЗаписиДокумента.Проведение);
				//Исключение
				//КонецПопытки;
			КонецЕсли;
			
			СтруктураСчетОтчет.Вставить("Отчет",НовОтчет.Ссылка);
			СтруктураСчетОтчет.Вставить("Контрагент",Клиент);
			СтруктураСчетОтчет.Вставить("Договор",Договор);
			СтруктураСчетОтчет.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Клиент));
			
			МассивКомплектов.Добавить(СтруктураСчетОтчет);
		КонецЦикла;
	КонецЕсли;
#КонецОбласти

	//Создание только счетов
#Область СозданиеТолькоСчетов
	Если ЕстьСчет и Не ЕстьАкт и Не ЕстьОтчет Тогда
	    Если НЕ ЭтоВР Тогда
		СтруктураСчет = Новый Структура;
		АС = НайтиАвансовыйСчет(Сделка,Клиент,Договор,ВыставленныеКоносаменты.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"),ВыставленныеЖД.Выгрузить().ВыгрузитьКолонку("СчетПокупателю"));
		//Создание счет по прямым продажам
		НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		НовДок.Заполнить(Неопределено);
		НовДок.Дата = ТекущаяДата();
		НовДок.ДатаДокумента = ТекущаяДата();
		//Евросиб Каблов 09.04.2025 ( #105407
		//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
		НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
		//Евросиб Каблов 09.04.2025 )
		НовДок.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
		НовДок.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.Подразделения.ПустаяСсылка());
		НовДок.ЦФО = ?(ЗначениеЗаполнено(Сделка),Сделка.ЦФО,Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка());
		НовДок.Контрагент = Клиент;
		НовДок.АвансовыйСчет = Ложь;
		НовДок.ДоговорКонтрагента = Договор;
		НовДок.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
		Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.ДатаДокумента);
		НовДок.КурсВзаиморасчетов = Результат.Курс;
		// siv 06-03-20
		Если ПСЦ.Валюта <> Договор.ВалютаВзаиморасчетов Тогда
			Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
				НовДок.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
				ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
			ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
				НовДок.КурсВзаиморасчетов = КурсУказанРуками;
				ОпределенПроизвольныйКурс = КурсУказанРуками;
			Иначе
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, НовДок.ДатаДокумента);
				НовДок.КурсВзаиморасчетов = Результат.Курс;
			КонецЕсли;
		КонецЕсли;
			
		НовДок.КратностьВзаиморасчетов = Результат.Кратность;
		//НовДок.Сделка = Сделка;
//Евросиб Гудкова( 12.10.2020 Ticket№ 0209986
//было 		НовДок.БанковскийСчетОрганизации = НовДок.Организация.ОсновнойБанковскийСчет;
		//Если НовДок.ВалютаДокумента = мВалютаРеглУчета Тогда
		//    //Собакарь 28.10.20
		//	НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
		//	//НовДок.БанковскийСчетОрганизации = НовДок.Организация.ОсновнойБанковскийСчет;
		//Иначе
		//	НовДок.БанковскийСчетОрганизации = Справочники.БанковскиеСчета.НайтиПоРеквизиту("ВалютаДенежныхСредств", НовДок.ВалютаДокумента,,НовДок.Организация);
		//КонецЕсли;  
		//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало	
			НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор); 
		//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
		
// Евросиб Гудкова) 		
		НовДок.УчитыватьНДС = Истина;
		//Если Клиент.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВыставлятьСчетНаАнглийскомЯзыке") Тогда
			СчетНаАнгл = Истина;
		Иначе
			СчетНаАнгл = Неопределено;
		КонецЕсли;
		ПредыдущийСчет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
		КурсВалютыФрахт = Новый Структура("Курс, Валюта, ДатаКурса", НовДок.КурсВзаиморасчетов, НовДок.ВалютаДокумента, НовДок.ДатаКурса);
		
		Пока Выборка.Следующий() Цикл
			
			Если ПодставлятьСделкуИзВыборки Тогда
				Сделка = Выборка.Сделка;
			КонецЕсли; 
			// подбор нужной выборки по справочнику формирования фин доков
			//ЗапросКл.УстановитьПараметр("ВидПеревозки",Выборка.Калькуляция.ПС_ВидПеревозки);
			//НайденныйКлиент = ЗапросКл.Выполнить();
			
			НовДок.ПериодВО = Выборка.ПериодВО; //++
			Если не Выборка.Перевыставляемая  Тогда
				НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
				НовСтр = НовДок.Товары.Добавить();
				НовСтр.Номенклатура = Выборка.Услуга;
				НовСтр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
				НовСтр.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
				//Евросиб Каблов 09.12.2025 ( #111016
				НовСтр.Калькуляция = Выборка.Калькуляция;
				//Евросиб Каблов 09.12.2025 ) #111016
				
				НовСТр.Количество = Выборка.Количество;
				НовСТр.СтавкаНДС = Выборка.СтавкаНДС;
				ВалютаСтроки = Выборка.Валюта;
				Если ВалютаСтроки <> НовДок.ВалютаДокумента Тогда
					//СтавкаИтого = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.СтавкаИтого,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
					//Если Выборка.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") 
					//	И НовДок.КурсВзаиморасчетов = 1 Тогда
						//Евросиб - АСуслов 17.11.2020 12:27:42 #
						//(
						//если по фрахту есть авансовый счет, то будем брать дату курса из него
						РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦ, "ПересчетСуммыИСФнаДатуСчета, ФиксКурсВалюты");
						ДатаКурса = Неопределено;
						Если РеквизитыПСЦ.ПересчетСуммыИСФнаДатуСчета Тогда
							//Если АС <> Неопределено Тогда
							//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
							//	Если АСК.Количество() > 0 Тогда
							//		СтрокаСчетАванса = АСК.Найти(Выборка.Услуга, "Номенклатура");
							//		Если СтрокаСчетАванса <> Неопределено Тогда
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");	
							//		КонецЕсли; 
							//	КонецЕсли;
							//	Если ДатаКурса = Неопределено Тогда
							//		СчетАвансаПоКТК = НайтиАвансовыйСчетПоКТК(АС, Выборка.Услуга, Выборка.ГУИД);
							//		Если СчетАвансаПоКТК.Количество() = 1 И СчетАвансаПоКТК[0].СуммаОстаток >= НовСтр.Сумма Тогда
							//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СчетАвансаПоКТК[0].СчетПокупателю, Выборка.Услуга));
							//		КонецЕсли;
							//		//Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//		//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
							//		//	Если СтрокиАванс.Количество() = 0 Тогда
							//		//		//2й вариант на всю сумму счета
							//		//		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
							//		//		Если СтрокиАванс.Количество() = 0 Тогда
							//		//			//3й вариант
							//				Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
							//					СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
							//				КонецЕсли; 
							//		//		КонецЕсли; 
							//		//	КонецЕсли; 
							//		//КонецЕсли; 
							//		Если СтрокиАванс.Количество() > 0 Тогда
							//			СтрокаСчетАванса = СтрокиАванс[0]; 
							//			ДатаКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетАванса.СчетПокупателю, "ДатаДокумента");
							//		КонецЕсли; 
							//	КонецЕсли; 
							//КонецЕсли; 
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
							ДатаКурса = ПолучитьДатуКурсаИзАвансовогоСчета(АС, Выборка);
							//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
						КонецЕсли;
						Если ДатаКурса = Неопределено Тогда
							//ДатаКурса = ДатаВыставленияДокументов;
							ДатаКурса = НовДок.ДатаДокумента;
						КонецЕсли; 
						Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
							ДатаКурса = валюта_ДатаКурса;
						КонецЕсли;   
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
                        НовДок.ДатаКурса = ДатаКурса;      
						ЗаполнитьРеквизитыКурсаВалютВДокумент(НовДок);
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец						
						//)
						//Евросиб - АСуслов 17.11.2020 12:27:43 #
						КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);
						Если КурсВалютыФрахт.Курс = 1 Тогда
							//КурсВалютыФрахт.Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса).Курс;
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
						КонецЕсли; 
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, КурсВалютыФрахт.Курс, Истина);  
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
                        //Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента, ДатаКурса, КурсВалютыФрахт.Курс, Истина); 
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
						Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента, ДатаКурса, КурсВалютыФрахт.Курс, Истина, Выборка.ОкруглениеКурса);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
						НовСтр.ИсходнаяВалюта = Выборка.Валюта;
						НовСтр.ЦенаВВалюте = Выборка.Ставка; 
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
							
					//Иначе
					//	Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов, Истина);
					//КонецЕсли; 
					//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
					Если ОкруглятьСтавкуПриПересчетеКурса Тогда
						НовСтр.Цена = Ставка;
						НовСтр.Сумма = НовСтр.Цена * Выборка.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
						//Евросиб СубботинВ #125845 19.12.2025 Конец
					Иначе
						НовСтр.Сумма = Ставка * Выборка.Количество;
						НовСтр.Цена = НовСтр.Сумма / Выборка.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
						//Евросиб СубботинВ #125845 19.12.2025 Конец
					КонецЕсли; 
					Если Ставка = 0 Тогда
						Сообщить("При пересчете из валюты строки в валюту договора сумма по строке стала равна 0. Проверьте заполнение валюты взаиморасчетов в договоре и курсы валют.");
					КонецЕсли;
				Иначе
					СтавкаИтого = Выборка.СтавкаИтого;
					НовСтр.СуммаНДС = Выборка.СуммаНДС;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956  СтавкаИтого * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
					НовСтр.Сумма = СтавкаИтого;
					НовСтр.Цена = НовСтр.Сумма/НовСТр.Количество;
				КонецЕсли;
				//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,"Счет",СчетНаАнгл,,,КурсВалютыФрахт); 
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
				СодержаниеУслуги = РаботаСоСделкамиСервер.ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,"Счет",СчетНаАнгл,,,КурсВалютыФрахт, ИзОбработки, КТКВХранилище);  //Фролов 11.03.2022, таска 44976
				//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
				
				//Евросиб Шевченко А.В. 15.05.2025 US 95275 TA 106445
				//НовСТр.Содержание = СодержаниеУслуги;
				// Евросиб US 116744 TA 116885 Рыбьяков К.А. 12.08.2025 ((
				Если НовСтр.Номенклатура = Справочники.Номенклатура.СНПКонтейнеров И ТаблицаРасчетСНП <> Неопределено Тогда
				//Если НовСтр.Номенклатура = Справочники.Номенклатура.СНПКонтейнеров Тогда
				// Евросиб Рыбьяков К.А. 12.08.2025 ))
					
					НайденнаяСтрока = ТаблицаРасчетСНП.Найти(Выборка.ГУИД, "ГУИД");
					сРасчетСНП = Документы.РасчетСНП.ПустаяСсылка();
					Если НайденнаяСтрока <> Неопределено Тогда
						сРасчетСНП = НайденнаяСтрока.РасчетСНП;
					КонецЕсли;	
					
					НовСТр.Содержание = СодержаниеУслуги + РаботаСоСделкамиСервер.ПолучитьДополнениеУслугиСчета(НовДок, ПараметрыФФД, ВалютаСтроки <> НовДок.ВалютаДокумента, сРасчетСНП, ВалютаСтроки);
				КонецЕсли;
				//Евросиб Шевченко А.В. 15.05.2025 US 95275 TA 106445
				
				//ищем авансовую сумму по этой услуге
				//Если АС <> Неопределено Тогда
				//	АСК = НайтиАвансовыйСчетПоКоносаменту(АС, Выборка.Коносамент, Выборка.ГУИД);
				//	ПересчитатьОсновнуюТаблицуАвансов = Ложь;
				//	СтрокиАванс = Неопределено;
				//	Если АСК.Количество() > 0 Тогда
				//		СтрокиАванс = АСК.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
				//		ПересчитатьОсновнуюТаблицуАвансов = Истина;
				//	КонецЕсли; 
				//	Если СтрокиАванс = Неопределено ИЛИ СтрокиАванс.Количество() = 0 Тогда
				//		//1й вариант - сумма на всю сумму счета и ищем с предыдущим счетом
				//		СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток, СчетПокупателю", Выборка.Услуга, НовСтр.Сумма, ПредыдущийСчет));
				//		Если СтрокиАванс.Количество() = 0 Тогда
				//			//2й вариант на всю сумму счета
				//			СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура, СуммаОстаток", Выборка.Услуга, НовСтр.Сумма));
				//			Если СтрокиАванс.Количество() = 0 Тогда
				//				//3й вариант
				//				СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
				//			КонецЕсли; 
				//		КонецЕсли; 
				//	КонецЕсли; 
				//	Если СтрокиАванс.Количество() > 0 Тогда
				//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
				//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
				//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
				//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
				//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
				//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
				//			Если ПересчитатьОсновнуюТаблицуАвансов Тогда
				//				СтрокиАвансОсновная = АС.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", СтрокаАванс.СчетПокупателю, СтрокаАванс.Номенклатура));	
				//				СтрокиАвансОсновная[0].СуммаОстаток = СтрокаАванс.СуммаОстаток;
				//			КонецЕсли; 
				//			Если НовСтр.Сумма = 0 Тогда
				//				Прервать;
				//			КонецЕсли; 
				//		КонецЦикла;
				//	КонецЕсли; 
				//КонецЕсли; 
				
				//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
				УменьшитьСуммуНаВеличинуАвансовогоСчета(АС, Выборка, НовДок, НовСтр, ПредыдущийСчет, ВидыФормируемыхДокументов);
				//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
				
				НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
				Если НовСтр.Сумма = 0 Тогда
					НовДок.Товары.Удалить(НовСтр);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
//Евросиб Гудкова( 12.10.2020 Ticket№ найдите 1 отличие, и счета перестанут задваиваться
//		Если НовДок.СуммаДокумента < ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
		//Если НовДок.СуммаДокумента <= ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
		Если НовДок.СуммаДокумента = 0 Тогда
// Евросиб Гудкова) 		
			Если АС <> Неопределено Тогда
	            Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					НовДок = ПредыдущийСчет;
				Иначе
					НовДок = АС[0].СчетПокупателю;
					СтрокаНовДок = АС.Найти(0, "СуммаОстаток");
					Если СтрокаНовДок <> Неопределено Тогда
						НовДок = СтрокаНовДок.СчетПокупателю;
					Иначе
						НовДок = АС[0].СчетПокупателю;
					КонецЕсли; 
				КонецЕсли;
				Сообщить("Ранее был(и) создан(ы) документ(ы) на аванс на все сумму. Закрывающий счет создан не был.");
			Иначе
				НовДок = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
				Сообщить("Сумма документа равна 0. Закрывающий счет создан не был.");
			КонецЕсли;
		Иначе
			//Если АС <> Неопределено Тогда
			Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
//				Для каждого СтрАС Из АС Цикл
//				СтрАС = АС.Найти(СтрАС.СтрокаДоходовСделки,"СтрокаДоходовСделки");
//					Если СтрАС <> Неопределено Тогда
//						//СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
//						НовСтр.Сумма = НовСтр.Сумма - СтрАС.Сумма;
////Евросиб Гудкова( 12.10.2020 Ticket№ и молимся, что последняя строка счета не стала минусовой
//						НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
//						НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
//// Евросиб Гудкова) 						
//					КонецЕсли;
//				КонецЦикла; 
				НовДок.НомерДляПечати = "";
				//НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АС[0].СчетПокупателю, "НомерДляПечати")+"/1"); 
				НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущийСчет, "НомерДляПечати")+"/1"); 
			КонецЕсли;
			НовДок.ДополнительныеСвойства.Вставить("ПрограммноеИзменение", Истина);
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		СтруктураСчет = Новый Структура;
		СтруктураСчет.Вставить("Счет",НовДок.Ссылка);

		МассивКомплектов.Добавить(СтруктураСчет);
		КонецЕсли; 
		Если ЭтоВР Тогда
		//Перевыставляемые
		//АС = НайтиАвансовыйСчет(Сделка,Клиент,Договор);
		//АС = Неопределено;
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
		ДанныеПоАвансовымСчетам = НайтиАвансовыеСчетаПоВР(Сделка, Клиент, Договор);
		ТаблицаИнформированияПоСчетам = ПолучитьСтруктуру_ТаблицаИнформированияПоСчетам();
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		ДокПартии = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
		//ВыборкаОтч = ПолучитьВыборкуДляОтчета(Сделка, Клиент,Договор);
		ВыборкаОтч = Выборка;
		//По каждой партии свой счет и отчет
		Пока ВыборкаОтч.Следующий() Цикл
			//СтруктураСчетОтчет = Новый Структура;
			//Если не ТипЗнч(ВыборкаОтч.Партия) = Тип("Null") Тогда
			//	СчФПартии = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ВыборкаОтч.Партия,"СчетФактураПолученный");
			//Иначе
			//	СчФПартии = Неопределено;
			//КонецЕсли;	
			//Если не ЗначениеЗаполнено(ВыборкаОтч.Партия) Тогда
			//	//Сообщить("Для перевыставляемых услуг в табличной части Расходы не заполнен учетный документ (партия). Создание отчета комитенту невозможно.");
			//	СчФПартии = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
			//	//Продолжить;
			//ИначеЕсли СчФПартии = Неопределено Тогда
			//	Сообщить("Для перевыставляемых услуг в табличной части Расходы к учетному документу не введен входящий счет-фактура. Создание отчета комитенту невозможно.");
			//	Продолжить;
			//Иначе	
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало (затирать счета запрещено)
				//БЫЛО
				////++ДИТ Гаузер А.В. BUG 53640 TA 53641 14.07.2022
				////СчетОтчетПред = НайтиСчетОтчетПоСделкеПартии(Сделка, Клиент, Договор, ВыборкаОтч.Партия);	
				//МассивГУИД = ПолучитьГУИДСтрокДоходовСделки(ВыборкаОтч);
				//СчетОтчетПред = НайтиСчетОтчетПоГУИДСтроки(МассивГУИД);	
				////--ДИТ Гаузер А.В. BUG 53640 TA 53641 14.07.2022
				//Если ЗначениеЗаполнено(СчетОтчетПред.Счет) Тогда
				//	НовДок = СчетОтчетПред.Счет.ПолучитьОбъект();
				//	Если НовДок.ПометкаУдаления  Тогда
				//		НовДок.УстановитьПометкуУдаления(Ложь);//Гудкова 0209986 ПометкаУдаления = Ложь; 
				//	КонецЕсли;	
				//	НовДок.Товары.Очистить();
				//	НовДок.Состояния.Очистить();
				//Иначе	
				//	НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
				//	НовДок.Заполнить(Неопределено);
				//	НовДок.Дата = ТекущаяДата();
				//	НовДок.ДатаДокумента = ТекущаяДата();
				//	НовДок.ПериодВО = Выборка.ПериодВО; //КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
				//	НовДок.Партия = ВыборкаОтч.Партия;
				//КонецЕсли;
				//СТАЛО
				НовДок = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
				НовДок.Заполнить(Неопределено);
				НовДок.Дата = ТекущаяДата();
				НовДок.ДатаДокумента = ТекущаяДата();
				НовДок.ПериодВО = Выборка.ПериодВО; //КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
				НовДок.Партия = ВыборкаОтч.Партия;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
				НовДок.Организация = ?(ЗначениеЗаполнено(Сделка),Сделка.Организация,Договор.Организация);
				НовДок.ПодразделениеОрганизации = ?(ЗначениеЗаполнено(Сделка),Сделка.Подразделение,Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
				НовДок.Контрагент = Клиент;
				НовДок.АвансовыйСчет = Ложь;
				НовДок.ДоговорКонтрагента = Договор;
				НовДок.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
				Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.Дата);
				НовДок.КурсВзаиморасчетов = Результат.Курс;   
				//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
				ДатаКурса = НовДок.Дата;
				//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
				
				// siv 06-03-20
				Если ЗначениеЗаполнено(ПСЦ) И ЗначениеЗаполнено(ПСЦ.ФиксКурсВалюты) Тогда
					НовДок.КурсВзаиморасчетов = ПСЦ.ФиксКурсВалюты;
					ОпределенПроизвольныйКурс = ПСЦ.ФиксКурсВалюты;
				ИначеЕсли ЗначениеЗаполнено(КурсУказанРуками) Тогда
					НовДок.КурсВзаиморасчетов = КурсУказанРуками;
					ОпределенПроизвольныйКурс = КурсУказанРуками;  
				Иначе
					ДатаКурса = НовДок.Партия.ДатаВходящегоДокумента;
					Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
					НовДок.КурсВзаиморасчетов = Результат.Курс;
				КонецЕсли; 
				//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало  
				НовДок.ДатаКурса = ДатаКурса;   
				//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец  
				
				НовДок.КратностьВзаиморасчетов = Результат.Кратность;
				//НовДок.Сделка = Сделка;
				//Собакарь 28.10.20
				НовДок.БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(Договор);
				//НовДок.БанковскийСчетОрганизации = НовДок.Организация.ОсновнойБанковскийСчет;
				
				НовДок.УчитыватьНДС = Истина;
				НовДок.КомиссионныеУслуги = Истина;
				Выборка = ВыборкаОтч.Выбрать();
				СуммаВознагражденияИтог = 0;
				СуммаНДСВознагражденияИтог = 0;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				СтрокаНомераКТК = "";
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
				Пока Выборка.Следующий() Цикл
					
					// подбор нужной выборки по справочнику формирования фин доков
					//ЗапросКл.УстановитьПараметр("ВидПеревозки",Выборка.Калькуляция.ПС_ВидПеревозки);
					//НайденныйКлиент = ЗапросКл.Выполнить();
					
					//НовДок.СуммаВключаетНДС = ВыборкаОтч.НДСВключенВСтоимость;
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					НовСтр = НовДок.Товары.Добавить();
					НовСтр.Номенклатура = Выборка.Услуга;
					НовСтр.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
					//Евросиб Каблов 09.12.2025 ( #111016
					НовСтр.Калькуляция = Выборка.Калькуляция;
					//Евросиб Каблов 09.12.2025 ) #111016
					//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, начало
					НовСтр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
					//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, конец
					
					Если Клиент.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
						СчетНаАнгл = Истина;
					Иначе
						СчетНаАнгл = Неопределено;
					КонецЕсли;
					
					//СодержаниеУслуги = ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,"Счет",СчетНаАнгл);
					НовСТр.Содержание = Выборка.СодержаниеПТУ;
					НовСТр.Количество = 1;
					НовСТр.СтавкаНДС = Выборка.СтавкаНДС;
					ВалютаСтроки = Выборка.Валюта;
					СтавкаНДСВознаграждения = Выборка.СтавкаНДСВознаграждения;
					ВознаграждениеВключаетНДС = Выборка.ВознаграждениеВключаетНДС;   
					
					Если ВалютаСтроки <> НовДок.ВалютаДокумента Тогда   
											
						//СтавкаИтого = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.СтавкаИтого,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);
						//Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.Дата, НовДок.КурсВзаиморасчетов);    
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало 
						Если валюта_РежимРаботыСКурсомВалют = 1 Тогда
							ДатаКурса = валюта_ДатаКурса;
						КонецЕсли;   
                        НовДок.ДатаКурса = ДатаКурса;      
						ЗаполнитьРеквизитыКурсаВалютВДокумент(НовДок);
						КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);
						Если КурсВалютыФрахт.Курс = 1 Тогда
							КурсВалютыФрахт = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, ДатаКурса);
						КонецЕсли; 	
                        //Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.ДатаКурса, КурсВалютыФрахт.Курс);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
						Ставка = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Ставка,Выборка.Валюта,НовДок.ВалютаДокумента,НовДок.ДатаКурса, КурсВалютыФрахт.Курс, , Выборка.ОкруглениеКурса);
						//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
						НовСтр.ИсходнаяВалюта = Выборка.Валюта;
						НовСтр.ЦенаВВалюте = Выборка.Ставка; 
						//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец
						
						НовСтр.Цена = Ставка;
						НовСтр.Сумма = Ставка * НовСТр.Количество;
						//Евросиб СубботинВ #125845 19.12.2025 Начало 
						//НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/?(Выборка.НДСВключенВСтоимость, 120, 100);//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956100;
						НовСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтр.Сумма,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС),НовДок.УчитыватьНДС, Выборка.НДСВключенВСтоимость);
						//Евросиб СубботинВ #125845 19.12.2025 Конец
						Если Ставка = 0 Тогда
							Сообщить("При пересчете из валюты строки в валюту договора сумма по строке стала равна 0. Проверьте заполнение валюты взаиморасчетов в договоре и курсы валют.");
						КонецЕсли;
						//СуммаВознаграждения = Окр(РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Вознаграждение,Выборка.Валюта,НовДок.ВалютаДокумента,ДатаКурса, НовДок.КурсВзаиморасчетов, Истина),2);
						//СуммаВознаграждения = Окр(Ставка * Выборка.ПроцентВознаграждения / 100, 2);
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					Иначе
						//Делим на количество из доходов, т.к. в строках меняем количество на 1
						НовДок.СуммаВключаетНДС = Выборка.НДСВключенВСтоимость;
						Ставка = Выборка.Ставка;
						НовСтр.СуммаНДС = Выборка.СуммаНДС / Выборка.Количество;//Евросиб Гудкова( 12.10.2020 Ticket№ 0209956  СтавкаИтого * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
						НовСтр.Сумма = Выборка.Ставка;
						НовСтр.Цена = Ставка;
					КонецЕсли;
					
					//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
					УменьшитьСуммуНаВеличинуАвансовогоСчетаПоВР(НовДок, ДанныеПоАвансовымСчетам, Выборка, НовСтр, ТаблицаИнформированияПоСчетам, ПредыдущийСчет);
					//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
					
					//Если прописано вознаграждение в т.ч. НДС, то базу считать с НДС. 
					//Если НДС кроме того, то базу брать без НДС
					Если Выборка.ВознаграждениеВключаетНДС Тогда
						Если Выборка.НДСВключенВСтоимость Тогда
							БазаВознаграждения = НовСтр.Сумма;
						Иначе
							БазаВознаграждения = НовСтр.Сумма + НовСтр.СуммаНДС; 
						КонецЕсли; 
						//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2);
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					Иначе
						//++ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						//Если Выборка.НДСВключенВСтоимость Тогда
						//	БазаВознаграждения = НовСтр.Сумма - НовСтр.СуммаНДС;
						//Иначе
						//	БазаВознаграждения = НовСтр.Сумма; 
						//КонецЕсли;
						БазаВознаграждения = НовСтр.Сумма;
												
						//--ДИТ Кузнецов Е.Е. Ticket#0289939 27.10.2022
						
						//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2), БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
						//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2) - СуммаНДСВознаграждения;
					КонецЕсли; 
					//СуммаВознаграждения = Окр(БазаВознаграждения * Выборка.ПроцентВознаграждения / 100, 2);
					//СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					СуммаВознаграждения = БазаВознаграждения * Выборка.ПроцентВознаграждения / 100;
					СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВознаграждения, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДСВознаграждения), Истина, Выборка.ВознаграждениеВключаетНДС);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					
					СуммаВознагражденияИтог = СуммаВознагражденияИтог + СуммаВознаграждения;
					СуммаНДСВознагражденияИтог = СуммаНДСВознагражденияИтог + СуммаНДСВознаграждения;
					//ищем авансовую сумму по этой услуге
					//Если АС <> Неопределено Тогда
					//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//	Если СтрокиАванс.Количество() > 0 Тогда
					//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
					//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
					//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
					//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
					//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//			Если НовСтр.Сумма = 0 Тогда
					//				Прервать;
					//			КонецЕсли; 
					//		КонецЦикла;
					//	КонецЕсли; 
					//КонецЕсли; 
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					//УменьшитьСуммуНаВеличинуАвансовогоСчетаПоАналогичнойНоменклатуре(АС, НовДок, НовСтр); //Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, закомментировал
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					
					//Если АС <> Неопределено Тогда
					//	СтрАС = АС.Найти(Выборка.ГУИД,"СтрокаДоходовСделки");
					//	Если СтрАС <> Неопределено Тогда
					//	//	СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
					//		СтавкаИтого = СтавкаИтого - СтрАС.Сумма;
					//	КонецЕсли;
					//КонецЕсли;
					
					НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
					Если НовСтр.Сумма = 0 Тогда
						НовДок.Товары.Удалить(НовСтр);
					Иначе
						//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
						СтрокаНомераКТК = СтрокаНомераКТК + Выборка.НомераКТК + ",";
						//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
					КонецЕсли; 
				КонецЦикла;
				Если СуммаВознагражденияИтог > 0 Тогда
					НовСтр = НовДок.Товары.Добавить();
					НовСтр.Номенклатура = Справочники.Номенклатура.Вознаграждение;
					НовСтр.Количество = 1;
					НовСтр.Содержание = НовСтр.Номенклатура.НаименованиеПолное;
					НовСтр.СтавкаНДС  = СтавкаНДСВознаграждения;
					НовСтр.СуммаНДС	= СуммаНДСВознагражденияИтог;
					//тут придется вписать цену с учетом ндс
					//НовСтр.Цена = ?(ВознаграждениеВключаетНДС,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог,СуммаВознагражденияИтог);
					//здесь будем использовать настройку по документу, а не по строке, чтобы счет совпадал с отчетом
					//НовСтр.Сумма = ?(НовДок.СуммаВключаетНДС,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог,СуммаВознагражденияИтог);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
					НовСтр.Цена = ?(ВознаграждениеВключаетНДС,СуммаВознагражденияИтог,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог);
					НовСтр.Сумма = ?(НовДок.СуммаВключаетНДС,СуммаВознагражденияИтог,СуммаВознагражденияИтог + СуммаНДСВознагражденияИтог);
					//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
					
					//Если АС <> Неопределено Тогда
					//	СтрокиАванс = АС.НайтиСтроки(Новый Структура("Номенклатура", НовСтр.Номенклатура));
					//	Если СтрокиАванс.Количество() > 0 Тогда
					//		Для каждого СтрокаАванс Из СтрокиАванс Цикл
					//			ПредыдущийСчет = СтрокаАванс.СчетПокупателю;
					//			СуммаОстаток = СтрокаАванс.СуммаОстаток;
					//			СтрокаАванс.СуммаОстаток = ?(СтрокаАванс.СуммаОстаток - НовСтр.Сумма > 0, СтрокаАванс.СуммаОстаток - НовСтр.Сумма, 0);
					//			НовСтр.Сумма = ?(НовСтр.Сумма - СуммаОстаток > 0, НовСтр.Сумма - СуммаОстаток, 0) ;
					//			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//			Если НовСтр.Сумма = 0 Тогда
					//				Прервать;
					//			КонецЕсли; 
					//		КонецЦикла;
					//	КонецЕсли; 
					//КонецЕсли; 
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
					//УменьшитьСуммуНаВеличинуАвансовогоСчетаПоАналогичнойНоменклатуре(АС, НовДок, НовСтр); //Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, закомментировал
					//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
					НовСтр.СтрокаДоходовСделки = Выборка.ГУИД;
					Если НовСтр.Сумма = 0 Тогда
						НовДок.Товары.Удалить(НовСтр);
					КонецЕсли; 
				КонецЕсли; 
			//КонецЕсли;
			НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
			//Евросиб Гудкова( 12.10.2020 Ticket№ найдите 1 отличие, и счета перестанут задваиваться
			//		Если НовДок.СуммаДокумента < ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
			//Если НовДок.СуммаДокумента <= ?(АС = Неопределено, 0, АС.Итог("Сумма")) Тогда
			Если НовДок.СуммаДокумента = 0 Тогда
				//Если АС <> Неопределено Тогда
				//	Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
				//		НовДок = ПредыдущийСчет;
				//	Иначе
				//		НовДок = АС[0].СчетПокупателю;
				//		СтрокаНовДок = АС.Найти(0, "СуммаОстаток");
				//		Если СтрокаНовДок <> Неопределено Тогда
				//			НовДок = СтрокаНовДок.СчетПокупателю;
				//		Иначе
				//			НовДок = АС[0].СчетПокупателю;
				//		КонецЕсли; 
				//	КонецЕсли;
				//	Сообщить("Ранее был(и) создан(ы) документ(ы) на аванс на все сумму. Закрывающий счет создан не был.");
				//Иначе
				//	НовДок = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
				//	Сообщить("Сумма документа равна 0. Закрывающий счет создан не был.");
				//КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					НовДок = ПредыдущийСчет;
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
			Иначе
				//Если АС <> Неопределено Тогда
				Если ЗначениеЗаполнено(ПредыдущийСчет) Тогда
					//				Для каждого СтрАС Из АС Цикл
					//				СтрАС = АС.Найти(СтрАС.СтрокаДоходовСделки,"СтрокаДоходовСделки");
					//					Если СтрАС <> Неопределено Тогда
					//						//СтавкаПоСчету = ?(СтрАС.СуммаВключаетНДС,СтрАС.Сумма,СтрАС.Сумма+СтрАС.СуммаНДС);
					//						НовСтр.Сумма = НовСтр.Сумма - СтрАС.Сумма;
					////Евросиб Гудкова( 12.10.2020 Ticket№ и молимся, что последняя строка счета не стала минусовой
					//						НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
					//						НовДок.СуммаДокумента = ?(НовДок.СуммаВключаетНДС,НовДок.Товары.Итог("Сумма"),НовДок.Товары.Итог("Сумма")+НовДок.Товары.Итог("СуммаНДС"));
					//// Евросиб Гудкова) 						
					//					КонецЕсли;
					//				КонецЦикла; 
					НовДок.НомерДляПечати = "";
					//НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АС[0].СчетПокупателю, "НомерДляПечати")+"/1"); 
					НовДок.ДополнительныеСвойства.Вставить("НомерДокументаАванса", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущийСчет, "НомерДляПечати")+"/1"); 
				КонецЕсли;
				НовДок.ДополнительныеСвойства.Вставить("ПрограммноеИзменение", Истина);
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
				ДобавитьВТаблицуИнформированияПоСчетам(ТаблицаИнформированияПоСчетам, НовДок.Ссылка, СтрокаНомераКТК, Истина);
				//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
			КонецЕсли;
			//	НовДок.Записать(РежимЗаписиДокумента.Запись);
			СтруктураСчет = новый Структура;
			СтруктураСчет.Вставить("Счет",НовДок.Ссылка);

			МассивКомплектов.Добавить(СтруктураСчет);
			
			//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
			ВывестиСообщенияОСчетах(ТаблицаИнформированияПоСчетам);
			//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		КонецЦикла;		
	КонецЕсли;		
	КонецЕсли;		
#КонецОбласти	
	
	////////////////////////////////////			
	Если ПодставлятьСделкуИзВыборки Тогда
		Сделка = Документы.Сделка.ПустаяСсылка();
	КонецЕсли; 
	Возврат МассивКомплектов;

КонецФункции  

//ДИТ, Беляев СЮ, TA51476, 09-06-2022, начало
&НаСервере
Процедура ЗаполнитьРеквизитыКурсаВалютВДокумент(вхДокумент)
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(вхДокумент.ВалютаДокумента, вхДокумент.ДатаКурса);		
	вхДокумент.КратностьВзаиморасчетов = Результат.Кратность;
	вхДокумент.КурсВзаиморасчетов = Результат.Курс;
КонецПроцедуры  
//ДИТ, Беляев СЮ, TA51476, 09-06-2022, конец

&НаСервере
Функция НайтиАвансовыйСчетПоКоносаменту(Авансы, Коносамент, ГуидДоходов)
	//ДИТ, Беляев СЮ, Ticket#0267171,04-04-2022, начало
	Если НЕ ЗначениеЗаполнено(Коносамент) Тогда
		ТЗПустойРезультат = Новый ТаблицаЗначений;
		ТЗПустойРезультат.Колонки.Добавить("СчетПокупателю");
		ТЗПустойРезультат.Колонки.Добавить("Номенклатура");
		ТЗПустойРезультат.Колонки.Добавить("СуммаОстаток");
		ТЗПустойРезультат.Колонки.Добавить("Сумма"); 
		Возврат ТЗПустойРезультат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0267171,04-04-2022, конец

	ДоходыКТК = Сделка.ДоходыКТК.Найти(ГуидДоходов, "ГУИД");
	Если ДоходыКТК <> Неопределено Тогда
		//КТК = СтрЗаменить(ДоходыКТК.КТК,";","");		
		МассивНомеровКТК = СтрРазделить(ДоходыКТК.КТК, ";");
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Авансы.СчетПокупателю КАК Документ.СчетНаОплатуПокупателю) КАК СчетПокупателю,
	|	Авансы.Номенклатура КАК Номенклатура,
	|	Авансы.СуммаОстаток КАК СуммаОстаток,
	|	Авансы.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТ_Авансы
	|ИЗ
	|	&Авансы КАК Авансы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Авансы.СчетПокупателю КАК СчетПокупателю,
	|	ВТ_Авансы.Номенклатура КАК Номенклатура,
	|	ВТ_Авансы.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_Авансы.Сумма КАК Сумма
	|ИЗ
	|	ВТ_Авансы КАК ВТ_Авансы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетНаОплатуПокупателюУчетныеЕдиницы
	//|			ПО СчетНаОплатуПокупателюТовары.Ссылка = СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка
	//|				И СчетНаОплатуПокупателюТовары.Идентификатор = СчетНаОплатуПокупателюУчетныеЕдиницы.ИдентификаторСтрокиУслуг
	//|		ПО ВТ_Авансы.СчетПокупателю = СчетНаОплатуПокупателюТовары.Ссылка
	//|			И ВТ_Авансы.Номенклатура = СчетНаОплатуПокупателюТовары.Номенклатура
	|ГДЕ
	|	ВТ_Авансы.СчетПокупателю.УчетныеЕдиницы.УчетнаяЕдиница.Наименование В(&СписокНомеровКТК)
	|	И ВТ_Авансы.СчетПокупателю.ДокументыОснования.Коносамент = &Коносамент";
	Запрос.УстановитьПараметр("Авансы", Авансы);
	Запрос.УстановитьПараметр("Коносамент", Коносамент);
	Запрос.УстановитьПараметр("СписокНомеровКТК", МассивНомеровКТК);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция НайтиАвансовыйСчетПоКТК(Авансы, Номенклатура, ГуидДоходов)
	
	ДоходыКТК = Сделка.ДоходыКТК.Найти(ГуидДоходов, "ГУИД");
	Если ДоходыКТК <> Неопределено Тогда
		//КТК = СтрЗаменить(ДоходыКТК.КТК,";","");		
		МассивНомеровКТК = СтрРазделить(ДоходыКТК.КТК, ";");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Авансы.СчетПокупателю КАК Документ.СчетНаОплатуПокупателю) КАК СчетПокупателю,
	|	Авансы.Номенклатура КАК Номенклатура,
	|	Авансы.СуммаОстаток КАК СуммаОстаток,
	|	Авансы.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТ_Авансы
	|ИЗ
	|	&Авансы КАК Авансы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
	//Убирает счета, которые сформированы с заполненным ГУИД Дохода сделки и этот ГУИД не совпадает с текущим
	//Такая потребность возникла при формировании счетов из Сделки несколькими порциями с одинаковой Услугой и Списком КТК
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю
	|ПОМЕСТИТЬ ВТСчетаПоТекущейСтрокеДохода
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Авансы.СчетПокупателю
	|			ИЗ
	|				ВТ_Авансы КАК ВТ_Авансы)
	|	И СчетНаОплатуПокупателюТовары.Номенклатура = &Номенклатура
	|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки = &СтрокаДоходовСделки
	|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю
	|ПОМЕСТИТЬ ВТСчетаСДругимиСтрокамиДоходов
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Авансы.СчетПокупателю
	|			ИЗ
	|				ВТ_Авансы КАК ВТ_Авансы)
	|	И СчетНаОплатуПокупателюТовары.Номенклатура = &Номенклатура
	|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> &СтрокаДоходовСделки
	|	И СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки <> """"
	|	И НЕ СчетНаОплатуПокупателюТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСчетаПоТекущейСтрокеДохода.СчетНаОплатуПокупателю
	|				ИЗ
	|					ВТСчетаПоТекущейСтрокеДохода КАК ВТСчетаПоТекущейСтрокеДохода)
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Авансы.СчетПокупателю КАК СчетПокупателю,
	|	ВТ_Авансы.Номенклатура КАК Номенклатура,
	|	ВТ_Авансы.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_Авансы.Сумма КАК Сумма
	|ИЗ
	|	ВТ_Авансы КАК ВТ_Авансы
	|ГДЕ
	|	ВТ_Авансы.Номенклатура = &Номенклатура
	|	И ВТ_Авансы.СчетПокупателю.УчетныеЕдиницы.УчетнаяЕдиница.Наименование В(&СписокНомеровКТК)
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
	|	И НЕ ВТ_Авансы.СчетПокупателю В
	|				(ВЫБРАТЬ
	|					ВТСчетаСДругимиСтрокамиДоходов.СчетНаОплатуПокупателю
	|				ИЗ
	|					ВТСчетаСДругимиСтрокамиДоходов КАК ВТСчетаСДругимиСтрокамиДоходов)";
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
	Запрос.УстановитьПараметр("Авансы", Авансы);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СписокНомеровКТК", МассивНомеровКТК);
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, начало
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", ГуидДоходов);
	//ДИТ, Беляев СЮ, BUG 57290 / TA 58121 (Ticket#0266962), 28-03-2023, конец
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

&НаСервереБезКонтекста
Функция НайтиСчетОтчетПоСделкеПартии(Сделка, Клиент, Договор, Партия)
	СтруктураОтчетСчет = Новый Структура;
	Отчет = Неопределено;
	Счет = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка.Сделка = &Сделка
	|	И ОтчетКомитентуОПродажахПоставщики.Ссылка.Контрагент = &Контрагент
	|	И ОтчетКомитентуОПродажахПоставщики.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И ОтчетКомитентуОПродажахПоставщики.Партия = &Партия
	|	И НЕ ОтчетКомитентуОПродажахПоставщики.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Запрос.УстановитьПараметр("Контрагент",Клиент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("Партия", Партия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет = Выборка.Ссылка;
	КонецЕсли;
	//Если ЗначениеЗаполнено(Отчет) Тогда
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//	|ГДЕ
	//	|	СчетНаОплатуПокупателю.КомиссионныеУслуги = ИСТИНА
	//	|	И СчетНаОплатуПокупателю.Партия = &Партия";
	//	//Евросиб - АСуслов 04.10.2020 15:59:24 #
	//	//(
	//	//Запрос.УстановитьПараметр("ДокументОснование",Отчет);
	//	//Переделал на поиск по партиям
	//	Запрос.УстановитьПараметр("Партия", Партия);
	//	//)
	//	//Евросиб - АСуслов 04.10.2020 15:59:24 #
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Счет = Выборка.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	СтруктураОтчетСчет.Вставить("Отчет",Отчет);
	СтруктураОтчетСчет.Вставить("Счет",?(Отчет = Неопределено, Неопределено, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет,"СчетНаОплатуПокупателю")));
	
	Возврат СтруктураОтчетСчет;
КонецФункции

&НаСервереБезКонтекста
//Функция ПолучитьВыборкуДляОтчета(Сделка, Клиент, Договор, ПСЦ, ГУИД)
Функция ПолучитьВыборкуДляОтчета(Сделка, Клиент, Договор, ПСЦ, ГУИД, ИдентификаторГруппировки) //Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало (добавлен параметр <ИдентификаторГруппировки>)
	
	// SIV: заявку в таком виде добавил я. При нормальном режиме работы она не должна потребоваться, но мало ли... 17-12-2019
	
	Запрос = новый Запрос(
	
	// ДИТ Поморцева Т.П. Задача 0234807 18.06.21. начало
	
	//"ВЫБРАТЬ
	//|	СделкаДоходы.Услуга КАК Услуга,
	//|	СделкаДоходы.Количество КАК Количество,
	//|	СделкаДоходы.Ставка КАК Ставка,
	//|	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
	//|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
	//|	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	СделкаДоходы.СуммаНДС КАК СуммаНДС,
	//|	СделкаДоходы.СуммаИтого КАК СуммаИтого,
	//|	СделкаДоходы.ГУИД КАК ГУИД,
	//|	ВложенныйЗапрос.УчДокумент.Контрагент КАК Поставщик,
	//|	ВложенныйЗапрос.УчДокумент КАК Партия,
	//|	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	//|	СделкаДоходы.Валюта КАК Валюта,
	//|	ВложенныйЗапрос.Услуга КАК Услуга1,
	//|	СделкаДоходы.Валюта КАК Валюта1,
	//|	СделкаДоходы.Груз КАК Груз,
	//|	ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка) КАК Заявка,
	//|	СделкаДоходы.ПериодВО КАК ПериодВО,
	//|	СделкаДоходы.Калькуляция КАК Калькуляция,
	//|	СделкаДоходы.Вознаграждение КАК Вознаграждение,
	//|	СделкаДоходы.ВознаграждениеИтого КАК ВознаграждениеИтого,
	//|	СделкаДоходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	//|	СделкаДоходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	//|	ВложенныйЗапрос.УчДокумент.Контрагент.КПП КАК ПоставщикКПП,
	//|	ВложенныйЗапрос.СодержаниеПТУ КАК СодержаниеПТУ,
	//|	ВложенныйЗапрос.НоменклатураПТУ КАК НоменклатураПТУ,
	//|	ВложенныйЗапрос.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	//|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВложенныйЗапрос.Контейнер КАК Контейнер,
	//|	ВложенныйЗапрос.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//|	СделкаДоходы.ПроцентВознаграждения КАК ПроцентВознаграждения,
	//|	СделкаДоходы.Коносамент КАК Коносамент,
	//|	НЕОПРЕДЕЛЕНО КАК ОкруглениеКурса
	//|ИЗ
	//|	Документ.Сделка.Доходы КАК СделкаДоходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	//|			СделкаРасходы.Поставщик КАК Поставщик,
	//|			СделкаРасходы.УчДокумент КАК УчДокумент,
	//|			СделкаРасходы.Ссылка КАК Ссылка,
	//|			СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	//|			СделкаРасходы.Услуга КАК Услуга,
	//|			АкцептУслуги.Содержание КАК СодержаниеПТУ,
	//|			АкцептУслуги.Номенклатура КАК НоменклатураПТУ,
	//|			АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	//|			АкцептУслуги.Контейнер КАК Контейнер,
	//|			СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//|			АкцептУслуги.Ссылка КАК Ссылка1
	//|		ИЗ
	//|			Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	//|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	//|					ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиПоступления
	//|				ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	//|					И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	//|					И (АкцептУслуги.Ссылка.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.Пустаяссылка))
	//|					И (НЕ АкцептУслуги.Ссылка В
	//|							(ВЫБРАТЬ
	//|								Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	//|							ИЗ
	//|								Документ.Акцепт КАК Акцепт
	//|							ГДЕ
	//|								Акцепт.Проведен))
	//|		ГДЕ
	//|			СделкаРасходы.Ссылка = &Сделка
	//|		
	//|		УПОРЯДОЧИТЬ ПО
	//|			АкцептУслуги.Ссылка.Поступление.Дата УБЫВ) КАК ВложенныйЗапрос
	//|		ПО СделкаДоходы.Ссылка = ВложенныйЗапрос.Ссылка
	//|			И СделкаДоходы.ГУИД = ВложенныйЗапрос.Доходы
	//|ГДЕ
	//|	СделкаДоходы.Клиент = &Клиент
	//|	И СделкаДоходы.Договор = &Договор
	//|	И СделкаДоходы.Перевыставляемая = ИСТИНА
	//|	И СделкаДоходы.Ссылка = &Сделка
	//|	И СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	//|	И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	//|			ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
	//|	И ВЫБОР
	//|			КОГДА &ГУИД = """"
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ СделкаДоходы.ГУИД = &ГУИД
	//|		КОНЕЦ
	//|	И СделкаДоходы.ПСЦ = &ПСЦ
	//|ИТОГИ ПО
	//|	Партия");
	//
	
		
		"ВЫБРАТЬ
		|	АкцептУслуги.Номенклатура КАК НоменклатураПТУ,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Ссылка КАК Ссылка,
		|	АкцептУслуги.Содержание КАК СодержаниеПТУ,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.Ссылка.Дата КАК ДатаПорядок
		|ПОМЕСТИТЬ АкцептУслуги
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.Пустаяссылка)
		|	И НЕ АкцептУслуги.Ссылка В
		|				(ВЫБРАТЬ
		|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
		|				ИЗ
		|					Документ.Акцепт КАК Акцепт
		|				ГДЕ
		|					Акцепт.Проведен)
		|	И АкцептУслуги.Сделка = &Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходы.Поставщик КАК Поставщик,
		|	СделкаРасходы.УчДокумент КАК УчДокумент,
		|	СделкаРасходы.Ссылка КАК СсылкаВТ,
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	СделкаРасходы.ГУИД КАК ГУИД,
		|	СделкаРасходы.Услуга КАК Услуга
		|ПОМЕСТИТЬ СделкаРасходы
		|ИЗ
		|	Документ.Сделка.Расходы КАК СделкаРасходы
		|ГДЕ
		|	СделкаРасходы.Ссылка = &Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
		|	СделкаСвязьДоходовИРасходов.Ссылка КАК Ссылка,
		|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
		|ПОМЕСТИТЬ СделкаСвязьДиР
		|ИЗ
		|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|ГДЕ
		|	СделкаСвязьДоходовИРасходов.Ссылка = &Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходы.Поставщик КАК Поставщик,
		|	СделкаРасходы.УчДокумент КАК УчДокумент,
		|	СделкаРасходы.СсылкаВТ КАК СсылкаВТ,
		|	СделкаСвязьДиР.Доходы КАК Доходы,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	АкцептУслуги.СодержаниеПТУ КАК СодержаниеПТУ,
		|	АкцептУслуги.НоменклатураПТУ КАК НоменклатураПТУ,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	АкцептУслуги.Ссылка КАК Ссылка,
		|	АкцептУслуги.ДатаПорядок КАК ДатаПорядок
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	СделкаСвязьДиР КАК СделкаСвязьДиР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СделкаРасходы КАК СделкаРасходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ АкцептУслуги КАК АкцептУслуги
		|			ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
		|		ПО СделкаСвязьДиР.Расходы = СделкаРасходы.ГУИД
		|			И СделкаСвязьДиР.Ссылка = СделкаРасходы.СсылкаВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Евросиб Фролов (14.04.2022 Task №50236
		// |ВЫБРАТЬ ПЕРВЫЕ 1 
		|ВЫБРАТЬ 
		// Евросиб Фролов)	
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Количество КАК Количество,
		|	СделкаДоходы.Ставка КАК Ставка,
		|	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
		|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СделкаДоходы.СуммаНДС КАК СуммаНДС,
		|	СделкаДоходы.СуммаИтого КАК СуммаИтого,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	СделкаДоходы.Валюта КАК Валюта,
		|	СделкаДоходы.Валюта КАК Валюта1,
		|	СделкаДоходы.Груз КАК Груз,
		|	ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка) КАК Заявка,
		|	СделкаДоходы.ПериодВО КАК ПериодВО,
		|	СделкаДоходы.Калькуляция КАК Калькуляция,
		|	СделкаДоходы.Вознаграждение КАК Вознаграждение,
		|	СделкаДоходы.ВознаграждениеИтого КАК ВознаграждениеИтого,
		|	СделкаДоходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
		|	СделкаДоходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
		|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СделкаДоходы.ПроцентВознаграждения КАК ПроцентВознаграждения,
		|	СделкаДоходы.Коносамент КАК Коносамент,
		//Евросиб Каблов 07.11.2022 ( 54532
		|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022 )
		|	НЕОПРЕДЕЛЕНО КАК ОкруглениеКурса,
		|	ВТ.УчДокумент КАК Партия,
		|	ВТ.Услуга КАК Услуга1,
		|	ВТ.НоменклатураПТУ КАК НоменклатураПТУ,
		|	ВТ.СодержаниеПТУ КАК СодержаниеПТУ,
		|	ВТ.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТ.Контейнер КАК Контейнер,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВТ.УчДокумент.Контрагент КАК Поставщик,
		|	ВТ.УчДокумент.Контрагент.КПП КАК ПоставщикКПП,
		|	ВТ.Ссылка КАК Ссылка1
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
		|	,ЕстьNULL(ДоходыКТК.КТК, """") КАК НомераКТК
		|	,ЕстьNULL(ДоходыВагоны.Вагон, """") КАК НомераВагонов
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО СделкаДоходы.Ссылка = ВТ.СсылкаВТ
		|			И СделкаДоходы.ГУИД = ВТ.Доходы
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК ДоходыКТК
		|		ПО СделкаДоходы.Ссылка = ДоходыКТК.Ссылка И СделкаДоходы.ГУИД = ДоходыКТК.ГУИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК ДоходыВагоны
		|		ПО СделкаДоходы.Ссылка = ДоходыВагоны.Ссылка И СделкаДоходы.ГУИД = ДоходыВагоны.ГУИД
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, начало
		|   ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы2
		|  		ПО СделкаДоходы.ГУИДИсправляемойСтроки = СделкаДоходы2.ГУИД
		|  			И СделкаДоходы2.КорректировкаДокумента.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		//Евросиб(ДИТ), Беляев СЮ,Ticket#0374198, 02-11-2024, конец
		|ГДЕ
		|	СделкаДоходы.Клиент = &Клиент
		|	И СделкаДоходы.Договор = &Договор
		|	И СделкаДоходы.Перевыставляемая = ИСТИНА
		|	И СделкаДоходы.Ссылка = &Сделка
		|	И СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
		////ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, начало
		//|	И СделкаДоходы.ГУИДИсправляемойСтроки = """"
		////ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, начало
		|	И (СделкаДоходы.ГУИДИсправляемойСтроки = """" ИЛИ НЕ СделкаДоходы2.ГУИД ЕСТЬ NULL)
		|	И СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, конец
		|	И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|			ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|	И ВЫБОР
		|			КОГДА &ГУИД = """"
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СделкаДоходы.ГУИД = &ГУИД
		|		КОНЕЦ
		|	И СделкаДоходы.ПСЦ = &ПСЦ
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		|	И СделкаДоходы.ИдентификаторГруппировки = &ИдентификаторГруппировки
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.ДатаПорядок УБЫВ
		|ИТОГИ ПО
		|	Партия");	
	// ДИТ Поморцева Т.П. Задача 0234807 18.06.21. конец
	
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("ПСЦ",ПСЦ);
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
	Запрос.УстановитьПараметр("ИдентификаторГруппировки", ИдентификаторГруппировки);
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
	Возврат Выборка;
КонецФункции

&НаСервере
Функция ВыборкаДанныхПоКлиентуДоговору(Клиент,
									   Договор,
									   Сделка,
									   СтавкаНДС,
									   ГУИД,
									   ПоДопУслугам=Неопределено,
									   Акт=Неопределено,
									   ПСЦ = Неопределено,
									   Коносамент = Неопределено,
									   ГруппировкаДаты = Неопределено,
									   ЭтоФрахт = Ложь,
									   //Евросиб Каблов 12.09.2023 ( #68187
									   ЭтоСНП,
									   //Евросиб Каблов 12.09.2023 )
									   //ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
									   ПараметрыФФД = Неопределено,
									   //ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
									   //Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
									   ИдентификаторГруппировки,
									   //Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
									   // Евросиб US 82073 TA 115104 Рыбьяков К.А. 09.09.2025 ((
									   ИзРелиза = Ложь)
									   // Евросиб Рыбьяков К.А. 09.09.2025 ))
	Если ГруппировкаДаты = Неопределено Тогда
		ГруппировкаДаты = Дата(1,1,1);
	КонецЕсли; 	
	Если Не ЗначениеЗаполнено(Коносамент) Тогда
		знКоносамент = Неопределено;
	Иначе
		знКоносамент = Коносамент;
	КонецЕсли; 
	// проверить клиента на принадлежность к особой группе
	//НайденныйКлиент = Справочники.ФормированиеФинДокументов.НайтиПоРеквизиту("Контрагент",Клиент);
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++ тут непонятно, смысл проверить наличие любых правил (оставлено так) для дальнейшей логики или определенных заранее параметров
	ИмеютсяУКлиентаПравилаФормированияФинДокументов = ?(Справочники.ФормированиеФинДокументов.НайтиПоРеквизиту("Контрагент",Клиент) = Справочники.ФормированиеФинДокументов.ПустаяСсылка(),
														Ложь, Истина);
    ПараметрыФФД_ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ПустаяСсылка();
	ПараметрыФФД_ДанныеИзРеестраПовагонки = Ложь;
	ПараметрыФФД_СобратьГруппировкиВОдинСчет = Ложь; 
	ПараметрыФФД_ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПустаяСсылка();
	//Евросиб - АСуслов 31.01.2023 17:57:11 #64514
	//(
	ПараметрыФФД_РазделятьДокументыНаКаждыйКонтейнерОтдельно = Ложь;
	//)
	//Евросиб - АСуслов 31.01.2023 17:57:13 #64514
	// Евросиб Фролов (08.02.2022 Ticket№ 0259986
	// В алгоритме округления идет проверка что "ПараметрыФФД_ОкруглениеКурса = Неопределено".
	// И если не равно неопределено, то выполняется округление до указанного числа знаков, т.е. до нуля.
	//ПараметрыФФД_ОкруглениеКурса = 0; закомментировал
	ПараметрыФФД_ОкруглениеКурса = Неопределено;
	//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
	ПараметрыФФД_ГруппироватьСтрокиПоРазличнымПСЦ = Ложь;
	//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
	// Евросиб Фролов)
	Если ПараметрыФФД <> Неопределено Тогда
		ПараметрыФФД_ДанныеИзРеестраПовагонки = ПараметрыФФД.ДанныеИзРеестраПовагонки;
		ПараметрыФФД_ВидСтавки = ПараметрыФФД.ВидСтавки; 
		ПараметрыФФД_СобратьГруппировкиВОдинСчет = ПараметрыФФД.СобратьГруппировкиВОдинСчет;
		ПараметрыФФД_ВидГруппировкиФрахта = ПараметрыФФД.ВидГруппировкиФрахта; 
		ПараметрыФФД_ОкруглениеКурса = ПараметрыФФД.ОкруглениеКурса;
		//Евросиб - АСуслов 31.01.2023 17:57:21 #64514
		//(
		ПараметрыФФД_РазделятьДокументыНаКаждыйКонтейнерОтдельно = ПараметрыФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно;
		//)
		//Евросиб - АСуслов 31.01.2023 17:57:23 #64514
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		ПараметрыФФД_ГруппироватьСтрокиПоРазличнымПСЦ = ПараметрыФФД.ГруппироватьСтрокиПоРазличнымПСЦ;
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
	КонецЕсли;                                                        
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
	
	// если не нашли, то сделать обычную выборку, для повагонки аналогично
	//Если НайденныйКлиент = Справочники.ФормированиеФинДокументов.ПустаяСсылка() ИЛИ Повагонка Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
	Если НЕ ИмеютсяУКлиентаПравилаФормированияФинДокументов ИЛИ Повагонка Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СделкаДоходы.Клиент КАК Клиент,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Количество КАК Количество,
		|	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
		|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаДоходы.СуммаНДС КАК СуммаНДС,
		|	СделкаДоходы.СуммаИтого КАК СуммаИтого,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	СделкаДоходы.Калькуляция КАК Калькуляция,
		|	СделкаДоходы.Ставка КАК Ставка,
		|	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СделкаДоходы.ТипВагонов КАК ТипВагонов,
		|	СделкаДоходы.ТипКТК КАК ТипКТК,
		|	СделкаДоходы.Груз КАК Груз,
		|	СделкаДоходы.РазмерКТК КАК РазмерКТК,
		|	СделкаДоходы.ПериодВО КАК ПериодВО,
		|	СделкаДоходы.Валюта КАК Валюта,                  
		//Евросиб - АСуслов 11.03.2022 9:41:34 #45629
		//(
		|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		//)
		//Евросиб - АСуслов 11.03.2022 9:41:36 #45629
		|	СделкаДоходы.Коносамент КАК Коносамент,
		// Евросиб Фролов (15.03.2022 Task №40571
		//|	СделкаДоходы.Калькуляция.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		// Евросиб Фролов)
		//Евросиб Каблов 07.11.2022 ( 54532
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022 )
		//Евросиб Каблов 13.11.2023 ( #68187
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//Евросиб Каблов 13.11.2023 )
		|	СделкаДоходы.Комментарий КАК Комментарий,
		|	СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонкиУчДок,
		|	СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонкиУчДок,
		|	СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
		|	СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки,
		|	СделкаДоходы.ДокументФФД КАК ДокументФФД,
		|   НЕОПРЕДЕЛЕНО КАК ОкруглениеКурса
		//|	ВложенныйЗапрос.ВидСтавки КАК ВидСтавки
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
		|		ПО СделкаДоходы.Ссылка = СделкаДоходыКТК.Ссылка
		|			И СделкаДоходы.ГУИД = СделкаДоходыКТК.ГУИД
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, начало
		|   ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы2
		|  		ПО СделкаДоходы.ГУИДИсправляемойСтроки = СделкаДоходы2.ГУИД
		|  			И СделкаДоходы2.КорректировкаДокумента.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, конец
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
		//|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
		//|			МАКСИМУМ(ФормированиеФинДокументов.ВидСтавки) КАК ВидСтавки
		//|		ИЗ
		//|			Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ФормированиеФинДокументов.Контрагент,
		//|			ФормированиеФинДокументов.ВидПеревозки) КАК ВложенныйЗапрос
		//|		ПО СделкаДоходы.Калькуляция.ПС_ВидПеревозки = ВложенныйЗапрос.ВидПеревозки
		//|			И СделкаДоходы.Клиент = ВложенныйЗапрос.Контрагент
		|ГДЕ
		|	СделкаДоходы.Ссылка В(&Сделка)
		|	И СделкаДоходы.Клиент = &Клиент
		|	И СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
		|	И СделкаДоходы.Договор = &Договор
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, начало
		//|	И СделкаДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, начало
		|	И (СделкаДоходы.ГУИДИсправляемойСтроки = """" ИЛИ НЕ СделкаДоходы2.ГУИД ЕСТЬ NULL)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, конец
		|   И ВЫБОР КОГДА &СтавкаНДС = Неопределено ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.СтавкаНДС = &СтавкаНДС КОНЕЦ
		|	И ВЫБОР
		|			КОГДА СделкаДоходы.УслугаВнеСтавки
		|				ТОГДА СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ЭтоФрахт = ИСТИНА
		|				ТОГДА СделкаДоходы.Услуга = &УслугаФрахт
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПоДопУслугам <> НЕОПРЕДЕЛЕНО
		|				ТОГДА СделкаДоходы.УслугаВнеСтавки = &ПоДопУслугам
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО              
		|			ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|	И НЕ СделкаДоходы.Подсыл
		|	И ВЫБОР
		|			КОГДА &ПСЦ = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СделкаДоходы.ПСЦ = &ПСЦ
		|		КОНЕЦ 
		//Евросиб - АСуслов 22.04.2022 12:30:26 #45021
		//(
		|	И ВЫБОР
		|			КОГДА &ГруппировкаДаты = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		//|			ИНАЧЕ СделкаДоходы.ПериодВО = &ГруппировкаДаты
		//|		И НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ)  
		//ДИТ, Беляев СЮ, Ticket#0272832, 23-05-2022, начало
		//Евросиб Каблов 12.09.2023 ( #68187
		//|       ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ)
		|   	ИНАЧЕ ВЫБОР
		|				КОГДА &ЭтоСНП = ИСТИНА
		|					ТОГДА СделкаДоходы.ПериодВО = &ГруппировкаДаты
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ)
		|				КОНЕЦ
		//Евросиб Каблов 12.09.2023 )
		//ДИТ, Беляев СЮ, Ticket#0272832, 23-05-2022, конец
		|		КОНЕЦ
		//)
		//Евросиб - АСуслов 22.04.2022 12:30:29 #45021
		
		//Евросиб Каблов 12.09.2023 ( #68187
		|	И ВЫБОР
		|			КОГДА &ЭтоСНП = ИСТИНА
		|				ТОГДА СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|			ИНАЧЕ СделкаДоходы.ИсточникПоявленияСтрокиЭкономики <> &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|		КОНЕЦ
		//Евросиб Каблов 12.09.2023 ( #68187
		|	И ВЫБОР 
		//|			КОГДА &ОтборГУИД = 1 ИЛИ ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		|			КОГДА &ОтборГУИД = 1 ИЛИ &ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)    
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		|				ТОГДА СделкаДоходы.ГУИД = &ГУИД
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		// если гуид пустой, но есть параметр ставки фрахта отдельно суша,
		//то пустой гуид признак того, что тэу надо сгруппировать,
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		|	И СделкаДоходы.ИдентификаторГруппировки = &ИдентификаторГруппировки");
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		
		Запрос.УстановитьПараметр("Сделка",Сделка);
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Запрос.УстановитьПараметр("Договор",Договор);
		Запрос.УстановитьПараметр("ПоДопУслугам", ПоДопУслугам);
		//Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		Запрос.УстановитьПараметр("ПСЦ", ?(ПараметрыФФД_ГруппироватьСтрокиПоРазличнымПСЦ, Неопределено, ПСЦ));
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		Запрос.УстановитьПараметр("Коносамент", знКоносамент);
		Запрос.УстановитьПараметр("ГруппировкаДаты", ГруппировкаДаты);
		Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
		Запрос.УстановитьПараметр("ЭтоФрахт", ЭтоФрахт);
		Запрос.УстановитьПараметр("УслугаФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
		Запрос.УстановитьПараметр("ВидСтавки", ПараметрыФФД_ВидСтавки);
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		Если ЗначениеЗаполнено(ГУИД) Тогда
			Запрос.УстановитьПараметр("ГУИД",ГУИД);
			Запрос.УстановитьПараметр("ОтборГУИД",1);
		Иначе
			Запрос.УстановитьПараметр("ГУИД",ГУИД);
			Запрос.УстановитьПараметр("ОтборГУИД",0);
		КонецЕсли;
		//Евросиб Каблов 12.09.2023 ( #68187
		Запрос.УстановитьПараметр("ЭтоСНП", ЭтоСНП);
		Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы", Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы);
		//Евросиб Каблов 12.09.2023 )
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		Запрос.УстановитьПараметр("ИдентификаторГруппировки", ИдентификаторГруппировки);
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		
		РезультатЗапроса = Запрос.Выполнить();
	
	//ИначеЕсли НЕ НайденныйКлиент = Справочники.ФормированиеФинДокументов.ПустаяСсылка() И НЕ НайденныйКлиент.ДанныеИзРеестраПовагонки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
	ИначеЕсли НЕ ПараметрыФФД_ДанныеИзРеестраПовагонки Тогда 
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --     
	
		// выборка "особых" контрагентов (у которых фин доки формируются по-особому)
		//ЗапросК = Новый Запрос;
		//ЗапросК.Текст = 
		//"ВЫБРАТЬ
		//|	ФормированиеФинДокументов.ОбязательноеЗаполнениеРеестра КАК КонтрагентСРеестром
		//|ИЗ
		//|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		//|ГДЕ
		//|	НЕ ФормированиеФинДокументов.ПометкаУдаления
		//|	И ФормированиеФинДокументов.Контрагент = &Контрагент";
		//ЗапросК.УстановитьПараметр("Контрагент",Клиент); 
		//ОтветКонтраг = ЗапросК.Выполнить().Выбрать();
		//Если ОтветКонтраг.Следующий() Тогда
		//	КонтрагентСРеестром = ОтветКонтраг.КонтрагентСРеестром;
		//Иначе 
		//	КонтрагентСРеестром = Неопределено;
		//КонецЕсли;
		
		Если Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			ОтборПоКТК = " И ЗаявкаСоставУслуги.НомерКТК В(&НомерКТК)";
			ДанныеИзОбработки = ПолучитьИзВременногоХранилища(КТКВХранилище);
		Иначе
			ОтборПоКТК = "";
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СделкаДоходы.Клиент КАК Клиент,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаДоходы.СуммаНДС КАК СуммаНДС,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	СделкаДоходы.Калькуляция КАК Калькуляция,
		|	СделкаДоходы.Ставка КАК Ставка,
		|	СделкаДоходы.ТипВагонов КАК ТипВагонов,
		|	СделкаДоходы.ТипКТК КАК ТипКТК,
		|	СделкаДоходы.Груз КАК Груз,
		|	СделкаДоходы.РазмерКТК КАК РазмерКТК,
		|	СделкаДоходы.ПериодВО КАК ПериодВО,
		|	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СделкаДоходы.Валюта КАК Валюта,
		|	СделкаДоходы.Ссылка КАК Сделка,
		|	СделкаДоходы.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		|	СделкаДоходы.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
		|	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
		|	СделкаДоходыКТК.КТК КАК КТК,
		//|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
		|	СделкаДоходы.Ссылка.ТипЗаказа КАК ТипЗаказа,
		|	СделкаДоходы.Количество КАК Количество,
		|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		|	СделкаДоходы.СуммаИтого КАК СуммаИтого,
		|	СделкаДоходы.РеестрКлиента КАК РеестрКлиента,
		|   СделкаДоходы.Коносамент КАК Коносамент,
		|   СделкаДоходы.ДокументФФД КАК ДокументФФД,
		|   &ОкруглениеКурса КАК ОкруглениеКурса,
		//Евросиб Каблов 07.11.2022 ( 54532
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022 )
		//Евросиб Каблов 13.11.2023 ( #68187
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//Евросиб Каблов 13.11.2023 )
		// Евросиб Фролов (15.03.2022 Task №40571		
		|   СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов)
		//|   ЕСТЬNULL(ВложенныйЗапрос.ОкруглениеКурса, Неопределено) КАК ОкруглениеКурса 
		|ПОМЕСТИТЬ СделкаДоходыЪ
		|ИЗ
		|Документ.Сделка.Доходы КАК СделкаДоходы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
		|	ПО СделкаДоходы.Ссылка = СделкаДоходыКТК.Ссылка
		|		И СделкаДоходы.ГУИД = СделкаДоходыКТК.ГУИД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
		|			И СделкаСвязьДоходовИРасходов.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
		|	ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
		|		И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы 
		//Евросиб - АСуслов 26.02.2024 15:45:40 #81376
		//(
		|   ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы2
		|  		ПО СделкаДоходы.ГУИДИсправляемойСтроки = СделкаДоходы2.ГУИД
		|  			И СделкаДоходы2.КорректировкаДокумента.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		//)
		//Евросиб - АСуслов 26.02.2024 15:45:43 #81376
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
		//|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
		//|			МАКСИМУМ(ФормированиеФинДокументов.ВидГруппировкиФрахта) КАК ВидГруппировкиФрахта,
		//|			МАКСИМУМ(ФормированиеФинДокументов.ВидСтавки) КАК ВидСтавки,
		//|			МАКСИМУМ(ФормированиеФинДокументов.СобратьГруппировкиВОдинСчет) КАК СобратьГруппировкиВОдинСчет,
		//|           МАКСИМУМ(ВЫБОР КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры ТОГДА ФормированиеФинДокументов.ОкруглениеКурса ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК ОкруглениеКурса 
		//|		ИЗ
		//|			Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ФормированиеФинДокументов.Контрагент,
		//|			ФормированиеФинДокументов.ВидПеревозки) КАК ВложенныйЗапрос
		//|		ПО СделкаДоходы.Калькуляция.ПС_ВидПеревозки = ВложенныйЗапрос.ВидПеревозки
		//|			И СделкаДоходы.Клиент = ВложенныйЗапрос.Контрагент
		|ГДЕ
		|	СделкаДоходы.Клиент = &Клиент
		|   И СделкаДоходы.НеВыставлятьКлиенту = Ложь 
		|	И СделкаДоходы.Договор = &Договор
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, начало
		//Евросиб - АСуслов 26.02.2024 16:09:36 #81376
		//(
		|	И (СделкаДоходы.ГУИДИсправляемойСтроки = """" ИЛИ НЕ СделкаДоходы2.ГУИД ЕСТЬ NULL)
		//)
		//Евросиб - АСуслов 26.02.2024 16:09:54 #81376
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, конец
		|   И ВЫБОР КОГДА &СтавкаНДС = Неопределено ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.СтавкаНДС = &СтавкаНДС КОНЕЦ
		|	И СделкаДоходы.Ссылка В(&Ссылка)
		|   И (ВЫБОР КОГДА СделкаДоходы.УслугаВнеСтавки ТОГДА СделкаДоходы.НЕВыставлятьКлиенту = ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ)
		|	И ВЫБОР КОГДА &ПоДопУслугам <> НЕОПРЕДЕЛЕНО ТОГДА СделкаДоходы.УслугаВнеСтавки = &ПоДопУслугам ИНАЧЕ ИСТИНА КОНЕЦ
		//|   И (ВЫБОР КОГДА СделкаДоходы.УслугаВнеСтавки ТОГДА (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL ИЛИ СделкаДоходы.УчДокумент = &Акт) ИНАЧЕ ИСТИНА КОНЕЦ) 
		|   И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL ИЛИ СделкаДоходы.УчДокумент = &Акт) 
		|   И ВЫБОР КОГДА &ПСЦ = Неопределено или &ПСЦ = значение(документ.псц.пустаяссылка) ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.ПСЦ = &ПСЦ КОНЕЦ 
		//Евросиб - АСуслов 22.04.2022 12:30:43 #45021
		//(
		//Евросиб Каблов 07.01.2025 ( #89731
		////Евросиб Каблов 12.09.2023 ( #68187
		////|   И ВЫБОР КОГДА &ГруппировкаДаты = ДатаВремя(1,1,1) ТОГДА ИСТИНА ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ) КОНЕЦ
		//|   И ВЫБОР КОГДА &ГруппировкаДаты = ДатаВремя(1,1,1)
		//|		ТОГДА ИСТИНА
		//|   	ИНАЧЕ ВЫБОР
		//|				КОГДА &ЭтоСНП = ИСТИНА
		//|					ТОГДА СделкаДоходы.ПериодВО = &ГруппировкаДаты
		//|					ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ)
		//|				КОНЕЦ
		//|		КОНЕЦ
		////Евросиб Каблов 12.09.2023 )
		|   И ВЫБОР КОГДА &ГруппировкаДаты = ДатаВремя(1,1,1) ТОГДА ИСТИНА ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ) КОНЕЦ
		//Евросиб Каблов 07.01.2025 )
		//|  	И НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = &ГруппировкаДаты
		//)
		//Евросиб - АСуслов 22.04.2022 12:30:44 #45021
		|	И ВЫБОР КОГДА &ЭтоФрахт = ИСТИНА ТОГДА СделкаДоходы.Услуга = &УслугаФрахт ИНАЧЕ ИСТИНА КОНЕЦ
		|	И НЕ СделкаДоходы.Подсыл
		|   И ВЫБОР КОГДА &Коносамент = Неопределено или &Коносамент = значение(документ.транспортныйдокумент.пустаяссылка) ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.Коносамент = &Коносамент КОНЕЦ
		//Евросиб - АСуслов 06.12.2021 10:49:35 #
		//(
		//если параметр этофрахт = ложь то в любом случае по отдельным ставкам исключаем услугу фрахта из выборки
		//2. но при этом, если группируем в один счет, то это условие не должно срабатывать
		//|   И ВЫБОР КОГДА ВложенныйЗапрос.ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки) И НЕ ВложенныйЗапрос.СобратьГруппировкиВОдинСчет И &ЭтоФрахт = Ложь ТОГДА СделкаДоходы.Услуга <> &УслугаФрахт ИНАЧЕ ИСТИНА КОНЕЦ
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		|   И ВЫБОР КОГДА &ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки) И НЕ &СобратьГруппировкиВОдинСчет И &ЭтоФрахт = Ложь ТОГДА СделкаДоходы.Услуга <> &УслугаФрахт ИНАЧЕ ИСТИНА КОНЕЦ
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		//)
		//Евросиб - АСуслов 06.12.2021 10:49:36 #
		|   И ВЫБОР 
				// это условия для всех строк, которые отбираются по заполненному гуид
		|   	  КОГДА &ГУИД <> """" ТОГДА СделкаДоходы.ГУИД = &ГУИД 
				//это условие для ТЭУ, который нужно объединить по всей перевозке
				//услуга ТЭУ, пустой ГУИД
		//|         КОГДА ВложенныйЗапрос.ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		|         КОГДА &ВидСтавки = Значение(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		//|             И &ГУИД = """" И СделкаДоходы.Услуга = &УслугаТЭУ ТОГДА ИСТИНА
		|             И &ГУИД = """" И СделкаДоходы.Услуга = &УслугаТЭУ ТОГДА ИСТИНА
				//это условие для разбивки по коносаментам у них тоже пустой гуид, но при этом могут быть отдельные ставки
				//и тогда в предыдущем условии фрахт не попадет
				//д.б.пустой гуид и заполненный коносамент
		//|         КОГДА ВложенныйЗапрос.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоКоносаментам)  
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		|         КОГДА &ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоКоносаментам)
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		|             И &ГУИД = """" И СделкаДоходы.Услуга = &УслугаФрахт И &Коносамент <> Неопределено ТОГДА ИСТИНА
		|         ИНАЧЕ истина КОНЕЦ 
		//Евросиб Каблов 12.09.2023 ( #68187
		|	И ВЫБОР
		|			КОГДА &ЭтоСНП = ИСТИНА
		|				ТОГДА СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|			ИНАЧЕ СделкаДоходы.ИсточникПоявленияСтрокиЭкономики <> &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|		КОНЕЦ
		//Евросиб Каблов 12.09.2023 ( #68187
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		|	И СделкаДоходы.ИдентификаторГруппировки = &ИдентификаторГруппировки
		///Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0372241, 01-11-2024, начало
		|	И СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0372241, 01-11-2024, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходыЪ.Клиент КАК Клиент,
		|	СделкаДоходыЪ.Услуга КАК Услуга,
		|	СделкаДоходыЪ.СтавкаНДС КАК СтавкаНДС,
		|	СделкаДоходыЪ.СуммаНДС КАК СуммаНДС,
		|	СделкаДоходыЪ.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходыЪ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	СделкаДоходыЪ.Калькуляция КАК Калькуляция,
		|	СделкаДоходыЪ.Ставка КАК Ставка,
		|	СделкаДоходыЪ.ТипВагонов КАК ТипВагонов,
		|	СделкаДоходыЪ.ТипКТК КАК ТипКТК,
		|	СделкаДоходыЪ.Груз КАК Груз,
		|	СделкаДоходыЪ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СделкаДоходыЪ.РазмерКТК КАК РазмерКТК,
		|	СделкаДоходыЪ.ПериодВО КАК ПериодВО,
		|	СделкаДоходыЪ.Валюта КАК Валюта,
		|	СделкаДоходыЪ.РеестрКлиента КАК РеестрКлиента,
		|	СделкаДоходыЪ.СтанцияОтправления.Наименование + ""-"" + СделкаДоходыЪ.СтанцияНазначения.Наименование КАК Маршрут,
		|	СделкаДоходыЪ.СтанцияОтправления.НаименованиеАнгл + ""-"" + СделкаДоходыЪ.СтанцияНазначения.НаименованиеАнгл КАК МаршрутАнгл,
		|   СделкаДоходыЪ.СтанцияОтправления,
		|   СделкаДоходыЪ.СтанцияНазначения,
		|	СделкаДоходыЪ.Количество КАК Количество,
		|	СделкаДоходыЪ.СтавкаИтого КАК СтавкаИтого,
		|	СделкаДоходыЪ.ТипЗаказа КАК ТипЗаказа,
		|	СделкаДоходыЪ.ГУИД КАК ГУИД,
		|	СделкаДоходыЪ.СуммаИтого КАК СуммаИтого,
		//|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
		//Евросиб - АСуслов 11.03.2022 9:41:34 #45629
		//(
		|   СделкаДоходыЪ.УслугаВнеСтавки КАК УслугаВнеСтавки,
		//)
		//Евросиб - АСуслов 11.03.2022 9:41:36 #45629
		//Евросиб Каблов 07.11.2022 ( 54532
		|	СделкаДоходыЪ.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022 )
		//Евросиб Каблов 13.11.2023 ( #68187
		|	СделкаДоходыЪ.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//Евросиб Каблов 13.11.2023 )
		|	СделкаДоходыЪ.Сделка КАК Сделка,
		|   СделкаДоходыЪ.Коносамент КАК Коносамент,
		|   СделкаДоходыЪ.ОкруглениеКурса КАК ОкруглениеКурса, 
		|   СделкаДоходыЪ.ДокументФФД КАК ДокументФФД, 
		//Евросиб - АСуслов 04.09.2020 14:00:28 #0204458
		//(
		//|	СделкаДоходыЪ.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов (15.03.2022 Task №40571
		//|	ВЫБОР КОГДА СделкаДоходыЪ.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка) ТОГДА СделкаДоходыЪ.Услуга.ЕдиницаИзмерения ИНАЧЕ СделкаДоходыЪ.Калькуляция.ЕдиницаИзмерения КОНЕЦ КАК ЕдиницаИзмерения
		|   СделкаДоходыЪ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов)
		//)
		//Евросиб - АСуслов 04.09.2020 14:00:33 #0204458
		|ИЗ
		|	СделкаДоходыЪ КАК СделкаДоходыЪ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		//|		ПО (СделкаДоходыЪ.КТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%"")
		//|			И СделкаДоходыЪ.Заявка = ЗаявкаСоставУслуги.Ссылка
		|ГДЕ
		|	ВЫБОР
		//|			КОГДА &КонтрагентСРеестром
		//|				ТОГДА НЕ ЗаявкаСоставУслуги.РеестрКлиента = """"
		//|				ТОГДА 
		|    КОГДА &ЗаполненРеестрКлиента = ЛОЖЬ ТОГДА истина ИНАЧЕ СделкаДоходыЪ.РеестрКлиента В(&РеестрКлиента) КОНЕЦ
		//|			ИНАЧЕ ЕСТЬNULL(ЗаявкаСоставУслуги.РеестрКлиента,"""") = """"
		//|			ИНАЧЕ ЗаявкаСоставУслуги.РеестрКлиента = """"
		//|			ИНАЧЕ Истина
		//отбор по ктк не нужен, т.к. есть номер реестра
		//|		КОНЕЦ"+ ОтборПоКТК +"");
		//|		КОНЕЦ
		| ");
		//|   	И (ПОДСТРОКА(СделкаДоходыЪ.КТК,1,1) = """" И СделкаДоходыЪ.УслугаВнеСтавки
		//|   		ИЛИ (НЕ ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL И ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)))");	
		  //|   И СделкаДоходыЪ.УслугаВнеСтавки
		  //|   ИЛИ (НЕ ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL И ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))");		
		//|	И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка) ИЛИ СделкаДоходыЪ.УслугаВнеСтавки)");
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Запрос.УстановитьПараметр("Договор",Договор);
		//Запрос.УстановитьПараметр("КонтрагентСРеестром",КонтрагентСРеестром);
		Запрос.УстановитьПараметр("КонтрагентСРеестром",ЛОЖЬ);
		Запрос.УстановитьПараметр("ПоДопУслугам", ПоДопУслугам);
		Запрос.УстановитьПараметр("Акт", Акт);
		//Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		Запрос.УстановитьПараметр("ПСЦ", ?(ПараметрыФФД_ГруппироватьСтрокиПоРазличнымПСЦ, Неопределено, ПСЦ));
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		Запрос.УстановитьПараметр("Коносамент", знКоносамент);
		Запрос.УстановитьПараметр("ГУИД", ГУИД);
		//Евросиб - АСуслов 31.01.2023 18:05:10 #64514
		//(
		Запрос.УстановитьПараметр("РазделятьДокументыНаКаждыйКонтейнерОтдельно", ПараметрыФФД_РазделятьДокументыНаКаждыйКонтейнерОтдельно);
		//)
		//Евросиб - АСуслов 31.01.2023 18:05:12 #64514
		Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
		Запрос.УстановитьПараметр("ГруппировкаДаты", ГруппировкаДаты);
		Запрос.УстановитьПараметр("УслугаТЭУ", Справочники.Номенклатура.НайтиПоНаименованию("ТЭУ"));
		Запрос.УстановитьПараметр("УслугаФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
		Запрос.УстановитьПараметр("ЭтоФрахт", ЭтоФрахт);      
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		Запрос.УстановитьПараметр("ВидСтавки", ПараметрыФФД_ВидСтавки);  
		Запрос.УстановитьПараметр("СобратьГруппировкиВОдинСчет", ПараметрыФФД_СобратьГруппировкиВОдинСчет);
		Запрос.УстановитьПараметр("ВидГруппировкиФрахта", ПараметрыФФД_ВидГруппировкиФрахта);    
		Запрос.УстановитьПараметр("ОкруглениеКурса", ПараметрыФФД_ОкруглениеКурса);              
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		Если Сделка = Документы.Сделка.ПустаяСсылка() И Не ИзРелиза Тогда
			Запрос.УстановитьПараметр("НомерКТК",ДанныеИзОбработки.ВыгрузитьКолонку("Контейнер"));
			Запрос.УстановитьПараметр("Ссылка",ДанныеИзОбработки.ВыгрузитьКолонку("Сделка"));
			Запрос.УстановитьПараметр("РеестрКлиента", ДанныеИзОбработки.ВыгрузитьКолонку("НомерРеестра"));
			Запрос.УстановитьПараметр("ЗаполненРеестрКлиента", Истина);
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 27.08.2025 ((
		ИначеЕсли Сделка = Документы.Сделка.ПустаяСсылка() И ИзРелиза Тогда
			Запрос.УстановитьПараметр("НомерКТК", ДанныеИзОбработки.ВыгрузитьКолонку("Контейнер"));
			Запрос.УстановитьПараметр("Ссылка", ДанныеИзОбработки.ВыгрузитьКолонку("Сделка"));
			Запрос.УстановитьПараметр("РеестрКлиента", "");
			Запрос.УстановитьПараметр("ЗаполненРеестрКлиента", Ложь);
		// Евросиб Рыбьяков К.А. 27.08.2025 ))
		Иначе 
			Запрос.УстановитьПараметр("Ссылка",Сделка);
			Если ПараметрыФФД_РазделятьДокументыНаКаждыйКонтейнерОтдельно Тогда
				//в доходах в реестре заполнен номер КТК, в ГУИДе тоже номер КТК, вы знаете что делать
				Запрос.УстановитьПараметр("ЗаполненРеестрКлиента", Истина);
				Запрос.УстановитьПараметр("РеестрКлиента", ГУИД);
				Запрос.УстановитьПараметр("ГУИД", "");
			Иначе
				Запрос.УстановитьПараметр("ЗаполненРеестрКлиента", Ложь);
				Запрос.УстановитьПараметр("РеестрКлиента", "");
			КонецЕсли;
		КонецЕсли;
		
		//Евросиб Каблов 12.09.2023 ( #68187
		Запрос.УстановитьПараметр("ЭтоСНП", ЭтоСНП);
		Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы", Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы);
		//Евросиб Каблов 12.09.2023 )
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		Запрос.УстановитьПараметр("ИдентификаторГруппировки", ИдентификаторГруппировки);
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец

		РезультатЗапроса = Запрос.Выполнить();
		
	//ИначеЕсли НЕ НайденныйКлиент = Справочники.ФормированиеФинДокументов.ПустаяСсылка() И НайденныйКлиент.ДанныеИзРеестраПовагонки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++	
	ИначеЕсли ПараметрыФФД_ДанныеИзРеестраПовагонки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		Если Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			ДанныеИзОбработки = ПолучитьИзВременногоХранилища(КТКВХранилище);
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СделкаДоходы.Клиент КАК Клиент,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаДоходы.СуммаНДС КАК СуммаНДС,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	СделкаДоходы.Калькуляция КАК Калькуляция,
		|	СделкаДоходы.Ставка КАК Ставка,
		|	СделкаДоходы.ТипВагонов КАК ТипВагонов,
		|	СделкаДоходы.Груз КАК Груз,
		|	СделкаДоходы.ПериодВО КАК ПериодВО,
		|	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СделкаДоходы.Валюта КАК Валюта,
		|	СделкаДоходы.Ссылка КАК Сделка,
		|	СделкаДоходы.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		|	СделкаДоходы.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
		|	СделкаДоходы.Ссылка.СтанцияОтправления.Наименование + "" - "" + СделкаДоходы.Ссылка.СтанцияНазначения.Наименование КАК Маршрут,
		|	СделкаДоходы.Ссылка.СтанцияОтправления.НаименованиеАнгл + "" - "" + СделкаДоходы.Ссылка.СтанцияНазначения.НаименованиеАнгл КАК МаршрутАнгл,
		//Евросиб - АСуслов 11.03.2022 9:41:34 #45629
		//(
		|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
		//)
		//Евросиб - АСуслов 11.03.2022 9:41:36 #45629
		//Евросиб Каблов 07.11.2022 ( 54532
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022
		//Евросиб Каблов 13.11.2023 ( #68187
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//Евросиб Каблов 13.11.2023 )
		|   СделкаДоходы.Ссылка.СтанцияОтправления,
		|   СделкаДоходы.Ссылка.СтанцияНазначения,
		|	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
		|	ВЫРАЗИТЬ(СделкаДоходыВагоны.Вагон КАК СТРОКА(1000)) КАК Вагон,
		|	СделкаЗаявки.Заявка КАК Заявка,
		|	СделкаДоходы.Ссылка.ТипЗаказа КАК ТипЗаказа,
		|	СделкаДоходы.Количество КАК Количество,
		|	СделкаДоходы.СуммаИтого КАК СуммаИтого,
		|	СделкаДоходы.ДокументФФД КАК ДокументФФД,
		|	СделкаДоходы.РеестрКлиента КАК РеестрКлиента,
		// Евросиб Фролов (15.03.2022 Task №40571
        |	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов)
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, начало
		|	,СделкаДоходы.РазмерКТК КАК РазмерКТК
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, конец
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
		|		ПО СделкаДоходы.Ссылка = СделкаДоходыВагоны.Ссылка
		|			И СделкаДоходы.ГУИД = СделкаДоходыВагоны.ГУИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
		|		ПО СделкаДоходы.Ссылка = СделкаЗаявки.Ссылка
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, начало
		|  		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы2
		|  		ПО СделкаДоходы.ГУИДИсправляемойСтроки = СделкаДоходы2.ГУИД
		|  			И СделкаДоходы2.КорректировкаДокумента.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, конец
		|ГДЕ
		|	СделкаДоходы.Клиент = &Клиент
		|   И СделкаДоходы.НеВыставлятьклиенту = Ложь 
		|	И СделкаДоходы.Договор = &Договор
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, начало
		//|	И СделкаДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68324, 07-04-2023, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, начало
		|	И (СделкаДоходы.ГУИДИсправляемойСтроки = """" ИЛИ НЕ СделкаДоходы2.ГУИД ЕСТЬ NULL)
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363331, 16-08-2024, конец
		|   И ВЫБОР КОГДА &СтавкаНДС = Неопределено ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.СтавкаНДС = &СтавкаНДС КОНЕЦ
		|	И СделкаДоходы.Ссылка В(&Ссылка)
		| 	И (ВЫБОР КОГДА СделкаДоходы.УслугаВнеСтавки ТОГДА СделкаДоходы.НЕВыставлятьКлиенту = ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ)
		|	И ВЫБОР КОГДА &ПоДопУслугам <> НЕОПРЕДЕЛЕНО ТОГДА СделкаДоходы.УслугаВнеСтавки = &ПоДопУслугам ИНАЧЕ ИСТИНА КОНЕЦ
		//|   И (ВЫБОР КОГДА СделкаДоходы.УслугаВнеСтавки ТОГДА (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL) ИНАЧЕ ИСТИНА КОНЕЦ) 
		|   И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL) 
		|	И НЕ СделкаДоходы.Подсыл	
		//)
		|   И ВЫБОР КОГДА &ПСЦ = Неопределено ТОГДА ИСТИНА ИНАЧЕ СделкаДоходы.ПСЦ = &ПСЦ КОНЕЦ 
		//Евросиб - АСуслов 22.04.2022 12:30:56 #45021
		//(
		//Евросиб Каблов 12.09.2023 ( #68187
		//|   И ВЫБОР КОГДА &ГруппировкаДаты = ДатаВремя(1,1,1) ТОГДА ИСТИНА ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ) КОНЕЦ
		|   И ВЫБОР КОГДА &ГруппировкаДаты = ДатаВремя(1,1,1)
		|		ТОГДА ИСТИНА
		|   	ИНАЧЕ ВЫБОР
		|				КОГДА &ЭтоСНП = ИСТИНА
		|					ТОГДА СделкаДоходы.ПериодВО = &ГруппировкаДаты
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ГруппировкаДаты, МЕСЯЦ)
		|				КОНЕЦ
		|		КОНЕЦ
		//Евросиб Каблов 12.09.2023 )
		//|   И НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) = &ГруппировкаДаты
		//Евросиб - АСуслов 22.04.2022 12:30:58 #45021
		//Евросиб Каблов 12.09.2023 ( #68187
		|	И ВЫБОР
		|			КОГДА &ЭтоСНП = ИСТИНА
		|				ТОГДА СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|			ИНАЧЕ СделкаДоходы.ИсточникПоявленияСтрокиЭкономики <> &ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы
		|		КОНЕЦ
		//Евросиб Каблов 12.09.2023 ( #68187		
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		|	И СделкаДоходы.ИдентификаторГруппировки = &ИдентификаторГруппировки
		///Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Клиент КАК Клиент,
		|	ВТ.Услуга КАК Услуга,
		|	ВТ.СтавкаНДС КАК СтавкаНДС,
		|	ВТ.СуммаНДС КАК СуммаНДС,
		|	ВТ.ГУИД КАК ГУИД,
		|	ВТ.Перевыставляемая КАК Перевыставляемая,
		|	ВТ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	ВТ.Калькуляция КАК Калькуляция,
		|	ВТ.Ставка КАК Ставка,
		|	ВТ.ТипВагонов КАК ТипВагонов,
		|	ВТ.Груз КАК Груз,
		|	ВТ.ПериодВО КАК ПериодВО,
		|	ВТ.Валюта КАК Валюта,
		|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ВТ.Сделка КАК Сделка,
		|	ВТ.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ.Маршрут КАК Маршрут,
		|	ВТ.МаршрутАнгл КАК МаршрутАнгл,
		|	ВТ.СтавкаИтого КАК СтавкаИтого,
		|	ВТ.Вагон КАК Вагон,
		|	ВТ.ТипЗаказа КАК ТипЗаказа,
		|	ВТ.Количество КАК Количество,
		|	ВТ.СуммаИтого КАК СуммаИтого,
		|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
		//Евросиб - АСуслов 11.03.2022 9:41:34 #45629
		//(
		|   ВТ.УслугаВнеСтавки КАК УслугаВнеСтавки,
		//)
		//Евросиб - АСуслов 11.03.2022 9:41:36 #45629
		//Евросиб Каблов 07.11.2022 ( 54532
		|	ВТ.ДоплатныеКТК КАК ДоплатныеКТК,
		//Евросиб Каблов 07.11.2022
		//Евросиб Каблов 13.11.2023 ( #68187
		|	ВТ.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		//Евросиб Каблов 13.11.2023 )
		|	ВТ.РеестрКлиента КАК РеестрКлиента,
		|   ВТ.ДокументФФД КАК ДокументФФД,
		//Евросиб Каблов 05.05.2022 ( Task 45436
		|   Неопределено КАК Коносамент,
		//Евросиб Каблов 05.05.2022 )
		//Евросиб - АСуслов 04.09.2020 14:01:08 #0204458
		//(
		//|	ВТ.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов (15.03.2022 Task №40571
		//|	ВТ.Калькуляция.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		// Евросиб Фролов)
		//)
		//Евросиб - АСуслов 04.09.2020 14:01:11 #0204458
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, начало
		|	,ВТ.РазмерКТК КАК РазмерКТК
		|   ,&ОкруглениеКурса КАК ОкруглениеКурса
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, конец
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
		|			И (ВТ.Вагон ПОДОБНО ""%"" + ЗаявкаСоставУслуги.Вагон.Наименование + ""%"")");
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Запрос.УстановитьПараметр("Договор",Договор);
		Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
		Запрос.УстановитьПараметр("ПоДопУслугам", ПоДопУслугам);
		//Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		Запрос.УстановитьПараметр("ПСЦ", ?(ПараметрыФФД_ГруппироватьСтрокиПоРазличнымПСЦ, Неопределено, ПСЦ));
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		Запрос.УстановитьПараметр("ГруппировкаДаты", ГруппировкаДаты);
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, начало
		Запрос.УстановитьПараметр("ОкруглениеКурса", ПараметрыФФД_ОкруглениеКурса);
		//ДИТ, Беляев СЮ, Ticket#0313008, 08-06-2023, конец
		Если Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			Запрос.УстановитьПараметр("Ссылка",ДанныеИзОбработки.ВыгрузитьКолонку("Сделка"));
		Иначе
			Запрос.УстановитьПараметр("Ссылка",Сделка);
		КонецЕсли;
		//Евросиб Каблов 12.09.2023 ( #68187
		Запрос.УстановитьПараметр("ЭтоСНП", ЭтоСНП);
		Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономикиАРМСверхнормативы", Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы);
		//Евросиб Каблов 12.09.2023 )
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало
		Запрос.УстановитьПараметр("ИдентификаторГруппировки", ИдентификаторГруппировки);
		//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец

		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
		
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиАвансовыйСчет(ДокСделка,Контрагент,Договор,СчетаПоКоносаментам,СчетаПоЖД)
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	СчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка,
	//|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
	//|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
	//|	СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	//|ИЗ
	//|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	//|ГДЕ
	//|	СчетНаОплатуПокупателюТовары.Ссылка.Контрагент = &Контрагент
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.АвансовыйСчет = ИСТИНА
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.ПометкаУдаления = ЛОЖЬ");
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю,
	//|	СчетаПокупателейОстатки.Номенклатура КАК Номенклатура,
	//|	СчетаПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
	//|	СчетаПокупателейОстатки.СуммаОстаток КАК Сумма,
	//|	"""" КАК СодержаниеУслуги
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Сделка В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						СчетНаОплатуПокупателюДокументыОснования.Ссылка.Сделка
	//|					ИЗ
	//|						Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	//|					ГДЕ
	//|						СчетНаОплатуПокупателюДокументыОснования.Сделка = &Сделка
	//|			
	//|					ОБЪЕДИНИТЬ
	//|			
	//|					ВЫБРАТЬ
	//|						&сделка)
	//|				И Контрагент = &Контрагент
	//|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю,
	//|	СчетаПокупателейОстатки.Номенклатура,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	""""
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И СчетПокупателю В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						СчетНаОплатуПокупателю.Ссылка
	//|					ИЗ
	//|						Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|					ГДЕ
	//|						СчетНаОплатуПокупателю.Ссылка В (&СчетаПокупателю))
	//|				И Контрагент = &Контрагент
	//|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю,
	//|	СчетаПокупателейОстатки.Номенклатура,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	""""
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И СчетПокупателю В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						СчетНаОплатуПокупателю.Ссылка
	//|					ИЗ
	//|						Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|					ГДЕ
	//|						СчетНаОплатуПокупателю.Ссылка В (&СчетаПокупателюЖД))
	//|				И Контрагент = &Контрагент
	//|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю,
	//|	СчетаПокупателейОстатки.Номенклатура,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	СчетаПокупателейОстатки.СуммаОстаток,
	//|	""""
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И СчетПокупателю В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						КлючевыеСобытияСделки.Документ КАК Документ
	//|					ИЗ
	//|						РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	//|					ГДЕ
	//|						НЕ КлючевыеСобытияСделки.Услуга = &УслугаФрахт
	//|						И КлючевыеСобытияСделки.Событие = ""Создание счета""
	//|						И КлючевыеСобытияСделки.Сделка В
	//|							(ВЫБРАТЬ
	//|								составпоезда.Заявка
	//|							ИЗ
	//|								документ.сделка.связьучетныхединиц КАК составпоезда
	//|							ГДЕ
	//|								составпоезда.Ссылка = &Сделка)
	//|						И КлючевыеСобытияСделки.КТК В
	//|							(ВЫБРАТЬ
	//|								составпоезда.Контейнер
	//|							ИЗ
	//|								документ.сделка.связьучетныхединиц КАК составпоезда
	//|							ГДЕ
	//|								составпоезда.Ссылка = &Сделка)
	//|						И НЕ КлючевыеСобытияСделки.Документ.ПометкаУдаления)
	//|				И Контрагент = &Контрагент
	//|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СуммаОстаток УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.Ссылка В(&СчетаПокупателю)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПокупателю.Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.Ссылка В(&СчетаПокупателюЖД)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлючевыеСобытияСделки.Документ
	|ИЗ
	|	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	|ГДЕ
	|	НЕ КлючевыеСобытияСделки.Услуга = &УслугаФрахт
	|	И КлючевыеСобытияСделки.Событие = ""Создание счета""
	|	И КлючевыеСобытияСделки.Сделка В
	|			(ВЫБРАТЬ
	|				составпоезда.Заявка
	|			ИЗ
	|				документ.сделка.связьучетныхединиц КАК составпоезда
	|			ГДЕ
	|				составпоезда.Ссылка = &Сделка)
	|	И КлючевыеСобытияСделки.КТК В
	|			(ВЫБРАТЬ
	|				составпоезда.Контейнер
	|			ИЗ
	|				документ.сделка.связьучетныхединиц КАК составпоезда
	|			ГДЕ
	|				составпоезда.Ссылка = &Сделка)
	|	И НЕ КлючевыеСобытияСделки.Документ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ ВТ_СчетаОтбор
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, начало (удалено измерение "Сделка", работать этот подзапрос не будет)
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Сделка В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						СчетНаОплатуПокупателюДокументыОснования.Сделка
	//|					ИЗ
	//|						Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	//|					ГДЕ
	//|						СчетНаОплатуПокупателюДокументыОснования.Сделка = &Сделка
	//|			
	//|					ОБЪЕДИНИТЬ
	//|			
	//|					ВЫБРАТЬ
	//|						&сделка)
	//|				И Контрагент = &Контрагент
	//|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	//|
	//|ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 88167, 26-07-2024, конец
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СчетНаОплатуПокупателюДокументыОснования.Ссылка
	|					ИЗ
	|						Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|					ГДЕ
	|						СчетНаОплатуПокупателюДокументыОснования.Сделка = &Сделка
	|			
	|					ОБЪЕДИНИТЬ
	|			
	|					ВЫБРАТЬ
	|						&сделка)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ
	|						ВТ.Ссылка
	|					ИЗ
	|						ВТ_Счета КАК ВТ)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю,
	|	СчетаПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	СчетаПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
	|	СчетаПокупателейОстатки.СуммаОстаток КАК Сумма,
	|	"""" КАК СодержаниеУслуги
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Отбор.СчетПокупателю
	|					ИЗ
	|						ВТ_СчетаОтбор КАК ВТ_Отбор)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Сделка", ДокСделка);
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСделка, "Организация"));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СчетаПокупателю", СчетаПоКоносаментам);
	Запрос.УстановитьПараметр("СчетаПокупателюЖД", СчетаПоЖД);
	Запрос.УстановитьПараметр("УслугаФрахт", Справочники.Номенклатура.НайтиПоНаименованию("Фрахт"));
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаВыборка Из Выборка Цикл
		Для каждого СтрокаУслуга Из СтрокаВыборка.СчетПокупателю.Товары Цикл
			СтрокаВыборка.СодержаниеУслуги = СтрокаВыборка.СодержаниеУслуги + СтрокаУслуга.Содержание;
		КонецЦикла; 
	КонецЦикла; 
	Если Выборка.Количество() > 0 Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Если НЕ ЗавершениеРаботы Тогда //ДИТ, Беляев СЮ, Ticket#0335269, 04-04-2024, закомментировал блок ИмяСобытия = "ДокументыДляСделкиСозданы"
	//	Оповестить("ДокументыДляСделкиСозданы", Сделка);
	//КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0372241, 01-11-2024, начало (для выставления документов из Реестров оповещение нужно
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 (( Добавил ИзРелиза
	Если НЕ ЗавершениеРаботы И (ИзОбработки Или ИзРелиза) Тогда
		Оповестить("ДокументыДляСделкиСозданы", Сделка);
	КонецЕсли;
	Если ИзРелиза Тогда
		Оповестить("ТребуетсяПеречитатьУказанныйДокумент", РелизСобственника);
	КонецЕсли;
	// Евросиб US 120424 TA 122733 Рыбьяков К.А. 16.11.2025 ((
	Оповестить("РазблокироватьДокументВОчереди", Сделка);
	// Евросиб Рыбьяков К.А. 16.11.2025 ))
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0372241, 01-11-2024, конец
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПометкаПриИзменении(Элемент)
	ТД = Элементы.ТЧ.ТекущиеДанные;
	//Если НЕ ТД.ГотовоКВыставлению Тогда
	//	Сообщить("Можно выделять строки только готовые к выставлению");
	//	ТД.Пометка = Не ТД.Пометка;
	//КонецЕсли; 
	Если ТД.ВидДокумента = "Реализация товаров и услуг" Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
		СтруктураОтбора.Вставить("Договор", ТД.Договор);
		СтруктураОтбора.Вставить("ВидДокумента", "Счет покупателю");
		СтруктураОтбора.Вставить("ИдентификаторПакета", ТД.ИдентификаторПакета);
		Если ТД.Пометка Тогда
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0  Тогда
				МассивСтрок[0].ПОметка = ТД.Пометка;
			КонецЕсли;
		КонецЕсли;
		Если не ТД.Пометка Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
			СтруктураОтбора.Вставить("Договор", ТД.Договор);
			СтруктураОтбора.Вставить("ВидДокумента", "Счет-фактура выданный");
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() > 0  Тогда
				Если МассивСтрок[0].Пометка Тогда
					Сообщить("В системе запрещено создание счетов-фактур без первичного документа.");
					ТД.Пометка = Истина;




				КонецЕсли;
			КонецЕсли;
		КонецЕсли;


	КонецЕсли;	
	
	Если ТД.ВидДокумента = "Счет покупателю" Тогда
		Если Не ТД.Пометка Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
			СтруктураОтбора.Вставить("Договор", ТД.Договор);
			СтруктураОтбора.Вставить("ВидДокумента", "Реализация товаров и услуг" );
			СтруктураОтбора.Вставить("ИдентификаторПакета", ТД.ИдентификаторПакета);
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество()>0 Тогда
				Если МассивСтрок[0].Пометка Тогда
					Сообщить("В системе запрещено создание актов без счетов на оплату.");
					ТД.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТД.ВидДокумента = "Счет-фактура выданный" Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
		СтруктураОтбора.Вставить("Договор", ТД.Договор);
		СтруктураОтбора.Вставить("ИдентификаторПакета", ТД.ИдентификаторПакета);
		Если ТД.Пометка Тогда
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0  Тогда
				Для каждого Эл Из МассивСтрок Цикл
				Если Эл.ВидДокумента <> "Реализация товаров и услуг" Тогда
					Эл.Пометка = ТД.Пометка;
				ИначеЕсли Эл.ВидДокумента <> "Отчет комитенту о закупках" Тогда
					Эл.Пометка = ТД.Пометка;
				КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;




	КонецЕсли;	
	
	Если ТД.ВидДокумента = "Отчет комитенту о закупках" Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
		СтруктураОтбора.Вставить("Договор", ТД.Договор);
		СтруктураОтбора.Вставить("ВидДокумента", "Счет покупателю");
		СтруктураОтбора.Вставить("ИдентификаторПакета", ТД.ИдентификаторПакета);
		Если ТД.Пометка Тогда
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0  Тогда
				МассивСтрок[0].ПОметка = ТД.Пометка;
			КонецЕсли;
		КонецЕсли;
		Если Не ТД.Пометка Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Контрагент", ТД.Контрагент);
			СтруктураОтбора.Вставить("Договор", ТД.Договор);
			СтруктураОтбора.Вставить("ВидДокумента", "Счет-фактура выданный" );
			МассивСтрок = ТЧ.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество()>0 Тогда
				Если МассивСтрок[0].Пометка Тогда
					Сообщить("В системе запрещено создание счетов-фактур без первичного документа.");
					ТД.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, начало
	ИнформироватьПользователяОПодозрительныхСтроках(ТД.Контрагент); 
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, конец
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, начало
&НаСервере
Процедура ИнформироватьПользователяОПодозрительныхСтроках(вхКонтрагент)
	НайденныеСтроки = ПодозрительныеСтрокиБезПравил.НайтиСтроки(Новый Структура("Клиент,ОповещениеВыполнено",вхКонтрагент,Ложь));
	Для каждого ЭлМассива Из НайденныеСтроки Цикл
		Сообщить("Не подобраны правила формирования и не будут использованы по контрагенту <"+ЭлМассива.Клиент+
								"> и услуге <"+ЭлМассива.Услуга+">, возможно причина в отсутствии <Калькуляции> в доходной части Экономики.");
		ЭлМассива.ОповещениеВыполнено = Истина;							
	КонецЦикла;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, конец

&НаКлиенте
Процедура НапечататьКомплект(Команда)
	
	//80515 Субботин 14.02.2024 начало
	Если НЕ КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РазрешитьОтправкуШтрафныхРТУ") Тогда 	
		ШтрафныеРТУ = ПроверитьВозможностьПечатиДокументов(); 
		Если ШтрафныеРТУ.Количество()>0 Тогда
			ЗадатьВопросПользователю(ШтрафныеРТУ); 
			Возврат
		КонецЕсли;
	КонецЕсли;
	//80515 Субботин 14.02.2024 Конец
	
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 25.10.2024 ((
	МассивСсылок = Новый Массив;
	Для Каждого Строка Из ТЧ Цикл
		Если Строка.Пометка Тогда
			МассивСсылок.Добавить(Строка.СсылкаНаДокумент);
		КонецЕсли;
	КонецЦикла;
	НеДоступныДляПечати = ПечатьБухгалтерскихДокументов.ДоступныеДляПечатиИОтправкиПоЭдо(МассивСсылок);
	Если НеДоступныДляПечати.Количество() > 0 Тогда
		Для Каждого Документ Из НеДоступныДляПечати Цикл
			ТекстОшибки = НСтр("ru = 'Запрещено отправлять документы клиентам до сдачи декларации по НДС за отчётный квартал 
				|(до ""%1 числа"" месяца, следующего за отчётным). %2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Документ.Число, Документ.Ссылка);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 25.10.2024 ))
	
//Евросиб - АСуслов 04.09.2020 12:23:47 #0204458
//(
	//ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",, ЭтотОбъект);
	МассивПФ = НапечататьКомплектНаСервере(ТЧ, Неопределено); 
	//80515 Субботин 14.02.2024 начало // вынес в отдельную процедуру для вызова
	//ПечатьКомплектаДокументов.НапечататьКомплект(МассивПФ, Неопределено);
	НапечататьКомплектДокументов(МассивПФ, Неопределено);
	//80515 Субботин 14.02.2024 Конец
	Возврат;
#Область ВызовИзОбщегоМодуля
	////МассивПФ = ПечатьКомплектаДокументов.НапечататьКомплектНаСервере(ТЧ, Неопределено); 
	//
	//ДЛя каждого ЭлементСтруктуры из МассивПФ Цикл
	//	
	//	ПараметрКоманды = Новый Массив;
	//	Для Каждого Эл Из ЭлементСтруктуры.МассивСсылокНаДок Цикл
	//		ПараметрКоманды.Добавить(Эл);
	//	КонецЦикла;
	//	ОбластиОбъектов = Новый СписокЗначений;
	//		
	//	КоллекцияПечатныхФорм = Новый Массив;
	//	Поля = УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм();
	//	ДобавленныеПечатныеФормы = Новый Соответствие;
	//	
	//	Для Каждого Док Из ЭлементСтруктуры.МассивТДПоКлиенту Цикл
	//		ДобавленныеПечатныеФормы = Новый Соответствие;
	//		ПечатнаяФорма = Новый Структура(СтрСоединить(Поля, ","));
	//		ПечатнаяФорма.ИмяМакета = Док.ИмяПФ;
	//		ПечатнаяФорма.ИмяВРЕГ = ВРег(Док.ИмяПФ);
	//		ПечатнаяФорма.СинонимМакета = Док.ИмяПФ;
	//		ПечатнаяФорма.ТабличныйДокумент = Док.ТабДок;
	//		ПечатнаяФорма.ИмяФайлаПечатнойФормы = Док.ИмяПФ;
	//		ПечатнаяФорма.Экземпляров = 1;
	//		ПечатнаяФорма.СсылкаДок = Док.СсылкаДок;
	//		ДобавленныеПечатныеФормы.Вставить(Док.ИмяПФ, ПечатнаяФорма);
	//		КоллекцияПечатныхФорм.Добавить(ПечатнаяФорма);
	//		
	//	КонецЦикла;
	//	
	//	Если КоллекцияПечатныхФорм.Количество() <> 0 Тогда
	//		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияпечатныхФорм,ОбластиОбъектов,,ПараметрКоманды);
	//	КонецЕсли;
	//	
	//КонецЦикла;

//)
//Евросиб - АСуслов 04.09.2020 12:23:50 #0204458	

#КонецОбласти
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НапечататьКомплектНаСервере(Знач ТЧ, СтруктураПодписантов)
	
	ТЗДляПечати = ТЧ.Выгрузить(Новый Структура("Пометка", Истина));
	Возврат ПечатьКомплектаДокументов.НапечататьКомплектНаСервере(ТЗДляПечати, Неопределено, Истина);

	#Область ВызовИзОбщегоМодуля
	//МассивРезультатов = Новый Массив;
	//
	//ПОД = Новый ПакетОтображаемыхДокументов;
	//ПОД.КоличествоЭкземпляров = 1;
	//ТЗПоКлиентам = ТЧ.Выгрузить();
	//ТЗПоКлиентам.Свернуть("Контрагент, договор");
	//ПараметрыПечати = Новый Структура;
	//ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	//КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	//КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	//КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	//КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ОфисныеДокументы");
	//
	//ОбъектыПечати = Новый СписокЗначений;
	//ПараметрыВывода = новый Структура;
	//ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно", Ложь);
	//
	//Для каждого Эл из ТЗПоКлиентам Цикл
	//	
	//	массивТДПоКлиенту = Новый Массив;
	//	МассивДокументовКлиента = НОвый Массив;
	//	СтруктураОтбора = Новый Структура;
	//	СтруктураОтбора.Вставить("Контрагент", Эл.Контрагент);
	//	СтруктураОтбора.Вставить("Договор",Эл.Договор);
	//	МассивСтрокДокументов = ТЧ.НайтиСтроки(СтруктураОтбора);
	//	// используем эту переменную для создания уникальности однотипных документов
	//	ТекЦикл = 0;
	//	массивНапечатанныхДокументов = Новый Массив;
	//	Для каждого Стр из МассивСтрокДокументов Цикл
	//		Если массивНапечатанныхДокументов.Найти(Стр.СсылкаНаДокумент) <> Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		Если Стр.Пометка и ЗначениеЗаполнено(Стр.СсылкаНаДокумент) Тогда
	//			массивНапечатанныхДокументов.Добавить(Стр.СсылкаНаДокумент);
	//			ТекЦикл = ТекЦикл + 1;
	//			МассивОбъектов = Новый Массив;
	//			МассивОбъектов.Добавить(Стр.СсылкаНаДокумент);
	//			Если ТипЗнч(Стр.СсылкаНаДокумент) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
	//				КоллекцияПечатныхФорм.Очистить();
	//				НовСтр = КоллекцияПечатныхФорм.Добавить();
	//				Если Стр.СсылкаНаДокумент.ДоговорКонтрагента.ВыставлятьСчетНаАнглийскомЯзыке Тогда
	//					НовСтр.ИмяВРЕГ = "СЧЕТНАОПЛАТУАНГЛ";
	//				Иначе	
	//					НовСтр.ИмяВРЕГ = "СЧЕТЗАКАЗ";
	//				КонецЕсли;
	//				//НовСтр.ИмяВРЕГ = "СЧЕТЗАКАЗ";
	//			//	ТабСведенийСчета = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(Стр.СсылкаНаДокумент);
	//			//	ТабДок = ПечатьБухгалтерскихДокументов.ПечатьСчетаНаОплату(ТабСведенийСчета,ОбъектыПечати,ПараметрыПечати);
	//			   	Документы.СчетНаОплатуПокупателю.Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//				ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//				АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//				ПОД.Состав.Добавить().Данные = АдресВХ;
	//				СтруктураТабДок = Новый СТруктура;
	//				СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "СчетЗаказ"+ПолучитьНомерДатуДокумента(стр.СсылкаНаДокумент));
	//				СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//				СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//				массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//				//Если Стр.СсылкаНаДокумент.ДоговорКонтрагента.ВыставлятьСчетНаАнглийскомЯзыке Тогда
	//					//КоллекцияПечатныхФорм.Очистить();
	//					//НовСтр = КоллекцияПечатныхФорм.Добавить();
	//					//НовСтр.ИмяВРЕГ = "СЧЕТНАОПЛАТУАНГЛ";
	//					//  Документы.СчетНаОплатуПокупателю.Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//					//ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//					//АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//					//ПОД.Состав.Добавить().Данные = АдресВХ;
	//					//СтруктураТабДок = Новый СТруктура;
	//					//СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "СЧЕТНАОПЛАТУАНГЛ"+ПолучитьНомерДатуДокумента(стр.СсылкаНаДокумент));
	//					//СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//					//массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//						
	//				//КонецЕсли;
	//			КонецЕсли;
	//			Если ТипЗнч(Стр.СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//				КоллекцияПечатныхФорм.Очистить();
	//				ПечататьУПД = Эл.Контрагент.ОсновнойПервичныйДокументПоУмолчанию = Перечисления.ВидыПервичныхДокументов.УПД;
	//				Если ПечататьУПД Тогда
	//					НовСтр = КоллекцияПечатныхФорм.Добавить();
	//					НовСтр.ИмяВРЕГ = ВРЕГ("УниверсальныйПередаточныйДокумент981");
	//					Документы.РеализацияТоваровУслуг.Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//					ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//					АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//					ПОД.Состав.Добавить().Данные = АдресВХ;
	//					СтруктураТабДок = Новый СТруктура;
	//					//СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "АктСдачиПриемки" + " №" + Строка(Стр.СсылкаНаДокумент.НомерДляПечати));
	//					СтруктураТабДок.Вставить("ИмяПФ",СтрШаблон("%1. %2 №%3 от %4",
	//					Строка(ТекЦикл),
	//					"УПД",
	//					Стр.СсылкаНаДокумент.НомерДляПечати,
	//					Формат(Стр.СсылкаНаДокумент.ДатаДокумента,"ДФ=dd.MM.yyyy")));
	//					СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//					СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//					массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//					
	//				Иначе	
	//					
	//					НовСтр = КоллекцияПечатныхФорм.Добавить();
	//					НовСтр.ИмяВРЕГ = "АКТСДАЧИПРИЕМКИ";
	//					Документы.РеализацияТоваровУслуг.Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//					ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//					АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//					ПОД.Состав.Добавить().Данные = АдресВХ;
	//					СтруктураТабДок = Новый СТруктура;
	//					//СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "АктСдачиПриемки" + " №" + Строка(Стр.СсылкаНаДокумент.НомерДляПечати));
	//					СтруктураТабДок.Вставить("ИмяПФ",СтрШаблон("%1. %2 №%3 от %4",
	//					Строка(ТекЦикл),
	//					"АктСдачиПриемки",
	//					Стр.СсылкаНаДокумент.НомерДляПечати,
	//					Формат(Стр.СсылкаНаДокумент.ДатаДокумента,"ДФ=dd.MM.yyyy")));
	//					СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//					СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//					массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//					
	//				КонецЕсли; 
	//				
	//			КонецЕсли;
	//			Если ТипЗнч(Стр.СсылкаНаДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
	//				КоллекцияПечатныхФорм.Очистить();
	//				Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.СсылкаНаДокумент, "СпособРасчетаКомиссионногоВознаграждения") = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
	//					НовСтр = КоллекцияПечатныхФорм.Добавить();
	//					НовСтр.ИмяВРЕГ = "АКТСДАЧИПРИЕМКИ";
	//					Документы.ОтчетКомитентуОПродажах.Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//					ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//					АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//					ПОД.Состав.Добавить().Данные = АдресВХ;
	//					СтруктураТабДок = Новый СТруктура;
	//					РеквизитыОтчетАгента =ОбщегоНазначения.ЗначенияРеквизитовОбъекта(стр.СсылкаНаДокумент,"НомерДляПечатиВознаграждение, ДатаДокумента");
	//					СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "АктСдачиПриемки"+СтрШаблон("%1 от %2",РеквизитыОтчетАгента.НомерДляПечатиВознаграждение, формат(РеквизитыОтчетАгента.ДатаДокумента,"ДФ=dd.MM.yyyy")));
	//					//СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "АктСдачиПриемки"+ПолучитьНомерДатуДокумента(стр.СсылкаНаДокумент));
	//					СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//					СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//					массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//					ТекЦикл = ТекЦикл + 1;
	//				КонецЕсли; 
	//				
	//				КоллекцияПечатныхФорм.Очистить();
	//				НовСтр = КоллекцияПечатныхФорм.Добавить();
	//				НовСтр.ИмяВРЕГ = "ОТЧЕТАГЕНТА";
	//				Если Стр.Договор.ДоговорТранспортнойЭкспедиции Тогда
	//					ИмяПФ = "ОтчетЭкспедитора";
	//				Иначе
	//					ИмяПФ = "ОтчетАгента";
	//				КонецЕсли; 
	//				Документы.ОтчетКомитентуОПродажах.Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//				ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//				АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//				ПОД.Состав.Добавить().Данные = АдресВХ;
	//				СтруктураТабДок = Новый СТруктура;
	//				РеквизитыОтчетАгента =ОбщегоНазначения.ЗначенияРеквизитовОбъекта(стр.СсылкаНаДокумент,"НомерДляПечати, ДатаДокумента");
	//				СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + "ОтчетАгента"+СтрШаблон("%1 от %2",РеквизитыОтчетАгента.НомерДляПечати, формат(РеквизитыОтчетАгента.ДатаДокумента,"ДФ=dd.MM.yyyy")));
	//				СтруктураТабДок.Вставить("ИмяПФ",СтрШаблон("%1. %2 №%3 от %4",
	//										Строка(ТекЦикл),
	//										ИмяПФ,
	//										РеквизитыОтчетАгента.НомерДляПечати,
	//										формат(РеквизитыОтчетАгента.ДатаДокумента,"ДФ=dd.MM.yyyy")));
	//				СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//				СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//				массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//				
	//			КонецЕсли;
	//			Если ТипЗнч(Стр.СсылкаНаДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
	//				КоллекцияПечатныхФорм.Очистить();
	//				НовСтр = КоллекцияПечатныхФорм.Добавить();
	//				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Контрагент, "ОсновнойПервичныйДокументПоУмолчанию") = Перечисления.ВидыПервичныхДокументов.УПД Тогда
	//					ИмяДок = "УниверсальныйПередаточныйДокумент981"
	//				Иначе
	//					ИмяДок = "СчетФактура981";
	//				КонецЕсли; 
	//				НовСтр.ИмяВРЕГ = Врег(ИмяДок);
	//				Документы.СчетФактураВыданный.Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати,ПараметрыВывода,СтруктураПодписантов);
	//				ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	//				АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	//				ПОД.Состав.Добавить().Данные = АдресВХ;
	//				СтруктураТабДок = Новый СТруктура;
	//				СтруктураТабДок.Вставить("ИмяПФ",Строка(ТекЦикл)+ ". " + ИмяДок+ПолучитьНомерДатуДокумента(стр.СсылкаНаДокумент));
	//				СтруктураТабДок.Вставить("ТабДок",ТабДок);
	//				СтруктураТабДок.Вставить("СсылкаДок", Стр.СсылкаНаДокумент);
	//				массивТДПоКлиенту.Добавить(СтруктураТабДок);
	//			
	//			КонецЕсли;
	//			МассивДокументовКлиента.Добавить(Стр.СсылкаНаДокумент);
	//		КонецЕсли;
	//		
	//		
	//	КонецЦикла;
	//	ИВФ = ПолучитьИмяВременногоФайла("pdf");
	//	ПОД.ЗаписатьФайлДляПечати(ИВФ);
	//	ДД = Новый ДвоичныеДанные(ИВФ);
	//	УдалитьФайлы(ИВФ);
	//	//МассивРезультатов.Добавить(ДД);
	//	СтруктураПоКлиенту = НОвый Структура;
	//	СтруктураПоКлиенту.Вставить("МассивСсылокНаДок",МассивДокументовКлиента);
	//	СтруктураПоКлиенту.Вставить("МассивТДПоКлиенту",массивТДПоКлиенту);
	//	
	//	МассивРезультатов.Добавить(СтруктураПоКлиенту);
	//	ПОД.Состав.Очистить();
	//КонецЦикла;
	//Возврат МассивРезультатов;
#КонецОбласти
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерДатуДокумента(СсылкаДок)
	
	РеквизитыДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаДок, "НомерДляПечати, ДатаДокумента");
	//НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДок.Номер);
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" №%1 от %2", 
																РеквизитыДок.НомерДляПечати,
																Формат(РеквизитыДок.ДатаДокумента,"ДФ=dd.MM.yyyy"));
	
КонецФункции

&НаКлиенте
Процедура ВыбратьВсе(Команда)   
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, начало
	МассивКлиентов = Новый Массив;   
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, конец
	Для каждого Стр из ТЧ Цикл
		Если Элементы.ТЧ.ПроверитьСтроку(Тч.Индекс(Стр)) Тогда
			Стр.Пометка = Истина;           
			//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, начало
			МассивКлиентов.Добавить(Стр.Контрагент);
			//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, конец
		КонецЕсли; 
	КонецЦикла;
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, начало    
	МассивКлиентов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКлиентов);
	Для каждого ЭлМассива Из МассивКлиентов Цикл
		ИнформироватьПользователяОПодозрительныхСтроках(ЭлМассива);		
	КонецЦикла;	  
	//ДИТ, Беляев СЮ, Ticket#0259010, 01-02-2022, конец
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Если Элементы.ТЧ.ПроверитьСтроку(Тч.Индекс(Стр)) Тогда
			Стр.Пометка = Ложь;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТЧ.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, "Все возможные файлы по этой сделке уже созданы. Проверить их Вы можете через пункт меню ""Связанные документы"".");
		Элементы.ТЧСоздатьКомплект.Доступность = Ложь;
		Элементы.ФормаНапечататьКомплект.Доступность = Ложь;
		
	КонецЕсли;
	
	РежимРаботыСКурсомВалютПриИзменении(неопределено);
	УстановитьПредставлениеКнопкиВидОтветственного(); 
	
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, начало
	Если ТекстПроблемСНаборомДокументовДляФормирования.КоличествоСтрок()>0 Тогда
		строкаПредупреждения = "Обратитесь в техподдержку, по клиентам невозможно сформировать документы:
										 |"+ТекстПроблемСНаборомДокументовДляФормирования.ПолучитьТекст();
		ПоказатьПредупреждение(, строкаПредупреждения);		
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0285852/BUG 57782, 09-11-2022, конец
	
КонецПроцедуры

//Евросиб Гудкова( 24.02.2020
//&НаСервереБезКонтекста
//Процедура ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, ЭтоВагоны = Ложь)

//	НеЗаполняемыеПоля = "ДатаОтправки";
//	Если ЭтоВагоны Тогда
//		НеЗаполняемыеПоля = НеЗаполняемыеПоля + ", Контейнер";
//	КонецЕсли; 
//	ЗаполнитьЗначенияСвойств(НовСтрокаРасш, СтрПоезда,,НеЗаполняемыеПоля);
//	
//	ВесГр = 0;

//	Если ЗначениеЗаполнено(СтрПоезда.ДатаНачалаПериодаПовагонки) Тогда
//		НовСтрокаРасш.ДатаОтправкиПовагонки = СтрПоезда.ДатаОтправки;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(СтрПоезда.ЖДН) ТОгда
//		Накладная = СтрПоезда.ЖДН.НакладнаяЭТРАН;
//		Если ЗначениеЗаполнено(Накладная) Тогда
//			НовСтрокаРасш.ДатаОтправки = Накладная.ДатаИВремяОтправленияГруза;
//		Иначе
//			НовСтрокаРасш.ДатаОтправки = СтрПоезда.ЖДН.ДатаОтправления;	
//		КонецЕсли; 
//		Если ЗначениеЗаполнено(НовСтрокаРасш.Контейнер) 
//			И НЕ ЭтоВагоны Тогда
//			ПараметрыОтбора = Новый Структура;
//			Параметрыотбора.Вставить("НомерКонтейнера",НовСтрокаРасш.Контейнер.Наименование);
//			НайденныйКТК = Накладная.Контейнеры.НайтиСтроки(ПараметрыОтбора);
//			// сделаем цикл по таблице на случай сборных грузов в КТК
//			Для Каждого Стр Из НайденныйКТК Цикл
//				ВесГр = ВесГр + Стр.МассыВКгНетто;
//				ГРП = Стр.ГрузоподКонтТн;
//			КонецЦикла;
//			НовСтрокаРасш.ФактическийВес = ВесГр;
//			НовСтрокаРасш.РасчетныйВес = ВесГр;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(НовСтрокаРасш.Вагон) И ВесГР = 0
//			И ЭтоВагоны Тогда
//			ПараметрыОтбора = Новый Структура;
//			Параметрыотбора.Вставить("НомерВагона",НовСтрокаРасш.Вагон.Наименование);
//			НайденныйВаг = Накладная.Вагоны.НайтиСтроки(ПараметрыОтбора);
//			// сделаем цикл по таблице на случай сборных грузов в вагоне
//			Для Каждого Стр Из НайденныйВаг Цикл
//				ВесГр = ВесГр + Стр.МассыВКгНетто;
//				ГРП = Стр.ГрузоподъемностьВТн;
//			КонецЦикла;
//			НовСтрокаРасш.ФактическийВес = ВесГр;
//			НовСтрокаРасш.РасчетныйВес = ВесГр;
//		КонецЕсли;
//	//Евросиб - АСуслов 08.06.2021 9:44:46 #0234389
//	//(
//	ИначеЕсли ЗначениеЗаполнено(СтрПоезда.Коносамент) Тогда
//		НовСтрокаРасш.ДатаОтправки = СтрПоезда.Коносамент.ДатаОтправления;	
//	//)
//	//Евросиб - АСуслов 08.06.2021 9:44:48 #0234389	
//	КонецЕсли;
//		
//		
//	НовСтрокаРасш.ВидПеревозки = СтрПоезда.Калькуляция.ПС_ВидПеревозки;
//	
//	ЗаполнитьЗначенияСвойств(НовСтрокаРасш, Нстр);
//	НовСтрокаРасш.СуммаНДС = Нстр.СуммаНДС / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	НовСтрокаРасш.Сумма = Нстр.Сумма / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	
//	НовСтрокаРасш.Услуга = Выборка.Услуга;
//	НовСтрокаРасш.СтрокаДоходовСделки = Выборка.ГУИД;
//	
//	Если ЗначениеЗаполнено(СтрПоезда.ЖДН) Тогда
//		РеквизитыЖДН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрПоезда.ЖДН, "СтанцияНазначения, СтанцияОтправления");
//		Если ЗначениеЗаполнено(РеквизитыЖДН.СтанцияНазначения)
//			И ЗначениеЗаполнено(РеквизитыЖДН.СтанцияОтправления) Тогда
//			НовСтрокаРАсш.ПунктОтправления = РеквизитыЖДН.СтанцияОтправления;
//			НовСтрокаРасш.ПунктНазначения = РеквизитыЖДН.СтанцияНазначения;
//		КонецЕсли; 
////Евросиб - АСуслов 31.08.2021 11:35:24 #
////(
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(НовСтрокаРАсш.ПунктОтправления) Тогда
//		НовСтрокаРасш.ПунктОтправления = Сделка.СтанцияОтправления;	
//	КонецЕсли; 
//	Если НЕ ЗначениеЗаполнено(НовСтрокаРАсш.ПунктНазначения) Тогда
//		НовСтрокаРасш.ПунктНазначения = Сделка.СтанцияНазначения;
//	КонецЕсли; 
////)
////Евросиб - АСуслов 31.08.2021 11:35:25 #
//	
//	
//	СтруктураСуммыВозмещаемые = Новый Структура("СуммаВознаграждения, СуммаНДСВознаграждения");
//	ЗаполнитьЗначенияСвойств(СтруктураСуммыВозмещаемые, НСтр);
//	Если СтруктураСуммыВозмещаемые.СуммаВознаграждения <> Неопределено Тогда
//		НовСтрокаРасш.СуммаВознаграждения = Нстр.СуммаВознаграждения / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//		НовСтрокаРасш.СуммаНДСВознаграждения = Нстр.СуммаНДСВознаграждения / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	КонецЕсли; 
//	
//	//Евросиб - АСуслов 13.09.2021 20:07:28 #33698
//	//(
//	НовСтрокаРасш.СтрокаСвязьУчетныхЕдиниц = СтрПоезда.ГУИД;
//	НовСтрокаРасш.Сделка = Сделка;
//	//)
//	//Евросиб - АСуслов 13.09.2021 20:07:41 #33698
//	
//	
//	//Попытка
//	//	НовСтрокаРасш.Комментарий = Выборка.Комментарий;
//	//	НовСтрокаРасш.ДатаНачалаПериодаПовагонки = Выборка.ДатаНачалаПериодаПовагонкиУчДок;
//	//	НовСтрокаРасш.ДатаОкончанияПериодаПовагонки = Выборка.ДатаОкончанияПериодаПовагонкиУчДок;
//	//Исключение
//	//КонецПопытки;
//	СтруктураЗаполненияПолей = Новый Структура("Комментарий, ДатаНачалаПериодаПовагонкиУчДок, ДатаОкончанияПериодаПовагонкиУчДок"
//												"", Дата(1,1,1), Дата(1,1,1));
//	ЗаполнитьЗначенияСвойств(СтруктураЗаполненияПолей, Выборка);
//	НовСтрокаРасш.Комментарий 					= СтруктураЗаполненияПолей.Комментарий;
//	НовСтрокаРасш.ДатаНачалаПериодаПовагонки 	= СтруктураЗаполненияПолей.ДатаНачалаПериодаПовагонкиУчДок;
//	НовСтрокаРасш.ДатаОкончанияПериодаПовагонки = СтруктураЗаполненияПолей.ДатаОкончанияПериодаПовагонкиУчДок;
//	
//							

//КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыСКурсомВалютПриИзменении(Элемент)
	
	Элементы.валюта_ДатаКурса.Видимость = (валюта_РежимРаботыСКурсомВалют = 1);
	//Дата курса может быть из счета, даты исф по правилам или из настройки на форме, 
	//поэтому оставим видимым
	//Элементы.ТЧГруппа1.Видимость = (валюта_РежимРаботыСКурсомВалют = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура валюта_ДатаКурсаПриИзменении(Элемент)
	
	Для каждого Стр из ТЧ Цикл
		
		ПересчетСуммыИСФНаДатуСчета = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Стр.ПСЦ, "ПересчетСуммыИСФНаДатуСчета");
		Если Стр.ФиксКурсВалюты > 0 
			И (СтрНайти(Стр.ВидДокумента,"Счет покупателю") > 0 
			ИЛИ ПересчетСуммыИСФнаДатуСчета) Тогда
			Стр.ДатаКурса = Дата(1,1,1);
			Стр.КурсВалюты = Стр.ФиксКурсВалюты;
			Стр.ФиксКурсВалюты = Стр.ФиксКурсВалюты;
		ИначеЕсли (СтрНайти(Стр.ВидДокумента, "Счет покупателю") > 0
			ИЛИ ПересчетСуммыИСФнаДатуСчета) Тогда 
			Стр.ДатаКурса = валюта_ДатаКурса;
			Стр.КурсВалюты = ПолучитьКурсВалютыПСЦНаДату(Стр.ДатаКурса, Стр.ПСЦ); 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Евросиб - АСуслов 05.10.2020 13:22:31 #
//(
//Функция ПолучитьКурсВалютыДоговораНаДату(ДатаКурса, Договор)
//	
//	РЕЗКУРС = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Договор.ВалютаВзаиморасчетов, ДатаКурса);
//	
//	Возврат РЕЗКУРС.Курс;
//	
//КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьКурсВалютыПСЦНаДату(ДатаКурса, ПСЦ)
	
	РЕЗКУРС = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПСЦ.Валюта, ДатаКурса);
	
	Возврат РЕЗКУРС.Курс;
	
КонецФункции
//)
//Евросиб - АСуслов 05.10.2020 13:22:32 #

//&НаКлиенте
//Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
//	
//	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
//		
//		МассивПФ = НапечататьКомплектНаСервере(ВыбранноеЗначение);
//		
//	Иначе
//		МассивПФ = НапечататьКомплектНаСервере(Неопределено);
//		
//	КонецЕсли;
//	
//	ДЛя каждого ЭлементСтруктуры из МассивПФ Цикл
//		
//		ПараметрКоманды = Новый Массив;
//		Для Каждого Эл Из ЭлементСтруктуры.МассивСсылокНаДок Цикл
//			ПараметрКоманды.Добавить(Эл);
//		КонецЦикла;
//		ОбластиОбъектов = Новый СписокЗначений;
//			
//		КоллекцияПечатныхФорм = Новый Массив;
//		Поля = УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм();
//		ДобавленныеПечатныеФормы = Новый Соответствие;
//		
//		Для Каждого Док Из ЭлементСтруктуры.МассивТДПоКлиенту Цикл
//			ДобавленныеПечатныеФормы = Новый Соответствие;
//			ПечатнаяФорма = Новый Структура(СтрСоединить(Поля, ","));
//			ПечатнаяФорма.ИмяМакета = Док.ИмяПФ;
//			ПечатнаяФорма.ИмяВРЕГ = ВРег(Док.ИмяПФ);
//			ПечатнаяФорма.СинонимМакета = Док.ИмяПФ;
//			ПечатнаяФорма.ТабличныйДокумент = Док.ТабДок;
//			ПечатнаяФорма.ИмяФайлаПечатнойФормы = Док.ИмяПФ;
//			ПечатнаяФорма.Экземпляров = 1;
//			ДобавленныеПечатныеФормы.Вставить(Док.ИмяПФ, ПечатнаяФорма);
//			КоллекцияПечатныхФорм.Добавить(ПечатнаяФорма);
//			
//		КонецЦикла;
//		
//		Если КоллекцияПечатныхФорм.Количество() <> 0 Тогда
//			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияпечатныхФорм,ОбластиОбъектов,,ПараметрКоманды);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	
//КонецПроцедуры

&НаКлиенте
Процедура ТЧДатаКурсаПриИзменении(Элемент)
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.КурсВалюты = ПолучитьКурсВалютыПСЦНаДату(ТекД.ДатаКурса, ТекД.ПСЦ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиУдаленныйДокументПоСделке(Сделка, Клиент, Договор);
	НайдДокумент = Неопределено;
	Запрос = Новый Запрос;
	//Евросиб СубботинВ #84453 02.07.2024 Начало // Сделку РТУ смотрим по ТЧ УСЛУГи

	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ 
	//|	РеализацияТоваровУслуг.Сделка = &Сделка 
	//|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	//|	И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
	//|	И РеализацияТоваровУслуг.ПометкаУдаления
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РеализацияТоваровУслуг.Дата";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ 
	|	РеализацияТоваровУслугУслуги.Сделка = &Сделка 
	|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент
	|	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И РеализацияТоваровУслугУслуги.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслугУслуги.Ссылка.Дата";
	//Евросиб СубботинВ #84453 02.07.2024 Конец

	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("Контрагент", Клиент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НайдДокумент = РезультатЗапроса.Выгрузить()[0].Ссылка; 	
	КонецЕсли; 
	Возврат НайдДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиУдаленныйДокументОтчетКомитентуПоСделке(Сделка, Клиент, Договор, Партия);
	НайдДокумент = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Сделка = &Сделка
	|	И ОтчетКомитентуОПродажах.Контрагент = &Контрагент
	|	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И ОтчетКомитентуОПродажах.ПометкаУдаления
	|	И ОтчетКомитентуОПродажах.Поставщики.Партия = &Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомитентуОПродажах.Дата";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("Контрагент", Клиент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("Партия", Партия);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НайдДокумент = РезультатЗапроса.Выгрузить()[0].Ссылка; 	
	КонецЕсли; 
	Возврат НайдДокумент;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьЭДО(Команда)
	
	//80515 Субботин 20.02.2024 начало
	Если НЕ КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РазрешитьОтправкуШтрафныхРТУ") Тогда 
		ШтрафныеРТУ = ПроверитьВозможностьПечатиДокументов(Истина);
		Если ШтрафныеРТУ.Количество()>0 Тогда
			ВызватьИсключение("Недостаточно прав для выполнения операции. Среди выбранных документов есть РТУ с признаком Штраф");
		КонецЕсли;
	КонецЕсли;
	//80515 Субботин 20.02.2024 Конец
	
	мКонтрагентыЭДО = Новый Массив;
	СтрокиЭДО = ТЧ.НайтиСтроки(Новый Структура("ЭДО, Пометка", Истина, Истина));
	Если СтрокиЭДО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	Для каждого СтрокаЭДО Из СтрокиЭДО Цикл
		Если мКонтрагентыЭДО.Найти(СтрокаЭДО.Контрагент) = Неопределено Тогда
			мКонтрагентыЭДО.Добавить(СтрокаЭДО.Контрагент);
		КонецЕсли; 
	КонецЦикла; 
	ПараметрыОткрытия = Новый Структура("ОтборПоКонтрагенту", мКонтрагентыЭДО);
	ОткрытьФорму("Обработка.КонтурЭДО.Форма.ФормаУправляемая", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьОтборПоОтветственному(Команда)
	Если ВидОтбораПоОтветственному = 1 Тогда
		ВидОтбораПоОтветственному = 0;
	Иначе
		ВидОтбораПоОтветственному = 1;
	КонецЕсли; 
	УстановитьПредставлениеКнопкиВидОтветственного();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеКнопкиВидОтветственного()
	
	Если ВидОтбораПоОтветственному = 0 Тогда
		//все ответственные
		Элементы.ТЧПереключитьОтборПоОтветственному.Картинка = БиблиотекаКартинок.ВариантыОтчетовДоступныеВсемПользователям;
		//Элементы.ТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура("ОтветственныйЗаУчет", Неопределено);
		Элементы.ТЧ.ОтборСтрок = Неопределено;
		
	Иначе
		ВидОтбораПоОтветственному = 1;
		//все ответственные
		Элементы.ТЧПереключитьОтборПоОтветственному.Картинка = БиблиотекаКартинок.СостояниеПользователя08;
		Элементы.ТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура("ОтветственныйЗаУчет", ПользователиКлиент.ТекущийПользователь());
	КонецЕсли; 
	СохранитьЗначениеНастройкиНаСервере("ВидОтбораПоОтветственному", ВидОтбораПоОтветственному);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьЗначениеНастройкиНаСервере(Параметр, Значение);

	ХранилищеНастроекДанныхФорм.Сохранить("СозданиеКомплектаДокументов", Параметр, Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиАктПоКоносаменту(Коносамент, Сделка)
	
	Акт = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО СделкаДоходы.УчДокумент = РеализацияТоваровУслугУслуги.Ссылка
	|			И (РеализацияТоваровУслугУслуги.СтрокаДоходовСделки = СделкаДоходы.ГУИД)
	|ГДЕ
	|	СделкаДоходы.Коносамент = &Коносамент
	|	И НЕ СделкаДоходы.Ссылка = &Сделка
	|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Коносамент", Коносамент);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		СтрокаРезультата = РезультатЗапроса.Выгрузить()[0].Ссылка;
		//Если КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СтрокаРезультата.Организация) < СтрокаРезультата.ДатаДокумента Тогда
		//ДИТ, Беляев СЮ, Ticket#0283330, 30-08-2022, начало
		//Евросиб Каблов 09.04.2025 ( #105407
		//Если КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СтрокаРезультата.Организация) <= СтрокаРезультата.ДатаДокумента Тогда
		Если КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(СтрокаРезультата.Организация) <= СтрокаРезультата.ДатаДокумента Тогда
		//Евросиб Каблов 09.04.2025 )
		//ДИТ, Беляев СЮ, Ticket#0283330, 30-08-2022, конец
			Акт = СтрокаРезультата.Ссылка;
		КонецЕсли; 
	КонецЕсли; 
	Возврат Акт;
	
КонецФункции

&НаКлиенте
Процедура ТЧПередНачаломИзменения(Элемент, Отказ)
	//Евросиб - АСуслов 25.05.2021 11:59:05 #
	//(
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если Элемент.ТекущийЭлемент.Имя = "ТЧСсылкаНаДокумент" Тогда
		Если ЗначениеЗаполнено(ТекД.СсылкаНаДокумент) Тогда
			ПоказатьЗначение(,ТекД.СсылкаНаДокумент);
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли; 
	//)
	//Евросиб - АСуслов 25.05.2021 11:59:06 #
КонецПроцедуры

// Евросиб Гудкова) 


//ДИТ Пак И.Т. Task34787 (Ticket#0206504)
&НаКлиенте
Функция СоздатьПакетПФВоВременномХранилище(ТЧ, МассивДокументов) Экспорт
	Возврат СоздатьПакетПФВоВременномХранилищеНаСервере(ТЧ, МассивДокументов);
КонецФункции

//ДИТ Пак И.Т. Task34787 (Ticket#0206504)
&НаСервереБезКонтекста
Функция СоздатьПакетПФВоВременномХранилищеНаСервере(ТЧ, МассивДокументов)
	
	//ЭтаФорма.ТЧ.Очистить();
	//Евросиб - АСуслов 18.10.2021 11:20:15 #
	//(
	//Переделал на безконтекстный вызов, ТЧ передаётся в параметре
	//)
	//Евросиб - АСуслов 18.10.2021 11:20:19 #
	ТЧ.Очистить();
	Для каждого ДокументСсылка Из МассивДокументов Цикл
		ДокСсылка = ДокументСсылка;
		СтрокаТЧ = ТЧ.Добавить();
		СтрокаТЧ.Пометка = Истина;
		СтрокаТЧ.ГруппировкаДаты = Дата(1,1,1);
		СтрокаТЧ.ВидДокумента = ДокСсылка.Метаданные().Имя;
		СтрокаТЧ.СсылкаНаДокумент = ДокСсылка;
		// ++ ДИТ_Агафонов_task 25372 06.10.2022
		//Также добавлен реквизит в ТЧ на форме
		СтрокаТЧ.СсылкаНаДокументПервоначальная = ДокСсылка;
		// -- ДИТ_Агафонов_task 25372 06.10.2022
		СтрокаТЧ.ДокументыСформированы = Истина;
		СтрокаТЧ.Контрагент = ДокСсылка.Контрагент;
		СтрокаТЧ.Договор = ДокСсылка.ДоговорКонтрагента;
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 29.11.2022
		// Было:
		//СтрокаТЧ.ОтветственныйЗаУчет = СтрокаТЧ.Договор.ОтветственныйЗаУчет; 
		//Стало:
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор",				СтрокаТЧ.Договор);
		СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
		СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
		СтрокаТЧ.ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 29.11.2022
	КонецЦикла;
	
	Результат = НапечататьКомплектНаСервере(ТЧ, Неопределено);
	Адрес = ПоместитьВоВременноеХранилище(Результат);
	Возврат Адрес;
	
КонецФункции

//++ДИТ Гаузер А.В. US BUG 53640, TA 56068 18.08.2022
&НаСервере
Функция ПолучитьГУИДСтрокДоходовСделки(Выборка)
	
	МассивГУИД = Новый Массив;
	ВыборкаГУИД = Выборка.Выбрать();
	Пока ВыборкаГУИД.Следующий() Цикл
		МассивГУИД.Добавить(ВыборкаГУИД.ГУИД);
	КонецЦикла;
	Возврат МассивГУИД;
		
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСчетОтчетПоГУИДСтроки(МассивГУИД)
	
	СтруктураОтчетСчет = Новый Структура;
	Отчет = Неопределено;
	Счет = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки В (&МассивГУИД)
	|	И НЕ ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет = Выборка.Ссылка;
	КонецЕсли;
	
	СтруктураОтчетСчет.Вставить("Отчет",Отчет);
	СтруктураОтчетСчет.Вставить("Счет",?(Отчет = Неопределено, Неопределено, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет,"СчетНаОплатуПокупателю")));
	
	Возврат СтруктураОтчетСчет;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиУдаленныйДокументОтчетКомитентуПоГУИДСтроки(МассивГУИД);
	НайдДокумент = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажах.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки В &МассивГУИД
	|	И ОтчетКомитентуОПродажах.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомитентуОПродажах.Дата";
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НайдДокумент = РезультатЗапроса.Выгрузить()[0].Ссылка; 	
	КонецЕсли; 
	Возврат НайдДокумент;
	
КонецФункции
//--ДИТ Гаузер А.В. US BUG 53640, TA 56068 18.08.2022

#Область ПеренесенныеПроцедуры

// Фролов 11.03.2022, таска 44976
// Процедуры перенесены в общий модуль "Работа со сделками сервер"

////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++                 
////функция возвращает одну из табличных частей элемента справочника "ФормированиеФинДокументов", исходя из принятых параметров 
//Функция ПолучитьТЗнастроекФормированияОписанияУслуг(Знач ТипДокумента, ПараметрыФФД)
//	ТЗ = Новый ТаблицаЗначений; 
//	Если ПараметрыФФД = Неопределено Тогда 
//		Возврат ТЗ;
//	КонецЕсли;
//	
//	ФормированиеФинДокументовСсылка = ПараметрыФФД.ФормированиеФинДокументовСсылка;
//	Если ФормированиеФинДокументовСсылка = Справочники.ФормированиеФинДокументов.ПустаяСсылка() Тогда
//		Возврат ТЗ;
//	КонецЕсли; 
//	ФормированиеФинДокументовОбъект = ФормированиеФинДокументовСсылка.ПолучитьОбъект();
//	ПараметрыОтбора = Новый Структура("Использование",Истина);
//	Если ТипДокумента = "Счет" Тогда
//		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора);
//	ИначеЕсли ТипДокумента = "Акт" Тогда
//		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);
//	Иначе
//		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиСчФ.Выгрузить(ПараметрыОтбора);
//	КонецЕсли;                                                                            
//	Возврат ТЗ;
//КонецФункции 
////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

////Функция ПолучитьСодержаниеУслуги(Сделка,Выборка,НайденныйКлиент,ТипДокумента,СчетНаАнгл, Контейнер = Неопределено, Вагон = Неопределено, КурсВалютыФрахт = Неопределено)
////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
//&НаСервере
//Функция ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,ТипДокумента,СчетНаАнгл, Контейнер = Неопределено, Вагон = Неопределено, КурсВалютыФрахт = Неопределено)
////ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
////	Если ЗначениеЗаполнено(Выборка.Коносамент) Тогда
//		//ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(Выборка.Клиент, Выборка.Калькуляция.ПС_ВидПеревозки, Сделка.ПовагонныеОтправки);
//		Если ПараметрыФФД <> Неопределено 
//			И ПараметрыФФД.ИспользоватьРасширенныеПараметры
//			//Евросиб - АСуслов 02.06.2021 10:50:49 #0233721
//			//(
//			И ЗначениеЗаполнено(ПараметрыФФД.ТекстРеализацииИИСФ) Тогда
//			//)
//			//Евросиб - АСуслов 02.06.2021 10:51:06 #0233721
//			СодержаниеУслуги = ПолучитьСодержаниеУслугиМорскойЭкспорт(Сделка, Выборка, КурсВалютыФрахт, ПараметрыФФД);
//			Возврат СодержаниеУслуги;
//		КонецЕсли;
////	КонецЕсли; 
//	// если клиент обычный, то стандартное заполнение содержания услуги
//	СодержаниеУслуги = "";

//	//Если НайденныйКлиент.Пустой() Тогда
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
//	Если ПараметрыФФД = Неопределено Тогда
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
//		СодержаниеУслуги = Выборка.Услуга.НаименованиеПолное + " по направлению " + Сделка.СтанцияОтправления + " - " + Сделка.СтанцияНазначения;
//		РейсВСделке = Сделка.Рейсы[0].Рейс;
//		//Для обычных клиентов Номер КП не нужен.
//		//Если ЗначениеЗаполнено(РейсВСделке) Тогда
//		//	НомерПоезда = ?(ТипЗнч(РейсВСделке) = Тип("СправочникСсылка.РейсыЖД")," КП №"+РейсВСделке.НомерПоезда,"");
//		//	СодержаниеУслуги = СодержаниеУслуги +  НомерПоезда;
//		//КонецЕсли;
//		Если Сделка.ТипЗаказа <> Справочники.ТипыЗаказов.ПовагоннаяОтправка Тогда
//			КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
//			Если КТКСписок <> Неопределено Тогда
//				 СодержаниеУслуги = СодержаниеУслуги + Символы.ПС + "Список контейнеров: " + КТКСписок.КТК;
//			КонецЕсли;
//		Иначе
//			ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
//			Если ВагоныСписок <> Неопределено Тогда
//				 СодержаниеУслуги = СодержаниеУслуги + Символы.ПС + "Список вагонов: " + ВагоныСписок.Вагон;
//			КонецЕсли;
//		КонецЕсли;
//		
//	// если клиент особый, то содержание услуги заполняется согласно образцу, заполненному в справочнике ФормированиеФинДокументов
//	// для данного клиента
//	//ИначеЕсли НЕ НайденныйКлиент.Пустой() И НЕ ИзОбработки Тогда
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
//	ИначеЕсли ПараметрыФФД <> Неопределено И НЕ ИзОбработки Тогда
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
//		КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
//		Если Контейнер <> Неопределено Тогда
//			КТКСписок = Новый Структура("КТК", Контейнер.Наименование);
//		КонецЕсли; 
//		ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
//		Если Вагон <> Неопределено Тогда
//			ВагоныСписок = Новый Структура("Вагон", Вагон.Наименование);
//		КонецЕсли; 
//		Если КТКСписок <> Неопределено ИЛИ Выборка.Сделка.ПовагонныеОтправки Тогда
//			// для набора контейнеров нужно получить список Гос номеров
//			Запрос = Новый Запрос;
//			Запрос.Текст =
//				
//			"ВЫБРАТЬ
//			|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
//			// ДИТ Поморцева Т.П. Заявка 37404(36099) 01.09.2021.
//			//|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия,
//			|	ЗаявкаСоставУслуги.АдресПогрузки КАК АдресПогрузки,
//			|	ЗаявкаСоставУслуги.АдресВыгрузки КАК АдресВыгрузки,
//			|	ВЫБОР
//			|		КОГДА ЗаявкаСоставУслуги.СтанцияОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//			//Евросиб - АСуслов 05.10.2021 18:05:38 #
//			//(
//			//|			ТОГДА ЗаявкаСоставУслуги.ПунктОтправления.Наименование
//			//|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияОтправления.Наименование
//			|			ТОГДА ЗаявкаСоставУслуги.ПунктОтправления.Представление
//			|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияОтправления.Представление
//			//)
//			//Евросиб - АСуслов 05.10.2021 18:05:39 #
//			|	КОНЕЦ КАК СтанцияОтправления,
//			|	ВЫБОР
//			|		КОГДА ЗаявкаСоставУслуги.СтанцияНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//			//Евросиб - АСуслов 05.10.2021 18:06:19 #
//			//(
//			//|			ТОГДА ЗаявкаСоставУслуги.ПунктНазначения.Наименование
//			//|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияНазначения.Наименование
//			|			ТОГДА ЗаявкаСоставУслуги.ПунктНазначения.Представление
//			|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияНазначения.Представление
//			//)
//			//Евросиб - АСуслов 05.10.2021 18:06:20 #
//			|	КОНЕЦ КАК СтанцияНазначения,
//			|	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента
//			|ИЗ
//			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
//			|ГДЕ
//			|	ЗаявкаСоставУслуги.Ссылка В(&Ссылка)
//			|   И ВЫБОР КОГДА &ПовагонныеОтправки ТОГДА &НомерВагона ПОДОБНО ""%"" + ЗаявкаСоставУслуги.Вагон.Наименование + ""%"" ИНАЧЕ
//			|	&НомерКТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%"" КОНЕЦ";

//						
//			//Запрос.УстановитьПараметр("Ссылка",Выборка.Заявка);
//			Запрос.УстановитьПараметр("Ссылка",Сделка.Заявки.ВыгрузитьКолонку("Заявка"));
//			// ДИТ Поморцва Т.П. Задача 0248387 29.10.21. начало
//			//Запрос.УстановитьПараметр("НомерВагона",ВагоныСписок.Вагон);
//			Если ВагоныСписок <> Неопределено Тогда
//				Запрос.УстановитьПараметр("НомерВагона",ВагоныСписок.Вагон);
//			Иначе
//				Запрос.УстановитьПараметр("НомерВагона","");
//			КонецЕсли;
//			// ДИТ Поморцва Т.П. Задача 0248387 29.10.21. конец
//			
//			Запрос.УстановитьПараметр("ПовагонныеОтправки",Выборка.Сделка.ПовагонныеОтправки);
//			
//			// ДИТ Поморцва Т.П. Задача 234920 25.06.21. начало
//			//Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
//			Если КТКСписок <> Неопределено Тогда
//				Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
//			Иначе
//				Запрос.УстановитьПараметр("НомерКТК","");
//			КонецЕсли;
//			// ДИТ Поморцва Т.П. Задача 234920 25.06.21. конец	
//			
//			НайденныеСтроки = Запрос.Выполнить().Выгрузить();
//			ГосНомерСписок = "";
//			ДатаПогрузки = "";
//			Маршрут = "";
//			МаршрутАвто = "";
//			РеестрКлиента = "";
//			Для Каждого СтрН Из НайденныеСтроки Цикл
//				ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
//				// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//				//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
//				РеестрКлиента = РеестрКлиента + " " + СокрЛП(СтрН.РеестрКлиента);
//				Если Маршрут = "" Тогда
//					Маршрут = СтрШаблон("%1 - %2", СтрН.СтанцияОтправления, СтрН.СтанцияНазначения);
//				КонецЕсли; 
//				Если МаршрутАвто = "" Тогда
//					МаршрутАвто = СтрШаблон("%1 - %2", СтрН.АдресПогрузки, СтрН.АдресВыгрузки);
//				КонецЕсли; 
//			КонецЦикла;
//			ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//			//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
//		КонецЕсли;
//		
//		// цикл по таблице справочника ФормированиеФинДокументов. Берем данные для формирования содержания услуги.
//		// таблицу берем в зависимости от типа документа, для которого нужно сформировать состав услуги
//		//ПараметрыОтбора = Новый Структура("Использование",Истина);
//		//Если ТипДокумента = "Счет" Тогда
//		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора);
//		//ИначеЕсли ТипДокумента = "Акт" Тогда
//		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);
//		//Иначе
//		//	ТЗ = НайденныйКлиент.Выгрузить();
//		//КонецЕсли;     
//		ТЗ = ПолучитьТЗнастроекФормированияОписанияУслуг(ТипДокумента, ПараметрыФФД);
//		
//		Для Каждого Стр Из ТЗ Цикл
//			ТекстСодержание = "";
//			//Попытка 
//			//	ТекстСодержание = Выборка[Стр.НазваниеРеквизита];
//			//Исключение
//			//КонецПопытки;
//			НуженПереводСтроки = Ложь;
//			Если Стр.НазваниеРеквизита = "Маршрут" И
//				НЕ СчетНаАнгл = Неопределено Тогда
//				ТекстСодержание = Выборка.МаршрутАнгл;
//			КонецЕсли;
//			Если Стр.НазваниеРеквизита = "НомерКТК" Тогда
//				Если КТКСписок <> Неопределено Тогда
//					ТекстСодержание = ТекстСодержание + Символы.ПС + КТКСписок.КТК;
//				КонецЕсли;
//			КонецЕсли;
//			Если Стр.НазваниеРеквизита = "НомерАвто" Тогда
//				ТекстСодержание = ГосНомерСписок;
//			КонецЕсли;
//			Если Стр.НазваниеРеквизита = "Вагон" Тогда
//				НуженПереводСтроки = Истина;
//				ТекстСодержание = СтрЗаменить(ВагоныСписок.Вагон,";",Символы.ПС);
//			КонецЕсли;
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
//			//Если Стр.НазваниеРеквизита = "ДатаПогрузки" Тогда
//			//	ТекстСодержание = ДатаПогрузки;
//			//КонецЕсли;
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец
//			Если Стр.НазваниеРеквизита = "Маршрут" Тогда
//				ТекстСодержание = ?(Маршрут="", Выборка.Маршрут, Маршрут);
//			КонецЕсли; 
//			Если Стр.НазваниеРеквизита = "МаршрутАвто" Тогда
//				ТекстСодержание = МаршрутАвто;
//			КонецЕсли; 
//			Если Стр.НазваниеРеквизита = "РеестрКлиента" Тогда
//				ТекстСодержание = РеестрКлиента;
//			КонецЕсли; 
//			Если Стр.НазваниеРеквизита = "Номенклатура" Тогда
//				ТекстСодержание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Услуга,"НаименованиеПолное");
//			КонецЕсли; 
//			
//			СодержаниеУслуги = СодержаниеУслуги + ?(НуженПереводСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
//			
//		КонецЦикла;
//		СодержаниеУслуги = СокрЛП(СодержаниеУслуги);
//		
//	// если данные изменяются из обработки, то нужно получить таблицу с маршрутом, 
//	// номером реестра и ДатаНазначенияФакт, по которым сформируем список КТК
//	//ИначеЕсли НЕ НайденныйКлиент.Пустой() И ИзОбработки Тогда 
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
//	ИначеЕсли ПараметрыФФД <> Неопределено И ИзОбработки Тогда
//	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
//		ДанныеИзОбработки = ПолучитьИзВременногоХранилища(КТКВХранилище);

//		// для повагонной отправки механизм не должен содержать информацию по номеру авто и водителю.
//		// достаточно получить сделку. а т.к. она одна в рамках выбранного периода, то не нужно проходить циклом по всем строкам
//		//Если НайденныйКлиент.Выгрузить()[0].ДанныеИзРеестраПовагонки Тогда
//		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
//		Если ПараметрыФФД.ДанныеИзРеестраПовагонки Тогда
//		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
//			Сделка = ДанныеИзОбработки[0].Сделка;
//		Иначе
//			ПараметрыОтбора = Новый Структура;
//			ПараметрыОтбора.Вставить("Маршрут",Выборка.Маршрут);
//			ПараметрыОтбора.Вставить("НомерРеестра",Выборка.РеестрКлиента);
//			ПараметрыОтбора.Вставить("ТипЗаказа",Выборка.ТипЗаказа);
//			// для каждого контейнера нужно получить из заявки Гос номер авто
//			Запрос = Новый Запрос;			
//			Запрос.Текст = "ВЫБРАТЬ
//			               |	ДанныеХран.Маршрут КАК Маршрут,
//			               |	ДанныеХран.ДатаПогрузки КАК ДатаПогрузки,
//			               |	ДанныеХран.НомерРеестра КАК НомерРеестра,
//			               |	ДанныеХран.ТипЗаказа КАК ТипЗаказа,
//			               |	ДанныеХран.Контейнер КАК Контейнер,
//			               |	ДанныеХран.Заявка КАК Заявка
//			               |ПОМЕСТИТЬ ВТ
//			               |ИЗ
//			               |	&ДанныеХран КАК ДанныеХран
//			               |;
//			               |
//			               |////////////////////////////////////////////////////////////////////////////////
//			               |ВЫБРАТЬ
//			               |	ВТ.Маршрут КАК Маршрут,
//			               |	ВТ.ДатаПогрузки КАК ДатаПогрузки,
//			               |	ВТ.НомерРеестра КАК НомерРеестра,
//			               |	ВТ.ТипЗаказа КАК ТипЗаказа,
//			               |	ВТ.Контейнер КАК Контейнер,
//			               |	ВТ.Заявка КАК Заявка,
//						   // ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
//						   //|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
//			               //|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия
//						   |	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто
//						   // ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец
//			               |ИЗ
//			               |	ВТ КАК ВТ
//			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
//			               |		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
//			               |			И ВТ.Контейнер = ЗаявкаСоставУслуги.НомерКТК";

//			// Нужно отбирать только те данные, которые по отбору подходят для текущей выборки
//			Запрос.УстановитьПараметр("ДанныеХран",ДанныеИзОбработки.Скопировать(ПараметрыОтбора));
//			НайденныеСтроки = Запрос.Выполнить().Выгрузить();
//			КТКСписок = "";
//			ГосНомерСписок = "";
//			ДатаПогрузки = "";
//			Для Каждого СтрН Из НайденныеСтроки Цикл
//				КТКСписок = КТКСписок + " " + СтрН.Контейнер;
//				ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
//				// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//				//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
//			КонецЦикла;
//			КТКСписок = СтрЗаменить(СокрЛП(КТКСписок)," ",", ");
//			ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//			//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
//		КонецЕсли;
//		
//		ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
//		
//		// цикл по таблице справочника ФормированиеФинДокументов. Берем данные для формирования содержания услуги.
//		// таблицу берем в зависимости от типа документа, для которого нужно сформировать состав услуги
//		//ПараметрыОтбора = Новый Структура("Использование",Истина);
//		//Если ТипДокумента = "Счет" Тогда
//		//	 ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора); 
//		//ИначеЕсли ТипДокумента = "Акт" Тогда
//		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);  
//		//Иначе
//		//	ТЗ = НайденныйКлиент.Выгрузить();
//		//КонецЕсли; 
//		ТЗ = ПолучитьТЗнастроекФормированияОписанияУслуг(ТипДокумента, ПараметрыФФД);
//			
//		Для Каждого Стр Из ТЗ Цикл
//			ТекстСодержание = "";
//			Попытка 
//				ТекстСодержание = Выборка[Стр.НазваниеРеквизита];
//			Исключение
//			КонецПопытки;
//			Если Стр.НазваниеРеквизита = "Маршрут" И
//				НЕ СчетНаАнгл = Неопределено Тогда
//				ТекстСодержание = Выборка.МаршрутАнгл;
//			КонецЕсли;
//			Если Стр.НазваниеРеквизита = "НомерКТК" Тогда
//				ТекстСодержание = ТекстСодержание + Символы.ПС + КТКСписок;
//			КонецЕсли;
//			Если Стр.НазваниеРеквизита = "НомерАвто" Тогда
//				ТекстСодержание = ТекстСодержание + ГосНомерСписок;
//			КонецЕсли;
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
//			//Если Стр.НазваниеРеквизита = "ДатаПогрузки" Тогда
//			//	ТекстСодержание = Формат(ТекстСодержание,"ДФ=dd.MM.yyyy HH:mm");
//			//КонецЕсли;
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец
//			Если Стр.НазваниеРеквизита = "Вагон" Тогда
//				ТекстСодержание = СтрЗаменить(ВагоныСписок.Вагон,";",Символы.ПС);
//			КонецЕсли;
//			СодержаниеУслуги = СодержаниеУслуги + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
//		КонецЦикла;
//		СодержаниеУслуги = СокрЛП(СодержаниеУслуги);
//	КонецЕсли;
//	
//	Возврат СодержаниеУслуги;
//	
//КонецФункции			

//&НаСервереБезКонтекста
//Функция ПолучитьСодержаниеУслугиМорскойЭкспорт(Сделка, Выборка, КурсВалютыФрахт, ПараметрыФФД)

//	ЗаменаСоответствие = Новый Соответствие;
//	СтруктураКоносамента = Новый Структура("НомерТранспортногоДокумента, 
//											|НомерБукинга,
//											|СтанцияОтправления,
//											|СтанцияНазначения");
//	Если ЗначениеЗаполнено(Выборка.Коносамент) Тогда
//		РеквизитыКоносамента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Коносамент, СтруктураКоносамента);   		
//	Иначе
//		РеквизитыКоносамента = Неопределено;
//	КонецЕсли; 
//	РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Калькуляция,"Курс, Валюта, ММ_ИтогоСтавка, ММ_ИтогоСтавка20");																					
//	ЗаменаСоответствие.Вставить("##КурсКалькуляции",РеквизитыКалькуляции.Курс) ;
//	ЗаменаСоответствие.Вставить("##КурсФрахта", КурсВалютыФрахт.Курс);
//	ЗаменаСоответствие.Вставить("##ДатаКурса", Формат(КурсВалютыФрахт.ДатаКурса,"ДФ=dd.MM.yyyy"));
//	ЗаменаСоответствие.Вставить("##ПунктОтправленияСуша", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияОтправления,"Наименование"));
//	ЗаменаСоответствие.Вставить("##ПунктНазначенияСуша", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияНазначения,"Наименование"));
//	Если РеквизитыКоносамента <> Неопределено Тогда
//		ЗаменаСоответствие.Вставить("##Коносамент", РеквизитыКоносамента.НомерТранспортногоДокумента);
//		ЗаменаСоответствие.Вставить("##Букинг", РеквизитыКоносамента.НомерБукинга);
//		ЗаменаСоответствие.Вставить("##ПунктОтправленияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"Наименование"));
//		ЗаменаСоответствие.Вставить("##ПунктНазначенияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"Наименование"));
//	Иначе
//		ЗаменаСоответствие.Вставить("##Коносамент", "");
//		ЗаменаСоответствие.Вставить("##Букинг", "");
//		ЗаменаСоответствие.Вставить("##ПунктОтправленияКС", "");
//		ЗаменаСоответствие.Вставить("##ПунктНазначенияКС", "");
//	КонецЕсли; 
//	//Евросиб Каблов 04.05.2021 (
//	//ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКалькуляции.Валюта,"СокращенноеНаименование"));
//	Если ЗначениеЗаполнено(РеквизитыКалькуляции.Валюта) Тогда
//		ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКалькуляции.Валюта,"СокращенноеНаименование"));
//	Иначе
//		ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", "");
//	КонецЕсли;
//	//Евросиб Каблов 04.05.2021 )
//	ЗаменаСоответствие.Вставить("##ВалютаФрахта", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КурсВалютыФрахт.Валюта,"СокращенноеНаименование"));	
//	//Евросиб Каблов 04.05.2021 (
//	//ЗаменаСоответствие.Вставить("##СписокКТК", Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД").КТК);
//	НайденнаяСтрокаКТК = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
//	Если НайденнаяСтрокаКТК <> Неопределено Тогда
//		ЗаменаСоответствие.Вставить("##СписокКТК", НайденнаяСтрокаКТК.КТК);
//	Иначе
//		ЗаменаСоответствие.Вставить("##СписокКТК", "");
//	КонецЕсли;
//	//Евросиб Каблов 04.05.2021 )
//	
//	ЗаменаСоответствие.Вставить("##СуммаКомплекснойСтавки", Формат(?(Выборка.РазмерКТК = Справочники.РазмерыКТК.К20, РеквизитыКалькуляции.ММ_ИтогоСтавка20, РеквизитыКалькуляции.ММ_ИтогоСтавка), "ЧДЦ=2; ЧН="));
//	
//	
//	ЗаменаСоответствие.Вставить("##Пункт_ОтправленияСушаENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияОтправления,"НаименованиеАнгл"));
//	ЗаменаСоответствие.Вставить("##Пункт_НазначенияСушаENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияНазначения,"НаименованиеАнгл"));
//	Если РеквизитыКоносамента <> Неопределено Тогда
//		ЗаменаСоответствие.Вставить("##Пункт_ОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"НаименованиеАнгл"));
//		ЗаменаСоответствие.Вставить("##Пункт_НазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"НаименованиеАнгл"));
//		
//		РегионОтправленияКС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"Родитель");
//		РегионНазначенияКС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"Родитель");
//		
//		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКС", РегионОтправленияКС);
//		ЗаменаСоответствие.Вставить("##Регион_НазначенияКС", РегионНазначенияКС);
//		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегионОтправленияКС, "НаименованиеАнгл"));
//		ЗаменаСоответствие.Вставить("##Регион_НазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегионНазначенияКС, "НаименованиеАнгл"));
//	Иначе
//		ЗаменаСоответствие.Вставить("##Пункт_ОтправленияКСENG", "");
//		ЗаменаСоответствие.Вставить("##Пункт_НазначенияКСENG", "");
//		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКС", "");
//		ЗаменаСоответствие.Вставить("##Регион_НазначенияКС", "");
//		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКСENG", "");
//		ЗаменаСоответствие.Вставить("##Регион_НазначенияКСENG", "");
//	КонецЕсли; 
//	
//	//Евросиб - АСуслов 27.04.2021 13:20:46 #
//	//(
//	ЗаменаСоответствие["##ПогранПереходОтправление"] = Сделка.ПогранпереходИзСтраныОтправления.Наименование;
//	ЗаменаСоответствие["##ПогранПереходПрибытие"] = Сделка.ПогранпереходВСтрануНазначения.Наименование;
//	ЗаменаСоответствие["##ПогранПереходОтправлениеENG"] = Сделка.ПогранпереходИзСтраныОтправления.НаименованиеАнгл;
//	ЗаменаСоответствие["##ПогранПереходПрибытиеENG"] = Сделка.ПогранпереходВСтрануНазначения.НаименованиеАнгл;
//	
//	ЗаменаСоответствие["##НомерРеестраКлиента"] = Выборка.РеестрКлиента;
//	
//	СтруктураДанныхПоЗаявке = ПолучитьДанныеПоЗаявке(Выборка, Сделка);
//	
//	ЗаменаСоответствие["##НомерАвтоВывоза"] = СтруктураДанныхПоЗаявке.ГосНомерСписок;
//	ЗаменаСоответствие["##ДатаПодачиАвто"] = Формат(СтруктураДанныхПоЗаявке.ДатаПодачиАвтоПодПогрузку,"ДФ=dd.MM.yyyy");
//	
//	ЗаменаСоответствие["##РегионОтправленияСуша"] 	= СтруктураДанныхПоЗаявке.РегионОтравленияСуша;
//	ЗаменаСоответствие["##РегионНазначенияСуша"] = СтруктураДанныхПоЗаявке.РегионНазначенияСуша;
//	
//	ЗаменаСоответствие["##АдресДоставкиГруза"] 	= СтруктураДанныхПоЗаявке.АдресВыгрузки;
//	ЗаменаСоответствие["##АдресЗабораГруза"] = СтруктураДанныхПоЗаявке.АдресПогрузки;
//                             
//                                 

//	//)
//	//Евросиб - АСуслов 27.04.2021 13:20:47 #
//	
//	Если Выборка.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") Тогда
//		ШаблонСодержания = ПараметрыФФД.ТекстРеализацииИИСФФрахт;
//	Иначе
//		ШаблонСодержания = ПараметрыФФД.ТекстРеализацииИИСФ;
//	КонецЕсли; 
//	Для каждого Замена Из ЗаменаСоответствие Цикл
//		ШаблонСодержания = СтрЗаменить(ШаблонСодержания, Замена.Ключ, Замена.Значение);	
//	КонецЦикла; 
//	Возврат ШаблонСодержания;
//	
//КонецФункции 

//&НаСервереБезКонтекста
//Функция ПолучитьДанныеПоЗаявке(Выборка, Сделка)
//	КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");	
//	Если КТКСписок <> Неопределено Тогда
//		// для набора контейнеров нужно получить список Гос номеров
//		Запрос = Новый Запрос;
//		Запрос.Текст =		
//		"ВЫБРАТЬ
//		|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
//		// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//		//|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия,
//		|	ЗаявкаСоставУслуги.АдресПогрузки КАК АдресПогрузки,
//		|	ЗаявкаСоставУслуги.АдресВыгрузки КАК АдресВыгрузки,
//		|	ЗаявкаСоставУслуги.ПунктОтправления.Наименование КАК ПунктОтправленияСуша,
//		|	ЗаявкаСоставУслуги.ПунктНазначения.Наименование КАК ПунктНазначенияСуша,
//		|	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
//		|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодПогрузку КАК ДатаПодачиАвтоПодПогрузку
//		|ИЗ
//		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
//		|ГДЕ
//		|	ЗаявкаСоставУслуги.Ссылка В(&Ссылка)
//		|	И &НомерКТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%""";
//		
//		//Запрос.УстановитьПараметр("Ссылка",Выборка.Заявка);
//		Запрос.УстановитьПараметр("Ссылка",Сделка.Заявки.ВыгрузитьКолонку("Заявка"));
//		Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
//		НайденныеСтроки = Запрос.Выполнить().Выгрузить();
//		ГосНомерСписок = "";
//		ДатаПогрузки = "";
//		ДатаПодачиАвтоПодПогрузку = Дата(1,1,1);
//		Маршрут = "";
//		МаршрутАвто = "";
//		РеестрКлиента = "";
//		РегионОтправления = Новый Массив;
//		РегионНазначения = Новый Массив;
//		мАдресПогрузки = Новый Массив;
//		мАдресВыгрузки = Новый Массив;
//		Для Каждого СтрН Из НайденныеСтроки Цикл
//			ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
//			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//			//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
//			РеестрКлиента = РеестрКлиента + " " + СокрЛП(СтрН.РеестрКлиента);
//			РегионОтправления.Добавить(СтрН.ПунктОтправленияСуша);
//			РегионНазначения.Добавить(СтрН.ПунктНазначенияСуша);
//			ДатаПодачиАвтоПодПогрузку = Макс(ДатаПодачиАвтоПодПогрузку, СтрН.ДатаПодачиАвтоПодПогрузку);
//			мАдресПогрузки.Добавить(СтрН.АдресПогрузки);
//			мАдресВыгрузки.Добавить(СтрН.АдресВыгрузки);
//		КонецЦикла;
//		РегионОтправления = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(РегионОтправления);
//		РегионНазначения = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(РегионНазначения);
//		мАдресПогрузки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(мАдресПогрузки);
//		мАдресВыгрузки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(мАдресВыгрузки);
//		ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
//		// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
//		//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
//		РегионОтравленияСуша = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионОтправления, ";");
//		РегионНазначенияСуша = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионНазначения, ";");
//		АдресПогрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионОтправления, ";");
//		АдресВыгрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионНазначения, ";");
//	КонецЕсли;
//	Возврат Новый Структура("ГосНомерСписок, ДатаПодачиАвтоПодПогрузку, РегионОтравленияСуша, РегионНазначенияСуша, АдресПогрузки, АдресВыгрузки",
//							ГосНомерСписок, ДатаПогрузки, РегионОтравленияСуша, РегионНазначенияСуша, АдресПогрузки, АдресВыгрузки);
//КонецФункции

#КонецОбласти

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец  

//80515 Субботин 14.02.2024 начало	
Функция	ПроверитьВозможностьПечатиДокументов(ПроверкаЭДО = Ложь) 
	
	Если ПроверкаЭДО = Ложь Тогда	
		ТЗДляПечати = ТЧ.Выгрузить(Новый Структура("Пометка", Истина));
	Иначе
		ТЗДляПечати = ТЧ.Выгрузить(Новый Структура("ЭДО, Пометка", Истина, Истина));
	КонецЕсли;
	РезультатПроверки = Новый Массив;
 
	МассивРТУ = Новый Массив;
	Для Каждого Док из ТЗДляПечати Цикл
		Если ЗначениеЗаполнено(Док.СсылкаНаДокумент) И ТипЗнч(Док.СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			МассивРТУ.Добавить(Док.СсылкаНаДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ МассивРТУ.Количество() = 0 Тогда	
		Если НЕ КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РазрешитьОтправкуШтрафныхРТУ") Тогда
			РезультатПроверки = Документы.РеализацияТоваровУслуг.ПроверитьВозможностьПечатиРТУ(МассивРТУ);
			Если РезультатПроверки.Количество() >0 Тогда
				//ВызватьИсключение("В списке выбранных документов выбраны РТУ с признаком Штраф. Нехватает прав для выполнения данного действия");	
				Возврат РезультатПроверки
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Возврат РезультатПроверки
	
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросПользователю(ШтрафныеРТУ) 
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяПоИсключениюРТУ",
	ЭтаФорма, Новый Структура("ШтрафныеРТУ", ШтрафныеРТУ));
	ПоказатьВопрос(ОпОп,"Среди выбранных РТУ есть документы с признаком Штраф.
	|Исключить эти документы и продолжить печать?", РежимДиалогаВопрос.ОКОтмена);		
	Возврат
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОтветаПользователяПоИсключениюРТУ(ОтветПользователя = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОтветПользователя = Неопределено Тогда Возврат; КонецЕсли; 
	Если ОтветПользователя = КодВозвратаДиалога.ОК Тогда 	
		ШтрафныеРТУ = ДопПараметры.ШтрафныеРТУ;		
		МассивПФ = УдалитьШтрафныеПакетыДокументовИзСписка(ШтрафныеРТУ);
		НапечататьКомплектДокументов(МассивПФ, Неопределено);
	КонецЕсли;	
	
КонецПроцедуры 

Функция УдалитьШтрафныеПакетыДокументовИзСписка(ШтрафныеРТУ)
	
	ТЗДляПечати = ТЧ.Выгрузить(Новый Структура("Пометка", Истина));
	Для Каждого РТУ из ШтрафныеРТУ Цикл
		СтруктураПоиска = Новый Структура("СсылкаНаДокумент", РТУ);
		СтрокиПодУдаление = ТЗДляПечати.НайтиСтроки(СтруктураПоиска);
		Если НЕ СтрокиПодУдаление = 0 Тогда
			Для каждого СтрокаПодУдаление Из СтрокиПодУдаление Цикл
				ИдентификаторШтрафоногоПакета= СтрокаПодУдаление.ИдентификаторПакета;
				СтруктураПоискаДляОчистки = Новый Структура("ИдентификаторПакета",ИдентификаторШтрафоногоПакета);
				УдаляемыеСтрокиПакета = ТЗДляПечати.НайтиСтроки(СтруктураПоискаДляОчистки);
				Для каждого СтрокаТЗ Из УдаляемыеСтрокиПакета Цикл
					ТЗДляПечати.Удалить(СтрокаТЗ);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат ПечатьКомплектаДокументов.НапечататьКомплектНаСервере(ТЗДляПечати, Неопределено, Истина);
КонецФункции 

&НаКлиенте
Процедура НапечататьКомплектДокументов(МассивПФ, ПараметрКоманды = Неопределено) 
	
	ПечатьКомплектаДокументов.НапечататьКомплект(МассивПФ, ПараметрКоманды);
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
&НаСервере
Функция НайтиАвансовыеСчетаПоВР(ДокументСделка, Контрагент, Договор)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлючевыеСобытияСделки.Документ КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СчетаИзСобытийСделки
	|ИЗ
	|	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	|ГДЕ
	|	НЕ КлючевыеСобытияСделки.Услуга = &УслугаФрахт
	|	И КлючевыеСобытияСделки.Событие = ""Создание счета""
	|	И КлючевыеСобытияСделки.Сделка В
	|			(ВЫБРАТЬ
	|				составпоезда.Заявка
	|			ИЗ
	|				документ.сделка.связьучетныхединиц КАК составпоезда
	|			ГДЕ
	|				составпоезда.Ссылка = &Сделка)
	|	И КлючевыеСобытияСделки.КТК В
	|			(ВЫБРАТЬ
	|				составпоезда.Контейнер
	|			ИЗ
	|				документ.сделка.связьучетныхединиц КАК составпоезда
	|			ГДЕ
	|				составпоезда.Ссылка = &Сделка)
	|	И НЕ КлючевыеСобытияСделки.Документ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ ВТ_СчетаОтбор
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СчетНаОплатуПокупателюДокументыОснования.Ссылка
	|					ИЗ
	|						Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|					ГДЕ
	|						СчетНаОплатуПокупателюДокументыОснования.Сделка = &Сделка)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаИзСобытийСделки.Ссылка
	|					ИЗ
	|						ВТ_СчетаИзСобытийСделки КАК ВТ_СчетаИзСобытийСделки)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю,
	|	СчетаПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	СчетаПокупателейОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетПокупателю В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Отбор.СчетПокупателю
	|					ИЗ
	|						ВТ_СчетаОтбор КАК ВТ_Отбор)
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СчетаПокупателейОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОстаток УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаОтбор.СчетПокупателю КАК СчетПокупателю,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница.Наименование КАК УчетнаяЕдиницаНаименование,
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	|	,СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|ИЗ
	|	ВТ_СчетаОтбор КАК ВТ_СчетаОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетНаОплатуПокупателюУчетныеЕдиницы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|			ПО СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка = СчетНаОплатуПокупателюТовары.Ссылка
	|				И СчетНаОплатуПокупателюУчетныеЕдиницы.ИдентификаторСтрокиУслуг = СчетНаОплатуПокупателюТовары.Идентификатор
	|		ПО ВТ_СчетаОтбор.СчетПокупателю = СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСделка, "Организация"));
	Запрос.УстановитьПараметр("Сделка", ДокументСделка);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("УслугаФрахт", Справочники.Номенклатура.НайтиПоНаименованию("Фрахт"));
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	КоличествоВПакете = РезультатЗапросаПакет.Количество();

	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("ТаблицаСчетов", РезультатЗапросаПакет[КоличествоВПакете-2].Выгрузить());
	СтруктураРезультат.Вставить("ТаблицаУчетныеЕдиницыСчетов", РезультатЗапросаПакет[КоличествоВПакете-1].Выгрузить());
	
	Возврат СтруктураРезультат;
		
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
&НаСервере
Функция ПолучитьСчетаПокупателюИмеющиеся(ДанныеПоАвансовымСчетам, ГуидДоходов, Номенклатура, НомераКТК, НомераВагонов)
	
	ТаблицаСчетов = ДанныеПоАвансовымСчетам.ТаблицаСчетов;
	ТаблицаУчетныеЕдиницыСчетов = ДанныеПоАвансовымСчетам.ТаблицаУчетныеЕдиницыСчетов;
	
	Если ЗначениеЗаполнено(НомераКТК) Тогда
		МассивНомеровКТК = СтрРазделить(НомераКТК, ";");
	КонецЕсли; 
	Если ЗначениеЗаполнено(НомераВагонов) Тогда
		МассивНомеровВагонов = СтрРазделить(НомераВагонов, ";");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаСчетов.СчетПокупателю КАК Документ.СчетНаОплатуПокупателю) КАК СчетПокупателю,
	|	ТаблицаСчетов.Номенклатура КАК Номенклатура,
	|	ТаблицаСчетов.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУчетныеЕдиницыСчетов.СчетПокупателю КАК СчетПокупателю,
	|	ТаблицаУчетныеЕдиницыСчетов.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	ТаблицаУчетныеЕдиницыСчетов.УчетнаяЕдиницаНаименование КАК УчетнаяЕдиницаНаименование,
	|	ТаблицаУчетныеЕдиницыСчетов.Номенклатура КАК Номенклатура
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	|	,ТаблицаУчетныеЕдиницыСчетов.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|ПОМЕСТИТЬ ВТ_ТаблицаУчетныеЕдиницыСчетов
	|ИЗ
	|	&ТаблицаУчетныеЕдиницыСчетов КАК ТаблицаУчетныеЕдиницыСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетов.СчетПокупателю КАК СчетПокупателю,
	|	ВТ_ТаблицаУчетныеЕдиницыСчетов.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	ВТ_ТаблицаУчетныеЕдиницыСчетов.УчетнаяЕдиницаНаименование КАК УчетнаяЕдиницаНаименование,
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	|	ВТ_ТаблицаУчетныеЕдиницыСчетов.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|	ВТ_ТаблицаСчетов.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры
	|ИЗ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетов КАК ВТ_ТаблицаУчетныеЕдиницыСчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаСчетов КАК ВТ_ТаблицаСчетов
	|		ПО (ВТ_ТаблицаСчетов.СчетПокупателю = ВТ_ТаблицаУчетныеЕдиницыСчетов.СчетПокупателю)
	|			И (ВТ_ТаблицаСчетов.Номенклатура = ВТ_ТаблицаУчетныеЕдиницыСчетов.Номенклатура)
	|			И (ВТ_ТаблицаСчетов.Номенклатура = &Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СчетПокупателю КАК СчетПокупателю,
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СуммаОстаток КАК СуммаОстаток
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	|	,ВЫБОР КОГДА ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = &ГуидДоходов 
	|			ТОГДА 1
	|			ИНАЧЕ 0 КОНЕЦ КАК СоответствуетГУИДдохода
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|ИЗ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры КАК ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры
	|ГДЕ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.УчетнаяЕдиницаНаименование В(&МассивНомеровКТК)
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало (берем счета только с совпадающим ГУИД дохода или счета без ГУИД дохода, т.е. созданные не из Сделки)
	|	И (ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = &ГуидДоходов ИЛИ ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = """")
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СчетПокупателю КАК СчетПокупателю,
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СуммаОстаток КАК СуммаОстаток
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	|	,ВЫБОР КОГДА ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = &ГуидДоходов 
	|			ТОГДА 1
	|			ИНАЧЕ 0 КОНЕЦ КАК СоответствуетГУИДдохода
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	|ИЗ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры КАК ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры
	|ГДЕ
	|	ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.УчетнаяЕдиницаНаименование В(&МассивНомеровВагонов)
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало (берем счета только с совпадающим ГУИД дохода или счета без ГУИД дохода, т.е. созданные не из Сделки)
	|	И (ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = &ГуидДоходов ИЛИ ВТ_ТаблицаУчетныеЕдиницыСчетовНужнойНоменклатуры.СтрокаДоходовСделки = """")";
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
	Запрос.УстановитьПараметр("ТаблицаУчетныеЕдиницыСчетов", ТаблицаУчетныеЕдиницыСчетов);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("МассивНомеровКТК", МассивНомеровКТК);
	Запрос.УстановитьПараметр("МассивНомеровВагонов", МассивНомеровВагонов);
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	Запрос.УстановитьПараметр("ГуидДоходов", ГуидДоходов);
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	КоличествоВПакете = РезультатЗапросаПакет.Количество();
	
	ТаблицаСчетаПоКТК = РезультатЗапросаПакет[КоличествоВПакете-2].Выгрузить();
	ТаблицаСчетаПоВагону = РезультатЗапросаПакет[КоличествоВПакете-1].Выгрузить();
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	ТаблицаСчетаПоКТК.Сортировать("СоответствуетГУИДдохода УБЫВ");
	ТаблицаСчетаПоВагону.Сортировать("СоответствуетГУИДдохода УБЫВ");
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	
	РезультатФункции = Новый ТаблицаЗначений;
	
	Если ТаблицаСчетаПоКТК.Количество() > 0 Тогда
		РезультатФункции = ТаблицаСчетаПоКТК;
	ИначеЕсли ТаблицаСчетаПоВагону.Количество() > 0 Тогда
		РезультатФункции = ТаблицаСчетаПоВагону;
	КонецЕсли; 
	
	Возврат РезультатФункции;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
Процедура ДобавитьВТаблицуИнформированияПоСчетам(ТаблицаИнформированияПоСчетам, СчетНаОплатуПокупателю, НомераКТК, ФлагСчетНовый)
	СтрокаТаблицыИнформирования = ТаблицаИнформированияПоСчетам.Добавить();
	СтрокаТаблицыИнформирования.СчетНаОплатуПокупателю = СчетНаОплатуПокупателю;
	СтрокаТаблицыИнформирования.НомераКТК = НомераКТК;
	СтрокаТаблицыИнформирования.ФлагСчетНовый = ФлагСчетНовый;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
Процедура ВывестиСообщенияОСчетах(ТаблицаИнформированияПоСчетам)
	
	ВыведеноСообщениеОСозданииСчетов = Ложь;
	Для Каждого СтрокаТаблицы Из ТаблицаИнформированияПоСчетам.НайтиСтроки(Новый Структура("ФлагСчетНовый", Истина)) Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 по части ктк %2 был создан", СтрокаТаблицы.СчетНаОплатуПокупателю, СтрокаТаблицы.НомераКТК));
		ВыведеноСообщениеОСозданииСчетов = Истина;
	КонецЦикла;
	
	Если Не ВыведеноСообщениеОСозданииСчетов Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаИнформированияПоСчетам.НайтиСтроки(Новый Структура("ФлагСчетНовый", Ложь)) Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 по всем ктк %2 был создан ранее", СтрокаТаблицы.СчетНаОплатуПокупателю, СтрокаТаблицы.НомераКТК));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
Функция ПолучитьСтруктуру_ТаблицаИнформированияПоСчетам()
	ТаблицаИнформированияПоСчетам = Новый ТаблицаЗначений;
	ТаблицаИнформированияПоСчетам.Колонки.Добавить("СчетНаОплатуПокупателю", Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПокупателю"));
	ТаблицаИнформированияПоСчетам.Колонки.Добавить("НомераКТК", Новый ОписаниеТипов("Строка"));
	ТаблицаИнформированияПоСчетам.Колонки.Добавить("ФлагСчетНовый", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаИнформированияПоСчетам;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
Процедура УменьшитьСуммуНаВеличинуАвансовогоСчетаПоВР(НовДок, ДанныеПоАвансовымСчетам, Выборка, НовСтр, ТаблицаИнформированияПоСчетам, ПредыдущийСчет)
	ТаблицаСчетовПокупателю = ПолучитьСчетаПокупателюИмеющиеся(ДанныеПоАвансовымСчетам, Выборка.ГУИД, Выборка.Услуга, Выборка.НомераКТК, Выборка.НомераВагонов);
	Если ТаблицаСчетовПокупателю.Количество() > 0 Тогда
		Для Каждого СтрокаСчета Из ТаблицаСчетовПокупателю Цикл
			ПредыдущийСчет = СтрокаСчета.СчетПокупателю;
			НовСтр.Сумма = ?(НовСтр.Сумма - СтрокаСчета.СуммаОстаток > 0, НовСтр.Сумма - СтрокаСчета.СуммаОстаток, 0);
			НовСтр.СуммаНДС = НовСтр.Сумма * БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтр.СтавкаНДС)/?(НовДок.СуммаВключаетНДС, 120, 100);
			ДобавитьВТаблицуИнформированияПоСчетам(ТаблицаИнформированияПоСчетам, СтрокаСчета.СчетПокупателю, Выборка.НомераКТК, Ложь);
			Если НовСтр.Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
 //80515 Субботин 14.02.2024 Конец

//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, начало
Процедура РаспределитьКопейкиОтСуммыРассчитаннойБезОкругления( ТЧДокумента, СуммаБезОкругления, ИмяКолонкиТЧ )
	
	МассивСумм = ТЧДокумента.ВыгрузитьКолонку(ИмяКолонкиТЧ);
	
	РаспределениеСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ОКР(СуммаБезОкругления,2), МассивСумм);

	Если РаспределениеСумм <> Неопределено Тогда
		Для ИндексСтроки = 0 По ТЧДокумента.Количество() - 1 Цикл
			СтрокаОтчета = ТЧДокумента[ИндексСтроки];
			СтрокаОтчета[ИмяКолонкиТЧ] = РаспределениеСумм[ИндексСтроки];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 110097 / TA 110115, 21-05-2025, конец
