
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Дата = ТекущаяДата();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	КоличествоБНКонтейнеров = 0;
	КоличествоКонтейнеров = 0;
	
	ДнейДоНачалаИнформированияОСдаче = Константы.ЗаСколькоДоСрокаВозвратаКТКИнформироватьПользователей.Получить();
	
	Для Каждого Стр Из Контейнеры Цикл
		
		//Если Стр.ДатаВзятияИзСтока<Дата Тогда
		//	Сообщить("Дата взятия из стока не может быть ранее даты документа. Контрагент " + Стр.Контрагент + " дата " + Стр.ДатаВзятияИзСтока);
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Контейнер) И ЗначениеЗаполнено(Стр.ТипКонтейнера) 
			//Евросиб Гудкова( 19.05.2020 Ticket№ 
			И Стр.Контейнер.ТипТЕ <> Стр.ТипКонтейнера
			// Евросиб Гудкова) 
			Тогда
			КОбъект = Стр.Контейнер.ПолучитьОбъект();
			КОбъект.ТипТЕ = Стр.ТипКонтейнера;
			Кобъект.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Контейнер) Тогда
			КоличествоКонтейнеров = КоличествоКонтейнеров + 1;
			Если ЗначениеЗаполнено(Стр.ДатаВзятияИзСтока) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	РассылкаПоСдачеКТК.Период КАК Период,
				               |	РассылкаПоСдачеКТК.Контейнер КАК Контейнер,
				               |	РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней КАК ИнформироватьЗаКолвоДней,
				               |	РассылкаПоСдачеКТК.ДатаСдачи КАК ДатаСдачи,
				               |	РассылкаПоСдачеКТК.ОтправленоПоКлиенту КАК ОтправленоПоКлиенту,
				               |	РассылкаПоСдачеКТК.ОтправленоПоВладельцу КАК ОтправленоПоВладельцу,
				               |	РассылкаПоСдачеКТК.ВладелецКТК КАК ВладелецКТК,
				               |	РассылкаПоСдачеКТК.ДоговорВладельца КАК ДоговорВладельца
				               |ИЗ
				               |	РегистрСведений.РассылкаПоСдачеКТК КАК РассылкаПоСдачеКТК
				               |ГДЕ
				               |	РассылкаПоСдачеКТК.Период = &ДатаВыдачи
				               |	И РассылкаПоСдачеКТК.Контейнер = &Контейнер";
				Запрос.УстановитьПараметр("ДатаВыдачи",Стр.ДатаВзятияИзСтока);
				Запрос.УстановитьПараметр("Контейнер",Стр.Контейнер);
				РЗ = Запрос.Выполнить();
				// внести данные в РС РассылкаПоСдачеКТК. по умолчанию в качестве 
				// ИнформироватьЗаКолвоДней устанавливается значение константы 
				// ЗаСколькоДоСрокаВозвратаКТКИнформироватьПользователей.
				// установка срока возможна только для номерных позиций
				Если РЗ.Пустой() Тогда
					МенеджерЗаписи = РегистрыСведений.РассылкаПоСдачеКТК.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = Стр.ДатаВзятияИзСтока;
					МенеджерЗаписи.Контейнер = Стр.Контейнер;
					МенеджерЗаписи.ВладелецКТК = Стр.Контрагент;
					МенеджерЗаписи.ДоговорВладельца = Стр.ПСЦ.Договор;
					МенеджерЗаписи.ИнформироватьЗаКолвоДней = ДнейДоНачалаИнформированияОСдаче;
					МенеджерЗаписи.ДатаСдачи = Стр.ДатаВзятияИзСтока + Стр.СрокВозврата*3600*24;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			КоличествоБНКонтейнеров = КоличествоБНКонтейнеров + Стр.КоличествоБНКонтейнеров;
		КонецЕсли;
		
		
	КонецЦикла;
	КоличествоКонтейнеровВсего = Контейнеры.Итог("КоличествоБНКонтейнеров");
	

	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

   // очистка старых движений регистра (на всякий случай), чтобы не учитывались его движения
    Движения.КонтейнерыВСтоках.Очистить();
    Движения.КонтейнерыВСтоках.Записывать = Истина;
    Движения.Записать();	
	
	// найти все предыдущие данные по этому стоку, владельцу, направлению и сделать по ним
	// расходные движения (только по тем, у которых остаток больше 0), чтобы текущим документом показать актуальные остатки по стоку
	
	// SIV 02-09-20 - закомментировал блок. Сток не должен сторнировать старые проводки. 
	// Каждый документ добавляет ЕЩЕ контейнеров в сток, но не трогает предыдущие
	
	// Шейкина 02-09-20 - откомментировала блок. Сток должен сторнировать старые проводки. 
	// Иначе при проведении нового документа у нас пойдет задвоение записей, т.к. документ является регистратором для
	// РН КонтейнерыВСтоках.
	// Каждый документ добавляет ЕЩЕ контейнеров в сток, но не трогает предыдущие
	
	// Продам гараж.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстатки.Контейнер КАК Контейнер,
	               |	КонтейнерыВСтокахОстатки.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстатки.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстатки.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстатки.ДатаПриемаВСток КАК ДатаПриемаВСток,
	               |	КонтейнерыВСтокахОстатки.СрокВозврата КАК СрокВозврата,
	               |	КонтейнерыВСтокахОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.Остатки(&ДатаДокумента, Контейнер В (&НашиКТК)) КАК КонтейнерыВСтокахОстатки
	               |ГДЕ
	               |	КонтейнерыВСтокахОстатки.КоличествоОстаток <> 0";
	//Запрос.УстановитьПараметр("Сток", Сток);
	Запрос.УстановитьПараметр("НашиКТК", Контейнеры.Выгрузить().ВыгрузитьКолонку("Контейнер"));
	Запрос.УстановитьПараметр("ДатаДокумента",Дата);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Для каждого СтрокаКТК из Контейнеры Цикл
		
		Для каждого СтрокаОстатков из ТЗ Цикл
			
			//Если СтрокаКТК.Контейнер = СтрокаОстатков.Контейнер И (Сток <> СтрокаОстатков.Сток ИЛИ СтрокаКТК.Контрагент <> СтрокаОстатков.Контрагент) Тогда
				
				Движение = Движения.КонтейнерыВСтоках.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, СтрокаОстатков);
				Движение.Количество = СтрокаОстатков.КоличествоОстаток;
				Движение.Период = Дата;
				
			//КонецЕсли;
			
		КонецЦикла;
		
	//КонецЦикла;
	
	
	//
	// регистр КонтейнерыВСтоках Расход
	// если сток номерной, то занести в РН данные по каждому контейнеру
	//Для Каждого СтрТЗ Из ТЗ Цикл
	//	Движение = Движения.КонтейнерыВСтоках.ДобавитьРасход();
	//	ЗаполнитьЗначенияСвойств(Движение, СтрТЗ);
	//	Движение.Количество = СтрТЗ.КоличествоОстаток;
	//	Движение.Период = Дата;
	//	
	//	//Движение = Движения.КонтейнерыВСтоках.Добавить();
	//	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	//Движение.Период = Дата;
	//	//Движение.Контейнер = СтрТЗ.Контейнер;
	//	//Движение.Сток = СтрТЗ.Сток;
	//	//Движение.Назначение = СтрТЗ.Назначение;
	//	//Движение.Контрагент = СтрТЗ.Контрагент;
	//	//Движение.Количество = СтрТЗ.КоличествоОстаток;
	//	//Движение.ДатаВзятияИзСтока = СтрТЗ.ДатаВзятияИзСтока;
	//	//Движение.СрокВозврата = СтрТЗ.СрокВозврата;
	//КонецЦикла;
	
	
	// регистр КонтейнерыВСтоках Приход
	Для Каждого ТекСтрокаКонтейнеры Из Контейнеры Цикл
		Движение = Движения.КонтейнерыВСтоках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ?(ЗначениеЗаполнено(ТекСтрокаКонтейнеры.ДатаПриемаВСток), ТекСтрокаКонтейнеры.ДатаПриемаВСток, Дата);
		// если сток номерной, то занести в РН данные по каждому контейнеру
		Если ЗначениеЗаполнено(ТекСтрокаКонтейнеры.Контейнер) Тогда
			Движение.Контейнер = ТекСтрокаКонтейнеры.Контейнер;
			Движение.Количество = 1;
		Иначе
			Движение.Контейнер = ТекСтрокаКонтейнеры.ТипКонтейнера;
			Движение.Количество = ТекСтрокаКонтейнеры.КоличествоБНКонтейнеров;
		КонецЕсли;
//		Движение.Статус = ТекСтрокаКонтейнеры.Статус;
		Движение.Сток = Сток;
		Движение.Назначение = ?(ЗначениеЗаполнено(ТекСтрокаКонтейнеры.ФактическоеНаправление), ТекСтрокаКонтейнеры.ФактическоеНаправление, ТекСтрокаКонтейнеры.Направление);
		Движение.Контрагент = ТекСтрокаКонтейнеры.Контрагент;
		Движение.ДатаПриемаВСток = ?(ЗначениеЗаполнено(ТекСтрокаКонтейнеры.ДатаПриемаВПользованиеПередПоставщиком), ТекСтрокаКонтейнеры.ДатаПриемаВПользованиеПередПоставщиком, ТекСтрокаКонтейнеры.ДатаПриемаВСток);
		Движение.СрокВозврата = ТекСтрокаКонтейнеры.СрокВозврата;
	КонецЦикла;
	
	//  установка флага записи движений в конце транзакции. Если данный флаг не установить, то движения НЕ будут записаны.
	Движения.КонтейнерыВСтоках.Записывать = Истина;
	
	Движения.СтатусыКТК.Записывать = Истина;
	Для Каждого ТекСтрокаКонтейнеры Из Контейнеры Цикл
		// записываем только в статусе "Свободен", т.к. остальные статусы запишут другие документы
		Если ТекСтрокаКонтейнеры.Статус = Перечисления.СтатусыКТК.Свободен Тогда
			Движение = Движения.СтатусыКТК.Добавить();
			Движение.Период = Дата;
			// если сток номерной, то занести в РН данные по каждому контейнеру
			Если ЗначениеЗаполнено(ТекСтрокаКонтейнеры.Контейнер) Тогда
				Движение.Контейнер = ТекСтрокаКонтейнеры.Контейнер;
				Движение.Количество = 1;
			Иначе
				Движение.Контейнер = ТекСтрокаКонтейнеры.ТипКонтейнера;
				Движение.Количество = ТекСтрокаКонтейнеры.КоличествоБНКонтейнеров;
			КонецЕсли;
			Движение.Сток = Сток;
			Движение.Направление = ?(ЗначениеЗаполнено(ТекСтрокаКонтейнеры.ФактическоеНаправление), ТекСтрокаКонтейнеры.ФактическоеНаправление, ТекСтрокаКонтейнеры.Направление);
			Движение.Контрагент = ТекСтрокаКонтейнеры.Контрагент;
			Движение.Статус = ТекСтрокаКонтейнеры.Статус;
		КонецЕсли;
	КонецЦикла;
	
	// требование отдела подряда - дату возврата от клиента обновлять датой, указанной в текущем документе
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	*
	//               |ИЗ
	//               |	РегистрСведений.СрокиИспользованияКонтейнеров КАК СрокиИспользованияКонтейнеров
	//               |ГДЕ
	//               |	СрокиИспользованияКонтейнеров.Контейнер = &Контейнер
	//               |	И СрокиИспользованияКонтейнеров.ВыдачаКлиенту < &ДатаПотенциальноНовойВыдачи
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	СрокиИспользованияКонтейнеров.ВыдачаКлиенту УБЫВ";
	//
	//Для каждого Стр из Контейнеры Цикл
	//	
	//	Если ЗначениеЗаполнено(Стр.Контейнер) И ЗначениеЗаполнено(Стр.ДатаПриемаВСток) тогда
	//		
	//		Запрос.УстановитьПараметр("Контейнер", Стр.Контейнер);
	//		Запрос.УстановитьПараметр("ДатаПотенциальноНовойВыдачи", Стр.ДатаПриемаВСток);
	//		Ответ = запрос.Выполнить().Выбрать();
	//		Если Ответ.Следующий() Тогда
	//			
	//			Если ЗначениеЗаполнено(Ответ.ВозвратВСток) Тогда Продолжить; КонецЕсли;
	//			
	//			МЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьМенеджерЗаписи();
	//			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
	//			МЗ.ВозвратОтКлиента = Стр.ДатаПриемаВСток;
	//			МЗ.Записать(Истина);
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	// факт позиция контейнеров из стоков
	Движения.ПозицияКонтейнеровФакт.Записывать = Истина;
	Для каждого стр из Контейнеры Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Контейнер) Тогда Продолжить; КонецЕсли;
		
		Движение = Движения.ПозицияКонтейнеровФакт.ДобавитьПриход();
		Движение.Контейнер = Стр.Контейнер;
		Движение.Локация = Сток;
		Движение.Период = Стр.ДатаПриемаВСток;
		
		Если НЕ ЗначениеЗаполнено(Движение.Период) Тогда Движение.Период = Дата; КонецЕсли;
		
		Движение.Регистратор = Ссылка;
		Движение.ТипКТК = Стр.ТипКонтейнера;
		Движение.Факт = 1;
		
		// SIV 26-09-2020 если указали дату снятия ктк с учета, то этой датой идет снятие по регистрам
		Если ЗначениеЗаполнено(Стр.ДатаСдачиКТКПоставщику) Тогда
			УправлениеКТКВСтокахСервер.КонтейнерыВСтоках_СнятьСУчета(Движения, Стр.Контейнер, Стр.ДатаСдачиКТКПоставщику);
		КонецЕсли;
		
		// SIV 16-10-20 временный фикс, пока не переделал АРМ КТК. закрываем план по факту ввода стока
		БылПланПодхода = ПоДанномуКТКОткрытПланПодхода(Стр.Контейнер, Дата-1);
		
		Если БылПланПодхода.Количество <> 0 Тогда
			
			ДвижениеКонецПлан = Движения.ПланируемыеКДоступностиКТК.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(ДвижениеКонецПлан, БылПланПодхода);
			ДвижениеКонецПлан.Период = Дата;
					
		КонецЕсли;
		
		
	КонецЦикла;
	
	НЗ = РегистрыСведений.ДанныеДоплатныхКТК.СоздатьНаборЗаписей();
	НЗ.Отбор.РегистраторЪ.Значение = Ссылка;
	
	Для каждого Стр из Контейнеры Цикл
		
		Если Стр.Ставка >= 0 Тогда Продолжить; КонецЕсли;
		
		НСтр 				= НЗ.Добавить();
		НСтр.Договор 		= Стр.КлиентПередислокация_Договор;
		НСтр.Клиент 		= Стр.КлиентПередислокация_Клиент;
		НСтр.РегистраторЪ 	= Ссылка;
		НСтр.Доплата 		= -Стр.Ставка;
		НСтр.Валюта 		= Стр.Валюта;
		НСтр.ПСЦ 			= Стр.КлиентПередислокация_ПСЦ;
		НСтр.КТК 			= Стр.Контейнер;
		НСтр.ПериодЪ		= Стр.ДатаПриемаВСток;
		
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

Функция ПоДанномуКТКОткрытПланПодхода(КТК, Период)
	
	Результат = Новый Структура("Контейнер,Сток,Контрагент,Назначение,ДатаПриемаВСток,СрокВозврата,ПлановаяДатаПрибытия,Количество",,,,,,,,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланируемыеКДоступностиКТКОстатки.Контейнер КАК Контейнер,
	               |	ПланируемыеКДоступностиКТКОстатки.Сток КАК Сток,
	               |	ПланируемыеКДоступностиКТКОстатки.Контрагент КАК Контрагент,
	               |	ПланируемыеКДоступностиКТКОстатки.Назначение КАК Назначение,
	               |	ПланируемыеКДоступностиКТКОстатки.ДатаПриемаВСток КАК ДатаПриемаВСток,
	               |	ПланируемыеКДоступностиКТКОстатки.СрокВозврата КАК СрокВозврата,
	               |	ПланируемыеКДоступностиКТКОстатки.ПлановаяДатаПрибытия КАК ПлановаяДатаПрибытия,
	               |	ПланируемыеКДоступностиКТКОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПланируемыеКДоступностиКТК.Остатки(&Период, Контейнер = &Контейнер) КАК ПланируемыеКДоступностиКТКОстатки";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контейнер", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Евросиб Фролов (08.10.2021 Task №39041
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		МассивКонтейнеров = Контейнеры.ВыгрузитьКолонку("Контейнер");
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
	КонецЕсли;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)