
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		ЦФО = ТекПользователь.ЦФО;
	КонецЕсли;
	
	КвантВремениСделки = Константы.ИнтервалСозданияСделокПовагонки.Получить();
	Если КвантВремениСделки = 0 Тогда
		Элементы.Декорация1.Заголовок = "Сделки создаются на каждый вагон отдельно";
	Иначе
		Элементы.Декорация1.Заголовок = "Сделки создаются с интервалом " + КвантВремениСделки + " дн.";
	КонецЕсли;
	
	КолонкиИзПодхода = Ложь;
	
	// вагоны в повагонке
	//МассивСтруктурОтвет = ОбновитьВагоныВПовагонкеСервер(Новый Структура("ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты", ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты.ВыгрузитьЗначения()));
	//КолвоВПовагонке = 0;
	//Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
	//	ПараметрыОтбора = Новый СТруктура;
	//	ПараметрыОтбора.Вставить("НомерВагона",ЭлементМассива.НомерВагона);
	//	ПараметрыОтбора.Вставить("ДатаОтправления",ЭлементМассива.ДатаОтправления);
	//	НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		НовСТр = ВагоныВПовагонке.Добавить();
	//		//ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива);
	//		ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива,,"Сделка");
	//		Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
	//			НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
	//			НовСтр.Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
	//			//НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
	//			Если НовСтр.КоличествоДнейБезСделок > 0 Тогда
	//				НовСтр.БезСделки = Истина;
	//			Иначе
	//				НовСтр.БезСделки = Ложь;
	//			КонецЕсли;
	//		ИНаче
	//			Если ЗначениеЗаполнено(НовСтр.ДатаОтправления) Тогда
	//				НовСтр.БезСделки = Истина;
	//			КонецЕсли;
	//			НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего;
	//		КонецЕсли;
	//		КолвоВПовагонке = КолвоВПовагонке + 1;
	//		
	//	Иначе
	//		Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
	//			НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
	//			НайденныеСтроки[0].Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
	//		КонецЕсли;
	//		НайденныеСтроки[0].КоличествоДнейБезСделок = НайденныеСтроки[0].КоличествоДнейБезСделок - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
	//		Если НайденныеСтроки[0].КоличествоДнейБезСделок > 0 Тогда
	//			НайденныеСтроки[0].БезСделки = Истина;
	//		Иначе
	//			НайденныеСтроки[0].БезСделки = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	
	//КонецЦикла;
	//Элементы.ГруппаВагоныВПовагонке.Заголовок = "Вагоны в повагонке (" + КолвоВПовагонке + ")";
	//
	//// вагоны вышедшие из повагонки
	//МассивСтруктурОтвет = ОбновитьВагоныВышедшиеИзПовагонкиСервер(Новый Структура("ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты", ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты.ВыгрузитьЗначения()));
	//КолвоНЕВПовагонке = 0;
	//Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
	//	ПараметрыОтбора = Новый СТруктура;
	//	ПараметрыОтбора.Вставить("НомерВагона",ЭлементМассива.НомерВагона);
	//	ПараметрыОтбора.Вставить("ДатаОтправления",ЭлементМассива.ДатаОтправления);
	//	НайденныеСтроки = ВагоныВыведены.НайтиСтроки(ПараметрыОтбора);
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		НовСТр = ВагоныВыведены.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива,,"Сделка");
	//		Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
	//			НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
	//			НовСтр.Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
	//			НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
	//			Если НовСтр.КоличествоДнейБезСделок > 0 Тогда
	//				НовСтр.БезСделки = Истина;
	//			Иначе
	//				НовСтр.БезСделки = Ложь;
	//			КонецЕсли;
	//		ИНаче
	//			Если ЗначениеЗаполнено(НовСтр.ДатаОтправления) Тогда
	//				НовСтр.БезСделки = Истина;
	//			КонецЕсли;
	//			НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего;
	//		КонецЕсли;
	//		
	//		КолвоНЕВПовагонке = КолвоНЕВПовагонке + 1;
	//		
	//	Иначе
	//		Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
	//			НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
	//			НайденныеСтроки[0].Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
	//		КонецЕсли;
	//		НайденныеСтроки[0].КоличествоДнейБезСделок = НайденныеСтроки[0].КоличествоДнейБезСделок - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
	//		Если НайденныеСтроки[0].КоличествоДнейБезСделок > 0 Тогда
	//			НайденныеСтроки[0].БезСделки = Истина;
	//		Иначе
	//			НайденныеСтроки[0].БезСделки = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;

	//КонецЦикла;
	//Элементы.ГруппаВыведеныИзПовагонки.Заголовок = "Выведены из повагонки (" + КолвоНЕВПовагонке + ")";
	//
	//// вагоны в подходе к повагонке
	//МассивСтруктурОтвет = ОбновитьВагоныВПодходеСервер(Новый Структура("ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты", ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты.ВыгрузитьЗначения()));
	//КолвоВПодходе = 0;
	//Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
	//	ЗаполнитьЗначенияСвойств(ПодходВагонов.Добавить(), ЭлементМассива);
	//	
	//	КолвоВПодходе = КолвоВПодходе + 1;
	//КонецЦикла;
	//Элементы.ГруппаПодходВагоновКСтанциям.Заголовок = "Подход к станциям перевода в повагонку (" + КолвоВПодходе + ")";
	
	СписокКолонокВагоныВПовагонке.Очистить();
	
	// если в повагонке нет данных (первое заполнение), получить столбцы из формы
	ТЗ = ВагоныВПовагонке.Выгрузить();
	
	Для Каждого Эл Из ТЗ.Колонки Цикл
		Если СписокКолонокВагоныВПовагонке.НайтиПоЗначению(Эл.Имя) = Неопределено Тогда
			СписокКолонокВагоныВПовагонке.Добавить(Эл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ2 = ПодходВагонов.Выгрузить();
	
	Для Каждого Эл2 Из ТЗ2.Колонки Цикл
		Если СписокКолонокВагоныВПовагонке.НайтиПоЗначению(Эл2.Имя) = Неопределено Тогда
			СписокКолонокВагоныВПовагонке.Добавить(Эл2.Имя);
		КонецЕсли;
	КонецЦикла;
		
	ТЗ3 = ВагоныВыведены.Выгрузить();
	
	Для Каждого Эл3 Из ТЗ3.Колонки Цикл
		Если СписокКолонокВагоныВПовагонке.НайтиПоЗначению(Эл3.Имя) = Неопределено Тогда
			СписокКолонокВагоныВПовагонке.Добавить(Эл3.Имя);
		КонецЕсли;
	КонецЦикла;
	Элементы.ВагоныВПовагонкеОчиститьСделкиСлужебная.Видимость = РольДоступна("ПолныеПрава");
	
	//Евросиб Каблов 27.12.2021 (
	ВагоныПоВСК.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРеестраПоКонтрагенту.ДатаНачала);
	ВагоныПоВСК.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРеестраПоКонтрагенту.ДатаОкончания);
	ВагоныПоВСК.Параметры.УстановитьЗначениеПараметра("Контрагент", КонтрагентРеестра);
	//Евросиб Каблов 27.12.2021 )
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьВагоныВПовагонке();
	ОбновитьВагоныВышедшиеИзПовагонки();
	ОбновитьВагоныВПодходе();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруОтборов()
	
	СтруктураОтборов = Новый Структура("ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Клиенты", ЦФО, ОтборТипСтавки, ОтборПоКлиентам, Неопределено);
	Если ОтборПоКлиентам Тогда
		МассивКлиентовДляОтбора = Новый Массив;
		Для Каждого ЭлементСписка Из Клиенты Цикл
			Если ЭлементСписка.Пометка Тогда
				МассивКлиентовДляОтбора.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		СтруктураОтборов.Вставить("Клиенты", МассивКлиентовДляОтбора);
	КонецЕсли;
	
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьВагоныВПовагонке()
	
	ВагоныВПовагонке.Очистить();
	
	СтруктураОтборов = ПолучитьСтруктуруОтборов();
	МассивСтруктурОтвет = ОбновитьВагоныВПовагонкеСервер(СтруктураОтборов);	
	КолвоВПовагонке = 0;
	Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("НомерВагона",ЭлементМассива.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаОтправления",ЭлементМассива.ДатаОтправления);
		НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовСТр = ВагоныВПовагонке.Добавить();

			//ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива,,"Сделка");
			//Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
			//	НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
			//	НовСтр.Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
			//	//НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
			//	Если НовСтр.КоличествоДнейБезСделок > 0 Тогда
			//		НовСтр.БезСделки = Истина;
			//	Иначе
			//		НовСтр.БезСделки = Ложь;
			//	КонецЕсли;
			//ИНаче
			//	Если ЗначениеЗаполнено(НовСтр.ДатаОтправления) Тогда
			//		НовСтр.БезСделки = Истина;
			//	КонецЕсли;
			//	НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего;
			//КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива);
			
			КолвоВПовагонке = КолвоВПовагонке + 1;
			
		//Иначе
		//	Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
		//		НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
		//		НайденныеСтроки[0].Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
		//	КонецЕсли;
		//	НайденныеСтроки[0].КоличествоДнейБезСделок = НайденныеСтроки[0].КоличествоДнейБезСделок - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
		//	Если НайденныеСтроки[0].КоличествоДнейБезСделок > 0 Тогда
		//		НайденныеСтроки[0].БезСделки = Истина;
		//	Иначе
		//		НайденныеСтроки[0].БезСделки = Ложь;
		//	КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	Элементы.ГруппаВагоныВПовагонке.Заголовок = "Вагоны в повагонке (" + КолвоВПовагонке + ")";
	
	//КартинкаРемонт = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	//КартинкаЗаявкаНеПодходит = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторВерх;

	//Для Каждого Стр Из ВагоныВПовагонке Цикл
	//	Если Стр.ЗаявкаНеПодходит Тогда
	//		Стр.Картинка = КартинкаЗаявкаНеПодходит;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Стр.ПереводВНРП) Тогда
	//		Стр.Картинка = КартинкаРемонт;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВагоныВышедшиеИзПовагонки()
	
	ВагоныВыведены.Очистить();
	СтруктураОтборов = ПолучитьСтруктуруОтборов();
	МассивСтруктурОтвет = ОбновитьВагоныВышедшиеИзПовагонкиСервер(СтруктураОтборов);
	КолвоНЕВПовагонке = 0;
	Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("НомерВагона",ЭлементМассива.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаОтправления",ЭлементМассива.ДатаОтправления);
		НайденныеСтроки = ВагоныВыведены.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовСТр = ВагоныВыведены.Добавить();
			ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива);
		//	ЗаполнитьЗначенияСвойств(НовСТр, ЭлементМассива,,"Сделка");
		//	Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
		//		НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
		//		НовСтр.Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
		//		НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
		//		Если НовСтр.КоличествоДнейБезСделок > 0 Тогда
		//			НовСтр.БезСделки = Истина;
		//		Иначе
		//			НовСтр.БезСделки = Ложь;
		//		КонецЕсли;
		//	ИНаче
		//		Если ЗначениеЗаполнено(НовСтр.ДатаОтправления) Тогда
		//			НовСтр.БезСделки = Истина;
		//		КонецЕсли;
		//		НовСтр.КоличествоДнейБезСделок = ЭлементМассива.КоличествоДнейВсего;
		//	КонецЕсли;
		//	
			КолвоНЕВПовагонке = КолвоНЕВПовагонке + 1;
		//	
		//Иначе
		//	Если ЗначениеЗаполнено(ЭлементМассива.СделкаИзРегистра) И
		//		НовСтр.Сделка.НайтиПоЗначению(ЭлементМассива.СделкаИзРегистра) = Неопределено Тогда
		//		НайденныеСтроки[0].Сделка.Добавить(ЭлементМассива.СделкаИзРегистра);
		//	КонецЕсли;
		//	НайденныеСтроки[0].КоличествоДнейБезСделок = НайденныеСтроки[0].КоличествоДнейБезСделок - ?(ЗначениеЗаполнено(ЭлементМассива.КоличествоДнейОборот),ЭлементМассива.КоличествоДнейОборот,0);
		//	Если НайденныеСтроки[0].КоличествоДнейБезСделок > 0 Тогда
		//		НайденныеСтроки[0].БезСделки = Истина;
		//	Иначе
		//		НайденныеСтроки[0].БезСделки = Ложь;
		//	КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	Элементы.ГруппаВыведеныИзПовагонки.Заголовок = "Выведены из повагонки (" + КолвоНЕВПовагонке + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВагоныВПодходе()
	
	ПодходВагонов.Очистить();
	СтруктураОтборов = ПолучитьСтруктуруОтборов();
	МассивСтруктурОтвет = ОбновитьВагоныВПодходеСервер(СтруктураОтборов);
	КолвоВПодходе = 0;
	Для Каждого ЭлементМассива Из МассивСтруктурОтвет Цикл
		ЗаполнитьЗначенияСвойств(ПодходВагонов.Добавить(), ЭлементМассива);
		КолвоВПодходе = КолвоВПодходе + 1;
		
	КонецЦикла;
	
	Элементы.ГруппаПодходВагоновКСтанциям.Заголовок = "Подход к станциям перевода в повагонку (" + КолвоВПодходе + ")";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьВагоныВПовагонкеСервер(Отборы)
	
	// вагоны в повагонке
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправки.Период КАК ДатаПомещенияВРежимПовагонки,
	               |	ПовагонныеОтправки.Вагон КАК НомерВагона,
	               |	ПовагонныеОтправки.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
	               |	ПовагонныеОтправки.СобытиеВыводаИзПовагонки КАК СобытиеВыводаИзПовагонки,
	               |	ПовагонныеОтправки.ВыводИзПовагонки КАК ВыводИзПовагонки,
	               |	ПовагонныеОтправки.СтанцияВывода КАК СтанцияВывода,
	               |	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
	               |	ПовагонныеОтправки.Сделка КАК Сделка,
	               |	ПовагонныеОтправки.РТУ КАК РТУ,
	               |	ПовагонныеОтправки.Клиент КАК Клиент,
	               |	ПовагонныеОтправки.Договор КАК Договор,
	               |	ПовагонныеОтправки.Калькуляция КАК Калькуляция,
	               |	ПовагонныеОтправки.ГУИД КАК ГУИД,
	               |	ПовагонныеОтправки.Груженый КАК Груженый,
	               |	ПовагонныеОтправки.СтанцияВвода КАК СтанцияВвода,
	               |	ПовагонныеОтправки.Заявка КАК Заявка,
	               |	ПовагонныеОтправки.СтанцияСледующегоНазначения КАК СтанцияСледующегоНазначения,
	               |	ПовагонныеОтправки.КлиентСледующегоНазначения КАК КлиентСледующегоНазначения,
	               |	ПовагонныеОтправки.ДоговорСледующегоНазначения КАК ДоговорСледующегоНазначения,
	               |	ПовагонныеОтправки.ПСЦ КАК ПСЦ,
	               |	ПовагонныеОтправки.ПСЦСледующегоНазначения КАК ПСЦСледующегоНазначения,
	               |	ПовагонныеОтправки.Комментарий КАК Комментарий,
	               |	ПовагонныеОтправки.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
	               |	ПовагонныеОтправки.ДатаОтправления КАК ДатаОтправления,
	               |	ПовагонныеОтправки.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ВЫБОР
	               |		КОГДА ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |			ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |		КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.Заявка.Дата
	               |		КОГДА НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию > ПовагонныеОтправки.Заявка.Дата
	               |						ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |					ИНАЧЕ ПовагонныеОтправки.Заявка.Дата
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ДатаПрибытияДляСНП,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ДатаОкончанияПользования
	               |		ИНАЧЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения
	               |	КОНЕЦ КАК ДатаВыгрузкиДляСНП,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения
	               |		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ПереводВНРП
	               |		ИНАЧЕ ПовагонныеОтправки.ДатаОкончанияПользования
	               |	КОНЕЦ КАК ДатаОкончанияДляСНПСлед,
	               |	ПовагонныеОтправки.ПереводВНРП КАК ПереводВНРП,
	               |	ПовагонныеОтправки.ВыводИзНРП КАК ВыводИзНРП,
	               |	ПовагонныеОтправки.НДС КАК НДС,
	               |	ПовагонныеОтправки.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	               |	ПовагонныеОтправки.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	ПовагонныеОтправки.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	ПовагонныеОтправки.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	ПовагонныеОтправки.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	ПСЦКалькуляцииПовагонки.СНППогрузкиДни КАК СНППогрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни КАК СНПВыгрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияДни КАК НормативСледованияДни,
	               |	ПовагонныеОтправки.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
	               |	ПовагонныеОтправки.Груз КАК Груз,
	               |	ПовагонныеОтправки.ТребуетсяПередислокация КАК ТребуетсяПередислокация,
	               |	ПовагонныеОтправки.СогласованоМенеджером КАК СогласованоМенеджером,
	               |	ПовагонныеОтправки.ПодсылСогласованСПланером КАК ПодсылСогласованСПланером,
	               |	ПовагонныеОтправки.НомерГУ КАК НомерГУ,
	               |	ПовагонныеОтправки.Грузоотправитель КАК Грузоотправитель,
	               |	ПовагонныеОтправки.СтанцияПодачи КАК СтанцияПодачи,
	               |	ПовагонныеОтправки.ЦФО КАК ЦФО,
	               |	ПовагонныеОтправки.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, ) КАК ПовагонныеОтправки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.КалькуляцииПовагонки КАК ПСЦКалькуляцииПовагонки
	               |		ПО ПовагонныеОтправки.ПСЦ = ПСЦКалькуляцииПовагонки.Ссылка
	               |			И ПовагонныеОтправки.Калькуляция = ПСЦКалькуляцииПовагонки.Калькуляция
	               |ГДЕ
	               |	ПовагонныеОтправки.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ПовагонныеОтправки.ЦФО = &ЦФО
	               |	И ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	               |	И ПовагонныеОтправки.Калькуляция.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))
	               |	И ПовагонныеОтправки.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)
	               |	И ПовагонныеОтправки.Клиент В(&Клиенты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ПериодДислокации
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
	               |			,
	               |			Вагон В
	               |				(ВЫБРАТЬ
	               |					Повагонка.НомерВагона
	               |				ИЗ
	               |					Повагонка КАК Повагонка)) КАК ДислокацияВагоновСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагоновСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.ОперацияСВагоном) КАК ОперацияСВагоном
	               |ПОМЕСТИТЬ ВагоныОперации
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодДислокации КАК ПериодДислокации
	               |		ПО ДислокацияВагоновСрезПоследних.Период = ПериодДислокации.Период
	               |			И ДислокацияВагоновСрезПоследних.Вагон = ПериодДислокации.Вагон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагоновСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.Период КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияВагоновСрезПоследних.Груженый КАК Груженый,
	               |	ДислокацияВагоновСрезПоследних.НомерПоезда КАК НомерПоезда,
	               |	ДислокацияВагоновСрезПоследних.ИндексПоезда КАК ИндексПоезда,
	               |	ДислокацияВагоновСрезПоследних.КодГрузоотправителя КАК КодГрузоотправителя,
	               |	ДислокацияВагоновСрезПоследних.КодГрузополучателя КАК КодГрузополучателя,
	               |	ДислокацияВагоновСрезПоследних.Собственник КАК Собственник,
	               |	ДислокацияВагоновСрезПоследних.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
	               |	ДислокацияВагоновСрезПоследних.Груз КАК Груз,
	               |	ДислокацияВагоновСрезПоследних.ВесГруза КАК ВесГруза,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
	               |	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации.ЖелезнаяДорога КАК ДорогаДислокации,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
	               |	ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	ДислокацияВагоновСрезПоследних.ПростойНаСтанции КАК ПростойНаСтанции,
	               |	ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции
	               |ПОМЕСТИТЬ ДислокацияЪ
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(, ) КАК ДислокацияВагоновСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагоныОперации КАК ВагоныОперации
	               |		ПО ДислокацияВагоновСрезПоследних.Период = ВагоныОперации.Период
	               |			И ДислокацияВагоновСрезПоследних.Вагон = ВагоныОперации.Вагон
	               |			И ДислокацияВагоновСрезПоследних.ОперацияСВагоном = ВагоныОперации.ОперацияСВагоном
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Повагонка.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
	               |	Повагонка.НомерВагона КАК НомерВагона,
	               |	Повагонка.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
	               |	Повагонка.Сделка КАК Сделка,
	               |	Повагонка.Клиент КАК Клиент,
	               |	Повагонка.Договор КАК Договор,
	               |	Повагонка.Калькуляция КАК Калькуляция,
	               |	Повагонка.Груженый КАК Груженый,
	               |	Повагонка.СтанцияВвода КАК СтанцияВвода,
	               |	Повагонка.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанциюОперации,
	               |	Повагонка.Заявка КАК Заявка,
	               |	ВЫБОР
	               |		КОГДА Повагонка.УшедшийРейс
	               |			ТОГДА Повагонка.СтанцияНазначения
	               |		ИНАЧЕ ДислокацияЪ.СтанцияНазначения
	               |	КОНЕЦ КАК СтанцияНазначения,
	               |	Повагонка.СтанцияСледующегоНазначения КАК СтанцияСледующегоНазначения,
	               |	Повагонка.КлиентСледующегоНазначения КАК КлиентСледующегоНазначения,
	               |	Повагонка.ДоговорСледующегоНазначения КАК ДоговорСледующегоНазначения,
	               |	Повагонка.ПСЦ КАК ПСЦ,
	               |	Повагонка.ПСЦСледующегоНазначения КАК ПСЦСледующегоНазначения,
	               |	Повагонка.Комментарий КАК Комментарий,
	               |	ДислокацияЪ.СтанцияОперации КАК ТекущаяДислокацияПоСлежению,
	               |	ДислокацияЪ.Период КАК ДатаОперации,
	               |	ДислокацияЪ.ОперацияСВагоном КАК Операция,
	               |	ДислокацияЪ.НомерПоезда КАК НомерПоезда,
	               |	ДислокацияЪ.ИндексПоезда КАК ИндексПоезда,
	               |	ДислокацияЪ.КодГрузополучателя КАК Грузополучатель,
	               |	ПаспортаВагоновСрезПоследних.ДатаСледующегоПлановогоРемонта КАК ДатаСледующегоРемонта,
	               |	Повагонка.НомерВагона.ТипТС КАК МодельВагона,
	               |	ПаспортаВагоновСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	               |	Повагонка.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
	               |	ВЫБОР
	               |		КОГДА Повагонка.УшедшийРейс
	               |			ТОГДА Повагонка.ДатаОтправления
	               |		ИНАЧЕ ДислокацияЪ.ДатаОтправленияСоСтанции
	               |	КОНЕЦ КАК ДатаОтправления,
	               |	ДислокацияЪ.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	Повагонка.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	Повагонка.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ВЫБОР
	               |		КОГДА Повагонка.УшедшийРейс
	               |			ТОГДА Повагонка.СтанцияОтправления
	               |		ИНАЧЕ ДислокацияЪ.СтанцияОтправления
	               |	КОНЕЦ КАК СтанцияОтправления,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияДляСНП, Повагонка.ДатаОтправления, ДЕНЬ) - Повагонка.СНППогрузкиДни > 0
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияДляСНП, Повагонка.ДатаОтправления, ДЕНЬ) - Повагонка.СНППогрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНППогрузки,
	               |	ВЫБОР
	               |		КОГДА НЕ Повагонка.ДатаВыгрузкиДляСНП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ Повагонка.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаВыгрузкиДляСНП, ДЕНЬ)
	               |	КОНЕЦ КАК ДельтаВыгрузки,
	               |	ВЫБОР
	               |		КОГДА НЕ Повагонка.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ Повагонка.ДатаОкончанияДляСНПСлед = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ)
	               |	КОНЕЦ КАК ДельтаОбщегоПользования,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) > Повагонка.СНПВыгрузкиДни
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) - Повагонка.СНПВыгрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПВыгрузки,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) > Повагонка.НормативСледованияДни
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) - Повагонка.НормативСледованияДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПСледования,
	               |	ДислокацияЪ.ПростойНаСтанции КАК ПростойНаСтанции,
	               |	Повагонка.ПереводВНРП КАК ПереводВНРП,
	               |	Повагонка.ВыводИзНРП КАК ВыводИзНРП,
	               |	Повагонка.НДС КАК НДС,
	               |	Повагонка.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	               |	Повагонка.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	Повагонка.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	Повагонка.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	Повагонка.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	Повагонка.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
	               |	Повагонка.ДатаОтправления КАК БезСделки,
	               |	ВЫБОР
	               |		КОГДА НЕ Повагонка.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЗавершенныйТрек,
	               |	ВЫБОР
	               |		КОГДА Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	               |				ИЛИ Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПосуточнаяОплата,
	               //|	ВыставлениеПосуточнойАрендыОбороты.Регистратор КАК СделкаИзРегистра,
	               |	Повагонка.НомерВагона.ТипТС.Родитель КАК РазмерВагона,
	               |	ВЫБОР
	               |		КОГДА Повагонка.Груз = ЗНАЧЕНИЕ(Справочник.Грузы.ПустаяСсылка)
	               |			ТОГДА ДислокацияЪ.Груз
	               |		ИНАЧЕ Повагонка.Груз
	               |	КОНЕЦ КАК Груз,
	               //|	ВыставлениеПосуточнойАрендыОбороты.ГУИД КАК ГУИДПоСделкам,
	               //|	ВыставлениеПосуточнойАрендыОбороты.КоличествоДней КАК КоличествоДнейОборот,
	               |	Повагонка.НормативСледованияДни КАК НормативСледованияДни,
	               |	Повагонка.ТребуетсяПередислокация КАК ТребуетсяПередислокация,
	               |	Повагонка.СогласованоМенеджером КАК СогласованоМенеджером,
	               |	Повагонка.ПодсылСогласованСПланером КАК ПодсылСогласованСПланером,
	               |	Повагонка.НомерГУ КАК НомерГУ,
	               |	Повагонка.Грузоотправитель КАК Грузоотправитель,
	               |	Повагонка.СтанцияПодачи КАК СтанцияПодачи,
	               |	Повагонка.ЦФО КАК ЦФО,
	               |	Повагонка.УшедшийРейс КАК УшедшийРейс,
	               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ВидСобственности
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |		ПО Повагонка.НомерВагона = ДислокацияЪ.Вагон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |		ПО Повагонка.НомерВагона = ПаспортаВагоновСрезПоследних.Вагон
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды КАК ВыставлениеПосуточнойАрендыОбороты
				   //|		ПО Повагонка.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
				   //|			И Повагонка.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
				   //|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(
	               |				,
	               |				вагон В
	               |					(ВЫБРАТЬ
	               |						Повагонка.НомерВагона КАК НомерВагона
	               |					ИЗ
	               |						Повагонка КАК Повагонка)) КАК ПризнакСобственностиВагонаСрезПоследних
	               |		ПО Повагонка.НомерВагона = ПризнакСобственностиВагонаСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итоговая.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
	               |	Итоговая.НомерВагона КАК НомерВагона,
	               |	Итоговая.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
	               |	Итоговая.Сделка КАК Сделка,
	               |	Итоговая.Клиент КАК Клиент,
	               |	Итоговая.Договор КАК Договор,
	               |	Итоговая.Калькуляция КАК Калькуляция,
	               |	Итоговая.Груженый КАК Груженый,
	               |	Итоговая.СтанцияВвода КАК СтанцияВвода,
	               |	Итоговая.ДатаПрибытияНаСтанциюОперации КАК ДатаПрибытияНаСтанциюОперации,
	               |	Итоговая.Заявка КАК Заявка,
	               |	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	               |	Итоговая.СтанцияСледующегоНазначения КАК СтанцияСледующегоНазначения,
	               |	Итоговая.КлиентСледующегоНазначения КАК КлиентСледующегоНазначения,
	               |	Итоговая.ДоговорСледующегоНазначения КАК ДоговорСледующегоНазначения,
	               |	Итоговая.ПСЦ КАК ПСЦ,
	               |	Итоговая.ПСЦСледующегоНазначения КАК ПСЦСледующегоНазначения,
	               |	Итоговая.Комментарий КАК Комментарий,
	               |	Итоговая.ТекущаяДислокацияПоСлежению КАК ТекущаяДислокацияПоСлежению,
	               |	Итоговая.ДатаОперации КАК ДатаОперации,
	               |	Итоговая.Операция КАК Операция,
	               |	Итоговая.НомерПоезда КАК НомерПоезда,
	               |	Итоговая.ИндексПоезда КАК ИндексПоезда,
	               |	Итоговая.Грузополучатель КАК Грузополучатель,
	               |	Итоговая.ДатаСледующегоРемонта КАК ДатаСледующегоРемонта,
	               |	Итоговая.МодельВагона КАК МодельВагона,
	               |	Итоговая.Грузоподъемность КАК Грузоподъемность,
	               |	Итоговая.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
	               |	Итоговая.ДатаОтправления КАК ДатаОтправления,
	               |	Итоговая.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	Итоговая.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	Итоговая.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	               |	Итоговая.СНППогрузки КАК СНППогрузки,
	               |	Итоговая.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	Итоговая.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	Итоговая.СНПВыгрузки КАК СНПВыгрузки,
	               |	Итоговая.СНПСледования КАК СНПСледования,
	               |	Итоговая.ПростойНаСтанции КАК ПростойНаСтанции,
	               |	Итоговая.ПереводВНРП КАК ПереводВНРП,
	               |	Итоговая.ВыводИзНРП КАК ВыводИзНРП,
	               |	Итоговая.НДС КАК НДС,
	               |	Итоговая.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	               |	Итоговая.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	Итоговая.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	Итоговая.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	Итоговая.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	Итоговая.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
	               |	Итоговая.БезСделки КАК БезСделки,
	               |	Итоговая.ЗавершенныйТрек КАК ЗавершенныйТрек,
	               |	Итоговая.ПосуточнаяОплата КАК ПосуточнаяОплата,
	               //|	Итоговая.СделкаИзРегистра КАК СделкаИзРегистра,
	               |	Итоговая.РазмерВагона КАК РазмерВагона,
	               |	Итоговая.Груз КАК Груз,
	               //|	Итоговая.ГУИДПоСделкам КАК ГУИДПоСделкам,
	               |	ВЫБОР
	               |		КОГДА НЕ Итоговая.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НЕ Итоговая.ПосуточнаяОплата
	               |						ТОГДА Итоговая.НормативСледованияДни - 1
	               |					КОГДА Итоговая.ПосуточнаяОплата
	               |						ТОГДА ВЫБОР
	               |								КОГДА НЕ Итоговая.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ), ДЕНЬ)
	               |								КОГДА НЕ Итоговая.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ПереводВНРП, ДЕНЬ), ДЕНЬ)
	               |								КОГДА НЕ Итоговая.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ДатаОкончанияПользования, ДЕНЬ), ДЕНЬ)
	               |								КОГДА Итоговая.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										И Итоговая.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										И Итоговая.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекДата, ДЕНЬ), ДЕНЬ)
	               |							КОНЕЦ
	               |				КОНЕЦ
	               |	КОНЕЦ + 1 КАК КоличествоДнейВсего,
				   //|	ВЫБОР
				   //|		КОГДА Итоговая.КоличествоДнейОборот = ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот
				   //|			ТОГДА ИСТИНА
				   //|		ИНАЧЕ ЛОЖЬ
				   //|	КОНЕЦ КАК СозданСчет,
				   |    ЛОЖЬ КАК СозданСчет, 
	               //|	Итоговая.КоличествоДнейОборот КАК КоличествоДнейОборот,
	               |	Итоговая.ТребуетсяПередислокация КАК ТребуетсяПередислокация,
	               |	Итоговая.СогласованоМенеджером КАК СогласованоМенеджером,
	               |	Итоговая.ПодсылСогласованСПланером КАК ПодсылСогласованСПланером,
	               |	Итоговая.НомерГУ КАК НомерГУ,
	               |	Итоговая.Грузоотправитель КАК Грузоотправитель,
	               |	Итоговая.СтанцияПодачи КАК СтанцияПодачи,
	               |	Итоговая.ЦФО КАК ЦФО,
	               |	Итоговая.УшедшийРейс КАК УшедшийРейс,
	               |	Итоговая.ВидСобственности КАК ВидСобственности
	               |ИЗ
	               |	Итоговая КАК Итоговая";
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
				   //|		ПО Итоговая.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
				   //|			И Итоговая.ГУИДПоСделкам = ВыставлениеПосуточнойАрендыОбороты.ГУИД
				   //|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)";

	Если ЗначениеЗаполнено(Отборы.ЦФО) Тогда
		Запрос.УстановитьПараметр("ЦФО", Отборы.ЦФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.ЦФО = &ЦФО", "");		
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Посуточная ставка" Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)", "");
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Ставка за вагон" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Калькуляция.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))", "");
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Ставка за КТК" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)", "");
	КонецЕсли;
	
	Если Отборы.ОтборПоКлиентам Тогда
		Запрос.УстановитьПараметр("Клиенты", Отборы.Клиенты);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Клиент В(&Клиенты)", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	МассивОтвета = Новый Массив;
	ОтветВыполнить = Запрос.Выполнить();
	
	ОписаниеПолучившейсяСтруктуры = "";
	Для каждого Колонка из ОтветВыполнить.Колонки Цикл
		ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + Колонка.Имя;
	КонецЦикла;
	
	// добавим в структуру элемент для фильтрации по фин документам
	ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + "БезФинДокументов";
	
	Ответ = ОтветВыполнить.Выбрать();
	Пока Ответ.Следующий() Цикл
		ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
		ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Ответ);
		Если (НЕ Ответ.СНППогрузки = 0 И НЕ Ответ.РТУСНППогрузки) ИЛИ
			(НЕ Ответ.СНПВыгрузки = 0 И НЕ Ответ.РТУСНПВыгрузки) ИЛИ
			(НЕ Ответ.СНПСледования = 0 И НЕ Ответ.РТУСНППеревозки) ИЛИ
			(НЕ Ответ.СозданСчет И ЗначениеЗаполнено(Ответ.ДатаОтправления)) Тогда
			ЭлементСтруктура.БезФинДокументов = Истина;
		Иначе
			ЭлементСтруктура.БезФинДокументов = Ложь;
		КонецЕсли;
		
		// значение элемента БезСделки заполним исходя из кол-ва дней без сделки
		//Если ЗначениеЗаполнено(Ответ.КоличествоДнейБезСделок) И Ответ.КоличествоДнейБезСделок>0 Тогда
		//	ЭлементСтруктура.БезСделки = Истина;
		//Иначе
		//	ЭлементСтруктура.БезСделки = Ложь;
		//КонецЕсли;
		
		МассивОтвета.Добавить(ЭлементСтруктура);
	КонецЦикла;
	
	Возврат МассивОтвета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьВагоныВышедшиеИзПовагонкиСервер(Отборы)
	
	// вагоны вышедшие из повагонки. станцию отправления и назначениея брать из дислокации, установив период
	// равный дате выхода из повагонки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправки.Период КАК Период,
	               |	ПовагонныеОтправки.Вагон КАК НомерВагона,
	               |	ПовагонныеОтправки.Клиент КАК Клиент,
	               |	ПовагонныеОтправки.Договор КАК Договор,
	               |	ПовагонныеОтправки.ПСЦ КАК ПСЦ,
	               |	ПовагонныеОтправки.Сделка КАК Сделка,
	               |	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
	               |	ПовагонныеОтправки.ДатаОтправления КАК ДатаОтправления,
	               |	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	ПовагонныеОтправки.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	ПовагонныеОтправки.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	ПовагонныеОтправки.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	ПовагонныеОтправки.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |			ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |		КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.Заявка.Дата
	               |		КОГДА НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию > ПовагонныеОтправки.Заявка.Дата
	               |						ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |					ИНАЧЕ ПовагонныеОтправки.Заявка.Дата
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ДатаПрибытияДляСНП,
	               |	ПовагонныеОтправки.Калькуляция КАК Калькуляция,
	               |	ПовагонныеОтправки.РТУ КАК РТУОсновнаяУслуга,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ДатаОкончанияПользования
	               |		ИНАЧЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения
	               |	КОНЕЦ КАК ДатаВыгрузкиДляСНП,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения
	               |		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.ПереводВНРП
	               |		ИНАЧЕ ПовагонныеОтправки.ДатаОкончанияПользования
	               |	КОНЕЦ КАК ДатаОкончанияДляСНПСлед,
	               |	ПовагонныеОтправки.Заявка КАК Заявка,
	               |	ПовагонныеОтправки.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	ПовагонныеОтправки.ПереводВНРП КАК ПереводВНРП,
	               |	ПовагонныеОтправки.ЦФО КАК ЦФО,
	               |	ПовагонныеОтправки.НДС КАК НДС,
	               |	ПовагонныеОтправки.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	               |ГДЕ
	               |	НЕ ПовагонныеОтправки.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ПовагонныеОтправки.ЦФО = &ЦФО
	               |	И ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	               |	И ПовагонныеОтправки.Калькуляция.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))
	               |	И ПовагонныеОтправки.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)
	               |	И ПовагонныеОтправки.Клиент В(&Клиенты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Повагонка.Период КАК Период,
	               |	Повагонка.НомерВагона КАК НомерВагона,
	               |	Повагонка.Клиент КАК Клиент,
	               |	Повагонка.Договор КАК Договор,
	               |	Повагонка.ПСЦ КАК ПСЦ,
	               |	Повагонка.Сделка КАК Сделка,
	               |	Повагонка.СтанцияОтправления КАК СтанцияОтправления,
	               |	Повагонка.ДатаОтправления КАК ДатаОтправления,
	               |	Повагонка.СтанцияНазначения КАК СтанцияНазначения,
	               |	Повагонка.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	Повагонка.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	Повагонка.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	Повагонка.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	Повагонка.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	Повагонка.Комментарий КАК Комментарий,
	               |	Повагонка.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	ВЫБОР
	               |		КОГДА НЕ Повагонка.ДатаВыгрузкиДляСНП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ Повагонка.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаВыгрузкиДляСНП, ДЕНЬ)
	               |	КОНЕЦ КАК ДельтаВыгрузки,
	               |	ВЫБОР
	               |		КОГДА НЕ Повагонка.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ Повагонка.ДатаОкончанияДляСНПСлед = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ)
	               |	КОНЕЦ КАК ДельтаОбщегоПользования,
	               |	Повагонка.Калькуляция КАК Калькуляция,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) > ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) - ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПВыгрузки,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) > ПСЦКалькуляцииПовагонки.НормативСледованияДни
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияНаСтанциюНазначения, Повагонка.ДатаОкончанияДляСНПСлед, ДЕНЬ) - ПСЦКалькуляцииПовагонки.НормативСледованияДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПСледования,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияДляСНП, Повагонка.ДатаОтправления, ДЕНЬ) - ПСЦКалькуляцииПовагонки.СНППогрузкиДни > 0
	               |			ТОГДА РАЗНОСТЬДАТ(Повагонка.ДатаПрибытияДляСНП, Повагонка.ДатаОтправления, ДЕНЬ) - ПСЦКалькуляцииПовагонки.СНППогрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНППогрузки,
	               |	Повагонка.РТУОсновнаяУслуга КАК РТУОсновнаяУслуга,
	               |	Повагонка.Заявка КАК Заявка,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияДни КАК НормативСледованияДни,
	               |	Повагонка.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	Повагонка.ПереводВНРП КАК ПереводВНРП,
	               |	Повагонка.ЦФО КАК ЦФО,
	               |	Повагонка.НДС КАК НДС,
	               |	Повагонка.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ ДанныеСНП
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.КалькуляцииПовагонки КАК ПСЦКалькуляцииПовагонки
	               |		ПО Повагонка.ПСЦ = ПСЦКалькуляцииПовагонки.Ссылка
	               |			И Повагонка.Калькуляция = ПСЦКалькуляцииПовагонки.Калькуляция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеСНП.Период КАК Период,
	               |	ДанныеСНП.НомерВагона КАК НомерВагона,
	               |	ДанныеСНП.Клиент КАК Клиент,
	               |	ДанныеСНП.Договор КАК Договор,
	               |	ДанныеСНП.ПСЦ КАК ПСЦ,
	               |	ДанныеСНП.Сделка КАК Сделка,
	               |	ДанныеСНП.СтанцияОтправления КАК СтанцияОтправления,
	               |	ДанныеСНП.ДатаОтправления КАК ДатаОтправления,
	               |	ДанныеСНП.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДанныеСНП.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ДанныеСНП.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	ДанныеСНП.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	ДанныеСНП.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	ДанныеСНП.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	ДанныеСНП.Комментарий КАК Комментарий,
	               |	ДанныеСНП.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	ДанныеСНП.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	ДанныеСНП.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	ДанныеСНП.Калькуляция КАК Калькуляция,
	               |	ДанныеСНП.СНПВыгрузки КАК СНПВыгрузки,
	               |	ДанныеСНП.СНПСледования КАК СНПСледования,
	               |	СделкаДоходыВагоны.ГУИД КАК ГУИДДоходов,
	               |	ДанныеСНП.РТУОсновнаяУслуга КАК РТУОсновнаяУслуга,
	               |	ДанныеСНП.Заявка КАК Заявка,
	               |	ДанныеСНП.СНППогрузки КАК СНППогрузки,
	               |	ДанныеСНП.НормативСледованияДни КАК НормативСледованияДни,
	               |	ДанныеСНП.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	ДанныеСНП.ПереводВНРП КАК ПереводВНРП,
	               |	ДанныеСНП.ЦФО КАК ЦФО,
	               |	ДанныеСНП.НДС КАК НДС,
	               |	ДанныеСНП.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ ДоходыСделки
	               |ИЗ
	               |	ДанныеСНП КАК ДанныеСНП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	               |		ПО ДанныеСНП.Сделка = СделкаДоходыВагоны.Ссылка
	               |			И (СделкаДоходыВагоны.Вагон ПОДОБНО ""%"" + ДанныеСНП.НомерВагона.Наименование + ""%"")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоходыСделки.Период КАК Период,
	               |	ДоходыСделки.НомерВагона КАК НомерВагона,
	               |	ДоходыСделки.Клиент КАК Клиент,
	               |	ДоходыСделки.Договор КАК Договор,
	               |	ДоходыСделки.ПСЦ КАК ПСЦ,
	               |	ДоходыСделки.Сделка КАК Сделка,
	               |	ДоходыСделки.СтанцияОтправления КАК СтанцияОтправления,
	               |	ДоходыСделки.ДатаОтправления КАК ДатаОтправления,
	               |	ДоходыСделки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДоходыСделки.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ДоходыСделки.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	ДоходыСделки.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	ДоходыСделки.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	ДоходыСделки.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	ДоходыСделки.Комментарий КАК Комментарий,
	               |	ДоходыСделки.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	ДоходыСделки.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	ДоходыСделки.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	ДоходыСделки.Калькуляция КАК Калькуляция,
	               |	ДоходыСделки.СНПВыгрузки КАК СНПВыгрузки,
	               |	ДоходыСделки.СНПСледования КАК СНПСледования,
	               |	ДоходыСделки.ГУИДДоходов КАК ГУИДДоходов,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.Комментарий КАК КомментарийСНП,
	               |	ДоходыСделки.РТУОсновнаяУслуга КАК РТУОсновнаяУслуга,
	               |	ДоходыСделки.Заявка КАК Заявка,
	               |	ДоходыСделки.СНППогрузки КАК СНППогрузки,
	               |	ДоходыСделки.НормативСледованияДни КАК НормативСледованияДни,
	               |	ДоходыСделки.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	ДоходыСделки.ПереводВНРП КАК ПереводВНРП,
	               |	ДоходыСделки.ЦФО КАК ЦФО,
	               |	ДоходыСделки.НДС КАК НДС,
	               |	ДоходыСделки.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ УслугаИзСделки
	               |ИЗ
	               |	ДоходыСделки КАК ДоходыСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ПО ДоходыСделки.Сделка = СделкаДоходы.Ссылка
	               |			И ДоходыСделки.ГУИДДоходов = СделкаДоходы.ГУИД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УслугаИзСделки.Период КАК Период,
	               |	УслугаИзСделки.НомерВагона КАК НомерВагона,
	               |	УслугаИзСделки.Клиент КАК Клиент,
	               |	УслугаИзСделки.Договор КАК Договор,
	               |	УслугаИзСделки.ПСЦ КАК ПСЦ,
	               |	УслугаИзСделки.Сделка КАК Сделка,
	               |	УслугаИзСделки.СтанцияОтправления КАК СтанцияОтправления,
	               |	УслугаИзСделки.ДатаОтправления КАК ДатаОтправления,
	               |	УслугаИзСделки.СтанцияНазначения КАК СтанцияНазначения,
	               |	УслугаИзСделки.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	УслугаИзСделки.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	УслугаИзСделки.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	УслугаИзСделки.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	УслугаИзСделки.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	УслугаИзСделки.Комментарий КАК Комментарий,
	               |	УслугаИзСделки.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	УслугаИзСделки.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	УслугаИзСделки.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	УслугаИзСделки.Калькуляция КАК Калькуляция,
	               |	УслугаИзСделки.СНПВыгрузки КАК СНПВыгрузки,
	               |	УслугаИзСделки.СНПСледования КАК СНПСледования,
	               |	УслугаИзСделки.ГУИДДоходов КАК ГУИДДоходов,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаПоЗаявке
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаОсновнаяУслуга,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаПоЗаявке
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |	КОНЕЦ КАК РТУОсновнаяУслуга,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНППогрузка
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаСНППогрузка,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНППогрузка
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |	КОНЕЦ КАК РТУСНППогрузка,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНПВыгрузка
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаСНПВыгрузка,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНПВыгрузка
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |	КОНЕЦ КАК РТУСНПВыгрузка,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНПСледование
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаСНПСледование,
	               |	ВЫБОР
	               |		КОГДА УслугаИзСделки.Услуга = &УслугаСНП
	               |				И УслугаИзСделки.КомментарийСНП = &КомментарийСНПСледование
	               |			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |	КОНЕЦ КАК РТУСНПСледование,
	               |	УслугаИзСделки.РТУОсновнаяУслуга КАК РТУОсновнаяУслугаСчетВыставлен,
	               |	УслугаИзСделки.Заявка КАК Заявка,
	               |	УслугаИзСделки.СНППогрузки КАК СНППогрузки,
	               |	УслугаИзСделки.НормативСледованияДни КАК НормативСледованияДни,
	               |	УслугаИзСделки.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	УслугаИзСделки.ПереводВНРП КАК ПереводВНРП,
	               |	УслугаИзСделки.ЦФО КАК ЦФО,
	               |	УслугаИзСделки.НДС КАК НДС,
	               |	УслугаИзСделки.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ ДанныеРТУ
	               |ИЗ
	               |	УслугаИзСделки КАК УслугаИзСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
				   //Евросиб СубботинВ #84453 06.08.2024 Начало // 
	             //  |		ПО УслугаИзСделки.Сделка = РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Сделка
				 	// Евросиб 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
				   //|		ПО УслугаИзСделки.Сделка = РеализацияТоваровУслугРасшифровкаУслугПоТС.УдалитьСделка
				   |		ПО УслугаИзСделки.Сделка = РеализацияТоваровУслугРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.Сделка
				 	// Евросиб Рыбьяков К.А. 24.07.2025 ))
				   //Евросиб СубботинВ #84453 06.08.2024 Конец // 
	               |			И УслугаИзСделки.ГУИДДоходов = РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаДоходовСделки
	               |			И (НЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеРТУ.Период КАК Период,
	               |	ДанныеРТУ.НомерВагона КАК НомерВагона,
	               |	ДанныеРТУ.Клиент КАК Клиент,
	               |	ДанныеРТУ.Договор КАК Договор,
	               |	ДанныеРТУ.ПСЦ КАК ПСЦ,
	               |	ДанныеРТУ.Сделка КАК Сделка,
	               |	ДанныеРТУ.СтанцияОтправления КАК СтанцияОтправления,
	               |	ДанныеРТУ.ДатаОтправления КАК ДатаОтправления,
	               |	ДанныеРТУ.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДанныеРТУ.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	ДанныеРТУ.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	ДанныеРТУ.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	ДанныеРТУ.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	ДанныеРТУ.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	ДанныеРТУ.Комментарий КАК Комментарий,
	               |	ДанныеРТУ.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	ДанныеРТУ.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	ДанныеРТУ.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	ДанныеРТУ.Калькуляция КАК Калькуляция,
	               |	ДанныеРТУ.СНПВыгрузки КАК СНПВыгрузки,
	               |	ДанныеРТУ.СНПСледования КАК СНПСледования,
	               |	ДанныеРТУ.ГУИДДоходов КАК ГУИДДоходов,
	               |	ДанныеРТУ.СуммаОсновнаяУслуга КАК СуммаОсновнаяУслуга,
	               |	ДанныеРТУ.РТУОсновнаяУслуга КАК РТУОсновнаяУслуга,
	               |	ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты КАК СуммаОплатыОсновнаяУслуга,
	               |	ДанныеРТУ.РТУСНППогрузка КАК РТУСНППогрузка,
	               |	ДанныеРТУ.СуммаСНППогрузка КАК СуммаСНППогрузка,
	               |	ПоступлениеНаРасчетныйСчетДокументыОплаты1.СуммаОплаты КАК СуммаОплатыСНППогрузка,
	               |	ДанныеРТУ.СуммаСНПВыгрузка КАК СуммаСНПВыгрузка,
	               |	ДанныеРТУ.РТУСНПВыгрузка КАК РТУСНПВыгрузка,
	               |	ПоступлениеНаРасчетныйСчетДокументыОплаты2.СуммаОплаты КАК СуммаОплатыВыгрузка,
	               |	ДанныеРТУ.СуммаСНПСледование КАК СуммаСНПСледование,
	               |	ДанныеРТУ.РТУСНПСледование КАК РТУСНПСледование,
	               |	ПоступлениеНаРасчетныйСчетДокументыОплаты3.СуммаОплаты КАК СуммаОплатыСНПСледование,
	               |	ДанныеРТУ.Заявка КАК Заявка,
	               |	ДанныеРТУ.СНППогрузки КАК СНППогрузки,
	               |	ВЫБОР
	               |		КОГДА НЕ ДанныеРТУ.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ДанныеРТУ.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК БезСделки,
	               |	ВЫБОР
	               |		КОГДА НЕ ДанныеРТУ.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЗавершенныйТрек,
	               |	ВЫБОР
	               |		КОГДА ДанныеРТУ.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	               |				ИЛИ ДанныеРТУ.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПосуточнаяОплата,
	               //|	ВыставлениеПосуточнойАрендыОбороты.Регистратор КАК СделкаИзРегистра,
	               |	ДанныеРТУ.НомерВагона.ТипТС КАК МодельВагона,
	               |	ДанныеРТУ.НомерВагона.ТипТС.Родитель КАК РазмерВагона,
	               //|	ВыставлениеПосуточнойАрендыОбороты.ГУИД КАК ГУИД,
	               |	"""" КАК ГУИД,
	               //|	ВыставлениеПосуточнойАрендыОбороты.КоличествоДней КАК КоличествоДнейОборот,
	               |	ДанныеРТУ.НормативСледованияДни КАК НормативСледованияДни,
	               |	ДанныеРТУ.ДатаОкончанияПользования КАК ДатаОкончанияПользования,
	               |	ДанныеРТУ.ПереводВНРП КАК ПереводВНРП,
	               //|	ВыставлениеПосуточнойАрендыОбороты.Регистратор КАК Регистратор,
	               |	ДанныеРТУ.ЦФО КАК ЦФО,
	               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ВидСобственности,
	               |	ДанныеРТУ.НДС КАК НДС,
	               |	ДанныеРТУ.УшедшийРейс КАК УшедшийРейс
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	ДанныеРТУ КАК ДанныеРТУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	               |		ПО ДанныеРТУ.РТУОсновнаяУслуга = ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации
	               |			И (ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.Проведен)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты1
	               |		ПО ДанныеРТУ.РТУСНППогрузка = ПоступлениеНаРасчетныйСчетДокументыОплаты1.ДокументРеализации
	               |			И (ПоступлениеНаРасчетныйСчетДокументыОплаты1.Ссылка.Проведен)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты3
	               |		ПО ДанныеРТУ.РТУСНПСледование = ПоступлениеНаРасчетныйСчетДокументыОплаты3.ДокументРеализации
	               |			И (ПоступлениеНаРасчетныйСчетДокументыОплаты3.Ссылка.Проведен)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты2
	               |		ПО ДанныеРТУ.РТУСНПВыгрузка = ПоступлениеНаРасчетныйСчетДокументыОплаты2.ДокументРеализации
	               |			И (ПоступлениеНаРасчетныйСчетДокументыОплаты2.Ссылка.Проведен)
	               //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды КАК ВыставлениеПосуточнойАрендыОбороты
				   //|		ПО ДанныеРТУ.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
				   //|			И ДанныеРТУ.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
				   //|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(
	               |				,
	               |				Вагон В
	               |					(ВЫБРАТЬ
	               |						ДанныеРТУ.НомерВагона КАК НомерВагона
	               |					ИЗ
	               |						ДанныеРТУ КАК ДанныеРТУ)) КАК ПризнакСобственностиВагонаСрезПоследних
	               |		ПО ДанныеРТУ.НомерВагона = ПризнакСобственностиВагонаСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итоговая.Период КАК ДатаПомещенияВРежимПовагонки,
	               |	Итоговая.НомерВагона КАК НомерВагона,
	               |	Итоговая.Клиент КАК Клиент,
	               |	Итоговая.Договор КАК Договор,
	               |	Итоговая.ПСЦ КАК ПСЦ,
	               |	Итоговая.Сделка КАК Сделка,
	               |	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	               |	Итоговая.ДатаОтправления КАК ДатаОтправления,
	               |	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	               |	Итоговая.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	Итоговая.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
	               |	Итоговая.РТУСНППогрузки КАК РТУСНППогрузки,
	               |	Итоговая.РТУСНПВыгрузки КАК РТУСНПВыгрузки,
	               |	Итоговая.РТУСНППеревозки КАК РТУСНППеревозки,
	               |	Итоговая.Комментарий КАК Комментарий,
	               |	Итоговая.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	Итоговая.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	Итоговая.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	Итоговая.Калькуляция КАК Калькуляция,
	               |	Итоговая.СНПВыгрузки КАК СНПВыгрузки,
	               |	Итоговая.СНПСледования КАК СНПСледования,
	               |	Итоговая.ГУИДДоходов КАК ГУИДДоходов,
	               |	Итоговая.СуммаОсновнаяУслуга КАК СуммаОсновнаяУслуга,
	               |	Итоговая.РТУОсновнаяУслуга КАК РТУОсновнаяУслуга,
	               |	Итоговая.СуммаОплатыОсновнаяУслуга КАК СуммаОплатыОсновнаяУслуга,
	               |	Итоговая.РТУСНППогрузка КАК РТУСНППогрузка,
	               |	Итоговая.СуммаСНППогрузка КАК СуммаСНППогрузка,
	               |	Итоговая.СуммаОплатыСНППогрузка КАК СуммаОплатыСНППогрузка,
	               |	Итоговая.СуммаСНПВыгрузка КАК СуммаСНПВыгрузка,
	               |	Итоговая.РТУСНПВыгрузка КАК РТУСНПВыгрузка,
	               |	Итоговая.СуммаОплатыВыгрузка КАК СуммаОплатыВыгрузка,
	               |	Итоговая.СуммаСНПСледование КАК СуммаСНПСледование,
	               |	Итоговая.РТУСНПСледование КАК РТУСНПСледование,
	               |	Итоговая.СуммаОплатыСНПСледование КАК СуммаОплатыСНПСледование,
	               |	Итоговая.Заявка КАК Заявка,
	               |	Итоговая.СНППогрузки КАК СНППогрузки,
	               |	Итоговая.БезСделки КАК БезСделки,
	               |	Итоговая.ЗавершенныйТрек КАК ЗавершенныйТрек,
	               |	Итоговая.ПосуточнаяОплата КАК ПосуточнаяОплата,
	               //|	Итоговая.СделкаИзРегистра КАК СделкаИзРегистра,
	               |	Значение(Документ.Сделка.ПустаяСсылка) КАК СделкаИзРегистра,
	               |	Итоговая.МодельВагона КАК МодельВагона,
	               |	Итоговая.РазмерВагона КАК РазмерВагона,
	               |	Итоговая.ГУИД КАК ГУИД,
	               |	ВЫБОР
	               |		КОГДА НЕ Итоговая.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НЕ Итоговая.ПосуточнаяОплата
	               |						ТОГДА Итоговая.НормативСледованияДни - 1
	               |					КОГДА Итоговая.ПосуточнаяОплата
	               |						ТОГДА ВЫБОР
	               |								КОГДА НЕ Итоговая.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ), ДЕНЬ)
	               |								КОГДА НЕ Итоговая.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ПереводВНРП, ДЕНЬ), ДЕНЬ)
	               |								КОГДА НЕ Итоговая.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(Итоговая.ДатаОкончанияПользования, ДЕНЬ), ДЕНЬ)
	               |								КОГДА Итоговая.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										И Итоговая.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										И Итоговая.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Итоговая.ДатаОтправления, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекДата, ДЕНЬ), ДЕНЬ)
	               |							КОНЕЦ
	               |				КОНЕЦ
	               |	КОНЕЦ + 1 КАК КоличествоДнейВсего,
				   //|	ВЫБОР
				   //|		КОГДА Итоговая.КоличествоДнейОборот = ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот
				   //|			ТОГДА ИСТИНА
				   //|		ИНАЧЕ ЛОЖЬ
				   //|	КОНЕЦ КАК ВыставленСчет,
				   |    ЛОЖЬ КАК ВыставленСчет, 
	               //|	Итоговая.КоличествоДнейОборот КАК КоличествоДнейОборот,
				   |    0 КАК КоличествоДнейОборот, 
	               |	Итоговая.ЦФО КАК ЦФО,
	               |	Итоговая.ВидСобственности КАК ВидСобственности,
	               |	Итоговая.НДС КАК НДС,
	               |	Итоговая.УшедшийРейс КАК УшедшийРейс
	               |ИЗ
	               |	Итоговая КАК Итоговая";
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
				   //|		ПО Итоговая.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
				   //|			И Итоговая.ГУИД = ВыставлениеПосуточнойАрендыОбороты.ГУИД
				   //|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)";

	Если ЗначениеЗаполнено(Отборы.ЦФО) Тогда
		Запрос.УстановитьПараметр("ЦФО", Отборы.ЦФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.ЦФО = &ЦФО", "");		
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Посуточная ставка" Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)", "");
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Ставка за вагон" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Калькуляция.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))", "");
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки <> "Ставка за КТК" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)", "");
	КонецЕсли;
	
	Если Отборы.ОтборПоКлиентам Тогда
		Запрос.УстановитьПараметр("Клиенты", Отборы.Клиенты);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПовагонныеОтправки.Клиент В(&Клиенты)", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	МассивОтвета = Новый Массив;
	
	Запрос.УстановитьПараметр("УслугаПоЗаявке",Константы.УслугаДляПовагоннойЗаявки.Получить());
	Запрос.УстановитьПараметр("УслугаСНП",Константы.УслугаСНППоВагону.Получить());
	Запрос.УстановитьПараметр("КомментарийСНППогрузка","СНП погрузки");
	Запрос.УстановитьПараметр("КомментарийСНПВыгрузка","СНП выгрузки");
	Запрос.УстановитьПараметр("КомментарийСНПСледование","СНП следования");
	ОтветВыполнить = Запрос.Выполнить();
	
	ОписаниеПолучившейсяСтруктуры = "";
	Для каждого Колонка из ОтветВыполнить.Колонки Цикл
		ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + Колонка.Имя;
	КонецЦикла;
	
	// добавим в структуру элемент для фильтрации по фин документам
	ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + "БезФинДокументов";
	
	//Ответ = ОтветВыполнить.Выбрать();
	//Пока Ответ.Следующий() Цикл
	//	ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
	//	ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Ответ);
	//	МассивОтвета.Добавить(ЭлементСтруктура);
	//КонецЦикла;
	ТЗ = ОтветВыполнить.Выгрузить();
	ТЗ.Свернуть("ДатаПомещенияВРежимПовагонки,НомерВагона, УшедшийРейс,Клиент,Договор,ПСЦ,Заявка, НДС, Сделка,СтанцияОтправления,ДатаОтправления,СтанцияНазначения,ДатаПрибытияНаСтанциюНазначения,ДатаОтправленияСоСтанцииНазначения,РТУСНППогрузки,РТУСНПВыгрузки,РТУСНППеревозки,Комментарий,Калькуляция,ВыставленСчет,КоличествоДнейВсего,КоличествоДнейОборот,СделкаИзРегистра,МодельВагона,РазмерВагона","СуммаОсновнаяУслуга,СуммаОплатыОсновнаяУслуга,СуммаСНППогрузка,СуммаОплатыСНППогрузка,СуммаСНПСледование,СуммаОплатыСНПСледование,СНППогрузки,СНПВыгрузки,СНПСледования");
	Для Каждого Стр Из ТЗ Цикл
		ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
		ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Стр);
		
		Если (НЕ Стр.СНППогрузки = 0 И НЕ Стр.РТУСНППогрузки) ИЛИ
			(НЕ Стр.СНПВыгрузки = 0 И НЕ Стр.РТУСНПВыгрузки) ИЛИ
			(НЕ Стр.СНПСледования = 0 И НЕ Стр.РТУСНППеревозки) ИЛИ
			(НЕ Стр.ВыставленСчет) Тогда
			ЭлементСтруктура.БезФинДокументов = Истина;
		Иначе
			ЭлементСтруктура.БезФинДокументов = Ложь;
		КонецЕсли;
		
		// значение элемента БезСделки заполним исходя из кол-ва дней без сделки
		//Если ЗначениеЗаполнено(Стр.КоличествоДнейБезСделок) И Стр.КоличествоДнейБезСделок>0 Тогда
		//	ЭлементСтруктура.БезСделки = Истина;
		//Иначе
		//	ЭлементСтруктура.БезСделки = Ложь;
		//КонецЕсли;
		
		МассивОтвета.Добавить(ЭлементСтруктура);
	КонецЦикла;

	Возврат МассивОтвета;
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьВагоныВПодходеСервер(Отборы)
	
	// вагоны в подходе к повагонке
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВагоныЗапланированныеКПовагонке.Вагон КАК НомерВагона,
	               |	ВагоныЗапланированныеКПовагонке.СтанцияОперации КАК ТекущаяСтанцияОперации,
	               |	ВагоныЗапланированныеКПовагонке.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ВагоныЗапланированныеКПовагонке.Груженый КАК Груженый,
	               |	ВагоныЗапланированныеКПовагонке.РасстояниеДоНазначения КАК РасстояниеДоСтанцииНазначения,
	               |	ВагоныЗапланированныеКПовагонке.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
	               |	ВагоныЗапланированныеКПовагонке.ДатаОперации КАК ДатаОперации,
	               |	ВагоныЗапланированныеКПовагонке.Вагон.ТипТС КАК МодельВагона,
	               |	ПаспортаВагоновСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	               |	ПаспортаВагоновСрезПоследних.ДатаСледующегоПлановогоРемонта КАК ДатаСледующегоРемонта,
	               |	ПаспортаВагоновСрезПоследних.ТипВагонаСсылка КАК ТипВагонаСсылка,
	               |	ВагоныЗапланированныеКПовагонке.Клиент КАК Клиент,
	               |	ВагоныЗапланированныеКПовагонке.Договор КАК Договор,
	               |	ВагоныЗапланированныеКПовагонке.Заявка КАК Заявка,
	               |	ВагоныЗапланированныеКПовагонке.ПСЦ КАК ПСЦ,
	               |	ВагоныЗапланированныеКПовагонке.Комментарий КАК Комментарий,
	               |	ВагоныЗапланированныеКПовагонке.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
	               |	ВагоныЗапланированныеКПовагонке.РегионОтправления КАК РегионОтправления,
	               |	ВагоныЗапланированныеКПовагонке.РегионВозврата КАК РегионВозврата,
	               |	ВагоныЗапланированныеКПовагонке.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
	               |	ВагоныЗапланированныеКПовагонке.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
	               |	ВагоныЗапланированныеКПовагонке.Калькуляция КАК Калькуляция,
	               |	ВагоныЗапланированныеКПовагонке.НДС КАК НДС,
	               |	ВагоныЗапланированныеКПовагонке.ПереводВНРП КАК ПереводВНРП,
	               |	ВагоныЗапланированныеКПовагонке.ВыводИзНРП КАК ВыводИзНРП,
	               |	ВагоныЗапланированныеКПовагонке.ЦФО КАК ЦФО
	               |ПОМЕСТИТЬ ВагоныПодход
	               |ИЗ
	               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |		ПО ВагоныЗапланированныеКПовагонке.Вагон = ПаспортаВагоновСрезПоследних.Вагон
	               |//ДополнительныеУсловия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ПериодДислокации
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
	               |			,
	               |			Вагон В
	               |				(ВЫБРАТЬ
	               |					ВагоныПодход.НомерВагона
	               |				ИЗ
	               |					ВагоныПодход КАК ВагоныПодход)) КАК ДислокацияВагоновСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагоновСрезПоследних.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.Период КАК Период,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияВагоновСрезПоследних.Груженый КАК Груженый,
	               |	ДислокацияВагоновСрезПоследних.НомерПоезда КАК НомерПоезда,
	               |	ДислокацияВагоновСрезПоследних.ИндексПоезда КАК ИндексПоезда,
	               |	ДислокацияВагоновСрезПоследних.КодГрузоотправителя КАК КодГрузоотправителя,
	               |	ДислокацияВагоновСрезПоследних.КодГрузополучателя КАК КодГрузополучателя,
	               |	ДислокацияВагоновСрезПоследних.Собственник КАК Собственник,
	               |	ДислокацияВагоновСрезПоследних.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
	               |	ДислокацияВагоновСрезПоследних.Груз КАК Груз,
	               |	ДислокацияВагоновСрезПоследних.ВесГруза КАК ВесГруза,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
	               |	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
	               |	ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	ДислокацияВагоновСрезПоследних.ПростойНаСтанции КАК ПростойНаСтанции
	               |ПОМЕСТИТЬ ДислокацияЪ
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодДислокации КАК ПериодДислокации
	               |		ПО ДислокацияВагоновСрезПоследних.Период = ПериодДислокации.Период
	               |			И ДислокацияВагоновСрезПоследних.Вагон = ПериодДислокации.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВагоныПодход.НомерВагона КАК НомерВагона,
	               |	ДислокацияЪ.СтанцияОперации КАК ТекущаяСтанцияОперации,
	               |	ДислокацияЪ.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияЪ.Груженый КАК Груженый,
	               |	РасстоянияМеждуЛокациями.РасстояниеКМ КАК РасстояниеДоСтанцииНазначения,
	               |	ВагоныПодход.СобытиеПереводаВПовагонку КАК СобытиеПереводаВПовагонку,
	               |	ДислокацияЪ.Период КАК ДатаОперации,
	               |	ВагоныПодход.МодельВагона КАК МодельВагона,
	               |	ВагоныПодход.Грузоподъемность КАК Грузоподъемность,
	               |	ВагоныПодход.ДатаСледующегоРемонта КАК ДатаСледующегоРемонта,
	               |	ВагоныПодход.ТипВагонаСсылка КАК ТипВагонаСсылка,
	               |	ВагоныПодход.Клиент КАК Клиент,
	               |	ВагоныПодход.Договор КАК Договор,
	               |	ВагоныПодход.Заявка КАК Заявка,
	               |	ВагоныПодход.ПСЦ КАК ПСЦ,
	               |	ВагоныПодход.Комментарий КАК Комментарий,
	               |	ВагоныПодход.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
	               |	ВагоныПодход.РегионОтправления КАК РегионОтправления,
	               |	ВагоныПодход.РегионВозврата КАК РегионВозврата,
	               |	ВагоныПодход.ЗаявкаНеПодходит КАК ЗаявкаНеПодходит,
	               |	ВагоныПодход.ДатаПередачиВПользование КАК ДатаПередачиВПользование,
	               |	ВагоныПодход.Калькуляция КАК Калькуляция,
	               |	ВагоныПодход.НДС КАК НДС,
	               |	ВагоныПодход.ПереводВНРП КАК ПереводВНРП,
	               |	ВагоныПодход.ВыводИзНРП КАК ВыводИзНРП,
	               |	ВагоныПодход.НомерВагона.ТипТС.Родитель КАК РазмерВагона,
	               |	ВагоныПодход.ЦФО КАК ЦФО
	               |ИЗ
	               |	ВагоныПодход КАК ВагоныПодход
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
	               |			ПО ДислокацияЪ.СтанцияОперации = РасстоянияМеждуЛокациями.Локация1
	               |				И ДислокацияЪ.СтанцияНазначения = РасстоянияМеждуЛокациями.Локация2
	               |		ПО ВагоныПодход.НомерВагона = ДислокацияЪ.Вагон";
	
	ДополнительныеУсловия = Новый Массив;
	
	Если ЗначениеЗаполнено(Отборы.ЦФО) Тогда
		Запрос.УстановитьПараметр("ЦФО", Отборы.ЦФО);
		ДополнительныеУсловия.Добавить("ВагоныЗапланированныеКПовагонке.ЦФО = &ЦФО");		
	КонецЕсли;
	
	Если Отборы.ОтборТипСтавки = "Посуточная ставка" Тогда		
		ДополнительныеУсловия.Добавить("ВагоныЗапланированныеКПовагонке.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)");
	ИначеЕсли Отборы.ОтборТипСтавки = "Ставка за вагон" Тогда
		ДополнительныеУсловия.Добавить("ВагоныЗапланированныеКПовагонке.Калькуляция.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))");
	ИначеЕсли Отборы.ОтборТипСтавки = "Ставка за КТК" Тогда
		ДополнительныеУсловия.Добавить("ВагоныЗапланированныеКПовагонке.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Мультимодальная)");
	КонецЕсли;
	
	Если Отборы.ОтборПоКлиентам Тогда
		Запрос.УстановитьПараметр("Клиенты", Отборы.Клиенты);
		ДополнительныеУсловия.Добавить("ВагоныЗапланированныеКПовагонке.Клиент В(&Клиенты)");
	КонецЕсли;
	
	Если ДополнительныеУсловия.Количество() > 0 Тогда
		ТекстУсловий = СтрСоединить(ДополнительныеУсловия, Символы.ПС + "	И ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ДополнительныеУсловия", "ГДЕ " + ТекстУсловий)
	КонецЕсли;

	МассивОтвета = Новый Массив;
	ОтветВыполнить = Запрос.Выполнить();
	
	ОписаниеПолучившейсяСтруктуры = "";
	Для каждого Колонка из ОтветВыполнить.Колонки Цикл
		ОписаниеПолучившейсяСтруктуры = ОписаниеПолучившейсяСтруктуры + ?(ОписаниеПолучившейсяСтруктуры = "", "", ",") + Колонка.Имя;
	КонецЦикла;
	
	Ответ = ОтветВыполнить.Выбрать();
	Пока Ответ.Следующий() Цикл
		ЭлементСтруктура = Новый Структура(ОписаниеПолучившейсяСтруктуры);
		ЗаполнитьЗначенияСвойств(ЭлементСтруктура, Ответ);
		МассивОтвета.Добавить(ЭлементСтруктура);
	КонецЦикла;

	Возврат МассивОтвета;
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,ВыводИзПовагонки,ЗаявкаИзменилась,ЭтоПодход,ВходВРейс)
	
	ЗаявкаИзменилась = Ложь;
	Если ЭтоПодход Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон,
		               |	ВагоныЗапланированныеКПовагонке.Заявка КАК Заявка
		               |ИЗ
		               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
		               |ГДЕ
		               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
		
		Запрос.УстановитьПараметр("Вагон", СтруктураДанныхСтроки.НомерВагона);
		ИмяРегистра = "ВагоныЗапланированныеКПовагонке";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
		               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон,
		               |	ПовагонныеОтправкиСрезПоследних.Заявка КАК Заявка
		               |ИЗ
		               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
		               |			,
		               |			Вагон = &Вагон
		               |				И Период = &Период) КАК ПовагонныеОтправкиСрезПоследних";
		
		Запрос.УстановитьПараметр("Вагон", СтруктураДанныхСтроки.НомерВагона);
		Запрос.УстановитьПараметр("Период", СтруктураДанныхСтроки.ДатаПомещенияВРежимПовагонки);
		ИмяРегистра = "ПовагонныеОтправки";
	КонецЕсли;
	
	ДанныеСтрокиНДС = Неопределено;
	Если СтруктураДанныхСтроки.Свойство("НДС", ДанныеСтрокиНДС) И Не ЗначениеЗаполнено(ДанныеСтрокиНДС) Тогда
		
		//Евросиб Каблов 10.02.2021 ( Ticket#0213432
		//ДанныеСтрокиПСЦ = Неопределено;
		//Если СтруктураДанныхСтроки.Свойство("ПСЦ", ДанныеСтрокиПСЦ) И ЗначениеЗаполнено(ДанныеСтрокиПСЦ) Тогда
		//	СтруктураДанныхСтроки.НДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтрокиПСЦ, "СтавкаНДС");
		//КонецЕсли;
		//
		//ДанныеСтрокиКалькуляция = Неопределено;
		//Если Не ЗначениеЗаполнено(СтруктураДанныхСтроки.НДС) И СтруктураДанныхСтроки.Свойство("Калькуляция", ДанныеСтрокиКалькуляция) И ЗначениеЗаполнено(ДанныеСтрокиКалькуляция) Тогда
		//	СтруктураДанныхСтроки.НДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтрокиКалькуляция, "СтавкаНДС");
		//КонецЕсли;
		ДанныеСтрокиКалькуляция = Неопределено;
		Если СтруктураДанныхСтроки.Свойство("Калькуляция", ДанныеСтрокиКалькуляция) И ЗначениеЗаполнено(ДанныеСтрокиКалькуляция) Тогда
			СтруктураДанныхСтроки.НДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтрокиКалькуляция, "СтавкаНДС");
		КонецЕсли;
		//Евросиб Каблов 10.02.2021 )
		
	КонецЕсли;
	
	РЗ = Запрос.Выполнить();
	Если НЕ РЗ.Пустой() Тогда
		Ответ = РЗ.Выбрать();
		// если запись есть - изменить ее
		Если Ответ.Следующий() Тогда
			ТекЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
			ТекЗапись2 = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
			
			ТекЗапись.Прочитать();
			Если НЕ ТекЗапись.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
			КонецЕсли;
			
			ДанныеСтрокиЗаявка = Неопределено;
			Если СтруктураДанныхСтроки.Свойство("Заявка", ДанныеСтрокиЗаявка) И НЕ Ответ.Заявка = ДанныеСтрокиЗаявка Тогда
				ЗаявкаИзменилась = Истина;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТекЗапись,СтруктураДанныхСтроки);
			
			Если ВыводИзПовагонки Тогда
				ТекЗапись.ВыводИзПовагонки = ТекущаяДата();
				ТекЗапись.СобытиеВыводаИзПовагонки = Перечисления.СобытияВыводаИзПовагонки.Вручную;
				ТекЗапись.СтанцияВывода = СтруктураДанныхСтроки.ТекущаяДислокацияПоСлежению;
				ТекЗапись.ОтветственныйУдалилДанные = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			// если вагон ушел в ремонт, то очистить у него дату передачи в пользование.
			Если ЗначениеЗаполнено(ТекЗапись.ПереводВНРП) И 
				НЕ ЗначениеЗаполнено(ТекЗапись.ВыводИзНРП) Тогда
				
				ТекЗапись.ДатаПередачиВПользование = "";
				// если вагон вернулся из ремонта, заполнить ему дату передачи в пользование как дату вывода из НРП
			ИначеЕсли ЗначениеЗаполнено(ТекЗапись.ПереводВНРП) И 
				ЗначениеЗаполнено(ТекЗапись.ВыводИзНРП) И
				НЕ ЗначениеЗаполнено(ТекЗапись.ДатаПередачиВПользование) Тогда
				
				ТекЗапись.ДатаПередачиВПользование = ТекЗапись.ВыводИзНРП;
			КонецЕсли;
			
			Если НЕ ИмяРегистра = "ПовагонныеОтправки" Тогда
				// если вагон находится в плановом регистре, только что вернулся из ремонта и его станция
				// операции находится в регионе отправления, то перенести данные из планового в фактический
				РегионОтправленияИерархМассив = Локации_сервер.ПолучитьМассивРодителей(СтруктураДанныхСтроки.ТекущаяСтанцияОперации,Истина);
				
				Если ЗначениеЗаполнено(ТекЗапись.ПереводВНРП) И 
					ЗначениеЗаполнено(ТекЗапись.ВыводИзНРП) И
					НЕ РегионОтправленияИерархМассив.Найти(ТекЗапись.РегионОтправления) = Неопределено Тогда
					
					ТекЗапись3 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
					
					ЗаполнитьЗначенияСвойств(ТекЗапись3,ТекЗапись);
					ТекЗапись3.Период = ТекЗапись.ВыводИзНРП;
					ТекЗапись3.Записать();
					// Удаление из регистра ВагоныЗапланированныеКПовагонке.
					ТекЗапись.Удалить();
					
				Иначе
					ТекЗапись.Записать();
						
				КонецЕсли;
			Иначе
				ТекЗапись.Записать();
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		// если записи нет, создать новую
		ТекЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,СтруктураДанныхСтроки);
		ТекЗапись.Вагон = СтруктураДанныхСтроки.НомерВагона;
		Если ИмяРегистра = "ПовагонныеОтправки" Тогда
			
			Если НЕ ЗначениеЗаполнено(СтруктураДанныхСтроки.ДатаПередачиВПользование) Тогда
				ПередачаВПользование = ТекущаяДата();
			Иначе
				ПередачаВПользование = СтруктураДанныхСтроки.ДатаПередачиВПользование;
			КонецЕсли;
			
			
			ТекЗапись.Период = СтруктураДанныхСтроки.ДатаПомещенияВРежимПовагонки;
			ТекЗапись.ОтветственныйВнесДанные = Пользователи.ТекущийПользователь();
			// получить данные по вагону из дислокации
			Если ВходВРейс = Ложь ИЛИ ВходВРейс = Неопределено Тогда
				ЗапросДисл = Новый Запрос;
				// сначала выберем дату максимально приближенную к указанной
				
				ЗапросДисл.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                   |	ДислокацияВагонов.Период КАК Период,
				                   |	ДислокацияВагонов.Вагон КАК Вагон
				                   |ИЗ
				                   |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
				                   |ГДЕ
				                   |	ДислокацияВагонов.Вагон = &Вагон
				                   |	И ДислокацияВагонов.Период <= &Период
				                   |
				                   |УПОРЯДОЧИТЬ ПО
				                   |	Период УБЫВ";
				ЗапросДисл.УстановитьПараметр("Вагон",СтруктураДанныхСтроки.НомерВагона);
				ЗапросДисл.УстановитьПараметр("Период",ПередачаВПользование);
				Ответ = ЗапросДисл.Выполнить().Выбрать();
				Если Ответ.Следующий() Тогда
					ПериодОтбор = Ответ.Период;	
				
				
					ЗапросДисл.Текст = "ВЫБРАТЬ
					                   |	МИНИМУМ(ДислокацияВагонов.Период) КАК Период,
					                   |	ДислокацияВагонов.Вагон КАК Вагон
					                   |ПОМЕСТИТЬ МаксПериод
					                   |ИЗ
					                   |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
					                   |ГДЕ
					                   |	ДислокацияВагонов.Вагон = &Вагон
					                   |	И ДислокацияВагонов.Период = &Период
					                   |
					                   |СГРУППИРОВАТЬ ПО
					                   |	ДислокацияВагонов.Вагон
					                   |;
					                   |
					                   |////////////////////////////////////////////////////////////////////////////////
					                   |ВЫБРАТЬ
					                   |	МИНИМУМ(ДислокацияВагонов.Период) КАК Период,
					                   |	ДислокацияВагонов.Вагон КАК Вагон,
					                   |	МИНИМУМ(ДислокацияВагонов.ОперацияСВагоном) КАК ОперацияСВагоном
					                   |ПОМЕСТИТЬ ОперВаг
					                   |ИЗ
					                   |	МаксПериод КАК МаксПериод
					                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
					                   |		ПО МаксПериод.Период = ДислокацияВагонов.Период
					                   |			И МаксПериод.Вагон = ДислокацияВагонов.Вагон
					                   |
					                   |СГРУППИРОВАТЬ ПО
					                   |	ДислокацияВагонов.Вагон
					                   |;
					                   |
					                   |////////////////////////////////////////////////////////////////////////////////
					                   |ВЫБРАТЬ
					                   |	ДислокацияВагонов.Период КАК Период2,
					                   |	ДислокацияВагонов.Вагон КАК Вагон,
					                   |	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
					                   |	ДислокацияВагонов.РабочийПарк КАК РабочийПарк,
					                   |	ДислокацияВагонов.Груженый КАК Груженый,
					                   |	ДислокацияВагонов.НомерПоезда КАК НомерПоезда,
					                   |	ДислокацияВагонов.ИндексПоезда КАК ИндексПоезда,
					                   |	ДислокацияВагонов.КодГрузоотправителя КАК КодГрузоотправителя,
					                   |	ДислокацияВагонов.КодГрузополучателя КАК КодГрузополучателя,
					                   |	ДислокацияВагонов.Собственник КАК Собственник,
					                   |	ДислокацияВагонов.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
					                   |	ДислокацияВагонов.Груз КАК Груз,
					                   |	ДислокацияВагонов.ВесГруза КАК ВесГруза,
					                   |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации,
					                   |	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
					                   |	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления,
					                   |	ДислокацияВагонов.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
					                   |	ДислокацияВагонов.ПростойНаСтанции КАК ПростойНаСтанции
					                   |ИЗ
					                   |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
					                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОперВаг КАК ОперВаг
					                   |		ПО ДислокацияВагонов.Период = ОперВаг.Период
					                   |			И ДислокацияВагонов.Вагон = ОперВаг.Вагон
					                   |			И ДислокацияВагонов.ОперацияСВагоном = ОперВаг.ОперацияСВагоном";
					ЗапросДисл.УстановитьПараметр("Вагон",СтруктураДанныхСтроки.НомерВагона);
					ЗапросДисл.УстановитьПараметр("Период",ПериодОтбор);
					ОтветДисл = ЗапросДисл.Выполнить().Выбрать();
					Если ОтветДисл.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(ТекЗапись,ОтветДисл);
						
						//Если ВходВРейс = Ложь Тогда
						//	ТекЗапись.СтанцияОтправления = ОтветДисл.СтанцияОперации;
						//	ТекЗапись.ДатаПрибытияНаСтанцию = ОтветДисл.ДатаПрибытияНаСтанцию;
						//КонецЕсли;
						ТекЗапись.ДатаПередачиВПользование = ОтветДисл.ДатаПрибытияНаСтанцию;
					КонецЕсли;
				КонецЕсли;	
			Иначе
				ЗапросДисл = Новый Запрос;
				ЗапросДисл.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	ДислокацияВагоновСрезПоследних.Период КАК Период,
				               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
				               |	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
				               |	ДислокацияВагоновСрезПоследних.РабочийПарк КАК РабочийПарк,
				               |	ДислокацияВагоновСрезПоследних.Груженый КАК Груженый,
				               |	ДислокацияВагоновСрезПоследних.НомерПоезда КАК НомерПоезда,
				               |	ДислокацияВагоновСрезПоследних.ИндексПоезда КАК ИндексПоезда,
				               |	ДислокацияВагоновСрезПоследних.КодГрузоотправителя КАК КодГрузоотправителя,
				               |	ДислокацияВагоновСрезПоследних.КодГрузополучателя КАК КодГрузополучателя,
				               |	ДислокацияВагоновСрезПоследних.Собственник КАК Собственник,
				               |	ДислокацияВагоновСрезПоследних.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
				               |	ДислокацияВагоновСрезПоследних.Груз КАК Груз,
				               |	ДислокацияВагоновСрезПоследних.ВесГруза КАК ВесГруза,
				               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
				               |	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
				               |	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
				               |	ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
				               |	ДислокацияВагоновСрезПоследних.ПростойНаСтанции КАК ПростойНаСтанции,
				               |	ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
				               |	ДислокацияВагоновСрезПоследних.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
				               |ИЗ
				               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(, Вагон = &Вагон) КАК ДислокацияВагоновСрезПоследних
				               |ГДЕ
				               |	ДислокацияВагоновСрезПоследних.Период <= &Период
				               |	И ДислокацияВагоновСрезПоследних.СтанцияОперации = ДислокацияВагоновСрезПоследних.СтанцияОтправления
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Период УБЫВ";
				ЗапросДисл.УстановитьПараметр("Вагон",СтруктураДанныхСтроки.НомерВагона);
				ЗапросДисл.УстановитьПараметр("Период",ПередачаВПользование);
				
				ОтветДисл = ЗапросДисл.Выполнить().Выбрать();
				Если ОтветДисл.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(ТекЗапись,ОтветДисл);
					ТекЗапись.ДатаПередачиВПользование = ОтветДисл.ДатаПрибытияНаСтанцию;
					ТекЗапись.Период = ОтветДисл.ДатаПрибытияНаСтанцию;
				КонецЕсли;
				
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если СтруктураДанныхСтроки.Свойство("Заявка") И ЗначениеЗаполнено(СтруктураДанныхСтроки.Заявка) Тогда
			ЗаявкаИзменилась = Истина;
		КонецЕсли;
				
		ТекЗапись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущийЭлемент.Имя = "ВагоныВПовагонкеПометка" Тогда
		Возврат;	
	КонецЕсли; 
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ПроверкаКалькуляцииИЗаявки(ТекД,Истина);
	
	СтруктураДанныхСтроки = Новый Структура;
	Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
		Попытка
			СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,ТекД[ЭлемСп.Значение]);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЗаявкаИзменилась = Ложь;
	СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Ложь,Неопределено);
	
	ЗаполнитьЗначенияСвойств(ТекД, СтруктураДанныхСтроки);
	
	// записать данные в заявку. перезаписываем только в том случае, если заявка изменилась
	Если ЗначениеЗаполнено(ТекД.Заявка) И ЗаявкаИзменилась Тогда
		МассивЗаявокКЗаписи = Новый Массив;
		МассивЗаявокКЗаписи.Добавить(СтруктураДанныхСтроки);
		Если МассивЗаявокКЗаписи.Количество()>0 Тогда
			Фактическая = Истина;
			ЗаписатьДанныеПоВагонуВЗаявку(МассивЗаявокКЗаписи,Фактическая);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКалькуляцииИЗаявки(ТекД,Фактическая)
	
	Если ЗначениеЗаполнено(ТекД.Калькуляция) Тогда
		// проверка калькуляции
		ПараметрыЗапроса = Новый СТруктура;
		Если Фактическая Тогда
			//ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияПодачи);
			ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
			ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
			//ПараметрыЗапроса.Вставить("ПунктНазначения",Неопределено);
		Иначе
			ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.РегионОтправления);
			ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.РегионВозврата);
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("НДС",ТекД.НДС);
		ПараметрыЗапроса.Вставить("Вагон",ТекД.НомерВагона);
		//Евросиб Каблов 07.04.2021 (
		ПараметрыЗапроса.Вставить("ПСЦ", ТекД.ПСЦ);
		//Евросиб Каблов 07.04.2021 )
		
		МассивПодходящихКалькуляций = ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса);
		Если МассивПодходящихКалькуляций.Найти(ТекД.Калькуляция) = Неопределено Тогда
			ТекД.КалькуляцияНеПодходит = Истина;
		Иначе
			ТекД.КалькуляцияНеПодходит = Ложь;
		КонецЕсли;
	Иначе
		ТекД.КалькуляцияНеПодходит = Ложь;
	КонецЕсли;
	
	// проверка на подходящую заявку только в фактической части, т.к. в подходе еще не известны данные для создания рейса
	Если Фактическая И ЗначениеЗаполнено(ТекД.Заявка) Тогда
		// проверка заявки
		ПараметрыЗапроса = Новый СТруктура;
		Если Фактическая Тогда
			//ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияПодачи);
			ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
			//ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
			ПараметрыЗапроса.Вставить("ПунктНазначения", Неопределено);
			ПараметрыЗапроса.Вставить("ДатаОтправления",?(ЗначениеЗаполнено(ТекД.ДатаОтправления),ТекД.ДатаОтправления,ТекД.ДатаПередачиВПользование));
			// получаем дату прибытия по табельному расписанию
			ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ТекД.СтанцияОтправления, ТекД.СтанцияНазначения);
			КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
			Если ЗначениеЗаполнено(КолвоДн) Тогда
				ДатаПриб = ТекД.ДатаОтправления + КолвоДн*24;
			КонецЕсли;
			Если ЗначениеЗаполнено(КолвоДн) Тогда
				ПараметрыЗапроса.Вставить("ДатаПрибытия",?(ЗначениеЗаполнено(ТекД.ДатаОтправления),ТекД.ДатаОтправления,ТекД.ДатаПередачиВПользование) + КолвоДн);
			КонецЕсли;
		Иначе
			ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.РегионОтправления);
			ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.РегионВозврата);
			ПараметрыЗапроса.Вставить("ДатаОтправления",ТекД.ДатаПередачиВПользование);
			// получаем дату прибытия по табельному расписанию
			ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ТекД.РегионОтправления, ТекД.РегионВозврата);
			КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
			Если ЗначениеЗаполнено(КолвоДн) Тогда
				ДатаПриб = ТекД.ДатаПередачиВПользование + КолвоДн*24;
			КонецЕсли;
			Если ЗначениеЗаполнено(КолвоДн) Тогда
				ПараметрыЗапроса.Вставить("ДатаПрибытия",ТекД.ДатаПередачиВПользование + КолвоДн);
			КонецЕсли;
		КонецЕсли;
		ПараметрыЗапроса.Вставить("ПСЦ",ТекД.ПСЦ);
	
		МассивПодходящихЗаявок = ПолучитьСписокПодходящихЗаявок(ПараметрыЗапроса);
		
		//Если МассивПодходящихЗаявок.Найти(ТекД.Заявка) = Неопределено Тогда
		//	ТекД.ЗаявкаНеПодходит = Истина;
		//Иначе
			ТекД.ЗаявкаНеПодходит = Ложь;
		//КонецЕсли;
	Иначе
		ТекД.ЗаявкаНеПодходит = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеКлиентПриИзменении(Элемент)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеКлиента(ТекД);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКлиента(ТекД)
	
	// очищаем договор и ПСЦ
	ТекД.Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	ТекД.ПСЦ = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Клиент",ТекД.Клиент);
	СтруктураЗапроса.Вставить("Договор",ТекД.Договор);
	СтруктураОтвета = ПолучитьДоговорПСЦ(СтруктураЗапроса);
	ЗаполнитьЗначенияСвойств(ТекД,СтруктураОтвета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоговорПСЦ(СтруктураЗапроса)
	
	// если у клиента один договор и/или один ПСЦ, то подставим их автоматически
	
	Договор = СтруктураЗапроса.Договор;
	ПСЦ = Документы.ПСЦ.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗапроса.Договор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",СтруктураЗапроса.Клиент);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() = 1 Тогда
			Договор = ТЗ[0].Ссылка;
		Иначе
			Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПСЦ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ПСЦ КАК ПСЦ
		               |ГДЕ
		               |	ПСЦ.Договор = &Договор";
		Запрос.УстановитьПараметр("Договор",Договор);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() = 1 Тогда
			ПСЦ = ТЗ[0].Ссылка;
		Иначе
			ПСЦ = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗапроса.Вставить("Договор",Договор);
	СтруктураЗапроса.Вставить("ПСЦ",ПСЦ);
	
	Возврат СтруктураЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеПоВагонуВЗаявку(МассивЗаявокКЗаписи,Фактическая)
	
	ТЗ_Заявки = Новый ТаблицаЗначений;
	ТЗ_Заявки.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТЗ_Заявки.Колонки.Добавить("СтанцияОтправления",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявки.Колонки.Добавить("СтанцияНазначения",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявки.Колонки.Добавить("Калькуляция",Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	ТЗ_Заявки.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ_Заявки.Колонки.Добавить("ДатаПередачиВПользование",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ_Заявки.Колонки.Добавить("РегионОтправления",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявки.Колонки.Добавить("РегионВозврата",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявки.Колонки.Добавить("Заявка",Новый ОписаниеТипов("ДокументСсылка.Заявка"));

	Для Каждого Эл Из МассивЗаявокКЗаписи Цикл
		НовСтр = ТЗ_Заявки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТЧ КАК ВремТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ КАК ВТ
		|ИТОГИ ПО
		|	ВТ.Заявка";
	Запрос.УстановитьПараметр("ВремТЧ",ТЗ_Заявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаявка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаЗаявка.Выбрать();
		
		Заявка = ВыборкаЗаявка.Заявка;
		Если Не ЗначениеЗаполнено(Заявка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолучОб = Заявка.ПОлучитьОбъект();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТЧ_СоставУслуги = ПолучОб.СоставУслуги;
			ПараметрыОтбора = Новый СТруктура;
			ПараметрыОтбора.Вставить("Вагон",ВыборкаДетальныеЗаписи.НомерВагона);
			НайденныеСтроки = ТЧ_СоставУслуги.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = ТЧ_СоставУслуги.Добавить();
				НовСтр.Вагон = ВыборкаДетальныеЗаписи.НомерВагона;
				НовСтр.Услуга = Константы.УслугаДляПовагоннойЗаявки.Получить();
				НовСтр.СтанцияОтправления = ВыборкаДетальныеЗаписи.СтанцияОтправления;
				НовСтр.СтанцияНазначения = ВыборкаДетальныеЗаписи.СтанцияНазначения;
				НовСтр.ПунктОтправления = ВыборкаДетальныеЗаписи.СтанцияОтправления;
				НовСтр.ПунктНазначения = ВыборкаДетальныеЗаписи.СтанцияНазначения;
				НовСтр.ТипВагона = ВыборкаДетальныеЗаписи.НомерВагона.ТипТС;
				НовСтр.ГУИДСтроки = Новый УникальныйИдентификатор;
				НовСтр.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
				
				// добавить вагоны в регистр вагоны в отправках
				ПараметрыЗапроса = Новый СТруктура;
				Если Фактическая Тогда
					ПараметрыЗапроса.Вставить("ПунктОтправления",ВыборкаДетальныеЗаписи.СтанцияОтправления);
					ПараметрыЗапроса.Вставить("ПунктНазначения",ВыборкаДетальныеЗаписи.СтанцияНазначения);
					ПараметрыЗапроса.Вставить("ДатаОтправления",?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОтправления),ВыборкаДетальныеЗаписи.ДатаОтправления,ВыборкаДетальныеЗаписи.ДатаПередачиВПользование));
					// получаем дату прибытия по табельному расписанию
					ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ВыборкаДетальныеЗаписи.СтанцияОтправления, ВыборкаДетальныеЗаписи.СтанцияНазначения);
					КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
					Если ЗначениеЗаполнено(КолвоДн) Тогда
						ДатаПриб = ВыборкаДетальныеЗаписи.ДатаОтправления + КолвоДн*24;
					КонецЕсли;
					Если ЗначениеЗаполнено(КолвоДн) Тогда
						ПараметрыЗапроса.Вставить("ДатаПрибытия",?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОтправления),ВыборкаДетальныеЗаписи.ДатаОтправления,ВыборкаДетальныеЗаписи.ДатаПередачиВПользование) + КолвоДн);
					КонецЕсли;
				Иначе
					ПараметрыЗапроса.Вставить("ПунктОтправления",ВыборкаДетальныеЗаписи.РегионОтправления);
					ПараметрыЗапроса.Вставить("ПунктНазначения",ВыборкаДетальныеЗаписи.РегионВозврата);
					ПараметрыЗапроса.Вставить("ДатаОтправления",ВыборкаДетальныеЗаписи.ДатаПередачиВПользование);
					// получаем дату прибытия по табельному расписанию
					ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ВыборкаДетальныеЗаписи.РегионОтправления, ВыборкаДетальныеЗаписи.РегионВозврата);
					КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
					Если ЗначениеЗаполнено(КолвоДн) Тогда
						ДатаПриб = ВыборкаДетальныеЗаписи.ДатаОтправления + КолвоДн*24;
					КонецЕсли;
					Если ЗначениеЗаполнено(КолвоДн) Тогда
						ПараметрыЗапроса.Вставить("ДатаПрибытия",ВыборкаДетальныеЗаписи.ДатаПередачиВПользование + КолвоДн);
					КонецЕсли;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка,
				               |	МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс) КАК Рейс
				               |ИЗ
				               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
				               |ГДЕ
				               |	ЗаявкаПереченьРейсов.Рейс.ПунктОтправления В ИЕРАРХИИ(&ПунктОтправления)
				               |	И ЗаявкаПереченьРейсов.Рейс.ПунктНазначения В ИЕРАРХИИ(&ПунктНазначения)
				               |	И ВЫБОР
				               |			КОГДА &ДатаЕсть = ИСТИНА
				               |				ТОГДА ЗаявкаПереченьРейсов.Рейс.ДатаПрибытия = &ДатаПрибытия
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ЗаявкаПереченьРейсов.Рейс.ДатаОтправления = &ДатаОтправления
				               |	И ЗаявкаПереченьРейсов.Ссылка = &Ссылка
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ЗаявкаПереченьРейсов.Ссылка";
				Запрос.УстановитьПараметр("Ссылка",Заявка.Ссылка);
				Запрос.УстановитьПараметр("ПунктОтправления",ПараметрыЗапроса.ПунктОтправления);
				Запрос.УстановитьПараметр("ПунктНазначения",ПараметрыЗапроса.ПунктНазначения);
				Запрос.УстановитьПараметр("ДатаОтправления",ПараметрыЗапроса.ДатаОтправления);
				Если ПараметрыЗапроса.Свойство("ДатаПрибытия") И ЗначениеЗаполнено(ПараметрыЗапроса.ДатаПрибытия) ТОгда
					Запрос.УстановитьПараметр("ДатаЕсть",Истина);
					Запрос.УстановитьПараметр("ДатаПрибытия",ПараметрыЗапроса.ДатаПрибытия);
				Иначе
					Запрос.УстановитьПараметр("ДатаЕсть",Ложь);
					Запрос.УстановитьПараметр("ДатаПрибытия",1);
				КонецЕсли;

				Ответ = Запрос.Выполнить().Выбрать();
				Если Ответ.Следующий() Тогда
					
					///// Заполнить РС ВАГОНЫВОТПРАВКЕ. Связать вагоны и рейс ////////
					МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
					МЗ.Вагон = ВыборкаДетальныеЗаписи.НомерВагона;
					МЗ.Отправка = Ответ.Рейс;
					МЗ.Период = ТекущаяДата();
					МЗ.Записать(Истина);
					
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ПолучОб.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураВТаблицуЗначений(СтруктраДляПреобразования,ТЗ_Заявки)
	
	
	//НовСтр = ТЗ_Заявки.Добавить();
	ОписаниеТиповСсылок = Новый ОписаниеТипов(ОбщегоНазначения.ОписаниеТипаВсеСсылки());

	Для Каждого ТекЭлем из СтруктраДляПреобразования Цикл
        
	    МассивТипов = Новый Массив;
	    МассивТипов.Добавить(ТипЗнч(ТекЭлем.Значение));        
	    ТЗ_Заявки.Колонки.Добавить(ТекЭлем.Ключ, Новый ОписаниеТипов(МассивТипов));    
		//НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;

		//ТЗ_Заявки.Колонки.Добавить(ТекЭлем.Ключ, 
		//	?(ОписаниеТиповСсылок.СодержитТип(ТипЗнч(ТекЭлем.Значение)),
		//	Новый ОписаниеТипов(СтрЗаменить(ТекЭлем.Значение.Метаданные().ПолноеИмя(),".","Ссылка.")),
		//	Новый ОписаниеТипов(Строка(ТипЗнч(ТекЭлем.Значение)))));
		//	
		//НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;                          
		
	КонецЦикла;
 	
	Возврат ТЗ_Заявки;
	
КонецФункции

&НаКлиенте
Процедура ВагоныВПовагонкеКлиентСледующегоНазначенияПриИзменении(Элемент)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// очищаем договор и ПСЦ
	ТекД.ДоговорСледующегоНазначения = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	ТекД.ПСЦСледующегоНазначения = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Клиент",ТекД.Клиент);
	СтруктураЗапроса.Вставить("Договор",ТекД.ДоговорСледующегоНазначения);
	СтруктураОтвета = ПолучитьДоговорПСЦ(СтруктураЗапроса);
	ТекД.ДоговорСледующегоНазначения = СтруктураОтвета.Договор;
	ТекД.ПСЦСледующегоНазначения = СтруктураОтвета.ПСЦ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеДоговорКонтрагентаПриИзменении(Элемент)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеДоговора(ТекД);
	АвтоПОдстановкаКалькуляции(ТекД, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДоговора(ТекД)
	
	// очищаем ПСЦ
	ТекД.ПСЦ = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Клиент",ТекД.Клиент);
	СтруктураЗапроса.Вставить("Договор",ТекД.Договор);
	СтруктураОтвета = ПолучитьДоговорПСЦ(СтруктураЗапроса);
	ТекД.ПСЦ = СтруктураОтвета.ПСЦ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеДоговорКонтрагентаСледующегоНазначенияПриИзменении(Элемент)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// очищаем ПСЦ
	ТекД.ПСЦСледующегоНазначения = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Клиент",ТекД.Клиент);
	СтруктураЗапроса.Вставить("Договор",ТекД.ДоговорСледующегоНазначения);
	СтруктураОтвета = ПолучитьДоговорПСЦ(СтруктураЗапроса);
	ТекД.ПСЦСледующегоНазначения = СтруктураОтвета.ПСЦ;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВагоныВПовагонку(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВагоновВПовагонку", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ДобавлениеВагоновВПовагонку", ,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияВагоновВПовагонку(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	МассивЗаявокКЗаписи = Новый Массив;
	ИнформированиеМенеджеровПоПродажам = Новый Массив;
	
	Для каждого Стр из параметр1 Цикл
		
		// записать данные в РС повагонки или запланированных вагонов.
		// подготовка структуры.
		СтруктураДанныхСтроки = Новый Структура;
		
		// для первого добавления данных в регистр
		Если СписокКолонокВагоныВПовагонке.Количество() = 0 Тогда
			СтруктураДанныхСтроки.Вставить("НомерВагона",Стр.НомерВагона);
			СтруктураДанныхСтроки.Вставить("ДатаПередачиВПользование",Стр.ДатаПередачиВПользование);
			СтруктураДанныхСтроки.Вставить("Договор",Стр.Договор);
			СтруктураДанныхСтроки.Вставить("Клиент",Стр.Клиент);
			СтруктураДанныхСтроки.Вставить("РегионВозврата",Стр.РегионВозврата);
			СтруктураДанныхСтроки.Вставить("РегионОтправления",Стр.РегионОтправления);
			СтруктураДанныхСтроки.Вставить("ЦФО",Стр.ЦФО);			
			
		Иначе
			Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
				Попытка
					СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,Стр[ЭлемСп.Значение]);
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ДатаПомещения = ТекущаяДата();
		СпособПомещения = ПредопределенноеЗначение("Перечисление.СобытияПереводаВПовагонку.Вручную");
		СтруктураДанныхСтроки.Вставить("ДатаПомещенияВРежимПовагонки",ДатаПомещения);
		СтруктураДанныхСтроки.Вставить("СобытиеПереводаВПовагонку",СпособПомещения);
		
		ЗаявкаИзменилась = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Стр.ДатаПередачиВПользование) Тогда
			Стр.ДатаПередачиВПользование = ТекущаяДата();
		КонецЕсли;
		
		// если региона отправления нет, то добавляем непосредственно в ВагоныВПовагонке  
		Если Стр.РегионОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка") Тогда
			НовСтр = ВагоныВПовагонке.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			НовСтр.ДатаПомещенияВРежимПовагонки = ДатаПомещения;
			НовСтр.СобытиеПереводаВПовагонку = СпособПомещения;

			СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Ложь,Стр.ВводВРейс);
			
		Иначе
			// в другом случае, добавляем в плановые и ждем достижения ими требуемой станции
			НовСтр = ПодходВагонов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			НовСтр.ДатаПомещенияВРежимПовагонки = ДатаПомещения;
			НовСтр.СобытиеПереводаВПовагонку = СпособПомещения;

			СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Истина,Неопределено);
			
		КонецЕсли;
		
		Если ЗаявкаИзменилась Тогда
			МассивЗаявокКЗаписи.Добавить(СтруктураДанныхСтроки);
		КонецЕсли;
		// менеджеров по продажам информируем в любом случае
		ИнформированиеМенеджеровПоПродажам.Добавить(СтруктураДанныхСтроки);
		
	КонецЦикла;
	
	
	// записать данные в заявку
	Если МассивЗаявокКЗаписи.Количество()>0 Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
			Фактическая = Истина;
		Иначе
			Фактическая = Ложь;
		КонецЕсли;
		ЗаписатьДанныеПоВагонуВЗаявку(МассивЗаявокКЗаписи,Фактическая);
	КонецЕсли;

	// обновляем данные из дислокации
	ОбновитьВагоныВПовагонке();
	ОбновитьВагоныВПодходе();
	//Если ВагоныВПовагонке.Количество() = 0 Тогда
	//	ОбновитьВагоныВПовагонке(1);
	//Иначе
	//	ОбновитьВагоныВПовагонке(0);
	//КонецЕсли;
	//Если ПодходВагонов.Количество() = 0 Тогда
	//	ОбновитьВагоныВПодходе(1);
	//Иначе
	//	ОбновитьВагоныВПодходе(0);
	//КонецЕсли;

	// создать оповещение для менеджеров по продажам
	ОповещениеПользователей(ИнформированиеМенеджеровПоПродажам,"ДобавлениеВагонов");	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОповещениеПользователей(ИнформированиеМенеджеровПоПродажам,ПроисходящееСобытие)
	
	ЗВ = Документы.ЗапланированноеВзаимодействие.СоздатьДокумент();
	ЗВ.Дата = ТекущаяДата();
	ЗВ.Автор = Пользователи.ТекущийПользователь();
	ЗВ.СоздатьПроизводственнуюЗадачу = Истина;
	ЗВ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	ЗВ.ДатаНачала = ТекущаяДата();
	СтрокаСВагонами = "";
	Для Каждого Эл Из ИнформированиеМенеджеровПоПродажам Цикл
		СтрокаСВагонами = СтрокаСВагонами + Эл.НомерВагона + Символы.ПС;
	КонецЦикла;
	
	Если ПроисходящееСобытие = "ДобавлениеВагонов" Тогда
		ЗВ.Тема = "Добавление вагонов в повагонку";
		ТЧ_Участники = ЗВ.Участники;
		Участники = Константы.ГруппаИнформируемыхОВключенииВагонаВПовагонку.Получить();
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			Сообщить("Не заполнена константа <Группа информируемых о включении вагона в повагонку>
			|Оповещение не выполнено! Обратитесь в тех.поддержку!");
			Возврат;
		КонецЕсли; 
		Для каждого Участник Из Участники.Состав Цикл
			НовСтр = ТЧ_Участники.Добавить();
			НовСтр.Контакт = Участник.Пользователь;
		КонецЦикла; 
		ЗаголовокОписания = "В АРМ повагонки были добавлены следующие вагоны:";
	ИначеЕсли ПроисходящееСобытие = "ИсключенииеВагонов" Тогда
		ЗВ.Тема = "Удаление вагонов из повагонки";
		ТЧ_Участники = ЗВ.Участники;
		Участники = Константы.ГруппаИнформируемыхОбИсключенииВагонаИзПовагонки.Получить();
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			Сообщить("Не заполнена константа <Группа информируемых об исключении вагона из повагонки>
			|Оповещение не выполнено! Обратитесь в тех.поддержку!");
			Возврат;
		КонецЕсли; 
		Для каждого Участник Из Участники.Состав Цикл
			НовСтр = ТЧ_Участники.Добавить();
			НовСтр.Контакт = Участник.Пользователь;
		КонецЦикла; 
		ЗаголовокОписания = "Из режима повагонки были исключены следующие вагоны:";
	ИначеЕсли ПроисходящееСобытие = "ВключениеВСделку" Тогда
		ЗВ.Тема = "Включение вагонов в сделку";
		ТЧ_Участники = ЗВ.Участники;
		Участники = Константы.ГруппаИнформируемыхОВключенииВагонаВСделку.Получить();
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			Сообщить("Не заполнена константа <Группа информируемых о включении вагона в сделку>
			|Оповещение не выполнено! Обратитесь в тех.поддержку!");
			Возврат;
		КонецЕсли; 
		Для каждого Участник Из Участники.Состав Цикл
			НовСтр = ТЧ_Участники.Добавить();
			НовСтр.Контакт = Участник.Пользователь;
		КонецЦикла; 
		ЗаголовокОписания = "В сделку были добавлены следующие вагоны:";
	ИначеЕсли ПроисходящееСобытие = "ЗапросВагоновВПовагонку" Тогда 
		ЗВ.Тема = "Запрос вагонов в повагонку";
		ТЧ_Участники = ЗВ.Участники;
		Участники = Константы.ГруппаИнформируемыхОЗапросеПереводаВагонаВПовагонку.Получить();
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			Сообщить("Не заполнена константа <Группа информируемых о запросе перевода вагона в повагонку>
			|Оповещение не выполнено! Обратитесь в тех.поддержку!");
			Возврат;
		КонецЕсли; 
		Для каждого Участник Из Участники.Состав Цикл
			НовСтр = ТЧ_Участники.Добавить();
			НовСтр.Контакт = Участник.Пользователь;
		КонецЦикла; 
		ЗаголовокОписания = "Требуется вывести в повагонку следующие вагоны:";
	ИначеЕсли ПроисходящееСобытие = "НеобходимаПередислокация" Тогда 
		ЗВ.Тема = "Требуется передислокация";
		ТЧ_Участники = ЗВ.Участники;
		Участники = Константы.ГруппаИнформируемыхОНеобходимостиПередислокации.Получить();
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			Сообщить("Не заполнена константа <Группа информируемых о необходимости передислокации>
			|Оповещение не выполнено! Обратитесь в тех.поддержку!");
			Возврат;
		КонецЕсли; 
		Для каждого Участник Из Участники.Состав Цикл
			НовСтр = ТЧ_Участники.Добавить();
			НовСтр.Контакт = Участник.Пользователь;
		КонецЦикла; 
		ЗаголовокОписания = "требуется подсыл следующих вагонов на станцию %1 %2:";
		ЗаголовокОписания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокОписания,
								ИнформированиеМенеджеровПоПродажам[0].СтанцияПодачи,
								ИнформированиеМенеджеровПоПродажам[0].ДатаПлановогоОтправленияСоСтанцииПодачи); 
	КонецЕсли;
	
	ЗВ.Описание = ЗаголовокОписания + Символы.ПС + СтрокаСВагонами;
	ПОпытка
		ЗВ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗВ.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	Сообщить("Оповещение планеров выполнено");
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИзПовагонки(Команда)
	
	// т.к. вагон может быть несколько раз в талбице вагоныв повагонке, то окончание пользования должно проставиться у всех строк
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
	Для Каждого НС ИЗ НайденныеСтроки Цикл
		ПараметрыОтбора2 = Новый Структура;
		ПараметрыОтбора2.Вставить("НомерВагона",НС.НомерВагона);
		НайденныеСтроки2 = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора2);
		Для Каждого НС2 Из НайденныеСтроки2 Цикл
			НС2.Пометка = Истина;
		КонецЦикла;		
	КонецЦикла;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
	
	//ВыдСтроки = Элементы.ВагоныВПовагонке.ВыделенныеСтроки;
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного вагона для вывода из повагонки!");
		Возврат;
	КонецЕсли;
	
	ИнформированиеПланеров = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СтруктураДанныхСтроки = Новый Структура;
		Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
			Попытка
				СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,Стр[ЭлемСп.Значение]);
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Истина,Ложь,Ложь,Неопределено);
		// информируем группу планеров
		ИнформированиеПланеров.Добавить(СтруктураДанныхСтроки);
		
	КонецЦикла;
	
	ОбновитьВагоныВПовагонке();
	ОбновитьВагоныВышедшиеИзПовагонки();
	
	// создать оповещение для планеров
	ОповещениеПользователей(ИнформированиеПланеров,"ИсключенииеВагонов");
	
КонецПроцедуры


&НаКлиенте
Процедура ИсторияПоВагону(Команда)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = ИсторияПоВагонуСервер(ТекД.НомерВагона);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Вариант", СтруктураОтвета.Настройки);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", СтруктураОтвета.КомпоновщикНастроек.ПользовательскиеНастройки);
	ОткрытьФорму("Отчет.ОтчетПоВагонамВПовагонке.Форма", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ИсторияПоВагонуСервер(НомерВагона)
	//тзСотрудники = Сотрудники.Выгрузить();
	//тзСотрудники.Свернуть("Физлицо");
	//СписокСотрудников = Новый СписокЗначений;
	//СписокСотрудников.ЗагрузитьЗначения(тзСотрудники.ВыгрузитьКолонку("Физлицо"));

	СтруктураОтвета = Новый Структура;
	
	КомпоновщикНастроек = Отчеты.ОтчетПоВагонамВПовагонке.Создать().КомпоновщикНастроек;
	Настройки = КомпоновщикНастроек.Настройки;

	//ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	//ЭлементНастройки.Значение = НачалоМесяца(Период);
	//Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
	//    ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	//    Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//        ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
	//    КонецЕсли;
	//КонецЕсли;

	ОтборВагон = Новый ПолеКомпоновкиДанных("Вагон");
	Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
	    Если ЭлементНастройки.ЛевоеЗначение = ОтборВагон Тогда 
	        ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	        ЭлементНастройки.ПравоеЗначение = НомерВагона;
	        ЭлементНастройки.Использование = Истина;
	        Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
	            ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	            Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
	                ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения;
	                ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
	                ПользовательскийПараметр.Использование = ЭлементНастройки.Использование;
	            КонецЕсли;
	        КонецЕсли;
	        Прервать;
	    КонецЕсли;
	КонецЦикла;
	
	СтруктураОтвета.Вставить("КомпоновщикНастроек",КомпоновщикНастроек);
	СтруктураОтвета.Вставить("Настройки",Настройки);
	
	ВОзврат СтруктураОтвета;

КонецФункции

&НаКлиенте
Процедура ПодходВагоновПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущийЭлемент.Имя = "ПодходВагоновОтметка" Тогда
		Возврат;	
	КонецЕсли; 
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаКалькуляцииИЗаявки(ТекД,Ложь);
	
	СтруктураДанныхСтроки = Новый Структура;
	Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
		Попытка
			СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,ТекД[ЭлемСп.Значение]);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЗаявкаИзменилась = Ложь;
	СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Истина,Неопределено);
	
	// записать данные в заявку. перезаписываем только в том случае, если заявка изменилась
	Если ЗначениеЗаполнено(ТекД.Заявка) И ЗаявкаИзменилась Тогда
		МассивЗаявокКЗаписи = Новый Массив;
		МассивЗаявокКЗаписи.Добавить(СтруктураДанныхСтроки);
		Если МассивЗаявокКЗаписи.Количество()>0 Тогда
			Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
				Фактическая = Истина;
			Иначе
				Фактическая = Ложь;
			КонецЕсли;
			ЗаписатьДанныеПоВагонуВЗаявку(МассивЗаявокКЗаписи,Фактическая);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВагоныВПовагонке();
	//ОбновитьВагоныВПодходе();
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВыведеныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодходВагоновКлиентПриИзменении(Элемент)
	
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеКлиента(ТекД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодходВагоновДоговорКонтрагентаПриИзменении(Элемент)
	
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеДоговора(ТекД);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьСделкиНаСервере(МассивСтруктур, Сделка)
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)
	
	Для Каждого СтрокаДляСделки Из МассивСтруктур Цикл
		Контейнер = Неопределено;
		Если ЗначениеЗаполнено(СтрокаДляСделки.НомерКонтейнера) Тогда
			Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(СтрокаДляСделки.НомерКонтейнера, Неопределено);
			
			// Евросиб Фролов (26.10.2021 Ticket№ 41408
			МассивСозданныхКТК.Добавить(Контейнер);
			// Евросиб Фролов)
			
		КонецЕсли;
		СтрокаДляСделки.Вставить("Контейнер", Контейнер);
	КонецЦикла;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, НСтр("ru = 'АРМ ""Управление повагонкой""'"));
	КонецЕсли;	
	// Евросиб Фролов)
	
	МассивСозданныхСделок = РаботаСПовагоннымиОтправками.СозданиеПовагоннойСделки(МассивСтруктур, Сделка);
	
	Если МассивСозданныхСделок.Количество() = 0 Тогда
		Сообщить("Для указанных вагонов сделки не созданы");
	КонецЕсли;
	
	Для Каждого Эл Из МассивСозданныхСделок Цикл
		//ОповещениеПользователей(МассивСозданныхСделок,"ВключениеВСделку");
		Сообщить("Создана " + Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделки(Команда)
	
	СоздатьСделкиПоВагонам();	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделкиБезЖДН(Команда)
	
	СоздатьСделкиПоВагонам(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделкиПоВагонам(ИскатьНакладные = Истина, Сделка = Неопределено)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ТекТаблица = ВагоныВПовагонке;
		ИмяТч = "ВагоныВПовагонке";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ТекТаблица = ВагоныВыведены;
		ИмяТч = "ВагоныВыведены";
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ТекТаблица.НайтиСтроки(ПараметрыОтбора);
	МассивСтруктур = Новый Массив;
	Для Каждого Стр Из НайденныеСтроки Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Клиент) Тогда
			Сообщить("У выбранных вагонов не выбран клиент. Выберите клиента и повторите попытку создания сделки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Договор) Тогда
			Сообщить("У выбранных вагонов не выбран договор. Выберите договор и повторите попытку создания сделки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ПСЦ) Тогда
			Сообщить("У выбранных вагонов не выбран ПСЦ. Выберите ПСЦ и повторите попытку создания сделки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.НДС) Тогда
			Сообщить("У выбранных вагонов не выбран НДС. Выберите НДС и повторите попытку создания сделки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) Тогда
			Сообщить("У выбранных вагонов не выбрана калькуляция. Выберите калькуляцию и повторите попытку создания сделки");
			ВОзврат;
		КонецЕсли;
		//Если Стр.КалькуляцияНеПодходит Тогда
		//	Сообщить("У выбранных вагонов калькуляции не подходят к рейсу. Выберите другие и повторите попытку создания сделки");
		//	ВОзврат;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Стр.Заявка) Тогда
		//	Сообщить("У выбранных вагонов не заполнены заявки. Выберите или создайте заявки и повторите попытку создания сделки");
		//	ВОзврат;
		//КонецЕсли;
		//Если Стр.ЗаявкаНеПодходит Тогда
		//	Сообщить("У выбранных вагонов заявки не подходят для рейса. Выберите другие и повторите попытку создания сделки");
		//	ВОзврат;
		//КонецЕсли;
		
		СтруктураДанныхСтроки = Новый Структура;
		//СтруктураСтроки.Вставить("НомерВагона",Стр.НомерВагона);
		//СтруктураСтроки.Вставить("ДатаОтправления",Стр.ДатаОтправления);
		//СтруктураСтроки.Вставить("Заявка",Стр.Заявка);
		Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
			Попытка
				СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,Стр[ЭлемСп.Значение]);
			Исключение
			КонецПопытки;
		КонецЦикла;

		МассивСтруктур.Добавить(СтруктураДанныхСтроки);
	КонецЦикла;
		
	Если МассивСтруктур.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для создания сделки!");
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ПроверитьВагоныПередСозданиемСделокСервер(МассивСтруктур, Отказ);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сделки не созданы!");
		Возврат;
	КонецЕсли;
	
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
	//МассивНеподходящихВагонов = ПроверкаВозможностиСозданияСделки(МассивСтруктур);
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	
	МассивЗаявок = СоздатьЗаявкуНаСервере(МассивСтруктур,Истина);
	Для Каждого Эл Из МассивЗаявок Цикл
		Сообщить(Строка(Эл.Заявка) + " успешно создана!");
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерВагона",Эл.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаПомещенияВРежимПовагонки",Эл.ДатаПомещенияВРежимПовагонки);
		НайдСтр = ТекТаблица.НайтиСтроки(ПараметрыОтбора);
		Если НайдСтр.Количество()>0 Тогда
			НайдСтр[0].Заявка = Эл.Заявка;
			НайдСтр[0].ЗаявкаНеПодходит = Ложь;
		КонецЕсли;
	КонецЦикла;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("НомерВагона",Стр.НомерВагона);
	СтруктураСтроки.Вставить("ДатаОтправления",Стр.ДатаОтправления);
	СтруктураСтроки.Вставить("Заявка",Стр.Заявка);
	
	МассивЗаявокБезПодразделения = ПроверитьЗаявкиНаЗаполненность(МассивСтруктур);
	СтрокаЗаявок = "";
	Если МассивЗаявокБезПодразделения.Количество()>0 Тогда
		Для Каждого Эл Из МассивЗаявокБезПодразделения Цикл
			СтрокаЗаявок = СтрокаЗаявок + Символы.ПС + Эл;
		КонецЦикла;
		Сообщить("В следующих заявках не указано Подразделение. Укажите Подразделение и повторите попытку создания Сделки! " + СтрокаЗаявок);
		ВОзврат;
	КонецЕсли;
	
	//ВыбранныеСтрокиПовагонки = МассивСтруктур;
	ВсеНакладныеНайдены = Истина;
	ВагоныДляПодбораНакладных = Новый Массив;
	ТриДня = 3 * 24 * 3600;
	ВыбранныеСтрокиПовагонки = Новый Массив;
	Для Каждого ДанныеСтроки Из МассивСтруктур Цикл
		
		ДанныеСтроки.Вставить("ЖДНакладная");
		ДанныеСтроки.Вставить("НомерКонтейнера");
		Если ИскатьНакладные Тогда
			ДанныеНакладных = НайтиНакладные(ДанныеСтроки);
			КоличествоНакладных = ДанныеНакладных.Количество();
			Если КоличествоНакладных = 1 Тогда
				ДанныеСтроки.НомерКонтейнера = ДанныеНакладных[0].НомерКонтейнера;
				ДанныеСтроки.ЖДНакладная = ДанныеНакладных[0].Накладная;
			Иначе
				ПериодОтправленияНачало = НачалоДня(ДанныеСтроки.ДатаОтправления) - ТриДня;
				ПериодОтправленияОкончание = КонецДня(ДанныеСтроки.ДатаОтправления);
				ВагоныДляПодбораНакладных.Добавить(Новый Структура("Вагон, СтанцияОтправления, СтанцияНазначения, ПериодОтправленияНачало, ПериодОтправленияОкончание", ДанныеСтроки.НомерВагона, ДанныеСтроки.СтанцияОтправления, ДанныеСтроки.СтанцияНазначения, ПериодОтправленияНачало, ПериодОтправленияОкончание));			
			КонецЕсли;
		КонецЕсли;
		
		ВыбранныеСтрокиПовагонки.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Если ИскатьНакладные И Не ВсеНакладныеНайдены Тогда
		ТекстПредупреждения = СтрШаблон("Не удалось найти ЖД накладные для всех вагонов. Сделки не созданы.", ДанныеСтроки.НомерВагона);
		ПоказатьПредупреждение(, ТекстПредупреждения);
	ИначеЕсли ИскатьНакладные И ВагоныДляПодбораНакладных.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяТЧ", ИмяТч);
		ДополнительныеПараметры.Вставить("ВыбранныеСтрокиПовагонки", ВыбранныеСтрокиПовагонки);
		ДополнительныеПараметры.Вставить("Сделка", Сделка);
		ОпОп = Новый ОписаниеОповещения("ОбработатьВыборНакладныхПоВагонам", ЭтаФорма, ДополнительныеПараметры);
		ПараметрыОтбора = Новый СТруктура;
		//ПерваяВыбраннаяСтрока = ВыбранныеСтрокиПовагонки[0];
		//ПараметрыОтбора.Вставить("ПериодОтправленияНачало", НачалоДня(ПерваяВыбраннаяСтрока.ДатаОтправления) - ТриДня);
		//ПараметрыОтбора.Вставить("ПериодОтправленияОкончание", КонецДня(ПерваяВыбраннаяСтрока.ДатаОтправления));
		//ПараметрыОтбора.Вставить("СтанцияОтправления", ПерваяВыбраннаяСтрока.СтанцияОтправления);
		//ПараметрыОтбора.Вставить("СтанцияНазначения", ПерваяВыбраннаяСтрока.СтанцияНазначения);
		ПараметрыОтбора.Вставить("ВагоныДляПодбораНакладных", ВагоныДляПодбораНакладных);
		ПараметрыОтбора.Вставить("ПроверятьДействующийСтатусГВЦ", Ложь);
		ПараметрыОтбора.Вставить("ПодборНесколькихЖДННаВагон", Истина);
		ОткрытьФорму("Документ.Сделка.Форма.ФормаПодбораЖДНакладных",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СоздатьСделкиПродолжение(ВыбранныеСтрокиПовагонки, Новый Структура("ИмяТЧ", ИмяТч), Сделка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьВагоныПередСозданиемСделокСервер(МассивСтрок, Отказ = Ложь)
	
	Для Каждого ТекД Из МассивСтрок Цикл
		
		ПараметрыЗапроса = Новый СТруктура;
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
		ПараметрыЗапроса.Вставить("НДС",ТекД.НДС);
		ПараметрыЗапроса.Вставить("Вагон",ТекД.НомерВагона);
		//Евросиб Каблов 07.04.2021 (
		ПараметрыЗапроса.Вставить("ПСЦ", ТекД.ПСЦ);
		//Евросиб Каблов 07.04.2021 )
		
		МассивПодходящихКалькуляций = ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса);
		Если МассивПодходящихКалькуляций.Найти(ТекД.Калькуляция) = Неопределено Тогда
			ТекД.КалькуляцияНеПодходит = Истина;
			ТекстСообщения = СтрШаблон("По вагону %1 выбрана не подходящая калькуляция", ТекД.НомерВагона);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			ТекД.КалькуляцияНеПодходит = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборНакладныхПоВагонам(НакладныеПоВагонам, ДополнительныеПараметры) Экспорт
	
	Если НакладныеПоВагонам = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ВыбранныеСтрокиПовагонки = ДополнительныеПараметры.ВыбранныеСтрокиПовагонки;
	
	СтрокиДляДобавленияВСделку = Новый Массив;
	Для Каждого СтрокаПоВагону Из ВыбранныеСтрокиПовагонки Цикл
		
		//Накладная подобралась автоматически
		Если ЗначениеЗаполнено(СтрокаПоВагону.ЖДНакладная) Тогда
			СтрокаДляСделки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтрокаПоВагону);
			СтрокиДляДобавленияВСделку.Добавить(СтрокаДляСделки);
			Продолжить;
		КонецЕсли;
		
		//Накладные подобрались пользователем
		ДобавленаЖДНакладная = Ложь;
		Для Каждого НакладнаяПоВагону Из НакладныеПоВагонам Цикл
			Если СтрокаПоВагону.НомерВагона = НакладнаяПоВагону.Вагон Тогда
				СтрокаПоВагону.ЖДНакладная = НакладнаяПоВагону.ТранспортныйДокумент;
				НомераКонтейнеров = СтрРазделить(НакладнаяПоВагону.НомераКонтейнеров, ";");
				Если НомераКонтейнеров.Количество() > 0 Тогда
					Для Каждого НомерКонтейнера Из НомераКонтейнеров Цикл
						СтрокаДляСделки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтрокаПоВагону);
						СтрокаДляСделки.Вставить("ЖДНакладная", НакладнаяПоВагону.ТранспортныйДокумент);
						СтрокаДляСделки.Вставить("НомерКонтейнера", НомерКонтейнера);
						СтрокиДляДобавленияВСделку.Добавить(СтрокаДляСделки);
						ДобавленаЖДНакладная = Истина;
					КонецЦикла;
				Иначе
					СтрокаДляСделки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтрокаПоВагону);
					СтрокаДляСделки.Вставить("ЖДНакладная", НакладнаяПоВагону.ТранспортныйДокумент);
					СтрокаДляСделки.Вставить("НомерКонтейнера", "");
					СтрокиДляДобавленияВСделку.Добавить(СтрокаДляСделки);
					ДобавленаЖДНакладная = Истина;
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
		Если Не ДобавленаЖДНакладная Тогда
			ТекстСообщения = СтрШаблон("Не выбрана ЖД накладная по вагону %1", СтрокаПоВагону.НомерВагона);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
		
	СоздатьСделкиПродолжение(СтрокиДляДобавленияВСделку, Новый Структура("ИмяТЧ", ДополнительныеПараметры.ИмяТЧ), ДополнительныеПараметры.Сделка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделкиПродолжение(ВыбранныеСтрокиПовагонки, ДополнительныеПараметры, Сделка) Экспорт
	
	СоздатьСделкиНаСервере(ВыбранныеСтрокиПовагонки, Сделка);
	
	Если ДополнительныеПараметры.ИмяТЧ = "ВагоныВПовагонке" Тогда
		текСтрока = Элементы.ВагоныВПовагонке.ТекущаяСтрока;
		ОбновитьВагоныВПовагонке();
		Элементы.ВагоныВПовагонке.ТекущаяСтрока = текСтрока;
	ИначеЕсли ДополнительныеПараметры.ИмяТЧ = "ВагоныВыведены" Тогда
		текСтрока = Элементы.ВагоныВыведены.ТекущаяСтрока;
		ОбновитьВагоныВышедшиеИзПовагонки();
		Элементы.ВагоныВыведены.ТекущаяСтрока = текСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьНайтиНакладные(ДанныеСтроки)
	
	ДанныеНакладных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК Накладная,
	|	ТранспортныйДокумент.ДатаОтправления
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО э_НакладнаяВагоны.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	|ГДЕ
	|	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	|	И ТранспортныйДокумент.Ссылка.СтанцияНазначения = &СтанцияНазначения
	|	И ТранспортныйДокумент.Ссылка.СтанцияОтправления = &СтанцияОтправления
	|	И НАЧАЛОПЕРИОДА(ТранспортныйДокумент.ДатаОтправления, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаОтправления, ДЕНЬ, -3) И &ДатаОтправления";
	Запрос.УстановитьПараметр("НомерВагона", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.НомерВагона, "Наименование"));
	//Запрос.УстановитьПараметр("СтанцияНазначения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияНазначения, "КодЖДСтанции"));
	//Запрос.УстановитьПараметр("СтанцияОтправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияОтправления, "КодЖДСтанции"));
	Запрос.УстановитьПараметр("СтанцияНазначения", ДанныеСтроки.СтанцияНазначения);
	Запрос.УстановитьПараметр("СтанцияОтправления", ДанныеСтроки.СтанцияОтправления);
	Запрос.УстановитьПараметр("ДатаОтправления", ДанныеСтроки.ДатаОтправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Поля = "НомерВагона, ДатаОтправления, Накладная";
	Пока Выборка.Следующий() Цикл
		ДанныеНакладной = Новый Структура(Поля);
		ЗаполнитьЗначенияСвойств(ДанныеНакладной, Выборка);
		ДанныеНакладной.НомерВагона = ДанныеСтроки.НомерВагона;
		ДанныеНакладных.Добавить(ДанныеНакладной);
	КонецЦикла;
	
	Возврат ДанныеНакладных;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНакладные(ДанныеСтроки)
	
	ДанныеНакладных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК Накладная,
	|	ТранспортныйДокумент.ДатаОтправления КАК ДатаОтправления,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	ТЕ.Ссылка КАК Контейнер
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО э_НакладнаяВагоны.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяКонтейнеры.Ссылка
	|			И (ВЫБОР
	|				КОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда <> 0
	|					ТОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.НомерСтроки
	|				ИНАЧЕ э_НакладнаяВагоны.НомерСтроки = 1
	|			КОНЕЦ)
	|ГДЕ
	|	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	|	И НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	//Евросиб Каблов 14.04.2021 ( Ticket#0224665	
	//|	И ТранспортныйДокумент.Ссылка.СтанцияНазначения = &СтанцияНазначения
	//|	И ТранспортныйДокумент.Ссылка.СтанцияОтправления = &СтанцияОтправления 
	|	И (ТранспортныйДокумент.Ссылка.СтанцияНазначения = &СтанцияНазначения
	|				ИЛИ ТранспортныйДокумент.Ссылка.СтанцияНазначения В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = &СтанцияНазначения
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = &СтанцияНазначения))
	|	И (ТранспортныйДокумент.Ссылка.СтанцияОтправления = &СтанцияОтправления
	|				ИЛИ ТранспортныйДокумент.Ссылка.СтанцияОтправления В
	|					(ВЫБРАТЬ
	|						АналогиЛокаций.Локация
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Аналог = &СтанцияОтправления
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						АналогиЛокаций.Аналог
	|					ИЗ
	|						регистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|					ГДЕ
	|						АналогиЛокаций.Локация = &СтанцияОтправления))
	//Евросиб Каблов 14.04.2021 )
	|	И (э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	|			ИЛИ э_НакладнаяВагоны.Ссылка.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ))
	|	И ТранспортныйДокумент.ДатаОтправления МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("НомерВагона", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.НомерВагона, "Наименование"));
	//Запрос.УстановитьПараметр("СтанцияНазначения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияНазначения, "КодЖДСтанции"));
	//Запрос.УстановитьПараметр("СтанцияОтправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияОтправления, "КодЖДСтанции"));
	Запрос.УстановитьПараметр("СтанцияНазначения", ДанныеСтроки.СтанцияНазначения);
	Запрос.УстановитьПараметр("СтанцияОтправления", ДанныеСтроки.СтанцияОтправления);
	//Запрос.УстановитьПараметр("ДатаОтправления", ДанныеСтроки.ДатаОтправления);
	ТриДня = 3 * 24 * 3600;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДанныеСтроки.ДатаОтправления) - ТриДня);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДанныеСтроки.ДатаОтправления));
	Выборка = Запрос.Выполнить().Выбрать();
	Поля = "НомерВагона, ДатаОтправления, Накладная, НомерКонтейнера, Контейнер";
	Пока Выборка.Следующий() Цикл
		ДанныеНакладной = Новый Структура(Поля);
		ЗаполнитьЗначенияСвойств(ДанныеНакладной, Выборка);
		ДанныеНакладной.НомерВагона = ДанныеСтроки.НомерВагона;
		ДанныеНакладных.Добавить(ДанныеНакладной);
	КонецЦикла;
	
	Возврат ДанныеНакладных;
	
КонецФункции

//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>) 
//ДИТ											По факту функция всегда возвращала пустой массив
//&НаСервереБезКонтекста
//Функция ПроверкаВозможностиСозданияСделки(МассивСтруктур)
//	
//	МассивНеподходящихВагонов = Новый Массив;
//	
//	ТблВагонов = Новый ТаблицаЗначений;
//	ТблВагонов.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
//	ТблВагонов.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
//	ТблВагонов.Колонки.Добавить("ПСЦ",Новый ОписаниеТипов("ДокументССылка.ПСЦ"));
//	
//	Для Каждого Эл Из МассивСтруктур Цикл
//		НовСтр = ТблВагонов.Добавить();
//		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
//	КонецЦикла;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ВремТЧ.НомерВагона КАК НомерВагона,
//	               |	ВремТЧ.ДатаОтправления КАК ДатаОтправления,
//	               |	ВремТЧ.ПСЦ КАК ПСЦ
//	               |ПОМЕСТИТЬ ВТ
//	               |ИЗ
//	               |	&ВремТЧ КАК ВремТЧ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	СУММА(ЕСТЬNULL(ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот, 0)) КАК КоличествоДнейОборот,
//	               |	ВТ.НомерВагона КАК НомерВагона,
//	               |	ВТ.ДатаОтправления КАК ДатаОтправки,
//	               |	ВТ.ПСЦ КАК ПСЦ
//	               |ИЗ
//	               |	ВТ КАК ВТ
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
//	               |		ПО ВТ.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
//	               |			И ВТ.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
//	               |			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ.НомерВагона,
//	               |	ВТ.ДатаОтправления,
//	               |	ВТ.ПСЦ";
//	
//	Запрос.УстановитьПараметр("ВремТЧ",ТблВагонов);
//	ТЗ_СозданныхСделок = Запрос.Выполнить().Выгрузить();
//	// если у вагона создана сделка, то нужно проверить условия оплаты вагона 
//	Для Каждого Стр Из ТЗ_СозданныхСделок Цикл
//		Если ЗначениеЗаполнено(Стр.КоличествоДнейОборот) Тогда
//			
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат МассивНеподходящихВагонов;

//КонецФункции
//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --

&НаКлиенте
Процедура ВагоныВПовагонкеЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборЗаявки(ТекД,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗаявки(ТекД,Фактическая)

	ПараметрыЗапроса = Новый СТруктура;
	Если Фактическая Тогда
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
		ПараметрыЗапроса.Вставить("ДатаОтправления",?(ЗначениеЗаполнено(ТекД.ДатаОтправления),ТекД.ДатаОтправления,ТекД.ДатаПередачиВПользование));
		// получаем дату прибытия по табельному расписанию
		ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ТекД.СтанцияОтправления, ТекД.СтанцияНазначения);
		КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
		Если ЗначениеЗаполнено(КолвоДн) Тогда
			ДатаПриб = ТекД.ДатаОтправления + КолвоДн*24;
		КонецЕсли;
		Если ЗначениеЗаполнено(КолвоДн) Тогда
			ПараметрыЗапроса.Вставить("ДатаПрибытия",?(ЗначениеЗаполнено(ТекД.ДатаОтправления),ТекД.ДатаОтправления,ТекД.ДатаПередачиВПользование) + КолвоДн);
		КонецЕсли;
	Иначе
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.РегионОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.РегионВозврата);
		ПараметрыЗапроса.Вставить("ДатаОтправления",ТекД.ДатаПередачиВПользование);
		// получаем дату прибытия по табельному расписанию
		ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ТекД.РегионОтправления, ТекД.РегионВозврата);
		КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
		Если ЗначениеЗаполнено(КолвоДн) Тогда
			ДатаПриб = ТекД.ДатаПередачиВПользование + КолвоДн*24;
		КонецЕсли;
		Если ЗначениеЗаполнено(КолвоДн) Тогда
			ПараметрыЗапроса.Вставить("ДатаПрибытия",ТекД.ДатаПередачиВПользование + КолвоДн);
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗапроса.Вставить("ПСЦ",ТекД.ПСЦ);
	
	СписокЗаявок = Новый СписокЗначений;
	СписокЗаявок.ЗагрузитьЗначения(ПолучитьСписокПодходящихЗаявок(ПараметрыЗапроса));
	
	ПараметрыОтбора = Новый СТруктура;
	ПараметрыОтбора.Вставить("ПодходящиеРейсы",СписокЗаявок);
	
	ДопПараметры = Новый СТруктура;
	ДопПараметры.Вставить("СписокЗаявок",СписокЗаявок);
	ДопПараметры.Вставить("ТекД",ТекД);
	
	ОпОп = новый ОписаниеОповещения("ОбработкаВыбораЗаявки", ЭтаФорма, ДопПараметры);
	ОткрытьФорму("Документ.Заявка.ФормаВыбора",ПараметрыОтбора ,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗаявки(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	Параметр2.ТекД.Заявка = Параметр1;
	// если в массиве подходящих заявок нет выбранной, то значит, выбрали из общего списка; отметить как неподходящую
	Если Параметр2.СписокЗаявок.НайтиПоЗначению(Параметр1) = Неопределено Тогда
		Параметр2.ТекД.ЗаявкаНеПодходит = Истина;
	Иначе
		Параметр2.ТекД.ЗаявкаНеПодходит = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаявкиНаЗаполненность(СтруктураСтроки)
	
	МассивЗаявок = Новый Массив;
	
	Для Каждого Эл Из СтруктураСтроки Цикл
		Если Не ЗначениеЗаполнено(Эл.Заявка.Подразделение) Тогда
			МассивЗаявок.Добавить(Эл.Заявка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗаявок;
	
КонецФункции	
	
&НаСервереБезКонтекста
Функция ПолучитьСписокПодходящихЗаявок(ПараметрыЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |ГДЕ
	               |	ЗаявкаПереченьРейсов.Рейс.ПунктОтправления В ИЕРАРХИИ(&ПунктОтправления)
	               //|	И ЗаявкаПереченьРейсов.Рейс.ПунктНазначения В ИЕРАРХИИ(&ПунктНазначения)
	               |	И ВЫБОР
	               |			КОГДА &ДатаЕсть = ИСТИНА
	               |				ТОГДА ЗаявкаПереченьРейсов.Рейс.ДатаПрибытия = &ДатаПрибытия
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ЗаявкаПереченьРейсов.Рейс.ДатаОтправления = &ДатаОтправления
	               |	И ЗаявкаПереченьРейсов.Ссылка.ПСЦ = &ПСЦ";
	Запрос.УстановитьПараметр("ПунктОтправления",ПараметрыЗапроса.ПунктОтправления);
	Запрос.УстановитьПараметр("ПунктНазначения",ПараметрыЗапроса.ПунктНазначения);
	Запрос.УстановитьПараметр("ДатаОтправления",ПараметрыЗапроса.ДатаОтправления);
	Запрос.УстановитьПараметр("ПСЦ",ПараметрыЗапроса.ПСЦ);
	Если ПараметрыЗапроса.Свойство("ДатаПрибытия") И ЗначениеЗаполнено(ПараметрыЗапроса.ДатаПрибытия) ТОгда
		Запрос.УстановитьПараметр("ДатаЕсть",Истина);
		Запрос.УстановитьПараметр("ДатаПрибытия",ПараметрыЗапроса.ДатаПрибытия);
	Иначе
		Запрос.УстановитьПараметр("ДатаЕсть",Ложь);
		Запрос.УстановитьПараметр("ДатаПрибытия",1);
	КонецЕсли;

	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивЗаявок = ТЗ.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивЗаявок;
	
КонецФункции

&НаКлиенте
Процедура ПодходВагоновЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборЗаявки(ТекД,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТч = "ВагоныВПовагонке";
		Фактическая = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ИмяТЧ = "ВагоныВыведены";
		Фактическая = Истина;
	Иначе
		ИмяТч = "ПодходВагонов";
		Фактическая = Ложь;
	КонецЕсли;
	
	ТекД = Элементы[ИмяТч].ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	мСписокВагонов = Новый Массив;
	Для Каждого Стр Из ЭтаФорма[ИмяТч] Цикл
		СтруктураДанныхСтроки = Новый Структура;
		Если НЕ Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.Клиент) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран клиент. Выберите клиента и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Договор) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран договор. Выберите договор и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ПСЦ) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран ПСЦ. Выберите ПСЦ и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.НДС) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран НДС. Выберите НДС и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбрана калькуляция. Выберите калькуляцию и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Стр.СтанцияПодачи) Тогда
		Если НЕ ЗначениеЗаполнено(Стр.СтанцияОтправления) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбрана станция подачи. Выберите станцию подачи и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ДатаОтправления) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не заполнена дата отправления. Создание заявки отменено");
			ВОзврат;
		КонецЕсли;
		//Если Стр.КалькуляцияНеПодходит Тогда
		//	Сообщить("У выбранных вагонов калькуляции не подходят к рейсу. Выберите другие и повторите попытку создания заявки");
		//	ВОзврат;
		//КонецЕсли;
		
		Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
			Попытка
				СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,Стр[ЭлемСп.Значение]);
			Исключение
			КонецПопытки;
		КонецЦикла;
		МассивСтруктур.Добавить(СтруктураДанныхСтроки);
		
	КонецЦикла;
	
	Если МассивСтруктур.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для создания заявки");
		Возврат;
	КонецЕсли;
	
	МассивЗаявок = СоздатьЗаявкуНаСервере(МассивСтруктур,Истина);
	
	//МассивЗаявокКЗаписи = Новый Массив;
	Для Каждого Эл Из МассивЗаявок Цикл
		Сообщить(Строка(Эл.Заявка) + " успешно создана!");
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерВагона",Эл.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаПомещенияВРежимПовагонки",Эл.ДатаПомещенияВРежимПовагонки);
		НайдСтр = ЭтаФорма[ИмяТч].НайтиСтроки(ПараметрыОтбора);
		Если НайдСтр.Количество()>0 Тогда
			НайдСтр[0].Заявка = Эл.Заявка;
			НайдСтр[0].ЗаявкаНеПодходит = Ложь;
			//МассивЗаявокКЗаписи.Добавить(Эл.Заявка);
//			СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Ложь);
		КонецЕсли;
	КонецЦикла;
	
	//Если МассивЗаявокКЗаписи.Количество()>0 Тогда
	//	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
	//		Фактическая = Истина;
	//	Иначе
	//		Фактическая = Ложь;
	//	КонецЕсли;
	//	ЗаписатьДанныеПоВагонуВЗаявку(МассивЗаявокКЗаписи,Фактическая);
	//КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЗаявкуНаСервере(СтруктураДанныхСтроки,Фактическая)
	
	// сгруппируем данные для записи в заявки
	ТЗ_Заявок = Новый ТаблицаЗначений;
	ТЗ_Заявок.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ_Заявок.Колонки.Добавить("ДатаПрибытия",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ_Заявок.Колонки.Добавить("ДатаПомещенияВРежимПовагонки",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ_Заявок.Колонки.Добавить("СтанцияОтправления",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявок.Колонки.Добавить("СтанцияНазначения",Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТЗ_Заявок.Колонки.Добавить("Клиент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ_Заявок.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТЗ_Заявок.Колонки.Добавить("ПСЦ",Новый ОписаниеТипов("ДокументСсылка.ПСЦ"));
	ТЗ_Заявок.Колонки.Добавить("Груженый",Новый ОписаниеТипов("Булево"));
	ТЗ_Заявок.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТЗ_Заявок.Колонки.Добавить("Заявка",Новый ОписаниеТипов("ДокументСсылка.Заявка"));
	ТЗ_Заявок.Колонки.Добавить("ГУИДЗаявки",Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	ТЗ_Заявок.Колонки.Добавить("Груз",Новый ОписаниеТипов("СправочникСсылка.Грузы"));
	ТЗ_Заявок.Колонки.Добавить("МодельВагона",Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС"));
	ТЗ_Заявок.Колонки.Добавить("Калькуляция",Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));

	Для Каждого Эл Из СтруктураДанныхСтроки Цикл
		
		//Если ЗначениеЗаполнено(Эл.Заявка) Тогда
		//	Продолжить;
		//КонецЕсли; 
		НовСтр = ТЗ_Заявок.Добавить();
		Если Фактическая Тогда
			
			//СтнОтпр = Эл.СтанцияПодачи;
			СтнОтпр = Эл.СтанцияОтправления;
			//СтнПриб = Эл.СтанцияНазначения;
			Если Эл.Свойство("ДатаНакладной") И ЗначениеЗаполнено(Эл.ДатаНакладной) Тогда
				ДтОтпр = Эл.ДатаНакладной;
			Иначе
				ДтОтпр = Эл.ДатаОтправления;
			КонецЕсли; 
		Иначе
			//СтнОтпр = Эл.РегионОтправления;
			//СтнОтпр = Эл.СтанцияПодачи;
			СтнОтпр = Эл.СтанцияОтправления;
			//СтнПриб = Эл.РегионВозврата;
			ДтОтпр = Эл.ДатаПередачиВПользование;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовСТр,Эл);
		
		НовСТр.ДатаОтправления = ДтОтпр;
		НовСТр.СтанцияОтправления = СтнОтпр;
		НовСТр.СтанцияНазначения = Эл.СтанцияНазначения;
		//НовСТр.СтанцияНазначения = Эл.Калькуляция.Суша_ПунктНазначения;
		//НовСтр.СтанцияНазначения = Неопределено;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТЧ.ДатаОтправления КАК ДатаОтправления,
		|	ВремТЧ.ДатаПрибытия КАК ДатаПрибытия,
		|	ВремТЧ.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
		|	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
		|	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения,
		|	ВремТЧ.Клиент КАК Клиент,
		|	ВремТЧ.Договор КАК Договор,
		|	ВремТЧ.НомерВагона КАК НомерВагона,
		|	ВремТЧ.Груженый КАК Груженый,
		|	ВремТЧ.ПСЦ КАК ПСЦ,
		|	ВремТЧ.Груз КАК Груз,
		|	ВремТЧ.МодельВагона КАК ТипВагона,
		|	ВремТЧ.Калькуляция КАК Калькуляция,
		|	ВремТЧ.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТЧ КАК ВремТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ДатаОтправления КАК ДатаОтправления,
		|	ВТ.ДатаПрибытия КАК ДатаПрибытия,
		|	ВТ.ДатаПомещенияВРежимПовагонки КАК ДатаПомещенияВРежимПовагонки,
		|	ВТ.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ.Клиент КАК Клиент,
		|	ВТ.Договор КАК Договор,
		|	ВТ.НомерВагона КАК НомерВагона,
		|	ВТ.ПСЦ КАК ПСЦ,
		|	ВТ.Груженый КАК Груженый,
		|	ВТ.Груз КАК Груз,
		|	ВТ.ТипВагона КАК ТипВагона,
		|	ВТ.Калькуляция КАК Калькуляция,
		|	ВТ.Заявка КАК Заявка,
		|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
		|			И ВТ.НомерВагона = ЗаявкаСоставУслуги.Вагон
		|ИТОГИ ПО
		|	ДатаОтправления,
		|	СтанцияОтправления,
		|	СтанцияНазначения,
		|	Клиент,
		|	Договор";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТЗ_Заявок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДатаОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивЗаявок = Новый Массив;
	
	Пока ВыборкаДатаОтправления.Следующий() Цикл
		ВыборкаСтанцияОтправления = ВыборкаДатаОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтанцияОтправления.Следующий() Цикл
			ВыборкаСтанцияНазначения = ВыборкаСтанцияОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСтанцияНазначения.Следующий() Цикл
				ВыборкаКлиент = ВыборкаСтанцияНазначения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКлиент.Следующий() Цикл
					ВыборкаДоговор = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговор.Следующий() Цикл
						
						// заявку создаем учитывая все группировки
						Если Фактическая 
							И ЗначениеЗаполнено(ВыборкаДоговор.СтанцияНазначения) Тогда
						
							//////// создать ПРОДУКТ, проверив перед этим, возможно, он уже создан//////////
							//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
							//ТекПродукт = Справочники.Продукты.ПустаяСсылка();
							ТекПродукт = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
							//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
							ЗапросП = Новый Запрос;
							ЗапросП.Текст = "ВЫБРАТЬ 
							                |	Продукты.Ссылка КАК Ссылка
							                |ИЗ
											//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
											//|	Справочник.Продукты КАК Продукты
											|	Справочник.СервисыУчетноеНаправление КАК Продукты
											//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
							                |ГДЕ
							                |	НЕ Продукты.ПометкаУдаления
							                |	И Продукты.НачалоМаршрута = &НачалоМаршрута
							                |	И Продукты.ОкончаниеМаршрута = &ОкончаниеМаршрута";
							ЗапросП.УстановитьПараметр("НачалоМаршрута",ВыборкаДоговор.СтанцияОтправления);
							ЗапросП.УстановитьПараметр("ОкончаниеМаршрута",ВыборкаДоговор.СтанцияНазначения);
							РезультатЗапросаП = ЗапросП.Выполнить();
							Если РезультатЗапросаП.Пустой() Тогда
								// создать продукт
								УстановитьПривилегированныйРежим(Истина);
								//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
								//ТекПродукт = Справочники.Продукты.СоздатьЭлемент();
								ТекПродукт = Справочники.СервисыУчетноеНаправление.СоздатьЭлемент();
								//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
								ТекПродукт.Наименование = Строка(ВыборкаДоговор.СтанцияОтправления) + " - " + Строка(ВыборкаДоговор.СтанцияНазначения);
								ТекПродукт.ВключаетРасходыПоПодсылуВагонов = Истина;
								ТекПродукт.НачалоМаршрута = ВыборкаДоговор.СтанцияОтправления;
								ТекПродукт.ОкончаниеМаршрута = ВыборкаДоговор.СтанцияНазначения;
								Если СтнОтпр.Страна = Справочники.СтраныМира.Россия И ВыборкаДоговор.СтанцияНазначения.Страна = Справочники.СтраныМира.Россия Тогда 
									//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
									//ТекПродукт.Родитель = Справочники.Продукты.НайтиПоНаименованию("РФ - РФ");
									ТекПродукт.Родитель = Справочники.СервисыУчетноеНаправление.НайтиПоНаименованию("РФ - РФ");
									//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
								Иначе
									//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
									//ТекПродукт.Родитель = Справочники.Продукты.НайтиПоНаименованию("Продукты");
									ТекПродукт.Родитель = Справочники.СервисыУчетноеНаправление.НайтиПоНаименованию("Продукты");
									//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
								КонецЕсли;
								ТекПродукт.Записать();
								УстановитьПривилегированныйРежим(Ложь);
							Иначе
								ТекПродукт = РезультатЗапросаП.Выгрузить().ВыгрузитьКолонку("Ссылка")[0];
							КонецЕсли;
						КонецЕсли;
						
						Заявка = Неопределено;
						ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заявка) Тогда
								Заявка = ВыборкаДетальныеЗаписи.Заявка;
							КонецЕсли;
						КонецЦикла;
						
						// создаем заявку
						Если ЗначениеЗаполнено(Заявка) Тогда
							НоваяЗаявка = Заявка.ПолучитьОбъект();
						Иначе
							НоваяЗаявка = Документы.Заявка.СоздатьДокумент();
							НоваяЗаявка.Заполнить(Неопределено);
							НоваяЗаявка.Дата = ТекущаяДата();
							НоваяЗаявка.Автор = Пользователи.ТекущийПользователь();
							НоваяЗаявка.Контрагент = ВыборкаДоговор.Клиент;
							НоваяЗаявка.Договор = ВыборкаДоговор.Договор;
							НоваяЗаявка.ЦФО = НоваяЗаявка.Автор.ЦФО;
							НоваяЗаявка.Создано = ТекущаяДата();
							НоваяЗаявка.Организация = Константы.ОсновнаяОрганизация.Получить();
							НоваяЗаявка.Маршрутизировать = Константы.МаршрутизироватьЗаявку.Получить();
							НоваяЗаявка.Отправка = ВыборкаДоговор.ДатаОтправления;							
							НоваяЗаявка.ИсточникЗаявки = Перечисления.ИсточникЗаявок.Повагонка; 
						КонецЕсли;
						

						ГУИДЗаявки = Строка(Новый УникальныйИдентификатор);
						
						ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();
						ЗаявкаИзменена = Ложь;
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГУИДСтроки) Тогда
								Продолжить;
							КонецЕсли;
							
							ЗаявкаИзменена = Истина;
							НоваяЗаявка.ПСЦ = ВыборкаДетальныеЗаписи.ПСЦ;
							
							ТЧ_Услуги = НоваяЗаявка.СоставУслуги;
							НовСтр = ТЧ_Услуги.Добавить();
							НовСтр.Услуга = Константы.УслугаДляПовагоннойЗаявки.Получить();
							НовСтр.СтанцияОтправления = ВыборкаДетальныеЗаписи.СтанцияОтправления;
							НовСтр.СтанцияНазначения = ВыборкаДетальныеЗаписи.СтанцияНазначения;
							НовСтр.ПунктОтправления = ВыборкаДетальныеЗаписи.СтанцияОтправления;
							НовСтр.ПунктНазначения = ВыборкаДетальныеЗаписи.СтанцияНазначения;
							НовСтр.Вагон = ВыборкаДетальныеЗаписи.НомерВагона;
							НовСтр.ПСЦ = ВыборкаДетальныеЗаписи.ПСЦ;
							НовСтр.ТипВагона = ВыборкаДетальныеЗаписи.НомерВагона.ТипТС;
							НовСтр.ГУИДСтроки = Новый УникальныйИдентификатор();
							
							// вносим в ТЗ данные по ГУИДу заявки
							ПарамОтб = Новый Структура;
							ПарамОтб.Вставить("НомерВагона",ВыборкаДетальныеЗаписи.НомерВагона);
							ПарамОтб.Вставить("ДатаПомещенияВРежимПовагонки",ВыборкаДетальныеЗаписи.ДатаПомещенияВРежимПовагонки);
							НайдСтр = ТЗ_Заявок.НайтиСтроки(ПарамОтб);
							Если НайдСтр.Количество()>0 Тогда
								НайдСтр[0].ГУИДЗаявки = ГУИДЗаявки;
							КонецЕсли;
							
							// рейс и признак груженого заполняем только для фактической
							Если Фактическая 
								И ЗначениеЗаполнено(ВыборкаДоговор.СтанцияНазначения) Тогда
								// рейс ищем или создаем здесь, т.к. нужно получить признак груженого или порожнего
								// проверка, есть ли уже такой рейс. 
								ТекРейс = Справочники.РейсыЖД.ПустаяСсылка();
								ЗапросР = Новый Запрос;
								ЗапросР.Текст = "ВЫБРАТЬ
								                |	РейсыЖД.Ссылка КАК Ссылка
								                |ИЗ
								                |	Справочник.РейсыЖД КАК РейсыЖД
								                |ГДЕ
								                |	НЕ РейсыЖД.КП
								                |	И НЕ РейсыЖД.ПометкаУдаления
								                |	И РейсыЖД.ПовагоннаяОтправка
								                |	И РейсыЖД.ПунктОтправления = &ПунктОтправления
								                |	И РейсыЖД.ПунктНазначения = &ПунктНазначения
								                |	И ВЫБОР
								                |			КОГДА &ДатаЕсть = ИСТИНА
								                |				ТОГДА НАЧАЛОПЕРИОДА(РейсыЖД.ДатаПрибытия, ДЕНЬ) = &ДатаПрибытия
								                |			ИНАЧЕ ИСТИНА
								                |		КОНЕЦ
								                |	И НАЧАЛОПЕРИОДА(РейсыЖД.ДатаОтправления, ДЕНЬ) = &ДатаОтправления";
								ЗапросР.УстановитьПараметр("ПунктОтправления",ВыборкаДоговор.СтанцияОтправления);
								ЗапросР.УстановитьПараметр("ПунктНазначения",ВыборкаДоговор.СтанцияНазначения);
								ЗапросР.УстановитьПараметр("ДатаОтправления",НачалоДня(ВыборкаДоговор.ДатаОтправления));
								// получаем дату прибытия по табельному расписанию
								ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(ВыборкаДоговор.СтанцияОтправления, ВыборкаДоговор.СтанцияНазначения);
								// ДобавитьКОкончанию - часы
								КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
								Если ЗначениеЗаполнено(КолвоДн) Тогда
									ДатаПриб = ВыборкаДоговор.ДатаОтправления + КолвоДн*24;
								КонецЕсли;
								// если по табельному расписанию не получили ничего, то запрос к рейл тарифу
								Если Не ЗначениеЗаполнено(ДатаПриб) Тогда
									//КолвоДн = ПолучитьДанныеРейлТариф(ВыборкаДоговор.СтанцияОтправления,ВыборкаДоговор.СтанцияНазначения,ВыборкаДетальныеЗаписи.Груженый,ВыборкаДетальныеЗаписи.Груз,ВыборкаДетальныеЗаписи.НомерВагона.ТипТС,Перечисления.ПринадлежностьПС.Собственный);
									КолвоДн = ПолучитьДанныеРейлТариф(ВыборкаДоговор.СтанцияОтправления,ВыборкаДоговор.СтанцияНазначения,Ложь,Неопределено,ВыборкаДетальныеЗаписи.НомерВагона.ТипТС,Перечисления.ПринадлежностьПС.Собственный);
									ДатаПриб = ВыборкаДоговор.ДатаОтправления + КолвоДн*3600*24;
								КонецЕсли;
								Если ЗначениеЗаполнено(ДатаПриб) Тогда
									ЗапросР.УстановитьПараметр("ДатаЕсть",Истина);
									ЗапросР.УстановитьПараметр("ДатаПрибытия",НачалоДня(ДатаПриб));
								Иначе
									ЗапросР.УстановитьПараметр("ДатаЕсть",Ложь);
									ЗапросР.УстановитьПараметр("ДатаПрибытия",1);
								КонецЕсли;
								
								РезультатЗапросаР = ЗапросР.Выполнить();
								Если РезультатЗапросаР.Пустой() Тогда
									//////////////// создать РЕЙС ////////////////////////////
									ТекРейс = Справочники.РейсыЖД.СоздатьЭлемент();
									ТекРейс.Наименование = Строка(ВыборкаДоговор.СтанцияОтправления) + " - " + Строка(ВыборкаДоговор.СтанцияНазначения);
									ТекРейс.ПунктОтправления = ВыборкаДоговор.СтанцияОтправления;
									ТекРейс.ПунктНазначения = ВыборкаДоговор.СтанцияНазначения;
									ТекРейс.ДатаОтправления = ВыборкаДоговор.ДатаОтправления;
									ТекРейс.ДатаПрибытия = ДатаПриб;
									ТекРейс.Продукт = ТекПродукт.Ссылка;
									ТекРейс.Сервис = ТекПродукт.Ссылка;
									ТекРейс.ПовагоннаяОтправка = Истина;
									ТекРейс.ТехРейс = Истина;
									ТекРейс.Записать();
									//////////////////////////////////////////////////////////
								Иначе
									ТекРейс = РезультатЗапросаР.Выгрузить().ВыгрузитьКолонку("Ссылка")[0];
								КонецЕсли;
								
								НайденнаяСтрокаСРейсом = НоваяЗаявка.ПереченьРейсов.Найти(ТекРейс.Ссылка);
								Если НайденнаяСтрокаСРейсом = Неопределено Тогда
									НовСтр_Рейсы = НоваяЗаявка.ПереченьРейсов.Добавить();
									НовСтр_Рейсы.Продукт = ТекПродукт.Ссылка;
									НовСтр_Рейсы.Рейс = ТекРейс.Ссылка;
								КонецЕсли;
							
								///// Заполнить РС ВАГОНЫВОТПРАВКЕ. Связать вагоны и рейс ////////
								МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
								МЗ.Вагон = ВыборкаДетальныеЗаписи.НомерВагона;
								МЗ.Отправка = ТекРейс.Ссылка;
								МЗ.Период = ТекущаяДата();
								МЗ.Записать(Истина);
								// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 13.02.2023
								// Было:
								//НовСтр.Груз = ВыборкаДетальныеЗаписи.Груз; 
								//Стало:
								СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
								СтруктураКлючаАналитикиПеревозки.Контейнер = НовСтр.НомерКТК;
								СтруктураКлючаАналитикиПеревозки.Груз = ВыборкаДетальныеЗаписи.Груз;
								Если ЗначениеЗаполнено(НоваяЗаявка.Ссылка) Тогда 
									СтруктураКлючаАналитикиПеревозки.КлючАналитики = НовСтр.КлючАналитикиПеревозки;	
								КонецЕсли;	
								КлючАналитики = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
								НовСтр.КлючАналитикиПеревозки = КлючАналитики;
								// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 13.02.2023
								НовСтр.КодГруза = ВыборкаДетальныеЗаписи.Груз.ЕТСНГ;
								НовСтр.Груженый = ВыборкаДетальныеЗаписи.Груженый;
								НоваяЗаявка.Прибытие = ДатаПриб;
							КонецЕсли;
							
							Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Калькуляция) Тогда
								ДанныеПоКалькуляции = ПолучитьКалькуляцию(НоваяЗаявка.Контрагент, НоваяЗаявка.Договор, ВыборкаДетальныеЗаписи.СтанцияОтправления, ВыборкаДетальныеЗаписи.СтанцияНазначения);
								НовСтр.Калькуляция = ДанныеПоКалькуляции.Калькуляция;
								НоваяЗаявка.ПСЦ = ?(НЕ ЗначениеЗаполнено(НоваяЗаявка.ПСЦ),ДанныеПоКалькуляции.Протокол,НоваяЗаявка.ПСЦ);
								НоваяЗаявка.ВидПеревозки = ?(НЕ ЗначениеЗаполнено(НоваяЗаявка.ВидПеревозки),ДанныеПоКалькуляции.ВидПеревозки,НоваяЗаявка.ВидПеревозки);
							Иначе
								НовСтр.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
								НоваяЗаявка.ПСЦ = ?(НЕ ЗначениеЗаполнено(НоваяЗаявка.ПСЦ),ПолучитьПСЦПоКалькуляции(ВыборкаДетальныеЗаписи.Калькуляция),НоваяЗаявка.ПСЦ);
								НоваяЗаявка.ВидПеревозки = ?(НЕ ЗначениеЗаполнено(НоваяЗаявка.ВидПеревозки),ВыборкаДетальныеЗаписи.Калькуляция.ПС_ВидПеревозки,НоваяЗаявка.ВидПеревозки);
							КонецЕсли;
							
						КонецЦикла;
						
						Если Не ЗаявкаИзменена Тогда
							Продолжить;
						КонецЕсли;
						
						Попытка
							НоваяЗаявка.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							НоваяЗаявка.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
						
						// по ГУИДу заявки находим нужный вагон и формируем массив
						ПараметрыОтбора = Новый СТруктура;
						ПараметрыОтбора.Вставить("ГУИДЗаявки",ГУИДЗаявки);
						НайденныеСтроки = ТЗ_Заявок.НайтиСтроки(ПараметрыОтбора);
						Для Каждого ЭлСтр Из НайденныеСтроки Цикл
							СтруктураЗаписи = Новый Структура;
							СтруктураЗаписи.Вставить("НомерВагона",ЭлСтр.НомерВагона);
							СтруктураЗаписи.Вставить("ДатаПомещенияВРежимПовагонки",ЭлСтр.ДатаПомещенияВРежимПовагонки);
							СтруктураЗаписи.Вставить("Заявка",НоваяЗаявка.Ссылка);
							
							МассивЗаявок.Добавить(СтруктураЗаписи);
							
							// записать данные в регистры
							Если Фактическая Тогда
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
								               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон,
								               |	ПовагонныеОтправкиСрезПоследних.Заявка КАК Заявка
								               |ИЗ
								               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
								               |			,
								               |			Вагон = &Вагон
								               |				И Период = &Период) КАК ПовагонныеОтправкиСрезПоследних";
								
								Запрос.УстановитьПараметр("Вагон", ЭлСтр.НомерВагона);
								Запрос.УстановитьПараметр("Период", ЭлСтр.ДатаПомещенияВРежимПовагонки);
								ИмяРегистра = "ПовагонныеОтправки";
							Иначе
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон,
								               |	ВагоныЗапланированныеКПовагонке.Заявка КАК Заявка
								               |ИЗ
								               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
								               |ГДЕ
								               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон";
								
								Запрос.УстановитьПараметр("Вагон", ЭлСтр.НомерВагона);
								ИмяРегистра = "ВагоныЗапланированныеКПовагонке";
							КонецЕсли;
							
							РЗ = Запрос.Выполнить();
							Если НЕ РЗ.Пустой() Тогда
								Ответ = РЗ.Выбрать();

								Если Ответ.Следующий() Тогда
									ТекЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
									ТекЗапись2 = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
									
									ТекЗапись.Прочитать();
									Если НЕ ТекЗапись.Выбран() Тогда
										ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
									КонецЕсли;
									ТекЗапись.Заявка = НоваяЗаявка.Ссылка;
									
									ТекЗапись.Записать();
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
	Возврат МассивЗаявок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеРейлТариф(СтанцияОтправления,СтанцияНазначения,Груженый,Груз,ТипВагона,ПринадлежностьВагона)
	
	ДлительностьДней = 0;
	
	ПараметрыКалькуляции = РейлТариф_сервер.ПолучитьСтруктуруПараметровКалькуляции();

	ПараметрыКалькуляции.Порожний = НЕ Груженый;
	Если ПараметрыКалькуляции.Порожний Тогда
		ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = 1000;
		ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 100;//Порожние вагоны под погрузку/из-под выгрузки
	Иначе
		ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = 3000;
		ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 6;//Одиночные контейнеры (а также спец. контейнеры мелкой отправкой
		//Параметры груза
		ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ = ПолучитьРеквизитСсылкиНаСервере(Груз,"ЕТСНГ").ЕТСНГ;
		ПараметрыКалькуляции.ПараметрыГруза.Вес = 10;
		//Выбор груза
	КонецЕсли; 
	ПараметрыКалькуляции.КодСтанцииОтправления = ПолучитьРеквизитСсылкиНаСервере(СтанцияОтправления,"КодЖДСтанции").КодЖДСтанции;
	ПараметрыКалькуляции.КодСтанцииНазначения = ПолучитьРеквизитСсылкиНаСервере(СтанцияНазначения,"КодЖДСтанции").КодЖДСтанции;
	ПараметрыКалькуляции.ПараметрыОтправки.ПризнакМаршрутнойОтправки = 0;
	ПараметрыКалькуляции.ПараметрыОтправки.КодСкорости = 2;
	//Параметры контейнера
	ПараметрыКалькуляции.ПараметрыКонтейнера.КодВагона = ПолучитьРеквизитСсылкиНаСервере(ТипВагона, "КодПоКлассификаторуРейлТариф").КодПоКлассификаторуРейлТариф;
	ПараметрыКалькуляции.ПараметрыКонтейнера.ПринадлежностьВагона = ПолучитьПринадлежностьRTСервер(ПринадлежностьВагона);
	ПараметрыКалькуляции.ПараметрыКонтейнера.КоличествоВагонов = 1;
	//параметры платформы
	ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КодВагона = 2;
	ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.ПринадлежностьВагона = 2;
	ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КоличествоВагонов = 1;
	
	ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодВагона = ПолучитьРеквизитСсылкиНаСервере(ТипВагона, "КодПоКлассификаторуРейлТариф").КодПоКлассификаторуРейлТариф;
	ПараметрыКалькуляции.ПараметрыПорожнегоВагона.ПринадлежностьВагона = ПолучитьПринадлежностьRTСервер(ПринадлежностьВагона);
	ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КоличествоВагонов = 1;

	ДанныеКалькуляции = РейлТариф_сервер.ПолучитьКалькуляцию(ПараметрыКалькуляции);
	Если ДанныеКалькуляции.Ошибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеКалькуляции.ОписаниеОшибки);
		Возврат ДлительностьДней;
	КонецЕсли; 

	Для каждого СтрокаДанныхКалькуляции Из ДанныеКалькуляции.РезультатТаблица Цикл
		ДлительностьДней = ДлительностьДней + СтрокаДанныхКалькуляции.ДлительностьДней;
	КонецЦикла;
	
	Возврат ДлительностьДней;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПринадлежностьRTСервер(ПринадлежностьТС)
	Возврат Документы.Калькуляция.ПолучитьПринадлежностьRT(ПринадлежностьТС);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылкиНаСервере(СсылкаНаОбъект,Реквизит)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизит);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКалькуляцию(Контрагент, Договор, СтанцияОтправления, СтанцияНазначения)
	
	Результат = Новый Структура("Калькуляция, Протокол, ВидПеревозки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Ссылка,
	|	Калькуляция.Дата КАК Дата
	|ПОМЕСТИТЬ ВТКалькуляции
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.Контрагент = &Контрагент
	|	И Калькуляция.Договор = &Договор
	|	И Калькуляция.Проведен
	|	И Калькуляция.Суша_ПунктОтправления = &СтанцияОтправления
	|	И Калькуляция.Суша_ПунктНазначения = &СтанцияНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКалькуляции.Ссылка КАК Калькуляция
	|ПОМЕСТИТЬ ВТПоследниеКалькуляции
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВТКалькуляции.Дата) КАК Дата
	|	ИЗ
	|		ВТКалькуляции КАК ВТКалькуляции) КАК ДатаПоследнейКалькуляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКалькуляции КАК ВТКалькуляции
	|		ПО ДатаПоследнейКалькуляции.Дата = ВТКалькуляции.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоследниеКалькуляции.Калькуляция КАК Калькуляция,
	|	ПСЦКалькуляции.Ссылка КАК Протокол,
	|	ВТПоследниеКалькуляции.Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки
	|ИЗ
	|	ВТПоследниеКалькуляции КАК ВТПоследниеКалькуляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|		ПО ВТПоследниеКалькуляции.Калькуляция = ПСЦКалькуляции.Калькуляция";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Если ЗначениеЗаполнено(СтанцияОтправления) Тогда
		Запрос.УстановитьПараметр("СтанцияОтправления", СтанцияОтправления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Калькуляция.Суша_ПунктОтправления = &СтанцияОтправления", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтанцияНазначения) Тогда
		Запрос.УстановитьПараметр("СтанцияНазначения", СтанцияНазначения);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Калькуляция.Суша_ПунктНазначения = &СтанцияНазначения", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПСЦПоКалькуляции(Калькуляция)
	
	Результат = Документы.ПСЦ.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПСЦКалькуляцииПовагонки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПСЦ.КалькуляцииПовагонки КАК ПСЦКалькуляцииПовагонки
	|ГДЕ
	|	ПСЦКалькуляцииПовагонки.Калькуляция = &Калькуляция";
	
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервереБезКонтекста
Процедура РегламентОбновленияДатНаСервере()
	
	РаботаСПовагоннымиОтправками.ОбновлениеДанныхРегистраПовагонки();
	
КонецПроцедуры


&НаКлиенте
Процедура РегламентОбновленияДат(Команда)
	РегламентОбновленияДатНаСервере();
	
	ОбновитьВагоныВПовагонке();
	ОбновитьВагоныВПодходе();
	ОбновитьВагоныВышедшиеИзПовагонки();
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура РегламентОпоцещениеИсключениеНаСервере()
	РаботаСПовагоннымиОтправками.ОповещениеПользователейИсключениеИзПовагонки();
КонецПроцедуры


&НаКлиенте
Процедура РегламентОпоцещениеИсключение(Команда)
	РегламентОпоцещениеИсключениеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВагоныВПовагонкеКалькуляцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборКалькуляции(ТекД, "ВагоныВПовагонке", Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодходВагоновКалькуляцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборКалькуляции(ТекД, "ПодходВагонов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКалькуляции(ТекД, ИмяТаблицы, Фактическая)

	ПараметрыЗапроса = Новый СТруктура;
	Если Фактическая Тогда
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
		//ПараметрыЗапроса.Вставить("ПунктОтправления", ТекД.СтанцияПодачи);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
	Иначе
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.РегионОтправления);
		Если ЗначениеЗаполнено(ТекД.РегионВозврата) Тогда
			ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.РегионВозврата);
		Иначе
			ПараметрыЗапроса.Вставить("ПунктНазначения",Неопределено);
		КонецЕсли;			
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("НДС",ТекД.НДС);
	ПараметрыЗапроса.Вставить("Вагон",ТекД.НомерВагона);
	//Евросиб Каблов 07.04.2021 (
	ПараметрыЗапроса.Вставить("ПСЦ", ТекД.ПСЦ);
	ПараметрыЗапроса.Вставить("ОтборПоТипуТС", Истина);
	//Евросиб Каблов 07.04.2021 )
	
	СписокКальк = Новый СписокЗначений;
	СписокКальк.ЗагрузитьЗначения(ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса));
	
	ПараметрыОтбора = Новый СТруктура;
	ПараметрыОтбора.Вставить("ПодходящиеКалькуляции",СписокКальк);
	Если ЗначениеЗаполнено(ТекД.Клиент) Тогда
		ПараметрыОтбора.Вставить("Клиент",ТекД.Клиент);
	КонецЕсли;
	
	ДопПараметры = Новый СТруктура;
	ДопПараметры.Вставить("СписокКальк",СписокКальк);
	ДопПараметры.Вставить("ТекД",ТекД);
	ДопПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
	
	ОпОп = новый ОписаниеОповещения("ОбработкаВыбораКалькуляции", ЭтаФорма, ДопПараметры);
	ОткрытьФорму("Документ.Калькуляция.ФормаВыбора",ПараметрыОтбора ,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналогиЛокаций.Аналог КАК Станция
	|ПОМЕСТИТЬ СтанцииОтправления
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Локация = &ПунктОтправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Локация
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Аналог = &ПунктОтправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&ПунктОтправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогиЛокаций.Аналог КАК Станция
	|ПОМЕСТИТЬ СтанцииНазначения
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Локация = &ПунктНазначения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Локация
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Аналог = &ПунктНазначения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокКалькуляция.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВремКалькуляцииПоСтанциям
	|ИЗ
	|	Документ.Калькуляция КАК ДокКалькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
	|		ПО ДокКалькуляция.Ссылка = КалькуляцияСписокСтанцийОтправления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО ДокКалькуляция.Ссылка = КалькуляцияСписокСтанцийНазначения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|		ПО ДокКалькуляция.Ссылка = ПСЦКалькуляции.Калькуляция
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА &БезПунктаНазначения
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ КалькуляцияСписокСтанцийНазначения.Станция В ИЕРАРХИИ
	|						(ВЫБРАТЬ
	|							СтанцииНазначения.Станция КАК Станция
	|						ИЗ
	|							СтанцииНазначения КАК СтанцииНазначения)
	|			КОНЕЦ
	|			ИЛИ ДокКалькуляция.Ссылка.Суша_ПунктНазначения В
	|				(ВЫБРАТЬ
	|					СтанцииНазначения.Станция КАК Станция
	|				ИЗ
	|					СтанцииНазначения КАК СтанцииНазначения))
	|	И (КалькуляцияСписокСтанцийОтправления.Станция В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СтанцииОтправления.Станция КАК Станция
	|				ИЗ
	|					СтанцииОтправления КАК СтанцииОтправления)
	|			ИЛИ ДокКалькуляция.Ссылка.Суша_ПунктОтправления В
	|				(ВЫБРАТЬ
	|					СтанцииОтправления.Станция КАК Станция
	|				ИЗ
	|					СтанцииОтправления КАК СтанцииОтправления))
	|	И ПСЦКалькуляции.Ссылка = &ПСЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	|ИЗ
	|	ВремКалькуляцииПоСтанциям КАК ВремКалькуляцииПоСтанциям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВремКалькуляцииПоСтанциям.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|ГДЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС = &СтавкаНДС
	|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &ВыставляемаяУслуга
	|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП В (&РазмерВагона)";
	Запрос.УстановитьПараметр("ПунктОтправления",ПараметрыЗапроса.ПунктОтправления);
	Если ПараметрыЗапроса.ПунктНазначения = Неопределено Тогда
		Запрос.УстановитьПараметр("БезПунктаНазначения",Истина);
		Запрос.УстановитьПараметр("ПунктНазначения",ПараметрыЗапроса.ПунктНазначения);
	Иначе
		Запрос.УстановитьПараметр("БезПунктаНазначения",Ложь);
		Запрос.УстановитьПараметр("ПунктНазначения",ПараметрыЗапроса.ПунктНазначения);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("СтавкаНДС",ПараметрыЗапроса.НДС);
	Запрос.УстановитьПараметр("ВыставляемаяУслуга",Константы.УслугаДляПовагоннойЗаявки.Получить());
	
	//Евросиб Каблов 07.04.2021 ( Ticket#0226529
	ПСЦ = Неопределено;
	Если ПараметрыЗапроса.Свойство("ПСЦ", ПСЦ) И ЗначениеЗаполнено(ПСЦ) Тогда
		Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПСЦКалькуляции.Ссылка = &ПСЦ", "");
	КонецЕсли;
	
	ОтборПоТипуТС = Неопределено;
	Если ПараметрыЗапроса.Свойство("ОтборПоТипуТС", ОтборПоТипуТС) И ОтборПоТипуТС Тогда
		МассивРазмеровВагона = ПолучитьМассивРодителейТипаТС(ПараметрыЗапроса.Вагон.ТипТС,Истина);
		МассивРазмеровВагона.Добавить(Справочники.ТипоразмерыТС.ПустаяСсылка());
		Запрос.УстановитьПараметр("РазмерВагона",МассивРазмеровВагона);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП В (&РазмерВагона)", "");
	КонецЕсли;
	//Евросиб Каблов 07.04.2021 ) 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	МассивКалькуляций = ТЗ.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКалькуляций;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивРодителейТипаТС(ТипТС, ВключаяТекущий) 
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТипТС) Тогда Возврат Результат; КонецЕсли;
	
	ТекРодитель = ТипТС.Родитель;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		Результат.Добавить(ТекРодитель);
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	Если ВключаяТекущий = Истина Тогда Результат.Добавить(ТипТС); КОнецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКалькуляции(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	Параметр2.ТекД.Калькуляция = Параметр1;
	// если в массиве подходящих калькуляций нет выбранной, то значит, выбрали из общего списка; отметить как неподходящую
	Если Параметр2.СписокКальк.НайтиПоЗначению(Параметр1) = Неопределено Тогда
		Параметр2.ТекД.КалькуляцияНеПодходит = Истина;
	Иначе
		Параметр2.ТекД.КалькуляцияНеПодходит = Ложь;
	КонецЕсли;
	
	Если Параметр2.ИмяТаблицы = "ВагоныВПовагонке" Тогда
		ВагоныВПовагонкеПриИзменении(Элементы.ВагоныВПовагонке);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьКомплектДокументов(Команда)    
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
	ПоказатьПредупреждение(,"В настоящий момент эта функция не работает."+Символы.ПС+
					"Причина: логика основывалась на данных регистра <ВыставлениеПосуточнойАренды>, который был упразднен.",60);	
	Возврат;
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 -- 
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ТекТбл = "ВагоныВПовагонке";
	Иначе
		ТекТбл = "ВагоныВыведены";
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ЭтаФорма[ТекТбл].НайтиСтроки(ПараметрыОтбора);
	МассивОтмеченных = Новый Массив;
	Для Каждого Стр Из НайденныеСтроки Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("НомерВагона",Стр.НомерВагона);
		СтруктураСтроки.Вставить("ДатаОтправления",Стр.ДатаОтправления);

		// проверка на созданные сделки
		//Если ЗначениеЗаполнено(Стр.ДатаОтправления) И Стр.Сделка.Количество() = 0 Тогда
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Стр.Сделка.Количество() вызывает ошибку платформы)
		Если ЗначениеЗаполнено(Стр.ДатаОтправления) И НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
			Сообщить("Перед созданием комплекта документов должная быть создана сделка");
			Возврат;
		КонецЕсли;
		
		МассивОтмеченных.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Если МассивОтмеченных.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для создания комплекта документов!");
		Возврат;
	КонецЕсли;
	
	// проверка сделок на наличие ЖДН  
	//МассивСделок_С_ЖДН = ПроверкаСделокЖДН(МассивОтмеченных);
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
    МассивСделок_С_ЖДН = Новый Массив;
	//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	
	// нужно вывести информацию о тех сделках, где нет ЖДН
	Для Каждого Эл Из МассивОтмеченных Цикл
		Сообщить("Для сделки " + Эл + " не указан номер ЖДН");	
	КонецЦикла;
	
	Если МассивСделок_С_ЖДН.Количество() = 0 Тогда
		МассивСтруктур = Новый Массив;
	Иначе
		МассивСтруктур = ПодготовитьТаблицуПоДокументам(МассивСделок_С_ЖДН);	
	КонецЕсли;
	
	
	ПараметрыФормы =  Новый Структура("Повагонка, МассивСтрок", Истина, МассивСтруктур);
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаСозданияКомплектаДокументов", ПараметрыФормы);
	
КонецПроцедуры

//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
//&НаСервереБезКонтекста
//Функция ПроверкаСделокЖДН(МассивОтмеченных)
//	
//	МассивСделокБезЖДН = Новый Массив;
//	
//	ТблВагонов = Новый ТаблицаЗначений;
//	ТблВагонов.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
//	ТблВагонов.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
//	
//	Для Каждого Эл Из МассивОтмеченных Цикл
//		НовСтр = ТблВагонов.Добавить();
//		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
//	КонецЦикла;
//	
//	Запрос = Новый Запрос;
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ВремТЧ.НомерВагона КАК НомерВагона,
//	               |	ВремТЧ.ДатаОтправления КАК ДатаОтправления
//	               |ПОМЕСТИТЬ ВТ
//	               |ИЗ
//	               |	&ВремТЧ КАК ВремТЧ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВыставлениеПосуточнойАрендыОбороты.Период КАК Период,
//	               |	ВыставлениеПосуточнойАрендыОбороты.Регистратор КАК Сделка,
//	               |	ВыставлениеПосуточнойАрендыОбороты.НомерВагона КАК НомерВагона,
//	               |	ВыставлениеПосуточнойАрендыОбороты.ДатаОтправки КАК ДатаОтправки,
//	               |	ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот КАК КоличествоДнейОборот,
//	               |	ВыставлениеПосуточнойАрендыОбороты.ГУИД КАК ГУИД
//	               |ПОМЕСТИТЬ ДнейПоСделкам
//	               |ИЗ
//	               |	ВТ КАК ВТ
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
//	               |		ПО ВТ.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
//	               |			И ВТ.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
//				   |ГДЕ
//				   |	ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВыставлениеПосуточнойАрендыОбороты.Период КАК Период,
//	               |	ВыставлениеПосуточнойАрендыОбороты.Регистратор КАК РТУ,
//	               |	ВыставлениеПосуточнойАрендыОбороты.НомерВагона КАК НомерВагона,
//	               |	ВыставлениеПосуточнойАрендыОбороты.ДатаОтправки КАК ДатаОтправки,
//	               |	ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот КАК КоличествоДнейОборот,
//	               |	ВыставлениеПосуточнойАрендыОбороты.ГУИД КАК ГУИД
//	               |ПОМЕСТИТЬ ДнейПоРТУ
//	               |ИЗ
//	               |	ВТ КАК ВТ
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
//	               |		ПО ВТ.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
//	               |			И ВТ.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
//	               |ГДЕ
//	               |	ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ДнейПоСделкам.Период КАК ПериодЪ,
//	               |	ДнейПоСделкам.Сделка КАК Сделка,
//	               |	ДнейПоСделкам.НомерВагона КАК Вагон,
//	               |	СУММА(ЕСТЬNULL(ДнейПоСделкам.КоличествоДнейОборот, 0) - ЕСТЬNULL(ДнейПоРТУ.КоличествоДнейОборот, 0)) КАК НевыставленоДней,
//	               |	ДнейПоСделкам.ГУИД КАК ГУИД,
//	               |	ИСТИНА КАК ЗаписьПодходит,
//	               |	ЛОЖЬ КАК ЗаписьПроверена
//	               |ИЗ
//	               |	ДнейПоСделкам КАК ДнейПоСделкам
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДнейПоРТУ КАК ДнейПоРТУ
//	               |		ПО ДнейПоСделкам.НомерВагона = ДнейПоРТУ.НомерВагона
//	               |			И ДнейПоСделкам.Период = ДнейПоРТУ.Период
//	               |			И ДнейПоСделкам.ГУИД = ДнейПоРТУ.ГУИД
//	               |ГДЕ
//	               |	ЕСТЬNULL(ДнейПоСделкам.КоличествоДнейОборот, 0) - ЕСТЬNULL(ДнейПоРТУ.КоличествоДнейОборот, 0) > 0
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ДнейПоСделкам.ГУИД,
//	               |	ДнейПоСделкам.Период,
//	               |	ДнейПоСделкам.Сделка,
//	               |	ДнейПоСделкам.НомерВагона";
//	
//	Запрос.УстановитьПараметр("ВремТЧ",ТблВагонов);
//	ТЗ = Запрос.Выполнить().Выгрузить();
//	
//	МассивОтмеченных = Новый Массив;
//	
//	Для Каждого Стр Из ТЗ Цикл
//		
//		Если Стр.ЗаписьПроверена Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		// цикл по ТЧ сделки СвязьУчетныхЕдиниц
//		ТЧ_Сделки = Стр.Сделка.СвязьУчетныхЕдиниц;
//		Для Каждого Стр_сд Из ТЧ_Сделки Цикл
//			Если НЕ ЗначениеЗаполнено(Стр_сд.ЖДН) ТОгда
//				ПараметрыОтбора = Новый Структура;
//				ПараметрыОтбора.Вставить("Сделка",Стр.Сделка);
//				НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
//				Для Каждого НС ИЗ НайденныеСтроки Цикл
//					НС.ЗаписьПодходит = Ложь;
//					НС.ЗаписьПроверена = Истина;
//				КонецЦикла;
//				МассивОтмеченных.Добавить(Стр.Сделка);
//			КонецЕсли;
//		КонецЦикла;	
//		
//	КонецЦикла;
//	
//	// после обработки ТЧ, удалить все строки, у которых записьПодходит = Ложь
//	ПараметрыОтбора = Новый Структура;
//	ПараметрыОтбора.Вставить("ЗаписьПодходит",Истина);

//	ТЗ_Результат = ТЗ.Скопировать(ПараметрыОтбора);
//	
//	ИтоговыйМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ_Результат);
//	
//	Возврат ИтоговыйМассив;
//	
//КонецФункции  
//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --

&НаСервереБезКонтекста
Функция ПодготовитьТаблицуПоДокументам(МассивСделокБезЖДН)
	
	ТблВагонов = Новый ТаблицаЗначений;
	
	ТблВагонов.Колонки.Добавить("Вагон",Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТблВагонов.Колонки.Добавить("ПериодЪ",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТблВагонов.Колонки.Добавить("Сделка",Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТблВагонов.Колонки.Добавить("НевыставленоДней",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТблВагонов.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	
	Для Каждого Эл Из МассивСделокБезЖДН Цикл
		НовСтр = ТблВагонов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
	КонецЦикла;
	
	// т.к. в таблице доходов данные уже сгруппированы, то создаем документы согласно этой группировке.
	// строки, в которых указаны реализации с флагом "Выставлен", не используем.
	
	// необходимо добавить группировку по датам ДатаНачалаПериодаПовагонки и ДатаОкончанияПериодаПовагонки, т.к.
	// в сделке этого не сделать (могут быть не созданы ранее документы и в разных сделках будут разные периоды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.ПериодЪ КАК ПериодЪ,
	               |	ВремТЧ.Сделка КАК Сделка,
	               |	ВремТЧ.Вагон КАК Вагон,
	               |	ВремТЧ.НевыставленоДней КАК НевыставленоДней,
	               |	ВремТЧ.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ НевыставленоДнейЪ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПовагонныеОтправки.Период КАК Период,
	               |	ПовагонныеОтправки.Вагон КАК Вагон,
	               |	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
	               |	НевыставленоДнейЪ.Сделка КАК Сделка,
	               |	ПовагонныеОтправки.Клиент КАК Клиент,
	               |	ПовагонныеОтправки.Договор КАК Договор,
	               |	ПовагонныеОтправки.ПСЦ КАК ПСЦ,
	               |	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ПовагонныеОтправки.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	ПовагонныеОтправки.ДатаОтправления КАК ДатаОтправления,
	               |	НевыставленоДнейЪ.ГУИД КАК ГУИД,
	               |	НевыставленоДнейЪ.НевыставленоДней КАК НевыставленоДней
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	НевыставленоДнейЪ КАК НевыставленоДнейЪ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	               |		ПО НевыставленоДнейЪ.ПериодЪ = ПовагонныеОтправки.ДатаОтправления
	               |			И НевыставленоДнейЪ.Вагон = ПовагонныеОтправки.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СделкаДоходы.Ссылка КАК Сделка,
	               |	СделкаДоходы.НомерСтроки КАК НомерСтроки,
	               |	СделкаДоходы.Клиент КАК Клиент,
	               |	СделкаДоходы.Договор КАК Договор,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.Калькуляция КАК Калькуляция,
	               |	СделкаДоходы.Себестоимость КАК Себестоимость,
	               |	СделкаДоходы.Вознаграждение КАК Вознаграждение,
	               |	СделкаДоходы.Ставка КАК Ставка,
	               |	СделкаДоходы.Количество КАК Количество,
	               |	СделкаДоходы.СебестоимостьИтого КАК СебестоимостьИтого,
	               |	СделкаДоходы.ВознаграждениеИтого КАК ВознаграждениеИтого,
	               |	СделкаДоходы.СтавкаИтого КАК СтавкаИтого,
	               |	СделкаДоходы.Рентабельность КАК Рентабельность,
	               |	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
	               |	СделкаДоходы.СуммаНДС КАК СуммаНДС,
	               |	СделкаДоходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	СделкаДоходы.СуммаИтого КАК СуммаИтого,
	               |	СделкаДоходы.ГУИД КАК ГУИД,
	               |	СделкаДоходы.ТипВагонов КАК ТипВагонов,
	               |	СделкаДоходы.ТипКТК КАК ТипКТК,
	               |	СделкаДоходы.Груз КАК Груз,
	               |	СделкаДоходы.РазмерКТК КАК РазмерКТК,
	               |	СделкаДоходы.ПериодВО КАК ПериодВО,
	               |	СделкаДоходы.УчДокумент КАК УчДокумент,
	               |	СделкаДоходы.Валюта КАК Валюта,
	               |	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	               |	СделкаДоходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	СделкаДоходы.РеестрКлиента КАК РеестрКлиента,
	               |	СделкаДоходы.ПСЦ КАК ПСЦ,
	               |	СделкаДоходы.Подсыл КАК Подсыл,
	               |	СделкаДоходы.Комментарий КАК Комментарий,
	               |	СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонкиУчДок,
	               |	СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонкиУчДок,
	               |	СделкаДоходы.ОтправлениеУчДокумента КАК ОтправлениеУчДокумента,
	               |	СделкаДоходы.НазначениеУчДокумента КАК НазначениеУчДокумента
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ПО Повагонка.Сделка = СделкаДоходы.Ссылка
	               |			И Повагонка.ГУИД = СделкаДоходы.ГУИД";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТблВагонов);
	
	ТЗВспомогательная = Запрос.Выполнить().Выгрузить();
	
	ТЗВспомогательная.Колонки.Добавить("СписокДокументов");
	
	Для каждого Стр Из ТЗВспомогательная Цикл 

		Перевыставление = Ложь;
		ПрямыеПродажи = Ложь;
		УчДокумент =  Неопределено;
		
		СписокДокументов = Новый Массив;
		
		Если Стр.Перевыставляемая Тогда
			УчДокумент = ?(ЗначениеЗаполнено(Стр.УчДокумент),Стр.УчДокумент,НайтиОтчет(Стр.Сделка, Стр.ГУИД));
			Перевыставление = Истина;
		Иначе
			//Евросиб СубботинВ #84453 02.07.2024 Начало // переделал на вызов аналогичной процедуры из общего модуля + перешел с поиском сделки на сделку из ТЧ
            //УчДокумент = ?(ЗначениеЗаполнено(Стр.УчДокумент),Стр.УчДокумент,НайтиРеализацию(Стр.Сделка, Стр.ГУИД));
			УчДокумент = ?(ЗначениеЗаполнено(Стр.УчДокумент),Стр.УчДокумент,РаботаСПовагоннымиОтправками.НайтиРеализацию(Стр.Сделка, Стр.ГУИД));
			//Евросиб СубботинВ #84453 02.07.2024 Конец

			ПрямыеПродажи = Истина;
		КонецЕсли;
		
		Если Перевыставление Тогда
			//Отчет
			ЭлементМассива = Новый Структура;
			ЭлементМассива.Вставить("ВидДокумента", "Отчет комитенту о закупках");
			ЭлементМассива.Вставить("Документ", УчДокумент);
			СписокДокументов.Добавить(ЭлементМассива);
			//Счет
			ЭлементМассива = Новый Структура;
			Счет = ?(ЗначениеЗаполнено(УчДокумент),НайтиСчетНаОплату(УчДокумент),Неопределено);
			ЭлементМассива.Вставить("ВидДокумента", "Счет покупателю");
			ЭлементМассива.Вставить("Документ", Счет);
			СписокДокументов.Добавить(ЭлементМассива);
			//СчФ
			ЭлементМассива = Новый Структура;
			СчФ = ?(ЗначениеЗаполнено(УчДокумент),БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(УчДокумент,"СчетФактураВыданный"),Неопределено);
			ЭлементМассива.Вставить("ВидДокумента", "Счет-фактура выданный");
			ЭлементМассива.Вставить("Документ", СчФ);
			СписокДокументов.Добавить(ЭлементМассива);

		КонецЕсли;
		Если ПрямыеПродажи Тогда
			//Акт
			ЭлементМассива = Новый Структура;
			ЭлементМассива.Вставить("ВидДокумента", "Реализация товаров и услуг");
			ЭлементМассива.Вставить("Документ", УчДокумент);
			СписокДокументов.Добавить(ЭлементМассива);
			//Счет
			ЭлементМассива = Новый Структура;
			Счет = ?(ЗначениеЗаполнено(УчДокумент),НайтиСчетНаОплатуПоРеализации(УчДокумент),Неопределено);
			ЭлементМассива.Вставить("ВидДокумента", "Счет покупателю");
			ЭлементМассива.Вставить("Документ", Счет);
			СписокДокументов.Добавить(ЭлементМассива);
			//СчФ
			ЭлементМассива = Новый Структура;
			СчФ = ?(ЗначениеЗаполнено(УчДокумент),БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(УчДокумент,"СчетФактураВыданный"),Неопределено);
			ЭлементМассива.Вставить("ВидДокумента", "Счет-фактура выданный");
			ЭлементМассива.Вставить("Документ", СчФ);
			СписокДокументов.Добавить(ЭлементМассива);
			
		КонецЕсли;
		
		Стр.СписокДокументов = СписокДокументов;
		
	КонецЦикла;
	
	
	ИтоговыйМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗВспомогательная);
	
	Возврат ИтоговыйМассив;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиОтчет(ОбъектСсылка, СтрГУИД)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", СтрГУИД);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка = &Ссылка
	               |	И ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки = &СтрокаДоходовСделки
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Дата УБЫВ";
	Ответ = запрос.Выполнить().Выбрать();
	Если ответ.Следующий() Тогда
		Результат = ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСчетНаОплату(УчДокумент)
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",УчДокумент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.ДокументыОснования.Документ = &ДокументОснование
	               |	И СчетНаОплатуПокупателю.КомиссионныеУслуги = ИСТИНА
	               |	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Результат = Выборка.Ссылка;
	 КонецЕсли;
	 Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСчетНаОплатуПоРеализации(УчДокумент)
	//Евросиб Каблов 04.08.2025 ( #115153
	//Возврат УчДокумент.СчетНаОплатуПокупателю;	
	СчетаПокупателю = ПечатьКомплектаДокументов.НайтиСчетаПоСделке(УчДокумент);
	Если ЗначениеЗаполнено(СчетаПокупателю) Тогда
		СчетПокупателю = СчетаПокупателю[0];
	Иначе
		СчетПокупателю = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СчетПокупателю;
	//Евросиб Каблов 04.08.2025 )
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКвантВремениРеализации(ДатаОтправления,КвантВремени,ТЗВспомогательная)
	
	ДатаНачалаПериодаПовагонкиУчДок = ДатаОтправления;
	ДатаОкончанияПериодаПовагонкиУчДок = ДатаОтправления + КвантВремени*3600;
	
	// ИЩЕМ в рамках данной сделки!!!!!!!!!!
	
	// поиск кванта времени
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
	               |	ВремТЧ.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВТ.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	НЕ ВТ.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ ВТ.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ВТ.ДатаОкончанияПериодаПовагонки < &ТекДатаОтпр
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияПериодаПовагонки УБЫВ";
	Запрос.УстановитьПараметр("ВремТЧ",ТЗВспомогательная);
	Запрос.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
	РЗ = Запрос.Выполнить();
	
	Если РЗ.Пустой() Тогда
		
		// если не нашли дат ранее текущей, то проверить, нет ли дат после нее
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ
		                |	ВремТЧ.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
		                |	ВремТЧ.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки
		                |ПОМЕСТИТЬ ВТ
		                |ИЗ
		                |	&ВремТЧ КАК ВремТЧ
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ ПЕРВЫЕ 1
		                |	ВТ.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки
		                |ИЗ
		                |	ВТ КАК ВТ
		                |ГДЕ
		                |	НЕ ВТ.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И НЕ ВТ.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И ВТ.ДатаНачалаПериодаПовагонки > &ТекДатаОтпр
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	ВТ.ДатаНачалаПериодаПовагонки";
		Запрос2.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
		РЗ2 = Запрос2.Выполнить();
		
		// если и здесь пусто, то считаем эту дату начальной и от нее строим всю остальную цепочку
		Если РЗ2.Пустой() Тогда
			ДатаНачалаПериодаПовагонкиУчДок = ДатаОтправления;
			ДатаОкончанияПериодаПовагонкиУчДок = ДатаОтправления + КвантВремени*3600*24;
			
		// если что-то нашли, то создаем сделку так, чтобы между найденной и текущей были равные кванту времени промежутки
		Иначе
			Ответ2 = Запрос2.Выполнить().Выбрать();
		
			Если Ответ2.Следующий() Тогда
				ДельтаДни = (Ответ2.ДатаНачалаПериодаПовагонки - ДатаОтправления)/3600/24;
				КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
				ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
				ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
				НачалоПервогоЗаИскомымПериода = Ответ2.ДатаНачалаПериодаПовагонки - ВсегоДнейВИнтервалах*3600*24;
				НачалоИскомогоПериода = НачалоПервогоЗаИскомымПериода - КвантВремени*3600*24;
				// вычитаем единицу, чтобы интервалы не пересекались
				КонецИскомогоПериода = НачалоПервогоЗаИскомымПериода - 1;
				
				ДатаНачалаПериодаПовагонкиУчДок = НачалоИскомогоПериода;
				ДатаОкончанияПериодаПовагонкиУчДок = КонецИскомогоПериода;
			КонецЕсли;
		КонецЕсли;
		
	// если что-то нашли, то выбираем диапазоны дат так, чтобы между найденной и текущей были равные кванту времени промежутки
	Иначе
		Ответ = Запрос.Выполнить().Выбрать();
		
		Если Ответ.Следующий() Тогда
			ДельтаДни = (ДатаОтправления - Ответ.ДатаОкончанияПериодаПовагонки)/3600/24;
			КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
			ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
			ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
			ОкончаниеПоследнегоПередИскомымПериода = Ответ.ДатаОкончанияПериодаПовагонки + ВсегоДнейВИнтервалах*3600*24;
			// вычитаем единицу, чтобы интервалы не пересекались
			НачалоИскомогоПериода = ОкончаниеПоследнегоПередИскомымПериода - 1;
			КонецИскомогоПериода = НачалоПервогоЗаИскомымПериода + КвантВремени*3600*24;
			
			ДатаНачалаПериодаПовагонкиУчДок = НачалоИскомогоПериода;
			ДатаОкончанияПериодаПовагонкиУчДок = КонецИскомогоПериода;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета = Новый СТруктура;
	СтруктураОтвета.Вставить("ДатаНач",ДатаНачалаПериодаПовагонкиУчДок);
	СтруктураОтвета.Вставить("ДатаКон",ДатаОкончанияПериодаПовагонкиУчДок);
	
	Возврат СтруктураОтвета;
	
КонецФункции


&НаКлиенте
Процедура ВнесениеСНП(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
	МассивСтруктур = Новый Массив;
	Для Каждого Стр Из НайденныеСтроки Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("НомерВагона",Стр.НомерВагона);
		СтруктураСтроки.Вставить("ДатаОтправления",Стр.ДатаОтправления);
		СтруктураСтроки.Вставить("Заявка",Стр.Заявка);

		МассивСтруктур.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Если МассивСтруктур.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для выставления СНП");
		Возврат;
	КонецЕсли;
		
	ДобавитьСНПВыгрузкиВСделки(МассивСтруктур);
	ОбновитьВагоныВПовагонке();
	
	//Если ВагоныВПовагонке.Количество() = 0 Тогда
	//	ОбновитьВагоныВПовагонке(1);
	//Иначе
	//	ОбновитьВагоныВПовагонке(0);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСНПВыгрузкиВСделки(МассивСтруктур)
	
	РаботаСПовагоннымиОтправками.СНПВыгрузкиВСделки(МассивСтруктур);
	
КонецПроцедуры


&НаКлиенте
Процедура ВагоныВПовагонкеПСЦПриИзменении(Элемент)
	
	ТекД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АвтоПОдстановкаКалькуляции(ТекД,Истина);
	
КонецПроцедуры

&НаКлиенте
Функция АвтоПОдстановкаКалькуляции(ТекД,Фактическая);
	
	//Евросиб Каблов 12.10.2020 (
	//СтавкаНДС = ПолучитьДанныеПСЦ(ТекД.ПСЦ);
	Если ЗначениеЗаполнено(ТекД.ПСЦ) Тогда
		ЗначенияРеквизитовПСЦ = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекД.ПСЦ, "СтавкаНДС, ОплатаПользованияВагоном");
		Если Не ЗначениеЗаполнено(ЗначенияРеквизитовПСЦ.ОплатаПользованияВагоном) Тогда
			ТекД.ПСЦ = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В протоколе не заполнено поле Оплата пользования вагоном!");
		КонецЕсли;
	Иначе
		СтавкаНДС = Неопределено;
	КонецЕсли;
	//Евросиб Каблов 12.10.2020 )
	ТекД.НДС = СтавкаНДС;
	
	ПараметрыЗапроса = Новый СТруктура;
	Если Фактическая Тогда
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.СтанцияОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.СтанцияНазначения);
	Иначе
		ПараметрыЗапроса.Вставить("ПунктОтправления",ТекД.РегионОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",ТекД.РегионВозврата);
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("НДС",ТекД.НДС);
	ПараметрыЗапроса.Вставить("Вагон",ТекД.НомерВагона);
	
	//Евросиб Каблов 07.04.2021 (
	ПараметрыЗапроса.Вставить("ПСЦ", ТекД.ПСЦ);
	//Евросиб Каблов 07.04.2021 ) 
	
	МассивКальк = ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса);
	Если МассивКальк.Количество()>0 Тогда
		ТекД.Калькуляция = МассивКальк[0];
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПСЦ(ПСЦ)
	
	Возврат ПСЦ.СтавкаНДС;
	
КонецФункции

&НаКлиенте
Процедура ПодходВагоновПСЦПриИзменении(Элемент)
	
	ТекД = Элементы.ПодходВагонов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АвтоПОдстановкаКалькуляции(ТекД,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВагоновПриИзменении(Элемент)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТбл = "ВагоныВПовагонке";
	Иначе
		ИмяТбл = "ВагоныВыведены";
	КонецЕсли;
	// ВСЕ
	Если ОтборВагонов = 0 Тогда
		Элементы[ИмяТбл].ОтборСтрок = неопределено;
	// Вагоны без заявок
	ИначеЕсли ОтборВагонов = 1 Тогда
		Элементы[ИмяТбл].ОтборСтрок = Новый ФиксированнаяСтруктура("Заявка", ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка"));
	// Вагоны без сделок
	ИначеЕсли ОтборВагонов = 2 Тогда
		//Евросиб Каблов 06.11.2020 ( Ticket#0212868
		//Элементы[ИмяТбл].ОтборСтрок = Новый ФиксированнаяСтруктура("БезСделки", Истина)
		Элементы[ИмяТбл].ОтборСтрок = Новый ФиксированнаяСтруктура("Сделка", ПредопределенноеЗначение("Документ.Сделка.ПустаяСсылка"));
		//Евросиб Каблов 06.11.2020 )
	// Вагоны без документов
	ИначеЕсли ОтборВагонов = 3 Тогда
		Элементы[ИмяТбл].ОтборСтрок = Новый ФиксированнаяСтруктура("БезФинДокументов", Истина)
	// завершенные треки - дата прибытия на станцию назначения	
	ИначеЕсли ОтборВагонов = 4 Тогда
		Элементы[ИмяТбл].ОтборСтрок = Новый ФиксированнаяСтруктура("ЗавершенныйТрек", Истина)
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДозаполнитьЗаявку(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка",Истина);
	НайденныеСтроки = ВагоныВПовагонке.НайтиСтроки(ПараметрыОтбора);
	МассивСтруктур = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("НомерВагона",Стр.НомерВагона);
		СтруктураСтроки.Вставить("ДатаОтправления",Стр.ДатаОтправления);
		СтруктураСтроки.Вставить("Заявка",Стр.Заявка);
		СтруктураСтроки.Вставить("СтанцияОтправления",Стр.СтанцияОтправления);
		СтруктураСтроки.Вставить("СтанцияНазначения",Стр.СтанцияНазначения);
		СтруктураСтроки.Вставить("Груженый",Стр.Груженый);
		СтруктураСтроки.Вставить("Груз",Стр.Груз);
		СтруктураСтроки.Вставить("Калькуляция",Стр.Калькуляция);

		МассивСтруктур.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Если МассивСтруктур.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для дозаполнения заявки");
		Возврат;
	КонецЕсли;
	
	МассивИзмененных = ДозаполнитьЗаявкуНасервере(МассивСтруктур);
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		Если НЕ МассивИзмененных.Найти(Стр.Заявка) = Неопределено ТОгда
			Стр.ЗаявкаНеПодходит = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДозаполнитьЗаявкуНасервере(МассивСтруктур)
	
	МассивИзмененных = Новый Массив;
	
	Для Каждого Эл Из МассивСтруктур Цикл
	
		//////// создать ПРОДУКТ, проверив перед этим, возможно, он уже создан//////////
		//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
		//ТекПродукт = Справочники.Продукты.ПустаяСсылка();
		ТекПродукт = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
		//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
		ЗапросП = Новый Запрос;
		ЗапросП.Текст = "ВЫБРАТЬ 
						|	Продукты.Ссылка КАК Ссылка
						|ИЗ
						//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
						//|	Справочник.Продукты КАК Продукты
						|	Справочник.СервисыУчетноеНаправление КАК Продукты
						//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
						|ГДЕ
						|	НЕ Продукты.ПометкаУдаления
						|	И Продукты.НачалоМаршрута = &НачалоМаршрута
						|	И Продукты.ОкончаниеМаршрута = &ОкончаниеМаршрута";
		ЗапросП.УстановитьПараметр("НачалоМаршрута",Эл.СтанцияОтправления);
		ЗапросП.УстановитьПараметр("ОкончаниеМаршрута",Эл.СтанцияНазначения);
		РезультатЗапросаП = ЗапросП.Выполнить();
		Если РезультатЗапросаП.Пустой() Тогда
			// создать продукт 
			//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
			//ТекПродукт = Справочники.Продукты.СоздатьЭлемент();
			ТекПродукт = Справочники.СервисыУчетноеНаправление.СоздатьЭлемент();
			//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
			ТекПродукт.Наименование = Строка(Эл.СтанцияОтправления) + " - " + Строка(Эл.СтанцияНазначения);
			ТекПродукт.ВключаетРасходыПоПодсылуВагонов = Истина;
			ТекПродукт.НачалоМаршрута = Эл.СтанцияОтправления;
			ТекПродукт.ОкончаниеМаршрута = Эл.СтанцияНазначения;
			Если Эл.СтанцияОтправления.Страна = Справочники.СтраныМира.Россия И Эл.СтанцияНазначения.Страна = Справочники.СтраныМира.Россия Тогда 
				//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
				//ТекПродукт.Родитель = Справочники.Продукты.НайтиПоНаименованию("РФ - РФ");
				ТекПродукт.Родитель = Справочники.СервисыУчетноеНаправление.НайтиПоНаименованию("РФ - РФ");
				//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
			Иначе
				//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
				//ТекПродукт.Родитель = Справочники.Продукты.НайтиПоНаименованию("Продукты");
				ТекПродукт.Родитель = Справочники.СервисыУчетноеНаправление.НайтиПоНаименованию("Продукты");
				//ДИТ Шевченко А.В. US 62360 ТА 72965 26.07.2023
			КонецЕсли;
			ТекПродукт.Записать();
		Иначе
			ТекПродукт = РезультатЗапросаП.Выгрузить().ВыгрузитьКолонку("Ссылка")[0];
		КонецЕсли;

		// рейс ищем или создаем здесь, т.к. нужно получить признак груженого или порожнего
		// проверка, есть ли уже такой рейс. 
		ТекРейс = Справочники.РейсыЖД.ПустаяСсылка();
		ЗапросР = Новый Запрос;
		ЗапросР.Текст = "ВЫБРАТЬ
		                |	РейсыЖД.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.РейсыЖД КАК РейсыЖД
		                |ГДЕ
		                |	НЕ РейсыЖД.КП
		                |	И НЕ РейсыЖД.ПометкаУдаления
		                |	И РейсыЖД.ПовагоннаяОтправка
		                |	И РейсыЖД.ПунктОтправления = &ПунктОтправления
		                |	И РейсыЖД.ПунктНазначения = &ПунктНазначения
		                |	И ВЫБОР
		                |			КОГДА &ДатаЕсть = ИСТИНА
		                |				ТОГДА НАЧАЛОПЕРИОДА(РейсыЖД.ДатаПрибытия, ДЕНЬ) = &ДатаПрибытия
		                |			ИНАЧЕ ИСТИНА
		                |		КОНЕЦ
		                |	И НАЧАЛОПЕРИОДА(РейсыЖД.ДатаОтправления, ДЕНЬ) = &ДатаОтправления";
		ЗапросР.УстановитьПараметр("ПунктОтправления",Эл.СтанцияОтправления);
		ЗапросР.УстановитьПараметр("ПунктНазначения",Эл.СтанцияНазначения);
		ЗапросР.УстановитьПараметр("ДатаОтправления",НачалоДня(Эл.ДатаОтправления));
		// получаем дату прибытия по табельному расписанию
		ДанныеТабельногоРасписания = Отправки_сервер.ПолучитьТабельноеРасписаниеПоПараметрам(Эл.СтанцияОтправления, Эл.СтанцияНазначения);
		КолвоДн = ДанныеТабельногоРасписания.ДобавитьКОкончанию;
		Если ЗначениеЗаполнено(КолвоДн) Тогда
			ДатаПриб = Эл.ДатаОтправления + КолвоДн*24;
		КонецЕсли;
		// если по табельному расписанию не получили ничего, то запрос к рейл тарифу
		Если Не ЗначениеЗаполнено(ДатаПриб) Тогда
			КолвоДн = ПолучитьДанныеРейлТариф(Эл.СтанцияОтправления,Эл.СтанцияНазначения,Эл.Груженый,Эл.Груз,Эл.НомерВагона.ТипТС,Перечисления.ПринадлежностьПС.Собственный);
			ДатаПриб = Эл.ДатаОтправления + КолвоДн*3600*24;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаПриб) Тогда
			ЗапросР.УстановитьПараметр("ДатаЕсть",Истина);
			ЗапросР.УстановитьПараметр("ДатаПрибытия",НачалоДня(ДатаПриб));
		Иначе
			ЗапросР.УстановитьПараметр("ДатаЕсть",Ложь);
			ЗапросР.УстановитьПараметр("ДатаПрибытия",1);
		КонецЕсли;
		
		РезультатЗапросаР = ЗапросР.Выполнить();
		Если РезультатЗапросаР.Пустой() Тогда
			//////////////// создать РЕЙС ////////////////////////////
			ТекРейс = Справочники.РейсыЖД.СоздатьЭлемент();
			ТекРейс.Наименование = Строка(Эл.СтанцияОтправления) + " - " + Строка(Эл.СтанцияНазначения);
			ТекРейс.ПунктОтправления = Эл.СтанцияОтправления;
			ТекРейс.ПунктНазначения = Эл.СтанцияНазначения;
			ТекРейс.ДатаОтправления = Эл.ДатаОтправления;
			ТекРейс.ДатаПрибытия = ДатаПриб;
			ТекРейс.Продукт = ТекПродукт.Ссылка;
			ТекРейс.Сервис = ТекПродукт.Ссылка;
			ТекРейс.ПовагоннаяОтправка = Истина;
			ТекРейс.ТехРейс = Истина;
			ТекРейс.Записать();
			//////////////////////////////////////////////////////////
		Иначе
			ТекРейс = РезультатЗапросаР.Выгрузить().ВыгрузитьКолонку("Ссылка")[0];
		КонецЕсли;
		
		ТекЗаявка = Эл.Заявка.ПолучитьОбъект();
		
		ТЧ_Рейсы = ТекЗаявка.ПереченьРейсов;
		НовСтр_Рейсы = ТЧ_Рейсы.Добавить();
		НовСтр_Рейсы.Продукт = ТекПродукт.Ссылка;
		НовСтр_Рейсы.Рейс = ТекРейс.Ссылка;
	
		///// Заполнить РС ВАГОНЫВОТПРАВКЕ. Связать вагоны и рейс ////////
		МЗ = РегистрыСведений.ВагоныВОтправке.СоздатьМенеджерЗаписи();
		МЗ.Вагон = Эл.НомерВагона;
		МЗ.Отправка = ТекРейс.Ссылка;
		МЗ.Период = ТекущаяДата();
		МЗ.Записать(Истина);
		
		// изменить строку с вагоном
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Вагон",Эл.НомерВагона);
		НайденныйВагон = ТекЗаявка.СоставУслуги.НайтиСтроки(ПараметрыОтбора);
		Если НайденныйВагон.Количество()>0 Тогда
			НовСтр = НайденныйВагон[0];
			НовСтр.Калькуляция = Эл.Калькуляция;
			НовСтр.Груз = Эл.Груз;
			НовСтр.КодГруза = Эл.Груз.ЕТСНГ;
			НовСтр.Груженый = Эл.Груженый;
			НовСтр.ПунктНазначения = Эл.СтанцияНазначения;
			НовСтр.СтанцияНазначения = Эл.СтанцияНазначения;
			
		КонецЕсли;
		ТекЗаявка.Прибытие = ДатаПриб;
		
		Попытка
			ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			МассивИзмененных.Добавить(ТекЗаявка.Ссылка);
		Исключение
			ТекЗаявка.Записать(РежимЗаписиДокумента.Запись);
			МассивИзмененных.Добавить(ТекЗаявка.Ссылка);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат МассивИзмененных;
	
КонецФункции

&НаКлиенте
Процедура ВагоныВыведеныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекД = Элементы.ВагоныВыведены.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	СтруктураДанныхСтроки = Новый Структура;
	Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
		Попытка
			СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,ТекД[ЭлемСп.Значение]);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЗаявкаИзменилась = Ложь;
	СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Ложь,Неопределено);
	
	ЗаполнитьЗначенияСвойств(ТекД, СтруктураДанныхСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаУшедшийРейс(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТч = "ВагоныВПовагонке";
		Фактическая = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ИмяТч = "ВагоныВыведены";
		Фактическая = Истина;
	Иначе
		ИмяТч = "ПодходВагонов";
		Фактическая = Ложь;
	КонецЕсли;
	
	ТекД = Элементы[ИмяТч].ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	
	//ТаблицаВыбранныхСтрок = ВагоныВПовагонке.Выгрузить(,"СтанцияОтправления, СтанцияНазначения, ДатаОтправления");
	//ТаблицаВыбранныхСтрок.Очистить();
	мСписокВагонов = Новый Массив;
	Для Каждого Стр Из ЭтаФорма[ИмяТч] Цикл
		СтруктураДанныхСтроки = Новый Структура;
		Если НЕ Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.Клиент) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран клиент. Выберите клиента и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Договор) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран договор. Выберите договор и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ПСЦ) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран ПСЦ. Выберите ПСЦ и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.НДС) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбран НДС. Выберите НДС и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбрана калькуляция. Выберите калькуляцию и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Стр.СтанцияПодачи) Тогда
		Если НЕ ЗначениеЗаполнено(Стр.СтанцияОтправления) Тогда
			Сообщить("У выбранного вагона "+Стр.НомерВагона+" не выбрана станция отправления. Выберите станцию отправления и повторите попытку создания заявки");
			ВОзврат;
		КонецЕсли;
		
		Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
			Попытка
				СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение,Стр[ЭлемСп.Значение]);
			Исключение
			КонецПопытки;
		КонецЦикла;
		СтруктураДанныхСтроки.Вставить("ДатаНакладной", Дата(1,1,1));
		СтруктураДанныхСтроки.Вставить("Накладная");
		
		//нСтрока = ТаблицаВыбранныхСтрок.Добавить();
		//ЗаполнитьЗначенияСвойств(нСтрока, СтруктураДанныхСтроки);
		МассивСтруктур.Добавить(СтруктураДанныхСтроки);
		мСписокВагонов.Добавить(СтруктураДанныхСтроки.НомерВагона);

		
	КонецЦикла;
	
	Если МассивСтруктур.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки для создания заявки");
		Возврат;
	КонецЕсли;
	
	//МассивСгруппированныхОтправок = ПолучитьСгруппированныеОтправки(МассивСтруктур);
	ОпОп = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыПодбораРейса",ЭтаФорма,Новый Структура("Фактическая, ИмяТЧ", Фактическая, ИмяТЧ));
	ПараметрыОткрытия = Новый Структура("МассивСтруктур", МассивСтруктур);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораРейсов", ПараметрыОткрытия, ЭтаФорма,,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция ПолучитьСгруппированныеОтправки(МассивСтруктур)
	
	ТЗГруппОтправок = ВагоныВПовагонке.Выгрузить(Новый Структура("Пометка", Истина),"СтанцияПодачи, СтанцияНазначения, ДатаОтправления");
	ТЗГруппОтправок.Свернуть("СтанцияПодачи, СтанцияНазначения, ДатаОтправления");
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗГруппОтправок);
	
КонецФункции

Процедура ОбработкаЗакрытияФормыПодбораРейса(Параметр1, Параметр2) Экспорт
	Если Параметр1 = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	МассивСтруктур = Параметр1;
	ИмяТЧ = Параметр2.ИмяТЧ;
	
	Для Каждого Эл Из МассивСтруктур Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерВагона",Эл.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаПомещенияВРежимПовагонки",Эл.ДатаПомещенияВРежимПовагонки);
		НайдСтр = ЭтаФорма[ИмяТч].НайтиСтроки(ПараметрыОтбора);
		Если НайдСтр.Количество()>0 Тогда
			НайдСтр[0].УшедшийРейс = Истина;
			НайдСтр[0].ДатаОтправления = Эл.ДатаОтправления;
			НайдСтр[0].СтанцияОтправления = Эл.СтанцияОтправления;
			НайдСтр[0].СтанцияНазначения = Эл.СтанцияНазначения;
			НайдСтр[0].ДатаПрибытияНаСтанциюНазначения = Эл.ДатаПрибытияНаСтанциюНазначения;
		КонецЕсли;
		СохранитьДанныеВРСПовагонки(НайдСтр[0],Ложь, Ложь, Ложь, Неопределено);
	КонецЦикла;
		
	МассивЗаявок = СоздатьЗаявкуНаСервере(МассивСтруктур, Параметр2.Фактическая);
	Для Каждого Эл Из МассивЗаявок Цикл
		Сообщить(Строка(Эл.Заявка) + " успешно создана!");
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерВагона",Эл.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаПомещенияВРежимПовагонки",Эл.ДатаПомещенияВРежимПовагонки);
		НайдСтр = ЭтаФорма[ИмяТч].НайтиСтроки(ПараметрыОтбора);
		Если НайдСтр.Количество()>0 Тогда
			НайдСтр[0].Заявка = Эл.Заявка;
			НайдСтр[0].ЗаявкаНеПодходит = Ложь;
			НайдСтр[0].ДатаОтправления = ПолучитьРеквизитСсылкиНаСервере(Эл.Заявка,"Отправка").Отправка;
		КонецЕсли;
		СохранитьДанныеВРСПовагонки(НайдСтр[0],Ложь, Ложь, Ложь, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаПодсыл(Команда)
	//ПараметрыОтбора = Новый Структура("СписокВагонов,СтанцияНазначения,ДатаОтправления,РейсЖД",ВагоныВПовагонке,Дислокация,ДатаОтправки,Отправка);
	ПараметрыОтбора = Новый Структура("СписокВагонов,Повагонка",ВагоныВПовагонке,Истина);
	ОткрытьФорму("Документ.Операция.Форма.ФормаЕдиничнойОтправки",ПараметрыОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВыводВагоновВПовагонку(Команда)
	ВыделенныеВагоны = Элементы.СписокВагонов.ВыделенныеСтроки;
	ИнформированиеПланеров = Новый Массив;
	ЗапрошенныеВагоны = Новый Массив;
	Для каждого ВыделенныйВагон Из ВыделенныеВагоны Цикл
		СтруктураВагон = Новый Структура("НомерВагона");
		НомерВагона = ПолучитьРеквизит(Элементы.СписокВагонов.ДанныеСтроки(ВыделенныйВагон).Вагон,"Наименование");
		СтруктураВагон.НомерВагона = НомерВагона;
		ИнформированиеПланеров.Добавить(СтруктураВагон);
		ЗапрошенныеВагоны.Добавить(Элементы.СписокВагонов.ДанныеСтроки(ВыделенныйВагон).Вагон);
	КонецЦикла;
	ЗаписатьВРегистрЗапросНаПовагонкуНаСервере(ЗапрошенныеВагоны);
	// создать оповещение для планеров
	ОповещениеПользователей(ИнформированиеПланеров,"ЗапросВагоновВПовагонку");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизит(Ссылка, Реквизит)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьВРегистрЗапросНаПовагонкуНаСервере(МассивВагонов)
	
	Для каждого Вагон Из МассивВагонов Цикл
		мз = РегистрыСведений.ВагоныЗапрошенныеВПовагонку.СоздатьМенеджерЗаписи();
		мз.Вагон = Вагон;
		мз.ТребуетсяВыводВПовагонку = Истина;
		мз.Записать(Истина);
	КонецЦикла; 

КонецПроцедуры 

&НаКлиенте
Процедура ВагоныВПовагонкеТребуетсяПередислокацияПриИзменении(Элемент)
	текДанные = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	ЕстьОшибки = Ложь;
	СоздатьОповещениеПланеруОНеобходимостиПередислокации(текДанные, ЕстьОшибки);
	Если ЕстьОшибки Тогда
		ТекДанные.ТребуетсяПередислокация = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещениеПланеруОНеобходимостиПередислокации(Данные, ЕстьОшибки)
	Если Данные.ТребуетсяПередислокация и Данные.СогласованоМенеджером Тогда
		Если Не ЗначениеЗаполнено(Данные.СтанцияПодачи) Тогда
			Сообщить("Не заполнена станция подачи");
			ЕстьОшибки = Истина;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Данные.НомерГУ) Тогда
			Сообщить("Не заполнен номер ГУ");
			ЕстьОшибки = Истина;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Данные.ДатаПлановогоОтправленияСоСтанцииПодачи) Тогда
			Сообщить("Не заполнена дата планового отправления со станции подачи");
			ЕстьОшибки = Истина;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Данные.Грузоотправитель) Тогда
			Сообщить("Не заполнен грузоотправитель");
			ЕстьОшибки = Истина;
		КонецЕсли; 
		Если ЕстьОшибки Тогда
			Возврат;
		КонецЕсли; 
		ИнформированиеПланеров = Новый Массив;
		СтруктураВагон = Новый Структура("НомерВагона, СтанцияПодачи, ДатаПлановогоОтправленияСоСтанцииПодачи");
		ЗаполнитьЗначенияСвойств(СтруктураВагон, Данные);
		ИнформированиеПланеров.Добавить(СтруктураВагон);	
		ОповещениеПользователей(ИнформированиеПланеров, "НеобходимаПередислокация");
		Сообщить("Оповещение планеров выполнено");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеСогласованоМенеджеромПриИзменении(Элемент)
	текДанные = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	ЕстьОшибки = Ложь;
	СоздатьОповещениеПланеруОНеобходимостиПередислокации(текДанные, ЕстьОшибки);
	Если ЕстьОшибки Тогда
		ТекДанные.СогласованоМенеджером = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УдалитьИзПодходаНаСервере()
	ВыделенныеВагоны = ПодходВагонов.НайтиСтроки(Новый Структура("Отметка", Истина));
	Для каждого ВыделенныйВагон Из ВыделенныеВагоны Цикл
		мз = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
		мз.Вагон = ВыделенныйВагон.НомерВагона;
		мз.Прочитать();
		Если мз.Выбран() Тогда
			мз.Удалить();
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзПодхода(Команда)
	УдалитьИзПодходаНаСервере();
	ОбновитьВагоныВПодходе();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьExcel(Команда)
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхПозиций(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВагонов, "Вагон", Параметр1, ВидСравненияКомпоновкиДанных.ВСписке,"",Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,Новый УникальныйИдентификатор());
	
КонецПроцедуры


&НаСервере
Процедура УдалитьВышедшиеНаСервере()
	ВыделенныеВагоны = ВагоныВыведены.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого ВыделенныйВагон Из ВыделенныеВагоны Цикл
		мз = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		мз.Период = ВыделенныйВагон.ДатаПомещенияВРежимПовагонки;
		мз.Вагон = ВыделенныйВагон.НомерВагона;
		мз.Прочитать();
		Если мз.Выбран() Тогда
			мз.Удалить();
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВышедшие(Команда)
	УдалитьВышедшиеНаСервере();
	ОбновитьВагоныВышедшиеИзПовагонки();
КонецПроцедуры


&НаКлиенте
Процедура ВагоныВПовагонкеСделкаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	текД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если текД.Сделка.Количество() = 1 Тогда
		ПоказатьЗначение(,ТекД.Сделка[0].Значение); 
	КонецЕсли; 
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОчиститьСделкиСлужебнаяНаСервере(мСделки)
	Для каждого Сделка Из мСделки Цикл
		обСделка = Сделка.ПолучитьОбъект();
		обСделка.СвязьУчетныхЕдиниц.Очистить();
		обСделка.Доходы.Очистить();
		обСделка.Расходы.Очистить();
		обСделка.СвязьДоходовИРасходов.Очистить();
		обСделка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьСделкиСлужебная(Команда)
	ВыделенныеСтроки = ВагоныВПовагонке.НайтиСтроки(Новый Структура("Пометка", Истина));
	мСделки = Новый Массив;
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Для каждого Сделка Из ВыделеннаяСтрока.Сделка Цикл
			мСделки.Добавить(Сделка.Значение);
		КонецЦикла; 
	КонецЦикла; 
	ОчиститьСделкиСлужебнаяНаСервере(мСделки);
КонецПроцедуры


&НаКлиенте
Процедура ВагоныВПовагонкеГрузоотправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораГрузоотправителяИРС", ЭтаФорма);
	ОткрытьФорму("ВнешнийИсточникДанных.ИРС.Таблица.ирс_Ссылки.Форма.ФормаСпискаГрузоотправителейГрузополучателей", Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГрузоотправителяИРС(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	текД = Элементы.ВагоныВПовагонке.ТекущиеДанные;
	Если ВыбранноеЗначение <> Неопределено Тогда
		текД.Грузоотправитель = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВагоныВПовагонке();
	ОбновитьВагоныВышедшиеИзПовагонки();
	ОбновитьВагоныВПодходе();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтметкиКлиентов(СписокКлиентов, ДополнительныеПараметры) Экспорт
	
	Если СписокКлиентов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Клиенты = СписокКлиентов;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокКлиентов = Клиенты.Скопировать();
	
	ОповещениеОбУстановкеОтметок = Новый ОписаниеОповещения("ОбработкаОтметкиКлиентов", ЭтаФорма);
	СписокКлиентов.ПоказатьОтметкуЭлементов(ОповещениеОбУстановкеОтметок);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСписокКлиентовИзПовагонки(Команда)
	
	КлиентыПовагонныхОтправок = ПолучитьКлиентовПовагонныхОтправок(ЦФО);
	Для Каждого Клиент Из КлиентыПовагонныхОтправок Цикл
		Если Клиенты.НайтиПоЗначению(Клиент) = Неопределено Тогда
			Клиенты.Добавить(Клиент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиентовПовагонныхОтправок(ЦФО = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПовагонныеОтправки.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	|ГДЕ
	|	ПовагонныеОтправки.ЦФО = &ЦФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПовагонныеОтправки.Клиент.Наименование";
	
	Если Не ЗначениеЗаполнено(ЦФО) Тогда
		ТекстУсловаия = "
		|ГДЕ
		|	ПовагонныеОтправки.ЦФО = &ЦФО";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстУсловаия, "");
	Иначе
		Запрос.УстановитьПараметр("ЦФО", ЦФО);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТч = "ВагоныВПовагонке";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ИмяТЧ = "ВагоныВыведены";
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ЭтаФорма[ИмяТч] Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТч = "ВагоныВПовагонке";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ИмяТЧ = "ВагоныВыведены";
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ЭтаФорма[ИмяТч] Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыбранныеСтроки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВагоныВПовагонке" Тогда
		ИмяТч = "ВагоныВПовагонке";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВыведеныИзПовагонки" Тогда
		ИмяТЧ = "ВагоныВыведены";
	Иначе
		Возврат;
	КонецЕсли;
	
	Для каждого Стр из Элементы[ИмяТч].ВыделенныеСтроки Цикл
		ЭтаФорма[ИмяТч].НайтиПоИдентификатору(Стр).Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПоПервойСтроке(Команда)
	
	ЗаполнятьПоПервойСтроке = Не ЗаполнятьПоПервойСтроке;
	Элементы.ВагоныВПовагонкеЗаполнятьПоПервойСтроке.Пометка = ЗаполнятьПоПервойСтроке;
	Элементы.ВагоныВыведеныЗаполнятьПоПервойСтроке.Пометка = ЗаполнятьПоПервойСтроке;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВПовагонкеПриИзменении(Элемент)
	
	Если ЗаполнятьПоПервойСтроке Тогда
		
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		//Если СтрНайти("СтанцияПодачи, ПСЦ, Калькуляция", ИмяПоля) > 0 Тогда
		//Костюков(
		Если СтрНайти("СтанцияПодачи, ПСЦ, Калькуляция, СтанцияОтправления, СтанцияНазначения, Заявка, НДС", ИмяПоля) > 0 Тогда			
		//Костюков)	
			
			//Строка должна быть первая среди строк с пометкой
			СтрокиСПометкой = ВагоныВПовагонке.НайтиСтроки(Новый Структура("Пометка", Истина));
			Если СтрокиСПометкой.Количество() > 1 Тогда
				
				ТекДанные = Элементы.ВагоныВПовагонке.ТекущиеДанные;
				ПерваяСтрока = СтрокиСПометкой[0];
				
				СтруктураДанныхСтроки = Новый Структура;
				Для Каждого ЭлемСп Из СписокКолонокВагоныВПовагонке Цикл
					СтруктураДанныхСтроки.Вставить(ЭлемСп.Значение);
				КонецЦикла;
						
				Если ТекДанные = ПерваяСтрока Тогда
					НовоеЗначение = ПерваяСтрока[ИмяПоля];
					Для Каждого СтрокаСПометкой Из СтрокиСПометкой Цикл
						Если СтрокаСПометкой = ПерваяСтрока Тогда
							Продолжить;
						КонецЕсли;
						СтрокаСПометкой[ИмяПоля] = НовоеЗначение;
						
						ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, СтрокаСПометкой);
						
						ЗаявкаИзменилась = Ложь;
						СохранитьДанныеВРСПовагонки(СтруктураДанныхСтроки,Ложь,ЗаявкаИзменилась,Ложь,Неопределено);
						
						ЗаполнитьЗначенияСвойств(СтрокаСПометкой, СтруктураДанныхСтроки);
	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСделку(Команда)
	
	ОповещениеОВыбореСделки = Новый ОписаниеОповещения("ОбработкаВыбораСделки", ЭтаФорма);
	ЗначениеОтбора = Новый Структура("ПовагонныеОтправки", Истина);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.Сделка.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОВыбореСделки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСделки(Сделка, ДополнительныеПараметры) Экспорт
	
	Если Сделка <> Неопределено Тогда
		СоздатьСделкиПоВагонам(, Сделка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуВагоновИзРеестровВСКНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсыЖД.Ссылка КАК Рейс,
	|	СделкаРейсы.Ссылка КАК Сделка,
	|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
	|	РейсыЖД.ПунктНазначения КАК ПунктНазначения,
	|	РейсыЖД.ДатаОтправления КАК ДатаОтправления
	|ПОМЕСТИТЬ РейсыСделки
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
	|		ПО РейсыЖД.Ссылка = СделкаРейсы.Рейс
	|ГДЕ
	|	РейсыЖД.ДатаОтправления МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ РейсыЖД.ПометкаУдаления
	|	И СделкаРейсы.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РейсыСделки.Рейс КАК Рейс,
	|	РейсыСделки.Сделка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК Накладная,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаДоходы.ГУИД КАК ИдентификаторСтрокиДоходовСделки,
	|	РейсыСделки.ПунктОтправления КАК ПунктОтправления,
	|	РейсыСделки.ПунктНазначения КАК ПунктНазначения,
	|	РейсыСделки.ДатаОтправления КАК ДатаОтправления
	|ПОМЕСТИТЬ СтрокиСделок
	|ИЗ
	|	РейсыСделки КАК РейсыСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|				ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|					И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|			ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|				И СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|		ПО РейсыСделки.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Клиент = &Клиент
	|	И СделкаСвязьУчетныхЕдиниц.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДислокацияВагонов.Вагон КАК Вагон,
	|	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления,
	|	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
	|	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации
	|ПОМЕСТИТЬ ДислокацияВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
	|		ДислокацияВагонов.Вагон КАК Вагон
	|	ИЗ
	|		РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	|	ГДЕ
	|		ДислокацияВагонов.Вагон В
	|				(ВЫБРАТЬ
	|					СтрокиСделок.Вагон КАК Вагон
	|				ИЗ
	|					СтрокиСделок КАК СтрокиСделок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДислокацияВагонов.Вагон) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	|		ПО ВложенныйЗапрос.Вагон = ДислокацияВагонов.Вагон
	|			И ВложенныйЗапрос.Период = ДислокацияВагонов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСделок.Рейс КАК Рейс,
	|	СтрокиСделок.Сделка КАК Сделка,
	|	СтрокиСделок.Контейнер КАК Контейнер,
	|	СтрокиСделок.Накладная КАК Накладная,
	|	СтрокиСделок.Вагон КАК Вагон,
	|	СтрокиСделок.Калькуляция КАК Калькуляция,
	|	СтрокиСделок.Протокол КАК Протокол,
	|	СтрокиСделок.Заявка КАК Заявка,
	|	СтрокиСделок.ИдентификаторСтрокиДоходовСделки КАК ИдентификаторСтрокиДоходовСделки,
	|	СтрокиСделок.ПунктОтправления КАК ПунктОтправления,
	|	СтрокиСделок.ПунктНазначения КАК ПунктНазначения,
	|	СтрокиСделок.ДатаОтправления КАК ДатаОтправления,
	|	ДислокацияВагонов.СтанцияОтправления КАК ТекДислСтанцияОтправления,
	|	ДислокацияВагонов.СтанцияНазначения КАК ТекДислСтанцияНазначения,
	|	ДислокацияВагонов.СтанцияОперации КАК ТекДислСтанцияОперации
	|ИЗ
	|	СтрокиСделок КАК СтрокиСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияВагонов КАК ДислокацияВагонов
	|		ПО СтрокиСделок.Вагон = ДислокацияВагонов.Вагон
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПунктОтправления,
	|	ПунктНазначения,
	|	ДатаОтправления";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодРеестраПоКонтрагенту.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодРеестраПоКонтрагенту.ДатаОкончания);
	Запрос.УстановитьПараметр("Клиент", КонтрагентРеестра);
	Запрос.УстановитьПараметр("Договор", ДоговорРеестра);
	
	РеестрПоКонтрагенту.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Обработки.ЗагрузкаРеестраВСК.НайтиРеестры(РеестрПоКонтрагенту, КонтрагентРеестра, ДоговорРеестра, ПериодРеестраПоКонтрагенту);
	Обработки.ЗагрузкаРеестраВСК.НайтиУчетныеДокументы(РеестрПоКонтрагенту);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуВагоновИзРеестровПоКонтрагенту(Команда)
	ОбновитьТаблицуВагоновИзРеестровВСКНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомплектДокументовПоКонтрагенту(Команда)
	
	ПараметрыФормы = ПодготовитьПараметрыФормыСозданияКомплектаДокументов();
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФорму("Документ.Сделка.Форма.ФормаСозданияКомплектаДокументов", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыФормыСозданияКомплектаДокументов()
	
	ТаблицаРеестра = РеестрПоКонтрагенту.Выгрузить(Новый Структура("Выбрать", Истина));	
	Возврат Обработки.ЗагрузкаРеестраВСК.ПодготовитьПараметрыФормыСозданияКомплектаДокументов(ТаблицаРеестра);
	
КонецФункции

&НаКлиенте
Процедура ВыбратьСтрокиПоНаправлению(Команда)
	
	АдресТаблицыНаправлений = ПолучитьАдресТаблицыНаправлений();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресТаблицыНаправлений", АдресТаблицыНаправлений);
	
	ОповещениеОВыбореНаправления = Новый ОписаниеОповещения("ОбработатьВыборНаправления", ЭтаФорма);
	ОткрытьФорму("Обработка.ЗагрузкаРеестраВСК.Форма.ФормаВыбораНаправления", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыбореНаправления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборНаправления(Направление, ДополнительныеПараметры) Экспорт
	
	Если Направление <> Неопределено Тогда
		
		ВыбранныеСтроки = РеестрПоКонтрагенту.НайтиСтроки(Новый Структура("Выбрать", Истина));
		Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
			ВыбраннаяСтрока.Выбрать = Ложь;
		КонецЦикла;
		
		СтрокиПоНаправлению = РеестрПоКонтрагенту.НайтиСтроки(Новый Структура("ПунктОтправления, ПунктНазначения", Направление.ПунктОтправления, Направление.ПунктНазначения));
		Для Каждого СтрокаПоНаправлению Из СтрокиПоНаправлению Цикл
			Если ЗначениеЗаполнено(СтрокаПоНаправлению.Вагон)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Контейнер)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Накладная)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.ПунктОтправления)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.ПунктНазначения)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Калькуляция)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Протокол)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Заявка)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.Сделка)
				И ЗначениеЗаполнено(СтрокаПоНаправлению.ИдентификаторСтрокиДоходовСделки) 
				И Не ЗначениеЗаполнено(СтрокаПоНаправлению.РТУ) Тогда
				СтрокаПоНаправлению.Выбрать = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыНаправлений()
	
	Возврат Обработки.ЗагрузкаРеестраВСК.ПолучитьАдресТаблицыНаправлений(РеестрПоКонтрагенту, УникальныйИдентификатор);
	
КонецФункции

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//&НаСервереБезКонтекста  //Евросиб СубботинВ #84453 02.07.2024 Начало // переделал на вызов аналогичной процедуры из общего модуля РаботаСПовагоннымиОтправками.НайтиРеализацию(Стр.Сделка, Стр.ГУИД)
//Функция НайтиРеализацию(ОбъектСсылка, СтрГУИД)
//	
//	Результат = неопределено;
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
//	Запрос.УстановитьПараметр("СтрокаДоходовСделки", СтрГУИД);
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
//	               |ГДЕ
//	               |	РеализацияТоваровУслугУслуги.Ссылка.Сделка = &Ссылка
//	               |	И РеализацияТоваровУслугУслуги.СтрокаДоходовСделки = &СтрокаДоходовСделки
//	               |	И НЕ РеализацияТоваровУслугУслуги.Ссылка.ПометкаУдаления
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата УБЫВ";
//	Ответ = запрос.Выполнить().Выбрать();
//	Если ответ.Следующий() Тогда
//		Результат = ответ.Ссылка;
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции
//Евросиб СубботинВ #84453 02.07.2024 Конец
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
