Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КредитнаяЗаявка";
	КомандаПечати.Представление = "Кредитная заявка";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КредитнаяЗаявка") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КредитнаяЗаявка", "Кредитная заявка", НапечататьКредитнуюЗаявку_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документ.КредитнаяЗаявка.ПФ_MXL_КредитнаяЗаявка");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НапечататьКредитнуюЗаявку_ПоПростомуБезЭтихВашихБСП(МассивОбъектов) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КредитнаяЗаявка.ПФ_MXL_КредитнаяЗаявка");
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		/////////////////
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерЗаявки = Док.Номер;
		ОбластьШапка.Параметры.ДатаЗаявки = Док.Дата;
		ОбластьШапка.Параметры.ДатаНачала = Док.ДатаНачала;
		ОбластьШапка.Параметры.ДатаОкончания = Док.ДатаОкончания;
		ОбластьШапка.Параметры.НаименованиеКонтрагента = Док.Контрагент.Наименование;
		ОбластьШапка.Параметры.ИННКонтрагента = Док.Контрагент.ИНН;
		ОбластьШапка.Параметры.НомерДоговора = Док.ДоговорКонтрагента.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Док.ДоговорКонтрагента.Дата;
		ОбластьШапка.Параметры.УслугаПоДоговору = Док.КатегорияДоговора;
		ОбластьШапка.Параметры.Валюта = Док.ВалютаДоговора;
		ОбластьШапка.Параметры.ЭДО = Док.ЭДО;
		ОбластьШапка.Параметры.Сводный  = Док.СводныйИндекс;
		ОбластьШапка.Параметры.ИДО = Док.ИндексИДО;
		ОбластьШапка.Параметры.ИФР = Док.ИндексИФР;
		ОбластьШапка.Параметры.ИПД = Док.ИндексИПД;
		
		Результат.Вывести(ОбластьШапка);
		/////////////////
		ОбластьЗаголовокТаблицы  = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьЗаголовокТаблицы.Параметры.валюта = Док.ВалютаДоговора;
		
		Результат.Вывести(ОбластьЗаголовокТаблицы);
		////////////////
		
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Для каждого Стр из Док.ДанныеЗаПериод Цикл
			ОбластьСтрока.Параметры.Месяц = Стр.Месяц;
			ОбластьСтрока.Параметры.ДнейПросрочки = Стр.СреднееКоличествоДнейПросрочки;
			ОбластьСтрока.Параметры.СуммаПросрочки = Стр.МаксимальнаяПЗД;
			ОбластьСтрока.Параметры.Выручка = Стр.Выручка;
			ОбластьСтрока.Параметры.Контрибуция = Стр.Контрибуция;
			ОбластьСтрока.Параметры.КолВагонов = Стр.КоличествоВагонов;
			Результат.Вывести(ОбластьСтрока);
		КонецЦикла;
		///////////////
		
		ОбластьИтогиТаб = Макет.ПолучитьОбласть("ИтогоТаблицы");
		ОбластьИтогиТаб.Параметры.ИтогоВыручка = Док.ДанныеЗаПериод.Итог("Выручка");
		ОбластьИтогиТаб.Параметры.ИтогоКонтрибуция = Док.ДанныеЗаПериод.Итог("Контрибуция");
		
		Результат.Вывести(ОбластьИтогиТаб);
		
		//////////////
		
		ОбластьИтоги = Макет.ПолучитьОбласть("ИтоговыеПоказатели");
		ОбластьИтоги.Параметры.КатегорияТекущая = Док.КатегорияПоКомпании;
		ОбластьИтоги.Параметры.КатегорияПланируемая = Док.КатегорияПланируемая;
		ОбластьИтоги.Параметры.ОтсрочкаТекущая = Док.ОтсрочкаПоДоговору_План;
		ОбластьИтоги.Параметры.СредняяПросрочка = Окр(Док.ДанныеЗаПериод.Итог("СреднееКоличествоДнейПросрочки")/6,0);
		ОбластьИтоги.Параметры.СредВыручкаТекущая = Док.СреднемесячнаяВыручка;
		ОбластьИтоги.Параметры.СредВыручкаПланируемая = Док.СреднемесячнаяВыручкаПланируемая;
		ОбластьИтоги.Параметры.МаксПДЗ = Док.МаксимальнаяПДЗ;
		ОбластьИтоги.Параметры.ПеняТекущая = Док.ПениПоДоговору;
		ОбластьИтоги.Параметры.ПеняПланируемая = Док.ПениПланируемые;
		
		Результат.Вывести(ОбластьИтоги);
		///////////////
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
		ОбластьПодвал.Параметры.ОтсрочкаПланируемая = Док.ОтсрочкаПоДоговору_План;
		ОбластьПодвал.Параметры.ЛимитФакт = Док.ЛимитДЗ_План;
		ОбластьПодвал.Параметры.валюта = Док.ВалютаДоговора;
		ОбластьПодвал.Параметры.Аргументы = Док.АргументыИзмененияОтсрочки;
		ОбластьПодвал.Параметры.Санкции = Док.Санкции;
		ОбластьПодвал.Параметры.Примечание = Док.Примечание;
		
		Результат.Вывести(ОбластьПодвал);
		
	    //////////////
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ОбластьПодписи.Параметры.РуководительЦФУ = Док.РуководительЦФО; 
		ОбластьПодписи.Параметры.МенеджерПоДоговору = Док.МенеджерПоДоговору;
		Результат.Вывести(ОбластьПодписи);
		
	КонецЦикла;
	Возврат Результат;
КонецФункции