
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	Подразделение = Автор.Подразделение;
	ЦФО = Автор.ЦФО;
	Маршрутизировать = Константы.МаршрутизироватьКредитнуюЗаявку.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		// Заполнение шапки
		ВалютаДоговора = ДанныеЗаполнения.ВалютаВзаиморасчетов;
		Контрагент = ДанныеЗаполнения.Владелец;
		КатегорияДоговора = ДанныеЗаполнения.КатегорияДоговора;
		ЭДО = ?(ДанныеЗаполнения.КодСпособаВыставления = 1,Ложь,Истина);
		Организация = ДанныеЗаполнения.Организация;
		МенеджерПоДоговору = ДанныеЗаполнения.ОтветственныйЗаДоговор.ФизическоеЛицо;
		ОтсрочкаПоДоговору_План = ДанныеЗаполнения.СрокОплаты;
		ДоговорКонтрагента = ДанныеЗаполнения.Ссылка;
		ПениПоДоговору = ДанныеЗаполнения.Пени;
		ПениПланируемые = ПениПоДоговору;
		Дата = ТекущаяДата();
		ДатаНачала = ТекущаяДата();
		ИндексыСпарк = ПолучитьСПАРКИндексы();
		Если ИндексыСпарк <> Неопределено Тогда
			СводныйИндекс = ИндексыСпарк.Сводный;
			ИндексИДО 	  = ИндексыСпарк.ИДО;
			ИндексИФР     = ИндексыСпарк.ИФР;
		    ИндексИПД     = ИндексыСпарк.ИПД;
		КонецЕсли;
		ЗаполнитьПоДаннымИзБазы();
		ИтогоСредняяПДЗ = ДанныеЗаПериод.Итог("МаксимальнаяПЗД")/6;
		ВспомТЧ = ДанныеЗаПериод.Выгрузить(,"МаксимальнаяПЗД");
		ВспомТЧ.Сортировать("МаксимальнаяПЗД Убыв");
		МаксимальнаяПДЗ = ВспомТЧ[0].МаксимальнаяПЗД;
		СреднемесячнаяВыручка = ДанныеЗаПериод.Итог("Выручка")/6;
		СреднемесячнаяВыручкаПланируемая = СреднемесячнаяВыручка;
		ЛимитДЗ_План = СреднемесячнаяВыручкаПланируемая * ОтсрочкаПоДоговору_План/30;
		ЛимитДЗ_Факт = ЛимитДЗ_План;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСПАРКИндексы()
	СтруктураРезультата = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СПАРКИндексыРисковСрезПоследних.СводныйИндикаторРиска КАК СводныйИндикаторРиска,
	               |	СПАРКИндексыРисковСрезПоследних.ИндексДолжнойОсмотрительности КАК ИндексДолжнойОсмотрительности,
	               |	СПАРКИндексыРисковСрезПоследних.ИндексФинансовогоРиска КАК ИндексФинансовогоРиска,
	               |	СПАРКИндексыРисковСрезПоследних.ИндексПлатежнойДисциплины КАК ИндексПлатежнойДисциплины
	               |ИЗ
	               |	РегистрСведений.СПАРКИндексыРисков.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СПАРКИндексыРисковСрезПоследних";
	Запрос.УстановитьПараметр("Период",Дата);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СтруктураРезультата.Вставить("Сводный",Результат.СводныйИндикаторРиска);
		СтруктураРезультата.Вставить("ИДО",Результат.ИндексДолжнойОсмотрительности);
		СтруктураРезультата.Вставить("ИФР",Результат.ИндексФинансовогоРиска);
		СтруктураРезультата.Вставить("ИПД",Результат.ИндексПлатежнойДисциплины);
		Возврат СтруктураРезультата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьПоДаннымИзБазы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Дата), -6));
	Запрос.УстановитьПараметр("КонецПериода",НачалоМесяца(Дата)-84600);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Организация",Организация);

	Запрос.Текст = "ВЫБРАТЬ
	                      |	ВзаиморасчетыСПокупателямиОбороты.Период КАК Период,
	                      |	ВзаиморасчетыСПокупателямиОбороты.СуммаСНДСРасход КАК Выручка
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчетыСПокупателями.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ВзаиморасчетыСПокупателямиОбороты
	                      |ГДЕ
	                      |	ВзаиморасчетыСПокупателямиОбороты.Контрагент = &Контрагент
	                      |	И ВзаиморасчетыСПокупателямиОбороты.Договор = &Договор
	                      |	И ВзаиморасчетыСПокупателямиОбороты.Организация = &Организация
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период
	                      |ИТОГИ
	                      |	СУММА(Выручка)
	                      |ПО
	                      |	Период ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)";
	ВыручкаПоПериоду = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","ВСЕ");
	Пока ВыручкаПоПериоду.Следующий() Цикл
		НовСтр = ДанныеЗаПериод.Добавить();
		НовСтр.Месяц = ВыручкаПоПериоду.Период;
		НовСтр.Выручка = ВыручкаПоПериоду.Выручка;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю КАК СчетПокупателю,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Контрагент КАК Контрагент,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Договор КАК Договор,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю.Дата КАК ДатаСчета
	               |ПОМЕСТИТЬ ОплаченныеСчетаЗАПериод
	               |ИЗ
	               |	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты
	               |ГДЕ
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.НеразнесеннаяСуммаПриход - РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.НеразнесеннаяСуммаРасход = 0
	               |	И РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.СчетПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Контрагент = &Контрагент
	               |	И РазнесениеСчетовПокупателейПоВходящимПлатежамОбороты.Договор = &Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОплаченныеСчетаЗАПериод.ДатаСчета КАК ДатаСчета,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ОплаченныеСчетаЗАПериод.ДатаСчета, РазнесениеСчетовПокупателейПоВходящимПлатежам.Период, ДЕНЬ) - ОплаченныеСчетаЗАПериод.Договор.СрокОплаты < 0
	               |				ТОГДА 0
	               |			ИНАЧЕ РАЗНОСТЬДАТ(ОплаченныеСчетаЗАПериод.ДатаСчета, РазнесениеСчетовПокупателейПоВходящимПлатежам.Период, ДЕНЬ) - ОплаченныеСчетаЗАПериод.Договор.СрокОплаты
	               |		КОНЕЦ, 0) КАК ДнейПросрочки,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежам.ВидДвижения КАК ВидДвижения,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежам.Контрагент КАК Контрагент,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежам.Договор КАК Договор,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежам.СчетПокупателю КАК СчетПокупателю,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА ВЫБОР
	               |					КОГДА РАЗНОСТЬДАТ(ОплаченныеСчетаЗАПериод.ДатаСчета, РазнесениеСчетовПокупателейПоВходящимПлатежам.Период, ДЕНЬ) - ОплаченныеСчетаЗАПериод.Договор.СрокОплаты < 0
	               |						ТОГДА 0
	               |					ИНАЧЕ РАЗНОСТЬДАТ(ОплаченныеСчетаЗАПериод.ДатаСчета, РазнесениеСчетовПокупателейПоВходящимПлатежам.Период, ДЕНЬ) - ОплаченныеСчетаЗАПериод.Договор.СрокОплаты
	               |				КОНЕЦ > 0
	               |				ТОГДА РазнесениеСчетовПокупателейПоВходящимПлатежам.НеразнесеннаяСумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ, 0) КАК СуммаПДЗ
	               |ИЗ
	               |	ОплаченныеСчетаЗАПериод КАК ОплаченныеСчетаЗАПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам КАК РазнесениеСчетовПокупателейПоВходящимПлатежам
	               |		ПО ОплаченныеСчетаЗАПериод.СчетПокупателю = РазнесениеСчетовПокупателейПоВходящимПлатежам.СчетПокупателю
	               |ГДЕ
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСчета
	               |ИТОГИ
	               |	СУММА(ДнейПросрочки) / КОЛИЧЕСТВО(ДнейПросрочки) КАК ДнейПросрочки,
	               |	СУММА(СуммаПДЗ)
	               |ПО
	               |	ДатаСчета ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)";
	ПДЗ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДатаСчета","ВСЕ");
	Пока ПДЗ.Следующий() Цикл
		Стр = ДанныеЗаПериод.Найти(НачалоМесяца(ПДЗ.ДатаСчета),"Месяц");
		Если Стр <> Неопределено Тогда
			Стр.СреднееКоличествоДнейПросрочки = Стр.СреднееКоличествоДнейПросрочки + ?(ПДЗ.ДнейПросрочки = null, 0,ПДЗ.ДнейПросрочки);
			Стр.МаксимальнаяПЗД = Стр.МаксимальнаяПЗД + ?(ПДЗ.СуммаПДЗ= null, 0,ПДЗ.СуммаПДЗ);
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрибуцияСделокОбороты.Период КАК Период,
	               |	ЕСТЬNULL(КонтрибуцияСделокОбороты.СебестоимостьОборот, 0) КАК Себестоимость
	               |ИЗ
	               |	РегистрНакопления.КонтрибуцияСделок.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК КонтрибуцияСделокОбороты
	               |ГДЕ
	               |	КонтрибуцияСделокОбороты.Сделка.Доходы.Клиент = &Контрагент
	               |	И КонтрибуцияСделокОбороты.Сделка.Доходы.Договор = &Договор
	               |	И КонтрибуцияСделокОбороты.Сделка.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |ИТОГИ
	               |	СУММА(Себестоимость)
	               |ПО
	               |	Период ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)";
	 Себестоимость = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","ВСЕ");
	 Пока Себестоимость.Следующий() Цикл
		Стр = ДанныеЗаПериод.Найти(НачалоМесяца(Себестоимость.Период),"Месяц");
		Если Стр <> Неопределено Тогда
			Стр.СебистоимостьИВР = Стр.СебистоимостьИВР + ?(Себестоимость.Себестоимость= null, 0,Себестоимость.Себестоимость);
			Стр.Контрибуция = Стр.Выручка - Стр.СебистоимостьИВР;
		КонецЕсли;

	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КатегорииКонтрагентовСрезПоследних.Категория КАК Категория
	               |ИЗ
	               |	РегистрСведений.КатегорииКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК КатегорииКонтрагентовСрезПоследних
	               |ГДЕ
	               |	КатегорииКонтрагентовСрезПоследних.ПлановаяФактическая = &Плановая";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Плановая", Перечисления.ПланФакт.Факт);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		КатегорияПоКомпании = Ответ.Категория;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(Ссылка) И не РольДоступна("ПолныеПрава") Тогда //Гудкова Тикет№ 0204697
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	КредитнаяЗаявкаСостояния.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.КредитнаяЗаявка.Состояния КАК КредитнаяЗаявкаСостояния
		               |ГДЕ
		               |	КредитнаяЗаявкаСостояния.Статус <> &Статус
		               |	И КредитнаяЗаявкаСостояния.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтапов.Выполнен);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("Ошибка. Документ полностью утвержден. Запись запрещена.");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();	
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	//++ Зубов 35844 04.08.2021
	//	//Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 04.08.2021
	
	// Маршрутизация заявки
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
		НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
		Ссылка.Организация <> Организация ИЛИ 
		Ссылка.Контрагент <> Контрагент ИЛИ
		Ссылка.ЦФО <> ЦФО ИЛИ
		Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ 
		Состояния.Количество() = 0 ИЛИ
		Ссылка.ЛимитДЗ_Факт <> ЛимитДЗ_Факт
	;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("ДоговорКонтрагента", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
		ПараметрыЗапроса.Вставить("ЛимитДЗ_Факт", ЛимитДЗ_Факт);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКредитнуюЗаявку(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// SIV #0204734 Синхронизация статуса документа со статусами ТЧ Согласование
	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	
	Для каждого Стр из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование Тогда Продолжить; КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний; //Гудкова
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
	КонецЦикла;
	
	Если СогласованиеНачато Тогда СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении; КонецЕсли;
	
	Если СогласованиеЗавершено И СогласованиеОтклонен Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено И СогласованиеОтклоненБезЗамечаний Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено И СогласованиеСогласованСЗамечаниями Тогда СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено Тогда СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний; КонецЕсли;
	
	
	// - SIV
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Константы.МаршрутизироватьКредитнуюЗаявку.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();

КонецПроцедуры
