
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Ссылка", ПараметрКоманды);
	Параметры.Вставить("ФормаОбъекта", ПараметрыВыполненияКоманды.Источник);
	
	ОповещениеОбОтветеПользователя = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект, Параметры);
	ПоказатьВопрос(ОповещениеОбОтветеПользователя, "Выполнить повторную маршрутизацию?", РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПользователя(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		МаршрутизацияКлиент.ВыполнитьПовторнуюМаршрутизациюОбъектаПоСсылке(ДополнительныеПараметры.Ссылка, ДополнительныеПараметры.ФормаОбъекта);
	КонецЕсли;
	
КонецПроцедуры
