&НаСервереБезКонтекста
Процедура ЗагрузитьИзЭтранНаСервере()
	э_ОбщиеСервер.ЗагрузитьВсеЗаписи("э_Станции");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭтран(Команда)
	ЗагрузитьИзЭтранНаСервере();
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

