
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Грузоотправитель = "Евросиб-Терминал-Новосибирск";
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РейсыЖД") Тогда
		// Заполнение шапки
		ДатаОтправления = ДанныеЗаполнения.ДатаОтправления;
		ПунктНазначения = ДанныеЗаполнения.ПунктНазначения;
		ПунктОтправления = ДанныеЗаполнения.ПунктОтправления;
		Отправка = ДанныеЗаполнения.Ссылка;
		НомерНедели = НеделяГода(ДанныеЗаполнения.ДатаОтправления);
		Организация = Константы.ОсновнаяОрганизация.Получить();
		ИсполнительПриказа = Организация.НаименованиеСокращенное;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВОтправке.Контейнер КАК Контейнер,
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецТЕ,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.СтокВыдачи.Наименование КАК СтокВыдачи
	               |ИЗ
	               |	РегистрСведений.КонтейнерыВОтправке КАК КонтейнерыВОтправке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних КАК ПризнакСобственностиКонтейнераСрезПоследних
	               |		ПО КонтейнерыВОтправке.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИспользованияКонтейнеров.СрезПоследних КАК СрокиИспользованияКонтейнеровСрезПоследних
	               |		ПО КонтейнерыВОтправке.Контейнер = СрокиИспользованияКонтейнеровСрезПоследних.Контейнер
	               |ГДЕ
	               |	КонтейнерыВОтправке.Отправка = &Отправка";
		Запрос.УстановитьПараметр("Отправка", Отправка);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			НСтр = СписокКТК.Добавить();
			НСтр.Контейнер = Ответ.Контейнер;
			НСтр.Собственник = Ответ.ВладелецТЕ;
			НСтр.Выдача = Ответ.СтокВыдачи;
		КонецЦикла;
		
		/////////////////////////////////
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВагоныВОтправке.Вагон КАК Вагон,
		               |	ВагоныВОтправке.Отправка КАК Отправка,
		               |	ВагоныВОтправке.Вагон.ВладелецТС КАК ВладелецТС,
		               |	ВагоныВОтправке.Вагон.ТипТС.Длина КАК Длина
		               |ИЗ
		               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
		               |ГДЕ
		               |	ВагоныВОтправке.Отправка = &Отправка";
		Запрос.УстановитьПараметр("Отправка", Отправка);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			
			НайдСтрока = неопределено;
			Для каждого Стр из СписокКТК Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Платформа) Тогда НайдСтрока = Стр; Прервать; КонецЕсли;
			КонецЦикла;
			Если НайдСтрока = неопределено Тогда
				НайдСтрока = СписокКТК.Добавить();
			КонецЕсли;
			
			НайдСтрока.Платформа = Ответ.Вагон;
			НайдСтрока.ВладелецТС = Ответ.ВладелецТС;
			НайдСтрока.РазмерПлатформы = Цел(Ответ.Длина * 3.281/10000)*10;
			
		КонецЦикла;
		
		/////////////////////////////////
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаПереченьРейсов.Ссылка.ПСЦ КАК ПСЦ
		               |ИЗ
		               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		               |ГДЕ
		               |	ЗаявкаПереченьРейсов.Рейс = &Рейс
		               |	И НЕ ЗаявкаПереченьРейсов.Ссылка.ПометкаУдаления";
		Запрос.УстановитьПараметр("Рейс", Отправка);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			Грузоотправитель = Документы.Заявка.ПолучитьГрузоотправителяПоПСЦ(Ответ.ПСЦ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
