// Функция ПолучитьРеквизитыДоговора() возвращает структуру с реквизитами договора, 
// используемыми при проведении документов по регламентированному учету. Функция используется 
// для унификации имен реквизитов справочника ДоговорыКонтрагентов при обращении к ним 
// из разных конфигураций, при этом типы самих реквизитов могут различаться в разных 
// конфигурациях.
//
// Параметры:
//  ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов.
//
// Возвращаемое значение:
//  Структура с ключами:
//		Ссылка				 - СправочникСсылка.ДоговорыКонтрагентов, ссылка на сам договор
//		ВалютаВзаиморасчетов - СправочникСсылка.Валюты, валюта взаиморасчетов по договору
//		Организация 		 - СправочникСсылка.Организации, организация, с которой заключен договор
//		Владелец 			 - СправочникСсылка.Контрагент, контрагент, с которым заключен договор
//		ВидДоговора 		 - ПеречислениеСсылка.ВидыДоговоровКонтрагентов  (БП)
//							   или ПеречислениеСсылка.ХозяйственныеОперации (УП) 
//		ТипЦен				 - СправочникСсылка.ТипыЦенНоменклатуры (БП)
//							   или НЕОПРЕДЕЛЕНО (УП)
//		УчетАгентскогоНДС	 - Булево
//		ВидАгентскогоДоговора- ПеречислениеСсылка.ВидыАгентскихДоговоров
//		РасчетыВУсловныхЕдиницах - Булево
//		
//		
Функция ПолучитьРеквизитыДоговораКонтрагента(ДоговорКонтрагента) Экспорт

	СтруктураРеквизиты = Новый Структура();
	СтруктураРеквизиты.Вставить("Ссылка",  				Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	СтруктураРеквизиты.Вставить("ВалютаВзаиморасчетов",	Справочники.Валюты.ПустаяСсылка());
	СтруктураРеквизиты.Вставить("Владелец",				Справочники.Контрагенты.ПустаяСсылка());
	СтруктураРеквизиты.Вставить("Организация",			Справочники.Организации.ПустаяСсылка());
	//СтруктураРеквизиты.Вставить("ТипЦен",				Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
	СтруктураРеквизиты.Вставить("ВидДоговора",			Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка());
	//СтруктураРеквизиты.Вставить("УчетАгентскогоНДС",	Ложь);
	//СтруктураРеквизиты.Вставить("НДСПоСтавкам4и2",		Ложь);
	//СтруктураРеквизиты.Вставить("ВидАгентскогоДоговора",Перечисления.ВидыАгентскихДоговоров.ПустаяСсылка());
	СтруктураРеквизиты.Вставить("РасчетыВУсловныхЕдиницах",Ложь);

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтруктураРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,
																		"Ссылка,
																		|ВалютаВзаиморасчетов,
																		|Владелец,
																		|Организация,
	//																	|ТипЦен,
																		|ВидДоговора,
	//																	|УчетАгентскогоНДС,
	//																	|НДСПоСтавкам4и2,
	//																	|ВидАгентскогоДоговора,
																		|РасчетыВУсловныхЕдиницах");
	КонецЕсли;
	
	Возврат СтруктураРеквизиты;

КонецФункции

// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо ПТУ либо корректировку ПТУ)
// либо первоначальный документ ПТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументПоступления(ДокументПоступления,
		Исходный = Ложь, ОбработанныеДокументы = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ДокументПоступления) 
		Или ТипЗнч(ДокументПоступления) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Возврат ДокументПоступления;
	КонецЕсли;
	
	СогласованноеИзменение = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПоступления,
		"ВидОперации,ДокументПоступления");

	// При согласованном изменении первоначальный документ возвращается только при установленом флаге Исходный.
	Если Не Исходный И РеквизитыДокумента.ВидОперации = СогласованноеИзменение Тогда
		Возврат ДокументПоступления;
	КонецЕсли;

	Если ОбработанныеДокументы = Неопределено Тогда
		ОбработанныеДокументы = Новый Массив;
	ИначеЕсли ОбработанныеДокументы.Найти(РеквизитыДокумента.ДокументПоступления) <> Неопределено Тогда
		Возврат ОбработанныеДокументы[0]; // Если обнаружена зацикленность, возвращаем первый документ в массиве.
	КонецЕсли;

	ОбработанныеДокументы.Добавить(ДокументПоступления); // Добавляем обработанный документ, для поиска зацикленности
		
	// Если документ не первоначальный, то вызываем рекурсию.
	Возврат ПолучитьИсправляемыйДокументПоступления(РеквизитыДокумента.ДокументПоступления,
			Исходный, ОбработанныеДокументы);
	
КонецФункции

// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо РТУ либо корректировку РТУ)
// либо первоначальный документ РТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументРеализации(ДокументРеализации,
		Исходный = Ложь, ОбработанныеДокументы = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ДокументРеализации) 
		Или ТипЗнч(ДокументРеализации) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат ДокументРеализации;
	КонецЕсли;

	СогласованноеИзменение = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации,
		"ВидОперации,ДокументРеализации");

	// При согласованном изменении первоначальный документ возвращается только при установленом флаге Исходный.
	Если Не Исходный И РеквизитыДокумента.ВидОперации = СогласованноеИзменение Тогда
		Возврат ДокументРеализации;
	КонецЕсли;

	Если ОбработанныеДокументы = Неопределено Тогда
		ОбработанныеДокументы = Новый Массив;
	ИначеЕсли ОбработанныеДокументы.Найти(РеквизитыДокумента.ДокументРеализации) <> Неопределено Тогда
		Возврат ОбработанныеДокументы[0]; // Если обнаружена зацикленность, возвращаем первый документ в массиве.
	КонецЕсли;

	ОбработанныеДокументы.Добавить(ДокументРеализации); // Добавляем обработанный документ, для поиска зацикленности
		
	// Если документ не первоначальный, то вызываем рекурсию.
	Возврат ПолучитьИсправляемыйДокументРеализации(РеквизитыДокумента.ДокументРеализации,
			Исходный, ОбработанныеДокументы);
	
КонецФункции
