
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ДокРефСцепы = Строки.ПолучитьКлючи();
	
	Если ДокРефСцепы.Количество() Тогда
		// Проверим, нужно ли получать дополнительные поля
		СтрокаСписка = Строки.Получить(ДокРефСцепы[0]);
		ДополнительныеПоляВыводятся = СтрокаСписка.Данные.Свойство("Ссылка");
		Если НЕ ДополнительныеПоляВыводятся Тогда 
			Возврат;
		КонецЕсли;
	Иначе
		// список пустой
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокРефСцепы", ДокРефСцепы);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_РефСцепСсылка
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка В(&ДокРефСцепы)
		|
		|СГРУППИРОВАТЬ ПО
		|	РефСцепВагоныРефСцепа.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.ДопИнформация КАК ДопИнформация,
		|	РефСцепВагоныРефСцепа.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РефСцепСсылка КАК вт_РефСцепСсылка
		|		ПО РефСцепВагоныРефСцепа.Ссылка = вт_РефСцепСсылка.Ссылка
		|ГДЕ
		|	РефСцепВагоныРефСцепа.ПеренесенВРефСцеп = ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Ссылка КАК Ссылка,
		|	РефСцепВагоныРефСцепа.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_ВагонПервойСтрокиДокумента
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РефСцепВагоныРефСцепа.Ссылка КАК Ссылка,
		|			МИНИМУМ(РефСцепВагоныРефСцепа.НомерСтроки) КАК НомерСтроки
		|		ИЗ
		|			Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РефСцепСсылка КАК вт_РефСцепСсылка
		|				ПО РефСцепВагоныРефСцепа.Ссылка = вт_РефСцепСсылка.Ссылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РефСцепВагоныРефСцепа.Ссылка) КАК ВложенныйЗапрос
		|		ПО РефСцепВагоныРефСцепа.НомерСтроки = ВложенныйЗапрос.НомерСтроки
		|			И РефСцепВагоныРефСцепа.Ссылка = ВложенныйЗапрос.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РефСцепСсылка КАК вт_РефСцепСсылка
		|		ПО РефСцепВагоныРефСцепа.Ссылка = вт_РефСцепСсылка.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
		|	ДислокацияВагоновСрезПоследних.Период КАК Период,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном,
		|	ДислокацияВагоновСрезПоследних.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
		|ПОМЕСТИТЬ вт_ОперацииВагонов
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов.СрезПоследних() КАК ДислокацияВагоновСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ВагонПервойСтрокиДокумента КАК вт_ВагонПервойСтрокиДокумента
		|		ПО ДислокацияВагоновСрезПоследних.Вагон = вт_ВагонПервойСтрокиДокумента.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ОперацииВагонов.Вагон КАК Вагон,
		|	МАКСИМУМ(вт_ОперацииВагонов.Период) КАК Период
		|ПОМЕСТИТЬ вт_МаксПериодВагона
		|ИЗ
		|	вт_ОперацииВагонов КАК вт_ОперацииВагонов
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ОперацииВагонов.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ОперацииВагонов.Вагон КАК Вагон,
		|	вт_ОперацииВагонов.Период КАК Период,
		|	вт_ОперацииВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
		|	вт_ОперацииВагонов.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
		|ПОМЕСТИТЬ вт_ОперацииСМаксПериодом
		|ИЗ
		|	вт_ОперацииВагонов КАК вт_ОперацииВагонов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_МаксПериодВагона КАК вт_МаксПериодВагона
		|		ПО вт_ОперацииВагонов.Вагон = вт_МаксПериодВагона.Вагон
		|			И вт_ОперацииВагонов.Период = вт_МаксПериодВагона.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(вт_ОперацииСМаксПериодом.ОперацияСВагоном.Код) КАК ОперацияСВагономКод,
		|	вт_ОперацииСМаксПериодом.Вагон КАК Вагон
		|ПОМЕСТИТЬ вт_МаксКодОперацииВагона
		|ИЗ
		|	вт_ОперацииСМаксПериодом КАК вт_ОперацииСМаксПериодом
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ОперацииСМаксПериодом.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ОперацииСМаксПериодом.Вагон КАК Вагон,
		|	вт_ОперацииСМаксПериодом.Период КАК Период,
		|	вт_ОперацииСМаксПериодом.ОперацияСВагоном КАК ОперацияСВагоном,
		|	вт_ОперацииСМаксПериодом.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ,
		|	вт_ВагонПервойСтрокиДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	вт_ОперацииСМаксПериодом КАК вт_ОперацииСМаксПериодом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_МаксКодОперацииВагона КАК вт_МаксКодОперацииВагона
		|		ПО вт_ОперацииСМаксПериодом.Вагон = вт_МаксКодОперацииВагона.Вагон
		|			И вт_ОперацииСМаксПериодом.ОперацияСВагоном.Код = вт_МаксКодОперацииВагона.ОперацияСВагономКод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ВагонПервойСтрокиДокумента КАК вт_ВагонПервойСтрокиДокумента
		|		ПО вт_ОперацииСМаксПериодом.Вагон = вт_ВагонПервойСтрокиДокумента.Вагон";
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписиДопИнформации = РезультатЗапроса[1].Выбрать();
	
	ТаблицаДополнительныеПоля = Новый ТаблицаЗначений;
	ТаблицаДополнительныеПоля.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.РефСцеп"));
	ТаблицаДополнительныеПоля.Колонки.Добавить("ДопИнформация", Новый ОписаниеТипов("Строка"));
	ТаблицаДополнительныеПоля.Колонки.Добавить("ОстаточноеРасстояниеКМ", Новый ОписаниеТипов("Число"));
	
	Пока ВыборкаДетальныеЗаписиДопИнформации.Следующий() Цикл
		НайденнаяСтрока = ТаблицаДополнительныеПоля.Найти(ВыборкаДетальныеЗаписиДопИнформации.Ссылка, "Ссылка");
		Если НайденнаяСтрока = Неопределено Тогда 
			НайденнаяСтрока = ТаблицаДополнительныеПоля.Добавить();
			НайденнаяСтрока.Ссылка = ВыборкаДетальныеЗаписиДопИнформации.Ссылка;
		КонецЕсли;
		НайденнаяСтрока.ДопИнформация = НайденнаяСтрока.ДопИнформация 
			+ ?(ЗначениеЗаполнено(НайденнаяСтрока.ДопИнформация) 
			И ЗначениеЗаполнено(ВыборкаДетальныеЗаписиДопИнформации.ДопИнформация), "|", "") 
			+ ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписиДопИнформации.ДопИнформация)
			, СокрЛП(ВыборкаДетальныеЗаписиДопИнформации.ДопИнформация), ""); 
	КонецЦикла;
	
	ВыборкаДетальныеЗаписиДислокация = РезультатЗапроса[7].Выбрать();
	Пока ВыборкаДетальныеЗаписиДислокация.Следующий() Цикл
		НайденнаяСтрока = ТаблицаДополнительныеПоля.Найти(ВыборкаДетальныеЗаписиДислокация.Ссылка, "Ссылка");
		Если НайденнаяСтрока = Неопределено Тогда 
			НайденнаяСтрока = ТаблицаДополнительныеПоля.Добавить();
			НайденнаяСтрока.Ссылка = ВыборкаДетальныеЗаписиДислокация.Ссылка;
		КонецЕсли;
		НайденнаяСтрока.ОстаточноеРасстояниеКМ = ВыборкаДетальныеЗаписиДислокация.ОстаточноеРасстояниеКМ; 
	КонецЦикла;
	
	Для Каждого СтрокаТаблицыДополнительныеПоля Из ТаблицаДополнительныеПоля Цикл 
		СтрокаСписка = Строки[СтрокаТаблицыДополнительныеПоля.Ссылка];
		// выводим для всех полей отдельно, чтобы если первое поле не выводится, следующее поле заполнялось
		Попытка
			СтрокаСписка.Данные["ДопИнформация"] = СтрокаТаблицыДополнительныеПоля.ДопИнформация;            
		Исключение
			// в порции данных строки с таким ключом может и не быть
		КонецПопытки;
		// выводим для всех полей отдельно, чтобы если первое поле не выводится, следующее поле заполнялось
		Попытка
			СтрокаСписка.Данные["ОстаточноеРассояниеКМ"] = СтрокаТаблицыДополнительныеПоля.ОстаточноеРасстояниеКМ;            
		Исключение
			// в порции данных строки с таким ключом может и не быть
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКТКИзExcel(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВставкиКТКExcel"
		, ЭтаФорма
		, Новый Структура("КТК", Истина));
		
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена"
		, Новый Структура("КТК", Истина), 
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиКТКExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		СписокКТКОтбор.ЗагрузитьЗначения(Параметр1);
		Если СписокКТКОтбор.Количество() = 0 Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКТКОтборПриИзменении(Элемент)

	УстановитьОтборПоКТК();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВагонамИзExcel(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВставкиВагоновExcel"
		, ЭтаФорма
		, Новый Структура("Вагоны", Истина));
		
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена"
		, Новый Структура("Вагоны", Истина), 
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиВагоновExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		СписокВагоныОтбор.ЗагрузитьЗначения(Параметр1);
		
		УстановитьОтборПоВагонам();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоныОтборПриИзменении(Элемент)

	УстановитьОтборПоВагонам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРефСцепыОтборПриИзменении(Элемент)
	
	УстановитьОтборПоРефСцепам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентыОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("СписокКлиентов", СПисокКлиентыОтбор.ВыгрузитьЗначения());
	
    Оповещение = Новый ОписаниеОповещения("ПослеПодбора", ЭтаФорма);
    ОткрытьФорму("Документ.РефСцеп.Форма.ФормаПодборКлиентов", ПараметрыФормы, ЭтаФорма, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
		
    Если  РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	мКлиентов = ПОлучитьИзВременногоХранилища(РезультатЗакрытия);
	СписокКлиентыОтбор.ЗагрузитьЗначения(мКлиентов); 
	УстановитьОтборПоКлиентам()
	
КонецПроцедуры
	

&наКлиенте
Процедура ОбработкаВыбораКлиентов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если ТипЗнч(Параметр1) = Тип("Массив") Тогда
		СписокКлиентыОтбор.ЗагрузитьЗначения(Параметр1);
		УстановитьОтборПоКлиентам();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентыОтборПриИзменении(Элемент)
	УстановитьОтборПоКлиентам()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКТК()
	Если СписокКТКОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоВагонам()
	
	Если СписокВагоныОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокВагоны",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокВагоны",СписокВагоныОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокВагоны",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокВагоны",СписокВагоныОтбор);
	КонецЕсли;	

КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоРефСцепам()
	
	Если СписокРефСцепыОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокРефСцепы",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокРефСцепыОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокРефСцепы",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокРефСцепыОтбор);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоКлиентам()
	
	Если СписокКлиентыОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКлиенты",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКлиенты",СписокКлиентыОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКлиенты",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокКлиентыОтбор);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоКТК();
	УстановитьОтборПоВагонам();	
	УстановитьОтборПоРефСцепам();
	УстановитьОтборПоКлиентам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРефСцепыОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	РефСцепыДокументов = ЗаполнитьСписокРефСцепыДокументов();
	
	ОповещениеПослеВыбора = Новый ОписаниеОповещения(
	"ВыбратьРефСцепЗавершение", ЭтотОбъект);
	
	РефСцепыДокументов.ПоказатьОтметкуЭлементов(
	ОповещениеПослеВыбора, "Выберите реф.сцепы");

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРефСцепЗавершение(Элементы, Параметры) Экспорт
	Если Элементы <> Неопределено Тогда
		СписокРефСцепыОтбор.Очистить();
		Для Каждого РефСцеп Из Элементы Цикл
			Если РефСцеп.Пометка Тогда
				СписокРефСцепыОтбор.Добавить(РефСцеп.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьОтборПоРефСцепам();		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьСписокРефСцепыДокументов()
	
	РефСцепыДокументов = Новый СписокЗначений; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепДокументов.РефСцеп КАК РефСцеп
		|ИЗ
		|	Документ.РефСцеп КАК РефСцепДокументов
		|
		|СГРУППИРОВАТЬ ПО
		|	РефСцепДокументов.РефСцеп
		|
		|УПОРЯДОЧИТЬ ПО
		|	РефСцеп";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РефСцепыДокументов.Добавить(ВыборкаДетальныеЗаписи.РефСцеп);
	КонецЦикла;
	
	Возврат РефСцепыДокументов;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Евросиб Коханенко Н.А. #61705 20.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 20.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 20.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 20.12.2022 )
