
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке) Тогда
	//	
	//	Если Объект.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = Справочники.КлассификаторЕдиницИзмерения.Час Тогда
	//		НаименованиеЕдиницы = "часов";
	//	ИначеЕсли Объект.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = Справочники.КлассификаторЕдиницИзмерения.Сутки Тогда
	//		НаименованиеЕдиницы = "суток";
	//	Иначе				
	//		НаименованиеЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке, "Наименование");
	//	КонецЕсли;
	//	
	//	Элементы.НормативНахожденияНаПогрузке.Заголовок = СтрШаблон("Норматив нахождения на погрузке (%1)", НаименованиеЕдиницы);
	//	Элементы.НормативНахожденияНаВыгрузке.Заголовок = СтрШаблон("Норматив нахождения на выгрузке (%1)", НаименованиеЕдиницы);
	//	
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыПоставщиковСрезПоследних.Период КАК Период,
		|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
		|	ТарифыПоставщиковСрезПоследних.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиковСрезПоследних.Статус КАК Статус,
		|	ТарифыПоставщиковСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоставщиковСрезПоследних.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ТарифыПоставщиковСрезПоследних.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ТарифыПоставщиковСрезПоследних.Комментарий КАК Комментарий,
		|	ТарифыПоставщиковСрезПоследних.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
		|	ТарифыПоставщиковСрезПоследних.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоставщиковСрезПоследних.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоставщиковСрезПоследних.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	ТарифыПоставщиковСрезПоследних.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ПОМЕСТИТЬ Тарифы
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(, Критерий = &Критерий) КАК ТарифыПоставщиковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Период КАК Период,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Регистратор КАК Регистратор,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.УчетнаяЕдиница КАК УчетнаяЕдиница,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Статус КАК Статус,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Комментарий КАК Комментарий,
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025                         
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ПОМЕСТИТЬ ТарифыПоУчетнымЕдиницам
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиковПоУчетнымЕдиницам.СрезПоследних(, Критерий = &Критерий) КАК ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПоУчетнымЕдиницам.Период КАК Период,
		|	ТарифыПоУчетнымЕдиницам.Регистратор КАК Регистратор,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.Статус КАК Статус,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоУчетнымЕдиницам.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		|	ТарифыПоУчетнымЕдиницам.Комментарий КАК Комментарий,
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ПОМЕСТИТЬ РазличныеТарифыПоУчетнымЕдиницам
		|ИЗ
		|	ТарифыПоУчетнымЕдиницам КАК ТарифыПоУчетнымЕдиницам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазличныеТарифыПоУчетнымЕдиницам.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	РазличныеТарифыПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС
		|ПОМЕСТИТЬ Шкалы
		|ИЗ
		|	РазличныеТарифыПоУчетнымЕдиницам КАК РазличныеТарифыПоУчетнымЕдиницам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.НомерСтроки КАК НомерСтроки,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.Номенклатура КАК Номенклатура,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.ПроцентОтСтавки КАК ПроцентОтСтавки
		|ИЗ
		|	Тарифы КАК Тарифы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДетализацияКомплексныхУслугПоставщиков.Детализация КАК ДетализацияКомплексныхУслугПоставщиковДетализация
		|		ПО Тарифы.ДетализацияКомплекснойСтавки = ДетализацияКомплексныхУслугПоставщиковДетализация.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тарифы.Период КАК Период,
		|	Тарифы.Регистратор КАК Регистратор,
		|	Тарифы.СтоимостьСНДС КАК СтоимостьСНДС,
		|	Тарифы.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	Тарифы.Статус КАК Статус,
		|	Тарифы.ОкончаниеДействия КАК ОкончаниеДействия,
		|	Тарифы.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	Тарифы.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	Тарифы.Комментарий КАК Комментарий,
		|	Тарифы.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
		|	Тарифы.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	Тарифы.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	Тарифы.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	Тарифы.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ИЗ
		|	Тарифы КАК Тарифы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	ВложенныйЗапрос.От КАК От,
		|	ВложенныйЗапрос.До КАК До,
		|	СУММА(ВложенныйЗапрос.СтоимостьСНДС) КАК СтоимостьСНДС,
		|	СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК СтоимостьБезНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Шкала.НомерСтроки КАК НомерСтроки,
		|		Шкала.От КАК От,
		|		Шкала.До КАК До,
		|		Шкала.Цена КАК СтоимостьСНДС,
		|		0 КАК СтоимостьБезНДС
		|	ИЗ
		|		Тарифы КАК Тарифы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен.Шкала КАК Шкала
		|			ПО Тарифы.ШкалаСтоимостьСНДС = Шкала.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Шкала.НомерСтроки,
		|		Шкала.От,
		|		Шкала.До,
		|		0,
		|		Шкала.Цена
		|	ИЗ
		|		Тарифы КАК Тарифы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен.Шкала КАК Шкала
		|			ПО Тарифы.ШкалаСтоимостьБезНДС = Шкала.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НомерСтроки,
		|	ВложенныйЗапрос.От,
		|	ВложенныйЗапрос.До
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоУчетнымЕдиницам.Период КАК Период,
		|	ТарифыПоУчетнымЕдиницам.Регистратор КАК Регистратор,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.Статус КАК Статус,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоУчетнымЕдиницам.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,		
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		|	ТарифыПоУчетнымЕдиницам.Комментарий КАК Комментарий,
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ИЗ
		|	РазличныеТарифыПоУчетнымЕдиницам КАК ТарифыПоУчетнымЕдиницам
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ОкончаниеДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоУчетнымЕдиницам.Период КАК Период,
		|	ТарифыПоУчетнымЕдиницам.Регистратор КАК Регистратор,
		|	ТарифыПоУчетнымЕдиницам.УчетнаяЕдиница КАК УчетнаяЕдиница,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.Статус КАК Статус,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ТарифыПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ТарифыПоУчетнымЕдиницам.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоУчетнымЕдиницам.УчетнаяЕдиница.Представление КАК УчетнаяЕдиницаПредставление,
		|	ТарифыПоУчетнымЕдиницам.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтоимостьЗаСуткиСНДС КАК СтоимостьЗаСуткиСНДС,
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
		|	ТарифыПоУчетнымЕдиницам.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		|ИЗ
		|	ТарифыПоУчетнымЕдиницам КАК ТарифыПоУчетнымЕдиницам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|	ВложенныйЗапрос.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	ВложенныйЗапрос.От КАК От,
		|	ВложенныйЗапрос.До КАК До,
		|	СУММА(ВложенныйЗапрос.СтоимостьСНДС) КАК СтоимостьСНДС,
		|	СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК СтоимостьБезНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Шкалы.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
		|		Шкалы.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
		|		Шкала.НомерСтроки КАК НомерСтроки,
		|		Шкала.От КАК От,
		|		Шкала.До КАК До,
		|		Шкала.Цена КАК СтоимостьСНДС,
		|		0 КАК СтоимостьБезНДС
		|	ИЗ
		|		Шкалы КАК Шкалы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен.Шкала КАК Шкала
		|			ПО Шкалы.ШкалаСтоимостьСНДС = Шкала.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Шкалы.ШкалаСтоимостьСНДС,
		|		Шкалы.ШкалаСтоимостьБезНДС,
		|		Шкала.НомерСтроки,
		|		Шкала.От,
		|		Шкала.До,
		|		0,
		|		Шкала.Цена
		|	ИЗ
		|		Шкалы КАК Шкалы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен.Шкала КАК Шкала
		|			ПО Шкалы.ШкалаСтоимостьБезНДС = Шкала.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НомерСтроки,
		|	ВложенныйЗапрос.От,
		|	ВложенныйЗапрос.До,
		|	ВложенныйЗапрос.ШкалаСтоимостьСНДС,
		|	ВложенныйЗапрос.ШкалаСтоимостьБезНДС
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Критерий", Объект.Ссылка);
	Результаты = Запрос.ВыполнитьПакет();
	
	ПоследнийИндекс = Результаты.Количество() - 1;
	
	ТекущееСостояние = Результаты[ПоследнийИндекс - 4].Выбрать();
	Если ТекущееСостояние.Следующий() Тогда
		
		Статус = ТекущееСостояние.Статус;
		Основание = ТекущееСостояние.Регистратор;
		ПериодДействия.ДатаНачала = ТекущееСостояние.Период;
		ПериодДействия.ДатаОкончания = ТекущееСостояние.ОкончаниеДействия;
		Комментарий = ТекущееСостояние.Комментарий;
		
		ТаблицаШкалаСтавок = Результаты[ПоследнийИндекс - 3].Выгрузить();
		Если ЗначениеЗаполнено(ТаблицаШкалаСтавок) Тогда
			//ШкалаСтавок.Загрузить(ТаблицаШкалаСтавок);
			Для Каждого Стр Из ТаблицаШкалаСтавок Цикл
				
				Если НЕ ЗначениеЗаполнено(Стр.СтоимостьСНДС) И НЕ ЗначениеЗаполнено(Стр.СтоимостьБезНДС) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаШкалы = ШкалаСтавок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаШкалы, ТекущееСостояние,,"Комментарий"); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				ЗаполнитьЗначенияСвойств(СтрокаШкалы, Стр);
				СтрокаШкалы.УчетныеЕдиницы = "Все";
			КонецЦикла;
		Иначе
			СтрокаШкалы = ШкалаСтавок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШкалы, ТекущееСостояние,,"Комментарий"); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			СтрокаШкалы.УчетныеЕдиницы = "Все";
			//СтрокаШкалы.СтоимостьСНДС = ТекущееСостояние.СтоимостьСНДС;
			//СтрокаШкалы.СтоимостьБезНДС = ТекущееСостояние.СтоимостьБезНДС;
		КонецЕсли;
		
		//ТаблицаДетализацияКомплекснойСтавки = Результаты[ПоследнийИндекс - 5].Выгрузить();
		//Если ЗначениеЗаполнено(ТаблицаДетализацияКомплекснойСтавки) Тогда
		//	ДетализацияКомплекснойСтавки.Загрузить(ТаблицаДетализацияКомплекснойСтавки);
		//КонецЕсли;
		
	//Иначе
	//	
	//	Элементы.Статус. Статус = ТекущееСостояние.Статус;
	//	Основание = ТекущееСостояние.Регистратор;
	//	ПериодДействия.ДатаНачала = ТекущееСостояние.Период;
	//	ПериодДействия.ДатаОкончания = ТекущееСостояние.ОкончаниеДействия;
		
	КонецЕсли;
	
	ТекущееСостояниеПоУчетнымЕдиницам = Результаты[ПоследнийИндекс - 2].Выбрать();
	УчетныеЕдиницы = Результаты[ПоследнийИндекс - 1].Выгрузить();
	ШкалыСтавок = Результаты[ПоследнийИндекс].Выгрузить();
	//СтруктураПоискаУчЕд = Новый Структура("Период,Регистратор,СтоимостьСНДС,СтоимостьБезНДС,Статус,ШкалаСтоимостьСНДС,ШкалаСтоимостьБезНДС,ОкончаниеДействия,ДетализацияКомплекснойСтавки");
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	СтруктураПоискаУчЕд = Новый Структура("Период,Регистратор,СтоимостьСНДС,СтоимостьБезНДС,Статус,ШкалаСтоимостьСНДС,ШкалаСтоимостьБезНДС,ОкончаниеДействия,ДетализацияКомплекснойСтавки,СтоимостьЗаСуткиБезНДС,СтоимостьЗаСуткиСНДС");
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	Если Объект.ВидУслуги = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
		СтруктураПоискаУчЕд.Вставить("СтавкаЗаКМ40FutБезНДС",0);
		СтруктураПоискаУчЕд.Вставить("СтавкаЗаКМ20FutБезНДС",0);
	КонецЕсли;
	 
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	Пока ТекущееСостояниеПоУчетнымЕдиницам.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаУчЕд, ТекущееСостояниеПоУчетнымЕдиницам);
		НаименованияУчЕд = УчетныеЕдиницы.Скопировать(СтруктураПоискаУчЕд, "УчетнаяЕдиницаПредставление").ВыгрузитьКолонку("УчетнаяЕдиницаПредставление");
		СтрокаСписокУчЕд = СтрСоединить(НаименованияУчЕд, ",");
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		Основание = ТекущееСостояниеПоУчетнымЕдиницам.Регистратор;
		ПериодДействия.ДатаНачала = ТекущееСостояниеПоУчетнымЕдиницам.Период;
		ПериодДействия.ДатаОкончания = ТекущееСостояниеПоУчетнымЕдиницам.ОкончаниеДействия;
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
		Если ЗначениеЗаполнено(ТекущееСостояниеПоУчетнымЕдиницам.ШкалаСтоимостьСНДС)
				Или ЗначениеЗаполнено(ТекущееСостояниеПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС) Тогда
				
			СтрокиШкалыСтавок = ШкалыСтавок.НайтиСтроки(Новый Структура("ШкалаСтоимостьСНДС ,ШкалаСтоимостьБезНДС", ТекущееСостояниеПоУчетнымЕдиницам.ШкалаСтоимостьСНДС, ТекущееСостояниеПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС));
			Для Каждого Стр Из СтрокиШкалыСтавок Цикл
				
				Если НЕ ЗначениеЗаполнено(Стр.СтоимостьСНДС) И НЕ ЗначениеЗаполнено(Стр.СтоимостьБезНДС) Тогда
					Продолжить;
				КонецЕсли;	
				
				СтрокаШкалы = ШкалаСтавок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаШкалы, ТекущееСостояниеПоУчетнымЕдиницам);
				ЗаполнитьЗначенияСвойств(СтрокаШкалы, Стр);
				СтрокаШкалы.УчетныеЕдиницы = СтрокаСписокУчЕд;
			КонецЦикла;
			
		Иначе
			
			СтрокаШкалы = ШкалаСтавок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШкалы, ТекущееСостояниеПоУчетнымЕдиницам);
			//ЗаполнитьЗначенияСвойств(СтрокаШкалы, Стр);
			СтрокаШкалы.УчетныеЕдиницы = СтрокаСписокУчЕд;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ШкалаСтавок.Сортировать("Период, ОкончаниеДействия, УчетныеЕдиницы, НомерСтроки");
	
	Для Каждого Элемент Из Элементы Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("КнопкаФормы") Тогда
			Элемент.Доступность = Ложь;
		ИначеЕсли ТипЭлемента = Тип("ПолеФормы")
				Или ТипЭлемента = Тип("ПолеФлажкаФормы") Тогда
			Элемент.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаСтавокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиШкалыСтавок", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиШкалыСтавок() Экспорт
	
	ТекСтрока = Элементы.ШкалаСтавок.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ОбработатьАктивизациюСтрокиШкалыСтавокСервер(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьАктивизациюСтрокиШкалыСтавокСервер(ТекСтрока)
	
	ТекДанные = ШкалаСтавок.НайтиПоИдентификатору(ТекСтрока);
	Если ЗначениеЗаполнено(ТекДанные.ДетализацияКомплекснойСтавки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.Ссылка КАК Ссылка,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.НомерСтроки КАК НомерСтроки,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.Номенклатура КАК Номенклатура,
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.ПроцентОтСтавки КАК ПроцентОтСтавки
		|ИЗ
		|	Справочник.ДетализацияКомплексныхУслугПоставщиков.Детализация КАК ДетализацияКомплексныхУслугПоставщиковДетализация
		|ГДЕ
		|	ДетализацияКомплексныхУслугПоставщиковДетализация.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", ТекДанные.ДетализацияКомплекснойСтавки);
		
		ДетализацияКомплекснойСтавкиТЧ.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Иначе
		
		ДетализацияКомплекснойСтавкиТЧ.Очистить();
		
	КонецЕсли;
		
	
КонецПроцедуры

