
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Представление = ?(ЗначениеЗаполнено(Данные.Код), "" + Данные.Код + "     | ", "") + Данные.Наименование;
	Представление = ?(ЗначениеЗаполнено(Данные.Код), Данные.Код, "КОД НЕ ЗАДАН");
	
	
КонецПроцедуры
