Процедура ЗафиксироватьИзменениеСтаусаЗаявкиВРеестре(Заявка, СостояниеЗаявки, Реестр = Неопределено) Экспорт

	НаборФиксацииЗаявки = РегистрыСведений.ЗаявкиВключенныеВРеестр.СоздатьНаборЗаписей();
	НаборФиксацииЗаявки.Отбор.ЗаявкаНаОплату.Установить(Заявка);
	НаборФиксацииЗаявки.Прочитать();
	
	Для Каждого Набор из НаборФиксацииЗаявки Цикл 
		Набор.Отключена = СостояниеЗаявки;
	КонецЦикла;	
	НаборФиксацииЗаявки.Записать();	

	
КонецПроцедуры	


Процедура ВключитьЗаявкуВРеестр(Заявка, Реестр) Экспорт	
		
	Запись = РегистрыСведений.ЗаявкиВключенныеВРеестр.СоздатьМенеджерЗаписи();
	Запись.ЗаявкаНаОплату = Заявка;
	Запись.РеестрПлатежей = Реестр;
	Запись.Записать();
	
КонецПроцедуры
 
 
Процедура ОтвязатьЗаявкуОтРеестра(Заявка, Реестр) Экспорт
	
	Запись = РегистрыСведений.ЗаявкиВключенныеВРеестр.СоздатьМенеджерЗаписи();
	Запись.ЗаявкаНаОплату = Заявка;
	Запись.РеестрПлатежей = Реестр;
	Запись.Удалить();
	
КонецПроцедуры	