Функция ПолучитьТаблицуМультивалютныхДоговоров(ДоговорыКонтрагента) Экспорт
	
	Результат = Новый Структура("ТаблицаМультивалютныхДоговоров, ТаблицаДоговоровПоУмолчанию", Неопределено, Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентовДоговорыОплаты.Ссылка КАК МультивалютныйДоговор,
	|	ДоговорыКонтрагентовДоговорыОплаты.Договор КАК Договор,
	|	ДоговорыКонтрагентовДоговорыОплаты.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|	ДоговорыКонтрагентовДоговорыОплаты.ВалютаПоУмолчанию КАК ВалютаПоУмолчанию
	|ПОМЕСТИТЬ ВТ_ДоговорыОплаты
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.ДоговорыОплаты КАК ДоговорыКонтрагентовДоговорыОплаты
	|ГДЕ
	|	ДоговорыКонтрагентовДоговорыОплаты.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыОплаты.МультивалютныйДоговор КАК МультивалютныйДоговор,
	|	ВТ_ДоговорыОплаты.Договор КАК Договор,
	|	ВТ_ДоговорыОплаты.Валюта КАК Валюта,
	|	ВТ_ДоговорыОплаты.ВалютаПоУмолчанию КАК ВалютаПоУмолчанию
	|ИЗ
	|	ВТ_ДоговорыОплаты КАК ВТ_ДоговорыОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыОплаты.МультивалютныйДоговор КАК МультивалютныйДоговор,
	|	ВТ_ДоговорыОплаты.Договор КАК Договор,
	|	ВТ_ДоговорыОплаты.Валюта КАК Валюта
	|ИЗ
	|	ВТ_ДоговорыОплаты КАК ВТ_ДоговорыОплаты
	|ГДЕ
	|	ВТ_ДоговорыОплаты.ВалютаПоУмолчанию";
	Запрос.УстановитьПараметр("Ссылка", ДоговорыКонтрагента);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатыЗапроса[1].Пустой() Тогда
		Возврат Результат;
	КонецЕсли;  
	Результат.ТаблицаМультивалютныхДоговоров = РезультатыЗапроса[1].Выгрузить();
	Результат.ТаблицаДоговоровПоУмолчанию = РезультатыЗапроса[2].Выгрузить();
	Возврат Результат;
	
КонецФункции
