
&НаСервере
Процедура СформироватьНаСервере()
	
	Если ЗначениеЗаполнено(ВагоныОтбор) Тогда
		ОтборПоВагонам = "	И
	               			|	СнятиеПостановка.Вагон В(&Вагон)"
	Иначе
		ОтборПоВагонам = "";
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияРемонтАренда.Период КАК Период,
	               |	КалькуляцияРемонтАренда.Регистратор КАК Регистратор,
	               |	КалькуляцияРемонтАренда.Вагон КАК Вагон,
	               |	ВЫБОР
	               |		КОГДА КалькуляцияРемонтАренда.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА &ДатаКон
	               |		ИНАЧЕ КалькуляцияРемонтАренда.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА КалькуляцияРемонтАренда.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ПроцессЗавершен
	               |ПОМЕСТИТЬ РСКалькуляция
	               |ИЗ
	               |	РегистрСведений.КалькуляцияРемонтАренда КАК КалькуляцияРемонтАренда
	               |ГДЕ
	               |	(КалькуляцияРемонтАренда.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ)
	               |			ИЛИ КалькуляцияРемонтАренда.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ)
	               |			ИЛИ НЕ КалькуляцияРемонтАренда.Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И КалькуляцияРемонтАренда.Период < КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ)
	               |				И КалькуляцияРемонтАренда.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.ДатаВводаВЭксплуатацию) КАК ДатаВводаВЭксплуатацию,
	               |	АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.ВагонСсылка КАК ВагонСсылка,
	               |	АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.Ссылка КАК ДокументАренды
	               |ПОМЕСТИТЬ ДатаПостановкиНаУчет
	               |ИЗ
	               |	Документ.АктПостановкиСнятияСУчета.РегистрацияНовыхВагонов КАК АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов
	               |ГДЕ
	               |	АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.ДатаВводаВЭксплуатацию < &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.ВагонСсылка,
	               |	АктПостановкиСнятияСУчетаРегистрацияНовыхВагонов.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктПостановкиСнятияСУчетаСнятиеСУчетаВагона.ВагонСсылка КАК ВагонСсылка,
	               |	МИНИМУМ(АктПостановкиСнятияСУчетаСнятиеСУчетаВагона.ДатаВыводаИзЭксплуатации) КАК ДатаВыводаИзЭксплуатации
	               |ПОМЕСТИТЬ ДатаСнятияСУчета
	               |ИЗ
	               |	ДатаПостановкиНаУчет КАК ДатаПостановкиНаУчет
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПостановкиСнятияСУчета.СнятиеСУчетаВагона КАК АктПостановкиСнятияСУчетаСнятиеСУчетаВагона
	               |		ПО ДатаПостановкиНаУчет.ВагонСсылка = АктПостановкиСнятияСУчетаСнятиеСУчетаВагона.ВагонСсылка
	               |			И ДатаПостановкиНаУчет.ДатаВводаВЭксплуатацию < АктПостановкиСнятияСУчетаСнятиеСУчетаВагона.ДатаВыводаИзЭксплуатации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АктПостановкиСнятияСУчетаСнятиеСУчетаВагона.ВагонСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РСКалькуляция.Период КАК Период,
	               |	РСКалькуляция.Регистратор КАК Регистратор,
	               |	ЕСТЬNULL(РСКалькуляция.Вагон, ДатаПостановкиНаУчет.ВагонСсылка) КАК Вагон,
	               |	РСКалькуляция.ДатаОкончания КАК ДатаОкончания,
	               |	ЕСТЬNULL(ДатаПостановкиНаУчет.ДатаВводаВЭксплуатацию, &ДатаНач) КАК ДатаВводаВЭксплуатацию,
	               |	ЕСТЬNULL(ДатаСнятияСУчета.ДатаВыводаИзЭксплуатации, &ДатаКон) КАК ДатаВыводаИзЭксплуатации,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДатаСнятияСУчета.ДатаВыводаИзЭксплуатации, 0) = 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ВЭксплуатации,
	               |	ВЫБОР
	               |		КОГДА НЕ ЕСТЬNULL(ДатаПостановкиНаУчет.ДатаВводаВЭксплуатацию, 0) = 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Арендованный,
	               |	РСКалькуляция.ПроцессЗавершен КАК ПроцессЗавершен,
	               |	ДатаПостановкиНаУчет.ДокументАренды КАК ДокументАренды
	               |ПОМЕСТИТЬ СнятиеПостановка
	               |ИЗ
	               |	РСКалькуляция КАК РСКалькуляция
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ДатаПостановкиНаУчет КАК ДатаПостановкиНаУчет
	               |		ПО РСКалькуляция.Вагон = ДатаПостановкиНаУчет.ВагонСсылка
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ДатаСнятияСУчета КАК ДатаСнятияСУчета
	               |		ПО РСКалькуляция.Вагон = ДатаСнятияСУчета.ВагонСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(СнятиеПостановка.Период, СнятиеПостановка.ДатаВводаВЭксплуатацию), &ДатаНач, ДЕНЬ) > 0
	               |			ТОГДА &ДатаНач
	               |		ИНАЧЕ ЕСТЬNULL(СнятиеПостановка.Период, СнятиеПостановка.ДатаВводаВЭксплуатацию)
	               |	КОНЕЦ КАК Период,
	               |	СнятиеПостановка.Регистратор КАК Регистратор,
	               |	СнятиеПостановка.Вагон КАК Вагон,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(&ДатаКон, ЕСТЬNULL(СнятиеПостановка.ДатаОкончания, СнятиеПостановка.ДатаВыводаИзЭксплуатации), ДЕНЬ) > 0
	               |			ТОГДА &ДатаКон
	               |		ИНАЧЕ ЕСТЬNULL(СнятиеПостановка.ДатаОкончания, СнятиеПостановка.ДатаВыводаИзЭксплуатации)
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	СнятиеПостановка.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	СнятиеПостановка.ДатаВыводаИзЭксплуатации КАК ДатаВыводаИзЭксплуатации,
	               |	СнятиеПостановка.ВЭксплуатации КАК ВЭксплуатации,
	               |	ВЫБОР
	               |		КОГДА СнятиеПостановка.Регистратор ССЫЛКА Документ.Операция
	               |			ТОГДА ВЫБОР
	               |					КОГДА СнятиеПостановка.Регистратор.Услуга.ОперацияОтражаетПеремещение
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ОперацияПеремещения,
	               |	РАЗНОСТЬДАТ(СнятиеПостановка.ДатаВводаВЭксплуатацию, СнятиеПостановка.ДатаВыводаИзЭксплуатации, ДЕНЬ) КАК СутокАренды,
	               |	СнятиеПостановка.Арендованный КАК Арендованный,
	               |	СнятиеПостановка.ПроцессЗавершен КАК ПроцессЗавершен,
	               |	СнятиеПостановка.ДокументАренды КАК ДокументАренды
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	СнятиеПостановка КАК СнятиеПостановка
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(СнятиеПостановка.Вагон, 0) = 0" + ОтборПоВагонам + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |	ЗаявкаПереченьРейсов.Рейс КАК Рейс,
	               |	МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс.ТехРейс) КАК ТехРейс
	               |ПОМЕСТИТЬ ТипРейса
	               |ИЗ
	               |	Итоговая КАК Итоговая
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |			ПО СделкаСвязьУчетныхЕдиниц.Заявка = ЗаявкаПереченьРейсов.Ссылка
	               |		ПО Итоговая.Вагон = СделкаСвязьУчетныхЕдиниц.Вагон
	               |ГДЕ
	               |	ЗаявкаПереченьРейсов.Рейс ССЫЛКА Справочник.РейсыЖД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаСвязьУчетныхЕдиниц.Вагон,
	               |	ЗаявкаПереченьРейсов.Рейс,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итоговая.Период КАК ДатаНачала,
	               |	Итоговая.Регистратор КАК ДокументРегистратор,
	               |	Итоговая.Вагон КАК Вагон,
	               |	Итоговая.ДатаОкончания КАК ДатаОкончания,
	               |	Итоговая.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	Итоговая.ДатаВыводаИзЭксплуатации КАК ДатаВыводаИзЭксплуатации,
	               |	Итоговая.ВЭксплуатации КАК ВЭксплуатации,
	               |	ТипРейса.ТехРейс КАК ТехРейс,
	               |	ТипРейса.Рейс КАК Рейс,
	               |	Итоговая.ОперацияПеремещения КАК ОперацияПеремещения,
	               |	ВЫБОР
	               |		КОГДА Итоговая.ОперацияПеремещения
	               |				И НЕ ЕСТЬNULL(ТипРейса.Рейс, 0) = 0
	               |				И ТипРейса.ТехРейс
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |	КОНЕЦ КАК ТехПеремещение,
	               |	Итоговая.Арендованный КАК Арендованный,
	               |	Итоговая.СутокАренды КАК СутокАренды,
	               |	ВЫБОР
	               |		КОГДА Итоговая.ОперацияПеремещения
	               |				И НЕ ЕСТЬNULL(ТипРейса.Рейс, 0) = 0
	               |				И НЕ ТипРейса.ТехРейс
	               |				И НЕ ЕСТЬNULL(Итоговая.Регистратор.Сделка, 0) = 0
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |	КОНЕЦ КАК КоммПеремещение,
	               |	ВЫБОР
	               |		КОГДА Итоговая.ОперацияПеремещения
	               |				И ЕСТЬNULL(Итоговая.Регистратор.Сделка, 0) = 0
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |	КОНЕЦ КАК НеКоммПеремещение,
	               |	ВЫБОР
	               |		КОГДА НЕ Итоговая.ОперацияПеремещения
	               |				И НЕ ЕСТЬNULL(ТипРейса.Рейс, 0) = 0
	               |				И НЕ ТипРейса.ТехРейс
	               |				И НЕ ЕСТЬNULL(Итоговая.Регистратор.Сделка, 0) = 0
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |	КОНЕЦ КАК КоммПростой,
	               |	ВЫБОР
	               |		КОГДА Итоговая.Регистратор ССЫЛКА Документ.РемонтныеВедомости
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |	КОНЕЦ КАК Ремонт,
	               |	ВЫБОР
	               |		КОГДА НЕ Итоговая.ВЭксплуатации
	               |				И Итоговая.Арендованный
	               |				И Итоговая.ОперацияПеремещения
	               |				И НЕ ЕСТЬNULL(ТипРейса.Рейс, 0) = 0
	               |				И НЕ ТипРейса.ТехРейс
	               |				И НЕ ЕСТЬNULL(Итоговая.Регистратор.Сделка, 0) = 0
	               |			ТОГДА РАЗНОСТЬДАТ(&ДатаКон, Итоговая.ДатаВыводаИзЭксплуатации, ДЕНЬ)
	               |	КОНЕЦ КАК СНП,
	               |	Итоговая.ПроцессЗавершен КАК ПроцессЗавершен,
	               |	ВЫБОР
	               |		КОГДА Итоговая.Регистратор ССЫЛКА Документ.РемонтныеВедомости
	               |			ТОГДА Итоговая.Регистратор
	               |	КОНЕЦ КАК ДокументРемонт,
	               |	Итоговая.ДокументАренды КАК ДокументАренды,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Итоговая.Регистратор, 0) = 0
	               |			ТОГДА РАЗНОСТЬДАТ(Итоговая.Период, Итоговая.ДатаОкончания, ДЕНЬ)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НекоммерческийПростой,
	               |	0 КАК ПересечениеДанных
	               |ИЗ
	               |	Итоговая КАК Итоговая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТипРейса КАК ТипРейса
	               |		ПО Итоговая.Вагон = ТипРейса.Вагон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вагон,
	               |	Итоговая.Период,
	               |	ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНач",ПериодОтображения.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",ПериодОтображения.ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Если ЗначениеЗаполнено(ВагоныОтбор) Тогда
		Запрос.УстановитьПараметр("Вагон",ВагоныОтбор);
	КонецЕсли;
	
	// получаем вагоны в сделках (в т.ч. в тех. рейсах)/ремонтах
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	// временная тблица для хранения строк с некоммерческим простоем
	ВремТЧ = ТЗ.СкопироватьКолонки();
	// пройти по таблице и проверить временные зазоры между операциями и ремонтами. 
	// если он есть, то ставить разницу в поле "Некоммерческий простой" (добавить еще одну строку с этими датами).
	// если данные идут в пересечение, то установить на обеих строках признак "ПересечениеДанных" = 1.
	
	Если ТЗ.Количество()>0 Тогда
		ТекСтр = ТЗ[0];
		// в случае, если первая дата начала не совпадает с 
		// "краями" указанного диапазона отображения,
		// добавить строки с недостающим диапазоном
		Если ТекСтр.ДатаНачала > ПериодОтображения.ДатаНачала Тогда
			НовСтр = ВремТЧ.Добавить();
			НовСтр.ДатаНачала = ПериодОтображения.ДатаНачала;
			НовСтр.ДатаОкончания = ТекСтр.ДатаНачала;
			НовСтр.НекоммерческийПростой = (ТекСтр.ДатаНачала-ПериодОтображения.ДатаНачала)/3600/24;
			НовСтр.Вагон = ТекСтр.Вагон;
			НовСтр.СутокАренды = ТекСтр.СутокАренды;
		КонецЕсли;
	КонецЕсли;
		
	Если ТЗ.Количество()>1 Тогда
			
		ПерваяЗаписьВагона = Истина;
		
		Для ШагЦикла = 1 По ТЗ.Количество()-1 Цикл
			
			ТекСтр = ТЗ[ШагЦикла];
			ПредСтр = ТЗ[ШагЦикла-1];
			
			Если ТекСтр.Вагон = ПредСтр.Вагон Тогда
				// в случае, если первая дата начала не совпадает с 
				// "краями" указанного диапазона отображения,
				// добавить строки с недостающим диапазоном
				// Если это вторая строка, то не проверяем, т.к. первую мы уже проверили в самом начале.
				// эта проверка нужна для первой записи каждого вагона.
				Если ШагЦикла > 1 
					И ПерваяЗаписьВагона = Истина 
					И ПредСтр.ДатаНачала > ПериодОтображения.ДатаНачала Тогда
					НовСтр = ВремТЧ.Добавить();
					НовСтр.ДатаНачала = ПериодОтображения.ДатаНачала;
					НовСтр.ДатаОкончания = ПредСтр.ДатаНачала;
					НовСтр.НекоммерческийПростой = (ПредСтр.ДатаНачала-ПериодОтображения.ДатаНачала)/3600/24;
					НовСтр.Вагон = ТекСтр.Вагон;
					НовСтр.СутокАренды = ТекСтр.СутокАренды;
				КонецЕсли;
				
				ДельтаДат = ПредСтр.ДатаОкончания - ТекСтр.ДатаНачала;
				// если есть временной зазор, то занести данные в некоммерческий простой.
				Если ДельтаДат < 0 Тогда
					НовСтр = ВремТЧ.Добавить();
					НовСтр.ДатаНачала = ПредСтр.ДатаОкончания;
					НовСтр.ДатаОкончания = ТекСтр.ДатаНачала;
					НовСтр.НекоммерческийПростой = ДельтаДат*3600*24;
					НовСтр.Вагон = ТекСтр.Вагон;
					НовСтр.СутокАренды = ТекСтр.СутокАренды;
				// если данные идут в пересечение, то установить "ПересечениеДанных" = Истина
				ИначеЕсли ДельтаДат > 0 Тогда
					ТекСтр.ПересечениеДанных = 1; 
					ПредСтр.ПересечениеДанных = 1; 
				КонецЕсли;
				
				ПерваяЗаписьВагона = Ложь;
			Иначе
				ПерваяЗаписьВагона = Истина;
				
				// последюю запись тоже нужно проверить, чтобы диапазоны указанного 
				// периода совпадали с датой окончания в последней строке
				Если ПредСтр.ДатаОкончания < ПериодОтображения.ДатаОкончания Тогда
					НовСтр = ВремТЧ.Добавить();
					НовСтр.ДатаНачала = ПредСтр.ДатаОкончания;
					НовСтр.ДатаОкончания = ПериодОтображения.ДатаОкончания;
					НовСтр.НекоммерческийПростой = (ПериодОтображения.ДатаОкончания-ПредСтр.ДатаОкончания)/3600/24;
					НовСтр.Вагон = ПредСтр.Вагон;
					НовСтр.СутокАренды = ПредСтр.СутокАренды;				
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// переносим данные из временной таблицы в основную
	Для Каждого Стр Из ВремТЧ Цикл
		НовСтр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	
	ТЗ.Сортировать("Вагон,ДатаНачала,ДатаОкончания");
	
	Объект.ТЧ.Загрузить(ТЗ);
	
	
	// сворачиваем таблицу, если по вагону было несколько операций
	ТЗ.Свернуть("Вагон,СутокАренды","ТехПеремещение,КоммПеремещение,НеКоммПеремещение,КоммПростой,Ремонт,СНП,НекоммерческийПростой,ПересечениеДанных");
	ТЧСводно.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаНачала = ПериодОтображения.ДатаНачала;
	Объект.ДатаОкончания = ПериодОтображения.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодОтображения.ДатаНачала = Объект.ДатаНачала;
	ПериодОтображения.ДатаОкончания = Объект.ДатаОкончания;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура СтрокиСПересечением(Команда)
	
	Элементы.ТЧСводноСтрокиСПересечением.Пометка = НЕ Элементы.ТЧСводноСтрокиСПересечением.Пометка;
	
	СформироватьТЗСОтбором(Элементы.ТЧСводноСтрокиСПересечением.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТЗСОтбором(ОтборУстановлен)
	
	Если ОтборУстановлен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВремТЧ.Вагон КАК Вагон,
		               |	ВремТЧ.СутокАренды КАК СутокАренды,
		               |	ВремТЧ.ТехПеремещение КАК ТехПеремещение,
		               |	ВремТЧ.КоммПеремещение КАК КоммПеремещение,
		               |	ВремТЧ.НеКоммПеремещение КАК НеКоммПеремещение,
		               |	ВремТЧ.КоммПростой КАК КоммПростой,
		               |	ВремТЧ.Ремонт КАК Ремонт,
		               |	ВремТЧ.СНП КАК СНП,
		               |	ВремТЧ.НекоммерческийПростой КАК НекоммерческийПростой,
		               |	ВремТЧ.ПересечениеДанных КАК ПересечениеДанных
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВремТЧ КАК ВремТЧ
		               |ГДЕ
		               |	ВремТЧ.ПересечениеДанных > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Вагон КАК Вагон,
		               |	ВТ.СутокАренды КАК СутокАренды,
		               |	ВТ.ТехПеремещение КАК ТехПеремещение,
		               |	ВТ.КоммПеремещение КАК КоммПеремещение,
		               |	ВТ.НеКоммПеремещение КАК НеКоммПеремещение,
		               |	ВТ.КоммПростой КАК КоммПростой,
		               |	ВТ.Ремонт КАК Ремонт,
		               |	ВТ.СНП КАК СНП,
		               |	ВТ.НекоммерческийПростой КАК НекоммерческийПростой,
		               |	ВТ.ПересечениеДанных КАК ПересечениеДанных
		               |ИЗ
		               |	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("ВремТЧ",ТЧСводно.Выгрузить());
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТЧСводно.Загрузить(ТЗ);
		
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("ПересечениеДанных", Истина);
		Элементы.ТЧ.ОтборСтрок = ФильтрСтруктура;
	Иначе
		Элементы.ТЧ.ОтборСтрок = Неопределено;
		
		ТЗ = Объект.ТЧ.Выгрузить();
		// сворачиваем таблицу, если по вагону было несколько операций
		ТЗ.Свернуть("Вагон,СутокАренды","ТехПеремещение,КоммПеремещение,НеКоммПеремещение,КоммПростой,Ремонт,СНП,НекоммерческийПростой,ПересечениеДанных");
		ТЧСводно.Загрузить(ТЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВагоныИзEXCEL(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияНомерныхПозиций", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияНомерныхПозиций(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если параметр1 = Неопределено тогда 
		возврат; 
	КонецЕсли;
	
	Для каждого Стр из параметр1 Цикл
		ЭтаФорма.ВагоныОтбор.Добавить(Стр);
	КонецЦикла;
	
КонецПроцедуры

