
Процедура ОбменДаннымиАСУТК(УдалитьФайлПослеЗагрузки=Истина, ВсегоЗагружено=0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПапкаОбменаASUTK_TO_DC = СокрЛП(Константы.ПапкаОбменаASUTK_TO_DC.Получить());
	ПапкаОбменаDC_TO_ASUTK = СокрЛП(Константы.ПапкаОбменаDC_TO_ASUTK.Получить());
	
	Если Прав(ПапкаОбменаDC_TO_ASUTK, 1) <> "\" Тогда
	
		ПапкаОбменаDC_TO_ASUTK = ПапкаОбменаDC_TO_ASUTK + "\";
	
	КонецЕсли; 
	
	ИскМасФайлов = НайтиФайлы(ПапкаОбменаASUTK_TO_DC, "*.xml");
	
	ОпОш = "";
	
	ВсегоЗагружено = 0;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)
		
	Для каждого ТекФайл Из ИскМасФайлов Цикл
			
		ОшибкаЗагрузки = Ложь;
		МасДанных = Новый Массив;
		МасКонтр = Новый Массив; 
		ОбщКол = 0;
		Терминал = ""; // Если значение не заполнено, то 
		
		ЧтениеФайл = Новый ЧтениеТекста(ТекФайл.ПолноеИмя);
		
		Этоxml = Ложь;
		ПерваяСтрочкаВерная = Истина;
		
		НомСтр = 0;
		ТекСтр = ЧтениеФайл.ПрочитатьСтроку();
		Пока ТекСтр <> Неопределено Цикл
			
			Если НомСтр > ОбщКол Тогда // аварийный выход
			
				Прервать;
			
			КонецЕсли;
			
			Если Лев(ТекСтр, 19) = "<?xml version=""1.0""" Тогда
				
				Этоxml = Истина;
				ПерваяСтрочкаВерная = Истина;
				ТекСтр = ЧтениеФайл.ПрочитатьСтроку();
				Продолжить;
				
			Иначе
				
				Если НЕ Этоxml Тогда
					
					ПерваяСтрочкаВерная = Ложь;
					Прервать;
				
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Лев(ТекСтр, 11) = "<Количество" Тогда // Число КТ
				
				ТекСтр = СтрЗаменить(ТекСтр, "<Количество", "");
				ТекСтр = СтрЗаменить(ТекСтр, "Количество=""", "");
				ТекСтр = СтрЗаменить(ТекСтр, """ Терминал=""", Символы.ПС);
				ТекСтр = СтрЗаменить(ТекСтр, """/>", "");
				
				Зн1 = СтрПолучитьСтроку(ТекСтр, 1);
				Зн2 = СтрПолучитьСтроку(ТекСтр, 2);
				
				ОпЗн = Новый ОписаниеТипов("Число");
				ОбщКол = ОпЗн.ПривестиЗначение( СокрЛП(Зн1) );
				Терминал = Зн2;
				
				ТекСтр = ЧтениеФайл.ПрочитатьСтроку();
				Продолжить;
				
			Иначе
				
				ОпЗнДата = Новый ОписаниеТипов("Дата");
				
				РезЧтенияКТ = Новый Структура;
				// Это КТ: <CAXU8231756 Типоразмер="HC" Размер="40" ДатаСдачи="22.08.2020 9:42:21" СВВ="12.10.2020 0:00:00" Собственник="АДЛ МСК "/> 
				ТекСтр = СтрЗаменить(ТекСтр, "Типоразмер", Символы.ПС+"Типоразмер");
				ТекСтр = СтрЗаменить(ТекСтр, "Размер", Символы.ПС+"Размер");
				ТекСтр = СтрЗаменить(ТекСтр, "ДатаСдачи", Символы.ПС+"ДатаСдачи");
				ТекСтр = СтрЗаменить(ТекСтр, "СВВ", Символы.ПС+"СВВ");
				ТекСтр = СтрЗаменить(ТекСтр, "Собственник", Символы.ПС+"Собственник");
				
				Для Сч = 1 По СтрЧислоСтрок(ТекСтр) Цикл
				
					ТекСтрКТ = СокрЛП(СтрПолучитьСтроку(ТекСтр, Сч));
					
					Если Лев(ТекСтрКТ, 10) = "Типоразмер" Тогда
					
						Типоразмер = СтрЗаменить(ТекСтрКТ, "Типоразмер=", "");
						Типоразмер = СтрЗаменить(Типоразмер, """", "");
						РезЧтенияКТ.Вставить("Типоразмер", Типоразмер);
						Продолжить;
					
					КонецЕсли; 
					
					Если Лев(ТекСтрКТ, 6) = "Размер" Тогда
					
						Размер = СтрЗаменить(ТекСтрКТ, "Размер=", "");
						Размер = СтрЗаменить(Размер, """", "");
						РезЧтенияКТ.Вставить("Размер", Размер);
						Продолжить;
					
					КонецЕсли;
					
					Если Лев(ТекСтрКТ, 9) = "ДатаСдачи" Тогда
					    
						ДатаСдачи = СтрЗаменить(ТекСтрКТ, "ДатаСдачи=", "");
						ДатаСдачи = СтрЗаменить(ДатаСдачи, """", "");
						РезЧтенияКТ.Вставить("ДатаСдачи", ОпЗнДата.ПривестиЗначение(ДатаСдачи) );
						Продолжить;
					
					КонецЕсли;
					
					Если Лев(ТекСтрКТ, 3) = "СВВ" Тогда
					
						СВВ = СтрЗаменить(ТекСтрКТ, "СВВ=", "");
						СВВ = СтрЗаменить(СВВ, """", "");
						РезЧтенияКТ.Вставить("СВВ", ОпЗнДата.ПривестиЗначение(СВВ) );
						Продолжить;
					
					КонецЕсли;
					
					Если Лев(ТекСтрКТ, 11) = "Собственник" Тогда
						
						Собственник = СтрЗаменить(ТекСтрКТ, "Собственник=", "");
						Собственник = СтрЗаменить(Собственник, """", "");
						Собственник = СтрЗаменить(Собственник, "/", "");
						Собственник = СтрЗаменить(Собственник, ">", "");
						РезЧтенияКТ.Вставить("Собственник", СокрЛП(Собственник));
						МасКонтр.Добавить(СокрЛП(Собственник));
						Продолжить;
					
					КонецЕсли;
					
					// Это номер КТ:
					КТ = Сред(ТекСтрКТ, 2);
					РезЧтенияКТ.Вставить("Контейнер", КТ);
					
				КонецЦикла; 
				
				МасДанных.Добавить( РезЧтенияКТ );
				
				ТекСтр = ЧтениеФайл.ПрочитатьСтроку();
				НомСтр = НомСтр + 1;
				Продолжить;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ЧтениеФайл.Закрыть();
		
		Если МасДанных.Количество() > 0 Тогда
			
			Терминал = ВРег(СокрЛП(Терминал));
			
			Если Терминал = "NOV" Тогда
			    ИспСиноним = Истина;
			ИначеЕсли Терминал = "MSK" Тогда
			    ИспСиноним = Истина;
			Иначе
				ИспСиноним = Ложь;
			КонецЕсли; 
			
			Сток = Неопределено;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Локации.Ссылка КАК Ссылка
			               |ПОМЕСТИТЬ Выб_Сток
			               |ИЗ
			               |	Справочник.Локации КАК Локации
			               |ГДЕ
			               |	НЕ &ИспСиноним
			               |	И Локации.Наименование = &Наименование
			               |	И Локации.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЛокацииТаблицаСинонимов.Ссылка
			               |ИЗ
			               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
			               |ГДЕ
			               |	&ИспСиноним
			               |	И ЛокацииТаблицаСинонимов.СинонимЛокации = &СинонимЛокации
			               |	И ЛокацииТаблицаСинонимов.Ссылка.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Выб_Сток.Ссылка КАК Ссылка
			               |ИЗ
			               |	Выб_Сток КАК Выб_Сток
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ ПЕРВЫЕ 1
			               |	СтокКонтейнеров.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.СтокКонтейнеров КАК СтокКонтейнеров
			               |ГДЕ
			               |	СтокКонтейнеров.Сток В
			               |			(ВЫБРАТЬ
			               |				Выб_Сток.Ссылка КАК Ссылка
			               |			ИЗ
			               |				Выб_Сток КАК Выб_Сток)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	СтокКонтейнеров.Дата УБЫВ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТипоразмерыТЕ.Код КАК Код,
			               |	ТипоразмерыТЕ.Наименование КАК Наименование,
			               |	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
			               |	ТипоразмерыТЕ.Ссылка КАК Ссылка,
			               |	ТипоразмерыТЕ.КодISO КАК КодISO
			               |ИЗ
			               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	КонтрагентыСинонимыДляПоиска.Ссылка КАК Ссылка,
			               |	КонтрагентыСинонимыДляПоиска.СинонимКонтрагента КАК СинонимКонтрагента
			               |ИЗ
			               |	Справочник.Контрагенты.СинонимыДляПоиска КАК КонтрагентыСинонимыДляПоиска
			               |ГДЕ
			               |	КонтрагентыСинонимыДляПоиска.СинонимКонтрагента В(&МасКонтр)";
			                         
			Запрос.УстановитьПараметр("ИспСиноним", ИспСиноним);
			Запрос.УстановитьПараметр("СинонимЛокации", Терминал);
			Запрос.УстановитьПараметр("Наименование", "Евросиб");
			Запрос.УстановитьПараметр("Сток", Сток);
			Запрос.УстановитьПараметр("МасКонтр", МасКонтр);
			
			Резы = Запрос.ВыполнитьПакет();
			ТипыТЕ = Резы[3].Выгрузить();
			ТЗ_Контрагенты = Резы[4].Выгрузить();
			
			Выборка = Резы[1].Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				Сток = Выборка.Ссылка;
			
			КонецЦикла;
			
			Если Сток = Неопределено Тогда
				
				ВызватьИсключение "Сток " + "Евросиб" + " не найден!";
				
			КонецЕсли; 
			
			//ДокОб = Документы.СтокКонтейнеров.СоздатьДокумент();
			//ДокОб.Дата = ТекущаяДата();
			//ДокОб.Заполнить("");
			//ДокОб.Сток = Сток;
			
			//ТЗ = Резы[2].Выгрузить();
			//Если ТЗ.Количество()>0 Тогда
			//	СсылкаНаДок = ТЗ[0].Ссылка;
			//	ДокОб.Контейнеры.Загрузить(СсылкаНаДок.Контейнеры.Выгрузить());
			//КонецЕсли;
			
			Для каждого СтрДан Из МасДанных Цикл
				
				Тип = Неопределено;
				ИскТип = ТипыТЕ.НайтиСтроки(Новый Структура("Наименование", ""+СтрДан.Размер+СтрДан.ТипоРазмер) );
				
				Если ИскТип.Количество() > 0 Тогда
				
					Тип = ИскТип[0].Ссылка;
				Иначе
					ОпОш = ОпОш + "Тип " + ""+СтрДан.Размер+СтрДан.ТипоРазмер + " не найден!";
					ОшибкаЗагрузки = Истина;
					Прервать;
				КонецЕсли; 
				
				КТК = РаботаСКонтейнерамиСервер.СоздатьКТК(СтрДан.Контейнер, Тип);
								
				Если КТК = Неопределено Тогда
					ОпОш = ОпОш + "Контейнер " + СтрДан.Контейнер + " не найден!";
					ОшибкаЗагрузки = Истина;
					Прервать;
				Иначе
					// Евросиб Фролов (26.10.2021 Ticket№ 41408
					МассивСозданныхКТК.Добавить(КТК);
					// Евросиб Фролов)
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(КТК) И Не ЗначениеЗаполнено(КТК.ТипТЕ) Тогда
				
					об = КТК.ПолучитьОбъект();
					об.ТипТЕ = Тип;
					об.Записать();
				
				КонецЕсли; 
				
				Контр = Неопределено;
				ИскКонтр = ТЗ_Контрагенты.НайтиСтроки(Новый Структура("СинонимКонтрагента", СтрДан.Собственник) );
				Если ИскКонтр.Количество() > 0 Тогда
					Контр = ИскКонтр[0].Ссылка;
				Иначе
					ОпОш = ОпОш + "Контрагент " + СтрДан.Собственник + " не найден!";
					//ОшибкаЗагрузки = Истина;
					//Прервать;
				КонецЕсли; 
				
				//Если ДокОб.Контейнеры.НайтиСтроки(Новый Структура("Контейнер", КТК) ).Количество() = 0 Тогда
				//
				//	НовСтрТЧ = ДокОб.Контейнеры.Добавить();
				//	НовСтрТЧ.Контейнер = КТК;
				//	НовСтрТЧ.ТипКонтейнера = Тип;
				//	НовСтрТЧ.КоличествоБНКонтейнеров = 1;
				//	НовСтрТЧ.Контрагент = Контр;
				//	НовСтрТЧ.Статус = Перечисления.СтатусыКТК.Свободен;
				//	Если СтрДан.Свойство("СВВ") Тогда
				//		НовСтрТЧ.СВВ = СтрДан.СВВ;
				//	КонецЕсли;
				//	НовСтрТЧ.ДатаПриемаВСток = СтрДан.ДатаСдачи;
				//
				//КонецЕсли; 
				
				// SIV 26-10-2020 добавлю обновление данных КТК в АРМ КТК
				Если Константы.ИспользоватьАРМКТК.Получить() = Истина Тогда
					МассивИзмЗначений = Новый Соответствие;
					МассивИзмЗначений.Вставить("тек_ВЭксплуатации", Истина);
					Если ЗначениеЗаполнено(Контр) Тогда
						МассивИзмЗначений.Вставить("тек_Собственник", Контр);
					КонецЕсли;
					МассивИзмЗначений.Вставить("тек_Статус", Перечисления.СтатусыКТК.Свободен);
					Если СтрДан.Свойство("СВВ") Тогда
						МассивИзмЗначений.Вставить("тек_СВВ", СтрДан.СВВ);
					КонецЕсли;
					МассивИзмЗначений.Вставить("тек_ДатаПриемаВСток", СтрДан.ДатаСдачи);
					МассивИзмЗначений.Вставить("тек_Сток", Сток);
					
					Если МассивИзмЗначений.Количество() > 0 Тогда
						МассивИзмЗначений.Вставить("ИсточникЗаписи", "Добавлено из загрузки АСУТК " + ТекущаяДата());
						РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(КТК, МассивИзмЗначений);
					КонецЕсли;
				КонецЕсли;
				
				ВсегоЗагружено = ВсегоЗагружено + 1;
				        
			КонецЦикла; 
			
			Если НЕ ОшибкаЗагрузки Тогда
			
				Попытка
					опОшДок = "";
					//ДокОб.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					опОшДок = ОписаниеОшибки();
					ОпОш = ОпОш + Символы.ПС + опОшДок;
				КонецПопытки; 
				
				Если опОшДок = "" Тогда
					
					Если УдалитьФайлПослеЗагрузки Тогда
					
						УдалитьФайлы(ТекФайл.ПолноеИмя);
					
					КонецЕсли; 
					
					// Здесь можно кинуть сообщение обмена!
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, "Обмен данными АСУТК");
	КонецЕсли;	
	// Евросиб Фролов)
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОпОш <> "" Тогда
	
		Сообщить(ОпОш);
		
		//ВсегоЗагружено = 0;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура АСУТК_ПроверитьФактОтправленияПоездов(ЖДРейсы, ИспВАСУТК=Истина, Описание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ЛокацИня
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	               |	И Локации.Наименование = &ИмяИняВосточная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АналогиЛокаций.Аналог КАК Локация
	               |ПОМЕСТИТЬ ПроверЛокации
	               |ИЗ
	               |	ЛокацИня КАК ЛокацИня
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |		ПО ЛокацИня.Ссылка = АналогиЛокаций.Локация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛокацИня.Ссылка
	               |ИЗ
	               |	ЛокацИня КАК ЛокацИня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтметкаФактНачалаРейсов.РейсЖД КАК РейсЖД,
	               |	ОтметкаФактНачалаРейсов.ФактическоеНачало КАК ФактическоеНачало,
	               |	ОтметкаФактНачалаРейсов.ЗарегистрированоПоВагону КАК ЗарегистрированоПоВагону,
	               |	ОтметкаФактНачалаРейсов.ИндексПоезда КАК ИндексПоезда,
	               |	ОтметкаФактНачалаРейсов.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК
	               |ПОМЕСТИТЬ ФактическиеРейсы
	               |ИЗ
	               |	РегистрСведений.ОтметкаФактНачалаРейсов КАК ОтметкаФактНачалаРейсов
	               |ГДЕ
	               |	ОтметкаФактНачалаРейсов.РейсЖД В(&РейсыЖД)
	               |	И (ОтметкаФактНачалаРейсов.ВыгруженоВАСУТК = ЛОЖЬ
	               |				И &ИспВАСУТК
	               |			ИЛИ НЕ &ИспВАСУТК)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	РейсЖД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СделкаРейсы.Ссылка КАК Сделка,
	               |	ФактическиеРейсы.РейсЖД КАК РейсЖД,
	               |	ФактическиеРейсы.ФактическоеНачало КАК ФактическоеНачало,
	               |	ФактическиеРейсы.ЗарегистрированоПоВагону КАК ЗарегистрированоПоВагону,
	               |	ФактическиеРейсы.ИндексПоезда КАК ИндексПоезда,
	               |	ФактическиеРейсы.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК
	               |ПОМЕСТИТЬ ФактОтпрСделкаСсылка
	               |ИЗ
	               |	Документ.Сделка.Рейсы КАК СделкаРейсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФактическиеРейсы КАК ФактическиеРейсы
	               |		ПО СделкаРейсы.Рейс = ФактическиеРейсы.РейсЖД
	               |			И (НЕ СделкаРейсы.Ссылка.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаРейсы.Ссылка,
	               |	ФактическиеРейсы.РейсЖД,
	               |	ФактическиеРейсы.ФактическоеНачало,
	               |	ФактическиеРейсы.ЗарегистрированоПоВагону,
	               |	ФактическиеРейсы.ИндексПоезда,
	               |	ФактическиеРейсы.ВыгруженоВАСУТК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФактОтпрСделкаСсылка.РейсЖД КАК РейсЖД,
	               |	ФактОтпрСделкаСсылка.ФактическоеНачало КАК ФактическоеНачало,
	               |	ФактОтпрСделкаСсылка.ЗарегистрированоПоВагону КАК ЗарегистрированоПоВагону,
	               |	ФактОтпрСделкаСсылка.ИндексПоезда КАК ИндексПоезда,
	               |	ФактОтпрСделкаСсылка.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК ЗаявкаРегистратор,
	               |	ФактОтпрСделкаСсылка.РейсЖД.ДатаПрибытия КАК ПлановаяДатаПрибытия,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК НомерКонтейнера,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ.Наименование КАК ТипоРазмер,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ.РазмерКТК КАК РазмерКТК,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	               |	СделкаСвязьУчетныхЕдиниц.Груз.ЕТСНГ КАК ГрузЕТСНГ,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	ФактОтпрСделкаСсылка.РейсЖД.ПунктОтправления КАК РейсЖДПунктОтправления,
	               |	ФактОтпрСделкаСсылка.РейсЖД.ПунктНазначения КАК РейсЖДПунктНазначения,
	               |	ФактОтпрСделкаСсылка.РейсЖД.Продукт КАК РейсЖДПродукт,
				   |	СделкаСвязьУчетныхЕдиниц.Ссылка.Номер КАК СделкаНомер,
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   |	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
				   // Евросиб Фролов)
				   |ПОМЕСТИТЬ ФактОтпрСделка
				   |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФактОтпрСделкаСсылка КАК ФактОтпрСделкаСсылка
	               |		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = ФактОтпрСделкаСсылка.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФактОтпрСделка.РейсЖД КАК РейсЖД,
	               |	ФактОтпрСделка.ФактическоеНачало КАК ФактическоеНачало,
	               |	ФактОтпрСделка.ЗарегистрированоПоВагону КАК ЗарегистрированоПоВагону,
	               |	ФактОтпрСделка.ИндексПоезда КАК ИндексПоезда,
	               |	ФактОтпрСделка.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК,
	               |	ФактОтпрСделка.Контейнер КАК Контейнер,
	               |	ФактОтпрСделка.ЗаявкаРегистратор КАК ЗаявкаРегистратор,
	               |	ФактОтпрСделка.Сделка КАК Сделка,
	               |	ФактОтпрСделка.ПлановаяДатаПрибытия КАК ПлановаяДатаПрибытия,
	               |	ФактОтпрСделка.НомерКонтейнера КАК НомерКонтейнера,
	               |	ФактОтпрСделка.ТипоРазмер КАК ТипоРазмер,
	               |	ПРЕДСТАВЛЕНИЕ(ФактОтпрСделка.РазмерКТК) КАК РазмерКТК,
	               |	ФактОтпрСделка.Груженый КАК Груженый,
	               |	ЕСТЬNULL(ФактОтпрСделка.ГрузЕТСНГ, """") КАК ГрузЕТСНГ,
	               |	ФактОтпрСделка.Клиент КАК Клиент,
	               |	ФактОтпрСделка.Договор КАК Договор,
	               |	ФактОтпрСделка.Калькуляция КАК Калькуляция,
	               |	ФактОтпрСделка.РейсЖДПунктОтправления.КодЖДСтанции КАК СтанцияОтправленияКод,
	               |	ФактОтпрСделка.РейсЖДПунктНазначения КАК СтанцияНазначения,
	               |	ФактОтпрСделка.РейсЖДПунктНазначения.КодЖДСтанции КАК СтанцияНазначенияКод,
	               |	ЗаявкаСоставУслуги.ОсобыеОтметки КАК ОсобыеОтметки,
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
				   // Было:
	               //|	ЗаявкаСоставУслуги.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего,
				   //Стало: 
				   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцииПоСдачеПорожнего,
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
	               |	ЗаявкаСоставУслуги.ВладелецКТК.ИНН + ""/"" + ЗаявкаСоставУслуги.ВладелецКТК.КПП КАК ВладелецКТК,
	               |	ЗаявкаСоставУслуги.ВладелецКТК КАК ВладелецКТК_ДоОбр,
	               |	ЗаявкаСоставУслуги.ФИОВодителяВыгрузка КАК ФИОВодителяВыгрузка,
	               |	ЗаявкаСоставУслуги.НомерАвтоВыгрузка КАК НомерАвтоВыгрузка,
	               |	ЕСТЬNULL(ПротоколОбменовКлиент.УИДИсточника, """") КАК УИД_Клиента,
	               |	ЕСТЬNULL(ПротоколОбменовДоговор.УИДИсточника, """") КАК УИД_Договора,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
	               |	ФактОтпрСделка.РейсЖДПродукт КАК РейсЖДПродукт,
	               |	ФактОтпрСделка.СделкаНомер КАК СделкаНомер,
	               |	ФактОтпрСделка.Клиент.Код КАК КлиентКод,
	               |	ФактОтпрСделка.Договор.Код КАК ДоговорКод,
	               |	ЗаявкаСоставУслуги.АдресПогрузки КАК Авто_АдресПогрузки,
	               |	ЗаявкаСоставУслуги.АдресВыгрузки КАК Авто_АдресВыгрузки
	               |ПОМЕСТИТЬ ФактОтпрСостЗаявки
	               |ИЗ
	               |	ФактОтпрСделка КАК ФактОтпрСделка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
				   |		ПО ФактОтпрСделка.Заявка = ЗаявкаСоставУслуги.Ссылка
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   //|			И ФактОтпрСделка.Контейнер = ЗаявкаСоставУслуги.НомерКТК
				   |			И ФактОтпрСделка.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
				   // Евросиб Фролов)				   
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовКлиент
	               |		ПО ФактОтпрСделка.Клиент = ПротоколОбменовКлиент.Объект
	               |			И (ПротоколОбменовКлиент.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |			И (ПротоколОбменовКлиент.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовДоговор
	               |		ПО ФактОтпрСделка.Договор = ПротоколОбменовДоговор.Объект
	               |			И (ПротоколОбменовДоговор.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |			И (ПротоколОбменовДоговор.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   //ДИТ Шевченко А.В. US 62421 TA 64343 01.03.2023 -начало
				   //|ВЫБРАТЬ
				   //|	ЗаявкаДетализацияПоГрузу.Ссылка КАК Ссылка,
				   //|	ЗаявкаДетализацияПоГрузу.ГУИДСтроки КАК ГУИДСтроки,
				   //|	СУММА(ЗаявкаДетализацияПоГрузу.КоличествоМест) КАК КоличествоМест,
				   //|	СУММА(ЗаявкаДетализацияПоГрузу.ВесГруза) КАК ВесГруза
				   //|ПОМЕСТИТЬ ПодрОГрузе
				   //|ИЗ
				   //|	Документ.Заявка.ДетализацияПоГрузу КАК ЗаявкаДетализацияПоГрузу
				   //|ГДЕ
				   //|	ЗаявкаДетализацияПоГрузу.Ссылка В
				   //|			(ВЫБРАТЬ
				   //|				ФактОтпрСделка.Заявка
				   //|			ИЗ
				   //|				ФактОтпрСделка
				   //|			СГРУППИРОВАТЬ ПО
				   //|				ФактОтпрСделка.Заявка)
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	ЗаявкаДетализацияПоГрузу.Ссылка,
				   //|	ЗаявкаДетализацияПоГрузу.ГУИДСтроки
				   //|;
				   |ВЫБРАТЬ
				   |	КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка КАК Ссылка,
				   |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
				   |	СУММА(КлючиАналитикиПеревозкиДетализацияПоГрузу.КоличествоМест) КАК КоличествоМест,
				   |	СУММА(КлючиАналитикиПеревозкиДетализацияПоГрузу.ВесГруза) КАК ВесГруза
				   |ПОМЕСТИТЬ ПодрОГрузе
				   |ИЗ
				   |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК КлючиАналитикиПеревозкиДетализацияПоГрузу
				   |		ПО ЗаявкаСоставУслуги.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка
				   |ГДЕ
				   |	ЗаявкаСоставУслуги.Ссылка В(ВЫБРАТЬ
				   |				ФактОтпрСделка.Заявка
				   |			ИЗ
				   |				ФактОтпрСделка
				   |			СГРУППИРОВАТЬ ПО
				   |				ФактОтпрСделка.Заявка)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка,
				   |	ЗаявкаСоставУслуги.ГУИДСтроки
				   |;
				   //ДИТ Шевченко А.В. US 62421 TA 64343 01.03.2023 -конец
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КалькуляцияТЧ.Ссылка КАК Калькуляция
	               |ПОМЕСТИТЬ ПоискTerminalka
	               |ИЗ
	               |	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияТЧ
	               |ГДЕ
	               |	(КалькуляцияТЧ.Ссылка, КалькуляцияТЧ.ПунктНазначения) В
	               |			(ВЫБРАТЬ
	               |				ФактОтпрСостЗаявки.Калькуляция,
	               |				ФактОтпрСостЗаявки.СтанцияНазначения
	               |			ИЗ
	               |				ФактОтпрСостЗаявки
	               |			СГРУППИРОВАТЬ ПО
	               |				ФактОтпрСостЗаявки.Калькуляция,
	               |				ФактОтпрСостЗаявки.СтанцияНазначения)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КалькуляцияТЧ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехнологическаяСхема.ПредметТСх КАК Сделка,
	               |	ТехнологическаяСхема.ТСх КАК ТСх,
	               |	ИСТИНА КАК ПослеРастаркиВернуть_в_СтокЕС,
	               |	ОперацияГрузы.ТЕ КАК ТЕ
	               |ПОМЕСТИТЬ ВернутьВСток
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
	               |			ПО ТехнологическаяСхемаТЧ.Операция = ОперацияГрузы.Ссылка
	               |		ПО ТехнологическаяСхема.ТСх = ТехнологическаяСхемаТЧ.Ссылка
	               |ГДЕ
	               |	ТехнологическаяСхема.Вариант = ""Фактическая""
	               |	И ТехнологическаяСхема.ПредметТСх В
	               |			(ВЫБРАТЬ
	               |				ФактОтпрСделка.Сделка
	               |			ИЗ
	               |				ФактОтпрСделка
	               |			СГРУППИРОВАТЬ ПО
	               |				ФактОтпрСделка.Сделка)
	               |	И ТехнологическаяСхемаТЧ.ПунктНазначения В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ПроверЛокации.Локация
	               |			ИЗ
	               |				ПроверЛокации)
	               |	И (ТехнологическаяСхемаТЧ.Услуга.ОперацияВозвращаетКТКВладельцу
	               |			ИЛИ ТехнологическаяСхемаТЧ.Услуга.ОперацияРазрешаетПеремещениеВСток)
	               |	И ОперацияГрузы.ТЕ <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТехнологическаяСхема.ПредметТСх,
	               |	ТехнологическаяСхема.ТСх,
	               |	ОперацияГрузы.ТЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрагентыСинонимыДляПоиска.Ссылка КАК ВладелецКТК,
	               |	КонтрагентыСинонимыДляПоиска.СинонимКонтрагента КАК СинонимКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты.СинонимыДляПоиска КАК КонтрагентыСинонимыДляПоиска
	               |ГДЕ
	               |	КонтрагентыСинонимыДляПоиска.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ФактОтпрСостЗаявки.ВладелецКТК_ДоОбр
	               |			ИЗ
	               |				ФактОтпрСостЗаявки
	               |			СГРУППИРОВАТЬ ПО
	               |				ФактОтпрСостЗаявки.ВладелецКТК_ДоОбр)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФактОтпрСостЗаявки.РейсЖД КАК РейсЖД,
	               |	ФактОтпрСостЗаявки.ФактическоеНачало КАК ФактическоеНачало,
	               |	ФактОтпрСостЗаявки.ЗарегистрированоПоВагону КАК ЗарегистрированоПоВагону,
	               |	ФактОтпрСостЗаявки.ИндексПоезда КАК ИндексПоезда,
	               |	ФактОтпрСостЗаявки.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК,
	               |	ФактОтпрСостЗаявки.Контейнер КАК Контейнер,
	               |	ФактОтпрСостЗаявки.ЗаявкаРегистратор КАК ЗаявкаРегистратор,
	               |	ФактОтпрСостЗаявки.Сделка КАК Сделка,
	               |	ФактОтпрСостЗаявки.ПлановаяДатаПрибытия КАК ПлановаяДатаПрибытия,
	               |	ФактОтпрСостЗаявки.НомерКонтейнера КАК НомерКонтейнера,
	               |	ФактОтпрСостЗаявки.ТипоРазмер КАК ТипоРазмер,
	               |	ФактОтпрСостЗаявки.РазмерКТК КАК РазмерКТК,
	               |	ФактОтпрСостЗаявки.Груженый КАК Груженый,
	               |	ФактОтпрСостЗаявки.ГрузЕТСНГ КАК ГрузЕТСНГ,
	               |	ПРЕДСТАВЛЕНИЕ(ФактОтпрСостЗаявки.Клиент) КАК Клиент,
	               |	ПРЕДСТАВЛЕНИЕ(ФактОтпрСостЗаявки.Договор) КАК Договор,
	               |	ФактОтпрСостЗаявки.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	               |	ФактОтпрСостЗаявки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ФактОтпрСостЗаявки.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	               |	ФактОтпрСостЗаявки.ОсобыеОтметки КАК ОсобыеОтметки,
	               |	ФактОтпрСостЗаявки.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего,
	               |	ФактОтпрСостЗаявки.ФИОВодителяВыгрузка КАК ФИОВодителяВыгрузка,
	               |	ФактОтпрСостЗаявки.НомерАвтоВыгрузка КАК НомерАвтоВыгрузка,
	               |	ФактОтпрСостЗаявки.УИД_Клиента КАК УИД_Клиента,
	               |	ФактОтпрСостЗаявки.УИД_Договора КАК УИД_Договора,
	               |	ЕСТЬNULL(ПодрОГрузе.КоличествоМест, 0) КАК КоличествоМест,
	               |	ЕСТЬNULL(ПодрОГрузе.ВесГруза, 0) КАК ВесГруза,
	               |	ЕСТЬNULL(ВернутьВСток.ПослеРастаркиВернуть_в_СтокЕС, ЛОЖЬ) КАК ПослеРастаркиВернуть_в_СтокЕС,
	               |	ФактОтпрСостЗаявки.ВладелецКТК КАК ВладелецКТК_ИНН,
	               |	ФактОтпрСостЗаявки.ВладелецКТК_ДоОбр КАК ВладелецКТК_ДоОбр,
	               |	ФактОтпрСостЗаявки.РейсЖДПродукт.Наименование КАК РейсЖДПродукт,
	               |	ФактОтпрСостЗаявки.СделкаНомер КАК СделкаНомер,
	               |	ФактОтпрСостЗаявки.КлиентКод КАК КлиентКод,
	               |	ФактОтпрСостЗаявки.ДоговорКод КАК ДоговорКод,
	               |	ФактОтпрСостЗаявки.Авто_АдресПогрузки КАК Авто_АдресПогрузки,
	               |	ФактОтпрСостЗаявки.Авто_АдресВыгрузки КАК Авто_АдресВыгрузки,
	               |	ФактОтпрСостЗаявки.Авто_АдресВыгрузки.Адрес КАК Авто_АдресВыгрузкиАдрес
	               |ИЗ
	               |	ФактОтпрСостЗаявки КАК ФактОтпрСостЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПодрОГрузе КАК ПодрОГрузе
	               |		ПО ФактОтпрСостЗаявки.ГУИДСтроки = ПодрОГрузе.ГУИДСтроки
	               |			И ФактОтпрСостЗаявки.ЗаявкаРегистратор = ПодрОГрузе.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоискTerminalka КАК ПоискTerminalka
	               |		ПО ФактОтпрСостЗаявки.Калькуляция = ПоискTerminalka.Калькуляция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВернутьВСток КАК ВернутьВСток
	               |		ПО ФактОтпрСостЗаявки.Сделка = ВернутьВСток.Сделка
	               |			И ФактОтпрСостЗаявки.Контейнер = ВернутьВСток.ТЕ
	               |ИТОГИ
	               |	МАКСИМУМ(РейсЖДПродукт)
	               |ПО
	               |	СделкаНомер";
	                          
	Запрос.УстановитьПараметр("РейсыЖД", ЖДРейсы);
	Запрос.УстановитьПараметр("ИспВАСУТК", ИспВАСУТК);
	Запрос.УстановитьПараметр("ИмяИняВосточная", "Иня-Восточная");
	
	// Резы = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Резы = Запрос.ВыполнитьПакет();
	
	ТЗВладелельцы = Резы[9].Выгрузить();
	ТЗВладелельцы.Индексы.Добавить("ВладелецКТК");
	ВыборкаСделка = Резы[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Дата отправления
	//Станция отправления (код)
	//Плановая дата прибытия
	//Станция назначения (код)
	//НомерКТК
	//ТипоразмерКТК
	//РазмерКТК
	//ВладелецКТК (ИНН/КПП)
	//Груженый
	//Груз ЕТСНГ
	//Вес
	//КолвоМест
	//ТерминалкаПоПрибытию
	//ОсобыеОтметки
	//ИнструкцииПоСдаче
	//Клиент
	//ГУИД Клиента БФ
	//Договор
	//ГУИД Договора БФ
	//Водитель авто выгрузки
	//Номер Авто выгрузки
	//ПРИЗНАК - после растарки вернуть в сток ЕС
	
	МасФиксацОтправок = Новый Массив;
	
	Если ВыборкаСделка.Количество() > 0 Тогда
	
		edc = "urn:DC:to:ASUTK";
		ListOfDeals_Type = ФабрикаXDTO.Тип(edc, "ListOfDeals");
		Deal_Type = ФабрикаXDTO.Тип(edc, "Deal");
		ListContainers_Type = ФабрикаXDTO.Тип(edc, "ListContainers");
		Obj_Type 			= ФабрикаXDTO.Тип(edc, "Obj");
		
		ListOfDeals = ФабрикаXDTO.Create(ListOfDeals_Type);
		
		ПапкаОбменаDC_TO_ASUTK = Константы.ПапкаОбменаDC_TO_ASUTK.Получить();
		Если Прав(ПапкаОбменаDC_TO_ASUTK, 1) <> "\" Тогда
		
			ПапкаОбменаDC_TO_ASUTK = ПапкаОбменаDC_TO_ASUTK + "\";
		
		КонецЕсли; 
		
		ЗаписьXML = Новый ЗаписьXML;
		ИмяФайла = "DCtoASUTK_" + Формат(ТекущаяДата(), "ДФ=yyyy_MM_dd_HH_mm_ss")+".xml";
		ПолноеИмяФайла = ПапкаОбменаDC_TO_ASUTK + ИмяФайла;
		//Сообщить("Записываю в : " + ИмяФайла);
		ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		Пока ВыборкаСделка.Следующий() Цикл
			
			Deal = ФабрикаXDTO.Create(Deal_Type);
			Deal.NumberDeal		= ВыборкаСделка.СделкаНомер;
			Deal.NameProduct 	= ВыборкаСделка.РейсЖДПродукт;
			
			ListContainers = ФабрикаXDTO.Create(ListContainers_Type);
			Deal.ListContainers = ListContainers;
			
			ЗафиксироватьОтправку = Истина;
			
			Выборка = ВыборкаСделка.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				Obj = ФабрикаXDTO.Create(Obj_Type);
				
				Obj.DepartureDate		= Выборка.ФактическоеНачало;
				Obj.StationDeparture	= ?(Выборка.СтанцияОтправленияКод=NULL, "", Выборка.СтанцияОтправленияКод);
				Obj.PlannedArrivalDate	= Выборка.ПлановаяДатаПрибытия;
				Obj.StationDestination	= ?(Выборка.СтанцияНазначенияКод=NULL, "", Выборка.СтанцияНазначенияКод);
				Obj.NumberContainer		= ?(Выборка.НомерКонтейнера=NULL, "", Выборка.НомерКонтейнера);
				Obj.TypeSize			= ?(Выборка.ТипоРазмер=NULL, "", Выборка.ТипоРазмер);
				Obj.Size				= ?(Выборка.РазмерКТК=NULL, "", Выборка.РазмерКТК);
				ИскМасВлад = ТЗВладелельцы.НайтиСтроки(Новый Структура("ВладелецКТК", Выборка.ВладелецКТК_ДоОбр) );
				СтрВладелец = "";
				Для каждого ТекСтрВл Из ИскМасВлад Цикл
					СтрВладелец = СтрВладелец + ?(СтрВладелец="", "", ";") + ТекСтрВл.СинонимКонтрагента;
				КонецЦикла; 
				Obj.Owner				= "" + ?(Выборка.ВладелецКТК_ИНН="/", "", Выборка.ВладелецКТК_ИНН) + ?(Выборка.ВладелецКТК_ИНН="/", "", ";") + СтрВладелец;
				Obj.loaded				= ?(Выборка.Груженый=NULL, "", Выборка.Груженый);
				Obj.CargoETSNG			= ?(Выборка.ГрузЕТСНГ=NULL, "", Выборка.ГрузЕТСНГ);
				Obj.Weight				= ?(Выборка.ВесГруза=NULL, "", Выборка.ВесГруза);
				Obj.QuantityOfPlaces	= ?(Выборка.КоличествоМест=NULL, "", Выборка.КоличествоМест);
				Obj.Terminalka          = Выборка.TerminalkaASUTKtoDC;
				Obj.SpecialMarks		= ?(Выборка.ОсобыеОтметки=NULL, "", СтрЗаменить(Выборка.ОсобыеОтметки, Символы.ПС, " ") );
				Obj.InstructionsForSubmission = ?(Выборка.ИнструкцииПоСдачеПорожнего=NULL, "", СтрЗаменить(Выборка.ИнструкцииПоСдачеПорожнего, Символы.ПС, " ") );
				Obj.Client				= ?(Выборка.Клиент=NULL, "", Выборка.Клиент);
				Obj.UID_Client          = ?(Выборка.УИД_Клиента=NULL, "", Выборка.УИД_Клиента);
				Obj.COD_Client          = ?(Выборка.КлиентКод=NULL, "", Выборка.КлиентКод);
				Obj.Contract			= ?(Выборка.Договор=NULL, "", Выборка.Договор);
				Obj.UID_Contract        = ?(Выборка.УИД_Договора=NULL, "", Выборка.УИД_Договора);
				Obj.COD_Contract        = ?(Выборка.ДоговорКод=NULL, "", Выборка.ДоговорКод);
				Obj.DriverCarUnloading	= ?(Выборка.ФИОВодителяВыгрузка=NULL, "", Выборка.ФИОВодителяВыгрузка);
				Obj.NumberCarsUnloading = ?(Выборка.НомерАвтоВыгрузка=NULL, "", Выборка.НомерАвтоВыгрузка);
				Obj.AfterStrippingBackToStoke = Выборка.ПослеРастаркиВернуть_в_СтокЕС;
				Obj.AddressDischarge	= ?(Выборка.Авто_АдресВыгрузкиАдрес=NULL, "", Выборка.Авто_АдресВыгрузкиАдрес);
				
				ListContainers.Object.Добавить(Obj);
				
				Если ЗафиксироватьОтправку Тогда
					
					МЗ = РегистрыСведений.ОтметкаФактНачалаРейсов.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МЗ, Выборка);
					МЗ.ВыгруженоВАСУТК = Истина;
					
					МасФиксацОтправок.Добавить(МЗ);
					
					ЗафиксироватьОтправку = Ложь;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			ListOfDeals.Deal.Добавить(Deal);
			
		КонецЦикла; 
		
		Попытка
		
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ListOfDeals, "ListOfDeals");
			
			Для каждого Стр Из МасФиксацОтправок Цикл
			
				Стр.Записать();
			
			КонецЦикла; 
			
		Исключение
			ОпОш = ОписаниеОшибки();
			Описание = ОпОш;
		КонецПопытки; 
		
		ЗаписьXML.Закрыть();
	
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Процедура ФактОтправкиЖД_АСУТК() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Описание = "";
	ЖДРейсы = Новый Массив;
	// Собираем проверяемые ЖД рейсы за 15 последних суток
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ЛокацИня
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	               |	И Локации.Наименование = &ИмяИняВосточная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АналогиЛокаций.Аналог КАК Локация
	               |ПОМЕСТИТЬ ПроверЛокации
	               |ИЗ
	               |	ЛокацИня КАК ЛокацИня
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	               |		ПО ЛокацИня.Ссылка = АналогиЛокаций.Локация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛокацИня.Ссылка
	               |ИЗ
	               |	ЛокацИня КАК ЛокацИня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтметкаФактНачалаРейсов.РейсЖД КАК РейсЖД,
	               |	МИНИМУМ(ОтметкаФактНачалаРейсов.ФактическоеНачало) КАК ФактическоеНачало,
	               |	ОтметкаФактНачалаРейсов.ИндексПоезда КАК ИндексПоезда,
	               |	МИНИМУМ(ОтметкаФактНачалаРейсов.ВыгруженоВАСУТК) КАК ВыгруженоВАСУТК
	               |ПОМЕСТИТЬ ОтправленныеРейсыЗаПериод
	               |ИЗ
	               |	РегистрСведений.ОтметкаФактНачалаРейсов КАК ОтметкаФактНачалаРейсов
	               |ГДЕ
	               |	ОтметкаФактНачалаРейсов.ФактическоеНачало МЕЖДУ &ДатаНач И &ДатаОк
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтметкаФактНачалаРейсов.РейсЖД,
	               |	ОтметкаФактНачалаРейсов.ИндексПоезда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтправленныеРейсыЗаПериод.РейсЖД КАК РейсЖД,
	               |	ОтправленныеРейсыЗаПериод.ФактическоеНачало КАК ФактическоеНачало,
	               |	ОтправленныеРейсыЗаПериод.ИндексПоезда КАК ИндексПоезда,
	               |	ОтправленныеРейсыЗаПериод.ВыгруженоВАСУТК КАК ВыгруженоВАСУТК
	               |ИЗ
	               |	ОтправленныеРейсыЗаПериод КАК ОтправленныеРейсыЗаПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроверЛокации КАК ПроверЛокации
	               |		ПО ОтправленныеРейсыЗаПериод.РейсЖД.ПунктНазначения = ПроверЛокации.Локация";
	
	Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата()-15*24*3600);
	Запрос.УстановитьПараметр("ДатаОк", ТекущаяДата());
	Запрос.УстановитьПараметр("ИмяИняВосточная", "Иня-Восточная");
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЖДРейсы.Добавить( Выборка.РейсЖД );
	
	КонецЦикла;
	
	АСУТК_ПроверитьФактОтправленияПоездов(ЖДРейсы, , Описание);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Описание <> "" Тогда
	
		ВызватьИсключение Описание;
	
	КонецЕсли; 
	
КонецПроцедуры
 
