
&НаКлиенте
Процедура ТДПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	СтрокиТД = 3;

	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл 
		ЧислаМ.Добавить(Строка(Сч)); 
	КонецЦикла;
	
	СохраненныйБелый = ТД.Область("R1C15").ЦветФона;
	
	// Анализируем ключ Контейнер + (Номер_заявки или Номер_авто)
	Контейнер = ТД.Область("R"+СтрокиТД+"C5").Текст;
	
	Пока Контейнер <> "" Цикл
		
		НомерЗаявки = ТД.Область("R"+СтрокиТД+"C4").Текст;
		НомерАвто = ТД.Область("R"+СтрокиТД+"C2").Текст;
		
		//Если НайтиЗаявкуВСистеме(Контейнер,НомерЗаявки,НомерАвто) = ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка") Тогда
		//	ТД.Область("R"+СтрокиТД+"C5").ЦветФона = WebЦвета.Голубой;
		//Иначе
		//	ТД.Область("R"+СтрокиТД+"C5").ЦветФона = СохраненныйБелый;
		//КонецЕсли;
		
		Если СтрДлина(СокрЛП(Контейнер)) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(Контейнер,4), Сред(Контейнер,5,6));
		КонецЕсли;
		
		// если контрольный знак не совпал
		Если СтрДлина(СокрЛП(Контейнер)) <> 11  
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(СокрЛП(Контейнер),1)) = неопределено  
			ИЛИ (СтрДлина(СокрЛП(Контейнер)) = 11 И НЕ Число(Прав(СокрЛП(Контейнер),1)) = КонтрольныйЗнак) Тогда
			ТД.Область("R"+СтрокиТД+"C5").ЦветФона = WebЦвета.Розовый;
		// если не нашли заявку, то подсветить номер контейнера
		//ИначеЕсли НайтиЗаявкуВСистеме(Контейнер,НомерЗаявки,НомерАвто) = ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка") Тогда
		//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, начало
		ИначеЕсли НайтиЗаявкуВСистеме(Контейнер,НомерЗаявки,НомерАвто,Клиент,Договор) = ПредопределенноеЗначение("Документ.Заявка.ПустаяСсылка") Тогда
		//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, конец
			ТД.Область("R"+СтрокиТД+"C5").ЦветФона = WebЦвета.Голубой;
		Иначе
			ТД.Область("R"+СтрокиТД+"C5").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		СтрокиТД = СтрокиТД + 1;
		Контейнер = ТД.Область("R"+СтрокиТД+"C5").Текст;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало 
	Если НЕ ЗначениеЗаполнено(НаименованиеРеестра) Тогда
		СтрокиТД = 3;
		ДатаЗагрузки =  ПреобразованиеВДату(СокрЛП(ТД.Область("R"+СтрокиТД+"C6").Текст));
		ДатаВыгрузки =  ПреобразованиеВДату(СокрЛП(ТД.Область("R"+СтрокиТД+"C7").Текст));
		НаименованиеРеестра = ПолучитьНаименованиеДляНовогоЭлемента(Реестр, Клиент, ДатаЗагрузки, ДатаВыгрузки);
	КонецЕсли;

	Если ЕстьРеестрСАналогичнымНаименованием(Реестр, Клиент, НаименованиеРеестра) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись отменена, уже есть Реестр с аналогичным наименованием! Требуется изменить наименование на уникальное",
													,"НаименованиеРеестра");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НаименованиеРеестра) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись отменена, требуется заполнить Наименование реестрае",
													,"НаименованиеРеестра");
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец
	
	Если РежимРаботы = "Контейнеры" Тогда
		СозданныйРеестр = СохранитьНаСервереКТК();
	Иначе
		СозданныйРеестр = СохранитьНаСервереВагоны();
	КонецЕсли;
	Закрыть(СозданныйРеестр);
	
КонецПроцедуры   

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
&НаСервереБезКонтекста
Функция ПолучитьНаименованиеДляНовогоЭлемента(вхСсылка, вхКлиент, вхПериодРеестраНачало, вхПериодРеестраОкончание)
	Возврат Справочники.РеестрыСогласования.ПолучитьНаименованиеДляНовогоЭлемента(вхСсылка, вхКлиент, вхПериодРеестраНачало, вхПериодРеестраОкончание);
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец    

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
&НаСервереБезКонтекста
Функция ЕстьРеестрСАналогичнымНаименованием(вхСсылка, вхКлиент, вхНаименование)
	Возврат Справочники.РеестрыСогласования.ЕстьРеестрСАналогичнымНаименованием(вхСсылка, вхКлиент, вхНаименование);
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, коне

&НаСервереБезКонтекста                         
//Евросиб - Дубская 28.06.2022 #0255944 
//Функция НайтиЗаявкуПоКускуНомера(ВнешнийНомерЗаявки)
Функция НайтиЗаявкуПоКускуНомера(ВнешнийНомерЗаявки, Контрагент, Договор)
//Евросиб - Дубская 28.06.2022 #0255944	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.ПометкаУдаления = ЛОЖЬ
	               |	И Заявка.Номер ПОДОБНО &Номер 
		//Евросиб - Дубская 28.06.2022 #0255944 
	               |	&УсловиеПоКонтрагенту
	               |	&УсловиеПоДоговору
		//Евросиб - Дубская 28.06.2022 #0255944 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Заявка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Номер", "%"+ВнешнийНомерЗаявки);
	//Евросиб - Дубская 28.06.2022 #0255944 
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКонтрагенту", "И Заявка.Контрагент = &Контрагент"); 
		Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКонтрагенту", ""); 
	КонецЕсли;	                                            
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", "И Заявка.Договор = &Договор"); 
		Запрос.УстановитьПараметр("Договор", Договор);  
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", ""); 
	КонецЕсли;	                                            
	//Евросиб - Дубская 28.06.2022 #0255944 
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СохранитьНаСервереКТК()
	
	Если ЗначениеЗаполнено(Реестр) Тогда
		СозданныйРеестр = Реестр;
		НовРеестр = СозданныйРеестр.ПолучитьОбъект();
	Иначе
		СозданныйРеестр = Справочники.РеестрыСогласования.ПустаяСсылка();
		НовРеестр = Справочники.РеестрыСогласования.СоздатьЭлемент();
	КонецЕсли;
	
	СтрокиТД = 3;
	
	ПрочСтрока = ТД.Область("R"+СтрокиТД+"C1").Текст;
	
	
	Пока ПрочСтрока <> "" Цикл
		
		НовСтр = НовРеестр.ПереченьКонтейнеров.Добавить(); 

		
		СтолбцыТД = 1;
		
		Пока СтолбцыТД<14 Цикл
			
			ТекЯчейка = ТД.Область("R"+СтрокиТД+"C"+СтолбцыТД).Текст;
			// ищем в справочнике РеестрыСогласования комментарий реквизита с номером = номеру столбца
			РеквизитыТЧ = Метаданные.Справочники.РеестрыСогласования.ТабличныеЧасти.ПереченьКонтейнеров.Реквизиты;
			Для Каждого Рекв Из РеквизитыТЧ Цикл
				Если Рекв.Комментарий = Строка(СтолбцыТД) Тогда
					Если Рекв.Имя = "Контейнер" Тогда
						ТекЭлем = РаботаСКонтейнерамиСервер.НайтиКТК(СокрЛП(ТекЯчейка)); // Справочники.ТЕ.НайтиПоНаименованию(СокрЛП(ТекЯчейка));
					ИначеЕсли Рекв.Имя = "ТипТЕ" Тогда
						ТекЭлем = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СокрЛП(ТекЯчейка));
					ИначеЕсли Рекв.Имя = "ДатаЗагрузки" ИЛИ Рекв.Имя = "ДатаВыгрузки" Тогда
						Попытка
							ТекЭлем = ПреобразованиеВДату(СокрЛП(ТекЯчейка));
						Исключение
							НЕтДТ = Истина;
						КонецПопытки;
					ИначеЕсли Рекв.Имя = "ПунктОтправления" ИЛИ Рекв.Имя = "ПунктНазначения" Тогда
						ТекЭлем = ПоискЛокацииВСправочнике(ТекЯчейка);
					Иначе
						ТекЭлем = СокрЛП(ТекЯчейка);
					КонецЕсли;
					
					НовСтр[Рекв.Имя] = ТекЭлем;
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			СтолбцыТД = СтолбцыТД+1;
		КонецЦикла; 
		//Евросиб - АСуслов 22.11.2021 15:58:24 #42467
		//(
		НовСтр.Услуга = Услуга;
		//)
		//Евросиб - АСуслов 22.11.2021 15:58:34 #42467
		
		Если ЗначениеЗаполнено(НовСтр.ВнешнийНомерЗаявки) Тогда
			//Евросиб - Дубская 28.06.2022 #0255944 
			//НовСтр.ЗаявкаВСистеме = НайтиЗаявкуПоКускуНомера(НовСтр.ВнешнийНомерЗаявки);   
			НовСтр.ЗаявкаВСистеме = НайтиЗаявкуПоКускуНомера(НовСтр.ВнешнийНомерЗаявки, Клиент, Договор);   
			//Евросиб - Дубская 28.06.2022 #0255944 
		Иначе
			
			//НовСтр.ЗаявкаВСистеме = НайтиЗаявкуВСистеме(НовСтр.Контейнер.Наименование,НовСтр.ВнешнийНомерЗаявки,НовСтр.НомерАвто);
			//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, начало
			НовСтр.ЗаявкаВСистеме = НайтиЗаявкуВСистеме(НовСтр.Контейнер.Наименование,НовСтр.ВнешнийНомерЗаявки,НовСтр.НомерАвто, Клиент, Договор);
			//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, конец
			
		КонецЕсли;
		
		СтрокиТД = СтрокиТД + 1;
		ПрочСтрока = ТД.Область("R"+СтрокиТД+"C1").Текст;
	КонецЦикла;
	
	Если НовРеестр.ПереченьКонтейнеров.Количество() = 0 Тогда
		Возврат СозданныйРеестр;
	КонецЕсли;
	
	// Период реестра - минимальная дата загрузки и максимальная дата выгрузки
	ВремТбл = НовРеестр.ПереченьКонтейнеров.Выгрузить();
	ВремТбл.Сортировать("ДатаЗагрузки ВОЗР");
	ДатаНач = ВремТбл[0].ДатаЗагрузки;
	ВремТбл.Сортировать("ДатаВыгрузки УБЫВ");
	ДатаКон = ВремТбл[0].ДатаВыгрузки;
	
	НовРеестр.Клиент = Клиент;
	НовРеестр.Договор = Договор;
	НовРеестр.Организация = Организация;
	НовРеестр.ПериодРеестраНачало = ДатаНач;
	НовРеестр.ПериодРеестраОкончание = ДатаКон;
	//Если НЕ ЗначениеЗаполнено(НаименованиеРеестра) Тогда
	//	НаименованиеРеестра = "№ " + Формат(ДатаНач,"ДФ=dd.MM.yy") + "_" + Формат(ДатаКон,"ДФ=dd.MM.yy"); //ДИТ, Беляев СЮ, ..., 09-09-2022, закомментировал
	//КонецЕсли;
	НовРеестр.Наименование = НаименованиеРеестра;	
	НовРеестр.Записать();
	
	Сообщить("Записан реестр " + НовРеестр.Ссылка);
	// записать данные в заявку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрыСогласованияПереченьКонтейнеров.ЗаявкаВСистеме КАК ЗаявкаВСистеме,
		|	РеестрыСогласованияПереченьКонтейнеров.Ссылка.Наименование КАК Наименование,
		|	РеестрыСогласованияПереченьКонтейнеров.Контейнер КАК Контейнер
		|ИЗ
		|	Справочник.РеестрыСогласования.ПереченьКонтейнеров КАК РеестрыСогласованияПереченьКонтейнеров
		|ГДЕ
		|	РеестрыСогласованияПереченьКонтейнеров.Ссылка = &Ссылка
		|	И НЕ РеестрыСогласованияПереченьКонтейнеров.ЗаявкаВСистеме = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|ИТОГИ ПО
		|	ЗаявкаВСистеме";
	
	Запрос.УстановитьПараметр("Ссылка",НовРеестр.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// сделаем группировку, чтобы одну заявку не записывать много раз
	Пока ВыборкаЗаявка.Следующий() Цикл
	    ТекЗаявка = ВыборкаЗаявка.ЗаявкаВСистеме;
		ПолучОб = ТекЗаявка.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаЗаявка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТЧ = ПолучОб.СоставУслуги;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКТК",ВыборкаДетальныеЗаписи.Контейнер);
			НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				НайденныеСтроки[0].РеестрКлиента = ВыборкаДетальныеЗаписи.Наименование;
			КонецЕсли;
		КонецЦикла;
		ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Данные по заявке " + ПолучОб + " обновлены!");
	КонецЦикла;
	//Евросиб - Дубская 12.08.2022 #0255944 
	//// обновить данные по сделке
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	СделкаЗаявки.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.РеестрыСогласования.ПереченьКонтейнеров КАК РеестрыСогласованияПереченьКонтейнеров
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
	//	|		ПО РеестрыСогласованияПереченьКонтейнеров.ЗаявкаВСистеме = СделкаЗаявки.Заявка  //было = СделкаЗаявки.Ссылка 
	//	|ГДЕ
	//	|	РеестрыСогласованияПереченьКонтейнеров.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка",НовРеестр.Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//ТЗ = РезультатЗапроса.Выгрузить();
	//
	//Для Каждого Стр  Из Тз Цикл
	//	доходы_ЗаполнитьПоЗаявкам2(Стр.Сделка.ПолучитьОбъект());
	//	Сообщить("Данные по сделке " + Стр.Сделка + " обновлены!");
	//КонецЦикла;   
	//Евросиб - Дубская 12.08.2022 #0255944
	
	СозданныйРеестр = НовРеестр.Ссылка;
	
	Возврат СозданныйРеестр;
	
КонецФункции

&НаСервере
Функция СохранитьНаСервереВагоны()
	
	СозданныйРеестр = Справочники.РеестрыСогласования.ПустаяСсылка();
	
	СтрокиТД = 3;
	
	ПрочСтрока = ТДВагоны.Область("R"+СтрокиТД+"C1").Текст;
	
	НовРеестр = Справочники.РеестрыСогласования.СоздатьЭлемент();
	Вагон = ТДВагоны.Область("R"+СтрокиТД+"C2").Текст;
	
	Пока ПрочСтрока <> "" Цикл
		// если вагона в системе нет, то такую строку не добавлять
		Если НЕ НайтиВагонВСистеме(Вагон) Тогда
			Продолжить;
		Иначе
			НовСтр = НовРеестр.ПереченьВагонов.Добавить();
		КонецЕсли;
		
		СтолбцыТД = 1;
		
		Пока СтолбцыТД<20 Цикл
			
			ТекЯчейка = ТДВагоны.Область("R"+СтрокиТД+"C"+СтолбцыТД).Текст;
			// ищем в справочнике РеестрыСогласования комментарий реквизита с номером = номеру столбца
			РеквизитыТЧ = Метаданные.Справочники.РеестрыСогласования.ТабличныеЧасти.ПереченьВагонов.Реквизиты;
			Для Каждого Рекв Из РеквизитыТЧ Цикл
				Если Рекв.Комментарий = Строка(СтолбцыТД) Тогда
					Если Рекв.Имя = "НомерКонтейнера" Тогда
						ТекЭлем = РаботаСКонтейнерамиСервер.НайтиКТК(СокрЛП(ТекЯчейка)); // Справочники.ТЕ.НайтиПоНаименованию(СокрЛП(ТекЯчейка));
					ИначеЕсли Рекв.Имя = "НомерВагона" Тогда
						ТекЭлем = Справочники.ТС.НайтиПоНаименованию(СокрЛП(ТекЯчейка));
					ИначеЕсли Рекв.Имя = "ДатаНачалаПользования" ИЛИ Рекв.Имя = "ДатаОкончанияПользования" ИЛИ Рекв.Имя = "НачалоПерерываНаРемонт" ИЛИ Рекв.Имя = "ОкончаниеПерерываНаРемонт" Тогда
						Попытка
							ТекЭлем = ПреобразованиеВДату(СокрЛП(ТекЯчейка));
						Исключение
						КонецПопытки;
					ИначеЕсли Рекв.Имя = "СтанцияНачалаСтрока" ИЛИ Рекв.Имя = "СтанцияОкончанияСтрока" Тогда
						НовСтр[СтрЗаменить(Рекв.Имя,"Строка","Справочник")] = ПоискЛокацииВСправочнике(ТекЯчейка);
						ТекЭлем = СокрЛП(ТекЯчейка);
					ИначеЕсли Рекв.Имя = "СтавкаЗаРейсСНДС" ИЛИ Рекв.Имя = "СтавкаЗаРейсБезНДС" Тогда
						Попытка
							ТекЭлем = Число(СтрЗаменить(ТекЯчейка," ",""));
						Исключение
						КонецПопытки;
					ИначеЕсли Рекв.Имя = "СтавкаНДС" Тогда
						Если СокрЛП(ТекЯчейка) = "0" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС0;
						ИначеЕсли СокрЛП(ТекЯчейка) = "" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.БезНДС;
						ИначеЕсли СокрЛП(ТекЯчейка) = "20" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС20;
						ИначеЕсли СокрЛП(ТекЯчейка) = "10" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС10;
						ИначеЕсли СокрЛП(ТекЯчейка) = "18" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС18;  
						// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
						ИначеЕсли СокрЛП(ТекЯчейка) = "5" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС5; 
						ИначеЕсли СокрЛП(ТекЯчейка) = "7" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС7; 
						// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
						//Евросиб СубботинВ #125845 09.12.2025 Начало
                        ИначеЕсли СокрЛП(ТекЯчейка) = "22" Тогда
							ТекЭлем = Перечисления.СтавкиНДС.НДС22;
						//Евросиб СубботинВ #125845 09.12.2025 Конец
						КонецЕсли;
					Иначе
						ТекЭлем = СокрЛП(ТекЯчейка);
					КонецЕсли;
					
					НовСтр[Рекв.Имя] = ТекЭлем;
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			СтолбцыТД = СтолбцыТД+1;
		КонецЦикла;
		
		//НовСтр.ЗаявкаВСистеме = НайтиЗаявкуВСистеме(НовСтр.Контейнер.Наименование,НовСтр.ВнешнийНомерЗаявки,НовСтр.НомерАвто);
		
		СтрокиТД = СтрокиТД + 1;
		ПрочСтрока = ТДВагоны.Область("R"+СтрокиТД+"C1").Текст;
	КонецЦикла;
	
	Если НовРеестр.ПереченьВагонов.Количество() = 0 Тогда
		Возврат СозданныйРеестр;
	КонецЕсли;
	
	// Период реестра - минимальная дата начала пользования и максимальная дата окончания пользования
	ВремТбл = НовРеестр.ПереченьВагонов.Выгрузить();
	ВремТбл.Сортировать("ДатаНачалаПользования ВОЗР");
	ДатаНач = ВремТбл[0].ДатаНачалаПользования;
	ВремТбл.Сортировать("ДатаОкончанияПользования УБЫВ");
	ДатаКон = ВремТбл[0].ДатаОкончанияПользования;
	
	НовРеестр.Клиент = Клиент;
	НовРеестр.Договор = Договор;
	НовРеестр.Организация = Организация;
	НовРеестр.ПериодРеестраНачало = ДатаНач;
	НовРеестр.ПериодРеестраОкончание = ДатаКон;
	//НовРеестр.Наименование = "№ " + Формат(ДатаНач,"ДФ=dd.MM.yy") + "_" + Формат(ДатаКон,"ДФ=dd.MM.yy"); //ДИТ, Беляев СЮ, ..., 09-09-2022, закомментировал	
	НовРеестр.Записать();
	
	Сообщить("Создан реестр " + НовРеестр.Ссылка);
	
	// записать данные в заявку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрыСогласованияПереченьВагонов.ЗаявкаВСистеме КАК ЗаявкаВСистеме,
		|	РеестрыСогласованияПереченьВагонов.Ссылка.Наименование КАК Наименование,
		|	РеестрыСогласованияПереченьВагонов.НомерВагона КАК НомерВагона
		|ИЗ
		|	Справочник.РеестрыСогласования.ПереченьВагонов КАК РеестрыСогласованияПереченьВагонов
		|ГДЕ
		|	РеестрыСогласованияПереченьВагонов.Ссылка = &Ссылка
		|	И НЕ РеестрыСогласованияПереченьВагонов.ЗаявкаВСистеме = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|ИТОГИ ПО
		|	ЗаявкаВСистеме";
	
	Запрос.УстановитьПараметр("Ссылка",НовРеестр.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// сделаем группировку, чтобы одну заявку не записывать много раз
	Пока ВыборкаЗаявка.Следующий() Цикл
	    ТекЗаявка = ВыборкаЗаявка.ЗаявкаВСистеме;
		ПолучОб = ТекЗаявка.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаЗаявка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТЧ = ПолучОб.СоставУслуги;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Вагон",ВыборкаДетальныеЗаписи.НомерВагона);
			НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				НайденныеСтроки[0].РеестрКлиента = ВыборкаДетальныеЗаписи.Наименование;
			КонецЕсли;
		КонецЦикла;
		ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Данные по заявке " + ПолучОб + " обновлены!");
	КонецЦикла;
	//Евросиб - Дубская 12.08.2022 #0255944 
	// обновить данные по сделке
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	СделкаЗаявки.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.РеестрыСогласования.ПереченьВагонов КАК РеестрыСогласованияПереченьВагонов
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
	//	|		ПО РеестрыСогласованияПереченьВагонов.ЗаявкаВСистеме = СделкаЗаявки.Заявка  //было = СделкаЗаявки.Ссылка
	//	|ГДЕ
	//	|	РеестрыСогласованияПереченьВагонов.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка",НовРеестр.Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//ТЗ = РезультатЗапроса.Выгрузить();
	//
	//Для Каждого Стр  Из Тз Цикл
	//	доходы_ЗаполнитьПоЗаявкам2(Стр.Сделка.ПолучитьОбъект());
	//	Сообщить("Данные по сделке " + Стр.Сделка + " обновлены!");
	//КонецЦикла;
	//Евросиб - Дубская 12.08.2022 #0255944
	СозданныйРеестр = НовРеестр.Ссылка;
	
	Возврат СозданныйРеестр;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть("Отмена");
КонецПроцедуры

&НаСервереБезКонтекста
//Функция НайтиЗаявкуВСистеме(Контейнер,ВнешнийНомерЗаявки,НомерАвто)   
//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, добавлены параметры
Функция НайтиЗаявкуВСистеме(Контейнер,ВнешнийНомерЗаявки,НомерАвто, Клиент, Договор) 
	
	ЗаявкаВСистеме = Документы.Заявка.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.НомерКТК.Наименование = &НомерКТК
	               |	И (ЗаявкаСоставУслуги.Ссылка.ВнешнийНомер = &ВнешнийНомер
	               |			ИЛИ ЗаявкаСоставУслуги.НомерАвто = &НомерАвто)
	               |	И НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления 
				   //ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, начало
				   |	И ЗаявкаСоставУслуги.Ссылка.Контрагент = &Контрагент
				   |	И ЗаявкаСоставУслуги.Ссылка.Договор = &Договор
				   //ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, конец
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаСоставУслуги.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("НомерКТК",СокрЛП(Контейнер));
	Запрос.УстановитьПараметр("ВнешнийНомер",СокрЛП(ВнешнийНомерЗаявки));
	Запрос.УстановитьПараметр("НомерАвто",СокрЛП(НомерАвто));
	//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, начало
	Запрос.УстановитьПараметр("Контрагент",Клиент);
	Запрос.УстановитьПараметр("Договор",Договор);
	//ДИТ, Беляев СЮ, Ticket#0284531, 06-09-2022, конец
	
	РЗ = Запрос.Выполнить();
	Если НЕ РЗ.Пустой() Тогда
		ТЗ = РЗ.Выгрузить();
		ЗаявкаВСистеме = ТЗ[0].Ссылка;
	КонецЕсли;
	
	Возврат ЗаявкаВСистеме;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоискЛокацииВСправочнике(НаименованиеЛокации)
	
	ТекЛокация = Справочники.Локации.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛокацииТаблицаСинонимов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации.ТаблицаСинонимов КАК ЛокацииТаблицаСинонимов
	               |ГДЕ
	               |	ЛокацииТаблицаСинонимов.СинонимЛокации ПОДОБНО &Локация";
	Запрос.УстановитьПараметр("Локация",НаименованиеЛокации);
	РЗ = Запрос.Выполнить().Выбрать();
	Если РЗ.Следующий() Тогда
		ТекЛокация = РЗ.Ссылка;
	КонецЕсли;
	
	Возврат ТекЛокация;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПреобразованиеВДату(ТекДата)
	
	Рез = Неопределено;
	
	ТекДата = СокрЛП(ТекДата);	
 	КоличествоСимволов = СтрДлина(ТекДата);
	Год = "";
	Месяц = "";
	День = "";
	Час = 0;
	Минута = 0;
	ЧастьДаты = 0;
	
	Для Сч = 1 По КоличествоСимволов Цикл
		Код = КодСимвола(Сред(ТекДата,Сч)); 
		// Цифры: 48 - 57
		Если Код < 48 ИЛИ Код>57 Тогда 
			// нашли разделитель
			ЧастьДаты = ЧастьДаты + 1;
		Иначе
			// всего есть 3 части даты и 2 части времени. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
			Если ЧастьДаты = 0 Тогда
				День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
			ИначеЕсли ЧастьДаты = 1 Тогда
				Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
			ИначеЕсли ЧастьДаты = 2 Тогда
				Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
			ИначеЕсли ЧастьДаты = 3 Тогда
				Час = Строка(Час) + Строка(Сред(ТекДата,Сч,1));
			ИначеЕсли ЧастьДаты = 4 Тогда
				Минута = Строка(Минута) + Строка(Сред(ТекДата,Сч,1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Год) = 2 Тогда
		Год = Строка("20") + Строка(Год);
	КонецЕсли;
	Если СтрДлина(Месяц) = 1 Тогда
		Месяц = Строка("0") + Строка(Месяц);
	КонецЕсли;
	Если СтрДлина(День) = 1 Тогда
		День = Строка("0") + Строка(День);
	КонецЕсли;
	Если СтрДлина(Час) = 1 Тогда
		Час = Строка("0") + Строка(Час);
	КонецЕсли;
	
	Попытка
		Рез = Дата(Год,Месяц,День,Час,Минута,0);
	Исключение
		Рез = Неопределено;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		Договор = Параметры.Договор;
	КонецЕсли;
	Если Параметры.Свойство("РежимРаботы") Тогда
		РежимРаботы = Параметры.РежимРаботы;
	КонецЕсли;
	Если Параметры.Свойство("Реестр") Тогда
		Реестр = Параметры.Реестр;  
		Если ЗначениеЗаполнено(Реестр) Тогда
			НаименованиеРеестра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реестр, "Наименование");
		КонецЕсли;
	КонецЕсли;
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )


	
&НаСервере
Процедура доходы_ЗаполнитьПоЗаявкам2(СделкаЪ)
	
	УслугаФрахта = Константы.УслугаФрахтаДляКалькуляции.Получить();

	ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СделкаЪ.Организация);
	
	СделкаЪ.Доходы.Очистить();
	СделкаЪ.Расходы.Очистить();
	СделкаЪ.СвязьДоходовИРасходов.Очистить();
	
	ВыгрТЧ = СделкаЪ.СвязьУчетныхЕдиниц.Выгрузить();
	
	// выборка "особых" контрагентов (у которых фин доки формируются по-особому)
	ЗапросК = Новый Запрос;
	ЗапросК.Текст = "ВЫБРАТЬ
	                |	ФормированиеФинДокументов.Контрагент КАК Контрагент
	                |ИЗ
	                |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов";
	МассивКонтраг = ЗапросК.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	// вводится группировка по реестру клиента. если заполнение ведется по особым клиентам, то
	// идет детализация до вагона/контейнера. Если обычные клиенты, то номера вагонов/контейнеров не нужны,
	// поэтому это будут пустые строки, чтобы результат запроса "свернуть" по ключевым полям.
	// признаком обычного или нет расчета является заполненность поля реестр клиента и наличие клиента в массиве клиентов.
	// интересуют только те записи, у которых влаг НеАктивна НЕ стоит
	////////// ВНИМАНИЕ!!!!!!!!!!!! Запрос не откроется конструктором, т.к. в отборе присутствуют обращения к полям через точку от калькуляции (например, ВТ.Калькуляция.СтавкаНДС)
	// Чтобы открыть конструктором нужно закомментировать поля вида "ВТ.Калькуляция.СтавкаНДС"
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ВыгрТЧ.Калькуляция КАК Калькуляция,
	                |	ВыгрТЧ.Клиент КАК Клиент,
	                |	ВыгрТЧ.Договор КАК Договор,
	                |	ВыгрТЧ.Контейнер КАК Контейнер,
	                |	ВыгрТЧ.Вагон КАК Вагон,
	                |	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
	                |	ВыгрТЧ.Груз КАК Груз
	                |ПОМЕСТИТЬ ВТ
	                |ИЗ
	                |	&ВыгрТЧ КАК ВыгрТЧ
	                |ГДЕ
	                |	НЕ ВыгрТЧ.НеАктивна
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	                |	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
	                |	СУММА(ВЫБОР КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """" И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент) ТОГДА 1 Иначе 0 КОНЕЦ) КАК ЛишниеДанные
	                |ПОМЕСТИТЬ ТекЗаявка
	                |ИЗ
	                |	Документ.Сделка.Заявки КАК СделкаЗаявки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	                |		ПО СделкаЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	                |ГДЕ
	                |	СделкаЗаявки.Ссылка = &Ссылка
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаявкаСоставУслуги.НомерКТК,
					|	ЗаявкаСоставУслуги.РеестрКлиента
	                |ИМЕЮЩИЕ 
	                |	СУММА(ВЫБОР КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """" И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент) ТОГДА 1 Иначе 0 КОНЕЦ)=0
					|;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ.Калькуляция КАК Калькуляция,
	                |	ВТ.Клиент КАК Клиент,
	                |	ВТ.Договор КАК Договор,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Контейнер
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК Контейнер,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ТекЗаявка.РеестрКлиента
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК РеестрКлиента,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Вагон
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК Вагон,
	                |	СУММА(ВЫБОР
	                |			КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |					ИЛИ ВТ.Клиент В (&Клиент)
	                |				ТОГДА 0
	                |			ИНАЧЕ 1
	                |		КОНЕЦ) КАК ОбычныйРасчет,
	                |	ВТ.РазмерКТК КАК РазмерКТК,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоСебестоимость20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСебестоимость КОНЕЦ) КАК Себестоимость,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоВознаграждение20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоВознаграждение КОНЕЦ) КАК Вознаграждение,
	                |	СУММА(ВЫБОр КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20) ТОГДА ВТ.Калькуляция.ММ_ИтогоСтавка20 ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСтавка КОНЕЦ) КАК Ставка,
	                |	ВТ.Калькуляция.СтавкаНДС КАК СтавкаНДС,
	                |	ВТ.Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	                |	ВТ.Калькуляция.Валюта КАК Валюта,
	                |	ВТ.Груз КАК Груз
	                |	ПОМЕСТИТЬ Итоговая
	                |ИЗ
	                |	ВТ КАК ВТ
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекЗаявка КАК ТекЗаявка
	                |		ПО ВТ.Контейнер = ТекЗаявка.НомерКТК
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ.Калькуляция,
	                |	ВТ.Клиент,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Вагон
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ВТ.Договор,
	                |	ВТ.Груз,
	                |	ВТ.Калькуляция.СтавкаНДС,
	                |	ВТ.Калькуляция.СуммаВключаетНДС,
	                |	ВТ.Калькуляция.Валюта,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ВТ.Контейнер
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ВТ.РазмерКТК,
	                |	ВЫБОР
	                |		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	                |				И ВТ.Клиент В (&Клиент)
	                |			ТОГДА ТекЗаявка.РеестрКлиента
	                |		ИНАЧЕ """"
	                |	КОНЕЦ
					|;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Итоговая.Калькуляция КАК Калькуляция,
	                |	Итоговая.Клиент КАК Клиент,
	                |	Итоговая.Договор КАК Договор,
	                |	Итоговая.Контейнер КАК Контейнер,
	                |	Итоговая.РеестрКлиента КАК РеестрКлиента,
	                |	Итоговая.Вагон КАК Вагон,
	                |	Итоговая.ОбычныйРасчет КАК ОбычныйРасчет,
	                |	Итоговая.РазмерКТК КАК РазмерКТК,
	                |	Итоговая.Себестоимость КАК Себестоимость,
	                |	Итоговая.Вознаграждение КАК Вознаграждение,
	                |	Итоговая.Ставка КАК Ставка,
	                |	Итоговая.СтавкаНДС КАК СтавкаНДС,
	                |	Итоговая.СуммаВключаетНДС КАК СуммаВключаетНДС,
	                |	Итоговая.Валюта КАК Валюта,
	                |	Итоговая.Груз КАК Груз
	                |ИЗ
	                |	Итоговая КАК Итоговая
	                |	 
	                |ИТОГИ ПО
	                |	РеестрКлиента";
	
	Запрос2.УстановитьПараметр("Клиент", МассивКонтраг);
	Запрос2.УстановитьПараметр("Ссылка", СделкаЪ.Ссылка);
	Запрос2.УстановитьПараметр("ВыгрТЧ", ВыгрТЧ);
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	ВыборкаРеестрКлиента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРеестрКлиента.Следующий() Цикл
		// если по выборке это НЕ обычный (=0) и номер реестра не заполнен, то данные по доходам/расходам в сделку не вносить.
		// для "особых" клиентов должен быть заполнен номер реестра в заявке, чтобы можно было по нему группировать
		Если ВыборкаРеестрКлиента.ОбычныйРасчет = 0 И
			(ВыборкаРеестрКлиента.РеестрКлиента = "" ИЛИ ВыборкаРеестрКлиента.РеестрКлиента = null) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаРеестрКлиента.Выбрать();
		///////////////////// доходная часть ////////////////////////////
		// Если это расчет для особых клиентов, тогда добавлять строки нужно один раз. 
		// для контроля используем проверку ДанныеДобавлены
		ДанныеДобавлены = Ложь;
		Если НЕ ВыборкаРеестрКлиента.РеестрКлиента = "" Тогда
			СписокКТКЪ = "";
			СписокВагоновЪ = "";
			Колво = 0;
			
			НСтр = СделкаЪ.Доходы.Добавить();  
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			НСтрДоходыКТК = СделкаЪ.ДоходыКТК.Добавить();
			//НСтрДоходыВагоны = СделкаЪ.ДоходыВагоны.Добавить();
		КонецЕсли;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаРеестрКлиента.РеестрКлиента = "" Тогда
				СписокКТКЪ = "";
				СписокВагоновЪ = "";
				Колво = 0;
				НСтр = СделкаЪ.Доходы.Добавить();  
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
				НСтрДоходыКТК = СделкаЪ.ДоходыКТК.Добавить();
				//НСтрДоходыВагоны = СделкаЪ.ДоходыВагоны.Добавить();
			КонецЕсли;
			// после первого добавления меняем признак ДанныеДобавлены на Истина, чтобы больше в этот блок не заходить
			Если НЕ ДанныеДобавлены Тогда
				ЗаполнитьЗначенияСвойств(НСтр,ВыборкаДетальныеЗаписи);
				// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 (( 
				НСтр.Услуга = ВыборкаДетальныеЗаписи.Калькуляция.ОсновнаяУслуга;
				//НСтр.Услуга = ВыборкаДетальныеЗаписи.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
				// Евросиб Рыбьяков К.А. 02.07.2024 ))	
				НСтр.Перевыставляемая = НСтр.Услуга.Перевыставляемая;
				НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
				НСтрДоходыКТК.ГУИД = НСтр.ГУИД;
				ДанныеДобавлены = Истина;
			КонецЕсли;
			// для обычного расчета (когда клиенты не входят в справочник ФормированиеФинДокументов) номера вагонов и контейнров
			// возьмем из ТЧ СвязьУчетныхЕдиниц по отбору из основного запроса.
			Если НЕ ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 Тогда
				ПараметрыОтбора = Новый Структура("Клиент, Договор, Груз, Калькуляция, РазмерКТК", ВыборкаДетальныеЗаписи.Клиент, ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Груз, ВыборкаДетальныеЗаписи.Калькуляция, ВыборкаДетальныеЗаписи.РазмерКТК);
				Для каждого СтрСоставПоезда из СделкаЪ.СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыОтбора) Цикл
					НСтрДоходыКТК.КТК = НСтрДоходыКТК.КТК + ?(НСтрДоходыКТК.КТК = "", "", ";") + СтрСоставПоезда.Контейнер.Наименование;
					//НСтр.СписокВагонов = НСтр.СписокВагонов + ?(НСтр.СписокВагонов = "", "", ";") + СтрСоставПоезда.Вагон.Наименование;
					НСтр.Количество = НСтр.Количество + 1;
				КонецЦикла;
				// для особого расчета данные по КТК и вагонам есть в самом результате запроса
			Иначе	
				СписокКТКЪ = СписокКТКЪ + ?(СписокКТКЪ = "", "", ";") + ВыборкаДетальныеЗаписи.Контейнер.Наименование;
				СписокВагоновЪ = СписокВагоновЪ + ?(СписокВагоновЪ = "", "", ";") + ВыборкаДетальныеЗаписи.Вагон.Наименование;
				Колво = Колво + 1;
			КонецЕсли;
			// для особого расчета итого по КТК ндо выдавать за пределами детальных записей, т.к. идет суммирование по результату запроса,
			// а не отбором по таблице СвязьУчетныхЕдиниц как в случае обычного расчета
			Если ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 Тогда
				НСтрДоходыКТК.КТК = СписокКТКЪ;
				//НСтр.СписокВагонов = СписокВагоновЪ;
				НСтр.Количество = Колво;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//////////////// ЗАПРОС ДЛЯ РАСХОДОВ ////////////////
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыгрТЧ.Калькуляция КАК Калькуляция,
	               |	ВыгрТЧ.Количество КАК Количество,
	               |	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
	               |	ВыгрТЧ.Груз КАК Груз,
	               |	ВыгрТЧ.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВыгрТЧ КАК ВыгрТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыгрДоходыКТК.ГУИД КАК ГУИД,
	               |	ВыгрДоходыКТК.КТК КАК СписокКТК
	               |ПОМЕСТИТЬ ВТДоходыКТК
	               |ИЗ
	               |	&ВыгрДоходыКТК КАК ВыгрДоходыКТК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Поставщик КАК Поставщик,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Договор КАК Договор,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Цена20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Цена40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта КАК Валюта,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Контрагент КАК море20_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Себестоимость КАК море20_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Контрагент КАК море40_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Себестоимость КАК море40_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	               |	ВТ.Количество КАК Количество,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.Перевыставляемая КАК Перевыставляемая,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40
	               |	КОНЕЦ КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40
	               |	КОНЕЦ * ВТ.Количество КАК ВознаграждениеИтого,
	               |	ВТ.Груз КАК Груз,
	               |	ВТ.ГУИД КАК ГУИДДоход,
	               |	ВТ.РазмерКТК КАК РазмерКТК,
	               |	ВТДоходыКТК.СписокКТК КАК СписокКТК
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	               |		ПО ВТ.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходыКТК КАК ВТДоходыКТК
	               |		ПО ВТ.ГУИД = ВТДоходыКТК.ГУИД";
	
	Запрос.УстановитьПараметр("ВыгрТЧ", СделкаЪ.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("ВыгрДоходыКТК", СделкаЪ.ДоходыКТК.Выгрузить());
	Ответ = Запрос.Выполнить().Выбрать();
	// потом расходы 1.3
	Пока Ответ.Следующий() Цикл
		
		НСтр2 = СделкаЪ.Расходы.Добавить();
		НСтрДоходыКТК = СделкаЪ.ДоходыКТК.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр2,Ответ);
		НСтр2.ГУИД = Строка(Новый УникальныйИдентификатор);
		НСтрДоходыКТК.ГУИД = НСтр2.ГУИД;
		НСтрДоходыКТК.КТК = Ответ.СписокКТК;
		НСтр2.ПериодВО = ГлобальныйОткрытыйПериод;
		
		НСтр5 = СделкаЪ.СвязьДоходовИРасходов.Добавить();
		НСтр5.Доходы = Ответ.ГУИДДоход;
		НСтр5.Расходы = НСтр2.ГУИД;
		
		// теперь расходы фрахт
		Если Ответ.РазмерКТК = Справочники.РазмерыКТК.К20 И Ответ.море20_Себестоимость > 0 ИЛИ Ответ.РазмерКТК <> Справочники.РазмерыКТК.К20 И Ответ.море40_Себестоимость > 0 Тогда
			
			НСтр3 = СделкаЪ.Расходы.Добавить();
			НСтрДоходыКТК2 = СделкаЪ.ДоходыКТК.Добавить();
			НСтр3.ГУИД = Строка(Новый УникальныйИдентификатор);
			НСтрДоходыКТК2.ГУИД = НСтр3.ГУИД;
			НСтрДоходыКТК2.КТК = Ответ.СписокКТК;
			НСтр3.Поставщик = ?(Ответ.РазмерКТК = Справочники.РазмерыКТК.К20, Ответ.Калькуляция.море20_Контрагент, Ответ.Калькуляция.море40_Контрагент);
			НСтр3.Услуга = УслугаФрахта;
			НСтр3.Перевыставляемая = НСтр3.Услуга.Перевыставляемая;
			НСтр3.Калькуляция = Ответ.Калькуляция;
			НСтр3.Себестоимость = ?(Ответ.РазмерКТК = Справочники.РазмерыКТК.К20, Ответ.Калькуляция.море20_Себестоимость, Ответ.Калькуляция.море40_Себестоимость);
			НСтр3.ВознаграждениеИтого = Ответ.Калькуляция.море20_Вознаграждение * Ответ.Количество;
			НСтр3.Количество = Ответ.Количество;
			НСтр3.Груз = Ответ.Груз;
			НСтр3.ПериодВО = ГлобальныйОткрытыйПериод;
			НСтр3.Валюта = Ответ.ММ_ВалютаФрахтовыхСтавок;
			
			НСтр4 = СделкаЪ.СвязьДоходовИРасходов.Добавить();
			НСтр4.Доходы = Ответ.ГУИДДоход;
			НСтр4.Расходы = НСтр3.ГУИД;
			
		КонецЕсли;
	КонецЦикла;
	
	СделкаЪ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Договор = УстановитьДоговорКлиента(Клиент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьДоговорКлиента(КлиентЪ)
	
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец
				   |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец",КлиентЪ);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		Договор = ТЗ[0].Ссылка;
	КонецЕсли;
	
	Возврат Договор;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РежимРаботы = "Контейнеры" Тогда
		Элементы.Группа6.Видимость = Истина;
		Элементы.Группа7.Видимость = Ложь;
	Иначе
		Элементы.Группа6.Видимость = Ложь;
		Элементы.Группа7.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТДВагоныПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	СтрокиТД = 3;

	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл 
		ЧислаМ.Добавить(Строка(Сч)); 
	КонецЦикла;
	
	СохраненныйБелый = ТДВагоны.Область("R1C20").ЦветФона;
	
	Контейнер = ТДВагоны.Область("R"+СтрокиТД+"C18").Текст;
	Вагон = ТДВагоны.Область("R"+СтрокиТД+"C2").Текст;
	СтнНач = ТДВагоны.Область("R"+СтрокиТД+"C3").Текст;
	СтнКон = ТДВагоны.Область("R"+СтрокиТД+"C4").Текст;
	
	Пока Вагон <> "" Цикл
		
		// проверка контейнера
		Если СтрДлина(СокрЛП(Контейнер)) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(Контейнер,4), Сред(Контейнер,5,6));
		КонецЕсли;
		
		// если контрольный знак не совпал
		Если СтрДлина(СокрЛП(Контейнер)) <> 11  
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(СокрЛП(Контейнер),1)) = неопределено  
			ИЛИ (СтрДлина(СокрЛП(Контейнер)) = 11 И НЕ Число(Прав(СокрЛП(Контейнер),1)) = КонтрольныйЗнак) Тогда
			ТДВагоны.Область("R"+СтрокиТД+"C18").ЦветФона = WebЦвета.Розовый;
		// если не нашли контейнер, то подсветить номер
		ИначеЕсли НЕ НайтиКТКВСистеме(Контейнер) Тогда
			ТДВагоны.Область("R"+СтрокиТД+"C18").ЦветФона = WebЦвета.Голубой;
		Иначе
			ТДВагоны.Область("R"+СтрокиТД+"C18").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		// проверка Станции начала
		Если ПоискЛокацииВСправочнике(СтнНач) = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка") Тогда
			ТДВагоны.Область("R"+СтрокиТД+"C3").ЦветФона = WebЦвета.Голубой;
		Иначе
			ТДВагоны.Область("R"+СтрокиТД+"C3").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		// проверка Станции окончания
		Если ПоискЛокацииВСправочнике(СтнКон) = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка") Тогда
			ТДВагоны.Область("R"+СтрокиТД+"C4").ЦветФона = WebЦвета.Голубой;
		Иначе
			ТДВагоны.Область("R"+СтрокиТД+"C4").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		// проверка вагона
		Если НЕ НайтиВагонВСистеме(Вагон) Тогда
			ТДВагоны.Область("R"+СтрокиТД+"C2").ЦветФона = WebЦвета.Голубой;
		Иначе
			ТДВагоны.Область("R"+СтрокиТД+"C2").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		СтрокиТД = СтрокиТД + 1;
		Вагон = ТДВагоны.Область("R"+СтрокиТД+"C2").Текст;
		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиКТКВСистеме(КТК)
	
	Возврат РаботаСКонтейнерамиСервер.НайтиКТК(КТК) <> неопределено;
	
	//КТКЕсть = Ложь;
	//Если НЕ Справочники.ТЕ.НайтиПоНаименованию(КТК) = Справочники.ТЕ.ПустаяСсылка() Тогда
	//	КТКЕсть = Истина;
	//КонецЕсли;
	//Возврат КТКЕсть;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВагонВСистеме(Ваг)
	ВагЕсть = Ложь;
	Если НЕ Справочники.ТС.НайтиПоНаименованию(Ваг) = Справочники.ТС.ПустаяСсылка() Тогда
		ВагЕсть = Истина;
	КонецЕсли;
	Возврат ВагЕсть;
КонецФункции

