//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	Если НЕ Объект.ПометкаУдаления И Объект.Основной Тогда
		СообщениеДляПользователя = ПолучитьРезультатПроверкиНаличияОсновногоСчетаПоВалюте();
		Если НЕ ПустаяСтрока(СообщениеДляПользователя) Тогда
			ПоказатьПредупреждение(,СообщениеДляПользователя);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец

//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
&НаСервере
Функция ПолучитьРезультатПроверкиНаличияОсновногоСчетаПоВалюте()
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Возврат СправочникОбъект.ПроверитьНаличиеОсновногоСчетаПоВалюте();	
КонецФункции                                
//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец  

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
