
&НаКлиенте
Процедура ТегПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Тег) И Объект.Теги.НайтиСтроки(Новый Структура("Тег", Тег)).Количество() = 0 Тогда
		Объект.Теги.Добавить().Тег = Тег;
		ПерерисоватьДинамическуюЧасть();
	КонецЕсли;
	Тег = неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПерерисоватьДинамическуюЧасть()
	
	ГДЧ = Элементы.ГруппаДинамическаяЧасть;
	
	ПодчЭлементы = Новый Массив;
	Для каждого Стр из ГДЧ.ПодчиненныеЭлементы Цикл ПодчЭлементы.Добавить(Стр); КонецЦикла;
	Для каждого Элем из ПодчЭлементы Цикл
		Элементы.Удалить(Элем);
	КонецЦикла;
	
	Для каждого Стр из Объект.Теги Цикл
		ДанныеТега = ПолучитьДанныеТега(Стр.Тег);
		НЭлемент = Элементы.Добавить("Стр"+ДанныеТега.Код, Тип("ДекорацияФормы"), ГДЧ);
		НЭлемент.Заголовок = ДанныеТега.Наименование;
		НЭлемент.ЦветФона = Новый Цвет(ДанныеТега.ЦветR, ДанныеТега.ЦветG, ДанныеТега.ЦветB);
		НЭлемент.Гиперссылка = Истина;
		НЭлемент.УстановитьДействие("Нажатие", "ОбработкаНажатияТега");
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТега(Тег)
	
	Возврат Новый Структура("Код, Наименование, ЦветR, ЦветG, ЦветB", Тег.Код, Тег.Наименование, Тег.Цвет.Цвет_R, Тег.Цвет.Цвет_G, Тег.Цвет.Цвет_B);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаНажатияТега(Параметр1 = неопределено, Параметр2 = неопределено)
	
	КодУдаляемогоТега = Сред(Параметр1.Имя, 4);
	ОпОп = Новый ОписаниеОповещения("СогласиеНаУдалениеТега", ЭтаФорма, КодУдаляемогоТега);
	ПоказатьВопрос(ОпОп, "Удалить выбранный тег?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаУдалениеТега(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да И Параметр2 <> неопределено Тогда
		ТегСсылка = ПолучитьТегПоКоду(Параметр2);
		Для каждого Стр из Объект.Теги Цикл
			Если Стр.Тег = ТегСсылка Тогда Объект.Теги.Удалить(Стр); Прервать; КонецЕсли;
		КонецЦикла;
		ПерерисоватьДинамическуюЧасть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТегПоКоду(КодТега)
	Возврат Справочники.Теги.НайтиПоКоду(КодТега);
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МассивВариантовПереносаДляЗамены = Новый Массив;
	Для Сч = 2 по 9 Цикл
		Строка = "";
		Для Сч3 = Сч По 10 Цикл
			Строка = Строка + Символы.ПС;
		КонецЦикла;
		МассивВариантовПереносаДляЗамены.Добавить(Строка);
	КонецЦикла;
	
	Для каждого Стр из МассивВариантовПереносаДляЗамены Цикл
		
		ТекстЗамечания = СтрЗаменить(ТекстЗамечания, Стр, Символы.ПС+Символы.ПС);
		
	КонецЦикла;
	
	МассивАбзацев = СтрРазделить(СтрЗаменить(ТекстЗамечания, Символы.ПС+Символы.ПС, Символы.НПП), Символы.НПП, Истина);
	Объект.Абзацы.Очистить();
	Для каждого Стр из МассивАбзацев Цикл
		Объект.Абзацы.Добавить().Абзац = Стр;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр из Объект.Абзацы цикл
		
		ТекстЗамечания = ТекстЗамечания + ?(ТекстЗамечания = "", "", Символы.ПС+Символы.ПС) + Стр.Абзац;
		
	КонецЦикла;
	
	ПерерисоватьДинамическуюЧасть();
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )


