
&НаКлиенте
Процедура ПериодОтчетаФНСРегулирование(Элемент, Направление, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Объект.УдалитьДатаОтчетаДляФНС = НачалоКвартала(ДобавитьМесяц(Объект.УдалитьДатаОтчетаДляФНС, Направление*3));
	Модифицированность = Истина;
	
	ПериодОтчетаФНС = Формат(Объект.УдалитьДатаОтчетаДляФНС, "ДФ='к""кв."" гггг""г.""'");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")  Тогда
		Если ЗначениеЗаполнено(Объект.Продавец) Тогда
			Элементы.Продавец.Видимость = Истина;
		КонецЕсли;
		Элементы.СводныйКомиссионный.Видимость = Истина;
	КонецЕсли;
	
	ОбновитьОтображение();
	
	Элементы.Валюта.Заголовок = Объект.ВалютаДокумента;
	Элементы.ВалютаУвеличения.Заголовок = Объект.ВалютаДокумента;
	Элементы.ВалютаУменьшения.Заголовок = Объект.ВалютаДокумента;
	//Если Объект.Выставлен Тогда
	//	 Элементы.Шапка.ТолькоПросмотр = Истина;
	//	 Элементы.Группа1.ТолькоПросмотр = Истина;
	//	 Элементы.ДанныеКорректировки.ТолькоПросмотр = Истина;
	//	 Элементы.ВыставлениеСчетаФактуры.ТолькоПросмотр = Истина;
	//	 Элементы.Итоги.ТолькоПросмотр = Истина;
	// КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Продавец) Тогда
		Элементы.Продавец.Видимость = Истина;
	КонецЕсли;
	Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	
	//Евросиб Каблов 26.09.2020
	//ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
	//Гудкова Элементы.ОбновитьОткрытыйПериод.Доступность = НЕ ПроверкаДоступнотиПоПериоду();
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступнотиПоПериоду()
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО,Объект.Организация);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Объект.Комментарий = "ОТКАЗ" Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);

	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ГруппаВыставлен.ТолькоПросмотр = Истина;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0390901, 19-03-2025, начало
		Элементы.Номер.ТолькоПросмотр = Истина;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0390901, 19-03-2025, конец
	КонецЕсли;
	//ОбработатьБлокировкуДокумента();	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 22.07.2020 )
	
	ПериодОтчетаФНС = ?(ЗначениеЗаполнено(Объект.УдалитьДатаОтчетаДляФНС), Формат(Объект.УдалитьДатаОтчетаДляФНС, "ДФ='к""кв."" гггг""г.""'"), "");
	
//Евросиб Гудкова( 21.04.2021 Ticket№ 0203749
	ПСЦ = ПолучитьПСЦПоУчДокументу(Объект.ДокументОснование);
// Евросиб Гудкова) 	

    // Евросиб Фролов (01.12.2021 Task №43170
	НастроитьДоступностьФрахта();
	// Евросиб Фролов)


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	

//Евросиб Гудкова( 21.04.2021 Ticket№ 0203749
&НаСервере
Функция	ПолучитьПСЦПоУчДокументу(ДокументОснование)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СделкаДоходы.ПСЦ КАК ПСЦ
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК СделкаДоходы
	               |ГДЕ
	               |	СделкаДоходы.УчДокумент = &УчДокумент";
	Запрос.УстановитьПараметр("УчДокумент", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПСЦ;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции
// Евросиб Гудкова) 	

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//Оп = Новый ОписаниеОповещения("ОповещениеВыбораПериодаЗавершение",ЭтотОбъект);
	//Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	//Диалог.Показать(Оп); 

КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВыбораПериодаЗавершение(Период3, ДополнительныеПараметры) Экспорт

//	Если Период3 = неопределено Тогда Возврат; КонецЕсли;
//	
//	Период = Формат(Период3.ДатаНачала,"ДФ='ММММ гггг'") + " г.";
//	
//	Объект.ПериодВО = Период3.ДатаНачала;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	//Евросиб Каблов 29.04.2021 ( Ticket#0230016
	//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
	//Евросиб Каблов 29.04.2021 )
	//Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";

КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//Евросиб Каблов 26.09.2020 (
	////Евросиб Каблов 22.07.2020 ( TASK 23506
	//ОбработатьБлокировкуДокумента();	
	////Евросиб Каблов 22.07.2020 )
	//Евросиб Каблов 26.09.2020 )
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФВ(ПараметрыЗапроса, Объект.Дата);

		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	

	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФВ(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьТолькоПросмотр(Команда)
	
	Элементы.Шапка.ТолькоПросмотр 					= Ложь;
	Элементы.Группа1.ТолькоПросмотр 				= Ложь;
	Элементы.ДанныеКорректировки.ТолькоПросмотр 	= Ложь;
	Элементы.ВыставлениеСчетаФактуры.ТолькоПросмотр 	= Ложь;
	Элементы.Итоги.ТолькоПросмотр 					= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОткрытыйПериод(Команда)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	
КонецПроцедуры


&НаКлиенте
Процедура Исправление1ПриИзменении(Элемент)
	
	ОбновитьОтображение();

КонецПроцедуры


&НаКлиенте
Процедура ВидСчетаФактурыПриИзменении(Элемент)
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()

	Если Объект.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.Корректировочный") Тогда
		Объект.ПлатежноРасчетныеДокументы.Очистить(); 
		Элементы.ПлатежноРасчетныйДокумент.Видимость = Ложь;
		Элементы.ДанныеКорректировки.Видимость = Истина;
		Элементы.ДокументыОснованияКорректировка.Видимость = Истина;
		Элементы.Исправление.Видимость = Истина;
		Элементы.ИсправляемыйСчетФактура.Видимость = Ложь;
		Элементы.НомерИсправления.Видимость = Объект.Исправление;
		Элементы.ИсправляемыйКорретировочный.Видимость = Объект.Исправление;
	Иначе	
		Элементы.ПлатежноРасчетныйДокумент.Видимость = Истина;
		Элементы.ДанныеКорректировки.Видимость = Ложь;
		Элементы.ИсправляемыйКорретировочный.Видимость = Ложь;
		Элементы.ДокументыОснованияКорректировка.Видимость = Ложь;
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Элементы.Исправление.Видимость = Истина;
			Элементы.ИсправляемыйСчетФактура.Видимость = Объект.Исправление;
			Элементы.НомерИсправления.Видимость = Объект.Исправление;
		Иначе
			Элементы.Исправление.Видимость = Ложь;
			Элементы.ИсправляемыйСчетФактура.Видимость = Ложь;
			Элементы.НомерИсправления.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли; 

	ОбновитьОтображениеНДС0();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Элементы.ДокументыОснования.ТекущиеДанные.НомерСтроки = 1 Тогда
	
		Объект.ДокументОснование = Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНДС0()
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Начало 26.05.2025
	Элементы.СтраницаИтогПодтвержденияНДС0.Видимость = Объект.СуммаНДСДокумента = 0;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Конец 26.05.2025

	Если Объект.СуммаНДСДокумента = 0 Тогда
		Элементы.ДанныеДляФНС.Видимость = Истина;  
	Иначе
		Элементы.ДанныеДляФНС.Видимость = Ложь;  
		Возврат;
	КонецЕсли; 
	
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025  
	// реквизит перенесен в тч, на форме Подтверждения 
	// Было:
	//Если Объект.УдалитьВключатьВОтчетДляФНС Тогда
	//	Элементы.ПериодОтчетаФНС.Видимость = Истина;
	//	Элементы.ПериодОтчетаФНС.ОтметкаНезаполненного = Истина;
	//	Элементы.ПериодОтчетаФНС.АвтоОтметкаНезаполненного = Истина;
	//Иначе
	//	Элементы.ПериодОтчетаФНС.Видимость = Ложь;
	//	Элементы.ПериодОтчетаФНС.ОтметкаНезаполненного = Ложь;
	//КонецЕсли;
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025
		
	Если Объект.НеВключатьВОтчетПоДолгамНДС Тогда
		Элементы.ПричинаИсключенияИзОтчетаПоДолгамНДС0.Видимость = Истина;
		Элементы.ПричинаИсключенияИзОтчетаПоДолгамНДС0.ОтметкаНезаполненного = Истина;
		Элементы.ПричинаИсключенияИзОтчетаПоДолгамНДС0.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ПричинаИсключенияИзОтчетаПоДолгамНДС0.Видимость = Ложь;
		Элементы.ПричинаИсключенияИзОтчетаПоДолгамНДС0.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Начало 26.05.2025
	//Было:
	//СтрокиБезДокументов = Объект.ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("ДокументыЕсть", Ложь));
	//Если (Объект.ПодтверждающиеДокументы.Количество() > 0 И СтрокиБезДокументов.Количество() = 0)
	//	ИЛИ Объект.Фрахт Тогда
	//	Элементы.ДатаПолногоПодтвержденияНДС0.ТолькоПросмотр = Ложь;
	//Иначе 	
	//	Элементы.ДатаПолногоПодтвержденияНДС0.ТолькоПросмотр = Истина;
	//КонецЕсли;
	//Стало:
	ЗаполнитьИтоговыеДанныеПодтвержденияНДС0();
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Конец 26.05.2025
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Начало 26.05.2025    
&НаСервере
Процедура ЗаполнитьИтоговыеДанныеПодтвержденияНДС0()

	ИтоговаяТаблицаПеречняГТД.Очистить();  
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) 
		или Объект.СуммаНДСДокумента <> 0 Тогда
	    Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВключатьВОтчетДляФНС КАК ВключатьВОтчетДляФНС,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СуммаПоКТК КАК Сумма,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС
		|ПОМЕСТИТЬ ВТ_ВсеПодтвержедние
		|ИЗ
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = &Ссылка
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Авто 
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Фрахт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйМорскойТранспорт.ВключатьВОтчетДляФНС,
		|	СчетФактураВыданныйМорскойТранспорт.СуммаПоКТК,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС
		|ИЗ
		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
		|ГДЕ
		|	СчетФактураВыданныйМорскойТранспорт.Ссылка = &Ссылка
		|	И СчетФактураВыданныйМорскойТранспорт.Ссылка.Фрахт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйАвтоТранпорт.ВключатьВОтчетДляФНС,
		|	СчетФактураВыданныйАвтоТранпорт.Сумма,
		|	СчетФактураВыданныйАвтоТранпорт.ДатаОтчетаДляФНС
		|ИЗ
		|	Документ.СчетФактураВыданный.АвтоТранпорт КАК СчетФактураВыданныйАвтоТранпорт
		|ГДЕ
		|	СчетФактураВыданныйАвтоТранпорт.Ссылка = &Ссылка
		|	И СчетФактураВыданныйАвтоТранпорт.Ссылка.Авто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПодтвержедние.ВключатьВОтчетДляФНС КАК ВключеноВОтчет,
		|	СУММА(ВТ_ВсеПодтвержедние.Сумма) КАК Сумма,
		|	ВТ_ВсеПодтвержедние.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС
		|ИЗ
		|	ВТ_ВсеПодтвержедние КАК ВТ_ВсеПодтвержедние
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеПодтвержедние.ВключатьВОтчетДляФНС,
		|	ВТ_ВсеПодтвержедние.ДатаОтчетаДляФНС
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ВсеПодтвержедние.Сумма) <> 0";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если не РезультатЗапроса.Пустой() Тогда
		ИтоговаяТаблицаПеречняГТД.Загрузить(РезультатЗапроса.Выгрузить());	
	КонецЕсли;

КонецПроцедуры

// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
//реквизит перенесен в ТЧ в форму Подтверждения
// Было:
//&НаКлиенте
//Процедура ВключатьВОтчетДляФНСПриИзменении(Элемент)
//	
//	//++ДИТ_Коробов_Task 46790_24.02.22
//    Если НЕ РазрешеноУстановитьФлаг() Тогда
//		Возврат;
//	КонецЕсли;
//	//--ДИТ_Коробов_Task 46790_24.02.22
//	
//	Если Объект.УдалитьВключатьВОтчетДляФНС Тогда
//		Если Не ЗначениеЗаполнено(Объект.УдалитьДатаПолногоПодтвержденияНДС0) Тогда
//			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата полного подтверждения НДС 0%. Включение в отчет для ФНС запрещено.");
//			Объект.УдалитьВключатьВОтчетДляФНС = Ложь;
//			Возврат;
//		КонецЕсли; 
//		Если Не ЗначениеЗаполнено(Объект.УдалитьДатаОтчетаДляФНС) Тогда
//			Объект.УдалитьДатаОтчетаДляФНС = ДобавитьМесяц(ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ДатаПоследнегоСданногоОтчетаНДС0ВФНС"), 3); 
//			ПериодОтчетаФНС = Формат(Объект.УдалитьДатаОтчетаДляФНС, "ДФ='к""кв."" гггг""г.""'");
//		КонецЕсли; 
//	Иначе	
//		Объект.УдалитьДатаОтчетаДляФНС = Неопределено;
//		ПериодОтчетаФНС = "";
//	КонецЕсли;
//	ОбновитьОтображениеНДС0();
//	
//КонецПроцедуры

//++ДИТ_Коробов_Task 46790_24.02.22
Функция РазрешеноУстановитьФлаг()
	Если Объект.УдалитьВключатьВОтчетДляФНС Тогда 
		ДокОснование = Объект.ДокументОснование;
		Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда 
			Возврат Истина;
		КонецЕсли; 
		МассивКорректировок = КорректировкиРТУСервер.ПолучитьКорректировкуПоОснованию(ДокОснование.Ссылка);
		Если МассивКорректировок.Количество()>0 Тогда
			Для Каждого КорректировкаПоОснованию из МассивКорректировок Цикл 
				Если КорректировкаПоОснованию.ПометкаУдаления Тогда 
					Продолжить;
				КонецЕсли;
				Если КорректировкаПоОснованию.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
					ДокИСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(КорректировкаПоОснованию);
					Если ЗначениеЗаполнено( ДокИСФ ) Тогда 
						Сообщить("Не забудьте установить отметку, в связанной корректировке по согласованию, ИСФ: "
						+ ДокИСФ );	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Пока Истина Цикл
			Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда 
				Прервать;
			КонецЕсли;
			Если ТипЗнч(ДокОснование)<>Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Прервать;
			Иначе
				Если ДокОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
					ДокИСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокОснование.ДокументРеализации);
					Если ЗначениеЗаполнено(ДокИСФ) Тогда 
						Если НЕ ДокИСФ.УдалитьВключатьВОтчетДляФНС Тогда 
							Сообщить("Чтобы установить отметку, вам необходимо, так же, установить ее в предыдущей, связанной ИСФ: "
							+ ДокИСФ );
							Объект.УдалитьВключатьВОтчетДляФНС = Ложь;
							Возврат Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
			ДокОснование = ДокОснование.ДокументРеализации;
		КонецЦикла;
	КонецЕсли;
	Возврат Истина;
КонецФункции
//--ДИТ_Коробов_Task 46790_24.02.2
  
&НаКлиенте
Процедура НеВключатьВОтчетПоДолгамНДСПриИзменении(Элемент)
	
	Если Не Объект.НеВключатьВОтчетПоДолгамНДС Тогда
		Объект.ПричинаИсключенияИзОтчетаПоДолгамНДС0 = Неопределено;
	КонецЕсли;
	ОбновитьОтображениеНДС0();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.УдалитьВключатьВОтчетДляФНС И не ЗначениеЗаполнено(Объект.УдалитьДатаОтчетаДляФНС) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период отчета для ФНС",, "Объект.УдалитьДатаОтчетаДляФНС",, Отказ);
	КонецЕсли; 
	
	Если Объект.НеВключатьВОтчетПоДолгамНДС И не ЗначениеЗаполнено(Объект.ПричинаИсключенияИзОтчетаПоДолгамНДС0) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите причину исключения ИСФ из отчета по долгам ФНС",, "Объект.ПричинаИсключенияИзОтчетаПоДолгамНДС0",, Отказ);
	КонецЕсли; 
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФВ(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФВ(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	ЗначениеПараметра = Неопределено;
	Если ПараметрыЗаписи.Свойство("РазрешенаЗаписьВыставленного", ЗначениеПараметра) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешенаЗаписьВыставленного", ЗначениеПараметра);
	КонецЕсли;
	Если ПараметрыЗаписи.Свойство("СнятьПризнакВыставленУОснований", ЗначениеПараметра) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СнятьПризнакВыставленУОснований", ЗначениеПараметра);
	КонецЕсли;
	//Евросиб Каблов 22.07.2020 )
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459
	ИзмененияЗапрещены = Отказ;
	ТекРежимЗаписи = Неопределено;
	ТекРежимПроведения = Неопределено;
	ПараметрыЗаписи.Свойство("РежимЗаписи", ТекРежимЗаписи);
	ПараметрыЗаписи.Свойство("РежимПроведения", ТекРежимПроведения);
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ТекущийОбъект, ИзмененияЗапрещены, ТекРежимЗаписи, ТекРежимПроведения);
	//Евросиб Каблов 02.12.2020 )
	
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереченьГТДкИСФ(Команда)
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 17.07.2025  
	РеквизитыБыли = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Авто, Фрахт", Истина);
	Если Объект.Авто <> РеквизитыБыли.Авто или Объект.Фрахт <> РеквизитыБыли.Фрахт Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед подтверждением ГТД необходимо записать счет-фактуру!");
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 17.07.2025
	
	ОповещениеОВыборе  = Новый ОписаниеОповещения("ОткрытиеДокументаПослеВыбора", ЭтаФорма);
	//Форма2 = ПолучитьФорму("Документ.СчетФактураВыданный.Форма.ФормаПодтверждения",,ЭтаФорма);
	//КопироватьДанныеФормы(Объект,Форма2.Объект);
	// Форма2.Открыть();
	
	//ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаПодтвержденияУдалить",, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаПодтвержденияУдалить",ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Начало 15.05.2025
	ПараметрыПодтверждения = Новый Структура("Клиент", Объект.Контрагент);
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Конец 15.05.2025
	
	ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаПодтверждения",ПараметрыПодтверждения, ЭтотОбъект,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеДокументаПослеВыбора(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		// Евросиб US 90779 TA 90785 Рыбьяков К.А. 07.12.2024 ((
		КопироватьДанныеФормы(РезультатВыбора.Объект, Объект);
		Для Каждого Документ Из РезультатВыбора.НеПодвержденныеДокументы Цикл
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Для %1 есть не подтвержденные контейнеры.'"), Документ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		//КопироватьДанныеФормы(РезультатВыбора, Объект);
		// Евросиб Рыбьяков К.А. 07.12.2024 ))
		ЗаписатьДанныеПоГТД();
		ОбновитьОтображениеНДС0();
		// Евросиб Фролов (01.12.2021 Task №43170
		НастроитьДоступностьФрахта();
		// Евросиб Фролов)
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПоГТД()
	
	УстановитьПривилегированныйРежим(Истина);
	Если Объект.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	//Записать(Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписи, РежимПроведенияДокумента.Неоперативный));
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписи, РежимПроведенияДокумента.Неоперативный);
	ПараметрыЗаписи.Вставить("РазрешенаЗаписьВыставленного", Истина);
//Евросиб Гудкова( 18.09.2020 Ticket№ 0207438
	СтрокиБезДокументов = Объект.ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("ДокументыЕсть", Ложь));
	Если Объект.ПодтверждающиеДокументы.Количество() > 0 И СтрокиБезДокументов.Количество() = 0 И Не ЗначениеЗаполнено(Объект.УдалитьДатаПолногоПодтвержденияНДС0) Тогда
		Объект.УдалитьДатаПолногоПодтвержденияНДС0 = ТекущаяДата();
	ИначеЕсли Объект.ПодтверждающиеДокументы.Количество() > 0 И СтрокиБезДокументов.Количество() > 0 И ЗначениеЗаполнено(Объект.УдалитьДатаПолногоПодтвержденияНДС0) Тогда 
		Объект.УдалитьДатаПолногоПодтвержденияНДС0 = Неопределено;
	КонецЕсли;
// Евросиб Гудкова) 	
	Записать(ПараметрыЗаписи);
	//Евросиб Каблов 22.07.2020 )
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаКлиенте
Процедура СнятьПризнакВыставлен(Команда)
	
	//Евросиб Каблов 08.07.2021 ( Ticket#0231661
	//Если Объект.Выставлен Тогда
	//	Объект.Выставлен = Ложь;
	//	Объект.ДатаВыставления = '00010101';
	//	ПараметрыЗаписи = Новый Структура("СнятьПризнакВыставленУОснований", Истина);
	//	Записать(ПараметрыЗаписи);
	//КонецЕсли;
	
	//Проверка доступности по Периоду ВО
	ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Объект.Ссылка);
	Если ДокументВЗакрытомПериоде Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование документа запрещено, так как он в закрытом периоде!");
		Возврат;
	КонецЕсли;
	
	СнятьПризнакВыставленСервер();
	//Евросиб Каблов 08.07.2021 )
	
КонецПроцедуры

//Евросиб Каблов 08.07.2021 Ticket#0231661
&НаСервере
Процедура СнятьПризнакВыставленСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СнятьПризнакВыставлен();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	//ОбработатьБлокировкуДокумента();
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	
КонецПроцедуры

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаСервере
Процедура ОбработатьБлокировкуДокумента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДанныеОБлокировке = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеОБлокировке(Объект.Ссылка);
		ТолькоПросмотр = ДанныеОБлокировке.Заблокирован;		
		Элементы.ПредупреждениеРедактирования.Видимость = ДанныеОБлокировке.Заблокирован;
		Элементы.ПредупреждениеРедактирования.Заголовок = ДанныеОБлокировке.ОписаниеБлокировки;
	Иначе
		Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьФрахта()
	// Евросиб Фролов (01.12.2021 Task №43170
	
	ЕстьПравоНДС0 = Пользователи.РолиДоступны("dc_РаботаСНДС0");
	
	// Запретить редактирование реквизитов блока ндс0, всем кроме роли НДС0 и полных прав.
	Элементы.ДанныеДляФНС.ТолькоПросмотр = Не ЕстьПравоНДС0;  
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Начало 26.05.2025
	Элементы.СтраницаИтогПодтвержденияНДС0.Видимость = ЕстьПравоНДС0 и Объект.СуммаНДСДокумента = 0;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 109942 Конец 26.05.2025
	
	// Сделать возможным проставления признака фрахт ролью "dc_РаботаСНДС0",
	// где в перечне ГТД в виде перевозок указан Морской импорт или экспорт,
	// и в строчках перечня  не заполнены номера ЖД-накладных.
	МассивЖДН = Объект.ПодтверждающиеДокументы.Выгрузить().ВыгрузитьКолонку("ЖДН");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ГДЕ
	|	ТранспортныйДокумент.Ссылка В(&МассивЖДН)
	|	И ТранспортныйДокумент.НомерТранспортногоДокумента <> """"";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивЖДН", МассивЖДН);
	
	Результат = Запрос.Выполнить();
	
	ЕстьЗаполненныеНомераЖДН = Не Результат.Пустой();
	
	Элементы.Фрахт.ТолькоПросмотр = Ложь;
	
	Если (Объект.ВидПеревозки = Справочники.ВидыПеревозок.ИмпортМоре
		ИЛИ Объект.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре)
		И ЕстьЗаполненныеНомераЖДН = Ложь Тогда
		Если ЕстьПравоНДС0 Тогда
			Элементы.Фрахт.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.Фрахт.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;	
	// Евросиб Фролов)

КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 103662 17.04.2025
&НаКлиенте
Процедура ФрахтПриИзменении(Элемент)
	Если Объект.Фрахт = Истина и Объект.Авто = Истина Тогда
		Объект.Авто = Ложь;
	КонецЕсли;
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 103662 17.04.2025
&НаКлиенте
Процедура АвтоПриИзменении(Элемент)
	Если Объект.Фрахт = Истина и Объект.Авто = Истина Тогда
		Объект.Фрахт = Ложь;
	КонецЕсли;
КонецПроцедуры
