
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОписаниеВозврРезультата = "";
	
	Для каждого СтрК Из Результат.Выгрузить().Колонки Цикл
	
		ОписаниеВозвРезультата = ОписаниеВозвРезультата + ?(ОписаниеВозвРезультата="", "", ",") + СтрК.Имя;
		
	КонецЦикла;
	
	Параметры.Свойство("Терминал",Терминал);
	
	Если не Пользователи.РолиДоступны("АдминистраторСистемы",, Ложь) Тогда
		Элементы.Результат.ТолькоПросмотр = Истина;	
	КонецЕсли;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	Результат.Очистить();  
	
	Если Не ЗначениеЗаполнено(Терминал) Тогда 
		ТекстОшибки = "Не удалось выполнить чтение данных – не выбран терминал";  
		ПоказатьПредупреждение(, ТекстОшибки); 
	Иначе
		ПроверкаСодержимогоЯчейки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаСодержимогоЯчейки() 
	
	ВсеСоотв = Новый Соответствие;
	
	Сч = 2;
	Результат.Очистить();
	
	Контейнер = СокрЛП(ТД.Область("R"+Сч+"C1").Текст);
	
	Если Контейнер = "" Тогда
		Возврат;
	КонецЕсли;    
	
	МассивРазмеров = Новый Массив;
	МассивРазмеров.Добавить("20");
	МассивРазмеров.Добавить("40");
	МассивРазмеров.Добавить("45");
	
	Пока Контейнер <> "" Цикл
		
		МассивОшибок = Новый Массив;

		НСтр = Результат.Добавить();   
		
		НСтр.ПрочитаннаяСтрока = Сч;
		НСтр.НомерСтрокиДляСортировки = Сч;
		
		НСтр.Контейнер = Контейнер;  
		
		НСтр.РасчетноеКонтрольноеЧисло = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(Контейнер,4), Сред(Контейнер,5,6));
		НСтр.КонтрольноеЧислоПользователя = Прав(Контейнер,1);  
		
		Если НСтр.РасчетноеКонтрольноеЧисло <> НСтр.КонтрольноеЧислоПользователя Тогда  
			// ++ ДИТ_Агафонов_task 15.07.2022
			//НСтр.БлокирующаяОшибка = Истина;
			НСтр.РазмерКТКОшибка = Ложь;
			// -- ДИТ_Агафонов_task 15.07.2022
			МассивОшибок.Добавить("Неверный номер контейнера"); 
		КонецЕсли;      
		
		РазмерКТК = СокрЛП(ТД.Область("R"+Сч+"C"+2).Текст); 
		НСтр.РазмерКТК = РазмерКТК;   
		
		Если ЗначениеЗаполнено(РазмерКТК) И МассивРазмеров.Найти(РазмерКТК) = Неопределено Тогда  
			// ++ ДИТ_Агафонов_task 15.07.2022
			//НСтр.БлокирующаяОшибка = Истина;
			НСтр.РазмерКТКОшибка = Ложь;
			// -- ДИТ_Агафонов_task 15.07.2022
			МассивОшибок.Добавить("Неверный размер КТК"); 
		КонецЕсли;                 
		
		ТипКТК = СокрЛП(ТД.Область("R"+Сч+"C"+3).Текст); 
		НСтр.ТипКТК = ТипКТК;   
		
		Если ЗначениеЗаполнено(ТипКТК) И Не ПроверитьТипоразмерКТК(РазмерКТК, ТипКТК, МассивРазмеров) Тогда  
			// ++ ДИТ_Агафонов_task 15.07.2022
			//НСтр.БлокирующаяОшибка = Истина;
			НСтр.БлокирующаяОшибка = Ложь;
			// -- ДИТ_Агафонов_task 15.07.2022
			НСтр.ТипКТКОшибка = Истина;
			МассивОшибок.Добавить("Неверный или несоответствующий выбранному размеру тип КТК"); 
		КонецЕсли;                 
		

		ПодстокЛинияСобственника = СокрЛП(ТД.Область("R"+Сч+"C"+4).Текст); 
		НСтр.ПодстокЛинияСобственника = ПодстокЛинияСобственника;   
		
		Если ЗначениеЗаполнено(ПодстокЛинияСобственника) И Не ПроверитьПодсток(Терминал, ПодстокЛинияСобственника) Тогда  
			НСтр.ПодстокЛинияСобственникаОшибка = Истина;
			//МассивОшибок.Добавить("Неверное наименование подстока (линии собственника)"); 
		КонецЕсли;   
		
		ДатаВвозаВывозаСтрока = СокрЛП(ТД.Область("R"+Сч+"C"+5).Текст); 
		ДатаВвозаВывоза = ПреобразованиеВДатуСервер(ДатаВвозаВывозаСтрока, 0);	
		
		Если Не ЗначениеЗаполнено(ДатаВвозаВывоза) Тогда 
			ДатаВвозаВывоза = ПреобразованиеВДатуСервер(ДатаВвозаВывозаСтрока, 1);	
		КонецЕсли;
  
		НСтр.ДатаВвозаВывоза = ДатаВвозаВывоза;
		НСтр.ДатаВвозаВывозаСтрока = ДатаВвозаВывозаСтрока;  
		
		Если ЗначениеЗаполнено(ДатаВвозаВывозаСтрока) И Не ЗначениеЗаполнено(ДатаВвозаВывоза) Тогда  
			НСтр.БлокирующаяОшибка = Истина;
			НСтр.ДатаВвозаВывозаОшибка = Истина;	
			МассивОшибок.Добавить("Неверный формат даты"); 
		КонецЕсли;
        
		СостояниеСтрокаИсход =  СокрЛП(ТД.Область("R"+Сч+"C"+6).Текст); 
		СостояниеСтрока = СостояниеСтрокаИсход;	
		
		Если ЗначениеЗаполнено(СостояниеСтрока) Тогда    
			СостояниеСтрока = ВРег(СостояниеСтрока);	
		КонецЕсли;
		
		Состояние = Ложь;
		
		Если СостояниеСтрока = "ПОРОЖНИЙ" Тогда 
		ИначеЕсли СостояниеСтрока = "ГРУЖЕНЫЙ" Тогда        
			Состояние = Истина;
		Иначе
			НСтр.БлокирующаяОшибка = Истина;
			НСтр.СостояниеОшибка = Истина;	
			МассивОшибок.Добавить("Неверное состояние"); 
		КонецЕсли;     
		
		НСтр.Состояние = Состояние;
		НСтр.СостояниеСтрока = СостояниеСтрокаИсход; 
		
		ПоврежденСтрокаИсход = СокрЛП(ТД.Область("R"+Сч+"C"+7).Текст); 
		ПоврежденСтрока = ПоврежденСтрокаИсход;
		
		Если ЗначениеЗаполнено(ПоврежденСтрока) Тогда
			ПоврежденСтрока = ВРег(ПоврежденСтрока);	
		КонецЕсли;
		
		Поврежден = Ложь;
		
		Если ПоврежденСтрока = "НЕТ" Тогда 
		ИначеЕсли ПоврежденСтрока = "ДА" Тогда        
			Поврежден = Истина;
		Иначе
			НСтр.БлокирующаяОшибка = Истина;
			НСтр.ПоврежденОшибка = Истина;	
			МассивОшибок.Добавить("Неверный статус повреждения"); 
		КонецЕсли;     
		
		НСтр.Поврежден = Поврежден;
		НСтр.ПоврежденСтрока = ПоврежденСтрокаИсход;
		
		//ДИТ Шевченко А.В. 61437 08.12.22 -начало	
		ВидТранспорта   = СокрЛП(ТД.Область("R"+Сч+"C"+8).Текст);
		НомерТранспорта = СокрЛП(ТД.Область("R"+Сч+"C"+9).Текст);
		ФИОВодителя 	= СокрЛП(ТД.Область("R"+Сч+"C"+10).Текст);
		НомерРелиза 	= СокрЛП(ТД.Область("R"+Сч+"C"+11).Текст);
		
		ОбработатьВидТранспорта(ВидТранспорта,Нстр,МассивОшибок);
		
		Если ЗначениеЗаполнено(НомерТранспорта) Тогда
			Нстр.НомерТранспорта = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерТранспорта, "0");
		КонецЕсли;	 
		НомерТранспортаСсылка = Справочники.ТС.НайтиПоНаименованию(НомерТранспорта);
		Если ЗначениеЗаполнено(НомерТранспортаСсылка) Тогда
			Нстр.НомерТранспорта = НомерТранспортаСсылка;
		КонецЕсли;
		
		Нстр.ФИОВодителя = ФИОВодителя;
		Нстр.НомерРелиза = НомерРелиза;
		
		//ДИТ Шевченко А.В. 61437 08.12.22 -конец
		
		Комментарий = СокрЛП(ТД.Область("R"+Сч+"C"+12).Текст);  
		НСтр.Комментарий = Комментарий;
		
		НСтр.Ошибка = СтрСоединить(МассивОшибок, ";");
		
		Сч = Сч + 1;
		Контейнер = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст);
	КонецЦикла;
	
	ТаблицаДублей = Результат.Выгрузить(,"ПрочитаннаяСтрока,Контейнер,ДатаВвозаВывоза,БлокирующаяОшибка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаРезультат.ПрочитаннаяСтрока КАК ПрочитаннаяСтрока,
	               |	ТаблицаРезультат.Контейнер КАК Контейнер,
	               |	ТаблицаРезультат.ДатаВвозаВывоза КАК ДатаВвозаВывоза,
	               |	ТаблицаРезультат.БлокирующаяОшибка КАК БлокирующаяОшибка
	               |ПОМЕСТИТЬ ТаблицаРезультат
	               |ИЗ
	               |	&ТаблицаРезультат КАК ТаблицаРезультат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРезультат.Контейнер КАК Контейнер,
	               |	Сумма(1) КАК КоличествоСтрок,
	               |	МИНИМУМ(ТаблицаРезультат.ПрочитаннаяСтрока) КАК ПрочитаннаяСтрокаМин
	               |ПОМЕСТИТЬ КонтейнерыДубли
	               |ИЗ
	               |	ТаблицаРезультат КАК ТаблицаРезультат
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаРезультат.Контейнер
	               |
	               |ИМЕЮЩИЕ
	               |	Сумма(1) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыДубли.Контейнер КАК Контейнер,
	               |	МАКСИМУМ(ТаблицаРезультат.ДатаВвозаВывоза) КАК ДатаВвозаВывоза
	               |ПОМЕСТИТЬ КонтейнерыДублиНеБлок
	               |ИЗ
	               |	КонтейнерыДубли КАК КонтейнерыДубли
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРезультат КАК ТаблицаРезультат
	               |		ПО КонтейнерыДубли.Контейнер = ТаблицаРезультат.Контейнер
	               |ГДЕ
	               |	ТаблицаРезультат.БлокирующаяОшибка = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыДубли.Контейнер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыДубли.Контейнер КАК Контейнер,
	               |	КонтейнерыДубли.КоличествоСтрок КАК КоличествоСтрок,
	               |	КонтейнерыДубли.ПрочитаннаяСтрокаМин КАК ПрочитаннаяСтрокаМин,
	               |	ЕСТЬNULL(КонтейнерыДублиНеБлок.ДатаВвозаВывоза, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВвозаВывозаМакс
	               |ИЗ
	               |	КонтейнерыДубли КАК КонтейнерыДубли
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтейнерыДублиНеБлок КАК КонтейнерыДублиНеБлок
	               |		ПО КонтейнерыДубли.Контейнер = КонтейнерыДублиНеБлок.Контейнер";
	
	Запрос.УстановитьПараметр("ТаблицаРезультат", ТаблицаДублей);
	
	РезультатДублей = Запрос.Выполнить();
	Если не РезультатДублей.Пустой() Тогда
		Выборка = РезультатДублей.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			БылаНадписьМаксДата = Ложь;
			МассивСтрок = Результат.НайтиСтроки(Новый Структура("Контейнер",Выборка.Контейнер));	
			Для каждого СтрокаДубля Из МассивСтрок Цикл
				СтрокаДубля.НомерСтрокиДляСортировки = Выборка.ПрочитаннаяСтрокаМин; 
				Если БылаНадписьМаксДата = Ложь 
					И СтрокаДубля.БлокирующаяОшибка = Ложь 
					И СтрокаДубля.ДатаВвозаВывоза = Выборка.ДатаВвозаВывозаМакс 
					Тогда
					БылаНадписьМаксДата = Истина;		
					СтрокаДубля.Ошибка = СтрокаДубля.Ошибка + ?(ЗначениеЗаполнено(СтрокаДубля.Ошибка),Символы.ПС,"") + "Дубль номера контейнера. Макс. дата для переноса в документ";
				Иначе
					СтрокаДубля.БлокирующаяОшибка = Истина;	
					СтрокаДубля.Ошибка = СтрокаДубля.Ошибка + ?(ЗначениеЗаполнено(СтрокаДубля.Ошибка),Символы.ПС,"") + "Дубль номера контейнера";
				КонецЕсли;
			КонецЦикла
		КонецЦикла;
	Результат.Сортировать("НомерСтрокиДляСортировки, БлокирующаяОшибка");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидТранспорта(ВидТранспорта,Нстр,МассивОшибок) //ДИТ Шевченко А.В. 61437 08.12.22
	Если ЗначениеЗаполнено(ВидТранспорта) Тогда
		ВидТрансСоотв = Новый Соответствие;
		ВидТрансСоотв.Вставить("АВТО",Перечисления.ВидыТранспорта.Авто);
		ВидТрансСоотв.Вставить("ЖД",Перечисления.ВидыТранспорта.ЖД);
		ВидТрансСоотв.Вставить("Ж/Д",Перечисления.ВидыТранспорта.ЖД);
		ВидТранспортаЗнч = ВидТрансСоотв.Получить(ВРег(ВидТранспорта));
		Если ВидТранспортаЗнч = Неопределено Тогда
			НСтр.БлокирующаяОшибка = Истина;
			НСтр.ВидТранспортаОшибка = Истина;	
			МассивОшибок.Добавить("Неверный вид транспорта");
			НСтр.ВидТранспорта = ВидТранспорта;
		Иначе
			НСтр.ВидТранспорта = ВидТранспортаЗнч;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры		

&НаСервереБезКонтекста
Функция ПроверитьТипоразмерКТК(РазмерКТК, ТипКТК, МассивРазмеров)
	
	Рез = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТЕ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|ГДЕ
	|	ТипоразмерыТЕ.РазмерКТК.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", РазмерКТК);
	
	Ответ = Запрос.Выполнить().Выбрать();
	
	Пока Ответ.Следующий() Цикл  
		
		Если Ответ.Наименование = ТипКТК 
			Или Сред(Ответ.Наименование, 3) = ТипКТК Тогда
			Рез = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции   

&НаСервереБезКонтекста
Функция ПроверитьПодсток(Терминал, ПодстокЛинияСобственника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодстокиКонтейнеров.Локация КАК Локация,
	|	ПодстокиКонтейнеров.НаименованиеПодстока КАК НаименованиеПодстока
	|ИЗ
	|	РегистрСведений.ПодстокиКонтейнеров КАК ПодстокиКонтейнеров
	|ГДЕ
	|	ПодстокиКонтейнеров.Локация = &Терминал
	|	И ПодстокиКонтейнеров.НаименованиеПодстока = &НаименованиеПодстока";
	Запрос.УстановитьПараметр("Терминал", Терминал);
	Запрос.УстановитьПараметр("НаименованиеПодстока", ПодстокЛинияСобственника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПреобразованиеВДатуСервер(ТекДата, ФорматДаты)
	
	Если ТекДата = "" Тогда
	
		Возврат Дата(1,1,1);
	
	КонецЕсли; 
	
	Рез = Неопределено;
	
	ТекДата = СокрЛП(ТекДата);	
 	КоличествоСимволов = СтрДлина(ТекДата);
	Год = "";
	Месяц = "";
	День = "";
	Час = "";
	Минута = "";
	Секунда = "";
	ЧастьДаты = 0;
	
	Для Сч = 1 По КоличествоСимволов Цикл
		СимволСтроки = Сред(ТекДата,Сч);
		Код = КодСимвола(СимволСтроки); 
		Если Код < 48 ИЛИ Код>57 Тогда 
			// нашли разделитель
			ЧастьДаты = ЧастьДаты + 1;  
			Разделитель = Строка(Сред(ТекДата,Сч,1)); 
			Если (ЧастьДаты = 0 
				Или ЧастьДаты = 1
				Или ЧастьДаты = 2)
				И Разделитель <> "." 
				Или ЧастьДаты = 3
				И Разделитель <> " "
				Или (ЧастьДаты = 4
				Или ЧастьДаты = 5)
				И Разделитель <> ":" Тогда
				Возврат Дата(1,1,1);
			КонецЕсли;
		Иначе
			Если ФорматДаты = 0 Тогда
				// всего есть от 3 до 6 частей даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
				Если ЧастьДаты = 0 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 3 Тогда
					Час = Строка(Час) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 4 Тогда
					Минута = Строка(Минута) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 5 Тогда
					Секунда = Строка(Секунда) + Строка(Сред(ТекДата,Сч,1)); 
				КонецЕсли;
				// для этого формата всего есть 3 части даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
			ИначеЕсли ФорматДаты = 1 Тогда
				Если ЧастьДаты = 0 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Год) = 2 Тогда
		Год = Строка("20") + Строка(Год);
	КонецЕсли;
	Если СтрДлина(Месяц) = 1 Тогда
		Месяц = Строка("0") + Строка(Месяц);
	КонецЕсли;
	Если СтрДлина(День) = 1 Тогда
		День = Строка("0") + Строка(День);
	КонецЕсли;
	Если СтрДлина(Час) = 1 Тогда
		Час = Строка("0") + Строка(Час);
	КонецЕсли;
	Если СтрДлина(Минута) = 1 Тогда
		Минута = Строка("0") + Строка(Минута);
	КонецЕсли;
	Если СтрДлина(Секунда) = 1 Тогда
		Секунда = Строка("0") + Строка(Секунда);
	КонецЕсли;
	
	ПривДаты = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ЗнДаты = "" + Год + Месяц + День + Час + Минута + Секунда;
	
	Рез = ПривДаты.ПривестиЗначение(ЗнДаты);
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокументКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументКлиент()
	
	РезультатИтого = Новый Массив;
	ВсеХорошо = Истина;
	
	
	ЗавозНаКонтейнерныйПункт = ПредопределенноеЗначение("Справочник.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт");  
	
	Для каждого Стр из Результат Цикл  
		
		Стр.Статус = ЗавозНаКонтейнерныйПункт;
		
		Если Не ЗначениеЗаполнено(Стр.Ошибка)
			Или ЗначениеЗаполнено(Стр.Ошибка) 
			И Не Стр.БлокирующаяОшибка Тогда
			
			текСтр = Новый Структура(ОписаниеВозвРезультата);
			ЗаполнитьЗначенияСвойств(текСтр, Стр); 
			РезультатИтого.Добавить(текСтр);  
		Иначе
			ВсеХорошо = Ложь;
		КонецЕсли;
		
	КонецЦикла;     
	
	СтруктураВозврата = Новый Структура("МассивСтрок, Терминал", РезультатИтого, Терминал);
	
	Если ВсеХорошо Тогда
		Закрыть(СтруктураВозврата);
	Иначе
		ОпОп = Новый ОписаниеОповещения("ВопросПереноса", ЭтаФорма, Новый Структура("СтруктураВозврата", СтруктураВозврата));
		ПоказатьВопрос(ОпОп, "Перенос данных будет проведен только по строкам, не имеющим ошибок. Продолжить?", РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВопросПереноса(Параметр1 = неопределено, Параметр2 = неопределено) экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да Тогда
		Закрыть(Параметр2.СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТДПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл ЧислаМ.Добавить(Строка(Сч)); КонецЦикла;
	
	Сч = 2;

	СохраненныйБелый = ТД.Область("R1C4").ЦветФона;
	
	ПрочСтрока = СокрЛП(ТД.Область("R"+Сч+"C1").Текст);
	
	Пока ПрочСтрока <> "" Цикл
		Если СтрДлина(ПрочСтрока) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
		КонецЕсли;
		Если СтрДлина(ПрочСтрока) <> 11 //////   \/ добавил вот это 
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(ПрочСтрока,1)) = неопределено  
			ИЛИ (СтрДлина(ПрочСтрока) = 11 И НЕ Число(Прав(ПрочСтрока,1)) = КонтрольныйЗнак) Тогда
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = WebЦвета.Розовый;
		Иначе
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = СохраненныйБелый;
		КонецЕсли;
		
		Сч = Сч + 1;
		ПрочСтрока = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	//ВыборФайла.Фильтр = НСтр("ru = 'Файл Excel (*.xls)|*.xls|Файл Excel(*.xlsx)|*.xlsx'");
	ВыборФайла.Фильтр = НСтр("ru = 'Файл Excel (*.xls;*.xlsx)|*.xls;*.xlsx'");
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма);
	ВыборФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ИмяФайла = ВыбранныеФайлы[0];
	КонецЕсли;

КонецПроцедуры // ПослеВыбораФайла()

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
	Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	EXCELВТабличныйДокумент(ДвоичныеДанные, Файл.Расширение);
	//ДокументРезультат.Показать();
КонецПроцедуры

&НаСервере
Процедура EXCELВТабличныйДокумент(ДвоичныеДанные, Расширение)

	ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ФайлEXCELНаСервере);

	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.Прочитать(ФайлEXCELНаСервере);
	УдалитьФайлы(ФайлEXCELНаСервере);
	//ОбластьТаблицы = ТабличныйДокумент.Область(8, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);

	//ПостроительЗапроса = Новый ПостроительЗапроса;
	//ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);
	//ПостроительЗапроса.Выполнить();
	//ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();

	//// теперь поссмторим что в Таблице
	//Возврат ТаблицаЗначенийВТабличныйДокумент(ТаблицаДанных);
 	ШиринаДокумента = ДокументРезультат.ШиринаТаблицы; 
	ВысотаДокумента = ДокументРезультат.ВысотаТаблицы; 
	
	МассивЗаголовков = Новый Массив;
	МассивЗаголовков.Добавить("Контейнер");	
	МассивЗаголовков.Добавить("Размер КТК");	
	МассивЗаголовков.Добавить("Тип КТК");	
	МассивЗаголовков.Добавить("Подсток линия собственника");
	МассивЗаголовков.Добавить("Дата ввоза\вывоза");	
	МассивЗаголовков.Добавить("Состояние");	
	МассивЗаголовков.Добавить("Поврежден");	
	МассивЗаголовков.Добавить("Комментарий");	
	
	СчетчикПоиска = 0;
	Для каждого ЗаголовокПоиска Из МассивЗаголовков Цикл
		СчетчикПоиска = СчетчикПоиска + 1;
		НомерКолонки = 0;
		Для Счетчик = 1 по ШиринаДокумента Цикл
			Если ДокументРезультат.Область(1,Счетчик).Текст	= ЗаголовокПоиска Тогда
				НомерКолонки = Счетчик;
				Прервать;
			КонецЕсли;		
		КонецЦикла;	
		Если НомерКолонки = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден заголовок: "+ЗаголовокПоиска);
			Продолжить;
		Иначе
			Если ЗаголовокПоиска = "Состояние" Тогда
				Для Счетчик2 = 2 По ВысотаДокумента Цикл
					ТекстЯчейки = ВРег(ДокументРезультат.Область(Счетчик2,НомерКолонки).текст);
					Если ТекстЯчейки = "ДА" Тогда
						ДокументРезультат.Область(Счетчик2,НомерКолонки).текст = "ГРУЖЕНЫЙ";
					ИначеЕсли ТекстЯчейки = "НЕТ" Тогда
						ДокументРезультат.Область(Счетчик2,НомерКолонки).текст = "ПОРОЖНИЙ";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТД.ВставитьОбласть(ДокументРезультат.Область(2,НомерКолонки,ВысотаДокумента,НомерКолонки),ТД.Область(2,СчетчикПоиска));	
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура РезультатВидТранспортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	Массив = Новый Массив(); 
	Массив.Добавить(Тип("ПеречислениеСсылка.ВидыТранспорта")); 
	НашеОписание = Новый ОписаниеТипов(Массив);	
	Элементы.РезультатВидТранспорта.ОграничениеТипа = НашеОписание;
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

