&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	
	ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	
	МассивДокументов = СозданиеТаблицыДокументов(ВыделенныеСтр, Неопределено);
	
	ПараметрКоманды = Новый Массив;
	Для Каждого Элем Из ВыделенныеСтр Цикл
		ПараметрКоманды.Добавить(Элем);
	КонецЦикла;
		
	ПечатьКомплектаДокументов.НапечататьКомплект(МассивДокументов, ПараметрКоманды);
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов)
	 
	МассивДокументов = ПечатьКомплектаДокументов.СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов);
	Возврат МассивДокументов;
	 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекДатаМинус55", ТекущаяДата()-55*24*3600);
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", ОтборПротоколов);
	
	//ДИТ, Беляев СЮ, US 80103/TA 80576, 01-02-2024, начало
	ТекПользователь = Пользователи.ТекущийПользователь();
	МассивПользователей = Новый Массив;
	МассивПользователей = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПользователей, ПолучитьМассивГруппТекущегоПользователя(ТекПользователь));
	Список.Параметры.УстановитьЗначениеПараметра("МассивПользователей", МассивПользователей);
	//ДИТ, Беляев СЮ, US 80103/TA 80576, 01-02-2024, конец

	
	ПСЦБезПодписи = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПСЦ.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Документ.ПСЦ КАК ПСЦ
	               |ГДЕ
	               |	ПСЦ.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ПСЦСостояния.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Документ.ПСЦ.Состояния КАК ПСЦСостояния
	               |			ГДЕ
	               |				ПСЦСостояния.Состояние.Согласование = ИСТИНА
	               |				И ПСЦСостояния.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |				И ПСЦСостояния.Ссылка.ПСЦПоставщика = ЛОЖЬ
	               |				И ПСЦСостояния.Ссылка.ПодписанСДвухСторон = ЛОЖЬ
	               |				И (ПСЦСостояния.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.СтатусыСогласования.СогласованоБезЗамечаний)
	               |					ИЛИ ПСЦСостояния.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.СтатусыСогласования.СогласованСКомментариями))
	               |			СГРУППИРОВАТЬ ПО
	               |				ПСЦСостояния.Ссылка
	               |			ИМЕЮЩИЕ
	               |				МАКСИМУМ(ПСЦСостояния.Ссылка.ДатаСогласования) МЕЖДУ ДАТАВРЕМЯ(2, 1, 1) И &ТекДатаМинус55)";
	Запрос.УстановитьПараметр("ТекДатаМинус55", ТекущаяДата()-55*24*3600);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ПСЦБезПодписи = Ответ.Ссылка;
	КонецЕсли;
	Элементы.ГруппаПСЦБезПодписи.Видимость = (ПСЦБезПодписи <> 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПСЦ.ТекущееСостояние КАК Состояние
	               |ИЗ
	               |	Документ.ПСЦ КАК ПСЦ
	               |ГДЕ
	               |	ПСЦ.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПСЦ.ТекущееСостояние.Код";
	Ответ = Запрос.Выполнить().Выбрать();
	Сч = 1;
	
	СостоянияАктивности = ХранилищеОбщихНастроек.Загрузить("ПСЦ", "ПараметрыОтборовСостояний");

	Пока Ответ.Следующий() Цикл
		НСтр = ФильтрПоСостояниямТЧ.Добавить();
		НСтр.Состояние = Ответ.Состояние;
		НСтр.Активно = ?(СостоянияАктивности = неопределено, Истина, СостоянияАктивности.Получить(Ответ.Состояние));
		НСтр.ЧислКод = Сч;
		Сч = Сч + 1;
	КонецЦикла;

// ++ Дудоров С.В. Ticket#61931 29.11.2022
// Закомментирован для стандартизации кода. В других документах, кроме ПТИУ этого нет
	// Евросиб Фролов (04.05.2022 Task №41900
	//Если КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандаВернутьЗадачу") <> Неопределено Тогда
	//	КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаВернутьЗадачу.Видимость = Ложь;
	//КонецЕсли;	
	// Евросиб Фролов)
// -- Дудоров С.В. Ticket#61931 29.11.2022 

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )

КонецПроцедуры

//ДИТ, Беляев СЮ, US 80103/TA 80576, 01-02-2024, начало
&НаСервере
Функция ПолучитьМассивГруппТекущегоПользователя( ТекПользователь )
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекПользователь);
	РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппаПользователей");
КонецФункции
//ДИТ, Беляев СЮ, US 80103/TA 80576, 01-02-2024, конец

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОтборПротоколовПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", ОтборПротоколов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФильтрПоТаблице()
	
	Элементы.ФильтрПоСостояниямОтображение.СписокВыбора.Очистить();
	Элементы.ФильтрПоСостояниямОтображение.СписокВыбора.Добавить(0, " ");
	СостоянияАктивности = Новый Соответствие;
	МассивОтборовСостояний = Новый Массив;
	Для каждого Стр из ФильтрПоСостояниямТЧ Цикл
		Если Стр.Активно Тогда
			Элементы.ФильтрПоСостояниямОтображение.СписокВыбора.Добавить(Стр.ЧислКод, "(+) " + Стр.Состояние);
			МассивОтборовСостояний.Добавить(Стр.Состояние);
		Иначе
			Элементы.ФильтрПоСостояниямОтображение.СписокВыбора.Добавить(Стр.ЧислКод, " " + Стр.Состояние);
		КонецЕсли;
	КонецЦикла;
	
	Список.Параметры.УстановитьЗначениеПараметра("СписокТекущихСостояний", МассивОтборовСостояний);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФильтрПоТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСостояниямОтображениеПриИзменении(Элемент)
	
	СостоянияАктивности = Новый Соответствие;
	Для каждого Стр из ФильтрПоСостояниямТЧ Цикл
		Если Стр.ЧислКод = ФильтрПоСостояниямОтображение Тогда
			Стр.Активно = НЕ Стр.Активно;
		КонецЕсли;
		СостоянияАктивности.Вставить(Стр.Состояние, Стр.Активно);
	КонецЦикла;
	
	ЗаписатьНастройкиАктивности(СостоянияАктивности);
	ОбновитьФильтрПоТаблице();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНастройкиАктивности(СостоянияАктивности)
	
	ХранилищеОбщихНастроек.Сохранить("ПСЦ", "ПараметрыОтборовСостояний", СостоянияАктивности);
	
КонецПроцедуры

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаКлиенте
Процедура СкопироватьДанныеПоСНП(Команда)
	ОткрытьФорму("Документ.ПСЦ.Форма.ФормаКопированияДанныхПоСНП");
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

