Функция ПолучитьСписокРазрешенныхСДДСДляМассиваНоменклатуры(МассивНоменклатуры) Экспорт
	
	//Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураРазрешенныеСДДС.СтатьяДДС КАК СтатьяДДС
	               |ИЗ
	               |	Справочник.Номенклатура КАК НоменклатураРазрешенныеСДДС
	               |ГДЕ
	               |	НоменклатураРазрешенныеСДДС.Ссылка В(&МассивНоменклатуры)";
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Ответ = Запрос.Выполнить().Выгрузить();
	//Пока Ответ.Следующий() Цикл
	//	
	//	ЭтаСДДСЕстьВОВсехНоменклатурах = Истина;
	//	Для каждого Ном из МассивНоменклатуры цикл
	//		ЭтаСДДСЕстьВОВсехНоменклатурах = ЭтаСДДСЕстьВОВсехНоменклатурах И Ном.РазрешенныеСДДС.ВыгрузитьКолонку("Элемент").Найти(Ответ.Элемент) <> неопределено;
	//	КонецЦикла;
	//	Если ЭтаСДДСЕстьВОВсехНоменклатурах И Результат.Найти(Ответ.Элемент) = неопределено Тогда
	//		Результат.Добавить(Ответ.Элемент);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Ответ.ВыгрузитьКолонку("СтатьяДДС");
	
КонецФункции

//Евросиб Каблов 20.12.2022 62430
Функция ПолучитьДоступныеТипыЛокацийПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураДоступныеТипыЛокаций.ТипЛокации КАК ТипЛокации
	|ИЗ
	|	Справочник.Номенклатура.ДоступныеТипыЛокаций КАК НоменклатураДоступныеТипыЛокаций
	|ГДЕ
	|	НоменклатураДоступныеТипыЛокаций.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипЛокации");	
	
КонецФункции

//Евросиб Каблов 20.12.2022 62430
Функция ПроверитьСоответствиеЛокацииДоступнымТипамПоНоменклатуре(Номенклатура, Локация, СтрокаТипЛокации = Неопределено, СтрокаДоступныеТипы = Неопределено) Экспорт
	
	Результат = Истина;
	
	ДоступныеТипы = ПолучитьДоступныеТипыЛокацийПоНоменклатуре(Номенклатура);
	//Евросиб - АСуслов 05.06.2023 17:30:42 #71039
	//(
	Если Не ЗначениеЗаполнено(Локация) Тогда
		Возврат Истина;
	ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
		ТипЛокации = Справочники.ТипыЛокаций.АдресВНаселенномПункте;
	Иначе
		ТипЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Локация, "Тип");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 05.06.2023 17:30:43 #71039
	СтрокаТипЛокации = Строка(ТипЛокации);
	
	Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
		Если ДоступныеТипы.Найти(ТипЛокации) = Неопределено Тогда
			Результат = Ложь;
		КонецЕсли;
		СтрокаДоступныеТипы = СтрСоединить(ДоступныеТипы, ", ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 16.12.2024 #94192
Функция ПолучитьСоответствиеДоступныхТиповЛокацийНоменклатуре(СписокНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураДоступныеТипыЛокаций.Ссылка КАК Номенклатура,
	|	НоменклатураДоступныеТипыЛокаций.ТипЛокации КАК ТипЛокации
	|ИЗ
	|	Справочник.Номенклатура.ДоступныеТипыЛокаций КАК НоменклатураДоступныеТипыЛокаций
	|ГДЕ
	|	НоменклатураДоступныеТипыЛокаций.Ссылка В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ТипЛокации";	
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипыЛокацийНоменклатуры = Новый Соответствие;
	Пока Выборка.СледующийПоЗначениюПоля("Номенклатура") Цикл
		ТипыЛокаций = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ТипЛокации") Цикл
			ТипыЛокаций.Добавить(Выборка.ТипЛокации);
		КонецЦикла;
		ТипыЛокацийНоменклатуры.Вставить(Выборка.Номенклатура, ТипыЛокаций);
	КонецЦикла;
	
	Возврат ТипыЛокацийНоменклатуры;
	
КонецФункции

 //Субботин TASK 70840 20.06.2023 Начало
 Процедура ПроверитьРеквизитИспользованиеНоменклатуры(Номенклатура, СтандартнаяОбработка = Неопределено, Отказ = Неопределено,
	 ДатаСозданияДокумента = Неопределено) Экспорт
	 
	 Если ДатаСозданияДокумента <> Неопределено тогда 
		 Если ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"НеИспользовать") = истина
			 и ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"ДатаНеИспользовать") <= ДатаСозданияДокумента тогда
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура: " + Номенклатура + " недоступна для использования. Необходимо заменить номенклатуру.",,,);
			 Если СтандартнаяОбработка <> Неопределено тогда
				 СтандартнаяОбработка = НЕ Номенклатура.НеИспользовать; 
			 КонецЕсли;
			 Если Отказ <> Неопределено тогда
				 Отказ = Истина;
			 КонецЕсли;
		 КонецЕсли;
	 Иначе
		 Если ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"НеИспользовать") = истина тогда
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура: " + Номенклатура + " недоступна для использования. Необходимо заменить номенклатуру.",,,);
			 Если СтандартнаяОбработка <> Неопределено тогда
				 СтандартнаяОбработка = НЕ Номенклатура.НеИспользовать; 
			 КонецЕсли;
			 Если Отказ <> Неопределено тогда
				 Отказ = Истина;
			 КонецЕсли;
		 КонецЕсли;
	 КонецЕсли;
		  
КонецПроцедуры

 //Субботин //Субботин TASK 70840 20.06.2023
 Процедура ПроверитьИспользованиеНоменклатуры(Объект, отказ) Экспорт   
	 
	 // Евросиб(ДИТ) US 94463 ТА 95205 Сержантова А.С. Начало: 12.11.2024
	 Если Объект.ОбменДанными.Загрузка = Истина Тогда
	 	Возврат;
	 КонецЕсли;
	 // Евросиб(ДИТ) US 94463 ТА 95205 Сержантова А.С. Конец: 12.11.2024
		
		Если ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда  //+
			Для Каждого Строка из Объект.Услуги Цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Номенклатура,, Отказ, Объект.Создано);
				//Субботин 77317 20.11.2023 Начало
				ПроверитьОтнесениеУслугиНаЗатраты(Строка.Номенклатура,, Отказ);
				//Субботин 77317 20.11.2023 Конец
				Если Отказ тогда Возврат КонецЕсли;;
			КонецЦикла;
			
		//Субботин 77317 20.11.2023 Начало	
		ИначеЕсли ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") тогда  
				Для Каждого Строка Из Объект.Услуги Цикл 		    			
				ПроверитьОтнесениеУслугиНаЗатраты(Строка.Номенклатура,, Отказ);				
				Если Отказ Тогда Возврат КонецЕсли;;
			КонецЦикла;
		//Субботин 77317 20.11.2023 Конец			
			
		ИначеЕсли ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") тогда //+
			Для каждого Строка из Объект.Товары цикл
					ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Номенклатура,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;;
			КонецЦикла;
							
		ИначеЕсли ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") тогда //+
			Для каждого Строка из Объект.Товары цикл
					ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Номенклатура,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;;
			КонецЦикла;
						
		ИначеЕсли ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.ПСЦ") тогда //+
			Для каждого Строка из Объект.СверхнормативноеПользование цикл
					ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;;
			КонецЦикла;
										
		ИначеЕсли ТипЗнч(Объект.ссылка) = Тип("ДокументСсылка.Калькуляция") тогда 
			
			//проверки ТЧ калькуляции
            Для каждого строка из Объект.ММ_КалькуляцияМультимодальнойЦепочки цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
							
			Для каждого строка из Объект.ЖД_УслугиВнеСтавки цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
							
			Для каждого строка из Объект.ПланПродаж_Доходы цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Номенклатура,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
									
			Для каждого строка из Объект.ПланПродаж_Расходы	цикл 
				 ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Номенклатура,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
							
			Для каждого строка из Объект.ЖД_КалькуляцияСебестоимости цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
                        			
			Для каждого строка из Объект.ЖД_УслугиПоСверхнормативам цикл 
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
            					
			Для каждого Строка из Объект.ПС_ДопРасходыВклВСтавку цикл
				ПроверитьРеквизитИспользованиеНоменклатуры(Строка.Услуга,, Отказ, Объект.Создано);
				Если Отказ тогда Возврат КонецЕсли;
			КонецЦикла;
            			
			// проверки реквизитов калькуляции
			Если ЗначениеЗаполнено(Объект.ЖД_Услуга) тогда
				ПроверитьРеквизитИспользованиеНоменклатуры(Объект.ЖД_Услуга,, Отказ, Объект.Создано);
			КонецЕсли;
                 									
		КонецЕсли; 
	//КонецЕсли;
    	
КонецПроцедуры
//Субботин TASK 70840 20.06.2023 конец  

//Субботин 77317 20.11.2023 Начало
Процедура ПроверитьОтнесениеУслугиНаЗатраты(Номенклатура, СтандартнаяОбработка = Неопределено, Отказ = Неопределено) Экспорт
	
	ПризнакОтнесенияНаЗатраты = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"УслугаНаЗатраты");
	Если ПризнакОтнесенияНаЗатраты = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура: " + Номенклатура + " ограничена для выбора. Необходимо заменить номенклатуру.",,,);
       	Если СтандартнаяОбработка <> Неопределено тогда
			СтандартнаяОбработка = ПризнакОтнесенияНаЗатраты; 
		КонецЕсли;
		Если Отказ <> Неопределено тогда
			Отказ = НЕ ПризнакОтнесенияНаЗатраты;
		КонецЕсли;		
	КонецЕсли;

	
КонецПроцедуры
//Субботин 77317 20.11.2023 Конец
