Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода,Знач СтруктураПодписантов = Неопределено) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетАгента") Тогда
		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "ОтчетАгента", "Отчет агента",
			ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент981") Тогда
		СформироватьПечатнуюФормуУПД(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"УниверсальныйПередаточныйДокумент981", "Универсальный передаточный документ",
		ОбъектыПечати, ПараметрыВывода);

	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСдачиПриемки") Тогда
								ПараметрыПечати.Вставить("ВидДокументаПечати",  "ОтчетКомитентуОПродажах");
				ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_Акт");
				ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.ОтчетКомитентуОПродажах.ПФ_MXL_АктСдачиПриемки");
				СформироватьПечатнуюФормуАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "АктСдачиПриемки", "Акт сдачи-приемки",
			ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
	КонецЕсли;                    

КонецПроцедуры

Процедура СформироватьПечатнуюФормуУПД (МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод)
	Для каждого ЭлМассива из МассивОбъектов Цикл
		
			ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийДляУПД(ЭлМассива);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
			ПечатьБухгалтерскихДокументов.ПечатьУПД981(ТаблицаСведенийСчетФактуры, ОбъектыПечати,ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент981");
			КонецЦикла;	
	
	
КонецПроцедуры

Процедура СформироватьПечатнуюФормуАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов)
	Для каждого ЭлМассива из МассивОбъектов Цикл
//Евросиб Литвинов 19.08.2021 ( #35933 #36212
		Если ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ЭлМассива, ИмяМакета, СинонимМакета) Тогда
			Продолжить;
		КонецЕсли;
//Евросиб Литвинов 19.08.2021 ) #35933 #36212 
		ТаблицаСведенийАктаОбОказанииУслуг = ПолучитьТаблицуСведенийАктаОбОказанииУслуг(ЭлМассива);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСдачиПриемки", "Акт сдачи-приемки", 
					ПечатьБухгалтерскихДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),, 
							"Документ.РеализацияТоваровУслуг.ПФ_MXL_АктСдачиПриемки");
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТаблицуСведенийАктаОбОказанииУслуг(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеАктаОбОказанииУслуг();
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияТаблицыСведенийАктаОбОказанииУслуг();
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Продавец", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаСреза",Документ.Дата);
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
	ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДоговорКонтрагента"); 
	Запрос.УстановитьПараметр("БанковскийСчетОрганизации", ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(ДоговорКонтрагента)); 
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
	РезультатыЗапроса = Запрос.ВыполнитьПакет();

	Выборка = РезультатыЗапроса[0].Выбрать();
	СтрокиДокументов = РезультатыЗапроса[1].Выгрузить();
	СТрокиРасшифровки = РезультатыЗапроса[2].Выгрузить();
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе, Выборка);
		СведенияОДокументе.ДоверенностьЗаРуководителя = Выборка.ДоверенностьЗаРуководителя;
		СведенияОДокументе.ДоверенностьЗаГлБухгалтера = Выборка.ДоверенностьЗаГлБухгалтера;
		ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыАктаОбОказанииУслуг();
		ТаблицаРасшифровки = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыРасшифровки();

		
		Для Каждого Строка Из СтрокиДокументов Цикл
			
			СтрокаТаблицыДокумента = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента, Строка);

		КонецЦикла;
	    СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
		Для каждого Строка из СТрокиРасшифровки Цикл
			СтрТаблицы = ТаблицаРасшифровки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаблицы, Строка);
		КонецЦикла;
		СведенияОДокументе.ТаблицаРасшифровки =  ТаблицаРасшифровки;
	КонецЦикла;
	

	Возврат ТаблицаСведений;
		
КонецФункции

Функция ПолучитьТекстЗапросаДляФормированияТаблицыСведенийАктаОбОказанииУслуг()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеРуководителяКонтрагентовСрезПоследних.Руководитель КАК РуководительКонтр,
	|	ДанныеРуководителяКонтрагентовСрезПоследних.Должность КАК ДолжностьРуководителяКонтр,
	|	ДанныеРуководителяКонтрагентовСрезПоследних.НаОсновании КАК ОснованиеРуководителя,
	|	ДанныеРуководителяКонтрагентовСрезПоследних.ФИОВРодительномПадеже КАК ФИОРуководителяКонтр,
	|	ОтчетКомитентуОПродажах.Ссылка КАК Документ,
	|	ОтчетКомитентуОПродажах.ДатаДокумента КАК ДатаДокумента,
	//|	СчФ.Ссылка.НомерДляПечати КАК НомерДокумента,
	|	ОтчетКомитентуОПродажах.НомерДляПечатиВознаграждение КАК НомерДокумента,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Представление КАК ПредставлениеДоговора,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.ДоговорТранспортнойЭкспедиции КАК ДоговорТранспортнойЭкспедиции,
	//|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	ВЫБОР КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = Значение(Справочник.Организации.ПустаяСсылка) ТОГДА ОтчетКомитентуОПродажах.Организация ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация КОНЕЦ КАК Организация,
	|	ВЫБОР КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = Значение(Справочник.Организации.ПустаяСсылка) ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеСокращенное ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеСокращенное КОНЕЦ КАК КраткоеНаименованиеОрг,
	|	ОтчетКомитентуОПродажах.ПодразделениеОрганизации КАК Подразделение,
	//|	ОтчетКомитентуОПродажах.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетПродавца,
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало	
	|	&БанковскийСчетОрганизации КАК БанковскийСчетПродавца, 
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец	
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК Валюта,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК Курс,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК Кратность,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Код КАК ВалютаКод,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Наименование КАК ВалютаНаименование,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС КАК СуммаВознагражденияВключаетНДС,
	|	ДанныеРуководителяКонтрагентовСрезПоследних1.Руководитель КАК РуководительОрг,
	//|	ОтчетКомитентуОПродажах.Организация.НаименованиеСокращенное КАК КраткоеНаименованиеОрг,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	ОтчетКомитентуОПродажах.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	|	ОтчетКомитентуОПродажах.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,	
	//Евросиб Каблов 02.06.2021 ( Ticket#0230677
	|	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	|	ВЫБОР
	|		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ  КАК Факторинг,
	//Евросиб Каблов 02.06.2021 )
	|   ОтчетКомитентуОПродажах.ПодразделениеОрганизации.Город КАК ПодразделениеГород
	//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, начало
	|   ,ОтчетКомитентуОПродажах.ПравилоФормирования КАК ПравилоФормирования
	//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, конец
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	//Евросиб Каблов 02.06.2021 ( Ticket#0230677
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента = ИсторияФакторинга.Договор
	|			И ОтчетКомитентуОПродажах.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	|			И ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1)
	|			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ОтчетКомитентуОПродажах.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	//Евросиб Каблов 02.06.2021 )
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&ДатаСреза, ) КАК ДанныеРуководителяКонтрагентовСрезПоследних
	|		ПО ОтчетКомитентуОПродажах.Контрагент = ДанныеРуководителяКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетФактураВыданный.Ссылка КАК Ссылка,
	|			СчетФактураВыданный.ДокументОснование КАК ДокументОснование
	|		ИЗ
	|			Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ГДЕ
	|			СчетФактураВыданный.ДокументОснование = &Документ
	|			И СчетФактураВыданный.Продавец = &Продавец) КАК СчФ
	|		ПО ОтчетКомитентуОПродажах.Ссылка = СчФ.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних КАК ДанныеРуководителяКонтрагентовСрезПоследних1
	|		ПО ОтчетКомитентуОПродажах.Организация = ДанныеРуководителяКонтрагентовСрезПоследних1.Контрагент
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Документ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	""Товары"" КАК ТабличнаяЧасть,
	//|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
	//|	ВЫБОР
	//|		КОГДА НЕ ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное ПОДОБНО """"
	//|			ТОГДА ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное
	//|		ИНАЧЕ ОтчетКомитентуОПродажах.УслугаПоВознаграждению.Наименование
	//|	КОНЕЦ КАК НоменклатураНаименование,
	//|	1 КАК Количество,
	//|   ОтчетКомитентуОПродажах.СуммаВознаграждения - ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА 0 ИНАЧЕ ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КОНЕЦ КАК Цена,
	//|   ОтчетКомитентуОПродажах.СуммаВознаграждения - ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КАК СуммаБезНДС,
	//|	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК Сумма,
	//|   ОтчетКомитентуОПродажах.СуммаНДСВознаграждения  КАК СуммаНДС,
	//|	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК СуммаСНДС,
	//|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС
	//|ИЗ
	//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	//|ГДЕ
	//|	ОтчетКомитентуОПродажах.Ссылка = &Документ
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Товары"" КАК ТабличнаяЧасть,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
	|	ВЫБОР КОГДА ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения = """" 
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК СТРОКА(1000))
	|		  ИНАЧЕ ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения 
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	1 КАК Количество,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Цена,
	//Евросиб СубботинВ #120291 24.09.2025 Начало
	//|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК СуммаБезНДС,
    //Евросиб СубботинВ #120291 24.09.2025 Конец
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА 0 ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения КОНЕЦ) КАК Сумма,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	//Евросиб СубботинВ #120291 24.09.2025 Начало
	//|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА 0 ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения)  КАК СуммаСНДС,
    //Евросиб СубботинВ #120291 24.09.2025 Начало
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ПО ОтчетКомитентуОПродажах.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Документ
	|СГРУППИРОВАТЬ ПО
	|	""Товары"",
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению,
	|	ВЫБОР КОГДА ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения = """" 
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК СТРОКА(1000))
	|		  ИНАЧЕ ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения 
	|	КОНЕЦ,
	|	1,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Услуга КАК Услуга,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.НомерЖДН КАК НомерЖДН,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ДатаОтправки КАК ДатаОтправки,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ФактическийВес КАК ФактическийВес,
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Груз КАК ГП,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Груз КАК Груз,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.РасчетныйВес КАК РасчетныйВес,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Примечание КАК Примечание,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ПунктНазначения КАК ПунктНазначения,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ПунктОтправления КАК ПунктОтправления
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = &Документ";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьТаблицуСведенийДляУПД(Документ)
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеСчетФактуры();
	ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыСчетФактуры();
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиУПД();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ЗАпрос.УстановитьПараметр("Документ",Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе,Выборка);
//Евросиб ( Литвинов 21.01.2021 #30025
		//СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.НаименованиеПолное;
		//Евросиб - АСуслов 06.09.2023 13:53:22 #74705
		//(
		//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента, Выборка.Продавец.НаименованиеПолное).НаименованиеПолное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента, Выборка.Продавец.НаименованиеПолное);
		СведенияОДокументе.ПредставлениеПоставщика = НаименованияНаДату.НаименованиеПолное;
		//)
		//Евросиб - АСуслов 06.09.2023 13:53:25 #74705
//Евросиб ) Литвинов 21.01.2021 #30025
		СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец,
		?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
		СведенияОДокументе.ПредставлениеГрузоотправителя = "-";
		СведенияОДокументе.ПредставлениеГрузополучателя  = "-";
		СведенияОДокументе.ПредставлениеПокупателя = Выборка.Контрагент.НаименованиеПолное;
		//Евросиб - АСуслов 06.09.2023 13:54:16 #74705
		//(
		//СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+Выборка.КПППродавца;
		СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+НаименованияНаДату.КПП;
		//)
		//Евросиб - АСуслов 06.09.2023 13:54:18 #74705
		СведенияОДокументе.ПоДокументу = "К платежно-расчетному документу №"+?(ЗначениеЗаполнено(СведенияОДокументе.НомерПлатежноРасчетногоДокумента),СведенияОДокументе.НомерПлатежноРасчетногоДокумента,"_______")
		+"от"+?(СведенияОДокументе.ДатаПлатежноРасчетногоДокумента<>Дата('00010101'),СведенияОДокументе.ДатаПлатежноРасчетногоДокумента,"_______");
		СведенияОДокументе.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Контрагент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаДокумента,Истина);
		СведенияОДокументе.ИННПокупателя =Выборка.ИННПокупателя+"/"+Выборка.КПППокупателя;
		
		ТекстЗАпроса = ПолучитьТекстЗапросаДляПечатиТаблицыУПД();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Документ",Документ);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Строка = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(Строка,РезультатЗапроса);
			Строка.Цена = РезультатЗАпроса.Стоимость;
			Строка.Всего = РезультатЗапроса.Сумма;//?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма, РезультатЗапроса.Стоимость + РезультатЗапроса.СуммаНДС);
		КонецЦикла;
		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
	КонецЦикла;	
	
	Возврат ТаблицаСведений;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиУПД()
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЛОЖЬ КАК Исправление,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию) КАК ВидСчетаФактуры,
	//  |	ОтчетКомитентуОПродажах.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.НомерДляПечати КАК Номер,
	//   |	ОтчетКомитентуОПродажах.Дата КАК ДатаДокумента,
	|	ОтчетКомитентуОПродажах.ДатаДокумента КАК ДатаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка КАК Документ,
	|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомитентуОПродажах.Ответственный КАК Ответственный,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	ОтчетКомитентуОПродажах.Организация КАК Продавец,
	|	ОтчетКомитентуОПродажах.Контрагент.КПП КАК КПППокупателя,
	|	ОтчетКомитентуОПродажах.Организация.КПП КАК КПППродавца,
	|	ОтчетКомитентуОПродажах.Организация.ИНН КАК ИННПоставщика,
	|	ОтчетКомитентуОПродажах.Контрагент.ИНН КАК ИННПокупателя,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Код КАК ВалютаКод,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Наименование КАК ВалютаНаименование
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Документ";	
	Возврат ТекстЗАпроса;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиТаблицыУПД()
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК ТоварНаименование,
	|	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК Сумма,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	1 КАК Количество,
	|	ОтчетКомитентуОПродажах.СуммаВознаграждения * ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА 20
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА 18
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА 10  
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА 5
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА 7
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА 22
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|		ИНАЧЕ 0
	|	КОНЕЦ / (100 + ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА 20
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА 18
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА 10
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА 5
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА 7
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
    |		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА 22
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДС,
	|	ОтчетКомитентуОПродажах.СуммаВознаграждения - ОтчетКомитентуОПродажах.СуммаВознаграждения * ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА 20
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА 18
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА 10 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА 5
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА 7
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
    |		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА 22
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|		ИНАЧЕ 0
	|	КОНЕЦ / (100 + ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА 20
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА 18
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА 10 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА 5
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА 7
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА 22
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Стоимость,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Документ";
	Возврат ТекстЗАпроса;
КонецФункции

Процедура СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов)
	
	Для каждого ЭлМассива из МассивОбъектов Цикл
			
		ТаблицаСведенийОтчетаАгента = ПолучитьТаблицуСведенийОтчетаАгента(ЭлМассива);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, 
		ПечатьБухгалтерскихДокументов.ПечатьОтчетаАгенту(ТаблицаСведенийОтчетаАгента, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),,"Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетАгента");
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуСведенийОтчетаАгента (Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеДокументаОтчетАгента();
	ТекстЗапроса = ПолучитьТекстЗапросаДляФормированияТаблицыСведенийОтчетКомитенту();
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;	
	//<< Евросиб - Витвицкий 10.06.2019
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Документ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДокументОснование");			
	КонецЕсли; 
	//>> Евросиб - Витвицкий 10.06.2019	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДатаДок",Документ.Дата); 
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	//Евросиб Каблов 06.04.2021 ( Ticket#0228136
	//СтрокиДокумента = РезультатЗапроса[1].Выгрузить();
	//СтрокиРасшифровки = РезультатЗапроса[2].Выгрузить();
	//СтрокиДокумента = РезультатЗапроса[3].Выгрузить();
	//СтрокиРасшифровки = РезультатЗапроса[4].Выгрузить();
	//Евросиб Каблов 06.04.2021 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	СтрокиДокументаСвернуто = РезультатЗапроса[3].Выгрузить();
	СтрокиДокумента = РезультатЗапроса[4].Выгрузить();
	СтрокиРасшифровки = РезультатЗапроса[5].Выгрузить();
	
	Если СтрокиДокументаСвернуто.Количество() > 0 Тогда
		СтрокиДокумента = СтрокиДокументаСвернуто;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе,Выборка);
		
		//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
		Страхование = Ложь;
		//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
		
		ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыОтчетаАгентаОЗакупках();
		ТаблицаРасшифровки = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыРасшифровкиОтчетаАгентаОЗакупках();
		Для каждого Строка из СтрокиДокумента Цикл
			СтрокаТаблицыДокумента = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента,Строка);
			СФПодрядчика = Строка.НомерСФПодрядчика + " от " + Формат(Строка.ДатаСФПодрядчика,"ДФ=dd.MM.yyyy");
			СтрокаТаблицыДокумента.СФПодрядчика = СФПодрядчика;
			СуммаБезНДС = Строка.Сумма - ?(Выборка.СуммаВключаетНДС,Строка.СуммаНДС,0);
			СуммаСНДС = Строка.Сумма + ?(Выборка.СуммаВключаетНДС,0,Строка.СуммаНДС);
			СтрокаТаблицыДокумента.СуммаБезНДС = СуммаБезНДС;
			СтрокаТаблицыДокумента.НДС = Строка.СуммаНДС;
			СтрокаТаблицыДокумента.СуммаСНДС = СуммаСНДС;
			//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
			Страхование = Страхование ИЛИ Строка.Страхование;
			//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
		КонецЦикла;
		
		Для каждого Строка из СтрокиРасшифровки Цикл
			СтрокаРасшифровки = ТаблицаРасшифровки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки,Строка);
			//Евросиб Каблов 11.08.2021 ( Ticket#0238084
			СуммаБезНДС = Строка.Сумма - ?(Выборка.СуммаВключаетНДС,Строка.СуммаНДС,0);
			СуммаСНДС = Строка.Сумма + ?(Выборка.СуммаВключаетНДС,0,Строка.СуммаНДС);
			СтрокаРасшифровки.СуммаБезНДС = СуммаБезНДС;
			СтрокаРасшифровки.НДС = Строка.СуммаНДС;
			СтрокаРасшифровки.СуммаСНДС = СуммаСНДС;
			//Евросиб Каблов 11.08.2021 )
		КонецЦикла;
		
		СведенияОДокументе.ТаблицаДокумента =  ТаблицаДокумента;
		СведенияОДокументе.ТаблицаРасшифровки = ТаблицаРасшифровки;
		//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
		СведенияОДокументе.Страхование = Страхование;
		//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	КонецЦикла;
	
	Возврат ТаблицаСведений;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляФормированияТаблицыСведенийОтчетКомитенту()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Документ,
	//|	ОтчетКомитентуОПродажах.НомерДляПечатиВозмещаемые КАК НомерДокумента,
	|	ОтчетКомитентуОПродажах.НомерДляПечати КАК НомерДокумента,
	|	ОтчетКомитентуОПродажах.ДатаДокумента КАК ДатаДокумента,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК Валюта,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Код КАК ВалютаКод,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Наименование КАК ВалютаНаименование,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Комитент,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКомитента,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.ДоговорТранспортнойЭкспедиции КАК ДоговорТранспортнойЭкспедиции,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеСокращенное
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеСокращенное
	|	КОНЕЦ КАК КраткоеНаименованиеОрг,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеПолное
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК ПолноеНаименованиеОрг,
	|	ОтчетКомитентуОПродажах.Организация.Руководитель КАК РуководительОрг,
	|	ДанныеРуководителяКонтрагентовСрезПоследних.Руководитель КАК РуководительКонтр,
	|	ОтчетКомитентуОПродажах.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	|	ОтчетКомитентуОПродажах.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,
	|	ОтчетКомитентуОПродажах.ДатаНачалоПериода КАК ДатаНачала,
	|	ОтчетКомитентуОПродажах.ДатаОкончанияПериода КАК ДатаОкончания
	//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, начало
	|	,ОтчетКомитентуОПродажах.ПодразделениеОрганизации.Город КАК ПодразделениеГород
	|	,ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеВРодительномПадеже
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеВРодительномПадеже
	|	КОНЕЦ КАК КраткоеНаименованиеОргРод
	|	,ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеВДательномПадеже
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеВДательномПадеже
	|	КОНЕЦ КАК КраткоеНаименованиеОргДат
	|	,ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Организация.НаименованиеВТворительномПадеже
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Организация.ГоловнаяОрганизация.НаименованиеВТворительномПадеже
	|	КОНЕЦ КАК КраткоеНаименованиеОргТвор
	//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, конец
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&ДатаДок, ) КАК ДанныеРуководителяКонтрагентовСрезПоследних
	|		ПО ОтчетКомитентуОПродажах.Контрагент = ДанныеРуководителяКонтрагентовСрезПоследних.Контрагент
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Документ
	|;
	//Евросиб Каблов 06.04.2021 ( Ticket#0228136
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.Партия КАК Партия,
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка КАК Ссылка
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	|   ,ОтчетКомитентуОПродажахПоставщики.Партия.Страхование КАК Страхование
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	|ПОМЕСТИТЬ ПервичныйДокументПокупателю
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало (закомментировал)
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	//|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//|	ПоступлениеТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	//|	"""" КАК ГУИДПТУ
	//|ПОМЕСТИТЬ НоменклатураССодержанием
	//|ИЗ
	//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугТовары.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугУслуги.Ссылка,
	//|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	//|	ПоступлениеТоваровУслугУслуги.Содержание,
	//|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ
	//|ИЗ
	//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
	//// + ДИТ Кузнецов Е.Е. 57545 25.11.2022
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	КорректировкаПоступленияТовары.Ссылка,
	//|	КорректировкаПоступленияТовары.Номенклатура,
	//|	КорректировкаПоступленияТовары.Номенклатура.НаименованиеПолное,
	//|	"""" КАК ГУИДПТУ 
	//|
	//|ИЗ
	//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	//|		ПО ПервичныйДокументПокупателю.Партия = КорректировкаПоступленияТовары.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	КорректировкаПоступленияУслуги.Ссылка,
	//|	КорректировкаПоступленияУслуги.Номенклатура,
	//|	КорректировкаПоступленияУслуги.Содержание,
	//|	КорректировкаПоступленияУслуги.ГУИДПТУ
	//|ИЗ
	//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	//|		ПО ПервичныйДокументПокупателю.Партия = КорректировкаПоступленияУслуги.Ссылка
	//// - ДИТ Кузнецов Е.Е. 57545 25.11.2022
	//|;
	////Евросиб Каблов 06.04.2021 ) 
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Услуга,
	|	ОтчетКомитентуОПродажахПоставщики.Поставщик КАК Подрядчик,
	|	ОтчетКомитентуОПродажахПоставщики.НомерСчетаФактуры КАК НомерСФПодрядчика,
	|	ОтчетКомитентуОПродажахПоставщики.ДатаСФ КАК ДатаСФПодрядчика,
	|	ОтчетКомитентуОПродажахТовары.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомитентуОПродажахПоставщики.Партия КАК Партия,
	//Евросиб Каблов 06.04.2021 ( Ticket#0228136
	//|	ОтчетКомитентуОПродажахТовары.Содержание КАК НоменклатураНаименование,
	//|	НоменклатураССодержанием.НоменклатураНаименованиеПолное КАК НоменклатураНаименование,
	//Евросиб Каблов 06.04.2021 )
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	|	ОтчетКомитентуОПродажахТовары.Содержание КАК НоменклатураНаименование,
	|	ЕстьNULL(ОтчетКомитентуОПродажахТовары.Ссылка.ПравилоФормирования.СворачиватьСтрокиВПечатнойФормеОтчета, Ложь) КАК СворачиватьСтрокиВПечатнойФормеОтчета,
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|	СделкаДоходы.ПСЦ.НаименованиеПодписиКлиента.Наименование КАК НаименованиеСтороныКлиент,
	|	СделкаДоходы.ПСЦ.НаименованиеПодписиКлиента.НаименованиеВРодительномПадеже КАК НаименованиеСтороныКлиентРП,
	|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	|   ,ОтчетКомитентуОПродажахПоставщики.Партия.Страхование КАК Страхование
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	|ПОМЕСТИТЬ ВТСтрокиДокумента
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки = СделкаДоходы.ГУИД
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало (закомментировал)
	////Евросиб Каблов 06.04.2021 ( Ticket#0228136
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураССодержанием КАК НоменклатураССодержанием
	//|			ПО ОтчетКомитентуОПродажахТовары.Номенклатура = НоменклатураССодержанием.Номенклатура
	//|				И ОтчетКомитентуОПродажахТовары.ГУИДПТУ = НоменклатураССодержанием.ГУИДПТУ
	////Евросиб Каблов 06.04.2021 ) 
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|		ПО ОтчетКомитентуОПродажахПоставщики.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|			И ОтчетКомитентуОПродажахПоставщики.КлючСтроки = ОтчетКомитентуОПродажахТовары.КлючСтроки
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	|ВЫБРАТЬ
	|	ВТСтрокиДокумента.Услуга КАК Услуга,
	|	ВТСтрокиДокумента.Подрядчик КАК Подрядчик,
	|	ВТСтрокиДокумента.НомерСФПодрядчика КАК НомерСФПодрядчика,
	|	ВТСтрокиДокумента.ДатаСФПодрядчика КАК ДатаСФПодрядчика,
	|	СУММА(ВТСтрокиДокумента.Сумма) КАК Сумма,
	|	ВТСтрокиДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТСтрокиДокумента.СуммаНДС) КАК СуммаНДС,
	|	ВТСтрокиДокумента.Партия КАК Партия,
	|	ВТСтрокиДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиент КАК НаименованиеСтороныКлиент,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиентРП КАК НаименованиеСтороныКлиентРП,
	|	ВТСтрокиДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	|   ,ВТСтрокиДокумента.Партия.Страхование КАК Страхование
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	|ИЗ 
	|	ВТСтрокиДокумента КАК ВТСтрокиДокумента
	|ГДЕ
	|	ВТСтрокиДокумента.СворачиватьСтрокиВПечатнойФормеОтчета
	|СГРУППИРОВАТЬ ПО
	|	ВТСтрокиДокумента.Услуга,
	|	ВТСтрокиДокумента.Подрядчик,
	|	ВТСтрокиДокумента.НомерСФПодрядчика,
	|	ВТСтрокиДокумента.ДатаСФПодрядчика,
	|	ВТСтрокиДокумента.СтавкаНДС,
	|	ВТСтрокиДокумента.Партия,
	|	ВТСтрокиДокумента.НоменклатураНаименование,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиент,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиентРП,
	|	ВТСтрокиДокумента.ЕдиницаИзмерения,
	|	ВТСтрокиДокумента.Услуга
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
	|ВЫБРАТЬ
	|	ВТСтрокиДокумента.Услуга КАК Услуга,
	|	ВТСтрокиДокумента.Подрядчик КАК Подрядчик,
	|	ВТСтрокиДокумента.НомерСФПодрядчика КАК НомерСФПодрядчика,
	|	ВТСтрокиДокумента.ДатаСФПодрядчика КАК ДатаСФПодрядчика,
	|	ВТСтрокиДокумента.Сумма КАК Сумма,
	|	ВТСтрокиДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ВТСтрокиДокумента.СуммаНДС КАК СуммаНДС,
	|	ВТСтрокиДокумента.Партия КАК Партия,
	|	ВТСтрокиДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиент КАК НаименованиеСтороныКлиент,
	|	ВТСтрокиДокумента.НаименованиеСтороныКлиентРП КАК НаименованиеСтороныКлиентРП,
	|	ВТСтрокиДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	|   ,ВТСтрокиДокумента.Партия.Страхование КАК Страхование
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	|ИЗ 
	|	ВТСтрокиДокумента КАК ВТСтрокиДокумента
	//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Услуга КАК Услуга,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.НомерЖДН КАК НомерЖДН,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ДатаОтправки КАК ДатаОтправки,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Груз КАК Груз,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ФактическийВес КАК ФактическийВес,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Груз КАК ГП,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.РасчетныйВес КАК РасчетныйВес,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Примечание КАК Примечание,
	//Евросиб Каблов 11.08.2021 ( Ticket#0238084
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС КАК СуммаНДС,
	//Евросиб Каблов 11.08.2021 )
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ПунктНазначения КАК ПунктНазначения,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.ПунктОтправления КАК ПунктОтправления
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = &Документ";	
	Возврат ТекстЗапроса;
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОтчетАгента";
	КомандаПечати.Представление = НСтр("ru = 'Отчет агента о закупках'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УниверсальныйПередаточныйДокумент";
	КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечатиУПД";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСдачиПриемки";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )

КонецПроцедуры

Функция ЗаполнитьПоПоступлению(СтруктураПараметров) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаСФ,
	                      |	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерСчетаФактуры,
	                      |	ПоступлениеТоваровУслуг.Ссылка КАК Партия,
	                      |	ПоступлениеТоваровУслуг.Контрагент КАК Поставщик,
	                      |	ПоступлениеТоваровУслуг.Контрагент.КПП КАК КПППоставщика,
	                      |	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                      |		ПО (СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка)
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
	                      |	И ПоступлениеТоваровУслуг.Организация = &Организация
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПоступлениеТоваровУслугТовары.Ссылка КАК Партия,
	                      |	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	                      |	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	                      |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	                      |	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	                      |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	                      |	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	                      |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	                      |	NULL КАК Содержание,
	                      |	NULL КАК ГУИДПТУ
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслугТовары.Ссылка.Организация = &Организация
	                      |	И ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	                      |	И ПоступлениеТоваровУслугТовары.Перевыставление = ИСТИНА
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПоступлениеТоваровУслугУслуги.Ссылка,
	                      |	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент,
	                      |	ПоступлениеТоваровУслугУслуги.Количество,
	                      |	ПоступлениеТоваровУслугУслуги.Номенклатура,
	                      |	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	                      |	ПоступлениеТоваровУслугУслуги.Сумма,
	                      |	ПоступлениеТоваровУслугУслуги.СуммаНДС,
	                      |	ПоступлениеТоваровУслугУслуги.Цена,
	                      |	ПоступлениеТоваровУслугУслуги.Содержание,
	                      |	ПоступлениеТоваровУслугУслуги.ГУИДПТУ
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслугУслуги.Перевыставление = ИСТИНА
	                      |	И ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	                      |	И ПоступлениеТоваровУслугУслуги.Ссылка.Организация = &Организация");
	Запрос.УстановитьПараметр("Ссылка",СтруктураПараметров.Поступление);
	Запрос.УстановитьПараметр("Организация",СтруктураПараметров.Организация);
	Результат= Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
	
КонецФункции

Функция ЗаполнитьПоРеализации(СтруктураПараметров) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура КАК Номенклатура,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Содержание КАК Содержание,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Количество КАК Количество,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Цена КАК Цена,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Сумма КАК Сумма,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС КАК СуммаНДС,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Контрагент КАК Контрагент,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	                      |ГДЕ
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка = &Реализация
	                      |	И РеализацияТоваровУслугАгентскиеУслуги.Контрагент = &Контрагент");
	Запрос.УстановитьПараметр("Реализация", СтруктураПараметров.Реализация);
	Запрос.УстановитьПараметр("Контрагент", СтруктураПараметров.Контрагент);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, начало
Функция ПолучитьПоступление(Ссылка) Экспорт
	
	РезультатПоступление = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтчетКомитентуОПродажахПоставщики.Партия КАК Партия
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
		|ГДЕ
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		РезультатПоступление = ВыборкаДетальныеЗаписи.Партия;
	КонецЕсли;
	
	Возврат РезультатПоступление;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, начало
Функция ОпределитьДатыДокументов(Организация, Подрядчик, Контрагент, Договор, ДатаВСФ, ДатаОтчетаКомитенту = Неопределено) Экспорт
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	//Евросиб Каблов 09.04.2025 )
	
	Даты = Новый Структура;
	Даты.Вставить("ДатаОтчетаЭкспедитора", Неопределено);
	Даты.Вставить("ДатаИСФнаВР", Неопределено);
	Даты.Вставить("ДатаИСФнаВознаграждение", Неопределено);
	
	ПодрядчикРезидент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подрядчик, "СтранаРегистрации") = Справочники.СтраныМира.Россия;
	КонтрагентРезидент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации") = Справочники.СтраныМира.Россия;
	КатегорияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "КатегорияДоговора");
	
	ДатаИСФнаВР_равнаДатеВСФ = Ложь;
	
	Если ПодрядчикРезидент И КонтрагентРезидент Тогда
		Если КатегорияДоговора = Справочники.КатегорииДоговоров.ТЭУслуги Тогда
			
				Если ДатаВСФ >= НачалоМесяца(ПериодВО)  Тогда
					
					Даты.ДатаОтчетаЭкспедитора = ДатаВСФ;
					//Даты.ДатаИСФнаВР = ДатаВСФ;
					//Даты.ДатаИСФнаВознаграждение = ДатаВСФ;
					ДатаИСФнаВР_равнаДатеВСФ = Истина;
					
				ИначеЕсли ТекущаяДата() > КонецМесяца(ПериодВО) Тогда
					
					Даты.ДатаОтчетаЭкспедитора = КонецМесяца(ПериодВО);
					//Даты.ДатаИСФнаВР = КонецМесяца(ПериодВО);
					//Даты.ДатаИСФнаВознаграждение = КонецМесяца(ПериодВО);
					
				Иначе
					
					Даты.ДатаОтчетаЭкспедитора = ТекущаяДата();
					//Даты.ДатаИСФнаВР = ТекущаяДата();
					//Даты.ДатаИСФнаВознаграждение = ТекущаяДата();
					
				КонецЕсли;
				
			
		//ИначеЕсли КатегорияДоговора = Справочники.КатегорииДоговоров.ПредоставлениеВагонов Тогда
		Иначе //в правилах определения дат вариант с Справочники.КатегорииДоговоров.ПредоставлениеВагонов справедлив для всех остальных договоров
			
				Если ДатаВСФ >= НачалоМесяца(ПериодВО)  Тогда
					
					Даты.ДатаОтчетаЭкспедитора = ДатаВСФ;
					//Даты.ДатаИСФнаВР = ДатаВСФ;
					//Даты.ДатаИСФнаВознаграждение = ДатаВСФ;
					ДатаИСФнаВР_равнаДатеВСФ = Истина;
					
				ИначеЕсли ТекущаяДата() > КонецМесяца(ПериодВО) Тогда
					
					Даты.ДатаОтчетаЭкспедитора = КонецМесяца(ПериодВО);
					//Даты.ДатаИСФнаВР = ДатаВСФ;
					//Даты.ДатаИСФнаВознаграждение = КонецМесяца(ПериодВО);
					ДатаИСФнаВР_равнаДатеВСФ = Истина;
					
				Иначе
					
					Даты.ДатаОтчетаЭкспедитора = ТекущаяДата();
					//Даты.ДатаИСФнаВР = ДатаВСФ;
					//Даты.ДатаИСФнаВознаграждение = ТекущаяДата();
					ДатаИСФнаВР_равнаДатеВСФ = Истина;
					
				КонецЕсли;
				
		КонецЕсли;
		
	ИначеЕсли НЕ ПодрядчикРезидент И КонтрагентРезидент Тогда
		
		Если ДатаВСФ >= НачалоМесяца(ПериодВО)  Тогда
			
			Даты.ДатаОтчетаЭкспедитора = ДатаВСФ;
			//Даты.ДатаИСФнаВР = ДатаВСФ;
			//Даты.ДатаИСФнаВознаграждение = ДатаВСФ;
			ДатаИСФнаВР_равнаДатеВСФ = Истина;
			
		ИначеЕсли ТекущаяДата() > КонецМесяца(ПериодВО) Тогда
			
			Даты.ДатаОтчетаЭкспедитора = КонецМесяца(ПериодВО);
			//Даты.ДатаИСФнаВР = КонецМесяца(ПериодВО);
			//Даты.ДатаИСФнаВознаграждение = КонецМесяца(ПериодВО);
			
		Иначе
			
			Даты.ДатаОтчетаЭкспедитора = ТекущаяДата();
			//Даты.ДатаИСФнаВР = ТекущаяДата();
			//Даты.ДатаИСФнаВознаграждение = ТекущаяДата();
			
		КонецЕсли;
		
	Иначе
		
		Если ДатаВСФ >= НачалоМесяца(ПериодВО)  Тогда
			
			Даты.ДатаОтчетаЭкспедитора = ДатаВСФ;
			//Даты.ДатаИСФнаВР = ДатаВСФ;
			//Даты.ДатаИСФнаВознаграждение = ДатаВСФ;
			ДатаИСФнаВР_равнаДатеВСФ = Истина;
			
		ИначеЕсли ТекущаяДата() > КонецМесяца(ПериодВО) Тогда
			
			Даты.ДатаОтчетаЭкспедитора = КонецМесяца(ПериодВО);
			//Даты.ДатаИСФнаВР = КонецМесяца(ПериодВО);
			//Даты.ДатаИСФнаВознаграждение = КонецМесяца(ПериодВО);
			
		Иначе
			
			Даты.ДатаОтчетаЭкспедитора = ТекущаяДата();
			//Даты.ДатаИСФнаВР = ТекущаяДата();
			//Даты.ДатаИСФнаВознаграждение = ТекущаяДата();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Даты.ДатаИСФнаВознаграждение = Даты.ДатаОтчетаЭкспедитора;
	Даты.ДатаИСФнаВР = Даты.ДатаОтчетаЭкспедитора;
	Если ДатаОтчетаКомитенту <> Неопределено Тогда
		Даты.ДатаИСФнаВР = ДатаОтчетаКомитенту; //установили равной дату из уже записанного Отчета комитенту
	КонецЕсли;
	Если ДатаИСФнаВР_равнаДатеВСФ Тогда
		Даты.ДатаИСФнаВР = ДатаВСФ;
	КонецЕсли;
	
	
	Возврат Даты;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, конец