
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	ПодразделениеОрганизации = Автор.Подразделение;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Маршрутизировать = Константы.МаршрутизироватьОтчетКомитенту.Получить();
	СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается;
	ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках;

	//ПроцентКомиссионногоВознаграждения = 3;
	СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
	
	//	СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ТекущаяДата(),"Отчет комитенту");
	//	ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
	//	ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	//
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		// Заполнение шапки
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
		//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//Комментарий = ДанныеЗаполнения.Комментарий;
		//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		//КурсВзаиморасчетов = ДанныеЗаполнения.КурсВзаиморасчетов;
		//Организация = ДанныеЗаполнения.Организация;
		//Ответственный = ДанныеЗаполнения.Ответственный;
		//ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		//СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
		//СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		//УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
		//ПоставщикВУ = ДанныеЗаполнения.ПоставщикВУ;
		СписокСвойств = "ВалютаДокумента, КратностьВзаиморасчетов,
						|КурсВзаиморасчетов, Организация, ПодразделениеОрганизации,
						|СуммаВключаетНДС, УчитыватьНДС, ПоставщикВУ"; 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, СписокСвойств);
// Евросиб Гудкова) 		
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		// Евросиб US 87923 TA 104654 Рыбьяков К.А. 18.03.2025 ((
		Если ДанныеЗаполнения.Страхование Тогда
			СчетНаОплату = Документы.ПоступлениеТоваровУслуг.НайтиСчетНаОплатуИзПТУСПризнакомСтрахование(ДанныеЗаполнения);
			Если СчетНаОплату <> Неопределено Тогда
				СчетНаОплатуПокупателю = СчетНаОплату;
			КонецЕсли;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 18.03.2025 ))
		Если ДанныеЗаполнения.Товары.Количество() > 0 Тогда
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				Если ТекСтрокаТовары.Перевыставление Тогда
					НоваяСтрока = Товары.Добавить();
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
					//НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
					//НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
					//НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
					//НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
					//НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
					//НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
					//НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
// Евросиб Гудкова) 		
					НоваяСтрока.КлючСтроки = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
//		Если ДанныеЗаполнения.Услуги.Количество() > 0 Тогда
//			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Услуги Цикл
//				Если ТекСтрокаТовары.Перевыставление Тогда
//					НоваяСтрока = Товары.Добавить();
////Евросиб Гудкова( 01.11.2019 кому-то построчно платят
////было
//					//НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
//					//НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
//					//НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
//					//НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
//					//НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
//					//НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
//					//НоваяСтрока.Содержание = ТекСтрокаТовары.Содержание;
//					//НоваяСтрока.ГУИДПТУ = ТекСтрокаТовары.ГУИДПТУ;
//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
//// Евросиб Гудкова) 		
//					НоваяСтрока.КлючСтроки = 1;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;	
		Если Товары.Количество() > 0 Тогда
			НоваяСтрока = Поставщики.Добавить();
			НоваяСтрока.Поставщик = ДанныеЗаполнения.Контрагент;
			НоваяСтрока.КПППоставщика = ДанныеЗаполнения.Контрагент.КПП;
			НоваяСтрока.Партия = ДанныеЗаполнения.Ссылка;
			НоваяСтрока.КлючСтроки = 1;
			СФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДанныеЗаполнения.Ссылка, "СчетФактураПолученный");
			Если СФ <> Неопределено Тогда
				НоваяСтрока.ПолученСФ = Истина;
			//	НоваяСТрока.СчетФактура = СФ;
				НоваяСтрока.ДатаСФ = СФ.ДатаВходящегоДокумента;
				НоваяСтрока.НомерСчетаФактуры = СФ.НомерВходящегоДокумента;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ДанныеЗаполнения.ЭтоКомиссия Тогда
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
			//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
			//Комментарий = ДанныеЗаполнения.Комментарий;
			//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
			//КурсВзаиморасчетов = ДанныеЗаполнения.КурсВзаиморасчетов;
			//Организация = ДанныеЗаполнения.Организация;
			//Ответственный = ДанныеЗаполнения.Ответственный;
			//ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
			//СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
			//СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			//УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
			//ПокупательВУ = ДанныеЗаполнения.ПокупательВУ;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
// Евросиб Гудкова) 		
			ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах;
			Контрагент = ДанныеЗаполнения.Комитент;
			ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКомитента;
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			Если ДанныеЗаполнения.АгентскиеУслуги.Количество() > 0 Тогда
				Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.АгентскиеУслуги Цикл
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
					НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
					НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
					НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
					НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
					НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
					НоваяСтрока.Содержание = ТекСтрокаТовары.Содержание;
					НоваяСтрока.Покупатель = ДанныеЗаполнения.Контрагент;
					НоваяСтрока.ДатаРеализации = ДанныеЗаполнения.Дата;
					НоваяСтрока.КлючСтроки = 1;
				КонецЦикла;
			КонецЕсли;	
		Иначе
			Комментарий = "ОТКАЗ";
			Сообщить("Для ввода отчета комитенту о продажах на основании реализации, укажите в шапке документа Комиссионная торговля с указанием Комитента.")

		КонецЕсли;	
	КонецЕсли;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	//Евросиб Каблов 09.04.2025 )
	
	УстановитьДатыДокумента(); //Гудкова
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента); //Гудкова ошибка ТекущаяДата());
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
//	УстановитьДатыДокумента();
//	УчитыватьНДС = Организация.УчитыватьНДСВДокументах;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьОтчетКомитенту.Получить();
	
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	Выставлен = Ложь;
	ДатаВыставления = '00010101';
	//Евросиб Каблов 11.07.2020 ) TASK 23506
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	ПериодВО = '00010101';
	НомерДляПечати = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 112685 05.11.2025
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
		Если СчетаНаОплатуПокупателям.Количество() = 0 И НЕ ЕстьСчетаВКорРту() Тогда 
			ОбщегоНазначения.СообщитьПользователю("На вкладке ""Счета покупателям"" не привязан счет покупателю. Для проведения добавьте счет",,,,Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ (ПометкаУдаления И (ПометкаУдаления <> Ссылка.ПометкаУдаления)) Тогда
		Если СчетаНаОплатуПокупателям.Количество() <> 0 Тогда 
			ОбщегоНазначения.СообщитьПользователю("Для отмены проведения/пометки на удаление, удалите счет на вкладке ""Счета покупателям"" отчета комитенту",,,,Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 112685 05.11.2025
	
	//Евросиб Каблов 18.11.2021 ( Task 41795
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	//Евросиб Каблов 18.11.2021 )
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	Если Не БезДоверенностей Тогда
//Евросиб Гудкова( 15.02.2021 Ticket№ 0223421
//		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(Дата,"Отчет комитенту",ЦФО);
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДатаДокумента,"Отчет комитенту",ЦФО);
// Евросиб Гудкова) 		
		ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
	
	//Евросиб СубботинВ #120291 24.09.2025 Начало
    //СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Товары.Итог("СуммаВознаграждения") , БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДСВознаграждения), УчитыватьНДС, СуммаВознагражденияВключаетНДС);
    СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Товары.Итог("СуммаВознаграждения") , БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтавкаНДСВознаграждения), УчитыватьНДС, Ложь);
	//Евросиб СубботинВ #120291 24.09.2025 Конец

	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ Состояния.Количество() = 0;
	
	//++ Зубов 36879 12.08.2021
	Если ЗначениеЗаполнено(Ссылка) И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаДокумента").ДатаДокумента<>ДатаДокумента Тогда
		ДатаДокументаИзменена = Истина;
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = Истина;
	Иначе
		ДатаДокументаИзменена = Ложь;
	КонецЕсли;
	//-- Зубов 36879 12.08.2021
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
// Евросиб Гудкова) 
//Евросиб Максимова
        ПараметрыЗапроса.Вставить("ОплатаОригинал",ДоговорКонтрагента.ОплатаПоОригиналу);
//Евросиб Максимова
		//++ Зубов 36879 12.08.2021
		ПараметрыЗапроса.Вставить("ДатаДокументаИзменена",ДатаДокументаИзменена);
		//-- Зубов 36879 12.08.2021
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Дата);//Гудкова 0206196 МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	                    
	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный");
	
	Если СчФ <> Неопределено 
		И ПометкаУдаления 
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счф, "ПометкаУдаления") Тогда
			ОбСчФ = СчФ.ПолучитьОбъект();
			ОбСчФ.УстановитьПометкуУдаления(Истина);
	КонецЕСли;
		
	СформироватьНомерДляПечати();
	
	// Евросиб Фролов (15.03.2022 Task №40571
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РаботаСТабличнымиЧастями.ПроверитьКоличествоВТабличнойЧасти(Товары, "Товары и услуги", Отказ,, ЭтотОбъект);
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	Если ДополнительныеСвойства.Свойство("НеВыполнятьНикакихДействий") Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 18.11.2021 ( Task 41795
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Документы.Акцепт.ПерезаполнитьВАкцептеДанныеПоУчДокументу(Ссылка);
	КонецЕсли;
	//Евросиб Каблов 18.11.2021 )
	
	//++Перевыставляемые
	Для каждого Стр из Поставщики Цикл	
		Если Не ЗначениеЗаполнено(Стр.СчетФактура) Тогда
			Если ЗначениеЗаполнено(Ссылка) Тогда
				СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный",Стр.Партия);
			КонецЕсли;	
			Если СчФ <> Неопределено Тогда
//Евросиб Гудкова( 01.10.2021  
				//Если СчФ.ПометкаУдаления Тогда
				//	ОбСФ = СчФ.ПолучитьОбъект();
				//	ОБСФ.ПометкаУдаления = Ложь;
				//	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Ссылка,СчФ,Стр.Партия);
				//Иначе
// Евросиб Гудкова) 				
					БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Ссылка,СчФ,Стр.Партия);
				//КонецЕсли;
			Иначе
				//	Если Не ЗначениеЗаполнено(Стр.СчетФактура) Тогда
				СчФ = ВыписатьСчетФактуру(Ссылка,Стр.Партия);
			КонецЕсли;
			Если СчФ <> Неопределено Тогда
				Стр.СчетФактура = СчФ.Ссылка;
				//НомерДляПечатиВозмещаемые = СчФ.НомерДляПечати;
				ОбменДанными.Загрузка = Истина;
				СчФ.Записать();
				Если Проведен = Истина Тогда
					СчФ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				//Евросиб - АСуслов 24.05.2021 17:28:56 #
				//(
				//если нужно заполнить сф в тч поставщики, то док нужно записать принудительно, т.к. всё происходит при записи.
				Записать();
				//)
				//Евросиб - АСуслов 24.05.2021 17:28:57 #
				ОбменДанными.Загрузка = Ложь;
				Сообщить("Документ счет-фактура № " + СчФ.Номер + " от " + Формат(СчФ.Дата,"ДФ=dd.MM.yyyy") + " на перевыставляемые услуги записан в базу.");
			КонецЕсли;
		Иначе
			Если Не ПометкаУдаления	Тогда
			СчФ = Стр.СчетФактура;
			
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Ссылка,СчФ,Стр.Партия);
			
			//НомерДляПечати = СчФ.НомерДляПечати;
			Сообщить("Документ счет-фактура № " + СчФ.Номер + " от " + Формат(СчФ.Дата,"ДФ=dd.MM.yyyy") + " на перевыставляемые услуги перезаполнен по документу-основанию.");
			Иначе
			СчФ = Стр.СчетФактура;
			ОбСчФ = СчФ.ПолучитьОбъект();
			//ОбСчФ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//ОбСчФ.ПометкаУдаления = Истина;
			//ОбСчФ.Записать();
			ОбСчФ.УстановитьПометкуУдаления(Истина);
			Сообщить("Документ счет-фактура № " + СчФ.Номер + " от " + Формат(СчФ.Дата,"ДФ=dd.MM.yyyy") + " на перевыставляемые услуги помечен на удаление.");
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		//Евросиб Каблов 28.07.2020 ( При установке признака Выставлен, не нужно записывать Счет-фактуру
		ЗапретитьЗаписыватьСчетФактуру = Неопределено;
		Если Не ДополнительныеСвойства.Свойство("ЗапретитьЗаписыватьСчетФактуру", ЗапретитьЗаписыватьСчетФактуру) Тогда
			ЗапретитьЗаписыватьСчетФактуру = Ложь;
		КонецЕсли;
		
		Если Не ЗапретитьЗаписыватьСчетФактуру Тогда
			СнятьПризнакВыставленУСчетаФактуры = Неопределено;
			Если Не ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) Тогда
				СнятьПризнакВыставленУСчетаФактуры = Ложь;
			КонецЕсли;
		//Евросиб Каблов 28.07.2020 )
			//На вознаграждение
			Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураВыданный");
			Если СчетФактура<>Неопределено Тогда
				ОбСчФ = Счетфактура.ПолучитьОбъект();
				//Евросиб Каблов 28.07.2020 ( 
				Если ОбСчф.Выставлен Тогда
					СнятьПризнакВыставленУСчетаФактуры = Неопределено;
					Если ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) И СнятьПризнакВыставленУСчетаФактуры Тогда
						ОбСчф.Выставлен = Ложь;
						ОбСчф.ДатаВыставления = '00010101';
					КонецЕсли;
				КонецЕсли;
				//Евросиб Каблов 28.07.2020 )
				Если СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается
					ИЛИ ПометкаУдаления Тогда
					ОбСчФ.УстановитьПометкуУдаления(Истина) ;
					Сообщить ("Счет-фактура № " + ОбСчФ.Номер + " от " + Формат(ОбСчФ.Дата,"ДФ=dd.MM.yyyy") + " помечен на удаление.");
				Иначе
					Если ОбСчФ.ПометкаУдаления = Истина Тогда
						ОбСчФ.ПометкаУдаления = Ложь;
					КонецЕсли;
					БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
				ОбСчФ.Записать();
				Сообщить("Счет-фактура № " + ОбСчФ.Номер + " от " + Формат(ОбСчФ.Дата,"ДФ=dd.MM.yyyy") + " перезаполнен по документу-основанию.");
				КонецЕСли;
			ИначеЕсли НЕ СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда 
				ВыписатьСчетФактуру(Ссылка);
			КонецЕсли;
			//Перевыставление заполнение документа-основания в созданных счет-фактурах
			ДЛя каждого Стр из Поставщики Цикл
				Если ЗначениеЗаполнено(Стр.СчетФактура) и Не ЗначениеЗаполнено(Стр.СчетФактура.ДокументОснование) Тогда
					СчФ = Стр.СчетФактура.ПолучитьОбъект();
					//Евросиб Каблов 28.07.2020 ( 
					Если СчФ.Выставлен Тогда
						СнятьПризнакВыставленУСчетаФактуры = Неопределено;
						Если ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) И СнятьПризнакВыставленУСчетаФактуры Тогда
							СчФ.Выставлен = Ложь;
							СчФ.ДатаВыставления = '00010101';
						КонецЕсли;
					КонецЕсли;
					//Евросиб Каблов 28.07.2020 )
					СчФ.ДокументОснование = Ссылка;
					СчФ.ДокументыОснования.Очистить();
					НовСтр = Счф.ДокументыОснования.Добавить();
					НовСтр.ДокументОснование = Ссылка;
					СчФ.Записать();
					Если Проведен = Истина Тогда
						СчФ.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;

				КонецЕсли;
			КонецЦИкла;
		//Евросиб Каблов 28.07.2020 (
		КонецЕсли;
		//Евросиб Каблов 28.07.2020 )
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
	//ГруппаДКССчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(СчетНаОплатуПокупателю);
	//Если ГруппаДКССчета <> Неопределено Тогда
	//	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(СчетНаОплатуПокупателю, ГруппаДКССчета);
	//КонецЕсли;
	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
		ПервыйСчетПокупателю = СчетаНаОплатуПокупателям[0].СчетПокупателю;		
		ГруппаДКССчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(ПервыйСчетПокупателю);		
		Если ГруппаДКССчета <> Неопределено Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(ПервыйСчетПокупателю, ГруппаДКССчета);
		КонецЕсли;		
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	//ВидЗадолженностиСчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(СчетНаОплатуПокупателю);
	//Если ВидЗадолженностиСчета <> Неопределено Тогда
	//	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(СчетНаОплатуПокупателю, ВидЗадолженностиСчета);
	//КонецЕсли;
	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
		ПервыйСчетПокупателю = СчетаНаОплатуПокупателям[0].СчетПокупателю;		
		ВидЗадолженностиСчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю);		
		Если ВидЗадолженностиСчета <> Неопределено Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю, ВидЗадолженностиСчета);
		КонецЕсли;		
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения(Отказ, РежимПроведения);
	
	//Евросиб Коханенко Н.А. 20.08.2025 (( #117444 
	ДобавитьАналитикуВидЗадолженностиЧерезСделку(); 
	//Евросиб Коханенко Н.А. 20.08.2025 )) #117444 
	
	// Евросиб US 114211 TA 118161 Рыбьяков К.А. 31.08.2025 ((
	РегистрыСведений.ЗакрывающиеДокументыПоКлючамСоставаПоезда.ОтразитьДвиженияПоЗакрывающимДокументам(ЭтотОбъект, Движения.ЗакрывающиеДокументыПоКлючамСоставаПоезда);
	// Евросиб Рыбьяков К.А. 31.08.2025 ))
	
КонецПроцедуры

Процедура СформироватьДвижения(Отказ, РежимПроведения) Экспорт
	
	//Евросиб Каблов 18.03.2021 (
	////Евросиб Каблов М.Б. 19.11.2019 (
	//ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекущаяДата());
	//ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	////Евросиб Каблов М.Б. 19.11.2019 )
	ДатаКурсаВалют = Макс(ДатаДокумента, ПериодВО);
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ДатаКурсаВалют);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурсаВалют);
	//Евросиб Каблов 18.03.2021 )
	
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
	ОкруглениеКурса = Справочники.ФормированиеФинДокументов.ПолучитьЗначениеОкругленияКурсаИзПравил( ПравилоФормирования );
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
	
	//Евросиб Каблов 07.10.2022 ( 54532
	//Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;

	//Если ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда		
	//	// Евросиб Фролов (12.01.2022 Task№ 45208
	//	// Раньше движение писалось одной строкой, которая включала сумму с вознагражением.
	//	// Теперь нужно разделить сумму ВР и вознагражения.
	//	// Закомментировал
	//	//// регистр ВзаиморасчетыСПокупателями Расход
	//	//Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
	//	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	//Движение.Период = Макс(ДатаДокумента, ПериодВО);
	//	//Движение.Организация = Организация;
	//	//Движение.Контрагент = Контрагент;
	//	//Движение.Договор = ДоговорКонтрагента;
	//	//Движение.ВалютаРасчетов = ВалютаДокумента;
	//	//Движение.ДатаРасчетов = ДатаДокумента;
	//	//Движение.ДокументВзаиморасчетов = Ссылка;
	//	////СуммаНДСВознаграждения = Товары.Итог("СуммаНДСВознаграждения");
	//	//СуммаНДС = Товары.Итог("СуммаНДС");
	//	//
	//	//Движение.СуммаБезНДС = СуммаВознаграждения + СуммаДокумента - СуммаНДСВознаграждения - СуммаНДС;
	//	//Движение.СуммаНДС = СуммаНДСВознаграждения + СуммаНДС;
	//	//Движение.СуммаСНДС = СуммаВознаграждения + СуммаДокумента;
	//	////Евросиб Каблов 18.03.2021 (
	//	//Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	//Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	//Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	////Евросиб Каблов 18.03.2021 )
	//	
	//	// Возмещаемые расходы
	//	Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Макс(ДатаДокумента, ПериодВО);
	//	Движение.Организация = Организация;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Договор = ДоговорКонтрагента;
	//	Движение.ВалютаРасчетов = ВалютаДокумента;
	//	Движение.ДатаРасчетов = ДатаДокумента;
	//	Движение.ДокументВзаиморасчетов = Ссылка;
	//	СуммаНДС = Товары.Итог("СуммаНДС");
	//	
	//	Движение.СуммаБезНДС = СуммаДокумента - СуммаНДС;
	//	Движение.СуммаНДС = СуммаНДС;
	//	Движение.СуммаСНДС = СуммаДокумента;
	//	Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	Движение.ЭтоВР = Истина;
	//	
	//	// Вознагражение
	//	Если СпособРасчетаКомиссионногоВознаграждения <> Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда 
	//		Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Макс(ДатаДокумента, ПериодВО);
	//		Движение.Организация = Организация;
	//		Движение.Контрагент = Контрагент;
	//		Движение.Договор = ДоговорКонтрагента;
	//		Движение.ВалютаРасчетов = ВалютаДокумента;
	//		Движение.ДатаРасчетов = ДатаДокумента;
	//		Движение.ДокументВзаиморасчетов = Ссылка;
	//		
	//		Движение.СуммаБезНДС = СуммаВознаграждения - СуммаНДСВознаграждения;
	//		Движение.СуммаНДС = СуммаНДСВознаграждения;
	//		Движение.СуммаСНДС = СуммаВознаграждения;
	//		Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//		Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//		Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
	//	КонецЕсли;
	//	// Евросиб Фролов)
	//	
	//КонецЕсли;
	ВзаиморасчетыСервер.ОтчетКомитенту_СформироватьДвиженияВзаиморасчетыСПокупателями(ЭтотОбъект);	
	//Евросиб Каблов 07.10.2022 )
	
//Евросиб Каблов М.Б. 19.11.2019 (
	//Продажи
	Продажи = Движения.Продажи;
	Продажи.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Движение = Продажи.Добавить();
		Движение.Период = Макс(ДатаДокумента, ПериодВО);
		
		//Измерения
		Движение.ДокументПродажи = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		Движение.Сделка = Сделка;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		
		//Ресурсы
		Движение.Количество = СтрокаТЧ.Количество;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СтрокаТЧ.СуммаВознаграждения, СтрокаТЧ.СуммаВознаграждения + СтрокаТЧ.СуммаНДСВознаграждения);			
		//Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		//Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДСВознаграждения, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДСВознаграждения, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
		
	КонецЦикла;

	// регистр ЗакрытиеПериодов
	//Движения.ЗакрытиеПериодов.Очистить();
	//Движения.ЗакрытиеПериодов.Записывать = Истина;
	//Для каждого Стр из Товары Цикл
	//	
	//	Движение 					= Движения.ЗакрытиеПериодов.ДобавитьПриход();
	//	Движение.ГУИДСтроки 		= Стр.СтрокаДоходовСделки;
	//	Движение.Договор 			= ДоговорКонтрагента;
	//	Движение.Контрагент 		= Контрагент;
	//	Движение.Организация 		= Организация;
	//	Движение.Период				= НачалоМесяца(ПериодВО)+24*3600;;
	//	Движение.ПериодВО			= НачалоМесяца(ПериодВО);
	//	Движение.ПланФакт			= Перечисления.ПланФактСчет.Факт;
	//	Движение.Регистратор		= Ссылка;
	//	Движение.Сделка				= Сделка;
	//	Движение.Перевыставляемая	= Истина;
	//	Движение.Услуга				= Стр.Номенклатура;
	//	Движение.СуммаДохода		= Стр.Сумма + ?(СуммаВключаетНДС, 0, Стр.СуммаНДС);
	//	Движение.СуммаНДСДохода		= Стр.СуммаНДС;
	//	
	//	Движение 					= Движения.ЗакрытиеПериодов.ДобавитьПриход();
	//	Движение.ГУИДСтроки 		= Стр.СтрокаДоходовСделки;
	//	Движение.Договор 			= ДоговорКонтрагента;
	//	Движение.Контрагент 		= Контрагент;
	//	Движение.Организация 		= Организация;
	//	Движение.Период				= НачалоМесяца(ПериодВО)+24*3600;;
	//	Движение.ПериодВО			= НачалоМесяца(ПериодВО);
	//	Движение.ПланФакт			= Перечисления.ПланФактСчет.Факт;
	//	Движение.Регистратор		= Ссылка;
	//	Движение.Сделка				= Сделка;
	//	Движение.Перевыставляемая	= Ложь;
	//	Движение.Услуга				= Справочники.Номенклатура.Вознаграждение;  // Шейеко О.Е. (02.04.2021) Заменил на номенклатуру-вознаграждения
	//	Движение.СуммаДохода		= Стр.СуммаВознаграждения + ?(СуммаВознагражденияВключаетНДС, 0, Стр.СуммаНДСВознаграждения);
	//	Движение.СуммаНДСДохода		= Стр.СуммаНДСВознаграждения;
	//	
	//КонецЦикла;
	//Евросиб - АСуслов 29.08.2021 13:56:42 #33698
	//(
	УчетДоходовРасходовСервер.ОК_СформироватьДвиженияДоходыРасходы(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 29.08.2021 13:56:45 #33698
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	Движения.СчетаПокупателей.Записывать = Истина;
	Движения.СчетаПокупателей.Загрузить(ПолучитьТаблицуДвиженийСчетаПокупателей());
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
	Движения.СчетаПокупателейПоУчетнымЕдиницам.Записывать = Истина;
	Движения.СчетаПокупателейПоУчетнымЕдиницам.Загрузить(ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам());
	//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец

	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный");
	
	Если СчФ <> Неопределено Тогда
		ОбСчФ = СчФ.ПолучитьОбъект();
		Если Не ОбСчФ.ПометкаУдаления Тогда
			ОбСчФ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕСли;

	//Для каждого Стр из Поставщики Цикл
	//	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный",Стр.Партия);
	//	Если СчФ <> Неопределено Тогда
	//		ОбСчФ = СчФ.ПолучитьОбъект();
	//		Если Не ОбСчФ.ПометкаУдаления Тогда
	//			ОбСчФ.Записать(РежимЗаписиДокумента.Проведение);
	//		КонецЕсли;
	//	КонецЕСли;
	//КонецЦикла;
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
Функция ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация КАК Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент КАК Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)) КАК СчетПокупателю,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата КАК Период,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка КАК Сделка,
			|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Номенклатура,
			|	СУММА(ВЫБОР
			|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
			|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
			|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
			|		КОНЕЦ) КАК Сумма,
			|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
			|	СУММА(ОтчетКомитентуОПродажахТовары.Количество) КАК Количество
			|ИЗ
			|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
			|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
			|			И ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025 - Пока выполнил соединение только по ссылке предполагая, что в тч будет один счет, дальше когда будет понятно как заполнять остальные колонки в тч счетов возможно нужно дорабатывать 
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
			|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|ГДЕ
			|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)),
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Номенклатура,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка,
			|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)) КАК СчетПокупателю,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
			|	СУММА(ВЫБОР
			|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознагражденияВключаетНДС
			|				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаВознаграждения
			|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
			|		КОНЕЦ),
			|	НЕОПРЕДЕЛЕНО,
			|	СУММА(ОтчетКомитентуОПродажахТовары.Количество)
			|ИЗ
			|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025 - Пока выполнил соединение только по ссылке предполагая, что в тч будет один счет, дальше когда будет понятно как заполнять остальные колонки в тч счетов возможно нужно дорабатывать 
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
			|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|ГДЕ
			|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)),
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, начало
Функция ПолучитьТаблицуДвиженийСчетаПокупателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация КАК Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент КАК Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)) КАК СчетПокупателю,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата КАК Период,
			|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Номенклатура,
			|	СУММА(ВЫБОР
			|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
			|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
			|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
			|		КОНЕЦ) КАК Сумма
			|ИЗ
			|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025 - Пока выполнил соединение только по ссылке предполагая, что в тч будет один счет, дальше когда будет понятно как заполнять остальные колонки в тч счетов возможно нужно дорабатывать 
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
			|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|ГДЕ
			|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)),
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Номенклатура
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)) КАК СчетПокупателю,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
			|	СУММА(ВЫБОР
			|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознагражденияВключаетНДС
			|				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаВознаграждения
			|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
			|		КОНЕЦ)
			|ИЗ
			|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025 - Пока выполнил соединение только по ссылке предполагая, что в тч будет один счет, дальше когда будет понятно как заполнять остальные колонки в тч счетов возможно нужно дорабатывать 
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
			|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
			|				И ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение)
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|ГДЕ
			|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка	
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			//|	ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю КАК СчетПокупателю,
			|	ЕстьNULL(ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)),
			//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
			|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
			|	ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 106023 / TA 106025, 27-05-2025, конец

//Функция РублеваяСумма(ИсхСумма) //ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, не используется, закомментировал
//	ВалютаРег = Константы.ВалютаРегламентированногоУчета.Получить();
//	Если ВалютаДокумента <> ВалютаРег Тогда
//		СуммаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(ИсхСумма,ВалютаДокумента,ВалютаРег,Дата);
//		Возврат СуммаРуб;
//	Иначе
//		Возврат ИсхСумма;
//	КонецЕсли;
//КонецФункции

Функция НайтиСчетНаОплату(КомиссионныеУслуги)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	                      |ГДЕ
	                      |	СчетНаОплатуПокупателю.КомиссионныеУслуги = &КомиссионныеУслуги
	                      |	И СчетНаОплатуПокупателю.ДокументыОснования.Документ = &ДокументОснование");
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Запрос.УстановитьПараметр("КомиссионныеУслуги", КомиссионныеУслуги);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Счет = Выборка.Ссылка;
	Иначе
		Счет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Счет;
КонецФункции

Функция ВыписатьСчетФактуру(ДокументОснование, ДокументПартии = Неопределено) Экспорт
	СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДокументОснование,СчФ,ДокументПартии);

	СчФ.Записать();
	Возврат СчФ;
КонецФункции

//Даты документа
Процедура УстановитьДатыДокумента() Экспорт //Гудкова
	
//	МаксДата = Дата ('00010101');
////Евросиб Гудкова( 01.11.2019 исправление ошибок + мне не платят за количество строк в коде
////было
//	//Для каждого Стр из Поставщики Цикл
//	//	Если Стр.ДатаСФ >= МаксДата Тогда
//	//		МаксДата = Стр.ДатаСФ;
//	//		Подрядчик = Стр.Поставщик;
//	//		Партия = Стр.Партия;
//	//	КонецЕсли;
//	//КонецЦИкла;
//	//Если Подрядчик <> Неопределено Тогда
//	//	Если Подрядчик.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
//	//		Если МаксДата  >= ОткрытыйПериод() Тогда
//	//			ДатаДокумента = МаксДата;
//	//			//Объект.ПериодВО = НачалоМесяца(МаксДата);
//	//		Иначе
//	//			ДатаДокумента = ОткрытыйПериод();
//	//			//Объект.ПериодВО = НачалоМесяца(ОткрытыйПериод());
//	//		КонецЕсли;
//	//	Иначе
//	//		Если Партия.Дата  >= ОткрытыйПериод() Тогда
//	//			ДатаДокумента =  Партия.Дата;
//	//		//	Объект.ПериодВО = НАчалоМесяца(Партия.Дата);
//	//		Иначе
//	//			ДатаДокумента = ОткрытыйПериод();
//	//		//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//	//		КонецЕсли;
//	//	КонецЕсли;
//	//КонецЕсли;
//	//Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
//	//	ДатаДокумента = ТекущаяДата();
//	//КонецЕсли;
//	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
//	ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
//	ПериодВО = Макс(НачалоМесяца(ПериодВО), ДатаОткрытогоПериода);
//	Если Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
//		Для каждого Стр из Поставщики Цикл
//			МаксДата = ?(Стр.Поставщик.СтранаРегистрации = Справочники.СтраныМира.Россия, Макс(МаксДата, Стр.ДатаСФ), Макс(МаксДата, Стр.Партия.ДатаВходящегоДокумента));
//		КонецЦИкла;
//		ДатаДокумента = Макс(МаксДата, ПериодВО);
//	Иначе //ветки про нерезидентов вообще не было в первом варианте реализации алгоритма
//		Если ПериодВО > ДатаОткрытогоПериода Тогда
//			ДатаДокумента = ТекущаяДата();
//		Иначе	
//			ДатаДокумента = Мин(КонецМесяца(ПериодВО), ТекущаяДата());
//		КонецЕсли; 
//	КонецЕсли; 
//// Евросиб Гудкова) 			

	//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, начало
	Подрядчик = Справочники.Контрагенты.ПустаяСсылка();
	ДатаВходящегоДокумента = Дата(1,1,1);
	Если Поставщики.Количество()>0 Тогда
		Подрядчик = Поставщики[0].Поставщик;
		Если ЗначениеЗаполнено(Поставщики[0].Партия) Тогда
			ДатаВходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поставщики[0].Партия, "ДатаВходящегоДокумента");
		КонецЕсли;
	КонецЕсли;
	ДатыДокументов = Документы.ОтчетКомитентуОПродажах.ОпределитьДатыДокументов(Организация, Подрядчик, Контрагент, ДоговорКонтрагента, ДатаВходящегоДокумента);
	ДатаДокумента = ДатыДокументов.ДатаОтчетаЭкспедитора;
	//Евросиб(ДИТ), Беляев СЮ, US 88169 / TA 88173, 26-03-2025, конец
	
КонецПроцедуры

Функция ОткрытыйПериод()
	//Гудкова
	//ДатаЗП = Дата('00010101');
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
	//                      |ИЗ
	//                      |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних");
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ДатаЗП = Выборка.Период;
	//КонецЕсли;
	//Если ДатаЗП <> Дата('00010101') Тогда
	//	СледующийОткрытыйМесяц = НачалоМесяца(ДобавитьМесяц(ДатаЗП,1));
	//Иначе
	//	СледующийОткрытыйМесяц = Дата('00010101');
	//КонецЕсли;
	//
	//Возврат СледующийОткрытыйМесяц;
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный");	
	Если СчФ <> Неопределено Тогда
		ОбСчФ = СчФ.ПолучитьОбъект();
		Если Не ОбСчФ.ПометкаУдаления Тогда
			ОбСчФ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕСли;

	Для каждого Стр из Поставщики Цикл
		СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный",Стр.Партия);
		Если СчФ <> Неопределено Тогда
			ОбСчФ = СчФ.ПолучитьОбъект();
			Если Не ОбСчФ.ПометкаУдаления Тогда
				ОбСчФ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЕСли;
	КонецЦикла;	

КонецПроцедуры

//Евросиб Каблов 05.03.2021 Ticket#0225298
Процедура СнятьПризнакВыставлен() Экспорт
	
	Если Выставлен Тогда
		Выставлен = Ложь;
		ДатаВыставления = '00010101';
		ДополнительныеСвойства.Вставить("СнятьПризнакВыставленУСчетаФактуры", Истина);
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНомерДляПечати()
	//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
	//СчетАв = СчетНаОплатуПокупателю;
	СчетАв = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
		СчетАв = СчетаНаОплатуПокупателям[0].СчетПокупателю;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
	НомерДляПечатиДоИзменения = НомерДляПечати;
	НомерДляПечатиВознаграждениеДоИзменения = НомерДляПечатиВознаграждение;
	НомерДляПечати = СтрШаблон("%1/%2/%3",
								Номер,
								СчетАВ.Номер,
								?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
	Если ЗначениеЗаполнено(РезервНомераВознаграждение) Тогда
		НомерДляПечатиВознаграждение= СтрШаблон("%1/%2/%3",
												РезервНомераВознаграждение.Номер,
												СчетАВ.Номер,
												?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н"));
	КонецЕсли;											
	Если ЗначениеЗаполнено(Ссылка) И (НомерДляПечати <> НомерДляПечатиДоИзменения ИЛИ НомерДляПечати <> НомерДляПечатиДоИзменения) Тогда
		ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Ссылка);
		Если НЕ ДокументВЗакрытомПериоде Тогда
			//Удаление признака выгрузки
			ЗаписьПротоколаОбмена = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
			ЗаписьПротоколаОбмена.УзелОбмена = Перечисления.УзлыОбмена.УПП;
			ЗаписьПротоколаОбмена.Объект = Ссылка;
			ЗаписьПротоколаОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
			ЗаписьПротоколаОбмена.Удалить();
			ОбщегоНазначения.СообщитьПользователю("Изменился номер для печати, признак выгрузки снят. Был номер " + НомерДляПечатиДоИзменения + " стал " + НомерДляПечати);
		Иначе
			НомерДляПечати = НомерДляПечатиДоИзменения;
			НомерДляПечатиВознаграждение = НомерДляПечатиВознаграждениеДоИзменения;
			ОбщегоНазначения.СообщитьПользователю("Документ выгружен во внешнюю систему, номер для печати не будет изменен");
		КонецЕсли; 
	КонецЕсли; 
	
	СтруктураПоиска = Новый Структура("СчетПокупателю",СчетАв);
	
	НайденныеСтроки = СчетаНаОплатуПокупателям.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.НомерДляПечати = НомерДляПечати;
	КонецЦикла;	
	
КонецПроцедуры

//Евросиб Каблов 07.10.2022 54532
Процедура СформироватьДвиженияВзаиморасчетыСПокупателями() Экспорт

	ВзаиморасчетыСПокупателями = Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПокупателями.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			
			Движение = ВзаиморасчетыСПокупателями.ДобавитьРасход();
			Движение.Период = Макс(ДатаДокумента, ПериодВО);
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Договор = ДоговорКонтрагента;
			Движение.ВалютаРасчетов = ВалютаДокумента;
			Движение.ДатаРасчетов = ДатаДокумента;
			Движение.ДокументВзаиморасчетов = Ссылка;
			Движение.ВидЗадолженности = СтрокаТЧ.ВидЗадолженности;
			
			Движение.СуммаБезНДС = ?(СуммаВключаетНДС, СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС, СтрокаТЧ.Сумма);
			Движение.СуммаНДС = СтрокаТЧ.СуммаНДС;
			Движение.СуммаСНДС = ?(СуммаВключаетНДС, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС);
			//Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			//Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			//Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			Движение.ЭтоВР = Истина;
			
			// Вознагражение
			Если СпособРасчетаКомиссионногоВознаграждения <> Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
				
				Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Макс(ДатаДокумента, ПериодВО);
				Движение.Организация = Организация;
				Движение.Контрагент = Контрагент;
				Движение.Договор = ДоговорКонтрагента;
				Движение.ВалютаРасчетов = ВалютаДокумента;
				Движение.ДатаРасчетов = ДатаДокумента;
				Движение.ДокументВзаиморасчетов = Ссылка;
				Движение.ВидЗадолженности = СтрокаТЧ.ВидЗадолженности;
				
				Движение.СуммаБезНДС = ?(СуммаВознагражденияВключаетНДС, СтрокаТЧ.СуммаВознаграждения - СтрокаТЧ.СуммаНДСВознаграждения, СтрокаТЧ.СуммаВознаграждения);
				Движение.СуммаНДС = СтрокаТЧ.СуммаНДСВознаграждения;
				Движение.СуммаСНДС = ?(СуммаВознагражденияВключаетНДС, СтрокаТЧ.СуммаВознаграждения, СтрокаТЧ.СуммаВознаграждения + СтрокаТЧ.СуммаНДСВознаграждения);
				//Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
				//Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
				//Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

//Евросиб Коханенко Н.А. 20.08.2025 (( #117444 
Процедура ДобавитьАналитикуВидЗадолженностиЧерезСделку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьДоплатныеПВ
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДокумент
		|		ПО (СделкаДоходы.Калькуляция = КалькуляцияДокумент.Ссылка)
		|			И КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ДоплатныеПВ) 
		|			И СделкаДоходы.УчДокумент = &УчДокумент";
	Запрос.УстановитьПараметр("УчДокумент", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(Ссылка, ПредопределенноеЗначение("Перечисление.ВидыЗадолженности.ДоплатныеПВ"));
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 20.08.2025 )) #117444 

Функция ЕстьСчетаВКорРту()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации.СчетаНаОплатуПокупателям КАК КорректировкаРеализацииСчетаНаОплатуПокупателям
		|ГДЕ
		|	КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка.Проведен
		|	И КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка.ДокументРеализации = &ОК
		|	И КорректировкаРеализацииСчетаНаОплатуПокупателям.СчетПокупателю.Проведен
		|	И КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка.ВидОперации <> &ВидОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Проведен
		|	И КорректировкаРеализации.ДокументРеализации = &ОК
		|	И КорректировкаРеализации.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ОК", Ссылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции	