
&НаСервере
Процедура ЗагрузитьПоВыделеннымСтрокамИзЭТРАННаСервере()
	
	
	Для каждого Строка из Элементы.Список.ВыделенныеСтроки цикл
		
		НаборЗаписей = РегистрыСведений.э_ГраницаПериодаЗагрузкиОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Строка.Объект);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			ГраницаПериодаЗагрузкиДокументов = НаборЗаписей[0].Граница;
			
			Если Строка.Объект = "э_Накладная" Тогда
				э_ОбщиеСервер.ПодгрузитьНовыеНакладныеНаСервере(,,"999999999999999");   
			ИначеЕсли Строка.Объект = "э_ВедомостьНакопительная" Тогда
				э_ОбщиеСервер.ПодгрузитьНовыеНакопительныеВедомости("999999999999999"); 
			ИначеЕсли Строка.Объект = "э_ВедомостьПодачиУборкиВагонов" Тогда
				э_ОбщиеСервер.ПодгрузитьНовыеВедомостиПодачиУборкиВагонов("999999999999999");
			ИначеЕсли Строка.Объект = "э_Акт" Тогда
				э_ОбщиеСервер.ЗаполнитьДокументАкт("999999999999999");
			ИначеЕсли Строка.Объект = "э_ЗаявкаНаПеревозку" Тогда 					
				э_ОбщиеСервер.ПодгрузитьНовыеЗаявкиНаСервере(,,"999999999999999");
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоВыделеннымСтрокамИзЭТРАН(Команда)
	ЗагрузитьПоВыделеннымСтрокамИзЭТРАННаСервере();
КонецПроцедуры
