
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗадачиПользователя = Пользователи.ТекущийПользователь();
	Если Параметры.Свойство("АктуальныеНаДату") Тогда
		АктуальныеНаДату = Параметры.АктуальныеНаДату;
	Иначе
		АктуальныеНаДату = ТекущаяДата();
	КонецЕсли;
	ПодобратьНаСервере();
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура Подобрать(Команда)
	ПодобратьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодобратьНаСервере()
	
	ТЧ.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеЦелиСотрудниковОстатки.Сотрудник КАК Сотрудник,
	               |	ЛичныеЦелиСотрудниковОстатки.Цель КАК Цель,
	               |	ЛичныеЦелиСотрудниковОстатки.НачалоРаботы КАК НачалоРаботы,
	               |	ЛичныеЦелиСотрудниковОстатки.СрокДостижения КАК СрокДостижения,
	               |	ЛичныеЦелиСотрудниковОстатки.СпособДостижения КАК СпособДостижения,
	               |	ЛичныеЦелиСотрудниковОстатки.ПлановыйПоказательОстаток КАК ПлановыйПоказательОстаток,
	               |	ЛичныеЦелиСотрудниковОстатки.ФактическийПоказательОстаток КАК ФактическийПоказательОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛичныеЦелиСотрудников.Остатки КАК ЛичныеЦелиСотрудниковОстатки
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТекДата = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ &ТекДата МЕЖДУ ЛичныеЦелиСотрудниковОстатки.НачалоРаботы И ЛичныеЦелиСотрудниковОстатки.СрокДостижения
	               |		КОНЕЦ
	               |	И (ЛичныеЦелиСотрудниковОстатки.Сотрудник = &Пользователь
	               |			ИЛИ ЛичныеЦелиСотрудниковОстатки.Сотрудник В
	               |				(ВЫБРАТЬ
	               |					ГруппыПользователейСостав.Ссылка КАК Ссылка
	               |				ИЗ
	               |					Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |				ГДЕ
	               |					ГруппыПользователейСостав.Пользователь = &Пользователь)
	               |			ИЛИ &Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ТекДата", АктуальныеНаДату);
	Запрос.УстановитьПараметр("Пользователь", ЗадачиПользователя);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = ТЧ.Добавить();
		НСтр.Выбор = Истина;
		НСтр.Ответственный = Ответ.Сотрудник;
		НСтр.Цель = Ответ.Цель;
		НСтр.НачалоРаботы = Ответ.НачалоРаботы;
		НСтр.СрокДостижения = Ответ.СрокДостижения;
		НСтр.СпособДостижения = Ответ.СпособДостижения;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОтмеченные(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		Если Стр.Выбор Тогда Результат.Добавить(Новый Структура("Ответственный, Цель, НачалоРаботы, СрокДостижения, СпособДостижения", стр.Ответственный, стр.Цель, стр.НачалоРаботы, стр.СрокДостижения, стр.СпособДостижения)); КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры
