
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Валюта КАК Валюта,
	               |	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	               |	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС КАК НДСВключенВСтоимость,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ставка40 КАК Ставка,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение40 КАК Вознаграждение,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40 КАК Себестоимость,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка КАК Калькуляция,
	               |	КалькуляцияПСЦ.ПСЦ КАК ПСЦ,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Договор КАК Договор,
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Контрагент КАК Контрагент
//Гудкова	               |	,ИСТИНА КАК Пометка
	               |ИЗ
	               |	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПСЦКалькуляции.Калькуляция КАК Калькуляция,
	               |			МАКСИМУМ(ПСЦКалькуляции.Ссылка) КАК ПСЦ
	               |		ИЗ
	               |			Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПСЦКалькуляции.Калькуляция) КАК КалькуляцияПСЦ
	               |		ПО КалькуляцияЖД_УслугиВнеСтавки.Ссылка = КалькуляцияПСЦ.Калькуляция
	               |ГДЕ
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Параметры.Калькуляции);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Ответ);
		
	КонецЦикла;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПеренестиВыбранныеВСделку(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		
		Если НЕ Стр.Пометка Тогда Продолжить; КонецЕсли;
		
		НовСтрока = Новый Структура("Услуга,Контрагент,Договор,Себестоимость,Вознаграждение,Ставка,СтавкаНДС,НДСВключенВСтоимость,Калькуляция,Валюта,ПСЦ");
		ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
		
		Результат.Добавить(НовСтрока);
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

//Евросиб Гудкова( 13.10.2020 Ticket№ 0210139
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Если Элементы.ТЧ.ПроверитьСтроку(Тч.Индекс(Стр)) Тогда
			Стр.Пометка = Истина;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Если Элементы.ТЧ.ПроверитьСтроку(Тч.Индекс(Стр)) Тогда
			Стр.Пометка = Ложь;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры
// Евросиб Гудкова) 
