
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		Владелец = Параметры.Владелец;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьНаБазе") Тогда    
		// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 07.06.2024
		// Было:
		//Объект.Локации.Загрузить(Параметры.ЗаполнитьНаБазе.Локации.Выгрузить()); 
		//Стало:
		Для каждого Локация Из Параметры.ЗаполнитьНаБазе Цикл
			НС = Объект.Локации.Добавить();	
			НС.Локация = Локация;			
		КонецЦикла;
		// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 07.06.2024
	КонецЕсли;
	
	// Евросиб Фролов (16.02.2022 Task №46605
	РодительЛокации = Параметры.РодительЛокации;
	ТипЛокации = Параметры.ТипЛокации;
	Если РодительЛокации.Количество() > 0
		Или ТипЛокации.Количество() > 0 Тогда
		Элементы.ЛокацииЛокация.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	КонецЕсли;	
	// Евросиб Фролов)
	
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, начало
	Если Параметры.Свойство("МассивТиповЛокаций") И Параметры.МассивТиповЛокаций.Количество() > 0 Тогда
		МассивТиповЛокаций = Параметры.МассивТиповЛокаций;
		
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Тип", Новый ФиксированныйМассив(МассивТиповЛокаций)));
		
		Элементы.ЛокацииЛокация.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	//Евросиб Каблов 11.12.2024 ( #89872
	ИначеЕсли Параметры.Свойство("ПараметрыВыбораЛокаций") Тогда
		Элементы.ЛокацииЛокация.ПараметрыВыбора = Новый ФиксированныйМассив(Параметры.ПараметрыВыбораЛокаций);
	ИначеЕсли Параметры.Свойство("ПараметрыВыбора") И ЗначениеЗаполнено(Параметры.ПараметрыВыбора) Тогда
		МассивПараметровВыбора = Новый Массив;
		Для Каждого ПараметрВыбора Из Параметры.ПараметрыВыбора Цикл			
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор." + ПараметрВыбора.Ключ, ПараметрВыбора.Значение));
		КонецЦикла;
		Элементы.ЛокацииЛокация.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	//Евросиб Каблов 11.12.2024 )		
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, конец
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповестить("ЗакрытиеФормыМультилокации", Объект.Ссылка, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокацииЛокацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Евросиб Фролов (16.02.2022 Task №46605
	Если РодительЛокации.Количество() > 0
		Или ТипЛокации.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РодительЛокации", 	РодительЛокации);
		ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	Иначе
		////ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
		//СтандартнаяОбработка = Ложь;
		//СписокТиповЛокаций = Новый СписокЗначений;
		//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
		//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Регион"));
		//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
		//
		//ПараметрыФормыВыбора = Новый Структура;
		//ПараметрыФормыВыбора.Вставить("ТипЛокации", 		СписокТиповЛокаций);

		//ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
		////ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, начало
&НаКлиенте
Функция ФормаЭлементаОткрыта_из_ФормаРедактированияИВыбора()
	Результат = Ложь;
	Если Тип(Этаформа.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если Этаформа.ВладелецФормы.ИмяФормы = "Справочник.Мультилокации.Форма.ФормаРедактированияИВыбора" Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 87282, 24-06-2024, конец

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 86738, 18-06-2024, начало
	Если Этаформа.ВладелецФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ФормаЭлементаОткрыта_из_ФормаРедактированияИВыбора() Тогда
		МассивЛокаций = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Локации  Цикл
			МассивЛокаций.Добавить(ТекСтрока.Локация);
		КонецЦикла;
		АналогичнаяМультилокацияСтрукура = ПолучитьМультилокациюСАналогичнымНаборомЛокацийНаСервере(Объект.Ссылка, МассивЛокаций);
		Если ЗначениеЗаполнено(АналогичнаяМультилокацияСтрукура.АналогичнаяМультилокация) Тогда
			ДопПараметры = Новый Структура(); 
			ДопПараметры.Вставить("АналогичнаяМультилокация", АналогичнаяМультилокацияСтрукура.АналогичнаяМультилокация);
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаИспользоватьАналогичную", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, "Мультилокация с данным набором локаций уже существует <"+АналогичнаяМультилокацияСтрукура.Представление+">. Использовать существующую мультилокацию?", РежимДиалогаВопрос.ДаНет, 0);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 83045/TA 86738, 18-06-2024, конец
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМультилокациюСАналогичнымНаборомЛокацийНаСервере(Ссылка, МассивЛокаций)
	СтруктураРезультат = Новый Структура("АналогичнаяМультилокация, Представление");
	КлючНабораЛокаций = Справочники.Мультилокации.ПолучитьКлючНабораЛокаций(МассивЛокаций);
	АналогичнаяМультилокация = Справочники.Мультилокации.ПолучитьМультилокациюСАналогичнымНаборомЛокаций(Ссылка, КлючНабораЛокаций);
	СтруктураРезультат.АналогичнаяМультилокация = АналогичнаяМультилокация;
	Если АналогичнаяМультилокация <> Справочники.Мультилокации.ПустаяСсылка() Тогда
		РеквизитыМультилокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АналогичнаяМультилокация, "Код, Наименование");
		СтруктураРезультат.Представление = СтрШаблон("%1 (код %2)", РеквизитыМультилокации.Наименование, РеквизитыМультилокации.Код);
	КонецЕсли;
	Возврат СтруктураРезультат;
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаИспользоватьАналогичную(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Модифицированность = Ложь;
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("АналогичнаяМультилокация",Параметры.АналогичнаяМультилокация);
	Закрыть(ПараметрЗакрытия);	
КонецПроцедуры
