
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодДействияТарифа = ТекущаяДата();
	
	ПустаяДата = '00010101';
	Список.Параметры.УстановитьЗначениеПараметра("СтатусПроведенПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусСогласованПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусОтмененПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.ОтмененПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", ПустаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("Период", ПериодДействияТарифа);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Критерий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияТарифаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ПериодДействияТарифа);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляСписка()
	
	Для Каждого Поле Из Элементы.Список.ПодчиненныеЭлементы Цикл
		Поле.Видимость = Ложь;
	КонецЦикла;
	
	ПоляСписка = Справочники.ВидыУслугПоставщиков.ПолучитьПоляСпискаТарифовВидаУслуг(ВидУслуги);
	
	Для Каждого ОписаниеПоля Из ПоляСписка Цикл
			
		ИмяПоля = "Список" + СтрЗаменить(ОписаниеПоля.Имя, ".", "");
		Элемент = Элементы.Найти(ИмяПоля);
		
		Если Элемент = Неопределено Тогда
			Элемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.Список);
			Элемент.ПутьКДанным = "Список." + ОписаниеПоля.Имя;
		КонецЕсли;
		
		Элементы.Переместить(Элемент, Элементы.Список);
		Элемент.Заголовок = ОписаниеПоля.Представление;
		Элемент.Видимость = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВидУслугиПриИзмененииСервер()

	Если ЗначениеЗаполнено(ВидУслуги) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги", ВидУслуги);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги");
	КонецЕсли;
	
	НастроитьПоляСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугиПриИзменении(Элемент)
	
	ВидУслугиПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(ВидУслуги) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги", ВидУслуги);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги");
	КонецЕсли;
	
	НастроитьПоляСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

