
&НаКлиенте
Процедура ПрочитатьДанныеMAERSK(Команда)
	
	ТЧ.Очистить();
	
	ПрочитатьДанныеMAERSK_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеMAERSK_Сервер()
	
	Если ЗначениеЗаполнено(КодСтраныЗагружаемыхГородов) Тогда
		// это режим загрузки городов внутри страны
		Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_GEOGRAPHY_DETAILED(КодСтраныЗагружаемыхГородов);
		ЧТДЖ = Новый ЧтениеJSON();
		ЧТДЖ.УстановитьСтроку(Результат);
		РЕЗ = ПрочитатьJSON(ЧТДЖ);
		Для каждого стр из РЕЗ.cities Цикл
			НСтр = ТЧ.Добавить();
			НСтр.geoId = Стр.geoId;
			НСтр.name = Стр.cityName;
			НСтр.countryCode = Стр.countryCode;
			
			НСтр.Локация = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(Стр.geoId); //Справочники.Локации.НайтиПоРеквизиту("ИдентификаторMAERSK", );
		КонецЦикла;
	Иначе
		// это режим загрузки самих стран
		Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_GEOGRAPHY();
		ЧТДЖ = Новый ЧтениеJSON();
		ЧТДЖ.УстановитьСтроку(Результат);
		РЕЗ = ПрочитатьJSON(ЧТДЖ);
		Для каждого стр из РЕЗ.countries Цикл
			НСтр = ТЧ.Добавить();
			НСтр.countryCode = Стр.countryCode;
			НСтр.geoId = Стр.geoId;
			НСтр.name = Стр.name;
			НСтр.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", НСтр.countryCode);
			Если ЗначениеЗаполнено(НСтр.Страна) Тогда
				НСтр.Локация = Справочники.Локации.НайтиПоРеквизиту("Страна", НСтр.Страна, Справочники.Локации.ВСЕ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИдентификаторыMAERSKПоСопоставленнымЛокациям(Команда)
	ЗаписатьИдентификаторыMAERSKПоСопоставленнымЛокациямНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИдентификаторыMAERSKПоСопоставленнымЛокациямНаСервере()
	
	Сч = 0;
	
	Если ЗначениеЗаполнено(КодСтраныЗагружаемыхГородов) Тогда
		// это режим загрузки городов внутри страны
		Для каждого Стр из ТЧ Цикл
			ОО = Справочники.Локации.СоздатьЭлемент();
			Если ЗначениеЗаполнено(Стр.Локация) тогда
				ОО = Стр.Локация.ПолучитьОбъект();
			КонецЕсли;
			ОО.Родитель = ЛокацияРегиона;
			ОО.НаименованиеАнгл = Стр.name;
			ОО.Страна = ЛокацияРегиона.Страна;
			//Евросиб - АСуслов 05.05.2023 11:29:44 #67492
			//(
			//ОО.Тип = Справочники.ТипыЛокаций.Субъект;
			ОО.Тип = Справочники.ТипыЛокаций.НаселенныйПункт;
			//)
			//Евросиб - АСуслов 05.05.2023 11:29:51 #67492
			ОО.ИдентификаторMAERSK = Стр.geoId;
			ОО.Наименование = ?(ОО.Наименование = "", Стр.name, ОО.Наименование);
			ОО.Записать();
			Стр.Локация = ОО.Ссылка;
			Сч = Сч + 1;
		КонецЦикла;
	Иначе
		// это режим загрузки самих стран
		Для каждого Стр из ТЧ Цикл
			Если ЗначениеЗаполнено(Стр.Локация) Тогда
				ОО = Стр.Локация.ПолучитьОбъект();
				ОО.НаименованиеАнгл = Стр.name;
				ОО.ИдентификаторMAERSK = Стр.geoId;
				ОО.Записать();
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Сообщить("Обновлено " + Сч + " локации!");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КодСтраныЗагружаемыхГородов") И Параметры.Свойство("ЛокацияРегиона") Тогда
		Элементы.Группа1.Видимость 		= Истина;
		КодСтраныЗагружаемыхГородов 	= Параметры.КодСтраныЗагружаемыхГородов;
		ЛокацияРегиона 					= Параметры.ЛокацияРегиона;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

