
Процедура ЗаполнитьДоходы(СделкаОбъект, СписокГотовыхКОформлениюДоговоров, СписокРеестров = "") Экспорт
	
	//Евросиб Каблов 09.04.2025 ( #105407 Переменная ГлобальныйОткрытыйПериод не используется
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СделкаОбъект.Организация); 
	//Евросиб Каблов 09.04.2025 ) 
	УслугаФрахта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	
	//ДИТ, Беляев СЮ, Ticket#0332239, 27-11-2023, начало (закомментировал блок ниже, не используется)
	//ВыгрТЧ = СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить();
	//ВыгрТЧ.Колонки.Добавить("ПСЦ", Новый ОписаниеТипов("ДокументСсылка.ПСЦ"));
	//Для каждого Стр из ВыгрТЧ Цикл
	//	Стр.ПСЦ = СТр.Заявка.ПСЦ;
	//КонецЦикла;
	//ДИТ, Беляев СЮ, Ticket#0332239, 27-11-2023, конец
	
	// выборка "особых" контрагентов (у которых фин доки формируются по-особому)
	ЗапросК = Новый Запрос;
	ЗапросК.Текст =
	//++ДИТ_Коробов_Ticket#0263169_15.03.22
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(&ПовагонныеОтправки КАК БУЛЕВО) КАК ПовагонныеОтправки
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц 
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|;
	|
	//--ДИТ_Коробов_Ticket#0263169_15.03.22
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ФормированиеФинДокументов.ОбязательноеЗаполнениеРеестра
	//|			ТОГДА ФормированиеФинДокументов.Контрагент
	//|	КОНЕЦ КАК КонтрагентСРеестром,
	//|	ВЫБОР
	//|		КОГДА НЕ ФормированиеФинДокументов.ОбязательноеЗаполнениеРеестра
	//|			ТОГДА ФормированиеФинДокументов.Контрагент
	//|	КОНЕЦ КАК КонтрагентБезРеестра,
	|	ВЫБОР
	//Евросиб - АСуслов 31.01.2023 14:40:59 #64514
	//(
	//|		КОГДА ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|		КОГДА ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно ИЛИ ФормированиеФинДокументов.РазделятьДокументыНаКаждыйКонтейнерОтдельно
	//)
	//Евросиб - АСуслов 31.01.2023 14:41:00 #64514
	|			ТОГДА ФормированиеФинДокументов.Контрагент
	|	КОНЕЦ КАК КонтрагентыПострочно,
	|	ВЫБОР
	|		КОГДА ФормированиеФинДокументов.СуммироватьСтроки
	|			ТОГДА ФормированиеФинДокументов.Контрагент
	|	КОНЕЦ КАК КонтрагентыСуммироватьСтроки
	|ИЗ
	//++ДИТ_Коробов_Ticket#0263169_15.03.22
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|	ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|	ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки = ФормированиеФинДокументов.ВидПеревозки
	|			И ВТ_СвязьУчетныхЕдиниц.Калькуляция.Контрагент = ФормированиеФинДокументов.Контрагент
	|			И ВТ_СвязьУчетныхЕдиниц.ПовагонныеОтправки = ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|			И (НЕ ФормированиеФинДокументов.ПометкаУдаления)
	|";
	ЗапросК.УстановитьПараметр("Ссылка", СделкаОбъект.Ссылка);
	ЗапросК.УстановитьПараметр("ПовагонныеОтправки", СделкаОбъект.ПовагонныеОтправки);
	//--ДИТ_Коробов_Ticket#0263169_15.03.22
	
	ТЗКонтрагентов = ЗапросК.Выполнить().Выгрузить();
	//реестры выставляются через обработку, поэтому этот кейс здесь отключим.
	//Если ЗначениеЗаполнено(СписокРеестров) Тогда
	//	МассивКонтрагСРеестром = ТЗКонтрагентов.ВыгрузитьКолонку("КонтрагентСРеестром");
	//Иначе
	МассивКонтрагСРеестром = Новый Массив;
	//КонецЕсли;
	//МассивКонтрагБезРеестра = ТЗКонтрагентов.ВыгрузитьКолонку("КонтрагентБезРеестра");
	МассивКонтрагПострочно = ТЗКонтрагентов.ВыгрузитьКолонку("КонтрагентыПострочно");
	МассивКонтрагСуммировать = ТЗКонтрагентов.ВыгрузитьКолонку("КонтрагентыСуммироватьСтроки");
	
	#Область Запрос
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("Клиент", МассивКонтрагСРеестром);
	//Запрос2.УстановитьПараметр("КлиентБезРеестра", МассивКонтрагБезРеестра);
	Запрос2.УстановитьПараметр("КлиентПострочно", МассивКонтрагПострочно);
	Запрос2.УстановитьПараметр("КонтрагентСуммироватьСтроки", МассивКонтрагСуммировать);
	Запрос2.УстановитьПараметр("Ссылка", СделкаОбъект.Ссылка);
	//Запрос2.УстановитьПараметр("ВыгрТЧ", ВыгрТЧ); //ДИТ, Беляев СЮ, Ticket#0332239, 27-11-2023, начало (закомментировал, не используется)
	
	//Евросиб Каблов 06.01.2024 ( #78949
	//Запрос2.УстановитьПараметр("ОтборДоговоров", СписокГотовыхКОформлениюДоговоров.Выгрузить(,"Договор"));
	Запрос2.УстановитьПараметр("ОтборДоговоров", СписокГотовыхКОформлениюДоговоров);
	//Евросиб Каблов 06.01.2024 )
	
	Запрос2.УстановитьПараметр("Фрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	Запрос2.УстановитьПараметр("ЕстьРеестры", ЗначениеЗаполнено(СписокРеестров));
	Запрос2.УстановитьПараметр("СписокРеестров", СписокРеестров);
	Запрос2.УстановитьПараметр("СвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить());
	Запрос2.УстановитьПараметр("Доходы", СделкаОбъект.Доходы.Выгрузить());
	Запрос2.Текст = 
	//Евросиб Каблов 06.01.2024 ( #78949
	//"ВЫБРАТЬ
	//|	ОтборДоговоров.Договор КАК Договор
	//|ПОМЕСТИТЬ ВТ_ОтборДоговоров
	//|ИЗ
	//|	&ОтборДоговоров КАК ОтборДоговоров
	//|;
	//|
	//Евросиб Каблов 06.01.2024 )
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТСвязьДоходовРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ НЕ СделкаДоходы.УслугаВнеСтавки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовРасходов
	|ИЗ
	|	ВТСвязьДоходовРасходов КАК СделкаСвязьДоходовИРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
	|		ПО 
	//СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	//|			И 
	|  			СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|ГДЕ
	//|	СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
	//|	И 
	|	НЕ СделкаДоходы.ГУИД ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаСвязьУчетныхЕдиниц.Протокол.РазрешенПересчетСтавкиУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.Удалена КАК Удалена,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления КАК КоносаментСтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСУЕ,
	//Евросиб - АСуслов 23.09.2022 11:50:23 #56288
	//(
	|   СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|   СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	//)
	//Евросиб - АСуслов 23.09.2022 11:50:24 #
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения КАК СтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	ЕСТЬNULL(ФФД_СчетЖД.Документ, ЕСТЬNULL(ФФД_СчетФрахт.Документ, ФФД_Правило.Документ)) КАК ДокументФФД,
	//Евросиб - АСуслов 17.01.2023 11:21:49 #61165
	//(
	|  	СделкаСвязьУчетныхЕдиниц.Калькуляция.ТипЗаказа = ЗНАЧЕНИЕ(Справочник.ТипыЗаказов.ПовагоннаяОтправка)
	|   	И СделкаСвязьУчетныхЕдиниц.Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон) КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:37:17 #61165
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_Правило
	|			ПО ФормированиеФинДокументов.Ссылка = ФФД_Правило.Документ
	|		ПО СделкаСвязьУчетныхЕдиниц.Клиент = ФормированиеФинДокументов.Контрагент
	|			И (ВЫБОР
	|				КОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки
	|					ТОГДА ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|				ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки
	|			КОНЕЦ)
	|			И (ФормированиеФинДокументов.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетЖД
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетЖД = ФФД_СчетЖД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетФрахт
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетФрахт = ФФД_СчетФрахт.Документ
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	//Евросиб Каблов 12.12.2023 ( Ticket#0329972
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	//Евросиб Каблов 12.12.2023 )
	//Евросиб - АСуслов 23.09.2022 10:09:41 #56288
	//(
	|	И (СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|		ИЛИ СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
	//)
	//Евросиб - АСуслов 23.09.2022 10:09:41 #
	
	//Евросиб Каблов 06.01.2024 ( #78949
	//|	И СделкаСвязьУчетныхЕдиниц.Договор В
	//|			(ВЫБРАТЬ
	//|				ВТ_ОтборДоговоров.Договор КАК Договор
	//|			ИЗ
	//|				ВТ_ОтборДоговоров КАК ВТ_ОтборДоговоров)
	|	И СделкаСвязьУчетныхЕдиниц.Договор В (&ОтборДоговоров)
	//Евросиб Каблов 06.01.2024 )
	|	И СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ГУИД В
	|				(ВЫБРАТЬ
	|					т.СвязьУчетныхЕдиниц
	|				ИЗ
	|					ВТ_СвязьДоходовРасходов КАК т
	|				ГДЕ
	|					т.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И СделкаСвязьУчетныхЕдиниц.Калькуляция.ММ_ИтогоСтавка + СделкаСвязьУчетныхЕдиниц.Калькуляция.ММ_ИтогоСтавка20 > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаСвязьУчетныхЕдиниц.Протокол.РазрешенПересчетСтавкиУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.Удалена КАК Удалена,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления КАК КоносаментСтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСУЕ,
	//Евросиб - АСуслов 23.09.2022 11:49:55 #
	//(
	|   СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки,
	//)
	//Евросиб - АСуслов 23.09.2022 11:49:56 #
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения КАК СтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	ЕСТЬNULL(ФФД_СчетФрахт.Документ, ЕСТЬNULL(ФФД_СчетЖД.Документ, ФФД_Правило.Документ)) КАК ДокументФФД
	|ПОМЕСТИТЬ ВТ_Фрахт
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_Правило
	|			ПО ФормированиеФинДокументов.Ссылка = ФФД_Правило.Документ
	|		ПО СделкаСвязьУчетныхЕдиниц.Клиент = ФормированиеФинДокументов.Контрагент
	|			И (ВЫБОР
	|				КОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки
	|					ТОГДА ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|				ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки
	|			КОНЕЦ)
	|			И (ФормированиеФинДокументов.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетЖД
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетЖД = ФФД_СчетЖД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетФрахт
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетФрахт = ФФД_СчетФрахт.Документ
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	//Евросиб Каблов 12.12.2023 ( Ticket#0329972
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	//Евросиб Каблов 12.12.2023 )
	
	//Евросиб Каблов 06.01.2024 ( #78949
	//|	И СделкаСвязьУчетныхЕдиниц.Договор В
	//|			(ВЫБРАТЬ
	//|				ВТ_ОтборДоговоров.Договор КАК Договор
	//|			ИЗ
	//|				ВТ_ОтборДоговоров КАК ВТ_ОтборДоговоров)
	|	И СделкаСвязьУчетныхЕдиниц.Договор В (&ОтборДоговоров)
	//Евросиб Каблов 06.01.2024 )
	
	|	И СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	//Евросиб - АСуслов 23.09.2022 9:50:01 #
	//(
	|	И (СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.Море) 
	|  		ИЛИ СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
	//)
	//Евросиб - АСуслов 23.09.2022 9:50:02 #
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ГУИД В
	|				(ВЫБРАТЬ
	|					т.СвязьУчетныхЕдиниц
	|				ИЗ
	|					ВТ_СвязьДоходовРасходов КАК т
	|				ГДЕ
	|					т.Услуга = &Фрахт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Фрахт.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Итого20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Итого40
	|	КОНЕЦ КАК Итого,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК КалькуляцияФрахта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент.Контрагент КАК Контрагент,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
	|	ВТ_Фрахт.Коносамент КАК Коносамент,
	|	ВТ_Фрахт.Удалена КАК Удалена,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_Фрахт.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_Фрахт.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_Фрахт.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ_Фрахт.СтрокаСУЕ КАК СтрокаСУЕ,
	//Евросиб - АСуслов 23.09.2022 11:51:03 #
	//(
	|	ВТ_Фрахт.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	//)
	//Евросиб - АСуслов 23.09.2022 11:51:03 #
	|ПОМЕСТИТЬ ФрахтПоКалькуляции
	|ИЗ
	|	ВТ_Фрахт КАК ВТ_Фрахт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|			И (ВЫБОР
	|				КОГДА ВТ_Фрахт.Калькуляция.ФрахтИмпорт
	|					ТОГДА ВТ_Фрахт.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|				ИНАЧЕ ВТ_Фрахт.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|						ИЛИ ВТ_Фрахт.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			КОНЕЦ)
	|			И (ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|				КОГДА ВТ_Фрахт.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|				КОГДА ВТ_Фрахт.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|					ТОГДА ""SOC""
	|				ИНАЧЕ ""COC""
	|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC)
	|ГДЕ
	|	(КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
	|	И ВЫБОР
	|			КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|			ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|		КОНЕЦ > 0
	|	И НЕ ВТ_Фрахт.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И НЕ ВТ_Фрахт.СтрокаСУЕ В
	|				(ВЫБРАТЬ
	|					т.СвязьУчетныхЕдиниц
	|				ИЗ
	|					ВТ_СвязьДоходовРасходов КАК т
	|				ГДЕ
	|					т.Услуга = &Фрахт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	|	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """"
	|					И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЛишниеДанные,
	|	ЗаявкаСоставУслуги.Ссылка.Договор КАК Договор
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, начало
	|	,ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, конец
	|ПОМЕСТИТЬ ТекЗаявка
	|ИЗ
	|	Документ.Сделка.Заявки КАК СделкаЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО СделкаЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	|ГДЕ
	|	СделкаЗаявки.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаСоставУслуги.НомерКТК,
	|	ЗаявкаСоставУслуги.РеестрКлиента,
	|	ЗаявкаСоставУслуги.Ссылка.Договор
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, начало
	|	,ЗаявкаСоставУслуги.ГУИДСтроки
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, конец
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаСоставУслуги.РеестрКлиента = """"
	|					И ЗаявкаСоставУслуги.Ссылка.Контрагент В (&Клиент)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ВТ.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ВТ.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ.Клиент В (&Клиент)
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ.Контейнер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Контейнер,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И &ЕстьРеестры
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА ТекЗаявка.РеестрКлиента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК РеестрКлиента,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ.Клиент В (&Клиент)
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ.Вагон
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Вагон,
	//|	ВЫБОР
	//|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	//|					И ВТ.Клиент В (&Клиент)
	//|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	//|			ТОГДА ВТ.СтрокаСУЕ
	//|		ИНАЧЕ """"
	//|	КОНЕЦ КАК СтрокаСУЕ,
	|	ВТ.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВЫБОР
	|		КОГДА ВТ.Клиент В (&Клиент)
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА 1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбычныйРасчет,
	|	ВТ.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	|		КОГДА ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоСебестоимость
	|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоСебестоимость20
	|		ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСебестоимость
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоВознаграждение
	|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоВознаграждение20
	|		ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоВознаграждение
	|	КОНЕЦ КАК Вознаграждение,
	|	ВЫБОР
	|		КОГДА ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоСтавка
	|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА ВТ.Калькуляция.ММ_ИтогоСтавка20
	|		ИНАЧЕ ВТ.Калькуляция.ММ_ИтогоСтавка
	|	КОНЕЦ КАК Ставка,
	|	ВТ.Калькуляция.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ.Калькуляция.Валюта КАК Валюта,
	|	ВТ.УчастокПеревозки КАК УчастокПеревозки,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ.Клиент В (&Клиент)
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ.НомерЖДН
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерЖДН,
	|	ВТ.Удалена КАК Удалена,
	|	ВЫБОР
	//Евросиб - АСуслов 31.01.2023 14:41:58 #64514
	//(
	//|		КОГДА ПравилоФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|		КОГДА ПравилоФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно ИЛИ ПравилоФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно
	//)
	//Евросиб - АСуслов 31.01.2023 14:42:00 #64514
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Построчно,
	|	ЕСТЬNULL(ФрахтПоКалькуляции.Коносамент, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)) КАК Коносамент,
	|	ПравилоФФД.ВидСтавки КАК ВидСтавки,
	|	ФрахтПоКалькуляции.Ставка КАК СтавкаФрахт_Н,
	|	ФрахтПоКалькуляции.Вознаграждение КАК Вознаграждение_Н,
	|	ФрахтПоКалькуляции.Итого КАК Итого_Н,
	|	ВЫБОР
	//Евросиб - АСуслов 30.09.2022 11:50:12 #тэуфрахт
	//(
	//|		КОГДА ВТ.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	КОГДА ВТ.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка) ИЛИ ВТ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	//)
	//Евросиб - АСуслов 30.09.2022 11:50:15 #тэуфрахт
	|			ТОГДА """"
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|		ИНАЧЕ ВТ.СобственностьПеревозимогоКТК
	//|	КОНЕЦ КАК СобственностьПеревозимогоКТК,
	//ок)
	|		ИНАЧЕ ВТ.УдалитьСобственностьПеревозимогоКТК
	|	КОНЕЦ КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВЫБОР
	|		КОГДА ВТ.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				ИЛИ ВТ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ.ПринадлежностьТЕ
	|	КОНЕЦ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВЫБОР
	|		КОГДА ПравилоФФД.РазделятьСтрокиПоСтанциямНазначения
	|			ТОГДА ВТ.СтанцияНазначения
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтанцияНазначения,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ.Клиент В (&Клиент)
	|				ИЛИ ВТ.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ.ЖДН
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЖДН,
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Начало: 04.06.2024  
	// Было:
	//|	ВложенныйЗапрос.ВыставляемаяУслуга КАК Услуга,
	//Стало:
	|   ВЫБОР
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		КОГДА ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
	|			ТОГДА Значение(Справочник.Номенклатура.Премия)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		КОГДА ВТ.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	|			ТОГДА Значение(Справочник.Номенклатура.Премия)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|		ИНАЧЕ
	|			ВложенныйЗапрос.ВыставляемаяУслуга
	|	КОНЕЦ КАК Услуга,
	// Евросиб(ДИТ) US 59973 ТА 86015 Сержантова А.С. Конец: 04.06.2024
	|	ЛОЖЬ КАК Перевыставляемая,
	|	ЛОЖЬ КАК УслугаВнеСтавки,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВО,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОказанияУслуги,
	|	ЛОЖЬ КАК ДоплатныеКТК,
	|	"""" КАК ПравилоОпределенияДатыОказанияУслуги,
	|	НЕОПРЕДЕЛЕНО КАК ДокументФФД,
	|	"""" КАК ПравилоОпределенияДатыДокумента,
	|	НЕОПРЕДЕЛЕНО КАК УчДокумент,
	|	НЕОПРЕДЕЛЕНО КАК КорректировкаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК КорректировкаВознаграждения,
	//Евросиб - АСуслов 17.01.2023 11:39:43 #61165
	//(
	|   ВТ.ГруппироватьПоВагонам КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:39:45 #61165
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекЗаявка КАК ТекЗаявка
	|		ПО ВТ.Договор = ТекЗаявка.Договор
	//|			И (ВТ.Контейнер = ТекЗаявка.НомерКТК
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, начало
	|			И (ВТ.ГУИДСтрокиЗаявки = ТекЗаявка.ГУИДСтроки
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, конец
	|				ИЛИ ТекЗаявка.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					И ВТ.ПовагонныеОтправки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
	//Евросиб - АСуслов 23.09.2022 11:52:08 #56288
	//(
	//|		ПО ВТ.СтрокаСУЕ = ФрахтПоКалькуляции.СтрокаСУЕ
	|		ПО ВТ.ГУИДСтрокиЗаявки = ФрахтПоКалькуляции.ГУИДСтрокиЗаявки
	//)
	//Евросиб - АСуслов 23.09.2022 11:52:11 #56288
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ФормированиеФинДокументов.ДатаРеализации) КАК ДатаРеализации,
	|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки КАК ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
	|			МАКСИМУМ(ФормированиеФинДокументов.РазделятьСтрокиПоСтанциямНазначения) КАК РазделятьСтрокиПоСтанциямНазначения,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок КАК ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ КАК Документ,
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	|			ФормированиеФинДокументов.РазделятьДокументыНаКаждыйКонтейнерОтдельно КАК РазделятьДокументыНаКаждыйКонтейнерОтдельно
	|		ИЗ
	|			РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФормированиеФинДокументов.Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ,                             
	//Евросиб - АСуслов 31.01.2023 14:50:01 #64514
	//(
	|  			ФормированиеФинДокументов.РазделятьДокументыНаКаждыйКонтейнерОтдельно,
	//)
	//Евросиб - АСуслов 31.01.2023 14:50:02 #64514
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно) КАК ПравилоФФД
	|		ПО ВТ.ДокументФФД = ПравилоФФД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга) КАК ВыставляемаяУслуга,
	|			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка) КАК ВложенныйЗапрос
	|		ПО ВТ.Калькуляция = ВложенныйЗапрос.Ссылка
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|		ПО ДокументКалькуляция.Ссылка = ВТ.Калькуляция
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|
	//Евросиб Коханенко Н.А. # 20.02.2023 #65959,66094 (( 
	// для устранения случаев задвоения суммы при вычислении дохода, группируем одинаковые калькуляции
	//|ОБЪЕДИНИТЬ ВСЕ
	|ОБЪЕДИНИТЬ 
	//Евросиб Коханенко Н.А. # 20.02.2023 #65959,66094  )) 
	|
	|ВЫБРАТЬ
	|	ВТ_Фрахт.Калькуляция,
	|	ВТ_Фрахт.Клиент,
	|	ВТ_Фрахт.ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ВТ_Фрахт.ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ВТ_Фрахт.Договор,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ_Фрахт.Контейнер
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА ТекЗаявка.РеестрКлиента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ_Фрахт.Вагон
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВТ_Фрахт.СтрокаСУЕ,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВТ_Фрахт.РазмерКТК,
	|	ФрахтПоКалькуляции.Ставка,
	|	ФрахтПоКалькуляции.Вознаграждение,
	|	ФрахтПоКалькуляции.Итого,
	|	ВТ_Фрахт.Калькуляция.НДСФрахт,
	//|	ВТ_Фрахт.Калькуляция.СуммаВключаетНДС,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	ВТ_Фрахт.Калькуляция.СуммаВключаетНДСФрахт,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|	ФрахтПоКалькуляции.Валюта,
	|	ВТ_Фрахт.УчастокПеревозки,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ_Фрахт.НомерЖДН
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВТ_Фрахт.Удалена,
	|	ВЫБОР
	|		КОГДА ПравилоФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ФрахтПоКалькуляции.Коносамент, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)),
	|	ПравилоФФД.ВидСтавки,
	|	ФрахтПоКалькуляции.Ставка,
	|	ФрахтПоКалькуляции.Вознаграждение,
	|	ФрахтПоКалькуляции.Итого,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА """"
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|		ИНАЧЕ ВТ_Фрахт.СобственностьПеревозимогоКТК
	//ок)
	|		ИНАЧЕ ВТ_Фрахт.УдалитьСобственностьПеревозимогоКТК
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	КОНЕЦ,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Фрахт.ПринадлежностьТЕ
	|	КОНЕЦ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВЫБОР
	|		КОГДА ПравилоФФД.РазделятьСтрокиПоСтанциямНазначения
	|			ТОГДА ВТ_Фрахт.СтанцияНазначения
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТекЗаявка.РеестрКлиента = """"
	|					И ВТ_Фрахт.Клиент В (&Клиент)
	|				ИЛИ ВТ_Фрахт.Клиент В (&КлиентПострочно)
	|			ТОГДА ВТ_Фрахт.ЖДН
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&Фрахт,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЛОЖЬ,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	//Евросиб - АСуслов 17.01.2023 11:38:42 #61165
	//(
	|   ЛОЖЬ
	//)
	//Евросиб - АСуслов 17.01.2023 11:39:14 #61165
	|  
	|ИЗ
	|	ВТ_Фрахт КАК ВТ_Фрахт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекЗаявка КАК ТекЗаявка
	|		ПО ВТ_Фрахт.Договор = ТекЗаявка.Договор
	//|			И (ВТ_Фрахт.Контейнер = ТекЗаявка.НомерКТК
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, начало
	|			И (ВТ_Фрахт.ГУИДСтрокиЗаявки = ТекЗаявка.ГУИДСтроки
	//ДИТ, Беляев СЮ, Ticket#0304405, 16-03-2023, конец
	|				ИЛИ ТекЗаявка.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					И ВТ_Фрахт.ПовагонныеОтправки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
	|		ПО ВТ_Фрахт.СтрокаСУЕ = ФрахтПоКалькуляции.СтрокаСУЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ФормированиеФинДокументов.ДатаРеализации) КАК ДатаРеализации,
	|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки КАК ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
	|			МАКСИМУМ(ФормированиеФинДокументов.РазделятьСтрокиПоСтанциямНазначения) КАК РазделятьСтрокиПоСтанциямНазначения,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок КАК ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ КАК Документ,                                                                     
	//Евросиб - АСуслов 31.01.2023 14:52:02 #64514
	//(
	|			ФормированиеФинДокументов.РазделятьДокументыНаКаждыйКонтейнерОтдельно КАК РазделятьДокументыНаКаждыйКонтейнерОтдельно,
	//)
	//Евросиб - АСуслов 31.01.2023 14:52:04 #64514
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|		ИЗ
	|			РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФормированиеФинДокументов.Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ, 
	//Евросиб - АСуслов 31.01.2023 14:52:18 #64514
	//(
	|			ФормированиеФинДокументов.РазделятьДокументыНаКаждыйКонтейнерОтдельно,
	//)
	//Евросиб - АСуслов 31.01.2023 14:52:20 #64514
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно) КАК ПравилоФФД
	|		ПО ВТ_Фрахт.ДокументФФД = ПравилоФФД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ_Фрахт.ГУИДСтрокиЗаявки = ВТ.ГУИДСтрокиЗаявки
	|				И НЕ ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|ГДЕ
	|	ВТ.СтрокаСУЕ ЕСТЬ NULL
	//|			ИЛИ НЕ ПравилоФФД.ВидСтавки = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	//ДИТ, Беляев СЮ, Ticket#0304654, 17-03-2023, начало (если нет правил формирования, то не заполнялся ФРАХТ)
	|			ИЛИ НЕ ЕстьNULL(ПравилоФФД.ВидСтавки, ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ПустаяССылка)) = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	//ДИТ, Беляев СЮ, Ticket#0304654, 17-03-2023, конец
	|";   
	Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Документ.Сделка.Доходы", "&Доходы");
	ТаблицаДоходов = Запрос2.Выполнить().Выгрузить();
	ТаблицаДоходов.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаДоходов.Колонки.Добавить("ГУИДИсправляемойСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаСвязейДоходовИРасходов = СделкаОбъект.СвязьДоходовИРасходов.Выгрузить();
	ТаблицаСвязейУчетныхЕдиниц = СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить();
	ТаблицаСвязейУчетныхЕдиниц.Колонки.Добавить("МесяцОказанияУслуги", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаРасходов = СделкаОбъект.Расходы.Выгрузить();
	Для каждого СтрокаДоходов Из ТаблицаДоходов Цикл
		СтрокаДоходов.ГУИД = Новый УникальныйИдентификатор;
		Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, СтрокаДоходов.ГУИД, ,СтрокаДоходов.СтрокаСУЕ, ?(СтрокаДоходов.Услуга = УслугаФрахта, УслугаФрахта, Неопределено), ТаблицаСвязейДоходовИРасходов);
	КонецЦикла;                
	
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
	Справочники.ФормированиеФинДокументов.ДобавитьПараметрыФормированияФинансовыхДокументовВТаблицу(ТаблицаСвязейУчетныхЕдиниц);
    //ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
		
	ЗаполнитьДатыОказанияУслуги(СделкаОбъект, ТаблицаДоходов, ТаблицаРасходов, ТаблицаСвязейУчетныхЕдиниц, ТаблицаСвязейДоходовИРасходов);
	
	
	Запрос2.УстановитьПараметр("ДоходыСПериодомОказанияУслуги", ТаблицаДоходов);
	
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ИтоговаяБезГруппировки.Калькуляция КАК Калькуляция,
	|	ИтоговаяБезГруппировки.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	ИтоговаяБезГруппировки.Клиент КАК Клиент,
	|	ИтоговаяБезГруппировки.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ИтоговаяБезГруппировки.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ИтоговаяБезГруппировки.Договор КАК Договор,
	|	ИтоговаяБезГруппировки.Контейнер КАК Контейнер,
	|	ИтоговаяБезГруппировки.РеестрКлиента КАК РеестрКлиента,
	|	ИтоговаяБезГруппировки.Вагон КАК Вагон,
	|	ВЫБОР
	|		КОГДА ИтоговаяБезГруппировки.Построчно
	|			ТОГДА ИтоговаяБезГруппировки.СтрокаСУЕ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтрокаСУЕ,
	|	ИтоговаяБезГруппировки.ОбычныйРасчет КАК ОбычныйРасчет,
	|	ИтоговаяБезГруппировки.РазмерКТК КАК РазмерКТК,
	|	ИтоговаяБезГруппировки.Себестоимость КАК Себестоимость,
	|	ИтоговаяБезГруппировки.ВидСтавки КАК ВидСтавки1,
	|	ИтоговаяБезГруппировки.СтавкаФрахт_Н КАК СтавкаФрахт_Н,
	|	ИтоговаяБезГруппировки.Вознаграждение КАК Вознаграждение,
	|	ИтоговаяБезГруппировки.Вознаграждение_Н КАК Вознаграждение_Н,
	|	ИтоговаяБезГруппировки.Ставка КАК Ставка,
	|	ИтоговаяБезГруппировки.Итого_Н КАК Итого_Н,
	|	ИтоговаяБезГруппировки.СтавкаНДС КАК СтавкаНДС,
	|	ИтоговаяБезГруппировки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИтоговаяБезГруппировки.Валюта КАК Валюта,
	|	ИтоговаяБезГруппировки.УчастокПеревозки КАК УчастокПеревозки,
	|	ИтоговаяБезГруппировки.НомерЖДН КАК НомерЖДН,
	|	ИтоговаяБезГруппировки.Удалена КАК Удалена,
	|	ИтоговаяБезГруппировки.Построчно КАК Построчно,
	|	ИтоговаяБезГруппировки.Коносамент КАК Коносамент,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ИтоговаяБезГруппировки.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ИтоговаяБезГруппировки.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ИтоговаяБезГруппировки.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ИтоговаяБезГруппировки.СтанцияНазначения КАК СтанцияНазначения,
	|	ИтоговаяБезГруппировки.ЖДН КАК ЖДН,
	|	ИтоговаяБезГруппировки.Услуга КАК Услуга,
	|	ИтоговаяБезГруппировки.ВидСтавки КАК ВидСтавки,
	//Евросиб - АСуслов 17.01.2023 11:41:53 #61165
	//(
	|   ИтоговаяБезГруппировки.ГруппироватьПоВагонам КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:41:55 #61165
	|ПОМЕСТИТЬ ИтоговаяБезГруппировки
	|ИЗ
	|	&ДоходыСПериодомОказанияУслуги КАК ИтоговаяБезГруппировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ИтоговаяБезГруппировки.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	МАКСИМУМ(ИтоговаяБезГруппировки.ДатаОказанияУслуги) КАК ДатаОказанияУслуги,
	|	НАЧАЛОПЕРИОДА(ИтоговаяБезГруппировки.ДатаОказанияУслуги, МЕСЯЦ) КАК МесяцОказанияУслуги,
	|	ИтоговаяБезГруппировки.Клиент КАК Клиент,
	|	ИтоговаяБезГруппировки.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ИтоговаяБезГруппировки.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ИтоговаяБезГруппировки.Договор КАК Договор,
	|	ИтоговаяБезГруппировки.Контейнер КАК Контейнер,
	|	ИтоговаяБезГруппировки.РеестрКлиента КАК РеестрКлиента,
	|	ИтоговаяБезГруппировки.Вагон КАК Вагон,
	|	ИтоговаяБезГруппировки.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ИтоговаяБезГруппировки.ОбычныйРасчет КАК ОбычныйРасчет,
	//Евросиб - АСуслов 17.01.2023 12:58:09 #61165
	//(     
	//|   ИтоговаяБезГруппировки.РазмерКТК КАК РазмерКТК
	|   ВЫБОР КОГДА ИтоговаяБезГруппировки.ГруппироватьПоВагонам ТОГДА Неопределено ИНАЧЕ ИтоговаяБезГруппировки.РазмерКТК КОНЕЦ КАК РазмерКТК,
	//)
	//Евросиб - АСуслов 17.01.2023 12:58:10 #61165
	|	
	|	СУММА(ИтоговаяБезГруппировки.Себестоимость + ВЫБОР
	|			КОГДА ИтоговаяБезГруппировки.ВидСтавки = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	|				ТОГДА ЕСТЬNULL(ИтоговаяБезГруппировки.СтавкаФрахт_Н, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Себестоимость,
	|	СУММА(ИтоговаяБезГруппировки.Вознаграждение + ВЫБОР
	|			КОГДА ИтоговаяБезГруппировки.ВидСтавки = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	|				ТОГДА ЕСТЬNULL(ИтоговаяБезГруппировки.Вознаграждение_Н, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Вознаграждение,
	|	СУММА(ИтоговаяБезГруппировки.Ставка + ВЫБОР
	|			КОГДА ИтоговаяБезГруппировки.ВидСтавки = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	|				ТОГДА ЕСТЬNULL(ИтоговаяБезГруппировки.Итого_Н, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Ставка,
	|	ИтоговаяБезГруппировки.СтавкаНДС КАК СтавкаНДС,
	|	ИтоговаяБезГруппировки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИтоговаяБезГруппировки.Валюта КАК Валюта,
	|	ИтоговаяБезГруппировки.УчастокПеревозки КАК УчастокПеревозки,
	|	ИтоговаяБезГруппировки.НомерЖДН КАК НомерЖДН,
	|	ИтоговаяБезГруппировки.Удалена КАК Удалена,
	|	ИтоговаяБезГруппировки.Построчно КАК Построчно,
	|	ИтоговаяБезГруппировки.Коносамент КАК Коносамент,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ИтоговаяБезГруппировки.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ИтоговаяБезГруппировки.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ИтоговаяБезГруппировки.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ИтоговаяБезГруппировки.СтанцияНазначения КАК СтанцияНазначения,
	|	ИтоговаяБезГруппировки.ЖДН КАК ЖДН,
	|	ИтоговаяБезГруппировки.Услуга КАК Услуга,
	|	ИтоговаяБезГруппировки.ВидСтавки КАК ВидСтавки,
	//Евросиб - АСуслов 17.01.2023 11:41:53 #61165
	//(
	|   ИтоговаяБезГруппировки.ГруппироватьПоВагонам КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:41:55 #61165
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	ИтоговаяБезГруппировки КАК ИтоговаяБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяБезГруппировки.Калькуляция,
	|	ИтоговаяБезГруппировки.Клиент,
	|	ИтоговаяБезГруппировки.ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ИтоговаяБезГруппировки.ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ИтоговаяБезГруппировки.Договор,
	|	ИтоговаяБезГруппировки.Контейнер,
	|	ИтоговаяБезГруппировки.РеестрКлиента,
	|	ИтоговаяБезГруппировки.Вагон,
	|	ИтоговаяБезГруппировки.СтрокаСУЕ,
	|	ИтоговаяБезГруппировки.ОбычныйРасчет,
	//Евросиб - АСуслов 17.01.2023 12:58:09 #61165
	//(     
	//|   ИтоговаяБезГруппировки.РазмерКТК
	|   ВЫБОР КОГДА ИтоговаяБезГруппировки.ГруппироватьПоВагонам ТОГДА Неопределено ИНАЧЕ ИтоговаяБезГруппировки.РазмерКТК КОНЕЦ,
	//)
	//Евросиб - АСуслов 17.01.2023 12:58:10 #61165
	|	ИтоговаяБезГруппировки.СтавкаНДС,
	|	ИтоговаяБезГруппировки.СуммаВключаетНДС,
	|	ИтоговаяБезГруппировки.Валюта,
	|	ИтоговаяБезГруппировки.УчастокПеревозки,
	|	ИтоговаяБезГруппировки.НомерЖДН,
	|	ИтоговаяБезГруппировки.Удалена,
	|	ИтоговаяБезГруппировки.Построчно,
	|	ИтоговаяБезГруппировки.Коносамент,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ИтоговаяБезГруппировки.СобственностьПеревозимогоКТК,
	//ок)
	|	ИтоговаяБезГруппировки.УдалитьСобственностьПеревозимогоКТК,
	|	ИтоговаяБезГруппировки.ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ИтоговаяБезГруппировки.СтанцияНазначения,
	|	ИтоговаяБезГруппировки.ЖДН,
	|	ИтоговаяБезГруппировки.Услуга,
	|	ИтоговаяБезГруппировки.ВидСтавки,
	//Евросиб - АСуслов 17.01.2023 11:41:53 #61165
	//(
	|   ИтоговаяБезГруппировки.ГруппироватьПоВагонам,
	//)
	//Евросиб - АСуслов 17.01.2023 11:41:55 #61165
	|	НАЧАЛОПЕРИОДА(ИтоговаяБезГруппировки.ДатаОказанияУслуги, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Калькуляция КАК Калькуляция,
	|	Итоговая.Клиент КАК Клиент,
	|	Итоговая.Договор КАК Договор,
	|	Итоговая.УчастокПеревозки КАК УчастокПеревозки,
	|	Итоговая.НомерЖДН КАК НомерЖДН,
	|	Итоговая.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	Итоговая.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	Итоговая.Контейнер КАК Контейнер,
	|	Итоговая.РеестрКлиента КАК РеестрКлиента,
	|	Итоговая.Вагон КАК Вагон,
	|	Итоговая.ОбычныйРасчет КАК ОбычныйРасчет,
	|	Итоговая.РазмерКТК КАК РазмерКТК,
	|	Итоговая.Себестоимость КАК Себестоимость,
	|	Итоговая.Вознаграждение КАК Вознаграждение,
	|	Итоговая.Ставка КАК Ставка,
	|	Итоговая.СтавкаНДС КАК СтавкаНДС,
	|	Итоговая.СуммаВключаетНДС КАК НДСВключенВСтоимость,
	|	Итоговая.Валюта КАК Валюта,
	|	Итоговая.Удалена КАК Удалена,
	|	ВЫБОР
	|		КОГДА Итоговая.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ Итоговая.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	//Евросиб Коханенко Н.А. 16.10.2025 (( #118657 
	|				ИЛИ Итоговая.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ДоплатныеПВ)
	//Евросиб Коханенко Н.А. 16.10.2025 )) #118657 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	Итоговая.Построчно КАК Построчно,
	|	Итоговая.СтрокаСУЕ КАК СтрокаСУЕ,
	|	Итоговая.ВидСтавки КАК ВидСтавкиФрахт,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	Итоговая.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	Итоговая.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	Итоговая.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	|	Итоговая.ЖДН КАК ЖДН,
	|	Итоговая.Услуга КАК Услуга,
	|	Итоговая.Коносамент КАК Коносамент,
	|	Итоговая.МесяцОказанияУслуги КАК МесяцОказанияУслуги,
	//Евросиб - АСуслов 17.01.2023 11:41:53 #61165
	//(
	|   Итоговая.ГруппироватьПоВагонам КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:41:55 #61165
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
	|	,ВЫБОР
	|		КОГДА Итоговая.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|			ТОГДА Истина
	|		ИНАЧЕ Ложь
	|	КОНЕЦ КАК ДоплатныеКТК
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	Итоговая КАК Итоговая
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьРеестры = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Итоговая.РеестрКлиента В (&СписокРеестров)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итоговая.Калькуляция КАК Калькуляция,
	|	ВТ_Итоговая.Клиент КАК Клиент,
	|	ВТ_Итоговая.Договор КАК Договор,
	|	ВТ_Итоговая.УчастокПеревозки КАК УчастокПеревозки,
	|	ВТ_Итоговая.НомерЖДН КАК НомерЖДН,
	|	ВТ_Итоговая.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ВТ_Итоговая.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	ВТ_Итоговая.Контейнер КАК Контейнер,
	|	ВТ_Итоговая.РеестрКлиента КАК РеестрКлиента,
	|	ВТ_Итоговая.Вагон КАК Вагон,
	|	ВТ_Итоговая.ОбычныйРасчет КАК ОбычныйРасчет,
	|	ВТ_Итоговая.РазмерКТК КАК РазмерКТК,
	|	ВТ_Итоговая.Себестоимость КАК Себестоимость,
	|	ВТ_Итоговая.Вознаграждение КАК Вознаграждение,
	|	ВТ_Итоговая.Ставка КАК Ставка,
	|	ВТ_Итоговая.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Итоговая.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВТ_Итоговая.Валюта КАК Валюта,
	|	ВТ_Итоговая.Удалена КАК Удалена,
	|	ВТ_Итоговая.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Итоговая.Построчно КАК Построчно,
	|	ВТ_Итоговая.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_Итоговая.ВидСтавкиФрахт КАК ВидСтавкиФрахт,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_Итоговая.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_Итоговая.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_Итоговая.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ_Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_Итоговая.ЖДН КАК ЖДН,
	|	ВТ_Итоговая.Услуга КАК Услуга,
	|	ВТ_Итоговая.Коносамент КАК Коносамент,
	|	ВТ_Итоговая.МесяцОказанияУслуги КАК МесяцОказанияУслуги,
	//Евросиб - АСуслов 17.01.2023 11:41:53 #61165
	//(
	|   ВТ_Итоговая.ГруппироватьПоВагонам КАК ГруппироватьПоВагонам
	//)
	//Евросиб - АСуслов 17.01.2023 11:41:55 #61165
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
	|	,ВТ_Итоговая.ДоплатныеКТК КАК ДоплатныеКТК
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент,
	|	Договор,
	|	Коносамент УБЫВ,
	|	Калькуляция,
	|	Услуга
	|ИТОГИ ПО
	|	Договор,
	|	РеестрКлиента";
	
	#КонецОбласти
	#Область АлгоритмЗаполнения
	РезультатЗапроса = Запрос2.Выполнить();
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДоговор.Следующий() Цикл
		ВыборкаРеестрКлиента = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//сделаем временную таблицу и в неё заполним данные, чтобы потом их обработать
		ВремТабДоходы = СделкаОбъект.Доходы.Выгрузить();
		Если ВремТабДоходы.Колонки.Найти("СписокВагонов") = Неопределено Тогда
			ВремТабДоходы.Колонки.Добавить("СписокВагонов",Новый ОписаниеТипов("Строка"));
			ВремТабДоходы.Колонки.Добавить("СписокКТК",Новый ОписаниеТипов("Строка"));
			ВремТабДоходы.Колонки.Добавить("СписокТД",Новый ОписаниеТипов("Строка"));
		КонецЕсли;
		ВремТабДоходы.Очистить();
		
		Пока ВыборкаРеестрКлиента.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаРеестрКлиента.Выбрать();
			///////////////////// доходная часть ////////////////////////////
			///// !!!!!!!!!!! ОбычныйРасчет = 0 - означает, что используется расчет для ОСОБЫХ клиентов !!!!! ////////
			// Если это расчет для особых клиентов, тогда добавлять строки нужно один раз. 
			// для контроля используем проверку ДанныеДобавлены
			ДанныеДобавлены = Ложь;
			ПервыйЗаход = Истина;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//Евросиб Каблов 06.01.2024 ( #78949
				//Если СписокГотовыхКОформлениюДоговоров.НайтиСтроки(Новый Структура("Договор", ВыборкаДетальныеЗаписи.Договор)).Количество() = 0 Тогда
				Если СписокГотовыхКОформлениюДоговоров.Найти(ВыборкаДетальныеЗаписи.Договор) = Неопределено Тогда
				//Евросиб Каблов 06.01.2024 )
					Продолжить;
				КонецЕсли;
				
				ПервыйЗаход = Ложь;
				СписокКТК = "";
				СписокВагонов = "";
				СписокТД = "";
				Колво = 0;
				НСтр = ВремТабДоходы.Добавить(); 
				//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, начало
				НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, конец
				// после первого добавления меняем признак ДанныеДобавлены на Истина, чтобы больше в этот блок не заходить 
				// (для особых клиентов, для обычных - заполняем)
				Если (НЕ ДанныеДобавлены И ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0) ИЛИ
					НЕ ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 ИЛИ
					МассивКонтрагСРеестром.Найти(ВыборкаДетальныеЗаписи.Клиент) = Неопределено Тогда
					ЗаполнитьЗначенияСвойств(НСтр,ВыборкаДетальныеЗаписи);
					НСтр.Услуга = ВыборкаДетальныеЗаписи.Услуга;
					НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
					Если НЕ ВыборкаДетальныеЗаписи.СтрокаСУЕ = "" Тогда
						Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, нСтр.ГУИД, ,ВыборкаДетальныеЗаписи.СтрокаСУЕ,?(ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта, УслугаФрахта, Неопределено)); 
					КонецЕсли;
					
					ДанныеДобавлены = Истина;
				КонецЕсли;
				// для обычного расчета (когда клиенты не входят в справочник ФормированиеФинДокументов или у них не требуется заполнение реестра) 
				// номера вагонов и контейнров
				// возьмем из ТЧ СвязьУчетныхЕдиниц по отбору из основного запроса.
				Если ВыборкаДетальныеЗаписи.Построчно Тогда
					ПервыйЗаход = Ложь; 
					//Евросиб - АСуслов 31.01.2023 17:34:07 #64514
					//(
					нСтр.РеестрКлиента = ВыборкаДетальныеЗаписи.Контейнер;
					//)
					//Евросиб - АСуслов 31.01.2023 17:34:09 #64514
					НСтр.СписокКТК = ВыборкаДетальныеЗаписи.Контейнер.Наименование;
					НСтр.СписокТД = ВыборкаДетальныеЗаписи.НомерЖДН;
					НСтр.СписокВагонов = ВыборкаДетальныеЗаписи.Вагон.Наименование;
					ДобавитьКТКВДоходы(СделкаОбъект, НСтр.ГУИД, ВыборкаДетальныеЗаписи.Контейнер.Наименование);
					ДобавитьТДВДоходы(СделкаОбъект, НСтр.ГУИД, ВыборкаДетальныеЗаписи.НомерЖДН);
					ДобавитьВагонВДоходы(СделкаОбъект, НСтр.ГУИД, ВыборкаДетальныеЗаписи.Вагон.Наименование);
					НСтр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(СделкаОбъект.ТипЗаказа, ВыборкаДетальныеЗаписи.Вагон);
					НСтр.Количество = 1;
					НСтр.Себестоимость = НСтр.Себестоимость;
					НСтр.Вознаграждение = НСтр.Вознаграждение;
					НСтр.Ставка = НСтр.Ставка;
					НСтр.Подсыл = (ВыборкаДетальныеЗаписи.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров);
					нСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
					Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, НСтр.ГУИД,, ВыборкаДетальныеЗаписи.СтрокаСУЕ, ?(ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта, УслугаФрахта, Неопределено));
				ИначеЕсли НЕ ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 ИЛИ
					МассивКонтрагСРеестром.Найти(ВыборкаДетальныеЗаписи.Клиент) = Неопределено Тогда
					ПараметрыОтбора = Новый Структура("Клиент, Договор, Калькуляция, РазмерКТК", ВыборкаДетальныеЗаписи.Клиент, ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Калькуляция, ВыборкаДетальныеЗаписи.РазмерКТК);
					//Евросиб - АСуслов 17.01.2023 12:18:29 #61165
					//(
					Если ВыборкаДетальныеЗаписи.ГруппироватьПоВагонам = Истина Тогда
						ПараметрыОтбора.Удалить("РазмерКТК");
					КонецЕсли;
					//)
					//Евросиб - АСуслов 17.01.2023 12:18:31 #61165
					ПараметрыОтбора.Вставить("ГотовоКВыставлению", Истина);
					//Евросиб - АСуслов 21.04.2022 15:58:36 #
					//(
					ПараметрыОтбора.Вставить("МесяцОказанияУслуги", ВыборкаДетальныеЗаписи.МесяцОказанияУслуги);
					//)
					//Евросиб - АСуслов 21.04.2022 15:58:37 #
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Коносамент) Тогда
						ПараметрыОтбора.Вставить("Коносамент", ВыборкаДетальныеЗаписи.Коносамент); 
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
					ПараметрыОтбора.Вставить("ПСЦ", ВыборкаДетальныеЗаписи.ПСЦ);
					//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
					
					//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, начало
					//если вид ставки "суммировать", то надо искать по жд или пусто
					//а если нет, то тогда по услуге определять
					//если фрахт, то либо море, либо пусто
					//если не фрахт, то либо жд либо пусто
					ПараметрыОтбора.Вставить("ВидТранспортногоСообщения", Перечисления.ВидыТранспортныхСообщений.ЖД);
					Если ВыборкаДетальныеЗаписи.ВидСтавкиФрахт <> Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка
							И ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта Тогда
						ПараметрыОтбора.Вставить("ВидТранспортногоСообщения", Перечисления.ВидыТранспортныхСообщений.Море);
					КонецЕсли;
					ТаблицаСвязейУчетныхЕдиницДляСтрокиДохода = ПолучитьТаблицуСвязейУчетныхЕдиницПоОтбору(ТаблицаСвязейУчетныхЕдиниц, ПараметрыОтбора);
					//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, конец	
					КоличествоКонтейнеров = 0;
					КоличествоВагонов = 0;
					//Евросиб - АСуслов 07.06.2021 13:11:20 #0234252
					//(
					//СвязьДоходовСУЕ = Объект.СвязьДоходовИРасходов.Выгрузить(,"Доходы, СвязьУчетныхЕдиниц");
					Если ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта Тогда
						СвязьДоходовСУЕ = СделкаОбъект.СвязьДоходовИРасходов.Выгрузить(Новый Структура("Услуга", УслугаФрахта),"Доходы, СвязьУчетныхЕдиниц");
						СвязьДоходовСУЕ.Свернуть("Доходы, СвязьУчетныхЕдиниц");
					Иначе	
						СвязьДоходовСУЕ = ПолучитьСвязиПоОсновнымУслугам(СделкаОбъект);
						//СвязьДоходовСУЕ = Объект.СвязьДоходовИРасходов.Выгрузить(Новый Структура("Услуга", Справочники.Номенклатура.ПустаяСсылка()),"Доходы, СвязьУчетныхЕдиниц");
					КонецЕсли; 
					МассивКонтейнеровПоРеестру = ПолучитьМассивКонтейнеровПоРеестру(СделкаОбъект, СписокРеестров);
					//)
					//Евросиб - АСуслов 07.06.2021 13:11:31 #0234252                                                  
					//Евросиб - АСуслов 21.04.2022 16:00:50 #
					//(
					//Для каждого СтрСоставПоезда из СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыОтбора) Цикл
					//Для каждого СтрСоставПоезда из ТаблицаСвязейУчетныхЕдиниц.НайтиСтроки(ПараметрыОтбора) Цикл
					//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, начало
					Для каждого СтрСоставПоезда из ТаблицаСвязейУчетныхЕдиницДляСтрокиДохода Цикл
					//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, конец
					//)
					//Евросиб - АСуслов 21.04.2022 16:00:50 #
						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтанцияНазначения) Тогда
							Если НЕ СтрСоставПоезда.ЖДН.СтанцияНазначения = ВыборкаДетальныеЗаписи.СтанцияНазначения Тогда
								Продолжить;
							КонецЕсли; 
						КонецЕсли;
						
						//Евросиб - АСуслов 04.01.2022 12:17:14 #
						//(
						//Для реестров проверяем что контейнер попадает в список реестров
						Если НЕ МассивКонтейнеровПоРеестру = Неопределено Тогда
							Если МассивКонтейнеровПоРеестру.Найти(СтрСоставПоезда.Контейнер) = Неопределено Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						//)
						//Евросиб - АСуслов 04.01.2022 12:17:15 #
						
						//Евросиб - АСуслов 28.05.2021 16:41:36 #
						//(
						СтрокаСвязь = СвязьДоходовСУЕ.Найти(СтрСоставПоезда.ГУИД, "СвязьУчетныхЕдиниц");
						Если НЕ (СтрокаСвязь = Неопределено ИЛИ СтрокаСвязь.Доходы = "") Тогда
							// Евросиб Фролов (21.02.2022 Ticket №0259369
							// Строка в доходах в текущем цикле уже добавлена, а связь с КТК не делается.
							//проблема в тикете 259369 была не в этом, проверка и продолжить нужна
							Продолжить;
							// Евросиб Фролов)
						КонецЕсли; 
						//)
						//Евросиб - АСуслов 28.05.2021 16:41:37 #
						
						НСтр.СписокКТК = НСтр.СписокКТК + ?(НСтр.СписокКТК = "", "", ";") + СтрСоставПоезда.Контейнер.Наименование;
						ДобавитьКТКВДоходы(СделкаОбъект, НСтр.ГУИД, СтрСоставПоезда.Контейнер.Наименование, Ложь);
						КоличествоКонтейнеров = КоличествоКонтейнеров + 1;
						Если Найти(НСтр.СписокТД, СтрСоставПоезда.НомерЖДН) = 0 Тогда
							НСтр.СписокТД = НСтр.СписокТД + ?(НСтр.СписокТД = "", "", ";") + СтрСоставПоезда.НомерЖДН;
							ДобавитьТДВДоходы(СделкаОбъект, НСтр.ГУИД, СтрСоставПоезда.НомерЖДН, Ложь);
						КонецЕсли;
						Если Найти(НСтр.СписокВагонов, СтрСоставПоезда.Вагон.Наименование) = 0 Тогда
							НСтр.СписокВагонов = НСтр.СписокВагонов + ?(НСтр.СписокВагонов = "", "", ";") + СтрСоставПоезда.Вагон.Наименование;
							ДобавитьВагонВДоходы(СделкаОбъект, НСтр.ГУИД, СтрСоставПоезда.Вагон.Наименование, Ложь);
							Если ВыборкаДетальныеЗаписи.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
								КоличествоВагонов = КоличествоВагонов + 1;	
							КонецЕсли; 
						КонецЕсли;
						НСтр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(СделкаОбъект.ТипЗаказа, СтрСоставПоезда.Вагон);
						
						Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, НСтр.ГУИД, , СтрСоставПоезда.ГУИД, ?(ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта, УслугаФрахта, Неопределено));
						//Евросиб - АСуслов 23.09.2022 12:06:27 #56288
						//(
						//Если вид ставки просуммировать, то суе по фрахту привяжем к тэу                                                                          
						//Евросиб - АСуслов 04.10.2022 13:40:39 #тэуфрахт
						//(
						//СтрокиМоре = ТаблицаСвязейУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки, ВидТранспортногоСообщения,ВидСтавки",
						//																	СтрСоставПоезда.ГУИДСтрокиЗаявки,
						//																	Перечисления.ВидыТранспортныхСообщений.Море,
						//																	Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка));
						//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
						СтрокиМоре = ТаблицаСвязейУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки, ВидТранспортногоСообщения,ДокументФФД_ВидСтавки",
																							СтрСоставПоезда.ГУИДСтрокиЗаявки,
																							Перечисления.ВидыТранспортныхСообщений.Море,
																							Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка));  
						//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
						//)
						//Евросиб - АСуслов 04.10.2022 13:40:42 #тэуфрахт
						Если ЗначениеЗаполнено(СтрокиМоре) Тогда
							Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, НСтр.ГУИД, , СтрокиМоре[0].ГУИД, УслугаФрахта);
						КонецЕсли;
						//)
						//Евросиб - АСуслов 23.09.2022 12:06:29 #56288
						
						Если ВыборкаДетальныеЗаписи.Построчно Тогда
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					// для особого расчета данные по КТК и вагонам есть в самом результате запроса
					// Себестоимость и вознаграждение разделить на количество контейнеров
					Если ВыборкаДетальныеЗаписи.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
						Нстр.Количество = КоличествоВагонов;
					Иначе
						Нстр.Количество = КоличествоКонтейнеров;
					КонецЕсли; 
					НСтр.Себестоимость = НСтр.Себестоимость/?(ЗначениеЗаполнено(КоличествоКонтейнеров),КоличествоКонтейнеров,1);
					НСтр.Вознаграждение = НСтр.Вознаграждение/?(ЗначениеЗаполнено(КоличествоКонтейнеров),КоличествоКонтейнеров,1);
					НСтр.Ставка = НСтр.Ставка/?(ЗначениеЗаполнено(КоличествоКонтейнеров),КоличествоКонтейнеров,1);
					НСтр.Подсыл = (ВыборкаДетальныеЗаписи.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров);
					
				Иначе	
					НСтр.Подсыл = (ВыборкаДетальныеЗаписи.УчастокПеревозки = Перечисления.УчастокПеревозки.ПодсылКонтейнеров);
					СписокКТК = СписокКТК + ?(СписокКТК = "", "", ";") + Строка(ВыборкаДетальныеЗаписи.Контейнер);
					
					Если Найти(СписокВагонов, ВыборкаДетальныеЗаписи.Вагон) = 0 Тогда
						СписокВагонов = СписокВагонов + ?(СписокВагонов = "", "", ";") + ВыборкаДетальныеЗаписи.Вагон;
					КонецЕсли;
					
					Если Найти(СписокТД, ВыборкаДетальныеЗаписи.НомерЖДН) = 0 Тогда
						СписокТД = НСтр.СписокТД + ?(СписокТД = "", "", ";") + ВыборкаДетальныеЗаписи.НомерЖДН;
					КонецЕсли;
					
					
					НСтр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(СделкаОбъект.ТипЗаказа, ВыборкаДетальныеЗаписи.Вагон);
					Колво = Колво + 1;
				КонецЕсли;
				// для особого расчета итого по КТК надо выдавать за пределами детальных записей, т.к. идет суммирование по результату запроса,
				// а не отбором по таблице СвязьУчетныхЕдиниц как в случае обычного расчета
				Если ВыборкаДетальныеЗаписи.ОбычныйРасчет = 0 И
					НЕ МассивКонтрагСРеестром.Найти(ВыборкаДетальныеЗаписи.Клиент) = Неопределено Тогда
					НСтр.СписокКТК = СписокКТК;
					НСтр.СписокТД = СписокТД;
					НСтр.СписокВагонов = СписокВагонов;
					ДобавитьКТКВДоходы(СделкаОбъект, НСтр.ГУИД, СписокКТК);
					ДобавитьТДВДоходы(СделкаОбъект, НСтр.ГУИД, СписокТД);
					ДобавитьВагонВДоходы(СделкаОбъект, НСтр.ГУИД, СписокВагонов);
					НСтр.Количество = Колво;
					Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, нСтр.ГУИД,,ВыборкаДетальныеЗаписи.СтрокаСУЕ, ?(ВыборкаДетальныеЗаписи.Услуга = УслугаФрахта, УслугаФрахта, Неопределено));
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;//реестры
		
		//есть сделки с чисто морской частью, поэтому могут появляться строчки ТЭУ с нулевой ставкой
		//удалим их
		СтрокиКУдалению = ВремТабДоходы.НайтиСтроки(Новый Структура("Ставка", 0));
		Для каждого СтрокаКУдалению Из СтрокиКУдалению  Цикл
			СтрокиСвязи = СделкаОбъект.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы",СтрокаКУдалению.ГУИД));
			Для каждого СтрокаСвязь Из СтрокиСвязи Цикл
				СтрокаСвязь.Доходы = "";
			КонецЦикла; 
			ВремТабДоходы.Удалить(СтрокаКУдалению);
		КонецЦикла; 
		#КонецОбласти		
		#Область АлгоритмГруппировкиФрахта
		//если есть фрахт, и правило суша сводно, море по группировкам, то сгруппируем ТЭУ
		//для этого удалим коносаменты
		СтрокаФрахт = ВремТабДоходы.Найти(УслугаФрахта, "Услуга");
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ВремТабДоходы);
		
		тОтбор = Построитель.Отбор.Добавить("Коносамент");
		тОтбор.ВидСравнения = ВидСравнения.НеРавно;
		тОтбор.Значение = Документы.ТранспортныйДокумент.ПустаяСсылка();
		тОтбор.Использование = Истина;
		
		Построитель.Выполнить();
		ТабРезультат = Построитель.Результат.Выгрузить();
		СтрокаФрахт = Неопределено;
		Если ТабРезультат.Количество() > 0 Тогда
			СтрокаФрахт = ТабРезультат[0];
		КонецЕсли;
		Если СтрокаФрахт <> Неопределено Тогда                                                                   
			ВидПеревозки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФрахт.Калькуляция, "ПС_ВидПеревозки");
			//СтрокаСвязи = Объект.СвязьДоходовИРасходов.НайтиСтроки(СтрокаФрахт.ГУИД, "Доходы");
			//СтрокаСУЕ = Объект.СвязьУчетныхЕдиниц.Найти(СтрокаСвязи.СвязьУчетныхЕдиниц);
			ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(
			ВыборкаДоговор.Договор.Владелец,
			ВидПеревозки,
			СделкаОбъект.ПовагонныеОтправки,
			Неопределено);
			
			ВремТабДоходы.Колонки.Добавить("ПунктОтправления");
			ВремТабДоходы.Колонки.Добавить("ПунктНазначения");
			ТаблицаКоносаменты = ВремТабДоходы.Скопировать();
			ТаблицаКоносаменты.Свернуть("ГУИД, Коносамент");
			ТаблицаНаправленияКоносаментов = ВремТабДоходы.Скопировать();
			ТаблицаНаправленияКоносаментов.Свернуть("ПунктОтправления, ПунктНазначения, Коносамент, ДатаОказанияУслуги"); 
			ТаблицаНаправленияКоносаментов.Очистить();
			Если ПараметрыФФД <> Неопределено                                         
				//Евросиб - АСуслов 03.12.2021 11:38:04 #41827
				//(
				//1.добавил условие, чтобы ничего не делалось при поконтейнерной экономике
				//2.при этом нужно чтобы группировалось для случаев по группировке по коносаменту и по направлениям, поэтому этот вариант не годится
				//3.поэтому перенес это условие для свёртки таблицы, чтобы отработали все блоки удаления группировок
				//не будем ничего исправлять для случая, когда ставка сквозная и контейнеры построчно
				//оставим в строках коносаменты, чтобы можно было группировать в случае вида группировки фрахта по коносаментам
				//для группировок нужно почистить лишние данные, но при этом не сворачивать таблицу
				//И НЕ (ПараметрыФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно 
				//		И ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт2Строки)
				//)
				//Евросиб - АСуслов 03.12.2021 11:38:15 #41827 
				//по факту получилось, что все виды ставок нужно обрабатывать, поэтому условие убрал
				//И (ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки
				//	ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.КомплекснаяСтавкаНесколькимиСтроками
				//	ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт2Строки) 
				Тогда
				УслугаТЭУ = Справочники.Номенклатура.НайтиПоНаименованию("ТЭУ");
				УслугаФрахт = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
				//блок удаления коносаментов для группировок
				Для каждого СтрокаВремДоходы Из ВремТабДоходы Цикл
					Если ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт2Строки 
						И ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоКоносаментам
						//если ставка двойная разделение по коносаментам, то ничего не делаем разбиваем рту по коносаментам и по ТЭУ и по Фрахту
						//08.12 за исключением когда формируем отдельный счет
						И НЕ ПараметрыФФД.СобратьГруппировкиВОдинСчет
						//09.12 аналогично по группировке по датам
						//21.12 убрал потому что нужно группировать по направлениям и по датам, для этого нужны коносаменты
						//И НЕ ПараметрыФФД.ГруппироватьВыставляемыеРеализацииПосуточно
						Тогда
						Прервать;
					КонецЕсли;
					Если СтрокаВремДоходы.Услуга = УслугаТЭУ Тогда
						Если (ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.КомплекснаяСтавкаНесколькимиСтроками 
							//если фрахт в услуге ТЭУ, то разбиваем по направлениям
							ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка
							ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт2Строки)
							И ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки Тогда  
							Если ЗначениеЗаполнено(СтрокаВремДоходы.Коносамент) Тогда
								РеквизитыКоносамента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВремДоходы.Коносамент, "СтанцияОтправления, СтанцияНазначения");
								СтруктураПоиска = Новый Структура("ПунктНазначения, ПунктОтправления, ДатаОказанияУслуги", 
								РеквизитыКоносамента.СтанцияНазначения,
								РеквизитыКоносамента.СтанцияОтправления);
								СтрокиНаправленийКоносамента = ТаблицаНаправленияКоносаментов.НайтиСтроки(СтруктураПоиска);
								Если СтрокиНаправленийКоносамента.Количество() = 0 Тогда
									нСтрокаНаправления = ТаблицаНаправленияКоносаментов.Добавить();
									нСтрокаНаправления.ПунктНазначения = РеквизитыКоносамента.СтанцияНазначения;
									нСтрокаНаправления.ПунктОтправления = РеквизитыКоносамента.СтанцияОтправления;
									нСтрокаНаправления.Коносамент = СтрокаВремДоходы.Коносамент;
								КонецЕсли;
								СтрокаВремДоходы.ПунктОтправления = РеквизитыКоносамента.СтанцияОтправления;
								СтрокаВремДоходы.ПунктНазначения = РеквизитыКоносамента.СтанцияНазначения;
								СтрокаВремДоходы.Коносамент = Документы.ТранспортныйДокумент.ПустаяСсылка();
							КонецЕсли;
							//8.12 коносаменты нужно очищать только в том случае, когда нам не нужно группировать по ним	
						ИначеЕсли ПараметрыФФД.СобратьГруппировкиВОдинСчет 
							//19.12 аналогично для группировки по датам                 
							//21.12 группировки и по датам и по направлениям
							//ИЛИ ПараметрыФФД.ГруппироватьВыставляемыеРеализацииПосуточно
							ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки
							ИЛИ ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.НеРазделять Тогда
							СтрокаВремДоходы.Коносамент = Документы.ТранспортныйДокумент.ПустаяСсылка();
						КонецЕсли; 
						Продолжить;
					КонецЕсли;
					//Если разделение фрахта: не разделять, то тоже удалим коносаменты
					Если ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.НеРазделять
						// если нужно сгруппировать в один счет, то коносаменты нужно удалить, иначе для каждого коносамента будет отдельный док
						//при этом не нужно группировать строчки 
						//09.12 поменял условие
						//ИЛИ (ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоКоносаментам
						//И ПараметрыФФД.СобратьГруппировкиВОдинСчет) Тогда
						ИЛИ  ПараметрыФФД.СобратьГруппировкиВОдинСчет
						//09.12 аналогично для группировки по датам
						//21.12 группировки и по датам и по направлениям
						//ИЛИ ПараметрыФФД.ГруппироватьВыставляемыеРеализацииПосуточно
						Тогда
						СтрокаВремДоходы.Коносамент = Документы.ТранспортныйДокумент.ПустаяСсылка();
						//если разделение фрахта: разделять по направлениям, то добавим направление из коносамента, а коносамент удалим
					ИначеЕсли ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки Тогда 
						Если ЗначениеЗаполнено(СтрокаВремДоходы.Коносамент) Тогда
							РеквизитыКоносамента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВремДоходы.Коносамент, "СтанцияОтправления, СтанцияНазначения");
							СтруктураПоиска = Новый Структура("ПунктНазначения, ПунктОтправления", РеквизитыКоносамента.СтанцияНазначения, РеквизитыКоносамента.СтанцияОтправления);
							СтрокиНаправленийКоносамента = ТаблицаНаправленияКоносаментов.НайтиСтроки(СтруктураПоиска);
							Если СтрокиНаправленийКоносамента.Количество() = 0 Тогда
								нСтрокаНаправления = ТаблицаНаправленияКоносаментов.Добавить();
								нСтрокаНаправления.ПунктНазначения = РеквизитыКоносамента.СтанцияНазначения;
								нСтрокаНаправления.ПунктОтправления = РеквизитыКоносамента.СтанцияОтправления;
								нСтрокаНаправления.Коносамент = СтрокаВремДоходы.Коносамент;
							КонецЕсли;
							СтрокаВремДоходы.ПунктОтправления = РеквизитыКоносамента.СтанцияОтправления;
							СтрокаВремДоходы.ПунктНазначения = РеквизитыКоносамента.СтанцияНазначения;
							СтрокаВремДоходы.Коносамент = Документы.ТранспортныйДокумент.ПустаяСсылка();
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла;
				//не будем группировать для построчных контейнеров
				//8.12 группировать надо, потому что для условия по направлению
				//мы добавили порты в таблицу, а теперь из них надо сделать коносаменты 
				//для поконтейнерного заполнения заполним коносаменты по направлениям
				Если НЕ ПараметрыФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
					//Евросиб - АСуслов 31.01.2023 15:16:36 #64514
					//(
					И НЕ ПараметрыФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно
					//)
					//Евросиб - АСуслов 31.01.2023 15:16:39 #64514
					//если нужно выставить строки в одном документе, 
					//то строки мы подготовили выше, а группировать их не будем
					И НЕ ПараметрыФФД.СобратьГруппировкиВОдинСчет
					Тогда
					//сделаем отдельную таблицу с КТК, вагонами и ТД
					ТемпВремТабДоходы = ВремТабДоходы.Скопировать();
					//ТемпВремТабДоходы.Свернуть("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, СписокВагонов, СписокКТК, СписокТД, ГУИД, Груз");
					//Евросиб - АСуслов 13.12.2021 17:32:13 #
					//(
					//нужно добавить себестоимость и вознаграждение, т.к. по одной калькуляции могут быть разные суммы
					//ТемпВремТабДоходы.Свернуть("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, СписокВагонов, СписокКТК, СписокТД, ГУИД, Себестоимость, Вознаграждение");
					//ДИТ, Беляев СЮ, Ticket#0349484 , 19-04-2024, начало
					ТемпВремТабДоходы.Свернуть("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, СписокВагонов, СписокКТК, СписокТД, ГУИД, Себестоимость, Вознаграждение, ПСЦ");
					//ДИТ, Беляев СЮ, Ticket#0349484 , 19-04-2024, конец
					//теперь всё свернем
					//КолонкиСвертки = "Клиент, Договор, Услуга, Калькуляция,СтавкаНДС,НДСВключенВСтоимость,ТипВагонов,ТипКТК,Груз,РазмерКТК,ПериодВО,Валюта,НоменклатурнаяГруппа,ПСЦ,ПоставщикФрахт,ЕдиницаИзмерения,Коносамент, ПунктОтправления, ПунктНазначения, Себестоимость,Вознаграждение,Ставка";
					//КолонкиСвертки = "Клиент, Договор, Услуга, Калькуляция,СтавкаНДС,НДСВключенВСтоимость,ТипВагонов,ТипКТК,РазмерКТК,ПериодВО,Валюта,НоменклатурнаяГруппа,ПСЦ,ПоставщикФрахт,ЕдиницаИзмерения,Коносамент, ПунктОтправления, ПунктНазначения, Себестоимость,Вознаграждение,Ставка";
					//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
					КолонкиСвертки = "Клиент, Договор, Услуга, Калькуляция,СтавкаНДС,НДСВключенВСтоимость,ТипВагонов,ТипКТК,РазмерКТК,ПериодВО,Валюта,НоменклатурнаяГруппа,ПСЦ,ПоставщикФрахт,ЕдиницаИзмерения,Коносамент, ПунктОтправления, ПунктНазначения, Себестоимость,Вознаграждение,Ставка,ДоплатныеКТК";
					//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
					КолонкиИтогов = "Количество,СебестоимостьИтого,ВознаграждениеИтого,СтавкаИтого,Рентабельность,СуммаНДС,СуммаИтого, СписокВагонов, СписокКТК, СписокТД, ГУИД";
					ВремТабДоходы.Свернуть(КолонкиСвертки, КолонкиИтогов);
					//теперь заполним по КТК, Вагоны, ТД
					Для каждого ВремДоход Из ВремТабДоходы Цикл
						//ПараметрыПоиска = Новый Структура("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, Груз");
						//по фрахту калькуляции могут быть одинаковыми, а ставки в них разные, поэтому добавим их в параметры поиска
						//ПараметрыПоиска = Новый Структура("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения");
						//ПараметрыПоиска = Новый Структура("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, Себестоимость, Вознаграждение");
						//ДИТ, Беляев СЮ, Ticket#0349484 , 19-04-2024, начало
						ПараметрыПоиска = Новый Структура("Услуга, Калькуляция, Коносамент, ПунктОтправления, ПунктНазначения, Себестоимость, Вознаграждение, ПСЦ");
						//ДИТ, Беляев СЮ, Ticket#0349484 , 19-04-2024, конец
						ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ВремДоход);
						СтрокиУчетныхЕдиниц = ТемпВремТабДоходы.НайтиСтроки(ПараметрыПоиска);
						Инд = 0;
						Для каждого СтрокаУЕ Из СтрокиУчетныхЕдиниц Цикл
							Если Инд = 0 Тогда
								//перенесем первый гуид в новую строку
								ВремДоход.ГУИД = СтрокаУЕ.ГУИД;
								//и коносамент, чтобы документы разделялись
								Если СтрокаУЕ.Услуга = УслугаТЭУ 
									И НЕ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.КомплекснаяСтавкаНесколькимиСтроками 
									И НЕ ((ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт2Строки 
									ИЛИ ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
									И (ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоКоносаментам
									ИЛИ ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)) Тогда
									ВремДоход.Коносамент = Документы.ТранспортныйДокумент.ПустаяСсылка();
								Иначе
									ВремДоход.Коносамент = ТаблицаКоносаменты.Найти(СтрокаУЕ.ГУИД, "ГУИД").Коносамент;
								КонецЕсли; 
								ВремДоход.СписокВагонов = "";
								ВремДоход.СписокКТК = "";
								ВремДоход.СписокТД = "";
							Иначе
								//удалим лишние ГУИД
								СтрокиСвязи = СделкаОбъект.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы", СтрокаУЕ.ГУИД));
								Для каждого СтрокаСвязи Из СтрокиСвязи Цикл
									СтрокаСвязи.Доходы = ВремДоход.ГУИД;
								КонецЦикла; 
							КонецЕсли; 
							ВремДоход.СписокВагонов = ВремДоход.СписокВагонов + ?(ЗначениеЗаполнено(ВремДоход.СписокВагонов),";","") + СтрокаУЕ.СписокВагонов;
							ВремДоход.СписокКТК = ВремДоход.СписокКТК + ?(ЗначениеЗаполнено(ВремДоход.СписокКТК),";","") +СтрокаУЕ.СписокКТК;
							ВремДоход.СписокТД = ВремДоход.СписокТД + ?(ЗначениеЗаполнено(ВремДоход.СписокТД),";","") + СтрокаУЕ.СписокТД;
							Инд = Инд + 1;
						КонецЦикла;
					КонецЦикла;
				ИначеЕсли ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки 
					//17.12 для общего счета коносаменты не нужны
					И НЕ ПараметрыФФД.СобратьГруппировкиВОдинСчет
					//19.12 для группировки по датам аналогично
					//21.12 группировки и по датам и по направлениям
					//И НЕ ПараметрыФФД.ГруппироватьВыставляемыеРеализацииПосуточно
					Тогда
					Для каждого СтрокаДоход Из ВремТабДоходы Цикл
						Если ЗначениеЗаполнено(СтрокаДоход.ПунктОтправления) 
							И ЗначениеЗаполнено(СтрокаДоход.ПунктНазначения) Тогда   
							СтруктураПоиска = Новый Структура("ПунктНазначения, ПунктОтправления", СтрокаДоход.ПунктНазначения, СтрокаДоход.ПунктОтправления);
							СтрокиКоносаментов = ТаблицаНаправленияКоносаментов.НайтиСтроки(СтруктураПоиска);
							Если СтрокиКоносаментов.Количество() > 0 Тогда
								СтрокаДоход.Коносамент = СтрокиКоносаментов[0].Коносамент;
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		
		//Теперь перенесем всё в итоговую таблицу
		Для каждого СтрокаВремТабДоход Из ВремТабДоходы Цикл
			СтрокаДоход = СделкаОбъект.Доходы.Добавить();  
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			СтрокаДоход.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			ЗаполнитьЗначенияСвойств(СтрокаДоход, СтрокаВремТабДоход);
			ДобавитьВагонВДоходы(СделкаОбъект, СтрокаВремТабДоход.ГУИД, СтрокаВремТабДоход.СписокВагонов);
			ДобавитьКТКВДоходы(СделкаОбъект, СтрокаВремТабДоход.ГУИД, СтрокаВремТабДоход.СписокКТК);
			ДобавитьТДВДоходы(СделкаОбъект, СтрокаВремТабДоход.ГУИД, СтрокаВремТабДоход.СписокТД);
		КонецЦикла; 
		#КонецОбласти	
		
	КонецЦикла;//договоры
	
	ВключитьВДоходыУслугиНевключенныеВСтавку(СделкаОбъект, СписокГотовыхКОформлениюДоговоров, СписокРеестров);
	
	Для каждого ТекД Из СделкаОбъект.Доходы Цикл
		ТекД.Ставка 				= ТекД.Себестоимость + ТекД.Вознаграждение;
		ТекД.Рентабельность 		= ТекД.Вознаграждение / ?(ТекД.Ставка = 0, 1, ТекД.Ставка);
		
		ТекД.СебестоимостьИтого 	= ТекД.Количество * ТекД.Себестоимость;
		ТекД.ВознаграждениеИтого 	= ТекД.Количество * ТекД.Вознаграждение;
		ТекД.СтавкаИтого 			= ТекД.Количество * ТекД.Ставка;
		
		ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
		
		ТекД.СуммаИтого = ТекД.СтавкаИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
	КонецЦикла;
	
	//Удалим помеченные на удаление строки в составе поезда и снимем признаки изменена
	найдСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Удалена",Истина));
	Для каждого найдСтрока Из найдСтроки Цикл
		найдСтрокиДоговор = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Договор", найдСтрока.Договор));
		Для каждого найдСтрокаДоговор Из найдСтрокиДоговор Цикл
			найдСтрокаДоговор.ДокументыСформированы = Ложь;
		КонецЦикла; 
		СделкаОбъект.СвязьУчетныхЕдиниц.Удалить(найдСтрока);
	КонецЦикла; 
	найдСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Изменена",Истина));
	Для каждого найдСтрока Из найдСтроки Цикл
		найдСтрокиДоговор = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Договор", найдСтрока.Договор));
		Для каждого найдСтрокаДоговор Из найдСтрокиДоговор Цикл
			найдСтрокаДоговор.ДокументыСформированы = Ложь;
		КонецЦикла; 
		найдСтрока.Изменена = Ложь;
	КонецЦикла;
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, начало
Функция ПолучитьТаблицуСвязейУчетныхЕдиницПоОтбору(ТаблицаСвязейУчетныхЕдиниц, ПараметрыОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСвязейУчетныхЕдиниц.Клиент КАК Клиент,
		|	ТаблицаСвязейУчетныхЕдиниц.Договор КАК Договор,
		|	ТаблицаСвязейУчетныхЕдиниц.Калькуляция КАК Калькуляция,
		|	ТаблицаСвязейУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
		|	ТаблицаСвязейУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
		|	ТаблицаСвязейУчетныхЕдиниц.МесяцОказанияУслуги КАК МесяцОказанияУслуги,
		|	ТаблицаСвязейУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	ТаблицаСвязейУчетныхЕдиниц.Коносамент КАК Коносамент,
		|	ТаблицаСвязейУчетныхЕдиниц.ЖДН КАК ЖДН,
		|	ТаблицаСвязейУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	ТаблицаСвязейУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	ТаблицаСвязейУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
		|	ТаблицаСвязейУчетныхЕдиниц.Вагон КАК Вагон,
		|	ТаблицаСвязейУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		|	,ТаблицаСвязейУчетныхЕдиниц.Протокол КАК Протокол
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		|ПОМЕСТИТЬ ВТ_ТаблицаСвязейУчетныхЕдиниц
		|ИЗ
		|	&ТаблицаСвязейУчетныхЕдиниц КАК ТаблицаСвязейУчетныхЕдиниц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Договор КАК Договор,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Калькуляция КАК Калькуляция,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.МесяцОказанияУслуги КАК МесяцОказанияУслуги,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Коносамент КАК Коносамент,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.ЖДН КАК ЖДН,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Вагон КАК Вагон,
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		|	,ВТ_ТаблицаСвязейУчетныхЕдиниц.Протокол КАК Протокол
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
		|ИЗ
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц КАК ВТ_ТаблицаСвязейУчетныхЕдиниц
		|ГДЕ
		|	ВТ_ТаблицаСвязейУчетныхЕдиниц.Клиент = &Клиент
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.Договор = &Договор
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.Калькуляция = &Калькуляция
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.РазмерКТК = &РазмерКТК
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.ГотовоКВыставлению = &ГотовоКВыставлению
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.МесяцОказанияУслуги = &МесяцОказанияУслуги
		|	И (ВТ_ТаблицаСвязейУчетныхЕдиниц.ВидТранспортногоСообщения = &ВидТранспортногоСообщения
		|			ИЛИ ВТ_ТаблицаСвязейУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.Коносамент = &Коносамент
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
		|	И ВТ_ТаблицаСвязейУчетныхЕдиниц.Протокол = &Протокол";
		//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
	Запрос.УстановитьПараметр("ТаблицаСвязейУчетныхЕдиниц", ТаблицаСвязейУчетныхЕдиниц); 
	//обязательные поля в отборе
	Запрос.УстановитьПараметр("Клиент", ПараметрыОтбора.Клиент);
	Запрос.УстановитьПараметр("Договор", ПараметрыОтбора.Договор);
	Запрос.УстановитьПараметр("Калькуляция", ПараметрыОтбора.Калькуляция);
	//Евросиб - АСуслов 17.01.2023 12:27:21 #61165
	//(
	Если ПараметрыОтбора.Свойство("РазмерКТК") Тогда
		Запрос.УстановитьПараметр("РазмерКТК", ПараметрыОтбора.РазмерКТК);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВТ_ТаблицаСвязейУчетныхЕдиниц.РазмерКТК = &РазмерКТК", "");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.01.2023 12:27:23 #61165
	Запрос.УстановитьПараметр("ГотовоКВыставлению", ПараметрыОтбора.ГотовоКВыставлению);
	Запрос.УстановитьПараметр("МесяцОказанияУслуги", ПараметрыОтбора.МесяцОказанияУслуги);
	Запрос.УстановитьПараметр("ВидТранспортногоСообщения", ПараметрыОтбора.ВидТранспортногоСообщения);
	//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, начало
	Запрос.УстановитьПараметр("Протокол", ПараметрыОтбора.ПСЦ);
	//ДИТ, Беляев СЮ, BUG 83249, 16-04-2024, конец
	//дополнительные поля, если заполнены
	Если ПараметрыОтбора.Свойство("Коносамент") Тогда
		Запрос.УстановитьПараметр("Коносамент", ПараметрыОтбора.Коносамент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ТаблицаСвязейУчетныхЕдиниц.Коносамент = &Коносамент", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0288491, 10-10-2022, конец

Функция ПолучитьСвязиПоОсновнымУслугам(СделкаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.НомерСтроки КАК НомерСтроки,
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов  
	//ДИТ, Беляев СЮ, Ticket#0272761, 24-05-2022, начало
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    //ДИТ, Беляев СЮ, Ticket#0272761, 24-05-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.УслугаВнеСтавки = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Доходы В
	|			(ВЫБРАТЬ
	|				т.ГУИД
	|			ИЗ
	|				ВТ_Доходы КАК т)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&Доходы");
	Запрос.УстановитьПараметр("Доходы", СделкаОбъект.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить());
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМассивКонтейнеровПоРеестру(Объект, СписокРеестров) 
	
	Если Не ЗначениеЗаполнено(СписокРеестров) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка В(&СписокЗаявок)
	|	И ЗаявкаСоставУслуги.РеестрКлиента В(&РеестрКлиента)";
	Запрос.УстановитьПараметр("СписокЗаявок", Объект.СвязьУчетныхЕдиниц.Выгрузить(,"Заявка"));
	Запрос.УстановитьПараметр("РеестрКлиента", СписокРеестров);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контейнер");
		
КонецФункции

//Евросиб Каблов 11.01.2024 ( #78949
//Процедура ВключитьВДоходыУслугиНевключенныеВСтавку(Объект, СписокГотовыхКОформлениюДоговоров, СписокРеестров = Неопределено) Экспорт
Процедура ВключитьВДоходыУслугиНевключенныеВСтавку(Объект, СписокГотовыхКОформлениюДоговоров = Неопределено, СписокРеестров = Неопределено, ТаблицаДобавляемыхУслугВнеСтавки = Неопределено, ДопПараметры = Неопределено) Экспорт
//Евросиб Каблов 11.01.2024 )

	
	// SIV 04-01-2021 коллеги, добавил в запрос поле "Основание для выставления"
	// Оно необходимо в кейсе, когда в доходы включаются строки на основании пункта договора или отдельного ПСЦ
	// Но при этом доп услуга закладывается не в отдельной калькуляции, а в основной
	// Это сокращает ручной труд. ПСЦ в ТЧ Доходы нужен для аудита.

	//55052 исправлен запрос, убран выбор по ктк
	Запрос = Новый Запрос;
	
	//Евросиб Каблов 11.01.2024 ( #78949
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	//|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	//|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	//|ПОМЕСТИТЬ ВТ_СУЕ_Услуги
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	//|		ПО СделкаСвязьУчетныхЕдиниц.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	//|	И СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению
	////Евросиб - АСуслов 31.01.2023 15:26:00 #64514
	////(
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	////)
	////Евросиб - АСуслов 31.01.2023 15:26:01 #64514
	////ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
	//|	И СделкаСвязьУчетныхЕдиниц.Договор В(&Договор)
	////ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
	//
	////Евросиб Каблов 11.01.2024 ( #78949
	//|	И СделкаСвязьУчетныхЕдиниц.Контейнер = &Контейнер
	//|	И СделкаСвязьУчетныхЕдиниц.Вагон = &Вагон
	//|	И КалькуляцияЖД_УслугиВнеСтавки.Услуга = &Услуга
	////Евросиб Каблов 11.01.2024 )
	//|;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если ТаблицаДобавляемыхУслугВнеСтавки <> Неопределено Тогда
		Запрос.УстановитьПараметр("ТаблицаДобавляемыхУслугВнеСтавки", ТаблицаДобавляемыхУслугВнеСтавки);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДобавляемыхУслугВнеСтавки.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	ТаблицаДобавляемыхУслугВнеСтавки.Услуга КАК Услуга
		|ПОМЕСТИТЬ ТаблицаДобавляемыхУслуг
		|ИЗ
		|	&ТаблицаДобавляемыхУслугВнеСтавки КАК ТаблицаДобавляемыхУслугВнеСтавки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	ТаблицаДобавляемыхУслуг.Услуга КАК Услуга,
		|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
		|ПОМЕСТИТЬ УслугиИСвязьУчетныхЕдиниц
		|ИЗ
		|	ТаблицаДобавляемыхУслуг КАК ТаблицаДобавляемыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ПО ТаблицаДобавляемыхУслуг.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
		//Евросиб Каблов 06.03.2024 ( #81885
		//|	И СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению
		//Евросиб Каблов 06.03.2024 )
		|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УслугиИСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
		|	УслугиИСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
		|	УслугиИСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
		|ПОМЕСТИТЬ ВТ_СУЕ_Услуги
		|ИЗ
		|	УслугиИСвязьУчетныхЕдиниц КАК УслугиИСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
		|		ПО УслугиИСвязьУчетныхЕдиниц.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
		|			И УслугиИСвязьУчетныхЕдиниц.Услуга = КалькуляцияЖД_УслугиВнеСтавки.Услуга";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
		|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
		|ПОМЕСТИТЬ ВТ_СУЕ_Услуги
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
		|		ПО СделкаСвязьУчетныхЕдиниц.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
		|	И СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению
		|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
		|	И СделкаСвязьУчетныхЕдиниц.Договор В(&Договор)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|;
	|";
	
	Запрос.Текст = Запрос.Текст + "
	//Евросиб Каблов 11.01.2024 )
	|ВЫБРАТЬ
	|	ВТ_СУЕ_Услуги.ГУИД КАК ГУИД,
	|	ВТ_СУЕ_Услуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СУЕ_УслугиПоЗаявке
	|ИЗ
	|	ВТ_СУЕ_Услуги КАК ВТ_СУЕ_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СУЕ_Услуги КАК ВТ_СУЕ_Услуги1
	|		ПО ВТ_СУЕ_Услуги.ГУИДСтрокиЗаявки = ВТ_СУЕ_Услуги1.ГУИДСтрокиЗаявки
	|			И (ВТ_СУЕ_Услуги1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	|ГДЕ
	|	(ВТ_СУЕ_Услуги.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|			ИЛИ ВТ_СУЕ_Услуги.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ИЛИ ВТ_СУЕ_Услуги1.ГУИД ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|ГДЕ
	|	НЕ СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СУЕ_УслугиПоЗаявке.ГУИД КАК ГУИД,
	|	ВТ_СУЕ_УслугиПоЗаявке.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Отбор_ГУИДы
	|ИЗ
	|	ВТ_СУЕ_УслугиПоЗаявке КАК ВТ_СУЕ_УслугиПоЗаявке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО ВТ_СУЕ_УслугиПоЗаявке.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			И ВТ_СУЕ_УслугиПоЗаявке.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	//Евросиб Каблов 06.01.2024 ( #78949
	//|ГДЕ
	//|	(СделкаСвязьДоходовИРасходов.Доходы ЕСТЬ NULL
	//|			ИЛИ СделкаСвязьДоходовИРасходов.Доходы = """")
	|			И СделкаСвязьДоходовИРасходов.Доходы <> """"
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Доходы ЕСТЬ NULL
	//Евросиб Каблов 06.01.2024 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	//|	СУММА(1) КАК Количество,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ФФД.СуммироватьСтроки, ЛОЖЬ) = ИСТИНА
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Груз
	//|	КОНЕЦ КАК Груз,
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
	|	1 КАК Количество,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
	//|	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ КАК ПСЦ,
	//ДИТ, Беляев СЮ, Ticket#0332239, 27-11-2023, начало
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ,
	//ДИТ, Беляев СЮ, Ticket#0332239, 27-11-2023, конец
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаСвязьУчетныхЕдиниц.Протокол.РазрешенПересчетСтавкиУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	//Евросиб - АСуслов 31.01.2023 14:26:52 #64514
	//(
	//|	ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	|	ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) ИЛИ ЕСТЬNULL(ФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно, ЛОЖЬ) КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	//)
	//Евросиб - АСуслов 31.01.2023 14:26:53 #64514
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	ЕСТЬNULL(ФФД.СуммироватьСтроки, ЛОЖЬ) КАК СуммироватьСтроки,
	//|	ВЫБОР
	////Евросиб - АСуслов 31.01.2023 14:30:47 #64514
	////(
	////|		КОГДА ЕСТЬNULL(ФФД.ФормироватьСтрокиДоку0ментовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) = ИСТИНА
	//|		КОГДА ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) ИЛИ ЕСТЬNULL(ФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно, ЛОЖЬ)
	////)
	////Евросиб - АСуслов 31.01.2023 14:30:48 #64514
	//|			ТОГДА СделкаСвязьУчетныхЕдиниц.ГУИД
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ГУИД
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.НомерТранспортногоДокумента КАК СписокТД,
	|	СделкаСвязьУчетныхЕдиниц.Вагон.Наименование КАК СписокВагонов,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК СписокКТК
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
	|ПОМЕСТИТЬ ВТ_Отбор
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФФД
	|		ПО СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки = ФФД.ВидПеревозки
	|			И СделкаСвязьУчетныхЕдиниц.Калькуляция.Контрагент = ФФД.Контрагент
	|			И СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки = ФФД.ПравилоДляПовагонныхОтправок
	|			И (НЕ ФФД.ПометкаУдаления)
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И СделкаСвязьУчетныхЕдиниц.ГУИД В
	|			(ВЫБРАТЬ
	|				ВТ_Отбор_ГУИДы.ГУИД КАК ГУИД
	|			ИЗ
	|				ВТ_Отбор_ГУИДы КАК ВТ_Отбор_ГУИДы)
	|	И ВЫБОР
	|			КОГДА &ЕстьРеестры
	|				ТОГДА СделкаСвязьУчетныхЕдиниц.Контейнер В (&СписокКонтейнеровПоРеестру)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	//|СГРУППИРОВАТЬ ПО   //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал группировку, смысла нет, т.к. теперь ГУИД СП не убирается
	//|	СделкаСвязьУчетныхЕдиниц.Клиент,
	//|	СделкаСвязьУчетныхЕдиниц.Договор,
	//|	СделкаСвязьУчетныхЕдиниц.Калькуляция,
	//|	СделкаСвязьУчетныхЕдиниц.РазмерКТК,
	//|	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ,
	////Евросиб - АСуслов 31.01.2023 14:27:36 #64514
	////(
	////|	ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ),
	//|   ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) ИЛИ ЕСТЬNULL(ФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно, ЛОЖЬ),
	////)
	////Евросиб - АСуслов 31.01.2023 14:27:37 #64514
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ФФД.СуммироватьСтроки, ЛОЖЬ) = ИСТИНА
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Груз
	//|	КОНЕЦ,
	//|	ФФД.СуммироватьСтроки,
	//|	ВЫБОР
	////|		КОГДА ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) = ИСТИНА
	//|		КОГДА ЕСТЬNULL(ФФД.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) ИЛИ ЕСТЬNULL(ФФД.РазделятьДокументыНаКаждыйКонтейнерОтдельно, ЛОЖЬ)
	//|			ТОГДА СделкаСвязьУчетныхЕдиниц.ГУИД
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	|	ВТ_Отбор.Клиент КАК Клиент,
	|	ВТ_Отбор.Договор КАК ДоговорКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка КАК Калькуляция,
	//Евросиб Каблов 11.01.2024 ( #78949
	//|	ИСТИНА КАК НеВыставлятьКлиенту,
	//|	&НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	//Евросиб Каблов 11.01.2024 )
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало (вернул по умолчанию включено, отключать будем в коде ниже, только по связанным доход - расход
	|	ИСТИНА КАК НеВыставлятьКлиенту,
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
	|	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки КАК ТипСтавки,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Перевыставляемая,
	|	КалькуляцияЖД_УслугиВнеСтавки.Поставщик КАК Поставщик,
	|	КалькуляцияЖД_УслугиВнеСтавки.Договор КАК ДоговорПоставщика,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС КАК НДСВключенВСтоимость,
	|	КалькуляцияЖД_УслугиВнеСтавки.Валюта КАК Валюта,                       
	//Евросиб - АСуслов 14.08.2023 11:17:16 #71410
	//(
	|   КалькуляцияЖД_УслугиВнеСтавки.ИдентификаторСтроки КАК СтрокаКалькуляции,
	//)
	//Евросиб - АСуслов 14.08.2023 11:17:21 #71410
	|	ВТ_Отбор.Количество КАК Количество,
	|	ВТ_Отбор.РазмерКТК КАК РазмерКТК,
	|	ВТ_Отбор.Груз КАК Груз,
	|	ВТ_Отбор.ПСЦ КАК ПСЦ,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	ВТ_Отбор.ПересчитатьСтавкуУслугиВСчетНДС22 КАК ПересчитатьСтавкуУслугиВСчетНДС22,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	КалькуляцияЖД_УслугиВнеСтавки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ИСТИНА КАК УслугаВнеСтавки,
	|	ВТ_Отбор.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	|	ВТ_Отбор.Контейнер КАК Контейнер,
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ОснованиеДляВыставления КАК ОснованиеДляВыставления,
	|	ВТ_Отбор.СуммироватьСтроки КАК СуммироватьСтроки,
	|	ВТ_Отбор.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 01.09.2023 11:29:16 #71410
	//(
	|	Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики
	//)
	//Евросиб - АСуслов 01.09.2023 11:29:23 #71410
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
	|	,ВТ_Отбор.СписокВагонов КАК СписокВагонов
	|	,ВТ_Отбор.СписокКТК КАК СписокКТК
	|	,ВТ_Отбор.СписокТД КАК СписокТД
	//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
	//|ПОМЕСТИТЬ ВТ //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал
	|ИЗ
	|	ВТ_Отбор КАК ВТ_Отбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|		ПО ВТ_Отбор.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка";
	//|ГДЕ   //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал
	//|	ВТ_Отбор.Договор В(&Договор)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ     //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал
	//|	ВТ.Услуга КАК Услуга,
	//|	ВТ.Клиент КАК Клиент,
	//|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	//|	ВТ.Себестоимость КАК Себестоимость,
	//|	ВТ.Вознаграждение КАК Вознаграждение,
	//|	ВТ.Калькуляция КАК Калькуляция,
	//|	ВТ.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	//|	ВТ.ТипСтавки КАК ТипСтавки,
	//|	ВТ.Перевыставляемая КАК Перевыставляемая,
	//|	ВТ.Поставщик КАК Поставщик,
	//|	ВТ.ДоговорПоставщика КАК ДоговорПоставщика,
	//|	ВТ.ПроцентВознаграждения КАК ПроцентВознаграждения,
	//|	ВТ.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	//|	ВТ.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	//|	ВТ.СтавкаНДС КАК СтавкаНДС,
	//|	ВТ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	//|	ВТ.Валюта КАК Валюта,
	//|	ВТ.Количество КАК Количество,
	//|	ВТ.РазмерКТК КАК РазмерКТК,
	//|	ВТ.Груз КАК Груз,
	//|	ВТ.ПСЦ КАК ПСЦ,
	//|	ВТ.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	//|	ВТ.УслугаВнеСтавки КАК УслугаВнеСтавки,
	//|	ВТ.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	//|	ВТ.Контейнер КАК Контейнер,
	//|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТ.ОснованиеДляВыставления КАК ОснованиеДляВыставления,
	//|	ВТ.СуммироватьСтроки КАК СуммироватьСтроки,
	//|	ВТ.ГУИД КАК ГУИД
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|		ПО ВТ.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	//|			И ВТ.Услуга = СделкаСвязьДоходовИРасходов.Услуга";
	//|ГДЕ 
	//|	(СделкаСвязьДоходовИРасходов.Доходы ЕСТЬ NULL
	//|			ИЛИ СделкаСвязьДоходовИРасходов.Доходы = """")";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//Евросиб Каблов 06.01.2024 ( #78949
	//Запрос.УстановитьПараметр("Договор", СписокГотовыхКОформлениюДоговоров.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор"));
	Запрос.УстановитьПараметр("Договор", СписокГотовыхКОформлениюДоговоров);
	
	НеВыставлятьКлиенту = Неопределено;
	Если Не ДопПараметры.Свойство("НеВыставлятьКлиенту", НеВыставлятьКлиенту) Тогда
		НеВыставлятьКлиенту = Истина;
	КонецЕсли;
	Запрос.УстановитьПараметр("НеВыставлятьКлиенту", НеВыставлятьКлиенту);
	//Евросиб Каблов 06.01.2024 )
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", Объект.СвязьДоходовИРасходов.Выгрузить());
	
	Запрос.УстановитьПараметр("ЕстьРеестры", ЗначениеЗаполнено(СписокРеестров));
	Запрос.УстановитьПараметр("СписокКонтейнеровПоРеестру", ПолучитьМассивКонтейнеровПоРеестру(Объект, СписокРеестров));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
			
	Пока Выборка.Следующий() Цикл
		
		нСтрокаДоход = Объект.Доходы.Добавить();
		//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
		нСтрокаДоход.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
		//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
		ЗаполнитьЗначенияСвойств(нСтрокаДоход, Выборка);
		нСтрокаДоход.Договор = Выборка.ДоговорКлиента;
		нСтрокаДоход.ГУИД = Строка(Новый УникальныйИдентификатор);
		//Списки = ПолучитьСпискиУЕиТД(Выборка, нСтрокаДоход.ГУИД, Объект); //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал
		//Евросиб - АСуслов 31.01.2023 17:29:49 #64514
		//(
		Если Выборка.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно Тогда
			//нСтрокаДоход.РеестрКлиента = Списки.СписокКТК;		
			//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало (внедрение допустимо только совместно/после #64514)
			нСтрокаДоход.РеестрКлиента = Выборка.СписокКТК;
			//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
		КонецЕсли;
		//)
		//Евросиб - АСуслов 31.01.2023 17:29:51 #64514
		//нСтрокаДоход.СписокВагонов = Списки.СписокВагонов;
		//нСтрокаДоход.СписокКТК = Списки.СписокКТК;
		//нСтрокаДоход.СписокТД = Списки.СписокТД;
		//нСтрокаДоходыВагоны = Объект.ДоходыВагоны.Добавить();
		//нСтрокаДоходыВагоны.ГУИД = нСтрокаДоход.ГУИД;
		//нСтрокаДоходыВагоны.Вагон = Списки.СписокВагонов;
		//ДобавитьВагонВДоходы(Объект, нСтрокаДоход.ГУИД, Списки.СписокВагонов);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
		ДобавитьВагонВДоходы(Объект, нСтрокаДоход.ГУИД, Выборка.СписокВагонов);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец

		//нСтрокаДоходыКТК = Объект.ДоходыКТК.Добавить();
		//нСтрокаДоходыКТК.ГУИД = нСтрокаДоход.ГУИД;
		//нСтрокаДоходыКТК.КТК = Списки.СписокКТК;
		//ДобавитьКТКВДоходы(Объект, нСтрокаДоход.ГУИД, Списки.СписокКТК);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
		ДобавитьКТКВДоходы(Объект, нСтрокаДоход.ГУИД, Выборка.СписокКТК);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец

		//нСтрокаДоходыТД = Объект.ДоходыТД.Добавить();
		//нСтрокаДоходыТД.ГУИД = нСтрокаДоход.ГУИД;
		//нСтрокаДоходыТД.ТД = Списки.СписокТД;
		//ДобавитьТДВДоходы(Объект, нСтрокаДоход.ГУИД, Списки.СписокТД);
		//ЗаполнитьЗначенияСвойств(нСтрокаДоход, Списки);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
		ДобавитьТДВДоходы(Объект, нСтрокаДоход.ГУИД, Выборка.СписокТД);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец

		//нСтрокаДоход.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Объект.ТипЗаказа, Списки.СписокВагонов);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
		нСтрокаДоход.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Объект.ТипЗаказа, Выборка.СписокВагонов);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
		
		Если ТипЗнч(СписокРеестров) = Тип("Массив") И СписокРеестров.Количество() > 0 Тогда
			нСтрокаДоход.РеестрКлиента = СписокРеестров[0];
		КонецЕсли;
		
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, начало
		//Документы.Сделка.СвязатьДоходыРасходыСУЕ(Объект, нСтрокаДоход.ГУИД,,Выборка.ГУИД, Выборка.Услуга,,нСтрокаДоход.СтрокаКалькуляции);
		//ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, конец
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
		ГУИДРасхода = Неопределено;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
		
		//Евросиб Каблов 11.01.2024 ( #78949
		РаботаСоСделкамиСервер.ОбработатьСтрокуДоходов(нСтрокаДоход);
		//Евросиб Каблов 11.01.2024 )
		
		//Евросиб Каблов 05.06.2024 ( #78949
		Если ТаблицаДобавляемыхУслугВнеСтавки <> Неопределено Тогда
			//НайденныеСтроки = ТаблицаДобавляемыхУслугВнеСтавки.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Услуга", Выборка.ГУИД, Выборка.Услуга));
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
			НайденныеСтроки = ТаблицаДобавляемыхУслугВнеСтавки.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Услуга, Доходы", Выборка.ГУИД, Выборка.Услуга, ""));
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				НайденныеСтроки[0].Доходы = нСтрокаДоход.ГУИД;
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
				нСтрокаДоход.НеВыставлятьКлиенту = Ложь;
				ГУИДРасхода = НайденныеСтроки[0].Расходы;
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 05.06.2024 )
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, начало
		Документы.Сделка.СвязатьДоходыРасходыСУЕ(Объект, нСтрокаДоход.ГУИД,ГУИДРасхода,Выборка.ГУИД, Выборка.Услуга,,нСтрокаДоход.СтрокаКалькуляции);
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366378, 18-09-2024, конец
			
		//Если Выборка.ТипСтавки = Перечисления.ТипыСтавокПротокола.ВРиПроцент Тогда
		//	нСтрокаДоходВознаграждение = Объект.Доходы.Добавить();
		//	ЗаполнитьЗначенияСвойств(нСтрокаДоходВознаграждение, нСтрокаДоход);
		//	нСтрокаДоходВознаграждение.Перевыставляемая = Ложь;
		//	нСтрокаДоходВознаграждение.Услуга = Справочники.Номенклатура.Вознаграждение;
		//	нСтрокаДоходВознаграждение.Ставка = нСтрокаДоход.Вознаграждение;
		//	нСтрокаДоходВознаграждение.СтавкаИтого = нСтрокаДоходВознаграждение.Количество * нСтрокаДоходВознаграждение.Ставка;
		//	нСтрокаДоходВознаграждение.СтавкаНДС = нСтрокаДоход.СтавкаНДСВознаграждения;
		//	нСтрокаДоходВознаграждение.НДСВключенВСтоимость = нСтрокаДоходВознаграждение.ВознаграждениеВключаетНДС;
		//	нСтрокаДоходВознаграждение.ГУИД = Строка(Новый УникальныйИдентификатор);
		//	нСтрокаДоходВознаграждение.ГУИДСтрокиДохода = нСтрокаДоход.ГУИД;
		//КонецЕсли; 
		
		//нСтрокаРасход = Объект.Расходы.Добавить();
		//ЗаполнитьЗначенияСвойств(нСтрокаРасход, Выборка);
		//ЗаполнитьЗначенияСвойств(нСтрокаРасход, нСтрокаДоход, "СписокВагонов, СписокКТК, СписокТД, НоменклатурнаяГруппа");
		//нСтрокаРасход.НеВключатьВПлановыеРасходы = Истина;
		//нСтрокаРасход.Договор = Выборка.ДоговорПоставщика;
		//нСтрокаРасход.ГУИД = ИдентификаторРасходов;
		
		//нСтрокаСвязьДоходов = Объект.СвязьДоходовИРасходов.Добавить();
		//нСтрокаСвязьДоходов.Доходы = ИдентификаторДоходов;
		//нСтрокаСвязьДоходов.Расходы = ИдентификаторРасходов;
		//СвязатьДоходыРасходыСУЕ(ИдентификаторДоходов, ,Выборка.ГУИД, Выборка.Услуга);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДобавитьВагонВДоходы(Объект, ГУИДДоходов, СписокВагонов, Замещать = Истина)
	ПараметрыПоиска = Новый Структура("ГУИД", ГУИДДоходов);
	СтрокиВагоны = Объект.ДоходыВагоны.НайтиСтроки(ПараметрыПоиска);
	Если СтрокиВагоны.Количество() = 0 Тогда
		нСтрока = Объект.ДоходыВагоны.Добавить();
		нСтрока.ГУИД = ГУИДДоходов;
	Иначе
		нСтрока = СтрокиВагоны[0];
	КонецЕсли; 
	Если Замещать Тогда
		нСтрока.Вагон = СписокВагонов;
	Иначе
		нСтрока.Вагон = нСтрока.Вагон + ?(нСтрока.Вагон = "", "", ";") + СписокВагонов; 
	КонецЕсли;
КонецПроцедуры

// Евросиб Фролов (15.12.2021 Ticket№ 0244435, добавил Экспорт
Процедура ДобавитьКТКВДоходы(Объект, ГУИДДоходов, СписокКТК, Замещать = Истина) Экспорт
	ПараметрыПоиска = Новый Структура("ГУИД", ГУИДДоходов);
	СтрокиКТК = Объект.ДоходыКТК.НайтиСтроки(ПараметрыПоиска);
	Если СтрокиКТК.Количество() = 0 Тогда
		нСтрока = Объект.ДоходыКТК.Добавить();
		нСтрока.ГУИД = ГУИДДоходов;
	Иначе
		нСтрока = СтрокиКТК[0];
	КонецЕсли; 
	Если Замещать Тогда
		нСтрока.КТК = СписокКТК;
	Иначе
		нСтрока.КТК = нСтрока.КТК + ?(нСтрока.КТК = "", "", ";") + СписокКТК; 
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьТДВДоходы(Объект, ГУИДДоходов, СписокТД, Замещать = Истина)
	ПараметрыПоиска = Новый Структура("ГУИД", ГУИДДоходов);
	СтрокиТД = Объект.ДоходыТД.НайтиСтроки(ПараметрыПоиска);
	Если СтрокиТД.Количество() = 0 Тогда
		нСтрока = Объект.ДоходыТД.Добавить();
		нСтрока.ГУИД = ГУИДДоходов;
	Иначе
		нСтрока = СтрокиТД[0];
	КонецЕсли; 
	Если Замещать Тогда
		нСтрока.ТД = СписокТД;
	Иначе
		нСтрока.ТД = нСтрока.ТД + ?(нСтрока.ТД = "", "", ";") + СписокТД; 
	КонецЕсли;
КонецПроцедуры

//Функция ПолучитьСпискиУЕиТД(СтрокаПараметры, ГУИДДоходы, Объект) //ДИТ, Беляев СЮ, BUG 68322/TASK 68961, 18-04-2023, закомментировал
//	ПараметрПоиска = Новый Структура("Клиент, Договор, РазмерКТК, Груз, Калькуляция");
//	//ПараметрПоиска = Новый Структура("Клиент, Договор, РазмерКТК, Калькуляция");
//	//ПараметрПоиска = Новый Структура("Клиент, Договор, РазмерКТК, Калькуляция");
//	//Евросиб - АСуслов 29.07.2022 17:46:53 #55052
//	//(
//	//Если СтрокаПараметры.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно Тогда
//		ПараметрПоиска.Вставить("Контейнер");
//	//КонецЕсли; 
//	//)
//	//Евросиб - АСуслов 29.07.2022 17:47:06 #55052
//	Если СтрокаПараметры.СуммироватьСтроки Тогда
//		ПараметрПоиска.Удалить("Груз");
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(ПараметрПоиска, СтрокаПараметры);
//	ПараметрПоиска.Договор = СтрокаПараметры.ДоговорКлиента;
//	СписокВагонов = "";
//	СписокКТК = "";
//	СписокТД = "";
//	Для каждого СтрокаСУЕ Из Объект.СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрПоиска) Цикл
//		СписокВагонов = СписокВагонов + ?(ЗначениеЗаполнено(СписокВагонов),";","") + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.Вагон, "Наименование");
//		СписокКТК = СписокКТК + ?(ЗначениеЗаполнено(СписокКТК),";","") + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.Контейнер, "Наименование");
//		СписокТД = СписокТД + ?(ЗначениеЗаполнено(СписокТД),";","") + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.ЖДН, "НомерТранспортногоДокумента");
//		Документы.Сделка.СвязатьДоходыРасходыСУЕ(Объект, ГУИДДоходы,,СтрокаСУЕ.ГУИД, СтрокаПараметры.Услуга);
//	КонецЦикла;
//	Возврат Новый Структура("СписокВагонов, СписокКТК, СписокТД", СписокВагонов, СписокКТК, СписокТД);
//КонецФункции

Процедура ЗаполнитьДатыОказанияУслуги(ОбъектСделка, ТаблицаДоходов = Неопределено, ТаблицаРасходов = Неопределено, ТаблицаСвязейУчетныхЕдиниц = Неопределено, ТаблицаСвязейДоходовИРасходов = Неопределено) Экспорт
	
	Объект = ОбъектСделка;                    
	НеЗагружатьВТабличнуюЧасть = Истина;
	Если ТаблицаДоходов = Неопределено Тогда
		ТаблицаДоходов = ОбъектСделка.Доходы.Выгрузить();
		Если ТаблицаДоходов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		НеЗагружатьВТабличнуюЧасть = Ложь;
	КонецЕсли;
	Если ТаблицаРасходов = Неопределено Тогда
		ТаблицаРасходов = ОбъектСделка.Расходы.Выгрузить();
	КонецЕсли;
	Если ТаблицаСвязейУчетныхЕдиниц = Неопределено Тогда
		ТаблицаСвязейУчетныхЕдиниц = ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить();
		ТаблицаСвязейУчетныхЕдиниц.Колонки.Добавить("МесяцОказанияУслуги", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	КонецЕсли;
	Если ТаблицаСвязейДоходовИРасходов = Неопределено Тогда
		ТаблицаСвязейДоходовИРасходов = ОбъектСделка.СвязьДоходовИРасходов.Выгрузить();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.Клиент КАК Клиент,
	|	ВЫРАЗИТЬ(СделкаДоходы.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки,
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.ПериодВО КАК ПериодВО,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	ВЫРАЗИТЬ(СделкаДоходы.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК
	// Евросиб Фролов)
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	//Евросиб Каблов 09.09.2025 ( Ticket#0410000	
	//|	ВЫРАЗИТЬ(СделкаРасходы.УчДокумент КАК Документ.ПоступлениеТоваровУслуг) КАК УчДокумент,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	//Евросиб Каблов 09.09.2025 ) Ticket#0410000
	|	СделкаРасходы.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ЖДН КАК Документ.ТранспортныйДокумент) КАК ЖДН,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Заявка КАК Документ.Заявка) КАК Заявка,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.СчетЖД КАК Документ.СчетНаОплатуПокупателю) КАК СчетЖД,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.СчетФрахт КАК Документ.СчетНаОплатуПокупателю) КАК СчетФрахт,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Протокол КАК Документ.ПСЦ) КАК Протокол,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Клиент КАК Справочник.Контрагенты) КАК Клиент,
	|	ВЫРАЗИТЬ(&ПовагонныеОтправки КАК БУЛЕВО) КАК ПовагонныеОтправки,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ДатаФактическогоПредоставленияПС КАК Дата) КАК ДатаФактическогоПредоставленияПС,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	//Евросиб - АСуслов 30.09.2022 16:24:37 #тэуфрахт
	//(
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	//)
	//Евросиб - АСуслов 30.09.2022 16:24:39 #тэуфрахт
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц_Врем
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД, 
	//Евросиб - АСуслов 04.10.2022 17:53:42 #тэуфрахт
	//(
	|	ВЫБОР КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.Море) ТОГДА ВТ_СвязьучетныхЕдиниц_Врем.ЖДН ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН КОНЕЦ КАК ЖДН,
	//)
	//Евросиб - АСуслов 04.10.2022 17:53:47 #тэуфрахт
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД,
	|	СделкаСвязьУчетныхЕдиниц.СчетФрахт СчетФрахт,
	|	СделкаСвязьУчетныхЕдиниц.Протокол Протокол,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Клиент Клиент,
	|	СделкаСвязьУчетныхЕдиниц.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	СделкаСвязьУчетныхЕдиниц.ДатаФактическогоПредоставленияПС КАК ДатаФактическогоПредоставленияПС,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	// Евросиб Фролов)
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц_Врем КАК СделкаСвязьУчетныхЕдиниц
	|     	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьучетныхЕдиниц_Врем  КАК ВТ_СвязьучетныхЕдиниц_Врем
	|      		ПО СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ВТ_СвязьучетныхЕдиниц_Врем.ГУИДСтрокиЗаявки
	|  				И ВТ_СвязьучетныхЕдиниц_Врем.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.Код + СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.Код + СделкаСвязьУчетныхЕдиниц.Коносамент.ДоговорКонтрагента.Код КАК Направление,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаТранспортногоДокумента) КАК ДатаДокументаКоносаментаПоНаправлению,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления) КАК ДатаОтправленияКоносаментаПоНаправлению,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия) КАК ДатаПрибытияКоносаментаПоНаправлению
	|ПОМЕСТИТЬ ВТ_ДатыПоНаправлениям
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц

	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.Код + СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.Код + СделкаСвязьУчетныхЕдиниц.Коносамент.ДоговорКонтрагента.Код
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ВТ_СвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	ВТ_СвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	ВТ_СвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	ВТ_СвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД,
	|	ВТ_СвязьУчетныхЕдиниц.СчетФрахт КАК СчетФрахт,
	|	ВТ_СвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|   ВТ_СвязьУчетныхЕдиниц.ДатаФактическогоПредоставленияПС КАК ДатаФактическогоПредоставленияПС,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	ВТ_СвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	// Евросиб Фролов)
	//|	ВЫБОР
	//|		КОГДА ВТ_СвязьУчетныхЕдиниц.СчетЖД = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	//|			ТОГДА ФормированиеФинДокументов.Ссылка
	//|		ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.СчетЖД
	//|	КОНЕЦ КАК ПравилоФФД_ЖД,
	//|	ВЫБОР
	//|		КОГДА ВТ_СвязьУчетныхЕдиниц.СчетФрахт = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	//|			ТОГДА ФормированиеФинДокументов.Ссылка
	//|		ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.СчетФрахт
	//|	КОНЕЦ КАК ПравилоФФД_Фрахт,
	|	ФормированиеФинДокументов.Ссылка КАК ПравилоФФД_ЖД,
	|	ФормированиеФинДокументов.Ссылка КАК ПравилоФФД_Фрахт,
	|	ВТ_СвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.Код + ВТ_СвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.Код + ВТ_СвязьУчетныхЕдиниц.Коносамент.ДоговорКонтрагента.Код КАК ИдентификаторНаправления,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	ВТ_СвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	// Евросиб Фролов)
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	ВТ_СвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ПОМЕСТИТЬ ВТ_СУЕ_СПравилами
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки = ФормированиеФинДокументов.ВидПеревозки
	|			И ВТ_СвязьУчетныхЕдиниц.Калькуляция.Контрагент = ФормированиеФинДокументов.Контрагент
	|			И ВТ_СвязьУчетныхЕдиниц.ПовагонныеОтправки = ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|			И (НЕ ФормированиеФинДокументов.ПометкаУдаления)
	|;
	|
	//Евросиб Каблов 23.08.2023 ( #68187
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД,
	|	МАКСИМУМ(РасчетСНП.ФактическаяДатаОкончания) КАК ДатаЗавершенияСНП
	|ПОМЕСТИТЬ ДатыЗавершенияСНП
	|ИЗ
	|	ВТ_Доходы КАК ВТ_Доходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
	|		ПО ВТ_Доходы.ГУИД = РасчетСНП.ГУИДСтрокиДохода
	|ГДЕ
	|	РасчетСНП.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доходы.ГУИД
	|;
	|
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД,
	|	МАКСИМУМ(РасчетДопРасходы.ДатаОказанияУслуги) КАК ДатаОказанияУслуги
	|ПОМЕСТИТЬ ДатыОказанияУслугДопРасходов
	|ИЗ
	|	ВТ_Доходы КАК ВТ_Доходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетДополнительныеРасходы КАК РасчетДопРасходы
	|		ПО ВТ_Доходы.ГУИД = РасчетДопРасходы.ГУИДСтрокиДохода
	|ГДЕ
	|	РасчетДопРасходы.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доходы.ГУИД
	|;
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК ГУИД,
	|	МАКСИМУМ(РелизСобственникаНоминации.ДатаВозвратаСобственнику) КАК ДатаОказанияУслуги
	|ПОМЕСТИТЬ ДатыОказанияУслугДоплатИзРелиза
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО (ВТ_СвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда = РелизСобственникаНоминации.КлючАналитики.КлючАналитикиСоставаПоезда)
	|ГДЕ
	|	РелизСобственникаНоминации.допл_Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьДоходовИРасходов.Доходы
	|;
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.ПериодВО КАК ПериодВО,
	|	ФормированиеФинДокументовЖД.Документ КАК ПравилоФормирования,
	|	ВЫБОР
	|		КОГДА ФормированиеФинДокументовЖД.ИспользоватьРасширенныеПараметры
	|				И НЕ ФормированиеФинДокументовЖД.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаФормирования)
	|				И НЕ ФормированиеФинДокументовЖД.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОплаты)
	|			ТОГДА ВЫБОР
	|					КОГДА СделкаДоходы.Услуга = &Фрахт
	|							И НЕ ФормированиеФинДокументовФрахт.ДатаРеализацииФрахт = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ПустаяСсылка)
	|						ТОГДА ФормированиеФинДокументовФрахт.ДатаРеализацииФрахт
	|					ИНАЧЕ ФормированиеФинДокументовФрахт.ДатаРеализации
	|				КОНЕЦ
	|		КОГДА НЕ СделкаДоходы.Договор.ПравилоФормированияДатыУслуги = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПустаяСсылка)
	|			ТОГДА СделкаДоходы.Договор.ПравилоФормированияДатыУслуги
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаРеализации,
	|	ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза КАК ДатаПрибытияЖД,
	|	ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия КАК КоносаментДатаПрибытия,
	|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
	|	ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|		КОГДА СделкаДоходы.ДоплатныеКТК
	//Евросиб Каблов 12.02.2026 ( Ticket#0433414
	//|			ТОГДА ВЫБОР
	//|					КОГДА ВТ_СУЕ_СПравилами.УсловияПеревозкиНазначение = &DOOR
	//|						И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	//|					ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	////|				ИНАЧЕ ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	////Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 26-12-2024, начало
	//|					КОГДА НЕ ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза Есть NULL 
	//|						ТОГДА ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	//|					КОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1) 
	//|						ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	//|					ИНАЧЕ &ДатаОткрытогоПериода
	////Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 26-12-2024, конец
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	|					КОГДА НЕ ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза Есть NULL 
	|						ТОГДА ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	|					ИНАЧЕ &ДатаОткрытогоПериода
	//Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 2
	//Евросиб Каблов 12.02.2026 ) Ticket#0433414
	|			КОНЕЦ
	// Евросиб Фролов)
	|		КОГДА ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза >= ЕСТЬNULL(ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|				И ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза >= ЕСТЬNULL(ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	|		КОГДА ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия >= ЕСТЬNULL(ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза, ДАТАВРЕМЯ(1, 1, 1))
	|				И ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия >= ЕСТЬNULL(ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия
	|		КОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку >= ЕСТЬNULL(ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза, ДАТАВРЕМЯ(1, 1, 1))
	|				И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку >= ЕСТЬNULL(ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	|	КОНЕЦ КАК ДатаПрибытия,
	|   ВТ_СУЕ_СПравилами.ДатаФактическогоПредоставленияПС КАК ДатаФактическогоПредоставленияПС,
	|	ВТ_СУЕ_СПравилами.Коносамент.ДатаТранспортногоДокумента КАК ДатаКоносамента,
	|	ЕСТЬNULL(ВТ_СУЕ_СПравилами.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправленияЖД,
	|	ЕСТЬNULL(ВТ_СУЕ_СПравилами.Коносамент.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправленияКоносамент,
	|	ВТ_СУЕ_СПравилами.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза КАК ДатаРаскредитацииЖД,
	|	ВТ_СУЕ_СПравилами.Коносамент.ДатаПрибытия КАК ДатаПрибытияКоносамент,
	|	ВТ_СУЕ_СПравилами.ГУИД КАК ГУИДСУЕ,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	ВТ_СУЕ_СПравилами.КлючАналитикиСоставаПоезда,
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|	&ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	СделкаДоходы.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 29.12.2021 16:54:15 #
	//(
	|ВЫБОР
	|	КОГДА СделкаРасходы.УчДокумент.Ссылка ЕСТЬ NULL
	|			ИЛИ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|		ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|	ИНАЧЕ СделкаРасходы.УчДокумент.ДатаВходящегоДокумента
	|КОНЕЦ КАК ДатаВходящегоДокументаПодрядчика,
	//)
	//Евросиб - АСуслов 29.12.2021 16:54:17 #
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	ВТ_Доходы.ДатаОказанияУслуги КАК ДатаОказанияУслугиСтрокиИсправления,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
	// Евросиб Фролов)
	|	ВТ_ДатыПоНаправлениям.ДатаДокументаКоносаментаПоНаправлению КАК ДатаДокументаКоносаментаПоНаправлению,
	|	ВТ_ДатыПоНаправлениям.ДатаОтправленияКоносаментаПоНаправлению КАК ДатаОтправленияКоносаментаПоНаправлению,
	|	ВТ_ДатыПоНаправлениям.ДатаПрибытияКоносаментаПоНаправлению КАК ДатаПрибытияКоносаментаПоНаправлению,
	//Евросиб Каблов 23.08.2023 ( #68187
	|	ЕСТЬNULL(ДатыЗавершенияСНП.ДатаЗавершенияСНП, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияСНП,
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|	ЕСТЬNULL(ДатыОказанияУслугДопРасходов.ДатаОказанияУслуги, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОказанияУслугиДопРасходов,
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
	|	ЕСТЬNULL(ДатыОказанияУслугДоплатИзРелиза.ДатаОказанияУслуги, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатыОказанияУслугДоплатИзРелиза
	// Евросиб Рыбьяков К.А. 18.03.2026 ))
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Доходы КАК СделкаДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СУЕ_СПравилами КАК ВТ_СУЕ_СПравилами
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|				ПО ВТ_СУЕ_СПравилами.Заявка = ЗаявкаСоставУслуги.Ссылка
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	// Закомментировал связи по протоколу и контейнеру и добавил связь по ГУИД строки вместо протокола и КТК
	//|					И ВТ_СУЕ_СПравилами.Протокол = ЗаявкаСоставУслуги.ПСЦ
	//|					И ВТ_СУЕ_СПравилами.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|					И ВТ_СУЕ_СПравилами.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	// Евросиб Фролов)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументовФрахт
	|				ПО ВТ_СУЕ_СПравилами.ПравилоФФД_Фрахт = ФормированиеФинДокументовФрахт.Документ
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументовЖД
	|				ПО ВТ_СУЕ_СПравилами.ПравилоФФД_ЖД = ФормированиеФинДокументовЖД.Документ
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПоНаправлениям КАК ВТ_ДатыПоНаправлениям
	|				ПО ВТ_СУЕ_СПравилами.ИдентификаторНаправления = ВТ_ДатыПоНаправлениям.Направление
	|			ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = ВТ_СУЕ_СПравилами.ГУИД
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК СделкаРасходы
	|			ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|				И (ВЫБОР
	|					КОГДА НЕ СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА СделкаСвязьДоходовИРасходов.Услуга = СделкаРасходы.Услуга
	|					ИНАЧЕ НЕ СделкаРасходы.Услуга = &Фрахт
	|				КОНЕЦ)
	|		ПО СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
	|		ПО СделкаДоходы.ГУИДИсправляемойСтроки = ВТ_Доходы.ГУИД
	//Евросиб Каблов 23.08.2023 ( #68187
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыЗавершенияСНП КАК ДатыЗавершенияСНП
	|		ПО СделкаДоходы.ГУИД = ДатыЗавершенияСНП.ГУИД
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыОказанияУслугДопРасходов КАК ДатыОказанияУслугДопРасходов
	|		ПО СделкаДоходы.ГУИД = ДатыОказанияУслугДопРасходов.ГУИД
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыОказанияУслугДоплатИзРелиза КАК ДатыОказанияУслугДоплатИзРелиза
	|		ПО СделкаДоходы.ГУИД = ДатыОказанияУслугДоплатИзРелиза.ГУИД
	// Евросиб Рыбьяков К.А. 18.03.2026 ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.ДатаРеализации КАК ДатаРеализации,
	|	ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|		КОГДА ВТ.ДоплатныеКТК ТОГДА ""Дата доставки (по доплатным КТК)""
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	|		КОГДА ВТ.ДатаЗавершенияСНП <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""Дата завершения СНП""
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|		КОГДА ВТ.ДатаОказанияУслугиДопРасходов <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""Дата оказания доп. услуг""
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|       КОГДА ВТ.Договор.КатегорияДоговора = Значение(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|          	И ВТ.ДатаФактическогоПредоставленияПС > ДатаВремя(1,1,1) Тогда
	|       	""Дата фактического предоставления ПС"" 
	|		КОГДА НЕ ВТ.ДатаОказанияУслугиСтрокиИсправления ЕСТЬ NULL
	|			ТОГДА ""Дата оказания услуги (первоначальная)""
	|		КОГДА ВТ.УслугаВнеСтавки
	|			ТОГДА ""Дата оказания услуги подрядчиком""
	|		КОГДА ВТ.ДатаРеализации <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВТ.ДатаРеализации)
	|		КОГДА ВТ.ПовагонныеОтправки
	|				ТОГДА ""Дата отправления""
	|		ИНАЧЕ ""По дате раскредитации""
	|	КОНЕЦ КАК ПравилоОпределенияДатыОказанияУслуги,
	|	ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|		КОГДА ВТ.ДоплатныеКТК ТОГДА """"
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	|		КОГДА ВТ.ДатаЗавершенияСНП <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	//Евросиб Каблов 23.08.2023 
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|			КОГДА ВТ.ДатаОказанияУслугиДопРасходов <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА """"
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|       	КОГДА ВТ.Договор.КатегорияДоговора = Значение(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|	          	И ВТ.ДатаФактическогоПредоставленияПС > ДатаВремя(1,1,1) Тогда
	|       		"""" 
	|			КОГДА НЕ ВТ.ДатаОказанияУслугиСтрокиИсправления ЕСТЬ NULL
	|				ТОГДА """"
	|			КОГДА ВТ.УслугаВнеСтавки
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	//(
	|  				ТОГДА """"
	//)
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата коносамента по направлению перевозки)""
	|							ИНАЧЕ ""(Дата коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|				ТОГДА ""(Дата отправления ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата ухода судна из коносамента по направлению)""
	|							ИНАЧЕ ""(Дата ухода судна из коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|				ТОГДА ""(Дата прибытия ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|					И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА  ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата прибытия судна из коносамента по направлению)""
	|							ИНАЧЕ ""(Дата прибытия судна из коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|				ТОГДА ""(Дата доставки груза)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|				ТОГДА ""(Дата раскредитации ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|					И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ""(Дата прибытия ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|								И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|									ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|							ТОГДА ""(Дата отправления ЖД)""
	|						ИНАЧЕ ""(Дата отправления из коносамента)""
	|					КОНЕЦ
	|			КОГДА ВТ.ПовагонныеОтправки
	|				ТОГДА """"
	|			ИНАЧЕ ""(Дата раскредитации ЖД)""
	|		КОНЕЦ КАК ИсточникПолученияДатыОказанияУслуги, 
	|	МАКСИМУМ(ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|			КОГДА ВТ.ДоплатныеКТК 
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
	|				ТОГДА ВЫБОР
	|					КОГДА ВТ.ДатыОказанияУслугДоплатИзРелиза <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ.ДатыОказанияУслугДоплатИзРелиза
	|					ИНАЧЕ ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|				КОНЕЦ
	// Евросиб Рыбьяков К.А. 18.03.2026 ))
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	|			КОГДА ВТ.ДатаЗавершенияСНП <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТ.ДатаЗавершенияСНП
	//Евросиб Каблов 23.08.2023 )
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|			КОГДА ВТ.ДатаОказанияУслугиДопРасходов <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТ.ДатаОказанияУслугиДопРасходов
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|       	КОГДА ВТ.Договор.КатегорияДоговора = Значение(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|	          	И ВТ.ДатаФактическогоПредоставленияПС > ДатаВремя(1,1,1) Тогда
	|       		ВТ.ДатаФактическогоПредоставленияПС 
	|			КОГДА НЕ ВТ.ДатаОказанияУслугиСтрокиИсправления ЕСТЬ NULL
	|				ТОГДА ВТ.ДатаОказанияУслугиСтрокиИсправления
	|			КОГДА ВТ.УслугаВнеСтавки
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	//(
	|  				ТОГДА ЕСТЬNULL(ВТ.ДатаВходящегоДокументаПодрядчика, ДатаВремя(1,1,1))
	//)
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, ДатаВремя(1,1,1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаКоносамента, ДатаВремя(1,1,1)) КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДатаВремя(1,1,1))
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, ДатаВремя(1,1,1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДатаВремя(1,1,1)) КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДатаВремя(1,1,1))
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|					И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА  ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, ДатаВремя(1,1,1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, ДатаВремя(1,1,1)) КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДатаВремя(1,1,1))
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДатаВремя(1,1,1))
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|					И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДатаВремя(1,1,1))
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|								И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|									ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|							ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДатаВремя(1,1,1))
	|						ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДатаВремя(1,1,1))
	|					КОНЕЦ
	|			КОГДА ВТ.ПовагонныеОтправки
	|				ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДатаВремя(1,1,1))
	|			ИНАЧЕ ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДатаВремя(1,1,1))
	|		КОНЕЦ) КАК ДатаОказанияУслуги,
	|	ВТ.ГУИД КАК ГУИД,
	|	ВТ.Договор.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	|	ВТ.Договор.ПериодичностьВыставленияДокументов КАК ПериодичностьВыставления,
	|	ВТ.Договор.Владелец.СтранаРегистрации КАК СтранаРегистрацииКонтрагента,
	|  	МАКСИМУМ(ВТ.ДатаВходящегоДокументаПодрядчика) КАК ДатаВходящегоДокументаПодрядчика,
	|	ВТ.ДатаОказанияУслугиСтрокиИсправления КАК ДатаОказанияУслугиСтрокиИсправления,
	|	МАКСИМУМ(ВТ.ПравилоФормирования) КАК ПравилоФормирования,
	// Евросиб Фролов (01.02.2022 Task №46345
	|	ВТ.ДоплатныеКТК КАК ДоплатныеКТК,
	// Евросиб Фролов)
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	ВТ.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ДатаРеализации,
	|	ВТ.ГУИД,
	|	ВТ.Договор.ДатаПаспортаСделки,
	|	ВТ.Договор.ПериодичностьВыставленияДокументов,
	|	ВТ.Договор.Владелец.СтранаРегистрации,
	|	ВТ.ДатаОказанияУслугиСтрокиИсправления,
	|	ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|		КОГДА ВТ.ДоплатныеКТК ТОГДА ""Дата доставки (по доплатным КТК)""
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	|		КОГДА ВТ.ДатаЗавершенияСНП <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""Дата завершения СНП""
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|		КОГДА ВТ.ДатаОказанияУслугиДопРасходов <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""Дата оказания доп. услуг""
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|       КОГДА ВТ.Договор.КатегорияДоговора = Значение(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|          	И ВТ.ДатаФактическогоПредоставленияПС > ДатаВремя(1,1,1) Тогда
	|       	""Дата фактического предоставления ПС"" 
	|		КОГДА НЕ ВТ.ДатаОказанияУслугиСтрокиИсправления ЕСТЬ NULL
	|			ТОГДА ""Дата оказания услуги (первоначальная)""
	|		КОГДА ВТ.УслугаВнеСтавки
	|			ТОГДА ""Дата оказания услуги подрядчиком""
	|		КОГДА ВТ.ДатаРеализации <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВТ.ДатаРеализации)
	|		КОГДА ВТ.ПовагонныеОтправки
	|				ТОГДА ""Дата отправления""
	|		ИНАЧЕ ""По дате раскредитации""
	|	КОНЕЦ,
	// Евросиб Фролов (01.02.2022 Task №46345
	|	ВТ.ДоплатныеКТК,
	// Евросиб Фролов)
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 04.09.2025 ((
	|	ВТ.КлючАналитикиСоставаПоезда,
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|	ВЫБОР
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|		КОГДА ВТ.ДоплатныеКТК ТОГДА """"
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	|		КОГДА ВТ.ДатаЗавершенияСНП <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	//Евросиб Каблов 23.08.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
	|			КОГДА ВТ.ДатаОказанияУслугиДопРасходов <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА """"
	// Евросиб Рыбьяков К.А. 30.04.2025 ))
	|       	КОГДА ВТ.Договор.КатегорияДоговора = Значение(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|	          	И ВТ.ДатаФактическогоПредоставленияПС > ДатаВремя(1,1,1) Тогда
	|       		"""" 
	|			КОГДА НЕ ВТ.ДатаОказанияУслугиСтрокиИсправления ЕСТЬ NULL
	|				ТОГДА """"
	|			КОГДА ВТ.УслугаВнеСтавки
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	//(
	|  				ТОГДА """"
	//)
	//Евросиб - АСуслов 29.12.2021 16:54:56 #
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата коносамента по направлению перевозки)""
	|							ИНАЧЕ ""(Дата коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|				ТОГДА ""(Дата отправления ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|				ТОГДА ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата ухода судна из коносамента по направлению)""
	|							ИНАЧЕ ""(Дата ухода судна из коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|				ТОГДА ""(Дата прибытия ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|					И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА  ВЫБОР КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = Значение(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки) 
	|								  И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ""(Дата прибытия судна из коносамента по направлению)""
	|							ИНАЧЕ ""(Дата прибытия судна из коносамента)"" КОНЕЦ
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|				ТОГДА ""(Дата доставки груза)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|				ТОГДА ""(Дата раскредитации ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|					И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ""(Дата прибытия ЖД)""
	|			КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|								И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|									ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|							ТОГДА ""(Дата отправления ЖД)""
	|						ИНАЧЕ ""(Дата отправления из коносамента)""
	|					КОНЕЦ
	|			КОГДА ВТ.ПовагонныеОтправки
	|				ТОГДА """"
	|			ИНАЧЕ ""(Дата раскредитации ЖД)""
	|		КОНЕЦ";                       
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&Доходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	
	
	
	//ТЗДоходы = Объект.Доходы.Выгрузить();
	Запрос.УстановитьПараметр("Доходы", ТаблицаДоходов);
	Запрос.УстановитьПараметр("Расходы", ТаблицаРасходов);
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", ТаблицаСвязейДоходовИРасходов);
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", ТаблицаСвязейУчетныхЕдиниц);
	Запрос.УстановитьПараметр("ПовагонныеОтправки", Объект.ПовагонныеОтправки);
	Запрос.УстановитьПараметр("Фрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	Запрос.УстановитьПараметр("DOOR", Перечисления.УсловияПеревозкиКТК.DOOR);
	// Евросиб Фролов)
	//Евросиб Каблов 23.08.2023 ( #68187
	Запрос.УстановитьПараметр("Сделка", ОбъектСделка.Ссылка);
	//Евросиб Каблов 23.08.2023 )
	//Пакеты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 26-12-2024, начало
	//Евросиб Каблов 09.04.2025 ( #105407
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	Запрос.УстановитьПараметр("ДатаОткрытогоПериода", ДатаОткрытогоПериода);
	//Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 26-12-2024, конец
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	Выборка = РезультатЗапроса.Выбрать();
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация); //Евросиб(ДИТ), Беляев СЮ, BUG 99137 / TA 99269, 26-12-2024, (перенес выше)
	Пока Выборка.Следующий() Цикл
		СтрокаДоход = ТаблицаДоходов.Найти(Выборка.ГУИД, "ГУИД");  
		//Евросиб(ДИТ), Беляев СЮ, BUG 102880 / TA 102871, 20-02-2025, начало
		ПрисутствуетУчетныйДокумент = ЗначениеЗаполнено(СтрокаДоход.УчДокумент) 
										ИЛИ ЗначениеЗаполнено(СтрокаДоход.КорректировкаДокумента) 
										ИЛИ ЗначениеЗаполнено(СтрокаДоход.КорректировкаВознаграждения);
		Если ПрисутствуетУчетныйДокумент Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102880 / TA 102871, 20-02-2025, конец
		СтрокаСвязь = ТаблицаСвязейДоходовИРасходов.Найти(Выборка.ГУИД, "Доходы");
		Если ЗначениеЗаполнено(СтрокаСвязь) Тогда
			СтрокаСУЕ = ТаблицаСвязейУчетныхЕдиниц.Найти(СтрокаСвязь.СвязьУчетныхЕдиниц, "ГУИД");
			Если ЗначениеЗаполнено(СтрокаСУЕ) Тогда
				СтрокаСУЕ.МесяцОказанияУслуги = НачалоМесяца(Выборка.ДатаОказанияУслуги);
			КонецЕсли;
		КонецЕсли;
		СтрокаДоход.ДатаОказанияУслуги = Выборка.ДатаОказанияУслуги;
		СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги = СтрШаблон("%1 %2", Выборка.ПравилоОпределенияДатыОказанияУслуги, Выборка.ИсточникПолученияДатыОказанияУслуги);
		СтрокаДоход.ДокументФФД = Выборка.ПравилоФормирования;
		//Если НЕ ЗначениеЗаполнено(СтрокаДоход.УчДокумент) //Евросиб(ДИТ), Беляев СЮ, BUG 102880 / TA 102871, 20-02-2025, перенес условие выше
		//	И НЕ ЗначениеЗаполнено(СтрокаДоход.КорректировкаДокумента)
		//	И НЕ ЗначениеЗаполнено(СтрокаДоход.КорректировкаВознаграждения) Тогда
			СтрокаДоход.ДатаОказанияУслуги = Выборка.ДатаОказанияУслуги;
			СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги = СтрШаблон("%1 %2", Выборка.ПравилоОпределенияДатыОказанияУслуги, Выборка.ИсточникПолученияДатыОказанияУслуги);
			Если СтрокаДоход.УслугаВнеСтавки
				И НЕ СтрокаДоход.Перевыставляемая
				//Евросиб Каблов 23.08.2023 ( #68187
				И Не (СтрокаДоход.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы 
				// Евросиб US 91362 TA 104075 Рыбьяков К.А. 30.04.2025 ((
					ИЛИ СтрокаДоход.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы 
				// Евросиб Рыбьяков К.А. 30.04.2025 ))
				И ЗначениеЗаполнено(Выборка.ДатаОказанияУслуги))
				//Евросиб Каблов 23.08.2023 )
				И ЗначениеЗаполнено(СтрокаДоход.ПериодВО) Тогда //для доп.услуг по выручке разрешено указывать период во вручную
					СтрокаДоход.ДатаОказанияУслуги = СтрокаДоход.ПериодВО;
					СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги = СтрокаДоход.ПравилоОпределенияДатыДокумента;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДоход.ГУИДИсправляемойСтроки) Тогда
				СтрокаДоход.ПериодВО = ДатаОткрытогоПериода;
				СтрокаДоход.ПравилоОпределенияДатыДокумента = "Открытый период ВО";
			Иначе //для всех остальных период по дате оказания услуги
				СтрокаДоход.ПериодВО = Выборка.ДатаОказанияУслуги;
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрШаблон("%1 %2", Выборка.ПравилоОпределенияДатыОказанияУслуги, Выборка.ИсточникПолученияДатыОказанияУслуги);
			КонецЕсли;
			Если НЕ Выборка.СтранаРегистрацииКонтрагента = Справочники.СтраныМира.Россия Тогда
				ФормированиеДатДокументов.ПереопределитьДатуДокументаНерезидента(СтрокаДоход.ПериодВО, ДатаОткрытогоПериода, Выборка.ДатаПаспортаСделки, СтрокаДоход.ПравилоОпределенияДатыДокумента);
			КонецЕсли;	
			// если правило по пятидневкам, по декадам, два раза в месяц, раз в месяц, то нужно обработать дату
			Если Выборка.ПериодичностьВыставления = Перечисления.ПериодичностьВыставления.ПоПятидневке Тогда
				СтрокаДоход.ПериодВО = ФормированиеДатДокументов.ПересчетДаты(СтрокаДоход.ДатаОказанияУслуги,5);
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; пятидневка";
			ИначеЕсли Выборка.ПериодичностьВыставления = Перечисления.ПериодичностьВыставления.ПоДекаде Тогда
				СтрокаДоход.ПериодВО = ФормированиеДатДокументов.ПересчетДаты(СтрокаДоход.ДатаОказанияУслуги,10);
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; по декаде";
			ИначеЕсли Выборка.ПериодичностьВыставления = Перечисления.ПериодичностьВыставления.ДваРазаВМесяц Тогда
				СтрокаДоход.ПериодВО = ФормированиеДатДокументов.ПересчетДаты(СтрокаДоход.ДатаОказанияУслуги,15);
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; два раза в месяц";
			ИначеЕсли Выборка.ПериодичностьВыставления = Перечисления.ПериодичностьВыставления.РазВМесяц Тогда
				СтрокаДоход.ПериодВО = ФормированиеДатДокументов.ПересчетДаты(СтрокаДоход.ДатаОказанияУслуги,31);
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; раз в месяц";
			КонецЕсли;
			Если ДатаОткрытогоПериода > СтрокаДоход.ПериодВО 
				И ЗначениеЗаполнено(СтрокаДоход.ПериодВО) Тогда
				СтрокаДоход.ПериодВО = ДатаОткрытогоПериода;
				СтрокаДоход.ПравилоОпределенияДатыДокумента = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; открытый период ВО";
			КонецЕсли;
		//КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаДоход.ДатаОказанияУслуги) ИЛИ СтрокаДоход.ДатаОказанияУслуги > СтрокаДоход.ПериодВО Тогда
			СтрокаДоход.ДатаОказанияУслуги = СтрокаДоход.ПериодВО;
			СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги + "; по периоду ВО";
		КонецЕсли;
		ПОДОУ = СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги;
		ПОДД = СтрокаДоход.ПравилоОпределенияДатыДокумента;                                                             
		ПОДОУ = СтрЗаменить(ПОДОУ, " ; ", "; ");
		ПОДД = СтрЗаменить(ПОДД, " ; ", "; ");
		СтрокаДоход.ПравилоОпределенияДатыОказанияУслуги = ?(СтрНачинаетсяС(ПОДОУ,"; "), Прав(ПОДОУ, СтрДлина(ПОДОУ)-2), ПОДОУ); 
		СтрокаДоход.ПравилоОпределенияДатыДокумента = ?(СтрНачинаетсяС(ПОДД,"; "), Прав(ПОДД, СтрДлина(ПОДД)-2), ПОДД); 
		
		// Евросиб Фролов (01.02.2022 Task №46345
		// Для доплатных КТК дата оказания услуг это максимальная дата раскредитации
		// (или Дата выдачи груза (авто/инЖД), если "условия перевозки в п. назначения" = DOOR) 
		Если Выборка.ДоплатныеКТК Тогда
			СтрокаДоход.ДатаОказанияУслуги = Выборка.ДатаОказанияУслуги;
		КонецЕсли;
		// Евросиб Фролов)
	КонецЦикла;                   
	Если НеЗагружатьВТабличнуюЧасть = Ложь Тогда
		Объект.Доходы.Загрузить(ТаблицаДоходов);
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало
Процедура ПерезаполнитьОтгрузочнуюИнформацию(ОбъектДляЗаполнения, РелизСобственника = Неопределено) Экспорт
	
	РасшифровкаУслугПоТС_ДоЗаполнения = ОбъектДляЗаполнения.РасшифровкаУслугПоТС.Выгрузить();
	ОбъектДляЗаполнения.РасшифровкаУслугПоТС.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПоТоварамУслугам.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
		|	ДанныеПоТоварамУслугам.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеПоТоварамУслугам.Сумма КАК Сумма,
		|	ДанныеПоТоварамУслугам.СуммаНДС КАК СуммаНДС,
		|	ДанныеПоТоварамУслугам.Цена КАК Цена,
		|	ДанныеПоТоварамУслугам.СуммаВознаграждения КАК СуммаВознаграждения,
		|	ДанныеПоТоварамУслугам.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
		|	ДанныеПоТоварамУслугам.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДанныеПоТоварамУслугам
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.Товары КАК ДанныеПоТоварамУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходы.ГУИД КАК ГУИДДохода,
		|	СделкаДоходы.Ссылка КАК Сделка,
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ГУИДСвязьУчетныхЕдиниц,
		|	СделкаДоходы.ДокументФФД КАК ДокументФФД,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонкиУчДок,
		|	СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонкиУчДок,
		|	СделкаДоходы.Комментарий КАК Комментарий,
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК
		|ПОМЕСТИТЬ ВТ_ДоходыИСвязьДоходовИРасходов
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
		|			И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
		|ГДЕ
		|	СделкаДоходы.ГУИД В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеПоТоварамУслугам.СтрокаДоходовСделки
		|			ИЗ
		|				ВТ_ДанныеПоТоварамУслугам КАК ВТ_ДанныеПоТоварамУслугам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоходыИСвязьДоходовИРасходов.ГУИДДохода КАК ГУИДДохода,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.Сделка КАК Сделка,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.ДокументФФД КАК ДокументФФД,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.ГУИДСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.Услуга КАК Услуга,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
		|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
		|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
		|	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН КАК Накладная,
		|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 ((
		|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
		// Евросиб Рыбьяков К.А. 22.07.2025 ))
		|	ВЫБОР
		|		КОГДА ВТ_ДоходыИСвязьДоходовИРасходов.ДоплатныеКТК
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Калькуляция
		|	КОНЕЦ КАК Калькуляция,
		|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
		|	ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) КАК ЗаменятьСтанциюНаОсновную,
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		//|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления КАК ЖДНСтанцияОтправления,
		//|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения КАК ЖДНСтанцияНазначения,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
		//|	КОНЕЦ КАК ЖДНСтанцияОтправленияОсновнаяЛокация,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения
		//|	КОНЕЦ КАК ЖДНСтанцияНазначенияОсновнаяЛокация,
		//|	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления КАК СделкаСтанцияОтправления,
		//|	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения КАК СделкаСтанцияНазначения,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления.ОсновнаяЛокация
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления
		//|	КОНЕЦ КАК СделкаСтанцияОтправленияОсновнаяЛокация,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения.ОсновнаяЛокация
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения
		//|	КОНЕЦ КАК СделкаСтанцияНазначенияОсновнаяЛокация,		
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
		|	КОНЕЦ КАК ЖДНСтанцияОтправления,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения
		|	КОНЕЦ КАК ЖДНСтанцияНазначения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления
		|	КОНЕЦ КАК СделкаСтанцияОтправления,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения
		|	КОНЕЦ КАК СделкаСтанцияНазначения,
		//Евросиб Каблов 23.12.2022 )
		|	ВТ_ДоходыИСвязьДоходовИРасходов.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонкиУчДок,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонкиУчДок,
		|	ВТ_ДоходыИСвязьДоходовИРасходов.Комментарий КАК Комментарий,
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
		|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления
		|	КОНЕЦ КАК КоносаментСтанцияОтправления,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) И ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.ОсновнаяЛокация
		|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения
		|	КОНЕЦ КАК КоносаментСтанцияНазначения
		//|	ВЫБОР
		//|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
		//|	КОНЕЦ КАК ТДСтанцияОтправления,
		//|	ВЫБОР
		//|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
		//|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения
		//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения
		//|	КОНЕЦ КАК ТДСтанцияНазначения,
		//|	ВЫБОР
		//|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
		//|			ТОГДА ВЫБОР
		//|					КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|						ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления.ОсновнаяЛокация
		//|					ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления
		//|				КОНЕЦ
		//|		ИНАЧЕ ВЫБОР
		//|					КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|						ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления.ОсновнаяЛокация
		//|					ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
		//|				КОНЕЦ
		//|	КОНЕЦ КАК ТДСтанцияОтправленияОсновнаяЛокация,
		//|	ВЫБОР
		//|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
		//|			ТОГДА ВЫБОР
		//|					КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|						ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения.ОсновнаяЛокация
		//|					ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения
		//|				КОНЕЦ
		//|		ИНАЧЕ ВЫБОР
		//|					КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
		//|						ТОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения.ОсновнаяЛокация
		//|					ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения
		//|				КОНЕЦ
		//|	КОНЕЦ КАК ТДСтанцияНазначенияОсновнаяЛокация
		//Евросиб Каблов 23.12.2022 )
		|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиницИДоходы
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоходыИСвязьДоходовИРасходов КАК ВТ_ДоходыИСвязьДоходовИРасходов
		|		ПО (ВТ_ДоходыИСвязьДоходовИРасходов.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка)
		|			И (ВТ_ДоходыИСвязьДоходовИРасходов.ГУИДСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		|		ПО (ВТ_ДоходыИСвязьДоходовИРасходов.ДокументФФД = ФормированиеФинДокументов.Документ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода КАК ГУИДДохода,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка КАК Сделка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер) КАК КоличествоКонтейнеров,
		//Евросиб - АСуслов 16.01.2023 17:12:52 #61165
		//(
		|   ВТ_СвязьУчетныхЕдиницИДоходы.Вагон КАК Вагон
		//)
		//Евросиб - АСуслов 16.01.2023 17:13:30 #61165
		|ПОМЕСТИТЬ ВТ_КоличествоКонтейнеровВСтрокахДохода
		|ИЗ
		|	ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы
		|ГДЕ
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка,
		//Евросиб - АСуслов 16.01.2023 17:12:52 #61165
		//(
		|   ВТ_СвязьУчетныхЕдиницИДоходы.Вагон
		//)
		//Евросиб - АСуслов 16.01.2023 17:13:30 #61165
		|   
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб - АСуслов 16.01.2023 17:14:07 #61165
		//(
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода КАК ГУИДДохода,
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка КАК Сделка,
		//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СвязьУчетныхЕдиницИДоходы.Вагон) КАК КоличествоВагонов,
		//|ПОМЕСТИТЬ ВТ_КоличествоВагоновВСтрокахДохода
		//|ИЗ
		//|	ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы
		//|ГДЕ
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода,
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка
		//|;
		//)
		//Евросиб - АСуслов 16.01.2023 17:14:10 #61165
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	э_НакладнаяКонтейнеры.Ссылка КАК НакладнаяСсылка,
		|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
		|	СУММА(э_НакладнаяКонтейнеры.МассыВКгНетто) КАК МассыВКгНетто
		|ПОМЕСТИТЬ ВТ_НакладнаяКонтейнеры
		|ИЗ
		|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|ГДЕ
		|	э_НакладнаяКонтейнеры.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_СвязьУчетныхЕдиницИДоходы.Накладная
		|			ИЗ
		|				ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	э_НакладнаяКонтейнеры.Ссылка,
		|	э_НакладнаяКонтейнеры.НомерКонтейнера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	э_НакладнаяВагоны.Ссылка КАК НакладнаяСсылка,
		|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
		|	СУММА(э_НакладнаяВагоны.МассыВКгНетто) КАК МассыВКгНетто
		|ПОМЕСТИТЬ ВТ_НакладнаяВагоны
		|ИЗ
		|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|ГДЕ
		|	э_НакладнаяВагоны.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_СвязьУчетныхЕдиницИДоходы.Накладная
		|			ИЗ
		|				ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	э_НакладнаяВагоны.Ссылка,
		|	э_НакладнаяВагоны.НомерВагона
		|;
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода КАК ГУИДДохода,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка КАК Сделка,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТранспортныйДокументКоносаменты.ВесНетто, 0) <> 0
		|			ТОГДА ЕСТЬNULL(ТранспортныйДокументКоносаменты.ВесНетто, 0)
		|		ИНАЧЕ ЕСТЬNULL(ВТ_НакладнаяКонтейнеры.МассыВКгНетто, 0)
		|	КОНЕЦ КАК МассыВКгНетто
		|ПОМЕСТИТЬ ВТ_НакладныеДляСтрокФрахт
		|ИЗ
		|	ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладнаяКонтейнеры КАК ВТ_НакладнаяКонтейнеры
		|			ПО СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН = ВТ_НакладнаяКонтейнеры.НакладнаяСсылка
		|				И СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование = ВТ_НакладнаяКонтейнеры.НомерКонтейнера
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДСтрокиЗаявки = СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
		|			И (СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = &ЖД)
		|			И (ВТ_СвязьУчетныхЕдиницИДоходы.ВидТранспортногоСообщения = &Море)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент = ТранспортныйДокументКоносаменты.Ссылка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер = ТранспортныйДокументКоносаменты.НомерКТК
		|ГДЕ
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Услуга = &УслугаФрахт
		|;
		//Евросиб Каблов 23.12.2022 )
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода КАК СтрокаДоходовСделки,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Сделка КАК Сделка,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ДокументФФД КАК ДокументФФД,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ЗаменятьСтанциюНаОсновную КАК ЗаменятьСтанциюНаОсновную,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Услуга КАК Услуга,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер КАК Контейнер,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Вагон КАК Вагон,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ЖДН КАК ЖДН,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.НомерЖДН КАК НомерЖДН,
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 22.07.2025 ((
		|	ВТ_СвязьУчетныхЕдиницИДоходы.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
		// Евросиб Рыбьяков К.А. 22.07.2025 ))
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.Накладная, ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)
		//|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Накладная.ДатаИВремяОтправленияГруза
		//|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЖДН <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		//|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЖДН.ДатаОтправления
		//|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		//|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент.ДатаОтправления
		//|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		//|	КОНЕЦ КАК ДатаОтправки,		
		//|	ВТ_СвязьУчетныхЕдиницИДоходы.Груз КАК Груз,
		|	ВЫБОР
		|		КОГДА (ВТ_СвязьУчетныхЕдиницИДоходы.Услуга = &УслугаФрахт ИЛИ ВТ_СвязьУчетныхЕдиницИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)) И ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент.ДатаОтправления
		|		КОГДА ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.Накладная, ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Накладная.ДатаИВремяОтправленияГруза
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЖДН <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЖДН.ДатаОтправления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОтправки,
		|	ВЫБОР
		|		КОГДА ВТ_НакладныеДляСтрокФрахт.Груз ЕСТЬ NULL
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Груз
		|		ИНАЧЕ ВТ_НакладныеДляСтрокФрахт.Груз
		|	КОНЕЦ КАК Груз,
		//Евросиб Каблов 23.12.2022 )
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент.ДатаОтправления КАК КоносаментДатаОтправления,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент КАК Коносамент,
		|	ВЫБОР
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТ_НакладнаяВагоны.МассыВКгНетто, 0)
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		|		КОГДА ЕСТЬNULL(ВТ_НакладныеДляСтрокФрахт.МассыВКгНетто, 0) <> 0
		|			ТОГДА ЕСТЬNULL(ВТ_НакладныеДляСтрокФрахт.МассыВКгНетто, 0)
		//Евросиб Каблов 23.12.2022 )
		|		ИНАЧЕ ЕСТЬNULL(ВТ_НакладнаяКонтейнеры.МассыВКгНетто, 0)
		|	КОНЕЦ КАК ФактическийВес,
		|	ВЫБОР
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТ_НакладнаяВагоны.МассыВКгНетто, 0)
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		|		КОГДА ЕСТЬNULL(ВТ_НакладныеДляСтрокФрахт.МассыВКгНетто, 0) <> 0
		|			ТОГДА ЕСТЬNULL(ВТ_НакладныеДляСтрокФрахт.МассыВКгНетто, 0)
		//Евросиб Каблов 23.12.2022 )
		|		ИНАЧЕ ЕСТЬNULL(ВТ_НакладнаяКонтейнеры.МассыВКгНетто, 0)
		|	КОНЕЦ КАК РасчетныйВес,
		|	ВТ_ДанныеПоТоварамУслугам.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
		//Евросиб - АСуслов 16.01.2023 17:14:36 #61165
		//(
		//|			ТОГДА ВЫБОР
		//|					КОГДА ЕСТЬNULL(ВТ_КоличествоВагоновВСтрокахДохода.КоличествоВагонов, 0) > 0
		//|						ТОГДА ВТ_ДанныеПоТоварамУслугам.Сумма / ВТ_КоличествоВагоновВСтрокахДохода.КоличествоВагонов
		//|					ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.Сумма
		//|				КОНЕЦ
		|   		ТОГДА ВТ_ДанныеПоТоварамУслугам.Сумма / ВТ_ДанныеПоТоварамУслугам.Количество / ЕСТЬNULL(ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров, 1)		//)
		//|		ИНАЧЕ ВЫБОР
		//|				КОГДА ЕСТЬNULL(ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров, 0) > 0
		//|					ТОГДА ВТ_ДанныеПоТоварамУслугам.Сумма / ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров
		//|				ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.Сумма
		//|			КОНЕЦ
		|  		ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.Сумма / ВТ_ДанныеПоТоварамУслугам.Количество
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
		//|			ТОГДА ВЫБОР
		//|					КОГДА ЕСТЬNULL(ВТ_КоличествоВагоновВСтрокахДохода.КоличествоВагонов, 0) > 0
		//|						ТОГДА ВТ_ДанныеПоТоварамУслугам.СуммаНДС / ВТ_КоличествоВагоновВСтрокахДохода.КоличествоВагонов
		//|					ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.СуммаНДС
		//|				КОНЕЦ
		|   		ТОГДА ВТ_ДанныеПоТоварамУслугам.СуммаНДС / ВТ_ДанныеПоТоварамУслугам.Количество / ЕСТЬNULL(ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров, 1)		//)
		//|		ИНАЧЕ ВЫБОР
		//|				КОГДА ЕСТЬNULL(ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров, 0) > 0
		//|					ТОГДА ВТ_ДанныеПоТоварамУслугам.СуммаНДС / ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров
		//|				ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.СуммаНДС
		//|			КОНЕЦ
		|  		ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.Сумма / ВТ_ДанныеПоТоварамУслугам.Количество
		|	КОНЕЦ КАК СуммаНДС,
		//Евросиб - АСуслов 16.01.2023 17:14:37 #61165
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		//|	ВЫБОР
		//|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЗаменятьСтанциюНаОсновную
		//|			ТОГДА ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияОтправленияОсновнаяЛокация, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияОтправленияОсновнаяЛокация)
		//|		ИНАЧЕ ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияОтправления, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияОтправления)
		//|	КОНЕЦ КАК ПунктОтправления,
		//|	ВЫБОР
		//|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.ЗаменятьСтанциюНаОсновную
		//|			ТОГДА ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияНазначенияОсновнаяЛокация, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияНазначенияОсновнаяЛокация)
		//|		ИНАЧЕ ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияНазначения, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияНазначения)
		//|	КОНЕЦ КАК ПунктНазначения,
		|	ВЫБОР
		|		КОГДА (ВТ_СвязьУчетныхЕдиницИДоходы.Услуга = &УслугаФрахт ИЛИ ВТ_СвязьУчетныхЕдиницИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)) И ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.КоносаментСтанцияОтправления 
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияОтправления, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияОтправления)
		|	КОНЕЦ КАК ПунктОтправления,
		|	ВЫБОР
		|		КОГДА (ВТ_СвязьУчетныхЕдиницИДоходы.Услуга = &УслугаФрахт ИЛИ ВТ_СвязьУчетныхЕдиницИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)) И ВТ_СвязьУчетныхЕдиницИДоходы.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|			ТОГДА ВТ_СвязьУчетныхЕдиницИДоходы.КоносаментСтанцияНазначения
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СвязьУчетныхЕдиницИДоходы.ЖДНСтанцияНазначения, ВТ_СвязьУчетныхЕдиницИДоходы.СделкаСтанцияНазначения)
		|	КОНЕЦ КАК ПунктНазначения,
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824    
		//Евросиб - АСуслов 16.01.2023 18:57:26 #61165
		//(
		|	ВЫБОР
		|		КОГДА ВТ_СвязьУчетныхЕдиницИДоходы.Калькуляция.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
		|   		ТОГДА ВТ_ДанныеПоТоварамУслугам.Цена / ЕСТЬNULL(ВТ_КоличествоКонтейнеровВСтрокахДохода.КоличествоКонтейнеров, 1)
		|  			ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.Цена
		|   КОНЕЦ КАК Цена,
		//)
		//Евросиб - АСуслов 16.01.2023 18:57:28 #61165
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки,
		|	ВТ_СвязьУчетныхЕдиницИДоходы.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоТоварамУслугам.Количество > 0
		|			ТОГДА ВТ_ДанныеПоТоварамУслугам.СуммаВознаграждения / ВТ_ДанныеПоТоварамУслугам.Количество
		|		ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.СуммаВознаграждения
		|	КОНЕЦ КАК СуммаВознаграждения,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоТоварамУслугам.Количество > 0
		|			ТОГДА ВТ_ДанныеПоТоварамУслугам.СуммаНДСВознаграждения / ВТ_ДанныеПоТоварамУслугам.Количество
		|		ИНАЧЕ ВТ_ДанныеПоТоварамУслугам.СуммаНДСВознаграждения
		|	КОНЕЦ КАК СуммаНДСВознаграждения
		|ИЗ
		|	ВТ_СвязьУчетныхЕдиницИДоходы КАК ВТ_СвязьУчетныхЕдиницИДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладнаяКонтейнеры КАК ВТ_НакладнаяКонтейнеры
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Накладная = ВТ_НакладнаяКонтейнеры.НакладнаяСсылка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.Контейнер.Наименование = ВТ_НакладнаяКонтейнеры.НомерКонтейнера
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладнаяВагоны КАК ВТ_НакладнаяВагоны
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Накладная = ВТ_НакладнаяВагоны.НакладнаяСсылка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.Вагон.Наименование = ВТ_НакладнаяВагоны.НомерВагона
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеПоТоварамУслугам КАК ВТ_ДанныеПоТоварамУслугам
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода = ВТ_ДанныеПоТоварамУслугам.СтрокаДоходовСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКонтейнеровВСтрокахДохода КАК ВТ_КоличествоКонтейнеровВСтрокахДохода
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Сделка = ВТ_КоличествоКонтейнеровВСтрокахДохода.Сделка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода = ВТ_КоличествоКонтейнеровВСтрокахДохода.ГУИДДохода
		//Евросиб - АСуслов 16.01.2023 18:01:56 #61165
		//(
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.Вагон = ВТ_КоличествоКонтейнеровВСтрокахДохода.Вагон
		//)
		//Евросиб - АСуслов 16.01.2023 18:02:03 #61165
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоВагоновВСтрокахДохода КАК ВТ_КоличествоВагоновВСтрокахДохода
		//|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.Сделка = ВТ_КоличествоВагоновВСтрокахДохода.Сделка
		//|			И ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода = ВТ_КоличествоВагоновВСтрокахДохода.ГУИДДохода
		//Евросиб Каблов 23.12.2022 ( Ticket#0290824
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладныеДляСтрокФрахт КАК ВТ_НакладныеДляСтрокФрахт
		|		ПО ВТ_СвязьУчетныхЕдиницИДоходы.ГУИДДохода = ВТ_НакладныеДляСтрокФрахт.ГУИДДохода
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.Сделка = ВТ_НакладныеДляСтрокФрахт.Сделка
		|			И ВТ_СвязьУчетныхЕдиницИДоходы.СтрокаСвязьУчетныхЕдиниц = ВТ_НакладныеДляСтрокФрахт.СтрокаСвязьУчетныхЕдиниц";
		//Евросиб Каблов 23.12.2022 )
	
	//Евросиб Каблов 23.12.2022 ( Ticket#0290824 
	Запрос.УстановитьПараметр("Море", Перечисления.ВидыТранспортныхСообщений.Море);
	Запрос.УстановитьПараметр("ЖД", Перечисления.ВидыТранспортныхСообщений.ЖД);
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	//Евросиб Каблов 23.12.2022 )
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ОтчетКомитентуОПродажах.Товары", "&ДанныеПоТоварамУслугам");
	Если ТипЗнч(ОбъектДляЗаполнения.Ссылка)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Запрос.УстановитьПараметр("ДанныеПоТоварамУслугам", ОбъектДляЗаполнения.Товары.Выгрузить(,"СтрокаДоходовСделки,СуммаНДС,Сумма,СтавкаНДС,Цена,СуммаВознаграждения,СуммаНДСВознаграждения,Количество"));
	Иначе
		ТЗУслугиРТУ =  ОбъектДляЗаполнения.Услуги.Выгрузить(,"СтрокаДоходовСделки,СуммаНДС,Сумма,СтавкаНДС,Цена,Количество");
		ТЗУслугиРТУ.Колонки.Добавить("СуммаВознаграждения", Новый ОписаниеТипов("Число"));
		ТЗУслугиРТУ.Колонки.Добавить("СуммаНДСВознаграждения", Новый ОписаниеТипов("Число"));
		Запрос.УстановитьПараметр("ДанныеПоТоварамУслугам",ТЗУслугиРТУ);
	КонецЕсли;
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
	ДанныеРелизаСобственника = Новый Структура;
	ДанныеРелизаСобственника.Вставить("ТаблицаДанных", Новый ТаблицаЗначений);
	//ДанныеРелизаСобственника.Вставить("ДатаДокумента", Дата('00010101'));
	Если ЗначениеЗаполнено(РелизСобственника) Тогда
		КлючиСоставаПоезда = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КлючАналитикиСоставаПоезда");
		ЗаполнитьДанныеРелизаСобственника(КлючиСоставаПоезда, , , РелизСобственника, ДанныеРелизаСобственника);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 17.03.2026 ))
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтрТЗ = ОбъектДляЗаполнения.РасшифровкаУслугПоТС.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрТЗ, ВыборкаДетальныеЗаписи);
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
		Если ДанныеРелизаСобственника.ТаблицаДанных.Количество() = 1 Тогда
		//Если ДанныеРелизаСобственника.ТаблицаДанных.Количество() > 0 Тогда
			//НайденныеСтроки = ДанныеРелизаСобственника.ТаблицаДанных.НайтиСтроки(Новый Структура("КлючАналитикиСоставаПоезда", 
			//												ВыборкаДетальныеЗаписи.КлючАналитикиСоставаПоезда));
			//Если НайденныеСтроки.Количество() = 1 Тогда
				ЗаполнитьЗначенияСвойств(НовСтрТЗ, ДанныеРелизаСобственника.ТаблицаДанных[0]);
				НовСтрТЗ.ФактическийВес = 0;
				НовСтрТЗ.РасчетныйВес = 0;
				НовСтрТЗ.НомерЖДН = Неопределено;
				НовСтрТЗ.ЖДН = Неопределено;
			//КонецЕсли;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 17.03.2026 ))
	КонецЦикла;
	
	Если ОбъектДляЗаполнения.РасшифровкаУслугПоТС.Количество() = 0 Тогда
		ОбъектДляЗаполнения.РасшифровкаУслугПоТС.Загрузить(РасшифровкаУслугПоТС_ДоЗаполнения);
	КонецЕсли;
	
	СкорректироватьСуммыРасшифровки(ОбъектДляЗаполнения);
	
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец

//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало (перенесено из модуля менеджера Сделки)
Процедура СкорректироватьСуммыРасшифровки(Объект) Экспорт
	//исправим суммы в расшифровке, чтобы суммы по строкам услуг совпадали с суммами их расшифровок
	//получим строки с суммами
//Евросиб Гудкова( 03.10.2021
//	ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
	ЭтоКоррРТУ = Ложь;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") Тогда
		ТЗСуммыУслуги = Объект.Товары.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда 
		ЭтоКоррРТУ = Истина;
		ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");
	Иначе
		ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
	КонецЕсли; 
// Евросиб Гудкова) 	
	Если ЭтоКоррРТУ Тогда
		ТЗСуммыУслуги.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения", "Сумма, СуммаНДС,СуммаДоИзменения, СуммаНДСДоИзменения");
	Иначе	
		ТЗСуммыУслуги.Свернуть("СтрокаДоходовСделки", "Сумма, СуммаНДС");
	КонецЕсли; 
	//получим расшифровки с суммами
	Если ЭтоКоррРТУ Тогда
		//ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");
		//ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");     
		//ДИТ Беляев СЮ, Ticket#0248427, Ticket#0249386 09-11-2021 ++
		ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, Сумма, СуммаНДС");
		ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения","СуммаДоИзменения, СуммаНДСДоИзменения, Сумма, СуммаНДС");
		//ДИТ Беляев СЮ, Ticket#0248427, Ticket#0249386 09-11-2021 --
	Иначе
		ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
		ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки", "Сумма, СуммаНДС");
	КонецЕсли; 
	//сверим суммы
	Для каждого СтрокаСуммаУслуги Из ТЗСуммыУслуги Цикл
		СтрокаСуммаРасшифровки = ТЗСуммыРасшифровки.Найти(СтрокаСуммаУслуги.СтрокаДоходовСделки);
		Если СтрокаСуммаРасшифровки <> Неопределено Тогда
			Если СтрокаСуммаУслуги.Сумма <> СтрокаСуммаРасшифровки.Сумма
				ИЛИ СтрокаСуммаУслуги.СуммаНДС <> СтрокаСуммаРасшифровки.СуммаНДС Тогда
				//перезаполним суммы
				СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделки", СтрокаСуммаУслуги.СтрокаДоходовСделки));
				СуммаПоСтроке = СтрокаСуммаУслуги.Сумма / СтрокиРасшифровки.Количество();
				СуммаНДСПоСтроке = СтрокаСуммаУслуги.СуммаНДС / СтрокиРасшифровки.Количество();
				ОстатокСумма = СтрокаСуммаУслуги.Сумма;
				ОстатокСуммаНДС = СтрокаСуммаУслуги.СуммаНДС;
				Для каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
					СтрокаРасшифровки.Цена = СуммаПоСтроке;
					СтрокаРасшифровки.Сумма = СуммаПоСтроке;
					СтрокаРасшифровки.СуммаНДС = СуммаНДСПоСтроке;
					ОстатокСумма = ОстатокСумма - СтрокаРасшифровки.Сумма;
					ОстатокСуммаНДС = ОстатокСуммаНДС - СтрокаРасшифровки.СуммаНДС;
				КонецЦикла; 
				Если ОстатокСумма <> 0 Тогда
					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.Сумма + ОстатокСумма;
					СтрокаРасшифровки.Цена = СтрокаРасшифровки.Сумма;
				КонецЕсли; 
				Если ОстатокСуммаНДС <> 0 Тогда
					СтрокаРасшифровки.СуммаНДС = СтрокаРасшифровки.СуммаНДС + ОстатокСуммаНДС;
				КонецЕсли; 
			КонецЕсли;
			Если ЭтоКоррРТУ Тогда
				Если СтрокаСуммаУслуги.СуммаДоИзменения <> СтрокаСуммаРасшифровки.СуммаДоИзменения
					ИЛИ СтрокаСуммаУслуги.СуммаНДСДоИзменения <> СтрокаСуммаРасшифровки.СуммаНДСДоИзменения Тогда
					//перезаполним суммы
					//Евросиб - АСуслов 05.03.2022 10:53:51 #
					//
					//(
					//СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделкиДоИзменения", СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения));
					СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделкиДоИзменения", ?(СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения = "", СтрокаСуммаУслуги.СтрокаДоходовСделки, СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения)));
					//)
					//Евросиб - АСуслов 05.03.2022 10:53:52 #
					СуммаПоСтроке = СтрокаСуммаУслуги.СуммаДоИзменения / СтрокиРасшифровки.Количество();
					СуммаНДСПоСтроке = СтрокаСуммаУслуги.СуммаНДСДоИзменения / СтрокиРасшифровки.Количество();
					ОстатокСумма = СтрокаСуммаУслуги.СуммаДоИзменения;
					ОстатокСуммаНДС = СтрокаСуммаУслуги.СуммаНДСДоИзменения;
					Для каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
						СтрокаРасшифровки.ЦенаДоИзменения = СуммаПоСтроке;
						СтрокаРасшифровки.СуммаДоИзменения = СуммаПоСтроке;
						СтрокаРасшифровки.СуммаНДСДоИзменения = СуммаНДСПоСтроке;
						ОстатокСумма = ОстатокСумма - СтрокаРасшифровки.СуммаДоИзменения;
						ОстатокСуммаНДС = ОстатокСуммаНДС - СтрокаРасшифровки.СуммаНДСДоИзменения;
					КонецЦикла; 
					Если ОстатокСумма <> 0 Тогда
						СтрокаРасшифровки.СуммаДоИзменения = СтрокаРасшифровки.СуммаДоИзменения + ОстатокСумма;
						СтрокаРасшифровки.ЦенаДоИзменения = СтрокаРасшифровки.СуммаДоИзменения;
					КонецЕсли; 
					Если ОстатокСуммаНДС <> 0 Тогда
						СтрокаРасшифровки.СуммаНДСДоИзменения = СтрокаРасшифровки.СуммаНДСДоИзменения + ОстатокСуммаНДС;
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец

// Евросиб US 82073 TA 114490 Рыбьяков К.А. 17.03.2026 ((
Процедура ЗаполнитьДанныеРелизаСобственника(КлючиСоставаПоезда = Неопределено, Сделка, ГуидДоходнойСтроки, РелизСобственника, СтруктураОтвет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
	|	РелизСобственникаНоминации.Ссылка.Сток КАК Сток,
	|	РелизСобственникаНоминации.КлючАналитики.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	|ПОМЕСТИТЬ ВТ_ДанныеРелиза
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.Ссылка В(&Релизы)
	|	И РелизСобственникаНоминации.КлючАналитики.КлючАналитикиСоставаПоезда В(&КлючиАналитикиСоставаПоезда)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи КАК СтокСдачи,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток
	|ПОМЕСТИТЬ ВТ_ТекущиеДанные
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
	|			&Дата,
	|			тек_Релиз В (&Релизы)
	|				И КТК В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеРелиза.Контейнер
	|					ИЗ
	|						ВТ_ДанныеРелиза)
	|				И тек_СтокСдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК стоки_ТекущиеДанныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ВТ_ДанныеРелиза.Контейнер КАК Контейнер,
	|	ВТ_ДанныеРелиза.Сток КАК ПунктОтправления,
	//|	ВТ_ДанныеРелиза.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
	|	ВТ_ТекущиеДанные.СтокСдачи КАК ПунктНазначения,
	|	МАКСИМУМ(ВТ_ТекущиеДанные.тек_ДатаСдачиВСток) КАК ДатаОтправки,
	|	ЗНАЧЕНИЕ(Справочник.Грузы.КонтейнерыУниверсальныеПорожниеСобственные) КАК Груз
	|ИЗ
	|	ВТ_ДанныеРелиза КАК ВТ_ДанныеРелиза
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	|		ПО ВТ_ДанныеРелиза.Контейнер = ВТ_ТекущиеДанные.КТК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекущиеДанные.СтокСдачи,
	//|	ВТ_ТекущиеДанные.тек_ДатаСдачиВСток,
	//|	ВТ_ДанныеРелиза.КлючАналитикиСоставаПоезда,
	|	ВТ_ДанныеРелиза.Сток
	//|	ВТ_ДанныеРелиза.Контейнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправки УБЫВ";
	
	Если ЗначениеЗаполнено(ГуидДоходнойСтроки) Тогда
		МассивКонтейнеров = ПолучитьКонтейнерыДоходнойСтроки(Сделка, ГуидДоходнойСтроки);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РелизСобственникаНоминации.КлючАналитики.КлючАналитикиСоставаПоезда В(&КлючиАналитикиСоставаПоезда)"
												, "И РелизСобственникаНоминации.Контейнер В(&Контейнеры)");
		Запрос.УстановитьПараметр("Контейнеры", МассивКонтейнеров);
	Иначе
		Запрос.УстановитьПараметр("КлючиАналитикиСоставаПоезда", КлючиСоставаПоезда);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Релизы", РелизСобственника);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтвет.ТаблицаДанных = Выгрузка;
	//СтруктураОтвет.ДатаДокумента = ?(Выгрузка.Количество() > 0, Выгрузка[0].ДатаОтправки, Дата("00010101"));
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 17.03.2026 ))

// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
Функция ПолучитьКонтейнерыДоходнойСтроки(Сделка, ГуидДоходнойСтроки)
	
	МассивКонтейнеров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаДоходыКТК.КТК КАК КТК
		|ИЗ
		|	Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
		|ГДЕ
		|	СделкаДоходыКТК.ГУИД = &ГУИД
		|	И СделкаДоходыКТК.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ГУИД", ГуидДоходнойСтроки);
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивКонтейнеровСтрокой = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.КТК, ";", Истина);
		Для Каждого КТКСтрокой Из МассивКонтейнеровСтрокой Цикл
			Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(Выборка.КТК, Ложь);
			Если Контейнер <> Неопределено Тогда
				МассивКонтейнеров.Добавить(Контейнер);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивКонтейнеров;
	
КонецФункции
// Евросиб Рыбьяков К.А. 18.03.2026 ))