
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//Евросиб Гудкова( 16.01.2020 Ticket№ можно менять в связи с акцептами
//	Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
//	Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();
// Евросиб Гудкова) 

	

	//// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )

	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
//Евросиб Гудкова( 15.12.2020 Ticket№ 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	Если Объект.СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
		НомерДатаЗаказаУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;
		НомерДатаЗаявкиУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаявка").НомерДатаВБУ;
	КонецЕсли;
	ВыборкаНомерДатаПТУУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(Объект.Ссылка, "УПП");
	НомерДатаПТУУПП = ВыборкаНомерДатаПТУУПП.НомерДатаВБУ;
	ПроведенВБУ = ВыборкаНомерДатаПТУУПП.ПроведенВБУ;
//ДИТ Давудов М.А. US 64830 15.04.2023 Начало
	Если ПроведенВБУ Тогда
		ДатаПроведенияВУПП = ВыборкаНомерДатаПТУУПП.ДатаОбмена;
	КонецЕсли;
//ДИТ Давудов М.А. US 64830 15.04.2023 Конец
	СтатусЭДО = ОбновитьСтатусЭДО(Объект.Ссылка);
	УстановитьДоступностьРазрешенияВыгрузкиВУПП();
	Если Объект.РазрешенаВыгрузкаВУПП Тогда
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = СтрШаблон("Разрешена выгрузка в 1С УПП (%1;%2)", Объект.РазрешилВыгрузкуВУПП, Объект.ДатаРазрешенияВыгрузкиВУПП);
	Иначе
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = "Разрешена выгрузка в 1С УПП";
	КонецЕсли;
	Элементы.ДатаПолученияОригинала.Доступность = Не Объект.Копия;
	
	// Евросиб Гудкова) 	
	
	// Шейко О.Е. 12.01.2020 Добавить ном и содержание:
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РазнестиУслугиАвтоматически();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Для каждого СтрУслуги из Объект.Услуги Цикл
		Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
			Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
				ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// ++ ДИТ Сгонник, 21-10-26 №27109
	РазрешитьРедактированиеСостоянияПТУ = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияПТУ",, Ложь);
    РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостоянияПТУ);
	// -- ДИТ Сгонник, 21-10-26 №27109
	//++ Глеков Д.В. Ticket#0247297 02.02.2022 
	//Евросиб - АСуслов 21.11.2022 10:25:42 #58550
	//(
	//Если Элементы.ВОчередиАвторазнесения.Доступность Тогда
	//
	//	Элементы.ВОчередиАвторазнесения.Доступность = Документы.Акцепт.ПоОснованиямВведеноСторно(РеквизитФормыВЗначение("Объект"));
	//
	//КонецЕсли;
	//-- Глеков Д.В. Ticket#0247297 02.02.2022 
	//)
	//Евросиб - АСуслов 21.11.2022 10:25:46 #58550
	
	//++ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022 
	УстановитьДоступностьЭлементаВОчередиАвторазнесения();
	//--ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022
	
	//++ДИТ Гаузер А.В. Ticket#0274990 15.08.2022
	Если Параметры.Ключ.Пустая() Тогда
		ПервичныйДокумент = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(Объект.ДокументПоступления, Истина);
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
    		Объект.ДатаПересчета = ПервичныйДокумент.ДатаВходящегоДокумента;
		КонецЕсли;
  	КонецЕсли;
  	Элементы.ДатаПересчета.Доступность = (РольДоступна("dc_РаботаСАкцептами")
									  ИЛИ РольДоступна("ПолныеПрава"));
	//--ДИТ Гаузер А.В. Ticket#0274990 15.08.2022

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	// ++ ДИТ_Агафонов_task 41390
	//У команд проставлены Изменяет данные: 
	//ОбновитьДетализацию РазнестиАвтоматически РазделитьСтроку
	//ОстатокОплатитьНаОснованииПТУ
	
	////Создана на форме группа ГруппаБлокировкаКорректировка
	//КорректировкаПоступления = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(Объект.Ссылка);
	//Элементы.ГруппаБлокировкаКорректировка.Видимость = ЗначениеЗаполнено(КорректировкаПоступления);	
	
	//Добавлены на форму данные КорректировкиДокумента
	//Добавлены элементы ГруппаКорректировкиДокумента 
	Документы.КорректировкаПоступления.ЗаполнитьСписокКорректировокПоступленияРекурсивно(Объект.Ссылка, КорректировкиДокумента);
	ЕстьКорректировки = КорректировкиДокумента.Количество()>0;
	Элементы.ГруппаКорректировкиДокумента.Видимость = ЕстьКорректировки; 
	Если ЕстьКорректировки Тогда
		Элементы.ПредупреждениеРедактирования.Заголовок = "Работа с документом должна происходить через документ исправления!";			
		Элементы.ПредупреждениеРедактирования.Видимость = Истина;	
		Если не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(КорректировкаПоступления);	
		КонецЕсли;	
	КонецЕсли;
	
	НастройкиВидимостиДоступностиОтВидаОперации();
	// -- ДИТ_Агафонов_task 41390
	//Евросиб - АСуслов 17.03.2023 13:29:00 #65868
	//(       
	Если Не ЗначениеЗаполнено(Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов) Тогда
		ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(Объект.ДатаПоступленияДокумента, Объект.ДоговорКонтрагента, Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	КонецЕсли;
	Элементы.СтатусДокумента.ТолькоПросмотр = Документы.ПоступлениеТоваровУслуг.ДоступностьСтатусаДокументаДляПользователя(Объект); 
	Элементы.ДатаПоступленияДокумента.ТолькоПросмотр = Документы.ПоступлениеТоваровУслуг.ДоступностьДатаПоступленияДляПользователя(Объект); 
	//Евросиб - АСуслов 16.03.2023 17:17:18 #65868
	//(                                              
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураДокументЗагруженИзВнешнегоИсточника = ЕСОбменСервер.ДокументЗагруженИзВнешнегоИсточника(Объект.Ссылка);
		Если СтруктураДокументЗагруженИзВнешнегоИсточника.ДокументЗагруженИзВнешнегоИсточника Тогда
			Элементы.ДатаПоступленияДокумента.ТолькоПросмотр = Истина;	
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 16.03.2023 17:17:19 #65868
	
	//)
	//Евросиб - АСуслов 17.03.2023 13:29:05 #65868 
	
	// Евросиб(ДИТ) US 93905 ТА 96654 Сержантова А.С. Начало: 27.12.2024
	Элементы.ПричинаОстановкиРаботы.Доступность = Пользователи.РолиДоступны(
			"ПолныеПрава,dc_РазрешитьУстанавливатьПричинуОстановкиРаботыНадДокументом",,Ложь);
	// Евросиб(ДИТ) US 93905 ТА 96654 Сержантова А.С. Конец: 27.12.2024
	
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//++ Глеков Д.В. Ticket#0247297 27.01.2022 
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//++ Глеков Д.В. Ticket#0247297 27.01.2022 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КорректировкаПоступления.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	//|ГДЕ
	//|	КорректировкаПоступления.Проведен = ИСТИНА
	//|	И КорректировкаПоступления.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	//|	И КорректировкаПоступления.ДокументПоступления = &ДокументПоступления";
	//Запрос.УстановитьПараметр("ДокументПоступления", ТекущийОбъект.Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//
	//	КорректировкаПоступления = Неопределено;
	//	Элементы.ВОчередиАвторазнесения.Доступность = ИСТИНА;
	//
	//Иначе
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	Выборка.Следующий();
	//	КорректировкаПоступления = Выборка.Ссылка;
	//	Элементы.ВОчередиАвторазнесения.Доступность = ЛОЖЬ;
	//
	//КонецЕсли;
	//-- Глеков Д.В. Ticket#0247297 27.01.2022
	//Евросиб - АСуслов 21.11.2022 11:46:53 #
	//(
	ВОчередиАвторазнесения = ПретензииИНеакцептыСервер.ДокументНаходитсяВОчередиАвторазнесения(ТекущийОбъект.Ссылка);
	//)
	//Евросиб - АСуслов 21.11.2022 11:47:03 #
		
КонецПроцедуры
//-- Глеков Д.В. Ticket#0247297 27.01.2022

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Комментарий = "Отказ" Тогда Отказ = Истина; КонецЕсли;
	Если ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.СчетФактураПолученный") 
		ИЛИ ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Элементы.Товары1КоличествоДоКорректировки.Видимость = Ложь;
		Элементы.Товары1СуммаДоКорректировки.Видимость = Ложь;
		Элементы.Товары1СуммаНДСДоКорректировки.Видимость = Ложь;
		Элементы.Товары1ЦенаДоКорректировки.Видимость = Ложь;
		Элементы.Товары1ВсегоДоКорректировки.Видимость = Ложь;
		//Элементы.Товары1КатегорияРасходовДоКорректировки.Видимость = Ложь;
		
		Элементы.Услуги1КоличествоДоКорректировки.Видимость = Ложь;
		Элементы.Услуги1СуммаДоКорректировки.Видимость = Ложь;
		Элементы.Услуги1СуммаНДСДоКорректировки.Видимость = Ложь;
		Элементы.Услуги1ЦенаДоКорректировки.Видимость = Ложь;
		Элементы.Услуги1ВсегоДоКорректировки.Видимость = Ложь;
		//Элементы.Услуги1КатегорияРасходовДоКорректировки.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Товары.Количество() = 0 Тогда
		Элементы.Товары.Видимость = Ложь;
	Иначе
		Для каждого СтрТЧ из Объект.Товары Цикл
			 БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
		КонецЦикла;
		РассчитатьСуммыВсегоДоИзменения("Товары");
	КонецЕсли;
	Если Объект.Услуги.Количество() = 0 Тогда
		Элементы.Услуги.Видимость = Ложь;
	Иначе
		Для каждого СтрТЧ из Объект.Услуги Цикл
			 БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
		КонецЦикла;
		РассчитатьСуммыВсегоДоИзменения("Услуги");
	КонецЕсли;
	Элементы.Валюта.Заголовок = Объект.ВалютаДокумента;
//	Отбор = Новый Структура("ПометкаУдаления", Ложь);
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект, "СчетФактураПолученный");//, Отбор);
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.СчетФактураНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
//Евросиб Гудкова( 04.02.2021 Ticket№0218691 
		НомерВСФ = РеквизитыСФ.НомерВходящегоДокумента;
		ДатаВСФ = РеквизитыСФ.ДатаВходящегоДокумента;
// Евросиб Гудкова) 		
	КонецЕсли;
	Если ЭтоИсправление(Объект.ВидОперации) Тогда
		Элементы.Группа6.Видимость = Истина;
	КонецЕсли;

	УстановитьВидимостьКолонокНДС();
	
	//Евросиб Гудкова( 02.02.2020 
	УстановитьВидимостьЭлементовКорректировки();
	// Евросиб Гудкова) 	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		РассчитатьСуммыВсегоПоДокументу();
		
	КонецЕсли;

	Для каждого СтрУслуги Из Объект.Услуги Цикл
	
		СтрУслуги.ИмеютсяИзменения = СтрУслуги.РазницаСуммаКорректировки <> 0 ИЛИ СтрУслуги.РазницаСуммаНДСКорректировки <> 0;
	
	КонецЦикла; 
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	//СобратьИтогиПоДокументу_ВычислитьЗагОстатков();
	СобратьИтогиПоДокументу();
	ВычислитьЗаголовокОстатков();
	//Евросиб Каблов 02.09.2024 )
	
	//++ Зубов US45321 TA45322 27.01.2022
	ЗаполнитьПричинуВозврата();
	//-- Зубов US45321 TA45322 27.01.2022
КонецПроцедуры

//Евросиб Каблов 02.09.2024 Ticket#0360646
//СобратьИтогиПоДокументу_ВычислитьЗагОстатков()
&НаКлиенте
Процедура СобратьИтогиПоДокументу()

	СуммаДоКорректировки = Объект.Услуги.Итог("СуммаДоКорректировки");
	СуммаНДС_ДоКорректировки = Объект.Услуги.Итог("СуммаНДСДоКорректировки");
	
	КоличествоДоИзм = Объект.Услуги.Итог("КоличествоДоИзменения");
	КоличествоПосле = Объект.Услуги.Итог("Количество");
	
	СуммаДоИзм 		= Объект.Услуги.Итог("СуммаДоИзменения");
	СуммаНДСДоИзм 	= Объект.Услуги.Итог("СуммаНДСДоИзменения");
	
	//Евросиб Каблов 21.12.2021 ( Ticket#0253815
	//ОбщСуммаДоКорректировки = СуммаДоКорректировки + СуммаДоИзм;
	//ОбщСуммаНДС_ДоКорректировки = СуммаНДС_ДоКорректировки + СуммаНДСДоИзм;
	ОбщСуммаДоКорректировки = ?(СуммаДоКорректировки = 0, СуммаДоИзм, СуммаДоКорректировки);
	ОбщСуммаНДС_ДоКорректировки = ?(СуммаНДС_ДоКорректировки = 0, СуммаНДСДоИзм, СуммаНДС_ДоКорректировки);
	//Евросиб Каблов 21.12.2021 )
	
	СуммаПослеКорректировки = Объект.Услуги.Итог("Сумма");
	СуммаНДС_ПослеКорректировки = Объект.Услуги.Итог("СуммаНДС");
	
	РазницаВсегоКорректировкиИтог	= Объект.Услуги.Итог("РазницаВсегоКорректировки");
	РазницаСуммаНДСКорректировкиИтог= Объект.Услуги.Итог("РазницаСуммаНДСКорректировки");
	РазницаСуммаКорректировкиИтог 	= Объект.Услуги.Итог("РазницаСуммаКорректировки");
	
	//Евросиб Каблов 21.12.2021 ( Ticket#0253815
	//СуммаРазница 	= СуммаПослеКорректировки - (СуммаДоКорректировки + СуммаДоИзм);
	//СуммаНДСРазница = СуммаНДС_ПослеКорректировки - (СуммаНДС_ДоКорректировки + СуммаНДСДоИзм);
	СуммаРазница 	= Объект.Услуги.Итог("РазницаСуммаКорректировки");
	СуммаНДСРазница= Объект.Услуги.Итог("РазницаСуммаНДСКорректировки");
	//Евросиб Каблов 21.12.2021 )
	
	ВсегоДоКорр 	= ?(Объект.Услуги.Итог("ВсегоДоКорректировки")=0, Объект.Услуги.Итог("ВсегоДоИзменения"), Объект.Услуги.Итог("ВсегоДоКорректировки"));
	ВсегоПослеКорр 	= Объект.Услуги.Итог("Всего");
	
	//Евросиб Каблов 21.12.2021 ( Ticket#0253815
	//ОбщаяРазность = ВсегоПослеКорр - ВсегоДоКорр;	
	ОбщаяРазность	= Объект.Услуги.Итог("РазницаВсегоКорректировки");	
	//Евросиб Каблов 21.12.2021 )
	
КонецПроцедуры

//Евросиб Каблов 02.09.2024 Ticket#0360646
//СобратьИтогиПоДокументу_ВычислитьЗагОстатков()
&НаКлиенте
Процедура ВычислитьЗаголовокОстатков()
	
	//// Расчет остатка
	СчетаПоставщиковСумма = Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	
	//Евросиб Каблов 07.04.2025 ( #0389958
	//СуммаКотораяДолжнаБытьВ_СвязанныеСчетаПоставщиков = Объект.СуммаДокумента - ВсегоДоКорр;
	СуммаКотораяДолжнаБытьВ_СвязанныеСчетаПоставщиков = Объект.ПолнаяСуммаВСФ - ВсегоДоКорр;
	//Евросиб Каблов 07.04.2025 )
	
	Если СчетаПоставщиковСумма <> СуммаКотораяДолжнаБытьВ_СвязанныеСчетаПоставщиков Тогда
		Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + (СуммаКотораяДолжнаБытьВ_СвязанныеСчетаПоставщиков-СчетаПоставщиковСумма) + ") оплатить на основании ПТУ";
	Иначе
		Элементы.СвязанныеСчетаПоставщиковОстатокОплатитьНаОснованииПТУ.Заголовок = "Остаток (" + 0 + ") оплатить на основании ПТУ";
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЭтоИсправление(Операция)
	Если Операция = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммыВсегоДоИзменения(ТЧ)
	
	Для Каждого СтрТЧ из Объект[ТЧ] Цикл
		
		Если СтрТЧ.ВсегоДоКорректировки <> СтрТЧ.СуммаДоКорректировки + ?(Объект.СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоКорректировки)
			ИЛИ СтрТЧ.ВсегоДоИзменения <> СтрТЧ.СуммаДоИзменения + ?(Объект.СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоИзменения) Тогда
		
			ЭтаФорма.Модифицированность = Истина;
			
			СтрТЧ.ВсегоДоКорректировки = СтрТЧ.СуммаДоКорректировки + ?(Объект.СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоКорректировки);
			СтрТЧ.ВсегоДоИзменения = СтрТЧ.СуммаДоИзменения + ?(Объект.СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоИзменения);		
		
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокНДС()
	
	Если Не Объект.УчитыватьНДС Тогда
		Элементы.Товары1СтавкаНДС.Видимость = Ложь;
		Элементы.Товары1СуммаНДС.Видимость = Ложь;
		Элементы.Услуги1СтавкаНДС.Видимость = Ложь;
		Элементы.Услуги1СуммаНДС.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВсегоПоДокументу()
	
	ИтогоНДС = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("СуммаНДС"),0)+?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("СуммаНДС"),0);
	ИтогоВсего = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("Сумма"),0)+ ?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("Сумма"),0)+?(Объект.СуммаВключаетНДС,0,ИтогоНДС);
	
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586 
	//Попытка
	//	Объект.СуммаДокумента = ИтогоВсего;
	//	Объект.СуммаНДСДокумента = ИтогоНДС;
	//Исключение
	//	// недостаточно прав для обновления полей
	//КонецПопытки;
	//Евросиб Каблов 12.05.2021 )
	
	Элементы.Валюта.Заголовок = Объект.ВалютаДокумента;
	
КонецПроцедуры

//Евросиб Каблов 12.05.2021 Ticket#0230586
&НаКлиенте
Процедура РассчитатьСуммыДокумента()
	
	Объект.СуммаНДСДокумента = Объект.Товары.Итог("СуммаНДС") + Объект.Услуги.Итог("СуммаНДС");
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + ?(Объект.СуммаВключаетНДС, 0, Объект.СуммаНДСДокумента);
	
	Объект.ПолнаяСуммаВСФ = Объект.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	Для каждого СтрТЧ из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого СтрТЧ из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Если Объект.Товары.Количество()>0 Тогда 
		РассчитатьСуммыВсегоДоИзменения("Товары");
	ИначеЕсли Объект.Услуги.Количество()>0 Тогда
		РассчитатьСуммыВсегоДоИзменения("Услуги");
	КонецЕсли;
	РассчитатьСуммыВсегоПоДокументу();
	
	ОбновитьДетализацию(Неопределено);
	
	Для каждого СтрУслуги Из Объект.Услуги Цикл
	
		СтрУслуги.ИмеютсяИзменения = СтрУслуги.РазницаСуммаКорректировки <> 0 ИЛИ СтрУслуги.РазницаСуммаНДСКорректировки <> 0;
	
	КонецЦикла; 
	
	//++ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022  
	УстановитьДоступностьЭлементаВОчередиАвторазнесения();
	//--ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022

КонецПроцедуры

&НаКлиенте
Процедура Товары1КоличествоПриИзменении(Элемент)
	
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )

КонецПроцедуры

&НаКлиенте
Процедура Товары1ЦенаПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.Товары1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
КонецПроцедуры

&НаКлиенте
Процедура Товары1СтавкаНДСПриИзменении(Элемент)
	
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )

КонецПроцедуры

&НаКлиенте
Процедура Услуги1КоличествоПриИзменении(Элемент)
	
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные; 
	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022 
	//Попытка решить "проблему копеек"
	//БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	Если СтрТЧ.КоличествоДоИзменения > 0 Тогда
		СтрТЧ.Сумма = СтрТЧ.СуммаДоИзменения * (СтрТЧ.Количество/СтрТЧ.КоличествоДоИзменения); 
	Иначе
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	КонецЕсли;
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	
	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(СтрТЧ.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ЦенаПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.Услуги1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(СтрТабЧасти.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СтавкаНДСПриИзменении(Элемент)
	
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	
	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(СтрТЧ.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )

КонецПроцедуры

&НаКлиенте
Процедура СчФНадписьНажатие(Элемент)
	
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
	Отбор = Новый Структура("ПометкаУдаления", Ложь) ;  // Шейко О.Е. (25.01.2021) Не работаем с помеченной на удаление счет фактурой
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураПолученный", Отбор);
	Если РеквизитыСФ <> Неопределено и ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Документ был изменен, будет выполнена запись документа с актуализацией данных подчиненной счет-фактуры. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);	
	КонецЕсли;
	Если РеквизитыСФ = Неопределено И Этаформа.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед созданием счет-фактуры документ необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	ИначеЕсли РеквизитыСФ = Неопределено Тогда
		ОбработкаВопросаЗаписи(КодВозвратаДиалога.Да, Истина);
	КонецЕсли;	
	Если РеквизитыСф <> Неопределено и Не ЭтаФорма.Модифицированность Тогда
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаписатьДокументКорректировкиПоступления();
	КонецЕсли;
	Отбор = Новый Структура("ПометкаУдаления", Ложь) ; // Шейко О.Е. (25.01.2021) Не работаем с помеченной на удаление счет фактурой
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ВвестиСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный",Отбор);
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураПолученный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.СчетФактураНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	КонецЕсли;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураПолученный");
	
	////////////////////////
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументКорректировкиПоступления()
	ЭтотОбъект.Записать();	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Объект.Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(Объект.ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )

КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 02.09.2024 )
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		// Евросиб Фролов (02.12.2021 Task №43242
		//Евросиб Каблов 12.08.2022 ( Task 55578
		//ПараметрыДокумента = Новый Структура("Ссылка, Организация, Контрагент, ДоговорКонтрагента, Штраф, Копия, ЦФО, КратностьВзаиморасчетов, КурсВзаиморасчетов, Автор, Дата, Услуги");
		ПараметрыДокумента = Новый Структура("Ссылка, Организация, Контрагент, ДоговорКонтрагента, Штраф, Копия, ЦФО, КратностьВзаиморасчетов, КурсВзаиморасчетов, Автор, Дата, Услуги, ВидУслуг");
		//Евросиб Каблов 12.08.2022 )
		ЗаполнитьЗначенияСвойств(ПараметрыДокумента, Объект);
		МаршрутизироватьДокументНаСервере(ПараметрыДокумента);
		ОбновитьПанельСостояний();
				
		// Код ниже закомментировал
//		ПараметрыЗапроса = Новый Соответствие;
//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
//		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
////Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
//		ПараметрыЗапроса.Вставить("Копия", Объект.Копия);
//		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
//// Евросиб Гудкова)
//		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
//		ВсегоДоКорректировки 	= ?(Объект.Услуги.Итог("ВсегоДоКорректировки")=0, Объект.Услуги.Итог("ВсегоДоИзменения"), Объект.Услуги.Итог("ВсегоДоКорректировки"));
//		ВсегоПослеКорректировки 	= Объект.Услуги.Итог("Всего");	
//		СуммаКорректировки = ВсегоПослеКорректировки - ВсегоДоКорректировки;
//		ПараметрыЗапроса.Вставить("СуммаДокумента", СуммаКорректировки / Объект.КратностьВзаиморасчетов * Объект.КурсВзаиморасчетов);
//		//Евросиб Каблов 16.08.2021 )
//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Объект.Дата);
//		Если РезультатЗапроса.Количество() > 0 Тогда
//			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
//		Иначе
//			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
//		КонецЕсли;
//		
//		ОбновитьПанельСостояний();
	// Евросиб Фролов)
	КонецЕсли;
	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//	ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
	//	ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//Объект.ДатаПересчета = Объект.Дата; //ДИТ Гаузер А.В. Ticket#0274990 19.08.2022
	Результат = ПолучитьКурсВалюты();
	Объект.КурсВзаиморасчетов = Результат.Курс;
	Объект.КратностьВзаиморасчетов = Результат.Кратность;

КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты()
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.ДатаПересчета);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДатаПересчетаПриИзменении(Элемент)
	Результат = ПолучитьКурсВалюты();
	Объект.КурсВзаиморасчетов = Результат.Курс;
	Объект.КратностьВзаиморасчетов = Результат.Кратность;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент) 
	// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. Начало: 10.01.2025
	ОбработкаИзмененияРеквизитовУчетаНДС();
	// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. Конец: 10.01.2025
	УстановитьВидимостьКолонокНДС();
КонецПроцедуры

//Евросиб Гудкова( 02.02.2020
&НаКлиенте
Процедура СвязанныеСчетаПоставщиковПриИзменении(Элемент)
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	//СобратьИтогиПоДокументу_ВычислитьЗагОстатков();
	СобратьИтогиПоДокументу();
	ВычислитьЗаголовокОстатков();
	//Евросиб Каблов 02.09.2024 )
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеСчетаПоставщовСчетПоставщикаПриИзменении(Элемент)
	
	ТекД = Элементы.СвязанныеСчетаПоставщиков.ТекущиеДанные;
	СуммаТаблицыПривязанныхСчетов = 0;
	Для каждого Стр из Объект.СвязанныеСчетаПоставщиков Цикл
		СуммаТаблицыПривязанныхСчетов = СуммаТаблицыПривязанныхСчетов + Стр.СуммаНаПТУ;
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекД.СчетПоставщика) Тогда
		ПолученнаяСуммаСчета = ПолучитьСуммуСчета(ТекД.СчетПоставщика);
		ТекД.СуммаНаПТУ = Макс(Мин(ПолученнаяСуммаСчета, Объект.СуммаДокумента - Объект.Услуги.Итог("СтрУслуги.ВсегоДоИзменения") - СуммаТаблицыПривязанныхСчетов), 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокОплатитьНаОснованииПТУ(Команда)
	
	СчетаПоставщиковСумма = Объект.СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	ОтнесеннаяСуммаОтнесенныхСчетов = 0;
	Для каждого Стр из Объект.СвязанныеСчетаПоставщиков Цикл
		Если ЗначениеЗаполнено(Стр.СчетПоставщика) Тогда ОтнесеннаяСуммаОтнесенныхСчетов = ОтнесеннаяСуммаОтнесенныхСчетов + Стр.СуммаНаПТУ; КонецЕсли;
	КонецЦикла;
	
	//Евросиб Каблов 07.04.2025 ( #0389958
	//Если (Объект.СуммаДокумента - Объект.Услуги.Итог("ВсегоДоИзменения") - ОтнесеннаяСуммаОтнесенныхСчетов) = 0 Тогда Возврат; КонецЕсли;
	Если (Объект.ПолнаяСуммаВСФ - Объект.Услуги.Итог("ВсегоДоИзменения") - ОтнесеннаяСуммаОтнесенныхСчетов) = 0 Тогда Возврат; КонецЕсли;
	//Евросиб Каблов 07.04.2025 )
	
	МассивНС = Объект.СвязанныеСчетаПоставщиков.НайтиСтроки(Новый Структура("СчетПоставщика", ПредопределенноеЗначение("Документ.СчетНаОплатуПоставщика.ПустаяСсылка")));
	Для каждого Стр из МассивНС Цикл
		Объект.СвязанныеСчетаПоставщиков.Удалить(Стр);
	КонецЦикла;
	
	//Евросиб Каблов 07.04.2025 ( #0389958
	//Если СчетаПоставщиковСумма <> Объект.СуммаДокумента Тогда
	Если СчетаПоставщиковСумма <> Объект.ПолнаяСуммаВСФ Тогда
	//Евросиб Каблов 07.04.2025 )
	
		НСтр = Объект.СвязанныеСчетаПоставщиков.Добавить();
		//Евросиб Каблов 07.04.2025 ( #0389958
		//НСтр.СуммаНаПТУ = Объект.СуммаДокумента - Объект.Услуги.Итог("ВсегоДоИзменения") - ОтнесеннаяСуммаОтнесенныхСчетов;
		НСтр.СуммаНаПТУ = Объект.ПолнаяСуммаВСФ - Объект.Услуги.Итог("ВсегоДоИзменения") - ОтнесеннаяСуммаОтнесенныхСчетов;
		//Евросиб Каблов 07.04.2025 )
		
		//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
		НСтр.СчетПоставщика = ПолучитьСчетПредыдущегоДокумента( Объект.ДокументПоступления );
		//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, конец
	КонецЕсли; 
	 
	//НСтр = Объект.СвязанныеСчетаПоставщиков.Добавить();
	//НСтр.СуммаНаПТУ = Объект.СуммаДокумента - Объект.Услуги.Итог("ВсегоДоИзменения") - ОтнесеннаяСуммаОтнесенныхСчетов;
		
	СвязанныеСчетаПоставщиковПриИзменении(Неопределено);
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
&НаСервереБезКонтекста
Функция ПолучитьСчетПредыдущегоДокумента( ДокументПоступления )
	Возврат Документы.КорректировкаПоступления.ПолучитьСчетПредыдущегоДокумента( ДокументПоступления )
КонецФункции
//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, конец

&НаКлиенте
Процедура РазнестиАвтоматически(Команда)
	
	РазнестиАвтоматическиНаСервере();
	ОбновитьДетализацию(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура РазнестиАвтоматическиНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РазнестиУслугиАвтоматически();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДетализацию(Команда)
	
	Если Команда <> неопределено Тогда //заполнение по кнопке
		
		Объект.СвязьУслугИСчетов.Очистить();
		
		Для каждого СтрУслуги из Объект.Услуги Цикл
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
				СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			СтрНайдена = Ложь;
			Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
				Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
					ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание");
					СтрНайдена = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ СтрНайдена Тогда
				
				//Евросиб Каблов 16.09.2021 ( Ticket#0243069
				//Если (СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоИзменения=0, СтрУслуги.ВсегоДоКорректировки, СтрУслуги.ВсегоДоИзменения)) <> 0 Тогда
				ВсегоКорр = СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоКорректировки = 0, СтрУслуги.ВсегоДоИзменения, СтрУслуги.ВсегоДоКорректировки);
				
				Если ВсегоКорр <> 0 Тогда
				//Евросиб Каблов 16.09.2021 )
				
					НСтр = Объект.СвязьУслугИСчетов.Добавить();
					ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Номенклатура,Содержание,ГУИДПТУ,СтавкаНДС");
					//Евросиб Каблов 16.09.2021 ( Ticket#0243069
					//НСтр.Всего = СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоКорректировки = 0, СтрУслуги.ВсегоДоИзменения, СтрУслуги.ВсегоДоКорректировки);
					НСтр.Всего = ВсегоКорр;
					//Евросиб Каблов 16.09.2021 )
					НСтр.ОтнесеннаяСумма = НСтр.Всего;
					//Евросиб Каблов 16.09.2021 ( Ticket#0243069
					//НСтр.СуммаНДС 			= СтрУслуги.СуммаНДС - СтрУслуги.СуммаНДСДоИзменения;
					НСтр.СуммаНДС 			= СтрУслуги.СуммаНДС - ?(СтрУслуги.СуммаНДСДоКорректировки = 0, СтрУслуги.СуммаНДСДоИзменения, СтрУслуги.СуммаНДСДоКорректировки);
					//КонецЕсли;
					//Евросиб Каблов 16.09.2021 )
				
				КонецЕсли; 
				//НСтр.Всего = СтрУслуги.Всего;
				//НСтр.СуммаНДС = СтрУслуги.СуммаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе //обновление отображения
		
		Для каждого СтрУслуги из Объект.Услуги Цикл
			Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
				Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
					ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуСчета(СчетПоставщика)
	
	Рез = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПривязанныеСчетаПоставщиковОстатки.ПолнаяСуммаСчетаОстаток - ПривязанныеСчетаПоставщиковОстатки.ПривязаннаяСуммаОстаток КАК ОсталосьПривязать
	               |ИЗ
	               |	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(, СчетПоставщика = &СчетПоставщика) КАК ПривязанныеСчетаПоставщиковОстатки";
	Запрос.УстановитьПараметр("СчетПоставщика", СчетПоставщика);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Рез = Ответ.ОсталосьПривязать;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовКорректировки()

	ЭтоКорректировка = ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления");
	Элементы.Услуги1ВсегоДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1КоличествоДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1СодержаниеДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1СтавкаНДСДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1СуммаДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1СуммаНДСДоИзменения.Видимость = Не ЭтоКорректировка;
	Элементы.Услуги1ЦенаДоИзменения.Видимость = Не ЭтоКорректировка;
	
	Элементы.Услуги1ВсегоДоКорректировки.Видимость = ЭтоКорректировка;
	Элементы.Услуги1КоличествоДоКорректировки.Видимость = ЭтоКорректировка;
	Элементы.Услуги1СуммаДоКорректировки.Видимость = ЭтоКорректировка;
	Элементы.Услуги1СуммаНДСДоКорректировки.Видимость = ЭтоКорректировка;
	Элементы.Услуги1ЦенаДоКорректировки.Видимость = ЭтоКорректировка;
	
КонецПроцедуры // УстановитьВидимостьЭлементовКорректировки()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Евросиб Каблов 22.08.2022 ( US55531
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") И Не Объект.КорректироватьСуммыВПервичномВСФ Тогда
	//	Если Объект.ВОчередиАвторазнесения Тогда
	//		ОбщегоНазначенияКлиент.СообщитьПользователю("Корректировочный ВСФ необходимо разносить вручную. Постановка на авторазнесение запрещена.",,,, Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	//Евросиб Каблов 22.08.2022 )
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
		ПараметрыЗапроса.Вставить("Копия", Объект.Копия);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова)
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		ВсегоДоКорректировки 	= ?(Объект.Услуги.Итог("ВсегоДоКорректировки")=0, Объект.Услуги.Итог("ВсегоДоИзменения"), Объект.Услуги.Итог("ВсегоДоКорректировки"));
		ВсегоПослеКорректировки 	= Объект.Услуги.Итог("Всего");	
		СуммаКорректировки = ВсегоПослеКорректировки - ВсегоДоКорректировки;
		//Евросиб Каблов 12.08.2022 ( Task 55578
		Если Объект.КратностьВзаиморасчетов * Объект.КурсВзаиморасчетов <> 0 Тогда
			ПараметрыЗапроса.Вставить("СуммаДокумента", СуммаКорректировки / Объект.КратностьВзаиморасчетов * Объект.КурсВзаиморасчетов);
		Иначе
			ПараметрыЗапроса.Вставить("СуммаДокумента", 0);
		КонецЕсли;
		//Евросиб Каблов 12.08.2022 )
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		ПараметрыЗапроса.Вставить("ВидУслуг", Объект.ВидУслуг);
		//Евросиб Каблов 12.08.2022 )
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	Объект.Ссылка.Штраф <> Объект.Штраф ИЛИ 
	Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуКонтурЭДОНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_Документы.BoxId КАК BoxId,
	|	Диадок_Документы.DocumentId КАК DocumentId,
	|	Диадок_Документы.LetterId КАК LetterId
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		//ШаблонАдрес = "https://diadoc.kontur.ru/%1/Document/Show?letterId=%2&documentId=%3";
		ШаблонАдрес = Константы.ШаблонАдресаДокументаВДиадок.Получить();
		Адрес = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонАдрес,
																		Выборка.BoxId,
																		Выборка.LetterId,
																		Выборка.DocumentId);
																		
	Иначе
		Адрес = Неопределено;																
	КонецЕсли;
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура ОткрытьВКонтурЭДО(Команда)
	АдресСсылки = ПолучитьСсылкуКонтурЭДОНаСервере();
	Если АдресСсылки = Неопределено Тогда
		Сообщить("Не удалось сгенерировать ссылку для открытия документа на сайте Контур.Диадок");
		Возврат;
	КонецЕсли; 
	ЗапуститьПриложение(АдресСсылки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСтатусЭДО(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_Документы.Документ КАК Документ,
	|	Диадок_Документы.Статус КАК Статус
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ =&Документ";
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе	
		Возврат "";
	КонецЕсли; 	

КонецФункции // ОбновитьСтатусЭДО()

&НаСервере
Процедура УстановитьДоступностьРазрешенияВыгрузкиВУПП()
	
	ДоступностьФлажка = КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСАкцептами");
	
	Если ДоступностьФлажка Тогда
		ДоступностьФлажка = ПоступлениеДоступноДляВыгрузкиВУПП();
	КонецЕсли;
	
	Элементы.РазрешенаВыгрузкаВУПП.Доступность = ДоступностьФлажка;
	
КонецПроцедуры

&НаСервере
Функция ПоступлениеДоступноДляВыгрузкиВУПП()
	
	Если Не Объект.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтранаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
	ЭтоРезидент = СтранаКонтрагента = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Если ЭтоРезидент Тогда
		ДоступноДляВыгрузки = Не Объект.Копия;
	Иначе
		ДоступноДляВыгрузки = Истина;
	КонецЕсли;
	
	Возврат ДоступноДляВыгрузки;
		
КонецФункции

&НаКлиенте
Процедура РазрешенаВыгрузкаВУПППриИзменении(Элемент)
	
	Если Объект.РазрешенаВыгрузкаВУПП Тогда
		Объект.РазрешилВыгрузкуВУПП = ПользователиКлиент.ТекущийПользователь();
		Объект.ДатаРазрешенияВыгрузкиВУПП = ТекущаяДата();
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = СтрШаблон("Разрешена выгрузка в 1С УПП (%1;%2)", Объект.РазрешилВыгрузкуВУПП, Объект.ДатаРазрешенияВыгрузкиВУПП);
	Иначе
		Объект.РазрешилВыгрузкуВУПП = Неопределено;		
		Объект.ДатаРазрешенияВыгрузкиВУПП = '00010101';
		Элементы.РазрешенаВыгрузкаВУПП.Заголовок = "Разрешена выгрузка в 1С УПП";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ПриИзменении(Элемент)
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	//СобратьИтогиПоДокументу_ВычислитьЗагОстатков();
	СобратьИтогиПоДокументу();
	//Евросиб Каблов 02.09.2024 )
	

	// ++ ДИТ_Агафонов_task 41390 29.01.2023 ИсправлениеПервичкиИзменениеЗаполненияСвязьУслугИСчетов
	//Добавляем как в поступлении, чтобы сразу пересчитывалось при изменении количества
	Объект.СвязьУслугИСчетов.Очистить();
	ОбновитьДетализацию(1);
	РазнестиАвтоматически(неопределено);
	// -- ДИТ_Агафонов_task 41390 29.01.2023
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СписокТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТС", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТС, СоставТС", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТС),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СписокТЕНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТЕ, СоставТЕ", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТЕ),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СписокТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТД", Истина));
	//ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
	ДатаВходящегоДокументаПТУ = ПолучитьДатуВходящегоДокументаПТУ();
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД, ДатаПоискаТранпортныхДокументов", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД, ДатаВходящегоДокументаПТУ),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаСервере
Функция ПолучитьДатуВходящегоДокументаПТУ()
	ДокПоступления = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(Объект.Ссылка);
	ДокПоступления_ДатаВходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокПоступления, "ДатаВходящегоДокумента");
 	Возврат ДокПоступления_ДатаВходящегоДокумента;
КонецФункции	
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр2.Свойство("ТС") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТС = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТЕ") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТЕ = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТД") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + ПолучитьКодТД(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТД = ЭТС;
		
	КонецЕсли;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец     

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало 
&НаСервереБезКонтекста
Функция ПолучитьКодТД(ТД)
	Результат = "";
	Если ТипЗнч(ТД) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		Результат = ТД.НомерТранспортногоДокумента;
	КонецЕсли;
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	//СобратьИтогиПоДокументу_ВычислитьЗагОстатков();
	СобратьИтогиПоДокументу();
	//Евросиб Каблов 02.09.2024 )
	
	
	// Шейко О.Е. 12.01.2020 Добавить ном и содержание:
	Если ТекущаяСтраница = Элементы.ГруппаДетализацияУслугПоСчетам Тогда
	
		ПерезаполнитьНомИСодержание();
		
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаСчетаОтнесенныеНаПТУ Тогда 
		ВычислитьЗаголовокОстатков();
	//Евросиб Каблов 02.09.2024 )
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНомИСодержание()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РазнестиУслугиАвтоматически();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Для каждого СтрУслуги из Объект.Услуги Цикл
		Для каждого СтрСвязи из Объект.СвязьУслугИСчетов Цикл
			Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
				ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги, "Номенклатура,Содержание");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Евросиб Гудкова) 

// Шейко О.Е. 11.01.2021

////// ПОЛЕ РазницаВсегоКорр
&НаКлиенте
Процедура Услуги1РазницаВсегоКорректировкиПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Услуги1РазницаВсегоКорректировкиПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
КонецПроцедуры

&НаСервере
Процедура Услуги1РазницаВсегоКорректировкиПриИзмененииНаСервере(ИДРедСтроки)
	// ИЗМЕНЕНИЕ РазницаВсегоКорректировки
	ТекСтр = Объект.Услуги.НайтиПоИдентификатору(ИДРедСтроки);
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоКорректировки) Тогда
	
		ТекСтр.Всего = ТекСтр.ВсегоДоКорректировки + ТекСтр.РазницаВсегоКорректировки;
		
		ТекСтр.РазницаСуммаНДСКорректировки = 0;
		
		// Разобьем согласно НДСу:
		Если Объект.СуммаВключаетНДС Тогда
			
			ТекСтр.Сумма = ТекСтр.Всего;
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, ИСТИНА);
			
		Иначе
			
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, Истина);
			ТекСтр.Сумма = ТекСтр.Всего - ТекСтр.СуммаНДС;
			
		КонецЕсли; 
		
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоКорректировки;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоКорректировки;
			
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоИзменения) Тогда
	
		ТекСтр.Всего = ТекСтр.ВсегоДоИзменения + ТекСтр.РазницаВсегоКорректировки;
		
		ТекСтр.РазницаСуммаНДСКорректировки = 0;
		
		// Разобьем согласно НДС-у:
		Если Объект.СуммаВключаетНДС Тогда
			
			ТекСтр.Сумма = ТекСтр.Всего;
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, ИСТИНА);
			
		Иначе
			
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, Истина);
			ТекСтр.Сумма = ТекСтр.Всего - ТекСтр.СуммаНДС;
			
		КонецЕсли; 
		
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоИзменения;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоИзменения;
			
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
	
	КонецЕсли; 
	
КонецПроцедуры

////// ПОЛЕ ВСЕГО
&НаКлиенте
Процедура Услуги1ВсегоПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Услуги1ВсегоПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
КонецПроцедуры

&НаСервере
Процедура Услуги1ВсегоПриИзмененииНаСервере(ИДРедСтроки)
	// ИЗМЕНЕНИЕ ВСЕГО
	ТекСтр = Объект.Услуги.НайтиПоИдентификатору(ИДРедСтроки);
	
	ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, ИСТИНА);
	
	Если Объект.СуммаВключаетНДС Тогда
	
		ТекСтр.Сумма = ТекСтр.Всего;
	
	Иначе
	
		ТекСтр.Сумма = ТекСтр.Всего - ТекСтр.СуммаНДС;
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоКорректировки) Тогда
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоКорректировки;
		
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоКорректировки;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоКорректировки;
		
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоИзменения) Тогда
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоИзменения;
		
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоИзменения;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоИзменения;
		
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
	
	КонецЕсли; 
	
КонецПроцедуры

////// ПОЛЕ РазницаСуммаКорр
&НаКлиенте
Процедура Услуги1РазницаСуммаКорректировкиПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Услуги1РазницаСуммаКорректировкиПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
КонецПроцедуры

&НаСервере
Процедура Услуги1РазницаСуммаКорректировкиПриИзмененииНаСервере(ИДРедСтроки)
	// ИЗМЕНЕНИЕ СУММЫ КОРРЕКТИРОВКИ
	ТекСтр = Объект.Услуги.НайтиПоИдентификатору(ИДРедСтроки);
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоКорректировки) Тогда
	
		ТекСтр.Сумма = ТекСтр.СуммаДоКорректировки + ТекСтр.РазницаСуммаКорректировки;
		
		ТекСтр.РазницаСуммаНДСКорректировки = 0;
		
		// Разобьем согласно НДСу:
		Если Объект.СуммаВключаетНДС Тогда
			
			ТекСтр.Всего = ТекСтр.Сумма;
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, ИСТИНА);
			
		Иначе
			
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, Истина);
			ТекСтр.Всего = ТекСтр.Сумма + ТекСтр.СуммаНДС;
			
		КонецЕсли; 
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоКорректировки;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоКорректировки;
			
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоИзменения) Тогда
	
		ТекСтр.Сумма = ТекСтр.СуммаДоИзменения + ТекСтр.РазницаСуммаКорректировки;
		
		ТекСтр.РазницаСуммаНДСКорректировки = 0;
		
		// Разобьем согласно НДС-у:
		Если Объект.СуммаВключаетНДС Тогда
			
			ТекСтр.Всего = ТекСтр.Сумма;
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, ИСТИНА);
			
		Иначе
			
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, Ложь);
			ТекСтр.Всего = ТекСтр.Сумма + ТекСтр.СуммаНДС;
			
		КонецЕсли; 
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоИзменения;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоИзменения;
			
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
	
	КонецЕсли; 
	
	Если ТекСтр.Сумма = 0 Тогда //передано в РИТМ, посчитаем разницу ВСЕГО
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.РазницаСуммаКорректировки + ТекСтр.РазницаСуммаНДСКорректировки;
	КонецЕсли; 
	
КонецПроцедуры

////// ПОЛЕ Сумма
&НаКлиенте
Процедура Услуги1СуммаПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
КонецПроцедуры

&НаСервере
Процедура Услуги1СуммаПриИзмененииНаСервере(ИДРедСтроки)
	// ИЗМЕНЕНИЕ СУММЫ
	ТекСтр = Объект.Услуги.НайтиПоИдентификатору(ИДРедСтроки);
	
	ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоКорректировки) Тогда
		
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоКорректировки;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоКорректировки;
		
		Если Объект.СуммаВключаетНДС Тогда
		
			ТекСтр.Всего = ТекСтр.Сумма;
		
		Иначе
		
			ТекСтр.Всего = ТекСтр.Сумма + ТекСтр.СуммаНДС;
		
		КонецЕсли; 
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоКорректировки;
		
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекСтр.ВсегоДоИзменения) Тогда
	
		ТекСтр.РазницаСуммаКорректировки = ТекСтр.Сумма - ТекСтр.СуммаДоИзменения;
		ТекСтр.РазницаСуммаНДСКорректировки = ТекСтр.СуммаНДС - ТекСтр.СуммаНДСДоИзменения;
		
		Если Объект.СуммаВключаетНДС Тогда
		
			ТекСтр.Всего = ТекСтр.Сумма;
		
		Иначе
		
			ТекСтр.Всего = ТекСтр.Сумма + ТекСтр.СуммаНДС;
		
		КонецЕсли;
		
		ТекСтр.РазницаВсегоКорректировки = ТекСтр.Всего - ТекСтр.ВсегоДоИзменения;
		
		ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество); 
			
	КонецЕсли; 
	
КонецПроцедуры

////// ПОЛЕ РазницаСуммаНДСКорр
&НаКлиенте
Процедура Услуги1РазницаСуммаНДСКорректировкиПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоКорректировки) Тогда
		
		ТекДан.СуммаНДС = ТекДан.СуммаНДСДоКорректировки + ТекДан.РазницаСуммаНДСКорректировки;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоИзменения) Тогда
		
		ТекДан.СуммаНДС = ТекДан.СуммаНДСДоИзменения + ТекДан.РазницаСуммаНДСКорректировки;
	
	КонецЕсли;
	
	ТекДан.Всего = ТекДан.Сумма + ?(НЕ Объект.НДСВключенВСтоимость, ТекДан.СуммаНДС, 0);
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоКорректировки) Тогда
		ТекДан.РазницаВсегоКорректировки = ТекДан.Всего - ТекДан.ВсегоДоКорректировки;
	КонецЕсли;      
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоИзменения) Тогда
		ТекДан.РазницаВсегоКорректировки = ТекДан.Всего - ТекДан.ВсегоДоИзменения;
	КонецЕсли;

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
	Если ТекДан.Сумма = 0 Тогда //передано в РИТМ, посчитаем разницу ВСЕГО
		ТекДан.РазницаВсегоКорректировки = ТекДан.РазницаСуммаКорректировки + ТекДан.РазницаСуммаНДСКорректировки;
	КонецЕсли; 
	
КонецПроцедуры

////// ПОЛЕ СуммаНДС
&НаКлиенте
Процедура Услуги1СуммаНДСПриИзменении(Элемент)
	
	ТекДан = Элементы.Услуги1.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоКорректировки) Тогда
		
		ТекДан.РазницаСуммаНДСКорректировки = ТекДан.СуммаНДС - ТекДан.СуммаНДСДоКорректировки;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоИзменения) Тогда
		
		ТекДан.РазницаСуммаНДСКорректировки = ТекДан.СуммаНДС - ТекДан.СуммаНДСДоИзменения;
		
	КонецЕсли; 
	
	ТекДан.Всего = ТекДан.Сумма + ?(НЕ Объект.НДСВключенВСтоимость, ТекДан.СуммаНДС, 0);
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоИзменения) Тогда
	
		ТекДан.РазницаВсегоКорректировки = ТекДан.Всего - ТекДан.ВсегоДоИзменения;
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекДан.ВсегоДоКорректировки) Тогда
	
		ТекДан.РазницаВсегоКорректировки = ТекДан.Всего - ТекДан.ВсегоДоКорректировки;
	
	КонецЕсли;

	//++ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	Услуги1СуммаПриИзмененииНаСервере(ТекДан.ПолучитьИдентификатор());
	//--ДИТ Гаузер А.В. US 41390 TA 48685 22.03.2022
	
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
	
	ТекДан.ИмеютсяИзменения = ТекДан.РазницаСуммаКорректировки <> 0 ИЛИ ТекДан.РазницаСуммаНДСКорректировки <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоИзменения(Команда)
	
	Если Элементы.Услуги1.ОтборСтрок = Неопределено Тогда
		
		Отбор = Новый Структура("ИмеютсяИзменения", Истина);
		
		Элементы.Услуги1.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Элементы.Услуги1.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ПослеУдаления(Элемент)
	РассчитатьСуммыВсегоПоДокументу();
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	РассчитатьСуммыДокумента();
	//Евросиб Каблов 12.05.2021 )
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	//Евросиб Каблов 13.05.2021 ( Ticket#0222113
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ГУИДстроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	//Евросиб Каблов 13.05.2021 )
	
КонецПроцедуры

//Евросиб Каблов 02.07.2021 Ticket#0234010
&НаСервере
Процедура РазделитьСтрокуНаСервере(ТекущаяСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекДанные <> Неопределено Тогда
		НовСтрока = Объект.Услуги.Вставить(Объект.Услуги.Индекс(ТекДанные) + 1);
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекДанные);
		НовСтрока.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
		НовСтрока.ГУИДстроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 02.07.2021 Ticket#0234010
&НаКлиенте
Процедура РазделитьСтроку(Команда)
	
	ТекущаяСтрока = Элементы.Услуги1.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		РазделитьСтрокуНаСервере(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МаршрутизироватьДокументНаСервере(ПараметрыДокумента)
	// Евросиб Фролов (02.12.2021 Task №43242
	Документы.КорректировкаПоступления.МаршрутизироватьКорректировкуПТУ(ПараметрыДокумента);
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаСФХЖ =  Объект.ДатаВходящегоДокумента;
	КонецЕсли;
	//Евросиб Литвинов) 	
КонецПроцедуры

//++ Зубов US45321 TA45322 27.01.2022
&НаСервере
Процедура ЗаполнитьПричинуВозврата()
	//++ Глеков Д.В. Ticket#0255784  03.02.2022 
	Элементы.ПричинаВозврата.Видимость = Ложь;
	ПричинаВозврата = "";
	Для каждого Строка из Объект.Состояния Цикл
		Если Строка.Исполнитель = ПараметрыСеанса.ТекущийПользователь И 
			(Строка.Статус = Перечисления.СтатусыЭтапов.ВРаботе ИЛИ Строка.Статус = Перечисления.СтатусыЭтапов.НаВыполнение) Тогда
			//-- Глеков Д.В. Ticket#0255784  03.02.2022
			Если Строка.Комментарий = "" Тогда
				Элементы.ПричинаВозврата.Видимость = Ложь;
				ПричинаВозврата = "";
			Иначе
				Элементы.ПричинаВозврата.Видимость = Истина;
				ПричинаВозврата = Строка.Комментарий;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//-- Зубов US45321 TA45322 27.01.2022

// ++ ДИТ, Сгонник, US 35086; TA 46835 2022-02-04 реализация открытия ссылок и сканов из базы 1С:ДО
&НаКлиенте
Процедура СсылкаОсновногоДокументаДОНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.СсылкаОсновногоДокументаДО) Тогда 
		ЗапуститьПриложение(Объект.СсылкаОсновногоДокументаДО);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлыДО(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлыДО",
					//ПараметрыФормы,
					//ПараметрыВыполненияКоманды.Источник,
					//ПараметрыВыполненияКоманды.Уникальность,
					//ПараметрыВыполненияКоманды.Окно);
					ПараметрыФормы, 
					ЭтаФорма, 
					УникальныйИдентификатор);
				 
КонецПроцедуры
// ++ ДИТ, Сгонник, US 35086; TA 46835 2022-02-04 реализация открытия ссылок и сканов из базы 1С:ДО

//++ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022
Процедура УстановитьДоступностьЭлементаВОчередиАвторазнесения()

	//Евросиб - АСуслов 21.11.2022 10:31:47 #58550
	//(
	//Элементы.ВОчередиАвторазнесения.Доступность = Объект.Проведен И НЕ ЕстьКорректировкаПоступленияИсправлениеОшибки();
	//)
	//Евросиб - АСуслов 21.11.2022 10:31:49 #58550

КонецПроцедуры    
	
Функция ЕстьКорректировкаПоступленияИсправлениеОшибки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Проведен = ИСТИНА
	|	И КорректировкаПоступления.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|	И КорректировкаПоступления.ДокументПоступления = &ДокументПоступления
	|   И КорректировкаПоступления.Проведен
	|";
	Запрос.УстановитьПараметр("ДокументПоступления", Объект.Ссылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции	
//--ДИТ Гаузер А.В. US 41390 TA 48051 05.03.2022     

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТСПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТС = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТС);
КонецПроцедуры  
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТЕПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТЕ = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТЕ);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТДПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТД = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТД);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

&НаКлиенте
Процедура ДокументПоступленияПриИзменении(Элемент)
	
	ДокументПоступленияПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДокументПоступленияПриИзмененииСервер()
	
	// ++ ДИТ_Агафонов_task 41390
	Документы.КорректировкаПоступления.ПроверитьДокументПоступление(Объект.ДокументПоступления,Объект.Ссылка);
	// -- ДИТ_Агафонов_task 413903

	 //Евросиб Каблов 12.08.2022 ( Task 55578
	Если ЗначениеЗаполнено(Объект.ДокументПоступления) Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.Заполнить(Объект.ДокументПоступления);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
	 //Евросиб Каблов 12.08.2022 )
	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Объект.Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(Объект.ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ДоговорКонтрагентаПриИзмененииНаСервере();
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

// ++ ДИТ_Агафонов_task 41390 03.02.2023
&НаСервере
Процедура НастройкиВидимостиДоступностиОтВидаОперации()
	ЭтоПервичка = Объект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	Элементы.НомерИсправления.АвтоОтметкаНезаполненного = ЭтоПервичка;
	Элементы.ДатаИсправления.АвтоОтметкаНезаполненного = ЭтоПервичка;
	Элементы.Группа6.Видимость  = ЭтоПервичка;	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	НастройкиВидимостиДоступностиОтВидаОперации();
КонецПроцедуры
// -- ДИТ_Агафонов_task 41390 03.02.2023

// ++ Дудоров С.В. Ticket#61931 29.11.2022
//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	Если ИмяСобытия = "ЗаписьКорректировкиПоступления" Тогда 
//		ЭтаФорма.ОбновитьОтображениеДанных();
//		ЭтаФорма.Прочитать();
//		ОбновитьПанельТекущегоПользователя();
//		ОбновитьПанельСостояний();	
//	КонецЕсли;
//КонецПроцедуры
// -- Дудоров С.В. Ticket#61931 29.11.2022
//Евросиб - АСуслов 17.03.2023 16:00:28 #65868
//(
&НаСервереБезКонтекста
Процедура ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
КонецПроцедуры  

&НаКлиенте
Процедура ДатаПоступленияДокументаПриИзменении(Элемент)
	ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументовНаСервере(Объект.ДатаПоступленияДокумента, Объект.ДоговорКонтрагента, Объект.СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СтанцияОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Услуги1.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияОтправления) Тогда
		ТекДанные.СтанцияОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СтанцияНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Услуги1.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.СтанцияНазначения) Тогда
		ТекДанные.СтанцияНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");	
	КонецЕсли;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса", Ложь, Истина),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//)
//Евросиб - АСуслов 17.03.2023 16:00:34 #65868

// ДИТ US 64822 Сержантова А.С. Начало: 03.07.2023
&НаКлиенте
Процедура ПротоколПоставщикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

// ДИТ US 64822 Сержантова А.С. Начало: 03.07.2023
&НаСервере
Процедура ЗаполнитьСогласноПТУНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугПротоколПоставщика.ПСЦ КАК ПСЦ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ПротоколПоставщика КАК ПоступлениеТоваровУслугПротоколПоставщика
		|ГДЕ
		|	ПоступлениеТоваровУслугПротоколПоставщика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументПоступления);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Объект.ПротоколПоставщика.Очистить();
	Пока Выборка.Следующий() Цикл
		НС = Объект.ПротоколПоставщика.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла; 
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

// ДИТ US 64822 Сержантова А.С. Начало: 03.07.2023
&НаКлиенте
Процедура ЗаполнитьСогласноПТУ(Команда)
	ЗаполнитьСогласноПТУНаСервере();
КонецПроцедуры

 //Субботин 77317 20.11.2023 начало
&НаКлиенте
Процедура Услуги1НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьОтнесениеУслугиНаЗатраты(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвязьУслугИСчетовНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоменклатураСервер.ПроверитьОтнесениеУслугиНаЗатраты(ВыбранноеЗначение, СтандартнаяОбработка);	
КонецПроцедуры 
//Субботин 77317 20.11.2023 Конец

//Евросиб Каблов 02.09.2024 Ticket#0360646
&НаСервере
Процедура ЗаполнитьПоДокументуПоступленияНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьУслугиПоДокументуПоступления();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

//Евросиб Каблов 02.09.2024 Ticket#0360646
&НаКлиенте
Процедура ЗаполнитьПоДокументуПоступления(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		ОповещениеОВыборе = Новый ОписаниеОповещения("ЗаполнитьПоДокументуПоступленияОбработкаВыбораПользователя", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОВыборе, "Табличная часть Услуги будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоДокументуПоступленияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 02.09.2024 Ticket#0360646
&НаКлиенте
Процедура ЗаполнитьПоДокументуПоступленияОбработкаВыбораПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументуПоступленияНаСервере();
	КонецЕсли;
	
КонецПроцедуры
//Субботин 77317 20.11.2023 Конец

// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. 10.01.2025   
&НаКлиенте
Процедура ОбработкаИзмененияРеквизитовУчетаНДС()

	Для каждого СтрТЧ Из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;   
	
	Для каждого СтрТЧ Из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;
	
	РассчитатьСуммыВсегоПоДокументу();
	РассчитатьСуммыДокумента();
	
КонецПроцедуры 

// Евросиб(ДИТ) US 96051 ТА 96563 Сержантова А.С. 10.01.2025 
&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитовУчетаНДС();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьКорректировкиПоступления" Тогда 
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();	
	КонецЕсли;
КонецПроцедуры

//Евросиб Пирожкова( 10.09.2025 Ticket№0406736 
&НаКлиенте
Процедура ПроверитьВыгрузкуВУПП(Команда)
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ПараметрыОбработки = Новый Структура("НеЗаписан", НеЗаписан);
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаВыгрузка", ЭтаФорма, ПараметрыОбработки);
	Если НеЗаписан Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Для выполнения проверки документ должен быть проведен. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе		
		ОбработкаВопросаВыгрузка(КодВозвратаДиалога.Да, ПараметрыОбработки); 
		ПроверитьВыгрузкуВУППСервер();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВопросаВыгрузка(Ответ = неопределено, Параметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.НеЗаписан Тогда
		ПровестиДокументКорректировкиПоступления();	
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьВыгрузкуВУППСервер()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьВыгрузкуВУПП();
	
КонецПроцедуры  

&НаСервере
Процедура ПровестиДокументКорректировкиПоступления()
	СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ЭтотОбъект.Записать(СтруктураЗаписи);	
КонецПроцедуры

// Евросиб Пирожкова 10.09.2025)

