
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("НаименованиеПолное");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = Данные.НаименованиеПолное;
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьМультиадресаПоПараметрам(Параметры.СтрокаПоиска, Параметры.Отбор, Ложь));
	
КонецПроцедуры

Функция ПолучитьМультиадресаПоПараметрам(ПараметрПоиска = Неопределено, ПараметрыОтбораАдресов = Неопределено, ВернутьТаблицу = Ложь) Экспорт
	
	Если ПараметрыОтбораАдресов = Неопределено Тогда
		ПараметрыОтбораАдресов = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
		
	ТипПараметраПоиска = ТипЗнч(ПараметрПоиска);
	ТипМассив = Тип("Массив");
	ТипФиксированныйМассив = Тип("ФиксированныйМассив");
	
	Если ТипПараметраПоиска = Тип("Строка") И ЗначениеЗаполнено(ТипПараметраПоиска) Тогда
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + ПараметрПоиска + "%");
		ТекстУсловияПоиска = "И Мультиадреса.НаименованиеПолное ПОДОБНО &СтрокаПоиска";
		
	ИначеЕсли ТипПараметраПоиска = ТипМассив И ЗначениеЗаполнено(ПараметрПоиска) Тогда
		
		СписокАдресов = ПараметрПоиска;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультиадресаАдреса.Ссылка КАК Мультиадрес,
		|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) КАК КоличествоАдресовИзОтбора
		|ПОМЕСТИТЬ МультиадресаСоСпискомАдресов
		|ИЗ
		|	Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
		|ГДЕ
		|	МультиадресаАдреса.Адрес <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И НЕ МультиадресаАдреса.Ссылка.ПометкаУдаления
		|	И МультиадресаАдреса.Адрес В(&Адреса)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультиадресаАдреса.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) = &КоличествоАдресов";
		
		ТекстЗапроса = ТекстЗапроса +
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстУсловияПоиска =
		"	И Мультиадреса.Ссылка В
		|			(ВЫБРАТЬ
		|				МультиадресаСоСпискомАдресов.Мультиадрес КАК Мультиадрес
		|			ИЗ
		|				МультиадресаСоСпискомАдресов КАК МультиадресаСоСпискомАдресов)";
		
		Запрос.УстановитьПараметр("Адреса", СписокАдресов);
		Запрос.УстановитьПараметр("КоличествоАдресов", СписокАдресов.Количество());
		
	Иначе
		ТекстУсловияПоиска = "";		
	КонецЕсли;	
		
	ТипМассив = Тип("Массив");
	ТипФиксированныйМассив = Тип("ФиксированныйМассив");
	
	Если ЗначениеЗаполнено(ПараметрыОтбораАдресов) Тогда
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	МультиадресаАдреса.Ссылка КАК Мультиадрес,
		|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) КАК КоличествоАдресовИзОтбора
		|ПОМЕСТИТЬ МультиадресаПоПараметрам
		|ИЗ
		|	Справочник.Мультиадреса КАК Мультиадреса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
		|		ПО Мультиадреса.Ссылка = МультиадресаАдреса.Ссылка
		|ГДЕ
		|	НЕ Мультиадреса.ПометкаУдаления
		|	И МультиадресаАдреса.Адрес <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|	И МультиадресаАдреса.Адрес.ЛокацияВышестоящегоУровня = &ЛокацияВышестоящегоУровня
		|	И Мультиадреса.Ссылка В(&МультиадресаСоСпискомАдресов)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультиадресаАдреса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультиадресаАдреса.Ссылка КАК Мультиадрес,
		|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) КАК ОбщееКоличествоВМультиадресе
		|ПОМЕСТИТЬ ВТ_ОбщееКоличество
		|ИЗ
		|	МультиадресаПоПараметрам КАК МультиадресаПоПараметрам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
		|		ПО МультиадресаПоПараметрам.Мультиадрес = МультиадресаАдреса.Ссылка
		|ГДЕ
		|	МультиадресаАдреса.Адрес <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МультиадресаАдреса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МультиадресаПоПараметрам.Мультиадрес КАК Мультиадрес
		|ИЗ
		|	МультиадресаПоПараметрам КАК МультиадресаПоПараметрам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличество КАК ВТ_ОбщееКоличество
		|		ПО МультиадресаПоПараметрам.Мультиадрес = ВТ_ОбщееКоличество.Мультиадрес
		|			И МультиадресаПоПараметрам.КоличествоАдресовИзОтбора = ВТ_ОбщееКоличество.ОбщееКоличествоВМультиадресе";
		
		ШаблонУсловия = "И МультиадресаАдреса.Адрес.%1 = &%2";
		ШаблонУсловияВ = "И МультиадресаАдреса.Адрес.%1 В(&%2)";
		УсловияОтбораАдресов = Новый Массив;
		
		Для Каждого Параметр Из ПараметрыОтбораАдресов Цикл
			
			ИмяПараметра = "ПараметрАдреса" + Параметр.Ключ;
			ТипПараметра = ТипЗнч(Параметр.Значение);
			Если ТипЗнч(Параметр.Значение) = ТипМассив Или ТипПараметра = ТипФиксированныйМассив Тогда
				ТекстУсловия = СтрШаблон(ШаблонУсловияВ, Параметр.Ключ, ИмяПараметра);
			Иначе
				ТекстУсловия = СтрШаблон(ШаблонУсловия, Параметр.Ключ, ИмяПараметра);
			КонецЕсли;
			УсловияОтбораАдресов.Добавить(ТекстУсловия);
			
			Запрос.УстановитьПараметр(ИмяПараметра, Параметр.Значение);
			
		КонецЦикла;
		
		ТекстУсловийОтбораАдресов = СтрСоединить(УсловияОтбораАдресов, Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И МультиадресаАдреса.Адрес.ЛокацияВышестоящегоУровня = &ЛокацияВышестоящегоУровня", ТекстУсловийОтбораАдресов);
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	Мультиадреса.Ссылка КАК Мультиадрес
		|ИЗ
		|	Справочник.Мультиадреса КАК Мультиадреса
		|ГДЕ
		|	НЕ Мультиадреса.ПометкаУдаления
		|	И Мультиадреса.Ссылка В(&МультиадресаСоСпискомАдресов)";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Мультиадреса.Ссылка В(&МультиадресаСоСпискомАдресов)", ТекстУсловияПоиска);
	
	Запрос.Текст = ТекстЗапроса;	
	ТаблицаАдресов = Запрос.Выполнить().Выгрузить();	
	Если ВернутьТаблицу Тогда
		Результат = ТаблицаАдресов;
	Иначе
		Результат = ТаблицаАдресов.ВыгрузитьКолонку("Мультиадрес");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМультиадресПоСпискуАдресов(Адреса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МультиадресаАдреса.Ссылка КАК Мультиадрес,
	|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) КАК КоличествоАдресовИзОтбора
	|ПОМЕСТИТЬ МультиадресаСоСпискомАдресов
	|ИЗ
	|	Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
	|ГДЕ
	|	МультиадресаАдреса.Адрес <> ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
	|	И НЕ МультиадресаАдреса.Ссылка.ПометкаУдаления
	|	И МультиадресаАдреса.Адрес В(&Адреса)
	|
	|СГРУППИРОВАТЬ ПО
	|	МультиадресаАдреса.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) = &КоличествоАдресов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МультиадресаСоСпискомАдресов.Мультиадрес КАК Мультиадрес
	|ИЗ
	|	МультиадресаСоСпискомАдресов КАК МультиадресаСоСпискомАдресов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
	|		ПО МультиадресаСоСпискомАдресов.Мультиадрес = МультиадресаАдреса.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МультиадресаСоСпискомАдресов.Мультиадрес,
	|	МультиадресаСоСпискомАдресов.КоличествоАдресовИзОтбора
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(МультиадресаАдреса.Адрес) = &КоличествоАдресов";
	
	Запрос.УстановитьПараметр("Адреса", Адреса);
	Запрос.УстановитьПараметр("КоличествоАдресов", Адреса.Количество());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Мультиадрес = Выборка.Мультиадрес;
	Иначе
		Мультиадрес = Справочники.Мультиадреса.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Мультиадрес;
	
КонецФункции

Функция ПолучитьАдресаМультиадреса(Мультиадрес) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МультиадресаАдреса.Адрес КАК Адрес
	|ИЗ
	|	Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
	|ГДЕ
	|	МультиадресаАдреса.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МультиадресаАдреса.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Мультиадрес);
	
	Адреса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес");
	
	Возврат Адреса;
	
КонецФункции

Функция ЕстьДокументыПоМультиадресу(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыПоМультиадресу.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.ДокументыПоМультиадресу(&Мультиадрес) КАК ДокументыПоМультиадресу";
	
	Запрос.УстановитьПараметр("Мультиадрес", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции