
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		СписокАдресов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Адреса");
		Если ЗначениеЗаполнено(СписокАдресов) Тогда
			
			Для Каждого Адрес Из СписокАдресов Цикл
				НоваяСтрока = Адреса.Добавить();
				НоваяСтрока.Адрес = Адрес;
			КонецЦикла;
			
			МассивАдресов = Адреса.Выгрузить(, "Адрес").ВыгрузитьКолонку("Адрес");
			НаименованиеПолное = СтрСоединить(МассивАдресов, "; ");
	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Адреса.Свернуть("Адрес");
	
	СтрокиСПустымиАдресами = Адреса.НайтиСтроки(Новый Структура("Адрес", Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка()));
	Для Каждого Стр Из СтрокиСПустымиАдресами Цикл
		Адреса.Удалить(Стр);
	КонецЦикла;
	
	Если Адреса.Количество() < 2 Тогда
		ТекстСообщения = "Мультиадрес должен содержать минимум 2 адреса!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	СуществующийМультиадрес = Справочники.Мультиадреса.ПолучитьМультиадресПоСпискуАдресов(Адреса.Выгрузить(, "Адрес").ВыгрузитьКолонку("Адрес"));
	Если ЗначениеЗаполнено(СуществующийМультиадрес) И Ссылка <> СуществующийМультиадрес Тогда
		ТекстСообщения = "Мультиадрес с таким набором адресов уже существует!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда 
		Если Справочники.Мультиадреса.ЕстьДокументыПоМультиадресу(Ссылка) Тогда
			Отказ = Истина;
			ВызватьИсключение "Мультиадрес уже использован в документах. Изменения запрещены";
		КонецЕсли;
	КонецЕсли;
	
	МассивАдресов = Адреса.Выгрузить(, "Адрес").ВыгрузитьКолонку("Адрес");
	НаименованиеПолное = СтрСоединить(МассивАдресов, "; ");
	
КонецПроцедуры

