
Функция ПолучитьКоординатыЛокацииЧерезГеокодер(ЛокацияСсылка) Экспорт
	
	РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияСсылка, "Наименование, Родитель.Наименование, ЛокацияВышестоящегоУровня, Тип, Страна, Страна.КодАльфа2, Страна.Наименование, ЖелезнаяДорога.Наименование");
	ТипЛокации = РеквизитыЛокации.Тип;
	НаименованиеЛокации = РеквизитыЛокации.Наименование;
	СтруктураКоординатыЛокации = Новый Структура("Долгота, Широта, Наименование, ЛокацияВышестоящегоУровня, Страна", 0, 0, "", "", "");
	Если ТипЛокации = Справочники.ТипыЛокаций.Страна Тогда
		//	страны
		НеНайден = Истина;
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", НаименованиеЛокации));
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", НаименованиеЛокации));
		МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
		Если МассивРезультатов = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
			СтруктураРезультата.Добавить("СтруктураКоординатыЛокации", СтруктураКоординатыЛокации);
			Возврат СтруктураРезультата;
		КонецЕсли;
		Для каждого Результат Из МассивРезультатов Цикл
			Если Результат.Вид = "country" Тогда
				ЗаполнитьЗначенияСвойств(СтруктураКоординатыЛокации, Результат, "Долгота, Широта");
				НеНайден = Ложь;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если НеНайден Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найдена страна %1 в геокодере", НаименованиеЛокации));
		КонецЕсли;
	ИначеЕсли ТипЛокации = Справочники.ТипыЛокаций.Регион Тогда
	//регионы
		НеНайден = Истина;
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", НаименованиеЛокации));
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", НаименованиеЛокации));
		МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
		СтруктураУточненногоРезультата = Новый Структура("КоличествоСовпадений", 0);
		Для каждого Результат Из МассивРезультатов Цикл
			Если Результат.Вид = "province"
				ИЛИ Результат.Вид = "area" Тогда
				СтруктураУточненногоРезультатаВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
				СтруктураУточненногоРезультатаВрем.Вставить("КоличествоСовпадений");
				массивНаименованийРезультата = СтрРазделить(Результат.Наименование, " ");
				массивНаименованийЛокации = СтрРазделить(НаименованиеЛокации, " ");
				КоличествоСовпадений = 0;
				Для каждого ЧастьНаименованияЛокации Из массивНаименованийЛокации Цикл 
					Если ВРЕГ(ЧастьНаименованияЛокации) = "РЕГИОН" Тогда
						Продолжить;
					КонецЕсли;
					Для каждого ЧастьНаименованияРезультата Из массивНаименованийРезультата Цикл
						Если ВРЕГ(ЧастьНаименованияЛокации) = ВРЕГ(ЧастьНаименованияРезультата) Тогда
							КоличествоСовпадений = КоличествоСовпадений + 1;
						КонецЕсли;                
						СтруктураУточненногоРезультатаВрем.КоличествоСовпадений = КоличествоСовпадений;
						Если СтруктураУточненногоРезультатаВрем.КоличествоСовпадений > СтруктураУточненногоРезультата.КоличествоСовпадений Тогда
							СтруктураУточненногоРезультата = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураУточненногоРезультатаВрем);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если СтруктураУточненногоРезультата.КоличествоСовпадений > 0 Тогда
			ЛокацияВышестоящегоУровня = Локации_сервер.ПолучитьЛокациюПоСтране(УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(СтруктураУточненногоРезультата.Страна));
			ЗаполнитьЗначенияСвойств(СтруктураКоординатыЛокации, СтруктураУточненногоРезультата, "Долгота, Широта, Страна");
			СтруктураКоординатыЛокации.ЛокацияВышестоящегоУровня = ЛокацияВышестоящегоУровня;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найден регион %1 в геокодере", НаименованиеЛокации));
		КонецЕсли;
	ИначеЕсли ТипЛокации = Справочники.ТипыЛокаций.НаселенныйПункт Тогда
	//населенный пункт
		НеНайден = Истина;
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", СтрШаблон("%1,%2", РеквизитыЛокации.РодительНаименование, НаименованиеЛокации)));
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", СтрШаблон("%1,%2", РеквизитыЛокации.РодительНаименование, НаименованиеЛокации)));
		МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
		СтруктураУточненногоРезультата = Новый Структура("КоличествоСовпадений", 0);
		Для каждого Результат Из МассивРезультатов Цикл
			Если Результат.Вид = "locality" Тогда
				СтруктураУточненногоРезультатаВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
				СтруктураУточненногоРезультатаВрем.Вставить("КоличествоСовпадений");
				массивНаименованийРезультата = СтрРазделить(Результат.Наименование, " ");
				массивНаименованийЛокации = СтрРазделить(НаименованиеЛокации, " ");
				КоличествоСовпадений = 0;
				Для каждого ЧастьНаименованияЛокации Из массивНаименованийЛокации Цикл
					ЧастьНаименованияЛокации = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("()",ЧастьНаименованияЛокации, "");
					Если ВРЕГ(ЧастьНаименованияЛокации) = "РЕГИОН" Тогда
						Продолжить;
					КонецЕсли;
					Для каждого ЧастьНаименованияРезультата Из массивНаименованийРезультата Цикл
						Если СтрЗаменить(ВРЕГ(ЧастьНаименованияЛокации),"Ё","Е") = СтрЗаменить(ВРЕГ(ЧастьНаименованияРезультата),"Ё","Е") Тогда
							КоличествоСовпадений = КоличествоСовпадений + 1;
						КонецЕсли;                
						СтруктураУточненногоРезультатаВрем.КоличествоСовпадений = КоличествоСовпадений;
						Если СтруктураУточненногоРезультатаВрем.КоличествоСовпадений > СтруктураУточненногоРезультата.КоличествоСовпадений Тогда
							СтруктураУточненногоРезультата = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураУточненногоРезультатаВрем);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если СтруктураУточненногоРезультата.КоличествоСовпадений > 0 Тогда   
			ЗаполнитьЗначенияСвойств(СтруктураКоординатыЛокации, СтруктураУточненногоРезультата, "Долгота, Широта, Наименование, Страна");
			СтруктураКоординатыЛокации.ЛокацияВышестоящегоУровня = НайтиДобавитьРегион(СтруктураУточненногоРезультата);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найден населенный пункт %1 в геокодере", НаименованиеЛокации));
		КонецЕсли;
	ИначеЕсли ТипЛокации = Справочники.ТипыЛокаций.СтанцияЖД Тогда
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивЖелезнодорожныхСтанцийЧерезГеокодерЯндекс(НаименованиеЛокации, РеквизитыЛокации.ЖелезнаяДорогаНаименование, РеквизитыЛокации.СтранаНаименование, РеквизитыЛокации.СтранаКодАльфа2);
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивЖелезнодорожныхСтанцийЧерезГеокодерЯндекс(НаименованиеЛокации, РеквизитыЛокации.ЖелезнаяДорогаНаименование, РеквизитыЛокации.СтранаНаименование, РеквизитыЛокации.СтранаКодАльфа2);
		МассивРезультатов = СтруктураРезультата.МассивЖДСтанций;
		//проверим что в массиве есть нужный результат 
		СтруктураУточненногоРезультата = Неопределено;
		Для каждого Результат Из МассивРезультатов Цикл
			СтруктураУточненногоРезультатаВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
			СтруктураУточненногоРезультатаВрем.Вставить("КоличествоСовпадений");
			массивНаименованийРезультата = СтрРазделить(Результат.Наименование, " ");
			массивНаименованийЛокации = СтрРазделить(НаименованиеЛокации, " ");
			КоличествоСовпадений = 0;
			Для каждого ЧастьНаименованияЛокации Из массивНаименованийЛокации Цикл
				Для каждого ЧастьНаименованияРезультата Из массивНаименованийРезультата Цикл
					Если СтрЗаменить(ВРЕГ(ЧастьНаименованияЛокации),"Ё","Е") = СтрЗаменить(ВРЕГ(ЧастьНаименованияРезультата),"Ё","Е") Тогда
						КоличествоСовпадений = КоличествоСовпадений + 1;
					КонецЕсли;                
					СтруктураУточненногоРезультатаВрем.КоличествоСовпадений = КоличествоСовпадений;
					Если СтруктураУточненногоРезультата = Неопределено 
						ИЛИ СтруктураУточненногоРезультатаВрем.КоличествоСовпадений > СтруктураУточненногоРезультата.КоличествоСовпадений Тогда
						СтруктураУточненногоРезультата = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураУточненногоРезультатаВрем);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		Если СтруктураУточненногоРезультата <> Неопределено Тогда
			//обЛокация = Локация.ПолучитьОбъект();
			//ЗаполнитьЗначенияСвойств(обЛокация, СтруктураУточненногоРезультата, "Долгота, Широта");
			//обЛокация.Записать(); 
			ЗаполнитьЗначенияСвойств(СтруктураКоординатыЛокации, СтруктураУточненногоРезультата, "Долгота, Широта");
			СтруктураРезультатаПоКоординатам = ГеокодированиеКлиентСервер.ПолучитьМассивНаселенныхПунктовЧерезГеокодерЯндекс(СтрШаблон("%1,%2", СтруктураУточненногоРезультата.Долгота, СтруктураУточненногоРезультата.Широта));
			Если ЗначениеЗаполнено(СтруктураРезультатаПоКоординатам.ОписаниеОшибки) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтруктураРезультатаПоКоординатам.ОписаниеОшибки);
				СтруктураРезультата.Вставить("СтруктураКоординатыЛокации",СтруктураКоординатыЛокации);
				Возврат СтруктураРезультата;
			КонецЕсли;
			МассивРезультатов = СтруктураРезультатаПоКоординатам.МассивСтруктурРезультата;
			КоличествоРезультатов = МассивРезультатов.Количество();
			Если КоличествоРезультатов = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не найден населенный пункт для привязки родителя");
			ИначеЕсли КоличествоРезультатов = 1 Тогда
				//найдем или добавим локацию для привязки
				ЛокацияРодитель = НайтиДобавитьНаселенныйПункт(МассивРезультатов[0]);
				ДозаполнитьЛогГеокодераИсточниками(СтруктураРезультатаПоКоординатам.ИдентификаторЗапроса, ЛокацияСсылка);
				ДозаполнитьЛогГеокодераСтатусами(СтруктураРезультатаПоКоординатам.ИдентификаторЗапроса, Перечисления.СтатусыОбработкиЗапросаГеокодера.ОтветПолученЗаписан, ЛокацияРодитель);
				//Если ЗначениеЗаполнено(ЛокацияРодитель) Тогда
				//	обЛокация = Локация.ПолучитьОбъект();
				//	обЛокация.ЛокацияВышестоящегоУровня = ЛокацияРодитель;
				//	обЛокация.Записать();
				//КонецЕсли; 
				СтруктураКоординатыЛокации.ЛокацияВышестоящегоУровня = ЛокацияРодитель;
			КонецЕсли;
		КонецЕсли;  
	ИначеЕсли ТипЛокации = Справочники.ТипыЛокаций.Порт Тогда
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод, КоличествоРезультатов", СтрШаблон("%1, %2", РеквизитыЛокации.СтранаНаименование, РеквизитыЛокации.Наименование), 100));
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод, КоличествоРезультатов", СтрШаблон("%1, %2", РеквизитыЛокации.СтранаНаименование, РеквизитыЛокации.Наименование), 100));
		МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
		//проверим что в массиве есть нужный результат 
		СтруктураУточненногоРезультата = Неопределено;
		Для каждого Результат Из МассивРезультатов Цикл
			Если Результат.Вид = "country" Тогда
				Продолжить;
			КонецЕсли;
			СтруктураУточненногоРезультатаВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
			СтруктураУточненногоРезультатаВрем.Вставить("КоличествоСовпадений");
			массивНаименованийРезультата = СтрРазделить(Результат.Наименование, " ");
			массивНаименованийЛокации = СтрРазделить(НаименованиеЛокации, " ");
			КоличествоСовпадений = 0;
			Для каждого ЧастьНаименованияЛокации Из массивНаименованийЛокации Цикл
				Для каждого ЧастьНаименованияРезультата Из массивНаименованийРезультата Цикл
					Если СтрЗаменить(ВРЕГ(ЧастьНаименованияЛокации),"Ё","Е") = СтрЗаменить(ВРЕГ(ЧастьНаименованияРезультата),"Ё","Е") Тогда
						КоличествоСовпадений = КоличествоСовпадений + 1;
					КонецЕсли;                
					СтруктураУточненногоРезультатаВрем.КоличествоСовпадений = КоличествоСовпадений;
					Если СтруктураУточненногоРезультата = Неопределено 
						ИЛИ СтруктураУточненногоРезультатаВрем.КоличествоСовпадений > СтруктураУточненногоРезультата.КоличествоСовпадений Тогда
						СтруктураУточненногоРезультата = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураУточненногоРезультатаВрем);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		Если СтруктураУточненногоРезультата <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураКоординатыЛокации, СтруктураУточненногоРезультата, "Долгота, Широта");
			МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивНаселенныхПунктовЧерезГеокодерЯндекс(СтрШаблон("%1,%2", СтруктураУточненногоРезультата.Долгота, СтруктураУточненногоРезультата.Широта));
			КоличествоРезультатов = МассивРезультатов.Количество();
			Если КоличествоРезультатов = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не найден населенный пункт для привязки родителя");
			ИначеЕсли КоличествоРезультатов = 1 Тогда
				ЛокацияРодитель = НайтиДобавитьНаселенныйПункт(МассивРезультатов[0]);
				СтруктураКоординатыЛокации.ЛокацияВышестоящегоУровня = ЛокацияРодитель;
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	СтруктураРезультата.Вставить("СтруктураКоординатыЛокации", СтруктураКоординатыЛокации);
	ДозаполнитьЛогГеокодераИсточниками(СтруктураРезультата.ИдентификаторЗапроса, ЛокацияСсылка);
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПолучитьСтруктуруЗаполненияРегионаУЗарубежнойЛокации(ЛокацияСсылка) Экспорт
    РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияСсылка, "Страна, Тип, Наименование, Страна.Наименование, Родитель.Наименование");
	Если 
		РеквизитыЛокации.Страна = Справочники.СтраныМира.Россия 
		ИЛИ РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Страна 
		ИЛИ РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Регион 
		ИЛИ РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.СтанцияЖД
		ИЛИ РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Порт
		ИЛИ РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.ПустаяСсылка() 
		Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ПараметрСтранаВГеокоде = ?(ЗначениеЗаполнено(РеквизитыЛокации.СтранаНаименование), РеквизитыЛокации.СтранаНаименование, РеквизитыЛокации.РодительНаименование);
	//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод, КоличествоРезультатов", СтрШаблон("%1, %2", ПараметрСтранаВГеокоде, РеквизитыЛокации.Наименование), 30)); 
	СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод, КоличествоРезультатов", СтрШаблон("%1, %2", ПараметрСтранаВГеокоде, РеквизитыЛокации.Наименование), 30)); 
	МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
	СтруктураУточненногоРезультата = Новый Структура("КоличествоСовпадений", 0);
	Для каждого Результат Из МассивРезультатов Цикл 
		Если ВРег(Результат.Страна) <> РеквизитыЛокации.СтранаНаименование
			ИЛИ НЕ ЗначениеЗаполнено(Результат.Регион) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураУточненногоРезультатаВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
		СтруктураУточненногоРезультатаВрем.Вставить("КоличествоСовпадений");
		массивНаименованийРезультата = СтрРазделить(Результат.Наименование, " ");
		массивНаименованийЛокации = СтрРазделить(РеквизитыЛокации.Наименование, " ");
		КоличествоСовпадений = 0;
		Для каждого ЧастьНаименованияЛокации Из массивНаименованийЛокации Цикл 
			Для каждого ЧастьНаименованияРезультата Из массивНаименованийРезультата Цикл
				Если ЗначениеЗаполнено(ЧастьНаименованияЛокации) 
					И ЗначениеЗаполнено(ЧастьНаименованияРезультата) 
					И (СтрНайти(СтрЗаменить(ВРЕГ(ЧастьНаименованияЛокации),"Ё","Е"),СтрЗаменить(ВРЕГ(ЧастьНаименованияРезультата),"Ё","Е")) > 0
					ИЛИ СтрНайти(СтрЗаменить(ВРЕГ(ЧастьНаименованияРезультата),"Ё","Е"),СтрЗаменить(ВРЕГ(ЧастьНаименованияЛокации),"Ё","Е")) > 0) Тогда
					КоличествоСовпадений = КоличествоСовпадений + 1;
				КонецЕсли;                
			КонецЦикла;
		КонецЦикла;
		СтруктураУточненногоРезультатаВрем.КоличествоСовпадений = КоличествоСовпадений;
		Если СтруктураУточненногоРезультатаВрем.КоличествоСовпадений > СтруктураУточненногоРезультата.КоличествоСовпадений Тогда
			СтруктураУточненногоРезультата = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураУточненногоРезультатаВрем);
		КонецЕсли;
	КонецЦикла;
	Если СтруктураУточненногоРезультата.КоличествоСовпадений > 0 Тогда 
		СтруктураУточненногоРезультата.Вставить("ЛокацияСсылка", ЛокацияСсылка);
		СтруктураРегиона = ПолучитьСтруктуруРегиона(СтруктураУточненногоРезультата);
		СтруктураРезультата.Вставить("СтруктураРегиона", СтруктураРегиона);
	Иначе
		СтруктураРегиона = Неопределено;
		СтруктураРезультата.Вставить("СтруктураРегиона", СтруктураРегиона);
	КонецЕсли;
	Возврат СтруктураРезультата;
	
КонецФункции   

Функция ПолучитьСтруктуруРегиона(ПараметрыЛокации)
	//для добавления локации найдем регион
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование ПОДОБНО &Наименование
	|	И Локации.Тип = &Тип
	|	И НЕ Локации.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", ПараметрыЛокации.Регион);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Регион);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найден регион (%1) для создания локации (%2)", ПараметрыЛокации.Регион, ПараметрыЛокации.Наименование));
		//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", ПараметрыЛокации.Регион));
		СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", ПараметрыЛокации.Регион));
		МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
		СтруктураЛокацииРегион = Новый Структура();
		СтруктураЛокацииРегион.Вставить("Тип",Справочники.ТипыЛокаций.Регион);
		СтруктураЛокацииРегион.Вставить("Наименование", ПараметрыЛокации.Регион);
		СтруктураЛокацииРегион.Вставить("Страна", УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ПараметрыЛокации.Страна));
		СтруктураЛокацииРегион.Вставить("Родитель", Справочники.Локации.НайтиПоНаименованию(ПараметрыЛокации.Страна, Истина));
		СтруктураЛокацииРегион.Вставить("Долгота", ПараметрыЛокации.Долгота);
		СтруктураЛокацииРегион.Вставить("Широта", ПараметрыЛокации.Широта);
		СтруктураРезультат = Новый Структура();
		СтруктураРезультат.Вставить("СтруктураЛокацииРегион", СтруктураЛокацииРегион);
		СтруктураРезультат.Вставить("РегионСсылка", Неопределено);
		СтруктураРезультат.Вставить("Ошибка", Ложь);
		СтруктураРезультат.Вставить("ОписаниеОшибки", "");
		ДозаполнитьЛогГеокодераИсточниками(СтруктураРезультата.ИдентификаторЗапроса, ПараметрыЛокации.ЛокацияСсылка);
	Иначе                                                  
		СтруктураРезультат = Новый Структура();
		СтруктураРезультат.Вставить("СтруктураЛокацииРегион", Неопределено);
		СтруктураРезультат.Вставить("РегионСсылка", Неопределено);
		СтруктураРезультат.Вставить("Ошибка", Ложь);
		СтруктураРезультат.Вставить("ОписаниеОшибки", "");
		ТаблицаРегионов = РезультатЗапроса.Выгрузить();
		Если ТаблицаРегионов.Количество() > 1 Тогда
			СтруктураРезультат.Вставить("Ошибка", Истина);
			СтруктураРезультат.Вставить("ОписаниеОшибки", СтрШаблон("Найдено несколько регионов (%1) для создания локации (%2)", ПараметрыЛокации.Регион, ПараметрыЛокации.Наименование));
		КонецЕсли;
		СтруктураРезультат.РегионСсылка = ТаблицаРегионов[0].Ссылка;
	КонецЕсли;
	Возврат СтруктураРезультат;
КонецФункции

Функция НайтиЛокацию(ИмяЛокации, ЛокацияВышестоящегоУровня, Долгота, Широта) Экспорт
	СтруктураЛокации = Новый Структура("Наименование, РодительНаименование, НаселенныйПунктСсылка");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Локации.Ссылка КАК НаселенныйПунктСсылка,
	|	Локации.Наименование КАК Наименование,
	|	Локации.Родитель.Наименование КАК РодительНаименование
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование = &Наименование
	|	И Локации.ЛокацияВышестоящегоУровня.Наименование = &ЛокацияВышестоящегоУровня
	|	И Локации.Долгота = &Долгота
	|	И Локации.Широта = &Широта
	|	И НЕ Локации.ПометкаУдаления
	|	И Локации.Тип = &Тип";
	Запрос.УстановитьПараметр("Наименование", ИмяЛокации);
	Запрос.УстановитьПараметр("Долгота", Долгота);
	Запрос.УстановитьПараметр("Широта", Широта);
	Запрос.УстановитьПараметр("ЛокацияВышестоящегоУровня", ЛокацияВышестоящегоУровня);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.НаселенныйПункт);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//ОбщегоНазначения.СообщитьПользователю("не найдена локация для подбора адреса");
		Возврат Неопределено;
	КонецЕсли;
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	СтруктураЛокации.Наименование = ТаблицаРезультата[0].Наименование;
	СтруктураЛокации.РодительНаименование = ТаблицаРезультата[0].РодительНаименование; 
	СтруктураЛокации.НаселенныйПунктСсылка = ТаблицаРезультата[0].НаселенныйПунктСсылка;
	Возврат СтруктураЛокации;
КонецФункции

Функция НайтиДобавитьНаселенныйПункт(ПараметрыЛокации) Экспорт
	
	ссЛокация = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование ПОДОБНО &Наименование
	|	И Локации.Тип = &Тип
	|	И Локации.Долгота = &Долгота
	|	И Локации.Широта = &Широта
	|	И НЕ Локации.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", ПараметрыЛокации.Наименование);
	Запрос.УстановитьПараметр("Долгота", Число(ПараметрыЛокации.Долгота));
	Запрос.УстановитьПараметр("Широта", Число(ПараметрыЛокации.Широта));
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.НаселенныйПункт);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультатов = РезультатЗапроса.Выгрузить();
	Если ТаблицаРезультатов.Количество() > 1 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найдено несколько локаций для привязки родителя (%1)", ПараметрыЛокации.Наименование));
		Возврат ссЛокация;
	ИначеЕсли ТаблицаРезультатов.Количество() = 1 Тогда
		Возврат ТаблицаРезультатов[0].Ссылка;
	КонецЕсли;                               
	
	//для добавления локации найдем регион
	СтранаСсылка = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ПараметрыЛокации.Страна);
	ссРегион = НайтиДобавитьРегион(ПараметрыЛокации);
	
	обЛокация = Справочники.Локации.СоздатьЭлемент();
	обЛокация.Тип = Справочники.ТипыЛокаций.НаселенныйПункт;
	обЛокация.Наименование = ПараметрыЛокации.Наименование;
	обЛокация.Страна = СтранаСсылка;
	обЛокация.Родитель = Локации_сервер.ПолучитьЛокациюПоСтране(СтранаСсылка);
	обЛокация.ЛокацияВышестоящегоУровня = ссРегион;
	обЛокация.Долгота = ПараметрыЛокации.Долгота;
	обЛокация.Широта = ПараметрыЛокации.Широта;
	обЛокация.Записать();
	Возврат обЛокация.Ссылка;
	
КонецФункции

Функция НайтиДобавитьРегион(ПараметрыЛокации) Экспорт
	СтранаСсылка = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ПараметрыЛокации.Страна);
	Если ПараметрыЛокации.Регион = Неопределено Тогда
		ссРегион = Локации_сервер.ПолучитьЛокациюПоСтране(СтранаСсылка)
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Наименование ПОДОБНО &Наименование
		|	И Локации.Тип = &Тип
		|	И НЕ Локации.ПометкаУдаления";
		Запрос.УстановитьПараметр("Наименование", ПараметрыЛокации.Регион);
		Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Регион);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найден регион (%1) для создания локации (%2)", ПараметрыЛокации.Регион, ПараметрыЛокации.Наименование));
			//МассивРезультатов = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", ПараметрыЛокации.Регион));
			СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивТопонимовЧерезГеокодерЯндекс(Новый Структура("Геокод", ПараметрыЛокации.Регион));
			МассивРезультатов = СтруктураРезультата.МассивСтруктурТопонимов;
			обЛокация = Справочники.Локации.СоздатьЭлемент();
			обЛокация.Тип = Справочники.ТипыЛокаций.Регион;
			обЛокация.Наименование = ПараметрыЛокации.Регион;
			обЛокация.Страна = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ПараметрыЛокации.Страна);
			//обЛокация.Родитель = Справочники.Локации.НайтиПоНаименованию(ПараметрыЛокации.Страна, Истина);
			//обЛокация.ЛокацияВышестоящегоУровня = Справочники.Локации.НайтиПоНаименованию(ПараметрыЛокации.Страна, Истина);
			обЛокация.ЛокацияВышестоящегоУровня = Локации_сервер.ПолучитьЛокациюПоСтране(СтранаСсылка);
			обЛокация.Долгота = ПараметрыЛокации.Долгота;
			обЛокация.Широта = ПараметрыЛокации.Широта;
			обЛокация.Записать();               
			ссРегион = обЛокация.Ссылка;
			ДозаполнитьЛогГеокодераИсточниками(СтруктураРезультата.ИдентификаторЗапроса, ссРегион);
			//Возврат ссЛокация;
		Иначе
			ТаблицаРегионов = РезультатЗапроса.Выгрузить();
			Если ТаблицаРегионов.Количество() > 1 Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найдено несколько регионов (%1) для создания локации (%2)", ПараметрыЛокации.Регион, ПараметрыЛокации.Наименование));
				Возврат Справочники.Локации.ПустаяСсылка();
			КонецЕсли;
			ссРегион = ТаблицаРегионов[0].Ссылка;
		КонецЕсли;
	КонецЕсли;       
	Возврат ссРегион;
КонецФункции

Процедура ЗаписатьЛогГеокодирования(ИдентификаторЗапроса, ТекстЗапроса) Экспорт
	мз = РегистрыСведений.ИсторияЗапросовКГеокодеру.СоздатьМенеджерЗаписи();
	мз.ИдентификаторЗапроса = ИдентификаторЗапроса;
	мз.ДатаЗапроса = ТекущаяДата();
	мз.ТекстЗапроса = ТекстЗапроса;
	мз.Пользователь = Пользователи.ТекущийПользователь();
	мз.СтатусОбработкиЗапроса = Перечисления.СтатусыОбработкиЗапросаГеокодера.ОтветПолученНеЗаписан;
	мз.Записать();
КонецПроцедуры  

Процедура ДозаполнитьЛогГеокодераИсточниками(ИдентификаторЗапроса, ЛокацияСсылка) Экспорт
	мз = РегистрыСведений.ИсторияЗапросовКГеокодеру.СоздатьМенеджерЗаписи();
	мз.ИдентификаторЗапроса = ИдентификаторЗапроса;
	мз.Прочитать();
	Если мз.Выбран() Тогда
		мз.ТипОбъектаИсточникаЗапроса = "Справочник.Локации.ДополнитьПоДаннымГеокодера";
		мз.ОбъектИсточникЗапроса = ЛокацияСсылка; 
		мз.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ДозаполнитьЛогГеокодераСтатусами(ИдентификаторЗапроса, Статус, РезультатОбработкиЗапроса) Экспорт
	мз = РегистрыСведений.ИсторияЗапросовКГеокодеру.СоздатьМенеджерЗаписи();
	мз.ИдентификаторЗапроса = ИдентификаторЗапроса;
	мз.Прочитать();
	Если мз.Выбран() Тогда
		мз.СтатусОбработкиЗапроса = Статус;
		мз.РезультатОбработкиЗапроса = РезультатОбработкиЗапроса;
		мз.Записать();
	КонецЕсли;
КонецПроцедуры

