
&НаКлиенте
Процедура СоздатьКонтейнерыEXCEL(Команда)
	
	ОткрытьФорму("Справочник.ТЕ.Форма.ФормаВводаКонтейнеров");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 15.10.2021 (
	Элементы.ФормаСоздатьКонтейнерыEXCEL.Доступность = РольДоступна("ПолныеПрава");
	//Евросиб Каблов 15.10.2021 )
	
	Список.Параметры.УстановитьЗначениеПараметра("Сегодня", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКТК", ОтборПоКТК.Количество() > 0);
	Список.Параметры.УстановитьЗначениеПараметра("СписокОтбора", ОтборПоКТК.ВыгрузитьЗначения());
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура excel_ВставитьСписокКТК(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	ОтборПоКТК.ЗагрузитьЗначения(Параметр1);
	
	ОтборПоКТКПриИзменении(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКТКПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКТК", ОтборПоКТК.Количество() > 0);
	Список.Параметры.УстановитьЗначениеПараметра("СписокОтбора", ОтборПоКТК.ВыгрузитьЗначения());
	
КонецПроцедуры
