
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )
	
	// + Состояния
	ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	//Евросиб Каблов 30.01.2021 ( Ticket#0219642
	ЗаполнитьРеквизитКоносамент();
	//Евросиб Каблов 30.01.2021 )
	
	//++ Зубов 04.08.2021 35854
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументТранспортныйДокументСоздатьНаОсновании.Заголовок = "Коносамент";
	//-- Зубов 04.08.2021 35854

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
		//Евросиб Каблов 15.09.2021 (
		ЗаполнитьРеквизитКоносамент();
		//Евросиб Каблов 15.09.2021 )
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб Каблов 15.09.2021 (
	ЗаполнитьРеквизитКоносамент();
	//Евросиб Каблов 15.09.2021 )
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ       

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

//Евросиб Каблов 30.01.2021 Ticket#0219642
&НаСервере
Процедура ЗаполнитьРеквизитКоносамент() Экспорт

	//Евросиб Каблов 15.09.2021 (
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//Евросиб Каблов 15.09.2021 ) 
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспортныйДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ГДЕ
		|	ТранспортныйДокумент.Букинг = &Букинг
		|	И ТранспортныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.Коносамент)";
		Запрос.УстановитьПараметр("Букинг", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		    Коносамент = Выборка.Ссылка;	
		КонецЕсли;
		
	//Евросиб Каблов 15.09.2021 (
	Иначе		
		Коносамент = Неопределено;		
	КонецЕсли;
	//Евросиб Каблов 15.09.2021 )

КонецПроцедуры

//++ Зубов 39457 23.09.2021
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.НомерБукинга.ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры
//-- Зубов 39457 23.09.2021 
