
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ++ Дудоров С.В. Ticket#61931 29.11.2022

	//Документ = Параметры.ДокументПоступления;
	//ДокументОбъект = Документ.ПолучитьОбъект();
	//// Евросиб Фролов (18.02.2022 Task №44768
	//// Обернул блокировку в попытку чтобы выходило понятное уведомление, а не сообщение об ошибке
	//// (если документ был предварительно изменен в форме).
	//Попытка
	//	ДокументОбъект.Заблокировать();
	//Исключение
	//	ОбщегоНазначения.СообщитьПользователю("Документ заблокирован для изменений. Попробуйте открыть его заново и повторить возврат задачи");
	//	Отказ = Истина;
	//КонецПопытки;
	//// Евросиб Фролов)

	//Для каждого СтрокаСостояния из Документ.Состояния Цикл
	//	НоваяСтрока = Задачи.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаСостояния);
	//КонецЦикла;

	ОбъектСсылка = Параметры.ДокументПоступления;
	Если ОбъектСсылка <> Неопределено Тогда
		ОбъектСогласования = ОбъектСсылка.ПолучитьОбъект();
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			"Объект согласования не определен. Попробуйте запустить процедуру отмены задачи из формы объекта или формы списка объекта.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектСогласования.Заблокировать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			"Объект согласования заблокирован для изменений. Попробуйте открыть его заново и повторить возврат задачи");
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	СтруктураСогласования = СогласованиеСервер.СогласованияДокумента(ОбъектСсылка);		
	Согласования 		  = СтруктураСогласования.Согласования;
	НачальныйСтатус       = СтруктураСогласования.НачальныйСтатус;
	
	СтатусВыполнено 	  = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен"); 
	
	Если не РольДоступна("ПолныеПрава") 
		и СтруктураСогласования.ТекущемуПользователюНеДоступенВозврат Тогда
		Сообщить("Возврат задач доступен только пользователям маршрута!");
		Отказ = Истина;
	КонецЕсли;	
	
	Пока Согласования.Следующий() Цикл
		// Для возврата доступны только состояния со строками больше последнего выполненного согласования	
		Если (Согласования.НомерСтроки <= СтруктураСогласования.НомерСтрокиПоследнегоВыполненногоСогласования) 
			Тогда 
				Продолжить;
		КонецЕсли; 
		// Убираем состояния со статусами, с которыми возврат не имеет смысл
		Если не Согласования.Статус = СтатусВыполнено Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = Задачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Согласования);
	КонецЦикла;
	
	//ИспользоватьСтатус = Истина;
	//Статус = Перечисления.СтатусыЭтапов.Выполнен;

	// -- Дудоров С.В. Ticket#61931 29.11.2022
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаСервере
Процедура ПриЗакрытииНаСервере()
	//++ Глеков Д.В. Ticket#0255784  03.02.2022 
	РазблокироватьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//++ Глеков Д.В. Ticket#0255784  03.02.2022 
	Если ЗавершениеРаботы <> ИСТИНА Тогда
		
		ПриЗакрытииНаСервере();
	
	КонецЕсли;
	//-- Глеков Д.В. Ticket#0255784  03.02.2022
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВозвратЗадачиПриИзменении(Элемент)
	КоличествоПомеченных = 0;
	Для каждого СтрокаЗадач из Задачи Цикл
		Если СтрокаЗадач.ВозвратЗадачи Тогда
			КоличествоПомеченных = КоличествоПомеченных+1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоПомеченных>1 Тогда
		Сообщить("Может быть выбрана только одна задача");
		ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
		ТекущиеДанные.ВозвратЗадачи = Ложь;
	КонецЕсли;
КонецПроцедуры

//++ Глеков Д.В. Ticket#0255784  03.02.2022 
&НаСервере
Процедура РазблокироватьДокумент()
	// ++ Дудоров С.В. Ticket#61931 29.11.2022
	//ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	// -- Дудоров С.В. Ticket#61931 29.11.2022
	Если ДокументОбъект.Заблокирован() Тогда
		ДокументОбъект.Разблокировать();
	КонецЕсли; 
КонецПроцедуры // РазблокироватьДокумент()

&НаКлиенте
Процедура Отмена(Команда)
	//++ Глеков Д.В. Ticket#0255784  03.02.2022  
	РазблокироватьДокумент();	
	//-- Глеков Д.В. Ticket#0255784  03.02.2022
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВозврат(Команда)
	
	Если Не ЗначениеЗаполнено(ПричинаВозврата) Тогда
		Сообщить("Укажите причину возврата");
	Иначе
		КоличествоПомеченных = 0;
		Для каждого СтрокаЗадач из Задачи Цикл
			Если СтрокаЗадач.ВозвратЗадачи Тогда
				КоличествоПомеченных = КоличествоПомеченных+1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПомеченных<1 Тогда
			Сообщить("Укажите задачу для возврата");
		Иначе
			// ++ Дудоров С.В. Ticket#61931 29.11.2022
			//ВыполнитьВозвратНаСервере();
			////++ Зубов US45321 TA45322 28.01.2022
			//Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			//	Оповестить("ЗаписьПоступлениеТоваровУслуг"); // ++ ДИТ Сгонник, 21-10-26 №27109
			//ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			//	Оповестить("ЗаписьКорректировкиПоступления");
			//// Евросиб Фролов (16.02.2022 Task №44768	
			//ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Заявка") Тогда
			//	Оповестить("ЗаписьЗаявки");
			//// Евросиб Фролов)
			//// Евросиб Фролов (04.05.2022 Task №41900	
			//ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПСЦ") Тогда
			//	Оповестить("ЗаписьПСЦ");
			//// Евросиб Фролов)
			//КонецЕсли;
			//-- Зубов US45321 TA45322 28.01.2022
			
			ВыполнитьВозвратНаСервере();

			ВладелецФормы = ЭтаФорма.ВладелецФормы;
			
			ЭтаФорма.Закрыть();
			
			Если не СтрНайти(ВладелецФормы.ИмяФормы,"ФормаСписка") > 0 Тогда 
				
				Попытка
					ВладелецФормы.Закрыть();
				Исключение
				КонецПопытки;
				
				ПоказатьЗначение(,ОбъектСсылка);			
				
			КонецЕсли;	
			// --Дудоров С.В. Ticket#61931 29.11.2022

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВозвратНаСервере()
	// ++Дудоров С.В. Ticket#61931 29.11.2022
	//ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	// обновляем информацию по состоянию 
	//МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	// --Дудоров С.В. Ticket#61931 29.11.2022

	Если ДокументОбъект.Заблокирован() Тогда
		ДокументОбъект.Разблокировать();
	КонецЕсли;
	
	//Евросиб Каблов 13.01.2022 ( 62514
	ДокументОбъект.ДополнительныеСвойства.Вставить("ВозвращаемыеЗадачи", Новый Массив);
	//Евросиб Каблов 13.01.2022 )
	
	Для каждого СтрокаЗадачи из Задачи Цикл
		Если СтрокаЗадачи.ВозвратЗадачи Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",СтрокаЗадачи.Состояние);
			ПараметрыОтбора.Вставить("Исполнитель",СтрокаЗадачи.Исполнитель);
			ПараметрыОтбора.Вставить("Наблюдатель",СтрокаЗадачи.Наблюдатель);
			ПараметрыОтбора.Вставить("Статус",СтрокаЗадачи.Статус);
			МассивСтрок = ДокументОбъект.Состояния.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаСостояния из МассивСтрок Цикл
				
				// ++Дудоров С.В. Ticket#61931 29.11.2022
				//СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
				СтрокаСостояния.Статус = НачальныйСтатус;
				// --Дудоров С.В. Ticket#61931 29.11.2022
				
				СтрокаСостояния.ПримечаниеЗадачаИсполнителю = Истина;
				СтрокаСостояния.Комментарий = ПричинаВозврата;				
				
				// ++ ДИТ Сгонник, 21-10-26 №27109
				//СтрокаСостояния.ЗавершениеРаботы = Дата("00010101"); 
				СтрокаСостояния.ДатаВозвратаИсполнителю = ТекущаяДата();
				// -- ДИТ Сгонник, 21-10-26 №27109
				
				//Евросиб Каблов 13.01.2022 ( 62514
				СтрокаСостояния.ВыполнениеЗафиксировано = Ложь;
				ДокументОбъект.ДополнительныеСвойства.ВозвращаемыеЗадачи.Добавить(СтрокаЗадачи.Состояние);
				//Евросиб Каблов 13.01.2022 )
				
				//ДИТ Шевченко А.В. US 92974 TA 99395 04.03.2025
				Если СтрокаСостояния.Исполнитель = Справочники.Пользователи.Робот Тогда
					Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
						РезультатЗапроса = Новый Массив;
						Для каждого Стр из ДокументОбъект.ПримененныйМаршрут.Состояния Цикл
							Статус = ?(РезультатЗапроса.Количество() = 0, ДокументОбъект.ПримененныйМаршрут.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
							РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем, УсловиеАвтоматическогоВыполнения", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ДокументОбъект.ПримененныйМаршрут, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, Стр.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем, Стр.УсловиеАвтоматическогоВыполнения));
						КонецЦикла;
						МаршрутизацияСервер.ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПоступлениеТоваровУслуг, ДокументОбъект.Дата, ДокументОбъект.ДоговорКонтрагента);
						
						Для Каждого СтрР Из РезультатЗапроса Цикл
							Если СтрР.Состояние = СтрокаСостояния.Состояние Тогда
								СтрокаСостояния.Исполнитель = СтрР.Исполнитель;
								Если НЕ ЗначениеЗаполнено(СтрокаСостояния.Исполнитель) Тогда СтрокаСостояния.Исполнитель = ДокументОбъект.Автор; КонецЕсли;
							КонецЕсли;	
						КонецЦикла;	
						
					КонецЕсли;
				КонецЕсли;	
				//ДИТ Шевченко А.В. US 92974 TA 99395 04.03.2025
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Евросиб Фролов (2.03.2022 Task №44768
	ДокументОбъект.ДополнительныеСвойства.Вставить("ВозвращенаЗадача");
	// Евросиб Фролов)
	
	ДокументОбъект.Записать();
	
КонецПроцедуры

// ++Дудоров С.В. Ticket#61931 29.11.2022
//&НаКлиенте
//Процедура УстановитьОтборПоСтатусу()
//	Отбор = Новый Структура;
//	Отбор.Вставить("Статус",Статус);
//	Элементы.Задачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УстановитьОтборПоСтатусу();
//КонецПроцедуры

//&НаКлиенте
//Процедура ИспользоватьСтатусПриИзменении(Элемент)
//	Если ИспользоватьСтатус Тогда
//		УстановитьОтборПоСтатусу();
//	Иначе
//		Элементы.Задачи.ОтборСтрок = Неопределено;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура СтатусПриИзменении(Элемент)
//	Если ИспользоватьСтатус Тогда
//		УстановитьОтборПоСтатусу();
//	КонецЕсли;
//КонецПроцедуры 

// --Дудоров С.В. Ticket#61931 29.11.2022


