
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Евросиб Коханенко Н.А. 08.12.2022 (( #61705 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. 08.12.2022 )) #61705
	
	//Евросиб Коханенко Н.А. 25.11.2024 (( #95714 
	Если Параметры.Отбор.Свойство("ОграничениеПоДатеИспользования") Тогда
		ГруппаОтбораИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, 
																					"Ограничение по дате использования", 
																					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);	
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаНеИспользовать");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Дата(1,1,1);
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаНеИспользовать");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.ОграничениеПоДатеИспользования;    
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.11.2024 )) #95714 
	
	//Евросиб Коханенко Н.А. 13.12.2024 (( #97643 
	Если Параметры.Отбор.Свойство("РазрешитьВРП")
			И Параметры.Отбор.РазрешитьВРП = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ИмяПредопределенныхДанных", "ВРП", ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 13.12.2024 )) #97643 
	
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации 
КонецПроцедуры
	
//Евросиб Коханенко Н.А. 08.12.2022 (( #61705 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры //Евросиб Коханенко Н.А. 08.12.2022 )) #61705 
//Евросиб Коханенко Н.А. 08.12.2022 )) #61705
	
	
