
Процедура ЗафиксироватьИзмененияСчетаПоступления(Документ, МассивИзменений) Экспорт
	
	Фиксация = Справочники.ФиксацияИзмененийСчетаПоступления.СоздатьЭлемент();
	Фиксация.ИзменяемыйДокумент = Документ; 
	Фиксация.ДатаИзменения = ТекущаяДата();
	
	Для Каждого СтрокаИзменений из МассивИзменений Цикл
		НовоеИзменение = Фиксация.ИзмененияДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеИзменение, СтрокаИзменений);
	КонецЦикла;
	
	Фиксация.Записать();	

КонецПроцедуры


Процедура ВыявитьИЗафиксироватьИзмененияСчета(ОбъектТовары, СсылкаТовары, Ссылка, ДополнительныеСвойства) Экспорт
	
	//Евросиб СубботинВ #118799 09.10.2025 Начало
	Если не ОбщегоНазначения.КоллекцииИдентичны(ОбъектТовары, СсылкаТовары) Тогда			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектТовары.НомерСтроки КАК НомерСтроки,
		|	ОбъектТовары.Номенклатура КАК Номенклатура,
		|	ОбъектТовары.Содержание КАК Содержание,
		|	ОбъектТовары.Количество КАК Количество,
		|	ОбъектТовары.Цена КАК Цена,
		|	ОбъектТовары.Сумма КАК Сумма,
		|	ОбъектТовары.СтавкаНДС КАК СтавкаНДС,
		|	ОбъектТовары.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыПослеИзменений
		|ИЗ
		|	&ОбъектТовары КАК ОбъектТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СсылкаТовары.НомерСтроки КАК НомерСтроки,
		|	СсылкаТовары.Номенклатура КАК Номенклатура,
		|	СсылкаТовары.Содержание КАК Содержание,
		|	СсылкаТовары.Количество КАК Количество,
		|	СсылкаТовары.Цена КАК Цена,
		|	СсылкаТовары.Сумма КАК Сумма,
		|	СсылкаТовары.СтавкаНДС КАК СтавкаНДС,
		|	СсылкаТовары.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыДоИзменения
		|ИЗ
		|	&СсылкаТовары КАК СсылкаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	ТоварыПослеИзменений.НомерСтроки КАК НомерСтроки,
		|	ЕстьNULL(ТоварыПослеИзменений.Номенклатура, ТоварыДоИзменения.Номенклатура) КАК Номенклатура,
		|	ЕстьNULL(ТоварыПослеИзменений.Содержание, ТоварыДоИзменения.Содержание) КАК Содержание,
		|	ЕСТЬNULL(ТоварыПослеИзменений.Количество, 0) - ЕСТЬNULL(ТоварыДоИзменения.Количество, 0) КАК ДельтаКоличества,
		|	ЕСТЬNULL(ТоварыПослеИзменений.Цена, 0) - ЕСТЬNULL(ТоварыДоИзменения.Цена, 0) КАК ДельтаЦены,
		|	ЕСТЬNULL(ТоварыПослеИзменений.Сумма, 0) - ЕСТЬNULL(ТоварыДоИзменения.Сумма, 0) КАК ДельтаСуммы,
		|ВЫБОР
		|	КОГДА НЕ ТоварыПослеИзменений.СтавкаНДС = ТоварыДоИзменения.СтавкаНДС
		|		ТОГДА ЕСТЬNULL(ТоварыПослеИзменений.СтавкаНДС, ТоварыДоИзменения.СтавкаНДС) 
		|      Иначе ЕСТЬNULL(ТоварыДоИзменения.СтавкаНДС,ТоварыПослеИзменений.СтавкаНДС)
		|КОНЕЦ КАК СтавкаНДС,
		|	ЕСТЬNULL(ТоварыПослеИзменений.СуммаНДС, 0) - ЕСТЬNULL(ТоварыДоИзменения.СуммаНДС, 0) КАК ДельтаНДС,
		|	ВЫБОР
		|		КОГДА НЕ ТоварыДоИзменения.Номенклатура = ТоварыПослеИзменений.Номенклатура
		|				И НЕ ТоварыДоИзменения.Содержание = ТоварыПослеИзменений.Содержание
		|				И НЕ ТоварыДоИзменения.СтавкаНДС = ТоварыПослеИзменений.СтавкаНДС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФормированиеНовойСтроки,
		|	ТоварыДоИзменения.Количество КАК КоличествоДоИзменения,
		|	ТоварыДоИзменения.Цена КАК ЦенаДоИзменения,
		|	ТоварыДоИзменения.Сумма КАК СуммаДоИзменения,
		|	ТоварыДоИзменения.СуммаНДС КАК СуммаНДСДоИзменения,
		|	ТоварыПослеИзменений.Количество КАК КоличествоПослеИзменений,
		|	ТоварыПослеИзменений.Цена КАК ЦенаПослеИзменений,
		|	ТоварыПослеИзменений.Сумма КАК СуммаПослеИзменений,
		|	ТоварыПослеИзменений.СуммаНДС КАК СуммаНДСПослеИзменений,
		|	&ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	ТоварыПослеИзменений КАК ТоварыПослеИзменений
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыДоИзменения КАК ТоварыДоИзменения
		|		ПО ТоварыПослеИзменений.НомерСтроки = ТоварыДоИзменения.НомерСтроки
		|			И ТоварыПослеИзменений.Номенклатура = ТоварыДоИзменения.Номенклатура";
		
		
		Запрос.УстановитьПараметр("СсылкаТовары", СсылкаТовары);
		Запрос.УстановитьПараметр("ОбъектТовары", ОбъектТовары);
		Запрос.УстановитьПараметр("ДатаИзменения", ТекущаяДата());
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивСтрокДляФиксацииИзменений = Новый Массив;		
		СформироватьМассивСтрокДляФиксацииИзменений(ВыборкаДетальныеЗаписи, МассивСтрокДляФиксацииИзменений);		
		Справочники.ФиксацияИзмененийСчетаПоступления.ЗафиксироватьИзмененияСчетаПоступления(Ссылка, МассивСтрокДляФиксацииИзменений);
		
		ДополнительныеСвойства.Вставить("СозданаФиксацияИзменений", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьИзменнияПоступления(ТаблицаУслуг, Ссылка, ДополнительныеСвойства) Экспорт
	
	МассивСтрокДляФиксацииИзменений = Новый Массив;	
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		ДанныеИзменения = Новый Структура("Содержание, Номенклатура, СтавкаНДС, Количество, Цена, Сумма, СуммаНДС, ДатаИзменения") ;
        ЗаполнитьЗначенияСвойств(ДанныеИзменения, СтрокаУслуг);
		ДанныеДоИзменения = Новый Структура("Содержание, Номенклатура, СтавкаНДС, Количество, Цена, Сумма, СуммаНДС, ДатаИзменения",
						СтрокаУслуг.СодержаниеДоИзменения, СтрокаУслуг.Номенклатура, СтрокаУслуг.СтавкаНДСДоИзменения, СтрокаУслуг.КоличествоДоИзменения,
						СтрокаУслуг.ЦенаДоИзменения, СтрокаУслуг.СуммаДоИзменения, СтрокаУслуг.СуммаНДСДоИзменения);
        Если не ОбщегоНазначения.КоллекцииИдентичны(ДанныеИзменения, ДанныеДоИзменения) Тогда
			ДанныеИзменения.Количество 	=  СтрокаУслуг.Количество - СтрокаУслуг.КоличествоДоИзменения;
			ДанныеИзменения.Цена  		=  СтрокаУслуг.Цена - СтрокаУслуг.ЦенаДоИзменения;
			ДанныеИзменения.Сумма 		=  СтрокаУслуг.Сумма - СтрокаУслуг.СуммаДоИзменения;
			ДанныеИзменения.СуммаНДС	=  СтрокаУслуг.СуммаНДС - СтрокаУслуг.СуммаНДСДоИзменения;
			ДанныеИзменения.ДатаИзменения = ТекущаяДата();
			МассивСтрокДляФиксацииИзменений.Добавить(ДанныеИзменения);
		КонецЕсли;
	КонецЦикла;
	Если НЕ МассивСтрокДляФиксацииИзменений.Количество() = 0 Тогда
		Справочники.ФиксацияИзмененийСчетаПоступления.ЗафиксироватьИзмененияСчетаПоступления(Ссылка, МассивСтрокДляФиксацииИзменений);
		ДополнительныеСвойства.Вставить("СозданаФиксацияИзменений", Истина); 
	КонецЕсли;
	
КонецПроцедуры 

Процедура СформироватьМассивСтрокДляФиксацииИзменений(ВыборкаДетальныеЗаписи, МассивСтрокДляФиксацииИзменений)
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДельтаКоличества = 0 и ВыборкаДетальныеЗаписи.ДельтаЦены  = 0
			и ВыборкаДетальныеЗаписи.ДельтаСуммы = 0 и ВыборкаДетальныеЗаписи.ДельтаНДС   = 0
			и НЕ ВыборкаДетальныеЗаписи.ФормированиеНовойСтроки  Тогда 
			Продолжить
		ИначеЕсли НЕ ВыборкаДетальныеЗаписи.ДельтаКоличества = 0 или НЕ ВыборкаДетальныеЗаписи.ДельтаЦены  = 0
			или НЕ ВыборкаДетальныеЗаписи.ДельтаСуммы = 0 или НЕ ВыборкаДетальныеЗаписи.ДельтаНДС = 0 или  ВыборкаДетальныеЗаписи.ФормированиеНовойСтроки  Тогда
			ДанныеИзменения = Новый Структура("Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС, ДатаИзменения");
			ЗаполнитьЗначенияСвойств(ДанныеИзменения, ВыборкаДетальныеЗаписи, "Номенклатура, Содержание, СтавкаНДС, ДатаИзменения");
			
			ДанныеИзменения.Количество = ВыборкаДетальныеЗаписи.ДельтаКоличества;
			ДанныеИзменения.Цена = ВыборкаДетальныеЗаписи.ДельтаЦены;
			ДанныеИзменения.Сумма = ВыборкаДетальныеЗаписи.ДельтаСуммы;
			ДанныеИзменения.СуммаНДС = ВыборкаДетальныеЗаписи.ДельтаНДС; 
			
			МассивСтрокДляФиксацииИзменений.Добавить(ДанныеИзменения);	
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры	

