
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 13.01.2021 (
	РольПолныеПраваДоступна = РольДоступна("ПолныеПрава");
	Элементы.Список.ИзменятьСоставСтрок = РольПолныеПраваДоступна;
	//Евросиб Каблов 13.01.2021 )

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

    ОценкаПроизводительностиКлиент.ЗамерВремени("АкцептОткрытиеФормы");

КонецПроцедуры
