
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("РейсыАвто", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

// ДИТ US 83871 ТА 84799 Сержантова А.С. 08.05.2024
Процедура ОбновитьДанныеВАвтоРейсеСтрокиЗапросаНаАвто(СтрокаЗапросаНаАвто, Заявка, ЭтапПеревозки) Экспорт   
	
	Если СтрокаЗапросаНаАвто.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ВРаботе 
		или СтрокаЗапросаНаАвто.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ГотовКВыдачеВРейс 
		или СтрокаЗапросаНаАвто.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ВыданВРейс 
		или СтрокаЗапросаНаАвто.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.Закрыт Тогда
		
		МассивКлючей = Новый Массив;
		МассивКлючей.Добавить(СтрокаЗапросаНаАвто.КлючАналитикиПеревозки);
		ЗначениеПолейКлюча = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей, ЭтапПеревозки);
		
		СтруктураЗаполненияАвтоРейса = Новый Структура("Заявка,Контейнер,Перевозчик,ПунктНазначения,ПунктОтправления,ДатаОтправления,ДатаПрибытия");   
		СтруктураЗаполненияАвтоРейса.Заявка = Заявка;
		СтруктураЗаполненияАвтоРейса.Контейнер = СтрокаЗапросаНаАвто.КлючАналитикиПеревозки.Контейнер; 
		СтруктураЗаполненияАвтоРейса.Перевозчик =  ЗначениеПолейКлюча[0].Автоперевозчик; 
		СтруктураЗаполненияАвтоРейса.ДатаОтправления = ЗначениеПолейКлюча[0].ДатаВыдачиКТКсТерминала; 
		СтруктураЗаполненияАвтоРейса.ДатаПрибытия = ЗначениеПолейКлюча[0].ДатаСдачиКТКнаТерминал;
		Если СтрокаЗапросаНаАвто.НеТребуетсяТерминалСдачи Тогда
			СтруктураЗаполненияАвтоРейса.ПунктНазначения = СтрокаЗапросаНаАвто.АдресСкладаФакт;
			СтруктураЗаполненияАвтоРейса.ДатаПрибытия = СтрокаЗапросаНаАвто.ДатаЗавершенияОперацииНаСкладеКлиента;
		Иначе
			СтруктураЗаполненияАвтоРейса.ПунктНазначения = СтрокаЗапросаНаАвто.ТерминалСдачиФакт;
		КонецЕсли;
		Если СтрокаЗапросаНаАвто.НеТребуетсяТерминалВыдачи Тогда
			СтруктураЗаполненияАвтоРейса.ПунктОтправления = СтрокаЗапросаНаАвто.АдресСкладаФакт;
			СтруктураЗаполненияАвтоРейса.ДатаОтправления = СтрокаЗапросаНаАвто.ДатаЗавершенияОперацииНаСкладеКлиента;
		Иначе
			СтруктураЗаполненияАвтоРейса.ПунктОтправления = СтрокаЗапросаНаАвто.ТерминалВыдачиФакт;
		КонецЕсли;
		Если не ЗначениеЗаполнено(СтрокаЗапросаНаАвто.РейсАвто) Тогда
			НовыйАвторейс = Справочники.РейсыАвто.СоздатьЭлемент();
			НовыйАвторейс.Записать();
			СтрокаЗапросаНаАвто.РейсАвто = НовыйАвторейс.Ссылка;
		КонецЕсли;
		ОбновитьДанныеВАвтоРейсе(СтрокаЗапросаНаАвто.РейсАвто, СтруктураЗаполненияАвтоРейса);
	ИначеЕсли СтрокаЗапросаНаАвто.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.Отменен 
		и ЗначениеЗаполнено(СтрокаЗапросаНаАвто.РейсАвто) Тогда 
		СтруктураЗаполненияАвтоРейса = Новый Структура("Заявка", Заявка); 
		ОбновитьДанныеВАвтоРейсе(СтрокаЗапросаНаАвто.РейсАвто, СтруктураЗаполненияАвтоРейса, Истина);  
		СтрокаЗапросаНаАвто.РейсАвто = Справочники.РейсыАвто.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры    

// ДИТ US 83871 ТА 84799 Сержантова А.С. 08.05.2024
Процедура ОбновитьДанныеВАвтоРейсе(АвтоРейсСсылка, ДанныеОбновления, ЭтоУдаление = Ложь)

	РейсОбъект = АвтоРейсСсылка.ПолучитьОбъект();   
	Если ЭтоУдаление Тогда
	    РейсОбъект.ПометкаУдаления = Истина;  
		РейсОбъект.РейсОтменен = Истина;
	Иначе	
		ЗаполнитьЗначенияСвойств(РейсОбъект, ДанныеОбновления); 
	КонецЕсли;
	РейсОбъект.Записать();
	
	ЗаявкаОбъект = ДанныеОбновления.Заявка.ПолучитьОбъект();
	СтрокиПоРейсу = ЗаявкаОбъект.ПереченьРейсов.НайтиСтроки(Новый Структура("Рейс", АвтоРейсСсылка));
	Если СтрокиПоРейсу.Количество() = 0 Тогда  
		НС = ЗаявкаОбъект.ПереченьРейсов.Добавить();
		НС.Рейс = АвтоРейсСсылка;  
		Попытка
			ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
			ЗаявкаОбъект.Записать();  
		Исключение 
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Добавление рейса в заявку", 
				УровеньЖурналаРегистрации.Ошибка, ДанныеОбновления.Заявка, АвтоРейсСсылка, "Не удалось добавить авторейс в Перечень рейсов");  
		КонецПопытки;
	ИначеЕсли ЭтоУдаление и СтрокиПоРейсу.Количество() Тогда
		Для каждого СтрРейса Из СтрокиПоРейсу Цикл
			ЗаявкаОбъект.ПереченьРейсов.Удалить(СтрРейса);
		КонецЦикла;  
		Попытка
			ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
			ЗаявкаОбъект.Записать();  
		Исключение 
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Добавление рейса в заявку", 
				УровеньЖурналаРегистрации.Ошибка, ДанныеОбновления.Заявка, АвтоРейсСсылка, "Не удалось удалить авторейс из Перечня рейсов");  
		КонецПопытки;
	КонецЕсли;     

КонецПроцедуры
