// ДИТ US 83871 ТА 84799 Сержантова А.С. 13.05.2024
Процедура ПередЗаписью(Отказ)
	// ДИТ US 83871 ТА 84799 Сержантова А.С. Начало: 21.05.2024
	// Было:
	//Наименование = "" + Контейнер + ?(ЗначениеЗаполнено(МестоПогрузки) или ЗначениеЗаполнено(МестоРагрузки), 
	//			", " + МестоПогрузки + " - " + МестоРагрузки, "");  
	//Стало:
	Наименование = "АР " + ?(ЗначениеЗаполнено(ПунктОтправления), ПунктОтправления, "")
			  + " - " + ?(ЗначениеЗаполнено(ПунктНазначения), ПунктНазначения, "") 
			  + ?(ЗначениеЗаполнено(Контейнер), ", " + Контейнер, ""); 
	// ДИТ US 83871 ТА 84799 Сержантова А.С. Конец: 21.05.2024
КонецПроцедуры
