
Функция Печать_ОтправкаОперативныйПриказ(ТекСсылка) Экспорт

	Рез = Новый ТабличныйДокумент;
	
	Макет = Документы.Сделка.ПолучитьМакет("Макет_ОтправкаОперативныйПриказ");
	ОблШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Рез.Вывести(ОблШапкаТаб);
				   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	               |	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НПП,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.ПортНазначения.КодПорта КАК КодПортаНазн,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ.КодISO КАК ISOкод,
	               |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК Накладная,
	               |	"""" КАК СобственникКТК,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозки,
	               |	СделкаСвязьУчетныхЕдиниц.ВозвратныйКлиент КАК ВозвратныйКлиент,
	               |	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	               |	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	               |	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	               |	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	               |	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	               |	СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки,
	               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОтправки КАК ДатаОтправки,
	               |	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	               |	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ПравилоГотовностиКВыставлению КАК ПравилоГотовностиКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы,
	               |	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	               |	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	               // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	               //ок(
	               //|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	               //ок)
	               |	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	               |	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	               // ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	               |	СделкаСвязьУчетныхЕдиниц.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК КонтейнерСсылка,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН КАК НакладнаяЭТРАН,
				   // Евросиб Фролов (26.12.2021 TASK №44663
                   |	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
				   // Евросиб Фролов)
	               |ПОМЕСТИТЬ ТЧСделки
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаспортаВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ПаспортаВагоновСрезПоследних.Собственник КАК Собственник,
	               |	ПаспортаВагоновСрезПоследних.Арендатор КАК Арендатор,
	               |	ПаспортаВагоновСрезПоследних.ВАренде КАК ВАренде
	               |ПОМЕСТИТЬ ПаспортаВагонов
	               |ИЗ
	               |	РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |ГДЕ
	               |	ПаспортаВагоновСрезПоследних.Вагон В
	               |			(ВЫБРАТЬ
	               |				ТЧСделки.Вагон КАК Вагон
	               |			ИЗ
	               |				ТЧСделки КАК ТЧСделки
	               |			СГРУППИРОВАТЬ ПО
	               |				ТЧСделки.Вагон)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧСделки.Ссылка КАК Ссылка,
	               |	ТЧСделки.НПП КАК НПП,
	               |	ТЧСделки.Контейнер КАК Контейнер,
	               |	ТЧСделки.КодПортаНазн КАК КодПортаНазн,
	               |	ТЧСделки.ISOкод КАК ISOкод,
	               |	ТЧСделки.Накладная КАК Накладная,
	               |	ПаспортаВагонов.Собственник КАК СобственникВагона,
	               |	ТЧСделки.Вагон КАК Вагон,
	               |	ПОДСТРОКА(ТЧСделки.Вагон.Наименование, 1, 3) + ""-"" + ПОДСТРОКА(ТЧСделки.Вагон.Наименование, 4, 150) КАК Платформа,
	               |	ТЧСделки.Груз.Наименование КАК Груз,
	               |	ЗаявкаСоставУслуги.КоличествоМест КАК Мест,
	               |	ТЧСделки.ВесГрузаНетто КАК Нетто,
	               |	ЗаявкаСоставУслуги.Пломбы КАК Пломбы,
	               |	"""" КАК Стаффировка,
	               |	"""" КАК ГТД,
	               |	"""" КАК Экспедитор,
	               |	ТЧСделки.Клиент КАК Клиент,
	               |	ТЧСделки.Договор КАК Договор,
	               |	ТЧСделки.УсловияПеревозки КАК УсловияПеревозки,
	               |	ТЧСделки.ВозвратныйКлиент КАК ВозвратныйКлиент,
	               |	ТЧСделки.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	               |	ТЧСделки.Калькуляция КАК Калькуляция,
	               |	ТЧСделки.РазмерКТК КАК РазмерКТК,
	               |	ТЧСделки.НеАктивна КАК НеАктивна,
	               |	ТЧСделки.МорскойРейс КАК МорскойРейс,
	               |	ТЧСделки.Коносамент КАК Коносамент,
	               |	ТЧСделки.ЖДН КАК ЖДН,
	               |	ТЧСделки.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	               |	ТЧСделки.Заявка КАК Заявка,
	               |	ТЧСделки.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	               |	ТЧСделки.УчастокПеревозки КАК УчастокПеревозки,
	               |	ТЧСделки.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	               |	ТЧСделки.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	               |	ТЧСделки.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	               |	ТЧСделки.ДатаОтправки КАК ДатаОтправки,
	               |	ТЧСделки.ГотовоКВыставлению КАК ГотовоКВыставлению,
	               |	ТЧСделки.ПравилоГотовностиКВыставлению КАК ПравилоГотовностиКВыставлению,
	               |	ТЧСделки.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	               |	ТЧСделки.ДокументыСформированы КАК ДокументыСформированы,
	               |	ТЧСделки.Груженый КАК Груженый,
	               |	ТЧСделки.ПортОтправления КАК ПортОтправления,
	               // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	               //ок(
	               //|	ТЧСделки.СобственностьПеревозимогоКТК КАК СобственникКТК,
	               //ок)
	               |	ТЧСделки.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственникКТК,
	               |	ТЧСделки.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	               // ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	               |	ТЧСделки.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
	               |	ТЧСделки.ЖДН.СтанцияОтправления КАК ЖДНСтанцияОтправления,
	               |	ТЧСделки.ЖДН.СтанцияОтправления.КодЖДСтанции + "" "" + ТЧСделки.ЖДН.СтанцияОтправления.Наименование КАК СтОтправления,
	               |	ТЧСделки.ЖДН.СтанцияНазначения КАК ЖДНСтанцияНазначения,
	               |	ТЧСделки.ЖДН.СтанцияНазначения.КодЖДСтанции + "" "" + ТЧСделки.ЖДН.СтанцияНазначения.Наименование КАК СтНазначения,
	               |	ТЧСделки.ЖДН.НакладнаяЭТРАН.Грузоотправитель КАК Отправитель,
	               |	ТЧСделки.ЖДН.НакладнаяЭТРАН.Грузополучатель КАК Получатель,
	               |	ТЧСделки.ЖДН.НакладнаяЭТРАН.ГрузоотправительАдрес КАК АдресОтправителя,
	               |	ТЧСделки.ЖДН.НакладнаяЭТРАН.ГрузополучательАдрес КАК АдресПолучателя,
	               |	ТЧСделки.ЖДН.НакладнаяЭТРАН КАК ЖДННакладнаяЭТРАН
	               |ИЗ
	               |	ТЧСделки КАК ТЧСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортаВагонов КАК ПаспортаВагонов
	               |		ПО ТЧСделки.Вагон = ПаспортаВагонов.Вагон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ПО ТЧСделки.Заявка = ЗаявкаСоставУслуги.Ссылка
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   // Сделал связь только по ГУИДу
				   //|			И ТЧСделки.КонтейнерСсылка = ЗаявкаСоставУслуги.НомерКТК
				   //|			И (ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))				  
                   |			И ТЧСделки.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
				   // Евросиб Фролов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	э_НакладнаяГрузы.*
	               |ИЗ
	               |	Документ.э_Накладная.Грузы КАК э_НакладнаяГрузы
	               |ГДЕ
	               |	э_НакладнаяГрузы.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТЧСделки.НакладнаяЭТРАН КАК НакладнаяЭТРАН
	               |			ИЗ
	               |				ТЧСделки КАК ТЧСделки
	               |			СГРУППИРОВАТЬ ПО
	               |				ТЧСделки.НакладнаяЭТРАН)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	э_НакладнаяГрузыЖД.*
	               |ИЗ
	               |	Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |ГДЕ
	               |	э_НакладнаяГрузыЖД.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТЧСделки.НакладнаяЭТРАН КАК НакладнаяЭТРАН
	               |			ИЗ
	               |				ТЧСделки КАК ТЧСделки
	               |			СГРУППИРОВАТЬ ПО
	               |				ТЧСделки.НакладнаяЭТРАН)";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСсылка);
	
	Резы = Запрос.ВыполнитьПакет();
	
	ТЗРез = Резы[2].Выгрузить();
	ТЗГрузы = Резы[3].Выгрузить();
	ТЗГрузыЖД = Резы[4].Выгрузить();
	
	Для каждого СтрТЗ Из ТЗРез Цикл
	
		ОблСтрокаТаб = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ЗаполнитьЗначенияСвойств(ОблСтрокаТаб.Параметры, СтрТЗ);
		
		Если Не ЗначениеЗаполнено(СтрТЗ.ГТД) Тогда
		
			А = 1;
			
			ИскМас1 = ТЗГрузыЖД.НайтиСтроки(Новый Структура("Ссылка", СтрТЗ.ЖДННакладнаяЭТРАН) ) ;
			ТД = "";
			Если ИскМас1.Количество() > 0 Тогда
			
				Для каждого Стр_ТЗГрузыЖД Из ИскМас1 Цикл
					
					Если СокрЛП(Стр_ТЗГрузыЖД.НомерГТД) <> "" Тогда
					
						ТД = ТД + ?(ТД="", "", ", ") + Стр_ТЗГрузыЖД.НомерГТД;
					
					КонецЕсли; 
					
				КонецЦикла; 
			
			КонецЕсли; 
			
			ИскМас2 = ТЗГрузы.НайтиСтроки(Новый Структура("Ссылка", СтрТЗ.ЖДННакладнаяЭТРАН) );
			Если ИскМас2.Количество() > 0 Тогда
			
				Для каждого Стр_ТЗГрузы Из ИскМас2 Цикл
					
					Если СокрЛП(Стр_ТЗГрузы.НомерГТД) <> "" Тогда
					
						ТД = ТД + ?(ТД="", "", ", ") + Стр_ТЗГрузы.НомерГТД;
					
					КонецЕсли; 
					
				КонецЦикла; 
			
			КонецЕсли;
			
			ОблСтрокаТаб.Параметры.ГТД = ТД; 
			
		КонецЕсли; 
		
		Рез.Вывести(ОблСтрокаТаб);
	
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции // Печать_ОтправкаОперативныйПриказ(ТекОбъект) Экспорт
 
Функция ПолучитьВладельцевУказанныхВагонов(СписокВагонов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПаспортаВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ПаспортаВагоновСрезПоследних.Собственник КАК Собственник,
	               |	ПаспортаВагоновСрезПоследних.Арендатор КАК Арендатор,
	               |	ПаспортаВагоновСрезПоследних.ВАренде КАК ВАренде
	               |ИЗ
	               |	РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |ГДЕ
	               |	ПаспортаВагоновСрезПоследних.Вагон В(&Вагоны)";
	Запрос.УстановитьПараметр("Вагоны", СписокВагонов);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат.Вставить(Ответ.Вагон, Новый Структура("ВладелецВагона, АрендаторВагона, ВАренде", Ответ.Собственник, Ответ.Арендатор, Ответ.ВАренде));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Печать_ОперативныйПриказ(ТекСсылка) Экспорт

	Рез = Новый ТабличныйДокумент;
	
	Макет = Документы.Сделка.ПолучитьМакет("Макет_ОперативныйПриказ2");
	ОблШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Рез.Вывести(ОблШапкаТаб);
				   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	               |	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НПП,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.ПортНазначения.КодПорта КАК КодПортаНазн,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ КАК ТипКТК,
	               |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК Накладная,
	               |	"""" КАК СобственникКТК,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозки,
	               |	СделкаСвязьУчетныхЕдиниц.ВозвратныйКлиент КАК ВозвратныйКлиент,
	               |	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	               |	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	               |	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	               |	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	               |	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	               |	СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки,
	               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОтправки КАК ДатаОтправки,
	               |	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	               |	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ПравилоГотовностиКВыставлению КАК ПравилоГотовностиКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	               |	СделкаСвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы,
	               |	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	               |	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	               // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	               //ок(
	               //|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	               //ок)
	               |	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	               |	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	               // ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	               |	СделкаСвязьУчетныхЕдиниц.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК КонтейнерСсылка,
				   |	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН КАК НакладнаяЭТРАН,
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   |	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
				   // Евросиб Фролов)
				   |ПОМЕСТИТЬ ТЧСделки
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаспортаВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ПаспортаВагоновСрезПоследних.Собственник КАК Собственник,
	               |	ПаспортаВагоновСрезПоследних.Арендатор КАК Арендатор,
	               |	ПаспортаВагоновСрезПоследних.ВАренде КАК ВАренде
	               |ПОМЕСТИТЬ ПаспортаВагонов
	               |ИЗ
	               |	РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	               |ГДЕ
	               |	ПаспортаВагоновСрезПоследних.Вагон В
	               |			(ВЫБРАТЬ
	               |				ТЧСделки.Вагон КАК Вагон
	               |			ИЗ
	               |				ТЧСделки КАК ТЧСделки
	               |			СГРУППИРОВАТЬ ПО
	               |				ТЧСделки.Вагон)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧСделки.Ссылка КАК Ссылка,
	               |	ТЧСделки.Контейнер КАК НомерКТК,
	               |	ТЧСделки.ТипКТК КАК ТипКТК,
	               |	ТЧСделки.Накладная КАК Накладная,
	               |	ПаспортаВагонов.Собственник КАК СобственникВагона,
	               |	ТЧСделки.Вагон КАК Вагон,
	               |	ТЧСделки.Груз.Наименование КАК НаименованиеГруза,
	               |	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
	               |	ТЧСделки.ВесГрузаНетто КАК НеттоВесГруза,
	               |	ЗаявкаСоставУслуги.Пломбы КАК Пломбы,
	               |	ТЧСделки.Заявка КАК Заявка,
	               |	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
	               |	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
	               |	ЗаявкаСоставУслуги.Грузополучатель КАК Грузополучатель,
	               |	ЗаявкаСоставУслуги.Грузоотправитель КАК Грузоотправитель,
	               |	ЗаявкаСоставУслуги.КодГруза КАК КодГруза,
	               |	ЗаявкаСоставУслуги.ОсобыеОтметки КАК ОсобыеОтметки,
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 08.02.2023
				   // Было:
				   //|	ЗаявкаСоставУслуги.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего
				   //Стало: 
				   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцииПоСдачеПорожнего
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 08.02.2023
				   |ИЗ
				   |	ТЧСделки КАК ТЧСделки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортаВагонов КАК ПаспортаВагонов
	               |		ПО ТЧСделки.Вагон = ПаспортаВагонов.Вагон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ПО ТЧСделки.Заявка = ЗаявкаСоставУслуги.Ссылка
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   //|			И ТЧСделки.КонтейнерСсылка = ЗаявкаСоставУслуги.НомерКТК
				   //|			И (ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))
				   |			И ТЧСделки.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
				   // Евросиб Фролов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НПП";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСсылка);
	
	Рез2 = Запрос.Выполнить();
	
	ТЗРез = Рез2.Выгрузить();
	
	Для каждого СтрТЗ Из ТЗРез Цикл
	
		ОблСтрокаТаб = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ЗаполнитьЗначенияСвойств(ОблСтрокаТаб.Параметры, СтрТЗ);
		
		Рез.Вывести(ОблСтрокаТаб);
	
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции // Печать_ОтправкаОперативныйПриказ(ТекОбъект) Экспорт
//
//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
Процедура ЗаполнитьДокументыФФДвСоставеПоезда(Объект, СтруктураПоиска)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(ФФД_СчетЖД.Документ, ФФД_Правило.Документ) КАК ДокументФФД
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_Правило
	|			ПО ФормированиеФинДокументов.Ссылка = ФФД_Правило.Документ
	|		ПО ВТ_СвязьУчетныхЕдиниц.Клиент = ФормированиеФинДокументов.Контрагент
	|			И (ВЫБОР
	|				КОГДА &ПовагонныеОтправки
	|					ТОГДА ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|				ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = ВТ_СвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки
	|			КОНЕЦ)
	|			И (ФормированиеФинДокументов.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетЖД
	|		ПО ВТ_СвязьУчетныхЕдиниц.СчетЖД = ФФД_СчетЖД.Документ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Объект.СвязьУчетныхЕдиниц.Выгрузить(СтруктураПоиска,"ГУИД,Клиент,Калькуляция,СчетЖД"));
	Запрос.УстановитьПараметр("ПовагонныеОтправки", Объект.ПовагонныеОтправки);
	ТЗДокументыФФД = Запрос.Выполнить().Выгрузить();

	СтрокиТЧСвязьУчетныхЕдиниц = Объект.СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаДляУстановкиПравилФормирования Из СтрокиТЧСвязьУчетныхЕдиниц Цикл
		ДокументФФД = ТЗДокументыФФД.Найти(СтрокаДляУстановкиПравилФормирования.ГУИД,"ГУИД").ДокументФФД;	
		СтрокаДляУстановкиПравилФормирования.ДокументФФД = ДокументФФД;
	КонецЦикла;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец

//Процедура ПроверитьПометитьСтрокиКВыставлению(Объект, СтруктураПоиска, ВыводОшибок=Истина, МассивСтрокСОшибками=Неопределено) Экспорт
//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, добавлен параметр ТекстОповещения
//Процедура ПроверитьПометитьСтрокиКВыставлению(Объект, СтруктураПоиска, ВыводОшибок=Истина, МассивСтрокСОшибками=Неопределено, ТекстОповещения = "") Экспорт
//Евросиб(ДИТ), Беляев СЮ, Ticket#0360214, 19-09-2024, добавлен парамтер ЭтоАвтоматическаяУстановка
Функция ПроверитьПометитьСтрокиКВыставлению(Объект, СтруктураПоиска, ВыводОшибок=Истина, МассивСтрокСОшибками=Неопределено, ТекстОповещения = "", ЭтоАвтоматическаяУстановка = Ложь ) Экспорт
	
//Процедура ПроверитьПометитьСтрокиКВыставлению(ИдентификаторыВыбраныхСтрок,СтруктураПоиска)
	//++ Зубов 39709 24.09.2021
	////СтрокиСОтбором = Объект.СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
	////СтрокиДляПроверки = Новый Массив;
	////
	////Для Каждого ИдентификаторСтроки Из ИдентификаторыВыбраныхСтрок Цикл
	////	Для каждого СтрокаОтбор из СтрокиСОтбором Цикл
	////		Если СтрокаОтбор.ГУИД = ИдентификаторСтроки Тогда
	////			ПарамОтбора = Новый Структура("ГУИД",ИдентификаторСтроки);
	////			НайденныеСтроки = Объект.СвязьУчетныхЕдиниц.НайтиСтроки(ПарамОтбора);
	////			Для каждого НайдСтрока из НайденныеСтроки Цикл
	////				СтрокиДляПроверки.Добавить(НайдСтрока);
	////			КонецЦикла;
	////		КонецЕсли;
	////	КонецЦикла;
	////КонецЦикла;
	
	//СтрокиДляПроверки = Объект.СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
	//-- Зубов 39709 24.09.2021
	Ошибки = Неопределено; //Евросиб, Трундуков СА, 118890, 17.09.2025
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
	ЗаполнитьДокументыФФДвСоставеПоезда(Объект, СтруктураПоиска);
	
	ТЗСвязьУчетныхЕдиниц = Объект.СвязьУчетныхЕдиниц.Выгрузить();
	Справочники.ФормированиеФинДокументов.ДобавитьПараметрыФормированияФинансовыхДокументовВТаблицу(ТЗСвязьУчетныхЕдиниц);
	СтрокиДляПроверки = ТЗСвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
	
	//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, начало
	ДанныеПроверкиКоносаментов = ПолучитьРезультатПроверкиКоносаментаКалькуляцииФрахта(ТЗСвязьУчетныхЕдиниц);
	//МассивГУИДсНекорректнойКалькуляцией = ДанныеПроверкиКоносаментов.МассивГУИДсНекорректнойКалькуляцией;
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
	ТаблицаДанныхСНекорректнойКалькуляцией = ДанныеПроверкиКоносаментов.ТаблицаДанныхСНекорректнойКалькуляцией;
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, конец
	//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, конец
	
	МассивСтрокСОшибками = Новый Массив;
	//проверка ЖДН
	//Евросиб Каблов 02.10.2020 ( Ticket#0208814 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Рейсы.Рейс КАК Рейс
	//|ПОМЕСТИТЬ ПереченьРейсов
	//|ИЗ
	//|	&Рейсы КАК Рейсы
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПереченьРейсов.Рейс КАК Рейс
	//|ИЗ
	//|	ПереченьРейсов КАК ПереченьРейсов
	//|ГДЕ
	//|	ПереченьРейсов.Рейс ССЫЛКА Справочник.РейсыЖД";
	//Запрос.УстановитьПараметр("Рейсы", Объект.Рейсы.Выгрузить());
	//ЕстьЖДРейсы = НЕ Запрос.Выполнить().Пустой();
	//Если ЕстьЖДРейсы Тогда
	//	Для каждого СтрокаДляПроверки Из СтрокиДляПроверки Цикл
	//		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.ЖДН) Тогда
	//			Сообщить(СтрШаблон("В строке %1 не заполнена ЖДН", СтрокаДляПроверки.НомерСтроки));
	//			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
	//		КонецЕсли; 
	//	КонецЦикла; 
	//КонецЕсли;
	СоответствиеСтатусПодписанияПСЦ = Новый Соответствие;
	Для каждого СтрокаДляПроверки Из СтрокиДляПроверки Цикл
		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.Заявка) Тогда
			//Сообщить(СтрШаблон("В строке %1 не заполнена заявка", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнена заявка", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Заявка"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Заявка") ,ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.Калькуляция) Тогда
			//Сообщить(СтрШаблон("В строке %1 не заполнена калькуляция", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнена калькуляция", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		КонецЕсли;
		//Евросиб Каблов 04.03.2021 ( Ticket#0225180
		//Если Не ЗначениеЗаполнено(СтрокаДляПроверки.РазмерКТК) Тогда
		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.РазмерКТК) И Не Объект.ПовагонныеОтправки Тогда		 
		//Евросиб Каблов 04.03.2021 )
			//Сообщить(СтрШаблон("В строке %1 не заполнен размер КТК", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнен размер КТК", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "РазмерКТК"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "РазмерКТК"), ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		КонецЕсли;
		//Евросиб - АСуслов 22.09.2022 16:10:28 #56288
		//(
		//Если ЗначениеЗаполнено(СтрокаДляПроверки.Коносамент) 
		//Евросиб - АСуслов 30.09.2022 10:18:00 #тэуфрахт
		//(
		Если (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море
			ИЛИ (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ПустаяСсылка()
				И ЗначениеЗаполнено(СтрокаДляПроверки.Коносамент)))
		//)
		//Евросиб - АСуслов 30.09.2022 10:18:03 #тэуфрахт
		//)
		//Евросиб - АСуслов 22.09.2022 16:10:34 #56288
			// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
			//ок(
			//И Не ЗначениеЗаполнено(СтрокаДляПроверки.СобственностьПеревозимогоКТК) Тогда
			////Сообщить(СтрШаблон("В строке %1 не заполнена собственность перевозимого КТК", СтрокаДляПроверки.НомерСтроки));
			//ТекстСообщения = СтрШаблон("В строке %1 не заполнена собственность перевозимого КТК", СтрокаДляПроверки.НомерСтроки);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "СобственностьПеревозимогоКТК"), "Объект");
			//ок)
			И Не ЗначениеЗаполнено(СтрокаДляПроверки.ПринадлежностьТЕ) Тогда
			//Сообщить(СтрШаблон("В строке %1 не заполнена собственность перевозимого КТК", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнена принадлежность", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "ПринадлежностьТЕ"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "ПринадлежностьТЕ"), ТекстСообщения);
			// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		КонецЕсли;
		//ПСЦПодписан = ПроверитьСтатусПодписанияПСЦ(СтрокаДляПроверки.Заявка, СтрокаДляПроверки.Контейнер, Объект.ПовагонныеОтправки);
		//Результат = ПроверитьСтатусПодписанияПСЦ(СтрокаДляПроверки.Заявка, СтрокаДляПроверки.Контейнер, Объект.ПовагонныеОтправки);
		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.Протокол) Тогда
			//Сообщить(СтрШаблон("В строке %1 не заполнен ПСЦ", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнен ПСЦ", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Протокол"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Протокол"), ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		Иначе          
			//Евросиб - АСуслов 07.01.2022 19:58:27 #
			//(
			//ускоряем
			Результат = СоответствиеСтатусПодписанияПСЦ.Получить(СтрокаДляПроверки.Протокол);
			Если Результат = Неопределено Тогда
				Результат = ПроверитьСтатусПодписанияПСЦ(СтрокаДляПроверки.Протокол);
				СоответствиеСтатусПодписанияПСЦ.Вставить(СтрокаДляПроверки.Протокол, Результат);
			КонецЕсли;
			//)
			//Евросиб - АСуслов 07.01.2022 19:58:30 #
			Если НЕ Результат.ПСЦПодписан Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 выбран неподписанный с двух сторон ПСЦ",СтрокаДляПроверки.НомерСтроки));
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(Результат.Ответ,СтрокаДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон(Результат.Ответ,СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Протокол"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Протокол"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли;
		КонецЕсли;
		//Евросиб - АСуслов 31.05.2021 12:48:05 #0233502
		//(
		Если Не ЗначениеЗаполнено(СтрокаДляПроверки.Договор) Тогда
			//Сообщить(СтрШаблон("В строке %1 не заполнен договор", СтрокаДляПроверки.НомерСтроки));
			ТекстСообщения = СтрШаблон("В строке %1 не заполнен договор", СтрокаДляПроверки.НомерСтроки);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		Иначе
			//Евросиб - АСуслов 24.06.2021 11:25:04 #0234523
			//(
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДляПроверки.Договор, "Подписан, СрокПредоставленияОригиналаДата, ПолученОригинал, Дата");
			//)
			//Евросиб - АСуслов 24.06.2021 11:25:11 #0234523
			Если РеквизитыДоговора.Подписан = Ложь Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 выбран неподписанный договор",СтрокаДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон("В строке %1 выбран неподписанный договор",СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли;
			Если РеквизитыДоговора.ПолученОригинал = Ложь 
				//Евросиб - АСуслов 24.06.2021 11:25:29 #0234523
				//(
				//И РеквизитыДоговора.Дата + 86400 * РеквизитыДоговора.СрокПредоставленияОригиналаДней < ТекущаяДата() Тогда
				И РеквизитыДоговора.СрокПредоставленияОригиналаДата < ТекущаяДата() Тогда
				//)
				//Евросиб - АСуслов 24.06.2021 11:25:35 #0234523
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 выбран договор, по которому вышел срок предоставления оригинала",СтрокаДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон("В строке %1 выбран договор, по которому вышел срок предоставления оригинала",СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Выбрано"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Выбрано"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли;
			//Евросиб - АСуслов 02.09.2021 16:57:49 #38070
			//(
			ДоговорВЗаявке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДляПроверки.Заявка, "Договор");
			Если НЕ СтрокаДляПроверки.Договор = ДоговорВЗаявке Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Договор в заявке по строке %1 не совпадает с договором в строке",СтрокаДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон("Договор в заявке по строке %1 не совпадает с договором в строке",СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Договор"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли; 
			//)
			//Евросиб - АСуслов 02.09.2021 16:57:51 #38070
			//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
			Если Не ЗначениеЗаполнено(СтрокаДляПроверки.ОтветственныйЗаУчет) Тогда
				ТекстСообщения = СтрШаблон("В строке %1 не заполнен Ответственный", СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "ОтветственныйЗаУчет"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "ОтветственныйЗаУчет"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
		КонецЕсли;
		//)
		//Евросиб - АСуслов 31.05.2021 12:48:18 #0233502
		//Евросиб - АСуслов 06.04.2021 11:55:07 #
		//(
		//проверим, что по выбранной строке в калькуляции для этого размера ктк указана ставка
		//условие проверки взяты из условия в запросе заполнения экономики доходов 
		РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДляПроверки.Калькуляция, "ТипКалькуляции, ММ_ИтогоСтавка20, ММ_ИтогоСтавка");
//Евросиб Гудкова( 12.05.2021 Ticket№ 0232076
		СуммаДопУслуг40 = ПолучитьСуммуДопУслугКалькуляции(СтрокаДляПроверки.Калькуляция, "40");	
		СуммаДопУслуг20 = ПолучитьСуммуДопУслугКалькуляции(СтрокаДляПроверки.Калькуляция, "20");
// Евросиб Гудкова) 
		Если НЕ Объект.ПовагонныеОтправки 
			И (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД
				ИЛИ СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ПустаяСсылка()) Тогда
			Если СтрокаДляПроверки.РазмерКТК = Справочники.РазмерыКТК.К40 
				ИЛИ РеквизитыКалькуляции.ТипКалькуляции = Перечисления.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого 
				ИЛИ РеквизитыКалькуляции.ТипКалькуляции = Перечисления.ТипыКалькуляций.ПредоставлениеПССТарифом Тогда
				Если Не ЗначениеЗаполнено(РеквизитыКалькуляции.ММ_ИтогоСтавка) 
//Евросиб Гудкова( 12.05.2021 Ticket№ 0232076
					И СуммаДопУслуг40 = 0	
// Евросиб Гудкова) 
					Тогда
					//Сообщить(СтрШаблон("По строке %1 в калькуляции не указана ставка по размеру КТК (%2)", СтрокаДляПроверки.НомерСтроки, СтрокаДляПроверки.РазмерКТК));
					ТекстСообщения = СтрШаблон("По строке %1 в калькуляции не указана ставка по размеру КТК (%2)", СтрокаДляПроверки.НомерСтроки, СтрокаДляПроверки.РазмерКТК);
					//Евросиб, Трундуков СА, 118890, 17.09.2025
					//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), "Объект");
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), ТекстСообщения);
					МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
				КонецЕсли; 
			ИначеЕсли СтрокаДляПроверки.РазмерКТК = Справочники.РазмерыКТК.К20 Тогда
				Если Не ЗначениеЗаполнено(РеквизитыКалькуляции.ММ_ИтогоСтавка20) 
//Евросиб Гудкова( 12.05.2021 Ticket№ 0232076
					И СуммаДопУслуг20 = 0	
// Евросиб Гудкова) 
					Тогда
					//Сообщить(СтрШаблон("По строке %1 в калькуляции не указана ставка по размеру КТК (%2)", СтрокаДляПроверки.НомерСтроки, СтрокаДляПроверки.РазмерКТК));
					ТекстСообщения = СтрШаблон("По строке %1 в калькуляции не указана ставка по размеру КТК (%2)", СтрокаДляПроверки.НомерСтроки, СтрокаДляПроверки.РазмерКТК);
					//Евросиб, Трундуков СА, 118890, 17.09.2025
					//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), "Объект");
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), ТекстСообщения);
					МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		//)
		//Евросиб - АСуслов 06.04.2021 11:55:09 #
		
		//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, начало
		//Если МассивГУИДсНекорректнойКалькуляцией.Найти(СтрокаДляПроверки.ГУИД) <> Неопределено Тогда
		//	ТекстСообщения = СтрШаблон("По строке %1 калькуляция на ФРАХТ не соответствует всем параметрам: размер КТК, вид собственности КТК, порт отправления, порт назначения", СтрокаДляПроверки.НомерСтроки);
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), "Объект");
		//	МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		//КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, конец
		
		//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
		СтрокаТаблицыДанныхСНекорректнойКалькуляцией = ТаблицаДанныхСНекорректнойКалькуляцией.Найти(СтрокаДляПроверки.ГУИД,"ГУИД");
		Если СтрокаТаблицыДанныхСНекорректнойКалькуляцией <> Неопределено Тогда
			ТекстСообщения = СтрШаблон("В строке %1 расхождения по параметрам: %2", СтрокаДляПроверки.НомерСтроки, СтрокаТаблицыДанныхСНекорректнойКалькуляцией.СтрокаИнформирования);
			//Евросиб, Трундуков СА, 118890, 17.09.2025
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), "Объект");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Калькуляция"), ТекстСообщения);
			МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, конец
		
	КонецЦикла;
	
	ЕстьРейсЖД = Ложь;
	ЕстьРейсМоре = Ложь;
	Для Каждого СтрокаТЧРейсы Из Объект.Рейсы Цикл
		Если ТипЗнч(СтрокаТЧРейсы.Рейс) = Тип("СправочникСсылка.РейсыЖД")
			И Не СтрокаТЧРейсы.Рейс = Справочники.РейсыЖД.БезРейса Тогда
			ЕстьРейсЖД = Истина;
		ИначеЕсли ТипЗнч(СтрокаТЧРейсы.Рейс) = Тип("СправочникСсылка.РейсыМоре") Тогда
			ЕстьРейсМоре = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРейсЖД И Не Объект.ПодсылПорожних Тогда
		
		// Евросиб Фролов (15.12.2021 Ticket№ 44663: добавил в структуру "ГУИДСтрокиЗаявки"
		//ТаблицаСвязьУчетныхЕдиниц = Объект.СвязьУчетныхЕдиниц.Выгрузить(СтрокиДляПроверки, "НомерСтроки, ЖДН, ГруженаяЖДННеНайдена, Договор, Контейнер, Заявка, ГУИДСтрокиЗаявки,ВидТранспортногоСообщения");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки,
		|	ТЗСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
		|	ВЫРАЗИТЬ(ТЗСвязьУчетныхЕдиниц.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
		|	ТЗСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	ТЗСвязьУчетныхЕдиниц.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
		|	ВЫРАЗИТЬ(ТЗСвязьУчетныхЕдиниц.Заявка КАК Документ.Заявка) КАК Заявка, 
		// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Начало: 12.12.2024
		|	ТЗСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТС,
		// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Конец: 12.12.2024
		// Евросиб Фролов (15.12.2021 Ticket№ 44663
		|	ТЗСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
		// Евросиб Фролов)
		|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
		|ИЗ
		|	&ТаблицаСвязьУчетныхЕдиниц КАК ТЗСвязьУчетныхЕдиниц 
		//Евросиб - АСуслов 22.09.2022 16:17:28 #56288
		//(
		|ГДЕ НЕ ТЗСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.Море)
		//)
		//Евросиб - АСуслов 22.09.2022 16:17:30 #56288
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки,
		|	ВТСвязьУчетныхЕдиниц.Договор.ПравилоФормированияДатыУслуги КАК ПравилоФормированияДатыУслуги,
		//|	ТранспортныйДокумент.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза КАК ДатаРаскредитации, 
		// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Начало: 12.12.2024
		|	ВТСвязьУчетныхЕдиниц.ВидТС КАК ВидТС,  
		// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Конец: 12.12.2024
		|	ТранспортныйДокумент.ДатаРаскредитации КАК ДатаРаскредитации,
		|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК ДатаВыдачиАвто,
		|	ТранспортныйДокумент.ДатаПрибытия КАК ДатаПрибытия,
		|	ВЫБОР
		|		КОГДА НЕ ВТСвязьУчетныхЕдиниц.ГруженаяЖДННеНайдена
		|				И э_НакладнаяГрузы.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаполненаГруженаяЖДН
		//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, начало
		|	,ТранспортныйДокумент.ДатаОтправления КАК ДатаОтправления
		//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, конец
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузы
		|			ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_НакладнаяГрузы.Ссылка
		//ДИТ, Беляев СЮ, BUG 53514, 25-10-2022, начало (закомментировал)
		//|				И (НЕ э_НакладнаяГрузы.КодЕТСНГ В (&КодыПорожних))
		//ДИТ, Беляев СЮ, BUG 53514, 25-10-2022, конец
		|		ПО ВТСвязьУчетныхЕдиниц.ЖДН = ТранспортныйДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТСвязьУчетныхЕдиниц.Заявка = ЗаявкаСоставУслуги.Ссылка
		// Евросиб Фролов (26.12.2021 TASK №44663
		//|			И ВТСвязьУчетныхЕдиниц.Контейнер = ЗаявкаСоставУслуги.НомерКТК";
		|			И ВТСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки";
		// Евросиб Фролов)
		//Запрос.УстановитьПараметр("ТаблицаСвязьУчетныхЕдиниц", ТаблицаСвязьУчетныхЕдиниц);
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
		Запрос.УстановитьПараметр("ТаблицаСвязьУчетныхЕдиниц", ТЗСвязьУчетныхЕдиниц.Скопировать(СтрокиДляПроверки));
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
		Запрос.УстановитьПараметр("КодыПорожних", э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК());		
		//ТаблицаСтрокСОшибками = Запрос.Выполнить().Выгрузить();
		ВыборкаСтрокДляПроверки = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаСтрокДляПроверки.Следующий() Цикл
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0360214, 19-09-2024, начало
			Если ЭтоАвтоматическаяУстановка И НЕ ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаРаскредитации) Тогда
				МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0360214, 19-09-2024, конец
			Если НЕ ВыборкаСтрокДляПроверки.ЗаполненаГруженаяЖДН
				//Евросиб Каблов 09.03.2021 ( Ticket#0225180 Не нужно проверять служебные сделки. Как их отличить, неизвестно. Поэтому проверку для повагонки отключил.
				И Не Объект.ПовагонныеОтправки Тогда
				//Евросиб Каблов 09.03.2021 )
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не заполнена груженая ЖДН", ВыборкаСтрокДляПроверки.НомерСтроки));			
				ТекстСообщения = СтрШаблон("В строке %1 не заполнена груженая ЖДН", ВыборкаСтрокДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), ТекстСообщения);
				//МассивСтрокСОшибками.Добавить(Объект.СвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
				МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
				Продолжить;  
			// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Начало: 12.12.2024
			ИначеЕсли ВыборкаСтрокДляПроверки.ЗаполненаГруженаяЖДН И Не Объект.ПовагонныеОтправки 
				и ВыборкаСтрокДляПроверки.ВидТС = Перечисления.ВидыТранспортныхСообщений.ЖД 
				и ВыборкаСтрокДляПроверки.ДатаОтправления > ТекущаяДата() Тогда
				ТекстСообщения = СтрШаблон("В строке %1 Дата отправления в ЖДН больше текущей даты", ВыборкаСтрокДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);	  
				Продолжить;
			// Евросиб(ДИТ) US 90400 ТА 90401 Сержантова А.С. Конец: 12.12.2024
			КонецЕсли;			
			Если ВыборкаСтрокДляПроверки.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации 
				И НЕ ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаРаскредитации) Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не заполнена дата раскредитации в ЖДН", ВыборкаСтрокДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон("В строке %1 не заполнена дата раскредитации в ЖДН", ВыборкаСтрокДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), ТекстСообщения);
				//МассивСтрокСОшибками.Добавить(Объект.СвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
				МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
				Продолжить;
			ИначеЕсли ВыборкаСтрокДляПроверки.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия
				//либо авто, либо дата раскредитации
				И Не ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаРаскредитации)
				И Не ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаВыдачиАвто) Тогда
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не заполнена дата раскредитации в ЖДН и/или дата выдачи груза (авто/инЖД)", ВыборкаСтрокДляПроверки.НомерСтроки),,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ВыборкаСтрокДляПроверки.НомерСтроки, "ЖДН"), СтрШаблон("В строке %1 не заполнена дата раскредитации в ЖДН и/или дата выдачи груза (авто/инЖД)", ВыборкаСтрокДляПроверки.НомерСтроки));
				//МассивСтрокСОшибками.Добавить(Объект.СвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
				МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[ВыборкаСтрокДляПроверки.НомерСтроки-1]);
				//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
				Продолжить;
			КонецЕсли; 
			//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, начало
			//В ЭТУ ПРОВЕРКУ ПОПАДАЮТ ВСЕ РЕКВИЗИТЫ ЖДН НЕЗАВИСИМО ОТ ПРАВИЛ, ИСКЛЮЧАЮТСЯ ТОЛЬКО БЛОКИРУЮЩИЕ УСТАНОВКУ ГАЛОК
			//ДОПОЛНИТЕЛЬНОЕ ОПОВЕЩЕНИЕ ДЛЯ МЕНЕДЖЕРОВ ОРК
			ЗаполнитьТекстОповещенияПриПометкеСтрок(ВыборкаСтрокДляПроверки, ТекстОповещения);
			//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, конец
		КонецЦикла;
	КонецЕсли;
	//Евросиб Каблов 02.10.2020 )
	
	//проверка коносамент
	//Евросиб - АСуслов 29.08.2023 15:50:00 #73836
	//(
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ФормированиеФинДокументов.Коносамент КАК Коносамент,
	//|	ФормированиеФинДокументов.ОдинКоносаментОдинДокумент КАК ОдинКоносаментОдинДокумент,
	//|	1 КАК Приоритет,
	//|	ФормированиеФинДокументов.ДатаРеализации КАК ДатаРеализации
	//|ИЗ
	//|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	//|ГДЕ
	//|	ФормированиеФинДокументов.Контрагент = &Контрагент
	//|	И ФормированиеФинДокументов.ВидПеревозки = &ВидПеревозки
	//|   И НЕ ФормированиеФинДокументов.ПометкаУдаления 
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ФормированиеФинДокументов.Коносамент,
	//|	ФормированиеФинДокументов.ОдинКоносаментОдинДокумент,
	//|	2,
	//|	ФормированиеФинДокументов.ДатаРеализации
	//|ИЗ
	//|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	//|ГДЕ
	//|	ФормированиеФинДокументов.Контрагент = &Контрагент
	//|	И ФормированиеФинДокументов.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
	//|   И НЕ ФормированиеФинДокументов.ПометкаУдаления 
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Приоритет";
	//Запрос.УстановитьПараметр("Контрагент", ?(СтрокиДляПроверки.Количество()>0,СтрокиДляПроверки[0].Клиент,Справочники.Контрагенты.ПустаяСсылка()));
	//Запрос.УстановитьПараметр("ВидПеревозки", ?(СтрокиДляПроверки.Количество()>0,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокиДляПроверки[0].Калькуляция, "ПС_ВидПеревозки"),Справочники.ВидыПеревозок.ПустаяСсылка()) );
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//ПроверятьКоносамент = Ложь;
	//ПравилоДатыРеализации = Неопределено;
	//Если Выборка.Следующий() Тогда
	//	ПравилоДатыРеализации = Выборка.ДатаРеализации;
	//	Если Выборка.Коносамент ИЛИ Выборка.ОдинКоносаментОдинДокумент Тогда
	//		ПроверятьКоносамент = Истина;
	//	КонецЕсли; 
	//КонецЕсли;                                            
	ПроверятьКоносамент = Истина;
	//)
	//Евросиб - АСуслов 29.08.2023 15:50:02 #73836
	//Евросиб - АСуслов 30.09.2022 10:14:04 #тэуфрахт
	//(
	//ПроверятьКоносамент = ПроверятьКоносамент И ЕстьРейсМоре;
	Если ПроверятьКоносамент И НЕ Объект.ПодсылПорожних Тогда // SIV 20-09-24 для подсыла коносаменты не нужны!!
		Для каждого СтрокаДляПроверки Из СтрокиДляПроверки Цикл
			//проверяем для втс = море или для старых сделок с пустым втс и рейсом море
			Если (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море 
				ИЛИ (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ПустаяСсылка() И ЕстьРейсМоре)
				ИЛИ (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД
					И ДанныеПроверкиКоносаментов.МассивКалькуляцийПсевдофрахта.Найти(СтрокаДляПроверки.Калькуляция) <> Неопределено))
				И Не ЗначениеЗаполнено(СтрокаДляПроверки.Коносамент) Тогда
				//Сообщить(СтрШаблон("В строке %1 не заполнен коносамент", СтрокаДляПроверки.НомерСтроки));
				ТекстСообщения = СтрШаблон("В строке %1 не заполнен коносамент", СтрокаДляПроверки.НомерСтроки);
				//Евросиб, Трундуков СА, 118890, 17.09.2025
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Коносамент"), "Объект");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Коносамент"), ТекстСообщения);
				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	//Евросиб - АСуслов 29.08.2023 16:07:49 #73836
	//(
	//Для каждого СтрокаДляПроверки Из СтрокиДляПроверки Цикл
	//	Если ЗначениеЗаполнено(СтрокаДляПроверки.Коносамент) И ЗначениеЗаполнено(ПравилоДатыРеализации) 
	//		//Евросиб - АСуслов 22.09.2022 16:21:51 #56288
	//		//(
	//		И (СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море ИЛИ СтрокаДляПроверки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море)
	//		//)
	//		//Евросиб - АСуслов 22.09.2022 16:21:53 #56288
	////)
	////Евросиб - АСуслов 30.09.2022 10:14:09 #тэуфрахт
	//		Тогда
	//		Если ПравилоДатыРеализации = Перечисления.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС
	//			И Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДляПроверки.Коносамент, "ДатаПрибытия")) Тогда
	//				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в коносаменте не заполнена дата прибытия судна", СтрокаДляПроверки.НомерСтроки));
	//				ТекстСообщения = СтрШаблон("В строке %1 в коносаменте не заполнена дата прибытия судна", СтрокаДляПроверки.НомерСтроки);
	//				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Коносамент"), "Объект");
	//				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
	//		КонецЕсли;
	//		Если ПравилоДатыРеализации = Перечисления.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС
	//			И Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДляПроверки.Коносамент, "ДатаОтправления")) Тогда
	//				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в коносаменте не заполнена дата отправления судна", СтрокаДляПроверки.НомерСтроки));
	//				ТекстСообщения = СтрШаблон("В строке %1 в коносаменте не заполнена дата отправления судна", СтрокаДляПроверки.НомерСтроки);
	//				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", СтрокаДляПроверки.НомерСтроки, "Коносамент"), "Объект");
	//				МассивСтрокСОшибками.Добавить(СтрокаДляПроверки);
	//		КонецЕсли;
	//	КонецЕсли; 
	//КонецЦикла; 
	//)
	//Евросиб - АСуслов 29.08.2023 16:07:52 #73836
	//проверка даты прибытия авто/жд
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	ВТ.Заявка КАК Заявка,
	|	ВТ.Контейнер КАК Контейнер,
	//|	ВТ.ДатаВыдачиГрузаКлиенту КАК ДатаВыдачиГрузаКлиенту,
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
	|	ВТ.ГУИД КАК ГУИД,
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
	// Евросиб Фролов (26.12.2021 TASK №44663
	|	ВТ.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	// Евросиб Фролов)	
	|ПОМЕСТИТЬ Врем_Таб
	|ИЗ
	|	&ВТ КАК ВТ
	//Евросиб - АСуслов 22.09.2022 16:24:33 #56288
	//(
	|ГДЕ ВТ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|   ИЛИ ВТ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	//)
	//Евросиб - АСуслов 22.09.2022 16:24:36 #56288
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
	|	Врем_Таб.НомерСтроки КАК НомерСтроки,
	|	Врем_Таб.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	//|	Врем_Таб.ДатаВыдачиГрузаКлиенту КАК ДатаВыдачиГрузаКлиенту,
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
	|	ЕстьNULL(ДатыПодачАвтоПодВыгрузку.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВыдачиГрузаКлиенту,
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
	|	Врем_Таб.Контейнер КАК Контейнер
	|ИЗ
	|	Врем_Таб КАК Врем_Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО Врем_Таб.Заявка = ЗаявкаСоставУслуги.Ссылка
	// Евросиб Фролов (26.12.2021 TASK №44663
	//|			И Врем_Таб.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|			И Врем_Таб.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	// Евросиб Фролов)
	|			И (ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку = ДАТАВРЕМЯ(1, 1, 1))
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПодачАвтоПодВыгрузку КАК ДатыПодачАвтоПодВыгрузку
	|			ПО Врем_Таб.ГУИД = ДатыПодачАвтоПодВыгрузку.ИдентификаторСвязьУчетныхЕдиниц
	//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
	|ГДЕ
	|	Врем_Таб.УсловияПеревозкиНазначение = ЗНАЧЕНИЕ(Перечисление.УсловияПеревозкиКТК.DOOR)";
	//Запрос.УстановитьПараметр("ВТ", Объект.СвязьУчетныхЕдиниц.Выгрузить(СтрокиДляПроверки));
	//ДИТ, Беляев СЮ, Ticket#0288328, 07-10-2022, начало (процедура также вызывается из Реестра, реквизитов формы (ДатаВыдачиГрузаКлиенту, ВидСтавки) в этом случае нет в СвязьУчетныхЕдиниц)
	//ТЗСвязьУчетныхЕдиниц = Объект.СвязьУчетныхЕдиниц.Выгрузить();
	//Если ТЗСвязьУчетныхЕдиниц.Колонки.Найти("ДатаВыдачиГрузаКлиенту") = Неопределено Тогда
	//	ТЗСвязьУчетныхЕдиниц.Колонки.Добавить("ДатаВыдачиГрузаКлиенту", Новый ОписаниеТипов("Дата"));	
	//КонецЕсли;
	//Если ТЗСвязьУчетныхЕдиниц.Колонки.Найти("ВидСтавки") = Неопределено Тогда
	//	ТЗСвязьУчетныхЕдиниц.Колонки.Добавить("ВидСтавки", Новый ОписаниеТипов("ПеречислениеСсылка.ФрахтФинДокументы_ВидСтавки"));	
	//КонецЕсли;
	Запрос.УстановитьПараметр("ВТ", ТЗСвязьУчетныхЕдиниц.Скопировать(СтруктураПоиска));
	//ДИТ, Беляев СЮ, Ticket#0288328, 07-10-2022, конец
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//Сообщить(СтрШаблон("По строке %1 в заявке не заполнена дата прибытия авто", Выборка.НомерСтроки));
		//ТекстСообщения = СтрШаблон("По строке %1 в заявке не заполнена дата прибытия авто %2", Выборка.НомерСтроки,?(ЗначениеЗаполнено(Выборка.ДатаВыдачиГрузаКлиенту), "(Необходимо записать сделку)",""));
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
		ТекстСообщения = СтрШаблон("По строке %1 в заявке не заполнена дата прибытия авто (Необходимо заполнить и записать сделку)", Выборка.НомерСтроки);
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
		//Евросиб, Трундуков СА, 118890, 17.09.2025
		//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", Выборка.НомерСтроки, "ДатаВыдачиГрузаКлиенту"), "Объект");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект."+ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", Выборка.НомерСтроки, "ДатаВыдачиГрузаКлиенту"), ТекстСообщения);
		//МассивСтрокСОшибками.Добавить(Объект.СвязьУчетныхЕдиниц[Выборка.НомерСтроки-1]);
		//ДИТ, Беляев СЮ, Ticket#0288328, 07-10-2022, начало
		МассивСтрокСОшибками.Добавить(ТЗСвязьУчетныхЕдиниц[Выборка.НомерСтроки-1]);
		//ДИТ, Беляев СЮ, Ticket#0288328, 07-10-2022, конец
	КонецЦикла;
	//Евросиб - АСуслов 05.10.2022 15:02:29 #тэуфрахт
	//(         
	МассивСтрокДляДобавленияСтрокСОшибками = Новый Массив;
	Для каждого СтрокаСОшибками Из МассивСтрокСОшибками Цикл
			
		//Если НЕ СтрокаСОшибками.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки Тогда
			//Для каждого СтрокаПоСтрокеЗаявки Из Объект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки", СтрокаСОшибками.ГУИДСтрокиЗаявки)) Цикл
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало	
		Если НЕ СтрокаСОшибками.ДокументФФД_ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки Тогда
			Для каждого СтрокаПоСтрокеЗаявки Из ТЗСвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИДСтрокиЗаявки", СтрокаСОшибками.ГУИДСтрокиЗаявки)) Цикл
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
				МассивСтрокДляДобавленияСтрокСОшибками.Добавить(СтрокаПоСтрокеЗаявки);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрокСОшибками, МассивСтрокДляДобавленияСтрокСОшибками);
	//)
	//Евросиб - АСуслов 05.10.2022 15:02:32 #тэуфрахт	
	
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивСтрокСОшибками);
	Для каждого СтрокаДляПроверки Из СтрокиДляПроверки Цикл
		//СтрокаДляПроверки.ГотовоКВыставлению = МассивСтрокСОшибками.Найти(СтрокаДляПроверки) = Неопределено;
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
		СтрокаТЧСвязьУчетныхЕдиниц = Объект.СвязьУчетныхЕдиниц[СтрокаДляПроверки.НомерСтроки-1];
		СтрокаТЧСвязьУчетныхЕдиниц.ГотовоКВыставлению = МассивСтрокСОшибками.Найти(СтрокаДляПроверки) = Неопределено;
		//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец
	КонецЦикла;
	
	Возврат Ошибки
КонецФункции

//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, начало
Процедура ЗаполнитьТекстОповещенияПриПометкеСтрок(Знач ВыборкаСтрокДляПроверки, ТекстОповещения)
	
	СписокПроверяемыхРеквизитов = Новый Соответствие;
	СписокПроверяемыхРеквизитов.Вставить("Дата выдачи груза", ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаВыдачиАвто));
	СписокПроверяемыхРеквизитов.Вставить("Дата раскредитации", ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаРаскредитации));
	СписокПроверяемыхРеквизитов.Вставить("Дата прибытия", ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаПрибытия));
	СписокПроверяемыхРеквизитов.Вставить("Дата отправления", ЗначениеЗаполнено(ВыборкаСтрокДляПроверки.ДатаОтправления));
	СписокПроверяемыхРеквизитов.Вставить("ЖДН", ВыборкаСтрокДляПроверки.ЗаполненаГруженаяЖДН);
	СтрокаТекстаОповещения = "";
	Для Каждого ЗначениеПроверки Из СписокПроверяемыхРеквизитов Цикл
		Если НЕ ЗначениеПроверки.Значение Тогда
			СтрокаТекстаОповещения = СтрокаТекстаОповещения + ЗначениеПроверки.Ключ + ", ";
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаТекстаОповещения) Тогда
		ТекстОповещения = ТекстОповещения 
		+ СтрШаблон("строка %1: %2", ВыборкаСтрокДляПроверки.НомерСтроки, СтрокаТекстаОповещения)
		+ Символы.ПС;
	КонецЕсли;

КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0318556, 04-08-2023, конец

Функция ПроверитьСтатусПодписанияПСЦ(Протокол)
	
	Результат = Новый Структура("ПСЦПодписан, Ответ", Ложь, "В строке %1 выбран неподписанный с двух сторон ПСЦ");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ЗаявкаСоставУслуги.ПСЦ <> ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
	//|			ТОГДА ЗаявкаСоставУслуги.ПСЦ
	//|		ИНАЧЕ ЗаявкаСоставУслуги.Ссылка.ПСЦ
	//|	КОНЕЦ КАК ПСЦ
	|ВЫРАЗИТЬ(&Протокол КАК Документ.ПСЦ) КАК ПСЦ 
	|ПОМЕСТИТЬ НайдПСЦ
	// Суслов 1.02.2022 (
	//|ИЗ
	//|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	// Суслов 1.02.2022 )
	//|ГДЕ
	//|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	//|	И ВЫБОР КОГДА &Повагонка ТОГДА Истина ИНАЧЕ ЗаявкаСоставУслуги.НомерКТК = &НомерКТК КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайдПСЦ.ПСЦ.СтатусДокумента = Значение(Перечисление.СтатусыСогласования.Подписано)
	|   ИЛИ (НайдПСЦ.ПСЦ.СтатусДокумента В (&РазрСтатусы)
//Евросиб Коханенко Н.А. 15.12.2023 (( #78860 
	//|		И НайдПСЦ.ПСЦ.МаксимальнаяДатаПодписанияСДвухСторон > &ТекДата) КАК УсловиеЪ,
	|		И НайдПСЦ.ПСЦ.МаксимальнаяДатаПодписанияСДвухСторон >= &ТекДата) КАК УсловиеЪ,
//Евросиб Коханенко Н.А. 15.12.2023 )) #78860 
	|   НайдПСЦ.ПСЦ.СтатусДокумента = &СтатусСогласованоСЗамечаниями КАК СогласованоСЗамечаниями
	|ИЗ
	|	НайдПСЦ КАК НайдПСЦ";
	
	//Запрос.УстановитьПараметр("Ссылка", Заявка);
	//Запрос.УстановитьПараметр("НомерКТК", Контейнер);
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Протокол", Протокол);
	//Евросиб - АСуслов 09.11.2020 18:33:34 #
	//(
	//Запрос.УстановитьПараметр("Повагонка", ПовагонныеОтправки);
	//)
	//Евросиб - АСуслов 09.11.2020 18:33:34 #
	РазрСтатусы = Новый Массив;
	//РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.Подписано);
	РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
	РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	//Субботин 71862 26.06.2023 Начало
	 РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно);
	//Субботин 71862 26.06.2023 Конец
	Запрос.УстановитьПараметр("РазрСтатусы", РазрСтатусы);
	Запрос.УстановитьПараметр("СтатусСогласованоСЗамечаниями", Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Если Ответ.СогласованоСЗамечаниями Тогда 
			Результат.ПСЦПодписан = Ложь;
			Результат.Ответ = "В строке %1 выбран согласованный с замечаниями ПСЦ, необходимо согласование ПСЦ без замечаний или с комментариями";
		ИначеЕсли Ответ.УсловиеЪ = Истина Тогда 
			Результат.ПСЦПодписан = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
	//"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА Заявка.ПСЦ.ПодписанСДвухСторон
	//|			ТОГДА ИСТИНА
	//|		КОГДА Заявка.ПСЦ.МаксимальнаяДатаПодписанияСДвухСторон >= &ТекДата
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ПСЦПодписан
	//|ИЗ
	//|	Документ.Заявка КАК Заявка
	//|ГДЕ
	//|	Заявка.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Заявка);
	//Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат РезультатЗапроса.Выгрузить()[0].ПСЦПодписан;
	
КонецФункции

Функция ПСЦУспешноСогласован(Заявка)
	
	МассивЗавершенныхСтатусовПСЦ = Новый Массив;
	МассивЗавершенныхСтатусовПСЦ.Добавить(Перечисления.СтатусыСогласования.Подписано);
	МассивЗавершенныхСтатусовПСЦ.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
	МассивЗавершенныхСтатусовПСЦ.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	
	Возврат МассивЗавершенныхСтатусовПСЦ.Найти(Заявка.ПСЦ.СтатусДокумента) <> неопределено; 
	
КонецФункции

Функция ПолучитьСуммуДопУслугКалькуляции(Калькуляция, ТипКТК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               //|	СУММА(КалькуляцияЖД_УслугиВнеСтавки.Ставка" + ТипКТК + ") КАК Ставка
				   //ДИТ, Беляев СЮ, Ticket#0291266, 10-11-2022, начало
				   |ЕстьNULL(СУММА(КалькуляцияЖД_УслугиВнеСтавки.Ставка" + ТипКТК + "),0) КАК Ставка
				   //ДИТ, Беляев СЮ, Ticket#0291266, 10-11-2022, конец
	               |ИЗ
	               |	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	               |ГДЕ
	               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Калькуляция);
	
	Возврат Запрос.Выполнить().Выгрузить()[0].Ставка;

КонецФункции

// ДИТ Поморцева Т.П. Задача 248427 29.10.21. начало
//Процедура ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, ЭтоВагоны = Ложь, КоличествоДляСуммы) Экспорт
//Евросиб Каблов 31.05.2022 ( Task 45436
//Процедура ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, ЭтоВагоны = Ложь) Экспорт
//Процедура ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, ЭтоВагоны = Ложь, ПараметрыФФД = Неопределено) Экспорт
//55029 целиком
//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментирован, используется теперь ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию()
//Процедура ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, Выборка, НСтр, Сделка, ЭтоВагоны = Ложь, ПараметрыФФД = Неопределено, КоличествоДляСуммы) Экспорт
////Евросиб Каблов 31.05.2022 )
//// ДИТ Поморцева Т.П. Задача 248427 29.10.21. конец	

//	НеЗаполняемыеПоля = "ДатаОтправки";
//	Если ЭтоВагоны Тогда
//		НеЗаполняемыеПоля = НеЗаполняемыеПоля + ", Контейнер";
//	КонецЕсли; 
//	ЗаполнитьЗначенияСвойств(НовСтрокаРасш, СтрПоезда,,НеЗаполняемыеПоля);
//	
//	ВесГр = 0;

//	Если ЗначениеЗаполнено(СтрПоезда.ДатаНачалаПериодаПовагонки) Тогда
//		НовСтрокаРасш.ДатаОтправкиПовагонки = СтрПоезда.ДатаОтправки;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(СтрПоезда.ЖДН) ТОгда
//		Накладная = СтрПоезда.ЖДН.НакладнаяЭТРАН;
//		Если ЗначениеЗаполнено(Накладная) Тогда
//			НовСтрокаРасш.ДатаОтправки = Накладная.ДатаИВремяОтправленияГруза;
//		Иначе
//			НовСтрокаРасш.ДатаОтправки = СтрПоезда.ЖДН.ДатаОтправления;	
//		КонецЕсли; 
//		Если ЗначениеЗаполнено(НовСтрокаРасш.Контейнер) 
//			И НЕ ЭтоВагоны Тогда
//			ПараметрыОтбора = Новый Структура;
//			Параметрыотбора.Вставить("НомерКонтейнера",НовСтрокаРасш.Контейнер.Наименование);
//			НайденныйКТК = Накладная.Контейнеры.НайтиСтроки(ПараметрыОтбора);
//			// сделаем цикл по таблице на случай сборных грузов в КТК
//			Для Каждого Стр Из НайденныйКТК Цикл
//				ВесГр = ВесГр + Стр.МассыВКгНетто;
//				ГРП = Стр.ГрузоподКонтТн;
//			КонецЦикла;
//			НовСтрокаРасш.ФактическийВес = ВесГр;
//			НовСтрокаРасш.РасчетныйВес = ВесГр;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(НовСтрокаРасш.Вагон) И ВесГР = 0
//			И ЭтоВагоны Тогда
//			ПараметрыОтбора = Новый Структура;
//			Параметрыотбора.Вставить("НомерВагона",НовСтрокаРасш.Вагон.Наименование);
//			НайденныйВаг = Накладная.Вагоны.НайтиСтроки(ПараметрыОтбора);
//			// сделаем цикл по таблице на случай сборных грузов в вагоне
//			Для Каждого Стр Из НайденныйВаг Цикл
//				ВесГр = ВесГр + Стр.МассыВКгНетто;
//				ГРП = Стр.ГрузоподъемностьВТн;
//			КонецЦикла;
//			НовСтрокаРасш.ФактическийВес = ВесГр;
//			НовСтрокаРасш.РасчетныйВес = ВесГр;
//		КонецЕсли;
//	//Евросиб - АСуслов 08.06.2021 9:44:46 #0234389
//	//(
//	ИначеЕсли ЗначениеЗаполнено(СтрПоезда.Коносамент) Тогда
//		НовСтрокаРасш.ДатаОтправки = СтрПоезда.Коносамент.ДатаОтправления;	
//	//)
//	//Евросиб - АСуслов 08.06.2021 9:44:48 #0234389	
//	КонецЕсли;
//		
//		
//	НовСтрокаРасш.ВидПеревозки = СтрПоезда.Калькуляция.ПС_ВидПеревозки;
//	
//	ЗаполнитьЗначенияСвойств(НовСтрокаРасш, Нстр);
//	//Евросиб - АСуслов 25.07.2022 11:19:23 #
//	//(
//	//НовСтрокаРасш.СуммаНДС = Нстр.СуммаНДС / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	//НовСтрокаРасш.Сумма = Нстр.Сумма / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	НовСтрокаРасш.СуммаНДС = Нстр.СуммаНДС / ?(КоличествоДляСуммы = 0, 1, КоличествоДляСуммы);
//	НовСтрокаРасш.Сумма = Нстр.Сумма / ?(КоличествоДляСуммы = 0, 1, КоличествоДляСуммы);
//	//)
//	//Евросиб - АСуслов 25.07.2022 11:19:24 #
//	
//	НовСтрокаРасш.Услуга = Выборка.Услуга;
//	НовСтрокаРасш.СтрокаДоходовСделки = Выборка.ГУИД;
//	
//	//Евросиб Каблов 19.05.2022 ( Task 45436
//	Если ПараметрыФФД <> Неопределено И ПараметрыФФД.ЗаменятьСтанциюНаОсновную Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ТранспортныйДокумент.Ссылка КАК Накладная,
//		|	ВЫБОР
//		|		КОГДА ТранспортныйДокумент.СтанцияОтправления.ОсновнаяЛокация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//		|			ТОГДА ТранспортныйДокумент.СтанцияОтправления.ОсновнаяЛокация
//		|		ИНАЧЕ ТранспортныйДокумент.СтанцияОтправления
//		|	КОНЕЦ КАК НакладнаяСтанцияОтправления,
//		|	ВЫБОР
//		|		КОГДА ТранспортныйДокумент.СтанцияНазначения.ОсновнаяЛокация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//		|			ТОГДА ТранспортныйДокумент.СтанцияНазначения.ОсновнаяЛокация
//		|		ИНАЧЕ ТранспортныйДокумент.СтанцияНазначения
//		|	КОНЕЦ КАК НакладнаяСтанцияНазначения,
//		|	ВЫБОР
//		|		КОГДА Сделка.СтанцияОтправления.ОсновнаяЛокация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//		|			ТОГДА Сделка.СтанцияОтправления.ОсновнаяЛокация
//		|		ИНАЧЕ Сделка.СтанцияОтправления
//		|	КОНЕЦ КАК СделкаСтанцияОтправления,
//		|	ВЫБОР
//		|		КОГДА Сделка.СтанцияНазначения.ОсновнаяЛокация <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
//		|			ТОГДА Сделка.СтанцияНазначения.ОсновнаяЛокация
//		|		ИНАЧЕ Сделка.СтанцияНазначения
//		|	КОНЕЦ КАК СделкаСтанцияНазначения
//		|ИЗ
//		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент,
//		|	Документ.Сделка КАК Сделка
//		|ГДЕ
//		|	ТранспортныйДокумент.Ссылка = &Накладная
//		|	И Сделка.Ссылка = &Сделка";
//		Запрос.УстановитьПараметр("Накладная", СтрПоезда.ЖДН);
//		Запрос.УстановитьПараметр("Сделка", Сделка);
//		ВыборкаСтанций = Запрос.Выполнить().Выбрать();
//		
//		Если ВыборкаСтанций.Следующий() Тогда
//			
//			Если ЗначениеЗаполнено(ВыборкаСтанций.НакладнаяСтанцияОтправления) Тогда
//				НовСтрокаРАсш.ПунктОтправления = ВыборкаСтанций.НакладнаяСтанцияОтправления;
//			Иначе
//				НовСтрокаРАсш.ПунктОтправления = ВыборкаСтанций.СделкаСтанцияОтправления;
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(ВыборкаСтанций.НакладнаяСтанцияНазначения) Тогда
//				НовСтрокаРАсш.ПунктНазначения = ВыборкаСтанций.НакладнаяСтанцияНазначения;
//			Иначе
//				НовСтрокаРАсш.ПунктНазначения = ВыборкаСтанций.СделкаСтанцияНазначения;
//			КонецЕсли;
//			
//		КонецЕсли;
//	Иначе
//	//Евросиб Каблов 19.05.2022 )
//		Если ЗначениеЗаполнено(СтрПоезда.ЖДН) Тогда
//			РеквизитыЖДН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрПоезда.ЖДН, "СтанцияНазначения, СтанцияОтправления");
//			Если ЗначениеЗаполнено(РеквизитыЖДН.СтанцияНазначения)
//				И ЗначениеЗаполнено(РеквизитыЖДН.СтанцияОтправления) Тогда
//				НовСтрокаРАсш.ПунктОтправления = РеквизитыЖДН.СтанцияОтправления;
//				НовСтрокаРасш.ПунктНазначения = РеквизитыЖДН.СтанцияНазначения;
//			КонецЕсли; 
//	//Евросиб - АСуслов 31.08.2021 11:35:24 #
//	//(
//		КонецЕсли;
//		Если НЕ ЗначениеЗаполнено(НовСтрокаРАсш.ПунктОтправления) Тогда
//			НовСтрокаРасш.ПунктОтправления = Сделка.СтанцияОтправления;	
//		КонецЕсли; 
//		Если НЕ ЗначениеЗаполнено(НовСтрокаРАсш.ПунктНазначения) Тогда
//			НовСтрокаРасш.ПунктНазначения = Сделка.СтанцияНазначения;
//		КонецЕсли; 
//	//)
//	//Евросиб - АСуслов 31.08.2021 11:35:25 #
//	КонецЕсли;
//	
//	
//	СтруктураСуммыВозмещаемые = Новый Структура("СуммаВознаграждения, СуммаНДСВознаграждения");
//	ЗаполнитьЗначенияСвойств(СтруктураСуммыВозмещаемые, НСтр);
//	Если СтруктураСуммыВозмещаемые.СуммаВознаграждения <> Неопределено Тогда
//		НовСтрокаРасш.СуммаВознаграждения = Нстр.СуммаВознаграждения / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//		НовСтрокаРасш.СуммаНДСВознаграждения = Нстр.СуммаНДСВознаграждения / ?(Нстр.Количество = 0, 1, Нстр.Количество);
//	КонецЕсли; 
//	
//	//Евросиб - АСуслов 13.09.2021 20:07:28 #33698
//	//(
//	НовСтрокаРасш.СтрокаСвязьУчетныхЕдиниц = СтрПоезда.ГУИД;
//	НовСтрокаРасш.Сделка = Сделка;
//	//)
//	//Евросиб - АСуслов 13.09.2021 20:07:41 #33698
//	
//	
//	//Попытка
//	//	НовСтрокаРасш.Комментарий = Выборка.Комментарий;
//	//	НовСтрокаРасш.ДатаНачалаПериодаПовагонки = Выборка.ДатаНачалаПериодаПовагонкиУчДок;
//	//	НовСтрокаРасш.ДатаОкончанияПериодаПовагонки = Выборка.ДатаОкончанияПериодаПовагонкиУчДок;
//	//Исключение
//	//КонецПопытки;
//	СтруктураЗаполненияПолей = Новый Структура("Комментарий, ДатаНачалаПериодаПовагонкиУчДок, ДатаОкончанияПериодаПовагонкиУчДок"
//												,"", Дата(1,1,1), Дата(1,1,1));
//	ЗаполнитьЗначенияСвойств(СтруктураЗаполненияПолей, Выборка);
//	НовСтрокаРасш.Комментарий 					= СтруктураЗаполненияПолей.Комментарий;
//	НовСтрокаРасш.ДатаНачалаПериодаПовагонки 	= СтруктураЗаполненияПолей.ДатаНачалаПериодаПовагонкиУчДок;
//	НовСтрокаРасш.ДатаОкончанияПериодаПовагонки = СтруктураЗаполненияПолей.ДатаОкончанияПериодаПовагонкиУчДок;
//	
//							

//КонецПроцедуры

Функция НайтиСтрокуПоезда(Сделка, Номер,ПоискПоКТК = Истина, Контрагент = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозки,
	|	СделкаСвязьУчетныхЕдиниц.ВозвратныйКлиент КАК ВозвратныйКлиент,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	|	СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	|	СделкаСвязьУчетныхЕдиниц.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	|	СделкаСвязьУчетныхЕдиниц.ДатаОтправки КАК ДатаОтправки,
	|	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.ПравилоГотовностиКВыставлению КАК ПравилоГотовностиКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы,
	|	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.ВремяПрибытияНаТерминал КАК ВремяПрибытияНаТерминал,
	|	СделкаСвязьУчетныхЕдиниц.ДокументыВыставлены КАК ДокументыВыставлены,
	|	СделкаСвязьУчетныхЕдиниц.Удалена КАК Удалена,
	|	СделкаСвязьУчетныхЕдиниц.Изменена КАК Изменена,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Клиент КАК Доплата_Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Договор КАК Доплата_Договор,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Доплата КАК Доплата_Доплата,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Валюта КАК Доплата_Валюта,
	|	СделкаСвязьУчетныхЕдиниц.СтокСдачиПорожнего КАК СтокСдачиПорожнего,
	|	СделкаСвязьУчетныхЕдиниц.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//Евросиб Каблов 20.05.2022 ( Task 45436
	|	СделкаСвязьУчетныхЕдиниц.ДокументФФД КАК ДокументФФД,
	|	ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) КАК ЗаменятьСтанциюНаОсновную
	//Евросиб Каблов 20.05.2022 )
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//Евросиб Каблов 20.05.2022 ( Task 45436
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО СделкаСвязьУчетныхЕдиниц.ДокументФФД = ФормированиеФинДокументов.Документ
	//Евросиб Каблов 20.05.2022 )
	|ГДЕ                                         
	|   СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка 
	|	И ВЫБОР
	|			КОГДА &ПоискПоКТК
	|				ТОГДА СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование = &Номер
	|			ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Вагон.Наименование = &Номер
	|		КОНЕЦ
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|   И ВЫБОР КОГДА &Контрагент = Неопределено ТОГДА ИСТИНА ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Клиент = &Контрагент КОНЕЦ";
	Запрос.УстановитьПараметр("Номер", СокрЛП(Номер));
	Запрос.УстановитьПараметр("ПоискПоКТК", ПоискПоКТК);
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0];
	КонецЕсли; 
	
КонецФункции

//Евросиб Максимова 06.04.2021 #0226136
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Если РольДоступна("dc_ИзменитьПредставлениеДокументов") Тогда
		СтандартнаяОбработка = Ложь;
		Поля = Новый Массив;
		Поля.Добавить("СтанцияОтправления");
		Поля.Добавить("СтанцияНазначения");
		Поля.Добавить("Номер");
		Поля.Добавить("Дата");
		Поля.Добавить("ЖДОтправка");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если РольДоступна("dc_ИзменитьПредставлениеДокументов") Тогда
		СтандартнаяОбработка = Ложь;
		Представление ="Сделка "+
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер)+"/"+Формат(Данные.Дата,"ДФ=yyyy")+" "+
		Данные.СтанцияОтправления.Наименование+"-"+Данные.СтанцияНазначения.Наименование+ " от "+
		Формат(Данные.ЖДОтправка,"ДФ=dd.MM.yyyy");
	КонецЕсли;

КонецПроцедуры
//Евросиб Максимова 06.04.2021 #0226136

//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
&НаСервере
Функция СформироватьСчетНаОплатуПокупателюCreditNote(Сделка, Контрагент, Договор, СчетНаОплатуПокупателю) Экспорт
	
	МассивКомплектов = Новый Массив;
	
	// Определим данные для формирования документа
	
	// Получим данные по сделки
	ВыборкаДанных = ПолучитьВыборкуДанныхДляФормированияCreditNote(Сделка, СчетНаОплатуПокупателю);
	Пока ВыборкаДанных.Следующий() Цикл		
		Параметры = Новый Структура;
		Параметры.Вставить("Клиент", Контрагент);
		Параметры.Вставить("Договор", Договор);
		ДокументCreditNote = СоздатьДокументCreditNote(Сделка, ВыборкаДанных, Параметры);
		
		СтруктураСчет = новый Структура;
		СтруктураСчет.Вставить("CreditNote", ДокументCreditNote);
		СтруктураСчет.Вставить("Контрагент", Контрагент);
		СтруктураСчет.Вставить("Договор", Договор);
		МассивКомплектов.Добавить(СтруктураСчет);
	КонецЦикла;  
	
		
	Возврат МассивКомплектов;
	
КонецФункции //ДИТ Давудов М.А. Task32744 03.07.2021 Конец

//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
Функция ПолучитьВыборкуДанныхДляФормированияCreditNote(Сделка, СчетНаОплатуПокупателю) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СделкаДоходы.Ссылка КАК Сделка,
	//|	СделкаДоходы.ГУИД КАК ГУИД,
	//|	СделкаДоходы.Услуга КАК Услуга,
	//|	СделкаДоходы.Договор КАК Договор,
	//|	СделкаДоходы.Клиент КАК Клиент,
	//|	ЕСТЬNULL(СделкаДоходыКорректировка.Количество, СделкаДоходы.Количество) КАК Количество,
	//|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
	//|	ЕСТЬNULL(СделкаДоходыКорректировка.СуммаИтого, СделкаДоходы.СуммаИтого) КАК СуммаИтого,
	//|	ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг) КАК РеализацияТоваровУслуг,
	//|	ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|ПОМЕСТИТЬ ВТ_ДанныеСделки
	//|ИЗ
	//|	Документ.Сделка.Доходы КАК СделкаДоходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходыКорректировка
	//|		ПО СделкаДоходы.Ссылка = СделкаДоходыКорректировка.Ссылка
	//|			И СделкаДоходы.ГУИД = СделкаДоходыКорректировка.ГУИДИсправляемойСтроки
	//|			И СделкаДоходы.Услуга = СделкаДоходыКорректировка.Услуга
	//|			И СделкаДоходы.Договор = СделкаДоходыКорректировка.Договор
	//|			И СделкаДоходы.Клиент = СделкаДоходыКорректировка.Клиент
	//|			И СделкаДоходы.СтавкаНДС = СделкаДоходыКорректировка.СтавкаНДС
	//|ГДЕ
	//|	СделкаДоходы.Ссылка = &Сделка
	//|	И НЕ СделкаДоходы.Перевыставляемая
	//|	И НЕ СделкаДоходы.НеВыставлятьКлиенту
	//|	И СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	//|	И (ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	//|	И СделкаДоходы.Клиент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	//|	И ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СделкаДоходы.Ссылка,
	//|	СделкаДоходы.ГУИДИсправляемойСтроки,
	//|	СделкаДоходы.Услуга,
	//|	СделкаДоходы.Договор,
	//|	СделкаДоходы.Клиент,
	//|	СделкаДоходы.Количество,
	//|	СделкаДоходы.СтавкаНДС,
	//|	СделкаДоходы.СуммаИтого,
	//|	ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг),
	//|	ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю
	//|ИЗ
	//|	Документ.Сделка.Доходы КАК СделкаДоходы
	//|ГДЕ
	//|	СделкаДоходы.Ссылка = &Сделка
	//|	И НЕ СделкаДоходы.Перевыставляемая
	//|	И СделкаДоходы.НеВыставлятьКлиенту
	//|	И СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	//|	И (ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	//|	И СделкаДоходы.КорректировкаДокумента ССЫЛКА Документ.КорректировкаРеализации
	//|	И (ВЫРАЗИТЬ(СделкаДоходы.КорректировкаДокумента КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
	//|	И СделкаДоходы.Клиент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	//|	И ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг).СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	РеализацияТоваровУслуг
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю,
	//|	СчетНаОплатуПокупателюТовары.Ссылка.УдалитьСделка КАК Сделка,
	//|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК ГУИД,
	//|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	//|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание,
	//|	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
	//|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
	//|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
	//|	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	СчетНаОплатуПокупателюТовары.ЦенаВВалюте КАК ЦенаВВалюте,
	//|	СчетНаОплатуПокупателюТовары.ИсходнаяВалюта КАК ИсходнаяВалюта,
	//|	СчетНаОплатуПокупателюТовары.Калькуляция КАК Калькуляция,
	//|	СчетНаОплатуПокупателюТовары.РазмерКТК КАК РазмерКТК
	//|ПОМЕСТИТЬ ВТ_ДанныеСчетов
	//|ИЗ
	//|	ВТ_ДанныеСделки КАК ВТ_ДанныеСделки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	//|		ПО 
	//|           ВТ_ДанныеСделки.Сделка = СчетНаОплатуПокупателюТовары.Ссылка.УдалитьСделка
	//|			И 
	//|    		ВТ_ДанныеСделки.СчетНаОплатуПокупателю = СчетНаОплатуПокупателюТовары.Ссылка
	//|			И ВТ_ДанныеСделки.ГУИД = СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки
	//|ГДЕ
	//|	НЕ СчетНаОплатуПокупателюТовары.Ссылка.CreditNote
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.Проведен
	//|	И СчетНаОплатуПокупателюТовары.Ссылка.Выставлен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеСделки.Сделка КАК Сделка,
	//|	ВТ_ДанныеСделки.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
	//|	ВТ_ДанныеСделки.ГУИД КАК СтрокаДоходовСделки,
	//|	ВТ_ДанныеСчетов.Номенклатура КАК Номенклатура,
	//|	ВТ_ДанныеСчетов.Содержание КАК Содержание,
	//|	ВЫБОР
	//|		КОГДА ВТ_ДанныеСчетов.Количество = ВТ_ДанныеСделки.Количество
	//|			ТОГДА ВТ_ДанныеСчетов.Количество
	//|		ИНАЧЕ ВТ_ДанныеСчетов.Количество - ВТ_ДанныеСделки.Количество
	//|	КОНЕЦ КАК Количество,
	//|	ВТ_ДанныеСчетов.СтавкаНДС КАК СтавкаНДС,
	//|	ВТ_ДанныеСчетов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТ_ДанныеСчетов.ЦенаВВалюте КАК ЦенаВВалюте,
	//|	ВТ_ДанныеСчетов.ИсходнаяВалюта КАК ИсходнаяВалюта,
	//|	ВТ_ДанныеСчетов.Калькуляция КАК Калькуляция,
	//|	ВТ_ДанныеСчетов.РазмерКТК КАК РазмерКТК,
	//|	ВТ_ДанныеСчетов.Сумма - ВТ_ДанныеСделки.СуммаИтого КАК Сумма
	//|ИЗ
	//|	ВТ_ДанныеСделки КАК ВТ_ДанныеСделки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСчетов КАК ВТ_ДанныеСчетов
	//|		ПО ВТ_ДанныеСделки.СчетНаОплатуПокупателю = ВТ_ДанныеСчетов.СчетНаОплатуПокупателю
	//|			И ВТ_ДанныеСделки.ГУИД = ВТ_ДанныеСчетов.ГУИД
	//|ГДЕ
	//|	ВТ_ДанныеСчетов.Сумма > ВТ_ДанныеСделки.СуммаИтого
	//|	И ВТ_ДанныеСчетов.Количество >= ВТ_ДанныеСделки.Количество 
	//|ИТОГИ ПО
	//|	СчетНаОплатуПокупателю";
	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходы.Ссылка КАК Сделка,
		|	СделкаДоходы.ГУИД КАК ГУИД,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Договор КАК Договор,
		|	СделкаДоходы.Клиент КАК Клиент,
		|	ЕСТЬNULL(СделкаДоходыКорректировка.Количество, СделкаДоходы.Количество) КАК Количество,
		|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
		|	ЕСТЬNULL(СделкаДоходыКорректировка.СуммаИтого, СделкаДоходы.СуммаИтого) КАК СуммаИтого,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетНаОплатуПокупателю
		|ПОМЕСТИТЬ ВТ_ДанныеСделки
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходыКорректировка
		|		ПО (СделкаДоходы.Ссылка = СделкаДоходыКорректировка.Ссылка)
		|			И (СделкаДоходы.ГУИД = СделкаДоходыКорректировка.ГУИДИсправляемойСтроки)
		|			И (СделкаДоходы.Услуга = СделкаДоходыКорректировка.Услуга)
		|			И (СделкаДоходы.Договор = СделкаДоходыКорректировка.Договор)
		|			И (СделкаДоходы.Клиент = СделкаДоходыКорректировка.Клиент)
		|			И (СделкаДоходы.СтавкаНДС = СделкаДоходыКорректировка.СтавкаНДС)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|		ПО ((ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка)
		|ГДЕ
		|	СделкаДоходы.Ссылка = &Сделка
		|	И НЕ СделкаДоходы.Перевыставляемая
		|	И НЕ СделкаДоходы.НеВыставлятьКлиенту
		|	И СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		|	И (ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|	И СделкаДоходы.Клиент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
		|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &СчетНаОплатуПокупателю
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаДоходы.Ссылка,
		|	СделкаДоходы.ГУИДИсправляемойСтроки,
		|	СделкаДоходы.Услуга,
		|	СделкаДоходы.Договор,
		|	СделкаДоходы.Клиент,
		|	СделкаДоходы.Количество,
		|	СделкаДоходы.СтавкаНДС,
		|	СделкаДоходы.СуммаИтого,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|		ПО ((ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка)
		|ГДЕ
		|	СделкаДоходы.Ссылка = &Сделка
		|	И НЕ СделкаДоходы.Перевыставляемая
		|	И СделкаДоходы.НеВыставлятьКлиенту
		|	И СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		|	И (ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|	И СделкаДоходы.КорректировкаДокумента ССЫЛКА Документ.КорректировкаРеализации
		|	И (ВЫРАЗИТЬ(СделкаДоходы.КорректировкаДокумента КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
		|	И СделкаДоходы.Клиент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
		|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &СчетНаОплатуПокупателю
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РеализацияТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюТовары.Ссылка КАК СчетНаОплатуПокупателю,
		|	СчетНаОплатуПокупателюТовары.Ссылка.УдалитьСделка КАК Сделка,
		|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК ГУИД,
		|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
		|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание,
		|	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
		|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
		|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
		|	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СчетНаОплатуПокупателюТовары.ЦенаВВалюте КАК ЦенаВВалюте,
		|	СчетНаОплатуПокупателюТовары.ИсходнаяВалюта КАК ИсходнаяВалюта,
		|	СчетНаОплатуПокупателюТовары.Калькуляция КАК Калькуляция,
		|	СчетНаОплатуПокупателюТовары.РазмерКТК КАК РазмерКТК
		|ПОМЕСТИТЬ ВТ_ДанныеСчетов
		|ИЗ
		|	ВТ_ДанныеСделки КАК ВТ_ДанныеСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|		ПО (ВТ_ДанныеСделки.Сделка = СчетНаОплатуПокупателюТовары.Ссылка.УдалитьСделка)
		|			И (ВТ_ДанныеСделки.СчетНаОплатуПокупателю = СчетНаОплатуПокупателюТовары.Ссылка)
		|			И (ВТ_ДанныеСделки.ГУИД = СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки)
		|ГДЕ
		|	НЕ СчетНаОплатуПокупателюТовары.Ссылка.CreditNote
		|	И СчетНаОплатуПокупателюТовары.Ссылка.Проведен
		|	И СчетНаОплатуПокупателюТовары.Ссылка.Выставлен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеСделки.Сделка КАК Сделка,
		|	ВТ_ДанныеСделки.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
		|	ВТ_ДанныеСделки.ГУИД КАК СтрокаДоходовСделки,
		|	ВТ_ДанныеСчетов.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеСчетов.Содержание КАК Содержание,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеСчетов.Количество = ВТ_ДанныеСделки.Количество
		|			ТОГДА ВТ_ДанныеСчетов.Количество
		|		ИНАЧЕ ВТ_ДанныеСчетов.Количество - ВТ_ДанныеСделки.Количество
		|	КОНЕЦ КАК Количество,
		|	ВТ_ДанныеСчетов.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_ДанныеСчетов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеСчетов.ЦенаВВалюте КАК ЦенаВВалюте,
		|	ВТ_ДанныеСчетов.ИсходнаяВалюта КАК ИсходнаяВалюта,
		|	ВТ_ДанныеСчетов.Калькуляция КАК Калькуляция,
		|	ВТ_ДанныеСчетов.РазмерКТК КАК РазмерКТК,
		|	ВТ_ДанныеСчетов.Сумма - ВТ_ДанныеСделки.СуммаИтого КАК Сумма
		|ИЗ
		|	ВТ_ДанныеСделки КАК ВТ_ДанныеСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСчетов КАК ВТ_ДанныеСчетов
		|		ПО (ВТ_ДанныеСделки.СчетНаОплатуПокупателю = ВТ_ДанныеСчетов.СчетНаОплатуПокупателю)
		|			И (ВТ_ДанныеСделки.ГУИД = ВТ_ДанныеСчетов.ГУИД)
		|ГДЕ
		|	ВТ_ДанныеСчетов.Сумма > ВТ_ДанныеСделки.СуммаИтого
		|	И ВТ_ДанныеСчетов.Количество >= ВТ_ДанныеСделки.Количество
		|ИТОГИ ПО
		|	СчетНаОплатуПокупателю";
	//Евросиб СубботинВ #84453 02.07.2024 Конец //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 

		
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", СчетНаОплатуПокупателю);
	  	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Возврат ВыборкаДанных;
	
КонецФункции //ДИТ Давудов М.А. Task32744 03.07.2021 Конец

//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
Функция СоздатьДокументCreditNote(Сделка, ВыборкаДанных, Параметры)
	
	СчетОснование = ВыборкаДанных.СчетНаОплатуПокупателю;
	
	СчетCreditNote = НайтиСчетНаОплатуCreditNoteПоСчетуОснованию(Сделка, СчетОснование, Параметры);
	
	Если СчетCreditNote = Неопределено Тогда
		СчетCreditNoteОбъект = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	Иначе
		СчетCreditNoteОбъект = СчетCreditNote.ПолучитьОбъект();
	КонецЕсли;
	
	СчетCreditNoteОбъект.Товары.Очистить();
	
	ЗаполнитьЗначенияСвойств(
		СчетCreditNoteОбъект, 
		СчетОснование, 
		"АдресДоставки, БанковскийСчетОрганизации, БезДоверенностей,
		|ВалютаДокумента, Грузоотправитель, Грузополучатель, ДоговорКонтрагента,
		|КомиссионныеУслуги, Контрагент, Организация, ПодразделениеОрганизации, Сделка,
		|СуммаВключаетНДС, УчитыватьНДС, ЦФО, Факторинг, Партия, ОкруглятьКурсДоКоличестваЗнаков, 
		|ВидСтавки, ВидГруппировкиФрахта");
		
	СчетCreditNoteОбъект.CreditNote = Истина;
	СчетCreditNoteОбъект.СчетНаОплатуCreditNote = СчетОснование;
	СчетCreditNoteОбъект.АвансовыйСчет = Ложь;
	СчетCreditNoteОбъект.Дата = ТекущаяДатаСеанса();
	СчетCreditNoteОбъект.ПериодВО = НачалоМесяца(ТекущаяДатаСеанса());
	СчетCreditNoteОбъект.Ответственный = Пользователи.ТекущийПользователь();
	СчетCreditNoteОбъект.Маршрутизировать = Истина;
	
	СтрПараметровРеглУчет = Новый Структура;
	СтрПараметровРеглУчет.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	СтрПараметровРеглУчет.Вставить("Курс", 1);
	СтрПараметровРеглУчет.Вставить("Кратность", 1);
	
	СтрПараметров = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(СчетCreditNoteОбъект.ДоговорКонтрагента, СчетCreditNoteОбъект.Дата);
	СчетCreditNoteОбъект.ВалютаДокумента = СтрПараметров.Валюта;
	СчетCreditNoteОбъект.КурсВзаиморасчетов = СтрПараметров.Курс;
	СчетCreditNoteОбъект.КратностьВзаиморасчетов = СтрПараметров.Кратность;
	
	Выборка = ВыборкаДанных.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СчетCreditNoteОбъект.Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = НоваяСтрока.Сумма;
		//Если НоваяСтрока.Количество > 0 Тогда
		//	НоваяСтрока.Цена = НоваяСтрока.Сумма/НоваяСтрока.Количество;
		//КонецЕсли;
		
		НоваяСтрока.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(
								НоваяСтрока.Сумма,
								БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
								СчетCreditNoteОбъект.УчитыватьНДС,
								СчетCreditNoteОбъект.СуммаВключаетНДС);
	КонецЦикла;
	
	ИтогоВсегоНДС = ?(СчетCreditNoteОбъект.Товары.Количество() > 0, СчетCreditNoteОбъект.Товары.Итог("СуммаНДС"), 0);
	СчетCreditNoteОбъект.СуммаДокумента = ?(СчетCreditNoteОбъект.Товары.Количество() > 0, СчетCreditNoteОбъект.Товары.Итог("Сумма"), 0) +
		?(СчетCreditNoteОбъект.СуммаВключаетНДС, 0, ИтогоВсегоНДС);
		
	СчетCreditNoteОбъект.ДополнительныеСвойства.Вставить("ПрограммноеИзменение", Истина);
	СчетCreditNoteОбъект.Записать(РежимЗаписиДокумента.Проведение);

	Возврат СчетCreditNoteОбъект.Ссылка;
	
КонецФункции //ДИТ Давудов М.А. Task32744 03.07.2021 Конец

//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
Функция НайтиСчетНаОплатуCreditNoteПоСчетуОснованию(Сделка, СчетОснование, Параметры) Экспорт
	
	Если СчетОснование = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Счет = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.СчетНаОплатуCreditNote = &СчетОснование
	|	И СчетНаОплатуПокупателю.CreditNote
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	|   И СчетНаОплатуПокупателю.ДокументыОснования.Сделка = &Сделка
	//|	И СчетНаОплату.Сделка = &Сделка
	|	И СчетНаОплатуПокупателю.Контрагент = &Контрагент
	|	И СчетНаОплатуПокупателю.ДоговорКонтрагента = &ДоговорКонтрагента");	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("Контрагент", Параметры.Клиент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Параметры.Договор);
	Запрос.УстановитьПараметр("СчетОснование", СчетОснование);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Счет = Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции //ДИТ Давудов М.А. Task32744 03.07.2021 Конец

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("ПриПолученииСлужебныхРеквизитов", Ложь);
	
КонецПроцедуры

Процедура ПересчитатьПериоды(ОбъектСделка) Экспорт
	//ПересчитатьПериодыВДоходах(ОбъектСделка);
	//Евросиб - АСуслов 22.04.2022 13:46:29 #45021
	//(
	//ЗаполнитьДатыОказанияУслуги(ОбъектСделка);
	ДоходыСделкиСервер.ЗаполнитьДатыОказанияУслуги(ОбъектСделка);
	//)
	//Евросиб - АСуслов 22.04.2022 13:46:30 #45021
	//Евросиб - АСуслов 29.04.2022 12:38:53 #
	//(
	//Периоды в расходах нигде не используются
	//ЗаполнитьПериодыВРасходах(ОбъектСделка);
	//)
	//Евросиб - АСуслов 29.04.2022 12:38:53 #
КонецПроцедуры

Процедура ПересчитатьПериодыВДоходах(ОбъектСделка)
	
	//Евросиб - АСуслов 22.04.2022 13:46:29 #45021
	//(
	//ЗаполнитьДатыОказанияУслуги(ОбъектСделка);
	ДоходыСделкиСервер.ЗаполнитьДатыОказанияУслуги(ОбъектСделка);
	//)
	//Евросиб - АСуслов 22.04.2022 13:46:30 #45021
	
КонецПроцедуры

//Процедура ЗаполнитьПериодыВРасходах(ОбъектСделка)

//	Объект = ОбъектСделка;
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СделкаРасходы.ГУИД КАК ГУИД,
//	|	СделкаРасходы.ПериодУУ КАК ПериодУУ,
//	|	СделкаРасходы.ПериодВО КАК ПериодВО
//	|ПОМЕСТИТЬ ВТ_Расходы
//	|ИЗ
//	|	&Расходы КАК СделкаРасходы
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
//	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы
//	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
//	|ИЗ
//	|	&СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаДоходы.ГУИД КАК ГУИД,
//	|	СделкаДоходы.ПериодВО КАК ПериодВО,
//	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
//	|	СделкаДоходы.УчДокумент КАК УчДокумент
//	|ПОМЕСТИТЬ ВТ_Доходы
//	|ИЗ
//	|	&Доходы КАК СделкаДоходы
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СделкаРасходы.ГУИД КАК ГУИД,
//	|	СделкаДоходы.УчДокумент КАК УчДокумент,
//	|	ВЫБОР КОГДА СделкаРасходы.ПериодВО = ДатаВремя(1,1,1) ТОГДА СделкаДоходы.ПериодВО ИНАЧЕ СделкаРасходы.ПериодВО КОНЕЦ КАК ПериодВО,
//	|	СделкаДоходы.ДатаОказанияУслуги КАК ПериодУУ
//	|ИЗ
//	|	ВТ_Расходы КАК СделкаРасходы
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
//	|			ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
//	|		ПО СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
//	|ГДЕ     
//	|	НЕ(СделкаРасходы.ПериодВО = СделкаДоходы.ПериодВО
//	|				И СделкаРасходы.ПериодУУ = СделкаДоходы.ДатаОказанияУслуги)
//	|	И НЕ(СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
//	|				ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)";
//	ТаблицаРасходы = Объект.Расходы.Выгрузить();
//	Запрос.УстановитьПараметр("Расходы", ТаблицаРасходы);
//	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", Объект.СвязьДоходовИРасходов.Выгрузить());
//	Запрос.УстановитьПараметр("Доходы", Объект.Доходы.Выгрузить());
//	РезультатЗапроса = Запрос.Выполнить();
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат;
//	КонецЕсли; 
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		СтрокаРасход = ТаблицаРасходы.Найти(Выборка.ГУИД, "ГУИД");
//		Если НЕ ЗначениеЗаполнено(СтрокаРасход.ПериодВО) 
//			//Евросиб - АСуслов 13.01.2022 14:10:25 #
//			//(
//			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ПериодВО) Тогда
//			//)
//			//Евросиб - АСуслов 13.01.2022 14:10:26 #
//			СтрокаРасход.ПериодВО = Выборка.ПериодВО;
//		КонецЕсли;
//		Если НЕ ЗначениеЗаполнено(СтрокаРасход.ПериодУУ) 			
//			//Евросиб - АСуслов 13.01.2022 14:10:25 #
//			//(
//			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ПериодУУ) Тогда
//			//)
//			//Евросиб - АСуслов 13.01.2022 14:10:26 #

//			СтрокаРасход.ПериодУУ = Выборка.ПериодУУ;
//		КонецЕсли;
//	КонецЦикла; 
//	Объект.Расходы.Загрузить(ТаблицаРасходы);
//	
//КонецПроцедуры 

Процедура СвязатьДоходыРасходыСУЕ(ОбъектСделка, ГУИДДоходы = Неопределено, ГУИДРасходы = Неопределено, ГУИДСУЕ, Знач Услуга = Неопределено, ТаблицаСвязейДоходовИРасходов = Неопределено, ИдентификаторСтрокиКалькуляции = Неопределено) Экспорт
	
	Если ТаблицаСвязейДоходовИРасходов = Неопределено Тогда
		ТаблицаСвязейДоходовИРасходов = ОбъектСделка.СвязьДоходовИРасходов;
	КонецЕсли;
	//Если Услуга = Неопределено, то считаем, что это основная услуга, в ТЧ заполняем пустой услугой
	Если Не ЗначениеЗаполнено(ГУИДСУЕ) Тогда
		Возврат;
	КонецЕсли; 
	Если Услуга = Неопределено Тогда
		Услуга = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	//Если заполнены все поля, то проверяем и сразу добавляем
	Если ЗначениеЗаполнено(ГУИДДоходы)
		И ЗначениеЗаполнено(ГУИДРасходы) 
		И ЗначениеЗаполнено(ГУИДСУЕ) Тогда                           
		СтруктураПоиска = Новый Структура("Доходы, Расходы, СвязьУчетныхЕдиниц, Услуга", ГУИДДоходы, ГУИДРасходы, ГУИДСУЕ, Услуга);
		СтрокиСвязь = ТаблицаСвязейДоходовИРасходов.НайтиСтроки(СтруктураПоиска);
		Если СтрокиСвязь.Количество() = 0 Тогда
			нСтрокаСвязь = ТаблицаСвязейДоходовИРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрокаСвязь, СтруктураПоиска);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Если ГуидДоходы = Неопределено, то записываем связь Расходы - СУЕ
	//проверим, если строчка с ГУИДРасходы+Услуга уже есть, то пропускаем, иначе добавляем
	Если ГУИДДоходы = Неопределено 
		//Евросиб - АСуслов 06.12.2023 11:56:29 #78322
		//(
		ИЛИ ГУИДДоходы = "" Тогда
		//)
		//Евросиб - АСуслов 06.12.2023 11:56:31 #78322Тогда
		СтрокиСвязь = ТаблицаСвязейДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы, Услуга", ГУИДРасходы, Услуга));
		Если СтрокиСвязь.Количество()>0 Тогда
			Возврат;
		КонецЕсли;                               
		//Евросиб - АСуслов 22.12.2023 14:34:33 #78945
		//(
		//ничего не ищем, просто добавляем связь.
		//Если записи по строке расхода+Услуга нет, то нужно найти записи СУЕ+Услуга
		//СтрокиСвязь = ТаблицаСвязейДоходовИРасходов.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Услуга", ГУИДСУЕ, Услуга));
		//Если записи есть, то значит есть связь СУЕ-Доходы, поэтому, если Расходы не заполнена, то заполняем
		//если заполнена, то делаем копию строки и заполняем ГУИДРасходы
		//если записи нет, то добавляем
		//Если СтрокиСвязь.Количество() = 0 Тогда
			//СУЕ+Услуга нет, ищем
			нСтрокаСвязь = ТаблицаСвязейДоходовИРасходов.Добавить();
			нСтрокаСвязь.СвязьУчетныхЕдиниц = ГУИДСУЕ;
			нСтрокаСвязь.Расходы = ГУИДРасходы;
			нСтрокаСвязь.Услуга = Услуга;
		//ИначеЕсли СтрокиСвязь.Количество() > 0 Тогда
			//СвязьЗаполнена = Ложь;
			//Для каждого СтрокаСвязь Из СтрокиСвязь Цикл
			//	Если НЕ ЗначениеЗаполнено(СтрокаСвязь.Расходы) Тогда
			//		СтрокаСвязь.Расходы = ГУИДРасходы;
			//		СвязьЗаполнена = Истина;
			//	КонецЕсли; 
			//КонецЦикла; 
			//Если Не СвязьЗаполнена Тогда
			//	нСтрокаСвязь = ТаблицаСвязейДоходовИРасходов.Добавить();
			//	ЗаполнитьЗначенияСвойств(нСтрокаСвязь, СтрокаСвязь);
			//	нСтрокаСвязь.Расходы = ГУИДРасходы;
			//КонецЕсли; 
		//КонецЕсли; 
		//)
		//Евросиб - АСуслов 22.12.2023 14:34:46 #78945
	КонецЕсли;
	//Если ГУИДРасходы неопределено, тогда записываем связь Доходы - СУЕ
	Если ГУИДРасходы = Неопределено 
		//Евросиб - АСуслов 06.12.2023 11:57:27 #78322
		//(
		ИЛИ ГУИДРасходы = "" Тогда
		//)
		//Евросиб - АСуслов 06.12.2023 11:57:31 #78322
		//проверим, если строки ГУИДСУЕ+ГУИДДоход есть, то ничего не делаем
		СтрокиСвязь = ТаблицаСвязейДоходовИРасходов.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц, Доходы, Услуга", ГУИДСУЕ, ГУИДДоходы, Услуга));
		Если СтрокиСвязь.Количество()>0 Тогда
			Возврат;
		КонецЕсли; 
		//Евросиб - АСуслов 22.12.2023 14:34:33 #78945
		//(
		//ничего не ищем, просто добавляем связь.
		//найдем все строки с ГУИДСУЕ+Услуга
		//СтрокиСвязь = ТаблицаСвязейДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы, СвязьУчетныхЕдиниц, Услуга", "", ГУИДСУЕ, Услуга));
		//если записей нет, то добавим
		//Если СтрокиСвязь.Количество() = 0 Тогда
			нСтрокаСвязь = ТаблицаСвязейДоходовИРасходов.Добавить();
			нСтрокаСвязь.СвязьУчетныхЕдиниц = ГУИДСУЕ;
			нСтрокаСвязь.Доходы = ГУИДДоходы;
			нСтрокаСвязь.Услуга = Услуга;
			//Возврат;
		//КонецЕсли; 
		//Если записи есть, то заполним доходы, там где не заполнены
		//Для каждого СтрокаСвязь Из СтрокиСвязь Цикл 
		//	Если ЗначениеЗаполнено(ИдентификаторСтрокиКалькуляции) Тогда
		//		СтрокиРасход = ОбъектСделка.Расходы.НайтиСтроки(Новый Структура("ГУИД", СтрокаСвязь.Расходы));
		//		Если СтрокиРасход.Количество() > 0 Тогда
		//			ИдентификаторСтрокиКалькуляцииРасход = СтрокиРасход[0].СтрокаКалькуляции;
		//			Если ИдентификаторСтрокиКалькуляции <> ИдентификаторСтрокиКалькуляцииРасход Тогда
		//				Продолжить;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//	//Если ЗначениеЗаполнено(СтрокаСвязь.Доходы) Тогда
		//	//	Продолжить;
		//	//КонецЕсли;
		//	СтрокаСвязь.Доходы = ГУИДДоходы;
		//КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьСсылкиНаВагоны_КТК_ТД_ВРасходах(ОбъектСделка) Экспорт
	
	Возврат;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК Услуга,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	ВЫРАЗИТЬ(СделкаРасходы.ТранспортныйДокумент КАК Документ.ТранспортныйДокумент) КАК ТранспортныйДокумент,
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходыВагоны.ГУИД КАК ГУИД,
	|	СделкаДоходыВагоны.Вагон КАК Вагон
	|ПОМЕСТИТЬ ВТ_ДоходыВагоны
	|ИЗ
	|	&ДоходыВагоны КАК СделкаДоходыВагоны
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходыКТК.ГУИД КАК ГУИД,
	|	СделкаДоходыКТК.КТК КАК КТК
	|ПОМЕСТИТЬ ВТ_ДоходыКТК
	|ИЗ
	|	&ДоходыКТК КАК СделкаДоходыКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходыТД.ГУИД КАК ГУИД,
	|	СделкаДоходыТД.ТД КАК ТД
	|ПОМЕСТИТЬ ВТ_ДоходыТД
	|ИЗ
	|	&ДоходыТД КАК СделкаДоходыТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	|	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча КАК НакладнаяПослеГруженогоПлеча,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГружКТК,
	|	СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК КАК ЖДНПерестановкиДоГружКТК,
	|	СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК КАК ЖДНПерестановкиДоПорКТК,
	|	СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН КАК ВагоннаяЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК КАК ПорожняяЖДНКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПорожняяВагоннаяЖДН КАК ПорожняяВагоннаяЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Вагон КАК Справочник.ТС) КАК Вагон
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ГруппаУслуг > 0
	|				И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2
	|			ТОГДА ТС.Ссылка
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК)
	|			ТОГДА СделкаРасходы.Вагон
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Вагон
	|	КОНЕЦ КАК ВагонСУЕ,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата)
	|			ТОГДА СделкаРасходы.Контейнер
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Контейнер
	|	КОНЕЦ КАК КонтейнерСУЕ,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов)
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.ПорожняяВагоннаяЖДН
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК)
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН)
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата)
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНВозвратаКТК)
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК
	|		КОГДА СделкаРасходы.Услуга = &УслугаФрахт
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент
	|		КОГДА СделкаРасходы.ГруппаУслуг > 0
	|				И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча
	|		КОГДА СделкаРасходы.ГруппаУслуг > 0
	|				И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК
	|		КОГДА НЕ СделкаРасходы.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА СделкаРасходы.ТранспортныйДокумент
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН
	|	КОНЕЦ КАК ТД,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВагоны КАК СделкаДоходыВагоны
	|		ПО СделкаРасходы.ГУИД = СделкаДоходыВагоны.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыКТК КАК СделкаДоходыКТК
	|		ПО СделкаРасходы.ГУИД = СделкаДоходыКТК.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыТД КАК СделкаДоходыТД
	|		ПО СделкаРасходы.ГУИД = СделкаДоходыТД.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	|				И (НЕ ТС.ПометкаУдаления)
	|		ПО СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК.НакладнаяЭТРАН = э_НакладнаяВагоны.Ссылка
	//|ГДЕ
	//|	СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.КонтейнерСУЕ КАК Контейнер2,
	|	ТрД.Ссылка КАК ТранспортныйДокумент1,
	|	ТС.Ссылка КАК Вагон2,
	|	ВТ.ГУИД КАК ГУИД,
	|	ВТ.ВагонСУЕ КАК Вагон,
	|	ВТ.КонтейнерСУЕ КАК Контейнер,
	|	ВТ.ТД КАК ТранспортныйДокумент,
	|	ВТ.Контейнер КАК Контейнер1,
	|	ВТ.Вагон КАК Вагон1,
	|	ВТ.ТранспортныйДокумент КАК ТранспортныйДокумент2
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО ВТ.КонтейнерСУЕ = ТЕ.Наименование
	|			И (НЕ ТЕ.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|		ПО ВТ.ВагонСУЕ = ТС.Наименование
	|			И (НЕ ТС.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТрД
	|		ПО ВТ.ТД = ТрД.НомерТранспортногоДокумента
	|			И (НЕ ТрД.ПометкаУдаления)
	|ГДЕ
	|	НЕ(ВТ.Контейнер = ВТ.КонтейнерСУЕ
	|				И ВТ.Вагон = ВТ.ВагонСУЕ
	|				И ВТ.ТранспортныйДокумент = ВТ.ТД)";
	//Запрос.УстановитьПараметр("Сделка", ОбъектСделка.Ссылка);
	Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ДоходыВагоны", ОбъектСделка.ДоходыВагоны.Выгрузить());
	Запрос.УстановитьПараметр("ДоходыКТК", ОбъектСделка.ДоходыКТК.Выгрузить());
	Запрос.УстановитьПараметр("ДоходыТД", ОбъектСделка.ДоходыТД.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	Выборка = РезультатЗапроса.Выбрать();
	ТЗРасходы = ОбъектСделка.Расходы.Выгрузить();
	Пока Выборка.Следующий() Цикл
		СтрокаРасход = ТЗРасходы.Найти(Выборка.ГУИД, "ГУИД");
		ЗаполнитьЗначенияСвойств(СтрокаРасход, Выборка, "Вагон, Контейнер, ТранспортныйДокумент");
	КонецЦикла;
	ОбъектСделка.Расходы.Загрузить(ТЗРасходы);
		
КонецПроцедуры

//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментировано (перенесено в ОМ ДоходыСделкиСервер)
//Процедура СкорректироватьСуммыРасшифровки(Объект) Экспорт
//	//исправим суммы в расшифровке, чтобы суммы по строкам услуг совпадали с суммами их расшифровок
//	//получим строки с суммами
////Евросиб Гудкова( 03.10.2021
////	ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
//	ЭтоКоррРТУ = Ложь;
//	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") Тогда
//		ТЗСуммыУслуги = Объект.Товары.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
//	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда 
//		ЭтоКоррРТУ = Истина;
//		ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");
//	Иначе
//		ТЗСуммыУслуги = Объект.Услуги.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
//	КонецЕсли; 
//// Евросиб Гудкова) 	
//	Если ЭтоКоррРТУ Тогда
//		ТЗСуммыУслуги.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения", "Сумма, СуммаНДС,СуммаДоИзменения, СуммаНДСДоИзменения");
//	Иначе	
//		ТЗСуммыУслуги.Свернуть("СтрокаДоходовСделки", "Сумма, СуммаНДС");
//	КонецЕсли; 
//	//получим расшифровки с суммами
//	Если ЭтоКоррРТУ Тогда
//		//ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");
//		//ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения");     
//		//ДИТ Беляев СЮ, Ticket#0248427, Ticket#0249386 09-11-2021 ++
//		ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, Сумма, СуммаНДС");
//		ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения","СуммаДоИзменения, СуммаНДСДоИзменения, Сумма, СуммаНДС");
//		//ДИТ Беляев СЮ, Ticket#0248427, Ticket#0249386 09-11-2021 --
//	Иначе
//		ТЗСуммыРасшифровки = Объект.РасшифровкаУслугПоТС.Выгрузить(,"СтрокаДоходовСделки, Сумма, СуммаНДС");
//		ТЗСуммыРасшифровки.Свернуть("СтрокаДоходовСделки", "Сумма, СуммаНДС");
//	КонецЕсли; 
//	//сверим суммы
//	Для каждого СтрокаСуммаУслуги Из ТЗСуммыУслуги Цикл
//		СтрокаСуммаРасшифровки = ТЗСуммыРасшифровки.Найти(СтрокаСуммаУслуги.СтрокаДоходовСделки);
//		Если СтрокаСуммаРасшифровки <> Неопределено Тогда
//			Если СтрокаСуммаУслуги.Сумма <> СтрокаСуммаРасшифровки.Сумма
//				ИЛИ СтрокаСуммаУслуги.СуммаНДС <> СтрокаСуммаРасшифровки.СуммаНДС Тогда
//				//перезаполним суммы
//				СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделки", СтрокаСуммаУслуги.СтрокаДоходовСделки));
//				СуммаПоСтроке = СтрокаСуммаУслуги.Сумма / СтрокиРасшифровки.Количество();
//				СуммаНДСПоСтроке = СтрокаСуммаУслуги.СуммаНДС / СтрокиРасшифровки.Количество();
//				ОстатокСумма = СтрокаСуммаУслуги.Сумма;
//				ОстатокСуммаНДС = СтрокаСуммаУслуги.СуммаНДС;
//				Для каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
//					СтрокаРасшифровки.Цена = СуммаПоСтроке;
//					СтрокаРасшифровки.Сумма = СуммаПоСтроке;
//					СтрокаРасшифровки.СуммаНДС = СуммаНДСПоСтроке;
//					ОстатокСумма = ОстатокСумма - СтрокаРасшифровки.Сумма;
//					ОстатокСуммаНДС = ОстатокСуммаНДС - СтрокаРасшифровки.СуммаНДС;
//				КонецЦикла; 
//				Если ОстатокСумма <> 0 Тогда
//					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.Сумма + ОстатокСумма;
//					СтрокаРасшифровки.Цена = СтрокаРасшифровки.Сумма;
//				КонецЕсли; 
//				Если ОстатокСуммаНДС <> 0 Тогда
//					СтрокаРасшифровки.СуммаНДС = СтрокаРасшифровки.СуммаНДС + ОстатокСуммаНДС;
//				КонецЕсли; 
//			КонецЕсли;
//			Если ЭтоКоррРТУ Тогда
//				Если СтрокаСуммаУслуги.СуммаДоИзменения <> СтрокаСуммаРасшифровки.СуммаДоИзменения
//					ИЛИ СтрокаСуммаУслуги.СуммаНДСДоИзменения <> СтрокаСуммаРасшифровки.СуммаНДСДоИзменения Тогда
//					//перезаполним суммы
//					//Евросиб - АСуслов 05.03.2022 10:53:51 #
//					//
//					//(
//					//СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделкиДоИзменения", СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения));
//					СтрокиРасшифровки = Объект.РасшифровкаУслугПоТС.НайтиСтроки(Новый Структура("СтрокаДоходовСделкиДоИзменения", ?(СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения = "", СтрокаСуммаУслуги.СтрокаДоходовСделки, СтрокаСуммаУслуги.СтрокаДоходовСделкиДоИзменения)));
//					//)
//					//Евросиб - АСуслов 05.03.2022 10:53:52 #
//					СуммаПоСтроке = СтрокаСуммаУслуги.СуммаДоИзменения / СтрокиРасшифровки.Количество();
//					СуммаНДСПоСтроке = СтрокаСуммаУслуги.СуммаНДСДоИзменения / СтрокиРасшифровки.Количество();
//					ОстатокСумма = СтрокаСуммаУслуги.СуммаДоИзменения;
//					ОстатокСуммаНДС = СтрокаСуммаУслуги.СуммаНДСДоИзменения;
//					Для каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
//						СтрокаРасшифровки.ЦенаДоИзменения = СуммаПоСтроке;
//						СтрокаРасшифровки.СуммаДоИзменения = СуммаПоСтроке;
//						СтрокаРасшифровки.СуммаНДСДоИзменения = СуммаНДСПоСтроке;
//						ОстатокСумма = ОстатокСумма - СтрокаРасшифровки.СуммаДоИзменения;
//						ОстатокСуммаНДС = ОстатокСуммаНДС - СтрокаРасшифровки.СуммаНДСДоИзменения;
//					КонецЦикла; 
//					Если ОстатокСумма <> 0 Тогда
//						СтрокаРасшифровки.СуммаДоИзменения = СтрокаРасшифровки.СуммаДоИзменения + ОстатокСумма;
//						СтрокаРасшифровки.ЦенаДоИзменения = СтрокаРасшифровки.СуммаДоИзменения;
//					КонецЕсли; 
//					Если ОстатокСуммаНДС <> 0 Тогда
//						СтрокаРасшифровки.СуммаНДСДоИзменения = СтрокаРасшифровки.СуммаНДСДоИзменения + ОстатокСуммаНДС;
//					КонецЕсли; 
//				КонецЕсли;
//			КонецЕсли; 
//		КонецЕсли; 
//	КонецЦикла; 
//КонецПроцедуры
 
Функция ПолучитьСписокПорожнихГруженыхСделокДляОбъединения(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;                                               
	Запрос.УстановитьПараметр("ОтборПоСделке", Ложь);
	Запрос.УстановитьПараметр("Сделка", Неопределено);
	Если Параметры <> Неопределено Тогда                             
		Если Параметры.Свойство("Сделка") Тогда
			Запрос.УстановитьПараметр("ОтборПоСделке", Истина);
			Запрос.УстановитьПараметр("Сделка", Параметры.Сделка);
		КонецЕсли;
	КонецЕсли;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_КалькуляцииСПодсылом
	//|ИЗ
	//|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|ГДЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних
	////Евросиб - АСуслов 22.02.2022 10:52:15 #47601
	////(
	////|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Проведен
	//|	И НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ПометкаУдаления
	////)
	////Евросиб - АСуслов 22.02.2022 10:52:19 #47601
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Расходы.Ссылка КАК Сделка,
	//|	Расходы.ГУИД КАК СтрокаРасходовСделки,
	//|	Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСУЕ
	//|ПОМЕСТИТЬ ТЧРасходы
	//|ИЗ
	//|	Документ.Сделка.Расходы КАК Расходы
	//|ГДЕ
	//|	Расходы.Калькуляция В
	//|			(ВЫБРАТЬ
	//|				т.Ссылка
	//|			ИЗ
	//|				ВТ_КалькуляцииСПодсылом КАК т)
	//|	И Расходы.Ссылка.ПодсылПорожних = ЛОЖЬ
	//|	И Расходы.Ссылка.Проведен
	//|   И ВЫБОР КОГДА &ОтборПоСделке = Истина ТОГДА Расходы.Ссылка = &Сделка ИНАЧЕ ИСТИНА КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТЧРасходы.Сделка КАК Сделка,
	//|	ТЧРасходы.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
	//|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	//|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСУЕ,
	//|	СделкаСвязьДоходовИРасходов.Доходы КАК СтрокаДоходовСделки
	//|ПОМЕСТИТЬ ВТГруженые
	//|ИЗ
	//|	ТЧРасходы КАК ТЧРасходы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|			ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	//|				И СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	//|				И (СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	//|		ПО ТЧРасходы.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	//|			И ТЧРасходы.СтрокаСУЕ = СделкаСвязьУчетныхЕдиниц.ГУИД
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТГруженые.Сделка КАК ГруженаяСделка,
	//|	ВТГруженые.Контейнер КАК Контейнер,
	//|	ВТГруженые.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	//|	СоставПорожнейСделки.Ссылка КАК ПорожняяСделка,
	//|	СделкаРасходы.ГУИД КАК СтрокаРасходовПорожнейСделки,
	//|	СделкаРасходы.УчДокумент КАК УчДокумент,
	//|	ВТГруженые.СтрокаСУЕ КАК СтрокаСУЕГруженойСделки,
	//|	ВТГруженые.СтрокаДоходовСделки КАК СтрокаДоходовГруженойСделки
	//|ИЗ
	//|	ВТГруженые КАК ВТГруженые
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СоставПорожнейСделки
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	//|			ПО СоставПорожнейСделки.Ссылка = СделкаРасходы.Ссылка
	//|				И СоставПорожнейСделки.ГУИД = СделкаРасходы.СтрокаСвязьУчетныхЕдиниц
	//|				И (НЕ СделкаРасходы.УслугаОтключена)
	//|		ПО ВТГруженые.НомерПорожнейЖДНКТК = СоставПорожнейСделки.НомерЖДН
	//|			И ВТГруженые.Контейнер = СоставПорожнейСделки.Контейнер
	//|			И (СоставПорожнейСделки.Ссылка.Проведен)
	//|ГДЕ
	//|	ВТГруженые.НомерПорожнейЖДНКТК <> """"
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ГруженаяСделка,
	//|	ПорожняяСделка,
	//|	СтрокаРасходовПорожнейСделки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВТ_КалькуляцииСПодсылом";                    
	
	//ДИТ, Беляев СЮ, Ticket#0278810, 12-07-2022, начало
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_КалькуляцииСПодсылом
		|ИЗ
		|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|ГДЕ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних
		|	И НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходыПорожнейСделки.Ссылка КАК ПорожняяСделка,
		|	РасходыПорожнейСделки.ГУИД КАК СтрокаРасходовПорожнейСделки,
		|	РасходыПорожнейСделки.УчДокумент КАК УчДокументПорожнейСделки,
		|	СоставПорожнейСделки.ЖДН КАК ЖДНПорожнейСделки,
		|	СоставПорожнейСделки.Контейнер КАК КонтейнерПорожнейСделки
		|ПОМЕСТИТЬ ТЧРасходыПорожнейСделки
		|ИЗ
		|	Документ.Сделка.Расходы КАК РасходыПорожнейСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СоставПорожнейСделки
		|		ПО (СоставПорожнейСделки.Ссылка = РасходыПорожнейСделки.Ссылка)
		|			И (СоставПорожнейСделки.ГУИД = РасходыПорожнейСделки.СтрокаСвязьУчетныхЕдиниц)
		|ГДЕ
		|	РасходыПорожнейСделки.Ссылка.ПодсылПорожних = ИСТИНА
		|	И РасходыПорожнейСделки.Ссылка.Проведен
		|	И НЕ РасходыПорожнейСделки.УслугаОтключена
		|	И РасходыПорожнейСделки.ПеренесеннаяСделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧРасходыПорожнейСделки.ПорожняяСделка КАК ПорожняяСделка,
		|	ТЧРасходыПорожнейСделки.СтрокаРасходовПорожнейСделки КАК СтрокаРасходовПорожнейСделки,
		|	ТЧРасходыПорожнейСделки.ЖДНПорожнейСделки КАК ЖДНПорожнейСделки,
		|	ТЧРасходыПорожнейСделки.КонтейнерПорожнейСделки КАК Контейнер,
		|	ТЧРасходыПорожнейСделки.УчДокументПорожнейСделки КАК УчДокумент,
		|	СвязьУчетныхЕдиницГруженойСделки.Ссылка КАК ГруженаяСделка,
		|	СвязьУчетныхЕдиницГруженойСделки.ГУИД КАК СтрокаСУЕГруженойСделки,
		|	СвязьУчетныхЕдиницГруженойСделки.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК
		|ПОМЕСТИТЬ ТЧРасходыПорожнейИГруженойСделок
		|ИЗ
		|	ТЧРасходыПорожнейСделки КАК ТЧРасходыПорожнейСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиницГруженойСделки
		|		ПО (СвязьУчетныхЕдиницГруженойСделки.Ссылка.ПодсылПорожних = ЛОЖЬ)
		|			И (СвязьУчетныхЕдиницГруженойСделки.Ссылка.Проведен)
		|			И (СвязьУчетныхЕдиницГруженойСделки.ПорожняяЖДНКТК <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
		|			И (СвязьУчетныхЕдиницГруженойСделки.ПорожняяЖДНКТК = ТЧРасходыПорожнейСделки.ЖДНПорожнейСделки)
		|			И (СвязьУчетныхЕдиницГруженойСделки.Контейнер = ТЧРасходыПорожнейСделки.КонтейнерПорожнейСделки)
		//ДИТ, Беляев СЮ, BUG 82454, 16-04-2024, начало
		|			И (НЕ СвязьУчетныхЕдиницГруженойСделки.ОтключитьРасходы)
		//ДИТ, Беляев СЮ, BUG 82454, 16-04-2024, конец
		|			И (СвязьУчетныхЕдиницГруженойСделки.Калькуляция В
		|				(ВЫБРАТЬ
		|					ВТ_КалькуляцииСПодсылом.Ссылка
		|				ИЗ
		|					ВТ_КалькуляцииСПодсылом КАК ВТ_КалькуляцииСПодсылом))    
		|			И ВЫБОР КОГДА &ОтборПоСделке = Истина ТОГДА СвязьУчетныхЕдиницГруженойСделки.Ссылка = &Сделка ИНАЧЕ ИСТИНА КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧРасходыПорожнейИГруженойСделок.ГруженаяСделка КАК ГруженаяСделка,
		|	ТЧРасходыПорожнейИГруженойСделок.Контейнер КАК Контейнер,
		|	ТЧРасходыПорожнейИГруженойСделок.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
		|	ТЧРасходыПорожнейИГруженойСделок.ПорожняяСделка КАК ПорожняяСделка,
		|	ТЧРасходыПорожнейИГруженойСделок.СтрокаРасходовПорожнейСделки КАК СтрокаРасходовПорожнейСделки,
		//|	ТЧРасходыПорожнейИГруженойСделок.ЖДНПорожнейСделки КАК ЖДНПорожнейСделки,
		|	ТЧРасходыПорожнейИГруженойСделок.УчДокумент КАК УчДокумент,
		|	ТЧРасходыПорожнейИГруженойСделок.СтрокаСУЕГруженойСделки КАК СтрокаСУЕГруженойСделки,
		|	СделкаСвязьДоходовИРасходов.Доходы КАК СтрокаДоходовГруженойСделки
		|ИЗ
		|	ТЧРасходыПорожнейИГруженойСделок КАК ТЧРасходыПорожнейИГруженойСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|		ПО ТЧРасходыПорожнейИГруженойСделок.ГруженаяСделка = СделкаСвязьДоходовИРасходов.Ссылка
		|			И ТЧРасходыПорожнейИГруженойСделок.СтрокаСУЕГруженойСделки = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
		|			И (СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруженаяСделка,
		|	ПорожняяСделка,
		|	СтрокаРасходовПорожнейСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_КалькуляцииСПодсылом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТЧРасходыПорожнейСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТЧРасходыПорожнейИГруженойСделок";
	//ДИТ, Беляев СЮ, Ticket#0278810, 12-07-2022, начало	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Процедура ОбъединитьПорожниеИГруженыеСделки(ТаблицаПереноса, АдресРезультата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТ_ТаблицаПереноса
	|ИЗ
	|	&ТаблицаПереноса КАК т
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ т.ГруженаяСделка ИЗ ВТ_ТаблицаПереноса как т
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ т.ПорожняяСделка ИЗ ВТ_ТаблицаПереноса КАК т";
	Запрос.УстановитьПараметр("ТаблицаПереноса", ТаблицаПереноса);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[1].Пустой() Тогда 
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
		СтруктураРезультата.Вставить("РезультатОбъединения", "Не найдено подходящих сделок для объединения");
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		Возврат;
	КонецЕсли;              
	ВыборкаПорожнихСделок = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаПорожнихСделок.Следующий() Цикл
		обСделка = ВыборкаПорожнихСделок.ПорожняяСделка.ПолучитьОбъект();
		обСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
		обСделка.Записать();
	КонецЦикла;
	
	СписокПорожнихСделокСтрокой = "";
	ВыборкаГруженыхСделок = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаГруженыхСделок.СледующийПоЗначениюПоля("ГруженаяСделка") Цикл  
		ТаблицаПереноса = ПолучитьСписокПорожнихГруженыхСделокДляОбъединения(Новый Структура("Сделка", ВыборкаГруженыхСделок.ГруженаяСделка));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ_ТаблицаПереноса
		|ИЗ
		|	&ТаблицаПереноса КАК т
		|;
		|ВЫБРАТЬ * ИЗ ВТ_ТаблицаПереноса
		|УПОРЯДОЧИТЬ ПО ПорожняяСделка, СтрокаРасходовПорожнейСделки";
		Запрос.УстановитьПараметр("ТаблицаПереноса", ТаблицаПереноса);
		Выборка = Запрос.Выполнить().Выбрать();
		//ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, начало		
		ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,ВыборкаГруженыхСделок.ГруженаяСделка,"Начало обработки документа");
        //ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, конец
		ТаблицаПТУ = ПолучитьСтруктуруТаблицыПТУ();
		ГруженаяСделка = ВыборкаГруженыхСделок.ГруженаяСделка.ПолучитьОбъект(); 
		ГруженаяСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
		МассивЗаписываемыхПорожнихСделок = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ПорожняяСделка") Цикл
			ПорожняяСделка = Выборка.ПорожняяСделка.ПолучитьОбъект(); 
			ПорожняяСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
			Пока Выборка.СледующийПоЗначениюПоля("СтрокаРасходовПорожнейСделки") Цикл
				//переносим строки из порожней в груженую
				СтрокаРасходовПорожнейСделки = ПорожняяСделка.Расходы.Найти(Выборка.СтрокаРасходовПорожнейСделки,"ГУИД");
				нСтрокаРасходовГруженойСделки = ГруженаяСделка.Расходы.Добавить();                  
				//Евросиб - АСуслов 15.08.2022 14:05:37 #50982
				//(
				//ЗаполнитьЗначенияСвойств(нСтрокаРасходовГруженойСделки, СтрокаРасходовПорожнейСделки);
				ЗаполнитьЗначенияСвойств(нСтрокаРасходовГруженойСделки, СтрокаРасходовПорожнейСделки);
				//)
				//Евросиб - АСуслов 15.08.2022 14:05:40 #50982	
				нСтрокаРасходовГруженойСделки.ГУИД = Новый УникальныйИдентификатор;
				нСтрокаРасходовГруженойСделки.СтрокаСвязьУчетныхЕдиниц = Выборка.СтрокаСУЕГруженойСделки;
				нСтрокаРасходовГруженойСделки.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок;
				нСтрокаРасходовГруженойСделки.СтрокаРасходовВПеренесеннойСделке = СтрокаРасходовПорожнейСделки.ГУИД;
				нСтрокаРасходовГруженойСделки.ПеренесеннаяСделка = Выборка.ПорожняяСделка;
				//Евросиб - АСуслов 09.12.2022 16:56:25 #
				//(
				нСтрокаРасходовГруженойСделки.СтрокаРасходовВСделкеИсточник = СтрокаРасходовПорожнейСделки.ГУИД;
				нСтрокаРасходовГруженойСделки.ПеренесеннаяСделкаИсточник = Выборка.ПорожняяСделка;
				//)
				//Евросиб - АСуслов 09.12.2022 16:56:25 #
				Документы.Сделка.СвязатьДоходыРасходыСУЕ(ГруженаяСделка, Выборка.СтрокаДоходовГруженойСделки, нСтрокаРасходовГруженойСделки.ГУИД, Выборка.СтрокаСУЕГруженойСделки);
				Если ЗначениеЗаполнено(СтрокаРасходовПорожнейСделки.УчДокумент) Тогда
					нСтрокаТаблицаПТУ = ТаблицаПТУ.Добавить();
					нСтрокаТаблицаПТУ.ПТУ = нСтрокаРасходовГруженойСделки.УчДокумент;
					нСтрокаТаблицаПТУ.СделкаНовая = ГруженаяСделка.Ссылка;
					нСтрокаТаблицаПТУ.СделкаСтарая= ПорожняяСделка.Ссылка;
					нСтрокаТаблицаПТУ.ИдентификаторСтрокиРасходовСделкиНовая = нСтрокаРасходовГруженойСделки.ГУИД;
					нСтрокаТаблицаПТУ.ИдентификаторСтрокиРасходовСделкиСтарая = СтрокаРасходовПорожнейСделки.ГУИД;
				КонецЕсли; 
				//в порожней сделке пометим строку как перенесенную
				СтрокаРасходовПорожнейСделки.СтрокаРасходовВПеренесеннойСделке = нСтрокаРасходовГруженойСделки.ГУИД;
				СтрокаРасходовПорожнейСделки.ПеренесеннаяСделкаПриемник = ВыборкаГруженыхСделок.ГруженаяСделка;
				//Евросиб - АСуслов 09.12.2022 16:58:03 #
				//(
				СтрокаРасходовПорожнейСделки.СтрокаРасходовВСделкеПриемник = нСтрокаРасходовГруженойСделки.ГУИД;
				СтрокаРасходовПорожнейСделки.ПеренесеннаяСделка = ВыборкаГруженыхСделок.ГруженаяСделка;
				//)
				//Евросиб - АСуслов 09.12.2022 16:58:03 #
				СтрокаРасходовПорожнейСделки.УслугаОтключена = Истина;      
				СтрокаРасходовПорожнейСделки.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ОбъединениеСделок;
				//Евросиб - АСуслов 15.03.2022 18:13:52 #47167
				//(
				//Евросиб - АСуслов 17.02.2023 16:19:09 #делаем в очереди
				//(
				//СтрокаРасходовПорожнейСделки.УчДокумент = Неопределено;
				//)
				//Евросиб - АСуслов 17.02.2023 16:19:11 #
				//)
				//Евросиб - АСуслов 15.03.2022 18:14:05 #47167
				
				//перенесем накладные из порожней в груженую
				СтрокаСоставаПоездаПорожнейСделки = ПорожняяСделка.СвязьУчетныхЕдиниц.Найти(СтрокаРасходовПорожнейСделки.СтрокаСвязьУчетныхЕдиниц, "ГУИД");
				//Евросиб - АСуслов 12.07.2022 13:46:41 #
				//(
				СтрокаСоставаПоездаПорожнейСделки.ОтключитьРасходы = Истина;
				//)
				//Евросиб - АСуслов 12.07.2022 13:46:42 #
				//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, начало
				ВключитьОтключитьРасходыВСвязанныхСтрокахСоставаПоезда(ПорожняяСделка, СтрокаСоставаПоездаПорожнейСделки);
				//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, конец
				Если СтрокаСоставаПоездаПорожнейСделки <> Неопределено Тогда                                                 
					//Евросиб - АСуслов 15.03.2022 19:07:53 #
					//(
					//СтрокаСоставаПоездаГруженойСделки = ГруженаяСделка.СвязьУчетныхЕдиниц.Найти(СтрокаРасходовПорожнейСделки.СтрокаСвязьУчетныхЕдиниц, "ГУИД");
					СтрокаСоставаПоездаГруженойСделки = ГруженаяСделка.СвязьУчетныхЕдиниц.Найти(нСтрокаРасходовГруженойСделки.СтрокаСвязьУчетныхЕдиниц, "ГУИД");
					//)
					//Евросиб - АСуслов 15.03.2022 19:07:56 #
					Если СтрокаСоставаПоездаГруженойСделки <> Неопределено Тогда
						СтрокаСоставаПоездаГруженойСделки.НомерПорожнейВагоннойЖДН = СтрокаСоставаПоездаПорожнейСделки.НомерПорожнейЖДНКТК;
						СтрокаСоставаПоездаГруженойСделки.ПорожняяВагоннаяЖДН = СтрокаСоставаПоездаПорожнейСделки.ПорожняяЖДНКТК;
						
						СтрокаСоставаПоездаГруженойСделки.НомерВагоннойЖДН = СтрокаСоставаПоездаПорожнейСделки.НомерПорожнейВагоннойЖДН;
						СтрокаСоставаПоездаГруженойСделки.ВагоннаяЖДН = СтрокаСоставаПоездаПорожнейСделки.ПорожняяВагоннаяЖДН; 
						//ЖДН из поля "ЖДНПерестановкиДоГружКТК" порожней сделки заполнять в поле "ЖДНПерестановкиДоПорКТК" в груженой сделке.
						СтрокаСоставаПоездаГруженойСделки.ЖДНПерестановкиДоПорКТК = СтрокаСоставаПоездаПорожнейСделки.ЖДНПерестановкиДоГружКТК;
					КонецЕсли;
				КонецЕсли;
				// Евросиб US 114964 TA 114988 Рыбьяков К.А. 06.08.2025 ((
				Отбор = Новый Структура;
				Отбор.Вставить("СтрокаСвязьУчетныхЕдиниц", нСтрокаРасходовГруженойСделки.СтрокаСвязьУчетныхЕдиниц);
				Отбор.Вставить("Услуга", нСтрокаРасходовГруженойСделки.Услуга);
				Отбор.Вставить("Контейнер", нСтрокаРасходовГруженойСделки.Контейнер);
				Отбор.Вставить("ТранспортныйДокумент", нСтрокаРасходовГруженойСделки.ТранспортныйДокумент);
				Отбор.Вставить("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН);
				Отбор.Вставить("УслугаОтключена", Ложь);
				НайденныеСтроки = ГруженаяСделка.Расходы.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 1 Тогда
					Если Не ЗначениеЗаполнено(нСтрокаРасходовГруженойСделки.УчДокумент) Тогда
					//Если Не ЗначениеЗаполнено(НайденныеСтроки[0].УчДокумент) Тогда
						нСтрокаРасходовГруженойСделки.УслугаОтключена = Истина;
						нСтрокаРасходовГруженойСделки.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ДублированиеРасходовНаПодсыл;
					Иначе
						Если ЗначениеЗаполнено(НайденныеСтроки[0].УчДокумент) Тогда
							нСтрокаРасходовГруженойСделки.УслугаОтключена = Истина;
							нСтрокаРасходовГруженойСделки.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ДублированиеРасходовНаПодсыл;
						Иначе
							НайденныеСтроки[0].УслугаОтключена = Истина;
							НайденныеСтроки[0].ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ДублированиеРасходовНаПодсыл;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				// Евросиб Рыбьяков К.А. 06.08.2025 ))
			КонецЦикла; 
			МассивЗаписываемыхПорожнихСделок.Добавить(ПорожняяСделка); 
			СписокПорожнихСделокСтрокой = СписокПорожнихСделокСтрокой + ПорожняяСделка.Ссылка + Символы.ПС;
		КонецЦикла;
		//Евросиб - АСуслов 17.02.2023 16:19:49 #
		//( делаем в очереди
		//ТаблицаПТУ.Сортировать("ПТУ");
		//ТаблицаСписокПТУ = ТаблицаПТУ.Скопировать(,"ПТУ");
		//ТаблицаСписокПТУ.Свернуть("ПТУ");
		//МассивЗаписываемыхАкцептов = Новый Массив;
		//Для каждого СтрокаСпискаПТУ Из ТаблицаСписокПТУ Цикл
		//	обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(СтрокаСпискаПТУ.ПТУ, Ложь);
		//	//Отказ = Ложь;
		//	//обАкцепт.ПроверитьРасхождениеСуммСтрокАкцептаСоСтрокамиПТУ(Отказ);
		//	//Если Отказ Тогда
		//	//	//обАкцепт.ЗаполнитьУслуги();
		//	//	//обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		//	//	//ПретензииИНеакцептыСервер.РазнестиПТУ(обАкцепт.Поступление);
		//	//	//обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(обАкцепт.Поступление, Ложь);
		//	//	ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Ошибка,,обАкцепт.Поступление,"Расхождение суммы акцепта с ПТУ");
		//	//	Прервать;
		//	//КонецЕсли; 
		//	обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
		//	СтрокиДляОбработки = ТаблицаПТУ.НайтиСтроки(Новый Структура("ПТУ", СтрокаСпискаПТУ.ПТУ));
		//	Для каждого СтрокаДляОбработки Из СтрокиДляОбработки Цикл
		//		СтрокиДляИзменения = обАкцепт.Услуги.НайтиСтроки(Новый Структура("Сделка, ИдентификаторСтрокиРасходовВСделке", СтрокаДляОбработки.СделкаСтарая, СтрокаДляОбработки.ИдентификаторСтрокиРасходовСделкиСтарая));
		//		Для каждого СтрокаДляИзменения Из СтрокиДляИзменения Цикл
		//			СтрокаДляИзменения.Сделка = СтрокаДляОбработки.СделкаНовая;
		//			СтрокаДляИзменения.ИдентификаторСтрокиРасходовВСделке = СтрокаДляОбработки.ИдентификаторСтрокиРасходовСделкиНовая;
		//		КонецЦикла; 
		//	КонецЦикла;
		//	МассивЗаписываемыхАкцептов.Добавить(обАкцепт);
		//КонецЦикла;  
		//ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, начало		
		//)
		//Евросиб - АСуслов 17.02.2023 16:19:50 #
		ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,Выборка.ГруженаяСделка,"Начало записи документа");
        //ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, конец
		Попытка
			НачатьТранзакцию();
			Документы.Сделка.ПересчитатьПериоды(ГруженаяСделка);  
			ГруженаяСделка.УстановитьКомментарийВерсииИсторииДанных("Объединение сделок (ОбъединитьПорожниеИГруженыеСделки)");
			ГруженаяСделка.Записать(РежимЗаписиДокумента.Проведение);
			ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,ГруженаяСделка.Ссылка,"Успешно записана");
			//Евросиб - АСуслов 17.02.2023 16:20:23 #
			//( делаем в очереди
			//Для каждого ЗаписываемыйАкцепт Из МассивЗаписываемыхАкцептов Цикл 
			//	ПериодАкцепта = Мин(ЗаписываемыйАкцепт.ПериодВО, ЗаписываемыйАкцепт.ПериодБУ);
			//	ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(ЗаписываемыйАкцепт, Истина, ПериодАкцепта);
			//	Если ЗначениеЗаполнено(ЗаписываемыйАкцепт.Ссылка) Тогда
			//		Документы.Акцепт.ЗаполнитьИзмененныеСуммыПТУпоАкцепту(ЗаписываемыйАкцепт.Поступление, ЗаписываемыйАкцепт.Ссылка);
			//	КонецЕсли;            
			//	ЗаписываемыйАкцепт.УстановитьКомментарийВерсииИсторииДанных("Объединение сделок (ОбъединитьПорожниеИГруженыеСделки)");
			//	ЗаписываемыйАкцепт.Записать(РежимЗаписиДокумента.Проведение);
			//	ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,ЗаписываемыйАкцепт.Ссылка,"Успешно записан");
			//КонецЦикла; 
			//)
			//Евросиб - АСуслов 17.02.2023 16:20:24 #
			Для каждого ЗаписываемаяПорожняяСделка Из МассивЗаписываемыхПорожнихСделок Цикл 
				ЗаписываемаяПорожняяСделка.УстановитьКомментарийВерсииИсторииДанных("Объединение сделок (ОбъединитьПорожниеИГруженыеСделки)");
				ЗаписываемаяПорожняяСделка.Записать(РежимЗаписиДокумента.Проведение);
				//ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,ЗаписываемаяПорожняяСделка.Ссылка,"Успешно записана");    
				//ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, начало
				ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Информация,,ЗаписываемаяПорожняяСделка.Ссылка,"Успешно записана (Порожняя)");  
				//ДИТ, Беляев СЮ, Ticket#0277375, 05-07-2022, конец
			КонецЦикла; 	
			ЗафиксироватьТранзакцию();
			СтруктураРезультата = Новый Структура; 
			СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
			СтруктураРезультата.Вставить("РезультатОбъединения", "Сделки объеденены");
			СтруктураРезультата.Вставить("СписокСделок", СписокПорожнихСделокСтрокой);
			ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		Исключение
			ОО = ОписаниеОшибки();
			ОтменитьТранзакцию();                 
			ЗаписьЖурналаРегистрации("Объединение сделок",УровеньЖурналаРегистрации.Ошибка,,,ОО);
			СтруктураРезультата = Новый Структура;
			СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
			СтруктураРезультата.Вставить("РезультатОбъединения", ОО);
			ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОчиститьУчетныеДокументыПоБитымСсылкамНаАкцептыВСделке(ОбъектСделка) Экспорт
                
                Запрос = Новый Запрос;
                Запрос.Текст = 
                "ВЫБРАТЬ
                |             АкцептУслуги.Ссылка.Поступление КАК Поступление,
                |             АкцептУслуги.Ссылка КАК Акцепт,
                |             АкцептУслуги.Сделка КАК Сделка,
                |             АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке
                |ПОМЕСТИТЬ ВТАктуальныеАкцепты
                |ИЗ
                |             Документ.Акцепт.Услуги КАК АкцептУслуги
                |ГДЕ
                |             НЕ АкцептУслуги.Ссылка В
                |                                                             (ВЫБРАТЬ
                |                                                                            Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
                |                                                             ИЗ
                |                                                                            Документ.Акцепт КАК Акцепт
                |                                                             ГДЕ
                |                                                                            Акцепт.Проведен)
                |             И АкцептУслуги.Ссылка.Проведен
                |             И АкцептУслуги.Ссылка.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
                |             И АкцептУслуги.Сделка = &Сделка
                |
                |ИНДЕКСИРОВАТЬ ПО
                |             Сделка,
                |             ИдентификаторСтрокиРасходовВСделке
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |             &Сделка КАК Ссылка,
                |             СделкаРасходы.ГУИД КАК ГУИД,
                |             СделкаРасходы.УчДокумент КАК УчДокумент
                |ПОМЕСТИТЬ ВТ_Расходы
                |ИЗ
                |             &Расходы КАК СделкаРасходы
                |ГДЕ
                |             НЕ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |             ВТ_Расходы.Ссылка КАК Ссылка,
                |             ВТ_Расходы.ГУИД КАК ГУИД,
                |             ВТ_Расходы.УчДокумент КАК УчДокумент
                |ИЗ
                |             ВТ_Расходы КАК ВТ_Расходы
                |                             ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеАкцепты КАК ВТАктуальныеАкцепты
                |                             ПО ВТ_Расходы.Ссылка = ВТАктуальныеАкцепты.Сделка
                |                                             И ВТ_Расходы.ГУИД = ВТАктуальныеАкцепты.ИдентификаторСтрокиРасходовВСделке
                |ГДЕ
                |             ВТАктуальныеАкцепты.ИдентификаторСтрокиРасходовВСделке ЕСТЬ NULL";                       
                ТЗРасходы = ОбъектСделка.Расходы.Выгрузить();
                Запрос.УстановитьПараметр("Расходы", ТЗРасходы);
                Запрос.УстановитьПараметр("Сделка", ОбъектСделка.Ссылка);
                РезультатЗапроса = Запрос.Выполнить();
                Выборка = РезультатЗапроса.Выбрать();
                Пока Выборка.Следующий() Цикл
                               
                               СтрокаРасход = ТЗРасходы.Найти(Выборка.ГУИД, "ГУИД");
                               СтрокаРасход.УчДокумент = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
                               
                КонецЦикла;
                ОбъектСделка.Расходы.Загрузить(ТЗРасходы);
                               
КонецПроцедуры

// Евросиб Фролов, 15.04.2022 Task №48577 (добавил Экспорт)
Функция ПолучитьСтруктуруТаблицыПТУ() Экспорт
	
	ТаблицаПТУ = Новый ТаблицаЗначений;
	ТаблицаПТУ.Колонки.Добавить("ПТУ", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
	ТаблицаПТУ.Колонки.Добавить("СделкаНовая", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТаблицаПТУ.Колонки.Добавить("СделкаСтарая", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
 	ТаблицаПТУ.Колонки.Добавить("ИдентификаторСтрокиРасходовСделкиНовая", Метаданные.ОпределяемыеТипы.ГУИД.Тип);
 	ТаблицаПТУ.Колонки.Добавить("ИдентификаторСтрокиРасходовСделкиСтарая", Метаданные.ОпределяемыеТипы.ГУИД.Тип);
	Возврат ТаблицаПТУ;
	
КонецФункции

Функция ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ОбъектСделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//Евросиб Каблов 12.12.2023 ( Ticket#0329972
	//"ВЫБРАТЬ
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	&Расходы КАК СделкаРасходы
	//|ГДЕ
	//|	НЕ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	//|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц В(&СтрокаСвязьУчетныхЕдиниц)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	//|ИЗ
	//|	ВТ КАК ВТ";
	"ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.УчДокумент КАК УчДокумент
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц В(&СтрокаСвязьУчетныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	НЕ ВТ.УчДокумент.Ссылка ЕСТЬ NULL";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	//Евросиб Каблов 12.12.2023 )
	
	Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СтрокаСвязьУчетныхЕдиниц", МассивИдентификаторовДляПроверкиПривязанныхПТУ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц");
	
КонецФункции

Процедура ЗаполнитьУчетныеДокументыВДоходах(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	//Евросиб Каблов 22.05.2025 ( #110248	
	|	СделкаДоходы.ПериодВО КАК ПериодВО,
	//Евросиб Каблов 22.05.2025 )
	|	СделкаДоходы.УчДокумент КАК УчДокумент
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	//Евросиб Каблов 22.05.2025 ( #110248
	|	РеализацияТоваровУслугУслуги.Ссылка.ПериодВО КАК ПериодВО,
	//Евросиб Каблов 22.05.2025 )
	//Евросиб СубботинВ #122887 13.11.2025 Начало 
	|	РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов КАК КурсВалюты,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДатаКурса КАК ДатаКурсаВалюты,
	//Евросиб СубботинВ #122887 13.11.2025 Конец
	|	РеализацияТоваровУслугУслуги.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугУслуги
	//Евросиб Каблов 15.12.2022 ( 62714
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	//|		ПО РеализацияТоваровУслугУслуги.Ссылка = КорректировкаРеализации.ДокументРеализации
	//|			И (КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	//|			И (КорректировкаРеализации.Проведен)			
	//Евросиб - АСуслов 21.02.2024 13:47:00 #81376
	//(
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	//|		ПО РеализацияТоваровУслугУслуги.Ссылка = ИсторияКорректировокРеализаций.КорректируемыйДокумент
	//|			И (ИсторияКорректировокРеализаций.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	//Евросиб Каблов 15.12.2022 )
	//)
	//Евросиб - АСуслов 21.02.2024 13:47:14 #81376
	|ГДЕ
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 28.07.2025 ((
	//|	РеализацияТоваровУслугУслуги.Сделка = &Сделка
	|	РеализацияТоваровУслугУслуги.КлючАналитикиСоставаПоезда.Сделка = &Сделка
	// Евросиб Рыбьяков К.А. 28.07.2025 ))
	|	И РеализацияТоваровУслугУслуги.СтрокаДоходовСделки В
	|			(ВЫБРАТЬ
	|				т.ГУИД
	|			ИЗ
	|				ВТ_Доходы КАК т)
	//|	И НЕ РеализацияТоваровУслугУслуги.Ссылка.ПометкаУдаления
	|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
	//Евросиб Каблов 15.12.2022 ( 62714
	//|	И КорректировкаРеализации.Ссылка ЕСТЬ NULL
	//Евросиб - АСуслов 21.02.2024 13:47:36 #81376
	//(
//	|	И ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
	//Евросиб Каблов 15.12.2022 )
	//)
	//Евросиб - АСуслов 21.02.2024 13:47:38 #81376
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Ссылка,
	//Евросиб Каблов 22.05.2025 ( #110248
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ПериодВО КАК ПериодВО,
	//Евросиб Каблов 22.05.2025 )
	//Евросиб СубботинВ #122887 13.11.2025 Начало 
	|	ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов КАК КурсВалюты,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДатаКурса КАК ДатаКурсаВалюты,
	//Евросиб СубботинВ #122887 13.11.2025 Конец
	|	ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахТовары
	//Евросиб Каблов 15.12.2022 ( 62714
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	//|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = КорректировкаРеализации.ДокументРеализации
	//|			И (КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	//|			И (КорректировкаРеализации.Проведен)
	//Евросиб - АСуслов 21.02.2024 13:47:52 #81376
	//(
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	//|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ИсторияКорректировокРеализаций.КорректируемыйДокумент
	//|			И (ИсторияКорректировокРеализаций.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	//Евросиб Каблов 15.12.2022 )
	//)
	//Евросиб - АСуслов 21.02.2024 13:47:56 #81376
	|ГДЕ
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 28.07.2025 ((
	//|	ОтчетКомитентуОПродажахТовары.Сделка = &Сделка
	|	ОтчетКомитентуОПродажахТовары.КлючАналитикиСоставаПоезда.Сделка = &Сделка
	// Евросиб Рыбьяков К.А. 28.07.2025 ))
	|	И ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки В
	|			(ВЫБРАТЬ
	|				т.ГУИД
	|			ИЗ
	|				ВТ_Доходы КАК т)
	//|	И ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = Истина
	//Евросиб Каблов 15.12.2022 ( 62714
	//	И КорректировкаРеализации.Ссылка ЕСТЬ NULL
	//Евросиб - АСуслов 21.02.2024 13:48:07 #81376
	//(
//	|	И ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
	//Евросиб Каблов 15.12.2022 )
	//)
	//Евросиб - АСуслов 21.02.2024 13:48:09 #81376
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД,	
	|	ВЫБОР КОГДА ВТ_Доходы.УчДокумент = Неопределено ИЛИ ВТ_Доходы.УчДокумент.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ВТ_Доходы.УчДокумент.ПометкаУдаления КОНЕЦ КАК УчДокументУдален,
	//Евросиб Каблов 22.05.2025 ( #110248	
	|	ВТ_Документы.ПериодВО КАК ПериодВО,
	//Евросиб Каблов 22.05.2025 )
	//Евросиб СубботинВ #122887 13.11.2025 Начало 
	|	ВТ_Документы.КурсВалюты КАК КурсВалюты,
	|	ВТ_Документы.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	//Евросиб СубботинВ #122887 13.11.2025 Конец
	|	ВТ_Документы.Ссылка КАК УчДокумент
	|ИЗ
	|	ВТ_Доходы КАК ВТ_Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	|		ПО ВТ_Доходы.ГУИД = ВТ_Документы.СтрокаДоходовСделки
	|ГДЕ
	//|	ВТ_Доходы.УчДокумент = НЕОПРЕДЕЛЕНО
	//|		ИЛИ ВТ_Доходы.УчДокумент.Ссылка ЕСТЬ NULL
	//|		ИЛИ НЕ ВТ_Доходы.УчДокумент.Проведен
	//|	ИЛИ НЕ ВТ_Документы.Ссылка ЕСТЬ NULL";
	|	ЕСТЬNULL(ВТ_Доходы.УчДокумент.Ссылка, НЕОПРЕДЕЛЕНО) <> ЕСТЬNULL(ВТ_Документы.Ссылка, НЕОПРЕДЕЛЕНО)
	//Евросиб Каблов 22.05.2025 ( #110248	
	|	ИЛИ НАЧАЛОПЕРИОДА(ВТ_Доходы.ПериодВО, МЕСЯЦ) <> ВТ_Документы.ПериодВО";
	//Евросиб Каблов 22.05.2025 )

	ТЧДоходы = Объект.Доходы.Выгрузить();
	Запрос.УстановитьПараметр("Доходы", ТЧДоходы);
	Запрос.УстановитьПараметр("Сделка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();      
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДоходы = ТЧДоходы.Найти(Выборка.ГУИД, "ГУИД");
		Если Выборка.УчДокументУдален И Не ЗначениеЗаполнено(Выборка.УчДокумент) Тогда
			СтрокаДоходы.УчДокумент = Неопределено;
		Иначе
			СтрокаДоходы.УчДокумент = Выборка.УчДокумент;
			//Евросиб Каблов 22.05.2025 ( #110248
			СтрокаДоходы.ПериодВО = Выборка.ПериодВО;
			//Евросиб Каблов 22.05.2025 )
			//Евросиб СубботинВ #122887 13.11.2025 Начало 
			СтрокаДоходы.КурсВалюты = Выборка.КурсВалюты;
			СтрокаДоходы.ДатаКурсаВалюты = Выборка.ДатаКурсаВалюты;
			//Евросиб СубботинВ #122887 13.11.2025 Конец			
		КонецЕсли;                                       
	КонецЦикла;
	
	Объект.Доходы.Загрузить(ТЧДоходы);
	
КонецПроцедуры


Процедура ОчиститьДанныеВВспомогательныхТаблицахНаСервере(Объект, МассивИдентификаторовУдаляемыхСтрок, ДоходыРасходы) Экспорт
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	// Перенес из формы документа
	Для каждого ТекС Из МассивИдентификаторовУдаляемыхСтрок Цикл
		Если ТекС = "" Тогда
			Продолжить;
		КонецЕсли;
		НайдСтроки = Объект.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура(ДоходыРасходы, ТекС));
		Для каждого НайдСтр из НайдСтроки Цикл 
			//Евросиб - АСуслов 07.01.2022 19:22:12 #
			//(
			//НайдСтр.Расходы = "";
			НайдСтр[ДоходыРасходы] = "";
			//)
			//Евросиб - АСуслов 07.01.2022 19:22:12 #
		КонецЦикла;
	КонецЦикла;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаДоходы.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_Доходы
		|ИЗ
		|	&СделкаДоходы КАК СделкаДоходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходы.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	&СделкаРасходы КАК СделкаРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаДоходыВагоны.ГУИД КАК ГУИД,
		|	СделкаДоходыВагоны.Вагон КАК Вагон
		|ПОМЕСТИТЬ ВТ_ДоходыВагоны
		|ИЗ
		|	&СделкаДоходыВагоны КАК СделкаДоходыВагоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаДоходыКТК.ГУИД КАК ГУИД,
		|	СделкаДоходыКТК.КТК КАК КТК
		|ПОМЕСТИТЬ ВТ_ДоходыКТК
		|ИЗ
		|	&СделкаДоходыКТК КАК СделкаДоходыКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаДоходыТД.ГУИД КАК ГУИД,
		|	СделкаДоходыТД.ТД КАК ТД
		|ПОМЕСТИТЬ ВТ_ДоходыТД
		|ИЗ
		|	&СделкаДоходыТД КАК СделкаДоходыТД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоходыКТК.ГУИД КАК ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыКТК.КТК,1,1000) КАК КТК
		|ИЗ
		|	ВТ_ДоходыКТК КАК ВТ_ДоходыКТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
		|		ПО ВТ_ДоходыКТК.ГУИД = ВТ_Доходы.ГУИД
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоходыКТК.ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыКТК.КТК,1,1000)
		|ИЗ
		|	ВТ_ДоходыКТК КАК ВТ_ДоходыКТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
		|		ПО ВТ_ДоходыКТК.ГУИД = ВТ_Расходы.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоходыВагоны.ГУИД КАК ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыВагоны.Вагон,1,1000) КАК Вагон
		|ИЗ
		|	ВТ_ДоходыВагоны КАК ВТ_ДоходыВагоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
		|		ПО ВТ_ДоходыВагоны.ГУИД = ВТ_Доходы.ГУИД
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоходыВагоны.ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыВагоны.Вагон,1,1000)
		|ИЗ
		|	ВТ_ДоходыВагоны КАК ВТ_ДоходыВагоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
		|		ПО ВТ_ДоходыВагоны.ГУИД = ВТ_Расходы.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоходыТД.ГУИД КАК ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыТД.ТД,1,1000) КАК ТД
		|ИЗ
		|	ВТ_ДоходыТД КАК ВТ_ДоходыТД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
		|		ПО ВТ_ДоходыТД.ГУИД = ВТ_Доходы.ГУИД
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоходыТД.ГУИД,
		|	ПОДСТРОКА(ВТ_ДоходыТД.ТД,1,1000)
		|ИЗ
		|	ВТ_ДоходыТД КАК ВТ_ДоходыТД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
		|		ПО ВТ_ДоходыТД.ГУИД = ВТ_Расходы.ГУИД";
		Запрос.УстановитьПараметр("СделкаДоходы", Объект.Доходы.Выгрузить());
		Запрос.УстановитьПараметр("СделкаРасходы", Объект.Расходы.Выгрузить());
		Запрос.УстановитьПараметр("СделкаДоходыКТК", Объект.ДоходыКТК.Выгрузить());
		Запрос.УстановитьПараметр("СделкаДоходыВагоны", Объект.ДоходыВагоны.Выгрузить());
		Запрос.УстановитьПараметр("СделкаДоходыТД", Объект.ДоходыТД.Выгрузить());
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Объект.ДоходыКТК.Загрузить(МассивРезультатов[5].Выгрузить());
		Объект.ДоходыВагоны.Загрузить(МассивРезультатов[6].Выгрузить());
		Объект.ДоходыТД.Загрузить(МассивРезультатов[7].Выгрузить());
		//
		//
		//НайдСтроки = Объект.ДоходыВагоны.НайтиСтроки(Новый Структура("ГУИД", ТекС));
		//Для каждого НайдСтр из НайдСтроки Цикл Объект.ДоходыВагоны.Удалить(НайдСтр); КонецЦикла;
		//
		//НайдСтроки = Объект.ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", ТекС));
		//Для каждого НайдСтр из НайдСтроки Цикл Объект.ДоходыКТК.Удалить(НайдСтр); КонецЦикла;
		//
		//НайдСтроки = Объект.ДоходыТД.НайтиСтроки(Новый Структура("ГУИД", ТекС));
		//Для каждого НайдСтр из НайдСтроки Цикл Объект.ДоходыТД.Удалить(НайдСтр); КонецЦикла;
	//КонецЦикла;
	// Евросиб Фролов)
КонецПроцедуры 


//Функция ПолучитьДатуОказанияУслугиПоКоносаменту(Коносамент, ПараметрыФФД)
//	Если НЕ ПараметрыФФД.ИспользоватьРасширенныеПараметры 
//		И НЕ ПараметрыФФД.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
//		Возврат Дата(1,1,1);
//	КонецЕсли;              
//	Если ПараметрыФФД.ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки Тогда
//		ПараметрДатаРеализации = ПараметрыФФД.ДатаРеализацииФрахт;
//	Иначе
//		ПараметрДатаРеализации = ПараметрыФФД.ДатаРеализации;
//	КонецЕсли; 
//	Если Параметр Тогда
//		
//	КонецЕсли;
//КонецФункции

Процедура ИсправитьСвязиПоТЭУ(ОбъектСделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.НомерСтроки КАК НомерСтроки,
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК УслугаВнеСтавки,
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаСвязьДоходовИРасходов.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|			И (СделкаСвязьДоходовИРасходов.Услуга = &УслугаТЭУ)
	|ГДЕ
	|	СделкаДоходы.Ссылка.Проведен
	|	И СделкаДоходы.УслугаВнеСтавки = ЛОЖЬ
	|	И СделкаДоходы.Услуга = &УслугаТЭУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА,
	|	СделкаДоходы.ГУИД,
	|	СделкаСвязьДоходовИРасходов.НомерСтроки
	|ИЗ
	|	ВТ_Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ПО СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|			И (СделкаСвязьДоходовИРасходов.Услуга = &ПустаяУслуга)
	|ГДЕ
	|	СделкаДоходы.УслугаВнеСтавки = ИСТИНА
	|	И СделкаДоходы.Услуга = &УслугаТЭУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Доходы", ОбъектСделка.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", ОбъектСделка.СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("УслугаТЭУ", Справочники.Номенклатура.НайтиПоНаименованию("ТЭУ"));
	Запрос.УстановитьПараметр("ПустаяУслуга", Справочники.Номенклатура.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
		СтрокаДоход = ОбъектСделка.СвязьДоходовИРасходов[Выборка.НомерСтроки-1];		
		СтрокаДоход.Услуга = ?(Выборка.УслугаВнеСтавки, Справочники.Номенклатура.НайтиПоНаименованию("ТЭУ"), Справочники.Номенклатура.ПустаяСсылка());
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 27.01.2022 Task 46219
// Евросиб Фролов, 15.04.2022 Task №48577 (добавил в параметры ДобавленныеСтроки - массив ГУИД строк состава поезда, по которым нужно заполнить сведения)
Процедура ЗаполнитьГрузыВТаблицеСвязьУчетныхЕдиниц(СвязьУчетныхЕдиниц, ДобавленныеСтроки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТранспортныйДокумент.Ссылка КАК ЖДН,
	//|	э_НакладнаяГрузыЖД.КодЕТСНГ КАК КодЕТСНГ,
	//|	э_НакладнаяГрузыЖД.КодГНГ КАК КодГНГ,
	//|	э_НакладнаяГрузыЖД.НаименованиеГруза КАК НаименованиеГруза,
	//|	Грузы.Ссылка КАК Груз,
	////ДИТ Авдеева В.С. 0280397 Начало 25.08.2022
	////|	СУММА(э_НакладнаяГрузыЖД.МассаГруза) / 1000 КАК МассаГрузаКг
	//|	СУММА(э_НакладнаяГрузыЖД.МассаГруза) КАК МассаГрузаКг
	////ДИТ Авдеева В.С. 0280397 Конец 25.08.2022
	//|ИЗ
	//|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
	//|			ПО (ПОДСТРОКА(э_НакладнаяГрузыЖД.КодЕТСНГ, 1, 5) = ПОДСТРОКА(Грузы.ЕТСНГ, 1, 5))
	//|				И (НЕ Грузы.ПометкаУдаления)
	//|		ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_НакладнаяГрузыЖД.Ссылка
	//|ГДЕ
	//|	ТранспортныйДокумент.Ссылка В(&ЖДН)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	э_НакладнаяГрузыЖД.КодГНГ,
	//|	э_НакладнаяГрузыЖД.НаименованиеГруза,
	//|	э_НакладнаяГрузыЖД.КодЕТСНГ,
	//|	ТранспортныйДокумент.Ссылка,
	//|	Грузы.Ссылка";
	
	//ДИТ, Беляев СЮ, Ticket#0342972, 28-02-2024, начало
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК ЖДН,
	|	э_НакладнаяГрузыЖД.КодЕТСНГ КАК КодЕТСНГ,
	|	э_НакладнаяГрузыЖД.КодГНГ КАК КодГНГ,
	|	э_НакладнаяГрузыЖД.НаименованиеГруза КАК НаименованиеГруза,
	|	СУММА(э_НакладнаяГрузыЖД.МассаГруза) КАК МассаГрузаКг
	|ПОМЕСТИТЬ ВТГрузыНакладных
	|ИЗ
	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	|		ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_НакладнаяГрузыЖД.Ссылка
	|ГДЕ
	|	ТранспортныйДокумент.Ссылка В(&ЖДН)
	|
	|СГРУППИРОВАТЬ ПО
	|	э_НакладнаяГрузыЖД.КодГНГ,
	|	э_НакладнаяГрузыЖД.НаименованиеГруза,
	|	э_НакладнаяГрузыЖД.КодЕТСНГ,
	|	ТранспортныйДокумент.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГрузыНакладных.КодЕТСНГ КАК КодЕТСНГ,
	|	МАКСИМУМ(Грузы.Ссылка) КАК ГрузСсылка
	|ПОМЕСТИТЬ ВТГрузыИзСправочника
	|ИЗ
	|	ВТГрузыНакладных КАК ВТГрузыНакладных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
	|		ПО (ПОДСТРОКА(ВТГрузыНакладных.КодЕТСНГ, 1, 5) = ПОДСТРОКА(Грузы.ЕТСНГ, 1, 5))
	|			И (НЕ Грузы.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТГрузыНакладных.КодЕТСНГ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГрузыНакладных.ЖДН КАК ЖДН,
	|	ВТГрузыНакладных.КодЕТСНГ КАК КодЕТСНГ,
	|	ВТГрузыНакладных.КодГНГ КАК КодГНГ,
	|	ВТГрузыНакладных.НаименованиеГруза КАК НаименованиеГруза,
	|	ВТГрузыНакладных.МассаГрузаКг КАК МассаГрузаКг,
	|	ВТГрузыИзСправочника.ГрузСсылка КАК Груз
	|ИЗ
	|	ВТГрузыНакладных КАК ВТГрузыНакладных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрузыИзСправочника КАК ВТГрузыИзСправочника
	|		ПО ВТГрузыНакладных.КодЕТСНГ = ВТГрузыИзСправочника.КодЕТСНГ";
	//ДИТ, Беляев СЮ, Ticket#0342972, 28-02-2024, конец
	
	ТаблицаЖДН = СвязьУчетныхЕдиниц.Выгрузить(, "ЖДН");
	ТаблицаЖДН.Свернуть("ЖДН");
	Запрос.УстановитьПараметр("ЖДН", ТаблицаЖДН.ВыгрузитьКолонку("ЖДН"));	
	ТаблицаГрузовЖДН = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
		
		Если (НЕ ЗначениеЗаполнено(Стр.Груз) Или Не ЗначениеЗаполнено(Стр.ВесГрузаНетто)) И ЗначениеЗаполнено(Стр.ЖДН) Тогда
			
			// Евросиб Фролов (15.04.2022 Task №48577
			Если ДобавленныеСтроки <> Неопределено Тогда
				Если ДобавленныеСтроки.Найти(Стр.ГУИД) = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			// Евросиб Фролов)
			
			ГрузыПоЖДН = ТаблицаГрузовЖДН.НайтиСтроки(Новый Структура("ЖДН", Стр.ЖДН));
			КоличествоСтрокГрузов = ГрузыПоЖДН.Количество();
			
			Если КоличествоСтрокГрузов = 1 Тогда
				
				ГрузПоЖДН = ГрузыПоЖДН[0];
				
				Если Не ЗначениеЗаполнено(Стр.Груз) Тогда
					Если ЗначениеЗаполнено(ГрузПоЖДН.Груз) Тогда
						Стр.Груз = ГрузПоЖДН.Груз;
					Иначе
						Стр.Груз = Справочники.Грузы.НайтиСоздатьГруз(ГрузПоЖДН.НаименованиеГруза, ГрузПоЖДН.КодЕТСНГ, ГрузПоЖДН.КодГНГ);
					КонецЕсли;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр.ВесГрузаНетто) Тогда
					Стр.ВесГрузаНетто = ГрузПоЖДН.МассаГрузаКг;
				КонецЕсли;
				
			ИначеЕсли КоличествоСтрокГрузов > 1 Тогда
				
				Если Не ЗначениеЗаполнено(Стр.Груз) Тогда
					Стр.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", "693231");
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр.ВесГрузаНетто) Тогда
					
					ВесГрузаПоЖДН = 0;
					Для каждого ГрузПоЖДН Из ГрузыПоЖДН Цикл					
						ВесГрузаПоЖДН = ВесГрузаПоЖДН + ГрузПоЖДН.МассаГрузаКг;					
					КонецЦикла;
					
					Стр.ВесГрузаНетто = ВесГрузаПоЖДН;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Груженый = Стр.ВесГрузаНетто > 0;
		Если Груженый <> Стр.Груженый Тогда
			Стр.Груженый = Груженый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Евросиб Фролов (24.03.2022 US №40767, Task №40768
Функция ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторов, ОбъектСделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ втРасходы
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ПеренесеннаяСделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И (СделкаРасходы.СтрокаРасходовВПеренесеннойСделке <> """" 
	//Евросиб - АСуслов 15.12.2022 16:49:29 #62448
	//(
	|  ИЛИ СделкаРасходы.СтрокаРасходовВСделкеИсточник <> """")
	//)
	//Евросиб - АСуслов 15.12.2022 16:49:31 #62448
	|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц В(&СтрокаСвязьУчетныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	втРасходы КАК втРасходы";
	
	Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СтрокаСвязьУчетныхЕдиниц", МассивИдентификаторов);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтрокаСвязьУчетныхЕдиниц");

КонецФункции	
// Евросиб Фролов)

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
Функция РезультатЗапросаОпределенияОтветственныхЗаУчет(Объект, ДобавленныеСтроки = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	ТЧСвязьУчетныхЕдиниц.Заявка КАК Заявка,
		|	ТЧСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	ТЧСвязьУчетныхЕдиниц.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК ТЧСвязьУчетныхЕдиниц
		|ГДЕ
		|	1 = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
		|	ДоговорыКонтрагентовОтветственные.Ответственный КАК ДоговорОтветственныйЗаУчет,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК ДоговорОтветственныйЗаУчетНСК
		|ПОМЕСТИТЬ ВТ_Ответственные
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
		|ГДЕ
		|	ДоговорыКонтрагентовОтветственные.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
		|			ИЗ
		|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
		|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
		|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовОтветственные.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
		|	ДоговорыКонтрагентовОтветственные.Ответственный
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
		|ГДЕ
		|	ДоговорыКонтрагентовОтветственные.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
		|			ИЗ
		|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
		|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск)
		|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Ответственные.Договор КАК Договор,
		|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчет) КАК ДоговорОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчетНСК) КАК ДоговорОтветственныйЗаУчетНСК
		|ПОМЕСТИТЬ ВТ_ОтветственныеПолноеСоединение
		|ИЗ
		|	ВТ_Ответственные КАК ВТ_Ответственные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Ответственные.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчет КАК ДоговорОтветственныйЗаУчет,
		|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчетНСК КАК ДоговорОтветственныйЗаУчетНСК,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТСвязьУчетныхЕдиниц.Заявка.ЦФО, ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
		|			ТОГДА ВТСвязьУчетныхЕдиниц.Заявка.ЦФО
		|		ИНАЧЕ &ЦФОСделки
		|	КОНЕЦ КАК ЦФОдляОпределенияОтветственного,
		|	ВТСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТОтветственныеИЦФО
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеПолноеСоединение КАК ВТ_ОтветственныеПолноеСоединение
		|		ПО ВТСвязьУчетныхЕдиниц.Договор = ВТ_ОтветственныеПолноеСоединение.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтветственныеИЦФО.ГУИД КАК ГУИД,
		|	ВЫБОР
		|		КОГДА ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
		|				ИЛИ ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
		|			ТОГДА ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчет
		|		ИНАЧЕ ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчетНСК
		|	КОНЕЦ КАК ОтветственныйЗаУчет,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчетВСУЕ,
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор
		|ПОМЕСТИТЬ ВТОтветственныеИГУИДСтрок
		|ИЗ
		|	ВТОтветственныеИЦФО КАК ВТОтветственныеИЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ПО (ВТСвязьУчетныхЕдиниц.ГУИД = ВТОтветственныеИЦФО.ГУИД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОтветственныеИГУИДСтрок.Клиент КАК Клиент
		|ИЗ
		|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
		|ГДЕ
		|	НЕ ВТОтветственныеИГУИДСтрок.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И НЕ ВТОтветственныеИГУИДСтрок.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	И ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
		|ИЗ
		|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
		|ГДЕ
		|	НЕ ВТОтветственныеИГУИДСтрок.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И НЕ ВТОтветственныеИГУИДСтрок.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	И ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтветственныеИГУИДСтрок.ГУИД КАК ГУИД,
		|	ВЫБОР
		|		КОГДА ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|		ИНАЧЕ ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет
		|	КОНЕЦ КАК ОтветственныйЗаУчетПоДоговору,
		|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель КАК НепосредственныйРуководительНеактуальногоОтветственного,
		|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.НепосредственныйРуководитель КАК РуководительНедействительногоОтветственногоЗаУчетВСУЕ
		|ИЗ
		|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
		|ГДЕ
		|	(ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен, ИСТИНА) = ЛОЖЬ
		|			ИЛИ ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель.Недействителен, ИСТИНА) = ЛОЖЬ
		|			ИЛИ ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.Недействителен
		|				И ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.НепосредственныйРуководитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))";
	
	Если ДобавленныеСтроки <> Неопределено Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ТЧСвязьУчетныхЕдиниц.ГУИД В (&ДобавленныеСтроки)");
		Запрос.УстановитьПараметр("ДобавленныеСтроки", ДобавленныеСтроки);	
	КонецЕсли;   
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&ТЧСвязьУчетныхЕдиниц");                       
	Запрос.УстановитьПараметр("ТЧСвязьУчетныхЕдиниц", Объект.СвязьУчетныхЕдиниц.Выгрузить(,"ГУИД,Заявка,Договор,ОтветственныйЗаУчет,Клиент"));
	Запрос.УстановитьПараметр("ЦФОСделки", Объект.ЦФО);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	Возврат РезультатЗапросаПакет;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
Функция ОтсутствующиеИНедействительныеОтветственные( Объект ) Экспорт
	РезультатЗапросаПакет = РезультатЗапросаОпределенияОтветственныхЗаУчет(Объект);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("МассивКлиентовБезОтветственного", РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-3].Выгрузить().ВыгрузитьКолонку("Клиент"));
	СтруктураРезультат.Вставить("МассивОтветственныхНедействительных", РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2].Выгрузить().ВыгрузитьКолонку("ОтветственныйЗаУчет"));
	
	Возврат СтруктураРезультат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

//ДИТ, Беляев СЮ, ТА52417, 31-05-2022, начало (перенес процедуру из Формы Сделки)
//Евросиб - АСуслов 14.04.2023 15:15:04 #67444
//(
Функция ЗаполнитьОтветственногоЗаУчет(Объект, ДобавленныеСтроки = Неопределено) Экспорт
	
#Область СтарыйКод
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТЧСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//	|	ТЧСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	//	|	ТЧСвязьУчетныхЕдиниц.Договор КАК Договор,
	//	//Евросиб - АСуслов 28.04.2023 11:06:01 #69256
	//	//(
	//	|   ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	//	//)
	//	//Евросиб - АСуслов 28.04.2023 11:06:03 #69256
	//	|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
	//	|ИЗ
	//	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК ТЧСвязьУчетныхЕдиниц
	//	|ГДЕ
	//	|	1 = 1
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ 
	//	// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022 
	//	//|ВТСвязьУчетныхЕдиниц.Договор.ОтветственныйЗаУчет КАК ДоговорОтветственныйЗаУчет,
	//	//|ВТСвязьУчетныхЕдиниц.Договор.ОтветственныйЗаУчетНСК КАК ДоговорОтветственныйЗаУчетНСК,
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
	//	//|	ВЫБОР КОГДА ДоговорыКонтрагентовОтветственные.Ответственный.Недействителен ТОГДА Значение(Справочник.Пользователи.ПустаяСсылка) ИНАЧЕ ДоговорыКонтрагентовОтветственные.Ответственный КОНЕЦ КАК ДоговорОтветственныйЗаУчет,
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	//	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК ДоговорОтветственныйЗаУчет,
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
	//	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК ДоговорОтветственныйЗаУчетНСК
	//	|ПОМЕСТИТЬ ВТ_Ответственные
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	//	|ГДЕ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	//	|			ИЗ
	//	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	//	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка,
	//	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
	//	//|	ВЫБОР КОГДА ДоговорыКонтрагентовОтветственные.Ответственный.Недействителен ТОГДА Значение(Справочник.Пользователи.ПустаяСсылка) ИНАЧЕ ДоговорыКонтрагентовОтветственные.Ответственный КОНЕЦ
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	//	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК ДоговорОтветственныйЗаУчет
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	//	|ГДЕ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	//	|			ИЗ
	//	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	//	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск)
	//	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Ответственные.Договор КАК Договор,
	//	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчет) КАК ДоговорОтветственныйЗаУчет,
	//	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчетНСК) КАК ДоговорОтветственныйЗаУчетНСК
	//	|ПОМЕСТИТЬ ВТ_ОтветственныеПолноеСоединение
	//	|ИЗ
	//	|	ВТ_Ответственные КАК ВТ_Ответственные
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Ответственные.Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчет КАК ДоговорОтветственныйЗаУчет,
	//	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчетНСК КАК ДоговорОтветственныйЗаУчетНСК,
	//	// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022
	//	|	ВЫБОР
	//	|		КОГДА ЕСТЬNULL(ВТСвязьУчетныхЕдиниц.Заявка.ЦФО, ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	//	|			ТОГДА ВТСвязьУчетныхЕдиниц.Заявка.ЦФО
	//	|		ИНАЧЕ &ЦФОСделки
	//	|	КОНЕЦ КАК ЦФОдляОпределенияОтветственного,
	//	|	ВТСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//	//Евросиб - АСуслов 28.04.2023 11:04:16 #69256
	//	//( 
	//	|	ВЫБОР КОГДА ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет.Недействителен ТОГДА ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет.НепосредственныйРуководитель ИНАЧЕ Неопределено КОНЕЦ КАК НепосредственныйРуководительНеактуальногоОтветственного
	//	//)
	//	//Евросиб - АСуслов 28.04.2023 11:04:20 #69256
	//	|ПОМЕСТИТЬ ВТОтветственныеИЦФО
	//	|ИЗ
	//	|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц 
	//	// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022 
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеПолноеСоединение КАК ВТ_ОтветственныеПолноеСоединение
	//	|		ПО ВТСвязьУчетныхЕдиниц.Договор = ВТ_ОтветственныеПолноеСоединение.Договор
	//	// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТОтветственныеИЦФО.ГУИД КАК ГУИД,
	//	|	ВЫБОР
	//	|		КОГДА ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//	|				ИЛИ ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	//	|			ТОГДА ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчет
	//	|		ИНАЧЕ ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчетНСК
	//	|	КОНЕЦ КАК ОтветственныйЗаУчет,
	//	//Евросиб - АСуслов 28.04.2023 11:08:44 #69256
	//	//(
	//	|   ВТОтветственныеИЦФО.НепосредственныйРуководительНеактуальногоОтветственного КАК НепосредственныйРуководительНеактуальногоОтветственного
	//	//)
	//	//Евросиб - АСуслов 28.04.2023 11:08:47 #69256
	//	|ПОМЕСТИТЬ ВТОтветственныеИГУИДСтрок
	//	|ИЗ
	//	|	ВТОтветственныеИЦФО КАК ВТОтветственныеИЦФО
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТОтветственныеИГУИДСтрок.ГУИД КАК ГУИД,
	//	//|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет КАК ОтветственныйЗаУчетПоДоговору,
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	//	|	ВЫБОР
	//	|		КОГДА ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//	|		ИНАЧЕ ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет	КОНЕЦ КАК ОтветственныйЗаУчетПоДоговору,
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
	//	//Евросиб - АСуслов 28.04.2023 11:17:24 #69256
	//	//(
	//	//|   ВТОтветственныеИГУИДСтрок.НепосредственныйРуководительНеактуальногоОтветственного КАК НепосредственныйРуководительНеактуальногоОтветственного
	//	//)
	//	//Евросиб - АСуслов 28.04.2023 11:17:26 #69256
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	//	|   ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель КАК НепосредственныйРуководительНеактуальногоОтветственного
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
	//	|ИЗ
	//	|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
	//	|ГДЕ
	//	|	ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен, ИСТИНА) = ЛОЖЬ
	//	//|	ИЛИ ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.НепосредственныйРуководительНеактуальногоОтветственного.Недействителен, ЛОЖЬ) = ЛОЖЬ";
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	//	|	ИЛИ ЕСТЬNULL( ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель.Недействителен, ИСТИНА) = ЛОЖЬ";
	//	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
		
	////ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало	
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТЧСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//	|	ТЧСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	//	|	ТЧСвязьУчетныхЕдиниц.Договор КАК Договор,
	//	|	ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет
	//	|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
	//	|ИЗ
	//	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК ТЧСвязьУчетныхЕдиниц
	//	|ГДЕ
	//	|	1 = 1
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
	//	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК ДоговорОтветственныйЗаУчет,
	//	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК ДоговорОтветственныйЗаУчетНСК
	//	|ПОМЕСТИТЬ ВТ_Ответственные
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	//	|ГДЕ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	//	|			ИЗ
	//	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	//	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка,
	//	|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
	//	|	ДоговорыКонтрагентовОтветственные.Ответственный
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	//	|ГДЕ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТСвязьУчетныхЕдиниц.Договор КАК Договор
	//	|			ИЗ
	//	|				ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц)
	//	|	И ДоговорыКонтрагентовОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск)
	//	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Ответственные.Договор КАК Договор,
	//	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчет) КАК ДоговорОтветственныйЗаУчет,
	//	|	МАКСИМУМ(ВТ_Ответственные.ДоговорОтветственныйЗаУчетНСК) КАК ДоговорОтветственныйЗаУчетНСК
	//	|ПОМЕСТИТЬ ВТ_ОтветственныеПолноеСоединение
	//	|ИЗ
	//	|	ВТ_Ответственные КАК ВТ_Ответственные
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Ответственные.Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчет КАК ДоговорОтветственныйЗаУчет,
	//	|	ВТ_ОтветственныеПолноеСоединение.ДоговорОтветственныйЗаУчетНСК КАК ДоговорОтветственныйЗаУчетНСК,
	//	|	ВЫБОР
	//	|		КОГДА ЕСТЬNULL(ВТСвязьУчетныхЕдиниц.Заявка.ЦФО, ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	//	|			ТОГДА ВТСвязьУчетныхЕдиниц.Заявка.ЦФО
	//	|		ИНАЧЕ &ЦФОСделки
	//	|	КОНЕЦ КАК ЦФОдляОпределенияОтветственного,
	//	|	ВТСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	//	|ПОМЕСТИТЬ ВТОтветственныеИЦФО
	//	|ИЗ
	//	|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеПолноеСоединение КАК ВТ_ОтветственныеПолноеСоединение
	//	|		ПО ВТСвязьУчетныхЕдиниц.Договор = ВТ_ОтветственныеПолноеСоединение.Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТОтветственныеИЦФО.ГУИД КАК ГУИД,
	//	|	ВЫБОР
	//	|		КОГДА ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//	|				ИЛИ ВТОтветственныеИЦФО.ЦФОдляОпределенияОтветственного = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	//	|			ТОГДА ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчет
	//	|		ИНАЧЕ ВТОтветственныеИЦФО.ДоговорОтветственныйЗаУчетНСК
	//	|	КОНЕЦ КАК ОтветственныйЗаУчет,
	//	|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчетВСУЕ
	//	|ПОМЕСТИТЬ ВТОтветственныеИГУИДСтрок
	//	|ИЗ
	//	|	ВТОтветственныеИЦФО КАК ВТОтветственныеИЦФО
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
	//	|		ПО (ВТСвязьУчетныхЕдиниц.ГУИД = ВТОтветственныеИЦФО.ГУИД)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТОтветственныеИГУИДСтрок.ГУИД КАК ГУИД,
	//	|	ВЫБОР
	//	|		КОГДА ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//	|		ИНАЧЕ ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет
	//	|	КОНЕЦ КАК ОтветственныйЗаУчетПоДоговору,
	//	|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель КАК НепосредственныйРуководительНеактуальногоОтветственного,
	//	|	ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.НепосредственныйРуководитель КАК РуководительНедействительногоОтветственногоЗаУчетВСУЕ
	//	|ИЗ
	//	|	ВТОтветственныеИГУИДСтрок КАК ВТОтветственныеИГУИДСтрок
	//	|ГДЕ
	//	|	(ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.Недействителен, ИСТИНА) = ЛОЖЬ
	//	|			ИЛИ ЕСТЬNULL(ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчет.НепосредственныйРуководитель.Недействителен, ИСТИНА) = ЛОЖЬ
	//	|			ИЛИ ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.Недействителен
	//	|				И ВТОтветственныеИГУИДСтрок.ОтветственныйЗаУчетВСУЕ.НепосредственныйРуководитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))";
	////ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
	
	//Если ДобавленныеСтроки <> Неопределено Тогда  
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ТЧСвязьУчетныхЕдиниц.ГУИД В (&ДобавленныеСтроки)");
	//	Запрос.УстановитьПараметр("ДобавленныеСтроки", ДобавленныеСтроки);	
	//КонецЕсли;   
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&ТЧСвязьУчетныхЕдиниц");                       
	////Евросиб - АСуслов 28.04.2023 11:24:17 #69256
	////(
	//Запрос.УстановитьПараметр("ТЧСвязьУчетныхЕдиниц", Объект.СвязьУчетныхЕдиниц.Выгрузить(,"ГУИД,Заявка,Договор,ОтветственныйЗаУчет"));
	////)
	////Евросиб - АСуслов 28.04.2023 11:24:18 #69256
	//Запрос.УстановитьПараметр("ЦФОСделки", Объект.ЦФО);	
	//РезультатЗапроса = Запрос.Выполнить();	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
#КонецОбласти
	
	//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
	РезультатЗапросаПакет = РезультатЗапросаОпределенияОтветственныхЗаУчет(Объект, ДобавленныеСтроки);
	ВыборкаДетальныеЗаписи = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выбрать();
	//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
	
	НеобходимаЗаписьОбъекта = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	     		
		Отбор = Новый Структура("ГУИД",ВыборкаДетальныеЗаписи.ГУИД);
		МассивСтрокСУЕ = Объект.СвязьУчетныхЕдиниц.НайтиСтроки(Отбор);
		Если МассивСтрокСУЕ.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;                       
		//Евросиб - АСуслов 28.04.2023 11:24:25 #69256
		//(
		МассивСтрокСУЕ[0].ОтветственныйЗаУчет = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОтветственныйЗаУчетПоДоговору), ВыборкаДетальныеЗаписи.ОтветственныйЗаУчетПоДоговору, ВыборкаДетальныеЗаписи.НепосредственныйРуководительНеактуальногоОтветственного);
		//)
		//Евросиб - АСуслов 28.04.2023 11:24:26 #69256
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало (из договора могли не найти нового ответственного, указываем руководителя текущего ответственного)
		Если МассивСтрокСУЕ[0].ОтветственныйЗаУчет = Справочники.Пользователи.ПустаяСсылка() Тогда
			МассивСтрокСУЕ[0].ОтветственныйЗаУчет = ВыборкаДетальныеЗаписи.РуководительНедействительногоОтветственногоЗаУчетВСУЕ;
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		НеобходимаЗаписьОбъекта = Истина;
	КонецЦикла;
	Возврат НеобходимаЗаписьОбъекта;
КонецФункции 
//ДИТ, Беляев СЮ, ТА52417, 31-05-2022, конец

//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, начало
Функция ВыполнитьРазъединениеОтПорожнихСделок(МассивГУИДдляОбработки, СделкаСсылка) Экспорт     
    СделкаОбъект = СделкаСсылка.ПолучитьОбъект();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаРасходы.ГУИД КАК ГУИД,
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВЫБОР КОГДА СделкаРасходы.ПеренесеннаяСделкаИсточник = Значение(Документ.Сделка.ПустаяСсылка) ТОГДА СделкаРасходы.ПеренесеннаяСделка ИНАЧЕ СделкаРасходы.ПеренесеннаяСделкаИсточник КОНЕЦ КАК ПорожняяСделка,
		|	ВЫБОР КОГДА СделкаРасходы.ПеренесеннаяСделкаИсточник = Значение(Документ.Сделка.ПустаяСсылка) ТОГДА СделкаРасходы.СтрокаРасходовВПеренесеннойСделке ИНАЧЕ СделкаРасходы.СтрокаРасходовВСделкеИсточник КОНЕЦ КАК СтрокаРасходовПорожнейСделки,
		|	СделкаРасходы.УчДокумент КАК УчДокумент,
		//Евросиб - АСуслов 09.01.2023 15:08:39 #63784
		//(
		|	СделкаРасходы.ПеренесеннаяСделкаИсточник КАК ПеренесеннаяСделкаИсточник,
		|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник
		//)
		//Евросиб - АСуслов 09.01.2023 15:18:28 #63784
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	Документ.Сделка.Расходы КАК СделкаРасходы
		|ГДЕ
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц В(&МассивГУИДдляОбработки)
		//Евросиб - АСуслов 09.01.2023 16:24:38 #63784
		//(
		|	И (СделкаРасходы.ПеренесеннаяСделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|	ИЛИ СделкаРасходы.ПеренесеннаяСделкаИсточник <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка))
		//)
		//Евросиб - АСуслов 09.01.2023 16:24:40 #63784
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расходы.ГУИД КАК ГУИД,
		|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВТ_Расходы.СтрокаРасходовПорожнейСделки КАК СтрокаРасходовПорожнейСделки,
		|	ВТ_Расходы.ПорожняяСделка КАК ПорожняяСделка,
		|	ВТ_Расходы.УчДокумент КАК УчДокумент,
		//Евросиб - АСуслов 09.01.2023 15:18:49 #63784
		//(
		|	ВТ_Расходы.ПеренесеннаяСделкаИсточник КАК ПеренесеннаяСделкаИсточник,
		|	ВТ_Расходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник
		//)
		//Евросиб - АСуслов 09.01.2023 15:18:51 #63784
		|ИЗ
		|	ВТ_Расходы КАК ВТ_Расходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорожняяСделка,
		|	СтрокаРасходовПорожнейСделки";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	Запрос.УстановитьПараметр("Расходы", СделкаОбъект.Расходы.Выгрузить(,"ГУИД, СтрокаСвязьУчетныхЕдиниц, СтрокаРасходовВПеренесеннойСделке, ПеренесеннаяСделка, УчДокумент, ПеренесеннаяСделкаИсточник, СтрокаРасходовВСделкеИсточник"));  
	Запрос.УстановитьПараметр("МассивГУИДдляОбработки", МассивГУИДдляОбработки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокПорожнихСделокСтрокой = "";
	МассивЗаписываемыхПорожнихСделок = Новый Массив;
	//Евросиб - АСуслов 03.07.2024 17:07:30 #85987
	//(
	//ТаблицаПТУ = ПолучитьСтруктуруТаблицыПТУ();
	//)
	//Евросиб - АСуслов 03.07.2024 17:07:35 #85987
	Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("ПорожняяСделка") Цикл
		ПорожняяСделка = ВыборкаДетальныеЗаписи.ПорожняяСделка.ПолучитьОбъект();
		ПорожняяСделка.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
		Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("СтрокаРасходовПорожнейСделки") Цикл  
			СтрокаРасходовПорожнейСделки = ПорожняяСделка.Расходы.Найти(ВыборкаДетальныеЗаписи.СтрокаРасходовПорожнейСделки,"ГУИД");
			СтрокаРасходовГруженойСделки = СделкаОбъект.Расходы.Найти(ВыборкаДетальныеЗаписи.ГУИД,"ГУИД");
			//В ПОРОЖНЕЙ НЕОБХОДИМО ОЧИСТИТЬ ССЫЛКУ И ГУДИ НА ГРУЖЕНУЮ СДЕЛКУ, ВКЛЮЧИТЬ ОТКЛЮЧЕННУЮ СТРОКУ РАСХОДА, В СОСТАВЕ ПОЕЗДА СНЯТЬ ГАЛКУ "ОТКЛЮЧИТЬ РАСХОДЫ".
			СтрокаРасходовПорожнейСделки.СтрокаРасходовВПеренесеннойСделке = "";
			СтрокаРасходовПорожнейСделки.ПеренесеннаяСделка = Документы.Сделка.ПустаяСсылка();
			//Евросиб - АСуслов 09.01.2023 16:25:04 #63784
			//(
			СтрокаРасходовПорожнейСделки.СтрокаРасходовВСделкеПриемник = "";
			СтрокаРасходовПорожнейСделки.ПеренесеннаяСделкаПриемник = Неопределено;
			//)
			//Евросиб - АСуслов 09.01.2023 16:25:09 #63784                         
			//Евросиб - АСуслов 03.07.2024 13:35:20 #85987
			//(
			СтрокаРасходовПорожнейСделки.СтрокаРасходовВСделкеИсточник = СтрокаРасходовГруженойСделки.ГУИД;
			СтрокаРасходовПорожнейСделки.ПеренесеннаяСделкаИсточник = СделкаОбъект.Ссылка;
			//)
			//Евросиб - АСуслов 03.07.2024 13:35:21 #85987
			СтрокаРасходовПорожнейСделки.УслугаОтключена = Ложь;
			СтрокаРасходовПорожнейСделки.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ПустаяСсылка();
			СтрокаРасходовПорожнейСделки.УчДокумент = СтрокаРасходовГруженойСделки.УчДокумент;
			СтрокаСоставаПоездаПорожнейСделки = ПорожняяСделка.СвязьУчетныхЕдиниц.Найти(СтрокаРасходовПорожнейСделки.СтрокаСвязьУчетныхЕдиниц, "ГУИД");
			Если СтрокаСоставаПоездаПорожнейСделки <> Неопределено Тогда
				СтрокаСоставаПоездаПорожнейСделки.ОтключитьРасходы = Ложь;
				//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, начало
				ВключитьОтключитьРасходыВСвязанныхСтрокахСоставаПоезда(ПорожняяСделка, СтрокаСоставаПоездаПорожнейСделки);
				//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, конец
			КонецЕсли;
			//В ГРУЖЕНОЙ ОЧИСТИТЬ ССЫЛКУ И ГУИД НА СВЯЗАННУЮ ПОРОЖНЮЮ СДЕЛКУ, ОТКЛЮЧИТЬ ЭТИ РАСХОДЫ
			//Евросиб - АСуслов 03.07.2024 17:07:09 #85987
			//(
			//Если ЗначениеЗаполнено(СтрокаРасходовГруженойСделки.УчДокумент) Тогда
			//	нСтрокаТаблицаПТУ = ТаблицаПТУ.Добавить();
			//	нСтрокаТаблицаПТУ.ПТУ = СтрокаРасходовГруженойСделки.УчДокумент;
			//	нСтрокаТаблицаПТУ.СделкаНовая = ПорожняяСделка.Ссылка;
			//	нСтрокаТаблицаПТУ.СделкаСтарая= СделкаОбъект.Ссылка;
			//	нСтрокаТаблицаПТУ.ИдентификаторСтрокиРасходовСделкиНовая = СтрокаРасходовПорожнейСделки.ГУИД;
			//	нСтрокаТаблицаПТУ.ИдентификаторСтрокиРасходовСделкиСтарая = СтрокаРасходовГруженойСделки.ГУИД;
			//КонецЕсли;    
			//)
			//Евросиб - АСуслов 03.07.2024 17:07:10 #85987
			СтрокаРасходовГруженойСделки.СтрокаРасходовВПеренесеннойСделке = "";
			СтрокаРасходовГруженойСделки.ПеренесеннаяСделка = Документы.Сделка.ПустаяСсылка();
			//Евросиб - АСуслов 09.01.2023 16:27:11 #63784
			//(
			СтрокаРасходовГруженойСделки.СтрокаРасходовВСделкеИсточник = "";
			СтрокаРасходовГруженойСделки.ПеренесеннаяСделкаИсточник = Неопределено;
			//)
			//Евросиб - АСуслов 09.01.2023 16:27:15 #63784                 
			//Евросиб - АСуслов 03.07.2024 13:38:27 #85987
			//(
			СтрокаРасходовГруженойСделки.СтрокаРасходовВСделкеПриемник = ВыборкаДетальныеЗаписи.СтрокаРасходовПорожнейСделки;
			СтрокаРасходовГруженойСделки.ПеренесеннаяСделкаПриемник = ВыборкаДетальныеЗаписи.ПорожняяСделка;
			//)
			//Евросиб - АСуслов 03.07.2024 13:38:30 #85987
			СтрокаРасходовГруженойСделки.УслугаОтключена = Истина;
			СтрокаРасходовГруженойСделки.УчДокумент = Неопределено;   
			//Евросиб - АСуслов 09.01.2023 16:44:38 #63784
			//(
			//СтрокаРасходовГруженойСделки.ИсточникПоявленияСтрокиЭкономики_Старая = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ПустаяСсылка(); 
			//СтрокаРасходовГруженойСделки.ИсточникПоявленияСтрокиЭкономики = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ПустаяСсылка();
			СтрокаРасходовГруженойСделки.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.РазъединениеСделок; 
			//)
			//Евросиб - АСуслов 09.01.2023 16:44:40 #63784
		КонецЦикла;
		МассивЗаписываемыхПорожнихСделок.Добавить(ПорожняяСделка); 
		СписокПорожнихСделокСтрокой = СписокПорожнихСделокСтрокой + ПорожняяСделка.Ссылка + Символы.ПС;
	КонецЦикла;
	////В АКЦЕПТАХ ПЕРЕВЯЗАТЬ ОБРАТНО ГУИДЫ И ССЫЛКИ НА ПОРОЖНЮЮ СДЕЛКУ
	//ТаблицаПТУ.Сортировать("ПТУ");
	//ТаблицаСписокПТУ = ТаблицаПТУ.Скопировать(,"ПТУ");
	//ТаблицаСписокПТУ.Свернуть("ПТУ");
	//МассивЗаписываемыхАкцептов = Новый Массив;
	//Для каждого СтрокаСпискаПТУ Из ТаблицаСписокПТУ Цикл
	//	Если НЕ ЗначениеЗаполнено(СтрокаСпискаПТУ.ПТУ) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(СтрокаСпискаПТУ.ПТУ, Ложь);
	//	обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
	//	СтрокиДляОбработки = ТаблицаПТУ.НайтиСтроки(Новый Структура("ПТУ", СтрокаСпискаПТУ.ПТУ));
	//	Для каждого СтрокаДляОбработки Из СтрокиДляОбработки Цикл
	//		СтрокиДляИзменения = обАкцепт.Услуги.НайтиСтроки(Новый Структура("Сделка, ИдентификаторСтрокиРасходовВСделке", СтрокаДляОбработки.СделкаСтарая, СтрокаДляОбработки.ИдентификаторСтрокиРасходовСделкиСтарая));
	//		Для каждого СтрокаДляИзменения Из СтрокиДляИзменения Цикл
	//			СтрокаДляИзменения.Сделка = СтрокаДляОбработки.СделкаНовая;
	//			СтрокаДляИзменения.ИдентификаторСтрокиРасходовВСделке = СтрокаДляОбработки.ИдентификаторСтрокиРасходовСделкиНовая;
	//		КонецЦикла; 
	//	КонецЦикла;
	//	МассивЗаписываемыхАкцептов.Добавить(обАкцепт);
	//КонецЦикла;
	//ВЫПОЛНЯЕМ ЗАПИСЬ ВСЕХ ДОКУМЕНТОВ В ТРАНЗАКЦИИ
	Попытка
		НачатьТранзакцию();
		Документы.Сделка.ПересчитатьПериоды(СделкаОбъект);
		СделкаОбъект.УстановитьКомментарийВерсииИсторииДанных("Разъединение сделок");
		СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Для каждого ЗаписываемыйАкцепт Из МассивЗаписываемыхАкцептов Цикл 
		//	ПериодАкцепта = Мин(ЗаписываемыйАкцепт.ПериодВО, ЗаписываемыйАкцепт.ПериодБУ);
		//	ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(ЗаписываемыйАкцепт, Истина, ПериодАкцепта);
		//	Если ЗначениеЗаполнено(ЗаписываемыйАкцепт.Ссылка) Тогда
		//		Документы.Акцепт.ЗаполнитьИзмененныеСуммыПТУпоАкцепту(ЗаписываемыйАкцепт.Поступление, ЗаписываемыйАкцепт.Ссылка);
		//	КонецЕсли;            
		//	ЗаписываемыйАкцепт.УстановитьКомментарийВерсииИсторииДанных("Разъединение сделок");
		//	ЗаписываемыйАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		//КонецЦикла; 
		Для каждого ЗаписываемаяПорожняяСделка Из МассивЗаписываемыхПорожнихСделок Цикл 
			ЗаписываемаяПорожняяСделка.УстановитьКомментарийВерсииИсторииДанных("Разъединение сделок");
			ЗаписываемаяПорожняяСделка.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; 	
		ЗафиксироватьТранзакцию();
		СтруктураРезультата = Новый Структура; 
		СтруктураРезультата.Вставить("ЕстьРезультат", Истина);
		СтруктураРезультата.Вставить("РезультатРазъединения", "Сделки разъединены");
		СтруктураРезультата.Вставить("СписокСделок", СписокПорожнихСделокСтрокой);
	Исключение
		ОО = ОписаниеОшибки();
		ОтменитьТранзакцию();                 
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ЕстьРезультат", Ложь);
		СтруктураРезультата.Вставить("РезультатРазъединения", ОО);
	КонецПопытки;
	
	Возврат СтруктураРезультата;
КонецФункции
//ДИТ, Беляев СЮ, ТА54910, 19-07-2022, конец

//Евросиб Каблов 26.08.2022 56193
Процедура ПроверитьПериодВОДоходов(Доходы, Сделка = Неопределено, ИзФормыСделки = Ложь, Отказ) Экспорт

	Если ИзФормыСделки Тогда
		
		Для каждого СтрокаДоход Из Доходы Цикл
			Если НЕ СтрокаДоход.НеВыставлятьКлиенту
					И НЕ ЗначениеЗаполнено(СтрокаДоход.ПериодВО) Тогда
				ИндексСтроки = Доходы.Индекс(СтрокаДоход);
				ОбщегоНазначения.СообщитьПользователю("Не заполнен период ВО",,"Доходы["+ИндексСтроки+"].ПериодВО","Объект",Отказ);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ТаблицаОшибок = Доходы.ВыгрузитьКолонки("Клиент, Договор, ПравилоОпределенияДатыДокумента");
		
		Для каждого СтрокаДоход Из Доходы Цикл
			Если НЕ СтрокаДоход.НеВыставлятьКлиенту
					И НЕ ЗначениеЗаполнено(СтрокаДоход.ПериодВО) Тогда
				НайденныеСтрокиСОшибками = ТаблицаОшибок.НайтиСтроки(Новый Структура("Клиент, Договор, ПравилоОпределенияДатыДокумента", СтрокаДоход.Клиент, СтрокаДоход.Договор, СтрокаДоход.ПравилоОпределенияДатыДокумента));
				Если НайденныеСтрокиСОшибками.Количество() = 0 Тогда
					СтрокаТаблицыОшибок = ТаблицаОшибок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыОшибок, СтрокаДоход);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			
			СделкаТип = ТипЗнч(Сделка);
			РеквизитыСделки = "Номер, Дата";
			Если СделкаТип = Тип("ДокументСсылка.Сделка") Тогда
				ЗначенияРеквизитовСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сделка, РеквизитыСделки);
			ИначеЕсли СделкаТип = Тип("ДокументОбъект.Сделка") Тогда
				ЗначенияРеквизитовСделки = Новый Структура(РеквизитыСделки);
				ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовСделки, Сделка);
			КонецЕсли;
			
			Для Каждого СтрокаТаблицыОшибок Из ТаблицаОшибок Цикл
				ТекстСообщения = СтрШаблон("В сделке %1 от %2 не заполнен период ВО по правилу %3 по клиенту %4 договору %5", ЗначенияРеквизитовСделки.Номер, Формат(ЗначенияРеквизитовСделки.Дата, "ДФ=dd.MM.yyyy"), СтрокаТаблицыОшибок.ПравилоОпределенияДатыДокумента, СтрокаТаблицыОшибок.Клиент, СтрокаТаблицыОшибок.Договор);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, начало (метод ПроверитьСоответствиеКоносаментаКалькуляцииФрахта перенесен из формы Сделки и модифицирован)
Функция ПолучитьРезультатПроверкиКоносаментаКалькуляцииФрахта(СвязьУчетныхЕдиницДляПроверки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	|ПОМЕСТИТЬ ВТ_Фрахт
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Фрахт.Контейнер КАК Контейнер,
	|	ВТ_Фрахт.Калькуляция КАК Калькуляция,
	|	ВТ_Фрахт.Коносамент КАК Коносамент,
	|	ВТ_Фрахт.ПортОтправления КАК ПортОтправления,
	|	ВТ_Фрахт.ПортНазначения КАК ПортНазначения,
	|	ВТ_Фрахт.МорскойРейс КАК МорскойРейс,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_Фрахт.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_Фрахт.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_Фрахт.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка ЕСТЬ NULL
	//Евросиб - АСуслов 29.08.2023 13:53:20 #73836
	//(
	//|			ТОГДА ЛОЖЬ
	|  			ТОГДА ВЫБОР КОГДА НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка ЕСТЬ NULL ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	//)
	//Евросиб - АСуслов 29.08.2023 13:53:20 #73836
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК КалькуляцияСоответствует,
	|	ВТ_Фрахт.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента,
	|	ВТ_Фрахт.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВТ_Фрахт.ГУИД КАК ГУИД,
	|	ВТ_Фрахт.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	|ПОМЕСТИТЬ ВТ_РезультатПроверки
	|ИЗ
	|	ВТ_Фрахт КАК ВТ_Фрахт
	//Евросиб - АСуслов 29.08.2023 13:53:20 #73836
	//(
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахт)
	//)
	//Евросиб - АСуслов 29.08.2023 13:53:20 #73836
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|			И (ВЫБОР
	|				КОГДА ВТ_Фрахт.Калькуляция.ФрахтИмпорт
	|					ТОГДА ВТ_Фрахт.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|				ИНАЧЕ ВТ_Фрахт.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|						ИЛИ ВТ_Фрахт.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			КОНЕЦ)
	|			И (ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|				КОГДА ВТ_Фрахт.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|				КОГДА ВТ_Фрахт.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|					ТОГДА ""SOC""
	|				ИНАЧЕ ""COC""
	|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC)
	|			И (КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|				ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
	|			И (ВЫБОР
	|				КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|					ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|				ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|			КОНЕЦ > 0)
	|;    
	//Евросиб - АСуслов 29.08.2023 13:53:20 #73836
	//(
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Фрахт.Калькуляция КАК Калькуляция,
	|	НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка ЕСТЬ NULL
	|		И КалькуляцияНФ_ВыбранныеСтавки.Ссылка ЕСТЬ NULL КАК Псевдофрахт
	|ИЗ
	|	ВТ_Фрахт КАК ВТ_Фрахт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|ГДЕ
	|  НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка ЕСТЬ NULL
	|		И КалькуляцияНФ_ВыбранныеСтавки.Ссылка ЕСТЬ NULL
	|;
	//)
	//Евросиб - АСуслов 29.08.2023 13:53:23 #73836
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РезультатПроверки.Контейнер КАК Контейнер,
	|	ВТ_РезультатПроверки.Калькуляция КАК Калькуляция,
	|	ВТ_РезультатПроверки.Коносамент КАК Коносамент,
	|	ВТ_РезультатПроверки.ПортОтправления КАК ПортОтправления,
	|	ВТ_РезультатПроверки.ПортНазначения КАК ПортНазначения,
	|	ВТ_РезультатПроверки.МорскойРейс КАК МорскойРейс,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_РезультатПроверки.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_РезультатПроверки.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_РезультатПроверки.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ_РезультатПроверки.КалькуляцияСоответствует КАК КалькуляцияСоответствует,
	|	ВТ_РезультатПроверки.КоносаментНомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента,
	|	ВТ_РезультатПроверки.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВТ_РезультатПроверки.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_РезультатПроверки КАК ВТ_РезультатПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РезультатПроверки.ГУИД КАК ГУИД
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
	|	//ПОРТ	
	|	,МАКСИМУМ(ВЫБОР
	|		КОГДА ВТ_РезультатПроверки.Калькуляция.ФрахтИмпорт
	|				ТОГДА ВТ_РезультатПроверки.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|				ИНАЧЕ ВТ_РезультатПроверки.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|						ИЛИ ВТ_РезультатПроверки.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			КОНЕЦ) СтатусСоответствияПорта,
	|	//СОБСТВЕННОСТЬ
	|	МАКСИМУМ(ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|			КОГДА ВТ_РезультатПроверки.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|			КОГДА ВТ_РезультатПроверки.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|					ТОГДА ""SOC""
	|				ИНАЧЕ ""COC""
	|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC) КАК СтатусСоответствияСобственностиПеревозимогоКТК
	|	//СТАВКА			
	|	,МАКСИМУМ(ВЫБОР
	|				КОГДА ВТ_РезультатПроверки.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|					ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|				ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|			КОНЕЦ > 0) КАК СтатусСуммаСтавкиУказана
	|ПОМЕСТИТЬ ВТ_ДанныеСНекорректнойКалькуляцией 
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, конец
	|ИЗ
	|	ВТ_РезультатПроверки КАК ВТ_РезультатПроверки
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_РезультатПроверки.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка И (КалькуляцияНФ_ВыбранныеСтавки.Выбрано40 ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано20)
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, конец
	|ГДЕ
	|	НЕ ВТ_РезультатПроверки.КалькуляцияСоответствует
	|	И ВТ_РезультатПроверки.ВидТранспортногоСообщения = &ВидТранспортногоСообщения
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РезультатПроверки.ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСНекорректнойКалькуляцией.ГУИД КАК ГУИД,
	|  (ВЫБОР КОГДА ВТ_ДанныеСНекорректнойКалькуляцией.СтатусСоответствияПорта ТОГДА """" ИНАЧЕ ""порт; "" КОНЕЦ)
	|  +(ВЫБОР КОГДА ВТ_ДанныеСНекорректнойКалькуляцией.СтатусСоответствияСобственностиПеревозимогоКТК ТОГДА """" ИНАЧЕ ""собственность КТК; "" КОНЕЦ)
	|  +(ВЫБОР КОГДА ВТ_ДанныеСНекорректнойКалькуляцией.СтатусСуммаСтавкиУказана ТОГДА """" ИНАЧЕ ""ставка, соответствующая размеру КТК "" КОНЕЦ)КАК СтрокаИнформирования
    |ИЗ
	|	ВТ_ДанныеСНекорректнойКалькуляцией КАК ВТ_ДанныеСНекорректнойКалькуляцией";
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, конец
	//проверка наличия колонки "ВидТранспортногоСообщения", может быть пустой при вызове из формы "ФормаПодбораКоносамента"
	Если СвязьУчетныхЕдиницДляПроверки.Колонки.Найти("ВидТранспортногоСообщения") = Неопределено Тогда
		СвязьУчетныхЕдиницДляПроверки.Колонки.Добавить("ВидТранспортногоСообщения", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТранспортныхСообщений"));
	КонецЕсли;
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СвязьУчетныхЕдиницДляПроверки);
	Запрос.УстановитьПараметр("ВидТранспортногоСообщения", Перечисления.ВидыТранспортныхСообщений.Море);
	Запрос.УстановитьПараметр("УслугаФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	РезультатПакет = Запрос.ВыполнитьПакет();
	РезультатСтруктура = Новый Структура;
	//РезультатСтруктура.Вставить("ДанныеИРезультатПроверки",РезультатПакет[РезультатПакет.Количество()-2].Выгрузить());
	//РезультатСтруктура.Вставить("МассивГУИДсНекорректнойКалькуляцией",РезультатПакет[РезультатПакет.Количество()-1].Выгрузить().ВыгрузитьКолонку("ГУИД"));
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, начало
	РезультатСтруктура.Вставить("ДанныеИРезультатПроверки",РезультатПакет[РезультатПакет.Количество()-3].Выгрузить());
	РезультатСтруктура.Вставить("ТаблицаДанныхСНекорректнойКалькуляцией",РезультатПакет[РезультатПакет.Количество()-1].Выгрузить());
	//ДИТ, Беляев СЮ, US 61000/TA 61002, 20-12-2022, клнец   
	//Евросиб - АСуслов 29.08.2023 13:54:16 #73836
	//(
	РезультатСтруктура.Вставить("МассивКалькуляцийПсевдофрахта", РезультатПакет[РезультатПакет.Количество()-4].Выгрузить().ВыгрузитьКолонку("Калькуляция"));
	//)
	//Евросиб - АСуслов 29.08.2023 13:54:22 #73836
	Возврат РезультатСтруктура; 
	
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0289418/US 59501, 07-11-2022, конец

//Евросиб Каблов 20.01.2022 62514
Функция ПолучитьПризнакОплатаПоОригиналу(Сделка) Экспорт

	ОплатаПоОригиналу = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.Клиент КАК Клиент,
	               |	ВремТЧ.Договор КАК Договор,
	               |	""ЭтаСделка"" КАК Ссылка
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ.Договор.ОплатаПоОригиналу) КАК ОплатаПоОригиналу,
	               |	ВТ.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Ссылка";
	
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.Сделка") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВремТЧ КАК ВремТЧ", "Документ.Сделка.СвязьУчетныхЕдиниц КАК ВремТЧ ГДЕ ВремТЧ.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Сделка);
	Иначе
		Запрос.УстановитьПараметр("ВремТЧ",Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	КонецЕсли;
	
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ОплатаПоОригиналу = Ответ.ОплатаПоОригиналу;
	КонецЕсли;
	
	Возврат ОплатаПоОригиналу;
		
КонецФункции

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023
Функция ИзменитьСделкуПоРефСцепу(СделкаОбъект, РефСцепИсходный) Экспорт   
	
	НеобходимаЗаписьОбъекта = Ложь;

	ПостановкаЗадачиНаУдалениеКонтейнерыПоРефСцепу(СделкаОбъект
		, НеобходимаЗаписьОбъекта);
	
	Возврат НеобходимаЗаписьОбъекта;
	
КонецФункции	

Процедура ПостановкаЗадачиНаУдалениеКонтейнерыПоРефСцепу(СделкаОбъект, НеобходимаЗаписьОбъекта = Ложь) Экспорт
		
		
	УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным = УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным(СделкаОбъект);	
	тзУдаляемыхКТКИзСделкиПоРефСцепу = УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным.тзУдаляемыхКТКИзСделкиПоРефСцепу;
	мОтветственные                   = УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным.мОтветственные;
    тзРефСцепыПоОтветственным        = УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным.тзРефСцепыПоОтветственным;
	
	СтатусВыполнен 					 = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусНаВыполнение				 = Перечисления.СтатусыЭтапов.НаВыполнение;	
	ОсновнаяЧастьНаименования 		 = "ИсключитьКТКИзСделкиВСвязиСоСменойРефСцепа";
	МассивОднотипныхСостояний		 = РефСцепСервер.МассивОднотипныхСостояний(ОсновнаяЧастьНаименования,9);
	тзСостояния 					 = СделкаОбъект.Состояния.Выгрузить();
		
	Если не тзУдаляемыхКТКИзСделкиПоРефСцепу.Количество() > 0 Тогда 
	//  Закрываем задачи на удаление заявок
		Для каждого стр из тзСостояния Цикл	
			Если МассивОднотипныхСостояний.Найти(Стр.Состояние)= Неопределено Тогда Продолжить; КонецЕсли;	
			НеобходимаЗаписьОбъекта = Истина;
			Стр.Статус 				= СтатусВыполнен;
		КонецЦикла;	

		СделкаОбъект.Состояния.Загрузить(тзСостояния);
		
		Возврат; 
	КонецЕсли;	
		
	Для каждого СтрОтветственный из мОтветственные Цикл
		
		мРефСцепыПоОтветсвенным = тзРефСцепыПоОтветственным.НайтиСтроки(
			НОвый Структура("Ответственный", СтрОтветственный));
		
		МассивРефСцеповКТКПоОтветственномуДляКомментария = НОвый Массив;
		
		Для каждого СтрРефСцепа из мРефСцепыПоОтветсвенным Цикл 

			МассивКТКПоОтветственномуДляКомментария = НОвый Массив;

			мУдаляемыхКТКИзСделкиПоРефСцепу = тзУдаляемыхКТКИзСделкиПоРефСцепу.НайтиСтроки(
				НОвый Структура("Ответственный, РефСцеп", СтрОтветственный, СтрРефСцепа.РефСцеп ));

			Для каждого СтрКТК из мУдаляемыхКТКИзСделкиПоРефСцепу Цикл
				Если СокрЛП(СтрКТК.КонтейнерНаименование) = "" Тогда Продолжить; КонецЕсли; 
				МассивКТКПоОтветственномуДляКомментария.Добавить( СтрКТК.КонтейнерНаименование + ", " );
			КонецЦикла;	
			
			МассивРефСцеповКТКПоОтветственномуДляКомментария.Добавить("КТК:" + стрСоединить(МассивКТКПоОтветственномуДляКомментария, ", ") 
				+ "Реф.сцеп:" + СтрРефСцепа.Номер + " от " + Формат(СтрКТК.Дата,"ДФ=""dd.MM.yyyy"""));
		КонецЦикла;		
		
		Комментарий = стрСоединить(МассивРефСцеповКТКПоОтветственномуДляКомментария, ", "); 
		
		МассивСостоянийНаУдалениеИзСделки = тзСостояния.НайтиСтроки(Новый Структура("Исполнитель", СтрОтветственный));	
		
		ЕстьСостоянияНаУдалениеИзСделкиПоОтветсвенному = Ложь;
			
		Для каждого стр из МассивСостоянийНаУдалениеИзСделки Цикл	
		
			Если МассивОднотипныхСостояний.Найти(Стр.Состояние)= Неопределено Тогда Продолжить; КонецЕсли;	
			
			ЕстьСостоянияНаУдалениеИзСделкиПоОтветсвенному = Истина;    	
			
			Если СокрЛП(Комментарий) <> "" и Стр.Статус <> СтатусНаВыполнение Тогда
				НеобходимаЗаписьОбъекта = Истина;
				Стр.Статус = СтатусНаВыполнение;
			    стр.Комментарий = Комментарий;
			ИначеЕсли СокрЛП(Комментарий) = "" и Стр.Статус <> СтатусВыполнен Тогда
				НеобходимаЗаписьОбъекта = Истина;
				Стр.Статус = СтатусВыполнен;
			КонецЕсли;	
			
		КонецЦикла;
		Если СокрЛП(Комментарий) <> "" и не ЕстьСостоянияНаУдалениеИзСделкиПоОтветсвенному Тогда
			НеобходимаЗаписьОбъекта = Истина;
			НоваяЗадача = тзСостояния.Добавить();
			НоваяЗадача.Исполнитель = СтрОтветственный;
			НоваяЗадача.Наблюдатель = СтрОтветственный;
			НоваяЗадача.Статус		= Перечисления.СтатусыЭтапов.НаВыполнение;
			НоваяЗадача.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
			НоваяЗадача.Состояние	= РефСцепСервер.ОчередноеСостояниеОдинаковых(
				тзСостояния, ОсновнаяЧастьНаименования, 9);
			НоваяЗадача.Комментарий = Комментарий; 
		КонецЕсли;	
		
	КонецЦикла;	
	Если НеобходимаЗаписьОбъекта = Истина Тогда
		СделкаОбъект.Состояния.Загрузить(тзСостояния);
	КонецЕсли;	
КонецПроцедуры	

Функция УдаляемыеКТКИзСделкиПоРефСцепуПоОтветственным(СделкаОбъект) 
	// 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ вт_СделкаСвязьУчетныхЕдиниц0
		|ИЗ
		|	&тзСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
		|	ДокументЗаявка.ОтветственныйМенеджер КАК Ответственный,
		|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ вт_СделкаСвязьУчетныхЕдиниц
		|ИЗ
		|	вт_СделкаСвязьУчетныхЕдиниц0 КАК СделкаСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокументЗаявка
		|		ПО СделкаСвязьУчетныхЕдиниц.Заявка = ДокументЗаявка.Ссылка
		|			И (ДокументЗаявка.ДокументОснование ССЫЛКА Документ.РефСцеп)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп,
		|	РефСцепКонтейнеры.Контейнер КАК Контейнер,
		|	РефСцепКонтейнеры.Контейнер.Наименование КАК КонтейнерНаименование,
		|	РефСцепКонтейнеры.Ссылка.Номер КАК Номер,
		|	РефСцепКонтейнеры.Ссылка КАК РефСцеп,
		|	РефСцепКонтейнеры.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ вт_РефСцепыПоКонтейнерам
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_СделкаСвязьУчетныхЕдиниц КАК вт_СделкаСвязьУчетныхЕдиниц
		|		ПО РефСцепКонтейнеры.Контейнер = вт_СделкаСвязьУчетныхЕдиниц.Контейнер
		|ГДЕ
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп <> ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_СделкаСвязьУчетныхЕдиниц.Ответственный КАК Ответственный,
		|	ЕСТЬNULL(вт_СделкаСвязьУчетныхЕдиниц.Заявка, ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)) КАК Заявка,
		|	вт_РефСцепыПоКонтейнерам.КонтейнерНаименование КАК КонтейнерНаименование,
		|	вт_РефСцепыПоКонтейнерам.Номер КАК Номер,
		|	вт_РефСцепыПоКонтейнерам.Дата КАК Дата,
		|	вт_РефСцепыПоКонтейнерам.РефСцеп КАК РефСцеп
		|ПОМЕСТИТЬ вт_КонтейнерыКУдалениюПоОтвественным
		|ИЗ
		|	вт_РефСцепыПоКонтейнерам КАК вт_РефСцепыПоКонтейнерам
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СделкаСвязьУчетныхЕдиниц КАК вт_СделкаСвязьУчетныхЕдиниц
		|		ПО вт_РефСцепыПоКонтейнерам.Контейнер = вт_СделкаСвязьУчетныхЕдиниц.Контейнер
		|ГДЕ
		|	ЕСТЬNULL(вт_СделкаСвязьУчетныхЕдиниц.Заявка, ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(вт_КонтейнерыКУдалениюПоОтвественным.Ответственный, ЗНАЧЕНИЕ(Справочник.ПОльзователи.Пустаяссылка)) КАК Ответственный,
		|	вт_КонтейнерыКУдалениюПоОтвественным.КонтейнерНаименование КАК КонтейнерНаименование,
		|	вт_КонтейнерыКУдалениюПоОтвественным.Номер КАК Номер,
		|	вт_КонтейнерыКУдалениюПоОтвественным.Заявка КАК Заявка,
		|	вт_КонтейнерыКУдалениюПоОтвественным.Дата КАК Дата,
		|	вт_КонтейнерыКУдалениюПоОтвественным.РефСцеп КАК РефСцеп
		|ИЗ
		|	вт_КонтейнерыКУдалениюПоОтвественным КАК вт_КонтейнерыКУдалениюПоОтвественным
		|ГДЕ
		|	ЕСТЬNULL(вт_КонтейнерыКУдалениюПоОтвественным.Ответственный, ЗНАЧЕНИЕ(Справочник.ПОльзователи.Пустаяссылка)) <> ЗНАЧЕНИЕ(Справочник.ПОльзователи.Пустаяссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КонтейнерыКУдалениюПоОтвественным.Ответственный КАК Ответственный,
		|	вт_КонтейнерыКУдалениюПоОтвественным.РефСцеп КАК РефСцеп,
		|	вт_КонтейнерыКУдалениюПоОтвественным.Дата КАК Дата,
		|	вт_КонтейнерыКУдалениюПоОтвественным.Номер КАК Номер
		|ИЗ
		|	вт_КонтейнерыКУдалениюПоОтвественным КАК вт_КонтейнерыКУдалениюПоОтвественным
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаСостояния.Исполнитель КАК Ответственный
		|ПОМЕСТИТЬ вт_Состояния
		|ИЗ
		|	&тзСостояния КАК СделкаСостояния
		|ГДЕ
		|	ЕСТЬNULL(СделкаСостояния.Исполнитель, ЗНАЧЕНИЕ(Справочник.ПОльзователи.Пустаяссылка)) <> ЗНАЧЕНИЕ(Справочник.ПОльзователи.Пустаяссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_КонтейнерыКУдалениюПоОтвественным.Ответственный КАК Ответственный
		|ИЗ
		|	вт_КонтейнерыКУдалениюПоОтвественным КАК вт_КонтейнерыКУдалениюПоОтвественным
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Состояния.Ответственный
		|ИЗ
		|	вт_Состояния КАК вт_Состояния";
		
	
	Запрос.УстановитьПараметр("тзСвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("тзСостояния", СделкаОбъект.Состояния.Выгрузить());
	Запрос.УстановитьПараметр("КонтейнерыСделки", СделкаОбъект.Состояния.Выгрузить());
	Результат = Запрос.ВыполнитьПакет();  
	
	Возврат Новый Структура("тзУдаляемыхКТКИзСделкиПоРефСцепу,тзРефСцепыПоОтветственным, мОтветственные"
		, Результат[4].Выгрузить(), Результат[5].Выгрузить(), Результат[7].Выгрузить().ВыгрузитьКолонку("Ответственный"))
	
КонецФункции	

//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, начало
Процедура ВключитьОтключитьРасходыВСвязанныхСтрокахСоставаПоезда(ПорожняяСделка, СтрокаСоставаПоездаПорожнейСделки)
	Если СтрокаСоставаПоездаПорожнейСделки.ВидТранспортногоСообщения <> Перечисления.ВидыТранспортныхСообщений.ЖД Тогда
		Возврат;
	КонецЕсли;
	
	ГУИДСтрокиЗаявки = СтрокаСоставаПоездаПорожнейСделки.ГУИДСтрокиЗаявки;
	Если ЗначениеЗаполнено(ГУИДСтрокиЗаявки) Тогда
		Отбор = Новый Структура("ГУИДСтрокиЗаявки,ВидТранспортногоСообщения ", ГУИДСтрокиЗаявки, Перечисления.ВидыТранспортныхСообщений.Море);
		НайденныеСтрокиСоставаПоезда = ПорожняяСделка.СвязьУчетныхЕдиниц.НайтиСтроки(Отбор);
		Если НайденныеСтрокиСоставаПоезда.Количество()>0 Тогда
			НайденныеСтрокиСоставаПоезда[0].ОтключитьРасходы = СтрокаСоставаПоездаПорожнейСделки.ОтключитьРасходы;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, TA 79289/ TA 79294, 15-01-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, начало
Процедура УстановитьГотовоКВыставлению(СделкаОбъект) Экспорт
	
	Если СделкаОбъект.ПодсылПорожних Тогда
		Возврат;
	КонецЕсли;
	
	Если СделкаОбъект.Дата < Дата(2024,08,01,0,0,0) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91744, 16-09-2024, начало
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Рейсы.Рейс КАК Рейс
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Сделка.Рейсы КАК Рейсы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Рейс КАК Рейс
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
	|		ПО ВТ.Рейс = РейсыЖД.Ссылка
	|			И (РейсыЖД.Ссылка <> ЗНАЧЕНИЕ(Справочник.РейсыЖД.БезРейса))";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.Рейсы", "&Рейсы");
	Запрос.УстановитьПараметр("Рейсы", СделкаОбъект.Рейсы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91744, 16-09-2024, конец
	
	МассивУсловийПеревозкиНазначение = Новый Массив;
	МассивУсловийПеревозкиНазначение.Добавить(Перечисления.УсловияПеревозкиКТК.CY);
	МассивУсловийПеревозкиНазначение.Добавить(Перечисления.УсловияПеревозкиКТК.FOR);	
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	СвязьУчетныхЕдиниц.Клиент КАК Клиент,
	//|	СвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозки,
	//|	СвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	//|	СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	//|	СвязьУчетныхЕдиниц.ОтключитьРасходы КАК ОтключитьРасходы,
	//|	СвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ.Клиент КАК Клиент,
	//|	ВТ.УсловияПеревозки КАК УсловияПеревозки,
	//|	ВТ.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	//|	ВТ.Калькуляция КАК Калькуляция
	//|ИЗ
	//|	ВТ КАК ВТ
	//|ГДЕ
	//|	НЕ ВТ.ОтключитьРасходы
	//|	И НЕ ВТ.ГотовоКВыставлению
	//|	И ВТ.УсловияПеревозки = &УсловиеПеревозкиОтправления
	//|	И ВТ.УсловияПеревозкиНазначение В(&МассивУсловийПеревозкиНазначение)
	//|	И ВТ.Клиент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	//|	И ВТ.Калькуляция.ПС_ВидПеревозки = &ВидПеревозки";
	//
	//Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 92270 / TA 92454, 08-10-2024, начало
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозки,
	|	СвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СвязьУчетныхЕдиниц.ОтключитьРасходы КАК ОтключитьРасходы,
	|	СвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаНастройкиСтрокСоставаПоезда.ГУИД КАК ГУИД,
	|	СделкаНастройкиСтрокСоставаПоезда.ОтключитьАвтоустановкуГотовоКВыставлению КАК ОтключитьАвтоустановкуГотовоКВыставлению
	|ПОМЕСТИТЬ ВТ_ОтключитьАвтоустановку
	|ИЗ
	|	Документ.Сделка.НастройкиСтрокСоставаПоезда КАК СделкаНастройкиСтрокСоставаПоезда
	|ГДЕ
	|	СделкаНастройкиСтрокСоставаПоезда.ОтключитьАвтоустановкуГотовоКВыставлению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.Договор КАК Договор,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ОтключитьАвтоустановку.ОтключитьАвтоустановкуГотовоКВыставлению, ЛОЖЬ)) КАК ОтключитьАвтоустановкуГотовоКВыставлению
	|ПОМЕСТИТЬ ВТ_ОтключитьАвтоустановкуКлиентДоговор
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтключитьАвтоустановку КАК ВТ_ОтключитьАвтоустановку
	|		ПО ВТ.ГУИД = ВТ_ОтключитьАвтоустановку.ГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Клиент,
	|	ВТ.Договор
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ОтключитьАвтоустановку.ОтключитьАвтоустановкуГотовоКВыставлению, ЛОЖЬ)) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.УсловияПеревозки КАК УсловияПеревозки,
	|	ВТ.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	ВТ.Калькуляция КАК Калькуляция
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтключитьАвтоустановкуКлиентДоговор КАК ВТ_ОтключитьАвтоустановкуКлиентДоговор
	|		ПО ВТ.Клиент = ВТ_ОтключитьАвтоустановкуКлиентДоговор.Клиент
	|			И ВТ.Договор = ВТ_ОтключитьАвтоустановкуКлиентДоговор.Договор
	|ГДЕ
	|	НЕ ВТ.ОтключитьРасходы
	|	И НЕ ВТ.ГотовоКВыставлению
	|	И ВТ.УсловияПеревозки = &УсловиеПеревозкиОтправления
	|	И ВТ.УсловияПеревозкиНазначение В(&МассивУсловийПеревозкиНазначение)
	|	И ВТ.Клиент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И ВТ.Калькуляция.ПС_ВидПеревозки = &ВидПеревозки
	|	И ВТ_ОтключитьАвтоустановкуКлиентДоговор.Клиент ЕСТЬ NULL";
	//Евросиб(ДИТ), Беляев СЮ, BUG 92270 / TA 92454, 08-10-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 92270 / TA 92454, 08-10-2024, начало
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.НастройкиСтрокСоставаПоезда", "&НастройкиСтрокСоставаПоезда");
	Запрос.УстановитьПараметр("НастройкиСтрокСоставаПоезда", СделкаОбъект.НастройкиСтрокСоставаПоезда.Выгрузить());
	//Евросиб(ДИТ), Беляев СЮ, BUG 92270 / TA 92454, 08-10-2024, конец
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("ВидПеревозки", Справочники.ВидыПеревозок.ИмпортМоре);
	Запрос.УстановитьПараметр("УсловиеПеревозкиОтправления", Перечисления.УсловияПеревозкиКТК.CY);
	Запрос.УстановитьПараметр("МассивУсловийПеревозкиНазначение", МассивУсловийПеревозкиНазначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//установка
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Удалена", Ложь);
	СтруктураПоиска.Вставить("НеАктивна", Ложь);
	СтруктураПоиска.Вставить("ОтключитьРасходы", Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска.Вставить("Клиент", ВыборкаДетальныеЗаписи.Клиент);
		СтруктураПоиска.Вставить("УсловияПеревозки", ВыборкаДетальныеЗаписи.УсловияПеревозки);
		СтруктураПоиска.Вставить("УсловияПеревозкиНазначение", ВыборкаДетальныеЗаписи.УсловияПеревозкиНазначение);
		СтруктураПоиска.Вставить("Калькуляция", ВыборкаДетальныеЗаписи.Калькуляция);
		
		Документы.Сделка.ПроверитьПометитьСтрокиКВыставлению(СделкаОбъект, СтруктураПоиска, , , , Истина);
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, начало
Функция ПолучитьСтрокиДоходовВозможныеДляГруппировки(СделкаОбъект, МассивГУИДСтрокДляОбработки) Экспорт
	Если МассивГУИДСтрокДляОбработки.Количество() < 1 Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Доходы.Клиент КАК Клиент,
	               |	Доходы.Договор КАК Договор,
	               |	Доходы.СтавкаНДС КАК СтавкаНДС,
	               |	Доходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	Доходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	Доходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	Доходы.ПериодВО КАК ПериодВО,
	               |	Доходы.Перевыставляемая КАК Перевыставляемая,
	               |	Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	Доходы.ДокументФФД КАК ДокументФФД,
	               |	Доходы.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ_Доходы
	               |ИЗ
	               |	&Доходы КАК Доходы
	               |ГДЕ
	               |	Доходы.ГУИД В(&МассивГУИДСтрокДляОбработки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Расходы.ГУИД КАК ГУИД,
	               |	Расходы.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ_Расходы
	               |ИЗ
	               |	&Расходы КАК Расходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвязьДоходовИРасходов.Доходы КАК Доходы,
	               |	СвязьДоходовИРасходов.Расходы КАК Расходы
	               |ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	               |ИЗ
	               |	&СвязьДоходовИРасходов КАК СвязьДоходовИРасходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Доходы.ГУИД КАК ГУИД,
	               |	ВТ_Расходы.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ_ДокументыРасходовПеревыставляемых
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	               |			ПО (ВТ_Расходы.ГУИД = ВТ_СвязьДоходовИРасходов.Расходы)
	               |				И (НЕ ВТ_Расходы.УчДокумент = НЕОПРЕДЕЛЕНО ИЛИ ВТ_Расходы.УчДокумент.Ссылка ЕСТЬ NULL)
	               |		ПО ВТ_Доходы.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	               |ГДЕ
	               |	ВТ_Доходы.Перевыставляемая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.Клиент КАК Клиент,
	               |	ВТ_Доходы.Договор КАК Договор,
	               |	ВТ_Доходы.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_Доходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	ВТ_Доходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	ВТ_Доходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	ВТ_Доходы.ПериодВО КАК ПериодВО,
	               |	ВТ_Доходы.Перевыставляемая КАК Перевыставляемая,
	               |	ВТ_Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	ВТ_Доходы.ДокументФФД КАК ДокументФФД,
	               |	ВТ_Доходы.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ_перваяСтрока
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |ГДЕ
	               |	ВТ_Доходы.ГУИД = &ГУИДпервойСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВТ_перваяСтрока.ГУИД КАК ГУИД,
	               |	ВТ_ДокументыРасходовПеревыставляемых.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ_УчетныйДокументРасходаПервойСтроки
	               |ИЗ
	               |	ВТ_перваяСтрока КАК ВТ_перваяСтрока
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРасходовПеревыставляемых КАК ВТ_ДокументыРасходовПеревыставляемых
	               |		ПО ВТ_перваяСтрока.ГУИД = ВТ_ДокументыРасходовПеревыставляемых.ГУИД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.ГУИД КАК ГУИД
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_перваяСтрока КАК ВТ_перваяСтрока
	               |		ПО (НЕ ВТ_перваяСтрока.Перевыставляемая)
	               |			И (ВТ_перваяСтрока.Клиент = ВТ_Доходы.Клиент)
	               |			И (ВТ_перваяСтрока.Договор = ВТ_Доходы.Договор)
	               |			И (ВТ_перваяСтрока.СтавкаНДС = ВТ_Доходы.СтавкаНДС)
	               |			И (ВТ_перваяСтрока.НДСВключенВСтоимость = ВТ_Доходы.НДСВключенВСтоимость)
	               |			И (ВТ_перваяСтрока.СтавкаНДСВознаграждения = ВТ_Доходы.СтавкаНДСВознаграждения)
	               |			И (ВТ_перваяСтрока.ВознаграждениеВключаетНДС = ВТ_Доходы.ВознаграждениеВключаетНДС)
	               |			И (ВТ_перваяСтрока.ПериодВО = ВТ_Доходы.ПериодВО)
	               |			И (ВТ_перваяСтрока.Перевыставляемая = ВТ_Доходы.Перевыставляемая)
	               |			И (ВТ_перваяСтрока.УслугаВнеСтавки = ВТ_Доходы.УслугаВнеСтавки)
	               |			И (ВТ_перваяСтрока.ДокументФФД = ВТ_Доходы.ДокументФФД)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.ГУИД
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_перваяСтрока КАК ВТ_перваяСтрока
	               |		ПО (ВТ_перваяСтрока.Перевыставляемая)
	               |			И (ВТ_перваяСтрока.Клиент = ВТ_Доходы.Клиент)
	               |			И (ВТ_перваяСтрока.Договор = ВТ_Доходы.Договор)
	               |			И (ВТ_перваяСтрока.СтавкаНДС = ВТ_Доходы.СтавкаНДС)
	               |			И (ВТ_перваяСтрока.НДСВключенВСтоимость = ВТ_Доходы.НДСВключенВСтоимость)
	               |			И (ВТ_перваяСтрока.СтавкаНДСВознаграждения = ВТ_Доходы.СтавкаНДСВознаграждения)
	               |			И (ВТ_перваяСтрока.ВознаграждениеВключаетНДС = ВТ_Доходы.ВознаграждениеВключаетНДС)
	               |			И (ВТ_перваяСтрока.ПериодВО = ВТ_Доходы.ПериодВО)
	               |			И (ВТ_перваяСтрока.Перевыставляемая = ВТ_Доходы.Перевыставляемая)
	               |			И (ВТ_перваяСтрока.УслугаВнеСтавки = ВТ_Доходы.УслугаВнеСтавки)
	               |			И (ВТ_перваяСтрока.ДокументФФД = ВТ_Доходы.ДокументФФД)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УчетныйДокументРасходаПервойСтроки КАК ВТ_УчетныйДокументРасходаПервойСтроки
	               |		ПО (ВТ_перваяСтрока.ГУИД = ВТ_УчетныйДокументРасходаПервойСтроки.ГУИД)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыРасходовПеревыставляемых КАК ВТ_ДокументыРасходовПеревыставляемых
	               |		ПО ВТ_Доходы.ГУИД = ВТ_ДокументыРасходовПеревыставляемых.ГУИД
	               |			И (ВТ_УчетныйДокументРасходаПервойСтроки.УчДокумент = ВТ_ДокументыРасходовПеревыставляемых.УчДокумент)";
	
	Запрос.УстановитьПараметр("Доходы", СделкаОбъект.Доходы.Выгрузить(,"Клиент, Договор, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, ПериодВО, Перевыставляемая, УслугаВнеСтавки, ДокументФФД, ГУИД"));
	Запрос.УстановитьПараметр("Расходы", СделкаОбъект.Расходы.Выгрузить(,"ГУИД, УчДокумент"));
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить(,"Доходы, Расходы"));
	Запрос.УстановитьПараметр("ГУИДпервойСтроки", МассивГУИДСтрокДляОбработки[0]);
	Запрос.УстановитьПараметр("МассивГУИДСтрокДляОбработки", МассивГУИДСтрокДляОбработки);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГУИД");
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, начало
Процедура ОбъединитьCтрокиДоходовВРдляВыставления(СделкаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Доходы.Клиент КАК Клиент,
	               |	Доходы.Договор КАК Договор,
	               |	Доходы.СтавкаНДС КАК СтавкаНДС,
	               |	Доходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	Доходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	Доходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	Доходы.ПериодВО КАК ПериодВО,
	               |	Доходы.Перевыставляемая КАК Перевыставляемая,
	               |	Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	Доходы.ДокументФФД КАК ДокументФФД,
	               |	Доходы.ГУИД КАК ГУИД,
	               |	Доходы.ДоплатныеКТК КАК ДоплатныеКТК,
	               |	Доходы.УчДокумент КАК УчДокумент,
	               |	Доходы.ИдентификаторГруппировки КАК ИдентификаторГруппировки
	               |ПОМЕСТИТЬ ВТ_Доходы
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК Доходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Расходы.ГУИД КАК ГУИД,
	               |	Расходы.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ_Расходы
	               |ИЗ
	               |	Документ.Сделка.Расходы КАК Расходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвязьДоходовИРасходов.Доходы КАК Доходы,
	               |	СвязьДоходовИРасходов.Расходы КАК Расходы
	               |ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	               |ИЗ
	               |	Документ.Сделка.СвязьДоходовИРасходов КАК СвязьДоходовИРасходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Доходы.ГУИД КАК ГУИД,
	               |	ВТ_Расходы.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ_ДокументыРасходовПеревыставляемых
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	               |			ПО (ВТ_Расходы.ГУИД = ВТ_СвязьДоходовИРасходов.Расходы)
	               |				И (НЕ ВТ_Расходы.УчДокумент = НЕОПРЕДЕЛЕНО
	               |					ИЛИ ВТ_Расходы.УчДокумент.Ссылка ЕСТЬ NULL)
	               |		ПО ВТ_Доходы.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	               |ГДЕ
	               |	ВТ_Доходы.Перевыставляемая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.Клиент КАК Клиент,
	               |	ВТ_Доходы.Договор КАК Договор,
	               |	ВТ_Доходы.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_Доходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	ВТ_Доходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	ВТ_Доходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	ВТ_Доходы.ПериодВО КАК ПериодВО,
	               |	ВТ_Доходы.Перевыставляемая КАК Перевыставляемая,
	               |	ВТ_Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	ВТ_Доходы.ДокументФФД КАК ДокументФФД,
	               |	ВТ_Доходы.ГУИД КАК ГУИД,
	               |	ВТ_Доходы.ИдентификаторГруппировки КАК ИдентификаторГруппировки,
	               |	ВТ_ДокументыРасходовПеревыставляемых.УчДокумент КАК ПТУ
	               |ПОМЕСТИТЬ ВТ_ДоходыВР
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыРасходовПеревыставляемых КАК ВТ_ДокументыРасходовПеревыставляемых
	               |		ПО ВТ_Доходы.ГУИД = ВТ_ДокументыРасходовПеревыставляемых.ГУИД
	               |ГДЕ
	               |	ВТ_Доходы.Перевыставляемая
	               |	И ВТ_Доходы.УслугаВнеСтавки
	               |	И НЕ ВТ_Доходы.ДоплатныеКТК
	               |	И (ВТ_Доходы.УчДокумент = НЕОПРЕДЕЛЕНО
	               |			ИЛИ ВТ_Доходы.УчДокумент.Ссылка ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоходыВР.Клиент КАК Клиент,
	               |	ВТ_ДоходыВР.Договор КАК Договор,
	               |	ВТ_ДоходыВР.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ДоходыВР.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	ВТ_ДоходыВР.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	ВТ_ДоходыВР.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	ВТ_ДоходыВР.ПериодВО КАК ПериодВО,
	               |	ВТ_ДоходыВР.Перевыставляемая КАК Перевыставляемая,
	               |	ВТ_ДоходыВР.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	ВТ_ДоходыВР.ДокументФФД КАК ДокументФФД,
	               |	ВТ_ДоходыВР.ПТУ КАК ПТУ,
	               |	МАКСИМУМ(ВТ_ДоходыВР.ИдентификаторГруппировки) КАК МаксимальныйИдентификаторГруппировки,
	               |	КОЛИЧЕСТВО(ВТ_ДоходыВР.ГУИД) КАК КоличествоГУИД,
	               |	АВТОНОМЕРЗАПИСИ() КАК НомерГруппы
	               |ПОМЕСТИТЬ ВТ_Группы
	               |ИЗ
	               |	ВТ_ДоходыВР КАК ВТ_ДоходыВР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДоходыВР.Клиент,
	               |	ВТ_ДоходыВР.Договор,
	               |	ВТ_ДоходыВР.СтавкаНДС,
	               |	ВТ_ДоходыВР.НДСВключенВСтоимость,
	               |	ВТ_ДоходыВР.СтавкаНДСВознаграждения,
	               |	ВТ_ДоходыВР.ВознаграждениеВключаетНДС,
	               |	ВТ_ДоходыВР.ПериодВО,
	               |	ВТ_ДоходыВР.Перевыставляемая,
	               |	ВТ_ДоходыВР.УслугаВнеСтавки,
	               |	ВТ_ДоходыВР.ДокументФФД,
	               |	ВТ_ДоходыВР.ПТУ
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(ВТ_ДоходыВР.ГУИД) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ_Доходы.ИдентификаторГруппировки) КАК ИдентификаторГруппировки
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Группы.Клиент КАК Клиент,
	               |	ВТ_Группы.Договор КАК Договор,
	               |	ВТ_Группы.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_Группы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	ВТ_Группы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	               |	ВТ_Группы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	               |	ВТ_Группы.ПериодВО КАК ПериодВО,
	               |	ВТ_Группы.Перевыставляемая КАК Перевыставляемая,
	               |	ВТ_Группы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	ВТ_Группы.ДокументФФД КАК ДокументФФД,
	               |	ВТ_Группы.ПТУ КАК ПТУ,
	               |	ВТ_Группы.МаксимальныйИдентификаторГруппировки КАК МаксимальныйИдентификаторГруппировки,
	               |	ВТ_Группы.КоличествоГУИД КАК КоличествоГУИД,
	               |	ВТ_Группы.НомерГруппы КАК НомерГруппы,
	               |	ВТ_ДоходыВР.ГУИД КАК ГУИД
	               |ИЗ
	               |	ВТ_Группы КАК ВТ_Группы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВР КАК ВТ_ДоходыВР
	               |		ПО ВТ_Группы.Клиент = ВТ_ДоходыВР.Клиент
	               |			И ВТ_Группы.Договор = ВТ_ДоходыВР.Договор
	               |			И ВТ_Группы.СтавкаНДС = ВТ_ДоходыВР.СтавкаНДС
	               |			И ВТ_Группы.НДСВключенВСтоимость = ВТ_ДоходыВР.НДСВключенВСтоимость
	               |			И ВТ_Группы.СтавкаНДСВознаграждения = ВТ_ДоходыВР.СтавкаНДСВознаграждения
	               |			И ВТ_Группы.ВознаграждениеВключаетНДС = ВТ_ДоходыВР.ВознаграждениеВключаетНДС
	               |			И ВТ_Группы.ПериодВО = ВТ_ДоходыВР.ПериодВО
	               |			И ВТ_Группы.Перевыставляемая = ВТ_ДоходыВР.Перевыставляемая
	               |			И ВТ_Группы.УслугаВнеСтавки = ВТ_ДоходыВР.УслугаВнеСтавки
	               |			И ВТ_Группы.ДокументФФД = ВТ_ДоходыВР.ДокументФФД
	               |			И ВТ_Группы.ПТУ = ВТ_ДоходыВР.ПТУ
	               |ИТОГИ
	               |	МАКСИМУМ(МаксимальныйИдентификаторГруппировки)
	               |ПО
	               |	НомерГруппы";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.Доходы", "&Доходы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.Расходы", "&Расходы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Доходы", СделкаОбъект.Доходы.Выгрузить(,"Клиент, Договор, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, ПериодВО, Перевыставляемая, УслугаВнеСтавки, ДокументФФД, ГУИД, ДоплатныеКТК, УчДокумент, ИдентификаторГруппировки"));
	Запрос.УстановитьПараметр("Расходы", СделкаОбъект.Расходы.Выгрузить(,"ГУИД, УчДокумент"));
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить(,"Доходы, Расходы"));
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	

	МаксимальныйИдентификаторГруппировки = 0;
	ВыборкаМаксимальныйИдентификаторГруппировки = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2].Выбрать();
	Пока ВыборкаМаксимальныйИдентификаторГруппировки.Следующий() Цикл
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366702, 16-09-2024, начало
		Если ВыборкаМаксимальныйИдентификаторГруппировки.ИдентификаторГруппировки = NULL Тогда
			Прервать;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0366702, 16-09-2024, конец
		МаксимальныйИдентификаторГруппировки = ВыборкаМаксимальныйИдентификаторГруппировки.ИдентификаторГруппировки;
	КонецЦикла;
	НовыйИдентификаторГруппировки = МаксимальныйИдентификаторГруппировки + 1;
	
	ФлагИзменений = Ложь;
	
	ВыборкаНомерГруппы = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНомерГруппы.Следующий() Цикл
		
		ИдентификаторГруппировки = ВыборкаНомерГруппы.МаксимальныйИдентификаторГруппировки;
		Если ИдентификаторГруппировки = 0 Тогда
			ИдентификаторГруппировки = НовыйИдентификаторГруппировки;
			НовыйИдентификаторГруппировки = НовыйИдентификаторГруппировки + 1;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаНомерГруппы.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Отбор = Новый Структура("ГУИД", ВыборкаДетальныеЗаписи.ГУИД);
			ТекСтрока = СделкаОбъект.Доходы.НайтиСтроки(Отбор)[0];
			ТекСтрока.ИдентификаторГруппировки = ИдентификаторГруппировки;
			ФлагИзменений = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ФлагИзменений Тогда
		СделкаОбъект.Доходы.Сортировать("ИдентификаторГруппировки, Клиент, Договор");
	КонецЕсли;
	
КонецПроцедуры 
//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, конец

// Евросиб US 88683 TA 108959 Рыбьяков К.А. 06.06.2025 ((
Процедура УдалитьДоходнуюСтрокуСвязаннуюСДоплатнымиДанными(СделкаОбъект, Контейнер) Экспорт
	
	//Перед удалением заполним рту, чтобы не удалить строчку, по которой рту создана, но её нет в сделке
	Документы.Сделка.ЗаполнитьУчетныеДокументыВДоходах(СделкаОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Клиент КАК Доплата_Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Договор КАК Доплата_Договор,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция КАК Доплата_Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Доплата_РелизСобственника <> ЗНАЧЕНИЕ(Документ.РелизСобственника.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.Контейнер = &Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.ДоплатныеКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Доходы <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИД = ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
	|		ПО (ВТ_СвязьДоходовИРасходов.Доходы = ВТ_Доходы.ГУИД)
	|			И ВТ_СвязьУчетныхЕдиниц.Доплата_Клиент = ВТ_Доходы.Клиент
	|			И ВТ_СвязьУчетныхЕдиниц.Доплата_Договор = ВТ_Доходы.Договор
	|			И ВТ_СвязьУчетныхЕдиниц.Доплата_Калькуляция = ВТ_Доходы.Калькуляция
	|ГДЕ
	|	(ВТ_Доходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|				ИЛИ ВТ_Доходы.УчДокумент.Ссылка ЕСТЬ NULL)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СделкаСвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&СделкаДоходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СделкаСвязьДоходовИРасходов");
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("СделкаСвязьУчетныхЕдиниц", СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить(,"ГУИД, Доплата_Клиент,
											|Доплата_Договор, Доплата_Калькуляция, Доплата_РелизСобственника, Контейнер"));
	Запрос.УстановитьПараметр("СделкаДоходы", СделкаОбъект.Доходы.Выгрузить(,"УчДокумент, ГУИД, Клиент, Договор, Калькуляция, 
																											|ДоплатныеКТК"));
	Запрос.УстановитьПараметр("СделкаСвязьДоходовИРасходов", СделкаОбъект.СвязьДоходовИРасходов.Выгрузить(,"Доходы, СвязьУчетныхЕдиниц"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивУдаляемыхСтрок = Новый Массив;
	МассивИдентификаторовУдаляемыхСтрок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока = СделкаОбъект.Доходы.НайтиСтроки(Новый Структура("ГУИД", Выборка.ГУИД))[0];
		МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
		МассивИдентификаторовУдаляемыхСтрок.Добавить(ТекущаяСтрока.ГУИД);
	КонецЦикла;
	
	Документы.Сделка.ОчиститьДанныеВВспомогательныхТаблицахНаСервере(СделкаОбъект, МассивИдентификаторовУдаляемыхСтрок,  "Доходы");
	Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		СделкаОбъект.Доходы.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 06.06.2025 ))
