Перем БыстраяЗапись_ПереносРасходов Экспорт;
Перем МассивОтв Экспорт;
//Евросиб - АСуслов 07.12.2022 17:17:56 #51968
//(
Перем НеЗаполнятьРасходы Экспорт;
//)
//Евросиб - АСуслов 07.12.2022 17:17:59 #51968

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
		ГоризонтПоискаНакладных = 40;
		НачалоПериодаИспользованияНовогоАлгоритмаЗаполненияРасходов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НачалоПериодаИспользованияНовогоАлгоритмаЗаполненияРасходов");
		Если ЗначениеЗаполнено(НачалоПериодаИспользованияНовогоАлгоритмаЗаполненияРасходов)
			И ТекущаяДата() >= НачалоПериодаИспользованияНовогоАлгоритмаЗаполненияРасходов Тогда
			НовыйАлгоритмЗаполненияРасходов = Истина;
		КонецЕсли;
	КонецЕсли;
	//Евросиб - АСуслов 07.01.2021 13:37:59 #0213891 
	//(
	//ЦФО = Автор.ЦФО;
	ЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;
	//)
	//Евросиб - АСуслов 07.01.2021 13:38:00 #0213891 
	Подразделение = Автор.Подразделение;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ЕдиныйОтветственныйОтОРК = Автор;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда     
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 86365/TA 86947, 08-08-2024, начало
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			ВызватьИсключение "Запрещено создание Сделки на основании непроведенной Заявки";
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 86365/TA 86947, 08-08-2024, конец
		
		//ДИТ Шевченко А.В. 59982 12.12.2022 -начало
		ДоговорДействует = Истина;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Отправка,Дата(1,1,1),Истина);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Прибытие,Дата(1,1,1),Истина);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Отправка,ДанныеЗаполнения.Прибытие);
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.Договор) И НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Отправка) и НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(ДанныеЗаполнения.Договор,ДанныеЗаполнения.Дата,Дата(1,1,1),Истина);
		КонецЕсли;
		
		Если НЕ ДоговорДействует Тогда
			Автопролонгация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Договор,"Автопролонгация");
			Если Автопролонгация Тогда
				СообщениеТекст = "Документ не может быть создан. Договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
			Иначе
				СообщениеТекст = "Документ не может быть создан. Срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
			КонецЕсли;
			ВызватьИсключение СообщениеТекст;
		КонецЕсли;
		//ДИТ Шевченко А.В. 59982 12.12.2022 -конец
		
		//ДИТ Авдеева В.С. 50072 Начало 08.09.2022	 
		Если Не ПодсылПорожних Тогда
	 		ЗаявкиВДругихСделках = ПерезаполнениеСделкиСервер.ПроверитьНаличиеЗаявкиВДругихСделках(ДанныеЗаполнения, Ссылка);
				
			Если ЗначениеЗаполнено(ЗаявкиВДругихСделках) Тогда   
				ТекстИсключения = "";
				Для Каждого КлючИЗначение Из ЗаявкиВДругихСделках Цикл 
					ТекстИсключения = ТекстИсключения + СтрСоединить(КлючИЗначение.Значение, Символы.ПС);
				КонецЦикла;   
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстИсключения, ДанныеЗаполнения);
				ВызватьИсключение("Не удалось создать документ ""Сделка""");
			КонецЕсли;    
		КонецЕсли;
		//ДИТ Авдеева В.С. 50072 Конец 08.09.2022	
		
		//Евросиб Коханенко Н.А. 04.07.2023 (( #72162
		Если КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(ДанныеЗаполнения.Контрагент) Тогда
		    //выставим поле Подразделение и Региональный ЦФО на вкладке Основное
			Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основное подразделение");
			РегиональныйЦФО = Справочники.РегиональныеЦФО.РасходыДКП;
			//по реквизиту Служебная будет происходить отбор маршрутов
			Служебная = Истина;
		Иначе
			//Евросиб - АСуслов 07.01.2021 13:37:59 #0213891 
			//(
			//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,ЦФО,Подразделение");
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,Подразделение");
			//)
			//Евросиб - АСуслов 07.01.2021 13:38:00 #0213891
		КонецЕсли;
		//Евросиб Коханенко Н.А. 04.07.2023 )) #72162 

		НСтр = Заявки.Добавить();
		НСтр.Заявка = ДанныеЗаполнения;
		//ДИТ Шевченко А.В. Ticket#0278777 19.07.2022 -начало
		Если ДанныеЗаполнения.СоставУслуги.Количество() > 0 Тогда
			НСтр.Калькуляция = ДанныеЗаполнения.СоставУслуги[0].Калькуляция;
		Иначе
			ВызватьИсключение("Отсутствуют услуги в заявке, сделка не будет создана!");
		КонецЕсли;
		//ДИТ Шевченко А.В. Ticket#0278777 19.07.2022 -конец
		ТипЗаказа = НСтр.Калькуляция.ТипЗаказа; 
		// ДИТ US 83871 ТА 85268 Сержантова А.С. Начало: 21.05.2024
		// Было:
		//Если ДанныеЗаполнения.ПереченьРейсов.Количество() > 0 Тогда
		//	НСтр = Рейсы.Добавить();
		//	НСтр.Рейс = ДанныеЗаполнения.ПереченьРейсов[0].Рейс;
		//	СтанцияОтправления = НСтр.Рейс.ПунктОтправления;
		//	СтанцияНазначения = НСтр.Рейс.ПунктНазначения;
		//КонецЕсли; 
		//Стало:
		Для каждого СтрокаРейса Из ДанныеЗаполнения.ПереченьРейсов Цикл
			Если ТипЗнч(СтрокаРейса.Рейс) <> Тип("СправочникСсылка.РейсыАвто") Тогда
				НСтр = Рейсы.Добавить();
				НСтр.Рейс = СтрокаРейса.Рейс;
				СтанцияОтправления = НСтр.Рейс.ПунктОтправления;
				СтанцияНазначения = НСтр.Рейс.ПунктНазначения; 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// ДИТ US 83871 ТА 85268 Сержантова А.С. Конец: 21.05.2024
		
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
Функция ПолучитьМассивИспользованныхСостоянийУчета(); 
	ИспользованныеСостоянияУчета = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("ЗадачаГотовностиКВыставлению");
	Для каждого СтрокаДоходов из Доходы Цикл
		Если ЗначениеЗаполнено(СтрокаДоходов.ЗадачаГотовностиКВыставлению) Тогда 
			ИспользованныеСостоянияУчета.Добавить(СтрокаДоходов.ЗадачаГотовностиКВыставлению); 
		КонецЕсли;
	КонецЦикла;
	Возврат ИспользованныеСостоянияУчета;
КонецФункции 
//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец

//ДИТ, Беляев СЮ, Ticket#0285445, 14-09-2022, начало
Процедура УдалитьЗадачиНеСвязанныеССоставомПоездаИДоходами() 
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению
	             |ПОМЕСТИТЬ ЗадачиСоставаПоезда
	             |ИЗ
	             |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СделкаДоходы.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению
	             |ПОМЕСТИТЬ ЗадачиДоходов
	             |ИЗ
	             |	Документ.Сделка.Доходы КАК СделкаДоходы
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СделкаСостояния.Состояние КАК Состояние
	             |ПОМЕСТИТЬ ТЧСостояния
	             |ИЗ
	             |	Документ.Сделка.Состояния КАК СделкаСостояния
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ТЧСостояния.Состояние КАК Состояние
	             |ИЗ
	             |	ТЧСостояния КАК ТЧСостояния
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ЗадачиСоставаПоезда КАК ЗадачиСоставаПоезда
	             |		ПО ТЧСостояния.Состояние = ЗадачиСоставаПоезда.ЗадачаГотовностиКВыставлению
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ЗадачиДоходов КАК ЗадачиДоходов
	             |		ПО ТЧСостояния.Состояние = ЗадачиДоходов.ЗадачаГотовностиКВыставлению
	             |ГДЕ
	             |	(ТЧСостояния.Состояние В ИЕРАРХИИ (&ГруппаЗадачиСозданияКомплектаДокументов)
	             |			ИЛИ ТЧСостояния.Состояние В ИЕРАРХИИ (&ГруппаЗадачиТребуетсяПеревыставитьРасходы)
				 // Евросиб US 118350 TA 118403 Рыбьяков К.А. 05.09.2025 ((
				 |			ИЛИ ТЧСостояния.Состояние В ИЕРАРХИИ (&ГруппаЗадачиСозданияКомплектаДокументовДопРасходы))
				 // Евросиб Рыбьяков К.А. 05.09.2025 ))
	             |	И ЗадачиСоставаПоезда.ЗадачаГотовностиКВыставлению ЕСТЬ NULL
	             |	И ЗадачиДоходов.ЗадачаГотовностиКВыставлению ЕСТЬ NULL";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&Доходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Состояния", "&Состояния");
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СвязьУчетныхЕдиниц.Выгрузить(,"ЗадачаГотовностиКВыставлению"));
	Запрос.УстановитьПараметр("Доходы", Доходы.Выгрузить(,"ЗадачаГотовностиКВыставлению"));
	Запрос.УстановитьПараметр("Состояния", Состояния.Выгрузить(,"Состояние"));	
	Запрос.УстановитьПараметр("ГруппаЗадачиСозданияКомплектаДокументов", Справочники.Состояния.ЗадачиСозданияКомплектаДокументов);
	Запрос.УстановитьПараметр("ГруппаЗадачиТребуетсяПеревыставитьРасходы", Справочники.Состояния.ЗадачиТребуетсяПеревыставитьРасходы);
	// Евросиб US 118350 TA 118403 Рыбьяков К.А. 05.09.2025 ((
	Запрос.УстановитьПараметр("ГруппаЗадачиСозданияКомплектаДокументовДопРасходы", Справочники.Состояния.ЗадачиТребуетсяСоздатьКомплектДокументовПоДопРасходам);
	// Евросиб Рыбьяков К.А. 05.09.2025 ))
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл                                             
		НайдСтрокаСостояния = Состояния.Найти(Выборка.Состояние, "Состояние");
		Если НайдСтрокаСостояния <> неопределено Тогда
			Состояния.Удалить(НайдСтрокаСостояния);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0285445, 14-09-2022, конец

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	//Евросиб - АСуслов 04.11.2021 17:40:09 #
	//( 
	//перенес из формы
	Документы.Сделка.ЗаполнитьУчетныеДокументыВДоходах(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 04.11.2021 17:40:10 #
	//Евросиб - АСуслов 08.02.2022 14:49:57 #44876
	//(
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьВозможностьОтменыПроведенияСделки(Отказ);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 08.02.2022 14:49:58 #44876
	//Евросиб - АСуслов 25.08.2022 13:32:40 #
	//(
	//МассивУникальныхКТК = Новый Массив;
	//Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.Контейнер) ИЛИ Стр.НеАктивна Тогда Продолжить; КонецЕсли;
	//	Если МассивУникальныхКТК.Найти(Стр.Контейнер) = неопределено Тогда 
	//		МассивУникальныхКТК.Добавить(Стр.Контейнер); 
	//	Иначе
	//		Сообщить("Контейнер встречается в составе поезда несколько раз: " + Стр.Контейнер);
	//		//Отказ = Истина; // SIV 22-03-21 
	//	КонецЕсли;
	//КонецЦикла;
	
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, начало
	//Если НЕ ДополнительныеСвойства.Свойство("ЗаписьОчередьюОтложенногоИзменения") Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 114953 / TA 114960, 22-07-2025, начало
	ЗапуститьУстановкуГотовоКВыставлению = НЕ ДополнительныеСвойства.Свойство("ЗаписьОчередьюОтложенногоИзменения") И НЕ ДополнительныеСвойства.Свойство("ОтключениеГотовоКВыставлениюИзПСЦ");
	Если ЗапуститьУстановкуГотовоКВыставлению Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 114953 / TA 114960, 22-07-2025, конец
		Документы.Сделка.УстановитьГотовоКВыставлению(ЭтотОбъект);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, конец
	
	//)
	//Евросиб - АСуслов 25.08.2022 13:32:40 #   
	
	// ДИТ US 79847 ТА 80505 Сержантова А.С. Начало: 15.05.2024
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	ВсеЗаявкиПроведены = Истина;    
	//	ЗначенияРеквизита = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Заявки.ВыгрузитьКолонку("Заявка"), "Проведен");
	//	Для каждого СтрокаЗаявки Из Заявки Цикл     
	//		Если ЗначениеЗаполнено(СтрокаЗаявки.Заявка) и не ЗначенияРеквизита[СтрокаЗаявки.Заявка].Проведен Тогда
	//			ВсеЗаявкиПроведены = Ложь; 
	//			Сообщение = Новый СообщениеПользователю();
	//			Сообщение.Текст = "" + СтрокаЗаявки.Заявка + " в строке № " + СтрокаЗаявки.НомерСтроки + " на вкладке Заявки не проведена!";
	//			Сообщение.Поле = "Заявки[" + Заявки.Индекс(СтрокаЗаявки) + "].Заявка";
	//			Сообщение.УстановитьДанные(ЭтотОбъект);
	//			Сообщение.Сообщить();
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЦикла;     
	//	ЗначенияРеквизита = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СвязьУчетныхЕдиниц.ВыгрузитьКолонку("Заявка"), "Проведен");
	//	Для каждого СтрокаСвязиУчЕд Из СвязьУчетныхЕдиниц Цикл     
	//		Если ЗначениеЗаполнено(СтрокаСвязиУчЕд.Заявка) и не ЗначенияРеквизита[СтрокаСвязиУчЕд.Заявка].Проведен Тогда
	//			ВсеЗаявкиПроведены = Ложь; 
	//			Сообщение = Новый СообщениеПользователю();
	//			Сообщение.Текст = "" + СтрокаСвязиУчЕд.Заявка + " в строке № " + СтрокаСвязиУчЕд.НомерСтроки + " на вкладке Состав поезда не проведена!";
	//			Сообщение.Поле = "СвязьУчетныхЕдиниц[" + СвязьУчетныхЕдиниц.Индекс(СтрокаСвязиУчЕд) + "].Заявка";
	//			Сообщение.УстановитьДанные(ЭтотОбъект);
	//			Сообщение.Сообщить();
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЦикла; 
	//КонецЕсли;
	// ДИТ US 79847 ТА 80505 Сержантова А.С. Конец: 15.05.2024
	
	// SIV 18-11-20 для поиска пропавших грузов в составе поезда
	//Евросиб Каблов 27.01.2022 ( Task 46219
	//Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.Груз) И ЗначениеЗаполнено(Стр.ЖДН) И Стр.ЖДН.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
	//		Стр.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", Стр.ЖДН.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ);
	//	КонецЕсли;
	//КонецЦикла;
	Документы.Сделка.ЗаполнитьГрузыВТаблицеСвязьУчетныхЕдиниц(СвязьУчетныхЕдиниц);
	//Евросиб Каблов 27.01.2022 )
		
	// -> SIV 06.04.21 
	
	//ТаблКТК = Новый ТаблицаЗначений;
	//ТаблКТК.Колонки.Добавить("КТК");
	//ТаблКТК.Колонки.Добавить("Заявка");
	//Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	//	НСтр = ТаблКТК.Добавить();
	//	НСтр.КТК = Стр.Контейнер;
	//	
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	//               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка
	//               |ИЗ
	//               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//               |ГДЕ
	//               |	СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления = ЛОЖЬ
	//               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.ПодсылПорожних = ЛОЖЬ
	//               |	И СделкаСвязьУчетныхЕдиниц.Контейнер В (&СписокКТК)
	//               |	И СделкаСвязьУчетныхЕдиниц.Ссылка <> &ТекСсылка";
	//Запрос.УстановитьПараметр("ТекСсылка", Ссылка);
	//Запрос.УстановитьПараметр("СписокКТК", СвязьУчетныхЕдиниц.ВыгрузитьКолонки("Контейнер"));
	//Ответ = Запрос.Выполнить().Выбрать();
	//Пока Ответ.Следующий() Цикл
	//	
	//	
	//	
	//КонецЦикла;
	// <- SIV
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	// Евросиб Фролов (26.12.2021 TASK №44663
	ЗаполнитьГУИДСтрокЗаявок();
	// Евросиб Фролов)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	///////////////////////////////////////////////
	
	СписокКлиентовЪ = Новый Массив;
	Для каждого Стр из Заявки Цикл
		Если СписокКлиентовЪ.Найти(Стр.Заявка.Контрагент) = неопределено Тогда СписокКлиентовЪ.Добавить(Стр.Заявка.Контрагент); КонецЕсли;
	КонецЦикла;
	СписокКлиентов = СтрСоединить(СписокКлиентовЪ, "; ");
	
	///////////////////////////////////////////////
	
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = НЕ ЗначениеЗаполнено(Ссылка) ИЛИ Ссылка.Организация <> Организация ИЛИ Состояния.Количество() = 0;
	
	//// ищем рейс ЖД с наибольшей датой прибытия
	
	ДатаНачала = Дата("00010101");
	ДатаПрибытияРейса = Дата;
	Для каждого Стр из Рейсы Цикл
		Если ТипЗнч(Стр.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
			ДатаНачала = Макс(Стр.Рейс.ДатаПрибытия, ДатаНачала);
		КонецЕсли;
	КонецЦикла;
	ДатаПрибытияРейса = ДатаНачала;
	
	// + Дополняем доходы данными доплатных КТК
	// Евросиб Фролов (17.02.2022 Ticket №0259955
	// Перенес код по доплатным КТК в отдельную процедуру
	// Евросиб Фролов (05.05.2022 Task №51113
	ДобавитьДоходыПоДоплатнымКТК();
	//МассивДобавленныхДоходов = Новый Массив;
	//ДобавитьДоходыПоДоплатнымКТК(МассивДобавленныхДоходов);
	// Евросиб Фролов)
	
	//Евросиб - АСуслов 28.09.2021 12:34:08 #33698
	//(
	//ПересчитатьПериодыНаСервере_перенесеноИзФормы(Истина);
	//)
	//Евросиб - АСуслов 28.09.2021 12:34:14 #33698
	
	//КонецЕсли;
	
	
	// - Дополняем доходы данными доплатных КТК
	

	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ОтветственныйЗаУчетПоСделке = Константы.РуководительОтделаРаботыСКлиентами.Получить();
		ОплатаПоОригиналу = Ложь;
		
		Запрос = Новый Запрос;
		// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022
		//Было:
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ВремТЧ.Клиент КАК Клиент,
		//               |	ВремТЧ.Договор КАК Договор,
		//               |	""ЭтаСделка"" КАК Ссылка
		//               |ПОМЕСТИТЬ ВТ
		//               |ИЗ
		//               |	&ВремТЧ КАК ВремТЧ
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.Клиент) КАК КлиентКоличество,
		//               |	ВТ.Ссылка КАК Ссылка
		//               |ПОМЕСТИТЬ КолвоКлиентов
		//               |ИЗ
		//               |	ВТ КАК ВТ
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ВТ.Ссылка
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.Договор.ОтветственныйЗаУчет) КАК КолвоОтветственных,
		//               |	ВТ.Ссылка КАК Ссылка,
		//               |	МАКСИМУМ(ВТ.Договор.ОтветственныйЗаУчет) КАК ОтветственныйЗаУчет,
		//               |	МАКСИМУМ(ВТ.Договор.ОплатаПоОригиналу) КАК ОплатаПоОригиналу
		//               |ПОМЕСТИТЬ КолвоОтветств
		//               |ИЗ
		//               |	ВТ КАК ВТ
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ВТ.Ссылка
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	КолвоКлиентов.Ссылка КАК Ссылка,
		//               |	КолвоКлиентов.КлиентКоличество КАК КлиентКоличество,
		//               |	КолвоОтветств.КолвоОтветственных КАК КолвоОтветственных,
		//               |	КолвоОтветств.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		//               |	КолвоОтветств.ОплатаПоОригиналу КАК ОплатаПоОригиналу
		//               |ИЗ
		//               |	КолвоКлиентов КАК КолвоКлиентов
		//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КолвоОтветств КАК КолвоОтветств
		//               |		ПО КолвоКлиентов.Ссылка = КолвоОтветств.Ссылка"; 
		//Стало:
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВремТЧ.Клиент КАК Клиент,
		               |	ВремТЧ.Договор КАК Договор,
		               |	""ЭтаСделка"" КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВремТЧ КАК ВремТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Ссылка КАК Ссылка,
		               |	Ответственные.Ссылка КАК Договор,
		               |	Ответственные.Ответственный КАК Ответственный
		               |ПОМЕСТИТЬ ВТ_Ответственные
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК Ответственные
		               |		ПО ВТ.Договор = Ответственные.Ссылка
		               |			И (Ответственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
		               |				И Ответственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
		               |ГДЕ
		               |	Ответственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет)
		               |	И Ответственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.Клиент) КАК КлиентКоличество,
		               |	ВТ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ КолвоКлиентов
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Ответственные.Ссылка КАК Ссылка,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Ответственные.Ответственный) КАК КолвоОтветственных,
		               |	МАКСИМУМ(ВТ_Ответственные.Ответственный) КАК ОтветственныйЗаУчет,
		               |	МАКСИМУМ(ВТ_Ответственные.Договор.ОплатаПоОригиналу) КАК ОплатаПоОригиналу
		               |ПОМЕСТИТЬ КолвоОтветств
		               |ИЗ
		               |	ВТ КАК ВТ,
		               |	ВТ_Ответственные КАК ВТ_Ответственные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Ответственные.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КолвоКлиентов.Ссылка КАК Ссылка,
		               |	КолвоКлиентов.КлиентКоличество КАК КлиентКоличество,
		               |	КолвоОтветств.КолвоОтветственных КАК КолвоОтветственных,
		               |	КолвоОтветств.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		               |	КолвоОтветств.ОплатаПоОригиналу КАК ОплатаПоОригиналу
		               |ИЗ
		               |	КолвоКлиентов КАК КолвоКлиентов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КолвоОтветств КАК КолвоОтветств
		               |		ПО КолвоКлиентов.Ссылка = КолвоОтветств.Ссылка";
		// ДИТ US 51951 TA 61497 Евсенкин М.А. 29.11.2022
		
		Запрос.УстановитьПараметр("ВремТЧ",СвязьУчетныхЕдиниц.Выгрузить());
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			Если Ответ.КлиентКоличество = 1 ИЛИ Ответ.КолвоОтветственных = 1 Тогда
				ОтветственныйЗаУчетПоСделке = Ответ.ОтветственныйЗаУчет;
			КонецЕсли;
			ОплатаПоОригиналу = Ответ.ОплатаПоОригиналу;
		КонецЕсли;

		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("МаршрутизируемыйОбъект", Ссылка);
		ПараметрыЗапроса.Вставить("ОплатаПоОригиналу", ОплатаПоОригиналу);
		ПараметрыЗапроса.Вставить("ПодсылПорожних", ПодсылПорожних);
		ПараметрыЗапроса.Вставить("ПовагонныеОтправки", ПовагонныеОтправки);
		ПараметрыЗапроса.Вставить("ОтветственныйПоСделке", "НЕТ");
		// Евросиб Фролов (12.04.2022 Task №46871
		ПараметрыЗапроса.Вставить("СлужебнаяСделка", Служебная);
		// Евросиб Фролов)
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСделку(ПараметрыЗапроса, Дата);
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
		
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	ПерваяСтрока = Истина;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// SIV 28-05-21 Задачи, связанные с работой кнопки "Исключить КТК из сделки":
	// 1. Если на исключаемые КТК был сформирован РТУ, то нужно поставить задачу коррекции комплекта документов
	//УдалениеКТКИзСделки_Сервер.ПостановкаЗадачиВСлучаеИсключенияКТКИзСделкиПриНаличииРТУ_Сделка(ЭтотОбъект);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		
		// обработка расчета норматива исполнения
		Если ЗначениеЗаполнено(Стр.ВидНормативаИсполнения) И НЕ Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента Тогда
			Стр.НормативИсполненияСМоментаСоздания = МаршрутизацияСервер.РасчетНормативаИсполнения(Стр.ВидНормативаИсполнения,Ссылка,ДатаНачала,Ссылка);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ВидНормативаИсполнения) Тогда
			Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		КонецЕсли;
		// проверка на установленный флаг ИсполнительКакОтветственныйЗаУчет
		Если Стр.ИсполнительКакОтветственныйЗаУчет И ЗначениеЗаполнено(ОтветственныйЗаУчетПоСделке) Тогда
			Стр.Исполнитель = ОтветственныйЗаУчетПоСделке;
		КонецЕсли;
		// если сделка создана для повагонки, то исполнитель на первое состояние из константы
		Если ПерваяСтрока И (ЗначениеЗаполнено(ДатаНачалаПериодаПовагонки) ИЛИ 
			ЗначениеЗаполнено(ДатаОкончанияПериодаПовагонки)) Тогда
			Стр.Исполнитель = Константы.ГруппаИнформируемыхОВключенииВагонаВСделку.Получить();
			ПерваяСтрока = Ложь;
		КонецЕсли;
		
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	ПредыдущееСостояние = Неопределено; //Гудкова
	Для каждого Состояние из Состояния Цикл
		Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
			//ТекущееСостояние = Состояние.Состояние;
			Прервать;
		КонецЕсли;
		ПредыдущееСостояние = Состояние; //Гудкова
	КонецЦикла;
		
	// - Состояния
	
	// Евросиб Фролов (14.04.2022 Task №50195
	Если ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
		
		//Евросиб Гудкова( 13.11.2019 Ticket№ 0180043 автоматический запуск фактических ТСх в работу
		//определим, что создание ТСх завершено	
		Если ЗначениеЗаполнено(ПредыдущееСостояние) И ПредыдущееСостояние.Статус = Перечисления.СтатусыЭтапов.Выполнен 
			И ПредыдущееСостояние.Состояние.ЗапускатьТСхФактПриИсполнении 
			И ПредыдущееСостояние.Статус <> Ссылка.Состояния.Найти(ПредыдущееСостояние.Состояние, "Состояние").Статус Тогда
			МассивТСх = ПостроительТСх_сервер.ПолучитьТСхОбъекта(Ссылка, "Фактическая");
			МассивОпераций = Новый Массив;
			//найти все операции верхнего уровня для всех фактических схем
			Для каждого СтрокаТСх Из МассивТСх Цикл
				Схема = СтрокаТСх.ТСх;
				Если ЗначениеЗаполнено(Схема) Тогда
					Для каждого СтрокаСхемы Из Схема.ТЧ Цикл
						Если Не ЗначениеЗаполнено(СтрокаСхемы.Родитель1) Тогда
							МассивОпераций.Добавить(СтрокаСхемы.Операция);
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли;
			КонецЦикла;
			//запустить их в работу
			Для каждого Операция Из МассивОпераций Цикл
				ОперацииСервер.ЗапуститьВРаботуИОтметитьДатуНачала(Операция, ТекущаяДата());
			КонецЦикла; 
		КонецЕсли; 
		// Евросиб Гудкова)
		
	КонецЕсли;
	// Евросиб Фролов)
	
	// SIV 25-05-21 -->
	//ТребуетсяЗадачаНаПрикреплениеСлужебки = Ложь;
	//Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	//	Если ЗначениеЗаполнено(Стр.Заявка) И Стр.Заявка.ВидПеревозки.СтавитьЗадачуПрикрепленияСлужебнойЗапискиВСделке = Истина Тогда
	//		ТребуетсяЗадачаНаПрикреплениеСлужебки = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ИскСостояние = Справочники.Состояния.ТребуетсяПрикрепитьСлЗаписку;
	//НайдСтр123 = Состояния.Найти(ИскСостояние, "Состояние");
	//Если ТребуетсяЗадачаНаПрикреплениеСлужебки = Ложь Тогда
	//	Если НайдСтр123 <> неопределено Тогда
	//		Состояния.Удалить(НайдСтр123);
	//	КонецЕсли;
	//Иначе
	//	Если НайдСтр123 = неопределено Тогда
	//		
	//		НСтрСостСлужебка = Состояния.Добавить();
	//		НСтрСостСлужебка.Исполнитель = ЕдиныйОтветственныйОтОРК;
	//		НСтрСостСлужебка.Наблюдатель = НСтрСостСлужебка.Исполнитель;
	//		НСтрСостСлужебка.Комментарий = "Добавлено автоматически по факту наличия галки ""требуется служебка"" в одной из заявок";
	//		НСтрСостСлужебка.Состояние = ИскСостояние;
	//		НСтрСостСлужебка.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	//		
	//	КонецЕсли;
	//КонецЕсли;
	// SIV 25-05-21 <--
	
	// Поморцева Т.П. Задача 37052 25.04.22. начало
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	// После того, как в сделку добавляется информация по доплатным КТК, внутри сделки 
	// создается задача по формированию комплекта документов на услуги доплаты.
	// В состояние задачи добавить указание о доплатных КТК: Требуется создать комплект документов (Доплаты)
	//МассивОбновленныхКТК = Новый Массив;
	//Если ДополнительныеСвойства.Свойство("ОбновленныеДоплатныеКТК", МассивОбновленныхКТК) Тогда
	//	
	//	ИспользованныеСостояния = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("ЗадачаГотовностиКВыставлению");
	//	Для Каждого ТекущаяСтрока Из Доходы Цикл
	//		Если ЗначениеЗаполнено(ТекущаяСтрока.ЗадачаГотовностиКВыставлению) Тогда
	//			ИспользованныеСостояния.Добавить(ТекущаяСтрока.ЗадачаГотовностиКВыставлению);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	СостояниеСозданияКомплектаДокументов = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостояния);
	//	НайденноеСостояние = Состояния.Найти(СостояниеСозданияКомплектаДокументов, "Состояние");
	//	Если НайденноеСостояние = Неопределено Тогда
	//		СтрокаСостояния = Состояния.Добавить();
	//		СтрокаСостояния.Исполнитель = ЕдиныйОтветственныйОтОРК;
	//		СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
	//		СтрокаСостояния.Комментарий = "Доплата. Обновленные КТК: " + СтрСоединить(МассивОбновленныхКТК, ", "); // Евросиб Фролов. 18.02.2022 Task №47431. Добавил "Доплата" вначале.																										  
	//		СтрокаСостояния.Состояние = СостояниеСозданияКомплектаДокументов;
	//		СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	//	КонецЕсли;
	//КонецЕсли;	
	// Евросиб Фролов)
    // Поморцева Т.П. Задача 37052 25.04.22. конец

	// Евросиб Фролов (09.03.2022 Task №44927
	// При установке галки "Готово к выставлению (фрахт)", на сотрудника, ответственного за учет по договору с клиентом,
	// должна быть создана задача "Требуется создать комплект документов".
	ДобавитьЗадачуВыставленияДокументовПоФрахту();
	// Евросиб Фролов)
	
	//////////// Проставляем дату первой и последней операции автоматически SIV 2020-01-20
	МассивТСх = ПостроительТСх_сервер.ПолучитьТСхОбъекта(Ссылка, "Фактическая");
	Если МассивТСх.Количество() > 0 И  МассивТСх[0].ТСх <> неопределено Тогда
		Для каждого Стр из МассивТСх[0].ТСх.ТЧ Цикл
			ДатаОтправления = ?(ЗначениеЗаполнено(Стр.ДатаОтправленияФакт), Стр.ДатаОтправленияФакт, Стр.ДатаОтправления);
			Если НЕ ЗначениеЗаполнено(ПерваяОперация) И ЗначениеЗаполнено(ДатаОтправления) Тогда
				ПерваяОперация = ДатаОтправления;
			ИначеЕсли ЗначениеЗаполнено(ПерваяОперация) И ЗначениеЗаполнено(ДатаОтправления) Тогда
				ПерваяОперация = Мин(ПерваяОперация, ДатаОтправления);
			КонецЕсли;
			
			ДатаНазначения = ?(ЗначениеЗаполнено(Стр.ДатаНазначенияФакт), Стр.ДатаНазначенияФакт, Стр.ДатаНазначения);
			Если НЕ ЗначениеЗаполнено(ПоследняяОперация) И ЗначениеЗаполнено(ДатаНазначения) Тогда
				ПоследняяОперация = ДатаНазначения;
			ИначеЕсли ЗначениеЗаполнено(ПоследняяОперация) И ЗначениеЗаполнено(ДатаНазначения) Тогда
				ПоследняяОперация = Макс(ПерваяОперация, ДатаНазначения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// снимаем флаг фонового создания, т.к. он нам нужен только на время заполнения состояний
	ФоновоеСоздание = Ложь;
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	
	// SIV 11 августа новая сделка
	
	// 1. Пропишем в сделки номера коносаментов, если коносаменты указаны. это нужно, чтобы сгруппировать выставляемые документы по коносаментам
	// Евросиб Фролов (14.04.2022 Task №50195
	Если ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
		// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Начало: 26.11.2024
		//Для каждого Заявка из Заявки Цикл
		//	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Начало: 26.11.2024
		//	//НадоЗаписать = Ложь;
		//	//ЗОбъект = Заявка.Заявка.ПолучитьОбъект();
		//	//
		//	//// Евросиб Фролов (14.04.2022 Task №50195
		//	//Попытка
		//	//	ЗОбъект.Заблокировать();
		//	//// Евросиб Фролов)
		//	//	Для каждого СтрКТК из СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка", Заявка.Заявка)) Цикл
		//	//		Если НЕ ЗначениеЗаполнено(СтрКТК.Коносамент) И НЕ ЗначениеЗаполнено(СтрКТК.ВремяПрибытияНаТерминал) тогда Продолжить; КонецЕсли;
		//	//		Для каждого СтрЗКТК из ЗОбъект.СоставУслуги.НайтиСтроки(Новый Структура("НомерКТК", СтрКТК.Контейнер)) Цикл
		//	//			Если НЕ ЗначениеЗаполнено(СтрЗКТК.РеестрКлиента) И ЗначениеЗаполнено(СтрКТК.Коносамент.НомерТранспортногоДокумента) Тогда
		//	//				СтрЗКТК.РеестрКлиента = СтрКТК.Коносамент.НомерТранспортногоДокумента;
		//	//				НадоЗаписать = Истина;					
		//	//			КонецЕсли;
		//	//			Если НЕ ЗначениеЗаполнено(СтрЗКТК.ВремяПрибытияНаТерминал) И ЗначениеЗаполнено(СтрКТК.ВремяПрибытияНаТерминал) Тогда
		//	//				СтрЗКТК.ВремяПрибытияНаТерминал = СтрКТК.ВремяПрибытияНаТерминал;
		//	//				НадоЗаписать = Истина;					
		//	//			КонецЕсли;
		//	//		КонецЦикла;
		//	//	КонецЦикла;
		//	//	Если НадоЗаписать Тогда
		//	//		//Попытка // Евросиб Фролов (14.04.2022 Task №50195, закомментировал, перенес выше
		//	//			ЗОбъект.Записать(?(ЗОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		//	//		//Исключение
		//	//		//КонецПопытки;
		//	//	КонецЕсли;
		//	//	
		//	//// Евросиб Фролов (14.04.2022 Task №50195	
		//	//Исключение
		//	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись в заявку номеров коносаментов и времени прибытия на терминал.'", Метаданные.ОсновнойЯзык.КодЯзыка),
		//	//				УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Заявка, ЗОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//	//				
		//	//	ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось сохранить номера коносаментов и время прибытия на терминал в заявку №%1 от %2.
		//	//                                     |Ошибка: %3'"),
		//	//										ЗОбъект.Номер,
		//	//										ЗОбъект.Дата,
		//	//										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
		//	//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗОбъект);				
		//	//КонецПопытки;
		//	//// Евросиб Фролов)
		//	
		//	//ДИТ, Беляев СЮ, BUG 51934\TASK 57123, 05-04-2023, начало
		//	ЗОбъект = Заявка.Заявка.ПолучитьОбъект();
		//	НадоЗаписать_РеестрКлиента = Ложь;
		//	НадоЗаписать_ВремяПрибытияНаТерминал = Ложь;    
		//	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024 
		//	//Если по заявке из строки состава поезда удалили рейс, то удалим рейс из заявки  
		//	НадоЗаписатьРейсыЗаявки = Ложь;
		//	СтрокиДоЗаписи = Ссылка.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка", Заявка.Заявка)); 
		//	РейсыЗаявкиДоЗаписи = Новый Массив;
		//	Для каждого СтрокаСУЕдоЗаписи Из СтрокиДоЗаписи Цикл 
		//		Если ЗначениеЗаполнено(СтрокаСУЕдоЗаписи.ЖДРейс)
		//			и СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка,ЖДРейс", Заявка.Заявка, СтрокаСУЕдоЗаписи.ЖДРейс)).Количество() = 0 
		//			Тогда   
		//			ПоискСтрокиРейса = Новый Структура("Рейс, Пользователь", СтрокаСУЕдоЗаписи.ЖДРейс, Справочники.Пользователи.ПустаяСсылка());
		//		    СтрокиРейсаКУдалению = ЗОбъект.ПереченьРейсов.НайтиСтроки(ПоискСтрокиРейса);
		//			Для каждого СтрокаРейсаКУдалению Из СтрокиРейсаКУдалению Цикл
		//				ЗОбъект.ПереченьРейсов.Удалить(СтрокаРейсаКУдалению); 
		//				НадоЗаписатьРейсыЗаявки = Истина;
		//			КонецЦикла;
		//		КонецЕсли;
		//	КонецЦикла;
		//	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		//	Для каждого СтрокаСУЕ из СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка", Заявка.Заявка)) Цикл 
		//		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
		//		// Добавляем рейсы в заявку
		//		Если ЗначениеЗаполнено(СтрокаСУЕ.ЖДРейс) и Рейсы.Найти(СтрокаСУЕ.ЖДРейс) <> Неопределено 
		//			и ЗОбъект.ПереченьРейсов.Найти(СтрокаСУЕ.ЖДРейс, "Рейс") = Неопределено Тогда
		//			СтрокаРейса = ЗОбъект.ПереченьРейсов.Добавить(); 
		//			СтрокаРейса.Рейс = СтрокаСУЕ.ЖДРейс;  
		//			СтрокаРейса.Продукт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.ЖДРейс, "Продукт");
		//			НадоЗаписатьРейсыЗаявки = Истина;
		//		КонецЕсли;
		//		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		//		Если НЕ ЗначениеЗаполнено(СтрокаСУЕ.Коносамент) И НЕ ЗначениеЗаполнено(СтрокаСУЕ.ВремяПрибытияНаТерминал) Тогда 
		//			Продолжить; 
		//		КонецЕсли;
		//		Для каждого СтрокаЗаявки из ЗОбъект.СоставУслуги.НайтиСтроки(Новый Структура("ГУИДСтроки", СтрокаСУЕ.ГУИДСтрокиЗаявки)) Цикл
		//			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.НомерКТК) Тогда
		//				Продолжить;
		//			КонецЕсли;
		//			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.РеестрКлиента) И ЗначениеЗаполнено(СтрокаСУЕ.Коносамент.НомерТранспортногоДокумента) Тогда
		//				СтрокаЗаявки.РеестрКлиента = СтрокаСУЕ.Коносамент.НомерТранспортногоДокумента;
		//				НадоЗаписать_РеестрКлиента = Истина;					
		//			КонецЕсли;
		//			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.ВремяПрибытияНаТерминал) И ЗначениеЗаполнено(СтрокаСУЕ.ВремяПрибытияНаТерминал) Тогда
		//				СтрокаЗаявки.ВремяПрибытияНаТерминал = СтрокаСУЕ.ВремяПрибытияНаТерминал;
		//				НадоЗаписать_ВремяПрибытияНаТерминал = Истина;					
		//			КонецЕсли;
		//		КонецЦикла;
		//	КонецЦикла;
		//	
		//	Если НадоЗаписать_РеестрКлиента ИЛИ НадоЗаписать_ВремяПрибытияНаТерминал 
		//		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
		//		ИЛИ НадоЗаписатьРейсыЗаявки Тогда
		//		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		//		СтрЗаписываемыеРеквизиты = "";
		//		Если НадоЗаписать_РеестрКлиента Тогда
		//			СтрЗаписываемыеРеквизиты = "номера Коносаментов";
		//		КонецЕсли;
		//		Если НадоЗаписать_ВремяПрибытияНаТерминал Тогда
		//			СтрЗаписываемыеРеквизиты = СтрЗаписываемыеРеквизиты + ?(ЗначениеЗаполнено(СтрЗаписываемыеРеквизиты)," и ","" );
		//			СтрЗаписываемыеРеквизиты = СтрЗаписываемыеРеквизиты + "Время прибытия на терминал";
		//		КонецЕсли;
		//		
		//		ФлагУспешнойБлокировкиЗаявки = Истина;
		//		Попытка
		//			ЗОбъект.Заблокировать();
		//		Исключение
		//			ФлагУспешнойБлокировкиЗаявки = Ложь;
		//			ТекстСообщения = СтрШаблон("Не удалось сохранить %1 в Заявку №%2 от %3.
		//				|Закройте Заявку №%2 и повторите попытку",
		//				СтрЗаписываемыеРеквизиты,
		//				ЗОбъект.Номер,
		//				ЗОбъект.Дата);
		//				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗОбъект);	
		//		КонецПопытки;
		//			
		//		Если ФлагУспешнойБлокировкиЗаявки Тогда
		//			Попытка
		//				ЗОбъект.Записать(?(ЗОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		//			Исключение
		//				ТекстСообщения = СтрШаблон("Не удалось сохранить %1 в Заявку №%2 от %3.
		//					|Ошибка: %4",
		//					СтрЗаписываемыеРеквизиты,
		//					ЗОбъект.Номер,
		//					ЗОбъект.Дата,
		//					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		//					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗОбъект);			
		//			КонецПопытки;
		//		КонецЕсли;
		//	КонецЕсли;
		//	//ДИТ, Беляев СЮ, BUG 51934\TASK 57123, 05-04-2023, конец
		//	
		//	
		//КонецЦикла;
		// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Конец: 26.11.2024
	КонецЕсли;
	// Евросиб Фролов)
	
	// Теперь нарисуем ответственных за ОРК и за сопровождение путем анализа договоров
	Если НЕ ЗначениеЗаполнено(ЕдиныйОтветственныйОтОРК) тогда
		
		ОтветственныеПоСОПР = Новый Массив;
		Для каждого Стр3 из СвязьУчетныхЕдиниц Цикл
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
			// Было:
			//Если ОтветственныеПоСОПР.Найти(Стр3.Договор.ОтветственныйЗаСопровождение) = неопределено Тогда ОтветственныеПоСОПР.Добавить(Стр3.Договор.ОтветственныйЗаСопровождение); КонецЕсли;
			//Стало:
			//мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(Стр3.Договор,"ОтветственныйЗаСопровождение");
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Договор",				Стр3.Договор);
			СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
			СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
			мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
			Если ОтветственныеПоСОПР.Найти(мОтветственныйЗаСопровождение) = неопределено Тогда 
				ОтветственныеПоСОПР.Добавить(мОтветственныйЗаСопровождение); 
			КонецЕсли;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		КонецЦикла;
		Если ОтветственныеПоСОПР.Количество() = 1 Тогда
			ЕдиныйОтветственныйОтОРК = ОтветственныеПоСОПР[0];
		Иначе
			ЕдиныйОтветственныйОтОРК = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ЕдиныйОтветственныйОтУчета) Тогда
	//	
	//	ОтветственныеПоУчету = Новый Массив;
	//	Для каждого Стр3 из СвязьУчетныхЕдиниц Цикл
	//		Если ОтветственныеПоУчету.Найти(Стр3.Договор.ОтветственныйЗаУчет) = неопределено Тогда ОтветственныеПоУчету.Добавить(Стр3.Договор.ОтветственныйЗаУчет); КонецЕсли;
	//	КонецЦикла;
	//	Если ОтветственныеПоУчету.Количество() = 1 Тогда ЕдиныйОтветственныйОтУчета = ОтветственныеПоУчету[0]; КонецЕсли;
	//	
	//КонецЕсли;
	
	// дальше поставим задачу назначить ответственного по учету, если этого еще не сделали
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208861 только для груженых
//Евросиб Гудкова( 08.10.2020 Ticket№ 0209352 и только для тех, у кого состав поезда уже заполнен

//Евросиб Максимова 26022021

//Проверим Сколько клиентов в сделке
	
	//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, начало (закомментировал, перенес ниже, т.к. статус по задаче будет ясен только после проверки задач по выставлению документов)
	#Область ЗадачаТребуетсяНазначитьЕдиногоОтветственногоЗаУчет_СтарыйАлгоритм
	//РазныеОтветственные=Новый Массив;
	////Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	////ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, начало
	//СтрокиСУЕсЗаполненнымиПолямиДляЗадач = ПолучитьСтрокиСУЕсЗаполненнымиПолямиДляЗадач();
	//Для каждого Стр из СтрокиСУЕсЗаполненнымиПолямиДляЗадач Цикл
	////ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, конец
	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. начало			
	//	//Ответственный=ПолучитьОтветственногоПоДоговору(Стр.Договор,Стр.Заявка.ЦФО);
	//	Ответственный = ОпределитьОтветственного(Стр);
	//	Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. конец
	//		Если РазныеОтветственные.Найти(Ответственный) = Неопределено Тогда
	//			РазныеОтветственные.Добавить(Ответственный);
	//		КонецЕсли;		
	//	КонецЕсли;
	//КонецЦикла;

	////ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
	//НеактуальныеОтветственныеВДоходах = ПроверитьНеактуальныхОтветственныхПоЗадачамВДоходах();
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РазныеОтветственные, НеактуальныеОтветственныеВДоходах, Истина);
	////ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец

	//Если Не ПодсылПорожних
	//    //++ДИТ Гаузер А.В. US 43469 TA 49481 21.04.2022
	//	И НЕ Служебная
	//	//--ДИТ Гаузер А.В. US 43469 TA 49481 21.04.2022
	//	//И НЕ ЗначениеЗаполнено(ЕдиныйОтветственныйОтУчета) 
	//	//И СвязьУчетныхЕдиниц.Количество() > 0
	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//	//и РазныеОтветственные.Количество()>1
	//	И РазныеОтветственные.Количество() > 0 
	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. конец
	//	//++ДИТ Гаузер А.В. Ticket#0252064 03.08.2022
	//	//И Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет)).Количество() = 0 Тогда
	//	//И Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет)).Количество() = 0 //ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, закомментировал 
	//	//И (Заявки.Количество() И ЕстьЗаполненныеРеквизитыВТЧСвязьУчетныхЕдиниц())
	//	//ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, начало
	//	И Заявки.Количество()
	//	//ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, конец
	//	Тогда
	//	//--ДИТ Гаузер А.В. Ticket#0252064 03.08.2022
	//	
	////		НСтр = Состояния.Добавить();
	//////Евросиб Гудкова( 04.10.2020 Ticket№ 0208803
	//////было		НСтр.Исполнитель = Константы.ИсполнительЗадачиНазначенияОтветственногоЗаУчетПоСделке.Получить();
	////		НСтр.Исполнитель = ЦФО.ОтветственныйЗаУчет;
	////// Евросиб Гудкова) 		
	////		НСтр.Наблюдатель = НСтр.Исполнитель;
	////		НСтр.НачалоРаботы = ТекущаяДата();
	////		НСтр.Состояние = Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет;
	////		НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		
	//		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
	//		НайденныеЗадачи = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет));
	//		Если НайденныеЗадачи.Количество() = 0 Тогда
	//			НСтр = Состояния.Добавить();
	//			НСтр.Исполнитель = ЦФО.ОтветственныйЗаУчет;
	//			НСтр.Наблюдатель = НСтр.Исполнитель;
	//            НСтр.НачалоРаботы = ТекущаяДата();
	//			НСтр.Состояние = Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет;
	//			НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Иначе
	//			ЗадачаНазначитьОтвественного = НайденныеЗадачи[0];
	//			Если ЗадачаНазначитьОтвественного.Статус <> Перечисления.СтатусыЭтапов.НаВыполнение Тогда
	//				ЗадачаНазначитьОтвественного.Исполнитель = ЦФО.ОтветственныйЗаУчет;
	//				ЗадачаНазначитьОтвественного.Наблюдатель = ЗадачаНазначитьОтвественного.Исполнитель;
	//	            ЗадачаНазначитьОтвественного.НачалоРаботы = ТекущаяДата();
	//				ЗадачаНазначитьОтвественного.Состояние = Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет;
	//				ЗадачаНазначитьОтвественного.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//			КонецЕсли;
	//		КонецЕсли;
	//		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
	//		
	//	КонецЕсли;
	//	
	////Евросиб Гудкова( 04.10.2020 Ticket№ 0208861 только для груженых
	//	Если Не ПодсылПорожних И ЗначениеЗаполнено(ЕдиныйОтветственныйОтУчета) И Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет)).Количество() > 0 Тогда
	//		
	//		НайдСтрока = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет));
	//		НайдСтрока[0].Статус = Перечисления.СтатусыЭтапов.Выполнен;
	//		
	//	КонецЕсли; 

	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//	Если Не ПодсылПорожних И РазныеОтветственные.Количество() = 0 И Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет)).Количество() > 0 Тогда 
	//		НайдСтрока = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет));
	//		НайдСтрока[0].Статус = Перечисления.СтатусыЭтапов.Выполнен;
	//	КонецЕсли;
	//	// ДИТ Поморцева Т.П. 32343 12.10.2021. конец	
		
		//Если РазныеОтветственные.Количество()=1 Тогда
		//	КомуСтавитсяЗадачаПоДокументам=1;
		//КонецЕсли;
	#КонецОбласти
	//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, конец
	
	// теперь отметим в общем списке, по каким клиентам была сформирована экономика, а по каким нет.
	ИспользуютсяКоносаменты = Ложь;
	Для каждого Стр из СвязьУчетныхЕдиниц Цикл Стр.ДокументыСформированы = Ложь; ИспользуютсяКоносаменты = ИспользуютсяКоносаменты ИЛИ ЗначениеЗаполнено(Стр.Коносамент); КонецЦикла;
	//сбросим у всех строк признаки выставления и готовности документов
	//Евросиб - АСуслов 22.09.2020 15:18:59 #0207671 
	//(
	//Для каждого СтрСУЕ Из СвязьУчетныхЕдиниц Цикл  //ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, закомментировал (перенесено в процедуру ЗаполнитьСформированоВыставлено)
	//	СтрСУЕ.ДокументыВыставлены = Ложь;
	//	СтрСУЕ.ДокументыСформированы = Ложь;
	//КонецЦикла; 
	//)
	
	// SIV 27.11.2020 - все закомментил
	// {{ !!!!! 
	// Я в итоге так и не понял, какая логика здесь закладывалась, поэтому решил просто переписать его. Если мой код будет хуже, чем этот, напишите пожалуйста краткий мануал, что тут вообще происходит.
	
	//Евросиб - АСуслов 22.09.2020 15:18:59 #0207671 
	//Если НЕ БыстраяЗапись_ПереносРасходов Тогда // Шейко О.Е. 23.11.2020. Немного выиграем в скорости записи
	//
	//	Для каждого Стр из Доходы Цикл
	//		
	//		Если НЕ ЗначениеЗаполнено(Стр.УчДокумент) Тогда Продолжить; КонецЕсли;
	//		
	//		//СтруктураПоиска = Новый Структура("Договор", Стр.Договор);
	//		//Если ИспользуютсяКоносаменты И ЗначениеЗаполнено(Стр.РеестрКлиента) тогда
	//		//	
	//		//	КоносСсылка = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(Стр.РеестрКлиента, Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент);
	//		//	СтруктураПоиска.Вставить("Коносамент", КоносСсылка);
	//		//	
	//		//КонецЕсли;
	//		//найдем строки СУЕ по ГУИДу дохода
	//		СтрокиСвязиДоходовСУЕ = СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы", Стр.ГУИД));
	//		Для каждого СтрокаСвязиДоходовСУЕ Из СтрокиСвязиДоходовСУЕ Цикл
	//			СтрокаСУЕ = СвязьУчетныхЕдиниц.Найти(СтрокаСвязиДоходовСУЕ.СвязьУчетныхЕдиниц, "ГУИД");
	//			Если СтрокаСУЕ <> Неопределено Тогда
	//				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.УчДокумент, "Проведен, Выставлен");
	//				СтрокаСУЕ.ДокументыСформированы = РеквизитыДокумента.Проведен;
	//				СтрокаСУЕ.ДокументыВыставлены = РеквизитыДокумента.Выставлен;
	//			КонецЕсли; 
	//		КонецЦикла; 
	//		
	//		//Для каждого Стр3 из СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска) Цикл
	//		//	
	//		//	Стр3.ДокументыСформированы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.УчДокумент, "Проведен");
	//		//	Стр3.ДокументыВыставлены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.УчДокумент, "Выставлен");
	//		//	
	//		//КонецЦикла;
	//		
	//	КонецЦикла;
	//
	//КонецЕсли;
	// }}  !!!!!	
	
	Если НЕ БыстраяЗапись_ПереносРасходов Тогда
		
		//РаботаСоСделкамиСервер.ЗаполнитьРасходыПоСделке_старая(ЭтотОбъект);
		//РаботаСоСделкамиСервер.ЗаполнитьРасходыПоСделке(ЭтотОбъект);
		Если НовыйАлгоритмЗаполненияРасходов Тогда
			РаботаСоСделкамиСервер.ЗаполнитьРасходы(ЭтотОбъект);
		Иначе
			РаботаСоСделкамиСервер.ЗаполнитьРасходыПоСделке_СтарыйАлгоритм(ЭтотОбъект);
		КонецЕсли; 
		//Евросиб - АСуслов 28.07.2022 12:52:09 #55052
		//(
		//перенес в заполнитьрасходы();
		//ПривязатьРасходыСУслугойНаДоходыПоОсновнойУслуге();
		//)
		//Евросиб - АСуслов 28.07.2022 12:52:09 #55052
		УдалитьСтрокиРасходовПоУдаленнымСтрокамСУЕ();
			// Режим 1 - используя таблицу СвязьДоходовИРасходов и ГИУДы, которые туда пишутся. К сожалению, этот механизм не работает, ГУИДы заполняются рандомно и доверять ему сейчас нельзя
			// Режим 2 - старый механизм на с опорой на договор или коносамент.
			// Режим 3 - запросом
			РежимРаботы = 3;
			
			//ДИТ, Беляев СЮ, Ticket#0270168, 29-04-2022, Закомментировал РежимРаботы=1 и 2, не используются
			//Если РежимРаботы = 1 Тогда			
			//	
			//	Для каждого Стр из СвязьУчетныхЕдиниц Цикл
			//		МассивСтрокДоходов = Новый Массив;
			//		Для каждого Стр2 из СвязьДоходовИРасходов Цикл
			//			Если Стр2.Доходы <> "" И Стр2.СвязьУчетныхЕдиниц = Стр.ГУИД И МассивСтрокДоходов.Найти(Стр2.Доходы) = неопределено Тогда
			//				МассивСтрокДоходов.Добавить(Стр2.Доходы);
			//			КонецЕсли;
			//		КонецЦикла;
			//		
			//		ЕстьСтрокаБезРеализации = Ложь;
			//		МассивРеализаций = Новый Массив;
			//		Для каждого ИскСтрокаДоходов из МассивСтрокДоходов Цикл
			//			
			//			НайдДоходы = Доходы.НайтиСтроки(Новый Структура("ГУИД", ИскСтрокаДоходов));
			//			Для каждого Стр3 из НайдДоходы Цикл
			//				Если Стр3.НеВыставлятьКлиенту Тогда Продолжить; КонецЕсли;
			//				Если ЗначениеЗаполнено(Стр3.УчДокумент) Тогда
			//					Если МассивРеализаций.Найти(Стр3.УчДокумент) = неопределено Тогда МассивРеализаций.Добавить(Стр3.УчДокумент); КонецЕсли;
			//				Иначе
			//					ЕстьСтрокаБезРеализации = Истина;
			//				КонецЕсли;
			//			КонецЦикла;
			//			
			//		КонецЦикла;
			//		
			//		КоличествоПроведенных = 0;
			//		КоличествоВыставленных = 0;
			//		
			//		Для каждого Стр3 из МассивРеализаций Цикл
			//			
			//			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр3, "Проведен, Выставлен");
			//			КоличествоПроведенных = КоличествоПроведенных + ?(РеквизитыДокумента.Проведен = Истина, 1, 0);
			//			КоличествоВыставленных = КоличествоВыставленных + ?(РеквизитыДокумента.Выставлен = Истина, 1, 0);
			//			
			//		КонецЦикла;
			//		
			//		Стр.ДокументыСформированы = МассивРеализаций.Количество() > 0 И (МассивРеализаций.Количество() = КоличествоПроведенных);
			//		Стр.ДокументыВыставлены = МассивРеализаций.Количество() > 0 И (МассивРеализаций.Количество() = КоличествоВыставленных);
			//	КонецЦикла;
			//	
			//ИначеЕсли РежимРаботы = 2 Тогда
			//	
			//	Для каждого Стр2 из Доходы Цикл
			//		
			//		Если НЕ ЗначениеЗаполнено(Стр2.УчДокумент) ИЛИ Стр2.НеВыставлятьКлиенту Тогда Продолжить; КонецЕсли;
			//		
			//		НайдКТК = ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", Стр2.ГУИД));
			//		Если НайдКТК.Количество() > 0 Тогда
			//			
			//			МассивКТК = СтрРазделить(НайдКТК[0].КТК, ";", Ложь);
			//			Для каждого КТКЪ из МассивКТК Цикл
			//				
			//				КТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(КТКЪ, Ложь);
			//				НайдСвязи = СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Контейнер, Договор", КТКСсылка, Стр2.Договор));
			//				Для каждого СтрНайдСвязи из НайдСвязи Цикл
			//					
			//					СтрНайдСвязи.ДокументыСформированы = Истина;
			//					СтрНайдСвязи.ДокументыВыставлены = Стр2.УчДокумент.Выставлен;
			//					
			//				КонецЦикла;
			//				
			//			КонецЦикла;
			//			
			//		КонецЕсли;
			//		
			//	КонецЦикла;
			//	
			//ИначеЕсли РежимРаботы = 3 Тогда //второй режим даёт сбой, если к одной строке состава поезда должны выставить несколько реализаций
				
				ЗаполнитьСформированоВыставлено();
				
			//КонецЕсли;
		
	КонецЕсли;
	
	// дальше назначаем каждой строке СвязиУчетныхЕдиниц свое состояние, которое будет отвечать за задачу выставления документов клиенту
	//Евросиб Гудкова( 04.10.2020 Ticket№ 0208861 только для груженых

	//Если Не ПодсылПорожних Тогда
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
	ВключитьМеханизмЗадачСозданияКомплектаДокументов = ЭтотОбъект.Проведен;
	Если ВключитьМеханизмЗадачСозданияКомплектаДокументов Тогда
	//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		
		#Область Задачи_АлгоритмыОчистки
		//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, начало (закомментировал, догадываюсь что эта очистка задач нужна в случае установки единого ответственного за всю Сделку, только это не работает уже давно)
		//// Какая-то логика при изменении ответственных
		//Если (ЗначениеЗаполнено(Ссылка) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КомуСтавитсяЗадачаПоДокументам") <> КомуСтавитсяЗадачаПоДокументам) Тогда
		//	//очистим задачи по строкам
		//	Для каждого Стр Из СвязьУчетныхЕдиниц Цикл
		//		Строки = Состояния.НайтиСтроки(Новый Структура("Состояние", Стр.ЗадачаГотовностиКВыставлению));
		//		Для каждого УдСтрока Из Строки Цикл
		//			Состояния.Удалить(УдСтрока);
		//		КонецЦикла; 
		//		Стр.ЗадачаГотовностиКВыставлению = Справочники.Состояния.ПустаяСсылка();
		//	КонецЦикла;
		//	//тоже самое делаем для доходов по ВР
		//	Для каждого Стр Из Доходы Цикл
		//		Строки = Состояния.НайтиСтроки(Новый Структура("Состояние", Стр.ЗадачаГотовностиКВыставлению));
		//		Для каждого УдСтрока Из Строки Цикл
		//			Состояния.Удалить(УдСтрока);
		//		КонецЦикла; 
		//		Стр.ЗадачаГотовностиКВыставлению = Справочники.Состояния.ПустаяСсылка();
		//	КонецЦикла; 
		//КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, конец
		
		//Евросиб - АСуслов 13.04.2023 16:15:00 #67444
		//(
		//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало (перенесено, было расположено ниже)
		//Для каждого Стр Из СвязьУчетныхЕдиниц Цикл
		//	ОтветственныйНеАктуален =  НЕ ЗначениеЗаполнено(Стр.ОтветственныйЗаУчет) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОтветственныйЗаУчет,"Недействителен"); 
		//	Если ОтветственныйНеАктуален И НЕ Стр.ДокументыСформированы Тогда
		//		Стр.ГотовоКВыставлению = Ложь;
		//		//ДИТ, Беляев СЮ, US 37052, 09-09-2022, начало (добавлено оповещение пользователя)
		//		ТекстСообщения = СтрШаблон("Внимание. Снят признак <Готово к выставлению> в Составе поезда по контейнеру %1, т.к. Ответственный не заполнен или он Недействителен", Стр.Контейнер);
		//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", Стр.НомерСтроки, "Контейнер"));
		//		//ДИТ, Беляев СЮ, US 37052, 09-09-2022, конец
		//	КонецЕсли;
		//КонецЦикла;
		//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
		//)
		//Евросиб - АСуслов 13.04.2023 16:15:03 #67444
		
		// Какая-то логика "отката" задач в случае, если изначально было готово, а потом пользователь снял готовность по уже сформированной задаче
		ПотенциальноУдаляемыеЗадачи = Новый Массив;
		Для каждого Стр Из СвязьУчетныхЕдиниц Цикл
			Если Стр.ГотовоКВыставлению = Ложь и ЗначениеЗаполнено(Стр.ЗадачаГотовностиКВыставлению) Тогда ПотенциальноУдаляемыеЗадачи.Добавить(Стр.ЗадачаГотовностиКВыставлению); Стр.ЗадачаГотовностиКВыставлению = неопределено; КонецЕсли;
		КонецЦикла;
		Для каждого СостЪ из ПотенциальноУдаляемыеЗадачи Цикл
			Если СвязьУчетныхЕдиниц.Найти(СостЪ, "ЗадачаГотовностиКВыставлению") = неопределено Тогда
				НайдСтрокаСост = Состояния.Найти(СостЪ, "Состояние");
				Если НайдСтрокаСост <> неопределено Тогда Состояния.Удалить(НайдСтрокаСост); КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПотенциальноУдаляемыеЗадачи = Новый Массив;
		Для каждого Стр Из Доходы Цикл
			//Если (Стр.ГотовоКВыставлению = Ложь ИЛИ Стр.НеВыставлятьКлиенту = Истина) и ЗначениеЗаполнено(Стр.ЗадачаГотовностиКВыставлению) Тогда ПотенциальноУдаляемыеЗадачи.Добавить(Стр.ЗадачаГотовностиКВыставлению); Стр.ЗадачаГотовностиКВыставлению = неопределено; КонецЕсли;
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
			Если Стр.НеВыставлятьКлиенту = Истина и ЗначениеЗаполнено(Стр.ЗадачаГотовностиКВыставлению) Тогда ПотенциальноУдаляемыеЗадачи.Добавить(Стр.ЗадачаГотовностиКВыставлению); Стр.ЗадачаГотовностиКВыставлению = неопределено; КонецЕсли;
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		КонецЦикла;
		Для каждого СостЪ из ПотенциальноУдаляемыеЗадачи Цикл
			Если Доходы.Найти(СостЪ, "ЗадачаГотовностиКВыставлению") = неопределено Тогда
				НайдСтрокаСост = Состояния.Найти(СостЪ, "Состояние");
				Если НайдСтрокаСост <> неопределено Тогда Состояния.Удалить(НайдСтрокаСост); КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		
		//ДИТ, Беляев СЮ, Ticket#0285445, 14-09-2022, начало
		УдалитьЗадачиНеСвязанныеССоставомПоездаИДоходами();
		//ДИТ, Беляев СЮ, Ticket#0285445, 14-09-2022, конец
		#КонецОбласти
		// Дальше собираем ответственных, кому мы хотим выдать задачи
		
		//МассивИсполнителейДляВыставленияСейчас = Новый Массив;
		//МассивИсполнителейДляВыставленияСейчас2 = Новый Массив;
		//ИспользованныеСостоянияУчета = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("ЗадачаГотовностиКВыставлению");
		//Для каждого Стр77 из Доходы Цикл
		//	Если ЗначениеЗаполнено(Стр77.ЗадачаГотовностиКВыставлению) Тогда ИспользованныеСостоянияУчета.Добавить(Стр77.ЗадачаГотовностиКВыставлению); КонецЕсли;
		//КонецЦикла;
		
		//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
		ИспользованныеСостоянияУчета = ПолучитьМассивИспользованныхСостоянийУчета(); 
		//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец
		
		//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 ++
		УбратьЗадачиСоответствующиеНесколькимСотрудникам(); //В СЛУЧАЕ ИЗМЕНЕНИЯ ОТВЕТСТВЕННЫХ ТРЕБУЕТСЯ НОВЫЕ ЗАДАЧИ ПО НИМ, ДЛЯ ЭТОГО ИСКЛЮЧИМ НЕУНИКАЛЬНОСТЬ Задача-Ответственный
		//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 --
		
		// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало

		//Для каждого Стр из СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ДокументыСформированы, ГотовоКВыставлению, ЗадачаГотовностиКВыставлению", Ложь, Истина, Справочники.Состояния.ПустаяСсылка())) Цикл
		//ДИТ, Беляев СЮ, Ticket#0253343, 21-01-2022, начало 
		//СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц = ПолучитьСтруктурОтбора_НеСформированы_Готовы_НетЗадачи();
		//Для каждого Стр из СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц) Цикл 
		//	//ДИТ, Беляев СЮ, Ticket#0253343, 21-01-2022, конец
		//	// ДИТ Поморцева Т.П. 32343 12.10.2021. начало			
		//	//Ответственный = ?(КомуСтавитсяЗадачаПоДокументам = 0, ЕдиныйОтветственныйОтУчета, Стр.Договор.ОтветственныйЗаУчет);
		//	//Если МассивИсполнителейДляВыставленияСейчас.Найти(Ответственный) = неопределено Тогда МассивИсполнителейДляВыставленияСейчас.Добавить(Ответственный); КонецЕсли;
		//	Ответственный = ОпределитьОтветственного(Стр);
		//	Если ЗначениеЗаполнено(Ответственный) И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
		//		Если МассивИсполнителейДляВыставленияСейчас.Найти(Ответственный) = Неопределено Тогда
		//			МассивИсполнителейДляВыставленияСейчас.Добавить(Ответственный);
		//		КонецЕсли;
		//	КонецЕсли;
		//	// ДИТ Поморцева Т.П. 32343 12.10.2021. конец
		//КонецЦикла; 
		
	//	МассивНеПрошлиПроверку = Новый Массив;
	//	
	//	//МассивОбновленныхКТК = Новый Массив;
	////Если ДополнительныеСвойства.Свойство("ОбновленныеДоплатныеКТК", МассивОбновленныхКТК) Тогда
	//	Если ДополнительныеСвойства.Свойство("ОбновленныеДоплатныеКТК") Тогда
	//		МассивОбновленныхКТК = ДополнительныеСвойства.ОбновленныеДоплатныеКТК;
	//	Иначе
	//		МассивОбновленныхКТК = Неопределено;
	//	КонецЕсли;
	//	
	//	ТаблицаУникальныеЗадачи = ПолучитьТаблицуДляСозданияУникальныхЗадач(МассивОбновленныхКТК); 
	//	Для Каждого Стр Из ТаблицаУникальныеЗадачи Цикл	
	//		СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц = ПолучитьСтруктурОтбора_НеСформированы_Готовы_НетЗадачи(Стр);
	//		Для Каждого СтрУчЕд Из СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц) Цикл
	//			Ответственный = ОпределитьОтветственного(СтрУчЕд, Стр.Доплатные);
	//			Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
	//				Если МассивНеПрошлиПроверку.Найти(Стр) = Неопределено Тогда
	//					МассивНеПрошлиПроверку.Добавить(Стр);
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;			
	//	КонецЦикла; 
	//	
	//	Если МассивНеПрошлиПроверку.Количество() > 0 Тогда
	//		Для Каждого УдалитьСтр Из МассивНеПрошлиПроверку Цикл
	//			ТаблицаУникальныеЗадачи.Удалить(УдалитьСтр);
	//		КонецЦикла;
	//	КонецЕсли;
	//	// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец

	//	// Евросиб Фролов (05.05.2022 Task №51113
	//	// По ранее добавленным доплатным строкам доходов очистим задачи чтобы задачи сформировались на одного ответственного (при необходимости).
	//	Для Каждого СтрокаДоплатныхКТК Из МассивДобавленныхДоходов Цикл
	//		СтрокаДоплатныхКТК.ЗадачаГотовностиКВыставлению = Справочники.Состояния.ПустаяСсылка();
	//	КонецЦикла;	
	//	// Евросиб Фролов)
	//	
	//	//тоже самое по ВР в доходах
	//	Для каждого Стр из Доходы.НайтиСтроки(Новый Структура("ГотовоКВыставлению, НеВыставлятьКлиенту, ЗадачаГотовностиКВыставлению", Истина, Ложь, Справочники.Состояния.ПустаяСсылка())) Цикл
	//		// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//		//Ответственный = ?(КомуСтавитсяЗадачаПоДокументам = 0, ЕдиныйОтветственныйОтУчета, Стр.Договор.ОтветственныйЗаУчет);
	//		////Если Стр.ДоплатныеКТК Тогда Ответственный = Константы.ЕдиныйОтветственныйЗаФормированиеАктовПоДоплатам.Получить(); КонецЕсли;
	//		//Если МассивИсполнителейДляВыставленияСейчас2.Найти(Ответственный) = неопределено Тогда МассивИсполнителейДляВыставленияСейчас2.Добавить(Ответственный); КонецЕсли;
	//		Ответственный = ОпределитьОтветственногоТЧДоходы(Стр);
	//		Если ЗначениеЗаполнено(Ответственный) И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
	//			Если МассивИсполнителейДляВыставленияСейчас2.Найти(Ответственный) = Неопределено Тогда
	//				МассивИсполнителейДляВыставленияСейчас2.Добавить(Ответственный);
	//			КонецЕсли;
	//		КонецЕсли;
	//		// ДИТ Поморцева Т.П. 32343 12.10.2021. конец
	//	КонецЦикла;
	//	
	//	// Проставляем задачи по ответственным. Причем задачи в рамках Доходов и в рамках Состава поезда идут различные
	//	
	//	// по составу поезда
	//	// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//	мСуществующихЗадач = Новый Массив;
	//	ЗадачиПоДоплатнымКТК = СвязьУчетныхЕдиниц.ВыгрузитьКолонки();
	//	//Для каждого Исп из МассивИсполнителейДляВыставленияСейчас Цикл
	//	Для каждого Исп из ТаблицаУникальныеЗадачи Цикл 
	//		ТекСостояние = ПолучитьТекущееСостояние(Исп);
	//		Если ТекСостояние = Неопределено Тогда
	//	// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец
	//			ТекСостояние = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета);
	//		Иначе
	//			мСуществующихЗадач.Добавить(ТекСостояние);
	//		КонецЕсли;			
	//				
	//		//Для каждого Сост из СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ДокументыСформированы, ГотовоКВыставлению, ЗадачаГотовностиКВыставлению", Ложь, Истина, Справочники.Состояния.ПустаяСсылка())) Цикл
	//		//ДИТ, Беляев СЮ, Ticket#0253343, 21-01-2022, начало
	//		// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//		СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц = ПолучитьСтруктурОтбора_НеСформированы_Готовы_НетЗадачи(Исп,,Исп.Доплатные);
	//		Для каждого Сост из СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураОтбораДляТаблицыСвязьУчетныхЕдиниц) Цикл
	//			//ДИТ, Беляев СЮ, Ticket#0253343, 21-01-2022, конец
	//			// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//			//Ответственный = ?(КомуСтавитсяЗадачаПоДокументам = 0, ЕдиныйОтветственныйОтУчета, Сост.Договор.ОтветственныйЗаУчет);
	//			
	//			Ответственный = ОпределитьОтветственного(Сост);
	//			Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
	//				Сост.ГотовоКВыставлению = Ложь;
	//				Продолжить; 						
	//			КонецЕсли;
	//			// ДИТ Поморцева Т.П. Задача 37052 25.04.22. начало
	//			//Если Ответственный = Исп.ОтветственныйЗаУчет Тогда 
	//				Если Исп.Доплатные Тогда
	//					ДоплатнаяСтрока = ЗадачиПоДоплатнымКТК.Добавить();
	//					ЗаполнитьЗначенияСвойств(ДоплатнаяСтрока,Сост);
	//					ДоплатнаяСтрока.ЗадачаГотовностиКВыставлению = ТекСостояние;
	//				Иначе
	//					Сост.ЗадачаГотовностиКВыставлению = ТекСостояние; 
	//				КонецЕсли;
	//			//КонецЕсли;
	//			// ДИТ Поморцева Т.П. Задача 37052 25.04.22. конец
	//			// ДИТ Поморцева Т.П. 32343 12.10.2021. конец				
	//		КонецЦикла;
	//	КонецЦикла;
	//			
	//	// по блоку доходов
	//	Для каждого Исп из МассивИсполнителейДляВыставленияСейчас2 Цикл			
	//		// ДИТ Поморцева Т.П. 32343 12.10.2021. начало 
	//		//ТекСостояние = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета);
	//		ТекСостояние = ВыдатьСвободноеСостояниеУчетаДляПеревыставления(ИспользованныеСостоянияУчета);
	//		// ДИТ Поморцева Т.П. 32343 12.10.2021. конец
	//		
	//		// Евросиб Фролов (05.05.2022 Task №51113
	//		ТекСостояниеДоплатныхКТК = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета);
	//		// Евросиб Фролов)
	//		Для каждого Сост из Доходы.НайтиСтроки(Новый Структура("ГотовоКВыставлению, НеВыставлятьКлиенту, ЗадачаГотовностиКВыставлению", Истина, Ложь, Справочники.Состояния.ПустаяСсылка())) Цикл
	//			// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//			//Ответственный = ?(КомуСтавитсяЗадачаПоДокументам = 0, ЕдиныйОтветственныйОтУчета, Сост.Договор.ОтветственныйЗаУчет);				
	//			Ответственный = ОпределитьОтветственногоТЧДоходы(Сост);
	//			Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
	//				Сост.ГотовоКВыставлению = Ложь;
	//				Продолжить;
	//			КонецЕсли;
	//			// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
	//			
	//			//Если Сост.ДоплатныеКТК Тогда Ответственный = Константы.ЕдиныйОтветственныйЗаФормированиеАктовПоДоплатам.Получить(); КонецЕсли;
	//			Если Ответственный = Исп Тогда
	//				// Евросиб Фролов (05.05.2022 Task №51113
	//				//Сост.ЗадачаГотовностиКВыставлению = ТекСостояние; закомментировал
	//				Сост.ЗадачаГотовностиКВыставлению = ?(Сост.ДоплатныеКТК, ТекСостояниеДоплатныхКТК, ТекСостояние);
	//				// Евросиб Фролов)
	//			КонецЕсли;			
	//		КонецЦикла;
	//	КонецЦикла;

	//	// и последним шагом транслируем эти состояния в ТЧ Состояния
	//	//
	//	//ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(СвязьУчетныхЕдиниц);
	//	//ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(Доходы); 
	//	
	//	// тз-за того, что здесь разнесено обнуление статусов и их повторная установка, я вынужден сдвинуть этот код вниз
	//		
	//	ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(СвязьУчетныхЕдиниц,мСуществующихЗадач);
	//	ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(Доходы);
	//	// ДИТ Поморцева Т.П. Задача 37052 25.04.22.
	//	ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(ЗадачиПоДоплатнымКТК);
		
		СтруктураДанныхДляСозданияУникальныхЗадач = ПолучитьДанныеДляСозданияЗадач();  
		//ТЗПланЗадачПоСоставуПоезда = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗПланЗадачПоСоставуПоезда;
		ТЗТребуемыеЗадачиПоСоставуПоезда = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоСоставуПоезда;
		//ТЗПланЗадачПоДоходам = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗПланЗадачПоДоходам;
		ТЗТребуемыеЗадачиПоДоходам_ДоплатныеКТК = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоДоходам_ДоплатныеКТК;
		ТЗТребуемыеЗадачиПоДоходам = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоДоходам; 
		ТЗЗадачиИОтветственые = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗЗадачиИОтветственые;
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		ТЗТребуемыеЗадачиПоДопРасходам = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоДопРасходам; 
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		ТЗТребуемыеЗадачиПоКорректировкаВР = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоКорректировкаВР; 
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		ТЗТребуемыеЗадачиПоАннулированиюВР = СтруктураДанныхДляСозданияУникальныхЗадач.ТЗТребуемыеЗадачиПоАннулированиюВР; 
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		
		//ЗАДАЧИ В СОСТАВЕ ПОЕЗДА
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоСоставуПоезда Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			Отбор.Вставить("ОтветственныйЗаУчет", ТекНаборТребующийЗадачу.ОтветственныйЗаУчет);
			Отбор.Вставить("Протокол", ТекНаборТребующийЗадачу.Протокол);
			Отбор.Вставить("ЗадачаГотовностиКВыставлению", Справочники.Состояния.ПустаяСсылка());                                                                                      
			Отбор.Вставить("ГотовоКВыставлению", Истина);
			Отбор.Вставить("НеАктивна", Ложь);
			Отбор.Вставить("Удалена", Ложь);
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета); 
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "ЗадачиВСУЕ";
			КонецЕсли;	  
			Для Каждого СтрСУЕ ИЗ СвязьУчетныхЕдиниц.НайтиСтроки(Отбор) Цикл
				СтрСУЕ.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;	
			КонецЦикла;
		КонецЦикла;
		
		//ЗАДАЧИ В ДОХОДАХ (Доплатные КТК)
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоДоходам_ДоплатныеКТК Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			//Отбор.Вставить("ОтветственныйЗаУчет", ТекНаборТребующийЗадачу.ОтветственныйЗаУчет);
			Отбор.Вставить("ПСЦ", ТекНаборТребующийЗадачу.Протокол);
			Отбор.Вставить("ЗадачаГотовностиКВыставлению", Справочники.Состояния.ПустаяСсылка());                                                                                      
			//Отбор.Вставить("ГотовоКВыставлению", Истина);
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
			Отбор.Вставить("УслугаВнеСтавки", Истина);
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
			Отбор.Вставить("НеВыставлятьКлиенту", Ложь);
			Отбор.Вставить("ДоплатныеКТК", Истина);
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета);
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора; 
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "ДоплатныеКТК";
			КонецЕсли;	
			Для Каждого СтрДоходов ИЗ Доходы.НайтиСтроки(Отбор) Цикл
				СтрДоходов.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;	
			КонецЦикла;	
		КонецЦикла;  
		
		//ЗАДАЧИ В ДОХОДАХ (ВР)
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоДоходам Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			Отбор.Вставить("ЗадачаГотовностиКВыставлению", Справочники.Состояния.ПустаяСсылка());                                                                                      
			//Отбор.Вставить("ГотовоКВыставлению", Истина);
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
			Отбор.Вставить("УслугаВнеСтавки", Истина);
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
			Отбор.Вставить("НеВыставлятьКлиенту", Ложь);
			Отбор.Вставить("ДоплатныеКТК", Ложь);
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
			Отбор.Вставить("ДобавленаКорректировкаИзАкцепта", Ложь);
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчетаДляПеревыставления(ИспользованныеСостоянияУчета);
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора; 
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "ВР";
			КонецЕсли;	
			Для Каждого СтрДоходов ИЗ Доходы.НайтиСтроки(Отбор) Цикл
				// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
				Если СтрДоходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы Тогда
					Продолжить;
				КонецЕсли;
				// Евросиб Рыбьяков К.А. 04.06.2025 ))
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
				//Если СтрДоходов.Перевыставляемая 
				//		И СтрДоходов.ГУИДИсправляемойСтроки <> "" 
				//		И СтрДоходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
				//	Продолжить;
				//КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
				СтрДоходов.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;	
			КонецЦикла;	
		КонецЦикла;
		
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		//ЗАДАЧИ В ДОХОДАХ ДОПОЛНИТЕЛЬНЫЕ РАСХОДЫ
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоДопРасходам Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			Отбор.Вставить("ЗадачаГотовностиКВыставлению", Справочники.Состояния.ПустаяСсылка());
			Отбор.Вставить("УслугаВнеСтавки", Истина);
			Отбор.Вставить("НеВыставлятьКлиенту", Ложь);
			Отбор.Вставить("ДоплатныеКТК", Ложь);
			Отбор.Вставить("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы);
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчетаДляДопРасходов(ИспользованныеСостоянияУчета);
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора; 
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "Дополнительные расходы";
			КонецЕсли;	
			Для Каждого СтрДоходов ИЗ Доходы.НайтиСтроки(Отбор) Цикл
				СтрДоходов.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;	
			КонецЦикла;
		КонецЦикла;
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоКорректировкаВР Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			Отбор.Вставить("ЗадачаГотовностиКВыставлению", Справочники.Состояния.ПустаяСсылка());
			Отбор.Вставить("УслугаВнеСтавки", Истина);
			Отбор.Вставить("НеВыставлятьКлиенту", Ложь);
			Отбор.Вставить("ДоплатныеКТК", Ложь);
			Отбор.Вставить("Перевыставляемая", Истина);
			Отбор.Вставить("ДобавленаКорректировкаИзАкцепта", Истина);
			Отбор.Вставить("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчетаДляТребуетсяВнестиИзмененияВР(ИспользованныеСостоянияУчета);
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора; 
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "Корректировка ВР";
			КонецЕсли;	
			Для Каждого СтрДоходов ИЗ Доходы.НайтиСтроки(Отбор) Цикл
				//Если СтрДоходов.ГУИДИсправляемойСтроки = "" Тогда
				//	Продолжить;
				//КонецЕсли;
				СтрДоходов.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
			КонецЦикла;
		КонецЦикла;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		Для Каждого ТекНаборТребующийЗадачу Из ТЗТребуемыеЗадачиПоАннулированиюВР Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Клиент", ТекНаборТребующийЗадачу.Клиент);
			Отбор.Вставить("Договор", ТекНаборТребующийЗадачу.Договор);
			Отбор.Вставить("УслугаВнеСтавки", Истина);
			Отбор.Вставить("НеВыставлятьКлиенту", Ложь);
			Отбор.Вставить("ДоплатныеКТК", Ложь);
			Отбор.Вставить("Перевыставляемая", Истина);
			Отбор.Вставить("ТребуетсяАннулироватьОтчетКомитенту", Истина);
			ЗадачаДляТекущегоНабора = ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению;
			Если НЕ ЗначениеЗаполнено(ЗадачаДляТекущегоНабора) Тогда
				ЗадачаДляТекущегоНабора = ВыдатьСвободноеСостояниеУчетаДляТребуетсяАннулированиеВР(ИспользованныеСостоянияУчета);
				ТекНаборТребующийЗадачу.ИмеющаясяЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора; 
				НоваяСтрокаТЗЗадачиИОтветственые = ТЗЗадачиИОтветственые.Добавить();
				НоваяСтрокаТЗЗадачиИОтветственые.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
				НоваяСтрокаТЗЗадачиИОтветственые.ОтветственныйЗаУчет = ТекНаборТребующийЗадачу.ОтветственныйЗаУчет;
				НоваяСтрокаТЗЗадачиИОтветственые.ВидЗадачи = "АннулированиеВР";
			КонецЕсли;	
			Для Каждого СтрДоходов ИЗ Доходы.НайтиСтроки(Отбор) Цикл
				СтрДоходов.ЗадачаГотовностиКВыставлению = ЗадачаДляТекущегоНабора;
			КонецЦикла;
		КонецЦикла;
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		
		//ДИТ, Беляев СЮ, US 56030/ TA 56033, 16-09-2022, начало (после добавления новых задач надо заново заполнить)
		ЗаполнитьСформированоВыставлено();
		//ДИТ, Беляев СЮ, US 56030/ TA 56033, 16-09-2022, конец
		
		ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(СвязьУчетныхЕдиниц, ТЗЗадачиИОтветственые);
		ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(Доходы, ТЗЗадачиИОтветственые);
		
		//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, начало
		//НеактуальныхОтветственные = ПолучитьМассивНеактуальныхОтветственных();
		//Если НЕ Служебная И НеактуальныхОтветственные.Количество() > 0 И Заявки.Количество() Тогда
		
		//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
		ОписаниеПоНеакутальнымОтветственным = ПолучитьОписаниеПоНеакутальнымОтветственным();
		Если НЕ Служебная И ЗначениеЗаполнено(ОписаниеПоНеакутальнымОтветственным) И Заявки.Количество() Тогда
		//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
			НайденнаяЗадачаНазначитОтветственного = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет));
			Если НайденнаяЗадачаНазначитОтветственного.Количество() = 0 Тогда
				НСтр = Состояния.Добавить();
				//НСтр.Исполнитель = ЦФО.ОтветственныйЗаУчет;
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
				НСтр.Исполнитель = ПолучитьОтветственногоЗаФормированиеПервичнойДокументации();
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
				НСтр.Наблюдатель = НСтр.Исполнитель;
				НСтр.НачалоРаботы = ТекущаяДата();      
				//ДИТ, МаршевЕ Ticket#0307554 , 16.04.24 Начало
				НСтр.ЗавершениеРаботы = Неопределено;      
				//ДИТ, МаршевЕ Ticket#0307554 ,  Конец ----
				НСтр.Состояние = Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет;
				НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
				НСтр.Комментарий = ОписаниеПоНеакутальнымОтветственным;
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
			Иначе
				ЗадачаНазначитьОтвественного = НайденнаяЗадачаНазначитОтветственного[0];
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
				ЗадачаНазначитьОтвественного.Комментарий = ОписаниеПоНеакутальнымОтветственным;
				//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
				Если ЗадачаНазначитьОтвественного.Статус <> Перечисления.СтатусыЭтапов.НаВыполнение Тогда
					//ЗадачаНазначитьОтвественного.Исполнитель = ЦФО.ОтветственныйЗаУчет;
					//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
					ЗадачаНазначитьОтвественного.Исполнитель = ПолучитьОтветственногоЗаФормированиеПервичнойДокументации();
					//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец
					ЗадачаНазначитьОтвественного.Наблюдатель = ЗадачаНазначитьОтвественного.Исполнитель;
					ЗадачаНазначитьОтвественного.НачалоРаботы = ТекущаяДата();
					//ДИТ, МаршевЕ Ticket#0307554 , 16.04.24 Начало
					ЗадачаНазначитьОтвественного.ЗавершениеРаботы = Неопределено;      
					//ДИТ, МаршевЕ Ticket#0307554 ,  Конец ----     
					ЗадачаНазначитьОтвественного.Состояние = Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет;
					ЗадачаНазначитьОтвественного.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//логика закрытия задачи ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет, располагалсь выше, перенесено с небольшим рефакторингом
		//Если ЗначениеЗаполнено(ЕдиныйОтветственныйОтУчета) ИЛИ НеактуальныхОтветственные.Количество() = 0 Тогда
		//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало	
		Если НЕ ЗначениеЗаполнено(ОписаниеПоНеакутальнымОтветственным) Тогда
		//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец	
			НайденнаяЗадачаНазначитОтветственного = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяНазначитьЕдиногоОтветственногоЗаУчет));
			Если НайденнаяЗадачаНазначитОтветственного.Количество() > 0 Тогда
				НайденнаяЗадачаНазначитОтветственного[0].Статус = Перечисления.СтатусыЭтапов.Выполнен;
			КонецЕсли;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, конец
	КонецЕсли;

	// Евросиб Фролов (09.03.2022 Task №44927
	ЗакрытьЗадачиВыставленияДокументовПоФрахту();
	// Евросиб Фролов)
	
	// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
	// При установке галки "Подтверждающие документы", на сотрудника, ответственного за учет по договору с клиентом,
	// должна быть создана задача "Готовность комплекта подтверждающих документов".
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДобавитьЗадачуГотовностьКомплектаПодтверждающихДокументов();
	КонецЕсли;
	// ДИТ 64186 Давудов М.А. Конец: 07.03.2023    
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 12.09.2024
	//Если в рейсах есть морские рейсы помеченные на удаление - ставим задачу на замену рейса
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПомеченныеНаУдалениеРейсы = Новый Массив;
		Для каждого СтрРейса Из Рейсы Цикл 
			Если ТипЗнч(СтрРейса.Рейс) = Тип("СправочникСсылка.РейсыМоре") Тогда 
				РеквизитыРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрРейса.Рейс, "ПометкаУдаления, ДатаОтправления");
				Если РеквизитыРейса.ПометкаУдаления и РеквизитыРейса.ДатаОтправления > ТекущаяДата() Тогда
					ПомеченныеНаУдалениеРейсы.Добавить(СтрРейса.Рейс);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ПомеченныеНаУдалениеРейсы.Количество() > 0 Тогда
			МаршрутизацияСервер.СформироватьЗадачуОбработкиУдаленияМорскогоРейса(Ссылка, Состояния, Автор, ПомеченныеНаУдалениеРейсы); 
		КонецЕсли;
	КонецЕсли;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024
	
	///////////////////////
	// блок, который работает по расходам и включает-выключает услуги в группах
	///////////////////////
	
	//ОтработатьАктивностьСтрокРасходов();
	СвязьДоходовИРасходов.Свернуть("Доходы, Расходы, СвязьУчетныхЕдиниц, Услуга");
	//Евросиб - АСуслов 27.09.2021 10:47:01 #33698
	//(
	Документы.Сделка.ПересчитатьПериоды(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 27.09.2021 10:47:05 #33698
	
	//Евросиб Каблов 12.02.2026 ( Ticket#0433414
	Начало2026года = '20260101';
	СтавкаНДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	СтавкаНДС22 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
	
	Для Каждого СтрТЧДоходы Из Доходы Цикл
		Если СтрТЧДоходы.СтавкаНДС = СтавкаНДС20 И СтрТЧДоходы.ДатаОказанияУслуги >= Начало2026года  Тогда
			СтрТЧДоходы.СтавкаНДС = СтавкаНДС22;
			СтрТЧДоходы.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрТЧДоходы.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрТЧДоходы.СтавкаНДС), Истина, СтрТЧДоходы.НДСВключенВСтоимость);
			СтрТЧДоходы.СуммаИтого = СтрТЧДоходы.СтавкаИтого + ?(СтрТЧДоходы.НДСВключенВСтоимость, 0, СтрТЧДоходы.СуммаНДС);
		ИначеЕсли СтрТЧДоходы.СтавкаНДС = СтавкаНДС22 И СтрТЧДоходы.ДатаОказанияУслуги < Начало2026года  Тогда
			СтрТЧДоходы.СтавкаНДС = СтавкаНДС20;
			СтрТЧДоходы.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрТЧДоходы.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрТЧДоходы.СтавкаНДС), Истина, СтрТЧДоходы.НДСВключенВСтоимость);
			СтрТЧДоходы.СуммаИтого = СтрТЧДоходы.СтавкаИтого + ?(СтрТЧДоходы.НДСВключенВСтоимость, 0, СтрТЧДоходы.СуммаНДС);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 12.02.2026 ) Ticket#0433414
	
	//Евросиб Каблов 26.08.2022 ( 56193
	Документы.Сделка.ПроверитьПериодВОДоходов(Доходы, ЭтотОбъект, Ложь, Отказ);
	//Евросиб Каблов 26.08.2022 )
		
	КлючевыеСобытияСделкиСервер.ОбработатьЗаписьСделки(ЭтотОбъект);

	//Евросиб - АСуслов 13.01.2023 15:48:43 #63784
	//(
	// Евросиб Фролов (15.03.2022 Task №40571 
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	РаботаСТабличнымиЧастями.ПроверитьКоличествоВТабличнойЧасти(Доходы, "Доходная часть сделки", Отказ, ,ЭтотОбъект);
	//	// Евросиб Фролов (27.04.2022 Task №50551
	//	ОтключитьРасходыПоОтмеченнымКТК();
	//	// Евросиб Фролов)
	//КонецЕсли;	
	// Евросиб Фролов)
	//)
	//Евросиб - АСуслов 13.01.2023 15:49:28 #63784
	
	// Евросиб Фролов (25.04.2022 Task №42905
	// При отключении строки расхода в сделке отвязывать автоматически акцепт.
	//Евросиб - АСуслов 05.12.2022 19:56:36 #51968
	//(
	//Если ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
	//	РаботаСоСделкамиСервер.ОтвязатьАкцептыОтОтключенныхРасходов(ЭтотОбъект);
	//Иначе
	//	ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(ЭтотОбъект);
		//ОтложенноеИзменениеСервер.ПоставитьАкцептыВОчередьНаИзменение(ЭтотОбъект);
		ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
	//КонецЕсли;	
	//)
	//Евросиб - АСуслов 05.12.2022 19:56:48 #51968
	// Евросиб Фролов)
	
	//Евросиб - АСуслов 19.01.2023 16:06:33 #63097
	//(
	КлючиАналитикиСоставаПоездаСервер.ЗаполнитьКлючиАналитикиВСделке(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 19.01.2023 16:06:42 #63097 
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	
	ПроверитьЗадачиНаУдалениеКонтейнеровПоРефСцепам();
	
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023 
	
	// Евросиб US 88665 TA 97651 Рыбьяков К.А. 16.12.2024 ((
	КлючиАналитикиПеревозкиСервер.ЗаполнитьКлючиАналитикиВЗаявке(ЭтотОбъект, Ссылка)
	// Евросиб Рыбьяков К.А. 16.12.2024 ))
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало, (закомментировал функцию, не используется)
////ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, начало
//Функция ПолучитьМассивНеактуальныхОтветственных()
//	РезультатМассив=Новый Массив;
//	СтрокиСУЕсЗаполненнымиПолямиДляЗадач = ПолучитьСтрокиСУЕсЗаполненнымиПолямиДляЗадач();
//	Для каждого Стр из СтрокиСУЕсЗаполненнымиПолямиДляЗадач Цикл
//		Ответственный = ОпределитьОтветственного(Стр);
//		Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда
//			РезультатМассив.Добавить(Ответственный);
//		КонецЕсли;
//	КонецЦикла;
//	
//	НеактуальныеОтветственныеВДоходах = ПроверитьНеактуальныхОтветственныхПоЗадачамВДоходах();
//	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатМассив, НеактуальныеОтветственныеВДоходах, Истина);
//	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(РезультатМассив);
//	Возврат РезультатМассив;
//КонецФункции
////ДИТ, Беляев СЮ, Ticket#0337314, 12-01-2024, конец
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
Функция ПолучитьОтветственногоЗаФормированиеПервичнойДокументации()
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦФО, "ОтветственныйЗаФормированиеПервичнойДокументации");
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦФО, "ОтветственныйЗаУчет");
	КонецЕсли;
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало
Функция ПолучитьОписаниеПоНеакутальнымОтветственным()
	
	СтруктураПроблемПоСоставуПоезда = Документы.Сделка.ОтсутствующиеИНедействительныеОтветственные( ЭтотОбъект );
	МассивКлиентовБезОтветственного = СтруктураПроблемПоСоставуПоезда.МассивКлиентовБезОтветственного;
	МассивОтветственныхНедействительных = СтруктураПроблемПоСоставуПоезда.МассивОтветственныхНедействительных;
	
	НеактуальныеОтветственныеВДоходах = ПроверитьНеактуальныхОтветственныхПоЗадачамВДоходах();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственныхНедействительных, НеактуальныеОтветственныеВДоходах, Истина);
	
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивОтветственныхНедействительных);
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКлиентовБезОтветственного);
	
	СтрокаРезультат = "";
	
	Если МассивКлиентовБезОтветственного.Количество() > 0 Тогда
		СтрокаРезультат = СтрШаблон("Не заполнен ответственный:%1", СтрСоединить(МассивКлиентовБезОтветственного,","));
	КонецЕсли;		
	Если МассивОтветственныхНедействительных.Количество() > 0 Тогда
		СтрокаРезультат = ?(ЗначениеЗаполнено(СтрокаРезультат), СтрокаРезультат+", ", "") 
									+ СтрШаблон("Ответственный НЕ действителен:%1", СтрСоединить(МассивОтветственныхНедействительных,","));
	КонецЕсли;
	Возврат СтрокаРезультат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
Функция ПроверитьНеактуальныхОтветственныхПоЗадачамВДоходах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаДоходы.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТЗадачиДоходы
		|ИЗ
		|	&Доходы КАК СделкаДоходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состояния.Состояние КАК Состояние,
		|	Состояния.Статус КАК Статус,
		|	Состояния.Исполнитель КАК Исполнитель
		|ПОМЕСТИТЬ ВТСостояния
		|ИЗ
		|	&Состояния КАК Состояния
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗадачиДоходы.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
		|	ВТСостояния.Исполнитель КАК Исполнитель,
		|	ВТСостояния.Статус КАК Статус
		|ИЗ
		|	ВТЗадачиДоходы КАК ВТЗадачиДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояния КАК ВТСостояния
		|		ПО ВТЗадачиДоходы.ЗадачаГотовностиКВыставлению = ВТСостояния.Состояние
		//|			И (ВТСостояния.Статус <> &СтатусВыполнено) //ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, закомментировал
		|ГДЕ
		|	ВТЗадачиДоходы.ЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|	И (ВТСостояния.Состояние ЕСТЬ NULL
		//|			ИЛИ ВЫРАЗИТЬ(ВТСостояния.Исполнитель КАК Справочник.Пользователи).Недействителен)";
		//ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, начало
		|			ИЛИ (ВЫРАЗИТЬ(ВТСостояния.Исполнитель КАК Справочник.Пользователи).Недействителен И ВТСостояния.Статус <> &СтатусВыполнено))";
		//ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, конец
	
	Запрос.УстановитьПараметр("СтатусВыполнено", Перечисления.СтатусыЭтапов.Выполнен);
	Запрос.УстановитьПараметр("Доходы",Доходы.Выгрузить(,"ЗадачаГотовностиКВыставлению"));
	Запрос.УстановитьПараметр("Состояния",Состояния.Выгрузить());

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
КонецФункции
//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец

//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
Функция ПолучитьДанныеДляСозданияЗадач()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы,
		|	СвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКвыставлению,
		|	СвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
		|	СвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
		|	СвязьУчетныхЕдиниц.Удалена КАК Удалена,
		|	СвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	СвязьУчетныхЕдиниц.Договор КАК Договор,
		|	СвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	СвязьУчетныхЕдиниц.Протокол КАК Протокол,
		|	СвязьУчетныхЕдиниц.Доплата_Клиент КАК Доплата_Клиент,
		|	СвязьУчетныхЕдиниц.Доплата_Договор КАК Доплата_Договор,
		|	СвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ,
		|	СвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		|	СвязьУчетныхЕдиниц.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
		|ИЗ
		|	&СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаСвязьДоходовИРасходов.Доходы КАК ГУИДСтрокиДохода,
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ГУИДСтрокиСУЕ
		|ПОМЕСТИТЬ ВТСвязьДоходовИРасходов
		|ИЗ
		|	&СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаДоходы.ГУИД КАК ГУИДСтрокиДохода,
		|	СделкаДоходы.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
		//|	СделкаДоходы.ГотовоКВыставлению КАК ГотовоКВыставлению, //ДИТ, Беляев СЮ, US 80045, 07-02-2024, закомментировал
		|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
		|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		//|	ВЫРАЗИТЬ(СделкаДоходы.УчДокумент КАК Документ.РеализацияТоваровУслуг) КАК УчДокумент
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		|	СделкаДоходы.УчДокумент КАК УчДокумент
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		|	,СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки
		|	,СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
			//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
			//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		|	,ВЫБОР КОГДА СделкаДоходы.КорректировкаДокумента <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка) ТОГДА
		|				ИСТИНА
		|			ИНАЧЕ
		|				ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСтрокаКорректировки,
			//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, конец
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		|	,СделкаДоходы.Перевыставляемая КАК Перевыставляемая
		|	,СделкаДоходы.КорректировкаДокумента КАК КорректировкаДокумента
		|	,СделкаДоходы.ДобавленаКорректировкаИзАкцепта КАК ДобавленаКорректировкаИзАкцепта
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		|	,СделкаДоходы.ТребуетсяАннулироватьОтчетКомитенту КАК ТребуетсяАннулироватьОтчетКомитенту
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		|
		|ПОМЕСТИТЬ ВТДоходы
		|ИЗ
		|	&Доходы КАК СделкаДоходы
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состояния.Состояние КАК Состояние,
		|	Состояния.Исполнитель КАК Исполнитель		
		|ПОМЕСТИТЬ ВТДанныеТЧСостояния
		|ИЗ
		|	&Состояния КАК Состояния
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состояния.Состояние КАК Состояние,
		|	Состояния.Исполнитель КАК Исполнитель,
		|	Пользователи.Недействителен КАК Недействителен,
		|	Пользователи.НепосредственныйРуководитель КАК НепосредственныйРуководитель		
		|ПОМЕСТИТЬ ВТСостояния
		|ИЗ
		|	ВТДанныеТЧСостояния КАК Состояния
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Пользователи.Ссылка = Состояния.Исполнитель
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	ВТСвязьУчетныхЕдиниц.Протокол КАК Протокол,
		|	МАКСИМУМ(ВТСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоСУЕ
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Протокол,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	ВТСвязьУчетныхЕдиниц.Протокол КАК Протокол,
		|	МАКСИМУМ(ВТПланЗадачПоСУЕ.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоСУЕ КАК ВТПланЗадачПоСУЕ
		|		ПО ВТСвязьУчетныхЕдиниц.Клиент = ВТПланЗадачПоСУЕ.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Договор = ВТПланЗадачПоСУЕ.Договор
		|			И ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет = ВТПланЗадачПоСУЕ.ОтветственныйЗаУчет
		|			И ВТСвязьУчетныхЕдиниц.Протокол = ВТПланЗадачПоСУЕ.Протокол
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.ДокументыСформированы
		|	И ВТСвязьУчетныхЕдиниц.ГотовоКвыставлению
		|	И НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Протокол,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Доплата_Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Доплата_Договор КАК Договор,
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный КАК ОтветственныйЗаУчет,
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало (если ответственный не заполнен в договоре, возьмём текущего)
		|	ВЫБОР КОГДА НЕ ТЧОтветственные.Ответственный Есть NULL И ТЧОтветственные.Ответственный <> Значение(Справочник.Пользователи.ПустаяСсылка) ТОГДА 
		|				ВЫБОР КОГДА ТЧОтветственные.Ответственный.Недействителен Тогда ТЧОтветственные.Ответственный.НепосредственныйРуководитель
		|						ИНАЧЕ ТЧОтветственные.Ответственный КОНЕЦ
		|		  ИНАЧЕ  
		|				ВЫБОР КОГДА ВТСостояния.Недействителен Тогда ВТСостояния.НепосредственныйРуководитель
		|						ИНАЧЕ ВТСостояния.Исполнитель КОНЕЦ 
		|		  КОНЕЦ КАК ОтветственныйЗаУчет,
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|	ВТСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Протокол,
		|	МАКСИМУМ(ВТДоходы.ЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоДоходам_ДоплатныеКТК
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (ВТДоходы.ДоплатныеКТК)
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		|		ПО ВТСвязьУчетныхЕдиниц.Доплата_Договор = ТЧОтветственные.Ссылка
		|			И (ТЧОтветственные.ЦФО = &ЦФОСделки)
		|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояния КАК ВТСостояния
		|		ПО ВТСостояния.Состояние = ВТДоходы.ЗадачаГотовностиКВыставлению
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		//|	И ВТДоходы.ГотовоКВыставлению
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		|	И ВТДоходы.УслугаВнеСтавки
		//|	И ВТДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|	И ВТСвязьУчетныхЕдиниц.Доплата_Клиент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Доплата_Договор,
		|	ВТСвязьУчетныхЕдиниц.Доплата_ПСЦ,
		|	ВТСвязьУчетныхЕдиниц.Доплата_Клиент,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|	ВЫБОР КОГДА НЕ ТЧОтветственные.Ответственный Есть NULL И ТЧОтветственные.Ответственный <> Значение(Справочник.Пользователи.ПустаяСсылка) ТОГДА 
		|				ВЫБОР КОГДА ТЧОтветственные.Ответственный.Недействителен Тогда ТЧОтветственные.Ответственный.НепосредственныйРуководитель
		|						ИНАЧЕ ТЧОтветственные.Ответственный КОНЕЦ
		|		  ИНАЧЕ  
		|				ВЫБОР КОГДА ВТСостояния.Недействителен Тогда ВТСостояния.НепосредственныйРуководитель
		|						ИНАЧЕ ВТСостояния.Исполнитель КОНЕЦ 
		|		  КОНЕЦ
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Доплата_Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Доплата_Договор КАК Договор,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		//|	ТЧОтветственные.Ответственный КАК ОтветственныйЗаУчет,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало (если ответственный не заполнен в договоре, возьмём текущего)
		|	ВЫБОР КОГДА НЕ ТЧОтветственные.Ответственный Есть NULL И ТЧОтветственные.Ответственный <> Значение(Справочник.Пользователи.ПустаяСсылка) ТОГДА 
		|				ВЫБОР КОГДА ТЧОтветственные.Ответственный.Недействителен Тогда ТЧОтветственные.Ответственный.НепосредственныйРуководитель
		|						ИНАЧЕ ТЧОтветственные.Ответственный КОНЕЦ
		|		  ИНАЧЕ  
		|				ВЫБОР КОГДА ВТСостояния.Недействителен Тогда ВТСостояния.НепосредственныйРуководитель
		|						ИНАЧЕ ВТСостояния.Исполнитель КОНЕЦ 
		|		  КОНЕЦ КАК ОтветственныйЗаУчет,
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|	ВТСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Протокол,
		|	МАКСИМУМ(ВТПланЗадачПоДоходам_ДоплатныеКТК.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (ВТДоходы.ДоплатныеКТК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоДоходам_ДоплатныеКТК КАК ВТПланЗадачПоДоходам_ДоплатныеКТК
		|		ПО ВТСвязьУчетныхЕдиниц.Доплата_Клиент = ВТПланЗадачПоДоходам_ДоплатныеКТК.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Доплата_Договор = ВТПланЗадачПоДоходам_ДоплатныеКТК.Договор
		|			И ВТСвязьУчетныхЕдиниц.Доплата_ПСЦ = ВТПланЗадачПоДоходам_ДоплатныеКТК.Протокол
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		|		ПО ВТСвязьУчетныхЕдиниц.Доплата_Договор = ТЧОтветственные.Ссылка
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		|			И (ТЧОтветственные.ЦФО = &ЦФОСделки)
		|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояния КАК ВТСостояния
		|		ПО ВТСостояния.Состояние = ВТПланЗадачПоДоходам_ДоплатныеКТК.ИмеющаясяЗадачаГотовностиКВыставлению
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|	И ВТСвязьУчетныхЕдиниц.Доплата_Клиент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		//|	И ВТДоходы.ГотовоКВыставлению
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		|	И ВТДоходы.УслугаВнеСтавки
		//|	И ВТДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Доплата_Договор,
		|	ВТСвязьУчетныхЕдиниц.Доплата_ПСЦ,
		|	ВТСвязьУчетныхЕдиниц.Доплата_Клиент,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
		|	ВЫБОР КОГДА НЕ ТЧОтветственные.Ответственный Есть NULL И ТЧОтветственные.Ответственный <> Значение(Справочник.Пользователи.ПустаяСсылка) ТОГДА 
		|				ВЫБОР КОГДА ТЧОтветственные.Ответственный.Недействителен Тогда ТЧОтветственные.Ответственный.НепосредственныйРуководитель
		|						ИНАЧЕ ТЧОтветственные.Ответственный КОНЕЦ
		|		  ИНАЧЕ  
		|				ВЫБОР КОГДА ВТСостояния.Недействителен Тогда ВТСостояния.НепосредственныйРуководитель
		|						ИНАЧЕ ВТСостояния.Исполнитель КОНЕЦ 
		|		  КОНЕЦ
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный КАК ОтветственныйЗаУчет,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, начало
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, конец
		|	МАКСИМУМ(ВТДоходы.ЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоДоходам
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		//|		ПО ВТСвязьУчетныхЕдиниц.Договор = ТЧОтветственные.Ссылка
		////|			И (ТЧОтветственные.ЦФО = ТЧОтветственные.ЦФО = &ЦФОСделки)
		////ДИТ, Беляев СЮ, Ticket#0296384, 27-12-2022, начало
		//|			И (ТЧОтветственные.ЦФО = &ЦФОСделки)
		////ДИТ, Беляев СЮ, Ticket#0296384, 27-12-2022, конец
		//|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
		//|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		//|	И ВТДоходы.ГотовоКВыставлению
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		|	И ВТДоходы.УслугаВнеСтавки
		//|	И ВТДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		|	И НЕ ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы)
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		//|	И НЕ (ВТДоходы.Перевыставляемая И ВТДоходы.ГУИДИсправляемойСтроки <> """" И ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))
		|	И НЕ ВТДоходы.ДобавленаКорректировкаИзАкцепта
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, начало
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, конец
		|;
		|
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТДоходы.ЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоДоходам_ДопРасходы
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТДоходы.УслугаВнеСтавки
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту 
		|	И ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|
		|;
		|
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТДоходы.ЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоКорректировкеВР
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|	И ВТДоходы.ДобавленаКорректировкаИзАкцепта
		//|	И (ВТДоходы.Перевыставляемая И ВТДоходы.ГУИДИсправляемойСтроки <> """" И ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|
		|;
		|
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВЫБОР КОГДА ВЫРАЗИТЬ(ВТДоходы.ЗадачаГотовностиКВыставлению КАК Справочник.Состояния).Родитель = ЗНАЧЕНИЕ(Справочник.Состояния.ЗадачиТребуетсяАннулироватьОтчетКомитенту) ТОГДА 
		|					ВТДоходы.ЗадачаГотовностиКВыставлению 
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка) КОНЕЦ) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ПОМЕСТИТЬ ВТПланЗадачПоАннулированиюОК
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (ВТДоходы.ТребуетсяАннулироватьОтчетКомитенту)
		|			И НЕ (ВТДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|					ИЛИ ВТДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		//|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|
		|;
		|
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		|////////////////////////////////////////////////////////////////////////////////		
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|	ТЧОтветственные.Ответственный КАК ОтветственныйЗаУчет,
		//|	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, начало
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, конец
		|	МАКСИМУМ(ВТПланЗадачПоДоходам.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоДоходам КАК ВТПланЗадачПоДоходам
		|		ПО ВТСвязьУчетныхЕдиниц.Клиент = ВТПланЗадачПоДоходам.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Договор = ВТПланЗадачПоДоходам.Договор
		//|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		//|		ПО ВТСвязьУчетныхЕдиниц.Договор = ТЧОтветственные.Ссылка
		//|			И (ТЧОтветственные.ЦФО = &ЦФОСделки)
		//|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
		//|		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		//|	И ВТДоходы.ГотовоКВыставлению
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		|	И ВТДоходы.УслугаВнеСтавки
		//|	И ВТДоходы.ГУИДИсправляемойСтроки = """"
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|	И (ВТДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|			ИЛИ ВТДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		//|	ТЧОтветственные.Ответственный
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, начало
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		//ДИТ, Беляев СЮ, BUG 67714/TA 76292, 18-10-2023, конец
		|;
		|		
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТПланЗадачПоДоходам_ДопРасходы.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоДоходам_ДопРасходы КАК ВТПланЗадачПоДоходам_ДопРасходы
		|		ПО ВТСвязьУчетныхЕдиниц.Клиент = ВТПланЗадачПоДоходам_ДопРасходы.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Договор = ВТПланЗадачПоДоходам_ДопРасходы.Договор
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|	И ВТДоходы.УслугаВнеСтавки
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|	И (ВТДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|			ИЛИ ВТДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		|	И ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы)
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|;
		// Евросиб Рыбьяков К.А. 04.06.2025 ))
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТПланЗадачПоКорректировкеВР.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (НЕ ВТДоходы.ДоплатныеКТК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоКорректировкеВР КАК ВТПланЗадачПоКорректировкеВР
		|		ПО ВТСвязьУчетныхЕдиниц.Клиент = ВТПланЗадачПоКорректировкеВР.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Договор = ВТПланЗадачПоКорректировкеВР.Договор
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		|	И ВТДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|	И НЕ ВТДоходы.ЭтоСтрокаКорректировки
		|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		|	И ВТДоходы.ДобавленаКорректировкаИзАкцепта
		//|	И (ВТДоходы.Перевыставляемая И ВТДоходы.ГУИДИсправляемойСтроки <> """" И ВТДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))
		|	И (ВТДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ
		|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	МАКСИМУМ(ВТПланЗадачПоАннулированиюОК.ИмеющаясяЗадачаГотовностиКВыставлению) КАК ИмеющаясяЗадачаГотовностиКВыставлению
		|ИЗ
		|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязьДоходовИРасходов КАК ВТСвязьДоходовИРасходов
		|		ПО ВТСвязьУчетныхЕдиниц.ГУИД = ВТСвязьДоходовИРасходов.ГУИДСтрокиСУЕ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходы КАК ВТДоходы
		|		ПО (ВТСвязьДоходовИРасходов.ГУИДСтрокиДохода = ВТДоходы.ГУИДСтрокиДохода)
		|			И (ВТДоходы.ТребуетсяАннулироватьОтчетКомитенту)
		|			И НЕ (ВТДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
		|					ИЛИ ВТДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланЗадачПоАннулированиюОК КАК ВТПланЗадачПоАннулированиюОК
		|		ПО ВТСвязьУчетныхЕдиниц.Клиент = ВТПланЗадачПоАннулированиюОК.Клиент
		|			И ВТСвязьУчетныхЕдиниц.Договор = ВТПланЗадачПоАннулированиюОК.Договор
		|ГДЕ
		|	НЕ ВТСвязьУчетныхЕдиниц.НеАктивна
		|	И НЕ ВТСвязьУчетныхЕдиниц.Удалена
		//|	И НЕ ВТДоходы.НеВыставлятьКлиенту
		//|	И (ВТДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвязьУчетныхЕдиниц.Договор,
		|	ВТСвязьУчетныхЕдиниц.Клиент,
		|	ВТСвязьУчетныхЕдиниц.ОтветственныйЗаУчет
		|;
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПланЗадачПоСУЕ.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
		|	ВТПланЗадачПоСУЕ.ИмеющаясяЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
		|	""ЗадачиВСУЕ"" КАК ВидЗадачи
		|ИЗ
		|	ВТПланЗадачПоСУЕ КАК ВТПланЗадачПоСУЕ
		|ГДЕ
		|	ВТПланЗадачПоСУЕ.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПланЗадачПоДоходам_ДоплатныеКТК.ОтветственныйЗаУчет,
		|	ВТПланЗадачПоДоходам_ДоплатныеКТК.ИмеющаясяЗадачаГотовностиКВыставлению,
		|	""ДоплатныеКТК""
		|ИЗ
		|	ВТПланЗадачПоДоходам_ДоплатныеКТК КАК ВТПланЗадачПоДоходам_ДоплатныеКТК
		|ГДЕ
		|	ВТПланЗадачПоДоходам_ДоплатныеКТК.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПланЗадачПоДоходам.ОтветственныйЗаУчет,
		|	ВТПланЗадачПоДоходам.ИмеющаясяЗадачаГотовностиКВыставлению,
		|	""ВР""
		|ИЗ
		|	ВТПланЗадачПоДоходам КАК ВТПланЗадачПоДоходам
		|ГДЕ
		|	ВТПланЗадачПоДоходам.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		|
		// Евросиб US 91362 TA 104075 Рыбьяков К.А. 01.07.2025 ((
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПланЗадачПоДоходам_ДопРасходы.ОтветственныйЗаУчет,
		|	ВТПланЗадачПоДоходам_ДопРасходы.ИмеющаясяЗадачаГотовностиКВыставлению,
		|	""ДопРасходы""
		|ИЗ
		|	ВТПланЗадачПоДоходам_ДопРасходы КАК ВТПланЗадачПоДоходам_ДопРасходы
		|ГДЕ
		|	ВТПланЗадачПоДоходам_ДопРасходы.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		// Евросиб Рыбьяков К.А. 01.07.2025 ))
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПланЗадачПоКорректировкеВР.ОтветственныйЗаУчет,
		|	ВТПланЗадачПоКорректировкеВР.ИмеющаясяЗадачаГотовностиКВыставлению,
		|	""КорректировкаВР""
		|ИЗ
		|	ВТПланЗадачПоКорректировкеВР КАК ВТПланЗадачПоКорректировкеВР
		|ГДЕ
		|	ВТПланЗадачПоКорректировкеВР.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПланЗадачПоАннулированиюОК.ОтветственныйЗаУчет,
		|	ВТПланЗадачПоАннулированиюОК.ИмеющаясяЗадачаГотовностиКВыставлению,
		|	""АннулированиеВР""
		|ИЗ
		|	ВТПланЗадачПоАннулированиюОК КАК ВТПланЗадачПоАннулированиюОК
		|ГДЕ
		|	ВТПланЗадачПоАннулированиюОК.ИмеющаясяЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)";
		//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
		
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц",СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов",СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("Доходы",Доходы.Выгрузить());
	Запрос.УстановитьПараметр("ЦФОСделки",ЦФО);
	//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
	Запрос.УстановитьПараметр("Состояния",Состояния.Выгрузить());
	//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
	//Запрос.УстановитьПараметр("МассивОбновленныхКТК",МассивОбновленныхКТК);
	//
	////Беляев: проверить
	//Если МассивОбновленныхКТК = Неопределено Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТСвязьУчетныхЕдиниц.Контейнер В (&МассивОбновленныхКТК)", "ИСТИНА");
	//КонецЕсли;	
	////Беляев)
	
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//Возврат ТЗ;
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	СтруктураРезультата = Новый Структура;
	////СтруктураРезультата.Вставить("ТЗПланЗадачПоСоставуПоезда", РезультатПакет[3].Выгрузить());
	//СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоСоставуПоезда", РезультатПакет[4].Выгрузить());
	////СтруктураРезультата.Вставить("ТЗПланЗадачПоДоходам", РезультатПакет[5].Выгрузить());
	//СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоДоходам_ДоплатныеКТК", РезультатПакет[6].Выгрузить());   
	//СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоДоходам", РезультатПакет[8].Выгрузить());
	//СтруктураРезультата.Вставить("ТЗЗадачиИОтветственые", РезультатПакет[9].Выгрузить());
	//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоСоставуПоезда", РезультатПакет[РезультатПакет.Количество()-12].Выгрузить());
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоДоходам_ДоплатныеКТК", РезультатПакет[РезультатПакет.Количество()-10].Выгрузить());   
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоДоходам", РезультатПакет[РезультатПакет.Количество()-5].Выгрузить());
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоДопРасходам", РезультатПакет[РезультатПакет.Количество()-4].Выгрузить());
	// Евросиб Рыбьяков К.А. 04.06.2025 ))
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоКорректировкаВР", РезультатПакет[РезультатПакет.Количество()-3].Выгрузить());
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
	СтруктураРезультата.Вставить("ТЗТребуемыеЗадачиПоАннулированиюВР", РезультатПакет[РезультатПакет.Количество()-2].Выгрузить());
	//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
	СтруктураРезультата.Вставить("ТЗЗадачиИОтветственые", РезультатПакет[РезультатПакет.Количество()-1].Выгрузить());
	//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
	Возврат СтруктураРезультата;

КонецФункции

////++ДИТ Гаузер А.В. Ticket#0252064 03.08.2022 //ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, закомментировал
//Функция ЕстьЗаполненныеРеквизитыВТЧСвязьУчетныхЕдиниц()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СвязьУчетныхЕдиниц.Клиент КАК Клиент,
//	|	СвязьУчетныхЕдиниц.Договор КАК Договор,
//	|	СвязьУчетныхЕдиниц.Протокол КАК Протокол
//	|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
//	|ИЗ
//	|	&СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
//	|ГДЕ
//	|	НЕ СвязьУчетныхЕдиниц.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	И НЕ СвязьУчетныхЕдиниц.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|	И НЕ СвязьУчетныхЕдиниц.Протокол = ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТСвязьУчетныхЕдиниц.Клиент КАК Клиент
//	|ИЗ
//	|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц";
//	
//	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц",СвязьУчетныхЕдиниц.Выгрузить());
//	Результат = Запрос.Выполнить().Выгрузить();
//	
//	Возврат ?(Результат.Количество(), Истина, Ложь);
//КонецФункции
////--ДИТ Гаузер А.В. Ticket#0252064 03.08.2022

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало, (закомментировал функцию, не используется)
////ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, начало
//Функция ПолучитьСтрокиСУЕсЗаполненнымиПолямиДляЗадач()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СвязьУчетныхЕдиниц.Клиент КАК Клиент,
//	|	СвязьУчетныхЕдиниц.Договор КАК Договор,
//	|	СвязьУчетныхЕдиниц.Протокол КАК Протокол,
//	|	СвязьУчетныхЕдиниц.Заявка КАК Заявка
//	|ПОМЕСТИТЬ ВТСвязьУчетныхЕдиниц
//	|ИЗ
//	|	&СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
//	|ГДЕ
//	|	НЕ СвязьУчетныхЕдиниц.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	И НЕ СвязьУчетныхЕдиниц.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|	И НЕ СвязьУчетныхЕдиниц.Протокол = ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВТСвязьУчетныхЕдиниц.Договор КАК Договор,
//	|	ВТСвязьУчетныхЕдиниц.Заявка КАК Заявка
//	|ИЗ
//	|	ВТСвязьУчетныхЕдиниц КАК ВТСвязьУчетныхЕдиниц";
//	
//	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц",СвязьУчетныхЕдиниц.Выгрузить(,"Клиент,Договор,Протокол,Заявка"));
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции
////ДИТ, Беляев СЮ, Ticket#0337314, 09-01-2024, конец
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

Процедура ПроверитьВозможностьОтменыПроведенияСделки(Отказ)
	Отказ = РаботаСоСделкамиСервер.ЕстьПроведенныеРТУКСделке(Ссылка);
	Если Отказ Тогда
		СообщениеОбОшибке = "К сделке есть выставленные РТУ, обратитесь в Бэк-офис.";
	КонецЕсли;
	Если Не Отказ Тогда
		Отказ = РаботаСоСделкамиСервер.ЕстьАктуальныеАкцептыКСделке(Ссылка);         
		СообщениеОбОшибке = "К сделке есть акцептованные расходы, обратитесь в Бэк-офис";
	КонецЕсли;                                                                           
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
	// Евросиб Фролов (24.03.2022 US №40767, Task №48649
	ПроверитьВозможностьОтменыПроведенияДокумента(Отказ);
	// Евросиб Фролов)
КонецПроцедуры

Функция ПолучитьЗначениеТаблицыПоГУИДу(ИмяТаблицы, ГУИД)
	
	Результат = "";
	
	Для каждого Стр из ЭтотОбъект[ИмяТаблицы] Цикл
		
		Если Стр.ГУИД = ГУИД И ИмяТаблицы = "ДоходыВагоны" Тогда
			Результат = Стр.Вагон;
		ИначеЕсли Стр.ГУИД = ГУИД И ИмяТаблицы = "ДоходыКТК" Тогда
			Результат = Стр.КТК;
		ИначеЕсли Стр.ГУИД = ГУИД И ИмяТаблицы = "ДоходыТД" Тогда
			Результат = Стр.ТД;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСформированоВыставлено()
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, начало (перенесено из процедуры ПередЗаписью())
	Для каждого СтрСУЕ Из СвязьУчетныхЕдиниц Цикл
		СтрСУЕ.ДокументыВыставлены = Ложь;
		СтрСУЕ.ДокументыСформированы = Ложь;
	КонецЦикла;
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&ТЧСвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов 
	//ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, начало (Сохраним ГУИД главных строк, по которым установлено НеВыставлятьКлиенту)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|   СделкаДоходы.ЗадачаГотовностиКВыставлению  как ЗадачаГотовностиКВыставлению, 
	|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|   СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки,
	|   ВЫРАЗИТЬ(СделкаДоходы.КорректировкаДокумента КАК Документ.КорректировкаРеализации) КАК КорректировкаДокумента
	|ПОМЕСТИТЬ ВТ_Доходы_ВСЕ
	|ИЗ
	|	&ТЧДоходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы_с_НеВыставлятьКлиенту
	|ИЗ
	|	ВТ_Доходы_ВСЕ КАК СделкаДоходы
	|ГДЕ
	//|	СделкаДоходы.ГУИДИсправляемойСтроки = """"
	//|	И СделкаДоходы.НеВыставлятьКлиенту
	//|  	И ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) <> Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
	|	СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
	|	И СделкаДоходы.НеВыставлятьКлиенту
	//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, конец
    //ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.УчДокумент КАК УчДокумент ,
	//Евросиб Максимова 27042021 #214107
	|   СделкаДоходы.ЗадачаГотовностиКВыставлению  как ЗадачаГотовностиКВыставлению, 
	//ДИТ, Беляев СЮ, Ticket#0270168, 29-04-2022, начало
	|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки 
	//ДИТ, Беляев СЮ, Ticket#0270168, 29-04-2022, конец
	//Евросиб Максимова 27042021 #214107
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	//|	&ТЧДоходы КАК СделкаДоходы  
	//ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, начало
	|	ВТ_Доходы_ВСЕ КАК СделкаДоходы  
	//ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, конец
	//Евросиб - АСуслов 29.04.2021 13:12:07 #0229525 
	//(
	//|  ГДЕ СделкаДоходы.ГУИДИсправляемойСтроки = """"
	//|  И ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) <> Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//)
	//Евросиб - АСуслов 29.04.2021 13:12:19 #0229525   
	//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, начало
	|ГДЕ СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
	//ДИТ, Беляев СЮ, Ticket#0352300, 22-05-2024, конец
	//ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, начало (Добавляем РТУ из строк с корректировками, в случае установки НеВыставлятьКлиенту на главной строке)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИДИсправляемойСтроки,
	|	ЛОЖЬ,
	|	СделкаДоходы.УчДокумент,
	|	СделкаДоходы.ЗадачаГотовностиКВыставлению,
	|	СделкаДоходы.УслугаВнеСтавки
	|ИЗ
	|	ВТ_Доходы_ВСЕ КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.ГУИДИсправляемойСтроки В
	|			(ВЫБРАТЬ
	|				ВТ_Доходы_с_НеВыставлятьКлиенту.ГУИД
	|			ИЗ
	|				ВТ_Доходы_с_НеВыставлятьКлиенту КАК ВТ_Доходы_с_НеВыставлятьКлиенту)
	|	И НЕ(СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|				ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)
	//ДИТ, Беляев СЮ, Ticket#0280552, 03-08-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, начало
	|	,СделкаСвязьУчетныхЕдиниц.ОтключитьКонтрольВыполненияЗадачи КАК ОтключитьКонтрольВыполненияЗадачи
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, конец
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	&ТЧСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, начало (получим список КТК с установленной ОтключитьКонтрольВыполненияЗадачи и имеющие хоть какие-то выставленные доходы)
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_Доходы_ВСЕ.УчДокумент.Проведен, ЛОЖЬ)) КАК ДокументыСформированы
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы_ВСЕ КАК ВТ_Доходы_ВСЕ
	|			ПО 
	|				(ВТ_Доходы_ВСЕ.ГУИД = СделкаСвязьДоходовИРасходов.Доходы)
	|		ПО  СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.ОтключитьКонтрольВыполненияЗадачи
	|	И ВТ_Доходы_ВСЕ.НеВыставлятьКлиенту = ЛОЖЬ
	|   И НЕ ВТ_Доходы_ВСЕ.ГУИД ЕСТЬ NULL
	//|   И ВТ_Доходы_ВСЕ.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка) //Евросиб(ДИТ), Беляев СЮ, Ticket#0363445, 21-08-2024, закомментировал (чтобы ОтключитьКонтрольВыполненияЗадачи работала на наличие любых выставленных РТУ)
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.ГУИД
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЕСТЬNULL(ВТ_Доходы_ВСЕ.УчДокумент.Проведен, ЛОЖЬ)) = ИСТИНА	
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ) КАК ДокументыСформированы,
	|	ЕСТЬNULL(СделкаДоходы.УчДокумент.Выставлен, ЛОЖЬ) КАК ДокументыВыставлены
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
	|			ПО 
	|				(СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы)
	|		ПО  СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	|   И НЕ СделкаДоходы.ГУИД ЕСТЬ NULL 
	//Евросиб Максимова 27042021 #214107	
	|   И СделкаДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка) 
	//Евросиб Максимова 27042021 #214107	                                                      
	//ДИТ, Беляев СЮ, Ticket#0270168, 29-04-2022, начало
	//учитывается основная услуга всегда и допуслуги если документы не выставлены
	|   И (НЕ СделкаДоходы.УслугаВнеСтавки ИЛИ 
	|			(СделкаДоходы.УслугаВнеСтавки И (СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО 
	|												ИЛИ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL)))
	//ДИТ, Беляев СЮ, Ticket#0270168, 29-04-2022, конец
	|ИТОГИ
	|	МИНИМУМ(ДокументыСформированы),
	|	МИНИМУМ(ДокументыВыставлены)
	|ПО
	|	ГУИД";  
	
	Запрос.УстановитьПараметр("ТЧСвязьДоходовИРасходов", СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходы", Доходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧСвязьУчетныхЕдиниц", СвязьУчетныхЕдиниц.Выгрузить());
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаГУИД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, начало
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
	РезультатЗапроса = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1];
	ВыборкаГУИД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаГУИД.Следующий() Цикл
		//СтрокаСУЕ = СвязьУчетныхЕдиниц.Найти(ВыборкаГУИД.ГУИД, "ГУИД");
		//Евросиб Максимова 27042021 #214107	
		СтрокаСУЕ = СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИД",ВыборкаГУИД.ГУИД));
		Для каждого Стр из СтрокаСУЕ Цикл		
			ЗаполнитьЗначенияСвойств(Стр, ВыборкаГУИД, "ДокументыСформированы, ДокументыВыставлены");
		КонецЦикла;	
		//Евросиб Максимова 27042021 #214107	
	КонецЦикла;
	
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, начало
	РезультатЗапросаПоОтключитьКонтрольВыполненияЗадачи = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2];
	ВыборкаГУИД = РезультатЗапросаПоОтключитьКонтрольВыполненияЗадачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГУИД.Следующий() Цикл
		СтрокаСУЕ = СвязьУчетныхЕдиниц.Найти(ВыборкаГУИД.ГУИД,"ГУИД");
		СтрокаСУЕ.ДокументыСформированы = ВыборкаГУИД.ДокументыСформированы;
	КонецЦикла;
	//ДИТ, Беляев СЮ, US 56030/ TA 56033, 19-09-2022, конец
КонецПроцедуры

//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
Функция ПолучитьУслугуИзКалькуляции(вхКалькуляция)   
	Результат = Справочники.Номенклатура.ПустаяСсылка();   
	Если НЕ ЗначениеЗаполнено(вхКалькуляция) Тогда
		Возврат Результат;
	КонецЕсли;		
		
	Если вхКалькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Количество() > 0 Тогда
		// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 ((
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхКалькуляция, "ОсновнаяУслуга");
		//Результат = вхКалькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга;
		// Евросиб Рыбьяков К.А. 02.07.2024 ))	
	ИначеЕсли вхКалькуляция.НФ_ВыбранныеСтавки.Количество() > 0 Тогда
		Результат = Константы.УслугаФрахтаДляКалькуляции.Получить();
	КонецЕсли;	
	Возврат Результат;
КонецФункции    
//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец

//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
Функция ПолучитьСписокКонтейнеровПоНеВыставленнымДокументам(МассивГУИДСтрокДоходовБезДокументов, ТабличнаяЧастьДоходыКТК)
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоходыКТК.КТК КАК КТК,
		|	ДоходыКТК.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_ДоходыКТК
		|ИЗ
		|	&ДоходыКТК КАК ДоходыКТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоходыКТК.КТК КАК КТК
		|ИЗ
		|	ВТ_ДоходыКТК КАК ВТ_ДоходыКТК
		|ГДЕ
		|	ВТ_ДоходыКТК.ГУИД В(&МассивГУИДСтрокДоходовБезДокументов)";
	Запрос.УстановитьПараметр("ДоходыКТК", ТабличнаяЧастьДоходыКТК);
	Запрос.УстановитьПараметр("МассивГУИДСтрокДоходовБезДокументов", МассивГУИДСтрокДоходовБезДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = Результат + ВыборкаДетальныеЗаписи.КТК + ";";
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции 
//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец   

//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, начало
Функция ПолучитьСписокУслугПоНеВыставленнымДокументам(МассивГУИДСтрокДоходовБезДокументов, ТабличнаяЧастьДоходы)
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Доходы.Услуга КАК Услуга,
		|	Доходы.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_Доходы
		|ИЗ
		|	&Доходы КАК Доходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Доходы.Услуга КАК Услуга
		|ИЗ
		|	ВТ_Доходы КАК ВТ_Доходы
		|ГДЕ
		|	ВТ_Доходы.ГУИД В(&МассивГУИДСтрокДоходовБезДокументов)";
	Запрос.УстановитьПараметр("Доходы", ТабличнаяЧастьДоходы);
	Запрос.УстановитьПараметр("МассивГУИДСтрокДоходовБезДокументов", МассивГУИДСтрокДоходовБезДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = Результат + ВыборкаДетальныеЗаписи.Услуга + ",";
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, конец

//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
Процедура ЗаполнитьСостоянияПоЗадачамГотовностиКВыставлению(ТабличнаяЧасть, ТЗЗадачиИОтветственые)
	МассивУникальныхЗадачСопровождения = Новый Массив;
	Для каждого Стр из ТабличнаяЧасть Цикл	
		Если ЗначениеЗаполнено(Стр.ЗадачаГотовностиКВыставлению) Тогда
			МассивУникальныхЗадачСопровождения.Добавить(Стр.ЗадачаГотовностиКВыставлению);
		КонецЕсли;
	КонецЦикла;
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивУникальныхЗадачСопровождения);
	
	//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, начало
	ТабличнаяЧастьДоходы = Доходы.Выгрузить(,"Услуга, ГУИД");
	ТабличнаяЧастьДоходыКТК = ДоходыКТК.Выгрузить(, "КТК, ГУИД");
	//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, конец
	
	Для каждого ЗадачаСопровождения из МассивУникальныхЗадачСопровождения Цикл
	
		НайденныеСтрокиПоЗадаче = ТабличнаяЧасть.НайтиСтроки(Новый Структура("ЗадачаГотовностиКВыставлению", ЗадачаСопровождения));
		
		ТекЗадачаВТЧСостояния = Состояния.Найти(ЗадачаСопровождения, "Состояние");
		
		//ОПРЕДЕЛИТЬ ОТВЕТСТВЕННОГО И ВИД ЗАДАЧИ
		ВидЗадачи = "";
		Ответственный = Справочники.Пользователи.ПустаяСсылка();
		ТекЗадача_ТЗЗадачиИОтветственые =  ТЗЗадачиИОтветственые.Найти( ЗадачаСопровождения, "ЗадачаГотовностиКВыставлению");
		Если ТекЗадача_ТЗЗадачиИОтветственые  <> Неопределено Тогда
			Ответственный = ТекЗадача_ТЗЗадачиИОтветственые.ОтветственныйЗаУчет;
			ВидЗадачи = ТекЗадача_ТЗЗадачиИОтветственые.ВидЗадачи;
		Иначе
			Если ТекЗадачаВТЧСостояния <> Неопределено Тогда
				Ответственный = ТекЗадачаВТЧСостояния.Исполнитель;
			КонецЕсли;
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(Ответственный) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный,"Недействителен") Тогда  
		//	Продолжить;
		//КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, начало (задачи должны создаваться и на недействительного сотрудника)
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 78729/ TASK 78731, 13-12-2023, конец
			
		//При формировании записи табличной части «Состояния» для задач «Требуется создать комплект документов», 
		//в поле «Примечание» записывать данные реквизитов «ОсновнаяУслуга» документа калькуляции, «Клиент» и «Договор» табличной части «СвязьУчетныхЕдиниц» 
		
		//Для задачи по доплатным КТК текст поля «Примечание» должен содержать значения рекизитов «ОсновнаяУслуга» документа калькуляции содержащейся в поле «Доплата_Калькуляция», 
		//«Доплата_Клиент» и «Доплата_Договор» табличной части «СвязьУчетныхЕдиниц», текст «Доплата. Обновленные КТК:», перечисление списка КТК

		//Если задача формируется по дополнительным услугам и ВР (в экономике сделки установлен признак «ВР/доп готово к выставлению») поле «Примечание» должно автоматически 
		//заполниться значением из поля «Номенклатура», «Источник появления строки экономики», «Клиент», «Договор» соответствующей строки экономики сделки, данными из поля. /
		
		//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, начало (перенёс код ниже, закомментировал)
		//УслугаДляПримечания = ПолучитьУслугуИзКалькуляции(НайденныеСтрокиПоЗадаче[0].Калькуляция);
		//Если ВидЗадачи = "ВР" Тогда
		//	УслугаДляПримечания = СтрШаблон("%1; %2",НайденныеСтрокиПоЗадаче[0].Услуга,НайденныеСтрокиПоЗадаче[0].ИсточникПоявленияСтрокиЭкономики);
		//КонецЕсли;
		//КлиентДляПримечания = НайденныеСтрокиПоЗадаче[0].Клиент;
		//ДоговорДляПримечания = НайденныеСтрокиПоЗадаче[0].Договор;
		//ПримечаниеТЧ = СтрШаблон("%1; %2; %3;",УслугаДляПримечания,КлиентДляПримечания,ДоговорДляПримечания);	
		//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, конец
		МассивГУИДСтрокДоходовБезДокументов = Новый Массив;
		
		//СТАТУС ВЫПОЛНЕНИЯ ПО ЗАДАЧЕ
		ВсеДокументыСформированы = Истина;
		Для каждого СтрокаТЧпоЗадаче из НайденныеСтрокиПоЗадаче Цикл			               
			ДокументыСформированыВТекущейСтроке = Ложь;
			Если ТабличнаяЧасть = Доходы Тогда  
				ДокументыСформированыВТекущейСтроке = ЗначениеЗаполнено(СтрокаТЧпоЗадаче.УчДокумент) ИЛИ ЗначениеЗаполнено(СтрокаТЧпоЗадаче.КорректировкаДокумента);
				//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
				Если ВидЗадачи = "АннулированиеВР" Тогда
					ДокументыСформированыВТекущейСтроке = ЗначениеЗаполнено(СтрокаТЧпоЗадаче.КорректировкаДокумента);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец
				Если НЕ ДокументыСформированыВТекущейСтроке Тогда
					//МассивГУИДСтрокДоходовБезДокументов.Добавить(СтрокаТЧпоЗадаче.ГУИДСтрокиДохода);
					//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, начало
					МассивГУИДСтрокДоходовБезДокументов.Добавить(СтрокаТЧпоЗадаче.ГУИД);
					//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, конец
				КонецЕсли;
			Иначе 
				ДокументыСформированыВТекущейСтроке = СтрокаТЧпоЗадаче.ДокументыСформированы ИЛИ СтрокаТЧпоЗадаче.НеАктивна ИЛИ СтрокаТЧпоЗадаче.Удалена;
			КонецЕсли;
			ВсеДокументыСформированы = ВсеДокументыСформированы И ДокументыСформированыВТекущейСтроке;
		КонецЦикла;   
		
		//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, начало
		//УслугаДляПримечания = ПолучитьУслугуИзКалькуляции(НайденныеСтрокиПоЗадаче[0].Калькуляция);
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		Калькуляция = НайденныеСтрокиПоЗадаче[0].Калькуляция;
		УслугаДляПримечания = ПолучитьУслугуИзКалькуляции(Калькуляция);
		КалькуляцияДоплатная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Доплатные;
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		Если ВидЗадачи = "ВР" Тогда   
			стрСписокУслуг = ПолучитьСписокУслугПоНеВыставленнымДокументам(МассивГУИДСтрокДоходовБезДокументов, ТабличнаяЧастьДоходы);
			УслугаДляПримечания = СтрШаблон("%1; %2",стрСписокУслуг,НайденныеСтрокиПоЗадаче[0].ИсточникПоявленияСтрокиЭкономики);
		ИначеЕсли ВидЗадачи = "ДоплатныеКТК" Тогда
			УслугаДляПримечания = ПолучитьСписокУслугПоНеВыставленнымДокументам(МассивГУИДСтрокДоходовБезДокументов, ТабличнаяЧастьДоходы);
		КонецЕсли;
		КлиентДляПримечания = НайденныеСтрокиПоЗадаче[0].Клиент;
		ДоговорДляПримечания = НайденныеСтрокиПоЗадаче[0].Договор;
		ПримечаниеТЧ = СтрШаблон("%1; %2; %3;",УслугаДляПримечания,КлиентДляПримечания,ДоговорДляПримечания); 
		//ДИТ, Беляев СЮ, Ticket#0284160, 05-09-2022, конец
		
		Если ВидЗадачи = "ДоплатныеКТК" Тогда
			ПримечаниеТЧ = ПримечаниеТЧ + "Доплата. Обновленные КТК:"+ПолучитьСписокКонтейнеровПоНеВыставленнымДокументам(МассивГУИДСтрокДоходовБезДокументов, ТабличнаяЧастьДоходыКТК);
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, начало
		ИначеЕсли КалькуляцияДоплатная Тогда
			ПримечаниеТЧ = ПримечаниеТЧ + "Доплата";
		//ДИТ, Беляев СЮ, US 80045, 07-02-2024, конец
		КонецЕсли; 
				
		//ЗАПОЛНЕНИЕ ТЧ СОСТОЯНИЯ
		Если ТекЗадачаВТЧСостояния = Неопределено Тогда
			НоваяСтрокаСостояния = Состояния.Добавить();
			НоваяСтрокаСостояния.Исполнитель = Ответственный;
			НоваяСтрокаСостояния.Наблюдатель = Ответственный;
			НоваяСтрокаСостояния.НачалоРаботы = ТекущаяДата();
			НоваяСтрокаСостояния.Состояние = ЗадачаСопровождения;
			НоваяСтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;  
			
			НоваяСтрокаСостояния.Клиент = НайденныеСтрокиПоЗадаче[0].Клиент;
			НоваяСтрокаСостояния.Договор = НайденныеСтрокиПоЗадаче[0].Договор;
			НоваяСтрокаСостояния.Комментарий = ПримечаниеТЧ;  
			Если ТабличнаяЧасть = СвязьУчетныхЕдиниц Тогда
				НоваяСтрокаСостояния.Наблюдатель = Пользователи.ТекущийПользователь();  //Поле «Наблюдатель» заполняется значением пользователя менеджера ОРК, который изменил значение реквизита «ГотовоКВыставлению» в табличной части «СвязьУчетныхЕдиниц»
			КонецЕсли;
			
		Иначе
			//ПредыдущийИсполнитель = ТекЗадачаВТЧСостояния.Исполнитель;
			//ТекЗадачаВТЧСостояния.Исполнитель = Ответственный;
			
 			Если ТекЗадачаВТЧСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен И ТабличнаяЧасть = СвязьУчетныхЕдиниц И НЕ ВсеДокументыСформированы Тогда
				ТекЗадачаВТЧСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;	
				ТекЗадачаВТЧСостояния.НачалоРаботы = ТекущаяДата(); // ДИТ Поморцева Т.П. 37052 09.02.2022. 
				ТекЗадачаВТЧСостояния.Исполнитель = Ответственный; 
				//ДИТ, МаршевЕ Ticket#0307554 , 16.04.24 Начало
				ТекЗадачаВТЧСостояния.ЗавершениеРаботы = Неопределено;
				//ДИТ, МаршевЕ Ticket#0307554 ,  Конец ---- 
			Иначе
				//Если Ответственный = ПредыдущийИсполнитель Тогда
					Если ВсеДокументыСформированы Тогда 
						ТекЗадачаВТЧСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен;
					Иначе                                                                     
						Если ТекЗадачаВТЧСостояния.Статус <> Перечисления.СтатусыЭтапов.НаВыполнение Тогда
							ТекЗадачаВТЧСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
							ТекЗадачаВТЧСостояния.НачалоРаботы = ТекущаяДата(); // ДИТ Поморцева Т.П. 37052 09.02.2022. 
							//ДИТ, МаршевЕ Ticket#0307554 , 16.04.24 Начало
							ТекЗадачаВТЧСостояния.ЗавершениеРаботы = Неопределено;
							//ДИТ, МаршевЕ Ticket#0307554 ,  Конец ----  
						КонецЕсли;
						ТекЗадачаВТЧСостояния.Исполнитель = Ответственный;
					КонецЕсли; 
				//КонецЕсли;
			КонецЕсли;
			
			// ДИТ Поморцева Т.П. 32343 18.10.2021. конец
			ТекЗадачаВТЧСостояния.ПредыдущиеЭтапы = "";
			Если НЕ ВсеДокументыСформированы Тогда 
				ТекЗадачаВТЧСостояния.ПредыдущиеЭтапы = "999";
			КонецЕсли;  
			
			ТекЗадачаВТЧСостояния.Клиент = НайденныеСтрокиПоЗадаче[0].Клиент;
			ТекЗадачаВТЧСостояния.Договор = НайденныеСтрокиПоЗадаче[0].Договор;
			ТекЗадачаВТЧСостояния.Комментарий = ПримечаниеТЧ;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец

Функция ВыдатьСвободноеСостояниеУчета(МассивИспользованных)
	
	//Для Сч = 1 по 40 Цикл		
	//ДИТ, Беляев СЮ, Ticket#0335550, 21-12-2023, начало
	Для Сч = 1 по 80 Цикл
	//ДИТ, Беляев СЮ, Ticket#0335550, 21-12-2023, конец
		
		СостУчета = Справочники.Состояния["ТребуетсяСоздатьКомплектДокументов"+Сч];	
		Если МассивИспользованных.Найти(СостУчета) = неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат неопределено;
	
КонецФункции 

// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
Функция ВыдатьСвободноеСостояниеУчетаДляПеревыставления(МассивИспользованных)
	
	Для Сч = 1 по 30 Цикл
		СостУчета = Справочники.Состояния["ТребуетсяПеревыставитьРасходы"+Сч];
			
		Если МассивИспользованных.Найти(СостУчета) = неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат неопределено;
	
КонецФункции
// ДИТ Поморцева Т.П. 32343 12.10.2021. конец

// Евросиб US 91362 TA 104075 Рыбьяков К.А. 04.06.2025 ((
Функция ВыдатьСвободноеСостояниеУчетаДляДопРасходов(МассивИспользованных)
	
	Для Сч = 1 по 30 Цикл
		СостУчета = Справочники.Состояния["ТребуетсяСоздатьКомплектДокументовПоДопРасходам" + Сч];
			
		Если МассивИспользованных.Найти(СостУчета) = Неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
// Евросиб Рыбьяков К.А. 04.06.2025 ))

//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
Функция ВыдатьСвободноеСостояниеУчетаДляТребуетсяВнестиИзмененияВР(МассивИспользованных)
	
	Для Сч = 1 по 30 Цикл
		СостУчета = Справочники.Состояния["КорректировкаПТУТребуетсяВнестиИзмененияВР" + Сч];
			
		Если МассивИспользованных.Найти(СостУчета) = Неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, начало
Функция ВыдатьСвободноеСостояниеУчетаДляТребуетсяАннулированиеВР(МассивИспользованных)
	
	Для Сч = 1 по 30 Цикл
		СостУчета = Справочники.Состояния["ТребуетсяАннулироватьОтчетКомитенту" + Сч];
			
		Если МассивИспользованных.Найти(СостУчета) = Неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113662 / TA 115172, 01-08-2025, конец

Функция ОпределитьПериодВО(ТЗ_Переносы, ГУИД, ТекущийПериодВО)

	ИскМас_Перенос = ТЗ_Переносы.НайтиСтроки(Новый Структура("ГУИДСтроки", ГУИД) );
	Если ИскМас_Перенос.Количество() > 0 Тогда
		НовПериод = ИскМас_Перенос[0].НовыйПериодВО;
		ЗакрытиеПериодов = ИскМас_Перенос[0].ДокументЗакрытия;
	Иначе
		НовПериод = Неопределено;
		ЗакрытиеПериодов = Неопределено;
	КонецЕсли; 
	
	НовПериодВО = ?(НовПериод=Неопределено, НачалоМесяца(ТекущийПериодВО), НачалоМесяца(НовПериод) );

	РезДан = Новый Структура("НовПериодВО, ЗакрытиеПериодов", НовПериодВО, ЗакрытиеПериодов) ;
	
	Возврат РезДан; 
	
КонецФункции // ОпределитьПериодВО(ТЗ_Переносы, ГУИД, ТекущийПериодВО)
                         
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПланируемыеКДоступностиКТК.Записывать = Истина;
	
//Евросиб Гудкова( 17.02.2020 
	СтруктураОбязательныхРеквизитовШапки = Новый Структура("Организация, СтанцияОтправления, СтанцияНазначения,
	|ЦФО, Подразделение, Валюта, ТипЗаказа");
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхРеквизитовШапки, Отказ);
// 	СтруктураОбязательныхРеквизитовТЧ = Новый Структура("Номенклатура, Количество, Сумма");
//	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхРеквизитовТЧ, Отказ);
// Евросиб Гудкова)
	
	//Движения.КонтрибуцияСделок.Записывать = Истина;
	//СоответствиеДоходовИРазмеровКТК = Новый Соответствие;
	//Для каждого Стр из Доходы Цикл
	//	
	//	Если Стр.Подсыл ИЛИ Стр.НеВыставлятьКлиенту Тогда Продолжить; КонецЕсли;
	//	
	//	Движение = Движения.КонтрибуцияСделок.ДобавитьПриход();
	//	Движение.Период = Дата;
	//	Движение.Сделка = Ссылка;
	//	Движение.ДоходыГУИД = Стр.ГУИД;
	//	Движение.Клиент = Стр.Клиент;
	//	Движение.Услуга = Стр.Услуга;
	//	Движение.РазмерКТК = Стр.РазмерКТК;
	//	Движение.Себестоимость = Стр.СебестоимостьИтого;
	//	Движение.Вознаграждение = Стр.ВознаграждениеИтого;
	//	Движение.Ставка = Движение.Себестоимость + Движение.Вознаграждение;
	//	Движение.СуммаНДС = Стр.СуммаНДС;
	//	Движение.СуммаИтого = Стр.СуммаИтого;
	//	
	//	//Если ЗначениеЗаполнено(Стр.УчДокумент) Тогда
	//		СоответствиеДоходовИРазмеровКТК.Вставить(Стр.ГУИД, Стр.РазмерКТК);
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Для каждого Стр из Расходы Цикл
	//	
	//	// SIV 29-09-2020
	//	// Если Стр.Подсыл ИЛИ Стр.НеВключатьВПлановыеРасходы Тогда Продолжить; КонецЕсли;
	//	Если Стр.Подсыл ИЛИ Стр.УслугаОтключена Тогда Продолжить; КонецЕсли;
	//	
	//	Движение = Движения.КонтрибуцияСделок.ДобавитьРасход();
	//	Движение.Период = Дата;
	//	Движение.Сделка = Ссылка;
	//	Движение.РасходыГУИД = Стр.ГУИД;
	//	
	//	МасСтрРасходов = СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", Стр.ГУИД) );
	//	Для каждого Стр2 Из МасСтрРасходов Цикл
	//	
	//		Движение.ДоходыГУИД = Стр2.Доходы;
	//		Движение.РазмерКТК = СоответствиеДоходовИРазмеровКТК.Получить(Стр2.Доходы);
	//		Прервать;
	//	
	//	КонецЦикла; 
	//	//Для каждого Стр2 из СвязьДоходовИРасходов Цикл
	//	//	Если Стр.ГУИД = Стр2.Расходы Тогда
	//	//		Движение.ДоходыГУИД = Стр2.Доходы;
	//	//		Движение.РазмерКТК = СоответствиеДоходовИРазмеровКТК.Получить(Стр2.Доходы);
	//	//		Прервать;
	//	//	КонецЕсли;
	//	//КонецЦикла;
	//	Движение.Поставщик = Стр.Поставщик;
	//	Движение.Услуга = Стр.Услуга;
	//	
	//	Движение.Себестоимость = Стр.СебестоимостьИтого;
	//	Движение.Вознаграждение = Стр.ВознаграждениеИтого;
	//	Движение.Ставка = Движение.Себестоимость + Движение.Вознаграждение;
	//	Движение.СуммаНДС = Стр.СуммаНДС;
	//	Движение.СуммаИтого = Стр.СуммаИтого;
	//	
	//КонецЦикла;
	
	//Евросиб - АСуслов 14.12.2022 9:24:09 #62448
	//(
	//РаботаСоСделкамиСервер.СформироватьДвиженияРазнесенияЗатратПТУ(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 14.12.2022 9:24:22 #62448
	//Евросиб - АСуслов 18.08.2022 17:31:43 #55129
	//(
	РаботаСоСделкамиСервер.СформироватьДвиженияРазнесениеРасходов(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 18.08.2022 17:31:45 #55129
	
	РаботаСоСделкамиСервер.СформироватьДвиженияАктуальныеЖДН(ЭтотОбъект);

	//Евросиб Каблов 20.01.2020 (
	
	//Евросиб Коханенко Н.А. #62003 14.12.2022 ( 
	//запись в РС перенесена в общий модуль ЕСОбменСервер, процедуру ВыгрузитьСделкиПривязанныеКНакладнымЭтран
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	НакладныеСделки.ЖДН КАК Накладная,
	//               |	НакладныеСделки.Ссылка КАК Сделка
	//               |ИЗ
	//               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК НакладныеСделки
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиПривязанныеКНакладнымЭТРАН КАК СделкиПривязанныеКНакладнымЭТРАН
	//               |		ПО НакладныеСделки.Ссылка = СделкиПривязанныеКНакладнымЭТРАН.Сделка
	//               |			И НакладныеСделки.ЖДН = СделкиПривязанныеКНакладнымЭТРАН.Накладная
	//               |ГДЕ
	//               |	СделкиПривязанныеКНакладнымЭТРАН.ПривязкаВыгруженаВРИТМ ЕСТЬ NULL
	//               |	И НакладныеСделки.Ссылка = &Ссылка
	//               |	И НакладныеСделки.ЖДН <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	//ВыборкаНакладныхСделки = Запрос.Выполнить().Выбрать();
	//
	//ТекДата = ТекущаяДатаСеанса();
	//
	//Пока ВыборкаНакладныхСделки.Следующий() Цикл
	//	ЗаписьСделкиПривязаннойКНакладной = РегистрыСведений.СделкиПривязанныеКНакладнымЭТРАН.СоздатьМенеджерЗаписи();
	//	ЗаписьСделкиПривязаннойКНакладной.Сделка = ВыборкаНакладныхСделки.Сделка;
	//	ЗаписьСделкиПривязаннойКНакладной.Накладная = ВыборкаНакладныхСделки.Накладная;
	//	ЗаписьСделкиПривязаннойКНакладной.ДатаПривязки = ТекДата;
	//	ЗаписьСделкиПривязаннойКНакладной.Записать();
	//КонецЦикла;
	//Евросиб Коханенко Н.А. #62003 14.12.2022 )

	//Евросиб Каблов 20.01.2020 )

	// проверка наличия вагонов, которые отсутствуют в регистре ВагоныВОтправках
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	               |ПОМЕСТИТЬ СвязьУчетныхЕдиницЪ
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВагоныВОтправке.Вагон КАК Вагон,
	               |	СделкаРейсы.Ссылка КАК СделкаПлан
	               |ПОМЕСТИТЬ ВагоныВОтправкеЪ
	               |ИЗ
	               |	Документ.Сделка.Рейсы КАК СделкаРейсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	               |		ПО СделкаРейсы.Рейс = ВагоныВОтправке.Отправка
	               |ГДЕ
	               |	СделкаРейсы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВагоныВОтправкеЪ.Вагон КАК ВагонПлан,
	               |	СвязьУчетныхЕдиницЪ.Вагон КАК ВагонФакт,
	               |	ЕСТЬNULL(СвязьУчетныхЕдиницЪ.Сделка, ВагоныВОтправкеЪ.СделкаПлан) КАК Сделка,
	               |	ЕСТЬNULL(СвязьУчетныхЕдиницЪ.Вагон.ТипТС, ВагоныВОтправкеЪ.Вагон.ТипТС) КАК ТипТС,
	               |	ЕСТЬNULL(СвязьУчетныхЕдиницЪ.Вагон.ТипТС.ТЕУ, ВагоныВОтправкеЪ.Вагон.ТипТС.ТЕУ) КАК ТЕУ
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	СвязьУчетныхЕдиницЪ КАК СвязьУчетныхЕдиницЪ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВагоныВОтправкеЪ КАК ВагоныВОтправкеЪ
	               |		ПО СвязьУчетныхЕдиницЪ.Вагон = ВагоныВОтправкеЪ.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Итоговая.ВагонПлан КАК ВагонПлан,
	               |	Итоговая.ВагонФакт КАК ВагонФакт,
	               |	Итоговая.Сделка КАК Сделка,
	               |	Итоговая.ТипТС КАК ТипТС,
	               |	Итоговая.ТЕУ КАК ТЕУ
	               |ИЗ
	               |	Итоговая КАК Итоговая
	               |ГДЕ
	               |	(ЕСТЬNULL(Итоговая.ВагонПлан, 0) = 0
	               |			ИЛИ ЕСТЬNULL(Итоговая.ВагонФакт, 0) = 0)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТЗ_ПоСделке = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ_ПоСделке Цикл
		Набор = РегистрыСведений.РассылкаПоПланФактВагонов.СоздатьНаборЗаписей();
		Набор.Отбор.Сделка.Установить(Стр.Сделка);
		Набор.Отбор.ВагонПлан.Установить(?(ЗначениеЗаполнено(Стр.ВагонПлан),Стр.ВагонПлан,Справочники.тс.ПустаяСсылка()));
		Набор.Отбор.ВагонФакт.Установить(?(ЗначениеЗаполнено(Стр.ВагонФакт),Стр.ВагонФакт,Справочники.тс.ПустаяСсылка()));
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Продолжить;
		КонецЕсли;		

		МенеджерЗаписи = РегистрыСведений.РассылкаПоПланФактВагонов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Стр);
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	ПроставитьГуидыДоходныхСтрокВКорСНП(); //Евросиб Шевченко А.В. US 95275 TA 123179 05.12.2025
	
	//Евросиб Каблов 07.06.2023 ( 68187
	ОбновитьРасчетыСНП();
	//Евросиб Каблов 07.06.2023 )
	// Евросиб US 91362 TA 104075 Рыбьяков К.А. 16.04.2025 ((
	ОбновитьРасчетыДополнительныхРасходов();
	// Евросиб Рыбьяков К.А. 16.04.2025 ))
	
	//Евросиб - АСуслов 28.10.2021 23:38:33 #
	//(
	//РаботаСоСделкамиСервер.ЗаписатьПотребностьПоискаНакладнойПослеГруженогоПлеча(ЭтотОбъект);
	РаботаСоСделкамиСервер.СформироватьДвиженияОжиданиеПодбораНакладнойПослеГруженогоПлеча(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 28.10.2021 23:38:33 #
	//Евросиб - АСуслов 21.08.2021 14:11:44 #33698
	//(
	//движения по регистрам плановые расходы
	УчетДоходовРасходовСервер.Сделка_СформироватьДвиженияДоходыРасходы(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 21.08.2021 14:11:45 #33698 
	//Евросиб - АСуслов 19.12.2022 13:06:19 #62448
	//(
	//Если НЕ БыстраяЗапись_ПереносРасходов И Не ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
	//	ЗаполнитьУчетныеДокументыВАкцепте();
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 19.12.2022 13:06:22 #62448
КонецПроцедуры

Функция ПоДанномуКТКОткрытПланПодхода(КТК, Период)
	
	Результат = Новый Структура("Контейнер,Сток,Контрагент,Назначение,ДатаПриемаВСток,СрокВозврата,ПлановаяДатаПрибытия,Количество",,,,,,,,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланируемыеКДоступностиКТКОстатки.Контейнер КАК Контейнер,
	               |	ПланируемыеКДоступностиКТКОстатки.Сток КАК Сток,
	               |	ПланируемыеКДоступностиКТКОстатки.Контрагент КАК Контрагент,
	               |	ПланируемыеКДоступностиКТКОстатки.Назначение КАК Назначение,
	               |	ПланируемыеКДоступностиКТКОстатки.ДатаПриемаВСток КАК ДатаПриемаВСток,
	               |	ПланируемыеКДоступностиКТКОстатки.СрокВозврата КАК СрокВозврата,
	               |	ПланируемыеКДоступностиКТКОстатки.ПлановаяДатаПрибытия КАК ПлановаяДатаПрибытия,
	               |	ПланируемыеКДоступностиКТКОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПланируемыеКДоступностиКТК.Остатки(&Период, Контейнер = &Контейнер) КАК ПланируемыеКДоступностиКТКОстатки";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контейнер", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДокДвиженияПоКТКИДате(КТК, ДатаЪ)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сток_ДвижениеПоСтокам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.сток_ДвижениеПоСтокам КАК сток_ДвижениеПоСтокам
	               |ГДЕ
	               |	сток_ДвижениеПоСтокам.Дата = &Дата
	               |	И сток_ДвижениеПоСтокам.КТК = &КТК";
	Запрос.УстановитьПараметр("Дата", ДатаЪ);
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
	
КонецПроцедуры

Функция ПолучитьПараметрыПоКонтейнеру(Заявка, Контейнер)
	
	Результат = Новый Структура("ДатаМин, ДатаМакс, СтанцияОтправления, СтанцияПрибытия");
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ЗаявкаПереченьРейсов.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
	               |	МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия,
	               |	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |ГДЕ
	               |	ЗаявкаПереченьРейсов.Ссылка = &Ссылка
	               |	И ТИПЗНАЧЕНИЯ(ЗаявкаПереченьРейсов.Рейс) = ТИП(Справочник.РейсыЖД)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаявкаПереченьРейсов.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.РейсДатаОтправления КАК РейсДатаОтправления,
	               |	Т1.РейсДатаПрибытия КАК РейсДатаПрибытия,
	               |	Т1.Ссылка КАК Ссылка,
	               |	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
	               |	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения
	               |ИЗ
	               |	Т1 КАК Т1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ПО (Т1.Ссылка = ЗаявкаСоставУслуги.Ссылка
	               |				И ЗаявкаСоставУслуги.НомерКТК = &НомерКТК)";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("НомерКТК", Контейнер);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.ДатаМин = Ответ.РейсДатаОтправления;
		Результат.ДатаМакс = Ответ.РейсДатаПрибытия;
		Результат.СтанцияОтправления = Ответ.СтанцияОтправления;
		Результат.СтанцияПрибытия = ОТвет.СтанцияНазначения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиНомерГруженойНакладнойПоСлежениюПоКТК(КТК, НачалоПериода, КонецПериода, СтанцияПогрузки, СтанцияВыгрузки)
	
	Результат = Новый Структура("НомерЖДН, СсылкаЖДН, Вагон");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	               |	ДислокацияКонтейнеров.Период КАК Период,
	               |	ДислокацияКонтейнеров.Контейнер КАК Контейнер,
	               |	ДислокацияКонтейнеров.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияКонтейнеров.НомерНакладной КАК НомерНакладной,
	               |	ДислокацияКонтейнеров.ИндексПоезда КАК ИндексПоезда,
	               |	ДислокацияКонтейнеров.Вагон КАК Вагон,
	               |	э_Накладная.Ссылка КАК ЭТРАН_Ссылка,
	               |	ТранспортныйДокумент.Ссылка КАК ТД_Ссылка
	               |ИЗ
	               |	РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_Накладная				   
				   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |			ПО э_Накладная.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ПО ДислокацияКонтейнеров.НомерНакладной = э_Накладная.Ссылка.НакладнаяНомер
	               |ГДЕ
	               |	ДислокацияКонтейнеров.Контейнер = &Контейнер
	               |	И ДислокацияКонтейнеров.Груженый
	               |	И (ДислокацияКонтейнеров.СтанцияПогрузкиВагона = &СтанцияПогрузкиКонтейнера
	               |			ИЛИ ДислокацияКонтейнеров.СтанцияПогрузкиВагона = ЗНАЧЕНИЕ(СПравочник.Локации.ПустаяСсылка))
	               |	И ДислокацияКонтейнеров.СтанцияНазначения = &СтанцияНазначения
	               |	И ДислокацияКонтейнеров.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ДислокацияКонтейнеров.ОперацияСВагоном.ОтправлениеСоСтанции
	               |	И э_Накладная.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ э_Накладная.Ссылка.ПометкаУдаления
	               |	И э_Накладная.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Запрос.УстановитьПараметр("Контейнер", КТК);
	Запрос.УстановитьПараметр("СтанцияПогрузкиКонтейнера", СтанцияПогрузки);
	Запрос.УстановитьПараметр("СтанцияНазначения", СтанцияВыгрузки);
	Запрос.УстановитьПараметр("Дата1", НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", КонецПериода);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.НомерЖДН = Ответ.НомерНакладной;
		Результат.СсылкаЖДН = Ответ.ТД_Ссылка;
		Результат.Вагон = Ответ.Вагон;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиПодсылПорожнегоВагонаПоДислокацииВагонов(Вагон, ДатаОтправления, МаксДата, СтанцияОтправления)
	
	 НакладнаяПодсылаВагона = "";
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДислокацияВагонов.Вагон КАК Вагон
	                |ИЗ
	                |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	                |ГДЕ
	                |	ДислокацияВагонов.Вагон = &Вагон
	                |	И ДислокацияВагонов.Период < &Период
	                //|	И ДислокацияВагонов.Период >= &Период
	                |	И ДислокацияВагонов.ОперацияСВагоном.ОтправлениеСоСтанции
	                |	И НЕ ДислокацияВагонов.ОперацияСВагоном.ОперацияСКТК
	                |	И ДислокацияВагонов.СтанцияНазначения = &СтанцияНазначения
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДислокацияВагонов.Период УБЫВ";
	 
	 // Это сделать невозможно, в дислокации вагонов нет номера ЖДН!
	 
	 Возврат НакладнаяПодсылаВагона;
	
КонецФункции


Функция НайтиПодсылПорожнегоКТКПоДислокацииКТК(Контейнер, ДатаМин, ДатаМакс, СтанцияОтправления)
	
	Результат = Новый Структура("ВагонПорожнегоКТК, СтанцияПогрузкиКТК, НакладнаяКТК, РаскредитацияКТК");
	
	Возврат Результат; // SIV 27-01-21 поиск по дислокации кривой, лучше искать по ЭТРАНУ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	               |	ДислокацияКонтейнеров.НомерНакладной КАК НомерНакладной,
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208558
//	               |	ДислокацияКонтейнеров.Груженый КАК Груженый,
//	               |	ДислокацияКонтейнеров.СтанцияНазначения КАК СтанцияНазначения,
	               |	э_Накладная.Ссылка.ДатаИВремяРаскредитованияГруза КАК ДатаИВремяРаскредитованияГруза,
// Евросиб Гудкова)
	               |	ДислокацияКонтейнеров.Вагон КАК Вагон,
	               |	ДислокацияКонтейнеров.СтанцияПогрузкиКонтейнера КАК СтанцияПогрузкиКонтейнера,
	               |	ДислокацияКонтейнеров.Вагон.Наименование КАК КодВагона,
	               |	ДислокацияКонтейнеров.СтанцияПогрузкиКонтейнера.КодЖДСтанции КАК СтанцияПогрузкиКонтейнераКодЖДСтанции
	               |ИЗ
	               |	РегистрСведений.ДислокацияКонтейнеров КАК ДислокацияКонтейнеров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_Накладная				   
	               |		ПО ДислокацияКонтейнеров.НомерНакладной = э_Накладная.Ссылка.НакладнаяНомер
	               |ГДЕ
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208558
//	               |	ДислокацияКонтейнеров.Период < &Период
	               |	ДислокацияКонтейнеров.Период >= &ДатаМин
	               |	И ДислокацияКонтейнеров.Период <= &ДатаМакс
	               |	И ДислокацияКонтейнеров.Груженый
	               |	И ДислокацияКонтейнеров.СтанцияНазначения = &СтанцияНазначения
	               |	И э_Накладная.Ссылка.Дата МЕЖДУ &ДатаМин И &ДатаМакс
	               |	И НЕ э_Накладная.Ссылка.ПометкаУдаления
	               |	И э_Накладная.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
// Евросиб Гудкова)
	               |	И ДислокацияКонтейнеров.Контейнер = &Контейнер
	               |	И ДислокацияКонтейнеров.ОперацияСВагоном.ОтправлениеСоСтанции
	               |	И ДислокацияКонтейнеров.ОперацияСВагоном.ОперацияСКТК
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДислокацияКонтейнеров.Период УБЫВ";
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208558
//было 	Запрос.УстановитьПараметр("Период", ДатаМин);
 	Запрос.УстановитьПараметр("ДатаМин", НачалоДня(ДатаМин));
 	Запрос.УстановитьПараметр("ДатаМакс", КонецДня(ДатаМакс));
 	Запрос.УстановитьПараметр("СтанцияНазначения", СтанцияОтправления);
// Евросиб Гудкова)
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208558		Если Ответ.Груженый И Ответ.СтанцияНазначения = СтанцияОтправления Тогда 
			Результат.НакладнаяКТК = Ответ.НомерНакладной; 
			Результат.ВагонПорожнегоКТК = Ответ.КодВагона; 
			Результат.СтанцияПогрузкиКТК = Ответ.СтанцияПогрузкиКонтейнераКодЖДСтанции;
//Евросиб Гудкова( 04.10.2020 Ticket№ 0208558
			Результат.РаскредитацияКТК = Ответ.ДатаИВремяРаскредитованияГруза;
			//Накладная = ОбщегоНазначенияВызовСервера.НайтиНакладнуюПоНомеру(Ответ.НомерНакладной);
			//Если Накладная <> Неопределено Тогда
			//	Результат.РаскредитацияКТК = Накладная.ДатаИВремяРаскредитованияГруза;
			//Иначе 
			//	Результат.РаскредитацияКТК = Дата(1, 1, 1);
			//КонецЕсли; 
//		КонецЕсли;
// Евросиб Гудкова)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Евросиб Фролов (06.10.2021
	//Евросиб - АСуслов 17.11.2021 12:34:59 #41829
	//(
	МассивЗаявок = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("Заявка");
	ТЗЗаявки = СвязьУчетныхЕдиниц.Выгрузить(,"Заявка");
	ТЗЗаявки.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТЗЗаявки.ЗаполнитьЗначения(Ссылка, "Сделка");
	//ПривязатьСчетаКСделке(Отказ, МассивЗаявок); // Перенес алгоритм привязки в отдельную процедуру
	// Евросиб Фролов (14.04.2022 Task №50195
	
	//Субботин 76067 30.10.2023 Начало // перенесено в ОтложенноеИзменениеСервер "ОбработчикИзменения_ПривязатьОтвязатьСчетаПоСделке"
	//Если ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
	//	ПривязатьСчетаКСделке(Отказ, ТЗЗаявки); // Перенес алгоритм привязки в отдельную процедуру
	//	ОтвязатьСчетаОтСделки(Отказ, ТЗЗаявки);
	//// Евросиб Фролов)	
	////)
	////Евросиб - АСуслов 17.11.2021 12:35:02 #41829
	//
	//// Евросиб Фролов)		
	//КонецЕсли;	
	//// Евросиб Фролов)
	//Субботин 76067 30.10.2023 Конец
	
	//ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	
	// теперь закроем задачу создания сделки в рейсах
	//Евросиб Каблов 23.10.2023 ( Ticket#0327380	
	//Для каждого Стр из Рейсы Цикл
	//	
	//	Если ТипЗнч(Стр.Рейс) <> Тип("СправочникСсылка.РейсыЖД") тогда Продолжить; КонецЕсли;
	//	
	//	РейсОбъект = Стр.Рейс.ПолучитьОбъект();
	//	Для каждого РейсСостояние из РейсОбъект.Состояния Цикл
	//		
	//		Если РейсСостояние.Состояние = Справочники.Состояния.ТребуетсяСозданиеСделки И РейсСостояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//			 РейсСостояние.Статус = Перечисления.СтатусыЭтапов.Выполнен;
	//			 РейсОбъект.Записать();
	//			 Прервать;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
	//Евросиб - АСуслов 03.02.2026 12:49:03 #
	//( 
	//прощай ненужная чушня
	//ТипРейсыЖД = Тип("СправочникСсылка.РейсыЖД");
	//РейсыЖД = Новый Массив;
	//Для Каждого Стр Из Рейсы Цикл
	//	Если ТипЗнч(Стр.Рейс) = ТипРейсыЖД Тогда
	//		РейсыЖД.Добавить(Стр.Рейс);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если ЗначениеЗаполнено(РейсыЖД) Тогда
	//	
	//	СостояниеТребуетсяСозданиеСделки = Справочники.Состояния.ТребуетсяСозданиеСделки;
	//	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	РейсыЖДСостояния.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.РейсыЖД.Состояния КАК РейсыЖДСостояния
	//	|ГДЕ
	//	|	РейсыЖДСостояния.Ссылка В(&РейсыЖД)
	//	|	И РейсыЖДСостояния.Состояние = &Состояние
	//	|	И РейсыЖДСостояния.Статус <> &Статус";
	//	
	//	Запрос.УстановитьПараметр("РейсыЖД", РейсыЖД);
	//	Запрос.УстановитьПараметр("Состояние", СостояниеТребуетсяСозданиеСделки);
	//	Запрос.УстановитьПараметр("Статус", СтатусВыполнен);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если Не РезультатЗапроса.Пустой() Тогда			
	//		
	//		УстановитьПривилегированныйРежим(Истина);
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			
	//			//РейсОбъект = Стр.Рейс.ПолучитьОбъект();
	//			//ДИТ, Беляев СЮ, Ticket#0330761, 03-11-2023, начало
	//			РейсОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//			//ДИТ, Беляев СЮ, Ticket#0330761, 03-11-2023, конец
	//			СтрокаСостояния = РейсОбъект.Состояния.Найти(СостояниеТребуетсяСозданиеСделки, "Состояние");
	//			СтрокаСостояния.Статус = СтатусВыполнен;
	//			РейсОбъект.Записать();
	//			
	//		КонецЦикла;
	//		
	//		УстановитьПривилегированныйРежим(Ложь);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 03.02.2026 12:49:04 #
	//Евросиб Каблов 23.10.2023 )
	
	//Заполним учетные документы в акцепте
	//Евросиб Каблов 13.04.2021 (
	//Если НЕ БыстраяЗапись_ПереносРасходов Тогда
	//Евросиб - АСуслов 12.01.2022 19:21:17 #
	//(в проведение
	//Если НЕ БыстраяЗапись_ПереносРасходов И Не ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
	////Евросиб Каблов 13.04.2021 )	
	//	ЗаполнитьУчетныеДокументыВАкцепте();
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 12.01.2022 19:21:18 #
	
	// Евросиб Фролов (08.10.2021 Task №39041
	Если Не Отказ Тогда
		МассивКонтейнеров = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("Контейнер");
		МассивКонтейнеровРасходы = Расходы.ВыгрузитьКолонку("Контейнер");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКонтейнеров, МассивКонтейнеровРасходы);
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
		// Евросиб BUG 88347 TA 88348 Рыбьяков К.А. 12.07.2024 ((
		ПроверитьОбработанныеСтрокиИзАкцепта();
		// Евросиб Рыбьяков К.А. 12.07.2024 ))
	КонецЕсли;	
	// Евросиб Фролов) 
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Начало: 26.11.2024
	Для Каждого Заявка Из Заявки Цикл
		Если РаботаСоСделкамиСервер.ПерезаполнениеРейсовВЗаявке(Ссылка,Заявка.Заявка) Тогда
			ОтложенноеИзменениеСервер.ПоставитьЗаявкуВОчередьИзменения(Заявка.Заявка, Ссылка);
		КонецЕсли;
	КонецЦикла;
	// Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. Конец: 26.11.2024
	
КонецПроцедуры

Процедура ЗаполнитьУчетныеДокументыВАкцепте()
	
	//Возврат;
	////Выносим в регламентное задание
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.УчДокумент КАК УчДокумент
	|ПОМЕСТИТЬ ВТ_СписокПТУ
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Ссылка
	|	И НЕ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокПТУ.УчДокумент КАК УчДокумент
	|ИЗ
	|	ВТ_СписокПТУ КАК ВТ_СписокПТУ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаПоступления.Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Проведен
	|	И КорректировкаПоступления.ИсправляемыйДокументПоступления В (ВЫБРАТЬ т.УчДокумент ИЗ ВТ_СписокПТУ КАК т)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаАкцепт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАкцепт = РезультатЗапроса.Выбрать();
	УстановитьПривилегированныйРежим(Истина);
	//ДокументИзменен = Истина;
	СписокПолей = Константы.СписокПолейСравненияАкцепта.Получить();
	Пока ВыборкаАкцепт.Следующий() Цикл
		ОбАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ВыборкаАкцепт.УчДокумент, Ложь);
		ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ВыборкаАкцепт.УчДокумент).АкцептСсылка;                    
		ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(), ОбАкцепт.Услуги.выгрузить(),СписокПолей,, Истина);		
		Если ИзмененийНет = Ложь Тогда    
			обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
			ОбАкцепт.УстановитьКомментарийВерсииИсторииДанных("Запись из сделки (ЗаполнитьУчетныеДокументыВАкцепте)");
			обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
			//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("новый: %1; старый: %2", ОбАкцепт, ПредыдущийАкцепт));
		КонецЕсли; 
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОтключитьДублиУслугСинонимовПриРазнесенииНаОднуИзУслугАкцепта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаСопоставленияНоменклатуры.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС КАК РазрешитьСопоставлятьС
	               |ИЗ
	               |	РегистрСведений.ПравилаСопоставленияНоменклатуры КАК ПравилаСопоставленияНоменклатуры
	               |ГДЕ
	               |	ПравилаСопоставленияНоменклатуры.ИсходнаяНоменклатура.РазрешитьАвтоакцептНаАналоги = ИСТИНА
	               |	И ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС.РазрешитьАвтоакцептНаАналоги = ИСТИНА";
	ТЧСопостН = Запрос.Выполнить().Выгрузить();
	
	МассивПригодныхДляОбработкиРасходов = Новый Массив;
	МассивКонтейнеров = Новый Массив;
	Для каждого Стр из Расходы Цикл
		
		Если Стр.УслугаОтключена = Ложь И Стр.Услуга.РазрешитьАвтоакцептНаАналоги = Истина Тогда 
			МассивПригодныхДляОбработкиРасходов.Добавить(Стр);
			НайдКТКСтр = ДоходыКТК.Найти(Стр.ГУИД, "ГУИД");
			Если НайдКТКСтр <> неопределено И МассивКонтейнеров.Найти(НайдКТКСтр.КТК) = неопределено Тогда МассивКонтейнеров.Добавить(НайдКТКСтр.КТК); КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СписокОтключенныхПроводок = Новый Массив;
	
	Для каждого ГруппаОбъединяемойНоменклатуры из ТЧСопостН Цикл
		
		Для каждого КТК из МассивКонтейнеров Цикл
			                                    
			СписокГУИДов = ПолучитьСписокГУИДовПоЭтомуКТК(КТК);
			
			НайденнаяГруппаСтрокРасходов = Новый Массив;
			ВНайденнойГруппеЗаполненПТУ = Ложь;
			Для каждого Стр из МассивПригодныхДляОбработкиРасходов Цикл
				Если (Стр.Услуга = ГруппаОбъединяемойНоменклатуры.ИсходнаяНоменклатура ИЛИ Стр.Услуга = ГруппаОбъединяемойНоменклатуры.РазрешитьСопоставлятьС) И СписокГУИДов.Найти(Стр.ГУИД) <> неопределено Тогда
					НайденнаяГруппаСтрокРасходов.Добавить(Стр);
					ВНайденнойГруппеЗаполненПТУ = ВНайденнойГруппеЗаполненПТУ ИЛИ ЗначениеЗаполнено(Стр.УчДокумент);
				КонецЕсли;
			КонецЦикла;
			Если ВНайденнойГруппеЗаполненПТУ = Истина Тогда
				Для каждого Стр из НайденнаяГруппаСтрокРасходов Цикл
					Если НЕ ЗначениеЗаполнено(Стр.УчДокумент) Тогда
						Стр.УслугаОтключена = Истина;	
						СписокОтключенныхПроводок.Добавить(Стр.ГУИД);
						
						// SIV----------
						
						//ГУИДДоходов = неопределено;
						//Для каждого Стр78664 из СвязьДоходовИРасходов Цикл
						//	Если Стр78664.Расходы = Стр.ГУИД Тогда
						//		ГУИДДоходов = Стр78664.Доходы;
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла;
						//Если ГУИДДоходов <> неопределено Тогда
						//	Для каждого Стр37464 из Доходы Цикл
						//		Если Стр37464.ГУИД = ГУИДДоходов Тогда
						//			Стр37464.НеВыставлятьКлиенту = Истина;
						//			Прервать;
						//		КонецЕсли;
						//	КонецЦикла;
						//КонецЕсли;
						
						// SIV----------
						
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для каждого Стр из НайденнаяГруппаСтрокРасходов Цикл
					Стр.УслугаОтключена = Ложь;	
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
	//	НЗ = РегистрыНакопления.РазнесениеЗатрат.СоздатьНаборЗаписей();
	//	НЗ.Отбор.Регистратор.Значение = ЭтотОбъект.Ссылка;
	//	НЗ.Прочитать();
	//	СписокУдаляемыхЗаписей = Новый Массив;
	//	Для каждого Стр из НЗ Цикл
	//		Если СписокОтключенныхПроводок.Найти(Стр.ГУИДРасходов) <> неопределено Тогда
	//			СписокУдаляемыхЗаписей.Добавить(Стр);
	//		КонецЕсли;
	//	КонецЦикла;
	//	Для каждого Стр из СписокУдаляемыхЗаписей Цикл
	//		НЗ.Удалить(Стр);
	//	КонецЦикла;
	//	НЗ.Записать(Истина);
	//КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокГУИДовПоЭтомуКТК(КТК)
	
	Результат = Новый Массив;
	Для каждого Стр из ДоходыКТК Цикл
		Если Стр.КТК = КТК Тогда Результат.Добавить(Стр.ГУИД); КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДоходыНевключенныеВСтавку(Данные, МассивКТК = Неопределено, МассивВагоны = Неопределено, МассивТД = Неопределено)
	нСтрокаДоход = Доходы.Добавить(); 
	//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, начало
	нСтрокаДоход.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
	//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, конец
	ЗаполнитьЗначенияСвойств(нСтрокаДоход, Данные);
	нСтрокаДоход.Договор = Данные.ДоговорКлиента;
	нСтрокаДоход.ГУИД = Новый УникальныйИдентификатор;
	
	Для каждого ЭлВагон Из МассивВагоны Цикл
		нСтрокаВагон = ДоходыВагоны.Добавить();
		нСтрокаВагон.Вагон = ЭлВагон;
		нСтрокаВагон.ГУИД = нСтрокаДоход.ГУИД;
	КонецЦикла;
	Для каждого ЭлКТК Из МассивКТК Цикл
		нСтрокаКТК = ДоходыКТК.Добавить();
		нСтрокаКТК.КТК = ЭлКТК;
		нСтрокаКТК.ГУИД = нСтрокаДоход.ГУИД;
	КонецЦикла;
	Для каждого ЭлТД Из МассивТД Цикл
		нСтрокаТД = ДоходыТД.Добавить();
		нСтрокаТД.ТД = ЭлТД;
		нСтрокаТД.ГУИД = нСтрокаДоход.ГУИД;
	КонецЦикла;
	нСтрокаДоход.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(ТипЗаказа, МассивВагоны[0]);
	Документы.Сделка.СвязатьДоходыРасходыСУЕ(ЭтотОбъект, нСтрокаДоход.ГУИД, , Данные.СтрокаСУЕ, Данные.Услуга);
КонецПроцедуры

Функция ПолучитьСписки(СтрокаПараметры)
	ПараметрПоиска = Новый Структура("Клиент, Договор, РазмерКТК, Груз, Калькуляция");
	ЗаполнитьЗначенияСвойств(ПараметрПоиска, СтрокаПараметры);
	ПараметрПоиска.Договор = СтрокаПараметры.ДоговорКлиента;
	СписокВагонов = "";
	СписокКТК = "";
	СписокТД = "";
	Для каждого СтрокаУЕ Из СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрПоиска) Цикл
		СписокВагонов = СписокВагонов + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУЕ.Вагон, "Наименование") + ";";
		СписокКТК = СписокКТК + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУЕ.Контейнер, "Наименование") + ";";
		СписокТД = СписокТД + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУЕ.ЖДН, "НомерТранспортногоДокумента") + ";";
	КонецЦикла;
	Возврат Новый Структура("СписокВагонов, СписокКТК, СписокТД", СписокВагонов, СписокКТК, СписокТД);
КонецФункции

Функция НайтиСтрокуДоходовДляАвансовогоСчета(Заявка, Сделка)
	
	Результат = "";
	
	ПСЦ = Заявка.ПСЦ;
	Услуга = неопределено;
	
	// логика такая: счет был сделан на основании заявки. Соответственно, я могу найти любой КТК из заявки в ТЧ Доходы при совпадении номенклатуры услуги и ее ГУИД прописать в счет
	МассивИскомыхКТК = Новый Массив;
	МассивИскомыхВагонов = Новый Массив;
	Для каждого Стр из Заявка.СоставУслуги Цикл
		Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
			МассивИскомыхКТК.Добавить(Стр.НомерКТК);
			Услуга = Стр.Услуга;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Вагон) Тогда
			МассивИскомыхВагонов.Добавить(Стр.Вагон);
			Услуга = Стр.Услуга;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИскомыхКТК.Количество() = 0 И МассивИскомыхВагонов.Количество() = 0 Тогда Возврат Результат; КонецЕсли;
	
	РандомныйВагонДляПоиска = "111111";
	РандомныйКТКДляПоиска = "111111";
	
	Если МассивИскомыхКТК.Количество() > 0 Тогда РандомныйКТКДляПоиска = МассивИскомыхКТК[0]; КонецЕсли;
	Если МассивИскомыхВагонов.Количество() > 0 Тогда РандомныйВагонДляПоиска = МассивИскомыхВагонов[0]; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаДоходы.ГУИД КАК ГУИД,
	               |	СделкаДоходыВагоны.Вагон КАК Вагон,
	               |	СделкаДоходыКТК.КТК КАК КТК
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыКТК.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыКТК.ГУИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыВагоны.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыВагоны.ГУИД
	               |ГДЕ
	               |	СделкаДоходы.Ссылка = &Ссылка
	               |	И СделкаДоходы.Услуга = &Услуга
	               |	И СделкаДоходы.ПСЦ = &ПСЦ";
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если Найти(Ответ.Вагон, РандомныйВагонДляПоиска) > 0 ИЛИ Найти(Ответ.КТК, РандомныйКТКДляПоиска) > 0 Тогда
			Результат = Ответ.ГУИД;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат результат;
	
КонецФункции

Функция СформироватьТекстПисьма(ТаблицаРассылки)
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Сделка",,"Сделка");
	ТаблицаДокументов.Колонки.Добавить("Калькуляция",,"Калькуляция");
	ТаблицаДокументов.Колонки.Добавить("Номенклатура",,"Номенклатура");
	ТаблицаДокументов.Колонки.Добавить("КТК",,"КТК");
	ТаблицаДокументов.Колонки.Добавить("Вагон",,"Вагон");
	ТаблицаДокументов.Колонки.Добавить("ТД",,"ТД");
	ТаблицаДокументов.Колонки.Добавить("ПТУ",,"ПТУ");
	ТаблицаДокументов.Колонки.Добавить("ГУИД",,"Идентификатор строки расходов");
	ТаблицаДокументов.Колонки.Добавить("ГуидАкцепт",,"Идентификатор строки акцепта");
	Для каждого СтрокаРассылки Из ТаблицаРассылки Цикл
		нСтрокаТД = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрокаТД, СтрокаРассылки);
	КонецЦикла; 
	нСтрока = ТаблицаДокументов.Добавить();
	КодСтраницыХТМЛ = "<!DOCTYPE html><BODY>" + Символы.ПС + ПолучитьТаблицуХТМЛ(ТаблицаДокументов) + Символы.ПС + "</BODY></html>";
	Текст = "Реестр отвязанных строк сделки:
	|  "+ КодСтраницыХТМЛ;
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТаблицуХТМЛ(ТабЗначений,СтруктураПараметрыТаблицыХТМЛ = Неопределено) Экспорт
	
	//СтруктураПараметрыТаблицыХТМЛ
	//
	//Общие параметры:
	//СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы - общая ширина таблица
	//СтруктураПараметрыТаблицыХТМЛ.ЦветШапки - цвет шапки таблицы пример "eadbaf"
	//СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется - по умолчанию ЛОЖЬ
	//
	//Индивиуальные для каждой колонки:
	//СтруктураПараметрыТаблицыХТМЛ.Заголовок1 - заголовок для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Ширина1 - ширина для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Положение1 - отвечает за положение текста в колонке (по умол. лево), передовать "center" или "right"
	
	//ТабЗначений = Новый ТаблицаЗначений;
	МассивИменКолонок = Новый Массив;
	
	Если ТипЗнч(СтруктураПараметрыТаблицыХТМЛ) <> Тип("Структура") Тогда
		СтруктураПараметрыТаблицыХТМЛ = Новый Структура;
	КонецЕсли;
				
	КоличествоКолонок = ТабЗначений.Колонки.Количество();
	ПунктПорядкуИспользуется = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ПунктПорядкуИспользуется"),СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется,ЛОЖЬ);	
	
	Если КоличествоКолонок < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	ЦветШапки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ЦветШапки")," bgcolor=""#" + СтруктураПараметрыТаблицыХТМЛ.ЦветШапки + """","");
	ШиринаТаблицы = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ШиринаТаблицы")," style=""width:" + СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы + "px""",""); 
	ТаблицаХТМЛ = "<table border=""1"" cellpadding=""1"" cellspacing=""0"" " + ШиринаТаблицы + ">
				|<tbody>
				|<tr>";
	
	//Первым выводим столбик П/П если он задан в шапку
	Если ПунктПорядкуИспользуется Тогда
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td" + ЦветШапки + " style=""width:30px"" align=""center"">п/п</td>";	
	КонецЕсли;
	
	//Формируем шапку
	Для Счетчик = 1 по КоличествоКолонок Цикл
		ИмяСвойстваШирина = "Ширина" + Счетчик;
		ШиринаСтолбца = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваШирина)," style=""width:" + СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваШирина] + "px""","");
		ИмяКолонки = ТабЗначений.Колонки[Счетчик-1].Имя;
		НаименованиеКолонки = ТабЗначений.Колонки[Счетчик-1].Заголовок;
		ИмяСвойстваЗаголовок = "Заголовок" + Счетчик;
		ЗаголовокКолонки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваЗаголовок),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваЗаголовок],НаименованиеКолонки);
		ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|<td" + ЦветШапки + ШиринаСтолбца + " align=""center"">" + ЗаголовокКолонки + "</td>";	
		МассивИменКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	
	//Заполняем таблицу	
	ПунктПорядку = 0;
	Для каждого СтрокаТаблицы Из ТабЗначений Цикл
		ПунктПорядку = ПунктПорядку + 1;
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<tr>" + ?(ПунктПорядкуИспользуется, Символы.ПС + "<td align=""center"">" + ПунктПорядку + "</td>","") + "";
		Для Счетчик = 0 по КоличествоКолонок - 1 Цикл
			ИмяСвойстваПоложение = "Положение" + Строка(Счетчик + 1);
			Положение = " align=""" + ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваПоложение),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваПоложение],"left") + """";
			ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td " + Положение + ">" + СтрокаТаблицы[МассивИменКолонок[Счетчик]] + "</td>";			
		КонецЦикла;				
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	КонецЦикла;	
	
	ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|</tbody>
				|</table>";
	
	Возврат ТаблицаХТМЛ;

КонецФункции

Процедура ОтправитьПисьмоОповещениеОбОтвязкеАкцепта(ТаблицаРассылки)
	
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда возврат; КонецЕсли;
	//СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("dc-info");
	СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Тема = "Уведомление об отвязки акцепта от сделки";
	ПараметрыОтправкиПисьма = новый Структура;
	ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
	ПараметрыОтправкиПисьма.Вставить("Тело", СформироватьТекстПисьма(ТаблицаРассылки));
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
	ПолучателиПисьма = Новый Массив;
	EMAIL = "suslovav@eurosib.biz";
	Если ЗначениеЗаполнено(EMAIL) Тогда
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Суслов Александр Васильевич", EMAIL));
	КонецЕсли;
	ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
	РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	
КонецПроцедуры 

Функция ПолучитьИдентификаторыАннулированныхУслуг()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&Доходы КАК СделкаДоходы
	|ГДЕ
	|	НЕ СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_Доходы КАК ВТ_Доходы";
	Запрос.УстановитьПараметр("Доходы", Доходы.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГУИД");

КонецФункции

Процедура УдалитьСтрокиРасходовПоУдаленнымСтрокамСУЕ()
	
	УдаленныеСтрокиСУЕ = СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Удалена", Истина));
	МассивСтрокКУдалению = Новый Массив;
	Для каждого УдаленнаяСтрокаСУЕ Из УдаленныеСтрокиСУЕ Цикл
		СтрокиРасходовКУдалению = Расходы.НайтиСтроки(Новый Структура("СтрокаСвязьУчетныхЕдиниц", УдаленнаяСтрокаСУЕ.ГУИД));
		Для каждого СтрокаРасходовКУдалению Из СтрокиРасходовКУдалению Цикл
			МассивСтрокКУдалению.Добавить(СтрокаРасходовКУдалению);
		КонецЦикла; 
	КонецЦикла; 
	
	УдалитьСтрокиРасходов(МассивСтрокКУдалению);
	
	
КонецПроцедуры

Процедура УдалитьСтрокиРасходов(МассивСтрокКУдалению, ОтключатьУслуги = Истина, ОтвязыватьПривязанные = Ложь, ЗаписыватьАкцепт = Истина, ПричинаОтключенияСтроки = Неопределено) Экспорт
	ТаблицаСтрокДляОтвязкиАкцептов = Расходы.Выгрузить(,"УчДокумент, ГУИД, Калькуляция, Услуга");
	ТаблицаСтрокДляОтвязкиАкцептов.Очистить();
	МассивПТУДляОтвязки = Новый Массив;
	МассивУдаляемыхСтрок = Новый Массив;	
	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	ОтвязываемыеСтроки = Новый Массив;
	//Евросиб Каблов 17.01.2022 )
	Для каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
		Если СтрокаКУдалению.ЕстьОтчетКомитенту Тогда
			//сразу нет, если док проведен
			//ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("По строке расходов %1 выставлен отчет комитенту", ТекС.НомерСтроки));
			Продолжить;
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаКУдалению.УчДокумент) Тогда
			Если МассивПТУДляОтвязки.Найти(СтрокаКУдалению.УчДокумент) = Неопределено Тогда
				МассивПТУДляОтвязки.Добавить(СтрокаКУдалению.УчДокумент);
			КонецЕсли; 
			нСтрокаОтвязки = ТаблицаСтрокДляОтвязкиАкцептов.Добавить();
			нСтрокаОтвязки.УчДокумент = СтрокаКУдалению.УчДокумент;
			нСтрокаОтвязки.ГУИД = СтрокаКУдалению.ГУИД;
			нСтрокаОтвязки.Калькуляция = СтрокаКУдалению.Калькуляция;
			нСтрокаОтвязки.Услуга = СтрокаКУдалению.Услуга;
		КонецЕсли;
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		УдалитьСтрокуРасходов = Истина;
		//Евросиб Каблов 17.01.2022 )
		НайдСтроки = ЭтотОбъект.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", СтрокаКУдалению.ГУИД));
		Если СтрокаКУдалению.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
			//в этом случае удалим доходы
			МассивУдаляемыхСтрокД = Новый Массив;
			Для каждого ТекС Из НайдСтроки Цикл
				
				//Евросиб Каблов 06.07.2021 (
				НайденнаяСтрокаДоходов = Доходы.Найти(ТекС.Доходы, "ГУИД");
				Если НайденнаяСтрокаДоходов <> Неопределено И НайденнаяСтрокаДоходов.ИсточникПоявленияСтрокиЭкономики <> Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
					Продолжить;
				КонецЕсли;	
				//Евросиб Каблов 06.07.2021 )
				
				//Евросиб Каблов 17.01.2022 ( Ticket#0246698
				Если НайденнаяСтрокаДоходов <> Неопределено И ЗначениеЗаполнено(НайденнаяСтрокаДоходов.УчДокумент) Тогда					
					УчДокПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрокаДоходов.УчДокумент, "Проведен");
					Если УчДокПроведен Тогда
						УдалитьСтрокуРасходов = Ложь;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//Евросиб Каблов 17.01.2022 )
				
				НайдСтрокиД = ДоходыВагоны.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыВагоны.Удалить(НайдСтрД); КонецЦикла;
				
				НайдСтрокиД = ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыКТК.Удалить(НайдСтрД); КонецЦикла;
				
				НайдСтрокиД = ДоходыТД.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыТД.Удалить(НайдСтрД); КонецЦикла;
				
				МассивУдаляемыхСтрокД.Добавить(Доходы.Найти(ТекС.Доходы, "ГУИД"));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрокД Цикл
				Если УдаляемаяСтрока <> Неопределено Тогда
					Доходы.Удалить(УдаляемаяСтрока);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
		
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		Если УдалитьСтрокуРасходов Тогда
		//Евросиб Каблов 17.01.2022 ) 
		
		    //ДИТ Шевченко А.В. US 68330 ТА 69907 14.06.2023 -Начало
			мНайденоСвязьДоходовИРасходов = СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц,Расходы",СтрокаКУдалению.СтрокаСвязьУчетныхЕдиниц,СтрокаКУдалению.ГУИД));
			Если мНайденоСвязьДоходовИРасходов.Количество() Тогда
				Если ЗначениеЗаполнено(мНайденоСвязьДоходовИРасходов[0].Доходы) Тогда
					мНайденныеСвязиДоходов = СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы",мНайденоСвязьДоходовИРасходов[0].Доходы));
					Если мНайденныеСвязиДоходов.Количество() = 1 Тогда
						ДоходнаяСтрока = Доходы.НайтиСтроки(Новый Структура("ГУИД",мНайденоСвязьДоходовИРасходов[0].Доходы));
						Если ДоходнаяСтрока.Количество() Тогда
							Если НЕ ЗначениеЗаполнено(ДоходнаяСтрока[0].УчДокумент) И ДоходнаяСтрока[0].ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
								Доходы.Удалить(ДоходнаяСтрока[0]);
							//Евросиб Каблов 06.06.2024 ( 
							ИначеЕсли НЕ ЗначениеЗаполнено(ДоходнаяСтрока[0].УчДокумент) И ДоходнаяСтрока[0].ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически И ДоходнаяСтрока[0].Перевыставляемая Тогда
								ДоходнаяСтрока[0].НеВыставлятьКлиенту = Истина;
							//Евросиб Каблов 06.06.2024 )
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			//ДИТ Шевченко А.В. US 68330 ТА 69907 14.06.2023 -Конец
		
			Для каждого НайдСтр из НайдСтроки Цикл 
				НайдСтр.Расходы = "";
			КонецЦикла;
			
			НайдСтроки = ЭтотОбъект.ДоходыВагоны.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл ЭтотОбъект.ДоходыВагоны.Удалить(НайдСтр); КонецЦикла;
			
			НайдСтроки = ЭтотОбъект.ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл ЭтотОбъект.ДоходыКТК.Удалить(НайдСтр); КонецЦикла;
			
			НайдСтроки = ЭтотОбъект.ДоходыТД.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл ЭтотОбъект.ДоходыТД.Удалить(НайдСтр); КонецЦикла;
			МассивУдаляемыхСтрок.Добавить(СтрокаКУдалению);
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		Иначе
			ОтвязываемыеСтроки.Добавить(СтрокаКУдалению);
		КонецЕсли;
		//Евросиб Каблов 17.01.2022 )
		
	КонецЦикла;
	Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		Если ЗначениеЗаполнено(УдаляемаяСтрока.УчДокумент) И НЕ ОтвязыватьПривязанные Тогда
			Продолжить;
		КонецЕсли; 
		Если ОтключатьУслуги 
			//Евросиб - АСуслов 07.03.2023 15:50:58 #66486
			//(
			//И Не УдаляемаяСтрока.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта 
			//)
			//Евросиб - АСуслов 07.03.2023 15:51:00 #66486
			Тогда
			УдаляемаяСтрока.УслугаОтключена = Истина;
			//Евросиб - АСуслов 09.03.2023 9:50:18 #66486
			//(
			УдаляемаяСтрока.ПричинаОтключенияСтроки = ПричинаОтключенияСтроки;
			//)
			//Евросиб - АСуслов 09.03.2023 9:50:24 #66486 
			
			// ДИТ US 47112 TA 65997 Евсенкин М.А. Начало: 06.03.2023
			мНайденоСвязьДоходовИРасходов = СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("СвязьУчетныхЕдиниц",УдаляемаяСтрока.СтрокаСвязьУчетныхЕдиниц));
			мНайденоСвязьУчетныхЕдиниц	= СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ГУИД",УдаляемаяСтрока.СтрокаСвязьУчетныхЕдиниц));
			Если мНайденоСвязьДоходовИРасходов.Количество() = 1  
				И мНайденоСвязьУчетныхЕдиниц.Количество() = 1 Тогда 
				Если Не ЗначениеЗаполнено(мНайденоСвязьУчетныхЕдиниц[0].ГУИДСтрокиЗаявки) Тогда
					//Евросиб Каблов 06.10.2023 ( Ticket#0327386
					//СвязьУчетныхЕдиниц.Удалить(мНайденоСвязьУчетныхЕдиниц[0]);
					мНайденоСвязьУчетныхЕдиниц[0].НеАктивна = Истина;
					//Евросиб Каблов 06.10.2023 )
				КонецЕсли;	
			КонецЕсли;	
			// ДИТ US 47112 TA 65997 Евсенкин М.А. Конец: 06.03.2023
		Иначе
			ЭтотОбъект.Расходы.Удалить(УдаляемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	Для Каждого ОтвязываемаяСтрока Из ОтвязываемыеСтроки Цикл
		ОтвязываемаяСтрока.УчДокумент = Неопределено;
	КонецЦикла;
	//Евросиб Каблов 17.01.2022 )
	
	// Евросиб Фролов (14.04.2022 Task №50195
	Если Не ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
		ЗаписыватьАкцепт = Ложь;
	КонецЕсли;
	// Евросиб Фролов)	
	
	Если Не ЗаписыватьАкцепт Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаРассылки = Новый ТаблицаЗначений;
	ТаблицаРассылки = Новый ТаблицаЗначений;
	ТаблицаРассылки.Колонки.Добавить("Сделка");
	ТаблицаРассылки.Колонки.Добавить("ГУИД");
	ТаблицаРассылки.Колонки.Добавить("ГУИДАкцепт");
	ТаблицаРассылки.Колонки.Добавить("Калькуляция");
	ТаблицаРассылки.Колонки.Добавить("Номенклатура");
	ТаблицаРассылки.Колонки.Добавить("Вагон");
	ТаблицаРассылки.Колонки.Добавить("КТК");
	ТаблицаРассылки.Колонки.Добавить("ТД");
	ТаблицаРассылки.Колонки.Добавить("ПТУ");
	НужноОтправлятьПисьмо = Ложь;	
	Для каждого ПТУДляОтвязки Из МассивПТУДляОтвязки Цикл
		обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУДляОтвязки,Ложь);
		//Субботин 75883 10.10.2023 начало
        ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(обАкцепт.услуги);
		//Субботин 75883 10.10.2023 Конец 
		АкцептИзменен = Ложь;
		СтрокиУслуг = ТаблицаСтрокДляОтвязкиАкцептов.НайтиСтроки(Новый Структура("УчДокумент", ПТУДляОтвязки));
		Для каждого СтрокаУслуг из СтрокиУслуг Цикл
			СтрокиАкцепта = обАкцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРасходовВСделке", СтрокаУслуг.ГУИД));
			Для каждого Стр Из СтрокиАкцепта Цикл
				АкцептИзменен = Истина;
				
				СтрокаРассылки = ТаблицаРассылки.Добавить();
				СтрокаРассылки.Сделка = Ссылка;
				СтрокаРассылки.ГУИД = СтрокаУслуг.ГУИД;
				СтрокаРассылки.ГУИДАкцепт = Стр.ИдентификаторСтрокиПоступления;
				СтрокаРассылки.Калькуляция = СтрокаУслуг.Калькуляция;
				СтрокаРассылки.Номенклатура = СтрокаУслуг.Услуга;
				СтрокаРассылки.ПТУ = ПТУДляОтвязки;
				СтрокаРассылки.Вагон = ?(ЗначениеЗаполнено(Стр.Вагон),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Вагон,"Наименование"),"");
				СтрокаРассылки.КТК = ?(ЗначениеЗаполнено(Стр.Контейнер),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Контейнер,"Наименование"),"");
				СтрокаРассылки.ТД = ?(ЗначениеЗаполнено(Стр.ТранспортныйДокумент),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ТранспортныйДокумент,"НомерТранспортногоДокумента"),"");
				
				Если Не ОтключатьУслуги Тогда //если мы не удаляем услуги, то в акцепте ничего не трогаем
					Если ОтвязыватьПривязанные Тогда //если удаляем, то проверяем режим работы с привязанными строками
						//Евросиб Каблов 17.01.2022 ( Task 41630
						//Стр.ИдентификаторСтрокиРасходовВСделке = неопределено;
						//Стр.Сделка = неопределено;
						//Стр.ПолностьюРазнесено = Ложь;
						//Стр.НоменклатурнаяГруппа = Неопределено;
						//Стр.СделкаСумма = 0;
						//Стр.СделкаСтавкаНДС = Неопределено;
						//Стр.СделкаСуммаНДС = 0;
						//Стр.НоменклатураСделки = Неопределено;
						//Стр.ВидРасходов = Неопределено;
						//Стр.Сумма = 0;
						//Стр.СуммаНДС = 0;
						//Стр.УчДокумент = Неопределено;
						//Стр.Количество = 0;
						//Стр.Цена = 0;
						//Стр.ПривязалПользователь = Неопределено;
						//Субботин 75883 10.10.2023 начало
						СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
						//Было
						//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр, обАкцепт, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
						//Стало
						Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], обАкцепт, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
						ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
						//Субботин 75883 10.10.2023 Конец 
						//Евросиб Каблов 17.01.2022 )
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла; 
		Если АкцептИзменен Тогда
			обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
			НужноОтправлятьПисьмо = Истина;
			Если Не ОтключатьУслуги Тогда
				Если ОтвязыватьПривязанные Тогда
					//Евросиб Каблов 02.12.2021 ( Ticket#0244590
					//обАкцепт.Записать();
					Попытка // Евросиб Фролов (14.04.2022 Task №50195
						обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
					// Евросиб Фролов (14.04.2022 Task №50195	
					Исключение
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отвязка строк акцепта от сделки'", Метаданные.ОсновнойЯзык.КодЯзыка),
											УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Акцепт, обАкцепт, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
						ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отвязать строки акцепта №%1 от %2 от сделки.
                                                         |Ошибка: %3'"),
															обАкцепт.Номер,
															обАкцепт.Дата,
															КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, обАкцепт);				
					КонецПопытки;
					// Евросиб Фролов)							
					//Евросиб Каблов 02.12.2021 )
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Если НужноОтправлятьПисьмо Тогда
		Попытка
			ОтправитьПисьмоОповещениеОбОтвязкеАкцепта(ТаблицаРассылки);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки; 
	КонецЕсли;
КонецПроцедуры

Процедура ПривязатьСчетаКСделке(Отказ, ТЗЗаявки)
	
	// SIV 09-07-20
	// Авансовые счета, сделанные из заявок, надо привязать к текущей сделке. как это сделать? берем все заявки сделки, берем созданные на их основании счета с признаком Авансовый, у которых не заполнена сделка, и привязываем
	
	Запрос = Новый Запрос;
	//Евросиб - АСуслов 17.11.2021 12:22:21 #41829
	//(
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
	//               |	СчетНаОплатуПокупателю.ДокументОснование КАК ДокументОснование,
	//               |	СчетНаОплатуПокупателю.Номер КАК НомерСчета,
	//               |	СчетНаОплатуПокупателю.Дата КАК ДатаСчета
	//               |ИЗ
	//               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//               |ГДЕ
	//               |	НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	//               |	И СчетНаОплатуПокупателю.АвансовыйСчет
	//               |	И СчетНаОплатуПокупателю.ДокументОснование В(&ЗаявкиСделки)
	//               |	И СчетНаОплатуПокупателю.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкиСделки.Заявка КАК Заявка,
	|	ЗаявкиСделки.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_ЗаявкиСделки
	|ИЗ
	|	&ЗаявкиСделки КАК ЗаявкиСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателю.Документ КАК ДокументОснование,
	|	СчетНаОплатуПокупателю.Ссылка.Номер КАК НомерСчета,
	|	СчетНаОплатуПокупателю.Ссылка.Дата КАК ДатаСчета,
	|	СчетНаОплатуПокупателю.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	НЕ СчетНаОплатуПокупателю.Ссылка.ПометкаУдаления
	|	И СчетНаОплатуПокупателю.Ссылка.АвансовыйСчет
	|	И (СчетНаОплатуПокупателю.Документ, СчетНаОплатуПокупателю.Сделка) В
	|			(ВЫБРАТЬ
	|				т.Заявка,
	|				ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|			ИЗ
	|				ВТ_ЗаявкиСделки КАК т)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	//)
	//Евросиб - АСуслов 17.11.2021 12:28:14 #41829
	
	// Евросиб Фролов (06.10.2021
	//Запрос.УстановитьПараметр("ЗаявкиСделки", СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("Заявка")); // было (в параметр передаю готовый массив чтобы не формировать его два раза)
	Запрос.УстановитьПараметр("ЗаявкиСделки", ТЗЗаявки);
	// Евросиб Фролов)
	
	Ответ = Запрос.Выполнить().Выбрать();      
	//Евросиб - АСуслов 17.11.2021 12:40:51 #14829
	//(
	Пока Ответ.СледующийПоЗначениюПоля("Ссылка") Цикл
		// Евросиб Фролов (06.10.2021 ЗАКОММЕНТИРОВАЛ
		
		//СчетОбъект = Ответ.Ссылка.ПолучитьОбъект();
		//СчетОбъект.Сделка = Ссылка;
		//
		////Евросиб - АСуслов 02.11.2020 18:40:51 #
		////(
		////ИмеетСмыслЗаписывать = Ложь;
		////
		////Для каждого Стр из СчетОбъект.Товары Цикл
		////	Стр.СтрокаДоходовСделки = НайтиСтрокуДоходовДляАвансовогоСчета(Ответ.ДокументОснование, Ссылка);
		////	ИмеетСмыслЗаписывать = ИмеетСмыслЗаписывать ИЛИ ЗначениеЗаполнено(Стр.СтрокаДоходовСделки);
		////КонецЦикла;
		////Распределение счетов через регистр.
		//ИмеетСмыслЗаписывать = Истина;
		////)
		////Евросиб - АСуслов 02.11.2020 18:40:52 #
		//
		//
		//Если ИмеетСмыслЗаписывать Тогда
		//	СчетОбъект.ДополнительныеСвойства.Вставить("РазрешенаЗаписьВыставленного", Истина);
		//	СчетОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	Попытка
		//		СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//	КонецПопытки;
		
		// Евросиб Фролов)
			
		// Евросиб Фролов (06.10.2021
		// Закомментировал кусок выше
		СчетОбъект = Ответ.Ссылка.ПолучитьОбъект();
							
		Попытка
			СчетОбъект.Заблокировать();
			
			СчетОбъект.ДополнительныеСвойства.Вставить("РазрешенаЗаписьВыставленного", Истина);
			Пока Ответ.СледующийПоЗначениюПоля("НомерСтроки") Цикл
				СтрокаОснование = СчетОбъект.ДокументыОснования.Найти(Ответ.НомерСтроки, "НомерСтроки");
				СтрокаОснование.Сделка = Ссылка;
			КонецЦикла;
			//СчетОбъект.Сделка = Ссылка;
			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			Если СчетОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			КонецЕсли;
			
			СчетОбъект.Записать(РежимЗаписи);
		Исключение
			// Записать предупреждение в журнал регистрации
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Привязка счета на оплату к сделке'", Метаданные.ОсновнойЯзык.КодЯзыка),
							УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.СчетНаОплатуПокупателю, СчетОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
								
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось привязать счет №%1 от %2 к сделке №%3 от %4.
                                                                      |Ошибка: %5'"),
															Ответ.НомерСчета,
															Ответ.ДатаСчета,
															Номер,
															Дата,
															КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СчетОбъект);				
		КонецПопытки;
		
		// Евросиб Фролов)
			
		//КонецЕсли;
	КонецЦикла;
	//)
	//Евросиб - АСуслов 17.11.2021 12:40:57 #14829
		
КонецПроцедуры	

Процедура ОтвязатьСчетаОтСделки(Отказ, ТЗЗаявки)
	
	// Евросиб Фролов (06.10.2021 Ticket№ 0242400
	// При записи сделки, нужно получить все незакрытые счета (остаток по РН "Счета покупателям")
	// по этой сделке и проверить, что все заявки, по которым привязаны счета есть в этой сделке.
	// Если заявки нет в сделке, то счет нужно отвязать от сделки.
	
	// Найдем все заявки, которые не удалены из состава поезда
	МассивЗаявок = СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("Удалена, НеАктивна", Ложь, Ложь)).ВыгрузитьКолонку("Заявка");
	
	ТекстЗапроса =
	//Евросиб - АСуслов 17.11.2021 16:02:49 #41829
	//(
	//"ВЫБРАТЬ
	//|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетНаОплату,
	//|	СчетаПокупателейОстатки.СчетПокупателю.ДокументОснование КАК Заявка,
	//|	СчетаПокупателейОстатки.СчетПокупателю.Номер КАК НомерСчета,
	//|	СчетаПокупателейОстатки.СчетПокупателю.Дата КАК ДатаСчета
	//|ИЗ
	//|	РегистрНакопления.СчетаПокупателей.Остатки(
	//|			,
	//|			Организация = &Организация
	//|				И Сделка = &Сделка) КАК СчетаПокупателейОстатки
	//|ГДЕ
	//|	СчетаПокупателейОстатки.СчетПокупателю.ДокументОснование ССЫЛКА Документ.Заявка
	//|	И СчетаПокупателейОстатки.СуммаОстаток <> 0";
	"ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетНаОплату,
	|	СчетНаОплатуПокупателюДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Заявка,
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_СчетаПоСделке
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(, Организация = &Организация) КАК СчетаПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|		ПО СчетаПокупателейОстатки.СчетПокупателю = СчетНаОплатуПокупателюДокументыОснования.Ссылка
	|ГДЕ
	//|	СчетаПокупателейОстатки.СчетПокупателю.ДокументыОснования.Сделка = &Сделка
	//ДИТ, Беляев СЮ, Ticket#0278601, 14-07-2022, начало
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка = &Сделка	
	//ДИТ, Беляев СЮ, Ticket#0278601, 14-07-2022, конец
	|	И СчетаПокупателейОстатки.СуммаОстаток <> 0
	|	И СчетНаОплатуПокупателюДокументыОснования.Документ ССЫЛКА Документ.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_счетапосделке.СчетНаОплату КАК СчетНаОплату,
	|	вт_счетапосделке.НомерСтроки КАК НомерСтроки,
	|	вт_счетапосделке.Заявка КАК Заявка,
	|	вт_счетапосделке.Сделка КАК Сделка,
	// Евросиб Фролов (13.04.2022 Task №50195
	|	вт_счетапосделке.СчетНаОплату.Номер КАК НомерСчета,
	|	вт_счетапосделке.СчетНаОплату.Дата КАК ДатаСчета
	// Евросиб Фролов)	
	|ИЗ
	|	ВТ_СчетаПоСделке КАК вт_счетапосделке
	|ГДЕ
	|	НЕ (вт_счетапосделке.Заявка, вт_счетапосделке.Сделка) В (&ТаблицаЗаявки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетНаОплату,
	|	НомерСтроки";

	//)
	//Евросиб - АСуслов 17.11.2021 16:03:10 #41829
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Сделка", 		Ссылка);
	Запрос.УстановитьПараметр("ТаблицаЗаявки", ТЗЗаявки);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.СледующийПоЗначениюПоля("СчетНаОплату") Цикл
			
			////Евросиб - АСуслов 17.11.2021 16:08:45 #
			////(
			////Если МассивЗаявок.Найти(Выборка.Заявка) = Неопределено Тогда
			//Если  Тогда
			//	
			//КонецЕсли;
			////)
			////Евросиб - АСуслов 17.11.2021 16:08:45 #
			
				СчетОбъект = Выборка.СчетНаОплату.ПолучитьОбъект();
								
				Попытка
					СчетОбъект.Заблокировать();
					
					СчетОбъект.ДополнительныеСвойства.Вставить("РазрешенаЗаписьВыставленного", Истина);
					//СчетОбъект.Сделка = Документы.Сделка.ПустаяСсылка();
					Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
						СтрокаОснование = СчетОбъект.ДокументыОснования.Найти(Выборка.НомерСтроки, "НомерСтроки");
						СтрокаОснование.Сделка = Неопределено;
					КонецЦикла;
					//СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					//ДИТ, Беляев СЮ, Ticket#0278601, 14-07-2022, начало
					РежимЗаписи = РежимЗаписиДокумента.Запись;
					Если СчетОбъект.Проведен Тогда
						РежимЗаписи = РежимЗаписиДокумента.Проведение;
					КонецЕсли; 
					СчетОбъект.Записать(РежимЗаписи);  
					//ДИТ, Беляев СЮ, Ticket#0278601, 14-07-2022, конец
				Исключение
					// Записать предупреждение в журнал регистрации.
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление сделки в счете на оплату'", Метаданные.ОсновнойЯзык.КодЯзыка),
									УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.СчетНаОплатуПокупателю, СчетОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
									
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отвязать счет №%1 от %2 от сделки №%3 от %4.
                                                                        |Ошибка: %5'"),
																	Выборка.НомерСчета,
																	Выборка.ДатаСчета,
																	Номер,
																	Дата,
																	КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 				
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СчетОбъект);				
				КонецПопытки; 
							
			//КонецЕсли;
		
		КонецЦикла;

	КонецЕсли;
	
	// Евросиб Фролов)
	
КонецПроцедуры	

//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало, (закомментировал функцию, не используется)
//// ДИТ Поморцева Т.П. 32343 12.10.2021. начало
//Функция ОпределитьОтветственного(СтрокаТЧ)
//	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
//	// Было:
//	//СтруктураОтветственные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Договор,"ОтветственныйЗаУчет,ОтветственныйЗаУчетНСК"); 
//	//Стало:
//	текЦФО = Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка();
//	ЦФОЗаяки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Заявка,"ЦФО");
//	Если ЗначениеЗаполнено(СтрокаТЧ.Заявка) И ЗначениеЗаполнено(ЦФОЗаяки) Тогда
//		текЦФО = ЦФОЗаяки;
//	ИначеЕсли ЗначениеЗаполнено(ЦФО) Тогда// И (ЭтоПеревыставлениеДопРасходов И ЗначениеЗаполнено(ДанныеИзСвязьУчетныхЕдиниц.Клиент)) Тогда
//		текЦФО = ЦФО;
//	КонецЕсли;
//	
//	Если текЦФО =  Справочники.ЦентрыФинансовойОтветственности.ПустаяСсылка() Тогда 
//		текЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;	
//	КонецЕсли;	
//	
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("Договор",				СтрокаТЧ.Договор);
//	СтруктураПараметров.Вставить("ЦФО",					текЦФО);
//	СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
//	ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
//	
//	//СтруктураОтветственные = Новый Структура;
//	//СтруктураОтветственные.Вставить("ОтветственныйЗаУчет", 		ОтветственныйЗаУчет);
//	//СтруктураОтветственные.Вставить("ОтветственныйЗаУчетНСК", 	ОтветственныйЗаУчетНСК);
//	//
//	//ОтветственныйЗаУчет = ОтпределитьПоДоговору(СтрокаТЧ,СтруктураОтветственные);
//	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022	
//	Возврат ОтветственныйЗаУчет;
//						
//КонецФункции 
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

Функция ПроверитьИзменниеСтатусаЗадачиИсполнителя(Ответственный,ЗадачаСопровождения)
	
	ИзменитьСтатус = Истина;
	
	ВсеЗадачиИсполителя = Состояния.НайтиСтроки(Новый Структура("Исполнитель,Состояние", Ответственный,ЗадачаСопровождения));
	УникальныеЗадачиИсполителя = Новый Массив;
	Для Каждого Элемент Из ВсеЗадачиИсполителя Цикл	
		Если УникальныеЗадачиИсполителя.Найти(Элемент.Состояние.Наименование) = Неопределено Тогда
			УникальныеЗадачиИсполителя.Добавить(Элемент.Состояние.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Если УникальныеЗадачиИсполителя.Количество() > 1 Тогда
		ИзменитьСтатус = Ложь;
	КонецЕсли;
	Возврат ИзменитьСтатус;
КонецФункции
// ДИТ Поморцева Т.П. 32343 12.10.2021. конец

// Евросиб Фролов (08.10.2021 Task №39041
Процедура ПередУдалением(Отказ)
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)

//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 ++
Процедура УбратьНевыполненныеЗадачиПоДругимОтветственным(ОставляемыйОтветственныйПоЗадаче, ТекЗадача)
	Отбор = Новый Структура;
	Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача); 
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача.ЗадачаГотовностиКВыставлению);
	//Отбор.Вставить("Клиент",ТекЗадача.Клиент);
	//Отбор.Вставить("Договор",ТекЗадача.Договор);
	//Отбор.Вставить("Доплата_ПСЦ",ТекЗадача.Протокол);
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец
	Отбор.Вставить("ГотовоКВыставлению",ИСТИНА);
	Отбор.Вставить("ДокументыСформированы",ЛОЖЬ);
	НайденныйСтрокиПоЗадаче = СвязьУчетныхЕдиниц.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из НайденныйСтрокиПоЗадаче Цикл
		Если ТекСтрока.ОтветственныйЗаУчет = ОставляемыйОтветственныйПоЗадаче Тогда
			Продолжить;
		КонецЕсли;
		ТекСтрока.ЗадачаГотовностиКВыставлению = "";
	КонецЦикла;
КонецПроцедуры          
//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 --

//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 ++
Процедура УбратьЗадачиСоответствующиеНесколькимСотрудникам() 
	//ПОИСК
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет КАК ОтветственныйЗаУчет,
	|	ТЧСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//|   ,ТЧСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	//|   ТЧСвязьУчетныхЕдиниц.Договор КАК Договор,
	//|   ТЧСвязьУчетныхЕдиниц.Протокол КАК Протокол
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	&ТЧСвязьУчетныхЕдиниц КАК ТЧСвязьУчетныхЕдиниц
	|ГДЕ
 	|	ТЧСвязьУчетныхЕдиниц.ГотовоКВыставлению
	|	И ТЧСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению <> ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
	|	И ТЧСвязьУчетныхЕдиниц.ОтветственныйЗаУчет <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблица.ОтветственныйЗаУчет) КАК КоличествоОтветственных
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//|   ,ВременнаяТаблица.Клиент КАК Клиент,
	//|   ВременнаяТаблица.Договор КАК Договор,
	//|   ВременнаяТаблица.Протокол КАК Протокол
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.ЗадачаГотовностиКВыставлению
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. начало
	//|   ,ВременнаяТаблица.Клиент,
	//|   ВременнаяТаблица.Договор,
	//|   ВременнаяТаблица.Протокол
	//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. конец
	|"; 
	ТЧСвязьУчетныхЕдиниц = СвязьУчетныхЕдиниц.Выгрузить();
	Запрос.УстановитьПараметр("ТЧСвязьУчетныхЕдиниц", ТЧСвязьУчетныхЕдиниц);
	РезультатЗапроса = Запрос.Выполнить();               
	МассивЗадач = Новый Массив;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОтветственных<=1 Тогда
			Продолжить;
		КонецЕсли;
		МассивЗадач.Добавить(ВыборкаДетальныеЗаписи.ЗадачаГотовностиКВыставлению);
		//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. 
		//МассивЗадач.Добавить(ВыборкаДетальныеЗаписи);
	КонецЦикла;                                                           
	Если МассивЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ОЧИСТКА
	Для Каждого ТекЗадача ИЗ МассивЗадач Цикл         
		ПервыйОтветственныйСоСформированнымиДокументам = Неопределено;
		ПервыйОтветственныйПоЗадаче = Неопределено;
		Отбор = Новый Структура;   
		Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача);
		//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. 
		//Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача.ЗадачаГотовностиКВыставлению);
		//Отбор.Вставить("Клиент",ТекЗадача.Клиент);
		//Отбор.Вставить("Договор",ТекЗадача.Договор);
		//Отбор.Вставить("Протокол",ТекЗадача.Протокол);
		//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. 
		Отбор.Вставить("ДокументыСформированы",ИСТИНА);
		НайденныеСтрокиПоЗадаче = ТЧСвязьУчетныхЕдиниц.НайтиСтроки(Отбор);
		Для Каждого ТекСтрока Из НайденныеСтрокиПоЗадаче Цикл
			ПервыйОтветственныйСоСформированнымиДокументам = ТекСтрока.ОтветственныйЗаУчет; 
			Прервать;
		КонецЦикла;
		Если ПервыйОтветственныйСоСформированнымиДокументам <> Неопределено Тогда
			УбратьНевыполненныеЗадачиПоДругимОтветственным(ПервыйОтветственныйСоСформированнымиДокументам, ТекЗадача);
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура;
		Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача); 
		//// ДИТ Поморцева Т.П. Задача 37052 09.02.22. 
		//Отбор.Вставить("ЗадачаГотовностиКВыставлению",ТекЗадача.ЗадачаГотовностиКВыставлению);
		//Отбор.Вставить("Клиент",ТекЗадача.Клиент);
		//Отбор.Вставить("Договор",ТекЗадача.Договор);
		//Отбор.Вставить("Протокол",ТекЗадача.Протокол);
		//// ДИТ Поморцева Т.П. Задача 37052 09.02.22.
		Отбор.Вставить("ДокументыСформированы",ЛОЖЬ);
		НайденныеСтрокиПоЗадаче = ТЧСвязьУчетныхЕдиниц.НайтиСтроки(Отбор);
		Для Каждого ТекСтрока Из НайденныеСтрокиПоЗадаче Цикл
			ПервыйОтветственныйПоЗадаче = ТекСтрока.ОтветственныйЗаУчет; 
			Прервать;
		КонецЦикла;
		Если ПервыйОтветственныйПоЗадаче <> Неопределено Тогда
			УбратьНевыполненныеЗадачиПоДругимОтветственным(ПервыйОтветственныйПоЗадаче, ТекЗадача);  
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры   
//ДИТ Беляев СЮ, ТА 42629, 02-12-2021 --

// Евросиб Фролов (26.12.2021 TASK №44663
Процедура ЗаполнитьГУИДСтрокЗаявок()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ втСвязьУчетныхЕдиниц
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	|ИЗ
	|	втСвязьУчетныхЕдиниц КАК втСвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО втСвязьУчетныхЕдиниц.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|			И втСвязьУчетныхЕдиниц.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И втСвязьУчетныхЕдиниц.Протокол = ЗаявкаСоставУслуги.ПСЦ
	|			И втСвязьУчетныхЕдиниц.Калькуляция = ЗаявкаСоставУслуги.Калькуляция";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("ГУИДСтрокиЗаявки", "")));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаСостава = СвязьУчетныхЕдиниц.Найти(Выборка.ГУИД, "ГУИД");
		Если СтрокаСостава <> Неопределено Тогда
			СтрокаСостава.ГУИДСтрокиЗаявки = Выборка.ГУИДСтрокиЗаявки;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры	
// Евросиб Фролов)

// Евросиб Фролов (17.02.2022 Ticket №0259955
// Евросиб Фролов (05.05.2022 Task №51113, добавил параметр МассивДобавленныхГУИД)
Процедура ДобавитьДоходыПоДоплатнымКТК()
		
	//НайдСтроки = Доходы.НайтиСтроки(Новый Структура("ДоплатныеКТК", Истина));
	//Если НайдСтроки.Количество() = 0 Тогда
	
	//Евросиб Каблов 12.02.2026 ( Ticket#0433414
	Начало2026года = '20260101';
	СтавкаНДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	СтавкаНДС22 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
	//Евросиб Каблов 12.02.2026 ) Ticket#0433414
	
	УслугаДоплатных = Константы.УслугаВыставленияДоплатныхКТК.Получить();
	//ОткрытыйПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435: добавил в структуру "ГУИДСтрокиЗаявки"
	ТаблДоплатных = СвязьУчетныхЕдиниц.Выгрузить(, "Контейнер, РазмерКТК, Доплата_Клиент,Доплата_Договор,Доплата_ПСЦ,Доплата_Калькуляция,Доплата_Доплата,Доплата_Валюта,Заявка,УсловияПеревозкиНазначение,ЖДН,ГУИД,ГУИДСтрокиЗаявки,КлючАналитикиСоставаПоезда");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблДоплатных", ТаблДоплатных);
	Запрос.УстановитьПараметр("DOOR", Перечисления.УсловияПеревозкиКТК.DOOR);
	
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("Доходы", Доходы.Выгрузить(Новый Структура("ДоплатныеКТК", Истина)));
	// Евросиб Фролов)
	
	Запрос.Текст =  "ВЫБРАТЬ
	|	ТаблДоплатных.Контейнер КАК Контейнер,
	|	ТаблДоплатных.РазмерКТК КАК Доплата_РазмерКТК,
	|	ТаблДоплатных.Доплата_Клиент КАК Доплата_Клиент,
	|	ТаблДоплатных.Доплата_Договор КАК Доплата_Договор,
	|	ТаблДоплатных.Доплата_ПСЦ КАК Доплата_ПСЦ,
	|	ТаблДоплатных.Доплата_Калькуляция КАК Доплата_Калькуляция,
	|	ТаблДоплатных.Доплата_Доплата КАК Доплата_Доплата,
	|	ТаблДоплатных.Доплата_Валюта КАК Доплата_Валюта,
	|	ТаблДоплатных.Заявка КАК Заявка,
	|	ТаблДоплатных.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	ТаблДоплатных.ГУИД КАК ГУИД,
	|	ТаблДоплатных.ЖДН КАК ЖДН,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	ТаблДоплатных.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	// Евросиб Фролов)
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
	|	ТаблДоплатных.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ПОМЕСТИТЬ Т1
	|ИЗ
	|	&ТаблДоплатных КАК ТаблДоплатных
	|ГДЕ
	|	ТаблДоплатных.Доплата_Доплата <> 0
	|;
	|
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.ГУИД КАК ГУИД,
	|	МЕСЯЦ(МАКСИМУМ(РелизСобственникаНоминации.ДатаВозвратаСобственнику)) КАК МесяцВозвратаСобственнику,
	|	МАКСИМУМ(РелизСобственникаНоминации.ДатаВозвратаСобственнику) КАК ДатаВозвратаСобственнику
	|ПОМЕСТИТЬ ВТ_СвязьДоплатСРелизом
	|ИЗ
	|	Т1 КАК Т1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	//|		ПО (РелизСобственникаНоминации.допл_Сделка = &Ссылка)
	|			ПО Т1.Доплата_Калькуляция = РелизСобственникаНоминации.допл_Калькуляция
	|			И Т1.Доплата_Договор = РелизСобственникаНоминации.Ссылка.Договор
	|			И Т1.Доплата_Клиент = РелизСобственникаНоминации.Ссылка.Контрагент
	|			И Т1.Доплата_ПСЦ = РелизСобственникаНоминации.Ссылка.ПСЦ
	|			И Т1.КлючАналитикиСоставаПоезда = РелизСобственникаНоминации.КлючАналитики.КлючАналитикиСоставаПоезда
	|
	|СГРУППИРОВАТЬ ПО
	|	Т1.ГУИД
	|;
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязьДоходовИРасходов.Доходы,
	|	СвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ втСвязьДоходовИРасходов
	|ИЗ
	|	&СвязьДоходовИРасходов КАК СвязьДоходовИРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ГУИД,
	|	Доходы.ДоплатныеКТК
	|ПОМЕСТИТЬ втДоходы
	|ИЗ
	|	&Доходы КАК Доходы
	|;
	// Евросиб Фролов)
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Контейнер КАК Контейнер,
	|	Т1.Доплата_Клиент КАК Доплата_Клиент,
	|	Т1.Доплата_РазмерКТК КАК Доплата_РазмерКТК,
	|	Т1.Доплата_Договор КАК Доплата_Договор,
	|	Т1.Доплата_ПСЦ КАК Доплата_ПСЦ,
	|	Т1.Доплата_Калькуляция КАК Доплата_Калькуляция,
	|	Т1.Доплата_Доплата КАК Доплата_Доплата,
	|	Т1.Доплата_Валюта КАК Доплата_Валюта,
	|	Т1.ЖДН КАК ЖДН,
	//Евросиб Каблов 12.02.2026 ( Ticket#0433414
	//// Евросиб Фролов (01.02.2022 Task №46345
	//|	ВЫБОР
	//|		КОГДА Т1.УсловияПеревозкиНазначение = &DOOR
	//|				И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	//|		ИНАЧЕ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	//|	КОНЕЦ КАК ДатаОказанияУслуг,
	//// Евросиб Фролов)
	//// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	//|	Т1.ГУИД КАК ГУИД_СУЕ,
	//|	втДоходы.ГУИД КАК ГУИДДоходы,
	//|	НАЧАЛОПЕРИОДА(ВЫБОР
	//|		КОГДА Т1.УсловияПеревозкиНазначение = &DOOR
	//|				И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	//|		ИНАЧЕ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	//|	КОНЕЦ, МЕСЯЦ) МесяцОказанияУслуги
	//// Евросиб Фролов)
	|	ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	|		ИНАЧЕ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	|	КОНЕЦ КАК ДатаОказанияУслуг,
	|	Т1.ГУИД КАК ГУИД_СУЕ,
	|	втДоходы.ГУИД КАК ГУИДДоходы,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку
	|		ИНАЧЕ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза
	|	КОНЕЦ, МЕСЯЦ) МесяцОказанияУслуги,
	//Евросиб Каблов 12.02.2026 ) Ticket#0433414
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
	|	ВТ_СвязьДоплатСРелизом.МесяцВозвратаСобственнику
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ИЗ
	|	Т1 КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО Т1.Заявка = ЗаявкаСоставУслуги.Ссылка
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	//|			И (Т1.ГУИД = ЗаявкаСоставУслуги.ГУИДСтроки
	//|				ИЛИ ЗаявкаСоставУслуги.НомерКТК = Т1.Контейнер)
	|			И Т1.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСвязьДоходовИРасходов КАК втСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоходы КАК втДоходы
	|			ПО втСвязьДоходовИРасходов.Доходы = втДоходы.ГУИД
	|				И втДоходы.ДоплатныеКТК
	|		ПО Т1.ГУИД = втСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	// Евросиб Фролов)
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоплатСРелизом КАК ВТ_СвязьДоплатСРелизом
	|		ПО Т1.ГУИД = ВТ_СвязьДоплатСРелизом.ГУИД
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	|ГДЕ
	// Евросиб Фролов (17.02.2022 Ticket №0259955
	//|	ВЫБОР
	//|			КОГДА Т1.УсловияПеревозкиНазначение = &DOOR
	//|				ТОГДА ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//Евросиб Каблов 12.02.2026 ( Ticket#0433414
	//|	(Т1.УсловияПеревозкиНазначение = &DOOR
	//|			И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	//|		ИЛИ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1))
	|	(ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Т1.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1))
	//Евросиб Каблов 12.02.2026 ) Ticket#0433414
    // Евросиб Фролов)
	|ИТОГИ
	// Евросиб Фролов (28.01.2022 Ticket№ 0244435, ошибка от ДИТ, закомментировал "МАКСИМУМ(втДоходы.ГУИД)"
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	// Т.к. по доплатным КТК всегда будет одна строка в доходах,
	// то возьмем максимум чтобы не делать еще одну группировку
	//| МАКСИМУМ(втДоходы.ГУИД)
	// Евросиб Фролов)
	|ПО
	|	Доплата_Калькуляция,
	|	Доплата_ПСЦ,
	|	Доплата_РазмерКТК,
	|	Доплата_Валюта,
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	|	МесяцОказанияУслуги,
	// Евросиб Фролов)
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
	|	МесяцВозвратаСобственнику";
	// Евросиб Рыбьяков К.А. 04.09.2025 ))
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДоплата_Калькуляция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//МассивИдентификаторовУдаляемыхСтрок = Новый Массив; // Евросиб Фролов (15.12.2021 Ticket№ 0244435, // Евросиб Фролов (01.02.2022 Task №46345, закомментировал
	
	//// Евросиб Фролов (05.05.2022 Task №51113
	//// Заполним состояния чтобы заполнилась корректно колонка "Документы сформированы".
	//ИспользованныеСостоянияУчета = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("ЗадачаГотовностиКВыставлению");
	//Для Каждого ТекущаяСтрока Из Доходы Цикл
	//	Если ЗначениеЗаполнено(ТекущаяСтрока.ЗадачаГотовностиКВыставлению) Тогда
	//		ИспользованныеСостоянияУчета.Добавить(ТекущаяСтрока.ЗадачаГотовностиКВыставлению);
	//	КонецЕсли;
	//КонецЦикла;
	//// Евросиб Фролов)      
	////ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
	//ИспользованныеСостоянияУчета = ПолучитьМассивИспользованныхСостоянийУчета(); 
	////ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец

	Пока ВыборкаДоплата_Калькуляция.Следующий() Цикл
		
		ВыборкаДоплата_ПСЦ = ВыборкаДоплата_Калькуляция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДоплата_ПСЦ.Следующий() Цикл
			
			ВыборкаДоплата_РазмерКТК = ВыборкаДоплата_ПСЦ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			
			Пока ВыборкаДоплата_РазмерКТК.Следующий() Цикл
				
				ВыборкаДоплата_Валюта = ВыборкаДоплата_РазмерКТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоплата_Валюта.Следующий() Цикл
					
					Если 
						ВыборкаДоплата_Валюта.Доплата_Доплата = 0 ИЛИ 
						//Доходы.НайтиСтроки(Новый Структура("Калькуляция, ПСЦ, ДоплатныеКТК", ВыборкаДоплата_Валюта.Доплата_Калькуляция, ВыборкаДоплата_Валюта.Доплата_ПСЦ, Истина)).Количество() > 0  ИЛИ
						(НЕ ЗначениеЗаполнено(УслугаДоплатных) И ВыборкаДоплата_Валюта.Доплата_Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки.Количество() = 0)
						Тогда 
						Продолжить; 
					КонецЕсли;
					
					// Евросиб Фролов (01.02.2022 Task №46345, вернул как было до измнений по доплатным
					ТЧДоходыНайдСтрока = Доходы.НайтиСтроки(Новый Структура("Калькуляция, ПСЦ, ДоплатныеКТК", ВыборкаДоплата_Валюта.Доплата_Калькуляция, ВыборкаДоплата_Валюта.Доплата_ПСЦ, Истина));					
					
					МассивОтфактурованныхКТКДоплаты = Новый Массив;
					Для каждого СтрОтфКТКДопл из ТЧДоходыНайдСтрока Цикл
						Если НЕ ЗначениеЗаполнено(СтрОтфКТКДопл.УчДокумент) Тогда Продолжить; КонецЕсли;
						СписокКТКСтроки = ДоходыКТК.Найти(СтрОтфКТКДопл.ГУИД, "ГУИД");
						Если СписокКТКСтроки <> неопределено Тогда
							МассивКТКСтр = СтрРазделить(СписокКТКСтроки.КТК, ";", Ложь);
							Для каждого КТКСтрДляПоиска из МассивКТКСтр Цикл
								НайдКТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(КТКСтрДляПоиска);
								Если ЗначениеЗаполнено(НайдКТКСсылка) Тогда
									МассивОтфактурованныхКТКДоплаты.Добавить(НайдКТКСсылка);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
					// Евросиб Фролов)
					
					// Евросиб Фролов (15.12.2021 Ticket№ 0244435
					ВыборкаДоплата_МесяцОказнияУслуги = ВыборкаДоплата_Валюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоплата_МесяцОказнияУслуги.Следующий() Цикл
						// Евросиб Фролов)				
						
						// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
						ВыборкаДоплата_МесяцВозвратаИзРелиза = ВыборкаДоплата_МесяцОказнияУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоплата_МесяцВозвратаИзРелиза.Следующий() Цикл
						// Евросиб Рыбьяков К.А. 04.09.2025 ))
						
						НДоходы = Неопределено;
						Для каждого СтрНДоходыАнализ из ТЧДоходыНайдСтрока Цикл
							Если НЕ ЗначениеЗаполнено(СтрНДоходыАнализ.УчДокумент)
								И НачалоМесяца(СтрНДоходыАнализ.ДатаОказанияУслуги) = ВыборкаДоплата_МесяцОказнияУслуги.МесяцОказанияУслуги Тогда // Евросиб Фролов (01.02.2022 Task №46345
								НДоходы = СтрНДоходыАнализ; // Евросиб Фролов (15.12.2021 Task №46345, вернул обновление строки и убрал удаление, т.к. если удалять, то задачи обновляются							
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если НДоходы = Неопределено Тогда
							НДоходы = Доходы.Добавить();
							НДоходы.ГУИД = Строка(Новый УникальныйИдентификатор); 
							//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, начало
							НДоходы.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
							//ДИТ, Беляев СЮ, Ticket#0272415, 09-06-2022, конец
						КонецЕсли;
						
						// Евросиб US 86792 TA 87489 Рыбьяков К.А. 02.07.2024 ((
						РеквизитОсновнаяУслуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДоплата_Валюта.Доплата_Калькуляция, "ОсновнаяУслуга");
						ВыбрУслуга = ?(ЗначениеЗаполнено(УслугаДоплатных), УслугаДоплатных, РеквизитОсновнаяУслуга);
						//ВыбрУслуга = ?(ЗначениеЗаполнено(УслугаДоплатных), УслугаДоплатных, ВыборкаДоплата_Валюта.Доплата_Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки[0].ВыставляемаяУслуга);
						// Евросиб Рыбьяков К.А. 02.07.2024 ))	
						ВыбрКонтейнеры = Новый Массив;
						
						НайдСтр = неопределено;
						
						Если ЗначениеЗаполнено(НДоходы.ГУИД) Тогда
							НайдСтр = ДоходыКТК.Найти(НДоходы.ГУИД, "ГУИД");
							Если НайдСтр <> неопределено Тогда
								МассивКТКСтр = СтрРазделить(НайдСтр.КТК, ";", Ложь);
								Для каждого КТКСтрДляПоиска из МассивКТКСтр Цикл
									НайдКТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(КТКСтрДляПоиска);
									Если ЗначениеЗаполнено(НайдКТКСсылка) Тогда
										ВыбрКонтейнеры.Добавить(НайдКТКСсылка);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
						// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
						// Евросиб Фролов (15.12.2021 Ticket№ 0244435
						//ВыборкаДетальныеЗаписи = ВыборкаДоплата_Валюта.Выбрать();
						//ВыборкаДетальныеЗаписи = ВыборкаДоплата_МесяцОказнияУслуги.Выбрать();
						ВыборкаДетальныеЗаписи = ВыборкаДоплата_МесяцВозвратаИзРелиза.Выбрать();
						// Фролов 15.12.2021 )
						// Евросиб Рыбьяков К.А. 04.09.2025 ))
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							// Евросиб Фролов (01.02.2022
							//Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза) Тогда Продолжить; КонецЕсли; закомментировал
							
							Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОказанияУслуг)Тогда
								Продолжить;
							КонецЕсли;	
							// Фролов )
							
							//ДИТ, Беляев СЮ, Ticket#0299328, 31-01-2023, начало
							//БЫЛО
							//Если ВыбрКонтейнеры.Найти(ВыборкаДетальныеЗаписи.Контейнер) = Неопределено
							//	И МассивОтфактурованныхКТКДоплаты.Найти(ВыборкаДетальныеЗаписи.Контейнер) = Неопределено Тогда
							//	ВыбрКонтейнеры.Добавить(ВыборкаДетальныеЗаписи.Контейнер);
							//КонецЕсли;
							//СТАЛО
							Если МассивОтфактурованныхКТКДоплаты.Найти(ВыборкаДетальныеЗаписи.Контейнер) <> Неопределено Тогда
								Продолжить;
							КонецЕсли;
							
							Если ВыбрКонтейнеры.Найти(ВыборкаДетальныеЗаписи.Контейнер) = Неопределено Тогда
								ВыбрКонтейнеры.Добавить(ВыборкаДетальныеЗаписи.Контейнер);
							КонецЕсли;
							//ДИТ, Беляев СЮ, Ticket#0299328, 31-01-2023, конец
							
							НДоходы.Себестоимость = ВыборкаДетальныеЗаписи.Доплата_Доплата;
							
							// Евросиб Фролов (15.12.2021 Ticket№ 0244435
 							Документы.Сделка.СвязатьДоходыРасходыСУЕ(ЭтотОбъект, НДоходы.ГУИД,, ВыборкаДетальныеЗаписи.ГУИД_СУЕ, ВыбрУслуга);
							// Фролов 15.12.2021 )
							
						КонецЦикла;
						
						НДоходы.Клиент = ВыборкаДоплата_Валюта.Доплата_ПСЦ.Контрагент;
						НДоходы.Договор = ВыборкаДоплата_Валюта.Доплата_ПСЦ.Договор;
						НДоходы.Услуга = ВыбрУслуга;
						НДоходы.Калькуляция = ВыборкаДоплата_Валюта.Доплата_Калькуляция;
						НДоходы.Количество = ВыбрКонтейнеры.Количество();
						
						Если НДоходы.Количество = 0 Тогда
							МассивУдаляемыхСтрок = Новый Массив;
							МассивУдаляемыхСтрок.Добавить(НДоходы.ГУИД);
							Документы.Сделка.ОчиститьДанныеВВспомогательныхТаблицахНаСервере(ЭтотОбъект, МассивУдаляемыхСтрок, "Доходы");
							Доходы.Удалить(НДоходы);
							Продолжить;
						КонецЕсли;
						
						НДоходы.СтавкаНДС = НДоходы.Калькуляция.СтавкаНДС;
						//Евросиб Каблов 12.02.2026 ( Ticket#0433414
						Если НДоходы.СтавкаНДС = СтавкаНДС20 И НДоходы.ДатаОказанияУслуги >= Начало2026года Тогда
							НДоходы.СтавкаНДС = СтавкаНДС22;
						ИначеЕсли НДоходы.СтавкаНДС = СтавкаНДС22 И НДоходы.ДатаОказанияУслуги < Начало2026года Тогда
							НДоходы.СтавкаНДС = СтавкаНДС20;
						КонецЕсли;
						//Евросиб Каблов 12.02.2026 ) Ticket#0433414
						НДоходы.НДСВключенВСтоимость = НДоходы.Калькуляция.СуммаВключаетНДС;
						НДоходы.РазмерКТК = ВыборкаДоплата_Валюта.Доплата_РазмерКТК;
						//Евросиб - АСуслов 25.05.2021 17:40:46 #
						//(
						//НДоходы.ПериодВО = ОткрытыйПериодВО;
						//)
						//Евросиб - АСуслов 25.05.2021 17:40:47 #
						НДоходы.Валюта = ВыборкаДоплата_Валюта.Доплата_Валюта;
						НДоходы.ПСЦ = ВыборкаДоплата_Валюта.Доплата_ПСЦ;
						НДоходы.Комментарий = "Добавлено автоматически при записи сделки с доплатными КТК";
						НДоходы.ГУИДСтрокиДохода = НДоходы.ГУИД;
						НДоходы.УслугаВнеСтавки = Истина;
						НДоходы.ГотовоКВыставлению = Истина;
						НДоходы.ЕдиницаИзмерения = НДоходы.Калькуляция.ЕдиницаИзмерения;
						НДоходы.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную;
						НДоходы.ДоплатныеКТК = Истина;
						НДоходы.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(ТипЗаказа, "");						
						НДоходы.Ставка = НДоходы.Себестоимость + НДоходы.Вознаграждение;
						НДоходы.Рентабельность = НДоходы.Вознаграждение / ?(НДоходы.Ставка = 0, 1, НДоходы.Ставка);						
						НДоходы.СебестоимостьИтого = НДоходы.Количество * НДоходы.Себестоимость;
						НДоходы.ВознаграждениеИтого = НДоходы.Количество * НДоходы.Вознаграждение;
						НДоходы.СтавкаИтого = НДоходы.Количество * НДоходы.Ставка;						
						НДоходы.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НДоходы.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НДоходы.СтавкаНДС), Истина, НДоходы.НДСВключенВСтоимость);						
						НДоходы.СуммаИтого = НДоходы.СтавкаИтого + ?(НДоходы.НДСВключенВСтоимость, 0, НДоходы.СуммаНДС);												
						
						СписокКТК = СтрСоединить(ВыбрКонтейнеры, ";");
						//Евросиб - АСуслов 22.04.2022 13:43:56 #45021
						//(
						//Документы.Сделка.ДобавитьКТКВДоходы(ЭтотОбъект, НДоходы.ГУИД, СписокКТК, Истина); 
						ДоходыСделкиСервер.ДобавитьКТКВДоходы(ЭтотОбъект, НДоходы.ГУИД, СписокКТК, Истина); 
						//)
						//Евросиб - АСуслов 22.04.2022 13:43:57 #45021
						// Фролов 15.12.2021 )
						
						// Евросиб Фролов (05.05.2022 Task №51113					
						//ТекСостояниеДоплатныхКТК = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостоянияУчета); //ДИТ, Беляев СЮ, US 37052, 23-08-2022, закомментировал
						//НДоходы.ЗадачаГотовностиКВыставлению = ТекСостояниеДоплатныхКТК; //ДИТ, Беляев СЮ, US 37052, 23-08-2022, закомментировал
						//ИспользованныеСостоянияУчета.Добавить(ТекСостояниеДоплатныхКТК); //ДИТ, Беляев СЮ, US 37052, 23-08-2022, закомментировал
						//МассивДобавленныхГУИД.Добавить(НДоходы); //ДИТ, Беляев СЮ, US 37052, 23-08-2022, закомментировал
						// Евросиб Фролов)
						
						// Евросиб US 88683 TA 108959 Рыбьяков К.А. 04.09.2025 ((
						КонецЦикла;
						// Евросиб Рыбьяков К.А. 04.09.2025 ))
						
					КонецЦикла; // Евросиб Фролов (15.12.2021 Ticket№ 0244435
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Документы.Сделка.ОчиститьДанныеВВспомогательныхТаблицахНаСервере(ЭтотОбъект, МассивИдентификаторовУдаляемыхСтрок, "Доходы"); // Евросиб Фролов (15.12.2021 Ticket№ 0244435 // Евросиб Фролов (01.02.2022 Task №46345, закомментировал;

КонецПроцедуры
// Евросиб Фролов)

// Евросиб Фролов (09.03.2022 Task №44927
Процедура ДобавитьЗадачуВыставленияДокументовПоФрахту()
		
	СтрокиГотовоКВыставлениюФрахт = СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("ГотовоКВыставлениюФрахт", Истина));
	Если СтрокиГотовоКВыставлениюФрахт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ИспользованныеСостояния = СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("ЗадачаГотовностиКВыставлению");
	//Для Каждого ТекущаяСтрока Из Доходы Цикл
	//	Если ЗначениеЗаполнено(ТекущаяСтрока.ЗадачаГотовностиКВыставлению) Тогда
	//		ИспользованныеСостояния.Добавить(ТекущаяСтрока.ЗадачаГотовностиКВыставлению);
	//	КонецЕсли;
	//КонецЦикла; 
	//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
	ИспользованныеСостояния = ПолучитьМассивИспользованныхСостоянийУчета();
	//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец
	
	СтрокиГотовоКВыставлениюФрахт.Свернуть("Клиент, Договор");
	
	// Для каждого договора создадим задачу
	ТекстКомментария = "Фрахт";
	Для Каждого ТекущийДоговор Из СтрокиГотовоКВыставлениюФрахт Цикл
		
		// Т.к. по КТК уже может быть создана задача на выставление документов, то для того, чтобы отличать эти задачи, добавим комментарий.
		СостояниеСозданияКомплектаДокументов = ВыдатьСвободноеСостояниеУчета(ИспользованныеСостояния);
		НайденноеСостояние = Состояния.НайтиСтроки(Новый Структура("Состояние, Комментарий, Клиент, Договор", СостояниеСозданияКомплектаДокументов, ТекстКомментария, ТекущийДоговор.Клиент, ТекущийДоговор.Договор));
		Если НайденноеСостояние.Количество() = 0 Тогда
			Исполнитель = Автор;
			
			ДоговорСтроки = ТекущийДоговор.Договор;
			Если ЗначениеЗаполнено(ДоговорСтроки) Тогда
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 29.11.2022
				// Было:
				//ОтветственныйЗаУчетПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорСтроки, "ОтветственныйЗаУчет");
				//Стало: 
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Договор",				ДоговорСтроки);
				СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
				СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
				ОтветственныйЗаУчетПоДоговору = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 29.11.2022
				Если ЗначениеЗаполнено(ОтветственныйЗаУчетПоДоговору)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветственныйЗаУчетПоДоговору, "Недействителен") = Ложь Тогда
					Исполнитель = ОтветственныйЗаУчетПоДоговору;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСостояния = Состояния.Добавить();
			СтрокаСостояния.Исполнитель = Исполнитель;
			СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
			СтрокаСостояния.Комментарий = ТекстКомментария;																										  
			СтрокаСостояния.Состояние = СостояниеСозданияКомплектаДокументов;
			СтрокаСостояния.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
			СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			СтрокаСостояния.Договор = ТекущийДоговор.Договор;
			СтрокаСостояния.Клиент = ТекущийДоговор.Клиент;
			
			ИспользованныеСостояния.Добавить(СостояниеСозданияКомплектаДокументов);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗакрытьЗадачиВыставленияДокументовПоФрахту()

	ТаблицаСвязьУЕ = СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("ГотовоКВыставлениюФрахт", Истина));
	
	Если ТаблицаСвязьУЕ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если Состояния.Найти("Фрахт", "Комментарий") = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&ТЧСвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.ЗадачаГотовностиКВыставлению КАК ЗадачаГотовностиКВыставлению
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&ТЧДоходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.ГУИДИсправляемойСтроки = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	&ТЧСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ) КАК ДокументыСформированы
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
	|			ПО (СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы)
	|		ПО СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	|	И НЕ СделкаДоходы.ГУИД ЕСТЬ NULL
	|	И СделкаДоходы.ЗадачаГотовностиКВыставлению = ЗНАЧЕНИЕ(Справочник.Состояния.ПустаяСсылка)
	|ИТОГИ
	|	МИНИМУМ(ДокументыСформированы)
	|ПО
	|	СделкаСвязьУчетныхЕдиниц.Договор";
	
	УслугаФрахт = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	
	Запрос.УстановитьПараметр("ТЧСвязьДоходовИРасходов", 	СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходы", 					Доходы.Выгрузить(Новый Структура("Услуга", УслугаФрахт)));
	Запрос.УстановитьПараметр("ТЧСвязьУчетныхЕдиниц", 		ТаблицаСвязьУЕ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ДокументыСформированы = Истина Тогда
			
			СтрокиЗадачФрахта = Состояния.НайтиСтроки(Новый Структура("Договор, Комментарий", Выборка.Договор, "Фрахт"));
			Для Каждого ТекСтрока Из СтрокиЗадачФрахта Цикл
				ТекСтрока.Статус = Перечисления.СтатусыЭтапов.Выполнен;
			КонецЦикла;	
		
	    КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
// Евросиб Фролов)

// Евросиб Фролов (24.03.2022 US №40767, Task №48649
Процедура ПроверитьВозможностьОтменыПроведенияДокумента(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	СписокРодительскихОбъектов = КонтрольДоступностиДокументов_сервер.ПолучитьСписокРодительскихОбъектов(ЭтотОбъект);
	
	ВыборкаПодчиненныхДокументов = КонтрольДоступностиДокументов_сервер.ПолучитьВыборкуПодчиненныхДокументов(ЭтотОбъект.Ссылка);
	Если ВыборкаПодчиненныхДокументов = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ВыводитьЗаголовок = Истина;
	Пока ВыборкаПодчиненныхДокументов.Следующий() Цикл
		
		Если СписокРодительскихОбъектов.НайтиПоЗначению(ВыборкаПодчиненныхДокументов.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ВыводитьЗаголовок Тогда
			НомерЗаявки = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер);
			ДатаЗаявки = Формат(Дата, "ДЛФ=DD");
			ОбщегоНазначения.СообщитьПользователю(
												СтрШаблон("Удаление и отмена проведения сделки №%1 от %2 невозможны. На основе сделки сформированы следующие документы:", НомерЗаявки, ДатаЗаявки),
												ЭтотОбъект,
												,
												,
												Отказ);
			ВыводитьЗаголовок = Ложь;
		КонецЕсли;	
		
		Если ВыборкаПодчиненныхДокументов.СуммаДокумента <> Null Тогда
			ПредставлениеОбъекта = ВыборкаПодчиненныхДокументов.Представление + " " + НСтр("ru='на сумму'") + " " + Формат(ВыборкаПодчиненныхДокументов.СуммаДокумента, "ЧДЦ=2; ЧН=0") + " " + ВыборкаПодчиненныхДокументов.Валюта;
		Иначе
			ПредставлениеОбъекта = ВыборкаПодчиненныхДокументов.Представление;
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(
												ПредставлениеОбъекта,
												ВыборкаПодчиненныхДокументов.Ссылка,
												,
												,
												Отказ);		
													
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
// Евросиб Фролов)

// Евросиб Фролов (27.04.2022 Task №50551
Процедура ОтключитьРасходыПоОтмеченнымКТК()
	// Проверим, что по строкам КТК, где установлен признак "Отменить расходы",
	// не были сформированы документы.
	ОтключаемыеКТК = СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("ОтключитьРасходы", Истина));
	МассивГУИД = СвязьУчетныхЕдиниц.Выгрузить(Новый Структура("ОтключитьРасходы", Истина), "ГУИД").ВыгрузитьКолонку("ГУИД");
	КТКСРасходами = Документы.Сделка.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивГУИД, ЭтотОбъект);
	Для Каждого ТекущаяСтрока Из ОтключаемыеКТК Цикл
		Если ТекущаяСтрока.ДокументыСформированы
			Или КТКСРасходами.Найти(ТекущаяСтрока.ГУИД) <> Неопределено Тогда
			ТекущаяСтрока.ОтключитьРасходы = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Для КТК " + ТекущаяСтрока.Контейнер + " были сформированы закрывающие документы. Расходы по этому КТК не были отключены.",
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СвязьУчетныхЕдиниц", ТекущаяСтрока.НомерСтроки, "Контейнер"));
		КонецЕсли;	
	КонецЦикла;
	РаботаСоСделкамиСервер.ОтключитьСтрокиРасходовПоОтмеченнымКТК(ЭтотОбъект);
КонецПроцедуры	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	//Евросиб Коханенко Н.А. 05.06.2025 (( #111572
	//сообщения стали неактуальны после того, как «Региональный ЦФО» стал необязательным для заполнения и был скрыт на форме
	//ТекстПричины = "";
	//Если Служебная Тогда                                              
	//	РегиональныйЦФОРасходыДКП = Справочники.РегиональныеЦФО.РасходыДКП;
	//	Если РегиональныйЦФО <> РегиональныйЦФОРасходыДКП Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Для служебных сделок региональный ЦФО устанавливается значением «Расходы ДКП». Значение изменено.");
	//	КонецЕсли;
	//	РегиональныйЦФО = РегиональныйЦФОРасходыДКП;
	//ИначеЕсли НЕ ЗначениеЗаполнено(РегиональныйЦФО) Тогда 
	//	РеквизитыСтанцииОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтанцияОтправления,"ЖелезнаяДорога, Тип");
	//	Если ЗначениеЗаполнено(РеквизитыСтанцииОтправления.ЖелезнаяДорога) Тогда
	//		РегиональныйЦФО = Справочники.РегиональныеЦФО.ПолучитьРегиональныйЦФОПоДороге(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтанцияОтправления,"ЖелезнаяДорога"));	
	//		Если НЕ ЗначениеЗаполнено(РегиональныйЦФО) Тогда
	//			ТекстПричины = СтрШаблон("Не найдено соответствие дороги станции отправления «%1» и регионального ЦФО.", РеквизитыСтанцииОтправления.ЖелезнаяДорога);
	//		КонецЕсли;
	//	ИначеЕсли РеквизитыСтанцииОтправления.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
	//		ТекстПричины = СтрШаблон("Не заполнена дорога у станции отправления «%1»", СтанцияОтправления);
	//	Иначе
	//		ТекстПричины = "Станция отправления не является ЖД станцией";
	//	КонецЕсли;
	//	Если Не ЗначениеЗаполнено(РегиональныйЦФО) Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось определить значение по умолчанию для реквизита «Региональный ЦФО»: %1
	//		|Необходимо заполнить данные вручную.", ТекстПричины));
	//	КонецЕсли;
	//КонецЕсли;
	//Евросиб Коханенко Н.А. 05.06.2025 )) #111572 
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 12.09.2024
	Для каждого СтрРейса Из Рейсы Цикл
		Если ТипЗнч(СтрРейса.Рейс) = Тип("СправочникСсылка.РейсыМоре") 
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрРейса.Рейс, "ПометкаУдаления") Тогда
		    ТекстСообщения = СтрШаблон("Морской рейс помечен на удаление в строке %1 списка 'Перечень рейсов'. Выберите другой актуальный рейс. Документ не проведен", СтрРейса.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, 
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Рейсы", СтрРейса.НомерСтроки, "Рейс"),,Отказ); 
		КонецЕсли;
	КонецЦикла;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024
	
КонецПроцедуры

////ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, начало, (закомментировал функцию, не используется)
//Функция ПолучитьОтветственногоПоДоговору(Договор,ЦФО)
// 
//	Отв=Справочники.Пользователи.ПустаяСсылка(); 
//	Если ЦФО=Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО Тогда
//		Если ЗначениеЗаполнено(Договор.ОтветственныйЗаУчет) Тогда
//			Отв=Договор.ОтветственныйЗаУчет;
//		Иначе
//			Отв=Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО.ОтветственныйЗаУчет;
//		КонецЕсли;
//	Иначе
//			Если ЗначениеЗаполнено(Договор.ОтветственныйЗаУчетНСК) Тогда
//			Отв=Договор.ОтветственныйЗаУчетНСК;
//		Иначе
//			Отв=ЦФО.ОтветственныйЗаУчет;
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Отв;
//		   
//КонецФункции
//ДИТ, Беляев СЮ, Ticket#0343311, 28-02-2024, конец

Процедура ДобавитьЗадачуГотовностьКомплектаПодтверждающихДокументов()
	
	// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
	СостояниеРодитель = Справочники.Состояния.ЗадачиГотовностьКомплектаПодтверждающихДокументов;
	ИспользованныеСостоянияУчета = Новый Массив;
	
	Для Каждого СтрокаСостояния Из Состояния Цикл
		Если СтрокаСостояния.Состояние.Родитель = СостояниеРодитель Тогда
			ИспользованныеСостоянияУчета.Добавить(СтрокаСостояния.Состояние);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПодтверждающиеДокументы", Истина);
	ТЗГотовностиКомплектаДокументов = СвязьУчетныхЕдиниц.Выгрузить(СтруктураОтбора, "Клиент, Договор, Контейнер");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗГотовностиКомплектаДокументов", ТЗГотовностиКомплектаДокументов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗГотовностиКомплектаДокументов.Клиент КАК Клиент,
	|	ТЗГотовностиКомплектаДокументов.Договор КАК Договор,
	|	ТЗГотовностиКомплектаДокументов.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ ВТ_ТекущиеДанные
	|ИЗ
	|	&ТЗГотовностиКомплектаДокументов КАК ТЗГотовностиКомплектаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ ВТ_СсылкаДанные
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И СделкаСвязьУчетныхЕдиниц.ПодтверждающиеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК Ответственный,
	|	ВТ_ТекущиеДанные.Клиент КАК Клиент,
	|	ВТ_ТекущиеДанные.Контейнер КАК Контейнер
	|ИЗ
	|	ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	|		ПО ВТ_ТекущиеДанные.Договор = ДоговорыКонтрагентовОтветственные.Ссылка
	|			И (ДоговорыКонтрагентовОтветственные.ЦФО = &ЦФО)
	|			И (ДоговорыКонтрагентовОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
	|ГДЕ
	|	НЕ (ВТ_ТекущиеДанные.Клиент, ВТ_ТекущиеДанные.Договор, ВТ_ТекущиеДанные.Контейнер) В
	|				(ВЫБРАТЬ
	|					ВТ_СсылкаДанные.Клиент КАК Клиент,
	|					ВТ_СсылкаДанные.Договор КАК Договор,
	|					ВТ_СсылкаДанные.Контейнер КАК Контейнер
	|				ИЗ
	|					ВТ_СсылкаДанные КАК ВТ_СсылкаДанные)
	|ИТОГИ ПО
	|	Ответственный,
	|	Клиент";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСообщений = 
		НСтр("ru = 'Готовность подтверждающих документов для %1 по КТК %2'");
	
	ВыборкаОтветственный = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ответственный");
	
	Пока ВыборкаОтветственный.Следующий() Цикл
		ВыборкаКлиент = ВыборкаОтветственный.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Клиент");
		Пока ВыборкаКлиент.Следующий() Цикл
			Выборка = ВыборкаКлиент.Выбрать();
			
			МассивКТК = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				МассивКТК.Добавить(Выборка.Контейнер);
			КонецЦикла;
			
			СтрокаСостояния = Состояния.Добавить();
			СтрокаСостояния.Состояние = 
				ВыдатьСвободноеСостояниеУчетаГотовностьКомплектаПодтверждающихДокументов(ИспользованныеСостоянияУчета);
			СтрокаСостояния.Исполнитель = ВыборкаОтветственный.Ответственный;
			СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
			СтрокаСостояния.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
			СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			СтрокаСостояния.Клиент = ВыборкаКлиент.Клиент;
			//Евросиб - АСуслов 31.03.2023 11:31:43 #67901
			//(
			//независимая задача
			СтрокаСостояния.ПредыдущиеЭтапы = "999";
			//)
			//Евросиб - АСуслов 31.03.2023 11:31:57 #67901
			
			СтрокаСписокКТК = СтрСоединить(МассивКТК, ", ");
			СтрокаСостояния.Комментарий = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщений, ВыборкаКлиент.Клиент, СтрокаСписокКТК);
			
			ИспользованныеСостоянияУчета.Добавить(СтрокаСостояния.Состояние);
		КонецЦикла;
	КонецЦикла;
	// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
	
КонецПроцедуры

Функция ВыдатьСвободноеСостояниеУчетаГотовностьКомплектаПодтверждающихДокументов(МассивИспользованных)
	
	// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
	Для Сч = 1 по 40 Цикл
		
		СостУчета = Справочники.Состояния["ГотовностьКомплектаПодтверждающихДокументов"+Сч];
		Если МассивИспользованных.Найти(СостУчета) = Неопределено Тогда
			МассивИспользованных.Добавить(СостУчета);
			Возврат СостУчета;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
	
КонецФункции
// Евросиб Фролов)

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
Процедура ПроверитьЗадачиНаУдалениеКонтейнеровПоРефСцепам()
	
		ЗадачиНаУдалениеКонтейнеровПоРефСцепам();	
	
КонецПроцедуры

Процедура ЗадачиНаУдалениеКонтейнеровПоРефСцепам()
		
	Документы.Сделка.ПостановкаЗадачиНаУдалениеКонтейнерыПоРефСцепу(ЭтотОбъект);
		
КонецПроцедуры	

//Евросиб Каблов 07.06.2023 #68187
Процедура ОбновитьРасчетыСНП()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетСНП.Ссылка КАК РасчетСНП,
	|	РасчетСНП.УчДокумент КАК УчДокумент,
	|	РасчетСНП.ГУИДСтрокиДохода КАК ГУИДСтрокиДохода,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.ГУИДИсправляемойСтроки = """"
	|			ТОГДА ЕСТЬNULL(СделкаДоходы.УчДокумент, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента, ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
	|	КОНЕЦ КАК УчДокументВСделке,
	|	ВЫБОР
	|		КОГДА НЕ Аннулирование.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчДокументАннулирован,
	|	ЕСТЬNULL(СделкаДоходы.ГУИД, """") КАК ГУИДСтрокиДоходаВСделке
	|ИЗ
	|	Документ.РасчетСНП КАК РасчетСНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Аннулирование
	|			ПО СделкаДоходы.УчДокумент = Аннулирование.ДокументРеализации
	|				И (Аннулирование.Проведен)
	|				И (Аннулирование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	|		ПО РасчетСНП.Сделка = СделкаДоходы.Ссылка
	|			И РасчетСНП.ГУИДСтрокиДохода = СделкаДоходы.ГУИД
	|			И (РасчетСНП.ЭтоКорректировка = СделкаДоходы.КорректировкаДокумента <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
	|ГДЕ
	|	РасчетСНП.Сделка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьРасчетСНП = Ложь;
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		Если Не ЗначениеЗаполнено(Выборка.УчДокумент) Тогда			
			УчДокумент = Неопределено;
		Иначе
			УчДокумент = Выборка.УчДокумент;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Выборка.УчДокументВСделке) Тогда			
			УчДокументВСделке = Неопределено;
		Иначе
			УчДокументВСделке = Выборка.УчДокументВСделке;	
		КонецЕсли;
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		
		Если Выборка.ГУИДСтрокиДохода <> Выборка.ГУИДСтрокиДоходаВСделке
				Или УчДокумент <> УчДокументВСделке Тогда
				
			РасчетСНП = Выборка.РасчетСНП.ПолучитьОбъект();
			РасчетСНП.ГУИДСтрокиДохода = Выборка.ГУИДСтрокиДоходаВСделке;
			//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
			
			Если Не ЗначениеЗаполнено(РасчетСНП.УчДокумент) Тогда			
				РасчетСНПУчДокумент = Неопределено;
			Иначе
				РасчетСНПУчДокумент = РасчетСНП.УчДокумент;	
			КонецЕсли;
			
			Если РасчетСНПУчДокумент <> УчДокументВСделке И ЗначениеЗаполнено(УчДокументВСделке) Тогда
				Если ЗначениеЗаполнено(РасчетСНП.КлючАналитикиПеревозки) Тогда
					СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
					СтруктураКлюча.КлючАналитики = РасчетСНП.КлючАналитикиПеревозки;
					тЭтапыСНП = РасчетСНП.КлючАналитикиПеревозки.ЭтапыСНП.Выгрузить();
					Если РасчетСНП.ЭтапСНП = Справочники.ЭтапыСНП.СНПВЛокацииОтправленияИностраннаяТерритория Тогда
						СтруктураПоиска = Новый Структура("ЭтапСНП","1");
						НайденныеСтроки = тЭтапыСНП.НайтиСтроки(СтруктураПоиска);
						Если НайденныеСтроки.Количество() Тогда
							НайденныеСтроки[0].НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НайденныеСтроки[0].ДатаСчета  = РасчетСНП.Счет.ДатаДокумента;
						Иначе
							НовСтрока = тЭтапыСНП.Добавить();
							НовСтрока.ЭтапСНП = "1";
							НовСтрока.НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НовСтрока.ДатаСчета = РасчетСНП.Счет.ДатаДокумента;
						КонецЕсли;
						СтруктураКлюча.ИзменятьТЧЭтапыСНП = Истина;
						СтруктураКлюча.ТЧЭтапыСНП = тЭтапыСНП;
					ИначеЕсли РасчетСНП.ЭтапСНП = Справочники.ЭтапыСНП.СНПВПортуПрибытия Тогда
						СтруктураПоиска = Новый Структура("ЭтапСНП","2");
						НайденныеСтроки = тЭтапыСНП.НайтиСтроки(СтруктураПоиска);
						Если НайденныеСтроки.Количество() Тогда
							НайденныеСтроки[0].НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НайденныеСтроки[0].ДатаСчета  = РасчетСНП.Счет.ДатаДокумента;
						Иначе
							НовСтрока = тЭтапыСНП.Добавить();
							НовСтрока.ЭтапСНП = "2";
							НовСтрока.НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НовСтрока.ДатаСчета = РасчетСНП.Счет.ДатаДокумента;
						КонецЕсли;
						СтруктураКлюча.ИзменятьТЧЭтапыСНП = Истина;
						СтруктураКлюча.ТЧЭтапыСНП = тЭтапыСНП;
					ИначеЕсли РасчетСНП.ЭтапСНП = Справочники.ЭтапыСНП.СНПНаЖДСтанцииПрибытия Тогда
						СтруктураПоиска = Новый Структура("ЭтапСНП","3");
						НайденныеСтроки = тЭтапыСНП.НайтиСтроки(СтруктураПоиска);
						Если НайденныеСтроки.Количество() Тогда
							НайденныеСтроки[0].НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НайденныеСтроки[0].ДатаСчета  = РасчетСНП.Счет.ДатаДокумента;
						Иначе
							НовСтрока = тЭтапыСНП.Добавить();
							НовСтрока.ЭтапСНП = "3";
							НовСтрока.НомерСчета = РасчетСНП.Счет.НомерДляПечати;
							НовСтрока.ДатаСчета = РасчетСНП.Счет.ДатаДокумента;
						КонецЕсли;
						СтруктураКлюча.ИзменятьТЧЭтапыСНП = Истина;
						СтруктураКлюча.ТЧЭтапыСНП = тЭтапыСНП;
					КонецЕсли;	
					Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
				КонецЕсли;
			КонецЕсли;	
			//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
			РасчетСНП.УчДокумент = УчДокументВСделке;
			РасчетСНП.АннулированДокумент = Выборка.УчДокументАннулирован;
			
			Если РасчетСНП.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			РасчетСНП.Записать(РежимЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Евросиб US 91362 TA 104075 Рыбьяков К.А. 16.04.2025 ((
Процедура ОбновитьРасчетыДополнительныхРасходов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетДополнительныеРасходы.Ссылка КАК РасчетДополнительныеРасходы,
	|	РасчетДополнительныеРасходы.УчетныйДокумент КАК УчДокумент,
	|	РасчетДополнительныеРасходы.ПометкаУдаления КАК ПометкаУдаления,
	|	РасчетДополнительныеРасходы.ГУИДСтрокиДохода КАК ГУИДСтрокиДохода,
	|	ЕСТЬNULL(СделкаДоходы.УчДокумент, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК УчДокументВСделке,
	|	ВЫБОР
	|		КОГДА НЕ Аннулирование.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчДокументАннулирован,
	|	ЕСТЬNULL(СделкаДоходы.ГУИД, """") КАК ГУИДСтрокиДоходаВСделке,
	|	РасчетДополнительныеРасходы.Заявка КАК Заявка
	|ИЗ
	|	Документ.РасчетДополнительныеРасходы КАК РасчетДополнительныеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Аннулирование
	|			ПО СделкаДоходы.УчДокумент = Аннулирование.ДокументРеализации
	|				И (Аннулирование.Проведен)
	|				И (Аннулирование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	|		ПО РасчетДополнительныеРасходы.Сделка = СделкаДоходы.Ссылка
	|			И РасчетДополнительныеРасходы.ГУИДСтрокиДохода = СделкаДоходы.ГУИД
	|ГДЕ
	|	РасчетДополнительныеРасходы.Сделка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ГУИДСтрокиДохода <> Выборка.ГУИДСтрокиДоходаВСделке
				Или Выборка.УчДокумент <> Выборка.УчДокументВСделке Тогда
				
			РасчетДополнительныеРасходы = Выборка.РасчетДополнительныеРасходы.ПолучитьОбъект();
			РасчетДополнительныеРасходы.ГУИДСтрокиДохода = Выборка.ГУИДСтрокиДоходаВСделке;
			РасчетДополнительныеРасходы.УчетныйДокумент = Выборка.УчДокументВСделке;
			
			НайденнаяЗаявки = Заявки.НайтиСтроки(Новый Структура("Заявка", Выборка.Заявка));
			
			ЗаявкаУдалена = Ложь;
			//СтрокаДоходовУдалена = Ложь;
			Если НайденнаяЗаявки.Количество() = 0 Тогда
				РасчетДополнительныеРасходы.ДополнительныеСвойства.Вставить("УдалениеЗаявки");
				ЗаявкаУдалена = Истина;
			КонецЕсли;
			
			Если РасчетДополнительныеРасходы.ПометкаУдаления Тогда
				РасчетДополнительныеРасходы.ДополнительныеСвойства.Вставить("УдалениеСтрокиДоходов");
				//СтрокаДоходовУдалена = Истина;
			КонецЕсли;
			
			Если ЗаявкаУдалена Тогда
				РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			РасчетДополнительныеРасходы.Записать(РежимЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 16.04.2025 ))

// Евросиб BUG 88347 TA 88348 Рыбьяков К.А. 12.07.2024 ((
Процедура ПроверитьОбработанныеСтрокиИзАкцепта()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДляДобавленияСтрокАкцептовВСделку.ПТУ КАК ПТУ,
	|	ДанныеДляДобавленияСтрокАкцептовВСделку.ГУИД КАК ГУИДСтрокиАкцепта
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляДобавленияСтрокАкцептовВСделку КАК ДанныеДляДобавленияСтрокАкцептовВСделку
	|		ПО (СделкаРасходы.ГУИД = ДанныеДляДобавленияСтрокАкцептовВСделку.ГУИДРасходов)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|		ПО (АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД)
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Сделка
	|	И НЕ СделкаРасходы.УслугаОтключена
	|	И НЕ ДанныеДляДобавленияСтрокАкцептовВСделку.Обработано";
	
	Запрос.УстановитьПараметр("Сделка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПТУ = Выборка.ПТУ;
		МенеджерЗаписи.ГУИД = Выборка.ГУИДСтрокиАкцепта;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Обработано = Истина;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(Выборка.ПТУ, Ссылка);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 

Процедура ПроставитьГуидыДоходныхСтрокВКорСНП()	//Евросиб Шевченко А.В. US 95275 TA 123179 05.12.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаДоходы.ГУИД КАК ГУИДСтрокиДохода,
		|	РасчетСНПКор.Ссылка КАК РасчетСНПКор
		|ИЗ
		|	Документ.Сделка.Доходы КАК СделкаДоходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСНП КАК РасчетСНПКор
		|			ПО РасчетСНП.Ссылка = РасчетСНПКор.ПервыйРасчет
		|				И (РасчетСНПКор.Проведен)
		|				И (РасчетСНПКор.ЭтоКорректировка)
		|				И (РасчетСНПКор.ГУИДСтрокиДохода = """")
		|		ПО СделкаДоходы.Ссылка = РасчетСНП.Сделка
		|			И СделкаДоходы.ГУИДИсправляемойСтроки = РасчетСНП.ГУИДСтрокиДохода
		|			И (РасчетСНП.Проведен)
		|ГДЕ
		|	СделкаДоходы.Ссылка = &Ссылка
		|	И СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы)
		|	И СделкаДоходы.ГУИДИсправляемойСтроки <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РасчетСНП = ВыборкаДетальныеЗаписи.РасчетСНПКор.ПолучитьОбъект();
		РасчетСНП.ГУИДСтрокиДохода = ВыборкаДетальныеЗаписи.ГУИДСтрокиДохода;
		Если РасчетСНП.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		РасчетСНП.Записать(РежимЗаписи);
	КонецЦикла;	
	
КонецПроцедуры	
// Евросиб Рыбьяков К.А. 12.07.2024 ))

БыстраяЗапись_ПереносРасходов = Ложь;
//Евросиб - АСуслов 08.12.2022 18:39:47 #51968
//(
НеЗаполнятьРасходы = Ложь;
//)
//Евросиб - АСуслов 08.12.2022 18:39:49 #51968
