Процедура ОбработатьЗаписьСделки(СделкаОбъект) Экспорт
	
	ТекП = Пользователи.ТекущийПользователь();
	ТекДата = ТекущаяДата();
	
	СсылкаБылаПустой = НЕ ЗначениеЗаполнено(СделкаОбъект.Ссылка);
	Если СсылкаБылаПустой Тогда
		//НовыйГУИД = Строка(Новый УникальныйИдентификатор());
		НовыйГУИД = Новый УникальныйИдентификатор();
		НовСсылка = Документы.Сделка.ПолучитьСсылку(НовыйГУИД);
		СделкаОбъект.УстановитьСсылкуНового(НовСсылка);
	Иначе
		НовСсылка = СделкаОбъект.Ссылка;
	КонецЕсли;
	
	Для каждого Стр из СделкаОбъект.СвязьУчетныхЕдиниц Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Контейнер) Тогда Продолжить; КонецЕсли;
		
		СтрокаПредыдущейВерсии = СделкаОбъект.Ссылка.СвязьУчетныхЕдиниц.Найти(Стр.Контейнер, "Контейнер");
		
		// 1. Добавление КТК в состав поезда
		Если СсылкаБылаПустой ИЛИ СтрокаПредыдущейВерсии = неопределено Тогда
			ЗаписатьСобытиеКТК(ТекДата, Стр.Контейнер, неопределено, ТекП, "Добавление КТК в сделку", НовСсылка, НовСсылка, Ложь);
		КонецЕсли;
		
		// 2. Подбор груженой накладной
		Если ЗначениеЗаполнено(Стр.ЖДН) И (СсылкаБылаПустой ИЛИ СтрокаПредыдущейВерсии = неопределено ИЛИ НЕ ЗначениеЗаполнено(СтрокаПредыдущейВерсии.ЖДН)) Тогда
			ЗаписатьСобытиеКТК(ТекДата, Стр.Контейнер, неопределено, ТекП, "Подбор ЖДН", Стр.ЖДН, НовСсылка, Ложь);
		КонецЕсли;
		
		// 3. Готово к выставлению
		Если Стр.ГотовоКВыставлению = Истина И (СсылкаБылаПустой ИЛИ СтрокаПредыдущейВерсии = неопределено ИЛИ СтрокаПредыдущейВерсии.ГотовоКВыставлению = Ложь) Тогда
			ЗаписатьСобытиеКТК(ТекДата, Стр.Контейнер, неопределено, ТекП, "Готово к выставлению", НовСсылка, НовСсылка, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Стр из СделкаОбъект.Доходы Цикл
		
		Если Стр.НеВыставлятьКлиенту = Истина Тогда Продолжить; КонецЕсли;
		
		СтрокаПредыдущейВерсии = СделкаОбъект.Ссылка.Доходы.Найти(Стр.ГУИД, "ГУИД");
		
		// 3. Готово к выставлению
		Если Стр.ГотовоКВыставлению = Истина И (СсылкаБылаПустой ИЛИ СтрокаПредыдущейВерсии = неопределено ИЛИ СтрокаПредыдущейВерсии.ГотовоКВыставлению = Ложь) Тогда
			
			СтрДоходыКТК = СделкаОбъект.ДоходыКТК.Найти(Стр.ГУИД, "ГУИД");
			Если СтрДоходыКТК <> неопределено Тогда
				МассивКТК = СтрРазделить(СтрДоходыКТК.КТК, ";", Ложь);
				Для каждого КТК из МассивКТК Цикл
					
					НайдКТК = РаботаСКонтейнерамиСервер.НайтиКТК(КТК, Ложь);
					ЗаписатьСобытиеКТК(ТекДата, НайдКТК, Стр.Услуга, ТекП, "Готово к выставлению (доп услуга " + Стр.ГУИД + ")", НовСсылка, НовСсылка, Ложь);
					
				КонецЦикла;
			КонецЕсли;

		КонецЕсли;
		
		// 4. Выставление реализации
		Если ЗначениеЗаполнено(Стр.УчДокумент) И (СсылкаБылаПустой ИЛИ СтрокаПредыдущейВерсии = неопределено ИЛИ НЕ ЗначениеЗаполнено(СтрокаПредыдущейВерсии.УчДокумент)) Тогда
			
			СтрДоходыКТК = СделкаОбъект.ДоходыКТК.Найти(Стр.ГУИД, "ГУИД");
			Если СтрДоходыКТК <> неопределено Тогда
				МассивКТК = СтрРазделить(СтрДоходыКТК.КТК, ";", Ложь);
				Для каждого КТК из МассивКТК Цикл
					
					НайдКТК = РаботаСКонтейнерамиСервер.НайтиКТК(КТК, Ложь);
					ЗаписатьСобытиеКТК(ТекДата, НайдКТК, Стр.Услуга, ТекП, "Реализация (услуга " + Стр.ГУИД + ")", Стр.УчДокумент, НовСсылка, Ложь);
					
				КонецЦикла;
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;

	
	
	
КонецПроцедуры

Процедура ОбработатьЗаписьСчетаПокупателю(СчетОбъект) Экспорт
	
	ТекП = СчетОбъект.Автор;
	
	//СписокСделок = Новый Массив;
	//Если ЗначениеЗаполнено(СчетОбъект.Сделка) Тогда
	//	СписокСделок.Добавить(СчетОбъект.Сделка);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СчетОбъект.ДокументОснование) И СписокСделок.Найти(СчетОбъект.ДокументОснование) = неопределено Тогда
	//	СписокСделок.Добавить(СчетОбъект.ДокументОснование);
	//КонецЕсли;
	//Для каждого Стр из СчетОбъект.ДокументыОснования Цикл
	//	Если ЗначениеЗаполнено(Стр.Сделка) И СписокСделок.Найти(Стр.Сделка) = неопределено Тогда
	//		СписокСделок.Добавить(Стр.Сделка);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Стр.Документ) И СписокСделок.Найти(Стр.Документ) = неопределено Тогда
	//		СписокСделок.Добавить(Стр.Документ);
	//	КонецЕсли;
	//КонецЦикла;
	СписокСделок = Новый Массив; 
	УстановитьПривилегированныйРежим(Истина);
	нз = РегистрыСведений.КлючевыеСобытияСделки.СоздатьНаборЗаписей();
	нз.Отбор.Документ.Установить(СчетОбъект.Ссылка);
	нз.Записать();                           
	УстановитьПривилегированныйРежим(Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСделок, СчетОбъект.ДокументыОснования.ВыгрузитьКолонку("Сделка"), Истина);	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСделок, СчетОбъект.ДокументыОснования.ВыгрузитьКолонку("Документ"), Истина);
	
	Для каждого СтрокаУЕ Из СчетОбъект.УчетныеЕдиницы Цикл
		Для каждого ЗначениеСделка Из СписокСделок Цикл 
			СтрТовар = СчетОбъект.Товары.Найти(СтрокаУЕ.ИдентификаторСтрокиУслуг);
			ЗаписатьСобытиеКТК(СчетОбъект.Создано, СтрокаУЕ.УчетнаяЕдиница, СтрТовар.Номенклатура, ТекП, "Создание счета", СчетОбъект.Ссылка, ЗначениеСделка, СчетОбъект.ПометкаУдаления);
		КонецЦикла;
	КонецЦикла;
	//Евросиб - АСуслов 25.01.2023 13:11:12 #59259
	//(
	Для каждого СтрокаДокументОснования Из СчетОбъект.ДокументыОснования Цикл
		ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(СтрокаДокументОснования.Сделка, СчетОбъект.Ссылка);
	КонецЦикла;
	//)
	//Евросиб - АСуслов 25.01.2023 13:11:14 #59259
	//Для каждого Стр из СчетОбъект.Товары Цикл
	//	
	//	//РазборСтрока = Стр.Содержание;
	//	//РазборСтрока = СтрЗаменить(РазборСтрока, " ", ";");
	//	//РазборСтрока = СтрЗаменить(РазборСтрока, Символы.ПС, ";");
	//	//РазборСтрока = СтрЗаменить(РазборСтрока, ":", ";");
	//	//РазборСтрока = СтрЗаменить(РазборСтрока, ",", ";");
	//	//МассивОбъектов = СтрРазделить(РазборСтрока, ";", Ложь);
	//	МассивОбъектов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Стр.Содержание);
	//	ХотьОдинКТКНашли = Ложь;
	//	Для каждого МО из МассивОбъектов Цикл
	//		Если СтрДлина(МО) = 11 Тогда
	//				НайдКТК = РаботаСКонтейнерамиСервер.НайтиКТК(МО, Ложь);
	//				Если ЗначениеЗаполнено(НайдКТК) Тогда
	//					ХотьОдинКТКНашли = Истина; 
	//					Для каждого ЗначениеСделка Из СписокСделок Цикл
	//						ЗаписатьСобытиеКТК(СчетОбъект.Создано, НайдКТК, Стр.Номенклатура, ТекП, "Создание счета", СчетОбъект.Ссылка, ЗначениеСделка, СчетОбъект.ПометкаУдаления);
	//					КонецЦикла;
	//				КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	// SIV 26.02.2021 Добавленная сюжетная ветка: если в счете нет ни одного КТК, то мы предполагаем, что мы закрываем 
	//	//Если ХотьОдинКТКНашли = Ложь Тогда
	//	//	
	//	//	МассивОбъектов = неопределено;
	//	//	Сделка = неопределено;
	//	//	СписокСделок = СчетОбъект.ДокументыОснования.ВыгрузитьКолонку("Сделка");
	//	//	Для каждого ЗначениеСделка Из СписокСделок Цикл
	//	//		Если ЗначениеЗаполнено(ЗначениеСделка) И Стр.Количество = СчетОбъект.Сделка.СвязьУчетныхЕдиниц.Количество()  Тогда
	//	//			
	//	//			МассивОбъектов = СчетОбъект.Сделка.СвязьУчетныхЕдиниц.Выгрузить().ВыгрузитьКолонку("Контейнер");
	//	//			Сделка = СчетОбъект.Сделка;
	//	//			
	//	//		ИначеЕсли ЗначениеЗаполнено(СчетОбъект.ДокументОснование) И ТипЗнч(СчетОбъект.ДокументОснование) = Тип("ДокументСсылка.Заявка") и Стр.Количество = СчетОбъект.ДокументОснование.СоставУслуги.Количество() Тогда
	//	//			
	//	//			МассивОбъектов = СчетОбъект.ДокументОснование.СоставУслуги.Выгрузить().ВыгрузитьКолонку("НомерКТК");
	//	//			Сделка = СчетОбъект.ДокументОснование;
	//	//			
	//	//		КонецЕсли;
	//	//		
	//	//		Если МассивОбъектов <> неопределено Тогда
	//	//			
	//	//			Для каждого СтрК из МассивОбъектов Цикл
	//	//				Если ЗначениеЗаполнено(СтрК) Тогда
	//	//					ЗаписатьСобытиеКТК(СчетОбъект.Создано, СтрК, Стр.Номенклатура, ТекП, "Создание счета", СчетОбъект.Ссылка, Сделка, СчетОбъект.ПометкаУдаления);
	//	//				КонецЕсли;
	//	//			КонецЦикла;
	//	//			
	//	//		КонецЕсли;
	//	//	КонецЦикла;
	//	//	
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьСобытиеКТК(ДатаЪ, КТК, Услуга, Специалист, Событие, Документ, Сделка, Удалить)
	
	УстановитьПривилегированныйРежим(Истина);
	МЗ = РегистрыСведений.КлючевыеСобытияСделки.СоздатьМенеджерЗаписи();
	МЗ.ДатаЪ = ДатаЪ;
	МЗ.Документ = Документ;
	МЗ.КТК = КТК;
	МЗ.Событие = Событие;
	МЗ.Специалист = Специалист;
	МЗ.Услуга = Услуга;
	МЗ.Сделка = Сделка;
	Попытка
		Если Удалить Тогда
			МЗ.Удалить();
		Иначе
			МЗ.Записать(Истина);
		КонецЕсли;
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Ошибка записи контрольной точки сделки. Сообщите в техподдержку. Описание: " + ОО);
		ЗаписьЖурналаРегистрации("Ошибка записи контрольной точки", УровеньЖурналаРегистрации.Ошибка,,,ОО);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, закомментировано, функция переделана
//Функция ПолучитьСчетаДляКТК(СписокКТК, Сделка, УслугаФрахта) Экспорт
//	
//	Результат = Новый Соответствие;
//	
//	//Евросиб - АСуслов 26.01.2023 13:06:28 #59259
//	//(
//	Запрос = Новый Запрос;
//	//Запрос.Текст = "ВЫБРАТЬ
//	//               |	КлючевыеСобытияСделки.КТК КАК КТК,
//	//               |	КлючевыеСобытияСделки.Услуга КАК Услуга,
//	//               |	КлючевыеСобытияСделки.Документ КАК Документ
//	//               |ИЗ
//	//               |	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
//	//               |ГДЕ
//	//               |	КлючевыеСобытияСделки.Сделка В(&Сделка)
//	//               |	И КлючевыеСобытияСделки.Документ В
//	//               |			(ВЫБРАТЬ
//	//               |				т.СчетПокупателю КАК СчетПокупателю
//	//               |			ИЗ
//	//               |				РегистрНакопления.СчетаПокупателей.Остатки КАК т)
//	//               |	И КлючевыеСобытияСделки.КТК В(&КТК)
//	//               |	И КлючевыеСобытияСделки.Событие = &Событие"; 
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	т.СчетПокупателю КАК СчетПокупателю
//	|ПОМЕСТИТЬ ВТ_СчетаСОстатками
//	|ИЗ
//	|	РегистрНакопления.СчетаПокупателей.Остатки КАК т
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КлючевыеСобытияСделки.КТК КАК КТК,
//	|	КлючевыеСобытияСделки.Услуга КАК Услуга,
//	|	КлючевыеСобытияСделки.Документ КАК Документ
//	|ИЗ
//	|	РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
//	|ГДЕ
//	|	КлючевыеСобытияСделки.Сделка В(&Сделка)
//	|	И КлючевыеСобытияСделки.Документ В
//	|			(ВЫБРАТЬ
//	|				т.СчетПокупателю
//	|			ИЗ
//	|				ВТ_СчетаСОстатками КАК т)
//	|	И КлючевыеСобытияСделки.КТК В(&КТК)
//	|	И КлючевыеСобытияСделки.Событие = &Событие"; 
//	//)
//	//Евросиб - АСуслов 26.01.2023 13:06:36 #59259
//	
//	Запрос.УстановитьПараметр("КТК", СписокКТК);
//	Запрос.УстановитьПараметр("Сделка", Сделка);
//	Запрос.УстановитьПараметр("Событие", "Создание счета");
//	Ответ = Запрос.Выполнить().Выбрать();
//	Пока Ответ.Следующий() Цикл
//		
//		НайдСтрокаКлюча = неопределено;
//		Для каждого Стр из Результат Цикл
//			Если Стр.Ключ = Ответ.КТК Тогда
//				НайдСтрокаКлюча = Стр;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//		Если НайдСтрокаКлюча = неопределено Тогда
//			Результат.Вставить(Ответ.КТК, Новый Структура("СчетЖД, СчетФрахт"));
//		КонецЕсли;
//    
//		Результат[Ответ.КТК][?(Ответ.Услуга = УслугаФрахта, "СчетФрахт", "СчетЖД")] = Ответ.Документ;
//  	КонецЦикла;
//	
//	Возврат Результат; 
//КонецФункции

//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, начало
Функция ПолучитьСчетаДляКТК(Сделка, УслугаФрахта) Экспорт
		
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ ВТ_СчетаСОстатками
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеСобытияСделки.КТК КАК КТК,
	|	КлючевыеСобытияСделки.Услуга КАК Услуга,
	|	КлючевыеСобытияСделки.Документ КАК Документ,
	|	КлючевыеСобытияСделки.Сделка КАК СвязанныйДокумент,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ВТ_СвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка КАК Заявка
	|ПОМЕСТИТЬ ВТ_КлючевыеСобытияСделки
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеСобытияСделки КАК КлючевыеСобытияСделки
	|		ПО (КлючевыеСобытияСделки.Сделка = ВТ_СвязьУчетныхЕдиниц.Заявка)
	|			И (КлючевыеСобытияСделки.КТК = ВТ_СвязьУчетныхЕдиниц.Контейнер)
	|ГДЕ
	|	КлючевыеСобытияСделки.Документ В
	|			(ВЫБРАТЬ
	|				т.СчетПокупателю
	|			ИЗ
	|				ВТ_СчетаСОстатками КАК т)
	|	И КлючевыеСобытияСделки.Событие = &Событие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК СчетНаОплату,
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	|	СчетНаОплатуПокупателюДокументыОснования.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ВТ_ДокументыОснованияСчетовНаОплату
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_КлючевыеСобытияСделки.Документ
	|			ИЗ
	|				ВТ_КлючевыеСобытияСделки КАК ВТ_КлючевыеСобытияСделки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючевыеСобытияСделки.КТК КАК КТК,
	|	ВТ_КлючевыеСобытияСделки.ГУИД КАК ГУИД,
	|	ВТ_КлючевыеСобытияСделки.Коносамент КАК Коносамент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_КлючевыеСобытияСделки.Услуга = &УслугаФрахта
	|				ТОГДА ВТ_КлючевыеСобытияСделки.Документ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|		КОНЕЦ) КАК СчетФрахт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_КлючевыеСобытияСделки.Услуга <> &УслугаФрахта
	|				ТОГДА ВТ_КлючевыеСобытияСделки.Документ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|		КОНЕЦ) КАК СчетЖД
	|ПОМЕСТИТЬ ВТ_СчетаСУчетомКоносаментов
	|ИЗ
	|	ВТ_КлючевыеСобытияСделки КАК ВТ_КлючевыеСобытияСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОснованияСчетовНаОплату КАК ВТ_ДокументыОснованияСчетовНаОплату
	|		ПО ВТ_КлючевыеСобытияСделки.Документ = ВТ_ДокументыОснованияСчетовНаОплату.СчетНаОплату
	|			И ВТ_КлючевыеСобытияСделки.Заявка = ВТ_ДокументыОснованияСчетовНаОплату.Документ
	|			И ВТ_КлючевыеСобытияСделки.Коносамент = ВТ_ДокументыОснованияСчетовНаОплату.Коносамент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КлючевыеСобытияСделки.КТК,
	|	ВТ_КлючевыеСобытияСделки.ГУИД,
	|	ВТ_КлючевыеСобытияСделки.Коносамент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаСУчетомКоносаментов.КТК КАК КТК,
	|	ВТ_СчетаСУчетомКоносаментов.ГУИД КАК ГУИД,
	|	ВТ_СчетаСУчетомКоносаментов.Коносамент КАК Коносамент,
	|	ВТ_СчетаСУчетомКоносаментов.СчетФрахт КАК СчетФрахт,
	|	ВТ_СчетаСУчетомКоносаментов.СчетЖД КАК СчетЖД
	|ИЗ
	|	ВТ_СчетаСУчетомКоносаментов КАК ВТ_СчетаСУчетомКоносаментов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КлючевыеСобытияСделки.КТК,
	|	ВТ_КлючевыеСобытияСделки.ГУИД,
	|	ВТ_КлючевыеСобытияСделки.Коносамент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_КлючевыеСобытияСделки.Услуга = &УслугаФрахта
	|				ТОГДА ВТ_КлючевыеСобытияСделки.Документ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_КлючевыеСобытияСделки.Услуга <> &УслугаФрахта
	|				ТОГДА ВТ_КлючевыеСобытияСделки.Документ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_КлючевыеСобытияСделки КАК ВТ_КлючевыеСобытияСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОснованияСчетовНаОплату КАК ВТ_ДокументыОснованияСчетовНаОплату
	|		ПО ВТ_КлючевыеСобытияСделки.Документ = ВТ_ДокументыОснованияСчетовНаОплату.СчетНаОплату
	|			И ВТ_КлючевыеСобытияСделки.Заявка = ВТ_ДокументыОснованияСчетовНаОплату.Документ
	|ГДЕ
	|	НЕ ВТ_КлючевыеСобытияСделки.ГУИД В
	|				(ВЫБРАТЬ
	|					ВТ_СчетаСУчетомКоносаментов.ГУИД
	|				ИЗ
	|					ВТ_СчетаСУчетомКоносаментов КАК ВТ_СчетаСУчетомКоносаментов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КлючевыеСобытияСделки.КТК,
	|	ВТ_КлючевыеСобытияСделки.ГУИД,
	|	ВТ_КлючевыеСобытияСделки.Коносамент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаСОстатками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КлючевыеСобытияСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДокументыОснованияСчетовНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаСУчетомКоносаментов";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Сделка.СвязьУчетныхЕдиниц", "&ТаблицаСвязьУчетныхЕдиниц");
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("Событие", "Создание счета");	
	Запрос.УстановитьПараметр("УслугаФрахта", УслугаФрахта);      
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, конец