
//Евросиб Коханенко Н.А. 25.11.2024 (( #96360 
&НаКлиенте
Процедура НеИспользоватьПриИзменении(Элемент)
	Если НеИспользовать Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНеИспользовать) Тогда
			Объект.ДатаНеИспользовать = ТекущаяДата();
		КонецЕсли;
	Иначе 
		Объект.ДатаНеИспользовать = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 25.11.2024 )) #96360

//Евросиб Коханенко Н.А. 25.11.2024 (( #96360
&НаКлиенте
Процедура ДатаНеИспользоватьПриИзменении(Элемент)
	УстановитьПризнакНеИспользовать();
КонецПроцедуры //Евросиб Коханенко Н.А. 25.11.2024 )) #96360

//Евросиб Коханенко Н.А. 25.11.2024 (( #96360
&НаСервере
Процедура УстановитьПризнакНеИспользовать()
	Если ЗначениеЗаполнено(Объект.ДатаНеИспользовать) Тогда
		ЭтаФорма.НеИспользовать = Истина;
	Иначе
		ЭтаФорма.НеИспользовать = Ложь;
	КонецЕсли;
КонецПроцедуры //Евросиб Коханенко Н.А. 25.11.2024 )) #96360

//Евросиб Коханенко Н.А. 25.11.2024 (( #96360
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПризнакНеИспользовать();
КонецПроцедуры //Евросиб Коханенко Н.А. 25.11.2024 )) #96360

