
//Евросиб Коханенко Н.А. 17.09.2024 (( #91409 
Функция ПолучитьДанныеПоСреднейМиле(XMLParams, Данные = Неопределено) Экспорт  
	
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217 Перенесено в ЕСОбменСервер Функция ПолучитьДанныеТранспортнойАналитики
	
	//Если Данные = Неопределено Тогда //данные через веб-сервис
	//	Чтение = Новый ЧтениеXML;
	//	Чтение.УстановитьСтроку(XMLParams);
	//
	//	Фабрика = Новый ФабрикаXDTO;
	//	ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
	//Иначе //данные через внешнюю обработку из файла
	//	ОбъектXDTO = Данные;
	//КонецЕсли;
	//
	//МассивВхДокументов = Новый Массив;
	//								                             
	//Если ТипЗнч(ОбъектXDTO.Шапка)= Тип("СписокXDTO") Тогда //в XML-файле несколько документов	
	//	Для каждого ДанныеДокумента из ОбъектXDTO.Шапка цикл
	//		МассивВхДокументов.Добавить(ДанныеДокумента);
	//	КонецЦикла;
	//ИначеЕсли ТипЗнч(ОбъектXDTO.Шапка)= ТИП("ОбъектXDTO") Тогда  //в XML-файле один документ   
	//	ДанныеДокумента = ОбъектXDTO.Шапка; 
	//	МассивВхДокументов.Добавить(ДанныеДокумента);
	//КонецЕсли;  
	//
	//МассивГУИДовДляОтвета = Новый Массив;
	//МассивДанных = Новый Массив;
	//
	////записываем в регистр ДанныеПакетовОбмена с использованием НабораЗаписей
	//ПериодОбмена = ТекущаяДата();
	//НаборЗаписей = РегистрыСведений.ДанныеПакетовОбмена.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.ПериодОбмена.Установить(ПериодОбмена);
	//Для Каждого Док Из МассивВхДокументов Цикл
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.ПериодОбмена = ПериодОбмена;
	//	Если Док.ГУИД_ДК = "" Тогда
	//		ИдентификаторСтрокиПакетаДанных = Строка(Новый УникальныйИдентификатор);
	//	Иначе
	//		ИдентификаторСтрокиПакетаДанных = Док.ГУИД_ДК;
	//	КонецЕсли;
	//    НоваяЗапись.ИдентификаторСтрокиПакетаДанных = ИдентификаторСтрокиПакетаДанных;
	//    НоваяЗапись.ВнешнийИдентификаторСтрокиПакетаДанных = Док.ID_DX;
	//	НоваяЗапись.ИсточникПакетаДанных = ПредопределенноеЗначение("Справочник.ИсточникиПакетовДанных.ПолучениеДанныхОСреднейМиле");
	//	НоваяЗапись.СтруктураДанных = Новый ХранилищеЗначения(ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Док), Новый СжатиеДанных(9));
	//	НоваяЗапись.ОбъектДанных = Неопределено;
	//	НоваяЗапись.Обработано = Ложь;
	//	НоваяЗапись.ДатаОбработки = Дата(1,1,1);
	//	НоваяЗапись.ЕстьОшибки = Ложь;
	//	НоваяЗапись.ОписаниеОшибки = "";
	//	МассивГУИДовДляОтвета.Добавить(Новый Структура("ID_DX, ГУИД_ДК", Док.ID_DX, ИдентификаторСтрокиПакетаДанных));
	//	МассивДанных.Добавить(Новый Структура("ПериодОбмена, ГУИД_ДК, СтруктураДанных", ПериодОбмена, ИдентификаторСтрокиПакетаДанных, НоваяЗапись.СтруктураДанных));
	//КонецЦикла; 
	//НаборЗаписей.Записать(); 
	//
	//Если Данные = Неопределено Тогда //формируем ответ для веб-сервиса
	//	Запись = Новый ЗаписьXML;
	//	Запись.УстановитьСтроку();
	//	Запись.ЗаписатьОбъявлениеXML();
	//	Запись.ЗаписатьНачалоЭлемента("Документ");
	//	Для Каждого ВхДанные Из МассивГУИДовДляОтвета Цикл
	//		Запись.ЗаписатьНачалоЭлемента("Шапка");
	//		Запись.ЗаписатьАтрибут("ID_DX", ВхДанные.ID_DX);
	//		Запись.ЗаписатьАтрибут("ГУИД_ДК", ВхДанные.ГУИД_ДК);
	//		Запись.ЗаписатьКонецЭлемента();
	//	КонецЦикла;
	//	Запись.ЗаписатьКонецЭлемента();
	//	ОтветXML = Запись.Закрыть();
	//	Результат = ОтветXML;
	//Иначе //возвращаем массив для внешней обработки для записи ответа в файл
	//	Результат =  МассивГУИДовДляОтвета;
	//КонецЕсли;
	//
	////Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
	////обрабатываем только по регламентному заданию
	////ОбработатьПолученныеДанныеВФоне(МассивДанных, ПериодОбмена);
	////Евросиб Коханенко Н.А. 13.02.2025 )) #102758
	//
	//Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 17.09.2024 )) #91409  

//Евросиб Коханенко Н.А. 28.10.2024 (( #91409 
Функция ОбработатьПолученныеДанныеВФоне(МассивДанных, ПериодОбмена=Неопределено)

	РезультатВыполнения = Неопределено;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обработка данных по Средней миле из DX'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	стПараметры = Новый Структура;
	стПараметры.Вставить("МассивДанных", МассивДанных);
	Если ПериодОбмена <> Неопределено Тогда
		стПараметры.Вставить("ПериодОбмена", ПериодОбмена);
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("ОбменДаннымиСредняяМиляСервер.ОбработатьПолученныеДанныеИзDX", стПараметры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции //Евросиб Коханенко Н.А. 28.10.2024 )) #91409 

//Евросиб Коханенко Н.А. 17.09.2024 (( #91409 
Процедура ОбработатьПолученныеДанныеИзDX(стПараметры, АдресВХранилище = Неопределено) Экспорт

	МассивДанных = стПараметры.МассивДанных;
	
	Если МассивДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//формируем ТЗ для запроса для поиска заявки
	тз_ВхДанных = Новый ТаблицаЗначений;
	тз_ВхДанных.Колонки.Добавить("ПериодОбмена", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ГУИД_ДК", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("НомерКТК", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
	тз_ВхДанных.Колонки.Добавить("ДатаГотовностиКТККВывозуИзПорта", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("РелизТерминалаPODДействуетДо", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("СухойТерминалОтправления", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("СухойТерминалОтправленияID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("НомерКоносамента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("КлиентСсылка", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тз_ВхДанных.Колонки.Добавить("МорскойРейс", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("НомерЗапросаКлиента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	//Евросиб Коханенко Н.А. 25.12.2024 (( #98939 автоподбор рейсов 
	тз_ВхДанных.Колонки.Добавить("МорскойРейсID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("ЖДРейс", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("ЖДРейсID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	//Евросиб Коханенко Н.А. 25.12.2024 )) #98939 автоподбор рейсов
	//Евросиб Коханенко Н.А. 16.05.2025 (( #108555 автоподбор рейса после перегруза
	тз_ВхДанных.Колонки.Добавить("ЖДРейсПерегруз", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("ЖДРейсПерегрузID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	//Евросиб Коханенко Н.А. 16.05.2025 )) #108555 
	//Евросиб Коханенко Н.А. 25.12.2024 (( #102955 
	тз_ВхДанных.Колонки.Добавить("ГрузНаименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("ГрузКодТНВЭД", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("ГрузСсылка", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//Евросиб Коханенко Н.А. 25.12.2024 )) #102955
	//Евросиб Шевченко А.В. 16.05.2025 US 94035 TA 104217
	тз_ВхДанных.Колонки.Добавить("ДатаВыдачиПорожнегоПодПогрузку", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ДатаЗавозаГруженогоВPOL", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ДатаВыгрузкиССудна", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ДатаПрибытияПоезда", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ДатаСдачиПорожнегоПослеЖд", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	//Евросиб Шевченко А.В. 16.05.2025 US 94035 TA 104217
			
	//Евросиб Коханенко Н.А. 25.12.2024 (( #98939 
	//соответствие номеров КТК и массива морских рейсов для заполнения заявки рейсами
	СоответствиеКТКиРейсов = Новый Соответствие;
	//Евросиб Коханенко Н.А. 25.12.2024 )) #98939 
	
	Для Каждого Док Из МассивДанных Цикл
		ДанныеДокумента = ИзвлечьДанныеИзДокумента(Док);
		СтруктураВхДанных = тз_ВхДанных.Добавить();
		Если ДанныеДокумента.Свойство("КлиентID")
				И ДанныеДокумента.КлиентID <> "" Тогда
			СтруктураВхДанных.КлиентСсылка = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ДанныеДокумента.КлиентID, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
																							Перечисления.УзлыОбмена.БитФинанс, Тип("СправочникСсылка.Контрагенты"));		
		КонецЕсли;	
		//Евросиб Коханенко Н.А. 25.12.2024 (( #98939 
		МассивРейсов = Новый Массив;
		//Евросиб Коханенко Н.А. 25.12.2024 )) #98939
		
		//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 ищем груз 
		Если ДанныеДокумента.Свойство("НаименованиеГруза")
				И ДанныеДокумента.НаименованиеГрузаID <> "" Тогда
			Груз = Справочники.Номенклатура.НайтиПоРеквизиту("КодТНВЭД", ДанныеДокумента.НаименованиеГрузаID);
			Если Груз = Неопределено Тогда
				Груз = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		Иначе
			Груз = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		СтруктураВхДанных.ГрузСсылка = Груз;
		//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
		
		ЗаполнитьЗначенияСвойств(СтруктураВхДанных, ДанныеДокумента);
		СтруктураВхДанных.ГУИД_ДК = Док.ГУИД_ДК;
		СтруктураВхДанных.ПериодОбмена = Док.ПериодОбмена;
		Если ДанныеДокумента.Свойство("МорскиеРейсы") 
				И ДанныеДокумента.МорскиеРейсыID <> "" Тогда
			Если ДанныеДокумента.МорскиеРейсы <> "" Тогда
				МорскойРейсСтрокой = СтрРазделить(ДанныеДокумента.МорскиеРейсы, ";", Ложь)[0];
			Иначе
				МорскойРейсСтрокой = "";
			КонецЕсли;
			СтруктураВхДанных.МорскойРейс = МорскойРейсСтрокой;
			//приводим к формату IDрейса в справочнике РейсыМоре, если рейс состоит из 2х плеч
			IDРейсаСтрокой = СтрЗаменить(ДанныеДокумента.МорскиеРейсыID, "(/Val)(Val)", "_"); 
			IDРейсаСтрокой = СтрЗаменить(IDРейсаСтрокой, "(Val)", "");
			IDРейсаСтрокой = СтрЗаменить(IDРейсаСтрокой, "(/Val)", "");
			СтруктураВхДанных.МорскойРейсID = IDРейсаСтрокой;
			МассивРейсов.Добавить(Новый Структура("Тип, Наименование, ID", "Морской", МорскойРейсСтрокой, IDРейсаСтрокой));
		КонецЕсли; 
		//Евросиб Коханенко Н.А. 25.12.2024 (( #98939 
		Если ДанныеДокумента.Свойство("ЖДРейс")
				И ДанныеДокумента.ЖДРейсID <> "" Тогда
			//Евросиб Коханенко Н.А. 24.04.2025 (( #107817 
			//МассивРейсов.Добавить(Новый Структура("Тип, Наименование, ID", "ЖД", ДанныеДокумента.ЖДРейс, Формат(Число(ДанныеДокумента.ЖДРейсID), "ЧЦ=9; ЧВН=; ЧГ=")));
			МассивРейсов.Добавить(Новый Структура("Тип, Наименование, ID", "ЖД", ДанныеДокумента.ЖДРейс, ДанныеДокумента.ЖДРейсID));
			//Евросиб Коханенко Н.А. 24.04.2025 )) #107817 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 16.05.2025 (( #108555 
		Если ДанныеДокумента.Свойство("ЖДРейсПерегруз")
				И ДанныеДокумента.ЖДРейсПерегрузID <> "" Тогда
			МассивРейсов.Добавить(Новый Структура("Тип, Наименование, ID", "ЖД", ДанныеДокумента.ЖДРейсПерегруз, ДанныеДокумента.ЖДРейсПерегрузID));
		КонецЕсли;
		//Евросиб Коханенко Н.А. 16.05.2025 )) #108555 
		Если МассивРейсов.Количество() > 0 Тогда
			// Евросиб US 122356 TA 124333 Рыбьяков К.А. 02.12.2025 ((
			СоответствиеКТКиРейсов.Вставить(ДанныеДокумента.ИдентификаторСтрокиПакетаДанных, МассивРейсов);	
			//СоответствиеКТКиРейсов.Вставить(ДанныеДокумента.НомерКТК, МассивРейсов);	
			// Евросиб Рыбьяков К.А. 02.12.2025 ))
		КонецЕсли;
		//Евросиб Коханенко Н.А. 25.12.2024 )) #98939 
	КонецЦикла;
	
	Запрос = Новый Запрос; 

//Евросиб Коханенко Н.А. 29.10.2025 (( #122613
#Область СтарыйЗапросВыбораЗаявки
	//Запрос.Текст = "//таблица значений необработанных данных из регистра обмена, либо данных, пришедших из DX 
	//               |ВЫБРАТЬ
	//               |	тз_ВхДанных.ПериодОбмена КАК ПериодОбмена,
	//               |	тз_ВхДанных.ГУИД_ДК КАК ГУИД_ДК,
	//               |	тз_ВхДанных.НомерКТК КАК НомерКТК,
	//               |	тз_ВхДанных.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	//               |	тз_ВхДанных.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	//               |	тз_ВхДанных.СухойТерминалОтправления КАК СухойТерминалОтправления,
	//               |	тз_ВхДанных.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID,
	//               |	тз_ВхДанных.НомерКоносамента КАК НомерКоносамента,
	//               |	тз_ВхДанных.КлиентСсылка КАК КлиентСсылка,
	//               |	тз_ВхДанных.МорскойРейс КАК МорскойРейс,
	//               |	тз_ВхДанных.МорскойРейсID КАК МорскойРейсID,
	//		       //Евросиб Коханенко Н.А. 25.12.2024 (( #102955 
	//               |	тз_ВхДанных.ГрузСсылка КАК ГрузСсылка,
	//		       //Евросиб Коханенко Н.А. 25.12.2024 )) #102955 
	//               |	тз_ВхДанных.НомерЗапросаКлиента КАК НомерЗапросаКлиента,
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//			   |	тз_ВхДанных.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
	//               |	тз_ВхДанных.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
	//               |	тз_ВхДанных.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
	//               |	тз_ВхДанных.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
	//               |	тз_ВхДанных.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//               |ПОМЕСТИТЬ вт_ВхДанные
	//               |ИЗ
	//               |	&тз_ВхДанных КАК тз_ВхДанных
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |//добавляем к входных данным ссылки на КТК, Контрагента и на Морские рейсы
	//			   |ВЫБРАТЬ
	//			   |	вт_ВхДанные.ПериодОбмена КАК ПериодОбмена,
	//			   |	вт_ВхДанные.ГУИД_ДК КАК ГУИД_ДК,
	//			   |	вт_ВхДанные.НомерКТК КАК НомерКТК,
	//			   |	вт_ВхДанные.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	//			   |	вт_ВхДанные.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	//			   |	вт_ВхДанные.СухойТерминалОтправления КАК СухойТерминалОтправления,
	//			   |	вт_ВхДанные.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID,
	//			   |	вт_ВхДанные.НомерКоносамента КАК НомерКоносамента,
	//			   |	вт_ВхДанные.КлиентСсылка КАК КлиентСсылка,
	//			   |	вт_ВхДанные.МорскойРейс КАК МорскойРейс,
	//			   |	вт_ВхДанные.МорскойРейсID КАК МорскойРейсID,
	//		       //Евросиб Коханенко Н.А. 25.12.2024 (( #102955 
	//               |	вт_ВхДанные.ГрузСсылка КАК ГрузСсылка,
	//		       //Евросиб Коханенко Н.А. 25.12.2024 )) #102955 
	//			   |	РейсыМоре.Ссылка КАК МорскойРейсСсылка,
	//			   |	вт_ВхДанные.НомерЗапросаКлиента КАК НомерЗапросаКлиента,
	//			   |	ТЕ.Ссылка КАК КТКСсылка,
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//			   |	вт_ВхДанные.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
	//               |	вт_ВхДанные.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
	//               |	вт_ВхДанные.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
	//               |	вт_ВхДанные.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
	//               |	вт_ВхДанные.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//			   |ПОМЕСТИТЬ вт_Документы
	//			   |ИЗ
	//			   |	вт_ВхДанные КАК вт_ВхДанные
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	//			   |		ПО вт_ВхДанные.НомерКТК = ТЕ.Наименование
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
	//			   |		ПО вт_ВхДанные.МорскойРейсID = РейсыМоре.IDРейса
	//			   |			И (НЕ РейсыМоре.ПометкаУдаления)
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |//низший приоритет, ищем заявки только по виду перевозок, совпадению номера КТК вх.данных и в услугах заявки				   
	//			   |ВЫБРАТЬ
	//			   |	5 КАК Приоритет,
	//			   |	вт_Документы.ГУИД_ДК КАК ГУИД_ДК,
	//			   |	вт_Документы.ПериодОбмена КАК ПериодОбмена,
	//			   |	Заявка.Ссылка КАК Заявка,
	//			   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	//			   |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	//			   |ПОМЕСТИТЬ вт_ЗаявкиСПриоритетами
	//			   |ИЗ
	//			   |	вт_Документы КАК вт_Документы
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	//			   |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	//			   |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 (( #98505 
	//			   |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 )) #98505 
	//			   |				И (Заявка.Проведен)
	//			   |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |//отбор проводится по всем вх.данным среди всех заявок
	//			   |//к условиям отбора по приоритету 5 добавляем условие, если номер коносамента во вх.данных есть,
	//			   |//то он должен совпадать с номером коносамента, указанного в строке заявки, коносамент должен быть проведен
	//			   |ВЫБРАТЬ
	//			   |	4,
	//			   |	вт_Документы.ГУИД_ДК,
	//			   |	вт_Документы.ПериодОбмена,
	//			   |	Заявка.Ссылка,
	//			   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	//			   |	ЗаявкаСоставУслуги.ГУИДСтроки
	//			   |ИЗ
	//			   |	вт_Документы КАК вт_Документы
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	//			   |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	//			   |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 (( #98505 
	//			   |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 )) #98505 
	//			   |				И (Заявка.Проведен)
	//			   |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	//			   |			И ((вт_Документы.НомерКоносамента <> """")
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.НомерТранспортногоДокумента = вт_Документы.НомерКоносамента)
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.Проведен)
	//			   //Евросиб Коханенко Н.А. 16.07.2025 (( #114719
	//			   |				ИЛИ (вт_Документы.НомерКоносамента = """"))
	//			   //Евросиб Коханенко Н.А. 16.07.2025 )) #114719 
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |//отбор проводится по всем вх.данным среди всех заявок
	//			   |//к условиям отбора по приоритету 4 добавляем условие, чтобы рейс из DX совпал с рейсом в заявке,
	//			   |//рейс в заявке должен быть морским и не должен быть помеченным на удаление
	//			   |ВЫБРАТЬ
	//			   |	3,
	//			   |	вт_Документы.ГУИД_ДК,
	//			   |	вт_Документы.ПериодОбмена,
	//			   |	Заявка.Ссылка,
	//			   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	//			   |	ЗаявкаСоставУслуги.ГУИДСтроки
	//			   |ИЗ
	//			   |	вт_Документы КАК вт_Документы
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	//			   |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	//			   |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 (( #98505 
	//			   |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 )) #98505 
	//			   |				И (Заявка.Проведен)
	//			   |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	//			   |			И ((вт_Документы.НомерКоносамента <> """")
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.НомерТранспортногоДокумента = вт_Документы.НомерКоносамента)
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.Проведен)
	//			   //Евросиб Коханенко Н.А. 16.07.2025 (( #114719
	//			   |				ИЛИ (вт_Документы.НомерКоносамента = """"))
	//			   //Евросиб Коханенко Н.А. 16.07.2025 )) #114719 
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//			   |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	//			   |			И вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	//			   |			И (НЕ ЗаявкаПереченьРейсов.Рейс.ПометкаУдаления)
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |//отбор проводится по всем вх.данным среди всех заявок
	//			   |//к условиям отбора по приоритету 3 добавляем условие, чтобы либо контрагент не был указан во вх.данных,
	//			   |//либо (если указан) совпадал с контрагентом в заявке
	//			   |ВЫБРАТЬ
	//			   |	2,
	//			   |	вт_Документы.ГУИД_ДК,
	//			   |	вт_Документы.ПериодОбмена,
	//			   |	Заявка.Ссылка,
	//			   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	//			   |	ЗаявкаСоставУслуги.ГУИДСтроки
	//			   |ИЗ
	//			   |	вт_Документы КАК вт_Документы
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	//			   |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	//			   |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 (( #98505 
	//			   |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 )) #98505 
	//			   |				И (Заявка.Проведен)
	//			   |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	//			   |			И ((вт_Документы.НомерКоносамента <> """")
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.НомерТранспортногоДокумента = вт_Документы.НомерКоносамента)
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.Проведен)
	//			   //Евросиб Коханенко Н.А. 16.07.2025 (( #114719
	//			   |				ИЛИ (вт_Документы.НомерКоносамента = """"))
	//			   //Евросиб Коханенко Н.А. 16.07.2025 )) #114719 
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//			   |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	//			   |			И вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	//			   |			И (НЕ ЗаявкаПереченьРейсов.Рейс.ПометкаУдаления)
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	//			   |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	//			   |			И (вт_Документы.КлиентСсылка ЕСТЬ NULL
	//			   |				ИЛИ ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка)
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |//отбор проводится по всем вх.данным среди всех заявок
	//			   |//наивысший приоритет, к условиям отбора по приоритету 2 добавляем условие, чтобы либо Номер запроса клиента
	//			   |//не был указан во вх.данных, либо (если указан) совпадал с внешним номером заявки
	//			   |ВЫБРАТЬ
	//			   |	1,
	//			   |	вт_Документы.ГУИД_ДК,
	//			   |	вт_Документы.ПериодОбмена,
	//			   |	Заявка.Ссылка,
	//			   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	//			   |	ЗаявкаСоставУслуги.ГУИДСтроки
	//			   |ИЗ
	//			   |	вт_Документы КАК вт_Документы
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	//			   |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	//			   |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 (( #98505 
	//			   |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	//			   //Евросиб Коханенко Н.А. 14.02.2025 )) #98505 
	//			   |				И (Заявка.Проведен)
	//			   |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	//			   |			И ((вт_Документы.НомерКоносамента <> """")
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.НомерТранспортногоДокумента = вт_Документы.НомерКоносамента)
	//			   |				И (ЗаявкаСоставУслуги.Коносамент.Проведен)
	//			   //Евросиб Коханенко Н.А. 16.07.2025 (( #114719
	//			   |				ИЛИ (вт_Документы.НомерКоносамента = """"))
	//			   //Евросиб Коханенко Н.А. 16.07.2025 )) #114719 
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//			   |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	//			   |			И вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	//			   |			И (НЕ ЗаявкаПереченьРейсов.Рейс.ПометкаУдаления)
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	//			   |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	//			   |			И (вт_Документы.КлиентСсылка ЕСТЬ NULL
	//			   |				ИЛИ ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка)
	//			   |			И (вт_Документы.НомерЗапросаКлиента = """"
	//			   |				ИЛИ ДокЗаявка.ВнешнийНомер = вт_Документы.НомерЗапросаКлиента)
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |//из всех отобранных по 5ти приоритетам заявок отбираем только те, которые по одному приоритету нашлись однократно
	//			   |ВЫБРАТЬ
	//			   |	вт_ЗаявкиСПриоритетами.Приоритет КАК Приоритет,
	//			   |	вт_ЗаявкиСПриоритетами.ГУИД_ДК КАК ГУИД_ДК,
	//			   |	вт_ЗаявкиСПриоритетами.ПериодОбмена КАК ПериодОбмена
	//			   |ПОМЕСТИТЬ вт_ОдиночныеЗаявки
	//			   |ИЗ
	//			   |	вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	вт_ЗаявкиСПриоритетами.Приоритет,
	//			   |	вт_ЗаявкиСПриоритетами.ГУИД_ДК,
	//			   |	вт_ЗаявкиСПриоритетами.ПериодОбмена
	//			   |
	//			   |ИМЕЮЩИЕ
	//			   |	КОЛИЧЕСТВО(вт_ЗаявкиСПриоритетами.Приоритет) = 1
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |//к однократно найденным заявкам добавляем входные данные
	//			   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |	вт_ОдиночныеЗаявки.ГУИД_ДК КАК ГУИД_ДК,
	//			   |	вт_ОдиночныеЗаявки.ПериодОбмена КАК ПериодОбмена,
	//			   |	вт_ЗаявкиСПриоритетами.Заявка КАК Заявка,
	//			   |	вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	//			   |	вт_ЗаявкиСПриоритетами.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	//			   |	вт_Документы.НомерКТК КАК НомерКТК,
	//			   |	вт_Документы.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	//			   |	вт_Документы.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	//			   |	вт_Документы.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID
	//			   //Евросиб Коханенко Н.А. 18.02.2025 (( #98505  
	//			   //|	, ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ЗапросНаАвто, ЗНАЧЕНИЕ(Документ.ЗапросНаАвтоперевозку.ПустаяСсылка)) КАК СредняяМиля
	//			   |	, ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, ДАТАВРЕМЯ(1,1,1)) <> ДАТАВРЕМЯ(1,1,1) КАК ВДвижении
	//			   //Евросиб Коханенко Н.А. 18.02.2025 )) #98505 
	//		       //Евросиб Коханенко Н.А. 25.12.2024 (( #102955 
	//               |	, вт_Документы.ГрузСсылка КАК ГрузСсылка
	//		       //Евросиб Коханенко Н.А. 25.12.2024 )) #102955
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//			   |	,вт_Документы.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку
	//               |	,вт_Документы.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL
	//               |	,вт_Документы.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна
	//               |	,вт_Документы.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда
	//               |	,вт_Документы.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд
	//			   //Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	//			   |ИЗ
	//			   |	вт_ОдиночныеЗаявки КАК вт_ОдиночныеЗаявки
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	//			   |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_ЗаявкиСПриоритетами.ГУИД_ДК
	//			   |			И вт_ОдиночныеЗаявки.Приоритет = вт_ЗаявкиСПриоритетами.Приоритет
	//			   |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_ЗаявкиСПриоритетами.ПериодОбмена
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
	//			   |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_Документы.ГУИД_ДК
	//			   |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_Документы.ПериодОбмена
	//			   //Евросиб Коханенко Н.А. 18.02.2025 (( #98505 
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили 				   
	//			   |		ПО вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	//			   |			И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля)				   
	//			   //Евросиб Коханенко Н.А. 18.02.2025 )) #98505 
	//			   |";
#КонецОбласти

#Область ЗапросВыбораЗаявки
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз_ВхДанных.ПериодОбмена КАК ПериодОбмена,
	               |	тз_ВхДанных.ГУИД_ДК КАК ГУИД_ДК,
	               |	тз_ВхДанных.НомерКТК КАК НомерКТК,
	               |	тз_ВхДанных.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	               |	тз_ВхДанных.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	               |	тз_ВхДанных.СухойТерминалОтправления КАК СухойТерминалОтправления,
	               |	тз_ВхДанных.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID,
	               |	тз_ВхДанных.НомерКоносамента КАК НомерКоносамента,
	               |	тз_ВхДанных.КлиентСсылка КАК КлиентСсылка,
	               |	тз_ВхДанных.МорскойРейс КАК МорскойРейс,
	               |	тз_ВхДанных.МорскойРейсID КАК МорскойРейсID,
	               |	тз_ВхДанных.ГрузСсылка КАК ГрузСсылка,
	               |	тз_ВхДанных.НомерЗапросаКлиента КАК НомерЗапросаКлиента,
	               |	тз_ВхДанных.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
	               |	тз_ВхДанных.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
	               |	тз_ВхДанных.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
	               |	тз_ВхДанных.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
	               |	тз_ВхДанных.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд
	               |ПОМЕСТИТЬ вт_ВхДанные
	               |ИЗ
	               |	&тз_ВхДанных КАК тз_ВхДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//добавляем к входных данным ссылки на КТК, Контрагента и на Морские рейсы
	               |ВЫБРАТЬ
	               |	вт_ВхДанные.ПериодОбмена КАК ПериодОбмена,
	               |	вт_ВхДанные.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ВхДанные.НомерКТК КАК НомерКТК,
	               |	вт_ВхДанные.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	               |	вт_ВхДанные.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	               |	вт_ВхДанные.СухойТерминалОтправления КАК СухойТерминалОтправления,
	               |	вт_ВхДанные.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID,
	               |	вт_ВхДанные.НомерКоносамента КАК НомерКоносамента,
	               |	ЕСТЬNULL(ТД.Ссылка, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)) КАК КоносаментСсылка,
	               |	вт_ВхДанные.КлиентСсылка КАК КлиентСсылка,
	               |	вт_ВхДанные.МорскойРейс КАК МорскойРейс,
	               |	вт_ВхДанные.МорскойРейсID КАК МорскойРейсID,
	               |	вт_ВхДанные.ГрузСсылка КАК ГрузСсылка,
	               |	РейсыМоре.Ссылка КАК МорскойРейсСсылка,
	               |	вт_ВхДанные.НомерЗапросаКлиента КАК НомерЗапросаКлиента,
	               |	ТЕ.Ссылка КАК КТКСсылка,
	               |	вт_ВхДанные.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
	               |	вт_ВхДанные.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
	               |	вт_ВхДанные.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
	               |	вт_ВхДанные.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
	               |	вт_ВхДанные.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд
	               |ПОМЕСТИТЬ вт_Документы
	               |ИЗ
	               |	вт_ВхДанные КАК вт_ВхДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |		ПО вт_ВхДанные.НомерКТК = ТЕ.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТД
	               |		ПО вт_ВхДанные.НомерКоносамента = ТД.НомерТранспортногоДокумента
	               |			И (ТД.Проведен)
	               |			И (НЕ вт_ВхДанные.НомерКоносамента = """")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
	               |		ПО вт_ВхДанные.МорскойРейсID = РейсыМоре.IDРейса
	               |			И (НЕ РейсыМоре.ПометкаУдаления)
	               |			И (НЕ вт_ВхДанные.МорскойРейсID = """")
				   |;
	               |
	               //Евросиб Коханенко Н.А. 25.03.2026 (( #117279 
	               |////////////////////////////////////////////////////////////////////////////////
				   |//Ищем в Протоколе обменов самые ранние записи по УИДам пакетов				   
	               |ВЫБРАТЬ
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	МИНИМУМ(ПротоколОбменов.ДатаОбмена) КАК МинДатаОбмена	
	               |ПОМЕСТИТЬ вт_МинДатыОбмена
	               |ИЗ  
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
	               |		ПО ПротоколОбменов.УИДИсточника = вт_Документы.ГУИД_ДК  
	               |			И ПротоколОбменов.Объект ССЫЛКА Справочник.КлючиАналитикиПеревозки
	               |			И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX)
	               |СГРУППИРОВАТЬ ПО
	               |	УИДИсточника			
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//Добавили самый низший приоритет, в котором находится самая ранняя подобранная заявка по УИДу пакета в Протоколе обменов
	               |ВЫБРАТЬ
	               |	6 КАК Приоритет,
	               |	вт_Документы.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена КАК ПериодОбмена,
	               |	КлючиАналитикиПеревозки.Заявка КАК Заявка,
	               |	ПротоколОбменов.Объект КАК КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	               |ПОМЕСТИТЬ вт_ЗаявкиСПриоритетами
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |	    ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_МинДатыОбмена КАК вт_МинДатыОбмена
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |	               		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |	               		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |	               			И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |	               			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |	               			И (Заявка.Проведен)
	               |					ПО КлючиАналитикиПеревозки.Заявка = ЗаявкаСоставУслуги.Ссылка
	               |						И ЗаявкаСоставУслуги.НомерКТК = КлючиАналитикиПеревозки.Контейнер
	               |				ПО ПротоколОбменов.Объект = КлючиАналитикиПеревозки.Ссылка
	               |			ПО вт_МинДатыОбмена.УИДИсточника = ПротоколОбменов.УИДИсточника
	               |				И вт_МинДатыОбмена.МинДатаОбмена = ПротоколОбменов.ДатаОбмена
	               |		ПО вт_Документы.ГУИД_ДК = вт_МинДатыОбмена.УИДИсточника 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
					//Евросиб Коханенко Н.А. 25.03.2026 )) #117279 
				   |//ищем заявки только по виду перевозок, совпадению номера КТК вх.данных и в услугах заявки				   
	               |ВЫБРАТЬ
	               |	5 КАК Приоритет,
	               |	вт_Документы.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена КАК ПериодОбмена,
	               |	Заявка.Ссылка КАК Заявка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	               //Евросиб Коханенко Н.А. 25.03.2026 (( #117279 
				   //|ПОМЕСТИТЬ вт_ЗаявкиСПриоритетами
				   //Евросиб Коханенко Н.А. 25.03.2026 )) #117279 
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 5 добавляем условие, если номер коносамента во вх.данных есть,
				   |//то он должен совпадать с номером коносамента, указанного в строке заявки, коносамент должен быть проведен
	               |ВЫБРАТЬ
	               |	4,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 4 добавляем условие, чтобы рейс из DX совпал с рейсом в заявке,
				   |//рейс в заявке должен быть морским и не должен быть помеченным на удаление
	               |ВЫБРАТЬ
	               |	3,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	               |			И (вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 3 добавляем условие, чтобы либо контрагент не был указан во вх.данных,
				   |//либо (если указан) совпадал с контрагентом в заявке
	               |ВЫБРАТЬ
	               |	2,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	               |			И (вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	               |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	               |			И (ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка
	               |				ИЛИ вт_Документы.КлиентСсылка ЕСТЬ NULL)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//наивысший приоритет, к условиям отбора по приоритету 2 добавляем условие, чтобы либо Номер запроса клиента
				   |//не был указан во вх.данных, либо (если указан) совпадал с внешним номером заявки
	               |ВЫБРАТЬ
	               |	1,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка
	               |					И вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	               |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	               |			И (ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка
	               |				ИЛИ вт_Документы.КлиентСсылка ЕСТЬ NULL)
	               |			И (ДокЗаявка.ВнешнийНомер = вт_Документы.НомерЗапросаКлиента
	               |				ИЛИ вт_Документы.НомерЗапросаКлиента = """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//из всех отобранных по 5ти приоритетам заявок отбираем только те, которые по одному приоритету нашлись однократно
	               |ВЫБРАТЬ
	               |	вт_ЗаявкиСПриоритетами.Приоритет КАК Приоритет,
	               |	вт_ЗаявкиСПриоритетами.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ЗаявкиСПриоритетами.ПериодОбмена КАК ПериодОбмена
	               |ПОМЕСТИТЬ вт_ОдиночныеЗаявки
	               |ИЗ
	               |	вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ЗаявкиСПриоритетами.Приоритет,
	               |	вт_ЗаявкиСПриоритетами.ГУИД_ДК,
	               |	вт_ЗаявкиСПриоритетами.ПериодОбмена
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(вт_ЗаявкиСПриоритетами.Приоритет) = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//к однократно найденным заявкам добавляем входные данные
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	вт_ОдиночныеЗаявки.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ОдиночныеЗаявки.ПериодОбмена КАК ПериодОбмена,
	               |	вт_ЗаявкиСПриоритетами.Заявка КАК Заявка,
	               |	вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	вт_ЗаявкиСПриоритетами.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	               |	вт_Документы.НомерКТК КАК НомерКТК,
	               |	вт_Документы.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
	               |	вт_Документы.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
	               |	вт_Документы.СухойТерминалОтправленияID КАК СухойТерминалОтправленияID,
	               |	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1) КАК ВДвижении,
	               |	вт_Документы.ГрузСсылка КАК ГрузСсылка,
	               |	вт_Документы.ДатаВыдачиПорожнегоПодПогрузку КАК ДатаВыдачиПорожнегоПодПогрузку,
	               |	вт_Документы.ДатаЗавозаГруженогоВPOL КАК ДатаЗавозаГруженогоВPOL,
	               |	вт_Документы.ДатаВыгрузкиССудна КАК ДатаВыгрузкиССудна,
	               |	вт_Документы.ДатаПрибытияПоезда КАК ДатаПрибытияПоезда,
	               |	вт_Документы.ДатаСдачиПорожнегоПослеЖд КАК ДатаСдачиПорожнегоПослеЖд,
				   // Евросиб US 129258 TA 129292 Рыбьяков К.А. 29.01.2026 ((
				   |	РегистрПротоколОбменов.УИДИсточника КАК ГуидПротоколаОбмена
				   // Евросиб Рыбьяков К.А. 29.01.2026 ))
	               |ИЗ
	               |	вт_ОдиночныеЗаявки КАК вт_ОдиночныеЗаявки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	               |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_ЗаявкиСПриоритетами.ГУИД_ДК
	               |			И вт_ОдиночныеЗаявки.Приоритет = вт_ЗаявкиСПриоритетами.Приоритет
	               |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_ЗаявкиСПриоритетами.ПериодОбмена
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
	               |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_Документы.ГУИД_ДК
	               |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_Документы.ПериодОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО (вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка)
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля))
				   // Евросиб US 129258 TA 129292 Рыбьяков К.А. 29.01.2026 ((
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК РегистрПротоколОбменов
				   |		ПО вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки = РегистрПротоколОбменов.Объект
				   |			И РегистрПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX)
				   |ГДЕ
				   |	ВЫБОР
				   |		КОГДА РегистрПротоколОбменов.УИДИсточника <> """" 
				   |			И РегистрПротоколОбменов.УИДИсточника <> вт_ОдиночныеЗаявки.ГУИД_ДК
				   |			ТОГДА ЛОЖЬ
				   |		ИНАЧЕ ИСТИНА
				   |	КОНЕЦ";
				   // Евросиб Рыбьяков К.А. 29.01.2026 ))
	
#КонецОбласти
//Евросиб Коханенко Н.А. 29.10.2025 )) #122613

	//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
	СредняяМиляВключена = Константы.СредняяМиляВключена.Получить();
	СредняяМиляКоличествоОбрабатываемыхСтрок = Константы.СредняяМиляКоличествоОбрабатываемыхСтрок.Получить();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗЛИЧНЫЕ", "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ " + Формат(СредняяМиляКоличествоОбрабатываемыхСтрок,"ЧГ=0"));
	//Евросиб Коханенко Н.А. 13.02.2025 )) #102758 
	
	Запрос.УстановитьПараметр("тз_ВхДанных", тз_ВхДанных);  
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();  
	
	МассивРезультатовОбработки = Новый Массив; 
	
	
	Пока Выборка.Следующий() Цикл 
		
		СухойТерминалОтправленияСсылка = ПолучитьТерминалПоГУИДу(Выборка.СухойТерминалОтправленияID);	

		//Евросиб Коханенко Н.А. 09.01.2025 (( #98939 
		//стПараметры = Новый Структура("Заявка, КлючАналитикиПеревозки, ДатаГотовностиКТККВывозуИзПорта, РелизТерминалаPODДействуетДо, СухойТерминалОтправления",
		//				Выборка.Заявка, Выборка.КлючАналитикиПеревозки, Выборка.ДатаГотовностиКТККВывозуИзПорта, Выборка.РелизТерминалаPODДействуетДо, СухойТерминалОтправленияСсылка);
		//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
		//стПараметры = Новый Структура("Заявка, КлючАналитикиПеревозки, ДатаГотовностиКТККВывозуИзПорта, РелизТерминалаPODДействуетДо, СухойТерминалОтправления, Рейсы",
		//				Выборка.Заявка, Выборка.КлючАналитикиПеревозки, Выборка.ДатаГотовностиКТККВывозуИзПорта, Выборка.РелизТерминалаPODДействуетДо, СухойТерминалОтправленияСсылка, СоответствиеКТКиРейсов[Выборка.НомерКТК]);
		стПараметры = Новый Структура("Заявка, КлючАналитикиПеревозки, ДатаГотовностиКТККВывозуИзПорта, РелизТерминалаPODДействуетДо, СухойТерминалОтправления, Рейсы, Груз",
		// Евросиб US 122356 TA 124333 Рыбьяков К.А. 02.12.2025 ((
								Выборка.Заявка, Выборка.КлючАналитикиПеревозки, Выборка.ДатаГотовностиКТККВывозуИзПорта, Выборка.РелизТерминалаPODДействуетДо, СухойТерминалОтправленияСсылка, СоответствиеКТКиРейсов[Выборка.ГУИД_ДК], Выборка.ГрузСсылка);
								//Выборка.Заявка, Выборка.КлючАналитикиПеревозки, Выборка.ДатаГотовностиКТККВывозуИзПорта, Выборка.РелизТерминалаPODДействуетДо, СухойТерминалОтправленияСсылка, СоответствиеКТКиРейсов[Выборка.НомерКТК], Выборка.ГрузСсылка);
		// Евросиб Рыбьяков К.А. 02.12.2025 ))
		//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
		//Евросиб Коханенко Н.А. 09.01.2025 )) #98939 
		
		//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
		//стОтветОбновленияЗаявки = ОбновитьЗаявкуДатамиПоСреднейМиле(стПараметры);
		//Евросиб Коханенко Н.А. 18.02.2025 (( #98505 //перенос КТК из заявки в заявку, если КТК в движении, то не обновляем данные 
		//стОтветОбновленияЗаявки = ОбновитьЗаявкуДатамиПоСреднейМиле(стПараметры, СредняяМиляВключена);                           
		Если Выборка.ВДвижении Тогда
			стОтветОбновленияЗаявки = ОбновитьЗаявкуДатамиПоСреднейМиле(стПараметры, Ложь);
		Иначе
			стОтветОбновленияЗаявки = ОбновитьЗаявкуДатамиПоСреднейМиле(стПараметры, СредняяМиляВключена);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 18.02.2025 )) #98505 
		//Евросиб Коханенко Н.А. 13.02.2025 )) #102758 
													
		Если стОтветОбновленияЗаявки.ТребуемоеДействие <> Неопределено Тогда                            

			стПараметры.Вставить("ИндентификаторСтрокиУслуги", Выборка.ГУИДСтрокиЗаявки);
			стПараметры.Вставить("ТребуемоеДействие", стОтветОбновленияЗаявки.ТребуемоеДействие);
			//Евросиб Коханенко Н.А. 18.02.2025 (( #98505
			//стПараметры.Вставить("СредняяМиля", Выборка.СредняяМиля);
			//Евросиб Коханенко Н.А. 18.02.2025 )) #98505
			стОтветСозданияЗапроса = СоздатьЗапросПоСреднейМиле(стПараметры);
			
		КонецЕсли;  
		
		стРезультат = Новый Структура("ПериодОбмена, ГУИД_ДК, ОбъектДанных, Обработано, ДатаОбработки, ЕстьОшибки, ОписаниеОшибки",
								Выборка.ПериодОбмена, Выборка.ГУИД_ДК, Выборка.КлючАналитикиПеревозки, Ложь, ТекущаяДата(), Ложь,	"");
								
		//считаем строку обработанной, если заявка нашлась
		Если ЗначениеЗаполнено(Выборка.Заявка) 
		//Евросиб Коханенко Н.А. 13.02.2025 (( #102758
			И СредняяМиляВключена
		//Евросиб Коханенко Н.А. 13.02.2025 )) #102758
			Тогда
			стРезультат.Обработано = Истина;
		КонецЕсли;
		
		//склеим ошибки обновления заявки и создания/обновления запроса 
		МассивСтрокОтветов = Новый Массив;
		Если стОтветОбновленияЗаявки.ОписаниеОшибки <> "" Тогда 
			МассивСтрокОтветов.Добавить(стОтветОбновленияЗаявки.ОписаниеОшибки);
		КонецЕсли;
		Если стОтветСозданияЗапроса <> Неопределено
				И стОтветСозданияЗапроса.ОписаниеОшибки <> "" Тогда 
			МассивСтрокОтветов.Добавить(стОтветСозданияЗапроса.ОписаниеОшибки);
		КонецЕсли;
		Если МассивСтрокОтветов.Количество() > 0 Тогда
			стРезультат.ОписаниеОшибки = СтрСоединить(МассивСтрокОтветов, Символы.ПС);
            стРезультат.ЕстьОшибки = Истина;
		КонецЕсли;
		
		МассивРезультатовОбработки.Добавить(стРезультат);
		
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		стПараметры.Вставить("ДатаВыдачиПорожнегоПодПогрузку", Выборка.ДатаВыдачиПорожнегоПодПогрузку);
		стПараметры.Вставить("ДатаЗавозаГруженогоВPOL", Выборка.ДатаЗавозаГруженогоВPOL);
		стПараметры.Вставить("ДатаВыгрузкиССудна", Выборка.ДатаВыгрузкиССудна);
		стПараметры.Вставить("ДатаПрибытияПоезда", Выборка.ДатаПрибытияПоезда);
		стПараметры.Вставить("ДатаСдачиПорожнегоПослеЖд", Выборка.ДатаСдачиПорожнегоПослеЖд);
		
		ЗаполнитьДатыСНПВКлючеПеревозки(Выборка.КлючАналитикиПеревозки, стПараметры); 
		//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
		
	КонецЦикла;
	
	//обновим регистр, выставим признаки обработанных    
	Для Каждого стРезультат Из МассивРезультатовОбработки Цикл 
		МЗ = РегистрыСведений.ДанныеПакетовОбмена.СоздатьМенеджерЗаписи();
		МЗ.ПериодОбмена = стРезультат.ПериодОбмена;
		МЗ.ИдентификаторСтрокиПакетаДанных = стРезультат.ГУИД_ДК;
		МЗ.Прочитать();
		ЗаполнитьЗначенияСвойств(МЗ, стРезультат); 
	    МЗ.Записать();
		
		//Евросиб Коханенко Н.А. 24.12.2025 (( #124559 
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, стРезультат.ОбъектДанных);
		СтруктураДанных = Новый Структура("УИДИсточника", стРезультат.ГУИД_ДК);      
		ТекстСообщения = "Данные по средней миле по ключу аналитики %1  " + ?(стРезультат.Обработано, "", "не") + " обработаны" + ?(стРезультат.ЕстьОшибки, " с ошибками", " без ошибок"); 
		Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, ТекстСообщения);
		//Евросиб Коханенко Н.А. 24.12.2025 )) #124559 
	КонецЦикла;
	

КонецПроцедуры //Евросиб Коханенко Н.А. 17.09.2024 )) #91409

//Евросиб Коханенко Н.А. 28.10.2024 (( #91409
Функция ИзвлечьДанныеИзДокумента(ДокСтруктура) Экспорт

	ДокументXML = ДокСтруктура.СтруктураДанных.Получить();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДокументXML);
	Фабрика = Новый ФабрикаXDTO;
	ДанныеДокумента = Фабрика.ПрочитатьXML(Чтение);

	ГУИД_ДКXML = XMLЗначение(Тип("Строка"), ДанныеДокумента.ГУИД_ДК);

	СтруктураВхДанных = Новый Структура("ВнешнийИдентификаторСтрокиПакетаДанных, НомерКТК, ИдентификаторСтрокиПакетаДанных",
							XMLЗначение(Тип("Строка"), ДанныеДокумента.ID_DX),
							XMLЗначение(Тип("Строка"), ДанныеДокумента.НомерОбъекта), //номер контейнера
							ГУИД_ДКXML);
							
	Если ДанныеДокумента.Свойства().Получить("Реквизиты") <> Неопределено 
			И ТипЗнч(ДанныеДокумента.Реквизиты)= Тип("ОбъектXDTO") Тогда   
		Реквизиты = ДанныеДокумента.Реквизиты;
		
		Если ТипЗнч(Реквизиты.Реквизит) = Тип("СписокXDTO") Тогда
			Для Каждого СтрокаРеквизита Из Реквизиты.Реквизит Цикл
				//в случае с Сухим терминалом отправления может быть, что ID есть, а значения нет
				Если Не ЗначениеЗаполнено(СтрокаРеквизита.Значение)
						И Не СтрокаРеквизита.Реквизит = "Сухой терминал отправления" Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаРеквизита.Реквизит = "Дата готовности КТК к вывозу с порта" Тогда //РеквизитID="84"
					ДатаГотовностиКТККВывозуИзПортаXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(ДатаГотовностиКТККВывозуИзПортаXML) Тогда
						СтруктураВхДанных.Вставить("ДатаГотовностиКТККВывозуИзПорта", Дата(ДатаГотовностиКТККВывозуИзПортаXML + " 00:00:00"));
					КонецЕсли;
				ИначеЕсли СтрокаРеквизита.Реквизит = "Релиз терминала POD действует до" Тогда //РеквизитID="117"
					РелизТерминалаPODДействуетДоXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(РелизТерминалаPODДействуетДоXML) Тогда
						СтруктураВхДанных.Вставить("РелизТерминалаPODДействуетДо", Дата(РелизТерминалаPODДействуетДоXML + " 00:00:00"));
					КонецЕсли;
				ИначеЕсли СтрокаРеквизита.Реквизит = "Сухой терминал отправления" Тогда //РеквизитID="5" 
					СухойТерминалОтправленияXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(СухойТерминалОтправленияXML) Тогда
						СтруктураВхДанных.Вставить("СухойТерминалОтправления", СухойТерминалОтправленияXML);
					КонецЕсли; 
					СухойТерминалОтправленияIDXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.ЗначениеID));
					Если ЗначениеЗаполнено(СухойТерминалОтправленияIDXML) Тогда
						СтруктураВхДанных.Вставить("СухойТерминалОтправленияID", СухойТерминалОтправленияIDXML);
					КонецЕсли; 
				ИначеЕсли СтрокаРеквизита.Реквизит = "№ коносамента" Тогда //РеквизитID="11"
					НомерКоносаментаXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(НомерКоносаментаXML) Тогда
						ПозицияПробела = Найти(НомерКоносаментаXML, " ");
						НомерКоносаментаXML = СокрЛП(?(ПозицияПробела = 0, НомерКоносаментаXML, Лев(НомерКоносаментаXML, Найти(НомерКоносаментаXML, " ")-1)));
						СтруктураВхДанных.Вставить("НомерКоносамента", НомерКоносаментаXML); 	
					КонецЕсли;
				ИначеЕсли СтрокаРеквизита.Реквизит = "Клиент" Тогда //РеквизитID="23"
					КлиентXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(КлиентXML) Тогда
						СтруктураВхДанных.Вставить("Клиент", КлиентXML);
					КонецЕсли;
					КлиентIDXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.ЗначениеID));
					Если ЗначениеЗаполнено(КлиентIDXML) Тогда
						СтруктураВхДанных.Вставить("КлиентID", КлиентIDXML);
					КонецЕсли; 
				ИначеЕсли СтрокаРеквизита.Реквизит = "Морской рейс" Тогда //РеквизитID="78"
					МорскиеРейсыXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(МорскиеРейсыXML) Тогда
						СтруктураВхДанных.Вставить("МорскиеРейсы", МорскиеРейсыXML);
					КонецЕсли; 
					//Евросиб Коханенко Н.А. 25.12.2024 (( #98939 
					МорскиеРейсыIDXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.ЗначениеID));
					Если ЗначениеЗаполнено(МорскиеРейсыIDXML) Тогда
						СтруктураВхДанных.Вставить("МорскиеРейсыID", МорскиеРейсыIDXML);
					КонецЕсли; 
				ИначеЕсли СтрокаРеквизита.Реквизит = "Запрос (лот)" Тогда //РеквизитID="12"
					ЖДРейсXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(ЖДРейсXML) Тогда
						СтруктураВхДанных.Вставить("ЖДРейс", ЖДРейсXML);
					КонецЕсли; 
					ЖДРейсIDXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.ЗначениеID));
					Если ЗначениеЗаполнено(ЖДРейсIDXML) Тогда
						СтруктураВхДанных.Вставить("ЖДРейсID", ЖДРейсIDXML);
					КонецЕсли; 
					//Евросиб Коханенко Н.А. 25.12.2024 )) #98939
				//Евросиб Коханенко Н.А. 16.05.2025 (( #108555 
				ИначеЕсли СтрокаРеквизита.Реквизит = "Запрос (лот) после перегруза КТК (ПВ-ФИТ)" Тогда //РеквизитID="75"
					ЖДРейсПерегрузXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(ЖДРейсПерегрузXML) Тогда
						СтруктураВхДанных.Вставить("ЖДРейсПерегруз", ЖДРейсПерегрузXML);
					КонецЕсли; 
					ЖДРейсПерегрузIDXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.ЗначениеID));
					Если ЗначениеЗаполнено(ЖДРейсПерегрузIDXML) Тогда
						СтруктураВхДанных.Вставить("ЖДРейсПерегрузID", ЖДРейсПерегрузIDXML);
					КонецЕсли; 
				//Евросиб Коханенко Н.А. 16.05.2025 )) #108555 
				ИначеЕсли СтрокаРеквизита.Реквизит = "№ запроса клиента" Тогда //РеквизитID="21" 
					НомерЗапросаКлиентаXML = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаРеквизита.Значение));
					Если ЗначениеЗаполнено(НомерЗапросаКлиентаXML) Тогда
						СтруктураВхДанных.Вставить("НомерЗапросаКлиента", НомерЗапросаКлиентаXML);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;  
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	Если ДанныеДокумента.Свойства().Получить("Операции") <> Неопределено 
			И ТипЗнч(ДанныеДокумента.Реквизиты)= Тип("ОбъектXDTO") Тогда   
		Операции = ДанныеДокумента.Операции;
		
		Если ТипЗнч(Операции.Операция) = Тип("СписокXDTO") Тогда
			Для Каждого СтрокаОперации Из Операции.Операция Цикл
				Если СтрокаОперации.ОперацияID = "34" Тогда //Выдача порожнего КТК из депо/терминала под загрузку клиента
					ДатаВыдачиПорожнегоПодПогрузку = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаОперации.ФактКонец));
					Если ЗначениеЗаполнено(ДатаВыдачиПорожнегоПодПогрузку) Тогда
						СтруктураВхДанных.Вставить("ДатаВыдачиПорожнегоПодПогрузку", Дата(ДатаВыдачиПорожнегоПодПогрузку));
					КонецЕсли;
				КонецЕсли;
				Если СтрокаОперации.ОперацияID = "41" Тогда //Прием груженого КТК в порту отправки
					ДатаЗавозаГруженогоВPOL = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаОперации.ФактКонец));
					Если ЗначениеЗаполнено(ДатаЗавозаГруженогоВPOL) Тогда
						СтруктураВхДанных.Вставить("ДатаЗавозаГруженогоВPOL", Дата(ДатаЗавозаГруженогоВPOL));
					КонецЕсли;
				КонецЕсли;
				Если СтрокаОперации.ОперацияID = "8" Тогда //Выгрузка с судна
					ДатаВыгрузкиССудна = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаОперации.ФактКонец));
					Если ЗначениеЗаполнено(ДатаВыгрузкиССудна) Тогда
						СтруктураВхДанных.Вставить("ДатаВыгрузкиССудна", Дата(ДатаВыгрузкиССудна));
					КонецЕсли;
				КонецЕсли;
				Если СтрокаОперации.ОперацияID = "67" Тогда //Дата приб. поезда (факт)
					ДатаПрибытияПоезда = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаОперации.ФактКонец));
					Если ЗначениеЗаполнено(ДатаПрибытияПоезда) Тогда
						СтруктураВхДанных.Вставить("ДатаПрибытияПоезда", Дата(ДатаПрибытияПоезда));
					КонецЕсли;
				КонецЕсли;
				Если СтрокаОперации.ОперацияID = "11" Тогда //Дата сдачи порожнего после ж/д
					ДатаСдачиПорожнегоПослеЖд = СокрЛП(XMLЗначение(Тип("Строка"), СтрокаОперации.ФактКонец));
					Если ЗначениеЗаполнено(ДатаСдачиПорожнегоПослеЖд) Тогда
						СтруктураВхДанных.Вставить("ДатаСдачиПорожнегоПослеЖд", Дата(ДатаСдачиПорожнегоПослеЖд));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
	Возврат СтруктураВхДанных;

КонецФункции //Евросиб Коханенко Н.А. 28.10.2024 )) #91409 

//Евросиб Коханенко Н.А. 10.09.2024 (( #91409
//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
//Функция ОбновитьЗаявкуДатамиПоСреднейМиле(Параметры)
Функция ОбновитьЗаявкуДатамиПоСреднейМиле(Параметры, СредняяМиляВключена) 
//Евросиб Коханенко Н.А. 13.02.2025 )) #102758 

	Заявка = Параметры.Заявка;
	КлючАналитикиПеревозки = Параметры.КлючАналитикиПеревозки; 
	ДатаГотовностиКТККВывозуИзПорта = Параметры.ДатаГотовностиКТККВывозуИзПорта; 
	РелизТерминалаPODДействуетДо = Параметры.РелизТерминалаPODДействуетДо; 
	СухойТерминалОтправления = Параметры.СухойТерминалОтправления;
	//Евросиб Коханенко Н.А. 09.01.2025 (( #98939 
	Рейсы = Параметры.Рейсы;
	//Евросиб Коханенко Н.А. 09.01.2025 )) #98939 
	//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
	Груз = Параметры.Груз;
	//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
	Ответ = Новый Структура("ТребуемоеДействие, ОписаниеОшибки", Неопределено, "");
	ЗаявкаИзменена = Ложь;
	
	Если Заявка <> Неопределено Тогда
		ЗаявкаОбъект = Заявка.ПолучитьОбъект(); 
		СтрокаУслуг = ЗаявкаОбъект.СоставУслуги.Найти(КлючАналитикиПеревозки, "КлючАналитикиПеревозки"); 
		ТребуетсяСозданиеЗапроса = Ложь;
		ТребуетсяОтменаЗапроса = Ложь;
		Если СтрокаУслуг <> Неопределено Тогда
			
			//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
			Если СредняяМиляВключена Тогда
			//Евросиб Коханенко Н.А. 13.02.2025 )) #102758 
			
			ПерваяДатаЗаполнилась = Ложь;
			ПерваяДатаОбнулилась = Ложь;
			
			Если СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта <> ДатаГотовностиКТККВывозуИзПорта Тогда
				ПерваяДатаЗаполнилась = НЕ ЗначениеЗаполнено(СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта) И ЗначениеЗаполнено(ДатаГотовностиКТККВывозуИзПорта);
				ПерваяДатаОбнулилась = ЗначениеЗаполнено(СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта) И НЕ ЗначениеЗаполнено(ДатаГотовностиКТККВывозуИзПорта);
				СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта = ДатаГотовностиКТККВывозуИзПорта;
				ЗаявкаИзменена = Истина;
			КонецЕсли;

			ВтораяДатаЗаполнилась = Ложь;
			ВтораяДатаОбнулилась = Ложь; 
			
			Если СтрокаУслуг.РелизТерминалаPODДействуетДо <> РелизТерминалаPODДействуетДо Тогда
				ВтораяДатаЗаполнилась = НЕ ЗначениеЗаполнено(СтрокаУслуг.РелизТерминалаPODДействуетДо) И ЗначениеЗаполнено(РелизТерминалаPODДействуетДо);
				ВтораяДатаОбнулилась = ЗначениеЗаполнено(СтрокаУслуг.РелизТерминалаPODДействуетДо) И НЕ ЗначениеЗаполнено(РелизТерминалаPODДействуетДо); 
				СтрокаУслуг.РелизТерминалаPODДействуетДо = РелизТерминалаPODДействуетДо;	
				ЗаявкаИзменена = Истина;
			КонецЕсли;

			//обновляем СухойТерминалОтправления в строке ТЧ СоставУслуги
			Если СтрокаУслуг.СухойТерминалОтправления <> СухойТерминалОтправления Тогда 
				//Евросиб Коханенко Н.А. 07.07.2025 (( #113738 
				//СтрокаУслуг.СухойТерминалОтправления = СухойТерминалОтправления;	
				//ЗаявкаИзменена = Истина;
				Если НЕ ЗначениеЗаполнено(СтрокаУслуг.СухойТерминалОтправления) Тогда
					СтрокаУслуг.СухойТерминалОтправления = СухойТерминалОтправления;	
					ЗаявкаИзменена = Истина;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 07.07.2025 )) #113738 
			КонецЕсли;  
			
			//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
			КонецЕсли;
			//Евросиб Коханенко Н.А. 13.02.2025 )) #102758 
			
			//Евросиб Коханенко Н.А. 09.01.2025 (( #98939 
			Если Рейсы <> Неопределено
					И Рейсы.Количество() > 0 Тогда
				РейсыВЗаявкеИзменены = ОбновитьДанныеПоРейсамВЗаявке(ЗаявкаОбъект, Рейсы);
			Иначе
				РейсыВЗаявкеИзменены = Ложь;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 10.01.2025 )) #98939

			Попытка
				//Евросиб Коханенко Н.А. 09.01.2025 (( #98939 
				//Если ЗаявкаИзменена Тогда
				//	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Если ЗаявкаИзменена 
						ИЛИ РейсыВЗаявкеИзменены Тогда
					ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли; 
				
				Если ЗаявкаИзменена Тогда
				//Евросиб Коханенко Н.А. 10.01.2025 )) #98939
					Если ПерваяДатаЗаполнилась И ЗначениеЗаполнено(СтрокаУслуг.РелизТерминалаPODДействуетДо)
						ИЛИ ВтораяДатаЗаполнилась И ЗначениеЗаполнено(СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта) Тогда
							Ответ.ТребуемоеДействие = "Создание"; 			//создание запроса на авто
					ИначеЕсли ПерваяДатаОбнулилась ИЛИ ВтораяДатаОбнулилась Тогда
						Ответ.ТребуемоеДействие = "Отмена"; 				//отмена запроса на авто
					ИначеЕсли ЗначениеЗаполнено(СтрокаУслуг.ДатаГотовностиКТККВывозуИзПорта) 
						И ЗначениеЗаполнено(СтрокаУслуг.РелизТерминалаPODДействуетДо) Тогда
							Ответ.ТребуемоеДействие = "Обновление"; 		//обновление только запроса на авто
					КонецЕсли; 
				КонецЕсли; 
				
				//Евросиб Коханенко Н.А. 14.01.2025 (( #98939
				Если РейсыВЗаявкеИзменены Тогда
					СделкиОбновлены = ОбновитьДанныеПоРейсамВСделках(ЗаявкаОбъект.Ссылка, Рейсы);
				КонецЕсли;
				//Евросиб Коханенко Н.А. 14.01.2025 )) #98939
				
			Исключение 
				Ответ.ОписаниеОшибки = ОписаниеОшибки();
				Возврат Ответ; 
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ; 
	
КонецФункции //Евросиб Коханенко Н.А. 10.09.2024 )) #91409

Процедура ЗаполнитьДатыСНПВКлючеПеревозки(Ключ, Параметры) //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
	СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	СтруктураКлюча.КлючАналитики = Ключ;
	СтруктураКлюча.ДатаВыдачиПорожнегоПодПогрузку = Параметры.ДатаВыдачиПорожнегоПодПогрузку;
	СтруктураКлюча.ДатаЗавозаГруженогоВPOL = Параметры.ДатаЗавозаГруженогоВPOL;
	СтруктураКлюча.ДатаВыгрузкиССудна = Параметры.ДатаВыгрузкиССудна;
	СтруктураКлюча.ДатаПрибытияПоезда = Параметры.ДатаПрибытияПоезда;
	СтруктураКлюча.ДатаСдачиПорожнегоПослеЖд = Параметры.ДатаСдачиПорожнегоПослеЖд;
	СтруктураКлюча.ДатаТелексаДатаДТ = Параметры.ДатаГотовностиКТККВывозуИзПорта;
	Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
КонецПроцедуры	

//Евросиб Коханенко Н.А. 18.09.2024 (( #91409
//варианты значений параметра ТребуемоеДействие:
//							"Создание"	 - создание запроса на авто	
//                          "Отмена"     - отмена запроса на авто
//                          "Обновление" - обновление только запроса на авто
Функция СоздатьЗапросПоСреднейМиле(Параметры)
	
	Заявка = Параметры.Заявка;
	КлючАналитикиПеревозки = Параметры.КлючАналитикиПеревозки; 
	ДатаГотовностиКТККВывозуИзПорта = Параметры.ДатаГотовностиКТККВывозуИзПорта; 
	РелизТерминалаPODДействуетДо = Параметры.РелизТерминалаPODДействуетДо; 
	СухойТерминалОтправления = Параметры.СухойТерминалОтправления; 
    ИндентификаторСтрокиУслуги = Параметры.ИндентификаторСтрокиУслуги;
	ТребуемоеДействие = Параметры.ТребуемоеДействие;
	
	Ответ = Новый Структура("ОписаниеОшибки", "");
	
	//ищем самую раннюю дату прибытия морского рейса, и морской терминал назначения
	ДанныеМорскогоРейсаИзЗаявки = ПолучитьДанныеМорскогоРейсаИзЗаявки(Заявка);
	
	Если ТребуемоеДействие = "Создание" Тогда
		//ищем существующий запрос по заявке
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗапросНаАвтоперевозку.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
			|ГДЕ
			|	ЗапросНаАвтоперевозку.Заявка = &ЗаявкаСсылка
			|	И ЗапросНаАвтоперевозку.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля)
			|	И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления";
		Запрос.УстановитьПараметр("ЗаявкаСсылка", Заявка);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗапросСсылка = Выборка.Ссылка;
			ЗапросОбъект = ЗапросСсылка.ПолучитьОбъект();
		Иначе
			//создаем запрос на автоперевозку
			ЗапросОбъект = Документы.ЗапросНаАвтоперевозку.СоздатьДокумент();
			ЗапросСсылка = Документы.ЗапросНаАвтоперевозку.ПолучитьСсылку();
			ЗапросОбъект.УстановитьСсылкуНового(ЗапросСсылка);
			//заполняем поля шапки 
			ЗапросОбъект.Дата = ТекущаяДата();
			ЗапросОбъект.Заявка = Заявка;
			ЗапросОбъект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля;
			ДанныеЗаполненияПоЗаявке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заявка, "Контрагент, Договор, ЦФО, Организация, Подразделение, Автор");
			ЗаполнитьЗначенияСвойств(ЗапросОбъект, ДанныеЗаполненияПоЗаявке);
			ЗапросОбъект.ОриентировочнаяДатаМорскогоРейса = ДанныеМорскогоРейсаИзЗаявки.ОриентировочнаяДатаМорскогоРейса;
		КонецЕсли; 
	Иначе //обновление запроса на авто или отмена
		//ищем существующий запрос по ключу аналитики
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗапросНаАвтоперевозку.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
			|		ПО ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ЗапросНаАвтоперевозку.Ссылка
			|			И ЗапросНаАвтоперевозку.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля)
			|			И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = &КлючАналитикиПеревозки
			|			И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления
			|";
		Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗапросСсылка = Выборка.Ссылка;
		КонецЕсли; 
		Если ЗапросСсылка <> Неопределено Тогда
			ЗапросОбъект = ЗапросСсылка.ПолучитьОбъект(); 
		Иначе
			Возврат Ответ;
		КонецЕсли;
			
	КонецЕсли;

	//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
	//получаем ТерминалВыдачи и ВесГрузаНетто из Коносамента
	ДанныеИзКоносамента = ПолучитьДанныеИзКоносамента(Заявка, КлючАналитикиПеревозки);
	//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 

	//независимо от вида действия, ищем строку в запросе
	СтрокаТЧ = ЗапросОбъект.Контейнеры.Найти(КлючАналитикиПеревозки, "КлючАналитикиПеревозки");
	Если СтрокаТЧ = Неопределено Тогда
		//если строки не  нашлось
		Если ТребуемоеДействие = "Создание" Тогда
			СтрокаТЧ = ЗапросОбъект.Контейнеры.Добавить();
			СтрокаТЧ.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор();
			СтрокаТЧ.ИдентификаторСтрокиТабличнойЧасти = ЗапросОбъект.Контейнеры.Количество() - 1;
			СтрокаТЧ.ИдентификаторСтрокиУслуги = ИндентификаторСтрокиУслуги;
			
			СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен; 
			
			СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлюча.КлючАналитики = КлючАналитикиПеревозки;
			СтруктураКлюча.СтруктураТЧМилиСредняяМиляКлючаАналитики.ЗапросНаАвто = ЗапросСсылка;
			//Евросиб Коханенко Н.А. 20.02.2025 (( #102955 
			СтруктураКлюча.ВесГруза = ДанныеИзКоносамента.ВесГрузаНетто; 
			//Евросиб Коханенко Н.А. 20.02.2025 )) #102955
			//Евросиб Коханенко Н.А. 18.09.2025 (( #119413
			СтруктураКлюча.СтруктураТЧМилиСредняяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = СтрокаТЧ.ИдентификаторСтрокиТЧ;
			//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
			КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
			СтрокаТЧ.КлючАналитикиПеревозки = КлючАналитикиПеревозки.КлючАналитикиПеревозки;
		ИначеЕсли ТребуемоеДействие = "Отмена" Тогда
			//ошибка, строки нет, а нужно отменять
		КонецЕсли;
	Иначе
		//строка в запросе нашлась
		Если ТребуемоеДействие = "Создание" Тогда
			//такой случай может быть только если строка была отменена, а теперь обе даты появились
			СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен;
			//Евросиб Коханенко Н.А. 20.02.2025 (( #102955 
			СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлюча.КлючАналитики = КлючАналитикиПеревозки;
			СтруктураКлюча.ВесГруза = ДанныеИзКоносамента.ВесГрузаНетто; 
			КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
			//Евросиб Коханенко Н.А. 20.02.2025 )) #102955 
		ИначеЕсли ТребуемоеДействие = "Отмена" Тогда
			СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
		КонецЕсли;
	КонецЕсли;                                    

	//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
	//СтрокаТЧ.ТерминалВыдачи = ДанныеМорскогоРейсаИзЗаявки.МорскойТерминалВыдачи;
	СтрокаТЧ.ТерминалВыдачи = ДанныеИзКоносамента.ТерминалВыдачи;
	СтрокаТЧ.ВесГрузаНетто = ДанныеИзКоносамента.ВесГрузаНетто;
	//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
	
	СтрокаТЧ.ТипОперацииНаТерминалеВыдачи = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;
	СтрокаТЧ.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен;
	СтрокаТЧ.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
	СтрокаТЧ.НеТребуетсяАдрес = Истина;
	СтрокаТЧ.ДатаВремяПодачиКТК = ДанныеМорскогоРейсаИзЗаявки.ОриентировочнаяДатаМорскогоРейса;
	
	//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
	//ДанныеИзКлючаАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "КоличествоМест, ВесГруза, ИнструкцияПоСдаче, РелизКлиента");
	//ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеИзКлючаАналитики);  
	//Евросиб Коханенко Н.А. 23.04.2025 (( #108222 
	//ДанныеИзКлючаАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "КоличествоМест, ВесГруза, РелизКлиента");
	ДанныеИзКлючаАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "КоличествоМест, ВесГруза, РелизКлиента, Контейнер");
	Если ЗначениеЗаполнено(ДанныеИзКлючаАналитики.Контейнер) Тогда
		ТипоразмерКТК = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИзКлючаАналитики.Контейнер, "ТипТЕ");
		СтрокаТЧ.ТипКТК = ТипоразмерКТК.ТипТЕ;
	КонецЕсли;	
	//Евросиб Коханенко Н.А. 23.04.2025 )) #108222 
	СтрокаТЧ.КоличествоМест = ДанныеИзКлючаАналитики.КоличествоМест;
	СтрокаТЧ.ВесГрузаНетто = ДанныеИзКлючаАналитики.ВесГруза;
	//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
	СтрокаТЧ.Релиз = ДанныеИзКлючаАналитики.РелизКлиента; 

	Если СтрокаТЧ.ДатаГотовностиКТККВывозуИзПорта <> ДатаГотовностиКТККВывозуИзПорта Тогда 
		 СтрокаТЧ.ДатаГотовностиКТККВывозуИзПорта = ДатаГотовностиКТККВывозуИзПорта;
	КонецЕсли;
	Если СтрокаТЧ.РелизТерминалаPODДействуетДо <> РелизТерминалаPODДействуетДо Тогда 
		 СтрокаТЧ.РелизТерминалаPODДействуетДо = РелизТерминалаPODДействуетДо;
	КонецЕсли;
	Если СтрокаТЧ.ТерминалСдачи <> СухойТерминалОтправления Тогда
		//Евросиб Коханенко Н.А. 07.07.2025 (( #113738 
		//СтрокаТЧ.ТерминалСдачи = СухойТерминалОтправления;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТерминалСдачи) Тогда
			СтрокаТЧ.ТерминалСдачи = СухойТерминалОтправления;	
		КонецЕсли;
		//Евросиб Коханенко Н.А. 07.07.2025 )) #113738 
	КонецЕсли;
	
	СтрокаТЧ.ОбновленыИсходныеДанные = Ложь; //не надо ставить галку, меняется цвет строки 
	СтрокаТЧ.УчетноеНаправление = ПолучитьУчетноеНаправлениеИзЗаявки(Заявка, СтрокаТЧ.КлючАналитикиПеревозки);
	
	Попытка
		ЗапросОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//передаем в ТЛ 
		СтрокиКВыгрузке = Новый ТаблицаЗначений;  
		СтрокиКВыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
		СтрокиКВыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число",,,, Новый КвалификаторыЧисла(7, 0)));
		СтрокаКВыгрузке = СтрокиКВыгрузке.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаКВыгрузке, СтрокаТЧ);
		ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", ЗапросСсылка, СтрокиКВыгрузке);
		ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);
	Исключение 
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ответ; 
	КонецПопытки; 
	
	Возврат Ответ;

КонецФункции //Евросиб Коханенко Н.А. 17.09.2024 )) #91409

//Евросиб Коханенко Н.А. 19.12.2024 (( #91409
Функция ПолучитьТерминалПоГУИДу(СухойТерминалОтправленияID)
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(СухойТерминалОтправленияID) Тогда 
		ЛокацияСсылка = Справочники.Локации.ПолучитьСсылку(Новый УникальныйИдентификатор(СухойТерминалОтправленияID));
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Локации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Локации КАК Локации
			|ГДЕ
			|	Локации.Ссылка = &Ссылка
			|	И НЕ Локации.ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", ЛокацияСсылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат; 
	
КонецФункции //Евросиб Коханенко Н.А. 19.12.2024 )) #91409

//Евросиб Коханенко Н.А. 19.12.2024 (( #91409
Процедура РегЗаданиеОбработатьДанныеИзDX() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеПакетовОбмена.ПериодОбмена) КАК ПериодОбмена,
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных
		|ПОМЕСТИТЬ втСрезПоследних
		|ИЗ
		|	РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|ГДЕ
		|	ДанныеПакетовОбмена.ИсточникПакетаДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиПакетовДанных.ПолучениеДанныхОСреднейМиле)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|
		//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
		| ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеПакетовОбмена.ПериодОбмена),
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|ИЗ
		|	РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|ГДЕ
		|	ДанныеПакетовОбмена.ИсточникПакетаДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиПакетовДанных.ПолучениеДанныхТранспортнойАналитики)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСрезПоследних.ПериодОбмена КАК ПериодОбмена,
		|	втСрезПоследних.ИдентификаторСтрокиПакетаДанных КАК ГУИД_ДК,
		|	ДанныеПакетовОбмена.СтруктураДанных КАК СтруктураДанных
		|ИЗ
		|	втСрезПоследних КАК втСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|		ПО втСрезПоследних.ПериодОбмена = ДанныеПакетовОбмена.ПериодОбмена
		|			И втСрезПоследних.ИдентификаторСтрокиПакетаДанных = ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|ГДЕ
		|	ДанныеПакетовОбмена.Обработано = ЛОЖЬ";	
	
	тзНеобработанныеДанные = Запрос.Выполнить().Выгрузить();
	МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(тзНеобработанныеДанные);

	стПараметры = Новый Структура;
	стПараметры.Вставить("МассивДанных", МассивДанных);

	ОбработатьПолученныеДанныеИзDX(стПараметры);
	
	//Евросиб Коханенко Н.А. 04.03.2026 (( #117279 
	//ищем в необработанных заявки с видом НЕ Морской импорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеПакетовОбмена.ПериодОбмена) КАК ПериодОбмена,
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|ПОМЕСТИТЬ втСрезПоследних
		|ИЗ
		|	РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|ГДЕ
		|	ДанныеПакетовОбмена.ИсточникПакетаДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиПакетовДанных.ПолучениеДанныхОСреднейМиле)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеПакетовОбмена.ПериодОбмена),
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|ИЗ
		|	РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|ГДЕ
		|	ДанныеПакетовОбмена.ИсточникПакетаДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиПакетовДанных.ПолучениеДанныхТранспортнойАналитики)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСрезПоследних.ПериодОбмена КАК ПериодОбмена,
		|	втСрезПоследних.ИдентификаторСтрокиПакетаДанных КАК ГУИД_ДК,
		|	ДанныеПакетовОбмена.ВнешнийИдентификаторСтрокиПакетаДанных КАК ВнешнийИдентификаторСтрокиПакетаДанных,
		|	ДанныеПакетовОбмена.СтруктураДанных КАК СтруктураДанных
		|ИЗ
		|	втСрезПоследних КАК втСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|		ПО втСрезПоследних.ПериодОбмена = ДанныеПакетовОбмена.ПериодОбмена
		|			И втСрезПоследних.ИдентификаторСтрокиПакетаДанных = ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных
		|ГДЕ
		|	ДанныеПакетовОбмена.Обработано = ЛОЖЬ";	
	
	тзНеобработанныеДанные = Запрос.Выполнить().Выгрузить();
	МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(тзНеобработанныеДанные);

	стПараметры = Новый Структура;
	стПараметры.Вставить("МассивДанных", МассивДанных);
	ОбработатьПолученныеДанныеИзDXПоПоследнейМиле(стПараметры);
	//Евросиб Коханенко Н.А. 04.03.2026 )) #117279 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 19.12.2024 )) #91409

//Евросиб Коханенко Н.А. 25.12.2024 (( #91409
Функция ПолучитьДанныеМорскогоРейсаИзЗаявки(ЗаявкаСсылка)
	
	Результат = Новый Структура("ОриентировочнаяДатаМорскогоРейса, МорскойТерминалВыдачи", Дата(1,1,1), Неопределено);
	//ищем самую раннюю дату прибытия морского рейса, и морской терминал назначения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РейсыМоре.ДатаПрибытия КАК ОриентировочнаяДатаМорскогоРейса,
		|	РейсыМоре.МестоРазгрузки КАК МорскойТерминалВыдачи
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
		|		ПО ЗаявкаПереченьРейсов.Рейс = РейсыМоре.Ссылка
		|			И (ЗаявкаПереченьРейсов.Ссылка = &ЗаявкаСсылка)
		|			И (РейсыМоре.ДатаПрибытия <> ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПрибытия"; 
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
    Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 25.12.2024 )) #91409

//Евросиб Коханенко Н.А. 25.12.2024 (( #91409
Функция ПолучитьУчетноеНаправлениеИзЗаявки(ЗаявкаСсылка, КлючАналитикиПеревозкиСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаявкаСоставУслуги.УчетноеНаправление КАК УчетноеНаправление
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И ЗаявкаСоставУслуги.КлючАналитикиПеревозки = &КлючАналитикиПеревозки"; 
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозкиСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		Результат = Выборка.УчетноеНаправление;
	КонецЕсли;
    Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 25.12.2024 )) #91409

//Евросиб Коханенко Н.А. 09.01.2025 (( #98939
//Рейсы - массив структур: Тип - "Морской" или "ЖД"	
//						   Наименование - строка с рейсоми (может заканчиваться ";" если морской)
//						   ID - строка, в случае с морским рейсом может иметь вид: "(Val)1001(/Val)(Val)1002(/Val)"
Функция ОбновитьДанныеПоРейсамВЗаявке(ЗаявкаОбъект, Рейсы);
	
	Результат = Ложь; //рейсы в заявке не обновлены 
	
	//проверяем, разрешено ли синхронизировать рейсы
	АвтозагрузкаРейсовИзDXсДаты = Константы.АвтозагрузкаРейсовИзDXсДаты.Получить();
	
	ПризнакАвтозагрузкиРейсов = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьАналитикуДокумента(ЗаявкаОбъект.Ссылка,
		ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.АвтозагрузкаРейсовИзДХ);
	Если ПризнакАвтозагрузкиРейсов <> Неопределено Тогда
		АвтозагрузкаВЗаявкеОтключена = ПризнакАвтозагрузкиРейсов;
	Иначе
		АвтозагрузкаВЗаявкеОтключена = Ложь;
	КонецЕсли; 
	
	Если АвтозагрузкаВЗаявкеОтключена
		ИЛИ НЕ ЗначениеЗаполнено(АвтозагрузкаРейсовИзDXсДаты)
		ИЛИ ЗначениеЗаполнено(АвтозагрузкаРейсовИзDXсДаты)
		И (ЗаявкаОбъект.Создано < АвтозагрузкаРейсовИзDXсДаты)
	Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ПереченьРейсов = ЗаявкаОбъект.ПереченьРейсов;
	
	Для Каждого РейсDX Из Рейсы Цикл 
		СписокПроверяемыхРеквизитов = "ПометкаУдаления";
		Если РейсDX.Тип = "Морской" Тогда
			РейсИзСправочникаПоКоду = Справочники.РейсыМоре.НайтиПоРеквизиту("IDРейса",РейсDX.ID);
		ИначеЕсли РейсDX.Тип = "ЖД" Тогда 
			//Евросиб Коханенко Н.А. 24.04.2025 (( #107817 
			//РейсИзСправочникаПоКоду = Справочники.РейсыЖД.НайтиПоКоду(РейсDX.ID);
			//СписокПроверяемыхРеквизитов = СписокПроверяемыхРеквизитов + ", ТехРейс";
			РейсИзСправочникаПоКоду = Справочники.РейсыЖД.НайтиПоРеквизиту("ЛотDX", РейсDX.ID);
			СписокПроверяемыхРеквизитов = СписокПроверяемыхРеквизитов + ", ТехРейс, РейсОтменен";
			//Евросиб Коханенко Н.А. 24.04.2025 )) #107817 
		КонецЕсли;                                             
		
		Если НЕ ЗначениеЗаполнено(РейсИзСправочникаПоКоду) Тогда
			//рейс из DX отсутствует в справочниках
			//с таким рейсом ничего не делаем
			Продолжить;	
		Иначе
			ЗначенияРеквизитовРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РейсИзСправочникаПоКоду, СписокПроверяемыхРеквизитов);
			//помеченные на удаление или Технические ЖД Рейсы не добавляем
			Если ЗначенияРеквизитовРейса.ПометкаУдаления
				ИЛИ (РейсDX.Тип = "ЖД"
				//Евросиб Коханенко Н.А. 24.04.2025 (( #107817 
				//И ЗначенияРеквизитовРейса.ТехРейс) Тогда
				И (ЗначенияРеквизитовРейса.РейсОтменен //также не добавляем отмененные рейсы 
				ИЛИ ЗначенияРеквизитовРейса.ТехРейс)) Тогда
				//Евросиб Коханенко Н.А. 24.04.2025 )) #107817 
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		МассивРейсовИзЗаявки = ПереченьРейсов.НайтиСтроки(Новый Структура("Рейс", РейсИзСправочникаПоКоду)); 
		Если МассивРейсовИзЗаявки.Количество() = 0 Тогда
			СтрокаРейса = ПереченьРейсов.Добавить();
			СтрокаРейса.Рейс = РейсИзСправочникаПоКоду;
            СтрокаРейса.Продукт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РейсИзСправочникаПоКоду, "Продукт");
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 09.01.2025 )) #98939 

//Евросиб Коханенко Н.А. 14.01.2025 (( #98939 
Функция ОбновитьДанныеПоРейсамВСделках(ЗаявкаСсылка, Рейсы);
	
	РезультатОбновленияСделок = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаЗаявки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|ГДЕ
		|	СделкаЗаявки.Заявка = &Ссылка
		|	И СделкаЗаявки.Ссылка.Проведен";		
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл
		СделкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СделкаОбъект.Заблокировать();
		СделкаИзменена = Ложь;
		Для Каждого РейсDX Из Рейсы Цикл
			СписокПроверяемыхРеквизитов = "ПометкаУдаления";
			Если РейсDX.Тип = "Морской" Тогда
				РейсИзСправочникаПоКоду = Справочники.РейсыМоре.НайтиПоРеквизиту("IDРейса", РейсDX.ID);
			ИначеЕсли РейсDX.Тип = "ЖД" Тогда
				//Евросиб Коханенко Н.А. 24.04.2025 (( #107817 
				//РейсИзСправочникаПоКоду = Справочники.РейсыЖД.НайтиПоКоду(РейсDX.ID);
				//СписокПроверяемыхРеквизитов = СписокПроверяемыхРеквизитов + ", ТехРейс";
				РейсИзСправочникаПоКоду = Справочники.РейсыЖД.НайтиПоРеквизиту("ЛотDX", РейсDX.ID);
				СписокПроверяемыхРеквизитов = СписокПроверяемыхРеквизитов + ", ТехРейс, РейсОтменен";
				//Евросиб Коханенко Н.А. 24.04.2025 )) #107817 
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(РейсИзСправочникаПоКоду) Тогда
				//рейс из DX отсутствует в справочниках
				//с таким рейсом ничего не делаем
				Продолжить;	
			Иначе
				ЗначенияРеквизитовРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РейсИзСправочникаПоКоду, СписокПроверяемыхРеквизитов);
				//помеченные на удаление или Технические ЖД Рейсы не добавляем
				Если ЗначенияРеквизитовРейса.ПометкаУдаления
					ИЛИ (РейсDX.Тип = "ЖД"
					//Евросиб Коханенко Н.А. 24.04.2025 (( #107817 
					//И ЗначенияРеквизитовРейса.ТехРейс) Тогда
				    И (ЗначенияРеквизитовРейса.РейсОтменен //также не добавляем отмененные рейсы 
					ИЛИ ЗначенияРеквизитовРейса.ТехРейс)) Тогда
					//Евросиб Коханенко Н.А. 24.04.2025 )) #107817 
					Продолжить;	
				КонецЕсли;
			КонецЕсли;
           	МассивРейсовИзСделки = СделкаОбъект.Рейсы.НайтиСтроки(Новый Структура("Рейс", РейсИзСправочникаПоКоду)); 
			Если МассивРейсовИзСделки.Количество() = 0 Тогда
            	СтрокаРейса = СделкаОбъект.Рейсы.Добавить(); 
				СтрокаРейса.Рейс = РейсИзСправочникаПоКоду;
				СделкаИзменена = Истина;
			КонецЕсли;
		КонецЦикла;
		Если СделкаИзменена Тогда
			СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		СделкаОбъект.Разблокировать();
	КонецЦикла;

	Возврат РезультатОбновленияСделок;

КонецФункции //Евросиб Коханенко Н.А. 14.01.2025 )) #98939

//Евросиб Коханенко Н.А. 19.02.2025 (( #102955
Функция ПолучитьДанныеИзКоносамента(ЗаявкаСсылка, КлючАналитикиСсылка) Экспорт
	
	Результат = Новый Структура("ТерминалВыдачи, ВесГрузаНетто", Неопределено, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТранспортныйДокументКоносаменты.ВесНетто КАК ВесГрузаНетто,
		|	ТранспортныйДокументКоносаменты.Ссылка.МестоПоставкиГруза КАК ТерминалВыдачи
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|		ПО ЗаявкаСоставУслуги.Коносамент = ТранспортныйДокументКоносаменты.Ссылка
		|			И ЗаявкаСоставУслуги.НомерКТК = ТранспортныйДокументКоносаменты.НомерКТК
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &ЗаявкаСсылка
		|	И ЗаявкаСоставУслуги.КлючАналитикиПеревозки = &КлючАналитикиСсылка";
	
	Запрос.УстановитьПараметр("КлючАналитикиСсылка", КлючАналитикиСсылка);
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    ЗаполнитьЗначенияСвойств(Результат, Выборка);                  
	КонецЕсли;
    Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 19.02.2025 )) #102955 

//Евросиб Коханенко Н.А. 04.03.2026 (( #117279 
Процедура ОбработатьПолученныеДанныеИзDXПоПоследнейМиле(стПараметры, АдресВХранилище = Неопределено) Экспорт

	МассивДанных = стПараметры.МассивДанных;
	
	Если МассивДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//формируем ТЗ для запроса для поиска заявки
	тз_ВхДанных = Новый ТаблицаЗначений;
	тз_ВхДанных.Колонки.Добавить("ПериодОбмена", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз_ВхДанных.Колонки.Добавить("ГУИД_ДК", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("ВнешнийИдентификаторСтрокиПакетаДанных", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	тз_ВхДанных.Колонки.Добавить("НомерКТК", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
	тз_ВхДанных.Колонки.Добавить("НомерКоносамента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("КлиентСсылка", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тз_ВхДанных.Колонки.Добавить("НомерЗапросаКлиента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	тз_ВхДанных.Колонки.Добавить("МорскойРейсID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
			
	Для Каждого Док Из МассивДанных Цикл
		ДанныеДокумента = ИзвлечьДанныеИзДокумента(Док);
		СтруктураВхДанных = тз_ВхДанных.Добавить();
		Если ДанныеДокумента.Свойство("КлиентID")
				И ДанныеДокумента.КлиентID <> "" Тогда
			СтруктураВхДанных.КлиентСсылка = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ДанныеДокумента.КлиентID, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
																							Перечисления.УзлыОбмена.БитФинанс, Тип("СправочникСсылка.Контрагенты"));		
		КонецЕсли;	

		МассивРейсов = Новый Массив;

		ЗаполнитьЗначенияСвойств(СтруктураВхДанных, ДанныеДокумента);
		СтруктураВхДанных.ГУИД_ДК = Док.ГУИД_ДК;
		СтруктураВхДанных.ВнешнийИдентификаторСтрокиПакетаДанных = Док.ВнешнийИдентификаторСтрокиПакетаДанных;
		СтруктураВхДанных.ПериодОбмена = Док.ПериодОбмена;
		Если ДанныеДокумента.Свойство("МорскиеРейсы") 
				И ДанныеДокумента.МорскиеРейсыID <> "" Тогда
			//приводим к формату IDрейса в справочнике РейсыМоре, если рейс состоит из 2х плеч
			IDРейсаСтрокой = СтрЗаменить(ДанныеДокумента.МорскиеРейсыID, "(/Val)(Val)", "_"); 
			IDРейсаСтрокой = СтрЗаменить(IDРейсаСтрокой, "(Val)", "");
			IDРейсаСтрокой = СтрЗаменить(IDРейсаСтрокой, "(/Val)", "");
			СтруктураВхДанных.МорскойРейсID = IDРейсаСтрокой;
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос; 

#Область ЗапросВыбораЗаявки
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз_ВхДанных.ПериодОбмена КАК ПериодОбмена,
	               |	тз_ВхДанных.ГУИД_ДК КАК ГУИД_ДК,
	               |	тз_ВхДанных.ВнешнийИдентификаторСтрокиПакетаДанных КАК ВнешнийИдентификаторСтрокиПакетаДанных,
	               |	тз_ВхДанных.НомерКТК КАК НомерКТК,
	               |	тз_ВхДанных.НомерКоносамента КАК НомерКоносамента,
	               |	тз_ВхДанных.КлиентСсылка КАК КлиентСсылка,
	               |	тз_ВхДанных.МорскойРейсID КАК МорскойРейсID,
	               |	тз_ВхДанных.НомерЗапросаКлиента КАК НомерЗапросаКлиента
	               |ПОМЕСТИТЬ вт_ВхДанные
	               |ИЗ
	               |	&тз_ВхДанных КАК тз_ВхДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//добавляем к входных данным ссылки на КТК, Контрагента и на Морские рейсы
	               |ВЫБРАТЬ
	               |	вт_ВхДанные.ПериодОбмена КАК ПериодОбмена,
	               |	вт_ВхДанные.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ВхДанные.ВнешнийИдентификаторСтрокиПакетаДанных КАК ВнешнийИдентификаторСтрокиПакетаДанных,
	               |	вт_ВхДанные.НомерКТК КАК НомерКТК,
	               |	вт_ВхДанные.НомерКоносамента КАК НомерКоносамента,
	               |	вт_ВхДанные.КлиентСсылка КАК КлиентСсылка,
	               |	вт_ВхДанные.НомерЗапросаКлиента КАК НомерЗапросаКлиента,
	               |	РейсыМоре.Ссылка КАК МорскойРейсСсылка,
	               |	ЕСТЬNULL(ТД.Ссылка, ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)) КАК КоносаментСсылка,
	               |	ТЕ.Ссылка КАК КТКСсылка
	               |ПОМЕСТИТЬ вт_Документы
	               |ИЗ
	               |	вт_ВхДанные КАК вт_ВхДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |		ПО вт_ВхДанные.НомерКТК = ТЕ.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТД
	               |		ПО вт_ВхДанные.НомерКоносамента = ТД.НомерТранспортногоДокумента
	               |			И (ТД.Проведен)
	               |			И (НЕ вт_ВхДанные.НомерКоносамента = """")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
	               |		ПО вт_ВхДанные.МорскойРейсID = РейсыМоре.IDРейса
	               |			И (НЕ РейсыМоре.ПометкаУдаления)
	               |			И (НЕ вт_ВхДанные.МорскойРейсID = """")
	               |;
	               |
	               //Евросиб Коханенко Н.А. 25.03.2026 (( #117279 
	               |////////////////////////////////////////////////////////////////////////////////
				   |//Ищем в Протоколе обменов самые ранние записи по УИДам пакетов				   
	               |ВЫБРАТЬ
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	МИНИМУМ(ПротоколОбменов.ДатаОбмена) КАК МинДатаОбмена	
	               |ПОМЕСТИТЬ вт_МинДатыОбмена
	               |ИЗ  
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
	               |		ПО ПротоколОбменов.УИДИсточника = вт_Документы.ГУИД_ДК  
	               |			И ПротоколОбменов.Объект ССЫЛКА Справочник.КлючиАналитикиПеревозки
	               |			И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX)
	               |СГРУППИРОВАТЬ ПО
	               |	УИДИсточника			
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//Добавили самый низший приоритет, в котором находится самая ранняя подобранная заявка по УИДу пакета в Протоколе обменов
	               |ВЫБРАТЬ
	               |	6 КАК Приоритет,
	               |	вт_Документы.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена КАК ПериодОбмена,
	               |	КлючиАналитикиПеревозки.Заявка КАК Заявка,
	               |	ПротоколОбменов.Объект КАК КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	               |ПОМЕСТИТЬ вт_ЗаявкиСПриоритетами
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |	    ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_МинДатыОбмена КАК вт_МинДатыОбмена
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |	               		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |	               		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |	               			И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |	               			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |	               			И (Заявка.Проведен)
	               |					ПО КлючиАналитикиПеревозки.Заявка = ЗаявкаСоставУслуги.Ссылка
	               |						И ЗаявкаСоставУслуги.НомерКТК = КлючиАналитикиПеревозки.Контейнер
	               |				ПО ПротоколОбменов.Объект = КлючиАналитикиПеревозки.Ссылка
	               |			ПО вт_МинДатыОбмена.УИДИсточника = ПротоколОбменов.УИДИсточника
	               |				И вт_МинДатыОбмена.МинДатаОбмена = ПротоколОбменов.ДатаОбмена
	               |		ПО вт_Документы.ГУИД_ДК = вт_МинДатыОбмена.УИДИсточника 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
					//Евросиб Коханенко Н.А. 25.03.2026 )) #117279 
				   |//ищем заявки только по виду перевозок, совпадению номера КТК вх.данных и в услугах заявки				   
	               |ВЫБРАТЬ
	               |	5 КАК Приоритет,
	               |	вт_Документы.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена КАК ПериодОбмена,
	               |	Заявка.Ссылка КАК Заявка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	               //Евросиб Коханенко Н.А. 25.03.2026 (( #117279 
				   //|ПОМЕСТИТЬ вт_ЗаявкиСПриоритетами
				   //Евросиб Коханенко Н.А. 25.03.2026 )) #117279 
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 5 добавляем условие, если номер коносамента во вх.данных есть,
				   |//то он должен совпадать с номером коносамента, указанного в строке заявки, коносамент должен быть проведен
	               |ВЫБРАТЬ
	               |	4,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 4 добавляем условие, чтобы рейс из DX совпал с рейсом в заявке,
				   |//рейс в заявке должен быть морским и не должен быть помеченным на удаление
	               |ВЫБРАТЬ
	               |	3,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	               |			И (вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//к условиям отбора по приоритету 3 добавляем условие, чтобы либо контрагент не был указан во вх.данных,
				   |//либо (если указан) совпадал с контрагентом в заявке
	               |ВЫБРАТЬ
	               |	2,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (вт_Документы.НомерКоносамента <> """"
	               |					И ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка)
	               |			И (вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	               |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	               |			И (ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка
	               |				ИЛИ вт_Документы.КлиентСсылка ЕСТЬ NULL)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |//отбор проводится по всем вх.данным среди всех заявок
				   |//наивысший приоритет, к условиям отбора по приоритету 2 добавляем условие, чтобы либо Номер запроса клиента
				   |//не был указан во вх.данных, либо (если указан) совпадал с внешним номером заявки
	               |ВЫБРАТЬ
	               |	1,
	               |	вт_Документы.ГУИД_ДК,
	               |	вт_Документы.ПериодОбмена,
	               |	Заявка.Ссылка,
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки,
	               |	ЗаявкаСоставУслуги.ГУИДСтроки
	               |ИЗ
	               |	вт_Документы КАК вт_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	               |			ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
	               |				И НЕ (Заявка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре))
	               |				И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
	               |				И (Заявка.Проведен)
	               |		ПО (ЗаявкаСоставУслуги.НомерКТК = вт_Документы.КТКСсылка)
	               |			И (ЗаявкаСоставУслуги.Коносамент = вт_Документы.КоносаментСсылка
	               |				ИЛИ вт_Документы.НомерКоносамента = """")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	               |		ПО (ЗаявкаПереченьРейсов.Ссылка = Заявка.Ссылка
	               |					И вт_Документы.МорскойРейсСсылка = ЗаявкаПереченьРейсов.Рейс
	               |				ИЛИ вт_Документы.МорскойРейсСсылка ЕСТЬ NULL)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	               |		ПО (ДокЗаявка.Ссылка = Заявка.Ссылка)
	               |			И (ДокЗаявка.Контрагент = вт_Документы.КлиентСсылка
	               |				ИЛИ вт_Документы.КлиентСсылка ЕСТЬ NULL)
	               |			И (ДокЗаявка.ВнешнийНомер = вт_Документы.НомерЗапросаКлиента
	               |				ИЛИ вт_Документы.НомерЗапросаКлиента = """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//из всех отобранных заявок отбираем только те, которые нашлись однократно
	               |ВЫБРАТЬ
	               |	вт_ЗаявкиСПриоритетами.Приоритет КАК Приоритет,
	               |	вт_ЗаявкиСПриоритетами.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ЗаявкиСПриоритетами.ПериодОбмена КАК ПериодОбмена
	               |ПОМЕСТИТЬ вт_ОдиночныеЗаявки
	               |ИЗ
	               |	вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ЗаявкиСПриоритетами.Приоритет,
	               |	вт_ЗаявкиСПриоритетами.ГУИД_ДК,
	               |	вт_ЗаявкиСПриоритетами.ПериодОбмена
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(вт_ЗаявкиСПриоритетами.Приоритет) = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |//к однократно найденным заявкам добавляем входные данные
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	вт_ОдиночныеЗаявки.ГУИД_ДК КАК ГУИД_ДК,
	               |	вт_ОдиночныеЗаявки.ПериодОбмена КАК ПериодОбмена,
	               |	вт_ЗаявкиСПриоритетами.Заявка КАК Заявка,
	               |	вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	вт_ЗаявкиСПриоритетами.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	               |	вт_Документы.НомерКТК КАК НомерКТК,
	               |	вт_Документы.ВнешнийИдентификаторСтрокиПакетаДанных КАК ВнешнийИдентификаторСтрокиПакетаДанных,
				   |	РегистрПротоколОбменов.УИДИсточника КАК ГуидПротоколаОбмена
	               |ИЗ
	               |	вт_ОдиночныеЗаявки КАК вт_ОдиночныеЗаявки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ЗаявкиСПриоритетами КАК вт_ЗаявкиСПриоритетами
	               |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_ЗаявкиСПриоритетами.ГУИД_ДК
	               |			И вт_ОдиночныеЗаявки.Приоритет = вт_ЗаявкиСПриоритетами.Приоритет
	               |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_ЗаявкиСПриоритетами.ПериодОбмена
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
	               |		ПО вт_ОдиночныеЗаявки.ГУИД_ДК = вт_Документы.ГУИД_ДК
	               |			И вт_ОдиночныеЗаявки.ПериодОбмена = вт_Документы.ПериодОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО (вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка)
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля))
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК РегистрПротоколОбменов
				   |		ПО вт_ЗаявкиСПриоритетами.КлючАналитикиПеревозки = РегистрПротоколОбменов.Объект
				   |			И РегистрПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX)
				   |ГДЕ
				   |	ВЫБОР
				   |		КОГДА РегистрПротоколОбменов.УИДИсточника <> """" 
				   |			И РегистрПротоколОбменов.УИДИсточника <> вт_ОдиночныеЗаявки.ГУИД_ДК
				   |			ТОГДА ЛОЖЬ
				   |		ИНАЧЕ ИСТИНА
				   |	КОНЕЦ";
#КонецОбласти

	Запрос.УстановитьПараметр("тз_ВхДанных", тз_ВхДанных);  
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();  
	
	МассивРезультатовОбработки = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл 

		стРезультат = Новый Структура("ПериодОбмена, ИдентификаторСтрокиПакетаДанных, ВнешнийИдентификаторСтрокиПакетаДанных, ОбъектДанных, Обработано, ДатаОбработки, ЕстьОшибки, ОписаниеОшибки, ИсточникПакетаДанных",
								Выборка.ПериодОбмена, Выборка.ГУИД_ДК, Выборка.ВнешнийИдентификаторСтрокиПакетаДанных, Выборка.КлючАналитикиПеревозки, Ложь, ТекущаяДата(), Ложь, "", Справочники.ИсточникиПакетовДанных.ПолучениеДанныхТранспортнойАналитики);
								
		//считаем строку обработанной, если заявка нашлась
		Если ЗначениеЗаполнено(Выборка.Заявка) Тогда
			стРезультат.Обработано = Истина;
			МассивРезультатовОбработки.Добавить(стРезультат);
		КонецЕсли;
				
	КонецЦикла;
	
	//обновим регистр, выставим признаки обработанных    
	Для Каждого стРезультат Из МассивРезультатовОбработки Цикл 
		МЗ = РегистрыСведений.ДанныеПакетовОбмена.СоздатьМенеджерЗаписи();
		МЗ.ПериодОбмена = стРезультат.ПериодОбмена;
		МЗ.ИдентификаторСтрокиПакетаДанных = стРезультат.ИдентификаторСтрокиПакетаДанных;
		МЗ.Прочитать();
		ЗаполнитьЗначенияСвойств(МЗ, стРезультат); 
	    МЗ.Записать();
		
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, стРезультат.ОбъектДанных);
		СтруктураДанных = Новый Структура("УИДИсточника", стРезультат.ИдентификаторСтрокиПакетаДанных);      
		ТекстСообщения = "Данные по последней миле по ключу аналитики %1 обработаны" + ?(стРезультат.ЕстьОшибки, " с ошибками", " без ошибок"); 
		Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, ТекстСообщения);
	КонецЦикла;

КонецПроцедуры //Евросиб Коханенко Н.А. 14.03.2026 )) #117279

