
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяОбновитьОтправку" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткамВагонов(Команда)
	
	ОткрытьФорму("Отчет.ОстаткиВагонов.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткамКонтейнеров(Команда)
	
	ОткрытьФорму("Отчет.ОстаткиКонтейнеров.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзБуфераОбмена(Команда)
	
	ОткрытьФорму("РегистрСведений.КонтейнерыВОтправке.Форма.ФормаРедактированияСпискаКонтейнеровОтправки", Новый Структура("Отправка", Список.Отбор.Элементы[0].ПравоеЗначение));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВагонов(Команда)
	
	ПараметрыФормы = Новый Структура("Отправка", Список.Отбор.Элементы[0].ПравоеЗначение);
	ОткрытьФорму("Обработка.ПомощникВыбораКонтейнеров.Форма", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
