
&НаКлиенте
Процедура НайтиСтанцииПоКодам(Команда)
	
	ТЧ.Очистить();
	
	Сч = 2;
	КодСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	КодСтанции2 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
	
	Пока КодСтанции1 <> "" И КодСтанции2 <> "" Цикл
		
		НСтр = ТЧ.Добавить();
		НСтр.Станция1Код = ОставитьТолькоЦифры(КодСтанции1);
		НСтр.Станция2Код = ОставитьТолькоЦифры(КодСтанции2);		
		
		
		Сч = Сч + 1;
		
		КодСтанции1 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		КодСтанции2 = ТабДок.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		
	КонецЦикла;
	
	НайтиСопоставленияСтанциямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НайтиСопоставленияСтанциямНаСервере()
	
	Для каждого Стр из ТЧ Цикл
		
		Если ЗначениеЗаполнено(Стр.Станция1Код) Тогда Стр.Станция1 = Локации_сервер.НайтиСтанциюПоНеполномуКоду(Стр.Станция1Код); КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Станция2Код) Тогда Стр.Станция2 = Локации_сервер.НайтиСтанциюПоНеполномуКоду(Стр.Станция2Код); КонецЕсли;
		Стр.Отметка = ЗначениеЗаполнено(Стр.Станция1) И ЗначениеЗаполнено(Стр.Станция2);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОставитьТолькоЦифры(СтрокаЪ)
	
	Результат = "";
	МЦ = Новый Массив;
	МЦ.Добавить("1"); МЦ.Добавить("2"); МЦ.Добавить("3"); 
	МЦ.Добавить("4"); МЦ.Добавить("5"); МЦ.Добавить("6"); 
	МЦ.Добавить("7"); МЦ.Добавить("8"); МЦ.Добавить("9"); 
	МЦ.Добавить("0"); 
	
	Для Сч = 1 По СтрДлина(СтрокаЪ) Цикл
		
		ОчрСимвол = Сред(СтрокаЪ, Сч, 1);
		Если МЦ.Найти(ОчрСимвол) <> неопределено Тогда
			Результат = Результат + ОчрСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ЗаписатьАналогиСтанций(Команда)
	ЗаписатьАналогиСтанцийНаСервере();
	ПоказатьПредупреждение(, "Все доступные аналоги установлены!");
КонецПроцедуры


&НаСервере
Процедура ЗаписатьАналогиСтанцийНаСервере()
	
	Для каждого Стр из ТЧ Цикл
		
		Если Стр.Отметка И ЗначениеЗаполнено(Стр.Станция1) И ЗначениеЗаполнено(Стр.Станция2) Тогда
			Локации_сервер.УстановитьАналогСтанции(Стр.Станция1, Стр.Станция2);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
