
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодДействияТарифа = ТекущаяДата();
	
	ПустаяДата = '00010101';
	Список.Параметры.УстановитьЗначениеПараметра("СтатусПроведенПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусСогласованПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусОтмененПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.ОтмененПоПСЦ);
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", ПустаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("Период", ПериодДействияТарифа);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Критерий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияТарифаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ПериодДействияТарифа);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляСписка()
	
	Для Каждого Поле Из Элементы.Список.ПодчиненныеЭлементы Цикл
		Поле.Видимость = Ложь;
	КонецЦикла;
	
	//Евросиб Шевченко А.В. US 123730 TA 123732 03.12.2025
	ЭлементГ = ЭтотОбъект.Элементы.Найти("ГруппаОтправления");
	Если ЭлементГ <> Неопределено Тогда
		Элементы.Удалить(ЭлементГ);
	КонецЕсли;
	ЭлементН = ЭтотОбъект.Элементы.Найти("ГруппаНазначения");
	Если ЭлементН <> Неопределено Тогда
		Элементы.Удалить(ЭлементН);
	КонецЕсли;
	ЭлементЛОУ = ЭтотОбъект.Элементы.Найти("ГруппаЛокацияОказанияУслуги");
	Если ЭлементЛОУ <> Неопределено Тогда
		Элементы.Удалить(ЭлементЛОУ);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 123730 TA 123732 03.12.2025
	
	
	
	ПоляСписка = Справочники.ВидыУслугПоставщиков.ПолучитьПоляСпискаТарифовВидаУслуг(ВидУслуги);
	
	Для Каждого ОписаниеПоля Из ПоляСписка Цикл
			
		ИмяПоля = "Список" + СтрЗаменить(ОписаниеПоля.Имя, ".", "");
		Элемент = Элементы.Найти(ИмяПоля);
		
		Если Элемент = Неопределено Тогда	
			Элемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.Список);
			Элемент.ПутьКДанным = "Список." + ОписаниеПоля.Имя;
		КонецЕсли;
		
		Элементы.Переместить(Элемент, Элементы.Список);
		Элемент.Заголовок = ОписаниеПоля.Представление;
		Элемент.Видимость = Истина;
		
	КонецЦикла;	
	
	//Евросиб Шевченко А.В. US 123730 TA 123732 03.12.2025
	Если ВидУслуги = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
		
		ПунктОтправления = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктОтправления");
		ЭлементГород = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктОтправленияГород");
		
		Если ПунктОтправления <> Неопределено И ЭлементГород <> Неопределено  Тогда
			
			ЭлементГ = Элементы.Добавить("ГруппаОтправления", Тип("ГруппаФормы"), Элементы.Список);	
			ЭлементГ.Вид = ВидГруппыФормы.ГруппаКолонок;
			Элементы.Переместить(ЭлементГ, Элементы.Список,ПунктОтправления);
			
			Элементы.Переместить(ПунктОтправления, ЭлементГ);
			
			ЭлементГород = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктОтправленияГород");
			ЭлементГород.Заголовок = "Город";
			Элементы.Переместить(ЭлементГород, ЭлементГ);
			
		КонецЕсли;
		
		ПунктНазначения = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктНазначения");
		ЭлементГородН = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктНазначенияГород");
		
		Если ПунктНазначения <> Неопределено И ЭлементГородН <> Неопределено Тогда
			
			ЭлементГн = Элементы.Добавить("ГруппаНазначения", Тип("ГруппаФормы"), Элементы.Список);
			ЭлементГн.Вид = ВидГруппыФормы.ГруппаКолонок;
			Элементы.Переместить(ЭлементГн, Элементы.Список,ПунктНазначения);
			Элементы.Переместить(ПунктНазначения, ЭлементГн);
			
			ЭлементГородН = ЭтотОбъект.Элементы.Найти("СписокКритерийПунктНазначенияГород");
			ЭлементГородН.Заголовок = "Город";
			Элементы.Переместить(ЭлементГородН, ЭлементГн);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидУслуги = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
		
		ЛокацияОказанияУслуги = ЭтотОбъект.Элементы.Найти("СписокКритерийЛокацияОказанияУслуги");
		ЭлементГород = ЭтотОбъект.Элементы.Найти("СписокКритерийЛокацияОказанияУслугГород");
		
		Если ЛокацияОказанияУслуги <> Неопределено И ЭлементГород <> Неопределено  Тогда
			
			ЭлементЛОУ = Элементы.Добавить("ГруппаЛокацияОказанияУслуги", Тип("ГруппаФормы"), Элементы.Список);	
			ЭлементЛОУ.Вид = ВидГруппыФормы.ГруппаКолонок;
			Элементы.Переместить(ЭлементЛОУ, Элементы.Список,ЛокацияОказанияУслуги);
			
			Элементы.Переместить(ЛокацияОказанияУслуги, ЭлементЛОУ);
			
			ЭлементГород = ЭтотОбъект.Элементы.Найти("СписокКритерийЛокацияОказанияУслугГород");
			ЭлементГород.Заголовок = "Город";
			Элементы.Переместить(ЭлементГород, ЭлементЛОУ);
			
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Шевченко А.В. US 123730 TA 123732 03.12.2025
	
КонецПроцедуры

&НаСервере
Процедура ВидУслугиПриИзмененииСервер()

	Если ЗначениеЗаполнено(ВидУслуги) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги", ВидУслуги);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги");
	КонецЕсли;
	
	НастроитьПоляСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугиПриИзменении(Элемент)
	
	ВидУслугиПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(ВидУслуги) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги", ВидУслуги);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Критерий.ВидУслуги");
	КонецЕсли;
	
	НастроитьПоляСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

