
&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Услуги.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 
	
	УстановитьОтборПоУслуге(Элементы.Услуги.ТекущиеДанные.НомерСтроки);  	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактурыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СчетФактуры.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 
	УстановитьОтборПоСчетФактуре(Элементы.СчетФактуры.ТекущиеДанные.НомерСтроки)
	
КонецПроцедуры



&НаКлиенте
Процедура НакладныеПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Накладные.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 
	УстановитьОтборПоНакладной(Элементы.Накладные.ТекущиеДанные.НакладнаяНомер)
	
КонецПроцедуры



&НаКлиенте
Процедура УстановитьОтборПоУслуге(ИДУслуги)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НомерУслуги", Элементы.Услуги.ТекущиеДанные.НомерСтроки);
	Элементы.СчетФактуры.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска); 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСчетФактуре(ИДСчетФактуры)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НомерСчетФактуры", ИДСчетФактуры);
	Элементы.Накладные.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоНакладной(ИДНакладной)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НакладнаяНомер", ИДНакладной);
	Элементы.Вагоны.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	Элементы.Контейнеры.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
