#Область ПрограммныйИнтерфейс

Процедура МаршрутизироватьКорректировкуПТУ(СтруктураПараметров) Экспорт
	// Евросиб Фролов (02.12.2021 Task №43242
	
	ДокументСсылка = СтруктураПараметров.Ссылка;
	Услуги = СтруктураПараметров.Услуги.Выгрузить();
	
	ВсегоДоКорректировки 	= ?(Услуги.Итог("ВсегоДоКорректировки") = 0, Услуги.Итог("ВсегоДоИзменения"), Услуги.Итог("ВсегоДоКорректировки"));
	ВсегоПослеКорректировки = Услуги.Итог("Всего");	
	СуммаКорректировки 		= ВсегоПослеКорректировки - ВсегоДоКорректировки;
	
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", 			СтруктураПараметров.Организация);
	ПараметрыЗапроса.Вставить("Контрагент", 			СтруктураПараметров.Контрагент);
	ПараметрыЗапроса.Вставить("Договор", 				СтруктураПараметров.ДоговорКонтрагента);
	ПараметрыЗапроса.Вставить("ОбъектМаршрутизации",	СтруктураПараметров.Ссылка);
	ПараметрыЗапроса.Вставить("Штраф", 					СтруктураПараметров.Штраф);
	ПараметрыЗапроса.Вставить("Копия", 					СтруктураПараметров.Копия);
	ПараметрыЗапроса.Вставить("ЦФО", 					СтруктураПараметров.ЦФО);
	ПараметрыЗапроса.Вставить("СуммаДокумента", 		СуммаКорректировки / СтруктураПараметров.КратностьВзаиморасчетов * СтруктураПараметров.КурсВзаиморасчетов);
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	ПараметрыЗапроса.Вставить("ВидУслуг", СтруктураПараметров.ВидУслуг);
	//Евросиб Каблов 12.08.2022 )
	
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, СтруктураПараметров.Дата);
	Если РезультатЗапроса.Количество() > 0 Тогда	
		Автор = СтруктураПараметров.Автор;
		Для каждого СтрокаМаршрута Из РезультатЗапроса Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаМаршрута.Исполнитель) Тогда
				СтрокаМаршрута.Исполнитель = Автор;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаМаршрута.Наблюдатель) Тогда
				СтрокаМаршрута.Наблюдатель = Автор;
			КонецЕсли;
		КонецЦикла;
		Попытка
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			МаршрутизацияСервер.ПрименитьМаршрут(ДокументОбъект, РезультатЗапроса, Автор, Новый СписокЗначений);
			ДокументОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось перемаршрутизировать документ " + ДокументСсылка);
		КонецПопытки;
	Иначе
		Сообщить("Для документа " + ДокументСсылка + " не найден подходящий маршрут. Изменения не внесены!");
	КонецЕсли;
	
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти 

// ++ ДИТ_Агафонов_task 41390
Функция ПолучитьКорректировкуПоОснованию(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаПоступления.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Проведен = ИСТИНА
	|	И КорректировкаПоступления.ВидОперации = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|	И КорректировкаПоступления.ДокументПоступления = &ДокументПоступления";
	Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		КорректировкаПоступления = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КорректировкаПоступления = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат КорректировкаПоступления;
	
КонецФункции // ()

Процедура ЗаполнитьСписокКорректировокПоступленияРекурсивно(ДокументСсылка, КорректировкиДокумента=Неопределено) Экспорт
	
	Если КорректировкиДокумента = Неопределено Тогда
		КорректировкиДокумента = Новый СписокЗначений;	
	КонецЕсли;
	
	КорректировкаСсылка = ПолучитьКорректировкуПоОснованию(ДокументСсылка);
	
	Если КорректировкаСсылка = неопределено Тогда
		Возврат;
	Иначе	
		КорректировкиДокумента.Вставить(0,КорректировкаСсылка);
		ЗаполнитьСписокКорректировокПоступленияРекурсивно(КорректировкаСсылка,КорректировкиДокумента);
	КонецЕсли;

КонецПроцедуры

 Процедура ПроверитьДокументПоступление(ДокументПоступленияНаПроверку, КорректировкаСсылкаПроверки, ОтказЗначение = Ложь) Экспорт
	СсылкаНаКорректировкуПервички = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(ДокументПоступленияНаПроверку);
	Если ЗначениеЗаполнено(СсылкаНаКорректировкуПервички) и не СсылкаНаКорректировкуПервички = КорректировкаСсылкаПроверки Тогда
		ОбщегоНазначения.СообщитьПользователю(
		"Для документа поступления "+ДокументПоступленияНаПроверку+" введен документ исправления "+СсылкаНаКорректировкуПервички+". Все корректировки необходимо вводить на основании документа-исправления!"
		//, Объект.Ссылка
		//, "ДокументПоступления"
		);        
		ДокументПоступленияНаПроверку = Неопределено;
		ОтказЗначение = Истина;
	КонецЕсли;
 КонецПроцедуры
// -- ДИТ_Агафонов_task 41390

Процедура СформироватьДвиженияЗаказПоставщику_ПП(ДокОбъект,Стр) Экспорт //ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
	
	Движения = ДокОбъект.Движения;
	
	Движения.ЗаказПоставщику_ПП.Очистить();
	Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	
	Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
	Движение.Период 		= ДокОбъект.Дата;
	Движение.Организация 	= Стр.СчетПоставщика.Организация; 
	Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
	Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
	Движение.СчетПоставщика = Стр.СчетПоставщика;
	Движение.ДопРегистратор	= ДокОбъект.Ссылка;
	
	Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		Движение.Сумма 			= -ДокОбъект.ДокументПоступления.ПолнаяСуммаВСФ;
		
		Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
		Движение.Период 		= ДокОбъект.Дата;
		Движение.Организация 	= Стр.СчетПоставщика.Организация; 
		Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
		Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
		Движение.СчетПоставщика = Стр.СчетПоставщика;
		Движение.ДопРегистратор	= ДокОбъект.Ссылка;
		Движение.Сумма 			= ДокОбъект.СуммаДокумента;
	КонецЕсли;
	
	Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		Движение.Сумма 			= Стр.СуммаНаПТУ;
	КонецЕсли;
	
КонецПроцедуры	

//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
Функция ПолучитьСчетПредыдущегоДокумента( ДокументПоступления ) Экспорт
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщика
	|ИЗ
	|	Документ.КорректировкаПоступления.СвязанныеСчетаПоставщиков КАК КорректировкаПоступленияСвязанныеСчетаПоставщиков
	|ГДЕ
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|ГДЕ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументПоступления);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СчетПоставщика;
		Прервать;
	КонецЦикла;
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, конец
