
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	//Евросиб Каблов 12.08.2022 ( Task 55578
	//Ответственный = Пользователи.ТекущийПользователь();
	//Евросиб Каблов 12.08.2022 )
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьКорректировкуПоступления.Получить();
	//Евросиб - АСуслов 16.03.2023 16:18:57 #65868
	//(
	СтатусДокумента = Перечисления.СтатусыДокументовПоступлений.НаПроверке;
	ДатаПоступленияДокумента = ТекущаяДата();
	//)
	//Евросиб - АСуслов 16.03.2023 16:19:00 #65868
	
//Евросиб (Литвинов 11.05.2021 #30663	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		ИЛИ (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
				ВидОперации = ДанныеЗаполнения.ВидОперации;
			КонецЕсли;
			ДанныеЗаполнения = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
//Евросиб (Литвинов 11.05.2021 #30663   
		//Евросиб - АСуслов 18.08.2022 14:28:30 #55129
		//(
		ИсходныйДокументПоступления = ДанныеЗаполнения.Ссылка;
		//)
		//Евросиб - АСуслов 18.08.2022 14:28:31 #55129

		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "БанковскийСчетКонтрагента, ВалютаДокумента, Грузоотправитель, Грузополучатель, ДоговорКонтрагента,
		|Контрагент, НДСВключенВСтоимость, Организация, ПодразделениеОрганизации, ПоставщикВУ, СуммаВключаетНДС, СуммаДокумента, УчитыватьНДС, ЦФО, ВидУслуг");
		
		ЭтотОбъект.ДокументПоступления = ДанныеЗаполнения.Ссылка;
		
		СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС")+ ДанныеЗаполнения.Услуги.Итог("СуммаНДС");
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			НоваяСтрока.ЦенаДоИзменения 				= ТекСтрокаТовары.Цена;
			НоваяСтрока.СуммаНДСДоИзменения 			= ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.СуммаДоИзменения 				= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СтавкаНДСДоИзменения 			= ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.КоличествоДоИзменения 			= ТекСтрокаТовары.Количество;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			НоваяСтрока.КоличествоДоИзменения	= ТекСтрокаУслуги.Количество;
			НоваяСтрока.СодержаниеДоИзменения 	= ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СтавкаНДСДоИзменения 	= ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СуммаДоИзменения		= ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения		= ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения			= ТекСтрокаУслуги.Цена;
			НоваяСтрока.ВсегоДоИзменения		= ТекСтрокаУслуги.Всего;
			//Евросиб Каблов 13.05.2021 ( Ticket#0222113
			НоваяСтрока.ГУИДстроки 				= Строка(Новый УникальныйИдентификатор);
			//Евросиб Каблов 13.05.2021 ) 
		КонецЦикла;
		
		Для каждого ТекСтр Из ДанныеЗаполнения.СвязанныеСчетаПоставщиков Цикл
		
			НоваяСтрока = СвязанныеСчетаПоставщиков.Добавить();
			
			Если ТипЗнч(ТекСтр.СчетПоставщика) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
				И ТекСтр.СчетПоставщика = ДанныеЗаполнения Тогда
			
				НоваяСтрока.СчетПоставщика = ""; // Т.е. будущая текущая ссылка на корректировку
			
			Иначе
			
				НоваяСтрока.СчетПоставщика = ТекСтр.СчетПоставщика;
			
			КонецЕсли; 
			
		КонецЦикла; 
		
		//в акцепте
		//Для каждого ТекСтрокаРазнесение из ДанныеЗаполнения.Разнесение Цикл
		//	НоваяСтрока = Разнесение.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаРазнесение);
		//КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "БанковскийСчетКонтрагента, ВалютаДокумента, Грузоотправитель, Грузополучатель, ДоговорКонтрагента,
		|Контрагент, НДСВключенВСтоимость, Организация, ПодразделениеОрганизации, ПоставщикВУ, СуммаВключаетНДС, СуммаДокумента, СуммаНДСДокумента, УчитыватьНДС, ЦФО, ВидУслуг");
		
		ЭтотОбъект.ДокументПоступления = ДанныеЗаполнения.Ссылка;  
		//Евросиб - АСуслов 18.08.2022 14:29:02 #
		//(
		ИсходныйДокументПоступления = ДанныеЗаполнения.ИсходныйДокументПоступления;
		//)
		//Евросиб - АСуслов 18.08.2022 14:29:03 #

		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			НоваяСтрока.КоличествоДоИзменения 				= ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоДоКорректировки 			= ТекСтрокаТовары.КоличествоДоИзменения;
			НоваяСтрока.СтавкаНДСДоИзменения 				= ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.СуммаДоИзменения 					= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаДоКорректировки				= ТекСтрокаТовары.СуммаДоИзменения;
			НоваяСтрока.СуммаНДСДоИзменения 				= ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.СуммаНДСДоКорректировки 			= ТекСтрокаТовары.СуммаНДСДоИзменения;
			НоваяСтрока.ЦенаДоИзменения 					= ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаДоКорректировки 				= ТекСтрокаТовары.ЦенаДоИзменения;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			НоваяСтрока.КоличествоДоИзменения 		= ТекСтрокаУслуги.Количество;
			НоваяСтрока.КоличествоДоКорректировки 	= ТекСтрокаУслуги.КоличествоДоИзменения;
			НоваяСтрока.СодержаниеДоИзменения 		= ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СтавкаНДСДоИзменения 		= ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СуммаДоИзменения 			= ТекСтрокаУслуги.Сумма;
			//Евросиб Каблов 21.12.2021 ( Ticket#0253815
			НоваяСтрока.СуммаНДСДоИзменения			= ТекСтрокаУслуги.СуммаНДС;
			//Евросиб Каблов 21.12.2021 )
			НоваяСтрока.ЦенаДоИзменения 			= ТекСтрокаУслуги.Цена;
			//Евросиб - АСуслов 24.05.2021 10:20:20 #0232848
			//(
			//НоваяСтрока.СуммаДоКорректировки 		= ТекСтрокаУслуги.СуммаДоИзменения;
			//НоваяСтрока.СуммаНДСДоКорректировки 	= ТекСтрокаУслуги.СуммаНДСДоИзменения;
			НоваяСтрока.ЦенаДоКорректировки			= ТекСтрокаУслуги.Цена;
			НоваяСтрока.СуммаДоКорректировки 		= ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоКорректировки 	= ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ВсегоДоИзменения			= ТекСтрокаУслуги.Всего;
			НоваяСтрока.РазницаВсегоКорректировки 	= 0;
			НоваяСтрока.РазницаСуммаКорректировки 	= 0;
			НоваяСтрока.РазницаСуммаНДСКорректировки = 0;
			//)
			//Евросиб - АСуслов 24.05.2021 10:20:21 #0232848
		КонецЦикла;
		
		Для каждого ТекСтр Из ДанныеЗаполнения.СвязанныеСчетаПоставщиков Цикл
		
			НоваяСтрока = СвязанныеСчетаПоставщиков.Добавить();
			НоваяСтрока.СчетПоставщика = ТекСтр.СчетПоставщика;
		
		КонецЦикла;
		
		//в акцепте
		//Для каждого ТекСтрокаРазнесение из ДанныеЗаполнения.Разнесение Цикл
		//	НоваяСтрока = Разнесение.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаРазнесение);
		//КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ДокументОснованиеПервичногоСФ = ДанныеЗаполнения.ДокументОснование;
		Если ТипЗнч(ДокументОснованиеПервичногоСФ) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			//Корректировка перевыставленного СФ комитенту
			Если ЗначениеЗаполнено(ДанныеЗаполнения.СчетФактураВыданныйПокупателю) Тогда
				КорректировкаПервичнойРеализации = НайтиКорректировкуРеализации(ДанныеЗаполнения.СчетФактураВыданныйПокупателю.ДокументОснование);
				Если КорректировкаПервичнойРеализации = Неопределено Тогда 
					Сообщить("Не найдена корректировка первичного документа от поставщика!");
					//						Комментарий = "Отказ";
					Возврат;
				Иначе
					ЗаполнитьДокументКорректировкаПоступленияНаОснованииКорректировкиРеализации(ДокументОснованиеПервичногоСФ,ДанныеЗаполнения,КорректировкаПервичнойРеализации);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата());
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьКорректировкуПоступления.Получить();
//Евросиб Гудкова( 02.02.2020 Ticket№ 
	Редактор = Неопределено;
	Изменено = Неопределено;
	ДатаМодификации = Неопределено;
	//Евросиб Каблов 12.08.2022 ( Task 55578
	//Ответственный = Пользователи.ТекущийПользователь();
	Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
	Состояния.Очистить();
	Для каждого Стр из Услуги Цикл
		Стр.ГУИДПТУ = "";
	КонецЦикла;
// Евросиб Гудкова)     
	//Евросиб - АСуслов 24.03.2023 9:42:12 #65868
	//(
	ДатаПоступленияДокумента = ТекущаяДата();
	СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов = Дата(1,1,1);
	//)
	//Евросиб - АСуслов 24.03.2023 9:42:14 #65868

КонецПроцедуры

Процедура ЗаполнитьДокументКорректировкаПоступленияНаОснованииКорректировкиРеализации(ОтчетКомитенту, СчетФактураОснование, Корректировка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	//Гудкова а двумя строчками ниже мы пишем уже другое Организация = Константы.ОсновнаяОрганизация.Получить();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументРеализации = СчетФактураОснование.Ссылка;
	Организация = СчетФактураОснование.Организация;
	Контрагент = СчетФактураОснование.Контрагент;
	ДоговорКонтрагента = СчетФактураОснование.ДоговорКонтрагента;
	ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	ДокументПоступления = СчетФактураОснование.Ссылка;
	СуммаВключаетНДС = Корректировка.СуммаВключаетНДС;
	УчитыватьНДС = Корректировка.УчитыватьНДС;
//	Руководитель = СчетФактураОснование.Руководитель;
//	ГлавныйБухгалтер =  СчетФактураОснование.ГлавныйБухгалтер;
	ВалютаДокумента =  Корректировка.ВалютаДокумента;
	КурсВзаиморасчетов = Корректировка.КурсВзаиморасчетов;
	КратностьВзаиморасчетов = Корректировка.КратностьВзаиморасчетов;
	СуммаДокумента = Корректировка.СуммаДокумента;
	СуммаНДСДокумента = Корректировка.СуммаНДСДокумента;
	//Евросиб Каблов 12.08.2022 ( Task 55578
	//Ответственный = СчетФактураОснование.Ответственный;
	Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
	//ТабЧастьТовары = Корректировка.Товары.Выгрузить();
	//ТабЧастьУслуги = Корректировка.Услуги.Выгрузить();
	ТабЧасть = Корректировка.АгентскиеУслуги.Выгрузить();
	КорректировкаОтчетаКомитенту = Истина;
	СчетФактураВыданныйПокупателю = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Корректировка, "СчетФактураВыданный");
		
	//Если ТабЧастьТовары.Количество() > 0 Тогда
	//	Для каждого Стр из ТабЧастьТовары Цикл
	//		НоваяСтрока = Товары.Добавить();
	//		НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
	//		НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
	//		НоваяСтрока.Количество = Стр.Количество;
	//		НоваяСтрока.Номенклатура = Стр.Номенклатура;
	//		НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
	//		НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
	//		НоваяСтрока.Сумма = Стр.Сумма;
	//		НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
	//		НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
	//		НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
	//		НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
	//		НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
	//		НоваяСтрока.Цена = Стр.Цена;
	//		НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
	//		НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
	//	КонецЦикла;
	//КонецЕсли;
	//Если ТабЧастьУслуги.Количество() > 0 Тогда
	//	Для каждого Стр из ТабЧастьУслуги Цикл
	//		НоваяСтрока = Услуги.Добавить();
	//		НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
	//		НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
	//		НоваяСтрока.Количество = Стр.Количество;
	//		НоваяСтрока.Номенклатура = Стр.Номенклатура;
	//		НоваяСтрока.СодержаниеДоИзменения = Стр.СодержаниеДоИзменения;
	//		НоваяСтрока.Содержание = Стр.Содержание;
	//		НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
	//		НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
	//		НоваяСтрока.Сумма = Стр.Сумма;
	//		НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
	//		НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
	//		НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
	//		НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
	//		НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
	//		НоваяСтрока.Цена = Стр.Цена;
	//		НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
	//		НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
	//	КонецЦикла;
	//КонецЕсли;
	Если ТабЧасть.Количество() > 0 Тогда
		Для каждого Стр из ТабЧасть Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
			НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
			НоваяСтрока.Количество = Стр.Количество;
			НоваяСтрока.Номенклатура = Стр.Номенклатура;
			НоваяСтрока.СодержаниеДоИзменения = Стр.СодержаниеДоИзменения;
			НоваяСтрока.Содержание = Стр.Содержание;
			НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
			НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
			НоваяСтрока.Сумма = Стр.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
			НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
			НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
			НоваяСтрока.Цена = Стр.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
			НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
		КонецЦикла;
	КонецЕсли;
	
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,ТекущаяДата());
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
//	УчитыватьНДС = Организация.УчитыватьНДСВДоку			
КонецПроцедуры

Функция НайтиКорректировкуРеализации(РТУ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КорректировкаРеализации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	                      |ГДЕ
	                      |	КорректировкаРеализации.ДокументРеализации = &ДокументРеализации");	
	Запрос.УстановитьПараметр("ДокументРеализации" ,РТУ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокКорр = Выборка.Ссылка;
	Иначе
		ДокКорр = Неопределено;
	КонецЕсли;
	
	Возврат ДокКорр;

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ++ ДИТ_Агафонов_task 41390
	ДокументПоступленияЗначение = ДокументПоступления;
	Документы.КорректировкаПоступления.ПроверитьДокументПоступление(ДокументПоступленияЗначение, Ссылка, Отказ);
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт,
		|	АктуальныеАкцептыСрезПоследних.Акцепт.СторнируемыйАкцепт КАК АкцептСторнируемыйАкцепт,
		|	АктуальныеАкцептыСрезПоследних.Акцепт.Проведен КАК АкцептПроведен
		|ИЗ
		|	РегистрСведений.АктуальныеАкцепты.СрезПоследних(, Поступление = &Поступление) КАК АктуальныеАкцептыСрезПоследних";
		
		Запрос.УстановитьПараметр("Поступление", Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() 
			и ЗначениеЗаполнено(Выборка.Акцепт) и Не ЗначениеЗаполнено(Выборка.АкцептСторнируемыйАкцепт) Тогда
			ТекстСообщения = СтрШаблон("Для документа существует актуальный %1, отмена проведения невозможна!", Выборка.Акцепт);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;	

	Если не ЭтоНовый() и не РольДоступна("ПолныеПрава") Тогда
		Корректировка = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(Ссылка);
		Если ЗначениеЗаполнено(Корректировка) Тогда
			Отказ = Истина;
			Сообщить("Работа с документом "+Ссылка+" должна происходить через Документ исправления "+Корректировка);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390

	// ++ ДИТ_Агафонов_task 41390 08.03.2023
	Ошибки = "";
	ПроверитьИзмененияКлючевыхДанныхДляАкцепта(Отказ, Ошибки);
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
		Возврат;
	КонецЕсли; 	
	// -- ДИТ_Агафонов_task 41390 08.03.2023
	
	//Евросиб Каблов 12.01.2024 ( Ticket#0330861
	Если Не РольДоступна("ПолныеПрава") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаПоступления.ПометкаУдаления КАК ПометкаУдаления,
		|	Диадок_Документы.Документ КАК Документ,
		|	Диадок_Документы.Статус КАК Статус
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_Документы КАК Диадок_Документы
		|		ПО КорректировкаПоступления.Ссылка = Диадок_Документы.Документ
		|ГДЕ
		|	КорректировкаПоступления.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И Выборка.Статус = "Подписан" Тогда
			
				ОбщегоНазначения.СообщитьПользователю("Невозможно отменить проведение подписанного документа, полученного посредством ЭДО. Обратитесь к ответственному сотруднику",,,, Отказ);
				
			ИначеЕсли Не Выборка.ПометкаУдаления И ПометкаУдаления Тогда
				
				Если ЗначениеЗаполнено(Выборка.Статус) Тогда
					ИсключаемыеСтатусы = Новый Массив;
					ИсключаемыеСтатусы.Добавить("Аннулирован");
					ИсключаемыеСтатусы.Добавить("Отказано в подписи контрагенту");
					Если ИсключаемыеСтатусы.Найти(Выборка.Статус) = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю("Документ, полученный посредством ЭДО, можно удалить из системы после отказа в подписи в ЭДО. Обратитесь к ответственному сотруднику",,,, Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 12.01.2024 )

	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(ДатаСФХЖ) И ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаСФХЖ")) И Год(ДатаСФХЖ) <> Год(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаСФХЖ")) Тогда
		СтатусАкцепта = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка).СтатусРазнесения;
		Если НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта 
			//Евросиб - АСуслов 01.12.2022 9:34:31 #0293662 
			//(
			И НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан Тогда 
			//)
			//Евросиб - АСуслов 01.12.2022 9:34:32 #0293662 
			Отказ = Истина;
			Сообщить("Для документа существует актуальный акцепт. Запрещена смена года для даты совершения факта хоз. жизни");
			Возврат;
		КонецЕсли; 
	КонецЕсли;
 	//Евросиб Литвинов) 	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	//Евросиб - АСуслов 27.06.2022 14:58:52 #
	//(
	ИсправляемыйДокументПоступления = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ДокументПоступления, Истина);	
	//)
	//Евросиб - АСуслов 27.06.2022 14:58:52 #
	
	//Евросиб Каблов 25.11.2021 ( Ticket#0244144
	ВсегоДоКорректировки 	= Услуги.Итог("ВсегоДоКорректировки");
	ВсегоДоКорректировки 	= ?(ВсегоДоКорректировки = 0, Услуги.Итог("ВсегоДоИзменения"), ВсегоДоКорректировки);
	ВсегоПослеКорректировки 	= Услуги.Итог("Всего");
	СуммаКорректировки = ВсегоПослеКорректировки - ВсегоДоКорректировки;
	//Евросиб Каблов 25.11.2021 )
	
#Область Состояния

	ВыполнитьПроверкуПризнакКопия(Отказ,РежимЗаписи); //Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025

	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	//ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	//НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	//Ссылка.Организация <> Организация ИЛИ 
	//Ссылка.Контрагент <> Контрагент ИЛИ
	//Ссылка.Штраф <> Штраф ИЛИ 
	//Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ Состояния.Количество() = 0;
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект);
	//Евросиб Каблов 12.08.2022 )
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
//(Евросиб Максимова 06.04.2021 #0228486 	
		//ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Ссылка);
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", ЭтотОбъект);
//)Евросиб Максимова 06.04.2021 #0228486 	

		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("Штраф", Штраф);
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
		ПараметрыЗапроса.Вставить("Копия", Копия);
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
// Евросиб Гудкова)
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		//Евросиб Каблов 25.11.2021 ( Ticket#0244144 Расчет этих переменных выше
		//ВсегоДоКорректировки 	= ?(Услуги.Итог("ВсегоДоКорректировки")=0, Услуги.Итог("ВсегоДоИзменения"), Услуги.Итог("ВсегоДоКорректировки"));
		//ВсегоПослеКорректировки 	= Услуги.Итог("Всего");	
		//СуммаКорректировки = ВсегоПослеКорректировки - ВсегоДоКорректировки;
		//Евросиб Каблов 25.11.2021 )
		ПараметрыЗапроса.Вставить("СуммаДокумента", СуммаКорректировки  / КратностьВзаиморасчетов * КурсВзаиморасчетов);
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		ПараметрыЗапроса.Вставить("ВидУслуг", ВидУслуг);
		//Евросиб Каблов 12.08.2022 )
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
#КонецОбласти 	

/////////////// Перенесено из ПТУ
	СуммаДокумента = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	// Евросиб Гудкова)
	СуммаРаспределенная = СвязьУслугИСчетов.Итог("ОтнесеннаяСумма");
	СуммаНДСРаспределенная = СвязьУслугИСчетов.Итог("СуммаНДС");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС") + Услуги.Итог("СуммаНДС");
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586 Расчет поля ПолнаяСуммаВСФ происходит в модуле формы
	////Евросиб Каблов 06.10.2020 (
	//Если ПолнаяСуммаВСФ < СуммаДокумента Тогда
	//	ПолнаяСуммаВСФ = СуммаДокумента;
	//КонецЕсли;
	////Евросиб Каблов 06.10.2020 )
	//Евросиб Каблов 12.05.2021 )
	
	//Евросиб Каблов 25.11.2021 ( Ticket#0244144
	Если СуммаКорректировки > 0 Тогда
		Если ПолнаяСуммаВСФ < СуммаДокумента Тогда
			ПолнаяСуммаВСФ = СуммаДокумента;
		КонецЕсли;
	ИначеЕсли СуммаКорректировки < 0 Тогда
		// ++ ДИТ_Агафонов_task 41390 08.02.2023
		//Убираем в коммент - суммма документа может быть меньше! При передаче в ритм в акцепте уменьшается сумма смотри Документы.акцепт.ЗаполнитьИзмененныеСуммыПТУпоАкцепту 
		//Если ПолнаяСуммаВСФ > СуммаДокумента Тогда
		//	ПолнаяСуммаВСФ = СуммаДокумента;
		//КонецЕсли;
		// -- ДИТ_Агафонов_task 41390 08.02.2023
	КонецЕсли;
	//Евросиб Каблов 25.11.2021 )
	
	//Евросиб Каблов 02.10.2020 (
	//СтрокиБезСтавкиНДС = СвязьУслугИСчетов.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка()));
	////Евросиб Каблов 02.10.2020 )
	//Если СуммаДокумента <> СуммаРаспределенная
	//	ИЛИ СуммаНДСДокумента <> СуммаНДСРаспределенная
	//	//Евросиб Каблов 02.10.2020 ( 
	//	Или СтрокиБезСтавкиНДС.Количество() > 0 Тогда
	//	//Евросиб Каблов 02.10.2020 )
	//	СвязьУслугИСчетов.Очистить();
	//	
	//	РазнестиУслугиАвтоматически();	
	//	
	//КонецЕсли;
	
	////////////////////////////// По аналогии из формы документа, команда "Перезаполнить"
	// ++ ДИТ_Агафонов_task 41390
	//Зачем если потом вызываем процедуру РазнестиУслугиАвтоматически в которой	это заново делаем? Убираем в коммент
	//СвязьУслугИСчетов.Очистить();
	//
	//Для каждого СтрУслуги из Услуги Цикл
	//	Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
	//		СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
	//	КонецЕсли;
	//	
	//	СтрНайдена = Ложь;
	//	Для каждого СтрСвязи из СвязьУслугИСчетов Цикл
	//		Если СтрСвязи.ГУИДПТУ = СтрУслуги.ГУИДПТУ Тогда
	//			ЗаполнитьЗначенияСвойств(СтрСвязи, СтрУслуги);
	//			СтрНайдена = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если НЕ СтрНайдена Тогда
	//		
	//		//Евросиб Каблов 16.09.2021 ( Ticket#0243069
	//		//Если (СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоИзменения=0, СтрУслуги.ВсегоДоКорректировки, СтрУслуги.ВсегоДоИзменения)) <> 0 Тогда
	//		ВсегоКорр = СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоКорректировки = 0, СтрУслуги.ВсегоДоИзменения, СтрУслуги.ВсегоДоКорректировки);
	//		Если ВсегоКорр <> 0 Тогда
	//		//Евросиб Каблов 16.09.2021 )
	//			
	//			НСтр = СвязьУслугИСчетов.Добавить();
	//			ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "ГУИДПТУ,СтавкаНДС");
	//			//Евросиб Каблов 16.09.2021 ( Ticket#0243069
	//			//НСтр.Всего 				= СтрУслуги.Всего - ?(СтрУслуги.ВсегоДоИзменения=0, СтрУслуги.ВсегоДоКорректировки, СтрУслуги.ВсегоДоИзменения);
	//			НСтр.Всего = ВсегоКорр;
	//			//НСтр.ОтнесеннаяСумма 	= НСтр.Всего;
	//			//Евросиб Каблов 16.09.2021 ( Ticket#0243069
	//			//НСтр.СуммаНДС 			= СтрУслуги.СуммаНДС - СтрУслуги.СуммаНДСДоИзменения;
	//			НСтр.СуммаНДС 			= СтрУслуги.СуммаНДС - ?(СтрУслуги.СуммаНДСДоКорректировки = 0, СтрУслуги.СуммаНДСДоИзменения, СтрУслуги.СуммаНДСДоКорректировки);
	//			//Евросиб Каблов 16.09.2021 )
	//			
	//		КонецЕсли; 
	//		//НСтр.Всего = СтрУслуги.Всего;
	//		//НСтр.СуммаНДС = СтрУслуги.СуммаНДС;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	// -- ДИТ_Агафонов_task 41390
	РазнестиУслугиАвтоматически(); // Разнесение счета поставщика
	
	
	//Для каждого Стр из Услуги Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.ГУИДПТУ) Тогда Стр.ГУИДПТУ = Строка(Новый УникальныйИдентификатор); КонецЕсли;
	//КонецЦикла;
	
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		Если НЕ ЗначениеЗаполнено(Стр.СчетПоставщика) Тогда
			РезСсылка = неопределено;
			Если Ссылка.Пустая() Тогда
				//Евросиб Каблов 27.01.2021 (
				НовСсылка = ПолучитьСсылкуНового();
				Если Не ЗначениеЗаполнено(НовСсылка) Тогда
				//Евросиб Каблов 27.01.2021 )
					ГУИД = Новый УникальныйИдентификатор;
					НовСсылка = Документы.КорректировкаПоступления.ПолучитьСсылку(ГУИД);
					ЭтотОбъект.УстановитьСсылкуНового(НовСсылка);
				КонецЕсли;				
				Стр.СчетПоставщика = НовСсылка;
				РезСсылка = НовСсылка;
			Иначе
				Стр.СчетПоставщика = Ссылка;
				РезСсылка = Ссылка;
			КонецЕсли;
			Для каждого Стр из СвязьУслугИСчетов Цикл
				Если НЕ ЗначениеЗаполнено(стр.СчетПоставщика) тогда
					стр.СчетПоставщика = РезСсылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// А это чтобы не было дублей!
	ТЗ = СвязанныеСчетаПоставщиков.Выгрузить();
	ТЗ.Свернуть("СчетПоставщика", "СуммаНаПТУ");
	
	СвязанныеСчетаПоставщиков.Загрузить( ТЗ );
/////////////// Перенесено из ПТУ
	
	//Евросиб Гудкова( 16.01.2020) изменен Шейко О.Е. (22.12.2020)
	КоррПТУМодифицированДляВыгрузки = Ложь;
	Если Не Ссылка.Пустая() Тогда
		ПрошлаяВыгрузка = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Если ЗначениеЗаполнено(ПрошлаяВыгрузка.Ссылка) Тогда
			КоррПТУМодифицированДляВыгрузки = ПроверитьРеквизитыКоррПТУНаИзменение("ВидОперации,ДатаВходящегоДокумента,НомерВходящегоДокумента,ДатаПересчета,ДоговорКонтрагента,Контрагент,Организация,ПоставщикВУ,СуммаДокумента");
			//ДатаИсправления,НомерИсправления,ДатаИсправленияИсходногоДокумента,НомерИсправленияИсходногоДокумента,ДатаИсходногоДокумента,НомерИсходногоДокумента,ДатаВходящегоДокумента,НомерВходящегоДокумента,ДатаПересчета,ДоговорКонтрагента,Контрагент,ДокументПоступления,ИсправляемыйДокументПоступления,Копия,Организация,ПоставщикВУ,СуммаДокумента,СуммаНДСДокумента");
			Если КоррПТУМодифицированДляВыгрузки Тогда
				ДатаМодификации = ТекущаяДата();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	// Евросиб Гудкова) 
	//++ Глеков Д.В. Ticket#0247297 27.01.2022
	ИзменитьПризнакАвторазнесенияВОсновании(РежимЗаписи);
	//-- Глеков Д.В. Ticket# 27.01.2022 
	//Евросиб - АСуслов 17.03.2023 14:18:53 #65868
	//(
	Если НЕ ЗначениеЗаполнено(СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов) Тогда
		Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Копия") = Истина
			И Копия = Ложь Тогда
			ДатаПоступленияДокумента = ТекущаяДата();
			Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.03.2023 14:18:55 #65868  
	
	// Евросиб(ДИТ) US 56866 ТА 85906 Сержантова А.С. Начало: 05.07.2024
	// работа с документом завершена, можно закрывать темы Диалогов, связанных с документом
	Если не Отказ и РазрешенаВыгрузкаВУПП Тогда 
		СобытияЗакрытияДиалога = Новый Массив;
		СобытияЗакрытияДиалога.Добавить(Перечисления.СобытияЗакрытияДиалогов.РазрешенаВыгрузкаВУПП);
		Диалоги_сервер.НайтиИЗакрытьТемуПоСобытию(Ссылка, СобытияЗакрытияДиалога)
	КонецЕсли;
	// Евросиб(ДИТ) US 56866 ТА 85906 Сержантова А.С. Конец: 05.07.2024 
	
	//Евросиб СубботинВ #118799 09.10.2025 Начало 
	ТчУслуг = Услуги.Выгрузить();
	ТчУслугСсылка = Ссылка.Услуги.Выгрузить();
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение и НЕ ОбщегоНазначения.КоллекцииИдентичны(ТчУслуг, ТчУслугСсылка) и Услуги.Итог("РазницаВсегоКорректировки") > 0 Тогда
		Справочники.ФиксацияИзмененийСчетаПоступления.ЗафиксироватьИзменнияПоступления(ТчУслуг, ИсходныйДокументПоступления, ДополнительныеСвойства);
	КонецЕсли;	
    //Евросиб СубботинВ #118799 09.10.2025 Конец

КонецПроцедуры

//++ Глеков Д.В. Ticket#0247297 27.01.2022  
Процедура ИзменитьПризнакАвторазнесенияВОсновании(РежимЗаписи)
	Если ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки ИЛИ ОбменДанными.Загрузка = ИСТИНА Тогда
	
		Возврат;
	
	КонецЕсли;                                                                                                         
	//Евросиб - АСуслов 21.11.2022 10:18:35 #58550
	//(
	//АвторазнесениеПоОснованию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "ВОчередиАвторазнесения");
	АвторазнесениеПоОснованию = ПретензииИНеакцептыСервер.ДокументНаходитсяВОчередиАвторазнесения(ДокументПоступления);
	ВОчередиАвторазнесения = ПретензииИНеакцептыСервер.ДокументНаходитсяВОчередиАвторазнесения(Ссылка);
	//)
	//Евросиб - АСуслов 21.11.2022 10:18:36 #
	ПараметрыПроцедуры = Новый Массив;	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И АвторазнесениеПоОснованию И Не ВОчередиАвторазнесения Тогда//снимаем признак в основании и устанавливаем в документе
	
		//УдалитьВОчередиАвторазнесения = ИСТИНА;
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(ДокументПоступления);
		ПараметрыПроцедуры.Добавить(МассивДокументов);
		ПараметрыПроцедуры.Добавить(ЛОЖЬ);
		ПретензииИНеакцептыСервер.ИсключитьИзОчередиАвторазнесения(ДокументПоступления);
		ПретензииИНеакцептыСервер.ЗаписьДанныхОчередиАвторазнесения(Ссылка, Ложь);   
		// ++ ДИТ_Агафонов_task 41390 09.02.2023
		СтатусРазнесенияКорректировка = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка).СтатусРазнесения;
		ПретензииИНеакцептыСервер.ЗаписьДанныхОчередиАвторазнесения(Ссылка, Ложь, СтатусРазнесенияКорректировка, ТекущаяДата());
		// -- ДИТ_Агафонов_task 41390 09.02.2023
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
        // ++ ДИТ_Агафонов_task 41390 09.02.2023
		//Из авторазнесения всегда убираем при отмене проведения
		//И АвторазнесениеПоОснованию = ЛОЖЬ
		// -- ДИТ_Агафонов_task 41390 09.02.2023
		И ВОчередиАвторазнесения Тогда//Снимаем признак в документе и устанавливаем в основании
		
		//УдалитьВОчередиАвторазнесения = ЛОЖЬ;
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(ДокументПоступления);
		ПараметрыПроцедуры.Добавить(МассивДокументов);
		ПараметрыПроцедуры.Добавить(ИСТИНА);
		ПретензииИНеакцептыСервер.ИсключитьИзОчередиАвторазнесения(Ссылка);
		ПретензииИНеакцептыСервер.ЗаписьДанныхОчередиАвторазнесения(ДокументПоступления, Ложь);
		// ++ ДИТ_Агафонов_task 41390 09.02.2023
		СтатусРазнесенияПоступление = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ДокументПоступления).СтатусРазнесения;
		ПретензииИНеакцептыСервер.ЗаписьДанныхОчередиАвторазнесения(ДокументПоступления, Ложь, СтатусРазнесенияПоступление, ТекущаяДата());
		// -- ДИТ_Агафонов_task 41390 09.02.2023
	КонецЕсли;
	//Если ПараметрыПроцедуры.Количество() > 0 Тогда
	//
	//	ФоновыеЗадания.Выполнить("ПретензииИНеакцептыСервер.ПроставитьПТУОтметкуВОчереди", ПараметрыПроцедуры,, "Изменение авторазнесения по основанию корректировки поступления");
	//
	//КонецЕсли;
КонецПроцедуры
//-- Глеков Д.В. Ticket#0247297 27.01.2022

Процедура ПриЗаписи(Отказ)
	
//Евросиб Гудкова( 07.04.2021 Ticket№ 0228683
//было
	//Отбор = Новый Структура("ПометкаУдаления", Ложь) ;
	//Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураПолученный",,Отбор);
	//Если СчетФактура<>Неопределено Тогда
	//	ОбСчФ = Счетфактура.ПолучитьОбъект();
	//	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
	//	ОбСчФ.Записать();
	//КонецЕсли;
//стало как в ПТУ
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураПолученный");
	Если СчетФактура <> Неопределено Тогда
		ОбСчФ = Счетфактура.ПолучитьОбъект();
		Если ПометкаУдаления Тогда
			Если Не ОбСчФ.ПометкаУдаления Тогда
				ОбСчф.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Иначе
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
		КонецЕсли;
		
		Если НЕ ОбСчФ.ПометкаУдаления Тогда
			Если Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				Если ОбСчФ.Проведен Тогда
					РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Отменено проведение %1",
					ОбСчФ.Ссылка));
				Иначе
					РежимЗаписи = РежимЗаписиДокумента.Запись;
				КонецЕсли; 
			КонецЕсли; 
			ОбСчФ.Записать(РежимЗаписи);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Документ %1 помечен на удаление, ",
			ОбСчФ.Ссылка));
		КонецЕсли; 
	КонецЕсли;
// Евросиб Гудкова) 	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//Евросиб Гудкова( 02.02.2020
//проверки
	СуммаПоСчетам = СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	//Если СуммаДокумента - Услуги.Итог("ВсегоДоИзменения") <> СуммаПоСчетам Тогда
	////Если СуммаДокумента <> СуммаПоСчетам Тогда
	//	//Сообщить("Сумма документа " + (СуммаДокумента - Услуги.Итог("ВсегоДоИзменения")) + " должна соответствовать сумме привязанных счетов поставщиков "+СуммаПоСчетам+"! Вы можете записать документ, но проведение запрещено!");
	//	Сообщить("Сумма документа " + (СуммаДокумента) + " должна соответствовать сумме привязанных счетов поставщиков "+СуммаПоСчетам+"! Вы можете записать документ, но проведение запрещено!");
	//	Отказ = Истина;
	//КонецЕсли;
	
	//Евросиб Коханенко Н.А. 19.10.2023 (( #76425 
	КорректировкиПТУСервер.КонтрольОтрицательныхОстатковПоПривязаннымСчетам(Ссылка, Отказ);
	//Евросиб Коханенко Н.А. 19.10.2023 )) #76425 

	//Евросиб Каблов 19.08.2021 ( Ticket#0240403
	//Если ПолнаяСуммаВСФ - Услуги.Итог("ВсегоДоИзменения") <> СуммаПоСчетам Тогда
	//	ТекстСообщения = СтрШаблон("Разница с Полной суммой ВСФ %1 должна соответствовать сумме привязанных счетов поставщиков %2!", ПолнаяСуммаВСФ - Услуги.Итог("ВсегоДоИзменения"), СуммаПоСчетам);
	ВсегоДоКорр 	= ?(Услуги.Итог("ВсегоДоКорректировки")=0, Услуги.Итог("ВсегоДоИзменения"), Услуги.Итог("ВсегоДоКорректировки"));
	//Евросиб Каблов 25.11.2021 ( Ticket#0244144
	//Если Услуги.Итог("Всего") - ВсегоДоКорр <> СуммаПоСчетам Тогда
	Если ПолнаяСуммаВСФ - ВсегоДоКорр <> СуммаПоСчетам Тогда
	//Евросиб Каблов 25.11.2021 )
		//ТекстСообщения = СтрШаблон("Общая Разница с суммой ВСФ %1 должна соответствовать сумме привязанных счетов поставщиков %2!", Услуги.Итог("Всего") - ВсегоДоКорр, СуммаПоСчетам);
		//ДИТ, Беляев СЮ, Ticket#0288658, 14-10-2022, начало
		ТекстСообщения = СтрШаблон("Общая Разница с суммой ВСФ %1 должна соответствовать сумме привязанных счетов поставщиков %2!", ПолнаяСуммаВСФ - ВсегоДоКорр, СуммаПоСчетам);
		//ДИТ, Беляев СЮ, Ticket#0288658, 14-10-2022, конец
	//Евросиб Каблов 19.08.2021 )
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	//Евросиб Каблов 12.05.2021 )
	
	СуммаРаспределенная = СвязьУслугИСчетов.Итог("ОтнесеннаяСумма");
	СуммаНДСРаспределенная = СвязьУслугИСчетов.Итог("СуммаНДС");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС") + Услуги.Итог("СуммаНДС");
	//Евросиб Каблов 12.05.2021 ( Ticket#0230586
	//Если СуммаДокумента - Услуги.Итог("ВсегоДоИзменения") <> СуммаРаспределенная Тогда
	//	Сообщить("Сумма документа "+(СуммаДокумента - Услуги.Итог("ВсегоДоИзменения"))+" должна соответствовать сумме услуг, распределенной на счета поставщиков "+СуммаРаспределенная+"! Вы можете записать документ, но проведение запрещено!");
	//	Отказ = Истина;
	//КонецЕсли;
	
	//Евросиб Каблов 19.08.2021 ( Ticket#0240403
	//Если ПолнаяСуммаВСФ - Услуги.Итог("ВсегоДоИзменения") <> СуммаРаспределенная Тогда
	//	ТекстСообщения = СтрШаблон("Разница с Полной суммой ВСФ %1 должна соответствовать сумме услуг, распределенной на счета поставщиков  %2!", ПолнаяСуммаВСФ - Услуги.Итог("ВсегоДоИзменения"), СуммаРаспределенная);
	Если Услуги.Итог("Всего") - ВсегоДоКорр <> СуммаРаспределенная Тогда
		ТекстСообщения = СтрШаблон("Общая Разница с суммой ВСФ %1 должна соответствовать сумме услуг, распределенной на счета поставщиков  %2!", Услуги.Итог("Всего") - ВсегоДоКорр, СуммаРаспределенная);
	//Евросиб Каблов 19.08.2021 )
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	//Евросиб Каблов 12.05.2021 )
	
	//Евросиб Каблов 16.09.2021 ( Ticket#0243069	
	//Если СуммаНДСДокумента - Услуги.Итог("СуммаНДСДоИзменения") <> СуммаНДСРаспределенная Тогда
	//	Сообщить("Сумма НДС документа " + (СуммаНДСДокумента - Услуги.Итог("СуммаНДСДоИзменения")) +" должна соответствовать сумме НДС услуг, распределенной на счета поставщиков "+СуммаНДСРаспределенная+"! Вы можете записать документ, но проведение запрещено!");
	//	Отказ = Истина;
	//КонецЕсли;
	НДСДоКорр = ?(Услуги.Итог("СуммаНДСДоКорректировки") = 0, Услуги.Итог("СуммаНДСДоИзменения"), Услуги.Итог("СуммаНДСДоКорректировки"));	
	Если СуммаНДСДокумента - НДСДоКорр <> СуммаНДСРаспределенная Тогда
		ТекстСообщения = СтрШаблон("Сумма НДС (разница) документа %1 должна соответствовать сумме НДС услуг, распределенной на счета поставщиков   %2!", СуммаНДСДокумента - НДСДоКорр, СуммаНДСРаспределенная);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	//Евросиб Каблов 16.09.2021 )
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, Новый Структура("ДокументПоступления, Контрагент, ДоговорКонтрагента, ПодразделениеОрганизации, ЦФО"), Отказ); 
	СтруктураУслуг = Новый Структура("Номенклатура, Содержание");
	Если УчитыватьНДС Тогда
		СтруктураУслуг.Вставить("СтавкаНДС");
	КонецЕсли; 
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураУслуг, Отказ); 
	// Разнесенная сумма
	//ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
	//Движения.ЗаказПоставщику_ПП.Очистить();
	//Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	//ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Конец
	
	Движения.ПривязанныеСчетаПоставщиков.Очистить();
	Движения.ПривязанныеСчетаПоставщиков.Записывать = Истина;
	//Взаиморасчеты с поставщиками
	Движения.ВзаиморасчетыСПоставщиками.Очистить();
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	
	// Евросиб Фролов (04.04.2022 Task №49392
	СтатусыВзаиморасчетов = Документы.ПоступлениеТоваровУслуг.ОпределитьСтатусДляВзаиморасчетов(Ссылка);
	// Евросиб Фролов)
		
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		
		//Если НЕ ТипЗнч(Стр.СчетПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда Продолжить; КонецЕсли;
		Если Стр.СчетПоставщика = Ссылка Тогда
			
			// ПривязанныеСчетаПоставщиков
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьПриход();
			Движение.Период 		= Дата;
			Движение.Организация 	= Стр.СчетПоставщика.Организация; 
			Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
			Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор	= Ссылка;
			
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
			Движение.Период 		= Дата;
			Движение.Организация 	= Стр.СчетПоставщика.Организация; 
			Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
			Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор	= Ссылка;
			
			//ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
			//// ЗаказПоставщику_ПП
			//Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
			//Движение.Период 		= Дата;
			//Движение.Организация 	= Стр.СчетПоставщика.Организация; 
			//Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
			//Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
			//Движение.СчетПоставщика = Стр.СчетПоставщика;
			//Движение.Сумма 			= Стр.СуммаНаПТУ;
			//Движение.ДопРегистратор	= Ссылка;
			//ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Конец
			
			Документы.КорректировкаПоступления.СформироватьДвиженияЗаказПоставщику_ПП(ЭтотОбъект,Стр); //ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
			
		ИначеЕсли ТипЗнч(Стр.СчетПоставщика) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда //ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
			
			Документы.КорректировкаПоступления.СформироватьДвиженияЗаказПоставщику_ПП(ЭтотОбъект,Стр); //ДИТ Шевченко А.В. US 58086 ТА 69951 20.07.2023 -Начало
			
		ИначеЕсли ТипЗнч(Стр.СчетПоставщика) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда //ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
			
			Документы.КорректировкаПоступления.СформироватьДвиженияЗаказПоставщику_ПП(ЭтотОбъект,Стр); //ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
			
		ИначеЕсли ЗначениеЗаполнено( Стр.СчетПоставщика ) И ТипЗнч(Стр.СчетПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
			Движение.Период 		= Дата;
			Движение.Организация 	= Стр.СчетПоставщика.Организация; 
			Движение.Контрагент		= Стр.СчетПоставщика.Контрагент; 
			Движение.Договор		= Стр.СчетПоставщика.ДоговорКонтрагента; 
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор	= Ссылка;
			
			Документы.КорректировкаПоступления.СформироватьДвиженияЗаказПоставщику_ПП(ЭтотОбъект,Стр); //ДИТ, Беляев СЮ, US 58086 / TA 68093, 11-08-2023, начало
			
		КонецЕсли; 
		
//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
		Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Контрагент 	= Контрагент;
		Движение.Договор 		= ДоговорКонтрагента;
		Движение.ДокументВзаиморасчетов = Стр.СчетПоставщика;
		
		// Евросиб Фролов (04.04.2022 Task №49392
		Движение.СогласованаСуммаПТУ = СтатусыВзаиморасчетов.СогласованаСуммаПТУ;
		Движение.ЗавершенаПроверкаПТУ = СтатусыВзаиморасчетов.ЗавершенаПроверкаПТУ;
		Движение.РазрешенаВыгрузкаПТУ = РазрешенаВыгрузкаВУПП;
		// Евросиб Фролов)
		
		Движение.СуммаБезНДС 	= Стр.СуммаНаПТУ;
		Движение.СуммаНДС 		= 0;
		Движение.СуммаСНДС 		= Стр.СуммаНаПТУ;
		Движение.ДатаРасчетов 	= ДатаВходящегоДокумента;
		Движение.ДопРегистратор	= Ссылка;
		//Евросиб Гудкова)
	КонецЦикла;
	
//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
	//МассивСуммПоСчетам = ПолучитьСуммыИзТаблицыСоответствия();
	//Для каждого Эл из МассивСуммПоСчетам Цикл  
	//	
	//	Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
	//	Движение.Период 		= Дата;
	//	Движение.Организация 	= Организация;
	//	Движение.Контрагент 	= Контрагент;
	//	Движение.Договор 		= ДоговорКонтрагента;
	//	Движение.ДокументВзаиморасчетов = Эл.СчетПоставщика;
	//	//Движение.ВалютаРасчетов = ВалютаДокумента;
	//	Движение.СуммаБезНДС 	= Эл.СуммаИтого - Эл.СуммаНДС;
	//	Движение.СуммаНДС 		= Эл.СуммаНДС;
	//	Движение.СуммаСНДС 		= Эл.СуммаИтого;
	//	Движение.ДатаРасчетов 	= Дата;
	//	Движение.ДопРегистратор	= Ссылка;
	//	
	//КонецЦикла;
//Евросиб Гудкова)
//было	
	////Взаиморасчеты с поставщиками
	//Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	//Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
	//Движение.Период = Дата;
	//Движение.ВалютаРасчетов = ВалютаДокумента;
	//Движение.ДатаРасчетов = Дата;
	//Движение.Договор = ДоговорКонтрагента;
	//Движение.ДокументВзаиморасчетов = Ссылка;
	//Движение.Контрагент = Контрагент;
	//Движение.Организация = Организация;
	//Движение.СуммаБезНДС = Товары.Итог("Сумма")+Услуги.Итог("Сумма");
	//Движение.СуммаНДС = Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС");
	//Движение.СуммаСНДС = ?(СуммаВключаетНДС,Товары.Итог("Сумма")+Услуги.Итог("Сумма"),Товары.Итог("Сумма")+Услуги.Итог("Сумма")+Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС"));
	//
	////Взаиморасчеты с поставщиками
	//Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	//Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
	//Движение.Период = Дата;
	//Движение.ВалютаРасчетов = ВалютаДокумента;
	//Движение.ДатаРасчетов = Дата;
	//Движение.Договор = ДоговорКонтрагента;
	//Движение.ДокументВзаиморасчетов = Ссылка;
	//Движение.Контрагент = Контрагент;
	//Движение.Организация = Организация;
	//Движение.СуммаБезНДС = Товары.Итог("СуммаДоИзменения")+Услуги.Итог("СуммаДоИзменения");
	//Движение.СуммаНДС = Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения");
	//Движение.СуммаСНДС = ?(СуммаВключаетНДС,Товары.Итог("СуммаДоИзменения")+Услуги.Итог("СуммаДоИзменения"),Товары.Итог("СуммаДоИзменения")+Услуги.Итог("СуммаДоИзменения")+Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения"));
//Евросиб Гудкова)

//Евросиб Каблов М.Б. 19.11.2019 (
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекущаяДата());
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);

	//Закупки
	Движения.Закупки.Очистить();
	Закупки = Движения.Закупки;
	Закупки.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Движение = Закупки.Добавить();
		Движение.Период = Дата;
		
		//Измерения
		Движение.ДокументЗакупки = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		//Движение.Сделка = Сделка;
		//Движение.Продукт = 
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		
		//Ресурсы
		КоличествоИзменение = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоИзменения;
		СуммаИзменение = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоИзменения;
		СуммаНДСИзменение = СтрокаТЧ.СуммаНДС - СтрокаТЧ.СуммаНДСДоИзменения;
		
		Движение.Количество = КоличествоИзменение;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СуммаИзменение, СуммаИзменение + СуммаНДСИзменение);			
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаНДСИзменение, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		
		Движение = Закупки.Добавить();
		Движение.Период = Дата;
		
		//Измерения
		Движение.ДокументЗакупки = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		//Движение.Сделка = Сделка;
		//Движение.Продукт = 
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		
		//Ресурсы
		КоличествоИзменение = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоИзменения;
		СуммаИзменение = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоИзменения;
		СуммаНДСИзменение = СтрокаТЧ.СуммаНДС - СтрокаТЧ.СуммаНДСДоИзменения;
		
		Движение.Количество = КоличествоИзменение;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СуммаИзменение, СуммаИзменение + СуммаНДСИзменение);			
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаНДСИзменение, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
	КонецЦикла;
	//Евросиб Каблов М.Б. 19.11.2019 )

//Евросиб Гудкова( 04.06.2020 в акцепте
	//// ЗакрытиеПериодов
	//Движения.ЗакрытиеПериодов.Записывать = Истина;
	//Для каждого Стр из Разнесение Цикл
	//	
	//	//Запрос = Новый Запрос;
	//	//Запрос.Текст = "ВЫБРАТЬ
	//	//               |	ЗакрытиеПериодовОстатки.ПланФакт КАК ПланФакт,
	//	//               |	ЗакрытиеПериодовОстатки.ПериодВО КАК ПериодВО,
	//	//               |	ЗакрытиеПериодовОстатки.Корректировка КАК Корректировка,
	//	//               |	ЗакрытиеПериодовОстатки.Сделка КАК Сделка,
	//	//               |	ЗакрытиеПериодовОстатки.Услуга КАК Услуга,
	//	//               |	ЗакрытиеПериодовОстатки.Контрагент КАК Контрагент,
	//	//               |	ЗакрытиеПериодовОстатки.Договор КАК Договор,
	//	//               |	ЗакрытиеПериодовОстатки.ГУИДСтроки КАК ГУИДСтроки,
	//	//               |	ЗакрытиеПериодовОстатки.ГУИДДоходов КАК ГУИДДоходов,
	//	//               |	ЗакрытиеПериодовОстатки.Организация КАК Организация,
	//	//               |	ЗакрытиеПериодовОстатки.СуммаДоходаОстаток КАК СуммаДоходаОстаток,
	//	//               |	ЗакрытиеПериодовОстатки.СуммаРасходаОстаток КАК СуммаРасходаОстаток,
	//	//               |	ЗакрытиеПериодовОстатки.Перевыставляемая КАК Перевыставляемая
	//	//               |ИЗ
	//	//               |	РегистрНакопления.ЗакрытиеПериодов.Остатки(
	//	//               |			,
	//	//               |			ГУИДСтроки = &ГУИДСтроки
	//	//               |				И Сделка = &Сделка) КАК ЗакрытиеПериодовОстатки
	//	//               |ГДЕ
	//	//               |	ЗакрытиеПериодовОстатки.СуммаРасходаОстаток > 0";
	//	//Запрос.УстановитьПараметр("Сделка", Стр.Сделка);
	//	//Запрос.УстановитьПараметр("ГУИДСтроки", Стр.СтрокаРасходов);
	//	//Ответ = Запрос.Выполнить().Выбрать();
	//	//Если Ответ.Следующий() Тогда
	//	//	
	//	//	ДвижениеСторно = Движения.ЗакрытиеПериодов.ДобавитьРасход();
	//	//	ЗаполнитьЗначенияСвойств(ДвижениеСторно, Ответ);
	//	//	ДвижениеСторно.Период = ПериодВО;
	//	//	ДвижениеСторно.СуммаРасхода = Мин(Ответ.СуммаРасходаОстаток, Стр.СуммаИтого);
	//		
	//		Движение 					= Движения.ЗакрытиеПериодов.ДобавитьПриход();
	//		Движение.ГУИДСтроки 		= Стр.СтрокаРасходов;
	//		Движение.Договор 			= ДоговорКонтрагента;
	//		Движение.Контрагент 		= Контрагент;
	//		Движение.Организация 		= Организация;
	//		Движение.Период				= ПериодВО;
	//		Движение.ПериодВО			= НачалоМесяца(ПериодВО);
	//		Движение.ПланФакт			= Перечисления.ПланФактСчет.Факт;
	//		Движение.Регистратор		= Ссылка;
	//		Движение.Сделка				= Стр.Сделка;
	//		Движение.СуммаРасхода		= Стр.СуммаИтого;
	//		Движение.Услуга				= Стр.СделкаНоменклатура;
	//		Движение.Корректировка		= Ссылка;
	//		
	//		Для каждого ПИДЖЕЙ1 из Услуги Цикл
	//			Если Стр.ГУИДПТУ = ПИДЖЕЙ1.ГУИДПТУ Тогда
	//				Движение.Перевыставляемая = ПИДЖЕЙ1.Перевыставление;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		
	//	//Иначе
	//	//	
	//	//	ЗапросДохода = Новый Запрос;
	//	//	ЗапросДохода.Текст = "ВЫБРАТЬ
	//	//	                     |	ЗакрытиеПериодовОбороты.ПланФакт КАК ПланФакт,
	//	//	                     |	ЗакрытиеПериодовОбороты.ПериодВО КАК ПериодВО,
	//	//	                     |	ЗакрытиеПериодовОбороты.Корректировка КАК Корректировка,
	//	//	                     |	ЗакрытиеПериодовОбороты.Сделка КАК Сделка,
	//	//	                     |	ЗакрытиеПериодовОбороты.Услуга КАК Услуга,
	//	//	                     |	ЗакрытиеПериодовОбороты.Контрагент КАК Контрагент,
	//	//	                     |	ЗакрытиеПериодовОбороты.Договор КАК Договор,
	//	//	                     |	ЗакрытиеПериодовОбороты.ГУИДСтроки КАК ГУИДСтроки,
	//	//	                     |	ЗакрытиеПериодовОбороты.ГУИДДоходов КАК ГУИДДоходов,
	//	//	                     |	ЗакрытиеПериодовОбороты.Организация КАК Организация,
	//	//	                     |	ЗакрытиеПериодовОбороты.СуммаДоходаПриход КАК СуммаДоходаПриход,
	//	//	                     |	ЗакрытиеПериодовОбороты.СуммаРасходаПриход КАК СуммаРасходаПриход,
	//	//	                     |	ЗакрытиеПериодовОбороты.Перевыставляемая КАК Перевыставляемая
	//	//	                     |ИЗ
	//	//	                     |	РегистрНакопления.ЗакрытиеПериодов.Обороты(
	//	//	                     |			,
	//	//	                     |			,
	//	//	                     |			,
	//	//	                     |			ГУИДСтроки = &ГУИДСтроки
	//	//	                     |				И Сделка = &Сделка) КАК ЗакрытиеПериодовОбороты
	//	//	                     |ГДЕ
	//	//	                     |	ЗакрытиеПериодовОбороты.СуммаРасходаПриход > 0";
	//	//	ЗапросДохода.УстановитьПараметр("Сделка", Стр.Сделка);
	//	//	ЗапросДохода.УстановитьПараметр("ГУИДСтроки", Стр.СтрокаРасходов);
	//	//	ОтветДохода = ЗапросДохода.Выполнить().Выбрать();
	//	//	Если ОтветДохода.Следующий() Тогда
	//	//		
	//	//		ДвижениеСторно = Движения.ЗакрытиеПериодов.ДобавитьРасход();
	//	//		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ОтветДохода);
	//	//		ДвижениеСторно.Период = ПериодВО;
	//	//		ДвижениеСторно.СуммаРасхода = ОтветДохода.СуммаРасходаПриход;
	//	//		
	//	//		Движение 					= Движения.ЗакрытиеПериодов.ДобавитьПриход();
	//	//		Движение.ГУИДСтроки 		= Стр.СтрокаРасходов;
	//	//		Движение.Договор 			= ДоговорКонтрагента;
	//	//		Движение.Контрагент 		= Контрагент;
	//	//		Движение.Организация 		= Организация;
	//	//		Движение.Период				= ПериодВО;
	//	//		Движение.ПериодВО			= НачалоМесяца(ПериодВО);
	//	//		Движение.ПланФакт			= Перечисления.ПланФактСчет.Факт;
	//	//		Движение.Регистратор		= Ссылка;
	//	//		Движение.Сделка				= Стр.Сделка;
	//	//		Движение.СуммаРасхода		= Стр.СуммаИтого;
	//	//		Движение.Услуга				= Стр.СделкаНоменклатура;
	//	//		
	//	//		Для каждого ПИДЖЕЙ1 из Услуги Цикл
	//	//			Если Стр.ГУИДПТУ = ПИДЖЕЙ1.ГУИДПТУ Тогда
	//	//				Движение.Перевыставляемая = ПИДЖЕЙ1.Перевыставление;
	//	//				Прервать;
	//	//			КонецЕсли;
	//	//		КонецЦикла;

	//	//		
	//	//	КонецЕсли;
	//	//	
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	// Евросиб Гудкова)
	
	//Евросиб СубботинВ #118799 09.10.2025 Начало
	Движения.ЗаявкиНаОплату.Очистить();
	Движения.ЗаявкиНаОплату.Записывать = Истина; 
	ЗаявкиНаОплату  = Движения.ЗаявкиНаОплату;
	
	ИтогиСвязиСчетов = СвязьУслугИСчетов.Выгрузить();
	ИтогиСвязиСчетов.Свернуть("СчетПоставщика, СтавкаНДС", "СуммаНДС, ОтнесеннаяСумма");
	
	Для Каждого СтрокаИтогов из ИтогиСвязиСчетов Цикл 	
		Если СтрокаИтогов.ОтнесеннаяСумма > 0 Тогда
			Движение = ЗаявкиНаОплату.ДобавитьПриход(); 
		Иначе
			Движение = ЗаявкиНаОплату.ДобавитьРасход(); 
		КонецЕсли; 
		Движение.Период 				= Дата;
		Движение.ОснованиеДляПлатежа 	= ИсходныйДокументПоступления;
		Движение.Валюта    				= ВалютаДокумента;
		Движение.СуммаНДС 				= Макс(СтрокаИтогов.СуммаНДС, -СтрокаИтогов.СуммаНДС);
		Движение.Сумма    				= Макс(СтрокаИтогов.ОтнесеннаяСумма, -СтрокаИтогов.ОтнесеннаяСумма);
		Движение.СтавкаНДС 				= СтрокаИтогов.СтавкаНДС;;
	КонецЦикла;	
	//Евросиб СубботинВ #118799 09.10.2025 Конец
	
	
	
КонецПроцедуры

//Евросиб Гудкова( 16.01.2020 
Функция ПроверитьРеквизитыКоррПТУНаИзменение(РеквизитыШапки) Экспорт

	ДокументИзменен = Ложь;
	МассивШапки = СтрРазделить(РеквизитыШапки, ",", Ложь);
	Для каждого СтрокаШапки Из МассивШапки Цикл
		ДокументИзменен = ДокументИзменен Или ЭтотОбъект[СтрокаШапки] <> Ссылка[СтрокаШапки];
	КонецЦикла;
	
	Возврат ДокументИзменен;

КонецФункции // ПроверитьРеквизитыКоррПТУНаИзменение()

//Евросиб Гудкова( 02.02.2020  Отключил 12.01.2020
Процедура РазнестиУслугиАвтоматически() Экспорт
	
	//Евросиб Каблов 24.11.2021 ( Ticket#0249359
	//МассивКопияТЧ = Новый Массив;
	//Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
	//	МассивКопияТЧ.Добавить(Новый Структура("СчетПоставщика, СуммаНаПТУ", Стр.СчетПоставщика, Стр.СуммаНаПТУ));
	//КонецЦикла;
	//
	//
	//Если СвязьУслугИСчетов.Количество() = 0 Тогда
	//	Для каждого СтрУслуги из Услуги Цикл
	//		Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
	//			СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
	//		КонецЕсли;
	//		НСтр = СвязьУслугИСчетов.Добавить();
	//		ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "ГУИДПТУ,СтавкаНДС");
	//			НСтр.Всего = СтрУслуги.Всего - СтрУслуги.ВсегоДоИзменения;
	//			НСтр.СуммаНДС = СтрУслуги.СуммаНДС - СтрУслуги.СуммаНДСДоИзменения;
	//	КонецЦикла;
	//КонецЕсли; 
	//Проходов = СвязьУслугИСчетов.Количество();
	//
	//Сч = 1;
	//
	//Пока Сч <= Проходов Цикл
	//	
	//	Для каждого стрСвязь из СвязьУслугИСчетов Цикл
	//		Если ЗначениеЗаполнено(стрСвязь.ОтнесеннаяСумма) тогда Продолжить; КонецЕсли;
	//		
	//		Для каждого СтрСчет из МассивКопияТЧ Цикл
	//			Если СтрСчет.СуммаНаПТУ = 0 Тогда Продолжить; КонецЕсли;
	//			
	//			//Евросиб Каблов 09.09.2021 ( Ticket#0239758
	//			//Если стрСвязь.Всего <> 0 И Макс(стрСвязь.Всего,-стрСвязь.Всего) <= Макс(СтрСчет.СуммаНаПТУ, -СтрСчет.СуммаНаПТУ) Тогда
	//			//Если стрСвязь.Всего <> 0 Тогда
	//			//	стрСвязь.ОтнесеннаяСумма = стрСвязь.Всего;
	//			//	СтрСчет.СуммаНаПТУ = СтрСчет.СуммаНаПТУ - стрСвязь.ОтнесеннаяСумма;
	//			//	стрСвязь.СчетПоставщика = СтрСчет.СчетПоставщика;
	//			//Иначе
	//			//	Проходов = Проходов + 1;
	//			//	стрСвязь.СчетПоставщика = СтрСчет.СчетПоставщика;
	//			//	стрСвязь.ОтнесеннаяСумма = СтрСчет.СуммаНаПТУ;
	//			//	СтрСчет.СуммаНаПТУ = 0;
	//			//	НСтр = СвязьУслугИСчетов.Вставить(стрСвязь.НомерСтроки);
	//			//	ЗаполнитьЗначенияСвойств(НСтр, стрСвязь,,"ОтнесеннаяСумма, СчетПоставщика");
	//			//	НСтр.Всего = НСтр.Всего - стрСвязь.ОтнесеннаяСумма;
	//			//КонецЕсли;
	//			стрСвязь.ОтнесеннаяСумма = стрСвязь.Всего;
	//			СтрСчет.СуммаНаПТУ = СтрСчет.СуммаНаПТУ - стрСвязь.ОтнесеннаяСумма;
	//			стрСвязь.СчетПоставщика = СтрСчет.СчетПоставщика;
	//			//Евросиб Каблов 09.09.2021 )
	//			
	//			Прервать;
	//			
	//		КонецЦикла;
	//		
	//		Прервать;
	//		
	//	КонецЦикла;
	//	
	//	Сч = Сч + 1;
	//	
	//КонецЦикла;
	//
	//// А теперь дополнительный проход с тем, чтобы выровнять сумму НДС. Яна говорила, что последняя строка считается как СуммаНДСВсего - Сумма предыдущих строк НДС
	//Для каждого СтрУ из Услуги Цикл
	//	
	//	НайдСтрокиСвязь = СвязьУслугИСчетов.НайтиСтроки(Новый Структура("ГУИДПТУ", СтрУ.ГУИДПТУ));
	//	
	//	НакопительныйИтогПоНДС = 0;
	//	Для Сч = 0 По НайдСтрокиСвязь.Количество()-1 цикл
	//		Если Сч = НайдСтрокиСвязь.Количество()-1 Тогда
	//			НайдСтрокиСвязь[Сч].СуммаНДС = СтрУ.СуммаНДС  - СтрУ.СуммаНДСДоИзменения - НакопительныйИтогПоНДС;
	//		Иначе
	//			Если УчитыватьНДС И НЕ СуммаВключаетНДС Тогда
	//				СтНдс = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НайдСтрокиСвязь[Сч].СтавкаНДС);
	//				НайдСтрокиСвязь[Сч].СуммаНДС = НайдСтрокиСвязь[Сч].ОтнесеннаяСумма - НайдСтрокиСвязь[Сч].ОтнесеннаяСумма / ((100+СтНдс)/100);
	//			ИначеЕсли УчитыватьНДС и СуммаВключаетНДС Тогда
	//				СтНдс = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НайдСтрокиСвязь[Сч].СтавкаНДС);
	//				НайдСтрокиСвязь[Сч].СуммаНДС = НайдСтрокиСвязь[Сч].ОтнесеннаяСумма / (100+СтНдс) * СтНдс;
	//			КонецЕсли;
	//				
	//			НакопительныйИтогПоНДС = НакопительныйИтогПоНДС + НайдСтрокиСвязь[Сч].СуммаНДС;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
	СвязьУслугИСчетов.Очистить();
	
	ТаблицаСчетов = СвязанныеСчетаПоставщиков.Выгрузить();
	
	СтрокиБезСумм = ТаблицаСчетов.НайтиСтроки(Новый Структура("СуммаНаПТУ", 0));
	Если ТаблицаСчетов.Количество() <> СтрокиБезСумм.Количество() Тогда
		Для Каждого СтрокаСчетов Из СтрокиБезСумм Цикл
			ТаблицаСчетов.Удалить(СтрокаСчетов);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаУслуг Из Услуги Цикл
		
		СуммаПоУслуге = СтрокаУслуг.Всего - ?(СтрокаУслуг.ВсегоДоКорректировки = 0, СтрокаУслуг.ВсегоДоИзменения, СтрокаУслуг.ВсегоДоКорректировки);
		СуммаНДСПоУслуге = СтрокаУслуг.СуммаНДС - ?(СтрокаУслуг.СуммаНДСДоКорректировки = 0, СтрокаУслуг.СуммаНДСДоИзменения, СтрокаУслуг.СуммаНДСДоКорректировки);
		
		Если СуммаПоУслуге = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаСчетов Из ТаблицаСчетов Цикл
	
			СуммаПоСчету = СтрокаСчетов.СуммаНаПТУ;
			Если СуммаПоСчету = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СуммаПоСчету > 0 И СуммаПоУслуге > 0 Тогда
				ОтнесеннаяСумма = Мин(СуммаПоСчету, СуммаПоУслуге);
			ИначеЕсли СуммаПоСчету < 0 И СуммаПоУслуге < 0 Тогда
				ОтнесеннаяСумма = Макс(СуммаПоСчету, СуммаПоУслуге);
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОтнесеннаяСуммаНДС = Окр(СуммаНДСПоУслуге / СуммаПоУслуге * ОтнесеннаяСумма, 2);
			
			НоваяСтрока = СвязьУслугИСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуг, "ГУИДПТУ, СтавкаНДС");
			НоваяСтрока.СчетПоставщика = СтрокаСчетов.СчетПоставщика;
			НоваяСтрока.Всего = ОтнесеннаяСумма;
			НоваяСтрока.ОтнесеннаяСумма = ОтнесеннаяСумма;			
			НоваяСтрока.СуммаНДС = ОтнесеннаяСуммаНДС;
			
			СуммаПоУслуге = СуммаПоУслуге - ОтнесеннаяСумма;
			СуммаНДСПоУслуге = СуммаНДСПоУслуге - ОтнесеннаяСуммаНДС;
			
			СтрокаСчетов.СуммаНаПТУ = СуммаПоСчету - ОтнесеннаяСумма;
		
		КонецЦикла;
		
		//Сумму по услуге, которую не удалось распределить на счета, записываем на первый счет из таблицы счетов
		// ДИТ Ticket 0336792 Сержантова А.С. Начало: 10.01.2024
		//Было:
		//Если СуммаПоУслуге <> 0 Или СуммаНДСПоУслуге <> 0 Тогда
		//Стало:
		Если (СуммаПоУслуге <> 0 Или СуммаНДСПоУслуге <> 0) и ТаблицаСчетов.Количество() > 0 Тогда	
		// ДИТ Ticket 0336792 Сержантова А.С. Конец: 10.01.2024
			
			СтрокаСчетов = ТаблицаСчетов[0];
			
			НайденныеСтроки = СвязьУслугИСчетов.НайтиСтроки(Новый Структура("ГУИДПТУ, СчетПоставщика", СтрокаУслуг.ГУИДПТУ, СтрокаСчетов.СчетПоставщика));			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				СтрокаСвязи = НайденныеСтроки[0];
			Иначе
				СтрокаСвязи = СвязьУслугИСчетов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСвязи, СтрокаУслуг, "ГУИДПТУ, СтавкаНДС");
				СтрокаСвязи.СчетПоставщика = СтрокаСчетов.СчетПоставщика;				
			КонецЕсли;
			
			СтрокаСвязи.Всего = СтрокаСвязи.Всего + СуммаПоУслуге;
			СтрокаСвязи.ОтнесеннаяСумма = СтрокаСвязи.ОтнесеннаяСумма + СуммаПоУслуге;
			СтрокаСвязи.СуммаНДС = СтрокаСвязи.СуммаНДС + СуммаНДСПоУслуге;
			
		КонецЕсли;
	
	КонецЦикла;	
	//Евросиб Каблов 24.11.2021 )
	
КонецПроцедуры

Функция ПолучитьСуммыИзТаблицыСоответствия()
	
	МассивРезультата = Новый Массив;
	
	ВыборкаСтрок = СвязьУслугИСчетов.ВыгрузитьКолонки("СчетПоставщика, ОтнесеннаяСумма, СуммаНДС");
	ВыборкаСтрок.Свернуть("СчетПоставщика","ОтнесеннаяСумма, СуммаНДС");
	Для каждого Стр из ВыборкаСтрок Цикл
		СтруктураСумм = Новый Структура;
		СтруктураСумм.Вставить("СчетПоставщика", Стр.СчетПоставщика);
		СтруктураСумм.Вставить("СуммаИтого", Стр.ОтнесеннаяСумма);
		СтруктураСумм.Вставить("СуммаНДС", Стр.СуммаНДС);
		МассивРезультата.Добавить(СтруктураСумм);
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Если ЦФО = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
		ПроверяемыеРеквизиты.Добавить("ВидУслуг");
	КонецЕсли;
	//Евросиб Каблов 12.08.2022 )
	
КонецПроцедуры

// ++ ДИТ_Агафонов_task 41390 08.03.2023
//Скопировано из модуля документа поступления ТиУ
Процедура ПроверитьИзмененияКлючевыхДанныхДляАкцепта(Отказ, Ошибки) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	//Делаем только для исправления первички по условиям задачи 41390  
	Если не ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
		//Если установлено это свойство, то запись происходит из акцепта
		//значит проверка не нужна.
		Возврат;
	КонецЕсли; 
	СостояниеРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка);
	Если СостояниеРазнесения.СтатусРазнесения = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта
		//Евросиб - АСуслов 30.11.2022 9:08:06 #0293538 
		//(
		ИЛИ СостояниеРазнесения.СтатусРазнесения = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан
		//)
		//Евросиб - АСуслов 30.11.2022 9:08:08 #0293538 
		Тогда
		Возврат;
	КонецЕсли; 
	ИзмененныеРеквизиты = Неопределено;
	КонтрольДоступностиДокументов_сервер.ПроверитьИзмененияРеквизитовОбъекта(ЭтотОбъект, Отказ, Ложь, ПолучитьСписокПроверяемыхПолей(), ИзмененныеРеквизиты); 
	Если Отказ Тогда
		Ошибки = СтрШаблон("По ПТУ %2 от %3 существует актуальный акцепт, запись отменена, т.к. изменены ключевые поля в документе: %1
							|Перед записью документа необходимо сторнировать актуальный акцепт.", 
							СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(ИзмененныеРеквизиты),
							Номер,
							Формат(Дата, "ДФ=dd.MM.yyyy"));
	Иначе 
		
		//проверим изменения ТЧ Услуги
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
		// ++ ДИТ_Агафонов_task 41390 10.04.2023
		//Нет такого реквизита в корректировке
		//|	ПоступлениеТоваровУслугУслуги.УдПеревыставление КАК УдПеревыставление,
		// -- ДИТ_Агафонов_task 41390 10.04.2023
		|	ПоступлениеТоваровУслугУслуги.СписокТС КАК СписокТС,
		|	ПоступлениеТоваровУслугУслуги.СписокТЕ КАК СписокТЕ,
		|	ПоступлениеТоваровУслугУслуги.СписокТД КАК СписокТД,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	&ТЧУслуги КАК ПоступлениеТоваровУслугУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.Содержание, 1, 1024) КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТС, 1, 1024) КАК СписокТС,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТЕ, 1, 1024) КАК СписокТЕ,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТД, 1, 1024) КАК СписокТД,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения
		|ПОМЕСТИТЬ ВТ_ТаблицыСравнения
		|ИЗ
		|	Документ.КорректировкаПоступления.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Услуги.Номенклатура,
		|	ПОДСТРОКА(ВТ_Услуги.Содержание, 1, 1024),
		|	-ВТ_Услуги.Количество,
		|	ВТ_Услуги.СтавкаНДС,
		|	-ВТ_Услуги.Сумма,
		|	-ВТ_Услуги.СуммаНДС,
		|	-ВТ_Услуги.Цена,
		|	ПОДСТРОКА(ВТ_Услуги.СписокТС, 1, 1024),
		|	ПОДСТРОКА(ВТ_Услуги.СписокТЕ, 1, 1024),
		|	ПОДСТРОКА(ВТ_Услуги.СписокТД, 1, 1024),
		|	ВТ_Услуги.ГУИДПТУ,
		|	-ВТ_Услуги.Всего,
		|	ВТ_Услуги.ИДТД,
		|	ВТ_Услуги.СтанцияОтправления,
		|	ВТ_Услуги.СтанцияНазначения
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицыСравнения.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_ТаблицыСравнения.Количество) КАК Количество,
		|	ВТ_ТаблицыСравнения.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ВТ_ТаблицыСравнения.Сумма) КАК Сумма,
		|	СУММА(ВТ_ТаблицыСравнения.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВТ_ТаблицыСравнения.Цена) КАК Цена,
		|	ВТ_ТаблицыСравнения.ГУИДПТУ КАК ГУИДПТУ,
		|	СУММА(ВТ_ТаблицыСравнения.Всего) КАК Всего,
		|	ВТ_ТаблицыСравнения.ИДТД КАК ИДТД,
		|	ВТ_ТаблицыСравнения.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ_ТаблицыСравнения.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_ТаблицыСравнения.СписокТС КАК СписокТС,
		|	ВТ_ТаблицыСравнения.СписокТЕ КАК СписокТЕ,
		|	ВТ_ТаблицыСравнения.СписокТД КАК СписокТД,
		|	ВТ_ТаблицыСравнения.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ТаблицыСравнения КАК ВТ_ТаблицыСравнения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицыСравнения.Номенклатура,
		|	ВТ_ТаблицыСравнения.СтавкаНДС,
		|	ВТ_ТаблицыСравнения.ГУИДПТУ,
		|	ВТ_ТаблицыСравнения.ИДТД,
		|	ВТ_ТаблицыСравнения.СтанцияОтправления,
		|	ВТ_ТаблицыСравнения.СтанцияНазначения,
		|	ВТ_ТаблицыСравнения.СписокТС,
		|	ВТ_ТаблицыСравнения.СписокТЕ,
		|	ВТ_ТаблицыСравнения.СписокТД,
		|	ВТ_ТаблицыСравнения.Содержание
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВТ_ТаблицыСравнения.Сумма) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.СуммаНДС) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.Цена) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.Всего) <> 0)";
		Запрос.УстановитьПараметр("ТЧУслуги",Услуги.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Отказ = НЕ РезультатЗапроса.Пустой();
		Если Отказ Тогда
			Ошибки = Ошибки + СтрШаблон("По КоррПТУ существует актуальный акцепт, запись отменена, т.к. изменена ТЧ «Услуги»
										|Перед записью документа необходимо сторнировать актуальный акцепт."); 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСписокПроверяемыхПолей()
	
	СписокПроверяемыхПолей = Новый Массив;
	СписокПроверяемыхПолей.Добавить("Контрагент");
	СписокПроверяемыхПолей.Добавить("ДоговорКонтрагента");
	СписокПроверяемыхПолей.Добавить("Номер");
	СписокПроверяемыхПолей.Добавить("Дата");
	СписокПроверяемыхПолей.Добавить("НомерВходящегоДокумента");
	СписокПроверяемыхПолей.Добавить("ДатаВходящегоДокумента");
	СписокПроверяемыхПолей.Добавить("НДСВключенВСтоимость");
	СписокПроверяемыхПолей.Добавить("СуммаВключаетНДС");
	СписокПроверяемыхПолей.Добавить("УчитыватьНДС");
	СписокПроверяемыхПолей.Добавить("ДатаПересчета");
	СписокПроверяемыхПолей.Добавить("Организация");
	СписокПроверяемыхПолей.Добавить("ПоставщикВУ");
	СписокПроверяемыхПолей.Добавить("Регламентный");
	СписокПроверяемыхПолей.Добавить("СуммаДокумента");
	СписокПроверяемыхПолей.Добавить("СчетПоставщика");
	СписокПроверяемыхПолей.Добавить("СуммаНаПТУ");
	Возврат СписокПроверяемыхПолей;
		
КонецФункции

// -- ДИТ_Агафонов_task 41390 08.03.2023

//Евросиб Каблов 02.09.2024 Ticket#0360646
Процедура ЗаполнитьУслугиПоДокументуПоступления() Экспорт
	
	Услуги.Очистить();
	
	ТипДокументаПоступления = ТипЗнч(ДокументПоступления);
	Если ТипДокументаПоступления = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Для Каждого ТекСтрокаУслуги Из ДокументПоступления.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			НоваяСтрока.КоличествоДоИзменения	= ТекСтрокаУслуги.Количество;
			НоваяСтрока.СодержаниеДоИзменения 	= ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СтавкаНДСДоИзменения 	= ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СуммаДоИзменения		= ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения		= ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения			= ТекСтрокаУслуги.Цена;
			НоваяСтрока.ВсегоДоИзменения		= ТекСтрокаУслуги.Всего;
			НоваяСтрока.ГУИДстроки 				= Строка(Новый УникальныйИдентификатор);
		КонецЦикла;
	ИначеЕсли ТипДокументаПоступления = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Для Каждого ТекСтрокаУслуги Из ДокументПоступления.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			НоваяСтрока.КоличествоДоИзменения 		= ТекСтрокаУслуги.Количество;
			НоваяСтрока.КоличествоДоКорректировки 	= ТекСтрокаУслуги.КоличествоДоИзменения;
			НоваяСтрока.СодержаниеДоИзменения 		= ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СтавкаНДСДоИзменения 		= ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СуммаДоИзменения 			= ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения			= ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения 			= ТекСтрокаУслуги.Цена;
			НоваяСтрока.ЦенаДоКорректировки			= ТекСтрокаУслуги.Цена;
			НоваяСтрока.СуммаДоКорректировки 		= ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоКорректировки 	= ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ВсегоДоИзменения			= ТекСтрокаУслуги.Всего;
			НоваяСтрока.РазницаВсегоКорректировки 	= 0;
			НоваяСтрока.РазницаСуммаКорректировки 	= 0;
			НоваяСтрока.РазницаСуммаНДСКорректировки = 0;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
// -- ДИТ_Агафонов_task 41390 08.03.2023

//++ Глеков Д.В. Ticket#0247297 27.01.2022 
//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	Если Документы.Акцепт.ЕстьВозможностьКорректировкиПоступления(ДокументПоступления, ВидОперации) = ЛОЖЬ Тогда
//	
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед проведением документа необходимо сторнировать Акцепт документа основания корректировки поступления");
//		Если Не ДополнительныеСвойства.Свойство("ИгнорироватьОграниченияПриПроведении") Тогда
//		
//			Отказ = ИСТИНА;
//		
//		КонецЕсли;
//	
//	КонецЕсли;
//КонецПроцедуры
//-- Глеков Д.В. Ticket#0247297 27.01.2022
// Евросиб Гудкова)  

//Евросиб Пирожкова( 10.09.2025 Ticket№0406736
Процедура ПроверитьВыгрузкуВУПП() Экспорт
	
 	СоответствиеОшибок = Новый Соответствие;
	СоответствиеОшибок.Вставить("ОшибкаВДатеМодификации", "Дата модификации меньше, чем дата обмена");
	СоответствиеОшибок.Вставить("ОшибкаВСтатусах", "Необходимо исправить статус ЭДО");  
	СоответствиеОшибок.Вставить("ОшибкаНеРазрешенаВыгрузка", "Выгрузка в УПП не разрешена");
	СоответствиеОшибок.Вставить("ОшибкаЭтоКопия", "Проверьте значение реквизита ""копия""");
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НЕ ВЫБОР
		|			КОГДА ЕСТЬNULL(ПротоколОбменов.ДатаОбмена, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПротоколОбменов.ДатаОбмена < КорректировкаПоступления.ДатаМодификации
		|		КОНЕЦ КАК ОшибкаВДатеМодификации,
		|	НЕ ВЫБОР
		|			КОГДА КорректировкаПоступления.Контрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|				ТОГДА НЕ КорректировкаПоступления.Копия
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ КАК ОшибкаЭтоКопия,
		|	НЕ КорректировкаПоступления.РазрешенаВыгрузкаВУПП КАК ОшибкаНеРазрешенаВыгрузка,
		|	НЕ ВЫБОР
		|			КОГДА Диадок_Документы.СостояниеДокументооборота ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Диадок_Документы.СостояниеДокументооборота = ""Подписан""
		|					ИЛИ Диадок_Документы.СостояниеДокументооборота = ""Откорректирован""
		|					ИЛИ Диадок_Документы.СостояниеДокументооборота = ""Документооборот завершен""
		|						И Диадок_Документы.СостояниеДокументооборотаДоп В (""Согласован"", """")
		|		КОНЕЦ КАК ОшибкаВСтатусах
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО КорректировкаПоступления.Ссылка = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
		|		ПО КорректировкаПоступления.Контрагент = Контрагенты.Объект
		|			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
		|		ПО КорректировкаПоступления.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
		|			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВДиадоке КАК Диадок_Документы
		|		ПО КорректировкаПоступления.Ссылка = Диадок_Документы.Документ
		|ГДЕ
		|	КорректировкаПоступления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		КоличествоОшибок = 0;
		Для каждого Колонка из Результат.Колонки Цикл
			Если Результат[0][Колонка.Имя] Тогда
				КоличествоОшибок = КоличествоОшибок+1;
				Сообщить(СоответствиеОшибок.Получить(Колонка.Имя));
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Сообщить("Проверка готовности документа к выгрузке завершена, выявлено ошибок: " +КоличествоОшибок);
	
КонецПроцедуры
// Евросиб Пирожкова 10.09.2025)

Процедура ВыполнитьПроверкуПризнакКопия(Отказ,РежимЗаписи) //Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025
	
	мСостояния = Новый Массив;
	
	мСостояния.Добавить(Справочники.Состояния.ПолучитьОригиналыСнятьПризнакКопияПодготовитьПТУкВыгрузкеВУПП);
	мСостояния.Добавить(Справочники.Состояния.ПолучитьОригиналыСнятьПризнакКопияПодготовитьКорПТУкВыгрузкеВУПП);
	мСостояния.Добавить(Справочники.Состояния.ПолучениеОригиналовДокументовОтНерезидентовПроверитьСнятьПризнакКопия);
	мСостояния.Добавить(Справочники.Состояния.ПолучениеОригДокументовОтНерезидентаПровНаСоответствиеОригКопииСнятьПризнакКопия);
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение) И НЕ ПометкаУдаления Тогда
		Для Каждого мСостояние Из мСостояния Цикл
			СтрокаСостояния = Состояния.НайтиСтроки(Новый Структура("Состояние,Статус", мСостояние, Перечисления.СтатусыЭтапов.Выполнен));
			Если СтрокаСостояния.Количество() <> 0 И Копия Тогда
				ОбщегоНазначения.СообщитьПользователю("Необходимо снять признак ""Копия""",,,"Объект.Копия",Отказ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры;
