// ДИТ US 64822 Сержантова А.С. Начало: 02.10.2023
Процедура ОтправитьПСЦВДО(ПараметрыВыполнения, АдресРезультата) Экспорт   
	
	// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Начало: 27.05.2024
	ПСЦСсылка = ПараметрыВыполнения.ПСЦСсылка;    
	ЭтоЗавершениеСогласования = ПараметрыВыполнения.ЭтоЗавершениеСогласования;
	// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Конец: 27.05.2024
	
	ОтправкаСканКопии = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
		|		ПО (ПСЦ.Ссылка = Файлы.ВладелецФайла)
		|			И (Файлы.ЭтоСканКопия)
		|ГДЕ
		|	ПСЦ.Ссылка = &Ссылка
		|	И НЕ Файлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПСЦСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		ОтправкаСканКопии = Истина;
	КонецЕсли;	  
	
	// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Начало: 27.05.2024
	РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦСсылка, 
				"СсылкаНаВнутреннийДокументДО, СтатусДокумента, Организация, ТипКалькуляции, ПСЦПоставщика, ПодписанСДвухСторон");
	// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Конец: 27.05.2024
	
	Если (не ЗначениеЗаполнено(РеквизитыПСЦ.СсылкаНаВнутреннийДокументДО) ИЛИ ЭтоЗавершениеСогласования ИЛИ ОтправкаСканКопии)
		и (РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
		или РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями
		или РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.Подписано) Тогда
		
		// ограничение - не выгружаем если организация ДКП и Тип калькуляции межсервисные расходы/ межсервисные расходы реф   
		ОрганизацияДКП = Константы.ОсновнаяОрганизация.Получить();
		Если не (РеквизитыПСЦ.Организация = ОрганизацияДКП и 
			(РеквизитыПСЦ.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
			или РеквизитыПСЦ.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф)) Тогда
			
			ДанныеДляОтправки = ЕСОбменСервер.ПодготовитьТаблицуПСЦдляОтправкиДО(ПСЦСсылка);
			// ПСЦ поставщика отправляем в ДО после установки даты подписания с двух сторон 
			Если РеквизитыПСЦ.ПСЦПоставщика и РеквизитыПСЦ.ПодписанСДвухСторон Тогда
				ЕСОбменСервер.СоздатьКарточкуПСЦвДО(ДанныеДляОтправки);  
			ИначеЕсли не РеквизитыПСЦ.ПСЦПоставщика Тогда 	
				ЕСОбменСервер.СоздатьКарточкуПСЦвДО(ДанныеДляОтправки);  
			КонецЕсли;
			
			Если СтрНайти(ДанныеДляОтправки[0].Сообщение, "ОК") <> 0 Тогда   
				// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Начало: 27.05.2024
				Объект = ПСЦСсылка.ПолучитьОбъект();
				// ДИТ BUG 85918 ТА 85919 Сержантова А.С. Конец: 27.05.2024
				Объект.СсылкаНаВнутреннийДокументДО = ДанныеДляОтправки[0].Ссылка_В_ДО;  
				Попытка
					Объект.ОбменДанными.Загрузка = Истина;	
					Объект.Записать(РежимЗаписиДокумента.Запись);				
				Исключение
				    //Сообщить("Добавлена ссылка на внутренний документ в Документообороте. Необходимо записать Протокол!");
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;   	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПСЦ_двуязычный";
	//КомандаПечати.Представление = "Протокол двуязычный";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПСЦ_одноязычный2";
	КомандаПечати.Представление = "Печать протокола";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПСЦ_ОдноязычныйУниверсальныйФаксимиле";
	КомандаПечати.Представление = "Печать протокола (факсимиле)";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПСЦ_одноязычный";
	//КомандаПечати.Представление = "Протокол одноязычный (компл. ставка)";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПСЦ_одноязычный2";
	//КомандаПечати.Представление = "Протокол одноязычный (ставка за ктк)";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПСЦ_одноязычный3";
	//КомандаПечати.Представление = "Протокол одноязычный (ставка за вагон)";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПСЦ_двуязычный";
	//КомандаПечати.Представление = "Протокол двуязычный";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_одноязычный") Тогда
		
		// отключено
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_одноязычный", "Протокол одноязычный (компл. ставка)", НапечататьОдноязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколОдноязычный_3варианта");
		КонецЦикла;
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_двуязычный") Тогда
		
		// отключено
		//Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_двуязычный", "Протокол двуязычный", НапечататьДвуязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколДвуязычный");
		//КонецЦикла;
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_одноязычный2") Тогда
		
		//Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_одноязычный2", "Протокол клиента", ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов, , ОбъектыПечати),,"Документы.ПСЦ.ПФ_MXL_ПротоколДвуязычный");
		//КонецЦикла;

		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_одноязычный2") Тогда
		
		// отключено
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_одноязычный2", "Протокол одноязычный (ставка за ктк)", НапечататьОдноязычный2ПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколДвуязычный");
		КонецЦикла;
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_одноязычный3") Тогда
		
		// отключено
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_одноязычный3", "Протокол одноязычный (ставка за вагон)", НапечататьОдноязычный3ПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколДвуязычный");
		КонецЦикла;

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_ОдноязычныйУниверсальный") Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыводитьФаксимиле", Ложь);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_ОдноязычныйУниверсальный", "Протокол одноязычный", ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов, ДопПараметры, ОбъектыПечати),,"Документы.ПСЦ.ПФ_MXL_ПротоколОдноязычныйУниверсальный");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_ОдноязычныйУниверсальныйФаксимиле") Тогда
//ДИТ Давудов М.А. Ticket#0234739 16.06.2021 Начало
		ИтераторПоКоличествуОбъектовПечати = МассивОбъектов.Количество() - 1; // Итератор для обхода массива объектов
		КоличествоДокументовНаПечать = МассивОбъектов.Количество(); // Количество ссылок в массиве

		Пока ИтераторПоКоличествуОбъектовПечати >= 0 Цикл
			Если МассивОбъектов[ИтераторПоКоличествуОбъектовПечати].СтатусДокумента <> Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			   И МассивОбъектов[ИтераторПоКоличествуОбъектовПечати].СтатусДокумента <> Перечисления.СтатусыСогласования.СогласованСКомментариями
			   И МассивОбъектов[ИтераторПоКоличествуОбъектовПечати].СтатусДокумента <> Перечисления.СтатусыСогласования.Подписано Тогда
			   
			   	Если КоличествоДокументовНаПечать = 1 Тогда
					ТекстСообщения = НСтр("ru = 'Протокол не согласован! Печать с факсимиле невозможна!'");
			    Иначе
					ТекстСообщения = НСтр("ru = 'Протокол ""%Протокол%"" не согласован! Печать с факсимиле невозможна!'");   
			        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Протокол%", МассивОбъектов[ИтераторПоКоличествуОбъектовПечати].Ссылка);
				КонецЕсли;
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				МассивОбъектов.Удалить(ИтераторПоКоличествуОбъектовПечати);
			КонецЕсли;
			
			ИтераторПоКоличествуОбъектовПечати = ИтераторПоКоличествуОбъектовПечати - 1;
		КонецЦикла;
//ДИТ Давудов М.А. Ticket#0234739 16.06.2021 Конец
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыводитьФаксимиле", Истина);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_ОдноязычныйУниверсальныйФаксимиле", "Протокол одноязычный", ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов, ДопПараметры, ОбъектыПечати),,"Документы.ПСЦ.ПФ_MXL_ПротоколОдноязычныйУниверсальный");
		
	//Евросиб Коханенко Н.А. 17.10.2024 (( #92915
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦ_Нотис") Тогда  
	
		Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
			ИмяФайлаПечатнойФормы = "Документы.ПСЦ.ПФ_MXL_Нотис";
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ВыводитьФаксимиле", Ложь);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦ_Нотис", "Нотис ВРП", ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов, ДопПараметры, ОбъектыПечати),,ИмяФайлаПечатнойФормы);
		КонецЕсли;
	//Евросиб Коханенко Н.А. 17.10.2024 )) #92915 
	
	КонецЕсли;
	
КонецПроцедуры

Функция ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов, ДопПараметры = Неопределено, ОбъектыПечати) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		НомерСтрокиНачало = Результат.ВысотаТаблицы + 1; // Для задания области печати
		
		ПодМассивОб = Новый Массив;
		ПодМассивОб.Добавить(Док);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;

		//Евросиб Коханенко Н.А. 17.10.2024 (( #92915 
		//Если Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйВаг Тогд
		Если Док.Нотис Тогда
			
			Если Док.ФорматНотиса = Перечисления.ФорматыНотисов.НотисВРП 
					ИЛИ Док.ФорматНотиса = Перечисления.ФорматыНотисов.НотисВРПНСК
					ИЛИ Док.ФорматНотиса = Перечисления.ФорматыНотисов.НотисРефы  Тогда
				// Евросиб US 90342 Рыбьяков К.А. 02.03.2026 ((
				Рез = ПечатьПротоколов.НапечататьНотисВРП_Рефы_ММ(ПодМассивОб, ДопПараметры);
				//Рез = НапечататьНотисВРП_Рефы_ММ(ПодМассивОб, ДопПараметры);
				// Евросиб Рыбьяков К.А. 02.03.2026 ))
			ИначеЕсли Док.ФорматНотиса = Перечисления.ФорматыНотисов.НотисММИмпорт
					ИЛИ Док.ФорматНотиса = Перечисления.ФорматыНотисов.НотисММЭкспорт Тогда
				// Евросиб US 90342 Рыбьяков К.А. 02.03.2026 ((
				Рез = ПечатьПротоколов.НапечататьНотисВРП_Рефы_ММ(ПодМассивОб, ДопПараметры, Ложь);
				//Рез = НапечататьНотисВРП_Рефы_ММ(ПодМассивОб, ДопПараметры, Ложь);
				// Евросиб Рыбьяков К.А. 02.03.2026 ))
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйВаг Тогда
		//Евросиб Коханенко Н.А. 17.10.2024 )) #92915 
		
			//Рез = НапечататьОдноязычный3ПСЦ_ПоПростомуБезЭтихВашихБСП(ПодМассивОб);
			Рез = НапечататьОдноязычныйУниверсальныйПротокол(ПодМассивОб, ДопПараметры);
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколДвуязычный Тогда
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
			//ок(
			//Рез = НапечататьДвуязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов);
			//ок)
			Рез = НапечататьДвуязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов, ДопПараметры);
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
			//ок(
			//Рез = НапечататьОдноязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов);
			//ок)
			Рез = НапечататьОдноязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов,, ДопПараметры);
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйКТК Тогда
			
			//Рез = НапечататьОдноязычный2ПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов);
			Рез = НапечататьОдноязычныйУниверсальныйПротокол(ПодМассивОб, ДопПараметры);
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли  Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйФрахт Тогда
			
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
			//ок(
			//Рез = НапечататьОдноязычныйФрахт(МассивОбъектов);
			//ок)
			Рез = НапечататьОдноязычныйФрахт(МассивОбъектов, ДопПараметры);
			//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец
			//Рез = НапечататьОдноязычныйУниверсальныйПротокол(ПодМассивОб, ДопПараметры);
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);
			
		ИначеЕсли Док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			
			Рез = НапечататьОдноязычныйУниверсальныйПротокол(ПодМассивОб, ДопПараметры);
			
			//ДИТ Пак И.Т. Task34353 12.05.2021 Начало
			НаложитьВодянойЗнакЕслиНеобходимо(Рез, Док);
			//ДИТ Пак И.Т. Task34353 12.05.2021 Конец
			
			Результат.Вывести(Рез);

		Иначе
			
			Сообщить("Данная функция предназначена для печати клиентского протокола. Укажите вид клиентского протокола и повторите попытку.");
			
		КонецЕсли;
		
		// Для задания области печати
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Результат, 
			НомерСтрокиНачало, ОбъектыПечати, Док);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
//ок(
//Функция НапечататьОдноязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов, УмныйРежим = Ложь) Экспорт
Функция НапечататьОдноязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов, УмныйРежим = Ложь, ДопПараметры = Неопределено) Экспорт
//ок)

	ВыводитьФаксимиле = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьФаксимиле", ВыводитьФаксимиле);
		Если ТипЗнч(ВыводитьФаксимиле) <> Тип("Булево") Тогда
			ВыводитьФаксимиле = Ложь;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец

	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколОдноязычный_3варианта", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НомерПротокола = Док.КлиентскийНомер;
		ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);

		ОбластьШапка.Параметры.ПолноеНаименование = НаименованияНаДату.НаименованиеПолное;
		// ДИТ #0299916 Евсенкин М.А. Начало: 10.02.2023
		// Было:
		//ОбластьШапка.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное; 
		//Стало:
		ОбластьШапка.Параметры.КраткоеНаименование = "Исполнитель";
		// ДИТ #0299916 Евсенкин М.А. Конец: 10.02.2023
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьРуководителя = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИОРуководителя = НашРуководитель.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеРуководителя = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		// ДИТ #0299916 Евсенкин М.А. Начало: 10.02.2023
		// Было:
		//ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование; 
		//Стало:
		ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = "Клиент"; 
		// ДИТ #0299916 Евсенкин М.А. Конец: 10.02.2023
		ОбластьШапка.Параметры.ДолжностьРукКлиента = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеКлиента = РуководительКонтрагента.ОснованиеРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
			ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеРуководителя = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		
		
		ОбластьМаршрутыШапка = Макет.ПолучитьОбласть("ШапкаТабл2");
		ОбластьМаршрутыШапка.Параметры.СтавкаНДС = Док.СтавкаНДС;
		Результат.Вывести(ОбластьМаршрутыШапка);
		
		Для каждого Стр из Док.ТЧ Цикл
			ОбластьМаршрутыСтрока = Макет.ПолучитьОбласть("ОбластьТабл2");
			ОбластьМаршрутыСтрока.Параметры.НаименованиеУслуги = Стр.Услуга;
			ОбластьМаршрутыСтрока.Параметры.МаршрутСледования = "" + Стр.ПунктОтправленияRUS + " - " + Стр.ПунктДоставкиRUS;
			ОбластьМаршрутыСтрока.Параметры.ТипКонтейнера = Стр.ТипКТК;
			ОбластьМаршрутыСтрока.Параметры.Ставка = Стр.СуммаСНДС;
			ОбластьМаршрутыСтрока.Параметры.Валюта = Стр.Валюта;
			Результат.Вывести(ОбластьМаршрутыСтрока);
		КонецЦикла;
		
		/////////////////
		
		Для каждого Стр из Док.ПунктыПСЦ Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьЗаголовок");
				ОбластьЗаголовок.Параметры.Заголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьПодзаголовок");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.Подзаголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус	= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолное, Док.Организация.НаименованиеПолное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		// ДИТ #0299916 Евсенкин М.А. Начало: 10.02.2023
		// Было:
		//ОбластьПодвал.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное; 
		//Стало:
		ОбластьПодвал.Параметры.КраткоеНаименование = "Исполнитель";
		// ДИТ #0299916 Евсенкин М.А. Конец: 10.02.2023
		ОбластьПодвал.Параметры.ПолноеНаименование = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		//Евросиб Коханенко Н.А. 29.01.2025 (( #97554
		//ОбластьПодвал.Параметры.ФИОРуководителя = НашРуководитель.ФИОРус;
		ОбластьПодвал.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписанта;
		//Евросиб Коханенко Н.А. 29.01.2025 )) #97554
		ОбластьПодвал.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		// ДИТ #0299916 Евсенкин М.А. Начало: 10.02.2023
		// Было:
		//ОбластьПодвал.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование;
		//Стало:
		ОбластьПодвал.Параметры.КраткоеНаименованиеКлиента = "Клиент";
		// ДИТ #0299916 Евсенкин М.А. Конец: 10.02.2023
		ОбластьПодвал.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьПодвал.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРус;

		//Евросиб Коханенко Н.А. 27.01.2025 (( #97554
		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьПодвал.Параметры.ФИОРуководителя = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
		//	//ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;
		//КонецЕсли;
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеРус) Тогда
			ОбластьПодвал.Параметры.ФИОРукКлиента = "" + ОбластьПодвал.Параметры.ФИОРукКлиента + Символы.ПС + "На основании " + РуководительКонтрагента.ОснованиеРус;
		КонецЕсли;
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителя = "" + ОбластьПодвал.Параметры.ФИОРуководителя + Символы.ПС + "На основании " + Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 27.01.2025 )) #97554
		
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
		Если ВыводитьФаксимиле Тогда
			//ок(                       
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
					ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
				КонецЕсли;
			КонецЕсли;
			//ок)
		КонецЕсли;
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
	
		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция ОтработатьШаблоны(ПСЦ, Текст) Экспорт
	
	Результат = Текст;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Евросиб Каблов 23.08.2020 (
	Шаблон = "##СрокДействияУсловийПротокола";
	Если СтрНайти(Результат, Шаблон) > 0 Тогда
		Если ПСЦ.ДействуетДоСогласованияНовыхУсловий Тогда
			Результат = СтрЗаменить(Результат, Шаблон, "согласования новых условий");
		ИначеЕсли ЗначениеЗаполнено(ПСЦ.ОкончаниеДействия) Тогда
			Результат = СтрЗаменить(Результат, Шаблон, Формат(ПСЦ.ОкончаниеДействия, "ДФ=dd.MM.yyyy"));
		Иначе
			Результат = СтрЗаменить(Результат, Шаблон, "");
		КонецЕсли;
	КонецЕсли;
	
	Шаблон = "##СтавкаНДСВознагражденияВТомЧислеКромеТого";
	Если СтрНайти(Результат, Шаблон) > 0 Тогда
		Если ЗначениеЗаполнено(ПСЦ.СтавкаНДСВознаграждения) И ПСЦ.СтавкаНДСВознаграждения <> Перечисления.СтавкиНДС.БезНДС Тогда
			ВставляемыйТекст = СтрШаблон("(%1 НДС %2)", ?(ПСЦ.СуммаВознагражденияВключаетНДС, "в т.ч.", "кроме того"), Строка(ПСЦ.СтавкаНДСВознаграждения));
			Результат = СтрЗаменить(Результат, Шаблон, ВставляемыйТекст);
		Иначе
			Результат = СтрЗаменить(Результат, Шаблон, "");
		КонецЕсли;
	КонецЕсли;
	
	Шаблон = "##СтавкаНДСВознаграждения";
	Если СтрНайти(Результат, Шаблон) > 0 Тогда
		Если ЗначениеЗаполнено(ПСЦ.СтавкаНДСВознаграждения) Тогда
			Результат = СтрЗаменить(Результат, Шаблон, Строка(ПСЦ.СтавкаНДСВознаграждения));
		Иначе
			Результат = СтрЗаменить(Результат, Шаблон, "");
		КонецЕсли;
	КонецЕсли;
	
	Шаблон = "##НаименованиеПодписиИсполнителяВРодительномПадеже";
	Если СтрНайти(Результат, Шаблон) > 0 Тогда
		ВставляемыйТекст = "";
		Если ПСЦ.НаименованиеУслугиВознагражденияДляДоговорнойЦеныВР = Справочники.НаименованияУслугиВознагражденияДляДоговорнойЦеныВР.Вознаграждение
				И ЗначениеЗаполнено(ПСЦ.НаименованиеПодписиИсполнителя) Тогда
			ВставляемыйТекст = ПСЦ.НаименованиеПодписиИсполнителя.НаименованиеВРодительномПадеже;
		КонецЕсли;
		Результат = СтрЗаменить(Результат, Шаблон, ВставляемыйТекст);
	КонецЕсли;
	
	Шаблон = "##НаименованиеПодписиКлиентаВРодительномПадеже";
	Если СтрНайти(Результат, Шаблон) > 0 Тогда
		ВставляемыйТекст = "";
		Если ЗначениеЗаполнено(ПСЦ.НаименованиеПодписиКлиента) Тогда
			ВставляемыйТекст = ПСЦ.НаименованиеПодписиКлиента.НаименованиеВРодительномПадеже;
		КонецЕсли;
		Результат = СтрЗаменить(Результат, Шаблон, ВставляемыйТекст);
	КонецЕсли;
	//Евросиб Каблов 23.08.2020 )
	
	Для каждого Стр из Метаданные.Документы.ПСЦ.Реквизиты Цикл
		
		Результат = СтрЗаменить(Результат, "##"+Стр.Имя, Формат(ПСЦ[Стр.Имя], "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да"));
		
	КонецЦикла;
	
	Результат = СтрЗаменить(Результат, "##НомерДоговора", Формат(ПСЦ.Договор.Номер, "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да"));
	Результат = СтрЗаменить(Результат, "##ДатаДоговора", Формат(ПСЦ.Договор.Дата, "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да"));
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 23.08.2020
Функция ПолучитьТаблицуШаблоновРеквизитов(Протокол = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Шаблоны = Новый ТаблицаЗначений;
	Шаблоны.Колонки.Добавить("Шаблон", Новый ОписаниеТипов("Строка"));
	Шаблоны.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка"));
	Шаблоны.Колонки.Добавить("ПримерЗначения", Новый ОписаниеТипов("Строка"));
	
	Для каждого Стр из Метаданные.Документы.ПСЦ.Реквизиты Цикл
		НСтр = Шаблоны.Добавить();
		НСтр.Шаблон = "##"+Стр.Имя;
		НСтр.Реквизит = Стр.Синоним;
		Если Протокол <> Неопределено Тогда
			НСтр.ПримерЗначения = Формат(Протокол[Стр.Имя], "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да");
		КонецЕсли;
	КонецЦикла;
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##НомерДоговора";
	НСтр.Реквизит = "Номер договора";
	Если Протокол <> Неопределено Тогда
		НСтр.ПримерЗначения = Формат(Протокол.Договор.Номер, "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да");
	КонецЕсли;
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##ДатаДоговора";
	НСтр.Реквизит = "Дата договора";
	Если Протокол <> Неопределено Тогда
		НСтр.ПримерЗначения = Формат(Протокол.Договор.Дата, "ЧДЦ=2; ЧН=; ЧГ=; ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да");
	КонецЕсли;
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##СрокДействияУсловийПротокола";
	НСтр.Реквизит = "Срок действия условий протокола";
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##СтавкаНДСВознагражденияВТомЧислеКромеТого";
	НСтр.Реквизит = "(Ставка НДС вознаграждения, кроме того или в т.ч.)";
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##НаименованиеПодписиИсполнителяВРодительномПадеже";
	НСтр.Реквизит = "Наименование подписи исполнителя в родительном падеже";
	
	НСтр = Шаблоны.Добавить();
	НСтр.Шаблон = "##НаименованиеПодписиКлиентаВРодительномПадеже";
	НСтр.Реквизит = "Наименование подписи клиента в родительном падеже";
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Шаблоны;
	
КонецФункции

//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
//ок(
//Функция НапечататьДвуязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов) Экспорт
//ок)
Функция НапечататьДвуязычныйПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов, ДопПараметры = Неопределено) Экспорт
	
	ВыводитьФаксимиле = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьФаксимиле", ВыводитьФаксимиле);
		Если ТипЗнч(ВыводитьФаксимиле) <> Тип("Булево") Тогда
			ВыводитьФаксимиле = Ложь;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколДвуязычный", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		// Субботин 78654 20.12.2023 начало
		Если Справочники.Контрагенты.КонтрагентНерезидент(Док.Контрагент) и Док.ТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные
			и док.ФорматПротокола = Перечисления.ФорматПротокола.ПротоколДвуязычный Тогда
			ОбластьШапка.Параметры.ШаблонПунктаРус = "Договорная цена за транспортно-экспедиционные услуги по доставке порожних контейнеров:";
			ОбластьШапка.Параметры.ШаблонПунктаАнгл = "Rate for freight forwarding services for the delivery of empty containers:"			
		Иначе	
			ОбластьШапка.Параметры.ШаблонПунктаРус = "Договорная цена за транспортно-экспедиционные услуги по организации международной перевозки груза в составе:";
			ОбластьШапка.Параметры.ШаблонПунктаАнгл = "Rate for freight forwarding services of international cargo transportation in block train shipment:"
		КонецЕсли;
		// Субботин 78654 20.12.2023 Конец
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
		ОбластьШапка.Параметры.ГородПодписанияАнгл = Док.ГородПодписания.НаименованиеАнгл;
		ОбластьШапка.Параметры.НомерПСЦ = Док.КлиентскийНомер;
		ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ОрганизацияПолноеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.ОрганизацияКраткоеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьШапка.Параметры.ОрганизацияПолноеРус = НаименованияНаДату.НаименованиеПолное;
		ОбластьШапка.Параметры.ОрганизацияКраткоеРус = НаименованияНаДату.НаименованиеСокращенное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьОргРус = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИООргРус = НашРуководитель.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеРус = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.КлиентПолноеРус = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.КлиентДолжностьРус = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.КлиентФИОРус = РуководительКонтрагента.ФИОРПРус ;
		
		//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, начало (перенёс, код был расположен ниже)
		ОбластьШапка.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл;
		ОбластьШапка.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл;
		ОбластьШапка.Параметры.ОснованиеЕнг = НашРуководитель.ОснованиеАнгл;
		//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, конец
		
		//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, начало
		ЗначенияРеквизитов_ДоверенностьЗаРуководителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док.ДоверенностьЗаРуководителя,"ДолжностьРодительныйПадеж,ФИОПодписантаДляПротокола,ОснованиеДляПодписанияРП,ДолжностьАнгл,Физлицо.ФамилияИнициалыАнгл,ОснованиеДляПодписанияАнгл,ФИОПодписанта,ОснованиеДляПодписания,Должность");
		//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, конец
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
			//ОбластьШапка.Параметры.ДолжностьОргРус = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			//ОбластьШапка.Параметры.ФИООргРус = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			//ОбластьШапка.Параметры.ОснованиеРус = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
			//ОбластьШапка.Параметры.ДолжностьОргЕнг = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			//ОбластьШапка.Параметры.ФИООргЕнг = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			//ОбластьШапка.Параметры.ОснованиеЕнг = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			
			//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, начало
			ОбластьШапка.Параметры.ДолжностьОргРус = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИООргРус = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеРус = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
			ОбластьШапка.Параметры.ДолжностьОргЕнг = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ДолжностьАнгл;
			ОбластьШапка.Параметры.ФИООргЕнг = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ФизлицоФамилияИнициалыАнгл;
			ОбластьШапка.Параметры.ОснованиеЕнг = ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ОснованиеДляПодписанияАнгл;
			//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, конец	
		КонецЕсли;
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ОрганизацияПолноеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолноеАнгл, Док.Организация.НаименованиеПолноеАнгл);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолноеАнгл;
		//ОбластьШапка.Параметры.ОрганизацияКраткоеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенноеАнгл, Док.Организация.НаименованиеСокращенноеАнгл);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенноеАнгл;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьШапка.Параметры.ОрганизацияПолноеЕнг = НаименованияНаДату.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.ОрганизацияКраткоеЕнг = НаименованияНаДату.НаименованиеСокращенноеАнгл;
//Евросиб ) Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл;
		//ОбластьШапка.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл;
		//ОбластьШапка.Параметры.ОснованиеЕнг = НашРуководитель.ОснованиеАнгл;
		ОбластьШапка.Параметры.КлиентПолноеЕнг = Док.Контрагент.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.КлиентДолжностьЕнг = РуководительКонтрагента.ДолжностьАнгл;
		ОбластьШапка.Параметры.КлиентФИОЕнг = РуководительКонтрагента.ФИОАнгл;
		
		//Евросиб Коханенко Н.А. 24.03.2026 (( #134359
		//Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
		//	ОбластьШапка.Параметры.КлиентДолжностьЕнг = "" + РуководительКонтрагента.ДолжностьАнгл + " " + РуководительКонтрагента.ОснованиеАнгл;
		//КонецЕсли; 
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеРус) И
				ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
			ОбластьШапка.Параметры.КлиентОснованиеРус = " действующего на основании " + РуководительКонтрагента.ОснованиеРус + ",";
			ОбластьШапка.Параметры.КлиентОснованиеЕнг = " acting by " + РуководительКонтрагента.ОснованиеАнгл + ",";
		КонецЕсли;
		//Евросиб Коханенко Н.А. 24.03.2026 )) #134359 
		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		
		ОбластьМаршрутыШапка = Макет.ПолучитьОбласть("МаршрутыШапка");
		ОбластьМаршрутыШапка.Параметры.Валюта = Док.Валюта.Наименование;
		Результат.Вывести(ОбластьМаршрутыШапка);
		
		Для каждого Стр из Док.ТЧ Цикл
			ОбластьМаршрутыСтрока = Макет.ПолучитьОбласть("МаршрутыСтрока");
			//++ДИТ Гаузер А.В. Ticket#0280813 03.08.2022
			ОбластьМаршрутыСтрока.Параметры.n = Стр.НомерСтроки;
			//--ДИТ Гаузер А.В. Ticket#0280813 03.08.2022
			ОбластьМаршрутыСтрока.Параметры.ПАРус = Стр.ПунктОтправленияRUS;
			ОбластьМаршрутыСтрока.Параметры.ППРус = Стр.ПортПогрузкиRUS;
			ОбластьМаршрутыСтрока.Параметры.ПДРус = Стр.ПунктДоставкиRUS;
			ОбластьМаршрутыСтрока.Параметры.ПАЕнг = Стр.ПунктОтправленияENG;
			ОбластьМаршрутыСтрока.Параметры.ППЕнг = Стр.ПортПогрузкиENG;
			ОбластьМаршрутыСтрока.Параметры.ПДЕнг = Стр.ПунктДоставкиENG;
			ОбластьМаршрутыСтрока.Параметры.ТипКТК = Стр.ТипКТК;
			ОбластьМаршрутыСтрока.Параметры.Ставка = Формат(Стр.СуммаСНДС, "ЧДЦ=2; ЧН=Отсутствует; ЧГ=");
			Результат.Вывести(ОбластьМаршрутыСтрока);
		КонецЦикла;
		
		/////////////////
		
		Если ЗначениеЗаполнено(Док.ПримечанияВариантовМаршрута) тогда
			БлокДопПримечания = Макет.ПолучитьОбласть("БлокДопПримечания");
			БлокДопПримечания.Параметры.ТекстДопПримечания = Док.ПримечанияВариантовМаршрута;
			Результат.Вывести(БлокДопПримечания);
		КонецЕсли;
		
		/////////////////
		
		ОСтрока = Макет.ПолучитьОбласть("ТекстБлока");
		ОСтрока.Параметры.n = "1.1.";
		Острока.Параметры.ТекстБлокаРус = "Договорная цена облагается НДС по ставке " + Док.СтавкаНДС + " и включает:";
		Острока.Параметры.ТекстБлокаАнгл = "The rate is subject to VAT " + Док.СтавкаНДС + " and includes:";
		Результат.Вывести(ОСтрока);
		
		ОСтрока = Макет.ПолучитьОбласть("ТекстБлока");		
		Результат.Вывести(ОСтрока);
		
		/////////////////
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
		ВсегоПунктов = Док.ПунктыПСЦ.Количество();
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		Для каждого Стр из Док.ПунктыПСЦ Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("Заголовок");
				ОбластьЗаголовок.Параметры.ЗаголовокРус		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ЗаголовокАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("Подзаголовок");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ПодзаголовокРус		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ПодзаголовокАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус	= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ТекстБлокаАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			КонецЕсли;
			
		КонецЦикла;
		
		/////////////////
		Если ЗначениеЗаполнено(Док.ПримечанияПунктовИУсловийПСЦ) тогда
			БлокДопПримечания = Макет.ПолучитьОбласть("БлокДопПримечания");
			БлокДопПримечания.Параметры.ТекстДопПримечания = Док.ПримечанияПунктовИУсловийПСЦ;
			//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(БлокДопПримечания);
			СтрокаСПодвалом.Добавить(ОбластьПодвал);
			РезультатПроверкиВывода = ПечатьБухгалтерскихДокументов.ПроверитьВыводТабличногоДокумента(Результат, СтрокаСПодвалом);
			
			Если Не РезультатПроверкиВывода Тогда 
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			
			Результат.Вывести(БлокДопПримечания);
		КонецЕсли;
		/////////////////
		
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		// определили эту переменную выше в коде
		//ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.ОрганизацияКраткоеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ОрганизацияКраткоеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенноеАнгл, Док.Организация.НаименованиеСокращенноеАнгл); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенноеАнгл;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьПодвал.Параметры.ОрганизацияКраткоеРус = НаименованияНаДату.НаименованиеСокращенное;
		ОбластьПодвал.Параметры.ОрганизацияКраткоеЕнг = НаименованияНаДату.НаименованиеСокращенноеАнгл;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.ФИООргРус2 = НашРуководитель.ФИОРус;
		ОбластьПодвал.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл;
		ОбластьПодвал.Параметры.ДолжностьОргРус = НашРуководитель.ДолжностьРус;
		ОбластьПодвал.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл;
		ОбластьПодвал.Параметры.КлиентФИОЕнг = РуководительКонтрагента.ФИОАнгл;
		ОбластьПодвал.Параметры.КлиентФИОРус = РуководительКонтрагента.ФИОРус;
		
		ОбластьПодвал.Параметры.КлиентДолжностьЕнг = РуководительКонтрагента.ДолжностьАнгл;
		ОбластьПодвал.Параметры.КлиентДолжностьРус = РуководительКонтрагента.ДолжностьРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			//ОбластьПодвал.Параметры.ФИООргРус2 = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			//ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;   
			//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, начало
			ОбластьПодвал.Параметры.ФИООргРус2 = ""+ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ ЗначенияРеквизитов_ДоверенностьЗаРуководителя.Должность;  
			ОбластьПодвал.Параметры.ФИООргЕнг = "" + ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ФизлицоФамилияИнициалыАнгл+Символы.ПС+ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ОснованиеДляПодписанияАнгл;
			ОбластьПодвал.Параметры.ДолжностьОргЕнг ="" + ЗначенияРеквизитов_ДоверенностьЗаРуководителя.ДолжностьАнгл;			
			//ДИТ, Беляев СЮ, Ticket#0270398, 04-05-2022, конец
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
			ОбластьПодвал.Параметры.КлиентДолжностьЕнг = "" + РуководительКонтрагента.ДолжностьАнгл + " " + РуководительКонтрагента.ОснованиеАнгл;
		КонецЕсли;
		
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
		Если ВыводитьФаксимиле Тогда
			//ок(
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
					ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
				КонецЕсли;
			КонецЕсли;
			//ок)
		КонецЕсли;
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец 
		
		//ДИТ Авдеева В.С. 0282110 30.08.2022 Начало
		Если НЕ Результат.ПроверитьВывод(ОбластьПодвал) Тогда
            Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		//ДИТ Авдеева В.С. 0282110 30.08.2022 Конец
		
		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция НапечататьОдноязычный2ПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколОдноязычный", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьШапка.Параметры.НомерПротокола = Док.КлиентскийНомер;
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
		ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);

		ОбластьШапка.Параметры.ПолноеНаименование  = НаименованияНаДату.НаименованиеПолное;
		ОбластьШапка.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьРуководителя = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИОРуководителя = НашРуководитель.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеРуководителя = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование;
		ОбластьШапка.Параметры.ДолжностьРукКлиента = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРПРус ;
		ОбластьШапка.Параметры.ОснованиеКлиента = РуководительКонтрагента.ОснованиеРус ;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
			ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			
			//ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.Должность;
			//ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписанта;
			ОбластьШапка.Параметры.ОснованиеРуководителя = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
		КонецЕсли;

		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		ТЧВспомогательная = Док.ТЧ.Выгрузить();
		ТЧВспомогательная.Свернуть("ПунктОтправленияRUS, ПунктДоставкиRUS, ВидПеревозки, ТерриторияМаршрута");
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		Для каждого СтрВ из ТЧВспомогательная ЦИкл
			ОбластьЗаголовок.Параметры.Заголовок = "Маршрут следования (ст.отправления-ст.назначения): "+ СтрВ.ПунктОтправленияRUS + " - " + СтрВ.ПунктДоставкиRUS;
			Результат.Вывести(ОбластьЗаголовок);
			ОбластьЗаголовок.Параметры.Заголовок = "Вид перевозки: " + СтрВ.ВидПеревозки;
			Результат.Вывести(ОбластьЗаголовок);
			ОбластьЗаголовок.Параметры.Заголовок = "Территория маршрута: " + СтрВ.ТерриторияМаршрута;
			Результат.Вывести(ОбластьЗаголовок);
			
			//Евросиб Каблов М.Б. 31.10.2019 (
			//ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл1");
			//Результат.Вывести(ОбластьШапкаТаблицы);
			
			//ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблица");
			//Евросиб Каблов М.Б. 31.10.2019 )
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ПунктОтправленияRUS" , СтрВ.ПунктОтправленияRUS);
			СтруктураОтбора.Вставить("ПунктДоставкиRUS", СтрВ.ПунктДоставкиRUS);
			
			Строки = Док.ТЧ.НайтиСтроки(СтруктураОтбора);
			
			//Евросиб Каблов М.Б. 31.10.2019 (
			ВыводитьДопУсловия = Ложь;
			Для Каждого СтрокаТЧ Из Строки Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.ДопУсловия) Тогда
					ВыводитьДопУсловия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ВыводитьДопУсловия Тогда
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл1");
				ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблица");
			Иначе
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл1БезДопУсловий");
				ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаБезДопУсловий");
			КонецЕсли;
			Результат.Вывести(ОбластьШапкаТаблицы);			
			//Евросиб Каблов М.Б. 31.10.2019 )
			
			НомерСтроки = 1;
			Для каждого Стр из Строки Цикл
				ОбластьСтрока.Параметры.n = НомерСтроки;
				ОбластьСтрока.Параметры.НаименованиеУслуги = Стр.Услуга;
				ОбластьСтрока.Параметры.НаименованиеГруза = Стр.Груз;
				ОбластьСтрока.Параметры.ТипСостава = Стр.ВидПС;
				ОбластьСтрока.Параметры.ПринадлежностьСостава = Стр.ПринадлежностьПС;
				Если ВыводитьДопУсловия Тогда
					ОбластьСтрока.Параметры.ДопУсловие = Стр.ДопУсловия;
				КонецЕсли;
				ОбластьСтрока.Параметры.Цена = Строка(Формат(Стр.СуммаСНДС,"ЧДЦ=2"))+" "+ Стр.Валюта.Наименование + "/конт.";
				ОбластьСтрока.Параметры.СтавкаНДС = Стр.СтавкаНДС;
				Результат.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки+1;
			КонецЦикла;
		КонецЦикла;
					
		/////////////////
		
	
		Для каждого Стр из Док.ПунктыПСЦ Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьЗаголовок");
				ОбластьЗаголовок.Параметры.Заголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьПодзаголовок");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.Подзаголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус	= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			
		КонецЦикла;
		
			/////////////////
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолное, Док.Организация.НаименованиеПолное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		ОбластьПодвал.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
		ОбластьПодвал.Параметры.ПолноеНаименование  = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.ФИОРуководителя = НашРуководитель.ФИОРус;
		ОбластьПодвал.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ,"ДФ=dd.MM.yyyy");
		ОбластьПодвал.Параметры.КраткоеНаименованиеКлиента  =  Док.Контрагент.Наименование;
		ОбластьПодвал.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьПодвал.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителя = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			//ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
			ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
			ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
				ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
			ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
			ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;

		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция НапечататьОдноязычный3ПСЦ_ПоПростомуБезЭтихВашихБСП(МассивОбъектов) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколОдноязычный", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьШапка.Параметры.НомерПротокола = Док.КлиентскийНомер;
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
		ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		
		ОбластьШапка.Параметры.ПолноеНаименование = НаименованияНаДату.НаименованиеПолное;
		ОбластьШапка.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьРуководителя = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИОРуководителя = НашРуководитель.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеРуководителя = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование;
		ОбластьШапка.Параметры.ДолжностьРукКлиента = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРПРус ;
		ОбластьШапка.Параметры.ОснованиеКлиента = РуководительКонтрагента.ОснованиеРус ;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
			ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			
			//ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.Должность;
			//ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписанта;
			
			ОбластьШапка.Параметры.ОснованиеРуководителя = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
		КонецЕсли;

		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		ТЧВспомогательная = Док.ТЧ.Выгрузить();
		ТЧВспомогательная.Свернуть("ВидПеревозки,ТерриторияМаршрута");
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		Для каждого СтрВ из ТЧВспомогательная Цикл
			ОбластьЗаголовок.Параметры.Заголовок = "Вид перевозки: " + СтрВ.ВидПеревозки;
			Результат.Вывести(ОбластьЗаголовок);
			ОбластьЗаголовок.Параметры.Заголовок = "Территория маршрута: " + СтрВ.ТерриторияМаршрута;
			Результат.Вывести(ОбластьЗаголовок);
			
			//Евросиб Каблов М.Б. 31.10.2019 (
			//ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл4");
			//Результат.Вывести(ОбластьШапкаТаблицы);
			//
			//ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблица1");
			//Евросиб Каблов М.Б. 31.10.2019 )
			
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ВидПеревозки" , СтрВ.ВидПеревозки);
			СтруктураОтбора.Вставить("ТерриторияМаршрута", СтрВ.ТерриторияМаршрута);
			
			Строки = Док.ТЧ.НайтиСтроки(СтруктураОтбора);
			
			//Евросиб Каблов М.Б. 31.10.2019 (
			ВыводитьДопУсловия = Ложь;
			Для Каждого СтрокаТЧ Из Строки Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.ДопУсловия) Тогда
					ВыводитьДопУсловия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ВыводитьДопУсловия Тогда
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл4");						
				ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблица1");
			Иначе
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл4БезДопУсловий");						
				ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьТаблица1БезДопУсловий");
			КонецЕсли;
			
			Результат.Вывести(ОбластьШапкаТаблицы);
			//Евросиб Каблов М.Б. 31.10.2019 )
			
			НомерСтроки = 1;
			Для каждого Стр из Строки Цикл
				ОбластьСтрока.Параметры.n = НомерСтроки;
				ОбластьСтрока.Параметры.НаименованиеУслуги = Стр.Услуга;
				ОбластьСтрока.Параметры.МаршрутСледования = Стр.ПунктОтправленияRUS + "-" + Стр.ПунктДоставкиRUS;
				ОбластьСтрока.Параметры.НаименованиеГруза = Стр.Груз;
				ОбластьСтрока.Параметры.ТипСостава = Стр.ВидПС;
				ОбластьСтрока.Параметры.ПринадлежностьСостава = Стр.ПринадлежностьПС;
				//Евросиб Каблов М.Б. 31.10.2019 (
				Если ВыводитьДопУсловия Тогда
					ОбластьСтрока.Параметры.ДопУсловие = Стр.ДопУсловия;
				КонецЕсли;
				//Евросиб Каблов М.Б. 31.10.2019 )
				ОбластьСтрока.Параметры.Цена = Строка(Формат(Стр.СуммаСНДС,"ЧДЦ=2"))+" "+ Стр.Валюта.Наименование + "/вагон";
				ОбластьСтрока.Параметры.СтавкаНДС = Стр.СтавкаНДС;
				Результат.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки+1;
			КонецЦикла;
		КонецЦикла;
					
		/////////////////
		
	
		Для каждого Стр из Док.ПунктыПСЦ Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьЗаголовок");
				ОбластьЗаголовок.Параметры.Заголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ОбластьПодзаголовок");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.Подзаголовок		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус	= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			
		КонецЦикла;
		
			/////////////////
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолное, Док.Организация.НаименованиеПолное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		ОбластьПодвал.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
		ОбластьПодвал.Параметры.ПолноеНаименование  = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.ФИОРуководителя = НашРуководитель.ФИОРус;
		ОбластьПодвал.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ,"ДФ=dd.MM.yyyy");
		ОбластьПодвал.Параметры.КраткоеНаименованиеКлиента  =  Док.Контрагент.Наименование;
		ОбластьПодвал.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьПодвал.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителя = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			//ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
			ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
			ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
				ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
			ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
			ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;

		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция НапечататьОдноязычныйУниверсальныйПротокол(Протоколы, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	ВыводитьФаксимиле = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьФаксимиле", ВыводитьФаксимиле);
		Если ТипЗнч(ВыводитьФаксимиле) <> Тип("Булево") Тогда
			ВыводитьФаксимиле = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Первый = Истина;
	Для каждого Протокол из Протоколы Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколОдноязычныйУниверсальный", Протокол.Контрагент, Протокол.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Протокол);	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПСЦ.КлиентскийНомер КАК НомерПротокола,
		|	ПСЦ.ДатаПСЦ КАК ДатаПротокола,
		|	ПСЦ.Договор.Номер КАК НомерДоговора,
		|	ПСЦ.Договор.Дата КАК ДатаДоговора,
		|	ПСЦ.ГородПодписания.Наименование КАК ГородПодписания,
		|	ВЫБОР
		|		КОГДА Организации.Ссылка ЕСТЬ NULL
		|			ТОГДА ПСЦ.Организация.НаименованиеПолное
		|		ИНАЧЕ Организации.НаименованиеПолное
		|	КОНЕЦ КАК НаименованиеИсполнителя,
		|	ПСЦ.НаименованиеПодписиИсполнителя КАК НаименованиеПодписиИсполнителя,
		|	ПСЦ.Контрагент.НаименованиеПолное КАК НаименованиеКлиента,
		|	ПСЦ.НаименованиеПодписиКлиента КАК НаименованиеПодписиКлиента,
		|	ПСЦ.ДоверенностьЗаРуководителя.ФИОПодписанта КАК ДоверенностьЗаРуководителяФИОПодписанта,
		|	ПСЦ.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола КАК ДоверенностьЗаРуководителяФИОПодписантаВРодительномПадеже,
		|	ПСЦ.ДоверенностьЗаРуководителя.Должность КАК ДоверенностьЗаРуководителяДолжность,
		|	ПСЦ.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж КАК ДоверенностьЗаРуководителяДолжностьРодительныйПадеж,
		|	ПСЦ.ДоверенностьЗаРуководителя.ОснованиеДляПодписания КАК ДоверенностьЗаРуководителяОснованиеДляПодписания,
		|	ПСЦ.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП КАК ДоверенностьЗаРуководителяОснованиеВРодительномПадеже,
		|	ПСЦ.ДоверенностьЗаРуководителя.ФайлФаксимиль КАК ДоверенностьЗаРуководителяФайлФаксимиль,
		|	ПСЦ.ДоверенностьЗаРуководителя.ФайлПечать КАК ДоверенностьЗаРуководителяФайлПечать,
		|	ВЫБОР
		|		КОГДА Организации.Ссылка ЕСТЬ NULL
		|			ТОГДА ПСЦ.Организация
		|		ИНАЧЕ Организации.Ссылка
		|	КОНЕЦ КАК Организация,
		|	ПСЦ.Контрагент КАК Контрагент,
		|	ПСЦ.РуководительКонтрагента КАК РуководительКонтрагента,
		|	ПСЦ.РуководительКонтрагента.Наименование КАК ФИОРуководителяКлиента,
		|	ПСЦ.ФорматПротокола КАК ФорматПротокола
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ПСЦ.Организация.ГоловнаяОрганизация = Организации.Ссылка
		|ГДЕ
		|	ПСЦ.Ссылка = &Ссылка";
		ДанныеШапки = Запрос.Выполнить().Выбрать();
		ДанныеШапки.Следующий();
		
		ДатаПротокола = Формат(ДанныеШапки.ДатаПротокола, "ДФ=dd.MM.yyyy") + "г.";
		ДатаДоговора = Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy") + "г.";
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеШапки);
		ОбластьШапка.Параметры.ДатаПротокола = ДатаПротокола;
		ОбластьШапка.Параметры.ДатаДоговора = ДатаДоговора;
//Евросиб ( Литвинов 21.01.2021 #30025
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(ДанныеШапки.Организация, ДанныеШапки.ДатаПротокола);
		
		ОбластьШапка.Параметры.НаименованиеИсполнителя = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		
		Если ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяДолжностьРодительныйПадеж) И ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяФИОПодписантаВРодительномПадеже) Тогда
			ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = ДанныеШапки.ДоверенностьЗаРуководителяДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителяИсполнителя = ДанныеШапки.ДоверенностьЗаРуководителяФИОПодписантаВРодительномПадеже;
			ОбластьШапка.Параметры.ОснованиеИсполнителя = ДанныеШапки.ДоверенностьЗаРуководителяОснованиеВРодительномПадеже;
		Иначе
			//РуководительИсполнителя = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеШапки.Организация, ДанныеШапки.ДатаПротокола);
			//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
			РуководительИсполнителя = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеШапки.Организация, ДанныеШапки.ДатаПротокола, , , , ТипЗнч(Протокол));
			//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
			ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = РуководительИсполнителя.ДолжностьРус;
			ОбластьШапка.Параметры.ФИОРуководителяИсполнителя = РуководительИсполнителя.ФИОРПРус;			
			ОбластьШапка.Параметры.ОснованиеИсполнителя = РуководительИсполнителя.ОснованиеРус;
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКлиента = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеШапки.Контрагент, ДанныеШапки.ДатаПротокола, ДанныеШапки.РуководительКонтрагента);
		//РуководительКлиента = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеШапки.Контрагент, ДанныеШапки.ДатаПротокола, ДанныеШапки.РуководительКонтрагента,, Протокол.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКлиента = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеШапки.Контрагент, ДанныеШапки.ДатаПротокола, ДанныеШапки.РуководительКонтрагента,, Протокол.ПСЦПоставщика, ТипЗнч(Протокол));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = РуководительКлиента.ДолжностьРП;
		ОбластьШапка.Параметры.ФИОРуководителяКлиента = РуководительКлиента.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеКлиента = РуководительКлиента.ОснованиеРус;
		Результат.Вывести(ОбластьШапка);
		
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		//++ Ticket#0236200, Зубов, 29.06.2021
		ОбластьРазделБезОтступа = Макет.ПолучитьОбласть("РазделБезОтступа");
		//-- Ticket#0236200, Зубов, 29.06.2021
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПСЦПунктыПСЦ.Ссылка КАК Ссылка,
		|	ПСЦПунктыПСЦ.НомерСтроки КАК НомерСтроки,
		|	ПСЦПунктыПСЦ.Заголовок КАК Заголовок,
		|	ПСЦПунктыПСЦ.НомерПункта КАК НомерПункта,
		|	ПСЦПунктыПСЦ.ТекстПунктаРус КАК ТекстПунктаРус,
		|	ПСЦПунктыПСЦ.ТекстПунктаАнгл КАК ТекстПунктаАнгл,
		|	ПСЦПунктыПСЦ.Отредактировано КАК Отредактировано,
		|	ПСЦПунктыПСЦ.ПроверяющийИзменениеДанногоПункта КАК ПроверяющийИзменениеДанногоПункта,
		|	ПСЦПунктыПСЦ.Предопределенный КАК Предопределенный,
		|	ПСЦПунктыПСЦ.ПередТаблицей КАК ПередТаблицей,
		|	ПСЦПунктыПСЦ.ВложенныйСписок КАК ВложенныйСписок,
		|	ПСЦПунктыПСЦ.ЭтоТаблица КАК ЭтоТаблица,
		|	ПСЦПунктыПСЦ.ЭлементПечатнойФормы КАК ЭлементПечатнойФормы,
		|	ПСЦПунктыПСЦ.Отступ КАК Отступ
		|ИЗ
		|	Документ.ПСЦ.ПунктыПСЦ КАК ПСЦПунктыПСЦ
		|ГДЕ
		|	ПСЦПунктыПСЦ.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Пункты = Запрос.Выполнить().Выгрузить();
		КоличествоПунктов = Пункты.Количество();
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		
		Для ИндексСтроки = 0 По КоличествоПунктов - 2 Цикл
			Пункт = Пункты[ИндексСтроки];
			Если Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаНДС
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВознаграждение
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВозмещаемыеРасходы Тогда
				ВывестиТаблицуПротокола(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы, ДанныеШапки.ФорматПротокола);				
			Иначе
				ОбластьРаздел.Область().Отступ = Пункт.Отступ;
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, начало
				ОбластьРазделБезОтступа.Область().Отступ = Пункт.Отступ;
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, конец
				ТекстПункта = Документы.ПСЦ.ОтработатьШаблоны(Протокол, Пункт.ТекстПунктаРус);
				//ТекстПункта = СокрЛП(ТекстПункта);
				НомерПункта = СокрЛП(Пункт.НомерПункта);
				Если ЗначениеЗаполнено(НомерПункта) Тогда
					Если СтрНайти(НомерПункта, ".") = 0 Тогда
						НомерПункта = НомерПункта + ".";
					КонецЕсли;					                                      
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, начало (закомментировал)
				//	ОбластьРаздел.Параметры.Текст = НомерПункта + " " + ТекстПункта;
				//Иначе
				//	ОбластьРаздел.Параметры.Текст = ТекстПункта;
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, конец (закомментировал)
				КонецЕсли;
				////++ Ticket#0236200, Зубов, 29.06.2021
				//Если НомерПункта="3." Тогда
				//	Если СтрЧислоСтрок(ТекстПункта)>65 Тогда
				//		МассивСтрок = СтрРазделить(ТекстПункта,Символы.ПС);
				//		ПерваяСтрока = Истина;
				//		Для каждого Строка из МассивСтрок Цикл
				//			Если ПерваяСтрока Тогда							
				//				Строка = НомерПункта +" "+ Строка;
				//				ПерваяСтрока = Ложь;
				//				ОбластьРаздел.Параметры.Текст = Строка;
				//				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//				//Результат.Вывести(ОбластьРаздел);
				//				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
				//				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//			Иначе
				//				ОбластьРазделБезОтступа.Область().Отступ = Пункт.Отступ;
				//				ОбластьРазделБезОтступа.Параметры.Текст = Строка;
				//				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//				//Результат.Вывести(ОбластьРазделБезОтступа);
				//				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРазделБезОтступа, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
				//				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//			КонецЕсли;					
				//		КонецЦикла;
				//	Иначе
				//		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//		//Результат.Вывести(ОбластьРаздел);
				//		ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
				//		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//	КонецЕсли;
				//Иначе                             	
				//	//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//	//Результат.Вывести(ОбластьРаздел);
				//	ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
				//	//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//КонецЕсли;
				////-- Ticket#0236200, Зубов, 29.06.2021
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, начало
				МассивСтрок = СтрРазделить(ТекстПункта,Символы.ПС);
				ПерваяСтрока = Истина;
				Для каждого Строка из МассивСтрок Цикл
					Если ПерваяСтрока Тогда							
						Строка = НомерПункта +" "+ Строка;
						ПерваяСтрока = Ложь;
						ОбластьРаздел.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					Иначе
						ОбластьРазделБезОтступа.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРазделБезОтступа, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					КонецЕсли;					
				КонецЦикла;
				//ДИТ, Беляев СЮ, BUG 61593 / TASK 64562, 04-05-2023, конец
			КонецЕсли;			
		КонецЦикла;
		
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		// определили эту переменную выше в коде
		//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДанныеШапки);
		
		Если ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяФИОПодписанта) Тогда
			//Евросиб Коханенко Н.А. 15.01.2025 (( #97554 
			//ОбластьПодвал.Параметры.ФИОРуководителя = ""+ДанныеШапки.ДоверенностьЗаРуководителяФИОПодписанта+Символы.ПС+ДанныеШапки.ДоверенностьЗаРуководителяОснованиеДляПодписания;
			ОбластьПодвал.Параметры.ФИОРуководителя = "" + ДанныеШапки.ДоверенностьЗаРуководителяФИОПодписанта;
			Если ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяОснованиеВРодительномПадеже) Тогда
				ОбластьПодвал.Параметры.ФИОРуководителя = ОбластьПодвал.Параметры.ФИОРуководителя + Символы.ПС + "На основании " + ДанныеШапки.ДоверенностьЗаРуководителяОснованиеВРодительномПадеже;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 15.01.2025 )) #97554
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.01.2025 (( #97554 
		////Евросиб Каблов 28.01.2021 (
		//Если ЗначениеЗаполнено(РуководительКлиента.Основание) Тогда
		//    //ОбластьПодвал.Параметры.ФИОРуководителяКлиента = ДанныеШапки.ФИОРуководителяКлиента + Символы.ПС + РуководительКлиента.Основание;		
		//	//ДИТ, Беляев СЮ, Ticket#0256511, 12-01-2022, ++
		//	ОбластьПодвал.Параметры.ФИОРуководителяКлиента = Строка(ДанныеШапки.ФИОРуководителяКлиента) + Символы.ПС + Строка(РуководительКлиента.Основание);
		//	//ДИТ, Беляев СЮ, Ticket#0256511, 12-01-2022, --
		//КонецЕсли; 
		////Евросиб Каблов 28.01.2021 )
		ОбластьПодвал.Параметры.ФИОРуководителяКлиента = "" + ?(ЗначениеЗаполнено(ДанныеШапки.ФИОРуководителяКлиента), ДанныеШапки.ФИОРуководителяКлиента, "") + 
			?(ЗначениеЗаполнено(РуководительКлиента.ОснованиеРус), Символы.ПС + "На основании " + РуководительКлиента.ОснованиеРус, "");
		//Евросиб Коханенко Н.А. 15.01.2025 )) #97554
		
		Если ВыводитьФаксимиле Тогда
			Если ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяФайлФаксимиль) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(ДанныеШапки.ДоверенностьЗаРуководителяФайлФаксимиль);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
					ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеШапки.ДоверенностьЗаРуководителяФайлПечать) тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(ДанныеШапки.ДоверенностьЗаРуководителяФайлПечать);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
		ОбластьПодвал.Параметры.ДатаПротокола = ДатаПротокола;
		
		ТабДокПроверкиВывода = Новый ТабличныйДокумент;
		Если КоличествоПунктов > 0 Тогда
			Пункт = Пункты[КоличествоПунктов - 1];
			Если Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаНДС
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВознаграждение
					Или Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВозмещаемыеРасходы Тогда
				ВывестиТаблицуПротокола(ТабДокПроверкиВывода, Макет, Протокол, Пункт.ЭлементПечатнойФормы, ДанныеШапки.ФорматПротокола);				
			Иначе
				ОбластьРаздел.Область().Отступ = Пункт.Отступ;
				ТекстПункта = Документы.ПСЦ.ОтработатьШаблоны(Протокол, Пункт.ТекстПунктаРус);
				НомерПункта = СокрЛП(Пункт.НомерПункта);
				Если ЗначениеЗаполнено(НомерПункта) Тогда
					Если СтрНайти(НомерПункта, ".") = 0 Тогда
						НомерПункта = НомерПункта + ".";
					КонецЕсли;					
					ОбластьРаздел.Параметры.Текст = НомерПункта + " " + ТекстПункта;
				Иначе
					ОбластьРаздел.Параметры.Текст = ТекстПункта;
				КонецЕсли;
				
				ТабДокПроверкиВывода.Вывести(ОбластьРаздел);		
			КонецЕсли;
		КонецЕсли;
		
//Евросиб ( Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.НаименованиеИсполнителя = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ТабДокПроверкиВывода.Вывести(ОбластьПодвал);
		
		Если Не Результат.ПроверитьВывод(ТабДокПроверкиВывода) Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		Результат.Вывести(ТабДокПроверкиВывода);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ВывестиТаблицуПротокола(ТабДок, Макет, Протокол, ЭлементПечатнойФормы, ФорматПротокола)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦТЧ.НомерСтроки КАК НомерСтроки,
	|	ПСЦТЧ.Услуга КАК Услуга,
	|	ЕСТЬNULL(ПСЦТЧ.ПунктОтправления.Наименование, """") КАК ПунктОтправленияНаименование,
	|	ЕСТЬNULL(ПСЦТЧ.ПунктНазначения.Наименование, """") КАК ПунктНазначенияНаименование,
	|	ПСЦТЧ.ПунктОтправленияRUS КАК ПунктОтправления,
	|	ПСЦТЧ.ПунктДоставкиRUS КАК ПунктДоставки,
	|	ПСЦТЧ.ВидПеревозки.Наименование КАК ВидПеревозки,
	|	ПСЦТЧ.ТерриторияМаршрута.Наименование КАК ТерриторияМаршрута,
	|	ПСЦТЧ.ТипКТК КАК ТипКТК,
	|	ПСЦТЧ.ВидПС КАК ВидПС,
	|	ПСЦТЧ.ПринадлежностьПС КАК ПринадлежностьПС,
	|	ПСЦТЧ.УсловияПеревозки_Отправление КАК УсловияПеревозки_Отправление,
	|	ПСЦТЧ.УсловияПеревозки_Прибытие КАК УсловияПеревозки_Прибытие,
	|	ПСЦТЧ.ДопУсловия КАК ДопУсловия,
	|	ПСЦТЧ.ТипСтавки КАК ТипСтавки,
	|	ПСЦТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ПСЦТЧ.Валюта КАК ВалютаСтавки,
	|	ПСЦТЧ.Валюта.Наименование КАК ВалютаНаименование,
	|	ПСЦТЧ.СуммаБезНДС КАК ДоговорнаяЦенаБезУчетаНДС,
	|	ВЫБОР
	|		КОГДА ПСЦТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПСЦТЧ.СуммаСНДС
	|		ИНАЧЕ ПСЦТЧ.СуммаБезНДС
	|	КОНЕЦ КАК ДоговорнаяЦена,
	|	ПСЦТЧ.СуммаСНДС КАК ДоговорнаяЦенаСУчетомНДС,
	|	ПСЦТЧ.СуммаНДС КАК ДоговорнаяЦенаНДС,
	|	ПСЦТЧ.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	ПСЦТЧ.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ПСЦТЧ.СуммаВознагражденияБезНДС КАК СуммаВознагражденияБезНДС,
	|	ПСЦТЧ.СуммаВознагражденияСНДС КАК СуммаВознагражденияСНДС,
	|	ПСЦТЧ.КТКЕвросиб КАК КТКЕвросиб,
	|	ПСЦТЧ.Груз КАК Груз,
	|	ПСЦТЧ.Валюта.СокращенноеНаименование КАК ВалютаСокр,
	|	ПСЦТЧ.БазаДляРасчетаВР КАК БазаДляРасчетаВР,
	|	ПСЦТЧ.СпециальныеУсловия КАК СпециальныеУсловия
	|ИЗ
	|	Документ.ПСЦ.ТЧ КАК ПСЦТЧ
	|ГДЕ
	|	ПСЦТЧ.Ссылка = &Ссылка
	|   //Условия
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПСЦТЧ_МорскаяЧасть.НомерСтроки,
	|	ПСЦТЧ_МорскаяЧасть.Услуга,
	|	ЕСТЬNULL(ПСЦТЧ_МорскаяЧасть.ПунктОтправления.Наименование, """"),
	|	ЕСТЬNULL(ПСЦТЧ_МорскаяЧасть.ПунктНазначения.Наименование, """"),
	|	ПСЦТЧ_МорскаяЧасть.ПунктОтправленияRUS,
	|	ПСЦТЧ_МорскаяЧасть.ПунктДоставкиRUS,
	|	ПСЦТЧ_МорскаяЧасть.ВидПеревозки.Наименование,
	|	ПСЦТЧ_МорскаяЧасть.ТерриторияМаршрута.Наименование,
	|	ПСЦТЧ_МорскаяЧасть.ТипКТК,
	|	ПСЦТЧ_МорскаяЧасть.ВидПС,
	|	ПСЦТЧ_МорскаяЧасть.ПринадлежностьПС,
	|	ПСЦТЧ_МорскаяЧасть.УсловияПеревозки_Отправление,
	|	ПСЦТЧ_МорскаяЧасть.УсловияПеревозки_Прибытие,
	|	ПСЦТЧ_МорскаяЧасть.ДопУсловия,
	|	ПСЦТЧ_МорскаяЧасть.ТипСтавки,
	|	ПСЦТЧ_МорскаяЧасть.СтавкаНДС,
	|	ПСЦТЧ_МорскаяЧасть.Валюта,
	|	ПСЦТЧ_МорскаяЧасть.Валюта.Наименование,
	|	ПСЦТЧ_МорскаяЧасть.СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ПСЦТЧ_МорскаяЧасть.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПСЦТЧ_МорскаяЧасть.СуммаСНДС
	|		ИНАЧЕ ПСЦТЧ_МорскаяЧасть.СуммаБезНДС
	|	КОНЕЦ,
	|	ПСЦТЧ_МорскаяЧасть.СуммаСНДС,
	|	ПСЦТЧ_МорскаяЧасть.СуммаНДС,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ПСЦТЧ_МорскаяЧасть.Груз,
	|	ПСЦТЧ_МорскаяЧасть.Валюта.СокращенноеНаименование,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПСЦ.ТЧ_МорскаяЧасть КАК ПСЦТЧ_МорскаяЧасть
	|ГДЕ
	|	ПСЦТЧ_МорскаяЧасть.Ссылка = &Ссылка";
	//Запрос.Текст = Запрос.Текст + "
	//|	//Условия";
	
	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена
			Или ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаНДС Тогда
		ТекстУсловий = 
		"	И (ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
		|			ИЛИ ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВР)
		|				И (ПСЦТЧ.СуммаБезНДС <> 0
		|					ИЛИ ПСЦТЧ.СуммаСНДС <> 0))";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Условия", ТекстУсловий);
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВознаграждение Тогда
		ТекстУсловий =
		"	И (ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВРиПроцент)
		|				И ПСЦТЧ.ПроцентВознаграждения <> 0
		|			ИЛИ ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВРиЭВ)
		|				И (ПСЦТЧ.СуммаВознагражденияБезНДС <> 0
		|				ИЛИ ПСЦТЧ.СуммаВознагражденияСНДС <> 0))";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Условия", ТекстУсловий);	
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВозмещаемыеРасходы Тогда
		ТекстУсловий =
		"	И (ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВР)
		|				И ПСЦТЧ.СуммаБезНДС = 0
		|				И ПСЦТЧ.СуммаСНДС = 0
		|			ИЛИ ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВРиПроцент)
		|				И ПСЦТЧ.ПроцентВознаграждения = 0
		|			ИЛИ ПСЦТЧ.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.ВРиЭВ)
		|				И ПСЦТЧ.СуммаВознагражденияБезНДС = 0
		|				И ПСЦТЧ.СуммаВознагражденияСНДС = 0)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Условия", ТекстУсловий);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Протокол);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	//ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная));
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ТаблицаДанных.Колонки.Добавить("МаршрутСледования", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("УсловияПеревозки", ОписаниеТипаСтрока);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПунктОтправления) Или ЗначениеЗаполнено(СтрокаТаблицы.ПунктДоставки) Тогда
			Пункты = Новый Массив;
			Пункты.Добавить(СтрокаТаблицы.ПунктОтправления);
			Пункты.Добавить(СтрокаТаблицы.ПунктДоставки);
			СтрокаТаблицы.МаршрутСледования = СтрСоединить(Пункты, " - ");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Или ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Тогда
				ОтправлениеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Отправление);
			Иначе
				ОтправлениеТекст = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
				ПрибытиеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Прибытие);
			Иначе
				ПрибытиеТекст = "";
			КонецЕсли;
			
			СпециальныеУсловия = "";
			Если СтрокаТаблицы.СпециальныеУсловия Тогда
				СпециальныеУсловия = " (специальные условия)";
			КонецЕсли;
			
			СтрокаТаблицы.УсловияПеревозки = ОтправлениеТекст + " - " + ПрибытиеТекст + ?(СтрокаТаблицы.КТКЕвросиб, " + КТК", "") + СпециальныеУсловия;
			
		КонецЕсли;
	КонецЦикла;
	
	ПоляШапки = Новый Массив;
	ЗначенияПолейШапки = Новый Структура;
	ПоляТаблицы = Новый Массив;	
	ПроверяемыеПоля = Новый Массив;
	
	Если ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйВаг Тогда
		
		ПоляТаблицы.Добавить("МаршрутСледования");
		
		ПроверяемыеПоля.Добавить("Услуга");
		ПроверяемыеПоля.Добавить("ВидПеревозки");
		ПроверяемыеПоля.Добавить("ТерриторияМаршрута");
		ПроверяемыеПоля.Добавить("ТипКТК");
		//ПроверяемыеПоля.Добавить("УсловияПеревозки");
		ПроверяемыеПоля.Добавить("ВидПС");
		ПроверяемыеПоля.Добавить("Груз");
		ПроверяемыеПоля.Добавить("ПринадлежностьПС");
		ПроверяемыеПоля.Добавить("ДопУсловия");
		
	ИначеЕсли ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйКТК Тогда
		
		ПоляТаблицы.Добавить("Услуга");
		
		ПроверяемыеПоля.Добавить("МаршрутСледования");
		ПроверяемыеПоля.Добавить("ВидПеревозки");
		ПроверяемыеПоля.Добавить("ТерриторияМаршрута");
		ПроверяемыеПоля.Добавить("ТипКТК");
		ПроверяемыеПоля.Добавить("УсловияПеревозки");
		//ПроверяемыеПоля.Добавить("ВидПС");
		//ПроверяемыеПоля.Добавить("Груз");
		ПроверяемыеПоля.Добавить("ПринадлежностьПС");
		ПроверяемыеПоля.Добавить("ДопУсловия");
		
	Иначе
		
		ПроверяемыеПоля.Добавить("Услуга");		
		ПроверяемыеПоля.Добавить("МаршрутСледования");
		ПроверяемыеПоля.Добавить("ВидПеревозки");
		ПроверяемыеПоля.Добавить("ТерриторияМаршрута");
		ПроверяемыеПоля.Добавить("ТипКТК");
		ПроверяемыеПоля.Добавить("УсловияПеревозки");
		ПроверяемыеПоля.Добавить("ВидПС");
		ПроверяемыеПоля.Добавить("Груз");
		ПроверяемыеПоля.Добавить("ПринадлежностьПС");
		ПроверяемыеПоля.Добавить("ДопУсловия");
		
	КонецЕсли;
	
	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВознаграждение Тогда
		ПроверяемыеПоля.Добавить("БазаДляРасчетаВР");
	КонецЕсли;
	
	Для Каждого ИмяПоля Из ПроверяемыеПоля Цикл
		
		ЗначенияПоля = ПолучитьЗначенияПоля(ТаблицаДанных, ИмяПоля);
		КоличествоЗначений = ЗначенияПоля.Количество();
		Если КоличествоЗначений > 1 Тогда
			ПоляТаблицы.Добавить(ИмяПоля);
		ИначеЕсли КоличествоЗначений = 1 Тогда
			ЗначениеПоля = ЗначенияПоля[0];
			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ПоляШапки.Добавить(ИмяПоля);
				ЗначенияПолейШапки.Вставить(ИмяПоля, ЗначениеПоля);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	//В таблице должно быть как минимум одно поле
	Если ПоляТаблицы.Количество() = 0 Тогда
		ПоляТаблицы.Добавить("Услуга");
		ИндексПоляШапки = ПоляШапки.Найти("Услуга");
		Если ИндексПоляШапки <> Неопределено Тогда
			ПоляШапки.Удалить(ИндексПоляШапки);
		КонецЕсли;
	КонецЕсли;
	
	//Вывод значений над таблицей
	Для Каждого ПолеШапки Из ПоляШапки Цикл
		ИмяОбласти = СтрШаблон("Строка%1", ПолеШапки);
		ОбластьСтрокаШапки = Макет.ПолучитьОбласть(ИмяОбласти);
		ОбластьСтрокаШапки.Параметры.Текст = ЗначенияПолейШапки[ПолеШапки];
		ТабДок.Вывести(ОбластьСтрокаШапки);
	КонецЦикла;
		
	//ПоляТаблицы.Добавить("ВалютаСтавки");
	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда
		ПоляТаблицы.Добавить("ДоговорнаяЦена");
		ПоляТаблицы.Добавить("СтавкаНДС");
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаНДС Тогда
		ПоляТаблицы.Добавить("ДоговорнаяЦенаБезУчетаНДС");
		ПоляТаблицы.Добавить("ДоговорнаяЦенаНДС");
		ПоляТаблицы.Добавить("ДоговорнаяЦенаСУчетомНДС");
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВознаграждение Тогда
		ПоляТаблицы.Добавить("ПроцентВознаграждения");
		ПоляТаблицы.Добавить("СтавкаНДСВознаграждения");
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаВозмещаемыеРасходы Тогда
		//Нет полей ставок
	КонецЕсли;
	
	КолонкиТаблицы = Новый Соответствие;
	КолонкиТаблицы.Вставить("НомерПоПорядку", Новый Структура("Наименование, Ширина", "№ п/п", 2));
	КолонкиТаблицы.Вставить("Услуга", Новый Структура("Наименование, Ширина", "Наименование услуги", 10));
	КолонкиТаблицы.Вставить("МаршрутСледования", Новый Структура("Наименование, Ширина", "Маршрут следования (ст. отправления - ст. назначения)", 14));
	КолонкиТаблицы.Вставить("ВидПеревозки", Новый Структура("Наименование, Ширина", "Вид перевозки", 5));
	КолонкиТаблицы.Вставить("ТерриторияМаршрута", Новый Структура("Наименование, Ширина", "Территория маршрута", 5));
	КолонкиТаблицы.Вставить("ТипКТК", Новый Структура("Наименование, Ширина", "Контейнер", 4));
	КолонкиТаблицы.Вставить("УсловияПеревозки", Новый Структура("Наименование, Ширина", "Условия перевозки по отправлению/условия перевозки по прибытию", 10));
	КолонкиТаблицы.Вставить("ВидПС", Новый Структура("Наименование, Ширина", "Подвижной состав (вид)", 5));
	КолонкиТаблицы.Вставить("Груз", Новый Структура("Наименование, Ширина", "Груз", 5));
	КолонкиТаблицы.Вставить("ПринадлежностьПС", Новый Структура("Наименование, Ширина", "Принадлежность подвижного состава", 4));
	//Евросиб Шевченко А.В. US 114750 TA 114751 17.07.2025
	КолонкиТаблицы.Вставить("ДопУсловия", Новый Структура("Наименование, Ширина", "Дополнительные условия", 11));
	//Евросиб Шевченко А.В. US 114750 TA 114751 17.07.2025
	КолонкиТаблицы.Вставить("БазаДляРасчетаВР", Новый Структура("Наименование, Ширина", "База для расчета возмещаемых расходов", 5));
	КолонкиТаблицы.Вставить("ДоговорнаяЦена", Новый Структура("Наименование, Ширина", "Договорная цена", 5));
	КолонкиТаблицы.Вставить("ДоговорнаяЦенаБезУчетаНДС", Новый Структура("Наименование, Ширина", "Договорная цена (без учета НДС)", 5));
	
	//Ставка НДС для заголовка колонки таблицы
	СтавкаНДСЗаголовкаКолонки = "";
	ТаблицаСтавокНДС = ТаблицаДанных.Скопировать(, "СтавкаНДС");
	ТаблицаСтавокНДС.Свернуть("СтавкаНДС");
	Если ТаблицаСтавокНДС.Количество() = 1 Тогда
		СтавкаНДСЗаголовкаКолонки = Строка(ТаблицаСтавокНДС[0].СтавкаНДС);
	КонецЕсли;
	ЗаголовокКолонки = СтрШаблон("НДС %1", СтавкаНДСЗаголовкаКолонки);
	КолонкиТаблицы.Вставить("ДоговорнаяЦенаНДС", Новый Структура("Наименование, Ширина", ЗаголовокКолонки, 5));
	КолонкиТаблицы.Вставить("ДоговорнаяЦенаСУчетомНДС", Новый Структура("Наименование, Ширина", "Договорная цена (с учетом НДС)", 5));
	
	Если Протокол.СуммаВключаетНДС Тогда
		ЗаголовокКолонки = "Ставка НДС в том числе";
	Иначе
		ЗаголовокКолонки = "Ставка НДС кроме того";
	КонецЕсли;
	КолонкиТаблицы.Вставить("СтавкаНДС", Новый Структура("Наименование, Ширина", ЗаголовокКолонки, 4));
	
	ЗаголовокКолонки = "##НаименованиеУслугиВознагражденияДляДоговорнойЦеныВР ##НаименованиеПодписиИсполнителяВРодительномПадеже";
	ЗаголовокКолонки = Документы.ПСЦ.ОтработатьШаблоны(Протокол, ЗаголовокКолонки);
	
	КолонкиТаблицы.Вставить("ПроцентВознаграждения", Новый Структура("Наименование, Ширина", ЗаголовокКолонки, 4));
	
	Если Протокол.СуммаВознагражденияВключаетНДС Тогда
		ЗаголовокКолонки = "Ставка НДС в том числе";
	Иначе
		ЗаголовокКолонки = "Ставка НДС кроме того";
	КонецЕсли;	
	КолонкиТаблицы.Вставить("СтавкаНДСВознаграждения", Новый Структура("Наименование, Ширина", ЗаголовокКолонки, 4));
	
	ШаблонКоординатШапки = "R1C2:R1C%1";
	ШаблонКоординатСтроки = "R2C2:R2C%1";
		
	СвойстваКолонки = КолонкиТаблицы.Получить("НомерПоПорядку");
	КоординатыОбласти = СтрШаблон(ШаблонКоординатШапки, СвойстваКолонки.Ширина + 1);
	ОбластьШапкаТаблицыНомерПоПорядку = Макет.ПолучитьОбласть(КоординатыОбласти);
	ОбластьШапкаТаблицыНомерПоПорядку.Область().Объединить();
	ОбластьШапкаТаблицыНомерПоПорядку.Параметры.НаименованиеКолонки = "№" + Символы.ПС + "п/п";
	//СвойстваКолонки.Вставить("ОбластьШапка", ОбластьШапкаТаблицы);
	ОбластьОтступ = Макет.ПолучитьОбласть("R1C1:R1C1");
	
	КоординатыОбласти = СтрШаблон(ШаблонКоординатСтроки, СвойстваКолонки.Ширина + 1);
	ОбластьСтрокаТаблицыНомерПоПорядку = Макет.ПолучитьОбласть(КоординатыОбласти);
	ОбластьСтрокаТаблицыНомерПоПорядку.Область().Объединить();
	//СвойстваКолонки.Вставить("ОбластьСтрока", ОбластьСтрокаТаблицы);
	
	ШиринаТаблицы = 0;
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		СвойстваКолонки = КолонкиТаблицы.Получить(ПолеТаблицы);
		ШиринаТаблицы = ШиринаТаблицы + СвойстваКолонки.Ширина;		
	КонецЦикла;
			
	НужнаяШирина = 49;
	Коэффициент = НужнаяШирина / ШиринаТаблицы;
	Если Коэффициент <> 1 Тогда
		ШиринаТаблицы = 0;
		Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
			СвойстваКолонки = КолонкиТаблицы.Получить(ПолеТаблицы);
			СвойстваКолонки.Ширина = Окр(СвойстваКолонки.Ширина * Коэффициент, 0);
			ШиринаТаблицы = ШиринаТаблицы + СвойстваКолонки.Ширина;		
		КонецЦикла;
		Разница = НужнаяШирина - ШиринаТаблицы;
		Если ШиринаТаблицы <> НужнаяШирина И ПоляТаблицы.Количество() > 1 Тогда
			ПолеТаблицы = ПоляТаблицы[1];			
			СвойстваКолонки = КолонкиТаблицы.Получить(ПолеТаблицы);
			СвойстваКолонки.Ширина = СвойстваКолонки.Ширина + Разница;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьОтступ);
	ТабДок.Присоединить(ОбластьШапкаТаблицыНомерПоПорядку);
	
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		
		СвойстваКолонки = КолонкиТаблицы.Получить(ПолеТаблицы);
		
		КоординатыОбласти = СтрШаблон(ШаблонКоординатШапки, СвойстваКолонки.Ширина + 1);
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть(КоординатыОбласти);
		ОбластьШапкаТаблицы.Область().Объединить();
		ОбластьШапкаТаблицы.Параметры.НаименованиеКолонки = ПолучитьСтрокуСПереносами(СвойстваКолонки.Наименование, СвойстваКолонки.Ширина);
		СвойстваКолонки.Вставить("ОбластьШапка", ОбластьШапкаТаблицы);
		
		ТабДок.Присоединить(СвойстваКолонки.ОбластьШапка);
		
		КоординатыОбласти = СтрШаблон(ШаблонКоординатСтроки, СвойстваКолонки.Ширина + 1);
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть(КоординатыОбласти);
		ОбластьСтрокаТаблицы.Область().Объединить();
		СвойстваКолонки.Вставить("ОбластьСтрока", ОбластьСтрокаТаблицы);
		
	КонецЦикла;	
	
	//Формирование и упорядочивание таблицы для вывода
	ТекстПоляТаблицы = СтрСоединить(ПоляТаблицы, ", ");
	ТекстПоляТаблицы = ТекстПоляТаблицы + ", ТипСтавки, ВалютаСокр";
	ТаблицаДляВывода = ТаблицаДанных.Скопировать(, ТекстПоляТаблицы);
	ТаблицаДляВывода.Свернуть(ТекстПоляТаблицы);
	ТаблицаДляВывода.Колонки.Добавить("ПорядокПоТипуСтавки", Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаТаблицы Из ТаблицаДляВывода Цикл
		Если СтрокаТаблицы.ТипСтавки = Перечисления.ТипыСтавокПротокола.Ставка Тогда
			СтрокаТаблицы.ПорядокПоТипуСтавки = 0;
		Иначе
			СтрокаТаблицы.ПорядокПоТипуСтавки = 1;
		КонецЕсли;
	КонецЦикла;
	ТаблицаДляВывода.Сортировать("ПорядокПоТипуСтавки");
	
	//Вывод таблицы
	НомерПоПорядку = 0;
	Для Каждого СтрокаТаблицы Из ТаблицаДляВывода Цикл		
		
		ТабДок.Вывести(ОбластьОтступ);
		
		НомерПоПорядку = НомерПоПорядку + 1;
		ОбластьСтрокаТаблицыНомерПоПорядку.Параметры.ЗначениеПоля = НомерПоПорядку;
		ТабДок.Присоединить(ОбластьСтрокаТаблицыНомерПоПорядку);
		
		Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
			
			СвойстваПоля = КолонкиТаблицы.Получить(ПолеТаблицы);
			
			ТекущаяОбласть = СвойстваПоля.ОбластьСтрока;
			Если ПолеТаблицы = "ПроцентВознаграждения" Тогда
				ТекущаяОбласть.Параметры.ЗначениеПоля = Формат(СтрокаТаблицы[ПолеТаблицы], "ЧДЦ=2; ЧН=0") + "%";
			ИначеЕсли СтрНайти("ДоговорнаяЦена, ДоговорнаяЦенаБезУчетаНДС, ДоговорнаяЦенаНДС, ДоговорнаяЦенаСУчетомНДС", ПолеТаблицы) > 0 Тогда
				СтавкаТекст = Формат(СтрокаТаблицы[ПолеТаблицы], "ЧДЦ=2; ЧН=0.00");
				Если ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйВаг Тогда
					СтавкаТекст = СтрШаблон("%1%2%3/ваг.", СтавкаТекст, Символы.ПС, СтрокаТаблицы.ВалютаСокр);
				ИначеЕсли ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйКТК Или ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
					СтавкаТекст = СтрШаблон("%1%2%3/конт.", СтавкаТекст, Символы.ПС, СтрокаТаблицы.ВалютаСокр);
				КонецЕсли;
				ТекущаяОбласть.Параметры.ЗначениеПоля = СтавкаТекст;				
			Иначе
				ТекстЯчейки = Строка(СтрокаТаблицы[ПолеТаблицы]);	
				ТекущаяОбласть.Параметры.ЗначениеПоля = ПолучитьСтрокуСПереносами(ТекстЯчейки, СвойстваПоля.Ширина);
				//Евросиб Шевченко А.В. US 114750 TA 114751 17.07.2025
				Если ПолеТаблицы = "ДопУсловия" Тогда
					Если СтрНайти(Строка(СтрокаТаблицы[ПолеТаблицы]),Символы.ПС) <> 0 Тогда
						ТекущаяОбласть.Параметры.ЗначениеПоля = Строка(СтрокаТаблицы[ПолеТаблицы]);
					КонецЕсли;
				КонецЕсли;
				//Евросиб Шевченко А.В. US 114750 TA 114751 17.07.2025
			КонецЕсли;
			ТабДок.Присоединить(ТекущаяОбласть);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокуСПереносами(ИсходнаяСтрока, КоличествоЯчеек)
	 	
	//КоличествоСимволов = Цел(КоличествоЯчеек * 1.7);
	//Евросиб(ДИТ), Беляев СЮ, BUG 101636, 24-02-2025, начало
	КоличествоСимволов = Цел(КоличествоЯчеек * 1.5);
	//Евросиб(ДИТ), Беляев СЮ, BUG 101636, 24-02-2025, конец
	Строка2 = ИсходнаяСтрока;
    мСтрок = Новый Массив;
    Пока СтрДлина(СокрЛП(Строка2)) > 0 Цикл
        ИсходнаяСтрока = Строка2;
        Строка1 = "";
        Строка2 = "";
        //Евросиб Коханенко Н.А. 08.09.2025 (( #111204 
		//глПеренестиСловоЛокал(ИсходнаяСтрока, КоличествоСимволов, Строка1, Строка2, -1);
		глПеренестиСловоЛокал(ИсходнаяСтрока, КоличествоСимволов, Строка1, Строка2, 1);
		//Евросиб Коханенко Н.А. 08.09.2025 )) #111204 
		Если Строка1 = "" Тогда
			Слова = СтрРазделить(Строка2, " ");
			Для Каждого Слово Из Слова Цикл 
				мСтрок.Добавить(Слово);
			КонецЦикла;
			Прервать;
		КонецЕсли;
        мСтрок.Добавить(Строка1);		
	КонецЦикла;
	
	Возврат СтрСоединить(мСтрок, Символы.ПС);
	
КонецФункции

// Процедура глПеренестиСлово(_СловоИсточник,_КоличествоСимволов,СловоРезультат1,СловоРезультат2,МягкийПеренос=0)      
//
//	 разбивает исходную строку _СловоИсточник на две строки СловоРезультат1 и СловоРезультат2
//	 при этом в СловоРезультат1 попадает не более _КоличествоСимволов, остальные идут в СловоРезультат2
// 	 параметр МягкийПеренос определяет метод разбиения:
//   МягкийПеренос  =  0   - слова переносятся по слогам;
//   МягкийПеренос  = -1   - слова переносятся по слогам или на символе, не являющемся не буквой не цифрой;
//   МягкийПеренос  =  1   - перенос осуществляется только на символах, не являющихся не буквой не цифрой.
//   Результат возвращается в виде двух строк СловоРезультат1 и СловоРезультат2.
//   
//   Гарантии и предупреждения:
//   отдельные слова делятся на слоги почти всегда корректно; предложения могут переносится некорректно из-за
//   знаков препинания, примыкающих к словам и прочих символов; числа и даты могут переносится некорректно, 
//   если они отформатированы с применением точек, запятых, пробелов и проч. 
// 
//   Рекомендации:
//   если в тексте есть даты и/или форматированные числа, то МягкийПеренос = 0
//   если в тексте нет дат и/или форматированных чисел и необходимо 100% верно перенести слова, то МягкийПеренос=1
//   если в тексте нет дат и/или форматированных чисел то МягкийПеренос=0
//
Процедура глПеренестиСловоЛокал(_СловоИсточник,_КоличествоСимволов,СловоРезультат1,СловоРезультат2,МягкийПеренос=0) Экспорт 
	Алфавит = "абвгдеёжзийклмнопрстуфхцчшщьъыэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЪЫЭЮЯ";
	Цифры = "0123456789";
	Гласные = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"; 
	Согласные = "бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ";
	СловоРезультат1 = "";
	СловоРезультат2 = "";
	СловоИсточник = СокрЛП(_СловоИсточник);
	КоличествоСимволов = Число(_КоличествоСимволов);
	Если КоличествоСимволов <= 2 Тогда
		СловоРезультат2 = СловоИсточник;
		Возврат;
	ИначеЕсли КоличествоСимволов >= СтрДлина(СловоИсточник) Тогда
		СловоРезультат1 = СловоИсточник;
		Возврат;
	КонецЕсли; 
	
	СловоРезультат1 = Лев(СловоИсточник,КоличествоСимволов);
	СловоРезультат2 = Сред(СловоИсточник,КоличествоСимволов+1);
	
	//мягкий перенос - только на знаках-не-буквах-не-цифрах
	Если МягкийПеренос > 0 Тогда 
		Пока СтрДлина(СловоРезультат1) > 0 Цикл
			Б2 = Прав(СловоРезультат1,1);
			Если (Найти(Алфавит,Б2) = 0) И (Найти(Цифры,Б2) = 0) Тогда
				Прервать;
			КонецЕсли;
			Если СтрДлина(СловоРезультат1) = 1 Тогда
				СловоРезультат1 = "";
				СловоРезультат2 = Б2 + СловоРезультат2;
			Иначе
				СловоРезультат1 = Лев(СловоРезультат1,СтрДлина(СловоРезультат1)-1);
				СловоРезультат2 = Б2 + СловоРезультат2;
			КонецЕсли;
		КонецЦикла;  
	Иначе 
		//пробуем отделить вторую часть слова так, чтобы в первой осталось не менее половины 
		//запрашиваемой длины слова
		ДлинаСлова = КоличествоСимволов;   
		ПоловинаДлиныСлова = Цел(ДлинаСлова/2);
		Пока ДлинаСлова >= ПоловинаДлиныСлова Цикл
			Б1 = Лев(Прав(СловоРезультат1,2),1);
			Б2 = Прав(СловоРезультат1,1);
			Б3 = Лев(СловоРезультат2,1);
			Б4 = Прав(Лев(СловоРезультат2,2),1);
			
			Если МягкийПеренос < 0 Тогда
				//посл. буква -  не буква и не цифра, на ней и переносим
				Если (Найти(Алфавит,Б2) = 0) И (Найти(Цифры,Б2) = 0) Тогда
					Прервать;
				КонецЕсли;    
			КонецЕсли;
			
			МожноПереносить = 0;
			//гггс
			Если ((Найти(Гласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(Согласные,Б4)<>0)) Тогда  
				МожноПереносить = 0;
				//гсгг
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда
				МожноПереносить = 0;
				//сггг
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда
				МожноПереносить = 0;
				//ссгс
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 0;  
				Если Найти("ьъйЬЪЙ",Б2)<>0 Тогда
					МожноПереносить = 1;
				КонецЕсли;
				//ссгг
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда	
				МожноПереносить = 0;
				//сггс
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 0;
				//гсгс
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Гласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 0;
				//сгсг
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда
				МожноПереносить = 1;
				//ггсг
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда
				МожноПереносить = 1;
				//сссс
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;   
				Если СтрДлина(СловоРезультат2) = 2 Тогда
					МожноПереносить = 0;
				КонецЕсли;
				//сссг
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;
				//сгсс
			ИначеЕсли ((Найти(СоГласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;
				Если (СтрДлина(СловоРезультат2) = 2) ИЛИ (Найти("ьъйЬЪЙ",Б4)<>0) Тогда
					МожноПереносить = 0;
				КонецЕсли;
				//гссс
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;
				Если СтрДлина(СловоРезультат2) = 2 Тогда
					МожноПереносить = 0;
				КонецЕсли;
				//ггсс
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(Гласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(СоГласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;
				Если СтрДлина(СловоРезультат2) = 2 Тогда
					МожноПереносить = 0;
				КонецЕсли;
				//гссг
			ИначеЕсли ((Найти(Гласные,Б1)<>0) И (Найти(СоГласные,Б2)<>0)) И ((Найти(Согласные,Б3)<>0) И (Найти(Гласные,Б4)<>0)) Тогда	
				МожноПереносить = 1;
			КонецЕсли;   
			
			//вторая часть не может: начинаться на ы,ь,ъ,й;
			//первая часть не может: заканчиваться на ы
			Если (Найти("йьъыЙЬЪЫ",Б3) <> 0) ИЛИ (Найти("ыЫ",Б2) <> 0) Тогда
				МожноПереносить = 0;
			КонецЕсли;
			
			Если МожноПереносить = 0 Тогда
				Если СтрДлина(СловоРезультат2) = 1 Тогда
					СловоРезультат1 = СловоРезультат1 + СловоРезультат2;
					СловоРезультат2 = "";
					Прервать;
				КонецЕсли;
				СловоРезультат1 = Лев(СловоРезультат1,СтрДлина(СловоРезультат1)-1);
				СловоРезультат2 = Б2 + СловоРезультат2;  
				Если СтрДлина(СловоРезультат1) < ПоловинаДлиныСлова Тогда
					Если (Найти(Цифры,Прав(СловоРезультат1,1))<>0) И (Найти(Цифры,Лев(СловоРезультат2,1))<>0) Тогда
						Пока (Найти(Цифры,Прав(СловоРезультат1,1))<>0) И (Найти(Цифры,Лев(СловоРезультат2,1))<>0) Цикл
							СловоРезультат2 = Прав(СловоРезультат1,1) + СловоРезультат2;
							Если СтрДлина(СловоРезультат1) > 1 Тогда
								СловоРезультат1 = Лев(СловоРезультат1,СтрДлина(СловоРезультат1)-1);
							Иначе
								СловоРезультат1 = "";
								//Евросиб Коханенко Н.А. #66948 14.03.2023 ((
								Прервать;
								//Евросиб Коханенко Н.А. #66948 14.03.2023 ))
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			Иначе
				Если СтрДлина(СловоРезультат2) = 1 Тогда
					СловоРезультат1 = СловоРезультат1 + СловоРезультат2;
					СловоРезультат2 = "";
				Иначе
					СловоРезультат1 = СловоРезультат1 + "-";
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
			ДлинаСлова = СтрДлина(СловоРезультат1);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры //глПеренестиСлово(_СловоИсточник,_КоличествоСимволов,СловоРезультат1,СловоРезультат2,МягкийПеренос=0)

Функция ПолучитьЗначенияПоля(ТаблицаДанных, ИмяПоля)
	
	ТаблицаСПолем = ТаблицаДанных.Скопировать(, ИмяПоля);
	ТаблицаСПолем.Свернуть(ИмяПоля);
	Возврат ТаблицаСПолем.ВыгрузитьКолонку(ИмяПоля);
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("НомерПСЦ");
	Поля.Добавить("ДатаПСЦ");
	Поля.Добавить("ВидПСЦ");
	Поля.Добавить("Контрагент");
	Поля.Добавить("ПСЦПоставщика");
	//Евросиб Коханенко Н.А. 21.02.2025 (( #103255 
	Поля.Добавить("Нотис");
	//Евросиб Коханенко Н.А. 21.02.2025 )) #103255 
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Префикс = ?(Данные.ПСЦПоставщика, "ПП: ", "ПК: ");
	Если ЗначениеЗаполнено(Данные.ВидПСЦ) Тогда
		Префикс = Строка(Данные.ВидПСЦ) + ": ";
	КонецЕсли;
	//Евросиб Коханенко Н.А. 21.02.2025 (( #103255 
	//Представление = Префикс + Данные.Контрагент + " №"+Данные.НомерПСЦ+" от "+Формат(Данные.ДатаПСЦ, "ДФ=dd.MM.yy");
	Если Данные.Нотис Тогда
		Представление = "НОТИС "+Данные.НомерПСЦ+" от "+Формат(Данные.ДатаПСЦ, "ДФ=dd.MM.yy");	
	Иначе
		Представление = Префикс + Данные.Контрагент + " №"+Данные.НомерПСЦ+" от "+Формат(Данные.ДатаПСЦ, "ДФ=dd.MM.yy");
	КонецЕсли;	
	//Евросиб Коханенко Н.А. 21.02.2025 )) #103255 
КонецПроцедуры

Функция НапечататьДвуязычныйФрахт(МассивОбъектов) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколМногоязычный_Фрахт", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
		ОбластьШапка.Параметры.ГородПодписанияАнгл = Док.ГородПодписания.НаименованиеАнгл;
		ОбластьШапка.Параметры.НомерПСЦ = Док.НомерПСЦ;
		ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ОрганизацияПолноеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.ОрганизацияКраткоеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьШапка.Параметры.ОрганизацияПолноеРус = НаименованияНаДату.НаименованиеПолное;
		ОбластьШапка.Параметры.ОрганизацияКраткоеРус = НаименованияНаДату.НаименованиеСокращенное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьОргРус = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИООргРус = НашРуководитель.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеРус = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.КлиентПолноеРус = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.КлиентДолжностьРус = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.КлиентФИОРус = РуководительКонтрагента.ФИОРПРус ;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
		
			ОбластьШапка.Параметры.ДолжностьОргРус = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИООргРус = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеРус = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
			//ОбластьШапка.Параметры.ДолжностьОргЕнг = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			//ОбластьШапка.Параметры.ФИООргЕнг = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			//ОбластьШапка.Параметры.ОснованиеЕнг = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			
		КонецЕсли;
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ОрганизацияПолноеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолноеАнгл, Док.Организация.НаименованиеПолноеАнгл);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолноеАнгл;
		//ОбластьШапка.Параметры.ОрганизацияКраткоеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенноеАнгл, Док.Организация.НаименованиеСокращенноеАнгл);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенноеАнгл;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьШапка.Параметры.ОрганизацияПолноеЕнг  = НаименованияНаДату.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.ОрганизацияКраткоеЕнг = НаименованияНаДату.НаименованиеСокращенноеАнгл;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл;
		ОбластьШапка.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл;
		ОбластьШапка.Параметры.ОснованиеЕнг = НашРуководитель.ОснованиеАнгл;
		ОбластьШапка.Параметры.КлиентПолноеЕнг = Док.Контрагент.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.КлиентДолжностьЕнг = РуководительКонтрагента.ДолжностьАнгл;
		ОбластьШапка.Параметры.КлиентФИОЕнг = РуководительКонтрагента.ФИОАнгл;
		
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
			ОбластьШапка.Параметры.КлиентДолжностьЕнг = "" + РуководительКонтрагента.ДолжностьАнгл + " " + РуководительКонтрагента.ОснованиеАнгл;
		КонецЕсли;
		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		
		ОбластьМаршрутыШапка = Макет.ПолучитьОбласть("МаршрутыШапка");
		Результат.Вывести(ОбластьМаршрутыШапка);
		
		Для каждого Стр из Док.ТЧ_МорскаяЧасть Цикл
			ОбластьМаршрутыСтрока = Макет.ПолучитьОбласть("МаршрутыСтрока");
			ОбластьМаршрутыСтрока.Параметры.УслугаРус = Стр.Услуга;
			
			Если ЗначениеЗаполнено(Стр.УсловияПеревозки_Отправление) Тогда
				УсловияОтпр = ПолучитьИмяЗначенияПеречисления(Стр.УсловияПеревозки_Отправление, Стр.УсловияПеревозки_Отправление);
			Иначе
				УсловияОтпр = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.УсловияПеревозки_Прибытие) Тогда
				УсловияПриб = ПолучитьИмяЗначенияПеречисления(Стр.УсловияПеревозки_Прибытие, Стр.УсловияПеревозки_Прибытие);
			Иначе
				УсловияПриб = "";
			КонецЕсли;
			
			ОбластьМаршрутыСтрока.Параметры.МаршрутРус = Строка(УсловияОтпр) + " " + Строка(Стр.ПортПогрузкиRUS) + " - " + Строка(УсловияПриб) + " " + Строка(Стр.ПунктДоставкиRUS);
			ОбластьМаршрутыСтрока.Параметры.МаршрутАнгл = Строка(УсловияОтпр) + " " + Строка(Стр.ПортПогрузкиENG) + " - " + Строка(УсловияПриб) + " " + Строка(Стр.ПунктДоставкиENG);
			ОбластьМаршрутыСтрока.Параметры.УслугаАнгл = Стр.УслугаАнгл;
			ОбластьМаршрутыСтрока.Параметры.ТипКТК = Стр.ТипКТК;
			СтавкаЗаКонт = Формат(Стр.СуммаСНДС, "ЧДЦ=2; ЧН=Отсутствует; ЧГ=");
			ОбластьМаршрутыСтрока.Параметры.Ставка = ?(НЕ СтавкаЗаКонт = "Отсутствует", Строка(СтавкаЗаКонт) + " " + Стр.Валюта + "/конт.",СтавкаЗаКонт);
			Результат.Вывести(ОбластьМаршрутыСтрока);
		КонецЦикла;
		
		/////////////////
		
		Если ЗначениеЗаполнено(Док.ПримечанияВариантовМаршрута) тогда
			БлокДопПримечания = Макет.ПолучитьОбласть("БлокДопПримечания");
			БлокДопПримечания.Параметры.ТекстДопПримечания = Док.ПримечанияВариантовМаршрута;
			Результат.Вывести(БлокДопПримечания);
		КонецЕсли;
		
		/////////////////
		
		ОСтрока = Макет.ПолучитьОбласть("ТекстБлока");
		ОСтрока.Параметры.n = "1.1.";
		Острока.Параметры.ТекстБлокаРус = "Договорная цена облагается НДС по ставке " + Док.СтавкаНДС + " и включает:";
		Острока.Параметры.ТекстБлокаАнгл = "The rate is subject to VAT " + Док.СтавкаНДС + " and includes:";
		Результат.Вывести(ОСтрока);
		
		ОСтрока = Макет.ПолучитьОбласть("ТекстБлока");		
		Результат.Вывести(ОСтрока);
		
		/////////////////
		
		Для каждого Стр из Док.ПунктыПСЦ Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("Заголовок");
				ОбластьЗаголовок.Параметры.ЗаголовокРус		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ЗаголовокАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("Подзаголовок");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ПодзаголовокРус		= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ПодзаголовокАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок 							= Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n				= Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус	= ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				ОбластьЗаголовок.Параметры.ТекстБлокаАнгл 	= ОтработатьШаблоны(Док, Стр.ТекстПунктаАнгл);
				Результат.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		/////////////////
		Если ЗначениеЗаполнено(Док.ПримечанияПунктовИУсловийПСЦ) тогда
			БлокДопПримечания = Макет.ПолучитьОбласть("БлокДопПримечания");
			БлокДопПримечания.Параметры.ТекстДопПримечания = Док.ПримечанияПунктовИУсловийПСЦ;
			Результат.Вывести(БлокДопПримечания);
		КонецЕсли;
		/////////////////
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.ОрганизацияКраткоеРус = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ОрганизацияКраткоеЕнг = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенноеАнгл, Док.Организация.НаименованиеСокращенноеАнгл); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенноеАнгл;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьПодвал.Параметры.ОрганизацияКраткоеРус = НаименованияНаДату.НаименованиеСокращенное;
		ОбластьПодвал.Параметры.ОрганизацияКраткоеЕнг = НаименованияНаДату.НаименованиеСокращенноеАнгл;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.ФИООргРус2 = НашРуководитель.ФИОРус;
		ОбластьПодвал.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл;
		ОбластьПодвал.Параметры.ДолжностьОргРус = НашРуководитель.ДолжностьРус;
		ОбластьПодвал.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл;
		ОбластьПодвал.Параметры.КлиентФИОЕнг = РуководительКонтрагента.ФИОАнгл;
		ОбластьПодвал.Параметры.КлиентФИОРус = РуководительКонтрагента.ФИОРус;
		
		ОбластьПодвал.Параметры.КлиентДолжностьЕнг = РуководительКонтрагента.ДолжностьАнгл;
		ОбластьПодвал.Параметры.КлиентДолжностьРус = РуководительКонтрагента.ДолжностьРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИООргРус2 = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
			ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
			ОбластьПодвал.Параметры.КлиентДолжностьЕнг = "" + РуководительКонтрагента.ДолжностьАнгл + " " + РуководительКонтрагента.ОснованиеАнгл;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
			ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
			ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
				ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
			ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
			ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;

		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
//ок(
//Функция НапечататьОдноязычныйФрахт(МассивОбъектов) Экспорт
//ок)
Функция НапечататьОдноязычныйФрахт(МассивОбъектов, ДопПараметры = Неопределено) Экспорт
	
	ВыводитьФаксимиле = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьФаксимиле", ВыводитьФаксимиле);
		Если ТипЗнч(ВыводитьФаксимиле) <> Тип("Булево") Тогда
			ВыводитьФаксимиле = Ложь;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец

	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколОдноязычный_Фрахт", Док.Контрагент, Док.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
		//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
		//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
		//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		
		ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НомерПротокола = Док.НомерПСЦ;
		ОбластьШапка.Параметры.ДатаПСЦ = Строка(Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy")) + " г.";
		ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.Наименованиеполное, Док.Организация.Наименованиеполное);//Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		//ОбластьШапка.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		
		ОбластьШапка.Параметры.ПолноеНаименование = НаименованияНаДату.НаименованиеПолное;
		ОбластьШапка.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьШапка.Параметры.ДолжностьРуководителя = НашРуководитель.ДолжностьРус;
		ОбластьШапка.Параметры.ФИОРуководителя = НашРуководитель.ФИОРус;
		ОбластьШапка.Параметры.ОснованиеРуководителя = НашРуководитель.ОснованиеРус;
		ОбластьШапка.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.ДолжностьРукКлиента = РуководительКонтрагента.ДолжностьРП;
		ОбластьШапка.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРПРус;
		ОбластьШапка.Параметры.ОснованиеКлиента = РуководительКонтрагента.ОснованиеРус;
		
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			
			ОбластьШапка.Параметры.ДолжностьРуководителя = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителя = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеРуководителя = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьШапка);
		
		///////////////
		// если перед таблицей должны идти какие-то пункты, то заполняем их.
		// используем для проверки флаг "ПередТаблицей"
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ПередТаблицей",Истина);
		НайденныеСтр = Док.ПунктыПСЦ.НайтиСтроки(ПараметрыОтбора);
		Для каждого Стр из НайденныеСтр Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
				ОбластьЗаголовок.Параметры.Заголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьПодзаголовок");
				ОбластьЗаголовок.Параметры.n = Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.Подзаголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли Стр.ВложенныйСписок Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьВложенныйСписок");
				ОбластьЗаголовок.Параметры.Подзаголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ТекстБлока");
				ОбластьЗаголовок.Параметры.n = Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				Результат.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		ОбластьМаршрутыШапка = Макет.ПолучитьОбласть("ШапкаТабл2");
		ОбластьМаршрутыШапка.Параметры.СтавкаНДС = Док.СтавкаНДС;
		Результат.Вывести(ОбластьМаршрутыШапка);
		
		Для каждого Стр из Док.ТЧ_МорскаяЧасть Цикл
			ОбластьМаршрутыСтрока = Макет.ПолучитьОбласть("ОбластьТабл2");
			ОбластьМаршрутыСтрока.Параметры.НаименованиеУслуги = Стр.Услуга;
			
			Если ЗначениеЗаполнено(Стр.УсловияПеревозки_Отправление) Тогда
				УсловияОтпр = ПолучитьИмяЗначенияПеречисления(Стр.УсловияПеревозки_Отправление, Стр.УсловияПеревозки_Отправление);
			Иначе
				УсловияОтпр = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.УсловияПеревозки_Прибытие) Тогда
				УсловияПриб = ПолучитьИмяЗначенияПеречисления(Стр.УсловияПеревозки_Прибытие, Стр.УсловияПеревозки_Прибытие);
			Иначе
				УсловияПриб = "";
			КонецЕсли;
			
			ОбластьМаршрутыСтрока.Параметры.МаршрутСледования = Строка(УсловияОтпр) + " " + Строка(Стр.ПортПогрузкиRUS) + " - " + Строка(УсловияПриб) + " " + Строка(Стр.ПунктДоставкиRUS);
			ОбластьМаршрутыСтрока.Параметры.ТипКонтейнера = Стр.ТипКТК;
			СтавкаЗаКонт = Стр.СуммаСНДС; //Формат(Стр.СуммаСНДС, "ЧДЦ=2; ЧГ=");
			ОбластьМаршрутыСтрока.Параметры.Ставка = ?(ЗначениеЗаполнено(СтавкаЗаКонт), Строка(СтавкаЗаКонт) + " " + Стр.Валюта + "/конт.",СтавкаЗаКонт);
			Результат.Вывести(ОбластьМаршрутыСтрока);
		КонецЦикла;
		
		ПоследнийПунктУсловий = Макет.ПолучитьОбласть("ОбластьПримечание");
		ПоследнийПунктУсловий.Параметры.Примечание = Док.ПримечанияПунктовИУсловийПСЦ;
		Результат.Вывести(ПоследнийПунктУсловий);
		
		/////////////////
		
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
		ВсегоПунктов = Док.ПунктыПСЦ.Количество();
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ПередТаблицей",Ложь);
		НайденныеСтр = Док.ПунктыПСЦ.НайтиСтроки(ПараметрыОтбора);
		Для каждого Стр из НайденныеСтр Цикл
			
			Если Стр.Заголовок и НЕ ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок1");
				ОбластьЗаголовок.Параметры.Заголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			ИначеЕсли Стр.Заголовок и ЗначениеЗаполнено(Стр.НомерПункта) Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьПодзаголовок1");
				ОбластьЗаголовок.Параметры.n = Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.Подзаголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			ИначеЕсли Стр.ВложенныйСписок Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьВложенныйСписок1");
				ОбластьЗаголовок.Параметры.Подзаголовок = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			ИначеЕсли НЕ Стр.Заголовок Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ТекстБлока1");
				ОбластьЗаголовок.Параметры.n = Стр.НомерПункта;
				ОбластьЗаголовок.Параметры.ТекстБлокаРус = ОтработатьШаблоны(Док, Стр.ТекстПунктаРус);
				//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
				//Результат.Вывести(ОбластьЗаголовок);
				ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьЗаголовок, ОбластьПодвал, Стр.НомерСтроки, ВсегоПунктов);
				//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
			КонецЕсли;
			
		КонецЦикла;
		
		//Евросиб Каблов 16.09.2020 ( Последний пункт протокола заполняется в ТЧ ПунктыПСЦ и выводится оттуда
		//ПоследнийПункт = 0;
		//ТолькоНумерация = Док.ПунктыПСЦ.Выгрузить();
		//Для Каждого Стр Из ТолькоНумерация Цикл
		//	Если ЗначениеЗаполнено(Стр.НомерПункта) Тогда
		//		// Попытка преобразовать номер пункта в число. нужно взять только целое, а не подпункт.
		//		// надо найти максимальный пункт, потому что какие-то строки могут быть без нумерации
		//		ПоследнийПункт = Макс(ПоследнийПункт,ПреобразованиеВПунктМеню(Стр.НомерПункта));
		//	КонецЕсли;
		//КонецЦикла;
		//
		//ПоследнийПунктУсловий = Макет.ПолучитьОбласть("ПоследнийПунктУсловий");
		//ПоследнийПунктУсловий.Параметры.n = Строка(ПоследнийПункт + 1) + ".";
		//ПоследнийПунктУсловий.Параметры.НомерДоговора = Док.Договор.Номер;
		//ПоследнийПунктУсловий.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		//ПоследнийПунктУсловий.Параметры.НачалоДействия = Формат(Док.НачалоДействия, "ДФ=dd.MM.yyyy");
		//ПоследнийПунктУсловий.Параметры.ОкончаниеДействия = ?(Док.ДействуетДоСогласованияНовыхУсловий,"согласования новых условий",Строка(Формат(Док.ОкончаниеДействия, "ДФ=dd.MM.yyyy"))+ " г");
		//Результат.Вывести(ПоследнийПунктУсловий);
		//Евросиб Каблов 16.09.2020 )
		
		//++ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		// определили эту переменную выше в коде
		//ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодписи");
		//--ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
		
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.КраткоеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеСокращенное, Док.Организация.НаименованиеСокращенное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеСокращенное;
		//ОбластьПодвал.Параметры.ПолноеНаименование = ?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация.НаименованиеПолное, Док.Организация.НаименованиеПолное); //Евросиб Гудкова( 17.09.2020 Ticket№ 0206626 Док.Организация.НаименованиеПолное;
		ОбластьПодвал.Параметры.КраткоеНаименование = НаименованияНаДату.НаименованиеСокращенное;
		ОбластьПодвал.Параметры.ПолноеНаименование  = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьПодвал.Параметры.ФИОРуководителя = НашРуководитель.ФИОРПРус;
		//ОбластьПодвал.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
		//ОбластьПодвал.Параметры.КраткоеНаименованиеКлиента = Док.Контрагент.Наименование;
		ОбластьПодвал.Параметры.ПолноеНаименованиеКлиента = Док.Контрагент.НаименованиеПолное;
		//Евросиб Каблов 16.09.2020 (
		//ОбластьПодвал.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРПРус;
		ОбластьПодвал.Параметры.ФИОРукКлиента = РуководительКонтрагента.ФИОРус;
		//Евросиб Каблов 16.09.2020 )
		
		//Евросиб Коханенко Н.А. 27.01.2025 (( #97554 
		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьПодвал.Параметры.ФИОРуководителя = ""+Док.ДоверенностьЗаРуководителя.ФИОПодписанта+Символы.ПС+Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписания;
		//	//ОбластьПодвал.Параметры.ДолжностьОргРус = ""+ Док.ДоверенностьЗаРуководителя.Должность;
		//КонецЕсли;  
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеРус) Тогда
			ОбластьПодвал.Параметры.ФИОРукКлиента = ОбластьПодвал.Параметры.ФИОРукКлиента + Символы.ПС + "На основании " + РуководительКонтрагента.ОснованиеРус;
		КонецЕсли;  
		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителя = "" + Док.ДоверенностьЗаРуководителя.ФИОПодписанта;
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП) Тогда
				ОбластьПодвал.Параметры.ФИОРуководителя = ОбластьПодвал.Параметры.ФИОРуководителя + Символы.ПС + "На основании " + Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
			КонецЕсли;  
		КонецЕсли;  
		ОбластьПодвал.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ,"ДФ=dd.MM.yyyy");
		//Евросиб Коханенко Н.А. 27.01.2025 )) #97554 
		
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Начало
		Если ВыводитьФаксимиле Тогда
			//ок(	
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
					ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
				Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
				КонецЕсли;
			КонецЕсли;
			//ок)
		КонецЕсли;
		//ДИТ Давудов М.А. Ticket#0236090 01.07.2021 Конец

		Результат.Вывести(ОбластьПодвал);
		
		Первый = Ложь;
		
	    Результат.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	    Результат.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	    Результат.ВерхнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	    Результат.ВерхнийКолонтитул.ТекстСлева = "Протокол согласования договорной цены № " + Док.НомерПСЦ + " к договору № " + Док.Договор.Номер + " от " + Формат(Док.ДатаПСЦ, "ДФ=dd.MM.yyyy");
	    Результат.РазмерКолонтитулаСверху = 20;
	    Результат.ВерхнийКолонтитул.Выводить = Истина;
		
		Результат.КоличествоЭкземпляров = 2;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПреобразованиеВПунктМеню(НомерПункта)
	
	Рез = 0;
	
 	КоличествоСимволов = СтрДлина(НомерПункта);
	НашлиЦифру = Ложь;
	НайденноеЧисло = "";
	
	Для Сч = 1 По КоличествоСимволов Цикл
		Код = КодСимвола(Сред(НомерПункта,Сч)); 
		// Цифры: 48 - 57
		Если Код < 48 ИЛИ Код>57 Тогда
			// если к этому моменту цифра уже была найдена, то при нахождении символа, отличного от цифры, прекращаем цикл по строке
			Если НашлиЦифру Тогда
				Прервать;
			КонецЕсли;
		Иначе
			НайденноеЧисло = Строка(НайденноеЧисло) + Строка(Сред(НомерПункта,Сч,1));
			НашлиЦифру = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Рез = Число(НайденноеЧисло);
	Исключение
		Рез = 0;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьИмяЗначенияПеречисления(ИмяПеречисл, ЗначПеречисл)
	
	Если ТипЗнч(ИмяПеречисл) = Тип("ПеречислениеСсылка.УсловияПеревозкиКТК") Тогда
		ТекПеречисл = "УсловияПеревозкиКТК";
	Иначе
		ТекПеречисл = "УсловияПеревозкиПоПортам";
	КонецЕсли;
	
	ИмяПеречисления = ЗначПеречисл.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначПеречисл);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;			
	
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции	

//ДИТ Пак И.Т. Task34353 12.05.2021
Процедура НаложитьВодянойЗнакЕслиНеобходимо(ТабДок, Документ)
	
	Статус = Документ.СтатусДокумента;
	
	НуженЗнак = Не ЗначениеЗаполнено(Статус);  // т.е. "Не согласовано"
	НуженЗнак = НуженЗнак Или (Статус = Перечисления.СтатусыСогласования.Планируется);
	НуженЗнак = НуженЗнак Или (Статус = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
	НуженЗнак = НуженЗнак Или (Статус = Перечисления.СтатусыСогласования.НаРассмотрении);
	НуженЗнак = НуженЗнак Или (Статус = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями);
	НуженЗнак = НуженЗнак Или (Статус = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
	
	Если НуженЗнак Тогда
		НаложитьВодянойЗнакПостранично(ТабДок);
	КонецЕсли;
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34353 12.05.2021
Процедура НаложитьВодянойЗнакПостранично(ТабДок)
	
	СтраницыТД = РазбитьТабличныйДокументПостранично(ТабДок);
	
	Если СтраницыТД.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли СтраницыТД.Количество() = 1 Тогда
		НаложитьВодянойЗнакНаПервуюСтраницу(ТабДок);
		Возврат;
	КонецЕсли;
	
	Холст = Новый ТабличныйДокумент;
	Начало = Истина;
	
	
	Для каждого СтраницаТД Из СтраницыТД Цикл
		
		Если Начало Тогда
			Начало = Ложь;
		Иначе
			Холст.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НаложитьВодянойЗнакНаПервуюСтраницу(СтраницаТД);
		Холст.Вывести(СтраницаТД);
		
	КонецЦикла;
	
	ТабДок = Холст;
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34353 12.05.2021
Процедура НаложитьВодянойЗнакНаПервуюСтраницу(ТабДок)
	
	ДвДанные = ПолучитьМакет("ФайлКартинкиВодянойЗнак");
	
	Рисунок = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рисунок.Верх   = 1;
	Рисунок.Лево   = 1;
	Рисунок.Высота = ТабДок.ВысотаСтраницы; 
	Рисунок.Ширина = ТабДок.ШиринаСтраницы; 
	
	Рисунок.Картинка = Новый Картинка(ДвДанные, Истина); 
	Рисунок.РазмерКартинки = РазмерКартинки.Растянуть;
	
	Рисунок.ГраницаСверху = Ложь;
	Рисунок.ГраницаСнизу  = Ложь;
	Рисунок.ГраницаСлева  = Ложь;
	Рисунок.ГраницаСправа = Ложь;
	Рисунок.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
//ДИТ Давудов М.А. Ticket#0305235 29.03.2023 Начало
	Рисунок.ЦветФона = Новый Цвет;
	Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии, 0);
//ДИТ Давудов М.А. Ticket#0305235 29.03.2023 Конец
КонецПроцедуры

//ДИТ Пак И.Т. Task34353 12.05.2021
Функция РазбитьТабличныйДокументПостранично(ТабДок)
	
	СтраницыТД = Новый Массив;
	
	Если ТабДок.КоличествоСтраниц() < 2 Тогда
		СтраницыТД.Добавить(ТабДок);
		Возврат СтраницыТД;
	КонецЕсли;
	
	НомераСтрокКонцовСтраниц = Новый Массив;
	
	ДостигнутКонец = Ложь;
	
	Для НомерСтроки = 1 По ТабДок.ВысотаТаблицы Цикл
		Если ТабДок.Область(НомерСтроки,, НомерСтроки).КонецСтраницы Тогда
			НомераСтрокКонцовСтраниц.Добавить(НомерСтроки);
			Если НомерСтроки = ТабДок.ВысотаТаблицы Тогда
				ДостигнутКонец = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ДостигнутКонец Тогда
		НомераСтрокКонцовСтраниц.Добавить(ТабДок.ВысотаТаблицы);
	КонецЕсли;
	
	ПредыдущийНомер = 0;
	Для каждого НомерСтрокиКонцаСтраницы Из НомераСтрокКонцовСтраниц Цикл
		СтраницаТД = ТабДок.ПолучитьОбласть(ПредыдущийНомер + 1,, НомерСтрокиКонцаСтраницы);
		СтраницаТД.Область(СтраницаТД.ВысотаТаблицы,, СтраницаТД.ВысотаТаблицы).КонецСтраницы = Ложь;
		СтраницыТД.Добавить(СтраницаТД);
		ПредыдущийНомер = НомерСтрокиКонцаСтраницы;
	КонецЦикла;
	
	Возврат СтраницыТД;
	
КонецФункции

Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	ПараметрыЗапроса.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗапроса.Вставить("СодержитВР", Объект.СодержитВР);
	ПараметрыЗапроса.Вставить("ПротоколНаДоплатныеКТК", Объект.ПротоколНаДоплатныеКТК);
	ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	ПараметрыЗапроса.Вставить("ВидПСЦ", Объект.ВидПСЦ);
	ПараметрыЗапроса.Вставить("СогласованоВDV", Объект.СогласованоВDV);
	ПараметрыЗапроса.Вставить("Нетиповой", Объект.НетиповойПротокол);
	ПараметрыЗапроса.Вставить("Нерезидент", Справочники.Контрагенты.КонтрагентНерезидент(Объект.Контрагент));
	ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВидДоговора, КатегорияДоговора");
	ПараметрыЗапроса.Вставить("ВидДоговора", ПараметрыДоговора.ВидДоговора);
	ПараметрыЗапроса.Вставить("КатегорияДоговора", ПараметрыДоговора.КатегорияДоговора);
	ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
	ПараметрыЗапроса.Вставить("Фрахт", Объект.ПСЦПоставщикаФрахт);
	//++ Зубов 27.07.2021
	ПараметрыЗапроса.Вставить("КатегорияУслуг", Объект.КатегорияУслуг);
	ПараметрыЗапроса.Вставить("МестоОказанияУслуг", Объект.МестоОказанияУслуг);
	//-- Зубов 27.07.2021
	//Евросиб - АСуслов 15.12.2021 17:46:02 #42234
	//(
	ПараметрыЗапроса.Вставить("ТипКалькуляции", Объект.ТипКалькуляции);
	//)
	//Евросиб - АСуслов 15.12.2021 17:52:26 #42234
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
	ПараметрыЗапроса.Вставить("Поручение", Объект.Поручение);
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец 
	//Евросиб Коханенко Н.А. 11.12.2024 (( #88818 
	ПараметрыЗапроса.Вставить("Нотис", Объект.Нотис);
	//Евросиб Коханенко Н.А. 11.12.2024 )) #88818 
	Возврат ПараметрыЗапроса;
КонецФункции

// Евросиб Фролов (28.12.2021 TASK№ 42761
Процедура ЗаполнитьДанныеДляПечати(Объект) Экспорт

	ЗаполнитьВариантыМаршрутов(Объект);
	ЗаполнитьКалькуляцию(Объект, "Контейнеры");
	ЗаполнитьКалькуляцию(Объект, "Вагоны");
	// ЗаполнитьМорскуюЧасть(Объект);  // Евросиб Фролов, 17.01.2022 Ticket№ 0256462: отклюено заполнение морской части (Логвинова Мария)

	Объект.ДанныеДляПечатиИзменены = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьВариантыМаршрутов(Объект) Экспорт
	// Перенесена из модуля формы для доступа из калькуляции
	Объект.ВариантыМаршрута.Очистить();
	Объект.ТЧ.Очистить();
	
	Запрос = Новый Запрос; 
	// ДИТ BUG 57945 ТА 73942 Сержантова А.С. Начало: 18.09.2023
	// Было:
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктОтправления.Наименование КАК НаправлениеПунктОтправленияНаименование,
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктОтправления.НаименованиеАнгл КАК НаправлениеПунктОтправленияНаименованиеАнгл,
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктНазначения.Наименование КАК НаправлениеПунктНазначенияНаименование,
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктНазначения.НаименованиеАнгл КАК НаправлениеПунктНазначенияНаименованиеАнгл,
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка.Суша_ПунктОтправления.Наименование КАК Суша_ПунктОтправленияНаименование,
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл КАК Суша_ПунктОтправленияНаименованиеАнгл,
	//               |	КалькуляцияММ_ПросчитанныеСтавкиФрахта.Ставка КАК Ставка,
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка.ММ_МореРазмерКТК КАК ММ_МореРазмерКТК,
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка.Валюта КАК Валюта,
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка.Дата КАК Дата,
	//               |	СуммарныеЗатратыЖДСоставляющей.Затраты КАК Затраты,
	//               |	СуммарныеЗатратыЖДСоставляющей.Валюта КАК Валюта1,
	//               |	СуммарныеЗатратыЖДСоставляющей.ММ_Вознаграждение КАК ММ_Вознаграждение,
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктОтправления КАК НаправлениеПунктОтправления,
	//               |	КалькуляцияММ_ПодборНаправлений.Направление.ПунктНазначения КАК НаправлениеПунктНазначения
	//               |ИЗ
	//               |	Документ.Калькуляция.ММ_ПодборНаправлений КАК КалькуляцияММ_ПодборНаправлений
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_ПросчитанныеСтавкиФрахта КАК КалькуляцияММ_ПросчитанныеСтавкиФрахта
	//               |		ПО КалькуляцияММ_ПодборНаправлений.Ссылка = КалькуляцияММ_ПросчитанныеСтавкиФрахта.Ссылка
	//               |			И КалькуляцияММ_ПодборНаправлений.Направление = КалькуляцияММ_ПросчитанныеСтавкиФрахта.Направление
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка,
	//               |			СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Затраты) КАК Затраты,
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта КАК Валюта,
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение КАК ММ_Вознаграждение
	//               |		ИЗ
	//               |			Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//               |		ГДЕ
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Ссылка)
	//               |		
	//               |		СГРУППИРОВАТЬ ПО
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка,
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта,
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение) КАК СуммарныеЗатратыЖДСоставляющей
	//               |		ПО КалькуляцияММ_ПодборНаправлений.Ссылка = СуммарныеЗатратыЖДСоставляющей.Ссылка
	//               |ГДЕ
	//               |	КалькуляцияММ_ПодборНаправлений.Ссылка В(&Ссылка)
	//               |	И КалькуляцияММ_ПодборНаправлений.Направление.Линия В
	//               |			(ВЫБРАТЬ
	//               |				Калькуляция.ПротоколСчитаетсяПоСтавкамКонтрагента КАК ПротоколСчитаетсяПоСтавкамКонтрагента
	//               |			ИЗ
	//               |				Документ.Калькуляция КАК Калькуляция
	//               |			ГДЕ
	//               |				Калькуляция.Ссылка В (&Ссылка))";    
	//Запрос.УстановитьПараметр("Ссылка", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));  
	//Ответ = Запрос.Выполнить().Выбрать(); 
	//Пока Ответ.Следующий() Цикл   
	//	НСтр = Объект.ВариантыМаршрута.Добавить();
	//	НСтр.ПунктОтправленияRUS = Ответ.Суша_ПунктОтправленияНаименование;
	//	НСтр.ПортПогрузкиRUS = Ответ.НаправлениеПунктОтправленияНаименование;
	//	НСтр.ПунктДоставкиRUS = Ответ.НаправлениеПунктНазначенияНаименование;
	//	НСтр.ПунктОтправленияENG = Ответ.Суша_ПунктОтправленияНаименованиеАнгл;
	//	НСтр.ПортПогрузкиENG = Ответ.НаправлениеПунктОтправленияНаименованиеАнгл;
	//	НСтр.ПунктДоставкиENG = Ответ.НаправлениеПунктНазначенияНаименованиеАнгл;
	//	НСтр.ТипКТК = "" + Ответ.ММ_МореРазмерКТК + Символы.ПС + "GP, HC";
	//	ИтогоСтавка = Ответ.Ставка +  Валюта_сервер.ПересчитатьПоКурсу(Ответ.Затраты+Ответ.ММ_Вознаграждение, Ответ.Валюта1, Объект.Валюта, Объект.Дата);
	//	НСтр.СтавкаUSD = Валюта_сервер.ПересчитатьПоКурсу(ИтогоСтавка, Ответ.Валюта, Объект.Валюта, Объект.Дата);
	//
	//	НСтр = Объект.ТЧ.Добавить();
	//	НСтр.ПунктОтправленияRUS = Ответ.Суша_ПунктОтправленияНаименование;
	//	НСтр.ПортПогрузкиRUS = Ответ.НаправлениеПунктОтправленияНаименование;
	//	НСтр.ПунктДоставкиRUS = Ответ.НаправлениеПунктНазначенияНаименование;
	//	НСтр.ПунктОтправленияENG = Ответ.Суша_ПунктОтправленияНаименованиеАнгл;
	//	НСтр.ПортПогрузкиENG = Ответ.НаправлениеПунктОтправленияНаименованиеАнгл;
	//	НСтр.ПунктДоставкиENG = Ответ.НаправлениеПунктНазначенияНаименованиеАнгл;
	//	НСтр.ТипКТК = "" + Ответ.ММ_МореРазмерКТК + Символы.ПС + "GP, HC";
	//	ИтогоСтавка = 
	//	Валюта_сервер.ПересчитатьПоКурсу(Ответ.Ставка, Ответ.Валюта1, Объект.Валюта, Объект.Дата)
	//	+ 
	//	Валюта_сервер.ПересчитатьПоКурсу(Ответ.Затраты+Ответ.ММ_Вознаграждение, Ответ.Валюта1, Объект.Валюта, Объект.Дата);
	//	НСтр.Валюта = Объект.Валюта;
	//	НСтр.СтавкаНДС = ?(Объект.Калькуляции.Количество() > 0, Объект.Калькуляции[0].Калькуляция.СтавкаНДС, Перечисления.СтавкиНДС.НДС0);
	//	НСтр.СуммаСНДС = ИтогоСтавка;
	//	НСтр.Услуга = "Транспортно-экспедиционные услуги по организация морской перевозки";
	//	НСтр.ПунктОтправления = Ответ.НаправлениеПунктОтправления;
	//	НСтр.ПунктНазначения = Ответ.НаправлениеПунктНазначения;
	//КонецЦикла;
	//Стало:
	Запрос.Текст = "ВЫБРАТЬ
				   //Евросиб СубботинВ #89988 14.08.2024 Начало //переделал на инфо по шапке, при отсутствии строк в ММ_КМЦ
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка,
				   //|	СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Затраты) КАК Затраты,
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта КАК Валюта,
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение КАК ММ_Вознаграждение
				   //	               |ПОМЕСТИТЬ ВТ_СуммарныеЗатратыЖДСоставляющей
				   //|ИЗ
				   //|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
				   //|ГДЕ
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Ссылка)
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка,
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта,
				   //|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение				   //
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка, Калькуляция.Ссылка) КАК Ссылка,
				   |	СУММА(ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Затраты, 0)) КАК Затраты,
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта, Калькуляция.Валюта) КАК Валюта,
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение, Калькуляция.ММ_Вознаграждение) КАК ММ_Вознаграждение
				   |ПОМЕСТИТЬ ВТ_СуммарныеЗатратыЖДСоставляющей
				   |ИЗ
				   |	Документ.Калькуляция КАК Калькуляция
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
				   |		ПО (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = Калькуляция.Ссылка)
				   |ГДЕ
				   |	Калькуляция.Ссылка В(&Ссылка)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка, Калькуляция.Ссылка),
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Валюта, Калькуляция.Валюта),
				   |	ЕСТЬNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_Вознаграждение, Калькуляция.ММ_Вознаграждение)
				   //Евросиб СубботинВ #89988 14.08.2024 Конец	   
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланПродаж.Ссылка.Дата КАК Дата,
	               |	ПланПродаж.Номенклатура КАК Номенклатура,
	               |	СуммарныеЗатратыЖДСоставляющей.Затраты КАК Затраты,
	               |	СуммарныеЗатратыЖДСоставляющей.ММ_Вознаграждение КАК Вознаграждение,
	               |	СуммарныеЗатратыЖДСоставляющей.Валюта КАК Валюта1,
	               |	ПланПродаж.Ссылка.ММ_МореРазмерКТК КАК РазмерКТК,
	               |	ПланПродаж.ПунктОтправления КАК ПунктОтправления,
	               |	ПланПродаж.ПунктНазначения КАК ПунктНазначения,
				   // Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				   //|	ПланПродаж.Ссылка.ММ_ПортОтправления КАК ПортОтправления,
				   // Евросиб Рыбьяков К.А. 16.09.2024 ))
	               |	КалькуляцияСписокСтанцийНазначения.Станция КАК СтанцияНазначения,
	               |	КалькуляцияСписокСтанцийОтправления.Станция КАК СтанцияОтправления,
	               |	ЕСТЬNULL(КалькуляцияММ_ПросчитанныеСтавкиФрахта.Ставка, 0) КАК Ставка,
	               |	ПланПродаж.Ссылка.Суша_ПунктНазначения КАК Суша_ПунктНазначения,
	               |	ПланПродаж.Ссылка.Суша_ПунктОтправления КАК Суша_ПунктОтправления,
	               |	ПланПродаж.Ссылка КАК Калькуляция,
	               |	ПланПродаж.СуммаОплаты20 КАК СуммаОплаты20,
	               |	ПланПродаж.СуммаОплаты40 КАК СуммаОплаты40,
	               |	ПланПродаж.Валюта КАК Валюта,
	               |	ПланПродаж.СтавкаНДС КАК СтавкаНДС,
				   // Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				   |	КалькуляцияММ_ПортыОтправленияНазначения.Порт КАК ПортОтгрузки,
				   |	КалькуляцияММ_ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК ПортОтгрузкиНаименованиеАнгл,
				   |	ВЫБОР
				   |		КОГДА ТИПЗНАЧЕНИЯ(КалькуляцияММ_ПортыОтправленияНазначения.Порт) = ТИП(Справочник.АдресаВНаселенныхПунктах)
				   |			ТОГДА КалькуляцияММ_ПортыОтправленияНазначения.Порт.Адрес
				   |			ИНАЧЕ КалькуляцияММ_ПортыОтправленияНазначения.Порт.Наименование
				   |	КОНЕЦ КАК ПортОтгрузкиНаименование,
				   // Евросиб Рыбьяков К.А. 16.09.2024 ))
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПланПродаж.ПунктОтправления) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА ПланПродаж.ПунктОтправления.Адрес
	               |		ИНАЧЕ ПланПродаж.ПунктОтправления.Наименование
	               |	КОНЕЦ КАК ПунктОтправленияНаименование,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПланПродаж.ПунктНазначения) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА ПланПродаж.ПунктНазначения.Адрес
	               |		ИНАЧЕ ПланПродаж.ПунктНазначения.Наименование
	               |	КОНЕЦ КАК ПунктНазначенияНаименование,
	               |	ПланПродаж.ПунктОтправления.НаименованиеАнгл КАК ПунктОтправленияНаименованиеАнгл,
	               |	ПланПродаж.ПунктНазначения.НаименованиеАнгл КАК ПунктНазначенияНаименованиеАнгл,
				   // Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				   //|	ВЫБОР
				   //|		КОГДА ТИПЗНАЧЕНИЯ(ПланПродаж.Ссылка.ММ_ПортОтправления) = ТИП(Справочник.АдресаВНаселенныхПунктах)
				   //|			ТОГДА ПланПродаж.Ссылка.ММ_ПортОтправления.Адрес
				   //|		ИНАЧЕ ПланПродаж.Ссылка.ММ_ПортОтправления.Наименование
				   //|	КОНЕЦ КАК ПортОтправленияНаименование,
				   //|	ПланПродаж.Ссылка.ММ_ПортОтправления.НаименованиеАнгл КАК ПортОтправленияНаименованиеАнгл,
				   // Евросиб Рыбьяков К.А. 16.09.2024 ))
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(КалькуляцияСписокСтанцийНазначения.Станция) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА КалькуляцияСписокСтанцийНазначения.Станция.Адрес
	               |		ИНАЧЕ КалькуляцияСписокСтанцийНазначения.Станция.Наименование
	               |	КОНЕЦ КАК СтанцияНазначенияНаименование,
	               |	КалькуляцияСписокСтанцийНазначения.Станция.НаименованиеАнгл КАК СтанцияНазначенияНаименованиеАнгл,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(КалькуляцияСписокСтанцийОтправления.Станция) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА КалькуляцияСписокСтанцийОтправления.Станция.Адрес
	               |		ИНАЧЕ КалькуляцияСписокСтанцийОтправления.Станция.Наименование
	               |	КОНЕЦ КАК СтанцияОтправленияНаименование,
	               |	КалькуляцияСписокСтанцийОтправления.Станция.НаименованиеАнгл КАК СтанцияОтправленияНаименованиеАнгл,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПланПродаж.Ссылка.Суша_ПунктНазначения) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА ПланПродаж.Ссылка.Суша_ПунктНазначения.Адрес
	               |		ИНАЧЕ ПланПродаж.Ссылка.Суша_ПунктНазначения.Наименование
	               |	КОНЕЦ КАК Суша_ПунктНазначенияНаименование,
	               |	ПланПродаж.Ссылка.Суша_ПунктНазначения.НаименованиеАнгл КАК Суша_ПунктНазначенияНаименованиеАнгл,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПланПродаж.Ссылка.Суша_ПунктОтправления) = ТИП(Справочник.АдресаВНаселенныхПунктах)
	               |			ТОГДА ПланПродаж.Ссылка.Суша_ПунктОтправления.Адрес
	               |		ИНАЧЕ ПланПродаж.Ссылка.Суша_ПунктОтправления.Наименование
	               |	КОНЕЦ КАК Суша_ПунктОтправленияНаименование,
	               |	ПланПродаж.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл КАК Суша_ПунктОтправленияНаименованиеАнгл
	               |ИЗ
	               |	Документ.Калькуляция.ПланПродаж_Доходы КАК ПланПродаж
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СуммарныеЗатратыЖДСоставляющей КАК СуммарныеЗатратыЖДСоставляющей
	               |		ПО ПланПродаж.Ссылка = СуммарныеЗатратыЖДСоставляющей.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	               |		ПО ПланПродаж.Ссылка = КалькуляцияСписокСтанцийНазначения.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
	               |		ПО ПланПродаж.Ссылка = КалькуляцияСписокСтанцийОтправления.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_ПросчитанныеСтавкиФрахта КАК КалькуляцияММ_ПросчитанныеСтавкиФрахта
	               |		ПО ПланПродаж.Ссылка = КалькуляцияММ_ПросчитанныеСтавкиФрахта.Ссылка
	               |			И ПланПродаж.Ссылка.Суша_ПунктОтправления = КалькуляцияММ_ПросчитанныеСтавкиФрахта.Направление.ПунктОтправления
	               |			И ПланПродаж.Ссылка.Суша_ПунктНазначения = КалькуляцияММ_ПросчитанныеСтавкиФрахта.Направление.ПунктНазначения
				   // Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК КалькуляцияММ_ПортыОтправленияНазначения
				   |		ПО (ПланПродаж.Ссылка = КалькуляцияММ_ПортыОтправленияНазначения.Ссылка)
				   // Евросиб Рыбьяков К.А. 16.09.2024 ))
	               |ГДЕ
	               |	ПланПродаж.Ссылка В(&Ссылка)
	               |ИТОГИ
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(Затраты),
	               |	МАКСИМУМ(Вознаграждение),
	               |	МАКСИМУМ(Валюта1),
	               |	МАКСИМУМ(РазмерКТК),
	               |	МАКСИМУМ(ПунктОтправления),
	               |	МАКСИМУМ(ПунктНазначения),
				   //|	МАКСИМУМ(ПортОтправления),
				   // Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
   				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПортОтгрузки),
				   |	МАКСИМУМ(ПортОтгрузкиНаименованиеАнгл),
				   |	МАКСИМУМ(ПортОтгрузкиНаименование),
				   // Евросиб Рыбьяков К.А. 16.09.2024 ))
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтанцияНазначения),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтанцияОтправления),
	               |	МАКСИМУМ(Ставка),
	               |	МАКСИМУМ(Суша_ПунктНазначения),
	               |	МАКСИМУМ(Суша_ПунктОтправления),
	               |	МАКСИМУМ(СуммаОплаты20),
	               |	МАКСИМУМ(СуммаОплаты40),
	               |	МАКСИМУМ(Валюта),
	               |	МАКСИМУМ(СтавкаНДС),
	               |	МАКСИМУМ(ПунктОтправленияНаименование),
	               |	МАКСИМУМ(ПунктНазначенияНаименование),
	               |	МАКСИМУМ(ПунктОтправленияНаименованиеАнгл),
	               |	МАКСИМУМ(ПунктНазначенияНаименованиеАнгл),
				   //|	МАКСИМУМ(ПортОтправленияНаименование),
				   //|	МАКСИМУМ(ПортОтправленияНаименованиеАнгл),
	               |	МАКСИМУМ(СтанцияНазначенияНаименование),
	               |	МАКСИМУМ(СтанцияНазначенияНаименованиеАнгл),
	               |	МАКСИМУМ(СтанцияОтправленияНаименование),
	               |	МАКСИМУМ(СтанцияОтправленияНаименованиеАнгл),
	               |	МАКСИМУМ(Суша_ПунктНазначенияНаименование),
	               |	МАКСИМУМ(Суша_ПунктНазначенияНаименованиеАнгл),
	               |	МАКСИМУМ(Суша_ПунктОтправленияНаименование),
	               |	МАКСИМУМ(Суша_ПунктОтправленияНаименованиеАнгл)
	               |ПО
	               |	Калькуляция,
	               |	Номенклатура";    
	Запрос.УстановитьПараметр("Ссылка", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));  
	ОтветКалькуляция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ОтветКалькуляция.Следующий() Цикл
		Ответ = ОтветКалькуляция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока Ответ.Следующий() Цикл
			
			СтрРеквизиты = "Наименование, НаименованиеАнгл";
			МассивНазначения = Новый Массив;
			МассивНазначенияАнгл = Новый Массив;
			СтруктураСтанцийНазначения = Новый Массив;
			МассивОтправления = Новый Массив;
			МассивОтправленияАнгл = Новый Массив;
			СтруктураСтанцийОтправления = Новый Массив;
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			МассивОтгрузки = Новый Массив;
			МассивОтгрузкиАнгл = Новый Массив;
			СтруктураПортовОтгрузки = Новый Массив;
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
			Если Ответ.СтанцияНазначения > 0 или Ответ.СтанцияОтправления > 0 Тогда
				
				ВыборкаНаправлений = Ответ.Выбрать();
				Пока ВыборкаНаправлений.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаНаправлений.СтанцияНазначения) 
						и МассивНазначения.Найти(ВыборкаНаправлений.СтанцияНазначения) = Неопределено Тогда
						МассивНазначения.Добавить(ВыборкаНаправлений.СтанцияНазначения);
						СтруктураСтанцийНазначения.Добавить(Новый Структура("СтанцияНазначения, Наименование, НаименованиеАнгл",
																	ВыборкаНаправлений.СтанцияНазначения, ВыборкаНаправлений.СтанцияНазначенияНаименование, ВыборкаНаправлений.СтанцияНазначенияНаименованиеАнгл));
					КонецЕсли;	
					Если ЗначениеЗаполнено(ВыборкаНаправлений.СтанцияОтправления) 
						и МассивОтправления.Найти(ВыборкаНаправлений.СтанцияОтправления) = Неопределено Тогда
						МассивОтправления.Добавить(ВыборкаНаправлений.СтанцияОтправления);
						СтруктураСтанцийОтправления.Добавить(Новый Структура("СтанцияОтправления, Наименование, НаименованиеАнгл",
																	ВыборкаНаправлений.СтанцияОтправления, ВыборкаНаправлений.СтанцияОтправленияНаименование, ВыборкаНаправлений.СтанцияОтправленияНаименованиеАнгл));
					КонецЕсли;
					// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
					Если ЗначениеЗаполнено(ВыборкаНаправлений.ПортОтгрузки) 
						и МассивОтгрузки.Найти(ВыборкаНаправлений.ПортОтгрузки) = Неопределено Тогда
						МассивОтгрузки.Добавить(ВыборкаНаправлений.ПортОтгрузки);
						СтруктураПортовОтгрузки.Добавить(Новый Структура("СтанцияОтправления, Наименование, НаименованиеАнгл",
							ВыборкаНаправлений.ПортОтгрузки, ВыборкаНаправлений.ПортОтгрузкиНаименование, ВыборкаНаправлений.ПортОтгрузкиНаименованиеАнгл));
					КонецЕсли;
					// Евросиб Рыбьяков К.А. 16.09.2024 ))	
				КонецЦикла;
				
				//СтруктураСтанцийНазначения = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивНазначения,СтрРеквизиты);
				СобратьМассивыНаименований(СтруктураСтанцийНазначения, МассивНазначения, МассивНазначенияАнгл);
				//СтруктураСтанцийОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОтправления,СтрРеквизиты);  
				СобратьМассивыНаименований(СтруктураСтанцийОтправления, МассивОтправления, МассивОтправленияАнгл);
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				СобратьМассивыНаименований(СтруктураПортовОтгрузки, МассивОтгрузки, МассивОтгрузкиАнгл);
				// Евросиб Рыбьяков К.А. 16.09.2024 ))
			КонецЕсли;
			
			Если МассивНазначения.Количество() Тогда
				СтрокаПунктыДоставки = СтрСоединить(МассивНазначения, ", ");
				СтрокаПунктыДоставкиАнгл = СтрСоединить(МассивНазначенияАнгл, ", ");
			Иначе	
				//СтруктураДоставки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответ.ПунктНазначения, СтрРеквизиты);
				СтрокаПунктыДоставки = Ответ.ПунктНазначенияНаименование;
				СтрокаПунктыДоставкиАнгл = Ответ.ПунктНазначенияНаименованиеАнгл;
			КонецЕсли;    
			
			Если МассивОтправления.Количество() Тогда
				СтрокаПунктыОтправления = СтрСоединить(МассивОтправления, ", ");
				СтрокаПунктыОтправленияАнгл = СтрСоединить(МассивОтправленияАнгл, ", ");
			Иначе	
				//СтруктураОтправлений = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответ.ПунктОтправления, СтрРеквизиты); 
				СтрокаПунктыОтправления = Ответ.ПунктОтправленияНаименование;
				СтрокаПунктыОтправленияАнгл = Ответ.ПунктОтправленияНаименованиеАнгл;
			КонецЕсли;
			
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			Если МассивОтгрузки.Количество() Тогда
				СтрокаПунктыОтгрузки = СтрСоединить(МассивОтгрузки, ", ");
				СтрокаПунктыОтгрузкиАнгл = СтрСоединить(МассивОтгрузки, ", ");
			Иначе
				СтрокаПунктыОтгрузки = Ответ.ПортОтгрузкиНаименование;
				СтрокаПунктыОтгрузкиАнгл = Ответ.ПортОтгрузкиНаименованиеАнгл;
			КонецЕсли;  
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
			
			НСтр = Объект.ВариантыМаршрута.Добавить();   
			//СтруктураПортОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответ.ПортОтправления, СтрРеквизиты);
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			НСтр.ПортПогрузкиRUS = СтрокаПунктыОтгрузки;
			НСтр.ПортПогрузкиENG = СтрокаПунктыОтгрузкиАнгл;
			//НСтр.ПортПогрузкиRUS = Ответ.ПортОтправленияНаименование;
			//НСтр.ПортПогрузкиENG = Ответ.ПортОтправленияНаименованиеАнгл;
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
			НСтр.ПунктОтправленияRUS = СтрокаПунктыОтправления;
			НСтр.ПунктОтправленияENG = СтрокаПунктыОтправленияАнгл; 
			НСтр.ПунктДоставкиRUS = СтрокаПунктыДоставки;
			НСтр.ПунктДоставкиENG = СтрокаПунктыДоставкиАнгл;
			НСтр.ТипКТК = "" + Ответ.РазмерКТК + Символы.ПС + "GP, HC";
			ИтогоСтавка = Ответ.Ставка +  Валюта_сервер.ПересчитатьПоКурсу(Ответ.Затраты+Ответ.Вознаграждение, Ответ.Валюта1, Объект.Валюта, Объект.Дата);
			НСтр.СтавкаUSD = Валюта_сервер.ПересчитатьПоКурсу(ИтогоСтавка, Ответ.Валюта, Объект.Валюта, Объект.Дата);
			
			НСтр = Объект.ТЧ.Добавить(); 
			НСтр.ТипСтавки = Перечисления.ТипыСтавокПротокола.Ставка;
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			НСтр.ПортПогрузкиRUS = СтрокаПунктыОтгрузки; 
			НСтр.ПортПогрузкиENG = СтрокаПунктыОтгрузкиАнгл;
			//НСтр.ПортПогрузкиRUS = Ответ.ПортОтправленияНаименование;
			//НСтр.ПортПогрузкиENG = Ответ.ПортОтправленияНаименованиеАнгл;
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
			НСтр.ПунктОтправленияRUS = СтрокаПунктыОтправления;  
			НСтр.ПунктОтправленияENG = СтрокаПунктыОтправленияАнгл;
			НСтр.ПунктДоставкиRUS = СтрокаПунктыДоставки;  
			НСтр.ПунктДоставкиENG = СтрокаПунктыДоставкиАнгл;
			
			НСтр.ТипКТК = "" + Ответ.РазмерКТК + Символы.ПС + "GP, HC";    
			Если не ЗначениеЗаполнено(Ответ.РазмерКТК) Тогда
				НСтр.ТипКТК = ?(Ответ.СуммаОплаты40 <> 0, "40фут", "20фут");	
			КонецЕсли;
			НСтр.Валюта = Ответ.Валюта;
			НСтр.СтавкаНДС = Ответ.СтавкаНДС;
			НСтр.СуммаСНДС = Макс(Ответ.СуммаОплаты40, Ответ.СуммаОплаты20);
			НСтр.Услуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответ.Номенклатура, "НаименованиеПолное");
			НСтр.ПунктОтправления = Ответ.ПунктОтправления;
			НСтр.ПунктНазначения = Ответ.ПунктНазначения;
		КонецЦикла; 
	КонецЦикла;  
	// ДИТ BUG 57945 TA 73942 Сержантова А.С. Конец: 18.09.2023
	
КонецПроцедуры    

// ДИТ BUG 57945 ТА 73942 Сержантова А.С. Начало: 18.09.2023
Процедура СобратьМассивыНаименований(СтруктураНаименований, МассивНаименований, МассивНаименованийАнгл)
	МассивНаименований.Очистить();
	МассивНаименованийАнгл.Очистить();
	Для каждого Стр Из СтруктураНаименований Цикл
		//Если Стр.Значение.Наименование <> "" Тогда
		//	МассивНаименований.Добавить(Стр.Значение.Наименование);
		//КонецЕсли;
		//Если Стр.Значение.НаименованиеАнгл <> "" Тогда
		//	МассивНаименованийАнгл.Добавить(Стр.Значение.НаименованиеАнгл);  
		//КонецЕсли
		Если Стр.Наименование <> "" Тогда
			МассивНаименований.Добавить(Стр.Наименование);
		КонецЕсли;
		Если Стр.НаименованиеАнгл <> "" Тогда
			МассивНаименованийАнгл.Добавить(Стр.НаименованиеАнгл);  
		КонецЕсли
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьКалькуляцию(Объект, ТипКалькуляции) Экспорт
	// Перенесена из модуля формы для доступа из калькуляции
	Объект.ВариантыМаршрута.Очистить();
	Объект.ТЧ.Очистить();
	
	//Евросиб Каблов 12.01.2021 ( Ticket#0213705
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КалькуляцияПланПродаж_Доходы.Номенклатура.НаименованиеПолное КАК Услуга,
	//|	КалькуляцияПланПродаж_Доходы.СуммаАванса40 + КалькуляцияПланПродаж_Доходы.СуммаОплаты40 КАК Сумма40,
	//|	КалькуляцияПланПродаж_Доходы.СуммаАванса20 + КалькуляцияПланПродаж_Доходы.СуммаОплаты20 КАК Сумма20,
	//|	КалькуляцияПланПродаж_Доходы.Валюта КАК Валюта,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления.Наименование
	//|		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктОтправления.Наименование
	//|	КОНЕЦ КАК ПунктОтправленияRUS,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения.Наименование
	//|		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктНазначения.Наименование
	//|	КОНЕЦ КАК ПунктДоставкиRUS,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.ПС_ВидПеревозки КАК ВидПеревозки,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.ТерриторияМаршрута КАК ТерриторияМаршрута,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка КАК Ссылка,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления.НаименованиеАнгл
	//|		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл
	//|	КОНЕЦ КАК ПунктОтправленияENG,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения.НаименованиеАнгл
	//|		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктНазначения.НаименованиеАнгл
	//|	КОНЕЦ КАК ПунктДоставкиENG,
	//|	КалькуляцияПланПродаж_Доходы.ТипСтавки КАК ТипСтавки,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//|				И КалькуляцияПланПродаж_Доходы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.УсловияПеревозки_Отправление
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Отправление,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//|				И КалькуляцияПланПродаж_Доходы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.УсловияПеревозки_Прибытие
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//|			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.СпециальныеУсловия
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК СпециальныеУсловия,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктОтправления КАК ПунктОтправления,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктНазначения КАК ПунктНазначения,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.веб_ДляКТКЕвросиб КАК КТКЕвросиб,
	//|	КалькуляцияПланПродаж_Доходы.СуммаНДС20 КАК СуммаНДС20,
	//|	КалькуляцияПланПродаж_Доходы.СуммаНДС40 КАК СуммаНДС40,
	//|	КалькуляцияПланПродаж_Доходы.СтавкаНДС КАК СтавкаНДС,
	//|	ПРЕДСТАВЛЕНИЕ(КалькуляцияПланПродаж_Доходы.Ссылка.Груз) КАК Груз,
	//|	КалькуляцияПланПродаж_Доходы.ПроцентВознаграждения КАК ПроцентВознаграждения,
	//|	КалькуляцияПланПродаж_Доходы.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	//|	КалькуляцияПланПродаж_Доходы.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	//|	КалькуляцияПланПродаж_Доходы.БазаДляРасчетаВР КАК БазаДляРасчетаВР,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЭтоОсновнаяУслуга,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//|			ТОГДА 0
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК ПорядокПоОсновнойУслуге,
	//|	ПОДСТРОКА(КалькуляцияПланПродаж_Доходы.Номенклатура.НаименованиеПолное, 1, 50) КАК ПорядокПоНаименованию,
	//|	КалькуляцияПланПродаж_Доходы.Ссылка.ДополнительныеУсловияДляПечатиПСЦ КАК ДопУсловия
	//|ИЗ
	//|	Документ.Калькуляция.ПланПродаж_Доходы КАК КалькуляцияПланПродаж_Доходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка,
	//|			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга
	//|		ИЗ
	//|			Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|		ГДЕ
	//|			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Калькуляции)
	//|			И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1) КАК ОсновныеУслуги
	//|		ПО КалькуляцияПланПродаж_Доходы.Ссылка = ОсновныеУслуги.Ссылка
	//|ГДЕ
	//|	КалькуляцияПланПродаж_Доходы.Ссылка В(&Калькуляции)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ПорядокПоОсновнойУслуге,
	//|	ПорядокПоНаименованию";
	//Запрос.УстановитьПараметр("Ставка", Перечисления.ТипыСтавокПротокола.Ставка);
	//Запрос.УстановитьПараметр("Калькуляции", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));
	//
	//Ответ = запрос.Выполнить().Выбрать();
	//Если Ответ.Следующий() Тогда
	//	Объект.СуммаВключаетНДС = Ответ.СуммаВключаетНДС;
	//КонецЕсли;
	//
	//Ответ.Сбросить();
	//Пока Ответ.Следующий() Цикл
	//	Если ТипКалькуляции = "Контейнеры" Тогда
	//		Если ЗначениеЗаполнено(Ответ.Сумма20) Тогда
	//			НСтр = Объект.ТЧ.Добавить();
	//			ЗаполнитьЗначенияСвойств(НСтр, Ответ);
	//			//НСтр.Груз = "Контейнеры 20ф";
	//			НСтр.ТипКТК = "20фут";
	//			НСтр.СуммаНДС = Ответ.СуммаНДС20;
	//			Если Ответ.СуммаВключаетНДС Тогда
	//				НСтр.СуммаСНДС = Ответ.Сумма20;					
	//				НСтр.СуммаБезНДС = Ответ.Сумма20 - Ответ.СуммаНДС20;
	//			Иначе
	//				НСтр.СуммаСНДС = Ответ.Сумма20 + Ответ.СуммаНДС20;					
	//				НСтр.СуммаБезНДС = Ответ.Сумма20;
	//			КонецЕсли;
	//			
	//			Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
	//				НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
	//				НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
	//			КонецЕсли;
	//			
	//			Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
	//				НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
	//				НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
	//			КонецЕсли;
	//			
	//			НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
	//			НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Ответ.Сумма40) Или ЗначениеЗаполнено(Ответ.ПроцентВознаграждения) Тогда
	//		НСтр = Объект.ТЧ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
	//		//НСтр.Груз = "Контейнеры 40ф";
	//		Если ТипКалькуляции = "Контейнеры" Тогда
	//			НСтр.ТипКТК = "40фут";
	//			//НСтр.Груз = "";
	//		ИначеЕсли ТипКалькуляции = "Вагоны" Тогда
	//			НСтр.УсловияПеревозки_Отправление = Перечисления.УсловияПеревозкиКТК.ПустаяСсылка();
	//			НСтр.УсловияПеревозки_Прибытие = Перечисления.УсловияПеревозкиКТК.ПустаяСсылка();
	//		КонецЕсли;
	//		
	//		НСтр.СуммаНДС = Ответ.СуммаНДС40;
	//		Если Ответ.СуммаВключаетНДС Тогда
	//			НСтр.СуммаСНДС = Ответ.Сумма40;					
	//			НСтр.СуммаБезНДС = Ответ.Сумма40 - Ответ.СуммаНДС40;
	//		Иначе
	//			НСтр.СуммаСНДС = Ответ.Сумма40 + Ответ.СуммаНДС40;					
	//			НСтр.СуммаБезНДС = Ответ.Сумма40;
	//		КонецЕсли;
	//		
	//		Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
	//			НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
	//			НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
	//		КонецЕсли;
	//		
	//		Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
	//			НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
	//			НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
	//		КонецЕсли;
	//		
	//		НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
	//		НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
	//		
	//	КонецЕсли;
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПортыОтправленияНазначения.Порт КАК Порт,
	|	ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	|	ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	|	ПортыОтправленияНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПортыОтправленияНазначения
	|ИЗ
	|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК ПортыОтправленияНазначения
	|ГДЕ
	|	ПортыОтправленияНазначения.Ссылка В (&Калькуляции)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСтанцийНазначения.Станция КАК Станция,
	|	СписокСтанцийНазначения.Станция.Наименование КАК Наименование,
	|	СписокСтанцийНазначения.Станция.НаименованиеАнгл КАК НаименованиеАнгл,
	|	СписокСтанцийНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтанцийНазначения
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК СписокСтанцийНазначения
	|ГДЕ
	|	СписокСтанцийНазначения.Ссылка В (&Калькуляции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСтанцийОтправления.Станция КАК Станция,
	|	СписокСтанцийОтправления.Станция.Наименование КАК Наименование,
	|	СписокСтанцийОтправления.Станция.НаименованиеАнгл КАК НаименованиеАнгл,
	|	СписокСтанцийОтправления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтанцийОтправления
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийОтправления КАК СписокСтанцийОтправления
	|ГДЕ
	|	СписокСтанцийОтправления.Ссылка В (&Калькуляции)
	|;
	|
	// Евросиб Рыбьяков К.А. 17.09.2024 ))
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ДокументКалькуляция.Ссылка КАК КалькуляцияСсылка,
	|	ВЫБОР 
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|			ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|		ИНАЧЕ 
	|			ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ ВТ_ОсновныеУслугиКалькуляций
	|ИЗ Документ.Калькуляция КАК ДокументКалькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ДокументКалькуляция.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	|
	|ГДЕ ДокументКалькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга.НаименованиеПолное КАК Услуга,
	//|	Калькуляция.ММ_ИтогоСтавка20 КАК Сумма20,
	//|	Калькуляция.ММ_ИтогоСтавка КАК Сумма40,
	//|	Калькуляция.СтавкаНДС КАК СтавкаНДС,
	//|	Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//|	Калькуляция.Валюта КАК Валюта,
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка) КАК ТипСтавки,
	//|	ИСТИНА КАК ЭтоОсновнаяУслуга,
	//|	Калькуляция.ДополнительныеУсловияДляПечатиПСЦ КАК ДопУсловия,
	//|	Калькуляция.Суша_ПунктОтправления КАК ПунктОтправления,
	//|	Калькуляция.Суша_ПунктНазначения КАК ПунктНазначения,
	//|	Калькуляция.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	//|	Калькуляция.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	//|	Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	//|	Калькуляция.ТерриторияМаршрута КАК ТерриторияМаршрута,
	//|	Калькуляция.Ссылка КАК Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(Калькуляция.Груз) КАК Груз,
	//|	Калькуляция.веб_ДляКТКЕвросиб КАК КТКЕвросиб,
	//|	Калькуляция.СпециальныеУсловия КАК СпециальныеУсловия,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА Калькуляция.УсловияПеревозки_Отправление
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Отправление,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА Калькуляция.УсловияПеревозки_Прибытие
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	//|	Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияRUS,
	//|	Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктДоставкиRUS,
	//|	Калькуляция.Суша_ПунктОтправления.НаименованиеАнгл КАК ПунктОтправленияENG,
	//|	Калькуляция.Суша_ПунктНазначения.НаименованиеАнгл КАК ПунктДоставкиENG,
	//|	ПОДСТРОКА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга.НаименованиеПолное, 1, 50) КАК НаименованиеУслуги,
	//|	0 КАК ПроцентВознаграждения,
	//|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСВознаграждения,
	//|	ЛОЖЬ КАК ВознаграждениеВключаетНДС,
	//|	0 КАК БазаДляРасчетаВР
	//|ИЗ
	//|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК Калькуляция
	//|		ПО КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = Калькуляция.Ссылка
	//|ГДЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	//|	И Калькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга.НаименованиеПолное КАК Услуга,
	|	Калькуляция.ММ_ИтогоСтавка20 КАК Сумма20,
	|	Калькуляция.ММ_ИтогоСтавка КАК Сумма40,
	|	Калькуляция.СтавкаНДС КАК СтавкаНДС,
	|	Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Калькуляция.Валюта КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка) КАК ТипСтавки,
	|	ИСТИНА КАК ЭтоОсновнаяУслуга,
	|	Калькуляция.ДополнительныеУсловияДляПечатиПСЦ КАК ДопУсловия,
	|	Калькуляция.Суша_ПунктОтправления КАК ПунктОтправления,
	|	Калькуляция.Суша_ПунктНазначения КАК ПунктНазначения,
	|	Калькуляция.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	|	Калькуляция.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	|	Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	|	Калькуляция.ТерриторияМаршрута КАК ТерриторияМаршрута,
	|	Калькуляция.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Калькуляция.Груз) КАК Груз,
	|	Калькуляция.веб_ДляКТКЕвросиб КАК КТКЕвросиб,
	|	Калькуляция.СпециальныеУсловия КАК СпециальныеУсловия,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|			ТОГДА Калькуляция.УсловияПеревозки_Отправление
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УсловияПеревозки_Отправление,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|			ТОГДА Калькуляция.УсловияПеревозки_Прибытие
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	|	Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияRUS,
	|	Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктДоставкиRUS,
	|	Калькуляция.Суша_ПунктОтправления.НаименованиеАнгл КАК ПунктОтправленияENG,
	|	Калькуляция.Суша_ПунктНазначения.НаименованиеАнгл КАК ПунктДоставкиENG,
	|	ПОДСТРОКА(ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга.НаименованиеПолное, 1, 50) КАК НаименованиеУслуги,
	|	0 КАК ПроцентВознаграждения,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСВознаграждения,
	|	ЛОЖЬ КАК ВознаграждениеВключаетНДС,
	|	0 КАК БазаДляРасчетаВР
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеУслугиКалькуляций КАК ВТ_ОсновныеУслугиКалькуляций
	|		ПО ВТ_ОсновныеУслугиКалькуляций.КалькуляцияСсылка = Калькуляция.Ссылка
	|ГДЕ
	|	Калькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга.НаименованиеПолное,
	//Евросиб Каблов 19.03.2021 ( Ticket#0226454
	//|	КалькуляцияЖД_УслугиВнеСтавки.Ставка20,
	//|	КалькуляцияЖД_УслугиВнеСтавки.Ставка40,
	|	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20,
	|	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40,
	//Евросиб Каблов 19.03.2021 )
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Валюта,
	|	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки,
	|	ЛОЖЬ,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ДополнительныеУсловияДляПечатиПСЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения
	|	КОНЕЦ,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ЖД_ПринадлежностьПС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ПС_ВидПеревозки,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ТерриторияМаршрута,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Груз),
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.веб_ДляКТКЕвросиб,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления.Наименование
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения.Наименование
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления.НаименованиеАнгл
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения.НаименованиеАнгл
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения.НаименованиеАнгл
	|	КОНЕЦ,
	|	ПОДСТРОКА(КалькуляцияЖД_УслугиВнеСтавки.Услуга.НаименованиеПолное, 1, 50),
	|	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.БазаДляРасчетаВР
	|ИЗ
	|	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|ГДЕ
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка В(&Калькуляции)
	|	И КалькуляцияЖД_УслугиВнеСтавки.ВключатьВПФПСЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоОсновнаяУслуга УБЫВ,
	|	НаименованиеУслуги";
	Запрос.УстановитьПараметр("Ставка", Перечисления.ТипыСтавокПротокола.Ставка);
	Запрос.УстановитьПараметр("Калькуляции", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ПортыОтправленияНазначения = МассивРезультатов[0].Выгрузить();
	СписокСтанцийНазначения = МассивРезультатов[1].Выгрузить();
	СписокСтанцийОтправления = МассивРезультатов[2].Выгрузить();
	
	//Выборка = МассивРезультатов[3].Выбрать();
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	Выборка = МассивРезультатов[4].Выбрать();
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	Если Выборка.Следующий() Тогда
		Объект.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
	КонецЕсли;
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Если ТипКалькуляции = "Контейнеры" Тогда
			Если ЗначениеЗаполнено(Выборка.Сумма20) Тогда
				НСтр = Объект.ТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, Выборка);
				//НСтр.Груз = "Контейнеры 20ф";
				НСтр.ТипКТК = "20фут";
				
				ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС);		
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Выборка.Сумма20, ПроцентСтавкиНДС, Истина, Выборка.СуммаВключаетНДС);
				
				НСтр.СуммаНДС = СуммаНДС;
				Если Выборка.СуммаВключаетНДС Тогда
					НСтр.СуммаСНДС = Выборка.Сумма20;					
					НСтр.СуммаБезНДС = Выборка.Сумма20 - СуммаНДС;
				Иначе
					НСтр.СуммаСНДС = Выборка.Сумма20 + СуммаНДС;					
					НСтр.СуммаБезНДС = Выборка.Сумма20;
				КонецЕсли;
				
				//Если Выборка.ЭтоОсновнаяУслуга И Выборка.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
				//	НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Выборка.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Выборка.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				//
				//Если Выборка.ЭтоОсновнаяУслуга И Выборка.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
				//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Выборка.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Выборка.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				
				//НСтр.ПортПогрузкиRUS = Выборка.Ссылка.ММ_ПортОтправления.Наименование;
				//НСтр.ПортПогрузкиENG = Выборка.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
				
				Если Выборка.ЭтоОсновнаяУслуга И СписокСтанцийОтправления.Количество() > 0 Тогда
					НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийОтправления, Ложь);
					НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийОтправления, Истина);
				КонецЕсли;
				
				Если Выборка.ЭтоОсновнаяУслуга И СписокСтанцийНазначения.Количество() > 0 Тогда
					НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийНазначения, Ложь);
					НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийНазначения, Истина);
				КонецЕсли;
				
				НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, ПортыОтправленияНазначения, Ложь);
				НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, ПортыОтправленияНазначения, Истина);
				// Евросиб Рыбьяков К.А. 16.09.2024 ))
				
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Сумма40) Или ЗначениеЗаполнено(Выборка.ПроцентВознаграждения) Тогда
			НСтр = Объект.ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Выборка);
			//НСтр.Груз = "Контейнеры 40ф";
			Если ТипКалькуляции = "Контейнеры" Тогда
				НСтр.ТипКТК = "40фут";
				//НСтр.Груз = "";
			ИначеЕсли ТипКалькуляции = "Вагоны" Тогда
				НСтр.УсловияПеревозки_Отправление = Перечисления.УсловияПеревозкиКТК.ПустаяСсылка();
				НСтр.УсловияПеревозки_Прибытие = Перечисления.УсловияПеревозкиКТК.ПустаяСсылка();
			КонецЕсли;
			
			ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС);		
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Выборка.Сумма40, ПроцентСтавкиНДС, Истина, Выборка.СуммаВключаетНДС);
			
			НСтр.СуммаНДС = СуммаНДС;
			Если Выборка.СуммаВключаетНДС Тогда
				НСтр.СуммаСНДС = Выборка.Сумма40;					
				НСтр.СуммаБезНДС = Выборка.Сумма40 - СуммаНДС;
			Иначе
				НСтр.СуммаСНДС = Выборка.Сумма40 + СуммаНДС;					
				НСтр.СуммаБезНДС = Выборка.Сумма40;
			КонецЕсли;
			
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			//Если Выборка.ЭтоОсновнаяУслуга И Выборка.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
			//	НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Выборка.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
			//	НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Выборка.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
			//КонецЕсли;
			//
			//Если Выборка.ЭтоОсновнаяУслуга И Выборка.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
			//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Выборка.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
			//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Выборка.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
			//КонецЕсли;
			
			//НСтр.ПортПогрузкиRUS = Выборка.Ссылка.ММ_ПортОтправления.Наименование;
			//НСтр.ПортПогрузкиENG = Выборка.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
			Если Выборка.ЭтоОсновнаяУслуга И СписокСтанцийОтправления.Количество() > 0 Тогда
				НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийОтправления, Ложь);
				НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийОтправления, Истина);
			КонецЕсли;
			
			Если Выборка.ЭтоОсновнаяУслуга И СписокСтанцийНазначения.Количество() > 0 Тогда
				НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийНазначения, Ложь);
				НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, СписокСтанцийНазначения, Истина);
			КонецЕсли;
			
			НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Выборка.Ссылка, ПортыОтправленияНазначения, Ложь);
			НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Выборка.Ссылка, ПортыОтправленияНазначения, Истина);
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
			
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 12.01.2021 )
	
	// дополнить фрахтовой составляющей
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	|	ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	|	ПортыОтправленияНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПортыОтправленияНазначения
	|ИЗ
	|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК ПортыОтправленияНазначения
	|ГДЕ
	|	ПортыОтправленияНазначения.Ссылка В(&Ссылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСтанцийНазначения.Станция.Наименование КАК Наименование,
	|	СписокСтанцийНазначения.Станция.НаименованиеАнгл КАК НаименованиеАнгл,
	|	СписокСтанцийНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтанцийНазначения
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК СписокСтанцийНазначения
	|ГДЕ
	|	СписокСтанцийНазначения.Ссылка В(&Ссылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПросчитанныеСтавкиФрахта.Ссылка КАК Ссылка, 
	|	ПросчитанныеСтавкиФрахта.Направление.ПунктНазначения.Наименование КАК Наименование,
	|	ПросчитанныеСтавкиФрахта.Направление.ПунктНазначения.НаименованиеАнгл КАК НаименованиеАнгл
	|ПОМЕСТИТЬ ВТ_ПросчитанныеСтавкиФрахта
	|ИЗ
	|	Документ.Калькуляция.ММ_ПросчитанныеСтавкиФрахта КАК ПросчитанныеСтавкиФрахта
	|ГДЕ
	|	ПросчитанныеСтавкиФрахта.Ссылка В(&Ссылка)
	|;
	|
	// Евросиб Рыбьяков К.А. 17.09.2024 ))
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК Ссылка,
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((
	//|	Калькуляция.ММ_ПортОтправления КАК ММ_ПортОтправления,
	// Евросиб Рыбьяков К.А. 17.09.2024 ))
	|	Калькуляция.море20_Вознаграждение КАК море20_Вознаграждение,
	|	Калькуляция.море20_Контрагент КАК море20_Контрагент,
	|	Калькуляция.море20_Себестоимость КАК море20_Себестоимость,
	|	Калькуляция.море40_Вознаграждение КАК море40_Вознаграждение,
	|	Калькуляция.море40_Контрагент КАК море40_Контрагент,
	|	Калькуляция.море40_Себестоимость КАК море40_Себестоимость,
	|	Калькуляция.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	|	Калькуляция.НДСФрахт КАК НДСФрахт,
	|	Калькуляция.море20_Себестоимость + Калькуляция.море20_Вознаграждение КАК Ставка20,
	|	Калькуляция.море40_Себестоимость + Калькуляция.море40_Вознаграждение КАК Ставка40
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ПортыОтправленияНазначения = МассивРезультатов[0].Выгрузить();
	СписокСтанцийНазначения = МассивРезультатов[1].Выгрузить();
	ПросчитанныеСтавкиФрахта = МассивРезультатов[2].Выгрузить();
	
	Ответ = МассивРезультатов[3].Выбрать();
	
	Пока Ответ.Следующий() Цикл
		
		 Если ЗначениеЗаполнено(Ответ.Ставка20) Тогда
			НСтр = Объект.ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Ответ);
			НСтр.Услуга = Константы.УслугаФрахтаДляКалькуляции.Получить().ПолноеНаименование();
			НСтр.Груз = "Контейнеры 20ф";
			НСтр.ТипКТК = "20фут";
			НСтр.СуммаСНДС = Ответ.Ставка20;
			
			НСтр.Валюта = Ответ.ММ_ВалютаФрахтовыхСтавок;
			НСтр.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре;
			
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
			НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
			//НСтр.ПунктОтправленияRUS = Ответ.ММ_ПортОтправления.Наименование;
			//НСтр.ПунктОтправленияENG = Ответ.ММ_ПортОтправления.НаименованиеАнгл;
			
			НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Ложь);
			НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Истина);
			//Если Ответ.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
			//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
			//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
			//КонецЕсли;
			
			НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
			НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
			//НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
			//НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ответ.Ставка40) Тогда
			НСтр = Объект.ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Ответ);
			НСтр.Услуга = Константы.УслугаФрахтаДляКалькуляции.Получить().ПолноеНаименование();
			НСтр.Груз = "Контейнеры 40ф";
			НСтр.ТипКТК = "40фут";
			НСтр.СуммаСНДС = Ответ.Ставка40;
			
			НСтр.Валюта = Ответ.ММ_ВалютаФрахтовыхСтавок;
			НСтр.ВидПеревозки = Справочники.ВидыПеревозок.ЭкспортМоре;
			
			// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
			НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
			НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
			//НСтр.ПунктОтправленияRUS = Ответ.ММ_ПортОтправления.Наименование;
			//НСтр.ПунктОтправленияENG = Ответ.ММ_ПортОтправления.НаименованиеАнгл;
			
			//СписокПунктовНазначения = Новый Массив;
			//Для каждого Стр8 из Ответ.Ссылка.ММ_ПросчитанныеСтавкиФрахта Цикл
			//	
			//	ПунктНазн = Стр8.Направление.ПунктНазначения;
			//	Если СписокПунктовНазначения.Найти(ПунктНазн) = неопределено Тогда 
			//		СписокПунктовНазначения.Добавить(ПунктНазн); 
			//	КонецЕсли;
			//	
			//КонецЦикла;
			
			НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПросчитанныеСтавкиФрахта, Ложь);
			НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПросчитанныеСтавкиФрахта, Истина);
			//Если СписокПунктовНазначения.Количество() > 0 Тогда
			//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(СписокПунктовНазначения);
			//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(СписокПунктовНазначения);
			//КонецЕсли;
			
			НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
			НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
			//НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
			//НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
			// Евросиб Рыбьяков К.А. 16.09.2024 ))
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения) Тогда
		Для Каждого СтрокаТЧ Из Объект.ТЧ Цикл
			Если СтрокаТЧ.ПроцентВознаграждения <> 0 Тогда
				Объект.СтавкаНДСВознаграждения = СтрокаТЧ.СтавкаНДСВознаграждения;
				Объект.СуммаВознагражденияВключаетНДС = СтрокаТЧ.ВознаграждениеВключаетНДС;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьМорскуюЧасть(Объект) Экспорт
	// Перенесена из модуля формы для доступа из калькуляции
	Объект.ТЧ_МорскаяЧасть.Очистить();
	
	ПостояннаяПрибавкаКФрахту20 = 0;
	ПостояннаяПрибавкаКФрахту40 = 0;
	Валюта20 = 0;
	Валюта40 = 0;
	ПостоянныйПунктОтправления = "";
	ПостоянныйФорматПогрузки = "";
	
	ГруппаСоответствияКалькуляциям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	//Евросиб Каблов 19.03.2021 ( Ticket#0226454
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало (закомментировал текст запроса, не используется)
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	КалькуляцияПланПродаж_Доходы.Номенклатура.НаименованиеПолное КАК Услуга,
	//               |	КалькуляцияПланПродаж_Доходы.СуммаАванса40 + КалькуляцияПланПродаж_Доходы.СуммаОплаты40 КАК Сумма40,
	//               |	КалькуляцияПланПродаж_Доходы.СуммаАванса20 + КалькуляцияПланПродаж_Доходы.СуммаОплаты20 КАК Сумма20,
	//               |	КалькуляцияПланПродаж_Доходы.Валюта КАК Валюта,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления.Наименование
	//               |		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктОтправления.Наименование
	//               |	КОНЕЦ КАК ПунктОтправленияRUS,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения.Наименование
	//               |		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктНазначения.Наименование
	//               |	КОНЕЦ КАК ПунктДоставкиRUS,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка.ПС_ВидПеревозки КАК ВидПеревозки,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка.ТерриторияМаршрута КАК ТерриторияМаршрута,
	//               |	КалькуляцияПланПродаж_Доходы.СтавкаНДС КАК СтавкаНДС,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка КАК Ссылка,
	//               |	КалькуляцияПланПродаж_Доходы.СуммаНДС20 КАК СуммаНДС20,
	//               |	КалькуляцияПланПродаж_Доходы.СуммаНДС40 КАК СуммаНДС40,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктОтправления.НаименованиеАнгл
	//               |		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл
	//               |	КОНЕЦ КАК ПунктОтправленияENG,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.ПунктНазначения.НаименованиеАнгл
	//               |		ИНАЧЕ КалькуляцияПланПродаж_Доходы.Ссылка.Суша_ПунктНазначения.НаименованиеАнгл
	//               |	КОНЕЦ КАК ПунктДоставкиENG,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.УсловияПеревозки_Отправление
	//               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//               |	КОНЕЦ КАК УсловияПеревозки_Отправление,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.УсловияПеревозки_Прибытие
	//               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//               |	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//               |			ТОГДА КалькуляцияПланПродаж_Доходы.Ссылка.СпециальныеУсловия
	//               |		ИНАЧЕ ЛОЖЬ
	//               |	КОНЕЦ КАК СпециальныеУсловия,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//               |			ТОГДА ИСТИНА
	//               |		ИНАЧЕ ЛОЖЬ
	//               |	КОНЕЦ КАК ЭтоОсновнаяУслуга,
	//               |	ВЫБОР
	//               |		КОГДА КалькуляцияПланПродаж_Доходы.Номенклатура = ОсновныеУслуги.ВыставляемаяУслуга
	//               |			ТОГДА 0
	//               |		ИНАЧЕ 1
	//               |	КОНЕЦ КАК ПорядокПоОсновнойУслуге,
	//               |	ПОДСТРОКА(КалькуляцияПланПродаж_Доходы.Номенклатура.НаименованиеПолное, 1, 50) КАК ПорядокПоНаименованию
	//               |ИЗ
	//               |	Документ.Калькуляция.ПланПродаж_Доходы КАК КалькуляцияПланПродаж_Доходы
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка,
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга
	//               |		ИЗ
	//               |			Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//               |		ГДЕ
	//               |			КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Ссылка)
	//               |			И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1) КАК ОсновныеУслуги
	//               |		ПО КалькуляцияПланПродаж_Доходы.Ссылка = ОсновныеУслуги.Ссылка
	//               |ГДЕ
	//               |	КалькуляцияПланПродаж_Доходы.Ссылка В(&Ссылка)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ПорядокПоОсновнойУслуге,
	//               |	ПорядокПоНаименованию";
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	Запрос.УстановитьПараметр("Ссылка", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));
		
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПортыОтправленияНазначения.Порт КАК Порт,
	|	ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	|	ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	|	ПортыОтправленияНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПортыОтправленияНазначения
	|ИЗ
	|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК ПортыОтправленияНазначения
	|ГДЕ
	|	ПортыОтправленияНазначения.Ссылка В (&Ссылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСтанцийНазначения.Станция КАК Станция,
	|	СписокСтанцийНазначения.Станция.Наименование КАК Наименование,
	|	СписокСтанцийНазначения.Станция.НаименованиеАнгл КАК НаименованиеАнгл,
	|	СписокСтанцийНазначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтанцийНазначения
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК СписокСтанцийНазначения
	|ГДЕ
	|	СписокСтанцийНазначения.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСтанцийОтправления.Станция КАК Станция,
	|	СписокСтанцийОтправления.Станция.Наименование КАК Наименование,
	|	СписокСтанцийОтправления.Станция.НаименованиеАнгл КАК НаименованиеАнгл,
	|	СписокСтанцийОтправления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтанцийОтправления
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийОтправления КАК СписокСтанцийОтправления
	|ГДЕ
	|	СписокСтанцийОтправления.Ссылка В (&Ссылка)
	|;
	|
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ДокументКалькуляция.Ссылка КАК КалькуляцияСсылка,
	|	ВЫБОР 
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|			ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|		ИНАЧЕ 
	|			ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ ВТ_ОсновныеУслугиКалькуляций
	|ИЗ Документ.Калькуляция КАК ДокументКалькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ДокументКалькуляция.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	|
	|ГДЕ ДокументКалькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Евросиб Рыбьяков К.А. 17.09.2024 ))
	//|ВЫБРАТЬ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга.НаименованиеПолное КАК Услуга,
	//|	Калькуляция.ММ_ИтогоСтавка20 КАК Сумма20,
	//|	Калькуляция.ММ_ИтогоСтавка КАК Сумма40,
	//|	Калькуляция.СтавкаНДС КАК СтавкаНДС,
	//|	Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//|	Калькуляция.Валюта КАК Валюта,
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка) КАК ТипСтавки,
	//|	ИСТИНА КАК ЭтоОсновнаяУслуга,
	//|	Калькуляция.ДополнительныеУсловияДляПечатиПСЦ КАК ДопУсловия,
	//|	Калькуляция.Суша_ПунктОтправления КАК ПунктОтправления,
	//|	Калькуляция.Суша_ПунктНазначения КАК ПунктНазначения,
	//|	Калькуляция.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	//|	Калькуляция.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	//|	Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	//|	Калькуляция.ТерриторияМаршрута КАК ТерриторияМаршрута,
	//|	Калькуляция.Ссылка КАК Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(Калькуляция.Груз) КАК Груз,
	//|	Калькуляция.веб_ДляКТКЕвросиб КАК КТКЕвросиб,
	//|	Калькуляция.СпециальныеУсловия КАК СпециальныеУсловия,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА Калькуляция.УсловияПеревозки_Отправление
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Отправление,
	//|	ВЫБОР
	//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	//|			ТОГДА Калькуляция.УсловияПеревозки_Прибытие
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	//|	Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияRUS,
	//|	Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктДоставкиRUS,
	//|	Калькуляция.Суша_ПунктОтправления.НаименованиеАнгл КАК ПунктОтправленияENG,
	//|	Калькуляция.Суша_ПунктНазначения.НаименованиеАнгл КАК ПунктДоставкиENG,
	//|	ПОДСТРОКА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга.НаименованиеПолное, 1, 50) КАК НаименованиеУслуги,
	//|	0 КАК ПроцентВознаграждения,
	//|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСВознаграждения,
	//|	ЛОЖЬ КАК ВознаграждениеВключаетНДС,
	//|	0 КАК БазаДляРасчетаВР
	//|ИЗ
	//|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК Калькуляция
	//|		ПО КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = Калькуляция.Ссылка
	//|ГДЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	//|	И Калькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга.НаименованиеПолное КАК Услуга,
	|	Калькуляция.ММ_ИтогоСтавка20 КАК Сумма20,
	|	Калькуляция.ММ_ИтогоСтавка КАК Сумма40,
	|	Калькуляция.СтавкаНДС КАК СтавкаНДС,
	|	Калькуляция.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Калькуляция.Валюта КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка) КАК ТипСтавки,
	|	ИСТИНА КАК ЭтоОсновнаяУслуга,
	|	Калькуляция.ДополнительныеУсловияДляПечатиПСЦ КАК ДопУсловия,
	|	Калькуляция.Суша_ПунктОтправления КАК ПунктОтправления,
	|	Калькуляция.Суша_ПунктНазначения КАК ПунктНазначения,
	|	Калькуляция.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	|	Калькуляция.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	|	Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	|	Калькуляция.ТерриторияМаршрута КАК ТерриторияМаршрута,
	|	Калькуляция.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Калькуляция.Груз) КАК Груз,
	|	Калькуляция.веб_ДляКТКЕвросиб КАК КТКЕвросиб,
	|	Калькуляция.СпециальныеУсловия КАК СпециальныеУсловия,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|			ТОГДА Калькуляция.УсловияПеревозки_Отправление
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УсловияПеревозки_Отправление,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|			ТОГДА Калькуляция.УсловияПеревозки_Прибытие
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УсловияПеревозки_Прибытие,
	|	Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияRUS,
	|	Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктДоставкиRUS,
	|	Калькуляция.Суша_ПунктОтправления.НаименованиеАнгл КАК ПунктОтправленияENG,
	|	Калькуляция.Суша_ПунктНазначения.НаименованиеАнгл КАК ПунктДоставкиENG,
	|	ПОДСТРОКА(ВТ_ОсновныеУслугиКалькуляций.ОсновнаяУслуга.НаименованиеПолное, 1, 50) КАК НаименованиеУслуги,
	|	0 КАК ПроцентВознаграждения,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСВознаграждения,
	|	ЛОЖЬ КАК ВознаграждениеВключаетНДС,
	|	0 КАК БазаДляРасчетаВР
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеУслугиКалькуляций КАК ВТ_ОсновныеУслугиКалькуляций
	|		ПО ВТ_ОсновныеУслугиКалькуляций.КалькуляцияСсылка = Калькуляция.Ссылка
	|ГДЕ
	|	Калькуляция.Ссылка В(&Калькуляции)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга.НаименованиеПолное,
	|	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20,
	|	КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Валюта,
	|	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки,
	|	ЛОЖЬ,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ДополнительныеУсловияДляПечатиПСЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения
	|	КОНЕЦ,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ЖД_ПринадлежностьПС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ПС_ВидПеревозки,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.ТерриторияМаршрута,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Груз),
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка.веб_ДляКТКЕвросиб,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления.Наименование
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения.Наименование
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления.НаименованиеАнгл
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктОтправления.НаименованиеАнгл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения.НаименованиеАнгл
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Ссылка.Суша_ПунктНазначения.НаименованиеАнгл
	|	КОНЕЦ,
	|	ПОДСТРОКА(КалькуляцияЖД_УслугиВнеСтавки.Услуга.НаименованиеПолное, 1, 50),
	|	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.БазаДляРасчетаВР
	|ИЗ
	|	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|ГДЕ
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка В(&Калькуляции)
	|	И КалькуляцияЖД_УслугиВнеСтавки.ВключатьВПФПСЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоОсновнаяУслуга УБЫВ,
	|	НаименованиеУслуги";
	Запрос.УстановитьПараметр("Ставка", Перечисления.ТипыСтавокПротокола.Ставка);
	Запрос.УстановитьПараметр("Калькуляции", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция"));
	//Евросиб Каблов 19.03.2021 )

	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ПортыОтправленияНазначения = МассивРезультатов[0].Выгрузить();
	СписокСтанцийНазначения = МассивРезультатов[1].Выгрузить();
	СписокСтанцийОтправления = МассивРезультатов[2].Выгрузить();

	Ответ = МассивРезультатов[3].Выбрать();
	
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Объект.СуммаВключаетНДС = Ответ.СуммаВключаетНДС;
	КонецЕсли;	
	Ответ.Сбросить();
	
	Если Объект.ЗаполнятьФрахтИСушуСводно = ЛОЖЬ Тогда
		
		Пока Ответ.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Ответ.Сумма20) Тогда
				НСтр = Объект.ТЧ_МорскаяЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, Ответ);
				НСтр.Груз = "Контейнеры 20ф";
				НСтр.ТипКТК = "20 DC";
				//Евросиб Каблов 19.03.2021 ( Ticket#0226454
				//НСтр.СуммаСНДС = Ответ.Сумма20;
				//НСтр.СуммаНДС = Ответ.СуммаНДС20;
				//НСтр.СуммаБезНДС = Ответ.Сумма20 - Ответ.СуммаНДС20;
				ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Ответ.СтавкаНДС);		
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Ответ.Сумма20, ПроцентСтавкиНДС, Истина, Ответ.СуммаВключаетНДС);
		
				НСтр.СуммаНДС = СуммаНДС;
				Если Ответ.СуммаВключаетНДС Тогда
					НСтр.СуммаСНДС = Ответ.Сумма20;					
					НСтр.СуммаБезНДС = Ответ.Сумма20 - СуммаНДС;
				Иначе
					НСтр.СуммаСНДС = Ответ.Сумма20 + СуммаНДС;					
					НСтр.СуммаБезНДС = Ответ.Сумма20;
				КонецЕсли;
				//Евросиб Каблов 19.03.2021 )
				
				// US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((
				//Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
				//	НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				//
				//Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
				//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				
				//НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
				//НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
				
				Если Ответ.ЭтоОсновнаяУслуга И СписокСтанцийОтправления.Количество() > 0 Тогда
					НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийОтправления, Ложь);
					НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийОтправления, Истина);
				КонецЕсли;
				
				Если Ответ.ЭтоОсновнаяУслуга И СписокСтанцийНазначения.Количество() > 0 Тогда
					НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Ложь);
					НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Истина);
				КонецЕсли;
				
				НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
				НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
				// Евросиб Рыбьяков К.А. 16.09.2024 ))
				
				НСтр.Услуга = НСтр.Услуга  + ?(Ответ.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ПоконтейнернаяОтправка, " (групповая отправка)", "");
				
			КонецЕсли;
			Если ЗначениеЗаполнено(Ответ.Сумма40) Тогда
				НСтр = Объект.ТЧ_МорскаяЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, Ответ);
				НСтр.Груз = "Контейнеры 40ф";
				НСтр.ТипКТК = "40 HC";
				//Евросиб Каблов 19.03.2021 ( Ticket#0226454
				//НСтр.СуммаСНДС = Ответ.Сумма40;
				//НСтр.СуммаНДС = Ответ.СуммаНДС40;
				//НСтр.СуммаБезНДС = Ответ.Сумма40 - Ответ.СуммаНДС40;
				ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Ответ.СтавкаНДС);		
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Ответ.Сумма40, ПроцентСтавкиНДС, Истина, Ответ.СуммаВключаетНДС);
		
				НСтр.СуммаНДС = СуммаНДС;
				Если Ответ.СуммаВключаетНДС Тогда
					НСтр.СуммаСНДС = Ответ.Сумма40;
					НСтр.СуммаБезНДС = Ответ.Сумма40 - СуммаНДС;
				Иначе
					НСтр.СуммаСНДС = Ответ.Сумма40 + СуммаНДС;
					НСтр.СуммаБезНДС = Ответ.Сумма40;
				КонецЕсли;
				//Евросиб Каблов 19.03.2021 )
				
				// Евросиб US 87896 TA 90558 Рыбьяков К.А. 16.09.2024 ((
				//Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийОтправления.Количество() > 0 Тогда
				//	НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийОтправления.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				//
				//Если Ответ.ЭтоОсновнаяУслуга И Ответ.Ссылка.СписокСтанцийНазначения.Количество() > 0 Тогда
				//	НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокацийРУС(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//	НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокацийАНГЛ(Ответ.Ссылка.СписокСтанцийНазначения.Выгрузить().ВыгрузитьКолонку("Станция"));
				//КонецЕсли;
				
				//НСтр.ПортПогрузкиRUS = Ответ.Ссылка.ММ_ПортОтправления.Наименование;
				//НСтр.ПортПогрузкиENG = Ответ.Ссылка.ММ_ПортОтправления.НаименованиеАнгл;
				
				Если Ответ.ЭтоОсновнаяУслуга И СписокСтанцийОтправления.Количество() > 0 Тогда
					НСтр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийОтправления, Ложь);
					НСтр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийОтправления, Истина);
				КонецЕсли;
				
				Если Ответ.ЭтоОсновнаяУслуга И СписокСтанцийНазначения.Количество() > 0 Тогда
					НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Ложь);
					НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, СписокСтанцийНазначения, Истина);
				КонецЕсли;
				
				НСтр.ПортПогрузкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
				НСтр.ПортПогрузкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
				// Евросиб Рыбьяков К.А. 16.09.2024 ))
				
				НСтр.Услуга = НСтр.Услуга  + ?(Ответ.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ПоконтейнернаяОтправка, " (групповая отправка)", "");
				
			КонецЕсли;
			
			ГруппаСоответствияКалькуляциям.Вставить(Ответ.Ссылка, Новый Структура("ПостоянныйПунктОтправления,ПостоянныйФорматПогрузки,ПостояннаяПрибавкаКФрахту20,Валюта20,ПостояннаяПрибавкаКФрахту40,Валюта40",ПостоянныйПунктОтправления,ПостоянныйФорматПогрузки,ПостояннаяПрибавкаКФрахту20,Валюта20,ПостояннаяПрибавкаКФрахту40,Валюта40));
			
		КонецЦикла;
		
	Иначе
		
		Пока Ответ.Следующий() Цикл
			
		//Трундуков СА 113916 08.07.2025
			//Добавление проверки "ЭтоОснованяУслуга"
			Если Ответ.ЭтоОсновнаяУслуга = Истина Тогда
				ПостоянныйПунктОтправления = Ответ.ПунктОтправленияRUS;
				ПостоянныйФорматПогрузки = Ответ.УсловияПеревозки_Отправление;
				
				Если ЗначениеЗаполнено(Ответ.Сумма20) Тогда
					ПостояннаяПрибавкаКФрахту20 = Ответ.Сумма20;
					Валюта20 = Ответ.Валюта;
				КонецЕсли;
				Если ЗначениеЗаполнено(Ответ.Сумма40) Тогда
					ПостояннаяПрибавкаКФрахту40 = Ответ.Сумма40;
					Валюта40 = Ответ.Валюта;
				КонецЕсли;
				
				ГруппаСоответствияКалькуляциям.Вставить(Ответ.Ссылка, Новый Структура("ПостоянныйПунктОтправления,ПостоянныйФорматПогрузки,ПостояннаяПрибавкаКФрахту20,Валюта20,ПостояннаяПрибавкаКФрахту40,Валюта40",ПостоянныйПунктОтправления,ПостоянныйФорматПогрузки,ПостояннаяПрибавкаКФрахту20,Валюта20,ПостояннаяПрибавкаКФрахту40,Валюта40));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// дополнение фрахтом	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПортыОтправленияНазначения.Порт КАК Порт,
	//|	ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	//|	ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	//|	ПортыОтправленияНазначения.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_ПортыОтправленияНазначения
	//|ИЗ
	//|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК ПортыОтправленияНазначения
	//|ГДЕ
	//|	ПортыОтправленияНазначения.Ссылка В(&Ссылка)
	//|
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, начало
	"ВЫБРАТЬ
	|	ПортыОтправленияНазначения.Порт КАК Порт,
	|	ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	|	ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	|	ПортыОтправленияНазначения.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА ПортыОтправленияНазначения.Ссылка.ФрахтИмпорт 
	|				ТОГДА ""ПортНазначения""
	|			ИНАЧЕ ""ПортОтправления""
	|	КОНЕЦ КАК ТипПорта
	|ПОМЕСТИТЬ ВТ_ПортыОтправленияНазначения
	|ИЗ
	|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения КАК ПортыОтправленияНазначения
	|ГДЕ
	|	ПортыОтправленияНазначения.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НФ_ПортыОтправленияНазначения.Порт КАК Порт,
	|	НФ_ПортыОтправленияНазначения.Порт.Наименование КАК Наименование,
	|	НФ_ПортыОтправленияНазначения.Порт.НаименованиеАнгл КАК НаименованиеАнгл,
	|	НФ_ПортыОтправленияНазначения.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА НФ_ПортыОтправленияНазначения.Ссылка.ФрахтИмпорт 
	|				ТОГДА ""ПортОтправления""
	|			ИНАЧЕ ""ПортНазначения""
	|	КОНЕЦ КАК ТипПорта
	|ИЗ
	|	Документ.Калькуляция.НФ_ПортыОтправленияНазначения КАК НФ_ПортыОтправленияНазначения
	|ГДЕ
	|	НФ_ПортыОтправленияНазначения.Ссылка В(&Ссылка)
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, конец
	|;
	|
	|ВЫБРАТЬ
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК Ссылка,
	|	КалькуляцияНФ_ВыбранныеСтавки.НомерСтроки КАК НомерСтроки,
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент КАК Контрагент,
	|	КалькуляцияНФ_ВыбранныеСтавки.Статья КАК Статья,
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт20 КАК Ставка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20 КАК Вознаграждение,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Погрузка КАК Погрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Выгрузка КАК Выгрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП КАК ВидПС,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ЖД_ПринадлежностьПС КАК ПринадлежностьПС,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ПС_ВидПеревозки КАК ВидПеревозки,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТерриторияМаршрута КАК ТерриторияМаршрута,
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Порт
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ММ_ПортОтправления
	|	КОНЕЦ КАК ПортОтправления,
	|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC КАК SOCCOC,
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ММ_ПортОтправления
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Порт
	|	КОНЕЦ КАК ПортНазначения,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт КАК ФрахтИмпорт,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
	|	""20 DC"" КАК РазмерКТК,
	|	""Контейнеры 20ф"" КАК Груз
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	,КалькуляцияНФ_ВыбранныеСтавки.Ссылка.НДСФрахт КАК СтавкаНДСФрахт
	|	,КалькуляцияНФ_ВыбранныеСтавки.Ссылка.СуммаВключаетНДСФрахт КАК СуммаВключаетНДСФрахт
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|ГДЕ
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка В(&Ссылка)
	|	И (КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК = ""20""
	|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК = ""2040"")
	|	И КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка,
	|	КалькуляцияНФ_ВыбранныеСтавки.НомерСтроки,
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент,
	|	КалькуляцияНФ_ВыбранныеСтавки.Статья,
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Погрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Выгрузка,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ЖД_ПринадлежностьПС,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ПС_ВидПеревозки,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТерриторияМаршрута,
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Порт
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ММ_ПортОтправления
	|	КОНЕЦ,
	|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC,
	|	ВЫБОР
	|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ММ_ПортОтправления
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Порт
	|	КОНЕЦ,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ФрахтИмпорт,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК,
	|	""40 HC"",
	|	""Контейнеры 40ф""
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	,КалькуляцияНФ_ВыбранныеСтавки.Ссылка.НДСФрахт КАК СтавкаНДСФрахт
	|	,КалькуляцияНФ_ВыбранныеСтавки.Ссылка.СуммаВключаетНДСФрахт КАК СуммаВключаетНДСФрахт
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|ИЗ
	|	Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|ГДЕ
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка В(&Ссылка)
	|	И (КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК = ""40""
	|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Ссылка.ТарифицируемыйРазмерКТК = ""2040"")
	|	И КалькуляцияНФ_ВыбранныеСтавки.Выбрано40
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ УслугаКалькуляции
	//|ИЗ
	//|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|ГДЕ
	//|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Ссылка)
	//|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ДокументКалькуляция.Ссылка КАК Ссылка,
	|	ВЫБОР 
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|			ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|		ИНАЧЕ 
	|			ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК ВыставляемаяУслуга
	|ПОМЕСТИТЬ УслугаКалькуляции
	|ИЗ Документ.Калькуляция КАК ДокументКалькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ДокументКалькуляция.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1
	|
	|ГДЕ ДокументКалькуляция.Ссылка В(&Ссылка)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Контрагент КАК Контрагент,
	|	ВТ.Статья КАК Статья,
	|	ЕСТЬNULL(ВТ.Ставка, 0) КАК Ставка,
	|	ВТ.Вознаграждение КАК Вознаграждение,
	|	ВТ.Итого КАК Итого,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.Погрузка КАК Погрузка,
	|	ВТ.Выгрузка КАК Выгрузка,   
	|	ВТ.ПортОтправления КАК ПортОтправления,
	|	ВТ.SOCCOC КАК SOCCOC,
	|	ВТ.ПортНазначения КАК ПортНазначения,
	|	ВТ.ФрахтИмпорт КАК ФрахтИмпорт,
	|	ВТ.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
	|	ВТ.РазмерКТК КАК РазмерКТК,
	//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 ((
	|	ВТ.Выгрузка КАК УсловияПеревозки_Прибытие, 						
	|	ВТ.ПортОтправления.Наименование КАК ПунктОтправленияRUS,
	|	ВТ.ПортОтправления.Наименование КАК ПортПогрузкиRUS,    
	|	ВТ.ПортОтправления.НаименованиеАнгл КАК ПунктОтправленияENG,
	|	ВТ.ПортОтправления.НаименованиеАнгл КАК ПортПогрузкиENG,   	
	|	ВТ.ПортНазначения.Наименование КАК ПунктДоставкиRUS,        
	|	ВТ.ПортНазначения.НаименованиеАнгл КАК ПунктДоставкиENG,    
	|	ВТ.РазмерКТК КАК ТипКТК,
	//|	&СтавкаНДС КАК СтавкаНДС,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	ВТ.СтавкаНДСФрахт КАК СтавкаНДС,
	|	ВТ.СуммаВключаетНДСФрахт КАК СуммаВключаетНДСФрахт,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 ))
	|	УслугаКалькуляции.ВыставляемаяУслуга.НаименованиеПолное КАК ВыставляемаяУслуга,
	|	УслугаКалькуляции.ВыставляемаяУслуга.НаименованиеПолноеАнгл КАК УслугаАнгл,
	|	ВТ.ВидПС КАК ВидПС,
	|	ВТ.ПринадлежностьПС КАК ПринадлежностьПС,
	|	ВТ.ВидПеревозки КАК ВидПеревозки,
	|	ВТ.ТерриторияМаршрута КАК ТерриторияМаршрута,
	|	ВТ.Груз КАК Груз
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугаКалькуляции КАК УслугаКалькуляции
	|		ПО ВТ.Ссылка = УслугаКалькуляции.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция")); 
	//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 ((
	Запрос.УстановитьПараметр("СтавкаНДС", Объект.СтавкаНДС);
	ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	ЭлементНоменклатурыФрахт = Справочники.Номенклатура.НайтиПоНаименованию("Фрахт");
	//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 ))
	
	// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ПортыОтправленияНазначения = МассивРезультатов[0].Выгрузить();

	ТЗ = МассивРезультатов[3].Выгрузить();
	//ТЗ = Запрос.Выполнить().Выгрузить();
	// Евросиб Рыбьяков К.А. 18.09.2024 ))
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, начало
	ПортыОтправления = ПортыОтправленияНазначения.Скопировать(Новый Структура("ТипПорта", "ПортОтправления"));
	ПортыНазначения = ПортыОтправленияНазначения.Скопировать(Новый Структура("ТипПорта", "ПортНазначения"));
	
	Для Каждого Стр ИЗ ТЗ Цикл
		Стр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Стр.Ссылка, ПортыНазначения, Ложь);
		Стр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Стр.Ссылка, ПортыНазначения, Истина);
		Стр.ПунктОтправленияRUS = СформироватьОписаниеЛокаций(Стр.Ссылка, ПортыОтправления, Ложь);
		Стр.ПунктОтправленияENG = СформироватьОписаниеЛокаций(Стр.Ссылка, ПортыОтправления, Истина);
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, конец
		
	Если Объект.ГруппироватьПортыПоФутовостиСтавке Тогда
		//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 (
		//было
		//ТЗ.Свернуть("ПортОтправления,ПортНазначения,РазмерКТК,Валюта,Ставка,Итого,ВыставляемаяУслуга,Погрузка,Выгрузка");
		//стало
		//ТЗ.Свернуть("ПунктОтправленияRUS, ПортПогрузкиRUS, ПунктОтправленияENG, ПортПогрузкиENG, ПунктДоставкиRUS, ПунктДоставкиENG, ТипКТК, Валюта, Ставка, Итого, ВыставляемаяУслуга, Погрузка, УсловияПеревозки_Прибытие");
		//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 (
		//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
		ТЗ.Свернуть("ПунктОтправленияRUS, ПортПогрузкиRUS, ПунктОтправленияENG, ПортПогрузкиENG, ПунктДоставкиRUS, ПунктДоставкиENG, ТипКТК, Валюта, Ставка, Итого, ВыставляемаяУслуга, Погрузка, УсловияПеревозки_Прибытие, СтавкаНДС, СуммаВключаетНДСФрахт");
		//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	КонецЕсли;
	
	Для Каждого Стр ИЗ ТЗ Цикл
		
		НСтр = Объект.ТЧ_МорскаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр); 
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, начало (закомментировал код, перенес выше) 
		//// Евросиб US 87896 TA 90558 Рыбьяков К.А. 18.09.2024 ((
		//НСтр.ПунктДоставкиRUS = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Ложь);
		//НСтр.ПунктДоставкиENG = СформироватьОписаниеЛокаций(Ответ.Ссылка, ПортыОтправленияНазначения, Истина);
		//// Евросиб Рыбьяков К.А. 16.09.2024 ))
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, конец
		
		//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 (( 
		//было
		//НСтр.ПунктОтправленияRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйФорматПогрузки + " " + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйПунктОтправления, Стр.ПортОтправления.Наименование);
		//НСтр.ПортПогрузкиRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйПунктОтправления, Стр.ПортОтправления.Наименование);
		//НСтр.ПунктДоставкиRUS = Стр.ПортНазначения.Наименование;
		//НСтр.ПунктОтправленияENG = Стр.ПортОтправления.НаименованиеАнгл;
		//НСтр.ПортПогрузкиENG = Стр.ПортОтправления.НаименованиеАнгл;
		//НСтр.ПунктДоставкиENG = Стр.ПортНазначения.НаименованиеАнгл;
		//НСтр.ТипКТК = Стр.РазмерКТК;
		//
		//НСтр.Валюта = Стр.Валюта;
		//НСтр.УсловияПеревозки_Отправление = ?(Объект.ЗаполнятьФрахтИСушуСводно, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйФорматПогрузки, Стр.Погрузка);
		//НСтр.УсловияПеревозки_Прибытие = Стр.Выгрузка;
		////ДанныеПоКурсу = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Ответ.Валюта,Объект.Дата);
		////ТекКурс = ДанныеПоКурсу.Курс;
		//НСтр.СуммаСНДС = Стр.Итого + ?(Стр.РазмерКТК = Справочники.РазмерыКТК.К20, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту20, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту40);
		//
		//НСтр.СтавкаНДС = Объект.СтавкаНДС;
		//
		//ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС);		
		//НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СуммаСНДС, ПроцентСтавкиНДС, Истина, Истина);
		//НСтр.СуммаБезНДС = НСтр.СуммаСНДС - НСтр.СуммаНДС;
		//
		//НСтр.Услуга = "" + Стр.ВыставляемаяУслуга + ?(Стр.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ПоконтейнернаяОтправка, " (групповая отправка)", "");
		//
		//стало
		//Если ГруппаСоответствияКалькуляциям[Стр.Ссылка] <> Неопределено Тогда
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, начало
		Если НЕ Объект.ГруппироватьПортыПоФутовостиСтавке И ГруппаСоответствияКалькуляциям[Стр.Ссылка] <> Неопределено Тогда
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0379387, 12-12-2024, конец
			НСтр.ПунктОтправленияRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйФорматПогрузки + " " + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйПунктОтправления, Стр.ПунктОтправленияRUS);
			НСтр.ПортПогрузкиRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйПунктОтправления, Стр.ПортПогрузкиRUS);
			НСтр.УсловияПеревозки_Отправление = ?(Объект.ЗаполнятьФрахтИСушуСводно, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостоянныйФорматПогрузки, Стр.Погрузка);
			//Трундуков СА 113916 08.07.2025
			//Было:
			//НСтр.СуммаСНДС = Стр.Итого + ?(Стр.ТипКТК = Справочники.РазмерыКТК.К20, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту20, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту40);
			НСтр.СуммаСНДС = Стр.Итого + ?(СтрНайти(Стр.ТипКТК,"20") <> 0, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту20, ГруппаСоответствияКалькуляциям[Стр.Ссылка].ПостояннаяПрибавкаКФрахту40);
			//Трундуков Конец
			НСтр.Услуга = "" + Стр.ВыставляемаяУслуга + ?(Стр.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ПоконтейнернаяОтправка, " (групповая отправка)", "");
		Иначе
			НСтр.ПунктОтправленияRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ПостоянныйФорматПогрузки + " " + ПостоянныйПунктОтправления, Стр.ПунктОтправленияRUS);
			НСтр.ПортПогрузкиRUS = ?(Объект.ЗаполнятьФрахтИСушуСводно, "" + ПостоянныйПунктОтправления, Стр.ПортПогрузкиRUS);
			НСтр.УсловияПеревозки_Отправление = ?(Объект.ЗаполнятьФрахтИСушуСводно, ПостоянныйФорматПогрузки, Стр.Погрузка);
			//Трундуков СА 113916 08.07.2025
			//Было:
			//НСтр.СуммаСНДС = Стр.Итого + ?(Стр.ТипКТК = Справочники.РазмерыКТК.К20, ПостояннаяПрибавкаКФрахту20, ПостояннаяПрибавкаКФрахту40);
			НСтр.СуммаСНДС = Стр.Итого + ?(СтрНайти(Стр.ТипКТК,"20") <> 0, ПостояннаяПрибавкаКФрахту20, ПостояннаяПрибавкаКФрахту40);
			//Трундуков Конец
			// так как при отсутсутствии в калькуляции в п.1.3 данных основная услуга может быть только Фрахт, то...
			НСтр.Услуга = ЭлементНоменклатурыФрахт.НаименованиеПолное;
			НСтр.УслугаАнгл = ЭлементНоменклатурыФрахт.НаименованиеПолноеАнгл;
		КонецЕсли;
		//НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СуммаСНДС, ПроцентСтавкиНДС, Истина, Истина);
		//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
		ПроцентСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
		НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СуммаСНДС, ПроцентСтавкиНДС, Истина, Стр.СуммаВключаетНДСФрахт);
		//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
		//НСтр.СуммаБезНДС = НСтр.СуммаСНДС - НСтр.СуммаНДС;
		//Евросиб Коханенко Н.А. Ticket#0296049 #63827,63828 19.01.2023 ))
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0387212, 19-02-2025, начало
		Если Стр.СуммаВключаетНДСФрахт Тогда
			НСтр.СуммаБезНДС = НСтр.СуммаСНДС - НСтр.СуммаНДС;
		Иначе
			НСтр.СуммаБезНДС = НСтр.СуммаСНДС;
			НСтр.СуммаСНДС = НСтр.СуммаСНДС + НСтр.СуммаНДС;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0387212, 19-02-2025, конец
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОписаниеЛокацийРУС(МассивЛокаций)
	
	МассивРусНаименований = Новый Массив;
	Для каждого Стр из МассивЛокаций Цикл
		МассивРусНаименований.Добавить(Стр.Наименование);
	КонецЦикла;
	
	ВОзврат СтрСоединить(МассивРусНаименований, "; ");
	
КонецФункции

Функция СформироватьОписаниеЛокацийАНГЛ(МассивЛокаций)
	
	МассивАнглНаименований = Новый Массив;
	Для каждого Стр из МассивЛокаций Цикл
		МассивАнглНаименований.Добавить(Стр.НаименованиеАнгл);
	КонецЦикла;
	
	ВОзврат СтрСоединить(МассивАнглНаименований, "; ");
	
КонецФункции

Процедура СравнитьКалькуляции(Объект) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПСЦКалькуляции.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ втКалькуляцииСсылки
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Ссылка = &ПСЦ
	|	И ПСЦКалькуляции.Калькуляция <> ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцииОбъекта.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ втКалькуляцииОбъекта
	|ИЗ
	|	&КалькуляцииОбъекта КАК КалькуляцииОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКалькуляцииОбъекта.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ втЗаполненныеКалькуляцииОбъекта
	|ИЗ
	|	втКалькуляцииОбъекта КАК втКалькуляцииОбъекта
	|ГДЕ
	|	втКалькуляцииОбъекта.Калькуляция <> ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКалькуляцииСсылки.Калькуляция КАК Калькуляция
	|ИЗ
	|	втКалькуляцииСсылки КАК втКалькуляцииСсылки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втЗаполненныеКалькуляцииОбъекта КАК втЗаполненныеКалькуляцииОбъекта
	|		ПО втКалькуляцииСсылки.Калькуляция = втЗаполненныеКалькуляцииОбъекта.Калькуляция
	|ГДЕ
	|	(втЗаполненныеКалькуляцииОбъекта.Калькуляция ЕСТЬ NULL
	|			ИЛИ втКалькуляцииСсылки.Калькуляция ЕСТЬ NULL)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПСЦ", Объект.Ссылка);
	Запрос.УстановитьПараметр("КалькуляцииОбъекта", Объект.Калькуляции.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		// Калькуляции отличаются, обновим данные для печатим
		ЗаполнитьДанныеДляПечати(Объект);
	КонецЕсли;
	
КонецПроцедуры	
// Евросиб Фролов)

//ДИТ Кузнецов Е.Е. Ticket#0282110 21.10.2022
Процедура ВывестиЗаголовокПунктаПСЦ(ТабличныйДокумент, ОбластьПроверки, ОбластьПодвал, НомерСтроки, ВсегоПунктов)
	
	//Проверяем последний пункт, если он помещается вместе с подвалом, то выводим его, иначе выводим разделитель
	Если НомерСтроки = ВсегоПунктов Тогда 
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьПроверки);
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
		РезультатПроверкиВывода = ПечатьБухгалтерскихДокументов.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСПодвалом);
		
		Если Не РезультатПроверкиВывода Тогда 
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПроверки);	
	
КонецПроцедуры

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023
Функция ПрикрепитьПротоколДляСубсидий(Док, ФорматПротокола) Экспорт

	СтруктураВозврата = Новый Структура("Результат, СообщениеПользователю, ПФ");   
	Результат = Новый ТабличныйДокумент;  
	Результат.АвтоМасштаб = Истина;
	
	Если не ЗначениеЗаполнено(Док) Тогда  
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.СообщениеПользователю = "Не определен ПСЦ прикрепления для печатной формы";
	    Возврат СтруктураВозврата;
	КонецЕсли;
	
	ЗаполнятьАнглийскиеНаименования = Ложь;
	Если ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколСубсидииОдноязычный", Док.Контрагент, Док.Договор);
	Иначе	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_ПротоколСубсидииДвуязычный", Док.Контрагент, Док.Договор);
		ЗаполнятьАнглийскиеНаименования = Истина;
	КонецЕсли;	   
	
	ЗаполнениеПоУмолчанию = "________________";
	ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");  
	ОбластьПункт1 			= Макет.ПолучитьОбласть("ОбластьПункт1"); 
	ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы");   
	ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы"); 
    ОбластьПункт2 			= Макет.ПолучитьОбласть("ОбластьПункт2");
	ОбластьПункт3 			= Макет.ПолучитьОбласть("ОбластьПункт3");   
	ОбластьПодписи 			= Макет.ПолучитьОбласть("ОбластьПодписи"); 
	
	//Евросиб Коханенко Н.А. 15.11.2024 (( #95589 
	//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента);
	//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика);
	//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, начало
	РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, Док.РуководительКонтрагента,, Док.ПСЦПоставщика, ТипЗнч(Док));
	//Евросиб(ДИТ), Беляев СЮ, BUG 110167 / TA 110622, 29-05-2025, конец
	//Евросиб Коханенко Н.А. 15.11.2024 )) #95589 
	Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		НашРуководитель = Новый Структура("Ссылка, ФИОРус, ФИОРПРус, ДолжностьРус, ДолжностьРП, Основание, ОснованиеРус, ФИОАнгл, ДолжностьАнгл, ОснованиеАнгл");
		СтруктураПодписанта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док.ДоверенностьЗаРуководителя, 
		"ФИОПодписанта, ФИОПодписантаДляПротокола, Должность, ДолжностьАнгл, ДолжностьРодительныйПадеж, ОснованиеДляПодписания, ОснованиеДляПодписанияРП, ОснованиеДляПодписанияАнгл, ФизЛицо");
		НашРуководитель.ФИОРус 			= СтруктураПодписанта.ФИОПодписанта;  
		НашРуководитель.ФИОАнгл 		= ?(ЗначениеЗаполнено(СтруктураПодписанта.ФизЛицо), 
											ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПодписанта.ФизЛицо, "ФамилияИнициалыАнгл"), "");
		НашРуководитель.ФИОРПРус 		= СтруктураПодписанта.ФИОПодписантаДляПротокола;
		НашРуководитель.ДолжностьРус 	= СтруктураПодписанта.Должность;
		НашРуководитель.ДолжностьАнгл 	= СтруктураПодписанта.ДолжностьАнгл;
		НашРуководитель.ДолжностьРП 	= СтруктураПодписанта.ДолжностьРодительныйПадеж;
		НашРуководитель.ОснованиеРус 	= СтруктураПодписанта.ОснованиеДляПодписанияРП;   
		НашРуководитель.Основание	 	= СтруктураПодписанта.ОснованиеДляПодписания;
		НашРуководитель.ОснованиеАнгл 	= СтруктураПодписанта.ОснованиеДляПодписанияАнгл;
	Иначе	
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
	КонецЕсли;
	
	///////////////////// ШАПКА /////////////////////
	ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ='''«''d''»'' MMMM yyyy ""г.""'");   
	
	ОбластьШапка.Параметры.ГородПодписания = Док.ГородПодписания.Наименование;
	ОбластьШапка.Параметры.НомерПСЦ = Док.НомерПСЦ;
	ОбластьШапка.Параметры.ДатаПСЦ = Формат(Док.ДатаПСЦ, "ДФ='''«''d''»'' MMMM yyyy ""г.""'");  
	
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьШапка.Параметры.ДатаПСЦАнгл = Формат(Док.ДатаПСЦ, "Л=en_GB; ДФ='d MMMM yyyy'");
		ОбластьШапка.Параметры.ДатаДоговораАнгл = Формат(Док.Договор.Дата, "Л=en_GB; ДФ='d MMMM yyyy'"); 
	КонецЕсли;
	
	НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
	ОбластьШапка.Параметры.ОрганизацияПолноеРус = НаименованияНаДату.НаименованиеПолное;
	ОбластьШапка.Параметры.ДолжностьОргРус = НашРуководитель.ДолжностьРП; 
	ОбластьШапка.Параметры.ФИООргРус = НашРуководитель.ФИОРПРус; 
	ОбластьШапка.Параметры.ОснованиеРус = НашРуководитель.ОснованиеРус; 
	ОбластьШапка.Параметры.КлиентПолноеРус = Док.Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.КлиентДолжностьРус = РуководительКонтрагента.ДолжностьРП;
	ОбластьШапка.Параметры.КлиентФИОРус = РуководительКонтрагента.ФИОРПРус ;
	
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьШапка.Параметры.ГородПодписанияАнгл = Док.ГородПодписания.НаименованиеАнгл;
		
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		ОбластьШапка.Параметры.ОрганизацияПолноеЕнг  = НаименованияНаДату.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.ДолжностьОргЕнг = НашРуководитель.ДолжностьАнгл; 
		ОбластьШапка.Параметры.ФИООргЕнг = НашРуководитель.ФИОАнгл; 
		ОбластьШапка.Параметры.ОснованиеЕнг = НашРуководитель.ОснованиеАнгл; 
		ОбластьШапка.Параметры.КлиентПолноеЕнг = Док.Контрагент.НаименованиеПолноеАнгл;
		ОбластьШапка.Параметры.КлиентДолжностьЕнг = РуководительКонтрагента.ДолжностьАнгл;
		ОбластьШапка.Параметры.КлиентФИОЕнг = РуководительКонтрагента.ФИОАнгл;   
		
		Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеАнгл) Тогда
			ОбластьШапка.Параметры.КлиентДолжностьЕнг = "" + РуководительКонтрагента.ДолжностьАнгл + " " + РуководительКонтрагента.ОснованиеАнгл;
		КонецЕсли; 
	КонецЕсли;
		
	Результат.Вывести(ОбластьШапка);
	
	///////////////////// ПУНКТ 1 /////////////////////
	Результат.Вывести(ОбластьПункт1);  
	
	///////////////////// ТАБЛИЦА /////////////////////  
	ОбластьШапкаТаблицы.Параметры.Валюта = Док.Валюта;
	Результат.Вывести(ОбластьШапкаТаблицы); 
	
	СтанцияОтправления 		= ЗаполнениеПоУмолчанию;
	СтанцияОтправленияАнг 	= ЗаполнениеПоУмолчанию;
	СтанцияНазначения 		= ЗаполнениеПоУмолчанию;   
	СтанцияНазначенияАнг 	= ЗаполнениеПоУмолчанию;
	
	Если Док.ТЧ.Количество() > 0 Тогда
		СтанцияОтправления = Док.ТЧ[0].ПунктОтправленияRUS; 
		СтанцияНазначения = Док.ТЧ[0].ПунктДоставкиRUS;
		Если ЗаполнятьАнглийскиеНаименования Тогда
			СтанцияОтправленияАнг = Док.ТЧ[0].ПунктОтправленияENG;
			СтанцияНазначенияАнг = Док.ТЧ[0].ПунктДоставкиENG;
		КонецЕсли;  
		Если ЗначениеЗаполнено(Док.ТЧ[0].УсловияПеревозки_Отправление) и ЗначениеЗаполнено(Док.ТЧ[0].УсловияПеревозки_Прибытие) Тогда
			ОбластьСтрокаТаблицы.Параметры.УсловияПеревозки = Док.ТЧ[0].УсловияПеревозки_Отправление + "-" + Док.ТЧ[0].УсловияПеревозки_Прибытие; 
		КонецЕсли; 
	КонецЕсли;       
	
	ОбластьСтрокаТаблицы.Параметры.СтанцияОтправления = Строка(СтанцияОтправления) + ?(не ЗаполнятьАнглийскиеНаименования, "", "/" + СтанцияОтправленияАнг);  
	ОбластьСтрокаТаблицы.Параметры.СтанцияНазначения = Строка(СтанцияНазначения) + ?(не ЗаполнятьАнглийскиеНаименования, "", "/" + СтанцияНазначенияАнг);
	
	Результат.Вывести(ОбластьСтрокаТаблицы);
	
	///////////////////// ПУНКТ 2 ///////////////////// 
	ОбластьПункт2.Параметры.СтанцияОтправления = СтанцияОтправления;  
	ОбластьПункт2.Параметры.СтанцияНазначения = СтанцияНазначения;  
	ОбластьПункт2.Параметры.Валюта = Док.Валюта;
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьПункт2.Параметры.СтанцияОтправленияАнг = СтанцияОтправленияАнг;  
		ОбластьПункт2.Параметры.СтанцияНазначенияАнг = СтанцияНазначенияАнг;
	КонецЕсли;

	Результат.Вывести(ОбластьПункт2);  
	
	///////////////////// ПУНКТ 3 /////////////////////    
	ОбластьПункт3.Параметры.Валюта = Док.Валюта;
	ОбластьПункт3.Параметры.СтанцияОтправления = СтанцияОтправления;  
	//ОбластьПункт3.Параметры.СтанцияНазначения = СтанцияНазначения;  
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьПункт3.Параметры.СтанцияОтправленияАнг = СтанцияОтправленияАнг;  
		//ОбластьПункт3.Параметры.СтанцияНазначенияАнг = СтанцияНазначенияАнг;
	КонецЕсли;
	
	ОбластьПункт3.Параметры.НомерДоговора = Док.Договор.Номер;
	ОбластьПункт3.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ='d MMMM yyyy'"); 
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьПункт3.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "Л=en_GB; ДФ='d MMMM yyyy'");
	КонецЕсли;
	
	Результат.Вывести(ОбластьПункт3);
	
	///////////////////// ПОДПИСИ ///////////////////// 
	НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
	
	ОбластьПодписи.Параметры.ОрганизацияПолноеРус 	= НаименованияНаДату.НаименованиеПолное; 
	ОбластьПодписи.Параметры.ДолжностьОргРус		= НашРуководитель.ДолжностьРус; 
	ОбластьПодписи.Параметры.ФИООргРус    			= НашРуководитель.ФИОРус; 
	ОбластьПодписи.Параметры.КлиентПолноеРус		= Док.Контрагент.НаименованиеПолное;
	ОбластьПодписи.Параметры.КлиентДолжностьРус		= РуководительКонтрагента.ДолжностьРус;
	ОбластьПодписи.Параметры.КлиентФИОРус   		= РуководительКонтрагента.ФИОРус;
	
	Если ЗаполнятьАнглийскиеНаименования Тогда
		ОбластьПодписи.Параметры.ОрганизацияПолноеЕнг 	= НаименованияНаДату.НаименованиеПолноеАнгл;
		ОбластьПодписи.Параметры.ДолжностьОргЕнг		= НашРуководитель.ДолжностьАнгл; 
		ОбластьПодписи.Параметры.ФИООргЕнг    			= НашРуководитель.ФИОАнгл; 
		ОбластьПодписи.Параметры.КлиентПолноеЕнг		= Док.Контрагент.НаименованиеПолноеАнгл;
		ОбластьПодписи.Параметры.КлиентДолжностьЕнг		= РуководительКонтрагента.ДолжностьАнгл;
		ОбластьПодписи.Параметры.КлиентФИОЕнг   		= РуководительКонтрагента.ФИОАнгл;	
	КонецЕсли;                 
	
	Результат.Вывести(ОбластьПодписи);    
	
	///////////////////// ПРИКРЕПЛЕНИЕ ВЛОЖЕННОГО ФАЙЛА /////////////////////
	СтруктураВозврата.ПФ = Результат;   
	
	Если ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
		ИмяФайлаПФ = "Протокол субсидии №" + СтрЗаменить(Док.НомерПСЦ, "/", "-") + " (одноязычный)"; 
	Иначе
		ИмяФайлаПФ = "Протокол субсидии №" + СтрЗаменить(Док.НомерПСЦ, "/", "-") + " (двуязычный)";
	КонецЕсли;
	ИмяФайла = КаталогВременныхФайлов() + ИмяФайлаПФ + ".DOCX";

	Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.DOCX); 
	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайлСДиска(Док.Ссылка, ИмяФайла);  
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаПФ + ".DOCX");
	Исключение
	КонецПопытки;

	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;

КонецФункции 

// Рыбьяков К.А 13.05.2024 US 81613 Начало 
Процедура ОбновитьРегистрОтработанныхДокументов(Ссылка, ДатаОтработкиДокумента, Исполнитель)
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата, Организация, Номер, Контрагент, Проведен, ПометкаУдаления");
	
	МенеджерЗаписи = РегистрыСведений.ОтработанныеДокументыБухгалтерией.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Ссылка;
	МенеджерЗаписи.Организация = РеквизитыПСЦ.Организация; 
	МенеджерЗаписи.НомерДокумента = РеквизитыПСЦ.Номер;
	МенеджерЗаписи.ДатаУчетаДокумента = ДатаОтработкиДокумента; 
	МенеджерЗаписи.Контрагент = РеквизитыПСЦ.Контрагент;	
	МенеджерЗаписи.ДатаДокумента = РеквизитыПСЦ.Дата;
	МенеджерЗаписи.Ответственный = Исполнитель;
	МенеджерЗаписи.Проведен = РеквизитыПСЦ.Проведен;
	Если Ссылка.ПометкаУдаления Тогда
		МенеджерЗаписи.ДатаУдаленияДокумента = ТекущаяДата();
	ИначеЕсли Не Ссылка.ПометкаУдаления И МенеджерЗаписи.ДатаУдаленияДокумента <> Дата('00010101') Тогда
		МенеджерЗаписи.ДатаУдаленияДокумента = Дата('00010101');	
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОтработкаДокументаБухгалтерией(Ссылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТГруппы
	|ИЗ
	|	Справочник.ГруппыПользователей КАК ГруппыПользователей
	|ГДЕ
	|	ГруппыПользователей.Родитель В ИЕРАРХИИ(&Группа)
	|	Или ГруппыПользователей.Ссылка = &Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_ПользователиБух
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТГруппы.Ссылка
	|			ИЗ
	|				ВТГруппы КАК ВТГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПСЦСостояния.ЗавершениеРаботы) КАК ДатаЗавершенияРаботы,
	|	ПСЦСостояния.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.ПСЦ.Состояния КАК ПСЦСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтработанныеДокументыБухгалтерией КАК ОтработанныеДокументыБухгалтерией
	|		ПО ПСЦСостояния.Ссылка = ОтработанныеДокументыБухгалтерией.Документ
	|ГДЕ
	|	ПСЦСостояния.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Выполнен)
	|	И ПСЦСостояния.Исполнитель В
	|			(ВЫБРАТЬ
	|				ВТ_ПользователиБух.Пользователь
	|			ИЗ
	|				ВТ_ПользователиБух КАК ВТ_ПользователиБух)
	|	И ПСЦСостояния.Ссылка = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПСЦСостояния.Ссылка,
	|	ПСЦСостояния.Исполнитель";

	// Бухгалтерия (Справочник.ГруппыПользователей)
	ГруппаБухгалтерия = Справочники.ГруппыПользователей.ПолучитьСсылку(Новый УникальныйИдентификатор("8c364532-cfdf-11ea-b819-00155dfba800"));
	
	Запрос.УстановитьПараметр("Группа", ГруппаБухгалтерия);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбновитьРегистрОтработанныхДокументов(Ссылка, Выборка.ДатаЗавершенияРаботы, Выборка.Исполнитель);
		КонецЦикла;	
	Иначе
		ПроверитьЗаписьВРегистре(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаписьВРегистре(Ссылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтработанныеДокументыБухгалтерией.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ОтработанныеДокументыБухгалтерией КАК ОтработанныеДокументыБухгалтерией
	|ГДЕ
	|	ОтработанныеДокументыБухгалтерией.Документ = &Документ";

	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда	
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ОтработанныеДокументыБухгалтерией.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Документ = Ссылка;
			МенеджерЗаписи.Прочитать();
			РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Проведен, ПометкаУдаления");
			МенеджерЗаписи.Проведен = РеквизитыПСЦ.Проведен;
			Если Ссылка.ПометкаУдаления Тогда
				МенеджерЗаписи.ДатаУдаленияДокумента = ТекущаяДата();
			ИначеЕсли Не Ссылка.ПометкаУдаления И МенеджерЗаписи.ДатаУдаленияДокумента <> Дата('00010101') Тогда
				МенеджерЗаписи.ДатаУдаленияДокумента = Дата('00010101');	
			КонецЕсли;
			МенеджерЗаписи.Записать();	
		КонецЦикла;				
	КонецЕсли;	
	
КонецПроцедуры
// Рыбьяков К.А 14.05.2024 US 81613 конец

// Евросиб US 87896 TA 90558 Рыбьяков К.А. 17.09.2024 ((
Функция СформироватьОписаниеЛокаций(КалькуляцияСсылка, Список, Англ)
	
	МассивНаименований = Новый Массив;
	Для Каждого Строка Из Список Цикл
		Если Строка.Ссылка = КалькуляцияСсылка Тогда
			Если Англ Тогда
				Если Строка.НаименованиеАнгл <> "" Тогда
					МассивНаименований.Добавить(Строка.НаименованиеАнгл);
				КонецЕсли;
			Иначе
				Если Строка.Наименование <> "" Тогда
					МассивНаименований.Добавить(Строка.Наименование);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(МассивНаименований, "; ");
	
КонецФункции
// Евросиб Рыбьяков К.А. 17.09.2024 ))    

// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
Функция ПроверитьИзменениеКлючевыхПолейПСЦДляОбмена(ЭтотОбъект) Экспорт
		
	ИзмененияЕсть = Ложь;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Возврат ИзмененияЕсть;
	КонецЕсли;
			
	//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
	//РеквизытыДо = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "ДатаПСЦ, Договор, НачалоДействия, ОкончаниеДействия, НомерПСЦ, СтавкаНДС, СтатусДокумента");
	РеквизытыДо = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "ДатаПСЦ, Договор, НачалоДействия, ОкончаниеДействия, НомерПСЦ, СтавкаНДС, СтатусДокумента, ПометкаУдаления");
	//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
	
	Если РеквизытыДо.СтатусДокумента <> ЭтотОбъект.СтатусДокумента
			И (ЭтотОбъект.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний 
			ИЛИ ЭтотОбъект.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями
			ИЛИ ЭтотОбъект.СтатусДокумента = Перечисления.СтатусыСогласования.Подписано) Тогда
		ИзмененияЕсть = Истина;
	КонецЕсли;
	
	Если ЭтотОбъект.ДатаПСЦ <> РеквизытыДо.ДатаПСЦ
		ИЛИ ЭтотОбъект.Договор <> РеквизытыДо.Договор
		ИЛИ ЭтотОбъект.НачалоДействия <> РеквизытыДо.НачалоДействия
		ИЛИ ЭтотОбъект.ОкончаниеДействия <> РеквизытыДо.ОкончаниеДействия
		ИЛИ ЭтотОбъект.НомерПСЦ <> РеквизытыДо.НомерПСЦ
		//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
		ИЛИ ЭтотОбъект.ПометкаУдаления <> РеквизытыДо.ПометкаУдаления
		//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
		ИЛИ ЭтотОбъект.СтавкаНДС <> РеквизытыДо.СтавкаНДС Тогда
		ИзмененияЕсть = Истина;
	КонецЕсли;
			
	Возврат ИзмененияЕсть;
	
КонецФункции
// Евросиб Рыбьяков К.А. 16.04.2025 ))

//Евросиб Каблов 17.12.2025 Ticket#0426699
Функция ПроверитьИзменениеКлючевыхПолейДляОбменаСДО(ДокОбъект) Экспорт
		
	МожноВыгружать = Ложь;
	Если ДокОбъект.Проведен И ЗначениеЗаполнено(ДокОбъект.ДатаСогласования) Тогда
		Если ДокОбъект.ПСЦПоставщика Тогда
			Если ДокОбъект.ПодписанСДвухСторон Тогда
				МожноВыгружать = Истина;
			КонецЕсли;
		Иначе
			МожноВыгружать = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзмененияЕсть = Ложь;
	
	Если МожноВыгружать Тогда
		
		СписокРеквизитовДляСравнения = "ДатаСогласования, ДатаПСЦ, НомерПСЦ, НачалоДействия, ОкончаниеДействия, ДействуетДоСогласованияНовыхУсловий, Автор, ПодписанСДвухСторон, ОтветственныйМенеджер, Контрагент, Договор, НетиповойПротокол";
		ЗначенияРеквизитовСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОбъект.Ссылка, СписокРеквизитовДляСравнения);
		ЗначенияРеквизитовОбъекта = Новый Структура(СписокРеквизитовДляСравнения);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовОбъекта, ДокОбъект);
		
		ИзмененияЕсть = Не ОбщегоНазначения.КоллекцииИдентичны(ЗначенияРеквизитовОбъекта, ЗначенияРеквизитовСсылки);
		
	КонецЕсли;
			
	Возврат ИзмененияЕсть;
	
КонецФункции

#Область Нотисы
//Евросиб Коханенко Н.А. 22.10.2024 (( #92915 
Функция НапечататьНотисВРП_Рефы_ММ(Протоколы, ДопПараметры = Неопределено, ЭтоНотисВРП_Рефы = Истина) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Протокол из Протоколы Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_Нотис", Протокол.Контрагент, Протокол.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		Если ЭтоНотисВРП_Рефы Тогда
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисВРПРефы");
			ДатаПротокола = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Протокол, "ДатаПСЦ"); 
			ДатаПротоколаСтрока = Формат(ДатаПротокола, "ДФ=dd.MM.yyyy") + "г.";
			ОбластьШапка.Параметры.ДатаПротокола = ДатаПротоколаСтрока;
		Иначе
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисММ");
		КонецЕсли;
		Результат.Вывести(ОбластьШапка);
	
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		ОбластьРазделБезОтступа = Макет.ПолучитьОбласть("РазделБезОтступа");

		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПСЦПунктыПСЦ.Ссылка КАК Ссылка,
			|	ПСЦПунктыПСЦ.НомерСтроки КАК НомерСтроки,
			|	ПСЦПунктыПСЦ.Заголовок КАК Заголовок,
			|	ПСЦПунктыПСЦ.НомерПункта КАК НомерПункта,
			|	ПСЦПунктыПСЦ.ТекстПунктаРус КАК ТекстПунктаРус,
			|	ПСЦПунктыПСЦ.ТекстПунктаАнгл КАК ТекстПунктаАнгл,
			|	ПСЦПунктыПСЦ.Отредактировано КАК Отредактировано,
			|	ПСЦПунктыПСЦ.ПроверяющийИзменениеДанногоПункта КАК ПроверяющийИзменениеДанногоПункта,
			|	ПСЦПунктыПСЦ.Предопределенный КАК Предопределенный,
			|	ПСЦПунктыПСЦ.ПередТаблицей КАК ПередТаблицей,
			|	ПСЦПунктыПСЦ.ВложенныйСписок КАК ВложенныйСписок,
			|	ПСЦПунктыПСЦ.ЭтоТаблица КАК ЭтоТаблица,
			|	ПСЦПунктыПСЦ.ЭлементПечатнойФормы КАК ЭлементПечатнойФормы,
			|	ПСЦПунктыПСЦ.Отступ КАК Отступ,
			|	ПСЦПунктыПСЦ.Макет КАК Макет
			|ИЗ
			|	Документ.ПСЦ.ПунктыПСЦ КАК ПСЦПунктыПСЦ
			|ГДЕ
			|	ПСЦПунктыПСЦ.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
	
		Запрос.УстановитьПараметр("Ссылка", Протокол);	
		
		Пункты = Запрос.Выполнить().Выгрузить();
		КоличествоПунктов = Пункты.Количество();
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		Для ИндексСтроки = 0 По КоличествоПунктов - 1 Цикл
			Пункт = Пункты[ИндексСтроки];
			Если Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда
				Если ЭтоНотисВРП_Рефы Тогда
					ВывестиТаблицуНотисВРПРефы(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//	Иначе
			//		ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
				КонецЕсли;
			ИначеЕсли (Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC)
					ИЛИ (Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC) Тогда
				ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938 
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ШапкаНотисаММ Тогда
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисММ");
				Результат.Вывести(ОбластьШапка);
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаЖД
					И НЕ ЭтоНотисВРП_Рефы Тогда
				ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);				
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаКонтактныеДанные Тогда
				ВывестиТаблицуКонтактныеДанные(Результат, Макет, Протокол);	
			Иначе
				ОбластьРаздел.Область().Отступ = Пункт.Отступ;
				ОбластьРазделБезОтступа.Область().Отступ = Пункт.Отступ;
				ТекстПункта = Документы.ПСЦ.ОтработатьШаблоны(Протокол, Пункт.ТекстПунктаРус);
				НомерПункта = СокрЛП(Пункт.НомерПункта);
				Если ЗначениеЗаполнено(НомерПункта) Тогда
					Если СтрНайти(НомерПункта, ".") = 0 Тогда
						НомерПункта = НомерПункта + ".";
					КонецЕсли;					                                      
				КонецЕсли;
				МассивСтрок = СтрРазделить(ТекстПункта,Символы.ПС);
				ПерваяСтрока = Истина;
				Для каждого Строка из МассивСтрок Цикл
					Если ПерваяСтрока Тогда							
						Строка = НомерПункта +" "+ Строка;
						ПерваяСтрока = Ложь;
						ОбластьРаздел.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					Иначе
						ОбластьРазделБезОтступа.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРазделБезОтступа, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли; 
			
			ВывестиТаблицуИзХранилища(Результат, Пункт.Макет);
						
		КонецЦикла;

		Результат.Присоединить(ОбластьПодвал);
				
	КонецЦикла;
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 22.10.2024 )) #92915

//Евросиб Коханенко Н.А. 17.10.2024 (( #92915 
Процедура ВывестиТаблицуКонтактныеДанные(ТабДок, Макет, Протокол)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦКонтактныеДанные.Должность КАК Должность,
		|	ПСЦКонтактныеДанные.Ответственный КАК Ответственный,
		|	ПользователиКонтактнаяИнформацияАдресЭП.АдресЭП КАК АдресЭП,
		|	ПользователиКонтактнаяИнформацияНомерТелефона.Представление КАК Телефон
		|ИЗ
		|	Документ.ПСЦ.КонтактныеДанные КАК ПСЦКонтактныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформацияАдресЭП
		|		ПО ПСЦКонтактныеДанные.Ответственный = ПользователиКонтактнаяИнформацияАдресЭП.Ссылка
		|			И (ПользователиКонтактнаяИнформацияАдресЭП.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформацияНомерТелефона
		|		ПО ПСЦКонтактныеДанные.Ответственный = ПользователиКонтактнаяИнформацияНомерТелефона.Ссылка
		|			И (ПользователиКонтактнаяИнформацияНомерТелефона.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (ПользователиКонтактнаяИнформацияНомерТелефона.НомерСтроки = 2)
		|ГДЕ
		|	ПСЦКонтактныеДанные.Ссылка = &ПСЦСсылка";
	
	Запрос.УстановитьПараметр("ПСЦСсылка", Протокол.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("СтрокаДолжностиКонтактныхДанных");
		ОбластьШапкаТаблицы.Параметры.Должность = Выборка.Должность;
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаКонтактныхДанных");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка);
		ТабДок.Присоединить(ОбластьШапкаТаблицы);
		ТабДок.Присоединить(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 17.10.2024 )) #92915

//Евросиб Коханенко Н.А. 21.10.2024 (( #92915 
Процедура ВывестиТаблицуНотисММ(ТабДок, Макет, Протокол, ЭлементПечатнойФормы)

	//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
	//Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда 
	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC
		ИЛИ ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC
	Тогда 
	//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938
			|	КалькуляцияДок.Ссылка.Море_УсловияIncoterms КАК Море_УсловияIncoterms, 
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			//Евросиб Коханенко Н.А. 21.05.2025 (( #110233 
			//|	Локации.Наименование КАК ПортОтгрузки,
			//|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК Трансшипмент,
			//Евросиб Коханенко Н.А. 17.06.2025 (( #111353
			//|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК ПортОтгрузки, 
			//|	Локации.Наименование КАК Трансшипмент,
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА Локации.Наименование
			|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование 
			|	КОНЕЦ КАК ПортОтгрузки,
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА """"
			|		ИНАЧЕ Локации.Наименование 
			|	КОНЕЦ КАК Трансшипмент,
			//Евросиб Коханенко Н.А. 17.06.2025 )) #111353 
			|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
			|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
			//Евросиб Коханенко Н.А. 01.04.2025 (( #105938 
			//|	Локации.ЛокацияВышестоящегоУровня.Страна КАК ЛокацияВУ,
			|	ВРЕГ(ЛокацииВУ.НаименованиеАнгл) КАК ЛокацияВУ,
			//Евросиб Коханенко Н.А. 01.04.2025 )) #105938 
			|	КалькуляцияНФ_ВыбранныеСтавки.Валюта.СокращенноеНаименование КАК ВалютаСокр
			//Евросиб Коханенко Н.А. 27.06.2025 (( #112908 
			|	ПОМЕСТИТЬ вт_ЦеныCOCSOC 
			//Евросиб Коханенко Н.А. 27.06.2025 )) #112908 
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938 
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДок
			|			ПО КалькуляцияНФ_ВыбранныеСтавки.Ссылка = КалькуляцияДок.Ссылка 			
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
			//Евросиб Коханенко Н.А. 01.04.2025 (( #105938 
			//Евросиб Коханенко Н.А. 22.05.2025 (( #110233 
			//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
			//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииВУ
			//|					ПО (ЛокацииВУ.Ссылка = ИерархияЛокаций.ЛокацияВышестоящегоУровня)
			//|				ПО (ИерархияЛокаций.Локация = Локации.Ссылка)
			//|					И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
			//Евросиб Коханенко Н.А. 22.05.2025 )) #110233 
			//Евросиб Коханенко Н.А. 01.04.2025 )) #105938 
			|			ПО КалькуляцияНФ_ВыбранныеСтавки.Порт = Локации.Ссылка
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = ""COC"")
			|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = &Принадлежность)
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614
			//Евросиб Коханенко Н.А. 17.06.2025 (( #111353
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииВУ
			|				ПО (ЛокацииВУ.Ссылка = ИерархияЛокаций.ЛокацияВышестоящегоУровня)
			|			ПО ((ИерархияЛокаций.Локация = КалькуляцияНФ_ВыбранныеСтавки.Порт)
			|				И КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|				ИЛИ (ИерархияЛокаций.Локация = КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки)
			|				И КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) 
			|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
			//Евросиб Коханенко Н.А. 17.06.2025 )) #111353
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка
			//Евросиб Коханенко Н.А. 10.06.2025 (( #111353 
			|	И НЕ ЛокацииВУ.Ссылка ЕСТЬ NULL
			//Евросиб Коханенко Н.А. 10.06.2025 )) #111353 
			|
			//Евросиб Коханенко Н.А. 27.06.2025 (( #112908 
			//|УПОРЯДОЧИТЬ ПО
			//|	ЛокацияВУ
			|;
			|ВЫБРАТЬ         
			|	Море_УсловияIncoterms,
			|	ПортОтгрузки,
			|	Трансшипмент,
			|	Итого20,
			|	Итого40,
			|	ЛокацияВУ,
			|	ВалютаСокр
			|ИЗ вт_ЦеныCOCSOC
			|ГДЕ
			|	Трансшипмент = """"
			|УПОРЯДОЧИТЬ ПО
			|	ЛокацияВУ, Итого20, Итого40
			|;
			|ВЫБРАТЬ         
			//Евросиб Коханенко Н.А. 14.10.2025 (( #121626 
			|	ЛокацияВУ = ""CHINA"" КАК Приоритет,
			//Евросиб Коханенко Н.А. 14.10.2025 )) #121626 
			|	Море_УсловияIncoterms,
			|	ПортОтгрузки,
			|	Трансшипмент,
			|	Итого20,
			|	Итого40,
			|	ЛокацияВУ,
			|	ВалютаСокр
			|ИЗ вт_ЦеныCOCSOC
			|ГДЕ
			|	Трансшипмент <> """"
			|УПОРЯДОЧИТЬ ПО
			//Евросиб Коханенко Н.А. 14.10.2025 (( #121626 
			|	Приоритет УБЫВ,
			//Евросиб Коханенко Н.А. 14.10.2025 )) #121626 
			|	ЛокацияВУ
			//Евросиб Коханенко Н.А. 27.06.2025 )) #112908 
			|";
			
		//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
		
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		//Запрос.Текст = Запрос.Текст +  
		//	";
		//	|
		//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	Локации.Наименование КАК ПортОтгрузки,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК Трансшипмент,
		//	|	Локации.ЛокацияВышестоящегоУровня.Страна КАК ЛокацияВУ,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта.СокращенноеНаименование КАК ВалютаСокр
		//	|ИЗ
		//	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
		//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
		//	|			ПО КалькуляцияНФ_ВыбранныеСтавки.Порт = Локации.Ссылка
		//	|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = ""SOC"")
		//	|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
		//	|ГДЕ
		//	|	ПСЦКалькуляции.Ссылка = &Ссылка
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	ЛокацияВУ,
		//	|	Локации.Наименование";
		////Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		//	
		//Запрос.УстановитьПараметр("Ссылка", Протокол);
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		////РезультатЗапроса = Запрос.Выполнить();
		//МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		//РезультатЗапроса = МассивРезультатовЗапроса[0];
		
		//Если НЕ РезультатЗапроса.Пустой() Тогда
		////Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		//	Выборка = РезультатЗапроса.Выбрать();
		//	
		//	ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦена");
		//	ТабДок.Присоединить(ОбластьШапкаТаблицыММ);
		//	
		//	//вывод таблицы COC
		//	Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
		//		ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
		//		ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
		//		ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
		//		Пока Выборка.Следующий() Цикл
		//			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
		//			ОбластьСтрока.Параметры.ПортОтгрузки = Выборка.ПортОтгрузки; 
		//			ОбластьСтрока.Параметры.Трансшипмент = Выборка.Трансшипмент; 
		//			ОбластьСтрока.Параметры.Итого20 = ?(Выборка.Итого20 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр));
		//			ОбластьСтрока.Параметры.Итого40 = ?(Выборка.Итого40 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр));
		//			ТабДок.Присоединить(ОбластьСтрока);
		//		КонецЦикла;
		//	КонецЦикла; 
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		//КонецЕсли;
		//РезультатЗапроса = МассивРезультатовЗапроса[1];

		Запрос.УстановитьПараметр("Ссылка", Протокол);
		Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC Тогда
			Принадлежность = "COC";
		ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC Тогда
			Принадлежность = "SOC";
		КонецЕсли;
		Запрос.УстановитьПараметр("Принадлежность", Принадлежность);
		
		//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
		//РезультатЗапроса = Запрос.Выполнить();
		//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
		//Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатовЗапроса[1].Пустой() 
			ИЛИ НЕ МассивРезультатовЗапроса[2].Пустой() Тогда

 			РезультатЗапроса = МассивРезультатовЗапроса[1]; 

		//Евросиб Коханенко Н.А. 30.06.2025 )) #112908
		
			ОбластьРазделенияМеждуТаблицами = Макет.ПолучитьОбласть("Шапка");
			ТабДок.Присоединить(ОбластьРазделенияМеждуТаблицами);
			
			Выборка = РезультатЗапроса.Выбрать();
			
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаSOC");
			Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC Тогда
				ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦена");
			ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC Тогда
				ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаSOC");
			КонецЕсли;
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614
			
			ТабДок.Присоединить(ОбластьШапкаТаблицыММ); 
			
			//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
			//выводим сгруппированные строки с direct в таблице COC/SOC
			ПортОтгрузкиМассив = Новый Массив; 
			ОбщиеЗначенияСтроки = Новый Структура("Итого20, Итого40, ВалютаСокр");
			СтрокаПустогоЗначения = "по запросу";
			Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
				
				ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
				ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
				ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
				
				Пока Выборка.Следующий() Цикл
					
					Если ПортОтгрузкиМассив.Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(ОбщиеЗначенияСтроки, Выборка);
					КонецЕсли;
				
					Если Выборка.Итого20 = ОбщиеЗначенияСтроки.Итого20
							И Выборка.Итого40 = ОбщиеЗначенияСтроки.Итого40 Тогда
						СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
						ПортОтгрузкиМассив.Добавить(СтрокаПортаОтгрузки);
					Иначе
						ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения);
						ЗаполнитьЗначенияСвойств(ОбщиеЗначенияСтроки, Выборка);
						ПортОтгрузкиМассив = Новый Массив;
						СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
						ПортОтгрузкиМассив.Добавить(СтрокаПортаОтгрузки);
					КонецЕсли;
					
				КонецЦикла;
				
				ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения);
				ПортОтгрузкиМассив = Новый Массив;
				
			КонецЦикла;
			
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
			РезультатЗапроса = МассивРезультатовЗапроса[2];
			Выборка = РезультатЗапроса.Выбрать();
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908
		
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

			//вывод строк таблицы SOC/COC с заполненным трансшипментом
			Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
				ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
				ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
				ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
				Пока Выборка.Следующий() Цикл 
					ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
					//Евросиб Коханенко Н.А. 28.03.2025 (( #105938
					//ОбластьСтрока.Параметры.ПортОтгрузки = Выборка.ПортОтгрузки; 
					//ОбластьСтрока.Параметры.Трансшипмент = Выборка.Трансшипмент;
					
					//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
					//МассивЭлементов = Новый Массив;
					//МассивЭлементов.Добавить(Выборка.Море_УсловияIncoterms);
					//СимвПоз = Найти(Выборка.ПортОтгрузки, "(");
					//ПортОтгрузки = ?(СимвПоз = 0, Выборка.ПортОтгрузки, Лев(Выборка.ПортОтгрузки, СимвПоз-2)); 
					//МассивЭлементов.Добавить(ПортОтгрузки);
					//Евросиб Коханенко Н.А. 10.06.2025 (( #111353 
					//ОбластьСтрока.Параметры.ПортОтгрузки = СтрСоединить(МассивЭлементов, " ");
					//Евросиб Коханенко Н.А. 10.06.2025 )) #111353 
					//СимвПоз = Найти(Выборка.Трансшипмент, "(");
					//Трансшипмент = ?(СимвПоз = 0, Выборка.Трансшипмент, Лев(Выборка.Трансшипмент, СимвПоз-2));
					СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
					ОбластьСтрока.Параметры.ПортОтгрузки = ?(ЗначениеЗаполнено(СтрокаПортаОтгрузки), СтрокаПортаОтгрузки, "direct");
					Трансшипмент = СформироватьНаименованиеПортаОтгрузки("", Выборка.Трансшипмент);
					//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
					ОбластьСтрока.Параметры.Трансшипмент = ?(ЗначениеЗаполнено(Трансшипмент), Трансшипмент, "direct"); 
					//Евросиб Коханенко Н.А. 28.03.2025 )) #105938
					//Евросиб Коханенко Н.А. 10.06.2025 (( #111353
					//ОбластьСтрока.Параметры.Итого20 = ?(Выборка.Итого20 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр));
					//ОбластьСтрока.Параметры.Итого40 = ?(Выборка.Итого40 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр));
					СтрокаПустогоЗначения = "по запросу";
					ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(Выборка.Итого20), СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
					ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(Выборка.Итого40), СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
					//Евросиб Коханенко Н.А. 10.06.2025 )) #111353
					ТабДок.Присоединить(ОбластьСтрока);
				КонецЦикла;
			КонецЦикла; 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаЖД Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20 КАК Ставка20,
			|	ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка КАК Ставка40,
			|	ПСЦКалькуляции.Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияНаименование,
			|	ПСЦКалькуляции.Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктНазначенияНаименование,
			|	ПСЦКалькуляции.Калькуляция.Валюта.СокращенноеНаименование КАК ВалютаСокр,
			|	ПСЦКалькуляции.Калькуляция.Ссылка КАК КалькуляцияСсылка,
			|	КалькуляцияСписокСтанцийОтправления.Станция.Наименование КАК СтанцияОтправленияНаименование,
			|	КалькуляцияСписокСтанцийНазначения.Станция.Наименование КАК СтанцияНазначенияНаименование
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийОтправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийНазначения.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка
			|УПОРЯДОЧИТЬ ПО
			|	КалькуляцияСсылка";      
		
		Запрос.УстановитьПараметр("Ссылка", Протокол); 
		РезультатЗапроса = Запрос.Выполнить();
		ШапкаТаблицыММДоговорнаяЦенаЖД = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаЖД");
		ТабДок.Присоединить(ШапкаТаблицыММДоговорнаяЦенаЖД);

        Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("КалькуляцияСсылка") Цикл
			МассивПунктовОтправления = Новый Массив;
			МассивПунктовНазначения = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.СтанцияОтправленияНаименование) Тогда
					МассивПунктовОтправления.Добавить(Выборка.СтанцияОтправленияНаименование);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.СтанцияНазначенияНаименование) Тогда
					МассивПунктовНазначения.Добавить(Выборка.СтанцияНазначенияНаименование);
				КонецЕсли;
			КонецЦикла;                                                                           
			Если МассивПунктовОтправления.Количество() = 0 Тогда
				МассивПунктовОтправления.Добавить(Выборка.ПунктОтправленияНаименование);
			Иначе
				МассивПунктовОтправления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПунктовОтправления);
			КонецЕсли;
			СтрокаПунктовОтправления = СтрСоединить(МассивПунктовОтправления, " / " + Символы.ПС);
			Если МассивПунктовНазначения.Количество() = 0 Тогда
				МассивПунктовНазначения.Добавить(Выборка.ПунктНазначенияНаименование);
			Иначе
				МассивПунктовНазначения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПунктовНазначения);
			КонецЕсли;
			//вывод таблицы 
			ПерваяСтрока = Истина;
			Для Каждого СтанцияНазначения Из МассивПунктовНазначения Цикл
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЖД");
				Если ПерваяСтрока Тогда 
					ОбластьСтрока.Параметры.ПунктОтправления = СтрокаПунктовОтправления; 
					//пока не ясно, нужно повторять в каждой строке, или достаточно только в первой. ждем обратной связи от заказчика
					//ПерваяСтрока = Ложь;
				Иначе
					ОбластьСтрока.Параметры.ПунктОтправления = "";
				КонецЕсли;
				ОбластьСтрока.Параметры.СтанцияНазначения = СтанцияНазначения;
				ОбластьСтрока.Параметры.Ставка20 = ?(Выборка.Ставка20 = 0, "-", СтрШаблон("%1 %2", Выборка.Ставка20, Выборка.ВалютаСокр));
				//для значения 20'(груз > 24т) пока нет данных, появится при дальнейших разработках
				ОбластьСтрока.Параметры.Ставка20больше = "-";
				ОбластьСтрока.Параметры.Ставка40 = ?(Выборка.Ставка40 = 0, "-", СтрШаблон("%1 %2", Выборка.Ставка40, Выборка.ВалютаСокр));
				ТабДок.Присоединить(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.10.2024 )) #92915 

//Евросиб Коханенко Н.А. 02.11.2024 (( #92915 
Процедура ВывестиТаблицуНотисВРПРефы(ТабДок, Макет, Протокол, ЭлементПечатнойФормы)

	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			" ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТККлиента
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка20,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТККлиента
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка40,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТКЕвросиб
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка20Евросиб,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТКЕвросиб
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка40Евросиб,
			|	ПСЦКалькуляции.Калькуляция.УсловияПеревозки_Отправление КАК УсловияПеревозки_Отправление,
			|	ПСЦКалькуляции.Калькуляция.УсловияПеревозки_Прибытие КАК УсловияПеревозки_Прибытие,
			|	ЛОЖЬ КАК КТКЕвросиб,
			|	ПСЦКалькуляции.Калькуляция.Валюта.СокращенноеНаименование КАК ВалютаСокр,
			|	ВЫБОР
			|		КОГДА КалькуляцияСписокСтанцийОтправления.Станция.Наименование ЕСТЬ NULL 
			|			ТОГДА ПСЦКалькуляции.Калькуляция.Суша_ПунктОтправления.Наименование
			|		ИНАЧЕ КалькуляцияСписокСтанцийОтправления.Станция.Наименование
			|	КОНЕЦ КАК СтанцияОтправленияНаименование,
			|	ВЫБОР
			|		КОГДА КалькуляцияСписокСтанцийНазначения.Станция.Наименование ЕСТЬ NULL 
			|			ТОГДА ПСЦКалькуляции.Калькуляция.Суша_ПунктНазначения.Наименование
			|		ИНАЧЕ КалькуляцияСписокСтанцийНазначения.Станция.Наименование
			|	КОНЕЦ КАК СтанцияНазначенияНаименование
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийОтправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийНазначения.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка";		
		Запрос.УстановитьПараметр("Ссылка", Протокол);
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
		ТаблицаДанных.Колонки.Добавить("МаршрутСледования", ОписаниеТипаСтрока);
		ТаблицаДанных.Колонки.Добавить("УсловияПеревозки", ОписаниеТипаСтрока);
	
		//вывод таблицы
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыВРПРефыДоговорнаяЦена");
		ТабДок.Присоединить(ОбластьШапкаТаблицы);

		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл 
		
			Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Или ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
				Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Тогда
					ОтправлениеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Отправление);
				Иначе
					ОтправлениеТекст = "";
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
					ПрибытиеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Прибытие);
				Иначе
					ПрибытиеТекст = "";
				КонецЕсли;
				СтрокаТаблицы.УсловияПеревозки = ОтправлениеТекст + " - " + ПрибытиеТекст + ?(СтрокаТаблицы.КТКЕвросиб, " + КТК", "");
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.СтанцияОтправленияНаименование) 
					ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.СтанцияНазначенияНаименование) Тогда
				Пункты = Новый Массив;
				Пункты.Добавить(СтрокаТаблицы.СтанцияОтправленияНаименование);
				Пункты.Добавить(СтрокаТаблицы.СтанцияНазначенияНаименование);
				СтрокаТаблицы.МаршрутСледования = СтрСоединить(Пункты, " - ");
			КонецЕсли;
			
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыВРПРефыДоговорнаяЦена");
			ОбластьСтрока.Параметры.МаршрутСледования = СтрокаТаблицы.МаршрутСледования; 
			ОбластьСтрока.Параметры.УсловияПеревозки = СтрокаТаблицы.УсловияПеревозки; 
			ОбластьСтрока.Параметры.Ставка20 = ?(СтрокаТаблицы.Ставка20 = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка20, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка20Евросиб = ?(СтрокаТаблицы.Ставка20Евросиб = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка20Евросиб, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка40 = ?(СтрокаТаблицы.Ставка40 = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка40, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка40Евросиб = ?(СтрокаТаблицы.Ставка40Евросиб = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка40Евросиб, СтрокаТаблицы.ВалютаСокр));
			ТабДок.Присоединить(ОбластьСтрока);
			
		КонецЦикла;    
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.10.2024 )) #92915 

//Евросиб Коханенко Н.А. 31.10.2024 (( #92915
Процедура ВывестиТаблицуИзХранилища(ТабДок, ТаблицаСсылка)

	Если НЕ ЗначениеЗаполнено(ТаблицаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	стДанныеТаблицы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТаблицаСсылка, "Макет, ЕстьМакет");
	Если стДанныеТаблицы.ЕстьМакет Тогда
		Макет = стДанныеТаблицы.Макет.Получить();
		Если Макет <> Неопределено 
			И ТипЗнч(Макет) = Тип("ТабличныйДокумент") Тогда
			Попытка
				ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
				ТабДок.Присоединить(ОбластьТаблица);
			Исключение   
				ОбщегоНазначения.СообщитьПользователю("Не удалось получить область ""Таблица"" из макета: " + ТаблицаСсылка);
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры //Евросиб Коханенко Н.А. 31.10.2024 )) #92915

//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
Процедура ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения)
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
	СтрокаПортаОтгрузки = СтрСоединить(ПортОтгрузкиМассив, " /");
	ОбластьСтрока.Параметры.ПортОтгрузки = ?(ЗначениеЗаполнено(СтрокаПортаОтгрузки), СтрокаПортаОтгрузки, "direct");
	ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(ОбщиеЗначенияСтроки.Итого20), СтрШаблон("%1 %2", ОбщиеЗначенияСтроки.Итого20, ОбщиеЗначенияСтроки.ВалютаСокр), СтрокаПустогоЗначения);
	ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(ОбщиеЗначенияСтроки.Итого40), СтрШаблон("%1 %2", ОбщиеЗначенияСтроки.Итого40, ОбщиеЗначенияСтроки.ВалютаСокр), СтрокаПустогоЗначения);
	ОбластьСтрока.Параметры.Трансшипмент = "direct";
	ТабДок.Присоединить(ОбластьСтрока);

КонецПроцедуры //Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
Функция СформироватьНаименованиеПортаОтгрузки(Море_УсловияIncoterms, ПортОтгрузки)
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Море_УсловияIncoterms);
	СимвПоз = Найти(ПортОтгрузки, "(");
	ПортОтгрузкиСтрока = ?(СимвПоз = 0, ПортОтгрузки, Лев(ПортОтгрузки, СимвПоз-2));
	МассивЭлементов.Добавить(ПортОтгрузкиСтрока);
	ПортОтгрузкиСтрока = СтрСоединить(МассивЭлементов, " ");
	Возврат ПортОтгрузкиСтрока;

КонецФункции //Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

#КонецОбласти


