
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Подразделение = Автор.Подразделение;
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьПСЦ.Получить();
	НаименованиеПодписиИсполнителя = Справочники.НаименованияПодписей.Исполнитель;
	НаименованиеПодписиКлиента = Справочники.НаименованияПодписей.Клиент;
	НаименованиеУслугиВознагражденияДляДоговорнойЦеныВР = Справочники.НаименованияУслугиВознагражденияДляДоговорнойЦеныВР.Вознаграждение;
	ПересчетСуммыИСФнаДатуСчета = Истина;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Калькуляция") Тогда
		Калькуляции.Добавить().Калькуляция = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			РуководительКонтрагента = КонтрагентыДоговоры_сервер.ПолучитьРуководителяКонтрагента(Контрагент, ТекущаяДата());
		КонецЕсли;
		
		Договор = ДанныеЗаполнения.Договор;
		Организация = ДанныеЗаполнения.Организация;
		СтавкаНДС = ДанныеЗаполнения.СтавкаНДС;
		Валюта = ДанныеЗаполнения.Валюта;
		СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ЦФО = ДанныеЗаполнения.ЦФО;
		СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
		//Евросиб Каблов 13.03.2023 ( Ticket#0265045
		ВидПеревозки = ДанныеЗаполнения.ПС_ВидПеревозки;
		//Евросиб Каблов 13.03.2023 )
		Для каждого Стр из ДанныеЗаполнения.ММ_КалькуляцияЖДСоставляющей Цикл
			Если Стр.Операция.НормативВыгрузки Тогда
				НормативВыгрузки = Стр.ДлительностьДней;
			ИначеЕсли Стр.Операция.НормативПогрузки Тогда
				НормативПогрузки = Стр.ДлительностьДней;
			КонецЕсли;
		КонецЦикла;
		
		//БИТ Белинский Д.А. 20.06.2023 -начало
		Если ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
			ИЛИ ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф Тогда 
			
			ДатаПСЦ = ТекущаяДата();
			ФорматПротокола = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный;  
			ТипКалькуляции = ДанныеЗаполнения.ТипКалькуляции;   
			НачалоДействия = ТекущаяДата();
			ОтветственныйМенеджер = ПараметрыСеанса.ТекущийПользователь;
		// ДИТ US 59973 ТА 76151 Сержантова А.С. Начало: 16.10.2023
		ИначеЕсли ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии ИЛИ ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.Премии Тогда  //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
			ТипКалькуляции = ДанныеЗаполнения.ТипКалькуляции;    
		// ДИТ US 59973 ТА 76151 Сержантова А.С. Конец: 16.10.2023	
		КонецЕсли;
		//БИТ Белинский Д.А. 20.06.2023 -конец
		
	КонецЕсли;
	
	// Евросиб US 88643 Рыбьяков К.А. 16.08.2024 ((
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Основание") 
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.РелизСобственника") Тогда
		
		Подразделение = ДанныеЗаполнения.Подразделение;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		ТипКалькуляции = Перечисления.ТипыКалькуляций.Доплатные;
		ПротоколНаДоплатныеКТК = Истина;
		КатегорияУслуг = Справочники.КатегорииУслуг.КТКСтокиТерминалыПорты;
		Если ДанныеЗаполнения.Свойство("ВидПеревозки") Тогда
			ВидПеревозки = ДанныеЗаполнения.ВидПеревозки;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("СтавкаНДС") Тогда
			СтавкаНДС = ДанныеЗаполнения.СтавкаНДС;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("НДСВключая") Тогда
			СуммаВключаетНДС = ДанныеЗаполнения.НДСВключая;
		КонецЕсли;
		
		Для Каждого Калькуляция Из ДанныеЗаполнения.Калькуляции Цикл
			Калькуляции.Добавить().Калькуляция = Калькуляция;
		КонецЦикла;
		
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 16.08.2024 ))
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 18.09.2020 (
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 18.09.2020 )
		
	// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
	
		НовУник = Новый УникальныйИдентификатор();
		ТекСсылка = Документы.ПСЦ.ПолучитьСсылку(НовУник);
		УстановитьСсылкуНового(ТекСсылка);
		//Евросиб - АСуслов 12.01.2021 16:54:07 #
		//(
		ПересчетСуммыИСФнаДатуСчета = Истина;
		//)
		//Евросиб - АСуслов 12.01.2021 16:54:08 #
	Иначе
		ТекСсылка = Ссылка;
	КонецЕсли; 
	// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();

	// Евросиб US 87896 Рыбьяков К.А. 18.07.2024 ((
	// проверка на несоответствие клиента в калькуляциях и в ПСЦ
	Если Не Нотис Тогда
		Для каждого Стр из Калькуляции Цикл
			Если Стр.Калькуляция.Контрагент <> Контрагент ИЛИ Стр.Калькуляция.Договор <> Договор Тогда
				
				Сообщить("В калькуляции " + Стр.Калькуляция + " не совпадает Контрагент или Договор. Запись запрещена!");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.07.2024 ))
	
	//// Евросиб Фролов (29.11.2021 Ticket№ 0250840
	//Если Не ЗначениеЗаполнено(ОкончаниеДействия)
	//	И ДействуетДоСогласованияНовыхУсловий = Ложь Тогда
	//	ТекстСообщения = "Укажите дату окончания действия ПСЦ или установите признак ""Действует до согласования новых условий""";

	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//														ТекстСообщения,
	//														ЭтотОбъект,
	//														"ОкончаниеДействия",
	//														,
	//														Отказ);
	//КонецЕсли;	
	//
	//Если ПСЦПоставщика Тогда
	//	Если ПСЦПоставщика_вагоны.Количество() = 0
	//		И ПСЦПоставщика_контейнерыВРП.Количество() = 0 
	//		И ПСЦПоставщика_контейнерыЭкспорт.Количество() = 0 
	//		И ПСЦПоставщика_автодоставка.Количество() = 0 
	//		И ПСЦПоставщика_ТЭО.Количество() = 0 Тогда
	//	 	ОбщегоНазначения.СообщитьПользователю("Для ПСЦ поставщика необходимо заполнить один из списков на вкладке ""Протокол поставщика"":
	//										|""Вагоны"", ""Контейнеры врем. пользования"", ""Контейнеры экспортные"", ""Автодоставка"" или ""ТЭО""", ЭтотОбъект,,, Отказ); 
	//	КонецЕсли;
	//КонецЕсли;		
	//// Евросиб Фролов)
	
	//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, начало
	Если НЕ КонтрольДоступностиДокументов_сервер.РазрешеноВыбиратьИзменятьТипКалькуляцииДоплатные(Ссылка, ТипКалькуляции) Тогда
		ОбщегоНазначения.СообщитьПользователю("Недостаточно прав изменять тип калькуляции <Доплатные КТК>. Необходимо обратиться к руководителю Производственной дирекции",,"ТипКалькуляции", "Объект", Отказ);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 87170 / TA 87570, 28-06-2024, конец

	Если Отказ Тогда Возврат; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РуководительКонтрагента) И ЗначениеЗаполнено(Контрагент) Тогда
		
		РуководительКонтрагента = КонтрагентыДоговоры_сервер.ПолучитьРуководителяКонтрагента(Контрагент, ?(ЗначениеЗаполнено(ДатаПодписания), ДатаПодписания, Дата));
		
	КонецЕсли;
	
	Если Не БезДоверенностей Тогда
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(?(ЗначениеЗаполнено(ДатаПодписания), ДатаПодписания, Дата), "Протокол", ЦФО);
		//Евросиб Коханенко Н.А. 13.10.2023 (( #76015
		//ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		Если НЕ ПСЦПоставщика Тогда
			ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 13.10.2023 )) #76015 
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
//Евросиб Гудкова( 11.11.2019 Ticket№ 0180052 проверка условий НДС 0% в договоре
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		ВыборкаТекУсловий = КонтрольДоступностиДокументов_сервер.ПолучитьТекущиеПараметрыНДС0(Договор, ДатаПСЦ);
		Если Не ВыборкаТекУсловий.Следующий() Тогда
			ОбщегоНазначения.СообщитьПользователю("На дату ПСЦ не обнаружены действующие условия применения ставки НДС 0%",,,,Отказ);
		КонецЕсли; 
	КонецЕсли; 
// Евросиб Гудкова)

	Если ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно Тогда
		//Проверим, что в повагонке заполнены нормативные ставки в сут.
		Для каждого СтрокаКалькуляцииПовагонки Из КалькуляцииПовагонки Цикл
			//Если НЕ ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.НормативСледованияРуб) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <Норматив следования, руб.>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда 
		//Проверим, что заполнены нормативы следования и СНП
		Для каждого СтрокаКалькуляцииПовагонки Из КалькуляцииПовагонки  Цикл
			//Если Не ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.НормативСледованияДни) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <Норматив следования, дни>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
			//Если Не ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.СтавкаЗаРейс) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <Ставка за рейс>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
			//Если Не ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.СНПСледованияРуб) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <СНП руб./сут.>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОтдельноПогрузкаПеревозкаВыгрузка Тогда 
		Если Не ЗначениеЗаполнено(НормативПогрузки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнен норматив погрузки",,,,Отказ);
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(НормативВыгрузки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнен норматив выгрузки",,,,Отказ);
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(СтавкаПриНарушенииСроковПогрузки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнена ставка при нарушении сроков погрузки",,,,Отказ);
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(СтавкаПриНарушенииСроковВыгрузки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнена ставка при нарушении сроков выгрузки",,,,Отказ);
		КонецЕсли; 
		Для каждого СтрокаКалькуляцииПовагонки Из КалькуляцииПовагонки  Цикл
			//Если Не ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.НормативСледованияДни) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <Норматив следования, дни>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
			//Если Не ЗначениеЗаполнено(СтрокаКалькуляцииПовагонки.СтавкаЗаРейс) Тогда
			//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 ТЧ <Повагонка> не заполнено поле <Ставка за рейс>", СтрокаКалькуляцииПовагонки.НомерСтроки),,,,Отказ); 
			//КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;	
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	// + Состояния
	КолСостоянийЗавершено = 0; // Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	
	//++ Зубов 35844 04.08.2021
//	//Стаценко Параллельное согласование
//	Для каждого СтрТЧ из Состояния Цикл
//		Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
//			СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
//            ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
//			Попытка
//				МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
//			Исключение
//				Сообщить("Некорректная строка предыдущих этапов");
//			КонецПопытки;
//			ВозможноВыполнение = Истина;
//			Если МассивЭтапов.Количество() > 0 Тогда
//				Для каждого Эл из МассивЭтапов Цикл
//					Попытка
//						НомСтр = Число(Эл);
//						СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
//						Если СтрЭтапа <> Неопределено Тогда
//							Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
//								ВозможноВыполнение = Ложь;
//							КонецЕсли;
//						КонецЕсли;
//					Исключение
//						Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
//					КонецПопытки
//				КонецЦикла;
//			КонецЕсли;
//			Если ВозможноВыполнение Тогда
//				СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
//			КонецЕсли;
//		КонецЕсли;
//		
////Евросиб Гудкова( 01.09.2020 Ticket№ 0205361
////было
//		//Если СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда // Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
//		//	КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
//		//КонецЕсли;
//// Евросиб Гудкова) 		
//	
//	КонецЦикла;
	//Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 04.08.2021
	
	// Маршрутизация ПСЦ
	//РеквизитыПСЦДляСравнения = "Организация, Контрагент, ВидПеревозки, Валюта, СогласованоВDV,
	//						   |ВидПСЦ, СодержитВР, ПротоколНаДоплатныеКТК, НетиповойПротокол,
	//						   |ЦФО, КатегорияУслуг, МестоОказанияУслуг, Договор, ТипКалькуляции";  
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
	//РеквизитыПСЦДляСравнения = "Организация, Контрагент, ВидПеревозки, Валюта, СогласованоВDV,
	//						   |ВидПСЦ, СодержитВР, ПротоколНаДоплатныеКТК, НетиповойПротокол,
	//						   |ЦФО, КатегорияУслуг, МестоОказанияУслуг, Договор, ТипКалькуляции, Поручение";
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец
	//Евросиб Коханенко Н.А. 11.12.2024 (( #88818 
	РеквизитыПСЦДляСравнения = "Организация, Контрагент, ВидПеревозки, Валюта, СогласованоВDV,
							   |ВидПСЦ, СодержитВР, ПротоколНаДоплатныеКТК, НетиповойПротокол,
							   |ЦФО, КатегорияУслуг, МестоОказанияУслуг, Договор, ТипКалькуляции, Поручение, Нотис";
	//Евросиб Коханенко Н.А. 11.12.2024 )) #88818 
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект, РеквизитыПСЦДляСравнения);
	//НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	//Ссылка.Организация <> Организация ИЛИ 
	//Ссылка.Контрагент <> Контрагент ИЛИ
	//Ссылка.ВидПеревозки <> ВидПеревозки ИЛИ
	//Ссылка.Валюта <> Валюта ИЛИ
	//Ссылка.СогласованоВDV <> СогласованоВDV ИЛИ
	//Ссылка.ВидПСЦ <> ВидПСЦ ИЛИ
	//Ссылка.СодержитВР <> СодержитВР ИЛИ
	//Ссылка.ПротоколНаДоплатныеКТК <> ПротоколНаДоплатныеКТК ИЛИ
	//Ссылка.НетиповойПротокол <> НетиповойПротокол ИЛИ
	//Ссылка.ЦФО <> ЦФО ИЛИ
	////++ Зубов 21.07.2021 ФТ 36970
	////(Ссылка.КатегорииУслуг<>Справочники.КатегорииУслуг.ПустаяСсылка() И Ссылка.КатегорииУслуг <> КатегорииУслуг) ИЛИ
	////(Ссылка.МестоОказанияУслуг<>Справочники.Локации.ПустаяСсылка() И Ссылка.МестоОказанияУслуг <> МестоОказанияУслуг) ИЛИ
	//Ссылка.КатегорияУслуг <> КатегорияУслуг ИЛИ
	//Ссылка.МестоОказанияУслуг <> МестоОказанияУслуг ИЛИ
	////-- Зубов 21.07.2021 ФТ 36970
	//Ссылка.Договор <> Договор ИЛИ состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		//ПараметрыЗапроса = Новый Соответствие;
		//ПараметрыЗапроса.Вставить("Организация", Организация);
		//ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		//ПараметрыЗапроса.Вставить("Договор", Договор);
		//ПараметрыЗапроса.Вставить("Валюта", Валюта);
		//ПараметрыЗапроса.Вставить("СодержитВР", СодержитВР);
		//ПараметрыЗапроса.Вставить("ПротоколНаДоплатныеКТК", ПротоколНаДоплатныеКТК);
		//ПараметрыЗапроса.Вставить("ВидПеревозки", ВидПеревозки);
		//ПараметрыЗапроса.Вставить("ВидПСЦ", ВидПСЦ);
		//ПараметрыЗапроса.Вставить("СогласованоВDV", СогласованоВDV);
		//ПараметрыЗапроса.Вставить("Нетиповой", НетиповойПротокол);
		//ПараметрыЗапроса.Вставить("Нерезидент", (Контрагент.СтранаРегистрации <> Справочники.СтраныМира.Россия));
		//ПараметрыЗапроса.Вставить("ВидДоговора", Договор.ВидДоговора);
		//ПараметрыЗапроса.Вставить("КатегорияДоговора", Договор.КатегорияДоговора);
		//ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
		//ПараметрыЗапроса.Вставить("Фрахт", ПСЦПоставщикаФрахт);
		////++ Зубов 27.07.2021
		//ПараметрыЗапроса.Вставить("КатегорияУслуг", КатегорияУслуг);
		//ПараметрыЗапроса.Вставить("МестоОказанияУслуг", МестоОказанияУслуг);
		////-- Зубов 27.07.2021
		////Евросиб - АСуслов 15.12.2021 17:46:02 #42234
		////(
		//ПараметрыЗапроса.Вставить("ТипКалькуляции", ТипКалькуляции);
		////)
		////Евросиб - АСуслов 15.12.2021 17:52:26 #42234
		ПараметрыЗапроса = Документы.ПСЦ.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦ(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
	// + Процедура создания тарифов поставщиков из ПСЦ поставщика
	
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452 ручное обновление тарифов из формы ПСЦ
//было 	Если ПСЦПоставщика Тогда
	ОбновитьТарифы = Неопределено;
	Если ПСЦПоставщика и ДополнительныеСвойства.Свойство("ОбновитьТарифы", ОбновитьТарифы) И ОбновитьТарифы = Истина Тогда
// Евросиб Гудкова)

		Для каждого Стр из ПСЦПоставщика_вагоны Цикл
			
			Если  
				ЗначениеЗаполнено(Стр.НоменклатураПоставщика1) И
				ЗначениеЗаполнено(Стр.Ставка1) И
				ЗначениеЗаполнено(Стр.НДС1)
//Евросиб Гудкова( 10.02.2020 Ticket№ 0186614
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452				И Не ЗначениеЗаполнено(Стр.СозданныйТариф)
// Евросиб Гудкова) 			
				Тогда
				
				СтруктураПередаваемыхПараметров = Новый Структура;
				СтруктураПередаваемыхПараметров.Вставить("Контрагент", Контрагент);
				СтруктураПередаваемыхПараметров.Вставить("Договор", Договор);
				СтруктураПередаваемыхПараметров.Вставить("Валюта", Валюта);
				СтруктураПередаваемыхПараметров.Вставить("НачалоДействия", ПСЦПоставщика_НачалоДействияСтавок);
				СтруктураПередаваемыхПараметров.Вставить("ОкончаниеДействия", ПСЦПоставщика_КонецДействияСтавок);
				СтруктураПередаваемыхПараметров.Вставить("НоменклатураПоставщика", Стр.НоменклатураПоставщика1);
				СтруктураПередаваемыхПараметров.Вставить("ТипВагона", Стр.ТипВагона1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияОтправления", Стр.СтанцияОтправления1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияНазначения", Стр.СтанцияНазначения1);
				СтруктураПередаваемыхПараметров.Вставить("Ставка", Стр.Ставка1);
				СтруктураПередаваемыхПараметров.Вставить("НДС", Стр.НДС1);
				СтруктураПередаваемыхПараметров.Вставить("НормативПогрузки", Стр.НормативПогрузки1);
				СтруктураПередаваемыхПараметров.Вставить("НормативВыгрузки", Стр.НормативВыгрузки1);
				СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНП", Стр.СтоимостьСНП1);
				СтруктураПередаваемыхПараметров.Вставить("Организация", Организация);
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979					
					СтруктураПередаваемыхПараметров.Вставить("Услуга", Стр.Услуга);
//Евросиб Гудкова)					
				СтруктураПередаваемыхПараметров.Вставить("Тариф", Стр.СозданныйТариф);
				СтруктураПередаваемыхПараметров.Вставить("СозданНаОсновании", ТекСсылка);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
				Стр.СозданныйТариф = Тарификатор_сервер.СоздатьТарифПоПараметрам(1, "", СтруктураПередаваемыхПараметров);
				
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
			Иначе
 				ОбщегоНазначения.СообщитьПользователю("Вагоны. По строке " + ПСЦПоставщика_вагоны.Индекс(Стр) + " тариф не создан. Нужно заполнить номенклатуру поставщика, ставку, ставку НДС.");
//Евросиб Гудкова)					
			КонецЕсли;
			
			
		КонецЦикла;
		
		Для каждого Стр из ПСЦПоставщика_контейнерыВРП Цикл
			
			Если  
				ЗначениеЗаполнено(Стр.НоменклатураПоставщика1) И
				ЗначениеЗаполнено(Стр.Ставка1) И
				ЗначениеЗаполнено(Стр.НДС1)
//Евросиб Гудкова( 10.02.2020 Ticket№ 0186614
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452				И Стр.СозданныйТариф.Получить().Количество() = 0
// Евросиб Гудкова) 			
				
				Тогда
				// для каждого города возврата из списка создаем свой тариф
				Если ЗначениеЗаполнено(Стр.ГородВозврата1) ТОгда
					СписокГородовВозврата = Стр.ГородВозврата1.получить();
				Иначе
					СписокГородовВозврата = Новый СписокЗначений;
					СписокГородовВозврата.Добавить(Справочники.Локации.ПустаяСсылка());
				КонецЕсли;
				
				СписокТарифов = Новый СписокЗначений;
				Сч = 0;//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
				Для Каждого ЭлемСп Из СписокГородовВозврата Цикл
					СтруктураПередаваемыхПараметров = Новый Структура;
					СтруктураПередаваемыхПараметров.Вставить("Контрагент", Контрагент);
					СтруктураПередаваемыхПараметров.Вставить("Договор", Договор);
					//СтруктураПередаваемыхПараметров.Вставить("Валюта", Валюта);
					СтруктураПередаваемыхПараметров.Вставить("НачалоДействия", ПСЦПоставщика_НачалоДействияСтавок);
					СтруктураПередаваемыхПараметров.Вставить("ОкончаниеДействия", ПСЦПоставщика_КонецДействияСтавок);
					СтруктураПередаваемыхПараметров.Вставить("НоменклатураПоставщика", Стр.НоменклатураПоставщика1);
					СтруктураПередаваемыхПараметров.Вставить("ТипКонтейнера", Стр.ТипКонтейнера1);
					СтруктураПередаваемыхПараметров.Вставить("СтанцияОтправления", Стр.ГородВыдачи1);
					СтруктураПередаваемыхПараметров.Вставить("СтанцияНазначения", ЭлемСп.Значение);
					СтруктураПередаваемыхПараметров.Вставить("Ставка", Стр.Ставка1);
					СтруктураПередаваемыхПараметров.Вставить("Валюта", Стр.Валюта1);
					СтруктураПередаваемыхПараметров.Вставить("НДС", Стр.НДС1);
					СтруктураПередаваемыхПараметров.Вставить("НормативПогрузки", Стр.НормативПользования1);
					СтруктураПередаваемыхПараметров.Вставить("НормативВыгрузки", 0);
					СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНП", Стр.СтоимостьСНП1);
					СтруктураПередаваемыхПараметров.Вставить("Организация", Организация);
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979					
					СтруктураПередаваемыхПараметров.Вставить("Услуга", Стр.Услуга);
					Попытка
						ТекТариф = Стр.СозданныйТариф.Получить()[Сч];
					Исключение
						ТекТариф = Справочники.ТарифыПоставщиков.ПустаяСсылка();
					КонецПопытки;
//Евросиб Гудкова)					
					СтруктураПередаваемыхПараметров.Вставить("Тариф", ТекТариф);//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979 Справочники.ТарифыПоставщиков.ПустаяСсылка());
					СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНПХранилище", Стр.СтоимостьСНПХранилище.Получить());
					СтруктураПередаваемыхПараметров.Вставить("СозданНаОсновании", ТекСсылка);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
					
					ТекТариф = Тарификатор_сервер.СоздатьТарифПоПараметрам(2, "", СтруктураПередаваемыхПараметров);
					СписокТарифов.Добавить(ТекТариф);
					Сч = Сч + 1;//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
				КонецЦикла;
				Стр.СозданныйТариф = Новый ХранилищеЗначения(СписокТарифов);
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
			Иначе
 				ОбщегоНазначения.СообщитьПользователю("КТК ВРП. По строке " + ПСЦПоставщика_контейнерыВРП.Индекс(Стр) + " тариф не создан. Нужно заполнить номенклатуру поставщика, ставку, ставку НДС.");
//Евросиб Гудкова)					
			КонецЕсли;
			
			
		КонецЦикла;
		
		Для каждого Стр из ПСЦПоставщика_контейнерыЭкспорт Цикл
			
			Если  
				ЗначениеЗаполнено(Стр.НоменклатураПоставщика1) И
				ЗначениеЗаполнено(Стр.Ставка1) И
				ЗначениеЗаполнено(Стр.НДС1)
//Евросиб Гудкова( 10.02.2020 Ticket№ 0186614
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452				И Стр.СозданныйТариф.Получить().Количество() = 0
// Евросиб Гудкова) 			
				
				Тогда
				// для каждого города возврата из списка создаем свой тариф
				Если ЗначениеЗаполнено(Стр.ГородВозврата1) ТОгда
					СписокГородовВозврата = Стр.ГородВозврата1.получить();
				Иначе
					СписокГородовВозврата = Новый СписокЗначений;
					СписокГородовВозврата.Добавить(Справочники.Локации.ПустаяСсылка());
				КонецЕсли;
								
				СписокТарифов = Новый СписокЗначений;
				Сч = 0;//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
				Для Каждого ЭлемСп Из СписокГородовВозврата Цикл
					СтруктураПередаваемыхПараметров = Новый Структура;
					СтруктураПередаваемыхПараметров.Вставить("Контрагент", Контрагент);
					СтруктураПередаваемыхПараметров.Вставить("Договор", Договор);
					СтруктураПередаваемыхПараметров.Вставить("Валюта", Валюта);
					СтруктураПередаваемыхПараметров.Вставить("НачалоДействия", ПСЦПоставщика_НачалоДействияСтавок);
					СтруктураПередаваемыхПараметров.Вставить("ОкончаниеДействия", ПСЦПоставщика_КонецДействияСтавок);
					СтруктураПередаваемыхПараметров.Вставить("НоменклатураПоставщика", Стр.НоменклатураПоставщика1);
					СтруктураПередаваемыхПараметров.Вставить("ТипКонтейнера", Стр.ТипКонтейнера1);
					СтруктураПередаваемыхПараметров.Вставить("СтанцияОтправления", Стр.ГородВыдачи1);
					СтруктураПередаваемыхПараметров.Вставить("СтанцияНазначения", ЭлемСп.Значение);
					СтруктураПередаваемыхПараметров.Вставить("Ставка", Стр.Ставка1);
					СтруктураПередаваемыхПараметров.Вставить("НДС", Стр.НДС1);
					СтруктураПередаваемыхПараметров.Вставить("НормативПогрузки", Стр.НормативПользования1);
					СтруктураПередаваемыхПараметров.Вставить("НормативВыгрузки", 0);
					СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНП", Стр.СтоимостьСНП1);
					СтруктураПередаваемыхПараметров.Вставить("Организация", Организация);
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979					
					СтруктураПередаваемыхПараметров.Вставить("Услуга", Стр.Услуга);
					Попытка
						ТекТариф = Стр.СозданныйТариф.Получить()[Сч];
					Исключение
						ТекТариф = Справочники.ТарифыПоставщиков.ПустаяСсылка();
					КонецПопытки;
//Евросиб Гудкова)					
					СтруктураПередаваемыхПараметров.Вставить("Тариф", ТекТариф);//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979 Справочники.ТарифыПоставщиков.ПустаяСсылка());
					СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНПХранилище", Стр.СтоимостьСНПХранилище.Получить());
					СтруктураПередаваемыхПараметров.Вставить("СозданНаОсновании", ТекСсылка);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
					
					ТекТариф =  Тарификатор_сервер.СоздатьТарифПоПараметрам(2, "", СтруктураПередаваемыхПараметров);
					СписокТарифов.Добавить(ТекТариф);
					Сч = Сч + 1;//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
				КонецЦикла;
				Стр.СозданныйТариф = Новый ХранилищеЗначения(СписокТарифов);
				
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
			Иначе
 				ОбщегоНазначения.СообщитьПользователю("КТК экспорт. По строке " + ПСЦПоставщика_контейнерыЭкспорт.Индекс(Стр) + " тариф не создан. Нужно заполнить номенклатуру поставщика, ставку, ставку НДС.");
//Евросиб Гудкова)					
			КонецЕсли;
			
			
		КонецЦикла;
		
		Для каждого Стр из ПСЦПоставщика_автодоставка Цикл
			
			Если (ЗначениеЗаполнено(Стр.НоменклатураПоставщика1) ИЛИ ЗначениеЗаполнено(Стр.НоменклатураПоставщика)) И
				ЗначениеЗаполнено(Стр.Стоимость1) И
				ЗначениеЗаполнено(Стр.НДС1)
//Евросиб Гудкова( 10.02.2020 Ticket№ 0186614
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452				И Не ЗначениеЗаполнено(Стр.СозданныйТариф)
// Евросиб Гудкова) 			
				
				Тогда
				
				СтруктураПередаваемыхПараметров = Новый Структура;
				СтруктураПередаваемыхПараметров.Вставить("Услуга", Стр.Услуга);	
				СтруктураПередаваемыхПараметров.Вставить("Контрагент", Контрагент);
				СтруктураПередаваемыхПараметров.Вставить("Договор", Договор);
				СтруктураПередаваемыхПараметров.Вставить("Валюта", Валюта);
				СтруктураПередаваемыхПараметров.Вставить("НачалоДействия", ПСЦПоставщика_НачалоДействияСтавок);
				СтруктураПередаваемыхПараметров.Вставить("ОкончаниеДействия", ПСЦПоставщика_КонецДействияСтавок);
				СтруктураПередаваемыхПараметров.Вставить("НоменклатураПоставщика", Стр.НоменклатураПоставщика1);
				СтруктураПередаваемыхПараметров.Вставить("ТипКонтейнера", Стр.ТипКонтейнера1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияОтправления", Стр.ПунктНачалаПеревозки1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияНазначения", Стр.ПунктОкончанияПеревозки1);
				СтруктураПередаваемыхПараметров.Вставить("ПостановкаГрПор", Стр.ПостановкаГрПор1);
				СтруктураПередаваемыхПараметров.Вставить("Ставка", Стр.Стоимость1);
				СтруктураПередаваемыхПараметров.Вставить("НДС", Стр.НДС1);
				СтруктураПередаваемыхПараметров.Вставить("НормативПогрузки", Стр.НормаЗагрузки1);
				СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНП", Стр.СтоимостьПревышенияНормыЗагрузки1);
				СтруктураПередаваемыхПараметров.Вставить("НормативВремени", Стр.НормативВремениНаПогрузкуВыгрузку1);
				СтруктураПередаваемыхПараметров.Вставить("СтоимостьСНПВ", Стр.СтоимостьПревышенияНормыВремениНаПогрузкуВыгрузку1);
				СтруктураПередаваемыхПараметров.Вставить("Организация", Организация);
				СтруктураПередаваемыхПараметров.Вставить("Тариф", Стр.СозданныйТариф);
				СтруктураПередаваемыхПараметров.Вставить("СозданНаОсновании", ТекСсылка);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
				Если ЗначениеЗаполнено(Стр.НормативВремениНаПогрузкуВыгрузку1) И ЗначениеЗаполнено(Стр.СтоимостьПревышенияНормыВремениНаПогрузкуВыгрузку1) Тогда
					Стр.СозданныйТариф = Тарификатор_сервер.СоздатьТарифПоПараметрам(4, "", СтруктураПередаваемыхПараметров);
				Иначе
					Стр.СозданныйТариф = Тарификатор_сервер.СоздатьТарифПоПараметрам(3, "", СтруктураПередаваемыхПараметров);
				КонецЕсли;	
				
//Евросиб Гудкова( 06.09.2020 Ticket№ 0202979
			Иначе
 				ОбщегоНазначения.СообщитьПользователю("Автодоставка. По строке " + ПСЦПоставщика_автодоставка.Индекс(Стр) + " тариф не создан. Нужно заполнить номенклатуру поставщика, ставку, ставку НДС.");
//Евросиб Гудкова)					
			КонецЕсли;
			
			
		КонецЦикла;
		
		Для каждого Стр из ПСЦПоставщика_ТЭО Цикл
			
			Если (ЗначениеЗаполнено(Стр.НоменклатураПоставщика1) ИЛИ ЗначениеЗаполнено(Стр.Услуга)) И
				ЗначениеЗаполнено(Стр.Стоимость1) И
				ЗначениеЗаполнено(Стр.НДС1) 
//Евросиб Гудкова( 10.02.2020 Ticket№ 0186614
//Евросиб Гудкова( 29.07.2020 Ticket№ 0201452				И Не ЗначениеЗаполнено(Стр.СозданныйТариф)
// Евросиб Гудкова) 			
				
				Тогда
				
				СтруктураПередаваемыхПараметров = Новый Структура;
				СтруктураПередаваемыхПараметров.Вставить("Организация", Организация);
				СтруктураПередаваемыхПараметров.Вставить("Контрагент", Контрагент);
				СтруктураПередаваемыхПараметров.Вставить("Договор", Договор);
				СтруктураПередаваемыхПараметров.Вставить("Валюта", Валюта);
				СтруктураПередаваемыхПараметров.Вставить("НачалоДействия", ПСЦПоставщика_НачалоДействияСтавок);
				СтруктураПередаваемыхПараметров.Вставить("ОкончаниеДействия", ПСЦПоставщика_КонецДействияСтавок);
				
				СтруктураПередаваемыхПараметров.Вставить("НоменклатураПоставщика", Стр.НоменклатураПоставщика1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияОтправления", Стр.ПунктНачалаПеревозки1);
				СтруктураПередаваемыхПараметров.Вставить("СтанцияНазначения", Стр.ПунктОкончанияПеревозки1);
				СтруктураПередаваемыхПараметров.Вставить("ТипКонтейнера", Стр.ТипКонтейнера1);
				СтруктураПередаваемыхПараметров.Вставить("РазмерКТК", Стр.РазмерКонтейнера1);
				СтруктураПередаваемыхПараметров.Вставить("ПостановкаГрПор", ?(Стр.Груженый1, 1, 0));
				СтруктураПередаваемыхПараметров.Вставить("ЕИ", Стр.ЕдиницаИзмерения1);
				СтруктураПередаваемыхПараметров.Вставить("НДС", Стр.НДС1);
				СтруктураПередаваемыхПараметров.Вставить("Стоимость", Стр.Стоимость1);
				
				СтруктураПередаваемыхПараметров.Вставить("Груз", Стр.Груз);
				СтруктураПередаваемыхПараметров.Вставить("КлассОпасностиIMO", Стр.КлассОпасностиIMO);
				СтруктураПередаваемыхПараметров.Вставить("КлассОпасностиUN", Стр.КлассОпасностиUN);
				// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
				//ок(
				//СтруктураПередаваемыхПараметров.Вставить("СобственностьПеревозимогоКТК", Стр.СобственностьПеревозимогоКТК);
				//ок)
				СтруктураПередаваемыхПараметров.Вставить("УдалитьСобственностьПеревозимогоКТК", Стр.УдалитьСобственностьПеревозимогоКТК);
				СтруктураПередаваемыхПараметров.Вставить("ПринадлежностьТЕ", Стр.ПринадлежностьТЕ);
				// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
				СтруктураПередаваемыхПараметров.Вставить("КодТарифаЛинии", Стр.КодТарифаЛинии);
				СтруктураПередаваемыхПараметров.Вставить("УсловияПогрузки", Стр.УсловияПогрузки);
				СтруктураПередаваемыхПараметров.Вставить("УсловияВыгрузки", Стр.УсловияВыгрузки);
				СтруктураПередаваемыхПараметров.Вставить("Услуга", ?(ЗначениеЗаполнено(Стр.Услуга), Стр.Услуга, Стр.НоменклатураПоставщика1.Номенклатура));

				
				СтруктураПередаваемыхПараметров.Вставить("Кольцевой", Стр.КольцевойМаршрут1);
				СтруктураПередаваемыхПараметров.Вставить("ВидОтправки", Стр.ВидОтправки1);
				
				СтруктураПередаваемыхПараметров.Вставить("ДополнительныеУсловия", Стр.ДополнительныеУсловия);
				СтруктураПередаваемыхПараметров.Вставить("Примечания", Стр.Примечания);
				
				СтруктураПередаваемыхПараметров.Вставить("Тариф", Стр.СозданныйТариф);
				
				СтруктураПередаваемыхПараметров.Вставить("СозданНаОсновании", ТекСсылка);// ШейкоОЕ (25.08.2020 Ticket№ 0204488 Добавить реквизит "СозданНаОсновании" в справочник "ТарифыПоставщиков")
				
				Стр.СозданныйТариф = Тарификатор_сервер.СоздатьТарифПоПараметрам(5, "", СтруктураПередаваемыхПараметров);
				
			Иначе
 				ОбщегоНазначения.СообщитьПользователю("ТЭО. По строке " + ПСЦПоставщика_ТЭО.Индекс(Стр) + " тариф не создан. Нужно заполнить номенклатуру, ставку, ставку НДС.");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	// - Процедура создания тарифов поставщиков из ПСЦ поставщика
	
	Если ПСЦПоставщика_контейнерыВРП.Итог("Ставка1")>0 И НормативнаяСтавкаВСутки <> ПСЦПоставщика_контейнерыВРП.Итог("Ставка1") Тогда
		НормативнаяСтавкаВСутки = ПСЦПоставщика_контейнерыВРП.Итог("Ставка1");
	ИначеЕсли ПСЦПоставщика_контейнерыЭкспорт.Итог("Ставка1")>0 И НормативнаяСтавкаВСутки <> ПСЦПоставщика_контейнерыЭкспорт.Итог("Ставка1") Тогда
		НормативнаяСтавкаВСутки = ПСЦПоставщика_контейнерыЭкспорт.Итог("Ставка1");
	КонецЕсли;
	
	// SIV #0204734 Синхронизация статуса документа со статусами ТЧ Согласование
	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	СогласованиеСогласованСКомментариями = Ложь;
	
	//Субботин USER STORY 71755 26.06.2023 начало
	ПолучениеПодписанногоНевозможно = ложь;
	Если СтатусДокумента = перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно тогда
		ПолучениеПодписанногоНевозможно = истина
	КонецЕсли; 
	//Субботин USER STORY 71755 26.06.2023 конец
	
	
	//(Евросиб Максимова 29.03.2021 #0221151
	Если ЗначениеЗаполнено(ВидПСЦ) Тогда
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("Состояние",Справочники.Состояния.НайтиПоНаименованию("Прикрепить скан-копию подписанного с двух сторон договора"));
	ПараметрыОтбора.Вставить("Статус",Перечисления.СтатусыЭтапов.Выполнен);
	Строки_ПрикрепленСкан=Состояния.НайтиСтроки(ПараметрыОтбора);
	Если Строки_ПрикрепленСкан.Количество()<>0 Тогда
		ПодписанСДвухСторон=Истина;
	КонецЕсли;
	КонецЕсли;
	//)Евросиб Максимова 29.03.2021 #0221151  
	
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Начало: 22.11.2023  
	Если ПСЦПоставщика Тогда
		ИскомыеСостоянияПодписания = Новый Массив;
		ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПрикрепитьСканКопиюПодписанногоСДвухСторонПротокола);
		ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ);
		ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПереводПротоколаВподписан);
		
		Для каждого СтрСостояния Из Состояния Цикл
			Если СтрСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен 
				и ИскомыеСостоянияПодписания.Найти(СтрСостояния.Состояние) <> Неопределено Тогда
				ПодписанСДвухСторон = Истина;
			КонецЕсли;
		КонецЦикла;    
	КонецЕсли;
	// ДИТ US 64822 ТА 77071 Сержантова А.С. Конец: 22.11.2023
	
	Для каждого Стр из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование Тогда Продолжить; КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		//Евросиб Каблов 27.09.2020 ( Ticket#0208112
		//СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.СтатусСогласования <> Перечисления.СтатусыСогласования.Планируется И (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Или Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен);		
		//Евросиб Каблов 27.09.2020 )
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний; //Гудкова
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями; // SIV 19-05-21
		СогласованиеСогласованСКомментариями = СогласованиеСогласованСКомментариями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями; // SIV 19-05-21
		
		Если ПодписанСДвухСторон Тогда Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен; КонецЕсли; // SIV 22-12-2020
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда СтатусДокумента = Перечисления.СтатусыСогласования.Планируется; КонецЕсли;
		
	Если СогласованиеНачато = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении; КонецЕсли;
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями; //Гудкова ticket 0207847  СогласованоСЗамечаниями;
	//Евросиб - АСуслов 10.11.2021 11:48:37 #42012
	//(
	//ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСКомментариями = Истина Тогда СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями; // SIV 19-05-21
	//)
	//Евросиб - АСуслов 10.11.2021 11:48:38 #42012
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
	    //Евросиб - АСуслов 10.11.2021 11:50:46 #42012
		//(
	    Если СогласованиеСогласованСКомментариями = Истина Тогда
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями;	
		Иначе
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
		
		//)
		//Евросиб - АСуслов 10.11.2021 11:50:47 #42012
		//++ Зубов 0241136 24.08.2021
		Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
		//-- Зубов 0241136 24.08.2021
	//(Евросиб Максимова 31.03.2021 #0225197	
		//Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
	//)Евросиб Максимова 31.03.2021 #0225197	
	
		ДатаСогласования = ТекущаяДата();
			//Евросиб Каблов 02.02.2021 ( Ticket#0218844
			//МаксимальнаяДатаПодписанияСДвухСторон = ДобавитьМесяц(ДатаСогласования, 1);	//Евросиб Каблов 24.09.2020 Ticket#0205148
			//Евросиб Каблов 02.02.2021 )
	//(Евросиб Максимова 31.03.2021 #0225197	
        //  КонецЕсли;
	//)Евросиб Максимова 31.03.2021 #0225197	

		//Евросиб Каблов 02.02.2021 ( Ticket#0218844
		
	//(Евросиб Максимова 31.03.2021 #0225197	
		//Если Не ЗначениеЗаполнено(МаксимальнаяДатаПодписанияСДвухСторон) Тогда
	//)Евросиб Максимова 31.03.2021 #0225197
			//Евросиб Каблов 18.09.2023 ( Ticket#0324237
			//МаксимальнаяДатаПодписанияСДвухСторон = ДобавитьМесяц(ДатаСогласования, 1);
			//КоличествоМесяцевНаПодписаниеПСЦсДвухСторон = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КоличествоМесяцевНаПодписаниеПСЦсДвухСторон");
			//Если КоличествоМесяцевНаПодписаниеПСЦсДвухСторон > 0 Тогда
			//	МаксимальнаяДатаПодписанияСДвухСторон = ДобавитьМесяц(ДатаСогласования, КоличествоМесяцевНаПодписаниеПСЦсДвухСторон);
			//КонецЕсли;
			//Евросиб Каблов 18.09.2023 )
			//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
			Если НЕ Поручение Тогда
				КоличествоМесяцевНаПодписаниеПСЦсДвухСторон = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КоличествоМесяцевНаПодписаниеПСЦсДвухСторон");
				Если КоличествоМесяцевНаПодписаниеПСЦсДвухСторон > 0 Тогда
					МаксимальнаяДатаПодписанияСДвухСторон = ДобавитьМесяц(ДатаСогласования, КоличествоМесяцевНаПодписаниеПСЦсДвухСторон);
				КонецЕсли;
			Иначе	
				ПодписанСДвухСторон = Истина;
				СтатусДокумента = перечисления.СтатусыСогласования.Подписано;
				ДатаПереводаВСтатусПодписан = ДатаСогласования;
			КонецЕсли;
			//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец
		//КонецЕсли; 
		//Евросиб Каблов 02.02.2021 )
		//++ Зубов 0241136 24.08.2021
		КонецЕсли;
		//-- Зубов 0241136 24.08.2021
	КонецЕсли;	
	Если ПодписанСДвухСторон 
		//И СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний //Гудкова 07.10.2020
		Тогда СтатусДокумента = перечисления.СтатусыСогласования.Подписано;
		//Евросиб Каблов 25.02.2021 ( Ticket#0219441
		Если Не ЗначениеЗаполнено(ДатаПодписания) Тогда
			ДатаПодписания = ТекущаяДата();
		КонецЕсли;
		//Евросиб Каблов 25.02.2021 )
//Субботин USER STORY 71755 26.06.2023 начало
	Иначе 
		Если ПолучениеПодписанногоНевозможно и НЕ ПодписанСДвухСторон и СогласованиеЗавершено тогда 
			СтатусДокумента = перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно;
		КонецЕсли;
//Субботин USER STORY 71755 26.06.2023 начало	
	КонецЕсли;
	
//(Евросиб Максимова 07.04.2021 #0224834
Если СтатусДокумента= Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
	Строки_НаВыполнение=Состояния.НайтиСтроки(Новый Структура("Статус",Перечисления.СтатусыЭтапов.НаВыполнение));
	Если Строки_НаВыполнение.Количество()<>0 Тогда
	Строки_НаВыполнение[0].Статус=Перечисления.СтатусыЭтапов.Новый;
	КонецЕсли;
КонецЕсли;
//)Евросиб Максимова 07.04.2021 #0224834

//Евросиб Гудкова( 07.10.2020 Ticket№ 0209478
// + ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022 Вынесено в общий модуль
	СогласованиеСервер.ОбработатьОтменуСогласованияДокументаПередЗаписью(ЭтотОбъект);
	//Если Не ЭтоНовый() И СтатусДокумента = Перечисления.СтатусыСогласования.Планируется Тогда
	//	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Ссылка);
	//	Если ЗначениеЗаполнено(ТекПроцессСогл) Тогда
	//		ОбъектСогласования = ТекПроцессСогл.ПолучитьОбъект();
	//		ОбъектСогласования.УстановитьПометкуУдаления(Истина);
	//		//Евросиб Каблов 27.04.2021 ( Ticket#0229065
	//		ОбъектСогласования.СогласованиеЗавершено = Ложь;
	//		ОбъектСогласования.Записать();
	//		//Евросиб Каблов 27.04.2021 )
	//	КонецЕсли;
	//КонецЕсли;
// - ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022
// Евросиб Гудкова) 	
	
	// - SIV
	
	//Евросиб Каблов 01.06.2021 ( Ticket#0230304
	Если ПодписанСДвухСторон Тогда		
		Если ЭтоНовый() Тогда
			БылПодписанСДвухСторон = Ложь;
		Иначе
			БылПодписанСДвухСторон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПодписанСДвухСторон");		
		КонецЕсли;		
		Если Не БылПодписанСДвухСторон Тогда
			ДатаПереводаВСтатусПодписан = ТекущаяДата();
		КонецЕсли;		
	ИначеЕсли ЗначениеЗаполнено(ДатаПереводаВСтатусПодписан) Тогда
		ДатаПереводаВСтатусПодписан = '00010101';
	КонецЕсли;
	//Евросиб Каблов 01.06.2021 ) 
	
	// + SIV 20-09-23 уведомление по электронной почте для ПСЦ клиента при согласовании
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если ПСЦПоставщика = Ложь И УчетнаяЗаписьПоУмолчанию = Истина и Не ПодписанСДвухСторон И ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = Ложь Тогда
		
		АдресДублированияУведомлений = Константы.АдресДублированияОповещенийОЗадачах.Получить();
		ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		Для каждого Сост из Состояния Цикл
			
			Если Сост.Состояние.Согласование И (Сост.Статус = Перечисления.СтатусыЭтапов.Отклонен ИЛИ Сост.Статус = Перечисления.СтатусыЭтапов.НаВыполнение ИЛИ Сост.Статус = Перечисления.СтатусыЭтапов.ВРаботе) И Сост.Статус <> ПолучитьСтатусИзТЧ(Ссылка.Состояния, Сост.Состояние) Тогда
				
				ИнициаторСогласования = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ПроверкаРезультатовСогласования));
				Если ИнициаторСогласования.Количество() > 0 Тогда 
					ИнициаторСогласования = ИнициаторСогласования[0].Исполнитель;
				Иначе
					ИнициаторСогласования = Автор;
				КонецЕсли;
				
				ТемаПисьма = "[DC] Требуется согласование ПСЦ " + НомерПСЦ;
				СписокПолучателей = Новый Массив;
				
				Если Сост.Статус = Перечисления.СтатусыЭтапов.Отклонен Тогда
					СписокПолучателей.Добавить(ИнициаторСогласования);
					Замещающий = Пользователи_sd_сервер.ПодобратьЗамещение(ИнициаторСогласования, Дата);
					Если Замещающий <> ИнициаторСогласования Тогда СписокПолучателей.Добавить(Замещающий); КонецЕсли;
				КонецЕсли;
				
				Если ТипЗнч(Сост.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
					СписокПолучателей.Добавить(Сост.Исполнитель);
					Замещающий = Пользователи_sd_сервер.ПодобратьЗамещение(Сост.Исполнитель, Дата);
					Если Замещающий <> Сост.Исполнитель Тогда СписокПолучателей.Добавить(Замещающий); КонецЕсли;
				Иначе
					
					ПользователиГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Сост.Исполнитель, Дата, Ложь);
					Для каждого ПГ из ПользователиГруппы Цикл Если СписокПолучателей.Найти(ПГ) = неопределено Тогда СписокПолучателей.Добавить(ПГ); КонецЕсли; КонецЦикла;
					
				КонецЕсли;
				
				ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Ссылка)+""">"+ПолучитьНавигационнуюСсылку(Ссылка)+"</a>";
				
				ТекстПисьма = 	"Для протокола с клиентом " + НомерПСЦ + " требуется принять участие в согласовании. <br><br> <b>Согласующие:</b> " + Сост.Исполнитель + 
				                "<br><b>Клиент:</b> " + Контрагент + " <b>Договор:</b> " + Договор +
								"<br><b>Системный код:</b> " + Номер +
								"<br><b>Ссылка на документ:</b> " + ТекстНС;
				
				ПолучателиПисьма = Новый Массив;
		
				Если ЗначениеЗаполнено(АдресДублированияУведомлений) Тогда
					Для каждого Адрес из СтрРазделить(АдресДублированияУведомлений, ";", Ложь) Цикл
						ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Адрес));
					КонецЦикла;
				КонецЕсли;
				
				ПараметрыОтправкиПисьма = новый Структура;
				ПараметрыОтправкиПисьма.Вставить("Тема", ТемаПисьма);
				ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
				ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
				
				Для каждого СписокПолуч из СписокПолучателей Цикл
					
					EMAILПользователя = Пользователи_sd_сервер.ПолучитьEMAILПользователя(СписокПолуч);
					Если НЕ ЗначениеЗаполнено(EMAILПользователя) Тогда Продолжить; КонецЕсли;
					ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(СписокПолуч), EMAILПользователя));
					
				КонецЦикла;
				
				ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
				
				//a = 1;
				//РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// - SIV
	
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	
	//ДИТ Шевченко А.В. 59979 07.12.22 -начало
	Если ЗначениеЗаполнено(Договор) И НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Если ДействуетДоСогласованияНовыхУсловий Тогда
			ПроверитьДоговор = ЗначениеЗаполнено(НачалоДействия);
		Иначе
			ПроверитьДоговор = ЗначениеЗаполнено(НачалоДействия) и ЗначениеЗаполнено(ОкончаниеДействия);
		КонецЕсли;
		Если ПроверитьДоговор Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,НачалоДействия,ОкончаниеДействия,ДействуетДоСогласованияНовыхУсловий);
			Если НЕ ДоговорДействует Тогда
				Автопролонгация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Автопролонгация");
				Если НЕ Ссылка.Проведен Тогда
					Если Автопролонгация Тогда
						СообщениеТекст = "Проведение не выполнено, договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
					Иначе
						СообщениеТекст = "Проведение не выполнено, срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
					КонецЕсли;
					ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,,);
					РежимЗаписи = РежимЗаписиДокумента.Запись;                
					//ДИТ Шевченко А.В. 65173 09.02.2023 начало
					ДоговорОбъект = Договор.ПолучитьОбъект();
					СтруктураПоиска = Новый Структура();
					СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
					МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Договор",				Договор);
					СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
					СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
					мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
					
					Если ЗначениеЗаполнено(мОтветственныйЗаСопровождение) Тогда
						Если МассивСтрок.Количество() = 0 Тогда
							НСтр = ДоговорОбъект.Состояния.Добавить();
							НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
							НСтр.Исполнитель = мОтветственныйЗаСопровождение;
							НСтр.Наблюдатель = мОтветственныйЗаСопровождение;
							НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
							НСтр.НормативИсполненияСМоментаСоздания = 2;
						Иначе
							Если МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
								МассивСтрок[0].Исполнитель = мОтветственныйЗаСопровождение;
								МассивСтрок[0].Наблюдатель = мОтветственныйЗаСопровождение;
								МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
								МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
							КонецЕсли;
						КонецЕсли;		
						Попытка
							УстановитьПривилегированныйРежим(Истина);
							ДоговорОбъект.Записать();
							УстановитьПривилегированныйРежим(Ложь);
						Исключение
							ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Создание задачи на пролонгацию договора");
							ВызватьИсключение;
						КонецПопытки;
					КонецЕсли;
					//ДИТ Шевченко А.В. 65173 09.02.2023 конец
				КонецЕсли;
				Если Ссылка.Проведен Тогда
					Если Автопролонгация Тогда
						СообщениеТекст = "Договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
						//ДИТ Шевченко А.В. 65173 09.02.2023 начало
						ДоговорОбъект = Договор.ПолучитьОбъект();
						СтруктураПараметров = Новый Структура;
						СтруктураПараметров.Вставить("Договор",				Договор);
						СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
						СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
						мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
						
						// ДИТ 65173 Евсенкин М.А. Начало: 15.02.2023 // закрыл дыру для сдачи. нужно исправить.
						СтруктураПоиска = Новый Структура();
						СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
						МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
						// ДИТ 65173 Евсенкин М.А. Конец: 15.02.2023
												
						Если ЗначениеЗаполнено(мОтветственныйЗаСопровождение) Тогда
							Если МассивСтрок.Количество() = 0 Тогда
								НСтр = ДоговорОбъект.Состояния.Добавить();
								НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
								НСтр.Исполнитель = мОтветственныйЗаСопровождение;
								НСтр.Наблюдатель = мОтветственныйЗаСопровождение;
								НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
								НСтр.НормативИсполненияСМоментаСоздания = 2;
							Иначе
								Если МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
									МассивСтрок[0].Исполнитель = мОтветственныйЗаСопровождение;
									МассивСтрок[0].Наблюдатель = мОтветственныйЗаСопровождение;
									МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
									МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
								КонецЕсли;
							КонецЕсли;
							Попытка
								УстановитьПривилегированныйРежим(Истина);
								ДоговорОбъект.Записать();
								УстановитьПривилегированныйРежим(Ложь);
							Исключение
								ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Создание задачи на пролонгацию договора");
								ВызватьИсключение;
							КонецПопытки;
						КонецЕсли;
						//ДИТ Шевченко А.В. 65173 09.02.2023 конец
					Иначе
						СообщениеТекст = "Срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
					КонецЕсли;
					ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,,);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	//ДИТ Шевченко А.В. 59979 07.12.22 -конец  
	
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
	Если Не Отказ 
		И ПСЦПоставщика_автодоставка.Количество() > 0 
		И ПСЦПоставщика 
		//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
		//И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		//И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
		//	Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
		//	Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями) Тогда
		И ((НЕ Ссылка.ПометкаУдаления 
			И ПометкаУдаления)
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			ИЛИ СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
			ИЛИ СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями)) Тогда
		//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ТЛ);

		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзлыПланаОбмена[0]);
		СтруктураЗаписи.Вставить("Ссылка", Договор);
		
		КлючевыеПоляДляОбменаИзменены = Ложь;
		ДоговорСуществуетВТранспортнойЛогистике = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ЗаписьЕстьВРегистре(СтруктураЗаписи);
		Если ДоговорСуществуетВТранспортнойЛогистике Тогда
			КлючевыеПоляДляОбменаИзменены = Документы.ПСЦ.ПроверитьИзменениеКлючевыхПолейПСЦДляОбмена(ЭтотОбъект);
		КонецЕсли;
		Если КлючевыеПоляДляОбменаИзменены  Тогда
			ДополнительныеСвойства.Вставить("ЗарегистрироватьвОбмене");
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 16.04.2025 ))
	
	// ДИТ Ticket 115001 Дедуник Д.О. Начало: 17.07.2025
	//Евросиб Каблов 17.12.2025 ( Ticket#0426699
	//НеобходимаРегистрация = ПроверитьНеобходимостьРегистрации();
	НеобходимаРегистрация = Документы.ПСЦ.ПроверитьИзменениеКлючевыхПолейДляОбменаСДО(ЭтотОбъект);
	//Евросиб Каблов 17.12.2025 ) Ticket#0426699
	//Евросиб Каблов 15.08.2025 ( #115001 Регистрируем при записи
	//Если НеобходимаРегистрация Тогда
	//	ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ДО)
	//КонецЕсли;
	ДополнительныеСвойства.Вставить("ЗарегистрироватьДляПередачиВДО", НеобходимаРегистрация);
	//Евросиб Каблов 15.08.2025 ) #115001
	// ДИТ Ticket 115001 Дедуник Д.О. Конец: 17.07.2025
	
КонецПроцедуры

Функция ПолучитьСтатусИзТЧ(ИсточникТЧ, Состояние)
	
	Результат = неопределено;
	
	НайдСтроки = ИсточникТЧ.НайтиСтроки(Новый Структура("Состояние", Состояние));
	Если НайдСтроки.Количество() > 0 Тогда
		Результат = НайдСтроки[0].Статус;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;   
	
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 29.09.2023
	РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СтатусДокумента, ПометкаУдаления"); 
	Если (РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний 
		Или РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями) 
		и не РеквизитыПСЦ.ПометкаУдаления и не Отказ Тогда  
		МаршрутизацияСервер.ЗакрытьЗадачиСогласованияВСвязанныхКалькуляциях(Ссылка); 
	КонецЕсли;
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 29.09.2023
	
	// ДИТ US 64822 Сержантова А.С. Начало: 28.06.2023
	Если не Отказ Тогда	
		//Документы.ПСЦ.ОтправитьПСЦВДО(ЭтотОбъект);   // перенесено после записи на форму ДИТ BUG 85918 ТА 85919 Сержантова А.С. 27.05.2024
		// Рыбьяков К.А 13.05.2024 US 81613 Начало
		Документы.ПСЦ.ОтработкаДокументаБухгалтерией(Ссылка);
		// Рыбьяков К.А 13.05.2024 US 81613 конец
	КонецЕсли;
	// ДИТ US 64822 Сержантова А.С. Конец: 28.06.2023
	
	Если ДополнительныеСвойства.Свойство("ВызванИзЗаписиПС") Тогда
		Возврат;
	КонецЕсли; 
	// блок отработки родительского документа
	МассивСостояний = МаршрутизацияСервер.НайтиПолучитьМассивСостоянийДляОтметки(Состояния);
	МассивРодительскихДокументов = Новый Массив;
	Для Каждого Стр Из Калькуляции Цикл
		МассивРодительскихДокументов.Добавить(Стр.Калькуляция);
	КонецЦикла;
	МаршрутизацияСервер.ОтметитьВыполнениеРодительскогоДокументаАвтоматически(МассивРодительскихДокументов, МассивСостояний, Отказ);
	
	
//Евросиб Гудкова( 10.06.2021 Ticket№ 0232968
	//ТСхТекОбъекта = ПостроительТСх_сервер.ПолучитьТСхОбъекта(Ссылка);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	//               |	ТехнологическаяСхема.Вариант КАК Вариант,
	//               |	ТехнологическаяСхема.ТСх КАК ТСх
	//               |ИЗ
	//               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	//               |ГДЕ
	//               |	ТехнологическаяСхема.ПредметТСх В(&ПредметТСх)
	//               |	И НЕ ТехнологическаяСхема.ТСх.ПометкаУдаления";
	//ПредметТСх = Новый массив;
	//Для каждого Стр из Калькуляции Цикл
	//	ПредметТСх.Добавить(Стр.Калькуляция);
	//КонецЦикла;
	//Запрос.УстановитьПараметр("ПредметТСх", ПредметТСх);
	//Ответ = Запрос.Выполнить().Выбрать();
	//Пока Ответ.Следующий() Цикл
	//	НайденВариант = ложь;
	//	Для каждого Стр из ТСхТекОбъекта Цикл
	//		Если Стр.Вариант = "" + Ответ.Вариант + " _" + Ответ.ПредметТСх.Номер Тогда НайденВариант = Истина; КонецЕсли;
	//	КонецЦикла;
	//	Если НайденВариант Тогда Продолжить; КонецЕсли;
	//	
	//	КопияОбъекта = ПостроительТСх_сервер.СкопироватьТСх(Ответ.ТСх);
	//	//КопияОбъекта.Записать();
	//	МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
	//	МЗ.ПредметТСх = Ссылка;
	//	МЗ.ТСх = КопияОбъекта.Ссылка;
	//	МЗ.Вариант = "" + Ответ.Вариант + " _" + Ответ.ПредметТСх.Номер;
	//	МЗ.Записать(Истина);
	//КонецЦикла;
// Евросиб Гудкова) 	
	
	ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 29.09.2023
	//Если Ссылка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Или Ссылка.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями Тогда
	//	МаршрутизацияСервер.ЗакрытьЗадачиСогласованияВСвязанныхКалькуляциях(Ссылка); //ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023
	//КонецЕсли;   
	// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 29.09.2023
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	Если ДополнительныеСвойства.Свойство("ТранзитДляКлиента") Тогда
		Если ЗначениеЗаполнено(ДополнительныеСвойства.ТранзитДляКлиента) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьТранзитДляКлиентапоДокументу(Ссылка, ДополнительныеСвойства.ТранзитДляКлиента);
		Иначе
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УдалитьАналитикуДокумента(Ссылка, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента);
		КонецЕсли;
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
	Если Не Отказ И ДополнительныеСвойства.Свойство("ЗарегистрироватьвОбмене") Тогда 
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ТЛ);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 16.04.2025 ))
	
	//Евросиб Каблов 15.08.2025 ( #115001
	ЗарегистрироватьДляПередачиВДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЗарегистрироватьДляПередачиВДО", Ложь);
	Если Не Отказ И ЗарегистрироватьДляПередачиВДО Тогда 
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ДО);
	КонецЕсли;
	//Евросиб Каблов 15.08.2025 )
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Константы.МаршрутизироватьПСЦ.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
		
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	ПодписанСДвухСторон = Ложь;
	//++ Зубов 0239565 05.08.2021
	ДатаПолученияОригинала = '00010101';
	ДатаПереводаВСтатусПодписан = '00010101';
	//-- Зубов 0239565 05.08.2021
	ГородПодписания = Справочники.Локации.ПустаяСсылка();
	ДатаПодписания = '00010101';
	//Евросиб Гудкова( 30.03.2021 Ticket№ 0227963
	МаксимальнаяДатаПодписанияСДвухСторон = '00010101';
	ДатаСогласования = '00010101';
	НачалоДействия = '00010101';
	// Евросиб Гудкова)
	//++ Рыбьяков К.А, Ticket#83841, 22-04-2024 
	ДатаПСЦ = ТекущаяДата();
	//-- Рыбьяков К.А, Ticket#83841, 22-04-2024
	
	//Евросиб Коханенко Н.А. 03.10.2024 (( #90263
	НомерПСЦ = "";
	//Евросиб Коханенко Н.А. 03.10.2024 )) #90263
	
	//Евросиб Коханенко Н.А. 12.08.2025 (( #112567 
	РуководительКонтрагента = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	//Евросиб Коханенко Н.А. 12.08.2025 )) #112567 
	
	СписокТЧТарифов = Новый Массив;
	СписокТЧТарифов.Добавить("ПСЦПоставщика_вагоны");
	СписокТЧТарифов.Добавить("ПСЦПоставщика_контейнерыВРП");
	СписокТЧТарифов.Добавить("ПСЦПоставщика_контейнерыЭкспорт");
	СписокТЧТарифов.Добавить("ПСЦПоставщика_автодоставка");
	СписокТЧТарифов.Добавить("ПСЦПоставщика_ТЭО");
	Для каждого ТЧИмя из СписокТЧТарифов Цикл
		Для каждого Стр из ЭтотОбъект[ТЧИмя] Цикл
			
			Стр.СозданныйТариф = неопределено;
			
		КонецЦикла;
	КонецЦикла;
	СсылкаНаВнутреннийДокументДО = ""; 
	// Евросиб Фролов (08.11.2021 TASK №41432 
    ЗаполнитьОтветственногоМенеджера();
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 0238226 08.09.21. начало
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Евросиб Фролов (17.02.2022 Task №45918 
	// Для администратора разрешить удаление проведения при срабатывании проверки на наличие РТУ.
	// Евросиб Фролов (31.03.2022 Ticket №Ticket#0238226
	//Если Пользователи.ЭтоПолноправныйПользователь() Тогда
	Если Пользователи.ЭтоПолноправныйПользователь(,, Ложь) Тогда
	// Евросиб Фролов)
		Возврат;	
	КонецЕсли;		
	// Евросиб Фролов)
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СделкаДоходы.УчДокумент КАК УчДокумент
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.ПСЦ = &Ссылка
	|	И СделкаДоходы.УчДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И НЕ СделкаДоходы.УчДокумент.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Сообщить("По документу создан документ ""Реализация товаров и услуг"". Отмена проведения запрещена!");				
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 0238226 08.09.21. конец

Процедура ЗаполнитьОтветственногоМенеджера() Экспорт
	// Евросиб Фролов (08.11.2021 TASK №41432
	ОтветственныйМенеджер = Справочники.Пользователи.ПустаяСсылка();
	Если ЗначениеЗаполнено(Договор) И ЗначениеЗаполнено(ЦФО) Тогда
		
		ИмяРеквизита = "";
		Если ЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО Тогда
			ИмяРеквизита = "ОтветственныйЗаСопровождение";
		ИначеЕсли ЦФО = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
			ИмяРеквизита = "ОтветственныйЗаСопровождениеНСК";
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Возврат;
		КонецЕсли;	
		
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		// Было:
		//РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, ИмяРеквизита + ", " + ИмяРеквизита + ".Недействителен"); 
		//ОтветственныйДоговораНедействителен = РеквизитыДоговора[ИмяРеквизита + "Недействителен"];
		//ОтветственныйДоговора = РеквизитыДоговора[ИмяРеквизита];
		//Стало:
		//ОтветственныйДоговора = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(Договор,ИмяРеквизита);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор",				Договор);
		СтруктураПараметров.Вставить("ЦФО",					ЦФО);
		СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
		ОтветственныйДоговора = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтветственныйДоговора, "Недействителен");
		ОтветственныйДоговораНедействителен = РеквизитыДоговора.Недействителен;                                              
        // ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		Если ОтветственныйДоговораНедействителен = Ложь Тогда
			ОтветственныйМенеджер = ОтветственныйДоговора;
		КонецЕсли;
		
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Евросиб US 87896 Рыбьяков К.А. 18.07.2024 ((
	Если НЕ Нотис Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		ПроверяемыеРеквизиты.Добавить("Договор"); 
	//Евросиб Коханенко Н.А. 02.10.2024 (( #90263
	Иначе
		ПроверяемыеРеквизиты.Добавить("НаправлениеНотиса");
		
		//Евросиб Коханенко Н.А. 11.10.2024 (( #92915 
		//поле "ФорматПротокола" необязательное, его заполненность проверяется в ПередЗаписью в ФормеДокумента
		//ПроверяемыйРеквизитФорматПротокола = ПроверяемыеРеквизиты.Найти("ФорматПротокола");
		//Если ПроверяемыйРеквизитФорматПротокола <> Неопределено Тогда
    	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыйРеквизитФорматПротокола);
		//КонецЕсли;
		//Евросиб Коханенко Н.А. 11.10.2024 )) #92915 
	//Евросиб Коханенко Н.А. 02.10.2024 )) #90263
	
		//Евросиб Коханенко Н.А. 29.01.2025 (( #101330 
		ПроверяемыеРеквизиты.Добавить("ФорматНотиса");
		//Евросиб Коханенко Н.А. 29.01.2025 )) #101330 
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.07.2024 ))
	
	//Евросиб - АСуслов 22.12.2021 14:46:28 #
	//(
	Если НЕ ПСЦПоставщика 
		И НЕ ЗначениеЗаполнено(ТипКалькуляции) Тогда
		ТекстСообщения = "Не заполнен «Тип калькуляции»";

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
															ТекстСообщения,
															ЭтотОбъект,
															"ТипКалькуляции",
															,
															Отказ);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 22.12.2021 14:46:29 #          
	
	//Евросиб Коханенко Н.А. 26.01.2024 (( #80161
	СписокПроверяемыхПолей = Новый Массив;
	СписокПроверяемыхПолей.Добавить("ДатаПСЦ");   
	СписокПроверяемыхПолей.Добавить("ДатаПодписания");
	СписокПроверяемыхПолей.Добавить("НачалоДействия");
	СписокПроверяемыхПолей.Добавить("ОкончаниеДействия");
	СписокПроверяемыхПолей.Добавить("ДатаСогласования");
	Для Каждого ПроверяемоеПоле Из СписокПроверяемыхПолей Цикл
		ЗначениеПроверяемогоПоля = ЭтотОбъект[ПроверяемоеПоле];
		Если ЗначениеЗаполнено(ЗначениеПроверяемогоПоля)
			И ЗначениеПроверяемогоПоля < Дата("01.01.2019 00:00:00") Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(
					"В поле ""%1"" введены некорректные данные: дата не может быть ранее 01.01.2019г.",
					ПроверяемоеПоле
					),
				ЭтотОбъект, 
				ПроверяемоеПоле,
				, 
				Отказ);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Коханенко Н.А. 26.01.2024 )) #80161

	
	//++ Зубов 21.07.2021 ФТ 36970
	Если ПСЦПоставщика Тогда
		Если НЕ ЗначениеЗаполнено(КатегорияУслуг) Тогда
			Сообщить("Поле ""Категория услуг"" обязательно к заполнению!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(МестоОказанияУслуг) И КатегорияУслуг=Справочники.КатегорииУслуг.ПерваяПоследняяМиля Тогда //ПредопределенноеЗначение("Справочник.КатегорииУслуг.ПерваяПоследняяМиля") Тогда
			Сообщить("Поле ""Место оказания услуг"" обязательно к заполнению!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//-- Зубов 21.07.2021 ФТ 36970
	
	//++ Зубов US 36396 TA 43620 10.12.2021
	//НужноПроверятьСНП = Ложь;
	//Для каждого СтрокаКалькуляции из Калькуляции Цикл
	//	Если СтрокаКалькуляции.Калькуляция.веб_ДляКТКЕвросиб Тогда
	//		//НужноПроверятьСНП = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	НужноПроверятьСНП = ЕстьКалькуляцииДляКТКЕвросиб();
	
	//Если НужноПроверятьСНП И СтатусДокумента = Перечисления.СтатусыСогласования.Планируется И НЕ ПСЦПоставщика Тогда
	//	НужноПроверятьСНП = Истина;
	//Иначе
	//	НужноПроверятьСНП = Ложь;
	//КонецЕсли;
	
	//Евросиб Коханенко Н.А. 19.07.2024 (( #88390
	ЭтоСлужебныйПСЦ = (ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
						ИЛИ ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф) 
						И Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
	НужноПроверятьСНП = НужноПроверятьСНП И НЕ ЭтоСлужебныйПСЦ; 
	//Евросиб Коханенко Н.А. 19.07.2024 )) #88390
	
	//Евросиб - АСуслов 18.04.2023 10:55:30 #68936
	//(
	Если НужноПроверятьСНП 
		И Не ПСЦПоставщика 
		// ДИТ US 59973 Сержантова А.С. Начало: 12.09.2023  для ПСЦ по субсидии эта вкладка скрыта
		и не ФорматПротокола = Перечисления.ФорматПротокола.ПротоколДляПремий
		// ДИТ US 59973 Сержантова А.С. Конец: 12.09.2023
		И Создано >= '20230417'
		Тогда
		
		ПутьКДанным = "Объект";
		ИмяТабличнойЧасти = "СверхнормативноеПользование";
		
		Если Не ЗначениеЗаполнено(ВидПеревозки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не указан Вид перевозки",, "ВидПеревозки", "Объект", Отказ);
		КонецЕсли;
		
		ВидыПеревозкиБезОбязательногоСНП = Новый Массив;
		ВидыПеревозкиБезОбязательногоСНП.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская"));
		ВидыПеревозкиБезОбязательногоСНП.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
		Если ВидыПеревозкиБезОбязательногоСНП.Найти(ВидПеревозки) = Неопределено Тогда			
			Если СверхнормативноеПользование.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнены условия СНП во вкладке Сверхнормативы",, "СверхнормативноеПользование", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Стр Из СверхнормативноеПользование Цикл						
			ПроверитьСтрокуСверхнормативногоПользования(Стр, Отказ);					
		КонецЦикла;
		
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
	Отказ = ПроверкаСоответствияЗначенийРеквизитовПСЦЗаявкиКалькуляции(Отказ);
	//Евросиб Коханенко Н.А. 12.02.2026 )) #93365 

	//)
	//Евросиб - АСуслов 18.04.2023 10:55:32 #68936
	//НужноПроверятьСНП = 
	//
	//ЕстьСНПКонтейнеров = Ложь;
	//НезаполненыРеквизиты = Ложь;
	//ОшибкаЗаполненностиРеквизитов = "";
	//Если НужноПроверятьСНП Тогда
	//	Для каждого СтрокаСверхнорматива из СверхнормативноеПользование Цикл
	//		Если СтрокаСверхнорматива.Услуга = Справочники.Номенклатура.СНПКонтейнеров Тогда
	//			ОшибкаВСтроке = "";
	//			ЕстьСНПКонтейнеров = Истина;
	//			Если НЕ ЗначениеЗаполнено(СтрокаСверхнорматива.НормативныйСрок) Тогда
	//				Если ОшибкаВСтроке = "" Тогда
	//					ОшибкаВСтроке = "На закладке Сверхнормативы в строке "+СтрокаСверхнорматива.НомерСтроки+" не заполнены реквизиты: Нормативный срок";
	//				Иначе
	//					ОшибкаВСтроке = ОшибкаВСтроке+", Нормативный срок";
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если НЕ ЗначениеЗаполнено(СтрокаСверхнорматива.ТипКТК) Тогда
	//				Если ОшибкаВСтроке = "" Тогда
	//					ОшибкаВСтроке = "На закладке Сверхнормативы в строке "+СтрокаСверхнорматива.НомерСтроки+" не заполнены реквизиты: Тип КТК";
	//				Иначе
	//					ОшибкаВСтроке = ОшибкаВСтроке+", Тип КТК";
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если НЕ ЗначениеЗаполнено(СтрокаСверхнорматива.Валюта) Тогда
	//				Если ОшибкаВСтроке = "" Тогда
	//					ОшибкаВСтроке = "На закладке Сверхнормативы в строке "+СтрокаСверхнорматива.НомерСтроки+" не заполнены реквизиты: Валюта";
	//				Иначе
	//					ОшибкаВСтроке = ОшибкаВСтроке+", Валюта";
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если НЕ ЗначениеЗаполнено(СтрокаСверхнорматива.СтавкаНДС) Тогда
	//				Если ОшибкаВСтроке = "" Тогда
	//					ОшибкаВСтроке = "На закладке Сверхнормативы в строке "+СтрокаСверхнорматива.НомерСтроки+" не заполнены реквизиты: Ставка НДС";
	//				Иначе
	//					ОшибкаВСтроке = ОшибкаВСтроке+", Ставка НДС";
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если НЕ ЗначениеЗаполнено(СтрокаСверхнорматива.Ставка) Тогда
	//				Если ОшибкаВСтроке = "" Тогда
	//					ОшибкаВСтроке = "На закладке Сверхнормативы в строке "+СтрокаСверхнорматива.НомерСтроки+" не заполнены реквизиты: Ставка";
	//				Иначе
	//					ОшибкаВСтроке = ОшибкаВСтроке+", Ставка";
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//			Если НЕ ОшибкаВСтроке = "" Тогда
	//				ОшибкаЗаполненностиРеквизитов = ОшибкаЗаполненностиРеквизитов+ОшибкаВСтроке+Символы.ПС;
	//				НезаполненыРеквизиты = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//Если НужноПроверятьСНП Тогда
	//	Если НЕ ЕстьСНПКонтейнеров Тогда
	//		Сообщить("На закладке Сверхнормативы не введена ставка СНП контейнеров!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НезаполненыРеквизиты Тогда
	//		Сообщить(ОшибкаЗаполненностиРеквизитов);
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	////-- Зубов US 36396 TA 43620 10.12.2021
	
КонецПроцедуры 

Функция ЕстьКалькуляцииДляКТКЕвросиб()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПСЦКалькуляции.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция
	|ПОМЕСТИТЬ ВТ_КалькуляцииДляКТКЕвросиб
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КалькуляцииДляКТКЕвросиб.Калькуляция КАК Калькуляция
	|ИЗ
	|	ВТ_КалькуляцииДляКТКЕвросиб КАК ВТ_КалькуляцииДляКТКЕвросиб
	|ГДЕ
	|	ВТ_КалькуляцииДляКТКЕвросиб.Калькуляция.веб_ДляКТКЕвросиб
	//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
	|	И НЕ (ВТ_КалькуляцииДляКТКЕвросиб.Калькуляция.ТипКалькуляции В (&МРРасходы) И ВТ_КалькуляцииДляКТКЕвросиб.Калькуляция.Контрагент = &Контрагент)";
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПСЦ.Калькуляции", "&ПСЦКалькуляции");
	Запрос.УстановитьПараметр("ПСЦКалькуляции", Калькуляции.Выгрузить());
	//БИТ Белинский Д.А. 20.06.2023 -начало TASK 66201
    МРРасходы = Новый Массив;
	МРРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	МРРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("МРРасходы", МРРасходы);
	Запрос.УстановитьПараметр("Контрагент", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());
	//БИТ Белинский Д.А. 20.06.2023 -конец TASK 66201
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
		
КонецФункции


Процедура ПроверитьСтрокуСверхнормативногоПользования(Стр, Отказ)
	
	ИмяТабличнойЧасти = "СверхнормативноеПользование";
	ПутьКДанным = "Объект";
	
	Если Не ЗначениеЗаполнено(Стр.НормативныйСрок) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "НормативныйСрок");
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Нормативный срок во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.ТипКТК) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "ТипКТК");
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Тип КТК во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.Ставка) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "Ставка");
		ОбщегоНазначения.СообщитьПользователю("Не заполнена Ставка во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.Валюта) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "Валюта");
		ОбщегоНазначения.СообщитьПользователю("Не заполнена Валюта во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "СтавкаНДС");
		ОбщегоНазначения.СообщитьПользователю("Не заполнена Ставка НДС во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.ЕдиницаИзмеренияРасчетаСНП) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "ЕдиницаИзмеренияРасчетаСНП");
		ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Расчет СНП в"" во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.ВариантОпределенияДатыКурсаВалют) Тогда
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Стр.НомерСтроки, "ВариантОпределенияДатыКурсаВалют");
		ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Курс валюты на дату"" во вкладке Сверхнормативы",, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 23.01.2022 62514 Перенес из формы документа
Функция НайтиГотовыеКВыставлениюСтрокиВСделкахПоДанномуПСЦ(Протокол) Экспорт
	Если Не ЗначениеЗаполнено(Протокол) Тогда
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("МассивСделокГотовоКВыставлению", Новый Массив);
		СтруктураРезультата.Вставить("МассивСделокВыставленныеДокументы", Новый Массив);
		СтруктураРезультата.Вставить("АдресТаблицыСделокДляОбработки", ПоместитьВоВременноеХранилище(Неопределено ,Новый УникальныйИдентификатор)); 
		Возврат СтруктураРезультата;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы
	|ПОМЕСТИТЬ ВТ_СделкиПоПротоколу
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	|	И СделкаСвязьУчетныхЕдиниц.Протокол = &Протокол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление КАК Сделка
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ГотовоКВыставлению
	|	И НЕ ВТ_СделкиПоПротоколу.ДокументыСформированы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление КАК Сделка
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ДокументыСформированы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СделкиПоПротоколу.Ссылка КАК Сделка,
	|	ВТ_СделкиПоПротоколу.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ГотовоКВыставлению
	|	И НЕ ВТ_СделкиПоПротоколу.ДокументыСформированы";
	Запрос.УстановитьПараметр("Протокол", Протокол);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	МассивСделокГотовоКВыставлению = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Сделка");
	МассивСделокВыставленныеДокументы = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Сделка");
	ТаблицаСделокДляОбработки = РезультатЗапроса[3].Выгрузить();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("МассивСделокГотовоКВыставлению", МассивСделокГотовоКВыставлению);
	СтруктураРезультата.Вставить("МассивСделокВыставленныеДокументы", МассивСделокВыставленныеДокументы);
	СтруктураРезультата.Вставить("АдресТаблицыСделокДляОбработки", ПоместитьВоВременноеХранилище(ТаблицаСделокДляОбработки,Новый УникальныйИдентификатор));
	Возврат СтруктураРезультата;
	
КонецФункции

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов(ДокументСравнения, НомерДокументаСравнения, МассивРеквизитов)

	КоличествоРеквизитовБольшеОдного = МассивРеквизитов.Количество() > 1; 
	КоличествоРеквизитовРавноДва = МассивРеквизитов.Количество() = 2;
	ТекстСообщения = СтрШаблон("В %1 № %2 пол%3 %4 не совпада%5т с аналогичным%6 пол%3м%6 в протоколе. Необходимо внести изменения.", 
	ДокументСравнения,
	ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерДокументаСравнения),
		?(КоличествоРеквизитовБольшеОдного, "я", "е"),
		СтрСоединить(МассивРеквизитов, ?(КоличествоРеквизитовРавноДва, " и ", ", ")),
		?(КоличествоРеквизитовБольшеОдного, "ю", "е"),
		?(КоличествоРеквизитовБольшеОдного, "и", ""));
	Возврат ТекстСообщения;
	
КонецФункции 

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция ПроверкаСоответствияЗначенийРеквизитовПСЦЗаявкиКалькуляции(Отказ);
	
	ОтказРезультат = Отказ;
	
	//для начала найдем все модифицированные реквизиты
	ПроверяемыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Контрагент, Договор, Организация, ЦФО, ВидПеревозки, ТипКалькуляции, Валюта");
	ИзмененныеРеквизиты = Новый Массив;
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если ЭтотОбъект[Реквизит.Ключ] <> Реквизит.Значение Тогда
			Проверять = Истина;
		Иначе
			Проверять = Ложь;
		КонецЕсли;
		ИзмененныеРеквизиты.Добавить(Новый Структура("Проверять, Ключ, Значение", Проверять, Реквизит.Ключ, Реквизит.Значение));
	КонецЦикла;
	
	//если что-то из нашего списка менялось, то сравним с реквизитами в калькуляциях и заявках
	Если ИзмененныеРеквизиты.Количество() > 0 
		И НЕ Нотис Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Заявка.Ссылка КАК Ссылка,
			|	Заявка.Номер КАК Номер,
			|	Заявка.Контрагент КАК Контрагент,
			|	Заявка.Договор КАК Договор,
			|	Заявка.ВидПеревозки КАК ВидПеревозки
			|ПОМЕСТИТЬ вт_СвязанныеЗаявки
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
			|			И (Заявка.Проведен)
			|			И (ЗаявкаСоставУслуги.ПСЦ = &ПСЦ)
			|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДокументКалькуляция.Ссылка КАК Ссылка,
			|	ДокументКалькуляция.Номер КАК Номер,
			|	ДокументКалькуляция.Контрагент КАК Контрагент,
			|	ДокументКалькуляция.Договор КАК Договор,
			|	ДокументКалькуляция.Организация КАК Организация,
			|	ДокументКалькуляция.ЦФО КАК ЦФО,
			|	ДокументКалькуляция.ТипКалькуляции КАК ТипКалькуляции,
			|	ДокументКалькуляция.Валюта КАК Валюта
			|ПОМЕСТИТЬ вт_СвязанныеКалькуляции
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
			|		ПО ПСЦКалькуляции.Калькуляция = ДокументКалькуляция.Ссылка
			|			И (ДокументКалькуляция.Проведен)
			|			И (ПСЦКалькуляции.Ссылка = &ПСЦ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеЗаявки.Номер КАК Номер,
			|	&ПроверятьКонтрагент
			|		И вт_СвязанныеЗаявки.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор
			|		И вт_СвязанныеЗаявки.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьВидПеревозки
			|		И вт_СвязанныеЗаявки.ВидПеревозки <> &ВидПеревозки КАК ОшибкаВидПеревозки
			|ИЗ
			|	вт_СвязанныеЗаявки КАК вт_СвязанныеЗаявки
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеЗаявки.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеЗаявки.Договор <> &Договор
			|			ИЛИ &ПроверятьВидПеревозки
			|				И вт_СвязанныеЗаявки.ВидПеревозки <> &ВидПеревозки)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеКалькуляции.Номер КАК Номер,
			|	&ПроверятьКонтрагент
			|		И вт_СвязанныеКалькуляции.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор
			|		И вт_СвязанныеКалькуляции.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьОрганизация
			|		И вт_СвязанныеКалькуляции.Организация <> &Организация КАК ОшибкаОрганизация,
			|	&ПроверятьЦФО
			|		И вт_СвязанныеКалькуляции.ЦФО <> &ЦФО КАК ОшибкаЦФО,
			|	&ПроверятьТипКалькуляции
			|		И вт_СвязанныеКалькуляции.ТипКалькуляции <> &ТипКалькуляции КАК ОшибкаТипКалькуляции,
			|	&ПроверятьВалюта
			|		И вт_СвязанныеКалькуляции.Валюта <> &Валюта КАК ОшибкаВалюта
			|ИЗ
			|	вт_СвязанныеКалькуляции КАК вт_СвязанныеКалькуляции
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеКалькуляции.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеКалькуляции.Договор <> &Договор
			|			ИЛИ &ПроверятьОрганизация
			|				И вт_СвязанныеКалькуляции.Организация <> &Организация
			|			ИЛИ &ПроверятьЦФО
			|				И вт_СвязанныеКалькуляции.ЦФО <> &ЦФО
			|			ИЛИ &ПроверятьТипКалькуляции
			|				И вт_СвязанныеКалькуляции.ТипКалькуляции <> &ТипКалькуляции
			|			ИЛИ &ПроверятьВалюта
			|				И вт_СвязанныеКалькуляции.Валюта <> &Валюта)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер";
		
		Запрос.УстановитьПараметр("ПСЦ", Ссылка);
		Для Каждого Параметр Из ИзмененныеРеквизиты Цикл
			Запрос.УстановитьПараметр("Проверять" + Параметр.Ключ, Параметр.Проверять);
			Запрос.УстановитьПараметр(Параметр.Ключ, ЭтотОбъект[Параметр.Ключ]);
		КонецЦикла; 
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаЗаявки = Результат[2].Выбрать();
		Пока ВыборкаЗаявки.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаЗаявки.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаЗаявки.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаЗаявки.ОшибкаВидПеревозки Тогда МассивРеквизитов.Добавить("ВидПеревозки") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("Заявке", ВыборкаЗаявки.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла;   
		ВыборкаКалькуляции = Результат[3].Выбрать();
		Пока ВыборкаКалькуляции.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаКалькуляции.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаОрганизация Тогда МассивРеквизитов.Добавить("Организация") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаЦФО Тогда МассивРеквизитов.Добавить("ЦФО") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаТипКалькуляции Тогда МассивРеквизитов.Добавить("ТипКалькуляции") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаВалюта Тогда МассивРеквизитов.Добавить("Валюта") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("Калькуляции", ВыборкаКалькуляции.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат РезультатОтказ;

КонецФункции //Евросиб Коханенко Н.А. 12.02.2026 )) #93365 
