Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСверки";
	КомандаПечати.Представление = "Акт сверки";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;    
	
	// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Начало: 01.07.2024
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСверки_ВыводПаспортаСделки";
	КомандаПечати.Представление = "Акт сверки (выводить номер ПС)";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. Конец: 01.07.2024

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверки") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверки", "Акт сверки", НапечататьАктСверкиРИТМ(ЭлМассива));
		КонецЦикла;
		//Для каждого ЭлМассива из МассивОбъектов Цикл
		//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверки", "Акт сверки", НапечататьАктСверки(ЭлМассива));
		//КонецЦикла;
				
	КонецЕсли; 
	
	// Евросиб(ДИТ) US 86248 ТА 86254 Сержантова А.С. Начало: 01.07.2024
	Если  УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверки_ВыводПаспортаСделки") Тогда	
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			ВыводДоступен = ЭлМассива.ТипАктаСверки = Перечисления.ТипыАктовСверок.ПоОрганизацииИКонтрагенту_СчетФактуры;
			Если не ВыводДоступен Тогда   
				ОбщегоНазначения.СообщитьПользователю("Для данного варианта заполнения печатная форма не доступна");
			    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверки_ВыводПаспортаСделки", "Акт сверки", Новый ТабличныйДокумент);
				Продолжить;
			КонецЕсли;
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверки_ВыводПаспортаСделки", "Акт сверки", НапечататьАктСверкиРИТМ(ЭлМассива, Истина));
		КонецЦикла;
				
	КонецЕсли;
	// Евросиб(ДИТ) US 86248 ТА 86254 Сержантова А.С. Конец: 01.07.2024
	
КонецПроцедуры

// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. 01.07.2024 - добавлен параметр ВыводСтрокиПаспортаСделки
Функция НапечататьАктСверкиРИТМ(СсылкаНаОбъект, ВыводСтрокиПаспортаСделки = Ложь)
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("ПФ_MXL_АктСверки_РИТМ");
	
//Евросиб ( Литвинов 21.01.2021 #30025
	Наименования = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);
//Евросиб ) Литвинов 21.01.2021 #30025

	ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка.Параметры.НаименованиеКонтрагента = СсылкаНаОбъект.Контрагент.Наименование;
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьШапка.Параметры.НазваниеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименования.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	//Евросиб - АСуслов 20.11.2020 10:39:16 #
	//(
	ОбластьШапка.Параметры.Валюта = СсылкаНаОбъект.ВалютаДокумента.Наименование;
	//)
	//Евросиб - АСуслов 20.11.2020 10:39:16 #
//Евросиб Гудкова( 22.11.2020 Ticket№ 0212964  
Если ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента) Тогда    
		// Евросиб(ДИТ) US 86248 ТА 86254  Сержантова А.С. 01.07.2024 - добавлен параметр НомерПаспортаСделки
		ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект.ДоговорКонтрагента, "Номер, Дата, НомерПаспортаСделки");
		ОбластьШапка.Параметры.ПоДоговору = " №" + ПараметрыДоговора.Номер + " от " + Формат(ПараметрыДоговора.Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
// Евросиб Гудкова) 	
	Результат.Вывести(ОбластьШапка);
	
	ОстатокНаНачало = СсылкаНаОбъект.ОстатокНаНачало;
	Если ОстатокНаНачало <= 0 тогда
//Евросиб ( Литвинов 21.01.2021 #30025
		//ВЧьюПользу = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ВЧьюПользу = Наименования.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		СуммаСальдоНач = -ОстатокНаНачало;
	ИначеЕсли ОстатокНаНачало > 0 тогда
		ВЧьюПользу = СсылкаНаОбъект.Контрагент.Наименование;
		СуммаСальдоНач = ОстатокНаНачало;
	Иначе
		ВЧьюПользу = Неопределено;
	КонецЕсли;    
	
	// Евросиб(ДИТ) US 86248 ТА 86254 Сержантова А.С. Начало: 01.07.2024
	Если ВыводСтрокиПаспортаСделки и ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента) Тогда
		СтранаРегистрацииКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект.Контрагент, "СтранаРегистрации");
		Если СтранаРегистрацииКонтрагента = Справочники.СтраныМира.Россия Тогда
			ОбщегоНазначения.СообщитьПользователю("Печатная форма доступна только для нерезидентов");
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		ОбластьПС = Макет.ПолучитьОбласть("СтрокаПаспортаСделки");
		ОбластьПС.Параметры.НомерПаспортаСделки = ПараметрыДоговора.НомерПаспортаСделки;
		Результат.Вывести(ОбластьПС);
	КонецЕсли;	
	// Евросиб(ДИТ) US 86248 ТА 86254 Сержантова А.С. Конец: 01.07.2024
	
	Если НЕ ВЧьюПользу = Неопределено Тогда
		ОбластьСальдоВПользу = Макет.ПолучитьОбласть("СальдоВПользу");
		ОбластьСальдоВПользу.Параметры.НачалоПериода = Формат(СсылкаНаОбъект.ДатаНачала,"ДФ=dd.MM.yyyy");
		ОбластьСальдоВПользу.Параметры.СальдоВПользуОрганизации = ВЧьюПользу;
		ОбластьСальдоВПользу.Параметры.СуммаСальдо = СуммаСальдоНач;
		//Евросиб - АСуслов 20.11.2020 10:39:08 #
		//(
		ОбластьСальдоВПользу.Параметры.Валюта = СсылкаНаОбъект.ВалютаДокумента.Наименование;
		//)
		//Евросиб - АСуслов 20.11.2020 10:39:08 #
		Результат.Вывести(ОбластьСальдоВПользу);
	КонецЕсли;
		
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьМакета);
	
	ТЗПоТЧОрганизации = ПолучитьВыборкуПоДаннымОрганизацииРИТМ(СсылкаНаОбъект);
	Для Каждого Стр Из ТЗПоТЧОрганизации Цикл

		ОбластьСтрока = Макет.ПолучитьОбласть("Обороты");

		ОбластьСтрока.Параметры.Заполнить(Стр);

		Результат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ОбластьИтогОбороты = Макет.ПолучитьОбласть("ОборотыИтог");
	ОбластьИтогОбороты.Параметры.СуммаОборотДт = ТЗПоТЧОрганизации.Итог("СуммаОборотДт");
	ОбластьИтогОбороты.Параметры.СуммаОборотКт = ТЗПоТЧОрганизации.Итог("СуммаОборотКт");
	Результат.Вывести(ОбластьИтогОбороты);
	
	ОстатокНаКОнец = ОстатокНаНачало + ТЗПоТЧОрганизации.Итог("СуммаОборотДт") - ТЗПоТЧОрганизации.Итог("СуммаОборотКт");

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ДатаКон = ?(ЗначениеЗаполнено(СсылкаНаОбъект.ДатаОкончания),СсылкаНаОбъект.ДатаОкончания,ТекущаяДата());
	
	Если ОстатокНаКОнец <= 0 тогда
//Евросиб ( Литвинов 21.01.2021 #30025
		//ВЧьюПользу = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ВЧьюПользу = Наименования.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		СуммаСальдоКон = -ОстатокНаКОнец;
	ИначеЕсли ОстатокНаКОнец > 0 тогда
		ВЧьюПользу = СсылкаНаОбъект.Контрагент.Наименование;
		СуммаСальдоКон = ОстатокНаКОнец;
	Иначе
		ВЧьюПользу = Неопределено;
	КонецЕсли;
	
	Если НЕ ВЧьюПользу = Неопределено Тогда
		ОбластьПодвал.Параметры.РезультатыСверки = "Сальдо на " + Формат(ДатаКон,"ДФ=dd.MM.yyyy") + " в пользу " + ВЧьюПользу + " составляет " + СуммаСальдоКон + " "+СсылкаНаОбъект.ВалютаДокумента;
	КонецЕсли;
	
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьПодвал.Параметры.НазваниеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьПодвал.Параметры.НазваниеОрганизации = Наименования.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьПодвал.Параметры.ФИОПредставителя = СсылкаНаОбъект.ПредставительОрганизации.Наименование;
	ОбластьПодвал.Параметры.ГлБухОрганизации = СсылкаНаОбъект.Организация.ГлавныйБухгалтер.Наименование;
	ОбластьПодвал.Параметры.НаименованиеКонтрагента = СсылкаНаОбъект.Контрагент.Наименование;
	ОбластьПодвал.Параметры.ФИОПредставителяК = СсылкаНаОбъект.ПредставительКонтрагента.Наименование;
	Результат.Вывести(ОбластьПодвал);
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьАктСверки(СсылкаНаОбъект)
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("ПФ_MXL_АктСверки");
	
//Евросиб ( Литвинов 21.01.2021 #30025
	Наименования = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);
//Евросиб ) Литвинов 21.01.2021 #30025

	ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка.Параметры.ЗаПериод = " за период с " + Формат(СсылкаНаОбъект.ДатаНачала,"ДФ=dd.MM.yyyy")+" по "+Формат(СсылкаНаОбъект.ДатаОкончания,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НаименованиеКонтрагента = СсылкаНаОбъект.Контрагент.Наименование;
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьШапка.Параметры.НазваниеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименования.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента) Тогда
		ОбластьШапка.Параметры.ПоДоговору = " №"+СсылкаНаОбъект.ДоговорКонтрагента.Номер+" от "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;	
	ОбластьШапка.Параметры.ПредставительОрганизации = СсылкаНаОбъект.ПредставительОрганизации.Наименование;
	ОбластьШапка.Параметры.ПредставительКонтрагента = СсылкаНаОбъект.ПредставительКонтрагента.Наименование;
	ОбластьШапка.Параметры.ВалютаДокумента = СсылкаНаОбъект.ВалютаДокумента;
	
	Результат.Вывести(ОбластьШапка);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("НачОстатки");
	ОбластьМакета.Параметры.СуммаНачальныйОстатокДт = ?(СсылкаНаОбъект.ОстатокНаНачало > 0,СсылкаНаОбъект.ОстатокНаНачало,0);
	ОбластьМакета.Параметры.СуммаНачальныйОстатокКт = ?(СсылкаНаОбъект.ОстатокНаНачало < 0,-СсылкаНаОбъект.ОстатокНаНачало,0);
	Результат.Вывести(ОбластьМакета);
	
	ВыборкаПоТЧОрганизации = ПолучитьВыборкуПоДаннымОрганизации(СсылкаНаОбъект);
	ВыборкаПоТЧКонтрагент = ПолучитьВыборкуПоДаннымКонтрагента(СсылкаНаОбъект);
	ВыборкаПоДоговору = ВыборкаПоТЧОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОстаткиПоДоговору = ПолучитьОстаткиВРазрезеДоговоров(СсылкаНаОбъект);
	Пока ВыборкаПоДоговору.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Договор");
		ОбластьМакета.Параметры.Договор = ВыборкаПоДоговору.Договор; 
		Остаток = ОстаткиПоДоговору.Найти(ВыборкаПоДоговору.Договор,"Договор");
		Если Остаток <> Неопределено Тогда
			ОбластьМакета.Параметры.НачОстатокПоДоговоруДт =  ?(Остаток.СуммаСНДСОстаток>0,Остаток.СуммаСНДСОстаток,0);
			Областьмакета.Параметры.НачОстатокПоДоговоруКт = ?(Остаток.СуммаСНДСОстаток<0,-Остаток.СуммаСНДСОстаток,0);
			СуммаСНДСОстатокПоДоговору = Остаток.СуммаСНДСОстаток;
		Иначе
			СуммаСНДСОстатокПоДоговору = 0;
		КонецЕсли;
		Результат.Вывести(ОбластьМакета);
		ОборотДтОрг = 0;
		ОборотКтОрг = 0;
		ОборотДтКонтр = 0;
		ОборотКтКонтр = 0;
		ДетальныеЗаписи = ВыборкаПоДоговору.Выбрать();
		ОбластьСтрока = Макет.ПолучитьОбласть("Обороты");
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьСтрока.Параметры.Дата  = ДетальныеЗаписи.Дата;
			ОбластьСтрока.Параметры.Представление = ДетальныеЗаписи.Представление;
			ОбластьСтрока.Параметры.СуммаОборотДт = ДетальныеЗаписи.Дебет;
			ОбластьСтрока.Параметры.СуммаОборотКт  = ДетальныеЗаписи.Кредит;
			ОборотДтОрг = ОборотДтОрг + ДетальныеЗаписи.Дебет;
			ОборотКтОрг = ОборотКтОрг + ДетальныеЗаписи.Кредит;
			СтрокаКонтр = ВыборкаПоТЧКонтрагент.Найти(ДетальныеЗаписи.Документ,"Документ");
			Если СтрокаКонтр <> Неопределено Тогда
				ОбластьСтрока.Параметры.ДатаКонтр = СтрокаКонтр.Дата;
				ОбластьСтрока.Параметры.ПредставлениеКонтр = СтрокаКонтр.Представление;
				ОбластьСтрока.Параметры.СуммаОборотДтКонтр = СтрокаКонтр.Дебет;
				ОбластьСтрока.Параметры.СуммаОборотКтКонтр = СтрокаКонтр.Кредит;
				ОборотДтКонтр = ОборотДтКонтр+СтрокаКонтр.Дебет;
				ОборотКтКонтр = ОборотКтКонтр+СтрокаКонтр.Кредит;
			КонецЕсли;
			Результат.Вывести(ОбластьСтрока);
		КонецЦикла;	
		ОбластьИтогПоДоговору = Макет.ПолучитьОбласть("ДоговорИтоги");
		ОбластьИтогПоДоговору.Параметры.СуммаОборотДт = ОборотДтОрг;
		ОбластьИтогПоДоговору.Параметры.СуммаОборотКт =  ОборотКтОрг;
		ОбластьИтогПоДоговору.Параметры.СуммаОборотДтКонтр  = ОборотДтКонтр;
		ОбластьИтогПоДоговору.Параметры.СуммаОборотКтКонтр =  ОборотКтКонтр;
		ОбластьИтогПоДоговору.Параметры.КонОстатокПоДоговоруДт = ?(СуммаСНДСОстатокПоДоговору+ ОборотДтОрг-ОборотКтОрг>0,СуммаСНДСОстатокПоДоговору+ ОборотДтОрг-ОборотКтОрг,0);
		ОбластьИтогПоДоговору.Параметры.КонОстатокПоДоговоруКт = ?(СуммаСНДСОстатокПоДоговору+ ОборотКтКонтр-ОборотКтОрг<0,-(СуммаСНДСОстатокПоДоговору+ ОборотКтКонтр-ОборотКтОрг),0);
		ОбластьИтогПоДоговору.Параметры.КонОстатокПоДоговоруДтКонтр = ?(-СуммаСНДСОстатокПоДоговору + ОборотДтКонтр-ОборотКтКонтр>0,-СуммаСНДСОстатокПоДоговору + ОборотДтКонтр-ОборотКтКонтр,0);
		ОбластьИтогПоДоговору.Параметры.КонОстатокПоДоговоруКтКонтр = ?(-СуммаСНДСОстатокПоДоговору + ОборотДтКонтр-ОборотКтКонтр<0,-(-СуммаСНДСОстатокПоДоговору + ОборотДтКонтр-ОборотКтКонтр),0);
		Результат.Вывести(ОбластьИтогПоДоговору);
	КонецЦикла;
	ОбластьИтогОбороты = Макет.ПолучитьОбласть("ОборотыИтог");
	ОбластьИтогОбороты.Параметры.СуммаОборотДт = СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет");
	ОбластьИтогОбороты.Параметры.СуммаОборотКт = СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит");
	ОбластьИтогОбороты.Параметры.СуммаОборотДтКонтр = СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет");
	ОбластьИтогОбороты.Параметры.СуммаОборотКтКонтр = СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит");
	Результат.Вывести(ОбластьИтогОбороты);
	
	ОбластьКонОстатки = Макет.ПолучитьОбласть("КонОстатки");
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДт = ?((СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит"))>0, СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит"),0);
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКт = ?((СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит"))<0, СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит"),0);
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДтКонтр = ?((-СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит"))>0, -СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит"),0);
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКтКонтр = ?((-СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит"))<0, -(-СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит")),0);
	Результат.Вывести(ОбластьКонОстатки);
	ОстатокНаКОнец = СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымОрганизации.Итог("Кредит");
	ОстатокНаКонецКонтр = -СсылкаНаОбъект.ОстатокНаНачало+СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Дебет")-СсылкаНаОбъект.ПоДаннымКонтрагента.Итог("Кредит");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьПодвал.Параметры.НазваниеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьПодвал.Параметры.НазваниеОрганизации = Наименования.НаименованиеПолное;
	//РезльтатСверки = РезультатСверки(СсылкаНаОбъект, ОстатокНаКОнец, СсылкаНаОбъект.Организация.НаименованиеПолное, СсылкаНаОбъект.Контрагент.Наименование);
	РезльтатСверки = РезультатСверки(СсылкаНаОбъект, ОстатокНаКОнец, Наименования.НаименованиеПолное, СсылкаНаОбъект.Контрагент.Наименование);
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьПодвал.Параметры.РезультатыСверки  =РезльтатСверки;
	СуммаРасхождение = ?(СсылкаНаОбъект.Расхождение > 0, СсылкаНаОбъект.Расхождение, -СсылкаНаОбъект.Расхождение);
	ИтогСверки = СтрШаблон(НСтр("ru='В результате сверки выявлено расхождение информации о состоянии расчетов в размере %1 %2 %3'"),
				Формат(СуммаРасхождение, "ЧЦ=21; ЧДЦ=2"),
				Строка(СсылкаНаОбъект.ВалютаДокумента),
				БухгалтерскийУчетОбщиеПроцедурыСервер.ФорматироватьСуммуПрописьюПлатежногоДокумента(СуммаРасхождение, СсылкаНаОбъект.ВалютаДокумента, Ложь));
	
	ОбластьПодвал.Параметры.ИтогСверки = Символы.ПС + ИтогСверки + Символы.ПС + " ";
	ОбластьПодвал.Параметры.ФИОПредставителя = СсылкаНаОбъект.ПредставительОрганизации.Наименование;
	//ОбластьПодвал.Параметры.Должность
	ОбластьПодвал.Параметры.НаименованиеКонтрагента = СсылкаНаОбъект.Контрагент.Наименование;
//Евросиб ( Литвинов 21.01.2021 #30025
	//РезультатСверкиК = РезультатСверки(СсылкаНаОбъект, ОстатокНаКонецКонтр, СсылкаНаОбъект.Организация.НаименованиеПолное, СсылкаНаОбъект.Контрагент.Наименование);
	РезультатСверкиК = РезультатСверки(СсылкаНаОбъект, ОстатокНаКОнец, Наименования.НаименованиеПолное, СсылкаНаОбъект.Контрагент.Наименование);
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьПодвал.Параметры.РезультатыСверкиК  = РезультатСверкиК;
	//ОбластьПодвал.Параметры.ДолжностьК
	ОбластьПодвал.Параметры.ФИОПредставителяК =СсылкаНаОбъект.ПредставительКонтрагента.Наименование;
	Результат.Вывести(ОбластьПодвал);
	
	Возврат Результат;
	
	
	
КонецФункции

Функция РезультатСверки(Шапка,ОстатокНаКонец, Организация, Контрагент)
	ШаблонРезультатСверки = НСтр("ru='на [ДатаСверки] задолженность [Заключение].'");
	ПараметрыИтогСверки = Новый Структура;
	ПараметрыИтогСверки.Вставить("ДатаСверки", Формат(Шапка.ДатаОкончания, "ДЛФ=D"));
	ПараметрыИтогСверки.Вставить("Заключение", НСтр("ru='отсутствует'"));
	
	Если ОстатокНаКонец <> 0 Тогда
		ШаблонЗаключение = НСтр("ru='в пользу [Представитель] [СуммаЦифрами] [Валюта] ([СуммаПрописью])'");
		ПараметрыЗаключение = Новый Структура("Представитель, СуммаЦифрами, Валюта, СуммаПрописью");
		ПараметрыЗаключение.Валюта = Шапка.ВалютаДокумента;
		Если ОстатокНаКонец > 0 Тогда
			ПараметрыЗаключение.Представитель = Организация;
			Множитель = 1;
		Иначе
			ПараметрыЗаключение.Представитель = Контрагент;
			Множитель = -1;
		КонецЕсли;
		
		ПараметрыЗаключение.СуммаЦифрами = Формат(Множитель * ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2");
		ПараметрыЗаключение.СуммаПрописью = БухгалтерскийУчетОбщиеПроцедурыСервер.ФорматироватьСуммуПрописьюПлатежногоДокумента(
			Множитель * ОстатокНаКонец, Шапка.ВалютаДокумента, Ложь);
		
		ПараметрыИтогСверки.Заключение = 
			СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗаключение, ПараметрыЗаключение);
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонРезультатСверки, ПараметрыИтогСверки);
	
КонецФункции

Функция ПолучитьОстаткиВРазрезеДоговоров(Документ)
	Запрос = Новый Запрос;
	Если Документ.Контрагент.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Договор КАК Договор,
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент
		               |				И Организация = &Организация
		               |				И Договор В
		               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор
		               |					ИЗ
		               |						Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		               |					ГДЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка)) КАК ВзаиморасчетыСПоставщикамиОстатки
		               |ИТОГИ
		               |	СУММА(СуммаСНДСОстаток)
		               |ПО
		               |	Договор";
	ИначеЕсли Документ.Контрагент.ТипКонтрагента_Клиент Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
		               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент
		               |				И Организация = &Организация
		               |				И Договор В
		               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор
		               |					ИЗ
		               |						Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		               |					ГДЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка)) КАК ВзаиморасчетыСПокупателямиОстатки
		               |ИТОГИ
		               |	СУММА(СуммаСНДСОстаток)
		               |ПО
		               |	Договор";
	ИначеЕсли Документ.Контрагент.ТипКонтрагента_Клиент и Документ.Контрагент.ТипКонтрагента_Подрядчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
		               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент
		               |				И Организация = &Организация
		               |				И Договор В
		               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор
		               |					ИЗ
		               |						Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		               |					ГДЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка)) КАК ВзаиморасчетыСПокупателямиОстатки
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Договор,
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		               |			&НачалоПериода,
		               |			Контрагент = &Контрагент
		               |				И Организация = &Организация
		               |				И Договор В (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор
		               |					ИЗ
		               |						Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		               |					ГДЕ
		               |						АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка)) КАК ВзаиморасчетыСПоставщикамиОстатки
		               |ИТОГИ
		               |	СУММА(СуммаСНДСОстаток)
		               |ПО
		               |	Договор";
		
	КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("НачалоПериода", Документ.ДатаНачала);
		Запрос.УстановитьПараметр("Контрагент",Документ.Контрагент);
		Запрос.УстановитьПараметр("Организация",Документ.Организация);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Возврат Результат;
		

	КонецФункции
	
Функция ПолучитьВыборкуПоДаннымОрганизации(СсылкаНаОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК Дата,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК Дебет,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК Кредит
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	               |ГДЕ
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |ИТОГИ
	               |	СУММА(Дебет),
	               |	СУММА(Кредит)
	               |ПО
	               |	Договор";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьВыборкуПоДаннымКонтрагента(СсылкаНаОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК Дата,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК Дебет,
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК Кредит
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	               |ГДЕ
	               |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьВыборкуПоДаннымОрганизацииРИТМ(СсылкаНаОбъект)
	ЗапросКт = Новый Запрос;
	//ЗапросКт.Текст = "ВЫБРАТЬ
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	//                 //Евросиб Коханенко Н.А. 02.05.2023 (( #69486 
	//				 //|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК Дата,
	//                 |		ВЫБОР     
	//                 |			КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	//                 |				ТОГДА ВЫБОР 
	//                 |					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 7) = ""Продажа"" 
	//				 						//это РТУ
	//                 |						ТОГДА ВЫБОР
	//                 |							КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления >= ДАТАВРЕМЯ(2022, 1, 1)
	//                 |								ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления
	//                 |							КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления = ДАТАВРЕМЯ(1, 1, 1) 
	//				 								//поле дата составления не заполнено
	//                 |                              ТОГДА ВЫБОР
	//                 |                              	КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента МЕЖДУ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) И КОНЕЦПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 
	//                 |                              		ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента
	//                 |                              	ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 					 
	//                 |                              КОНЕЦ					 
	//                 |							ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 
	//                 |						КОНЕЦ
	//                 |					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 21) = ""Корректировка продажи""
	//                 |						ТОГДА ВЫБОР
	//                 |							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	//                 |								ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, """")
	//                 |							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	//                 |								ТОГДА ВЫБОР
	//                 |									КОГДА КорректировкаРеализацииПоКорректировке.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//                 |											И -КорректировкаРеализацииПоКорректировке.СуммаДокумента = АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит 
	//                 |										ТОГДА ЕСТЬNULL(КорректировкаРеализацииПоКорректировке.ПериодВО, """")
	//                 |									ИНАЧЕ ЕСТЬNULL(СчетФактураВыданный.ПериодВО, """")
	//                 |								КОНЕЦ
	//                 |							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//                 |							 	ТОГДА
	//                 //Евросиб Коханенко Н.А. 16.05.2023 (( #70138 
	//                 //|									ЕСТЬNULL(КорректировкаРеализации.ПериодВО, """")
	//                 |									ВЫБОР
	//				 |										КОГДА Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) //Контрагент не резидент
	//				 |											ТОГДА ЕСТЬNULL(КорректировкаРеализации.ДатаДокумента, """")
	//				 |										ИНАЧЕ
	//				 |											ЕСТЬNULL(КорректировкаРеализации.ПериодВО, """")
	//				 |								КОНЕЦ													
	//                 //Евросиб Коханенко Н.А. 16.05.2023 )) #70138 
	//                 |						КОНЕЦ
	//                 |					ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата
	//                 |				КОНЕЦ
	//                 |			ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата		
	//                 |		КОНЕЦ КАК Дата,
	//				 //Евросиб Коханенко Н.А. 02.05.2023 )) #69486 
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК Сумма,
	//                 |	0 КАК НомерПП
	//                 |ИЗ
	//                 |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	//                 //Евросиб Коханенко Н.А. 02.05.2023 (( #69486 
	//                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	//                 |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//                 |			ПО (КорректировкаРеализации.Ссылка = СчетФактураВыданный.ДокументОснование) И СчетФактураВыданный.Проведен
	//                 |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализацииПоКорректировке
	//                 |			ПО (КорректировкаРеализации.Ссылка = КорректировкаРеализацииПоКорректировке.ДокументРеализации)
	//                 //Евросиб Коханенко Н.А. 16.05.2023 (( #70138 
	//				 |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//		 		 |			ПО КорректировкаРеализации.Контрагент = Контрагенты.Ссылка
	//                 //Евросиб Коханенко Н.А. 16.05.2023 )) #70138 
	//                 |		ПО (АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ = КорректировкаРеализации.ДокументРеализации) И КорректировкаРеализации.Проведен 
	//				 //Евросиб Коханенко Н.А. 02.05.2023 )) #69486 
	//                 |ГДЕ
	//                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	//                 |	И АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет = 0
	//                 |
	//                 |УПОРЯДОЧИТЬ ПО
	//                 |	Дата";
	//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
	ЗапросКт.Текст = ПолучитьТекстЗапросаПоТЧ_ПоДаннымОрганизации( СсылкаНаОбъект );
	//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец

	ЗапросКт.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	ТЗ_Кт = ЗапросКт.Выполнить().Выгрузить();
	
	ЗапросДт = Новый Запрос;
	ЗапросДт.Текст = "ВЫБРАТЬ
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК Дата,
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК Сумма,
	                 |	0 КАК НомерПП, 
	                 |	""П/П"" КАК ТипПД
	                 |ИЗ
	                 |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	                 |ГДЕ
	                 |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	                 |	И АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит = 0
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	Дата";
	ЗапросДт.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	ТЗ_Дт = ЗапросДт.Выполнить().Выгрузить();
	
	НомерПП = 0;
	Для Каждого Стр Из ТЗ_Кт Цикл
		НомерПП = НомерПП + 1;
		Стр.НомерПП = НомерПП;
	КонецЦикла;
	
	НомерПП = 0;
	Для Каждого Стр Из ТЗ_Дт Цикл
		НомерПП = НомерПП + 1;
		Стр.НомерПП = НомерПП;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ1.НомерСтроки КАК НомерСтроки,
	               |	ВТ1.Договор КАК Договор,
	               |	ВТ1.Дата КАК Дата,
	               |	ВТ1.Документ КАК Документ,
	               |	ВТ1.Представление КАК Представление,
	               |	ВТ1.Сумма КАК Сумма,
	               |	ВТ1.НомерПП КАК НомерПП,
	               |	ВТ1.ТипПД КАК ТипПД
	               |ПОМЕСТИТЬ ВТ_Дебет
	               |ИЗ
	               |	&ВремТЧ1 КАК ВТ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.НомерСтроки КАК НомерСтроки,
	               |	ВТ2.Договор КАК Договор,
	               |	ВТ2.Дата КАК Дата,
	               |	ВТ2.Документ КАК Документ,
	               |	ВТ2.Представление КАК Представление,
	               |	ВТ2.Сумма КАК Сумма,
	               |	ВТ2.НомерПП КАК НомерПП
	               |ПОМЕСТИТЬ ВТ_Кредит
	               |ИЗ
	               |	&ВремТЧ2 КАК ВТ2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Дебет.Дата КАК ДатаЗачисления,
	               |	ВТ_Дебет.Представление КАК НомерПлПоруч,
	               |	ВТ_Дебет.Сумма КАК СуммаОборотДт,
	               |	ВТ_Дебет.ТипПД КАК ТипПД,
	               |	ЕСТЬNULL(ВТ_Дебет.НомерПП, ВТ_Кредит.НомерПП) КАК НомерПП,
				   //Евросиб СубботинВ # 25.11.2025 Начало
				  // |	ВТ_Кредит.Дата КАК ДатаСчета,
	               |	ЕСТЬNULL(ВТ_Дебет.Дата, ВТ_Кредит.Дата) КАК ДатаСчета,
				   //Евросиб СубботинВ # 25.11.2025 Конец
	               |	ВТ_Кредит.Представление КАК НомерСчета,
	               |	ВТ_Кредит.Сумма КАК СуммаОборотКт
	               |ИЗ
	               |	ВТ_Дебет КАК ВТ_Дебет
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Кредит КАК ВТ_Кредит
	               |		ПО ВТ_Дебет.НомерПП = ВТ_Кредит.НомерПП";
	
	Запрос.УстановитьПараметр("ВремТЧ1",ТЗ_Дт);
	Запрос.УстановитьПараметр("ВремТЧ2",ТЗ_Кт);
	ТЗ_Общая = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_Общая;
	
КонецФункции

//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
Функция ПолучитьТекстЗапросаПоТЧ_ПоДаннымОрганизации( СсылкаНаОбъект )
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	//Евросиб Коханенко Н.А. 02.05.2023 (( #69486 
	//|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК Дата,
	|		ВЫБОР     
	|			КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ВЫБОР 
	|					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 7) = ""Продажа"" 
	//это РТУ
	|						ТОГДА ВЫБОР
	|							КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления >= ДАТАВРЕМЯ(2022, 1, 1)
	|								ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления
	|							КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления = ДАТАВРЕМЯ(1, 1, 1) 
	//поле дата составления не заполнено
	|                              ТОГДА ВЫБОР
	|                              	КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента МЕЖДУ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) И КОНЕЦПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 
	|                              		ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента
	|                              	ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 					 
	|                              КОНЕЦ					 
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, Месяц) 
	|						КОНЕЦ
	|					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 21) = ""Корректировка продажи""
	|						ТОГДА ВЫБОР
	|							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|								ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, """")
	|							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|								ТОГДА ВЫБОР
	|									КОГДА КорректировкаРеализацииПоКорректировке.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|											И -КорректировкаРеализацииПоКорректировке.СуммаДокумента = АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит 
	|										ТОГДА ЕСТЬNULL(КорректировкаРеализацииПоКорректировке.ПериодВО, """")
	|									ИНАЧЕ ЕСТЬNULL(СчетФактураВыданный.ПериодВО, """")
	|								КОНЕЦ
	|							КОГДА КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|							 	ТОГДА
	//Евросиб Коханенко Н.А. 16.05.2023 (( #70138 
	//|									ЕСТЬNULL(КорректировкаРеализации.ПериодВО, """")
	|									ВЫБОР
	|										КОГДА Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) //Контрагент не резидент
	|											ТОГДА ЕСТЬNULL(КорректировкаРеализации.ДатаДокумента, """")
	|										ИНАЧЕ
	|											ЕСТЬNULL(КорректировкаРеализации.ПериодВО, """")
	|								КОНЕЦ													
	//Евросиб Коханенко Н.А. 16.05.2023 )) #70138 
	|						КОНЕЦ
	|					ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата
	|				КОНЕЦ
	|			ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата		
	|		КОНЕЦ КАК Дата,
	//Евросиб Коханенко Н.А. 02.05.2023 )) #69486
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК Сумма,
	|	0 КАК НомерПП
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	//Евросиб Коханенко Н.А. 02.05.2023 (( #69486 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|			ПО (КорректировкаРеализации.Ссылка = СчетФактураВыданный.ДокументОснование) И СчетФактураВыданный.Проведен
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализацииПоКорректировке
	|			ПО (КорректировкаРеализации.Ссылка = КорректировкаРеализацииПоКорректировке.ДокументРеализации)
	//Евросиб Коханенко Н.А. 16.05.2023 (( #70138 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО КорректировкаРеализации.Контрагент = Контрагенты.Ссылка
	//Евросиб Коханенко Н.А. 16.05.2023 )) #70138 
	|		ПО (АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ = КорректировкаРеализации.ДокументРеализации) И КорректировкаРеализации.Проведен 
	//Евросиб Коханенко Н.А. 02.05.2023 )) #69486 
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|	И АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
	Если ЗаполненаКолонкаДокументРегистратор( СсылкаНаОбъект ) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
		|	ВЫБОР
		|		КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА ВЫБОР
		|					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 7) = ""Продажа""
		|						ТОГДА ВЫБОР
		|								КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления >= ДАТАВРЕМЯ(2022, 1, 1)
		|									ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления
		|								КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаСоставления = ДАТАВРЕМЯ(1, 1, 1)
		|									ТОГДА ВЫБОР
		|											КОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента МЕЖДУ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, МЕСЯЦ) И КОНЕЦПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, МЕСЯЦ)
		|												ТОГДА АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ДатаДокумента
		|											ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, МЕСЯЦ)
		|										КОНЕЦ
		|								ИНАЧЕ НАЧАЛОПЕРИОДА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ.ПериодВО, МЕСЯЦ)
		|							КОНЕЦ
		|					КОГДА ПОДСТРОКА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление, 1, 21) = ""Корректировка продажи""
		|						ТОГДА ВЫБОР
		|								КОГДА КорректировкаРеализацииПоРегистратору.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
		|									ТОГДА ЕСТЬNULL(СчетФактураВыданный.ДатаДокумента, """")
		|								КОГДА КорректировкаРеализацииПоРегистратору.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
		|									ТОГДА ЕСТЬNULL(СчетФактураВыданный.ПериодВО, """")
		|								КОГДА КорректировкаРеализацииПоРегистратору.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		|									ТОГДА ВЫБОР
		|											КОГДА Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|												ТОГДА ЕСТЬNULL(КорректировкаРеализацииПоРегистратору.ДатаДокумента, """")
		|											ИНАЧЕ ЕСТЬNULL(КорректировкаРеализацииПоРегистратору.ПериодВО, """")
		|										КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата
		|				КОНЕЦ
		|		ИНАЧЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата
		|	КОНЕЦ КАК Дата,
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК Сумма,
		|	0 КАК НомерПП
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализацииПоРегистратору
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|			ПО (КорректировкаРеализацииПоРегистратору.Ссылка = СчетФактураВыданный.ДокументОснование) И СчетФактураВыданный.Проведен
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ПО КорректировкаРеализацииПоРегистратору.Контрагент = Контрагенты.Ссылка
		|		ПО (КорректировкаРеализацииПоРегистратору.Ссылка = АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор)
		|			И (КорректировкаРеализацииПоРегистратору.Проведен)
		|ГДЕ
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
		|	И АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции
//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, конец

//ДИТ, Беляев СЮ, Ticket#0323326, 01-09-2023, начало
Функция ЗаполненаКолонкаДокументРегистратор( СсылкаНаОбъект )
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор КАК ДокументРегистратор
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		|ГДЕ
		|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
		|	И АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//80515 Субботин 26.02.2024 начало 
Функция ПроверитьВозможностьПечатиАкта(ТаблицаДокументовИзАкта, ВызовИсключения = Ложь) Экспорт
	
	//Евросиб СубботинВ #119324 07.10.2025 Начало
	НоменклатурыБлокировкиПечатиРТУ = Константы.СписокНоменклатурыБлокировкиПечатиРТУ.Получить().Получить();
	//Евросиб СубботинВ #119324 07.10.2025 Конец	
	
	МассивШтрафныхАктов = Новый Массив;
	Для Каждого ДокументИзАкта Из ТаблицаДокументовИзАкта Цикл
		Если (ТипЗнч(ДокументИзАкта.Документ) = Тип("ДокументСсылка.СчетФактураВыданный")
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументИзАкта.Документ,"Штрафы",))
			или (ТипЗнч(ДокументИзАкта.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументИзАкта.Документ,"Штраф",)) Тогда
			Если ВызовИсключения Тогда
				ВызватьИсключение("В " + ДокументИзАкта.Документ + "  установлен признак Штраф. Недостаточно прав для выполнения операции.");
			КонецЕсли;	
			МассивШтрафныхАктов.Добавить(ДокументИзАкта.Документ); 
		КонецЕсли;
		//Евросиб СубботинВ #119324 07.10.2025 Начало
		Если ТипЗнч(ДокументИзАкта.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Услуги = ДокументИзАкта.Документ.Услуги.Выгрузить();
			Для Каждого СтрокаУслуг из Услуги Цикл
				Если НЕ НоменклатурыБлокировкиПечатиРТУ.НайтиПоЗначению(СтрокаУслуг.Номенклатура) = Неопределено Тогда
					Если МассивШтрафныхАктов.Найти(ДокументИзАкта.Документ) = Неопределено	Тогда 
						МассивШтрафныхАктов.Добавить(ДокументИзАкта.Документ);
					КонецЕсли;						
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;			
		//Евросиб СубботинВ #119324 07.10.2025 Конец		
	КонецЦикла;		
	Возврат МассивШтрафныхАктов
	
КонецФункции
//80515 Субботин 26.02.2024 Конец 
