
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь(); 
	Ответственный = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	удПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры
