
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	
	Для каждого Стр из ТЧ Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр из Параметры.ТЧ Цикл
		ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
	КонецЦикла;
	
	СписокОпераций.ЗагрузитьЗначения(Параметры.Операции);
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПеренестиВОперации(Команда)
	ПеренестиВОперацииНаСервере();
	Оповестить("ПеречитатьСхему");
	ПоказатьПредупреждение(, "Выполнено. Схема обновлена.");
КонецПроцедуры

&НаСервере
Процедура ПеренестиВОперацииНаСервере()
	
	Для каждого Стр из СписокОпераций Цикл
		ОО = Стр.Значение.ПолучитьОбъект();
		
		Если ОчищатьСодержимоеОпераций = 0 Тогда
			ОО.Грузы.Очистить();
		КонецЕсли;
		
		СопоставлениеТСиГУИД = Новый Соответствие;
		
		Для каждого Стр2 из ОО.Грузы Цикл
			Если СопоставлениеТСиГУИД.Получить(Стр2.ТС) = неопределено Тогда СопоставлениеТСиГУИД.Вставить(Стр2.ТС, Стр2.ТСГУИД); КонецЕсли;
		КонецЦикла;
		
		Для каждого Стр2 из ТЧ Цикл
			Если Стр2.Пометка Тогда
				
				Если ДобавлятьГрузыТолькоЕслиВКалькуляцииЕстьОперация = Истина И ЭтотВидОперацииЕстьВКалькуляции(Стр2.Калькуляция, Стр.Значение.Услуга) = Ложь Тогда Продолжить; КонецЕсли;
				
				НьюГУИД = Строка(Новый УникальныйИдентификатор);
				Если СопоставлениеТСиГУИД.Получить(Стр2.Вагон) <> неопределено Тогда 
					НьюГУИД = СопоставлениеТСиГУИД.Получить(Стр2.Вагон);
				Иначе
					НСтр = ОО.Грузы.Добавить();
					НСтр.ТСГУИД = НьюГУИД;
					НСтр.ТипТС = Стр2.Вагон.ТипТС;
					НСтр.ТС = Стр2.Вагон;
					НСтр.ГруженоеТС = Истина;
					НСтр.НомерЖДН = Стр2.ЖДН;
					СопоставлениеТСиГУИД.Вставить(Стр2.Вагон, НьюГУИД);
				КонецЕсли;
				
				НСтр = ОО.Грузы.Добавить();
				НСтр.ТСГУИД = НьюГУИД;
				НСтр.ТипТС = Стр2.Вагон.ТипТС;
				НСтр.ТС = Стр2.Вагон;
				НСтр.ГруженоеТС = Истина;
				НСтр.ТЕГУИД = Строка(Новый УникальныйИдентификатор);
				НСтр.ТипТЕ = Стр2.Контейнер.ТипТЕ;
				НСтр.ТЕ = Стр2.Контейнер;
				НСтр.ГруженоеТЕ = Истина;
				НСтр.НомерЖДН = Стр2.ЖДН;
				
			КонецЕсли;
		КонецЦикла;
		
		ОО.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтотВидОперацииЕстьВКалькуляции(Калькуляция, ВидОперации)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ТехнологическаяСхема.ТСх) КАК ТСх
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ТехнологическаяСхема.ТСх = ТехнологическаяСхемаТЧ.Ссылка
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх
	               |	И ТехнологическаяСхемаТЧ.Услуга = &Услуга";
	Запрос.УстановитьПараметр("ПредметТСх", Калькуляция);
	Запрос.УстановитьПараметр("Услуга", ВидОперации);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Если Ответ.ТСх <> NULL и Ответ.ТСх > 0 Тогда Результат = Истина; КонецЕсли;
		
	КонецЕсли;
	
	ИскомаяНоменклатура = ВидОперации.Номенклатура;
	
	Если Результат = Ложь И ЗначениеЗаполнено(ИскомаяНоменклатура) Тогда
		Для каждого Стр из Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки Цикл
			Если Стр.Услуга = ИскомаяНоменклатура Тогда Результат = Истина; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Результат = Ложь И СтрНайти(ВРег(ВидОперации.Наименование), "ФРАХТ") > 0 И Калькуляция.НФ_ВыбранныеСтавки.Количество() > 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
