#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СоздатьАтуальныеАкцепты(ТаблицаНЗП, АдресХранилища) Экспорт
	
	// Очистим колонку ошибок
	ТаблицаНЗП.ЗаполнитьЗначения("", "Ошибка");
		
	ТаблицаПоступлений = ТаблицаНЗП.Скопировать(, "ПТУ");
	ТаблицаПоступлений.Свернуть("ПТУ");
	
	Для Каждого СтрокаТаблицыПоступлений Из ТаблицаПоступлений Цикл
		
		МассивОшибок = Новый Массив;
		ПроверкиПройдены = Истина;
		Если Не ЗначениеЗаполнено(СтрокаТаблицыПоступлений.ПТУ) Тогда
			МассивОшибок.Добавить("Не указан ПТУ");
			ПроверкиПройдены = Ложь;
		КонецЕсли;	
		
		Если Не ПроверкиПройдены Тогда
			ПараметрыПоиска = Новый Структура();
			ПараметрыПоиска.Вставить("ПТУ", СтрокаТаблицыПоступлений.ПТУ);
			СтрокиПТУ = ТаблицаНЗП.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого ТекущаяСтрокаПТУ Из СтрокиПТУ Цикл
				ТекущаяСтрокаПТУ.Ошибка = СтрСоединить(МассивОшибок, ". ");
			КонецЦикла;
			
			Продолжить;
		КонецЕсли;	
		
		Попытка
			ДокОбъект = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(СтрокаТаблицыПоступлений.ПТУ, Ложь);
			Если Не ДокОбъект.ЭтоНовый() Тогда
				ПериодАкцепта = Мин(ДокОбъект.ПериодВО, ДокОбъект.ПериодБУ);
				ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(ДокОбъект, Истина, ПериодАкцепта);
			КонецЕсли;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ПараметрыПоиска = Новый Структура();
			ПараметрыПоиска.Вставить("ПТУ", СтрокаТаблицыПоступлений.ПТУ);
			СтрокиПТУ = ТаблицаНЗП.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого ТекущаяСтрокаПТУ Из СтрокиПТУ Цикл
				ТекущаяСтрокаПТУ.Ошибка = ТекстОшибки;
			КонецЦикла;
			
		КонецПопытки;
		
	КонецЦикла; 
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаНЗП", ТаблицаНЗП);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли