#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация 		= Константы.ОсновнаяОрганизация.Получить();
	Создано 			= ТекущаяДатаСеанса();
	Автор 				= Пользователи.ТекущийПользователь();
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодБлокировки 	= Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
	ПериодБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ(Организация);
	//Евросиб Каблов 09.04.2025 ( #105407	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Не ЭтоНовый() Тогда
   		Изменено = ТекущаяДатаСеанса();
		Редактор = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Евросиб Каблов 09.04.2025 ( #105407
		//ДатаПериодаЗагрузкиОДВУПП = НачалоМесяца(Константы.ДатаПериодаЗагрузкиОДВУПП.Получить());
		ОткрытыйПериодБУ = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ(Организация);
		//Евросиб Каблов 09.04.2025 ( #105407
		
		Если ЗакрытиеПериодаБУ Тогда
			
			//Евросиб Каблов 09.04.2025 ( #105407
			Если ОткрытыйПериодБУ > ПериодБлокировки Тогда
			//Евросиб Каблов 09.04.2025 )
			
				ШаблонСообщения = НСтр("ru = 'Текущий закрытый период %1 больше выбранного в документе %2.
				                	|Исправьте закрываемый период или снимите галку ""Закрытие периода БУ"".'");
				
				//Евросиб Каблов 09.04.2025 ( #105407
				//ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(ДатаПериодаЗагрузкиОДВУПП, "ДФ='MMMM yyyy ""г.""'"), Формат(ПериодБлокировки, "ДФ='MMMM yyyy ""г.""'"));
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(ОткрытыйПериодБУ, "ДФ='MMMM yyyy ""г.""'"), Формат(ПериодБлокировки, "ДФ='MMMM yyyy ""г.""'"));
				//Евросиб Каблов 09.04.2025 )

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
															ТекстСообщения,
															ЭтотОбъект,
															"ЗакрытиеПериодаБУ",
															,
															Отказ);
			//Евросиб Каблов 09.04.2025 ( #105407
			//ИначеЕсли ДатаПериодаЗагрузкиОДВУПП < ПериодБлокировки Тогда
			ИначеЕсли ОткрытыйПериодБУ < ПериодБлокировки Тогда
			//Евросиб Каблов 09.04.2025 )
				// Если период блокировки указнный в документе превышает период указанный в константе более,
				// чем на 1 месяц, то блокируем проведение
				// (чтобы нельзя было случайно поставить январь, перепрыгнув через полгода, а потом не иметь
				// возможности откатиться, т.к. отмена проведения ставит закрытым периодом декабрь.
				ШаблонСообщения = НСтр("ru = 'Нельзя закрыть период %1, т.к. не закрыт период %2.
                                            |Закрытый период БУ: %3.'");
						
				ТекстСообщения = СтрШаблон(ШаблонСообщения,
											Формат(ПериодБлокировки, "ДФ='MMMM yyyy ""г.""'"),
											Формат(ДобавитьМесяц(ПериодБлокировки, -1), "ДФ='MMMM yyyy ""г.""'"),
											//Евросиб Каблов 09.04.2025 ( #105407
											//Формат(ДобавитьМесяц(ДатаПериодаЗагрузкиОДВУПП, -1), "ДФ='MMMM yyyy ""г.""'"));
											Формат(ДобавитьМесяц(ОткрытыйПериодБУ, -1), "ДФ='MMMM yyyy ""г.""'"));
											//Евросиб Каблов 09.04.2025 )
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
																ТекстСообщения,
																ЭтотОбъект,
																"ЗакрытиеПериодаБУ",
																,
																Отказ);
			КонецЕсли;												
			
		КонецЕсли;
													
		// Если "ЗакрытиеНЗППредыдущихПериодов" и таб. часть "НЗППредыдущихПериодов" пустая, то не проводим
		Если ЗакрытиеНЗППредыдущихПериодов Тогда
			Если НЗППредыдущихПериодов.Количество() = 0 Тогда
			
				ТекстСообщения = НСтр("ru = 'Заполните таблицу ""НЗП предыдущих периодов"" или снимите галку ""Закрытие НЗП предыдущих периодов""'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
														ТекстСообщения,
														ЭтотОбъект,
														"ЗакрытиеНЗППредыдущихПериодов",
														,
														Отказ);
			Иначе
				Если Не АкцептыДозаполнены Тогда
					ТекстСообщения = "По указанным в документе ПТУ необходимо создать актуальные акцепты (кнопка ""Создать актуальные акцепты"")";
				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
														ТекстСообщения,
														ЭтотОбъект,
														"НЗППредыдущихПериодов",
														,
														Отказ);
				КонецЕсли;											
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВключитьРассылку Тогда
		//Евросиб Каблов 09.04.2025 ( #105407
		//ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка,, Ложь);
		ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Ложь, "БУ");
		//Евросиб Каблов 09.04.2025 )		
	КонецЕсли;
	
	Если ЗакрытиеПериодаБУ И Не Отказ Тогда
		//Евросиб Каблов 09.04.2025 ( #105407
		//ДатаПериодаЗагрузкиОДВУПП = Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
		////Если ДатаПериодаЗагрузкиОДВУПП < ПериодБлокировки Тогда
		//Если ДатаПериодаЗагрузкиОДВУПП = ПериодБлокировки Тогда
		//	// При проведении значение константы ставится первое число следующего месяца,
		//	// т.е. если закрываем октябрь, то устанавливаем в константу 1 ноября.
		//	Константы.ДатаПериодаЗагрузкиОДВУПП.Установить(ДобавитьМесяц(ПериодБлокировки, 1));
		//КонецЕсли;
		Движения.ЗакрытыеПериодыБУ.Записывать = Истина;	
		Движение = Движения.ЗакрытыеПериодыБУ.Добавить();
		Движение.Период = ПериодБлокировки;
		Движение.Организация = Организация;
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли;	
	
	Если ВключитьРассылку Тогда
		//Евросиб Каблов 09.04.2025 ( #105407
		//ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Истина, Ложь);
		ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Истина, "БУ");
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//// При отмене проведения ставится первое число из реквизита "Период блокировки",
	//// но только если текущее значение константы = следующий месяц
	//ДатаПериодаЗагрузкиОДВУПП = Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
	//Если ЗакрытиеПериодаБУ
	//	//И ДатаПериодаЗагрузкиОДВУПП = ПериодБлокировки Тогда
	//	И ДатаПериодаЗагрузкиОДВУПП = ДобавитьМесяц(ПериодБлокировки, 1) Тогда
	//	//Константы.ДатаПериодаЗагрузкиОДВУПП.Установить(ДобавитьМесяц(ПериодБлокировки, -1));
	//	Константы.ДатаПериодаЗагрузкиОДВУПП.Установить(ПериодБлокировки);
	//КонецЕсли;
	//Евросиб Каблов 09.04.2025 )
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти