
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сделка = Параметры.Сделка;
	НомСтр = 1;
	ТЧДоходы = Сделка.Доходы.Выгрузить();
	Для каждого Стр из ТЧДоходы Цикл
		Если Не Стр.Перевыставляемая Тогда
			НовСтр = Доходы.Добавить();
			НовСтр.НомерСтроки = НомСтр;
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			НовСтр.СебестоимостьПосле = Стр.Себестоимость;
			НовСтр.ВознаграждениеПосле = Стр.Вознаграждение;
			НовСтр.ВалютаПосле = Стр.Валюта;
			НовСтр.СтавкаПосле = Стр.Ставка;
			НовСтр.КоличествоПосле  = Стр.Количество;
			НовСтр.СебестоимостьИтогоПосле = Стр.Себестоимость;
			НовСтр.ВознаграждениеИтогоПосле = Стр.Вознаграждение;
			НовСтр.СтавкаИтогоПосле = Стр.СтавкаИтого;
			НовСтр.СтавкаНДСПосле =  Стр.СтавкаНДС;
			НовСтр.СуммаНДСПосле = Стр.СуммаНДС;
			НовСтр.СуммаИтогоПосле  =  Стр.СуммаИтого;
			НовСтр.ПеревыставляемаяПосле  =  Стр.Перевыставляемая;
			ДокКор = НайтиДокКорректировки(СТр.УчДокумент,Сделка);
			Если ДокКор <> Неопределено Тогда
				НовСтр.ДокументКорректировки = ДокКор;
			КонецЕсли;
			Если ЗначениеЗаполнено(НовСтр.ДокументКорректировки) Тогда
				СтрКорректировки = ДокКор.Услуги.Найти(НовСтр.ГУИД,"СтрокаДоходовСделки");
				Если СтрКорректировки <> Неопределено Тогда
					
					НовСтр.СтавкаПосле = СтрКорректировки.Цена;
					НовСтр.КоличествоПосле  = СтрКорректировки.Количество;
					НовСтр.СтавкаИтогоПосле = СтрКорректировки.Сумма;
					НовСтр.СтавкаНДСПосле =  СтрКорректировки.СтавкаНДС;
					НовСтр.СуммаНДСПосле = СтрКорректировки.СуммаНДС;
					НовСтр.СуммаИтогоПосле = НовСтр.СтавкаИтогоПосле + ?(НовСтр.НДСВключенВСтоимость, 0, НовСтр.СуммаНДСПосле);
					
					
				КонецЕсли;
				ПересчитатьСуммы();
			КонецЕсли;	
			НовСтр.СебестоимостьПослеИзм = НовСтр.СебестоимостьПосле;
			НовСтр.ВознаграждениеПослеИзм = НовСтр.ВознаграждениеПосле;
			НовСтр.ВалютаПослеИзм = НовСтр.ВалютаПосле;
			НовСтр.СтавкаПослеИзм = НовСтр.СтавкаПосле;
			НовСтр.КоличествоПослеИзм  = НовСтр.КоличествоПосле;
			НовСтр.СебестоимостьИтогоПослеИЗм = НовСтр.СебестоимостьПосле;
			НовСтр.ВознаграждениеИтогоПослеИзм = НовСтр.ВознаграждениеПосле;
			НовСтр.СтавкаИтогоПослеИзм = НовСтр.СтавкаИтогоПосле;
			НовСтр.СтавкаНДСПослеИзм =  НовСтр.СтавкаНДСПосле;
			НовСтр.СуммаНДСПослеИзм = НовСтр.СуммаНДСПосле;
			НовСтр.СуммаИтогоПослеИзм  =  НовСтр.СуммаИтогоПосле;
			
		КонецЕсли;
		НомСтр = НомСтр+1;
	КонецЦикла;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Функция НайтиДокКорректировки(УчДокумент,СделкаДок)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КорректировкаРеализации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	                      |ГДЕ
	                      |	КорректировкаРеализации.ИсходныйДокументРеализации = &ДокументРеализации
	                      |	И КорректировкаРеализации.Сделка = &Сделка
	                      |	И КорректировкаРеализации.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КорректировкаРеализации.Дата УБЫВ");
	Запрос.УстановитьПараметр("ДокументРеализации",УчДокумент);
	Запрос.УстановитьПараметр("Сделка" ,Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)
	ТекД = Элементы.Доходы.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.СтавкаПосле				= ТекД.СебестоимостьПосле + ТекД.ВознаграждениеПосле;

		ТекД.СебестоимостьИтогоПосле 	= ТекД.КоличествоПосле * ТекД.СебестоимостьПосле;
		ТекД.ВознаграждениеИтогоПосле 	= ТекД.КоличествоПосле * ТекД.ВознаграждениеПосле;
		ТекД.СтавкаИтогоПосле 			= ТекД.КоличествоПосле * ТекД.СтавкаПосле;
		
		ТекД.СуммаНДСПосле = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекД.СтавкаИтогоПосле, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДСПосле), Истина, ТекД.НДСВключенВСтоимость);
		
		ТекД.СуммаИтогоПосле = ТекД.СтавкаИтогоПосле + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДСПосле);
		
		ТекД.СтавкаПослеИзм				= ТекД.СебестоимостьПослеИзм + ТекД.ВознаграждениеПослеИзм;

		ТекД.СебестоимостьИтогоПослеИзм 	= ТекД.КоличествоПослеИзм * ТекД.СебестоимостьПослеИзм;
		ТекД.ВознаграждениеИтогоПослеИзм 	= ТекД.КоличествоПослеИзм * ТекД.ВознаграждениеПослеИзм;
		ТекД.СтавкаИтогоПослеИзм 			= ТекД.КоличествоПослеИзм * ТекД.СтавкаПослеИзм;
		
		ТекД.СуммаНДСПослеИзм = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекД.СтавкаИтогоПослеИзм, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДСПослеИзм), Истина, ТекД.НДСВключенВСтоимость);
		
		ТекД.СуммаИтогоПослеИзм = ТекД.СтавкаИтогоПослеИзм + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДСПослеИзм);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммы()
	Для каждого Стр из Доходы Цикл
		Стр.СебестоимостьПосле  = Стр.СтавкаПосле - Стр.ВознаграждениеПосле;
		Стр.СебестоимостьИтогоПосле 	= Стр.КоличествоПосле * Стр.СебестоимостьПосле;
		Стр.ВознаграждениеИтогоПосле 	= Стр.КоличествоПосле * Стр.ВознаграждениеПосле;
		Стр.СтавкаИтогоПосле 			= Стр.КоличествоПосле * Стр.СтавкаПосле;
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыКорректировки(Команда)
	
	МассивКорректировок = СоздатьКорректировкиНаСервере();	
	Для каждого Эл из МассивКорректировок Цикл
		ГУИДСтроки = Эл.ГУИД;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ГУИД",ГУИДСтроки);
		МассивСтрок = Доходы.НайтиСтроки(СтруктураОтбора);
		Для каждого ЭлСтр из МассивСтрок Цикл
			Если ЗначениеЗаполнено(ЭлСтр.ДокументКорректировки) Тогда
				ЭлСтр.ДокументКорректировкиНовый = Эл.Корректировка;
			Иначе
				ЭлСтр.ДокументКорректировки = Эл.Корректировка;
				
			КонецЕсли;
			Сообщить("Для строки № " + ЭлСтр.НомерСтроки + " создан документ корректировки." );

		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьКорректировкиНаСервере()
	МассивРезультата = Новый Массив;
	СтруктураИзм = Новый Структура;
	ТЧДоходы = Доходы.Выгрузить();
	ТЧДоходы.Свернуть("УчДокумент,ДокументКорректировки");
	Для каждого СтрТЧ из ТЧДоходы Цикл
		Если ЗначениеЗаполнено(СтрТЧ.УчДокумент) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("УчДокумент",СтрТЧ.УчДокумент);
			МассивСтрок = Доходы.НайтиСтроки(ПараметрыОтбора);
			НужнаКорректировка = ПроверитьСтрокиНаНеобходимостьВводаКорректировки(МассивСтрок);
			Если НужнаКорректировка Тогда
				Результат = ВвестиКорректировочныйДокумент(МассивСтрок,Сделка,СтрТЧ.УчДокумент,СтрТЧ.ДокументКорректировки);
				Для каждого ЭлСтр Из МассивСтрок Цикл
					СтруктураИзм = Новый Структура;
					СтруктураИзм.Вставить("ГУИД", ЭлСтр.ГУИД);
					СтруктураИзм.Вставить("Корректировка", Результат);
					МассивРезультата.Добавить(СтруктураИзм);
				КонецЦИкла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивРезультата;
КонецФункции

&НаСервере
Функция СоздатьИсправлениеНаСервере()
	МассивРезультата = Новый Массив;
	СтруктураИзм = Новый Структура;
	ТЧДоходы = Доходы.Выгрузить();
	ТЧДоходы.Свернуть("УчДокумент,ДокументКорректировки");
	Для каждого СтрТЧ из ТЧДоходы Цикл
		Если ЗначениеЗаполнено(СтрТЧ.УчДокумент) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("УчДокумент",СтрТЧ.УчДокумент);
			МассивСтрок = Доходы.НайтиСтроки(ПараметрыОтбора);
			НужнаКорректировка = ПроверитьСтрокиНаНеобходимостьВводаКорректировки(МассивСтрок);
			Если НужнаКорректировка Тогда
				Результат = ВвестиИсправленныйДокумент(МассивСтрок,Сделка,СтрТЧ.УчДокумент,СтрТЧ.ДокументКорректировки);
				Для каждого ЭлСтр Из МассивСтрок Цикл
					СтруктураИзм = Новый Структура;
					СтруктураИзм.Вставить("ГУИД", ЭлСтр.ГУИД);
					СтруктураИзм.Вставить("Корректировка", Результат);
					МассивРезультата.Добавить(СтруктураИзм);
				КонецЦИкла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивРезультата;
КонецФункции

&НаСервере
Функция ПроверитьСтрокиНаНеобходимостьВводаКорректировки(МассивСтрок)
	ЕстьИзменения = Ложь;
	Для каждого Эл из МассивСтрок Цикл
		Если Эл.СуммаИтого <> Эл.СуммаИтогоПосле или Эл.СуммаИтогоПосле <> Эл.СуммаИтогоПослеИзм Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьИзменения;
КонецФункции

&НаСервере
Функция ВвестиКорректировочныйДокумент(МассивСтрок,Сделка,ПервичныйДокумент,Корректировка = Неопределено)
	Если Корректировка = Неопределено или Корректировка = Документы.КорректировкаРеализации.ПустаяСсылка() Тогда	
		Если ТипЗнч(ПервичныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			НовДок = Документы.КорректировкаРеализации.СоздатьДокумент();
			НовДок.Дата = ТекущаяДата();
			НовДок.ДатаДокумента = ТекущаяДата();
			НовДок.Сделка = Сделка;
			НовДок.Заполнить(ПервичныйДокумент);
			//Евросиб Каблов 09.04.2025 ( #105407
			//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
			НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
			//Евросиб Каблов 09.04.2025 )
			НовДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
			Для каждого Эл из МассивСтрок Цикл
				Если Эл.СуммаИтого <> Эл.СуммаИтогоПосле Тогда
					СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
					Если СтрДок <> Неопределено Тогда
						СтрДок.Количество = Эл.КоличествоПосле;
						СтрДок.Сумма = Эл.СтавкаИтогоПосле;
						СтрДок.СтавкаНДС = Эл.СтавкаНДСПосле;
						СтрДок.СуммаНДС = Эл.СуммаНДСПосле;
						СтрДок.Цена = Эл.СтавкаПосле;
					КонецЕсли;
				ИначеЕсли Эл.СуммаИтогоПосле <> Эл.СуммаИтогоПослеИзм Тогда
					СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
					Если СтрДок <> Неопределено Тогда
						СтрДок.Количество = Эл.КоличествоПослеИЗм;
						СтрДок.Сумма = Эл.СтавкаИтогоПослеИзм;
						СтрДок.СтавкаНДС = Эл.СтавкаНДСПослеИзм;
						СтрДок.СуммаНДС = Эл.СуммаНДСПослеИзм;
						СтрДок.Цена = Эл.СтавкаПослеИзм;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовДок.Ссылка,СчФ);
			СчФ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Иначе
			НовДок = Документы.КорректировкаРеализации.СоздатьДокумент();
			НовДок.Дата = ТекущаяДата();
			НовДок.ДатаДокумента = ТекущаяДата();
			НовДок.Сделка = Сделка;
			НовДок.Заполнить(Корректировка);
			//Евросиб Каблов 09.04.2025 ( #105407
			//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
			НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
			//Евросиб Каблов 09.04.2025 )
			НовДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;			
			Для каждого Эл из МассивСтрок Цикл
				Если Эл.СуммаИтогоПосле <> Эл.СуммаИтогоПослеИзм Тогда
					СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
					Если СтрДок <> Неопределено Тогда
						СтрДок.Количество = Эл.КоличествоПослеИзм;
						СтрДок.Сумма = Эл.СтавкаИтогоПослеИзм;
						СтрДок.СтавкаНДС = Эл.СтавкаНДСПослеИзм;
						СтрДок.СуммаНДС = Эл.СуммаНДСПослеИзм;
						СтрДок.Цена = Эл.СтавкаПослеИзм;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовДок.Ссылка,СчФ);
			СчФ.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	Возврат НовДок.Ссылка;
	
КонецФункции

&НаСервере
Функция ВвестиИсправленныйДокумент(МассивСтрок,Сделка,ПервичныйДокумент, Корректировка = Неопределено)
Если Корректировка = Неопределено или Корректировка = Документы.КорректировкаРеализации.ПустаяСсылка() Тогда	
	
	Если ТипЗнч(ПервичныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НовДок = Документы.КорректировкаРеализации.СоздатьДокумент();
		НовДок.Дата = ТекущаяДата();
		НовДок.ДатаДокумента = ТекущаяДата();
		НовДок.Сделка = Сделка;
		НовДок.Заполнить(ПервичныйДокумент);
		//Евросиб Каблов 09.04.2025 ( #105407
		//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
		НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
		//Евросиб Каблов 09.04.2025 )
		НовДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;		
		Для каждого Эл из МассивСтрок Цикл
			Если Эл.СуммаИтого <> Эл.СуммаИтогоПосле Тогда
				СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
				Если СтрДок <> Неопределено Тогда
					СтрДок.Количество = Эл.КоличествоПосле;
					СтрДок.Сумма = Эл.СтавкаИтогоПосле;
					СтрДок.СтавкаНДС = Эл.СтавкаНДСПосле;
					СтрДок.СуммаНДС = Эл.СуммаНДСПосле;
					СтрДок.Цена = Эл.СтавкаПосле;
				ИначеЕсли Эл.СуммаИтогоПосле <> Эл.СуммаИтогоПослеИзм Тогда
					СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
					Если СтрДок <> Неопределено Тогда
						СтрДок.Количество = Эл.КоличествоПослеИЗм;
						СтрДок.Сумма = Эл.СтавкаИтогоПослеИзм;
						СтрДок.СтавкаНДС = Эл.СтавкаНДСПослеИзм;
						СтрДок.СуммаНДС = Эл.СуммаНДСПослеИзм;
						СтрДок.Цена = Эл.СтавкаПослеИзм;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
		БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовДок.Ссылка,СчФ);
		СчФ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Иначе
			НовДок = Документы.КорректировкаРеализации.СоздатьДокумент();
			НовДок.Дата = ТекущаяДата();
			НовДок.ДатаДокумента = ТекущаяДата();
			НовДок.Сделка = Сделка;
			НовДок.Заполнить(Корректировка);
			//Евросиб Каблов 09.04.2025 ( #105407
			//НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НовДок.Организация);
			НовДок.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НовДок.Организация);
			//Евросиб Каблов 09.04.2025 )
			НовДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;			
			Для каждого Эл из МассивСтрок Цикл
				Если Эл.СуммаИтого <> Эл.СуммаИтогоПосле Тогда
					СтрДок = НовДок.Услуги.Найти(Эл.ГУИД,"СтрокаДоходовСделки");
					Если СтрДок <> Неопределено Тогда
						СтрДок.Количество = Эл.КоличествоПослеИзм;
						СтрДок.Сумма = Эл.СтавкаИтогоПослеИзм;
						СтрДок.СтавкаНДС = Эл.СтавкаНДСПослеИзм;
						СтрДок.СуммаНДС = Эл.СуммаНДСПослеИзм;
						СтрДок.Цена = Эл.СтавкаПослеИзм;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(НовДок.Ссылка,СчФ);
			СчФ.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	Возврат НовДок.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументыИсправления(Команда)
	МассивКорректировок = СоздатьИсправлениеНаСервере();	
	Для каждого Эл из МассивКорректировок Цикл
		ГУИДСтроки = Эл.ГУИД;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ГУИД",ГУИДСтроки);
		МассивСтрок = Доходы.НайтиСтроки(СтруктураОтбора);
		Для каждого ЭлСтр из МассивСтрок Цикл
			Если ЗначениеЗаполнено(ЭлСтр.ДокументКорректировки) Тогда
				ЭлСтр.ДокументКорректировкиНовый = Эл.Корректировка;
			Иначе
				ЭлСтр.ДокументКорректировки = Эл.Корректировка;
			КонецЕсли;
			Сообщить("Для строки № " + ЭлСтр.НомерСтроки + " создан документ корректировки." );

		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого Стр из Доходы Цикл
		Если ЗначениеЗаполнено(Стр.ДокументКорректировки) Тогда
			Элементы.ДоходыВознаграждениеИтогоПослеИзм.Видимость = Истина;
			Элементы.ДоходыВознаграждениеПослеИзм.Видимость = Истина;
			Элементы.ДоходыДокументКорректировкиНовый.Видимость = Истина;
			Элементы.ДоходыКоличествоПослеИзм.Видимость = Истина;
			Элементы.ДоходыСебестоимостьИтогоПослеИзм.Видимость = Истина;
			Элементы.ДоходыСебестоимостьПослеИзм.Видимость = Истина;
			Элементы.ДоходыСтавкаИтогоПослеИзм.Видимость = Истина;
			Элементы.ДоходыСтавкаНДСПослеИзм.Видимость = Истина;
			Элементы.ДоходыСтавкаПослеИзм.Видимость = Истина;
			Элементы.ДоходыСуммаИтогоПослеИзм.Видимость = Истина;
			Элементы.ДоходыСуммаНДСПослеИзм.Видимость = Истина;
			
			Элементы.ДоходыВознаграждениеИтогоПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыВознаграждениеПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыДокументКорректировки.ТолькоПросмотр = Истина;
			Элементы.ДоходыКоличествоПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСебестоимостьИтогоПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСебестоимостьПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСтавкаИтогоПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСтавкаНДСПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСтавкаПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСуммаИтогоПосле.ТолькоПросмотр = Истина;
			Элементы.ДоходыСуммаНДСПосле.ТолькоПросмотр = Истина;

		КонецЕсли;
	КонецЦИкла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда
		МассивСтрок = Новый Массив;
		Для каждого Стр из Доходы Цикл
			МассивСтрок.Добавить(Стр);
		КонецЦикла;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Сделка", Сделка);
		СтруктураПараметров.Вставить("Строки", МассивСтрок);
		Оповестить("КорректировкиВнесены", СтруктураПараметров);
	КонецЕсли;

КонецПроцедуры
