
Процедура ОбработкаОчереди(парм1=неопределено,парам2= неопределено) Экспорт
   Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьЗаписиДанныхПоОтправлениям.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
		|	ОчередьЗаписиДанныхПоОтправлениям.ДатаЗаписи КАК ДатаЗаписи,
		|	ОчередьЗаписиДанныхПоОтправлениям.Пользователь КАК Пользователь,
		|	ОчередьЗаписиДанныхПоОтправлениям.Обработано КАК Обработано,
		|	ОчередьЗаписиДанныхПоОтправлениям.ДатаОбработки КАК ДатаОбработки,
		|	ОчередьЗаписиДанныхПоОтправлениям.ОшибкаПриОбработке КАК ОшибкаПриОбработке,
		|	ОчередьЗаписиДанныхПоОтправлениям.ТекстОшибки КАК ТекстОшибки
		|ИЗ
		|	РегистрСведений.ОчередьЗаписиДанныхПоОтправлениям КАК ОчередьЗаписиДанныхПоОтправлениям
		|ГДЕ
		|	ОчередьЗаписиДанныхПоОтправлениям.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Субботин 74442 11.09.2023 Начало

	Количество = ВыборкаДетальныеЗаписи.Количество();
	сч = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		ДлительныеОперации.СообщитьПрогресс(,"  
						|Формируются отправления. Обработано " + сч +" из "+Количество +" документов",); 
        сч = сч + 1;
	//Субботин 74442 11.09.2023 Конец

		мз = РегистрыСведений.ОчередьЗаписиДанныхПоОтправлениям.СоздатьМенеджерЗаписи();
		Попытка
		//	ОбъектСделка = ВыборкаДетальныеЗаписи.ОбрабатываемыйОбъект.получитьОбъект();
			УчетДоходовРасходовСервер.Сделка_СформироватьДвиженияДанныеПоОтправлениям(ВыборкаДетальныеЗаписи.ОбрабатываемыйОбъект); 
		//	ОбъектСделка.Движения.Записать();
		Исключение
			мз.ОшибкаПриОбработке = истина;
			мз.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		мз.ОбрабатываемыйОбъект = ВыборкаДетальныеЗаписи.ОбрабатываемыйОбъект;
		мз.ДатаЗаписи = ВыборкаДетальныеЗаписи.ДатаЗаписи;
		мз.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		мз.Обработано = Истина;
		мз.ДатаОбработки = ТекущаяДата();
		мз.Записать() 
	КонецЦикла;	
	
КонецПроцедуры

// Трундуков 17.04.2025 55657 Начало
//Процедура ОбработкаДанныхДляОАД (ПараметрКоманды,парам2= неопределено) Экспорт
Функция ОбработкаДанныхДляОАД (ПараметрКоманды,парам2= неопределено) Экспорт
// Трундуков 17.04.2025 55657 Конец
//	ОбщегоНазначения.СообщитьПользователю("Выполняется формирование отправлений");
	РегистрыСведений.ОчередьЗаписиДанныхПоОтправлениям.ОбработкаОчереди();
//	ОбщегоНазначения.СообщитьПользователю("Выполняется выгрузка ОАД");
	Если ПараметрКоманды.ВыгружатьЧастями Тогда
		// Трундуков 17.04.2025 55657
		//НачалоОтчеты.АнализДеятельности.ВыгрузитьОтчетВТаблицуВнешнегоИсточникаЧастями(ПараметрКоманды);
		Возврат Отчеты.АнализДеятельности.ВыгрузитьОтчетВТаблицуВнешнегоИсточникаЧастями(ПараметрКоманды);
		// Трундуков 17.04.2025 55657 Конец
	Иначе
		Отчеты.АнализДеятельности.ВыгрузитьОтчетВТаблицуВнешнегоИсточника(ПараметрКоманды);
	КонецЕсли;
	
КонецФункции

