
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КонтейнерыВСтоках.Записывать = Истина;
	Движения.СтатусыКТК.Записывать = Истина;
	
	ПредДанные = УправлениеКТКВСтокахСервер.ПолучитьПредыдущиеДанныеСтока(КТК, Дата-1);
	
	Если ПредДанные.Количество() > 0 Тогда
		
		Движение = Движения.КонтейнерыВСтоках.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, ПредДанные[0]);
		Движение.Период = Дата-1;
		Движение.Количество = ПредДанные[0].КоличествоОстаток;
		
		Движение2 = Движения.КонтейнерыВСтоках.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение2, Движение,, "ВидДвижения");
		Движение2.Период = Дата;
		Движение2.Сток = НовыйСток;
		Движение2.Количество = 1;
		
		СтатусКТК = Движения.СтатусыКТК.Добавить();
		СтатусКТК.Период = Дата;
		СтатусКТК.Контейнер = КТК;
		СтатусКТК.Сток = НовыйСток;
		СтатусКТК.Контрагент = Движение.Контрагент;
		СтатусКТК.Статус = Перечисления.СтатусыКТК.Свободен;
		СтатусКТК.Количество = 1;
		
	КонецЕсли;
	
КонецПроцедуры
