
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Наименование = Объект.Контрагент;
	Объект.Владелец = Объект.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиПриИзменении(Элемент)
	
	ОбновитьВсеТаблицы();
	ВидимостьСтраниц();
	
	ПримерСчФ = "";
	Для Каждого Стр Из  Объект.ОписаниеУслугиСчФ Цикл
		Если Стр.Использование Тогда
			//ПримерСчФ = ПримерСчФ + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
			ПримерСчФ = ПримерСчФ + ?(Стр.СНовойСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
		КонецЕсли;
	КонецЦикла;
	//Элементы.ПримерДляСчФ.Заголовок = ПримерСчФ;
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
	Элементы.ПримерДляСчФ.Заголовок = СокрЛП(ПримерСчФ);
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьСтраниц();
	
	//Евросиб Каблов 05.05.2022 ( Task 45436
	УстановитьВидимостьЭлементовГруппировкиОтгрузочнойИнформацииКАкту();
	//Евросиб Каблов 05.05.2022 )
	
	ОбновитьОформлениеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОдинаковыйФорматПриИзменении(Элемент)
	ОбновитьВсеТаблицы();
	ВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСтраниц()
	
	Элементы.Группа3.ОтображатьЗаголовок = НЕ Объект.ОдинаковыйФормат; 
	Элементы.Группа4.Видимость = НЕ Объект.ОдинаковыйФормат;
	Элементы.Группа5.Видимость = НЕ Объект.ОдинаковыйФормат;
	//Евросиб - АСуслов 22.03.2022 12:50:34 #0260415 
	//(
	Элементы.ГруппаНастройкаФормированияДокумента.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.ГруппаНастройкаОписанияУслуг.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.НадписьИспользуютсяРасширенныеНастройки.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.Группа2.Видимость = Не Объект.ИспользоватьРасширенныеПараметры;
	//)
	//Евросиб - АСуслов 22.03.2022 12:50:39 #0260415                        
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеТаблицы()
	
	Если Объект.ОдинаковыйФормат Тогда
		Объект.ОписаниеУслугиСчет.Очистить();
		Объект.ОписаниеУслугиАкт.Очистить();
		Для Каждого Стр Из Объект.ОписаниеУслугиСчФ Цикл
			НовСтр1 = Объект.ОписаниеУслугиСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр1,Стр);
			НовСтр2 = Объект.ОписаниеУслугиАкт.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр2,Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиСчетПриИзменении(Элемент)
	ПримерСч = "";
	Для Каждого Стр Из Объект.ОписаниеУслугиСчет Цикл
		Если Стр.Использование Тогда
			//ПримерСч = ПримерСч + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
			ПримерСч = ПримерСч + ?(Стр.СНовойСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
		КонецЕсли;
	КонецЦикла;
	//Элементы.ПримерДляСчета.Заголовок = ПримерСч;
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
	Элементы.ПримерДляСчета.Заголовок = СокрЛП(ПримерСч);
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиАктПриИзменении(Элемент)
	ПримерА = "";
	Для Каждого Стр Из Объект.ОписаниеУслугиАкт Цикл
		Если Стр.Использование Тогда
			//ПримерА = ПримерА + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
			ПримерА = ПримерА + ?(Стр.СНовойСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " [" + Стр.НазваниеРеквизита + "] ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
		КонецЕсли;
	КонецЦикла;
	//Элементы.ПримерДляАкта.Заголовок = ПримерА;
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
	Элементы.ПримерДляАкта.Заголовок = ПримерА;
	//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Переменные.Очистить();
	ТаблицаЗамен = ПравилаФормированияКлДокументовРасширенные.ПолучитьАктуальнуюТаблицуЗамен();
	Для каждого Стр из ТаблицаЗамен Цикл
		ЗаполнитьЗначенияСвойств(Переменные.Добавить(), Стр);
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ГруппироватьВыставляемыеРеализацииПосуточноПриИзменении(Элемент)
	Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
		Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина;	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ГруппироватьВыставляемыеРеализацииПосуточно1ПриИзменении(Элемент)
	Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
		Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина;	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельноПриИзменении(Элемент)
	Если Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Ложь Тогда
		Если Объект.ГруппироватьВыставляемыеРеализацииПосуточно Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("При выставлении реализаций посуточно отключать режим поконтейнерной экономики нельзя");
			Объект.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно = Истина
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура РазделениеКомплСтавкиНаСтрокиТекстУслугиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекД = Элементы.РазделениеКомплСтавкиНаСтроки.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("КонецВводаТекстаУслуги", ЭтаФорма);
		ПоказатьВводСтроки(ОпОп, ТекД.ТекстУслуги, "Введите описание услуги", 1000, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецВводаТекстаУслуги(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		Элементы.РазделениеКомплСтавкиНаСтроки.ТекущиеДанные.ТекстУслуги = П1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСтавкиПриИзменении(Элемент)
	
	Если Объект.ВидСтавки <> ПредопределенноеЗначение("Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки") Тогда
		Объект.ДатаАвансовогоСчетаФрахт = Неопределено;
		Объект.ДатаРеализацииФрахт = Неопределено;
	КонецЕсли;
	
	ОбновитьОформлениеФормы();
КонецПроцедуры                

&НаКлиенте
Процедура ОбновитьОформлениеФормы()
	Элементы.ГруппаНастройкаДатФормированияДокументовДляФрахтаРаздельно.Видимость = Объект.ВидСтавки = ПредопределенноеЗначение("Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки");
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьРасширенныеПараметрыПриИзменении(Элемент)
	//Евросиб - АСуслов 22.03.2022 12:50:34 #0260415 
	//(
	Элементы.ГруппаНастройкаФормированияДокумента.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.ГруппаНастройкаОписанияУслуг.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.НадписьИспользуютсяРасширенныеНастройки.Видимость = Объект.ИспользоватьРасширенныеПараметры;
	Элементы.Группа2.Видимость = Не Объект.ИспользоватьРасширенныеПараметры;
	//)
	//Евросиб - АСуслов 22.03.2022 12:50:39 #0260415 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Владелец = Объект.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура СпособГруппировкиОтгрузочнойИнформацииКАктуПриИзменении(Элемент)
	
	//Евросиб Каблов 05.05.2022 ( Task 45436
	УстановитьВидимостьЭлементовГруппировкиОтгрузочнойИнформацииКАкту();
	//Евросиб Каблов 05.05.2022 )

КонецПроцедуры

//Евросиб Каблов 05.05.2022 ( Task 45436
Процедура УстановитьВидимостьЭлементовГруппировкиОтгрузочнойИнформацииКАкту()
	
	Если Объект.СпособГруппировкиОтгрузочнойИнформацииКАкту = ПредопределенноеЗначение("Перечисление.СпособыГруппировкиОтгрузочнойИнформацииКАкту.Сводно") Тогда
		Элементы.НаименованиеГруппыОтгрузочнойИнформацииКАкту.Видимость = Истина;
	Иначе
		Элементы.НаименованиеГруппыОтгрузочнойИнформацииКАкту.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонНомерДоговора(Команда)
	ДобавитьТекстШаблона("%НомерДоговора%");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонДатаДоговора(Команда)
	ДобавитьТекстШаблона("%ДатаДоговора%");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекстШаблона(Параметр)
	Перем НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки;
	Элементы.ШаблонТекстаОснованияВСчете.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	ДлинаСтрокиШаблонТекстаОснованияВСчете = СтрДлина(Объект.ШаблонТекстаОснованияВСчете);
	Объект.ШаблонТекстаОснованияВСчете = Лев(Объект.ШаблонТекстаОснованияВСчете, НачалоКолонки - 1) + Параметр + Прав(Объект.ШаблонТекстаОснованияВСчете, ДлинаСтрокиШаблонТекстаОснованияВСчете - КонецКолонки + 1);	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Переменные.Очистить();
	
	Если ТекущаяСтраница.Имя = "ГруппаНастройкиФормированияВР" Тогда
		ТаблицаЗамен = ПравилаФормированияКлДокументовРасширенные.ПолучитьАктуальнуюТаблицуЗамен_ОтчетКомитенту();
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаНастройкиФормированияСчета" Тогда
		ТаблицаЗамен = ПравилаФормированияКлДокументовРасширенные.ПолучитьАктуальнуюТаблицуЗамен_Счет();
	//Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	Иначе
		ТаблицаЗамен = ПравилаФормированияКлДокументовРасширенные.ПолучитьАктуальнуюТаблицуЗамен();
	КонецЕсли;
	
	Для каждого Стр из ТаблицаЗамен Цикл
		ЗаполнитьЗначенияСвойств(Переменные.Добавить(), Стр);
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
&НаКлиенте
Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	 ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 98449 / TA 98451, 20-12-2024, начало
&НаКлиенте
Процедура СворачиватьСтрокиВПечатнойФормеАктаПриИзменении(Элемент)
	Если Объект.СворачиватьСтрокиВПечатнойФормеАкта Тогда
		Объект.СворачиватьСтрокиВПечатнойФормеАктаВключаяСтавку = Ложь;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 98449 / TA 98451, 20-12-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 98449 / TA 98451, 20-12-2024, начало
&НаКлиенте
Процедура СворачиватьСтрокиВПечатнойФормеАктаВключаяСтавкуПриИзменении(Элемент)
	Если Объект.СворачиватьСтрокиВПечатнойФормеАктаВключаяСтавку Тогда
		Объект.СворачиватьСтрокиВПечатнойФормеАкта = Ложь;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 98449 / TA 98451, 20-12-2024, конец




