
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//Евросиб Коханенко Н.А. 28.11.2024 (( #95714 
	//было:
	//	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("УчетныеНаправления", ДанныеВыбора, Параметры, СтандартнаяОбработка); 
	//стало:
	Если Параметры.Отбор.Свойство("ОграничениеПоДатеИспользования") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УчетныеНаправления.Ссылка КАК Направление
		               |ИЗ
		               |	Справочник.УчетныеНаправления КАК УчетныеНаправления
		               |ГДЕ
		               |	(УчетныеНаправления.ДатаНеИспользовать = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ УчетныеНаправления.ДатаНеИспользовать > &ДатаНеИспользовать)
		               |	И НЕ УчетныеНаправления.ПометкаУдаления
					   //Евросиб Коханенко Н.А. 13.12.2024 (( #97643 
		               |	И (&РазрешитьВРП 
		               |		ИЛИ УчетныеНаправления.Ссылка <> ЗНАЧЕНИЕ(Справочник.УчетныеНаправления.ВРП)) 
					   //Евросиб Коханенко Н.А. 13.12.2024 )) #97643 
		               |	И УчетныеНаправления.Наименование ПОДОБНО &СтрокаПоиска";
		Запрос.УстановитьПараметр("ДатаНеИспользовать", Параметры.Отбор.ОграничениеПоДатеИспользования); 
		Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%"); 
		//Евросиб Коханенко Н.А. 13.12.2024 (( #97643 
		Если Параметры.Отбор.Свойство("РазрешитьВРП") Тогда
			Запрос.УстановитьПараметр("РазрешитьВРП", Параметры.Отбор.РазрешитьВРП);
		Иначе
			Запрос.УстановитьПараметр("РазрешитьВРП", Истина);
		КонецЕсли;	
		//Евросиб Коханенко Н.А. 13.12.2024 )) #97643 
		Результат = Запрос.Выполнить();
		ТаблицаРезультатов = Результат.Выгрузить();
		МассивУчНаправлений = ТаблицаРезультатов.ВыгрузитьКолонку("Направление");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МассивУчНаправлений);
		СтандартнаяОбработка = Ложь;
	Иначе
		РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("УчетныеНаправления", ДанныеВыбора, Параметры, СтандартнаяОбработка); 
	КонецЕсли;
	//Евросиб Коханенко Н.А. 28.11.2024 )) #95714 
КонецПроцедуры
