
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКТК.ЗагрузитьЗначения(Параметры.МассивКТК); 
	РелизКлиента = Параметры.РелизКлиента;
	РелизСобственника = Параметры.РелизСобственника;
	КоличествоСтрок = Параметры.КоличествоСтрок;
	//ТипоразмерКТК = Параметры.ТипоразмерКТК;
	//СтокВыдачи = Параметры.СтокВыдачи;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	РаспознанныеДанные.Очистить();
	
	ПолучитьСведенияПоКТК();
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	//Если ЕстьОшибки Тогда
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	//	ПоказатьВопрос(Оповещение, "Перенос данных будет проведен только по строкам,
	//									|не имеющим ошибок. Продолжить?", Режим, 0);
	//Иначе
		ВыполнитьПеренос();
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиУстановитьВсе(Команда)
	ЗначениеФлажка = Команда.Имя = "ПеренестиУстановитьВсе";
	Для каждого СтрокаДанных Из РаспознанныеДанные Цикл
		СтрокаДанных.ПеренестиВРелизКлиента = ЗначениеФлажка;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСведенияПоКТК()
	
	ТекстЗапроса =
	//ДИТ Шевченко А.В. US 62421 TA 64347 01.03.23 –начало
	"ВЫБРАТЬ
	|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
	|	РелизСобственникаНоминации.ТипКТК КАК ТипКТК
	|ПОМЕСТИТЬ КТК_РелизСобственника
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	|			РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК Контейнер
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РелизКлиента.Ссылка КАК Ссылка
	|			ИЗ
	|				Документ.РелизКлиента КАК РелизКлиента
	|			ГДЕ
	|				РелизКлиента.ВыдачаОтСобственника = ИСТИНА
	|				И РелизКлиента.РелизСобственника = &РелизСобственника
	|				И РелизКлиента.ПометкаУдаления = ЛОЖЬ
	|				И НЕ РелизКлиента.Ссылка = &РелизКлиента) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|				ПО ВложенныйЗапрос.Ссылка = РелизКлиентаКонтейнеры.Ссылка) КАК КТК_ВДругихРелизахКлиентов
	|		ПО РелизСобственникаНоминации.Контейнер = КТК_ВДругихРелизахКлиентов.Контейнер
	|ГДЕ
	|	РелизСобственникаНоминации.Ссылка = &РелизСобственника
	|	И КТК_ВДругихРелизахКлиентов.Контейнер ЕСТЬ NULL	
	|	И РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И НЕ РелизСобственникаНоминации.Контейнер В (&СписокКТК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КТК_РелизСобственника.Контейнер КАК Контейнер,
	|	КТК_РелизСобственника.ТипКТК КАК ТипоразмерКТК,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Сток КАК ТекущийСток,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК Статус,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК тек_Собственник,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПРАВОЕ СОЕДИНЕНИЕ КТК_РелизСобственника КАК КТК_РелизСобственника
	|		ПО КТК_РелизСобственника.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК";
	//ДИТ Шевченко А.В. US 62421 TA 64347 01.03.23 –конец
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокКТК", СписокКТК);
	Запрос.УстановитьПараметр("РелизСобственника", РелизСобственника);
	Запрос.УстановитьПараметр("РелизКлиента", РелизКлиента);
	
	//ТипоразмермерыКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивКТК, "ТипТЕ");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	РаспознанныеДанные.Загрузить(Результат);
	
	//// Проверки
	//НомеСтроки = 1;
	//Для Каждого ТекущаяСтрока Из РаспознанныеДанные Цикл
	//	
	//	Если НомеСтроки > КоличествоСтрок Тогда
	//		ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
	//						+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
	//						+ "превышение макс. кол-ва";
	//		ЕстьОшибки = Истина;				
	//	КонецЕсли;
	//	
	//	ТипТекущегоКТК = ТипоразмермерыКТК.Получить(ТекущаяСтрока.Контейнер);
	//	Если ТипоразмерКТК <> ТипТекущегоКТК Тогда
	//		ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
	//						+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
	//						+ "несоответствие типоразмера";
	//		ЕстьОшибки = Истина;
	//	КонецЕсли;	
	//	
	//	Если СтокВыдачи <> ТекущаяСтрока.ТекущийСток Тогда
	//		ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
	//						+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
	//						+ "несоответствие текущего стока";
	//		ЕстьОшибки = Истина;
	//	КонецЕсли;
	//	
	//	Если ТекущаяСтрока.Статус <> Перечисления.СтатусыКТК.Свободен Тогда
	//		ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
	//						+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
	//						+ "несоответствие статуса КТК";
	//		ЕстьОшибки = Истина;
	//	КонецЕсли;
	//	
	//	НомеСтроки = НомеСтроки + 1;
	//КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДопустимыеСимволы(СтрокаПроверки)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("1234567890");
	МассивСтрок.Добавить("qwertyuiopasdfghjklzxcvbnm");
	МассивСтрок.Добавить("абвгдеёжзийклмнопрстуфхцчшщыьъэюя");
	МассивСтрок.Добавить(" .-");
	
	СтрокаДопустимыхСимволов = СтрСоединить(МассивСтрок);
	СтрокаДопустимыхСимволов = ВРег(СтрокаДопустимыхСимволов);
	
	Для НомерСимвола = 1 по СтрДлина(СтрокаПроверки) Цикл
		Если Найти(СтрокаДопустимыхСимволов, ВРег(Сред(СтрокаПроверки, НомерСимвола, 1))) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции		

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ВыполнитьПеренос();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПеренос()

	Результат = Новый Массив;
	КолДобавляемыхСтрок = 0;
	Для каждого СтрокаДанных из РаспознанныеДанные Цикл
		
		Если НЕ СтрокаДанных.ПеренестиВРелизКлиента Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСведений = Новый Структура("Контейнер, ТипоразмерКТК");
		ЗаполнитьЗначенияСвойств(СтруктураСведений, СтрокаДанных);
		Результат.Добавить(СтруктураСведений);
		КолДобавляемыхСтрок = КолДобавляемыхСтрок + 1;
	КонецЦикла;
	
	Если КоличествоСтрок < КолДобавляемыхСтрок Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Количество выбранных для переноса в релиз клиента контейнеров превышает максимально возможное количество КТК по этому релизу.");
		Возврат;
	КонецЕсли;	
	
	Закрыть(Новый Структура("Результат", Результат));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрочитатьДанные(Неопределено);
КонецПроцедуры
#КонецОбласти