
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаполнениеТаблицыОбъектов();
	
	Пользователь = Пользователи.ТекущийПользователь();
	ПериодОтображения.ДатаНачала = ТекущаяДата()-24*3600;
	ПериодОтображения.ДатаОкончания = ТекущаяДата()+7*24*3600;
	
	Статусы.Добавить(перечисления.СтатусыЭтапов.НаВыполнение);
	Статусы.Добавить(перечисления.СтатусыЭтапов.ВРаботе);
	Статусы.Добавить(перечисления.СтатусыЭтапов.Отклонен);
	
	Календарь = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицыОбъектов()
	
	ТЗОбъектовСостояния.Очистить();
	
	Для Каждого ЭлемСпр Из Метаданные.Справочники Цикл
		Попытка
			СостоянияЭлементов = ЭлемСпр.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемСпр.Имя;
			ТекСтр.ТипМетаданных = "Справочник.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;
			
	Для Каждого ЭлемДок Из Метаданные.Документы Цикл
		Попытка
			СостоянияЭлементов = ЭлемДок.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемДок.Имя;
			ТекСтр.ТипМетаданных = "Документ.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ОбновитьОтображениеКалендарей()
	
	Элементы.Календарь.ВыделенныеДаты.Очистить();
	Элементы.Календарь.ВыделенныеДаты.Добавить(Календарь);
	
	//Расписание.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Неделя;
	Расписание.ТекущиеПериодыОтображения.Очистить();
	Расписание.ТекущиеПериодыОтображения.Добавить(Расписание.НачалоПериодаОтображения + 6 * 3600, Расписание.НачалоПериодаОтображения + 18 * 3600);
	
	//Расписание.ТекущиеПериодыОтображения.Добавить(Календарь, Календарь+Отображение);
	
	Возврат Календарь;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЪ(Команда)
	
	СформироватьДатыОтображения(Календарь);	
	СформироватьПланировщик();
	КалендарьПриИзмененииНаСервере();
	
	//Расписание.НачалоПериодаОтображения = ПериодОтображения.ДатаНачала;
	//Расписание.КонецПериодаОтображения = ПериодОтображения.ДатаОкончания;
	//
	//ПолучитьТаблицуЭтаповПоПараметрам(Пользователь, ПериодОтображения.ДатаНачала, ПериодОтображения.ДатаОкончания, Статусы.ВыгрузитьЗначения(), ПоказатьЗадачиБезДаты);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуЭтаповПоПараметрам(Пользователь, ДатаНачала, ДатаОкончания, Статусы, ПоказатьЗадачиБезДаты)
	
	Исполнители = Новый Массив;
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") тогда
		
		ЗамПользователя = Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(Пользователь, ТекущаяДата());
		
		Исполнители = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(Пользователь, ЗамПользователя);
		
		// ДИТ Поморцева Т.П. Задача 238786 16.08.21. начало
		//Исполнители.Добавить(Пользователь);
		//Исполнители.Добавить(ЗамПользователя);
		Для Каждого Элемент ИЗ ЗамПользователя Цикл
			Исполнители.Добавить(Элемент);
		КонецЦикла;	
		// ДИТ Поморцева Т.П. Задача 238786 16.08.21. конец
		
	Иначе
		Исполнители = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Пользователь);
		Исполнители.Добавить(Пользователь);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияДокументов.ДокументРегистратор КАК ДокументРегистратор,
	               |	СостоянияДокументов.Состояние КАК Состояние,
	               |	СостоянияДокументов.Исполнитель КАК Исполнитель,
	               |	СостоянияДокументов.Наблюдатель КАК Наблюдатель,
	               |	СостоянияДокументов.Статус КАК Статус,
	               |	СостоянияДокументов.НачалоРаботы КАК НачалоРаботы,
	               |	СостоянияДокументов.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СостоянияДокументов.ДокументРегистратор) = ТИП(Документ.Операция)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СостоянияДокументов.ДокументРегистратор.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА СостоянияДокументов.ДокументРегистратор.ДатаОтправления
	               |					ИНАЧЕ СостоянияДокументов.ДокументРегистратор.ДатаОтправленияФакт
	               |				КОНЕЦ
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаНачалаОперации,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СостоянияДокументов.ДокументРегистратор) = ТИП(Документ.Операция)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СостоянияДокументов.ДокументРегистратор.ДатаНазначенияФакт = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА СостоянияДокументов.ДокументРегистратор.ДатаНазначения
	               |					ИНАЧЕ СостоянияДокументов.ДокументРегистратор.ДатаНазначенияФакт
	               |				КОНЕЦ
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаОкончанияОперации
	               |ИЗ
	               |	РегистрСведений.СостоянияДокументов КАК СостоянияДокументов
	               |ГДЕ
	               |	СостоянияДокументов.Статус В(&Статусы)
	               |	И (СостоянияДокументов.Исполнитель В (&Исполнители)
	               |			ИЛИ СостоянияДокументов.Наблюдатель В (&Исполнители))";
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Исполнители", Исполнители);
	Запрос.УстановитьПараметр("ПоказатьЗадачиБезДаты", ПоказатьЗадачиБезДаты);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если НЕ ПоказатьЗадачиБезДаты И (НЕ ЗначениеЗаполнено(Ответ.ДатаНачалаОперации) ИЛИ НЕ ЗначениеЗаполнено(Ответ.ДатаОкончанияОперации)) Тогда Продолжить; КонецЕсли;
		
		ДатаНачала = ?(ЗначениеЗаполнено(Ответ.ДатаНачалаОперации), Ответ.ДатаНачалаОперации, Ответ.НачалоРаботы);
		ДатаОкончания = ?(ЗначениеЗаполнено(Ответ.ДатаОкончанияОперации), Ответ.ДатаОкончанияОперации, Ответ.ЗавершениеРаботы);
		
		Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда ДатаНачала = ТекущаяДата(); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда ДатаОкончания = ТекущаяДата(); КонецЕсли;
		
		НЭлемент = Расписание.Элементы.Добавить(ДатаНачала, ДатаОкончания);
		НЭлемент.Текст = "" + Ответ.Состояние + " " + Ответ.ДокументРегистратор;
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПриАктивизации(Элемент)
	
	а = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элем = Элемент.ВыделенныеЭлементы[0].Значение;
	ПоказатьЗначение(,Элем);
	
КонецПроцедуры

&НаКлиенте
Процедура комНазад(Команда)
	
	Календарь = Календарь - 24*3600;
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура комВперед(Команда)
	
	Календарь = Календарь + 24*3600;
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура комСегодня(Команда)
	
	Календарь = ТекущаяДата();
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПриИзменении(Элемент)
	
	СформироватьДатыОтображения(Календарь);	
	СформироватьПланировщик();
	
	СформироватьЭлементыШкалыПланировщика();
		
	КалендарьПриИзмененииНаСервере();

//	ОбновитьОтображениеКалендарей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаСервере
Процедура КалендарьПриИзмененииНаСервере()
	
	ЭлементыПланировщика = Расписание.Элементы;
    ЭлементыПланировщика.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийЗадачиСотрудника.Ответственный КАК Ответственный,
	               |	РегистрСведенийЗадачиСотрудника.Задача КАК Задача,
	               |	РегистрСведенийЗадачиСотрудника.Документ КАК Документ,
	               |	РегистрСведенийЗадачиСотрудника.ТипЗадачи КАК ТипЗадачи,
	               |	РегистрСведенийЗадачиСотрудника.Наблюдатель КАК Наблюдатель,
	               |	РегистрСведенийЗадачиСотрудника.НачалоРаботыПлан КАК НачалоРаботыПлан,
	               |	РегистрСведенийЗадачиСотрудника.ОкончаниеРаботыПлан КАК ОкончаниеРаботыПлан,
	               |	РегистрСведенийЗадачиСотрудника.НачалоРаботыФакт КАК НачалоРаботыФакт,
	               |	РегистрСведенийЗадачиСотрудника.ОкончаниеРаботыФакт КАК ОкончаниеРаботыФакт,
	               |	РегистрСведенийЗадачиСотрудника.Документ.Дата КАК ДокументДата
				   //Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, начало
				   |	,ВЫБОР
	               |		КОГДА РегистрСведенийЗадачиСотрудника.Документ ССЫЛКА Документ.Операция
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаОтправленияФакт <> ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаОтправленияФакт
	               |					ИНАЧЕ ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаОтправления
	               |				КОНЕЦ
	               |		КОГДА РегистрСведенийЗадачиСотрудника.Документ ССЫЛКА Документ.ЗапланированноеВзаимодействие
	               |			ТОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.ЗапланированноеВзаимодействие).ДатаНачала
	               |		ИНАЧЕ &ТекущаяДата
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА РегистрСведенийЗадачиСотрудника.Документ ССЫЛКА Документ.Операция
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаНазначенияФакт <> ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаНазначенияФакт
	               |					ИНАЧЕ ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).ДатаНазначения
	               |				КОНЕЦ
	               |		КОГДА РегистрСведенийЗадачиСотрудника.Документ ССЫЛКА Документ.ЗапланированноеВзаимодействие
	               |			ТОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.ЗапланированноеВзаимодействие).ДатаОкончания
	               |		ИНАЧЕ &ТекущаяДата
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА РегистрСведенийЗадачиСотрудника.Документ ССЫЛКА Документ.Операция
	               |			ТОГДА ВЫРАЗИТЬ(РегистрСведенийЗадачиСотрудника.Документ КАК Документ.Операция).Услуга.Наименование
	               |		ИНАЧЕ ТИПЗНАЧЕНИЯ(РегистрСведенийЗадачиСотрудника.Документ)
	               |	КОНЕЦ КАК Заголовок
				   //Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, конец
	               |ИЗ
	               |	РегистрСведений.ЗадачиСотрудника КАК РегистрСведенийЗадачиСотрудника
	               |ГДЕ
	               |	НЕ(РегистрСведенийЗадачиСотрудника.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачСотрудников.Взаимодействие)
	               |				И РегистрСведенийЗадачиСотрудника.ОкончаниеРаботыПлан < &ТекущаяДата)
	               |	И (РегистрСведенийЗадачиСотрудника.Ответственный В (&Пользователь)
	               |			ИЛИ РегистрСведенийЗадачиСотрудника.Наблюдатель В (&Пользователь)
	               |			ИЛИ РегистрСведенийЗадачиСотрудника.Ответственный В
	               |				(ВЫБРАТЬ
	               |					ГруппыПользователейСостав.Ссылка КАК Ссылка
	               |				ИЗ
	               |					Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |				ГДЕ
	               |					ГруппыПользователейСостав.Пользователь В (&Пользователь)
	               |					И НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления)
	               |			ИЛИ РегистрСведенийЗадачиСотрудника.Наблюдатель В
	               |				(ВЫБРАТЬ
	               |					ГруппыПользователейСостав.Ссылка КАК Ссылка
	               |				ИЗ
	               |					Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |				ГДЕ
	               |					ГруппыПользователейСостав.Пользователь В (&Пользователь)
	               |					И НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления))
	               |	И РегистрСведенийЗадачиСотрудника.Статус В(&Статус)
				   //Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, начало
				   |	И РегистрСведенийЗадачиСотрудника.НачалоРаботыПлан >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, НЕДЕЛЯ, -1)";
				   //Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, конец
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	// ДИТ Поморцева Т.П. 238786 04.08.2021 начало 
	//ПользовательЪ = Новый Массив;
	//ПользовательЪ.Добавить(Пользователь);
	//ЗамПользователя = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(Пользователь, ТекущаяДата());
	//ПользовательЪ.Добавить(ЗамПользователя);
		
	ПользовательЪ = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(Пользователь, ТекущаяДата());	
	// ДИТ Поморцева Т.П. 238786 04.08.2021 конец
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательЪ);
	
	Запрос.УстановитьПараметр("Статус",Статусы);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить(); 
	УстановитьПривилегированныйРежим(Ложь);
	
		                                                        
	Для каждого Рез Из Результат Цикл

		//Если ТипЗнч(Рез.Документ) = Тип("ДокументСсылка.Операция") Тогда
		//	ДтНач = ?(ЗначениеЗаполнено(Рез.Документ.ДатаОтправленияФакт),Рез.Документ.ДатаОтправленияФакт,Рез.Документ.ДатаОтправления);
		//	ДатаКон = ?(ЗначениеЗаполнено(Рез.Документ.ДатаНазначенияФакт),Рез.Документ.ДатаНазначенияФакт,Рез.Документ.ДатаНазначения);
		//ИначеЕсли ТипЗнч(Рез.Документ) = Тип("ДокументСсылка.ЗапланированноеВзаимодействие") Тогда
		//	ДтНач = Рез.НачалоРаботыПлан;
		//	ДатаКон = Рез.ОкончаниеРаботыПлан;
		//Иначе
		//	ДтНач = ТекущаяДата();
		//	ДатаКон = ТекущаяДата();
		//КонецЕсли;
		//
		//
		//НовыйЭлемент = ЭлементыПланировщика.Добавить(НачалоДня(ДтНач)+6*3600, КонецДня(ДатаКон)-5*3600);
		//
		//Если Строка(ТипЗнч(Рез.Документ)) = "Операция" Тогда
		//	ЗаголовокДок = Строка(Рез.Документ.Услуга);
		//Иначе
		//	ЗаголовокДок = Строка(ТипЗнч(Рез.Документ));
		//КонецЕсли;
		//
		//Если 
		//	ТипЗнч(Рез.Документ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") ИЛИ 
		//	ТипЗнч(Рез.Документ) = Тип("СправочникСсылка.Стратегии") ИЛИ 
		//	ТипЗнч(Рез.Документ) = Тип("СправочникСсылка.Проекты") ИЛИ
		//	ТипЗнч(Рез.Документ) = Тип("СправочникСсылка.РеестрыСогласования")
		//Тогда
		//	НовыйЭлемент.Текст = ЗаголовокДок;
		//Иначе
		//	//НовыйЭлемент.Текст = ЗаголовокДок + " от " + Строка(Формат(Рез.Документ.Дата,"ДЛФ=Д"));
		//	НовыйЭлемент.Текст = ЗаголовокДок + " от " + Строка(Формат(Рез.ДокументДата,"ДЛФ=Д"));
		//КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, начало
		НовыйЭлемент = ЭлементыПланировщика.Добавить(НачалоДня(Рез.ДатаНачала)+6*3600, КонецДня(Рез.ДатаОкончания)-5*3600);
		НовыйЭлемент.Текст = Рез.Заголовок;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0403478, 25-06-2025, конец
		
		//НовыйЭлемент.ЦветФона = WebЦвета.ЗеленаяЛужайка;	
		//НовыйЭлемент.Картинка = БиблиотекаКартинок.Ресурс;
		НовыйЭлемент.Значение = Рез.Документ;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДатыОтображения(Дата)

	НачальнаяДатаОтображения = ?(Отображение = 0,НачалоДня(Дата)+6*3600,?(Отображение = 1,НачалоНедели(Дата),НачалоМесяца(Дата)));	
	КонечнаяДатаОтображения = ?(Отображение = 0,КонецДня(Дата)-5*3600,?(Отображение = 1,КонецНедели(Дата),КонецМесяца(Дата)));

Конецпроцедуры 

&НаКлиенте
Процедура СформироватьПланировщик();

	Расписание.ТекущиеПериодыОтображения.Очистить();
	Расписание.ТекущиеПериодыОтображения.Добавить(НачальнаяДатаОтображения, КонечнаяДатаОтображения);

	Расписание.НачалоПериодаОтображения = НачальнаяДатаОтображения;
	Расписание.КонецПериодаОтображения = КонечнаяДатаОтображения;
	
КонецПроцедуры 
 
&НаКлиенте
Процедура СформироватьЭлементыШкалыПланировщика()

	ЭлементыШкалыВремени = Расписание.ШкалаВремени.Элементы;
	
	// день
	Если Отображение = 0 Тогда
		Расписание.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Расписание.НачалоПериодаОтображения = Календарь+6*3600;
		Расписание.КонецПериодаОтображения = Календарь+19*3600;
		Расписание.КратностьПериодическогоВарианта = 1;
		Расписание.ОтображатьПеренесенныеЗаголовки = Истина;
		Расписание.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
	    ЭлементыШкалыВремени[0].Кратность = 1;
	    ЭлементыШкалыВремени[0].Формат = "ДФ=ЧЧ:мм";
		ЭлементыШкалыВремени[0].Единица = ТипЕдиницыШкалыВремени.Час;
		
	// неделя	
	ИначеЕсли Отображение = 1 Тогда
		Расписание.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Расписание.КратностьПериодическогоВарианта = 7;
		Расписание.ОтображатьПеренесенныеЗаголовки = Ложь;
		Расписание.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		ЭлементыШкалыВремени[0].Кратность = 1;
		ЭлементыШкалыВремени[0].Единица = ТипЕдиницыШкалыВремени.День;
		ЭлементыШкалыВремени[0].Формат = "ДЛФ=Д";
		
	// месяц	
	ИначеЕсли Отображение = 2 Тогда
		Расписание.КратностьПериодическогоВарианта = 1;
		Расписание.ОтображатьПеренесенныеЗаголовки = Истина;
		Расписание.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		ЭлементыШкалыВремени[0].Кратность = 1;
		ЭлементыШкалыВремени[0].Единица = ТипЕдиницыШкалыВремени.Месяц;
		ЭлементыШкалыВремени[0].Формат = "ДЛФ=Д";
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РасписаниеПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ОбновитьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадачи()
	
	ДатаКалендаря = ОбновитьОтображениеКалендарей();
	СформироватьДатыОтображения(ДатаКалендаря);	
	СформироватьПланировщик();
	КалендарьПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПриИзменении(Элемент)
	
	ОбновитьЗадачи();
	
КонецПроцедуры
	

