
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	ПодразделениеОрганизации = Автор.Подразделение;
	//Евросиб Каблов 12.08.2022 ( Task 55578
	//Ответственный = Пользователи.ТекущийПользователь();
	//Евросиб Каблов 12.08.2022 )
	//Субботин 77305 13.11.2023 начало
	Если Не ЗначениеЗаполнено(Создано) Тогда
		Создано = ТекущаяДата();
	КонецЕсли;
	//Субботин 77305 13.11.2023 конец
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//БанковскийСчетОрганизации = Организация.ОсновнойБанковскийСчет; //ДИТ, Беляев СЮ, TA48059, 12-04-2022, закомментировал
	//Гудкова ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Маршрутизировать = Константы.МаршрутизироватьПТУ.Получить();
	ТребуетсяАвторазнесение = Константы.АвторазнесениеПТУ.Получить();
//Евросиб Гудкова( 11.02.2020 Ticket№ 0182509
	//	удПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
// Евросиб Гудкова) 	
	УчитыватьНДС = Истина;
	Регламентный = Истина;
	//Евросиб - АСуслов 16.03.2023 16:18:57 #65868
	//(
	СтатусДокумента = Перечисления.СтатусыДокументовПоступлений.НаПроверке;
	ДатаПоступленияДокумента = ТекущаяДата();
	//)
	//Евросиб - АСуслов 16.03.2023 16:19:00 #65868
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		// Заполнение шапки
		БанковскийСчетКонтрагента = ДанныеЗаполнения.БанковскийСчетКонтрагента;
		БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//Гудкова ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//Гудкова ДатаВходящегоДокумента = ДанныеЗаполнения.ДатаВходящегоДокумента;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента = ДоговорКонтрагента.ВалютаВзаиморасчетов; //Гудкова
		Комментарий = ДанныеЗаполнения.Комментарий;
		Грузоотправитель = ДанныеЗаполнения.Контрагент;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Грузополучатель = ДанныеЗаполнения.Организация;
		//Гудкова Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
 		СчетНаОплатуПоставщика = ДанныеЗаполнения.Ссылка;
		СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.Услуга Тогда
				НоваяСтрока = Услуги.Добавить();
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.Содержание = ТекСтрокаТовары.Содержание;
				НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
				НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
				НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
				НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
//Евросиб Гудкова( 17.11.2020 Ticket№ 
				НоваяСтрока.Всего = ТекСтрокаТовары.Сумма + ?(СуммаВключаетНДС, 0, ТекСтрокаТовары.СуммаНДС);
// Евросиб Гудкова) 				
			Иначе	
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
				НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
				НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
				НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			КонецЕсли;
		КонецЦикла;
		НСтр 					= СвязанныеСчетаПоставщиков.Добавить();
		НСтр.СчетПоставщика 	= ДанныеЗаполнения;
		НСтр.СуммаНаПТУ 		= ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	
	//Евросиб Каблов 12.08.2022 ( Task 55578	
	Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
	
	//Гудкова РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,ТекущаяДата());
	//Гудкова КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	//Гудкова КурсВзаиморасчетов = РезультатВалюта.Курс;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Константы.МаршрутизироватьПТУ.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить(); 
	//Евросиб - АСуслов 24.03.2023 9:41:32 #65868
	//(
	ДатаПоступленияДокумента = ТекущаяДата();
	СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов = Дата(1,1,1);
	//)
	//Евросиб - АСуслов 24.03.2023 9:41:41 #65868

	//Евросиб Каблов 12.08.2022 ( Task 55578
	//Ответственный = Пользователи.ТекущийПользователь();
	Ответственный = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственногоЗаДоговор(ДоговорКонтрагента);
	//Евросиб Каблов 12.08.2022 )
//Евросиб Гудкова( 11.02.2020 Ticket№ 0182509
//	удПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
//Евросиб Гудкова( 02.02.2020 
	ДатаМодификации = Неопределено;
//Евросиб Гудкова( 16.07.2021 Ticket№ 0237868
	//Евросиб - АСуслов 18.11.2022 16:21:10 #58550
	//(
	//УдалитьВОчередиАвторазнесения = Ложь;
	//)
	//Евросиб - АСуслов 18.11.2022 16:21:13 #58550
// Евросиб Гудкова) 	
	Для каждого Стр из Услуги Цикл
		Стр.ГУИДПТУ = "";
	КонецЦикла;
//Евросиб Гудкова( 02.01.2021 Ticket№ 0218069
	СвязанныеСчетаПоставщиков.Очистить();
	СвязьУслугИСчетов.Очистить();
// Евросиб Гудкова) 	
	//Разнесение.Очистить();
	
	// ++ ДИТ Поморцева Т.П. Задача 0242358 10.09.21.
	РазрешенаВыгрузкаВУПП = Ложь;
	// -- ДИТ Поморцева Т.П. Задача 0242358 10.09.21.
	
	// ++ ДИТ Сгонник, US 35086; TA 44816 2022-01-11
	СсылкаОсновногоДокументаДО = "";
	// -- ДИТ Сгонник, US 35086; TA 44816 2022-01-11
	
КонецПроцедуры

//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
Процедура СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( ТекстОшибки, Отказ = Ложь )
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	Если НЕ ДополнительныеСвойства.Свойство("ТекстОшибкиЗаписиДокумента") Тогда
		ДополнительныеСвойства.Вставить("ТекстОшибкиЗаписиДокумента", ТекстОшибки);
	Иначе
		ДополнительныеСвойства.ТекстОшибкиЗаписиДокумента = Строка(ДополнительныеСвойства.ТекстОшибкиЗаписиДокумента) 
															+ Символы.ПС + ТекстОшибки;	
	КонецЕсли;
														
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец

//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
Процедура ОчиститьДополнительныеСвойства_ТекстОшибкиЗаписиДокумента()
	Если ДополнительныеСвойства.Свойство("ТекстОшибкиЗаписиДокумента") Тогда
		ДополнительныеСвойства.Вставить("ТекстОшибкиЗаписиДокумента", "");
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
    //Евросиб СубботинВ #99828 22.01.2025 Начало
    //ЗаявкиНаОплатуСервер.ПроверитьВозможностьЗаписиДокумента(ЭтотОбъект, Отказ);  добавил признак для проверки
	ЗаявкиНаОплатуСервер.ПроверитьВозможностьЗаписиДокумента(ЭтотОбъект, Отказ, РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
	//Евросиб СубботинВ #99828 22.01.2025 Конец

	//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
	ОчиститьДополнительныеСвойства_ТекстОшибкиЗаписиДокумента();
	//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
	
	// ++ ДИТ_Агафонов_task 41390 16.01.2023
	Если не ЭтоНовый() и не РольДоступна("ПолныеПрава") Тогда
		Корректировка = Документы.КорректировкаПоступления.ПолучитьКорректировкуПоОснованию(Ссылка);
		//Евросиб СубботинВ #97888 16.01.2025 Начало // добавил код позволяющий менять какие-то поля и провести док, имея корректировку, делал для даты оплаты 
		//Если ЗначениеЗаполнено(Корректировка) Тогда
		Если ЗначениеЗаполнено(Корректировка) и не ПроверитьРеквизитыДляПерепроведенияСКорректировкой() Тогда	
		//Евросиб СубботинВ #97888 16.01.2025 Конец
			Отказ = Истина;
			//Сообщить("Работа с документом "+Ссылка+" должна происходить через Документ исправления "+Корректировка);
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Работа с документом "+Ссылка+" должна происходить через Документ исправления "+Корректировка );
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	// -- ДИТ_Агафонов_task 41390 16.01.2023
	
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(ДатаСФХЖ) И ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаСФХЖ")) И Год(ДатаСФХЖ) <> Год(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаСФХЖ")) Тогда
		СтатусАкцепта = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка).СтатусРазнесения;
		Если НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта
			//Евросиб - АСуслов 01.12.2022 9:42:27 #0293662 
			//(
			И НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан 
			//)
			//Евросиб - АСуслов 01.12.2022 9:42:43 #0293662 
			Тогда
			Отказ = Истина;
			//Сообщить("Для документа существует актуальный акцепт. Запрещена смена года для даты совершения факта хоз. жизни");
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Для документа существует актуальный акцепт. Запрещена смена года для даты совершения факта хоз. жизни" );
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
			Возврат;
		Иначе
			ДатаМодификации = ТекущаяДата();
		КонецЕсли; 
	КонецЕсли;
 	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(ДатаСФХЖ) И ДатаВходящегоДокумента >= Дата(2022,1,1) Тогда
		ДатаСФХЖ = ДатаВходящегоДокумента;
	КонецЕсли;
 	//Евросиб Литвинов) 
	//Евросиб - АСуслов 03.03.2023 16:40:50 #65484
	//(
	УстановитьПризнакВсеЗаказыПоПТУВыгруженыВУПП();
	//)
	//Евросиб - АСуслов 03.03.2023 16:40:52 #65484
		
		
	//Евросиб Каблов 16.02.2021 ( Ticket#0222945
	Если ЭтоНовый() Тогда
		ДокументПроведен = Ложь;
	Иначе
	    ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Проведен");	
	КонецЕсли;
	
	Если (Не ПометкаУдаления) И (Не ДокументПроведен) И ЗначениеЗаполнено(НомерВходящегоДокумента) И Контрагент <> Справочники.Контрагенты.РЖД Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
		//|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", НомерВходящегоДокумента);
		//Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ДатаВходящегоДокумента));
		//Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(ДатаВходящегоДокумента));
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
		    Отказ = Истина;
			ТекстСообщения = СтрШаблон("Поступление с номером входящего документа %1 уже зарегистрировано в системе!", НомерВходящегоДокумента);
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( ТекстСообщения );
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 16.02.2021 )   
	
	//Евросиб(ДИТ) Антонова А.С. US 105103 ТА 105106 Начало 19.03.2025
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение или РежимЗаписи = РежимЗаписиДокумента.Запись) 
		и КонецДня(ДатаВходящегоДокумента) > КонецДня(ТекущаяДата()) Тогда
		Отказ = Истина;
		ТекстСообщения = СтрШаблон("Запись/проведение документа будущей датой запрещена!");
		СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства(ТекстСообщения);
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 105103 ТА 105106 Конец 19.03.2025
	
	//Евросиб Каблов 13.04.2021 ( Ticket#0228396
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ЭтоНовый() Тогда
			СохраненнаяДатаВходящегоДокумента = ДатаВходящегоДокумента;
		Иначе	
			СохраненнаяДатаВходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаВходящегоДокумента");
		КонецЕсли;
		
		Если Не Проведен Или СохраненнаяДатаВходящегоДокумента <> ДатаВходящегоДокумента Тогда
			
			// ДИТ Поморцева Т.П. TicketID=0232521 20.05.2021 Начало
			//РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "Дата, СрокДействия");
			//Если РеквизитыДоговора.Дата > ДатаВходящегоДокумента Или РеквизитыДоговора.СрокДействия < ДатаВходящегоДокумента Тогда
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа не входит в период действия договора!",,,, Отказ);
			//КонецЕсли;
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "ДатаНачалаДействияДоговора, СрокДействия");
			Если РеквизитыДоговора.ДатаНачалаДействияДоговора > ДатаВходящегоДокумента Или РеквизитыДоговора.СрокДействия < ДатаВходящегоДокумента Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа не входит в период действия договора!",,,, Отказ);
				//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
				СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Дата документа не входит в период действия договора!", Отказ );
				//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
			КонецЕсли;
			// ДИТ Поморцева Т.П. TicketID=0232521 20.05.2021 Конец
			
		КонецЕсли;
		
		//Евросиб Каблов 12.01.2024 ( Ticket#0330861
	Иначе
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
			|	Диадок_Документы.Документ КАК Документ,
			|	Диадок_Документы.Статус КАК Статус
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_Документы КАК Диадок_Документы
			|		ПО ПоступлениеТоваровУслуг.Ссылка = Диадок_Документы.Документ
			|ГДЕ
			|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И Выборка.Статус = "Подписан" Тогда
				
					//ОбщегоНазначения.СообщитьПользователю("Невозможно отменить проведение подписанного документа, полученного посредством ЭДО. Обратитесь к ответственному сотруднику",,,, Отказ);
					//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
					СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Невозможно отменить проведение подписанного документа, полученного посредством ЭДО. Обратитесь к ответственному сотруднику", Отказ );
					//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
					
				ИначеЕсли Не Выборка.ПометкаУдаления И ПометкаУдаления Тогда
					
					Если ЗначениеЗаполнено(Выборка.Статус) Тогда
						ИсключаемыеСтатусы = Новый Массив;
						ИсключаемыеСтатусы.Добавить("Аннулирован");
						ИсключаемыеСтатусы.Добавить("Отказано в подписи контрагенту");
						Если ИсключаемыеСтатусы.Найти(Выборка.Статус) = Неопределено Тогда
							//ОбщегоНазначения.СообщитьПользователю("Документ, полученный посредством ЭДО, можно удалить из системы после отказа в подписи в ЭДО. Обратитесь к ответственному сотруднику",,,, Отказ);
							//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
							СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Документ, полученный посредством ЭДО, можно удалить из системы после отказа в подписи в ЭДО. Обратитесь к ответственному сотруднику", Отказ );
							//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//Евросиб Каблов 12.01.2024 )
		
	КонецЕсли;
	//Евросиб Каблов 13.04.2021 ) 
	
	//Евросиб - АСуслов 26.08.2020 10:06:53 #
	//(
	Ошибки = "";
	//Евросиб - АСуслов 14.12.2022 16:17:27 #62448
	//(
	//Если ПометкаУдаления Тогда
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//)
	//Евросиб - АСуслов 14.12.2022 16:17:29 #62448
		//Отказ = Истина;
		//СписокДокументов = ПолучитьСписокАкцептовИКоррПТУ();
		//Для каждого свДокумент Из СписокДокументов Цикл
		//	об = свДокумент.Ссылка.ПолучитьОбъект();
		//	об.УстановитьПометкуУдаления(Истина);
		//КонецЦикла;
		ПроверитьНаличиеАктуальногоАкцептаИКоррПТУ(Отказ, Ошибки); 
		// Евросиб(ДИТ) US 73033 ТА 88761 Сержантова А.С. 06.08.2024
		// Добавила в условие - и Ошибки <> ""
		Если Отказ и Ошибки <> "" Тогда
			//ОбщегоНазначения.СообщитьПользователю(Ошибки);
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( Ошибки );
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
			Возврат;
		КонецЕсли; 	
	КонецЕсли; 
	
	ПроверитьИзмененияКлючевыхДанныхДляАкцепта(Отказ, Ошибки);
	//Евросиб Каблов 12.01.2024 ( Ticket#0330861
	//Если Отказ Тогда
	Если Отказ И ЗначениеЗаполнено(Ошибки) Тогда
	//Евросиб Каблов 12.01.2024 )
		//ОбщегоНазначения.СообщитьПользователю(Ошибки);
		//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
		СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( Ошибки );
		//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
		Возврат;
	КонецЕсли; 	
	//)
	//Евросиб - АСуслов 26.08.2020 10:06:54 #
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
//Евросиб Гудкова( 14.01.2020 
	СуммаДокумента = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
// Евросиб Гудкова)
	СуммаРаспределенная = СвязьУслугИСчетов.Итог("ОтнесеннаяСумма");
	СуммаНДСРаспределенная = СвязьУслугИСчетов.Итог("СуммаНДС");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС") + Услуги.Итог("СуммаНДС");
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	Для Каждого Стр Из Услуги Цикл
		Если Стр.ПолнаяСумма < Стр.Всего Тогда
			Стр.ПолнаяСумма = Стр.Всего;
		КонецЕсли;
		Если Стр.ПолнаяСуммаНДС < Стр.СуммаНДС Тогда
			Стр.ПолнаяСуммаНДС = Стр.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
	ПолнаяСумма = Услуги.Итог("ПолнаяСумма");
	ПолнаяСуммаНДС = Услуги.Итог("ПолнаяСуммаНДС");
	ПолнаяСуммаРаспределенная = СвязьУслугИСчетов.Итог("ПолнаяСумма");
	ПолнаяСуммаНДСРаспределенная = СвязьУслугИСчетов.Итог("ПолнаяСуммаНДС");
	//Евросиб Каблов 11.10.2023 )
	//Евросиб Каблов 06.10.2020 (
	Если ПолнаяСуммаВСФ < СуммаДокумента Тогда
		ПолнаяСуммаВСФ = СуммаДокумента;
	КонецЕсли;
	//Евросиб Каблов 06.10.2020 )	
	//Евросиб Каблов 02.10.2020 (
	СтрокиБезСтавкиНДС = СвязьУслугИСчетов.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка()));
	//Евросиб Каблов 02.10.2020 )
	Если СуммаДокумента <> СуммаРаспределенная
		ИЛИ СуммаНДСДокумента <> СуммаНДСРаспределенная
		//Евросиб Каблов 11.10.2023 ( Ticket#0317657
		ИЛИ ПолнаяСумма <> ПолнаяСуммаРаспределенная
		ИЛИ ПолнаяСуммаНДС <> ПолнаяСуммаНДСРаспределенная
		//Евросиб Каблов 11.10.2023 )
		//Евросиб Каблов 02.10.2020 ( 
		Или СтрокиБезСтавкиНДС.Количество() > 0 Тогда
		//Евросиб Каблов 02.10.2020 )
		РазнестиУслугиАвтоматически();	
	КонецЕсли;
	Для каждого Стр из Услуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ГУИДПТУ) Тогда Стр.ГУИДПТУ = Строка(Новый УникальныйИдентификатор); КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		Если НЕ ЗначениеЗаполнено(Стр.СчетПоставщика) Тогда
			РезСсылка = неопределено;
			Если Ссылка.Пустая() Тогда
				//Евросиб Каблов 27.01.2021 (
				НовСсылка = ПолучитьСсылкуНового();
				Если Не ЗначениеЗаполнено(НовСсылка) Тогда
				//Евросиб Каблов 27.01.2021 )
					ГУИД = Новый УникальныйИдентификатор;
					НовСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(ГУИД);
					УстановитьСсылкуНового(НовСсылка);
				КонецЕсли;
				Стр.СчетПоставщика = НовСсылка;
				РезСсылка = НовСсылка;
			Иначе
				Стр.СчетПоставщика = Ссылка;
				РезСсылка = Ссылка;
			КонецЕсли;
			Для каждого Стр из СвязьУслугИСчетов Цикл
				Если НЕ ЗначениеЗаполнено(стр.СчетПоставщика) тогда
					стр.СчетПоставщика = РезСсылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
//Гудкова( перенос в акцепт 	
	//// + механика авторазнесения
	//Если ТребуетсяАвторазнесение И НЕ ВыполненоАвторазнесение Тогда
	//	
	//	Разнесение.Очистить();
	//	
	//	Для каждого Стр из Услуги Цикл
	//		НСтр = Разнесение.Добавить();
	//		НСтр.ГУИДПТУ = Стр.ГУИДПТУ;
	//		НайдСтрока = РазнесениеЗатратСервер.НайтиЗатратуПоОписанию(Контрагент, ДоговорКонтрагента, Стр.СписокТС, Стр.СписокТЕ, Стр.СписокТД, Стр.Номенклатура, Стр.Всего, АвторазнесениеДляПятидневок);
	//		ЗаполнитьЗначенияСвойств(НСтр, НайдСтрока);
	//		ЗаполнитьЗначенияСвойств(Стр, НайдСтрока, "НоменклатурнаяГруппа");
	//	КонецЦикла;
	//	
	//	ВыполненоАвторазнесение = Истина;
	//	
	//КонецЕсли;
	//// - механика авторазнесения
	
	//РазнесеноПолностью = (Услуги.Итог("Всего") = Разнесение.Итог("СуммаИтого"));
	
//Евросиб Гудкова( 16.01.2020 
	ПТУМодифицированДляВыгрузки = Ложь;
	Если Не Ссылка.Пустая() Тогда
		ПрошлаяВыгрузка = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Если ЗначениеЗаполнено(ПрошлаяВыгрузка.Ссылка) Тогда
			//ПТУМодифицированДляВыгрузки = ПроверитьРеквизитыПТУНаИзменение("ДатаВходящегоДокумента,НомерВходящегоДокумента,ДатаПересчета,ДоговорКонтрагента,Контрагент,Организация,ПоставщикВУ,Регламентный,СуммаДокумента,РазрешенаВыгрузкаВУПП",
			ПТУМодифицированДляВыгрузки = ПроверитьРеквизитыПТУНаИзменение("ДатаВходящегоДокумента,НомерВходящегоДокумента,ДатаПересчета,ДоговорКонтрагента,Контрагент,Организация,ПоставщикВУ,Регламентный,СуммаДокумента",
											"СчетПоставщика,СуммаНаПТУ");  
			Если ПТУМодифицированДляВыгрузки Тогда
				ДатаМодификации = ТекущаяДата();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
// Евросиб Гудкова) 

//Евросиб Каблов 05.02.2020 (
	ДополнительныеСвойства.Вставить("ПТУМодифицированДляВыгрузки", ПТУМодифицированДляВыгрузки);
//Евросиб Каблов 05.02.2020 ) 

	//Евросиб Ситников К.А.Task 109905 22.07.2025
		
	//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Претензия Тогда 
		
		Документы.ПоступлениеТоваровУслуг.ЗакрытьЗадачиПоУсловиямРегистрацииПТУИПрикрепленияСканов(ЭтотОбъект);
		
	КонецЕсли;
	//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
	
	//Евросиб Ситников К.А.Task 109905 22.07.2025


#Область Состояния

    ВыполнитьПроверкуПризнакКопия(Отказ, РежимЗаписи); //Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025

	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				//Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
				СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Ошибка: одно состояние может встречаться в документе только один раз!");
				//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//-- Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	//Евросиб - АСуслов 15.12.2021 16:10:27 #42234
	//(
//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
//	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
//	Ссылка.Организация <> Организация ИЛИ 
//	Ссылка.Штраф <> Штраф ИЛИ 
////Евросиб Максимова 17062021 #0216135
//	Ссылка.Претензия <> Претензия ИЛИ 
////Евросиб Максимова 17062021 #0216135

//    Ссылка.ЦФО <> ЦФО ИЛИ 
//	Ссылка.Контрагент <> Контрагент ИЛИ
//	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ состояния.Количество() = 0;                                    
	//РеквизитыПТУДляСравнения = "Организация, Штраф, Претензия, ЦФО, Контрагент, ДоговорКонтрагента";
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 15.12.2021 16:10:45 #42234 
	
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		//ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Ссылка);
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", ЭтотОбъект);
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("Штраф", Штраф);
//Евросиб Гудкова( 10.08.2020
		ПараметрыЗапроса.Вставить("Копия", Копия);
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
// Евросиб Гудкова)
//Евросиб Максимова 17062021 #0216135
        ПараметрыЗапроса.Вставить("Претензия", Претензия);
//Евросиб Максимова 17062021 #0216135

		//Евросиб Каблов 16.08.2021 ( Ticket#0240249		
		ПараметрыЗапроса.Вставить("ПолнаяСуммаВСФ", ПолнаяСуммаВСФ / КратностьВзаиморасчетов * КурсВзаиморасчетов);
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		ПараметрыЗапроса.Вставить("ВидУслуг", ВидУслуг);
		//Евросиб Каблов 12.08.2022 )

		//ПараметрыЗапроса.Вставить("РазнесеноПолностью", РазнесеноПолностью);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	//Евросиб Каблов 16.06.2021 ( Ticket#0234671
	//МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор, Отказ, РежимЗаписи);
	//Евросиб Каблов 16.06.2021 )
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
				
				//Евросиб Каблов 07.06.2021 ( Ticket#0234129
				Если Стр.ПримечаниеЗадачаИсполнителю <> НайденнаяСтр[0].ПримечаниеЗадачаИсполнителю Тогда
					Стр.ДатаВозвратаИсполнителю = ТекущаяДата();
				КонецЕсли;
				//Евросиб Каблов 07.06.2021 )
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
#КонецОбласти


//Евросиб Каблов 08.10.2020 (
	ЗаписанноеЗначениеКопия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Копия");
	Если ЗаписанноеЗначениеКопия <> Копия Тогда
		ЕСОбменСервер.ВыгрузитьВРИТМСостояниеКопияВСФ(Ссылка, Копия);
	КонецЕсли;
//Евросиб Каблов 08.10.2020 )         
	//Евросиб - АСуслов 26.05.2022 16:39:55 #52227
	//(  
	//Евросиб - АСуслов 18.11.2022 16:21:46 #58550
	//(
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		//УдалитьВОчередиАвторазнесения = Ложь;
		ПретензииИНеакцептыСервер.ИсключитьИзОчередиАвторазнесения(Ссылка);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 26.05.2022 16:39:57 #52227
	//)
	//Евросиб - АСуслов 18.11.2022 16:21:50 #58550
	
	// ДИТ US 60108 TA 65708 Евсенкин М.А. Начало: 20.02.2023
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Состояния.Состояние КАК Состояние,
	               |	Состояния.Статус КАК Статус,
	               |	Состояния.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	Состояния.ДатаВозвратаИсполнителю КАК ДатаВозвратаИсполнителю
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Состояния КАК Состояния
	               |ГДЕ
	               |	Состояния.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	СтатусыДоЗаписи = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("СтатусыДоЗаписи",СтатусыДоЗаписи);
	// ДИТ US 60108 TA 65708 Евсенкин М.А. Конец: 20.02.2023 
	
	//Евросиб - АСуслов 17.03.2023 14:18:53 #65868
	//(
	Если НЕ ЗначениеЗаполнено(СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов) Тогда
		Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Копия") = Истина
			И Копия = Ложь Тогда
			ДатаПоступленияДокумента = ТекущаяДата();
			Документы.ПоступлениеТоваровУслуг.ПересчитатьСрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов(ДатаПоступленияДокумента, ДоговорКонтрагента, СрокОформленияМотивированногоОтказаОтПриемаПервичныхДокументов);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.03.2023 14:18:55 #65868
	//Евросиб - АСуслов 21.05.2024 13:55:08 #78327
	//(                                                                                           
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "МультивалютныйДоговор, ВалютаВзаиморасчетов");
	Если НЕ РеквизитыДоговора.МультивалютныйДоговор = Истина Тогда
		ВалютаОплаты = РеквизитыДоговора.ВалютаВзаиморасчетов;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 21.05.2024 13:55:09 #78327
	
	// Евросиб(ДИТ) US 56866 ТА 85906 Сержантова А.С. Начало: 05.07.2024
	// работа с документом завершена, можно закрывать темы Диалогов, связанных с документом
	Если не Отказ и РазрешенаВыгрузкаВУПП Тогда 
		СобытияЗакрытияДиалога = Новый Массив;
		СобытияЗакрытияДиалога.Добавить(Перечисления.СобытияЗакрытияДиалогов.РазрешенаВыгрузкаВУПП);
		Диалоги_сервер.НайтиИЗакрытьТемуПоСобытию(Ссылка, СобытияЗакрытияДиалога)
	КонецЕсли;
	// Евросиб(ДИТ) US 56866 ТА 85906 Сержантова А.С. Конец: 05.07.2024
	
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, начало
	Если Документы.ПоступлениеТоваровУслуг.ПрисутствуетНомеклатураСтрахования(ЭтотОбъект) Тогда
		Страхование = Истина;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 92763 / TA 98182, 19-12-2024, конец
	
	//Евросиб Ситников К.А.Task 109905 22.07.2025
	// Перенес проверку перед областью состояния
	
	//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Претензия Тогда 
	//	
	//	Документы.ПоступлениеТоваровУслуг.ЗакрытьЗадачиПоУсловиямРегистрацииПТУИПрикрепленияСканов(ЭтотОбъект);
	//	
	//КонецЕсли;
	//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
	//Евросиб Ситников К.А.Task 109905 22.07.2025
	
	//Евросиб СубботинВ #134283 23.03.2026 Начало
	Если ДополнительныеСвойства.Свойство("ЗагруженИзДиадок") и Страхование и ЗначениеЗаполнено(Автор) Тогда
		ЦФОАвтор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор,"ЦФО");
		Если ЦФОАвтор = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
			Подразделение = Справочники.Подразделения.НайтиПоКоду("000000243");
			ВидУслуг = Перечисления.ВидыУслугПодрядчиков.РасходыПодСервисыКП;
		КонецЕсли;
	КонецЕсли;	
	//Евросиб СубботинВ #134283 23.03.2026 Конец
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураПолученный");
	Если СчетФактура<>Неопределено Тогда
		ОбСчФ = Счетфактура.ПолучитьОбъект();
		//Евросиб Каблов 01.10.2020 (
		//БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
		Если ПометкаУдаления Тогда
			Если Не ОбСчФ.ПометкаУдаления Тогда
				ОбСчф.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Иначе
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
		КонецЕсли;
		//Евросиб Каблов 01.10.2020 )
		
		Если НЕ ОбСчФ.ПометкаУдаления Тогда
			Если Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				Если ОбСчФ.Проведен Тогда
					РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
					//ОбщегоНазначения.СообщитьПользователю(
					//СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					//"Отменено проведение %1",
					//ОбСчФ.Ссылка));
					//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
					СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Отменено проведение %1", ОбСчФ.Ссылка));
					//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
				Иначе
					РежимЗаписи = РежимЗаписиДокумента.Запись;
				КонецЕсли; 
			КонецЕсли; 
			ОбСчФ.Записать(РежимЗаписи);
		Иначе
			//ОбщегоНазначения.СообщитьПользователю(
			//СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//"Документ %1 помечен на удаление, ",
			//ОбСчФ.Ссылка));
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Документ %1 помечен на удаление, ", ОбСчФ.Ссылка));
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
		КонецЕсли; 
	КонецЕсли;
	
	//<< Евросиб - Витвицкий 23.07.2019
	Если ДополнительныеСвойства.Свойство("СтруктураДанных") Тогда
		//Евросиб - АСуслов 27.09.2020 21:49:10 #
		//(
		ТабличныйДокумент = ДополнительныеСвойства.ТабличныйДокументДиадок;
//Евросиб (Литвинов 20.05.2021 #34675
		Если НЕ ТабличныйДокумент = Неопределено Тогда
//Евросиб )Литвинов 20.05.2021 #34675
			ИмяВременногоФайла = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("/\",ДополнительныеСвойства.СтруктураДанных.ИмяФайла+".pdf"," ");
			ИмяВременногоФайла = КаталогВременныхФайлов()+ИмяВременногоФайла;
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДополнительныеСвойства.СтруктураДанных.ИмяФайла+".pdf");
			ПараметрыФайла = Новый Структура;
			ПараметрыФайла.Вставить("Автор", Автор);
			ПараметрыФайла.Вставить("ВладелецФайлов", Ссылка);
			ПараметрыФайла.Вставить("ИмяБезРасширения", СтруктураИмениФайла.ИмяБезРасширения);
			ПараметрыФайла.Вставить("РасширениеБезТочки", ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураИмениФайла.Расширение));
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Создано);
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			ФайлВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ФайлВоВременномХранилище,, "ЭДО");
//Евросиб (Литвинов 20.05.2021 #34675
		Иначе
			Если ДополнительныеСвойства.СтруктураДанных.Свойство("Метаданные") 
			И ДополнительныеСвойства.СтруктураДанных.Метаданные.Свойство("FileName") Тогда
				ФайлДД = ДополнительныеСвойства.СтруктураДанных.Ссылка;
				СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДополнительныеСвойства.СтруктураДанных.Метаданные.FileName);
				
				ОсновнойМодуль = Обработки.КонтурЭДО.Создать();
				СтруктураДокументаФайлДД = ОсновнойМодуль.ЭДО_ПолучитьСохраненныйДокумент(ФайлДД);
				
				ИмяВременногоФайла = КаталогВременныхФайлов()+СтруктураДокументаФайлДД.ИмяФайла;
				СтруктураДокументаФайлДД.ДвоичныеДанные.Записать(ИмяВременногоФайла);
				АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(СтруктураДокументаФайлДД.ДвоичныеДанные, Новый УникальныйИдентификатор);
				ПараметрыФайла = Новый Структура;
				ПараметрыФайла.Вставить("Автор", Автор);
				ПараметрыФайла.Вставить("ВладелецФайлов", Ссылка);
				ПараметрыФайла.Вставить("ИмяБезРасширения", ДополнительныеСвойства.СтруктураДанных.ИмяФайла);
				ПараметрыФайла.Вставить("РасширениеБезТочки", ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураИмениФайла.Расширение));
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Создано);

				РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВременногоХранилищаФайла,, "ЭДО");
			КонецЕсли;	
		КонецЕсли;	
//Евросиб )Литвинов 20.05.2021 #34675
		//)
		//Евросиб - АСуслов 27.09.2020 21:49:10 #
		
		//ЕСОбменСервер.ЗаписатьСостояниеДокументаВДиадоке(Ссылка, СтруктураДанных.СостояниеДокументооборота, Создано);		
	КонецЕсли;	
	//>> Евросиб - Витвицкий 23.07.2019	

	// Евросиб Фролов (08.10.2021 Task №39041
	Если Не Отказ Тогда
		МассивКонтейнеров = ПолучитьМассивКонтейнеровДокумента();
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Евросиб - АСуслов 03.03.2023 11:28:29 #65484
	//(                                           
	//перенесено в модуль менеджера
	//ПроверитьВозможностьВыгрузкиВУПП
	//Если РазрешенаВыгрузкаВУПП Тогда
	//	СуммаПоСчетам = СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	//	
	//	Если ПолнаяСуммаВСФ <> СуммаПоСчетам Тогда
	//		Сообщить("Полная сумма ВСФ "+ПолнаяСуммаВСФ+" должна соответствовать сумме привязанных счетов поставщиков "+СуммаПоСчетам+"! Проведение документа запрещено!");
	//		ДанныеПоОтветственному = МаршрутизацияСервер.ПолучитьИсполнителяЭтапа(Ссылка, "Регистрация и проверка ПТУ%"); 
	//		Если ЗначениеЗаполнено(ДанныеПоОтветственному.Наименование) И ДанныеПоОтветственному.Ссылка <> ПользователиКлиентСервер.ТекущийПользователь() Тогда
	//			ТекстСообщения = СтрШаблон("Обратитесь к пользователю %1", ДанныеПоОтветственному.Наименование);
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//		КонецЕсли;
	//		
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 03.03.2023 11:30:53 #65484
	ПроверитьПроведениеСчетов(Отказ);
	ПроверитьРазнесениеУслугПоСчетам(Отказ);
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, Новый Структура("Контрагент, ДоговорКонтрагента, ПодразделениеОрганизации, ЦФО, Регламентный"), Отказ); 
	СтруктураУслуг = Новый Структура("Номенклатура, Содержание");
	Если УчитыватьНДС Тогда
		СтруктураУслуг.Вставить("СтавкаНДС");
	КонецЕсли; 
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураУслуг, Отказ); 

	Если ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		Период = ДатаВходящегоДокумента;
	Иначе
		Период = Дата;
	КонецЕсли; 
		
	Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	Движения.ПривязанныеСчетаПоставщиков.Записывать = Истина;
	Движения.ПривязанныеСчетаПоставщиков.БлокироватьДляИзменения = Истина;
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		
		Если Стр.СчетПоставщика = Ссылка Тогда  // Кольцевая ссылка
			
			// ПривязанныеСчетаПоставщиков
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьПриход();
			Движение.Период 		= Период; 
			Движение.Организация 	= Организация;
			Движение.Контрагент		= Контрагент;
			Движение.Договор		= ДоговорКонтрагента;
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор = Ссылка;
			
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
			Движение.Период 		= Период; 
			Движение.Организация 	= Организация;
			Движение.Контрагент		= Контрагент;
			Движение.Договор		= ДоговорКонтрагента;
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор = Ссылка;
			
			// ЗаказПоставщику_ПП
			Движение = Движения.ЗаказПоставщику_ПП.ДобавитьПриход();
			Движение.Период 		= Период; 
			Движение.Организация 	= Организация;
			Движение.Контрагент		= Контрагент;
			Движение.Договор		= ДоговорКонтрагента;
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор = Ссылка;
			
		ИначеЕсли ЗначениеЗаполнено(Стр.СчетПоставщика) И ТипЗнч(Стр.СчетПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			Движение = Движения.ПривязанныеСчетаПоставщиков.ДобавитьРасход();
			Движение.Период 		= Период; 
			Движение.Организация 	= Организация;
			Движение.Контрагент		= Контрагент;
			Движение.Договор		= ДоговорКонтрагента;
			Движение.СчетПоставщика = Стр.СчетПоставщика;
			Движение.Сумма 			= Стр.СуммаНаПТУ;
			Движение.ДопРегистратор = Ссылка;
			
		КонецЕсли; 
		
	КонецЦикла;
	Движения.Записать();
	//Евросиб Коханенко Н.А. 23.10.2023 (( #76425 
	//КонтрольОтрицательныхОстатковПоПривязаннымСчетам(Отказ);
	КорректировкиПТУСервер.КонтрольОтрицательныхОстатковПоПривязаннымСчетам(Ссылка, Отказ);
	//Евросиб Коханенко Н.А. 23.10.2023 )) #76425 

	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекущаяДата());
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	// Разнесенная сумма
	
	//Взаиморасчеты с поставщиками
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	// Евросиб Фролов (04.04.2022 Task №49392
	СтатусыВзаиморасчетов = Документы.ПоступлениеТоваровУслуг.ОпределитьСтатусДляВзаиморасчетов(Ссылка);
	// Евросиб Фролов)

	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл  
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьПриход();
				Движение.Период 		= Период; 
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= Контрагент;
				Движение.Договор 		= ДоговорКонтрагента;
				Движение.ДокументВзаиморасчетов = Стр.СчетПоставщика;
				
				// Евросиб Фролов (04.04.2022 Task №49392
				Движение.СогласованаСуммаПТУ = СтатусыВзаиморасчетов.СогласованаСуммаПТУ;
				Движение.ЗавершенаПроверкаПТУ = СтатусыВзаиморасчетов.ЗавершенаПроверкаПТУ;
				Движение.РазрешенаВыгрузкаПТУ = РазрешенаВыгрузкаВУПП;
				// Евросиб Фролов)
				
				Движение.СуммаБезНДС 	= Стр.СуммаНаПТУ;
				Движение.СуммаНДС 		= 0;  //не определить, и смысла в этом нет, кмк
				Движение.СуммаСНДС 		= Стр.СуммаНаПТУ;
				Движение.ДатаРасчетов 	= ДатаВходящегоДокумента;
				Движение.ДопРегистратор = Ссылка; 
	КонецЦикла;
	
	//Закупки
	Закупки = Движения.Закупки;
	Закупки.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Движение = Закупки.Добавить();
		Движение.Период = Дата;
		
		//Измерения
		Движение.ДокументЗакупки = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		//Движение.Сделка = УдалитьСделка;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТовары.Номенклатура;
		
		//Ресурсы
		Движение.Количество = СтрокаТовары.Количество;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СтрокаТовары.Сумма, СтрокаТовары.Сумма + СтрокаТовары.СуммаНДС);			
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТовары.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из Услуги Цикл
		
		Движение = Закупки.Добавить();
		Движение.Период = Дата;
		
		//Измерения
		Движение.ДокументЗакупки = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		//Движение.Сделка = УдалитьСделка;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТовары.Номенклатура;
		
		//Ресурсы
		Движение.Количество = СтрокаТовары.Количество;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СтрокаТовары.Сумма, СтрокаТовары.Сумма + СтрокаТовары.СуммаНДС);			
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТовары.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
	КонецЦикла;

	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураПолученный");
	Если СчФ <> Неопределено Тогда
		ОбСчФ = СчФ.ПолучитьОбъект();
		Если Не ОбСчФ.ПометкаУдаления Тогда
			ОбСчФ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕСли;

	//Евросиб - АСуслов 21.05.2024 16:17:01 #78327
	//(
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Евросиб СубботинВ #102528 09.04.2025 Начало

	//"ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК ОснованиеДляПлатежа,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СуммаНаПТУ КАК Сумма,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ВалютаДокумента КАК Валюта,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.Дата КАК Период
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	//|ГДЕ
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = &Ссылка";
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика КАК ОснованиеДляПлатежа,
	|	СУММА(ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма) КАК Сумма,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ВалютаДокумента КАК Валюта,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.Дата КАК Период,
	|	СУММА(ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС) КАК СуммаНДС,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|ГДЕ
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка = &Ссылка 
	//Евросиб СубботинВ #120458 29.09.2025 Начало
	|	И ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика Ссылка Документ.ПоступлениеТоваровУслуг
	//Евросиб СубботинВ #120458 29.09.2025 Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.Дата,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.ВалютаДокумента,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика";

	
	//Евросиб СубботинВ #102528 09.04.2025 Конец
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Движения.ЗаявкиНаОплату.Записывать = Истина;
	Движения.ЗаявкиНаОплату.Загрузить(Запрос.Выполнить().Выгрузить());
	//)
	//Евросиб - АСуслов 21.05.2024 16:17:03 #78327
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 23.10.2023 (( #76425 
//перенесено в общий модуль КорректировкиПТУСервер
//Процедура КонтрольОтрицательныхОстатковПоПривязаннымСчетам(Отказ)
//	
//	//Евросиб Каблов 11.05.2021 ( Ticket#0230766
//	//   Запрос = Новый Запрос(
//	//   "ВЫБРАТЬ
//	//   |	СвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщику
//	//   |ПОМЕСТИТЬ ВР_ПривязанныеСчетаПоставщику
//	//   |ИЗ
//	//   |	&СвязанныеСчетаПоставщиков КАК СвязанныеСчетаПоставщиков
//	//   |;
//	//   |
//	//   |////////////////////////////////////////////////////////////////////////////////
//	//   |ВЫБРАТЬ
//	//   |	ОстаткиПоСчетам.СчетПоставщика КАК Номенклатура,
//	//   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОстаткиПоСчетам.СчетПоставщика) КАК СчетПредставление,
//	//   |	-ОстаткиПоСчетам.СуммаОстаток КАК ПереборСуммы
//	//   |ИЗ
//	//   |	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
//	//   |			&МоментВремени,
//	//   |			СчетПоставщика В
//	//   |				(ВЫБРАТЬ
//	//   |					ПривязанныеСчетаПоставщику.СчетПоставщику КАК СчетПоставщику
//	//   |				ИЗ
//	//   |					ВР_ПривязанныеСчетаПоставщику КАК ПривязанныеСчетаПоставщику)) КАК ОстаткиПоСчетам
//	//   |ГДЕ
//	//   |	ОстаткиПоСчетам.СуммаОстаток < 0");
//    //ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
//    //Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
//    //Запрос.УстановитьПараметр("СвязанныеСчетаПоставщиков", СвязанныеСчетаПоставщиков.Выгрузить());
//    //РезультатЗапроса = Запрос.Выполнить();
//   
//////    Если Не РезультатЗапроса.Пустой() Тогда
//    //    Отказ = Истина;
//    //    ВыборкаОшибки = РезультатЗапроса.Выбрать();
//    //    Пока ВыборкаОшибки.Следующий() Цикл
//    //        Сообщение = Новый СообщениеПользователю;
//    //        Сообщение.Текст = "По счету "+ВыборкаОшибки.СчетПредставление+" превышение суммы "+ВыборкаОшибки.ПереборСуммы+" руб.";
//    //        Сообщение.Сообщить();
//    //    КонецЦикла;
//    //КонецЕсли;
//    
//    Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщику
//	|ПОМЕСТИТЬ ВР_ПривязанныеСчетаПоставщику
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
//	|ГДЕ
//	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОстаткиПоСчетам.СчетПоставщика КАК Номенклатура,
//	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОстаткиПоСчетам.СчетПоставщика) КАК СчетПредставление,
//	|	-ОстаткиПоСчетам.СуммаОстаток КАК ПереборСуммы,
//	|	ЛОЖЬ КАК СчетПозжеПТУ
//	|ИЗ
//	|	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
//	|			,
//	|			СчетПоставщика В
//	|				(ВЫБРАТЬ
//	|					ПривязанныеСчетаПоставщику.СчетПоставщику КАК СчетПоставщику
//	|				ИЗ
//	|					ВР_ПривязанныеСчетаПоставщику КАК ПривязанныеСчетаПоставщику)) КАК ОстаткиПоСчетам
//	|ГДЕ
//	|	ОстаткиПоСчетам.СуммаОстаток < 0");
//    //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, начало (закомментировал, согласовано отключение условия по дате)
//	//|
//	//|ОБЪЕДИНИТЬ ВСЕ
//	//|
//	//|ВЫБРАТЬ
//	//|	ВР_ПривязанныеСчетаПоставщику.СчетПоставщику,
//	//|	ПРЕДСТАВЛЕНИЕ(ВР_ПривязанныеСчетаПоставщику.СчетПоставщику),
//	//|	0,
//	//|	ИСТИНА
//	//|ИЗ
//	//|	ВР_ПривязанныеСчетаПоставщику КАК ВР_ПривязанныеСчетаПоставщику
//	//|ГДЕ
//	//|	ВР_ПривязанныеСчетаПоставщику.СчетПоставщику.Дата > &ДатаПоступления
//	//|	И ВР_ПривязанныеСчетаПоставщику.СчетПоставщику ССЫЛКА Документ.СчетНаОплатуПоставщика");
//	//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, конец
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	//Запрос.УстановитьПараметр("ДатаПоступления", Дата); //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, закомментировал, согласовано отключение условия по дате
//	ДанныеОбОшибке = Запрос.Выполнить().Выбрать();
//   
//	Пока ДанныеОбОшибке.Следующий() Цикл
//		//Если ДанныеОбОшибке.СчетПозжеПТУ Тогда
//		//	ТекстСообщения = СтрШаблон("Дата счета %1 больше даты поступления!", ДанныеОбОшибке.СчетПредставление);
//		//ИначеЕсли ДанныеОбОшибке.ПереборСуммы <> 0 Тогда
//		//	ТекстСообщения = СтрШаблон("По счету %1 превышение суммы %2 руб.", ДанныеОбОшибке.СчетПредставление, ДанныеОбОшибке.ПереборСуммы);
//		//КонецЕсли;
//		//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, начало (согласовано отключение условия по дате, оставляем только контроль сумм)
//		ТекстСообщения = СтрШаблон("По счету %1 превышение суммы %2 руб.", ДанныеОбОшибке.СчетПредставление, ДанныеОбОшибке.ПереборСуммы);
//		//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, конец
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
//	КонецЦикла;
//	//Евросиб Каблов 11.05.2021 )
//	
//КонецПроцедуры
//Евросиб Коханенко Н.А. 23.10.2023 )) #76425

Процедура ПроверитьЗаполнитьСвязанныеСчетаПоставщиков() Экспорт
	
	СчетаПоставщиковСумма = СвязанныеСчетаПоставщиков.Итог("СуммаНаПТУ");
	ОтнесеннаяСуммаОтнесенныхСчетов = 0;
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		Если ЗначениеЗаполнено(Стр.СчетПоставщика) Тогда ОтнесеннаяСуммаОтнесенныхСчетов = ОтнесеннаяСуммаОтнесенныхСчетов + Стр.СуммаНаПТУ; КонецЕсли;
	КонецЦикла;
	
	Разница = ПолнаяСуммаВСФ-ОтнесеннаяСуммаОтнесенныхСчетов;
	Если (Разница) = 0 Тогда Возврат; КонецЕсли;
		
	МассивНС = СвязанныеСчетаПоставщиков.НайтиСтроки(Новый Структура("СчетПоставщика", ПредопределенноеЗначение("Документ.СчетНаОплатуПоставщика.ПустаяСсылка")));
	Для каждого Стр из МассивНС Цикл
		СвязанныеСчетаПоставщиков.Удалить(Стр);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтрокиПоПТУ = СвязанныеСчетаПоставщиков.НайтиСтроки(Новый Структура("СчетПоставщика", Ссылка));
		Если СтрокиПоПТУ.Количество() > 0 Тогда
			СтрокиПоПТУ[0].СуммаНаПТУ = СтрокиПоПТУ[0].СуммаНаПТУ + Разница;
			Разница = 0;
	    КонецЕсли;
	КонецЕсли;
	
	Если Разница <> 0 Тогда
		НСтр = СвязанныеСчетаПоставщиков.Добавить();
		НСтр.СуммаНаПТУ = Разница;
	КонецЕсли;
	
КонецПроцедуры

Функция РублеваяСумма(ИсхСумма)
	ВалютаРег = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаДокумента <> ВалютаРег Тогда
		СуммаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(ИсхСумма,ВалютаДокумента,ВалютаРег,Дата);
		Возврат СуммаРуб;
	Иначе
		Возврат ИсхСумма;
	КонецЕсли;
КонецФункции

Функция ПолучитьСуммыИзТаблицыСоответствия(Счет)
	МассивРезультата = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СчетПоставщика", Счет);
	
	ВыборкаСтрок = СвязьУслугИСчетов.Выгрузить(ПараметрыОтбора);
	Если ВыборкаСтрок.Количество() > 0 Тогда
		ВыборкаСтрок.Свернуть("СтавкаНДС","ОтнесеннаяСумма, СуммаНДС");
		Для каждого Стр из ВыборкаСтрок Цикл
			СтруктураСумм = Новый Структура;
			СтруктураСумм.Вставить("СтавкаНДС",Стр.СтавкаНДС);
			СтруктураСумм.Вставить("СуммаИтого",Стр.ОтнесеннаяСумма);
			СтруктураСумм.Вставить("СуммаНДС",Стр.СуммаНДС);
			МассивРезультата.Добавить(СтруктураСумм);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивРезультата;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	//СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураПолученный");
	//Если СчФ <> Неопределено Тогда
	//	ОбСчФ = СчФ.ПолучитьОбъект();
	//	Если Не ОбСчФ.ПометкаУдаления Тогда
	//		ОбСчФ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	КонецЕсли;
	//КонецЕСли;

КонецПроцедуры

Процедура РазнестиУслугиАвтоматически() Экспорт
	
	МассивКопияТЧ = Новый Массив;
	Для каждого Стр из СвязанныеСчетаПоставщиков Цикл
		МассивКопияТЧ.Добавить(Новый Структура("СчетПоставщика,СуммаНаПТУ", Стр.СчетПоставщика, Стр.СуммаНаПТУ));
	КонецЦикла;
	
//Евросиб Гудкова( 22.01.2020 
	Если СвязьУслугИСчетов.Количество() = 0 Тогда
		Для каждого СтрУслуги из Услуги Цикл
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
				СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			//Евросиб Каблов 11.10.2023 ( Ticket#0317657
			//Если СтрУслуги.Всего <> 0 Тогда
			//	НСтр = СвязьУслугИСчетов.Добавить();
			//	ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС");
			//КонецЕсли;
			
			//ПолнаяСуммаПоСтроке = СтрУслуги.Цена * СтрУслуги.Количество;
			Если СтрУслуги.Всего <> 0 Или СтрУслуги.ПолнаяСумма <> 0 Тогда			
				НСтр = СвязьУслугИСчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС, ПолнаяСумма, ПолнаяСуммаНДС");
				//НСтр.ПолнаяСуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ПолнаяСуммаПоСтроке, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС), УчитыватьНДС, СуммаВключаетНДС);
				//НСтр.ПолнаяСумма = ПолнаяСуммаПоСтроке + ?(СуммаВключаетНДС, 0, НСтр.ПолнаяСуммаНДС);
			КонецЕсли;
			//Евросиб Каблов 11.10.2023 )
		КонецЦикла;
	КонецЕсли; 
// Евросиб Гудкова)

	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	
	//Проходов = СвязьУслугИСчетов.Количество();
	//
	//Сч = 1;
	//
	//Пока Сч <= Проходов Цикл
	//	
	//	Для каждого стрСвязь из СвязьУслугИСчетов Цикл
	//		Если ЗначениеЗаполнено(стрСвязь.ОтнесеннаяСумма) тогда Продолжить; КонецЕсли;
	//		
	//		Для каждого СтрСчет из МассивКопияТЧ Цикл
	//			Если СтрСчет.СуммаНаПТУ = 0 Тогда Продолжить; КонецЕсли;
	//			
	//			Если стрСвязь.Всего <= СтрСчет.СуммаНаПТУ Тогда
	//				стрСвязь.ОтнесеннаяСумма = стрСвязь.Всего;
	//				//стрСвязь.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(стрСвязь.ОтнесеннаяСумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(стрСвязь.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	//				СтрСчет.СуммаНаПТУ = СтрСчет.СуммаНаПТУ - стрСвязь.ОтнесеннаяСумма;
	//				стрСвязь.СчетПоставщика = СтрСчет.СчетПоставщика;
	//			Иначе
	//				Проходов = Проходов + 1;
	//				стрСвязь.СчетПоставщика = СтрСчет.СчетПоставщика;
	//				стрСвязь.ОтнесеннаяСумма = СтрСчет.СуммаНаПТУ;
	//				СтрСчет.СуммаНаПТУ = 0;
	//				НСтр = СвязьУслугИСчетов.Вставить(стрСвязь.НомерСтроки);
	//				ЗаполнитьЗначенияСвойств(НСтр, стрСвязь,,"ОтнесеннаяСумма, СчетПоставщика");
	//				НСтр.Всего = НСтр.Всего - стрСвязь.ОтнесеннаяСумма;
	//				//стрСвязь.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(стрСвязь.ОтнесеннаяСумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(стрСвязь.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	//			КонецЕсли;
	//			
	//			Прервать;
	//			
	//		КонецЦикла;
	//		
	//		Прервать;
	//		
	//	КонецЦикла;
	//	
	//	Сч = Сч + 1;
	//	
	//КонецЦикла;
	
	//// А теперь дополнительный проход с тем, чтобы выровнять сумму НДС. Яна говорила, что последняя строка считается как СуммаНДСВсего - Сумма предыдущих строк НДС
	//Для каждого СтрУ из Услуги Цикл
	//	
	//	НайдСтрокиСвязь = СвязьУслугИСчетов.НайтиСтроки(Новый Структура("ГУИДПТУ", СтрУ.ГУИДПТУ));
	//	
	//	НакопительныйИтогПоНДС = 0;
	//	Для Сч = 0 По НайдСтрокиСвязь.Количество()-1 цикл
	//		//Евросиб Каблов 02.10.2020 (
	//		НайдСтрокиСвязь[Сч].СтавкаНДС = СтрУ.СтавкаНДС;
	//		//Евросиб Каблов 02.10.2020 )
	//		Если Сч = НайдСтрокиСвязь.Количество()-1 Тогда
	//			НайдСтрокиСвязь[Сч].СуммаНДС = СтрУ.СуммаНДС - НакопительныйИтогПоНДС;
	//		Иначе
	//			Если УчитыватьНДС И НЕ СуммаВключаетНДС Тогда
	//				СтНдс = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НайдСтрокиСвязь[Сч].СтавкаНДС);
	//				НайдСтрокиСвязь[Сч].СуммаНДС = НайдСтрокиСвязь[Сч].ОтнесеннаяСумма - НайдСтрокиСвязь[Сч].ОтнесеннаяСумма / ((100+СтНдс)/100);
	//			ИначеЕсли УчитыватьНДС и СуммаВключаетНДС Тогда
	//				СтНдс = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НайдСтрокиСвязь[Сч].СтавкаНДС);
	//				НайдСтрокиСвязь[Сч].СуммаНДС = НайдСтрокиСвязь[Сч].ОтнесеннаяСумма / (100+СтНдс) * СтНдс;
	//			КонецЕсли;
	//				
	//			НакопительныйИтогПоНДС = НакопительныйИтогПоНДС + НайдСтрокиСвязь[Сч].СуммаНДС;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//Для каждого СтрНДС из НайдСтрокиСвязь Цикл
	//	//	
	//	//КонецЦикла;
	//	
	//КонецЦикла;
	
	ТаблицаУслуг = СвязьУслугИСчетов.Выгрузить();
	ТаблицаСчетов = СвязанныеСчетаПоставщиков.Выгрузить();
	ТаблицаСчетов.Колонки.Добавить("ПолнаяСуммаНаПТУ", ТаблицаСчетов.Колонки.Найти("СуммаНаПТУ").ТипЗначения);
	Для Каждого СтрСчетов Из ТаблицаСчетов Цикл
		СтрСчетов.ПолнаяСуммаНаПТУ = СтрСчетов.СуммаНаПТУ;
	КонецЦикла;
	
	СвязьУслугИСчетов.Очистить();
	
	Для Каждого СтрУслуг Из ТаблицаУслуг Цикл
		
		НСтр = Неопределено;
		
		Для Каждого СтрСчетов Из ТаблицаСчетов Цикл
			
			Если СтрУслуг.ПолнаяСумма <> 0 И СтрСчетов.ПолнаяСуммаНаПТУ <> 0 Тогда				
				ПолнаяСумма = Мин(СтрУслуг.ПолнаяСумма, СтрСчетов.ПолнаяСуммаНаПТУ);
			Иначе
				ПолнаяСумма = 0;
			КонецЕсли;
			
			Если СтрУслуг.Всего <> 0 И СтрСчетов.СуммаНаПТУ <> 0 Тогда				
				СуммаВУчете = Мин(СтрУслуг.Всего, СтрСчетов.СуммаНаПТУ);
			Иначе
				СуммаВУчете = 0;
			КонецЕсли;
			
			Если ПолнаяСумма <> 0 Или СуммаВУчете <> 0 Тогда
				
				НСтр = СвязьУслугИСчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, СтрУслуг, "Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС");
				
				НСтр.СчетПоставщика = СтрСчетов.СчетПоставщика;
				
				НСтр.ПолнаяСумма = ПолнаяСумма;
				НСтр.ОтнесеннаяСумма = СуммаВУчете;
				
				СтавкаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС);
				ПолнаяСуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ПолнаяСумма, СтавкаНДС, УчитыватьНДС, Истина);
				ПолнаяСуммаНДС = Мин(ПолнаяСуммаНДС, СтрУслуг.ПолнаяСуммаНДС);
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СуммаВУчете, СтавкаНДС, УчитыватьНДС, Истина);
				СуммаНДС = Мин(СуммаНДС, СтрУслуг.СуммаНДС);
				
				//Евросиб Коханенко Н.А. 23.11.2023 (( BUG #77744 TASK #77745
				ПолнаяСуммаНДС = Окр(ПолнаяСуммаНДС, 2);
				СуммаНДС = Окр(СуммаНДС, 2);
				//Евросиб Коханенко Н.А. 23.11.2023 )) BUG #77744 TASK #77745 

				НСтр.ПолнаяСуммаНДС = ПолнаяСуммаНДС;
				НСтр.СуммаНДС = СуммаНДС;
				
				СтрСчетов.ПолнаяСуммаНаПТУ = СтрСчетов.ПолнаяСуммаНаПТУ - ПолнаяСумма;
				СтрСчетов.СуммаНаПТУ = СтрСчетов.СуммаНаПТУ - СуммаВУчете;
				
				СтрУслуг.ПолнаяСумма = СтрУслуг.ПолнаяСумма - ПолнаяСумма;
				СтрУслуг.Всего = СтрУслуг.Всего - СуммаВУчете;
				СтрУслуг.ПолнаяСуммаНДС = СтрУслуг.ПолнаяСуммаНДС - ПолнаяСуммаНДС;
				СтрУслуг.СуммаНДС = СтрУслуг.СуммаНДС - СуммаНДС;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НСтр <> Неопределено Тогда
			
			Если СтрУслуг.ПолнаяСумма = 0 И СтрУслуг.ПолнаяСуммаНДС <> 0 Тогда
				НСтр.ПолнаяСуммаНДС = НСтр.ПолнаяСуммаНДС + СтрУслуг.ПолнаяСуммаНДС;
			КонецЕсли;
			
			Если СтрУслуг.Всего = 0 И СтрУслуг.СуммаНДС <> 0 Тогда
				НСтр.СуммаНДС = НСтр.СуммаНДС + СтрУслуг.СуммаНДС;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрУслуг.Всего <> 0 Или СтрУслуг.ПолнаяСумма <> 0 Тогда
			НСтр = СвязьУслугИСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, СтрУслуг, "Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС,ПолнаяСумма,ПолнаяСуммаНДС");
		КонецЕсли;
		
	КонецЦикла;
	
	//Евросиб Каблов 11.10.2023 )
	
КонецПроцедуры

Функция ПроверитьРеквизитыПТУНаИзменение(РеквизитыШапки, РеквизитыТЧСвязанныеСчета) Экспорт

	ДокументИзменен = Ложь;
	МассивШапки = СтрРазделить(РеквизитыШапки, ",", Ложь);
	МассивТЧСчетов = СтрРазделить(РеквизитыТЧСвязанныеСчета, ",", Ложь);
	Для каждого СтрокаШапки Из МассивШапки Цикл
		ДокументИзменен = ДокументИзменен Или ЭтотОбъект[СтрокаШапки] <> Ссылка[СтрокаШапки];
	КонецЦикла;
	
	Для каждого СтрокаСчета Из СвязанныеСчетаПоставщиков Цикл
		//Евросиб - АСуслов 25.05.2021 10:11:48 #0231779 
		//(
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента,"РасчетыПоДоговоруВЦелом") = Истина Тогда
			Прервать;
		КонецЕсли; 
		//)
		//Евросиб - АСуслов 25.05.2021 10:11:48 #
		СтрокаСчетаСохраненная = Ссылка.СвязанныеСчетаПоставщиков.Найти(СтрокаСчета.СчетПоставщика, "СчетПоставщика");
		Если СтрокаСчетаСохраненная = Неопределено Тогда
			ДокументИзменен = Истина;
			Прервать;
		КонецЕсли; 
		Для каждого КолонкаСчета Из МассивТЧСчетов Цикл
			ДокументИзменен = ДокументИзменен Или СтрокаСчета[КолонкаСчета] <> СтрокаСчетаСохраненная[КолонкаСчета];
		КонецЦикла;
	КонецЦикла;
	
	//Евросиб Каблов 02.09.2024 ( Ticket#0360646
	Если Не ДокументИзменен Тогда
		ИсходнаяТаблица = Ссылка.СвязьУслугИСчетов.Выгрузить(, "НомерСтроки, ГУИДПТУ, ОтнесеннаяСумма, СтавкаНДС, СуммаНДС");
		ТекущаяТаблица = СвязьУслугИСчетов.Выгрузить(, "НомерСтроки, ГУИДПТУ, ОтнесеннаяСумма, СтавкаНДС, СуммаНДС");
		ТаблицыИдентичны = ОбщегоНазначения.КоллекцииИдентичны(ИсходнаяТаблица, ТекущаяТаблица,,, Истина);
		Если Не ТаблицыИдентичны Тогда
			ДокументИзменен = Истина;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 02.09.2024 )
	
//Евросиб Гудкова( 14.12.2020 Ticket№ 
	ДокументИзменен = ДокументИзменен Или ЭтотОбъект.Услуги.Итог("СуммаНДС") <> Ссылка.Услуги.Итог("СуммаНДС");
// Евросиб Гудкова) 	
	
	Возврат ДокументИзменен;

КонецФункции // ПроверитьРеквизитыПТУНаИзменение()
 
Процедура ПроверитьРазнесениеУслугПоСчетам(Отказ)
	
	//Евросиб - АСуслов 16.03.2023 12:17:13 #65484
	//(                                           
	//перенесено в модуль менеджера
	//процедура ПроверитьВозможностьВыгрузкиВУПП
	//Если НЕ РазрешенаВыгрузкаВУПП Тогда
	//	Возврат;	
	//КонецЕсли;
	//СуммаРазнесенияУслуг = 0;
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	////Евросиб Каблов
	////|	СУММА(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма) КАК ОтнесеннаяСумма
	//|	ЕСТЬNULL(СУММА(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма), 0) КАК ОтнесеннаяСумма
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|		ПО ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	//|			И (ПоступлениеТоваровУслугУслуги.ГУИДПТУ = ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ)
	//|ГДЕ
	//|	ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Если Выборка.Следующий() Тогда
	//	СуммаРазнесенияУслуг = Выборка.ОтнесеннаяСумма;
	//КонецЕсли;
	//
	//Если СуммаРазнесенияУслуг <> СуммаДокумента Тогда
	//	ОбщегоНазначения.СообщитьПользователю("Сумма разнесения услуг по счетам не совпадает с полной суммой ВСФ",,,, Отказ);
	//КонецЕсли; 
	//)
	//Евросиб - АСуслов 16.03.2023 12:17:22 #65484
		
КонецПроцедуры
 
Процедура ПроверитьВыгрузкуЗаказаВУПП(Отказ)
	
	НомерДатаЗаказаУПП = "";
	Если СвязанныеСчетаПоставщиков.Количество() > 0 Тогда
		НомерДатаЗаказаУПП = Документы.ПоступлениеТоваровУслуг.ПолучитьРеквизитыОбъектаУПП(СвязанныеСчетаПоставщиков[0].СчетПоставщика, "УППЗаказ").НомерДатаВБУ;
	КонецЕсли;
	//Отказ = Не ЗначениеЗаполнено(НомерДатаЗаказаУПП);
	
	// SIV : если отказать в проведении, то получается, что ПТУ не может заминусовать баланс счета, который выбран ее основанием, и получается временная ловушка, что счет выбран в 2 ПТУ
	// нужно придумать другой способ, чтобы можно было проводить ПТУ
	
	Если Отказ Тогда
		Сообщить("Заказ по ПТУ не выгружен в УПП!");
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСписокАкцептовИКоррПТУ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.ДокументПоступления = &Ссылка
	|	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акцепт.Ссылка
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|ГДЕ
	|	Акцепт.Поступление = &Ссылка
	|	";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	МассивДокументов =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивДокументов;
	
КонецФункции

Процедура ПроверитьПроведениеСчетов(Отказ)

	Для каждого Счет Из СвязанныеСчетаПоставщиков Цикл
		Если ТипЗнч(Счет.СчетПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И Не Счет.СчетПоставщика.Проведен Тогда
			//ОбщегоНазначения.СообщитьПользователю("Не проведен счет " + Счет.СчетПоставщика + ". Проведение ПТУ невозможно",,,, Отказ);
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, начало
			СообщитьПользователюИДобавитьОшибкиВДополнительныеСвойства( "Не проведен счет " + Счет.СчетПоставщика + ". Проведение ПТУ невозможно", Отказ );
			//ДИТ, Беляев СЮ, BUG 82750 / TA 83060, 28-03-2024, конец
		КонецЕсли; 
	КонецЦикла; 	

КонецПроцедуры

Процедура ПересчитатьСуммыПоЦенамИКоличеству() Экспорт
	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.РассчитатьСуммуСтрокиТабличнойЧасти(СтрокаТЧ);
		БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПересчитатьСуммыНДС(СтрокаТЧ, УчитыватьНДС, СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.РассчитатьСуммуВсегоПоСтроке(СтрокаТЧ, СуммаВключаетНДС);
	КонецЦикла;
	
	СуммаДокумента = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
	СвязьУслугИСчетов.Очистить();
//Гудкова	
	//Для каждого СтрУслуги из Услуги Цикл
	//	Если НЕ ЗначениеЗаполнено(СтрУслуги.ГУИДПТУ) Тогда
	//		СтрУслуги.ГУИДПТУ = Строка(Новый УникальныйИдентификатор);
	//	КонецЕсли;
	//				
	//	Если СтрУслуги.Всего <> 0 Тогда
	//		НСтр = СвязьУслугИСчетов.Добавить();
	//		ЗаполнитьЗначенияСвойств(НСтр, СтрУслуги, "Всего,ГУИДПТУ,СуммаНДС,СтавкаНДС");
	//	КонецЕсли;
	//КонецЦикла;
	
	РазнестиУслугиАвтоматически();
	
КонецПроцедуры

Процедура ПроверитьИзмененияКлючевыхДанныхДляАкцепта(Отказ, Ошибки) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	Если ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
		//Если установлено это свойство, то запись происходит из акцепта
		//значит проверка не нужна.
		Возврат;
	КонецЕсли; 
	СостояниеРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка);
	Если СостояниеРазнесения.СтатусРазнесения = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта
		//Евросиб - АСуслов 30.11.2022 9:08:06 #0293538 
		//(
		ИЛИ СостояниеРазнесения.СтатусРазнесения = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан
		//)
		//Евросиб - АСуслов 30.11.2022 9:08:08 #0293538 
		Тогда
		Возврат;
	КонецЕсли; 
	ИзмененныеРеквизиты = Неопределено;
	КонтрольДоступностиДокументов_сервер.ПроверитьИзмененияРеквизитовОбъекта(ЭтотОбъект, Отказ, Ложь, ПолучитьСписокПроверяемыхПолей(), ИзмененныеРеквизиты); 
	Если Отказ Тогда
		Ошибки = СтрШаблон("По ПТУ %2 от %3 существует актуальный акцепт, запись отменена, т.к. изменены ключевые поля в документе: %1
							|Перед записью документа необходимо сторнировать актуальный акцепт.", 
							СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(ИзмененныеРеквизиты),
							Номер,
							Формат(Дата, "ДФ=dd.MM.yyyy"));
	Иначе 
		
		//проверим изменения ТЧ Услуги
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
		|	ПоступлениеТоваровУслугУслуги.УдПеревыставление КАК УдПеревыставление,
		|	ПоступлениеТоваровУслугУслуги.СписокТС КАК СписокТС,
		|	ПоступлениеТоваровУслугУслуги.СписокТЕ КАК СписокТЕ,
		|	ПоступлениеТоваровУслугУслуги.СписокТД КАК СписокТД,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	&ТЧУслуги КАК ПоступлениеТоваровУслугУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.Содержание, 1, 1024) КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТС, 1, 1024) КАК СписокТС,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТЕ, 1, 1024) КАК СписокТЕ,
		|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.СписокТД, 1, 1024) КАК СписокТД,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
		|	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
		|	ПоступлениеТоваровУслугУслуги.ИДТД КАК ИДТД,
		|	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения
		|ПОМЕСТИТЬ ВТ_ТаблицыСравнения
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Услуги.Номенклатура,
		|	ПОДСТРОКА(ВТ_Услуги.Содержание, 1, 1024),
		|	-ВТ_Услуги.Количество,
		|	ВТ_Услуги.СтавкаНДС,
		|	-ВТ_Услуги.Сумма,
		|	-ВТ_Услуги.СуммаНДС,
		|	-ВТ_Услуги.Цена,
		|	ПОДСТРОКА(ВТ_Услуги.СписокТС, 1, 1024),
		|	ПОДСТРОКА(ВТ_Услуги.СписокТЕ, 1, 1024),
		|	ПОДСТРОКА(ВТ_Услуги.СписокТД, 1, 1024),
		|	ВТ_Услуги.ГУИДПТУ,
		|	-ВТ_Услуги.Всего,
		|	ВТ_Услуги.ИДТД,
		|	ВТ_Услуги.СтанцияОтправления,
		|	ВТ_Услуги.СтанцияНазначения
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицыСравнения.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_ТаблицыСравнения.Количество) КАК Количество,
		|	ВТ_ТаблицыСравнения.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ВТ_ТаблицыСравнения.Сумма) КАК Сумма,
		|	СУММА(ВТ_ТаблицыСравнения.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВТ_ТаблицыСравнения.Цена) КАК Цена,
		|	ВТ_ТаблицыСравнения.ГУИДПТУ КАК ГУИДПТУ,
		|	СУММА(ВТ_ТаблицыСравнения.Всего) КАК Всего,
		|	ВТ_ТаблицыСравнения.ИДТД КАК ИДТД,
		|	ВТ_ТаблицыСравнения.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ_ТаблицыСравнения.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_ТаблицыСравнения.СписокТС КАК СписокТС,
		|	ВТ_ТаблицыСравнения.СписокТЕ КАК СписокТЕ,
		|	ВТ_ТаблицыСравнения.СписокТД КАК СписокТД,
		|	ВТ_ТаблицыСравнения.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ТаблицыСравнения КАК ВТ_ТаблицыСравнения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицыСравнения.Номенклатура,
		|	ВТ_ТаблицыСравнения.СтавкаНДС,
		|	ВТ_ТаблицыСравнения.ГУИДПТУ,
		|	ВТ_ТаблицыСравнения.ИДТД,
		|	ВТ_ТаблицыСравнения.СтанцияОтправления,
		|	ВТ_ТаблицыСравнения.СтанцияНазначения,
		|	ВТ_ТаблицыСравнения.СписокТС,
		|	ВТ_ТаблицыСравнения.СписокТЕ,
		|	ВТ_ТаблицыСравнения.СписокТД,
		|	ВТ_ТаблицыСравнения.Содержание
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВТ_ТаблицыСравнения.Сумма) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.СуммаНДС) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.Цена) <> 0
		|		ИЛИ СУММА(ВТ_ТаблицыСравнения.Всего) <> 0)";
		Запрос.УстановитьПараметр("ТЧУслуги",Услуги.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Отказ = НЕ РезультатЗапроса.Пустой();
		Если Отказ Тогда
			Ошибки = Ошибки + СтрШаблон("По ПТУ существует актуальный акцепт, запись отменена, т.к. изменена ТЧ «Услуги»
										|Перед записью документа необходимо сторнировать актуальный акцепт."); 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСписокПроверяемыхПолей()
	
	СписокПроверяемыхПолей = Новый Массив;
	СписокПроверяемыхПолей.Добавить("Контрагент");
	СписокПроверяемыхПолей.Добавить("ДоговорКонтрагента");
	СписокПроверяемыхПолей.Добавить("Номер");
	СписокПроверяемыхПолей.Добавить("Дата");
	СписокПроверяемыхПолей.Добавить("НомерВходящегоДокумента");
	СписокПроверяемыхПолей.Добавить("ДатаВходящегоДокумента");
	СписокПроверяемыхПолей.Добавить("НДСВключенВСтоимость");
	СписокПроверяемыхПолей.Добавить("СуммаВключаетНДС");
	СписокПроверяемыхПолей.Добавить("УчитыватьНДС");
	СписокПроверяемыхПолей.Добавить("ДатаПересчета");
	СписокПроверяемыхПолей.Добавить("Организация");
	СписокПроверяемыхПолей.Добавить("ПоставщикВУ");
	СписокПроверяемыхПолей.Добавить("Регламентный");
	СписокПроверяемыхПолей.Добавить("СуммаДокумента");
	СписокПроверяемыхПолей.Добавить("СчетПоставщика");
	СписокПроверяемыхПолей.Добавить("СуммаНаПТУ");
	//Субботин 75691 19.10.2023 начало
	СписокПроверяемыхПолей.Добавить("Штраф");
	СписокПроверяемыхПолей.Добавить("Претензия");
	//Субботин 75691 19.10.2023 Конец
	Возврат СписокПроверяемыхПолей;
		
КонецФункции
 
Процедура ПроверитьНаличиеАктуальногоАкцептаИКоррПТУ(Отказ, Ошибки)
	
	СтатусАкцепта = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Ссылка).СтатусРазнесения;
	Если НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта 
		//Евросиб - АСуслов 01.12.2022 9:43:32 #0293662 
		//(
		И НЕ СтатусАкцепта = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан
		//)
		//Евросиб - АСуслов 01.12.2022 9:43:36 #0293662 
		Тогда
		Отказ = Истина;
		Ошибки = "Для документа существует актуальный акцепт. Пометка на удаление отменена";
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.ДокументПоступления = &Поступление
	|	И НЕ КорректировкаПоступления.ПометкаУдаления";
	Запрос.УстановитьПараметр("Поступление", Ссылка);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Ошибки = "Для документа существуют не помеченные на удаление корректировки поступления. Пометка на удаление отменена";
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Евросиб Фролов (08.10.2021 Task №39041
Функция ПолучитьМассивКонтейнеровДокумента()
	
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11));
	
	ТаблицаКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаКонтейнеров.Колонки.Добавить("КТК", 	ОписаниеТиповСтрока11);
	
	Для Каждого ТекущийКТК Из Услуги Цикл
		
		МассивПредставленийКТК = СтрРазделить(ТекущийКТК.СписокТЕ, ";", Ложь);
		Для Каждого ПредставлениеКТК из МассивПредставленийКТК Цикл	
			СтрокаКТК = ТаблицаКонтейнеров.Добавить();
			СтрокаКТК.КТК = ПредставлениеКТК;		
		КонецЦикла;		
		
	КонецЦикла;
	
	// По полученным КТК определяем закрывающие документы и проверяем наличие аннулирования.
	// Если закрывающие документы проведены и не аннулированы, то в строке устанавливаем признак "СформированыЗакрывающиеДокументы".
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКонтейнеров.КТК КАК КТК
	|ПОМЕСТИТЬ втТаблицаКонтейнеров
	|ИЗ
	|	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЕ.Ссылка КАК КТК
	|ИЗ
	|	втТаблицаКонтейнеров КАК втТаблицаКонтейнеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО втТаблицаКонтейнеров.КТК = ТЕ.Наименование
	|			И (НЕ ТЕ.ПометкаУдаления)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКонтейнеров = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаКонтейнеров.ВыгрузитьКолонку("КТК");
	
КонецФункции	

Процедура ПередУдалением(Отказ)
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Если ЦФО = Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск Тогда
		ПроверяемыеРеквизиты.Добавить("ВидУслуг");
	КонецЕсли;
	//Евросиб Каблов 12.08.2022 ) 
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "МультивалютныйДоговор") = Истина Тогда
		НомерЭлементаДляУдаления = ПроверяемыеРеквизиты.Найти("ВалютаОплаты");
		Если НомерЭлементаДляУдаления <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерЭлементаДляУдаления);	
		КонецЕсли;
	КонецЕсли;	
		
	//Евросиб СубботинВ #99021 20.02.2025 Начало ///если по претензиям нет ни одного заказа то блокируем
	Если Претензия Тогда
		 ПроверяемыеРеквизиты.Добавить("СвязанныеСчетаПоставщиков");
	КонецЕсли;	 
	//Евросиб СубботинВ #99021 20.02.2025 Конец
	
КонецПроцедуры

//Евросиб - АСуслов 03.03.2023 16:41:19 #65484
//(
Процедура УстановитьПризнакВсеЗаказыПоПТУВыгруженыВУПП()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщика
	|ПОМЕСТИТЬ ВТ_СвязанныеСчетаПоставщику
	|ИЗ
	|	&СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязанныеСчетаПоставщику.СчетПоставщика КАК СчетПоставщика
	|ИЗ
	|	ВТ_СвязанныеСчетаПоставщику КАК ВТ_СвязанныеСчетаПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|		ПО ВТ_СвязанныеСчетаПоставщику.СчетПоставщика = ПротоколОбменов.Объект
	|			И ПротоколОбменов.ДействиеПриОбмене = Значение(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
	|			И ПротоколОбменов.УзелОбмена = Значение(Перечисление.УзлыОбмена.УППЗаказ)
	|ГДЕ
	|	ПротоколОбменов.Объект ЕСТЬ NULL";
	Запрос.УстановитьПараметр("СвязанныеСчетаПоставщиков", СвязанныеСчетаПоставщиков.Выгрузить(,"СчетПоставщика"));
	РезультатЗапроса = Запрос.Выполнить();
	ВсеЗаказыПоПТУВыгруженыВУПП = РезультатЗапроса.Пустой();
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) 
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "РасчетыПоДоговоруВЦелом") 
		И НЕ ВсеЗаказыПоПТУВыгруженыВУПП Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо создать заказ поставщику в УПП для всех оснований для платежа");
	КонецЕсли;
			
КонецПроцедуры

// Евросиб(ДИТ) US 73033 ТА 87495 Сержантова А.С. 12.07.2024
Функция ТекущийСтатусЭДО()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_Документы.Документ КАК Документ,
	|	Диадок_Документы.Статус КАК Статус
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ =&Документ";
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе	
		Возврат "";
	КонецЕсли; 	

КонецФункции

//Евросиб СубботинВ #97888 16.01.2025 Начало
Функция ПроверитьРеквизитыДляПерепроведенияСКорректировкой() 
	
	// результат = Ложь- значит проверка не пройдена
	Результат = Ложь;
	Если ДатаОплаты <> Ссылка.ДатаОплаты Тогда
	    Результат = Истина;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции	
//)
//Евросиб - АСуслов 03.03.2023 16:41:22 #65484      
//Евросиб СубботинВ #97888 16.01.2025 Конец

//Евросиб Пирожкова( 30.07.2025 Ticket№0406736
Процедура ПроверитьВыгрузкуВУПП() Экспорт
	
 	СоответствиеОшибок = Новый Соответствие;
	СоответствиеОшибок.Вставить("ОшибкаВДатеМодификации", "Дата модификации меньше, чем дата обмена, документ не может быть выгружен в 1С УПП");
	СоответствиеОшибок.Вставить("ОшибкаВСтатусах", "Документ с текущим статусом ЭДО не может быть выгружен в 1С УПП");  
	СоответствиеОшибок.Вставить("ОшибкаНеВыгруженЗаказ", "Перед выгрузкой ПТУ необходимо выгрузить заказ в 1С УПП");
	СоответствиеОшибок.Вставить("ОшибкаНеРазрешенаВыгрузка", "Не установлен флаг ""Разрешена выгрузка в 1С УПП"", документ не может быть выгружен в 1С УПП");
	СоответствиеОшибок.Вставить("ОшибкаНеРегламентный", "Документ, который не является регламентным, не может быть выгружен в 1С УПП");
	СоответствиеОшибок.Вставить("ОшибкаСуммаДокумента", "Не выгруженный ранее в 1С УПП документ с суммой равной 0 не может быть выгружен в 1С УПП");
	СоответствиеОшибок.Вставить("ОшибкаЭтоКопия", "Документ контрагента резидента с флагом ""копия"" не может быть выгружен в 1С УПП");
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ПротоколОбменов.Объект ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК Выгружен,
		|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВыгруженныеЗаказыПоПТУ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
		|ГДЕ
		|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|НЕ ВЫБОР
		|	КОГДА Диадок_Документы.СостояниеДокументооборота ЕСТЬ NULL
		|		ТОГДА ИСТИНА
		|	КОГДА ВЫБОР
		|			КОГДА Диадок_Документы.СостояниеДокументооборота = ""Аннулирован""
		|				ТОГДА ВЫБОР
		|						КОГДА ПротоколОбменов.ДатаОбмена ЕСТЬ NULL
		|							ТОГДА ЛОЖЬ
		|						ИНАЧЕ ПоступлениеТоваровУслуг.СуммаДокумента = 0
		|					КОНЕЦ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|		ТОГДА ИСТИНА
		|	ИНАЧЕ Диадок_Документы.СостояниеДокументооборота = ""Подписан""
		|			ИЛИ Диадок_Документы.СостояниеДокументооборота = ""Откорректирован""
		|			ИЛИ Диадок_Документы.СостояниеДокументооборота = ""Документооборот завершен""
		|				И Диадок_Документы.СостояниеДокументооборотаДоп В (""Согласован"", """")
		|КОНЕЦ КАК ОшибкаВСтатусах,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПротоколОбменов.ДатаОбмена, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ПротоколОбменов.ДатаОбмена < ПоступлениеТоваровУслуг.ДатаМодификации
		|	КОНЕЦ = ЛОЖЬ КАК ОшибкаВДатеМодификации,
		|	ПоступлениеТоваровУслуг.Регламентный = ЛОЖЬ КАК ОшибкаНеРегламентный,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслуг.Контрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|			ТОГДА НЕ ПоступлениеТоваровУслуг.Копия
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ = ЛОЖЬ КАК ОшибкаЭтоКопия,
		|	ВЫБОР
		|		КОГДА ПротоколОбменов.ДатаОбмена ЕСТЬ NULL
		|			ТОГДА ПоступлениеТоваровУслуг.СуммаДокумента > 0
		|		ИНАЧЕ ПоступлениеТоваровУслуг.СуммаДокумента >= 0
		|	КОНЕЦ = ЛОЖЬ КАК ОшибкаСуммаДокумента,
		|	(НЕ ВыгруженныеЗаказыПоПТУ.Ссылка ЕСТЬ NULL
		|		ИЛИ ПоступлениеТоваровУслуг.ДоговорКонтрагента.РасчетыПоДоговоруВЦелом
		|		ИЛИ ПоступлениеТоваровУслуг.Контрагент.РазделятьЗатратыПоОрганизациямАвизо) = ЛОЖЬ КАК ОшибкаНеВыгруженЗаказ,
		|	ПоступлениеТоваровУслуг.РазрешенаВыгрузкаВУПП = ЛОЖЬ КАК ОшибкаНеРазрешенаВыгрузка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ПоступлениеТоваровУслуг.Ссылка = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
		|		ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Объект
		|			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
		|		ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
		|			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыгруженныеЗаказыПоПТУ КАК ВыгруженныеЗаказыПоПТУ
		|		ПО ПоступлениеТоваровУслуг.Ссылка = ВыгруженныеЗаказыПоПТУ.Ссылка
		|			И (ВыгруженныеЗаказыПоПТУ.Выгружен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВДиадоке КАК Диадок_Документы
		|		ПО ПоступлениеТоваровУслуг.Ссылка = Диадок_Документы.Документ
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		КоличествоОшибок = 0;
		Для каждого Колонка из Результат.Колонки Цикл
			Если Результат[0][Колонка.Имя] Тогда
				КоличествоОшибок = КоличествоОшибок+1;
				Сообщить(СоответствиеОшибок.Получить(Колонка.Имя));
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Сообщить("Проверка готовности документа к выгрузке завершена, выявлено ошибок: " +КоличествоОшибок);
	
КонецПроцедуры

// Евросиб Пирожкова 30.07.2025)

Процедура ВыполнитьПроверкуПризнакКопия(Отказ,РежимЗаписи) //Евросиб Шевченко А.В. US 71681 TA 120124 01.12.2025
	                          
	мСостояния = Новый Массив;
	
	мСостояния.Добавить(Справочники.Состояния.ПолучитьОригиналыСнятьПризнакКопияПодготовитьПТУкВыгрузкеВУПП);
	мСостояния.Добавить(Справочники.Состояния.ПолучитьОригиналыСнятьПризнакКопияПодготовитьКорПТУкВыгрузкеВУПП);
	мСостояния.Добавить(Справочники.Состояния.ПолучениеОригиналовДокументовОтНерезидентовПроверитьСнятьПризнакКопия);
	мСостояния.Добавить(Справочники.Состояния.ПолучениеОригДокументовОтНерезидентаПровНаСоответствиеОригКопииСнятьПризнакКопия);
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение) И НЕ ПометкаУдаления Тогда
		Для Каждого мСостояние Из мСостояния Цикл
			СтрокаСостояния = Состояния.НайтиСтроки(Новый Структура("Состояние,Статус", мСостояние, Перечисления.СтатусыЭтапов.Выполнен));
			Если СтрокаСостояния.Количество() <> 0 И Копия Тогда
				ОбщегоНазначения.СообщитьПользователю("Необходимо снять признак ""Копия""",,,"Объект.Копия",Отказ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры;	
