
//Евросиб Коханенко Н.А. 18.12.2025 (( #125251
Функция GetAddress(XMLParams)
	
	//Возврат ЕСОбменСервер.ПолучитьАдрес(XMLParams);
	Возврат ПолучитьАдрес(XMLParams);
	
КонецФункции //Евросиб Коханенко Н.А. 18.12.2025 )) #125251

//Евросиб Коханенко Н.А. 18.12.2025 (( #125251
Функция ПолучитьАдрес(XMLParams) 
	
	ДанныеXML = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	ЗапрашиваемыйАдресСтрока = ДанныеXML.Address;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АдресаВНаселенныхПунктах.Ссылка) КАК Идентификатор,
		|	АдресаВНаселенныхПунктах.Адрес КАК Адрес,
		|	АдресаВНаселенныхПунктах.Широта КАК Широта,
		|	АдресаВНаселенныхПунктах.Долгота КАК Долгота,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки КАК НомерСтроки,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя,
		|	АдресаВНаселенныхПунктах.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
		|		ПО АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = АдресаВНаселенныхПунктах.Ссылка
		|			И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления
		|			И (АдресаВНаселенныхПунктах.Адрес = &АдресВНП)";
	
	Запрос.УстановитьПараметр("АдресВНП", ЗапрашиваемыйАдресСтрока);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("TypeOfResult, Address", 1, РезультатЗапроса)); 
		Возврат ДанныеXML;
	КонецЕсли;
	
	//адреса не нашлось, или найденная карточка адреса с пометкой удаления, то спросим у Яндекса
	НаселенныйПункт = "";
	НаселенныйПунктРодитель = "";
	СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивАдресовЧерезГеокодерЯндекс(ЗапрашиваемыйАдресСтрока, НаселенныйПункт, НаселенныйПунктРодитель);
	Если ЗначениеЗаполнено(СтруктураРезультата.ОписаниеОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	ИдентификаторЗапроса = СтруктураРезультата.СтруктураРезультатаЗапроса.ИдентификаторЗапроса;
	
	//Сохраним пакет данных в регистре сведений «Данные пакетов обмена»
    ЗаписатьЛогГеокодераВДанныхПакетовОбменаНаСервере(СтруктураРезультата, ИдентификаторЗапроса);
			
	ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("TypeOfResult, Address, RequestID", 2, СтруктураРезультата.МассивАдресов, ИдентификаторЗапроса));
	
	Возврат ДанныеXML;
	
КонецФункции //Евросиб Коханенко Н.А. 18.12.2025 )) #125251

//Евросиб Коханенко Н.А. 18.12.2025 (( #125251
Процедура ЗаписатьЛогГеокодераВДанныхПакетовОбменаНаСервере(Результат, ИдентификаторЗапроса)
	
	мз = РегистрыСведений.ДанныеПакетовОбмена.СоздатьМенеджерЗаписи();
	мз.ПериодОбмена = ТекущаяДата();
	мз.ИдентификаторСтрокиПакетаДанных = ИдентификаторЗапроса;
    мз.ВнешнийИдентификаторСтрокиПакетаДанных = ИдентификаторЗапроса;
    мз.ИсточникПакетаДанных = ПредопределенноеЗначение("Справочник.ИсточникиПакетовДанных.ПолучениеДанныхГеокодера");
	мз.СтруктураДанных = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	мз.ОбъектДанных = Неопределено;
	мз.Обработано = Ложь;
	мз.ДатаОбработки = Дата(1,1,1);
	мз.ЕстьОшибки = Ложь;
	мз.ОписаниеОшибки = "";
	мз.Записать(); 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 23.12.2025 )) #125251

//Евросиб Коханенко Н.А. 18.12.2025 (( #125251
Функция GetSelectedAddress(XMLParams)
	
	//Возврат ЕСОбменСервер.ПолучитьВыбранныйАдрес(XMLParams);
	Возврат ПолучитьВыбранныйАдрес(XMLParams);
	
КонецФункции //Евросиб Коханенко Н.А. 23.12.2025 )) #125251

//Евросиб Коханенко Н.А. 18.12.2025 (( #125251
Функция ПолучитьВыбранныйАдрес(XMLParams) 
	
	ДанныеXML = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	ЗапрашиваемыйАдресСтрока = ДанныеXML.Address;
	ИдентификаторЗапроса = ДанныеXML.RequestID;
	
	Адрес = Неопределено;                                                               
	
	//читаем регистр, находим запрос к Яндекс геокодеру
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ДанныеПакетовОбмена.ПериодОбмена КАК ПериодОбмена,
		|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных,
		//|	ДанныеПакетовОбмена.ВнешнийИдентификаторСтрокиПакетаДанных КАК ВнешнийИдентификаторСтрокиПакетаДанных,
		|	ДанныеПакетовОбмена.ИсточникПакетаДанных КАК ИсточникПакетаДанных,
		|	ДанныеПакетовОбмена.СтруктураДанных КАК СтруктураДанных
		//|	ДанныеПакетовОбмена.ОбъектДанных КАК ОбъектДанных,
		//|	ДанныеПакетовОбмена.Обработано КАК Обработано,
		//|	ДанныеПакетовОбмена.ДатаОбработки КАК ДатаОбработки,
		//|	ДанныеПакетовОбмена.ЕстьОшибки КАК ЕстьОшибки,
		//|	ДанныеПакетовОбмена.ОписаниеОшибки КАК ОписаниеОшибки
		|ИЗ
		|	РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		|ГДЕ
		|	ДанныеПакетовОбмена.Обработано = ЛОЖЬ
		|	И ДанныеПакетовОбмена.ИсточникПакетаДанных = ЗНАЧЕНИЕ(Справочник.ИсточникиПакетовДанных.ПолучениеДанныхГеокодера)
		|	И ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных = &ИдентификаторСтрокиПакетаДанных";
	
	Запрос.УстановитьПараметр("ИдентификаторСтрокиПакетаДанных", ИдентификаторЗапроса);
	
	СтруктураЗапросаКЯндексГеокодеру = Запрос.Выполнить().Выгрузить();
	ДанныеЗапроса = СтруктураЗапросаКЯндексГеокодеру[0].СтруктураДанных.Получить();
	МассивАдресов = ДанныеЗапроса.МассивАдресов; 
	Для Каждого СтруктураАдреса Из МассивАдресов Цикл
		Если СтруктураАдреса.Адрес = ЗапрашиваемыйАдресСтрока Тогда
			ЗапрашиваемыйАдресСтруктура = СтруктураАдреса;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	//ищем карточку среди существующих в справочнике
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АдресаВНаселенныхПунктах.Ссылка) КАК Идентификатор,
		|	АдресаВНаселенныхПунктах.Адрес КАК Адрес,
		|	АдресаВНаселенныхПунктах.Широта КАК Широта,
		|	АдресаВНаселенныхПунктах.Долгота КАК Долгота,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки КАК НомерСтроки,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя,
		|	АдресаВНаселенныхПунктах.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
		|		ПО АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = АдресаВНаселенныхПунктах.Ссылка
		|			И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления
		|			И АдресаВНаселенныхПунктах.Адрес = &АдресВНП";
	
	Запрос.УстановитьПараметр("АдресВНП", ЗапрашиваемыйАдресСтруктура.Адрес);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("TypeOfResult, Address", 1, РезультатЗапроса)); 
		Возврат ДанныеXML;
	КонецЕсли;
	
	//создадим карточку адреса в справочнике на стороне ДК
	НовыйАдресОбъект = Справочники.АдресаВНаселенныхПунктах.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйАдресОбъект, ЗапрашиваемыйАдресСтруктура,,"КомпонентыАдреса");
	Для Каждого КомпонентАдреса Из ЗапрашиваемыйАдресСтруктура.КомпонентыАдреса Цикл
		ЗаполнитьЗначенияСвойств(НовыйАдресОбъект.КомпонентыАдреса.Добавить(), КомпонентАдреса);
	КонецЦикла; 
	
	СтруктураПараметровСозданияЛокации = Новый Структура("Наименование, Долгота, Широта, Регион, Страна", 
											ЗапрашиваемыйАдресСтруктура.НаселенныйПункт,
											ЗапрашиваемыйАдресСтруктура.Долгота,
											ЗапрашиваемыйАдресСтруктура.Широта,
											ЗапрашиваемыйАдресСтруктура.ЛокацияВышестоящегоУровня,
											ЗапрашиваемыйАдресСтруктура.Страна);
	НовыйАдресОбъект.Владелец = ГеокодированиеСервер.НайтиДобавитьНаселенныйПункт(СтруктураПараметровСозданияЛокации);

	СсылкаНаОбъект = НовыйАдресОбъект.ПолучитьСсылкуНового();
	НовыйАдресОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	
	Попытка
		НовыйАдресОбъект.Записать();
		Набор = РегистрыСведений.ДанныеПакетовОбмена.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторСтрокиПакетаДанных.Установить(ИдентификаторЗапроса);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Запись.ОбъектДанных = НовыйАдресОбъект.Ссылка;
			Запись.Обработано = ИСТИНА;
			Запись.ДатаОбработки = ТекущаяДата();
			Набор.Записать();
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки; 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АдресаВНаселенныхПунктах.Ссылка) КАК Идентификатор,
		|	АдресаВНаселенныхПунктах.Адрес КАК Адрес,
		|	АдресаВНаселенныхПунктах.Широта КАК Широта,
		|	АдресаВНаселенныхПунктах.Долгота КАК Долгота,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки КАК НомерСтроки,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя,
		|	АдресаВНаселенныхПунктах.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
		|		ПО (АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = &Ссылка) 
		|			И (АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = АдресаВНаселенныхПунктах.Ссылка)";
		
	Запрос.Параметры.Вставить("Ссылка", НовыйАдресОбъект.Ссылка); 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("TypeOfResult, Address", 1, РезультатЗапроса)); 
		Возврат ДанныеXML;
	КонецЕсли;
	
КонецФункции //Евросиб Коханенко Н.А. 18.12.2025 )) #125251
