
&НаКлиенте
Процедура СделатьОсновным(Команда)
	
	ТекД = Элементы.Список.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СделатьОсновнымНаСервере(ТекД.Код);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьОсновнымНаСервере(КодШаблона)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныОтборовНакладных.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШаблоныОтборовНакладных КАК ШаблоныОтборовНакладных
	               |ГДЕ
	               |	ШаблоныОтборовНакладных.СделатьОсновным
	               |	И ШаблоныОтборовНакладных.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ Цикл
		ПолучОб = Стр.Ссылка.ПолучитьОбъект();
		ПолучОб.СделатьОсновным = Ложь;
		ПолучОб.Записать();
	КонецЦикла;	
	
	ТекСпр = Справочники.ШаблоныОтборовНакладных.НайтиПоКоду(КодШаблона);
	ПолучОб = ТекСпр.ПолучитьОбъект();
	ПолучОб.СделатьОсновным = Истина;
	ПолучОб.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )


