
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоляВХранилище = Параметры.ПоляВХранилище;
	КодСправочника = Параметры.КодСправочника;
	
	ДанныеИзФормыОтбора = ПолучитьИзВременногоХранилища(ПоляВХранилище);
	
	// проверяем, есть ли в справочнике такая запись. 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиФормыОтборовПользователейСписокПолей.НомерПоПорядку КАК НомерПоПорядку,
	               |	НастройкиФормыОтборовПользователейСписокПолей.НаименованиеСтолбцаВСистеме КАК НаименованиеСтолбцаВСистеме,
	               |	НастройкиФормыОтборовПользователейСписокПолей.НаименованиеСтолбца КАК НаименованиеСтолбца,
	               |	НастройкиФормыОтборовПользователейСписокПолей.Использование КАК Использование
	               |ИЗ
	               |	Справочник.НастройкиФормыОтборовПользователей.СписокПолей КАК НастройкиФормыОтборовПользователейСписокПолей
	               |ГДЕ
	               |	НастройкиФормыОтборовПользователейСписокПолей.Ссылка.Пользователь = &Пользователь
	               |	И НастройкиФормыОтборовПользователейСписокПолей.Ссылка.НаименованиеПресета.Код = &КодПресета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерПоПорядку";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("КодПресета",КодСправочника);
	
	РЗ = Запрос.Выполнить();
	
	// если нет, то нужно создать, чтобы сохранить первоначальный набор столбцов
	Если РЗ.Пустой() Тогда
		НовСпр = Справочники.НастройкиФормыОтборовПользователей.СоздатьЭлемент();
		НовСпр.Пользователь = Пользователи.ТекущийПользователь();
		НовСпр.НаименованиеПресета = Справочники.ПресетыОтборовАРМ.НайтиПоКоду(КодСправочника);
		НовСпр.Наименование = Строка(НовСпр.Пользователь) + " " + НовСпр.НаименованиеПресета;
		НомерПП = 1;
		Для Каждого Элем Из ДанныеИзФормыОтбора Цикл
			НовСтр = НовСпр.СписокПолей.Добавить();
			НовСтр.НаименованиеСтолбца = Лев(Элем,СтрНайти(Элем,",")-1);
			НовСтр.НаименованиеСтолбцаВСистеме = Сред(Элем,СтрНайти(Элем,",")+1);
			НовСтр.НомерПоПорядку = НомерПП;
			НовСтр.Использование = Истина;
			НомерПП = НомерПП + 1;
		КонецЦикла;
		НовСпр.Записать();
		СсылкаСпр = НовСпр.Ссылка;
		ТЗ = СсылкаСпр.СписокПолей.Выгрузить();
	Иначе
		ТЗ = РЗ.Выгрузить();
	КонецЕсли;
	
	СписокПолей.Загрузить(ТЗ);
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ОК(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Использование",Истина);
	НайденныеСтроки = СписокПолей.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного столбца!");
		Возврат;
	КонецЕсли;
	
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьПодбор(КодСправочника);	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	// запись в справочник настроек
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиФормыОтборовПользователей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НастройкиФормыОтборовПользователей КАК НастройкиФормыОтборовПользователей
	               |ГДЕ
	               |	НастройкиФормыОтборовПользователей.Пользователь = &Пользователь
	               |	И НастройкиФормыОтборовПользователей.НаименованиеПресета.Код = &КодПресета";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("КодПресета",КодСправочника);
	
	РЗ = Запрос.Выполнить().Выбрать();
	Если РЗ.Следующий() Тогда
		ТекСпр = РЗ.Ссылка;
		ПолучОб = ТекСпр.ПолучитьОбъект();
		ПолучОб.пометкаУдаления = Ложь;
		ТЧ = ПолучОб.СписокПолей;
		ТекИндекс = 1;
		Для Каждого Стр Из СписокПолей Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НаименованиеСтолбцаВСистеме",Стр.НаименованиеСтолбцаВСистеме);
			НайденныеСтр = ТЧ.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтр.Количество()>0 Тогда
				НайденныеСтр[0].Использование = Стр.Использование;
				НайденныеСтр[0].НомерПоПорядку = ТекИндекс;
			КонецЕсли;
			ТекИндекс = ТекИндекс + 1;
		КонецЦикла;
		ПолучОб.Записать();
	КонецЕсли;
	
	ТЗХранилище = СписокПолей.Выгрузить();
	ПоместитьВоВременноеХранилище(ТЗХранилище,ПоляВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Стр Из СписокПолей Цикл
		Стр.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Стр Из СписокПолей Цикл
		Стр.Использование = Ложь;
	КонецЦикла;
КонецПроцедуры
