&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Сделка) Тогда
		СделкаЗакрыта = ЗначениеЗаполнено(Объект.Сделка.ДатаЗакрытияСделки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СоответствиеОперацийТСГУИД = Новый Соответствие;
		СоответствиеОперацийТЕГУИД = Новый Соответствие;
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Операция", Объект.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОперацияГрузы.ТСГУИД КАК ТСГУИД,
		               |	ОперацияГрузы.ТипТС КАК ТипТС,
		               |	ОперацияГрузы.ТС КАК ТС,
		               |	ОперацияГрузы.ТЕГУИД КАК ТЕГУИД,
		               |	ОперацияГрузы.ТипТЕ КАК ТипТЕ,
		               |	ОперацияГрузы.ТЕ КАК ТЕ,
		               |	ОперацияГрузы.НомерЖДН КАК НомерЖДН,
		               |	ОперацияГрузы.ГруженоеТС КАК ГруженоеТС,
		               |	ОперацияГрузы.ГруженоеТЕ КАК ГруженоеТЕ,
		               |	ОперацияГрузы.ДатаОтправления КАК ДатаОтправления,
		               |	ОперацияГрузы.ДатаПрибытия КАК ДатаПрибытия
		               |ИЗ
		               |	Документ.Операция.Грузы КАК ОперацияГрузы
		               |ГДЕ
		               |	ОперацияГрузы.Ссылка = &Операция
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТСГУИД,
		               |	ТЕГУИД";
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			Если ЗначениеЗаполнено(Ответ.ТСГУИД) и НЕ ЗначениеЗаполнено(Ответ.ТЕГУИД) Тогда
				НСтр = ДеревоГрузов.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, Ответ,, "НомерЖДН");
				СоответствиеОперацийТСГУИД.Вставить(Ответ.ТСГУИД, НСтр);
			ИначеЕсли ЗначениеЗаполнено(Ответ.ТСГУИД) и ЗначениеЗаполнено(Ответ.ТЕГУИД) Тогда
				НСтр = СоответствиеОперацийТСГУИД[Ответ.ТСГУИД].ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НСтр, Ответ);
				СоответствиеОперацийТЕГУИД.Вставить(Ответ.ТЕГУИД, НСтр);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	ДоступныеЛичныеЦели = ЛичныеЦелиСервер.ПолучитьДействующиеЦелиДляРучнойОтметки(Объект.Ссылка);
	Для каждого Стр из ДоступныеЛичныеЦели Цикл
		НСтр = Объект.ЛичныеЦели.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
	КонецЦикла;
		

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура УстановитьДоступностьКарточкиОперации(Доступность)
	
	Элементы.ГруппаПланФактУслугаТариф.Доступность = Доступность;
	Элементы.ГруппаОрганПодрПоставщик.Доступность = Доступность;
	Элементы.Валюта.Доступность = Доступность;
	Элементы.ГруппаСтавкаНДС.Доступность = Доступность;
	Элементы.Регламентный.Доступность = Доступность;
	Элементы.ГруппаДвижениеСтоимость.Доступность = Доступность;
	Элементы.ГруппаСтраницы.Доступность = Доступность;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Грузы.Очистить();
	
	Для каждого Стр из ДеревоГрузов.ПолучитьЭлементы() Цикл
		ЗаписатьСтроку(Стр);
	КонецЦикла;
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
		ПараметрыЗапроса.Вставить("ВидОперации", Объект.Услуга);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОперацию(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;

	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
	//		ПараметрыЗапроса.Вставить("ВидОперации", Объект.Услуга);
	//		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОперацию(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	(Не Объект.Услуга.ОперацияНеМаршрутизируется) И ( 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Поставщик <> Объект.Поставщик ИЛИ
	Объект.Ссылка.Договор <> Объект.Договор ИЛИ Объект.Состояния.Количество() = 0);
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтроку(Строка)
	
	НСтр = Объект.Грузы.Добавить();
	ЗаполнитьЗначенияСвойств(НСтр, Строка);
	Для каждого Стр из Строка.ПолучитьЭлементы() Цикл
		ЗаписатьСтроку(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СделкаЗакрыта Тогда
		УстановитьДоступностьКарточкиОперации(Ложь);
	КонецЕсли;
		
	РаскрытьДеревоГрузов();
	Элементы.ГруппаЛичныеЦели.Заголовок = "Личные цели ("+Объект.ЛичныеЦели.Количество()+")";
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьДеревоГрузов()
	Для каждого Стр из ДеревоГрузов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоГрузов.Развернуть(Стр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТС(Команда)
	
	НСтр = ДеревоГрузов.ПолучитьЭлементы().Добавить();
	НСтр.ТСГУИД = Строка(Новый УникальныйИдентификатор);
	Элементы.ДеревоГрузов.ТекущаяСтрока = НСтр.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТЕ(Команда)
	
	ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
	Если ТекД <> неопределено И НЕ ЗначениеЗаполнено(ТекД.ТЕГУИД) Тогда
		ТекД.ГруженоеТС = Истина;
		НСтр = ТекД.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, ТекД, "ТСГУИД,ТипТС,ТС");
		НСтр.ТЕГУИД = Строка(Новый УникальныйИдентификатор);
		НСтр.ГруженоеТЕ = Истина;
		РаскрытьДеревоГрузов();
	Иначе
		Сообщить("Выберите строку с вагоном и повторите попытку.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГрузовТипТСПриИзменении(Элемент)
	
	ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
	Для каждого Стр из ТекД.ПолучитьЭлементы() Цикл
		УстановитьРеквизитРекурсивно(Стр, "ТипТС", ТекД.ТипТС);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРеквизитРекурсивно(Строка, ИмяРеквизита, ЗначениеРеквизита)
	
	Строка[ИмяРеквизита] = ЗначениеРеквизита;
	Для каждого Стр из Строка.ПолучитьЭлементы() Цикл
		УстановитьРеквизитРекурсивно(Стр, ИмяРеквизита, ЗначениеРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГрузовТСПриИзменении(Элемент)
	
	ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
	Для каждого Стр из ТекД.ПолучитьЭлементы() Цикл
		УстановитьРеквизитРекурсивно(Стр, "ТС", ТекД.ТС);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмениласьОперация", Объект.Ссылка);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьВагоны(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьКонтейнеры(Команда)
	
	ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
	Если ТекД <> неопределено И НЕ ЗначениеЗаполнено(ТекД.ТЕГУИД) Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Выберите строку с вагоном и повторите попытку.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипТС(ТС)
	
	Возврат ТС.ТипТС;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТС(ТС)
	
	Возврат Справочники.ТС.НайтиПоНаименованию(ТС, Истина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипТЕ(ТЕ)
	
	Возврат ТЕ.ТипТЕ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТЕ(ТЕ)
	
	Возврат РаботаСКонтейнерамиСервер.НайтиКТК(ТЕ); // Справочники.ТЕ.НайтиПоНаименованию(ТЕ, Истина);
	
КонецФункции

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		Для каждого Стр из Параметр1 Цикл
			ТССсылка = ПолучитьТС(Стр);
			Если Объект.Грузы.НайтиСтроки(Новый Структура("ТС", ТССсылка)).Количество() > 0 Тогда Продолжить; КонецЕсли;
			НСтр = ДеревоГрузов.ПолучитьЭлементы().Добавить();
			НСтр.ТСГУИД = Строка(Новый УникальныйИдентификатор);
			НСтр.ТС = ТССсылка;
			НСтр.ТипТС = ПолучитьТипТС(ТССсылка);
		КонецЦикла;
		
	ИначеЕсли Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		Для каждого Стр из Параметр1 Цикл
			ТЕСсылка = ПолучитьТЕ(Стр);
			Если Объект.Грузы.НайтиСтроки(Новый Структура("ТЕ", ТЕСсылка)).Количество() > 0 Тогда Продолжить; КонецЕсли;
			ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
			НСтр = ТекД.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, ТекД, "ТСГУИД,ТипТС,ТС");
			НСтр.ТЕГУИД = Строка(Новый УникальныйИдентификатор);
			НСтр.ТЕ = ТЕСсылка;
			НСтр.ТипТЕ = ПолучитьТипТЕ(ТЕСсылка);
		КонецЦикла;
		
	КонецЕсли;
	
	РаскрытьДеревоГрузов();
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ВидОперации", Объект.Услуга);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОперацию(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;

	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//	ПараметрыЗапроса.Вставить("ВидОперации", Объект.Услуга);
	//	ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОперацию(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ  

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГрузовТипТЕПриИзменении(Элемент)
	
	ТекД = Элементы.ДеревоГрузов.ТекущиеДанные;
	Для каждого Стр из ТекД.ПолучитьЭлементы() Цикл
		УстановитьРеквизитРекурсивно(Стр, "ТипТЕ", ТекД.ТипТЕ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сторно(Команда)
	Объект.КорректировкаВагоны.Очистить();
	СторноНаСервере();
КонецПроцедуры

&НаСервере
Процедура СторноНаСервере()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПозицияВагоновФактОстатки.Локация КАК Локация,
	               |	ПозицияВагоновФактОстатки.Вагон КАК Вагон,
	               |	ПозицияВагоновФактОстатки.ТипВагона КАК ТипВагона,
	               |	ПозицияВагоновФактОстатки.ФактОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ПозицияВагоновФакт.Остатки(&Период, ) КАК ПозицияВагоновФактОстатки";
	Запрос.УстановитьПараметр("Период", Объект.ДатаНазначенияФакт-1);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = Объект.КорректировкаВагоны.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.Остаток = -НСтр.Остаток;
		НСтр.ПериодЪ = Объект.ДатаНазначенияФакт;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоДислокации(Команда)
	Объект.КорректировкаВагоны.Очистить();
	УстановитьПоДислокацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПоДислокацииНаСервере()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК Локация,
	               |	ДислокацияВагоновСрезПоследних.Вагон.ТипТС КАК ТипВагона,
	               |	ДислокацияВагоновСрезПоследних.Груженый КАК Груженый,
	               |	ДислокацияВагоновСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(&период, ) КАК ДислокацияВагоновСрезПоследних";
	Запрос.УстановитьПараметр("Период", Объект.ДатаНазначенияФакт-1);
	Ответ = Запрос.Выполнить().Выбрать();
	
	МассивОтработанныхВагонов = Новый Массив;
	
	Пока Ответ.Следующий() Цикл
		
		Если МассивОтработанныхВагонов.Найти(Ответ.Вагон) <> неопределено Тогда Продолжить; КонецЕсли;
		
		НСтр = Объект.КорректировкаВагоны.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.ПериодЪ = Ответ.Период;
		НСтр.Остаток = 1;
		
		МассивОтработанныхВагонов.Добавить(Ответ.Вагон);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипВагонаДляВсех(Команда)
	
	Для Сч = 1 По Объект.КорректировкаВагоны.Количество()-1 Цикл
		Если НЕ ЗначениеЗаполнено(Объект.КорректировкаВагоны[Сч].ТипВагона) Тогда
			Объект.КорректировкаВагоны[Сч].ТипВагона = Объект.КорректировкаВагоны[0].ТипВагона;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтправленияФактПриИзменении(Элемент)
	
	Для каждого Стр1 из ДеревоГрузов.ПолучитьЭлементы() Цикл
		Если НЕ ЗначениеЗаполнено(Стр1.ДатаОтправления) Тогда Стр1.ДатаОтправления = Объект.ДатаОтправленияФакт; КонецЕсли;
		Для каждого Стр2 из Стр1.ПолучитьЭлементы() Цикл
			Если НЕ ЗначениеЗаполнено(Стр2.ДатаОтправления) Тогда Стр2.ДатаОтправления = Объект.ДатаОтправленияФакт; КонецЕсли;
			Для каждого Стр3 из Стр2.ПолучитьЭлементы() Цикл
				Если НЕ ЗначениеЗаполнено(Стр3.ДатаОтправления) Тогда Стр3.ДатаОтправления = Объект.ДатаОтправленияФакт; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНазначенияФактПриИзменении(Элемент)
	
	Для каждого Стр1 из ДеревоГрузов.ПолучитьЭлементы() Цикл
		Если НЕ ЗначениеЗаполнено(Стр1.ДатаПрибытия) Тогда Стр1.ДатаПрибытия = Объект.ДатаНазначенияФакт; КонецЕсли;
		Для каждого Стр2 из Стр1.ПолучитьЭлементы() Цикл
			Если НЕ ЗначениеЗаполнено(Стр2.ДатаПрибытия) Тогда Стр2.ДатаПрибытия = Объект.ДатаНазначенияФакт; КонецЕсли;
			Для каждого Стр3 из Стр2.ПолучитьЭлементы() Цикл
				Если НЕ ЗначениеЗаполнено(Стр3.ДатаПрибытия) Тогда Стр3.ДатаПрибытия = Объект.ДатаНазначенияФакт; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Если РольДоступна_с() Тогда
		УстановитьДоступностьКарточкиОперации(Истина);
	Иначе
		ПоказатьПредупреждение(, "Правом на редактирование закрытых операций обладают только администраторы системы.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступна_с()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции


&НаКлиенте
Процедура ОчиститьДатыОтправления(Команда)
	
	Для каждого Стр из Объект.Грузы Цикл
		Стр.ДатаОтправления = неопределено;
	КонецЦикла;
	Для каждого Стр1 из ДеревоГрузов.ПолучитьЭлементы() Цикл
		Стр1.ДатаОтправления = неопределено;
		Для каждого Стр2 из Стр1.ПолучитьЭлементы() Цикл
			Стр2.ДатаОтправления = неопределено;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьДатыПрибытия(Команда)
	
	Для каждого Стр из Объект.Грузы Цикл
		Стр.ДатаПрибытия = неопределено;
	КонецЦикла;
	Для каждого Стр1 из ДеревоГрузов.ПолучитьЭлементы() Цикл
		Стр1.ДатаПрибытия = неопределено;
		Для каждого Стр2 из Стр1.ПолучитьЭлементы() Цикл
			Стр2.ДатаПрибытия = неопределено;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЛичныеЦелиОтметкаПриИзменении(Элемент)
	
	ТекД = Элементы.ЛичныеЦели.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекПользователь = ПользователиКлиент.ТекущийПользователь();
		МоиГруппы = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь);
		МоиГруппы.Добавить(ТекПользователь);
		
		ИмеюПравоМенять = (МоиГруппы.найти(ТекД.Исполнитель) <> неопределено);
		
		Если ИмеюПравоМенять Тогда
			ТекД.ДатаОтметки = ТекущаяДата();
			ТекД.Исполнитель = ТекПользователь;
		Иначе
			ТекД.Отметка = НЕ ТекД.Отметка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

