
Процедура ВывестиЗаголовокПунктаПСЦ(ТабличныйДокумент, ОбластьПроверки, ОбластьПодвал, НомерСтроки, ВсегоПунктов) Экспорт
	
	//Проверяем последний пункт, если он помещается вместе с подвалом, то выводим его, иначе выводим разделитель
	Если НомерСтроки = ВсегоПунктов Тогда 
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьПроверки);
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
		РезультатПроверкиВывода = ПечатьБухгалтерскихДокументов.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСПодвалом);
		
		Если Не РезультатПроверкиВывода Тогда 
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПроверки);	
	
КонецПроцедуры

Функция НапечататьНотисВРП_Рефы_ММ(Протоколы, ДопПараметры = Неопределено, ЭтоНотисВРП_Рефы = Истина) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	// Евросиб US 90342 Рыбьяков К.А. 02.03.2026 ((
	ПечатьСпецСтавок = Ложь;
	ДокументСпецСтавкиСсылка = Неопределено;
	Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("СпецСтавки") Тогда
		ПечатьСпецСтавок = Истина;
		ДокументСпецСтавкиСсылка = ДопПараметры.СпецСтавки;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 02.03.2026 ))
	
	Первый = Истина;
	Для каждого Протокол из Протоколы Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦ.ПФ_MXL_Нотис", Протокол.Контрагент, Протокол.Договор);
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		Если ЭтоНотисВРП_Рефы Тогда
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисВРПРефы");
			ДатаПротокола = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Протокол, "ДатаПСЦ"); 
			ДатаПротоколаСтрока = Формат(ДатаПротокола, "ДФ=dd.MM.yyyy") + "г.";
			ОбластьШапка.Параметры.ДатаПротокола = ДатаПротоколаСтрока;
		Иначе
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисММ");
		КонецЕсли;
		Результат.Вывести(ОбластьШапка);
	
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		ОбластьРазделБезОтступа = Макет.ПолучитьОбласть("РазделБезОтступа");
		
		// Евросиб US 90342 Рыбьяков К.А. 02.03.2026 ((
		Запрос = Новый Запрос;
		
		Если ПечатьСпецСтавок Тогда
			
			ТекстЗапроса = ТекстЗапросаПунктовПечатиСпецСтавок();
			Запрос.Текст = ТекстЗапроса
			
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПСЦПунктыПСЦ.Ссылка КАК Ссылка,
			|	ПСЦПунктыПСЦ.НомерСтроки КАК НомерСтроки,
			|	ПСЦПунктыПСЦ.Заголовок КАК Заголовок,
			|	ПСЦПунктыПСЦ.НомерПункта КАК НомерПункта,
			|	ПСЦПунктыПСЦ.ТекстПунктаРус КАК ТекстПунктаРус,
			|	ПСЦПунктыПСЦ.ТекстПунктаАнгл КАК ТекстПунктаАнгл,
			|	ПСЦПунктыПСЦ.Отредактировано КАК Отредактировано,
			|	ПСЦПунктыПСЦ.ПроверяющийИзменениеДанногоПункта КАК ПроверяющийИзменениеДанногоПункта,
			|	ПСЦПунктыПСЦ.Предопределенный КАК Предопределенный,
			|	ПСЦПунктыПСЦ.ПередТаблицей КАК ПередТаблицей,
			|	ПСЦПунктыПСЦ.ВложенныйСписок КАК ВложенныйСписок,
			|	ПСЦПунктыПСЦ.ЭтоТаблица КАК ЭтоТаблица,
			|	ПСЦПунктыПСЦ.ЭлементПечатнойФормы КАК ЭлементПечатнойФормы,
			|	ПСЦПунктыПСЦ.Отступ КАК Отступ,
			|	ПСЦПунктыПСЦ.Макет КАК Макет
			|ИЗ
			|	Документ.ПСЦ.ПунктыПСЦ КАК ПСЦПунктыПСЦ
			|ГДЕ
			|	ПСЦПунктыПСЦ.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 02.03.2026 ))	
		
		// Евросиб US 90342 Рыбьяков К.А. 02.03.2026 ((
		Если ПечатьСпецСтавок Тогда
			Запрос.УстановитьПараметр("Ссылка", ДокументСпецСтавкиСсылка);
		Иначе
			Запрос.УстановитьПараметр("Ссылка", Протокол);
		КонецЕсли;
		//Запрос.УстановитьПараметр("Ссылка", Протокол);
		// Евросиб Рыбьяков К.А. 02.03.2026 ))
		
		Пункты = Запрос.Выполнить().Выгрузить();
		КоличествоПунктов = Пункты.Количество();
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		Для ИндексСтроки = 0 По КоличествоПунктов - 1 Цикл
			Пункт = Пункты[ИндексСтроки];
			Если Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда
				Если ЭтоНотисВРП_Рефы Тогда
					ВывестиТаблицуНотисВРПРефы(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//	Иначе
			//		ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
				КонецЕсли;
			ИначеЕсли (Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC)
					ИЛИ (Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC) Тогда
				// Евросиб US 90342 Рыбьяков К.А. 16.12.2025 ((
				Если ПечатьСпецСтавок Тогда
					ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы, ПечатьСпецСтавок);
				// Евросиб Рыбьяков К.А. 16.12.2025 ))
				Иначе
					ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);
				КонецЕсли;
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938 
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ШапкаНотисаММ Тогда
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаНотисММ");
				Результат.Вывести(ОбластьШапка);
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаЖД
					И НЕ ЭтоНотисВРП_Рефы Тогда
				ВывестиТаблицуНотисММ(Результат, Макет, Протокол, Пункт.ЭлементПечатнойФормы);				
			ИначеЕсли Пункт.ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаКонтактныеДанные Тогда
				ВывестиТаблицуКонтактныеДанные(Результат, Макет, Протокол);	
			Иначе
				ОбластьРаздел.Область().Отступ = Пункт.Отступ;
				ОбластьРазделБезОтступа.Область().Отступ = Пункт.Отступ;
				ТекстПункта = Документы.ПСЦ.ОтработатьШаблоны(Протокол, Пункт.ТекстПунктаРус);
				НомерПункта = СокрЛП(Пункт.НомерПункта);
				Если ЗначениеЗаполнено(НомерПункта) Тогда
					Если СтрНайти(НомерПункта, ".") = 0 Тогда
						НомерПункта = НомерПункта + ".";
					КонецЕсли;					                                      
				КонецЕсли;
				МассивСтрок = СтрРазделить(ТекстПункта,Символы.ПС);
				ПерваяСтрока = Истина;
				Для каждого Строка из МассивСтрок Цикл
					Если ПерваяСтрока Тогда							
						Строка = НомерПункта +" "+ Строка;
						ПерваяСтрока = Ложь;
						ОбластьРаздел.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРаздел, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					Иначе
						ОбластьРазделБезОтступа.Параметры.Текст = Строка;
						ВывестиЗаголовокПунктаПСЦ(Результат, ОбластьРазделБезОтступа, ОбластьПодвал, ИндексСтроки, КоличествоПунктов - 2);
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли; 
			
			ВывестиТаблицуИзХранилища(Результат, Пункт.Макет);
						
		КонецЦикла;

		Результат.Присоединить(ОбластьПодвал);
				
	КонецЦикла;
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 22.10.2024 )) #92915

//Евросиб Коханенко Н.А. 17.10.2024 (( #92915 
Процедура ВывестиТаблицуКонтактныеДанные(ТабДок, Макет, Протокол) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦКонтактныеДанные.Должность КАК Должность,
		|	ПСЦКонтактныеДанные.Ответственный КАК Ответственный,
		|	ПользователиКонтактнаяИнформацияАдресЭП.АдресЭП КАК АдресЭП,
		|	ПользователиКонтактнаяИнформацияНомерТелефона.Представление КАК Телефон
		|ИЗ
		|	Документ.ПСЦ.КонтактныеДанные КАК ПСЦКонтактныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформацияАдресЭП
		|		ПО ПСЦКонтактныеДанные.Ответственный = ПользователиКонтактнаяИнформацияАдресЭП.Ссылка
		|			И (ПользователиКонтактнаяИнформацияАдресЭП.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформацияНомерТелефона
		|		ПО ПСЦКонтактныеДанные.Ответственный = ПользователиКонтактнаяИнформацияНомерТелефона.Ссылка
		|			И (ПользователиКонтактнаяИнформацияНомерТелефона.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (ПользователиКонтактнаяИнформацияНомерТелефона.НомерСтроки = 2)
		|ГДЕ
		|	ПСЦКонтактныеДанные.Ссылка = &ПСЦСсылка";
	
	Запрос.УстановитьПараметр("ПСЦСсылка", Протокол.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("СтрокаДолжностиКонтактныхДанных");
		ОбластьШапкаТаблицы.Параметры.Должность = Выборка.Должность;
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаКонтактныхДанных");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка);
		ТабДок.Присоединить(ОбластьШапкаТаблицы);
		ТабДок.Присоединить(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 17.10.2024 )) #92915

//Евросиб Коханенко Н.А. 21.10.2024 (( #92915 
//Евросиб US 90342 Рыбьяков добавил ДопПараметры = Неопределено
Процедура ВывестиТаблицуНотисММ(ТабДок, Макет, Протокол, ЭлементПечатнойФормы, ПечатьСпецСтавок = Ложь) Экспорт

	//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
	//Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда 
	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC
		ИЛИ ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC
	Тогда 
	//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938
			|	КалькуляцияДок.Ссылка.Море_УсловияIncoterms КАК Море_УсловияIncoterms, 
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			//Евросиб Коханенко Н.А. 21.05.2025 (( #110233 
			//|	Локации.Наименование КАК ПортОтгрузки,
			//|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК Трансшипмент,
			//Евросиб Коханенко Н.А. 17.06.2025 (( #111353
			//|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК ПортОтгрузки, 
			//|	Локации.Наименование КАК Трансшипмент,
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА Локации.Наименование
			|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование 
			|	КОНЕЦ КАК ПортОтгрузки,
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА """"
			|		ИНАЧЕ Локации.Наименование 
			|	КОНЕЦ КАК Трансшипмент,
			//Евросиб Коханенко Н.А. 17.06.2025 )) #111353 
			// Евросиб US 90342 Рыбьяков К.А. 02.02.2026 ((
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА Локации.Ссылка
			|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Ссылка 
			|	КОНЕЦ КАК ПортОтгрузкиСсылка,
			|	ВЫБОР
			|		КОГДА КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|		ИНАЧЕ Локации.Ссылка 
			|	КОНЕЦ КАК ТрансшипментСсылка,
			// Евросиб Рыбьяков К.А. 02.02.2026 ))
			|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
			|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
			//Евросиб Коханенко Н.А. 01.04.2025 (( #105938 
			//|	Локации.ЛокацияВышестоящегоУровня.Страна КАК ЛокацияВУ,
			|	ВРЕГ(ЛокацииВУ.НаименованиеАнгл) КАК ЛокацияВУ,
			//Евросиб Коханенко Н.А. 01.04.2025 )) #105938 
			|	КалькуляцияНФ_ВыбранныеСтавки.Валюта.СокращенноеНаименование КАК ВалютаСокр
			//Евросиб Коханенко Н.А. 27.06.2025 (( #112908 
			|	ПОМЕСТИТЬ вт_ЦеныCOCSOC 
			//Евросиб Коханенко Н.А. 27.06.2025 )) #112908 
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
			//Евросиб Коханенко Н.А. 28.03.2025 (( #105938 
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДок
			|			ПО КалькуляцияНФ_ВыбранныеСтавки.Ссылка = КалькуляцияДок.Ссылка 			
			//Евросиб Коханенко Н.А. 28.03.2025 )) #105938 
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
			//Евросиб Коханенко Н.А. 01.04.2025 (( #105938 
			//Евросиб Коханенко Н.А. 22.05.2025 (( #110233 
			//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
			//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииВУ
			//|					ПО (ЛокацииВУ.Ссылка = ИерархияЛокаций.ЛокацияВышестоящегоУровня)
			//|				ПО (ИерархияЛокаций.Локация = Локации.Ссылка)
			//|					И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
			//Евросиб Коханенко Н.А. 22.05.2025 )) #110233 
			//Евросиб Коханенко Н.А. 01.04.2025 )) #105938 
			|			ПО КалькуляцияНФ_ВыбранныеСтавки.Порт = Локации.Ссылка
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = ""COC"")
			|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = &Принадлежность)
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614
			//Евросиб Коханенко Н.А. 17.06.2025 (( #111353
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииВУ
			|				ПО (ЛокацииВУ.Ссылка = ИерархияЛокаций.ЛокацияВышестоящегоУровня)
			|			ПО ((ИерархияЛокаций.Локация = КалькуляцияНФ_ВыбранныеСтавки.Порт)
			|				И КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			|				ИЛИ (ИерархияЛокаций.Локация = КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки)
			|				И КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) 
			|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
			//Евросиб Коханенко Н.А. 17.06.2025 )) #111353
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка
			//Евросиб Коханенко Н.А. 10.06.2025 (( #111353 
			|	И НЕ ЛокацииВУ.Ссылка ЕСТЬ NULL
			//Евросиб Коханенко Н.А. 10.06.2025 )) #111353 
			|
			//Евросиб Коханенко Н.А. 27.06.2025 (( #112908 
			//|УПОРЯДОЧИТЬ ПО
			//|	ЛокацияВУ
			|;
			|ВЫБРАТЬ         
			|	Море_УсловияIncoterms,
			|	ПортОтгрузки,
			|	Трансшипмент,
			// Евросиб US 90342 Рыбьяков К.А. 02.02.2026 ((
			|	ПортОтгрузкиСсылка,
			|	ТрансшипментСсылка,
			// Евросиб Рыбьяков К.А. 02.02.2026 ))
			|	Итого20,
			|	Итого40,
			|	ЛокацияВУ,
			|	ВалютаСокр
			|ИЗ вт_ЦеныCOCSOC
			|ГДЕ
			|	Трансшипмент = """"
			|УПОРЯДОЧИТЬ ПО
			|	ЛокацияВУ, Итого20, Итого40
			|;
			|ВЫБРАТЬ         
			//Евросиб Коханенко Н.А. 14.10.2025 (( #121626 
			|	ЛокацияВУ = ""CHINA"" КАК Приоритет,
			//Евросиб Коханенко Н.А. 14.10.2025 )) #121626 
			|	Море_УсловияIncoterms,
			|	ПортОтгрузки,
			|	Трансшипмент,
			|	ПортОтгрузкиСсылка,
			|	ТрансшипментСсылка,
			|	Итого20,
			|	Итого40,
			|	ЛокацияВУ,
			|	ВалютаСокр
			|ИЗ вт_ЦеныCOCSOC
			|ГДЕ
			|	Трансшипмент <> """"
			|УПОРЯДОЧИТЬ ПО
			//Евросиб Коханенко Н.А. 14.10.2025 (( #121626 
			|	Приоритет УБЫВ,
			//Евросиб Коханенко Н.А. 14.10.2025 )) #121626 
			|	ЛокацияВУ
			//Евросиб Коханенко Н.А. 27.06.2025 )) #112908 
			|";
			
		//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
		
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		//Запрос.Текст = Запрос.Текст +  
		//	";
		//	|
		//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	Локации.Наименование КАК ПортОтгрузки,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки.Наименование КАК Трансшипмент,
		//	|	Локации.ЛокацияВышестоящегоУровня.Страна КАК ЛокацияВУ,
		//	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта.СокращенноеНаименование КАК ВалютаСокр
		//	|ИЗ
		//	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
		//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
		//	|			ПО КалькуляцияНФ_ВыбранныеСтавки.Порт = Локации.Ссылка
		//	|				И (КалькуляцияНФ_ВыбранныеСтавки.SOCCOC = ""SOC"")
		//	|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
		//	|ГДЕ
		//	|	ПСЦКалькуляции.Ссылка = &Ссылка
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	ЛокацияВУ,
		//	|	Локации.Наименование";
		////Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		//	
		//Запрос.УстановитьПараметр("Ссылка", Протокол);
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		////РезультатЗапроса = Запрос.Выполнить();
		//МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		//РезультатЗапроса = МассивРезультатовЗапроса[0];
		
		//Если НЕ РезультатЗапроса.Пустой() Тогда
		////Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		//	Выборка = РезультатЗапроса.Выбрать();
		//	
		//	ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦена");
		//	ТабДок.Присоединить(ОбластьШапкаТаблицыММ);
		//	
		//	//вывод таблицы COC
		//	Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
		//		ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
		//		ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
		//		ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
		//		Пока Выборка.Следующий() Цикл
		//			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
		//			ОбластьСтрока.Параметры.ПортОтгрузки = Выборка.ПортОтгрузки; 
		//			ОбластьСтрока.Параметры.Трансшипмент = Выборка.Трансшипмент; 
		//			ОбластьСтрока.Параметры.Итого20 = ?(Выборка.Итого20 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр));
		//			ОбластьСтрока.Параметры.Итого40 = ?(Выборка.Итого40 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр));
		//			ТабДок.Присоединить(ОбластьСтрока);
		//		КонецЦикла;
		//	КонецЦикла; 
		////Евросиб Коханенко Н.А. 23.12.2024 (( #98341 
		//КонецЕсли;
		//РезультатЗапроса = МассивРезультатовЗапроса[1];

		Запрос.УстановитьПараметр("Ссылка", Протокол);
		Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC Тогда
			Принадлежность = "COC";
			// Евросиб US 90342 Рыбьяков К.А. 03.02.2026 ((
			ПринадлежностьПеречисление = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
			// Евросиб Рыбьяков К.А. 03.02.2026 ))
		ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC Тогда
			Принадлежность = "SOC";
			// Евросиб US 90342 Рыбьяков К.А. 03.02.2026 ((
			ПринадлежностьПеречисление = Перечисления.ПринадлежностьТЕ.КТКлиента;
			// Евросиб Рыбьяков К.А. 03.02.2026 ))
		КонецЕсли;
		Запрос.УстановитьПараметр("Принадлежность", Принадлежность);
		
		//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
		//РезультатЗапроса = Запрос.Выполнить();
		//Евросиб Коханенко Н.А. 12.02.2025 )) #102614 
		//Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		// Евросиб US 90342 Рыбьяков К.А. 02.02.2026 ((
		ДанныеСпецСтавок = Неопределено;
		Если ПечатьСпецСтавок Тогда
			ДанныеСпецСтавок = ПолучитьДанныеСпецСтавок(Протокол, ПринадлежностьПеречисление);
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 02.02.2026 ))
		
		Если НЕ МассивРезультатовЗапроса[1].Пустой() 
			ИЛИ НЕ МассивРезультатовЗапроса[2].Пустой() Тогда

 			РезультатЗапроса = МассивРезультатовЗапроса[1]; 

		//Евросиб Коханенко Н.А. 30.06.2025 )) #112908
		
			ОбластьРазделенияМеждуТаблицами = Макет.ПолучитьОбласть("Шапка");
			ТабДок.Присоединить(ОбластьРазделенияМеждуТаблицами);
			
			Выборка = РезультатЗапроса.Выбрать();
			
			//Евросиб Коханенко Н.А. 12.02.2025 (( #102614 
			//ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаSOC");
			Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаCOC Тогда
				ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦена");
			ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаSOC Тогда
				ОбластьШапкаТаблицыММ = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаSOC");
			КонецЕсли;
			//Евросиб Коханенко Н.А. 12.02.2025 )) #102614
			
			ТабДок.Присоединить(ОбластьШапкаТаблицыММ); 
			
			//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
			//выводим сгруппированные строки с direct в таблице COC/SOC
			ПортОтгрузкиМассив = Новый Массив; 
			ОбщиеЗначенияСтроки = Новый Структура("Итого20, Итого40, ВалютаСокр");
			СтрокаПустогоЗначения = "по запросу";
			Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
				
				ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
				ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
				ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
				
				Пока Выборка.Следующий() Цикл
					
					Если ПортОтгрузкиМассив.Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(ОбщиеЗначенияСтроки, Выборка);
					КонецЕсли;
				
					Если Выборка.Итого20 = ОбщиеЗначенияСтроки.Итого20
							И Выборка.Итого40 = ОбщиеЗначенияСтроки.Итого40 Тогда
						СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
						ПортОтгрузкиМассив.Добавить(СтрокаПортаОтгрузки);
					Иначе
						ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения);
						ЗаполнитьЗначенияСвойств(ОбщиеЗначенияСтроки, Выборка);
						ПортОтгрузкиМассив = Новый Массив;
						СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
						ПортОтгрузкиМассив.Добавить(СтрокаПортаОтгрузки);
					КонецЕсли;
					
				КонецЦикла;
				
				ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения);
				ПортОтгрузкиМассив = Новый Массив;
				
			КонецЦикла;
			
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
			РезультатЗапроса = МассивРезультатовЗапроса[2];
			Выборка = РезультатЗапроса.Выбрать();
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908
		
			//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

			//вывод строк таблицы SOC/COC с заполненным трансшипментом
			Пока Выборка.СледующийПоЗначениюПоля("ЛокацияВУ") Цикл       
				ОбластьСтрокаЛокацииВУ = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЛокацияВУ");
				ОбластьСтрокаЛокацииВУ.Параметры.Текст = Выборка.ЛокацияВУ;
				ТабДок.Присоединить(ОбластьСтрокаЛокацииВУ);
				Пока Выборка.Следующий() Цикл 
					ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
					//Евросиб Коханенко Н.А. 28.03.2025 (( #105938
					//ОбластьСтрока.Параметры.ПортОтгрузки = Выборка.ПортОтгрузки; 
					//ОбластьСтрока.Параметры.Трансшипмент = Выборка.Трансшипмент;
					
					//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
					//МассивЭлементов = Новый Массив;
					//МассивЭлементов.Добавить(Выборка.Море_УсловияIncoterms);
					//СимвПоз = Найти(Выборка.ПортОтгрузки, "(");
					//ПортОтгрузки = ?(СимвПоз = 0, Выборка.ПортОтгрузки, Лев(Выборка.ПортОтгрузки, СимвПоз-2)); 
					//МассивЭлементов.Добавить(ПортОтгрузки);
					//Евросиб Коханенко Н.А. 10.06.2025 (( #111353 
					//ОбластьСтрока.Параметры.ПортОтгрузки = СтрСоединить(МассивЭлементов, " ");
					//Евросиб Коханенко Н.А. 10.06.2025 )) #111353 
					//СимвПоз = Найти(Выборка.Трансшипмент, "(");
					//Трансшипмент = ?(СимвПоз = 0, Выборка.Трансшипмент, Лев(Выборка.Трансшипмент, СимвПоз-2));
					СтрокаПортаОтгрузки = СформироватьНаименованиеПортаОтгрузки(Выборка.Море_УсловияIncoterms, Выборка.ПортОтгрузки);
					ОбластьСтрока.Параметры.ПортОтгрузки = ?(ЗначениеЗаполнено(СтрокаПортаОтгрузки), СтрокаПортаОтгрузки, "direct");
					Трансшипмент = СформироватьНаименованиеПортаОтгрузки("", Выборка.Трансшипмент);
					//Евросиб Коханенко Н.А. 30.06.2025 )) #112908 
					ОбластьСтрока.Параметры.Трансшипмент = ?(ЗначениеЗаполнено(Трансшипмент), Трансшипмент, "direct"); 
					//Евросиб Коханенко Н.А. 28.03.2025 )) #105938
					//Евросиб Коханенко Н.А. 10.06.2025 (( #111353
					//ОбластьСтрока.Параметры.Итого20 = ?(Выборка.Итого20 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр));
					//ОбластьСтрока.Параметры.Итого40 = ?(Выборка.Итого40 = 0, "-", СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр));
					// Евросиб US 90342 Рыбьяков К.А. 03.02.2026 ((
					СтрокаПустогоЗначения = "по запросу";
					Если ДанныеСпецСтавок = Неопределено Тогда
						НайденныеСпецСтавки = Новый Массив;
					Иначе
						НайденныеСпецСтавки = ПроверитьНаличиеСпецСтавок(Выборка, ДанныеСпецСтавок);
					КонецЕсли;
					Если НайденныеСпецСтавки.Количество() <> 0 Тогда
						Для Каждого СтрокаСпецСтавок Из НайденныеСпецСтавки Цикл
							Если СтрокаСпецСтавок.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
								ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(СтрокаСпецСтавок.Итого20), СтрШаблон("%1 %2", СтрокаСпецСтавок.Итого20, СтрокаСпецСтавок.ВалютаСокр), СтрокаПустогоЗначения);
								ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(СтрокаСпецСтавок.Итого40), СтрШаблон("%1 %2", СтрокаСпецСтавок.Итого40, СтрокаСпецСтавок.ВалютаСокр), СтрокаПустогоЗначения);
							ИначеЕсли СтрокаСпецСтавок.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
								Если СтрокаСпецСтавок.ЭтоПроцентОтСуммы Тогда
									//Если ЗначениеЗаполнено(СтрокаСпецСтавок.Итого20) Тогда
										ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(Выборка.Итого20), 
											СтрШаблон("%1 %2", Выборка.Итого20 * (1 + СтрокаСпецСтавок.Итого20 / 100), СтрокаСпецСтавок.ВалютаСокр), 
											СтрокаПустогоЗначения);
									//КонецЕсли;
									//Если ЗначениеЗаполнено(СтрокаСпецСтавок.Итого40) Тогда
										ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(Выборка.Итого40), 
											СтрШаблон("%1 %2", Выборка.Итого40 * (1 + СтрокаСпецСтавок.Итого40 / 100), СтрокаСпецСтавок.ВалютаСокр), 
											СтрокаПустогоЗначения);
									//КонецЕсли;
								Иначе
									ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(Выборка.Итого20), СтрШаблон("%1 %2", Выборка.Итого20 + СтрокаСпецСтавок.Итого20, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
									ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(Выборка.Итого40), СтрШаблон("%1 %2", Выборка.Итого40 + СтрокаСпецСтавок.Итого40, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
								КонецЕсли;
							ИначеЕсли СтрокаСпецСтавок.ТипСтавки = Перечисления.ТипыСтавок.Скидка Тогда
								ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(СтрокаСпецСтавок.Итого20), СтрШаблон("%1 %2", СтрокаСпецСтавок.Итого20, СтрокаСпецСтавок.ВалютаСокр), СтрокаПустогоЗначения);
								ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(СтрокаСпецСтавок.Итого40), СтрШаблон("%1 %2", СтрокаСпецСтавок.Итого40, СтрокаСпецСтавок.ВалютаСокр), СтрокаПустогоЗначения);
							КонецЕсли;
						КонецЦикла;
					Иначе
						ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(Выборка.Итого20), 
							СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
						ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(Выборка.Итого40), 
							СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
					КонецЕсли;
					//СтрокаПустогоЗначения = "по запросу";
					//ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(Выборка.Итого20), СтрШаблон("%1 %2", Выборка.Итого20, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
					//ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(Выборка.Итого40), СтрШаблон("%1 %2", Выборка.Итого40, Выборка.ВалютаСокр), СтрокаПустогоЗначения);
					//Евросиб Коханенко Н.А. 10.06.2025 )) #111353
					// Евросиб Рыбьяков К.А. 03.02.2026 ))
					ТабДок.Присоединить(ОбластьСтрока);
				КонецЦикла;
			КонецЦикла; 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 23.12.2024 )) #98341 
		
	ИначеЕсли ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦенаЖД Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20 КАК Ставка20,
			|	ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка КАК Ставка40,
			|	ПСЦКалькуляции.Калькуляция.Суша_ПунктОтправления.Наименование КАК ПунктОтправленияНаименование,
			|	ПСЦКалькуляции.Калькуляция.Суша_ПунктНазначения.Наименование КАК ПунктНазначенияНаименование,
			|	ПСЦКалькуляции.Калькуляция.Валюта.СокращенноеНаименование КАК ВалютаСокр,
			|	ПСЦКалькуляции.Калькуляция.Ссылка КАК КалькуляцияСсылка,
			|	КалькуляцияСписокСтанцийОтправления.Станция.Наименование КАК СтанцияОтправленияНаименование,
			|	КалькуляцияСписокСтанцийНазначения.Станция.Наименование КАК СтанцияНазначенияНаименование
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийОтправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийНазначения.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка
			|УПОРЯДОЧИТЬ ПО
			|	КалькуляцияСсылка";      
		
		Запрос.УстановитьПараметр("Ссылка", Протокол); 
		РезультатЗапроса = Запрос.Выполнить();
		ШапкаТаблицыММДоговорнаяЦенаЖД = Макет.ПолучитьОбласть("ШапкаТаблицыММДоговорнаяЦенаЖД");
		ТабДок.Присоединить(ШапкаТаблицыММДоговорнаяЦенаЖД);

        Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("КалькуляцияСсылка") Цикл
			МассивПунктовОтправления = Новый Массив;
			МассивПунктовНазначения = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.СтанцияОтправленияНаименование) Тогда
					МассивПунктовОтправления.Добавить(Выборка.СтанцияОтправленияНаименование);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.СтанцияНазначенияНаименование) Тогда
					МассивПунктовНазначения.Добавить(Выборка.СтанцияНазначенияНаименование);
				КонецЕсли;
			КонецЦикла;                                                                           
			Если МассивПунктовОтправления.Количество() = 0 Тогда
				МассивПунктовОтправления.Добавить(Выборка.ПунктОтправленияНаименование);
			Иначе
				МассивПунктовОтправления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПунктовОтправления);
			КонецЕсли;
			СтрокаПунктовОтправления = СтрСоединить(МассивПунктовОтправления, " / " + Символы.ПС);
			Если МассивПунктовНазначения.Количество() = 0 Тогда
				МассивПунктовНазначения.Добавить(Выборка.ПунктНазначенияНаименование);
			Иначе
				МассивПунктовНазначения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПунктовНазначения);
			КонецЕсли;
			//вывод таблицы 
			ПерваяСтрока = Истина;
			Для Каждого СтанцияНазначения Из МассивПунктовНазначения Цикл
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦенаЖД");
				Если ПерваяСтрока Тогда 
					ОбластьСтрока.Параметры.ПунктОтправления = СтрокаПунктовОтправления; 
					//пока не ясно, нужно повторять в каждой строке, или достаточно только в первой. ждем обратной связи от заказчика
					//ПерваяСтрока = Ложь;
				Иначе
					ОбластьСтрока.Параметры.ПунктОтправления = "";
				КонецЕсли;
				ОбластьСтрока.Параметры.СтанцияНазначения = СтанцияНазначения;
				ОбластьСтрока.Параметры.Ставка20 = ?(Выборка.Ставка20 = 0, "-", СтрШаблон("%1 %2", Выборка.Ставка20, Выборка.ВалютаСокр));
				//для значения 20'(груз > 24т) пока нет данных, появится при дальнейших разработках
				ОбластьСтрока.Параметры.Ставка20больше = "-";
				ОбластьСтрока.Параметры.Ставка40 = ?(Выборка.Ставка40 = 0, "-", СтрШаблон("%1 %2", Выборка.Ставка40, Выборка.ВалютаСокр));
				ТабДок.Присоединить(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.10.2024 )) #92915 

//Евросиб Коханенко Н.А. 02.11.2024 (( #92915 
Процедура ВывестиТаблицуНотисВРПРефы(ТабДок, Макет, Протокол, ЭлементПечатнойФормы)

	Если ЭлементПечатнойФормы = Справочники.ЭлементыПечатнойФормыПротокола.ТаблицаДоговорнаяЦена Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			" ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТККлиента
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка20,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТККлиента
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка40,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТКЕвросиб
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка20
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка20Евросиб,
			|	ВЫБОР
			|		КОГДА ПСЦКалькуляции.Калькуляция.веб_ДляКТКЕвросиб
			|			ТОГДА ПСЦКалькуляции.Калькуляция.ММ_ИтогоСтавка
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Ставка40Евросиб,
			|	ПСЦКалькуляции.Калькуляция.УсловияПеревозки_Отправление КАК УсловияПеревозки_Отправление,
			|	ПСЦКалькуляции.Калькуляция.УсловияПеревозки_Прибытие КАК УсловияПеревозки_Прибытие,
			|	ЛОЖЬ КАК КТКЕвросиб,
			|	ПСЦКалькуляции.Калькуляция.Валюта.СокращенноеНаименование КАК ВалютаСокр,
			|	ВЫБОР
			|		КОГДА КалькуляцияСписокСтанцийОтправления.Станция.Наименование ЕСТЬ NULL 
			|			ТОГДА ПСЦКалькуляции.Калькуляция.Суша_ПунктОтправления.Наименование
			|		ИНАЧЕ КалькуляцияСписокСтанцийОтправления.Станция.Наименование
			|	КОНЕЦ КАК СтанцияОтправленияНаименование,
			|	ВЫБОР
			|		КОГДА КалькуляцияСписокСтанцийНазначения.Станция.Наименование ЕСТЬ NULL 
			|			ТОГДА ПСЦКалькуляции.Калькуляция.Суша_ПунктНазначения.Наименование
			|		ИНАЧЕ КалькуляцияСписокСтанцийНазначения.Станция.Наименование
			|	КОНЕЦ КАК СтанцияНазначенияНаименование
			|ИЗ
			|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийОтправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
			|		ПО ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийНазначения.Ссылка
			|ГДЕ
			|	ПСЦКалькуляции.Ссылка = &Ссылка";		
		Запрос.УстановитьПараметр("Ссылка", Протокол);
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
		ТаблицаДанных.Колонки.Добавить("МаршрутСледования", ОписаниеТипаСтрока);
		ТаблицаДанных.Колонки.Добавить("УсловияПеревозки", ОписаниеТипаСтрока);
	
		//вывод таблицы
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыВРПРефыДоговорнаяЦена");
		ТабДок.Присоединить(ОбластьШапкаТаблицы);

		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл 
		
			Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Или ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
				Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Отправление) Тогда
					ОтправлениеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Отправление);
				Иначе
					ОтправлениеТекст = "";
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТаблицы.УсловияПеревозки_Прибытие) Тогда
					ПрибытиеТекст = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.УсловияПеревозки_Прибытие);
				Иначе
					ПрибытиеТекст = "";
				КонецЕсли;
				СтрокаТаблицы.УсловияПеревозки = ОтправлениеТекст + " - " + ПрибытиеТекст + ?(СтрокаТаблицы.КТКЕвросиб, " + КТК", "");
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.СтанцияОтправленияНаименование) 
					ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.СтанцияНазначенияНаименование) Тогда
				Пункты = Новый Массив;
				Пункты.Добавить(СтрокаТаблицы.СтанцияОтправленияНаименование);
				Пункты.Добавить(СтрокаТаблицы.СтанцияНазначенияНаименование);
				СтрокаТаблицы.МаршрутСледования = СтрСоединить(Пункты, " - ");
			КонецЕсли;
			
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыВРПРефыДоговорнаяЦена");
			ОбластьСтрока.Параметры.МаршрутСледования = СтрокаТаблицы.МаршрутСледования; 
			ОбластьСтрока.Параметры.УсловияПеревозки = СтрокаТаблицы.УсловияПеревозки; 
			ОбластьСтрока.Параметры.Ставка20 = ?(СтрокаТаблицы.Ставка20 = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка20, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка20Евросиб = ?(СтрокаТаблицы.Ставка20Евросиб = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка20Евросиб, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка40 = ?(СтрокаТаблицы.Ставка40 = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка40, СтрокаТаблицы.ВалютаСокр));
			ОбластьСтрока.Параметры.Ставка40Евросиб = ?(СтрокаТаблицы.Ставка40Евросиб = 0, "-", СтрШаблон("%1 %2", СтрокаТаблицы.Ставка40Евросиб, СтрокаТаблицы.ВалютаСокр));
			ТабДок.Присоединить(ОбластьСтрока);
			
		КонецЦикла;    
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 22.10.2024 )) #92915 

//Евросиб Коханенко Н.А. 31.10.2024 (( #92915
Процедура ВывестиТаблицуИзХранилища(ТабДок, ТаблицаСсылка) Экспорт

	Если НЕ ЗначениеЗаполнено(ТаблицаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	стДанныеТаблицы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТаблицаСсылка, "Макет, ЕстьМакет");
	Если стДанныеТаблицы.ЕстьМакет Тогда
		Макет = стДанныеТаблицы.Макет.Получить();
		Если Макет <> Неопределено 
			И ТипЗнч(Макет) = Тип("ТабличныйДокумент") Тогда
			Попытка
				ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
				ТабДок.Присоединить(ОбластьТаблица);
			Исключение   
				ОбщегоНазначения.СообщитьПользователю("Не удалось получить область ""Таблица"" из макета: " + ТаблицаСсылка);
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры //Евросиб Коханенко Н.А. 31.10.2024 )) #92915

//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
Процедура ВывестиСтрокуТаблицыCOCSOC(ТабДок, Макет, ОбщиеЗначенияСтроки, ПортОтгрузкиМассив, СтрокаПустогоЗначения)
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыММДоговорнаяЦена");
	СтрокаПортаОтгрузки = СтрСоединить(ПортОтгрузкиМассив, " /");
	ОбластьСтрока.Параметры.ПортОтгрузки = ?(ЗначениеЗаполнено(СтрокаПортаОтгрузки), СтрокаПортаОтгрузки, "direct");
	ОбластьСтрока.Параметры.Итого20 = ?(ЗначениеЗаполнено(ОбщиеЗначенияСтроки.Итого20), СтрШаблон("%1 %2", ОбщиеЗначенияСтроки.Итого20, ОбщиеЗначенияСтроки.ВалютаСокр), СтрокаПустогоЗначения);
	ОбластьСтрока.Параметры.Итого40 = ?(ЗначениеЗаполнено(ОбщиеЗначенияСтроки.Итого40), СтрШаблон("%1 %2", ОбщиеЗначенияСтроки.Итого40, ОбщиеЗначенияСтроки.ВалютаСокр), СтрокаПустогоЗначения);
	ОбластьСтрока.Параметры.Трансшипмент = "direct";
	ТабДок.Присоединить(ОбластьСтрока);

КонецПроцедуры //Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

//Евросиб Коханенко Н.А. 30.06.2025 (( #112908 
Функция СформироватьНаименованиеПортаОтгрузки(Море_УсловияIncoterms, ПортОтгрузки)
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Море_УсловияIncoterms);
	СимвПоз = Найти(ПортОтгрузки, "(");
	ПортОтгрузкиСтрока = ?(СимвПоз = 0, ПортОтгрузки, Лев(ПортОтгрузки, СимвПоз-2));
	МассивЭлементов.Добавить(ПортОтгрузкиСтрока);
	ПортОтгрузкиСтрока = СтрСоединить(МассивЭлементов, " ");
	Возврат ПортОтгрузкиСтрока;

КонецФункции //Евросиб Коханенко Н.А. 30.06.2025 )) #112908 

// Евросиб US 90342 TA 124063 Рыбьяков К.А. 02.02.2026 ((
Функция ПолучитьДанныеСпецСтавок(ПСЦ, Принадлежность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеестрСпециальныхСтавок.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПСЦВСпецставках
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок КАК РеестрСпециальныхСтавок
	|ГДЕ
	|	РеестрСпециальныхСтавок.Применяется = &ПСЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Ссылка КАК Ссылка,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Контрагент КАК Контрагент,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ТипСтавки КАК ТипСтавки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтправления КАК ПортОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтгрузки КАК ПортОтгрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортНазначения КАК ПортНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПогрузки КАК УсловияПогрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияВыгрузки КАК УсловияВыгрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.НадбавкаСкидка КАК НадбавкаСкидка,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки КАК ПараметрПеревозки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР 
	|		КОГДА РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки.РазмерКТК = Значение(Справочник.РазмерыКТК.К20)
	|			ТОГДА РеестрСпециальныхСтавокСпециальныеСтавки.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Итого20,
	|	ВЫБОР 
	|		КОГДА РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки.РазмерКТК <> Значение(Справочник.РазмерыКТК.К20)
	|			ТОГДА РеестрСпециальныхСтавокСпециальныеСтавки.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Итого40,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки.Валюта.СокращенноеНаименование КАК ВалютаСокр,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок.СпециальныеСтавки КАК РеестрСпециальныхСтавокСпециальныеСтавки
	|ГДЕ
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ПСЦВСпецставках.Ссылка
	|			ИЗ
	|				ВТ_ПСЦВСпецставках)
	|	И РеестрСпециальныхСтавокСпециальныеСтавки.ПараметрПеревозки.ПринадлежностьТЕ = &ПринадлежностьТЕ";
	
	Запрос.УстановитьПараметр("ПСЦ", ПСЦ);
	Запрос.УстановитьПараметр("ПринадлежностьТЕ", Принадлежность);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции // Евросиб Рыбьяков К.А. 02.02.2026 ))

// Евросиб US 90342 TA 124063 Рыбьяков К.А. 02.02.2026 ((
Функция ПроверитьНаличиеСпецСтавок(Выборка, ДанныеСпецСтавок)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ПортОтгрузки", Выборка.ПортОтгрузкиСсылка);
	СтруктураПоиска.Вставить("ПортОтправления", Выборка.ТрансшипментСсылка);
	
	НайденныеСтроки = ДанныеСпецСтавок.НайтиСтроки(СтруктураПоиска);
	
	Возврат НайденныеСтроки;
	
КонецФункции // Евросиб Рыбьяков К.А. 02.02.2026 ))

// Евросиб US 90342 TA 124063 Рыбьяков К.А. 02.03.2026 ((
Функция ТекстЗапросаПунктовПечатиСпецСтавок()
	
	Текст = "ВЫБРАТЬ
	|	ПунктыПечатиСпециальныхСтавок.Ссылка КАК Ссылка,
	|	ПунктыПечатиСпециальныхСтавок.НомерСтроки КАК НомерСтроки,
	|	ПунктыПечатиСпециальныхСтавок.Заголовок КАК Заголовок,
	|	ПунктыПечатиСпециальныхСтавок.НомерПункта КАК НомерПункта,
	|	ПунктыПечатиСпециальныхСтавок.ТекстПунктаРус КАК ТекстПунктаРус,
	|	ПунктыПечатиСпециальныхСтавок.ТекстПунктаАнгл КАК ТекстПунктаАнгл,
	|	ПунктыПечатиСпециальныхСтавок.Отредактировано КАК Отредактировано,
	|	ПунктыПечатиСпециальныхСтавок.ПроверяющийИзменениеДанногоПункта КАК ПроверяющийИзменениеДанногоПункта,
	|	ПунктыПечатиСпециальныхСтавок.Предопределенный КАК Предопределенный,
	|	ПунктыПечатиСпециальныхСтавок.ПередТаблицей КАК ПередТаблицей,
	|	ПунктыПечатиСпециальныхСтавок.ВложенныйСписок КАК ВложенныйСписок,
	|	ПунктыПечатиСпециальныхСтавок.ЭтоТаблица КАК ЭтоТаблица,
	|	ПунктыПечатиСпециальныхСтавок.ЭлементПечатнойФормы КАК ЭлементПечатнойФормы,
	|	ПунктыПечатиСпециальныхСтавок.Отступ КАК Отступ,
	|	ПунктыПечатиСпециальныхСтавок.Макет КАК Макет,
	|	ПунктыПечатиСпециальныхСтавок.ОсновнойРаздел КАК ОсновнойРаздел,
	|	ПунктыПечатиСпециальныхСтавок.УсловияПеревозки КАК УсловияПеревозки,
	|	ПунктыПечатиСпециальныхСтавок.КонтактныеДанные КАК КонтактныеДанные
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок.ПунктыПечатиСпециальныхСтавок КАК ПунктыПечатиСпециальныхСтавок
	|ГДЕ
	|	ПунктыПечатиСпециальныхСтавок.Ссылка = &Ссылка
	|	И НЕ ПунктыПечатиСпециальныхСтавок.НеОтображатьВПечатнойФорме
	|	И ((ПунктыПечатиСпециальныхСтавок.Ссылка.ВключатьОсновныеРазделы И ПунктыПечатиСпециальныхСтавок.ОсновнойРаздел)
	|		ИЛИ (ПунктыПечатиСпециальныхСтавок.Ссылка.ВключатьУсловияПеревозки И ПунктыПечатиСпециальныхСтавок.УсловияПеревозки)
	|		ИЛИ (ПунктыПечатиСпециальныхСтавок.Ссылка.ВключатьКонтактныеДанные И ПунктыПечатиСпециальныхСтавок.КонтактныеДанные)
	|		ИЛИ (Не ПунктыПечатиСпециальныхСтавок.ОсновнойРаздел И Не ПунктыПечатиСпециальныхСтавок.УсловияПеревозки И Не ПунктыПечатиСпециальныхСтавок.КонтактныеДанные))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Текст;
	
КонецФункции // Евросиб Рыбьяков К.А. 02.03.2026 ))
