// ДИТ Ticket#0375661 Лаврентьев О.М. Начало: 21.11.2024
&НаСервере
Функция ПроверкаУникальностиПоНаименованиюПройдена()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    МорскиеЛинии.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.МорскиеЛинии КАК МорскиеЛинии
    |ГДЕ
    |    МорскиеЛинии.Ссылка <> &Ссылка
    |    И МорскиеЛинии.Наименование = &Наименование";
    
    Запрос.УстановитьПараметр("Ссылка",       Объект.Ссылка);
    Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
            Возврат Ложь;
		Иначе 
			Возврат Истина;
    КонецЕсли;
    
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    Если ЗначениеЗаполнено(Объект.Наименование) Тогда
            Если НЕ ПроверкаУникальностиПоНаименованиюПройдена() Тогда
                Сообщение = Новый СообщениеПользователю;
                Сообщение.Текст = "Морская линия не будет создана, так как уже есть похожая запись!";
                Сообщение.Поле  = "Объект.Наименование";
                Сообщение.Сообщить();
                Отказ = Истина;
            КонецЕсли;
    КонецЕсли;    
        
КонецПроцедуры
// ДИТ Ticket#0375661 Лаврентьев О.М. Конец: 21.11.2024