&НаКлиенте
Процедура ПериодСписанияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда          
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписанияПериодСписания", ЭтотОбъект, Направление);
		ПоказатьВопрос(ОписаниеОповещения, "При изменении периода списания табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		СтандартнаяОбработка = Ложь;
		Объект.ПериодСписания = НачалоМесяца(ДобавитьМесяц(Объект.ПериодСписания, Направление));
		ПериодСписания = Формат(Объект.ПериодСписания, "ДФ='ММММ гггг'");
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПериодВозникновенияОстатков.ДатаНачала = Объект.НачалоПериодаВозникновенияОстатков;
	ПериодВозникновенияОстатков.ДатаОкончания = Объект.ОкончаниеПериодаВозникновенияОстатков;
	ПериодСписания = Формат(Объект.ПериодСписания, "ДФ='ММММ гггг'");
	ПересчитатьИтоговыеСуммыНаСервере();


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПериодВозникновенияОстатковПриИзменении(Элемент)
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписания", ЭтотОбъект, "ПериодВозникновенияОстатков");
		ПоказатьВопрос(ОписаниеОповещения, "При изменении периода возникновения остатков табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		Объект.НачалоПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаНачала;
		Объект.ОкончаниеПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	УстановитьВидимостьСуммВО();
	УстановитьВидимостьСуммУУ();        
	Элементы.ГруппаШапка.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаВариантыЗаполнения.ТолькоПросмотр = Объект.Проведен;
	Элементы.ПериодВозникновенияОстатков.ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры                  

&НаКлиенте
Процедура УстановитьВидимостьСуммВО()
	Элементы.РасходыКСписаниюГруппаСуммыВО.Видимость = Объект.ВО;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСуммУУ()
	Элементы.РасходыКСписаниюГруппаСуммыУУ.Видимость = Объект.УУ;
КонецПроцедуры

&НаКлиенте
Процедура ВОПриИзменении(Элемент)
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписания", ЭтотОбъект, "ВО");
		ПоказатьВопрос(ОписаниеОповещения, "При изменении признака табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		УстановитьВидимостьСуммВО();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УУПриИзменении(Элемент)
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписания", ЭтотОбъект, "УУ");
		ПоказатьВопрос(ОписаниеОповещения, "При изменении признака табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		УстановитьВидимостьСуммУУ();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоговыеСуммыНаСервере()
	ТаблицаСписания = Объект.РасходыКСписанию.Выгрузить();
	ТаблицаСписания.Свернуть("Валюта", "СуммаВО, СуммаВОРуб, СуммаУУ, СуммаУУРуб");
	СуммыВО = "";
	СуммыУУ = "";
	Для каждого СтрокаВалюта Из ТаблицаСписания Цикл
		СуммыВО = СуммыВО + СтрШаблон("%1: %2", СтрокаВалюта.Валюта, СтрокаВалюта.СуммаВО) + Символы.ПС;
		СуммыУУ = СуммыУУ + СтрШаблон("%1: %2", СтрокаВалюта.Валюта, СтрокаВалюта.СуммаУУ) + Символы.ПС;
	КонецЦикла;                               
	ИтогоВО = ТаблицаСписания.Итог("СуммаВОРуб");
	ИтогоУУ = ТаблицаСписания.Итог("СуммаУУРуб");
	ВысотаЭлементов = ТаблицаСписания.Количество();
	Элементы.СуммыВО.Высота = ВысотаЭлементов;
	Элементы.СуммыУУ.Высота = ВысотаЭлементов;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнитьСписание", ЭтотОбъект, Параметры);
	Если Объект.Проведен Тогда
		ПоказатьВопрос(Оповещение, "Документ проведен. Перед заполнением документа будет выполнена отмена проведения. Продолжить?", Режим, 0);		
	Иначе			
		ПоказатьВопрос(Оповещение, "Будет выполнено заполнение табличной части. Продолжить?", Режим, 0);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполнитьСписание(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
    КонецЕсли;
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
    РезультатВыполнения = ЗаполнитьСписаниеНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Выполняется заполнение таблицы списания.
										|Это может занять продолжительное время.";
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьСписаниеЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписаниеНаСервере()
	
	Если РезультатВыполнения <> Неопределено
		И ЗначениеЗаполнено(РезультатВыполнения.ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(РезультатВыполнения.ИдентификаторЗадания);
	КонецЕсли;
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получить таблицу списания плановых расходов'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ПараметрыПроцедуры = Новый Структура("Организация, НачалоПериодаВозникновенияОстатков, ОкончаниеПериодаВозникновенияОстатков, ВО, УУ, ПериодСписания, СторноПланаБезФакта, СторноПланаСЧастичнымФактом");
	ЗаполнитьЗначенияСвойств(ПараметрыПроцедуры, Объект);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("УчетДоходовРасходовСервер.ПолучитьТаблицуСписанияПлановыхРасходов",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписаниеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗаполнитьДаннымиНаСервере(РезультатВыполнения.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере(АдресРезультата)
	ТаблицаСписания = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Если ТаблицаСписания <> Неопределено Тогда
		ТаблицаСписания.Свернуть("Сделка, Валюта", "СуммаВО, СуммаВОРуб, СуммаУУ, СуммаУУРуб");
		Объект.РасходыКСписанию.Загрузить(ТаблицаСписания);
		ПересчитатьИтоговыеСуммыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СторноПланаБезФактаПриИзменении(Элемент)
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписания", ЭтотОбъект, "СторноПланаБезФакта");
		ПоказатьВопрос(ОписаниеОповещения, "При изменении признака табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьТаблицуСписания(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Если ДополнительныеПараметры = "ПериодВозникновенияОстатков" Тогда
			ПериодВозникновенияОстатков.ДатаНачала = Объект.НачалоПериодаВозникновенияОстатков;
			ПериодВозникновенияОстатков.ДатаОкончания = Объект.ОкончаниеПериодаВозникновенияОстатков;
		Иначе
			Объект[ДополнительныеПараметры] = НЕ Объект[ДополнительныеПараметры];
		КонецЕсли;
		Возврат;
	КонецЕсли;	                                             
	Объект.РасходыКСписанию.Очистить();
	Объект.НачалоПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаНачала;
	Объект.ОкончаниеПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаОкончания;
	ПересчитатьИтоговыеСуммыНаСервере();
	УстановитьВидимостьСуммВО();
	УстановитьВидимостьСуммУУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьТаблицуСписанияПериодСписания(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	                                             
	Объект.ПериодСписания = НачалоМесяца(ДобавитьМесяц(Объект.ПериодСписания, ДополнительныеПараметры));
	ПериодСписания = Формат(Объект.ПериодСписания, "ДФ='ММММ гггг'");
	Модифицированность = Истина;
	
	Объект.РасходыКСписанию.Очистить();
	Объект.НачалоПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаНачала;
	Объект.ОкончаниеПериодаВозникновенияОстатков = ПериодВозникновенияОстатков.ДатаОкончания;
	ПересчитатьИтоговыеСуммыНаСервере();
	УстановитьВидимостьСуммВО();
	УстановитьВидимостьСуммУУ();
	
КонецПроцедуры

&НаКлиенте
Процедура СторноПланаСЧастичнымФактомПриИзменении(Элемент)
	Если Объект.РасходыКСписанию.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОчиститьТаблицуСписания", ЭтотОбъект, "СторноПланаСЧастичнымФактом");
		ПоказатьВопрос(ОписаниеОповещения, "При изменении признака табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
КонецПроцедуры

