
&НаКлиенте
Перем МакетыКлиента;
&НаКлиенте
Перем МакетыПодрядчика;

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Тарифы.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	//// + Состояния
	//ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	//ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	//ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	ДоступныеЛичныеЦели = ЛичныеЦелиСервер.ПолучитьДействующиеЦелиДляРучнойОтметки(Объект.Ссылка);
	Для каждого Стр из ДоступныеЛичныеЦели Цикл
		НСтр = Объект.ЛичныеЦели.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
	КонецЦикла;
	
	// - Состояния
//Евросиб Гудкова( 08.11.2019 Ticket№ 
	ОбновитьТекущиеПараметрыНДС0();
// Евросиб Гудкова)

	//Евросиб Каблов 03.06.2021 ( Ticket#0230677
	ОбновитьТекущиеПараметрыФакторинга();
	//Евросиб Каблов 03.06.2021 ) 

	ЗаполнитьПДЗИзРегистра();
	
//Евросиб Гудкова( 28.10.2020 всё регулируется ролями 
	//Элементы.КомментарийПДЗ.ТолькоПросмотр = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("dc_НастройкаДоговоров"));
	////Евросиб - АСуслов 03.09.2020 14:37:51 #
	////(
	//Элементы.ВыставлятьСчетНаАнглийскомЯзыке.ТолькоПросмотр = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("dc_НастройкаДоговоров"));
	////)
	////Евросиб - АСуслов 03.09.2020 14:37:52 #
	//
	//Элементы.БанковскиеРеквизитыДляОплаты.ТолькоПросмотр = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("dc_НастройкаУсловийОплатыВДоговоре")); // SIV 27-10-20
// Евросиб Гудкова) 	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 ) 

	//Евросиб Коханенко Н.А. 25.10.2023 (( #76593
	ПользовательСПолнымиПравами = РольДоступна("ПолныеПрава");
	Элементы.ГруппаСостояния.Видимость = ПользовательСПолнымиПравами;
	//Евросиб Коханенко Н.А. 25.10.2023 )) #76593
	
	//БИТ Белинский Д.А. 12.04.2023 -начало
	//Евросиб Коханенко Н.А. 25.10.2023 (( #76593
	//Если РольДоступна("ПолныеПрава") Или Объект.Автор = ПараметрыСеанса.ТекущийПользователь Тогда
	Если ПользовательСПолнымиПравами ИЛИ Объект.Автор = ПараметрыСеанса.ТекущийПользователь Тогда
	//Евросиб Коханенко Н.А. 25.10.2023 )) #76593
		Элементы.НеПроверятьРегистрациюВБИТФИНАНС.ТолькоПросмотр = Ложь;	
	Иначе 
		Элементы.НеПроверятьРегистрациюВБИТФИНАНС.ТолькоПросмотр = Истина;	
	КонецЕсли;
	//БИТ Белинский Д.А. 12.04.2023 -конец

	//Евросиб Коханенко Н.А. 28.09.2023 (( #75458 
	//разрешаем редактирование банковских счетов и условий оплаты только при наличии роли
	Элементы.ГруппаУсловияОплаты.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("dc_РазрешитьРедактированиеУсловийОплатыВДоговорахКонтрагента",,Ложь);
	//Евросиб Коханенко Н.А. 28.09.2023 )) #75458
	
	//Евросиб Каблов 10.03.2025 ( #100116
	Если ЗначениеЗаполнено(Объект.ФормаПротокола) И Не ПользовательСПолнымиПравами тогда
		Элементы.ФормаПротокола.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаПротокола.ТолькоПросмотр = Ложь;
	КонецЕсли;
	//Евросиб Каблов 10.03.2025 )
	
	УстановитьОграниченияПричинаОтказаОтЭДО(); //Евросиб Шевченко А.В. 17.06.2025 US 104900 TA 112049
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПДЗИзРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияСтатусовПДЗСрезПоследних.Период КАК Период,
	               |	ИсторияСтатусовПДЗСрезПоследних.Статус КАК СтатусПДЗ,
	               |	ИсторияСтатусовПДЗСрезПоследних.Комментарий КАК КомментарийПДЗ,
	               |	ИсторияСтатусовПДЗСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ИсторияСтатусовПДЗ.СрезПоследних(, Договор = &Договор) КАК ИсторияСтатусовПДЗСрезПоследних";
	Запрос.УстановитьПараметр("Договор",Объект.Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект,Ответ);
		ДатаСтатусаПДЗ = Ответ.Период;
		ОтветственныйПДЗ = Ответ.Ответственный;
	КонецЕсли;
	
КонецПроцедуры	
	
&НаСервере
Функция СоздатьВБФНаСервере()
	
	Сообщение = БитФинансСервер.ПередатьДоговорВБФ(Объект.Ссылка);
	ЭтотОбъект.Прочитать();
	Возврат Сообщение;
	
КонецФункции
// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, Объект.ТекущееСостояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);

	//Для каждого Стр из Объект.Состояния Цикл
	//	Если Стр.Состояние = Объект.ТекущееСостояние Тогда
	//		ТекущийИсполнитель_Статус = Стр.Статус;
	//		ТекущийИсполнитель_Состояние = Стр.Состояние;
	//		ТекущийИсполнитель_Исполнитель = Стр.Исполнитель;
	//		ТекущийИсполнитель_Наблюдатель = Стр.Наблюдатель;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	//ДИТ Шевченко А.В. 56947 06.09.2022 -начало
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, Объект.ТекущееСостояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	// обновляем информацию по состоянию 
	//Для каждого Состояние из Объект.Состояния Цикл
	//	Если Состояние.Состояние = Объект.ТекущееСостояние Тогда
	//		Состояние.Статус = ТекущийИсполнитель_Статус;
	//		
	//		Состояние.Исполнитель = ПользователиКлиент.ТекущийПользователь();
	//		ТекущийИсполнитель_Исполнитель = Состояние.Исполнитель;
	//		ТекущийИсполнитель_Наблюдатель = Состояние.Наблюдатель;
	//		
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//ДИТ Шевченко А.В. 56947 06.09.2022 -конец
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

//ДИТ Шевченко А.В. 56947 06.09.2022 -начало
&НаКлиенте
Процедура ТекущийИсполнитель_СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусОбработкаВыбора(Объект, Объект.ТекущееСостояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель, ВыбранноеЗначение);
    ОбновитьПанельСостояний();
КонецПроцедуры
//ДИТ Шевченко А.В. 56947 06.09.2022 -конец

&НаКлиенте
Процедура ПроверитьЗаполнениеОтветственных(Отказ)
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022 
	мОтветственныйЗаУчет = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаУчет"); 
	мОтветственныйЗаСопровождение = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	мОсновнойЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО");
	мТерминалНовосибирск = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск");
	
	Соответствие = Новый Соответствие;
	
	Для Каждого СтрОтветственный Из Объект.Ответственные Цикл 
		Если СтрОтветственный.ТипОтветственного = мОтветственныйЗаУчет И СтрОтветственный.ЦФО = мОсновнойЦФО Тогда 
			Соответствие.Вставить("ОтветственныйЗаУчет",СтрОтветственный.Ответственный);
		ИначеЕсли СтрОтветственный.ТипОтветственного = мОтветственныйЗаУчет И СтрОтветственный.ЦФО = мТерминалНовосибирск Тогда 
			Соответствие.Вставить("ОтветственныйЗаУчетНСК",СтрОтветственный.Ответственный);	 
		ИначеЕсли СтрОтветственный.ТипОтветственного = мОтветственныйЗаСопровождение И СтрОтветственный.ЦФО = мОсновнойЦФО Тогда 
			Соответствие.Вставить("ОтветственныйЗаСопровождение",СтрОтветственный.Ответственный);
		ИначеЕсли СтрОтветственный.ТипОтветственного = мОтветственныйЗаСопровождение И СтрОтветственный.ЦФО = мТерминалНовосибирск Тогда 
			Соответствие.Вставить("ОтветственныйЗаСопровождениеНСК",СтрОтветственный.Ответственный);	
		КонецЕсли;	
	КонецЦикла;
	
	// Проверка на лишние записи
	Отбор = Новый Структура("ЦФО,ТипОтветственного",мОсновнойЦФО, мОтветственныйЗаУчет);
	Если Объект.Ответственные.НайтиСтроки(Отбор).Количество() > 1 Тогда                                                                                   
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В ЦФО: %1 может быть только один %2!", мОсновнойЦФО, мОтветственныйЗаУчет),,,,Отказ);
	КонецЕсли;
	Отбор = Новый Структура("ЦФО,ТипОтветственного",мТерминалНовосибирск, мОтветственныйЗаУчет);
	Если Объект.Ответственные.НайтиСтроки(Отбор).Количество() > 1 Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В ЦФО: %1 может быть только один %2!", мТерминалНовосибирск, мОтветственныйЗаУчет),,,,Отказ);	
	КонецЕсли;
	Отбор = Новый Структура("ЦФО,ТипОтветственного",мОсновнойЦФО, мОтветственныйЗаСопровождение);
	Если Объект.Ответственные.НайтиСтроки(Отбор).Количество() > 1 Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В ЦФО: %1 может быть только один %2!", мОсновнойЦФО, мОтветственныйЗаСопровождение),,,,Отказ);	
	КонецЕсли;  
	Отбор = Новый Структура("ЦФО,ТипОтветственного",мТерминалНовосибирск, мОтветственныйЗаСопровождение);
	Если Объект.Ответственные.НайтиСтроки(Отбор).Количество() > 1 Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В ЦФО: %1 может быть только один %2!", мТерминалНовосибирск, мОтветственныйЗаСопровождение),,,,Отказ);	
	КонецЕсли;
	//
	
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
	
	//ДИТ Шевченко А.В. 56947 06.09.2022 -начало
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Для Каждого СтрокаСостояния Из Объект.Состояния Цикл
			Если СтрокаСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ЗаполнитьОтветственногоЗаУчет")
				И СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022 
					//И НЕ ЗначениеЗаполнено(Объект.ОтветственныйЗаУчет) Тогда
					//ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за учет» не заполнен",,"Объект.ОтветственныйЗаУчет",,Отказ);
					И НЕ ЗначениеЗаполнено(Соответствие.Получить("ОтветственныйЗаУчет")) Тогда
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
					ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за учет» не заполнен",,,,Отказ);
			КонецЕсли;	
		КонецЦикла;	
		Для Каждого СтрокаСостояния Из Объект.Состояния Цикл
			Если СтрокаСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.УказатьОтветственногоЗаСопровождениеИУчетНСК")
				И СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
					//И НЕ ЗначениеЗаполнено(Объект.ОтветственныйЗаСопровождениеНСК) Тогда
					//ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный За сопровождение НСК» не заполнен",,"Объект.ОтветственныйЗаСопровождениеНСК",,Отказ); 
					И НЕ ЗначениеЗаполнено(Соответствие.Получить("ОтветственныйЗаСопровождениеНСК")) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный За сопровождение НСК» не заполнен",,,,Отказ);
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
			КонецЕсли;	
		КонецЦикла;
		Для Каждого СтрокаСостояния Из Объект.Состояния Цикл
			Если СтрокаСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.УказатьОтветственногоЗаСопровождениеИУчетНСК")
				И СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
					//И НЕ ЗначениеЗаполнено(Объект.ОтветственныйЗаУчетНСК) Тогда
					//ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за учет НСК» не заполнен",,"Объект.ОтветственныйЗаУчетНСК",,Отказ); 
					И НЕ ЗначениеЗаполнено(Соответствие.Получить("ОтветственныйЗаУчетНСК")) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за учет НСК» не заполнен",,,,Отказ);
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
			КонецЕсли;	
		КонецЦикла;
		Для Каждого СтрокаСостояния Из Объект.Состояния Цикл
			Если СтрокаСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.УказатьОтветственногоЗаСопровождение")
				И СтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") 
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
					//И НЕ ЗначениеЗаполнено(Объект.ОтветственныйЗаСопровождение) Тогда
					//ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за сопровождение» не заполнен",,"Объект.ОтветственныйЗаСопровождение",,Отказ); 
					И НЕ ЗначениеЗаполнено(Соответствие.Получить("ОтветственныйЗаСопровождение")) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("Реквизит «Ответственный за сопровождение» не заполнен",,,,Отказ);
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	//ДИТ Шевченко А.В. 56947 06.09.2022 -конец
КонецПроцедуры	

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Владелец);
		ПараметрыЗапроса.Вставить("Договор", Объект.Ссылка);
		
		ПараметрыЗапроса.Вставить("КатегорияДоговора", Объект.КатегорияДоговора);
		ПараметрыЗапроса.Вставить("ТипДоговорнойЗаписи", Объект.ТипДоговорнойЗаписи);
		ПараметрыЗапроса.Вставить("Нетиповой", Не Объект.Типовой);
		ПараметрыЗапроса.Вставить("РегионДоговора", Объект.РегионДоговора);
		ПараметрыЗапроса.Вставить("ВидДоговора", Объект.ВидДоговора);
		ПараметрыЗапроса.Вставить("Валюта", Объект.ВалютаВзаиморасчетов);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("Нерезидент", КонтрагентНерезидент(Объект.Владелец));
		//Евросиб Максимова Ticket#0203438
		
		//ПараметрыЗапроса.Вставить("УсловиеОплаты",Объект.УсловиеОплаты);
		//ПараметрыЗапроса.Вставить("Подписан", ПодписанДоговор(Объект.Ссылка));
		//Евросиб Максимова
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьДоговор(ПараметрыЗапроса, Объект.Дата);
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
				
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	//ДИТ, Беляев СЮ, Ticket#0287047, 26-10-2022, закомментировал, перенёс в МаршрутизацияСервер.ПостобработкаТЧСостояний()
	////ДИТ Авдеева В.С. 47090 11.04.2022 Начало
	//МаршрутизацияСервер.УстановитьВыполнениеЗафиксировано(ЭтотОбъектЪ); 
	//МаршрутизацияСервер.ПостобработкаВыполненныхЗадач(ЭтотОбъектЪ);
	////ДИТ Авдеева В.С. 47090 11.04.2022 Конец
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПодписанДоговор(Договор)
	Возврат Договор.Подписан;
КонецФункции
// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ


&НаСервереБезКонтекста
Функция КонтрагентНерезидент(Контрагент)
	Возврат (Контрагент.СтранаРегистрации <> Справочники.СтраныМира.Россия);
КонецФункции

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВБФ(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Отказ = Ложь;
		Ответ = Вопрос("Перед отправкой запроса в Бит.Финанс договор необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		ИначеЕсли Записать() = Ложь Тогда
			Отказ = Истина;
		КонецЕсли;
		Если Отказ = Истина Тогда
			Сообщить("Договор не записан, данные в Бит.Финанс переданы не будут!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Сообщение = СоздатьВБФНаСервере();
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
//Евросиб Гудкова( 12.11.2019 Ticket№0179778
	МакетыКлиента = Новый Массив;
	МакетыКлиента.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорТЭО"));
	МакетыКлиента.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава"));
	МакетыПодрядчика = Новый Массив;
	МакетыПодрядчика.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава"));
	МакетыПодрядчика.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорПредоставленияКонтейнеров"));
	МакетыПодрядчика.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорАвтомобильнойПеревозки"));
// Евросиб Гудкова) 	
	УстановитьВидимость();
	
	Элементы.ГруппаЛичныеЦели.Заголовок = "Личные цели ("+Объект.ЛичныеЦели.Количество()+")";
	//Евросиб - АСуслов 03.10.2020 11:41:12 #факторинг
	//(
	ЗаполнитьПараметрыФакторинга();
	//)
	//Евросиб - АСуслов 03.10.2020 11:41:14 #факторинг
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
	Если Не (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")) Тогда
		Объект.УчаствуетВРассылкеПДЗ = Ложь;
	КонецЕсли;
	// ДИТ 56017 Давудов М.А. Конец: 13.07.2023
	
	//Евросиб Каблов 13.02.2025 ( #100589
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		Объект.СНПКонтейнеровШтраф = Ложь;
	КонецЕсли;
	//Евросиб Каблов 13.02.2025 )
	
	//Евросиб Гудкова( 01.11.2019
	УстановитьВидимость();
//было	
	//Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")
	//	или Объект.ВидДоговора =  ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку")
	//	или Объект.ВидДоговора =  ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером")
	//	Тогда
	// Объект.МакетПечатнойФормыДоговора = ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорТЭО");
	// КонецЕсли;
// Евросиб Гудкова) 	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеДоговора(Команда)
	Если ЭтаФорма.Модифицированность Тогда Записать(); КонецЕсли;
	ПараметрыФормы = Новый Структура("Договор",Объект.Ссылка);
	ОткрытьФорму("Обработка.СогласованиеДоговоров.Форма.Форма", ПараметрыФормы);
	УстановитьСогласование();
КонецПроцедуры

&НаСервере
Процедура УстановитьСогласование()
	//++ Зубов 35844 04.08.2021
////Стаценко Параллельное согласование
//	Для каждого СтрТЧ из Объект.Состояния Цикл
//		Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
//			СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
//            ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
//			Попытка
//				МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
//			Исключение
//				Сообщить("Некорректная строка предыдущих этапов");
//			КонецПопытки;
//			ВозможноВыполнение = Истина;
//			Если МассивЭтапов.Количество() > 0 Тогда
//				Для каждого Эл из МассивЭтапов Цикл
//					Попытка
//						НомСтр = Число(Эл);
//						СтрЭтапа = Объект.Состояния.Найти(НомСтр,"НомерСтроки");
//						Если СтрЭтапа <> Неопределено Тогда
//							Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
//								ВозможноВыполнение = Ложь;
//							КонецЕсли;
//						КонецЕсли;
//					Исключение
//						Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
//					КонецПопытки
//				КонецЦикла;
//			КонецЕсли;
//			Если ВозможноВыполнение Тогда
//				СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	//Стаценко
МаршрутизацияСервер.ПараллельноеСогласование(Объект.Состояния);
	//-- Зубов 35844 04.08.2021
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	
	УстановитьВидимость();
	Если Объект.ВалютаВзаиморасчетов = ПредопределенноеЗначение("Справочник.Валюты.Рубль") Или Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		Объект.РасчетыВУсловныхЕдиницах = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

//Евросиб Гудкова( 01.11.2019
//было
	//Если Объект.ВалютаВзаиморасчетов = ПредопределенноеЗначение("Справочник.Валюты.Рубль") Или Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
	//	ЭтаФорма.Элементы.РасчетыВУсловныхЕдиницах.Видимость = Ложь;
	//Иначе
	//	ЭтаФорма.Элементы.РасчетыВУсловныхЕдиницах.Видимость = Истина;
	//КонецЕсли; 
	Элементы.БФРасчетыВУсловныхЕдиницах.Видимость = Не (Объект.ВалютаВзаиморасчетов = ПредопределенноеЗначение("Справочник.Валюты.Рубль"));
	Если  ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для каждого Элемент Из Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ПолеФормы") И СтрНачинаетсяС(Элемент.Имя, "БФ") Тогда
				Элемент.ТолькоПросмотр = Истина;
			КонецЕсли; 
//			Элемент.РедактированиеТекста = Не СтрНачинаетсяС(Элемент.Имя, "БФ");
		КонецЦикла; 
	КонецЕсли; 
	Элементы.ГруппаНерезидент.Видимость = КонтрагентНерезидент(Объект.Владелец);
	ДоговорСпокупателем = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	Элементы.ГруппаКлиента.Видимость = ДоговорСпокупателем;
	Если ДоговорСпокупателем Тогда
		Элементы.МакетПечатнойФормыДоговора.СписокВыбора.ЗагрузитьЗначения(МакетыКлиента);
	Иначе	
		Элементы.МакетПечатнойФормыДоговора.СписокВыбора.ЗагрузитьЗначения(МакетыПодрядчика);
	КонецЕсли; 	
	Элементы.МакетПечатнойФормыДоговора.Видимость = Объект.Типовой;
	Элементы.ГруппаНДС0.Видимость = Объект.РазрешеноПрименениеНДС0;
// Евросиб Гудкова)

	//Евросиб Каблов 13.02.2025 ( #100589
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		Элементы.СНПКонтейнеровШтраф.Видимость = Истина;
	Иначе
		Элементы.СНПКонтейнеровШтраф.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Каблов 13.02.2025 )
	
	// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
	Элементы.УчаствуетВРассылкеПДЗ.Видимость = ДоговорСпокупателем;
	// ДИТ 56017 Давудов М.А. Конец: 13.07.2023
	//Евросиб - АСуслов 03.01.2024 14:27:44 #78327
	//(
	Элементы.МультивалютныйДоговор.Доступность = НЕ Объект.РасчетыВУсловныхЕдиницах;
	Элементы.ГруппаВалютыОплаты.Видимость = Объект.МультивалютныйДоговор;
	//)
	//Евросиб - АСуслов 03.01.2024 14:27:45 #78327
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗапуститьДоговорНаСогласование" И Объект.Ссылка = Параметр Тогда
		
		ВсеСоглСтатусы = ВсеСогласовательныеСтатусы();
		Для каждого Стр из Объект.Состояния Цикл
			
			Если ВсеСоглСтатусы.Найти(Стр.Состояние) <> неопределено Тогда
				Стр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ВсеСогласовательныеСтатусы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Состояния.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Состояния КАК Состояния
	               |ГДЕ
	               |	Состояния.Согласование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

//Евросиб Гудкова( 01.11.2019 
&НаКлиенте
Процедура ФормаДоговораПриИзменении(Элемент)
	
	Элементы.МакетПечатнойФормыДоговора.Видимость = Объект.Типовой;
	Элементы.МакетПечатнойФормыДоговора.АвтоОтметкаНезаполненного = Объект.Типовой;
	Объект.МакетПечатнойФормыДоговора = ?(Не Объект.Типовой, Неопределено, Объект.МакетПечатнойФормыДоговора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//ДИТ Шевченко А.В. 56947 06.09.2022 -начало
	ПроверитьЗаполнениеОтветственных(Отказ);
	//ДИТ Шевченко А.В. 56947 06.09.2022 -конец
	Если Объект.Типовой и Не ЗначениеЗаполнено(Объект.МакетПечатнойФормыДоговора) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для типовой формы договора нужно выбрать макет",, "Объект.МакетПечатнойФормыДоговора",, Отказ); 
	КонецЕсли;
	
	Для Сч = 1 По Объект.БанковскиеРеквизитыДляОплаты.Количество()-1 Цикл
		Если Объект.БанковскиеРеквизитыДляОплаты[Сч].ДействуетС < Объект.БанковскиеРеквизитыДляОплаты[Сч-1].ДействуетПо Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Пересекаются периоды строк " + (Сч) + " и " + (Сч+1) + ". Необходимо исправить, запись запрещена.",, "Объект.БанковскиеРеквизитыДляОплаты",, Отказ); 
		КонецЕсли;
	КонецЦикла;

	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Владелец);
		
		ПараметрыЗапроса.Вставить("КатегорияДоговора", Объект.КатегорияДоговора);
		ПараметрыЗапроса.Вставить("ТипДоговорнойЗаписи", Объект.ТипДоговорнойЗаписи);
		ПараметрыЗапроса.Вставить("Нетиповой", Не Объект.Типовой);
		ПараметрыЗапроса.Вставить("РегионДоговора", Объект.РегионДоговора);
		ПараметрыЗапроса.Вставить("ВидДоговора", Объект.ВидДоговора);
		ПараметрыЗапроса.Вставить("Валюта", Объект.ВалютаВзаиморасчетов);
		ПараметрыЗапроса.Вставить("Нерезидент", КонтрагентНерезидент(Объект.Владелец));
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьДоговор(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация =  
	(НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Объект.Состояния.Количество() = 0 ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.ТипДоговорнойЗаписи <> Объект.ТипДоговорнойЗаписи ИЛИ 
	Объект.Ссылка.Типовой <> Объект.Типовой ИЛИ 
	Объект.Ссылка.РегионДоговора <> Объект.РегионДоговора ИЛИ 
	Объект.Ссылка.КатегорияДоговора <> Объект.КатегорияДоговора ИЛИ 
	Объект.Ссылка.ВидДоговора <> Объект.ВидДоговора ИЛИ 
	Объект.Ссылка.ВалютаВзаиморасчетов <> Объект.ВалютаВзаиморасчетов);
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура МакетПечатнойФормыДоговораПриИзменении(Элемент)
	
	Объект.ДоговорТранспортнойЭкспедиции = Объект.МакетПечатнойФормыДоговора = ПредопределенноеЗначение("Перечисление.ВидыМакетовДоговоров.ДоговорТЭО");

КонецПроцедуры

&НаКлиенте
Процедура РазрешеноПрименениеНДС0ПриИзменении(Элемент)
	
//Евросиб Гудкова( 03.02.2020 Ticket№ 0185265
	Если Объект.РазрешеноПрименениеНДС0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОтветЗаполнитьЗначенияПараметровНДС0ПоУмолчанию", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Заполнить параметры применения ставки НДС по-умолчанию?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
// Евросиб Гудкова) 	
	Элементы.ГруппаНДС0.Видимость = Объект.РазрешеноПрименениеНДС0;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущиеПараметрыНДС0()

	ТекущиеЗначенияНДС0 = Новый ФорматированнаяСтрока("Не заданы", Новый Шрифт(,,,Истина), WebЦвета.Красный);	
	Выборка = КонтрольДоступностиДокументов_сервер.ПолучитьТекущиеПараметрыНДС0(Объект.Ссылка, КонецДня(ТекущаяДата()));
	Если Выборка.Следующий() Тогда
	
		ТекущиеЗначенияНДС0 = Новый ФорматированнаяСтрока("Действуют с: " + Формат(Выборка.ДатаНачалаДействия, "ДЛФ=Д") + ?(ЗначениеЗаполнено(Выборка.ДатаОкончанияДействия), " по: " + Формат(Выборка.ДатаОкончанияДействия, "ДЛФ=Д"), "") +
								?(Выборка.ДокументыНеПредоставляются, "; документы не предоставляются", "; срок предоставления документов: " + Выборка.СрокПредоставленияДокументов + " дней; Штраф за непредоставление: " + Выборка.ШтрафныеСанкции + "%") +
								?(ЗначениеЗаполнено(Выборка.ПунктДоговора), " согласно п. договора: " + Выборка.ПунктДоговора, "") +
								?(ЗначениеЗаполнено(Выборка.Комментарий), "; Комментарий: " + Выборка.Комментарий, ""));
	КонецЕсли; 

КонецПроцедуры

//Евросиб Каблов 03.06.2021 (
&НаСервере
Процедура ОбновитьТекущиеПараметрыФакторинга()
	
	Если Объект.ИспользуетсяФакторинг Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияФакторинга.ДоговорКомпанииФактор КАК ДоговорКомпанииФактор,
		|	ИсторияФакторинга.НачалоФакторинга КАК НачалоФакторинга,
		|	ИсторияФакторинга.ОкончаниеФакторинга КАК ОкончаниеФакторинга,
		|	ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг КАК ДополнительнаяИнформацияФакторинг,
		|	ИсторияФакторинга.ДоговорКомпанииФактор.Представление КАК ДоговорКомпанииФакторПредставление
		|ИЗ
		|	РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
		|ГДЕ
		|	ИсторияФакторинга.Договор = &Договор
		|	И ИсторияФакторинга.НачалоФакторинга <= &ТекДата
		|	И (ИсторияФакторинга.ОкончаниеФакторинга >= &ТекДата
		|			ИЛИ ИсторияФакторинга.ОкончаниеФакторинга = &ПустаяДата)";
		
		Запрос.УстановитьПараметр("Договор", Объект.Ссылка);
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ОкончаниеПериодаДействия = ?(ЗначениеЗаполнено(Выборка.ОкончаниеФакторинга), " по " + Формат(Выборка.ОкончаниеФакторинга, "ДФ=dd.MM.yyyy"), "");
			ТекстФакторинг = СтрШаблон("Компания-фактор: %1; период действия с %2%3; информация для печати документов: %4", Выборка.ДоговорКомпанииФакторПредставление, Формат(Выборка.НачалоФакторинга, "ДФ=dd.MM.yyyy"), ОкончаниеПериодаДействия, Выборка.ДополнительнаяИнформацияФакторинг);
			
			ТекущиеЗначенияФакторинг = Новый ФорматированнаяСтрока(ТекстФакторинг);
			
		Иначе
									
			ТекущиеЗначенияФакторинг = Новый ФорматированнаяСтрока("Параметры не заданы", Новый Шрифт(,,,Истина), WebЦвета.Красный);
		
		КонецЕсли;
		
		Элементы.ТекущиеЗначенияФакторинг.Видимость = Истина;
		
	Иначе
		
		Элементы.ТекущиеЗначенияФакторинг.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры
//Евросиб Каблов 03.06.2021 ) 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьТекущиеПараметрыНДС0();
	
	//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021 Начало
	//ДИТ_ОбновитьРеквизитыФакторингаНаСервере()
	//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021 Конец
	
КонецПроцедуры

//Евросиб Гудкова( 03.02.2020 Ticket№ 0185265
&НаКлиенте
Процедура ОтветЗаполнитьЗначенияПараметровНДС0ПоУмолчанию(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.Записать();
		ЗаполнитьЗначенияПараметровНДС0ПоУмолчанию(Объект.Ссылка);
	КонецЕсли;		

КонецПроцедуры // ()
 
&НаСервере
Процедура ЗаполнитьЗначенияПараметровНДС0ПоУмолчанию(Ссылка)

	Выборка = КонтрольДоступностиДокументов_сервер.ПолучитьТекущиеПараметрыНДС0(Ссылка, КонецДня(ТекущаяДата()));
	Если Не Выборка.Следующий() Тогда
		ЗаписьРегистра = РегистрыСведений.ПараметрыПримененияСтавкиНДС0.СоздатьМенеджерЗаписи();
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("Период", Ссылка.Дата);
		ДанныеЗаполнения.Вставить("ДатаОкончанияДействия", ?(Ссылка.Автопролонгация, Дата(1,1,1), Ссылка.СрокДействия));		
		ДанныеЗаполнения.Вставить("ДоговорКонтрагента", Ссылка);
		ЗаписьРегистра.Заполнить(ДанныеЗаполнения);
		ЗаписьРегистра.Записать();
		ОбновитьТекущиеПараметрыНДС0();
	КонецЕсли;

КонецПроцедуры
 
// Евросиб Гудкова)

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	// если документ НЕ типовой, то запустить на согласование только в том случае, если есть прикрепленные файлы
	Если НЕ Объект.Типовой И НЕ ПроверкаНаПрикрепленные(Объект.Ссылка) Тогда
		Сообщить("Договор является нетиповым! Прикрепите файлы!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
	// если спарк запрос выполнен более 3 дней назад, то запросить заново
	Если НЕ ДосьеСПАРКПрикреплено(Объект.Владелец) И СПАРКЗапросыСервер.ЗапросБылВыполненМенее3ДнейНазад(Объект.Владелец) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СПАРК_СкачатьДосьеЗавершение", ЭтаФорма), "Предыдущий запрос досье СПАРК был выполнен менее трех дней назад. Загрузить актуальную версию досье контрагента?",
		РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		СПАРК_СкачатьДосьеЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДосьеСПАРКПрикреплено(Владелец)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Наименование КАК Наименование,
	               |	Файлы.ПутьКФайлу КАК ПутьКФайлу,
	               |	Файлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.ВладелецФайла = &ВладелецФайла
	               |	И НЕ Файлы.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВладелецФайла", Владелец);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() И СтрНайти(ВРЕГ(Ответ.Наименование), "ДОСЬЕ СПАРК") > 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СПАРК_СкачатьДосьеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СПАРК_СкачатьДосьеФрагмент();
		СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры);
	КонецЕсли;		
	

	// проверяем наличие процесса на данный документ. Если процесса нет, то создать комплект документов
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Договор",Объект.Ссылка);
		ПараметрыФормы.Вставить("ПроцессСогласования",Истина);
		ПараметрыФормы.Вставить("ЦиклСогласования",1);
		ОпОп = Новый ОписаниеОповещения("ОбработкаСозданияДокументов", ЭтаФорма);
		ОткрытьФорму("Обработка.СогласованиеДоговоров.Форма.Форма", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// 2. если не типовой, то создавать не нужно, открыть присоединенные
	//ИначеЕсли ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") И НЕ Объект.Типовой Тогда
	//	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	//	ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	//	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// 3. если процесс согласования ранее создан, открыть его
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
		ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СПАРК_ОбновитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;		
	
	СПАРК_ОбновитьПоказателиФрагмент();

КонецПроцедуры

&НаСервере
Процедура СПАРК_ОбновитьПоказателиФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО, ПоследнееОбновлениеСПАРК");
	СтруктураРеквизитов.Контрагент = Объект.Владелец;
	СтруктураРеквизитов.ИНН = Объект.Владелец.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Владелец.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_ОбновитьПоказателиНаСервере(СтруктураРеквизитов, Отказ);
КонецПроцедуры

&НаСервере
Процедура СПАРК_СкачатьДосьеФрагмент()
	
	СтруктураРеквизитов = Новый Структура("Контрагент, ИНН, ОГРН, КодПоОКПО");
	СтруктураРеквизитов.Контрагент = Объект.Владелец;
	СтруктураРеквизитов.ИНН = Объект.Владелец.ИНН;
	СтруктураРеквизитов.ОГРН = Объект.Владелец.ОГРН;
	Отказ = Ложь;
	СПАРКЗапросыСервер.СПАРК_СкачатьДосьеНаСервере(СтруктураРеквизитов, Отказ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаНаПрикрепленные(ТекДок)
	
	ЕстьПрикрепленные = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла",ТекДок);
	Если Запрос.Выполнить().Пустой() Тогда
		ЕстьПрикрепленные = Ложь;
	КонецЕсли;
	
	Возврат ЕстьПрикрепленные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСозданияДокументов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	// если форму просто закрыли, то не нужно начинать процесс согласования
	Если НЕ Параметр1 = "ФайлыСозданы" Тогда
		Возврат;
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ПолучитьДанныеИзБазы();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБазы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентовСостояния.Ссылка КАК Ссылка,
	               |	ДоговорыКонтрагентовСостояния.НомерСтроки КАК НомерСтроки,
	               |	ДоговорыКонтрагентовСостояния.Состояние КАК Состояние,
	               |	ДоговорыКонтрагентовСостояния.Исполнитель КАК Исполнитель,
	               |	ДоговорыКонтрагентовСостояния.Наблюдатель КАК Наблюдатель,
	               |	ДоговорыКонтрагентовСостояния.Статус КАК Статус,
	               |	ДоговорыКонтрагентовСостояния.НачалоРаботы КАК НачалоРаботы,
	               |	ДоговорыКонтрагентовСостояния.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	ДоговорыКонтрагентовСостояния.ПричинаОтказа КАК ПричинаОтказа,
	               |	ДоговорыКонтрагентовСостояния.СтатусСогласования КАК СтатусСогласования,
	               |	ДоговорыКонтрагентовСостояния.ПредыдущиеЭтапы КАК ПредыдущиеЭтапы,
	               |	ДоговорыКонтрагентовСостояния.НормативИсполненияСМоментаСоздания КАК НормативИсполненияСМоментаСоздания
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов.Состояния КАК ДоговорыКонтрагентовСостояния
	               |ГДЕ
	               |	ДоговорыКонтрагентовСостояния.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Объект.Состояния.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппуСостояний(Команда)
	
	Элементы.ГруппаСостояния.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ДопСвойстваОбъекта.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЛичныеЦелиОтметкаПриИзменении(Элемент)
	
	ТекД = Элементы.ЛичныеЦели.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекПользователь = ПользователиКлиент.ТекущийПользователь();
		МоиГруппы = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь);
		МоиГруппы.Добавить(ТекПользователь);
		
		ИмеюПравоМенять = (МоиГруппы.найти(ТекД.Исполнитель) <> неопределено);
		
		Если ИмеюПравоМенять Тогда
			ТекД.ДатаОтметки = ТекущаяДата();
			ТекД.Исполнитель = ТекПользователь;
		Иначе
			ТекД.Отметка = НЕ ТекД.Отметка;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПДЗПриИзменении(Элемент)
	
	//ДИТ Пак И.Т. Task34349 12.05.2021 Начало
	СтатусСтарый = ПрочитатьСтатусПДЗИзБазыДанных();
	Если СтатусСтарый <> Неопределено И СтатусСтарый = Объект.СтатусПДЗ Тогда
		Если ЗначениеЗаполнено(Объект.СтатусПДЗ) Тогда
			ПоказатьПредупреждение(, "Статус не изменился, поэтому Дата статуса и Ответственный ПДЗ остались прежними");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	//ДИТ Пак И.Т. Task34349 12.05.2021 Конец
	
	ДатаСтатусаПДЗ = ТекущаяДата();
	ОтветственныйПДЗ = ПользователиКлиент.ТекущийПользователь();
	//++ Зубов 0239361 13.08.2021
	Объект.КомментарийПДЗ = "";
	//-- Зубов 0239361 13.08.2021
КонецПроцедуры


&НаКлиенте
//ДИТ Пак И.Т. Task34349 12.05.2021
Функция ПрочитатьСтатусПДЗИзБазыДанных()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат ПрочитатьСтатусПДЗИзБазыДанныхНаСервере(Объект.Ссылка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
//ДИТ Пак И.Т. Task34349 12.05.2021
Функция ПрочитатьСтатусПДЗИзБазыДанныхНаСервере(Ссылка)
	Возврат Ссылка.СтатусПДЗ;
КонецФункции



//Евросиб - АСуслов 03.10.2020 11:41:12 #факторинг
//(
Процедура ЗаполнитьПараметрыФакторинга()
	
	//видимость
	ЭтоДоговорФакторинга = Объект.КатегорияДоговора = ПредопределенноеЗначение("Справочник.КатегорииДоговоров.Факторинг");
	Элементы.ГруппаФакторинг.Видимость = НЕ ЭтоДоговорФакторинга;
	Элементы.ДополнительнаяИнформацияФакторинг.Видимость = ЭтоДоговорФакторинга;
	
	//ДИТ Пак И.Т. Task34349 19.05.2021 Начало
	Элементы.ИспользуетсяФакторинг.ТолькоПросмотр = Не РольДоступна("ПолныеПрава")
		И Не РольДоступна("dc_НастройкаУсловийОплатыВДоговоре");
	//ДИТ Пак И.Т. Task34349 19.05.2021 Конец
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяФакторингПриИзменении(Элемент)
	
	//ДИТ Пак И.Т. Task34349 19.05.2021 Начало
	// ----- старый текст ------
	//
	//	Если НЕ Объект.ИспользуетсяФакторинг Тогда
	//		//нужно заполнить дату окончания
	//		ОпОп = Новый ОписаниеОповещения("ЗавершениеВводаДатыОкончанияФакторинга",ЭтаФорма);
	//		ПоказатьВводДаты(ОпОп, Объект.ДатаОкончанияФакторинга, "Введите дату окончания факторинга");
	//	КонецЕсли;
	//
	//	ЗаполнитьПараметрыФакторинга();
	//
	// ----- новый текст -------
	ОбновитьТекущиеПараметрыФакторинга();
	Если Объект.ИспользуетсяФакторинг Тогда
		//Евросиб Каблов 02.06.2021 ( Ticket#0230677
		//Если ЗначениеЗаполнено(Объект.Ссылка) И ДИТ_НаличиеИсторииФакторингаНаСервере(Объект.Ссылка) Тогда
		//	Удалить_ДИТ_ОбновитьРеквизитыФакторинга();
		//Иначе
		//	ДИТ_СоздатьНовуюЗаписьИсториииФакторинга("ИспользуетсяФакторинг");
		//КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Не ДИТ_НаличиеИсторииФакторингаНаСервере(Объект.Ссылка) Тогда
			ДИТ_СоздатьНовуюЗаписьИсториииФакторинга("ИспользуетсяФакторинг");
		КонецЕсли;
		//Евросиб Каблов 02.06.2021 )
	Иначе
		ЗаполнитьПараметрыФакторинга();
	КонецЕсли;
	//ДИТ Пак И.Т. Task34349 19.05.2021 Конец
	
	
КонецПроцедуры

Процедура ЗавершениеВводаДатыОкончанияФакторинга(ДатаОкончанияФакторинга, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияФакторинга) Тогда
		Объект.ИспользуетсяФакторинг = Истина;
	Иначе
		Объект.ДатаОкончанияФакторинга = ДатаОкончанияФакторинга;
	КонецЕсли; 
	ЗаполнитьПараметрыФакторинга();
КонецПроцедуры

//)
//Евросиб - АСуслов 03.10.2020 11:41:14 #факторинг

&НаКлиенте
Процедура БанковскиеРеквизитыДляОплатыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеРеквизитыДляОплатыРасчетныйСчетПриИзменении(Элемент)
	
	ОтразитьРедактораИДатуРедактированияРСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьРедактораИДатуРедактированияРСчетов()
	
	ТекД = Элементы.БанковскиеРеквизитыДляОплаты.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Редактор = ПользователиКлиент.ТекущийПользователь();
		ТекД.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеРеквизитыДляОплатыДействуетСПриИзменении(Элемент)
	
	ОтразитьРедактораИДатуРедактированияРСчетов();
	Для Сч = 1 По Объект.БанковскиеРеквизитыДляОплаты.Количество()-1 Цикл
		
		Если ЗначениеЗаполнено(Объект.БанковскиеРеквизитыДляОплаты[Сч].ДействуетС) И НЕ ЗначениеЗаполнено(Объект.БанковскиеРеквизитыДляОплаты[Сч-1].ДействуетПо) Тогда
			
			Объект.БанковскиеРеквизитыДляОплаты[Сч-1].ДействуетПо = Объект.БанковскиеРеквизитыДляОплаты[Сч].ДействуетС;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеРеквизитыДляОплатыДействуетПоПриИзменении(Элемент)
	
	ОтразитьРедактораИДатуРедактированияРСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеРеквизитыДляОплатыПримечаниеПриИзменении(Элемент)
	
	ОтразитьРедактораИДатуРедактированияРСчетов();
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_ОбеспечитьНаличиеСсылки(ОписаниеОповещенияДляПродолжения)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияДляПродолжения, Неопределено);
	Иначе
		ТочкаДалее = Новый ОписаниеОповещения("ДИТ_ОбеспечитьНаличиеСсылки_Далее", ЭтаФорма, ОписаниеОповещенияДляПродолжения);
		ПоказатьВопрос(ТочкаДалее, "Для продолжения действия договор должен быть записан. Записать?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_ОбеспечитьНаличиеСсылки_Далее(Ответ, ОписаниеОповещенияДляПродолжения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭтаФорма.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияДляПродолжения, Неопределено);
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_ОткрытьФормуИсториииФакторинга()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Для просмтора истории сначала запишите договор");
		Возврат;
	КонецЕсли;
	
	ТочкаЗавершения = Новый ОписаниеОповещения("ДИТ_ПриЗакрытииФормыИсториииФакторинга", ЭтаФорма);
	
	ПараметрыВызова = Новый Структура("Отбор", Новый Структура("Договор", Объект.Ссылка));
	ОткрытьФорму("РегистрСведений.ИсторияФакторинга.ФормаСписка", ПараметрыВызова, ЭтаФорма,,,, ТочкаЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_ПриЗакрытииФормыИсториииФакторинга(Результат, ДопПараметры) Экспорт
	
	//Евросиб Каблов 03.06.2021 (
	//ДИТ_ОбновитьРеквизитыФакторинга();
	ОбновитьТекущиеПараметрыФакторинга();
	//Евросиб Каблов 03.06.2021 ) 
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_СоздатьНовуюЗаписьИсториииФакторинга(ИзмененныйРеквизит = "")
	
	ТочкаПродолжения = Новый ОписаниеОповещения("ДИТ_СоздатьНовуюЗаписьИсториииФакторинга_Продолжение", ЭтаФорма, ИзмененныйРеквизит);
	
	ДИТ_ОбеспечитьНаличиеСсылки(ТочкаПродолжения);
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_СоздатьНовуюЗаписьИсториииФакторинга_Продолжение(Результат, ДопПараметры) Экспорт
	
	ТочкаЗавершения = Новый ОписаниеОповещения("ДИТ_ПриЗакрытииФормыИсториииФакторинга", ЭтаФорма);
	
	ТекДата = ТекущаяДата();
	ЗначенияЗаполнения = Новый Структура("Период, Договор, НачалоФакторинга", ТекДата, Объект.Ссылка, ТекДата);
	
	ПараметрыВызова = Новый Структура("ЗначенияЗаполнения, ФиксироватьДоговор", ЗначенияЗаполнения, Истина);
	
	ОткрытьФорму("РегистрСведений.ИсторияФакторинга.ФормаЗаписи", ПараметрыВызова, ЭтаФорма,,,, ТочкаЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаСервереБезКонтекста
Функция ДИТ_НаличиеИсторииФакторингаНаСервере(ДоговорСсылка)
	
	Если Не ЗначениеЗаполнено(ДоговорСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Наличие
	|ИЗ
	|	РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|ГДЕ
	|	ИсторияФакторинга.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", ДоговорСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();
	
КонецФункции

//ДИТ Пак И.Т. Task34493 (Ticket#0230677) 19.05.2021
&НаКлиенте
Процедура ДИТ_РедактироватьФакторинг(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ДИТ_НаличиеИсторииФакторингаНаСервере(Объект.Ссылка) Тогда
		ДИТ_ОткрытьФормуИсториииФакторинга();
	Иначе
		ДИТ_СоздатьНовуюЗаписьИсториииФакторинга();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Гудкова( 13.08.2021 Ticket№ 0206501
&НаКлиенте
Процедура БФСсылкаDVНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаDV);

КонецПроцедуры 
// Евросиб Гудкова)  

// Евросиб(ДИТ) US 85722 ТА 86908 Сержантова А.С. Начало: 08.07.2024
&НаКлиенте
Процедура СсылкаДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаДО);

КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьШаблонНомерДоговора(Команда)
	ДобавитьТекстШаблона("%НомерДоговора%");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонДатаДоговора(Команда)
	ДобавитьТекстШаблона("%ДатаДоговора%");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекстШаблона(Параметр)
	Перем НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки;
	Элементы.ДополнительнаяИнформацияФакторинг.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	ДлинаСтрокиДополнительнаяИнформацияФакторинг = СтрДлина(Объект.ДополнительнаяИнформацияФакторинг);
	Объект.ДополнительнаяИнформацияФакторинг = Лев(Объект.ДополнительнаяИнформацияФакторинг, НачалоКолонки - 1) + Параметр + Прав(Объект.ДополнительнаяИнформацияФакторинг, ДлинаСтрокиДополнительнаяИнформацияФакторинг - КонецКолонки + 1);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьИсполнителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(, "Сначала необходимо сохранить Платежку");
		Возврат;
	КонецЕсли;
	
	ИсходныйПользователь = неопределено;
	Для каждого Стр из Объект.Состояния Цикл
		ИсходныйПользователь = Стр.Исполнитель;
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораЗаменыСогласующего", ЭтаФорма);
	
	ОткрытьФорму("Документ.ПСЦ.Форма.ФормаЗаменыИсполнителяВПротоколе", Новый Структура("ИсходныйПользователь", ИсходныйПользователь),,ЭтаФорма.УникальныйИдентификатор, ,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗаменыСогласующего(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	ИсхП = П1.ИсходныйПользователь;
	КонП = П1.КонечныйПользователь;
	
	ЗаменятьИсполнителя = П1.ЗаменятьИсполнителя;
	ЗаменятьНаблюдателя = П1.ЗаменятьНаблюдателя;
	
	ЗаменяемыеСтатусы = П1.ЗаменяемыеСтатусы;
	
	Для каждого Стр из Объект.Состояния Цикл
		
		Если ЗаменяемыеСтатусы.Найти(Стр.Статус) <> неопределено Тогда
			Если Стр.Исполнитель = ИсхП И ЗаменятьИсполнителя Тогда Стр.Исполнитель = КонП; КонецЕсли;
			Если Стр.Наблюдатель = ИсхП И ЗаменятьНаблюдателя Тогда Стр.Наблюдатель = КонП; КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//Евросиб Коханенко Н.А. #61705 08.12.2022 )
//Евросиб - АСуслов 03.01.2024 14:34:15 #78327
//(
&НаКлиенте
Процедура ВалютыОплатыВалютаПоУмолчаниюПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДоговорыОплаты.ТекущаяСтрока;
	Для каждого СтрокаДоговорОплаты Из Объект.ДоговорыОплаты Цикл
		Если СтрокаДоговорОплаты <> Объект.ДоговорыОплаты.НайтиПоИдентификатору(ТекущаяСтрока) Тогда
			СтрокаДоговорОплаты.ВалютаПоУмолчанию = Ложь;
		Иначе
			СтрокаДоговорОплаты.ВалютаПоУмолчанию = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДоговорыОплатыНаСервере()
	
	Объект.ДоговорыОплаты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.Ссылка = &Ссылка
	|	И ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Код = &Код
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов <> &Валюта
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Контрагент", Объект.Владелец);
	Запрос.УстановитьПараметр("Код", Объект.Код);
	Запрос.УстановитьПараметр("ВидДоговора", Объект.ВидДоговора);
	Запрос.УстановитьПараметр("Валюта", Объект.ВалютаВзаиморасчетов);
	
	нДоговорОплаты = Объект.ДоговорыОплаты.Добавить();
	нДоговорОплаты.Договор = Объект.Ссылка;
	нДоговорОплаты.ВалютаПоУмолчанию = Истина;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Для каждого ДоговорОплаты Из РезультатЗапроса.Выгрузить() Цикл
		Объект.ДоговорыОплаты.Добавить().Договор = ДоговорОплаты.Договор;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДоговорыОплаты(Команда)
	ПерезаполнитьДоговорыОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МультивалютныйДоговорПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВалютыОплатыДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВалютаВзаиморасчетовНеРавно", Объект.ВалютаВзаиморасчетов);
	СтруктураОтбора.Вставить("КодРавно", Объект.Код);
	СтруктураОтбора.Вставить("ВидДоговораРавно", Объект.ВидДоговора);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	ПараметрыОтбора = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.ДоговорыОплаты.ТекущиеДанные;
	Если Объект.ДоговорыОплаты.Количество() = 1 Тогда
		ТекДанные.ВалютаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыОплатыПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ДоговорыОплаты.ТекущиеДанные;
	Если ТекДанные.ВалютаПоУмолчанию 
		И Объект.ДоговорыОплаты.Количество() > 1 Тогда
		Если ТекДанные.НомерСтроки = 1 Тогда
			Объект.ДоговорыОплаты[1].ВалютаПоУмолчанию = Истина;
		Иначе
			Объект.ДоговорыОплаты[0].ВалютаПоУмолчанию = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//)
//Евросиб - АСуслов 03.01.2024 14:34:18 #78327

//Евросиб Шевченко А.В. 17.06.2025 US 104900 TA 112049
&НаСервере
Процедура УстановитьОграниченияПричинаОтказаОтЭДО()
	
	Перем мПараметрыВыбора, Параметр, мДоступныеСтатусы;
	
	мПараметрыВыбора = Новый Массив();
	
	Если ЭтаФорма.Объект.ЕС_КонтрагентЭДО Тогда
		
		мДоступныеСтатусы = Новый Массив();
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ЗаблокировалиНасВЭДО);
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ОтказВСоответствииСПолитикойКомпанииКА);
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ОтказЗакрытиеДоговора);
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ОтказРаботаВДругойСистемеЧерезЛКНаправляютИзОРК);
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ОтказНеВнедреноСоответствующееПрограммноеОбеспечениеУКА);
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ОтказЧастичноРаботаютПоставщикИлиКлиент);
		
		Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(мДоступныеСтатусы)
			);
			
		мПараметрыВыбора.Добавить(Параметр); 
	Иначе
		
		мДоступныеСтатусы = Новый Массив();
		мДоступныеСтатусы.Добавить(Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК);		
		Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(мДоступныеСтатусы)
			);
			
		мПараметрыВыбора.Добавить(Параметр); 
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПричинаОтказаОтЭДО.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕвросибКонтрагент_ЭДОПриИзменении(Элемент)
	УстановитьОграниченияПричинаОтказаОтЭДО();
КонецПроцедуры
//Евросиб Шевченко А.В. 17.06.2025 US 104900 TA 112049

//Евросиб СубботинВ #117990 15.01.2026 Начало 
&НаКлиенте
Процедура ОтветственныйОбработкаВыбораТипа(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Ответственные.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			ТекДанные.Ответственный = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ПустаяСсылка");
		Иначе
			ТекДанные.Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Ответственные.ТекущиеДанные;
	Если ТекДанные.ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение") Тогда 
		
		Если ТекДанные.Ответственный = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			
			ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();		
			СписокТипов = Новый СписокЗначений;
			СписокТипов.Добавить(Тип("СправочникСсылка.ГруппыПользователей"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Пользователи"));		
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОтветственныйОбработкаВыбораТипа", ЭтаФорма, ДопПараметры);		
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			Возврат;
		КонецЕсли;
		СтандартнаяОбработка = Ложь;

		Если ТипЗнч(ТекДанные.Ответственный) = Тип("СправочникСсылка.ГруппыПользователей") Тогда 
			//СтруктураОтбора = Новый Структура();
			//СтруктураОтбора.Вставить("Иерархия", ПредопределенноеЗначение("Справочник.ГруппыПользователей.ГруппыОтветственныхЗаСопровождение")); 
			ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", Новый Структура("ЭлементыВИерархии, РежимВыбора", ПредопределенноеЗначение("Справочник.ГруппыПользователей.ГруппыОтветственныхЗаСопровождение"), Истина),Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		ИначеЕсли ТипЗнч(ТекДанные.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда 
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", Новый Структура("РежимВыбора", Истина) ,Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли; 
		
	Иначе  
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", Новый Структура("РежимВыбора", Истина) ,Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеОтветственныйОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.Ответственные.ТекущиеДанные;
	ТекДанные.Ответственный = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеОтветственныйСоздание(Элемент, СтандартнаяОбработка)
	
   ОткрытьФормуВводаГруппы(Элемент, СтандартнаяОбработка)

КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуВводаГруппы(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗадатьОтборПоГруппеОтветственных", Истина);
	
	ОткрытьФорму("Справочник.ГруппыПользователей.Форма.ФормаЭлемента", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Евросиб СубботинВ #117990 15.01.2026 Конец

