
&НаКлиенте
Процедура ЛокацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	СтруктураОтбора = Новый Структура("ТипЛокации", ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	ПараметрыОткрытияФормы = Новый Структура("Отбор", СтруктураОтбора);
	Оповещение = Новый ОписаниеОповещения("ОкончаниеВыбораЛокации", ЭтаФорма, Новый Структура);
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыОткрытияФормы, ЭтаФорма,,,,Оповещение);
КонецПроцедуры                                                                                            

&НаКлиенте
Процедура ОкончаниеВыбораЛокации(Результат, Параметры) Экспорт
	НаселенныйПунктСсылка = Результат;
	НаименованиеЛокации = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НаселенныйПунктСсылка, "Наименование");
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(НаселенныйПунктСсылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена локация");
		Возврат;
	КонецЕсли;                                                                                            
	ГеокодированиеКлиент.НачалоВыбораАдреса(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, "", НаименованиеЛокации, ЛокацияВышестоящегоУровня);
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	АдресВНаселенномПунктеСсылка = ОкНаСервере();
	Закрыть(АдресВНаселенномПунктеСсылка);
КонецПроцедуры

&НаСервере
Функция ОкНаСервере()
	Если АдресВНаселенномПункте.Пустая() Тогда
		АдресВНаселенномПунктеСсылка = Справочники.АдресаВНаселенныхПунктах.НайтиСоздатьАдресВНаселенномПункте(Адрес, НаселенныйПунктСсылка, КомпонентыАдреса);
	КонецЕсли;
	Возврат АдресВНаселенномПунктеСсылка;
КонецФункции


&НаКлиенте
Процедура ЛокацияПриИзменении(Элемент)
	НаименованиеЛокации = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НаселенныйПунктСсылка, "Наименование");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаОк.Доступность = РольДоступна("ПолныеПрава");
	//1 ищем адрес в справочнике
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК СсылкаАдрес,
	|	АдресаВНаселенныхПунктах.Владелец КАК НаселенныйПункт
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
	|ГДЕ
	|	АдресаВНаселенныхПунктах.Адрес = &Адрес
	|	И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес", Параметры.АдресВЛокации);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		АдресВНаселенномПунктеСсылка = ОкНаСервере();
		АдресВНаселенномПункте = АдресВНаселенномПунктеСсылка; 
	КонецЕсли;
	НаселенныйПунктСсылка = Параметры.Локация;
	СтруктураЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НаселенныйПунктСсылка, "Наименование, ЛокацияВышестоящегоУровня");
	НаименованиеЛокации = СтруктураЛокации.Наименование;
	ЛокацияВышестоящегоУровня = СтруктураЛокации.ЛокацияВышестоящегоУровня;
	Адрес = Параметры.АдресВЛокации;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГеокодированиеКлиент.НачалоВыбораАдреса(ЭтаФорма, Элементы.Адрес, Неопределено, Ложь, Неопределено, НаименованиеЛокации, ЛокацияВышестоящегоУровня);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Адрес = ВыбранноеЗначение.Представление;
		НаселенныйПунктСсылка = ВыбранноеЗначение.НаселенныйПунктСсылка;
		ИдентификаторЗапроса = ВыбранноеЗначение.ИдентификаторЗапроса;
		Для каждого КомпонентАдреса Из ВыбранноеЗначение.КомпонентыАдреса Цикл
			ЗаполнитьЗначенияСвойств(КомпонентыАдреса.Добавить(), КомпонентАдреса);
		КонецЦикла;
		АдресВНаселенномПунктеСсылка = ОкНаСервере();
		АдресВНаселенномПункте = АдресВНаселенномПунктеСсылка;
		ЗаписатьЛогГеокодераНаСервере();
	КонецЕсли;
	Закрыть(АдресВНаселенномПунктеСсылка);
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОповеститьОВыборе(АдресВНаселенномПункте);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогГеокодераНаСервере()
	мз = РегистрыСведений.ИсторияЗапросовКГеокодеру.СоздатьМенеджерЗаписи();
	мз.ИдентификаторЗапроса = ИдентификаторЗапроса;
	мз.Прочитать();
	Если мз.Выбран() Тогда
		мз.РезультатОбработкиЗапроса = АдресВНаселенномПункте;
		мз.Записать();
	КонецЕсли;
КонецПроцедуры
