
&НаСервере
Процедура ПлательщикПриИзмененииНаСервере(Плательщик)
	
	Для каждого Строка Из Объект.Плательщики Цикл
		ЗаполнитьЗначенияСвойств(Строка,Плательщик);
		Строка.Плательщик = Плательщик;		
	КонецЦикла;
	
		
	КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	ПлательщикПриИзмененииНаСервере(Объект.Плательщик);
КонецПроцедуры
&НаКлиенте
Процедура СоздатьЗаявку(Команда)  	
	
	Если Модифицированность и ЗначениеЗаполнено(Объект.Плательщик) Тогда
		ПлательщикПриИзмененииНаСервере(Объект.Плательщик);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ИДЗаявки) Тогда
		Возврат;
	КонецЕсли;
	
		
	ЗаполнитьКодыПоСсылкам();
	
	
	
	СоздатьЗаявкуВДокументе();
//Временно, пока регист работает с ошибкой
	//ЗадатьВопрос(Команда);
	
КонецПроцедуры


&НаСервере
&НаСервере
Процедура СоздатьЗаявкуВДокументе() 
	
	ДокОбъект = ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.э_ЗаявкаНаПеревозку"));
	
	КодЗапроса = Сред(ТекущаяДата(),4,2) + Лев(ТекущаяДата(),2)+ Час(ТекущаяДата()) + Минута(ТекущаяДата());

	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	СоответствиеТаблиц = э_ОбщиеСервер.ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	Перевод = э_ОбщиеСервер.ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек,1);
	ТекстЗапроса = э_ОбщиеСервер.ЗаполнитьXMLИзОбъекта(ДокОбъект,СоответствиеТаблиц,Перевод,МакетНастроек);
	ТекстЗапроса =
	//<!-- ********************************** -->
	//<!-- ПОДАЧА ЗАЯВКИ НА ПЕРЕВОЗКУ: запрос -->
	//<!-- ********************************** -->
	"<claimAgreement version=""1.0"">" +
	
	//Если не ЗначениеЗаполнено(ДокОбъект.ИДЗаявки) Тогда
	//	
	//	ТекстЗапроса = ТекстЗапроса + "<frontEndId value=" + КодЗапроса +"/>";
	//	
	//КонецЕсли;

	ТекстЗапроса 
	////<!-- Формировать заявку только до отправок включительно - не использовать данные блоков маршрутов, графиков подач и плательщиков -->
	//+ "<notFullClaim/>"
	//<!-- Использование 6-значных кодов станций и грузов в ответе -->
	+ "<useMod11/>"
	//<!-- Расчет графика подач(если не указан график подач и способ подачи не по датам) -->
	+ "<useCalcGraphPod/>"
	//<!-- Выдавать данные подписи ЭЦП -->
	+ "<useECP/>"
	//<!-- Не переводить состояние заявки в согласовано -->
	+ "<notState/>"
	//<!-- Не возвращать данные о накладных по заявке. -->
	+ "<notGetInv/>"
	//<!-- Выдавать список некритических ошибок-->
	//<!-- * тип данных: строка -->
	+ "<useWarning/>"
	+ "</claimAgreement>";
	
	
	РезультатЗапроса = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);
	
			ПозицияИД = Найти(РезультатЗапроса,"claimID value");
			ПозицияОшибки = Найти(РезультатЗапроса,"errorMessage value=");   
			
			Если ПозицияИД > 0 или ПозицияОшибки > 0 Тогда
				
				Если ПозицияИД > 0  Тогда  
					ИДНакладной = Сред(РезультатЗапроса,ПозицияИД+14,9);
					ДокОбъект.ИДЗаявки = ИДНакладной; 
					
					э_ОбщиеСервер.ЗаполнитьДокументЗаявкаНаПеревозкуПриВыгрузке(РезультатЗапроса	,Ложь,"",ТекущаяДата(),ТекущаяДата(),ТекущаяДата(),ДокОбъект);
					
					
				ИначеЕсли ПозицияОшибки > 0  Тогда 				
					КонецОшибки  = Найти(РезультатЗапроса,"errorStatusCode value=");
					
					Если КонецОшибки > 0  Тогда 
						ДокОбъект.Ошибки = Сред(РезультатЗапроса,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
					КонецЕсли; 			
					
				КонецЕсли;
				
			КонецЕсли;
			
		ЗначениеВДанныеФормы(ДокОбъект,Объект);	
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаявкуНаСервере()
	
	 
	
	СтруктураДокумента = Новый Структура;
	
	Для каждого Реквизит Из Объект.Ссылка.Метаданные().Реквизиты Цикл
		СтруктураДокумента.Вставить(Реквизит.Имя);	
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Ссылка", Объект.Ссылка);
	СтруктураДокумента.Вставить("Номер", Объект.Номер);
	СтруктураДокумента.Вставить("Дата", Объект.Дата);
	
	ЗаполнитьЗначенияСвойств(СтруктураДокумента, Объект); 
	 
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ВыгрузкаЗаявкиВЭТРАН";
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка заявки в ЭТРАН.'");
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.СоздатьЗаявку", СтруктураДокумента, ПараметрыВыполненияВФоне);

	
	
КонецФункции

&НаСервере
Процедура ДобавитьВОчередьЗапросовНаСервере()
	
	//Добавить = Ложь;
	
	Для каждого Строка из Объект.invoice Цикл 
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь.Наименование;
		
		НаборЗаписей = РегистрыСведений.э_ЭТРАН_ОчередьЗапросовКЭтрану.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
		НаборЗаписей.Отбор.ТипЗапроса.Установить(Перечисления.э_ИменаЗапросов.ЗапросДанныхНакладной);
		НаборЗаписей.Отбор.Документ.Установить(Документы.э_ЭТРАН_ЭлектроннаяНакладная.ПустаяСсылка()); 
		НаборЗаписей.Отбор.НомерДокумента.Установить(Строка.invNumber);
		
		НаборЗаписей.Прочитать();
		
		Для каждого Запись из НаборЗаписей Цикл 		
			Если Запись.Обработан тогда
				//Перезаписываем накладную	
				Запись.Ответ = "";
				Запись.Обработан = Ложь; 			
				//Добавить = Истина;
				Сообщить("Повторный запрос по накладной: " + Запись.НомерДокумента);
			КонецЕсли;   		
		КонецЦикла;
		
		
		Если НаборЗаписей.Количество() = 0 тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Документ  = Документы.э_ЭТРАН_ЭлектроннаяНакладная.ПустаяСсылка();
			Запись.ТипЗапроса = Перечисления.э_ИменаЗапросов.ЗапросДанныхНакладной;
			Запись.Пользователь = ТекПользователь;
			Запись.НомерДокумента = Строка.invNumber;
			Запись.НомерНакладной = Строка.invNumber;
			Запись.Обработан = Ложь;
		КонецЕсли;
		
		
		
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Запрос = "<getInvoice version=""1.0"">
			|<invNumber value=""" + Строка.invNumber  + """/>
			|<useMod11/>
			|</getInvoice>";
			Запись.ДатаЗаписи = ТекущаяДата();
			//Запись. = ;
			//Запись. = ;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
			Объект.invoice.Очистить();
		Исключение
			Сообщить("Не Удалось накладную поставить в очередь запросов к этрану!");
		КонецПопытки;
		
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопрос(Команда)    
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	ПоказатьВопрос(Оповещение, "Выгрузить ГУ-12 в ЭТРАН?", РежимДиалогаВопрос.ОКОтмена,0, КодВозвратаДиалога.ОК, "Выгрузка заявки в ЭТРАН?");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	Если НетЗапущеныхРанееЗаданий("ВыгрузкаЗаявкиВЭТРАН") Тогда	
		Если Результат = КодВозвратаДиалога.Ок Тогда  		
			Если Модифицированность Тогда
				ЗаполнитьКодыПоСсылкам();
			КонецЕсли;
			Сообщить("Начало выгрузки заявки");
			СоздатьЗаявкуНаСервере();
			Подключаемый_ПроверитьВыполнениеЗадания();
		Иначе                             		
			Сообщить("Документ не создан!");
		КонецЕсли;
	Иначе
		Сообщить("Дождитесь завершения предыдущего вызова");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыПоСсылкам()  

	Объект.ВидСообщенияИД = Объект.ВидСообщения.Код;	
	Объект.ВидОтправкиИД = Объект.ВидОтправки.Код;
	Объект.СтранаОтправленияКод = ?(Объект.СтранаОтправления.Код="","643",Объект.СтранаОтправления.Код);
	Объект.СтанцияОтправленияКод = Объект.СтанцияОтправления.э_СтанцияКод;
	Объект.СтанцияВходаВРоссиюКод = Объект.СтанцияВходаВРоссию.э_СтанцияКод;

	Объект.ТипСобственностиВагоновИД = Объект.ТипСобственностиВагонов.Код;
	Объект.ГрузоотправительОКПО = Объект.Грузоотправитель.ОКПО;
	Объект.ГрузоотправительИД = Объект.Грузоотправитель.Код;
	Объект.ГрузоотправительАдресИД = Объект.Грузоотправитель.АдресИД;
	Объект.ГрузоотправительТГНЛ = Объект.Грузоотправитель.ТГНЛ;
	Объект.СпособПодачиИД = Объект.СпособПодачи.Код;
	
	Если Объект.ГруппаГруза = "" Тогда 
		Объект.ГруппаГруза = "41";
	КонецЕсли;
	
	Если Объект.ТипСогласованияСВладельцемПодъездногоПути = "" Тогда 
		Объект.ТипСогласованияСВладельцемПодъездногоПути = "1";
	КонецЕсли;

	Объект.ВладелецПодъездногоПутиИД = Объект.ВладелецПодъездногоПути.Код;

	
	Для Каждого Строка из Объект.Отправки Цикл                
		Строка.НомерОтправки = Строка.НомерСтроки;
		Строка.ВидОтправкиИД = Строка.ВидОтправки.Код;
		Строка.ВидПодвижногоСоставаИД = Строка.ВидПодвижногоСостава.Код;
		Строка.ВидУпаковкиИД = Строка.ВидУпаковки.Код;
		
		//Строка.НовыйВидПодвижногоСоставаКод = Строка.НовыйВидПодвижногоСостава.ИДWAGTYPE;
		//Строка.ВладелецВагонаИД = Строка.;
		//Строка.ВладелецКонтейнераИД = Строка;
		
		Если ЗначениеЗаполнено(Строка.Грузополучатель) Тогда
			Строка.ГрузополучательИД = Строка.Грузополучатель.Код;
			Строка.ГрузополучательОКПО = Строка.Грузополучатель.ОКПО;
		КонецЕсли;
		
		//Строка.ГрузополучательАдрес = Строка.Грузополучатель.Адрес;
		//Строка.ГрузополучательТГНЛ = Строка.Грузополучатель.ТГНЛ;
		Строка.ГрузПоГНГКод = Строка.ГрузПоГНГ.Код;
		Строка.ГрузПоЕТСНГКод = Строка.ГрузПоЕТСНГ.Код;
		Строка.ТипСобственностиВагоновДляКонтейнеровИД = Строка.ТипСобственностиВагоновДляКонтейнеров.Код; 
		Строка.СтанцияНазначенияКод = Строка.СтанцияНазначения.э_СтанцияКод;
		Строка.СтанцияВыходаИзРоссииКод = Строка.СтанцияВыходаИзРоссии.э_СтанцияКод;
		Строка.ГрузПоГНГНаименование = Строка.ГрузПоГНГ.Наименование;
		Строка.ГрузНаименование = Строка.ГрузПоЕТСНГ.Наименование;
		Строка.ВладелецВагонаИД = Строка.ВладелецВагона.Код;
		Строка.ВидУпаковкиИД = Строка.ВидУпаковки.Код;
		Строка.СтранаНазначенияКод = Строка.СтранаНазначения.Код;
	КонецЦикла;                                                                 
	
	Для Каждого Строка из Объект.Плательщики Цикл
		
		//Строка.ПлательщикИД = Строка.Плательщик.Код;
		////Строка.ПлательщикКод = Строка.Плательщик.Код;
		//Строка.ПлательщикОКПО = Строка.Плательщик.ОКПО;
		//Строка.ПлательщикАдрес = Строка.Плательщик.Адрес;
		//Строка.ПлательщикИД = Строка.Плательщик.Код;
		//Строка.ПлательщикКод = Строка.Плательщик.ЕЛС;

	КонецЦикла;                                         
	
	
КонецПроцедуры                                           

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )




&НаСервере
Процедура РезультатВыполненияЗавершение()
	РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыполнения); 
	Сообщить("Выгрузка заявки завершена");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДополнительныеПараметры = "") Экспорт
	
	Попытка
		Если РезультатДлительнойОперации.Статус = "Выполнено" Или ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда
			РезультатВыполненияЗавершение();
			ЭтотОбъект.Записать();
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.Интервал = 3;
			ДлительныеОперацииКлиент.э_ОжидатьЗавершение(РезультатДлительнойОперации, Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект),ПараметрыОжидания);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
КонецФункции

&НаСервере
Функция НетЗапущеныхРанееЗаданий(КлючПоискаФоновогоЗадания)
	
	Если КлючПоискаФоновогоЗадания = "ВыгрузкаЗаявкиВЭТРАН" Тогда 
		КлючФоновогоЗадания = "ВыгрузкаЗаявкиВЭТРАН";
		Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно)).Количество() > 0 Тогда 
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоды(Команда)
	ЗаполнитьКодыПоСсылкам();
КонецПроцедуры

&НаКлиенте
Процедура ОтправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	СтандартнаяОбработка = Ложь;
	ПараметрыФ = Новый Структура;    
		
	ПараметрыФ.Вставить("ВидОтправки",Элемент.ТекущиеДанные.ВидОтправки);
	ПараметрыФ.Вставить("ВидПодвижногоСостава",Элемент.ТекущиеДанные.ВидПодвижногоСостава);
	ПараметрыФ.Вставить("ВидУпаковки",Элемент.ТекущиеДанные.ВидУпаковки);
	ПараметрыФ.Вставить("ВладелецКонтейнера",Элемент.ТекущиеДанные.ВладелецКонтейнера);
	ПараметрыФ.Вставить("ГрузПоГНГ",Элемент.ТекущиеДанные.ГрузПоГНГ);
	ПараметрыФ.Вставить("ГрузПоГНГ2001",Элемент.ТекущиеДанные.ГрузПоГНГ2001);
	ПараметрыФ.Вставить("КоличествоВагоновКонтейнеров",Элемент.ТекущиеДанные.КоличествоВагоновКонтейнеров);
	ПараметрыФ.Вставить("НовыйВидПодвижногоСостава",Элемент.ТекущиеДанные.НовыйВидПодвижногоСостава);
	ПараметрыФ.Вставить("СтанцияНазначения",Элемент.ТекущиеДанные.СтанцияНазначения);
	ПараметрыФ.Вставить("СтранаНазначения",Элемент.ТекущиеДанные.СтранаНазначения);
	ПараметрыФ.Вставить("ТипСобственностиВагоновДляКонтейнеров",Элемент.ТекущиеДанные.ТипСобственностиВагоновДляКонтейнеров);
	ПараметрыФ.Вставить("ГрузПоЕТСНГ",Элемент.ТекущиеДанные.ГрузПоЕТСНГ);
	

	ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаОтправки",ПараметрыФ,ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("СписокОтправокПередНачаломДобавленияЗавершение",));
			
	Отказ = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтправокПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Элементы.Отправки.Обновить();
КонецПроцедуры

&НаСервере
Процедура РасчетТарифаНаСервере()
	
	//Добавить предупреждение      	
	Объект.ОтправкиУслугиПоГрузам.Очистить();
	
	Для каждого СтрокаОтправки Из Объект.Отправки Цикл 
		
		РасчитатьТарифИОхрану(СтрокаОтправки);
		  		
	КонецЦикла; 

	
КонецПроцедуры

&НаСервере
Процедура РасчитатьТарифИОхрану(СтрокаОтправки)
	
	Тоннажность = СтрокаОтправки.ФутовостьДляКонтейнеров;
	РазмерКонт = 12;
	Если СтрокаОтправки.ФутовостьДляКонтейнеров = 40 тогда 		
		Тоннажность = 30;
		РазмерКонт = 12;
	ИначеЕсли   СтрокаОтправки.ФутовостьДляКонтейнеров = 30 Тогда
		Тоннажность = 24;
		РазмерКонт = 6;
	ИначеЕсли   СтрокаОтправки.ФутовостьДляКонтейнеров = 20 Тогда
		Тоннажность = 24;
		РазмерКонт = 6;
	КонецЕсли;
	
	
	
	ТекстЗапроса = "<getCalcDue> 	
	|<invFromCountryCode value=""" + Объект.СтранаОтправленияКод + """/>
	|<invFromPortCode value=""37786""/>
	|<invFromStationCode value=""" + Объект.СтанцияОтправленияКод + """/>
	//|<invLoadAssetsID value=""" +  + """/>
	|<invPayFormID value=""12""/>                                                     
	|<invPayPlaceID value=""3""/>                                                      
	|<invPayPlaceRwCode value=""39""/>
	|<invPlanCarCount value=""" + СтрокаОтправки.КоличествоВагоновКонтейнеров + """/>
	|<invPlanCarOwnerTypeID value=""" + ?(СтрокаОтправки.ТипСобственностиВагоновДляКонтейнеровИД = 0,1,СтрокаОтправки.ТипСобственностиВагоновДляКонтейнеровИД) + """/>
	|<invPlanCarTypeID value=""" + СтрокаОтправки.ВидПодвижногоСостава.КодВагонаДляПровознойПлаты + """/>
	|<invPlanContCount value=""" + СтрокаОтправки.КоличествоВагоновКонтейнеров + """/>
	|<invPlanContOwnerTypeID value=""1""/>
	|<invContPlanSizeBig value=""" + РазмерКонт + """/>
	|<invPlanContTonnage value=""" + Тоннажность + """/>";
	
	Если  не СтрокаОтправки.Грузополучатель = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + "|<invRecipID value=""" + СтрокаОтправки.Грузополучатель.Код + """/>
		|<invRecipAddressID value=""" + СтрокаОтправки.Грузополучатель.АдресИД + """/>
		|<invRecipOKPO value=""" + СтрокаОтправки.Грузополучатель.ОКПО + """/>
		|<invRecipTGNL value=""" + СтрокаОтправки.Грузополучатель.ТГНЛ + """/>";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"|<invSendKindID value=""" + Объект.ВидОтправкиИД + """/>
	|<invSendSpeedID value=""2""/>
	|<invToCountryCode value=""" + СтрокаОтправки.СтранаНазначенияКод + """/>
	|<invToStationCode value=""" + СтрокаОтправки.СтанцияНазначенияКод + """/>
	|<invFreight>
	|<freightGNGID2001 value=""" + СтрокаОтправки.ГрузПоГНГКод + """/>
	//|<freightGNGCode value=""" + СтрокаОтправки.ГрузПоГНГКод + """/>
	|<freightPackTypeID value=""" + СтрокаОтправки.ВидУпаковки.Код + """/>
	|<freightWeight value=""" + Формат(СтрокаОтправки.ВесГрузаВТоннах ,"ЧГ = 0") + """/>  
	|<freightCode value=""" + СтрокаОтправки.ГрузПоЕТСНГкод + """/>
	|</invFreight>";
	
	Если Объект.Охрана Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"|<invSPC>
		|<spcTranspClauseID value=""398""/>
		|<spcCustomText value=""1""/>
		|</invSPC>";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"|</getCalcDue>"; 
	
	
	
	Результат = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);
	
	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Результат);
	
	
	Объект.Ошибки = "";
	Если Найти(Результат,"errorMessage") > 0 Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Результат);		
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "errorMessage" Тогда
				Объект.Ошибки = ЧтениеXML.ПолучитьАтрибут("value");	
				продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	Тариф = 0;
	ТарифНДС = 0;
	
	Охрана = 0;
	ОхранаНДС = 0;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "dueTypeID" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТипРасчета = Число(ЧтениеXML.ПолучитьАтрибут("value"));			
		КонецЕсли;
		
		
		 //тариф
		Если ЧтениеXML.Имя = "dueSumInfr" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ТипРасчета = 1 Тогда 
			 Тариф = Число(ЧтениеXML.ПолучитьАтрибут("value"));
		КонецЕсли;
		
		//Охрана
		Если ЧтениеXML.Имя = "dueAmount" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ТипРасчета = 4 Тогда
			Охрана = Число(ЧтениеXML.ПолучитьАтрибут("value"));
		КонецЕсли;
	    
		
		Если ЧтениеXML.Имя = "dueTaxSum" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ТипРасчета = 1 тогда
				ТарифНДС = Число(ЧтениеXML.ПолучитьАтрибут("value"));
			ИначеЕсли ТипРасчета = 4  тогда
				ОхранаНДС = Число(ЧтениеXML.ПолучитьАтрибут("value"));
			КонецЕсли; 	
			
		КонецЕсли; 
		
		Если ЧтениеXML.Имя = "dueTaxVal" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ТипРасчета = 1  тогда
				ТарифСтавкаНДС = Число(ЧтениеXML.ПолучитьАтрибут("value"));
			ИначеЕсли ТипРасчета = 4  тогда
				ОхранаСтавкаНДС = Число(ЧтениеXML.ПолучитьАтрибут("value"));
			КонецЕсли; 	
			
		КонецЕсли; 
		
	КонецЦикла; 
	
		ВсегоТариф =  Тариф + ТарифНДС;		
		Если ВсегоТариф <> 0 Тогда  
				НовСтрокаУслугТариф = Объект.ОтправкиУслугиПоГрузам.Добавить();
				НовСтрокаУслугТариф.НомерОтправки = СтрокаОтправки.НомерСтроки; 
				НовСтрокаУслугТариф.Сумма = Тариф;
				НовСтрокаУслугТариф.СуммаНДС = ТарифНДС;
				НовСтрокаУслугТариф.СуммаСНДС = ВсегоТариф;
				НовСтрокаУслугТариф.СтавкаНДС = СтавкаНДСПеречисление(Строка(ТарифСтавкаНДС)); 
		КонецЕсли;
		
		ВсегоОхрана =  Охрана + ОхранаНДС;		
		Если ВсегоОхрана <> 0 Тогда  
				НовСтрокаУслугОхрана = Объект.ОтправкиУслугиПоГрузам.Добавить();
				НовСтрокаУслугОхрана.НомерОтправки = СтрокаОтправки.НомерСтроки; 
				НовСтрокаУслугОхрана.Сумма = Охрана;
				НовСтрокаУслугОхрана.СуммаНДС = ОхранаНДС;
				НовСтрокаУслугОхрана.СуммаСНДС = ВсегоОхрана;
				НовСтрокаУслугОхрана.СтавкаНДС = СтавкаНДСПеречисление(Строка(ОхранаСтавкаНДС)); 
		КонецЕсли;   
	           
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеСтавокНДС(Соответствие) 
	
	Соответствие.Вставить("0",       Перечисления.СтавкиНДС.НДС0);
	Соответствие.Вставить("10",      Перечисления.СтавкиНДС.НДС10);
	Соответствие.Вставить("18",      Перечисления.СтавкиНДС.НДС18);
	Соответствие.Вставить("10/110",  Перечисления.СтавкиНДС.НДС10_110);
	Соответствие.Вставить("18/118",  Перечисления.СтавкиНДС.НДС18_118);
	Соответствие.Вставить("без НДС", Перечисления.СтавкиНДС.БезНДС);
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	Соответствие.Вставить("5",      Перечисления.СтавкиНДС.НДС5);
	Соответствие.Вставить("5/105",  Перечисления.СтавкиНДС.НДС5_105);
	Соответствие.Вставить("7",      Перечисления.СтавкиНДС.НДС7);
	Соответствие.Вставить("7/107",  Перечисления.СтавкиНДС.НДС7_107);
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	Соответствие.Вставить("22",      Перечисления.СтавкиНДС.НДС2);
	Соответствие.Вставить("22/122",  Перечисления.СтавкиНДС.НДС22_122);
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	
КонецПроцедуры

Функция СтавкаНДСПеречисление(СтавкаНДС) 
	
	Соответствие = Новый Соответствие;
	ЗаполнитьСоответствиеСтавокНДС(Соответствие);
	
	Для Каждого КлючИЗначение Из Соответствие Цикл
		Если КлючИЗначение.Ключ = СтавкаНДС Тогда
			Возврат КлючИЗначение.Значение;			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	
КонецФункции



&НаКлиенте
Процедура РасчетТарифа(Команда)
	РасчетТарифаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТабличнаяЧастьПередНачаломДобавления("Отправки");
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТабличнаяЧастьПередНачаломДобавления("Плательщики");
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПередНачаломДобавления(ИмяТабличнойЧасти)
	Оповещение = Новый ОписаниеОповещения("ЗавершениеРедактированияСтроки", ЭтотОбъект);
	Если ИмяТабличнойЧасти =  "Плательщики" Тогда
		ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаРедактированияПлательщика", Новый Структура("Действие, ИмяТабличнойЧасти, МассивРеквизитов", "Добавление", ИмяТабличнойЧасти, ПередНачаломДобавленияПолучитьСтруктуруРеквизитов(ИмяТабличнойЧасти)), ЭтаФорма, Новый УникальныйИдентификатор,,, Оповещение);	
	ИначеЕсли ИмяТабличнойЧасти =  "Отправки" Тогда
		ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаРедактированияОтправка", Новый Структура("Действие, ИмяТабличнойЧасти, МассивРеквизитов", "Добавление", ИмяТабличнойЧасти, ПередНачаломДобавленияПолучитьСтруктуруРеквизитов(ИмяТабличнойЧасти)), ЭтаФорма, Новый УникальныйИдентификатор,,, Оповещение);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТабличнаяЧастьВыбор("Плательщики");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтправкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТабличнаяЧастьВыбор("Отправки");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВыбор(ИмяТабличнойЧасти)
	Оповещение 					= Новый ОписаниеОповещения("ЗавершениеРедактированияСтроки", ЭтотОбъект);
	ТекущаяСтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	МассивРеквизитов 			= ПередНачаломДобавленияПолучитьСтруктуруРеквизитов(ИмяТабличнойЧасти);
	Для Каждого Реквизит из МассивРеквизитов Цикл
		Реквизит.Значение = ТекущаяСтрокаТабличнойЧасти[Реквизит.Имя];	
	КонецЦикла;
	Если ИмяТабличнойЧасти =  "Плательщики" Тогда
		ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаРедактированияПлательщика", Новый Структура("Действие, ИмяТабличнойЧасти, МассивРеквизитов", "Редактирование", ИмяТабличнойЧасти, МассивРеквизитов), ЭтаФорма, Новый УникальныйИдентификатор,,, Оповещение);
	ИначеЕсли ИмяТабличнойЧасти =  "Отправки" Тогда
		МассивРеквизитов.Добавить(Новый Структура("Имя, Тип, Синоним, Значение", "НомерСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)), "Номер строки", ТекущаяСтрокаТабличнойЧасти.НомерСтроки));
		ОткрытьФорму("Документ.э_ЗаявкаНаПеревозку.Форма.ФормаРедактированияОтправка", Новый Структура("Действие, ИмяТабличнойЧасти, МассивРеквизитов", "Редактирование", ИмяТабличнойЧасти, МассивРеквизитов), ЭтаФорма, Новый УникальныйИдентификатор,,, Оповещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияСтроки(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат = Неопределено Тогда 
		Если Результат.Действие = "Добавление" Тогда  
			ЗавершениеРедактированияСтрокиНаСервере(Результат);
		Иначе
			ТекущаяСтрокаТабличнойЧасти = Элементы[Результат.ИмяТабличнойЧасти].ТекущиеДанные;
			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаТабличнойЧасти, Результат);
			ЗаполнитьКодыПоСсылкам(); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗавершениеРедактированияСтрокиНаСервере(Результат)
	ЗаполнитьЗначенияСвойств(Объект[Результат.ИмяТабличнойЧасти].Добавить(), Результат);
	ЗаполнитьКодыПоСсылкам();
КонецПроцедуры

&НаСервере
Функция ПередНачаломДобавленияПолучитьСтруктуруРеквизитов(ИмяТабличнойЧасти)
	МассивРеквизитов = Новый Массив();
	Для Каждого Реквизит из Метаданные.Документы.э_ЗаявкаНаПеревозку.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		Если НЕ Элементы.Найти(ИмяТабличнойЧасти + Реквизит.Имя) = Неопределено И Элементы[ИмяТабличнойЧасти + Реквизит.Имя].Видимость Тогда 
			МассивРеквизитов.Добавить(Новый Структура("Имя, Тип, Синоним, Значение", Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним));
		КонецЕсли;
	КонецЦикла;
	Возврат МассивРеквизитов;
КонецФункции

&НаКлиенте 
Процедура ОбновитьОтабражениеРеквизитовФормы()   	
	
	Элементы.ГруппаОпасныйГруз.Видимость = Объект.ОпасныйГруз;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтабражениеРеквизитовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЭтаФорма.Прочитать();

КонецПроцедуры

&НаКлиенте
Процедура ОпасныйГрузПриИзменении(Элемент)
	
	ОбновитьОтабражениеРеквизитовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Отправки.ТекущиеДанные = Неопределено тогда
	Иначе 
		Элементы.ОтправкиУслугиПоГрузам.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерОтправки", Элементы.Отправки.ТекущиеДанные.НомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкиУслугиПоГрузамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОтправкиУслугиПоГрузам.ТекущиеДанные.НомерОтправки = Элементы.Отправки.ТекущиеДанные.НомерСтроки;
	Элементы.ОтправкиУслугиПоГрузам.ТекущиеДанные.Серия = Элементы.Отправки.ТекущиеДанные.Серия;
КонецПроцедуры

