Процедура ЗафиксироватьПолучениеДанныхИзВнешнейСистемы(СтруктураКлючаАналитики, Источник) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеКлючейАналитикиПеревозкиЗагруженные.СоздатьНаборЗаписей();   
	НаборЗаписей.Отбор.КлючАналитикиПеревозки.Установить(СтруктураКлючаАналитики.КлючАналитики);
	
	Для Каждого РеквизитКлюча Из СтруктураКлючаАналитики Цикл 
		
		Если РеквизитКлюча.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКСтруктуреХранения = РеквизитКлюча.Ключ;
		Если ПутьКСтруктуреХранения = "ИзменятьТЧДетализацияПоГрузу" 
			или ПутьКСтруктуреХранения = "КлючАналитики" Тогда
			Продолжить;
		ИначеЕсли ПутьКСтруктуреХранения = "СтруктураТЧМилиПерваяМиляКлючаАналитики" 
			или ПутьКСтруктуреХранения = "СтруктураТЧМилиПоследняяМиляКлючаАналитики"
		    или ПутьКСтруктуреХранения = "ТЧДетализацияПоГрузу" Тогда	
			Для каждого СтрокаВложенойСтруктуры Из РеквизитКлюча.Значение Цикл
				
				Если СтрокаВложенойСтруктуры.Значение = Неопределено Тогда
					Продолжить;
				КонецЕсли;    
				
				НоваяЗапись = НаборЗаписей.Добавить();  
				НоваяЗапись.КлючАналитикиПеревозки = СтруктураКлючаАналитики.КлючАналитики;
				НоваяЗапись.ПутьКСтруктуреХранения = ПутьКСтруктуреХранения + "." + СтрокаВложенойСтруктуры.Ключ; 
				НоваяЗапись.Значение = СтрокаВложенойСтруктуры.Значение; 
				НоваяЗапись.Источник = Источник;
			КонецЦикла;
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить();   
			НоваяЗапись.КлючАналитикиПеревозки = СтруктураКлючаАналитики.КлючАналитики;
			НоваяЗапись.ПутьКСтруктуреХранения = ПутьКСтруктуреХранения; 
			НоваяЗапись.Значение = РеквизитКлюча.Значение; 
			НоваяЗапись.Источник = Источник;
		КонецЕсли;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();    
	
КонецПроцедуры
