
#Область ОбработчикиСобытийФормы   

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьПоВариантуПерезапуска();

	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

 //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Стр Из РеквизитыОбъекта Цикл 
		МассивРеквизитов.Добавить(Стр.Имя);
	КонецЦикла;
	
	ТекстСообщения = ПроверитьУсловияПроверяемыхПараметров(ТипОбъекта, Объект.ПроверяемыеПараметры, 
							Объект.Ссылка, МассивРеквизитов, Объект.ВариантПерезапуска); 
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
		
КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаКлиенте
Процедура ТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = ПодготовитьПараметрыФормыВыборОбъектовМетаданных(); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ТипОбъектаПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", ПараметрыФормы, Элемент,,,, ОписаниеОповещения);

КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаКлиенте
Процедура ТипОбъектаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено 
		И ТипЗнч(Результат) = Тип("СписокЗначений")
		И ЗначениеЗаполнено(Результат) Тогда 
		ПолноеИмяОбъекта = Результат[0].Значение;
		ЗаполнитьРеквизитыПоОбъекту(ПолноеИмяОбъекта);
	КонецЕсли;
	
КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаКлиенте
Процедура ВариантПерезапускаПриИзменении(Элемент)          
	
	УстановитьВидимостьПоВариантуПерезапуска();

КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервереБезКонтекста
Функция ПодготовитьПараметрыФормыВыборОбъектовМетаданных()

	ФильтрПоОбъектамМетаданных = Новый СписокЗначений;

	КоллекцииОбъектовМетаданных = Новый Массив;
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.Справочники);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.Документы);
	
	Для Каждого КоллекцияОбъектовМетаданных Из КоллекцииОбъектовМетаданных Цикл
		Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
			ФильтрПоОбъектамМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя(), ОбъектМетаданных.Представление());
		КонецЦикла;
	КонецЦикла;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФильтрПоОбъектамМетаданных", ФильтрПоОбъектамМетаданных);   
	ПараметрыФормы.Вставить("ВыборЕдинственного", Истина);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор типа объекта'"));
	
	Возврат ПараметрыФормы;
КонецФункции //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервере
Процедура ЗаполнитьРеквизитыПоОбъекту(ПолноеИмяОбъекта) 
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);   
	
	ТипОбъекта = ПолноеИмяОбъекта;
	
	Если ОбъектМетаданных <> Неопределено Тогда
		РеквизитыОбъекта.Очистить();
		
		ДобавитьРеквизитыВТаблицу(ОбъектМетаданных.СтандартныеРеквизиты);
		ДобавитьРеквизитыВТаблицу(ОбъектМетаданных.Реквизиты);
	
		РеквизитыОбъекта.Сортировать("Представление Возр");

	КонецЕсли;

КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервере
Процедура ДобавитьРеквизитыВТаблицу(Реквизиты)
	
	Для Каждого ОписаниеРеквизита Из Реквизиты Цикл

		РеквизитОбъекта = РеквизитыОбъекта.Добавить();
		РеквизитОбъекта.Имя = ОписаниеРеквизита.Имя;
		РеквизитОбъекта.Представление = ОписаниеРеквизита.Представление();
		
	КонецЦикла;
	
КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервереБезКонтекста
Функция ПроверитьУсловияПроверяемыхПараметров(Знач ТипОбъекта, Знач ПроверяемыеПараметры, Знач СсылкаНаОбъект, МассивРеквизитов, Знач ВариантПерезапуска)   
	
	ОшибочныйРеквизит = "";
	ПроверяемыеПараметрыВБазе = "";   
	
	ЗаполнятьПроверяемыеПараметры = (ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриИзмененииПараметров
									Или ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриНезаполненныхПараметрах); 
									
	Если Не ЗаполнятьПроверяемыеПараметры Тогда
		Возврат ОшибочныйРеквизит;
	ИначеЕсли Не ЗначениеЗаполнено(ПроверяемыеПараметры) Тогда  
		ТекстСообщения = "Не заполнен реквизит Проверяемые параметры"; 
		
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда  
		ПроверяемыеПараметрыВБазе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ПроверяемыеПараметры");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипОбъекта) 
		И ЗначениеЗаполнено(ПроверяемыеПараметры)
		И ПроверяемыеПараметрыВБазе <> ПроверяемыеПараметры Тогда   
		
		РазделительИ = ";";
		РазделительИли = "/";
		Операция = "";
		ИтоговоеУсловие = "";
		
		ПроверяемыеПараметры = СокрЛП(ПроверяемыеПараметры);
		ПозицияИ = СтрНайти(ПроверяемыеПараметры, РазделительИ);
		ПозицияИли = СтрНайти(ПроверяемыеПараметры, РазделительИли); 
		
		Если ЗначениеЗаполнено(ПозицияИ) И ЗначениеЗаполнено(ПозицияИли) Тогда 
			Позиция = Мин(ПозицияИ, ПозицияИли);
		Иначе
			Позиция = Макс(ПозицияИ, ПозицияИли);
		КонецЕсли; 
		
		Пока Позиция > 0 Цикл
			Подстрока = СокрЛП(Лев(ПроверяемыеПараметры, Позиция - 1));        
			
			Если ЗначениеЗаполнено(Подстрока)
				И МассивРеквизитов.Найти(Подстрока) = Неопределено Тогда 
				ОшибочныйРеквизит = ПроверяемыеПараметры; 
				Прервать;
			КонецЕсли;
			ПроверяемыеПараметры = Сред(ПроверяемыеПараметры, Позиция + 1);
			ПозицияИ = СтрНайти(ПроверяемыеПараметры, РазделительИ);
			ПозицияИли = СтрНайти(ПроверяемыеПараметры, РазделительИли); 
			Если ЗначениеЗаполнено(ПозицияИ) И ЗначениеЗаполнено(ПозицияИли) Тогда 
				Позиция = Мин(ПозицияИ, ПозицияИли);
			Иначе
				Позиция = Макс(ПозицияИ, ПозицияИли);
			КонецЕсли;
			
		КонецЦикла;    
		
		Если Позиция = 0 
			И ЗначениеЗаполнено(ПроверяемыеПараметры)
			И МассивРеквизитов.Найти(ПроверяемыеПараметры) = Неопределено Тогда 
			ОшибочныйРеквизит = ПроверяемыеПараметры; 
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибочныйРеквизит) Тогда
		ТекстСообщения = СтрШаблон("Неверно заполнен реквизит Проверяемые параметры: %1. Возможно использование только символов ; / для задания условий", ОшибочныйРеквизит);  
	КонецЕсли;
	
	Возврат ТекстСообщения;

КонецФункции //ДИТ Авдеева В.С. 47090 20.04.2022 Конец

//ДИТ Авдеева В.С. 47090 20.04.2022 Начало
&НаСервере
Процедура УстановитьВидимостьПоВариантуПерезапуска()
	
	Перем ВидимостьЗаполненияПроверяемыхПараметров, ПерезапускатьПриИзмененииПараметров, ПерезапускатьПриНезаполненныхПараметрах;
	
	ПерезапускатьПриИзмененииПараметров = ПредопределенноеЗначение("Перечисление.ВариантыПерезапускаЗадачи.ПерезапускатьПриИзмененииПараметров");
	ПерезапускатьПриНезаполненныхПараметрах = ПредопределенноеЗначение("Перечисление.ВариантыПерезапускаЗадачи.ПерезапускатьПриНезаполненныхПараметрах"); 
	
	ВидимостьЗаполненияПроверяемыхПараметров = (Объект.ВариантПерезапуска = ПерезапускатьПриИзмененииПараметров
	Или Объект.ВариантПерезапуска = ПерезапускатьПриНезаполненныхПараметрах);
	
	Если Не ВидимостьЗаполненияПроверяемыхПараметров Тогда 
		Объект.ПроверяемыеПараметры = "";
		ТипОбъекта = "";
		РеквизитыОбъекта.Очистить();		
	КонецЕсли;													
	Элементы.ГруппаЗаполнениеПроверяемыхПараметров.Видимость = ВидимостьЗаполненияПроверяемыхПараметров;

КонецПроцедуры //ДИТ Авдеева В.С. 47090 20.04.2022 Конец


#КонецОбласти

