
&НаКлиенте
Процедура ЭтоВагоннаяЖДНПриИзменении(Элемент)
	//Элементы.СвязанныеУслугиЗаполнятьВагонИзЖДН.Видимость = Не Объект.ЭтоВагоннаяЖДН; 
	//Для каждого СтрокаСвязаннаяУслуга Из Объект.СвязанныеУслуги Цикл
	//	СтрокаСвязаннаяУслуга.ЗаполнятьВагонИзЖДН = Объект.ЭтоВагоннаяЖДН;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.СвязанныеУслугиЗаполнятьВагонИзЖДН.Видимость = Не Объект.ЭтоВагоннаяЖДН;
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
