
Процедура ЗагрузкаНакладныхГВЦ() Экспорт
	
	КаталогЗагрузки = Константы.КаталогРасположенияНакладныхГВЦ.Получить();
	
	НФ = НайтиФайлы(КаталогЗагрузки, "*.txt", Ложь);
	Для каждого Стр из НФ Цикл
		ЗагрузитьНакладнуюГВЦ(Стр.ПолноеИмя, КодировкаТекста.UTF8);
	КонецЦикла;
	НФ = НайтиФайлы(КаталогЗагрузки, "*.out", Ложь);
	Для каждого Стр из НФ Цикл
		ЗагрузитьНакладнуюГВЦ(Стр.ПолноеИмя, КодировкаТекста.ANSI);
	КонецЦикла;
	
КонецПроцедуры

//Процедура ЗагрузитьНакладнуюГВЦ(ИмяФайла, КодировкаТекста)   //ДИТ, Беляев СЮ, TA51481, 03-06-2022, разделена на несколько методов
//	
//	ЧТ = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста);
//	ТекстФ = ЧТ.Прочитать();
//	ЧТ.Закрыть();
//	
//	РаздМассив = СтрРазделить(ТекстФ, Символы.ПС);
//	МассивОшибок = Новый Массив;
//	
//	//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, ++
//	ПустойНомерКТК = "00000000000"; //11 знаков  - примеров в файлах данных не было, установлено из предположения   
//	//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, --
//	
//	// Евросиб Фролов (26.04.2022
//	МассивСообщений = Новый Массив;
//	// Евросиб Фролов)
//	
//	Для каждого СтрокаФ из РаздМассив Цикл
//		Если Не ЗначениеЗаполнено(СтрокаФ) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		НомерНакладной = Сред(СтрокаФ, 49, 8); // +
//		
//		Если НомерНакладной = "00000000" Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ДеньОтправки = Сред(СтрокаФ, 57, 2); // +
//		МесяцОтправки = Сред(СтрокаФ, 59, 2); // +
//		ВремяОтправленияЧасы = "00";
//		ВремяОтправленияМинуты = "00";
//		ДеньПрибытия = "01";
//		МесяцПрибытия = "01";
//		ГодПрибытия = "0001";
//		Если СтрНайти(ИмяФайла,"inv_sending") Тогда
//			ВремяОтправленияЧасы = Сред(СтрокаФ, 61, 2); // +
//			ВремяОтправленияМинуты = Сред(СтрокаФ, 63, 2); // +
//		Иначе
//			ДеньПрибытия = Сред(СтрокаФ, 61, 2); // +
//			МесяцПрибытия = Сред(СтрокаФ, 63, 2); // +
//			ГодПрибытия = Формат(?(Число(МесяцПрибытия) > Месяц(ТекущаяДата()), Год(ТекущаяДата())-1, Год(ТекущаяДата())),"ЧГ="); // +
//		КонецЕсли; 
//		ГодОтправки = Формат(?(Число(МесяцОтправки) > Месяц(ТекущаяДата()), Год(ТекущаяДата())-1, Год(ТекущаяДата())),"ЧГ="); // +
//		ДатаОтправки = Дата(ГодОтправки+МесяцОтправки+ДеньОтправки+ВремяОтправленияЧасы+ВремяОтправленияМинуты); // +
//		
//		//Евросиб Каблов 16.10.2020 ( Ticket#0210461 Проверка наличия накладной этран ниже
//		//Запрос = Новый Запрос;
//		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//		//               |	э_Накладная.Ссылка КАК Ссылка
//		//               |ИЗ
//		//               |	Документ.э_Накладная КАК э_Накладная
//		//               |ГДЕ
//		//               |	НЕ э_Накладная.ПометкаУдаления
//		//               |	И э_Накладная.НакладнаяНомер = &Номер
//		//               |	И э_Накладная.ИсточникНакладной = &ЭТРАН
//		//               |	И э_Накладная.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНачала И &ДатаОкончания
//		//               |	И э_Накладная.ТекущееСостояниеНакладной.ДействующийСтатус
//		//               |
//		//               |УПОРЯДОЧИТЬ ПО
//		//               |	э_Накладная.Дата УБЫВ";
//		//Запрос.УстановитьПараметр("Номер", НомерНакладной);
//		//Запрос.УстановитьПараметр("ЭТРАН", Перечисления.ИсточникЖДН.ЭТРАН);
//		//Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаОтправки));
//		//Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОтправки));
//		//Ответ = Запрос.Выполнить().Выбрать();
//		//Если Ответ.Следующий() Тогда
//		//	Продолжить;
//		//КонецЕсли;
//		//Евросиб Каблов 16.10.2020 )
//		
//		КодЭкспедитора = Сред(СтрокаФ, 1, 10); // -
//		
//		ПодкодЭкспедитора = Сред(СтрокаФ, 11, 12); // -
//				
//		КатегорияОтправки = Сред(СтрокаФ, 31, 1); // -
//		
//		КоличествоВагоновКТК = Сред(СтрокаФ, 32, 2); // -
//		
//		ОтчетныйМесяц = Сред(СтрокаФ, 65, 2); // -
//		
//		ФактВесГруза = Сред(СтрокаФ, 67, 8); // -
//		
//		Попытка
//			ФактВесГруза = Число(ФактВесГруза);
//		Исключение
//			ОО = ОписаниеОшибки();
//			Сообщить("Ошибка преобразования веса груза: " + ФактВесГруза + " " + ОО);
//		КонецПопытки;
//		
//		ПризнакМаршрута = Сред(СтрокаФ, 75, 1); // -
//		
//		ВидПеревозки = Сред(СтрокаФ, 76, 1); // -
//		
//		
//		НомерВагона = Сред(СтрокаФ, 23, 8); // +
//		ПринадлежностьВагонов = Сред(СтрокаФ, 34, 1); // +
//		НомерКТК = Сред(СтрокаФ, 35, 11); // +
//		ПринадлежностьКТК = Сред(СтрокаФ, 46, 1); // +
//		ГрузоподъемностьВагонаКТК = Сред(СтрокаФ, 47, 2); // +
//		
//		ДатаПрибытия = Дата(ГодПрибытия+МесяцПрибытия+ДеньПрибытия); // +
//		КодЗагрСтОтправления = Сред(СтрокаФ, 87, 5); // +
//		КодЗагрСтНазначения = Сред(СтрокаФ, 92, 5); // +
//		КодСтОтправления = Сред(СтрокаФ, 77, 5); // +
//		КодСтНазначения = Сред(СтрокаФ, 82, 5); // +
//		
//		//Евросиб Каблов 30.10.2020 ( Ticket#0212217
//		//_КодСтанцииОтправления = КодСтОтправления;
//		//Если КодЗагрСтОтправления <> "00000" Тогда
//		//	_КодСтанцииОтправления = КодЗагрСтОтправления;
//		//КонецЕсли;
//		//_КодСтанцииНазначения = КодСтНазначения;
//		//Если КодЗагрСтНазначения <> "00000" Тогда
//		//	_КодСтанцииНазначения = КодЗагрСтНазначения;
//		//КонецЕсли;
//		//СтанцияОтправления = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(_КодСтанцииОтправления); // +
//		//СтанцияПрибытия = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(_КодСтанцииНазначения); // +
//		СтанцияОтправления = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(КодСтОтправления); // +
//		СтанцияПрибытия = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(КодСтНазначения); // +
//		//Евросиб Каблов 30.10.2020 )
//		
//		КодЕТСНГ = Сред(СтрокаФ, 97, 5);
//		КодГНГ = Сред(СтрокаФ, 102, 6);
//		КодИсключительногоТарифа = Сред(СтрокаФ, 108, 4);
//		
//		КодВалюты = Сред(СтрокаФ, 112, 1); // +
//		//ПровознаяПлата = Сред(СтрокаФ, 113, 8); // +
//		ПровознаяПлата = Сред(СтрокаФ, 113, 6) + "." + Сред(СтрокаФ, 119, 2);
//		
//		ПризнакИсключения = Сред(СтрокаФ, 121, 1);
//		ПризнакЗаписи = Сред(СтрокаФ, 122, 1);
//		
//		ГрузополучательОКПО = Сред(СтрокаФ, 123, 8); // +
//		ГрузополучательАСУ = Сред(СтрокаФ, 131, 4); // -
//		ГрузоотправительОКПО = Сред(СтрокаФ, 135, 8); // +
//		ГрузоотправительАСУ = Сред(СтрокаФ, 143, 4); // -
//		
//		//Евросиб Каблов 16.10.2020 ( Ticket#0210461 если номер и вагон или КТК из накладной Этран совпадают, накладную ГВЦ не добавляем
//		Запрос = Новый Запрос;
//		//Запрос.Текст = 
//		//"ВЫБРАТЬ
//		//|	э_Накладная.Ссылка КАК Ссылка
//		//|ПОМЕСТИТЬ ВТНакладныеЭтран
//		//|ИЗ
//		//|	Документ.э_Накладная КАК э_Накладная
//		//|ГДЕ
//		////Евросиб Каблов 10.08.2021 ( Ticket#0232700		
//		////|	э_Накладная.НакладнаяНомер = &НомерНакладной 
//		//|	э_Накладная.НакладнаяНомер ПОДОБНО &НомерНакладной
//		////Евросиб Каблов 10.08.2021 )
//		//|	И э_Накладная.ИсточникНакладной = &ЭТРАН
//		//|	И НЕ э_Накладная.ПометкаУдаления
//		//|;
//		//|
//		//|////////////////////////////////////////////////////////////////////////////////
//		//|ВЫБРАТЬ
//		//|	ВТНакладныеЭтран.Ссылка КАК Ссылка,
//		//|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
//		//|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера
//		//|ИЗ
//		//|	ВТНакладныеЭтран КАК ВТНакладныеЭтран
//		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
//		//|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяВагоны.Ссылка
//		//|			И (э_НакладнаяВагоны.НомерВагона = &НомерВагона)
//		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
//		//|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяКонтейнеры.Ссылка
//		//|			И (э_НакладнаяКонтейнеры.НомерКонтейнера = &НомерКонтейнера)
//		//|ГДЕ
//		//|	(НЕ э_НакладнаяВагоны.НомерВагона ЕСТЬ NULL
//		//|			ИЛИ НЕ э_НакладнаяКонтейнеры.НомерКонтейнера ЕСТЬ NULL)";
//		
//		//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, ++
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	э_Накладная.Ссылка КАК Ссылка
//		|ПОМЕСТИТЬ ВТНакладныеЭтран
//		|ИЗ
//		|	Документ.э_Накладная КАК э_Накладная
//		|ГДЕ
//		|	э_Накладная.НакладнаяНомер ПОДОБНО &НомерНакладной
//		|	И э_Накладная.ИсточникНакладной = &ЭТРАН
//		|	И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус
//		|	И НЕ э_Накладная.ПометкаУдаления
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТНакладныеЭтран.Ссылка КАК Ссылка
//		|ИЗ
//		|	ВТНакладныеЭтран КАК ВТНакладныеЭтран
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
//		|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяВагоны.Ссылка
//		|			И (э_НакладнаяВагоны.НомерВагона = &НомерВагона)";
//		Если НомерКТК <> ПустойНомерКТК Тогда
//			Запрос.Текст = Запрос.Текст +
//							"
//							|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
//							|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяКонтейнеры.Ссылка
//							|			И (э_НакладнаяКонтейнеры.НомерКонтейнера = &НомерКонтейнера)";
//		КонецЕсли;  
//		//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, --
//		
//		//Евросиб Каблов 10.08.2021 ( Ticket#0232700
//		//Запрос.УстановитьПараметр("НомерНакладной", НомерНакладной);
//		ЦифрыБез0 = "123456789";
//		ДлинаНомера = СтрДлина(НомерНакладной);
//		Для НомерСимвола = 1 По ДлинаНомера Цикл
//			Символ = Сред(НомерНакладной, НомерСимвола, 1);
//			Если СтрНайти(ЦифрыБез0, Символ) <> 0 Тогда
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//		НомерДляПоиска = "%" + Сред(НомерНакладной, НомерСимвола, ДлинаНомера);		
//		Запрос.УстановитьПараметр("НомерНакладной", НомерДляПоиска);
//		//Евросиб Каблов 10.08.2021 )
//		Запрос.УстановитьПараметр("ЭТРАН", Перечисления.ИсточникЖДН.ЭТРАН);
//		Запрос.УстановитьПараметр("НомерВагона", НомерВагона);
//		Запрос.УстановитьПараметр("НомерКонтейнера", НомерКТК);
//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда    
//			//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, ++  //Закомментировано, не надо изменять ЖДН из ЭТРАН
//			//Если ЗначениеЗаполнено(Выборка.НомерКонтейнера) И Не ЗначениеЗаполнено(Выборка.НомерВагона) Тогда
//			//	НакладнаяЖДЭтран = Выборка.Ссылка.ПолучитьОбъект();
//			//	//Евросиб Каблов 09.07.2021 ( Ticket#0234268
//			//	СтрокиСПустымНомеромВагона = НакладнаяЖДЭтран.Вагоны.НайтиСтроки(Новый Структура("НомерВагона", ""));
//			//	Для Каждого СтрокаВагон Из СтрокиСПустымНомеромВагона Цикл
//			//		//Евросиб - АСуслов 13.07.2021 12:12:18 #
//			//		//(
//			//		//НакладнаяЖДЭтран.Вагоны.Удалить(СтрокиСПустымНомеромВагона);
//			//		НакладнаяЖДЭтран.Вагоны.Удалить(СтрокаВагон);
//			//		//)
//			//		//Евросиб - АСуслов 13.07.2021 12:12:18 #
//			//	КонецЦикла;
//			//	//Евросиб Каблов 09.07.2021 ) 
//			//	СтрокаВагон = НакладнаяЖДЭтран.Вагоны.Добавить();
//			//	СтрокаВагон.НомерВагона = НомерВагона;
//			//	СтрокаВагон.ТипСобственностиИД = ПринадлежностьВагонов;
//			//	СтрокаВагон.ТипСобственностиНаименование = ?(ПринадлежностьВагонов = "1", "МПС", "Собственный");
//			//	НакладнаяЖДЭтран.Записать(РежимЗаписиДокумента.Проведение);
//			//КонецЕсли;       
//			//ДИТ Беляев СЮ, Ticket#0249176, 29-11-2021, --
//			Продолжить; //Есть аналогичная ЖДН из ЭТРАН, загрузка не требуется
//		КонецЕсли;
//		//Евросиб Каблов 16.10.2020 )
//		
//		// производим поиск и заполнение ЖДН
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//		               |	э_Накладная.Ссылка КАК Ссылка
//		               |ИЗ
//		               |	Документ.э_Накладная КАК э_Накладная
//		               |ГДЕ
//		               |	НЕ э_Накладная.ПометкаУдаления
//		               |	И э_Накладная.НакладнаяНомер = &Номер
//		               |	И э_Накладная.ИсточникНакладной = &ГВЦ
//		               |
//		               |УПОРЯДОЧИТЬ ПО
//		               |	э_Накладная.Дата УБЫВ";
//		Запрос.УстановитьПараметр("Номер", НомерНакладной);
//		Запрос.УстановитьПараметр("ГВЦ", Перечисления.ИсточникЖДН.ГВЦ);
//		Ответ = Запрос.Выполнить().Выбрать();
//		Если Ответ.Следующий() Тогда
//			НоваяНакладнаяЖД = Ответ.Ссылка.ПолучитьОбъект();
//			//НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.Очистить();
//			//НоваяНакладнаяЖД.Грузы.Очистить();
//			//НоваяНакладнаяЖД.ГрузыЖД.Очистить();
//			//НоваяНакладнаяЖД.Вагоны.Очистить();
//			//НоваяНакладнаяЖД.Контейнеры.Очистить();
//		Иначе
//			НоваяНакладнаяЖД = Документы.э_Накладная.СоздатьДокумент();
//		КонецЕсли;
//		
//		НоваяНакладнаяЖД.ИсточникНакладной = Перечисления.ИсточникЖДН.ГВЦ;
//		НоваяНакладнаяЖД.Дата = ТекущаяДата();
//		НоваяНакладнаяЖД.Номер = НомерНакладной;
//		НоваяНакладнаяЖД.НакладнаяНомер = НомерНакладной;
//		
//		Если НомерВагона <> "00000000" Тогда
//			Если НоваяНакладнаяЖД.Вагоны.НайтиСтроки(Новый Структура("НомерВагона", НомерВагона)).Количество() = 0 Тогда
//				СтрокаВагон = НоваяНакладнаяЖД.Вагоны.Добавить();
//				СтрокаВагон.НомерВагона = НомерВагона;
//				СтрокаВагон.ТипСобственностиИД = ПринадлежностьВагонов;
//				СтрокаВагон.ТипСобственностиНаименование = ?(ПринадлежностьВагонов = "1", "МПС", "Собственный");
//				СтрокаВагон.МассыВКгНетто = ФактВесГруза;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НомерКТК <> "00000000000" Тогда
//			Если НоваяНакладнаяЖД.Контейнеры.НайтиСтроки(Новый Структура("НомерКонтейнера", НомерКТК)).Количество() = 0 Тогда
//				СтрокаКТК = НоваяНакладнаяЖД.Контейнеры.Добавить();
//				//СтрокаКТК.Контейнер = НомерКТК;
//				СтрокаКТК.НомерКонтейнера = НомерКТК;
//				СтрокаКТК.ТипСобственностиИД = ПринадлежностьКТК;
//				СтрокаКТК.ТипСобственностиНаименование = ?(ПринадлежностьКТК = "1", "МПС", "Собственный");
//				СтрокаКТК.ГрузоподКонтТн = ГрузоподъемностьВагонаКТК;
//				СтрокаКТК.МассыВКгНетто = ФактВесГруза;
//			КонецЕсли;
//		КонецЕсли;
//		
//		НоваяНакладнаяЖД.ДатаИВремяОтправленияГруза = ДатаОтправки;
//		НоваяНакладнаяЖД.ДатаИВремяПрибытияГруза = ДатаПрибытия;
//		НоваяНакладнаяЖД.ДатаИВремяРаскредитованияГруза = ДатаПрибытия;
//		НоваяНакладнаяЖД.ДатаИВремяРаскредитованияГрузаМестная = ДатаПрибытия;
//		НоваяНакладнаяЖД.СтанцияОтправления = СтанцияОтправления;
//		НоваяНакладнаяЖД.СтанцияОтправленияКод = КодСтОтправления;
//		НоваяНакладнаяЖД.СтанцияНазначения = СтанцияПрибытия;
//		НоваяНакладнаяЖД.СтанцияНазначенияКод = КодСтНазначения;
//		НоваяНакладнаяЖД.СтанцияНазначенияНаименование = НоваяНакладнаяЖД.СтанцияНазначения;
//		НоваяНакладнаяЖД.СтанцияОтправленияНаименование = НоваяНакладнаяЖД.СтанцияОтправления;
//		
//		НоваяНакладнаяЖД.ГрузополучательОКПО = ГрузополучательОКПО;
//		_ГП = Справочники.э_ПаспортаОрганизаций.НайтиПоРеквизиту("ОКПО", ГрузополучательОКПО);
//		НоваяНакладнаяЖД.Грузополучатель = _ГП;
//		НоваяНакладнаяЖД.ГрузополучательНаименование = _ГП;
//		
//		НоваяНакладнаяЖД.ГрузоотправительОКПО = ГрузоотправительОКПО;
//		_ГО = Справочники.э_ПаспортаОрганизаций.НайтиПоРеквизиту("ОКПО", ГрузоотправительОКПО);
//		НоваяНакладнаяЖД.Грузоотправитель = _ГО;
//		НоваяНакладнаяЖД.ГрузоотправительНаименование = _ГО;
//		
//		Если НЕ ЗначениеЗаполнено(НоваяНакладнаяЖД.ТекущееСостояниеНакладной) Тогда
//			НоваяНакладнаяЖД.ТекущееСостояниеНакладной = Справочники.э_СостоянияДокументов.НайтиПоКоду(4);
//		КонецЕсли;
//		
//		Если ПровознаяПлата <> "000000.00" Тогда
//			Если НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.НайтиСтроки(Новый Структура("НомерВагона, НомерКонтейнера", НомерВагона, НомерКТК)).Количество() = 0 Тогда
//				НСтрПлата = НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.Добавить();
//				НСтрПлата.НомерВагона = НомерВагона;
//				НСтрПлата.НомерКонтейнера = НомерКТК;
//				НСтрПлата.СуммаВРублях = Число(ПровознаяПлата);
//				НСтрПлата.ВалютаИД = КодВалюты;
//				Если КодВалюты = "0" Тогда
//					НСтрПлата.ВалютаНаименование = "Российские рубли";
//				ИначеЕсли КодВалюты = "1" Тогда
//					НСтрПлата.ВалютаНаименование = "Сантимы";
//				ИначеЕсли КодВалюты = "2" Тогда
//					НСтрПлата.ВалютаНаименование = "Центы";
//				ИначеЕсли КодВалюты = "3" Тогда
//					НСтрПлата.ВалютаНаименование = "Казахстанские тенге";
//				ИначеЕсли КодВалюты = "4" Тогда
//					НСтрПлата.ВалютаНаименование = "Украинские гривны";
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если КодЕТСНГ <> "00000" ИЛИ КодГНГ <> "000000" Тогда
//			
//			Если КодГНГ <> "000000" Тогда
//				
//				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодГНГ", НомерКТК, КодГНГ)).Количество() = 0 Тогда
//					НСтрГруз = НоваяНакладнаяЖД.Грузы.Добавить();
//					НСтрГруз.НомерКонтейнера = НомерКТК;
//					НСтрГруз.ВесНетто = ФактВесГруза;
//					НСтрГруз.КодГНГ = КодГНГ;
//					НСтрГруз.КодЕТСНГ = КодЕТСНГ;
//				КонецЕсли;
//				
//				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодГНГ", КодГНГ)).Количество() = 0 Тогда
//					ГрузЖД = НоваяНакладнаяЖД.ГрузыЖД.Добавить();
//					ГрузЖД.КодГНГ = КодГНГ;
//					ГрузЖД.КодЕТСНГ = КодЕТСНГ;
//					ГрузЖД.МассаГруза = ФактВесГруза;
//				КонецЕсли;
//			
//			ИначеЕсли КодЕТСНГ <> "00000" Тогда
//				
//				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодЕТСНГ", НомерКТК, КодЕТСНГ)).Количество() = 0 Тогда
//					НСтрГруз = НоваяНакладнаяЖД.Грузы.Добавить();
//					НСтрГруз.НомерКонтейнера = НомерКТК;
//					НСтрГруз.ВесНетто = ФактВесГруза;
//					НСтрГруз.КодГНГ = КодГНГ;
//					НСтрГруз.КодЕТСНГ = КодЕТСНГ;
//				КонецЕсли;
//				
//				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодЕТСНГ", КодЕТСНГ)).Количество() = 0 Тогда
//					ГрузЖД = НоваяНакладнаяЖД.ГрузыЖД.Добавить();
//					ГрузЖД.КодГНГ = КодГНГ;						
//					ГрузЖД.КодЕТСНГ = КодЕТСНГ;
//					ГрузЖД.МассаГруза = ФактВесГруза;
//				КонецЕсли;
//				
//			КонецЕсли;		
//			
//		КонецЕсли;
//		
//		// Евросиб Фролов (26.04.2022
//		// Перенес в попытку
//		//НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Запись);
//		// Евросиб Фролов)
//		Попытка
//			НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Запись); // Евросиб Фролов (26.04.2022
//			НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			ОО = ОписаниеОшибки();
//			Сообщить("Ошибка проведения ЖДН ГВЦ: "+ОО);
//			// Евросиб Фролов (26.04.2022
//			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
//			МассивСообщений.Добавить("Ошибка при проведении ЖДН ГВЦ в рег. задании ""Загрузка накладных ГВЦ"". " + НоваяНакладнаяЖД.Ссылка + ": " + ПредставлениеОшибки);
//			ЗаписьЖурналаРегистрации("ЗагрузкаНакладныхГВЦ.Проведение ЖДН ГВЦ", УровеньЖурналаРегистрации.Ошибка,, НоваяНакладнаяЖД.Ссылка, ПредставлениеОшибки);
//			// Евросиб Фролов)
//		КонецПопытки;
//		
////2	Количество вагонов/ контейнеров
////1	Принадлежность вагона:
////1 – МПС;
////2 – собственный

////11	Номер контейнера

////1	Принадлежность контейнера:
////1 – МПС;
////2 – собственный

////2	Грузоподъёмность вагона/контейнера
////8	Номер накладной

////2	День отправки
////2	Месяц отправки
////2	День прибытия
////2	Месяц прибытия
////2	Отчетный месяц.

////8	Фактический вес груза (кг)

////1	Признак маршрута:
////0 – маршрут;
////1 – не маршрут

////1	Вид перевозки:
////1 – экспорт (из России в 3-и страны, из СНГ в 3-и страны);
////2 – импорт (из 3-х стран в СНГ, в том числе в Россию);
////3 – транзит (из 3-их в 3-и страны через Россию);
////4 – межгосударственная перевозка (страны СНГ)
////5 – внутрироссийская перевозка

////5	Код станции отправления
////5	Код станции назначения

////5	Код заграничной станции назначения
////5	Код пограничной станции отправления
////5	Код груза по ЕТСНГ
////6	Код груза по ГНГ

////4	Код исключительного тарифа (из накладной)
////1	Код валюты:
////  0 – рубли;
////  1 – сантимы;
////  2 – центы ; 3- казахи; 4- украина
////8	Провозная плата
////1	Признак исключения:
////0 – новая строка факта;
////1 – данная строка факта заменяет ранее принятую
////1	 Признак записи:
//// 0 – длинная;
//// 1 – короткая
////8	Грузополучатель ОКПО
////4	Грузополучатель в АСУ ОП
////8	Грузоотправитель ОКПО
////4	Грузоотправитель в АСУ ОП

//		
//	КонецЦикла;

//	// Евросиб Фролов (26.04.2022
//	Если МассивСообщений.Количество() > 0 Тогда
//		Тема = "Рег. задание: Загрузка накладных ГВЦ";
//		ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
//					|" + СтрСоединить(МассивСообщений, Символы.ПС);
//		РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаНакладныхГВЦ);
//	КонецЕсли;
//	// Евросиб Фролов)
//	
//	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
//		КаталогПереноса = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КаталогРасположенияНакладныхГВЦ");
//		ПереместитьФайл(ИмяФайла, СтрЗаменить(ИмяФайла, КаталогПереноса, КаталогПереноса +"successes\"));
//	КонецЕсли; 
//	
//КонецПроцедуры

//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало
Процедура ЗагрузитьНакладнуюГВЦ(ИмяФайла, КодировкаТекста)
	
	ЧТ = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста);
	ТекстФ = ЧТ.Прочитать();
	ЧТ.Закрыть();   
	
	РаздМассив = СтрРазделить(ТекстФ, Символы.ПС);
	
	// Евросиб Фролов (26.04.2022
	МассивСообщений = Новый Массив;
	// Евросиб Фролов)
	
	ТипСтрока11 = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11));
	ТипСтрока8 = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(8));
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, начало
	ТипСтрока10 = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(э_ОбщиеСервер.ДлинаНомераНакладной()));
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, конец

	ТаблицаДанныхИзФайла = Новый ТаблицаЗначений;
	ТаблицаДанныхИзФайла.Колонки.Добавить("НомерНакладной",ТипСтрока8);
	ТаблицаДанныхИзФайла.Колонки.Добавить("ДеньОтправки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("МесяцОтправки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ВремяОтправленияЧасы");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ВремяОтправленияМинуты");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ДеньПрибытия");
	ТаблицаДанныхИзФайла.Колонки.Добавить("МесяцПрибытия");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГодПрибытия");  
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГодОтправки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ДатаОтправки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодЭкспедитора");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПодкодЭкспедитора");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КатегорияОтправки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КоличествоВагоновКТК");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ОтчетныйМесяц");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ФактВесГруза");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПризнакМаршрута");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ВидПеревозки");
	ТаблицаДанныхИзФайла.Колонки.Добавить("НомерВагона",ТипСтрока8);

	ТаблицаДанныхИзФайла.Колонки.Добавить("ПринадлежностьВагонов");
	ТаблицаДанныхИзФайла.Колонки.Добавить("НомерКТК",ТипСтрока11);
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПринадлежностьКТК");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГрузоподъемностьВагонаКТК");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ДатаПрибытия");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодЗагрСтОтправления");
	
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодЗагрСтНазначения");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодСтОтправления");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодСтНазначения");
	ТаблицаДанныхИзФайла.Колонки.Добавить("СтанцияОтправления");
	ТаблицаДанныхИзФайла.Колонки.Добавить("СтанцияПрибытия");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодЕТСНГ");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодГНГ");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодИсключительногоТарифа");
	ТаблицаДанныхИзФайла.Колонки.Добавить("КодВалюты");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПровознаяПлата");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПризнакИсключения");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ПризнакЗаписи");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГрузополучательОКПО");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГрузополучательАСУ");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГрузоотправительОКПО");
	ТаблицаДанныхИзФайла.Колонки.Добавить("ГрузоотправительАСУ"); 
	//ТаблицаДанныхИзФайла.Колонки.Добавить("УнифицированныйНомерНакладной",ТипСтрока8); 
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, начало
	ТаблицаДанныхИзФайла.Колонки.Добавить("УнифицированныйНомерНакладной",ТипСтрока10);
	//ДИТ, Беляев СЮ, US 80800/TA 81609, 05-03-2024, конец
	
	Для каждого СтрокаФ из РаздМассив Цикл
		Если Не ЗначениеЗаполнено(СтрокаФ) Тогда  
			Продолжить;
		КонецЕсли;
		
		НомерНакладной = Сред(СтрокаФ, 49, 8); // +
		
		Если НомерНакладной = "00000000" Тогда 
			Продолжить;
		КонецЕсли;
		
		ДеньОтправки = Сред(СтрокаФ, 57, 2); // +
		МесяцОтправки = Сред(СтрокаФ, 59, 2); // +
		ВремяОтправленияЧасы = "00";
		ВремяОтправленияМинуты = "00";
		ДеньПрибытия = "01";
		МесяцПрибытия = "01";
		ГодПрибытия = "0001";
		Если СтрНайти(ИмяФайла,"inv_sending") Тогда
			ВремяОтправленияЧасы = Сред(СтрокаФ, 61, 2); // +
			ВремяОтправленияМинуты = Сред(СтрокаФ, 63, 2); // +
		Иначе
			ДеньПрибытия = Сред(СтрокаФ, 61, 2); // +
			МесяцПрибытия = Сред(СтрокаФ, 63, 2); // +
			ГодПрибытия = Формат(?(Число(МесяцПрибытия) > Месяц(ТекущаяДата()), Год(ТекущаяДата())-1, Год(ТекущаяДата())),"ЧГ="); // +
		КонецЕсли; 
		ГодОтправки = Формат(?(Число(МесяцОтправки) > Месяц(ТекущаяДата()), Год(ТекущаяДата())-1, Год(ТекущаяДата())),"ЧГ="); // +
		ДатаОтправки = Дата(ГодОтправки+МесяцОтправки+ДеньОтправки+ВремяОтправленияЧасы+ВремяОтправленияМинуты); // +
			
		КодЭкспедитора = Сред(СтрокаФ, 1, 10); // -
		
		ПодкодЭкспедитора = Сред(СтрокаФ, 11, 12); // -
				
		КатегорияОтправки = Сред(СтрокаФ, 31, 1); // -
		
		КоличествоВагоновКТК = Сред(СтрокаФ, 32, 2); // -
		
		ОтчетныйМесяц = Сред(СтрокаФ, 65, 2); // -
		
		ФактВесГруза = Сред(СтрокаФ, 67, 8); // -
		
		Попытка
			ФактВесГруза = Число(ФактВесГруза);
		Исключение
			ОО = ОписаниеОшибки();
			Сообщить("Ошибка преобразования веса груза: " + ФактВесГруза + " " + ОО);
		КонецПопытки;
		
		ПризнакМаршрута = Сред(СтрокаФ, 75, 1); // -
		
		ВидПеревозки = Сред(СтрокаФ, 76, 1); // -
		
		
		НомерВагона = Сред(СтрокаФ, 23, 8); // +
		ПринадлежностьВагонов = Сред(СтрокаФ, 34, 1); // +
		НомерКТК = Сред(СтрокаФ, 35, 11); // +
		ПринадлежностьКТК = Сред(СтрокаФ, 46, 1); // +
		ГрузоподъемностьВагонаКТК = Сред(СтрокаФ, 47, 2); // +
		
		ДатаПрибытия = Дата(ГодПрибытия+МесяцПрибытия+ДеньПрибытия); // +
		КодЗагрСтОтправления = Сред(СтрокаФ, 87, 5); // +
		КодЗагрСтНазначения = Сред(СтрокаФ, 92, 5); // +
		КодСтОтправления = Сред(СтрокаФ, 77, 5); // +
		КодСтНазначения = Сред(СтрокаФ, 82, 5); // +
		
		СтанцияОтправления = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(КодСтОтправления); // +
		СтанцияПрибытия = Локации_сервер.НайтиСтанциюЭТРАНПоНеполномуКоду(КодСтНазначения); // +
		
		КодЕТСНГ = Сред(СтрокаФ, 97, 5);
		КодГНГ = Сред(СтрокаФ, 102, 6);
		КодИсключительногоТарифа = Сред(СтрокаФ, 108, 4);
		
		КодВалюты = Сред(СтрокаФ, 112, 1); // +
		//ПровознаяПлата = Сред(СтрокаФ, 113, 8); // +
		ПровознаяПлата = Сред(СтрокаФ, 113, 6) + "." + Сред(СтрокаФ, 119, 2);
		
		ПризнакИсключения = Сред(СтрокаФ, 121, 1);
		ПризнакЗаписи = Сред(СтрокаФ, 122, 1);
		
		ГрузополучательОКПО = Сред(СтрокаФ, 123, 8); // +
		ГрузополучательАСУ = Сред(СтрокаФ, 131, 4); // -
		ГрузоотправительОКПО = Сред(СтрокаФ, 135, 8); // +
		ГрузоотправительАСУ = Сред(СтрокаФ, 143, 4); // -
		
		СтрокаТаблицы = ТаблицаДанныхИзФайла.Добавить();
		СтрокаТаблицы.НомерНакладной = НомерНакладной;
		СтрокаТаблицы.ДеньОтправки = ДеньОтправки;
		СтрокаТаблицы.МесяцОтправки = МесяцОтправки;
		СтрокаТаблицы.ВремяОтправленияЧасы = ВремяОтправленияЧасы;
		СтрокаТаблицы.ВремяОтправленияМинуты = ВремяОтправленияМинуты;
		СтрокаТаблицы.ДеньПрибытия = ДеньПрибытия;
		СтрокаТаблицы.МесяцПрибытия = МесяцПрибытия;
		СтрокаТаблицы.ГодПрибытия = ГодПрибытия;
		СтрокаТаблицы.ГодОтправки = ГодОтправки;
		СтрокаТаблицы.ДатаОтправки = ДатаОтправки;
		СтрокаТаблицы.КодЭкспедитора = КодЭкспедитора;
		СтрокаТаблицы.ПодкодЭкспедитора = ПодкодЭкспедитора;
		СтрокаТаблицы.КатегорияОтправки = КатегорияОтправки;
		СтрокаТаблицы.КоличествоВагоновКТК = КоличествоВагоновКТК;
		СтрокаТаблицы.ОтчетныйМесяц = ОтчетныйМесяц;
		СтрокаТаблицы.ФактВесГруза = ФактВесГруза;
		СтрокаТаблицы.ПризнакМаршрута = ПризнакМаршрута;
		СтрокаТаблицы.ВидПеревозки = ВидПеревозки;
		СтрокаТаблицы.НомерВагона = НомерВагона;
		СтрокаТаблицы.ПринадлежностьВагонов = ПринадлежностьВагонов;
		СтрокаТаблицы.НомерКТК = НомерКТК;
		СтрокаТаблицы.ПринадлежностьКТК = ПринадлежностьКТК;
		СтрокаТаблицы.ГрузоподъемностьВагонаКТК = ГрузоподъемностьВагонаКТК;
		СтрокаТаблицы.ДатаПрибытия = ДатаПрибытия;
		СтрокаТаблицы.КодЗагрСтОтправления = КодЗагрСтОтправления;
		СтрокаТаблицы.КодЗагрСтНазначения = КодЗагрСтНазначения;
		СтрокаТаблицы.КодСтОтправления = КодСтОтправления;
		СтрокаТаблицы.КодСтНазначения = КодСтНазначения;
		СтрокаТаблицы.СтанцияОтправления = СтанцияОтправления;
		СтрокаТаблицы.СтанцияПрибытия = СтанцияПрибытия;
		СтрокаТаблицы.КодЕТСНГ = КодЕТСНГ;
		СтрокаТаблицы.КодГНГ = КодГНГ;
		СтрокаТаблицы.КодИсключительногоТарифа = КодИсключительногоТарифа;
		СтрокаТаблицы.КодВалюты = КодВалюты;
		СтрокаТаблицы.ПровознаяПлата = ПровознаяПлата;
		СтрокаТаблицы.ПризнакИсключения = ПризнакИсключения;
		СтрокаТаблицы.ПризнакЗаписи = ПризнакЗаписи;
		СтрокаТаблицы.ГрузополучательОКПО = ГрузополучательОКПО;
		СтрокаТаблицы.ГрузополучательАСУ = ГрузополучательАСУ;
		СтрокаТаблицы.ГрузоотправительОКПО = ГрузоотправительОКПО;
		СтрокаТаблицы.ГрузоотправительАСУ = ГрузоотправительАСУ; 
		СтрокаТаблицы.УнифицированныйНомерНакладной = э_ОбщиеСервер.ПолучитьУнифицированныйНомерНакладной(НомерНакладной);
		
		//2	Количество вагонов/ контейнеров
		//1	Принадлежность вагона:
		//1 – МПС;
		//2 – собственный

		//11	Номер контейнера

		//1	Принадлежность контейнера:
		//1 – МПС;
		//2 – собственный

		//2	Грузоподъёмность вагона/контейнера
		//8	Номер накладной

		//2	День отправки
		//2	Месяц отправки
		//2	День прибытия
		//2	Месяц прибытия
		//2	Отчетный месяц.

		//8	Фактический вес груза (кг)

		//1	Признак маршрута:
		//0 – маршрут;
		//1 – не маршрут

		//1	Вид перевозки:
		//1 – экспорт (из России в 3-и страны, из СНГ в 3-и страны);
		//2 – импорт (из 3-х стран в СНГ, в том числе в Россию);
		//3 – транзит (из 3-их в 3-и страны через Россию);
		//4 – межгосударственная перевозка (страны СНГ)
		//5 – внутрироссийская перевозка

		//5	Код станции отправления
		//5	Код станции назначения

		//5	Код заграничной станции назначения
		//5	Код пограничной станции отправления
		//5	Код груза по ЕТСНГ
		//6	Код груза по ГНГ

		//4	Код исключительного тарифа (из накладной)
		//1	Код валюты:
		//  0 – рубли;
		//  1 – сантимы;
		//  2 – центы ; 3- казахи; 4- украина
		//8	Провозная плата
		//1	Признак исключения:
		//0 – новая строка факта;
		//1 – данная строка факта заменяет ранее принятую
		//1	 Признак записи:
		// 0 – длинная;
		// 1 – короткая
		//8	Грузополучатель ОКПО
		//4	Грузополучатель в АСУ ОП
		//8	Грузоотправитель ОКПО
		//4	Грузоотправитель в АСУ ОП
		
	КонецЦикла;
	
	
	УбратьИзТаблицыНакладныеПоДаннымЭТРАН(ТаблицаДанныхИзФайла);
	//ДИТ Шевченко А.В. 55332 10.08.2022 -начало
	МассивНакладныхДляПометкиНаУдаление = Новый Массив;
	НайтиИПерезаполнитьНакладныеЭТРАНБезВагонов(ТаблицаДанныхИзФайла,МассивСообщений,МассивНакладныхДляПометкиНаУдаление);
	//ДИТ Шевченко А.В. 55332 10.08.2022 -конец
	
	МассивНакладныхВФайле = ТаблицаДанныхИзФайла.ВыгрузитьКолонку("УнифицированныйНомерНакладной");
	МассивНакладныхВФайле = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивНакладныхВФайле);
	Для Каждого ЭлементМассива Из МассивНакладныхВФайле Цикл
		ОбработатьНакладную(ЭлементМассива, ТаблицаДанныхИзФайла, МассивСообщений,МассивНакладныхДляПометкиНаУдаление);		
	КонецЦикла; 
	
	// Евросиб Фролов (26.04.2022
	Если МассивСообщений.Количество() > 0 Тогда
		Тема = "Рег. задание: Загрузка накладных ГВЦ";
		ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
					|" + СтрСоединить(МассивСообщений, Символы.ПС);
		РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаНакладныхГВЦ);
	КонецЕсли;
	// Евросиб Фролов)
	
	Если Не ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		КаталогПереноса = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КаталогРасположенияНакладныхГВЦ");
		ПереместитьФайл(ИмяФайла, СтрЗаменить(ИмяФайла, КаталогПереноса, КаталогПереноса +"successes\"));
	КонецЕсли; 
	
КонецПроцедуры     
//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец

//ДИТ Шевченко А.В. 55332 10.08.2022 -начало
Процедура НайтиИПерезаполнитьНакладныеЭТРАНБезВагонов(ТаблицаДанныхИзФайла,МассивСообщений,МассивНакладныхДляПометкиНаУдаление)
	
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДляОбработки.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной,
	|	ТаблицаДляОбработки.НомерНакладной КАК НомерНакладной,
	|	ТаблицаДляОбработки.НомерВагона КАК НомерВагона,
	|	ТаблицаДляОбработки.НомерКТК КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТ_ТаблицаДляОбработки
	|ИЗ
	|	&ТаблицаДляОбработки КАК ТаблицаДляОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаДляОбработки.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной,
	|	ВТ_ТаблицаДляОбработки.НомерНакладной КАК НомерНакладной,
	|	ВТ_ТаблицаДляОбработки.НомерВагона КАК НомерВагона,
	|	ВТ_ТаблицаДляОбработки.НомерКонтейнера КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТНакладныеЭтран
	|ИЗ
	|	Документ.э_Накладная КАК э_Накладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДляОбработки КАК ВТ_ТаблицаДляОбработки
	|		ПО э_Накладная.УнифицированныйНомерНакладной = ВТ_ТаблицаДляОбработки.УнифицированныйНомерНакладной
	|ГДЕ
	|	э_Накладная.ИсточникНакладной = &ЭТРАН
	|	И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус
	|	И НЕ э_Накладная.ПометкаУдаления
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, начало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТНакладныеЭтран.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТНакладныеЭтранСВагонами
	|ИЗ
	|	ВТНакладныеЭтран КАК ВТНакладныеЭтран
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоныЗаполнены
	|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяВагоныЗаполнены.Ссылка
	|			И (э_НакладнаяВагоныЗаполнены.НомерВагона <> """")
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладныеЭтран.Ссылка КАК Ссылка,
	|	ВТНакладныеЭтран.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной,
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, начало
	|	ВЫБОР
	|		КОГДА ВТНакладныеЭтранСВагонами.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНомераВагоновВНакладной
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, конец
	|ИЗ
	|	ВТНакладныеЭтран КАК ВТНакладныеЭтран
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяВагоны.Ссылка
	|			И (э_НакладнаяВагоны.НомерВагона = ВТНакладныеЭтран.НомерВагона)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяКонтейнеры.Ссылка
	|			И (э_НакладнаяКонтейнеры.НомерКонтейнера = ВТНакладныеЭтран.НомерКонтейнера)
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, начало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакладныеЭтранСВагонами КАК ВТНакладныеЭтранСВагонами
	|		ПО ВТНакладныеЭтран.Ссылка = ВТНакладныеЭтранСВагонами.Ссылка
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, конец
	|ГДЕ
	|	э_НакладнаяВагоны.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНакладныеЭтран.УнифицированныйНомерНакладной,
	|	ВТНакладныеЭтран.Ссылка,
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, начало
	|	ВЫБОР
	|		КОГДА ВТНакладныеЭтранСВагонами.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, конец
	
	Запрос.УстановитьПараметр("ЭТРАН", Перечисления.ИсточникЖДН.ЭТРАН);
	Запрос.УстановитьПараметр("ТаблицаДляОбработки", ТаблицаДанныхИзФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, начало
		Если Выборка.ЕстьНомераВагоновВНакладной Тогда
			МассивНакладныхДляПометкиНаУдаление.Добавить(Выборка.УнифицированныйНомерНакладной);
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 80970/ TA 81089, 27-02-2024, конец
		
		НакладнаяЭТРАН = Выборка.Ссылка.ПолучитьОбъект();
		Отбор = Новый Структура;
		Отбор.Вставить("УнифицированныйНомерНакладной", Выборка.УнифицированныйНомерНакладной);
		СтрокиПоНакладной = ТаблицаДанныхИзФайла.НайтиСтроки(Отбор);
			
		НомерВагонаВНакладной = 0; //ДИТ Шевченко А.В. 55599 17.01.23
		СоответсвиеНомераВагонов = Новый Соответствие;
		Для Каждого СтрокаПоНакладной Из СтрокиПоНакладной Цикл  
			Если СтрокаПоНакладной.НомерВагона <> "00000000" Тогда
				МассивКонтейнеров = НакладнаяЭТРАН.Контейнеры.НайтиСтроки(Новый Структура("НомерКонтейнера", СтрокаПоНакладной.НомерКТК)); //ДИТ Шевченко А.В. 55599 17.01.23
				Если НакладнаяЭТРАН.Вагоны.НайтиСтроки(Новый Структура("НомерВагона", СтрокаПоНакладной.НомерВагона)).Количество() = 0 Тогда
					
					СтруктураПоиска = Новый Структура("НомерВагона","");
					МассвиСтрокПустыхВагонов = НакладнаяЭТРАН.Вагоны.НайтиСтроки(СтруктураПоиска);
					
					Если МассвиСтрокПустыхВагонов.Количество() > 0 Тогда
						МассвиСтрокПустыхВагонов[0].НомерВагона	= СтрокаПоНакладной.НомерВагона;
					    МассвиСтрокПустыхВагонов[0].ТипСобственностиИД = СтрокаПоНакладной.ПринадлежностьВагонов;
						МассвиСтрокПустыхВагонов[0].ТипСобственностиНаименование = ?(СтрокаПоНакладной.ПринадлежностьВагонов = "1", "МПС", "Собственный");
						//МассвиСтрокПустыхВагонов[0].МассыВКгНетто = СтрокаПоНакладной.ФактВесГруза;
						//ДИТ Шевченко А.В. 55599 17.01.23 -начало
						НомерВагонаВНакладной = НомерВагонаВНакладной + 1;
						МассвиСтрокПустыхВагонов[0].ПорядковыйНомерВагонаВОтправке = НомерВагонаВНакладной;
						
						Если МассивКонтейнеров.Количество() > 0 Тогда
							МассивКонтейнеров[0].НомерВагонаДляКонтейнерногоПоезда = НомерВагонаВНакладной;	
						КонецЕсли;
						СоответсвиеНомераВагонов.Вставить(СтрокаПоНакладной.НомерВагона,НомерВагонаВНакладной);
						//ДИТ Шевченко А.В. 55599 17.01.23 -конец
						Продолжить;
					КонецЕсли;	
					
					СтрокаВагон = НакладнаяЭТРАН.Вагоны.Добавить();
					СтрокаВагон.НомерВагона = СтрокаПоНакладной.НомерВагона;
					СтрокаВагон.ТипСобственностиИД = СтрокаПоНакладной.ПринадлежностьВагонов;
					СтрокаВагон.ТипСобственностиНаименование = ?(СтрокаПоНакладной.ПринадлежностьВагонов = "1", "МПС", "Собственный");
					//СтрокаВагон.МассыВКгНетто = СтрокаПоНакладной.ФактВесГруза;
					//ДИТ Шевченко А.В. 55599 17.01.23 -начало
					НомерВагонаВНакладной = НомерВагонаВНакладной + 1;
					СтрокаВагон.ПорядковыйНомерВагонаВОтправке = НомерВагонаВНакладной;
					Если МассивКонтейнеров.Количество() > 0 Тогда
						МассивКонтейнеров[0].НомерВагонаДляКонтейнерногоПоезда = НомерВагонаВНакладной;	
					КонецЕсли;
					СоответсвиеНомераВагонов.Вставить(СтрокаПоНакладной.НомерВагона,НомерВагонаВНакладной);
				Иначе
					Если СоответсвиеНомераВагонов.Получить(СтрокаПоНакладной.НомерВагона) <> Неопределено Тогда
						Если МассивКонтейнеров.Количество() > 0 Тогда
							МассивКонтейнеров[0].НомерВагонаДляКонтейнерногоПоезда = СоответсвиеНомераВагонов.Получить(СтрокаПоНакладной.НомерВагона);
						КонецЕсли;
					КонецЕсли;
					//ДИТ Шевченко А.В. 55599 17.01.23 -конец
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			НакладнаяЭТРАН.Записать(РежимЗаписиДокумента.Запись);
			НакладнаяЭТРАН.Записать(РежимЗаписиДокумента.Проведение);
			МассивНакладныхДляПометкиНаУдаление.Добавить(Выборка.УнифицированныйНомерНакладной);
		Исключение
			ОО = ОписаниеОшибки();
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
			МассивСообщений.Добавить("Ошибка при проведении ЖДН ЭТРАН в рег. задании ""Загрузка накладных ГВЦ"". " + НакладнаяЭТРАН.Ссылка + ": " + ПредставлениеОшибки);
			ЗаписьЖурналаРегистрации("ЗагрузкаНакладныхГВЦ.Проведение ЖДН ЭТРАН", УровеньЖурналаРегистрации.Ошибка,, НакладнаяЭТРАН.Ссылка, ПредставлениеОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
//ДИТ Шевченко А.В. 55332 10.08.2022 -конец

//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало
Процедура УбратьИзТаблицыНакладныеПоДаннымЭТРАН(ТаблицаДанныхИзФайла)
	ПустойНомерКТК = "00000000000"; //11 знаков  - примеров в файлах данных не было, установлено из предположения
	МассивНакладныхНаУдаление = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДляОбработки.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной,
	|	ТаблицаДляОбработки.НомерНакладной КАК НомерНакладной,
	|	ТаблицаДляОбработки.НомерВагона КАК НомерВагона,
	|	ТаблицаДляОбработки.НомерКТК КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТ_ТаблицаДляОбработки
	|ИЗ
	|	&ТаблицаДляОбработки КАК ТаблицаДляОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_Накладная.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаДляОбработки.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной,
	|	ВТ_ТаблицаДляОбработки.НомерНакладной КАК НомерНакладной,
	|	ВТ_ТаблицаДляОбработки.НомерВагона КАК НомерВагона,
	|	ВТ_ТаблицаДляОбработки.НомерКонтейнера КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТНакладныеЭтран
	|ИЗ
	|	Документ.э_Накладная КАК э_Накладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДляОбработки КАК ВТ_ТаблицаДляОбработки
	|		ПО (э_Накладная.УнифицированныйНомерНакладной = ВТ_ТаблицаДляОбработки.УнифицированныйНомерНакладной)
	|ГДЕ
	|	э_Накладная.ИсточникНакладной = &ЭТРАН
	|	И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус
	|	И НЕ э_Накладная.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНакладныеЭтран.Ссылка КАК Ссылка,
	|	ВТНакладныеЭтран.УнифицированныйНомерНакладной КАК УнифицированныйНомерНакладной
	|ИЗ
	|	ВТНакладныеЭтран КАК ВТНакладныеЭтран
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяВагоны.Ссылка
	|			И (э_НакладнаяВагоны.НомерВагона = ВТНакладныеЭтран.НомерВагона)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ПО ВТНакладныеЭтран.Ссылка = э_НакладнаяКонтейнеры.Ссылка
	|			И (э_НакладнаяКонтейнеры.НомерКонтейнера = ВТНакладныеЭтран.НомерКонтейнера)
	|ГДЕ
	|	(ВТНакладныеЭтран.НомерКонтейнера = &ПустойНомерКТК
	|			ИЛИ НЕ э_НакладнаяКонтейнеры.Ссылка ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ЭТРАН", Перечисления.ИсточникЖДН.ЭТРАН);
	Запрос.УстановитьПараметр("ТаблицаДляОбработки", ТаблицаДанныхИзФайла);
	Запрос.УстановитьПараметр("ПустойНомерКТК", ПустойНомерКТК);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл    
		МассивНакладныхНаУдаление.Добавить(Выборка.УнифицированныйНомерНакладной); //Есть аналогичная ЖДН из ЭТРАН, загрузка не требуется    
	КонецЦикла;
	
	//УДАЛЕНИЕ ЛИШНИХ СТРОК
	Для Каждого ЭлементМассива Из МассивНакладныхНаУдаление Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("УнифицированныйНомерНакладной",ЭлементМассива);
		НайденныеСтроки = ТаблицаДанныхИзФайла.НайтиСтроки(Отбор);
		Для Каждого СтрТЗ из НайденныеСтроки Цикл
			ТаблицаДанныхИзФайла.Удалить(СтрТЗ);
		КонецЦикла;
	КонецЦикла; 
КонецПроцедуры    
//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец

//ДИТ, Беляев СЮ, TA51481, 03-06-2022, начало
Процедура ОбработатьНакладную(УнифицированныйНомерНакладной, ТаблицаДанныхИзФайла, МассивСообщений,МассивНакладныхДляПометкиНаУдаление)  
	
	// производим поиск и заполнение ЖДН	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	э_Накладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.э_Накладная КАК э_Накладная
	|ГДЕ
	|	НЕ э_Накладная.ПометкаУдаления
	|	И э_Накладная.УнифицированныйНомерНакладной = &УнифицированныйНомерНакладной
	|	И э_Накладная.ИсточникНакладной = &ГВЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	э_Накладная.Дата УБЫВ";
	Запрос.УстановитьПараметр("УнифицированныйНомерНакладной", УнифицированныйНомерНакладной);
	Запрос.УстановитьПараметр("ГВЦ", Перечисления.ИсточникЖДН.ГВЦ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		НоваяНакладнаяЖД = Ответ.Ссылка.ПолучитьОбъект();
		//++ [US 58841] Denis Isadchenko, 07.03.2023
		РанееЗагружен = Истина;
		//-- [US 58841] Denis Isadchenko, 07.03.2023
	Иначе
		НоваяНакладнаяЖД = Документы.э_Накладная.СоздатьДокумент();
		//++ [US 58841] Denis Isadchenko, 07.03.2023
		РанееЗагружен = Ложь;
		//-- [US 58841] Denis Isadchenko, 07.03.2023
	КонецЕсли;
	
	НоваяНакладнаяЖД.ИсточникНакладной = Перечисления.ИсточникЖДН.ГВЦ;
	НоваяНакладнаяЖД.Дата = ТекущаяДата();
		
	Отбор = Новый Структура;
	Отбор.Вставить("УнифицированныйНомерНакладной", УнифицированныйНомерНакладной);
	СтрокиПоНакладной = ТаблицаДанныхИзФайла.НайтиСтроки(Отбор);
	
	//ДИТ Шевченко А.В. 55599 17.01.23 -начало
	НомерВагонаВНакладной = 0;
	СоответсвиеНомераВагонов = Новый Соответствие;
	//ДИТ Шевченко А.В. 55599 17.01.23 -конец
	
	//ДИТ Давудов М.А. 0310599 23.05.23 -начало
	Для Каждого СтрокаПоНакладной Из СтрокиПоНакладной Цикл
		Если СтрокаПоНакладной.НомерВагона <> "00000000" Тогда
			Если НоваяНакладнаяЖД.Вагоны.НайтиСтроки(Новый Структура("НомерВагона", СтрокаПоНакладной.НомерВагона)).Количество() = 0 Тогда
				Если НоваяНакладнаяЖД.Вагоны.Количество() > 0 Тогда
					НоваяНакладнаяЖД.Вагоны.Очистить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПоНакладной.НомерКТК <> "00000000000" Тогда
			Если НоваяНакладнаяЖД.Контейнеры.НайтиСтроки(Новый Структура("НомерКонтейнера", СтрокаПоНакладной.НомерКТК)).Количество() = 0 Тогда
				Если НоваяНакладнаяЖД.Контейнеры.Количество() > 0 Тогда
					НоваяНакладнаяЖД.Контейнеры.Очистить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПоНакладной.ПровознаяПлата <> "000000.00" Тогда
			Если НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.НайтиСтроки(Новый Структура("НомерВагона, НомерКонтейнера", СтрокаПоНакладной.НомерВагона, СтрокаПоНакладной.НомерКТК)).Количество() = 0 Тогда
				Если НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.Количество() > 0 Тогда
					НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.Очистить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПоНакладной.КодЕТСНГ <> "00000" ИЛИ СтрокаПоНакладной.КодГНГ <> "000000" Тогда
			Если СтрокаПоНакладной.КодГНГ <> "000000" Тогда
				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодГНГ", СтрокаПоНакладной.НомерКТК, СтрокаПоНакладной.КодГНГ)).Количество() = 0 Тогда
					Если НоваяНакладнаяЖД.Грузы.Количество() > 0 Тогда
						НоваяНакладнаяЖД.Грузы.Очистить();
					КонецЕсли;
				КонецЕсли;
				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодГНГ", СтрокаПоНакладной.КодГНГ)).Количество() = 0 Тогда
					Если НоваяНакладнаяЖД.ГрузыЖД.Количество() > 0 Тогда
						НоваяНакладнаяЖД.ГрузыЖД.Очистить();
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаПоНакладной.КодЕТСНГ <> "00000" Тогда
				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодЕТСНГ", СтрокаПоНакладной.НомерКТК, СтрокаПоНакладной.КодЕТСНГ)).Количество() = 0 Тогда
					Если НоваяНакладнаяЖД.Грузы.Количество() > 0 Тогда
						НоваяНакладнаяЖД.Грузы.Очистить();
					КонецЕсли;
				КонецЕсли;
				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодЕТСНГ", СтрокаПоНакладной.КодЕТСНГ)).Количество() = 0 Тогда
					Если НоваяНакладнаяЖД.ГрузыЖД.Количество() > 0 Тогда
						НоваяНакладнаяЖД.ГрузыЖД.Очистить();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//ДИТ Давудов М.А. 0310599 23.05.23 -конец
	
	Для Каждого СтрокаПоНакладной Из СтрокиПоНакладной Цикл  
		НоваяНакладнаяЖД.Номер = СтрокаПоНакладной.НомерНакладной;
		НоваяНакладнаяЖД.НакладнаяНомер = СтрокаПоНакладной.НомерНакладной;
		Если СтрокаПоНакладной.НомерВагона <> "00000000" Тогда
			Если НоваяНакладнаяЖД.Вагоны.НайтиСтроки(Новый Структура("НомерВагона", СтрокаПоНакладной.НомерВагона)).Количество() = 0 Тогда
				СтрокаВагон = НоваяНакладнаяЖД.Вагоны.Добавить();
				СтрокаВагон.НомерВагона = СтрокаПоНакладной.НомерВагона;
				СтрокаВагон.ТипСобственностиИД = СтрокаПоНакладной.ПринадлежностьВагонов;
				СтрокаВагон.ТипСобственностиНаименование = ?(СтрокаПоНакладной.ПринадлежностьВагонов = "1", "МПС", "Собственный");
				СтрокаВагон.МассыВКгНетто = СтрокаПоНакладной.ФактВесГруза;
				//ДИТ Шевченко А.В. 55599 17.01.23 -начало
				НомерВагонаВНакладной = НомерВагонаВНакладной + 1;
				СтрокаВагон.ПорядковыйНомерВагонаВОтправке = НомерВагонаВНакладной;
				СоответсвиеНомераВагонов.Вставить(СтрокаПоНакладной.НомерВагона,НомерВагонаВНакладной);
				//ДИТ Шевченко А.В. 55599 17.01.23 -конец
			КонецЕсли;
		КонецЕсли;
		Если СтрокаПоНакладной.НомерКТК <> "00000000000" Тогда
			Если НоваяНакладнаяЖД.Контейнеры.НайтиСтроки(Новый Структура("НомерКонтейнера", СтрокаПоНакладной.НомерКТК)).Количество() = 0 Тогда
				СтрокаКТК = НоваяНакладнаяЖД.Контейнеры.Добавить();
				//СтрокаКТК.Контейнер = НомерКТК;
				СтрокаКТК.НомерКонтейнера = СтрокаПоНакладной.НомерКТК;
				СтрокаКТК.ТипСобственностиИД = СтрокаПоНакладной.ПринадлежностьКТК;
				СтрокаКТК.ТипСобственностиНаименование = ?(СтрокаПоНакладной.ПринадлежностьКТК = "1", "МПС", "Собственный");
				СтрокаКТК.ГрузоподКонтТн = СтрокаПоНакладной.ГрузоподъемностьВагонаКТК;
				СтрокаКТК.МассыВКгНетто = СтрокаПоНакладной.ФактВесГруза;
				//ДИТ Шевченко А.В. 55599 17.01.23 -начало
				СтрокаКТК.НомерВагонаДляКонтейнерногоПоезда = 0;
				Если СоответсвиеНомераВагонов.Получить(СтрокаПоНакладной.НомерВагона) <> Неопределено Тогда
					СтрокаКТК.НомерВагонаДляКонтейнерногоПоезда = СоответсвиеНомераВагонов.Получить(СтрокаПоНакладной.НомерВагона);
				КонецЕсли;                                                                                                     
				//ДИТ Шевченко А.В. 55599 17.01.23 -конец
			КонецЕсли;
		КонецЕсли;
		НоваяНакладнаяЖД.ДатаИВремяОтправленияГруза = СтрокаПоНакладной.ДатаОтправки;
		НоваяНакладнаяЖД.ДатаИВремяПрибытияГруза = СтрокаПоНакладной.ДатаПрибытия;
		НоваяНакладнаяЖД.ДатаИВремяРаскредитованияГруза = СтрокаПоНакладной.ДатаПрибытия;
		НоваяНакладнаяЖД.ДатаИВремяРаскредитованияГрузаМестная = СтрокаПоНакладной.ДатаПрибытия;
		НоваяНакладнаяЖД.СтанцияОтправления = СтрокаПоНакладной.СтанцияОтправления;
		НоваяНакладнаяЖД.СтанцияОтправленияКод = СтрокаПоНакладной.КодСтОтправления;
		НоваяНакладнаяЖД.СтанцияНазначения = СтрокаПоНакладной.СтанцияПрибытия;
		НоваяНакладнаяЖД.СтанцияНазначенияКод = СтрокаПоНакладной.КодСтНазначения;
		НоваяНакладнаяЖД.СтанцияНазначенияНаименование = НоваяНакладнаяЖД.СтанцияНазначения;
		НоваяНакладнаяЖД.СтанцияОтправленияНаименование = НоваяНакладнаяЖД.СтанцияОтправления;
		НоваяНакладнаяЖД.ГрузополучательОКПО = СтрокаПоНакладной.ГрузополучательОКПО;
		
		_ГП = Справочники.э_ПаспортаОрганизаций.НайтиПоРеквизиту("ОКПО", СтрокаПоНакладной.ГрузополучательОКПО);
		НоваяНакладнаяЖД.Грузополучатель = _ГП;
		НоваяНакладнаяЖД.ГрузополучательНаименование = _ГП;
		НоваяНакладнаяЖД.ГрузоотправительОКПО = СтрокаПоНакладной.ГрузоотправительОКПО;
		
		_ГО = Справочники.э_ПаспортаОрганизаций.НайтиПоРеквизиту("ОКПО", СтрокаПоНакладной.ГрузоотправительОКПО);
		НоваяНакладнаяЖД.Грузоотправитель = _ГО;
		НоваяНакладнаяЖД.ГрузоотправительНаименование = _ГО;
		
		Если НЕ ЗначениеЗаполнено(НоваяНакладнаяЖД.ТекущееСостояниеНакладной) Тогда
			НоваяНакладнаяЖД.ТекущееСостояниеНакладной = Справочники.э_СостоянияДокументов.НайтиПоКоду(4);
		КонецЕсли;
		Если СтрокаПоНакладной.ПровознаяПлата <> "000000.00" Тогда
			Если НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.НайтиСтроки(Новый Структура("НомерВагона, НомерКонтейнера", СтрокаПоНакладной.НомерВагона, СтрокаПоНакладной.НомерКТК)).Количество() = 0 Тогда
				НСтрПлата = НоваяНакладнаяЖД.ПровозныеПлатежиИСборыПоПрибытию.Добавить();
				НСтрПлата.НомерВагона = СтрокаПоНакладной.НомерВагона;
				НСтрПлата.НомерКонтейнера = СтрокаПоНакладной.НомерКТК;
				НСтрПлата.СуммаВРублях = Число(СтрокаПоНакладной.ПровознаяПлата);
				НСтрПлата.ВалютаИД = СтрокаПоНакладной.КодВалюты;
				Если СтрокаПоНакладной.КодВалюты = "0" Тогда
					НСтрПлата.ВалютаНаименование = "Российские рубли";
				ИначеЕсли СтрокаПоНакладной.КодВалюты = "1" Тогда
					НСтрПлата.ВалютаНаименование = "Сантимы";
				ИначеЕсли СтрокаПоНакладной.КодВалюты = "2" Тогда
					НСтрПлата.ВалютаНаименование = "Центы";
				ИначеЕсли СтрокаПоНакладной.КодВалюты = "3" Тогда
					НСтрПлата.ВалютаНаименование = "Казахстанские тенге";
				ИначеЕсли СтрокаПоНакладной.КодВалюты = "4" Тогда
					НСтрПлата.ВалютаНаименование = "Украинские гривны";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаПоНакладной.КодЕТСНГ <> "00000" ИЛИ СтрокаПоНакладной.КодГНГ <> "000000" Тогда
			Если СтрокаПоНакладной.КодГНГ <> "000000" Тогда
				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодГНГ", СтрокаПоНакладной.НомерКТК, СтрокаПоНакладной.КодГНГ)).Количество() = 0 Тогда
					НСтрГруз = НоваяНакладнаяЖД.Грузы.Добавить();
					НСтрГруз.НомерКонтейнера = СтрокаПоНакладной.НомерКТК;
					НСтрГруз.ВесНетто = СтрокаПоНакладной.ФактВесГруза;
					НСтрГруз.КодГНГ = СтрокаПоНакладной.КодГНГ;
					НСтрГруз.КодЕТСНГ = СтрокаПоНакладной.КодЕТСНГ;
				КонецЕсли;
				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодГНГ", СтрокаПоНакладной.КодГНГ)).Количество() = 0 Тогда
					ГрузЖД = НоваяНакладнаяЖД.ГрузыЖД.Добавить();
					ГрузЖД.КодГНГ = СтрокаПоНакладной.КодГНГ;
					ГрузЖД.КодЕТСНГ = СтрокаПоНакладной.КодЕТСНГ;
					ГрузЖД.МассаГруза = СтрокаПоНакладной.ФактВесГруза;
					//ДИТ Шевченко А.В. 62104 06.11.22 -начало
					ГрузЖД.ЕТСНГ = ПоискЕТСНГНаСервере(СокрЛП(СтрокаПоНакладной.КодЕТСНГ));
					//ДИТ Шевченко А.В. 62104 06.11.22 -конец
				КонецЕсли;
			ИначеЕсли СтрокаПоНакладной.КодЕТСНГ <> "00000" Тогда
				Если НоваяНакладнаяЖД.Грузы.НайтиСтроки(Новый Структура("НомерКонтейнера, КодЕТСНГ", СтрокаПоНакладной.НомерКТК, СтрокаПоНакладной.КодЕТСНГ)).Количество() = 0 Тогда
					НСтрГруз = НоваяНакладнаяЖД.Грузы.Добавить();
					НСтрГруз.НомерКонтейнера = СтрокаПоНакладной.НомерКТК;
					НСтрГруз.ВесНетто = СтрокаПоНакладной.ФактВесГруза;
					НСтрГруз.КодГНГ = СтрокаПоНакладной.КодГНГ;
					НСтрГруз.КодЕТСНГ = СтрокаПоНакладной.КодЕТСНГ;
				КонецЕсли;
				Если НоваяНакладнаяЖД.ГрузыЖД.НайтиСтроки(Новый Структура("КодЕТСНГ", СтрокаПоНакладной.КодЕТСНГ)).Количество() = 0 Тогда
					ГрузЖД = НоваяНакладнаяЖД.ГрузыЖД.Добавить();
					ГрузЖД.КодГНГ = СтрокаПоНакладной.КодГНГ;						
					ГрузЖД.КодЕТСНГ = СтрокаПоНакладной.КодЕТСНГ;
					ГрузЖД.МассаГруза = СтрокаПоНакладной.ФактВесГруза;
					//ДИТ Шевченко А.В. 62104 06.11.22 -начало
					ГрузЖД.ЕТСНГ = ПоискЕТСНГНаСервере(СокрЛП(СтрокаПоНакладной.КодЕТСНГ));
					//ДИТ Шевченко А.В. 62104 06.11.22 -конец
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли; 
		// ДИТ ТА 72431 US 69900 Сержантова А.С. Начало: 11.07.2023
		Если СтрокаПоНакладной.КодЭкспедитора <> "0000000000" Тогда
			НоваяНакладнаяЖД.ПлательщикКод = СтрокаПоНакладной.КодЭкспедитора;
		КонецЕсли;
		// ДИТ ТА 72431 US 69900 Сержантова А.С. Конец: 11.07.2023
	КонецЦикла;
	Попытка
		//ДИТ Шевченко А.В. 55332 10.08.2022 -начало
		Если МассивНакладныхДляПометкиНаУдаление.Найти(УнифицированныйНомерНакладной) <> Неопределено Тогда
			НоваяНакладнаяЖД.ПометкаУдаления = Истина;
			НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			//++ [US 58841] Denis isadchenko, 07.03.2023
			Загружаем = Ложь;
			Если НЕ РанееЗагружен Тогда
				Если НоваяНакладнаяЖД.Контейнеры.Количество() > 0 Тогда
					Загружаем = Истина;
				КонецЕсли;
				
				ПроверитьЕТСНГ = Ложь;				
				Если Загружаем = Ложь Тогда
					Если НоваяНакладнаяЖД.Вагоны.Количество() > 0 Тогда
						Для Каждого СтрокаВагоны ИЗ НоваяНакладнаяЖД.Вагоны Цикл
							Если ЗначениеЗаполнено(СтрокаВагоны.РодВагона) Тогда
								Если СтрокаВагоны.РодВагона.ЯвляетсяПлатформой Тогда
									Загружаем = Истина;								
								КонецЕсли;
							Иначе
								ПроверитьЕТСНГ = Истина;
							КонецЕсли;
						КонецЦикла;
					Иначе
						ПроверитьЕТСНГ = Истина;	
					КонецЕсли;
				КонецЕсли;

				
				Если ПроверитьЕТСНГ Тогда
					Если Загружаем = Ложь Тогда
						Если НоваяНакладнаяЖД.ГрузыЖД.Количество() > 0 Тогда
							Для Каждого СтрокаГрузыЖД ИЗ НоваяНакладнаяЖД.ГрузыЖД Цикл
								Если ЗначениеЗаполнено(СтрокаГрузыЖД.ЕТСНГ) Тогда
									Если э_ОбщиеСервер.ПроверитьЕТСНГПорожний(СтрокаГрузыЖД.ЕТСНГ) Тогда
										Загружаем = Истина;
									КонецЕсли;
								Иначе
									Если ЗначениеЗаполнено(СтрокаГрузыЖД.КодЕТСНГ) Тогда
										э_ЕТСНГГруза = Справочники.э_ЕТСНГ.НайтиПоКоду(СтрокаГрузыЖД.КодЕТСНГ);
										Если ЗначениеЗаполнено(э_ЕТСНГГруза) Тогда
											Если э_ОбщиеСервер.ПроверитьЕТСНГПорожний(э_ЕТСНГГруза) Тогда
												Загружаем = Истина;
											КонецЕсли;
										Иначе	
											ЕТСНГГруза = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ",СтрокаГрузыЖД.КодЕТСНГ); 
											// ДИТ ТА 70296 Сержантова А.С. Начало: 29.05.2023
											// Было:
											//Если ЕТСНГГруза.Порожний Тогда
											//	Загружаем = Истина;
											//КонецЕсли; 
											//Стало:
											Если ЗначениеЗаполнено(ЕТСНГГруза) и ЕТСНГГруза.Порожний Тогда
												Загружаем = Истина; 
											Иначе
												Загружаем = Ложь;
												ЗаписьЖурналаРегистрации("ЗагрузкаНакладныхГВЦ.Проведение ЖДН ГВЦ", 
													УровеньЖурналаРегистрации.Предупреждение,, НоваяНакладнаяЖД.Ссылка, 
													"Накладная ГВЦ №" + НоваяНакладнаяЖД.Номер + " не загружена при проверке порожнего ЕТСНГ по причине" + Символы.ПС +
													"""Не найден груз в справочнике ""Грузы"" по коду ЕТСНГ " + СтрокаГрузыЖД.КодЕТСНГ + """");
											КонецЕсли;	
											// ДИТ ТА 70296 Сержантова А.С. Конец: 29.05.2023
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			//ДИТ Давудов М.А. 0310599 23.05.23 -начало
			Иначе
				Загружаем = Истина;
			//ДИТ Давудов М.А. 0310599 23.05.23 -конец
			КонецЕсли;
						
			Если Загружаем Тогда
				НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Запись); // Евросиб Фролов (26.04.2022
				НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			//НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Запись); // Евросиб Фролов (26.04.2022
			//НоваяНакладнаяЖД.Записать(РежимЗаписиДокумента.Проведение); 
			//-- [US 58841] Denis isadchenko, 07.03.2023
		КонецЕсли;	
		//ДИТ Шевченко А.В. 55332 10.08.2022 -конец
	Исключение
		ОО = ОписаниеОшибки();
		// Евросиб Фролов (26.04.2022
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		МассивСообщений.Добавить("Ошибка при проведении ЖДН ГВЦ в рег. задании ""Загрузка накладных ГВЦ"". " + НоваяНакладнаяЖД.Ссылка + ": " + ПредставлениеОшибки);
		ЗаписьЖурналаРегистрации("ЗагрузкаНакладныхГВЦ.Проведение ЖДН ГВЦ", УровеньЖурналаРегистрации.Ошибка,, НоваяНакладнаяЖД.Ссылка, ПредставлениеОшибки);
		// Евросиб Фролов)
	КонецПопытки; 
КонецПроцедуры
//ДИТ, Беляев СЮ, TA51481, 03-06-2022, конец

//ДИТ Шевченко А.В. 62104 06.11.22 -начало
&НаСервере
функция ПоискЕТСНГНаСервере(ЕТСНГ)
	
	ЕТСНГСсылка = Справочники.э_ЕТСНГ.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(ЕТСНГ) Тогда
		Возврат ЕТСНГСсылка;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	э_ЕТСНГ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.э_ЕТСНГ КАК э_ЕТСНГ
		|ГДЕ
		|	э_ЕТСНГ.Код ПОДОБНО &ЕТСНГ + ""%""
		|	И НЕ э_ЕТСНГ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЕТСНГ", ЕТСНГ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//ДИТ Шевченко А.В. 60929 21.12.22 -начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Грузы.ЕТСНГ КАК ЕТСНГ,
		|	Грузы.Наименование КАК Наименование,
		|	Грузы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Грузы КАК Грузы
		|ГДЕ
		|	Грузы.ЕТСНГ ПОДОБНО &ЕТСНГ + ""%""
		|	И НЕ Грузы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЕТСНГ", ЕТСНГ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат СоздатьЭ_ЕТСНГ(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.ЕТСНГ,ВыборкаДетальныеЗаписи.Наименование);	
	КонецЦикла;
	//ДИТ Шевченко А.В. 60929 21.12.22 -конец
	
	Возврат ЕТСНГСсылка;
КонецФункции

&НаСервере
Функция СоздатьЭ_ЕТСНГ(Груз,ЕТСНГ,Наименование) //ДИТ Шевченко А.В. 60929 21.12.22
	
	НачатьТранзакцию();
	Попытка
		Спр = Справочники.э_ЕТСНГ.СоздатьЭлемент();
		Спр.Код = ЕТСНГ;
		Спр.Наименование 	   = Наименование;
		Спр.НаименованиеПолное = Наименование;
		Спр.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = Груз;
		МЗ.СпрЭтрана = Спр.Ссылка;
		МЗ.Записать(Истина);
		ЗафиксироватьТранзакцию();
		Возврат Спр.Ссылка;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Возврат Справочники.э_ЕТСНГ.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

//ДИТ Шевченко А.В. 62104 06.11.22 -конец