
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
	СтандартнаяОбработка = Ложь;
	
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.Отправлен"));
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен"));
	Если Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеТребуется"));
	КонецЕсли;	
КонецПроцедуры
