// + ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022
Процедура ОбработатьОтменуСогласованияДокументаПередЗаписью(Источник) Экспорт
	
	Если Не Источник.ЭтоНовый() И Источник.СтатусДокумента = Перечисления.СтатусыСогласования.Планируется Тогда
		ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Источник.Ссылка);
		Если ЗначениеЗаполнено(ТекПроцессСогл) Тогда
			ОбъектСогласования = ТекПроцессСогл.ПолучитьОбъект();
			ОбъектСогласования.УстановитьПометкуУдаления(Истина);
			ОбъектСогласования.СогласованиеЗавершено = Ложь;
			ОбъектСогласования.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// - ДИТ Кузнецов Е.Е. Ticket#0288343 16.11.2022

// ++ Дудоров С.В. Ticket#61931 29.11.2022
Функция СогласованияДокумента(ОбъектСсылка) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектСсылка));
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта = "Справочник." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта = "Документ." + ОбъектМетаданных.Имя;
	КонецЕсли;	
		//|	" + ТипОбъекта + ".Состояния КАК СогласованияДокумента
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТипОбъекта + " КАК ДокументСогласования
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументСогласования.ТекущееСостояние.Согласование КАК СостояниеСогласованияДокумента,
		|	СогласованияДокумента.НомерСтроки КАК НомерСтроки,
		|	СогласованияДокумента.Состояние КАК Состояние,
		|	СогласованияДокумента.Состояние.Согласование КАК СостояниеСогласование,
		|	СогласованияДокумента.Ссылка КАК Ссылка,
		|	СогласованияДокумента.Статус КАК Статус,
		|	СогласованияДокумента.Исполнитель КАК Исполнитель,
		|	СогласованияДокумента.Наблюдатель КАК Наблюдатель,
		|	СогласованияДокумента.ВыполнениеЗафиксировано КАК ВыполнениеЗафиксировано,
		|	ДокументСогласования.ПримененныйМаршрут.НачальныйСтатус КАК НачальныйСтатус
		|ПОМЕСТИТЬ вт_Согласования
		|ИЗ
		|	" + ТипОбъекта + ".Состояния КАК СогласованияДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТипОбъекта + " КАК ДокументСогласования
		|		ПО СогласованияДокумента.Ссылка = ДокументСогласования.Ссылка
		|			И (СогласованияДокумента.Ссылка = &ДокументСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Согласования.СостояниеСогласованияДокумента КАК СостояниеСогласованияДокумента,
		|	вт_Согласования.НомерСтроки КАК НомерСтроки,
		|	вт_Согласования.Состояние КАК Состояние,
		|	вт_Согласования.СостояниеСогласование КАК ЭтоСостояниеСогласование,
		|	вт_Согласования.Ссылка КАК Ссылка,
		|	вт_Согласования.Статус КАК Статус,
		|	вт_Согласования.Исполнитель КАК Исполнитель,
		|	вт_Согласования.Наблюдатель КАК Наблюдатель,
		|	вт_Согласования.ВыполнениеЗафиксировано КАК ВыполнениеЗафиксировано,
		|	вт_Согласования.НачальныйСтатус КАК НачальныйСтатус
		|ИЗ
		|	вт_Согласования КАК вт_Согласования
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(вт_Согласования.НомерСтроки, 0)) КАК НомерСтроки
		|ИЗ
		|	вт_Согласования КАК вт_Согласования
		|ГДЕ
		|	вт_Согласования.СостояниеСогласование = ИСТИНА
		|	И вт_Согласования.Статус = &Выполнено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Согласования.Исполнитель КАК Пользователь,
		|	вт_Согласования.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК ЭтоИсполнитель
		|ПОМЕСТИТЬ вт_ВсеПользователиМаршрутаПоСтрокам
		|ИЗ
		|	вт_Согласования КАК вт_Согласования
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Согласования.Наблюдатель,
		|	вт_Согласования.НомерСтроки,
		|	ЛОЖЬ
		|ИЗ
		|	вт_Согласования КАК вт_Согласования
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СоставыГруппПользователей.Пользователь,
		|	вт_Согласования.НомерСтроки,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ПО СоставыГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь
		|			И СоставыГруппПользователей.ГруппаПользователей = ГруппыПользователейСостав.Ссылка
		|			И (СоставыГруппПользователей.Используется)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Согласования КАК вт_Согласования
		|		ПО (вт_Согласования.Исполнитель = СоставыГруппПользователей.ГруппаПользователей)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СоставыГруппПользователей.Пользователь,
		|	вт_Согласования.НомерСтроки,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ПО СоставыГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь
		|			И СоставыГруппПользователей.ГруппаПользователей = ГруппыПользователейСостав.Ссылка
		|			И (СоставыГруппПользователей.Используется)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Согласования КАК вт_Согласования
		|		ПО (вт_Согласования.Наблюдатель = СоставыГруппПользователей.ГруппаПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ВсеПользователиМаршрутаПоСтрокам.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ вт_ВсеПользователиМаршрута
		|ИЗ
		|	вт_ВсеПользователиМаршрутаПоСтрокам КАК вт_ВсеПользователиМаршрутаПоСтрокам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокЗамещение.Замещение КАК Пользователь,
		|	ДокЗамещение.ИсходныйПользователь КАК ИсходныйПользователь,
		|	ИСТИНА КАК Заместитель
		|ПОМЕСТИТЬ вт_ВсеПользователиВозврата
		|ИЗ
		|	вт_ВсеПользователиМаршрута КАК вт_ВсеПользователиМаршрута
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Замещение КАК ДокЗамещение
		|		ПО вт_ВсеПользователиМаршрута.Пользователь = ДокЗамещение.ИсходныйПользователь
		|ГДЕ
		|	&ТекущаяДата МЕЖДУ ДокЗамещение.НачалоПериодаЗамещения И ДокЗамещение.КонецПериодаЗамещения
		|	И ДокЗамещение.РежимДокумента = 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	вт_ВсеПользователиМаршрута.Пользователь,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
		|	ЛОЖЬ
		|ИЗ
		|	вт_ВсеПользователиМаршрута КАК вт_ВсеПользователиМаршрута
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ВсеПользователиВозврата.Пользователь КАК Пользователь
		|ИЗ
		|	вт_ВсеПользователиВозврата КАК вт_ВсеПользователиВозврата
		|ГДЕ
		|	вт_ВсеПользователиВозврата.Пользователь = &ТекущийПользователь
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Согласования.НачальныйСтатус КАК НачальныйСтатус
		|ИЗ
		|	вт_Согласования КАК вт_Согласования";
	
	Запрос.УстановитьПараметр("Выполнено", Перечисления.СтатусыЭтапов.Выполнен);
	Запрос.УстановитьПараметр("ДокументСсылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТекущийПользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	МассивРезультатов = Запрос.ВыполнитьПакет(); 
	
	МаксНомерСтрокиВыполненногоСогласования = 0;
	Выборка = МассивРезультатов[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Если не Выборка.НомерСтроки = null Тогда
			МаксНомерСтрокиВыполненногоСогласования = Выборка.НомерСтроки;
		КонецЕсли;	
	КонецЕсли;
	
	НачальныйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
	Выборка = МассивРезультатов[7].Выбрать();
	Если Выборка.Следующий() Тогда
		Если не Выборка.НачальныйСтатус = null Тогда
			НачальныйСтатус = Выборка.НачальныйСтатус;
		КонецЕсли;	
	КонецЕсли;	

	Возврат Новый Структура("Согласования
		|, НомерСтрокиПоследнегоВыполненногоСогласования
		|, ТипОбъекта
		|, ТекущемуПользователюНеДоступенВозврат 
		|, НачальныйСтатус"
		, МассивРезультатов[1].Выбрать()
		, МаксНомерСтрокиВыполненногоСогласования
		, ТипОбъекта
		, МассивРезультатов[6].Пустой()
		, НачальныйСтатус);
		
КонецФункции
// -- Дудоров С.В. Ticket#61931 29.11.2022 

// ++ Дудоров С.В. Ticket# 09.12.2022 при создании шаблона документа.
Функция ПолучитьДанныеПоСостояниямОбъектаИзБазы(ОбъектСсылка)

	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектСсылка));
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта = "Справочник." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта = "Документ." + ОбъектМетаданных.Имя;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	" + ТипОбъекта + ".Состояния КАК СостоянияОбъекта
	               |ГДЕ
	               |	СостоянияОбъекта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ОбъектСсылка);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
// -- Дудоров С.В. Ticket# 09.12.2022

// ++ Дудоров С.В. Ticket# 09.12.2022 при создании шаблона документа.
Функция ЕстьДублиСостояний(Состояния) Экспорт
	
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	Возврат Ложь;
	
КонецФункции
// -- Дудоров С.В. Ticket# 09.12.2022

//Евросиб Каблов 08.01.2025 #97984
Функция ПолучитьПроцессСогласованияОбъекта(ОбъектСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроцессСогласования.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ПроцессСогласованияСостояния.ШагЦикла) КАК ШагЦикла,
	|	ПроцессСогласования.ДокументСогласования.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	Справочник.ПроцессСогласования КАК ПроцессСогласования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессСогласования.Состояния КАК ПроцессСогласованияСостояния
	|		ПО ПроцессСогласования.Ссылка = ПроцессСогласованияСостояния.Ссылка
	|ГДЕ
	|	ПроцессСогласования.ДокументСогласования = &ОбъектСогласования
	|	И НЕ ПроцессСогласования.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроцессСогласования.Ссылка,
	|	ПроцессСогласования.ДокументСогласования.СтатусДокумента";
	
	Запрос.УстановитьПараметр("ОбъектСогласования", ОбъектСогласования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДанныеПроцесса = Новый Структура("Ссылка, ШагЦикла, СтатусДокумента");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПроцесса, Выборка);
	КонецЕсли;
	
	Возврат ДанныеПроцесса;
	
КонецФункции

