Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
	ПараметрыЗапроса = Новый Соответствие;
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПроверитьПроцессСогласования(Объект) Экспорт
	
	СтатусДокумента = Справочники.СтатусыДокументов.ПустаяСсылка();
	
	Если Объект.Состояния.Количество()>0 Тогда
		//проверяем есть ли Согласование
		СтруктураПоиска = Новый Структура("Состояние,СтатусСогласования",Справочники.Состояния.Согласование,Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
		ЭтапСогласования = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
		Если ЭтапСогласования.Количество()> 0 Тогда
			СтатусДокумента = Справочники.СтатусыДокументов.РеестрСогласован;
		Иначе 
			СтруктураПоиска = Новый Структура("Состояние,СтатусСогласования",Справочники.Состояния.Согласование,Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
			ЭтапСогласованияОтклонен = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
			Если ЭтапСогласованияОтклонен.Количество()> 0 Тогда
				СтатусДокумента = Справочники.СтатусыДокументов.РеестрНеСогласован;
			КонецЕсли;
		КонецЕсли;
		
		//проверяем есть ли Утверждение
		СтруктураПоиска = Новый Структура("Состояние,СтатусСогласования",Справочники.Состояния.Утверждение,Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
		ЭтапУтверждения = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
		Если ЭтапУтверждения.Количество()> 0 Тогда
			СтатусДокумента = Справочники.СтатусыДокументов.РеестрУтвержден;
		Иначе 
			СтруктураПоиска = Новый Структура("Состояние,СтатусСогласования",Справочники.Состояния.Утверждение,Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
			ЭтапУтвержденияОтклонен = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
			Если ЭтапУтвержденияОтклонен.Количество()> 0 Тогда
				СтатусДокумента = Справочники.СтатусыДокументов.РеестрНеУтвержден;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат СтатусДокумента 
	
КонецФункции

//Евросиб СубботинВ #97103 16.12.2024 Начало
Процедура ИзменитьПризнакАктивностиЗаявкиВРеестрах(Заявка, ПризнакОтключенияЗаявки) Экспорт

	//Евросиб СубботинВ #128538 23.01.2026 Начало

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	МАКСИМУМ(РеестрПлатежейЗаявки.Ссылка) КАК Ссылка,
	//	|	РеестрПлатежейЗаявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	//	|ИЗ
	//	|	Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
	//	|ГДЕ
	//	|	РеестрПлатежейЗаявки.ЗаявкаНаОплату = &ЗаявкаНаОплату
	//	|	И РеестрПлатежейЗаявки.Ссылка.Проведен
	//	|	И НЕ РеестрПлатежейЗаявки.Отключена = &ПризнакОтключения
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	РеестрПлатежейЗаявки.ЗаявкаНаОплату";
	//
	//Запрос.УстановитьПараметр("ЗаявкаНаОплату", Заявка);
	//Запрос.УстановитьПараметр("ПризнакОтключения", ПризнакОтключенияЗаявки);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	ТчЗаявки = Объект.Заявки;
	//	СтрокаПоЗаявке = ТчЗаявки.Найти(Заявка, "ЗаявкаНаОплату");
	//	Если НЕ СтрокаПоЗаявке = Неопределено Тогда
	//		 СтрокаПоЗаявке.Отключена = ПризнакОтключенияЗаявки;
	//	 КонецЕсли;
	//	 Если Объект.Модифицированность() Тогда
	//		 Объект.Записать(РежимЗаписиДокумента.Проведение);
	//	 КонецЕсли;
	//КонецЦикла;
	
	РегистрыСведений.ЗаявкиВключенныеВРеестр.ЗафиксироватьИзменениеСтаусаЗаявкиВРеестре(Заявка, ПризнакОтключенияЗаявки);
	//Евросиб СубботинВ #128538 23.01.2026 Конец

	
КонецПроцедуры
//Евросиб СубботинВ #97103 16.12.2024 Конец

//Евросиб СубботинВ #89527 30.10.2024 Начало

//Евросиб СубботинВ #128538 23.01.2026 Начало
//Процедура ОбновитьИтоги(Объект) Экспорт
	
	//ПараметрыОтбора = Новый Структура("Отключена", Ложь);
	//АктивныеСтроки = Объект.Заявки.Выгрузить(ПараметрыОтбора);
	//Объект.СуммаИтогоВРублях = АктивныеСтроки.Итог("СуммаПлатежаРуб");
	
//КонецПроцедуры
//Евросиб СубботинВ #89527 30.10.2024 Конец
//Евросиб СубботинВ #128538 23.01.2026 Конец

//Евросиб СубботинВ #128538 23.01.2026 Начало
Функция ПосчитатьИтогиПоДокументу(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РеестрПлатежейЗаявки.СуммаПлатежаРуб) КАК СуммаПлатежаРуб
	|ИЗ
	|	Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
	|		ПО РеестрПлатежейЗаявки.Ссылка = ЗаявкиВключенныеВРеестр.РеестрПлатежей
	|			И РеестрПлатежейЗаявки.ЗаявкаНаОплату = ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату
	|			И (НЕ ЗаявкиВключенныеВРеестр.Отключена)
	|ГДЕ
	|	РеестрПлатежейЗаявки.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда		
		Возврат РезультатЗапроса.СуммаПлатежаРуб;
	Иначе		
		Возврат 0; 
	КонецЕсли;

КонецФункции  
//Евросиб СубботинВ #128538 23.01.2026 Конец
