
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	//Евросиб СубботинВ #122650 18.11.2025 Начало
	Если РежимЗаписи  = РежимЗаписиДокумента.Проведение и Заявки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Проведение реестра без заявок не возможно. Добавьте документы и повторите действие.",,,, Отказ);
	КонецЕсли;

	Если Не РольДоступна("ПолныеПрава") И ( РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		или (ЗначениеЗаполнено(Ссылка) и не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ПометкаУдаления") и ПометкаУдаления)) Тогда 
		Если Заявки.Количество() = 0 Тогда
			Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
				ТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
			Иначе
				ТекущийСтатусСтруктура = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Ссылка));
				ТекущийСтатус = ТекущийСтатусСтруктура.Статус;
			КонецЕсли;
			Если НЕ ТекущийСтатус = Справочники.СтатусыДокументов.РеестрПодготовлен Тогда
				ТекстОшибки = "Удаление и распроведение реестра доступно только в статусе документа «Подготовлен»";
			КонецЕсли; 
		Иначе
			ТекстОшибки = "Удаление/отмена проведения реестра не возможно. В списке есть заявки на оплату. Удалите документы и повторите действие";
		КонецЕсли;		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
				
	//Евросиб СубботинВ #122650 18.11.2025 Конец			
				
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	//Документы.РеестрПлатежей.ОбновитьИтоги(ЭтотОбъект);
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект); 
	
	Если ЗначениеЗаполнено(Ссылка) и ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		СтатусДляСтартаМаршрутизации = Справочники.СтатусыДокументов.РеестрНаСогласование;	
		ТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
		УстановленНужныйСтатусДляМаршрутизации = СтатусДляСтартаМаршрутизации = ТекущийСтатус; 
	Иначе 
		УстановленНужныйСтатусДляМаршрутизации = Ложь;
	КонецЕсли;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация и УстановленНужныйСтатусДляМаршрутизации Тогда
		
		ПараметрыЗапроса = Документы.РеестрПлатежей.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		ПараметрыЗапроса.Вставить("МаршрутСогласования", МаршрутСогласования);
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРеестрПлатежей(ПараметрыЗапроса, Дата);
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);
			 //Евросиб СубботинВ #104841 07.05.2025 Начало //
            // РаботаСЗадачами.СоздатьЗадачи(Ссылка);
			 //Евросиб СубботинВ #104841 07.05.2025 Начало //
		КонецЕсли;
		
	КонецЕсли;
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//Евросиб СубботинВ #89527 30.10.2024 Конец
	

	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор 			 = Пользователи.ТекущийПользователь();
	Создано 		 = ТекущаяДата();
	Организация 	 = Константы.ОсновнаяОрганизация.Получить();
	//Евросиб СубботинВ #89527 28.10.2024 Начало 
	Маршрутизировать = Константы.МаршрутизироватьРеестрПлатежей.Получить();
	//Евросиб СубботинВ #89527 28.10.2024 Конец 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	ВызватьИсключение("Копирование реестра платежей запрещено");
	//Евросиб СубботинВ #89527 30.10.2024 Конец
КонецПроцедуры

//Евросиб СубботинВ #89527 30.10.2024 Начало

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Ссылка) и ДополнительныеСвойства.Свойство("СтатусДокумента") и ДополнительныеСвойства.Свойство("СтатусДокументаПервичный") Тогда
		ТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
		СтатусДокументаПервичный = ДополнительныеСвойства.СтатусДокументаПервичный;
		//Евросиб СубботинВ #107600 18.04.2025 Начало 
		//Если ТекущийСтатус <> СтатусДокументаПервичный  или	 ТекущийСтатус = Справочники.СтатусыДокументов.РеестрПодготовлен Тогда
		Если ТекущийСтатус <> СтатусДокументаПервичный 
			или ТекущийСтатус = Справочники.СтатусыДокументов.РеестрПодготовлен 
			или	ТекущийСтатус = Справочники.СтатусыДокументов.РеестрНаСогласование Тогда
	    //Евросиб СубботинВ #107600 18.04.2025 Конец 
			
			СписокЗаявок = Заявки.Выгрузить(,"ЗаявкаНаОплату");

			Запрос = Новый Запрос;
			//Евросиб СубботинВ #128538 23.01.2026 Начало
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	СтатусыОбъектовСрезПоследних.Объект КАК Объект,
			//|	СтатусыОбъектовСрезПоследних.Статус КАК Статус
			//|ИЗ
			//|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект В (&Заявки)) КАК СтатусыОбъектовСрезПоследних";
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусыОбъектовСрезПоследних.Объект КАК Объект,
			|	СтатусыОбъектовСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект В (&Заявки)) КАК СтатусыОбъектовСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&СсылкаРеестр КАК СсылкаРеестр,
			|	ЗаявкаНаОплату.Ссылка КАК Заявка
			|ПОМЕСТИТЬ Вт_заявка
			|ИЗ
			|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
			|ГДЕ
			|	ЗаявкаНаОплату.Ссылка В(&Заявки)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Вт_заявка.СсылкаРеестр КАК СсылкаРеестр,
			|	Вт_заявка.Заявка КАК Заявка
			|ИЗ
			|	Вт_заявка КАК Вт_заявка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
			|		ПО Вт_заявка.СсылкаРеестр = ЗаявкиВключенныеВРеестр.РеестрПлатежей
			|			И Вт_заявка.Заявка = ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату
			|ГДЕ
			|	ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату ЕСТЬ NULL";					
			//Евросиб СубботинВ #128538 23.01.2026 Конец
			
			Запрос.УстановитьПараметр("Заявки", СписокЗаявок);
			//Евросиб СубботинВ #128538 23.01.2026 Начало
            Запрос.УстановитьПараметр("СсылкаРеестр", Ссылка);
			
			//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Результат = Запрос.ВыполнитьПакет(); 
			РезультатЗапроса = Результат[0].Выгрузить();
			
			ЗаявкиДляВключенияВРеестр = Результат[2].Выбрать();
			Пока ЗаявкиДляВключенияВРеестр.Следующий() Цикл
				РегистрыСведений.ЗаявкиВключенныеВРеестр.ВключитьЗаявкуВРеестр(ЗаявкиДляВключенияВРеестр.Заявка, ЗаявкиДляВключенияВРеестр.СсылкаРеестр); 
			КонецЦикла;
			//Евросиб СубботинВ #128538 23.01.2026 Конец
			
			
			Для Каждого СтрокаЗаявок из Заявки Цикл
				//Евросиб СубботинВ #107600 18.04.2025 Начало 
				//ТекущийСтатусДляЗаписиПоЗаявке = ?(СтрокаЗаявок.Отключена,Справочники.СтатусыДокументов.Согласована,																						
				//									Справочники.СтатусыДокументов.ВключенаВРеестрDC);
				СтатусЗаявкиПоРеестру = ?(ТекущийСтатус = Справочники.СтатусыДокументов.РеестрПодготовлен,
										  Справочники.СтатусыДокументов.ВключенаВРеестрDC, Справочники.СтатусыДокументов.ВРеестреDCНаСогласовании);
				ТекущийСтатусДляЗаписиПоЗаявке = ?(СтрокаЗаявок.УдалитьОтключена, Справочники.СтатусыДокументов.Согласована, СтатусЗаявкиПоРеестру);
				//Евросиб СубботинВ #107600 18.04.2025 Конец 
				ТекущаяЗаписьПоЗаявке = РезультатЗапроса.Найти(СтрокаЗаявок.ЗаявкаНаОплату,"Объект");
				Если ТекущаяЗаписьПоЗаявке = Неопределено Тогда
					ТекущийСтатусПоЗаявке = Неопределено;
				Иначе
					ТекущийСтатусПоЗаявке = ТекущаяЗаписьПоЗаявке.Статус;
				КонецЕсли;
				//Евросиб СубботинВ #97103 23.12.2024 Начало 
				//РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СтрокаЗаявок.ЗаявкаНаОплату, Справочники.СтатусыДокументов.ВключенаВРеестрDC); 
				Если ТекущийСтатусПоЗаявке <> ТекущийСтатусДляЗаписиПоЗаявке тогда 
					РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СтрокаЗаявок.ЗаявкаНаОплату, ТекущийСтатусДляЗаписиПоЗаявке);
					СтруктураОтбора = Новый Структура("Объект",Заявки.Выгрузить(,"ЗаявкаНаОплату"));
				КонецЕсли;
				КонецЦикла;
				//Евросиб СубботинВ #97103 23.12.2024 Конец
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ТаблицаИсключенныхЗаявок") и ДополнительныеСвойства.ТаблицаИсключенныхЗаявок.Количество() > 0 Тогда
			Для Каждого СтрокаЗаявокДляИсключения из ДополнительныеСвойства.ТаблицаИсключенныхЗаявок Цикл
				РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СтрокаЗаявокДляИсключения, Справочники.СтатусыДокументов.Согласована);
				//Евросиб СубботинВ #128538 23.01.2026 Начало
				РегистрыСведений.ЗаявкиВключенныеВРеестр.ОтвязатьЗаявкуОтРеестра(СтрокаЗаявокДляИсключения,Ссылка);
				//Евросиб СубботинВ #128538 23.01.2026 Конец
			КонецЦикла;			
		КонецЕсли;	
	КонецЕсли;
	
	СтатусДокумента = Документы.РеестрПлатежей.ПроверитьПроцессСогласования(Ссылка);
	Если НЕ СтатусДокумента = Справочники.СтатусыДокументов.ПустаяСсылка() Тогда
		Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
			ЗафиксированныйТекущийСтатус = ДополнительныеСвойства.СтатусДокумента;
		Иначе
			ЗафиксированныйТекущийСтатус = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Ссылка)).Статус; 
		КонецЕсли;
		Если СтатусДокумента <> ЗафиксированныйТекущийСтатус Тогда
			РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(Ссылка, СтатусДокумента,,,Комментарий);			
			Если СтатусДокумента  = Справочники.СтатусыДокументов.РеестрУтвержден Тогда			
				МассивСсылок = Новый Массив;   
				Для Каждого СтрЗаявки Из Заявки Цикл
					//Евросиб СубботинВ #97103 16.12.2024 Начало 
					Если НЕ СтрЗаявки.УдалитьОтключена Тогда
						//Евросиб СубботинВ #97103 16.12.2024 Конец
						МассивСсылок.Добавить(СтрЗаявки.ЗаявкаНаОплату);
						ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(СтрЗаявки.ЗаявкаНаОплату, Перечисления.УзлыОбмена.УПП);						
						//Евросиб СубботинВ #97103 16.12.2024 Начало
					КонецЕсли;
					//Евросиб СубботинВ #97103 16.12.2024 Конец
				КонецЦикла;
				//ЕСОбменСервер.РегЗадание_ВыгрузкаЗаявокНаОплатуВУПП(МассивСсылок);
				//ЕСОбменСервер.ПередатьЗаявкуВУПП(МассивСсылок,"ЗаявкаНаОплату",2); 
				//Евросиб СубботинВ #107600 18.04.2025 Начало // Перенес 
				//ИначеЕсли СтатусДокумента  = Справочники.СтатусыДокументов.РеестрСогласован Тогда
				//	Для Каждого СтрЗаявки Из Заявки Цикл
				//		Если НЕ СтрЗаявки.Отключена Тогда
				//			РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СтрЗаявки.ЗаявкаНаОплату, Справочники.СтатусыДокументов.ВРеестреDCНаСогласовании);
				//		КонецЕсли;
				//	КонецЦикла;	
				//Евросиб СубботинВ #107600 18.04.2025 Конец
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;

	//Евросиб СубботинВ #104841 07.05.2025 Начало
	Если НЕ ЭтотОбъект.Состояния.Количество()= 0 и
		(НЕ СтатусДокумента = Справочники.СтатусыДокументов.РеестрНеУтвержден И НЕ СтатусДокумента = Справочники.СтатусыДокументов.РеестрНеСогласован) Тогда		
		РаботаСЗадачами.СформироватьЗадачуИПисьмо(ЭтотОбъект);
	Иначе		
		Задачи.ЗадачаИсполнителя.УдалитьЗадачиПоОбъекту(Ссылка);
	КонецЕсли;	
	//Евросиб СубботинВ #104841 07.05.2025 Конец	

КонецПроцедуры 

//Евросиб СубботинВ #89527 30.10.2024 Начало



