Функция УчетнаяЕдиницаСоответствуетОграничениям(УчЕдиница, СтруктураТекущихПараметров) Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОграниченияИспользования.УчетнаяЕдиница КАК УчетнаяЕдиница,
	               |	ОграниченияИспользования.Ограничение КАК Ограничение,
	               |	ОграниченияИспользования.НаборВариантов КАК НаборВариантов,
	               |	ОграниченияИспользования.ПоказательОграничения КАК ПоказательОграничения
	               |ИЗ
	               |	РегистрСведений.ОграниченияИспользования КАК ОграниченияИспользования
	               |ГДЕ
	               |	ОграниченияИспользования.УчетнаяЕдиница = &УчетнаяЕдиница
	               |ИТОГИ ПО
	               |	Ограничение";
	Запрос.УстановитьПараметр("УчетнаяЕдиница", УчЕдиница);
	ОтветОгр = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОтветОгр.Следующий() Цикл
		
		ХотьОдинПараметрСоответствует = Ложь;
		ХотьОдинПараметрСуществует = Ложь;
		Ответ = ОтветОгр.Выбрать();
		
		Пока Ответ.Следующий() Цикл
			Для каждого Стр из СтруктураТекущихПараметров Цикл
				
				Если Ответ.Ограничение = Стр.Критерий Тогда
					
					ХотьОдинПараметрСуществует = Истина;
					ХотьОдинПараметрСоответствует = ХотьОдинПараметрСоответствует ИЛИ ПроверитьСоответствиеПараметра(Ответ.ПоказательОграничения, Стр.Показатель, Ответ.Ограничение);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		Если ХотьОдинПараметрСуществует И НЕ ХотьОдинПараметрСоответствует Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСоответствиеПараметра(Параметр1, Параметр2, Ограничение)
	
	Результат = Ложь;
	
	Если Ограничение.КонтрольТребованияФлажком ИЛИ Ограничение.КонтрольСоответствияКонтрагенту Тогда
		Результат = (Параметр1 = Параметр2);
	ИначеЕсли Ограничение.КонтрольНепревышенияЧисловогоПоказателя Тогда
		Число1 = 0;
		Число2 = 0;
		Попытка
			Число1 = Число(Параметр1);
			Число2 = Число(Параметр2);
			Результат = (Число1 >= Число2);
		Исключение
		КонецПопытки;
	ИначеЕсли Ограничение.КонтрольВхожденияВРегион Тогда
		
		МассивРодителейПараметра1 = Новый Массив;
		П1 = Параметр1;
		Пока ЗначениеЗаполнено(П1.Родитель) Цикл
			МассивРодителейПараметра1.Добавить(П1.Родитель);
			П1 = П1.Родитель;
		КонецЦикла;
		Результат = (МассивРодителейПараметра1.Найти(Параметр2) <> неопределено);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
