
Процедура ПриЗаписи(Отказ, Замещение)
	Источник = ЭтотОбъект;
	
	ТЗ = Источник.Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Приемник = РегистрыСведений.ИнформацияОтАвтоподрядчиковПоТерминалам.СоздатьМенеджерЗаписи();
		
		//Шевченко А.В. US 118372 TA 118375 04.09.2025
		//Шевченко А.В. US 118372 TA 127282 30.12.2025
		//Если СтрокаТЗ.Период > КонецДня(ТекущаяДата()) Тогда
		Если СтрокаТЗ.Период > КонецДня(КонецДня(ТекущаяДата())+1) Тогда
		//Шевченко А.В. US 118372 TA 127282 30.12.2025
			Продолжить;
		КонецЕсли;
		//Шевченко А.В. US 118372 TA 118375 04.09.2025
		
		ЗаполнитьЗначенияСвойств(Приемник,СтрокаТЗ);
		
		Приемник.Контейнер = СтрокаТЗ.КлючАналитикиПеревозки.Контейнер;
		Приемник.ДатаОперации = СтрокаТЗ.Период;
		Приемник.Терминал = СтрокаТЗ.Терминал;
		Приемник.Записать(Истина); 
	КонецЦикла;
КонецПроцедуры
