
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПортыОтгрузкиВыгрузки") Тогда
		Для Каждого Порт Из Параметры.ПортыОтгрузкиВыгрузки Цикл
			НоваяСтрока = ПортыОтгрузкиВыгрузки.Добавить();
			НоваяСтрока.НаименованиеПорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Порт, "Наименование");
			НоваяСтрока.Порт = Порт;
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("ПортыОтправленияНазначения") Тогда
		Для Каждого Порт Из Параметры.ПортыОтправленияНазначения Цикл
			НоваяСтрока = ПортыОтправленияНазначения.Добавить();
			НоваяСтрока.НаименованиеПорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Порт, "Наименование");
			НоваяСтрока.Порт = Порт;
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("SOCилиCOC") Тогда
		Если Параметры.SOCилиCOC = "SOC" Тогда
			ЭтаФорма.Заголовок = Нстр("ru = 'Форма вставки ставок за Фрахт для SOC'");
		Иначе
			ЭтаФорма.Заголовок = Нстр("ru = 'Форма вставки ставок за Фрахт для COC'");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ФрахтИмпорт") Тогда
		Если Параметры.ФрахтИмпорт = Истина Тогда
			Excel.Область("R1C2").Текст = "Порт отправления";
			Элементы.ТаблицаСтавокПортОтправленияНазначения.Заголовок = "Порт отправления";
		Иначе
			Excel.Область("R1C2").Текст = "Порт назначения";
			Элементы.ТаблицаСтавокПортОтправленияНазначения.Заголовок = "Порт назначения";
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб US ***** TA ***** Рыбьяков К.А. 31.07.2025 ((
	Если Параметры.Свойство("ЕдиницаИзмеренияTEU") Тогда
		Excel.Область("C5").Видимость = Ложь;
		Excel.Область("C6").Видимость = Ложь;
		Элементы.ТаблицаСтавокСтавкаФрахта40.Видимость = Ложь;
		Элементы.ТаблицаСтавокСтавкаВознаграждения40.Видимость = Ложь;
		
		Excel.Область("R1C3").Текст = "Ставка Фрахта TEU";
		Excel.Область("R1C4").Текст = "Ставка Вознаграждения TEU";
		Элементы.ТаблицаСтавокСтавкаФрахта20.Заголовок = "Ставка Фрахта TEU";
		Элементы.ТаблицаСтавокСтавкаВознаграждения20.Заголовок = "Ставка Вознаграждения TEU";
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 31.07.2025 ))
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Прочитать(Команда)
	
	ПрочитатьДанныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВТаблицу(Команда)
	
	Отказ = Ложь;
	
	Результат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаСтавок Цикл
		Если ПортыОтгрузкиВыгрузки.Количество() > 0 Тогда
			Если Не ЗначениеЗаполнено(Строка.ПортОтгрузкиВыгрузки) Тогда
				Индекс = ТаблицаСтавок.Индекс(Строка);
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Необходимо заполнить порт.'"), 
					, 
					"ТаблицаСтавок[" + Индекс + "].ПортОтгрузкиВыгрузки", , Отказ);
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Строка.ПортОтправленияНазначения) Тогда
			Индекс = ТаблицаСтавок.Индекс(Строка);
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Необходимо заполнить порт.'"), 
				, 
				"ТаблицаСтавок[" + Индекс + "].ПортОтправленияНазначения", , Отказ);
		КонецЕсли;
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ПортОтгрузкиВыгрузки", Строка.ПортОтгрузкиВыгрузки);
		СтруктураДанных.Вставить("ПортОтправленияНазначения", Строка.ПортОтправленияНазначения);
		СтруктураДанных.Вставить("СтавкаФрахта20", Строка.СтавкаФрахта20);
		СтруктураДанных.Вставить("СтавкаВознаграждения20", Строка.СтавкаВознаграждения20);
		СтруктураДанных.Вставить("СтавкаФрахта40", Строка.СтавкаФрахта40);
		СтруктураДанных.Вставить("СтавкаВознаграждения40", Строка.СтавкаВознаграждения40);
		Результат.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПрочитатьДанныНаСервере()
	
	Счетчик = 2;
	ТаблицаСтавок.Очистить();
	
	ПрочитаннаяСтрока = Excel.Область("R" + Счетчик + "C2").Текст;
	
	Пока ПрочитаннаяСтрока <> "" Цикл
		
		НоваяСтрока = ТаблицаСтавок.Добавить();
		
		ПортОтгрузкиВыгрузки = Excel.Область("R" + Счетчик + "C1").Текст;
		Если ПортОтгрузкиВыгрузки <> "" Тогда
			ПортОтгрузкиВыгрузки = ПодобратьПорт(ПортОтгрузкиВыгрузки, Истина);
		КонецЕсли;
		
		ПортОтправленияНазначения = Excel.Область("R" + Счетчик + "C2").Текст;
		Если ПортОтправленияНазначения <> "" Тогда
			ПортОтправленияНазначения = ПодобратьПорт(ПортОтправленияНазначения);
		КонецЕсли;
		
		НоваяСтрока.СтавкаФрахта20 = Excel.Область("R" + Счетчик + "C3").Текст;
		НоваяСтрока.СтавкаВознаграждения20 = Excel.Область("R" + Счетчик + "C4").Текст;
		НоваяСтрока.СтавкаФрахта40 = Excel.Область("R" + Счетчик + "C5").Текст;
		НоваяСтрока.СтавкаВознаграждения40 = Excel.Область("R" + Счетчик + "C6").Текст;
		
		НоваяСтрока.ПортОтгрузкиВыгрузки = ПортОтгрузкиВыгрузки;
		НоваяСтрока.ПортОтправленияНазначения = ПортОтправленияНазначения;
		
		Счетчик = Счетчик + 1;
		
		ПрочитаннаяСтрока = Excel.Область("R" + Формат(Счетчик, "ЧГ=0") + "C2").Текст;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьПорт(НаименованиеПорта, ОтгрузкаВыгрузка = Ложь)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТекущаяТаблица.Порт КАК ПортСсылка
	|ПОМЕСТИТЬ ТекущаяТаблица
	|ИЗ 
	|	&ТаблицаЗначений КАК ТекущаяТаблица
	|ГДЕ
	|	ТекущаяТаблица.НаименованиеПорта ПОДОБНО &Шаблон
	|;
	|ВЫБРАТЬ
	|	ТекущаяТаблица.ПортСсылка КАК ЗначениеРеквизита
	|ИЗ
	|	ТекущаяТаблица КАК ТекущаяТаблица";
	
	Если ОтгрузкаВыгрузка Тогда
		Запрос.УстановитьПараметр("ТаблицаЗначений", ПортыОтгрузкиВыгрузки.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("ТаблицаЗначений", ПортыОтправленияНазначения.Выгрузить());
	КонецЕсли;
	Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(НаименованиеПорта) + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти