
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Документ);
	Параметры.Свойство("ГУИДДокумента", ГУИДДокумента);
	
	Если ЗначениеЗаполнено(Документ) И НЕ ЗначениеЗаполнено(ГУИДДокумента) Тогда
		
		Заголовок = Строка(Документ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.Объект = &Объект
			|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
			|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)";
		
		Запрос.УстановитьПараметр("Объект", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			ГУИДДокумента = ВыборкаДетальныеЗаписи.УИДИсточника;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГУИДДокумента) Тогда 
		
		// получим список актуальных файлов из 1С:ДО
		ИмяМетода = "FileAndDocumentData";
		ИмяОперации = "Get_FileInformation";
		
		//Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
		Прокси = ПолучитьПрокси("ВебСервисОбменаСДО");
		
		//Получаем тип параметра, который передается в метод Get_FileInformation.
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
		
		//Создаем параметр на основе типа и заполняем значение параметров
		WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
		WSПараметр.Document_GUID 			= ГУИДДокумента;
		WSПараметр.Related_Docs_Required 	= "true"; // получаем файлы связанных документов в 1С:ДО
		
		ОтветВебСервиса = Новый ТаблицаЗначений;
		тзТаблицаФайлов = ТаблицаФайлов.Выгрузить();
		Попытка
			//Вызываем метод веб-сервиса
			ОбъектXDTO = Прокси.Get_FileInformation(
				WSПараметр.Document_GUID,
				WSПараметр.Related_Docs_Required);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			   УровеньЖурналаРегистрации.Ошибка,,,
			   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		////ТаблицаДанных = СериализоватьОбъектВXML(Прокси.ФабрикаXDTO, ОбъектXDTO);
		//Сериализатор = Новый СериализаторXDTO(Прокси.ФабрикаXDTO);
		////ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO.FileInfo);
		//ТипWSПараметра1 = Прокси.ФабрикаXDTO.Пакеты.Получить("http://www.w3.org/2001/XMLSchema").Получить("anyType");
		//WSПараметр1 = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра1);
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		
		Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO")
				ИЛИ ОбъектXDTO.Свойства().Получить("FileInfo") = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого СтрокаОбъектаXDTO Из ОбъектXDTO.FileInfo Цикл
			
			//СтрокаТаблицы = Сериализатор.ПрочитатьXDTO(СтрокаОбъектаXDTO);
			
			Для Каждого СвойствоСтроки Из СтрокаОбъектаXDTO.Свойства() Цикл 
				Если тзТаблицаФайлов.Колонки.Найти(СвойствоСтроки.Имя) = Неопределено Тогда
					ОписаниеТиповРеквизита = Новый ОписаниеТипов(Строка(ТипЗнч(СтрокаОбъектаXDTO[СвойствоСтроки.Имя])));
					тзТаблицаФайлов.Колонки.Добавить(СвойствоСтроки.Имя, ОписаниеТиповРеквизита);
					МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СвойствоСтроки.Имя, ОписаниеТиповРеквизита, "ТаблицаФайлов")); 
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока = тзТаблицаФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбъектаXDTO);
			
		КонецЦикла;
		
		ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Для Каждого ДобавляемыйРеквизит Из МассивДобавляемыхРеквизитов Цикл 
			НовыйЭлемент = Элементы.Добавить("ТаблицаФайлов"+ДобавляемыйРеквизит.Имя, Тип("ПолеФормы"), Элементы.ТаблицаФайлов);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаФайлов."+ДобавляемыйРеквизит.Имя;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			Если СтрНайти(ДобавляемыйРеквизит.Имя, "GUID") > 0 Тогда 
				ИмяРеквизитаГУИДФайла = ДобавляемыйРеквизит.Имя;
			КонецЕсли;
			Если СтрНайти(ДобавляемыйРеквизит.Имя, "Type") > 0 Тогда 
				ИмяРеквизитаТипФайла = ДобавляемыйРеквизит.Имя;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаФайлов.Загрузить(тзТаблицаФайлов);
		
	КонецЕсли;
		
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	ОткрытьФайлыНаКлиенте(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВсеФайлы(Команда)

	ОткрытьФайлыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтмеченныеФайлы(Команда)

	Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
		
		Если НЕ СтрокаТаблицы.ОткрытьФайл Тогда 
			Продолжить;
		КонецЕсли;
		
		ОткрытьФайлыНаКлиенте(СтрокаТаблицы.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлыНаКлиенте(ИдентификаторСтроки = Неопределено)
	
	Если НЕ ТаблицаФайлов.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяРеквизитаГУИДФайла) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено поле %1.'"),
				Элементы.ИмяРеквизитаГУИДФайла.Заголовок), ,
			"ИмяРеквизитаГУИДФайла");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяРеквизитаТипФайла) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено поле %1.'"),
				Элементы.ИмяРеквизитаТипФайла.Заголовок), ,
			"ИмяРеквизитаТипФайла");
		Возврат;
	КонецЕсли;
	
	// ++ ДИТ, Сгонник 2022-03-22 исправляю ошибку открытия файлов
	//// предварительно получим пути к файлам
	//Если ИдентификаторСтроки = Неопределено Тогда 
	//	
	//	// необходимо открыть все файлы
	//	Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
	//		
	//		Если НЕ СтрокаТаблицы.ФайлСоздан Тогда 
	//			СтрокаТаблицы.ПутьКФайлу = ПолучитьИмяВременногоФайла("."+СтрокаТаблицы[ИмяРеквизитаТипФайла]);
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//		
	//Иначе
	//	
	//	// необходимо открыть только один файл
	//	СтрокаТаблицы = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
	//	
	//	Если НЕ СтрокаТаблицы.ФайлСоздан Тогда 
	//		СтрокаТаблицы.ПутьКФайлу = ПолучитьИмяВременногоФайла("."+СтрокаТаблицы[ИмяРеквизитаТипФайла]);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ОткрытьФайлыНаСервере(ИдентификаторСтроки);
	//
	//Если ИдентификаторСтроки = Неопределено Тогда 
	//	
	//	// необходимо открыть все файлы
	//	Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
	//		
	//		Если СтрокаТаблицы.ФайлСоздан Тогда
	//			Оповещение = Новый ОписаниеОповещения("ОткрытьФайлЗавершение", ЭтотОбъект);
	//			НачатьЗапускПриложения(Оповещение, СтрокаТаблицы.ПутьКФайлу);
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//	
	//	// необходимо открыть только один файл
	//	СтрокаТаблицы = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
	//	
	//	Если СтрокаТаблицы.ФайлСоздан Тогда
	//		Оповещение = Новый ОписаниеОповещения("ОткрытьФайлЗавершение", ЭтотОбъект);
	//		НачатьЗапускПриложения(Оповещение, СтрокаТаблицы.ПутьКФайлу);
	//	КонецЕсли;
	//КонецЕсли;
	
	ПолучитьФайлыНаСервере(ИдентификаторСтроки);
	
	Если ИдентификаторСтроки = Неопределено Тогда 
		
		// необходимо открыть все файлы
		Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.АдресВременногоХранилища) Тогда 
				АдресВременногоХранилища = СтрокаТаблицы.АдресВременногоХранилища;
				ФайловаяСистемаКлиент.ОткрытьФайл(АдресВременногоХранилища,, СтрокаТаблицы[ИмяРеквизитаТипФайла]);
			КонецЕсли;
			
		КонецЦикла;
			
	Иначе
		
		// необходимо открыть только один файл
		СтрокаТаблицы = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(СтрокаТаблицы.АдресВременногоХранилища) Тогда 
			АдресВременногоХранилища = СтрокаТаблицы.АдресВременногоХранилища;
			ФайловаяСистемаКлиент.ОткрытьФайл(АдресВременногоХранилища,, СтрокаТаблицы[ИмяРеквизитаТипФайла]); 
		КонецЕсли;
		
	КонецЕсли;
	// -- ДИТ, Сгонник 2022-03-22 исправляю ошибку открытия файлов

КонецПроцедуры

// ++ ДИТ, Сгонник 2022-03-22 исправляю ошибку открытия файлов
#Область ЗакомментированныеДоработкиПотомМожноУдалить
//&НаКлиенте
//Процедура ОткрытьФайлЗавершение(КодВозврата, ДополнительныйПараметр) Экспорт
//	// действий не требуется        
//КонецПроцедуры

//&НаСервере
//Процедура ОткрытьФайлыНаСервере(ИдентификаторСтроки)
//	
//	Если ИдентификаторСтроки = Неопределено Тогда 
//		
//		// необходимо открыть все файлы
//		Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
//			
//			СоздатьФайлНаСервере(СтрокаТаблицы);
//			
//		КонецЦикла;
//			
//	Иначе
//		
//		// необходимо открыть только один файл
//		СтрокаТаблицы = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
//		СоздатьФайлНаСервере(СтрокаТаблицы);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура СоздатьФайлНаСервере(СтрокаТаблицы)
//	
//	Если СтрокаТаблицы.ФайлСоздан Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	// получим данные файлов из 1С:ДО
//	ИмяМетода = "FileAndDocumentData";
//	ИмяОперации = "Get_File";
//			
//	Прокси = ПолучитьПрокси("ВебСервисОбменаСДО");
//	
//	//Получаем параметры метода
//	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
//	
//	//Создаем параметр на основе типа и заполняем значение параметров
//	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
//	WSПараметр.File_GUID 	= СтрокаТаблицы[ИмяРеквизитаГУИДФайла];
//	
//	Попытка
//		//Вызываем метод веб-сервиса
//		ОбъектXDTO = Прокси.Get_File(
//			WSПараметр.File_GUID);
//	Исключение
//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
//		   УровеньЖурналаРегистрации.Ошибка,,,
//		   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//	КонецПопытки;
//	
//	Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO")
//			ИЛИ ОбъектXDTO.Свойства().Получить("Extension") = Неопределено
//			ИЛИ ОбъектXDTO.Свойства().Получить("BinaryData") = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Попытка
//		ОбъектXDTO.BinaryData.Записать(СтрокаТаблицы.ПутьКФайлу);
//		СтрокаТаблицы.ФайлСоздан = Истина;
//	Исключение
//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
//		   УровеньЖурналаРегистрации.Ошибка,,,
//		   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//	КонецПопытки;
//			
//КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ПолучитьФайлыНаСервере(ИдентификаторСтроки)
	
	Если ИдентификаторСтроки = Неопределено Тогда 
		
		// необходимо открыть все файлы
		Для Каждого СтрокаТаблицы Из ТаблицаФайлов Цикл 
			
			ПолучитьФайлНаСервере(СтрокаТаблицы);
			
		КонецЦикла;
			
	Иначе
		
		// необходимо открыть только один файл
		СтрокаТаблицы = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
		ПолучитьФайлНаСервере(СтрокаТаблицы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлНаСервере(СтрокаТаблицы)
	
	//Если ЗначениеЗаполнено(СтрокаТаблицы.АдресВременногоХранилища) Тогда 
	//	Возврат;
	//КонецЕсли;
	
	// получим данные файлов из 1С:ДО
	ИмяМетода = "FileAndDocumentData";
	ИмяОперации = "Get_File";
			
	Прокси = ПолучитьПрокси("ВебСервисОбменаСДО");
	
	//Получаем параметры метода
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
	
	//Создаем параметр на основе типа и заполняем значение параметров
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.File_GUID 	= СтрокаТаблицы[ИмяРеквизитаГУИДФайла];
	
	Попытка
		//Вызываем метод веб-сервиса
		ОбъектXDTO = Прокси.Get_File(
			WSПараметр.File_GUID);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
		   УровеньЖурналаРегистрации.Ошибка,,,
		   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO")
			ИЛИ ОбъектXDTO.Свойства().Получить("Extension") = Неопределено
			ИЛИ ОбъектXDTO.Свойства().Получить("BinaryData") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		//ОбъектXDTO.BinaryData.Записать(СтрокаТаблицы.ПутьКФайлу);
		//СтрокаТаблицы.ФайлСоздан = Истина;
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ОбъектXDTO.BinaryData);
		СтрокаТаблицы.АдресВременногоХранилища = АдресВременногоХранилища;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
		   УровеньЖурналаРегистрации.Ошибка,,,
		   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
			
КонецПроцедуры
// -- ДИТ, Сгонник 2022-03-22 исправляю ошибку открытия файлов

&НаСервере
Функция ПолучитьПрокси(ИмяКонстанты) Экспорт

	АдресWSDL = Константы[ИмяКонстанты+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить();
	Попытка
		Определение = Новый WSОпределения(АдресWSDL);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Прокси = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);

	Возврат Прокси;
	
КонецФункции

&НаСервере
Функция СериализироватьВXMLНаСервере(ФабрикаXDTO, ОтветXML);
	
	//тСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	//
	//тЗаписьXML = Новый ЗаписьXML;
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	//тЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	//
	//тСериализаторXDTO.ЗаписатьXML(тЗаписьXML, ОтветXML, НазначениеТипаXML.Явное);
	
	//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	//ОбъектXDTO = Сериализатор.ЗаписатьXDTO(СериализуемыйОбъект);

	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.УстановитьСтроку("UTF-8");
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO,,,,НазначениеТипаXML.Явное);

	//Возврат ЗаписьXML.Закрыть();

КонецФункции

&НаСервере
Функция СериализоватьОбъектВXML(ФабрикаXDTO, СериализуемыйОбъект) Экспорт

	//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	//ОбъектXDTO = Сериализатор.ПрочитатьXDTO(СериализуемыйОбъект);

	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.УстановитьСтроку("UTF-8");
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO,,,,НазначениеТипаXML.Явное);

	//Возврат ЗаписьXML.Закрыть();

КонецФункции
