
// ++ ДИТ_Агафонов_task 37859 22.08.2022
//Интерактиво изменени реквизит формы ТД, настройки - убран заголовок у второй колонки
// -- ДИТ_Агафонов_task 37859 22.08.2022

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Вагоны") Тогда
		РежимРаботы = "Вагоны";
	ИначеЕсли Параметры.Свойство("КТК") Тогда
		РежимРаботы = "КТК";
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
		ТД.Область("R1C1").Текст = "Номер КТК";
//Евросиб Гудкова( 04.01.2020 
	ИначеЕсли Параметры.Свойство("Накладные") Тогда
		РежимРаботы = "Накладные";
		ВозвращатьСтроки = Истина;
// Евросиб Гудкова) 			
	// ++ ДИТ_Агафонов_task 37859 19.08.2022
	ИначеЕсли Параметры.Свойство("Контрагенты") Тогда
		РежимРаботы = "Контрагенты";
		ТД.Область("R1C1").Текст = "Наименование контрагента";
	ИначеЕсли Параметры.Свойство("Номенклатура") Тогда
		РежимРаботы = "Номенклатура";
		ТД.Область("R1C1").Текст = "Наименование номенклатуры";
	// -- ДИТ_Агафонов_task 37859 19.08.2022
	КонецЕсли;
	Если Параметры.Свойство("ПередаватьИсходныеНомера") Тогда
		ВозвращатьСтроки = Истина;
	КонецЕсли;
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
	Сч = 2;
	Если Параметры.Свойство("Контрагент") Тогда
		ОбластьКонтрагент = "C" + Сч;
		ТД.Область("R1" + ОбластьКонтрагент).Текст = "Контрагент";
		ТД.Область("R1" + ОбластьКонтрагент).ШиринаКолонки = 50;
    	ЕстьКонтрагент = Истина;
		Сч = Сч + 1;
		Элементы.ВозвращатьСтроки.Видимость = Ложь;
	КонецЕсли;
// Евросиб Гудкова) 	
	Если Параметры.Свойство("РазмерКТК") Тогда
		ПоказыватьРазмерКТК = Параметры.РазмерКТК;
//Евросиб Гудкова( 17.09.2020 Ticket№ 0204605
		ОбластьРазмерКТК = "C" + Сч;
		ТД.Область("R1" + ОбластьРазмерКТК).Текст = "Размер КТК";
		ТД.Область("R1" + ОбластьРазмерКТК).ШиринаКолонки = 10;
		Сч = Сч + 1;
// Евросиб Гудкова) 		
	КонецЕсли;

	Если Параметры.Свойство("ПоказыватьДатуВзятия") Тогда
		ОбластьДатаВзятия = "C" + Сч;
		ДопСекция = ТД.ПолучитьОбласть("R1" + ОбластьДатаВзятия);//Гудкова "R1C3");
		ТД.Область("R1" + ОбластьДатаВзятия).Текст = "Дата взятия";
		ТД.Область("R1" + ОбластьДатаВзятия).ШиринаКолонки = 20;
    	//ТД.Присоединить(ДопСекция, 1, ТД.ВысотаТаблицы, ТД.ШиринаТаблицы);
		ПоказыватьДатуВзятия = Истина;
		Сч = Сч + 1;
	КонецЕсли;
	
	Если Параметры.Свойство("ПрибытиеНаТерминалОтпр") Тогда
		ОбластьПрибытиеНаТерминалОтпр = "C" + Сч;
		ТД.Область("R1" + ОбластьПрибытиеНаТерминалОтпр).Текст = "Дата приема в пользование";
		ТД.Область("R1" + ОбластьПрибытиеНаТерминалОтпр).ШиринаКолонки = 25;
    	ПоказатьПрибытиеНаТерминалОтпр = Истина;
		Сч = Сч + 1;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаДоставкиГруза") Тогда
		ОбластьДатаДоставкиГруза = "C" + Сч;
		ТД.Область("R1" + ОбластьДатаДоставкиГруза).Текст = "Дата доставки груза";
		ТД.Область("R1" + ОбластьДатаДоставкиГруза).ШиринаКолонки = 25;
    	ПоказатьДатаДоставкиГруза = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДатаПриемаВСток") Тогда
		ОбластьДатаПриемаВСток = "C" + Сч;
		ТД.Область("R1" + ОбластьДатаПриемаВСток).Текст = "Дата приема в сток";
		ТД.Область("R1" + ОбластьДатаПриемаВСток).ШиринаКолонки = 20;
    	ЕстьДатаПриемаВСток = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("НомерТС") Тогда
		ОбластьНомерТС = "C" + Сч;
		ТД.Область("R1" + ОбластьНомерТС).Текст = "Номер ТС";
		ТД.Область("R1" + ОбластьНомерТС).ШиринаКолонки = 15;
    	ЕстьНомерТС = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
	
	Если Параметры.Свойство("ВодительТС") Тогда
		ОбластьВодительТС = "C" + Сч;
		ТД.Область("R1" + ОбластьВодительТС).Текст = "Водитель";
		ТД.Область("R1" + ОбластьВодительТС).ШиринаКолонки = 100;
    	ЕстьВодительТС = Истина;
		Сч = Сч + 1;
	КонецЕсли; 
// Евросиб Гудкова) 	
	Если Параметры.Свойство("Автовставка") Тогда
		Автовставка = Истина;
	Иначе
		Автовставка = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ФорматДаты") Тогда
		ФорматДаты = Параметры.ФорматДаты;
	КонецЕсли;
	// ++ ДИТ_Агафонов_task 37859 19.08.2022
	Если Параметры.Свойство("ВозвращатьСтроки") Тогда
		ВозвращатьСтроки = Параметры.ВозвращатьСтроки;
	КонецЕсли;
	// -- ДИТ_Агафонов_task 37859 19.08.2022
	//++ Зубов US 33131 TA 38910 29.10.2021
	Если Параметры.Свойство("ВозвращатьСтрокиНедоступно") Тогда
		ВозвращатьСтрокиНедоступно = Параметры.ВозвращатьСтрокиНедоступно;
	КонецЕсли;
	//-- Зубов US 33131 TA 38910 29.10.2021
	//++ Зубов Ticket#0250132 15.11.2021  // ДИТ Сержантова А.С. 02.11.2023 US 76956 ТА 76958 закомментировала, убрала параметр 
	//Если Параметры.Свойство("СоздаватьКТК") Тогда
	//	СоздаватьКТК = Параметры.СоздаватьКТК;
	//Иначе
	//	СоздаватьКТК = Ложь;
	//КонецЕсли;
	//-- Зубов Ticket#0250132 15.11.2021
	
	//++ Зубов US 45162 TA 45703 21.01.2022
	Если Параметры.Свойство("ПериодДействияРелиза") Тогда
		ПериодДействияРелиза = Параметры.ПериодДействияРелиза;
	Иначе
		ПериодДействияРелиза = Неопределено;
	КонецЕсли;
	//-- Зубов US 45162 TA 45703 21.01.2022
	
	//Евросиб Бозняков( 06.04.2022 TASK 51077
	Если Параметры.Свойство("КлиентскийКТК") Тогда
		Элементы.РефрижераторныйКТК.Видимость = Истина;
		Элементы.ВозвращатьСтроки.Видимость = Ложь;
		КлиентскийКТК = Параметры.КлиентскийКТК; 
	КонецЕсли;
	//Евросиб Бозняков )
	
	//Евросиб Каблов 16.08.2022 ( US41519
	Если Не Параметры.Свойство("СоздаватьКТКПриПереносеВДокумент", СоздаватьКТКПриПереносеВДокумент) Тогда
		СоздаватьКТКПриПереносеВДокумент = Ложь;
	КонецЕсли;
	//Евросиб Каблов 16.08.2022 )
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 ))
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	Если Параметры.Свойство("РефрижераторныйКТК") Тогда
		Элементы.РефрижераторныйКТК.Видимость = Истина;
		РефрижераторныйКТК = Параметры.РефрижераторныйКТК;
	КонецЕсли;
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023  
	
	//Субботин 75462 05.10.2023 Начало
	Если Параметры.Свойство("ЭтоРефсцеп") Тогда
		ЭтоРефсцеп = Истина;
	КонецЕсли; 
	//Субботин 75462 05.10.2023 Конец  
	// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Начало: 26.11.2024
	Если Параметры.Свойство("ПоказыватьДатуИзготовленияКТК") Тогда
		ОбластьДатаИзготовленияКТК = "C" + Сч;
		ДопСекция = ТД.ПолучитьОбласть("R1" + ОбластьДатаИзготовленияКТК);
		ТД.Область("R1" + ОбластьДатаИзготовленияКТК).Текст = "Дата изготовления КТК";
		ТД.Область("R1" + ОбластьДатаИзготовленияКТК).ШиринаКолонки = 20;
		ПоказыватьДатуИзготовленияКТК = Истина;
		Сч = Сч + 1;
	КонецЕсли;
	// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Конец: 26.11.2024
	
	//ТрундуковСА 112690 26.06.2025 начало
	Если Параметры.Свойство("СобственныйКТК") Тогда
		СобственныйКТК = Истина;
	Иначе
		СобственныйКТК = Ложь;
	КонецЕсли;
	//ТрундуковСА 112690 26.06.2025 конец
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация5.Видимость = ?(РежимРаботы = "КТК",Истина,Ложь);
	Элементы.Декорация6.Видимость = ?(РежимРаботы = "КТК",Истина,Ложь);
	Элементы.РезультатДатаВзятия.Видимость = ?(ПоказыватьДатуВзятия,Истина,Ложь);
	Элементы.РезультатДатаДоставкиГруза.Видимость = ?(ПоказатьДатаДоставкиГруза,Истина,Ложь);
	Элементы.РезультатВремяПрибытияНаТерминал.Видимость = ?(ПоказатьПрибытиеНаТерминалОтпр,Истина,Ложь);
	Элементы.ФорматДаты.Видимость = ?(ПоказыватьДатуВзятия ИЛИ ПоказатьДатаДоставкиГруза,Истина,Ложь);
	Элементы.РезультатДатаПриемаВСток.Видимость = ?(ЕстьДатаПриемаВСток,Истина,Ложь);
	Элементы.РезультатКонтрагент.Видимость = ?(ЕстьКонтрагент,Истина,Ложь);
	Элементы.РезультатСтрокаКонтрагент.Видимость = ?(ЕстьКонтрагент,Истина,Ложь);
	Элементы.РезультатВодительТС.Видимость = ?(ЕстьВодительТС,Истина,Ложь);
	Элементы.РезультатНомерТС.Видимость = ?(ЕстьНомерТС,Истина,Ложь);
	//++ Зубов US 33131 TA 38910 29.10.2021
	Элементы.ВозвращатьСтроки.ТолькоПросмотр = ?(ВозвращатьСтрокиНедоступно,Истина,Ложь);
	//-- Зубов US 33131 TA 38910 29.10.2021
	// ++ ДИТ_Агафонов_task 37859 19.08.2022
	Элементы.РефрижераторныйКТК.Видимость = РежимРаботы = "КТК";	
	// -- ДИТ_Агафонов_task 37859 19.08.2022
	Если Автовставка Тогда
		// необходимо установить обработчик ожидания для работы механизма копирования/вставки через WScript.Shell
		// в противном случае, скрипт не успевает вставить данные в форму, а 1С уже проверяет их наличие
		ПодключитьОбработчикОжидания("ПроверкаСодержимогоЯчейки", 0.1, Истина);
		
		wsh=Новый COMОбъект("WScript.Shell");    
		ЭтаФорма.ТекущийЭлемент = Элементы.ТД;
		Элементы.ТД.ТекущаяОбласть = ЭтаФорма.ТД.Область("R2C1");
		wsh.SendKeys("^v");
		wsh.SendKeys("^м");
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	ПроверкаСодержимогоЯчейки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСодержимогоЯчейки() 
	
	Сч = 2;
	Результат.Очистить();
	
	ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	
	// блок для проверки копирования/вставки
	//ДИТ Авдеева В.С. 0284196 05.09.2022 Начало 
	//Если ПрочСтрока = "" Тогда 
	Если Не ЗначениеЗаполнено(ПрочСтрока) Тогда	
	//ДИТ Авдеева В.С. 0284196 05.09.2022 Конец
		Возврат;
	КонецЕсли;
	ОтключитьОбработчикОжидания("ПроверкаСодержимогоЯчейки");
	///////////////////////
	
	//Евросиб Каблов 16.08.2022 ( US41519
	ЕстьНекорректныйНомерКТК = Ложь;
	//Евросиб Каблов 16.08.2022 )
	
	//ДИТ Авдеева В.С. 0284196 05.09.2022 Начало 
	//Пока ПрочСтрока <> "" Цикл
	Пока ЗначениеЗаполнено(ПрочСтрока) Цикл
	//ДИТ Авдеева В.С. 0284196 05.09.2022 Конец
	
		//ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, начало (т.к. включен вывод заголовков таб.документа появились номера строк у пользователя)
		НомерТекущейСтроки = Сч; 
		//ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, конец
		
//Евросиб Гудкова( 17.09.2020 Ticket№ 0204605
//было		СтрокаРазмерКТК = ТД.Область("R"+Сч+"C2").Текст;
		СтрокаРазмерКТК = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьРазмерКТК).Текст);
// Евросиб Гудкова) 			
		Если ПоказыватьДатуВзятия Тогда
			СтрокаДата = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаВзятия).Текст);
		КонецЕсли;
		// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Начало: 26.11.2024
		Если ПоказыватьДатуИзготовленияКТК Тогда
			СтрокаДатаИзготовленияКТК = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаИзготовленияКТК).Текст);
			СтрокаДатаИзготовленияКТК = "01." + СтрокаДатаИзготовленияКТК;
		КонецЕсли;
		// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Конец: 26.11.2024
		Если ПоказатьПрибытиеНаТерминалОтпр Тогда
			СтрДатаПрибытия = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьПрибытиеНаТерминалОтпр).Текст);
		КонецЕсли;
		Если ПоказатьДатаДоставкиГруза Тогда
			СтрДатаДоставкиГруза = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаДоставкиГруза).Текст);
		КонецЕсли;
		НСтр = Результат.Добавить();
		НСтр.ПрочитаннаяСтрока = ПрочСтрока;
		Если РежимРаботы = "Вагоны" Тогда
			НСтр.ПрочитаннаяСсылка = Грузы_сервер.НайтиВагон(ПрочСтрока);
		КонецЕсли;
//Евросиб Гудкова( 04.01.2020 
		Если Режимработы = "Накладные" Тогда
			НСтр.ПрочитаннаяСсылка = НайтиНакладную(ПрочСтрока);
		КонецЕсли;
// Евросиб Гудкова) 			

		// ++ ДИТ_Агафонов_task 37859 19.08.2022
		Если Режимработы = "Контрагенты" Тогда
			НСтр.ПрочитаннаяСсылка = НайтиКонтрагента(ПрочСтрока);
		КонецЕсли;
		Если Режимработы = "Номенклатура" Тогда
			НСтр.ПрочитаннаяСсылка = НайтиНоменклатуру(ПрочСтрока);
		КонецЕсли;
		// -- ДИТ_Агафонов_task 37859 19.08.2022

		Если РежимРаботы = "КТК" Тогда
			//Евросиб СубботинВ #102415 18.02.2025 Начало // добавил проверку на заполнение поля размера 
			//Евросиб СубботинВ #88346 11.07.2024 Начало 
			//Если ЗначениеЗаполнено(ОбластьРазмерКТК) тогда
			Если ЗначениеЗаполнено(ОбластьРазмерКТК) и ЗначениеЗаполнено(СтрокаРазмерКТК) Тогда
			//Евросиб СубботинВ #102415 18.02.2025 Конец
				НСтр.РазмерКТКСтрока = СокрЛП(СтрокаРазмерКТК);
				НСтр.РазмерКТК = ПолучитьТипоразмерКТК(СокрЛП(СтрокаРазмерКТК), РефрижераторныйКТК); //Евросиб Бозняков( 06.04.2022 TASK 51077 Добавлен параметр "РефрижераторныйКТК"
			КонецЕсли;
			//Евросиб СубботинВ #88346 11.07.2024 Конец
			НСтр.ВычисленноеКонтрольноеЧисло = ?(СтрДлина(ПрочСтрока) = 11,РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6)),0);
			НСтр.КонтрольноеЧислоПользователя = Прав(ПрочСтрока,1);
			Если ПоказыватьДатуВзятия Тогда
				//++ Зубов US 33131 TA 43877 16.12.2021
				//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
				НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока,НСтр.РазмерКТК); 
				НСтр.РазмерКТК = ВыбратьНужныйРазмерКТК(НСтр.РазмерКТК,НСтр.ПрочитаннаяСсылка);
				//-- Зубов US 33131 TA 43877 16.12.2021 
				
				// ДИТ US 76956 ТА 76958 Сержантова А.С. Начало: 02.11.2023 - создание ктк перенесем в команду "ПеренестиВДокумент"  
				// Было:
				//// ++ ДИТ Поморцева Т.П. Задача 45162 01.02.2022.				
				//Если СоздаватьКТК И НЕ ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда					
				//	Если ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
				//		НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
				//	Иначе
				//		Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет создан.");
				//	КонецЕсли;
				//КонецЕсли;
				//// -- ДИТ Поморцева Т.П. Задача 45162 01.02.2022.   
				// Стало:
				Если НСтр.ВычисленноеКонтрольноеЧисло <> НСтр.КонтрольноеЧислоПользователя Тогда
					Текст = СтрШаблон("Номер контейнера (%1) в строке %2 указан неверно!", ПрочСтрока, Результат.Индекс(НСтр) + 1); 
					ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
				КонецЕсли;	
				Если не ЗначениеЗаполнено(НСтр.РазмерКТК) и ОбластьРазмерКТК <> "" Тогда  
					Текст = СтрШаблон("Не определен размер КТК для контейнера %1 в строке %2. Контейнер не будет создан.", ПрочСтрока, Результат.Индекс(НСтр) + 1); 
					ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
				КонецЕсли; 
				Если СтрокаРазмерКТК <> "" и НСтр.РазмерКТК <> ПолучитьТипоразмерКТК(СокрЛП(СтрокаРазмерКТК), РефрижераторныйКТК) Тогда
					Текст = "Введенные данные о типоразмере контейнера %1 в строке %2 не соответствуют имеющимся в карточке контейнера. Будет перенесен типоразмер из карточки КТК";
					Текст = СтрШаблон(Текст, ПрочСтрока, Результат.Индекс(НСтр) + 1); 	
					ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
				КонецЕсли;
				// ДИТ US 76956 ТА 76958 Сержантова А.С. Конец: 02.11.2023
				
				//++ Зубов US 45162 TA 45703 21.01.2022
				НСтр.ДатаВзятия = ПреобразованиеВДату(СтрокаДата);
				//ТрундуковСА 112690 26.06.2025 начало Добавление проверки "СобственныйКТК"
				Если НЕ СобственныйКТК Тогда
					Если (НСтр.ДатаВзятия < ПериодДействияРелиза.ДатаНачала ИЛИ НСтр.ДатаВзятия > ПериодДействияРелиза.ДатаОкончания) И НЕ НСтр.ДатаВзятия = Дата("00010101") Тогда			
						Сообщить("По КТК "+НСтр.ПрочитаннаяСсылка+" дата взятия "+НСтр.ДатаВзятия+" не будет перенесена в документ, так как она не входит в период действия релиза "+ПериодДействияРелиза);
						НСтр.ДатаВзятия = Дата("00010101");
					КонецЕсли;
					//++ Зубов US 45162 TA 45703 21.01.2022
				КонецЕсли;
				//ТрундуковСА 112690 26.06.2025 Конец
				
			Иначе
				//++ Зубов Ticket#0250132 15.11.2021
				//++ Зубов US 33131 TA 43877 16.12.2021
				//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
				//Евросиб Каблов 16.08.2022 ( US41519
				//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока,НСтр.РазмерКТК);
				Если СоздаватьКТКПриПереносеВДокумент Тогда
					НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока, Неопределено);
				Иначе
					НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока,НСтр.РазмерКТК);
				КонецЕсли;
				//Евросиб Каблов 16.08.2022 )
				
				// ДИТ US 76956 ТА 76958 Сержантова А.С. Начало: 02.11.2023 - создание ктк перенесем в команду "ПеренестиВДокумент"
				//// ++ ДИТ Поморцева Т.П. Задача 45162 01.02.2022. Условие было после заполнения НСтр.РазмерКТК =, перенесено,  так как тогда РазмерКТК не заполнялся
				//Если СоздаватьКТК И НЕ ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда
				//	
				//	Если ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
				//		НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
				//	Иначе
				//		Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет создан.");
				//		//НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
				//	КонецЕсли;
				//	
				//	НСтр.РазмерКТК = ВыбратьНужныйРазмерКТК(НСтр.РазмерКТК,НСтр.ПрочитаннаяСсылка);
				////-- Зубов US 33131 TA 43877 16.12.2021				
				////Иначе
				////Евросиб Каблов 15.10.2021 ( Task 39043
				////НСтр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ПрочСтрока, НСтр.РазмерКТК);
				////НСтр.ПрочитаннаяСсылка = НайтиКТК(ПрочСтрока);
				////Евросиб Каблов 15.10.2021 )
				//КонецЕсли;
				////-- Зубов Ticket#0250132 15.11.2021 
				// ДИТ US 76956 ТА 76958 Сержантова А.С. Конец: 02.11.2023
				
				//Евросиб Бозняков( 06.04.2022 TASK 51077
				Если КлиентскийКТК Тогда
					
					//Пункт 6.1
					//Евросиб Каблов 16.08.2022 ( US41519
					//Если НСтр.ВычисленноеКонтрольноеЧисло <> НСтр.КонтрольноеЧислоПользователя Или РаботаСКонтейнерамиСервер.КорректнаяМаска(Лев(ПрочСтрока,4),Сред(ПрочСтрока,5,6)) Тогда
					//	НомерТекущейСтроки = Сч-1;					
					//	Сообщить("Номер контейнера в строке  " + Строка(НомерТекущейСтроки) + "  указан неверно!");
					//КонецЕсли;
					Если Не ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И Не ПроверитьКорректностьНомераКонтейнера(НСтр) Тогда
						//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
						Сообщить("Номер контейнера в строке  " + Строка(НомерТекущейСтроки) + "  указан неверно!");						
						ЕстьНекорректныйНомерКТК = Истина;						
					КонецЕсли;
					//Евросиб Каблов 16.08.2022 )
					
					//Пункт 6.2 
					//Субботин 75462 05.10.2023 Начало // убрал проверку при загрузке ктк в рефсцеп
				//	Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И РаботаСКонтейнерамиСервер.КонтейнерВЭксплуатации(НСтр.ПрочитаннаяСсылка)  Тогда
				    Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И РаботаСКонтейнерамиСервер.КонтейнерВЭксплуатации(НСтр.ПрочитаннаяСсылка) и не ЭтоРефсцеп Тогда					
					//Субботин 75462 05.10.2023 КОнец	
						Результат.Удалить(НСтр);
						//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
						Сообщить("Контейнер в строке " + Строка(НомерТекущейСтроки) + " имеется в АРМ КТК с открытым циклом пользования");
						Сч = Сч + 1;
						ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
						Продолжить;
					КонецЕсли;
					
					//Пункт 6.6
					//ДИТ Шевченко А.В. 16.11.22 16.11.22 -начало 
					Если ЭтоРефрижераторныйКТК(ВРег(Лев(ПрочСтрока, 4))) И Не РефрижераторныйКТК Тогда	
						Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда
							Если ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НСтр.ПрочитаннаяСсылка, "ТипТЕ") = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка") Тогда
								//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
								Сообщить("Возможно, контейнер  " + Строка(ПрочСтрока) + " (строка " + Строка(НомерТекущейСтроки) + ") является рефрижераторным. Если это так, установите признак «Рефрижераторный КТК» в окне вставки контейнеров из буфера обмена при добавлении этого КТК в заявку.».");	
							КонецЕсли;	
						Иначе
							//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
							Сообщить("Возможно, контейнер  " + Строка(ПрочСтрока) + " (строка " + Строка(НомерТекущейСтроки) + ") является рефрижераторным. Если это так, установите признак «Рефрижераторный КТК» в окне вставки контейнеров из буфера обмена при добавлении этого КТК в заявку.».");
						КонецЕсли;								
					КонецЕсли;
					//ДИТ Шевченко А.В. 16.11.22 16.11.22 -конец
					
					//Пункт 7.2
					//Евросиб Каблов 27.07.2022 ( Task 51077
					//Если РефрижераторныйКТК Не ПризнакРефрижераторный(НСтр.РазмерКТК) Тогда
					//ДИТ Шевченко А.В. 16.11.22 16.11.22 -начало
					Если РефрижераторныйКТК И ЗначениеЗаполнено(НСтр.РазмерКТК) И Не ПризнакРефрижераторный(НСтр.РазмерКТК) Тогда
						//Евросиб Каблов 27.07.2022 )
						Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) Тогда
							Если ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НСтр.ПрочитаннаяСсылка, "ТипТЕ") = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка") Тогда
								НСтр.РазмерКТК = ПолучитьПустуюСсылкуТипоразмерыТЕ();
								//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал					
								Сообщить("Указанный в строке  " + Строка(НомерТекущейСтроки) + " тип не соответствует типу рефрижераторного контейнера. Измените/удалите тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");	
							КонецЕсли;	
						Иначе
							НСтр.РазмерКТК = ПолучитьПустуюСсылкуТипоразмерыТЕ();
							//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал					
							Сообщить("Указанный в строке  " + Строка(НомерТекущейСтроки) + " тип не соответствует типу рефрижераторного контейнера. Измените/удалите тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");	
						КонецЕсли;		
					КонецЕсли; 
					//ДИТ Шевченко А.В. 16.11.22 16.11.22 -конец
					
					//Пункт 6.8
					//Евросиб Каблов 27.07.2022 ( Task 51077
					//Если ЗначениеЗаполнено(НСтр.ПрочитаннаяСсылка) И ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
					//	ТипТЕИзКарточкиКонтейнера = РаботаСКонтейнерамиСервер.ПолучитьТипТЕ(НСтр.ПрочитаннаяСсылка);
					//	Если ТипТЕИзКарточкиКонтейнера <> Неопределено Тогда
					РазмерКТКЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НСтр.РазмерКТКСтрока);
					ТипТЕИзКарточкиКонтейнера = РаботаСКонтейнерамиСервер.ПолучитьТипТЕ(НСтр.ПрочитаннаяСсылка);
					Если ТипТЕИзКарточкиКонтейнера <> Неопределено Тогда 
						//Субботин 75462 05.10.2023 Начало // убрал проверку при загрузке ктк в рефсцеп
						Если НЕ ЭтоРефсцеп тогда 
							//Субботин 75462 05.10.2023 КОнец
							Если ЗначениеЗаполнено(РазмерКТКЧисло) Тогда
								Если ТипТЕИзКарточкиКонтейнера.РазмерКТКЧисло <> РазмерКТКЧисло Тогда
									//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
									Сообщить("Введенные данные о типоразмере контейнера в строке " + Строка(НомерТекущейСтроки) + " не соответствуют имеющимся в карточке контейнера. В область прочитанных данных внесен типоразмер из карточки контейнера.");
								КонецЕсли;
								//Евросиб Каблов 27.07.2022 )										
							ИначеЕсли НСтр.РазмерКТК <> ТипТЕИзКарточкиКонтейнера.ТипТЕ Тогда
								//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
								Сообщить("Введенные данные о типоразмере контейнера в строке " + Строка(НомерТекущейСтроки) + " не соответствуют имеющимся в карточке контейнера. В область прочитанных данных внесен типоразмер из карточки контейнера.");					
							КонецЕсли;
							//Субботин 75462 05.10.2023 Начало // если это рефсцеп и пользователь ввел размер проверяем его корректность
						Иначе
							Если ЗначениеЗаполнено(НСтр.РазмерКТК) тогда
								Если ЗначениеЗаполнено(РазмерКТКЧисло) Тогда
									Если ТипТЕИзКарточкиКонтейнера.РазмерКТКЧисло <> РазмерКТКЧисло Тогда
										//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
										Сообщить("Введенные данные о типоразмере контейнера в строке " + Строка(НомерТекущейСтроки) + " не соответствуют имеющимся в карточке контейнера. В область прочитанных данных внесен типоразмер из карточки контейнера.");
									КонецЕсли;
									//Евросиб Каблов 27.07.2022 )										
								ИначеЕсли НСтр.РазмерКТК <> ТипТЕИзКарточкиКонтейнера.ТипТЕ Тогда
									//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
									Сообщить("Введенные данные о типоразмере контейнера в строке " + Строка(НомерТекущейСтроки) + " не соответствуют имеющимся в карточке контейнера. В область прочитанных данных внесен типоразмер из карточки контейнера.");					
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
						//Субботин 75462 05.10.2023 КОнец
						НСтр.РазмерКТК = ТипТЕИзКарточкиКонтейнера.ТипТЕ;
					КонецЕсли;
					
					//Пункт 6.7
					Если Не ЗначениеЗаполнено(НСтр.РазмерКТК) Тогда
						Сообщить("Не определен размер КТК для контейнера "+ПрочСтрока+". Контейнер не будет добавлен.");
					КонецЕсли;    
					
				КонецЕсли;
				//Евросиб Бозняков )  
							
			КонецЕсли;
			
			// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Начало: 26.11.2024
			Если ПоказыватьДатуИзготовленияКТК Тогда
				Если НСтр.ВычисленноеКонтрольноеЧисло <> НСтр.КонтрольноеЧислоПользователя Тогда
					Текст = СтрШаблон("Номер контейнера (%1) в строке %2 указан неверно!", ПрочСтрока, Результат.Индекс(НСтр) + 1); 
					ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
				Иначе
					НСтр.ДатаИзготовленияКТК = ПреобразованиеВДату(СтрокаДатаИзготовленияКТК);
				КонецЕсли;
			КонецЕсли;  
			// ДИТ US 93168 ТА 96594 Лаврентьев О.М. Конец: 26.11.2024
			
			Если ПоказатьПрибытиеНаТерминалОтпр Тогда
				НСтр.ВремяПрибытияНаТерминал = ПреобразованиеВДату(СтрДатаПрибытия);
			КонецЕсли;
			Если ПоказатьДатаДоставкиГруза Тогда
				НСтр.ДатаДоставкиГруза = ПреобразованиеВДату(СтрДатаДоставкиГруза);
				//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, начало
				Если НСтр.ДатаДоставкиГруза > КонецДня(ТекущаяДата()) Тогда
					НСтр.ДатаДоставкиГруза = Дата(1,1,1);
					//НомерТекущейСтроки = Сч-1; //ДИТ, Беляев СЮ, Код-ревью, 22-12-2023, закомментировал
					Сообщить("Дата доставки груза не может быть больше текущей даты в строке " + Строка(НомерТекущейСтроки));					
				КонецЕсли;
				//ДИТ, Беляев СЮ, US 64448/ TA 78671, 12-12-2023, конец
			КонецЕсли; 
//Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
			Если ЕстьВодительТС Тогда
				НСтр.ВодительТС = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьВодительТС).Текст);
			КонецЕсли;
			Если ЕстьДатаПриемаВСток Тогда
				НСтр.ДатаПриемаВСток = ПреобразованиеВДату(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьДатаПриемаВСток).Текст);
			КонецЕсли;
			Если ЕстьКонтрагент Тогда
				СтрКонтрагент = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьКонтрагент).Текст);
				Нстр.Контрагент = ПолучитьКонтрагентаПоСинониму(СтрКонтрагент);
				Нстр.СтрокаКонтрагент = СтрКонтрагент;
			КонецЕсли;
			Если ЕстьНомерТС Тогда
				НСтр.НомерТС = СокрЛП(ТД.Область("R"+Формат(Сч, "ЧГ=0")+ОбластьНомерТС).Текст);
			КонецЕсли;
// Евросиб Гудкова)
		КонецЕсли;
		
		Сч = Сч + 1;
		ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	КонецЦикла;
	
	//Евросиб Каблов 16.08.2022 ( US41519
	Если ЕстьНекорректныйНомерКТК Тогда
		ПоказатьПредупреждение(, "Не удалось записать контейнер!");
	КонецЕсли;
	//Евросиб Каблов 16.08.2022 )
	
	// после распознавания, если стоит флаг "Автовставка", вызвать процедуру переноса значений в документ
	Если Автовставка Тогда
		ПеренестиВДокументКлиент();
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьТипоразмерКТК(РазмерКТКСтрока, РефрижераторныйКТК) 
	
	//Евросиб СубботинВ #82679 18.06.2024 Начало // переделал на использование общего модуля
	//Рез = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	//
	//Если РазмерКТКСтрока = "20" Или РазмерКТКСтрока = "40" Или РазмерКТКСтрока = "45" Тогда //Евросиб Бозняков( 06.04.2022 TASK 51077 Дополнительное условие на размер "45" 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ТипоразмерыТЕ.Ссылка КАК Ссылка
	//	               |ИЗ
	//	               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	//	               |ГДЕ
	//				   		//Евросиб Бозняков( 06.04.2022 TASK 51077 Скорректировано условие с учетом поиска Рефрижераторного КТК 
	//	               |	"+?(РефрижераторныйКТК,"ТипоразмерыТЕ.Рефрижераторный","ТипоразмерыТЕ.ИспользоватьПоУмолчаниюДляКТКУказанногоРазмера")+" 
	//	               |	И ТипоразмерыТЕ.РазмерКТК.Наименование = &Наименование";
	//	Запрос.УстановитьПараметр("Наименование",РазмерКТКСтрока);
	//	
	//	Ответ = Запрос.Выполнить().Выбрать();
	//	
	//	Если Ответ.Следующий() Тогда
	//		Рез = Ответ.Ссылка;
	//	КонецЕсли;
	//Иначе //Евросиб Гудкова( 09.09.2020 Ticket№ 0204605
	//	Рез = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(РазмерКТКСтрока), Истина);
	//КонецЕсли; 
	//            
	//Возврат Рез;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
    Возврат РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(РазмерКТКСтрока,РефрижераторныйКТК).Тип;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
КонецФункции
	
&НаСервереБезКонтекста
Функция НайтиКТК(Знач НомерКТК, РазмерКТК) //++ Зубов US 33131 TA 43877 16.12.2021 добавили размер ктк
	
	Результат = Неопределено;
	Если НомерКТК = "" Тогда Возврат Результат; КонецЕсли;
	НомерКТК = СтрЗаменить(НомерКТК, " ", "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.ПС, "");
	НомерКТК = СтрЗаменить(НомерКТК, Символы.Таб, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТЕ.Ссылка КАК Ссылка,
	               |	ТЕ.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |ГДЕ
	               |	ТЕ.Префикс = &Префикс
	               |	И ТЕ.Номер = &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТЕ.ПометкаУдаления";
	Запрос.УстановитьПараметр("Префикс", Лев(ВРег(НомерКТК), 4));
	Запрос.УстановитьПараметр("Номер", Сред(НомерКТК, 5, 6));
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Если Результат <> Неопределено И Результат.ПометкаУдаления = Истина Тогда
		РезОбъект = Результат.ПолучитьОбъект();
		РезОбъект.ПометкаУдаления = Ложь;
		РезОбъект.Записать();
	КонецЕсли;
	
	//++ Зубов US 33131 TA 43877 16.12.2021
	Если Результат <> Неопределено И НЕ ЗначениеЗаполнено(Результат.ТипТЕ) И ЗначениеЗаполнено(РазмерКТК) Тогда
		РезОбъект = Результат.ПолучитьОбъект();
		РезОбъект.ТипТЕ = РазмерКТК;
		РезОбъект.Записать();
	КонецЕсли;
	//-- Зубов US 33131 TA 43877 16.12.2021
	Возврат Результат;
	
КонецФункции

//Евросиб Гудкова( 04.01.2020 
&НаСервереБезКонтекста
Функция НайтиНакладную(НомерНакладной) 
	
	Результат = Неопределено;
	Если НомерНакладной = "" Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	НЕ ТранспортныйДокумент.ПометкаУдаления
	               |	И ТранспортныйДокумент.НомерТранспортногоДокумента = &Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.ДатаТранспортногоДокумента УБЫВ";
	Запрос.УстановитьПараметр("Наименование", НомерНакладной);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Евросиб Гудкова)

// ++ ДИТ_Агафонов_task 37859 19.08.2022
&НаСервереБезКонтекста
Функция НайтиКонтрагента(НаименованиеКонтрагента) 
	
	Результат = Неопределено;
	Если НаименованиеКонтрагента = "" Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ПометкаУдаления
	               |	И Контрагенты.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименованиеКонтрагента);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция НайтиНоменклатуру(НаименованиеНоменклатуры) 
	
	Результат = Неопределено;
	Если НаименованиеНоменклатуры = "" Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.ПометкаУдаления
	               |	И Номенклатура.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименованиеНоменклатуры);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// -- ДИТ_Агафонов_task 37859 19.08.2022

&НаКлиенте
Функция ПреобразованиеВДату(ТекДата)
	
	Если ФорматДаты = 2 Тогда
		
		Возврат ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(ТекДата, 5);
		
	КонецЕсли;
	
	Рез = Неопределено;
	
	ТекДата = СокрЛП(ТекДата);	
 	КоличествоСимволов = СтрДлина(ТекДата);
	Год = "";
	Месяц = "";
	День = "";
	Час = "0";
	Минута = "0";
	Секунда = "0";
	ЧастьДаты = 0;
	
	Для Сч = 1 По КоличествоСимволов Цикл
		Код = КодСимвола(Сред(ТекДата,Сч)); 
		// Цифры: 48 - 57
		Если Код < 48 ИЛИ Код>57 Тогда 
			// нашли разделитель
			ЧастьДаты = ЧастьДаты + 1;
		Иначе
			Если ФорматДаты = 0 Тогда
				// всего есть от 3 до 6 частей даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
				Если ЧастьДаты = 0 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 3 Тогда
					Час = Строка(Час) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 4 Тогда
					Минута = Строка(Минута) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 5 Тогда
					Секунда = Строка(Секунда) + Строка(Сред(ТекДата,Сч,1));
				КонецЕсли;
				// для этого формата всего есть 3 части даты. по мере получения каждой части, значение в ЧастьДаты увеличивается на 1
			ИначеЕсли ФорматДаты = 1 Тогда
				Если ЧастьДаты = 0 Тогда
					Год = Строка(Год) + Строка(Сред(ТекДата,Сч,1));
				ИначеЕсли ЧастьДаты = 1 Тогда
					Месяц = Строка(Месяц) + Строка(Сред(ТекДата,Сч,1)); 
				ИначеЕсли ЧастьДаты = 2 Тогда
					День = Строка(День) + Строка(Сред(ТекДата,Сч,1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Год) = 2 Тогда
		Год = Строка("20") + Строка(Год);
	КонецЕсли;
	Если СтрДлина(Месяц) = 1 Тогда
		Месяц = Строка("0") + Строка(Месяц);
	КонецЕсли;
	Если СтрДлина(День) = 1 Тогда
		День = Строка("0") + Строка(День);
	КонецЕсли;
	Если СтрДлина(Час) = 1 Тогда
		Час = Строка("0") + Строка(Час);
	КонецЕсли;
	Если СтрДлина(Минута) = 1 Тогда
		Минута = Строка("0") + Строка(Минута);
	КонецЕсли;
	Если СтрДлина(Секунда) = 1 Тогда
		Секунда = Строка("0") + Строка(Секунда);
	КонецЕсли;
	
	Попытка
		Рез = Дата(Год,Месяц,День,Час,Минута,Секунда);
	Исключение
		Рез = Неопределено;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции
	
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокументКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументКлиент()
	
	Результат8 = Новый Массив;
	РезультатДаты = Новый Массив;
	РезДатыПрибытНаТерм = Новый Массив;
	РезультатРазмерКТК = Новый Массив;
	РезультатКонтрагент = Новый Массив;
	РезультатДатаПриемаВСток = Новый Массив;
	РезультатВодительТС = Новый Массив;
	РезультатНомерТС = Новый Массив;
	РезДатыДоставкиГруза = Новый Массив;
	ВсеХорошо = Истина;
	// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Начало: 26.11.2024
	РезультатДатаИзготовленияКТК = Новый Массив;
	// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Конец: 26.11.2024

		
	Если ВозвращатьСтроки тогда
		
		Для каждого Стр из Результат Цикл
			Если ЗначениеЗаполнено(Стр.ПрочитаннаяСтрока) Тогда
				Результат8.Добавить(Стр.ПрочитаннаяСтрока);
				РезультатДаты.Добавить(Стр.ДатаВзятия);
				РезДатыПрибытНаТерм.Добавить(Стр.ВремяПрибытияНаТерминал);
				РезультатРазмерКТК.Добавить(Стр.РазмерКТКСтрока);
				РезультатКонтрагент.Добавить(Стр.Контрагент);
				РезультатДатаПриемаВСток.Добавить(НачалоДня(Стр.ДатаПриемаВСток));
				РезультатВодительТС.Добавить(Стр.ВодительТС);
				РезультатНомерТС.Добавить(Стр.НомерТС);
				РезДатыДоставкиГруза.Добавить(Стр.ДатаДоставкиГруза); 
				// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Начало: 26.11.2024
				РезультатДатаИзготовленияКТК.Добавить(Стр.ДатаИзготовленияКТК);
				// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Конец: 26.11.2024
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		//Евросиб Каблов 16.08.2022 ( US41519
		Если СоздаватьКТКПриПереносеВДокумент Тогда
			СоздатьДозаполнитьКонтейнерыСервер();
		КонецЕсли;
		//Евросиб Каблов 16.08.2022 )
		
		Для каждого Стр из Результат Цикл
			
			Если ЗначениеЗаполнено(Стр.ПрочитаннаяСсылка) Тогда
				Если ЕстьКонтрагент И НЕ ЗначениеЗаполнено(Стр.Контрагент) Тогда
					ВсеХорошо = Ложь;
					Продолжить;
				КонецЕсли;
				//Евросиб Каблов 27.07.2022 ( Task 51077
				Если КлиентскийКТК И Не ЗначениеЗаполнено(Стр.РазмерКТК) Тогда
					ВсеХорошо = Ложь;
					Продолжить;
				КонецЕсли;
				//Евросиб Каблов 27.07.2022 )
				Результат8.Добавить(Стр.ПрочитаннаяСсылка);
				РезультатДаты.Добавить(Стр.ДатаВзятия);
				РезДатыПрибытНаТерм.Добавить(Стр.ВремяПрибытияНаТерминал);
				РезультатРазмерКТК.Добавить(Стр.РазмерКТК);
				РезультатКонтрагент.Добавить(Стр.Контрагент);
				РезультатДатаПриемаВСток.Добавить(НачалоДня(Стр.ДатаПриемаВСток));
				РезультатВодительТС.Добавить(Стр.ВодительТС);
				РезультатНомерТС.Добавить(Стр.НомерТС);
				РезДатыДоставкиГруза.Добавить(Стр.ДатаДоставкиГруза); 
				// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Начало: 26.11.2024
				РезультатДатаИзготовленияКТК.Добавить(Стр.ДатаИзготовленияКТК);
				// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Конец: 26.11.2024

			Иначе
				ВсеХорошо = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураМассивов = Новый Структура;
	СтруктураМассивов.Вставить("КТК",Результат8);
	СтруктураМассивов.Вставить("РазмерКТК",РезультатРазмерКТК);
	СтруктураМассивов.Вставить("ДатыКТК",РезультатДаты);
	СтруктураМассивов.Вставить("ДатыПрибытияНаТерм",РезДатыПрибытНаТерм);
	СтруктураМассивов.Вставить("ДатыДоставкиГруза",РезДатыДоставкиГруза);
	СтруктураМассивов.Вставить("Контрагент",РезультатКонтрагент);
	СтруктураМассивов.Вставить("ДатаПриемаВСток",РезультатДатаПриемаВСток);
	СтруктураМассивов.Вставить("ВодительТС",РезультатВодительТС);
	СтруктураМассивов.Вставить("НомерТС",РезультатНомерТС);
	// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Начало: 26.11.2024  
	СтруктураМассивов.Вставить("ДатаИзготовленияКТК",РезультатДатаИзготовленияКТК);
	// ДИТ US 93168 ТА 95626 Лаврентьев О.М. Конец: 26.11.2024

	
	Если ПоказыватьДатуВзятия ИЛИ ПоказатьПрибытиеНаТерминалОтпр ИЛИ ПоказыватьРазмерКТК Или ЕстьКонтрагент ИЛИ ПоказатьДатаДоставкиГруза Тогда
		ЧтоВозвращаем = СтруктураМассивов;
	Иначе
		ЧтоВозвращаем = Результат8;
	КонецЕсли;
	
	Если ВсеХорошо Тогда
		Закрыть(ЧтоВозвращаем);
	Иначе
		
		ОпОп = Новый ОписаниеОповещения("ВопросПереноса", ЭтаФорма, Новый Структура("СписокРезультат", ЧтоВозвращаем));
		ПоказатьВопрос(ОпОп, "Не все строки найдены. При переносе позиции без найденных строк будут пропущены. Продолжить?", РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПереноса(Параметр1 = неопределено, Параметр2 = неопределено) экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да Тогда
		Закрыть(Параметр2.СписокРезультат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТДПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	// проверять только КТК
	Если не РежимРаботы = "КТК" Тогда
		Возврат;
	КонецЕсли;
	
	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл ЧислаМ.Добавить(Строка(Сч)); КонецЦикла;

	//Евросиб Каблов 16.08.2022 ( US41519
	//Сч = 2;
	//
	//СохраненныйБелый = ТД.Область("R1C4").ЦветФона;
	//
	//ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	//
	//Пока ПрочСтрока <> "" Цикл
	//	Если СтрДлина(ПрочСтрока) = 11 Тогда
	//		КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
	//	КонецЕсли;
	//	Если СтрДлина(ПрочСтрока) <> 11 //////   \/ добавил вот это 
	//		ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(ПрочСтрока,1)) = неопределено  
	//		ИЛИ (СтрДлина(ПрочСтрока) = 11 И НЕ Число(Прав(ПрочСтрока,1)) = КонтрольныйЗнак) Тогда
	//		ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = WebЦвета.Розовый;
	//	Иначе
	//		ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = СохраненныйБелый;
	//	КонецЕсли;
	//	
	//	Сч = Сч + 1;
	//	ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	//КонецЦикла;
	
	СохраненныйБелый = ТД.Область("R1C20").ЦветФона;
	
	Для Сч = 2 По ТД.ВысотаТаблицы Цикл
		ПрочСтрока = ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
		КонтрольныйЗнак = Неопределено;
		Если СтрДлина(ПрочСтрока) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
		КонецЕсли;
		Если ЗначениеЗаполнено(ПрочСтрока) И (СтрДлина(ПрочСтрока) <> 11 //////   \/ добавил вот это 
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(ПрочСтрока,1)) = неопределено  
			ИЛИ (СтрДлина(ПрочСтрока) = 11 И НЕ Число(Прав(ПрочСтрока,1)) = КонтрольныйЗнак)) Тогда
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = WebЦвета.Розовый;
		Иначе
			ТД.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = СохраненныйБелый;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 16.08.2022 )
	
КонецПроцедуры

&НаКлиенте
Процедура Пауза()
    Для Инд = 0 По 10000 Цикл
        
    КонецЦикла;
КонецПроцедуры    

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоСинониму(Контрагент)

	Возврат КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Контрагент);

КонецФункции // ПолучитьКонтрагентаПоСинониму()

//++ Зубов US 33131 TA 43877 16.12.2021
&НаСервере
Функция ВыбратьНужныйРазмерКТК(Знач РазмерКТК,КТК)
	//Если ЗначениеЗаполнено(КТК) Тогда
	//	Если ЗначениеЗаполнено(КТК.ТипТЕ) Тогда
	//		Если РазмерКТК = КТК.ТипТЕ Тогда
	//			Возврат РазмерКТК;
	//		Иначе
	//			Возврат КТК.ТипТЕ;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;      
	//Евросиб - АСуслов 04.01.2022 13:54:49 #45081
	//(
	Если ЗначениеЗаполнено(КТК) Тогда                                             
		ТипТЕ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КТК, "ТипТЕ");
		Если ЗначениеЗаполнено(ТипТЕ) Тогда
			РазмерКТК = ТипТЕ;
		КонецЕсли;
	КонецЕсли;
	Возврат РазмерКТК;
	//)
	//Евросиб - АСуслов 04.01.2022 13:54:50 #45081
КонецФункции
//-- Зубов US 33131 TA 43877 16.12.2021  

//Евросиб Бозняков( 06.04.2022 TASK 51077
&НаСервереБезКонтекста
Функция ПризнакРефрижераторный(РазмерКТК)
	Если ЗначениеЗаполнено(РазмерКТК) И РазмерКТК.Рефрижераторный Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуТипоразмерыТЕ()
	Возврат Справочники.ТипоразмерыТЕ.ПустаяСсылка();	
КонецФункции

&НаКлиенте
Функция ЭтоРефрижераторныйКТК(Префикс) 
	
	МассивПерификсов = Новый Массив;
	
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("KKFU");
	МассивПерификсов.Добавить("AKLU");
	//Евросиб Каблов 27.07.2022 ( Task 51077
	МассивПерификсов.Добавить("ALLU");
	//Евросиб Каблов 27.07.2022 )
	МассивПерификсов.Добавить("EISU");
	МассивПерификсов.Добавить("CBMU");
	МассивПерификсов.Добавить("LCLU");
	МассивПерификсов.Добавить("BTCU");
	МассивПерификсов.Добавить("NSRU");
	МассивПерификсов.Добавить("KZEU");
	МассивПерификсов.Добавить("RFUU");
	МассивПерификсов.Добавить("IRSU");
	МассивПерификсов.Добавить("SEBU");
	МассивПерификсов.Добавить("IIIU");
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("MORU");
	МассивПерификсов.Добавить("TTSU");
	МассивПерификсов.Добавить("GCEU");
	МассивПерификсов.Добавить("VEZU");
	МассивПерификсов.Добавить("FRIU");
	МассивПерификсов.Добавить("CRLU");
	МассивПерификсов.Добавить("MWCU");
	МассивПерификсов.Добавить("MSWU");
	МассивПерификсов.Добавить("MMAU");
	МассивПерификсов.Добавить("RSVU");
	МассивПерификсов.Добавить("RRSU");
	МассивПерификсов.Добавить("MNBU");
	МассивПерификсов.Добавить("APRU");
	МассивПерификсов.Добавить("TTUU");
	МассивПерификсов.Добавить("AVGU");
	МассивПерификсов.Добавить("NARU");
	МассивПерификсов.Добавить("SSUU");
	МассивПерификсов.Добавить("SSSU");
	МассивПерификсов.Добавить("MPBU");
	МассивПерификсов.Добавить("MCUU");
	МассивПерификсов.Добавить("MNFU");
	
	Если МассивПерификсов.Найти(Префикс) <> Неопределено Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции
//Евросиб Бозняков)

//Евросиб Каблов 16.08.2022 US41519
&НаСервере
Функция СоздатьДозаполнитьКонтейнерыСервер()
	
	Для каждого Стр из Результат Цикл
			
		Если Не ЗначениеЗаполнено(Стр.ПрочитаннаяСсылка) И ЗначениеЗаполнено(Стр.ПрочитаннаяСтрока) И ЗначениеЗаполнено(Стр.РазмерКТК) Тогда
			Если ПроверитьКорректностьНомераКонтейнера(Стр) Тогда
				Стр.ПрочитаннаяСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(Стр.ПрочитаннаяСтрока, Стр.РазмерКТК);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Стр.ПрочитаннаяСсылка) И Не ЗначениеЗаполнено(Стр.ПрочитаннаяСсылка.ТипТЕ) И ЗначениеЗаполнено(Стр.РазмерКТК) Тогда
			КонтейнерОбъект = Стр.ПрочитаннаяСсылка.ПолучитьОбъект();
			КонтейнерОбъект.ТипТЕ = Стр.РазмерКТК;
			КонтейнерОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
		
КонецФункции

//Евросиб Каблов 16.08.2022 US41519
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьКорректностьНомераКонтейнера(НСтр)
	
	НомерКорректный = Истина;
	
	Если НСтр.ВычисленноеКонтрольноеЧисло <> НСтр.КонтрольноеЧислоПользователя Или Не РаботаСКонтейнерамиСервер.КорректнаяМаска(Лев(НСтр.ПрочитаннаяСтрока,4),Сред(НСтр.ПрочитаннаяСтрока,5,6)) Тогда
		НомерКорректный = Ложь;
	КонецЕсли;
	
	Возврат НомерКорректный;
					
КонецФункции
