//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, начало
Функция НайтиСтатусДокументаПоКодуСтатуса(КодСтатуса) Экспорт 
	
	Результат = Справочники.СтатусыДокументов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыДокументов КАК СтатусыДокументов
		|ГДЕ
		|	СтатусыДокументов.КодСтатуса = &КодСтатуса";
	
	Запрос.УстановитьПараметр("КодСтатуса", КодСтатуса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, конец