// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаполнитьДеревоДокументов();
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для создания пакетов используйте обработку ""АРМ Журнал учета оригиналов ИСФ""");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
	РазвернутьДеревоДокументов();
	
	Если ПакетЗакрыт=Истина Тогда
		Элементы.ДеревоДокументовКоличествоЭкземпляров.ТолькоПросмотр = Истина;	
		Элементы.ДеревоДокументовКоличествоЛистов.ТолькоПросмотр = Истина;	
		Элементы.СпособОтправки.ТолькоПросмотр = Истина;	
		Элементы.Пользователь.ТолькоПросмотр = Истина;	
		Элементы.ДатаОтправки.ТолькоПросмотр = Истина;	
		Элементы.Примечание.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	ЭлементОтбора = История.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Пакет");
    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование    = Истина;
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение   = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПакетыДокументовПечатныеФормы.Документ КАК Документ,
	               |	ПакетыДокументовПечатныеФормы.ИмяПФ КАК ИмяПФ,
	               |	ПакетыДокументовПечатныеФормы.КоличествоЭкземпляров КАК КоличествоЭкземпляров,
	               |	ПакетыДокументовПечатныеФормы.КоличествоЛистов КАК КоличествоЛистов,
	               |	ПакетыДокументовПечатныеФормы.ДокументПФ КАК ДокументПФ,
	               |	ПакетыДокументовПечатныеФормы.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТаблицаПФ
	               |ИЗ
	               |	Справочник.ПакетыДокументов.ПечатныеФормы КАК ПакетыДокументовПечатныеФормы
	               |ГДЕ
	               |	ПакетыДокументовПечатныеФормы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПакетыДокументовСрезПоследних.Период КАК Период,
	               |	ПакетыДокументовСрезПоследних.Пакет КАК Пакет,
	               |	ПакетыДокументовСрезПоследних.Документ КАК Документ,
	               |	ПакетыДокументовСрезПоследних.СпособОтправки КАК СпособОтправки,
	               |	ПакетыДокументовСрезПоследних.Событие КАК Событие,
	               |	ПакетыДокументовСрезПоследних.ДатаСобытия КАК ДатаСобытия,
	               |	ПакетыДокументовСрезПоследних.Пользователь КАК Пользователь,
	               |	ПакетыДокументовСрезПоследних.Примечание КАК Примечание,
	               |	ПакетыДокументовСрезПоследних.Изменен КАК Изменен,
	               |	ПакетыДокументовСрезПоследних.Подписан КАК Подписан,
	               |	ПакетыДокументовСрезПоследних.ПричинаНеПодписан КАК ПричинаНеПодписан,
	               |	ПакетыДокументовСрезПоследних.ДатаОтправки КАК ДатаОтправки,
	               |	ПакетыДокументовСрезПоследних.ДатаВозврата КАК ДатаВозврата,
	               |	ПакетыДокументовСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.ПакетыДокументов.СрезПоследних(, Пакет = &Ссылка) КАК ПакетыДокументовСрезПоследних
	               |ГДЕ
	               |	ПакетыДокументовСрезПоследних.Пакет = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ДанныеРегистра.Документ, ТаблицаПФ.Документ) КАК Документ,
	               |	ЕСТЬNULL(ДанныеРегистра.Событие, """") КАК Событие,
	               |	ЕСТЬNULL(ДанныеРегистра.ДатаСобытия, """") КАК ДатаСобытия,
	               |	ДанныеРегистра.Подписан КАК Подписан,
	               |	ДанныеРегистра.Примечание КАК Примечание,
	               |	ЕСТЬNULL(ТаблицаПФ.ИмяПФ, """") КАК ИмяПФ,
	               |	ТаблицаПФ.КоличествоЭкземпляров КАК КоличествоЭкземпляров,
	               |	ТаблицаПФ.КоличествоЛистов КАК КоличествоЛистов,
	               |	ТаблицаПФ.ДокументПФ КАК ДокументПФ,
	               |	ЕСТЬNULL(ДанныеРегистра.ПричинаНеПодписан, """") КАК ПричинаНеПодписан,
	               |	ТаблицаПФ.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ДанныеРегистра КАК ДанныеРегистра
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПФ КАК ТаблицаПФ
	               |		ПО ДанныеРегистра.Документ = ТаблицаПФ.Документ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Документ,
	               |	ИмяПФ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДокументТек = неопределено;
	ДеревоДокументовЗнач = РеквизитФормыВЗначение("ДеревоДокументов");
	Если ДеревоДокументовЗнач=Неопределено Тогда
		ДеревоДокументовЗнач = новый ДеревоЗначений;
	КонецЕсли;
	ДеревоДокументовЗнач.Строки.Очистить();
	
	ЕстьВозвращен = Ложь;
	ЕстьОтправлен = Ложь;
	ЕстьАннулирован = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Документ<>ДокументТек Тогда
			СтрокаДокумент=ДеревоДокументовЗнач.Строки.Добавить();	
			СтрокаДокумент.Документ = Выборка.Документ;
			СтрокаДокумент.Состояние_ИмяПФ = ""+Выборка.Событие+" от "+Формат(Выборка.ДатаСобытия,"ДФ=dd.MM.yyyy")+?(выборка.Подписан = Истина," ПОДПИСАН","");
		    СтрокаДокумент.Примечание_ДокументПФ = Выборка.ПричинаНеПодписан;
			ДокументТек = Выборка.Документ;
			Если Выборка.Событие = Перечисления.СобытияОтправкиДокументов.Возвращен
				или Выборка.Событие = Перечисления.СобытияОтправкиДокументов.Аннулирован
				Тогда
			    СтрокаДокумент.Блок = Истина;
			КонецЕсли;
			Если Выборка.Событие = Перечисления.СобытияОтправкиДокументов.Возвращен Тогда
				ЕстьВозвращен = Истина;		
			ИначеЕсли Выборка.Событие = Перечисления.СобытияОтправкиДокументов.Отправлен Тогда
				ЕстьОтправлен = Истина;
			ИначеЕсли Выборка.Событие = Перечисления.СобытияОтправкиДокументов.Аннулирован Тогда	
				ЕстьАннулирован = Ложь
			КонецЕсли;
		КонецЕсли;	
		СтрокаПФ = СтрокаДокумент.Строки.Добавить();
		СтрокаПФ.Документ = СтрокаДокумент.Документ; 
		СтрокаПФ.Блок = СтрокаДокумент.Блок;
		СтрокаПФ.Состояние_ИмяПФ = Выборка.ИмяПФ;
		СтрокаПФ.КоличествоЭкземпляров = Выборка.КоличествоЭкземпляров;
		СтрокаПФ.КоличествоЛистов = Выборка.КоличествоЛистов;
		СтрокаПФ.КоличествоЭкземпляров1 = Выборка.КоличествоЭкземпляров;
		СтрокаПФ.КоличествоЛистов1 = Выборка.КоличествоЛистов;
		СтрокаПФ.Примечание_ДокументПФ = Выборка.ДокументПФ;
		СтрокаПФ.НомерСтроки = Выборка.НомерСтроки;
	КонецЦикла;
	
	Если ЕстьОтправлен = Истина Тогда
		ПакетЗакрыт = Ложь;
	Иначе	
		ПакетЗакрыт = Истина;
	КонецЕсли;
	
	Если ЕстьОтправлен = Истина Тогда
		Если ЕстьВозвращен = Ложь и ЕстьАннулирован = Ложь Тогда
			ТекущееСостояние = "отправлен";	
		ИначеЕсли ЕстьВозвращен = Истина и ЕстьАннулирован = Ложь Тогда
			ТекущееСостояние = "частично возвращен";	
		ИначеЕсли ЕстьВозвращен = Ложь и ЕстьАннулирован = Истина Тогда
			ТекущееСостояние = "частично аннулирован";	
		Иначе	
			ТекущееСостояние = "частично возвращен\аннулирован";	
		КонецЕсли;
	Иначе	
		Если ЕстьВозвращен = Ложь и ЕстьАннулирован = Ложь Тогда
			ТекущееСостояние = "Нет данных";	
		ИначеЕсли ЕстьВозвращен = Истина и ЕстьАннулирован = Ложь Тогда
			ТекущееСостояние = "возвращен";	
		ИначеЕсли ЕстьВозвращен = Ложь и ЕстьАннулирован = Истина Тогда
			ТекущееСостояние = "аннулирован";	
		Иначе	
			ТекущееСостояние = "возвращен\аннулирован";	
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоДокументовЗнач,"ДеревоДокументов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПакетыДокументов.СпособОтправки КАК СпособОтправки,
	|	ПакетыДокументов.Пользователь КАК Пользователь,
	|	ПакетыДокументов.ДатаОтправки КАК ДатаОтправки,
	|	ПакетыДокументов.Примечание КАК Примечание
	|ИЗ
	|	Справочник.ПакетыДокументов КАК ПакетыДокументов
	|ГДЕ
	|	ПакетыДокументов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СсылкаЗначение_СпособОтправки = Выборка.СпособОтправки;
	    СсылкаЗначение_Пользователь	= Выборка.Пользователь;
	    СсылкаЗначение_ДатаОтправки = Выборка.ДатаОтправки; 
	    СсылкаЗначение_Примечание = Выборка.Примечание; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоДокументов()

	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	Для каждого элемент из  ЭлементыДерева цикл
		элементы.ДеревоДокументов.Развернуть(элемент.ПолучитьИдентификатор(),Истина);                   	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовКоличествоЛистовПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЭтаФорма.Модифицированность = Истина;
	ТД = Элементы.ДеревоДокументов.ТекущиеДанные;
	СтрокаТЧ = Объект.ПечатныеФормы.НайтиПоИдентификатору(ТД.НомерСтроки-1);
	СтрокаТЧ.КоличествоЛистов = ТД.КоличествоЛистов;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	////Значит ничего не записали
	//Если ЭтаФорма.Модифицированность = Истина Тогда
	//	Возврат;
	//КонецЕсли;
	Если 
		Объект.СпособОтправки<>СсылкаЗначение_СпособОтправки
		//Или Объект.Пользователь<>СсылкаЗначение_Пользователь
		Или Объект.ДатаОтправки<>СсылкаЗначение_ДатаОтправки
		Или Объект.Примечание<>СсылкаЗначение_Примечание
		Тогда
		ЕстьИзменениеШапки = Истина;
	Иначе	
		ЕстьИзменениеШапки = Ложь;
	КонецЕсли;
	
	МассивДокументовДляИзменения = Новый Массив;
	
	ДеревоДокументовЗЧ = РеквизитФормыВЗначение("ДеревоДокументов");
	Если ДеревоДокументовЗЧ = Неопределено Тогда
		ДеревоДокументовЗЧ = Новый ДеревоЗначений;
	КонецЕсли;
	
	Для каждого СтрокаДокумента Из ДеревоДокументовЗЧ.строки Цикл
		Если СтрокаДокумента.Блок = Истина Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ЕстьИзменениеШапки Тогда
			МассивДокументовДляИзменения.Добавить(СтрокаДокумента.Документ);		
		Иначе	
			Для каждого СтрокаПФ Из СтрокаДокумента.Строки Цикл
				Если СтрокаПФ.КоличествоЭкземпляров<>СтрокаПФ.КоличествоЭкземпляров1
					Или СтрокаПФ.КоличествоЛистов<>СтрокаПФ.КоличествоЛистов1 Тогда
					МассивДокументовДляИзменения.Добавить(СтрокаДокумента.Документ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТекДата = ТекущаяДата();
	НаборЗаписей = РегистрыСведений.ПакетыДокументов.СоздатьНаборЗаписей();
	Для каждого ДокументДвижения Из МассивДокументовДляИзменения Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДатаОтправки = Объект.ДатаОтправки;
		НоваяЗапись.ДатаСобытия = Объект.ДатаОтправки;
		НоваяЗапись.ДоговорКонтрагента = ДокументДвижения.ДоговорКонтрагента;
		НоваяЗапись.Документ = ДокументДвижения;
		НоваяЗапись.Изменен = Истина;
		НоваяЗапись.Пакет = Объект.Ссылка;
		НоваяЗапись.Период = ТекДата;
		НоваяЗапись.Пользователь = Объект.Пользователь;
		НоваяЗапись.Примечание = Объект.Примечание;
		НоваяЗапись.Событие = Перечисления.СобытияОтправкиДокументов.Отправлен;
		НоваяЗапись.СпособОтправки = Объект.СпособОтправки;
	КонецЦикла;
	НаборЗаписей.Записать(Ложь);
	
	ЗаполнитьДеревоДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если 
		Объект.СпособОтправки<>СсылкаЗначение_СпособОтправки
		Или Объект.Пользователь<>СсылкаЗначение_Пользователь
		Или Объект.ДатаОтправки<>СсылкаЗначение_ДатаОтправки
		Или Объект.Примечание<>СсылкаЗначение_Примечание
		Тогда
		ЕстьИзменения = Истина;
	Иначе	
		ЕстьИзменения = Ложь;
	КонецЕсли;
	
	Если ЕстьИзменения=Ложь Тогда
		ДеревоДокументовЗЧ = РеквизитФормыВЗначение("ДеревоДокументов");
		Если ДеревоДокументовЗЧ = Неопределено Тогда
			ДеревоДокументовЗЧ = Новый ДеревоЗначений;
		КонецЕсли;
		Для каждого СтрокаДокумента Из ДеревоДокументовЗЧ.строки Цикл
			Для каждого СтрокаПФ Из СтрокаДокумента.Строки Цикл
				Если СтрокаПФ.КоличествоЭкземпляров<>СтрокаПФ.КоличествоЭкземпляров1
					Или СтрокаПФ.КоличествоЛистов<>СтрокаПФ.КоличествоЛистов1 Тогда
						ЕстьИзменения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьИзменения Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьИзменения и Не ТекущийОбъект.Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
		ТекущийОбъект.Пользователь = ПараметрыСеанса.ТекущийПользователь;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьАннулироватьПакет(Команда)
	Если ЭтаФорма.Модифицированность Тогда
	ПоказатьПредупреждение(,"Сначала завершите редактирование пакета!");
	Иначе	
	ПараметрыОткрытия = Новый Структура;
	СписокПакетов = Новый СписокЗначений;
	СписокПакетов.Добавить(Объект.Ссылка);
	ПараметрыОткрытия.Вставить("СписокПакетов",СписокПакетов);
	ОткрытьФорму("Обработка.АРМ_ЖурналУчетаОригиналовИСФ.Форма.ФормаЗакрытияПакетов", ПараметрыОткрытия);
	ЭтаФорма.Закрыть();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрупповаяПечатьНаСервере(МассивВызововПечати, СтруктураПодписантов)
	Если МассивВызововПечати = Неопределено Тогда
		МассивВызововПечати = Новый Массив;	
	КонецЕсли;	
	ДанныеДЗ = РеквизитФормыВЗначение("ДеревоДокументов");
	Если ДанныеДЗ = Неопределено Тогда
		ДанныеДЗ = Новый ДеревоЗначений;	
	КонецЕсли;
	
	ВыделенныеСтр = Новый Массив;
	ДобавленныеСтроки = новый СписокЗначений;
	Для каждого СтрокаТек Из ДанныеДЗ.Строки Цикл
		Если ДобавленныеСтроки.НайтиПоЗначению(СтрокаТек.Документ)=Неопределено Тогда
			ВыделенныеСтр.Добавить(СтрокаТек.Документ);			
			ДобавленныеСтроки.Добавить(СтрокаТек.Документ);	
		КонецЕсли;
	КонецЦикла;
	ПараметрКоманды = Новый Массив;
	Для Каждого Элем Из ВыделенныеСтр Цикл
		ПараметрКоманды.Добавить(Элем);
	КонецЦикла;
	МассивДокументовКонтрагента = СозданиеТаблицыДокументов(ВыделенныеСтр,СтруктураПодписантов);
	Для каждого ТекГруппировка Из МассивДокументовКонтрагента Цикл
	Для каждого СтруктураПФ Из ТекГруппировка.МассивТДПоКлиенту Цикл
		КоличествоЭкземпляров = 1;	
		Если СтруктураПФ.Свойство("СсылкаДокПервоначальная") Тогда
		СтрокаДокумента = ДанныеДЗ.Строки.Найти(СтруктураПФ.СсылкаДокПервоначальная,"Документ");
		СтрокаСКоличеством = СтрокаДокумента.Строки.Найти(СтруктураПФ.ИмяПФ,"Состояние_ИмяПФ");	
		Если СтрокаСКоличеством=Неопределено и СтруктураПФ.Свойство("СсылкаДок") Тогда
			СтрокаСКоличеством = СтрокаДокумента.Строки.Найти(СтруктураПФ.СсылкаДок,"Примечание_ДокументПФ");	
		КонецЕсли;
		Если Не СтрокаСКоличеством=Неопределено Тогда
			КоличествоЭкземпляров = СтрокаСКоличеством.КоличествоЭкземпляров;	
		КонецЕсли;
		КонецЕсли;
		СтруктураПФ.Вставить("КоличествоЭкземпляров",КоличествоЭкземпляров);
	КонецЦикла;	
	КонецЦикла;
	СтруктураВызоваПечати = Новый Структура;
	СтруктураВызоваПечати.Вставить("МассивДокументов", МассивДокументовКонтрагента);
	СтруктураВызоваПечати.Вставить("ПараметрКоманды", ПараметрКоманды);
	МассивВызововПечати.Добавить(СтруктураВызоваПечати);

КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	ВыделенныеСтроки = ПолучитьМассивДокументовИзДереваСервер();	
	НетПовторов = э_ОбщиеСервер.ГрупповаяПечать(ВыделенныеСтроки);
	Если ТипЗнч(НетПовторов) = Тип("Структура") Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",НетПовторов, ЭтотОбъект);
	Иначе
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДокументовИзДереваСервер()
	
	СписокДокументов = Новый СписокЗначений;
	
	ДанныеДЗ = РеквизитФормыВЗначение("ДеревоДокументов");
	Если ДанныеДЗ = Неопределено Тогда
		ДанныеДЗ = Новый ДеревоЗначений;	
	КонецЕсли;
	
	Для каждого СтрокаДокумента Из ДанныеДЗ.Строки Цикл
		СписокДокументов.Добавить(СтрокаДокумента.Документ);	
	КонецЦикла;
	
	Возврат СписокДокументов.ВыгрузитьЗначения();

КонецФункции // ()

&НаСервереБезКонтекста
Функция СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов)
	 
	МассивДокументов = ПечатьКомплектаДокументов.СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов,Истина,Истина);
	Возврат МассивДокументов;
	 
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовКоличествоЭкземпляровПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
	ТД = Элементы.ДеревоДокументов.ТекущиеДанные;
	ТД.КоличествоЛистов = ТД.КоличествоЭкземпляров;
	СтрокаТЧ = Объект.ПечатныеФормы.НайтиПоИдентификатору(ТД.НомерСтроки-1);
	СтрокаТЧ.КоличествоЭкземпляров = ТД.КоличествоЭкземпляров;	
	СтрокаТЧ.КоличествоЛистов = ТД.КоличествоЭкземпляров;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	МассивВызововПечати = Новый Массив;
	ГрупповаяПечатьНаСервере(МассивВызововПечати, ВыбранноеЗначение);
	Для каждого СтруктураВызоваПечати Из МассивВызововПечати Цикл
		ПечатьКомплектаДокументов.НапечататьКомплект(СтруктураВызоваПечати.МассивДокументов,СтруктураВызоваПечати.ПараметрКоманды);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Поле.Имя="ДеревоДокументовДокумент" Тогда
	ПоказатьЗначение(,Элементы.ДеревоДокументов.ТекущиеДанные.Документ);
	ИначеЕсли Поле.Имя="ДеревоДокументовПримечание_ДокументПФ" Тогда	
	ПоказатьЗначение(,Элементы.ДеревоДокументов.ТекущиеДанные.Примечание_ДокументПФ);
	КонецЕсли;
КонецПроцедуры
