
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ВсеОшибкиИсправлены Тогда
		РасчитатьВсеОшибкиИсправлены();
	КонецЕсли;
КонецПроцедуры

Процедура РасчитатьВсеОшибкиИсправлены()
	НайденноеЗначение = ОшибкиПриЗагрузке.НайтиСтроки(Новый Структура("Исправлено,ИсправляемаяОшибка",Ложь,Истина));
	ВсеОшибкиИсправлены = НайденноеЗначение.Количество() = 0;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьИсправленныеЗначенияОшибок();
КонецПроцедуры

Процедура ЗаписатьИсправленныеЗначенияОшибок()
	ИсправленныеСтроки = ОшибкиПриЗагрузке.Выгрузить(Новый Структура("Исправлено,ИсправляемаяОшибка",Истина,Истина));
	Если Не ИсправленныеСтроки.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеРС = ПолучитьСтрокуРегистра(Ссылка);
	Если ДанныеРС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаписьРегистра = РегистрыСведений.РучнаяЗагрузкаСтоков.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра,ДанныеРС);
	
	Для Каждого СтрокаИсправленнойОшибки Из ИсправленныеСтроки Цикл
		Если Не ЗначениеЗаполнено(СтрокаИсправленнойОшибки.ИсправленноеЗначение) Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьРегистра[СтрокаИсправленнойОшибки.ИмяКолонкиЗначения] = СтрокаИсправленнойОшибки.ИсправленноеЗначение;
	КонецЦикла;
	ЗаписьРегистра.Записать();
КонецПроцедуры

Функция ПолучитьСтрокуРегистра(СсылкаСправочника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РучнаяЗагрузкаСтоков.Период,
		|	РучнаяЗагрузкаСтоков.КТК КАК КТК,
		|	РучнаяЗагрузкаСтоков.Терминал КАК Терминал,
		|	РучнаяЗагрузкаСтоков.ДатаОперации КАК ДатаОперации,
		|	РучнаяЗагрузкаСтоков.Контрагент КАК Контрагент,
		|	РучнаяЗагрузкаСтоков.ФедеральныйОкруг КАК ФедеральныйОкруг,
		|	РучнаяЗагрузкаСтоков.Город КАК Город,
		|	РучнаяЗагрузкаСтоков.Станция КАК Станция,
		|	РучнаяЗагрузкаСтоков.Состояние КАК Состояние,
		|	РучнаяЗагрузкаСтоков.АдресМестаОперацииСКТК КАК АдресМестаОперацииСКТК,
		|	РучнаяЗагрузкаСтоков.ВидТранспорта КАК ВидТранспорта,
		|	РучнаяЗагрузкаСтоков.НомерТранспорта КАК НомерТранспорта,
		|	РучнаяЗагрузкаСтоков.ФИОВодителя КАК ФИОВодителя,
		|	РучнаяЗагрузкаСтоков.ВидТранспортаУбытия КАК ВидТранспортаУбытия,
		|	РучнаяЗагрузкаСтоков.ТипОперации КАК ТипОперации,
		|	РучнаяЗагрузкаСтоков.ДатаОбновленияИнформации КАК ДатаОбновленияИнформации,
		|	РучнаяЗагрузкаСтоков.ТерминальнаяУслуга КАК ТерминальнаяУслуга,
		|	РучнаяЗагрузкаСтоков.ЛинияПодсток КАК ЛинияПодсток,
		|	РучнаяЗагрузкаСтоков.НаличиеПодвреждения КАК НаличиеПодвреждения,
		|	РучнаяЗагрузкаСтоков.ЗаявкаНаВыдачу КАК ЗаявкаНаВыдачу,
		|	РучнаяЗагрузкаСтоков.ЗаявкаНаСдачу КАК ЗаявкаНаСдачу,
		|	РучнаяЗагрузкаСтоков.КомментарийТерминала КАК КомментарийТерминала,
		|	РучнаяЗагрузкаСтоков.КомментарийСотрудника КАК КомментарийСотрудника,
		|	РучнаяЗагрузкаСтоков.ИсточникДобавленияДанных КАК ИсточникДобавленияДанных,
		|	РучнаяЗагрузкаСтоков.ТипПодрядчика КАК ТипПодрядчика,
		|	РучнаяЗагрузкаСтоков.ОшибкиПриЗагрузкеИнформацииОтТерминалов КАК ОшибкиПриЗагрузкеИнформацииОтТерминалов,
		|	РучнаяЗагрузкаСтоков.ПеренесеноВЧистыйСток КАК ПеренесеноВЧистыйСток,
		|	РучнаяЗагрузкаСтоков.ДатаВыходаПредыдущегоТерминала КАК ДатаВыходаПредыдущегоТерминала,
		|	РучнаяЗагрузкаСтоков.СправочникОшибок КАК СправочникОшибок
		|ИЗ
		|	РегистрСведений.РучнаяЗагрузкаСтоков КАК РучнаяЗагрузкаСтоков
		|ГДЕ
		|	РучнаяЗагрузкаСтоков.СправочникОшибок = &СправочникОшибок";
	
	Запрос.УстановитьПараметр("СправочникОшибок", СсылкаСправочника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


