
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПроверкаУжеБыла") Тогда
		НайденныйПараметр = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(РазмерКТК, ПринадлежностьТЕ, Валюта, ВидТранспортногоСообщения);
		Если ЗначениеЗаполнено(НайденныйПараметр) Тогда
			ТекстОшибки = НСтр("ru = 'Данные параметр уже существует'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//НазваниеТипаСтавки = "";
	//Если ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
	//	НазваниеТипаСтавки = "Ставка";
	//ИначеЕсли ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
	//	НазваниеТипаСтавки = "Надбавка";
	//Иначе 
	//	НазваниеТипаСтавки = "Скидка";
	//КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Наименование = РазмерКТК.Наименование 
					+ "_" + Валюта.Наименование
					+ "_" + ?(ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC")
					+ "_" + ?(ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД, "ЖД", "Фрахт");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти