Функция ПолучитьКонтакты(Ссылка) экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапросЪ.КонтактноеЛицо КАК ПользовательЗаявитель,
	               |	ЗапросЪ.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
	               |	ЗапросЪ.Контрагент КАК КонтрагентЗаявитель
	               |ИЗ
	               |	Документ.Запрос КАК ЗапросЪ
	               |ГДЕ
	               |	ЗапросЪ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.Добавить(Ответ.ПользовательЗаявитель);
		Результат.Добавить(Ответ.ОтветственныйМенеджер);
		Результат.Добавить(Ответ.КонтрагентЗаявитель);
	КонецЕсли;

	Возврат результат;
	
КонецФункции

Функция ЗагрузитьEXCELЗапрос(ЭлементСправочникаФайлы) Экспорт
	
	Результат = Новый Структура("Успешно, ДокументСсылка", Истина, Новый Массив);
	
	ОписаниеФайла = РаботаСФайлами.ДанныеФайла(ЭлементСправочникаФайлы);
	ДДФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ЭлементСправочникаФайлы);
	
	ИВФ = ПолучитьИмяВременногоФайла(ОписаниеФайла.Расширение);
	ДДФайла.Записать(ИВФ);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИВФ, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	ИменаЛистов = Новый Массив;	
	Для каждого Стр из ТабДок.Области Цикл
		
		ИменаЛистов.Добавить(Стр.Имя);
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Для каждого ЛистИмя из ИменаЛистов Цикл
		
		Лист = ТабДок.ПолучитьОбласть(ЛистИмя);
		
		КодФормы = Лист.Область("R2C2").Текст;
		
		Если КодФормы <> "FDC-001" Тогда Продолжить; КонецЕсли;
		
		Попытка
			
			ШапкаКонтрагент = Лист.Область("R5C3").Текст;
			ШапкаКонтрагентИНН = Лист.Область("R6C2").Текст;
			ШапкаКонтрагентКПП = Лист.Область("R6C4").Текст;
			ШапкаКонтрагентОГРН = Лист.Область("R6C6").Текст;
			ШапкаДоговорНомер = Лист.Область("R7C3").Текст;
			ШапкаДоговорДата = Лист.Область("R7C6").Текст;
			ШапкаРезидент = Лист.Область("R8C2").Текст;
			ШапкаТекстЗапроса = Лист.Область("R10C3").Текст;
			
			ШапкаФИОМенеджера = Лист.Область("R5C10").Текст;
			ШапкаТелефон = Лист.Область("R6C10").Текст;
			ШапкаРезТелефон = Лист.Область("R7C10").Текст;
			ШапкаПочта = Лист.Область("R8C10").Текст;
			
			ШапкаВладелецКонтейнера = Лист.Область("R5C16").Текст;
			ШапкаОтправлениеС = Лист.Область("R7C16").Текст;
			ШапкаОтправлениеПО = Лист.Область("R7C18").Текст;
			ШапкаПрибытиеС = Лист.Область("R10C16").Текст;
			ШапкаПрибытиеПО = Лист.Область("R10C18").Текст;
			
			ШапкаПунктОтправленияНазвание = Лист.Область("R8C16").Текст;
			ШапкаПунктОтправленияКод = Лист.Область("R9C16").Текст;
			ШапкаПунктНазначениеНазвание = Лист.Область("R11C16").Текст;
			ШапкаПунктНазначениеКод = Лист.Область("R12C16").Текст;
			
			ШапкаВнешнийНомер = Лист.Область("R8C4").Текст;;
			ШапкаВнешняяДата = Лист.Область("R8C6").Текст;;
			
			ШапкаГруз = Лист.Область("R13C16").Текст;
			ШапкаГрузоотправитель = Лист.Область("R16C16").Текст;
			ШапкаГрузополучатель = Лист.Область("R19C16").Текст;
			
			ШапкаКомментарий = Лист.Область("R33C3").Текст;
			
			СоставУслуг = Новый Массив;
			Для Сч = 15 По 31 Цикл
				НаименованиеУс = Лист.Область("R"+Сч+"C3").Текст;
				НаименованиеТипВагона = Лист.Область("R"+Сч+"C10").Текст;
				НаименованиеТипоразмерКТК = Лист.Область("R"+Сч+"C11").Текст;
				НаименованиеКоличество = Лист.Область("R"+Сч+"C12").Текст;
				
				Если ЗначениеЗаполнено(НаименованиеУс) Тогда
					СоставУслуг.Добавить(Новый Структура("Услуга, Вагон, КТК, Количество", НаименованиеУс, НаименованиеТипВагона, НаименованиеТипоразмерКТК, НаименованиеКоличество));
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			Результат.Успешно = Ложь;
			Прервать;
		КонецПопытки;
		
		////////////////////////////
		
		Контрагент = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьКонтрагента(ШапкаКонтрагентИНН, ШапкаКонтрагентКПП, ШапкаКонтрагентОГРН, ШапкаКонтрагент);
		Договор = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьДоговор(ШапкаДоговорНомер, ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаДоговорДата));
		КонтакноеЛицо = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьКонтакноеЛицо(ШапкаФИОМенеджера);
		КонтактныйТелефон = ШапкаТелефон + ?(ШапкаРезТелефон = "", "", "; " + ШапкаРезТелефон);
		ЭлектроннаяПочта = ШапкаПочта;
		ПериодОтправкиНачало = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаОтправлениеС);
		ПериодОтправкиОкончание = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаОтправлениеПО);
		ПериодПрибытияНачало = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаПрибытиеС);
		ПериодПрибытияОкончание = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаПрибытиеПО);
		Резидент = (ШапкаРезидент = "1");
		ПунктОтправления = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию(ШапкаПунктОтправленияКод, ШапкаПунктОтправленияНазвание);
		ПунктНазначения = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию(ШапкаПунктНазначениеКод, ШапкаПунктНазначениеНазвание);
		КонтейнерКлиента = (ШапкаВладелецКонтейнера = "1");
		Грузоотправитель = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиГрузоотправителяПолучателя(ШапкаГрузоотправитель);
		Грузополучатель = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиГрузоотправителяПолучателя(ШапкаГрузополучатель);
		Груз = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиГруз(ШапкаГруз);
		Комментарий = ШапкаКомментарий;
		ВнешняяДата = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаВнешняяДата);
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			НДок = Документы.Запрос.СоздатьДокумент();
			Ндок.Заполнить(неопределено);
			НДок.Дата = ТекущаяДата();
			НДок.Примечание = Комментарий;
			Ндок.Контрагент = Контрагент;
			Ндок.Договор = Договор;
			Ндок.КонтактноеЛицо = КонтакноеЛицо;
			Ндок.КонтактныйТелефон = КонтактныйТелефон;
			Ндок.ЭлектроннаяПочта = ЭлектроннаяПочта;
			Ндок.ПериодОтправкиНачало = ПериодОтправкиНачало;
			Ндок.ПериодОтправкиОкончание = ПериодОтправкиОкончание;
			НДок.ПериодПрибытияНачало = ПериодПрибытияНачало;
			Ндок.ПериодПрибытияОкончание = ПериодПрибытияОкончание;
			НДок.Резидент = Резидент;
			Ндок.ПунктОтправления = ПунктОтправления;
			Ндок.ПунктНазначения = ПунктНазначения;
			Ндок.КонтейнерКлиента = КонтейнерКлиента;
			Ндок.ТекстЗапроса = ШапкаТекстЗапроса;
			Ндок.Грузоотправитель = Грузоотправитель;
			Ндок.Грузополучатель = Грузополучатель;
			НДок.Груз = Груз;
			НДок.ИсточникЗапроса = ?(ЗначениеЗаполнено(Ндок.Договор), Перечисления.ИсточникиЗапросов.ЗапросДействующегоКлиента, Перечисления.ИсточникиЗапросов.ЗапросНовогоКлиента);
			Ндок.ВнешнийНомер = ШапкаВнешнийНомер;
			Ндок.ВнешняяДата = ВнешняяДата;
			
			Для каждого Стр из СоставУслуг Цикл
				НСтр = НДок.СоставУслуги.Добавить();
				НСтр.Услуга = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиУслугу(Стр.Услуга);
				НСтр.ТипТС = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ТипТС(Стр.Вагон);
				НСтр.ТипТЕ = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ТипТЕ(Стр.КТК);
				Попытка
					НСтр.Количество = Число(Стр.Количество);
				Исключение
				КонецПопытки;
			КонецЦикла;
			
			Попытка
				Ндок.Записать(РежимЗаписиДокумента.Запись);
				Ндок.Записать(РежимЗаписиДокумента.Проведение);
				Результат.ДокументСсылка.Добавить(НДок.Ссылка);
			Исключение
				Результат.Успешно = Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Успешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УдалитьФайлы(ИВФ);
	
	Возврат Результат;
	
КонецФункции

