//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
////Субботин 75158 16.10.2023 начало
//Функция НайтиСоздатьГрузПоТНВЭД(СтороннийИдентификатор) экспорт
//	
//	Результат = Неопределено;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ГрузыПоТНВЭД.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Справочник.ГрузыПоТНВЭД КАК ГрузыПоТНВЭД
//	               |ГДЕ
//	               |	НЕ ГрузыПоТНВЭД.ПометкаУдаления
//	               |	И ГрузыПоТНВЭД.СтороннийИдентификатор = &СтороннийИдентификатор";
//	Запрос.УстановитьПараметр("СтороннийИдентификатор", СтороннийИдентификатор);
//	Ответ = Запрос.Выполнить().Выбрать();
//	Если Ответ.Следующий() Тогда		
//		Результат = Ответ.Ссылка;		
//	КонецЕсли;
//	
//    //Субботин 80722 07.02.2024 Начало убрал создание в рамках задачи, т.к кода будут грузится отдельно
//	//Если НЕ ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(ТНВЭД) И ЗначениеЗаполнено(Наименование) Тогда	
//	//	НовГруз = Справочники.ГрузыПоТНВЭД.СоздатьЭлемент();
//	//	НовГруз.Наименование = СокрЛП(СТРЗаменить(Наименование,Символы.ПС," "));
//	//	НовГруз.ТНВЭД = ТНВЭД;
//	//	НовГруз.Записать();
//	//	Результат = НовГруз.Ссылка;		
//	//КонецЕсли;
//	//Субботин 80722 07.02.2024 Конец
//	
//	Возврат Результат;
//	
//КонецФункции
////Субботин 75158 16.10.2023 Конец
//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025

Функция ПолучитьСсылкуПоКодуИУровню(Код,Уровень) Экспорт //Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	
	ПустойОтвет = Справочники.ГрузыПоТНВЭД.ПустаяСсылка();
	
	Попытка
		Уровень = Число(Уровень);
	Исключение
		Уровень = 0;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрузыПоТНВЭД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГрузыПоТНВЭД КАК ГрузыПоТНВЭД
		|ГДЕ
		|	ГрузыПоТНВЭД.ТНВЭД = &Код
		|	И ГрузыПоТНВЭД.УровеньВГруппе = &Уровень
		|	И НЕ ГрузыПоТНВЭД.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Уровень", Уровень);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ПустойОтвет;
	
КонецФункции	


//Субботин 80932 21.02.2024 начало
Функция СоздатьАктуализироватьКарточкуТНВЭД(СтрокаЭлемента) Экспорт
	
	parentid 	= СтрокаЭлемента.parentid;
	id 			= СтрокаЭлемента.id;
	level 		= СтрокаЭлемента.level;
	code 		= СтрокаЭлемента.code;
	version 	= СтрокаЭлемента.version;
	value 		= СтрокаЭлемента.value;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	//Объект  = ПолучитьЭлементПоСтороннемуИдентификатору(id, Истина);
	ОбъектСсылка = СтрокаЭлемента.ОбъектСсылка;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	Если ОбъектСсылка = Неопределено Тогда
        Объект = Справочники.ГрузыПоТНВЭД.СоздатьЭлемент();
	Иначе
		Объект = ОбъектСсылка.ПолучитьОбъект();
	КонецЕсли;	
	Объект.Наименование = СокрЛП(СТРЗаменить(value,Символы.ПС," "));
	Объект.ТНВЭД = code;
	//Объект.СтороннийИдентификатор = СтрЗаменить(Строка(id),Символы.НПП,"");
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	Если ЗначениеЗаполнено(level) Тогда
		Объект.УровеньВГруппе = level;
	Иначе
		Объект.УровеньВГруппе = 0;
	КонецЕсли;	
	//Если ЗначениеЗаполнено(parentid) Тогда
	//	Объект.Родитель = ПолучитьЭлементПоСтороннемуИдентификатору(СтрЗаменить(Строка(parentid),Символы.НПП,""));
	//КонецЕсли;
	Если ЗначениеЗаполнено(parentid) Тогда
		Объект.Родитель = СтрокаЭлемента.Родитель;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции 

//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
//Функция ПолучитьЭлементПоСтороннемуИдентификатору(Идентификатор, ВернутьОбъект = Неопределено) экспорт
//	
//	Результат = Неопределено;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ГрузыПоТНВЭД.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Справочник.ГрузыПоТНВЭД КАК ГрузыПоТНВЭД
//	               |ГДЕ
//	               |	НЕ ГрузыПоТНВЭД.ПометкаУдаления
//	               |	И ГрузыПоТНВЭД.СтороннийИдентификатор = &СтороннийИдентификатор";
//	Запрос.УстановитьПараметр("СтороннийИдентификатор", Строка(Идентификатор));
//	Ответ = Запрос.Выполнить().Выбрать();
//	Если Ответ.Следующий() Тогда
//		Если НЕ ВернутьОбъект = Неопределено Тогда 
//			Результат = Ответ.Ссылка.ПолучитьОбъект();	
//		Иначе	
//			Результат = Ответ.Ссылка;
//		КонецЕсли;
//	КонецЕсли;	
//	Возврат Результат;
//	
//КонецФункции
//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025

Функция НайтиКорень(Элем)
    Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда
        Возврат Элем.Наименование;
    Иначе
        Возврат НайтиКорень(Элем.Родитель);
	КонецЕсли;
	
КонецФункции 


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Представление = СокрЛП(СтрШаблон("%1 %2", ?(СокрЛП(НайтиКорень(Данные.ссылка)) = СокрЛП(Данные.Наименование),
							"", НайтиКорень(Данные.ссылка)+" /"), СокрЛП(Данные.Наименование)));
КонецПроцедуры
//Субботин 80932 21.02.2024 Конец
