
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
КонецПроцедуры
