
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Актуальные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Актуальные", Неопределено);	
	Если Актуальные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
			|	СтавкиНДС.СтавкаНДС.Порядок КАК СтавкаНДСПорядок
			|ИЗ
			|	Справочник.СтавкиНДС КАК СтавкиНДС
			|ГДЕ
			|	СтавкиНДС.Актуальная = &Актуальная
			|
			|УПОРЯДОЧИТЬ ПО
			|	СтавкаНДСПорядок";
		
		Запрос.УстановитьПараметр("Актуальная", Актуальные);
		
		ВыборкаСтавок = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаСтавок.Следующий() Цикл
			СтрокаВыбора = ДанныеВыбора.Добавить();
			СтрокаВыбора.Значение = ВыборкаСтавок.СтавкаНДС;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
