
&НаКлиенте
Процедура ОК(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = СписокРеквизитов.НайтиСтроки(ПараметрыОтбора);
	Закрыть(НайденныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквВХранилище = Параметры.РеквВХранилище;
	ДанныеРекв = ПолучитьИзВременногоХранилища(РеквВХранилище);
	
	Если Параметры.Свойство("Источник") Тогда
		ДокОснование = Параметры.Источник;
	
		СписокРеквизитов.Очистить();
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			Если ТипЗнч(ДокОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				ОбъектМД = Метаданные.Справочники.ДоговорыКонтрагентов;
			ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Заявка") Тогда
				ОбъектМД = Метаданные.Документы.Заявка;
			ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПСЦ") Тогда
				ОбъектМД = Метаданные.Документы.ПСЦ;
			ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Калькуляция") Тогда
				ОбъектМД = Метаданные.Документы.Калькуляция;
			КонецЕсли;
			
			// заполнить таблицу реквизитов
			Для Каждого Рекв Из ОбъектМД.Реквизиты Цикл
				 НовСтр = СписокРеквизитов.Добавить();
				 НовСтр.РеквизитВСистеме = Рекв.Имя;
				 НовСтр.РеквизитПредставление = Рекв.Синоним;
				 ПараметрыОтбора = Новый Структура;
				 ПараметрыОтбора.Вставить("РеквизитВСистеме",Рекв.Имя);
				 Если ДанныеРекв.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
					 НовСтр.Отметка = Истина;
				 КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )


