
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("КонтрагентПодрядчик", Параметры.Свойство("КонтрагентПодрядчик"));
	Список.Параметры.УстановитьЗначениеПараметра("Услуга", ?(Параметры.Свойство("Услуга"), параметры.Услуга, неопределено));
	Список.Параметры.УстановитьЗначениеПараметра("УслугаНеЗадана", Параметры.Свойство("Услуга") = ЛОЖЬ);
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
 	//Евросиб - АСуслов 04.07.2023 17:55:01 #67501 локации
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

