
&НаСервереБезКонтекста
Процедура СформироватьСобытияДокументовНаСервере()
	
    СпискиДокументовИСобытий = РассылкаУведомленийПользователям.ПолучитьСписокДокументов(); 
	
	РассылкаУведомленийПользователям.СоздатьКлючевыеПоляСобытийОтправкиДокументов(СпискиДокументовИСобытий, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСобытияДокументов(Команда)
	СформироватьСобытияДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не РольДоступна("ПолныеПрава") Тогда
		Элементы.СформироватьСобытияДокументов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
