//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
Функция УжеЕстьЗаписиПоДокументу(Ссылка) Экспорт
	Результат = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправленныеПоПочтеДокументыСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОтправленныеПоПочтеДокументы.СрезПоследних(, ОтправленныйДокумент = &ОтправленныйДокумент) КАК ОтправленныеПоПочтеДокументыСрезПоследних";
	
	Запрос.УстановитьПараметр("ОтправленныйДокумент", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = Истина;
	КонецЦикла;
	Возврат Результат;
КонецФункции   
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец      

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
Процедура ВыполнитьЗаписьПоДокументу_ЭлектронноеПисьмоИсходящее(ОбъектПисьмоИсходящее) Экспорт 
	//ДЛЯ РЕГИСТРАЦИИ ДОЛЖНЫ БЫТЬ ВЫПОЛНЕНЫ УСЛОВИЯ:
	//1) изменился статус письма на <Отправлено>
	//2) <Предмет> это ссылка на документ
	СсылкаПисьмоИсходящее = ОбъектПисьмоИсходящее.Ссылка;
	ТекущийСтатусПисьма = ОбъектПисьмоИсходящее.СтатусПисьма;
	ПредыдущийСтатусПисьма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаПисьмоИсходящее, "СтатусПисьма");
	Если ТекущийСтатусПисьма <> Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущийСтатусПисьма = ПредыдущийСтатусПисьма Тогда
		Возврат;
	КонецЕсли;

	ПредметОтправки = Взаимодействия.СтруктураРеквизитовВзаимодействия(СсылкаПисьмоИсходящее).Предмет;
	Если ПредметОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПредметОтправки)) Тогда
		Возврат;
	КонецЕсли;   
	Если ТипЗнч(ПредметОтправки) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьВРегистрОтправленныеПоПочтеДокументы = РегистрыСведений.ОтправленныеПоПочтеДокументы.СоздатьМенеджерЗаписи();
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.Период = ОбъектПисьмоИсходящее.Дата;
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.ОтправленныйДокумент = ПредметОтправки;
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.ДатаОтправки = ТекущаяДата();
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.Отправитель = ОбъектПисьмоИсходящее.Автор;
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.АдресаОтправки = ОбъектПисьмоИсходящее.СписокПолучателейПисьма;  
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.ИсходящееПисьмо = СсылкаПисьмоИсходящее;
	ЗаписьВРегистрОтправленныеПоПочтеДокументы.Записать(); 
	
	//ДИТ Шевченко А.В. 51340 17.10.2022 -начало
	Если ТипЗнч(ПредметОтправки) = Тип("ДокументСсылка.РелизКлиента") Тогда
		Документы.РелизКлиента.ОпределитьИзменитьСтатус(ПредметОтправки,ОбъектПисьмоИсходящее.Ссылка);
	КонецЕсли;	
	//ДИТ Шевченко А.В. 51340 17.10.2022 -конец
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец
