
&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
		или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка() Тогда
			Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
		КонецЕсли;
		
		Элементы.ВидАванса.Видимость = Ложь;
		
		Элементы.ВидЗадолженностиДляПереноса.Заголовок = ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, "Перенести", "Списать");
		
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Истина;
		
		СписокВыбораПереключателя = Элементы.ВидЗадолженностиДляПереноса.СписокВыбора;
		
		Если СписокВыбораПереключателя.Количество() < 4 Тогда
			
			СписокВыбораПереключателя.Очистить();
			
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя, "Задолженность покупателя");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя,        "Авансы покупателя");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику,        "Авансы поставщику");
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка() Тогда
				Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ГруппаДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
		
		Элементы.ДебиторВспомогательный.Видимость = Ложь;
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Поставщик (дебитор)", "Покупатель (дебитор)");
			Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Новый поставщик",     "Новый покупатель");
			
			Элементы.ГруппаДебиторскаяЗадолженность.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Авансы поставщику (дебиторская задолженность)", "Задолженность покупателя (дебиторская задолженность)");
			
			Элементы.ГруппаДебиторскаяЗадолженность.Видимость  = Истина;
			Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Ложь;
			
			Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
				
				Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
				Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
			Иначе
				
				Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Истина;
				Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли; 
			
			//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
			Если Объект.ДебиторскаяЗадолженность.Количество() > 0 Тогда   
				СтрокаДЗ = Объект.ДебиторскаяЗадолженность.Получить(0);
				Элементы.ДебиторскаяЗадолженностьСумма.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДЗ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
				Элементы.ДебиторскаяЗадолженностьСуммаВзаиморасчетов.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДЗ.КорДоговорКонтрагента, "ВалютаВзаиморасчетов"); 
			КонецЕсли;
			Если Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда   
				СтрокаКЗ = Объект.КредиторскаяЗадолженность.Получить(0);
				Элементы.КредиторскаяЗадолженностьСумма.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКЗ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
				Элементы.КредиторскаяЗадолженностьСуммаВзаиморасчетов.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКЗ.КорДоговорКонтрагента, "ВалютаВзаиморасчетов"); 
			КонецЕсли;
			//Евросиб Дубская 06.06.2023 )       
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Поставщик (кредитор)", "Покупатель (кредитор)");
			Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Новый поставщик",     "Новый покупатель");
			
			Элементы.ГруппаКредиторскаяЗадолженность.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику (кредиторская задолженность)", "Авансы покупателя (кредиторская задолженность)");
			
			Элементы.ГруппаДебиторскаяЗадолженность.Видимость  = Ложь;
			Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Истина;
			
			Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
				
			
				Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
				
				Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
			Иначе
//КредиторскаяЗадолженностьКорДоговорКонтрагента //Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.Доступность
				Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Истина;
				Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли; 
			
			//Евросиб Фокеева 28.11.2023 ( Ticket#0332572   
			Если Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда   
				СтрокаКЗ = Объект.КредиторскаяЗадолженность.Получить(0);
				Элементы.КредиторскаяЗадолженностьСумма.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКЗ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
				Элементы.КредиторскаяЗадолженностьСуммаВзаиморасчетов.Заголовок = "Сумма, " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКЗ.КорДоговорКонтрагента, "ВалютаВзаиморасчетов"); 
			КонецЕсли;
			//Евросиб Фокеева 28.11.2023 ) 
			
		КонецЕсли;
		
		Элементы.Дебитор.Видимость                = Истина;
		Элементы.Кредитор.Видимость               = ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, Истина, Ложь);
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности Тогда
		
		СписокВыбораПереключателя = Элементы.ВидЗадолженностиДляПереноса.СписокВыбора;
		СписокВыбораПереключателя.Очистить();
		
		СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя, "Задолженность покупателя");
		СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя,        "Авансы покупателя");
		СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику");
		СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику,        "Авансы поставщику");
		
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость               = Ложь;
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость                = Ложь;
		Элементы.ДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного               = Ложь;
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного                = Ложь;
		Элементы.ДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ВидАванса.Видимость = Ложь;
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Истина;
		//Элементы.ВидЗадолженностиДляПереноса.Видимость = Ложь;
		
		Элементы.ВидЗадолженностиДляПереноса.Заголовок = "Формирование";
		Элементы.Дебитор.Заголовок  = "Дебитор";
		Элементы.Кредитор.Заголовок = "Кредитор";
		
		Элементы.Дебитор.Видимость                = Истина;
		Элементы.Кредитор.Видимость               = Истина;
		Элементы.ДебиторВспомогательный.Видимость = Ложь;
		
		Элементы.ДебиторскаяЗадолженность.Заголовок  = "Дебиторская задолженность";
		Элементы.КредиторскаяЗадолженность.Заголовок = "Кредиторская задолженность";
		
		Если ЗначениеЗаполнено(Объект.ВидАвансаЗадолженности) Тогда
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя 
				ИЛИ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
				
				Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Поставщик (дебитор)", "Покупатель (дебитор)");
				Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Новый поставщик",     "Новый покупатель");
				
				Элементы.ГруппаДебиторскаяЗадолженность.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Авансы поставщику (дебиторская задолженность)", "Задолженность покупателя (дебиторская задолженность)");
				
				Элементы.ГруппаДебиторскаяЗадолженность.Видимость = Истина;
				Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Ложь;
			
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя 
				ИЛИ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
				
				Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Поставщик (кредитор)", "Покупатель (кредитор)");
				Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Новый поставщик",     "Новый покупатель");
				
				Элементы.ГруппаКредиторскаяЗадолженность.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику (кредиторская задолженность)", "Авансы покупателя (кредиторская задолженность)");
				
				Элементы.ГруппаДебиторскаяЗадолженность.Видимость = Ложь;
				Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Истина;
			
			КонецЕсли; 
			
		Иначе
			
			Элементы.ГруппаДебиторскаяЗадолженность.Видимость  = Ложь;
			Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Ложь;
			
		КонецЕсли; 
		//Элементы.ГруппаДебиторскаяЗадолженность.Видимость  = Истина;
		//Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Истина;
		Элементы.ГруппаДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее или НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость               = Ложь;
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость                = Ложь;
		Элементы.ДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного               = Ложь;
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного                = Ложь;
		Элементы.ДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ВидАванса.Видимость = Ложь;
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Ложь;
		
		Элементы.ВидЗадолженностиДляПереноса.Заголовок = "Формирование";
		Элементы.Дебитор.Заголовок  = "Дебитор";
		Элементы.Кредитор.Заголовок = "Кредитор";
		
		Элементы.Дебитор.Видимость                = Истина;
		Элементы.Кредитор.Видимость               = Истина;
		Элементы.ДебиторВспомогательный.Видимость = Ложь;
		
		Элементы.ДебиторскаяЗадолженность.Заголовок  = "Дебиторская задолженность";
		Элементы.КредиторскаяЗадолженность.Заголовок = "Кредиторская задолженность";
		
		Элементы.ГруппаДебиторскаяЗадолженность.Видимость  = Истина;
		Элементы.ГруппаКредиторскаяЗадолженность.Видимость = Истина;
		Элементы.ГруппаДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
		
	КонецЕсли;
					
	УстановитьПараметрыВыбора();
	УстановитьДоступностьДоговоров(ЭтотОбъект); 
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
	МассивПараметровДебиторскойЗадолженности  = Новый Массив;
	МассивПараметровКредиторскойЗадолженности = Новый Массив;
	
	Если Объект.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВалютаВзаиморасчетов", Объект.ВалютаДокумента));
		МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВалютаВзаиморасчетов", Объект.ВалютаДокумента));
	Иначе
		МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ОплатаВВалюте", Ложь));
		МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ОплатаВВалюте", Ложь));
	КонецЕсли;
	
	Если НЕ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		МассивВидовДоговоровДебиторскойЗадолженности  = Новый Массив;
		МассивВидовДоговоровКредиторскойЗадолженности = Новый Массив;
		
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	НовыеПараметрыВыбораДебиторскойЗадолженности  = Новый ФиксированныйМассив(МассивПараметровДебиторскойЗадолженности);
	НовыеПараметрыВыбораКредиторскойЗадолженности = Новый ФиксированныйМассив(МассивПараметровКредиторскойЗадолженности);
	
	Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.ПараметрыВыбора                = НовыеПараметрыВыбораДебиторскойЗадолженности;
	Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.ПараметрыВыбора               = НовыеПараметрыВыбораКредиторскойЗадолженности;
	Элементы.ДебиторскаяЗадолженностьВспомогательнаяДоговорКонтрагента.ПараметрыВыбора = НовыеПараметрыВыбораДебиторскойЗадолженности;
	
	Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.ПараметрыВыбора                = НовыеПараметрыВыбораДебиторскойЗадолженности;
	Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.ПараметрыВыбора               = НовыеПараметрыВыбораКредиторскойЗадолженности;
	Элементы.ДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.ПараметрыВыбора = НовыеПараметрыВыбораКредиторскойЗадолженности;
	
	СвязиДоговораКредиторки = Новый Массив;
	СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	СвязиДоговораДебиторки = Новый Массив;
	СвязиДоговораДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));

	СвязиДокументаКредиторки = Новый Массив;
	СвязиДокументаКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	СвязиДокументаДебиторки = Новый Массив;
	СвязиДокументаДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда

		СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентКредитор"));
		
		СвязиДоговораДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентДебитор"));
		СвязиДокументаДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентДебитор"));
		
		Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора    = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.КредиторскаяЗадолженностьСделка.СвязиПараметровВыбора                = Новый ФиксированныйМассив(СвязиДокументаДебиторки);
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		
		Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора    = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.ДебиторскаяЗадолженностьСделка.СвязиПараметровВыбора                = Новый ФиксированныйМассив(СвязиДокументаДебиторки);
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда

		СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентДебитор"));
		СвязиДокументаКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентДебитор"));
		
		Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		Элементы.КредиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		
		Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		Элементы.ДебиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДоговораКредиторки);

	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговоров(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	// Доступность по умолчанию
	Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.Доступность               = Истина;
	Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Доступность            = Истина;
	Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.Доступность                = Истина;
	Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Доступность             = Истина;
	Элементы.ДебиторскаяЗадолженностьВспомогательнаяДоговорКонтрагента.Доступность = Истина;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности") Тогда

		Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.Доступность    = ЗначениеЗаполнено(Объект.КонтрагентДебитор);
		Элементы.КредиторскаяЗадолженностьКорДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.КонтрагентКредитор);
		Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.Доступность     = ЗначениеЗаполнено(Объект.КонтрагентДебитор);
		Элементы.ДебиторскаяЗадолженностьКорДоговорКонтрагента.Доступность  = ЗначениеЗаполнено(Объект.КонтрагентКредитор);

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда

		Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.КонтрагентДебитор);
		Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.Доступность  = ЗначениеЗаполнено(Объект.КонтрагентДебитор);
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.Прочее") Тогда

		Элементы.ДебиторскаяЗадолженностьДоговорКонтрагента.Доступность  = ЗначениеЗаполнено(Объект.КонтрагентДебитор);
		Элементы.КредиторскаяЗадолженностьДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.КонтрагентКредитор);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	УстановитьКурсВалютыНаСервере();
	УсловноеОформлениеФормы();
КонецПроцедуры

&НаСервере
Процедура УстановитьКурсВалютыНаСервере()
	Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.Дата);
	Объект.КурсДокумента = Результат.Курс;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере()
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	Объект.КредиторскаяЗадолженность.Очистить();
	
	Запрос = Новый Запрос;
	Если Объект.ВидОперации<> Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
			|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
			|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
			|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
			|			&ДатаДокумента,
			|			Организация = &Организация
			|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПокупателямиОстатки
			|ГДЕ
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток > 0";
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
			|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
			|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
			|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
			|			&ДатаДокумента,
			|			Организация = &Организация
			|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПокупателямиОстатки
			|ГДЕ
			|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток < 0";
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
			|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
			|	ВзаиморасчетыСПоставщикамиОстатки.Договор КАК Договор,
			|	ВзаиморасчетыСПоставщикамиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.ДатаРасчетов КАК ДатаРасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
			|			&ДатаДокумента,
			|			Организация = &Организация
			|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПоставщикамиОстатки
			|ГДЕ
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток > 0";
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
			|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
			|	ВзаиморасчетыСПоставщикамиОстатки.Договор КАК Договор,
			|	ВзаиморасчетыСПоставщикамиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.ДатаРасчетов КАК ДатаРасчетов,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
			|			&ДатаДокумента,
			|			Организация = &Организация
			|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПоставщикамиОстатки
			|ГДЕ
			|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток < 0";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента ) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Организация = &Организация",
			"Организация = &Организация
			|				И ВалютаРасчетов = &ВалютаДокумента ");
			Запрос.УстановитьПараметр("ВалютаДокумента",Объект.ВалютаДокумента);

		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаДокумента",Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Контрагент", Объект.КонтрагентДебитор);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл    
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда 
				НовСтр = Объект.КредиторскаяЗадолженность.Добавить();
				НовСтр.ДоговорКонтрагента = Результат.Договор;
				НовСтр.Сделка = Результат.ДокументВзаиморасчетов;
				НовСТр.Сумма = Результат.СуммаСНДСОстаток;
				НовСТр.СуммаВзаиморасчетов = Результат.СуммаСНДСОстаток;
				Если  Результат.Договор.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
					СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Результат.Договор.ВалютаВзаиморасчетов,Объект.Дата);
					НовСтр.КурсВзаиморасчетов = СтруктураКурса.Курс;
					НовСтр.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				Иначе
					НовСтр.КурсВзаиморасчетов = 1;
					НовСтр.КратностьВзаиморасчетов = 1;
					
				КонецЕсли;
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
				НовСтр = Объект.ДебиторскаяЗадолженность.Добавить();
				НовСтр.ДоговорКонтрагента = Результат.Договор;
				НовСтр.Сделка = Результат.ДокументВзаиморасчетов;
				НовСТр.Сумма = -Результат.СуммаСНДСОстаток;
				НовСТр.СуммаВзаиморасчетов = -Результат.СуммаСНДСОстаток;
				
				Если  Результат.Договор.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
					СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Результат.Договор.ВалютаВзаиморасчетов,Объект.Дата);
					НовСтр.КурсВзаиморасчетов = СтруктураКурса.Курс;
					НовСтр.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				Иначе
					НовСтр.КурсВзаиморасчетов = 1;
					НовСтр.КратностьВзаиморасчетов = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.ВидОперации= Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
		|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПокупателямиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОстатки.Организация,
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент,
		|	ВзаиморасчетыСПоставщикамиОстатки.Договор,
		|	ВзаиморасчетыСПоставщикамиОстатки.ДокументВзаиморасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.ВалютаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.ДатаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаНДСОстаток,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПоставщикамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток > 0";
		
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента ) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Организация = &Организация",
			"Организация = &Организация
			|				И ВалютаРасчетов = &ВалютаДокумента ");
			Запрос.УстановитьПараметр("ВалютаДокумента",Объект.ВалютаДокумента);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Контрагент", Объект.КонтрагентДебитор);
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			НовСтр = Объект.ДебиторскаяЗадолженность.Добавить();
			НовСтр.ДоговорКонтрагента = Результат.Договор;
			НовСтр.Сделка = Результат.ДокументВзаиморасчетов;
			НовСТр.Сумма = -Результат.СуммаСНДСОстаток;
			НовСТр.СуммаВзаиморасчетов = -Результат.СуммаСНДСОстаток;
			
			Если Результат.Договор.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Результат.Договор.ВалютаВзаиморасчетов,Объект.Дата);
				НовСтр.КурсВзаиморасчетов = СтруктураКурса.Курс;
				НовСтр.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			Иначе
				НовСтр.КурсВзаиморасчетов = 1;
				НовСтр.КратностьВзаиморасчетов = 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
		|	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов КАК ДатаРасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПокупателямиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОстатки.Организация,
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент,
		|	ВзаиморасчетыСПоставщикамиОстатки.Договор,
		|	ВзаиморасчетыСПоставщикамиОстатки.ДокументВзаиморасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.ВалютаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.ДатаРасчетов,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаНДСОстаток,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаСНДСОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПоставщикамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаБезНДСОстаток < 0";
		
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента ) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Организация = &Организация",
			"Организация = &Организация
			|				И ВалютаРасчетов = &ВалютаДокумента ");
			Запрос.УстановитьПараметр("ВалютаДокумента",Объект.ВалютаДокумента);

		КонецЕсли;
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Контрагент", Объект.КонтрагентКредитор);
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			НовСтр = Объект.КредиторскаяЗадолженность.Добавить();
			НовСтр.ДоговорКонтрагента = Результат.Договор;
			НовСтр.Сделка = Результат.ДокументВзаиморасчетов;
			НовСТр.Сумма = Результат.СуммаСНДСОстаток;
			НовСТр.СуммаВзаиморасчетов = Результат.СуммаСНДСОстаток;
			Если Результат.Договор.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Результат.Договор.ВалютаВзаиморасчетов,Объект.Дата);
				НовСтр.КурсВзаиморасчетов = СтруктураКурса.Курс;
				НовСтр.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			Иначе
				НовСтр.КурсВзаиморасчетов = 1;
				НовСтр.КратностьВзаиморасчетов = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("Сумма");
	Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	ТекстВопроса = "";
	Если Объект.ДебиторскаяЗадолженность.Количество() > 0 или Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда
		ТекстВопроса = "Перед заполнением табличные части будут очищены. Заполнить?";
	КонецЕсли;
	Если ТекстВопроса <> "" Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение",ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да );

	Иначе
		ЗаполнитьДокументНаСервере();
	КонецЕсли;
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда

		ЗаполнитьДокументНаСервере();

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидАвансаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиДляПереносаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УсловноеОформлениеФормы();
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
	//ОбновитьИтогиПоТаблицам();
	
	//ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
	//Элементы.ОбновитьОткрытыйПериод.Доступность = НЕ ПроверкаДоступнотиПоПериоду();
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступнотиПоПериоду()
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО,Объект.Организация);
КонецФункции

&НаКлиенте
Процедура УсловноеОформлениеФормы()
	Элементы.КурсДокумента.Видимость = Объект.ВалютаДокумента <> ПолучитьВалютуРегУчета() и ЗначениеЗаполнено(Объект.ВалютаДокумента);
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
КонецПроцедуры

&НаСервере
Функция ПолучитьВалютуРегУчета()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Евросиб Каблов 07.07.2021 ( Ticket#0236692 Добавлен запрет редактирования поля документа Номер
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 07.07.2021 )
   
	УправлениеФормой();
	 
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	ТранзитДляКлиента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентапоДокументу(Объект.Ссылка);
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОбновитьОткрытыйПериод(Команда)
	
	Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиПоТаблицам()
	
	Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("Сумма");
	Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("Сумма");
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
		
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриИзменении(Элемент)
	
	ОбновитьИтогиПоТаблицам();
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьПриИзменении(Элемент)
	
	ОбновитьИтогиПоТаблицам();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДебиторПриИзменении(Элемент)
	
	УстановитьДоступностьДоговоров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторПриИзменении(Элемент)
	
	УстановитьДоступностьДоговоров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьДатаВзаиморасчетовПриИзменении(Элемент)
	
	ТекДан = Элементы.КредиторскаяЗадолженность.ТекущиеДанные;
	
	ПересчетВалютыИСуммыВСтроке("КредиторскаяЗадолженность", ТекДан.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьДатаВзаиморасчетовПриИзменении(Элемент)
	
	ТекДан = Элементы.ДебиторскаяЗадолженность.ТекущиеДанные;
	
	ПересчетВалютыИСуммыВСтроке("ДебиторскаяЗадолженность", ТекДан.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПересчетВалютыИСуммыВСтроке(ИмяТЧ, ИДСтроки)

	ИскСтр = Объект[ИмяТЧ].НайтиПоИдентификатору(ИДСтроки);
	Если ЗначениеЗаполнено(ИскСтр.ДоговорКонтрагента) Тогда
	
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ИскСтр.ДоговорКонтрагента.ВалютаВзаиморасчетов, ИскСтр.ДатаВзаиморасчетов);
		
		ИскСтр.КурсВзаиморасчетов = СтруктураКурса.Курс;
		ИскСтр.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
		
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		
			СтруктураТекущая = СтруктураКурса; 
			СтруктураНовая = Новый Структура("Курс, Кратность, Валюта", Объект.КурсДокумента, Объект.КратностьДокумента, Объект.ВалютаДокумента) ;
			
			ИскСтр.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ИскСтр.Сумма, СтруктураТекущая, СтруктураНовая);
			
		КонецЕсли; 
		
	Иначе
	
		ИскСтр.КурсВзаиморасчетов = 0;
		ИскСтр.КратностьВзаиморасчетов = 0;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьСуммаПриИзменении(Элемент)
	
	ТекДан = Элементы.ДебиторскаяЗадолженность.ТекущиеДанные;
	
	ПересчетВалютыИСуммыВСтроке("ДебиторскаяЗадолженность", ТекДан.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьСуммаПриИзменении(Элемент)
	
	ТекДан = Элементы.КредиторскаяЗадолженность.ТекущиеДанные;
	
	ПересчетВалютыИСуммыВСтроке("КредиторскаяЗадолженность", ТекДан.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораНаСервере(Сделка)

	МасРез = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка КАК Ссылка,
	               |	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщика,
	               |	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СуммаНаПТУ КАК СуммаНаПТУ
	               |ИЗ
	               |	Документ.КорректировкаПоступления.СвязанныеСчетаПоставщиков КАК КорректировкаПоступленияСвязанныеСчетаПоставщиков
	               |ГДЕ
	               |	КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка В(&Сделка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка,
	               |	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика,
	               |	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СуммаНаПТУ
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	               |ГДЕ
	               |	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка В(&Сделка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка,
	               |	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Сделка,
	               |	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаПлатежа
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
	               |ГДЕ
	               |	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка В(&Сделка)";
	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		МасРез.Добавить(Выборка.СчетПоставщика ); // Новый Структура("ДокРасч, ДокРасш", Выборка.Ссылка, 
	
	КонецЦикла;
	
	Возврат МасРез;

КонецФункции // ПолучитьСписокВыбораНаСервере(Сделка)

&НаКлиенте
Процедура КредиторскаяЗадолженностьДокументРасшифровкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьПриАктивизацииПоля(Элемент)
	
	Если Врег(Прав(Элемент.ТекущийЭлемент.Имя, 19)) = ВРег("ДокументРасшифровка") Тогда
		
		ТекДан = Элемент.ТекущиеДанные;
		
		Если ЗначениеЗаполнено(ТекДан.Сделка) Тогда
		
			Рез = ПолучитьСписокВыбораНаСервере(ТекДан.Сделка);
			
			Элемент.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(Рез);
			
		Иначе
		
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриАктивизацииПоля(Элемент)
	
	Если Врег(Прав(Элемент.ТекущийЭлемент.Имя, 19)) = ВРег("ДокументРасшифровка") Тогда
		
		ТекДан = Элемент.ТекущиеДанные;
		
		Если ЗначениеЗаполнено(ТекДан.Сделка) Тогда
		
			Рез = ПолучитьСписокВыбораНаСервере(ТекДан.Сделка);
			
			Элемент.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(Рез);
			
		Иначе
		
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьСделкаПриИзменении(Элемент)
	
	ТекДан = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекДан = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Рез = ПолучитьСписокВыбораНаСервере(ТекДан.Сделка);
	
	Если Рез.Количество() = 1 Тогда
		ТекДан.ДокументРасшифровка = Рез[0];
	Иначе
		ТекДан.ДокументРасшифровка = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьСделкаПриИзменении(Элемент)
	
	ТекДан = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекДан = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Рез = ПолучитьСписокВыбораНаСервере(ТекДан.Сделка);
	
	Если Рез.Количество() = 1 Тогда
		ТекДан.ДокументРасшифровка = Рез[0];
	Иначе
		ТекДан.ДокументРасшифровка = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьКорДоговорКонтрагентаПриИзменении(Элемент)
	//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
	УказатьВалютуВШапкеТабличнойЧасти();
	//Евросиб Дубская 06.06.2023 )       
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьКорДоговорКонтрагентаПриИзменении(Элемент)
	//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
	УказатьВалютуВШапкеТабличнойЧасти();
	//Евросиб Дубская 06.06.2023 )       
КонецПроцедуры 

//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
&НаКлиенте
Процедура УказатьВалютуВШапкеТабличнойЧасти()
	Если Объект.ДебиторскаяЗадолженность.Количество() > 0 Тогда   
		СтрокаДЗ = Объект.ДебиторскаяЗадолженность.Получить(0);
		Элементы.ДебиторскаяЗадолженностьСумма.Заголовок = "Сумма, " + ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаДЗ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		Элементы.ДебиторскаяЗадолженностьСуммаВзаиморасчетов.Заголовок = "Сумма, " + ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаДЗ.КорДоговорКонтрагента, "ВалютаВзаиморасчетов"); 
	КонецЕсли;
	Если Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда   
		СтрокаКЗ = Объект.КредиторскаяЗадолженность.Получить(0);
		Элементы.КредиторскаяЗадолженностьСумма.Заголовок = "Сумма, " + ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаКЗ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		Элементы.КредиторскаяЗадолженностьСуммаВзаиморасчетов.Заголовок = "Сумма, " + ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаКЗ.КорДоговорКонтрагента, "ВалютаВзаиморасчетов"); 
	КонецЕсли;
КонецПроцедуры  //Евросиб Дубская 06.06.2023 ) 

&НаКлиенте
Процедура ДебиторскаяЗадолженностьДоговорКонтрагентаПриИзменении(Элемент)
	//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
	УказатьВалютуВШапкеТабличнойЧасти();
	//Евросиб Дубская 06.06.2023 )       
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьДоговорКонтрагентаПриИзменении(Элемент)
	//Евросиб Дубская 06.06.2023 ( Ticket#0294896  
	УказатьВалютуВШапкеТабличнойЧасти();
	//Евросиб Дубская 06.06.2023 )       
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДебиторскаяЗадолженность.ТекущиеДанные;
	Если ТекДанные <> Неопределено и ЗначениеЗаполнено(ТекДанные.ГУИД) Тогда
	    Элементы.РасшифровкаДебиторскойЗадолженности.ОтборСтрок = Новый ФиксированнаяСтруктура("ГУИДДебиторскаяЗадолженность", ТекДанные.ГУИД); 
	Иначе	
	    Элементы.РасшифровкаДебиторскойЗадолженности.ОтборСтрок = Новый ФиксированнаяСтруктура("ГУИДДебиторскаяЗадолженность", Неопределено); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекДанные.ГУИД = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб СубботинВ #83828 08.08.2024 Начало
&НаКлиенте
Процедура ПоказатьРасшифровку(Команда)
	Элементы.РасшифровкаДебиторскойЗадолженности.Видимость = НЕ Элементы.РасшифровкаДебиторскойЗадолженности.Видимость;
	Элементы.РучнаяКорректировкаРасшифровкиДебиторскойЗадолженности.Видимость = НЕ Элементы.РучнаяКорректировкаРасшифровкиДебиторскойЗадолженности.Видимость;
	Если КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РучнаяКорректировкаРасшифровкиДебиторскойЗадолженностиКД") Тогда
		Элементы.РучнаяКорректировкаРасшифровкиДебиторскойЗадолженности.Доступность = Истина;
	КонецЕсли;
	Если Объект.РучнаяКорректировкаРасшифровкиДебиторскойЗадолженности Тогда
	    Элементы.РасшифровкаДебиторскойЗадолженности.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРасшифровкуНаСервере()
	Документы.КорректировкаДолга.ЗаполнитьРасшифровкуДебиторскойЗадолжености(Объект);
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
	ЗаполнитьРасшифровкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаРасшифровкиДебиторскойЗадолженностиПриИзменении(Элемент)
	Элементы.РасшифровкаДебиторскойЗадолженности.ТолькоПросмотр = НЕ Объект.РучнаяКорректировкаРасшифровкиДебиторскойЗадолженности;
КонецПроцедуры
//Евросиб СубботинВ #83828 08.08.2024 Конец

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Евросиб Каблов 03.03.2026 ( #83826
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого СтрокаДЗ Из Объект.ДебиторскаяЗадолженность Цикл
			
			СуммаПоСтрокеДЗ = СтрокаДЗ.Сумма;
			СуммаПоСтрокамРасшифровки = 0;
			Счета = Новый Массив;
			СтрокиРасшифровки = Объект.РасшифровкаДебиторскойЗадолженности.НайтиСтроки(Новый Структура("ГУИДДебиторскаяЗадолженность", СтрокаДЗ.ГУИД));
			Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
				СуммаПоСтрокамРасшифровки = СуммаПоСтрокамРасшифровки + СтрокаРасшифровки.Сумма;
				Счета.Добавить(СтрокаРасшифровки.ДокументРасшифровки);
			КонецЦикла;
			
			Если СуммаПоСтрокеДЗ < СуммаПоСтрокамРасшифровки Тогда
				СуммаПревышения = СуммаПоСтрокамРасшифровки - СуммаПоСтрокеДЗ;
				СчетаСтрокой = СтрСоединить(Счета, ", ");
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Для документа %1 превышена сумма корректировки по %2 на %3. Проведение отменено.'"), СтрокаДЗ.Сделка, СчетаСтрокой, СуммаПревышения);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДебиторскаяЗадолженность", СтрокаДЗ.НомерСтроки, "Сделка");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//Евросиб Каблов 03.03.2026 )
	
КонецПроцедуры
 
