
//Евросиб Коханенко Н.А. 24.07.2023 (( #72829 
//используется при создании ПСЦ на основании калькуляции
//и при добавлении калькуляции в заявку или в ПСЦ
Функция ПроверитьНаВозможностьИспользованияКалькуляцииПоРезультатамСогласования(ТекущийОбъектСсылка, КалькуляцияСсылка, СозданНаОсновании = Ложь) Экспорт
	
	Отказ = Ложь;
	
	//Евросиб Коханенко Н.А. 05.04.2024 (( #83428 
	Калькуляция = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КалькуляцияСсылка, "Контрагент, ТипКалькуляции, Номер, ОкончаниеДействия, Состояния");
	//Евросиб Коханенко Н.А. 05.04.2024 )) #83428 
	Если НЕ КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Калькуляция.Контрагент)
		ИЛИ Калькуляция.ТипКалькуляции <> Перечисления.ТипыКалькуляций.МежсервисныеРасходы
		//Евросиб Коханенко Н.А. 04.04.2024 (( #83428 
		И Калькуляция.ТипКалькуляции <> Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф
		//Евросиб Коханенко Н.А. 04.04.2024 )) #83428 
	Тогда
		Возврат Отказ;
	КонецЕсли;

	//Евросиб Коханенко Н.А. 05.04.2024 (( #83428 
	//СогласованиеЗавершено = неопределено;
	СогласованиеЗавершено = Истина;
	//Евросиб Коханенко Н.А. 05.04.2024 )) #83428 
	СогласованиеОтклонено = Ложь; 
	
	//Евросиб Коханенко Н.А. 05.04.2024 (( #83428 
	РезультатЗапроса = Калькуляция.Состояния;
	Стр = РезультатЗапроса.Выбрать();
	//Евросиб Коханенко Н.А. 05.04.2024 )) #83428 
	
	//Для каждого Стр из Калькуляция.Состояния Цикл
	Пока Стр.Следующий() Цикл
	//Евросиб Коханенко Н.А. 05.04.2024 )) #83428 
		Если НЕ Стр.Состояние.Согласование Тогда Продолжить; КонецЕсли;
		//СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И 
		СогласованиеЗавершено = СогласованиеЗавершено И 
		//Евросиб Коханенко Н.А. 05.04.2024 )) #83428 
			(Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен 
				ИЛИ 
			//если Исполнителем является Никитин Н.Д., который входит в состав группы Рук.Отд.продаж, 
			//то статус НаВыполнение приравниваем к статусу Выполнен 
			(Стр.Исполнитель = ПредопределенноеЗначение("Справочник.ГруппыПользователей.РуководительОтделаПродаж") 
			И Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение));
		//Евросиб Коханенко Н.А. 04.04.2024 (( #83428 
		//СогласованиеОтклонено = СогласованиеОтклонено ИЛИ Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен;
		СогласованиеОтклонено = СогласованиеОтклонено 
									ИЛИ Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен
									ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями
									//Евросиб Коханенко Н.А. 11.04.2024 (( #83870
									//с этим статусом согласовывать можно - уточнение от бизнеса
									//ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями
									//Евросиб Коханенко Н.А. 11.04.2024 )) #83870 
									ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний
									ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		//Евросиб Коханенко Н.А. 04.04.2024 )) #83428 
	КонецЦикла;
	
	Если ТипЗнч(ТекущийОбъектСсылка) = Тип("ДокументСсылка.Заявка") Тогда
		ТекстСообщения = "Документ заблокирован для выбора, т.к. ";
	Иначе
		//второй вариант - это ПСЦ
		ТекстСообщения = ?(СозданНаОсновании, "Создание протокола невозможно, т.к. ", 
											  "Документ заблокирован для выбора, т.к. ");
	КонецЕсли;	 
	
	Если СогласованиеОтклонено Тогда
		ТекстСообщения = ТекстСообщения + "калькуляция №" + Калькуляция.Номер + " отклонена одним из согласующих лиц";	
		Отказ = Истина; 
	ИначеЕсли НЕ СогласованиеЗавершено Тогда		
		ТекстСообщения = ТекстСообщения + "калькуляция №" + Калькуляция.Номер + " не до конца согласована";
		Отказ = Истина; 
	КонецЕсли;
	Если ТекущаяДата() >= Калькуляция.ОкончаниеДействия Тогда
		Если Отказ Тогда
			ТекстСообщения = ТекстСообщения + ", и у нее закончился период действия"; 
		Иначе
			ТекстСообщения = ТекстСообщения + "у калькуляции №" + Калькуляция.Номер + " закончился период действия"; 
			Отказ = Истина; 
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + "!",,,, Отказ);
	КонецЕсли;
	Возврат Отказ;	
КонецФункции
//Евросиб Коханенко Н.А. 24.07.2023 )) #72829 

//Евросиб Коханенко Н.А. 01.08.2023 (( #72829 
Функция ТипКалькуляцииЯвляетсяМежсервиснымиРасходами(СсылкаНаТипКалькуляции) Экспорт
	Возврат СсылкаНаТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы 
				ИЛИ СсылкаНаТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф;
КонецФункции
//Евросиб Коханенко Н.А. 01.08.2023 )) #72829
