
Процедура РазборДополнительныхУсловий(ВыборкаГУИД,СсылкаНаОперацию,МассивМоментовВремени,ИмяТбл,ДатаРегистрацииЗаявки,ДокументОснование,Калькуляции,ТаблицаВыполненныхЗадач) ЭКСПОРТ
	
	МассивГУИДПодходящихСтрок = Новый Массив;
	ОтправитьДругомуМенеджеру = Новый Массив;
	
	ДатаОтсчетаИзДругойОперации = Неопределено;
	
	// нужны для записи в том случае, если требование документов/задач идет повагонное или поконтейнерное
	МассивПодходящихВагонов = Новый Массив;
	МассивПодходящихКТК = Новый Массив;

	Пока ВыборкаГУИД.Следующий() Цикл
		
		// сохраним ссылку на операцию, которая была инициатором всей проверки
		ИзначальнаяСсылкаНаОперацию = СсылкаНаОперацию;

		
		/////////////////////////////////////////////////////////////////////////////////////
		// если установлен флаг "УчитыватьДляВсейОперации", значит нужна для одной из 
		// операций ТСх проверить все дополнительные условия. для этого
		// находим все операции ТСХ и для каждой из них делаем проверку по всем условиям (подменяем переменную Ссылка) 
		// как только подходящая операция найдена, останавливаем цикл
		
		УчитыватьДляВсейОперации = ?(НЕ ЗначениеЗаполнено(ВыборкаГУИД.УчитыватьДляВсейОперации),Ложь,ВыборкаГУИД.УчитыватьДляВсейОперации);
		
		Если УчитыватьДляВсейОперации Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
			               |ГДЕ
			               |	ТехнологическаяСхемаТЧ.Операция = &Операция
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТехнологическаяСхемаТЧ.Операция КАК Ссылка
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
			               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка";
			Запрос.УстановитьПараметр("Операция",СсылкаНаОперацию);
			ТаблицаПроверяемыхОпераций = Запрос.Выполнить().Выгрузить();
		Иначе
			// если флаг не установлен, все равно создадим таблицу с единственной строкой для универсальнось
			ТаблицаПроверяемыхОпераций = Новый ТаблицаЗначений;
			ТаблицаПроверяемыхОпераций.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("ДокументСсылка.Операция"));
			НовСтр = ТаблицаПроверяемыхОпераций.Добавить();
			НовСтр.Ссылка = СсылкаНаОперацию;
		КонецЕсли;
		/////////////////////////////////////////////////////////////////////////////////////////
		Для Каждого СтрТПО Из ТаблицаПроверяемыхОпераций Цикл
			
			Ссылка = СтрТПО.Ссылка;
			
		
			Грузы = Ссылка.Грузы;
			ПунктОтправления = Ссылка.ПунктОтправления;
			ПунктНазначения = Ссылка.ПунктНазначения;

			
			ВыборкаДетальныеЗаписи = ВыборкаГУИД.Выбрать();
		    УсловиеВыполняется = Истина;
		    МассивДругихЗадач = Новый Массив;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				// проверяем каждое условие, при котором должен быть создан документ или отправлено оповещение
				
				// проверим заполненность реквизита ВидОперации. Если он заполнен, то установка дат красно-желтых порогов
				// должна производиться с учетом выбранной операции.
				// эта проверка выполняется от имени операции, которая делает проводку
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВидОперации) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ ПЕРВЫЕ 1
					               |	ТехнологическаяСхемаТЧ.Операция КАК Операция
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция.Услуга = &Услуга";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("Услуга",ВыборкаДетальныеЗаписи.ВидОперации);
					ТЗ = Запрос.Выполнить().Выгрузить();
					
					// если операцию нашли, то нужно проверить ее даты. в зависимости от "МоментВремени" выбрать нужную
					Если ТЗ.Количество()>0 Тогда
						НайденнаяОперация = ТЗ[0].Операция;
						Если НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) = Неопределено Тогда
							ДатаОтсчетаИзДругойОперации = НайденнаяОперация.ДатаОтправления;
						ИначеЕсли НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) = Неопределено ИЛИ
							НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ОтНачалаДоОкончания) = Неопределено Тогда
							ДатаОтсчетаИзДругойОперации = ?(ЗначениеЗаполнено(НайденнаяОперация.ДатаОтправленияФакт),НайденнаяОперация.ДатаОтправленияФакт,НайденнаяОперация.ДатаОтправления);
						ИначеЕсли НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) = Неопределено ИЛИ
							НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) = Неопределено Тогда
							ДатаОтсчетаИзДругойОперации = ?(ЗначениеЗаполнено(НайденнаяОперация.ДатаНазначенияФакт),НайденнаяОперация.ДатаНазначенияФакт,НайденнаяОперация.ДатаНазначения);		
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				// если установлен момент времени "До начала предыдущей операции", то получить эту операцию и взять из нее
				// дату начала план (т.к. нужно взять дату ДО начала).
				// эта проверка выполняется от имени операции, которая делает проводку
				Если ВыборкаДетальныеЗаписи.МоментВремени = Перечисления.ТипМоментаВремени.ДоНачалаПредыдущейОперации Тогда
					МассивГУИДРодителей = ПолучитьМассивРодителей(ССылка,Истина,1);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Операция КАК Операция
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
					Иначе
						ДатаОтсчетаИзДругойОперации = ?(ЗначениеЗаполнено(ТЗ[0].Операция.ДатаОтправленияФакт),ТЗ[0].Операция.ДатаОтправленияФакт,ТЗ[0].Операция.ДатаОтправления);
					КонецЕсли;
					
				КонецЕсли;

				
				// если доп условий нет, то проверяем момент срабатывания условия (может зависеть от другой операции)
				Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДопУсловиеНаименование) Тогда
					МассивГУИДПодходящихСтрок.Добавить(ВыборкаГУИД.ГУИД);
					Продолжить;
				КонецЕсли;
				
				// сначала получим перечень всех значений для данного условия
				ТаблицаЗначенийУсловий = ВыборкаДетальныеЗаписи.ДопУсловиеНаименование.ДанныеДляОтборов;
				Если ТаблицаЗначенийУсловий.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				// выгружаем колонку в массив для подстановки в качестве параметра в запрос
				МассивДанныхДляОтбора = ТаблицаЗначенийУсловий.ВыгрузитьКолонку("ЗначениеДляОтбора");
				// получаем вид сравнения для дополнительного условия
				ВидСравненияДУ = ВыборкаДетальныеЗаписи.ДопУсловиеНаименование.ВидыСравненияДопУсловий;
				// получаем вид сравнения для дополнительного условия
				ДниРасчета = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
				
				
				///////////////////////////////////////////////////////////////////////////////////////////////
				///////////////////////////// ВАРИАНТЫ РАСЧЕТОВ ///////////////////////////////////////////////
				///////////////////////////////////////////////////////////////////////////////////////////////
				
				// 1. ПорожнийКТК
				Если ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ПорожнийКТК Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОперацияГрузы.ТЕ КАК ТЕ
					               |ИЗ
					               |	Документ.Операция.Грузы КАК ОперацияГрузы
					               |ГДЕ
					               |	НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.пустаяССылка)
					               |	И ОперацияГрузы.Ссылка = &Ссылка
					               |	И НЕ ОперацияГрузы.ГруженоеТЕ = &ГруженоеТЕ";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					Запрос.УстановитьПараметр("ГруженоеТЕ",ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						МассивПорожнихКТК = Новый Массив;
						Для Каждого Стр Из ТЗ Цикл
							Если МассивПорожнихКТК.Найти(Стр.ТЕ) = Неопределено Тогда
								МассивПорожнихКТК.Добавить(Стр.ТЕ);
							КонецЕсли;
						КонецЦикла;
						
						Если МассивПорожнихКТК.Количество()>0 Тогда
							МассивПодходящихКТК.Добавить(МассивПорожнихКТК);
						КонецЕсли;
					КонецЕсли;

				// 2. ГруженыйКТК
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ГруженыйКТК Тогда 
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОперацияГрузы.ТЕ КАК ТЕ
					               |ИЗ
					               |	Документ.Операция.Грузы КАК ОперацияГрузы
					               |ГДЕ
					               |	НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.пустаяССылка)
					               |	И ОперацияГрузы.Ссылка = &Ссылка
					               |	И ОперацияГрузы.ГруженоеТЕ = &ГруженоеТЕ";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					Запрос.УстановитьПараметр("ГруженоеТЕ",ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						МассивГруженыхКТК = Новый Массив;
						Для Каждого Стр Из ТЗ Цикл
							Если МассивГруженыхКТК.Найти(Стр.ТЕ) = Неопределено Тогда
								МассивГруженыхКТК.Добавить(Стр.ТЕ);
							КонецЕсли;
						КонецЦикла;
						
						Если МассивГруженыхКТК.Количество()>0 Тогда
							МассивПодходящихКТК.Добавить(МассивГруженыхКТК);
						КонецЕсли;
					КонецЕсли;
					
				
				// 3. Проверка всех операций ТСх на наличие или отсутствие видов операций 
				// (во всех операциях ТСх должны выполняться или НЕ выполняться перечисленные условия)
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВсеОперацииТехнологическойСхемы Тогда
					// получим все операции "вокруг" данной ТСх
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Ссылка";
					Запрос.УстановитьПараметр("Операция",Ссылка);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если вид сравнения равно или в списке, то для учета данного условия 
						// результат запроса должен вернуть ВсегоОперацийТсх = ВидОперацииВСписке
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
							НЕ ТЗ[0].ВсегоОперацийТсх = ТЗ[0].ВидОперацииВСписке Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
						// результат запроса должен вернуть ВсегоОперацийТсх = ВидОперацииНеВСписке
						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
							НЕ ТЗ[0].ВсегоОперацийТсх = ТЗ[0].ВидОперацииНеВСписке Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				// 4. Проверка хотя бы одной операций ТСх на наличие или отсутствие видов операций
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ОднаИзОперацииТехнологическойСхемы Тогда
					// получим все операции "вокруг" данной ТСх
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка,
					               |	Сумма(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция = &Операция
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ТекОперацияВСписке,
					               |	Сумма(ВЫБОР
					               |		КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция = &Операция
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ТекОперацияНеВСписке
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Ссылка";
					Запрос.УстановитьПараметр("Операция",Ссылка);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ТекОперацияВСписке/ТекОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ТекОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ТекОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 5. Проверка, чтобы в операции пункт отправления ИЛИ пункт назначения были не на территории РФ
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ПеревозкаНеРФ И 
					ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора = Истина Тогда
					ПунктОтправленияИерархМассив = Локации_сервер.ПолучитьМассивРодителей(ПунктОтправления,Истина);
					ПунктНазначенияИерархМассив = Локации_сервер.ПолучитьМассивРодителей(ПунктНазначения,Истина);
					
					Если НЕ ПунктОтправленияИерархМассив.Найти(Справочники.Локации.РОССИЯ) = Неопределено И 
						НЕ ПунктНазначенияИерархМассив.Найти(Справочники.Локации.РОССИЯ) = Неопределено Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
				
				// 6. Проверка хотя бы одной ПРЕДЫДУЩЕЙ операций ТСх на наличие или отсутствие видов операций.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВсеПредыдущиеОперации Тогда
					
					МассивГУИДРодителей = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Истина,Неопределено);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	Сумма(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Ссылка";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 7. Проверка хотя бы одной СЛЕДУЮЩЕЙ операций ТСх на наличие или отсутствие видов операций.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВсеСледующиеОперации Тогда
					
					МассивГУИДПодчиненных = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Ложь,Неопределено);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Ссылка";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 8. Проверка НЕПОСРЕДСТВЕННО ОДНОЙ ПРЕДЫДУЩЕЙ операций ТСх на наличие или отсутствие видов операций.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ПредыдущаяОперация Тогда
					
					МассивГУИДРодителей = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Истина,1);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ВидОперацииВСписке,
					               |	ВЫБОР
					               |		КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ВидОперацииНеВСписке,
					               |	ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ПроверяемаяОперацияВСписке,
					               |	ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК ПроверяемаяОперацияНеВСписке,
					               |	1 КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ2
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВТ2.ВидОперацииВСписке) КАК ВидОперацииВСписке,
					               |	СУММА(ВТ2.ВидОперацииНеВСписке) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВТ2.ПроверяемаяОперацияВСписке) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВТ2.ПроверяемаяОперацияНеВСписке) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(ВТ2.ВсегоОперацийТсх) КАК ВсегоОперацийТсх,
					               |	ВТ2.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ2 КАК ВТ2
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ2.Ссылка";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 9. Проверка НЕПОСРЕДСТВЕННО ОДНОЙ СЛЕДУЮЩЕЙ операций ТСх на наличие или отсутствие видов операций.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.СледующаяОперация Тогда
					
					МассивГУИДПодчиненных = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Ложь,1);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Ссылка";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 10. Проверка НЕПОСРЕДСТВЕННО ОДНОЙ ПРЕДЫДУЩЕЙ операций ТСх на наличие или отсутствие видов операций
				// и отправка сообщения ПРЕДЫДУЩЕМУ менеджеру.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ПредыдущаяОперацияОтправитьЕЕМенеджеру Тогда
					
					МассивГУИДРодителей = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Истина,1);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ТехнологическаяСхемаТЧ.Операция КАК Операция
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |СГРУППИРОВАТЬ ПО
					               |	ТехнологическаяСхемаТЧ.Операция";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					// если условие выполняется, то сохранить инорфмацию об отправке другому менеджеру оповещения о другой операции.
					Если УсловиеВыполняется = Истина Тогда
						МассивДругихЗадач.Добавить(ТЗ[0].Операция);
					КонецЕсли;
		
				// 11. Проверка НЕПОСРЕДСТВЕННО ОДНОЙ СЛЕДУЮЩЕЙ операций ТСх на наличие или отсутствие видов операций
				// и отправка сообщения ПРЕДЫДУЩЕМУ менеджеру.
				// эта проверка выполняется от имени операции, которая делает проводку
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.СледующаяОперацияОтправитьЕЕМенеджеру Тогда
					
					МассивГУИДПодчиненных = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Ложь,1);
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВЫБОР
					               |			КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(1) КАК ВсегоОперацийТсх,
					               |	ТехнологическаяСхемаТЧ.Операция КАК Операция
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |СГРУППИРОВАТЬ ПО
					               |	ТехнологическаяСхемаТЧ.Операция";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					// если условие выполняется, то сохранить инорфмацию об отправке другому менеджеру оповещения о другой операции.
					Если УсловиеВыполняется = Истина Тогда
						МассивДругихЗадач.Добавить(ТЗ[0].Операция);
					КонецЕсли;
		
				// 12. Проверка наличия хотя бы одной калькуляции на наличие или отсутствие услуги
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.УслугаВКалькуляции Тогда
					
					// т.к. из заявок калькуляцию передаем, а из операций нет (Неопределено), 
					// то для наих надо получить массив калькуляций
					Если Калькуляции = Неопределено Тогда
						Калькуляции = ПолучитьКалькуляцииПоОперации(ИзначальнаяСсылкаНаОперацию);
					КонецЕсли;
					
					Если Калькуляции = Неопределено ИЛИ 
						Калькуляции.Количество() = 0 Тогда
					    УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
					               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
					               |ГДЕ
					               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&Ссылка)
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка,
					               |	КалькуляцияЖД_УслугиВнеСтавки.Услуга
					               |ИЗ
					               |	Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
					               |ГДЕ
					               |	КалькуляцияЖД_УслугиВнеСтавки.Ссылка В(&Ссылка)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВТ.Калькуляция КАК Калькуляция,
					               |	СУММА(ВЫБОР
					               |			КОГДА ВТ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК УслугаВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ВТ.Услуга В (&Услуга)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК УслугаНеВСписке
					               |ИЗ
					               |	ВТ КАК ВТ
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Калькуляция";
					Запрос.УстановитьПараметр("Ссылка",Калькуляции);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если вид сравнения равно или в списке, то для учета данного условия 
						// результат запроса должен вернуть УслугаВСписке > 0
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
							ТЗ[0].УслугаВСписке = 0 Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
						// результат запроса должен вернуть УслугаНеВСписке > 0
						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
							ТЗ[0].УслугаНеВСписке = 0 Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				// 13. НаличиеЛицензии
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.НаличиеЛицензии И 
					ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора = Истина Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ЛицензияНаПеревозкуОпасныхГрузов.Контрагент КАК Контрагент
					               |ИЗ
					               |	РегистрСведений.ЛицензияНаПеревозкуОпасныхГрузов КАК ЛицензияНаПеревозкуОпасныхГрузов
					               |ГДЕ
					               |	ЛицензияНаПеревозкуОпасныхГрузов.ДатаОкончанияДействияЛицензии < &ДатаОкончанияДействияЛицензии
					               |	И ЛицензияНаПеревозкуОпасныхГрузов.Контрагент = &Контрагент";
					Запрос.УстановитьПараметр("Контрагент",Ссылка.Поставщик);
					// лицензия должна заканчиваться после окончания перевозки
					Если НЕ ЗначениеЗаполнено(Ссылка.ДатаНазначения) И
						Не ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт) Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						ДатаОкончанияЛицензии = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
						Запрос.УстановитьПараметр("ДатаОкончанияДействияЛицензии",ДатаОкончанияЛицензии);
					КонецЕсли;
					Если НЕ Запрос.Выполнить().Пустой() Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
				// 14. НастроитьРассылкуДислокации. дислокация должна быть у всех клиентов из массива. если у какого-то нет - формируем задачу
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.НастроитьРассылкуДислокации И 
					ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора = Истина Тогда
					
					МассивКлиентов = ПолучитьКлиентовПоОперации(Ссылка);
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	РассылкаДислокацийРеквизитыВагонов.Клиент КАК Клиент
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.РассылкаДислокаций.РеквизитыВагонов КАК РассылкаДислокацийРеквизитыВагонов
					               |ГДЕ
					               |	РассылкаДислокацийРеквизитыВагонов.Клиент В (&Клиент)
					               |	И РассылкаДислокацийРеквизитыВагонов.Ссылка.ДатаОкончания >= &ДатаОкончания
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	РассылкаДислокацийРеквизитыКТК.Клиент
					               |ИЗ
					               |	Справочник.РассылкаДислокаций.РеквизитыКТК КАК РассылкаДислокацийРеквизитыКТК
					               |ГДЕ
					               |	РассылкаДислокацийРеквизитыКТК.Клиент В(&Клиент)
					               |	И РассылкаДислокацийРеквизитыКТК.Ссылка.ДатаОкончания >= &ДатаОкончания
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ РАЗЛИЧНЫЕ
					               |	ВТ.Клиент КАК Клиент
					               |ИЗ
					               |	ВТ КАК ВТ";
					Запрос.УстановитьПараметр("Клиент",МассивКлиентов);
					// рассылка должна заканчиваться после окончания перевозки
					Если НЕ ЗначениеЗаполнено(Ссылка.ДатаНазначения) И
						Не ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт) Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						ДатаОкончанияРассылки = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
						Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончанияРассылки);
					КонецЕсли;
					КолвоЗаписейВЗапросе = Запрос.Выполнить().Выгрузить().Количество();
					КолвоКлиентовВМассиве = МассивКлиентов.Количество();
					
					Если КолвоЗаписейВЗапросе = КолвоКлиентовВМассиве Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
				// 15. Проверка наличия хотя бы одной калькуляции на наличие или отсутствие вида перевозки
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВидПеревозкиВКалькуляции Тогда
					
					Если Калькуляции = Неопределено Тогда
						Калькуляции = ПолучитьКалькуляцииПоОперации(ИзначальнаяСсылкаНаОперацию);
					КонецЕсли;
					
					Если Калькуляции = Неопределено ИЛИ 
						Калькуляции.Количество() = 0 Тогда
					    УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	Калькуляция.Ссылка КАК Калькуляция,
					               |	Калькуляция.ПС_ВидПеревозки КАК ПС_ВидПеревозки
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Документ.Калькуляция КАК Калькуляция
					               |ГДЕ
					               |	Калькуляция.Ссылка В(&Ссылка)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВТ.Калькуляция КАК Калькуляция,
					               |	СУММА(ВЫБОР
					               |			КОГДА ВТ.ПС_ВидПеревозки В (&ПС_ВидПеревозки)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидПеревозкиВСписке,
					               |	СУММА(ВЫБОР
					               |			КОГДА НЕ ВТ.ПС_ВидПеревозки В (&ПС_ВидПеревозки)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ) КАК ВидПеревозкиНеВСписке
					               |ИЗ
					               |	ВТ КАК ВТ
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ.Калькуляция";
					Запрос.УстановитьПараметр("Ссылка",Калькуляции);
					Запрос.УстановитьПараметр("ПС_ВидПеревозки",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если вид сравнения равно или в списке, то для учета данного условия 
						// результат запроса должен вернуть ВидПеревозкиВСписке > 0
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
							ТЗ[0].ВидПеревозкиВСписке = 0 Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
						// результат запроса должен вернуть ВидПеревозкиНеВСписке > 0
						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
							ТЗ[0].ВидПеревозкиНеВСписке = 0 Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				// 16. проверка, если плановая больше или равна фактической, то условие не выполняется
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ФактическаяДлительностьБольшеПлановой И 
					ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора = Истина Тогда
					Если ЗначениеЗаполнено(Ссылка.ДатаНазначения) И
						ЗначениеЗаполнено(ССылка.ДатаОтправления) И
						ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт) И
						ЗначениеЗаполнено(ССылка.ДатаОтправленияФакт) Тогда
						Если (Ссылка.ДатаНазначенияФакт - ССылка.ДатаОтправленияФакт)<=(Ссылка.ДатаНазначения - ССылка.ДатаОтправления) Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					Иначе 
						УсловиеВыполняется = Ложь;
						Прервать;
					КонецЕсли;
					
				// 17. Проверка НЕПОСРЕДСТВЕННО ОДНОЙ ПРЕДЫДУЩЕЙ и СЛЕДУЮЩЕЙ операций ТСх на наличие или отсутствие видов операций
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ОтсутствиеСоседнейОперации Тогда
					
					МассивГУИДРодителей = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Истина,1);
					МассивГУИДПодчиненных = ПолучитьМассивРодителей(ИзначальнаяСсылкаНаОперацию,Ложь,1);
					// объединим два массива для передачи параметра в запрос
					Для Каждого ЭлМ Из МассивГУИДПодчиненных Цикл
						МассивГУИДРодителей.Добавить(ЭлМ);
					КонецЦикла;
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.Операция = &Операция
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ВидОперацииВСписке,
					               |	ВЫБОР
					               |		КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ВидОперацииНеВСписке,
					               |	ВЫБОР
					               |		КОГДА ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |				И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ПроверяемаяОперацияВСписке,
					               |	ВЫБОР
					               |			КОГДА НЕ ТехнологическаяСхемаТЧ.Услуга В ИЕРАРХИИ (&Услуга)
					               |					И ТехнологическаяСхемаТЧ.Операция В (&ПроверяемаяОперация)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК ПроверяемаяОперацияНеВСписке,
					               |	1 КАК ВсегоОперацийТсх,
					               |	ВТ.Ссылка КАК Ссылка
					               |ПОМЕСТИТЬ ВТ2
					               |ИЗ
					               |	ВТ КАК ВТ
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
					               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
					               |ГДЕ
					               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	СУММА(ВТ2.ВидОперацииВСписке) КАК ВидОперацииВСписке,
					               |	СУММА(ВТ2.ВидОперацииНеВСписке) КАК ВидОперацииНеВСписке,
					               |	СУММА(ВТ2.ПроверяемаяОперацияВСписке) КАК ПроверяемаяОперацияВСписке,
					               |	СУММА(ВТ2.ПроверяемаяОперацияНеВСписке) КАК ПроверяемаяОперацияНеВСписке,
					               |	СУММА(ВТ2.ВсегоОперацийТсх) КАК ВсегоОперацийТсх,
					               |	ВТ2.Ссылка КАК Ссылка
					               |ИЗ
					               |	ВТ2 КАК ВТ2
					               |
					               |СГРУППИРОВАТЬ ПО
					               |	ВТ2.Ссылка";
					Запрос.УстановитьПараметр("Операция",ИзначальнаяСсылкаНаОперацию);
					Запрос.УстановитьПараметр("ПроверяемаяОперация",Ссылка);
					Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
					Запрос.УстановитьПараметр("Услуга",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// если мы проверяем конкретную операцию, то нужно проверить поле ПроверяемаяОперацияВСписке/ПроверяемаяОперацияНеВСписке
						// на равенство 0
						Если ВыборкаДетальныеЗаписи.УчитыватьДляВсейОперации Тогда
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ПроверяемаяОперацияВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ПроверяемаяОперацияНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						Иначе
							// если вид сравнения равно или в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииВСписке > 0
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И 
								ТЗ[0].ВидОперацииВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							// если вид сравнения НЕ равно или НЕ в списке, то для учета данного условия 
							// результат запроса должен вернуть ВидОперацииНеВСписке > 0
							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И 
								ТЗ[0].ВидОперацииНеВСписке = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 18. Проверка СобственностьКонтейнеров
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.СобственностьКонтейнеров Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОперацияГрузы.ТЕ КАК ТЕ
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Документ.Операция.Грузы КАК ОперацияГрузы
					               |ГДЕ
					               |	ОперацияГрузы.Ссылка = &Ссылка
					               |	И НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
					               |	ВЫБОР
					               |			КОГДА ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК СобственностьВСписке,
					               |	ВЫБОР
					               |			КОГДА НЕ ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК СобственностьНеВСписке
					               |ИЗ
					               |	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(&Период, ) КАК ПризнакСобственностиКонтейнераСрезПоследних
					               |ГДЕ
					               |	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер В
					               |			(ВЫБРАТЬ
					               |				ВТ.ТЕ
					               |			ИЗ
					               |				ВТ КАК ВТ)";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					// период собственности берем в зависимости от содержимого массива моментов времени
					Если МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) Тогда 
						ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаОтправленияФакт),Ссылка.ДатаОтправленияФакт,Ссылка.ДатаОтправления);
					ИначеЕсли МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) Тогда 
						ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
					КонецЕсли;	
					Запрос.УстановитьПараметр("Период",ПериодСобственности);
					Запрос.УстановитьПараметр("ПризнакСобственности",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// для учета данного условия 
						// отбор по результату запроса должен вернуть колво строк > 0
						МассивКТКСобственность = Новый Массив;

						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) Тогда
							ПараметрыОтбора1 = Новый Структура;
							ПараметрыОтбора1.Вставить("СобственностьВСписке",1);
							НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
							Если НайденныеСтр.Количество() = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							Иначе
								Для Каждого Стр Из ТЗ Цикл
									Если МассивКТКСобственность.Найти(Стр.Контейнер) = Неопределено Тогда
										МассивКТКСобственность.Добавить(Стр.Контейнер);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;

						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) Тогда 
							ПараметрыОтбора1 = Новый Структура;
							ПараметрыОтбора1.Вставить("СобственностьНеВСписке",1);
							НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
							Если НайденныеСтр.Количество() = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							Иначе
								Для Каждого Стр Из ТЗ Цикл
									Если МассивКТКСобственность.Найти(Стр.Контейнер) = Неопределено Тогда
										МассивКТКСобственность.Добавить(Стр.Контейнер);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
						Если МассивКТКСобственность.Количество()>0 Тогда
							МассивПодходящихКТК.Добавить(МассивКТКСобственность);
						КонецЕсли;
						
					КонецЕсли;
					
				// 19. Проверка СобственностьВагонов
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.СобственностьВагонов Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОперацияГрузы.ТС КАК ТС
					               |ПОМЕСТИТЬ ВТ
					               |ИЗ
					               |	Документ.Операция.Грузы КАК ОперацияГрузы
					               |ГДЕ
					               |	ОперацияГрузы.Ссылка = &Ссылка
					               |	И НЕ ОперацияГрузы.ТС = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВЫБОР
					               |			КОГДА ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК СобственностьВСписке,
					               |	ВЫБОР
					               |			КОГДА НЕ ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
					               |				ТОГДА 1
					               |			ИНАЧЕ 0
					               |		КОНЕЦ КАК СобственностьНеВСписке,
					               |	ПризнакСобственностиВагонаСрезПоследних.Вагон КАК Вагон
					               |ИЗ
					               |	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(&Период, ) КАК ПризнакСобственностиВагонаСрезПоследних
					               |ГДЕ
					               |	ПризнакСобственностиВагонаСрезПоследних.Вагон В
					               |			(ВЫБРАТЬ
					               |				ВТ.ТС
					               |			ИЗ
					               |				ВТ КАК ВТ)";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					// период собственности берем в зависимости от содержимого массива моментов времени
					Если МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) Тогда 
						ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаОтправленияФакт),Ссылка.ДатаОтправленияФакт,Ссылка.ДатаОтправления);
					ИначеЕсли МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) Тогда 
						ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
					КонецЕсли;	
					Запрос.УстановитьПараметр("Период",ПериодСобственности);
					Запрос.УстановитьПараметр("ПризнакСобственности",МассивДанныхДляОтбора);
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						// для учета данного условия 
						// отбор по результату запроса должен вернуть колво строк > 0
						МассивВагСобственность = Новый Массив;
						
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) Тогда
							ПараметрыОтбора1 = Новый Структура;
							ПараметрыОтбора1.Вставить("СобственностьВСписке",1);
							НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
							Если НайденныеСтр.Количество() = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							Иначе
								Для Каждого Стр Из ТЗ Цикл
									Если МассивВагСобственность.Найти(Стр.Вагон) = Неопределено Тогда
										МассивВагСобственность.Добавить(Стр.Вагон);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;

						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) Тогда 
							ПараметрыОтбора1 = Новый Структура;
							ПараметрыОтбора1.Вставить("СобственностьНеВСписке",1);
							НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
							Если НайденныеСтр.Количество() = 0 Тогда
								УсловиеВыполняется = Ложь;
								Прервать;
							Иначе
								Для Каждого Стр Из ТЗ Цикл
									Если МассивВагСобственность.Найти(Стр.Вагон) = Неопределено Тогда
										МассивВагСобственность.Добавить(Стр.Вагон);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
						Если МассивВагСобственность.Количество()>0 Тогда
							МассивПодходящихВагонов.Добавить(МассивВагСобственность);
						КонецЕсли;
					КонецЕсли;
					
				// 20. Проверка ВагоныЕвросиб
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВагоныЕвросиб Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	СделкаРейсы.Рейс.ТребуютсяВагоныЕС КАК РейсТребуютсяВагоныЕС
					               |ИЗ
					               |	Документ.Операция КАК Операция
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
					               |		ПО Операция.Сделка = СделкаРейсы.Ссылка
					               |ГДЕ
					               |	Операция.Ссылка = &Ссылка
					               |	И СделкаРейсы.Рейс.ТребуютсяВагоныЕС = &ТребуютсяВагоныЕС";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					Запрос.УстановитьПараметр("ТребуютсяВагоныЕС",ТаблицаЗначенийУсловий[0].ЗначениеДляОтбора);
					
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняется = Ложь;
						Прервать;
					Иначе
						МассивВагЕвросиб = Новый Массив;
						Для Каждого Стр Из Грузы Цикл
							Если НЕ ЗначениеЗаполнено(Стр.ТС) Тогда
								Продолжить;
							КонецЕсли;
							Если МассивВагЕвросиб.Найти(Стр.ТС) = Неопределено Тогда
								МассивВагЕвросиб.Добавить(Стр.ТС);
							КонецЕсли;
						КонецЦикла;
						Если МассивВагЕвросиб.Количество()>0 Тогда
							МассивПодходящихВагонов.Добавить(МассивВагЕвросиб);
						КонецЕсли;
					КонецЕсли;
					
				// 21. Проверка либо Вагоны Евросиб Не Требуются либо Собственность из выбранного значения
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ВагоныЕвросибНеТребуютсяИлиСобственность Тогда
					
					УсловиеВыполняетсяИЛИ = Истина;
					
					МассивВагЕвросиб = Новый Массив;
					
					// 21.1 НЕ требуются вагоны евросиба
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	СделкаРейсы.Рейс.ТребуютсяВагоныЕС КАК РейсТребуютсяВагоныЕС
					               |ИЗ
					               |	Документ.Операция КАК Операция
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
					               |		ПО Операция.Сделка = СделкаРейсы.Ссылка
					               |ГДЕ
					               |	Операция.Ссылка = &Ссылка
					               |	И НЕ СделкаРейсы.Рейс.ТребуютсяВагоныЕС";
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					
					ТЗ = Запрос.Выполнить().Выгрузить();
					Если ТЗ.Количество() = 0 Тогда
						УсловиеВыполняетсяИЛИ = Ложь;
					Иначе
						Для Каждого Стр Из Грузы Цикл
							Если НЕ ЗначениеЗаполнено(Стр.ТС) Тогда
								Продолжить;
							КонецЕсли;
							Если МассивВагЕвросиб.Найти(Стр.ТС) = Неопределено Тогда
								МассивВагЕвросиб.Добавить(Стр.ТС);
							КонецЕсли;
						КонецЦикла;
						
						Если МассивВагЕвросиб.Количество()>0 Тогда
							МассивПодходящихВагонов.Добавить(МассивВагЕвросиб);
						КонецЕсли;
					КонецЕсли;
					
					// этот запрос выполняем только если предыдущий не выдал ничего
					Если УсловиеВыполняетсяИЛИ = Ложь Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ
						               |	ОперацияГрузы.ТС КАК ТС
						               |ПОМЕСТИТЬ ВТ
						               |ИЗ
						               |	Документ.Операция.Грузы КАК ОперацияГрузы
						               |ГДЕ
						               |	ОперацияГрузы.Ссылка = &Ссылка
						               |	И НЕ ОперацияГрузы.ТС = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
						               |;
						               |
						               |////////////////////////////////////////////////////////////////////////////////
						               |ВЫБРАТЬ
						               |	ВЫБОР
						               |			КОГДА ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
						               |				ТОГДА 1
						               |			ИНАЧЕ 0
						               |		КОНЕЦ КАК СобственностьВСписке,
						               |	ВЫБОР
						               |			КОГДА НЕ ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности В (&ПризнакСобственности)
						               |				ТОГДА 1
						               |			ИНАЧЕ 0
						               |		КОНЕЦ КАК СобственностьНеВСписке,
						               |	ПризнакСобственностиВагонаСрезПоследних.Вагон КАК Вагон
						               |ИЗ
						               |	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(&Период, ) КАК ПризнакСобственностиВагонаСрезПоследних
						               |ГДЕ
						               |	ПризнакСобственностиВагонаСрезПоследних.Вагон В
						               |			(ВЫБРАТЬ
						               |				ВТ.ТС
						               |			ИЗ
						               |				ВТ КАК ВТ)";
						Запрос.УстановитьПараметр("Ссылка",Ссылка);
						// период собственности берем в зависимости от содержимого массива моментов времени
						Если МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) ИЛИ
							МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) Тогда 
							ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаОтправленияФакт),Ссылка.ДатаОтправленияФакт,Ссылка.ДатаОтправления);
						ИначеЕсли МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) ИЛИ
							МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) Тогда 
							ПериодСобственности = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
						КонецЕсли;	
						Запрос.УстановитьПараметр("Период",ПериодСобственности);
						Запрос.УстановитьПараметр("ПризнакСобственности",МассивДанныхДляОтбора);
						ТЗ = Запрос.Выполнить().Выгрузить();
						Если ТЗ.Количество() = 0 Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						Иначе
							// для учета данного условия 
							// отбор по результату запроса должен вернуть колво строк > 0
							МассивВагСобственность = Новый Массив;
							
							Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) Тогда
								ПараметрыОтбора1 = Новый Структура;
								ПараметрыОтбора1.Вставить("СобственностьВСписке",1);
								НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
								Если НайденныеСтр.Количество() = 0 Тогда
									УсловиеВыполняется = Ложь;
									Прервать;
								Иначе
									Для Каждого Стр Из ТЗ Цикл
										Если МассивВагСобственность.Найти(Стр.Вагон) = Неопределено Тогда
											МассивВагСобственность.Добавить(Стр.Вагон);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;

							ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
								ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) Тогда 
								ПараметрыОтбора1 = Новый Структура;
								ПараметрыОтбора1.Вставить("СобственностьНеВСписке",1);
								НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора1);
								Если НайденныеСтр.Количество() = 0 Тогда
									УсловиеВыполняется = Ложь;
									Прервать;
								Иначе
									Для Каждого Стр Из ТЗ Цикл
										Если МассивВагСобственность.Найти(Стр.Вагон) = Неопределено Тогда
											МассивВагСобственность.Добавить(Стр.Вагон);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
							
							Если МассивВагСобственность.Количество()>0 Тогда
								МассивПодходящихВагонов.Добавить(МассивВагСобственность);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				// 22. Проверка, чтобы в операции пункт отправления ИЛИ пункт назначения (в зависимости от момента времени) 
				// были или нет в списке
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.ЛокацияОперации Тогда
					Если МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) Тогда 
						ЛокацияОперации = ПунктОтправления;
					ИначеЕсли МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) ИЛИ
						МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) Тогда 
						ЛокацияОперации = ПунктНазначения;
					КонецЕсли;	

					ЛокацияОперацииИерархМассив = Локации_сервер.ПолучитьМассивРодителей(ЛокацияОперации,Истина);
					
					ЛокацияНайдена = Ложь;
					Для Каждого СтрУсл Из ТаблицаЗначенийУсловий Цикл
						Если НЕ ЛокацияОперацииИерархМассив.Найти(СтрУсл.ЗначениеДляОтбора) = Неопределено Тогда
							ЛокацияНайдена = Истина;
						КонецЕсли;
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И
							ЛокацияНайдена = Ложь Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И
							ЛокацияНайдена = Истина Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
							
				// 23. Проверка, чтобы в операции исполнитель (поставщик) был из или НЕ из списка
				ИначеЕсли ВыборкаДетальныеЗаписи.ТипДополнительногоУсловия = Справочники.ТипДополнительногоУсловия.Исполнитель Тогда
					
					ИсполнительНайден = Ложь;
					Для Каждого СтрУсл Из ТаблицаЗначенийУсловий Цикл
						Если Ссылка.Поставщик = СтрУсл.ЗначениеДляОтбора Тогда
							ИсполнительНайден = Истина;
						КонецЕсли;
						Если (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.ВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.Равно) И
							ИсполнительНайден = Ложь Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						ИначеЕсли (ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеВСписке ИЛИ
							ВидСравненияДУ = Перечисления.ВидыСравненияДопУсловий.НеРавно) И
							ИсполнительНайден = Истина Тогда
							УсловиеВыполняется = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
							

					
					
					
				///////////////////////////////////////////////////////
				///////////////////////////////////////////////////////
				///////////////////////////////////////////////////////
					
				Иначе
					
					УсловиеВыполняется = Ложь;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если УсловиеВыполняется = Истина Тогда
				// собираем все задачи, которые нужно отправить другим менеджерам по данному ГУИД
				Для Каждого ЭлемМ Из МассивДругихЗадач Цикл
					СтруктураМенеджеру = Новый Структура;
					СтруктураМенеджеру.Вставить("Операция",ЭлемМ);
					СтруктураМенеджеру.Вставить("ГУИД",ВыборкаГУИД.ГУИД);
				КонецЦикла;
				
				Если НЕ СтруктураМенеджеру = Неопределено Тогда
					ОтправитьДругомуМенеджеру.Добавить(СтруктураМенеджеру);
					СтруктураМенеджеру = Неопределено;
				КонецЕсли;
				
				МассивГУИДПодходящихСтрок.Добавить(ВыборкаГУИД.ГУИД);
				
				////// ????????????????????????????
				// если выставлен флаг "УчитыватьДляВсейОперации" и для одной из операций все проверки пройдены успешно 
				// ("УсловиеВыполняется = Истина"), то цикл прохода по всем операциям ТСх надо прервать.
				Если УчитыватьДляВсейОперации Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	

	
	ВнесениеДанныхВРСОперативныеЗадачи(МассивГУИДПодходящихСтрок,ОтправитьДругомуМенеджеру,МассивМоментовВремени,ИзначальнаяСсылкаНаОперацию,Ссылка,ДатаРегистрацииЗаявки,ИмяТбл,ДокументОснование,ДатаОтсчетаИзДругойОперации,ДниРасчета,МассивПодходящихВагонов,МассивПодходящихКТК,ТаблицаВыполненныхЗадач);
	
	
КонецПроцедуры

Процедура ВнесениеДанныхВРСОперативныеЗадачи(МассивГУИДПодходящихСтрок,ОтправитьДругомуМенеджеру,МассивМоментовВремени,Ссылка,ОперацияПричина,ДатаРегистрацииЗаявки,ИмяТбл,ДокументОснование,ДатаОтсчетаИзДругойОперации,ДниРасчета,МассивПодходящихВагонов,МассивПодходящихКТК,ТаблицаВыполненныхЗадач)
	
	Грузы = Ссылка.Грузы;
	ПунктОтправления = Ссылка.ПунктОтправления;
	ПунктНазначения = Ссылка.ПунктНазначения;

	
	Для Каждого Элем Из МассивГУИДПодходящихСтрок Цикл
		// если данное сообщение должно быть отправлено по предыдущей или следующей операции,
		// получить эту операцию из массива структур
		
		ДругаяОперация = Неопределено;
		
		Для Каждого ЭМ Из ОтправитьДругомуМенеджеру Цикл
			Если ЭМ.ГУИД = Элем Тогда
				ДругаяОперация = ЭМ.Операция;
			Иначе
				ДругаяОперация = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	
		Если НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПриРегистрацииКлиентскойЗаявки) = Неопределено Тогда
			ДатаОтсчета = ДатаРегистрацииЗаявки;
		ИначеЕсли НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоНачалаОперации) = Неопределено ИЛИ
			НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеНачалаОперации) = Неопределено Тогда
			ДатаОтсчета = ?(ЗначениеЗаполнено(Ссылка.ДатаОтправленияФакт),Ссылка.ДатаОтправленияФакт,Ссылка.ДатаОтправления);
		ИначеЕсли НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) = Неопределено ИЛИ
			НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) = Неопределено Тогда
			ДатаОтсчета = ?(ЗначениеЗаполнено(Ссылка.ДатаНазначенияФакт),Ссылка.ДатаНазначенияФакт,Ссылка.ДатаНазначения);
		КонецЕсли;
		
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ГУИД",Элем);
		НайденныеДокументы = Ссылка.Услуга[ИмяТбл].НайтиСтроки(ПараметрыОтбора);
		
		ПорядокТребованияДокументов = НайденныеДокументы[0].ПорядокТребованияДокументов;
		НазначениеМаршрута = НайденныеДокументы[0].НазначениеМаршрута;
		Если ИмяТбл = "ПостановкаЗадач" Тогда
			ОбластьПрименения = Перечисления.ОбластьПрименения.Задачи;
		Иначе
			ОбластьПрименения = Перечисления.ОбластьПрименения.Документы;
		КонецЕсли;
		
		// поиск ответственных по региону в зависимости от момента времени, по которому устанавливается требование документа
		Если ОбластьПрименения = Перечисления.ОбластьПрименения.Задачи Тогда
			Регион = Справочники.Локации.ВСЕ;
		Иначе
			Если НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ПослеОкончанияОперации) = Неопределено ИЛИ
				НЕ МассивМоментовВремени.Найти(Перечисления.ТипМоментаВремени.ДоОкончанияОперации) = Неопределено Тогда
				Регион = Локации_сервер.ПолучитьМассивРодителей(ПунктНазначения,Истина);
			Иначе
				Регион = Локации_сервер.ПолучитьМассивРодителей(ПунктОтправления,Истина);
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОтветственныеПоТребуемымДокументам.Исполнитель КАК Исполнитель,
		               |	ОтветственныеПоТребуемымДокументам.Наблюдатель КАК Наблюдатель
		               |ИЗ
		               |	РегистрСведений.ОтветственныеПоТребуемымДокументам КАК ОтветственныеПоТребуемымДокументам
		               |ГДЕ
		               |	ОтветственныеПоТребуемымДокументам.ВидОперации = &ВидОперации
		               |	И ОтветственныеПоТребуемымДокументам.ЗадачаДляОтдела = &ЗадачаДляОтдела
		               |	И ОтветственныеПоТребуемымДокументам.ОбластьПрименения = &ОбластьПрименения
		               |	И ОтветственныеПоТребуемымДокументам.Регион В ИЕРАРХИИ (&Регион)";
		Запрос.УстановитьПараметр("ВидОперации",Ссылка.Услуга);
		Запрос.УстановитьПараметр("Регион",Регион);
		Запрос.УстановитьПараметр("ОбластьПрименения",ОбластьПрименения);
		Запрос.УстановитьПараметр("ЗадачаДляОтдела",НазначениеМаршрута);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		// цикл по всем участникам, которым нужно создать задачи
		Для Каждого Стр Из ТЗ Цикл
			// в зависимости от значения "ПорядокТребованияДокументов" делаем 
			// а) 1 цикл для операции
			// б) циклы по таблице Грузы для вагонов
			// в) циклы по таблице Грузы для контейнеров
			
			КолвоИтераций = ПолучитьЧислоЦиклов(Грузы,ПорядокТребованияДокументов,МассивПодходящихВагонов,МассивПодходящихКТК);
			
			Для Каждого ИТ Из КолвоИтераций Цикл
				
				МЗ = РегистрыСведений.ОперативныеЗадачи.СоздатьМенеджерЗаписи();
				МЗ.Документ = ?(ДругаяОперация = Неопределено,Ссылка,ДругаяОперация);
				МЗ.Задача = НайденныеДокументы[0].НаименованиеЗадачиСпециалисту;
				ЗаполнитьЗначенияСвойств(МЗ,Стр);
				
				МЗ.ДокументОснование = ДокументОснование;
				МЗ.ОперацияПричина = ОперацияПричина;
				МЗ.ОбластьПрименения = ОбластьПрименения;
				// в зависимости от того, какие данные содержатся в массиве КолвоИтераций, заполняем
				// измерения Вагон или Контейнер. или, если там число, не заполняем ничего
				Если ТипЗнч(ИТ) = Тип("СправочникСсылка.ТС") Тогда
					МЗ.Вагон = ИТ;
				ИначеЕсли ТипЗнч(ИТ) = Тип("СправочникСсылка.ТЕ") Тогда
					МЗ.Контейнер = ИТ;
				КонецЕсли;
				
				Если ИмяТбл = "ТребуемыеДокументы" Тогда
					МЗ.ВидДокумента = НайденныеДокументы[0].ВидДокумента;
				Иначе
					МЗ.ТипОбъектаСистемы = НайденныеДокументы[0].ТипОбъектаСистемы;
				КонецЕсли;
				
				ДатаОтсчета = ?(ДатаОтсчетаИзДругойОперации = Неопределено,ДатаОтсчета,ДатаОтсчетаИзДругойОперации);
				
				ЖелтыйПорог = НайденныеДокументы[0].ЖелтыйПорог;
				КрасныйПорог = НайденныеДокументы[0].КрасныйПорог;
								
				ЖелтыйПорог = НайденныеДокументы[0].ЖелтыйПорог;
				КрасныйПорог = НайденныеДокументы[0].КрасныйПорог;
				Если ДниРасчета = Перечисления.ЕдиницыИзмеренияВДнях.РабочиеДни Тогда
					Если НайденныеДокументы[0].МоментВремени = Перечисления.ТипМоментаВремени.ДоНачалаОперации ИЛИ
						НайденныеДокументы[0].МоментВремени = Перечисления.ТипМоментаВремени.ДоОкончанияОперации  Тогда
						СтруктураКолваДней = РасчетКоличестваДнейПоПпроизводственномуКалендарю(ДатаОтсчета,ЖелтыйПорог,КрасныйПорог,-1,Ссылка);
					Иначе
						СтруктураКолваДней = РасчетКоличестваДнейПоПпроизводственномуКалендарю(ДатаОтсчета,ЖелтыйПорог,КрасныйПорог,1,Ссылка);
					КонецЕсли;
					ЖелтыйПорог = СтруктураКолваДней.ЖелтыйПорог;
					КрасныйПорог = СтруктураКолваДней.КрасныйПорог;
				КонецЕсли;
					
				Если НайденныеДокументы[0].МоментВремени = Перечисления.ТипМоментаВремени.ДоНачалаОперации ИЛИ
					НайденныеДокументы[0].МоментВремени = Перечисления.ТипМоментаВремени.ДоОкончанияОперации  Тогда
					МЗ.НачалоЖелтыйПорог = ДатаОтсчета - ЖелтыйПорог*3600*24;
					МЗ.ОкончаниеЖелтыйПорог = ДатаОтсчета - КрасныйПорог *3600*24;
					МЗ.НачалоКрасныйПорог = ДатаОтсчета - КрасныйПорог *3600*24;
					МЗ.ОкончаниеКрасныйПорог = ДатаОтсчета;
				Иначе
					МЗ.НачалоЖелтыйПорог = ДатаОтсчета;
					МЗ.ОкончаниеЖелтыйПорог = ДатаОтсчета + ЖелтыйПорог *3600*24;
					МЗ.НачалоКрасныйПорог = ДатаОтсчета + ЖелтыйПорог *3600*24;
					МЗ.ОкончаниеКрасныйПорог = ДатаОтсчета + КрасныйПорог *3600*24;
				КонецЕсли;
				
				МЗ2 = РегистрыСведений.ОперативныеЗадачи.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ2, МЗ);
				
				МЗ.Прочитать();
				
				
				Если НЕ МЗ.Выбран() Тогда
					ЗаполнитьЗначенияСвойств(МЗ, МЗ2);
				КонецЕсли;
				
				// если в таблице ТаблицаВыполненныхЗадач есть данные, то заполнить ими статус и дату
				Если НЕ ТаблицаВыполненныхЗадач = Неопределено Тогда
					ПараметрыОтбора123 = Новый Структура;
					ПараметрыОтбора123.Вставить("ВидДокумента",НайденныеДокументы[0].ВидДокумента);
					ПараметрыОтбора123.Вставить("Учтено",ЛОЖЬ);
					НайденныеСтроки123 = ТаблицаВыполненныхЗадач.НайтиСтроки(ПараметрыОтбора123);
					Если НайденныеСтроки123.Количество()>0 Тогда
						МЗ.Статус = Перечисления.СтатусыЭтапов.Выполнен;
						МЗ.ДатаВыполнения = НайденныеСтроки123[0].ДатаВыполнения;
						НайденныеСтроки123[0].Учтено = Истина;
					Иначе
						МЗ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
					КонецЕсли;
				ИначеЕсли НЕ ЗначениеЗаполнено(МЗ.Статус) Тогда
					МЗ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;					
				КонецЕсли;
					
				МЗ.Записать();
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

ФУнкция РасчетКоличестваДнейПоПпроизводственномуКалендарю(ДатаНачалаРасчета,ЖелтыйПорог,КрасныйПорог,ИндексРасчета,Ссылка)
	
	СтруктураКолваДней = Новый Структура;
	СтруктураКолваДней.Вставить("ЖелтыйПорог",ЖелтыйПорог);
	СтруктураКолваДней.Вставить("КрасныйПорог",КрасныйПорог);
	
	ПрКалендарь = ПостроительТСх_сервер.ПодобратьПроизводственныйКалендарь(Ссылка.Поставщик, Ссылка.Услуга);
	
	Если ИндексРасчета > 0 Тогда
		ТекстПервогоЗапроса = "ВЫБРАТЬ
				               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
				               |	ВЫБОР
				               |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
				               |			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
				               |			ТОГДА 1
				               |		ИНАЧЕ 0
				               |	КОНЕЦ КАК РабочийДень,
				               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
				               |ПОМЕСТИТЬ Вт1
				               |ИЗ
				               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
				               |ГДЕ
				               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
				               |	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаНач";
	Иначе
		ТекстПервогоЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 365
		                      |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		                      |	ВЫБОР
		                      |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		                      |				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
		                      |			ТОГДА 1
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК РабочийДень,
		                      |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
		                      |ПОМЕСТИТЬ Вт1
				              |ИЗ
		                      |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		                      |ГДЕ
		                      |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		                      |	И ДанныеПроизводственногоКалендаря.Дата <= &ДатаНач
		                      |	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаГодНазад
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ПроизводственныйКалендарь,
		                      |	Дата УБЫВ";
	КонецЕсли;
	
	КолвоПервыйЖелтый = "ПЕРВЫЕ " + ЖелтыйПорог;
	КолвоПервыйКрасный = "ПЕРВЫЕ " + КрасныйПорог;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "" + ТекстПервогоЗапроса + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ " + КолвоПервыйЖелтый + "
	               |	Вт1.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	Вт1.РабочийДень КАК РабочийДень,
	               |	Вт1.Дата КАК Дата
	               |ПОМЕСТИТЬ ЖелтыйПорог
	               |ИЗ
	               |	Вт1 КАК Вт1
	               |ГДЕ
	               |	Вт1.РабочийДень <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ " + КолвоПервыйКрасный + "
	               |	Вт1.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	Вт1.РабочийДень КАК РабочийДень,
	               |	Вт1.Дата КАК Дата
	               |ПОМЕСТИТЬ КрасныйПорог
	               |ИЗ
	               |	Вт1 КАК Вт1
	               |ГДЕ
	               |	Вт1.РабочийДень <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЖелтыйПорог.Дата КАК Дата,
	               |	""Желтый"" КАК Порог
	               |ИЗ
	               |	ЖелтыйПорог КАК ЖелтыйПорог
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КрасныйПорог.Дата,
	               |	""Красный""
	               |ИЗ
	               |	КрасныйПорог КАК КрасныйПорог
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порог,
	               |	Дата";
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь",ПрКалендарь);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНачалаРасчета);
	Если ИндексРасчета < 0 Тогда
		Запрос.УстановитьПараметр("ДатаГодНазад",ДатаНачалаРасчета-3600*24*365);
	КонецЕсли;
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Порог","Желтый");
	НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтр.Количество()>0 Тогда
		НачальнаяДатаЖелтая = НайденныеСтр[0].Дата;
		// если прямой расчет (т.е. считаем ПОСЛЕ даты начала или окончания перевозки), 
		// то конечная дата берется из запроса. если расчет обратный (т.е. считаем ДО начала или окончания операции),
		// то берем дату из входных параметров функции "ДатаНачалаРасчета"
		КонечнаяДатаЖелтая = ?(ИндексРасчета = 1,НайденныеСтр[НайденныеСтр.Количество()-1].Дата,ДатаНачалаРасчета);
		ДельтаВРабочихДняхЖелтый =(НачалоДня(КонечнаяДатаЖелтая)-НачалоДня(НачальнаяДатаЖелтая))/3600/24;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Порог","Красный");
	НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтр.Количество()>0 Тогда
		НачальнаяДатаКрасная = НайденныеСтр[0].Дата;
		// если прямой расчет (т.е. считаем ПОСЛЕ даты начала или окончания перевозки), 
		// то конечная дата берется из запроса. если расчет обратный (т.е. считаем ДО начала или окончания операции),
		// то берем дату из входных параметров функции "ДатаНачалаРасчета"
		КонечнаяДатаКрасная = ?(ИндексРасчета = 1,НайденныеСтр[НайденныеСтр.Количество()-1].Дата,ДатаНачалаРасчета);
		ДельтаВРабочихДняхКрасный = (НачалоДня(КонечнаяДатаКрасная)-НачалоДня(НачальнаяДатаКрасная))/3600/24;
	КонецЕсли;
	
	СтруктураКолваДней.Вставить("ЖелтыйПорог",ДельтаВРабочихДняхЖелтый);
	СтруктураКолваДней.Вставить("КрасныйПорог",ДельтаВРабочихДняхКрасный);
	
	
	Возврат СтруктураКолваДней;
	
КонецФункции

Функция ПолучитьКалькуляцииПоОперации(Ссылка)
	
	МассивКалькуляций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО (ОперацияГрузы.ТЕ = СделкаСвязьУчетныхЕдиниц.Контейнер
	               |					И НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |				ИЛИ ОперацияГрузы.ТС = СделкаСвязьУчетныхЕдиниц.Вагон
	               |					И НЕ ОперацияГрузы.ТС = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))
	               |			И ОперацияГрузы.Ссылка.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	МассивКалькуляций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Калькуляция");
	
	Возврат МассивКалькуляций;
	
КонецФункции

Функция ПолучитьКлиентовПоОперации(Ссылка)
	
	МассивКклиентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО (ОперацияГрузы.ТЕ = СделкаСвязьУчетныхЕдиниц.Контейнер
	               |					И НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |				ИЛИ ОперацияГрузы.ТС = СделкаСвязьУчетныхЕдиниц.Вагон
	               |					И НЕ ОперацияГрузы.ТС = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))
	               |			И ОперацияГрузы.Ссылка.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	МассивКклиентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
	Возврат МассивКклиентов;
	
КонецФункции

Функция ПолучитьМассивРодителей(ССылка,ИщемРодителей,КолвоРодителей) Экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ССылка) Тогда 
		Возврат Результат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка,
	               |	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.Операция = &Операция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка,
	               |	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД,
	               |	ТехнологическаяСхемаТЧ.Родитель1 КАК Родитель1,
	               |	ТехнологическаяСхемаТЧ.Родитель2 КАК Родитель2,
	               |	ТехнологическаяСхемаТЧ.Родитель3 КАК Родитель3,
	               |	ТехнологическаяСхемаТЧ.Родитель4 КАК Родитель4,
	               |	ТехнологическаяСхемаТЧ.Родитель5 КАК Родитель5,
	               |	ВЫБОР
	               |		КОГДА ТехнологическаяСхемаТЧ.ГУИД = ВТ.ГУИД
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ТекОперация,
	               |	ВЫБОР
	               |		КОГДА ТехнологическаяСхемаТЧ.ГУИД = ВТ.ГУИД
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НадоПроверить,
	               |	ЛОЖЬ КАК Проверено
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка";
	
	Запрос.УстановитьПараметр("Операция",Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПараметрыОтбора = Новый СТруктура;
	ПараметрыОтбора.Вставить("ТекОперация",Истина);
	НайденнаяОпер = ТЗ.НайтиСтроки(ПараметрыОтбора);
		
	//СтруктураСтроки = Общегоназначения.СтрокаТаблицыЗначенийВСтруктуру(НайденнаяОпер[0]);
	
	Если ИщемРодителей и НайденнаяОпер.Количество() > 0 Тогда
		РекурсивныйПоискРодителей(НайденнаяОпер[0],Результат,ТЗ,КолвоРодителей);
	ИначеЕсли НайденнаяОпер.Количество() > 0 Тогда
		РекурсивныйПоискПодчиненных(НайденнаяОпер[0],Результат,ТЗ,КолвоРодителей);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура РекурсивныйПоискРодителей(НайденнаяОпер,Результат,ТблСхемы,КолвоРекурсий)
	
	Для Сч = 1 По 5 Цикл
		
		Попытка
			ТекРодитель = НайденнаяОпер[Строка("Родитель") + Строка(Сч)];
			Если ЗначениеЗаполнено(ТекРодитель) Тогда
				Результат.Добавить(ТекРодитель);
				// устанавливаем в таблице флаг, что данный ГУИД надо проверить. но только в том случае, если его еще не проверяли
				ПроверяемыйГУИД = НайденнаяОпер.ГУИД;
				ПараметрыОтбора = Новый СТруктура;
				ПараметрыОтбора.Вставить("ГУИД",ПроверяемыйГУИД);
				ПараметрыОтбора.Вставить("Проверено",Ложь);
				ТекСтрока = ТблСхемы.НайтиСтроки(ПараметрыОтбора);
				ТекСтрока[0].НадоПроверить = Истина;
			КонецЕсли;
		Исключение
			НетЭл = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	// после того, как текущую строку проверили, установить ей флаг "проверено" и снять флаг "нужно проверить"
	ПроверяемыйГУИД = НайденнаяОпер.ГУИД;
	ПараметрыОтбора = Новый СТруктура;
	ПараметрыОтбора.Вставить("ГУИД",ПроверяемыйГУИД);
	ТекСтрока = ТблСхемы.НайтиСтроки(ПараметрыОтбора);
	ТекСтрока[0].НадоПроверить = Ложь;
	ТекСтрока[0].Проверено = Истина;
	
	// выходим из функции в том случае, если в сканируемой таблице нет больше ни одной строки с флагом "надо проверить"
	ПараметрыОТбора = Новый СТруктура;
	ПараметрыОТбора.Вставить("НадоПроверить",Истина);
	НайденныеСтрокиПров = ТблСхемы.НайтиСтроки(ПараметрыОТбора);
	Если НайденныеСтрокиПров.Количество()>0 И КолвоРекурсий = Неопределено Тогда
		РекурсивныйПоискРодителей(НайденныеСтрокиПров[0],Результат,ТблСхемы,КолвоРекурсий);
	Иначе
		ВсеПроверили = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура РекурсивныйПоискПодчиненных(НайденнаяОпер,Результат,ТблСхемы,КолвоРекурсий)
	
	ПроверяемыйГУИД = НайденнаяОпер.ГУИД;
	
	Для Сч = 1 По 5 Цикл
		
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить(Строка("Родитель") + Строка(Сч),ПроверяемыйГУИД);
		ПараметрыОтбора.Вставить("Проверено",Ложь);
		ТекСтрока = ТблСхемы.НайтиСтроки(ПараметрыОтбора);
		Если ТекСтрока.Количество()>0 Тогда
			Результат.Добавить(ТекСтрока[0].ГУИД);
			// устанавливаем в таблице флаг, что данный ГУИД надо проверить. но только в том случае, если его еще не проверяли
			ТекСтрока[0].НадоПроверить = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// после проверки этой строки (что она есть в родителях у других строк),
	// установить ей флаг "проверено" и снять флаг "надо проверить"
	ПараметрыОтбора = Новый СТруктура;
	ПараметрыОтбора.Вставить("ГУИД",ПроверяемыйГУИД);
	ТекСтрока = ТблСхемы.НайтиСтроки(ПараметрыОтбора);
	ТекСтрока[0].Проверено = Истина;
	ТекСтрока[0].НадоПроверить = Ложь;
		
	// выходим из функции в том случае, если в сканируемой таблице нет больше ни одной строки с флагом "надо проверить"
	ПараметрыОТбора = Новый СТруктура;
	ПараметрыОТбора.Вставить("НадоПроверить",Истина);
	НайденныеСтрокиПров = ТблСхемы.НайтиСтроки(ПараметрыОТбора);
	Если НайденныеСтрокиПров.Количество()>0 И КолвоРекурсий = Неопределено Тогда
		РекурсивныйПоискПодчиненных(НайденныеСтрокиПров[0],Результат,ТблСхемы,КолвоРекурсий);
	Иначе
		ВсеПроверили = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЧислоЦиклов(Грузы,ПорядокТребованияДокументов,МассивПодходящихВагонов,МассивПодходящихКТК)
	
	МассивОтвета = Новый Массив;
	
	Если ПорядокТребованияДокументов = Перечисления.ПорядокТребованияДокументов.НаВсюОперацию Тогда
		МассивОтвета.Добавить(1);
	ИначеЕсли ПорядокТребованияДокументов = Перечисления.ПорядокТребованияДокументов.НаКаждыйВагон Тогда
		// сначала проверяем, есть ли данные в массиве МассивПодходящихВагонов.
		// если массив заполнен, то нужно разобрать его (это массив массивов) для поиска вагонов, 
		// которые есть во всех массивах МассивПодходящихВагонов.
		Если МассивПодходящихВагонов.Количество()>0 Тогда
			// если в массиве всего 1 массив, то разбирать ничего не надо, просто достаем этот массив
			МассивОтвета = ?(МассивПодходящихВагонов.Количество()>1,РазобратьМассивМассивов(МассивПодходящихВагонов),МассивПодходящихВагонов[0]);
		Иначе
			Для Каждого Стр Из Грузы Цикл
				Если ЗначениеЗаполнено(Стр.ТС) Тогда
					// добавляем только уникальные записи
					Если МассивОтвета.Найти(Стр.ТС) = Неопределено Тогда
						МассивОтвета.Добавить(Стр.ТС);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ПорядокТребованияДокументов = Перечисления.ПорядокТребованияДокументов.НаКаждыйКонтейнер Тогда
		// сначала проверяем, есть ли данные в массиве МассивПодходящихКТК.
		// если массив заполнен, то нужно разобрать его (это массив массивов) для поиска КТК, 
		// которые есть во всех массивах МассивПодходящихКТК.
		Если МассивПодходящихКТК.Количество()>0 Тогда
			// если в массиве всего 1 массив, то разбирать ничего не надо, просто достаем этот массив
			МассивОтвета = ?(МассивПодходящихКТК.Количество()>1,РазобратьМассивМассивов(МассивПодходящихКТК),МассивПодходящихКТК[0]);
		Иначе	
			Для Каждого Стр Из Грузы Цикл
				Если ЗначениеЗаполнено(Стр.ТЕ) Тогда
					// добавляем только уникальные записи
					Если МассивОтвета.Найти(Стр.ТЕ) = Неопределено Тогда
						МассивОтвета.Добавить(Стр.ТЕ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивОтвета;
	
КонецФункции

Функция РазобратьМассивМассивов(МассивМассивов)
	
	МассивПересечений = МассивМассивов[0];
	
	Для ШагЦикла = 1 По МассивМассивов.Количество()-1 Цикл
		
		ПроверяемыйМассив = МассивМассивов[ШагЦикла];
		
		ВременныйМассивСовпавших = Новый Массив;
		
		Для Каждого Элем Из МассивПересечений Цикл
			Если НЕ ПроверяемыйМассив.Найти(Элем) = Неопределено Тогда
				ВременныйМассивСовпавших.Добавить(Элем);
			КонецЕсли;
		КонецЦикла;
		
		МассивПересечений = ВременныйМассивСовпавших;
		
	КонецЦикла;
	
	Возврат МассивПересечений;
	
КонецФункции

Процедура НапомнитьПользователямОЗадачах(Документ) Экспорт
	
	ТаблицаСостояний = Новый Массив;
	Попытка
		ТаблицаСостояний = Документ.Состояния;
	Исключение
		Сообщить("Напоминания для этого документа не поддерживаются, обратитесь в ИТ!");
		Возврат;
	КонецПопытки;
	
	СписокПолучателей = Новый Массив;
	Тема = "!!! Срочное напоминание о документе: " + Документ;
	ТекстПисьма = "Поступила просьба обратить внимание и отработать данный документ в приоритетном режиме:<br><br>";

	ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";
	ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Документ)+""">"+ПолучитьНавигационнуюСсылку(Документ)+"</a>";
	
	ТекстПисьма = ТекстПисьма + "<b>Документ:</b> " + Документ + "<br><br><b>Список задач:</b><br>"; 
	ТекстПисьма = ТекстПисьма + "<table border=1><tr><td>Задача</td><td>Открыть из письма</td><td>Исполнитель</td><td>Наблюдатель</td></tr>";
	
	Для каждого Стр из ТаблицаСостояний Цикл
		
		Если Стр.Статус <> Перечисления.СтатусыЭтапов.НаВыполнение И Стр.Статус <> Перечисления.СтатусыЭтапов.ВРаботе Тогда Продолжить; КонецЕсли;
		
		Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") И СписокПолучателей.Найти(Стр.Исполнитель) = неопределено Тогда
			СписокПолучателей.Добавить(Стр.Исполнитель);
		ИначеЕсли ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			СписокПользователей = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель, ТекущаяДата(), Истина);
			Для каждого Плз Из СписокПользователей Цикл
				Если СписокПолучателей.Найти(Плз) = неопределено Тогда  СписокПолучателей.Добавить(Плз); КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Наблюдатель) Тогда
			
			Если ТипЗнч(Стр.Наблюдатель) = Тип("СправочникСсылка.Пользователи") И СписокПолучателей.Найти(Стр.Наблюдатель) = неопределено Тогда
				СписокПолучателей.Добавить(Стр.Наблюдатель);
			ИначеЕсли ТипЗнч(Стр.Наблюдатель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				СписокПользователей = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Наблюдатель, ТекущаяДата(), Истина);
				Для каждого Плз Из СписокПользователей Цикл
					Если СписокПолучателей.Найти(Плз) = неопределено Тогда  СписокПолучателей.Добавить(Плз); КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстПисьма = ТекстПисьма + "<tr><td>"+Стр.Состояние+"</td><td>"+ТекстНС+"</td><td>"+Стр.Исполнитель+"</td><td>"+Стр.Наблюдатель+"</td></tr>";
		
	КонецЦикла;
	
	
	ТекстПисьма = ТекстПисьма + "</table>";
	ПолучателиСтруктурой = Новый Массив;
	
	Для каждого Стр из СписокПолучателей Цикл
		ЕМЕЙЛ = Пользователи_sd_сервер.ПолучитьEMAILПользователя(Стр);
		Если ЗначениеЗаполнено(ЕМЕЙЛ) Тогда
			ПолучателиСтруктурой.Добавить(Новый Структура("Представление, Адрес", Строка(Стр), ЕМЕЙЛ));
		КонецЕсли;
	КонецЦикла;
	
	ТекПользовательСтруктура = Новый Массив;
	ТекПользовательСсылка = Пользователи.ТекущийПользователь();
	ЕМЕЙЛ = Пользователи_sd_сервер.ПолучитьEMAILПользователя(ТекПользовательСсылка);
		Если ЗначениеЗаполнено(ЕМЕЙЛ) Тогда
			ТекПользовательСтруктура.Добавить(Новый Структура("Представление, Адрес", Строка(ТекПользовательСсылка), ЕМЕЙЛ));
		КонецЕсли;	
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	Если не УчетнаяЗаписьПоУмолчанию Тогда возврат; КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПараметрыОтправкиПисьма = новый Структура;
	ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
	ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
	ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиСтруктурой);
	ПараметрыОтправкиПисьма.Вставить("Копии", ТекПользовательСтруктура);
	ПараметрыОтправкиПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Наивысшая);
	
	Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	
	Сообщить("Сообщение отправлено: " + Результат);
	
КонецПроцедуры
