
//ДИТ, Беляев СЮ, Ticket#0349483, 19-04-2024, начало (закомментировал)
//&НаСервереБезКонтекста
//Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
//	
//	Обработки.ДД_подключаемыйМодуль.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
//	
//КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0349483, 19-04-2024, конец

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
