
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ДокументОснование) тогда
	//	
	//	ЗаполнитьПоПоступлениюНаКлиентеЗавершение(Объект.ДокументОснование, Новый Структура("СпособЗаполнения", "ЗаполнитьПоПоступлению"));
	//	
	//КонецЕсли;
	
	
	УстановитьВидимостьСтраниц();
	УстановитьВидимостьДоступностьЭлементов();
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.ВвестиСчетФактуру.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	КонецЕсли;
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		//Евросиб СубботинВ #120291 24.09.2025 Начало
		Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
		//Евросиб СубботинВ #120291 24.09.2025 Конец 	
	КонецЦикла;
	
	РассчитатьСуммыВсегоПоДокументу();
	//УстановитьВидимостьКолонокНДС();
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Элементы.ВидОперации.ТолькоПросмотр = Истина;
	КонецЕсли;
	ОтчПериод = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВсегоПоДокументу()
	ИтогиНДСПоТоварам = Объект.Товары.Итог("СуммаНДС");
	ИтогиВсего = Объект.Товары.Итог("Сумма")+ ?(Объект.СуммаВключаетНДС,0,ИтогиНДСПоТоварам);
	Элементы.ВалютаДокумента.Заголовок = Объект.ВалютаДокумента;
	
	Для каждого Стр из Объект.Поставщики Цикл
		КлючСтроки = Стр.КлючСтроки;
		СуммаНДСПоСтрокеПартии = 0;
		СуммаИтогоПоСтрокеПартии = 0;
		Для каждого СтрТ из Объект.Товары Цикл
			Если СтрТ.КлючСтроки = КлючСтроки Тогда
				СуммаНДСПоСтрокеПартии = СуммаНДСПоСтрокеПартии+СтрТ.СуммаНДС;
				СуммаИтогоПоСтрокеПартии = СуммаИтогоПоСтрокеПартии+СтрТ.Сумма+?(Объект.СуммаВключаетНДС,0,СтрТ.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		Стр.Всего = СуммаИтогоПоСтрокеПартии;
		Стр.НДС = СуммаНДСПоСтрокеПартии;
	КонецЦикла;
	//ИтогиНДСВознаграждение = Объект.Товары.Итог("СуммаНДСВознаграждения");
	//ИтогиНДСВознаграждение = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ИтогиВознаграждение, БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения), Объект.УчитыватьНДС, Объект.СуммаВознагражденияВключаетНДС);
	//Евросиб Каблов 09.06.2022 ( Итоги по Сумме вознаграждения и Сумме НДС вознаграждения не соответствовали Итогам по таблице Товаров.
	//ИтогиНДСВознаграждение = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(Объект.Товары.Итог("СуммаВознаграждения"), БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения), Объект.УчитыватьНДС, Объект.СуммаВознагражденияВключаетНДС);
	//ИтогиВознаграждение = Объект.Товары.Итог("СуммаВознаграждения") + ИтогиНДСВознаграждение;
	//Евросиб СубботинВ #120291 24.09.2025 Начало 
	//ИтогиНДСВознаграждение = Объект.Товары.Итог("СуммаНДСВознаграждения");
	//Если Объект.СуммаВознагражденияВключаетНДС Тогда
	//	ИтогиВознаграждение = Объект.Товары.Итог("СуммаВознаграждения");
	//Иначе
	//	ИтогиВознаграждение = Объект.Товары.Итог("СуммаВознаграждения") + ИтогиНДСВознаграждение;
	//КонецЕсли;
	//БазаРасчета = Объект.Товары.Итог("СуммаВознаграждения");
	//
	////расчет ндс в рамках задачи реализован так, что ндс всегда "сверху" базы расчета, и  включен он или нет, влияет только на саму сумму вознаграждения
	//ИтогиНДСВознаграждение = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(БазаРасчета,
	//БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения), Истина, Ложь); 
	//ИтогиВознаграждение =  БазаРасчета +  ?(Объект.СуммаВознагражденияВключаетНДС, ИтогиНДСВознаграждение, 0);

	ИтогиНДСВознаграждение = Объект.Товары.Итог("СуммаНДСВознаграждения");
	ИтогиВознаграждение = Объект.Товары.Итог("СуммаВознаграждения") + ?(Объект.СуммаВознагражденияВключаетНДС, ИтогиНДСВознаграждение, 0);
	//Евросиб СубботинВ #120291 24.09.2025 Конец
	
	//Евросиб Каблов 09.06.2022 )
	//Объект.СуммаДокумента = ИтогиВсего;
	//Объект.СуммаВознаграждения = ИтогиВознаграждение;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраниц()
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Если ЭтоЗакупка() Тогда
			Элементы.СтраницаТоварыПродажа.Видимость = Ложь;
			Элементы.СтраницаТоварыЗакупка.Видимость = Истина;
			Элементы.ГруппаПодвалТоварыУслугиОзакупках.Видимость = Истина;
			Элементы.ДенежныеСредства.Видимость = Ложь;
		Иначе
			Элементы.СтраницаТоварыПродажа.Видимость = Истина;
			Элементы.СтраницаТоварыЗакупка.Видимость = Ложь;
			Элементы.ГруппаПодвалТоварыУслугиОзакупках.Видимость = Ложь;
			Элементы.ДенежныеСредства.Видимость = Истина;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	СпособНеРасчитывать = (Объект.СпособРасчетаКомиссионногоВознаграждения = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается"));
	СпособУказыватьСуммы = (Объект.СпособРасчетаКомиссионногоВознаграждения = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.УказываютсяСуммы"));
	
	Элементы.ГруппаВознаграждениеПравая.Видимость = НЕ СпособНеРасчитывать;
	Элементы.СчетФактураПросмотр.Видимость = НЕ СпособНеРасчитывать;
	Элементы.ИтогиПоВознаграждению.Видимость = НЕ СпособНеРасчитывать;
	Элементы.ТоварыСуммаВознаграждения.Видимость = НЕ СпособНеРасчитывать;
	Элементы.ТоварыСуммаНДСВознаграждения.Видимость = НЕ СпособНеРасчитывать;
	Элементы.ТоварыВсегоВознаграждения.Видимость = НЕ СпособНеРасчитывать;
	Элементы.ГруппаВознаграждениеПравая.Доступность = НЕ СпособНеРасчитывать;
	Элементы.СчетФактураПросмотр.Доступность = НЕ СпособНеРасчитывать;
	Элементы.ИтогиПоВознаграждению.Доступность = НЕ СпособНеРасчитывать;
	Элементы.ТоварыСуммаВознаграждения.Доступность = НЕ СпособНеРасчитывать;
	Элементы.ТоварыСуммаНДСВознаграждения.Доступность = НЕ СпособНеРасчитывать;
	Элементы.ТоварыВсегоВознаграждения.Доступность = НЕ СпособНеРасчитывать;
	
	Элементы.ПроцентКомиссионногоВознаграждения.Видимость = Не СпособУказыватьСуммы;
	
КонецПроцедуры

&НаСервере
Функция ЭтоЗакупка()
	Если Объект.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура УчитыватьНДСНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчитыватьНДС", ОбъектА.УчитыватьНДС);
	ПараметрыФормы.Вставить("СуммаВключаетНДС", ОбъектА.СуммаВключаетНДС);
	ОткрытьФорму("ОбщаяФорма.УчетНДСВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаКомиссионногоВознагражденияПриИзменении(Элемент)
	
	СпособНеРасчитывать = (Объект.СпособРасчетаКомиссионногоВознаграждения = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается"));
	

	Если НЕ СпособНеРасчитывать Тогда
		Если Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
			Если Объект.УчитыватьНДС Тогда
				Если ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения) Тогда
					РасчитатьВознаграждение();
				КонецЕсли;
			Иначе
				РасчитатьВознаграждение();
			КонецЕсли;
		КонецЕСли;	
				
	КонецЕсли;
	Если НЕ СпособНеРасчитывать Тогда
		РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
		Если РеквизитыСФ <> Неопределено Тогда
			Если РеквизитыСф.ПОметкаУдаления = Истина Тогда
				Элементы.ВвестиСчетФактуру.Заголовок = "Ввести счет-фактуру";
				Иначе
				Элементы.ВвестиСчетФактуру.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
				КонецЕсли;
			КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РассчитыватьПроцентом(СпособРасчета)
	Если СпособРасчета = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
		Возврат Ложь;
	Иначе Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция РассчитыватьВознаграждение(СпособРасчета)
	Если СпособРасчета = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
		Возврат Ложь;
	Иначе Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораУчетНДС(Форма, ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
	Если не Объект.УчитыватьНДС Тогда
	Элементы.СтавкаНДСВознаграждения.Доступность = Ложь;
	Элементы.Товары1СуммаНДСВознаграждения.Доступность = Ложь;
	Элементы.СтавкаНДСВознаграждения.Видимость = Ложь;
	Элементы.Товары1СуммаНДСВознаграждения.Видимость = Ложь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.УчетНДСВДокументах" Тогда
		ОбработкаВыбораУчетНДС(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
			ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КурсВалютыВДокументах" Тогда
		ОбработкаВыбораКурсыВалют(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурсыВалют(Форма, ВыбранноеЗначение, ИсточникВыбора)
	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;
	
	Объект.ВалютаДокумента = ВыбранноеЗначение.ВалютаДокумента;
	Объект.КратностьВзаиморасчетов = ВыбранноеЗначение.КратностьВзаиморасчетов;
	Объект.КурсВзаиморасчетов = ВыбранноеЗначение.КурсВзаиморасчетов;
	//Евросиб - АСуслов 21.09.2021 12:58:32 #
	//(
	Объект.ДатаКурса = ВыбранноеЗначение.ДатаДокумента;
	//)
	//Евросиб - АСуслов 21.09.2021 12:58:33 #
	Если СтараяВалюта <> Объект.ВалютаДокумента или СтарыйКурс <> Объект.КурсВзаиморасчетов Тогда
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая,СтруктураНовая);
		РасчитатьВознаграждение();
		РассчитатьСуммыВсегоПоДокументу();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
			
	УстановитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентКомиссионногоВознагражденияПриИзменении(Элемент)
	Если Объект.УчитыватьНДС Тогда
		Если (ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения)) и Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
			РасчитатьВознаграждение();
		КонецЕсли;
	Иначе
		РасчитатьВознаграждение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСВознагражденияПриИзменении(Элемент)
	Если Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
		РасчитатьВознаграждение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьВознаграждение()
	Для каждого СТр из Объект.Товары Цикл
		Если Объект.СпособРасчетаКомиссионногоВознаграждения = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтРазностиСуммПродажиИПоступления") 
			ИЛИ Объект.СпособРасчетаКомиссионногоВознаграждения = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи") Тогда	
			//Евросиб СубботинВ #120291 24.09.2025 Начало
            //Стр.СуммаВознаграждения = (Стр.Сумма - Стр.СуммаНДС)*Объект.ПроцентКомиссионногоВознаграждения/100;
			Стр.СуммаВознаграждения = (Стр.Сумма - ?(Объект.СуммаВключаетНДС, Стр.СуммаНДС, 0))*Объект.ПроцентКомиссионногоВознаграждения/100;
			//Евросиб СубботинВ #120291 24.09.2025 Конец
				//Стр.СуммаВознаграждения = Стр.Сумма*Объект.ПроцентКомиссионногоВознаграждения/100;
		//Евросиб Шевченко 16.09.2025
		//Стр.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СТр.СуммаВознаграждения,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения),Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		//Евросиб СубботинВ #120291 24.09.2025 Начало
		//Стр.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СТр.СуммаВознаграждения,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения),Объект.УчитыватьНДС,Объект.СуммаВознагражденияВключаетНДС);
		Стр.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СТр.СуммаВознаграждения,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения), Объект.УчитыватьНДС, Ложь);
        //Евросиб СубботинВ #120291 24.09.2025 Конец

		//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		//Евросиб СубботинВ #120291 24.09.2025 Начало
       // Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
		//Евросиб СубботинВ #120291 24.09.2025 Конец
		
		КонецЕсли; 
	КонецЦикла;
	ИтогиВознаграждение = Объект.Товары.Итог("СуммаВознаграждения") + ?(Объект.СуммаВознагражденияВключаетНДС,0, Объект.Товары.Итог("СуммаНДСВознаграждения"));
	Объект.СуммаВознаграждения = Объект.Товары.Итог("СуммаВознаграждения")+ ?(Объект.СуммаВознагражденияВключаетНДС,0, Объект.Товары.Итог("СуммаНДСВознаграждения"));
	
	//Евросиб Шевченко 16.09.2025
	ИтогиНДСВознаграждение = Объект.Товары.Итог("СуммаНДСВознаграждения");
	Объект.СуммаНДСВознаграждения = ИтогиНДСВознаграждение;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСчетФактуруНажатие(Элемент)
	
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено и ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Документ был изменен, будет выполнена запись документа с актуализацией данных подчиненной счет-фактуры. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);	
	КонецЕсли;
	Если РеквизитыСФ = Неопределено и ЭтаФорма.Модифицированность Тогда
		//	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед созданием счет-фактуры документ необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	ИначеЕсли РеквизитыСФ = Неопределено Тогда
		ОбработкаВопросаЗаписи(КодВозвратаДиалога.Да, Истина);
	КонецЕсли;	
	Если РеквизитыСф <> Неопределено и Не ЭтаФорма.Модифицированность Тогда
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаписатьДокументРеализации();
	КонецЕсли;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ВвестиСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.ВвестиСчетФактуру.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	КонецЕсли;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");

КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаСервере
Процедура ЗаписатьДокументРеализации()
	ЭтотОбъект.Записать();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Комментарий = "ОТКАЗ" Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	//Евросиб Каблов 11.07.2020 ( TASK 23506
	//Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
	//Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ГруппаВыставлен.ТолькоПросмотр = Истина;
	КонецЕсли;
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 11.07.2020 )
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	ОбновитьОтображениеПанелиКорректировок();
	КорректировкиДокумента.ЗагрузитьЗначения(КорректировкиРТУСервер.ПолучитьКорректировкуПоОснованию(Объект.Ссылка));
	Элементы.ГруппаКорректировкиДокумента.Видимость = (КорректировкиДокумента.Количество() > 0);
	
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963 
    // Обработчик подсистемы "Свойства"
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Объект", Объект);
    ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
    УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963 
		

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 ) 
	
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 19.01.2023
	//запомним дату, чтобы сравнивать при изменении
	ДатаДокументаТекущая = Объект.ДатаДокумента;
	
	Элементы.ДатаДокумента.ТолькоПросмотр = Истина; // всем запрет на редактирование даты документа
	Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда // разрешить редактировать без учета разрешенного периода 
		Элементы.ДатаДокумента.ТолькоПросмотр = Ложь;	
	КонецЕсли;	
	Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда 
		СтруктураПараметров = РегистрыСведений.РазрешенныйПериодРедактирования.ПолучитьАктуальныйПериодРедактирования(); 
		ДатаНачалаРазрешенногоПериодаПереноса = СтруктураПараметров.ДатаНачалаРазрешенногоПериодаПереноса;
		ДатаОкончанияРазрешенногоПериодаПереноса = СтруктураПараметров.ДатаОкончанияРазрешенногоПериодаПереноса;
		Если Объект.ДатаДокумента >= СтруктураПараметров.ДатаНачалаПериодаРазрешенияРедактирования 
			И Объект.ДатаДокумента <= СтруктураПараметров.ДатаОкончанияПериодаРазрешенияРедактирования Тогда 
			Элементы.ДатаДокумента.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 19.01.2023
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ВидЗадолженности = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(Объект.Ссылка);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ОбновитьОтображениеПанелиКорректировок()
	
	Рез = КорректировкиРТУСервер.ПолучитьСтатусРазрешенияКорректировки(Объект.Ссылка);
	Элементы.ГруппаКорректировкаИсправление.Видимость = Рез.Корректировка ИЛИ Рез.Исправление;
	корр_РазрешенаКорректировка = Рез.Корректировка;
	корр_РазрешеноИсправление = Рез.Исправление;
	корр_Описание = Рез.Описание;
	
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС); 
		//Евросиб СубботинВ #120291 24.09.2025 Начало 
		//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
		//Евросиб СубботинВ #120291 24.09.2025 Конец 	

	КонецЦикла;
		
	РассчитатьСуммыВсегоПоДокументу();
	//Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
КонецПроцедуры

&НаСервере
Процедура ВыписатьСчФВыданныеДляКомитентаНаСервере()
Для каждого Стр из Объект.Поставщики Цикл	
	Если Не ЗначениеЗаполнено(Стр.СчетФактура) Тогда
	    СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Объект.Ссылка,"СчетФактураВыданный",Стр.Партия);
		Если СчФ <> Неопределено Тогда
			Если СчФ.ПометкаУдаления Тогда
				ОбСФ = СчФ.ПолучитьОбъект();
				ОБСФ.ПометкаУдаления = Ложь;
				БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Объект.Ссылка,СчФ,Стр.Партия);
			Иначе
				БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Объект.Ссылка,СчФ,Стр.Партия);
			КонецЕсли;
		Иначе
		//	Если Не ЗначениеЗаполнено(Стр.СчетФактура) Тогда
			 СчФ = ВыписатьСчетФактуру(Объект,Стр.Партия);
		КонецЕсли;
		Если СчФ <> Неопределено Тогда
			 Стр.СчетФактура = СчФ.Ссылка;
			 Объект.НомерДляПечати = СчФ.НомерДляПечати;
		КонецЕсли;
	Иначе
		
		 СчФ = Стр.СчетФактура;
		 БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Объект.Ссылка,СчФ,Стр.Партия);
		 Объект.НомерДляПечати = СчФ.НомерДляПечати;
	 КонецЕсли;
 КонецЦикла;
  ЗаписатьДокумент();
КонецПроцедуры

&НаСервере
Функция ВыписатьСчетФактуру(ДокументОснование, ДокументПартии) Экспорт
	СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Объект.Ссылка,СчФ,ДокументПартии);
	СчФ.Записать();
	Возврат СчФ;
КонецФункции

&НаКлиенте
Процедура ВыписатьСчФВыданныеДляКомитента(Команда)
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиПередВыполнениемКоманды", ЭтаФорма);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) или ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед созданием счетов-фактур документ необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ВыписатьСчФВыданныеДляКомитентаНаСервере();
		Для каждого Стр из Объект.Товары Цикл
			БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
			//Евросиб СубботинВ #120291 24.09.2025 Начало
			//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДСВознаграждения);
			Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
			//Евросиб СубботинВ #120291 24.09.2025 Конец
		КонецЦикла;

		РассчитатьСуммыВсегоПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиПередВыполнениемКоманды(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаписатьДокумент();
		ВыписатьСчФВыданныеДляКомитентаНаСервере();
		РассчитатьСуммыВсегоПоДокументу();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент()
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Товары1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениеПоПоступлениюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуВыбораПоступления("ЗаполнитьПоПоступлению");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПоступления(СпособЗаполнения)
	
	ПараметрыОтбора = Новый Структура("Организация",	Объект.Организация);
	ПараметрыФормы = Новый Структура("Отбор, МножественныйВыбор", ПараметрыОтбора, Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СпособЗаполнения", СпособЗаполнения);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоПоступлениюНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоступлениюНаКлиентеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СпособЗаполнения = ДополнительныеПараметры.СпособЗаполнения; 
	
	Поступление = РезультатЗакрытия;
	
	Если НЕ ЗначениеЗаполнено(Поступление) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗакупленнымиНаСервере(СпособЗаполнения, Поступление);
	РасчитатьВознаграждение();

	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС); 
		//Евросиб СубботинВ #120291 24.09.2025 Начало
		//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
		//Евросиб СубботинВ #120291 24.09.2025 Конец 	

	КонецЦикла;
	
	УстановитьДатыДокумента();
	РассчитатьСуммыВсегоПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатыДокумента()
//Евросиб Гудкова( 30.10.2019 
    Документ = РеквизитФормыВЗначение("Объект");
    Документ.УстановитьДатыДокумента();
    ЗначениеВРеквизитФормы(Документ, "Объект");
// Евросиб Гудкова) 	
	//МаксДата = Дата ('00010101');
	//Для каждого Стр из Объект.Поставщики Цикл
	//	Если Стр.ДатаСФ >= МаксДата Тогда
	//		МаксДата = Стр.ДатаСФ;
	//		Подрядчик = Стр.Поставщик;
	//		Партия = Стр.Партия;
	//	КонецЕсли;
	//КонецЦИкла;
	//Если Подрядчик.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
	//	Если МаксДата  >= ОткрытыйПериод() Тогда
	//		Объект.ДатаДокумента = МаксДата;
	//		//Объект.ПериодВО = НачалоМесяца(МаксДата);
	//	Иначе
	//		Объект.ДатаДокумента = ОткрытыйПериод();
	//		//Объект.ПериодВО = НачалоМесяца(ОткрытыйПериод());
	//	КонецЕсли;
	//Иначе
	//	Если Партия.Дата  >= ОткрытыйПериод() Тогда
	//		Объект.ДатаДокумента =  Партия.Дата;
	//	//	Объект.ПериодВО = НАчалоМесяца(Партия.Дата);
	//	Иначе
	//		Объект.ДатаДокумента = ОткрытыйПериод();
	//	//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
	//	КонецЕсли;
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
	//	Объект.ДатаДокумента = ТекущаяДата();
	//КонецЕсли;
	//Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
		    
КонецПроцедуры

//&НаСервере
//Функция ОткрытыйПериод()
//	ДатаЗП = Дата('00010101');
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
//	                      |ИЗ
//	                      |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних");
//	Запрос.УстановитьПараметр("Организация", Объект.Организация);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		ДатаЗП = Выборка.Период;
//	КонецЕсли;
//	Если ДатаЗП <> Дата('00010101') Тогда
//		СледующийОткрытыйМесяц = НачалоМесяца(ДобавитьМесяц(ДатаЗП,1));
//	Иначе
//		СледующийОткрытыйМесяц = Дата('00010101');
//	КонецЕсли;
//	
//	Возврат СледующийОткрытыйМесяц;
//КонецФункции

&НаСервере
Процедура ЗаполнитьЗакупленнымиНаСервере(СпособЗаполнения = "ЗаполнитьПоПоступлению", Поступление = Неопределено)
		Объект.Товары.Очистить();
		Объект.Поставщики.Очистить();
		МаксимальныйКлючСтроки = 0;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация",Объект.Организация);
		СтруктураПараметров.Вставить("Поступление",Поступление);
		
		РезультатЗапроса = Документы.ОтчетКомитентуОПродажах.ЗаполнитьПоПоступлению(СтруктураПараметров);
		
		ВыборкаПоставщики = РезультатЗапроса[0].Выбрать();
		ВыборкаТовары = РезультатЗапроса[1].Выгрузить();
		
		Пока ВыборкаПоставщики.Следующий() Цикл
			МаксимальныйКлючСтроки = МаксимальныйКлючСтроки+1;
			НовСтр = Объект.Поставщики.Добавить();
			НовСтр.Поставщик = ВыборкаПоставщики.Поставщик;
			НовСтр.Партия = ВыборкаПоставщики.Партия;
			НовСтр.ПолученСФ = ?(ЗначениеЗаполнено(ВыборкаПоставщики.НомерСчетаФактуры),Истина,Ложь);
			НовСтр.ДатаСФ = ВыборкаПоставщики.ДатаСФ;
			НовСтр.НомерСчетаФактуры = ВыборкаПоставщики.НомерСчетаФактуры;
			НовСтр.КПППоставщика = ВыборкаПоставщики.КПППоставщика;
			НовСтр.КлючСтроки = МаксимальныйКлючСтроки;
			ОтборСтрокТовары = Новый Структура;
			ОтборСтрокТовары.Вставить("Партия",ВыборкаПоставщики.Партия);
			Товары = ВыборкаТовары.НайтиСтроки(ОтборСтрокТовары);
				
			Если Товары.Количество()>0 Тогда
				Если ВыборкаПоставщики.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
					Для каждого Эл Из Товары Цикл
						СтрТовары = Объект.Товары.Добавить();
						СтрТовары.Номенклатура = Эл.Номенклатура;
						СтрТовары.Количество = Эл.Количество;
						СтрТовары.СтавкаНДС = Эл.СтавкаНДС;
						СтрТовары.Содержание = Эл.Содержание;
						СтрТовары.КлючСтроки = МаксимальныйКлючСтроки;
						СтрТовары.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(Эл.Сумма,ВыборкаПоставщики.ВалютаДокумента,Объект.ВалютаДокумента,Объект.ДатаДокумента);
						СтрТовары.СуммаНДС = РаботаСКурсамиВалют.ПересчитатьВВалюту(Эл.СуммаНДС,ВыборкаПоставщики.ВалютаДокумента,Объект.ВалютаДокумента,Объект.ДатаДокумента);
						СтрТовары.Цена = СтрТовары.Сумма/СтрТовары.Количество;
						СтрТовары.ГУИДПТУ = Эл.ГУИДПТУ;
					КонецЦикла;
				Иначе
					Для каждого Эл Из Товары Цикл
						СтрТовары = Объект.Товары.Добавить();
						СтрТовары.Номенклатура = Эл.Номенклатура;
						СтрТовары.Количество = Эл.Количество;
						СтрТовары.СтавкаНДС = Эл.СтавкаНДС;
						СтрТовары.Сумма = Эл.Сумма;
						СтрТовары.СуммаНДС = Эл.СуммаНДС;
						СтрТовары.Цена = Эл.Цена;
						СтрТовары.Содержание = Эл.Содержание;
						СтрТовары.КлючСтроки = МаксимальныйКлючСтроки;
						СтрТовары.ГУИДПТУ = Эл.ГУИДПТУ;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Объект.ДокументОснование = Поступление;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоступлению(Команда)
		Если Объект.Товары.Количество() + Объект.Поставщики.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'") ;
			Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениеПоПоступлениюЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, Заголовок);
		Иначе
			ОткрытьФормуВыбораПоступления("ЗаполнитьПоПоступлению");
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеализации(Команда)
		Если Объект.Товары.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'") ;
			Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениеПоРеализацииЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, Заголовок);
		Иначе
			ОткрытьФормуВыбораРеализации("ЗаполнитьПоРеализации");
		КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ВопросПередЗаполнениеПоРеализацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуВыбораРеализации("ЗаполнитьПоРеализации");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеализации(СпособЗаполнения)
	
	ПараметрыОтбора = Новый Структура("Организация",	Объект.Организация);
	ПараметрыФормы = Новый Структура("Отбор, МножественныйВыбор", ПараметрыОтбора, Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СпособЗаполнения", СпособЗаполнения);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоРеализацииНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии);

КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьПоРеализацииНаКлиентеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СпособЗаполнения = ДополнительныеПараметры.СпособЗаполнения; 
	
	Реализация = РезультатЗакрытия;
	
	Если НЕ ЗначениеЗаполнено(Реализация) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПроданнымиНаСервере(СпособЗаполнения, Реализация);
	Если ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения) и Объект.ПроцентКомиссионногоВознаграждения>0 Тогда
		РасчитатьВознаграждение();
	КонецЕсли;
	Для каждого Стр из Объект.Товары Цикл
		
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		//Евросиб СубботинВ #120291 24.09.2025 Начало
		//Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДСВознаграждения);
		Стр.ВсегоВознаграждения = Стр.СуммаВознаграждения + ?(Объект.СуммаВознагражденияВключаетНДС, Стр.СуммаНДСВознаграждения, 0);
		//Евросиб СубботинВ #120291 24.09.2025 Конец 	

	КонецЦикла;
	
	РассчитатьСуммыВсегоПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроданнымиНаСервере(СпособЗаполнения = "ЗаполнитьПоРеализации", Реализация = Неопределено)
		Объект.Товары.Очистить();
		МаксимальныйКлючСтроки = 0;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация",Объект.Организация);
		СтруктураПараметров.Вставить("Реализация",Реализация);
		СтруктураПараметров.Вставить("Контрагент",Объект.Контрагент);
		РезультатЗапроса = Документы.ОтчетКомитентуОПродажах.ЗаполнитьПоРеализации(СтруктураПараметров);
		
		ВыборкаТовары = РезультатЗапроса.Выбрать();
		Если Реализация.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
			Пока ВыборкаТовары.Следующий() Цикл
				
				СтрТовары = Объект.Товары.Добавить();
				СтрТовары.Номенклатура = ВыборкаТовары.Номенклатура;
				СтрТовары.Количество = ВыборкаТовары.Количество;
				СтрТовары.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
				СтрТовары.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаТовары.СуммаНДС,Реализация.ВалютаДокумента,Объект.ВалютаДокумента,Объект.ДатаДокумента);
				СтрТовары.Цена =СтрТовары.Сумма/СтрТовары.Количество;
				СтрТовары.Содержание = ВыборкаТовары.Содержание;
				СтрТовары.Покупатель = ВыборкаТовары.Контрагент;
				СтрТовары.ДатаРеализации = ВыборкаТовары.Дата;
				СтрТовары.КлючСтроки = МаксимальныйКлючСтроки;
			КонецЦикла;
		Иначе			
			Пока ВыборкаТовары.Следующий() Цикл
				
				СтрТовары = Объект.Товары.Добавить();
				СтрТовары.Номенклатура = ВыборкаТовары.Номенклатура;
				СтрТовары.Количество = ВыборкаТовары.Количество;
				СтрТовары.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
				СтрТовары.Сумма = ВыборкаТовары.Сумма;
				СтрТовары.СуммаНДС = ВыборкаТовары.СуммаНДС;
				СтрТовары.Цена = ВыборкаТовары.Цена;
				СтрТовары.Содержание = ВыборкаТовары.Содержание;
				СтрТовары.Покупатель = ВыборкаТовары.Контрагент;
				СтрТовары.ДатаРеализации = ВыборкаТовары.Дата;
				СтрТовары.КлючСтроки = МаксимальныйКлючСтроки;
			КонецЦикла;
		КонецЕсли;
		ОБъект.ДокументОснование = Реализация;
	//Объект.ВалютаДокумента = Реализация.ВалютаДокумента;
		Объект.СуммаДокумента  = Объект.Товары.Итог("Сумма") + ?(Объект.СуммаВключаетНДС,0,Объект.Товары.Итог("СуммаНДС"));
	
			
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВалютаДокумента", ОбъектА.ВалютаДокумента);
	ПараметрыФормы.Вставить("КурсВзаиморасчетов", ОбъектА.КурсВзаиморасчетов);
	ПараметрыФормы.Вставить("КратностьВзаиморасчетов", ОбъектА.КратностьВзаиморасчетов);
	//Евросиб - АСуслов 21.09.2021 12:44:42 #33698
	//(
	//ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.Дата);
	ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.ДатаКурса);
	//)
	//Евросиб - АСуслов 21.09.2021 12:44:44 #33698
	ОткрытьФорму("ОбщаяФорма.КурсВалютыВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СписокВыборДоговоров = Новый Массив;
	СформироватьМассивВидовДоговоров(СписокВыборДоговоров);
	СтандартнаяОбработка = ложь;
	ПараметрыВыбора777 = Новый Структура("СписокВидовДоговоров", СписокВыборДоговоров);
	ПараметрыВыбора777.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыВыбора777.Вставить("Организация",Объект.Организация);
	ОпОп= Новый ОписаниеОповещения("ОбработкаВыбораДоговора", Этаформа);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыВыбора777, , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьМассивВидовДоговоров(СписокВыборДоговоров)
	Если Объект.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		СписокВыборДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		СписокВыборДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);

	Иначе
		СписокВыборДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		СписокВыборДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДоговора(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено Тогда Объект.ДоговорКонтрагента = Параметр1; КонецЕсли; 
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура СоздатьСчетНаОплатуНаВРНаСервере(ОбФормыСчета)
	СтруктураПараметровСчетаНаОплату = ПолучитьСтруктуруПараметровДляЗаполненияСчетаНаОплату();
	ДокОбъект = ДанныеФормыВЗначение(ОбФормыСчета,Тип("ДокументОбъект.СчетНаОплатуПокупателю"));
	
	ДокОбъект.Заполнить(СтруктураПараметровСчетаНаОплату);
	ЗначениеВДанныеФормы(ДокОбъект,ОбФормыСчета);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьСчетНаОплатуНаВР(Команда)
	ФормаСчета = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента");
	ОбФормыСчета = ФормаСчета.Объект;
	СоздатьСчетНаОплатуНаВРНаСервере(ОбФормыСчета);
	
	КопироватьДанныеФормы(ОбФормыСчета,ФормаСчета.Объект);
	ФормаСчета.Модифицированность = Истина;
	ФормаСчета.Открыть();
КонецПроцедуры

Функция ПолучитьСтруктуруПараметровДляЗаполненияСчетаНаОплату()
	СтруктураПараметров = Новый Структура("НомерДляПечати,Организация,Контрагент,ДоговорКонтрагента,ПодразделениеОрганизации,ВалютаДокумента,КурсВзаиморасчетов,КратностьВзаиморасчетов,УчитыватьНДС,СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров,Объект);
	СтруктураПараметров.Вставить("ДокументОснование",Объект.Ссылка);
	СтруктураПараметров.Вставить("ТаблицаДокумента",Объект.Товары.Выгрузить());
	Возврат СтруктураПараметров;
КонецФункции

//&НаКлиенте
//Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	Оп = Новый ОписаниеОповещения("ОповещениеВыбораПериодаЗавершение",ЭтотОбъект);
//	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
//	Диалог.Показать(Оп); 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВыбораПериодаЗавершение(Период3, ДополнительныеПараметры) Экспорт

//	Если Период3 = неопределено Тогда Возврат; КонецЕсли;
//	
//	Период = Формат(Период3.ДатаНачала,"ДФ='ММММ гггг'") + " г.";
//	
//	Объект.ПериодВО = Период3.ДатаНачала;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
	//	Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 19.01.2023
	Если Не КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда  // разрешить редактировать без учета разрешенного периода
		Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда // только в разрешенном периоде и периоде ВО
			Если Объект.ДатаДокумента < Объект.ПериодВО Тогда  
				Если Объект.ДатаДокумента >= ДатаНачалаРазрешенногоПериодаПереноса
					И Объект.ДатаДокумента <= ДатаОкончанияРазрешенногоПериодаПереноса Тогда 
					//Все ок
				Иначе       
					Ошибки = Неопределено;
					ТекстОшибки = СтрШаблон("Дата документа может быть перенесена в период %1 - %2",Формат(ДатаНачалаРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"),Формат(ДатаОкончанияРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"));
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.ДатаДокумента",ТекстОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
					Объект.ДатаДокумента = ДатаДокументаТекущая; 
					Возврат;	
				КонецЕсли;
			КонецЕсли;
		Иначе  
			Объект.ДатаДокумента = ДатаДокументаТекущая;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 19.01.2023
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб Каблов 11.07.2020 ( TASK 23506
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 11.07.2020 )
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова) 
//Евросиб Максимова  16.02.2021
ПараметрыЗапроса.Вставить("ОплатаОригинал",ЕстьОплатаОригинал(Объект.ДоговорКонтрагента));
//Евросиб

       РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);//Гудкова 0206196 МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;

	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры


&НаСервере
Процедура ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(ТекущаяСтруктура, НоваяСтруктура)
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
	ОкруглениеКурса = Справочники.ФормированиеФинДокументов.ПолучитьЗначениеОкругленияКурсаИзПравил(Объект.ПравилоФормирования);
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
	Для каждого Стр из Объект.Товары Цикл
		//Стр.Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Всего, ТекущаяСтруктура,НоваяСтруктура);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
		Стр.Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Всего, ТекущаяСтруктура,НоваяСтруктура, , ОкруглениеКурса);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
		Стр.Сумма = ?(Объект.СуммаВключаетНДС, Стр.Всего,Стр.Всего/(1+(БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100)));
		Стр.СуммаНДС = ?(Объект.СуммаВключаетНДС,  Стр.Всего*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100,Стр.Всего- Стр.Сумма);
		Стр.Цена = Стр.Сумма/Стр.Количество;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Функция ПолучитьВалютуРегламентированногоУчета()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции

&НаСервере
Функция ДоговорКонтрагентаПриИзмененииНаСервере()

	Если Объект.ВалютаДокумента <> Объект.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		Объект.ВалютаДокумента = Объект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Результат = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента,Объект.ДатаДокумента);
		Объект.КурсВзаиморасчетов = Результат.Курс;
		Объект.КратностьВзаиморасчетов = Результат.Кратность;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбновитьДатыДокумента(Команда)
	УстановитьДатыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура Товары1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();
	
	// Евросиб Фролов (15.03.2022 Task №40571 
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПроверитьКоличествоВТабличнойЧасти(ЭтаФорма, "Товары1");
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура Товары1ЦенаПриИзменении(Элемент)
		СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура Товары1ПриИзменении(Элемент)
	РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();
КонецПроцедуры


&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;

	НужноПересчитатьСуммыВДокументе = ДоговорКонтрагентаПриИзмененииНаСервере();
	Если НужноПересчитатьСуммыВДокументе Тогда   
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая,СтруктураНовая);
	КонецЕсли;
	РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

//Евросиб Гудкова( 01.11.2019  
&НаКлиенте
Процедура ОтчПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодВО = ДобавитьМесяц(Объект.ПериодВО, Направление);
	ОтчПериод = Формат(Объект.ПериодВО, "ДФ='ММММ гггг'") + "г.";
КонецПроцедуры
// Евросиб Гудкова)
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СуммаДокумента = ИтогиВсего;
	Объект.СуммаВознаграждения = ИтогиВознаграждение;
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова) 
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);//Гудкова 0206196 МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;

	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
	//Евросиб Каблов 05.05.2021 ( Ticket#0225298
	ИзмененияЗапрещены = Отказ;
	ТекРежимЗаписи = Неопределено;
	ТекРежимПроведения = Неопределено;
	ПараметрыЗаписи.Свойство("РежимЗаписи", ТекРежимЗаписи);
	ПараметрыЗаписи.Свойство("РежимПроведения", ТекРежимПроведения);
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ТекущийОбъект, ИзмененияЗапрещены, ТекРежимЗаписи, ТекРежимПроведения);
	//Евросиб Каблов 05.05.2021 )
	
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963	
    // Обработчик подсистемы "Свойства"
    УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963	

КонецПроцедуры

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаКлиенте
Процедура СнятьПризнакВыставлен(Команда)
	
	//Евросиб Каблов 05.03.2021 ( Ticket#0225298
	//Если Объект.Выставлен Тогда
	//	Объект.Выставлен = Ложь;
	//	Объект.ДатаВыставления = '00010101';
	//	ПараметрыЗаписи = Новый Структура;
	//	ПараметрыЗаписи.Вставить("СнятьПризнакВыставленУСчетаФактуры", Истина);
	//	Записать(ПараметрыЗаписи);
	//КонецЕсли;
	
	СнятьПризнакВыставленСервер();
	//Евросиб Каблов 05.03.2021 )
	
КонецПроцедуры

//Евросиб Каблов 05.03.2021 Ticket#0225298
&НаСервере
Процедура СнятьПризнакВыставленСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	//Проверка и установка доп. свойства, что ИзмененыТолькоРазрешенныеПоля
	ИзмененияЗапрещены = Ложь;
	ТекРежимЗаписи = РежимЗаписиДокумента.Проведение;
	ТекРежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ДокОбъект, ИзмененияЗапрещены, ТекРежимЗаписи, ТекРежимПроведения);
	
	//Снятие признака и запись документа
	ДокОбъект.СнятьПризнакВыставлен();
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);

КонецПроцедуры // СнятьПризнакВыставленСервер()
 

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаСервере
Процедура ОбработатьБлокировкуДокумента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДанныеОБлокировке = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеОБлокировке(Объект.Ссылка);
		ТолькоПросмотр = ДанныеОБлокировке.Заблокирован;		
		Элементы.ПредупреждениеРедактирования.Видимость = ДанныеОБлокировке.Заблокирован;
		Элементы.ПредупреждениеРедактирования.Заголовок = ДанныеОБлокировке.ОписаниеБлокировки;
	Иначе
		Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОсновномуПоступлению(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) тогда
		
		ЗаполнитьПоПоступлениюНаКлиентеЗавершение(Объект.ДокументОснование, Новый Структура("СпособЗаполнения", "ЗаполнитьПоПоступлению"));
		
	Иначе
		
		ПоказатьПредупреждение(, "Не указан документ-основание! Воспользуйтесь заполнением по произвольному поступлению!");
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196

// <Описание процедуры>
//
// Параметры:
//  Контрагент  - СправочникСсылка.Контрагенты - контрагент, по которому
//                 проверяется настроенная связь в Диадоке
&НаСервереБезКонтекста
Функция ЕстьЭДОСКонтрагентом(Контрагент)

	Возврат Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент);

КонецФункции // ЕстьЭДОСКонтрагентом()
//Максимова 16.02.21
&НаСервереБезКонтекста
Функция ЕстьОплатаОригинал(Договор)

	Возврат Договор.ОплатаПоОригиналу;

КонецФункции // ЕстьЭДОСКонтрагентом()
// Евросиб Гудкова)

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленыПризнакиРазрешенияКорректировокРТУ" Тогда
		ОбновитьОтображениеПанелиКорректировок();
	КонецЕсли;
	
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
        ОбновитьЭлементыДополнительныхРеквизитов();
        УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
    КонецЕсли;
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963

КонецПроцедуры

//Евросиб Каблов 07.06.2021 Ticket#0233960 
&НаСервере
Процедура СнятьПризнакВыгруженНаСервере()
	
	//Проверка доступности по Периоду ВО
	ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Объект.Ссылка);
	Если ДокументВЗакрытомПериоде Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование документа запрещено, так как он в закрытом периоде!");
		Возврат;
	КонецЕсли;
	
	//Проверка доступности по наличию привязанных оплат
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка КАК Ссылка,
	|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) КАК СуммаОплаты
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации = &ДокументРеализации
	//Евросиб Каблов 18.11.2021 (
	|	И ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.Проведен
	//Евросиб Каблов 18.11.2021 )
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) <> 0";
	Запрос.УстановитьПараметр("ДокументРеализации", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено редактирование документа из-за наличия привязанных оплат.");		
		Возврат;
	КонецЕсли;
	
	//Удаление признака выгрузки
	ЗаписьПротоколаОбмена = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
	ЗаписьПротоколаОбмена.УзелОбмена = Перечисления.УзлыОбмена.УПП;
	ЗаписьПротоколаОбмена.Объект = Объект.Ссылка;
	ЗаписьПротоколаОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	ЗаписьПротоколаОбмена.Удалить();
	
	//Обновление информации о блокировке документа
	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	
КонецПроцедуры

//Евросиб Каблов 07.06.2021 Ticket#023396
&НаКлиенте
Процедура СнятьПризнакВыгружен(Команда)
	СнятьПризнакВыгруженНаСервере();
КонецПроцедуры
 
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963

// Евросиб Фролов (15.03.2022 Task №40571
&НаКлиенте
Процедура Товары1ЕдиницаИзмеренияПриИзменении(Элемент)	 
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПроверитьКоличествоВТабличнойЧасти(ЭтаФорма, "Товары1");
КонецПроцедуры
//Евросиб Шевченко А.В. US 112685 05.11.2025

//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
&НаКлиенте
Процедура СчетаНаОплатуПокупателям1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не Копирование Тогда
		
		Если Объект.СчетаНаОплатуПокупателям.Количество() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("На вкладке ""Счета покупателям"" есть счет покупателю. Для добавления нового, удалите с вкладки текущий счет",,,"Объект.СчетаНаОплатуПокупателям");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		Отказ = Истина;
		
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыФормыПодбора.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыФормыПодбора.Вставить("Реализация", Объект.Ссылка);
		
		АдресХранилищаДанных = ПолучитьАдресХранилищаДанныхДляПодбораСчетов();
		ПараметрыФормыПодбора.Вставить("АдресХранилищаДанных", АдресХранилищаДанных);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("АдресХранилищаДанных", АдресХранилищаДанных);	
		ОписаниеОповещенияОПодбореСчетов = Новый ОписаниеОповещения("ОбработкаПодбораСчетов", ЭтаФорма, ДопПараметры);
		
		ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаПодбораСчетов", ПараметрыФормыПодбора, ЭтаФорма,,,, ОписаниеОповещенияОПодбореСчетов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилищаДанныхДляПодбораСчетов()
	
	ТаблицаУслуг = Объект.Товары.Выгрузить(, "Номенклатура, Сумма");
	НовСтрока = ТаблицаУслуг.Добавить();
	ИтогиВознаграждениеЗ = 0;
	Для Каждого СтрокаТ Из Объект.Товары Цикл
		Если Объект.СуммаВознагражденияВключаетНДС Тогда
			ИтогиВознаграждениеЗ = ИтогиВознаграждениеЗ + (СтрокаТ.ВсегоВознаграждения + СтрокаТ.СуммаНДСВознаграждения);
		Иначе
			ИтогиВознаграждениеЗ = ИтогиВознаграждениеЗ + СтрокаТ.ВсегоВознаграждения;
		КонецЕсли;
	КонецЦикла;	
		
	НовСтрока.Номенклатура = СПравочники.Номенклатура.Вознаграждение;
	НовСтрока.Сумма = ИтогиВознаграждениеЗ;
	
	ТаблицаУслуг.Свернуть("Номенклатура", "Сумма");
	
	ПодобранныеСчетаПокупателям = Объект.СчетаНаОплатуПокупателям.Выгрузить(, "СчетПокупателю, Номенклатура, Сумма");
	ПодобранныеСчетаПокупателям.Свернуть("СчетПокупателю, Номенклатура, Сумма");
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("ТаблицаУслуг, ПодобранныеСчетаПокупателям", ТаблицаУслуг, ПодобранныеСчетаПокупателям));
	
	Возврат АдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПодбораСчетов(АдресТаблицыВыбранныхСчетов, ДопПараметры) Экспорт
	
	УдалитьИзВременногоХранилища(ДопПараметры.АдресХранилищаДанных);
	
	Если ЗначениеЗаполнено(АдресТаблицыВыбранныхСчетов) Тогда
		ОбработкаПодбораСчетовСервер(АдресТаблицыВыбранныхСчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПодбораСчетовСервер(АдресТаблицыВыбранныхСчетов)
	
	ВыбранныеСчета = ПолучитьИзВременногоХранилища(АдресТаблицыВыбранныхСчетов);
	ОбработанныеСтроки = Новый Массив;
	Для Каждого Стр Из ВыбранныеСчета Цикл
		НайденныеСтроки = Объект.СчетаНаОплатуПокупателям.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", Стр.СчетПокупателю, Стр.Номенклатура));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.Сумма = Стр.Сумма;
		Иначе
			НоваяСтрока = Объект.СчетаНаОплатуПокупателям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаСервере
Процедура СчетаНаОплатуПокупателямПриИзмененииСервер()
	
	ТаблицаСчетов = Объект.СчетаНаОплатуПокупателям.Выгрузить();
	Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(ТаблицаСчетов);
	Для Каждого Стр Из Объект.СчетаНаОплатуПокупателям Цикл
		Если Не ЗначениеЗаполнено(Стр.ВидДоходов) Тогда
			НайденныеСтроки = ТаблицаСчетов.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура, Контейнер", Стр.СчетПокупателю, Стр.Номенклатура, Стр.Контейнер));
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Стр.ВидДоходов = НайденныеСтроки[0].ВидДоходов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаОплатуПокупателямПриИзменении(Элемент)
	//Евросиб Каблов 01.09.2025 ( #111016
	СчетаНаОплатуПокупателямПриИзмененииСервер();
	//Евросиб Каблов 01.09.2025 ) #111016
КонецПроцедуры

