
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		ДляГруженых = Истина; ДляПорожних = Истина;
		ЕИНормативнойДлительности = Перечисления.ЕдиницаИзмеренияДлительности.КалендарныйДень;
		Организация = Константы.ОсновнаяОрганизация.Получить();
		ЕдиницаТарификации = Перечисления.ЕдиницыТарификации.ТС;
		МетодТарификации = Перечисления.МетодыТарификации.ВЦелом;
		ТипСуммирования = Перечисления.ТипыСуммирования.ПоИтоговомуЗначению;
		
		Автор = Пользователи.ТекущийПользователь();
		Создано = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Редактор = Пользователи.ТекущийПользователь();
		Изменено = ТекущаяДата();
	КонецЕсли;
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	//Субботин TASK 70840 20.06.2023 Начало
	Если НЕ ЗначениеЗаполнено(Ссылка) тогда
		НоменклатураСервер.ПроверитьРеквизитИспользованиеНоменклатуры(Услуга,,Отказ); 
	КонецЕсли;
	//Субботин TASK 70840 20.06.2023 Конец
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	
КонецПроцедуры
