
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Тип", 2);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Код", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);
	
	//ГруппыГрузоотправителиГрузополучатели = Новый СписокЗначений;
	//ГруппыГрузоотправителиГрузополучатели.Добавить(750);
	//ГруппыГрузоотправителиГрузополучатели.Добавить(841);
	//ГруппыГрузоотправителиГрузополучатели.Добавить(948);
	//ГруппыГрузоотправителиГрузополучатели.Добавить(1070);
	//ГруппыГрузоотправителиГрузополучатели.Добавить(2873);
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Группа", ГруппыГрузоотправителиГрузополучатели, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры
