//999
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		//Элементы.Объект.ТекущаяСтрока = Параметры.ТекущаяСтрока;
        Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормыСписка(Элементы);
	//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

