
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Пометка = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Пометка = Ложь; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначения(Команда)
	
	Если ТС Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel2", ЭтаФорма, Новый Структура("Вагоны", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ОткрытьФорму("Справочник.ТС.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), ЭтаФорма, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ТЕ Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel2", ЭтаФорма, Новый Структура("КТК", Истина));
		ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ОткрытьФорму("Справочник.ТЕ.ФормаВыбора",, ЭтаФорма, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ТД Тогда
		ОткрытьФорму("Документ.ТранспортныйДокумент.ФормаВыбора",, ЭтаФорма, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel2(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Параметр1) Тогда
		Для каждого УЕ Из Параметр1 Цикл
			СтрокиУЕ = ТЧ.НайтиСтроки(Новый Структура("УчетнаяЕдиница", УЕ));
			Если ЗначениеЗаполнено(СтрокиУЕ) Тогда
				Для каждого УЕ Из СтрокиУЕ Цикл
					УЕ.Пометка = Истина;
				КонецЦикла;                    
			Иначе
				нУЕ = ТЧ.Добавить();
				нУЕ.Пометка = Истина;
				нУЕ.N = ТЧ.Количество();
				нУЕ.УчетнаяЕдиница = УЕ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ВыбрЗнач = ВыбранноеЗначение;
	
	Если ТипЗнч(ВыбрЗнач) <> Тип("Массив") Тогда
		ВыбрЗнач = Новый Массив;
		ВыбрЗнач.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	Для каждого Стр из ВыбрЗнач Цикл
		НСтр = ТЧ.Добавить();
		НСтр.Пометка = Истина;
		НСтр.УчетнаяЕдиница = Стр;
	КонецЦикла;
	
	ОбновитьСчетчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчик()
	
	Для Сч = 1 По ТЧ.Количество() Цикл
		ТЧ[Сч-1].N = Сч;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 12.12.2023 ( Ticket#0329972
	ДоступноРедактированиеСписка = Неопределено;
	Если Параметры.Свойство("ДоступноРедактированиеСписка", ДоступноРедактированиеСписка) Тогда
		Элементы.ФормаДобавитьЗначения.Доступность = ДоступноРедактированиеСписка;
		Элементы.ТЧ.ИзменятьСоставСтрок = ДоступноРедактированиеСписка;
	КонецЕсли;
	//Евросиб Каблов 12.12.2023 )
	
	ТС = Параметры.Свойство("ТС");
	ТЕ = Параметры.Свойство("ТЕ");
	ТД = Параметры.Свойство("ТД");
	Если Параметры.Свойство("СоставТС") тогда
		//МассивТС = СтрРазделить(Параметры.СоставТС, ";", Ложь); 
		// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
		// Было:
		////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
		//МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТС), ";", Ложь); 
		////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец 
		//Стало:
		Если ТипЗнч(Параметры.СоставТС) = Тип("Массив") Тогда
			МассивТС = Параметры.СоставТС;	
		Иначе
		    МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТС), ";", Ложь);
		КонецЕсли;
		// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
		
		Для каждого Стр из МассивТС Цикл
			НСтр = ТЧ.Добавить();
			НСтр.Пометка = Истина;  
			// ДИТ ТА 71953 Сержантова А.С. Начало: 27.06.2023
			// Было:
			//НСтр.УчетнаяЕдиница = Справочники.ТС.НайтиПоНаименованию(Стр, Истина); 
			//Стало:
			Если ТипЗнч(Стр) = Тип("Строка") Тогда
				НСтр.УчетнаяЕдиница = Справочники.ТС.НайтиПоНаименованию(Стр, Истина);
			Иначе
				НСтр.УчетнаяЕдиница = Стр;	
			КонецЕсли
			// ДИТ ТА 71953 Сержантова А.С. Конец: 27.06.2023
		КонецЦикла;       
		//Евросиб - АСуслов 15.04.2022 15:12:42 #
		//(
		Если Параметры.Свойство("ПолныйСоставТС") Тогда   
			//ПолныйМассивТС = СтрРазделить(Параметры.ПолныйСоставТС, ";", Ложь); 
			// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
			// Было:
			////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
			//ПолныйМассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.ПолныйСоставТС), ";", Ложь); 
			////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец   
			//Стало:
			Если ТипЗнч(Параметры.ПолныйСоставТС) = Тип("Массив") Тогда
				ПолныйМассивТС = Параметры.ПолныйСоставТС;	
			Иначе
				ПолныйМассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.ПолныйСоставТС), ";", Ложь);
			КонецЕсли;
			// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
			МассивДополнительныхТС = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПолныйМассивТС, МассивТС);
			Для каждого Стр из МассивДополнительныхТС Цикл
				// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
				// Было:   
				//НСтр = ТЧ.Добавить();
				//НСтр.УчетнаяЕдиница = Справочники.ТС.НайтиПоНаименованию(Стр, Истина); 
				//Стало:
				Если ТипЗнч(Стр) = Тип("Строка") Тогда
					УчетнаяЕдиница = Справочники.ТС.НайтиПоНаименованию(Стр, Истина);
				Иначе
					УчетнаяЕдиница = Стр;
				КонецЕсли;  
				ЕстьСтроки = ТЧ.НайтиСтроки(Новый Структура("УчетнаяЕдиница", УчетнаяЕдиница));	
				Если ЕстьСтроки.Количество() = 0 Тогда
				    НСтр = ТЧ.Добавить();
					НСтр.УчетнаяЕдиница = УчетнаяЕдиница;
				КонецЕсли;
				// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
			КонецЦикла; 
		КонецЕсли;
		//)
		//Евросиб - АСуслов 15.04.2022 15:12:43 #
	ИначеЕсли Параметры.Свойство("СоставТЕ") тогда
		//ДИТ Шевченко US 66299 TA 74040 08.09.2023
		Если Параметры.Свойство("ЗапретРедактирования") Тогда
			ЗапретРедактирования = Параметры.ЗапретРедактирования;
			Элементы.ФормаДобавитьЗначения.Доступность = НЕ ЗапретРедактирования;
			Элементы.ФормаВыбратьВсе.Доступность = НЕ ЗапретРедактирования;
			Элементы.ФормаСнятьВыбор.Доступность = НЕ ЗапретРедактирования;
		КонецЕсли;	
		//ДИТ Шевченко US 66299 TA 74040 08.09.2023
		//МассивТС = СтрРазделить(Параметры.СоставТЕ, ";", Ложь);
		// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
		// Было:
		////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
		//МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТЕ), ";", Ложь); 
		////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец 
		// Стало:
		Если ТипЗнч(Параметры.СоставТЕ) = Тип("Массив") Тогда
			МассивТС = Параметры.СоставТЕ;	
		Иначе
		    МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТЕ), ";", Ложь);
		КонецЕсли;
		// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
		Для каждого Стр из МассивТС Цикл
			НСтр = ТЧ.Добавить();
			НСтр.Пометка = Истина;  
			// ДИТ ТА 71953 Сержантова А.С. Начало: 27.06.2023
			// Было:
			//НСтр.УчетнаяЕдиница = РаботаСКонтейнерамиСервер.НайтиКТК(Стр); // Справочники.ТЕ.НайтиПоНаименованию(Стр, Истина); 
			//Стало:
			Если ТипЗнч(Стр) = Тип("Строка") Тогда
			   НСтр.УчетнаяЕдиница = РаботаСКонтейнерамиСервер.НайтиКТК(Стр); // Справочники.ТЕ.НайтиПоНаименованию(Стр, Истина);
			Иначе
			   НСтр.УчетнаяЕдиница = Стр;
		   КонецЕсли;
			// ДИТ ТА 71953 Сержантова А.С. Конец: 27.06.2023
		КонецЦикла;
		//Евросиб - АСуслов 15.04.2022 15:12:42 #
		//(
		Если Параметры.Свойство("ПолныйСоставТЕ") Тогда   
			//ПолныйМассивТС = СтрРазделить(Параметры.ПолныйСоставТЕ, ";", Ложь);  
			// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
			// Было:
			////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
			//ПолныйМассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.ПолныйСоставТЕ), ";", Ложь); 
			////ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец 
			// Стало:
			Если ТипЗнч(Параметры.ПолныйСоставТЕ) = Тип("Массив") Тогда
				ПолныйМассивТС = Параметры.ПолныйСоставТЕ;	
			Иначе
				ПолныйМассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.ПолныйСоставТЕ), ";", Ложь);
			КонецЕсли;
			// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
			МассивДополнительныхТС = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПолныйМассивТС, МассивТС);
			Для каждого Стр из МассивДополнительныхТС Цикл
				// ДИТ ТА 71953 Сержантова А.С. Начало: 26.06.2023
				// Было:       
				//НСтр = ТЧ.Добавить();
				//НСтр.УчетнаяЕдиница = РаботаСКонтейнерамиСервер.НайтиКТК(Стр); // Справочники.ТЕ.НайтиПоНаименованию(Стр, Истина);
				//Стало:
				Если ТипЗнч(Стр) = Тип("Строка") Тогда
					УчетнаяЕдиница = РаботаСКонтейнерамиСервер.НайтиКТК(Стр); 
				Иначе
					УчетнаяЕдиница = Стр;
				КонецЕсли;    
				ЕстьСтроки = ТЧ.НайтиСтроки(Новый Структура("УчетнаяЕдиница", УчетнаяЕдиница));	
				Если ЕстьСтроки.Количество() = 0 Тогда
				    НСтр = ТЧ.Добавить();
					НСтр.УчетнаяЕдиница = УчетнаяЕдиница;
				КонецЕсли;
				// ДИТ ТА 71953 Сержантова А.С. Конец: 26.06.2023
			КонецЦикла; 
		КонецЕсли;
		//)
		//Евросиб - АСуслов 15.04.2022 15:12:43 #
	ИначеЕсли Параметры.Свойство("СоставТД") тогда
		//МассивТС = СтрРазделить(Параметры.СоставТД, ";", Ложь);  
		//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
		МассивТС = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(Параметры.СоставТД), ";", Ложь);   
		ДатаПоискаТранпортныхДокументов = ТекущаяДата();
		Если Параметры.Свойство("ДатаПоискаТранпортныхДокументов") И ЗначениеЗаполнено(Параметры.ДатаПоискаТранпортныхДокументов) Тогда
			ДатаПоискаТранпортныхДокументов = Параметры.ДатаПоискаТранпортныхДокументов;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
		Для каждого Стр из МассивТС Цикл
			НСтр = ТЧ.Добавить();
			НСтр.Пометка = Истина;
			//НСтр.УчетнаяЕдиница = Документы.ТранспортныйДокумент.НайтиПоНомеру(Стр, ТекущаяДата()); 
			//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
			НСтр.УчетнаяЕдиница = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(Стр, ДатаПоискаТранпортныхДокументов, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
			//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	МассивВыбранных = Новый Массив;
	Для каждого Стр из ТЧ Цикл 
		Если Стр.Пометка Тогда
			МассивВыбранных.Добавить(Стр.УчетнаяЕдиница); 
		КонецЕсли; 
	КонецЦикла;	
	Закрыть(МассивВыбранных);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСчетчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПослеУдаления(Элемент)
	
	ОбновитьСчетчик();
	
КонецПроцедуры

