
//Евросиб Коханенко Н.А. #61705 12.12.2022 (  

// Обработчик команды общей формы отчета.
Процедура ОткрытьОкноСИнструкциями(Форма, Команда) Экспорт 
	
	ИмяТипа = "";
	ИмяОбъекта = "";
	ИмяФормы = "";
	
	ИмяРасшифровка = Форма.ИмяФормы;
	ИмяРасшифровка = СтрРазделить(ИмяРасшифровка, ".");
	
	Если Форма.КлючСохраненияПоложенияОкна <> "" 
		//Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
		//и ИмяРасшифровка[0] = "Отчет" Тогда // только для отчета
		И (ИмяРасшифровка[0] = "Отчет" ИЛИ ИмяРасшифровка[0] = "ОбщаяФорма") 
		// только для отчета, в том числе использующего общую форму
		//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
	Тогда
    	КлючРасшифровка = Форма.КлючСохраненияПоложенияОкна;
		КлючРасшифровка = СтрРазделить(КлючРасшифровка, ".");
		КлючРасшифровка[1] = СтрЗаменить(КлючРасшифровка[1],"/КлючВарианта","");
		ИмяТипа = КлючРасшифровка[0];
		ИмяОбъекта = КлючРасшифровка[1];
		//Евросиб Коханенко Н.А. #65974 20.02.2023  (( 
		//Если ИмяРасшифровка[0] = "ОбщаяФорма"  Тогда
		//	ИмяФормы = ИмяРасшифровка[0]; // "ОбщаяФорма" 
		//КонецЕсли;
		//
		//Если КлючРасшифровка[КлючРасшифровка.Количество()-1] = "Основной" Тогда
		//	ИмяФормы = "ФормаОтчета"; 	
		//КонецЕсли;
		//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
		ИмяФормы = "ФормаОтчета";
	Иначе
		ИмяТипа = ИмяРасшифровка[0];
		ИмяОбъекта = ИмяРасшифровка[1];
		ИмяФормы = ИмяРасшифровка[ИмяРасшифровка.Количество()-1]; 	
	КонецЕсли;

	ПараметрыФормы = Новый Структура("ТипОбъекта", ИмяТипа);
	ПараметрыФормы.Вставить("НазваниеОбъекта", ИмяОбъекта);
	ПараметрыФормы.Вставить("НазваниеФормы", ИмяФормы);

	// Откроем форму с гиперссылками - инструкциями
	ОткрытьФорму("ОбщаяФорма.ФормаСИнструкциями", ПараметрыФормы, Форма, Ложь, , "");
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 12.12.2022 )



	

