 
 //Евросиб Коханенко Н.А. 16.10.2023 (( #76015 
Функция ПолучитьСписокФизЛицПоГруппеПользователей(ГруппаСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка В
		|			(ВЫБРАТЬ
		|				ГруппыПользователейСостав.Пользователь КАК Пользователь
		|			ИЗ
		|				Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|			ГДЕ
		|				ГруппыПользователейСостав.Ссылка = &ГруппаСсылка)";
	Запрос.УстановитьПараметр("ГруппаСсылка", ГруппаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
    Результат = РезультатЗапроса.Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("ФизическоеЛицо");
КонецФункции
//Евросиб Коханенко Н.А. 16.10.2023 )) #76015 
