Функция ПолучитьАктуальныйПоНаименованию(Наименование) Экспорт
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("НастройкаОтчетаПоЗапросу", Неопределено);
	СтруктураРезультат.Вставить("МасимальныйЗапрашиваемыйПериодОтчетаВДнях", Неопределено);
	СтруктураРезультат.Вставить("СоответствиеПараметровОтчета", Новый Соответствие);
	СтруктураРезультат.Вставить("СоответствиеПараметровКонтроляПериода", Новый Соответствие);
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
	СтруктураРезультат.Вставить("ОтключитьКонтрольМаксимальногоПериода", Ложь);
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОтчетовПоЗапросу.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.НастройкиОтчетовПоЗапросу КАК НастройкиОтчетовПоЗапросу
		|ГДЕ
		|	НастройкиОтчетовПоЗапросу.Наименование = &Наименование
		|	И НЕ НастройкиОтчетовПоЗапросу.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Ссылка.МасимальныйЗапрашиваемыйПериодОтчетаВДнях КАК СсылкаМасимальныйЗапрашиваемыйПериодОтчетаВДнях
		//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
		|	,ВТ.Ссылка.ОтключитьКонтрольМаксимальногоПериода КАК ОтключитьКонтрольМаксимальногоПериода
		//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.НаименованиеПараметраВходного КАК НаименованиеПараметраВходного,
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.НаименованиеПараметраОтчета КАК НаименованиеПараметраОтчета,
		|	НастройкиОтчетовПоЗапросуПараметрыОтчета.КонтрольДлиныПериода КАК КонтрольДлиныПериода
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОтчетовПоЗапросу.ПараметрыОтчета КАК НастройкиОтчетовПоЗапросуПараметрыОтчета
		|		ПО ВТ.Ссылка = НастройкиОтчетовПоЗапросуПараметрыОтчета.Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	Если НЕ РезультатЗапросаПакет[1].Пустой() Тогда
		//Ссылка на отчет
		Выборка = РезультатЗапросаПакет[1].Выбрать();
		Выборка.Следующий();
		СтруктураРезультат.НастройкаОтчетаПоЗапросу = Выборка.Ссылка;
		СтруктураРезультат.МасимальныйЗапрашиваемыйПериодОтчетаВДнях = Выборка.СсылкаМасимальныйЗапрашиваемыйПериодОтчетаВДнях;
		//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
		СтруктураРезультат.ОтключитьКонтрольМаксимальногоПериода = Выборка.ОтключитьКонтрольМаксимальногоПериода;
		//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
		
		//обработка параметров
		ТаблицаПараметровОтчета = РезультатЗапросаПакет[2].Выгрузить();
		Для Каждого ТекПараметр Из ТаблицаПараметровОтчета Цикл
			
			ВременноеСоответствие = Новый Соответствие;
			ВременноеСоответствие.Вставить(ТекПараметр.НаименованиеПараметраВходного, ТекПараметр.НаименованиеПараметраОтчета);
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(СтруктураРезультат.СоответствиеПараметровОтчета, ВременноеСоответствие);
			
			Если ЗначениеЗаполнено(ТекПараметр.КонтрольДлиныПериода) Тогда
				ВременноеСоответствие = Новый Соответствие;
				ВременноеСоответствие.Вставить(ТекПараметр.КонтрольДлиныПериода, ТекПараметр.НаименованиеПараметраВходного);
				ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(СтруктураРезультат.СоответствиеПараметровКонтроляПериода, ВременноеСоответствие);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

Функция РазделительПараметровДляСтандартногоПериода()
	Возврат ",";
КонецФункции

Функция КодФорматаДанныхДля1С() Экспорт
	Возврат 1;
КонецФункции

Функция КодФорматаДанныхДляСтороннейСистемы() Экспорт
	Возврат 2;
КонецФункции

Функция ПараметрДатыНачалаКонтролируемогоПериода() Экспорт
	Возврат "Дата начала контролируемого периода";
КонецФункции

Функция ПараметрДатыОкончанияКонтролируемогоПериода() Экспорт
	Возврат "Дата окончания контролируемого периода";
КонецФункции