//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОтчетовПоЗапросу.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиОтчетовПоЗапросу КАК НастройкиОтчетовПоЗапросу
		|ГДЕ
		|	НастройкиОтчетовПоЗапросу.Наименование = &Наименование
		|	И НЕ НастройкиОтчетовПоЗапросу.ПометкаУдаления
		|	И НастройкиОтчетовПоЗапросу.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Запись отменена, имеется элемент с аналогичным Наименованием и не помеченный на удаление", , "Объект.Наименование", , Отказ);
		
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
	Если НЕ ЭтотОбъект.ОтключитьКонтрольМаксимальногоПериода Тогда
	//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
	
		Если ЭтотОбъект.ПараметрыОтчета.Найти(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыНачалаКонтролируемогоПериода(), "КонтрольДлиныПериода") = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо установить дату начала контролируемого периода в <Контроль длины периода>", 
													, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПараметрыОтчета", 1, "КонтрольДлиныПериода"), , Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ПараметрыОтчета.Найти(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыОкончанияКонтролируемогоПериода(), "КонтрольДлиныПериода") = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо установить дату окончания контролируемого периода в <Контроль длины периода>", 
													, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПараметрыОтчета", 1, "КонтрольДлиныПериода"), , Отказ);
		КонецЕсли;
											
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец