&НаСервере
Процедура НайтиЗаявкиПоОтборуНаСервере(УдалитьДобавленныеЗаявки) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		|	ЗаявкаНаОплату.Ссылка КАК ЗаявкаНаОплату,
		|	ЗаявкаНаОплату.Контрагент КАК Контрагент,
		|	ЗаявкаНаОплату.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЗаявкаНаОплату.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
		|	ЗаявкаНаОплату.ВсегоПоЗаявке КАК СуммаПлатежаВВалюте,
		|	ЗаявкаНаОплату.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
		|	ЗаявкаНаОплату.ДоговорКонтрагента.УсловиеОплаты КАК УсловиеОплаты,
		|	ЗаявкаНаОплату.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|ГДЕ
		|	ЗаявкаНаОплату.ДатаПланируемойОплаты В(&ДатыОплаты)
		|	И ЗаявкаНаОплату.Проведен
		//Евросиб СубботинВ #89527 30.10.2024 Начало 
		|	И &ТекущиеУсловия
		|	И &ДопУсловия 
		// доп условия для подборов по видам реестра собираются ниже
		//Евросиб СубботинВ #89527 30.10.2024 Конец 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
		|ПОМЕСТИТЬ ВТ_СтатусыЗаявок
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
		|			,
		|			Объект В
		|				(ВЫБРАТЬ
		|					ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|				ИЗ
		|					ВТ_Заявки КАК ВТ_Заявки)) КАК СтатусыОбъектовСрезПоследних
		|ГДЕ
		|	СтатусыОбъектовСрезПоследних.Статус = &СтатусСогласован
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	ВТ_Заявки.Контрагент КАК Контрагент,
		|	ВТ_Заявки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВТ_Заявки.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
		|	ВТ_Заявки.СуммаПлатежаВВалюте КАК СуммаПлатежаВВалюте,
		|	ВТ_Заявки.Валюта КАК Валюта,
		|	ВТ_Заявки.УсловиеОплаты КАК УсловиеОплаты,
		|	ВТ_Заявки.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
		|   &СтатусСогласован КАК СтатусЗаявки
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыЗаявок КАК ВТ_СтатусыЗаявок
		|		ПО ВТ_Заявки.ЗаявкаНаОплату = ВТ_СтатусыЗаявок.Объект		
		|		Левое СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
		|		ПО ВТ_Заявки.Контрагент = МаршрутизацияКонтрагентыИДоговоры.Контрагент
		|       и МаршрутизацияКонтрагентыИДоговоры.Ссылка.ВидОперацииЗаявкиНаОплату = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные)
        |ГДЕ
		// контрагенты по списку маршрута должны быть только в одном случае, в остальных они попадают в исключения
		| 	Выбор 
		|	Когда &ТипРеестраПлатежей = ЗНАЧЕНИЕ(Перечисление.ТипыРеестраПлатежей.ОбщехозяйственнаяДеятельность)
		|	Тогда НЕ МаршрутизацияКонтрагентыИДоговоры.Ссылка ЕСТЬ NULL
		|	Иначе МаршрутизацияКонтрагентыИДоговоры.Ссылка ЕСТЬ NULL 
		|Конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|			ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка
		|		ПО ВТ_Заявки.ЗаявкаНаОплату = ЗаявкаНаОплатуДокументыНаОплату.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заявки.ЗаявкаНаОплату,
		|	СчетНаОплатуПоставщикаТовары.Номенклатура
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
		|			ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаТовары.Ссылка
		|		ПО ВТ_Заявки.ЗаявкаНаОплату = ЗаявкаНаОплатуДокументыНаОплату.Ссылка";
		

	
	ТзДатыОплаты = Объект.ВыбранныеДаты.Выгрузить(,"Дата");
	Запрос.УстановитьПараметр("ДатыОплаты", ТзДатыОплаты);
	Запрос.УстановитьПараметр("СтатусСогласован", Справочники.СтатусыДокументов.Согласована);
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало 
	Запрос.УстановитьПараметр("ТипРеестраПлатежей", Объект.ТипРеестраПлатежей);
	Запрос.УстановитьПараметр("ДопУсловия", Истина);
	Запрос.УстановитьПараметр("ТекущиеУсловия", Истина);
	МассивОтборов = Новый Массив;
	ЗаполнитьОтборыЗаявок(МассивОтборов);
	СчетчикУсловий = 0;
	
	Для Каждого Отбор из МассивОтборов Цикл
		Если СчетчикУсловий = 0 Тогда			
			СтрокаЗамены = СтрШаблон(" И ЗаявкаНаОплату.ВидОперации = (&%1)","ВидОперации" + СчетчикУсловий);
			Запрос.УстановитьПараметр("ВидОперации" + СчетчикУсловий, Отбор.ВидОперации);			
			Если Отбор.МассивПодразделений <> Неопределено Тогда
				СтрокаЗамены = СтрокаЗамены + СтрШаблон(" И %1 ЗаявкаНаОплату.ПодразделениеДКП В Иерархии (&%2)",
				 ?(Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке,"","НЕ"),  //парам шаблона 1
				 "СписокДКП" + СчетчикУсловий);//парам шаблона 2
				Запрос.УстановитьПараметр("СписокДКП" + СчетчикУсловий, Отбор.МассивПодразделений);
			КонецЕсли;
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекущиеУсловия", СтрокаЗамены);
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопУсловия", "ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ЗаявкаНаОплату.Ссылка КАК ЗаявкаНаОплату,
			|	ЗаявкаНаОплату.Контрагент КАК Контрагент,
			|	ЗаявкаНаОплату.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ЗаявкаНаОплату.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
			|	ЗаявкаНаОплату.ВсегоПоЗаявке КАК СуммаПлатежаВВалюте,
			|	ЗаявкаНаОплату.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
			|	ЗаявкаНаОплату.ДоговорКонтрагента.УсловиеОплаты КАК УсловиеОплаты,
			|	ЗаявкаНаОплату.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты
			|ИЗ
			|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
			|ГДЕ
			|	ЗаявкаНаОплату.ДатаПланируемойОплаты В(&ДатыОплаты)
			|	И ЗаявкаНаОплату.Проведен
			|	И &ТекущиеУсловия
			|	И &ДопУсловия");			
			СтрокаЗамены = СтрШаблон(" И ЗаявкаНаОплату.ВидОперации = (&%1)","ВидОперации" + СчетчикУсловий);
			Запрос.УстановитьПараметр("ВидОперации" + СчетчикУсловий, Отбор.ВидОперации);			
			Если Отбор.МассивПодразделений <> Неопределено Тогда
				СтрокаЗамены = СтрокаЗамены + СтрШаблон(" И %1 ЗаявкаНаОплату.ПодразделениеДКП В Иерархии (&%2)",
				 ?(Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке,"","НЕ"),  //парам шаблона 1
				 "СписокДКП" + СчетчикУсловий);//парам шаблона 2
				Запрос.УстановитьПараметр("СписокДКП" + СчетчикУсловий, Отбор.МассивПодразделений);
			КонецЕсли;
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекущиеУсловия", СтрокаЗамены);
		КонецЕсли;		
		СчетчикУсловий = СчетчикУсловий + 1;
	КонецЦикла;
	//Евросиб СубботинВ #89527 30.10.2024 Конец 

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если не РезультатЗапроса[2].Пустой() Тогда
		Если УдалитьДобавленныеЗаявки Тогда
			Объект.Заявки.Очистить();
		КонецЕсли;
		ТЗЗаявок  = РезультатЗапроса[2].Выгрузить();
		Для Каждого СтрокаТЗ из ТЗЗаявок Цикл 
			СтруктураПоиска = Новый Структура("ЗаявкаНаОплату", СтрокаТЗ.ЗаявкаНаОплату);
			Дубли =  Объект.Заявки.НайтиСтроки(СтруктураПоиска);
			Если Дубли.Количество() = 0 Тогда
				НоваяСтрока = Объект.Заявки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				НоваяСтрока.ПопадаетВОтборы = Истина;
				НоваяСтрока.СуммаПлатежаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСтрока.СуммаПлатежаВВалюте, НоваяСтрока.Валюта,
																			  	   ВалютаРегУчета, Объект.Дата);

			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Документ " + СтрокаТЗ.ЗаявкаНаОплату + " уже добавлен.");
			КонецЕсли;			
		КонецЦикла;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Заявок с датами планируемой оплаты, попадающих в выбранные периоды, в статусе «Согласована в DC» не найдено");
	КонецЕсли;
	
	Если не РезультатЗапроса[3].Пустой() Тогда
		ТЗУслуг = РезультатЗапроса[3].Выгрузить();
		Для Каждого СтрокаЗаявок Из Объект.Заявки Цикл
			СтруктураПоиска = Новый Структура("ЗаявкаНаОплату",СтрокаЗаявок.ЗаявкаНаОплату);
			УслугиПоЗаявке = ТЗУслуг.НайтиСтроки(СтруктураПоиска);
			МассивНоменклатур = Новый Массив;
			Для Каждого СтрокаУслуг из УслугиПоЗаявке Цикл
				Если ЗначениеЗаполнено(СтрокаУслуг.Номенклатура) Тогда
					МассивНоменклатур.Добавить(СтрокаУслуг.Номенклатура);
				КонецЕсли;
			КонецЦикла;
			СтрокаЗаявок.УслугиПТУСчет = СтрСоединить(МассивНоменклатур,";");
		КонецЦикла;
	КонецЕсли;
	СформироватьТаблицыДляОтбора(Истина);
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗаявкиПоОтбору(Команда)	
	
	Если НЕ Объект.ВыбранныеДаты.Количество()>0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать даты оплаты для заполнения реестра заявок на оплату");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать тип реестра для заполнения реестра заявок на оплату");
		Возврат;
	КонецЕсли;
	
	Если Объект.Заявки.Количество() > 0 Тогда
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Перезаполнить реестр");
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Дополнить реестр");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");		
		ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтаФорма);
		ПоказатьВопрос(ОпОп,"Реестр уже содержит документы. Выберите вариант заполнения.",СписокКнопок,,КодВозвратаДиалога.Да);		
		
	Иначе
		НайтиЗаявкиПоОтборуНаСервере(Истина);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте	
Процедура ОбработкаОтветаПользователя(ОтветПользователя = Неопределено, ДопПараметры = Неопределено)Экспорт

	Если ОтветПользователя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда // перезаполняем		
		НайтиЗаявкиПоОтборуНаСервере(Истина);
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.ОК Тогда  // дополняем новыми строками
		НайтиЗаявкиПоОтборуНаСервере(Ложь);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьЗаявкиВУПП(Команда)
//	ВыгрузитьЗаявкиВУППНаСервере();
КонецПроцедуры         

&НаСервере
Процедура ВыгрузитьЗаявкиВУППНаСервере()
	МассивСсылок = Новый Массив;   
	Для Каждого СтрЗаявки Из Объект.Заявки Цикл
		МассивСсылок.Добавить(СтрЗаявки.ЗаявкаНаОплату);
	КонецЦикла;
	ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(МассивСсылок, Перечисления.УзлыОбмена.УПП);
	ЕСОбменСервер.РегЗадание_ВыгрузкаЗаявокНаОплатуВУПП(МассивСсылок);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеДатыРеестраПриИзменении(Элемент)
	
	Если Объект.Заявки.Количество()>0 Тогда
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Продолжить");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");		
		ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяОчисткаЗаявок", ЭтаФорма, Новый Структура("Элемент", Элемент));
		ПоказатьВопрос(ОпОп,"Перед изменением выбранных дат реест будет очищен.", СписокКнопок,,КодВозвратаДиалога.Да);		
	Иначе
		Объект.ВыбранныеДаты.Очистить();
		Для Каждого Значение из ВыбранныеДатыРеестра цикл
			НовСтрока = Объект.ВыбранныеДаты.Добавить();
			НовСтрока.Дата = Значение.Значение;
		КонецЦикла;	
        ВыбранныеДатыРеестра.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		Объект.ВыбранныеДаты.Сортировать("Дата Возр");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.ВыбранныеДаты.Количество() Тогда 
		ВыбранныеДатыРеестра.Очистить();
		Для Каждого ЭлементСписка Из Объект.ВыбранныеДаты Цикл
			ВыбранныеДатыРеестра.Добавить(ЭлементСписка.Дата);
		КонецЦикла;
	КонецЕсли;
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок();
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	ЗаполнитьСтатусыДокументов();
	//Евросиб СубботинВ #89527 30.10.2024 Конец 
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	ОбновитьИтоги()
	//Евросиб СубботинВ #128538 23.01.2026 Конец	

	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокПриИзменении(Элемент)
	
	ОбновитьИтоги();
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок(); 
		
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаявокЗаявкаНаОплатуОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Заявки.ТекущиеДанные;
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	//ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеВыбранныхЗаявок(ВыбранноеЗначение)[0]);
	ДанныеЗаявки = ДанныеВыбранныхЗаявок(ВыбранноеЗначение)[0];
	Если ДанныеЗаявки.ЗаявкаНаОплату = Неопределено тогда
		Возврат
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) Тогда
		Объект.ТипРеестраПлатежей = ДанныеЗаявки.ТипРеестраПлатежей; 
		ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеЗаявки);
	Иначе
		//Если Объект.ТипРеестраПлатежей = ДанныеЗаявки.ТипРеестраПлатежей 
		//	или (ДанныеЗаявки.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")
		//	и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС"))
		//	или (ДанныеЗаявки.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление..ТипыРеестраПлатежей.ПретензииДКС")
		//	и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")) Тогда
		ЗаявкаМожетБытьВключенаВРесстр = Ложь;
		МассивВозможныхТиповЗаявок = Новый Массив;	
		ЗаполнитьОтборыЗаявок(МассивВозможныхТиповЗаявок);
		Для Каждого ТипЗаявки  из МассивВозможныхТиповЗаявок цикл
			Если ДанныеЗаявки.ТипРеестраПлатежей = ТипЗаявки.ТипРеестра 
			или (ДанныеЗаявки.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")
			и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС"))
			или (ДанныеЗаявки.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ПретензииДКС")
			и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")) Тогда 
			ЗаявкаМожетБытьВключенаВРесстр = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗаявкаМожетБытьВключенаВРесстр Тогда			
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеЗаявки); 
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ " + ДанныеЗаявки.ЗаявкаНаОплату + " не может быть добавлен в реестр с типом " + Объект.ТипРеестраПлатежей +".");
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	//Евросиб СубботинВ #89527 30.10.2024 Конец
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок();
	АктуализироватьСписокВыбранныхДат(ТекДанные.ДатаПланируемойОплаты);
	
КонецПроцедуры	

&НаСервере	
Функция ДанныеВыбранныхЗаявок(МассивСсылок)
	
	МассивСтруктурОтветов = Новый Массив;
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	//СтруктураОтвета = Новый Структура("ЗаявкаНаОплату, Контрагент, ДоговорКонтрагента,
	//								  |ОтветственныйЗаОплату, СуммаПлатежаРуб, СуммаПлатежаВВалюте,
	//								  //|Валюта,ДатаПланируемойОплаты,УсловиеОплаты, ПопадаетВОтборы, УслугиПТУСчет");
  //Евросиб СубботинВ #89527 30.10.2024 Конец
  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ЗаявкаНаОплату.Ссылка КАК ЗаявкаНаОплату,
	|	ЗаявкаНаОплату.Контрагент КАК Контрагент,
	|	ЗаявкаНаОплату.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкаНаОплату.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ЗаявкаНаОплату.ВсегоПоЗаявке КАК СуммаПлатежаВВалюте,
	|	ЗаявкаНаОплату.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
	|	ЗаявкаНаОплату.ДоговорКонтрагента.УсловиеОплаты КАК УсловиеОплаты,
	|	ЗаявкаНаОплату.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
	|	ИСТИНА КАК ПопадаетВОтборы
	//Евросиб СубботинВ #89527 30.10.2024 Начало 
	|	,Выбор Когда  ЗаявкаНаОплату.ВидОперации = Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий) и
	|				   ЗаявкаНаОплату.ПодразделениеДКП = Значение(Справочник.группыПользователей.ДепартаментКлиентскогоСервиса)
	|			Тогда Значение(Перечисление.ТипыРеестраПлатежей.ПретензииДКС)
	|          Когда  ЗаявкаНаОплату.ВидОперации = Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование) 
	|			Тогда Значение(Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов)
	|          Когда  ЗаявкаНаОплату.ВидОперации = Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные) 
	|			Тогда Значение(Перечисление.ТипыРеестраПлатежей.ОбщехозяйственнаяДеятельность)
	|          Когда  ЗаявкаНаОплату.ВидОперации = Значение(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаАренды) 
	|			Тогда Значение(Перечисление.ТипыРеестраПлатежей.АрендаВагонов)
	|         Иначе Значение(Перечисление.ТипыРеестраПлатежей.ОсновнойДМС)
	|    Конец
	|   КАК ТипРеестраПлатежей
	//Евросиб СубботинВ #89527 30.10.2024 Конец 
	|ИЗ
	|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|ГДЕ
	|	ЗаявкаНаОплату.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка КАК ЗаявкаНаОплату
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка В(&Ссылки)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПоставщикаТовары.Номенклатура,
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|		ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = СчетНаОплатуПоставщикаТовары.Ссылка
	|ГДЕ
	|	ЗаявкаНаОплатуДокументыНаОплату.Ссылка В(&Ссылки)"; 
	
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗаявка = РезультатЗапроса[0].Выбрать();
	Пока ВыборкаЗаявка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ЗаявкаНаОплату", ВыборкаЗаявка.ЗаявкаНаОплату);
		Дубли =  Объект.Заявки.НайтиСтроки(СтруктураПоиска);
		Если Дубли.Количество() = 0 Тогда 
			СтруктураОтвета = Новый Структура("ЗаявкаНаОплату, Контрагент, ДоговорКонтрагента, ТипРеестраПлатежей,
									  |ОтветственныйЗаОплату, СуммаПлатежаРуб, СуммаПлатежаВВалюте, Валюта,ДатаПланируемойОплаты,УсловиеОплаты, ПопадаетВОтборы, УслугиПТУСчет");

			ЗаполнитьЗначенияСвойств(СтруктураОтвета, ВыборкаЗаявка);
			СтруктураОтвета.СуммаПлатежаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаЗаявка.СуммаПлатежаВВалюте,ВыборкаЗаявка.Валюта,ВалютаРегУчета,Объект.Дата);
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Документ " + ВыборкаЗаявка.ЗаявкаНаОплату + " уже добавлен.");
			Продолжить
		КонецЕсли;			
		МассивНоменклатур = Новый Массив;
		Если не РезультатЗапроса[1].Пустой() Тогда
			ТЗУслуг = РезультатЗапроса[1].Выгрузить();
			УслугиПоЗаявке = ТЗУслуг.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаУслуг из УслугиПоЗаявке Цикл
				Если ЗначениеЗаполнено(СтрокаУслуг.Номенклатура) Тогда
					МассивНоменклатур.Добавить(СтрокаУслуг.Номенклатура);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		СтруктураОтвета.УслугиПТУСчет = СтрСоединить(МассивНоменклатур,";");
		МассивСтруктурОтветов.Добавить(СтруктураОтвета);
	КонецЦикла;
	Если МассивСтруктурОтветов.Количество()= 0 Тогда 
		СтруктураОтвета = Новый Структура("ЗаявкаНаОплату, Контрагент, ДоговорКонтрагента, ТипРеестраПлатежей,
									  |ОтветственныйЗаОплату, СуммаПлатежаРуб, СуммаПлатежаВВалюте, Валюта,ДатаПланируемойОплаты,УсловиеОплаты, ПопадаетВОтборы, УслугиПТУСчет");

		МассивСтруктурОтветов.Добавить(СтруктураОтвета);
	КонецЕсли;
	Возврат МассивСтруктурОтветов;
	
КонецФункции		

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	
	Для Каждого СтрокаЗаявки из Объект.Заявки Цикл
		СтрокаЗаявки.СуммаПлатежаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрокаЗаявки.СуммаПлатежаВВалюте, СтрокаЗаявки.Валюта, ВалютаРегУчета, Объект.Дата);
	КонецЦикла;	
	
	Объект.СуммаИтогоВРублях = Объект.Заявки.Итог("СуммаПлатежаРуб");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтборСтрок()
	
	Для Каждого СтрокаТЧ из Объект.Заявки Цикл
		СтрокаТЧ.ПопадаетВОтборы = Ложь;
	КонецЦикла;
	ОтборСтрок = Новый Структура("ПопадаетВОтборы", Истина);
	Элементы.Заявки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);

	
	ТаблицаЗаявок = Объект.Заявки.Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ВТ_Заявки.НомерСтроки КАК НомерСтроки,
	|	ВТ_Заявки.Контрагент КАК Контрагент,
	|	ВТ_Заявки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Заявки.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ВТ_Заявки.СуммаПлатежаВВалюте КАК СуммаПлатежаВВалюте,
	|	ВТ_Заявки.СуммаПлатежаРуб КАК СуммаПлатежаРуб,
	|	ВТ_Заявки.Валюта КАК Валюта,
	|	ВТ_Заявки.УсловиеОплаты КАК УсловиеОплаты,
	|	ВТ_Заявки.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	&ТаблицаЗаявок КАК ВТ_Заявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Заявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ВТ_Заявки.НомерСтроки КАК НомерСтроки,
	|	ВТ_Заявки.Контрагент КАК Контрагент,
	|	ВТ_Заявки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Заявки.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	ВТ_Заявки.СуммаПлатежаВВалюте КАК СуммаПлатежаВВалюте,
	|	ВТ_Заявки.Валюта КАК Валюта,
	|	ВТ_Заявки.УсловиеОплаты КАК УсловиеОплаты,
	|	ВТ_Заявки.СуммаПлатежаРуб КАК СуммаПлатежаРуб,
	|	ВТ_Заявки.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|ГДЕ
	|	&ДатаПланируемойОплаты
	|	и &УсловиеОплаты";
	
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	
	// отбор по датам
	МассивЗначенийПоДатам = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборДатаОплаты Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийПоДатам.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	//отборы по подразделениям
	МассивЗначенийПодразделений = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборПодразделение Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийПодразделений.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// отбор условие оплаты
	МассивЗначенийУсловийОплаты = Новый Массив;
	Для Каждого ЭлементСписка Из ОтборУсловиеОплаты Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЗначенийУсловийОплаты.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗначенийПоДатам.Количество() = 0 И МассивЗначенийПодразделений.Количество() = 0 И МассивЗначенийУсловийОплаты.Количество() = 0 Тогда 
		Возврат
	Иначе 	
		//параметр запроса по дате
		Если МассивЗначенийПоДатам.Количество() Тогда		
			Запрос.УстановитьПараметр("ДатаПланируемойОплаты", МассивЗначенийПоДатам);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПланируемойОплаты", "ВТ_Заявки.ДатаПланируемойОплаты В(&ДатаПланируемойОплаты)");
		Иначе
			Запрос.УстановитьПараметр("ДатаПланируемойОплаты", Истина);
		КонецЕсли;	
		//параметр запроса по подразделению
		Если МассивЗначенийПодразделений.Количество() Тогда
			Запрос.УстановитьПараметр("ОтборГруппаПользователей", МассивЗначенийПодразделений);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_Заявки КАК ВТ_Заявки",
			"ВТ_Заявки КАК ВТ_Заявки
			|	Внутреннее СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
			|	ПО (ГруппыПользователейСостав.Ссылка В (&ОтборГруппаПользователей))
			|	И (НЕ ГруппыПользователейСостав.Пользователь.Недействителен)
			|	И (НЕ ГруппыПользователейСостав.Пользователь.ПометкаУдаления)
			|	И (ВТ_Заявки.ЗаявкаНаОплату.ОтветственныйЗаОплату = ГруппыПользователейСостав.Пользователь)");
		КонецЕсли;
		// параметр запроса по условию оплаты
		Если МассивЗначенийУсловийОплаты.Количество() Тогда
			Запрос.УстановитьПараметр("УсловиеОплаты", МассивЗначенийУсловийОплаты);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОплаты", "ВТ_Заявки.УсловиеОплаты В (&УсловиеОплаты)");
		Иначе 
			Запрос.УстановитьПараметр("УсловиеОплаты", Истина);
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить(); 
		
		Для Каждого СтрокаРезультата из Результат Цикл
			Объект.Заявки[СтрокаРезультата.НомерСтроки-1].ПопадаетВОтборы = Истина;
		КонецЦикла; 	
		
		Элементы.СписокЗаявокСуммаПлатежаРуб.ТекстПодвала = Результат.Итог("СуммаПлатежаРуб"); 
	КонецЕсли;

КонецПроцедуры	

Процедура СформироватьТаблицыДляОтбора(ПроставитьПометкиПоДате = Ложь)
	
	ОтборДатаОплаты.Очистить();
	ТЗДаты = Объект.Заявки.Выгрузить(,"ДатаПланируемойОплаты");
	ТЗДаты.Свернуть("ДатаПланируемойОплаты");
	ТЗДаты.Сортировать("ДатаПланируемойОплаты Возр");
	Для Каждого ДатаОплаты из ТЗДаты Цикл
	//	Если ЗначениеЗаполнено(ДатаОплаты.ДатаПланируемойОплаты) Тогда
			ОтборДатаОплаты.Добавить(ДатаОплаты.ДатаПланируемойОплаты);
	//	КонецЕсли;
	КонецЦикла;
		
	ТЗОтветственные = Объект.Заявки.Выгрузить(,"ОтветственныйЗаОплату");
	ТЗОтветственные.Свернуть("ОтветственныйЗаОплату");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Ссылка КАК ГруппаПользователя
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь В(&Пользователи)
		|	И НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления
		|	И ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ(&ДКП)";
	
	Запрос.УстановитьПараметр("Пользователи", ТЗОтветственные);
	Запрос.УстановитьПараметр("ДКП", Справочники.ГруппыПользователей.ДирекцияКонтейнерныхПеревозок);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОтборПодразделение.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтборПодразделение.Добавить(ВыборкаДетальныеЗаписи.ГруппаПользователя);
	КонецЦикла;
	
	ОтборУсловиеОплаты.Очистить();
	ТЗДаты = Объект.Заявки.Выгрузить(,"УсловиеОплаты");
	ТЗДаты.Свернуть("УсловиеОплаты");
	Для Каждого ДатаОплаты из ТЗДаты Цикл 
	//	Если ЗначениеЗаполнено(ДатаОплаты.УсловиеОплаты) Тогда
			ОтборУсловиеОплаты.Добавить(ДатаОплаты.УсловиеОплаты);
	//	КонецЕсли;
	КонецЦикла;
	Если ПроставитьПометкиПоДате Тогда
		// ОтборУсловиеОплаты.ЗаполнитьПометки(Истина);
	    // ОтборПодразделение.ЗаполнитьПометки(Истина);
		 ОтборДатаОплаты.ЗаполнитьПометки(Истина);
	 КонецЕсли;
	 
КонецПроцедуры	                    

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	СформироватьОтборСтрок()
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОплатыПриИзменении(Элемент)	
	СформироватьОтборСтрок()
КонецПроцедуры

//установить пометки
&НаКлиенте
Процедура УсловияОплатыВыделитьВсе(Команда)
	УстановитьСнятьПометки("ОтборУсловиеОплаты", Истина)
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыделитьВсе(Команда)
 	УстановитьСнятьПометки("ОтборПодразделение", Истина)
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыВыделитьВсе(Команда)
  	УстановитьСнятьПометки("ОтборДатаОплаты", Истина)
КонецПроцедуры

//снять пометки
&НаКлиенте
Процедура УсловияОплатыСнятьВыделениеСтрок(Команда)
	УстановитьСнятьПометки("ОтборУсловиеОплаты", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияСнятьВыделениеСтрок(Команда)
 	УстановитьСнятьПометки("ОтборПодразделение", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыСнятьВыделениеСтрок(Команда)
  	УстановитьСнятьПометки("ОтборДатаОплаты", Ложь)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометки(СписокЗначений, ЗначениеПометки)
	
	Для Каждого СтрокаСписка из ЭтаФорма[СписокЗначений] Цикл
		СтрокаСписка.Пометка = ЗначениеПометки;
	КонецЦикла;
	СформироватьОтборСтрок()

КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаявок(Команда)
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	Если не ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен тип реестра для подбора заявок");
		Возврат;
	КонецЕсли;
	//Евросиб СубботинВ #89527 30.10.2024 Конец
	ОпОп = Новый ОписаниеОповещения("ОбработкаПодбораЗаявок", ЭтаФорма); 
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	СтруктураОтбора = Новый Структура("Статус",ПредопределенноеЗначение("Справочник.СтатусыДокументов.Согласована"));
    //Евросиб СубботинВ #89527 30.10.2024 Конец 
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало 
	//МассивОтборов = Новый Массив;
	//ЗаполнитьОтборыЗаявок(МассивОтборов);
	//
	//НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	//
	//Для Каждого Отбор из МассивОтборов Цикл		
	//	ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//	
	//	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидОперации");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = Отбор.ВидОперации;
	//	
	//	Если Отбор.МассивПодразделений <> Неопределено тогда
	//		
	//		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеДКП");
	//		ЭлементОтбора.ВидСравнения   = Отбор.ВидСравнения;
	//		ЭлементОтбора.Использование  = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Отбор.МассивПодразделений;			
	//	КонецЕсли;
	//КонецЦикла;		
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);	
	
	ОткрытьФорму("Документ.ЗаявкаНаОплату.ФормаВыбора",Новый Структура("МножественныйВыбор,Отбор",Истина,СтруктураОтбора),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    //Евросиб СубботинВ #89527 30.10.2024 Конец 

КонецПроцедуры

&НаКлиенте
Процедура ОтборУсловиеОплатыПриИзменении(Элемент)
	СформироватьОтборСтрок()
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаПодбораЗаявок(МассивСсылок = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если МассивСсылок = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	МассивВозможныхТиповЗаявок = Новый Массив;	
	ЗаполнитьОтборыЗаявок(МассивВозможныхТиповЗаявок);
	
	ДанныеПоСпискуЗаявок = ДанныеВыбранныхЗаявок(МассивСсылок);	
	Для Каждого СтрокаПоЗаявке из ДанныеПоСпискуЗаявок Цикл
		//Евросиб СубботинВ #89527 30.10.2024 Начало
		//НоваяСтрока = Объект.Заявки.Добавить();	
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоЗаявке);
		//АктуализироватьСписокВыбранныхДат(СтрокаПоЗаявке.ДатаПланируемойОплаты);		
		Если не ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) Тогда 
			НоваяСтрока = Объект.Заявки.Добавить();	
			Объект.ТипРеестраПлатежей = СтрокаПоЗаявке.ТипРеестраПлатежей; 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоЗаявке);
			АктуализироватьСписокВыбранныхДат(СтрокаПоЗаявке.ДатаПланируемойОплаты);	
		Иначе
			//	или (СтрокаПоЗаявке.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")
			//	и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС"))
			//	или (СтрокаПоЗаявке.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление..ТипыРеестраПлатежей.ПретензииДКС")
			//	и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")) Тогда
			ЗаявкаМожетБытьВключенаВРесстр = Ложь;
			Для Каждого ТипЗаявки  из МассивВозможныхТиповЗаявок цикл
				Если СтрокаПоЗаявке.ТипРеестраПлатежей = ТипЗаявки.ТипРеестра 
				или (СтрокаПоЗаявке.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")
				и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС"))
				или (СтрокаПоЗаявке.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ПретензииДКС")
				и Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")) Тогда
					ЗаявкаМожетБытьВключенаВРесстр = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЗаявкаМожетБытьВключенаВРесстр Тогда				
				НоваяСтрока = Объект.Заявки.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоЗаявке);
				АктуализироватьСписокВыбранныхДат(СтрокаПоЗаявке.ДатаПланируемойОплаты);	
			Иначе 
				ОбщегоНазначенияКлиент.СообщитьПользователю("Документ " + СтрокаПоЗаявке.ЗаявкаНаОплату + " не может быть добавлен в реестр с типом " + Объект.ТипРеестраПлатежей +".");
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
	//Евросиб СубботинВ #89527 30.10.2024 Конец

	КонецЦикла;
	СформироватьТаблицыДляОтбора(Истина);
	СформироватьОтборСтрок();

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
    //Евросиб СубботинВ #89527 30.10.2024 Конец

	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    ВалютаРегУчета =  Константы.ВалютаРегламентированногоУчета.Получить();
	
	 //Евросиб СубботинВ #89527 30.10.2024 Начало
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	УстановитьТекущийСтатусДокумента(); 
	//Евросиб СубботинВ #89527 30.10.2024 Конец

КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

Процедура АктуализироватьСписокВыбранныхДат(ДатаДляПроверки)
	
	Если НЕ ЗначениеЗаполнено(ДатаДляПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Дата",ДатаДляПроверки);
	РезультатПроверки = Объект.ВыбранныеДаты.НайтиСтроки(ПараметрыОтбора);
	Если РезультатПроверки.Количество() = 0 Тогда
		НоваяДата = Объект.ВыбранныеДаты.Добавить();
		НоваяДата.Дата = ДатаДляПроверки;
		Объект.ВыбранныеДаты.Сортировать("Дата Возр");
		Если Объект.ВыбранныеДаты.Количество() Тогда 
			ВыбранныеДатыРеестра.Очистить();
			Для Каждого ЭлементСписка Из Объект.ВыбранныеДаты Цикл
				ВыбранныеДатыРеестра.Добавить(ЭлементСписка.Дата);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	 	
КонецПроцедуры	

&НаКлиенте	
Процедура ОбработкаОтветаПользователяОчисткаЗаявок(ОтветПользователя = Неопределено, ДопПараметры = Неопределено)Экспорт
	
	Если ОтветПользователя = Неопределено Тогда
		Возврат;
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Отмена тогда
		ВыбранныеДатыРеестра.Очистить();
		Для Каждого ДатаПериодаРеестра из Объект.ВыбранныеДаты Цикл
			ВыбранныеДатыРеестра.Добавить(ДатаПериодаРеестра.Дата);
		КонецЦикла;	
		ВыбранныеДатыРеестра.СортироватьПоЗначению(НаправлениеСортировки.Возр);	
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Да Тогда // перезаполняем		
		Объект.Заявки.Очистить();
		СформироватьТаблицыДляОтбора();
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		//Объект.СуммаИтогоВРублях = 0;
		ИтогоКОплатеРубли = 0;
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		ВыбранныеДатыРеестраПриИзменении(ДопПараметры.Элемент);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СформироватьОтборСтрок();
	
	ЗаполнитьСтатусыДокументов();
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	ОбновитьИтоги()
	//Евросиб СубботинВ #128538 23.01.2026 Конец	
	
КонецПроцедуры


 //Евросиб СубботинВ #89527 30.10.2024 Начало
 
// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("МаршрутСогласования", Объект.МаршрутСогласования);;
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРеестрПлатежей(ПараметрыЗапроса, Объект.Дата);		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;		
		ОбновитьПанельСостояний();
		
	КонецЕсли;
 
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.ШаблонДокумента.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции
// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ
// - ОБЛАСТЬ СОСТОЯНИЯ 

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
		// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	ПроставитьЗакрытиеЗадач();
	//Евросиб СубботинВ #89527 30.10.2024 Конец
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб СубботинВ #89527 30.10.2024 Начало 
	Если СтатусДокумента <> СтатусДокументаПервичный Тогда
		РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(Объект.Ссылка, СтатусДокумента); 
		СтатусДокументаПервичный = СтатусДокумента; 
	КонецЕсли;

  //Евросиб СубботинВ #89527 30.10.2024 Конец 
КонецПроцедуры 

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
		// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);

		ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции 

&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	//Объект.Состояния.Загрузить(СогласованиеСервер.ПолучитьДанныеПоСостояниямОбъектаИзБазы(Объект.Ссылка));
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", СтатусДокумента);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусДокументаПервичный", СтатусДокументаПервичный);
	СтрокСсылки = Объект.Ссылка.Заявки.Выгрузить(, "ЗаявкаНаОплату");	
	СтрокиТекущий = Объект.Заявки.Выгрузить(, "ЗаявкаНаОплату");
	МассивСтрокиТекущие = Новый Массив;
	Для Каждого ТекущаяСтрока из СтрокиТекущий Цикл
		 МассивСтрокиТекущие.Добавить(ТекущаяСтрока.ЗаявкаНаОплату);
	 КонецЦикла;
	 
	МассивСтрокиСсылки = Новый Массив;
	Для Каждого СтрокаСсылка из СтрокСсылки Цикл
		Если ЗначениеЗаполнено(СтрокаСсылка.ЗаявкаНаОплату) тогда
			МассивСтрокиСсылки.Добавить(СтрокаСсылка.ЗаявкаНаОплату);
		КонецЕсли;
	КонецЦикла;
 
	СтрокиДляИСключения = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивСтрокиСсылки, МассивСтрокиТекущие);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ТаблицаИсключенныхЗаявок", СтрокиДляИсключения);
    //Евросиб СубботинВ #89527 30.10.2024 Конец

КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийСтатусДокумента()
	
	СтатусДокумента = Справочники.СтатусыДокументов.РеестрПодготовлен;
	
	ТекущийСтатус = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Объект.Ссылка));   
	
	Если ЗначениеЗаполнено(ТекущийСтатус.Статус) Тогда
		СтатусДокумента = ТекущийСтатус.Статус;  
	КонецЕсли; 
	
	Если не ЗначениеЗаполнено(СтатусДокументаПервичный) и ЗначениеЗаполнено(ТекущийСтатус.Статус) Тогда
		СтатусДокументаПервичный = СтатусДокумента;
	КонецЕсли;
	
		
	УстановитьВидимостьДоступность();

	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	//Евросиб СубботинВ #122650 18.11.2025 Начало
	
	Если СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрСогласован")
		или СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрУтвержден") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Статус устанавливается автоматически участниками согласования реестра. Ручная смена статуса не возможна");
    	СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение = СтатусДокумента;
		Возврат;
	ИначеЕсли СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") 
		и ВыбранноеЗначение <> ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрНаСогласование") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Установка выбранного статуса не доступна! Доступен статус ""На согласование""");
		СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение = СтатусДокумента;
		Возврат;
	ИначеЕсли (СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрНеСогласован") 
		или СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрНеУтвержден")) 
		и ВыбранноеЗначение <> ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для реестра в статусе ""Не согласован"" или  ""Не утвержден"" доступен только статус ""Подготовлен""");
		СтандартнаяОбработка = Ложь;
		Возврат;
		//Евросиб СубботинВ #126080 23.12.2025 Начало 
		//ИначеЕсли СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрНаСогласование")Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю("Ручная смена текущего статуса не возможна");
	ИначеЕсли СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрНаСогласование") и
		 ВыбранноеЗначение <> ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") Тогда
		 ОбщегоНазначенияКлиент.СообщитьПользователю("Для реестра в статусе ""На согласование"" доступен только статус ""Подготовлен""");
		//Евросиб СубботинВ #126080 23.12.2025 Конец
		СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение = СтатусДокумента;
		Возврат;	
	КонецЕсли;	
	//Евросиб СубботинВ #122650 18.11.2025 Конец
	
	Если НЕ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") Тогда
		Элементы.Заявки.ТолькоПросмотр = Истина;
		Элементы.ЗаявкиОтобратьИПодгрузитьЗаявки.Доступность = Ложь;
		Элементы.НайтиЗаявкиПоОтбору.Доступность = Ложь;
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен")
		и НЕ СтатусДокументаПервичный = ВыбранноеЗначение Тогда
		Объект.Состояния.Очистить();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	//Евросиб СубботинВ #122650 18.11.2025 Начало
	Если Не КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_СогласованиеРеестраПлатежей") И Не
		КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_УтверждениеРеестраПлатежей") Тогда
		Элементы.ТекущийИсполнитель_Статус.Доступность = Ложь;
	КонецЕсли;	
	//Евросиб СубботинВ #122650 18.11.2025 Конец
	
	Если СтатусДокумента <> ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") Тогда
		Элементы.Заявки.ТолькоПросмотр = Истина;
		Элементы.ЗаявкиОтобратьИПодгрузитьЗаявки.Доступность = Ложь;
		Элементы.НайтиЗаявкиПоОтбору.Доступность = Ложь;
	КонецЕсли;
	Если РольДоступна("ПолныеПрава") и СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрУтвержден") Тогда
		Элементы.СписокЗаявокВыгрузитьЗаявкиВУПП.Доступность = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокЗаявкаНаОплатуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	Если не ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен тип реестра для подбора заявок");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	//Евросиб СубботинВ #89527 30.10.2024 Конец
	
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Статус",ПредопределенноеЗначение("Справочник.СтатусыДокументов.Согласована"));
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало 
	//МассивОтборов = Новый Массив;
	//ЗаполнитьОтборыЗаявок(МассивОтборов);
	//
	//НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	//
	//ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.СтатусыДокументов.Согласована");
	//
	//
	//
	//Для Каждого Отбор из МассивОтборов Цикл		
	//	ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//	
	//	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидОперации");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = Отбор.ВидОперации;
	//	
	//	Если Отбор.МассивПодразделений <> Неопределено тогда
	//		
	//		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеДКП");
	//		ЭлементОтбора.ВидСравнения   = Отбор.ВидСравнения;
	//		ЭлементОтбора.Использование  = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Отбор.МассивПодразделений;			
	//	КонецЕсли;
	//КонецЦикла;		
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);	
	
	
    //Евросиб СубботинВ #89527 30.10.2024 Конец	
	ОткрытьФорму("Документ.ЗаявкаНаОплату.ФормаВыбора", Новый Структура("Отбор", СтруктураОтбора), Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
		
	Если Объект.Заявки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Очистить");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");		
		ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяИзменениеВидаОперации", ЭтаФорма, Новый Структура("ЗаполнениеНовымЗначением", Ложь));
		ПоказатьВопрос(ОпОп,"Реестр уже содержит документы. При изменении вида операции документ будет очищен..",СписокКнопок,,КодВозвратаДиалога.ОК);		
	КонецЕсли;
	
КонецПроцедуры 
	
&НаКлиенте	
Процедура ОбработкаОтветаПользователяИзменениеВидаОперации(ОтветПользователя = Неопределено, ДопПараметры = Неопределено)Экспорт

	Если ОтветПользователя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветПользователя = КодВозвратаДиалога.Ок Тогда // перезаполняем		
		Объект.Заявки.Очистить();
		ОбновитьИтоги();
		Если ДопПараметры.ЗаполнениеНовымЗначением тогда
			Объект.ТипРеестраПлатежей = ДопПараметры.НовоеЗначение;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ТипРеестраПлатежейОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Объект.Заявки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Очистить");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");		
		ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователяИзменениеВидаОперации", ЭтаФорма, Новый Структура("НовоеЗначение, ЗаполнениеНовымЗначением",ВыбранноеЗначение, Истина));
		ПоказатьВопрос(ОпОп,"Реестр уже содержит документы. При изменении типа реестра документ будет очищен..",СписокКнопок,,КодВозвратаДиалога.ОК);		
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ЗаполнитьОтборыЗаявок(МассивОтборов)
	
	Если Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС") Тогда                 
	//ОсновнойДМС
		МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС")));
		
		МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
												ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС")));		
		МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные"),
												Неопределено, Неопределено,ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС")));
		МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
												ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий"),
												ПредопределенноеЗначение("Справочник.ГруппыПользователей.ДепартаментКлиентскогоСервиса"),
											   	ВидСравненияКомпоновкиДанных.НеВСписке, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС")));
	//Общехоз										   
	ИначеЕсли Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОбщехозяйственнаяДеятельность") Тогда	
		МассивОтборов.Добавить(Новый Структура("ВидОперации,МассивПодразделений,ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщикуОбщехозяйственные"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОбщехозяйственнаяДеятельность")));   
	//Аренда	
	ИначеЕсли Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.АрендаВагонов") Тогда					
		МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаАренды"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.АрендаВагонов")));
    //СтрахованиеИПретензииДКС		
	ИначеЕсли Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС") Тогда
	    МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")));   

	   	МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий"),
												ПредопределенноеЗначение("Справочник.ГруппыПользователей.ДепартаментКлиентскогоСервиса"),
												ВидСравненияКомпоновкиДанных.ВСписке, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеИПретензииДКС")));	
	//Претензии	
	ИначеЕсли Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ПретензииДКС") Тогда
	   	МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий"),
												ПредопределенноеЗначение("Справочник.ГруппыПользователей.ДепартаментКлиентскогоСервиса"),
												ВидСравненияКомпоновкиДанных.ВСписке, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ПретензииДКС")));	
	//Страховка	
	ИначеЕсли Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов") Тогда
	    МассивОтборов.Добавить(Новый Структура("ВидОперации, МассивПодразделений, ВидСравнения, ТипРеестра",
											   	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявкиНаОплату.Страхование"),
												Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")));	
                                                //ПредопределенноеЗначение("Справочник.ГруппыПользователей.ДепартаментКлиентскогоСервиса"),
												//ВидСравненияКомпоновкиДанных.ВСписке, ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.СтрахованиеГрузов")));	
	КонецЕсли;
	
	Возврат МассивОтборов;
	
КонецФункции	

&НаКлиенте
Процедура СписокЗаявокЗаявкаНаОплатуПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтатусыДокументов()
	

	КолонкаЗаявки =  Объект.Заявки.Выгрузить(,"ЗаявкаНаОплату");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Евросиб СубботинВ #111466 09.06.2025 Начало
		//"ВЫБРАТЬ
		//|	СтатусыОбъектовСрезПоследних.Объект КАК ЗаявкаНаОплату,
		//|	СтатусыОбъектовСрезПоследних.Статус КАК СтатусЗаявки
		//|ПОМЕСТИТЬ Вт_Статусы
		//|ИЗ
		//|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект В (&КолонкаЗаявки)) КАК СтатусыОбъектовСрезПоследних
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	РеестрПлатежейЗаявки.Ссылка КАК Ссылка,
		//|	РеестрПлатежейЗаявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		//|ПОМЕСТИТЬ ВТ_Реестры
		//|ИЗ
		//|	Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
		//|ГДЕ
		//|	РеестрПлатежейЗаявки.ЗаявкаНаОплату В (&КолонкаЗаявки)
		//|	И НЕ РеестрПлатежейЗаявки.Отключена
		//|	И РеестрПлатежейЗаявки.Ссылка.Проведен
		//|	И НЕ РеестрПлатежейЗаявки.Ссылка = &Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	Вт_Статусы.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		//|	Вт_Статусы.СтатусЗаявки КАК СтатусЗаявки,
		//|	ВТ_Реестры.Ссылка КАК АктуальныйРеестр
		//|ИЗ
		//|	Вт_Статусы КАК Вт_Статусы
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реестры КАК ВТ_Реестры
		//|		ПО Вт_Статусы.ЗаявкаНаОплату = ВТ_Реестры.ЗаявкаНаОплату";
		
		"ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Объект КАК ЗаявкаНаОплату,
		|	СтатусыОбъектовСрезПоследних.Статус КАК СтатусЗаявки
		|ПОМЕСТИТЬ Вт_Статусы
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект В (&КолонкаЗаявки)) КАК СтатусыОбъектовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрПлатежейЗаявки.Ссылка КАК Ссылка,
		|	РеестрПлатежейЗаявки.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|ПОМЕСТИТЬ ВТ_Реестры
		|ИЗ
		|	Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
		|ГДЕ
		|	РеестрПлатежейЗаявки.ЗаявкаНаОплату В(&КолонкаЗаявки) 
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		//|	И НЕ РеестрПлатежейЗаявки.Отключена
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		|	И РеестрПлатежейЗаявки.Ссылка.Проведен
		|	И НЕ РеестрПлатежейЗаявки.Ссылка = &Ссылка
		|;
		|
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	ЗаявкиВключенныеВРеестр.Отключена КАК Отключена
		|ПОМЕСТИТЬ ВТ_СостояниеСтрокиРеестра
		|ИЗ
		|	РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
		|ГДЕ
		|	ЗаявкиВключенныеВРеестр.РеестрПлатежей = &Ссылка;
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		|ВЫБРАТЬ
		|	Вт_Статусы.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	Вт_Статусы.СтатусЗаявки КАК СтатусЗаявки,
		|	ВТ_Реестры.Ссылка КАК АктуальныйРеестр,
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		|	ВТ_СостояниеСтрокиРеестра.Отключена КАК СтрокаОтключена,
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		|	ВЫБОР
		|		КОГДА НЕ ПротоколОбменов.ДатаПланируемойОплаты ЕСТЬ NULL
		|				И НЕ ПротоколОбменов.ДатаПланируемойОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВЫРАЗИТЬ(Вт_Статусы.ЗаявкаНаОплату КАК Документ.ЗаявкаНаОплату).ДатаПланируемойОплаты = ПротоколОбменов.ДатаПланируемойОплаты
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИзмененаДатаОплатыУПП,
		|	ПротоколОбменов.ДатаПланируемойОплаты КАК ДатаПланируемойОплаты,
		|	Вт_Статусы.ЗаявкаНаОплату.ДатаПланируемойОплаты КАК ЗаявкаНаОплатуДатаПланируемойОплаты
		|ИЗ
		|	Вт_Статусы КАК Вт_Статусы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реестры КАК ВТ_Реестры
		|		ПО Вт_Статусы.ЗаявкаНаОплату = ВТ_Реестры.ЗаявкаНаОплату
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО Вт_Статусы.ЗаявкаНаОплату = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостояниеСтрокиРеестра КАК ВТ_СостояниеСтрокиРеестра
		|		ПО Вт_Статусы.ЗаявкаНаОплату = ВТ_СостояниеСтрокиРеестра.ЗаявкаНаОплату";
		//Евросиб СубботинВ #128538 23.01.2026 Конец
    	//Евросиб СубботинВ #111466 09.06.2025 Конец
	
	Запрос.УстановитьПараметр("КолонкаЗаявки", КолонкаЗаявки);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	 Выборка = Результат.Выбрать();
	 Пока Выборка.Следующий() Цикл 
		 СтруктураПоиска = Новый Структура("ЗаявкаНаОплату",Выборка.ЗаявкаНаОплату);
		 НайденныеСтроки = Объект.Заявки.НайтиСтроки(СтруктураПоиска);
		 Для Каждого НайденнаяСтрока из НайденныеСтроки цикл
			НайденнаяСтрока.СтатусЗаявки = Выборка.СтатусЗаявки;
			НайденнаяСтрока.АктуальныйРеестр = Выборка.АктуальныйРеестр;
			//Евросиб СубботинВ #111466 09.06.2025 Начло 
			НайденнаяСтрока.ИзмененаДатаОплатыУПП = Выборка.ИзмененаДатаОплатыУПП;
			//Евросиб СубботинВ #111466 09.06.2025 Конец 
			//Евросиб СубботинВ #128538 23.01.2026 Начало
            НайденнаяСтрока.Отключена = Выборка.СтрокаОтключена;
			//Евросиб СубботинВ #128538 23.01.2026 Конец              
		 КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры	


Процедура ПроставитьЗакрытиеЗадач()
	
	
	Для Каждого Этап из Объект.Состояния цикл
		Если Этап.Статус = Перечисления.СтатусыЭтапов.Выполнен и Не ЗначениеЗаполнено(Этап.СтатусСогласования) Тогда
			Этап.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры


&НаКлиенте
Процедура ТекущийИсполнитель_СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") тогда
		СтандартнаяОбработка = Ложь; 
		ЗапуститьНаСогласование(Неопределено);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для закрытия текущей задачи необходимо использовать процесс согласования, для указания причины отклонения");
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТипРеестраПлатежейПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТипРеестраПлатежей) Тогда
		Если Объект.ТипРеестраПлатежей = ПредопределенноеЗначение("Перечисление.ТипыРеестраПлатежей.ОсновнойДМС") Тогда
			Объект.МаршрутСогласования = ПредопределенноеЗначение("Перечисление.ВидыМаршрутовРеестраПлатежей.Основной")
		Иначе
			Объект.МаршрутСогласования = ПредопределенноеЗначение("Перечисление.ВидыМаршрутовРеестраПлатежей.Дополнительный")
		КонецЕсли;
	Иначе
		Объект.МаршрутСогласования = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры
//Евросиб СубботинВ #89527 30.10.2024 Конец  

//Евросиб СубботинВ #89527 30.10.2024 Начало
&НаСервере
Процедура ОбновитьИтоги()
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало	
	//Документы.РеестрПлатежей.ОбновитьИтоги(Объект);
	ПараметрыОтбора = Новый Структура("Отключена", Ложь);
	АктивныеСтроки = Объект.Заявки.Выгрузить(ПараметрыОтбора);
	ИтогоКОплатеРубли = АктивныеСтроки.Итог("СуммаПлатежаРуб");
	//Евросиб СубботинВ #128538 23.01.2026 Конец

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокЗаявокЗаявкаНаОплату" и НЕ СтатусДокумента = ПредопределенноеЗначение("Справочник.СтатусыДокументов.РеестрПодготовлен") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаявкаТекущейСтроки = Элементы.Заявки.ТекущиеДанные.ЗаявкаНаОплату;
		ПоказатьЗначение(,ЗаявкаТекущейСтроки);
		//ОткрытьФорму("Документ.ЗаявкаНаОплату.Форма.ФормаДокумента", Новый Структура("ЗаявкаТекущейСтроки, ТаблицаСвязанныхСтрок", ОснованиеДляПлатежаТекущейСтроки, СвязанныеПТУ),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Поле.Имя = "ЗаявкиАктуальныйРеестр" Тогда
		СтандартнаяОбработка = Ложь;
		РеестрТекущейСтроки = Элементы.Заявки.ТекущиеДанные.АктуальныйРеестр;
		ПоказатьЗначение(,РеестрТекущейСтроки);	
	КонецЕсли;

КонецПроцедуры
 //Евросиб СубботинВ #89527 30.10.2024 Конец  
 
 &НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать(); 
		//ПолучитьПоследнийСтатус();
		УстановитьТекущийСтатусДокумента();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры 

//Функция ПолучитьПоследнийСтатус()
//	
//	ПоследнийСтатус = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", Объект.Ссылка));   

//	Если ЗначениеЗаполнено(ПоследнийСтатус.Статус) Тогда
//		СтатусДокументаПервичный = ПоследнийСтатус.Статус; 
//		СтатусДокумента = ПоследнийСтатус.Статус; 
//	КонецЕсли;
//	
//КонецФункции


