Процедура ЗаписатьПараметрыФормированияФинДокументов(Знач ИсточникПараметров) Экспорт
	
	Если ТипЗнч(ИсточникПараметров) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Документ = ИсточникПараметров;
		ИсточникПараметров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПравилоФормирования");
		ОбновлятьПараметры = Ложь;
	Иначе
		Документ = ИсточникПараметров;
		ОбновлятьПараметры = Истина;
	КонецЕсли;
	мз = РегистрыСведений.ФормированиеФинДокументов.СоздатьМенеджерЗаписи();
	мз.Документ = Документ;
	мз.Прочитать();
	Если НЕ мз.Выбран() ИЛИ ОбновлятьПараметры Тогда
		мз.Документ = Документ;
		ЗаполнитьЗначенияСвойств(мз, ИсточникПараметров);                                        
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		Если ТипЗнч(ИсточникПараметров) = Тип("СправочникСсылка.ФормированиеФинДокументов") Тогда
			мз.ФормированиеФинДокументовСсылка = ИсточникПараметров;                                 
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
	КонецЕсли;                                            
	мз.Записать();
	
КонецПроцедуры
