
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипЗначенияСписка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТипЗначенияСписка", Неопределено);
	Если ТипЗначенияСписка <> Неопределено Тогда	
		Список.ТипЗначения = Параметры.ТипЗначенияСписка;		
	КонецЕсли;
	
	ТекущийСписок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТекущийСписок", Неопределено);
	Если ЗначениеЗаполнено(ТекущийСписок) Тогда
		
		ТипСписка = ТипЗнч(ТекущийСписок);
		Если ТипСписка = Тип("Массив") Тогда
			Список.ЗагрузитьЗначения(ТекущийСписок);
		Иначе
			Для каждого Стр Из ТекущийСписок Цикл			
				Список.Добавить(Стр.Значение, Стр.Представление, Стр.Пометка, Стр.Картинка);			
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	Элементы.СписокЗначение.Видимость = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПоказыватьЗначение", Истина);
	Элементы.СписокПометка.Видимость = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПоказыватьПометку", Ложь);	
	Элементы.СписокПредставление.Видимость = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПоказыватьПредставление", Ложь);
	
	Элементы.Список.ИзменятьСоставСтрок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзменятьСоставСтрок", Истина);
	Элементы.Список.ИзменятьПорядокСтрок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзменятьПорядокСтрок", Истина);
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	ТипоразмерДругое = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТипоразмерДругое", ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка"));
	
	Если ЗначениеЗаполнено(ТипоразмерДругое) Тогда
		Для Каждого сЗнч Из Список Цикл
			Если сЗнч.Значение = ТипоразмерДругое Тогда
				ТипоразмерДругоеВыбран = сЗнч.Пометка;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СписокРезультат = Новый СписокЗначений;
	Для Каждого Элемент Из Список Цикл
		СписокРезультат.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка, Элемент.Картинка);
	КонецЦикла;
	
	Закрыть(СписокРезультат);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПометкаПриИзменении(Элемент) //Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	Если ЗначениеЗаполнено(ТипоразмерДругое) Тогда
		ТекЭлемент = Элементы.Список.ТекущиеДанные;
		Если ТекЭлемент.Значение = ТипоразмерДругое Тогда
			Для Каждого сЗнч Из Список Цикл
				Если сЗнч.Значение = ТипоразмерДругое Тогда
					ТипоразмерДругоеВыбран = сЗнч.Пометка;
					Продолжить;
				КонецЕсли;	
				сЗнч.Пометка = Ложь;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

