
#Область ОбработчикиСобытийФормы


#КонецОбласти

 #Область ОбработчикиСобытийЭлементовШапкиФормы
 
 &НаКлиенте
Процедура РассчитатьКоличествоВагоновНеВРефах(Команда)
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	РассчитатьКоличествоВагоновНеВРефахНаСервере();
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
КонецПроцедуры
 
 #КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьКоличествоВагоновНеВРефахНаСервере()
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВагоныВРефСцепах.Вагон) КАК Количество
		|ИЗ
		|	РегистрСведений.ВагоныВРефСцепах КАК ВагоныВРефСцепах
		|ГДЕ
		|	ВагоныВРефСцепах.РефСцеп = ЗНАЧЕНИЕ(Справочник.РефСцепы.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КоличествоВагоновНеВРефах = ВыборкаДетальныеЗаписи.Количество;
	Иначе
		КоличествоВагоновНеВРефах = 0;
	КонецЕсли;
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецПроцедуры

// +++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
&НаКлиенте
Процедура СоздатьДокументРефСцеп(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СоздатьНовыйДокументРефСцеп(ТекущиеДанные.РефСцеп);

КонецПроцедуры 

// 
&НаКлиенте
Процедура ОповещениеЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СоздатьНовыйДокументРефСцеп(ПараметрыЗаписи.РефСцеп);
	КонецЕсли;

КонецПроцедуры	
	
&НаКлиенте
Процедура СоздатьНовыйДокументРефСцеп(РефСцеп)

	Если не ЗначениеЗаполнено(РефСцеп) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя создавать документы с незаполненным Реф.сцепом.");
		Возврат;	
	КонецЕсли;	
	
	ЗначенияЗаполнения = Новый Структура("РефСцеп", РефСцеп);
    ПараметрыФормы 	   = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);

	ПараметрыФормы = Новый Структура("Основание", РефСцеп);
	
	Открытьформу("Документ.РефСцеп.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СоздатьДокументРефСцеп.Видимость = РольДоступна("ПолныеПрава") 
		или РольДоступна("dc_УправлениеРефСцепами");
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ДокументРефСцеп) Тогда
			ОткрытьЗначение(Элементы.Список.ТекущиеДанные.ДокументРефСцеп);        
		КонецЕсли;
	Исключение
	КонецПопытки;		
КонецПроцедуры

#КонецОбласти




