//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
Перем КлючевыеПоляДляЗапросаНаАвтоперевозкуИзменены;
//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
		Создано = ТекущаяДата();
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕсли;
	
	//Евросиб Гудкова( 03.01.2020 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.э_Накладная")
		//Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументОбъект.э_Накладная")
		Тогда
		//ДатаПрибытия = ДанныеЗаполнения.ДатаИВремяПрибытияГруза;
		//ДатаРаскредитации = ДанныеЗаполнения.ДатаИВремяРаскредитованияГруза;
		//ДатаОтправления = ДанныеЗаполнения.ДатаИВремяОтправленияГруза; 
		//Дата = ДанныеЗаполнения.Дата;
		//НомерТранспортногоДокумента = ДанныеЗаполнения.Номер;
		//ДатаТранспортногоДокумента = ДанныеЗаполнения.Дата;
		//ВыборкаСтанцияОтправления = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.Выбрать(Новый Структура("СпрЭтрана", ДанныеЗаполнения.СтанцияОтправления));
		//ВыборкаСтанцияНазначения = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.Выбрать(Новый Структура("СпрЭтрана", ДанныеЗаполнения.СтанцияНазначения));
		//Если ВыборкаСтанцияНазначения.Следующий() Тогда
		//	СтанцияНазначения = ВыборкаСтанцияНазначения.СпрДатакор;
		//КонецЕсли; 
		//Если ВыборкаСтанцияОтправления.Следующий() Тогда
		//	СтанцияОтправления = ВыборкаСтанцияОтправления.СпрДатакор;
		//КонецЕсли;                               
		НакладнаяЭТРАН 				= ДанныеЗаполнения.Ссылка;                                     
		Реквизиты 					= "Дата, Номер, ДатаИВремяПрибытияГруза, ДатаИВремяРаскредитованияГруза, ДатаИВремяОтправленияГруза, СтанцияОтправления, СтанцияНазначения";
		РеквизитыЗаполнения 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, Реквизиты);
		Контрагент 					= ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтрагентДляЖДН");
		ВидОперации 				= Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная;
		ДатаПрибытия 				= РеквизитыЗаполнения.ДатаИВремяПрибытияГруза;
		ДатаРаскредитации 			= РеквизитыЗаполнения.ДатаИВремяРаскредитованияГруза;
		ДатаОтправления 			= РеквизитыЗаполнения.ДатаИВремяОтправленияГруза; 
		Дата 						= РеквизитыЗаполнения.Дата;
		НомерТранспортногоДокумента = РеквизитыЗаполнения.Номер;
		ДатаТранспортногоДокумента 	= РеквизитыЗаполнения.Дата;
		МассивСоответствий = Новый Массив;
		МассивСоответствий.Добавить(РеквизитыЗаполнения.СтанцияОтправления);
		МассивСоответствий.Добавить(РеквизитыЗаполнения.СтанцияНазначения);
		СоответствиеЭтранДатакор 	= ПолучитьСопоставлениеЭтранДатакор(МассивСоответствий);
		//ДИТ Давудов М.А. US 64009 12.01.2024 Начало
		Если ДополнительныеСвойства.Свойство("СтанцияОтправления")
		   И ЗначениеЗаполнено(ДополнительныеСвойства.СтанцияОтправления) Тогда
			СтанцияОтправления = ДополнительныеСвойства.СтанцияОтправления;
		Иначе
			//ок(
		СтанцияОтправления 			= СоответствиеЭтранДатакор.Получить(РеквизитыЗаполнения.СтанцияОтправления);
			//ок)
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("СтанцияНазначения")
		   И ЗначениеЗаполнено(ДополнительныеСвойства.СтанцияНазначения) Тогда
			СтанцияНазначения = ДополнительныеСвойства.СтанцияНазначения;
		Иначе
			//ок(
		СтанцияНазначения 			= СоответствиеЭтранДатакор.Получить(РеквизитыЗаполнения.СтанцияНазначения);
			//ок)
		КонецЕсли;
		//ДИТ Давудов М.А. US 64009 12.01.2024 Конец
		 
		ЗаполнитьУчетныеЕдиницы(ДанныеЗаполнения);
		
		//++ Зубов 03.08.2021 35854
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Букинг") Тогда
		ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент;
		Дата = ДанныеЗаполнения.Дата;
		Букинг = ДанныеЗаполнения.Ссылка;
		//++ Зубов 0228547 20.09.2021
		//Контрагент = Константы.СибурКонтрагент.Получить();
		Контрагент = ДанныеЗаполнения.Контрагент;
		//-- Зубов 0228547 20.09.2021
		СтанцияОтправления = ДанныеЗаполнения.ПортОтправления;
		СтанцияНазначения = ДанныеЗаполнения.ПортНазначения;
		МорскойРейс = ДанныеЗаполнения.Рейс;
		Судно = ДанныеЗаполнения.Рейс.Судно;
		МорскаяЛиния = ДанныеЗаполнения.Линия;
		НомерТранспортногоДокумента = ДанныеЗаполнения.НомерБукинга;
		НомерБукинга = ДанныеЗаполнения.НомерБукинга;
		ДатаОтправленияПлан = ДанныеЗаполнения.ДатаОтправленияПоРасписанию;
		ДатаПрибытияПлан = ДанныеЗаполнения.ДатаПрибытияПоРасписанию;
		//-- Зубов 03.08.2021 35854
	КонецЕсли; 
	// Евросиб Гудкова)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0394405, 10-04-2025, начало
	КлючевыеПоляДляЗапросаНаАвтоперевозкуИзменены = ПроверитьИзменениеКлючевыхПолейДляЗапросаНаАвтоперевозку();
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0394405, 10-04-2025, конец
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 96893 TA 98138 15.01.2025
	Если ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
		//Если ЗначениеЗаполнено(НомерТранспортногоДокумента) Тогда	
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0386415, 10-02-2025, начало
		//1) проверка обязательна для нового документа
		//2) проверка обязательна при смене номера транспортного документа
		//3) проверка не нужна, если документ уже записан и номер не поменялся - чтобы работали старые дубли, которые уже используются в документах
		ПроверятьДубли = Ложь;
		Если ЗначениеЗаполнено(НомерТранспортногоДокумента) Тогда
			ИзменилсяНомерТранспортногоДокумента = СокрЛП(НомерТранспортногоДокумента) <> СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерТранспортногоДокумента"));
			ПроверятьДубли = ЭтоНовый() Или ИзменилсяНомерТранспортногоДокумента;
		КонецЕсли;
		Если ПроверятьДубли Тогда
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0386415, 10-02-2025, конец
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ТранспортныйДокумент.Ссылка КАК Ссылка
			//|ИЗ
			//|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
			//|ГДЕ
			//|	СОКРЛП(ТранспортныйДокумент.НомерТранспортногоДокумента) = &НомерТранспортногоДокумента
			//|	И ТранспортныйДокумент.Ссылка <> &Ссылка";
			//Запрос.УстановитьПараметр("Ссылка", Ссылка);
			//Запрос.УстановитьПараметр("НомерТранспортногоДокумента", СокрЛП(НомерТранспортногоДокумента));
			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	Сообщить("Коносамент с таким номером уже существует");
			//	Отказ = Истина;
			//	Прервать;
			//КонецЦикла;	
			
			//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
			РезультатПроверки = Документы.ТранспортныйДокумент.НайтиДублирующийДокумент(Ссылка, НомерТранспортногоДокумента);
			Если РезультатПроверки.ЕстьДубль Тогда
				ОбщегоНазначения.СообщитьПользователю("Коносамент с таким номером уже существует");
				Отказ = Истина;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
		КонецЕсли;	
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 96893 TA 98138 15.01.2025
	
	//Субботин 75158 13.10.2023 начало
	Если ПометкаУдаления = Истина И НЕ РольДоступна("ПолныеПрава") Тогда
		ИсточникиФормированияОбъекта = РегистрыСведений.ПротоколОбменов.ПолучитьУзлыОбменаОбъектаПротоколаОбмена(Ссылка, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
		Если ИсточникиФормированияОбъекта <> Неопределено Тогда 
			Если ИсточникиФормированияОбъекта.Найти(Перечисления.УзлыОбмена.DX, "УзелОбмена") <> Неопределено Тогда
				ОбщегоНазначения.СообщитьПользователю("Удаление документа загруженного из DX запрещено");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Субботин 75158 13.10.2023 Конец 
	
	//Евросиб - АСуслов 13.10.2022 15:32:58 #58943
	//(
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЗначениеЗаполнено(НакладнаяЭТРАН) 
			И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НакладнаяЭТРАН, "ТекущееСостояниеНакладнойДействующийСтатус") 
			И НЕ РольДоступна("ПолныеПрава") Тогда
			ОбщегоНазначения.СообщитьПользователю("Накладная ЭТРАН не имеет действующий статус. Проведение документа запрещено.",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 13.10.2022 15:32:59 #
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	// + Состояния
	
	//Евросиб Каблов 20.07.2020 (
	СибурИзменилЗаявку = Ложь;
	СибурИзмененияЗаявки = Неопределено;
	Если ДополнительныеСвойства.Свойство("СибурИзмененияЗаявки", СибурИзмененияЗаявки) Тогда
		СибурИзменилЗаявку = Истина;		
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )

	// Маршрутизация заявки
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ Состояния.Количество() = 0 ИЛИ
	//Евросиб Каблов 20.07.2020 (
	Ссылка.СтатусКоносаментаСибур <> СтатусКоносаментаСибур И СибурИзменилЗаявку;
	//Евросиб Каблов 20.07.2020 )
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Неопределено);
		ПараметрыЗапроса.Вставить("УказанРейс", Ложь);
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Ложь);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Неопределено);
		ПараметрыЗапроса.Вставить("ПротоколНеУказан", Истина);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьТД(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//Евросиб Каблов 20.07.2020 (
	Если СибурИзменилЗаявку Тогда
		СтрокаСостояния = Состояния.Найти(Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента, "Состояние");
		Если СтрокаСостояния <> Неопределено Тогда
			СтрокаСостояния.Комментарий = СибурИзмененияЗаявки.Комментарий;
			СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//++ Зубов 35844 04.08.2021
	//	//Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	////Стаценко
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//-- Зубов 35844 04.08.2021
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И НЕ Стр.ТребуетсяУказатьИсполнителя Тогда 
			Стр.Исполнитель = Пользователи.ТекущийПользователь(); 
		//ИначеЕсли НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
		//	Сообщить("Требуется указать исполнителя");
		//	Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И НЕ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			Стр.Наблюдатель = Пользователи.ТекущийПользователь(); 
		//ИначеЕсли НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
		//	Сообщить("Требуется указать наблюдателя");
		//	Отказ = Истина;
		КонецЕсли;
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, пользователи.ТекущийПользователь());
	
	// - Состояния
	Если Не ЭтоНовый() Тогда
		ЗаполнитьСсылкиВагоновИКонтейнеровПоНомерам(); //ДИТ Шевченко А.В. 59059 19.12.2022
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		ПолучитьСделкиДляАктуализации(); //ДИТ Шевченко А.В. 69796 23.01.2023
	КонецЕсли;
	
	//Субботин 80722 07.02.2024 начало 
	Для Каждого СтрокаКоносамента из Коносаменты Цикл
		Если Не ЗначениеЗаполнено(СтрокаКоносамента.ГУИДСтроки) Тогда
			 СтрокаКоносамента.ГУИДСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;	 
	КонецЦикла;
	//Субботин 80722 07.02.2024 Конец 
	
	//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
	//КлючевыеПоляДляЗапросаНаАвтоперевозкуИзменены = ПроверитьИзменениеКлючевыхПолейДляЗапросаНаАвтоперевозку(); //Евросиб(ДИТ), Беляев СЮ, Ticket#0394405, 10-04-2025, закомментировал, перенес выше
	//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
	
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	Если ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
		
		ПоставитьВОчередь = НЕ ОбщегоНазначения.КоллекцииИдентичны(Ссылка.Коносаменты.Выгрузить(), Коносаменты.Выгрузить(), "НомерКТК",,Истина)
							ИЛИ Ссылка.МестоПолученияГруза <> МестоПолученияГруза ИЛИ Ссылка.МестоПоставкиГруза <> МестоПоставкиГруза
							ИЛИ Ссылка.СтанцияОтправления <> СтанцияОтправления ИЛИ Ссылка.СтанцияНазначения <> СтанцияНазначения;
		
		Если ПоставитьВОчередь Тогда
			ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(Ссылка);		
		КонецЕсли;	
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 110215 TA 128335 17.03.2026
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиВагоновИКонтейнеровПоНомерам() //ДИТ Шевченко А.В. 59059 19.12.2022
	
	ТЗКонтейнеры = УчетныеЕдиницы.Выгрузить(,"НомерСтроки,НомерКонтейнера");
	ТЗВагоны 	 = УчетныеЕдиницы.Выгрузить(,"НомерСтроки,НомерВагона");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗКонтейнеры.НомерСтроки КАК НомерСтроки,
		|	ТЗКонтейнеры.НомерКонтейнера КАК НомерКонтейнера
		|ПОМЕСТИТЬ ВТ_Контейнеры
		|ИЗ
		|	&ТЗКонтейнеры КАК ТЗКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗВагоны.НомерСтроки КАК НомерСтроки,
		|	ТЗВагоны.НомерВагона КАК НомерВагона
		|ПОМЕСТИТЬ ВТ_Вагоны
		|ИЗ
		|	&ТЗВагоны КАК ТЗВагоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТС.Ссылка КАК Ссылка,
		|	ТС.Наименование КАК Наименование,
		|	ЕСТЬNULL(ТипТССсылка.Вагон, ЛОЖЬ) КАК ТипТСВагон
		|ПОМЕСТИТЬ ВТ_ВагоныСсылки
		|ИЗ
		|	ВТ_Вагоны КАК ВТ_Вагоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипТССсылка
		|			ПО (ТипТССсылка.Ссылка = ТС.ТипТС)
		|		ПО (ТС.Наименование = ВТ_Вагоны.НомерВагона)
		|			И (НЕ ТС.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВагоныСсылки.Наименование КАК Наименование,
		|	МАКСИМУМ(ВТ_ВагоныСсылки.ТипТСВагон) КАК ТипТСВагон
		|ПОМЕСТИТЬ ВТ_ВагоныПоТипу
		|ИЗ
		|	ВТ_ВагоныСсылки КАК ВТ_ВагоныСсылки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВагоныСсылки.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_ВагоныСсылки.Ссылка) КАК Ссылка,
		|	ВТ_ВагоныСсылки.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВТ_ВагоныИтог
		|ИЗ
		|	ВТ_ВагоныПоТипу КАК ВТ_ВагоныПоТипу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВагоныСсылки КАК ВТ_ВагоныСсылки
		|		ПО (ВТ_ВагоныСсылки.Наименование = ВТ_ВагоныПоТипу.Наименование)
		|			И ВТ_ВагоныПоТипу.ТипТСВагон = ВТ_ВагоныСсылки.ТипТСВагон
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВагоныСсылки.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контейнеры.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ТЕ.Ссылка, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) КАК Контейнер,
		|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка) КАК Вагон
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Контейнеры КАК ВТ_Контейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|		ПО ВТ_Контейнеры.НомерКонтейнера = ТЕ.Наименование
		|			И (НЕ ТЕ.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Вагоны.НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	ЕСТЬNULL(ТС.Ссылка, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))
		|ИЗ
		|	ВТ_Вагоны КАК ВТ_Вагоны
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВагоныИтог КАК ТС
		|		ПО ВТ_Вагоны.НомерВагона = ТС.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
		|	МАКСИМУМ(ВТ_Итог.Контейнер) КАК Контейнер,
		|	МАКСИМУМ(ВТ_Итог.Вагон) КАК Вагон
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗКонтейнеры",ТЗКонтейнеры);
	Запрос.УстановитьПараметр("ТЗВагоны",ТЗВагоны);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		УчетныеЕдиницы[НомерСтроки-1].Контейнер = ВыборкаДетальныеЗаписи.Контейнер;
		УчетныеЕдиницы[НомерСтроки-1].Вагон 	= ВыборкаДетальныеЗаписи.Вагон;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПолучитьСделкиДляАктуализации()

	//ТзДоИзм = Ссылка.УчетныеЕдиницы.Выгрузить(,"Контейнер,Вагон"); 
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, начало
	ЗаписанныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"УчетныеЕдиницы,ДатаРаскредитации,ДатаОтправления,ДатаПрибытия,ДатаОтправления,ДатаТранспортногоДокумента");
	ТзДоИзм = ЗаписанныеРеквизиты.УчетныеЕдиницы.Выгрузить().Скопировать(,"Контейнер,Вагон");
	//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, конец
	ТЗПосле = УчетныеЕдиницы.Выгрузить(,"Контейнер,Вагон");
	
	ФлагНаличияИзменений = НЕ ОбщегоНазначения.КоллекцииИдентичны(ТзДоИзм, ТЗПосле,,, Истина);
	
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, начало
	ЗаполниласьДатаРаскредитации_Прибытия = Ложь;
	Если ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная Тогда
		//ЗаполниласьДатаРаскредитации_Прибытия = НЕ ЗначениеЗаполнено(Ссылка.ДатаРаскредитации) И ЗначениеЗаполнено(ДатаРаскредитации);
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, начало
		ЗаполниласьДатаРаскредитации_Прибытия = ПроверитьЗаполнениеРеквизитов(ЗаписанныеРеквизиты, "ДатаРаскредитации,ДатаОтправления");
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, конец
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
		//ЗаполниласьДатаРаскредитации_Прибытия = НЕ ЗначениеЗаполнено(Ссылка.ДатаПрибытия) И ЗначениеЗаполнено(ДатаПрибытия);
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, начало
		ЗаполниласьДатаРаскредитации_Прибытия = ПроверитьЗаполнениеРеквизитов(ЗаписанныеРеквизиты, "ДатаПрибытия,ДатаОтправления,ДатаТранспортногоДокумента");
		//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, конец
	КонецЕсли;
	
	ФлагНаличияИзменений = ФлагНаличияИзменений ИЛИ ЗаполниласьДатаРаскредитации_Прибытия;
	//Евросиб(ДИТ), Беляев СЮ, US 90567 / TA 91259, 09-09-2024, конец
	
	//Если НЕ ПолучитьСделки Тогда
	//	Для Каждого СтрокаДоИзм Из Ссылка.УчетныеЕдиницы Цикл
	//		СтрокаТек = УчетныеЕдиницы[СтрокаДоИзм.НомерСтроки-1];
	//		ПолучитьСделки = СтрокаДоИзм.Контейнер <> СтрокаТек.Контейнер И СтрокаДоИзм.Вагон <> СтрокаТек.Вагон;
	//		Если ПолучитьСделки Тогда
	//			Прервать;
	//		КонецЕсли;	
	//	КонецЦикла;	
	//КонецЕсли;	
	
	Если ФлагНаличияИзменений Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АктуальныеЖДН.Регистратор КАК Сделка
		|ИЗ
		|	РегистрНакопления.АктуальныеЖДН КАК АктуальныеЖДН
		|ГДЕ
		|	АктуальныеЖДН.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И АктуальныеЖДН.ЖДН = &ЖДН";
		
		Запрос.УстановитьПараметр("ЖДН",Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОтложенноеИзменениеСервер.ПоставитьСделкуВОчередьИзменения(ВыборкаДетальныеЗаписи.Сделка,Ссылка);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры	

//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, начало
Функция ПроверитьЗаполнениеРеквизитов(ЗаписанныеРеквизиты, СписокРеквизитов)
	
	Результат = Ложь;
	МассивРеквизитов = СтрРазделить(СписокРеквизитов, ",");
	
	Для Каждого Реквизит Из МассивРеквизитов  Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписанныеРеквизиты[Реквизит]) И ЗначениеЗаполнено(ЭтотОбъект[Реквизит]) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 101605 / TA 102596, 22-05-2025, конец

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	
	// Евросиб US 111176 TA 111178 Рыбьяков К.А. 30.07.2025 ((
	ПроверитьПунктыНаПометкуУдаления(ОбъектКопирования.МорскойРейс);
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб Каблов 30.01.2021 ( Ticket#0219642
	Если ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
	    Если Не ЗначениеЗаполнено(МорскаяЛиния) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Морская линия! Коносамент не проведен.",,,, Отказ);
		КонецЕсли; 	
	КонецЕсли; 
	//Евросиб Каблов 30.01.2021 ) 
	
КонецПроцедуры

// Евросиб Фролов (08.10.2021 Task №39041
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		МассивКонтейнеров = Коносаменты.ВыгрузитьКолонку("НомерКТК");
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
		//Евросиб - АСуслов 19.01.2023 15:08:20 #63097
		//(
		КлючиАналитикиСоставаПоездаСервер.ЗаполнитьДатыОтправленияПрибытияВКлючахАналитики(Ссылка);
		//)
		//Евросиб - АСуслов 19.01.2023 15:17:08 #63097 
		//Евросиб Коханенко Н.А. 06.03.2025 (( #103978   
		ОбновитьВесВКлючахАналитикиПеревозки(Ссылка);
		//Евросиб Коханенко Н.А. 06.03.2025 )) #103978
		//Евросиб Коханенко Н.А. 19.03.2025 (( #104519
		Если КлючевыеПоляДляЗапросаНаАвтоперевозкуИзменены Тогда 
			МассивЗапросов = ОбновитьЗапросыНаАвтоперевозкуПоСреднейМиле();
			Для Каждого ЗапросНаАвтоперевозку Из МассивЗапросов Цикл
				ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(ЗапросНаАвтоперевозку, Перечисления.УзлыОбмена.ТЛ);
			КонецЦикла;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
	КонецЕсли;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(НакладнаяЭТРАН) Тогда
		
		//ДИТ Шевченко А.В. 14.11.2022 59054 //Добавил Вид сборов в запрос
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка.Дата КАК Период,
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка КАК ТранспортныйДокумент,
		|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер,
		|	ТранспортныйДокументУчетныеЕдиницы.Вагон КАК Вагон,
		|	ТранспортныйДокументУчетныеЕдиницы.СтавкаНДС КАК СтавкаНДС,
		|	ТранспортныйДокументУчетныеЕдиницы.СуммаБезНДС КАК СуммаБезНДС,
		|	ТранспортныйДокументУчетныеЕдиницы.СуммаНДС КАК СуммаНДС,
		|	ТранспортныйДокументУчетныеЕдиницы.ВидСборов КАК ВидСборов
		|ИЗ
		|	Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|ГДЕ
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка = &Ссылка
		|	И НЕ(ТранспортныйДокументУчетныеЕдиницы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|				И ТранспортныйДокументУчетныеЕдиницы.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Движения.СтоимостьПоЖДНакладным.Записывать = Истина;
		Движения.СтоимостьПоЖДНакладным.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка.Дата КАК Период,
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка КАК ЖДН,
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка КАК ТранспортныйДокумент,
		|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер,
		|	ТранспортныйДокументУчетныеЕдиницы.Вагон КАК Вагон,
		|	1 КАК Наличие
		|ИЗ
		|	Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|ГДЕ
		|	ТранспортныйДокументУчетныеЕдиницы.Ссылка = &Ссылка
		|	И (ТранспортныйДокументУчетныеЕдиницы.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|      ИЛИ ТранспортныйДокументУчетныеЕдиницы.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка))";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Движения.АктуальныеЖДН.Записывать = Истина;
		Движения.АктуальныеЖДН.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Движения.УчетныеЕдиницыТранспортныхДокументов.Записывать = Истина;
		Движения.УчетныеЕдиницыТранспортныхДокументов.Загрузить(Запрос.Выполнить().Выгрузить()); 
		
		
		Если ЗначениеЗаполнено(НакладнаяЭТРАН) Тогда
			НакладнаяИД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НакладнаяЭТРАН, "НакладнаяИД");
			Если ЗначениеЗаполнено(НакладнаяИД) Тогда
				Движения.ИдентификаторыТранспортныхДокументов.Записывать = Истина;
				Запись = Движения.ИдентификаторыТранспортныхДокументов.Добавить();
				Запись.ТранспортныйДокумент = Ссылка;
				Запись.ИдентификаторНакладнойЭтран = Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НакладнаяЭТРАН, "НакладнаяИД"),"ЧГ=");
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	Движения.ДанныеТранспортныхДокументов.Записывать = Истина;
	Запись = Движения.ДанныеТранспортныхДокументов.Добавить();
	Запись.ТранспортныйДокумент = Ссылка;
	Запись.ДатаОтправления				= ДатаОтправления;
	Запись.ДатаПрибытия 				= ДатаПрибытия;
	Запись.ДатаРаскредитации 			= ДатаРаскредитации;
	Запись.НомерТранспортногоДокумента 	= НомерТранспортногоДокумента;
	Запись.ВидОперации 					= ВидОперации;
	НомерТДТолькоЦифры 			   = СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(НомерТранспортногоДокумента, Истина, Ложь, Ложь);
	НомерТДТолькоЦифрыБезЛидНулей  = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерТДТолькоЦифры, "0");
	Запись.НомерДляПоиска				= НомерТДТолькоЦифрыБезЛидНулей;
	
КонецПроцедуры

Функция ПолучитьСопоставлениеЭтранДатакор(МассивЗначенийЭтран)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана КАК СпрЭтрана,
	|	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор КАК СпрДатакор
	|ИЗ
	|	РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	|ГДЕ
	|	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана В(&СпрЭтрана)";
	Запрос.УстановитьПараметр("СпрЭтрана", МассивЗначенийЭтран);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	РезультатСоответствие = Новый Соответствие;
	Для каждого ЗначениеЭтран Из МассивЗначенийЭтран Цикл
		РезультатСоответствие.Вставить(ЗначениеЭтран);	
	КонецЦикла;
	Пока Выборка.Следующий() Цикл
		РезультатСоответствие.Вставить(Выборка.СпрЭтрана, Выборка.СпрДатакор);
	КонецЦикла;                                                               
	Возврат РезультатСоответствие;
	
КонецФункции

Процедура ЗаполнитьУчетныеЕдиницы(НакладнаяЭтран)
	
	//ДИТ Шевченко А.В. 14.11.2022 59054 //Заменил запрос
	#Область СтарыйЗапрос
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0
	//|			ТОГДА 1
	//|		ИНАЧЕ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда
	//|	КОНЕЦ КАК НомерВагонаДляКонтейнерногоПоезда,
	//|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях
	//|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
	//|	КОНЕЦ КАК СуммаБезНДС,
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаНалога
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога
	//|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога
	//|	КОНЕЦ КАК СуммаНДС,
	//|	ВЫБОР
	//|		КОГДА ВЫБОР
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
	//|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
	//|			КОНЕЦ = 20
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|		КОГДА ВЫБОР
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
	//|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
	//|			КОНЕЦ = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|	КОНЕЦ КАК СтавкаНДС
	//|ПОМЕСТИТЬ ВТ_Контейнеры
	//|ИЗ
	//|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоВходу КАК э_НакладнаяПровозныеПлатежиИСборыПоВходу
	//|		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка
	//|			И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
	//|		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка
	//|			И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	//|		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка
	//|			И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера
	//|ГДЕ
	//|	э_НакладнаяКонтейнеры.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке = 0
	//|			ТОГДА 1
	//|		ИНАЧЕ э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	//|	КОНЕЦ КАК ПорядковыйНомерВагонаВОтправке,
	//|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях
	//|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
	//|	КОНЕЦ КАК СуммаБезНДС,
	//|	ВЫБОР
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаНалога
	//|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога
	//|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога
	//|	КОНЕЦ КАК СуммаНДС,
	//|	ВЫБОР
	//|		КОГДА ВЫБОР
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
	//|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
	//|			КОНЕЦ = 20
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|		КОГДА ВЫБОР
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
	//|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
	//|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
	//|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
	//|			КОНЕЦ = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|	КОНЕЦ КАК СтавкаНДС
	//|ПОМЕСТИТЬ ВТ_Вагоны
	//|ИЗ
	//|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоВходу КАК э_НакладнаяПровозныеПлатежиИСборыПоВходу
	//|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка
	//|			И э_НакладнаяВагоны.НомерВагона = э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерВагона
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
	//|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка
	//|			И э_НакладнаяВагоны.НомерВагона = э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	//|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка
	//|			И э_НакладнаяВагоны.НомерВагона = э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона
	//|ГДЕ
	//|	э_НакладнаяВагоны.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТС.Ссылка КАК Вагон,
	//|	ТЕ.Ссылка КАК Контейнер,
	//|	ВТ_Контейнеры.НомерКонтейнера КАК НомерКонтейнера,
	//|	ВТ_Вагоны.НомерВагона КАК НомерВагона,
	//|	ЕСТЬNULL(ВТ_Контейнеры.СуммаБезНДС, ЕСТЬNULL(ВТ_Вагоны.СуммаБезНДС, 0)) КАК СуммаБезНДС,
	//|	ЕСТЬNULL(ВТ_Контейнеры.СуммаНДС, ЕСТЬNULL(ВТ_Вагоны.СуммаНДС, 0)) КАК СуммаНДС,
	//|	ЕСТЬNULL(ВТ_Контейнеры.СтавкаНДС, ЕСТЬNULL(ВТ_Вагоны.СтавкаНДС, 0)) КАК СтавкаНДС
	//|ИЗ
	//|	ВТ_Контейнеры КАК ВТ_Контейнеры
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Вагоны КАК ВТ_Вагоны
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	//|			ПО ВТ_Вагоны.НомерВагона = ТС.Наименование
	//|				И (НЕ ТС.ПометкаУдаления)
	//|		ПО ВТ_Контейнеры.НомерВагонаДляКонтейнерногоПоезда = ВТ_Вагоны.ПорядковыйНомерВагонаВОтправке
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	////Евросиб Каблов 05.08.2022 ( Task 55498
	////|		ПО ВТ_Контейнеры.НомерКонтейнера = ТЕ.Наименование
	//|		ПО ПОДСТРОКА(ВТ_Контейнеры.НомерКонтейнера, 1, 4) = ТЕ.Префикс
	//|		И ПОДСТРОКА(ВТ_Контейнеры.НомерКонтейнера, 5, 6) = ТЕ.Номер
	////Евросиб Каблов 05.08.2022 )
	//|			И (НЕ ТЕ.ПометкаУдаления)";
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера КАК НомерКонтейнера,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоВходу) КАК ВидСборов,
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях КАК СуммаБезНДС,
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаНалога КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	
	|		ИНАЧЕ Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка.Дата < ДатаВремя(2026,01,01)
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_СуммыПоКонтейнерам
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоВходу КАК э_НакладнаяПровозныеПлатежиИСборыПоВходу
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоОтправлению),
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях,
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)  
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
    |		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ИНАЧЕ Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка.Дата < ДатаВремя(2026,01,01) 
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоПрибытию),
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях,
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
    |		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ИНАЧЕ  Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка.Дата < ДатаВремя(2026,01,01) 
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец 
	    //Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерВагона КАК НомерВагона,
	//Евросиб Каблов 25.03.2025 ( #100520
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера КАК НомерКонтейнера,
	//Евросиб Каблов 25.03.2025 )
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоВходу) КАК ВидСборов,
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях КАК СуммаБезНДС,
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаНалога КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
    |		ИНАЧЕ Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка.Дата < ДатаВремя(2026,01,01) 
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_СуммыПоВагонам
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоВходу КАК э_НакладнаяПровозныеПлатежиИСборыПоВходу
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерВагона <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона,
	//Евросиб Каблов 25.03.2025 ( #100520
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера,
	//Евросиб Каблов 25.03.2025 )
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоОтправлению),
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях,
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)   
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
    |		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ИНАЧЕ Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка.Дата < ДатаВремя(2026,01,01) 
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец
		//Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона,
	//Евросиб Каблов 25.03.2025 ( #100520
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера,
	//Евросиб Каблов 25.03.2025 )
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСборовЖДН.ПоПрибытию),
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях,
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога,
	|	ВЫБОР
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 20
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 13.01.2025
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 7
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 13.01.2025
	//Евросиб СубботинВ #125845 09.12.2025 Начало // исправить заполнение по умолчанию
    |		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога = 22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ИНАЧЕ Выбор когда э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка.Дата < ДатаВремя(2026,01,01) 
	|			Тогда ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|           Иначе ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|           Конец
		//Евросиб СубботинВ #125845 09.12.2025 Конец
	|	КОНЕЦ
	|ИЗ
	|	Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
	|ГДЕ
	|	э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка = &Ссылка
	|	И э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0
	|			ТОГДА 1
	|		ИНАЧЕ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда
	|	КОНЕЦ КАК НомерВагонаДляКонтейнерногоПоезда,
	|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТ_СуммыПоКонтейнерам.ВидСборов КАК ВидСборов,
	|	ВТ_СуммыПоКонтейнерам.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_СуммыПоКонтейнерам.СуммаНДС КАК СуммаНДС,
	|	ВТ_СуммыПоКонтейнерам.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_Контейнеры
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПоКонтейнерам КАК ВТ_СуммыПоКонтейнерам
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ВТ_СуммыПоКонтейнерам.НомерКонтейнера
	|ГДЕ
	|	э_НакладнаяКонтейнеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке = 0
	|			ТОГДА 1
	|		ИНАЧЕ э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	|	КОНЕЦ КАК ПорядковыйНомерВагонаВОтправке,
	|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	//Евросиб Каблов 25.03.2025 ( #100520
	|	ВТ_СуммыПоВагонам.НомерКонтейнера КАК НомерКонтейнера,
	//Евросиб Каблов 25.03.2025 )
	|	ВТ_СуммыПоВагонам.ВидСборов КАК ВидСборов,
	|	ВТ_СуммыПоВагонам.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_СуммыПоВагонам.СуммаНДС КАК СуммаНДС,
	|	ВТ_СуммыПоВагонам.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_Вагоны
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПоВагонам КАК ВТ_СуммыПоВагонам
	|		ПО э_НакладнаяВагоны.НомерВагона = ВТ_СуммыПоВагонам.НомерВагона
	|ГДЕ
	|	э_НакладнаяВагоны.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТС.Ссылка КАК Ссылка,
	|	ТС.Наименование КАК Наименование,
	|	ЕСТЬNULL(ТипТССсылка.Вагон, ЛОЖЬ) КАК ТипТСВагон
	|ПОМЕСТИТЬ ВТ_ВагоныСсылки
	|ИЗ
	|	ВТ_Вагоны КАК ВТ_Вагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипТССсылка
	|			ПО (ТипТССсылка.Ссылка = ТС.ТипТС)
	|		ПО (ТС.Наименование = ВТ_Вагоны.НомерВагона)
	|			И (НЕ ТС.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВагоныСсылки.Наименование КАК Наименование,
	|	МАКСИМУМ(ВТ_ВагоныСсылки.ТипТСВагон) КАК ТипТСВагон
	|ПОМЕСТИТЬ ВТ_ВагоныПоТипу
	|ИЗ
	|	ВТ_ВагоныСсылки КАК ВТ_ВагоныСсылки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВагоныСсылки.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВагоныСсылки.Ссылка) КАК Ссылка,
	|	ВТ_ВагоныСсылки.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_ВагоныИтог
	|ИЗ
	|	ВТ_ВагоныПоТипу КАК ВТ_ВагоныПоТипу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВагоныСсылки КАК ВТ_ВагоныСсылки
	|		ПО (ВТ_ВагоныСсылки.Наименование = ВТ_ВагоныПоТипу.Наименование)
	|			И ВТ_ВагоныПоТипу.ТипТСВагон = ВТ_ВагоныСсылки.ТипТСВагон
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВагоныСсылки.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТС.Ссылка КАК Вагон,
	|	ТЕ.Ссылка КАК Контейнер,
	|	ВТ_Контейнеры.НомерКонтейнера КАК НомерКонтейнера,
	|	ВТ_Вагоны.НомерВагона КАК НомерВагона,
	|	СУММА(ЕСТЬNULL(ВТ_Контейнеры.СуммаБезНДС, ЕСТЬNULL(ВТ_Вагоны.СуммаБезНДС, 0))) КАК СуммаБезНДС,
	|	ЕСТЬNULL(ВТ_Контейнеры.ВидСборов, ЕСТЬNULL(ВТ_Вагоны.ВидСборов, 0)) КАК ВидСборов,
	|	СУММА(ЕСТЬNULL(ВТ_Контейнеры.СуммаНДС, ЕСТЬNULL(ВТ_Вагоны.СуммаНДС, 0))) КАК СуммаНДС,
	|	ЕСТЬNULL(ВТ_Контейнеры.СтавкаНДС, ЕСТЬNULL(ВТ_Вагоны.СтавкаНДС, 0)) КАК СтавкаНДС
	|ИЗ
	|	ВТ_Контейнеры КАК ВТ_Контейнеры
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Вагоны КАК ВТ_Вагоны
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВагоныИтог КАК ТС
	|			ПО ВТ_Вагоны.НомерВагона = ТС.Наименование
	|		ПО ВТ_Контейнеры.НомерВагонаДляКонтейнерногоПоезда = ВТ_Вагоны.ПорядковыйНомерВагонаВОтправке
	//Евросиб Каблов 25.03.2025 ( #100520
	|			И (ВЫБОР
	|				КОГДА ВТ_Вагоны.НомерКонтейнера <> """"
	|					ТОГДА ВТ_Контейнеры.НомерКонтейнера = ВТ_Вагоны.НомерКонтейнера
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	//Евросиб Каблов 25.03.2025 )
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО (ПОДСТРОКА(ВТ_Контейнеры.НомерКонтейнера, 1, 4) = ТЕ.Префикс)
	|			И (ПОДСТРОКА(ВТ_Контейнеры.НомерКонтейнера, 5, 6) = ТЕ.Номер)
	|			И (НЕ ТЕ.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТС.Ссылка,
	|	ТЕ.Ссылка,
	|	ВТ_Контейнеры.НомерКонтейнера,
	|	ВТ_Вагоны.НомерВагона,
	|	ЕСТЬNULL(ВТ_Контейнеры.ВидСборов, ЕСТЬNULL(ВТ_Вагоны.ВидСборов, 0)),
	|	ЕСТЬNULL(ВТ_Контейнеры.СтавкаНДС, ЕСТЬNULL(ВТ_Вагоны.СтавкаНДС, 0))";
	Запрос.УстановитьПараметр("Ссылка", НакладнаяЭТРАН);
	УчетныеЕдиницы.Загрузить(Запрос.Выполнить().Выгрузить());
	//
	//Для Каждого ТекСтрокаКонтейнеры Из ДанныеЗаполнения.Контейнеры Цикл
	//	Движение = Движения.АктуальныеЖДН.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Контейнер = Справочники.ТЕ.НайтиПоНаименованию(ТекСтрокаКонтейнеры.НомерКонтейнера);
	//	Движение.ЖДН = Номер;
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("ПорядковыйНомерВагонаВОтправке",ТекСтрокаКонтейнеры.НомерВагонаДляКонтейнерногоПоезда);
	//	НайденныеСтроки = Вагоны.НайтиСтроки(ПараметрыОтбора);
	//	Для Каждого СтрВаг Из НайденныеСтроки Цикл
	//		Движение.Вагон = Справочники.ТС.НайтиПоНаименованию(СтрВаг.НомерВагона);
	//	КонецЦикла;
	//	Движение.Наличие = 1;
	//КонецЦикла;
	
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 06.03.2025 (( #103978 
Процедура ОбновитьВесВКлючахАналитикиПеревозки(Коносамент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныйДокументКоносаменты.ВесНетто КАК ВесНетто,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|		ПО ЗаявкаСоставУслуги.Коносамент = ТранспортныйДокументКоносаменты.Ссылка
		|			И ЗаявкаСоставУслуги.НомерКТК = ТранспортныйДокументКоносаменты.НомерКТК
		|			И ЗаявкаСоставУслуги.ВесГрузаНетто <> ТранспортныйДокументКоносаменты.ВесНетто
		|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
		|			И ТранспортныйДокументКоносаменты.Ссылка = &Коносамент
		|			И ЗаявкаСоставУслуги.Ссылка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)";
	
	Запрос.УстановитьПараметр("Коносамент", Коносамент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		СтруктураКлючаАналитики = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитики.КлючАналитики = Выборка.КлючАналитикиПеревозки;
		СтруктураКлючаАналитики.ВесГруза = Выборка.ВесНетто;
		Попытка
			КлючСсылка = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитики);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Ошибка при записи ключа аналитики перевозки при обновлении веса по данным коносамента: %1", ОписаниеОшибки));
			ЗаписьЖурналаРегистрации("Запись ключа аналитики перевозки при обновлении веса по данным коносамента, ", УровеньЖурналаРегистрации.Ошибка,, КлючСсылка.Ссылка, ОписаниеОшибки);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры //Евросиб Коханенко Н.А. 06.03.2025 )) #103978  

//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
Функция ПроверитьИзменениеКлючевыхПолейДляЗапросаНаАвтоперевозку()
	ИзмененияЕсть = Ложь;
	ЗначМестаДоИзм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "МестоПоставкиГруза");
	ЗначМестаТек = МестоПоставкиГруза;
	Если ЗначМестаДоИзм <> ЗначМестаТек Тогда
		ИзмененияЕсть = Истина;
	Иначе
		ВесНеттоТек = Коносаменты.ВыгрузитьКолонку("ВесНетто");
		ВесНеттоДоИзм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Коносаменты.ВесНетто").Выгрузить().ВыгрузитьКолонку("ВесНетто");
		МассивыИдентичны = ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(ВесНеттоТек, ВесНеттоДоИзм);
		Если НЕ МассивыИдентичны Тогда
			ИзмененияЕсть = Истина;
		КонецЕсли;	
	КонецЕсли;                 
	Возврат ИзмененияЕсть;
КонецФункции //Евросиб Коханенко Н.А. 19.03.2025 )) #104519 

//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
Функция ОбновитьЗапросыНаАвтоперевозкуПоСреднейМиле()
	
	Если НЕ КлючевыеПоляДляЗапросаНаАвтоперевозкуИзменены Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//найдем Запросы на авто по средней миле, связанные с коносаментом через заявку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК ЗаявкаДокумент
		|		ПО (ЗаявкаСоставУслуги.Ссылка = ЗаявкаДокумент.Ссылка)
		|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
		|			И (ЗаявкаДокумент.Проведен)
		|			И (ЗаявкаСоставУслуги.Коносамент = &Коносамент)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО (ЗаявкаСоставУслуги.КлючАналитикиПеревозки = ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля))
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку = ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.Отправлен)
		|				ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку = ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.ГотовКОтправке))
		//|			И (ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачи <> &МестоПоставкиГруза)		
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросНаАвто
		|";
	
	Запрос.Параметры.Вставить("Коносамент", Ссылка);
	Запрос.Параметры.Вставить("МестоПоставкиГруза", МестоПоставкиГруза);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	Пока Выборка.СледующийПоЗначениюПоля("ЗапросНаАвто") Цикл
		ЗапросОб = Выборка.ЗапросНаАвто.ПолучитьОбъект();
		Пока Выборка.Следующий() Цикл
			Строка = ЗапросОб.Контейнеры.Найти(Выборка.ИдентификаторСтрокиТЧ, "ИдентификаторСтрокиТЧ");
			Строка.ТерминалВыдачи = МестоПоставкиГруза;
		КонецЦикла;
		Попытка
			ЗапросОб.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗапросаНаАвтоперевозку", УровеньЖурналаРегистрации.Ошибка, 
											Метаданные(), Выборка.ЗапросНаАвто, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивЗапросов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЗапросНаАвто");
	МассивЗапросов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗапросов);
	Возврат МассивЗапросов; 

КонецФункции //Евросиб Коханенко Н.А. 19.03.2025 )) #104519

Процедура ПроверитьПунктыНаПометкуУдаления(СсылкаМорскойРейс)
	// Евросиб US 111176 TA 111178 Рыбьяков К.А. 30.07.2025 ((
	Результат = Справочники.РейсыМоре.ПроверитьПунктыНаПометкуУдаления(СсылкаМорскойРейс);
	Если Результат.ПунктНазначенияПометкаУдаления Или Результат.МестоРазгрузкиПометкаУдаления Тогда
		МорскойРейс = Неопределено;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
КонецПроцедуры

