
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьБлокировкуЭлементов();
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		РазрешитьРедактированиеСостояния = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика",, Ложь);
		РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостояния);
	КонецЕсли;
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();
		ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
		
		Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного = Не Объект.ДействуетДоСогласованияНовыхУсловий;
		
	КонецЕсли;
	
	КлючАналитикиДляПереходаКСтрокеУслуг = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючАналитикиДляПереходаКСтрокеУслуг");
	Если ЗначениеЗаполнено(КлючАналитикиДляПереходаКСтрокеУслуг) Тогда
		СтрокиТаблицыКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("КлючАналитикиСтрокиПротокола", КлючАналитикиДляПереходаКСтрокеУслуг));
		Если ЗначениеЗаполнено(СтрокиТаблицыКритериев) Тогда
			СтрокиТаблицыУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокиТаблицыКритериев[0].ИдентификаторСтрокиУслуг));
			Если ЗначениеЗаполнено(СтрокиТаблицыУслуг) Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУслугиПоставщика;				
				Элементы.Услуги.ТекущаяСтрока = СтрокиТаблицыУслуг[0].ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();
	ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
	
	Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного = Не Объект.ДействуетДоСогласованияНовыхУсловий;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СоздатьСтрокиКритериевУслуг();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокиКритериевУслуг()
	
	//Для Каждого Стр Из Объект.Услуги Цикл		
	//	СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(Стр);		
	//КонецЦикла;
	
	ТипМультилокация = Тип("СправочникСсылка.Мультилокации");
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	
	ТипИерархииГород = Перечисления.ТипыИерархииЛокации.НаселенныйПункт;
	ТипИерархииСтрана = Перечисления.ТипыИерархииЛокации.Страна;
	
	ТипоразмерыТЕПустаяСсылка = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка");
	ТипоразмерыТСПустаяСсылка = ПредопределенноеЗначение("Справочник.ТипоразмерыТС.ПустаяСсылка"); //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	РазмерКТК20 = "20";
	РазмерКТК40 = "40";
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПСЦПоставщикаУслуги.ПунктНазначения КАК ПунктНазначения,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПСЦПоставщикаУслуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|	ПСЦПоставщикаУслуги.ВидТранспорта КАК ВидТранспорта,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|	ПСЦПоставщикаУслуги.Километраж КАК Километраж
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги КАК ПСЦПоставщикаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ЛокацияОказанияУслуги) КАК ЛокацияОказанияУслуги
	|ПОМЕСТИТЬ ЛокацииОказанияУслуги
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ЛокацияОказанияУслуги = МультилокацииЛокации.Ссылка
	|;
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидовОтправок.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаВидовОтправок.ВидОтправки КАК ВидОтправки
	|ПОМЕСТИТЬ ТаблицаВидовОтправок
	|ИЗ
	|	&ТаблицаВидовОтправок КАК ТаблицаВидовОтправок
	|;
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродуктов.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаПродуктов.Продукт КАК Продукт
	|ПОМЕСТИТЬ ТаблицаПродуктов
	|ИЗ
	|	&ТаблицаПродуктов КАК ТаблицаПродуктов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУчетныхНаправлений.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаУчетныхНаправлений.УчетноеНаправление КАК УчетноеНаправление
	|ПОМЕСТИТЬ ТаблицаУчетныхНаправлений
	|ИЗ
	|	&ТаблицаУчетныхНаправлений КАК ТаблицаУчетныхНаправлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТипоразмеровКТК.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаТипоразмеровКТК.РазмерКТК КАК РазмерКТК,
	|	ТаблицаТипоразмеровКТК.ТипоразмерКТК КАК ТипоразмерКТК,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|	ТаблицаТипоразмеровКТК.ТипоразмерВагона КАК ТипоразмерВагона,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|	ТаблицаТипоразмеровКТК.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ТаблицаТипоразмеровКТК.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ТаблицаТипоразмеровКТК.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|	ТаблицаТипоразмеровКТК.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
	|	ТаблицаТипоразмеровКТК.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|ПОМЕСТИТЬ ТаблицаТипоразмеровКТК
	|ИЗ
	|	&ТаблицаТипоразмеровКТК КАК ТаблицаТипоразмеровКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправления) КАК ПунктОтправления
	|ПОМЕСТИТЬ ПунктыОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправления = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправленияГород) КАК ПунктОтправленияГород
	|ПОМЕСТИТЬ ГородаОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправленияГород = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправленияСтрана) КАК ПунктОтправленияСтрана
	|ПОМЕСТИТЬ СтраныОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправленияСтрана = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ИерархияЛокацийГорода.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняГород,
	|	ИерархияЛокацийСтраны.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктыОтправленияСИерархией
	|ИЗ
	|	ПунктыОтправления КАК ПунктыОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийГорода
	|		ПО ПунктыОтправления.ПунктОтправления = ИерархияЛокацийГорода.Локация
	|			И (ИерархияЛокацийГорода.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийСтраны
	|		ПО ПунктыОтправления.ПунктОтправления = ИерархияЛокацийСтраны.Локация
	|			И (ИерархияЛокацийСтраны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГородаОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ГородаОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ГородаОтправленияСИерархией
	|ИЗ
	|	ГородаОтправления КАК ГородаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГородаОтправления.ПунктОтправленияГород = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыОтправленияСИерархией.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыОтправленияСИерархией.ПунктОтправления КАК ПунктОтправления,
	|	ГородаОтправленияСИерархией.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ЕСТЬNULL(ГородаОтправленияСИерархией.ЛокацияВышестоящегоУровняСтрана, ПунктыОтправленияСИерархией.ЛокацияВышестоящегоУровняСтрана) КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктГородОтправления
	|ИЗ
	|	ПунктыОтправленияСИерархией КАК ПунктыОтправленияСИерархией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГородаОтправленияСИерархией КАК ГородаОтправленияСИерархией
	|		ПО ПунктыОтправленияСИерархией.ИдентификаторСтрокиУслуг = ГородаОтправленияСИерархией.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктыОтправленияСИерархией.ПунктОтправления = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктыОтправленияСИерархией.ЛокацияВышестоящегоУровняГород = ГородаОтправленияСИерархией.ПунктОтправленияГород
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктГородОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ПунктГородОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	СтраныОтправления.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана
	|ПОМЕСТИТЬ ПунктГородСтранаОтправления
	|ИЗ
	|	ПунктГородОтправления КАК ПунктГородОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныОтправления КАК СтраныОтправления
	|		ПО ПунктГородОтправления.ИдентификаторСтрокиУслуг = СтраныОтправления.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктГородОтправления.ПунктОтправления = &ЛокацияПустаяСсылка
	|						И ПунктГородОтправления.ПунктОтправленияГород = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктГородОтправления.ЛокацияВышестоящегоУровняСтрана = СтраныОтправления.ПунктОтправленияСтрана
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначения) КАК ПунктНазначения
	|ПОМЕСТИТЬ ПунктыНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначения = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначенияГород) КАК ПунктНазначенияГород
	|ПОМЕСТИТЬ ГородаНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначенияГород = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначенияСтрана) КАК ПунктНазначенияСтрана
	|ПОМЕСТИТЬ СтраныНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначенияСтрана = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ИерархияЛокацийГорода.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняГород,
	|	ИерархияЛокацийСтраны.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктыНазначенияСИерархией
	|ИЗ
	|	ПунктыНазначения КАК ПунктыНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийГорода
	|		ПО ПунктыНазначения.ПунктНазначения = ИерархияЛокацийГорода.Локация
	|			И (ИерархияЛокацийГорода.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийСтраны
	|		ПО ПунктыНазначения.ПунктНазначения = ИерархияЛокацийСтраны.Локация
	|			И (ИерархияЛокацийСтраны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГородаНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ГородаНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ГородаНазначенияСИерархией
	|ИЗ
	|	ГородаНазначения КАК ГородаНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГородаНазначения.ПунктНазначенияГород = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыНазначенияСИерархией.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыНазначенияСИерархией.ПунктНазначения КАК ПунктНазначения,
	|	ГородаНазначенияСИерархией.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ЕСТЬNULL(ГородаНазначенияСИерархией.ЛокацияВышестоящегоУровняСтрана, ПунктыНазначенияСИерархией.ЛокацияВышестоящегоУровняСтрана) КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктГородНазначения
	|ИЗ
	|	ПунктыНазначенияСИерархией КАК ПунктыНазначенияСИерархией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГородаНазначенияСИерархией КАК ГородаНазначенияСИерархией
	|		ПО ПунктыНазначенияСИерархией.ИдентификаторСтрокиУслуг = ГородаНазначенияСИерархией.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктыНазначенияСИерархией.ПунктНазначения = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктыНазначенияСИерархией.ЛокацияВышестоящегоУровняГород = ГородаНазначенияСИерархией.ПунктНазначенияГород
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктГородНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ПунктГородНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	СтраныНазначения.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана
	|ПОМЕСТИТЬ ПунктГородСтранаНазначения
	|ИЗ
	|	ПунктГородНазначения КАК ПунктГородНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныНазначения КАК СтраныНазначения
	|		ПО ПунктГородНазначения.ИдентификаторСтрокиУслуг = СтраныНазначения.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктГородНазначения.ПунктНазначения = &ЛокацияПустаяСсылка
	|						И ПунктГородНазначения.ПунктНазначенияГород = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктГородНазначения.ЛокацияВышестоящегоУровняСтрана = СтраныНазначения.ПунктНазначенияСтрана
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородСтранаОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ПунктГородСтранаОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПунктГородСтранаОтправления.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПунктГородСтранаНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ПунктГородСтранаНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПунктГородСтранаНазначения.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	ТаблицаПродуктов.Продукт КАК Продукт,
	|	ТаблицаУчетныхНаправлений.УчетноеНаправление КАК УчетноеНаправление,
	|	ТаблицаТипоразмеровКТК.РазмерКТК КАК РазмерКТК,
	|	ТаблицаТипоразмеровКТК.ТипоразмерКТК КАК ТипоразмерКТК,
	|	ТаблицаТипоразмеровКТК.ТипоразмерВагона КАК ТипоразмерВагона,
	|	ТаблицаТипоразмеровКТК.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ТаблицаТипоразмеровКТК.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ТаблицаТипоразмеровКТК.СтоимостьЗаСуткиБезНДС КАК СтоимостьЗаСуткиБезНДС,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|	ЛокацииОказанияУслуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги,
	|	ТаблицаВидовОтправок.ВидОтправки КАК ВидОтправки,
	|	Услуги.ВидТранспорта КАК ВидТранспорта,
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|	Услуги.Километраж КАК Километраж,
	|	ТаблицаТипоразмеровКТК.СтавкаЗаКМ40FutБезНДС КАК СтавкаЗаКМ40FutБезНДС,
	|	ТаблицаТипоразмеровКТК.СтавкаЗаКМ20FutБезНДС КАК СтавкаЗаКМ20FutБезНДС
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТипоразмеровКТК КАК ТаблицаТипоразмеровКТК
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаТипоразмеровКТК.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПунктГородСтранаОтправления КАК ПунктГородСтранаОтправления
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ПунктГородСтранаОтправления.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПунктГородСтранаНазначения КАК ПунктГородСтранаНазначения
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ПунктГородСтранаНазначения.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПродуктов КАК ТаблицаПродуктов
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаПродуктов.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаУчетныхНаправлений КАК ТаблицаУчетныхНаправлений
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаУчетныхНаправлений.ИдентификаторСтрокиУслуг
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВидовОтправок КАК ТаблицаВидовОтправок
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаВидовОтправок.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛокацииОказанияУслуги КАК ЛокацииОказанияУслуги
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ЛокацииОказанияУслуги.ИдентификаторСтрокиУслуг 
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	#КонецОбласти
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги", "&Услуги");
	ПоляТаблицыУслуг = "НомерСтроки,ИдентификаторСтрокиУслуг,ПунктОтправления,ПунктОтправленияГород,ПунктОтправленияСтрана,ПунктНазначения,ПунктНазначенияГород,ПунктНазначенияСтрана,ЛокацияОказанияУслуги,ВидТранспорта, Километраж, СтавкаЗаКМ40FutБезНДС, СтавкаЗаКМ20FutБезНДС"; //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	Запрос.УстановитьПараметр("Услуги", Объект.Услуги.Выгрузить(, ПоляТаблицыУслуг));
	
	ТипСтрока36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	ТаблицаВидовОтправок = Новый ТаблицаЗначений;
	ТаблицаВидовОтправок.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаВидовОтправок.Колонки.Добавить("ВидОтправки", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОтправок"));
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	ТаблицаПродуктов = Новый ТаблицаЗначений;
	ТаблицаПродуктов.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаПродуктов.Колонки.Добавить("Продукт", Новый ОписаниеТипов("СправочникСсылка.ПродуктыДКП"));
	
	ТаблицаУчетныхНаправлений = Новый ТаблицаЗначений;
	ТаблицаУчетныхНаправлений.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаУчетныхНаправлений.Колонки.Добавить("УчетноеНаправление", Новый ОписаниеТипов("СправочникСсылка.УчетныеНаправления"));
	
	пТаблицаТипоразмеровКТК = Новый ТаблицаЗначений;
	пТаблицаТипоразмеровКТК.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	пТаблицаТипоразмеровКТК.Колонки.Добавить("ТипоразмерКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	пТаблицаТипоразмеровВагона = Новый ТаблицаЗначений;
	пТаблицаТипоразмеровВагона.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	пТаблицаТипоразмеровВагона.Колонки.Добавить("ТипоразмерВагона", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС"));
	
	ТаблицаТипоразмеровКТК = Новый ТаблицаЗначений;
	ТаблицаТипоразмеровКТК.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаТипоразмеровКТК.Колонки.Добавить("РазмерКТК", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	ТаблицаТипоразмеровКТК.Колонки.Добавить("ТипоразмерКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	ТаблицаТипоразмеровКТК.Колонки.Добавить("ТипоразмерВагона", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС")); //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	ТаблицаТипоразмеровКТК.Колонки.Добавить("СтоимостьБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТипоразмеровКТК.Колонки.Добавить("СтоимостьСНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТипоразмеровКТК.Колонки.Добавить("СтоимостьЗаСуткиБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТипоразмеровКТК.Колонки.Добавить("СтавкаЗаКМ40FutБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	ТаблицаТипоразмеровКТК.Колонки.Добавить("СтавкаЗаКМ20FutБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		
	Для Каждого Стр Из Объект.Услуги Цикл
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Для Каждого ЭлементСписка Из Стр.ВидыОтправок Цикл
			НоваяСтрока = ТаблицаВидовОтправок.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
			НоваяСтрока.ВидОтправки = ЭлементСписка.Значение;
		КонецЦикла;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Для Каждого ЭлементСписка Из Стр.Продукт Цикл
			НоваяСтрока = ТаблицаПродуктов.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
			НоваяСтрока.Продукт = ЭлементСписка.Значение;
		КонецЦикла;
		
		Для Каждого ЭлементСписка Из Стр.УчетныеНаправления Цикл
			НоваяСтрока = ТаблицаУчетныхНаправлений.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
			НоваяСтрока.УчетноеНаправление = ЭлементСписка.Значение;
		КонецЦикла;
		
		ДобавленаСтрокаПоТипоразмерам = Ложь;
		Если ЗначениеЗаполнено(Стр.ТипоразмерКТК20) Или ЗначениеЗаполнено(Стр.СтоимостьБезНДС_КТК20) Или ЗначениеЗаполнено(Стр.СтоимостьСНДС_КТК20) Тогда			
			НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;								
			НоваяСтрока.ТипоразмерКТК = Стр.ТипоразмерКТК20;
			НоваяСтрока.ТипоразмерВагона = ТипоразмерыТЕПустаяСсылка; //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
			НоваяСтрока.РазмерКТК = РазмерКТК20;
			НоваяСтрока.СтоимостьБезНДС = Стр.СтоимостьБезНДС_КТК20;
			НоваяСтрока.СтоимостьСНДС = Стр.СтоимостьСНДС_КТК20;
			Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
				НоваяСтрока.СтоимостьСНДС = 0;
			КонецЕсли;	
			НоваяСтрока.СтавкаЗаКМ20FutБезНДС = Стр.СтавкаЗаКМ20FutБезНДС; //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
			ДобавленаСтрокаПоТипоразмерам = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ТипоразмерКТК40) Или ЗначениеЗаполнено(Стр.СтоимостьБезНДС_КТК40) Или ЗначениеЗаполнено(Стр.СтоимостьСНДС_КТК40) Тогда			
			НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
			НоваяСтрока.ТипоразмерКТК = Стр.ТипоразмерКТК40;
			НоваяСтрока.ТипоразмерВагона = ТипоразмерыТСПустаяСсылка; //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
			НоваяСтрока.РазмерКТК = РазмерКТК40;
			НоваяСтрока.СтоимостьБезНДС = Стр.СтоимостьБезНДС_КТК40;
			НоваяСтрока.СтоимостьСНДС = Стр.СтоимостьСНДС_КТК40;
			Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
				НоваяСтрока.СтоимостьСНДС = 0;
			КонецЕсли;
			НоваяСтрока.СтавкаЗаКМ40FutБезНДС = Стр.СтавкаЗаКМ40FutБезНДС; //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
			ДобавленаСтрокаПоТипоразмерам = Истина;
		КонецЕсли;
		
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Если (Стр.ТипоразмерыКТК.Количество() ИЛИ Стр.ТипоразмерыВагонов.Количество()) И (Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны) Тогда
			
			Для Каждого ЭлмТипоразмерыКТК из Стр.ТипоразмерыКТК Цикл
				НовСтрокаКТК = пТаблицаТипоразмеровКТК.Добавить();
				НовСтрокаКТК.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;;
				НовСтрокаКТК.ТипоразмерКТК = ЭлмТипоразмерыКТК.Значение;
			КонецЦикла;
			
			Для Каждого ЭлмТипоразмерыВагона из Стр.ТипоразмерыВагонов Цикл
				НовСтрокаВагоны = пТаблицаТипоразмеровВагона.Добавить();
				НовСтрокаВагоны.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;;
				НовСтрокаВагоны.ТипоразмерВагона = ЭлмТипоразмерыВагона.Значение;
			КонецЦикла;
			
			тЗапрос = Новый Запрос;
			тЗапрос.Текст = 
			"ВЫБРАТЬ
			|	&Иднтификатор КАК ИдентификаторСтрокиУслуг,
			|	&СтоимостьБезНДС КАК СтоимостьБезНДС
			|ПОМЕСТИТЬ ВТ_СтрокаУслуг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаКТК.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
			|	ТаблицаКТК.ТипоразмерКТК КАК ТипоразмерКТК
			|ПОМЕСТИТЬ ВТ_Контейнеры
			|ИЗ
			|	&ТаблицаКТК КАК ТаблицаКТК
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаВыгоны.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
			|	ТаблицаВыгоны.ТипоразмерВагона КАК ТипоразмерВагона
			|ПОМЕСТИТЬ ВТ_Вагоны
			|ИЗ
			|	&ТаблицаВыгоны КАК ТаблицаВыгоны
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_СтрокаУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
			|	ВТ_СтрокаУслуг.СтоимостьБезНДС КАК СтоимостьБезНДС,
			|	ВТ_Контейнеры.ТипоразмерКТК КАК ТипоразмерКТК,
			|	ВТ_Вагоны.ТипоразмерВагона КАК ТипоразмерВагона
			|ИЗ
			|	ВТ_СтрокаУслуг КАК ВТ_СтрокаУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контейнеры КАК ВТ_Контейнеры
			|		ПО ВТ_СтрокаУслуг.ИдентификаторСтрокиУслуг = ВТ_Контейнеры.ИдентификаторСтрокиУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вагоны КАК ВТ_Вагоны
			|		ПО ВТ_СтрокаУслуг.ИдентификаторСтрокиУслуг = ВТ_Вагоны.ИдентификаторСтрокиУслуг";
			
			тЗапрос.УстановитьПараметр("Иднтификатор", Стр.ИдентификаторСтрокиУслуг);
			тЗапрос.УстановитьПараметр("СтоимостьБезНДС", Стр.СтоимостьБезНДС);
			тЗапрос.УстановитьПараметр("ТаблицаКТК", пТаблицаТипоразмеровКТК);
			тЗапрос.УстановитьПараметр("ТаблицаВыгоны", пТаблицаТипоразмеровВагона);
			
			тРезультатЗапроса = тЗапрос.Выполнить();
			
			тВыборкаДетальныеЗаписи = тРезультатЗапроса.Выбрать();
			
			Пока тВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
				НоваяСтрока.РазмерКТК = "";
				НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
				НоваяСтрока.ТипоразмерКТК = тВыборкаДетальныеЗаписи.ТипоразмерКТК;
				НоваяСтрока.ТипоразмерВагона = тВыборкаДетальныеЗаписи.ТипоразмерВагона;
				НоваяСтрока.СтоимостьБезНДС = Стр.СтоимостьБезНДС;
				НоваяСтрока.СтоимостьСНДС = 0;
				НоваяСтрока.СтоимостьЗаСуткиБезНДС = Стр.СтоимостьЗаСуткиБезНДС;
				НоваяСтрока.СтавкаЗаКМ40FutБезНДС = 0; //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				НоваяСтрока.СтавкаЗаКМ20FutБезНДС = 0; //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				ДобавленаСтрокаПоТипоразмерам = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		
		Если НЕ ДобавленаСтрокаПоТипоразмерам Или ЗначениеЗаполнено(Стр.СтоимостьБезНДС) Или ЗначениеЗаполнено(Стр.СтоимостьСНДС) Или ЗначениеЗаполнено(Стр.СтоимостьЗаСуткиБезНДС) Тогда
			Если ДобавленаСтрокаПоТипоразмерам И (Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны) Тогда //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
			Иначе
				НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
				НоваяСтрока.РазмерКТК = "";
				НоваяСтрока.СтоимостьБезНДС = Стр.СтоимостьБезНДС;
				НоваяСтрока.СтоимостьСНДС = Стр.СтоимостьСНДС;
				Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки Тогда
					НоваяСтрока.СтоимостьСНДС = 0;
				КонецЕсли;
				НоваяСтрока.СтоимостьЗаСуткиБезНДС = Стр.СтоимостьЗаСуткиБезНДС;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаПродуктов", ТаблицаПродуктов);
	Запрос.УстановитьПараметр("ТаблицаУчетныхНаправлений", ТаблицаУчетныхНаправлений);
	Запрос.УстановитьПараметр("ТаблицаТипоразмеровКТК", ТаблицаТипоразмеровКТК);
	Запрос.УстановитьПараметр("ТаблицаВидовОтправок", ТаблицаВидовОтправок); //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	
	Запрос.УстановитьПараметр("ЛокацияПустаяСсылка", ЛокацияПустаяСсылка);
	Запрос.УстановитьПараметр("ТипИерархииГород", ТипИерархииГород);
	Запрос.УстановитьПараметр("ТипИерархииСтрана", ТипИерархииСтрана);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Объект.КритерииУслуг.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.КритерииУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.НомерПСЦ) Тогда
		НомерПСЦУникален = Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПроверитьУникальностьНомераДокумента(ТекущийОбъект);
		Если Не НомерПСЦУникален Тогда
			ОбщегоНазначения.СообщитьПользователю("Уже есть Протокол нормативных ставок с таким Номером!",, "НомерПСЦ", "Объект", Отказ);
		КонецЕсли;
	Иначе
		ТекущийОбъект.НомерПСЦ = Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПолучитьОчереднойНомерДокумента(ТекущийОбъект.ДатаПСЦ, ТекущийОбъект.ВидУслугПоставщика, ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьБлокировкуЭлементов();
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
		  
	ЕстьСогласованиеВСтатусеОтличнымОтПланируется = Ложь;
	
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ЭтоСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
	
			Если Стр.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый") Тогда
				ЕстьСогласованиеВСтатусеОтличнымОтПланируется = Истина;
			КонецЕсли;
	
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
    
	Если Не ЕстьСогласованиеВСтатусеОтличнымОтПланируется Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ПСЦ не передан на согласование, необходимо выполнить предшествующие этапы");
		Возврат;
	КонецЕсли;
	
	//Если Не Объект.Типовой И НЕ ПроверкаНаПрикрепленные(Объект.Ссылка) Тогда
	//	Сообщить("Протокол является нетиповым! Прикрепите файлы!");
	//	Возврат;
	//КонецЕсли;

	ОповещениеОСогласовании = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОСогласовании, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	ОбновитьБлокировкуЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьНомерДокумента(Команда)
	
	Если ЗначениеЗаполнено(Объект.НомерПСЦ) Тогда
		Сообщить("Перед выдачей нового номера Протокола, предыдущий нужно очистить!");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед выдачей номера Протокола необходимо записать документ!");
		Возврат;
	КонецЕсли;  
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПСЦ) Тогда Сообщить("Укажите дату ПСЦ!"); Отказ = Истина; КонецЕсли;
	
	Если Не Отказ Тогда	
		ОчереднойНомер = ПолучитьОчереднойДокумента(Объект.ДатаПСЦ, Объект.ВидУслугПоставщика, Объект.Ссылка);
		Объект.НомерПСЦ = ОчереднойНомер;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласование(Команда)
	
	ЕстьСверкиВПСЦПоставщиков = ПроверитьНаличиеСверокВПСЦПоставщиков(Объект.Ссылка);
	Если ЕстьСверкиВПСЦПоставщиков Тогда
		АдминистративныеПрава = ЕстьПолныеПрава();
		Если Не АдминистративныеПрава Тогда
			ПоказатьПредупреждение(, "Нормативные ставки этого протокола применены при проверке ставок Протоколов поставщиков! Отзыв согласования запрещен.",, "Отзыв согласования");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОповещениеОбОтменеСогласования = Новый ОписаниеОповещения("ОтменаСогласования", ЭтаФорма);
	Если ЕстьСверкиВПСЦПоставщиков Тогда
		ТекстСообщения = "Внимание! Нормативные ставки этого протокола применены при проверке ставок Протоколов поставщиков!"
					+ Символы.ПС + "Протокол будет возвращен на этап ввода, а информация о результатах согласования стерта. Продолжить?";
	Иначе
		ТекстСообщения = "Протокол будет возвращен на этап ввода, а информация о результатах согласования стерта. Продолжить?";
	КонецЕсли;
	ПоказатьВопрос(ОповещениеОбОтменеСогласования, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПолныеПрава()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеСверокВПСЦПоставщиков(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола
	|ПОМЕСТИТЬ Ключи
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг
	|ГДЕ
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПСЦПоставщикаКритерииУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|ГДЕ
	|	ПСЦПоставщикаКритерииУслуг.КлючНормативнойСтавки В
	|			(ВЫБРАТЬ
	|				Ключи.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола
	|			ИЗ
	|				Ключи КАК Ключи)
	|	И ПСЦПоставщикаКритерииУслуг.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаменитьИсполнителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(, "Сначала необходимо сохранить Протокол");
		Возврат;
	КонецЕсли;
	
	ИсходныйПользователь = неопределено;
	Для каждого Стр из Объект.Состояния Цикл
		Если Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ПроверкаРезультатовСогласования") Тогда ИсходныйПользователь = Стр.Исполнитель; КонецЕсли;
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораЗаменыСогласующего", ЭтаФорма);
	
	ОткрытьФорму("Документ.ПСЦ.Форма.ФормаЗаменыИсполнителяВПротоколе", Новый Структура("ИсходныйПользователь", ИсходныйПользователь),,ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗаменыСогласующего(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	ИсхП = П1.ИсходныйПользователь;
	КонП = П1.КонечныйПользователь;
	
	ЗаменятьИсполнителя = П1.ЗаменятьИсполнителя;
	ЗаменятьНаблюдателя = П1.ЗаменятьНаблюдателя;
	
	ЗаменяемыеСтатусы = П1.ЗаменяемыеСтатусы;
	
	Для каждого Стр из Объект.Состояния Цикл
		
		Если ЗаменяемыеСтатусы.Найти(Стр.Статус) <> неопределено Тогда
			Если Стр.Исполнитель = ИсхП И ЗаменятьИсполнителя Тогда Стр.Исполнитель = КонП; КонецЕсли;
			Если Стр.Наблюдатель = ИсхП И ЗаменятьНаблюдателя Тогда Стр.Наблюдатель = КонП; КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТакжеЗаменитьВКарточкеСогласования(П1, Объект.Ссылка);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТакжеЗаменитьВКарточкеСогласования(П1, Ссылка)
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Ссылка);
	Если НЕ ЗначениеЗаполнено(ТекПроцессСогл) Тогда Возврат; КонецЕсли;
	
	ПроцессО = ТекПроцессСогл.ПолучитьОбъект();
	
	ИсхП = П1.ИсходныйПользователь;
	КонП = П1.КонечныйПользователь;
	
	ЗаменятьИсполнителя = П1.ЗаменятьИсполнителя;
	ЗаменятьНаблюдателя = П1.ЗаменятьНаблюдателя;
	
	ЗаменяемыеСтатусы = П1.ЗаменяемыеСтатусы;
	
	Для каждого Стр из ПроцессО.Состояния Цикл
		
		Если ЗаменяемыеСтатусы.Найти(Стр.Статус) <> неопределено Тогда
			Если Стр.Исполнитель = ИсхП И ЗаменятьИсполнителя Тогда Стр.Исполнитель = КонП; КонецЕсли;
			Если Стр.Наблюдатель = ИсхП И ЗаменятьНаблюдателя Тогда Стр.Наблюдатель = КонП; КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессО.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСтавкиИзExcel(Команда)
	
	ОткрытьФормуВнесенияСтавокИзExcel("ЗагружатьИзExcel");	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ВидУслугПоставщикаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Объект.ВидУслугПоставщика И ЗначениеЗаполнено(Объект.Услуги) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура("ВидУслугПоставщика", ВыбранноеЗначение);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ВидУслугПоставщикаПриИзмененииПродолжение", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(ОповещениеОВыборе, "Таблица услуг поставщика будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПоставщикаПриИзмененииПродолжение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ВидУслугПоставщика = ДопПараметры.ВидУслугПоставщика;
		Объект.Услуги.Очистить();
		ВидУслугПоставщикаПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПоставщикаПриИзменении(Элемент)
	
	ВидУслугПоставщикаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетДоСогласованияНовыхУсловийПриИзменении(Элемент)
	
	Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного = Не Объект.ДействуетДоСогласованияНовыхУсловий;
	Если Не Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного Тогда
		Элементы.ОкончаниеДействия.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Если Объект.ДействуетДоСогласованияНовыхУсловий И ЗначениеЗаполнено(Объект.ОкончаниеДействия) Тогда
		ПустаяДата = '00010101';
		Объект.ОкончаниеДействия = ПустаяДата;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыУслуги

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТипАдрес = Тип("СправочникСсылка.АдресаВНаселенныхПунктах");
	ТипМультиадрес = Тип("СправочникСсылка.Мультиадреса");
	
	Если ТекДанные.АдресСкладаПогрузкиВыгрузки = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиАдресСкладаПогрузкиВыгрузки.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(ТипАдрес);
			СписокТипов.Добавить(ТипМультиадрес);
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
			ОповещениеОВыборе = Новый ОписаниеОповещения("УслугиАдресСкладаПогрузкиВыгрузкиОбработкаВыбораТипа", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		ИначеЕсли СписокТипов.Количество() = 1 Тогда
			
			Если СписокТипов[0].Значение = ТипМультиадрес Тогда
				ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.Мультиадреса.ПустаяСсылка");
			ИначеЕсли СписокТипов[0].Значение = ТипАдрес Тогда
				ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекДанные.АдресСкладаПогрузкиВыгрузки) = ТипАдрес Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("ПоказыватьВыборАдреса", Истина);
		
		ТипыЛокацийМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));	
		ПараметрыОтбора = Новый Структура("Тип", ТипыЛокацийМассив);
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиОбработкаВыбораТипа(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультиадреса") Тогда
			ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.Мультиадреса.ПустаяСсылка");
		Иначе
			ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.АдресСкладаПогрузкиВыгрузки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиСоздание(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТипЗнч(ТекДанные.АдресСкладаПогрузкиВыгрузки) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
		
		СтандартнаяОбработка = Ложь;
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("ПоказыватьВыборАдреса", Истина);
		
		ТипыЛокацийМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));	
		ПараметрыОтбора = Новый Структура("Тип", ТипыЛокацийМассив);
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		ТекДанные.ИдентификаторСтрокиУслуг = Строка(Новый УникальныйИдентификатор);
		
		Если Копирование Тогда
			
			ТекДанные.Критерии.Очистить();
			// Евросиб US 98207 TA 105661 Рыбьяков К.А. 21.03.2025 ((
			ТекДанные.Продукт.Очистить();
			// Евросиб Рыбьяков К.А. 21.03.2025 ))
		Иначе
			
			Для Каждого Элемент Из ПараметрыВидаУслуг.ЗначенияПолейПоУмолчанию Цикл
				ТекДанные[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
			
			//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
			Если Не ЗначениеЗаполнено(ТекДанные.Валюта) Тогда
				Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ВалютаПоУмолчанию) Тогда
					ТекДанные.Валюта = ПараметрыВидаУслуг.ВалютаПоУмолчанию;
				Иначе
					ТекДанные.Валюта = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
				КонецЕсли;
			КонецЕсли;
			//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
			
			//Приоритет локаций при выборе. Возможность выбора мультилокаций после очисти поля.
			ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ТекДанные.ПунктОтправления = ЛокацияПустаяСсылка;
			ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
			ТекДанные.ПунктПогрузкиВыгрузки = ЛокацияПустаяСсылка;
			ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
			ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
			ТекДанные.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
			Текданные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
			АдресПустаяСсылка = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
			Текданные.АдресСкладаПогрузкиВыгрузки = АдресПустаяСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если Поле = Элементы.УслугиКритерии Или Поле = Элементы.УслугиКритерииСтрокой Тогда // Евросиб US 98207 TA 105661 Рыбьяков К.А. 03.04.2025 (( Добавил Элементы.УслугиКритерииСтрокой
		
		СтандартнаяОбработка = Ложь;
		
		СписокКритериев = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из ТекДанные.Критерии Цикл
			СписокКритериев.Добавить(ЭлементСписка.Значение,,, БиблиотекаКартинок.ПолеВводаОткрыть);
		КонецЦикла;
		
		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКритерия", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКритериев, Элемент);
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправления Тогда
		
		Если Элементы.УслугиПунктОтправления.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправления);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправленияГород Тогда
		
		Если Элементы.УслугиПунктОтправленияГород.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправленияГород);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправленияСтрана Тогда
		
		Если Элементы.УслугиПунктОтправленияСтрана.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияСтрана) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправленияСтрана);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначения Тогда
		
		Если Элементы.УслугиПунктНазначения.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначения);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначенияГород Тогда
		
		Если Элементы.УслугиПунктНазначенияГород.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначенияГород);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначенияСтрана Тогда
		
		Если Элементы.УслугиПунктНазначенияСтрана.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияСтрана) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначенияСтрана);
			КонецЕсли;
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКритерииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	СписокКритериев = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.Критерии Цикл
		СписокКритериев.Добавить(ЭлементСписка.Значение,,, БиблиотекаКартинок.ПолеВводаОткрыть);
	КонецЦикла;
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКритерия", ЭтаФорма);
	ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКритериев, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКритерия(ВыбранныйКритерий, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйКритерий <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйКритерий.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНоменклатураПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНоменклатураПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные)
	
	Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Номенклатура, "СтавкаНДСПоставщика, ЕдиницаИзмерения");
				
		Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения) Тогда
			ТекДанные.ЕдиницаИзмерения = ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
		
		ОписаниеПоляВидСобственности = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ВидСобственности");
		Если ОписаниеПоляВидСобственности <> Неопределено Тогда
			Если ТекДанные.Номенклатура = Справочники.Номенклатура.АрендаКонтейнеров Тогда
				ТекДанные.ВидСобственности = Перечисления.ВариантыСобственности.АрендаДлительная;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		ЗаполнитьСтавкуНДСВСтрокеУслуг(ТекДанные);
		УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО И СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("РелокацияКонтейнерПорожний") Тогда
		СтрокаТЧ.ДляПорожних = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, НоменклатураСтавкаНДСПоставщика = Неопределено) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.ПунктОтправления = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиПунктОтправления.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, "ПунктОтправления");
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправления = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);	
	ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные);
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
		ТекДанные.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные)
	
	ДанныеЛокации = Новый Структура;
	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
	
	Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
		
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаВыдачиПостановкиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;
		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктОтправленияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;
		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда
			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктОтправления, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ТекДанные.АдресТерминалаВыдачиПостановкиКТК = ДанныеЛокации.Адрес;
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ТекДанные.ПунктОтправленияГород = ДанныеЛокации.Город;
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ТекДанные.ПунктОтправленияСтрана = ДанныеЛокации.Страна;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		//ТекДанные.АдресТерминалаВыдачиПостановкиКТК = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные);
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
		ЛокацияПустаяСсылка =Справочники.Локации.ПустаяСсылка();
		ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
		ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные)
	
	ДанныеЛокации = Новый Структура;
	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
	
	Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
		
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаСдачиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;
		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктНазначенияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;
		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда
			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктНазначения, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ТекДанные.АдресТерминалаСдачиКТК = ДанныеЛокации.Адрес;
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ТекДанные.ПунктНазначенияГород = ДанныеЛокации.Город;
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ТекДанные.ПунктНазначенияСтрана = ДанныеЛокации.Страна;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.ПунктНазначения = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиПунктОтправления.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, "ПунктНазначения");
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначения = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктОтправленияГород", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправленияГород = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияГородПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияГородПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные)

	Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");	
		Если ОписаниеПоля <> Неопределено Тогда
			Если ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда				
				ТекДанные.ПунктОтправленияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна); 
			ИначеЕсли ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Мультилокации") Тогда
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
				Если Страны.Количество() = 1 Тогда
					ТекДанные.ПунктОтправленияСтрана = Страны[0];
				Иначе
					ТекДанные.ПунктОтправленияСтрана = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекДанные.ПунктОтправленияСтрана = Справочники.Локации.ПустаяСсылка();
	КонецЕсли;
	ТекДанные.ПунктОтправления = Справочники.Локации.ПустаяСсылка();
	//ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктНазначенияГород", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначенияГород = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияГородПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияГородПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные)
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда				
				ТекДанные.ПунктНазначенияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
			ИначеЕсли ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Мультилокации") Тогда				
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна); 
				Если Страны.Количество() = 1 Тогда
					ТекДанные.ПунктНазначенияСтрана = Страны[0];
				Иначе
					ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктОтправленияСтрана", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправленияСтрана = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияСтранаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияСтранаПриИзмененииСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеСтраныОтправленияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтраныОтправленияВСтроке(ТекДанные)
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	ТекДанные.ПунктОтправления = ЛокацияПустаяСсылка;
	ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктНазначенияСтрана", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначенияСтрана = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияСтранаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияСтранаПриИзмененииСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеСтраныНазначенияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтраныНазначенияВСтроке(ТекДанные)
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
	ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидСобственностиПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВалютаПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерВагонаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТекДанные.ТипоразмерыВагонов.Очистить();	
	Если ЗначениеЗаполнено(ТекДанные.ТипоразмерВагона) Тогда
		ТекДанные.ТипоразмерыВагонов.Добавить(ТекДанные.ТипоразмерВагона);
	КонецЕсли;
	
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормаПользованияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНормаПользованияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНормаПользованияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеНормыПользованияВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНормыПользованияВСтрокеУслуг(СтрокаУслуг)
	
	РассчитатьСтоимостьЗаСуткиБезНДС(СтрокаУслуг);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьЗаСуткиБезНДС(СтрокаУслуг)
	
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("СтоимостьЗаСуткиБезНДС");
	Если ОписаниеПоля <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаУслуг.НормаПользования) И ЗначениеЗаполнено(СтрокаУслуг.СтоимостьБезНДС) Тогда
			СтрокаУслуг.СтоимостьЗаСуткиБезНДС = СтрокаУслуг.СтоимостьБезНДС / СтрокаУслуг.НормаПользования;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктПогрузкиВыгрузкиПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБезНДСПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	УслугиСтоимостьБезНДСПриИзмененииСервер(ТекСтрока);
		
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьБезНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеСтоимостиБезНДСВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтоимостиБезНДСВСтрокеУслуг(СтрокаУслуг)
	
	ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаУслуг, "СтоимостьБезНДС", "СтоимостьСНДС", "СтоимостьСНДС");
	РассчитатьСтоимостьЗаСуткиБезНДС(СтрокаУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьСНДСПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	УслугиСтоимостьСНДСПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьСНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеСтоимостиСНДСВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтоимостиСНДСВСтрокеУслуг(СтрокаУслуг)
	
	ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаУслуг, "СтоимостьБезНДС", "СтоимостьСНДС", "СтоимостьБезНДС");
	РассчитатьСтоимостьЗаСуткиБезНДС(СтрокаУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБезНДС_КТК20ПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтоимостьБезНДС_КТК20ПриИзмененииСервер(ТекСтрока);
	
	ПересчетСтавкиЗаКМБезНДС(ТекСтрока); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьБезНДС_КТК20ПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные, "СтоимостьБезНДС_КТК20", "СтоимостьСНДС_КТК20", "СтоимостьСНДС_КТК20");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьСНДС_КТК20ПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтоимостьСНДС_КТК20ПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьСНДС_КТК20ПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные, "СтоимостьБезНДС_КТК20", "СтоимостьСНДС_КТК20", "СтоимостьБезНДС_КТК20");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБезНДС_КТК40ПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтоимостьБезНДС_КТК40ПриИзмененииСервер(ТекСтрока);
	
	ПересчетСтавкиЗаКМБезНДС(ТекСтрока); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьБезНДС_КТК40ПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные, "СтоимостьБезНДС_КТК40", "СтоимостьСНДС_КТК40", "СтоимостьСНДС_КТК40");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьСНДС_КТК40ПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтоимостьСНДС_КТК40ПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьСНДС_КТК40ПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные, "СтоимостьБезНДС_КТК40", "СтоимостьСНДС_КТК40", "СтоимостьБезНДС_КТК40");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерКТК20ПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерКТК40ПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКомментарийПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктПогрузкиВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.ПунктПогрузкиВыгрузки = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиПунктПогрузкиВыгрузки.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, "ПунктПогрузкиВыгрузки");
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктПогрузкиВыгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктПогрузкиВыгрузки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктПогрузкиВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтавкаНДСПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтавкаНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаУслуг, ИмяПоляСтоимостьБезНДС = "", ИмяПоляСтоимостьСНДС = "", ИмяРассчитываемогоПоля = "")
	
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 04.04.2025 ((
	Если Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.НормативыДляКалькуляций") 
		И (ЗначениеЗаполнено(СтрокаУслуг.СтоимостьСНДС) ИЛИ ЗначениеЗаполнено(СтрокаУслуг.СтоимостьБезНДС)) Тогда
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 04.04.2025 ))
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаУслуг.СтавкаНДС);
	
	Если ЗначениеЗаполнено(ИмяПоляСтоимостьБезНДС) И ЗначениеЗаполнено(ИмяПоляСтоимостьБезНДС) И ЗначениеЗаполнено(ИмяРассчитываемогоПоля) Тогда
		
		СтрокаУслуг[ИмяРассчитываемогоПоля] = 0;
		РассчитатьСтоимостьПоСтавкеНДС(СтрокаУслуг, ЗначениеСтавкиНДС, ИмяПоляСтоимостьБезНДС, ИмяПоляСтоимостьСНДС);
		
	Иначе
		
		РассчитатьСтоимостьПоСтавкеНДС(СтрокаУслуг, ЗначениеСтавкиНДС, "СтоимостьБезНДС", "СтоимостьСНДС");
		РассчитатьСтоимостьПоСтавкеНДС(СтрокаУслуг, ЗначениеСтавкиНДС, "СтоимостьБезНДС_КТК20", "СтоимостьСНДС_КТК20");
		РассчитатьСтоимостьПоСтавкеНДС(СтрокаУслуг, ЗначениеСтавкиНДС, "СтоимостьБезНДС_КТК40", "СтоимостьСНДС_КТК40");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьПоСтавкеНДС(СтрокаУслуг, ЗначениеСтавкиНДС, ИмяПоляСтоимостьБезНДС, ИмяПоляСтоимостьСНДС)
	
	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
	ОписаниеПоляСтоимостьБезНДС = ПоляТаблицыУслуг.Получить(ИмяПоляСтоимостьБезНДС);
	ОписаниеПоляСтоимостьСНДС = ПоляТаблицыУслуг.Получить(ИмяПоляСтоимостьСНДС);
	Если ОписаниеПоляСтоимостьБезНДС <> Неопределено И ОписаниеПоляСтоимостьСНДС <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаУслуг[ИмяПоляСтоимостьБезНДС]) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг[ИмяПоляСтоимостьБезНДС], ЗначениеСтавкиНДС, Истина, Ложь);
			СтрокаУслуг[ИмяПоляСтоимостьСНДС] = СтрокаУслуг[ИмяПоляСтоимостьБезНДС] + СуммаНДС;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуг[ИмяПоляСтоимостьСНДС]) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг[ИмяПоляСтоимостьСНДС], ЗначениеСтавкиНДС, Истина, Истина);
			СтрокаУслуг[ИмяПоляСтоимостьБезНДС] = СтрокаУслуг[ИмяПоляСтоимостьСНДС] - СуммаНДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьБлокировкуЭлементов()
	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы, Объект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика()
	
	НастройкиВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(Объект.ВидУслугПоставщика, "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");	
	//АдресНастроекВидаУслуг = ПоместитьВоВременноеХранилище(НастройкиВидаУслуг, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(АдресКэшаНастроекПолейПоУмолчанию) Тогда
		НастройкиПолейПоУмолчанию = ПолучитьИзВременногоХранилища(АдресКэшаНастроекПолейПоУмолчанию);
	Иначе
		НастройкиПолейПоУмолчанию = Новый Соответствие;
	КонецЕсли;
	
	ПоляТаблицыУслуг = НастройкиВидаУслуг.ПоляТаблицыУслуг;
	
	ПараметрыВидаУслуг = Новый Структура;
	ПараметрыВидаУслуг.Вставить("ВалютаПоУмолчанию", НастройкиВидаУслуг.ВалютаПоУмолчанию);
	ПараметрыВидаУслуг.Вставить("ТипУчетныхЕдиницДетализации", НастройкиВидаУслуг.ТипУчетныхЕдиницДетализации);
	
	СписокИменКолонок = Новый Массив;
	Для Каждого Колонка Из ПоляТаблицыУслуг.Колонки Цикл
		СписокИменКолонок.Добавить(Колонка.Имя);		
	КонецЦикла;
	ИменаКолонок = СтрСоединить(СписокИменКолонок, ",");
	
	ОписанияПолейТаблицыУслуг = Новый Соответствие;
	ЗначенияПолейПоУмолчанию = Новый Соответствие;
	Для Каждого СтрокаТаблицыПолей Из ПоляТаблицыУслуг Цикл
		ОписаниеПоля = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(ОписаниеПоля, СтрокаТаблицыПолей);
		ОписанияПолейТаблицыУслуг.Вставить(СтрокаТаблицыПолей.Имя, ОписаниеПоля);
		Если СтрокаТаблицыПолей.ЗначениеПоУмолчанию <> Неопределено Тогда
			ЗначенияПолейПоУмолчанию.Вставить(СтрокаТаблицыПолей.Имя, СтрокаТаблицыПолей.ЗначениеПоУмолчанию);
		КонецЕсли;
	КонецЦикла;
	ПараметрыВидаУслуг.Вставить("ПоляТаблицыУслуг", ОписанияПолейТаблицыУслуг);
	ПараметрыВидаУслуг.Вставить("ЗначенияПолейПоУмолчанию", ЗначенияПолейПоУмолчанию);
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТабличноеПолеУслуги = Элементы.Услуги;
	
	ЭлементыИсключения = Новый Массив;
	ЭлементыИсключения.Добавить("УслугиНомерСтроки");
	УстановитьВидимостьЭлементовГруппы(ТабличноеПолеУслуги, Ложь, ЭлементыИсключения);
		
	ГруппыПолей = Новый Соответствие;
	ГруппыПолей.Вставить("", Элементы.Услуги);
	Для Каждого ОписаниеПоля Из ПоляТаблицыУслуг Цикл
		
		ГруппаЭлементовРодитель = ГруппыПолей.Получить(ОписаниеПоля.Родитель);
		Если ОписаниеПоля.ЭтоГруппаЭлементов Тогда
			ГруппаЭлементов = Элементы.Найти("Услуги" + ОписаниеПоля.Имя);
			Если ГруппаЭлементов = Неопределено Тогда
				ГруппаЭлементов = Элементы.Добавить("Услуги" + ОписаниеПоля.Имя, Тип("ГруппаФормы"), ГруппаЭлементовРодитель);
			Иначе
				Элементы.Переместить(ГруппаЭлементов, ГруппаЭлементовРодитель);
			КонецЕсли;
			ГруппаЭлементов.Видимость = ОписаниеПоля.Выводить;
			ГруппаЭлементов.Заголовок = ОписаниеПоля.Представление;
			ГруппаЭлементов.ОтображатьВШапке = ОписаниеПоля.ОтображатьВШапке;
			ГруппаЭлементов.Группировка = ГруппировкаКолонок[ОписаниеПоля.Группировка];
			ГруппыПолей.Вставить(ОписаниеПоля.Имя, ГруппаЭлементов);
			
			Продолжить;
		Иначе
			Элемент = Элементы.Найти("Услуги" + ОписаниеПоля.Имя);
			//Элемент = ТабличноеПолеУслуги.ПодчиненныеЭлементы.Найти("Услуги" + ОписаниеПоля.Имя);
		КонецЕсли;
	
		Если Элемент <> Неопределено Тогда
			
			Элементы.Переместить(Элемент, ГруппаЭлементовРодитель);			
			Элемент.Заголовок = ОписаниеПоля.Представление;
			Элемент.Видимость = ОписаниеПоля.Выводить;
			Элемент.ТолькоПросмотр = ОписаниеПоля.ТолькоПросмотр;
			
			Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				
				//Если ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
				//	
				//	НастройкаПоля = НастройкиПолейПоУмолчанию.Получить(Элемент.Имя);
				//	Если НастройкаПоля = Неопределено Тогда
				//		НастройкиПолейПоУмолчанию.Вставить(Элемент.Имя, Новый Структура("СписокВыбора,ИсторияВыбораПриВводе,РедактированиеТекста,КнопкаВыбора,КнопкаСоздания",
				//				Элемент.СписокВыбора.ВыгрузитьЗначения(),
				//				Элемент.ИсторияВыбораПриВводе,
				//				Элемент.РедактированиеТекста,
				//				Элемент.КнопкаВыбора,
				//				Элемент.КнопкаСоздания));
				//	КонецЕсли;
				//	
				//	//Элемент.СписокВыбора.ЗагрузитьЗначения(ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения());
				//	//Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
				//	//Элемент.РедактированиеТекста = Ложь;
				//	//Элемент.КнопкаВыбора = Ложь;
				//	//Элемент.КнопкаСоздания = Ложь;
				//Иначе
				//	
				//	НастройкаПоля = НастройкиПолейПоУмолчанию.Получить(Элемент.Имя);
				//	Если НастройкаПоля <> Неопределено Тогда
				//		Элемент.СписокВыбора.ЗагрузитьЗначения(НастройкаПоля.СписокВыбора);
				//		Элемент.ИсторияВыбораПриВводе = НастройкаПоля.ИсторияВыбораПриВводе;
				//		//Элемент.РедактированиеТекста = НастройкаПоля.РедактированиеТекста;
				//		//Элемент.КнопкаВыбора = НастройкаПоля.КнопкаВыбора;
				//		//Элемент.КнопкаСоздания = НастройкаПоля.КнопкаСоздания;
				//	КонецЕсли;
				//	
				//КонецЕсли;
					
				Если ЗначениеЗаполнено(ОписаниеПоля.ОграничениеТипа) Тогда
					СтрокаТипы = СтрСоединить(ОписаниеПоля.ОграничениеТипа, ",");
					Элемент.ОграничениеТипа = Новый ОписаниеТипов(СтрокаТипы);
				Иначе
					Элемент.ОграничениеТипа = Новый ОписаниеТипов;
				КонецЕсли;
				
				ПараметрыВыбораПоля = Новый Массив;
				Если ЗначениеЗаполнено(ОписаниеПоля.ПараметрыВыбора) Тогда
					Для Каждого ПараметрВыбора Из ОписаниеПоля.ПараметрыВыбора Цикл
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.ИмяПараметра, ПараметрВыбора.ЗначениеПараметра);
						ПараметрыВыбораПоля.Добавить(НовыйПараметр);
					КонецЦикла;
				КонецЕсли;
				Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоля);
				
				Если ОписаниеПоля.Обязательное Тогда
					Элемент.АвтоОтметкаНезаполненного = Истина;
				Иначе
					Элемент.АвтоОтметкаНезаполненного = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресКэшаНастроекПолейПоУмолчанию) Тогда
		АдресКэшаНастроекПолейПоУмолчанию = ПоместитьВоВременноеХранилище(НастройкиПолейПоУмолчанию, АдресКэшаНастроекПолейПоУмолчанию);
	Иначе
		АдресКэшаНастроекПолейПоУмолчанию = ПоместитьВоВременноеХранилище(НастройкиПолейПоУмолчанию, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные, ОбновитьПоляТЧКритерии = Ложь)
	
	СтрокиУслуг = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекДанные);
	ОбновитьДинамическиеПоляТаблицыУслуг(СтрокиУслуг, ОбновитьПоляТЧКритерии);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеПоляТаблицыУслуг(СтрокиУслуг = Неопределено, ОбновитьПоляТЧКритерии = Ложь)
	
	ТипоразмерКТКПустаяСсылка = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	ТипоразмерыТСПустаяСсылка = Справочники.ТипоразмерыТС.ПустаяСсылка(); //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	ВидОтправкиПустаяСсылка = Перечисления.ВидыОтправок.ПустаяСсылка(); //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	ТаблицаКритерииУслуг = Объект.КритерииУслуг.Выгрузить();
	ТаблицаКритерииУслуг.Индексы.Добавить("ИдентификаторСтрокиУслуг");
	
	Если СтрокиУслуг <> Неопределено Тогда
		Услуги = СтрокиУслуг;
	Иначе
		Услуги = Объект.Услуги;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.ПунктОтправления КАК ПунктОтправления,
	|	Услуги.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления КАК Станция,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ КАК ЖелезнаяДорога
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправления = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктОтправления = Локации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначения = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктНазначения = Локации.Ссылка";
	
	ПоляТаблицыУслуг = "НомерСтроки, ИдентификаторСтрокиУслуг, ПунктОтправления, ПунктНазначения";
	Запрос.УстановитьПараметр("Услуги", Объект.Услуги.Выгрузить(СтрокиУслуг, ПоляТаблицыУслуг));
	
	Запрос.УстановитьПараметр("ДорогаПустаяСсылка", Справочники.ЖелезныеДороги.ПустаяСсылка());
	
	Результаты = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результаты.Количество();	
	ТаблицаДорог = Результаты[КоличествоРезультатов - 1].Выгрузить();
	
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		КритерииПоУслуге = Новый Массив;
		// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
		Продукты = Новый Массив;
		// Евросиб Рыбьяков К.А. 19.03.2025 ))
		УчетныеНаправления = Новый Массив;
		СтрокиТаблицыКритериев = ТаблицаКритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		
		ТаблицаКритериевПоСтрокеУслуги = ТаблицаКритерииУслуг.Скопировать(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
		
		Если ОбновитьПоляТЧКритерии Тогда
			
			ВидыОтправок = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ВидОтправки");
			ВидыОтправок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыОтправок);
			ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ВидыОтправок, ВидОтправкиПустаяСсылка);
			СтрокаУслуги.ВидыОтправок.ЗагрузитьЗначения(ВидыОтправок);
			СтрокаУслуги.ВидыОтправокСтрокой = СтрСоединить(ВидыОтправок, "; ");
			
			ТипоразмерыКТК = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ТипоразмерКТК");
			ТипоразмерыКТК = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипоразмерыКТК);
			ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ТипоразмерыКТК, ТипоразмерКТКПустаяСсылка);
			СтрокаУслуги.ТипоразмерыКТК.ЗагрузитьЗначения(ТипоразмерыКТК);
			СтрокаУслуги.ТипоразмерыКТКСтрокой = СтрСоединить(ТипоразмерыКТК, "; ");
			
			ТаблицаТипоразмерыВагонов = ТаблицаКритериевПоСтрокеУслуги.Скопировать(, "ТипоразмерВагона");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗТипорамерыТС.ТипоразмерВагона КАК ТипоразмерВагона
			|ПОМЕСТИТЬ ВТ_ТипоразмерыВагонов
			|ИЗ
			|	&ТЗТипорамерыТС КАК ТЗТипорамерыТС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТипоразмерыВагонов.ТипоразмерВагона КАК ТипоразмерВагона,
			|	ТипоразмерыТС.Код КАК ТипоразмерВагонаКод
			|ИЗ
			|	ВТ_ТипоразмерыВагонов КАК ВТ_ТипоразмерыВагонов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
			|		ПО ВТ_ТипоразмерыВагонов.ТипоразмерВагона = ТипоразмерыТС.Ссылка";
			
			Запрос.УстановитьПараметр("ТЗТипорамерыТС",ТаблицаТипоразмерыВагонов);
			ТаблицаТипоразмерыВагонов = Запрос.Выполнить().Выгрузить();		
			
			ТаблицаТипоразмерыВагонов.Свернуть("ТипоразмерВагона,ТипоразмерВагонаКод");
			ПустыеСтроки = ТаблицаТипоразмерыВагонов.НайтиСтроки(Новый Структура("ТипоразмерВагона", ТипоразмерыТСПустаяСсылка));
			Для Каждого Стр Из ПустыеСтроки Цикл
				ТаблицаТипоразмерыВагонов.Удалить(Стр);
			КонецЦикла;
			ТаблицаТипоразмерыВагонов.Сортировать("ТипоразмерВагонаКод");
			ТипоразмерыВагонов = ТаблицаТипоразмерыВагонов.ВыгрузитьКолонку("ТипоразмерВагона");
			СтрокаУслуги.ТипоразмерыВагонов.ЗагрузитьЗначения(ТипоразмерыВагонов);
			СтрокаУслуги.ТипоразмерыВагоновСтрокой = СтрСоединить(ТаблицаТипоразмерыВагонов.ВыгрузитьКолонку("ТипоразмерВагонаКод"), "; ");
			Если ТипоразмерыВагонов.Количество() = 1 Тогда
				СтрокаУслуги.ТипоразмерВагона = ТипоразмерыВагонов[0];
			Иначе
				СтрокаУслуги.ТипоразмерВагона = ТипоразмерыТСПустаяСсылка;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Для Каждого СтрокаТаблицыКритериев Из СтрокиТаблицыКритериев Цикл
			
			Если ОбновитьПоляТЧКритерии Тогда
				
				Если СтрокаТаблицыКритериев.РазмерКТК = "20" Тогда
					СтрокаУслуги.ТипоразмерКТК20 = СтрокаТаблицыКритериев.ТипоразмерКТК;
					СтрокаУслуги.СтоимостьБезНДС_КТК20 = СтрокаТаблицыКритериев.СтоимостьБезНДС;
					СтрокаУслуги.СтоимостьСНДС_КТК20 = СтрокаТаблицыКритериев.СтоимостьСНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
					СтрокаУслуги.СтавкаЗаКМ20FutБезНДС = СтрокаТаблицыКритериев.СтавкаЗаКМ20FutБезНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				ИначеЕсли СтрокаТаблицыКритериев.РазмерКТК = "40" Тогда
					СтрокаУслуги.ТипоразмерКТК40 = СтрокаТаблицыКритериев.ТипоразмерКТК;
					СтрокаУслуги.СтоимостьБезНДС_КТК40 = СтрокаТаблицыКритериев.СтоимостьБезНДС;
					СтрокаУслуги.СтоимостьСНДС_КТК40 = СтрокаТаблицыКритериев.СтоимостьСНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
					СтрокаУслуги.СтавкаЗаКМ40FutБезНДС = СтрокаТаблицыКритериев.СтавкаЗаКМ40FutБезНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				Иначе
					СтрокаУслуги.ТипоразмерКТК20 = ТипоразмерКТКПустаяСсылка;
					СтрокаУслуги.ТипоразмерКТК40 = ТипоразмерКТКПустаяСсылка;
					СтрокаУслуги.СтоимостьБезНДС = СтрокаТаблицыКритериев.СтоимостьБезНДС;
					СтрокаУслуги.СтоимостьСНДС = СтрокаТаблицыКритериев.СтоимостьСНДС;
					СтрокаУслуги.СтоимостьЗаСуткиБезНДС = СтрокаТаблицыКритериев.СтоимостьЗаСуткиБезНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
					СтрокаУслуги.СтавкаЗаКМ40FutБезНДС = СтрокаТаблицыКритериев.СтавкаЗаКМ40FutБезНДС;
					СтрокаУслуги.СтавкаЗаКМ20FutБезНДС = СтрокаТаблицыКритериев.СтавкаЗаКМ20FutБезНДС;
					//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицыКритериев.Критерий) Тогда
					КритерииПоУслуге.Добавить(СтрокаТаблицыКритериев.Критерий);
				КонецЕсли;
				
				// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
				Если ЗначениеЗаполнено(СтрокаТаблицыКритериев.Продукт) Тогда
					Продукты.Добавить(СтрокаТаблицыКритериев.Продукт);
				КонецЕсли;
				// Евросиб Рыбьяков К.А. 19.03.2025 ))
				
				Если ЗначениеЗаполнено(СтрокаТаблицыКритериев.УчетноеНаправление) Тогда
					УчетныеНаправления.Добавить(СтрокаТаблицыКритериев.УчетноеНаправление);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктОтправления) Тогда			
				Дороги = ТаблицаДорог.Скопировать(Новый Структура("Станция", СтрокаУслуги.ПунктОтправления));
				НаименованияДорог = Дороги.ВыгрузитьКолонку("ЖелезнаяДорога");
				СтрокаДороги = СтрСоединить(НаименованияДорог, "; ");
				СтрокаУслуги.ДорогаОтправления = СтрокаДороги;
			Иначе
				СтрокаУслуги.ДорогаОтправления = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктНазначения) Тогда
				Дороги = ТаблицаДорог.Скопировать(Новый Структура("Станция", СтрокаУслуги.ПунктНазначения));
				НаименованияДорог = Дороги.ВыгрузитьКолонку("ЖелезнаяДорога");
				СтрокаДороги = СтрСоединить(НаименованияДорог, "; ");
				СтрокаУслуги.ДорогаНазначения = СтрокаДороги;
			Иначе
				СтрокаУслуги.ДорогаНазначения = "";
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОбновитьПоляТЧКритерии Тогда
			Продукты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Продукты);
			// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
			СтрокаУслуги.Продукт.ЗагрузитьЗначения(Продукты);
			// Евросиб Рыбьяков К.А. 19.03.2025 ))
			СтрокаУслуги.ПродуктСтрокой = СтрСоединить(Продукты, ", ");
			
			УчетныеНаправления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УчетныеНаправления);
			СтрокаУслуги.УчетныеНаправления.ЗагрузитьЗначения(УчетныеНаправления);
			СтрокаУслуги.УчетныеНаправленияСтрокой = СтрСоединить(УчетныеНаправления, ", ");
			
			СтрокаУслуги.Критерии.ЗагрузитьЗначения(КритерииПоУслуге);
			// Евросиб US 98207 TA 100593 Рыбьяков К.А. 03.04.2025 ((
			КритерииПоУслуге = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КритерииПоУслуге);
			СтрокаУслуги.КритерииСтрокой = СтрСоединить(КритерииПоУслуге, Символы.ПС);
			// Евросиб Рыбьяков К.А. 03.04.2025 ))
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовГруппы(ГруппаЭлементов, Видимость, Исключения)
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	
	Для Каждого Элемент Из ГруппаЭлементов.ПодчиненныеЭлементы Цикл
		
		Если Исключения.Найти(Элемент.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = ТипГруппаФормы Тогда
			УстановитьВидимостьЭлементовГруппы(Элемент, Видимость, Исключения);
		КонецЕсли;
		
		Элемент.Видимость = Видимость;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВидУслугПоставщикаПриИзмененииСервер()
	
	Объект.НомерПСЦ = "";
	НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОчереднойДокумента(ДатаПСЦ, ВидУслуг, Ссылка)
	
	Возврат Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПолучитьОчереднойНомерДокумента(ДатаПСЦ, ВидУслуг, Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ОтменаСогласования(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;  
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦ(ПараметрыЗапроса, объект.Дата); 
	
	Для Каждого Стр Из РезультатЗапроса Цикл  
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ОтменаСогласованияПродолжение", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ОтзывСогласования",, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаСогласованияПродолжение(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Комментарий) Тогда		
		Возврат;
	КонецЕсли;  
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦПоставщика(ПараметрыЗапроса, объект.Дата); 
	
	Для Каждого Стр Из РезультатЗапроса Цикл  
		
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
		
	КонецЦикла;
	
	ВозвращаемыеЗадачи = Новый Массив;
	Если Объект.Состояния.Количество() > 0 Тогда
		СтрСостояния = Объект.Состояния[0];
		СтрСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		СтрСостояния.ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(СтрСостояния.Состояние);
	КонецЕсли;
	
	Для Сч = 1 По Объект.Состояния.Количество()-1 Цикл
		
		Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		Если ЗначениеЗаполнено(Объект.Состояния[Сч].СтатусСогласования) Тогда
			Объект.Состояния[Сч].СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется");
			Объект.Состояния[Сч].Комментарий = Комментарий;
		КонецЕсли;
		
		Объект.Состояния[Сч].ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(Объект.Состояния[Сч].Состояние);
		
	КонецЦикла;
	
	Объект.ДатаСогласования=Дата(1,1,1);	
	
	ЗаписатьОтменуСогласования(ВозвращаемыеЗадачи);
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтменуСогласования(ВозвращаемыеЗадачи)
	
	УстановитьПривилегированныйРежим(Истина);

	ПараметрыЗаписи = Новый Структура("РежимЗаписи, ИзмененыТолькоРазрешенныеПоля", РежимЗаписиДокумента.ОтменаПроведения, Истина);	
	ПараметрыЗаписи.Вставить("ВозвращаемыеЗадачи", ВозвращаемыеЗадачи);
	
	Записать(ПараметрыЗаписи);

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСогласование(Состояние)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Состояние, "Согласование");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
		
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()

	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
	КолСостоянийЗавершено = 0;
	
	Для каждого Стр из Объект.Ссылка.Состояния Цикл //Гудкова добавила ссылку
		
		Если Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		
			КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
		
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСостоянийВсего = Объект.Ссылка.Состояния.Количество();	
	Если ЗначениеЗаполнено(Объект.Ссылка) И КолСостоянийЗавершено = КоличествоСостоянийВсего И КоличествоСостоянийВсего <> 0 Тогда
		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
		
		Элементы.ПредупреждениеРедактирования.Заголовок = "Документ полностью отработан. Запись заблокирована";
	Иначе	
		Элементы.ГруппаИнформацияОДокументе.Видимость = Ложь;
	КонецЕсли;
	
	//Элементы.СсылкаНаПротоколВДО.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО);

КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПолучитьДопДанныеЛокации(Локация, ДанныеЛокации) 

	Если ЗначениеЗаполнено(Локация) Тогда
		
		Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
			
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЛокации.Адрес = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Локация, "Адрес");
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЛокации.Город = ПолучитьЛокациюВышестоящегоУровня(Локация, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЛокации.Страна = ПолучитьЛокациюВышестоящегоУровня(Локация, Перечисления.ТипыИерархииЛокации.Страна);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
			
			Если ДанныеЛокации.Свойство("Город") Тогда				
				Города = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Локация, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);
				Если Города.Количество() = 1 Тогда
					ДанныеЛокации.Город = Города[0];
				Иначе
					ДанныеЛокации.Город = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеЛокации.Свойство("Страна") Тогда
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Локация, Перечисления.ТипыИерархииЛокации.Страна);
				Если Страны.Количество() = 1 Тогда
					ДанныеЛокации.Страна = Страны[0];
				Иначе
					ДанныеЛокации.Страна = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛокациюВышестоящегоУровня(Локация, ТипИерархии)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
	|ИЗ
	|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|ГДЕ
	|	ИерархияЛокаций.Локация = &Локация
	|	И ИерархияЛокаций.ТипИерархии = &ТипИерархии";
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("ТипИерархии", ТипИерархии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЛокацияВышестоящегоУровня = Выборка.ЛокацияВышестоящегоУровня;
	Иначе
		ЛокацияВышестоящегоУровня = Справочники.Локации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЛокацияВышестоящегоУровня;
	
КонецФункции

&НаСервере
Функция ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Мультилокация, ТипИерархии)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО МультилокацииЛокации.Локация = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархии)
	|ГДЕ
	|	МультилокацииЛокации.Ссылка = &Мультилокация";
	Запрос.УстановитьПараметр("Мультилокация", Мультилокация);
	Запрос.УстановитьПараметр("ТипИерархии", ТипИерархии);
	
	ТаблицаЛокаций = Запрос.Выполнить().Выгрузить();
	ЛокацииВышестоящегоУровня = ТаблицаЛокаций.ВыгрузитьКолонку("ЛокацияВышестоящегоУровня");
	
	Возврат ЛокацииВышестоящегоУровня;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораТипаПоляЛокации(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		ИмяПоля = ДопПараметры.ИмяПоля;
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультилокации") Тогда
			ТекДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Мультилокации.ПустаяСсылка");
		Иначе
			ТекДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораЛокации(Элемент, ИмяПоля, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные[ИмяПоля] = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элемент.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, ИмяПоля);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеВниз(Элемент = Неопределено)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		ПроверенныеСтроки = Новый Массив;
		ИндексСледующейСтроки = Объект.Услуги.Индекс(ТекДанные) + 1;
		ИндексПоследнейСтроки = Объект.Услуги.Количество() - 1;
		Для ИндексСтроки = ИндексСледующейСтроки По ИндексПоследнейСтроки Цикл
			СтрокаТЧ = Объект.Услуги[ИндексСтроки];
			ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор();
			РезПроверки = Элементы.Услуги.ПроверитьСтроку(ИдентификаторСтроки);
			Если РезПроверки Тогда
				ПроверенныеСтроки.Добавить(ИдентификаторСтроки);
			КонецЕсли;					
		КонецЦикла;			
		
		Если ЗначениеЗаполнено(ПроверенныеСтроки) Тогда
			ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
			ИмяТекущегоЭлемента = Элементы.Услуги.ТекущийЭлемент.Имя;
			ВыполнитьЗаполнениеВнизСервер(ТекСтрока, ПроверенныеСтроки, ИмяТекущегоЭлемента);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеВнизСервер(ТекСтрока, ПроверенныеСтроки, ИмяЭлемента)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ТекЭлемент = Элементы[ИмяЭлемента];
	НомерСимволаНачалаИмениПоля = 7;
	ИмяПоля = Сред(ИмяЭлемента, НомерСимволаНачалаИмениПоля);
	ИмяПоляТЧ = СтрЗаменить(ТекЭлемент.ПутьКДанным, "Объект.Услуги.", "");
	УстановитьСтавкуНДС = Ложь;//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	ТипСписокЗначений = Тип("СписокЗначений");
	
	ДанныеЗаполнения = Новый Структура;
	
	Если ИмяПоля = "УчетныеНаправленияСтрокой" Тогда
		
		ИмяПоляТЧ = "УчетныеНаправления";
		
	ИначеЕсли ИмяПоля = "Номенклатура" Тогда
		УстановитьСтавкуНДС = Истина; //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Номенклатура, "ЕдиницаИзмерения");				
		Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения) Тогда
			ДанныеЗаполнения.Вставить("ЕдиницаИзмерения", ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения);
		КонецЕсли;
		
		ОписаниеПоляВидСобственности = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ВидСобственности");
		Если ОписаниеПоляВидСобственности <> Неопределено Тогда
			Если ТекДанные.Номенклатура = Справочники.Номенклатура.АрендаКонтейнеров Тогда
				ДанныеЗаполнения.Вставить("ВидСобственности", Перечисления.ВариантыСобственности.АрендаДлительная);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "ПунктОтправления" Тогда
		
		ДанныеЛокации = Новый Структура;
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаВыдачиПостановкиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктОтправленияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктОтправления, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЗаполнения.Вставить("АдресТерминалаВыдачиПостановкиКТК", ДанныеЛокации.Адрес);
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЗаполнения.Вставить("ПунктОтправленияГород", ДанныеЛокации.Город);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЗаполнения.Вставить("ПунктОтправленияСтрана", ДанныеЛокации.Страна);
			КонецЕсли;			
		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "ПунктНазначения" Тогда
		
		ДанныеЛокации = Новый Структура;
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаСдачиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктНазначенияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктНазначения, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЗаполнения.Вставить("АдресТерминалаСдачиКТК", ДанныеЛокации.Адрес);
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЗаполнения.Вставить("ПунктНазначенияГород", ДанныеЛокации.Город);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЗаполнения.Вставить("ПунктНазначенияСтрана", ДанныеЛокации.Страна);
			КонецЕсли;			
		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "ПунктОтправленияГород" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
				Если ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда				
					ПунктОтправленияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
				ИначеЕсли ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Мультилокации") Тогда					
					Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
					Если Страны.Количество() = 1 Тогда
						ПунктОтправленияСтрана = Страны[0];
					Иначе
						ПунктОтправленияСтрана = ЛокацияПустаяСсылка
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			ДанныеЗаполнения.Вставить("ПунктОтправленияСтрана", ПунктОтправленияСтрана);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПунктОтправления", ЛокацияПустаяСсылка);
		
	ИначеЕсли ИмяПоля = "ПунктНазначенияГород" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
				Если ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда				
					ПунктНазначенияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
				ИначеЕсли ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Мультилокации") Тогда
					Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
					Если Страны.Количество() = 1 Тогда
						ПунктНазначенияСтрана = Страны[0];
					Иначе
						ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			ДанныеЗаполнения.Вставить("ПунктНазначенияСтрана", ПунктНазначенияСтрана);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПунктНазначения", ЛокацияПустаяСсылка);
		
	ИначеЕсли ИмяПоля = "ПунктОтправленияСтрана" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		ДанныеЗаполнения.Вставить("ПунктОтправления", ЛокацияПустаяСсылка);
		ДанныеЗаполнения.Вставить("ПунктОтправленияГород", ЛокацияПустаяСсылка);
		
	ИначеЕсли ИмяПоля = "ПунктНазначенияСтрана" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		ДанныеЗаполнения.Вставить("ПунктНазначения", ЛокацияПустаяСсылка);
		ДанныеЗаполнения.Вставить("ПунктНазначенияГород", ЛокацияПустаяСсылка);
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025	
	ИначеЕсли ИмяПоля = "ТипоразмерыКТК" Или ИмяПоля = "ТипоразмерыКТКСтрокой" Тогда
		
		ИмяПоляТЧ = "ТипоразмерыКТК";
		СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "ТипоразмерыВагонов" Или ИмяПоля = "ТипоразмерыВагоновСтрокой" Или ИмяПоля = "ТипоразмерВагона" Тогда
		
		ИмяПоляТЧ = "ТипоразмерыВагонов";
		
	КонецЕсли;
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	НовоеЗначение = ТекДанные[ИмяПоляТЧ];
	
	Если ТипЗнч(НовоеЗначение) = ТипСписокЗначений Тогда
		ЗначенияСписка = НовоеЗначение.ВыгрузитьЗначения();
	Иначе
		ЗначенияСписка = Неопределено;
	КонецЕсли;
	
	ОбработанныеСтроки = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из ПроверенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		РезПроверки = Истина;
		
		Если ЗначенияСписка = Неопределено И СтрокаТЧ[ИмяПоляТЧ] = НовоеЗначение Тогда
			РезПроверки = Ложь;
		КонецЕсли;
		
		Если РезПроверки Тогда
			//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
			Если УстановитьСтавкуНДС Тогда
				ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ);
			КонецЕсли;
			//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
			Если ЗначенияСписка <> Неопределено Тогда
				СтрокаТЧ[ИмяПоляТЧ].ЗагрузитьЗначения(ЗначенияСписка);
			Иначе
				СтрокаТЧ[ИмяПоляТЧ] = НовоеЗначение;
			КонецЕсли;
			
			Если ИмяПоля = "Продукт" Или ИмяПоля = "ПродуктСтрокой" Тогда
				
				ОбработатьИзменениеПродуктовУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "УчетныеНаправления" Или ИмяПоля = "УчетныеНаправленияСтрокой" Тогда
				
				ОбработатьИзменениеУчетныхНаправленийСтрокиУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "СтоимостьБезНДС" Тогда
				
				ОбработатьИзменениеСтоимостиБезНДСВСтрокеУслуг(СтрокаТЧ);
			//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025	
			ИначеЕсли ИмяПоля = "ТипоразмерыКТК" Или ИмяПоля = "ТипоразмерыКТКСтрокой" Тогда
				
				ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоляТЧ = "ТипоразмерыВагонов" Или ИмяПоля = "ТипоразмерыВагоновСтрокой" Тогда
				
				ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(СтрокаТЧ);
			//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025	
			ИначеЕсли ИмяПоля = "СтоимостьСНДС" Тогда
				
				ОбработатьИзменениеСтоимостиСНДСВСтрокеУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "СтоимостьБезНДС_КТК20" Тогда
				
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ, "СтоимостьБезНДС_КТК20", "СтоимостьСНДС_КТК20", "СтоимостьСНДС_КТК20");
					
			 	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				Если ЗначениеЗаполнено(СтрокаТЧ.Километраж) Тогда
					СтрокаТЧ.СтавкаЗаКМ20FutБезНДС = СтрокаТЧ.СтоимостьБезНДС_КТК20 / СтрокаТЧ.Километраж;	
				КонецЕсли;
				//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				
			ИначеЕсли ИмяПоля = "СтоимостьСНДС_КТК20" Тогда
								
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ, "СтоимостьБезНДС_КТК20", "СтоимостьСНДС_КТК20", "СтоимостьБезНДС_КТК20");
				
			ИначеЕсли ИмяПоля = "СтоимостьБезНДС_КТК40" Тогда
				
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ, "СтоимостьБезНДС_КТК40", "СтоимостьСНДС_КТК40", "СтоимостьСНДС_КТК40");
				
				//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				Если ЗначениеЗаполнено(СтрокаТЧ.Километраж) Тогда
					СтрокаТЧ.СтавкаЗаКМ40FutБезНДС = СтрокаТЧ.СтоимостьБезНДС_КТК40 / СтрокаТЧ.Километраж;	
				КонецЕсли;
				//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				
			ИначеЕсли ИмяПоля = "СтоимостьСНДС_КТК40" Тогда
								
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ, "СтоимостьБезНДС_КТК40", "СтоимостьСНДС_КТК40", "СтоимостьБезНДС_КТК40");
			
			ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
				
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "НормаПользования" Тогда
				
				ОбработатьИзменениеНормыПользованияВСтрокеУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "Километраж" Тогда //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
				
				Если ЗначениеЗаполнено(СтрокаТЧ.СтоимостьБезНДС_КТК40) И ЗначениеЗаполнено(СтрокаТЧ.Километраж) Тогда
					СтрокаТЧ.СтавкаЗаКМ40FutБезНДС = СтрокаТЧ.СтоимостьБезНДС_КТК40 / СтрокаТЧ.Километраж;
				КонецЕсли;	
				Если ЗначениеЗаполнено(СтрокаТЧ.СтоимостьБезНДС_КТК20) И ЗначениеЗаполнено(СтрокаТЧ.Километраж) Тогда
					СтрокаТЧ.СтавкаЗаКМ20FutБезНДС = СтрокаТЧ.СтоимостьБезНДС_КТК20 / СтрокаТЧ.Километраж;	
				КонецЕсли;	
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеЗаполнения);
			КонецЕсли;
			
			ОбработанныеСтроки.Добавить(СтрокаТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОбработанныеСтроки) Тогда
		ОбновитьДинамическиеПоляТаблицыУслуг(ОбработанныеСтроки, Ложь);
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	Типоразмеры = ТекДанные.ТипоразмерыВагонов.ВыгрузитьЗначения();
	КодыТипоразмеров = ПолучитьКодыТипоразмеровВагонов(Типоразмеры);
	ТекДанные.ТипоразмерыВагоновСтрокой = СтрСоединить(КодыТипоразмеров, "; ");
	//СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	ТекДанные.ТипоразмерыКТКСтрокой = СтрСоединить(ТекДанные.ТипоразмерыКТК.ВыгрузитьЗначения(), "; ");
	ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	//Если ЗначениеЗаполнено(ТекДанные.НормаЗагрузкиКТК) Тогда
	//	
	//	СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
	//	ЗначениеНайдено = Ложь;
	//	Если ЗначениеЗаполнено(ТекДанные.ТипоразмерыКТК) Тогда				
	//		Для Каждого ТипоразмерКТК Из ТекДанные.ТипоразмерыКТК Цикл
	//			Веса = СоответствиеВесовТипоразмерам.Получить(ТипоразмерКТК.Значение);
	//			Если ЗначениеЗаполнено(Веса) И Веса.Найти(ТекДанные.НормаЗагрузкиКТК) <> Неопределено Тогда
	//				ЗначениеНайдено = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;							
	//	КонецЕсли;
	//	
	//	Если Не ЗначениеНайдено Тогда
	//		ТекДанные.НормаЗагрузкиКТК = Справочники.ВесаПоТипоразмерам.ПустаяСсылка();
	//	КонецЕсли;
	//	
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВнесенияСтавокИзExcel(ВариантФормы)
	
	АдресТаблицыОписанияРеквизитов = ПоместитьОписаниеПолейВоВременноеХранилище(Объект.ВидУслугПоставщика, Новый УникальныйИдентификатор); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресТаблицыОписанияРеквизитов", АдресТаблицыОписанияРеквизитов);
	ПараметрыФормы.Вставить("ВариантФормы", ВариантФормы);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("АдресТаблицыОписанияРеквизитов", АдресТаблицыОписанияРеквизитов);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыЗагрузкиИзExcel", ЭтаФорма, ДопПараметры);
	
	ОткрытьФорму("Документ.ПСЦПоставщика.Форма.ФормаЗагрузкиИзExcel", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодыТипоразмеровВагонов(ТипоразмерыВагонов) //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Типоразмеры", ТипоразмерыВагонов);	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипоразмерыТС.Код КАК Код
	|ИЗ
	|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|ГДЕ
	|	ТипоразмерыТС.Ссылка В(&Типоразмеры)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеВесовТипоразмерам() //Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТЕВеса.Ссылка КАК ТипоразмерКТК,
	|	ТипоразмерыТЕВеса.Вес КАК Вес
	|ИЗ
	|	Справочник.ТипоразмерыТЕ.Веса КАК ТипоразмерыТЕВеса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипоразмерКТК,
	|	Вес";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеВесовТипоразмерам = Новый Соответствие;
	Пока Выборка.СледующийПоЗначениюПоля("ТипоразмерКТК") Цикл
		Веса = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("Вес") Цикл
			Веса.Добавить(Выборка.Вес);
		КонецЦикла;
		СоответствиеВесовТипоразмерам.Вставить(Выборка.ТипоразмерКТК, Веса);
	КонецЦикла;
	
	Возврат СоответствиеВесовТипоразмерам;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоместитьОписаниеПолейВоВременноеХранилище(ВидУслугПоставщика, Адрес)
	
	НастройкаВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(ВидУслугПоставщика, "ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Услуги");
	ТаблицаПолей = НастройкаВидаУслуг.ПоляТаблицыУслуг;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаПолей, Адрес);
	
	Возврат АдресХранилища;
		
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыЗагрузкиИзExcel(АдресТаблицы, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(АдресТаблицы) Тогда
		ЗагрузитьПрочитаннуюТаблицу(АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрочитаннуюТаблицу(АдресТаблицы)
	
	Таблица = ПолучитьИзВременногоХранилища(АдресТаблицы);
	УдалитьИзВременногоХранилища(АдресТаблицы);
	
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ВалютаПоУмолчанию) Тогда
		ВалютаПоУмолчанию = ПараметрыВидаУслуг.ВалютаПоУмолчанию;
	Иначе
		ВалютаПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
	КонецЕсли;
	//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	// Евросиб US 98207 TA 105661 Рыбьяков К.А. 02.04.2025 ((
	Если Таблица.Колонки.Найти("ПродуктыСписок") <> Неопределено Тогда
		ЗагружатьПродуктыСписок = Истина;
	Иначе
		ЗагружатьПродуктыСписок = Ложь;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 02.04.2025 ))
	
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	Если Таблица.Колонки.Найти("ТипоразмерыКТК") <> Неопределено И Таблица.Колонки.Найти("ТипоразмерыКТКСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыКТК = Истина;
	Иначе
		ЗагружатьТипоразмерыКТК = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ТипоразмерыКТКСтрокой") <> Неопределено И Таблица.Колонки.Найти("ТипоразмерыКТКСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыКТКСтрокой = Истина;
	Иначе
		ЗагружатьТипоразмерыКТКСтрокой = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ТипоразмерыВагоновСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыВагоновСписок = Истина;
	Иначе
		ЗагружатьТипоразмерыВагоновСписок = Ложь;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
	
	СписокИсключаемыхИзЗаполненияПолей = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить(Колонка.Имя);
		Если ОписаниеПоля <> Неопределено И ОписаниеПоля.ТолькоПросмотр Тогда
			СписокИсключаемыхИзЗаполненияПолей.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	ИсключаемыеИзЗаполненияПоля = СтрСоединить(СписокИсключаемыхИзЗаполненияПолей, ",");
	
	Для Каждого Стр Из Таблица Цикл
		
		ТекДанные = Объект.Услуги.Добавить();
		ИдентификаторСтроки = ТекДанные.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ТекДанные, Стр,, ИсключаемыеИзЗаполненияПоля);
		ТекДанные.ИдентификаторСтрокиУслуг = Строка(Новый УникальныйИдентификатор);
		
		Для Каждого Элемент Из ПараметрыВидаУслуг.ЗначенияПолейПоУмолчанию Цикл
			Если Не ЗначениеЗаполнено(ТекДанные[Элемент.Ключ]) Тогда
				ТекДанные[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Если ЗагружатьТипоразмерыКТКСтрокой И ЗначениеЗаполнено(Стр.ТипоразмерыКТКСписок) Тогда
			ТекДанные.ТипоразмерыКТК.ЗагрузитьЗначения(Стр.ТипоразмерыКТКСписок.ВыгрузитьЗначения());
			ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
		КонецЕсли;
		
		Если ЗагружатьТипоразмерыКТК И ЗначениеЗаполнено(Стр.ТипоразмерыКТКСписок) Тогда
			ТекДанные.ТипоразмерыКТК.ЗагрузитьЗначения(Стр.ТипоразмерыКТКСписок.ВыгрузитьЗначения());
			ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
		КонецЕсли;
		
		Если ЗагружатьТипоразмерыВагоновСписок И ЗначениеЗаполнено(Стр.ТипоразмерыВагоновСписок) Тогда
			ТекДанные.ТипоразмерыВагонов.ЗагрузитьЗначения(Стр.ТипоразмерыВагоновСписок.ВыгрузитьЗначения());
			ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025
		Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
			ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
			ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные);
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
			ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		Если Не ЗначениеЗаполнено(ТекДанные.Валюта) Тогда
			ТекДанные.Валюта = ВалютаПоУмолчанию;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
			ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные);
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
			ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные);
		КонецЕсли;
		
		// Евросиб US 98207 TA 105661 Рыбьяков К.А. 02.04.2025 ((
		Если ЗагружатьПродуктыСписок И ЗначениеЗаполнено(Стр.ПродуктыСписок) Тогда
			ТекДанные.Продукт.ЗагрузитьЗначения(Стр.ПродуктыСписок.ВыгрузитьЗначения());
			ОбработатьИзменениеПродуктовУслуг(ТекДанные);
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 02.04.2025 ))
		
		ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные);
		
		РассчитатьСтоимостьЗаСуткиБезНДС(ТекДанные);
		
		ПересчетСтавкиЗаКМБезНДССервер(ТекДанные); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ИмяПоля = Сред(Элемент.Имя, 7);
	Локация = ТекДанные[ИмяПоля];
	Если ЗначениеЗаполнено(Локация) Тогда
		Если ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Локация);
			ПараметрыВыбораЛокаций = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элемент.ПараметрыВыбора);
			ПараметрыФормы.Вставить("ПараметрыВыбораЛокаций", ПараметрыВыбораЛокаций);
			ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПослеУдаленияНаСервере(УдаляемыеСтроки)
	
	Для Каждого ИдентификаторСтроки Из УдаляемыеСтроки Цикл
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	
	УдаленныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	УслугиПослеУдаленияНаСервере(УдаленныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОкончаниеДействия) Тогда
		Объект.ДействуетДоСогласованияНовыхУсловий = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Отладка(Команда)
	
	Включить = Не Элементы.ФормаОтладка.Пометка;
	Элементы.ФормаОтладка.Пометка = Включить;
	Элементы.ГруппаОтладка.Видимость = Включить;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПродуктыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	Продукты = ПолучитьПродукты();
	СписокПродуктов = Новый СписокЗначений;
	СписокПродуктов.ЗагрузитьЗначения(Продукты);
		
	Для Каждого ЭлементСписка Из СписокПродуктов Цикл
		ВыбранныйЭлемент = ТекДанные.Продукт.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокПродуктов);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаПродуктов", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура УслугиПродуктОчистка(Элемент, СтандартнаяОбработка)
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.Продукт.Очистить();
	
	УслугиПродуктыПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаПродуктов(СписокПродуктов, ДополнительныеПараметры) Экспорт
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	Если СписокПродуктов <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.Продукт.Очистить();
		
		Отказ = Ложь;
		ПовторяющиесяПродукты = Новый Массив;
		
		Для Каждого ЭлементСписка Из СписокПродуктов Цикл
			НомерСтроки = "";
			Если ЭлементСписка.Пометка Тогда
					ТекДанные.Продукт.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Продукт = ТекДанные.Продукт.ВыгрузитьЗначения();
		
		УслугиПродуктыПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПродукты()
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродуктыДКП.Ссылка КАК Ссылка,
		|	ПродуктыДКП.Код КАК Код
		|ИЗ
		|	Справочник.ПродуктыДКП КАК ПродуктыДКП
		|ГДЕ
		|	НЕ ПродуктыДКП.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	ТаблицаПродуктов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПродуктов.ВыгрузитьКолонку("Ссылка");
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
КонецФункции

&НаКлиенте
Процедура УслугиПродуктСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	Продукты = ПолучитьПродукты();
	СписокПродуктов = Новый СписокЗначений;
	СписокПродуктов.ЗагрузитьЗначения(Продукты);
		
	Для Каждого ЭлементСписка Из СписокПродуктов Цикл
		ВыбранныйЭлемент = ТекДанные.Продукт.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокПродуктов);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаПродуктов", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПродуктСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.Продукт.Очистить();
	
	УслугиПродуктыПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПродуктыПриИзмененииСервер(ТекСтрока)
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеПродуктовУслуг(ТекДанные);
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПродуктовУслуг(ТекДанные)
	
	//Евросиб Каблов 26.05.2025 ( # Строки критериев формируются перед записью
	//// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	//СформироватьСтрокиКритериевПоПродуктамТаблицыУслуг(ТекДанные);
	//// Евросиб Рыбьяков К.А. 19.03.2025 ))
	//Евросиб Каблов 26.05.2025 )
	ТекДанные.ПродуктСтрокой = СтрСоединить(ТекДанные.Продукт.ВыгрузитьЗначения(), "; ");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокиКритериевПоПродуктамТаблицыУслуг(СтрокаТЧ)
	// Евросиб US 98207 TA 100593 Рыбьяков К.А. 19.03.2025 ((
	СтрокиКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаТЧ.ИдентификаторСтрокиУслуг));
	
	ЗаполненныеСтроки = Новый Массив;
	Если ЗначениеЗаполнено(СтрокаТЧ.Продукт) Тогда			
		Для Каждого ЭлементСписка Из СтрокаТЧ.Продукт Цикл
			Продукт = ЭлементСписка.Значение;
			НайденныеСтроки = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг, Продукт", СтрокаТЧ.ИдентификаторСтрокиУслуг, Продукт));
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				ЗаполненныеСтроки.Добавить(НайденныеСтроки[0].ПолучитьИдентификатор());
			Иначе
				НоваяСтрока = Объект.КритерииУслуг.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = СтрокаТЧ.ИдентификаторСтрокиУслуг;
				НоваяСтрока.Продукт = Продукт;
				ЗаполненныеСтроки.Добавить(НоваяСтрока.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЦикла;
	Иначе			
		НайденныеСтроки = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг, Продукт", СтрокаТЧ.ИдентификаторСтрокиУслуг, Справочники.ПродуктыДКП.ПустаяСсылка()));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			ЗаполненныеСтроки.Добавить(НайденныеСтроки[0].ПолучитьИдентификатор());
		Иначе
			НоваяСтрока = Объект.КритерииУслуг.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = СтрокаТЧ.ИдентификаторСтрокиУслуг;
			ЗаполненныеСтроки.Добавить(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из СтрокиКритериев Цикл
		Если ЗаполненныеСтроки.Найти(НайденнаяСтрока.ПолучитьИдентификатор()) = Неопределено Тогда
			Объект.КритерииУслуг.Удалить(НайденнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	// Евросиб Рыбьяков К.А. 19.03.2025 ))
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУчетныеНаправленияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ПараметрыОтбораУчетныхНаправлений = Новый Структура;
	ПараметрыОтбораУчетныхНаправлений.Вставить("Дата", ?(ЗначениеЗаполнено(Объект.ДатаПСЦ), Объект.ДатаПСЦ, ТекущаяДата()));
	
	ДоступныеЗначения = ПолучитьУчетныеНаправления(ПараметрыОтбораУчетныхНаправлений);
	ВыбираемыеЗначения = Новый СписокЗначений;
	ВыбираемыеЗначения.ЗагрузитьЗначения(ДоступныеЗначения);
		
	Для Каждого ЭлементСписка Из ВыбираемыеЗначения Цикл
		ВыбранныйЭлемент = ТекДанные.УчетныеНаправления.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", ВыбираемыеЗначения);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаУчетныхНаправлений", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУчетныеНаправления(ПараметрыОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетныеНаправления.Ссылка КАК Ссылка,
		|	УчетныеНаправления.Код КАК Код
		|ИЗ
		|	Справочник.УчетныеНаправления КАК УчетныеНаправления
		|ГДЕ
		|	НЕ УчетныеНаправления.ПометкаУдаления
		|	И (УчетныеНаправления.ДатаНеИспользовать = &ПустаяДата
		|			ИЛИ УчетныеНаправления.ДатаНеИспользовать >= &Дата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Дата", ПараметрыОтбора.Дата);
	
	ТаблицаПродуктов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПродуктов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаУчетныхНаправлений(СписокУчетныхНаправлений, ДополнительныеПараметры) Экспорт
	
	Если СписокУчетныхНаправлений <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.УчетныеНаправления.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокУчетныхНаправлений Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.УчетныеНаправления.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиУчетныеНаправленияПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУчетныеНаправленияСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.УчетныеНаправления.Очистить();
	
	УслугиУчетныеНаправленияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиУчетныеНаправленияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеУчетныхНаправленийСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУчетныеНаправленияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиУчетныеНаправленияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеУчетныхНаправленийСтрокиУслуг(ТекДанные)
	
	ТекДанные.УчетныеНаправленияСтрокой = СтрСоединить(ТекДанные.УчетныеНаправления.ВыгрузитьЗначения(), "; ");
	
КонецПроцедуры

//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025

&НаКлиенте
Процедура УслугиТипоразмерыКТКПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыКТКСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	Типоразмеры = ПолучитьТипоразмерыКТК();
	СписокТипоразмеров = Новый СписокЗначений;
	СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
		
	Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
		ВыбранныйЭлемент = ТекДанные.ТипоразмерыКТК.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокТипоразмеров);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаТипоразмеровКТК", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаТипоразмеровКТК(СписокТипоразмеров, ДополнительныеПараметры) Экспорт
	
	Если СписокТипоразмеров <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ТипоразмерыКТК.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ТипоразмерыКТК.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Типоразмеры = ТекДанные.ТипоразмерыКТК.ВыгрузитьЗначения();
		
		УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыКТКСтрокойОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ТипоразмерыКТК.Очистить();
	
	УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипоразмерыКТК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипоразмерыТЕ.Ссылка КАК Ссылка,
		|	ТипоразмерыТЕ.Код КАК Код
		|ИЗ
		|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|ГДЕ
		|	НЕ ТипоразмерыТЕ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	ТаблицаТипоразмеров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТипоразмеров.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипоразмерыВагонов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТС.Ссылка КАК Ссылка,
	|	ТипоразмерыТС.Код КАК Код
	|ИЗ
	|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|ГДЕ
	|	НЕ ТипоразмерыТС.ПометкаУдаления
	|	И ТипоразмерыТС.Родитель = &ТипоразмерТСПустаяСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("ТипоразмерТСПустаяСсылка", Справочники.ТипоразмерыТС.ПустаяСсылка());
	ТаблицаТипоразмеров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТипоразмеров.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура УслугиТипоразмерыВагоновПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыВагоновСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ТипоразмерыВагоновСтрокой");
	Если ОписаниеПоля <> Неопределено И ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
		Типоразмеры = ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	Иначе
		Типоразмеры = ПолучитьТипоразмерыВагонов();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
		ВыбранныйЭлемент = ТекДанные.ТипоразмерыВагонов.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокТипоразмеров);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаТипоразмеровВагонов", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаТипоразмеровВагонов(СписокТипоразмеров, ДополнительныеПараметры) Экспорт
	
	Если СписокТипоразмеров <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ТипоразмерыВагонов.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ТипоразмерыВагонов.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыВагоновСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ТипоразмерыВагонов.Очистить();
	
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидыОтправокСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ДоступныеЗначения = ПолучитьВидыОтправок();
	ВыбираемыеЗначения = Новый СписокЗначений;
	ВыбираемыеЗначения.ЗагрузитьЗначения(ДоступныеЗначения);
		
	Для Каждого ЭлементСписка Из ВыбираемыеЗначения Цикл
		ВыбранныйЭлемент = ТекДанные.ВидыОтправок.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", ВыбираемыеЗначения);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаВидовОтправок", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаВидовОтправок(СписокВидовОтправок, ДополнительныеПараметры) Экспорт
	
	Если СписокВидовОтправок <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ВидыОтправок.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокВидовОтправок Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ВидыОтправок.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидыОтправокСтрокойОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ВидыОтправок.Очистить();
	
	УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УслугиВидыОтправокПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеВидовОтправокСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВидовОтправокСтрокиУслуг(ТекДанные)
	
	ТекДанные.ВидыОтправокСтрокой = СтрСоединить(ТекДанные.ВидыОтправок.ВыгрузитьЗначения(), "; ");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьВидыОтправок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтправок.Ссылка КАК Ссылка,
		|	ВидыОтправок.Порядок КАК Порядок
		|ИЗ
		|	Перечисление.ВидыОтправок КАК ВидыОтправок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура УслугиВидыОтправокПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЛокацияОказанияУслугиПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиЛокацияОказанияУслугиПриИзмененииНаСервере(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УслугиЛокацияОказанияУслугиПриИзмененииНаСервере(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеЛокацииОказанияУслугиВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеЛокацииОказанияУслугиВСтрокеУслуг(ТекДанные)
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

//Евросиб Шевченко А.В. US 115181 TA 115183 30.07.2025  

&НаСервере
Процедура ПересчетСтавкиЗаКМБезНДС(ТекСтрока) //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ПересчетСтавкиЗаКМБезНДССервер(ТекДанные);	
	
КонецПроцедуры

&НаСервере
Процедура ПересчетСтавкиЗаКМБезНДССервер(ТекДанные) //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
		
	Если ЗначениеЗаполнено(ТекДанные.СтоимостьБезНДС_КТК40) И ЗначениеЗаполнено(ТекДанные.Километраж) Тогда
		ТекДанные.СтавкаЗаКМ40FutБезНДС = ТекДанные.СтоимостьБезНДС_КТК40 / ТекДанные.Километраж;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекДанные.СтоимостьБезНДС_КТК20) И ЗначениеЗаполнено(ТекДанные.Километраж) Тогда
		ТекДанные.СтавкаЗаКМ20FutБезНДС = ТекДанные.СтоимостьБезНДС_КТК20 / ТекДанные.Километраж	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКилометражПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ПересчетСтавкиЗаКМБезНДС(ТекСтрока); //Евросиб Шевченко А.В. US 100317 TA 126448 22.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

