//Евросиб СубботинВ #103435 27.02.2025 Начало
//возвращает признак является ли текущий пользователь исполнителем на каком то из этапов маршрута либо включен ли в группу исполнителей
//для случаев если какое то действие в документе должен выполнять только кто-то из участников маршрута
Функция ПроверитьТекущегоПользователяПоСпискуИсполнителейМаршрута(СсылкаНаОбъектМаршрутизации) Экспорт
	
	ТекущийПользовательУчастникМаршрута = Ложь;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектМаршрутизации) и ЗначениеЗаполнено(СсылкаНаОбъектМаршрутизации.ПримененныйМаршрут)Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь(); 

		Этапы = СсылкаНаОбъектМаршрутизации.ПримененныйМаршрут.Состояния.Выгрузить(,"Исполнитель");
		МассивПользователей = Новый Массив();
		МассивГруппПользователей = Новый Массив();
		Для Каждого СтрокаЭтапа из Этапы цикл
			Если ТипЗнч(СтрокаЭтапа.Исполнитель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда 
				МассивГруппПользователей.Добавить(СтрокаЭтапа.Исполнитель);
			ИначеЕсли ТипЗнч(СтрокаЭтапа.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
				МассивПользователей.Добавить(СтрокаЭтапа.Исполнитель);
			КонецЕсли;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_ПользователиГруппыДКПИсполнителя
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка В(&МассивГруппПользователей)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка В(&МассивПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПользователиГруппыДКПИсполнителя.Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_ПользователиГруппыДКПИсполнителя КАК ВТ_ПользователиГруппыДКПИсполнителя
		|ГДЕ
		|	ВТ_ПользователиГруппыДКПИсполнителя.Пользователь = &ТекущийПользователь";
		
		Запрос.УстановитьПараметр("МассивГруппПользователей", МассивГруппПользователей);
		Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ТекущийПользовательУчастникМаршрута = Истина;
		КонецЕсли;
		
	КонецЕсли;	

	Возврат ТекущийПользовательУчастникМаршрута
	
КонецФункции
//Евросиб СубботинВ #103435 27.02.2025 Конец
