
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда Возврат; КонецЕсли;
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// проверяем вид операции для операций
	Если НЕ ЗначениеЗаполнено(ВидОперации) И МаршрутизируемыйОбъект = Перечисления.МаршрутизируемыеОбъекты.Операция Тогда
		Сообщить("Для операций ""Вид операции"" является обязательным реквизитом!");
		//Отказ = Истина;
	КонецЕсли;
	
	// проверяем вид фин. заявки для фин.заявки
	//Если НЕ ЗначениеЗаполнено(ВидФинЗаявки) И МаршрутизируемыйОбъект = Перечисления.МаршрутизируемыеОбъекты.ФинЗаявка Тогда
	//	Сообщить("Для фин. заявок ""Вид фин. заявки"" является обязательным реквизитом!");
	//	Отказ = Истина;
	//КонецЕсли;
	
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024
	
	Если ЗначениеЗаполнено(Ссылка) Тогда	
		МассивСостояний = Новый Массив;	
		Для Каждого СтрокаДоИзменения Из Ссылка.Ссылка.Состояния Цикл	
			СтруктураПоиска = Новый Структура("Состояние",СтрокаДоИзменения.Состояние);
			НайденныеСтроки = Состояния.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НайденнаяСтрока.Исполнитель <> СтрокаДоИзменения.Исполнитель Тогда
					МассивСостояний.Добавить(НайденнаяСтрока.Состояние);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
		
		Если МассивСостояний.Количество() Тогда
			ПоставитьСвязанныеСМаршрутомПСЦВОчередь(МассивСостояний);
		КонецЕсли;
	КонецЕсли;	
	// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Конец: 27.11.2024
КонецПроцедуры

// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024
Процедура ПоставитьСвязанныеСМаршрутомПСЦВОчередь(МассивСостояний) 
	
	мСтатус = Новый Массив;
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	мСтатус.Добавить(Перечисления.СтатусыЭтапов.Новый);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦСостояния.Ссылка КАК ПСЦ
		|ИЗ
		|	Документ.ПСЦ.Состояния КАК ПСЦСостояния
		|ГДЕ
		|	ПСЦСостояния.Ссылка.Проведен
		|	И ПСЦСостояния.Ссылка.ПримененныйМаршрут = &ПримененныйМаршрут
		|	И ПСЦСостояния.Статус В(&Статус)
		|	И ПСЦСостояния.Состояние В(&Состояние)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПСЦСостояния.Ссылка";
	
	Запрос.УстановитьПараметр("Состояние", МассивСостояний);
	Запрос.УстановитьПараметр("ПримененныйМаршрут", Ссылка);
	Запрос.УстановитьПараметр("Статус", мСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(ВыборкаДетальныеЗаписи.ПСЦ, Ссылка);
	КонецЦикла;	
	
КонецПроцедуры	
// Евросиб(ДИТ) BUG 89279 ТА 89280 Шевченко А.В. Начало: 27.11.2024