
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПовторнаяМаршрутизация(ПараметрКоманды);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПовторнаяМаршрутизация(ПараметрКоманды)

	Если НЕ РольДоступна("ПолныеПрава") Тогда Возврат; КонецЕсли;
	//Для каждого СсылкаДС Из ПараметрКоманды Цикл
	//	//Если СсылкаДС.Маршрутизировать Тогда
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", СсылкаДС.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", СсылкаДС.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", СсылкаДС.ДоговорКонтрагента);
	//		ПараметрыЗапроса.Вставить("ЦФО", СсылкаДС.ЦФО);
	//		ПараметрыЗапроса.Вставить("УспешноРазнесенаВсяСумма", СсылкаДС.УспешноРазнесенаВсяСумма);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПоступлениеНаРС(ПараметрыЗапроса, СсылкаДС.Дата);
	//		Автор = СсылкаДС.Автор;
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			Для каждого Стр из  РезультатЗапроса Цикл
	//				Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) Тогда Стр.Исполнитель = Автор; КонецЕсли;
	//				Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) Тогда Стр.Наблюдатель = Автор; КонецЕсли;
	//			КонецЦикла;
	//			ОбъектДС = СсылкаДС.ПолучитьОбъект();
	//			МаршрутизацияСервер.ПрименитьМаршрут(ОбъектДС, РезультатЗапроса, Автор, Новый СписокЗначений);
	//			ОбъектДС.Записать();
	//		Иначе
	//			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//		КонецЕсли;
	//		
	//	//КонецЕсли;
	//КонецЦикла; 


КонецПроцедуры // ПовторнаяМаршрутизация()
 