
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РецензируемыйДокумент = Параметры.РецензОбъект;
	Замечания.Параметры.УстановитьЗначениеПараметра("РецензОбъект", неопределено);
	Замечания.Параметры.УстановитьЗначениеПараметра("Рецензент", Пользователи.ТекущийПользователь());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОФайлах.ВладелецФайла КАК ВладелецФайла,
	               |	СведенияОФайлах.Файл КАК Файл
	               |ИЗ
	               |	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
	               |ГДЕ
	               |	СведенияОФайлах.ВладелецФайла = &ВладелецФайла
	               |	И НЕ СведенияОФайлах.ПометкаУдаления
	               |	И НЕ СведенияОФайлах.Служебный";
	Запрос.УстановитьПараметр("ВладелецФайла", РецензируемыйДокумент);
	Файлы.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Файл"));
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.Файлы.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		Замечания.Параметры.УстановитьЗначениеПараметра("РецензОбъект", ТекД.Значение);
		//ОпОп = Новый ОписаниеОповещения("ПолученФайл", ЭтаФорма);
		//ПрочитатьНаСервере(ТекД.Значение);
		
		//РаботаСФайламиКлиент.ПолучитьПрисоединенныйФайл(ОпОп, ТекД.Значение,ЭтаФорма.УникальныйИдентификатор,неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере(ФайлЪ)
	
	ДД = РаботаСФайлами.ДвоичныеДанныеФайла(ФайлЪ);
	ИВФ = ПолучитьИмяВременногоФайла(ФайлЪ.Расширение);
	ДД.Записать(ИВФ);
	ТД.Прочитать(ИВФ);
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученФайл(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если СтрЗаканчиваетсяНа(ВРЕГ(П1.ПолноеИмяФайла), "DOC") ИЛИ СтрЗаканчиваетсяНа(ВРЕГ(П1.ПолноеИмяФайла), "DOCX") ИЛИ СтрЗаканчиваетсяНа(ВРЕГ(П1.ПолноеИмяФайла), "RTF") Тогда
		Состояние("Попытка открыть файл с использованием Microsoft Word...");
		Word = new COMОбъект("Word.Application");
		Попытка
			Doc = Word.Documents.Open(П1.ПолноеИмяФайла);
			ИВФ = ПолучитьИмяВременногоФайла("html");
			Doc.SaveAs(ИВФ, 8);
			ТД = ИВФ;
		Исключение
			Сообщить("Ошибка при открытии файла через Word...");
		КонецПопытки;
		Попытка
			Word.Quit();
		Исключение
		КонецПопытки;
//	ИначеЕсли СтрЗаканчиваетсяНа(ВРЕГ(П1.ПолноеИмяФайла), "XLS") ИЛИ СтрЗаканчиваетсяНа(ВРЕГ(П1.ПолноеИмяФайла), "XLSX") Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученФайл2(П1 = неопределено, П2 = неопределено) Экспорт
	
	ОпОп = Новый ОписаниеОповещения("УдалитьФайлПослеЗакрытия", ЭтаФорма, П1.ПолноеИмяФайла);
	
	НачатьЗапускПриложения(ОпОп, П1.ПолноеИмяФайла,,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлПослеЗакрытия(П1 = неопределено, П2 = неопределено) Экспорт
	//Попытка
	//	УдалитьФайлы(П2);
	//Исключение
	//КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = истина;
	ТекД = Элементы.Файлы.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("ОбновитьСписок", ЭтаФорма);
		ПараметрыФормы = Новый Структура("РецензОбъект", ТекД.Значение);
		ВыделенныйТекст = "";
		Попытка
			ВыделенныйТекст = Элементы.ТД.Документ.selection.createRange().text;
		Исключение
		КонецПопытки;
		ПараметрыФормы.Вставить("ИсходныйТекст", ВыделенныйТекст);
		ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласованииЗамечание", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбновитьСписок(П1 = неопределено, П2 = неопределено) Экспорт
	
	Элементы.Замечания.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьWord(Команда)
	
	ТекД = Элементы.Файлы.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("ПолученФайл", ЭтаФорма);
		РаботаСФайламиКлиент.ПолучитьПрисоединенныйФайл(ОпОп, ТекД.Значение,ЭтаФорма.УникальныйИдентификатор,неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВнешнейПрограммой(Команда)
	
	ТекД = Элементы.Файлы.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("ПолученФайл2", ЭтаФорма);
		РаботаСФайламиКлиент.ПолучитьПрисоединенныйФайл(ОпОп, ТекД.Значение,ЭтаФорма.УникальныйИдентификатор,неопределено);
	КонецЕсли;

КонецПроцедуры
