Функция ConfirmReceiptDocuments(XMLParams)
	
	Возврат ЕСОбменСервер.ПодтвердитьЗагрузку(XMLParams);

КонецФункции

Функция GetFullDataPTU(XMLParams)
	
	Возврат ЕСОбменСервер.ПередатьДанныеПоПТУ(XMLParams);
	
КонецФункции

Функция GetFullDataSchet(XMLParams)

	Возврат ЕСОбменСервер.ПередатьДанныеПоСчетамДляЗаказа(XMLParams);
	
КонецФункции

Функция GetFullDataVSF(XMLParams)

	Возврат ЕСОбменСервер.ПередатьДанныеПоВСФ(XMLParams);
	
КонецФункции

Функция GetListISF(XMLParams, DocType)
	
	Возврат ЕСОбменСервер.ПередатьСписокИсходящихДокументов(XMLParams, DocType);
	
КонецФункции

Функция GetFullDataISF(XMLParams, DocType)
	
	Если DocType = "РеализацияТоваровУслуг" Тогда
		Возврат ЕСОбменСервер.ПередатьДанныеПоИСФ(XMLParams);
	ИначеЕсли DocType = "ОтчетКомитентуОПродажах" Тогда
		Возврат ЕСОбменСервер.ПередатьДанныеПоОтчетуКомитенту(XMLParams);
	ИначеЕсли DocType = "КорректировкаРеализации" Тогда
		Возврат ЕСОбменСервер.ПередатьДанныеПоКоррИСФ(XMLParams);
	КонецЕсли; 

КонецФункции

Функция PutPayments(XMLParams)
	
	Возврат ЕСОбменСервер.ЗаписатьОплаты(XMLParams);
	
КонецФункции

Функция GetFullDataKorrPTU(XMLParams)

	Возврат ЕСОбменСервер.ПередатьДанныеПоКоррПТУ(XMLParams);
	
КонецФункции

Функция PutDebtCorrections(XMLParams)
	
	Возврат ЕСОбменСервер.СоздатьКД(XMLParams);
	
КонецФункции

Функция PutBankRecords(XMLParams)
	
	Возврат ЕСОбменСервер.СоздатьБанковскиеВыписки(XMLParams);
	
КонецФункции

Функция PutDocumentEntry(XMLParams)
	
	Возврат ЕСОбменСервер.ОтметитьПроведениеДокументаВБухУчете(XMLParams);
	
КонецФункции

Функция UpdateCashFlowPlan(XMLparams)
	
	Возврат ЕСОбменСервер.ЗаписатьИзмененияВПланДДС(XMLParams);
	
КонецФункции

Функция GetAcceptList(XMLParams)
	Возврат ЕСОбменСервер.ПередатьСписокАкцептов(XMLParams);
КонецФункции

Функция GetFullDataAccept(XMLParams)
	Возврат ЕСОбменСервер.ПередатьДанныеПоАкцептам(XMLParams);
КонецФункции

Функция GetVSFList(XMLParam)
	Возврат ЕСОбменСервер.ПередатьСписокВходящихДокументов(XMLParam);
КонецФункции

Функция GetVAT0Confirmation(xmlParam)
	Возврат ЕСОбменСервер.ПередатьСписокПодтвержденийИСФНДС0(xmlParam);
КонецФункции

Функция GetRegistryVAT(xmlParam)  
	//Евросиб(ДИТ) Антонова А.С. US 90779 Начало 20.05.2025
	//Было:
	//Возврат ЕСОбменСервер.ПередатьРеестрНДС(xmlParam);
	//Стало:
	Если Константы.ВыгрузкаРеестровНДСИзРН.Получить() = Истина Тогда
	    Возврат ЕСОбменСервер.ПередатьДанныеПоРеестрамНДС(xmlParam);
	Иначе
		Возврат ЕСОбменСервер.ПередатьРеестрНДС(xmlParam);
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 Конец 20.05.2025
	
КонецФункции

Функция GetListCategoriesOfContracts(xmlParam)
	
	Возврат ЕСОбменСервер.ПолучитьСписокКатегорийДоговоров(xmlParam);
	
КонецФункции

Функция SetClosedPeriodDate(Date)
//	Константы.ДатаПериодаЗагрузкиОДВУПП.Установить(КонецДня(Date)+1);
//Евросиб Гудкова( 25.12.2020 Ticket№ 0204559
	//Евросиб Каблов 09.04.2025 ( #105407
	//Возврат Константы.ДатаПериодаЗагрузкиОДВУПП.Получить();
	Возврат КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодБУ();
	//Евросиб Каблов 09.04.2025 ( #105407	
// Евросиб Гудкова) 
КонецФункции

Функция SetAccountingComment(Id, Comment)
	
	Возврат ЕСОбменСервер.ЗаписатьКомментарийБухгалтерии(Id, Comment);
	
КонецФункции

Функция PutInvoice(XMLParams)
	
	Возврат ЕСОбменСервер.СоздатьСчетПоставщика(XMLParams);
	
КонецФункции

Функция PutDebtBalance(XMLParams)
	Возврат ЕСОбменСервер.СоздатьКДНаОстаток(XMLParams);
КонецФункции

Функция PutCashFlowPlans(XMLParams)
	
	Возврат ЕСОбменСервер.СоздатьПланыПоступленийСписаний(XMLParams);
	
КонецФункции

//Евросиб Дубская 16.03.2023 ( Для отчета НЗП
Функция GetAcceptListWIP(XMLParams)
	
	Возврат ЕСОбменСервер.ПередатьСписокАкцептовДляОтчетаНЗП(XMLParams);
	
КонецФункции //Евросиб Дубская 16.03.2023 )

//Евросиб Каблов 14.02.2024 Ticket#0317695
Функция GetUnregulatedFlow(XMLParams)
	
	Возврат ЕСОбменСервер.ПолучитьНеурегулированныеРасходы(XMLParams);
	
КонецФункции

Функция PutDocumentStatus(XMLParams)
	Возврат ЕСОбменСервер.УстановитьСтатусДокумента(XMLParams);
КонецФункции

// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. 29.07.2024
Функция GetDocumentStatus(XMLParams)
	Возврат ЕСОбменСервер.ПолучитьСтатусДокумента(XMLParams);
КонецФункции

//Евросиб Каблов 25.09.2025 ( #104972
Функция GetWIP(XMLParams)
	
	Возврат ЕСОбменСервер.ПолучитьНЗП(XMLParams);
	
КонецФункции



