Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор 		= Пользователи.ТекущийПользователь();
	ЦФО 		= Автор.ЦФО;
	Создано 	= ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор 	= Пользователи.ТекущийПользователь();
	Изменено 	= ТекущаяДата();
	
	//Если Продукты.Количество() > 0 Тогда
	//	ДатаНачала = Продукты[0].ПлановаяДатаУслуги;
	//	ДатаОкончания = Продукты[0].ПлановаяДатаУслуги;
	//	Для каждого Стр из Продукты Цикл
	//		ДатаНачала = Мин(ДатаНачала, Стр.ПлановаяДатаУслуги);
	//		ДатаОкончания = Макс(ДатаОкончания, Стр.ПлановаяДатаУслуги);
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	
КонецПроцедуры
