
Процедура ПередЗаписью(Отказ, Замещение)
	//Сообщить("ПишемНабор");
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		СтрокаНабора.ДатаУстановкиБлокировки = МинимумИзТрех(СтрокаНабора.ДатаДругое,СтрокаНабора.ДатаПросроченСВВ,СтрокаНабора.ДатаПоврежден);
	КонецЦикла;
КонецПроцедуры

Функция МинимумИзТрех(Значение1,Значение2,Значение3)
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Значение");
	Если ЗначениеЗаполнено(Значение1) Тогда
		ТаблицаСортировки.Добавить().Значение = Значение1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Значение2) Тогда
		ТаблицаСортировки.Добавить().Значение = Значение2;
	КонецЕсли;
	Если ЗначениеЗаполнено(Значение3) Тогда
		ТаблицаСортировки.Добавить().Значение = Значение3;
	КонецЕсли;
	
	ТаблицаСортировки.Сортировать("Значение Возр");
	Если ТаблицаСортировки.Количество() Тогда
		Возврат ТаблицаСортировки[0].Значение;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
КонецФункции

